{
  "article_id": "000390d9d8c1",
  "url": "https://royalbluemersey.sbnation.com/2023/9/11/23865619/everton-news-round-up-tom-davies-sheffield-demarai-gray-al-ettifaq-andre-gomes-transfer-latest",
  "title": "Monday Everton News : Davies & Gray talk about departures , Andre Gomes latest",
  "date": "20230911T073000Z",
  "domain": "royalbluemersey.sbnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Monday’s Everton News: Davies & Gray talk about departures, Andre Gomes latest\nRecapping all the Everton news from the weekend\nYour daily dose of Everton news and rumours\nThe RBM team take a look at Everton’s summer transfer business in the goalkeeper and defender summer transfer window. [RBM]\nThe RBM crew also did the same by looking at the midfielder and forward positions. [RBM]\nThe Under-21s, Under-18s and the senior squad have shared similar struggles early on in the season. [RBM]\n“When Dominic Calvert-Lewin is fit again, Everton will have to get him and Beto both in the team somehow. This is the biggest challenge Sean [Dyche] has ever faced in management and that includes keeping Burnley in the Premier League,” says former Blue Andy Gray. [Daily Mail]\nEverton Women fall to Leicester City 3-2. [EFC]\nDan Meis talks about the continued progress on Everton’s new stadium. [Echo]\n“I think it was time for me to move on, and speaking to the manager there, I felt like I wanted the new challenge, opportunity and feel of something completely different...I’m disappointed with how I separated from Everton because they gave me some great moments as we had to fight off relegation for two years and we managed to stay up. I wished them the best, I made some good friends there, but that chapter is over now,” says Demarai Gray. [The Gleaner]\nU18s defeat Fleetwood Town 2-0. [EFC]\nEverton are reportedly still pushing to ship out Andre Gomes, with the Turkish transfer window open until Friday. [Football Insider]\n“I think it was extremely brave of Dele to come out and give the interview he gave...it was eye-opening for me to hear that. I texted him afterwards and said how much I think what he did will help a lot of people as well feel comfortable in sharing their feelings and sharing what they’ve been through. I caught up with Dele in the summer but that was before the interview. He seemed to be on a good track. I know he’s been working hard to get fit. I can’t wait to hopefully see him back out playing football again. I think he is definitely in a better place now. He’s still got a lot of time left in his career and I’m one person who really hopes he can get back on track and see him playing week in, week out,” says his former teammate Harry Kane. [ESPN]\nCheck out some clips from the Blues in training, with a certain Irish fullback making a long-awaited appearance.\nAmadou Onana played the full 90 in Belgium’s 1-0 win over Azerbaijan, while Jordan Pickford and Vitaliy Mykolenko squared off in a 1-1 draw between England and Ukraine. [EFC]\n“It’s hard for a footballer to reach their potential when they are constantly being changed around and there is people coming and going and you’re trying to make connections with different team-mates, different managers, different formations. For me, I think that [stability] is a big thing I need and just knowing I fit into a team and they want me to be here for the player I am. That then gives you the confidence to express yourself on the pitch...it is always difficult leaving your first club and your boyhood club, but it’s one [decision] I am happy I’ve made and I’m glad to be here,” says Tom Davies. [Echo via Stadium Astro]\nHow well do you know new signing Beto? [EFC]\nWhat to Watch\nPlenty of UEFA Euro Qualifiers and CONCACAF Nations League action on today.\nFull schedule of games here.",
  "word_count": 595,
  "scraped_at": "2026-02-14T13:09:34.363249"
}