{
  "article_id": "000acb1d7ad1",
  "url": "https://www.uefa.com/nationalassociations/ESP/",
  "title": "Developing football in Spain",
  "date": "20240408T061500Z",
  "domain": "uefa.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Developing football in Spain\nArticle summary\nThe Royal Spanish Football Federation continues to set new standards for European football development, on and off-the-pitch.\nArticle top media content\nArticle body\nOverview\nSpain has a football youth system that is the envy of the game, with national teams in both the men’s and women’s game serial winners at Under-21, Under-19 and Under-17 levels for the past three decades. The Royal Spanish Football Federation’s (RFEF) ability to nurture the talented generation of David Villa, Iker Casillas, Xavi Hernández, Andrés Iniesta and Fernando Torres underlay Spain’s victory in an unprecedented three successive international tournaments from 2008 to 2012.\nDespite such success, the national association is constantly looking forward, guided by a long-term strategic plan to further develop the game at national and regional levels. The RFEF aims to be best in class, not only in terms of performances on the pitch, but also off it, pushing the envelope in:\n- the organisation of competitions\n- corporate management\n- social responsibility\nLike many other European national associations, accelerating the development of women’s football is a key priority for the RFEF. The association hopes the inspirational record of its women’s national teams will help make football more popular than basketball among young girls.\nAt junior level, Spain won the FIFA Women’s U-17 World Cup in 2018 and has claimed four of the last 11 UEFA European Women’s Under-17 European Championship trophies. At the 2019 FIFA Women’s World Cup in France, Spain were only eliminated by the narrow score of 2-1 against eventual champions the United States in the round of 16. Hosting the 2020 UEFA Women’s Champions League final tournament in Bilbao also boosted the women’s game in Spain.\nThe RFEF has also taken two steps to ensure there is a clear career path for female professional footballers in Spain:\n1. granting professional status to the top two tiers of Spanish women’s league football;\n2. establishing a national minimum salary for women playing in the top flight.\nDuring the pandemic, the RFEF medical team, including doctors and sports psychologists, used their expertise to support the public health service, while the association offered its facilities for use as a vaccination centre to deliver the COVID-19 vaccine. The RFEF also purchased millions of coronavirus tests to ensure that football matches could take place with minimal risk of infection.\nUEFA support\nUEFA's HatTrick programme, which channels EURO funds into football development across Europe, supports the RFEF's strategic goal of strengthening the game nationally by working regionally.\nEURO revenue helped to implement Programa Avanza – the modernisation of the 19 Spanish regional federations responsible for organising amateur football across the country, as well as lower league competitions. By supporting and strengthening these federations, the RFEF aimed to increase participation rates across the country and invest in new areas of the game. HatTrick funding facilitated improvement of regional competition, youth player and women’s football development, referee training, the renovation of infrastructure and new social responsibility programmes.\nAs part of its commitment to using the power of football to promote change in society, the Spanish association is drawing on HatTrick funding to implement an innovative social responsibility project: establishing football academies at 39 Spanish prisons to help rehabilitate inmates.\nCompetitions will give 38,000 inmates the chance to play in penitentiary competitions, with some also training as football instructors and referees.\nTimeline\nAssociation history\nNational team competitions\nPresident\nRafael Louzán\nNationality: Spanish\nDate of birth: 21 November 1967\nPresident since: 2024\nGeneral secretary\nÁlvaro de Miguel Casanueva\nNationality: Spanish\nDate of birth: 19 April 1989\nGeneral secretary since: 2024",
  "word_count": 596,
  "scraped_at": "2026-02-14T12:52:38.490372"
}