{
  "article_id": "001018388216",
  "url": "https://www.thenationalnews.com/news/europe/2025/05/28/verdict-expected-in-paris-trial-of-former-syrian-rebel-spokesman/",
  "title": "Verdict expected in Paris trial of former Syrian rebel spokesman",
  "date": "20250528T131500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A French court on Wednesday sentenced a former Syrian Islamist rebel to 10 years in prison for his role in atrocities committed in Syria's civil war, in the country's first universal justice case.\nMajdi Nema, a former spokesman of the rebel group Jaish Al Islam, was found guilty by a Paris court of complicity in war crimes, specifically of conscription of minors aged 15 to 18, and helping to prepare war crimes.\nIn his last statement to the jury before it withdrew to deliberate, Nema, 36, repeated his innocence but did not address the charges that had been issued against him.\nNema, who has spent five years in pretrial detention in France after his arrest in the southern city of Marseille during a student exchange programme, said he wanted to return to Syria.\n\"I would like you to differentiate between me and Jaish Al Islam,\" he said. The group, which was one of the main opposition groups fighting the former president Bashar Al Assad's government, has been integrated into the new Defence Ministry.\nNema initially faced 20 years in prison but some of the charges were dropped by the jury.\nSyrians who testified at the trial said they felt divided over the fate of Nema, who left Jaish Al Islam in 2016 and was based for the most part of his job as spokesman in Turkey.\nSpeaking anonymously out of fear for their safety, one said that Nema had “paid enough” by spending five years in pretrial detention and that he cared little if he was released now.\nSpeaking before the verdict, Anas Al Kholi, a civil party in the case who was imprisoned by Jaish Al Islam, said that he hoped Nema would get the maximum sentence because of his prominent role in the group, which probably involved information about its crimes.\nNema was initially arrested for charges involving the disappearance of four prominent human rights activists who were probably kidnapped by Jaish Al Islam in a Damascus suburb in 2013. Those charges were dropped in 2023, largely for procedural reasons.\nSyrian activists had hoped that he would give information about their fate at the trial, which did not happen. Jaish Al Islam has always rejected accusations of involvement in their disappearance. Relatives, some of whom believe they were killed in captivity, say they have proof that senior officials ordered the kidnapping but that the leadership was told after it happened.\nThis was the first time that crimes committed during Syria's civil war were tried in France under the universal jurisdiction, which allows states to prosecute suspects accused of serious crimes regardless of where they were committed.",
  "word_count": 438,
  "scraped_at": "2026-02-14T12:11:25.483527"
}