{
  "article_id": "001de3f45264",
  "url": "https://news.yahoo.com/gianni-infantino-wants-women-world-140958073.html",
  "title": "Gianni Infantino wants Women World Cup prize money to match men by 2027",
  "date": "20230316T144500Z",
  "domain": "news.yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Gianni Infantino wants Women’s World Cup prize money to match men’s by 2027\nFIFA president Gianni Infantino wants equal prize money for the men’s and women’s World Cups in 2026 and 2027 but called on broadcasters to pay more for the rights to the women’s finals.\nInfantino confirmed a total payments package of 152 million US dollars (£126m) for this year’s World Cup in Australia and New Zealand, inclusive of team preparation funding and club release payments.\nThat is still some way short of the reported 440m US dollars (£365m) prize money on offer to teams at last year’s men’s finals in Qatar, but Infantino is determined to bridge the gap – if broadcasters and sponsors step up.\nThis is the objective that we set to ourselves. FIFA is stepping up with actions, not just with words.\nGianni Infantino on ambition for equal World Cup payments\nHe said that in some cases, the offers for the Women’s World Cup rights were 100 times lower than for the men’s tournament.\n“Our ambition is to have equality in payments for the 2026 men’s and 2027 women’s World Cup,” Infantino told the FIFA Congress in Rwanda after he had been elected unopposed for a new four-year term.\n“This is the objective that we set to ourselves. FIFA is stepping up with actions, not just with words. But unfortunately this is not the case of everyone across the industry.\n“Broadcasters and sponsors have to do more. FIFA is receiving between 10 and 100 times inferior offers for the Women’s World Cup.\n“These same public broadcasters who are paid by taxpayers’ money, they criticise FIFA for not guaranteeing equal pay to men and women.\n#FIFPRO, its member unions, and the players welcome FIFA’s announcement regarding conditions and prize money for the 2023 Women’s World Cup following a letter signed by #FIFPRO and 150 players from 25 national teams calling for change. pic.twitter.com/entKDTiy2u\n— FIFPRO (@FIFPRO) March 16, 2023\n“You pay us 100 times less, (but) your viewing figures are similar. Maybe 20, 25 per cent less for the women than the men, not 100 per cent. Well offer us 20 times less, offer us 50 times less, but not 100 times less.\n“We need to all be on the same side in this fight for equality.”\nWorld players’ union FIFPRO welcomed Infantino’s words, adding in a statement: “The progress announced today demonstrates the intent of the players and FIFA to work proactively towards greater equity and equality for the industry.”\nTeams competing at this year’s finals have already been guaranteed equal conditions as their male counterparts in Qatar in terms of accommodation, travel, training facilities and delegation size.\nIn the UK, the BBC and ITV are yet to announce confirmation of coverage plans for this summer’s finals.\nInfantino confirmed Visit Saudi would not be a sponsor of the tournament in Australia and New Zealand, but described the controversy around the issue as “a storm in a teacup” and accused critics of the reported deal of having “double standards”.\nThe host associations of Australia and New Zealand had spoken of their concern that the company was reportedly in discussions with FIFA over sponsoring the tournament, given Saudi Arabia’s record on women’s and LGBTQ+ rights.\n“There were discussions with Visit Saudi and in the end this discussion did not lead to a contract,” Infantino said at a press conference in Kigali.\n“So there was a storm in a teacup. There isn’t anything bad in making sponsorships from Saudi Arabia, from China, from the United States, from Brazil or from India.\n“FIFA is a global organisation. I understand when it comes to Australia that Australia has trade with Saudi Arabia of around one and a half billion. This doesn’t seem to be an issue.\n“There is a double standard there which I don’t understand.”\nFootball Australia chief executive James Johnson said: “We welcome clarification from FIFA regarding Visit Saudi.\n“Equality, diversity and inclusion are really deep commitments for Football Australia and we’ll continue to work hard with FIFA to ensure the Women’s World Cup is shaped in this light and it is a historic event for our nation, showcasing the world’s greatest female players and advancing the game globally.”",
  "word_count": 701,
  "scraped_at": "2026-02-14T13:45:18.872557"
}