{
  "article_id": "0031e3310634",
  "url": "https://www.theguardian.com/australia-news/2025/nov/27/morning-mail-thursday-ntwnfb",
  "title": "Morning Mail : Hong Kong tower block inferno , John Kerry advice to Australia , survivor tells of Chilean mountain horror hike | Australia news",
  "date": "20251126T204500Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Morning everyone. A huge fire has ripped through several high-rise housing blocks in Hong Kong. At the time of writing the official death toll is still rising, with 36 confirmed killed and 279 missing.\nIn a Guardian exclusive, John Kerry, the former US secretary of state, gives detailed advice on how Australia can use its Cop presidency to phase out fossil fuels.\nPlus: Donald Trump’s immigration policies come home to roost for his spokeswoman, and we have the gripping story of how a Sydney woman survived the Chilean trekking disaster.\nAustralia\n-\nGas ‘bandits’ | Yesterday’s inflation figures are a cause for concern for consumers, the RBA and the government. The only people who won’t be concerned are company executives, writes Greg Jericho, who are “making out like bandits” as profits rise and taxes stand still.\n-\nExclusive | Australia should use its role as leader of the next UN Cop summit to gather the world’s 25 biggest greenhouse gas emitting countries and push them to draw up a roadmap to end the era of fossil fuels, former US secretary of state John Kerry has said. His warning comes as official figures show Australia’s emissions fell 2.2% last financial year.\n-\nPay difference | Australia’s gender pay gap narrowed further in 2025, but women still earn on average about $28,000 a year less than men, the latest snapshot reveals today.\n-\nScam alert | So-called “ghost store” operators are taking advantage of Christmas and Black Friday to lure shoppers to their websites, as the consumer regulator warns that artificial intelligence is making it even harder to identify deceptive retailers.\n-\nAukus ‘closed shop’ | The Aukus nuclear submarine deal and Australia’s involvement in military conflicts will be considered by a secretive new committee of federal parliament, dubbed a “closed shop” by the Greens over plans to exclude minor parties and independents.\nWorld\n-\nHong Kong fire | At least 36 people have died and dozens were injured after a massive fire engulfed several high-rise towers of a residential complex in Hong Kong’s northern Tai Po district. Police said some people were trapped in the buildings, which are home to more than 4,000 people.\n-\nReeves rally | The British chancellor, Rachel Reeves, has declared her budget will slash living costs for millions but will increase taxes by £26bn to plug a gaping shortfall in the public finances. The day was marked by an embarrassing leak of the whole budget before her Commons speech, which was supposed to reveal it.\n-\nClose to home | The family of White House spokeswoman Karoline Leavitt has become embroiled in Donald Trump’s immigration crackdown with the mother of her nephew detained by agents in Massachusetts.\n-\n‘Russia wrote it’ | Americans involved in the Ukrainian war effort have expressed outrage about the Trump administration’s latest peace plan, while both sides of politics condemned Steve Witkoff’s call with a Putin adviser amid an effort to find who leaked the details. Follow US politics live.\n-\n‘Humiliation and control’ | More than 200 women in France have alleged that they were drugged with a diuretic by a senior French civil servant at interviews to exercise what a lawyer for the women says was “power and domination over women’s bodies … through humiliation and control”.\nFull Story\nAustralia’s most notorious fugitive: where is Dezi Freeman?\nThree months after he went missing in Porepunkah, police appear no nearer capturing Dezi Freeman. Nino Bucci tells Reged Ahmad about the unease felt by those living in the Victorian town, and theories about where he might be.\nIn-depth\nFor Emily Dong and a group of about 30 hikers from all over the world, walking the O Circuit trail at Torres del Paine in Chilean Patagonia last week was the adventure of a lifetime. But a fierce blizzard with winds up to 190km/h, a wind chill of -20C, and chaotic organisation by park rangers turned the trek into a tragedy and left five people dead. Emily tells Caitlin Cassidy the “terrifying” story of how she survived. “Every single one of us was so grateful to be alive when we got down.”\nNot the news\nWe have been granted a sneak preview of Room Service, an eclectic collection of performances, paintings and installations staged amid the “cinematic beauty” of the former P&O Hotel in Fremantle. Co-curator Danielle Caruana tells Rosamund Brennan the project “activates our greatest asset of all, which is our ideas”.\nSport\n-\nCricket | After destroying England in Perth, Kerry O’Keeffe has called Mitchell Starc “one of the most underrated cricketers” Australia has ever produced. It’s hard to disagree, says Tanya Aldred.\n-\nFootball | The big Champions League clash is at the Emirates where Arsenal entertain Bayern Munich, while Atlético host Inter, and Spurs travel to PSG.\n-\nCommonwealth Games | Ahmedabad has vowed not to make the same mistakes as Delhi after being confirmed as the host of the 2030 Commonwealth Games.\nMedia roundup\nWith Barnaby Joyce about to defect to One Nation, the Sydney Morning Herald claims senior Nationals Michael McCormack and Matt Canavan have urged the former leader to stay put. The Age reports that the streaming giant behind AFL coverage feels it is paying too much for the rights, leaving the league with the threat that it could pull the plug. Brisbane NRL bosses have defended the club’s branding decision to drop the Broncos name from its new logo, the Courier Mail says.\nWhat’s happening today\n-\nHealth | Breast Cancer Network Australia launches a report on metastatic breast cancer cases.\n-\nVictoria | Premier Jacinta Allan to deliver State of the State address in Melbourne.\n-\nMedia | Walkley winners announced this evening.\nSign up\nIf you would like to receive this Morning Mail update to your email inbox every weekday, sign up here, or finish your day with our Afternoon Update newsletter. You can follow the latest in US politics by signing up for This Week in Trumpland.\nBrain teaser\nAnd finally, here are the Guardian’s crosswords to keep you entertained throughout the day. Until tomorrow.",
  "word_count": 1013,
  "scraped_at": "2026-02-14T12:50:51.860275"
}