{
  "article_id": "003d9cd385ad",
  "url": "https://www.hogshaven.com/2025/5/22/24431377/daily-slop-22-may-25-dont-panic-about-report-that-terry-mclaurin-missed-wednesdays-otas",
  "title": "WFT News : Washington Commanders News Links",
  "date": "20250522T141500Z",
  "domain": "hogshaven.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Daily Slop - 22 May 25 - Don’t panic about report that Terry McLaurin missed Wednesday’s OTAs\nA collection of articles, podcasts & tweets from around the web to keep you in touch with the Commanders, the NFC East, the NFL and sports in general, and a sprinkling of other stuff\nArticles\nCommanders wide receiver Terry McLaurin did not participate in the team’s voluntary offseason program Wednesday, Jordan Schultz of Fox Sports reports.\nMcLaurin had been a full participant previously, per Schultz, so it is unclear whether his absence was related to his desire for a contract extension.\nThe start of Phase 3 of the program next week will give a better indication about whether McLaurin is making a statement.\nMcLaurin skipped the voluntary offseason program in 2022 before the sides agreed to a three-year, $69.6 million deal in early July.\nHBO and the NFL announced on Wednesday that the NFC East will be focus of the in-season version of “Hard Knocks,” which will debut in December. It is the second year that HBO and the NFL have featured an entire division, with the AFC North being the main attraction in 2024.\nNew episodes featuring the Commanders, Philadelphia Eagles, Dallas Cowboys and New York Giants will stream on HBO Max every Tuesday in December and continue into the playoffs in 2026.\nThe Buffalo Bills will be the focus for this year’s training camp edition of “Hard Knocks.”\nPrior to the announcement, the Commanders were one of seven teams to not be featured on “Hard Knocks,” which began in 2001 with the Baltimore Ravens. It will be the first appearance for the Eagles, who are still fresh off their Super Bowl win over the Kansas City Chiefs. The Cowboys have been on “Hard Knocks” three times, the most recent coming in 2021. The Giants have never been part of the training camp edition of the show but were featured on the offseason edition in 2024.\nThe decision by the NFL and HBO to feature the NFC East, which has not had a repeat winner since 2004, is the latest example of the Commanders getting more room in the national spotlight. They were given eight standalone games for the 2025 season, including matchups on Christmas Day and in the first-ever game to be played in Spain. They also have five primetime games, which is tied for the second-most in the league this year.\nSports IllustratedWhat if Washington Commanders’ $18 million star is past his prime?\nInstead of signing big names in free agency, the Commanders’ GM opted to go out and spend some capital to get some, bringing in receiver Deebo Samuel and offensive tackle Laremy Tunsil in the process.\nWhile there are mixed opinions about what Washington is getting with those two, there’s another trade acquisition who might present the team with its biggest roster decision of 2025, at least according to Sports Illustrated’s John Pluym, who asks: What happens if Marshon Lattimore struggles?\n“Lattimore is a four-time Pro Bowler, but he’s struggled to stay healthy and it’s fair to wonder if his best days are behind him,” says Pluym. “Washington gave up a slew of draft picks for him at the trade deadline last year, including third-, fourth- and sixth-round selections. Lattimore has played only 26 games over the past three seasons, and should the Commanders release him, they’d save $34.5 million over the next two years with $2 million in dead money.”\nFor the Commanders, part of the plan is to get Conerly up to speed as quickly as possible so he can get in the starting lineup and protect quarterback Jayden Daniels at some point in the 2025 season. The Commanders haven’t ruled out anything for Conerly, aside from playing left tackle, but regardless of where he ends up, they’re confident he can help elevate their performance up front.\nBut head coach Dan Quinn doesn’t want the rookie thinking about that right now, and Conerly isn’t looking that far ahead. For now, he’s fine with working on his skill set and (quickly) getting up to speed on Washington’s offense.\nThere’s no timetable for when Conerly will be ready for a starting job, and the Commanders are not giving away their plans. Still, Conerly is doing all he can to improve, and that starts with working alongside offensive line coach Bobby Johnson. It shouldn’t come as a surprise at this point in the offseason that Johnson is covering all the basics with the rookie.\n“We’ve really just been working a little bit of everything,” Conerly said. “Mainly install stuff and just making sure I’ve got all the plays down.”\nPro Football FocusPFF Quarterback Rankings: All 32 starters ahead of the 2025 NFL season\nTier 2: High-End Starters\nJalen Hurts’ 2024 campaign — capped by an impressive Super Bowl run — was a return to form after a turbulent 2023 season. A year earlier, Hurts too often pressed in high-leverage moments and struggled under pressure, but he flipped the script this past season, showing poise and control even when things broke down around him. After a slow start, he found his rhythm and delivered when it mattered most. Over the past three seasons, his 91.5 overall grade ranks fifth among all quarterbacks.\nPerhaps we’re crowning Daniels a bit too early, as plenty of quarterbacks have had standout rookie seasons only to regress in Year 2. But what separates Daniels is his poise under pressure and in clutch moments late in the year. His rookie campaign was arguably the best we’ve ever seen, with his 90.6 overall grade marking the highest ever recorded by PFF for a rookie quarterback.\nCody Benjamin from CBS Sports thought Jayden Daniels was a lively candidate to be the USA’s starting quarterback at the prestigious event. The analyst thought his unique skill set and the fact that he’ll be even better in three years make him a worthy option for the job.\n“What’s the common thread for our selections? Speed. Athleticism. Multipurpose potential. Whereas traditional football still values tenacious blocking and defensive physicality, flag football is all about open-field dynamism. You need players with sure hands and other fundamentals, yes, but burst and elusiveness are paramount. It’s why, at quarterback, we prioritized a true dual threats, with [Jayden] Daniels arguably best positioned to offer the best of both worlds — tightrope accuracy, downfield touch and effortless mobility — in three years’ time.”\nDaniels would love the opportunity. He’s a California kid and might be the face of the league by this point. Even so, it would create a potential headache for the Commanders.\nPodcasts & videos\nALL Eyes on Jayden Daniels + Spain Games | Command Center Podcast | Washington Commanders | NFL\nNFC East links\nThe Athletic (paywall)How Jeffrey Lurie, Jason Kelce and the Eagles saved the tush push\nOne high-ranking league source who was in the room said, “Lurie was like a guy trying to convince his girlfriend why she shouldn’t leave him.” Throughout his pitch, Lurie was emotional, passionate and — at one point — crude. He said the fact that his team came up with a play so unstoppable that the rest of the league had no other choice but to try to ban it was “like a wet dream for a teenage boy.” Toward the end of his address, he told the assembled owners that, regardless of the day’s result, he and his franchise would walk out winners, with Super Bowl rings to show for it.\n[Jason Kelce] told the room: “If I could run 60 tush pushes a game, I’d come back.”\nAfter Lurie finished speaking, executive vice president of football operations Troy Vincent chastised the Eagles owner for the “wet dream” comment, specifically for saying it in front of women in the meeting.\nLurie spoke for several more minutes, adding that whoever voted to ban the play would be taking liability for putting quarterbacks at risk. He criticized NFL commissioner Roger Goodell and Vincent for advocating the ban, adding that he had spoken to NFL chief medical officer Allen Sills at length about the play.\nEagles assistant general manager John Ferrari and former Eagles star center Jason Kelce, currently an ESPN analyst, addressed the room next. Kelce said that he would return to the NFL if he could run 60 tush pushes a game.\nDallas Cowboys owner Jerry Jones asked a few questions, while Buffalo Bills owner Terry Pegula — a critic of the tush push — said his team was good at the play and still supported banning it.\nAn hour had passed when San Francisco 49ers owner Jed York asked Lurie “how much more s---” he needed to say.\nThere were a few scattered laughs, but the room was quiet and tense.\nWhatever tweaks will be made, Hurts said that going through the process so many times has made him a better player because it gives him so many options about handling situations that come his way.\n“You’re always in a place where you’re trying to improve and find that 1 percent,” Hurts said, via Jeff McLane of the Philadelphia Inquirer. “I think it’s unique to experience all the coaches I have — the [the offensive coordinators], the offensive leadership in the quarterback room — all those things have been positives for me because I’ve turned it into a positive. I’m able to lean on so many different things and decide when do I need it when it comes to going out there and performing and leading.”\nThe Eagles offense hasn’t always fired on all cylinders with Hurts, but his adaptability and productivity have helped Steichen and Moore graduate to top jobs. If things keep rolling in 2025, Patullo might be the next head coach to climb the ladder with help from the quarterback.\n“We are thrilled to provide ‘Hard Knocks’ fans a summer with the Bills and winter with the Cowboys, Giants, Commanders and Eagles in the first year of our exciting new deal with NFL Films,” said Nancy Abraham and Lisa Heller, co-executive vice presidents HBO Documentary and Family Programming, and Bentley Weiner, senior vice president HBO Sports Documentaries. “There will be no shortage of star power.”\nThe Giants might not be as thrilled.\nThe organization was featured on the first — and as of now only — offseason edition of ‘Hard Knocks’ during the 2024 offseason. The organization was widely panned for the appearance, mostly because of the way their handling of Saquon Barkley’s free agency exodus to the Philadelphia Eagles was portrayed.\nNFL league links\nArticles\nThe Athletic (paywall)Jim Irsay, longtime owner of the Indianapolis Colts, dies at 65\nJim Irsay, the eccentric, outspoken, sometimes controversial and largely successful owner of the Indianapolis Colts, who away from the field battled personal demons for decades and later became a fierce champion of addiction awareness and mental health advocacy, died Wednesday. He was 65.\nIrsay passed away peacefully in his sleep, the team said in a statement.\nThe Lions withdrew their playoff reseeding proposal on Wednesday, NFL Network Senior National Columnist Judy Battista reported.\nDetroit’s proposal was to amend the current playoff seeding format to allow wild-card teams to be seeded higher than division champions if the wild-card team has a better regular-season record. Under that format, the division champion with the best record would be seeded No. 1 and thereafter the remaining six seeds would be determined strictly by record, regardless of division finish.\nFollowing the withdrawal, there was an extended discussion during Wednesday’s meeting among owners about the idea of the proposal. There is some support for the Lions’ proposal and the NFL will study possible reseeding scenarios for potential changes in 2026, NFL Network Insider Tom Pelissero and Battista reported.\nOnside kick\nThe competition committee’s proposal to tweak the onside kick was passed by NFL owners on Wednesday. The rule allows teams to declare an onside kick at any time while trailing — not just in the fourth quarter — and line up one yard closer to opponent. Pelissero added that the hope is to modestly increase success rates from 6% last year.",
  "word_count": 2011,
  "scraped_at": "2026-02-14T12:50:28.039924"
}