{
  "article_id": "003d32fbe686",
  "url": "https://www.offtackleempire.com/2023/12/2/23980499/mailbag-rivalry-trophies-big-ten-iowa-michigan-ccg-end-west",
  "title": "Mailbag ! Do you have questions about the CCG ? We answer none of those , but others which are more interesting . ",
  "date": "20231202T163000Z",
  "domain": "offtackleempire.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "I have end-of-semester brain, my students have end-of-semester brain, and given the pacing of articles on this site this week, every last one of us “writing” for you here have end-of-semester brain.\nMailbag! We Create Monuments, Ignore Good Advice, and Damn Rivals With Faint Praise\nI mean, really... how can anyone compliment Iowa?\nWith that, I’ll end the preamble, because you all asked terrific questions this week, and in one of the answers, Thump goes on for about 30 pages or so, and this article does not need any additional verbiage.\n“With the end of B10 East/West and the addition of Pac 12 teams, you are commissioned to make a monument for the Big-Ten-That-Was. What moment/person do you immortalize in bronze/marble/corn/etc and where do you inconveniently place it to hold up traffic?”\n—KetteringLex\nWSR: Kirk Ferentz and Pat Fitzgerald shaking hands and patting each other on the shoulder, and I put it at one of the intersections just outside Lucas Oil Stadium. All of the things that never deserved a B1G Championship game belong together.\nMNW: wait wait wait pipe down kid, you don’t get to determine who deserves B1G West championships\nthe fitz-ferentz handshake is great, tho\nKind of...: Don’t know that I can top that, but I might make one of those pieces of art that changes depending on how you look at it so that, when viewed one way, it’s Darrell Hazell looking befuddled, but viewed from another angle, it’s Tim Beckman looking befuddled. Include every B1G West coach who had a 4-8 season or worse, and just call it the Hall of Befuddlement.\nRockyMtnBlue: Scott Frost in a hoodie in front of a microphone. Entertaining while awful. Sanctimonious while hypocritical. The platonic ideal of the entire West Division in human form. Agree with WSR on placement. There’s no improving on that.\nAlmaOtter: What about a corn mosaic depicting a muffed punt?\nBuffkomodo: A giant corn cob of the Wolverine laying on a bed looking at a picture collage of all the B1G title game scores and place that right on I-70 in Terre Haute Indiana. On the Illinois side of the prison.\nBRT: In principle, I don’t like statues of people - they seem to not age well and attract all kinds of brouhaha. But for the Big Ten West, I’d immortalize Jake Cotton falling on his ass for a false start. I think a really skilled sculptor could capture the sense of motion, and it seems to me to encapsulate all of the assery and wtf-ery of the West. It also still makes me laugh any time I watch it, all these years later.\n“After the SMCD mourning session perhaps this isn’t the best question but... what’s one thing you were happy about this season and what’s one thing you’re looking forward to for next year? I feel this doesn’t even have to relate to your team, or even a game, it could be an article, a shitpost, maybe a game thread.”\n—DtownK\nWSR: No, and I don’t know. Everything is weird and dumb right now.\nMNW: I mean, Northwestern is 7-5 and beat a number of you people’s shit teams. (Not yours, DtownK, but you know what I mean.) I’m happy about that.\nNext year? I’m excited for nuclear winter. Or holding out hope for nuclear winter. Whatever.\nKind of...: I’m happy to have the Axe back. I’m not really looking forward to much. Wisconsin should be good in volleyball again, and men’s hockey is on the upswing.\nRockyMtnBlue: This might be the best Michigan team of my lifetime. The West was as entertaining as it could possibly be without Scott Frost around.\nAlmaOtter: Everything’s fucked and this Illini season was several shades of exhausting, but I’ve loved writing at OTE. This community is special, truly. As a lifelong Cubs fan, I’m conditioned to believe that there is always next year. I hope we’ll spend it together, probably bitching about the new west coast teams.\nBuffkomodo: All the cigs and memes.\nHWAHSQB: John Paddock gave me a few moments of joy, particularly me and one Illinois fan I just met celebrating in a stunned Gopher season ticket holder section. It was a great story that deserved to end better than it did. Ah, John. We barely knew ye.\nBRT: Volleyball made me happy. If you meant football, well, they started the season in the football stadium in front of 92,003 people, so I’m counting it. I’m also surprised and happy this site is still kicking somehow. As for next year, I’m looking forward to more volleyball, and also to seeing how else Nebraska can lose one-score games. You’d think they’d be scraping the bottom of the barrel for new ways to do that by now, but the fount seems to be endless in this area. If I can’t have a good football team, at least I’ll have morbid curiosity.\nThumpasaurus: One thing that made me happy was Detroit City FC shidding and farding their way into the 8 seed in the USL Championship playoffs with by far the fewest goals scored of any team only to go to Pittsburgh and knock out the league’s best team in the opening round. All five of Illinois’ wins made me pretty happy, even if that was fleeting.\nI cannot name a single thing, football or otherwise, that I am looking forward to in 2024. All the good stuff already happened.\n“Since the season has ended and what we have know will never be again, what is your favoritest B1G moment and/or worst (football or otherwise), this year or years past?\nSince I am old as fuck, mine are:\n* ‘81 Rose Bowl team\n* ‘85 #1 Iowa over #2 cheatin’ ass michigan (by a field goal, of course)\n* 10-2, with the worst offense in history, forever cementing itself in history as the last West Champs!\n* The jNW story was pretty cool too.”\n—cericjo\nWSR: Since the B1G has never rarely brought me joy, I’d say that there were a number of B1GCG snuff films that brought me joy, including 59-0. If we need to involve my team, it’s 2019 over Penn State, saving the sport of college football by beating wisconsin in 1993, and beating Iowa this fall because of how wonderfully unaware of the rules of college football Hawkeyes fans are.\nMNW: The 2013 Gator Bowl remains undefeated.\nWSR: Oh, we can do bowls? Ok. The 2020 Outback Bowl against Auburn was a lot of fun.\nKind of...:\n- 1999 Rose Bowl, Ron Dayne runs UCLA into paste (245 yds, 4 TDs)\n- 1999: Wisconsin 41, Iowa 3, UW clinches outright title and Dayne sets all-time NCAA rushing record\n- 1998: UW beats Purdue 31-24 in the second night game ever at Camp Randall. Drew Brees sets NCAA single-game passing attempts record. Jump Around tradition born\n- 2010: UW knocks off #1 Ohio State\n- 2012: Wisconsin 70, Nebraska 31\n- 2014: Melvin Gordon rushes for 408 vs. Nebraska\nRockyMtnBlue: In order (I’m a Michigan fan, so no bowl games here):\n- The Desmond Howard TD on 4th and 1 against Notre Dame in ‘91\n- The Game, 2021\n- The ‘97 Penn State game\n- Second half of The Game, 2022\n- 2011 Notre Dame in the first game under the lights in Michigan Stadium (particularly the last two minutes)\nAlmaOtter: 9OT. I will never have a more pure, uncut sports high than that colossally idiotic game.\nBuffkomodo: Tom Allen sprinting off the field in Lincoln after beating Scooty Frooster to get bowl eligible in October in 2019.\nHWAHSQB: The genesis of my username came from the Andy Kauffman last second shot to stun iowa in 1993. I will never experience joy like that again.\nBRT: I’ve overall enjoyed being in the Big Ten in spite of my team being crappy, so joining remains a highlight. It’s been terrific from a vb standpoint and... interesting from a football one. Volleyball highlights include winning the conference in our first season, and winning NCs in 2015 and 2017. Football actually has a few highlights too:\n+ Winning at East Lansing in 2012 while attending with my Spartan-fan boyfriend. I played it cool for the sake of the relationship, but it really was pretty damn fun.\n+ Beating MSU in Lincoln a few years later via a call that still makes Sparty a little salty\n+ Beating Iowa last year was really funny, because it had been ages, and because there was really no reason it should have happened.\n+ For a game not involving my team, the 2015 “Trouble With the Snap” game has to be up there. Just so completely bonkers, and such a humiliating moment for Michigan, two things I really like seeing in CFB.\nThumpasaurus: No, actually, the jNW story from this season genuinely makes me sick to my fucking stomach. Tim Beckman’s only mistake was that his scandal was solely confined to recklessly endangering the health of his athletes. Had his scandal involved even the slightest bit of\nNo, you know what, no. Illinois Football is morally superior to all of you, not because we’re simply better people but because to become powerful enough to do the kind of scandals that have hit (and then disgustingly revitalized) so many of our Big Ten rivals, you need to actually win football games and we haven’t had consecutive winning seasons in the last 30 years.\nMy favorite story about the Big Ten was when Bo Schembechler, who was a much less successful Joe Paterno and one of the worst Michigan coaches of the 20th century, spearheaded a vendetta against Mike White’s Fighting Illini before he ever coached a single game. So eager was the league to gobble the knob of this legend who once famously tied Ohio State that one time and was denied another opportunity to score 9 whole points in the fucking Rose Bowl that they banned Illini quarterback Dave Wilson from playing in the upcoming 1980 season. Wilson of course sued, and the legal deadlock allowed him to play. Illinois went 3-8.\nBo would have you believe that he was concerned about the academic integrity of the league and that these junior college players besmirched its good name. Wilson’s character and intelligence were slandered in the media repeatedly. Of course, the real reason Bo was doing this is because Illinois had fired his good buddy Gary Moeller, which meant (1) his buddy was out of a job and (2) Illinois wouldn’t be completely hopeless until the end of time. Both of these conditions were intolerable for a Michigan Man.\nThe Big Ten was so fucking mad that Illinois got off the mat and defied the will of Michigan that they made all men’s sports ineligible for any postseason play for two whole seasons and refused to give us our share of conference revenue.\nYeah sure, Michigan, go ahead and leave the Big Ten because they gave you a non-punishment. Illini fans were ready to leave the league, and rightfully so; it had been only 15 years since the league guided the NCAA on how to nuke Illinois from orbit after a spurned would-be athletic director turned in receipts showing an adorably small but laughably well-documented slush fund the Illini assembled in an effort to keep up with Ohio State, Michigan State and if we’re being honest, Michigan as well. Illinois had been the perfect martyr to be crucified for the sins of the blue blood programs.\nSomehow, despite this two-year postseason ban’s impact on recruiting, the contemporaries of men’s basketball coach Lou Henson still couldn’t get absolutely any recruit they wanted out of Chicago. Bob Knight, may the bastard rest in piss, probably didn’t need to actively undermine Henson with lies to authorities in order to continue winning basketball games. However, we’ll never know, because he chose to do that anyway! Nobody had a problem with Henson’s recruiting of Chicago athletes until he actually started winning games and some of the better players in the city started to notice their state school had a burgeoning program. Henson didn’t change, his competition did.\nGo ahead and tell me that Bob Knight, Digger Phelps and Bruce Pearl are people you’d trust.\nLaPhonso Ellis still refuses to go to Champaign to cover basketball games because he knows he’ll never be forgiven for lies he’s admitted he told the NCAA about how Henson recruited him.\nSo maybe my real favorite memory is when the postseason ban expired and Mike White’s Illini lost to Missouri in the season opener and then ran the table in conference play. This was during the short-lived era of true round robin play before the Big Ten started openly displaying its greed in defiance of its longstanding facade as a league of Midwestern gentleman scholars. The 1983 Fighting Illini will forever reign as the greatest team in the history of Big Ten football: they are the only Big Ten team to ever defeat the rest of the league in a single season. Nobody did it before, nobody has done it since and nobody will ever do it again.\nAnd you know what? I’m proud of the way that they told the Big Ten to go fuck itself by showing up hung over to the Rose Bowl to get mauled by a mid UCLA team led by Rick Neuheisel. The Big Ten’s greatest-ever champion delivered the ultimate mic drop. No, we won’t deliver glory to our conference, they suck! Let’s go party with Hefner.\nI really enjoy that Gary Moeller, an objectively shitty head coach and a tremendously dumb guy, proved that any idiot off the street could win a conference title at Michigan and then got so drunk he punched a cop. I live roughly 10 minutes from where he did that!\nThings that came out of the University of Illinois include\n- the linebacker position\n- Homecoming\n- putting a marching band on a football field to make shapes\n- hype around Red Grange strong enough to single-handedly kickstart the NFL\n- semiconductors\n- the Internet browser\n- instant replay in football, a small consolation for the league giving Michigan a win\n- that rule in college hoops where possession is reviewable inside the last two minutes\n- Dick Butkus\nand the thanks we get for it is being undermined at every possible turn by the Big Ten while they change their conference championship rules for Ohio State and moralize about Michigan knowing they’ll only ever see a symbolic punishment. The Big Ten’s abuse of Illinois continued right up until one of the last plays of this season in which a Northwestern defender tackled Casey Washington in the end zone well before John Paddock threw the ball, but because the ball was tipped it didn’t count as holding.\nYou know what did count as holding? The phantom call on a play against Iowa where every receiver got an impossibly free release and Deacon Hill, whose name is definitely a development somewhere in southwest Naperville, couldn’t put the ball anywhere near a receiver. It’s not the Big Ten’s fault that Illinois played prevent against Iowa on the ensuing first down, but the first down should never have happened.\nJohnny Newton, who was unfairly tossed from the second half of a game his team lost in his absence, was awarded the Butkus-Fitzgerald Trophy for defensive player of the year in the conference. This trophy is named after two people:\n(1) the most legendary defensive player in college football history\n(2) one of the better linebackers in the Big Ten in 1995, though not the Big Ten linebacker that won the Butkus Award given to the nation’s best linebacker.\nThat the Big Ten kept Pat Fitzgerald’s name on the trophy after what happened this year can only be interpreted as an act of aggression by the conference against Illinois and an attempt to spit on the freshly-made grave of Illini legend Dick Butkus.\nI think I’ve figured it out.\nMy favorite memory of the Big Ten will be when it finally dies, and I’m glad it’s taking a step towards killing the flimsy facade that made people romantic about it in the first place. Fuck the Big Ten. I’ll be glad when they finally dump Illinois. Maybe they’ll replace them with Liberty.\n“Of the Big Ten HCs who have been at their repsective helms for at least five years, which ones have reached their ceilings? This list includes: Locksley, Schiano, Franklin, Day, Harbz, Peej, Ferentz.\nThat’s right, half of the Big Ten teams have a HC that’s been at the helm 3 years or less.”\n—larry31\nWSR: All of them? Locksley may be playing above his ceiling, but all of those coaches are exactly what we think they are at this point in time.\nMNW: Hypothetically Day could still reach higher. Harbz, too. Everyone else? Water’s found its level.\nKind of...: Yes, all of them. In some cases, the ceiling was the foyer and they’re in the back of the house for the rest of their career.\nRockyMtnBlue: Harbaugh, Peej, Ferentz. Michigan’s recruiting isn’t good enough to keep fielding teams as good as the one they’ve got. Even if the coming sanctions are small and coaches stay and everything is rosy, Michigan will fall back to the 9-3 space within a few years as they’ll be about the 5th most talented team in the league. Ferentz is who he is (and has been for a thousand years). I don’t think Peej’s approach has staying power. He’s at his best in his first 5 years in a program.\n“In light of Harbaugh saying it’s unreasonable to tell students athletes that the game is life or death and that hatred is manufactured (a few years removed from “we will beat Ohio state or die trying”, natch), what is something nice or complimentary you can say about your school-of-choice’s rival?”\n—MiddlewestAverage\nWSR: There is not a more perfect place to re-home former confederate soldiers than madison, wisconsin.\nMNW: The University of Illinois has given me Thump, AlmaOtter, and He was a high school quarterback. And for that, I am grateful.\nKind of...: Twin Cities eating/drinking establishments are perfectly hospitable places to celebrate Badgers victories.\nRockyMtnBlue: In the 1970s, Ohio State was not a premium university. They’ll tell you this isn’t true. It is. But today they are. They have closed the gap with Michigan a LOT and it’s irritating AF. Michigan State, um, well, there are attractive women there!\nAlmaOtter: Here I was about to make some directional school joke at Northwestern, and MNW drops that comment. I’m thankful that we have Northwestern as an in-state rival to feud with. The solo B1G schools in their respective states don’t know what they’re missing. Also the Cocaine Cat logo is perfect.\nThumpasaurus: Northwestern football is the ultimate arbiter of whether or not Illini football has a good team. Did you lose to Northwestern? Then you’re not good. You can beat Northwestern and still not be good, but no good Illini team has ever lost to Northwestern. It’s a very useful measuring stick.\nBuffkomodo: I ACTUALLY LIKE MATT PAINTER. And the engineering school is solid.\nHWAHSQB: iowa isn’t so bad, um, well, yeah, I got nothin’.\nBRT: This reminds me of the 2016 presidential candidate debate. Insane as it is to recall, there was a question that required Hillary Clinton and Donald Trump to say something they admired about each other. It went about as well as you’d imagine.\nSomething nice I can say about Iowa is that when I was driving cross country from New York to Nebraska (many, many times during my grad school career), the Coralville Mall was always my mid-day break on the Nebraska-South Bend driving day. No matter the weather (and it was always either freezing or 100 degrees due to the times I was making the drive), I could go have a little Chick-Fil-A and walk a few laps in the air conditioned comfort of the mall, a nice little break when you’re making a 20+ hour drive in two days by yourself.\nMore seriously, I actually do enjoy Iowa City as a college town.\n“What’s the best portal dynamic?\n- G5 guy going to P5 blueblood to test his mettle?\n- FCS All-Stars making the leap to FBS?\n- Loyal player following his head coach/coordinator to a new job?\n- Guy who just couldn’t crack it at the top program taking a step down and finding success?\n- Guy escaping dysfunctional program to find stable success?\n- Skill guy held back by bad QB play finally moving to play with the QB who can make him a star?\n- Or something else?”—C.E. Bell\nWSR: Guy held back by incompetent coaching finds a new home and flourishes.\nMNW: Best of luck, Athan.\nKind of...: Basically just the guy who bets on himself and has success. Isaac Guerendo wasn’t likely to crack the rotation at UW, but he’s talented, and really fast. Louisville’s second leading rushers this year. Not gonna win the Hesiman. Probably not making a ton of money. But he found a solid situation and he’s playing for a conference championship. Happy for the guy.\nRockyMtnBlue: Guy escapes a program he feels is doing him wrong, and finds a new home. Even when it happens to my team (McNamarra and All). This didn’t use to be an option for guys like these.\nAlmaOtter: East coast QBs moving a back a few time zones and up a few skill levels. Penix, Uiagalelei, Nix as examples this year.\nHWAHSQB: And Big Time Tommy last year!!!\nThumpasaurus: Tommy DeVito isn’t currently playing for the Giants if he doesn’t transfer to Illinois. Tell me there’s a better ending than that!\nBuffkomodo: I…uh…all you guys…you’re welcome for filling the holes in your rosters.\n“You are in charge of creating the tiebreaker rules for next season’s championship game if teams have tied records at the end of the regular season.\nSave us from computers deciding the fate of the free world (like other lesser conferences), and give us some brand spankin new rules for 2 or 3 team (or bonus 4+) tiebreakers.”\n—SteinwayHawk\nWSR: Nerf gun pistol duels, and they have to have an OTE “writer” serve as their second. Are there 3 teams involved? Mexican standoff like from the end of The Good, The Bad, and The Ugly. 4 or more teams? I hope you can reload fast if you don’t get taken down.\nKind of...: There’s no perfect solution. People continually ignore the fact that the head-to-head loser probably has the better loss, for example. There’s no way of breaking ties that doesn’t balance considerations. I say screw it, let’s go back to 1973, and have the ADs vote, but with the votes made public.\nRockyMtnBlue: A point system. A series of metrics that are worth points. Highest points wins. If there’s a tie in points, we revert to WSR’s method.\n- Thank You For Your Service Award: 5pts for every Big10 win against a team with “State” in their title.\n- Thank You For Your Service To The Universe Award: 10pts if you beat Notre Dame this year.\n- Coward Penalty: -5pts for every FCS team on your schedule\n- Quit Screwing Your Ticket Holders: 3pts for playing a team that finished ranked in the AP or Coaches polls at the end of the regular season. +5 additional points if you won that game.\n- Anyone Could Win With That Roster Adjustment: -1pt for every 247composite 5* recruit on your roster.\n- Poor Tax: All 16 Big10 public schools will be ranked by their state funding level. +1pt per rank. (16th highest funded school gets 16pts). This award also called the “Fuck USC Award”\n- The Damage May Be Permanent Award: 3pts if your team was ever part of the Big10 West.\n- The Damage Is Probably Permanent Award: 5pts if you got the “honor” of playing in the Big10 East the last 10 years, and you’re not Michigan, and you don’t have “State” in your name.\nAlmaOtter: All ties should be broken by aggregate rankings in each school’s women’s sports programs. You want to make the title game? Spend more money on your gymnastics program! Let’s reward the schools that make an effort at equality.\nBuffkomodo: Each team select a representative.\nSend them to rural Montana.\nPut them on different shitty Wi-Fi networks.\nPlay 1 match of Halo 3 on Guardian for Kingslayer.\nWinner breaks the tie.\nBRT: Actually love AlmaOtter’s idea. Otherwise, I was going to suggest a hot dog eating contest between the head coaches. Let’s see who wants it more, and give the people something more interesting than the CCG ever is to watch.\n“For all you other old folks shaking your fists at the clouds: Which change has been the worst for college football?”\n—ExiledinVT\nThumpasaurus: John Mackovic leaving\nWSR: Absolutely no guardrails for NIL. Do players deserve to be paid? Yes. Does there need to rules in place about how this happens? Also yes.\nKind of...: Seconded. We’re in the equivalent of the frothiest of frothy periods for a startup. You know a bubble is going to burst and you hope it’s containable.\nRockyMtnBlue: No guardrails for transfers is worse, IMO. Limit transfers to 1. After that you can still transfer but must sit out a year. The vast majority of these players aren’t going to make a living in football. Your educations matter, boys.\nThumpasaurus: Hey remember when two players left Georgia to go to the Big Ten in the same season? A future first round draft pick at quarterback wanted to go to Ohio State because playing time someone had told him that a racial epithet was used by a Georgia Fucking Bulldogs Fan during a game once. A shitty tight end wanted to go to Illinois because playing time his family, including his ailing grandmother, lived in downstate Illinois. One of these players had to sit!\nBuffkomodo: The explosion in TV revenue giving these teams the ability to MASSIVELY overpay every coach and then believe there’s not enough cheddar to spread around. Nobody needs a $150 million practice facility. Like…no. Pay your players.\n“In honor of this community of sickos and weirdos, what’s a fun (good, embarrassing, silly, etc) early internet community memory for you? I hate to admit I was once successfully bullied out of a menswear message board for asking a question that had been asked way too many times already.”\n—AnnArbaughtimusPrime\nKind of...: I’m pretty old and was in college when the internet was relatively new (early-to-mid-1990s) For Computer Science, we were required to join a discussion board. I said screw it and chose a Led Zeppelin discussion group. There about 20 power users, including a guy at an Ivy League school who has gone on to become fairly well known within his niche. I was almost kicked out because I didn’t fully understand net etiquette (still don’t probably) and didn’t do enough to dampen my sizzling hot takes about the merits of various things Zeppelin.\nThumpasaurus: Holy shit, I can’t believe I found this. When I first got into NASCAR, Jeff Gordon was a pretty boy that was winning absolutely every week and I couldn’t stand it. The dial-up on our shared computer found a number of Jeff Gordon hate websites that eventually spawned communities that I never took part in, but I vivdly remember in 1998 or 1999 frequenting NFAJG.com (“NASCAR Fans Against Jeff Gordon”, since scrubbed from the Internet) where people would submit pictures of themselves at races flipping off the rainbow 24 car.\nWhat I am about to link you is not that website; in fact, it was started as late as 2000! (For those of you not in the know, Gordon was still pretty hated by a large chunk of NASCAR fans until 2008 when Dale Earnhardt Jr joined his team at Hendrick Motorsports.) Nevertheless, it is pretty representative of the variety of website I’m talking about.\nAre you ready?\nYou’re not.\nRockyMtnBlue: I was lurking an Indiana Pacers message board during the ‘04 NBA East Division Finals. After they were over the discussion was about whether the Pistons would get crushed by the Lakers dream team, or crushed and then eaten. One guy came out and predicted the Pistons would not only win, but win easy. The following is a paraphrase but it’s pretty close: “I’m tempted to predict a sweep, but I can’t quite do that. I’d say 40% likely a sweep, otherwise the Pistons will win in 5. If it’s not a sweep, it’ll be because some Kobe heroics at the end of a game, probably game 2.” By the end of the Finals, everyone on the board wanted to take him to Vegas.\nBuffkomodo: I once bullied a dude out of a menswear message board for asking a question that had been asked too many times.\nBRT: In 2008, I had just started grad school, and my father unexpectedly passed away. Focusing on school wasn’t going particularly well, and I was looking for distractions. Unfortunately, I chose to renew my interest in Husker football, in part because it was frivolous, and in part because it made me feel a bit less homesick. It was there I found the ESPN comment section, first for the Big XII, and then for the Big Ten. After that comment section was switched to Facebook commenting, thus killing the vibrant community that had developed there, many came from there to this fine site, including me (shout out to my fellow refugees!)\nAnyway, on that Big Ten board, I actually met some great people, and even met a guy I ended up dating seriously for about five years. I was dazzled by his wit and his correct usage of grammar. It ultimately didn’t work out and resulted in more than one session of therapy in subsequent years, but overall and with the benefit of hindsight, it was a relationship I have many positive memories of. If nothing else, it’s a pretty wild anecdote to have one’s longest-term relationship start in an ESPN comment section.\nAdditionally, I’ve met many fine people through those comment sections and through writing on this site, several of whom have become real friends. Some I’ve met when they came to Lincoln for a game, and I’ve turned up on GF3’s doorstep in London a couple of summers in a row now. And perhaps most consequentially, MNW found me my current job. Weirdly enough, it’s fair to say that Big Ten football sites have legitimately changed my life, in several ways!\n“What’s the best advice you’ve ever received that you didn’t take? (I may have asked this here before but if so, I can’t remember)”\n—MiddlewestAverage\nRockyMtnBlue: No matter what, save at least 10% of what you make for your retirement. Make it the priority. Eat potatoes and beans if you have to. Pay YOU first. If I had done this my whole career I’d probably be job-optional at age 52, and if not, I’d at least be looking at a very good retirement at 60.\nThumpasaurus: They told me Illinois is a basketball school. Don’t bother with football. Even when they’re good, they’re bad again the next year. Don’t even go to the games! Nobody goes to the games! Just wait for basketball season man.\nBuffkomodo: My dad told me to go into the Navy out of high school. Would have gotten college assistance. Would have been able to play sports in college after working through my demons (assuming good physical and mental health). Would have been a man competing with children for 4 years oh and I’d have went to college with money and solid options after graduating college. I wish I’d have listened to that.\nHWAHSQB: Marry for money. You can find love the second time around.",
  "word_count": 5315,
  "scraped_at": "2026-02-14T13:10:34.475355"
}