{
  "article_id": "0040c2824f2c",
  "url": "https://menafn.com/1107475252/Who-Is-Urmila-Rosario-Manager-Of-The-2023-World-Cup-Champions-Australia",
  "title": "Who Is Urmila Rosario , Manager Of The 2023 World Cup Champions Australia ? ",
  "date": "20231123T053000Z",
  "domain": "menafn.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Who Is Urmila Rosario, Manager Of The 2023 World Cup Champions Australia?\nAustralia clinched their sixth World Cup title last week. The Pat Cummins-led Aussies put up a great show to defeat hosts India by six wickets. It has now been learnt that an Indian-origin woman, a Mangalorean to be more precise, played a key role in making Australia the world champions. She is none other than their manager Urmila Rosario.\nDaughter of Ivy and Valentine Rosario, Urmila gained attention on social media since a picture of her holding the World Cup trophy, along with Mitchell Starc, went viral.\nHere are five things to know about Urmila Rosario:\n- Urmila's parents Ivy and Valentine Rosario hail from Kinnigoli near Mangalore, a city in the South Indian state of Karnataka. She was born in Doha, reported Indian media.\n- A BBA graduate from Carnegie Mellon University in Pennsylvania, Urmila was interested in sports since her tender age. Moreover, Urmila was the only one among the four siblings to have developed a knack for sports. She had even pursued tennis and wanted to pick up the sport as a profession. Due to injury issues, Urmila's dreams of becoming a tennis player shattered early in her life.\n- Urmila, eventually, found her calling somewhere else. Having failed to become a tennis player, Urmila decided to move to sports management. After shifting to Australia, she was associated with the Adelaide cricket team for around three years. She had even joined the Australia women's cricket team as a team manager.\n- During last year's Fifa World Cup, Urmila decided to take up the responsibility of managing a football stadium in Qatar for four-odd months, reported The New Indian Express.\n- Urmila returned to Australia earlier this year in September and following her homecoming, she was asked to manage the Australia men's cricket team for the World Cup.\nALSO READ:\n- Dubai-based Australian RJ reveals why his country keeps winning World Cups\n- India lost the final, but earned new admirers, says Dubai cricket coach\n- Australia have their 'legacy' after winning World Cup: Cummins\n- It was most attended ODI World Cup ever but jury still out on 50-over cricket's relevance\nLegal Disclaimer:\nMENAFN provides the\ninformation “as is” without warranty of any kind. We do not accept\nany responsibility or liability for the accuracy, content, images,\nvideos, licenses, completeness, legality, or reliability of the information\ncontained in this article. If you have any complaints or copyright\nissues related to this article, kindly contact the provider above.",
  "word_count": 422,
  "scraped_at": "2026-02-14T13:28:01.989873"
}