{
  "article_id": "00777cf0c645",
  "url": "https://paulgravett.com/articles/article/best_comics_of_2020_an_international_perspective_part_2",
  "title": "Best Comics of 2020 : An International Perspective Part 2",
  "date": "20250720T023000Z",
  "domain": "paulgravett.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Best Comics of 2020: An International Perspective Part 2:\nYear in Review\nWelcome to Part 2 of this Year in Review exploring the Best Comics of 2020 from an International Perspective. My thanks to all the correspondents for their selections and reviews. You can read Part 1 here… and Part 3 here...\nBELGIUM (FLEMISH) - CZECH REPUBLIC - FINLAND - GERMANY - NETHERLANDS - NORWAY - PHILIPPINES -PORTUGAL - SPAIN -SWITZERLAND\nCzech Republic\nSelected by Pavel Kořínek\nPavel Kořínek is a Prague-based comics historian and journalist, working at Institute of Czech Literature AS CR. In addition to teaching comics history, writing about it both academically as well as for a general audience, and trying to establish Czech comics studies (he is a founding member of the Centre for the Study of Comics ICL / UP), he has also chaired the board of the Czech Academy of Comics since 2018. In 2014 he edited and co-authored the two-volume Dějiny československého komiksu 20. století (‘History of 20th Century Czechoslovak Comics’) and an introduction to comics studies V panelech a bublinách. Kapitoly z teorie komiksu (‘In Panels and Speech Balloons. Chapters from the Theory of Comics’). In recent years he has edited and co-authored monographs about the series Punťa (2018, with Lucie Kořínková, and Čtyřlístek (2019). He has worked as a co-curator and co-editor on the exhibition projects: Signály z neznáma. Český komiks 1922–2012 (‘Signals from the Unknown. Czech Comics 1922–2012’), shown in Brno, Prague and Pardubice in 2012 and 2013; 100 Years of Czech Comics in Tokyo, 2017 and 2018; and Mezitím na jiném místě (‘Meanwhile, Elsewhere’), 2018–2019, an exhibition organised by Czech Centres and presented in more than 30 venues.\nR.U.R.\nby Kateřina Čupová, based on a theatre play by Karel Čapek\nArgo\nJust in time to catch the celebrations of a hundred years since its premiere, the first book-length adaptation of Karel Čapek’s play R.U.R. was created by Kateřina Čupová and published by Argo. This faithful, yet playful comics version of the famous theatre play that introduced the word “robot” to the global lexicon, is realised in lush and colourful watercolours that offer an interesting contrast to the more “serious” tone of the drama. For Čupová, who is well known on the Czech comics scene for her initially manga-inspired, recently more idiosyncratic and original short comics stories, this 250-page graphic novel presents her first major work – of hopefully many to come. Czech comics database entry with sample pages…\nNávrat krále Šumavy 3: Opona se zatahuje (‘The Return of the King of Šumava 3: The Curtain Comes Down’)\nby Ondřej Kavalír, Vojtěch Mašek & Karel Osoha\nLabyrint / Euromedia\nAs the last volume in the trilogy, this graphic novel crowns one of the most ambitious Czech comics projects of recent era. All three volumes together, The Return of the King of Šumava, offer more than 600 pages of thrilling narrative set in the years immediately after the Communist coup in 1948. Loosely based on the real-life story of the legendary people-smuggler, who helped Czech citizens to escape over the iron curtain, this magnum opus has all the components of an intelligent summer blockbuster: dramatic and suspenseful script by Kavalir and Mašek, as well as brilliant graphic realisation by Karel Osoha, one of the most prominent rising stars of new Czech comics. Sample pages here…\nBez vlasů (‘Without Hair ‘)\nby Tereza Drahoňovská & Štěpánka Jislová\nPaseka\nFor years, autobiographical comics were not so prominently present in the Czech context as they have been all around the world. Only time will tell whether Without Hair in fact signals and launches a welcome change of direction, but even if that does not prove to be a case, this book-length piece of comics autobiography deserves all the attention it can get. Debuting scriptwriter Tereza Drahoňovská describes her experience with alopecia, an auto-immune disease that causes sudden loss of all body hair. Drahoňovská teams up with the experienced Czech comics artist Štěpánka Jislová and together they find a fittingly simplified, cartoonishly relaxed visual style for narrating serious as well as more amusing everyday consequences of learning to live “without hair”. Sample pages here…\nRváčov (‘The Brawlerville’)\nby Džian Baban & Richard Fischer\nLipnik\nA complex graphic novel about various and often colliding myths and realities as created and established by packs of children living in the city of Prague during Communism and after. Building upon the classic novels and comics by Jaroslav Foglar, arguably the most influential author of the adventure branch of Czech children’s literature in the 20th century, this multi-layered graphic novel offers an adventure mystery story, historical narrative about the crimes of the Communist authorities as well as nuanced and atmospheric reflections about the genius loci of old and mysterious urban neighbourhoods. E-shop with some sample pages here…\nFinland\nSelected by Harri Römpötti\nHarri Römpötti has worked over 30 years as a freelance Helsinki-based journalist specialising in comics, cinema, music and literature. He’s written books on Finnish comics and documentary cinema and curated comics exhibitions. He’s also curated a program of animated films related to comics for the Stuttgart Animation Festival.\nMemento Mori\nby Tiitu Takalo\nWSOY\nTiitu Takalo suffered an intracranial hemoerrhage, survived and made an extraordinary example of graphic medicine of it all. Always an excellent drawer, Takalo makes dramatic use of colours. The hectic beginning in ER glows in red, the long tedious recovery in the ward languishes in grey. For a healthy reader, Memento Mori may serve the same purpose as the horror genre, to allow a safe experience of the tug of death – and prepare for one’s own turn.\nMutta Suurin On Rakkaus (‘But The Greatest Is Love’)\nwritten by Pauli Kallio, drawn by Mari Ahokoivu, Maria Björklund, Juliana Hyrri, Wolf Kankare, Mika Lietzén, Aino Louhi, Eeva Meltio, Emmi Nieminen, Viivi Rintanen, Aino Sutinen & Jussi Waltameri\nSuuri Kurpitsa\nPauli Kallio, the only professional comics scriptwriter in Finland, doesn’t speak here in the tongue of angels in a religious sense, even though the title of his collection of short stories refers to Corinthians in The Bible. But in the tongue of humans, Kallio is eloquent. His eleven tales drawn by as many artists are fiction, although the main character Aapo resembles the author a lot. Paul’s Letters to Corinthians is often quoted in weddings, but like him Kallio expands the theme of love from marital to different kinds, including parental, carnal and a fan’s love for a favourite band. Last year, Kallio published also Ammatti: käsikirjoittaja (‘Profession: Scriptwriter’), a giant collection of comics spanning his 30-year career.\nEi mitään (‘Nothing’)\nby Kati Närhi\nSelf-published\nStrictly speaking this one is not a comic but a picture book for adults, a very rare thing these days, at least in Finland. The atmosphere of Närhi’s book reminds me of Edward Gorey’s absurd and gothic sensibilities, but she draws with surfaces of colour rather than lines. The delicately surreal story tells of a town overcome by a cold wind that leaves people joyless and listless. Some of the drawings play with references to Robert Doisneau’s photograph Un regard oblique (1948) or René Magritte’s painting Le Blanc-Seing (1965).\nTatu ja Patu: Kovaa menoa kiskoilla (‘Tatu and Patu – Speeding on Rails’)\nby Aino Havukainen & Sami Toivonen\nOtava\nThe latest instalment of the hugely popular children’s picture book series Tatu and Patu is in comics format. In Finland the books have sold hundreds of thousands of copies and some have been translated in 21 languages. This time the two oddball boys take a train to visit their uncle. Their bottomless curiosity and uninhibited nature leads them once again into chaotic escapades. Havukainen’s and Toivonen’s narration has often been close to comics before. Now they are relying even more on the visuals to speed it up into a groove that resembles the animation of Tex Avery or Chuck Jones.\nGermany\nSelected by Christian Gasser\nChristian Gasser is a Swiss fiction-writer, journalist and lecturer at the Lucerne University of Art & Design. He reviews comics for various newspapers, magazines and radio-networks in Switzerland and Germany. He is also the co-editor of the comics-magazine STRAPAZIN and a member of the “Max und Moritz Preis”-Jury of the Erlangen Comic-Festival. His latest books are: Animation.ch. Vision and Versatility in Swiss Animated Film (2011, as an enhanced e-Book in 2016), Comix Deluxe (2012) and Rakkaus! (Finnish: Liebe) (novel, 2014).\nÜber Spanien lacht die Sonne (‘Over Spain Laughs the Sun’)\nby Kathrin Klingner\nReprodukt\nGermany in 2015: Kitty starts working for an agency that sifts through comments on the internet on behalf of companies who want their comment columns curated. This is one of these services that you probably kind of suspected existed, but probably never really gave it a thought because it sounds so weird and insane… Shortly beforehand, the German government had decided to open the borders to migrants, and although most Germans understood the moral necessity of this decision, others were violently against it and raged and raved against it in ugly discussions on the Internet. The bigger context of this 128-page graphic novel is alluded to by the title, a play on words that is so easy to explain and can lead more than one reader down the garden path. Die Sonne lacht über Spanien literally means, “The Sun Laughs over Spain”, but it can also mean “The Sun Laughs about Spain”. In its second meaning, the title forms the first part of an idiomatic expression that was often used in the context of the refugee crisis: “Über Spanien lacht die Sonne – über Deutschland die ganze Welt”, meaning that the whole world was laughing about Germany’s decision to let in so many migrants. More and more, Kitty gets drawn into these aggressive, muddle-headed, nasty discussions, and doesn’t keep up with deleting the particularly sick comments. Kathrin Klingner knows what she’s talking about. After all, she did the job herself, and she has looked deep into the social abyss that she is now opening up for her readers. The extremely reduced style of drawing and the alienation of the people as animal characters stand in attractive contrast to the real background. In short episodes, Klingner depicts Kitty’s absurd everyday work with her colleagues, who come from many different areas, and describes the constant gaze into the dark abyss of hatred, anger, frustration and resentment. She does it with an amazing amount of dark humour, with irony, sometimes with sarcasm; but at times Kitty also seems simply resigned and tired, very tired – especially because she cannot prevent all this garbage that is segregated on the Internet from seeping into her private life. Die Sonne lacht über Spanien is a clever, cunning, surprising, entertaining, but, in the best sense of the word, unsettling read.\nVervirte Zeiten (‘Confused Times’)\nby Ralf König\nRowohlt Verlag\nEven if Ralf Koenig’s Vervirte Zeiten was only published as a book in early 2021, its original form of publication and its topic are so 2020, that it has to be included in this Best of 2020: during lockdown, from March to October, König put a daily four-panel-strip online. The topic? The lockdown, of course. Now, do we really need another Covid-19 book? Yes, absolutely, because hardly anyone has described the first Covid-19 year as truthfully and as funnily as Ralf König in Vervirte Zeiten. Just imagine: Konrad and Paul, König’s famous gay couple, in lockdown. Locked in their apartment, their differences become more evident than ever before: Konrad is the cultivated, sensitive piano teacher who can easily cope with the restrictions; the libido-driven Paul writes gay porn and grows more and more frustrated and restless. For decades, Konrad had come to terms with Paul’s polygamy - but when Paul sends the hot branch manager of the nearby supermarket a photo of his penis, Konrad explodes. This unusually violent friction between Konrad and Paul creates tension - and additional comedy. Vervirte Zeiten is different from most Covid-19 diaries. König doesn’t describe his own everyday life and his personal state of mind, but rather processes his observations in the familiar fictional cosmos of Konrad and Paul. In real time, so to speak. An advantage of the familiar ensemble of characters with Konrad and Paul’s homosexual and heterosexual environment is the variety of perspectives; König looks at the situation through the eyes of the many characters, who all react differently. Most importantly, König is neither a commentator, nor does he line up stereotypical lockdown jokes; König is a storyteller. It is fascinating to observe how the initial situations gradually develop into stories, how the storylines and running gags are more and more linked with each other and turn into a 192-page novel. It’s simply brilliant how König transforms oppressive everyday reality into humorous fiction. In a few years, Vervirte Zeiten will be one of those books that we reach for to remember what it was like in this first year of the pandemic.\nNetherlands\n&Belgium\nSelected by Gert Meesters\nGert Meesters is associate professor of Dutch language and culture at the University of Lille, France. He is a co-founder of the comics research group Acme in Liège, Belgium and co-edited essay collections about French publishing house L’Association, the comics magazine (À Suivre) and the character Spirou. Since 2001, he has been writing weekly comics reviews for the Flemish news magazine Knack.\nThe pandemic may have had an influence on the sales figures of Dutch language comics last year, but the production was nevertheless rich and varied, both in The Netherlands and in Belgium. This is a selection of six books that stood out, three from each country, with two coming from experienced cartoonists and one from a debuting author.\nIk kom van ver maar blijf niet lang (‘I’ve come far but I won’t be staying long’)\nby Ward Zwart & Enzo Smits\nBries\nLast autumn, Ward Zwart, one of Belgium’s most original drawing talents, died at the age of 35. The posthumous publication of Ik kom van ver maar blijf niet lang (‘I’ve come far but I won’t be staying long’) makes it abundantly clear what potential was lost with his premature death. The book builds on the universe of Wolven (‘Wolves’), his previous collaboration with writer Enzo Smits. A group of young people grow up in a remote village in the late nineties. More than the events, Ik kom van ver maar blijf niet lang is about the atmosphere: the forest that Zwart portrays with much love, the soundtrack with Sonic Youth and Unwound, hesitant infatuations and broken dreams, starting bands, skaters and mean village gossip. Whole pages just show walking characters in changing landscapes. Zwart cultivated an unfinished side in his drawings, a vagueness that emphasises the drawing process rather than the finished illustration. Thus, his last and best book resembles a VHS cassette with visual noise that takes the reader back to teenage years in the late nineties.\nAaron\nby Ben Gijsemans\nOogachtend\nAaron is a young man who is trying to study for summer exams. He is not doing very well because he is confused. His parents and friends don’t seem to understand him, but he himself doesn’t quite know who he is either. He takes refuge in his treasured collection of superhero comics or looks out of the window at the football pitch, where a little boy comes to play now and then. When he notices that he is irresistibly attracted to that boy and to his brother’s stepson, he initially refuses to accept it. He does everything to comply with social expectations, but fails. Aaron is not primarily a book about the taboo subject of paedophilia, but about a young man who has to learn to accept himself as he is, even though that is terribly difficult. His paedophilia makes his life thoroughly miserable, but for the sake of the book, it could just as well have been another irrepressible inclination that prevented him from fitting into society’s mould. After his international breakthrough with his debut Hubert (in English from Jonathan Cape), it took Ben Gijsemans six years to make Aaron. He impresses with a slow, slightly detached narrative style. His drawings are snapshots that differ so little from the previous one that you sometimes have to look hard for the changes. Gijsemans shows in a nuanced way what is happening, but does not give any explanation. Graphically, an unusual stylistic consistency and an almost maniacal finish stand out, both in the pages with Aaron and in the superhero comics that Aaron reads. In drawing the latter, Gijsemans proves that he has all the skills that would have been required to work in the pre-war American comic book industry. Both the drawings and the stories are successful pastiches of the superheroes of that period. Aaron has to accept that he cannot control himself entirely, but the book about him is controlled to the extreme.\nAlles Leeft (‘Everything Lives’)\nby Wasco\nScratch Books\nLast year, Wasco won the Stripschapprijs, a prestigious oeuvre prize in the Netherlands. Despite the man’s long career, his name is still quite unknown to a wide audience. Alles leeft (‘Everything Lives’) is an ideal book to get to know his completely unique work. The book is made up of eleven 24-hour comics. In Wasco’s case, the pressure of having to finish a story in a day and a night leads to stories with penguins, cats, dogs and a man with a pointed hat called Mr. Tuitel, but keys and cafetières also play a part as expressive characters. The spontaneous genesis is clear, as the characteristic small talk and miraculous events in Wasco’s work are far removed from a traditional story arc. Nevertheless, Wasco’s own interpretation of comics leads to intriguing pages that not only display a personal fantasy world, but also a poetic quality. With somewhat exaggerated self-deprecation, the author himself describes the stories in the collection as “reasonably successful failures”.\nNaomi Vertelt 1: Spaans Rood (‘Naomi Tells 1: Spanish Red’)\nby Milan Hulsing\nScratch Books\nIn Spaans Rood (‘Spanish Red’), the teenage writer Naomi from Milan Hulsing’s previous book De Smokkelaar (‘The Smuggler’) serves as glue to bring different storylines together nicely. On a Caribbean island, she watches passers-by. She attributes adventurous lives to them, which she commits to paper, to the delight of her friend Katja and her school teacher. She writes about a famous columnist who had to move to the island when he was exposed for plagiarizsing his profound writings from the B-movies of an anonymous scriptwriter. Meanwhile, worrying things are also happening in Naomi’s surroundings. What exactly does Katja’s uncle do on his yacht and how does he run his publishing business? The borderline between Naomi’s pure fabrications and the facts is deliberately blurred in the book. The literary foundations and the believable distant settings naturally connect Milan Hulsing’s recent work with Hugo Pratt’s classic Corto Maltese stories. Spaans Rood is a rich book, told from a surprising perspective.\nZwanendrifters (‘Swan Breeders’)\nby Dido Drachman\nScratch Books\nThe stage is the Dutch province of Gelderland in the Nineties. Young Bettie is not well off. Her father is an alcoholic and her older brother is a criminal. Her mother Zwaantje left a long time ago and remains a big mystery to her daughter. Apart from a video cassette containing half an episode of the TV show The Wheel of Fortune, in which her mother took part, Bettie can find few traces of her existence at home. She starts connecting to former neighbours and colleagues in order to know who Zwaantje was. As a result of her efforts, pious fellow villagers take pity of her situation and offer help. Bettie’s family, however, does not approve. As a story about a child in poverty and related emotional misery, Zwanendrifters (‘Swan Breeders’) is somewhat reminiscent of the acclaimed book and movie De helaasheid der dingen (‘La merditude des choses’ in French), but the differences are so obvious that Zwanendrifters can only be a tender, more intimate counterpart to the latter. The use of colour and the slow moments in this debut by the female Dutch cartoonist Dido Drachman reveal a strong storyteller. The room for improvements in style, narrative routine and clarity is already apparent. Zwanendrifters is a subtle and empathic first book.\nDe Kever en de Koning (‘The Beetle and the King’)\nby Thibau Vande Voorde\nOogachtend\nIn 1899, Joseph Lippens sets off on an expedition to Congo Free State, as it is then called, the personal possession of Belgian King Leopold II. Joseph goes looking for his father, who is known as the King’s best ivory trader, but nothing has been heard of him for some time. One evening in the bush, a strange beetle flies into Joseph’s ear. It is the beginning of a mental and physical ordeal for the whole expedition. Not only does Lippens come across strange fauna and local tribes whose people he does not want to understand, but in his feverish dreams, Leopold II appears as a giant father figure. De Kever en de Koning (‘The Beetle and the King’) may now and then refer to Arsène Schrauwen, Olivier Schrauwen’s unrivalled madcap Congo epic, but its more serious tone makes it the first Flemish comic to attack the madness of colonisation head-on. Technically spoken, Vande Voorde’s pages display a splendid technical mastery. With his colour pencils, he evokes the scorching heat of the tropics as if he had lived there for years. The only flaw of the book is the somewhat amateurish lettering, but on the whole, this debut is extremely promising.\nNorway\nSelected by Kristian Hellesund\nKristian Hellesund is deputy headmaster at a primary school in Bergen, Norway. He has a weekly comics column in the Sydvesten newspaper, and he has been writing about comics since 2006 for the serienett.no website. Hellesund has been involved in several comics events in both Norway and abroad as organiser, moderator and lecturer. Hellesund is working on a book on Norwegian comics history. In addition to his teacher’s degree, Hellesund has a bachelor degree in history. He was awarded the Raptus prize in 2011 for his work promoting Norwegian comics.\nPondus\nby Frode Øverli\nStrand forlag\n2020 has been a very interesting year to follow the Norwegian comics scene. It is a divided between commercial titles widely available at newsagents and supermarkets, and the more artistic and independent releases, more likely to be found in specialist stores, by mail order or at comics festivals and events. The mainstream scene mostly consists of humour comics in strip format mainly published in newspapers and comics books. The most popular of these strips is Pondus by Frode Øverli, which is also a monthly comic book. It marked a big change in the market when Øverli in 2019 took his strip from the de facto monopolist publisher Egmont to the small Strand forlag. Also, Børge Lund’s Lunch strip went the same way. A bit before, Lise Myhre’s Nemi also left Egmont. So Egmont has been trying out several new concepts in 2019 and 2020, including giving veteran artist Øyvind Sagåsen’s strip Radio Gaga a magazine of its own. This situation has boosted both Øverli’s and Sagåsen’s work, and both comic strips have been a more interesting read than for years. 2020 was the 25th anniversary of Øverli’s first Pondus strip in the Vestnytt newspaper in 1995. This comic also has a following outside of Norway with books and magazines printed in Denmark and Sweden.\nIntet nytt fra hjemmefronten (‘No News on the Home Front’)\nby Therese G. Eide\nEgmont\nNorway’s comics annuals or julehefte are a special tradition dating back to 1911. A combination of Norwegian and foreign series, the bestsellers reach about 100,000 copies each year. Therese G. Eide had her first annual last year with her series Intet nytt fra hjemmefronten (‘No News on the Home Front’). She makes a partly biographical comics series about her life as a mother with three young children. It started out on Instagram, but these days it can be found in newspapers and comic books with both strips and longer narratives. The quality is high, and Eide is excellent at presenting trivial family situations with a twist, providing both funny moments and philosophical afterthoughts. A third book comes out this Spring, but the 2020 annual is probably the best collection so far with Winter- and Christmas-related stories. Her book of personal stories from the 2020 pandemic, Koronadagbøkene (‘Corona Diaries’), is also well worth checking out.\nMitt liv som tegning (‘My Life as Drawing’)\nby Lars Fiske\nNo Comprendo Press\nLars Fiske’s work has had international recognition. He has published several autobiographical works, and his Olaf G. collaboration with Steffen Kverneland was both a biographical graphic novel about the Norwegian artist Olaf Gulbransson and a gonzo-journalist adventure in Bavaria through Kverneland and Fiske’s observations, interpretations and artwork. In 2020 Fiske published another autobiographical work. In Mitt liv som tegning (‘My Life as Drawing’), he presents an annotated sequential selection of pages from his sketchbooks combined with present afterthoughts drawn in his personal and strict geometrical style. It is an interesting read, where Fiske’s reflections on both his life and his art offer insights into his career and his life with his wife Anna. There is a fine line between being personal and exposing oneself, but Lars Fiske keeps a steady balance. The sketches are of special interest as they show the craftsmanship of Fiske experimenting in various styles. This is one of the best Norwegian graphic novels of 2020, and it deserves to be translated to reach a wider audience.\nHva skjedde egentlig med deg? (‘Whatever happened to you?’)\nby Jenny Jordahl\nCappelen Damm\nJenny Jordahl has seen many translations of her collaboration with writer Marta Breen, Kvinner i kamp about important female activists fighting for equality and women’s rights, including two English versions as Women in Battle and Fearless Women. On her own, Jordahl released a graphic novel last year about twelve year-old Janne. Hva skjedde egentlig med deg? (‘Whatever happened to you?’) is a story about growing up with an eating disorder. The book is meant for young readers, but it has a universal appeal showing pains during puberty. Jenny Jordahl’s artwork is striking, and she dares to use non-figurative images as a contrast in her storytelling. Her book was deservedly awarded the Brageprisen, the Norwegian literature award, for the best children’s book of 2020.\nJobb (‘Job’)\nby Anders N. Kvammen\nNo Comprendo Press\nJobb (‘Job’) is a partly autobiographical work, in which Kvammen tells us about his experience working in different jobs from his teenage years to being a young adult. It is a bittersweet story showing many aspects of life, and Kvammen proves that he is one of the most interesting comics artists in Norway at the moment. His style is not photorealistic, but it is personal and detailed with an impressionist touch. Jobb is Kvammen’s second graphic novel and signals that more impressive comics are to come. His first book, Ungdomsskolen (‘Secondary School’), has been translated into Russian, and Jobb now has a Polish edition.\nMarbakken (‘Downward Slope’)\nby Anja Dahle Øverbye\nSelf-published\nAnja Dahle Øverbye has seen an English translation of her first graphic novel, Hundedagar (‘Dog Days’), released by Centrala in 2018, and her last book Bergen has come out in a French edition. Her books so far have been coming-of-age stories with partly autobiographical content. Her artwork has a personal style, and usually she works in black and white with pencils. In 2020, she released the autobiographical fanzine Marbakken (‘Downward Slope’) in a limited print run of 200 copies. This was one of the most interesting comics in Norway last year, showing Dahle Øverbye’s own angst and depression after cancer treatment. Her meetings with a psychologist are shown together with glimpses of everyday life. It is a daring work with beautiful and touching artwork.\nThe Philipines\nSelected by EK Gonzales\nEK Gonzales has followed the Filipino komiks scene since around 2011, and is best known for reviewing most of them at KomikNinja. They are a contributor to the Philippine Star’s online lifestyle section Geeky.ph, telling more Filipinos about current komiks.\nThe commercial comics industry in the Philippines ended in the late 1980s, with mostly newspaper comic strips remaining. What replaced the industry was an independent comics movement that grew through self-publishing and komik conventions. The biggest change in 2020 occurred to all of Filipino komiks. Quarantine lockdowns forced komik conventions to be cancelled and to move online. This hastened the creation or improvement of Filipino komik hubs. Komiks previously available only as self-printed booklets became digitally available online. Komiks previously scattered on international websites like Tapas and Webtoon were collected as well, and so were now easier to find. Overall this improved the exposure and availability of Filipino komiks. The three titles below could not adequately represent the breadth and depth of current komiks. We encourage you to explore the available content in the existing online platforms. The Filipino komik hubs are accessible at: Penlab (all genres, majority of local komik convention regular creators and titles); WebKomPh (all genres, more newcomer titles); and Haliya Publishing (focuses on alternative komiks).\nDoobiedoo Asks\nby Bambi & Roland Amago\nKomiket\nThis graphic novel is a semi-autobiographical story of how these parents discovered and learned to accept that their son Doobiedoo is on the autism spectrum. This is not as simple as it sounds and took longer in their case, with the accompanying disappointments and anguish. This is balanced with the successes and victories, learning to be a family with an intelligent, loving boy. The graphic novel is presented in beautiful full colour and with intelligent variation in panelling, all the better to show the emotions in this family story. It is one of the first two entries of the (Philippine) Komiket’s first Philippine International Comics Festival (PICOF), whose ultimate goal is to present the best of current Filipino komiks to the world. You can find a Preview here…\nTrese: Bloodlines Vol. 1\nConcept by Budjette Tan, created by Mark Gatela, Brandie Tan, JB Tapia, Brian Balondo, Marvin del Mundo, David Hontiveros & KaJO Baldisimo\n19th Avenida Publishing House\nNetflix International will soon feature the animated adventures of Alexandra Trese, protector in Manila between supernatural beings from folklore and humans. As such, she also keeps both in line, when criminal activity threatens to destroy the balance. The Trese komik series by Budjette Tan and KaJO Baldisimo is now being released internationally, as part of the Netflix interest. This anthology book though is one of the first in a spinoff series, dominantly featuring Alexandra’s brothers who are in different professions, but all aligned in defending this same balance. They include a priest defending humans against malevolent demons; a historian of their line of protectors; and a ruthless killer of otherworldly beings who cross the line. The core concepts are provided by Budjette Tan, while the individual stories are executed by his friends, some of the best comic creators, many working in the international industry. Some stories are crossovers with komik characters by Tan’s friends, which are a detective and a superhero. These stories have generous violence and gore, but are some of the best detailed art in komiks, with good scripting on all the pieces. You can find a Preview here…\nTarantadong Kalbo (‘Shamelessly-Disrespectful-Foolish Baldy)\nby Kevin Ray Raymundo\nKomiket\nPrior to 2020, this webcomic was more about the days in the life of a young couple and 1990s nostalgia. But during the pandemic, it became a biting mirror of the stumbling policies and statements of Rodrigo Duterte’s government in the eyes of the ordinary citizen. Through the brightly coloured and well-controlled art which represented key government personalities, the webcomics amplified in sharp relief the inequality of the rich and powerful against the poor and working class. It emphasised how erratic and confusing, and therefore unhelpful, many of the pandemic policies were. It sharply showed the inconsistencies and lies that came with official statements, in a way that was both angry and lighthearted at the same time. While there are other political webcomics now, this is one of the fastest, and one of the most astute, while still consistently comedic. The best of these webcomics were compiled near the end of last year.\nPortugal\nSelected by Gabriel Martins\nGabriel Martins has been writing about comics since 2006 on several blogs and websites. He also wrote a couple of prefaces for Portuguese editions and is, since the beginning, on the jury of the Portuguese Comic Con Awards. Occasionally he writes for comic fanzines (or just for himself) and has been nominated at Amadora BD Festival for a Portuguese-German collaboration entitled ‘OhZona’, which explores the wonders and terrors of Carnival. He has recently started a podcast with Pedro Moura and André Oliveira entitled ‘Three Degrees of Baldness’, which aims to reflect and discuss about many aspects and themes about the creation of comics.\nDespite 2020 being the year of Covid, it was still a productive one for comics in Portugal. The second issue of Filipe Abranches’ anthology UMBRA (Umbra Edições) and The Lisbon Studio’s anthology Raízes (‘Roots’) (A Seita / Comicheart) continued their respective publications, gathering the usual suspects and some new blood. It is always good to see these projects keeping up the pace and their intention of continuity. One special note about UMBRA #2 is that it recovers a short story from 1978 by the late Fernando Relvas. Last year also saw the comeback of Filipe Melo and Juan Cavia, who mature with each new project, bringing us Balada para Sophie, a book that quite easily proved to be a crowd-pleaser. Before starting on my personal picks, I also need to highlight two numbers from the kuš! series, two mini comics directly from Latvia made by two Portuguese authors, Hetamoé and Joana Estrela. Violent Delights (Mini kuš! #87) from Hetamoé uses Shakespeare’s comic-tragedy Romeo and Juliet to draw a parallel with our modern times, creating an environmental cautionary tale distinctive in both its narrative and graphics. Joana Estrela’s take with Eglé and the Snake (Mini kuš! #89) is a very intense tale about abuse and fear. In one of her most chilling works, Estrela is capable in a few pages of making us feel that sense of panic from the strong hug of a snake. Last but not least, and escaping a little from the comics focus, I need to mention Mishima – Manifesto de Lâminas (Chili Com Carne) gathering Tiago Manuel’s illustrations for an exhibition about Mishima. Tiago Manuel is a national treasure of ours, so there’s no way I couldn’t at least quickly mention this work.\nEinstein, Eddington e o Eclipse (‘Einstein, Eddington and the Eclipse’)\nby Ana Simões & Ana Matilde Sousa\nChili Com Carne\nThis was another work developed within the scope of an exhibition, E3 - Einstein, Eddington, Eclipse, at the Museu Nacional de História Natural e da Ciência in Lisbon. It’s a book composed of both an essay and a comic. The essay is by the historian and professor Ana Simões, while the comic is by the author and artist Ana Matilde Sousa. I am always very invested in this kind of partnership, and seeing science and comics holding hands in this book is really something special. Ana Matilde Sousa (better known in the world of comics by the pen-name Hetamoé) took the correspondence exchanged by Eddigton with his mother, sister and the Lisbon Observatory to recreate visually this famous trip. Her collection and processing of digital images, as well as her explorations with the printing and inking of these pages, emerge in a very impressionistic and unique graphic story. It’s for sure one of the most beautiful pieces of comics imagery we had this year, giving us a sense of what this voyage could have been like and the feelings experienced by the participants.\nDiários do Corona (‘Corona Diaries’)\nby Bruno Borges\nFojo / O Gorila\nThe year 2020 will always exist under the shadow of COVID-19. Due to the pandemic affecting so many businesses, especially those linked to culture, it is quite possible that many works had to be postponed. But a door, when opened, always leads in two distinct directions, so it is interesting to see and analyse how many works were born due to the pandemic situation we are still living through. One of those works is Diários do Corona using texts by the author Bruno Borges and also by Rosa Machado. The work started being shared on social media and had its phyisical publication in September 2020. It spans four months of living with COVID-19, some of them in the dreadful confinement. Bruno Borges addresses several issues, such as the fear and paranoia that assaulted many of us during these days, and even now, and always with a touch of humour and/or irony. Not to diminish their seriousness, but because, to quote the author, ‘It seems to be the healthiest way to avoid being eaten alive by the lions’. I agree.\nPalácio (‘Palace’)\nby Francisco Sousa Lobo\nSelf-published\nOne of the biggest surprises of the year was the unexpected self-publication by Francisco Sousa Lobo of this first issue of Palácio printed in a newspaper format (50x32 cm). Sousa Lobo has become one of the most relevant comic authors of our time, so to be presented with a regular publication from him is always a good news. Through these numbers (the second is already available), Sousa Lobo intends to explore the writing of fiction, essays and documentaries using comics art as the medium of communication. In this first number we have nine short comics that explore several distinct themes such as: a link between depression and capital; divorce in the words and thoughts of Theodore W. Adorno; a brief reflection on the work of Corinta Kent - a nun whose work was only fertile in the constitutional environment of a school and convent; or even the sadism inherently linked to some academic traditions in Portugal. It’s food for the mind on several subjects, so we can look forward to a feast with each number.\nDesvio (‘Detour’)\nby Ana Pessoa & Bernardo P. Carvalho\nPlaneta Tangerina\nPlaneta Tangerina was founded in 2004 and has quickly become a landmark in the publication of children’s books. In 2012 they started a new collection entitled Dois passos e um salto (‘Two Steps and Jump’), intended for older readers. With this collection they also opened the doors for graphic novels, when Finalmente o Verão (‘This One Summer’) by Mariko and Jillian Tamaki was published in 2014. This year brought the first collection of comics by two Portuguese authors: Desvio. Of course there is no age limit to reading and appreciating this book, but it is specially interesting that the publishers are focussing on material aimed directly at teenagers, a genre that is still very scarce around here. Of course, we have American superheroes and many Franco-Belgian classics, but books like Desvio are very distinct in the sense that they are not just aimed at teenagers, they are about them as well, about the struggles we all faced growing up and reflections on so many doubts that can still haunt us as adults.\nBottoms Up\nby Rodolfo Mariano\nChili Com Carne\nBottoms Up was the winner of the seventh annual competition entitled Toma 500 Paus E Faz Uma BD (‘Here’s 500 Bucks To Make A Comic’), organised by the association Chili Com Carne. Last year I highlighted the winner of this competition, the anthology All Watched Over by Machines of Loving Grace, which is my way of saying how important this competition has become for the publication of comic books in Portugal. Bottoms Up was presented as the first book by Rodolfo Mariano for a wider audience, despite it continuing the exploration of the author’s fantastical universe full of anthropormophised characters, some of which we’ve seen in previous works. One of its main distinctions is the use of colour, replacing Mariano’s usual black-and-white. According to the author, Bottoms Up was composed as kind a dare, where he had to finish one page each day, the colouring as well, between November 1st and December 31st, 2019. This childish aestetic is used to tell unrealistic tales that can be as funny as they are brutal or even morbid (the Fox chapter is simply amazing). In this sense, it’s reminiscent of Simon Hanselman’s approach in Megg and Mogg: a wolf in sheep’s clothing.\nSpain\nSelected by Alfons Moliné\nAlfons Moliné is an animator, translator and writer on comics, animation and manga. He is the author of a number of books, including El Gran Libro de los Manga (Glénat, 2002) and biographies of Osamu Tezuka, Carl Barks and Rumiko Takakashi. His most recent work is ‘Cuando Daredevil Se Llamaba Dan Defensor’ (Diábolo Ediciones), a history of Ediciones Vértice, the publishing house that brought Marvel’s superheroes for the first time to Spain.\nSubnormal: Una historia de acoso escolar (‘Subnormal: A Story of School Harassment’)\nby Fernando Llor & Miguel Porto\nPanini Spain\nSubnormal deals with one of the biggest scourges of today’s society: bullying, or school harassment, shown here without any sugar-coating and in all its crudeness. It is based on the real-life story of Iñaki Zubizarrieta, whose unusual stature — over 2 metres at age 11 — made him the object of humiliation and threats from his schoolmates, and incomprehension from his teachers, to the point that he almost considered committing suicide. Fortunately, he found an escape route by joining a basketball team, where he finally discovered the values of friendship, teamwork and self-improvement, eventually becoming a highly acclaimed, award-winning player in that sport. Llor’s wrenching script is enhanced by Porto’s art, a young Galician talent with nearly two decades of experience as a cartoonist and illustrator, who excels particularly in the use of colour and the facial expressions of the characters, mainly in the violent scenes in which the hapless protagonist is bullied by his peers. The 152-page book has an epilogue by Zubizarrieta himself who, now retired from basketball, is currently giving talks in schools on how to cope with bullying. Subnormal has been widely acclaimed not just by comic fans, but also by educational and social institutions, and a live-action movie adaptation is in development.\nQueridos difuntos (‘Dear Departed’)\nby Lorenzo Montatore\nSapristi\nLorenzo Montatore (an alias for Javier Lorenzo García) has been working for fanzines and small publishers for over a decade, quickly earning a cult following for his minimalist, nearly-abstract style bursting with psychedelic colours. His influences include 1950’s UPA animated cartoons and the Super Mario Bros. videogame universe, as well as other legendary Spanish authors such as Max, who has specifically praised Montatore’s work. His previous publications include the children’s comic Lola & Blu and the graphic novel ¡Cuidado, que te asesinas! (‘Watch out, you’re murdering yourself!’), published by La Cúpula. Queridos difuntos centres on the subject of Death, here personified as a red-haired woman, who gets tired of her job as a life-reaper. Together with her helper, a loud-mouthed devil, she decides to descend to Earth to experience the true meaning of life and how humans perceive their emotions and feelings (a subject already tackled, for example, in Neil Gaiman’s Sandman), settling in a small village in rural Spain. Presented as a six-act play, with interludes by a kind of Greek chorus, this 128-page graphic novel artfully blends surrealism and ‘esperpento’ (a genuinely Spanish literary genre, created at the beginning of the 20th century, used to criticise society by grotesquely deforming reality), resulting in a scathing portrait of human miseries. Some of Montatore’s other works can be downloaded here…\nLa cólera (‘The Rage’)\nby Santiago García & Javier Olivares\nAstiberri\nIn 2014, writer Santiago García and artist Javier Olivares scored a hit with Las Meninas, published in English by Fantagraphics in 2017 as The Ladies-in-Waiting, a multi-award-winning graphic novel about the story behind Velázquez’s famous painting of the same name. Now they have struck gold again with this 240-page epic, an updated version of the quarrel between king Agamemnon and warrior Achilles, taken from Homer’s Iliad. The authors present a parallel between this conflict, which represents the very roots of European civilisation, and Europe’s current situation, proving that little has changed over the centuries. With humanity fighting the same wars over and over again, we are led to the conclusion that ‘we are all children of Achilles’ rage’. Olivares’ art reaches new heights here: the story’s first forty pages are a battle sequence depicted in large panels with no dialogue, which efficiently immerses the reader in the story, while the human figures display an influence from ancient Greek vase paintings, coupled with solid layouts and a clever use of colour, with a predominance of red hues to express Achilles’ anger. This is a truly innovative work, not just graphically, but also narratively: in a given moment, Achilles becomes involved in a dreamlike sequence about a futuristic Europe, where he is reincarnated as a woman — Achilles’ ‘queer’ personality is also discussed in the plot —like a ‘story-within-the-story’, and the reader must turn the book to read it. Despite the Covid crisis, La cólera has been both a commercial and critical success, and international editions should follow soon.\nBonus List:\nSiempre tendremos 20 años (‘We’ll Always Be 20 Years Old’) by Jaime Martín (Norma);\nTarde en McBurguer’s (‘An Afternoon at McBurguer’s’) by Ana Galvañ (Apa Apa);\nYo, mentiroso (‘I, Liar’) by Antonio Altarriba and Keko (Norma);\nRegreso al edén (‘Back to Eden’) by Paco Roca (Astiberri); and\nAlgo extraño me pasó camino de casa (‘Something Funny Happened On My Way Home’) by Miguel Gallardo (Astiberri).\nSwitzerland\nSelected by Christian Gasser\nChristian Gasser is a Swiss fiction-writer, journalist and lecturer at the Lucerne University of Art & Design. He reviews comics for various newspapers, magazines and radio-networks in Switzerland and Germany. He is also the co-editor of the comics-magazine STRAPAZIN and a member of the “Max und Moritz Preis”-Jury of the Erlangen Comic-Festival. His latest books are: Animation.ch. Vision and Versatility in Swiss Animated Film (2011, as an enhanced e-Book in 2016), Comix Deluxe (2012) and Rakkaus! (Finnish: Liebe) (novel, 2014).\nDie Farbe der Dinge (‘The Colour of Things’)\nby Martin Panchaud\nEdition Moderne\nDie Farbe der Dinge (‘The Colour of Things’) is a unique experience. It’s an action-driven road story, a family drama, as well as a touching Coming-Of-Age-ballad. And above all, it’s a mind-boggling graphic adventure. Let’s start with the story: Simon Hope is an overweight and bullied teenager from a messed-up family background. Based on the prediction of a clairvoyant, he bets his father’s secret savings on the right horse – and suddenly holds a betting slip worth a million pounds in his hands. However, he can only cash it in with his parents’ signature – but his father goes into hiding after beating Simon’s mother into a coma out of rage over the disappearance of his money. Simon’s betting slip arouses many desires, another father – allegedly the real one (?) – turns up, and a crazy chase begins, in which a motorcycle gang, Simon’s three school-bullies, a girl, the tabloids and a blue whale play important roles. The story is great, but the Die Farbe der Dinge is first of all noticeable for visual reasons: it is told from a vertical bird’s-eye perspective: the people are reduced to circles, distinguishable only by their colour, and the objects to pictograms. This stylistic process is not entirely new - Richard McGuire experimented with it in his short comic ‘ctrl’ and his animated short Micro-Loup. Panchaud, however, takes this design to a new level: Die Farbe der Dinge is a complex novel of 224 pages. The interesting thing about Panchaud’s experiment is that you get used to the unusual overhead perspective surprisingly quickly. You accept that you see neither faces, bodies nor spaces, and you invest the pictograms yourself with details and life. It is Panchaud’s merit to tell a story that is, despite the abstraction, always clear and understandable. What at first seems like an exercise in style or sober data visualisations turns out to be a gripping coming-of-age and road story that easily keeps the epic distance. However, this is not only due to the visual design, even if every page is a gem of clever design, colouring and staging. No, this is primarily due to the excellent storytelling and the dialogues that effectively stage the plot and the complex relationships between the circles, err… characters. This is an idiosyncratic comic; it looks experimental, but it is highly entertaining, it looks matter-of-fact, but is very emotional. A rare balancing act. By the way, in 2016, Panchaud turned Star Wars - A New Hope into an infographic adaptation in form of an 123 meters long drawing. It was obviously an online hit, praised even by Mark Hamill.\nPosted: February 25, 2021",
  "word_count": 8136,
  "scraped_at": "2026-02-14T13:43:19.763565"
}