{
  "article_id": "00898ce86cea",
  "url": "https://www.yahoo.com/news/articles/unsolved-mysteries-dark-people-still-123103781.html",
  "title": "These Unsolved Mysteries Are So Dark , People Are Still Thinking About Them Years Later",
  "date": "20250824T130000Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "These Unsolved Mysteries Are So Dark, People Are Still Thinking About Them Years Later\nDo you love all things scary, dark, and creepy? Subscribe to the That Got Dark newsletter to get your weekly dopamine fix of the macabre delivered RIGHT to your inbox!\nOver the years, we've asked the BuzzFeed Community to tell us about an unsolved mystery they just couldn't stop thinking about many times. There were so many comments and responses that we decided to gather the most prominent ones. Here are the terrifying stories people shared:\nWarning: Disturbing content ahead, including stories involving murder and extreme violence.\n1.The Yogurt Shop Murders\n\"It is Austin’s most famous unsolved murder — four teenage girls were murdered for NO reason.\"\nThe Yogurt Shop Murders took place in Austin, Texas, on December 6, 1991, when four teenage girls were found bound, shot, and killed in a burning “I Can’t Believe It’s Yogurt!” shop. The case shocked the community and led to multiple wrongful convictions later overturned due to coerced confessions and mismatched DNA evidence. Despite decades of investigation and advances in forensic testing, the crime remains unsolved and is considered one of Austin’s most infamous cold cases.\n2.The disappearance/murder of Molly Bish\n\"It was all over the local news at the time, and it hit me pretty hard. Her body was found a couple of years after she disappeared, but her killer remains unknown.\"\nMolly Bish was a 16-year-old lifeguard who vanished from her post at Comins Pond in Warren, Massachusetts on June 27, 2000. According to investigators, Molly was gone just after 10:00 a.m., but wasn't reported missing until almost two hours later, and police didn't speak with her mother until after 1 p.m.\nAccording to Molly's mother, \"The crime scene was almost completely destroyed, and it has had devastating consequences to this day. We have had little DNA to work with and little information.\"\nBish's remains were found in 2003, a few miles from the pond, in the woods.\nNBC 10 Boston reported in June 2023, \"The search for Bish's killer has led investigators to convicted rapist Frank Sumner, who died in 2016, but more [DNA] testing needs to be done.\"\nIn June 2025, her family hosted a vigil marking 25 years since her disappearance, emphasizing that the investigation is still active and ongoing.\n3.The sketchy disappearance of Kierra Coles\n\"Pregnant postal worker from Chicago missing since 2018. She withdrew money from an ATM and then disappeared. General consensus is that she was killed, but no body was ever recovered.\"\nKierra Coles was 26 years old and roughly three months pregnant when she went missing on Oct. 2, 2018. Her last known movements on that day were captured on CCTV camera, which the Chicago police released in 2022.\nAccording to ABC News, \"The surveillance video showed a man — who is considered a person of interest — arriving at Coles's home, and later Coles and the man were seen driving away in Coles's car. At about 10:43 p.m. that night, Coles was spotted on surveillance video making ATM withdrawals — the last known images of her, according to police.\nLater that night, Coles's car was parked in another part of the city, police said. The person of interest was seen getting out of the passenger side, but nobody got out of the driver's side, according to police.\nThe next day, the person of interest was seen parking Coles's car near her home and going inside, police said. He then left Coles's home and drove away in his car.\nWhen the person of interest was interviewed, police said he gave varying accounts of the last time he saw Coles.\"\n4.The mysterious death of Mitrice Richardson\n\"The Mitrice Richardson case is terrifying. She was showing signs of a mental health episode, was released from jail after midnight without her wallet, phone, or any way to get home, and her remains were found by park rangers 2.5 miles from the sheriff's station almost a year later. A cause of death was never determined; her family suspects foul play, but the sheriff's department insists there's no evidence.\"\nRichardson was a 24-year-old Cal State Fullerton grad who went missing on Sept. 17, 2019. Richardson was last seen allegedly leaving a sheriff's station in Malibu. (Earlier, she had been detained by sheriff's deputies after a restaurant manager made a citizen's arrest complaint.) Eleven months went by before her body was inadvertently found by park rangers in August 2010 in Malibu Canyon.\n5.The upsetting disappearance of Jaquilla Scales\n\"I live near Wichita, Kansas, and there was a little 5-year-old Black girl named Jaquilla Scales who went missing just before 9/11 happened. Sadly, the events of 9/11 overshadowed her disappearance, and her fate has never been known.\"\nAccording to KWCH, \"Jaquilla was 4 years old when she was last seen in her bed at around 12:30 a.m. on Sept. 5, 2001. She was discovered missing at 3:00 a.m. at her home in the 1600 block of N. Volutsia. Six days after she disappeared, the 9/11 attacks occurred.\" An age progression photo was released by Kansas Bureau of Investigation in 2022.\n6.The murders of Kevin Ives and Don Henry\n\"It happened in 1987 in Alexander, Arkansas. They were two boys I attended high school with. They were murdered and then placed on a railroad track where they were run over by a freight train. The sheriff did a HORRIBLE job at the crime scene, and the case is still unsolved.\"\nAccording to Arkansas Online, \"Early on the morning of Aug. 23, 1987, a Union Pacific crew spotted the bodies of Kevin Ives and Henry wrapped in a tarp on the tracks. Unable to stop in time, the train ran them over, finally coming to a complete stop in Benton where Union Pacific employees reported the incident to the police. The teenagers had stayed out late hunting the night before.\nThough a gun was found near the bodies, investigators initially ruled the incident as a suicide or related to drug use; later reviews of autopsies revealed they had been murdered, their bodies placed on the track near or shortly after their deaths.\nIn 1988, Richard Garrett, an attorney for the victims' families, appeared on Unsolved Mysteries to discuss the murders. During an interview with the host, Garrett said he believed the two boys 'saw something they shouldn't have seen and it had to do with drugs.' Kevin Ives' and Henry's deaths were ruled homicides in March 1990.\nNo arrests were ever made.\"\n7.The strange disappearance of Jodi Huisentruit\n\"Jodi was a news reporter who overslept for work. Her colleague calls and wakes her and she says she will be there shortly. Jodi rushes through her morning routine and rushes to her car. She is ambushed by her car and abducted. Left behind at the scene is a variety of her personal items and a bent car key.\"\nHuisentruit was a news anchor in Mason City, Iowa who disappeared on June 27, 1995 on the way to work. There were apparently signs of a struggle outside of her apartment, so it was presumed she was abducted. Although there were thousands of tips and interviews conducted, Huisentruit was not found and declared legally dead in 2001.\n8.The confusing disappearance of Alexis Patterson\n\"She's been missing from Milwaukee since 2002. She was 7 years old and dropped off at school by her stepfather but never made it into the building. Some people speculated that her mother and/or stepfather were somehow involved, but there was never enough evidence to arrest either of them. They insisted that they had nothing to do with her disappearance. It's probably ridiculous, but I will always watch my kids actually walk into the building when I drop them off at school before I drive away.\"\nAccording to USA Today, \"The morning Alexis disappeared, she and her mother, Ayanna Patterson, argued over cupcakes. Alexis had planned to bring the treats to school, but she hadn’t done her homework, so her mother didn’t let her.\nLaRon Bourgeois, Ayanna's husband, and Alexis's stepfather, told police he and his son walked Alexis to the corner between their home and the school and left her with a crossing guard, who — according to the records — was a fifth grader.\nThe reports include differing witness accounts. Some said they saw Alexis on the school grounds that morning. Others said she had never arrived.\nTwo weeks after Alexis went missing, FBI behavioral analysts concluded she was most likely the victim of an 'emotion-based' homicide at the hands of her mother. Also possible, but less likely, they said, was that she had been the victim of a neighbor. The analysts noted numerous 'discrepancies' in Patterson's and Bourgeois’s statements to law enforcement, friends, and the media.\nThe two leading theories both conclude that Alexis is likely dead, but her remains have never been found. No one has ever confessed to taking her, let alone killing her. And there is little physical evidence to support either theory.\"\n9.The horrifying murder of Missy Bevers\n\"She was teaching an early morning yoga class at a church, and her killer, who remains unknown, was caught walking around on camera in SWAT gear before murdering her. Very disturbing!\"\nAccording to CBS News, \"Her suspected assailant was also seen on surveillance video walking the hallways of the church early that morning, using a hammer to break windows, while wearing a helmet and tactical gear. Bevers' wounds were 'consistent with tools the suspect was carrying throughout the building,' documents said. The mother of three died of multiple puncture wounds to her head and her chest.\"\n10.The notorious murder of JonBenét Ramsey\n\"We are about the same age and I remember being so confused as to why my parents were following her story so much on 20/20 and Dateline. Then when I watched stuff about her as an adult there's just too much stuff that went wrong and so much stuff that didn't make any sense.\"\nJonBenét Ramsey was a 6-year-old girl who was killed in her family's home in Boulder, Colorado on Dec. 25 or 26, 1996. Her death was attributed to a skull fracture from a blow to the head and strangulation by a garrote that was found around her neck. The case became a media circus, largely in part because Ramsey was a child beauty pageant contestant and it received constant coverage from around the world. It is still considered a cold case.\n11.The depressing murder of 4-year-old Grégory Villemin\n\"Within the span of four hours, he was abducted from his front yard, and his body was found near a local river. There's a Netflix documentary called Who Killed Little Gregory? about it. It is both heartbreaking and incredibly frustrating because he was just 4 years old, and his murder is still unsolved.\"\nAccording to BBC News, \"Hours before the boy was discovered, his hands and feet tied, his uncle said he had received a phone call from someone claiming to have kidnapped him. The following day, the child's parents received a letter that said: 'Your son is dead, I have been avenged.'\nThe next month, a cousin of the boy's father, Bernard Laroche, was arrested when his sister-in-law, Muriel Bolle, testified against him. He was released in 1985 when she retracted her statement, but shot dead by Jean-Marie Villemin, the boy's father, weeks later.\nThe father went to jail for Laroche's murder for several years. The boy's mother, Christine Villemin, was also jailed for her son's murder but later cleared. Both were later given compensation by the state for miscarriage of justice.\nThe case was reopened first in 2000 and then again in 2008 in an attempt to identify the DNA on the letters. Three separate traces of DNA were found but not identified.\"\n12.The chilling disappearance of Trevor Deely\n\"The video surveillance of him being followed by a figure in black is terrifying. He was never seen again. If someone did hurt/kill him, I hope justice is served.\"\nTrevor Deely, a 22-year-old IT worker in Dublin, disappeared in the early hours of December 8, 2000, after leaving his work Christmas party. CCTV last captured him walking along a road around 4 a.m. in heavy rain, and he was never seen again. Despite major investigations, searches, and media appeals — including footage of a suspicious man thought to be following him — no trace has been found..\n13.The extremely violent Nanjing University mutilation case\n\"Diao Aiqing was a 19-year-old Chinese university student last seen alive in 1996. Her body was boiled and chopped up into pieces. Body parts were found in multiple trash bags, located all over the university campus. There's been almost no progress and no solid suspects in the case. They put together all the body parts they could find to complete her body. Still haunts me to this day.\"—Anonymous\n14.The mystifying disappearance of Asha Degree\n\"Why did she leave the house in the middle of the night? Was she meeting someone? Was it someone the family knew? So many questions...\"\nNine-year-old Degree was living in Shelby, North Carolina, when she went missing on Feb. 14, 2000. She left her home early that morning with her backpack, sometime between 2:30 a.m. and 6:30 a.m., and walked along a nearby highway where several motorists reportedly saw her. Apparently, one person even went back to check on her and said she'd disappeared into the woods.\nDespite years of searching, finding her backpack was the only major clue until recent developments tied a local family to the case through DNA evidence and text messages. However, no arrests have been made and Asha remains missing.\n15.The shocking murder of Lindsay Buziak\n\"Her murder is a case that keeps me up at night. It's a very eerie story. Crime Junkie podcast covers her story, and there is an ID Discovery doc, too.\"\nLindsay Buziak was a 24-year-old real estate agent in the Victoria, Canada area who was stabbed to death on Feb. 2, 2008, while showing a property to an unnamed couple.\nAccording to CTV News, \"Investigators believe the couple arranged the meeting using a prepaid cellphone that was later determined to be registered to a fake name in Metro Vancouver.\" Lindsay's boyfriend at the time, Jason Zailo, was questioned by police; however, no charges have ever been made against him. The case remains unsolved.\n16.The strange disappearance of Emma Fillipoff\n\"She was a Canadian woman who disappeared on Nov. 28, 2012. She was last seen outside the Empress Hotel in Victoria, British Columbia when she was 26 years old.\"\nShortly before her disappearance, Fillipoff had been living at a shelter in Victoria. According to CTV News, \"Acquaintances who would see Emma around were noticing that she seemed to be acting paranoid, lost, confused, and not like herself.\" While outside the Empress Hotel, \"Two officers came and spoke to Emma and assessed her for about 45 minutes and deemed her okay to walk away. They didn't have any reason to hold her under the mental healthcare act.\" It was the last time she was seen.\n17.The violent murder of Ebby Steppach\n\"She disappeared in 2015, and her car was found a couple of days later in a park with her belongings in it — keys in the ignition, battery dead, and out of gas. Police believed she ran away and 'searched' the park where her car was found. Nothing happened (except a lot of police failure) for three years until the case was given to a different detective (who actually came out of retirement to work on this case). He decided to go back and research the park her car was found in, and they found her body in a drainpipe less than 200 yards from her car (the opening to the pipe where her body was put into the drain was less than 100 feet from where her car was). The case is still unsolved, and there are so many other things about it; please look it up!\"\nEbby Steppach was an 18-year-old high school student who disappeared under strange circumstances in Little Rock, Arkansas in October 2015. As mentioned above, her body was found nearly three years later, not far from where her car had initially been found.\nAccording to Ebby's family, as revealed in a 2022 Dr. Phil episode, the Little Rock Police Department allegedly claims that Ebby died by suicide, which her family disagrees with. On the same program, Ebby's boyfriend revealed that he believes Ebby had been involved in a \"terrible accident\" with some of her friends.\n18.The suspicious disappearance of 3-year-old William Tyrrell\nWilliam Tyrrell vanished in 2014 while playing at his foster grandmother’s home in Kendall, NSW, Australia. Despite a massive search and a $1 million reward, he has never been found. Police now suspect he may have died in an accident at the foster home, though his foster mother, who has never been charged, denies involvement.As of 2025, the case remains unsolved, but a coronial inquest is nearing its conclusion. New claims from a podcast suggest convicted child offender Frank Abbott confessed to knowing where William is buried, prompting calls for a reinvestigation.\n19.The upsetting disappearance of Billy Smolinski\n\"He's been missing since 2004. His story was actually featured on Disappeared.\"\nBilly Smolinski disappeared from Waterbury, Connecticut, on Aug. 24, 2004. His home on Holly Street was the last place he was ever seen, and he left behind his truck, keys, wallet, and dog Harley. However, the search was apparently \"hampered\" by a lack of coordination between police agencies, and according to NBC News, Billy's family said they were \"victimized [...] by a system that didn't allow them to participate in the search.\"\nAs a result, Billy's parents lobbied Congress for \"Billy's Law\" for over a decade, which finally passed in 2022. \"Billy's Law\" will essentially work to try and match up missing-person cases with unidentified bodies. You can learn more about it here.\n20.The highly suspicious death of Rebecca Zahau\n\"There is good evidence that does point to someone, but no one has ever been arrested to my knowledge.\"\nIn July 2011, Rebecca Zahau was found dead, naked, gagged, and bound, hanging from a balcony at her boyfriend Jonah Shacknai’s Coronado mansion. She had been found like this just two days after his six-year-old son, Max, was critically injured in a fall under her care. Authorities ruled Zahau's death a suicide, but her family has long argued it was murder, pointing to the unusual bindings and a cryptic message painted on a door in the home.\nIn 2018, a civil jury found Jonah’s brother Adam Shacknai liable for her wrongful death, though the case was later settled and the judgment vacated. Despite multiple re-examinations upholding suicide as the official cause, Zahau’s family continues to push for the case to be reopened.\n21.The gruesome murders of Barry and Honey Sherman\n\"This was a local 2017 case here in Toronto, Canada. Barry was the founder of a pharmaceutical manufacturer and distribution company and was worth millions, if not billions. Their bodies were found in the basement pool area, tied to a pool railing with belts. It was initially thought to be a murder-suicide, but was soon found to be a double murder.\nNo suspects have been found, those initially thought to be involved have been cleared, and the house has been demolished. Someone (an urban explorer) got into the house before it was demolished and said they found all sorts of possible evidence left behind by the police that was still in the house when it was torn down. It’s been six years and still no leads. Their kids are now offering a large reward for any information that could clear the case up.\"\n22.South Korea's deeply upsetting 'Frog Boys' case\n\"A horrible tragedy for all the families involved. It didn't help that the parents of one of the children got blamed for the murders. As an outsider, and seeing the evidence years later, I believe the killer was one of the soldiers, and the government covered it up. It's definitely a case more people should know about. But outside of Asia, I've never really seen much news about it.\"\nThe \"Frog Boys\" were a group of five boys who disappeared while out trying to catch frogs in the outskirts of Daegu, South Korea in 1991. Although the case received a lot of media attention, and a large search was conducted by police and the military, the boys were not immediately found. However, in 2002, the remains of the boys were finally discovered. Although authorities believe the boys were likely murdered (three of the boys had signs of blunt force trauma to their heads), what exactly happened has never been solved.\n23.The horrifying disappearance of Diamond and Tionda Bradley\n\"They were left home alone by their mom, and when she came home, they were gone without a trace. That was in 2001.\"\nSisters Diamond and Tionda Bradley were 3 and 10 years old when they went missing in July 2001 in Chicago, Illinois. When their mother returned home, instead of finding her children there, she found a note on the back of the couch that had allegedly been written by Tionda saying she and Diamond \"had gone to the store and to a school playground nearby.\"\nAccording to NBC News, \"But there was something off about the note. Family members told Dateline the spelling and grammar seemed too perfect and advanced for a girl Tionda’s age. They added it was also not like Tionda to leave a note — instead, she would have just called her mother.\"\nIn May 2023, a woman came forward claiming to be Diamond. According to the girls' great aunt, Sheliah Bradley-Smith, the woman in question has since turned in a cheek swab and fingerprints to the FBI.\n24.The awful disappearance of 4-year-old Michael Wayne Dunahee\n\"He went missing in Victoria, British Columbia, on March 24, 1991. Michael was last seen that day around 12:30 p.m. at the Blanshard Park Elementary School playground while his mother, Crystal Dunahee, was participating in a women's football practice. Although his parents were nearby, no witnesses to his disappearance have ever been identified.\"\nAccording to Times Colonist, \"On the 32nd anniversary of the child’s disappearance, Victoria police issued a news release saying investigators continue to work on the case. Despite more than 10,000 tips over three decades and one of the largest police investigations in Canadian history, the case remains unsolved.\"\n25.The baffling disappearance of Michael Negrete\n\"He was up late playing video games in his dorm with a friend, then last seen going back to his room. The only lead the police have is multiple students allegedly seeing an unknown man on the floor of his dorm room the night he disappeared.\"\nEighteen-year-old UCLA student Michael Negrete disappeared early in the morning on Dec. 10, 1999. Although it was initially categorized as a missing persons case, according to police, it eventually turned into a homicide investigation. He has not been found.\nAre you obsessed with this kind of content? Subscribe to the That Got Dark newsletter to get your weekly dopamine fix of the macabre delivered RIGHT to your inbox!\n26.The spooky disappearance of Brandon Swanson\n\"It happened in Marshall, Minnesota in 2008. Brandon was out with friends at a bar, celebrating the end of their first year of college, when he decided to start heading home around midnight. Around 2 a.m., he called his parents to let them know that he had driven into a ditch and needed to be picked up, so his parents started driving to him. While on the phone with him, Brandon shouted 'oh shit' and went silent. They never heard from or saw him again, and there is no trace of him anywhere. This happened about two hours from where I live, and it still shakes me to my core when I think about it.\"\nSwanson's car was later found abandoned in a ditch with the car doors open and keys missing, roughly 25 miles from where he had said he was.\n27.The dark murder of Catherine Cesnik\n\"She was a nun who worked as a teacher at an all-girls catholic school in the 1960s. She went to a shopping center to buy her sister a wedding gift and disappeared. Her car was found the next day parked across the street from her apartment and was covered in mud. Months later, her body was found in the woods.\nThere were very few leads until decades later when one of her former students came forward claiming a priest, who was the school principal at the time, had taken her to the woods and shown her Cathy’s body. He told her, 'That’s what happens when you say bad things about people' because shortly before her disappearance, the student had confided in Cathy that the priest had been sexually abusing her. A lot of other former students have since come forward claiming to have been sexually abused by the same priest. He has since died, and the case is still open.\nNetflix has a docuseries about it called The Keepers. It’s a case that still upsets me because there seems to have been many other people involved in the abuse and possibly Cathy’s murder, and as usual, the church was very aware of how dangerous this priest was and covered it up for decades.\"\n28.The inexplicable murder of Lisa Mack\n\"This was in Iron Mountain, Michigan, on May 15, 1999. Worth the google.\"\nIn 1999, Lisa Mack was found stabbed to death inside Mayme’s Bar in Iron Mountain, Michigan. Police have long considered local man Rallund Lee Ottlinger a person of interest, but no one has ever been charged. Ottlinger is currently imprisoned in Wisconsin for a separate 2006 rape and isn’t eligible for release until 2026. Despite being a 25-year-old cold case, Lisa’s family and investigators remain hopeful that advances in forensic science may one day bring justice.\n29.The questionable disappearance of 2-year-old Sky Metalwala\n\"It happened in Bellevue, Washington, on Nov. 6, 2011. His mother, Julia Biryukova, said she left him alone in her car (allegedly) on a residential street because her car had 'run out of gas' even though police later determined it had not run out of gas. There have been no leads or traces to this day. The mother was entirely uncooperative and refused to answer any questions.\"\nAccording to King 5, \"Biryukova has continued to live in the area, remarrying, later fighting over custody of another child with another ex-husband. She declined to talk when approached by a reporter in 2019, and has successfully hidden from public view since the story got national attention.\"\n30.The puzzling disappearance of Bryce Laspisa\n\"He had been acting strangely throughout his drive home. Still don't understand why his parents didn't go and get him after being notified by the police and/or the owner of the shop that provided roadside assistance.\"\nBryce Laspisa was a 19-year-old student who went missing in the Castaic Lake area of California in 2013. He had been driving home to his parents' home after breaking up with his girlfriend. The last time anyone heard from him was a call with his mother at around 2 a.m.\n31.The bizarre and grim Setagaya family murders\n\"The fact that they have so much DNA evidence but still can't catch the person responsible is just heartbreaking.\"\nThe Setagaya family murder, aka the \"Goldilocks Murder,\" refers to the unsolved murder of the Miyazawa family — a father, mother, and their two children — who lived in the Setagaya neighborhood of Tokyo where they were brutally stabbed to death in December 2000. After the killings, the unknown assailant remained in the family's house and used their toilet, and computer, napped on the sofa, and even ate their food.\n32.The strange disappearance of Leah Roberts\n\"She was from North Carolina and left unexpectedly to drive across the country with her cat. Her car was found crashed on a mountain road in Washington state. Years later, they finally checked her car more thoroughly, and there was evidence that the engine had been tampered with to cause a crash.\"\nAccording to MSN, Leah's sister Kara discovered a strange note dated March 9, 2000 addressed to Leah's roommate Nicole. \"It included cash covering a month's worth of expenses, leading Kara to believe that Leah planned to return within a few weeks. Parts of the note — such as the bit about leaving money for bills — made perfect sense, while others were vague and even ominous. After a brief introduction, Leah wrote: 'While I am gone, remember — everyone is together in thoughts and prayers and time passes quickly. Have faith in me, yourself, everyone.'\"\n33.The questionable disappearance of Ryan Shtuka\n\"He vanished on his way home from a party at Big White Mountain Ski Resort just outside Kelowna, BC, Canada, in February 2018. He was only 20 years old. They have held so many searches over the years, and talked to everyone possible. I remember reading that he didn't even have a winter coat on when people saw him leave; he was staying only a 5-minute walk away from the house party, and he never made it. It's a really sad story.\"\nAccording to Kamloops This Week, \"Mounties have not ruled out foul play, but have not reported finding anything suspicious, and Ryan’s disappearance remains a mystery.\"\n34.The shocking Tylenol Murders\n\"It happened when I was in junior high, and I remember adults being terrified. Then came all the copycat tampering of different OTC medications. I think about this every time I open tamper-proof tabs, which were put in place as a deterrent to these murders.\"\n—Anonymous\nThe \"Tylenol murders\" were a series of poisonings that killed seven people in the Chicago area in 1982. The Tylenol capsules the victims had taken had been laced with potassium cyanide. No suspect has ever been found or convicted. The crime is the reason there is now tamper-proof packaging on many over-the-counter drugs and also food.\n35.The wild disappearance of Michele Harris\n\"She went missing from the Owego, New York area on Sept. 11, 2001. Her minivan was found abandoned in her driveway. There wasn't as much law enforcement in the area that day because this happened on 9/11, and many first responders, etc. were sent to the city to help. She was estranged from her husband Cal Harris, a well-known auto salesman. He was tried four separate times and eventually acquitted. There are rumors during a heated exchange, he said something to the tune of 'No one will ever find you.'\"\nAccording to WNBF, \"Her husband, Calvin, was charged with murder more than four years later. Harris was convicted in two trials, but a third trial ended in a hung jury. Harris was acquitted of murder in a non-jury trial in 2016. Michele's body has not been found.\"\n36.The perplexing case of the Springfield Three\n\"In 1992, two friends, Suzanne Streeter and Stacy McCall, and Streeter's mother, Sherrill Levitt, were kidnapped in the middle of the night. Robbery wasn’t considered a motive because their personal belongings, like cars and purses, were found in the open with cash inside. There were no signs of a struggle, and no trace of them after that morning, but there are a number of likely suspects. The town they were taken from, Springfield, Missouri, was a nexus of known killers at that time.\"\n37.The upsetting disappearance of Timmothy Pitzen\n\"This was in 2011 in Aurora, Illinois. His dad dropped him off at school, and a short while later, his mom, Amy Fry-Pitzen, picked him up. They went to the zoo and some water parks. Amy was later found in a motel room in Rockford, Illinois, having died by suicide. She left a note that said Timmothy was with people who loved him, and he would never be found. He hasn’t been seen since.\"\nAccording to NBC Chicago, Fry-Pitzen's sister, Kara Jacobs, believes that her sister, Amy, handed off Timmothy to another family in Iowa. However, no one has reported seeing Timmothy since his disappearance.\n38.The inexplicable death of Phoebe Handsjuk\n\"Her body was found in the garbage chute area of the apartment. The case was ruled an accident/suicide, but there's no way. There has to be some sort of foul play.\"\nPhoebe Handsjuk was a 24-year-old woman in Melbourne, Australia whose body was found after she'd apparently fallen several stories, feet first, down into a high-rise building's garbage chute. Although her family believes someone put her into the garbage chute, her death remains a mystery.\n39.The mysterious disappearance of Maura Murray\n\"I graduated college the year before she disappeared, and honestly used to just take off a lot and clear my head or take unplanned weekend trips alone. She was in nursing school, too, so I understood the struggle sometimes. So many strange factors surround her disappearance.\"\nMurray was a 21-year-old nursing student who got into a car accident in upstate New Hampshire. The strange thing was, prior to disappearing, she'd told professors that she would be taking a week off due to a death in the family. However, her family later told authorities that there had been no death.\nRelated: Which Of The 12 Archetypes Are You?\n40.The violent murder of Russell and Shirley Dermond\n\"This occurred in 2014 in Oconee County, Georgia. The couple was supposed to attend a Kentucky Derby party with friends. When they didn't show, some friends went to their house. They found Russell decapitated in the garage (his head has never been found). Shirley was missing at the scene. I believe Shirley was found a week or so later weighed down with cement blocks in the lake on their property. No suspects have ever been named, at least publicly. It's a very disturbing and sad case. I really hope they find the person(s) responsible for this horrible murder.\"\n41.The baffling disappearance of Amy Lynn Bradley\n\"Amy Lynn Bradley went missing from her cruise ship in the '90s, and there were multiple sightings of her years afterward in different countries, but nobody ever helped her. There was even a situation in 1999 where a US Navy man visited a brothel overseas and had a woman approach him, begging for help and telling him that her name was Amy Bradley and that she was being held hostage, but he didn’t do anything about it for fear of anyone finding out where he was at the time.\"\n\"Out of all the horrible missing story reports, this one always stayed with me. Maybe because it could have been avoided if the crew members actually listened to her parents, and refused to let anyone off the ship when she was reported missing. And then all the rumored sightings of her over the years. Either way, this story just makes me really sad.\"\n42.The scary abduction of Angela Hammond\n\"Just chilling. I saw an update where they think it was a case of mistaken identity.\"\n—Anonymous\nIn April 1991, recent high school graduate Angela Hammond went missing in Clinton, Missouri. She was also four months pregnant and engaged to a man named Rob Shafer. After dropping Shafer off at his parents' house one night, Hammond later called him from a pay phone. She seemed like she might be in trouble. Shafer drove out to help Hammond, and on the way saw her being driven away in a green Ford truck. Although there are still active leads in the case, Hammond has not been found to this day.\n43.The odd disappearance of Beth Miller\n\"I worked with her dad at the mine, and it has always driven me crazy that she has not been found.\"\n—Anonymous\nBeth Miller was a 14-year-old girl who went missing in the Denver area on August 16, 1983. She had been out jogging but never returned home. Witnesses at the time reported seeing her talking to a man in a red pickup truck, but authorities were never able to track it down. Although investigators and many volunteers helped search for her, she has still never been found.\n44.The unsolved murder of Megan Curl\n\"She was an abuse survivor just trying to live her life. She was fun-loving and trusted people too easily, according to her mother. She was last seen alive in 2000 by her neighbor with an unidentified man, and then was found dead, tied to her bed, and burnt. I found out about the case when I was about 15, and have been studying murder most of my life, and this is one of the ones that upset me the most, and I think about it every few days.\"\n—Anonymous\n45.The shocking disappearance of Ayla Reynolds\n\"It's a bit of a local mystery, but the disappearance of Ayla Reynolds still haunts me. An 18-month-old girl disappears from her bedroom at her father's home, and forensics revealed an unusual amount of her blood had been cleaned up. Ayla's mother filed a wrongful death suit, and her father went on the run and hasn't been seen since 2017. She went missing in 2011...she'd be 14 this year. And in the Maine wilderness, it's unlikely she'll ever be found. Absolutely breaks my heart.\"\n—Anonymous\n46.The violent and upsetting death of Cindy James\n\"In the 1980s, she reported over 100 incidents of violence and stalking. On different occasions, she was tied up, drugged, and even had a knife stuck through her hand, but never saw the man's face. The police believed there was no stalker and she was doing it all to herself for attention. This went on for almost seven years until in 1989, she was found tied up and murdered. Her death was originally ruled a suicide but later changed to 'death by an unknown event.'\"\n—Anonymous\n47.The weird disappearance of Paige Renkoski\n\"Paige Marie Renkoski, a teacher in Michigan, disappeared in 1990 and was eventually presumed dead. Her running car was found along I-96 in the middle of the day with her purse and her shoes left inside. It happened along my route to work. I probably passed by her car that day. I've never been able to understand how someone could be kidnapped along a busy road in the middle of the day!\"\n—Anonymous\n48.The wild Phillip Island murder mystery\n\"Who killed Beth Barnard? Where is Vivienne Cameron? Is she dead, too? What really happened that night? What is Fergus Cameron not telling us? I have so many questions and will probably never find out, but I've never been more perplexed about an unsolved crime.\"\nIn September 1986, 23-year-old Beth Barnard was found brutally murdered on Phillip Island in Australia — her body was found with an \"A\" carved into her chest. Beth was allegedly having an affair with a man named Fergus Cameron. Not long after, Fergus's wife Vivienne disappeared and has not been seen since.\n49.The terrible disappearance of Kyron Horman\n\"Kyron Horman. He was a little boy who disappeared near Portland, Oregon in 2008 or 2009. His stepmom dropped him off at school, took him into the class, and even snapped a picture of him (there was a science fair or something going on), and then, his teacher never saw him. He disappeared. His stepmom was investigated, and most people think she had something to do with it, but he has never been found. I lived in the Portland area at the time, and it was so sad and shocking.\"\n—Anonymous\n50.The infamous disappearance of Malaysia Airlines Flight 370\n\"I watched a documentary and they have SO many tools that they should have found it. SO much evidence and information about the whereabouts of the plane yet they still can’t find it! They only found I think like three pieces of the plane that were confirmed to be part of that flight.\"\nOn March 8, 2014, Malaysia Airlines Flight 370 disappeared while flying from Kuala Lumpur International Airport in Malaysia to Beijing Capital International Airport with 239 people on board. The flight was lost on air traffic control radar but picked up by military radar, hundreds of miles off course from the planned flight path. The flight never arrived at its destination. Although various pieces of plane debris have been found in the years since, most of it is unconfirmed to have actually belonged to MH370.\nLove unsolved stories like these? Subscribe to the That Got Dark newsletter to get your weekly dopamine fix of the macabre delivered RIGHT to your inbox!\n51.The heinous Dupont de Ligonnès murders\n\"Agnès Dupont de Ligonnès, her four children, and two dogs were found murdered underneath the garden in the backyard of their house in France while her husband went on a three-week roadtrip down the coast of France. He allegedly murdered them and then just casually visited restaurants and hotels. He disappeared without a trace into the hills after the last town he visited and hasn't been seen since, even after an extensive manhunt search was held. This episode on Unsolved Mysteries on Netflix was wild!\"\n52.The grim disappearance of Cherrie Mahan\n\"She was the first person ever to ever be featured on those 'Have you seen me?' fliers. She went to the same school district as me. She got off the bus and was never seen again. In high school, some of my teachers who also grew up there would reveal they had been friends with her and still wondered what happened. Someone in the area has got to know something and I honestly just want someone to finally speak up because the family deserves closure.\"\nEight-year-old Mahan was living in rural Pennsylvania when she disappeared after getting off a school bus not far from her home on Feb. 22, 1985. Although a suspect vehicle was sighted and many leads pursued, Mahan was never found and declared legally dead in November 1998.\n53.The haunting disappearance of Johnny Gosch\n\"His mother claims that in 1997, a 27-year-old Johnny visited her accompanied by a strange man, talked with her for an hour, then left again, feeling it was not safe to return home. She hasn’t seen him since.\"\nJohnny Gosch was one of the first children to appear on the \"missing children\" milk cartons. He was a 12-year-old from West Des Moines, Iowa, who disappeared early in the morning on Sept. 5, 1982, while delivering newspapers. Witnesses reported seeing Johnny talking to a man in a car and possibly being followed, but no one knew exactly what happened. After Johnny’s parents received calls from customers complaining they hadn’t received their papers, his father combed the route. What he found was Johnny’s wagon, full of newspapers, but no Johnny. Initially, the police didn’t treat the case as a kidnapping, so the investigation started late.\nNo arrests were ever made, and there was never any conclusive evidence found. Johnny’s mother, Noreen, believed he was taken by a trafficking ring and spent years searching for him. She claims Johnny visited her briefly in secret as an adult in 1997, but this has never been confirmed. Although there have been many theories and reported sightings over the years, the case remains unsolved to this day.\n54.The strange lead masks case\n\"It’s rather unknown, but essentially two men were found facedown in the woods by a little boy flying a kite. They were dressed in suits, raincoats, and had glasses made of lead, and there were no signs of trauma. They also had water bottles, two wet towels, and carried a rather cryptic note. The note read, '16:30 be at the specified location. 18:30 ingest capsules, after the effect protect metals await signal mask.' There was no cause of death ruled. To this day, no one knows what they were doing or how they died. Theories range from foul play to UFOs.\"\nManoel Pereira da Cruz and Miguel José Viana were Brazilian electronic technicians whose bodies were found on Aug. 20, 1966 in Rio de Janeiro. They had apparently been planning something secret and told their families just a few days earlier that they were going to buy electronic materials for work. However, after their bodies were discovered, no cause of death was determined by authorities, as there were no clear injuries, no toxic substances found, and their internal organs were too badly decomposed by the time the autopsy happened.\n55.The questionable disappearance of Michelle Pulsifer\n\"Three-year-old Michelle disappeared, her mom and stepdad abruptly moved across the country a few days later, and they repeatedly changed their story. Michelle was never seen again — alive or dead.\"\nPulsifer disappeared in July 1969. In 2004, Pulsifer's mother, Donna, and her boyfriend, Michael, were arrested and charged with the young girl's murder. Michael claimed they found Michelle dead in her bedroom and buried her thereafter. However, Michelle's remains were never found. Michael died in 2005 before he could testify in the case and Donna was released after a mistrial and lack of evidence.\n56.The terrible death of Katherine Korzilius\n\"She was walking home after picking up the mail from a local mailbox and then was found dead. Her parents (Nancy and Paul) had been driving home one way, whilst Katherine was walking home the other.\nThe first theory was that Katherine was struck by a hit-and-run driver, but that was ruled out by the Medical Examiner. Several people have had their own theories as to what happened. Some say that it was one of the neighbors, others say it was a child molester, and others have said that it was a deranged Bon Jovi fan (Paul was Jon Bon Jovi's manager at the time) who was looking for a ransom.\nThere has never been any conclusive proof of what happened on that day and perhaps there never will be. Jon wrote a song as a tribute to Katherine on his 1997 solo album Destination Anywhere called \"August 7, 4:15.\"\nKatherine Korzilius was a 6-year-old girl living in Elder Circle, Texas when she was found dead on Aug. 7, 1996, just minutes from her home. In fact, she had only been missing for 15 minutes between the time she was last seen and when she was found lying on the street. According to the medical examiner, the injuries she sustained could have been the \"result of either jumping from a moving vehicle, being thrown from a moving vehicle, or falling from a moving vehicle.\" However, her cause of death remains a mystery.\n57.The eerie disappearance of Nuseiba Hasan\n\"She was a childhood friend of mine. There was a Gimlet podcast about it. Blew my mind.\"\nAccording to CBC, when investigative journalist Habiba Nosheen received an intense \"cryptic email\" to look into Nuseiba Hasan's story, Nosheen \"soon learned that the 26-year-old had actually disappeared in 2006, yet nearly a decade had passed before anyone reported she was gone.\" The article continued, \"There was reason to believe she 'met with foul play,' investigators said at the time.\"\n58.The odd disappearance of Kirsa Jensen\n\"She disappeared in Napier, New Zealand in 1983 — before I was born. However, when I was a teen I read the book her mum wrote and the case has fascinated me since.\"\nFourteen-year-old Jensen was living in Napier, New Zealand when she disappeared on Sept. 2, 1983 while riding her horse. Although her horse was found tethered near the Tutaekuri River, no trace of Jensen was found. The case remains open.\nRelated: This 30-Question General Knowledge Test Will Eliminate 53% Of People Before Question 21\n59.The inexplicable disappearance of DeOrr Kunz\n\"A little boy from Idaho. Went missing on a family camping trip…so mom and dad say. Some swear he was never there, some think he’s buried up there somewhere. The image of this sweet boy’s face is burned into my memory and I pray he gets justice someday.\"\nDeOrr Kunz was just 2 years old when he disappeared on July 10, 2015 while visiting a campground with his parents, Jessica Mitchell and Vernal DeOrr Kunz. Although several private investigators have worked on the case, no solid evidence as to what may have happened has been found. Mitchell and Kunz were named suspects in January 2016 but were never arrested or charged.\n60.The spooky disappearance of Brian Shaffer\n\"How can a person disappear from a bar without being caught on surveillance footage? He was caught on CCTV entering the bar, but never exiting it. The police combed through the footage and accounted for everyone except him, and there were no other exits to the bar. He went in and never came out.\"\nMedical student Brian Shaffer was last seen in Ohio, on CCTV, going up an escalator to a popular campus bar. But the video never showed him leaving. Foul play has still not been ruled out.\n61.The eerie disappearance of Angela Green\n\"She was from Prairie Village, Kansas. This one is worth looking up — it’s a lot. And nothing the husband has said adds up.\"\nAngela Green was a 51-year-old mom who disappeared under inexplicable circumstances in June 2019. She was last seen at her home in Prairie Village, Kansas, but was not reported missing until some months later.\nAccording to Fox 4 News, \"Ellie Green, Angela’s daughter, said her father told her that her mother died of a stroke in a hospital. Ellie said her father asked her not to tell their extended family. Ellie says she eventually tried to get her mother’s death certificate and discovered the State of Kansas had no record that Angela died.\" After her father's story became 'even more unbelievable,' Ellie filed a missing person's report. Authorities have since investigated more than 150 leads; however, Angela remains missing.\n62.The strange disappearance of Summer Wells\n\"Summer Wells' case bothers me. It seems most likely that the family had something to do with it, but there's no evidence.\"\nWells was a 5-year-old who was last seen at her home on Ben Hill Road in Rogersville, Tennessee, where she lived with her parents and older brothers in June 2021. According to Fox News, \"Don Wells and his wife maintain their belief that their daughter was kidnapped from their home in the presence of her family, who did not witness anyone at the property at the time.\"\n63.The suspicious disappearance of Brittney Wood\n\"She went missing after meeting with an uncle, then that same uncle died by suicide. And then it was revealed his suicide was...off. After that, the police found a multi-generational incestuous pedophilic trafficking ring in her family where the adults would get the kids hooked on hard drugs at a very young age. It was and is horrific, and somehow, poor Brittney has still never been found.\"\nBrittney Wood was a 19-year-old single mom who disappeared on May 30, 2012, in southwestern Alabama.\nAccording to WKRG, \"On that day, Brittney left her mother’s home and headed to visit her uncle Donnie Holland. She never returned home. Two days later, Holland was found in his truck off of a beaten path with a gunshot to the head.\nIn the wake of Brittney’s disappearance, 11 people were arrested on sex abuse charges, including members of her family and family friends.\"\nAlthough there have been tips and some leads over the years, her case remains unsolved.\n64.The shocking murder of Jill Dando\n\"She was a well-known British TV presenter who was shot dead on her London doorstep in broad daylight, and 24 years later, it remains an unsolved case.\"\nJill Dando was 37 years old when she was shot dead outside her home in Fulham, an area of London, on April 26, 1999.\nA man named Barry George was eventually arrested for murder, found guilty, and sentenced to life in prison in 2001. However, in 2007 his conviction was overturned, and in 2008 he was cleared of the crime after a retrial.\nAlthough many other theories exist, including ones involving various hitmen, the case remains unsolved.\n65.The disappearance of Heather Elvis\n\"She disappeared in Myrtle Beach. It is incredibly likely that a couple killed her, as she had been having an affair with the married older man, but her body is still missing. It's horrible, and I wish it got more attention. There was a lot of victim-blaming in her case, which is horrific.\"\nAccording to WMBF News, \"Elvis was last seen or heard from on Dec. 18, 2013. It was revealed that Sidney Moorer and Elvis had an affair from July 2013 until late October or early November 2013. Documents show that during the early morning hours of Dec. 18, 2013, Sidney Moorer and Elvis had been in communication. There were also suspicions that Elvis was possibly pregnant when a surveillance video from Walmart that morning showed Sidney Moorer buying a pregnancy test. Then, around 4 a.m. on Dec. 18, 2013, Elvis’s car was discovered at Peachtree Landing by a Horry County police officer on patrol. Elvis’s body has never been found.\"\nTammy Moorer was found guilty of kidnapping Elvis in October 2018, while Sidney Moorer was found guilty in September 2019. Both appealed to have their convictions overturned, but were denied in 2023.\n66.The horrifying murder of Alicia Hummel\n\"She was a preschool teacher from South Dakota. Police had proof of life and found her deceased not long after. Still no clue who did it.\"\nAlicia Hummel was 29 years old when her body was found in the Missouri River near Vermillion, South Dakota on June 1, 2015. Her last known contact was on Snapchat at 1:30 p.m. that day, just hours before her body was found.\nAccording to Keloland News, \"An autopsy was done, revealing that she drowned, but investigators ruled her death a homicide as the autopsy also revealed that she sustained injuries to her head and a cut on her neck.\"\n67.The suspicious disappearance of Lauren Spierer\n\"This happened in Bloomington, Indiana, it is also a weird one.\"\nAccording to WISH-TV, \"Spierer vanished on June 3, 2011, after a night of partying with friends at a bar in Bloomington. Police said she was last seen leaving a friend’s place. They say she left alone and was walking back to her apartment when something happened. Investigators say a male friend reported the Indiana University student missing.\"\nAlthough there have been many theories over the years, \"Her body has never been found and police have not made any arrests in the case. Investigators have received more than 800 tips and executed 10 search warrants in recent years.\"\n68.The mysterious case Jason Landry\n\"Where did he go, why did that officer not care about the car, the clothes any of it that night???\"\nLandry, a Texas State student, went missing in December 2020, while driving home to Missouri City, Texas, for the holidays. His abandoned car was found wrecked and pinned against a tree, lights on, keys in the ignition, and clothes in the car, too.\n69.The disappearance of 23-year-old Cindy Song\n\"This case is always on my mind. I’m a ‘99 grad of PSU who was working in town at the time. Early morning Nov. 1 she disappeared without a trace from her apartment. There’s been nary a sighting or lead since.\"\nSong, a student at Penn State, disappeared on Halloween night in 2001. She reportedly went to a party that night dressed as a bunny and was last seen by friends who dropped her off at her apartment complex afterward.\n70.The bizarre disappearance of Felicia Martin Cochran\n\"Reports say she was seen arguing with someone in the parking lot of the salon (reports say it was her estranged husband), they got in her car, and she was never seen or heard from again. Her husband wasn't considered a person of interest, despite the fact that they had a domestic violence incident prior to her disappearance.\"\nFelicia Martin Cochran vanished from Pell City, Alabama, on June 11, 1992, after leaving her mother’s home to go to a salon. The next day, her car was found burned and abandoned on a rural road in Talladega County, but Felicia was never located. Despite investigations and family appeals, no suspects have been identified, and her disappearance remains unsolved.\n71.The sad disappearance of 9-year-old Anthonette Cayedito\n\"Anthonette Cayadito’s case always gets me. I’m convinced someone trafficked her.\"\nCayedito was a young Native American girl from Gallup, New Mexico, who was last seen in April 1986. The case had a couple of suspicious leads over the years — including an unknown girl calling the police to say she's Anthonette and a suspected sighting in Carson City, Nevada — but none of these leads ever panned out.\n72.The strange disappearance of Fauna Frey\n\"There are a lot of weird things she did up until she was reported missing by her dad. It’s definitely worth looking up, as there are many details and time stamps, too many to mention. But the circumstances leading up to her disappearance are very strange. Her car was found abandoned in a rural area on Reuben Mountain Road, a few miles past Grave Creek Boat Landing in Josephine County in September, but as far as I know, nothing else has been reported on her case.\"\nFrey went missing in June of 2020. She was last seen in Grants Pass, Oregon, in the parking lot of a small grocery store. Her vehicle was found months later, hidden deep in a forest.\n73.The bizarre disappearance of Jennifer Kesse\n\"There are still so many questions. Her car was found at an apartment complex a mile away from where she lived, and there's even footage of someone parking it and walking away. But 17 years later, there are still no answers, no body ever found. My heart breaks for her family.\"\nKess, a 24-year-old living in Orlando, Florida, went missing on Jan. 23, 2006. She was last seen leaving work around 6 p.m. and then spoke to her father on the drive home. She also talked on the phone with her boyfriend later. Kesse did not arrive at work the next day. The family is still getting leads today.\n74.The upsetting disappearance of 4-year-old Michael Dunahee\n\"Literally vanished from a school playground with scores of people around.\"\nDunahee vanished from a Victoria, B.C., playground on March 24, 1991, just steps from his parents, sparking one of Canada’s largest missing-child investigations. Despite tens of thousands of tips, age-progressed sketches, and renewed appeals decades later, no trace of him has ever been found. His disappearance remains unsolved, though his family continues to raise awareness through the annual Keep the Hope Alive run and advocacy for missing children.\n75.Finally, the mystifying story of \"D.B. Cooper\"\n\"Happened in the state I grew up in, and it’s just wild. They have found some of the money, but the guy was never definitively identified.\"\nD.B. Cooper is the pseudonym of an unidentified man who hijacked a plane on Nov. 24, 1971. After the hijacker demanded four parachutes and $200,000, the flight landed in Seattle. There, the flight's passengers were exchanged for the ransom money and parachutes. The flight then took off again and headed for Mexico City. But somewhere between Seattle and Reno, the hijacker jumped out of the plane with a parachute and the money. The hijacker has not been found to this day. However, there are many theories about who he was. (Side note: The hijacker bought his plane ticket under the name \"Dan Cooper,\" and after a misunderstanding, people/the media thought it was \"D.B. Cooper\" and the wrong fake name has stuck ever since.)\nNote: Some submissions have been edited for length and/or clarity.\nDid you like reading this? Subscribe to the That Got Dark newsletter to get more like it delivered RIGHT to your inbox!\nIf you or anyone you know has information on a missing person case, call local law enforcement first. You can also contact the National Center for Missing & Exploited Children at 1-800-843-5678 (THE-LOST) or visit the National Missing and Unidentified Persons System site for regional case assistance.\nAlso in BuzzFeed: 15 Disappearances, Cold Cases, And Other Unsolved Mysteries People Revealed They Won't Ever Forget\nAlso in BuzzFeed: These Facts Broke My Brain, So Now I’m Taking You Down With Me\nAlso in BuzzFeed: Just A Bunch Of Really, Really, Really, Really, Really, Really, Really, Really Weird, Dark, And Creepy Sh*t I Recently Learned",
  "word_count": 10045,
  "scraped_at": "2026-02-14T12:12:17.313228"
}