{
  "article_id": "00a1947d49d0",
  "url": "https://weaintgotnohistory.sbnation.com/2023/6/9/23755070/official-chelsea-sign-uswnt-international-catarina-macario",
  "title": "Official : Chelsea sign USWNT international Catarina Macario",
  "date": "20230609T133000Z",
  "domain": "weaintgotnohistory.sbnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "With Pernille Harder’s departure from Chelsea Women this season, the Blues needed to fill in her shoes with a player of equal talent and quality in front of the goal. We have done just that with the signing of Catarina Macario from Olympique Lyonnais, which was announced officially today.\nOfficial: Chelsea sign Catarina Macario\nTalent galore\nMacario joins Chelsea on a three-year contract on July 1st, when her Lyon deal ends. After missing the entire 2022-23 season due to an ACL injury, she is ecstatic to play for the Blues alongside world-class talents like her.\n“I can’t wait to get started here! I’m really happy to sign for Chelsea and I hope to represent the jersey well over the next few years.\n“I can play either as a No.10 or a more traditional number nine and I’m looking forward to linking up with some many good forward players such as Sam [Kerr], Lauren James and Guro [Reiten]. It will be good to play with Kadeisha [Buchanan] again also.”\nIn the 2021-22 season, Macario was instrumental to Lyon’s success both domestically and abroad by scoring several goals — including one in the Women’s Champions League final against Barcelona which her team at the time won 3-1. She knows we are hungry for international silverware, and she hopes she can help us bring it home already.\n“I’ve been fortunate to have some great experiences in Europe already with Lyon, playing with many top players and of course winning the Champions League also.\n“I hope to carry on those experiences here and bring home the trophy for Chelsea as well!”\n-Catarina Macario; Source: Chelsea FC\nMacario is a Brazilian-born athlete whose family moved to the United States when she was 12 years old to support her dream of becoming a footballer. The investment paid in dividends as she went on win several awards as a Stanford University player, including two Hermann Trophies as the country’s best college football player and two NCAA Division I women’s football titles, before starting her professional career at Lyon.\nInternationally she already has eight goals in 17 caps for the USWNT. She is the first naturalized citizen ever to play for the national team.\nWelcome, Catarina! Let’s win some things!",
  "word_count": 372,
  "scraped_at": "2026-02-14T12:46:04.154819"
}