{
  "article_id": "00b8661616db",
  "url": "https://www.nytimes.com/athletic/5929101/2024/11/27/douglas-luiz-alisha-lehmann-aston-villa-juventus-couple-transfer/",
  "title": "Douglas Luiz , Alisha Lehmann and a rare couples transfer",
  "date": "20241127T061500Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Of all the protracted negotiations between Aston Villa and Juventus over the summer, it was a deal for a player who would never appear in the men’s first team of either club that was perhaps the most intriguing.\nDouglas Luiz swapping the Premier League for Serie A for £42million (€50m; $55m) was surprising given his importance to Unai Emery’s team, but made financial sense considering Villa’s need to be compliant with profit and sustainability rules (PSR).\nAdvertisement\nThose requirements helped to explain the transfers of Samuel Iling-Junior and Enzo Barrenechea, who joined Villa in transfers that enabled the Italian side to recoup £18.3m (both players are spending the season elsewhere, with Iling-Junior at Bologna and Barrenechea at Valencia).\nBut it was the deal that took Villa Women’s Switzerland international Alisha Lehmann from Villa Park to Turin that was the most unusual, because it completed a rare ‘couples transfer’ — in which a male and female player move from the same selling club to the same buying team. In this case, Lehmann followed her partner Douglas Luiz just seven days after his move was completed.\nThis is how the deals happened and how they are working out.\nOn June 30, Douglas Luiz swapped Villa for Juventus — it was the final day for Villa to add outgoing sales to the books for the end of the financial year, which influenced the composition of the agreement, with significant fees recouped for Iling-Junior and Barrenechea.\nVilla co-owner Nassef Sawiris is a member of the partner council of Exor, the listed holding company of the Agnelli family, Juventus’ owners. Exor’s leaders describe themselves as aiming to “share ideas for potential new business opportunities” and discussions over player trades took place before the summer. Iling-Junior and Barrenechea were not the only Juventus players involved in conversations — USMNT midfielder Weston McKennie’s name was one brought up — but every facet of the deal had to make sense for Villa, from a financial and squad-building perspective.\nOn July 6, Lehmann, a 56-timed capped international and Douglas Luiz’s partner, announced she would be leaving for Juventus, having scored 14 times in 74 appearances for Villa.\nLehmann and Douglas Luiz met at Villa and made their relationship public in 2021. Both were among Villa’s most high-profile players, with Douglas Luiz a Brazil international and Lehmann the world’s most-followed women’s footballer across all social media platforms. The 25-year-old has 16.9million followers on Instagram and has become among the world’s most recognisable female athletes.\nView this post on Instagram\nSources, who have spoken on the condition of anonymity to protect relationships, say Douglas Luiz’s transfer was borne out of necessity, with Villa needing to stave off the threat of PSR. With Lehmann, it made practical sense: in addition to being closer to her partner in Italy, she had not been considered integral to the women’s team plans from a footballing standpoint, despite signing a contract extension in August 2023 that still had two years left to run.\nAdvertisement\nNearly five months on from the couples’ transfer, a reunion for Douglas Luiz and Villa has been put on hold with the midfielder missing the Champions League tie in Birmingham with a muscle injury.\nDiscussions with Juventus were protracted, with the Italian side under no rush to purchase the 26-year-old and in stark contrast to Villa, who needed to wrap up the deal by the June 30 PSR cut-off point.\nDouglas Luiz was among the Premier League’s best-performing midfielders in the first half of the 2023-24 campaign before several factors led to a noticeable downturn in form. While Emery viewed him as a key cog in the system, he was not indispensable; Villa considered him as the one lucrative asset they could compensate for, ahead of players such as Ezri Konsa, Jacob Ramsey, Emiliano Martinez and Ollie Watkins. The wheels of a potential move were greased earlier in the season with no agreement close on a new contract and his declining form being noted internally.\nGO DEEPER\nMonchi and Vidagany address Villa's PSR puzzle, keeping Emery happy, and transfer deals\n“If you go £1million over the limit, you have a (points) deduction,” said Damian Vidagany, Villa’s director of football operations. “Monchi (president of football operations) and I travelled to Italy in the last week of May. We got a pre-agreement (with Juventus for Douglas Luiz), but the final signature happened on June 30. It was a rollercoaster.”\nComplications arose owing to Douglas Luiz’s involvement in Brazil’s Copa America campaign, which was held in the U.S.. For the deal to be closed, the player had to complete a medical and sign his side of the contract. Tracking and sitting down Douglas Luiz, within the bunker of Brazil’s setup, gave Villa’s senior figures sleepless nights.\n“They played in Vegas and then after the game they were supposed to go to a hotel where he was signing the contract, but Brazil’s national team stopped them from going to Vegas as they were scared about partying,” said Vidagany. “From the moment we shook hands with (Cristiano) Giuntoli from Juventus (their sporting director) until the final signing, it was one month.\nAdvertisement\n“There are many actors in the deals. If one of the domino pieces jumps out of the line, you won’t complete it. That’s why it was very difficult. It was not only one agent, one player, but three agents, three players and two clubs. It’s like an exponential problem.”\nThe timing of Douglas Luiz’s arrival, so early in the summer, came as a surprise to observers in Italy. But the fee — and the five-year contract — suggested he would form an integral part of Juventus’ midfield under new head coach Thiago Motta.\nEarly forecasts, though, have been dispelled. Douglas Luiz has made just two starts in Serie A and played only 23 per cent of overall minutes. Reasoning for his toils are broad, with the truth lying somewhere behind a combination of form, fitness and fortune.\nAn unfortunate propensity to concede penalties has not helped his cause. First, he was penalised for handball in October’s Champions League fixture against RB Leipzig and the second, four days later against Cagliari, was for a collision in the 18-yard box.\nThe second foul was unequivocally the more damaging to his standing. The euphoria felt following Juventus’ 3-2 comeback victory in Leipzig was swiftly flattened by the nature of the score draw against Cagliari, with Douglas Luiz conceding the penalty in the final minutes.\nMotta has overlooked him for selection, even when injuries to other midfielders meant alternative options were scant. McKennie, a player Emery admires, has often been available for sale but was still being picked ahead of Douglas Luiz. An uptick in Manuel Locatelli’s form has restricted opportunities to play in deeper central areas, while Teun Koopmeiners’ arrival from Atalanta in late August did not improve matters.\nPublicly facing, Motta has remained positive and invariably keen to stress Douglas Luiz’s “fantastic” reaction in training, regardless of his continuing omission. Motta’s praise being based on performance levels in training has felt pointed, leaving the impression the Brazil international has been carrying knocks. Last month, he tweaked a muscle in the warm-up before the Champions League tie against Stuttgart.\nAdvertisement\nJuventus remain a squad in transition and have made concerted efforts to integrate youth and greater dynamism to the side. Central midfield is physically taxing and with Douglas Luiz’s fitness a concern, Motta has shown a reluctance to trust him to start games.\n“Midfielders must do everything,” said Motta. “Defend, attack, know how to play the ball, tackle and score. We only have strong players here and all midfielders who will remain here will be able to do everything.”\nDouglas Luiz has been primarily tasked with coming on and fulfilling various roles depending on the game state. This has influenced his direct involvement, frequently being parachuted into situations where Juventus have a lead to protect. Away to Genoa, for instance, Douglas Luiz had to fill in on the right of midfield.\nAcclimatising to new surroundings has been understandably aggravated by Douglas Luiz and Lehmann’s house being burgled on October 19, with six-figures worth of jewellery taken. Burglars broke into their house while Douglas Luiz made his second Serie A start against Lazio and Lehmann was in Milan, ahead of Juventus Women’s match against Inter the next day.\nLehmann’s age belies her considerable experience. At 25, Juventus is the fifth club she has played for. Having started at Young Boys Frauen in her native Switzerland, she spent six years in England with West Ham United, Everton (on loan) and Villa. Her social media and commercial appeal are huge.\nHer standing has naturally brought a heightened spotlight on her on-field performances. Her final season at Villa was emblematic of the team’s general struggles. Then-manager Carla Ward often preferred Adriana Leon and Kirsty Hanson on either flank, with Lehmann’s productivity scarce. In 15 WSL appearances, she scored twice but did not register an assist — a damning statistic for a wide player.\nVilla replaced Lehmann with club-record signing Gabi Nunes this summer. Despite a collective flatness across the team, Nunes is regarded as an upgrade in the position and in line with what new manager, Robert de Pauw, wants.\nEmboldened by scoring on debut and the marketing boon that comes with her, early optimism has flatlined. Lehmann has encountered the same predicament she had in the Midlands: increased competition for a starting role and unable to make an impact.\nSix of Lehmann’s 11 Serie A appearances have come off the bench and, although she has scored twice, she is yet to feature in four Champions League matches (including the fixtures against Arsenal earlier this month), suggesting she still needs to gain a degree of trust from head coach Massimiliano Canzi.\nAdvertisement\nIn some ways, the couples transfer was a move motivated by practicality. In Villa’s mind, they needed to solve PSR issues in the men’s team and renew the women’s side, with Lehmann’s departure enabling Nunes’ arrival.\nNeither Lehmann nor Douglas Luiz have fully adapted to a new country and league, although they can take solace in knowing their partner is going through similar challenges.\nAdditional reporting: James Horncastle, Thom Harris and Megan Feringa\n(Top photos: Getty Images)",
  "word_count": 1707,
  "scraped_at": "2026-02-14T13:17:48.307980"
}