{
  "article_id": "00be70a60b08",
  "url": "https://www.aol.com/derwins-disco-chargers-star-gets-120156083.html",
  "title": "Derwin disco : Chargers star gets groovy at dance party for older adults",
  "date": "20231220T153000Z",
  "domain": "aol.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Derwin's disco: Chargers star gets groovy at dance party for older adults\nEditor's note: We see the joy in sports all year. This seven-part series was created to share some of the memorable, happy, heartfelt and inspiring moments from USA TODAY's reporters and columnists.\nYou're never too old to get your groove on.\nIn October, Los Angeles Chargers safety Derwin James hosted \"Derwin's Disco\" at Wallis Annenberg GenSpace, a community center for older adults in Los Angeles. His goal was to bring joy to an often forgotten population.\nJames rocked an afro and wore a colorful jacket and white bell bottoms for the affair, which was attended by about 100 GenSpace members. He took selfies, led the \"Y.M.C.A\" and danced with several of the guests individually.\nHe was partially inspired to host the event because he is close with his maternal grandmother, who he called his \"everything.\" He also wanted to make older members of the community \"feel like somebody, feel young again\" and let them know people are thinking about them.\n\"I feel like a lot of people tend to forget about our senior citizens, and I feel like they’re the people that helped pave the way for a lot of us to be here,\" the All-Pro defender told USA TODAY Sports. \"Especially my grandparents, I know how much they mean to me.\"\nActor Jim Hoffmaster attended the party, which had a homecoming theme and featured food, a deejay, a photo booth, corsages and boutonnieres.\n\"I thought I might go in and there’d be a boom box and a bag of potato chips or whatever. I walked in and it was really nice, ... the whole nine yards,\" said Hoffmaster, who has appeared in popular television series \"Shameless,\" \"The Mentalist\" and \"Castle.\"\nHe didn't know who James was before cutting it up on the dance floor with him, but shared a moment of fun with the defender.\n\"He was on the dance floor dancing and he looked over at me and kinda gave me a thumbs up,\" Hoffmaster said. \"I was like, 'Dude, alright.'\"\nDorothy Calloway, a dance teacher, said she helped get everyone on the dance floor. The deejay even let her use the mic to spur them on.\n\"I said, 'OK! Get them legs up, get them feet, get up, let’s move it,'\" she said. \"And they were going. It was marvelous. It really was marvelous.\"\nCalloway also wasn't familiar with James. After learning what the former Florida State standout did for a living, she told him to be careful with concussions and suggested taking ballet classes to help with his flexibility. She got a kick out of his wig and said it reminded her of a certain rock icon.\n\"I went up to him and said, 'You look like Little Richard,'\" she laughed. \"Of course he didn’t know who Little Richard was. He was so fun, 'Yes ma’am. Yes ma’am.'\"\nCalloway noted two women danced with their canes and she appreciated how the event helped everyone let loose.\n\"We just had a wonderful time ‘cause everybody was being themselves,\" she said. \"They were free, they weren’t tied down by ‘Oh, I’m a certain age,' because we had young people dancing too.\"\nJames is the Chargers' Walter Payton Man of the Year nominee for the second consecutive year. He has done a lot of community service with youth through the Boys & Girls Club. In hosting the dance party, he said he wanted to expand his philanthropic efforts to a different demographic. According to a University of Michigan study, this year one in three adults over age 50 experienced loneliness.\nDr. Jennifer Wong, the former director of Wallis Annenberg GenSpace, told USA TODAY Sports a report by MIT AgeLab founder Joseph F. Coughlin called facilities for the older population \"big, beige, and boring\" and explains how the community is not considered a priority in the United States.\nShe said the dance party was a great effort \"to highlight the wonderful ways that older adults are seen and heard in less typical ways, not the scary headlines of senior affordable housing or food insecurity, or whichever. It’s really older adults in delight, in joy.\"\nWallis Annenberg had the vision to establish GenSpace because she said she often sees older adults in Los Angeles alone and wanted to offer a sense of community. James' event aligned with her vision.\n\"GenSpace is dedicated to showing that life can be a dynamic, thrilling adventure at any age,\" she said in a statement, \"and seeing our members dancing and celebrating with one of the NFL’s L.A. Chargers is a perfect example of that.\"\nDr. Wong noted she's worked with multiple celebrities who make a 10- or 30-minute guest appearance at events, but the defender was different in how he offered his time and energy.\n\"Derwin shut the dance floor down,\" she said. \"It was so fun to see him out there dancing with our members. Our members do a ton of fitness classes and they pretty much dance all day every day. And so I think they were a great match to Derwin and his team out there on the dance floor who are also cardio-fit.\n\"I would also just say what I loved most about Derwin is the times that I looked over and saw him chatting with members, having wonderful conversations, doing a lot of listening.\"\nThe dance party uplifted James' spirits too. The event came after the Chargers' Week 6 loss to the Dallas Cowboys where he had a season-low three tackles.\n\"When I first got there, I wasn’t feeling good about the game,\" he said. \"Then when I got there, see the people and everybody coming up to me just seeing how thankful they were for it. Once the music started playing and my mind was off of football, I just started having fun. It just felt like the right thing. It just felt good being there.\"\nCalloway recalled how James was mutually appreciative for the good energy that the GenSpace community gave him.\n\"The thing that really stuck with me when he said, 'You guys accepted me. You brought me into your place and you accepted me.' So I thought that was wonderful.\"\nThe dance party surpassed all expectations. James called it the best thing he's ever done, and he's continuing conversations with GenSpace about how to keep the party going.\n\"Out of everything I ever did, it just felt the best,\" he said. \"It’s still a life that we live. I get so caught up on ball, ball, ball — and then just to come out and see people smile and just be thankful and just have a great time and realize: hey man, we all humans at the end of the day.\"\nThis article originally appeared on USA TODAY: Derwin James dance party: Older adults groove at Chargers star's disco",
  "word_count": 1145,
  "scraped_at": "2026-02-14T12:05:27.444647"
}