{
  "article_id": "00c0d55f252b",
  "url": "https://wtug.com/ixp/532/p/west-alabama-friday-briefing-89/",
  "title": "West Alabama Friday Briefing",
  "date": "20250221T211500Z",
  "domain": "wtug.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "West Alabama Friday Briefing\nGood morning West Alabama! It is Friday, February 21, 2025.\nFriday Morning Observations:\nWe are just over a week away from the beginning of the 2025 Primary Severe Weather Season in Alabama. But as last weekend's tornadoes in Alabama proves, Mother Nature does not go by the calendar. Severe weather, in particularly tornadoes, can occur any day and any time of the day of the year. That fact makes this weekend important.\nThis is the annual \"Severe Weather Preparedness Tax Holiday\" weekend. Items that we need to prepare for potential severe storms will be available at retailers across the state without a state, county or municipal tax added to the cost between today and midnight Sunday.\nSome of the eligible items include batteries, weather radios, tarps, and other necessary supplies priced at $60 or less per item. Additionally, portable generators priced at $1,000 or less will be exempt from state sales tax. For a full list of eligible items, you can go to www.ema.alabama.gov or revenue.alabama.gov for a list of participating governing bodies.\nFamilies who are prepared stand a greater chance of surviving and more quickly recovering from severe weather.\nAlabama EMA Director Jeff Smitherman issued a statement in support of taking advantage of the tax holiday, “Severe weather can happen anytime, but preparation can make all the difference. This sales tax holiday is the perfect opportunity to gather the necessary supplies to keep your family safe and weather any storm. Being prepared is the first step to building a more resilient Alabama,”\nWe are seeing stronger and more frequent severe storms year around, now is the time to be prepared!\n(Opinions expressed in Morning Observations are not necessarily those of the ownership, management, staff or sponsors of Townsquare Media Tuscaloosa.)\nWeather:\nToday will be mostly sunny but there will be one more night of freezing temperatures before the weekend warmup begins. The good news is the tonight's temperatures will be in the upper 20s with minimal wind chills.\nTomorrow highs will bump up to the mid 50s with spring-like 70s on the way next week.\nHeads-up: Long-range computer models are predicting another round of extreme cold and possible snow next month.\nThe Forecast:\nTopping the News:\nSevere Weather Preparedness Sales Tax Holiday This Weekend\nTrial Date Set for First Defendant in 2023 Strip Shootout\nNew Leese Sought for Former UCP Building in Northport\nColleges in North Carolina, Georgia, Tennessee, South Carolina, Louisiana, and Florida are also participating in the free admission program.\nWeek Three of Legislative Session Concludes\nWith the conclusion of week three of the 2025 Alabama Legislative Session 22 legislative days remain. Here is a summary of major legislation action:\n- The Law Enforcement Dependent Scholarship Act and the Juvenile Accountability and Monitoring Act, part of Gov. Ivey's \"Safe Alabama\" package of bills sailed through the House without a dissenting vote.\n- A resolution that supports additional appropriations for the Metro Area Crime Suppression Unit got widespread support.\n- Legislation establishing the Alabama Veterans Resource Center and the Houston-Hunter Act cleared both chambers.\n- HB238 was passed by the House Judiciary Committee. It would “create a presumption of rehabilitation and fitness for licensure if an individual has been granted an order of limited relief.”\n- Legislation that could dismiss civil lawsuits against law enforcement officers if the court rules the officer’s actions were job-related and necessary drew heated debate during the week.\n- Lawmakers are considering a bill they said could help save rural pharmacists by raising the price on certain drugs. There are two similar bills being considered in the Senate Banking and Insurance Committee. Lawmakers said they’ll vote on the bill that helps pharmacies the most. That vote will be next week.\n- House Bill 149, currently moving through the legislature, would establish rules for how dogs can be kept outside. Under the bill, dog owners will no longer be allowed to keep their pets chained to stationary objects.\nTopping Sports News:\nThe #4 Alabama Men's Basketball Team faces the most important game of the season, to this point, when they host #17 Kentucky tomorrow evening. The Tide will be attempting to get off to a faster start, find some disciplined play, reduce turnovers and fouls and most importantly, avoid a three-game losing streak in conference play.\nThe Tide beat the Cats in Lexington earlier this season, but UK is much improved while UA has taken a couple of steps backwards.\nBama needs a loud and active home court advantage when they tipoff at 5:00 tomorrow evening. The game is \"White Out Night\".\nThe game can be seen on ESPN and heard on the Crimson Tide Sports Network (95.3 The Bear, Tide 100.9, 1230AM WTBC).\nBama Women Drop Close Game to UT on Road\nThe No. 18/20 Alabama women's basketball team fell to No. 15/13 Tennessee, 88-80 in Knoxville, Tenn., Thursday night.\nThere were a couple of major bright spots: Sarah Ashlee Barker and Aaliyah Nye recorded milestones during the game as Barker surpassed 1,500 career points and Nye tied the program record for most three-pointers made with 272.\nThe Crimson Tide moved to 21-6 overall and 8-5 in the Southeastern Conference ahead of Sunday afternoon's matchup versus Auburn in Tuscaloosa.\nThe 4:00pm Auburn game can be seen on the SEC Network and heard on the Crimson Tide Sports Network. It will be \"Senior Day\" for the Tide.\nRead More: Alabama Women’s Basketball Lost 88-80 to the Lady Vols on Thursday\nPower of Pink Gymnastic Meet Tonight\nThe Bama Gymnastics Team hosts cross-state rival Auburn tonight in the \"Power of Pink\" meet at Coleman Coliseum. The 7:30pm match will honor former national champion Tide coaches Sara and David Patterson.\nPre-meet will feature gymnasts accompanying cancer survivors.\nEaston Bama Bash This Weekend\nAlabama softball plays at home for the first time this weekend, hosting the Easton Bama Bash at Rhoads Stadium. The Crimson Tide welcomes No. 15/17 Virginia Tech, Southern Utah and Drake for five games over three days.\n- Weekend Schedule:\n- Friday, Feb. 21 vs. No. 15/17 Virginia Tech – 4 p.m. CST\n- Friday, Feb. 21 vs. Southern Utah – 6:30 p.m. CST\n- Saturday, Feb. 22 vs. Drake (Doubleheader) – 11 a.m. CST\n- Sunday, Feb. 23 vs. No. 15/17 Virginia Tech – 12:30 p.m. CST\nBama Baseball Hits the Road\nAlabama baseball heads to Jacksonville, Fla. to compete in the Jax College Baseball Classic at 121 Financial Ballpark. The Tide will battle three high-profile opponents, including Coastal Carolina, No. 12 NC State and Ohio State at the home of the Jacksonville Jumbo Shrimp.\n- Weekend Schedule:\n- Friday, Feb. 21 vs. Coastal Carolina – 5 p.m. CT – D1Baseball.com\n- Saturday, Feb. 22 vs. No. 12 NC State – 3 p.m. CT – D1Baseball.com\n- Sunday, Feb. 23 vs. Ohio State – 10 a.m. CT – D1Baseball.com\nClick TuscaloosaThread.com for the latest West Alabama news, sports and weather. Better yet, download the app.",
  "word_count": 1156,
  "scraped_at": "2026-02-14T14:15:41.904464"
}