{
  "article_id": "00d9774c44d3",
  "url": "https://news.yahoo.com/column-newby-awards-sends-invitation-143124446.html",
  "title": "Column : The Newby Awards sends out an invitation to Taylor Swift and Travis Kelce",
  "date": "20231229T150000Z",
  "domain": "news.yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Column: The Newby Awards sends out an invitation to Taylor Swift and Travis Kelce\nIn a year when “Everything Everywhere All at Once” dominated the Oscars, Taylor Swift took that theme to a whole new level before 2023 was done.\nWe're not even talking about the mammoth tour or the blockbuster movie or the overwrought fan base.\nThis was The Year of Traylor.\nWhen Swift hooked up with Kansas City tight end Travis Kelce, the world's two most unstoppable forces — Swifties and NFL aficionados — were suddenly joined as one.\nWe'll likely never be the same again.\nWith that in mind, the 11th annual Newby Awards would like to extend a far-fetched but sincere invitation to the ultimate power couple.\nIf y'all can find the time to attend our ceremony, we'll guarantee a Couple of the Year statuette. Two of them, in fact, one for each of you.\nThis is no small gesture, considering our combined budget for the previous 10 Newby Awards was exactly zero dollars. We'll even arrange an actual ceremony for the two of you to attend.\nClearly, we're not kidding around here.\nBut just in case Swift and Kelce turn down our incredibly generous offer, here's a few more honorees from our annual look at everything from the ridiculous to the infuriating to the exalted over the past 12 months in sports.\nBOBBY BONILLA MEMORIAL CUP\nMore in Sports\nBarcelona fans tear into several players amid Atlético disaster\nOne of the most cherished days of the year is July 1, when we all get to celebrate Bobby Bonilla receiving another $1,193,248.20 check from the New York Mets.\nNever mind that Bonilla is now 60 years old and hasn't played a baseball game in more than two decades. This is a storied tradition that began in 2011 and will continue through 2035.\nBut Japanese superstar Shohei Ohtani is taking the deferred payment plan to whole new levels.\nOhtani agreed to a 10-year-long, $700 million contract with the Los Angeles Dodgers that allows the club to put all but $2 million of his annual payout on layaway until the contract is up.\nStarting in 2034, Ohtani will receive the remainder of his annual payout in $68 million installments each July 1 through 2043.\nIn other words, when Bobby Bonilla Day finally runs its course, we'll still be able to continue celebrating the glory of the deferred payment with Shohei Ohtani Day.\nCAN'T TELL THE TEAMS WITHOUT A PROGRAM\nBy the time Ohtani receives his last check from the Dodgers, we can only presume that college football realignment will have engulfed most of the solar system.\n“Hello, college football fans, welcome to today's Big Ten clash between the University of Mars and Saturn State College.”\nEschewing tradition, geographical logic and any concern for the athletes who are also supposed to be students, college football continued its march into the super conference abyss.\nThe Big Ten is growing to 18 members stretching from coast to coast. The Big 12 has gone from nearly down and out to 16 schools. Texas and Oklahoma are joining the Southeastern Conference. And the Atlantic Coast Conference is adding two schools just a few miles from the Pacific Ocean, plus a new member in Dallas that presumably came aboard merely to provide a convenient spot in the middle of the country for its disparate membership to meet up.\nAnd the storied Pac-12, which bills itself as the Conference of Champions? It went kaput, reduced to only two members after everyone else fled the coop.\nPELE REDUX\nIf all the hoopla over Lionel Messi joining the Inter Miami club in Major League Soccer felt a little familiar, there's a reason for that.\nIt was tried before with the greatest of them all, Pelé.\nIn the mid-1970s, the North American Soccer League lured the Brazilian icon to the New York Cosmos to finish out his career.\nThe arrival of Pelé sparked record crowds throughout the league, but it didn't stick. After his retirement, the NASL called it quits just seven years later.\nLet's hope Messi Mania has a more lasting impact on MLS.\nCITY OF THE YEAR\nTalk about hitting the jackpot.\nNo city had a better year than Las Vegas — an amazing run of good fortune, considering this was a place most leagues wouldn't touch with a 10-foot craps stick not that long ago.\nThe Vegas Golden Knights brought hockey's Stanley Cup to the desert. The Oakland Athletics decided to move to Sin City. Formula One held a grand prix right down the famed Strip. The NFL will cap its season with a Vegas Super Bowl. And it's only a matter of time before the NBA forks over an expansion team.\nKENNY ROGERS GAMBLER AWARD\nSpeaking of Vegas, we sure hope Will Smith was able to pay a visit.\nNo doubt, he would've cleaned up.\nAfter all, the left-handed reliever won a World Series title for the third year in a row — all with different teams.\nThis season, he was part of a Texas Rangers club that won the first championship in the franchise's 62-year history.\nSmith will be facing really steep odds for his fourth straight title after signing with the Kansas City Royals, who went 56-106 in 2023.\nCOMEBACK OF THE YEAR\nSimone Biles can contort her body like no one else on the planet.\nBut her greatest move yet was the way she took on mental health challenges in the aftermath of the Tokyo Olympics.\nAfter a two-year hiatus, the 26-year-old Biles returned to the mat to claim her record eighth U.S. national championship and a sixth world all-around title.\n“Whenever I was 19, it was the end of the world if I had bad days,” she said. “Now I’m like, ’It’s OK, it’s just gymnastics and I’ll come back tomorrow and we’ll get it started again.’”\nSTILL A LONG WAY TO GO\nWhen Spain captured the Women's World Cup soccer title, the celebratory moment wound up exposing the challenges that female athletes still face most every day.\nThe country's top soccer official, Luis Rubiales, kissed star player Jenni Hermoso on the lips — against her will — during the trophy ceremony.\nRubiales defiantly claimed he had done nothing wrong, provoking a players' rebellion that eventually forced him out. Even so, the fight for gender equality carries on with no end in sight.\nIS THERE A DOCTOR IN THE HUDDLE?\nAaron Rodgers continues to masquerade as a medical expert after an Achilles injury on the fourth play with his new team brought a jarring end to his season.\nThe New York Jets quarterback, who you might remember gave a thumbs-down to COVID-19 vaccines, claimed bone broth helped him make a much-quicker-than-expected recovery.\nWe prefer to award a Newby to the surgeons who performed a revolutionary “SpeedBridge” procedure, which is designed to expedite the healing process.\nIN MEMORIUM\nWe bid a fond farewell in 2023 to some of baseball's most annoying quirks, such as stepping out to box after every pitch to fiddle with various parts of the uniform and absurd defensive shifts that had third basemen lurking in right field.\nNew rules, designed largely to speed up the national pastime's dawdling pace, worked to perfection as the average time of games dropped significantly from what had been more than three excruciating hours to get through 27 outs.\nWe'll drop our request that all stadium seats be capable of folding out into a bed.\nLET US FORGET\nDan Snyder was finally forced to the sideline.\nSure, his sale of Washington's NFL team netted more than $6 billion, but that seemed a small price to pay to rid us of one of the worst owners in the history of professional sports.\nWith that out of the way, let's send out another invite to Taylor Swift and Travis Kelce.\nWe're still eagerly awaiting their RSVP.\n___\nPaul Newberry is the national sports columnist for The Associated Press. Write to him at pnewberry@ap.org\n___\nAP sports: https://apnews.com/sports",
  "word_count": 1333,
  "scraped_at": "2026-02-14T12:30:50.158649"
}