{
  "article_id": "00ea8aa9f245",
  "url": "https://www.boston.com/culture/books/2023/05/30/2023-summer-books/",
  "title": "2023 summer books : What to read , according to local experts",
  "date": "20230530T121500Z",
  "domain": "boston.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "24 books that you should read this summer, according to local experts\nWe asked staff members at Trident Booksellers & Café, Frugal Bookstore, Harvard Book Store, Brookline Booksmith, and Porter Square Books for the titles they’re most excited to pick up.\nMore book recommendations:\nSummer reading season is upon us.\nFor the scoop on the best books to pick up, we asked staff members at five local bookstores — Trident Booksellers and Cafe, Frugal Bookstore, Harvard Book Store, Brookline Booksmith, and Porter Square Books — for their recommendations of standout reads among the slew of new titles that will be out for summer 2023.\nWhether you’re soaking up the sun on a beach towel or beating the heat from the comfort of your own home, they said these 24 new books, ranging from fiction to history to romance, are not to be missed.\n“The Wager” by David Grann (April 18)\nIf you’re looking for a book that will be a “delight to read,” you need look no further than this work of nonfiction, according to Courtney Flynn, manager of Trident Booksellers & Café. In it, the New Yorker staff writer and bestselling author of “Flowers of the Killer Moon” turns his attention to the true story of a shipwreck in the 1700s that results in the crew being abandoned on a desert island. The survivors build a flimsy craft, eventually washing up on the coast of Brazil with a wild story to tell. But six months later, their story is contradicted when three more survivors emerge. A trial takes place where accusations of mutiny abound. “It’s all about survival and savagery,” Flynn said. “It’s a total page-turner if you’re interested in shipwrecks or any kind of history like that. It’s really fun.”\n“Happy Place” by Emily Henry (April 25)\nFlynn said Henry always delivers romance novels that are quirky and relatable, and her newest one is no exception. The story follows a woman named Harriet and her ex, Wyn, who are trying to keep under wraps that their relationship has ended as they spend one last weekend away with friends at a beloved beach house. “It’s relatable, if you’ve ever been in an on-again, off-again relationship or if you’ve ever ended a relationship,” Flynn said. “It’s sweetly written. It’s engrossing, and it’s going to be a really fun beach read this summer.”\n“Small Mercies” by Dennis Lehane (April 25)\nLehane returns to Boston for the setting of his new novel, which Flynn described as a “gritty Boston mystery.” The story, set in the summer of 1974 against the backdrop of the desegregation of schools in the city, follows what happens when Mary Pat Fennessey’s daughter, Jules, doesn’t return to their South Boston home one night. The same evening, a young Black man is fatally struck by a train under mysterious circumstances. “We’re following Mary Pat Fennessey, who’s a good old, Irish Catholic, South Boston mother who relentlessly looks for her missing daughter,” Flynn said. “It’s all tied up in the Irish gangs in South Boston in the ’70s.”\n“Summer on Sag Harbor” by Sunny Hostin (May 2)\nClarrissa Cropper Egerton, co-owner of Frugal Bookstore, recommends keeping an eye out for this story, set in Sag Harbor. It’s the second novel from “The View” co-host; Hostin’s first novel, “Summer on the Bluffs,” was set on Martha’s Vineyard and was a Boston.com Book Club pick last year. The new novel follows what happens when real estate developers discover a little-known area in Sag Harbor, known as SANS, where a community of affluent African American families vacation. “The residents are trying to fight for the culture and the history and just preserve this little known section of Long Island,” Cropper Egerton said. At the same time, the protagonist, Olivia Jones, arrives in the community. “She’s there for rest, but she’s also looking to dig a little deep and find out some history that’s been hidden,” Cropper Egerton said.\n“Titanium Noir” by Nick Harkaway (May 16)\nBrad Lennon, buying and inventory manager at Harvard Book Store, said Harkaway is one of his favorite authors. The new book from the writer follows the tale that unfolds when detective Cal Sounder is called to investigate a homicide in a dystopian, near-future society. At the scene, he learns the victim, despite looking no older than 30 years old, is 91; he is a Titan, a genetically altered elite member of society. “[Harkaway’s] just really smart, really fun. … Any time I get a new Nick Harkaway book, it’s kind of like Christmas,” Lennon said.\n“Yellowface” by R. F. Kuang (May 16)\nYou may know Kuang for her sci-fi and fantasy writing, but this new novel, one that Flynn said is “definitely the biggest buzzed book of the season,” marks a departure from her typical genres. The story follows two writers, June and Athena, who are contemporaries at different stages in their careers. Athena is extremely successful, while June has yet to break onto the scene. The book begins with Athena’s death and June taking the writer’s unpublished manuscript and passing it off as her own. “The whole book is the roller coaster ride of June trying to pass off this manuscript as hers ,” Flynn said. “Meanwhile, Athena is an Asian writer and June is white. There’s a lot of commentary about racism in publishing and the world at large. It’s such a good read. It’s witty, it’s sharp. And I think it’s going to be a really big book. That’s my number one.”\n“Homelands” by Timothy Garton Ash (May 23)\nHistory fans should consider checking out this work of nonfiction, which Lennon has his eye on. Garton Ash lived in Germany when he was young and went back to the country after the fall of the Berlin Wall. In this new book, he draws on his own notes from being in postwar Europe, writing an account of the region’s history that touches on events ranging from the 2008 financial crisis to the war in Ukraine. “[It’s] a personal history of Europe,” Lennon said.\n“Fires in the Dark” by Kay Redfield Jamison (May 23)\nAlie Hess, head buyer at Brookline Booksmith, suggests picking up this new work of nonfiction, from the author of the psychology memoir “An Unquiet Mind.” The new book sees the author reflecting on how self-care and mental illness are playing a role in the world today and the changes she’s seen over the years. “It’s kind of her study on the quest for relief from psychological and mental pain,” Hess said. “And how it manifests. … She’s just spent many years studying this having gone through a lot of it, and she also put some interesting case studies in here as well.”\n“Raw Dog” by Jamie Loftus (May 23)\nIf you’re looking for a work of nonfiction that is part-travelog, part-culinary history with a “strong whiff of class snobbery,” this is the book for you, according to Ellen Jarrett, co-owner and adult buyer at Porter Square Books. The title is the debut work from Loftus, a Boston native. “It’s all good fun,” Jarrett said. “Loftus takes us on a cross-country tour exploring the who, where, when, and how of the hot dog. They are uniquely American though they have no indigenous roots in America. The volume includes gorgeous endpapers, an illustrated case, and illustrations by [Loftus] throughout.”\n“Even If the Sky is Falling” edited by Taj McCoy (May 30)\nIf short stories are more your jam, Cropper Egerton recommends this collection of interconnected, diverse, multicultural narratives that are mixed with humor and “a little steamy heat.” One story follows two NASA specialists, another weaves the story of two law school students who learn how opposites attract, while a third features two avid readers who meet in a bookstore. “In the summer you want to have some romance, some love, some escape. … It’s spicy, it’s all of that,” Cropper Egerton said.\n“The Overnights” by Ian K. Smith (May 30)\nThis mystery novel, the third book in a series about Chicago detective turned private eye Ashe Cayne, is another Cropper Egerton said shouldn’t be missed. In the latest story in the series, Cayne is hired to protect a Chicago news anchor and is also investigating the murder of a Black teenager by a white police officer. “He finds himself in a race against the clock,” Cropper Egerton said.\n“Lady Tan’s Circle of Women” by Lisa See (June 6)\nHess is looking forward to this new work of historical fiction, which is based loosely on the story of a female physician in 15th-century China. “She has the earliest written words on medicine by a woman,” Hess said. “So it’s her story — the ups and downs, the family, the fallouts of just what that means. I’ve read other books of [See’s]; she’s so good at creating this world where you feel like you’re there. She’s a great writer.”\n“Spies” by Calder Walton (June 6)\nThe other work of nonfiction Lennon said he’s “super excited” about is this book which delves into how the Cold War started earlier than most people realize and has continued past the 1991 collapse of the Soviet Union. It examines the rise and fall of eastern superpowers, tackling Russia’s history and present and the unrolling conflict between the United States and China. “It’s a big history of espionage during the Cold War, which is right up my wheelhouse,” Lennon said.\n“Better Living Through Birding” by Christian Cooper (June 13)\nYou may know Christian Cooper’s name from headlines that dominated in 2020, calling attention to what happened when the birder was in Central Park and a woman called the police, falsely claiming he was threatening her when he asked that she keep her dog on a leash. In this new book, Cooper delves into his passion for birding, and Flynn said even if you’re not a fan of the pastime, “you will find something in this book.” “It’s really focused on the love he has for the sport of birding and how that has opened his life up to so many other possibilities. … He was a writer and known birder before the whole incident happened,” she said. “So the book is much more about his life beyond that video. It’s beautifully written and inspiring, and he’s just an insightful person.”\n“Beyond This Harbor” by Rose Styron (June 13)\nOne memoir Jarrett is looking forward to is this work from the poet, human rights activist, famous policy adviser, and longtime wife of author William Styron. “She’s a pretty extraordinary figure,” Jarrett said. The couple lived together over the years in Roxbury, Martha’s Vineyard, and Connecticut. Jarrett said Rose Styron was a witness to history — a friend to politicians, like the Kennedys, and celebrities, like Frank Sinatra. “I believe that’s what makes her story so extraordinary is the times she lived in, the people she encountered, and the opportunities [of] which she took advantage. … She really was a very benevolent person,” Jarrett said. “She gave a lot to her artist friends and spent time with them and supported them.”\n“The Puzzle Master” by Danielle Trussoni (June 13)\nFor those looking to escape into a thriller, Jarrett suggests this work that follows Mike Brink, a once-promising football star who, after sustaining a traumatic brain injury, transforms into a savant with extraordinary puzzle-solving and constructing skills. He is asked to help solve a puzzle drawn by a woman serving a prison term for murder and who has been mute since her arrest. The belief is that the puzzle will explain her crime. It’s an “addictive thriller,” Jarrett said. “Brink becomes obsessed with the puzzle, and his subsequent revelations lead him and others on a hunt through a maze of clues and ancient mysteries to find the dark truth.”\n“Zero Days” by Ruth Ware (June 20)\nDescribing herself as a “mystery reader at heart,” Hess said if you’re looking for a book you can’t put down and can get lost in for a day, this read should be on your list for the summer. “Basically this woman comes home [and finds] her husband is dead,” Hess said. “They worked together, and she’s devastated. And then she realizes everybody thinks she did it, and so she goes on the run.”\n“Random Acts of Medicine” by Anupam Jena and Christopher Worsham (July 11)\nFans of the book “Freakonomics” might want to keep an eye out for this new work of nonfiction, which takes a similar approach but for the medical world, according to Hess. It’s a “really cool” read, she said. “It [covers] why our children that are born in certain months are more likely to get the flu,” she said. “Or why sometimes we get too much health care and sometimes not enough health care. So it’s just a fascinating look into the oddities of the medical world and things you would never think of that have been studied and figured out.”\n“Mother Nature” by Jamie Lee Curtis, illustrated by Karl Stevens (July 18)\nActress Jamie Lee Curtis’s big year continues this summer when her graphic novel, which is adapted from the Oscar winner’s film by the same name, is released. Jarrett said it is being described as “eco horror.” “This is getting a lot of buzz, obviously,” she said. The story follows heroine Nova Terrel, who starts digging into a corporation’s experimental oil extraction projects after her father’s mysterious death. She finds that the company’s clean water initiative, “Mother Nature,” is not as benign or beneficial as it seems.\n“Crook Manifesto” by Colson Whitehead (July 18)\nBoth Hess and Lennon can’t wait to pick up the latest novel from this Pulitzer Prize-winning author. The new book is a follow-up to Whitehead’s last novel, “Harlem Shuffle,” though Hess said it can be read as a standalone. “I can’t call it light, but it’s funny, it’s entertaining,” she said. The story once again follows Ray Carney, a furniture store owner and former fencer of stolen goods, as he tries to keep his head down and his Harlem business thriving. “This one moves the story up to the 70s, but I think it will be just as fun,” Lennon said.\n“Intermission” by Phyllis R. Dixon (July 25)\nYou shouldn’t sleep on this new novel that is steeped in ’90s nostalgia, according to Cropper Egerton. The story follows four friends who formed a pop group — the Diamonds — in the ’90s and who have a bitter breakup that shatters their fame and their sisterhood, costing them their big time success. “Now they have an opportunity where they have a reunion, they can get a fresh start and they’re all a little older so they’re going through their own mid-life crises, individually,” Cropper Egerton said. “So this is a story about reconciliation, friendship, love, and just building those relationships that were broken in the past.”\n“Tom Lake” by Ann Patchett (Aug. 1)\nAnn Patchett devotees have this new novel from the author to look forward to, according to Jarrett. The narrative, set in 2020, follows a family living in Michigan. Three daughters have returned home to the family orchard, and while picking cherries, they ask their mother to tell the story of Peter Duke, a famous actor she had a romance with years before when they shared a stage at a theater company, Tom Lake. Her retelling causes the daughters to reexamine their own lives. “In the hands of Ann Patchett, you know it’s going to be a wonderful story,” Jarrett said.\n“Whalefall” by Daniel Kraus (Aug. 8)\nThis novel, which is being described as a mashup of the “The Martian” and “127 Hours,” is one that Lennon said everyone at Harvard Book Store is curious about. Instead of getting stuck on Mars, the story follows what happens when a scuba diver gets eaten, and stuck inside, a sperm whale. “It looks like a fun vacation read,” Lennon said.\n“The Heaven & Earth Grocery Store” by James McBride (Aug. 8)\nJarrett said in his new novel, McBride has crafted a story “full of humor and humanity.” Set in Pottstown, Pennsylvania, in 1972, the narrative centers around the mystery of a skeleton found at the bottom of a well. The neighborhood where the discovery is made, Chicken Hill, is where immigrant Jews and African Americans have always pulled together to sustain themselves. “I think it pretty much goes without saying that it will be a masterpiece if it’s James McBride,” Jarrett said. “So we’re all looking forward to that one.”",
  "word_count": 2751,
  "scraped_at": "2026-02-14T13:24:54.075614"
}