{
  "article_id": "00f5a6ecd4d4",
  "url": "https://www.thenationalnews.com/news/europe/2026/01/02/swiss-ski-resort-blast-crans-montana/",
  "title": "At least 40 killed in deadly New Year party blast at Swiss ski resort bar",
  "date": "20260102T071500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Swiss police said about 40 people were killed and 115 injured when a fire broke out in a bar in the ski resort of Crans-Montana during New Year's Eve celebrations.\nThe blast happened in the early hours of New Year’s Day as revellers celebrated the arrival of 2026.\nPolice are investigating whether the bar exceeded its limit of about 200 customers. The fire broke out after authorities banned the use of fireworks, including on New Year's Eve, owing to dry weather in the past two months.\nThe town, in the canton of Valais, is a popular tourism location and France and Italy said some of their citizens were among the injured. Local officials said the blaze was the result of an accident.\nThere were media reports of an explosion at the scene, but local authorities said this was caused by the blaze rather than the other way around.\nThe fire broke out at around 1.30am. Witnesses said they believed it was started by a candle placed in a champagne bottle. Videos online show flames rapidly spreading across the ceiling.\n“Some of the bottles were near the ceiling and it caught fire,” a witness, Emma, told French news channel BFMTV. “The whole ceiling was in flames and the fire spread really fast. It happened in seconds. We ran outside, screaming and crying.”\nShe said she saw a man with severe burns to his face and body screaming for help outside, and speculated that he might not have survived.\nAnother witness, Albane, said the blaze was “clearly accidental” and the ceiling caught fire after the candle was placed on a table. The club was “packed with people” when it started, she added.\nCrans-Montana is a popular ski resort in the Valais canton, two hours away from the capital Berne. It is in the French-speaking part of the country, and around 100km from the Italian border.\nSwiss authorities said the local intensive care unit in Valais was full, and Italy had made a major burns unit available in Milan to treat the injured.\nLe Constellation bar, part of which is in a basement, is believed to be French-owned.\nThe victims are thought to be from many European countries but, due to Swiss law, the official number cannot be released until the relatives of those killed and injured have been informed.\nThe Valais canton's head of police, Frederic Gisler, said a helpline had been launched for relatives. “I can’t hide from you that we are all shaken by what happened overnight in Crans,” he told a media conference.\n“Our count is about 100 injured, most seriously, and unfortunately tens of people are presumed dead,” he said. Patients have been sent to hospitals in Sion, Lausanne, Geneva and Zurich, he added.\nSixteen Italian citizens are missing following incident, Italy's Foreign Ministry said. A representative for the ministry told the BBC that between 12 and 15 others have been found in hospital and are receiving treatment. Three have severe burns and will be moved to Italy soon, the representative said.\nSwiss President Guy Parmelin said the whole nation was in mourning. “What was meant to be a moment of joy turned, on the first day of the year in Crans-Montana, into mourning that touches the entire country and far beyond,” he said.\nItaly’s Foreign Minister Antonio Tajani said the major burns unit of Milan’s Niguarda Hospital was available to help treat the injured and emergency services in the Aosta Valley region, which border’s Switzerland, were available to help Swiss authorities.\nFrench President Emmanuel Macron said: “My thoughts are with the bereaved families and with the injured. To Switzerland’s people and authorities, I express France’s full solidarity and brotherly support.”\nItalian Prime Minister Giorgia Meloni said she was following the situation closely to find out whether Italians were involved.\nThe UK’s embassy in Switzerland said on Thursday morning that it was monitoring the situation and urged those affected to contact the embassy or the helpline set up by Swiss authorities.\nThe UK Foreign Office paid tribute to the Swiss emergency services leading the response.\nAn Italian man told broadcaster Rai News he was still waiting to hear from a friend who had been inside the bar. He said that one of his friends escaped the bar “burnt all over” and a second was taken to a Zurich hospital by helicopter.\n“Another friend of ours … last night we had no news, he couldn't be found,” he added. “My friends and I, we haven't slept last night, we've barely eaten.\"\nAnother man, who thought his younger brother might have been inside the club, said he tried to break the window so people could get out. “We heard a big explosion and after that we saw a lot of smoke,” he told the BBC. He said he saw people with serious burns.\nThe man said that after firefighters and doctors took over he stayed to help where he could, offering water and clothes to the injured, including giving his jacket to one of them.",
  "word_count": 835,
  "scraped_at": "2026-02-14T12:21:12.433470"
}