{
  "article_id": "00fb762bf45e",
  "url": "https://www.finanznachrichten.de/nachrichten-2023-03/58692420-axi-extends-multi-year-partnership-deal-with-man-city-008.htm",
  "title": "Axi extends multi - year partnership deal with Man City",
  "date": "20230329T213000Z",
  "domain": "finanznachrichten.de",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "- Axi renews multi-year deal with Manchester City and expands rights with the addition of Manchester City women's team.\n- Promotes competitive Copy Trading offer, revamped Axi Elite offering and an expanded range of asset classes.\nSYDNEY, March 29, 2023 /PRNewswire/ -- Leading global Foreign Exchange, Commodities, Indices, Share, Precious Metals and CFD broker Axi has announced an extension of its flagship partnership with Manchester City Football Club.\nAxi has been the Official Online Trading Partner of the leading English football club since 2020, during which time the topflight men's team has amassed great success on the field, winning back-to-back Premier League titles during the 2020/21 and 2021/22 seasons, plus the League and League Cup double in 2020/21.\nHannah Hill, Head of Brand and Sponsorship at Axi says, \"Over our three-year partnership, we've grown a great relationship with City Football Group. We've established that our businesses share a highly ambitious approach and unwavering dedication to success, so we had no hesitation in wanting to extend our partnership and see where we can take the relationship to next. One of the defining features of the partnership has been the alignment of our brands when it comes to 'finding an edge'; City are focused on gaining a competitive edge on the field, whilst also embracing innovation both on and off the pitch; likewise, Axi is focused on giving our traders an edge in the markets while being committed to break new grounds with innovative products and services, one of which is Copy Trading. \"\nLouis Cooper, Chief Commercial Officer at Axi says, \"From a commercial perspective the relationship has been extremely successful. Our alignment on a global scale with Manchester City's brand and global fanbase has elevated our position in the marketplace.\"\nAlong with the continued sponsorship of the men's football club, the renewed deal will be enhanced with Axi also sponsoring Manchester City Women's Football Club.\nCooper added \"The global popularity of women's football has justly skyrocketed in recent years, as has women's involvement in financial markets .\n\"This new aspect of the partnership gives us a chance to help support the women's side of game and also help Axi resonate even more with female traders and investors, who are a valuable segment of our growth ambition globally. Women continue to take more control of their financial investments and it's important for Axi to be relatable as a brand to female investors around the world.\nHe further stated that coinciding with the renewal is the launch of the revamped Elite account offering.\nTom Boyle, Vice President, Global Partnerships Marketing and Operations at City Football Group, said: \"We are delighted to announce the renewal of our partnership with Axi today. With shared values of high performance, ambition, and innovation throughout the partnership to date, we've successfully worked together to achieve great results and impact at a really exciting time for Axi.\n\"We're also pleased that Axi has further expanded its agreement to become a partner of Manchester City Women. The commercial appeal of our women's team and the women's game in general continues to grow and it's fantastic that Axi recognize this and will be joining us on this journey.\"\nAbout Axi\nAxi is a global online FX and CFD trading company, trusted by thousands of ambitious customers in 100+ countries around the world. We help all types of traders , trading businesses, banks and financial organizations find the edge they need to achieve their financial goals through informed transactions made on the world's financial markets. Axi offers a wide range of assets including CFDs for several asset classes including Shares, Forex, Gold, Silver, Coffee, , Indices, and other commodities.\nAt Axi, we are proud of our reputation as an honest, fair, and trusted broker. Our many awards and 'great' Trustpilot reviews prove we have earned the confidence of customers who value our outstanding service, fast execution, secure payments, segregated funds, and easy withdrawals. Moreover, we also work pro-actively with leading regulatory governing authorities globally to ensure we exceed the highest standards in the industry.\nThe Axi Copy Trading App is provided in partnership with London & Eastern LLP.\nElite account is available to Professional clients only.\nCFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 82.7% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you understand how CFDs work and whether you can afford to take the high risk of losing your money.\nFor more information or additional comments from Axi, please contact: service@axi.com\nPhoto - https://mma.prnewswire.com/media/2042525/Axi.jpg\nLogo - https://mma.prnewswire.com/media/2042524/Axi_Logo.jpg\nView original content:https://www.prnewswire.co.uk/news-releases/axi-extends-multi-year-partnership-deal-with-man-city-301784582.html\nGleichzeitig vollzieht sich an der Wall Street ein lautloser Favoritenwechsel. Während viele auf Wachstum setzen, feiern Value-Titel mit verlässlichen Cashflows ihr Comeback: Telekommunikation, Industrie, Energie, Pharma – die „Cashmaschinen“ der Realwirtschaft verdrängen hoch bewertete Hoffnungsträger.\nIn unserem aktuellen Spezialreport stellen wir fünf Aktien vor, die genau in dieses neue Marktbild passen: solide, günstig bewertet und mit attraktiver Dividende. Werte, die nicht nur laufende Erträge liefern, sondern auch bei Marktkorrekturen Sicherheit bieten.\nJetzt den kostenlosen Report sichern – bevor der Value-Zug 2026 endgültig abfährt!\nDieses exklusive PDF ist nur für kurze Zeit gratis verfügbar.",
  "word_count": 861,
  "scraped_at": "2026-02-14T12:25:12.368886"
}