{
  "article_id": "013fde17018c",
  "url": "https://www.masslive.com/tv/2025/05/how-to-watch-ufl-free-live-stream-week-9.html",
  "title": "Watch UFL free live stream today : TV Channel , schedule",
  "date": "20250523T224500Z",
  "domain": "masslive.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The UFL regular season is almost over and the playoff participants are set, but the standings are still close coming down the stretch and will take shape even more in Week 9.\nFans looking to watch this weekend’s action can do so for free by using DirecTV, which offers a free trial, or FuboTV, which also offers a free trial as well as up to $25 off your first month. SlingTV doesn’t offer a free trial but has promotional offers available for streaming the games. You can stream ESPN+ on your phone, tablet, smart TV or gaming console for $11.99/month or bundle with Disney+ and Hulu for just $16.99 per month.\nThe top matchup of the week is on Saturday, May 24 at 3 p.m. EDT when the top two teams in the USFL Conference square off with the Birmingham Stallions hosting the Michigan Panthers. The Panthers are 6-2 and at the top of the conference with the Stallions a game back at 5-3. They first met in Week 2 and the Stallions pulled put a 21-12 road victory.\nStream: DirecTV (free trial); FuboTV (free trial); SlingTV; ESPN+\nBetting: Check out our MA sports betting guide, where you can learn basic terminology, definitions and how to read odds for those interested in learning how to bet in Massachusetts.\nWhat is DirecTV?\nDirecTV offers practically everything DirecTV provides, except for a remote and a streaming device to connect to your television. Sign up now and get three free months of premium channels including MAX, Paramount+ with SHOWTIME and Starz.\nWhat is FuboTV?\nFuboTV is an internet television service that offers more than 200 channels across sports and entertainment including Paramount+ with SHOWTIME. From the UEFA Champions League to the WNBA to international tournaments ranging across sports, there’s plenty of options available on FuboTV, which offers a free trial and up to $25 off the first month for new customers.\nWhat is Sling TV?\nSling TV offers a variety of live programming ranging from news and sports and starting as low as $20 a month for your first month. Subscribers also get a month of DVR Plus free if they sign up now. Choose from a variety of sports packages without long-term contracts and with easy cancellation.\nWhat is ESPN+?\nESPN+ is a one-stop shop for content from almost every single sport. In addition to on-demand replays of games across all sports shown on the ESPN and Disney family of networks, there is also exclusive access to select college football games, NHL games, soccer matches, UFC programs and the entire 30 for 30 catalogue. Additionally, there is ESPN+ exclusive original programming like NFL Primetime, Dana White’s Contender Series and The Breakdown with Peyton and Belichick. You can stream ESPN+ on your phone, tablet, smart TV or gaming console for $11.99/month or bundle with Disney+ and Hulu for just $16.99 per month.\nRELATED CONTENT:\nNFL owners unanimously approve player participation in Olympic flag football for 2028\nBy DAVE CAMPBELL AP Pro Football Writer\nEAGAN, Minn. (AP) — NFL players in the past three Pro Bowls have had a taste of flag football under the new format for the all-star game.\nFor a select few, the Olympics could be next.\nLeague owners have unanimously approved permission for players to participate in flag football for the 2028 Olympics.\nThe vote at the spring meetings in Minnesota on Tuesday authorized the league to negotiate safety provisions and scheduling logistics with the NFL Players Association, the sport’s international governing body and the relevant Olympic authorities before it becomes reality during the next Summer Games in Los Angeles.\nThe excitement throughout the league and momentum in global growth of the game have made this a seemingly inevitable advancement.\n“I think the world finally has an opportunity to see the greatest athletes in the world participate,” league executive vice president of football operations Troy Vincent said.\nThe 10-player Olympic rosters will be selected by the national committee for each country, with six teams each in separate tournaments for men and women. Only one player per NFL club would be allowed for each country. The game itself is a 5-on-5 competition on a 50-yard field.\nWith the 2028 Olympics scheduled from July 14-30, the flag football gold medal game could practically be staged before teams report to training camp, a provision that NFL executive vice president of club business and league events Peter O’Reilly indicated has already received informal support. Tryout and training periods for the national teams would also fit in offseason quiet periods for NFL clubs, O’Reilly said.\nAt least seven athletes have appeared in an NFL game and an Olympics in the same year, including safety Nate Ebner in 2016 (rugby) when he was with the New England Patriots and running back Herschel Walker in 1992 (bobsledding) when he was with the Eagles. The others were in track and field.\n“I do believe you’ll see the hands go up from those who are not just currently playing but those veterans, those individuals, who have not had the professional career they were looking to have or the professional experience,” Vincent said.\nVikings wide receiver Justin Jefferson attended the news conference along with teammate Brian Asamoah, a backup linebacker and special teams ace whose parents were born in Ghana and could potentially play for his country of heritage.\nWhile Jefferson would provide some serious star power, players of his stature might not be willing to risk injury right before the season. He said he’d have to consider his participation, but as one of the league’s global ambassadors for the sport he’s a true champion of flag football.\n“The Pro Bowl game was honestly way more fun,” he said. “We felt like kids out there.”\nThe flag football vote was a given. The hard part for league owners this week at the Omni Viking Lakes Hotel is determining the fate of the tush push.\nAfter tabling the issue seven weeks ago, a vote was expected on Wednesday on the proposal by the Green Bay Packers to prohibit the play popularized by the reigning Super Bowl champion Philadelphia Eagles. To enact the ban, 24 of the 32 teams must approve.\nCommissioner Roger Goodell said last month he believes the owners will reach a consensus on the issue that involves both competitive integrity and player safety. The league released a revised proposal by the Packers on Monday that broadens the language to prohibit pushing, pulling, lifting or encircling a runner by any offensive player, not specific to quarterback assists. This would put the rule back where it was 20 years ago, when a previous such ban was lifted because of the difficulty of enforcement.\nEagles owner Jeffrey Lurie has been leading the defense of the play his team developed with the coinciding arrival of strong-legged quarterback Jalen Hurts in 2020.\nThe NFL has no conclusive data supporting a connection between the tush push and an injury risk increase, as Lurie noted at the previous league meetings in Florida. The Buffalo Bills are also a frequent user and favor a ban for safety, though, as head coach Sean McDermott said after the vote was tabled.\nThe tush push, which has also been dubbed the “Brotherly Shove” in a catchy and clever twist on the Greek-to-English translation of Philadelphia, not only assigns a player to push the backside of the quarterback for extra power behind a tight nine-man line but sometimes involves a blocker on the end pivoting to try to pull the ball carrier past the marker.\nHealth is only half of this debate, however. Entertainment is the other.\nWhile the Eagles have nearly perfected the play for fourth-and-1 or 1-yard line situations with well-chosen personnel and well-rehearsed precision, it looks more like rugby than football.\nThe Packers have been among several teams voicing their distaste for the evolution of the traditional quarterback sneak into an all-out scrum. On the memo distributed by the NFL on Monday, the reasons cited for the proposal are player safety and pace of play.\n“It was controversial when the forward pass came out,” Lurie said at the last league meetings. “I think aestheticism is very subjective. I’ve never judged whether a play looks OK.”\nGlobal marketing rights expansion\nThe NFL further increased its international presence by granting global marketing rights to the Buffalo Bills, Cincinnati Bengals and Tennessee Titans and bring all 32 teams into the 21-country program that was launched three years ago.\nThe Bills and Bengals were granted rights in Canada, where four other clubs have already been operating outreach efforts. The Titans got Ireland, where five other teams were previously granted rights.\nStakes in the 49ers and Browns\nThe clubs approved a couple of minor ownership changes, with Pro Football Hall of Fame member Charles Woodson buying a piece of the Cleveland Browns as a limited partner and three Bay Area families acquiring non-controlling minority shares of the San Francisco 49ers.\nThe Associated Press contributed to this post",
  "word_count": 1494,
  "scraped_at": "2026-02-14T12:50:26.792886"
}