{
  "article_id": "01408d0500ac",
  "url": "http://www.shanghainews.net/news/278496583/feature-china-fitness-drive-ignites-national-vitality",
  "title": "Feature : China fitness drive ignites national vitality",
  "date": "20250808T161500Z",
  "domain": "shanghainews.net",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "China's national fitness movement is transforming urban landscapes and lifestyles, driving a surge in grassroots sports participation and tech-driven fitness innovations across the country.\nWUHAN, Aug. 8 (Xinhua) -- For Li Min, a father from eastern China's Suzhou City, this summer's hottest ticket wasn't for a concert or a movie, but a grassroots football match. Out of more than a million hopefuls, he secured two tickets to a game in the wildly popular Su Super League, a regional tournament featuring teachers, students, repair workers, and office clerks from across Jiangsu Province.\n\"After watching the game, my 10-year-old son said he wanted to play football,\" said Li. \"So, we signed up for a football class. The Su Super League is making more children fall in love with football.\"\nSince kicking off in May, the city-based amateur league has drawn huge attention, with peak single-game attendance surpassing 60,000, over a million fans vying for tickets each round, and short video platform impressions exceeding 10 billion.\nBut China's national fitness movement goes beyond football. As the country marks National Fitness Day this Friday - a legacy of the 2008 Beijing Olympics - more people are embracing active lifestyles. The proportion of those who regularly exercise has risen from 28.2 percent in 2007 to 37.2 percent in 2024, with a goal of 38.5 percent by 2025.\nA NATION IN MOTION\nIn central China's Wuhan, a city known for its intense summer heat, sunset brings crowds of joggers, swimmers, cyclists, and basketball players to the banks of the Yangtze River. Among them is 52-year-old Cheng Xirong, who recently traded her usual square dancing sessions for a more structured fitness walking group.\n\"The coach plays upbeat music and guides us through different paces and moves,\" she said. \"After 45 minutes, I feel so refreshed, both in mind and body.\"\nIn Suzhou, marathon runner Zhang Aiping shared how fitness transformed his life. \"Four years ago, I was overweight, had fatty liver issues, and suffered from insomnia,\" he said. \"I started long-distance running and now train 16 days a month. My health indicators have improved significantly, and I feel much more optimistic.\"\nAccording to the China Athletics Association, 749 road races were held nationwide last year, attracting over seven million participants - an increase of one million from 2023. Top events like the Shanghai Marathon averaged more than 400 million yuan (58 million U.S. dollars) in direct economic benefits.\nYet demand remains high. \"Getting into a marathon is now harder than scoring concert tickets,\" Zhang noted. \"Slots in top cities sell out in under five minutes.\"\nFITNESS IN REACH\nChina's fitness push is also reshaping urban environments. In Wuhan's Shahu Park, a previously neglected underpass has become a sports hub, with two football fields and three basketball courts.\nLi Xiaofang, 59, walks five minutes each morning to bring her granddaughter to a fitness class there. \"It used to be a neglected space. Now it's shaded, safe and perfect for children to burn energy. After two months of classes, my granddaughter can jump stairs with both feet. She's visibly stronger,\" she said.\nNearby, children skateboard, dig in sandpits and jog on dedicated tracks. In the strength training area, smart voice-guided machines help users optimize their workouts.\nNationwide, similar \"10-minute fitness circles\" in cities and \"15-minute fitness zones\" in rural areas are becoming more common, supported by local and national authorities. Jiangsu Province plans to build or upgrade 1,000 sports fields and 200 kilometers of fitness trails by 2025. Cities such as Xi'an and Qingdao are offering hundreds of events, from kung fu tournaments to drone racing, drawing millions of participants.\nEven in remote northwest China, the snowy mountains of Altay in Xinjiang are seeing growing activity.\n\"We've invested nearly seven billion yuan (970 million U.S. dollars) to build nine ski resorts,\" said Jenis Khadis, commissioner of Altay Prefecture. \"Each one has its own character. Our goal is to make Altay a globally-recognized winter sports destination.\"\n\"I once thought skiing was a niche sport,\" said Li Ran, a snowboarder from south China's Guangdong Province. \"But more of my friends are picking it up. It's becoming part of our lifestyle.\"\nTECH-DRIVEN FITNESS\nFor many, the fitness revolution begins at home, supported by smart devices. Chen Chen, a gym-goer in central China's Zhengzhou, bought smart dumbbells from tech brand Xiaomi earlier this year and has since developed a passion for strength training.\n\"The app of the dumbbells provides lots of detailed instructional videos. It's like having a personal trainer at home,\" he said. \"After a 20-minute workout, it gives you a report, and you can share it with friends online.\"\nAccording to the China Sporting Goods Federation, online sales of dumbbells reached 13.89 million pairs in 2024, up 47.6 percent from the previous year. Women accounted for nearly 70 percent of buyers, reflecting the rise in female-led home fitness routines.\nSmart fitness equipments are gaining popularity to make outdoor sports more accessible. At central China's Enshi Grand Canyon, robotic exoskeletons assist elderly climbers and have become a popular attraction. \"It felt like someone was gently pushing me uphill,\" said Cai Quan, a tourist from Jiangsu. \"Enshi's combination of nature and high-tech is truly inspiring.\"\nIn April, humanoid robots even joined human runners in a Beijing half-marathon, offering a glimpse into the future of sport.\n\"Robots may not always be athletes,\" said Zhao Fuming, director of the Beijing Marathon Association. \"But they can become assistants - making fitness events more enjoyable and accessible.\"\nWith 4.59 million sports venues and 4.07 billion square meters of sports facilities nationwide, China's per capita sports space has tripled in the past two decades - from just 1.03 square meters in 2003 to three square meters per person by the end of last year.\n\"Smart facilities, diversified equipment, and scientific training methods have empowered the spread of fitness in China,\" said Zhang Desheng, a professor at Wuhan Sports University. \"In the future, fitness will become a lifestyle for more and more Chinese people. Finding a workout buddy used to be hard, but now, social media makes it simple as well.\"",
  "word_count": 1012,
  "scraped_at": "2026-02-14T12:12:23.619007"
}