{
  "article_id": "016b0648d105",
  "url": "https://www.manchestereveningnews.co.uk/whats-on/family-kids-news/25-things-kids-manchester-october-32676656",
  "title": "25 things to do with kids in Manchester this October half term and Halloween",
  "date": "20251018T063000Z",
  "domain": "manchestereveningnews.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "25 things to do with kids in Manchester this October half term and Halloween 2025\nThere's lots of spooky fun for families over the school break\nOctober half term is almost upon us and you'll no doubt be on the hunt for things to do with the kids.\nWith Halloween at the end of the month, it means there's lots of spooky fun on the cards for families, but whether they like their thrills or not, there's plenty of fun to be had in and around Greater Manchester.\nFrom places to pick pumpkins and a Halloween funfair and fright nights at the Trafford Centre, to bigger than ever immersive experiences including Scare City at the old Camelot theme park and Scarefest at Alton Towers, there's so much happening across the region.\nTo make sure you're always up-to-date with events, you can sign up to our Manchester Family newsletter or join our free Family WhatsApp group HERE.\nHere's our full round-up of things to do in and around Greater Manchester this half term and Halloween...\nAviva Studios\nFamilies are being encouraged to get creative at Aviva Studios this half term as it hosts free creative activities.\nDrop by the Social at Aviva - home to Factory International - for free paper-crafting workshops for families and children inspired by the UK Black History Month theme of ‘Standing Firm in Power and Pride’.\nLed by north west creative studio uptonogood.art, youngsters will be able to celebrate identity and diversity with a collage self-portrait, learn about prominent Black British icons with colouring activities, and join a giant, collaborative mural of key Black trailblazers from history, science, sport and the arts. These run daily from 11am to 3pm between October 28 and 30.\nAlso taking place at the venue, which delivers the world-famous Manchester International Festival (MIF), is a Halloween party taking place on October 31.\nLed by Born To Be Wild Child, families are invited to dance until they drop at the Dreadful Ghouls Disco, watch wacky experiments and magic tricks at the Magic Bubble Show led by Cequin Circus, decorate their own mask or witch or wizard hat, take part in the Trick or Treat ghost hunters trail and take a seat for spooky story time. Fancy dress is highly recommended for children and adults alike.\nTwo slots are available from 11.30am to 1.30pm and 2.30pm to 4.30pm. Visit the website here to book tickets , costing £5 each.\nThe Social, Aviva Studios, Water Street, Manchester, M3 4JQ\nEast Lancashire Railway\nThe famous Halloween Ghost Trains are back at the railway for a 17th year with spooky characters, eerie entertainment, and frightful fun for all the family.\nThis Halloween, monsters will take control over the railway, setting the scene with their petrifying props and daunting decorations, creating the foundations for them to conduct their mischievous behaviours.\nVenture on your quest with Dr Hurtz Von Driver, a legendary Monster Hunter, who will share terrifying tales of his adventures.\nProve your bravery, and you will be allowed to join the monster squad, interacting with the likes of Zombie Bob, Pumpkin Jack the Scarecrow and Count Brian the Vampire.\nThere'll be no taking on the frights with an empty stomach though as ELR will be hosting a Halloween BBQ on your journey, offering 'devilishly delicious treats'.\nELR spooky specials are running from Thursday, October 30 to Saturday, November 1. Tickets cost from £14 and can be booked on the website here.\nEast Lancashire Railway, Bolton Street Station, Bury, BL9 0EY\nDiggle Spooky Trail / Grandpa Greene's\nThe trail is always a popular one with families and sees them following a trail around Diggle Village to collect the letters from the spooky scarecrows to make up a Halloween rhyme.\nTrail sheets cost £3 each and can be collected from a number of places in the village including Grandpa Greene's, The Gate Inn, The Diggle Hotel and Diggle Lock.\nGrandpa Greene's itself is also serving up some spooky treats with a Halloween afternoon tea. It includes sandwiches, cakes, jelly, milkshakes and more and is available from 12pm between October 24 and November 2. Book under 'afternoon tea' on the website here.\nGrandpa Greene's, Ward Lane, Diggle, Saddleworth, Oldham, OL3 5JT\nHalloween at Trafford Centre\nThere's a whole load of spooky fun coming to the Trafford Centre this Halloween.\nFrom spooky crafts to 'hair-raising rides and eerie evening entertainment', there promises to be something for every brave soul.\nBrand new for 2025, ‘Fright Night’ at the fair will bring three evenings of 'pure horror' as creepy characters roam the fairground, creating a truly immersive scare experience for daring teens and adults.\nThe Fright Nights take place from October 30 to November 1 between 7.30pm and 9.30pm and are recommended for over 12s, although younger ones can attend.\nThe usual Halloween Fair is back daily from 2pm to 8pm from Saturday, October 25 to Sunday, November 2, outside The Great Hall. Rides and attractions include Terror Towers, Jumbo Circus, Magic Mouse, Rock Rage and loads more.\nPumpkins and Potions Crafting sessions will be running inside the fair from October 27 to 29 between 4pm and 8pm. These are included in the entry fee to the fair.\nAnd that's not all. The Big Wheel is returning and will be open daily from October 25. And Gandeys Spooktacular is back at the Big Top from October 10 to November 2, with 'death-defying stunts, illusions and a macabre finale that will stalk your dreams'. Tickets cost from £9.99 plus booking fees.\nIf it's indoor you're after for a rainy day then there's lots more on offer inside the Trafford Centre, including the Odeon Cinema, Paradise Island Adventure Golf, Laser Quest and Namco Funscape featuring bowling, more than 100 arcade games, dodgems and more.\nFor more details, see here and visit the Trafford Centre website here.\nThe Trafford Centre, Trafford Park, Trafford, M17 8EH\nManchester Museum\nThe museum attracts visitors of all ages and there's even more reason to visit this autumn.\nThis month, visitors to Manchester Museum will have the chance to see one of the most famous pre-historic beasts up close as part of a new exhibition.\nManchester Museum’s 'Triceratops: Eat, Roam, Repeat', opens this October, and will bring visitors face-to-face with a magnificent, fossilised Triceratops skull, as part of a fun, family-friendly experience. It will also reveal how this three-horned giant lived, what it ate and how it survived battles with predators like the mighty T-Rex.\nFree to enter, Triceratops: Eat, Roam, Repeat will opens on Saturday, October 25 and will run until February 2026.\nOf course visitors will also delight at seeing Stan the T-Rex, the museum's resident dinosaur, and checking out the Vivarium, a collection of live amphibians and reptiles, including many critically endangered species. The museum is completely free to visit and there’s a cafe too.\nHalloween in the City / Scare Skate\nFrom spooky ice skating to a Monster Party Procession, there's all kinds of fun planned at the annual Halloween in the City event.\nManchester's huge ice rink is back open in the city centre running as Scare Skate for half term and Halloween and offering off-peak prices throughout.\nAs well as a new turbine operating this year's rink, with a giant snow globe attached to it, there's another new addition in the form of a 'Skate on and Skate off Caffè Nero Pit Stop’, available during skating for those needing a break and a hot chocolate or mulled wine.\nTickets cost from £17.50 (off peak + booking fee) for adults and teens, and from £13.75 (off peak + booking fee) for children (aged between 3 and 12 years old). Family tickets from £52 (based on two adults and two children, or one adult and three children, off peak + booking fee).\nThe rink forms part of the wider Halloween in the City event which sees the place come alive with a host of ghosts and ghouls who will parade through the streets, host parties and events and take over the rooftops of some of Manchester's most iconic buildings and landmarks.\nBeginning on October 25, it will feature a host of free, family-friendly events and trails and will include a Carnival of Monsters and the ever-popular Monster Party Procession, across the weekend of October 25 and 26.\nThe MCR Monsters crawl will also mark a big return, with 17 giant inflatable creatures taking over the city between October 25 and 31. New arrivals on the trail will include Rocky Boo-Boa, Spooky Spice, Bruce Springscream, whilst favourites Ooey, Gooey and Scary Gary will be amongst those returning.\nThere will be a host of new celebrations joining the festivities this year, including a Monster Fashion Week and The Monster Library, taking up residency at the Arndale. Z Arts will host a new interactive, family-friendly performance called The Legend of the MCR Monsters which features myths and monster magic.\nSee our full guide to the event here, or visit the Halloween in the City website.\nDino Falls Adventure Golf\nIf you're looking for some Halloween fun without the frights then there's even more reason to head along to Dino Falls this half term as kids in costume play for free.\nAny child in fancy dress who's accompanied by a full paying adult can join in the fun without spending a penny as part of the offer which runs from October 27 to 31.\nIt’s a family-friendly, scare-free way to celebrate Halloween, surrounded by life-sized dinosaurs, cascading waterfalls and erupting volcanoes. With free parking and an on-site Clubhouse Bar and Kitchen serving food and drinks, it’s billed as 'the perfect half-term day out'. No booking required, just turn up and play.\nDino Falls Adventure Golf, Old Park Lane, Trafford Park, M17 8PG\nKnowsley Safari\nThere's another special offer running at Knowsley Safari this half term too as kids go half price.\nKnowsley Safari’s Foot Safari will be transformed into a 'spooktacular adventure' between October 25 and November 2, with ghoulish activities included in the regular admission price.\nDesigned for children between the ages of four and 10, between 11am and 4pm each day, families can learn frightful facts about conservation by immersing themselves in Halloween-themed activities.\nThere promises to be squeals aplenty as children come face-to-face with real-life characters, including the Poo Keeper, who’ll reveal hidden surprises while digging in Poo Boxes, while educating how animal poo helps protect endangered species.\nA Marine Boo-ologist, will uncover how pollution affects marine life; and if younger family members dare to step foot into the Safari Chef’s grimy kitchen their senses will be tested to the max with a Smell Box Challenge, complete with rotten food scraps, while learning how their diet keeps creatures thriving in the wild.\nPlus, a spooky Tipi Shack will be home to eccentric lost explorer, the Dread-venturer, who will be leading a ghoulish quest, taking families behind the scenes of Knowsley Safari’s global conservation work.\nThe Safari park is home to more than 500 animals including Amur tigers, meerkats, giraffes and Bushdogs, as well as one of the UK’s largest rhino crashes, African lions, Bactrian camels, ostrich and Iberian wolves on the five mile long Safari Drive.\nGuests can also get into the spooky spirit by enjoying the amusement rides and attractions, while refreshments will be available in Oasis Restaurant and the Outpost Kitchen.\nChildren aged 3 to 15 go half price with a full paying adult when booking online in advance for visits between October 25 and November 2. One child goes half price per full paying adult.\nKnowsley Safari, Prescot, L34 4AN\nHalloween at Quarry Bank\nThe historic Quarry Bank Mill on the outskirts of Greater Manchester is being transformed into an immersive light trail for Halloween - featuring a host of spooky surprises.\nThe grounds of the Grade II-listed mill, now owned by the National Trust, will be turned into a spine-tingling illuminated trail, with a range of projections, fire shows, and creepy experiences for people of all ages to explore, including nods back to the site’s historical roots.\nRunning from October 23 to November 1, the Cheshire mill’s trail will include 3.5m tall giant skeletons, a field of 50 gravestones, a Headless Horseman riding along the trail, and giant spider webs.\nInside the mill building itself, the sinister Georgian Mill Owner will await those who dare to venture. The mill’s water-wheel, which spans 32 feet in diameter, will also feature bones and skeletons with red mist rising from below.\nThere will also be 10 life-size spirits drifting through the grounds, as well as a pumpkin garden and a Carnivorous Garden to explore. Not only that, but a series of spooky projections will be beamed across the old mill’s walls.\nIn addition, the Headless Horseman will roam around the grounds but will also be joined this year along the way by a mysterious lady who perhaps has something to share with visitors. There will also be dazzling fire performances from Let’s Circus at the Fire Gardener’s Ritual.\nThe whole experience will be set amongst an ‘eerie’ immersive experience of flickering lights, glowing embers, and strange sounds, including around 50 demon eyes, glowing from deep within the forest.\nTickets for the experience are now on sale and start from £10 for a child. The experience has been described as suitable for all ages, with a range of daylight, twilight and moonlight sessions available.\nThere will be 'Fiendish Feasts & Spooky Sips' on offer, with burgers, fries, ‘vampire’ dogs, hot toddies and hot chocolate available to order. There will also be the opportunity to toast marshmallows.\nTickets, which are now on sale here, range from £10 to £14 for children and £15-18 for adults.\nQuarry Bank, Styal, Wilmslow, Cheshire, SK9 4HP\nScience and Industry Museum\nThe Science and Industry Museum is always a popular day out with families and will be attracting more crowds now that its iconic Power Hall has reopened.\nVisitors are once again able to explore the working steam engines, some of which are running for the first time in almost a decade.\nBut there's lots more to see and do at the museum, including the chance to see the blockbuster exhibition Operation Ouch! Brains, Bogies and You, which is running until January 4, 2026.\nA second collaboration with the hit BBC show, it features the show's presenters Dr Xand and Dr Ronx as virtual guides for visitors, who get to become tiny brain explorers - setting out to investigate Dr Chris’ senses before being sneezed out of his giant nose.\nFrom poking around inside a giant eyeball and journeying through an ear canal covered in gooey wax, to being sneezed out through sticky snot, there's nothing kids won't love about the new exhibition.\nMini medics are invited to explore their own brilliant brains by banging on an eardrum, venturing into a massive eyeball and even taking a whiff of a 'smell library' during what promises to be 'a lively, interactive and playful adventure'.\nTickets are priced at £10, with children three and under going free. To find out more and book your tickets, visit the website here.\nVisitors can also explore five decades of play with a ticket to the popular Power Up 'ultimate gaming experience', where they can discover how far computer games have come. From retro favourites like Pac-Man and Street Fighter to virtual reality, there’s something for all the family with over a hundred consoles to explore.\nAnnual passes are now available to purchase, meaning visitors can unlock a new level of play and gain access to the experience for a whole year.\nFor more details, visit the website here.\nScience and Industry Museum, Liverpool Road, Manchester, M3 4JP\nZip World Heaton Park\nThe Heaton Park of Horrors Halloween event is back this half term with a horde of goofy ghouls unleashed upon the Treetop Nets.\nTaking place daily from 10am to 4pm between October 25 and 31, kids aged 3 to 16, and their families can challenge themselves to leap, dodge and explore the bouncy nets, suspended high in the trees.\nDevious demons will be lurking around every corner of the nets and the challenge for little ones is to follow a scavenger hunt without being caught. Climb through the vast netted walkways, slip out of sight down a slide or hideaway in a secret corner.\nThose successful in their quest to beat the demons and collect the hidden bats will receive chocolates and sweets as a prize.\nCosting £10 per person, the experience is suitable for children aged three to 16. Under fives must be accompanied by an adult, however, children aged five plus can explore alone with families welcome to spectate free of charge.\nFor more details and to book, visit the website here.\nZip World, Heaton Park, St Margaret's Road, Manchester, M25 2GT\nThe Smeds and The Smoos, Lowry\nTall Stories’ Olivier Award-nominated space adventure The Smeds and The Smoos lands at Salford’s Lowry this October half term.\nRunning from Monday 27 October to Saturday 1 November.\nRecreating the story of two rival groups of aliens living on a far-off planet, it features cute and hilarious aliens, a rocket chase across distant planets, and the imaginative magic of puppetry and song.\nhe show is directed by Toby Mitchell and produced by the multi–Olivier Award-nominated company behind ‘The Gruffalo’, ‘The Gruffalo’s Child’ and ‘Room on the Broom’ and is running from October 27 to November 1.\nAdapted from the award-winning book by Julia Donaldson and Axel Scheffler, this joyful intergalactic tale promises fun for the whole family. The last remaining tickets are available now from the website here.\nLowry, Pier 8, The Quays, Salford, M50 3AZ\nAdventures in Wonderland, Z-arts\nAnother scare-free event for the little ones is the Adventures in Wonderland experience which is running at Z-arts over half term.\nCreated in partnership with Macmillan Children’s Books, the immersive play experience celebrates the 160th anniversary of one of the most loved children’s books of all time, Alice’s Adventures in Wonderland.\nStepping into the shoes of Alice, children will find things in Wonderland become 'curiouser and curiouser'. Greeting you as your storyteller is the White Rabbit, and from the shape shifting Cheshire Cat to a game of croquet with flamingos, there are scenes that will be familiar, including the chance to take your place at the Mad Hatter’s tea party.\nTunnels to crawl through, mazes to get lost in, fairground mirrors to amuse and a ball pool to 'splash' into, plus interactive games and sensory areas, all 'bring Lewis Carroll’s fantastical world to life'.\nThe Z-arts’ café, Butties and Books, also serves up tea party themed food and of course jam tarts.\nTickets cost £12 (plus 60p booking fee), with a family ticket for four priced at £40 (plus £2.40 booking fee). Book on the website here.\nZ-arts, 335 Stretford Road, Hulme, M15 5ZA\nInflata Nation\nThe Inflata Nation bounce park is also running a special offer across half term offering 15% ticket prices throughout October.\nLast year the indoor inflatable park underwent a makeover to add brand new features and a huge new ball pit with more than 400,000 balls.\nAs well as the supersize ball pit, it features other new attractions including new spiralling slides, climbing walls, games and obstacle courses. The dedicated under fours area also had a refurb for younger children to enjoy.\nTickets cost £14.99 for anyone four and above and £7.99 for under fours. Book on the website here using the code SPOOKYMANC to get the discount.\nInflata Nation Manchester, Textilose Road, Trafford Park, M17 1WA\nChaos Karts\nIf you fancy a little Mario action this half term then the UK's first live action video game karting experience is right here in Manchester.\nInside the Arcade Arena next to the Science and Industry Museum, Chaos Karts combines real-life racing with augmented reality and makes it feel as if you're inside a game of Mario Kart.\nEach player has their own kart and, just like Mario, you get to pick your own avatar and even the colour of your vehicle. The players are real, the karts are real and the racing experience is real - you whizz around an actual track. But the track changes each time, as it's projected onto the floor along with the rest of the landscape that surrounds you.\nYou use the buttons on your dashboard to fire forwards or backwards, dodging virtual obstacles like splattered eggs as you go.\nDrivers have to be a minimum age of 11 and be at least 5ft tall (1.5m) to take part. Chaos Karts tickets cost £26.50 and can be booked online on the website. Guests who aren't playing can book a free companion ticket online.\nArcade Arena, Lower Byrom Street, Manchester, M3 4FP\nPac-Man Live Experience\nAlso inside the Arcade Arena is the new Pac-Man Live Experience, which opened at the site earlier this year using the entire floor space that hosts those Mario tracks.\nThis interactive, immersive experience lets you take on the identity of Pac-Man himself and again drops you into a real-life video game where you are chased by ghosts.\nYou have your very own 'Pac Master' to oversee proceedings and tell you what game is coming next - reminding those whose vest becomes a ghost to take a breather as players take it in turns to take short breaks from the action.\nTwo separate teams of eight play separately on either side of the room and the goal is to beat your opponents by running around and collecting power pellets and fruit while desperately trying to avoid those pesky ghosts, Blinky, Pinky, Inky and Clyde.\nPac-Man Live is suitable for anyone aged eight and above. It is a physical experience so you are on your feet for the duration.\nTickets start from £22 each, with a discount applied for family bookings. Tickets can be booked here.\nArcade Arena, Lower Byrom Street, Manchester, M3 4FP\nOxygen Activeplay, MediaCity\nA massive new trampoline play park Oxygen Activeplay opened in February and has a special offer running this half term.\nFor £30, families can get a Half Term Holiday Pass giving access to five 60-minute play sessions.\nTaking over the former I'm a Celebrity Jungle Challenge site inside Quayside, formerly Lowry Outlet, at Salford Quays, the state-of-the-art venue features 24 trampolines, a mega-air bag jump, a high ropes course, a Sky Rider aerial ride, an interactive strike arena and more.\nOxygen’s Monster Mash Bash also takes place on Friday, October 24. Running from 6pm to 8pm, little ones can enjoy 'an evening of boo-gying, jumping and partying under the disco lights to wicked tunes'. Fancy dress is encouraged and tickets to the Bash cost £21 per person.\nStandard tickets cost £14.50 for an hour's Open Play session, or £45 for a family of four. A 60-minute Open Play and High Ropes ticket costs £17.50, with Sky Rider an extra £3. Open Play is for ages four and above and children must be 135cm tall to use the high ropes.\nSee the website to book.\nOxygen Activeplay, Quayside, MediaCity, Salford, M50 3AH\nMuseum of Illusions\nThe Museum of Illusions in Manchester city centre is the first in the UK and things are getting a little spooky there this Halloween.\nBilled as 'one of the world's most Instagrammable museums', exhibits range from holograms and optical tricks to full-scale illusion rooms and playful mirror displays.\nFrom October 16 to November 2, the museum is transforming into a world of Weird Wonders - think moons, pumpkins, bats, spiders and webs, all adding a spooky (but not scary) twist to Manchester’s most mind-bending experience.\nVisitors can find their clones in tricky mirrors, swap faces with a friend, split themselves in two or even serve their head on a platter - all surrounded by over 60 weird and wonderful illusions designed to baffle the brain and fill the camera roll.\nYou can take as long as you like inside the science-meets-entertainment attraction, but it typically lasts around an hour. Tickets, costing from £19.50, can be booked on the website here.\nMuseum of Illusions, 58-66 Market St, Manchester, M1 1PW\nArchie's Atomic\nThe North West’s biggest pink roller rink is inside Trafford Palazzo and offering cheaper tickets this half term.\nWelcoming skaters aged six plus of all abilities, Archie’s Atomic, with the brand's signature hot pink branding, features a retro-inspired rink with a huge spinning disco ball.\nIt's also home to the Arena gaming vault - an immersive, all-in-one activity featuring eight interactive games for up to eight players at a time. And there's a state-of-the-art amusement arcade featuring SEGA games, basketball hoops, all the classics and more.\nOnce you've worked up an appetite, you can grab a bite to eat at Archie’s diner, with all the burgers, shakes and treats the viral brand is known for. It's recently undergone its biggest menu shake-up in 15 years, introducing a number of new items and refreshed favourites.\nOpen seven days a week, from 10am to 10pm, tickets can be booked on the website using the discount code LETSPLAY25 at checkout to redeem 25% off. During peak times sessions start from £15 for a one-hour session, with party packages available from £25 per person for children and £30 for adults.\nArchie's Atomic, Trafford Palazzo, Barton Dock Road, M17 8AS\nLegoland Discovery Centre\nLego fans will delight in a trip to Legoland Discovery Centre Manchester which is hosting a Brick or Treat Monster Party event across half term.\nActivities include the chance for kids to build their own Lego pumpkin, take part in a scavenger hunt, brew their own Lego potion, join the Halloween dance party and much more.\nCharacter mascots Scarecrow and Lord Vampyre will be there to meet and greet and families can watch the Lego 4D movie The Great Monster Chase.\nThe Brick or Treat Monster Party is running on weekends and during half term from now until November 2. For tickets, costing from £16, visit the website.\nLegoland Discovery Centre Manchester, Trafford Palazzo, Barton Dock Road, M17 8AS\nSea Life Manchester\nAnother attraction inside Trafford Palazzo is Sea Life Manchester, which is hosting its own event over the school break.\nAscarium: Tricks & Treats invites families to follow an immersive trail to help them keep sea creatures safe and look after the ocean. Complete the ‘spook-splash-tastic’ challenges to join the army of Sea Defenders.\nYoungsters can meet a witch or a warlock, visit the pumpkin patch and enjoy a host of other activities.\nThe event runs from now until November 2. Tickets, costing from £12.50, can be booked on the website here.\nImperial War Museum North\nFree family activities are always on offer at IWMN including Story Seekers trail which runs daily throughout the school holidays.\nExplore the collection and discover compelling real-life stories with your family.\nCrack the Code also runs on weekends from now until November 23, where visitors can collect a trail sheet and help Second World War veteran Bernard to ‘crack the code’ as he makes his way home after the end of the Second World War. Discover stories and objects covering historical moments, from VE Day, VJ Day, and rationing, which continued to be part of life well after wartime.\nFind out more about what's happening on the website here.\nNational Football Museum\nFootball fever is always going strong in Manchester and where better to celebrate than at the National Football Museum.\nThere are loads of activities on offer, with the Pitch Gallery providing the opportunity to have your photo taken with a collection of football silverware, including official replicas of the Premier League and Women’s Super League trophies.\nAlongside George Best’s Mini Cooper, this space also hosts a programme of special exhibitions and workshops.\nElsewhere the Play Gallery features interactive games including a Penalty Shootout and a new ultimate Premier League Player VR Experience with Rezzil, allowing you to 'walk out at Premier League stadiums', 'recreate the league's biggest goals', 'feel the speed, pressure, and excitement of real Premier League moments' and a whole lot more.\nThen there's the Score Gallery, dedicated to the museum's programme of special exhibitions, the current one being From Pitch to Page: The Magic of Football Annuals.\nAdmission is free to Manchester residents (who pay council tax to Manchester City Council). For others it's cheapest to buy online, with annual tickets costing £15 for adults and £9 for children aged 5 to 15. Under fives go free. For more details, visit the website here.\nPeople's History Museum\nThe People's History Museum has a range of exhibitions and activities on offer for children of all ages.\nYoungsters can join in free mini yarn bomb sessions this half term where they can have a go at weaving a simple knit to attach to a picture of an object commonly found to be yarn bombed, maybe a post-box, bench or tree trunk.\nThe activity is suitable for ages five to 12, and runs from 10am to 5pm from October 25 to November 2.\nIn Gallery One and Two, visitors can also explore the development of democracy in Britain: past, present, and future.\nFrom the Peterloo Massacre of 1819 in Manchester to the present day, meet the revolutionaries, reformers, workers, voters, and citizens who came together to champion ideas worth fighting for.\nThere's also the Banner Exhibition, featuring 26 banners chosen from the largest collection of political and trade union banners in the world.\nDuring their visit kids can play Banner Bingo, looking out for different images throughout the exhibition. They have two versions of the bingo, one more challenging than the other, so it’s suitable for different ages. Afterwards they can collect a small prize for taking part.\nVisit the website for more details.\nJodrell Bank\nThere's all sorts of half term fun for families at Jodrell Bank, home to the Lovell Telescope.\nYoung space adventurers can explore the wonders and perils of the stars in The Great Solar System Adventure, a hair-raising Dome Show which can be added to your visit at point of booking. It runs 11am and 3pm at weekends and daily in the school holidays.\nWith 'out-of-this-world exhibitions', a playground and four pavilions packed with fun, there promises to be 'something for astronauts of all ages'. To find out more, visit the website here.",
  "word_count": 5041,
  "scraped_at": "2026-02-14T12:44:19.771649"
}