{
  "article_id": "016cd6982187",
  "url": "https://index.hu/kulfold/2024/12/12/we-might-die-tonight-but-we-re-ok-until-then-jew-hunting-on-the-streets-of-amsterdam/",
  "title": "Index - Külföld - We Might Die Tonight , But Were OK Until Then – Jew - Hunting on the Streets of Amsterdam",
  "date": "20241212T071500Z",
  "domain": "index.hu",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "- Külföld\n- amszterdam\n- ajax amsterdam\n- maccabi tel-aviv\n- thijs koster\n- uefa\n- binyomin jacobs\n- david beesema\n- geert wilders\n- femke halsema\n- dick schoof\nWe Might Die Tonight, But We're OK Until Then – Jew-Hunting on the Streets of Amsterdam\nTovábbi Külföld cikkek\n- Donald Tusk lengyel kormányfővel tárgyalt Magyar Péter és Orbán Anita\n- Donald Trump tovább növeli a katonai jelenlétet a Közel-Keleten, a világ legnagyobb repülőgép-hordozóját veti be\n- Volodimir Zelenszkij elmondta, mi a legnagyobb kompromisszum, amit Ukrajna a tárgyalásokon köthet\n- Rendőrre támadt egy késelő a párizsi Diadalív alatt\n- Emmanuel Macron Münchenben hirdette meg Európa új jövőjét, ez aligha tetszik mindenkinek\nAn unforgettable Bar Mitzvah gift – this is what Ziv Bar On had in mind when he bought the plane tickets to Amsterdam. The Tel Aviv lawyer had never traveled abroad with both of his teenage children, but he had long wanted to show them his favorite European city, Amsterdam.\nHis 13-year-old son had recently had his Bar Mitzvah, which, according to Jewish tradition, marks the boy's coming of age, and since he and his sister are Maccabi Tel Aviv fans, Ziv decided to combine the trip with a few days of sightseeing. It was their first trip abroad since the October 7 Hamas attack, and he was definitely being more cautious.\nOn Monday, November 4, their plane landed, and they immediately dove into sightseeing: the Anne Frank Museum, local sweets, and they also found time to visit Zaanse Schans, an open-air museum 15 km from Amsterdam that evokes the Dutch countryside. Windmills, giant clogs, and plenty of syrupy waffles (stroopwafels).\nOn Thursday, the 13 and 15-year-olds eagerly watched the lively Ajax-Maccabi game, which ended badly for the Israelis: they lost 5-0 to the Dutch star team. After the match, Ziv and his family took the tram home, without any Maccabi or Israeli markings.\n\"We Might Die Tonight, But We're OK Until Then\"\nAs soon as we got off in the center, it felt like we had stepped into a war zone: yelling, bomb-like explosions, which later turned out to be firecrackers. I told the kids to stay close to me, we’re going straight to the hotel, and we’ll separate from the Israelis. But we couldn't really go anywhere else because those ahead of us stopped: Muslim men were standing on the opposite sidewalk, shouting 'Free Palestine' and various chants in Arabic,\nZiv recalls.\nThe Israelis were around 16-18 people, while the other side had 30-40. A police car braked and stopped between the two groups, and four officers jumped out. A firecracker exploded on the Israeli side. The police officer shouted at them to run to the KFC between the Central Station and Dam Square, and after a brief stay inside, they were told to head towards Dam Square. There, more Muslims were waiting for them, so Ziv ran to one of the police officers: “I’m with two children, please help us get to our hotel.”\n“My daughter couldn’t stop crying, and my son looked at everything with a pale, ashen face.”\nThe tense police officers escorted them to the nearest hotel, but not to their own. There was no room, so they sat in the lobby with many windows facing the street. Ziv asked the children to lie down on the couch so they wouldn't be visible from the outside. He himself didn't sit down for a single moment that night. “We were in a foreign country, and I didn’t know exactly what was going on or how many were hunting us. Over the course of the evening, I begged at least 15 police officers to take me and my children to our hotel, or even to a police station, just to be safe with my kids. None of them helped, but eventually, through WhatsApp, an Israeli boy who lived there evacuated us to our hotel.”\nAt 4:20 AM, they lay down behind a carefully locked door.\nBack in Israel, weeks later, Ziv visited a psychologist because even small things trigger the Amsterdam trauma in him: he reacts differently to smells and sounds. Until then, he walked calmly to the shelter when the siren went off, but now he has a racing heart.\nThe kids, he says, are doing well, though they are not very talkative. During the events, someone from Israel messaged his son to check how they were. The 13-year-old boy replied: “We Might Die Tonight, But We're OK Until Then.”\nA Standoff Outside the Holland Casino\nIsraeli matches are classified as high-risk, so the organizing body, UEFA, provides increased security, with a dedicated security person in contact with local authorities. The Israelis brought ten security personnel with them.\nWeeks before the match, organizers carefully assess whether there is a potential for clashes between the fan groups. From this perspective, the organizers could have been calm as Ajax is traditionally considered a Jewish team, despite the fact that it currently has no Jewish players and was not founded as a Jewish club. Its fans maintain a good relationship with Maccabi Tel-Aviv.\nOn the day of the match, a technical-organizational meeting was held at 10:30 AM. During this meeting, the local police informed those present that they were aware of the previous night's altercation in front of the Holland Casino, which occurred after the Israelis removed a Palestinian flag from a building, prompting Muslim taxi drivers to line up in front of the casino in response. The next day, the casino fired the security guard who had promised in a social media group to notify the taxi drivers if the Israelis returned.\nBefore the match, a group of nearly fifty Israeli supporters chanted, \"May the IDF win\" and \"F*** the Arabs!\" One of them even set a Palestinian flag on fire.\nAccording to the 12-page report released by the City of Amsterdam the next day, a group of Israelis also attacked a taxi (most taxi drivers in Amsterdam belong to the Muslim minority). The report specifically names the attackers of the Israelis as being Moroccan.\nMoreover, the incident was mentioned in the pre-match technical meeting, and the police chief assured the Israelis that a significant police presence, around 400 officers, would maintain order in the evening.\n“That’s Gaza, Motherf***er!”\nThere were no issues around the stadium, but hell broke loose in the city: as the Israelis returned, men in small groups on scooters, in cars, or on foot attacked them, chased them, or beat them. Some had their teeth knocked out, others were kicked on the ground until they lost consciousness.\nAccording to the Amsterdam city report, the organizing against the Israelis had started earlier: on social media, in closed groups, people were called to join a \"jodenjacht,\" or \"Jew hunt,\" and messages like \"Tomorrow after the match, the 3rd round of the Jewish hunt\" and \"kankerhond\" (cancer dog) were posted, referring to the Israelis. Numerous videos show people being kicked while attackers shout at them: \"Say 'Free Palestine!' and we’ll let you go.\"\nIn another video, an Israeli is seen being knocked down, and as they try to flee, the attacker filming them shouts, \"Now you know what this is like. This is Gaza. This is Palestine. This is Gaza, motherfucker!\"\nMoroccan individuals are seen “checking” people on the street, searching for those with Israeli passports. Some Israelis go missing, leading to rumors about their abductions (it later emerges that some escaped from their pursuers by jumping into a canal, while others left their phones behind as they fled). One Israeli fleeing into a canal is filmed by the attackers. Dozens of Israelis are taken to the hospital with injuries, some more serious, but most with minor wounds.\nThroughout the night, the mayor holds several meetings with government members, the Israeli ambassador, and in the morning with Jewish organizations. The next day, the police arrest 49 Dutch citizens and ten Israelis, the latter mainly for using fireworks.\nAt a press conference the following day, Mayor Femke Halsema states that she understands the events remind many of the pogroms. High-level politics are also triggered: the Israeli Prime Minister compares the events to Kristallnacht, Dutch Prime Minister Dick Schoof shares that the actions are linked to young people with immigrant backgrounds, discussing integration problems, while Geert Wilders, leader of the PVV, suggests that the \"multicultural trash\" who attacked the Israelis should be arrested, calling it a disgrace that this could happen in the Netherlands.\nOn social media, \"Muslim-bashing\" begins, while many members of the Moroccan community express their displeasure at being stigmatized as a whole. Later, the mayor of Amsterdam regrets using the term \"pogrom,\" stating she didn’t want politicians to use the Amsterdam events for their own purposes.\nIn an almost unprecedented move in the history of Dutch justice, the first seven people involved in the persecution of Jews are brought to court by mid-December, with one facing the most severe charge of attempted murder. Six more individuals, including three minors, will later stand trial.\nPogrom or not a pogrom?\nChief Rabbi of the Netherlands, Binyomin Jacobs isn't a huge football fan, but he had other duties on the evening of November 7th: he was at the Portuguese Synagogue commemorating Kristallnacht, the night in 1938 when Nazis in Germany killed dozens of Jews, destroyed synagogues and businesses, while police stood by and did nothing.\nHis grandson, however, went to watch the match.\nThe Chief Rabbi was awakened around midnight by a phone call: a pogrom against Jews was happening in the city, people were being abducted, and he needed to call his government contacts immediately to deploy the military to Amsterdam. The Chief Rabbi spent the night on the phone trying to piece together what was true, but information was scarce.\nIn hindsight, he agrees with the mayor that calling it a pogrom is an exaggeration.\nAs Jews, we must be especially careful with our words: what happened was an unacceptable antisemitic attack, but it wasn’t a pogrom. A pogrom is state-organized, or, for instance—as during World War II—when a bishop calls on the faithful to enter the ghetto and loot Jewish property. What happened here was unacceptable, outrageous, and antisemitic, but not a pogrom,\nhe told Index.\nHowever, the Rabbi noted that antisemitism in the Netherlands did not start now, nor on October 7, 2023. “Since the Hamas attack, it’s become an everyday occurrence for kids to run past me shouting ‘Free Palestine!’ or ‘yahud,’ which means Jew in Arabic. This has been happening for years; it’s just becoming more intense now. Police have advised me for many years to be cautious using public transportation while wearing visibly Jewish attire. My house windows have been smashed with stones multiple times. October 7 was just a wake-up call.”\nSince the events in Amsterdam in November, some have approached the Rabbi saying they’ve packed a suitcase, just in case they need to leave for Israel. His response: “There’s no need to panic. If you want to go to Israel, go for Israel, but don’t flee.”\n“It leads nowhere if we talk about antisemitism only in the context of Muslims. The people who killed my family during World War II were not Muslims. Neither were the police back then or those who stole my family’s property. Of course, much time has passed since then. After October 7, I was deeply touched that many Christians and atheists stopped me in the street, saying to let them know if we needed help. The Dutch people stand with us.”\nIf you're wearing a hijab, smile!\nAmal (name changed) only half-heard the morning news from the bathroom the morning after the match. What have we Moroccans done wrong this time? she wondered with a sinking feeling.\nAmal has lived in Amsterdam for 39 years; she was born there. Her parents arrived in the Netherlands in the 1960s. She studied sociology and social work at university and now works as a social worker. She says it’s hard, as a member of a discriminated minority, not to take it personally when people criticize Moroccans.\n“Many people said after the incident that they didn’t understand our oversensitivity—after all, no football fan takes the ultras’ rampages personally. But discrimination against Muslims is a daily reality; we feel it in our skin. By the next morning, it had already started in politics: it was Moroccan perpetrators. Meanwhile, the whole thing was started by the Israelis. Muscular football ultras, many of them IDF soldiers, on one side; Moroccan young boys on the other(Editors note: the first cases brought to justice are men between 19-32) ”\nAmal wore a hijab for years. “I always had a forced smile on my face when walking down the street or getting on a bus: Yes, I’m a devout Muslim, but you don’t have to fear me. I was overcompensating a bit.”\nA few years ago, Amal prayed at the Al-Aqsa Mosque in Jerusalem and then visited a refugee camp in the West Bank. That trip changed her life. She saw poverty, hopelessness, suffering—hundreds of children who had dropped out of the educational system and had no future. Afterward, she began advocating for the Palestinian cause and now raises money for children there. “I can’t put into words how much it hurts me to see what’s happening in the Middle East—to the children, women, the elderly, and even the men. Just thinking about it makes me cry.”\nFor over a decade, Amal has been promoting the importance of intercultural dialogue and has even worked with Jewish organizations. But she has grown increasingly disheartened since Dutch politics, in her view, shifted to the far right.\n“Three out of four Dutch people are racist. Changing that is beyond me, and honestly, I’m starting to check out from trying to improve society. My generation sees itself as Dutch-Moroccan, but younger people increasingly identify solely as Moroccan—even though many don’t speak the language or know much about the culture. But feeling Moroccan is central to their identity.\nAmsterdam is a city with a rich Jewish cultural heritage, but it’s increasingly becoming a Muslim city too.”\nHamas, Hamas, All Jews to the Gas!\nDavid Beesema, the president of Maccabi Nederland and Maccabi Europe (organizations that are only nominally connected to Maccabi Tel Aviv), was immediately informed about the attacks. He quickly mobilized their network of hundreds of volunteers and launched a rescue operation: they began locating Israelis, set up shelters in two locations, escorted injured people to medical care, and transported them. Understandably, none of the Israelis dared to call a taxi, as doing so would require sharing their phone numbers.\n“This hunt for Jews was planned weeks in advance. The other side has a strong interest in portraying the attacks against Israelis as proportionate, claiming that the Israelis provoked them. However, the fact that so far charges have only been filed against one side shows that the attitudes of the two groups are not comparable,” Beesema told Index.\nAccording to him, some Israelis behaved disgustingly and sang vile chants (“There are no schools in Gaza because all the children are dead”), and he also believes that only idiots burn flags.\nSo we’re not talking about boy scouts here. Crude language, unfortunately, is common in football. We’ve also become somewhat desensitized when we hear chants like ‘Hamas, Hamas, all Jews to the gas.’ But most of those attacked were not ultras. When we opened our shelter early Friday morning, many elderly people, women, men with children, and of course young men who had been badly beaten came in.\nDavid, who is a lawyer, dislikes semantic debates about whether the incident qualifies as a pogrom. “Legally, of course, it wasn’t, but the underlying mindset makes it quite similar. Even if the Maccabi fans had behaved properly, the hunt for Jews would still have taken place.”\nDavid argues that anti-Semitism and Islamophobia cannot be compared.\nIf you wear a hijab in Amsterdam, you can feel safe: no one will insult you, no one will spit on you. Especially not a Jew. But if you walk around with a yarmulke on your head, you’ll get shouted at or spat on within minutes. People are increasingly voting for right-wing and far-right parties because they’re tired of the narrative that everything is fine. Of course, this is all very sad for Muslims who have nothing to do with these events. But we cannot close our eyes to the fact that anti-Semitism is indeed a problem in a portion of the Muslim community.\nI am Jewish, and I will listen to your pains\nOn Friday morning at ten o’clock, the mayor of Amsterdam convened the city’s Jewish community. Nearly 400 people attended, but the hall was too small to accommodate everyone, and many were pacing outside. The atmosphere was thick with nervousness, anger, and fear. It was here that Mayor Halseema remarked that she understood if someone might associate the situation with memories of pogroms.\nJaïr Stranders (46), a board member of the Jewish Community, attended the meeting and even asked one of the mayor’s colleagues for clarification: “Did I hear correctly, pogrom?”\nThere is massive polarization in society, and there are two clear losers in this: the Jewish community, which has long suffered from antisemitism and now faces the additional challenge of being equated with Israel since October 7. The other losing group is the Muslim community, especially Dutch Moroccans, who feel like second-class citizens—and politics reinforces this perception. These two groups are now being pitted against each other: the Jews are the stick used to beat the Muslims. This is evident now, too, as the Prime Minister immediately turned the issue of antisemitism against Muslims.\nJaïr condemns all violence but says he understands young Moroccans who strongly identify with the Palestinian cause. “They are angry, frustrated, because they see images of dead children on their social media feeds day and night. And they don’t understand why our government supports Israel.”\nJaïr, whose wife is half Moroccan, has been invited to a mosque and several Muslim communities in recent weeks to engage in dialogue. “I said: I’m Jewish, and I will listen to your pains. And I want to share what fears we, as Jews, have. How October 7 casts a shadow over the lives of European Jews.”\nHe himself is not overly worried about antisemitism but does not wear a kippah or send his children to Jewish schools. “There’s no guarantee that if a Dutch rabbi friend of mine had been walking there at night, he wouldn’t have been harmed.”\nJaïr, however, places his faith in dialogue and mutual understanding, values he learned at home. Three of his four grandparents were Jewish, and one was Christian, the latter having hidden family members and helped others during the war, even while a Nazi officer lived in his home. After the war, when women accused of fraternizing with Nazi officers had their heads shaved as punishment, Jaïr’s grandfather intervened and prevented several such incidents. “I was raised with these humanist values: always see the person first. That’s what will resolve today’s conflicts, too.”\n19:40\nThijs Koster (39) is a hospitality entrepreneur and policy advisor for the City of Amsterdam. Following recent events, he initiated Dialogue Tables, inviting colleagues to openly discuss what’s happening around them.\nIt’s important to find words for what surrounds us, to express our fears, especially since we spend a third of our time at work. As a Jew, I want people to understand that there’s a difference between the Israeli government and the Jewish community in the Netherlands. It bothers me that whatever happens in Israel is held against Jews worldwide. On the other hand, if someone disagrees with Israeli policies, they shouldn’t automatically be labeled as antisemitic.\nThijs, who was born and raised Jewish in Amsterdam, says the Holocaust is ingrained in his DNA. “And in a very practical way: when I glance at the clock between 19:40 and 19:45 in the evening, I find myself transported back to 1940–1945.”\nThis is why the day after the attack in Amsterdam was extremely difficult for him and many of his Jewish acquaintances: their parents’ generation was frightened, while his own was completely confused.\nIt was sickening to see people being beaten up simply because they were Israeli. And at first, it wasn’t clear—were they specifically targeting Israeli Jews or Jews in general? I couldn’t understand who was being hunted. Was I being hunted too? But as more facts emerged and the municipality released its report, the picture became clearer. They were looking for Israelis—this was evident, for example, from their requests for passports, as there’s no such thing as a ‘Jewish passport anymore.\nLike many other Dutch Jews, Thijs felt perplexed about what the attackers meant by the term Jodenjacht (Jew hunt). This led to further semantic debates, suggesting that the term Jodenjacht might sound more mobilizing due to its alliteration, making it more compelling than Jacht op Israelis (Hunt for Israelis).\n“They were chasing citizens of a country that is attacking their, let’s say, brothers and sisters—the world they come from. Hamas’s attack shattered the belief that Israel is a place where Jews can live in peace, while the violations in Gaza and the overwhelming number of dead are heartbreaking. And now all of this has arrived on the streets of Amsterdam, and it’s up to us to deal with it.”\nNetanjahu’s tactics\nRuthie Pliskin is an Israeli social psychologist and an assistant professor at Leiden University. She has lived in Amsterdam for seven years and, although she was worried after October 7 that she might encounter more hostility, she has never, not even for a moment, felt threatened in the Netherlands—even though she uses public transport daily and speaks Hebrew with her parents during these trips.\nOn the morning of November 8, her Israeli family sent her concerned messages, but as Ruthie pieced together the events over the next few hours, it became clear to her that the situation was far less serious than the headlines suggested.\n“Some of the violence was initiated by Maccabi fans. Of course, this doesn’t mean that what followed is justified. The violence against the whole group of Israelis was outrageous, and it’s appalling that calls for Jewish persecution were made on social media. But there’s a difference between hundreds of people doing this and, say, ten people.”\nShe considers herself fortunate because the Dutch don’t regard her as an Israeli football hooligan because of what some individuals did, whereas the blame was immediately placed on Muslims. She believes the Dutch government shouldn’t adopt Netanyahu’s tactics, where he seizes any opportunity to reinforce his narrative that the world is a dangerous place and Jews are only safe in Israel.\n“The priority for the Netherlands now should be to ensure the safety of all communities and minorities, not to incite public opinion against Muslims. After all, in the 1930s, everything began with the discrimination of a minority group.”\n(Cover: Anti-Israel protesters with Palestinian flags in Amsterdam before the Ajax Amsterdam-Maccabi Tel Aviv match in the European Football League on 7 November 2024. Photo: Jeroen Jumelet / EPA / MTI)",
  "word_count": 3855,
  "scraped_at": "2026-02-14T12:09:57.905738"
}