{
  "article_id": "018b80fc5dbd",
  "url": "https://www.mirror.co.uk/3am/celebrity-news/lioness-star-lucy-bronzes-mysterious-35616246",
  "title": "Lioness star Lucy Bronze mysterious  split  from teammate before baby bombshell",
  "date": "20250726T100000Z",
  "domain": "mirror.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Lioness star Lucy Bronze's mysterious 'split' from teammate before baby bombshell\nThe self-styled 'bossy mum' of the Lionesses squad, Lucy Bronze, has opened up about the one wish she has for her future. It comes as she has been romantically linked with some very famous players\nLioness legend Lucy Bronze keeps her life away from the pitch largely under wraps, but she has been linked to some very famous sportswomen in her love life.\nThe footballer, known as one of the best in the world, was once reportedly dating her teammate Keira Walsh but she's since found a new flame, according to reports.\nDespite their romance seemingly fizzling out, Lucy and Keira appear to remain amicable and are both part of the Lioness squad. It comes as Lucy dropped a major bombshell about her huge wish for the future.\nLucy, 33, is known as one of the world's top female footballers - boasting over 120 international appearances and a collection of silverware, including five Champions League crowns.\nShe transferred to Chelsea in 2024 following her time at Barcelona, and her adaptability as a right-back or wing-back continues to prove invaluable for both club and nation.\n- Off-pitch lives and loves of England's Lionesses gunning for Women's Euro 2025 glory\n- Keira Walsh putting friendships to one side as England seek Spain revenge\nAway from the football field, she was rumoured to be in a relationship with England's vice-captain and Chelsea player Keira Walsh, 28. In the summer of 2022, Bronze and Walsh both made the switch from Man City to Barcelona and competed in the World Cup as part of the Lionesses squad the following year.\nThe pair kept their rumoured romance relatively low-key and never publicly confirmed their relationship, but shared several cosy photos together on social media over the years. Some of which included sun-soaked getaways together, including a break to Lyon, France, in 2019 and a trip to LA in May 2022, where they struck a pose on the beach.\nThey've even spent time together with both their families, as a sweet Instagram snap showed Lucy and Keira beaming alongside their loved ones. While they never confirmed their relationship together or a split, things seemed to suddenly come to an end.\nLucy is now said to be romantically linked with Spanish footballer Ona Batlle, 26. While neither of the pair has gone official, they have shared a series of sweet snaps together.\nOne saw them on holiday together last month before the Euros kicked off in Switzerland. In the post, Lucy wrote: \"Few days of sun,\" while Ona commented with a heart-eyed emoji. They even took a trip to Disneyland Paris together in December last year.\nMeanwhile, Lucy recently opened up about her future and about starting a family of her own one day. In an interview with Women's Health, she shared: \"I could get a corporate job. I could try to be part of the Federation or Fifa. I could help someone like Chelsea develop the women’s team.\"\nThe player added: \"I wouldn't say there's something I'm dying to do, apart from have a family. My brother's got two kids and that's what I'm most jealous of, seeing my niece and nephew. But there's plenty of time for that – and what that looks like, I don't know.\"\nWhile Lucy and Ona are major rivals during the Euros, with England and Spain competing against each other in the final on Sunday, 27 July, it doesn't seem to impact their relationship off the pitch. After Spain took victory against England during the 2023 World Cup, Ona was spotted comforting Lucy on the sidelines.",
  "word_count": 606,
  "scraped_at": "2026-02-14T12:58:38.918647"
}