{
  "article_id": "018b173bb30b",
  "url": "https://www.atlantamagazine.com/news-culture-articles/2026-atlanta-500-religion-nonprofits-advocacy/",
  "title": "Atlanta 500 Most Powerful Leaders in 2026 : Religion , Nonprofits , & Advocacy",
  "date": "20260201T071500Z",
  "domain": "atlantamagazine.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Advocacy | Nonprofit Organizations | Religion | Legends\nADVOCACY\nDouglas B. Ammar\nExecutive Director\nGeorgia Justice Project\nDouglas B. Ammar has been an active presence at Georgia Justice Project (GJP) since its beginning in 1986. Starting as a volunteer, then joining as a staff attorney in 1990, Ammar became executive director in 1995. GJP provides holistic criminal defense and social services while seeking systemic change in Georgia law that will reduce the number of people under correctional control and reduce barriers to reentry into society. During his leadership, GJP has helped to change 22 laws in Georgia, such as Senate Bill 288, which enables Georgians to have second chances by expanding access to record restriction and sealing for certain eligible Georgia criminal records.\nEDUCATION Davidson College, Washington and Lee University School of Law (JD)\nHOMETOWN Charleston, West Virginia\nWHY I CHOSE THIS WORK Growing up poor with an addicted, single-parent father, my childhood goal was to escape and live a life of comfort. But later, before law school, I felt called to return to the places and people I was running from. Being married to a woman of color for over 30 years, and raising our sons, has also reinforced my sense of mission and commitment.\nWHO’D PLAY ME IN A BIOPIC Robert De Niro\nAparna Bhattacharyya\nExecutive Director\nRaksha, Inc.\nAparna Bhattacharyya is the executive director of Raksha, Inc. The mission of Raksha, which means protection in several South Asian languages, is to promote a stronger and healthier South Asian community through confidential support services, education, and advocacy. Having served as executive director since 1998, Bhattacharyya built the organization’s capacity from a volunteer-run, grassroots organization to a nationally known full-service agency providing counseling, legal advocacy, economic empowerment, training, and technical assistance locally and nationally. Additionally, she increased the organization’s budget by over 400 percent. As a representative of Raksha, Bhattacharyya has served as a founding task force member and board secretary for the International Women’s House, the only shelter in the nation to serve battered women and children of all nationalities, supported by a multicultural and multilingual staff. A member of the Leadership Atlanta class of 2010, Bhattacharyya was honored as a White House Champion of Change in 2013.\nEDUCATION Georgia State University\nHOMETOWN Atlanta\nFIRST JOB Victim Advocate for City of Atlanta Victim Witness Assistance Program\nStephanie Cho\nDirector, Democracy Lab South\nAsian Americans Advancing Justice–Atlanta\nFormerly the executive director of Asian Americans Advancing Justice–Atlanta, Stephanie Cho leads Democracy Lab South, a new initiative from AAAJA, the organization which advocates for the civil and human rights of Asian Americans in Georgia and the Southeast. Her new project is focused on environmental justice work in Atlanta and AAPI political power-building in a few other southern states. Bringing more than 20 years of experience in labor and community organizing, strategic planning, and fundraising at the local and national levels, Cho was previously the Los Angeles director of the Restaurant Opportunities Center, where she worked to raise industry standards and wages for LA’s restaurant workers. She has been a community organizer, program director for LGBTQ+ youth programming, director of training for a national fellowship program, labor organizer, and organizational consultant.\nEDUCATION Portland State University\nHOMETOWN Pyeongtaek, South Korea\nFIRST JOB Restaurant Bon Ton\nTOUGHEST CHALLENGE Being on my own at 17\nFEW PEOPLE KNOW I was a welder in college.\nLiz Coyle\nExecutive Director\nGeorgia Watch\nLiz Coyle oversees Georgia Watch, the state’s leading nonprofit consumer-advocacy organization. Georgia Watch advocates for policies that improve individual and family financial security, increase access to affordable healthcare, and lower the energy burden on struggling families. In addition to her role with Georgia Watch, Coyle serves as board chair of the Historic Fourth Ward Park Conservancy, having served on the Consumer Advisory Board of the Consumer Financial Protection Bureau from 2018 to 2019, and as vice chair of the Smart Energy Consumer Collaborative board from 2018 to 2021. In 2021, she testified before the U.S. Senate Committee on Banking, Housing, and Urban Affairs to share insights on protecting consumers in a pandemic recovery economy.\nEDUCATION University of Virginia\nWHY I CHOSE THIS WORK I’ve been standing up for people I think are being wronged my whole life.\nWHAT I’D TELL MY 18-YEAR-OLD SELF Don’t be in such a hurry!\nFAVORITE TV SHOW I’m a huge fan of Rachel Maddow.\nFAVORITE PLACE TO VISIT Rural Georgia, especially driving on country roads\nDázon Dixon Diallo\nFounder and President\nSisterLove\nDázon Dixon Diallo is the president of SisterLove, the first women’s HIV and sexual and reproductive justice organization in the southeastern U.S., which she founded in 1989. A widely celebrated advocate, Diallo is also a cochair of the Act Now: End AIDS coalition, and a founding member of the SisterSong reproductive justice collective. She has served on the Office of AIDS Research Advisory Council for the National Institutes of Health and on the board of the National Women’s Health Network. Diallo has an honorary doctorate from Spelman College and was among 30 Atlantans featured on murals installed citywide ahead of the 2019 Super Bowl.\nEDUCATION Spelman College, University of Alabama at Birmingham (MPH)\nHOMETOWN Fort Valley, Georgia\nLESSON LEARNED Not everyone is who they say they are, and almost everyone will show themselves. So keep your eyes open and believe what they show you, not what you hear and feel.\nBEST ADVICE RECEIVED From Miss Johnnie Mae, 75-year-old receptionist, circa 2001: “Baby, you gon’ just have to be happy despite the bullshit!”\nJeff Graham\nExecutive Director\nGeorgia Equality\nJeff Graham is the executive director of Georgia Equality, which works to advance fairness, safety, and opportunity for LGBTQ+ communities throughout Georgia. Graham began advocating on LGBTQ+ and AIDS issues as a college student in the mid-1980s, and has been involved in a wide variety of grassroots and legislative advocacy campaigns since. For over 30 years, he’s served as either executive director or board member for a number of local and national organizations working on issues related to LGBTQ+ rights, civic engagement, access to healthcare, community empowerment, and HIV/AIDS.\nEDUCATION Trinity University\nHOMETOWN Loveland, Colorado\nNOTABLE ACHIEVEMENTS Stonewall Bar Association Lifetime Achievement Award (2023), Linda Smith Lowe Health Advocacy Award (2017), League of Women Voters of Georgia Health Advocate Award (2016), Georgia Civil Liberties Award (2013), National Center for Human Rights Education Human Rights Guardian Award (2004)\nREASON FOR CHOOSING THIS WORK Coming out as a gay man during the early years of the AIDS pandemic, I was inspired to devote myself to making sure all people have access to healthcare, dignity, and respect.\nFEW PEOPLE KNOW I’m a stepparent to three Boston Terriers.\nKwajelyn Jackson\nExecutive Director\nFeminist Center for Reproductive Liberation\nKwajelyn Jackson is the executive director of the Feminist Center for Reproductive Liberation, formerly the Feminist Women’s Health Center, overseeing the organization’s operations, abortion clinic, civic engagement, and education and outreach teams. First hired in 2013 as community engagement coordinator, Jackson has led the expansion of the center’s statewide and national programming, deepened community partnerships, and worked to prevent new abortion restrictions. Prior to joining the center, Jackson was the program manager for WonderRoot Community Arts Center. A respected voice on reproductive justice at the national level, Jackson is on the boards of Abortion Care Network, Black Mamas Matter Alliance, and The Lola.\nEDUCATION Spelman College, Georgia State University Andrew Young School of Policy Studies (MS)\nNOTABLE ACHIEVEMENT First Black woman to lead Feminist Women’s Health Center in the organization’s 47-year history\nINSPIRING PERSON Gloria Washington (maternal grandmother)\nBEST ADVICE RECEIVED You do not have to set yourself on fire to warm up the room for everyone else.\nSantiago Marquez\nCEO\nLatin American Association\nSantiago Marquez is the CEO of the Latin American Association. Founded in 1972, the LAA is the region’s leading agency representing Georgia’s Latino issues. Marquez, who was born in Cuba and came to the United States in 1971, has been working in the nonprofit sector since 1998, initially with Consumer Credit Counseling Service Inc. After CCCS, Marquez served as the director of Employment and Housing for the LAA, starting the first housing department to focus on Hispanics in Atlanta. In 2004, he joined Boys & Girls Clubs of America, where he worked for four years as the director of Latino Outreach. Marquez became the president of the Georgia Hispanic Chamber of Commerce in 2017, and, in 2020, he returned to the LAA as CEO, fulfilling a lifelong dream.\nEDUCATION Georgia State University, University of Notre Dame Mendoza College of Business (MNA)\nHOMETOWN Sancti Spíritus, Cuba\nWHY I CHOSE THIS WORK Born in Cuba, I am deeply grateful that I had the opportunity, with my parents’ sacrifices, to leave and become a U.S. citizen and escape a communist regime. I want to extend the American dream to others.\nFEW PEOPLE KNOW I’ve seen U2 15 times.\nHan Pham\nExecutive Director\nHer Term\nHan Pham is the executive director of Her Term, an organization created to encourage women to pursue public office at the state level. Having joined Her Term as a volunteer in 2017, under her leadership, Her Term has emerged as a powerful force for increasing female political participation, transforming Georgia’s politics by championing equitable representation. In 2024, she was one of just two Georgians selected for the Obama Foundation Leaders USA Program. Pham is among 205 changemakers chosen worldwide. She also recently headed operations at the legal e-learning startup, Hotshot. Additionally, Pham founded the Decatur Lunar New Year Festival, which celebrates AAPI cultures, and Badass Asian Women, a group aimed at building a supportive community and empowering AAPI women. For fun, Han runs a microfarm, Phamcliff Farm & Bees, with her husband and kids.\nEDUCATION Wellesley College, University of Minnesota Law School\nRebecca Serna\nExecutive Director\nPropel ATL\nRebecca Serna is the executive director of Propel ATL, a group founded in 1991 to improve biking conditions in the city. Since Serna took the helm in 2007, the coalition has launched the open-streets project Atlanta Streets Alive, created bike valets at Atlanta festivals, and organized successful campaigns for an Atlanta Department of Transportation and a Vision Zero policy, which aims to eliminate traffic fatalities. A native Atlantan, Serna was previously an intern with the Georgia Department of Transportation and a Fulbright scholar in Bogotá, Colombia, where she studied participatory planning practices and innovative public transportation projects.\nEDUCATION University of Georgia, Georgia State University Andrew Young School of Policy Studies (MS)\nHOBBIES Wading in creeks, growing food, reading novels, watching great TV\nNONPROFITS ACLU, Atlanta Community Food Bank, Los Vecinos de Buford Highway, the Bail Project\nAzadeh Shahshahani\nLegal and Advocacy Director\nProject South\nAzadeh Shahshahani works to protect the human rights of immigrants and Muslim, Middle Eastern, and South Asian communities throughout the Southeast. Her work includes documenting violations at the Irwin County Detention Center, including invasive gynecological procedures without consent. Additionally, her work led to a U.S. Senate investigation and hearing and the removal of all detained migrants from the center. She also played a key role in convincing the City of Atlanta to stop detaining immigrants in the city jail. Shahshahani was also co-counsel in a lawsuit on behalf of detained immigrants subjected to forced labor at the Stewart Detention Center. In 2025, Shahshahani delivered a keynote address on “Migration, Law, and Justice: The Evolving Role of International and U.S. Policies” at Emory Law School’s International Law Symposium. A past president of the National Lawyers Guild, Shahshahani previously worked as the national security and immigrant-rights project director with the American Civil Liberties Union of Georgia.\nEDUCATION University of Michigan (MA), University of Michigan Law School (JD)\nHOBBIES As a devoted foodie, exploring Atlanta’s rich and diverse food scene\nNathaniel Q. Smith\nFounder and Chief Equity Officer\nPartnership for Southern Equity\nNathaniel Smith founded and serves as chief equity officer of the Partnership for Southern Equity, which promotes racial equity and shared prosperity for all in metropolitan Atlanta and the American South. PSE focuses on energy equity, economic inclusion, and equitable development, and created the South’s first equity-mapping tool, the Metro Atlanta Equity Atlas. PSE led a coalition of diverse stakeholders to support a $13 million transit referendum that expanded MARTA into a new county for the first time in 45 years. In 2023, PSE received a $3.5 million grant from the Bezos Earth Fund to support urban greening in the Atlanta region.\nEDUCATION Morehouse College, New School (MS)\nTiffany Williams Roberts\nDirector of the Public Policy Unit\nSouthern Center for Human Rights\nTiffany Williams Roberts, a civil rights and criminal defense attorney, joined the Southern Center for Human Rights in 2018 as community engagement and movement-building counsel and became director of its Public Policy Unit in 2022. She has practiced criminal defense since 2008, first as a public defender with the Atlanta Judicial Circuit Public Defender and later as a solo practitioner. A significant portion of her private practice was dedicated to the pro bono representation of activists and organizers. As a community organizer, she cofounded the police accountability organization Building Locally to Organize for Community Safety (BLOCS) in 2008 to promote a holistic approach to public safety. She also serves as chair of the Social Justice Ministry at Atlanta’s historic Ebenezer Baptist Church and board chair of Ebenezer ACTS.\nEDUCATION Emory University, Georgia State University College of Law (JD)\nNOTABLE ACHIEVEMENTS Georgia Association of Black Women Attorneys’ Barbara A. Harris Award for Service to the Community (2020), Southern Center for Human Rights Gideon’s Promise Award (2018), NAACP Atlanta Jubilee Day Award (2018)\nINSPIRING PERSON Journalist Ida B. Wells\nFEW PEOPLE KNOW I sang in Emory’s all-female a cappella group, the Gathering.\nLani Wong\nChair\nNational Association of Chinese Americans\nLani Wong is the chair and a founding member of the National Association of Chinese Americans (NACA) in Atlanta. In that role, she has advanced the interests of the Asian American & Pacific Islander (AAPI) community and the citizens of Georgia, as a whole, for over 40 years. A true pioneer, she has devoted boundless energy at the local, national, and international levels to exponentially increase AAPI participation in the American political process and to improve U.S.-China relations. Wong is also a dedicated community volunteer and leader, serving on the boards of influential government, healthcare, educational, and nonprofit organizations such as the Atlanta Women’s Foundation and the Georgia Human Relations Commission. Among her many honors, she has received the Spelman College Legacy of Leadership Award (2010), Mayor Shirley Franklin’s City of Atlanta Phoenix Award (2005), and the National Association of Asian American Professionals 100 Inspire Award (2018). A native of Indonesia, Wong and her husband, Dr. John Wong, have two children and often host civic events in her award-winning garden at their Dunwoody home.\nAndrea I. Young\nExecutive Director\nAmerican Civil Liberties Union of Georgia\nA lifelong advocate for civil and human rights, Andrea Young is the executive director of the ACLU of Georgia. Under her leadership, the ACLU of Georgia has used legislative advocacy and litigation to protect Georgia’s multiracial democracy, citizen participation in free and fair elections; free speech, and privacy rights. As a member of the Leadership Atlanta class of 2008, Young was inspired to create the Making of Modern Atlanta project, recognizing the people and policies that allowed Atlanta to transition from segregation to a world-class city. The project included an archive, documentary film, and book. She is the author of Life Lessons My Mother Taught Me about her mother, the educator and children’s rights activist Jean Childs Young. A founding board member of the National Center for Civil and Human Rights, Young has received numerous awards including from the Gate City Bar Association, the YWCA, the Children’s Defense Fund and Roses for Roe.\nEDUCATION Swarthmore College, Georgetown University Law Center (JD)\nNOTABLE ACHIEVEMENT Aide to Sen. Edward Kennedy on passage of the Martin Luther King Jr. national holiday\nFEW PEOPLE KNOW I have completed triathlons at Lake Lanier and Callaway Gardens.\nNONPROFIT ORGANIZATIONS\nLeonard L. Adams Jr.\nPresident and CEO\nQuest Community Development Organization\nLeonard L. Adams Jr. is the founder, president, and CEO of Quest Community Development Organization, which invests in affordable housing and provides services to underserved people. The organization has launched Atlanta’s Westside Affordable Housing Trifecta with an investment of $110 million serving Atlanta’s most vulnerable populations to include the unhoused, extremely low-income, 55-plus citizens, and veterans. A native of Detroit and an Army veteran, Adams has years of experience in developing affordable and supportive housing communities in challenged neighborhoods on Atlanta’s Westside and in Knoxville, Tennessee. Adams serves on Knoxville College’s board of trustees and on the Enterprise Community Leadership Council.\nEDUCATION Knoxville College, Kennesaw State University (MBA)\nFIRST JOB Snow-shoveling specialist and newspaper deliverer\nJohn Ahmann\nPresident and CEO\nWestside Future Fund\nJohn Ahmann is president and CEO of the Westside Future Fund, a nonprofit formed by public, private, and philanthropic partners to promote the development of Atlanta’s Westside neighborhood. Ahmann has been driven for more than 25 years to improve the way communities and institutions function in Atlanta. Formerly Ahmann was executive director of the Atlanta Committee for Progress. Following a stint as a U.S. House of Representatives staffer, he worked for the Atlanta Committee for the Olympic Games and later for the Metro Atlanta Chamber. A member of Leadership Atlanta’s class of 2024, Ahmann also has his own public affairs consulting firm and served two terms on the City Schools of Decatur Board of Education.\nEDUCATION Emory University, Yale School of Management (MA)\nHOMETOWN Atlanta\nPaige Alexander\nCEO\nThe Carter Center\nPaige Alexander joined The Carter Center as CEO in June 2020, charged with leading the organization through the Covid-19 pandemic and a period of national social upheaval, while envisioning a path forward for the center. In transitioning from an organization that was founder-led to one that is guided by its founders’ principles, Alexander has strengthened the center’s core peace and health programs and led the organization in new directions, including adding programs to address: the global mental health crisis, political polarization in the U.S., and the impact of climate change on global peace and public health. Before joining The Carter Center, Alexander had a distinguished global development career, with more than two decades of experience in the government and nonprofit sectors. She held Senate-confirmed senior leadership positions at two regional bureaus of the United States Agency for International Development (USAID), covering missions and development programs in 25 countries.\nINSPIRING PERSON My father, Miles Alexander. He got hired at one of the few firms in Atlanta in the 1950s that would hire Jews and then spent his career as the top lay leader for both the American Jewish Committee and the Anti-Defamation League, fighting to advance civil rights and human rights into his ninth decade.\nTerri L. Badour\nExecutive Director\nAmerican Red Cross of Georgia\nTerri Badour leads the American Red Cross serving Greater Atlanta, one of the largest and strongest chapters in the country, in terms of mission delivery, volunteer engagement, and philanthropy. Prior to this, Badour served in a dual role as the first female CEO of the Red Cross of Georgia and as the executive director for Metro Atlanta, leading the organization as it responded to disasters from home fires to hurricanes, offered services to members of the armed forces and their families, organized blood collection, engaged volunteers, and provided health and safety training.\nEDUCATION Western Michigan University, Florida State University (MS)\nNOTABLE ACHIEVEMENTS Raising an incredible daughter is #1. Georgia Trend 100 Most Influential Georgians (2024), Atlanta Business Chronicle Women Who Mean Business (2019), YWCA of Greater Atlanta Academy of Women Achievers (2012), president of the Junior League of Atlanta (2001-2002)\nWHY I CHOSE THIS WORK It’s a privilege to meet our clients, blood and financial donors, partners, and volunteers who impact me as a person and change my life. Serving them on behalf of our iconic, worldwide emblem is a humbling honor.\nJames “Jay” Bailey\nPresident and CEO\nH.J. Russell Innovation Center for Entrepreneurs\nJames “Jay” M. Bailey is the president and CEO of the H.J. Russell Innovation Center for Entrepreneurs (RICE), the world’s largest hub dedicated to empowering Black businesses. Under his leadership, RICE supports over 500 entrepreneurs, generating $234 million in annual revenue, creating 2,500 jobs, and contributing over $500 million in economic impact to metro Atlanta. Recognized by four U.S. presidents for his community leadership, Bailey serves on several boards, including the Metro Atlanta Chamber, Agnes Scott College, the Atlanta Speech School, the University of Georgia, the Fulton County Sheriff’s Office, and Invest Atlanta Foundation.\nEDUCATION University of Georgia\nWHY I CHOSE THIS WORK To change lives, change my community, and plant seeds that will grow trees whose shade I may never sit under.\nHIDDEN TALENT I’m a cattle farmer. I drive a tractor and can call the cows with the best of them.\nFAVORITE BOOK Building Atlanta: How I Broke through Segregation to Launch a Business Empire by Herman J. Russell with Bob Andelman\nBUCKET LIST A trip to Egypt\nMaurice Baker\nManager, Community Relations\nGeorgia Natural Gas\nSt. Louis native Maurice “Moe” Baker is manager of community relations for Georgia Natural Gas, which serves nearly half a million customers as part of Southern Company, one of the largest energy companies in the U.S. At GNG since 2002, Baker supervises community relations, philanthropy, and volunteer programs, and has been responsible for millions of dollars in charitable giving for the company. He began his career as manager of WSB-TV/Radio’s Consumer Action Center.\nEDUCATION Boston University\nBEST ADVICE RECEIVED Yolanda King advised me to always bring a tape recorder to an interview. I was working for my high school newspaper at the time.\nFAVORITE TRAVEL DESTINATION South Africa\nHIDDEN TALENT I’m actually a pretty good painter.\nFAVORITE TV SHOWS Blackish, 60 Minutes\nMeg Blackwood\nPresident and CEO\nInCommunity\nAppointed in August 2024, Meg Blackwood is the president and CEO of InCommunity, a 46-year-old nonprofit organization dedicated to supporting individuals with intellectual and developmental disabilities. In her short time at the helm, she has made significant strides in key hires and initiating processes to enhance the organization’s community presence and employee experience. Before joining InCommunity, Blackwood had more than 20 years of experience in advising companies, including government entities and Fortune 500 corporations. Her extensive background in operational leadership, litigation, and human resources makes her well-suited to guide InCommunity through its next chapter of growth and service.\nBEST ADVICE RECEIVED The best advice I have received is to press the internal pause button before you respond to something. Speaking candidly is a great value, but when you speak as a leader, you have to realize the gravity your words have on your organization and so having that emotional intelligence and discipline to hit the pause button and really think is important.\nJohn Hope Bryant\nFounder, Chairman, and CEO\nOperation HOPE Inc.\nBryant Group Ventures LLC\nJohn Hope Bryant is the founder, chairman, and CEO of Operation HOPE Inc., the nation’s largest nonprofit provider of ﬁnancial literacy services for youth and adults. Since 1992, Operation HOPE has been moving America from civil rights to “silver rights” with the mission of making free enterprise and capitalism work for the underserved. He is also the founder of John Hope Bryant Holdings, Bryant Group Ventures, and Bryant Group Advisors. Until June 2024, he previously led The Promise Homes Company, which he successfully recapitalized in 2021 with a $200 million credit facility—one of the largest Black-owned capital raises in over a decade.\nNOTABLE ACHIEVEMENTS Led efforts to rename the U.S. Treasury Annex to the Freedman’s Bank Building, recognizing the unfinished economic work of Abraham Lincoln for freed slaves; Author of six books including the Amazon bestselling Financial Literacy for All: Disrupting Struggle, Advancing Financial Freedom, and Building a New American Middle Class; TIME inaugural The Closers List, recognizing Black leaders working to end inequality, Oprah Winfrey Use Your Life Award, American Banker Innovator of the Year; LinkedIn influencer with over 3 million social media followers, amassing over 300 million views across digital platforms through his Straight Talk with John Hope Bryant series.\nRodney D. Bullard\nCEO\nThe Same House\nCEO of The Same House, a public benefit corporation dedicated to furthering economic mobility by bridging social division. Previously, Bullard led community-engagement, philanthropic and sustainability strategy as vice president of community affairs for Chick-fil-A and executive director of the Chick-fil-A Foundation. He also previously served as an assistant U.S. attorney prosecuting complex criminal cases, for which he received the Department of Justice Director’s Award. Bullard released his first book, Heroes Wanted: Why the World Needs You to Live Your Heart Out, in 2018.\nEDUCATION U.S. Air Force Academy, University of Georgia Terry College of Business (MBA), Duke University School of Law (JD)\nNOTABLE ACHIEVEMENTS White House fellow working at NASA, congressional legislative liaison in the Office of the Secretary of the Air Force\nBEST ADVICE RECEIVED Don’t ever let the expectations of others limit your expectations for yourself.\nFEW PEOPLE KNOW I love to sing. (Whether I can sing or not is a matter of debate.)\nFAVORITE ATLANTA PLACE TO VISIT Cyclorama at the Atlanta History Center\nIn 2022, Julio Carrillo was named CEO of HOPE Atlanta, nonprofit dedicated to ending homelessness and hunger that was founded in 1900. With more than 17 years of nonprofit management experience, Carrillo joined Hope Atlanta after serving as COO for Families First, an Atlanta nonprofit that provides a spectrum of services for youth, individuals, and families. He has also held executive leadership positions at TechBridge and Big Brothers Big Sisters of Metro Atlanta. He currently serves on the board of Leadership Atlanta and the governing council of the Atlanta Continuum of Care, and he is a past board member of Agape Youth & Family Center, Atlanta Victim Assistance, and the GreenLight Fund.\nEDUCATION Universidad Autónoma de Madrid, Columbia University (Strategy and Innovation Certification)\nFEW PEOPLE KNOW I love to cook and dance. Whether I’m experimenting with a new recipe or dancing around the kitchen while I make it, it’s my way of expressing joy and creativity.\nBEST ADVICE RECEIVED The best advice I’ve ever received is to “stay curious and stay kind.” It reminds me that growth and connection go hand in hand.\nFAVORITE BOOK One Hundred Years of Solitude by Gabriel García Márquez\nDeke Cateau\nCEO\nA.G. Rhodes\nDeke Cateau is the CEO at A.G. Rhodes, a 122-year-old nonprofit organization operating three nursing homes in metro Atlanta. With more than 20 years of experience in long-term care, Cateau is passionate about fostering a greater understanding of and appreciation for the aging population. As a leader in the fields of healthcare and aging, he educates the community – through robust outreach and speaking engagements with local, national, and international audiences – about the complex issues surrounding aging and long-term care. In addition to being a licensed nursing home administrator, Cateau is a certified dementia care practitioner, trainer, and educator. Additionally, he serves on boards for multiple organizations including LeadingAge, the I’m Still Here Foundation, the Georgia Center for Nursing Excellence, New Horizons Community Development Corporation, Advancing Excellence in Long-Term Care Collaborative, and the Moving Forward Coalition.\nEDUCATION University of the West Indies, University of the Virgin Islands (certification in global leadership development)\nWHY I CHOSE THIS WORK Years ago, I was working in financial services and my wife – who was a dietician in a nursing home – encouraged me to get into the industry because she thought I would find it more rewarding and meaningful. As usual, my wife was right.\nNicole “Nikki” Clifton\nPresident, Social Impact and The UPS Foundation\nUPS, The UPS Foundation\nNikki Clifton leads UPS’s global philanthropy, social impact, and international community affairs, leveraging the company’s partnerships and logistical acumen to respond to the world’s most pressing social, humanitarian, and environmental needs. Clifton has been instrumental in several signature initiatives at UPS. She coordinated the company’s anti-human trafficking awareness and advocacy initiatives to create the largest training initiative in the private logistics industry. Under her leadership, The UPS Foundation advanced the in-kind distribution of Covid-19 vaccines and cold chain freezers to underserved countries, a global effort that called on UPS’s airline, drone, and ground network. Clifton is overseeing a strategic overhaul of The UPS Foundation to align the company’s philanthropic strategy more closely with UPS’s strengths and priorities and to center its work on equity and justice.\nEDUCATION Howard University, University of Georgia School of Law (JD)\nNOTABLE ACHIEVEMENTS A class of 2022 member of YWCA of Greater Atlanta’s Academy of Women Achievers, Clifton is also a member of Leadership Atlanta’s class of 2008 and serves on the board of directors for Points of Light.\nJasmine Crowe\nFounder and CEO\nGoodr\nJasmine Crowe is an award-winning social entrepreneur, TED speaker, and leader. In 2017, after years of feeding people experiencing homelessness from her own kitchen, she launched Goodr, a sustainable waste management company that leverages technology to combat hunger and reduce food waste. Since the launch in 2017, Goodr has been responsible for providing nearly 30 million meals to people across the United States and has diverted over 12 million pounds of surplus food that would have ended up in a landfill. Under her direction, Goodr also launched a grocery delivery program providing weekly groceries to senior citizens and children in virtual school. In 2021, Crowe partnered with recording artist, Gunna, launching the first in-school free grocery store in Atlanta. In 2025, the author of the children’s book, Everybody Eats, launched Community Market on Edgewood, offering affordable, local, and fresh groceries, and Little Loaf Deli, Goodr’s first affordable restaurant concept.\nEDUCATION North Carolina Central University\nFIRST JOB I’ve always been an entrepreneur at heart. In middle school, I started a business teaching kids gymnastics called Tumble Tots.\nBEST ADVICE RECEIVED The best advice I received was from my dad. No matter how tough the day was going, he would always say, “Joy comes in the morning.”\nCharlene Crusoe-Ingram\nCEO\nMeals On Wheels Atlanta\nAfter serving on the Meals On Wheels Atlanta (MOWA) board of trustees for six years, Charlene Crusoe-Ingram stepped into the role of CEO in 2015. As CEO, Crusoe-Ingram leads the organization’s work to end senior hunger in Atlanta, overseeing the delivery of more than 500,000 meals annually as well as MOWA’s social enterprise business, Purposeful Gourmet Foods, which generates revenue to support MOWA’s mission. Crusoe-Ingram, a native of New Albany, Mississippi, brings a wealth of corporate experience to her position, including senior leadership roles at Abbott Laboratories, the Coca-Cola Co., and NDC Health (now part of McKesson Pharmacy Systems). She is an alum of Leadership Atlanta and has been honored as a supporter and leader by the National Black MBA Conference. She has been featured as a strategic human resources professional in Beverage Digest.\nEDUCATION Bradley University (MA)\nHOBBIES Flower arranging\nFAVORITE TRAVEL DESTINATION Paris\nFAVORITE ATLANTA PLACE TO VISIT High Museum\nAlicia Doherty\nChief Executive Officer\nAmerican Red Cross of Georgia\nAlicia Doherty is the regional CEO of the American Red Cross of Georgia which serves about 10 million people across 159 counties with the support of a large volunteer workforce, blood and financial donors, and community partners. Previously, Doherty was the regional donor services executive for Georgia, within biomedical services of the Red Cross, overseeing blood drive operations and whole blood collections. She also served as the director of national accounts. She started her career at the Red Cross in 2005 in volunteer services before transitioning to donor recruitment, where she held various positions.\nEDUCATION Georgia State University (MS)\nCurley Dossman Jr.\nPresident, Community Relations\nGeorgia-Pacific, Georgia-Pacific Foundation\nCurley Dossman Jr. leads the organization’s charitable-giving program, which focuses on four areas: education, environment, enrichment, and entrepreneurship. He also oversees Georgia-Pacific’s community-affairs efforts, including national disaster relief. Previously, Dossman spent a decade as the state vice president of government affairs for AT&T.\nEDUCATION Morehouse College, Washington University School of Law (JD)\nHOMETOWN Ville Platte, Louisiana\nNOTABLE ACHIEVEMENTS Supported Georgia-Pacific’s leadership role in securing funding for the restoration of Ebenezer Baptist Church, past board chair of 100 Black Men of America\nFEW PEOPLE KNOW I have a law degree.\nHOBBIES Travel, golf\nFAVORITE BOOK The Firm by John Grisham\nGeorge A. Dusenbury IV\nVice President Southern Region, Georgia and Florida\nThe Trust for Public Land\nGeorge Dusenbury oversees The Trust for Public Land’s work on urban parks and green infrastructure in Georgia. Central to this work is TPL’s leadership on the Chattahoochee RiverLands, a collaborative effort with the Atlanta Regional Commission and other stakeholders to create a master plan for a 100-mile stretch along the Chattahoochee River. Proud of its partnership with the City of Atlanta to build the 16-acre Rodney Cook Sr. Park in Vine City, TPL also is working with metro school districts and community partners to reimagine and redesign schoolyards as community parks outside of school hours. Additionally, Dusenbury serves as an advocate for parks, sustainability, and good urban design as a part of Decatur’s City Commission.\nEDUCATION Cornell University, Emory University School of Law (JD)\nPREVIOUS POSITIONS Commissioner of the Atlanta Department of Parks and Recreation, executive director of Park Pride, legislative director and district director for Congressman John Lewis\nFEW PEOPLE KNOW I am an identical twin.\nBEST ADVICE RECEIVED Get in the way.\nINSPIRING PERSON Congressman John Lewis\nDavid Eidson\nPresident and CEO\nCoxe Curry & Associates\nDavid Eidson is president and CEO of Coxe Curry & Associates, a fundraising consulting firm that works with major local institutions including the Bobby Jones Golf Course Foundation, Children’s Healthcare of Atlanta, Grady Health Foundation, Trees Atlanta, and the YMCA of Metro Atlanta. He joined the organization in 2012 after 27 years in the financial sector; previously Eidson was chairman and CEO of the SunTrust subsidiary RidgeWorth Capital Management, where he worked with nonprofit boards and finance committees to oversee the management of their organizations’ investable assets.\nEDUCATION Auburn University\nHOMETOWN Birmingham, Alabama\nWHY I CHOSE THIS WORK The first 27 years of my professional career I worked in various parts of the SunTrust organization, and I was introduced very early in my career to the non-profit community. SunTrust encouraged me to be involved in leadership roles—on various boards and on committees of nonprofits. That exposure to those organizations created a desire to be more involved, and I decided I wanted to turn my avocation for the nonprofit world into my vocation.\nFrank Fernandez\nPresident and CEO\nCommunity Foundation for Greater Atlanta\nFrank Fernandez has served as president and CEO of the Community Foundation for Greater Atlanta since 2020. Under his leadership, the foundation has advanced bold initiatives in affordable housing and economic mobility—connecting donors, nonprofits, and civic leaders to create a more equitable and prosperous Atlanta. Previously at the Arthur M. Blank Family Foundation, he spearheaded the Westside Neighborhood Prosperity Fund, a program designed to contribute to the revitalization of Vine City, English Avenue, Castleberry Hill, and adjacent neighborhoods. Prior to his work in Atlanta, he served as executive director of Green Doors in Austin, Texas. A member of Leadership Atlanta’s class of 2024 and the LatinX Alliance, Fernandez remains committed to building lasting solutions that strengthen communities and expand opportunity for all.\nEDUCATION Harvard University, University of Texas at Austin LBJ School of Public Affairs (MPA)\nFIRST JOB Landscaper for my high school to pay for tuition\nHOBBIES Reading, watching sports, hiking\nFAVORITE TRAVEL DESTINATION La Sagrada Familia in Barcelona\nJai Ferrell\nCEO\nGirl Scouts of Greater Atlanta\nAppointed in July 2024, Jai Ferrell is the CEO of Girl Scouts of Greater Atlanta. Ferrell, an Atlanta native and former Girl Scout, has strong ties to the area’s business, government, and cultural leaders. Her professional experience spans complex, multi-stakeholder environments, most recently serving as the chief commercial/revenue officer for Hartsfield-Jackson Atlanta International Airport. Ferrell is the first person of color to lead the Girl Scouts of Greater Atlanta Council.\nEDUCATION Spelman College, Georgia State University (MA)\nFIRST JOB Summer camp counselor for the City of Atlanta’s Best Friend Program\nFAVORITE ATLANTA PLACE TO VISIT Grant Park\nNancy A. Flake Johnson\nPresident and CEO\nUrban League of Greater Atlanta\nNancy Flake Johnson returned to Atlanta from Detroit in 2008 to become president and CEO of the Urban League of Greater Atlanta and engage her passion for promoting economic development and equity by empowering African American youth, adults, and families. By building partnerships, Johnson increased the League’s impact on housing, education, business development, and employment in underrepresented communities. The League partnered with the City of Atlanta to create a Youth Development Grant program for local community-based organizations that serve Atlanta students in grades K-12 as so many Atlanta youth were adversely affected by the pandemic. Johnson started her career as an accountant and was the first woman to lead the Howard University Small Business Development Center.\nEDUCATION Howard University, DePaul University (MS)\nHOMETOWN Detroit, Michigan\nNOTABLE ACHIEVEMENT Atlanta Business Chronicle Women Who Mean Business (2020)\nINSPIRING PERSON Congressman John Lewis for his courage, unwavering strength, and commitment to breaking down systems of oppression and institutional racism, and fighting for justice and voting rights.\nMaria Fundora\nOwner and General Manager\nCasa Nuova Italian Restaurant\nFounder\nPurple Pansies\nMaria Fundora is the owner and general manager of Casa Nuova Italian Restaurant in Alpharetta and founder of nonprofit Purple Pansies. She opened Casa Nuova in 1998 with her late husband, Antonio, master chef and founder, and owned five restaurants in Atlanta previously. Fundora founded Purple Pansies in 2009 following her own mother’s death from pancreatic cancer. To date, Purple Pansies has raised over $5 million to fund emergency financial aid to patients and their families, scholarships for children from families affected by pancreatic cancer and groundbreaking research and clinical trials, through Translational Genomics Research Institute (TGen), part of City of Hope. Purple Pansies funding has been instrumental in the creation of three out of the four key regimens used to treat pancreatic cancer today. In 2022, Fundora was appointed to the National Pancreatic Cancer Council.\nFIRST JOB Cashier\nHOMETOWN Chicago, Illinois\nFAVORITE MOVIE Pretty Woman\nBUCKET LIST Being able to put my restaurant dressings on the market\nWHO’D PLAY ME IN A BIOPIC Maria Bilbao or Jennifer Lopez\nJennifer Grant Warner\nPresident and CEO\nFernbank Museum\nJennifer Grant Warner, president and CEO of Fernbank Museum, is on a personal mission to ignite a passion for science, nature and human culture through exploration and discovery. While it is a private nonprofit, Fernbank succeeds with an entrepreneurial mindset. Fernbank fuels growth through a business model that leans on admissions and diverse revenue streams, welcoming more than 400,000 guests annually, including more than 50,000 students from more than 250 schools and community organizations. Grant Warner also helped lead Fernbank’s expansion into an indoor-outdoor cultural destination by introducing “WildWoods,” which features adventurous, artistic, and educational outdoor exhibits that connect the museum directly to Fernbank Forest, the largest urban Piedmont old-growth forest in the United States. With a focus on community impact, Fernbank has also launched a STEAM Lab and the mobile museum, “Fernbank on the Go.” Believing education and fun are not mutually exclusive, she fosters a vision to create unique, engaging, immersive, and fun experiences that people of all ages and backgrounds enjoy.\nEducation: University of Kentucky, Georgia State University Robinson College of Business (MBA)\nF. Sheffield Hale\nPresident and CEO\nAtlanta History Center\nF. Sheffield Hale became president and CEO of the Atlanta History Center in 2012. Previously he was chief counsel of the American Cancer Society and a partner at Kilpatrick Townsend & Stockton, where he practiced corporate law. An Atlanta native, Hale is a trustee of the Atlanta Convention and Visitors Bureau, the Buckhead Coalition, Midtown Alliance, and The Westminster Schools. He is chair of the advisory board of the Museum of Early Southern Decorative Arts, an ex-officio member of the board of the Old Salem Museums and Gardens, and a member of the advisory board for the Center for the Study of the American South.\nEDUCATION University of Georgia, University of Virginia School of Law (JD)\nNOTABLE ACHIEVEMENTS Governor’s Award for the Arts & Humanities (2021), Georgia Trust for Historic Preservation Mary Gregory Jewett Award for Lifetime Preservation Service (2014), State Bar of Georgia Justice Robert Benham Award for Community Service (2001)\nFIRST JOB Clerk at Brookwood Hardware\nBEST ADVICE RECEIVED It’s the last five percent that counts.\nMichael Halicki\nExecutive Director\nPark Pride\nAs president and CEO, Michael Halicki leads Park Pride, the Atlanta-based nonprofit that engages communities to activate the power of parks. During his 13-year tenure, Park Pride has received a four-star designation by Charity Navigator and Candid’s Platinum Seal of Transparency. Halicki, who has been included on the Georgia Trend Notable Georgians list, serves on The Livable Communities Council of the Urban Land Institute – Atlanta, is a member of the Atlanta Civic Collaboratory, and recently joined the board of Atlanta Way 2.0.\nEDUCATION Indiana University, Georgia State University (MPA)\nNOTABLE ACHIEVEMENTS Graduate of the Institute for Georgia Environmental Leadership (2013) and the Atlanta Regional Commission’s Regional Leadership Institute (2009)\nWHY I CHOSE THIS WORK I care deeply for our city and the role parks can play in strengthening neighborhoods and communities. Neighborhoods without parks aren’t neighborhoods—they are just housing.\nFIRST JOB Newspaper delivery boy\nAngela Harris\nExecutive Artistic Director\nDance Canvas, Inc.\nAngela Harris is the executive artistic director of Dance Canvas, Inc., a nonprofit organization dedicated to providing career development opportunities for emerging professional choreographers and youth, while expanding the reach of professional dance in metro Atlanta. Harris founded Dance Canvas after witnessing the difficult path and lack of professional opportunities available for emerging choreographers. Harris, who is also an adjunct professor at Spelman College and Emory University, has developed youth dance/career development programs for the City of Atlanta’s Office of Cultural Affairs, recording artist Usher’s New Look Foundation, and the Tupac Amaru Shakur Foundation. Since 2008, through Dance Canvas, Harris has presented and produced work from over 200 choreographers, with performances that have reached over 25,000 Atlanta audiences.\nEDUCATION City College of New York\nNOTABLE ACHIEVEMENTS City of Atlanta – Mayor’s Arts Advisory Task Force; Suzi Bass Award – Outstanding Choreography; National Visiting Fellow – School of American Ballet; Synchronicity Theater – Women in Arts & Business Honoree\nWHO’D PLAY ME IN A BIOPIC Zoë Kravitz with Ariana DeBose jumping in for the dancing segments. I would be the choreographer, of course!\nAbiodun Henderson\nFounder\nThe Come Up Project featuring Gangstas To Growers\nBorn to a Liberian mother and a Black Panther Party member father, Abiodun “Abi” Henderson is the founder of The Come Up Project, which features a cooperative business training program, based in agriculture, entitled Gangstas to Growers. Geared toward at-risk and formerly incarcerated youth, the program, which provides employment, empowerment, and entrepreneurship opportunities, enables graduates to join the Atlanta hot sauce cooperative Sweet Sol. Program participants grow and harvest the ingredients, then make the hot sauce themselves. Additionally, Henderson has been a community organizer in Westside Atlanta for over 10 years. Under her leadership as garden coordinator, the Westview Community Garden is now community owned after being bulldozed in 2015. In 2020, Henderson received a James Beard Leadership Award which spotlights the important and complex realms of sustainability, food justice, and public health.\nMOST INSPIRING PERSON My ancestors of the Kru tribe in Liberia, who were known as the hardest to enslave, taught me to fight for freedom by any means necessary.\nJennifer Hidinger-Kendrick\nFounder\nGiving Kitchen\nJen Hidinger-Kendrick, along with her late husband, Ryan Hidinger, founded Giving Kitchen, a nonprofit that helps food service workers in crisis. She advises on brand awareness and community involvement, with Giving Kitchen being named one of Fast Company magazine’s Brands That Matter in 2022. Additionally, as GK’s spokesperson, she has received the Community Hero Award from the Atlanta Braves and Fox Sports South, and has been featured on the covers of Entrepreneur and Atlanta magazines. As cofounder of the acclaimed Staplehouse Restaurant, she was a key member of the team that earned Bon Appétit magazine’s Best New Restaurant in America in 2016. Joining GK full-time in 2019, Hidinger-Kendrick, a member of Leadership Atlanta’s class of 2024, was proud to share the stage with colleagues in receiving the James Beard Foundation’s 2019 Humanitarian of the Year award.\nEDUCATION Indiana University\nTOUGHEST CHALLENGE Getting food service workers to ask for help\nBUCKET LIST Being part of a team helping 100,000 food service workers annually find stability\nClyde A. Higgs\nPresident and CEO\nAtlanta BeltLine\nAs president and CEO of the Atlanta BeltLine since 2019, Clyde A. Higgs leads the executive team in overseeing the design and construction of transit, trails, and parks, plus affordable housing, economic development, real estate, external affairs, and procurement. Higgs joined the BeltLine organization in 2015 as chief operating officer; previously he served as executive vice president of a collaborative, multibillion-dollar revitalization and economic development effort led by the state of North Carolina and real estate developer Castle & Cooke. He has 20 years’ experience in economic development, real estate, intellectual property, technology, strategic planning, design, real estate development, grant and donor funding, government relations, and urban innovation.\nEDUCATION University of South Alabama, East Carolina University (MPA)\nFIRST JOB Shrimp boat laborer\nHIDDEN TALENT Ping-pong champion\nNOTABLE ACHIEVEMENT Appointed by Texas Governor Rick Perry to the Texas Emerging Technology Venture Fund for early-stage companies working on innovations in the fields of biotechnology, healthcare, energy, and information technology\nRaphael Holloway\nCEO\nGateway Center\nRaphael Holloway is CEO of the Gateway Center, which provides services and stable housing for people experiencing homelessness. Holloway has more than 25 years of experience in the social services arena, specializing in the behavioral health, corrections, homelessness, and public health sectors. Before joining the Gateway Center in 2016, he was chief operations officer for Families First and, prior to that, director of the HIV unit of the Georgia Department of Public Health. Holloway, who is a member of Leadership Atlanta’s class of 2020, serves on the advisory council for Agape Youth and Family Center.\nEDUCATION Bowling Green State University (MA)\nHOMETOWN Toledo, Ohio\nINSPIRING PERSON Muhammad Ali\nTOUGHEST CHALLENGE Being temporarily homeless at 15\nFAVORITE BOOK Things Fall Apart by Chinua Achebe\nKimberly Jackson\nExecutive Vice President, Southeast Region\nAmerican Cancer Society\nKimberly Jackson is executive vice president of the American Cancer Society’s Southeast Region, which serves communities in Florida, Georgia, North Carolina, South Carolina, Tennessee, Kentucky, and Virginia. Under her leadership, the Southeast Region serves thousands of cancer patients and caregivers, engages volunteers to support community-based programs, inspires and equips companies to provide healthy workplaces, and raises more than $82 million to fuel cancer research, patient support, and advocacy. A member of Leadership Atlanta class of 2023, Jackson is also involved with the Junior League of Atlanta and Alpha Kappa Alpha Sorority, Incorporated, organizations that share her passion for empowering communities and expanding opportunities for the next generation.\nEDUCATION North Carolina Agricultural and Technical State University\nHOMETOWN Waldorf, Maryland\nTOUGHEST CHALLENGE Hands down—parenting adult children. When they were little, the job was exhausting, but straightforward: keep them fed, safe, and in bed at a reasonable hour. Now? I’m learning the fine art of offering advice without giving lectures, supporting without smothering, and letting them make their own choices—even when I see the potholes ahead.\nWHY I CHOSE THIS WORK I lost my mom to colorectal cancer and was her caregiver.\nErik S. Johnson\nPresident\nRobert W. Woodruff Foundation\nErik S. Johnson was named president of the Robert W. Woodruff Foundation in 2025 after the retirement of longtime leader Russ Hardin, who is now a trustee of the foundation. Johnson directs a broad range of charitable giving as president of the Robert W. Woodruff Foundation, Joseph B. Whitehead Foundation, Lettie Pate Evans Foundation, and Lettie Pate Whitehead Foundation. The foundations primarily support organizations in metro Atlanta. They were created by Robert W. Woodruff, a philanthropist and former president of The Coca-Cola Co., and the family of Joseph B. Whitehead, one of the original Coca-Cola bottlers. Johnson joined the foundation staff in 2006, became treasurer in 2014, and vice president in 2021 before becoming president.\nEDUCATION Emory University, University of Georgia School of Law (JD)\nKwame Johnson\nPresident/CEO\nBig Brothers Big Sisters Metro Atlanta\nKwame Johnson is president and CEO of Big Brothers Big Sisters Metro Atlanta, overseeing the largest and most effective youth mentoring agency in Georgia. Prior to his current position, Johnson served as executive director of the Greater Atlanta Region for PowerMyLearning, where he increased the organization’s revenue by 65 percent and program reach by 115 percent within three years. Johnson has received national recognition for his work including the Social Entrepreneur Program of the Year Award from the Manhattan Institute. In 2023, Johnson was recognized as a top CEO in Georgia Titan 100. A member of Leadership Atlanta’s class of 2020, Johnson received the Atlanta Business Chronicle 2020 Most Admired CEO Award and the Atlanta Business League 2020 Men of Influence Award.\nEDUCATION University of Maryland; NYU, Babson, and Harvard University (Executive Education Certificates in Nonprofit Strategy and Fundraising)\nREASON FOR CHOOSING THIS WORK I found my passion while incarcerated during my senior year of high school. During this challenging time, I decided to change my life and made history by becoming the first youth ever to take my SAT in jail. I was accepted into Hampton University, and, at 19, decided to leave college to become a social entrepreneur and help others through service.\nCheneé Joseph\nPresident and CEO\nHistoric District Development Corporation\nCheneé Joseph is the president and CEO of the Historic District Development Corporation, Atlanta’s oldest surviving community development corporation, which has spearheaded nearly four decades of urban revitalization work in Sweet Auburn. Joseph is past chair of the Atlanta BeltLine Affordable Housing Advisory Board, which provides guidance to Invest Atlanta and the City of Atlanta on the goals and policies related to the use of the BeltLine Affordable Housing Trust Fund and monitors the location and availability of affordable housing throughout the BeltLine. A member of Leadership Atlanta’s class of 2026, Joseph also serves as chair of Clean Sweep Frederiksted in St. Croix, U.S. Virgin Islands.\nEDUCATION Georgia State University, Georgia Tech (MA)\nFAVORITE TRAVEL DESTINATION London, England\nFEW PEOPLE KNOW I grew up in the beautiful Virgin Islands as the eldest of two siblings. Living on the islands, we were surrounded by natural beauty that greatly influenced my interests and passions. This led me to develop a love for architecture and agriculture.\nFAVORITE ATLANTA PODCAST Archive Atlanta\nJay Kaiman\nPresident\nThe Marcus Foundation\nAs president of The Marcus Foundation, Jay Kaiman’s role is to facilitate the philanthropic vision of Bernie Marcus, cofounder of The Home Depot. Marcus died at the age of 95 in 2024. The foundation focuses its giving on children, medical research, free enterprise, Israel, and Jewish causes. Kaiman joined the foundation in 2002. He moved to Atlanta in 1996 to become Southeast director of the Anti-Defamation League.\nEDUCATION University of Florida\nHOMETOWN Pensacola, Florida\nBernice A. King\nCEO\nMartin Luther King Jr. Center for Nonviolent Social Change\nA global thought leader, orator, and peace advocate, Bernice A. King advances her parents’ legacy as CEO of the Martin Luther King Jr. Center for Nonviolent Social Change. Since taking the helm in 2012, she’s guided an expansion of the center’s Nonviolence365 education and training initiative, engaged young people around the country in interactive virtual talks, launched a series of Beloved Community conversations on difficult racial issues, and updated the King Center campus. In 2020 the Congressional Black Caucus Foundation gave King its Phoenix Award, which recognizes individuals who have made significant contributions to society. King’s second Phoenix Award was received in 2023 from the City of Atlanta. It recognizes outstanding achievements and service to the city, state, nation, and world, and is the highest award an individual or group can receive from the mayor of the City of Atlanta.\nEDUCATION Spelman College, Emory University (MDiv, JD)\nNOTABLE ACHIEVEMENTS Spoke in her mother’s stead at the United Nations at age 17, spearheaded the global event Let Freedom Ring and Call to Action to commemorate the 50th anniversary of the 1963 March on Washington, authored Hard Questions, Heart Answers\nFIRST JOB Summer camp counselor\nBEST ADVICE RECEIVED Don’t make a decision in anger.\nRaymond B. King\nPresident and CEO\nZoo Atlanta\nIn 2010, Raymond King became president and CEO of Zoo Atlanta, the city’s oldest cultural institution and one of its largest. During his tenure, King has grown attendance from 675,000 to 1 million annually, and led the institution in raising more than $63 million in philanthropic support to modernize the facilities—more than was raised cumulatively in the past 25 years. King previously spent 22 years with SunTrust Banks, most recently as senior vice president for community affairs in Atlanta, and has chaired and served on numerous boards.\nEDUCATION Georgia Tech\nNOTABLE ACHIEVEMENTS United Way Chairman’s Award (2009), Woodruff Arts Center Charles R. Yates Award for Outstanding Service (2003)\nLauren Koontz\nPresident and CEO\nYMCA of Metro Atlanta\nThe first female president and CEO in the history of the YMCA of Metro Atlanta, Lauren Koontz leads the organization’s efforts to ensure that all people—especially children—experience an equal opportunity to fully reach their potential. She works to make the YMCA a best-in-class provider of education, wellness, and youth development programs designed to strengthen Atlanta communities. Koontz joined the organization in 2012 as its chief development officer and became executive vice president in 2016. Previously she served in leadership roles at Coxe Curry & Associates, Emory University School of Medicine, Mount Vernon Presbyterian School, and the Leukemia & Lymphoma Society.\nEDUCATION University of Georgia, Georgia State University Robinson College of Business (MBA)\nHOMETOWN Saint Simons Island\nNOTABLE ACHIEVEMENTS 2016 recipient of the YMCA’s highest honor: the “Sully” Award, named for Thomas Sullivan, YMCA’s founder in the U.S. Koontz was one of Atlanta magazine’s Women Making a Mark in 2020.\nGaurav Kumar\nPresident\nAndrew J. Young Foundation\nGaurav Kumar is president of the Andrew J. Young Foundation. In this role, he has worked closely with Ambassador Andrew Young to further their mission to feed the hungry and heal the sick. He leads the research, design, and engineering of advanced aquaponics systems and Lemna protein extraction technologies. As Ambassador Young turns 93, he is also leading the foundation to preserve the legacy of Andrew Young in perpetuity. A native of India, Kumar previously worked at the National Monuments Foundation, where he developed the initial plan of the $45 million Rodney Cook Park in Vine City, which opened in July 2021. He also oversaw the construction and placement of the statue of U.S. Rep. John Lewis in the park.\nEDUCATION Birla Institute of Technology and IRIMEE, Jamalpur, India; Georgia State University (MS); IGNOU, India (MA)\nFIRST JOB Engineer at Indian Railways\nBEST ADVICE RECEIVED Self-discipline is the most important discipline.\nHIDDEN TALENT I’m a very good singer and play guitar.\nBUCKET LIST To write a book\nRenée Kutner\nPresident and CEO\nJewish Federation of Greater Atlanta\nRenée Kutner is the president and CEO of the Jewish Federation of Greater Atlanta. A native Atlantan, Kutner has been a driving force within the federation since joining in 2015 as vice president of marketing, where she brought nearly a decade of experience in advertising and marketing to enhance the federation’s reach and impact. She advanced to chief operating officer in 2021, where she not only helped shape the federation’s strategic direction but also oversaw critical operational functions, including finance, internal operations, and governance. The first female CEO of the federation, her achievements have played a crucial role in positioning the federation as a central convener of Atlanta’s dynamic Jewish community.\nEDUCATION University of Michigan, UCLA (MBA)\nFIRST JOB Hebrew school teacher\nFAVORITE SONG ABOUT GEORGIA “The Devil Went Down to Georgia” by The Charlie Daniels Band\nBEST ADVICE RECEIVED You’re only in the right line of work if you can sit at the dinner table and tell your kids about how you are the luckiest person in the world to do what you do…no matter how hard your day may have been.\nTerence Lester\nFounder and Executive Director\nLove Beyond Walls\nFormerly a high school dropout, gang member, and an inmate, Terence Lester is now a storyteller, public scholar, speaker, community activist, author, and the founder of Love Beyond Walls, a nonprofit focused on poverty awareness and community mobilization. Additionally, he serves as the director of public policy and social change and as a professor at Simmons College of Kentucky. Additionally, Lester has spoken about his work on several media platforms including Good Morning America, NBC, and The Bright Side with Katie Couric. His latest book, published by InterVarsity Press, titled, From Dropout to Doctorate: Breaking the Chains of Educational Injustice, was released in 2025.\nEDUCATION American InterContinental University, Atlanta Bible College, Liberty University (MA, EdM), Union Institute & University (PhD)\nFIRST JOB A shoe store in Greenbriar Mall\nBEST ADVICE RECEIVED Never be a public success and a private failure.\nFAVORITE MOVIE Coming to America\nFAVORITE POWER LUNCH RESTAURANT Paschal’s, for its iconic history and the way it brings people together around vision and conversation\nBUCKET LIST Have a film made about my life!\nMilton James Little Jr.\nPresident\nUnited Way of Greater Atlanta\nMilton J. Little Jr. became the first African American president of United Way of Greater Atlanta in 2007. In that role, he’s helped raise more than half a billion dollars for local community needs and redirected the organization’s focus to increasing the well-being of the region’s children. Before joining United Way of Greater Atlanta, the largest United Way in the U.S., Little served as chief operating officer and interim president of the National Urban League. In 2024, the Atlanta Business Chronicle recognized Little as a Most Admired CEO.\nEDUCATION Morehouse College, Columbia University (MA)\nHOMETOWN Roosevelt, New York\nFIRST JOB Busboy at Jones Beach State Park, Long Island, New York. The lesson: Don’t be disagreeable to people who are preparing your food!\nWHY I CHOSE THIS WORK To live a life of service in honor of my parents, who taught me the value of making a difference in the lives of others.\nFEW PEOPLE KNOW I’ve studied Eagle Claw kung fu and the Israeli fighting style Krav Maga for many years, and I meditate.\nMary Pat Matheson\nPresident and CEO\nAtlanta Botanical Garden\nIts leader since 2002, Mary Pat Matheson has built the membership of the Atlanta Botanical Garden to more than 42,000. She spearheaded a $55 million capital campaign, completed in 2012, that doubled the garden to 30 acres and added a visitor center, parking facility, canopy walk, and edible garden. A more recent $50 million campaign provided other enhancements, including a new restaurant and renovated children’s garden. Set to be completed by 2027, as part of a $150 million project, the garden broke ground on its eight-acre expansion which will connect the Atlanta BeltLine to the garden. Matheson was also responsible for the development of a 185-acre satellite garden in Gainesville. She was named board chair of the Midtown Alliance in 2022.\nEDUCATION University of Utah (EMPA)\nNOTABLE ACHIEVEMENTS American Horticultural Society Professional of the Year (2005), Public Broadcasting Atlanta Lexus Leader of the Arts. Past president of the American Public Gardens Association. Responsible for introducing Atlanta to the work of internationally acclaimed artists such as Dale Chihuly, Henry Moore, and Niki de Saint Phalle through garden exhibitions.\nRosalyn Merrick\nPresident and CEO\nAtlanta Habitat for Humanity\nAppointed in 2024, Rosalyn Merrick is the president and CEO of Atlanta Habitat for Humanity. Prior to her current role, as the chief development officer, Merrick successfully generated diverse, record-breaking funds that helped the organization emerge from the pandemic with ample resources to ramp up production and expand its programs. Merrick was at the helm of fundraising efforts when Atlanta Habitat received a $13.5 million donation from philanthropist MacKenzie Scott in March 2022. A native Atlantan and a graduate of Georgia State University, Merrick’s 25-year career includes previous leadership roles at Georgia Community Foundation, Mount Vernon School, The Ron Clark Academy, and United Way of Greater Atlanta.\nFIRST JOB Ruby Tuesday, as a hostess\nBUCKET LIST Now that my husband and I are nearly empty-nesters, I covet vacations with our two beautiful sons more than ever. As their lives become fuller and busier (without us), these moments are rarer and more precious.\nCarol R. Naughton\nCEO\nPurpose Built Communities Foundation\nCarol R. Naughton is the CEO of Purpose Built Communities Foundation, which supports local leaders who are implementing resident-centered, holistic, and cross-sectoral neighborhood revitalization initiatives that create pathways to prosperity for all neighbors. Previously, she served as the executive director of the East Lake Foundation and general counsel and deputy executive director of The Housing Authority of the City of Atlanta where she was a key member of the team creating the legal and financial model to develop mixed-income housing. She started her career as a commercial real estate lawyer in private practice in Atlanta.\nEDUCATION Colgate University, Emory University School of Law (JD)\nFIRST JOB Camp counselor at Tawasentha Park in New York\nBEST ADVICE RECEIVED When someone offers to help, let them.\nWHAT I’D TELL MY 18-YEAR-OLD SELF Train yourself to become a morning person. You’ll get so much more done that way!\nLESSON LEARNED Don’t be afraid to make a mistake. Fail forward and fast.\nMichelle Nunn\nPresident and CEO\nCARE USA\nMichelle Nunn joined CARE USA as president and CEO in 2015 and leads a global team of more than 8,000 people working in more than 100 countries to save lives, defeat poverty, and achieve social justice. During her tenure CARE has taken its fundraising and impact to new levels, including fiscal year 2021 revenue that was the highest in the organization’s history and programs that reached more than 90 million people. Nunn has devoted her career to public service, cofounding the volunteer-mobilization organization Hands On Atlanta, growing it into a national network, and overseeing its merger with the Points of Light Foundation. She served as CEO of the resultant organization, Points of Light—the world’s largest organization dedicated to volunteer service—from 2007 to 2013.\nEDUCATION University of Virginia, Harvard University (MPA)\nFIRST JOB Park ranger. I operated the elevator of the Washington Monument one summer.\nTOUGHEST CHALLENGE Entering into the political arena in my run for U.S. Senate in 2014 was the hardest thing I have ever done. And it was awfully tough to lose. Fortunately, I had family and friends to lift me up and put things in perspective.\nLily Pabian\nExecutive Director\nWe Love Buford Highway\nLily Pabian joined We Love Buford Highway in 2019 as the agency’s new executive director, bringing over 30 years of experience of bridging businesses, consultancy, and nonprofits. As the mission of We Love Buford Highway is to preserve the multicultural identity of Atlanta’s Buford Highway, Pabian is passionate about all things related to culture, diversity, and engagement. As a Chinese American and Atlanta native, she felt like the Buford Highway corridor—an approximately ten-mile stretch of state road internationally recognized for its sizeable immigrant and refugee population, restaurants, and shops—was her family’s first home in the city. Under her leadership, WLBH has raised over $1.6 million to support immigrant communities through food security initiatives, cultural storytelling, youth arts programs, and small business advocacy.\nEDUCATION Georgia State University\nFIRST JOB Chinese Combo King, Lenox Mall\nNOTABLE ACHIEVEMENTS In 2021 and 2022, Pabian was recognized as one of Georgia Asian Times’ 25 Most Influential Asian Americans in the state. Additionally, Pabian was named a Diversity, Equity, and Inclusion Award honoree by the Atlanta Business Chronicle in 2021 and noted among its Power 100, Atlanta’s most influential advocates, in 2022. Pabian is also a wife and mother of three young adults.\nCarlos Pagoaga\nVice President, Global Community Affairs\nThe Coca-Cola Company\nPresident\nThe Coca-Cola Foundation\nCarlos Pagoaga is vice president of Global Community Affairs for The CocaCola Company and president of The Coca-Cola Foundation. In this role, he manages all foundation operations, which includes grant making; financial requirements; and regulatory compliance for domestic and international philanthropy. Previously, Pagoaga served as the foundation’s senior director of circular economy, where he was responsible for directing global recycling initiatives. Pagoaga joined the foundation in 2007. He has directed multiple large grants, such as for Replenish Africa Initiative, Project Last Mile, and the Atlanta Beltline. Pagoaga joined CocaCola in 1990 in Corporate Latin Affairs, where he managed relationships with Latino organizations and elected officials across the United States. He previously served as chairman for the National Hispanic Corporate Council, The Latin American Association and the Georgia Hispanic Chamber of Commerce. A member of Leadership Atlanta’s class of 2009, Pagoaga was born in Havana, Cuba, and raised in Atlanta.\nEDUCATION Georgia State University (MBA)\nKeith T. Parker\nPresident and CEO\nGoodwill of North Georgia\nKeith T. Parker is president and CEO of Goodwill of North Georgia, one of the largest nonprofit organizations in the Southeast. The organization, which celebrated its 100th anniversary in 2025, spans a 45-county territory with 70 stores, 53 attended donation centers, and 13 career centers. Goodwill employs over 3,000 team members, each of whom plays a direct or supporting role in the organization’s donated goods retail operations and its career services. Store revenue enables Goodwill to connect tens of thousands of North Georgians to jobs every year. Before joining Goodwill in 2017, Parker served as CEO of transit systems in several cities, including San Antonio, Charlotte, and, most recently, Atlanta.\nEDUCATION Virginia Commonwealth University (MURP), University of Richmond (MBA)\nNOTABLE ACHIEVEMENTS Member of the Department of Homeland Security’s National Infrastructure Advisory Council since 2016, American Public Transportation Association Outstanding Public Transportation Manager (2015), Texas CEO of the Year (2011 and 2012)\nWHY I CHOSE THIS WORK I love the purity of Goodwill’s mission to put people to work. Nothing changes a person’s life more than finding sustainable employment.\nEric Paulk\nChief of Staff\nProGeorgia\nCommitted to advancing racial justice, LGBTQ rights, and the dignity of communities impacted by HIV, Eric Paulk serves as the chief of staff at ProGeorgia, the state’s progressive civic engagement table. In this role, Paulk oversees organizational strategy, staff leadership, and multi-sector partnerships aimed at building power for historically marginalized communities across Georgia. Prior to joining ProGeorgia, Paulk served as deputy director at Georgia Equality, where he led the organization’s advocacy portfolio, playing a central role in the successful effort to reform Georgia’s HIV criminalization law and pass nondiscrimination ordinances in municipalities statewide.\nEDUCATION Morehouse College, Elisabeth Haub School of Law at Pace University (JD)\nHOMETOWN Fitzgerald, Georgia\nNOTABLE ACHIEVEMENTS Soros Justice Fellow, Open Society Foundations; Yearlong fellowship, Rockwood Leadership Institute; Georgia Trend 40 Under 40; Stonewall Bar Association of Georgia’s Distinguished Service Award; Created the Tyron Garner Memorial Scholarship at the National LGBTQ Bar Association\nTOUGHEST CHALLENGE My toughest challenge came during the Covid-19 pandemic when I lost my grandfather, all of my uncles, and an aunt all on my mother’s side. I found myself stepping into the role of a male elder.\nGigi Pedraza\nFounder and Executive Director\nLatino Community Fund\nGigi Pedraza is the founding executive director of the Latino Community Fund Georgia, a grantmaking public charity dedicated to catalyzing investment and promoting collaborative work in the Latinx/Hispanic community. With 39 member organizations across the state, LCF Georgia amplifies the diverse voices within the community through advocacy, research, and leadership development; builds capacity in community-based organizations, and directly invests in families and Latinx-led member organizations through scholarships and grants. Playing an active role in Georgia’s Latinx community, Pedraza is a social entrepreneur and experienced professional in the areas of general management, strategy, operations, marketing, and development.\nEDUCATION College of Tourism and Hospitality, University of Las Palmas de Gran Canaria (MA)\nHOMETOWN Lima, Peru\nNOTABLE ACHIEVEMENTS Atlanta Business Chronicle Corporate Citizenship Award (2025), Georgia Hispanic Chamber of Commerce Hall of Fame (2020), National Football League Hispanic Heritage Leadership Award (2018)\nFIRST JOB I made clay figurines with my mom to make money in Peru when I was 12-14 years old.\nDantes Rameau\nCofounder and CEO\nAtlanta Music Project\nDantes Rameau is the CEO of Atlanta Music Project, which he cofounded in 2010. AMP provides world-class music training and performance opportunities for youth in under-resourced communities. He leads an organization serving over 1,000 students annually and offering tuition-free programming in band, orchestra, choir, and private lessons. AMP also provides college scholarships and career counseling. AMP’s youth music ensembles and faculty members perform over 60 concerts each year at venues across metro Atlanta, from community centers to the Mercedes-Benz Stadium. In 2024, the AMP Senior Youth Orchestra embarked on its first concert tour abroad to Ottawa, Canada. Also, in 2024 the AMP Senior Youth Choir was crowned the winner of the Youth Choir category at the World Choir Games Open Competition in Auckland, New Zealand.\nEDUCATION McGill University, Yale University School of Music (MM), Carnegie Mellon University (performance certificate)\nHOMETOWN Ottawa, Canada\nFIRST JOB My first job in high school was as a lifeguard at the local YMCA. Having people’s lives in my hands, I learned how to be prepared, how to prevent bad scenarios, and how to take on extreme responsibility.\nFEW PEOPLE KNOW My first language is French.\nJonathan T.M. Reckford\nCEO\nHabitat for Humanity International\nUnder the 20 years of leadership of CEO Jonathan T.M. Reckford, Habitat for Humanity International has greatly expanded its impact. Since taking the role in 2005, local Habitat organizations in all 50 states and in more than 70 countries have seen 100-fold growth in the number of individuals impacted through shelter solutions, with the global Christian housing organization now having helped more than 62 million people. Before coming to Habitat, Reckford was executive pastor at Christ Presbyterian Church near Minneapolis. He spent much of his earlier career in executive and managerial positions at for-profit companies including Goldman Sachs, Marriott, Walt Disney, and Best Buy.\nEDUCATION University of North Carolina at Chapel Hill, Stanford Graduate School of Business (MBA)\nINSPIRING PERSON I had the privilege of calling President Jimmy Carter both a role model and a friend, and he always showed the world what true integrity looked like. President and Mrs. Carter began working with Habitat in 1984, leading a team of volunteers to renovate a NYC apartment building in what became known as the first Jimmy & Rosalynn Carter Work Project. We will continue their legacy by bringing the 2026 Carter Work Project back to Atlanta for the first time since 1988, as it coincides with Habitat’s 50th anniversary.\nAnthony Rodriguez\nExecutive Director\nSouth Forsyth Community Improvement District\nCofounder and Artistic Director Emeritus\nAurora Theatre\nAnthony Rodriguez is the executive director of the South Forsyth Community Improvement District. He previously served as the inaugural executive director of HUB404 Conservancy, a nine-acre “cap park” that will be above GA 400 between Peachtree and Lenox roads and provide a direct connection to MARTA’s Buckhead rail station. HUB404, an estimated $270 million project, is expected to be complete by 2028. At Aurora Theatre, which Rodriguez cofounded more than 20 years ago with Ann-Carol Pence, Rodriguez negotiated Aurora’s $35 million, 59,500-square-foot expansion into the Lawrenceville Arts Center, which opened in 2021. An Atlanta native, Rodriguez is a graduate of the Atlanta Regional Commission’s Regional Leadership Institute, and in 2016 was the first Latino and the first arts leader to serve as chair of the Gwinnett Chamber of Commerce.\nEDUCATION University of Georgia\nNOTABLE ACHIEVEMENTS Vice president of National Alliance for Musical Theatre, Leadership Atlanta class of 2022\nFIRST JOB Running a jackhammer\nHIDDEN TALENT I’m an excellent cook.\nTOUGHEST CHALLENGE Being diagnosed with cancer at 27\nFEW PEOPLE KNOW I jousted at the Georgia Renaissance Festival.\nKaren Romaine Thomas\nCEO\nNational Housing Compliance\nKaren Romaine Thomas serves as the CEO of National Housing Compliance, an organization that provides professional training and compliance services to the affordable housing industry. NHC is also the performance-based contract administrator (PBCA) for the U.S. Department of Housing & Urban Development (HUD) in Georgia and Illinois. In her role as CEO, she sets the strategic direction and coordinates the activities of a talented executive leadership team responsible for the oversight and compliance of approximately 900 federally assisted multi-family properties in Georgia and Illinois. Inspired by her years as a caretaker for her mother, Romaine Thomas is a senior care advocate and serves on the board of Labor of Love Adult Care, a senior care organization headquartered in North Georgia.\nEDUCATION Washburn University, Mercer University (MBA)\nFIRST JOB McDonald’s\nFAVORITE MOVIE Beaches\nFEW PEOPLE KNOW I’m a grammar fanatic.\nLESSON LEARNED Not all relationships are worth saving.\nCarol Sargent Collard\nFounder, CEO\nCaringWorks Inc.\nWith a background in marketing and residential real estate, New Orleans native Carol Collard became a passionate participant in the fight to reduce homelessness while working for a nonprofit developer. In 1998, Collard returned to school to study social work and ultimately earned a PhD in the field. She has worked for more than 20 years in supportive housing and in grappling with the complex issues that can result in homelessness. Her combined expertise has given her the ability to operate a nonprofit agency with a caring heart and a mind for business. At CaringWorks, which she cofounded in 2002, Collard oversees a nonprofit agency that operates supportive housing and behavioral health services, helping nearly 1,000 people escape chronic homelessness a year. A licensed master social worker, the Leadership Atlanta class of 2019 member has also served as a professor of social work at various universities, including Kennesaw State University. Additionally, Collard is the chair of the Georgia Behavioral Health Planning and Advisory Council.\nEDUCATION Loyola University, New Orleans; University of Georgia (MSW, PhD)\nHOBBIES Travel, reading, discovering new restaurants\nJill Savitt\nPresident and CEO\nNational Center for Civil and Human Rights\nJill Savitt, president and CEO of the National Center for Civil and Human Rights, is a longtime human rights advocate with special expertise in genocide prevention. Savitt joined the center in 2019 after working as acting director of the Simon-Skjodt Center for the Prevention of Genocide at the United States Holocaust Memorial Museum in Washington, D.C. Having led the center through the pandemic, Savitt is focused on helping the center fulfill the vision of its founders, evolving from an Atlanta attraction to a national cultural institution focused on rights. The evolution includes an expansion. The center has added two new wings to its iconic building and invested in a range of programming: including civil rights history education, DEI (diversity, equity, and inclusion) experiences for workplaces, human rights training for law enforcement, and commemorations for buried or neglected history.\nFIRST JOB Radio reporter\nINSPIRING PERSON Eleanor Roosevelt\nLESSON LEARNED Change is the only constant.\nCarla Smith\nExecutive Director\nAmerican Heart Association of Metro Atlanta\nCarla Smith serves as executive director of the American Heart Association of Metro Atlanta, the oldest and largest voluntary organization dedicated to fighting heart disease and stroke. Under her leadership, the Metro Atlanta affiliate delivers lifesaving CPR education and training to thousands, connects patients with clinical resources at hospitals and community clinics, advances sustainable community-based initiatives, provides workplace health solutions, and advocates for mission-aligned legislation. Her team also works alongside residents to develop and implement evidence-based, community-driven solutions and is investing more than $8 million in innovative cardiovascular research across the region. Additionally, Smith is a member of Leadership Atlanta’s class of 2026.\nEDUCATION Paine College, University of Georgia (MSW)\nWHY I CHOSE THIS WORK Heart disease is the number one killer of men and women, more than all forms of cancer combined. My father lived with a pacemaker; my grandmother died from a stroke—it’s personal. Collectively we can change the trajectory, now, and for generations to come.\nFAVORITE SONG ABOUT GEORGIA “Georgia on My Mind” by Ella Fitzgerald\nArtis Stevens\nPresident and CEO\nBig Brothers Big Sisters of America\nArtis Stevens is president and CEO of Big Brothers Big Sisters of America, its first African American president since its founding in 1904. Under his leadership, BBBSA has more than doubled its annual revenue, positioning the organization among the top 10 most trusted nonprofits in the country while dramatically expanding its reach considerably to serve more underserved communities. A key highlight of this momentum was his leadership in securing the largest-ever single donation in the organization’s history – $122.6 million – from MacKenzie Scott. A member of Alpha Phi Alpha Fraternity Inc., Stevens was named among the inaugural Time100 Philanthropy 2025 and delivered the 2025 Holmes-Hunter Lecture, named in honor of Charlayne Hunter-Gault and Hamilton Holmes Sr., the first Black students to attend the University of Georgia. He and his wife are parents of two daughters.\nEDUCATION University of Georgia, Valdosta State University (MPA)\nC.J. Stewart\nCofounder and Chief Visionary Officer\nL.E.A.D. Center for Youth\nA former Chicago Cubs outfielder, C.J. Stewart founded the nonprofit organization L.E.A.D.—which stands for Launch, Expose, Advise, Direct—with his wife, Kelli, to empower an at-risk generation to lead and transform their city. For young men who have completed L.E.A.D.’s Ambassador program, 100 percent have graduated from high school and 91 percent have enrolled in college. As founder and CEO of the player development firm Diamond Directors, Stewart has worked with clients including Jason Heyward (former Atlanta Brave), Andruw Jones (former Atlanta Brave), and Peter Alonso (New York Mets).\nWHY I CHOSE THIS WORK Baseball can provide valuable life lessons and access to educational and civic engagement opportunities. Kelli and I committed our lives in 2007 to using baseball as a vehicle to help Black boys in the inner city of Atlanta overcome three curveballs that threaten their success: crime, poverty, and racism.\nFEW PEOPLE KNOW I had the incredible honor of modeling for the nine-foot bronze statue of baseball legend Hank Aaron, sculpted by the renowned artist Ross Rossin. The statue stands proudly in Monument Garden at Truist Park, home of the Atlanta Braves, celebrating Aaron’s legacy for generations to come.\nKelli Stewart\nCofounder and CEO\nL.E.A.D. Center for Youth\nKelli Stewart is the CEO of the nonprofit organization L.E.A.D. Center For Youth, which she cofounded with her husband, C.J. Standing for Launch, Expose, Advise, Direct, L.E.A.D. uses the methodology of sports-based youth development to eliminate racism and advance equity and well-being in youth sports. To date, L.E.A.D. Ambassadors have achieved a 100 percent high school graduation rate and a 91 percent college enrollment and scholarship rate (academic, athletic, and need-based). Stewart also oversees the baseball player development firm Diamond Directors with her husband. Born in Atlanta and raised in rural Oglethorpe County, Stewart is also the first nonprofit leader to serve on the executive board of the Community Foundation for Greater Atlanta where she also cochairs the community impact committee.\nEDUCATION Kennesaw State University Coles College of Business\nWHAT I’D TELL MY 18-YEAR-OLD SELF That all the kids who are bullying you are going through their own special hell at home too. Their attacks are not about you. You are good enough as you are. You don’t have to hang with this crowd and do the degrading things they do to be accepted. And every bit of hell that you’re going through right now won’t kill you, Stay the course. It all works out amazing for you on the other side of childhood.\nCati Diamond Stone\nPresident and CEO\nCHRIS 180\nAs president and CEO of CHRIS 180, Cati Diamond Stone is committed to making trauma-informed mental health services for children, youth, and families accessible to the Atlanta community. Stone joined CHRIS 180 after more than 11 years with Susan G. Komen. As Komen’s vice president of Community Health and a member of the senior leadership team, she developed and executed a national community health strategy that resulted in the development and deployment of focused, best-in-class programming and direct patient support services, positively impacting over 200,000 people. She also previously served as CEO of the Komen Greater Atlanta Affiliate. Prior to her tenure at Susan G. Komen, Stone was an attorney, holding positions including assistant general counsel at Nash Finch Company and litigation & corporate counsel at Unisource Worldwide Inc. She is also a mom to an amazing 16-year-old daughter.\nEDUCATION The University of Southern Mississippi, The University of Alabama School of Law (JD)\nHOMETOWN Guntersville, Alabama (a hidden gem right off the Tennessee River)\nFEW PEOPLE KNOW I’ve been to the top of Mt. Kilimanjaro.\nHOBBIES I’m an unapologetic Shakespeare nerd.\nLaura Turner Seydel\nDirector\nTurner Foundation\nLaura Turner Seydel serves on the board of the UN Foundation, a strategic partner that helps the United Nations mobilize people and resources for collective action. She is also a board member of Project Drawdown, the world’s leading resource for climate solutions. She cofounded Chattahoochee Riverkeeper to help protect the drinking water of more than 5 million Georgians and cofounded Mothers and Others for Clean Air to improve air quality for at-risk populations in metro Atlanta. Turner Seydel is an executive producer of the documentaries Common Ground and the forthcoming Groundswell, which promotes regenerative agriculture as viable solutions for wellness, water scarcity, and the climate and biodiversity crisis. She also serves on the boards of the Turner Foundation, the Waterkeeper Alliance and holds the title of chair emeritus of the Captain Planet Foundation.\nEDUCATION Oglethorpe University\nHOMETOWN Atlanta\nFay Twersky\nPresident and Director\nThe Arthur M. Blank Family Foundation\nAs president and director of the Arthur M. Blank Family Foundation, Fay Twersky leads the foundation’s grantmaking in five collective giving areas: Atlanta’s Westside, democracy, environment, mental health and well-being, and youth development, as well as a portfolio of giving from Chairman Arthur M. Blank’s personal interests, titled founder initiatives. To date, the foundation has provided more than $1.5 billion in grants to organizations nationwide, mostly to organizations that serve Atlanta and Montana. Twersky also serves on the executive leadership team of the Blank Family of Businesses, which includes the Atlanta Falcons and Atlanta United. The Philadelphia native joined the Blank Family Foundation from the William and Flora Hewlett Foundation in Menlo Park, California, where she served as vice president. In 2023 and 2024, Twersky was named to The NonProfit Times’ Power & Influence list.\nEDUCATION University of California-Berkley, MIT (MA)\nHOBBIES Swimming, Cycling\nFAVORITE TRAVEL DESTINATION Jerusalem\nBUCKET LIST Travel to Morocco\nJason Ulseth\nExecutive Director and Riverkeeper\nChattahoochee Riverkeeper\nA Georgia native who grew up fishing and boating on the Chattahoochee River, Jason Ulseth developed an early love for the waterway and the natural environment. In 2015 he took on the role of riverkeeper for the Chattahoochee Riverkeeper organization, serving as spokesperson and lead advocate for river protection. Previously he was CRK’s technical programs director. Ulseth also serves as CRK’s patrol boat captain and is licensed as a merchant marine officer by the U.S. Coast Guard.\nEDUCATION University of Georgia\nHIDDEN TALENT I can juggle swords.\nWHAT I’D TELL A RECENT GRADUATE Public speaking is not as hard as you think it is.\nFAVORITE ATLANTA PLACE TO VISIT Chattahoochee River National Recreation Area\nBUCKET LIST Catching a record brown trout\nPat Upshaw-Monteith\nPresident and CEO\nLeadership Atlanta\nPat Upshaw-Monteith became president and CEO of Leadership Atlanta in 2005, having started with the organization in 1992 as co-executive director. In her time at the helm, she’s participated in the present and future growth of Atlanta by imparting to new generations of leaders the values that have traditionally been central to the area’s success. Previously Upshaw-Monteith served for 13 years as associate general manager of the Atlanta Symphony Orchestra.\nEDUCATION Albany State University, Bowling Green State University (MA)\nNOTABLE ACHIEVEMENT When appointed to my position with the Atlanta Symphony Orchestra, I had the distinct honor of being one of the first African Americans hired in management by a major symphony orchestra.\nFAVORITE BOOK David and Goliath: Underdogs, Misfits, and the Art of Battling Giants by Malcolm Gladwell\nBelisa M. Urbina\nCEO\nSer Familia Inc.\nBelisa M. Urbina is the CEO of Ser Familia Inc., which she co-founded with her husband of 40 years, Miguel Urbina, in 2001. Since then, it has become one of the largest Latino organizations in Georgia. Ser Familia is the leading organization in Georgia providing coordinated multidisciplinary family, social, and mental health services to Latinos. The organization was founded as a response to the lack of resources for Latino families in the areas of family support services and mental health counseling, domestic violence prevention, and crisis management. She has been widely honored and recognized for her work. In March 2023, U.S. Senator Jon Ossoff recognized Urbina and her husband, who were inducted into the Georgia Hispanic Chamber of Commerce Hall of Fame in 2021, for their work with a resolution.\nEDUCATION University of Puerto Rico Río Piedras Campus\nHOMETOWN Guaynabo, Puerto Rico\nFEW PEOPLE KNOW I’m adopted. My biological mom was German, but I was born and raised in Puerto Rico, adopted by a Puerto Rican mom and a Dominican dad. My genes are not Latino, but my heart is 100 percent Latino.\nDePriest Waddy\nPresident and CEO\nCommunity Foundation for Northeast Georgia\nDePriest Waddy was named president and CEO of the Community Foundation for Northeast Georgia in 2022. CFNEG connects philanthropic individuals to nonprofit and community causes that matter to them in metro Atlanta and across the globe, providing nearly $150 million in grants since the organization started in 1985. Previously, Waddy was the CEO of Families First, an organization which was founded in 1890 and seeks to build resilience in underserved communities. Under Waddy’s leadership, Families First improved outcomes for more than 17,000 individuals and families annually by providing them with mental health support, coaching, foster care, adoption, early education, parenting skills, and supportive housing. Waddy joined Families First after serving as executive director of the Jefferson County Committee for Economic Opportunity, a community action agency in Alabama.\nEDUCATION University of Alabama, Kennesaw State University (MBA)\nHOMETOWN Birmingham, Alabama\nNOTABLE ACHIEVEMENTS Leadership Atlanta class of 2022, Georgia Titan 100 (2022), Leadership Gwinnett class of 2016\nFEW PEOPLE KNOW I love to write fiction.\nKyle Waide\nPresident & CEO\nAtlanta Community Food Bank\nKyle Waide is president and CEO of the Atlanta Community Food Bank, overseeing the distribution of approximately $280 million in food and resources each year through a network of 700 local and regional partner nonprofit organizations across 29 Georgia counties. The food bank now operates four Community Food Centers, a growing home delivery program, and a food pharmacy program, in partnership with Grady Health System. Prior to being named CEO, Waide served for three years as vice president of partner operations, leading the organization to record-breaking years of food distribution to the hungry. Prior to joining the food bank, he held several management roles at The Home Depot Inc. Waide currently serves on the board of directors of Feeding America.\nEDUCATION Harvard University, University of Arizona (MFA)\nFIRST JOB As a grown-up, 8th grade teacher in Compton, California\nHOBBIES Golf, Peloton, kid taxi-driver\nDoug Widener\nPresident and CEO\nPiedmont Park Conservancy\nIn October 2023, Doug Widener assumed leadership of Piedmont Park Conservancy. As president and CEO, he is leading the Conservancy as it embarks upon a once-in-a-generation opportunity to expand the park’s acreage, increase public amenities, and implement a master plan to reimagine the park’s 200+ acres while launching a corresponding capital campaign. Officially revealed in 2025, the plan, envisioned to span 10 to 15 years, includes a major expansion at Piedmont Avenue and Monroe Drive, a full restoration of Lake Clara Meer, a redesigned Active Oval and the new Clear Creek Walk—a nature-based corridor aimed at easing Beltline congestion and enhancing north-south connectivity. Prior to joining PPC, Widener served as the executive director of Chicago’s Lincoln Park Conservancy and, before that, as the East North Central Regional Director for the U.S. Green Building Council.\nEDUCATION Ohio University (BBA, MS)\nREASON FOR CHOOSING THIS WORK I love nature and feel that access to nature and open space is a basic need of all of humanity. It connects us to our deeper selves, each other, and other living things.\nFAVORITE BOOK AND MOVIE Catcher in the Rye and Dead Poet’s Society\nFAVORITE TRAVEL DESTINATION Mountains of any kind\nRELIGION\nJonathan C. Augustine\nSenior Pastor\nBig Bethel African Methodist Episcopal Church\nIn May 2025, Jonathan C. Augustine was named senior pastor of Big Bethel African Methodist Episcopal Church, the oldest Black church in Atlanta, following the retirement of John Foster. Prior to Big Bethel, for six years, Augustine pastored St. Joseph AME Church in Durham, North Carolina, while serving on the faculties of North Carolina Central University School of Law and Duke Divinity School, where he was a chaplain to the Duke football team. Prior to leading St. Joseph, Augustine served as senior minister at Historic St. James AME Church in New Orleans. An accomplished author, his most recent books are When Prophets Preach: Leadership and the Politics of the Pulpit; and Called to Reconciliation: How the Church Can Model Justice, Diversity and Inclusion. Inducted into the Morehouse College Martin Luther King, Jr. Board of Preachers in 2024, he also served eight years as the general chaplain of Alpha Phi Alpha Fraternity Inc.\nEDUCATION Howard University, Tulane University Law School (JD), United Theological Seminary (MDiv), Duke Divinity School (DMin)\nPeter S. Berg\nSenior Rabbi\nThe Temple\nPeter Berg became senior rabbi of The Temple, a Reform synagogue in Atlanta, in 2008—its fifth leader since 1895. An advocate for social change, he is committed to teaching, building community, and addressing the needs of his congregants. A chaplain for the Georgia State Patrol, Berg also serves on numerous boards and works with advocacy groups on issues including civil rights, the death penalty, gun safety, and hate crimes.\nEDUCATION George Washington University, Hebrew Union College-Jewish Institute of Religion (MA and rabbinic ordination)\nHOMETOWN Ocean Township, New Jersey\nFIRST JOB Cashier at a thrift store\nHOBBIES Skiing\nFAVORITE TRAVEL DESTINATION Jerusalem\nWHO’D PLAY ME IN A BIOPIC Actor and filmmaker Peter Berg\nLouie Giglio\nPastor\nPassion City Church\nLouie Giglio is pastor of Passion City Church and the original visionary of the Passion movement, which exists “to call a generation to leverage their lives for the fame of Jesus.” Since 1997, Passion has gathered college-aged young people in events across the U.S. and around the world. Giglio is the bestselling author of Seeing God as a Perfect Father, Don’t Give the Enemy a Seat at Your Table, Goliath Must Fall, Indescribable 100 Devotions about God & Science, The Air I Breathe, The Comeback, I Am Not but I Know I Am, and more.\nEDUCATION Georgia State University, Southwestern Baptist Theological Seminary (MDiv)\nHOMETOWN Atlanta, Georgia\nFIRST JOB While in college, I was the person who photocopied articles for researchers and doctors in the Centers for Disease Control (pre-computers) in a tiny room under a stairwell in the back of the library. I learned to do my work as to the Lord knowing He saw it all, and I wanted to do my best! Plus, I may have unknowingly been a part of a major medical breakthrough somewhere in the world.\nMichael R. Griffin\nPublic Affairs Representative\nGeorgia Baptist Mission Board Public Affairs Ministry\nIn 2014, Mike Griffin became the public affairs representative for the Georgia Baptist Convention, representing 1.4 million Georgia Baptists at the Capitol and speaking on religious issues around the state. In April 2010, an Atlanta Journal-Constitution article on “Georgia Influencers” ranked Griffin at 11th among Republicans with the most influence at the Capitol. Having served as a Southern Baptist pastor for over 35 years, Griffin is also a former president of the board of Ten Commandments Georgia and a past vice president of Georgia Right to Life, where he also served as a lobbyist and state field director. He is the former senior pastor at Liberty Baptist Church in Hartwell. Griffin and his wife, Liza, have been married for 47 years; they have four children and ten grandchildren.\nEDUCATION Baptist College of Florida\nWHY I CHOSE THIS WORK The very unique work of being a pastor and a lobbyist goes back to when God called me to preach when I was 16. I preached my first sermon at Dawson Street Baptist Church in Thomasville, Georgia, in 1977.\nNOTABLE ACHIEVEMENTS I have served as a senior pastor in four Baptist churches in the state of Georgia for 35 continuous years. I have served on various denominational positions within the Georgia Baptist Convention in the associational and state level.\nRichard Kannwischer\nSenior Pastor\nPeachtree Presbyterian Church\nThe Rev. Dr. Richard Kannwischer has served as senior pastor of Peachtree Presbyterian Church since January 2017. Before he arrived at Peachtree, Richard was lead pastor at Saint Andrew’s Presbyterian Church in Newport Beach, California, for seven years. He has served as a trustee of all undergraduate and graduate schools he attended, and currently serves on the board of the Fox Theatre.\nEDUCATION Trinity University, Princeton Theological Seminary (MDiv), Fuller Theological Seminary (DMin)\nHOMETOWN Waco, Texas\nWHY I CHOSE THIS WORK To help reveal the delight and impact of a life with God\nBEST ADVICE RECEIVED From former professor Dallas Willard: “God’s primary aim is not getting us into heaven as much as getting heaven into us.”\nHerman “Skip” Mason Jr.\nSenior Pastor\nWest Mitchell Christian Methodist Episcopal Church\nInterim President\nInterdenominational Theological Center\nIn 2024, Skip Mason was appointed interim president of Interdenominational Theological Center. In addition to his role as senior pastor of West Mitchell Street Christian Methodist Episcopal Church, Mason is also a historian, an author, and an educator. He has served as a professor of history, a college archivist, and other positions at Morris Brown College and Morehouse College. A historical consultant on numerous PBS documentaries, he previously served as the director of library services and as an assistant professor of African American history and religion at Voorhees College. He has written more than ten books including Black Atlanta in the Roaring Twenties. The 33rd general president of Alpha Phi Alpha Fraternity Inc., he was on the national board of directors of the Memorial Foundation in Washington, D.C., which led to the completion of the Martin Luther King Jr. Memorial in 2011. Additionally, Mason is the founder of Skip Mason’s Vanishing Black Atlanta Facebook page, which has approximately 65,000 members.\nEDUCATION Morris Brown College, Clark Atlanta University (MLS), Interdenominational Theological Center (MDiv, DMin)\nAndy Stanley\nSenior Pastor\nNorth Point Ministries\nAndy Stanley cofounded the nondenominational North Point Community Church in Alpharetta in 1995 with a vision of creating churches that “unchurched people love to attend.” It’s now one of the largest churches in the nation. North Point Ministries encompasses eight churches in the metro Atlanta area and a global network of more than 180 churches. Stanley’s online messages and sermons are accessed over 10.5 million times a month, and he’s the author of more than 20 books.\nEDUCATION Georgia State University, Dallas Theological Seminary (MA)\nNOTABLE ACHIEVEMENT Named one of the 12 “most effective preachers in the English-speaking world” in a national survey by the George W. Truett Theological Seminary of Baylor University\nRobert C. Wright\nBishop\nEpiscopal Diocese of Atlanta\nRobert C. Wright is the 10th bishop of the Episcopal Diocese of Atlanta, which encompasses 120 worshipping communities in North and Middle Georgia. Wright has been a vocal opponent of the death penalty and an advocate for Medicaid expansion. Additionally, he has addressed the Georgia legislature on gun control. The first African American to become bishop of the Episcopal Diocese of Atlanta, Wright helped establish the Absalom Jones Center for Racial Healing. Before his election as bishop in 2012, he served as rector of Saint Paul’s Episcopal Church in Atlanta.\nEDUCATION Howard University, Virginia Theological Seminary (MDiv)\nLESSON LEARNED The best evidence of strength is the combination of perseverance wrapped in genuine kindness.\nHIDDEN TALENT I am a certified aircraft mechanic with an FAA license.\nHOBBIES Rebuilding old cars\nFAVORITE BOOK The Fire Next Time by James Baldwin\nWHAT I’D TELL A RECENT GRADUATE Reach out! Ask questions! Relax and stay positive.\nBUCKET LIST A trip to Ethiopia\nMichael Youssef\nPresident\nLeading the Way\nIn 1988, Michael Youssef created Leading the Way ministry “for people living in spiritual darkness to discover the light of Christ.” What began as a small, Atlanta-based radio ministry now transmits across the globe in 20 languages on television as well as radio. Youssef also founded the evangelical congregation Church of the Apostles in 1987 with fewer than 40 adult members; today it has a congregation of over 3,000. He is the author of more than 50 books.\nEDUCATION Moore Theological College, Fuller Theological Seminary (ThM), Emory University (PhD)\nLEGENDS\nBillye Aaron\nOriginally an English teacher, Aaron launched her TV career in 1968 as a cohost for WSB’s Today in Georgia, which made her the region’s first Black woman to cohost a daily, hour-long talk show. She also held many leadership positions with the Atlanta branch of the United Negro College Fund. After retiring in 1994, she and her late husband, baseball icon Hank Aaron, started the Hank Aaron Chasing the Dream Foundation to help low-income children with education.\nSally Bethea\nBethea was the founding director and riverkeeper of Chattahoochee Riverkeeper for two decades—helping downstream communities sue the City of Atlanta and forcing it to clean up the river. She has served on the national boards of Waterkeeper Alliance and River Network, the Georgia Board of Natural Resources, and EarthShare of Georgia.\nBill Bolling\nBolling founded the Atlanta Community Food Bank in 1979 and directed it until 2015.\nDuring his tenure, the Food Bank distributed more than half a billion pounds of groceries across 29 Georgia counties. As a charter member of Feeding America, the national network of food banks, he also helped launch food banks across the country.\nAnn Q. Curry\nCurry purchased Coxe Curry & Associates, a fundraising consulting firm, from prior owner Frankie Coxe in 1993, and helmed it until 2015. She has also held leadership positions with the League of Women Voters, the board of Research Atlanta, and Atlanta-Fulton Public Library.\nPlemon T. El-Amin\nEl-Amin became imam (now emeritus) of Atlanta Masjid of Al-Islam in 1985, growing its membership from 200 to more than 2,000; it’s now one of the largest and most progressive mosques in the country. A leader in Atlanta’s interfaith community and a close aide to the late W. Deen Mohammed, El-Amin is former director of Sister Clara Mohammed Elementary and W. Deen Mohammed High schools.\nJames Kennedy\nKennedy is the chairman emeritus and chairman of the James M. Cox Foundation. He is the former CEO of Cox Enterprises, the media company founded by his grandfather.\nCharles H. “Pete” McTier\nFor many decades, McTier led the Robert W. Woodruff Foundation and several other Atlanta foundations funded by the corporate and bottling arms of Coca-Cola. He played a role in the creation of Centennial Olympic Park and the Chattahoochee River Greenway.\nIngrid Saunders Jones\nA past national chair of the National Council of Negro Women, Jones was formerly a senior\nvice president of the Coca-Cola Co. and directed many of the company’s philanthropic efforts, including overseeing contributions of more than $460 million for community initiatives.\nBryant Wright\nWright is the founder and chairman of Right from the Heart Ministries, an international media ministry, and president of international relief organization, Send Relief. He retired as the founding senior pastor of Johnson Ferry Baptist Church in 2019, where he had pastored for 38 years and grown the church to more than 7,300 members.",
  "word_count": 16596,
  "scraped_at": "2026-02-14T12:44:30.718327"
}