{
  "article_id": "01a47222e5a1",
  "url": "https://www.mwcconnection.com/2024/12/3/24308180/mountain-west-odom-danielson-poaching-portal-watts-mendenhall-utah-state-players-week-top-25-aztecs",
  "title": "Mountaintop View 12 - 3 - 24 Odom inspiration , Danielson rant , Player of the Week and more from Monday",
  "date": "20241203T184500Z",
  "domain": "mwcconnection.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Mountaintop View 12-3-24 Odom inspiration, Danielson rant, Player of the Week and more from Monday\nFive years ago, UNLV head coach Barry Odom was on the receiving end of a pink slip, this one from his alma mater the University of Missouri. Now that the “coach firing” season has begun, Odom has words of encouragement for those that either have or will have to clean out their offices and say goodbye.\nAs he gets his team ready for Friday night’s conference championship game against UNLV, Boise State head football coach spoke about 13 of his current players already getting contacted by other schools to enter the transfer portal next week.\nSpeaking about the transfer portal…\nSee who Yahoo Sports says is in the mix for the vacant head football coach job at Utah State along with other potential candidates.\nA sterling debut performance by a freshman QB was enough to be named a double winner along with two Wyoming Cowboys in the final regular season player of the week awards.\nSan Diego State MBB in AP Top 25 newest poll\nFind out about the duo that led San Diego State to victories over two Top 25 teams last week that earned this week’s men’s hardwood honors.\nLast, but certainly not least, here are this week’s honorees from the women’s side of basketball play for their performances last week.\nOn the horizon:\n- Later today: Reacts Survey: Championship Edition\n- Later today: The Good, The Bad, The Ugly: Week 14\n- Later today: The 2024 MWCConnection Season Awards\n- Later today: Hike’s Peak Podcast Episode 80\n- Later today: Class of 2025 Signing Day Tracker\n- Coming Wednesday: Signing Day coverage all-day\n- Coming Wednesday: Peak Perspective: Championship weekend is now the most important weekend.\n- Coming Wednesday: 2024 Best Position Units\n- Coming Wednesday: 2024 Bowl Projections Week 14\nMost Popular\n- Where does North Dakota State Sit in the Early 2026 Mountain West Rankings?\n- Mountaintop View 2-13-26: Boise State-Idaho, NDSU, PAC 12 Schedule, Hawaii, Border War, Nevada Baseball\n- 2025-26 Mountain West Bracketology: Feb. 13\n- 2026 Recruiting Breakdown: San Diego State\n- It’s Time for Mountain West Baseball! 2026 Mountain West Baseball Preseason Power Rankings",
  "word_count": 368,
  "scraped_at": "2026-02-14T13:17:40.358796"
}