{
  "article_id": "01abe68288d7",
  "url": "https://www.bbc.com/sport/rugby-union/articles/czjvgj81y2mo",
  "title": "Canada 13 - 33 England : Red Roses win Women Rugby World Cup",
  "date": "20250927T184500Z",
  "domain": "bbc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "England overpower Canada to win Women's World Cup\n- Published\nWomen's Rugby World Cup final\nCanada (8) 13\nTries: Hogan-Rochester 2 Pen: De Goede\nEngland (21) 33\nTries: Kildunne, Cokayne, Matthews 2, Ward Cons: Harrison 4\nEngland produced a dominant performance to defeat Canada at Twickenham and win the Women's Rugby World Cup for a third time.\nIn front of a record women's rugby crowd of 81,885, the Red Roses, who had lost the previous two finals to New Zealand, laid that ghost to rest with an assured display built on their power up front and ferocious defence.\nThe defeat by the Black Ferns in the previous World Cup final three years ago remains England's last loss as they extended their record winning run to 33 games.\nHaving conceded an early score to flying Canada winger Asia Hogan-Rochester, the hosts and tournament favourites responded through a sensational solo score by Ellie Kildunne.\nHooker Amy Cokayne and number eight Alex Matthews then crossed as John Mitchell's side took control of the final, with Sophie de Goede kicking a penalty to keep Canada within two scores.\nAbbie Ward grabbed the first try of the second half before Hogan-Rochester bagged her second score.\nHowever, Matthews' second try from close range, soon after brave defence had repelled Canada, sealed the game for the Red Roses.\nCanada, who came into the final 95% of the way towards their million-dollar fundraising goal entitled 'Mission: Win Rugby World Cup' - which was set up to help them compete with the world's best-funded teams - comfortably defeated New Zealand in the semi-finals and arguably had played the best rugby in the tournament.\nHowever, on the biggest stage when it mattered most, Mitchell's team outperformed the world's number two ranked side to become world champions for the first time since 2014 - when they also defeated Canada.\nThe result caps a memorable year for women's sport in England after football's Lionesses retained their European title at Euro 2025 in July.\nKildunne's star quality backed up by effective rugby\nIn their semi-final Canada demolished New Zealand in the first half and another impressive start by head coach Kevin Rouet's side was rewarded when Hogan-Rochester went over in the corner after some slick handling.\nHowever, Kildunne made sure the mood was instantly lifted as the dazzling full-back glided past defender after defender to add another wonder try to her collection.\nEngland's star player and out-going World Rugby Player of the Year delivered a momentum shift that Mitchell's side refused to let go of.\nMitchell made clear this week that effective rugby is all that matters when going for a World Cup. Cokayne scoring off a driving maul was the opposite in terms of star quality to the first try, but was just as important.\nWith the home crowd willing England on, Matthews crossed after more scrum dominance as simple and effective rugby continued to bring success.\nEqually effective in the opening half was the hosts' defence, which was typified by captain Zoe Aldcroft stealing the ball back on her own tryline.\nA final first-half eruption from the crowd greeted a turnover from mighty prop Hannah Botterman. England were excellent, efficient and managed the emotion of a massive occasion.\nNone of us could have imagined this - Hunt\n- Published27 September 2025\nTattoos, forfeit hairstyles and Channing Tatum - inside Red Roses' winning camp\n- Published27 September 2025\nEngland finally peak when it matters\nLock Ward - one of the seven surviving starters from the crushing final defeat three years ago - powered over for a vital early second-half score.\nThe Red Roses had their previous record 30-game winning run come to an end when it mattered most in the last World Cup final.\nAnd if England needed any reminding that pre-tournament dominance does not guarantee a World Cup victory, Hogan-Rochester's second sharp finish would surely have reminded them.\nBut Mitchell - a former men's New Zealand head coach - was appointed two years ago to bring a winning mentality to finals rugby.\nHis side were not at their best at times during the tournament but peaked on the big day, delivering what had been missing.\nMatthews' World Cup-sealing try came after aggressive defence to deny Canada a way back into the game, illustrating just that winning mindset.\nCaptain Zoe Aldcroft this week recalled hugging centre Tatyana Heard and crying at full-time in the last World Cup final.\nAfter the final whistle three years on, Aldcroft was holding aloft the World Cup in triumph.\nEngland's Mitchell named women's coach of year\n- Published27 September 2025\nThe celebrations\nLine-ups\nEngland: Kildunne; Dow, Jones, Heard, Breach; Harrison, Hunt; Botterman, Cokayne, Muir, Talling, Ward, Aldcroft (capt), Kabeya, Matthews.\nReplacements: Atkin-Davies, Clifford, Bern, Galligan, Feaunati, L Packer, Aitchison, Rowland.\nCanada: Schell; Corrigan, Symonds, Tessier (capt), Hogan-Rochester; Perry, Pelletier; Hunt, Tuttosi, Menin, De Goede, O'Donnell, Crossley, Paquin, Forteza.\nReplacements: Boag, Kassil, Demerchant, Beukeboom, Royer, Senft, Apps, Seumenutafa.\nMatch officials\nReferee: Hollie Davidson (Scotland)\nAssistant referees: Aimee Barrett-Theron (South Africa) and Clara Munarini (Italy)\nTelevision match official: Leo Colgan (Ireland)",
  "word_count": 842,
  "scraped_at": "2026-02-14T12:36:10.849716"
}