{
  "article_id": "01aeeac80f8c",
  "url": "https://pacific.scoop.co.nz/2024/03/hekari-united-register-first-win-at-ofc-womens-champions-league/",
  "title": "Pacific . scoop . co . nz » Hekari United Register First Win At OFC Women Champions League",
  "date": "20240313T104500Z",
  "domain": "pacific.scoop.co.nz",
  "source_country": "New Zealand",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "gdelt",
  "body_text": "Hekari United Register First Win At OFC Women’s Champions League\nPress Release – Oceania Football Confederation\nLast years runners-up met this years hosts as Hekari United overpowered Henderson Eels to register their first win at the OFC Womens Champions League in what is turning out to be a tightly contested Group A in Honiara. It turned out to be a game …\nLast year’s runners-up met this year’s hosts as Hekari United overpowered Henderson Eels to register their first win at the OFC Women’s Champions League in what is turning out to be a tightly contested Group A in Honiara.\nIt turned out to be a game as eye catching as the teams’ respective kits – Hekari United clad in highlighter red, Henderson in a high-vis green.\nThe Papua New Guinea side came to the party with attacking flair but initially lacked the composure to finish the chances they created, with shots rushed and the final ball snatched. As in their opener against Tafea, Hekari posed the most danger down the left flank, with Marie Kaipu and Phylis Pala playing off each other as they tried to unpick the Eels’ defence.\nThe arrival of the day’s first rain brought with it a temporary reprieve from the humidity and coincided with Hekari striking the opening goal.\nIt was a lovely cross from Michaelyne Butubu on the byline, finding Hekari captain and talisman Marie Kaipu in the penalty area, who finished emphatically, to cheers from the Papua New Guinea club’s fans echoing across Lawson Tama.\nHenderson had a chance to equalise in the 35th minute when Ella Vakatao broke free on a quick counter attack, splitting the Hekari centre-backs, but her lobbed effort sailed just over Fidelma Watpore’s net.\nEels continued to apply the pressure, and were narrowly denied an equaliser as the clock ticked into added time.\nGeorgina Bakani brought Madeleine Arakau down just as Monday’s goalscorer looked certain to bypass the Hekari defence, receiving a yellow card for her troubles. Edith Nari thought she’d restored parity for her side as Watpore fumbled the ball on the line, but the ‘keeper reacted in time to regain control before the ball crossed the chalk.\nEarly into the second period and Hekari United crucially extended their advantage. Anashtasia Gunemba capitalising on Eels goalkeeper Betty Sade’s error to double her sides’ lead and all but put the match beyond the host nation team.\nHenderson Eels worked hard to try and find a way back into the match, with forwards Arukau and Vakatao running tirelessly when released by their midfield on the counter attack, but too often they lacked support and were unable to create chances of note.\nHekari United sealed the result in the 90th minute after a perfectly calculated free-kick from Christie Maneu sailed past the outstretched arms of Sade to give last year’s runners-up an excellent chance of making the semi-finals and the potential to go one better than in 2023.\nHenderson Eels FC: 0\nHekari United FC: 3 (Marie KAIPU 20’, Anashtasia GUNEMBA 53’, Christie MANEU 90’)\nHT: 0-1\nContent Sourced from scoop.co.nz\nOriginal url",
  "word_count": 514,
  "scraped_at": "2026-02-14T10:38:23.687641",
  "_text_extracted": true
}