{
  "article_id": "01b1915d6302",
  "url": "https://www.canberratimes.com.au/story/8339748/wanted-a-green-machine-playmaker-and-a-smile/?cs=14280",
  "title": "Locker Room : Canberra Raiders hunt playmaker as Rob Valetini eyes World Cup | The Canberra Times",
  "date": "20230907T073000Z",
  "domain": "canberratimes.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Read on for the latest news from around the grounds in Canberra sport. We've got options for the Raiders, a big bad Brumby and a soccer star's remarkable rise.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe list of halves on the open market is so small the Canberra Raiders might start putting wanted posters everywhere from Queanbeyan to the south of France.\nEnough to catch the eye of Sam Williams or Mitchell Pearce?\nThe thought of bringing one of those veterans to Canberra is almost impossible to fathom but the Raiders will enter the off-season with just one established NRL playmaker on their books as the hunt for Jack Wighton's replacement ramps up.\nWighton is bound for the South Sydney Rabbitohs - and he is rubbishing every little rumour that says he's going to backflip - while Matt Frawley is packing his bags for Leeds.\nMORE SPORT:\nBrad Schneider will join Penrith after his stint at Hull KR, leaving Jamal Fogarty as the last man standing.\nSo where does Ricky Stuart turn?\nNineteen-year-old Ethan Strange is considered a star of the future. He made his NRL debut at centre but Stuart thinks he plays his best football at five-eighth, meaning Strange could be given a shot at the No.6 jersey next year.\nSebastian Kris has been floated a potential five-eighth but Stuart says his best football comes at centre.\nIf Stuart wants an established half, the Raiders will need to prise a player out of a contract with a rival club to bolster Canberra's playmaking ranks.\nThe future of injury-plagued Wests Tigers five-eighth Adam Doueihi is uncertain as he recovers from his third anterior cruciate ligament tear.\nMatt Moylan has fallen out of favour with Cronulla and the Catalans Dragons have come knocking amid talk Sharks officials would grant him a release for 2024.\nMoylan would be a potential replacement for Pearce if he moved to France as the latter flirts with retirement. But just months ago Pearce outlined a desire to return to the NRL.\nWilliams was named the Canberra Raiders Cup's player of the year and coach of the year after steering the Queanbeyan Kangaroos to the minor premiership.\nThe chances of Canberra making a serious play for Williams or Pearce are very low but either of the pair would offer crucial NRL experience and depth the Raiders crave.\nElsewhere, Kyle Flanagan is set to join his father Shane at St George Illawarra while Jarome Luai is unlikely to earn more than $800,000 if he stays at Penrith beyond next season.\nBIG BAD BOBBY\nWhy so sad, Bobby?\nRob Valetini is about to play in a World Cup and is tipped to be one of the tournament's biggest stars - but in almost every photo we see of the big bad Brumby, he looks like he'd rather be anywhere else.\nWhether he's won a trophy with the Wallabies or he is presenting gold jerseys to Prime Minister Anthony Albanese, Peter Dutton or Anika Wells, you'll be flat out finding a picture of Valetini smiling.\nWe did manage to find one photo of Valetini smiling for the camera - a sight so rare you wonder if the photographer taking the Wallabies' World Cup portraits was Carl Barron.\nBut we'll be more than happy for Valetini to adopt his menacing look when the Wallabies open their World Cup campaign against Georgia in Paris on Sunday morning.\nBecause sprinting to save your limbs in the running of the bulls probably sounds more appealing than trying to tackle Valetini at full tilt.\nSPOTTED\nYou can take Dan McKellar out of the Brumbies, but he'll still promote them to the world.\nThe Super Rugby AU-title winning coach was looking sharp in a Brumbies cap on a trip around Europe.\nHe hasn't coached the club in more than a year and is about to start his new life at English Premiership side Leicester.\nMcKellar was the heir apparent to the Wallabies' head coaching role before Dave Rennie was axed and Eddie Jones brought in on a long-term deal in a move that blindsided some Wallabies staff and players.\nThere is hope within rugby circles McKellar will coach on these shores again.\nUP THE WAHS\nHow likely would you be to sign up for a Raiders or Brumbies tattoo - without actually knowing what it's going to look like?\nThat's exactly what's happening across the Tasman with the New Zealand TAB running a promotion dishing out free mystery tattoos.\nYou put your arm in a hole and pull it out with a Warriors tattoo. Fair to say people on this side of the Tasman probably don't quite realise just how much the Warriors' rise to the NRL's top four means in New Zealand.\nRASO'S REMARKABLE RISE\nFrom playing for Canberra United at McKellar Park to the Ballon d'Or? It's probably a path Hayley Raso never thought she would take.\nRaso has arrived at Real Madrid, joining the Spanish giants after three years in England's Women's Super League with Everton and Manchester City.\nSome rise for the attacking weapon who once plied her trade at McKellar Park and Deakin Stadium and was once warned she may never walk again after breaking three vertebrae in her back following a horror collision while playing for Portland in 2018.\nRaso's name on the list of 30 nominees came from left field but it suggests just how impressive she was for the Matildas in their FIFA Women's World Cup.\nSam Kerr is the Australian more likely to win the sport's highest individual prize after winning the English League and Cup double at Chelsea and helping her country to the World Cup semi-final.\nKerr has finished third in the Ballon d'Or voting in each of the last two years and Spanish star Aitana Bonmati is the favourite to clinch the award this year.\nJust like a nation did during the World Cup, Kerr can dare to dream.\nUNITED BREAK RECORD\nStill on the round ball game, Canberra United have shattered their own membership record almost six weeks out from their A-League Women's season opener.\nA host of people were wondering where to turn when the Matildas bandwagon stopped rolling - and Canberra might be the perfect destination.\n\"It's just such a great environment here in Canberra, we've got the best supporters in the A-League,\" Canberra captain Michelle Heyman said.\nUnited's club record comes after the Canberra Capitals WNBL memberships hit their highest number, with officials now ambitiously targeting sell-out crowds at every game.\nHave your say\n- Have you heard something and want to get in touch?\n- caden.helmers@canberratimes.com.au\nWe've made it a whole lot easier for you to have your say. Our new comment platform requires only one log-in to access articles and to join the discussion on The Canberra Times website. Find out how to register so you can enjoy civil, friendly and engaging discussions. See our moderation policy here.",
  "word_count": 1155,
  "scraped_at": "2026-02-14T12:56:08.687013"
}