{
  "article_id": "01d11a1ff1cb",
  "url": "http://www.voxy.co.nz/national/5/418671",
  "title": "Unity Pitch cherry on top as football fever hits Napier - City Council",
  "date": "20230629T091500Z",
  "domain": "voxy.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "More than 50,000 Kiwi businesses have registered with the national eInvoicing network, a digital shift that promises faster payments and significant productivity gains, Small Business and Manufacturing Minister Chris Penk announced today.\nMr Penk hailed eInvoicing as a “game changer” for small businesses, stating that the move away from traditional paper and PDF invoices could unlock $400 million in annual productivity gains across the country. He emphasised the critical role of prompt payments for smaller enterprises with limited cash reserves.\n“With limited cash reserves, a late or unpaid invoice can quickly throw businesses off track and create a domino effect of challenges,” Mr Penk said.\nTo date, over 160,000 eInvoices have been exchanged through the network, a figure that is rapidly increasing, according to the Minister. He cited reduced administration costs, improved cash flow, greater accuracy, and enhanced protection against fraud and scams as key benefits driving the widespread adoption.\nThe Government is actively supporting the transition, with a commitment to ensure all government agencies processing more than 2,000 domestic invoices annually will have eInvoicing systems in place by the end of this year.\n“Smarter ways of working are key to our plan to lift New Zealand’s economic productivity and improve public sector efficiency,” Mr Penk stated.\n“With more than 50,000 businesses and government on board, eInvoicing has well and truly taken off and will soon be the new normal. I encourage all businesses to switch to eInvoicing so everyone can benefit from this technology.” He added, encouraging universal adoption of the system.",
  "word_count": 253,
  "scraped_at": "2026-02-14T12:28:40.355467"
}