{
  "article_id": "01d77235306f",
  "url": "https://www.pilotonline.com/2024/06/14/tide-swimming-competitors-set-for-u-s-olympic-trials-in-indianapolis/",
  "title": "Tide Swimming competitors set for U . S . Olympic Trials in Indianapolis",
  "date": "20240615T031500Z",
  "domain": "pilotonline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "SWIMMING\nNumerous local swimmers are competing in the U.S. Olympic Trials, which start Saturday in a pool constructed inside Lucas Oil Stadium, the home of the NFL’s Indianapolis Colts.\nIn the women’s 100-meter butterfly Saturday, two swimmers from Virginia Beach and Tide Swimming will compete. The University of Georgia’s Callie Dickinson is seeded 24th and Nikki Venema 36th, according to the “psych sheet.”\nDickinson, from Norfolk Academy, is in her third trials, while Venema, a former Kellam High and Princeton standout who will use her final year of eligibility with Northwestern, is in her second.\nStanford teammates Kayla Wilson and Samantha Tadder, Maddy Hartley, Sophia Knapp of national champion Virginia and Virginia Tech’s Emily Claesson are set to compete later in the week, as is the Florida Gators’ Bobby DiNunzio. Hartley has transferred from Arkansas to Kentucky. All are representing Tide Swimming.\nLOCAL BASEBALL\nPilots lose third game in row\nThe Peninsula Pilots’ losing streak reached three games Friday night with a 7-3 defeat to the Tri-City Chili Peppers before 913 at Shepherd Stadium in Colonial Heights.\nTri-City had 17 hits, though the Peppers (8-11) scored in just two innings — four runs in the first and three in the fifth. Pilots starter Carlos Pena gave up the big first inning and took the loss.\nThe Pilots (11-7), who are in a four-way tussle for the Coastal Plain League East Division first-half championship, got two hits from Henry Garcia and a run and a hit apiece from Cole Stanford and Haiden Walters.\nEvan Bouldin paced Tri-City with a 4-for-5, two-double night. Collin Hughes, who hit a three-run homer in the first, was 3 for 4 with two runs.\nCooper Clapp was 2 for 4 with a homer and three RBIs, and Danny Estrada was 3 for 5 with a run.\nWilson (11-6) and Morehead City (10-6) barely lead the Pilots in the division, and Wilmington (10-7) barely trails them.\nCOLLEGE FOOTBALL\nODU LB Henderson named Preseason All-American\nOld Dominion linebacker Jason Henderson was named a Preseason All-American in Phil Steele’s preview magazine.\nSix Old Dominion players were named to the Athlon and Phil Steele preseason All-Sun Belt teams, the magazines recently announced.\nLinebacker Jason Henderson earned first-team honors by both magazines and was named a preseason first-team All-American by Phil Steele. Defensive tackle Denzel Lowry earned first-team honors by Athlon and second-team from Phil Steele.\nTight end Jalen Butler was named to the fourth team by Phil Steele, while offensive lineman Santana Saunders earned fourth-team honors from both organizations. Isiah Paige earned fourth-team honors as a punt returner by Phil Steele and third-team by Athlon, and was a fourth-team wide receiver by Athlon. Incoming transfer Patrick Smith-Young received fourth-team honors from Athlon at defensive back.\nEleven James Madison players were named to Phil Steele’s selection, including first-team punter Ryan Hanson.\nJMU’s second-team Phil Steele honorees were running back Ayo Adeyi, defensive lineman Eric O’Neill, linebacker Jacob Dobbs and cornerback Chauncey Logan.\nThe third-teamers were receiver Cam Ross, offensive linemen Cole Potts and Pat McMurtrie and long snapper Logan Ketcham, while Washington transfer quarterback Dylan Morris and linebacker Taurus Jones garnered fourth-team distinction.\nCOLLEGES\nTribe hires key staff member\nWilliam & Mary athletic director Brian Mann announced the hiring of Andy Rowdon as the Tribe’s executive associate athletics director for external operations, effective July 10.\nRowdon will oversee brand management, marketing, media relations, broadcasts and streaming, donor and fan experience, creative services, and ticketing and sales. He has spent the last seven years in a similar role at Eastern Michigan.\nA Fredericksburg native who graduated from Virginia Tech in 2002, he was the assistant athletic director for marketing at Old Dominion in 2011-12.\nOld Dominion’s athletic department finished ninth in the nation in community service hours (7,645), as announced by the organization Helper Helper.\nCOLLEGE MEN’S BASKETBALL\nKnee injury forces UVA guard to miss season\nVirginia coach Tony Bennett announced that sophomore Elijah Gertrude will miss the 2024-25 season.\nGertrude injured his right knee in a scooter accident April 30. He underwent successful surgery to repair the knee May 17.\nGertrude, a 6-4, 185-pound guard, averaged 3.4 points and 1.2 rebounds in 16 games last season.\nW&M adds guard\nGuard Luke Kinkade, a 6-foot-2 guard from Neuqua Valley, Illinois, has signed with William & Mary as a preferred walk-on, according to Verbal Commits. The left-hander averaged 14.3 points for the Breakaway team on the Under Armour circuit last summer and frequently takes 3-pointers.\nCOLLEGE MEN’S LACROSSE\nCNU standout from Va. Beach returns as assistant coach\nFormer Christopher Newport standout player Campbell Pozin, who grew up in Virginia Beach and graduated from Norfolk Academy, is returning to the Captains as an assistant coach. He joins a staff led by head coach Mikey Thompson and assistant Zach Thomas.\nPozin played the 2024 season as a graduate student for High Point. He was a first-team Division III All-American in 2022, as well as the USILA National Short-Stick Defensive Midfielder of the Year.\nCOLLEGE BASEBALL\nTribe’s Knowles makes A-A third team\nWilliam & Mary junior pitcher Nate Knowles’ latest honor was being chosen to the ABCA/Rawlings All-America third team. He compiled an 8-3 record while ranking ninth nationally with a 2.48 ERA.\nCOLLEGE WOMEN’S SOCCER\nODU hires graduate assistant\nOld Dominion coach Angie Hind completed her staff with the announcement of Hope Stacker as a graduate assistant coach.\nStacker will be the primary goalkeeper coach. She was a three-time NAIA All-American selection for Indiana Wesleyan, where she set a school record with a 0.879 goals-against average.",
  "word_count": 921,
  "scraped_at": "2026-02-14T13:12:13.544085"
}