{
  "article_id": "02090b82a1ba",
  "url": "https://www.npr.org/transcripts/1171027638",
  "title": "How the AR - 15 became the bestselling rifle in the U . S . ",
  "date": "20230420T224500Z",
  "domain": "npr.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "How the AR-15 became the bestselling rifle in the U.S.\nTERRY GROSS, HOST:\nThis is FRESH AIR. I'm Terry Gross. The other day, I was reading an article in The Washington Post about the blast effect of bullets from the assault weapon the AR-15 and how those bullets blow the body apart. When I finished reading the article, a message popped up saying, you've been on this page for 8 minutes and 14 seconds. It took 11 minutes for the shooter to kill 60 people and injure 869 at a Las Vegas concert in 2017. That was a chilling end to disturbing descriptions of what the bullets did to the bodies of some of its victims.\nThe article is part of an investigation conducted by Washington Post reporters into the history of the assault rifle the AR-15. The investigation tells the story of how the civilian rifle was adapted from the military combat automatic rifle the M16 and how, with the help of clever marketing and lobbying, the AR-15 has become a huge moneymaker for the gun industry, an icon of gun culture, a favored weapon for perpetrators of mass shootings and a flashpoint in the debate about guns in America. My guest, Todd Frankel, is one of the series reporters. He's an enterprise reporter on the financial desk of The Washington Post.\nTodd Frankel, welcome to FRESH AIR. And congratulations on this series.\nTODD FRANKEL: Thank you.\nGROSS: So let's start with if you could list some of the mass shootings that the AR-15 was used as the weapon.\nFRANKEL: Yeah. I mean, any mass shooting that has made the news that we've all sort of - horrified by. You know, the Uvalde shooting down in Texas last year, that involved an AR-15-style weapon. Newtown, most famously, back in 2012 was an AR-15. Parkland, Fla., San Bernardino. The shooting in the movie theater in Aurora, Colo. You know, the Las Vegas mass shooting, the worst mass shooting in U.S. history, involved AR-15s. So, you know, when the death toll gets really high, 10 or more, you know, these horrific things that just you can't look away from and horrify people, usually they involve AR-15s.\nGROSS: Why do mass shooters often choose an AR-15?\nFRANKEL: Yeah, you know, it's something that some of the mass shooters even explicitly spell out, like, in their manifestos they leave behind, like the shooter in the Buffalo mass shooting just last year. I mean, he specifically said, I chose the AR-15 because it's, you know, very good at killing people. You know, it's - as you described in the opening, it's a military weapon that was sort of modified and changed for the civilian market. And it has taken on this aura that is appealing to folks for many reasons, but also for folks who really want to do a lot of harm.\nGROSS: It's easier to keep steady - you know, to keep steady aim with minimum recoil. Why is that an important feature of the gun?\nFRANKEL: Yeah, that was one of the innovations and one of the things that made it so appealing to the military at first was it has this gas impingement system, which technically, basically, means that it redirects some of the energy from a fired bullet to reload the next bullet. And so there's less recoil, less kick on it. It's easier to keep aim, right? So instead of the front of the rifle kicking upwards with each bullet, it's easier to keep it on a constant target. So it's more accurate. You know, it doesn't hurt. It's much easier to shoot. One of the things for folks who want to go out and fire 40 or 50 rounds at a range, you know, to do that with their big old hunting rifle, they'll bruise their shoulder after four or five rounds. The AR-15's sort of famously easy to shoot and doesn't have much kick.\nGROSS: It's got a lot of speed. I learned this from The Washington Post. The speed of the bullet, the bullet would cross six football fields in one second. That's - I can't even fathom that a bullet can go that quickly. So how does the speed of the bullet affect the lethality of the bullet once it enters the body?\nFRANKEL: Yeah, the AR-15 actually shoots a fairly small bullet. It's known as .223 or a 5.56, you know, these technical details. But it's a fairly small bullet, but it has a lot of powder behind it, gun powder behind it. And so it goes incredibly fast. And with that speed and it's - and how small the bullet is, when it hits a body, it sort of - once it goes in there, it doesn't just go right out the other side. You know, you referenced some of the work we did, and we had this animation where it showed the difference between getting shot by a typical handgun round, like a 9-millimeter round versus an AR-15 typical round. A handgun round will go clear through you, that sort of pinhole on both sides. But when an AR-15 round typically hits you, it goes - makes that small entry wound, but then inside, it creates this shockwave, this blasting pattern that blows out the back side of people, causes internal injuries, and it's just devastating. It makes it very effective for a military weapon, but it's horrific when you see these in civilians.\nGROSS: So I want to just describe a little bit more what the impact is in the body. And I just want to offer a little warning for anybody who feels like they can't hear this. It's just one sentence I'm going to say here. But when the bullet enters the body, it can shatter bones, shatter organs and, typically, leaves a gaping hole in the exit wound, which is part of the reason why it's so hard to survive. And then the bodies that were autopsied for The Washington Post story, I mean, there were, like, multiple, multiple wounds, multiple gunshots, multiple bullets that entered their bodies. And, like, there's no way they could have survived this.\nFRANKEL: Right. No, and that's - you know, when you see this at some of these mass shootings, these doctors at hospitals are waiting for the folks to come in, and they come in, but they're already dead, right? It's very difficult to survive getting shot by an AR-15, especially when it involves children, which, you know, is horrific to think about, but it's a reality of these shootings that - it sounds weird to say, but you'd much rather get shot by a handgun than an AR-15 because the wounds that you get - you know, we saw this at Uvalde with the police who were afraid to go in and confront the gunman because they knew what he had. He had an AR-15. And that's not like confronting a guy who has a handgun because the damage from an AR-15 round is devastating. It's unbelievable.\nGROSS: So the AR-15 is the semiautomatic version of the combat rifle the M16, which was an automatic weapon. The M16 was standard-issue rifle in Vietnam. A Pentagon report described the M16 as an outstanding weapon with phenomenal lethality. So what's the difference between the M16, which was first used in combat in Vietnam, and the AR-15, which is being marketed to civilians?\nFRANKEL: They're very similar. The biggest difference is that the M16, the military's rifle, is capable of automatic fire, which means if you pull and hold down the trigger, it'll keep firing bullets, whereas the AR-15 when - anyone can pretty much buy in a store - it's one trigger pull, one bullet. But, you know, it goes as quick as you can pull it. But that's still the main difference. But the gun itself is, functionally, otherwise the same as what is being used by the military.\nGROSS: So how did a weapon that was designed for combat become slightly redesigned for civilians?\nFRANKEL: It's not terribly uncommon for guns to move from market to market. What was unusual in this case is that this weapon, for a while, was not very popular and sort of flew under the radar. And, you know, you're selling a couple of thousand to civilians a year with the nonautomatic version, but then in - only about 20 years ago is when it sort of exploded. And the fact that it now pretty much dominates the rifle market in the U.S. and is one of the most popular, you know, guns, period, sold is what sort of changes the narrative.\nGROSS: So why - like, was it somebodys idea? Can you pinpoint the person who decided, let's take this combat weapon and find a way to mass market it to civilians?\nFRANKEL: It was a gradual thing. No, I don't think there's one person, but it was sort of interesting, right? And I think this was eye-opening to us as we reported this for The Washington Post, is that, you know, the gun industry itself had huge doubts about this gun. They didn't really - they didn't welcome it at its trade shows. They - you know, we spoke to AR-15 manufacturers who talk about the hostility that they faced from other gun manufacturers. You know, like, what are you doing with this weapon that they thought was for - maybe for law enforcement, maybe for the military? But, like, you know, they didn't see it as having a role in the civilian gun market, which was pretty much, like, handguns and hunting rifles, traditional hunting rifles - if you think about, you know, a grandfather's hunting rifle or the one you might see hanging in the back of a pickup truck.\nBut when the assault weapons ban, the U.S. federal assault weapons ban, expired in 2004, no major gun manufacturer actually made an AR-15. And it was a couple of years later that Smith & Wesson, which I think was sort of a pivotal moment, when they decided, you know what? For the first time in our long history, going back to the 1850s, we're going to make not only a rifle. We're going to make the AR-15.\nGROSS: Was that controversial within the gun industry?\nFRANKEL: It was. Again, there was this hostility towards the weapon itself, this sort of military gun. You know, what do ordinary gun owners need with this? But the gun industry itself was suffering several years of flat sales, right? Guns - you know, there's no planned obsolescence with a gun. They last for decades. You know, you can hand them down for generations. And so at some point, you know, you've sold pretty much every hunting rifle and handgun that folks can buy, and they're looking for something new. And Smith & Wesson did this market study looking for new markets to tap into, and they found that there was some interest in this - what they call the tactical rifle market, which was the AR-15.\nGROSS: So, you know, the series mentions a man named Harry Falber who ended up being the head of licensing at Smith & Wesson. And he came from the ad world. He'd been an ad man in big companies. And when he came to Smith & Wesson, he wanted to test out what kind of advertising seemed to work best for Smith & Wesson. So he took out two ads in Guns & Ammo, one a kind of more traditional gun ad and one a gun ad for the AR-15, and basically tried to figure out which consumers responded better to. Can you describe those ads?\nFRANKEL: Yeah. I mean, Harry was a traditional - he describes himself as, like, from the \"Mad Men\" era of advertising. He'd worked for many - Hallmark, Volvo. He'd worked on these very mainstream brand campaigns. And so when he got to Smith & Wesson, they were trying to figure out how to market this AR-15 and also to sell their guns in general. And so he did this study where they placed two ads in Guns & Ammo magazine, and they were very different in tone. And it sort of illustrates the change in marketing that would come with the AR-15 throughout the industry. And one shows two pistols side by side, and the big headline, the tagline, is fine-tuned machines. The other ad showed a police SWAT team officer. He's wearing dark gloves and a tactical helmet, and he's pointing the AR-15 at some unseen target just out of the frame there. And underneath, the big words say, the chosen one.\nGROSS: So two things. In that version of the ad, the chosen one is kind of, like, making the gun into, like, this heroic figure, and also, by advertising, like, you could be like this SWAT team officer who's seen the action, you could have the same kind of thing just as a civilian, not having to join the police, even.\nFRANKEL: Yeah. And that was that sort of darker edge of marketing that at the time was still sort of unwelcomed or sort of challenged in the industry, but now that's pretty much just how guns are advertised. It's this sort of darker, sort of more aggressive, there's a threat out there, and you need to confront it, you know, just like the police do. You can be just like them. And that's mainstream firearms marketing today.\nAnd to Harry - well, the testing, you know, with consumers about how they reacted, they actually found that the fine-tuned machines, the more tame approach was more popular with consumers. But there was something about this other one that really appealed to Smith & Wesson executives, Harry was telling us. And so they actually went in that direction. It was not just choosing the chosen one for that one particular ad, but it was this tenor of advertising and marketing the gun that was different than how they had marketed guns previously. And it was - it's dark. It's sort of threatening. There's this idea that, you know, the appeal is that tactical SWAT teams use it, and the military uses it, not that you can go out hunting turkeys on the weekend with it.\nGROSS: And one of the reasons I think why he spoke out is in 2012, after he decided to leave Smith & Wesson because he didn't like the idea of these assault weapons, just a couple of months later was the Sandy Hook massacre in the elementary school. And he lived just, like, 20 miles away from Sandy Hook.\nFRANKEL: Yeah, he was horrified by that. And his wife worked in education, and I think he was just horrified by the idea that he had played any role in popularizing that gun.\nGROSS: Well, other companies picked up on this tactical weapon approach to advertising the AR-15. Bushmaster had this tagline, consider your man card reissued. So advertising it totally, like, on the idea of, like, masculinity.\nFRANKEL: Yeah. And that was a hugely controversial ad, you know, especially in light of the Newtown mass shooting at the Sandy Hook Elementary. The smaller gun companies - you know, Bushmaster is smaller than Smith & Wesson - take it even further, right? They take this idea that there's this edginess, this darkness to the gun and really using it to push the limits of what, you know, once was acceptable. Now it's sort of mainstream. Now it's - you know, Daniel Defense, which made the weapon that was used in the Uvalde shooting, runs lots of ads with military folks - looking like they're in the U.S. military holding the gun and, you know, use what they use, this whole idea of blending or blurring the line between what is civilian and what is military. And that's huge. That's caught on, and that's really driving the market now.\nGROSS: Well, let's take a short break here, and then we'll talk some more. If you're just joining us, my guest is Todd Frankel, one of the reporters who worked on The Washington Post investigation into the history of the assault rifle the AR-15. We'll be right back after a break. This is FRESH AIR.\n(SOUNDBITE OF SLOWBERN'S \"WHEN WAR WAS KING\")\nGROSS: This is FRESH AIR. Let's get back to my interview with Todd Frankel, the lead reporter on the main story of The Washington Post investigation into the history of the assault rifle the AR-15 - how it was adapted from a combat rifle, how it was mass-marketed to civilians, the profits it made for the gun industry and why it became a favored weapon for the perpetrators of mass shootings.\nSo once these ads were out - advertising like, you could have this kind of tactical weapon; it would, like, assure your masculinity - how did it affect gun sales?\nFRANKEL: Well, gun sales were sort of tepid at first to start. So you had the assault weapons ban that expires in 2004, and suddenly, what was pretty much illegal is now legal. And the gun companies at first are sort of slow to get into it. And it's remarkable. I mean, Smith & Wesson starts to make it. Ruger starts to make the AR-15. Mossberg, which was best known for shotguns, gets into it. Almost every major gun manufacturer got into AR-15s because the sales were great. And one thing that we found that was sort of stunning is that, much more so than any other handgun or hunting rifle, sales of the AR-15 were driven by sort of these societal or political events - Barack Obama's election in 2008, his reelection in '12, civil unrest. The sales of AR-15s are so driven by these sort of outside events. You know, folks are reacting. Fear drives a lot of these sales, I think, in the end.\nGROSS: Yeah, I was surprised to read that after mass shootings, the sales of the AR-15 go up.\nFRANKEL: Yeah, and that's because it's the center of the gun conversation, the gun control conversation, where folks say, well, what are we going to do about - how are we going to address these mass shootings? And someone will say, well, we should ban these assault weapons. And so that's - drives everyone scared on the other side who says - runs out and - guns rights groups play that up.\nGROSS: Like, let's buy an assault weapon before it's too late, before it's banned.\nFRANKEL: Right. Yeah, it's going to be taken. You know, they're coming for your assault weapons, your AR-15. And come and take it - you know, that sort of attitude is on there, too. And so yeah, sales react to that, and folks will just strip gun shops clean of these guns.\nGROSS: You know, we talked a little bit about the ad campaigns for the AR-15. There was also some pretty clever marketing behind them, and one of the facets of that is working with video game manufacturers. So what was that relationship like? How did gun manufacturers get their guns into video games as a way of making people want those guns?\nFRANKEL: Yeah, I mean, there's a very popular video game franchise called Call Of Duty, which is sort of a shooting game, right? And so gun manufacturers, you know, would work with these video game manufacturers to make sure that their guns were included or referenced. And, you know, we even described this one moment in the late 2000s where a video game manufacturer and a gun manufacturer go out to this desert in - outside of Las Vegas to capture the sound - a rifle, AR-15-style rifle, being fired because they want to make sure it's accurate and realistic. And we've talked to gun owners who designed their AR-15s based on what they had used in the Call Of Duty games earlier as - when they were too young to own a weapon, you know? They would then trick out their gun to sort of match what they had used in these video games.\nGROSS: In terms of marketing and sales, another way the gun industry has made profits on AR-15s is through tactical accessories for the guns. What are these accessories, and how are they marketed?\nFRANKEL: Yeah, the AR-15 - one thing that makes it so popular is you can customize it. You know, you could actually change the type of bullets it shoots. You could change how it feels, how it looks. Some folks describe it as Legos for adults because it's so customizable, modular, and you can switch things out. The most popular thing to do - it has this rail system that goes on the front of the barrel that you could pretty much attach anything you want to it. Very popular is, like, scopes for sights, for seeing targets - red-dot scopes which are those things that shoot the little red laser that you sort of see in TV shows or movies. Flashlights you can put on there. There's a very popular meme in the gun world of having an AR-15 with a chainsaw on the front of it just to prove how over the top you can go with this.\nBut you can switch out all the different parts on an AR-15 and sort of make your own gun. And it sort of fed this, a way of sort of tricking it out just like you would trick out a car perhaps, a hot rod. And you could also put stickers on it, right? So you can show your political allegiances or slogans on there as well. It's a - it becomes a sort of expression of their personal identity.\nGROSS: Are there other things that caused sales of the AR-15 to take off? You know, we've talked a little bit about the marketing, about licensing deals with - you know, between the gun industry and video game makers, how gun sales increase after mass shootings and after Democrats are elected to the White House because of this fear - oh, there's going to be an assault weapons ban. I better buy mine now. Are there other reasons why sales took off in the way they did?\nFRANKEL: I think one contributing factor, too, is, you know, in the early to mid-2000s - right? - we are still involved in those campaigns in Iraq and Afghanistan, and there's lots of war imagery coming back to the American public of soldiers carrying AR-15-style - you know, the military equivalents of these rifles. And so you have servicemen who are returning from tours over there, and, you know, lots of service members talk about wanting to use the same gun that they worked and trained with when they were in service. And so there was a confluence of factors sort of driving the popularity. And, you know, the - what we were seeing going on in Iraq and Afghanistan certainly drove some of that demand, too.\nGROSS: Let's take another break here, and then we'll talk some more. If you're just joining us, my guest is Todd Frankel, and he's the lead reporter in the main story of The Washington Post series investigating the AR-15, its history, its use as a mass assault weapon and how it was marketed to civilians. We'll be right back after a short break, and then we'll talk some more. I'm Terry Gross, and this is FRESH AIR.\n(SOUNDBITE OF BILL FRISELL'S \"TWENTY YEARS\")\nGROSS: This is FRESH AIR. I'm Terry Gross. Let's get back to my interview with Todd Frankel, the lead reporter on the main story of The Washington Post investigation into the history of the assault rifle the AR-15, how it was adapted from a combat rifle, how it was mass marketed to civilians, the profits it made for the gun industry and why it became a favored weapon for the perpetrators of mass shootings.\nDo you know how many AR-15s have been sold?\nFRANKEL: Yeah. So the ATF, the federal government, doesn't track the number of AR-15s sold. But using industry estimates and production estimates, there's - about 20 million AR-15s have been sold in, you know, the last couple of decades in the U.S. What's remarkable, though, is that about two-thirds of that number has only come in the last decade itself - right? - so since - basically since Newtown that the demand for this rifle has exploded. And it's been a juggernaut.\nGROSS: Do we know how many Americans actually own an AR-15?\nFRANKEL: The Washington Post conducted a poll that estimated that 1-in-20 U.S. adults, or around 16 million people, own at least one AR-15 in the country.\nGROSS: Despite the success of sales with the AR-15, there were still people within the gun industry, within the gun world, who objected to it. But there was a lot of pressure to keep those people quiet or to kind of push them out. And one example that is written about in The Washington Post series is Jim Zumbo. Tell us about him and the story of what happened when he objected to the AR-15.\nFRANKEL: Jim Zumbo was a well-known personality in the gun world. And, you know, he had a TV show. He had a column in gun magazines. He was just a well-known guy. And this was in the early 2000s - or late 2000s, you know, around 2006, 2007, when the gun is just sort of taking off and the gun industry is still getting sort of comfortable with this weapon itself. And he sort of came out and said, I don't think this is a good gun for hunting. It's still sort of a controversial point, you know, whether the AR-15 - you know, folks who love the weapon will say, oh, yes. You need it. It's perfect for hunting boars. But it's - a lot of folks think that the bullet is so powerful. The same thing it does to human bodies, it does to an animal. It blows it apart. That's not great in general for hunting, especially if you're going to eat the meat.\nAnd so he came out with this, you know, very early on and said, you know, I just don't think - I think he called it a terrorist rifle. And the blowback was immediate. He lost his positions throughout the industry, his TV show, his column. He was sort of cast aside. And it actually became a sort of watchword within the industry that, you know, if you speak out against this gun, you're going to get Zumboed (ph). That's what we found, that finding folks who were willing to speak out about what they saw in the gun industry was really difficult. It's, you know, you're either with us or against us. And that made reporting very difficult. And we found a few people willing to talk with us and describe what they saw. But, you know, there was a lot of fear about being Zumboed.\nGROSS: Have you been to a lot of gun shows over the years?\nFRANKEL: I have, yeah.\nGROSS: And how have the displays for AR-15s changed in that period?\nFRANKEL: It's remarkable. And it's sort of been gradual. But then only when you look at it, you know, over several years that you sort of realize, oh, it wasn't always this way. And I think even folks who are around guns a lot, it's sort of that frog in the pot with the temperature slowly getting hotter. You know, you walk into a gun show or a gun store today and it's, like, black rifles, AR-15s - they call them black rifles - all along the wall and handguns in the display case. And that's pretty much it.\nI mean, again, we have this sort of, I think, still this popular notion of, you know, the hunting rifle, the wood-stocked hunting rifle that you load it, and then you fire it and then you load it again. But what is being sold at gun shows and at gun stores today is a military tactical rifle, black rifle, that can fire, you know, 30 rounds without being reloaded, if not more. But for it to have such market dominance - you know, 1-in-4 guns manufactured these days - it's unmistakable. It's changed everything about the gun industry.\nGROSS: What about gun culture?\nFRANKEL: And gun culture, yeah. I mean, they're sort of intertwined. The gun industry is not a huge industry, but - so they are very closely tied to the culture itself. And, you know, they are making directly what folks want, and that is then reflected back in driving sales. So they sort of go hand in hand. I mean, you know, there's a group called Gun Owners of America. And their mascot - or their logo is a minuteman from the revolutionary times holding a musket. And, you know, there was some discussion - you know, I was talking to folks about this. There's some discussion within the group about changing that minuteman from holding a musket to holding an AR-15, right? So they're putting the AR-15 on that sort of pedestal as the iconic American weapon. And that's where, I think, things have really changed.\nGROSS: So the Sandy Hook massacre in Newtown, Conn., the massacre in the elementary school back in 2012, how did that focus attention on the AR-15, which was the weapon that was used in that assault? One hundred fifty-four rounds were fired. Twenty children were killed. Six school employees were killed.\nFRANKEL: Yeah, that was a pivotal moment, right? You know, I think, for a lot of Americans, it's probably the first time they've really been introduced to this weapon. The wounds in there were devastating, kids, you know, just, frankly, torn apart by what happened in those classrooms. And folks were horrified. There was this - President Obama, you know, I think folks remember some of the speeches he gave immediately after. And then there was that tense standoff with the NRA about, you know, what are we going to do? And that's when they came up - Wayne LaPierre, their head, came up with that line of, you know, the only thing that stops a bad guy with a gun is a good guy with a gun. And there was that whole discussion about arming folks in schools.\nAnd there was that push to then - right? - resurrect the assault weapons ban and, what are we going to do? And that was the talk. And that failed. You know, even some Democrats have voted against that. And from there, that drove sales, too, right? So that happened, the Sandy Hook shooting happened in December of 2012. And an all-time record for FBI background gun sale checks was in that month, as folks, like, ran into gun stores and bought anything they had, but especially bought their AR-15s, believing that a ban was just around the corner. And when the political will behind that sort of faded and failed, I think it emboldened the gun industry then to say, all right, this gun is here to stay. And it became this, increasingly, sort of culture icon - right? - sort of figured where you stood on things is, do you support folks owning this sort of weapon?\nGROSS: There were some large stores, including some chains, that stopped carrying AR-15s, stopped selling them, after Sandy Hook. And the sales increased. There's still a lot of disillusionment about the weapon. How did the NRA and the gun industry push back against that?\nFRANKEL: Yeah. No. I mean, the gun industry, and led by, you know, the NRA sort of leading its - fighting a lot of its political battles, was very worried and really did believe that perhaps some sort of ban was going to be possible. I mean, we've unfortunately become sort of inured to these mass shootings because they just keep happening with such frequency. It's alarming. But Sandy Hook still happened in this moment where it was beyond the pale, right? It was just hard to imagine. And so there was a lot of push. You know, Dick's Sporting Goods sort of famously decided to stop selling the AR-15, although they would backtrack because they would sell it at a subsidiary store called Field and Stream for a little while. And then they - after the Parkland school shooting, they decided to get rid of AR-15s entirely.\nBut the NRA went to some of these stores like Cabela's, you know, these big outfitters, and said - you know, had to reassure them. They're like, yes, you might face pressure. But listen. You have to understand your customer. And that's where it becomes this cultural flashpoint, you know, where your customers, being gun owners, you know, want you to keep selling this, and you don't want to give in to the other side. So, you know, you're going to have to just weather this. And they - a lot of them held on and sort of kept selling it.\nI mean, I find it interesting that Walmart doesn't sell the AR-15 anymore. They stopped in 2015. The biggest retailer in the U.S. doesn't sell this sort of iconic American weapon. They stopped, they claim, because of demand. You know, it just wasn't there. But, you know, retailers - they don't want to be selling the weapon that's used in school shootings, but they also don't want to upset the side that believes that the AR-15 is just as good as any other gun and is important to our constitutional rights.\nGROSS: Didn't the NRA also tell some of the larger stores, you might be boycotted if you stopped carrying this weapon?\nFRANKEL: Right. Yeah. So it's that whole cultural flashpoint where you got to choose sides. Are you with us, or are you against us, right? And you know, for a store that sells outdoor gear and guns as a nice sideline - mostly it's hunting rifles, perhaps, but the AR-15's also in there. They had a tough decision to make. Do we upset our customers, or, you know, do we say, you know what; we don't want to be part of this anymore? And that's what - you know, when Dick's Sporting Goods made its decision to stop selling the AR-15, they faced a ton of blowback and a lot of criticism, and they weathered it, right? I think it sort of shows that it's not a fatal blow for a company, but it's - the stakes are so high, and it's over this one gun.\nGROSS: Let me reintroduce you again. If you're just joining us, my guest is Todd Frankel, the lead reporter of the main story in The Washington Post series about the history of the AR-15, the assault rifle. We'll be right back after a break. This is FRESH AIR.\n(SOUNDBITE OF RHYTHM FUTURE QUARTET'S \"IBERIAN SUNRISE\")\nGROSS: This is FRESH AIR. Let's get back to my interview with Todd Frankel, the lead reporter in the main story of The Washington Post series investigating the history and the marketing of the AR-15 and also why that gun is so lethal.\nHow did gun rights become a top issue for Republicans with often a focus on AR-15s?\nFRANKEL: Especially after the Newtown shooting and you had this sort of standoff between President Obama and the NRA, it was, again, that sort of, are you with us or against us, sort of focus. And it became a political symbol, right? The NRA and Republicans saw that this was something that a lot of Democrats hated. They hated this gun. They hated the look of it. They hated what it had done. And they could campaign and fundraise and drive - it was a cultural wedge issue. It was very a potent one, too, right? I mean, it was pretty dependable, a pretty good predictor of how folks - what political affiliation they had was how they viewed the AR-15 because it had been just filled up with so much cultural significance that you could reliably tell how someone would vote based on their attitude towards this one gun.\nGROSS: So The Washington Post series described the AR-15 as having become a political symbol in campaigns. How has it been used that way?\nFRANKEL: Yeah, it's just - think about those - we see this pop up in the news - those holiday cards from almost, well, certainly only Republican officials holding - their whole family holding an AR-15, you know, even the teenage kids, maybe even younger, holding the AR-15s to the TV ads - political ads where folks are firing AR-15s. You know, they might use to, many a generation ago, fire a hunting rifle to show that they understood that sort of thing. But now it is an AR-15 that carries much more political weight.\nWe had the handful of Republican congressmen and women who wore little AR-15 pins - right? - silver pins on their lapels on Capitol Hill to sort of show their allegiance, their support for gun rights. The AR-15 is very much this sort of signifier of your politics. And it has such a distinct outline of the gun - you know, the sort of clip coming down, the ammunition clip coming down, the long nose and the buttstock on it - that it's instantly recognizable. And so you put on a bumper sticker. You put it on a T-shirt. And you put a slogan with it like, come and take it. And it's a great political signifier.\nGROSS: I want you to tell the story of C.J. Grisham and his use of the AR-15 in a political and an identity way.\nFRANKEL: C.J. Grisham was down out for a walk with his son in rural Texas. And this is in 2013. And he has an AR-15 with him. And he's just walking down the side of this, like, dirt road, gravel road. And he's stopped by the police officer, and the police officer - you know, he says, why do you have this? And Grisham's answer is, because I can. And there's a slight scuffle. It's not a big deal. But he ends up later getting convicted of misdemeanor police interference. It seems like it's one of those things that could have gone away, except there was dashcam video of it. And...\nGROSS: So Grisham's the one who gets convicted.\nFRANKEL: Yeah. And so he is just sort of outraged by the way he was treated. I mean, he's not doing anything. He's just carrying this gun. We have to imagine this is a decade ago, before open carry and these sort of - wearing it to public protests is almost a common thing. So when he did it, it was sort of still like, whoa. You know, what's going on? But he founds this group in Texas called Open Carry Texas advocating for carrying weapons in public. And it sort of just takes off this idea that - and folks would - when they would - they'd start doing these, like, pop-up demonstrations in Texas especially. And they would carry their hunting rifles, their shotguns but also their AR-15s and just go into stores. They would go into Chipotles and Home Depots and just open carry. And it was one of those things that was sort of interesting because this is, again, a decade ago. The Newtown mass shooting had only happened a year before.\nAnd the NRA actually criticized this. They thought it was a little weird. Actually, they called it downright weird that he was doing this. But then their membership got so upset with them that they backed off and said, all right, no, no, we understand what he's doing. And now that idea, that movement of open carry, that you should be able to carry your AR-15 strapped across your chest or somehow not hide it when you're out in public, is - it's pretty commonplace. I mean, again, we've seen these, especially during the COVID lockdown protests at state capitols and stuff, you know, folks who are carrying these big military-looking assault rifles on their chest. And it sends a message, and it sort of changed the tenor of different debates, I think.\nGROSS: The Second Amendment, as interpreted by gun activists and the gun manufacturers, the gun lobby - the Second Amendment is seen as upholding your right to carry any kind of gun. But no matter how you interpret the Second Amendment, it doesn't literally say anything about ammunition, about the bullets. So there's been proposals to limit high-capacity magazines because that would limit the number of rounds somebody could fire off without having to reload, and if they had to reload, might give an opportunity for somebody to tackle the mass shooter. Do you think that if there was, like, a standalone high-capacity magazine ban that was passed federally - do you think that would hold up in the Supreme Court?\nFRANKEL: Well, the ones that - there's a handful of states that have their own high-capacity magazine bans, right? So the idea that you can't, within those states, have a magazine that holds more than 10 bullets is often the cutoff. Some different states have different cutoffs. But those bans at the state level are being challenged and, you know, appealed up to the federal level. And so there's a lot of pressure on whether even those state-level bans will pass. So, you know, it's a fascinating topic because the idea of limiting the number of bullets that someone can hold in a single magazine, it sounds sort of, maybe, what's the point?\nBut there's a lot of research that shows that that's perhaps a very American solution to this issue. If we're not going to get rid of the guns, at least give the folks who are caught in these horrible moments a shot at survival. This happened in Newtown where the gunman had to reload, and when he reloaded - and even though you could be very quick with reloading, even those few precious seconds - they call it a critical pause - some kids escaped. They ran out of the classroom. And the idea that if you interject and require some sort of forced pause in the shooting, that it'll at least limit the carnage. It won't avoid it all 'cause we're going to still have these guns. But at least with a ban on the size of the magazine, you at least give folks a shot at survival.\nGROSS: Do you have children in school?\nFRANKEL: I do.\nGROSS: Do you worry about them? Do you worry about all the school shootings? And, you know, everybody says, I never thought it would happen in my child's school.\nFRANKEL: Yeah. No, of course. Yeah, no, it's - that's the worst. You know, the Post newsroom, we have so many reporters, and we cover all these mass shootings and these school shootings. And some of these reporters have covered multiple mass shootings. You know, I've covered a couple myself and directly, and - it's gut-wrenching, and it makes you - I mean, every parent - see; when you interview the parents - and it's just remarkable, talking to them afterwards about just how do they go on. And you would imagine that the country would do everything in its power to stop this.\nLike - and, again, you can have totally different opinions about how you feel about guns overall, but, like, you would think everyone should be rowing in the same direction of making this almost impossible to happen again. And then you see interviews with, like, that politician in Tennessee who said after the Nashville shooting, he seems sort of resigned that this thing was just going to keep happening. There was - you know, what are you going to do? And I hope most people feel like that's an inadequate answer. That's not enough.\nGROSS: Well, Todd Frankel, thank you so much for talking with us. Thank you for your reporting for the series in The Washington Post.\nFRANKEL: Oh, thank you, Terry.\nGROSS: Todd Frankel is the lead reporter in The Washington Post's main article of its investigation into the AR-15. After we take a short break, John Powers will review a new miniseries called \"Drops Of God\" about a contest set in the world of upmarket wine. This is FRESH AIR.\n(SOUNDBITE OF MUSIC)\nCopyright © 2023 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nAccuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.",
  "word_count": 7532,
  "scraped_at": "2026-02-14T12:02:47.903070"
}