{
  "article_id": "02186e2b2579",
  "url": "https://prowrestling.net/site/2025/11/18/nxt-tv-results-11-18-moores-review-of-tatum-paxley-vs-jacy-jayne-for-the-nxt-womens-title-blake-monroe-vs-sol-ruca-for-the-nxt-womens-north-american-title/",
  "title": "NXT TV results ( 11 / 18 ): Moore review of Tatum Paxley vs . Jacy Jayne for the NXT Women Title , Blake Monroe vs . Sol Ruca for the NXT Women North American Title",
  "date": "20251119T040000Z",
  "domain": "prowrestling.net",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By John Moore, ProWrestling.net Staffer (@liljohnm)\nNXT TV “Gold Rush Night One”\nNew York, New York, at The Theater at Madison Square Garden\nAired live November 18, 2025, on The CW Network\n[Hour One] Arrival shots of Za-Ruca, Blake Monroe, Fatal Influence, and The Culling were shown. A New York themed intro teaser aired to hype up the Gold Rush themed shows…\nVic Joseph and Booker T were on commentary. Mike Rome was the ring announcer…\nEntrances for the opening match took place…\nJohn’s Thoughts: I think AAA traditionally does these as Intergender matches. In WWE it’s “mixed” rules where the men wrestle the men and the women wrestle the women.\n1. Chelsea Green and “All Ego” Ethan Page (w/Alba Fyre) vs. Thea Hail and Joe Hendry in a mixed tag match for the AAA Mixed Tag Team Championships. Vic Joseph noted that Chelsea Green just got off a plane from London to compete in New York. Green blocked an armdrag. Hail used a rana to set up a PK. Hail mockingly forced Green to wave her hands from side to side. Page and Hendry started with chain wrestling with Joe having the upper hand. Hendry then showed off with a Shoulder Tackle and Delayed Vertical Suplex. Green broke up Joe’s pin.\nHail put Page in a Kimura with Green breaking it up. Page and Green went for Stereo bulldogs, but Hail and Hendry escaped. Hail dropkicked Green into Hendry. Joe and Thea did the Zoolander turn heading into break.[c]\nBack from break, Page was dominating with methodical offense on Joe Hendry. Hendry escaped a cravate with a European Uppercut. Page hit Hendry with a high Tae Kwon Do roundhouse kick, followed by a Single Leg Code Breaker for a nearfall. Page kept Hendry under control with a Front Chancery. Hendry deadlifted Page in the submission and escaped with a Snap Vertical Suplex. Hendry rallied with right hands and running strikes.\nHendry hit Page with a huracanrana. Hendry hit Page with his signature Fallaway Slam into the Zoolander turn. Hail dumped Green to ringside and tagged in. Hail hit Page and Fyre with a Top Rope Trust Fall to ringside. Green tossed Hail in the ring. Hail tackled Green in the corner and hit her with an Exploder. Hail hit Green with a Claymore for a nearfall. Hail told Page to suck it when he broek up her pin, and gave him a Superkick.\nHail reversed Green’s UnPrettiHer into a Kimura. Page shoved Hendry onto Hail to break the Kimura. Green hit Hail with an Unpretty Her for the victory.\nChelsea Green and Ethan Page defeated Thea Hail and Joe Hendry via pinfall in 10:41 to retain the AAA Mixed Tag Team Championships.\nVic noted that Green and Page will defend the AAA Mixed Tag Titles this weekend in Mexico…\nJohn’s Thoughts: A fun opener with Hendry and Hail looking good in defeat while Page and Green look strong and continue their greatness of carrying multiple divisions on their back. If you need someone to boost a stalling title, I guess you call on Green or Page? Of the gimmick titles, the Mixed Tag Team titles, I feel, are a safe title to promote on TV because they bring something different and we’ve seen success in the mixed tag division several years ago when WWE did the mixed tag challenge (The timed gimmicks like the Speed and Heritage titles never picked up real steam).\nLola Vice and Jordynne Grace were hanging out backstage. Vice was peeved about having to face Page and Green in AAA. Vice and Grace then talked smack about Kelani Jordan. TNA Knockouts Champion Kelani Jordan showed up to gloat about being champion.\nThe CM Punk WrestleMania ad aired…[c]\nAnother John Cena Last Time is Now interview clip aired where Cena addressed his divisive crowd chants. Vic Joseph noted the full interview will be available on YouTubbe the week of Cena’s last match…\nTatum Paxley was with The Culling in a stairwell warming up…\nThe show cut to NXT GM Ava who hyped up NXT’s final PLE of the year, Deadline. Ava then hyped up the special gimmick match of the show, The Iron Survivor Match. Ava noted that WWE legends used to pick the wrestlers in the match, but this time one person will pick the wrestlers in the match. Ava said WWE Intercontinental Champion John Cena will be picking the Iron Survivor wrestlers next week on NXT…\nRapper Lil Yachty was shown in the crowd…\nVic Joseph and Booker T checked in from the commentary desk. Vic sent the show to Sarah Schreiber interviewing Tavion Heights. Heights said 2025 was wild for him. He said he had quite the journey coming from the Olympics to WWE. Heights said it was time to lock in at New York City. Heights said he learned more from being in NQCC than he did in the Olympics (Okay?).\nHeights then made his sales pitch to John Cena to pick him to be in the Iron Survivor Match. Josh Briggs showed up from nowhere and attacked Heights. Heights and Briggs brawled from the crowd to the concourse. Referees ran out to break both men apart (Dot Net Contributor Don Murphy messaged me to say he was near where this brawl was happening. Hopefully he wasn’t near any danger similar to when Santos Escobar and Judas Mesias almost tackled me several times during a crowd brawl segment in Los Angeles)…\nSol Ruca was gearing up backstage. Zaria asked Sol if she was okay with wrestling after her injury. Sol claimed she was fine and she has to win the North American Championship…\nNXT Women’s North American Champion Blake Monroe made her entrance heading into break…[c]\nNascar racer Jessie Love was shown in the crowd…\nSol Ruca made her entrance with Zaria…\n2. Blake Monroe vs. Sol Ruca (w/Zaria) for the NXT Women’s North American Championship. Sol converted a Collar and Elbow into a side headlock takedown. Sol got a two count after a Sunset Flip. Sol hit Blake with a Enzuigiri. Sol grazed Blake with a Wrecking Ball Kick. Blake hit Sol with a Slingblade and Helicopter Sidewalk Slam for a nearfall. Sol came back with a Helicopter Flapjack and Superkick for a nearfall.\nBlake slammed Sol to the mat by the hair. Blake worked on Sol’s braced injured leg with a heel hook. Sol used a innovative backflip and shotgun dropkick to escape. Blake sidestepped Sol and slammed the braced leg into the ringpost. Sol got a moment of respite after dragging Blake into the ringpost and then taking her out with a running clothesline at ringside.[c]\nBlake was working on Sol’s injured leg with methodical offense during the break. Back from break, Blake had Sol in a Heel Hook on the injured leg. Sol escaped with a Rear Naked Choke. Sol parried and striked Blake. Blake gained control after tripping Sol on the injured leg. Sol rallied back with running uppercuts and a Snap German Suplex. Sol hit Blake with a Missile Dropkick.\nSol did a single legged kip up while selling the knee. Vic noted that Sol has a history of leg injuries in NXT. Sol hit Blake with a running knee for a nearfall. Blake tripped Sol during a Sol Snatcher attempt. Sol caught Blake with a Superkick for a moment of respite. Sol hit Blake with an impressive run-off Triangle Moonsault. Blake regained control after a Chop Block on Sol’s injured knee. Blake synched in a Half Crab while wrenching on Sol’s knee brace.\nBlake broke the hold and attacked Sol’s injured knee. Blake pulled off the brace and chucked it to the ramp. Sol rolled up Blake for a good nearfall. Sol’s knee gave out on her and Blake went for a heel hook. Zaria tossed someone aside and picked up the white towel. Blake torqued in the submission and Zaria threw in the towel.\nBlake Monroe defeated Sol Ruca via white towel forfeit in 13:20 to retain the NXT Women’s North American Championship.\nJohn’s Thoughts: HBK really likes his white towel forfeit matches as he’s the only booker I see constantly use that finish in NXT and NXT UK. Makes sense, as HBK really likes his melodrama and the white towel is a excess melodrama spot. At least they didn’t telegraph it this time with Zaria not randomly holding it like Checkov’s Gun like they’ve done in the past. The match was really good and made fun with Sol’s innovative offense. I do have my fears with the storytelling direction of this story. My guess is Zaria wins the Speed Title next week. My fear is that after all is said and done, Zaria will continue to be a dopey babyface while Sol Ruca turns heel and via optics it should be the other way around.\nFatal Influence were warming up backstage all gloating about their upcoming title matches. Jayne’s going after the Women’s Title, Henley’s going after the Speed Title, and Lainey is going after the Evolve title…\nA replay aired of Oba Femi approaching Ricky Saints after NXT closed last week. Ricky Saints was then shown walking backstage…[c]\n[Hour Two] NXT Champion Ricky Saints made his entrance in street clothes. Former NXT Champion Oba Femi made his entrance shirtless and with his hands taped up. Ricky took the mic and welcomed Oba back. He said he wasn’t surprised that Oba would come back to confront him. He said what was a surprise was Ricky even beating Oba in the first place. Ricky said it wasn’t a shock to him because “I’m Ricky Saints”. Ricky said Oba thought he was going to steamroll him and make Ricky a footnote.\nRicky said he saw the grind taking control of Oba and he stepped up. Ricky while Oba was in Nigeria, Ricky was defending NXT from TNA and whooping Trick around. Ricky said the people like that Oba’s back but he shouldn’t get it twisted that he’ll take the title back from Ricky. Oba said Ricky is the same and hasn’t changed, with the same bravado, flamboyance, and being a little man. Oba said he wants to beat the same Ricky that got the better of him.\nHe said that’s why he took his time. He said he didn’t want to get involved in the TNA nonsense or Ricky and Trick trying to dress better. Oba said all that is beneath him. He said he went back to the motherland to go train and be a version of Oba that Ricky can’t beat. Oba said that Ricky had his moment in the sun but the sun of the Absolute era will soon set. Oba said that the ruler is back, the destroyer is back, the bringer of war is back, and Ricky’s daddy is home.\nThe crowd cheered Oba. Ricky said of Oba wanted a rematch at Deadline, he has it. Ricky and Oba then faced off. Before the segment could end, Trick Williams made his entrance. Trick said he told Ricky for a few months that it’s not over until he wins the championship back. Myles Borne showed up and hit Trick in the back with a steel chair. Borne said “you’re done. Payback? A bitch!”. Borne said he’ll win Iron Survivor and he’ll see Oba or Ricky at New Years Evil…\nVic hyped the tag team title match for after the break…[c]\nJohn’s Thoughts: A solid segment and awesome return promo for Oba Femi. WWE should take note of this crowd reaction in terms of having patience in keeping a person off TV to maximize the pop upon return. Oba was able to come back fresh and say he had his own off-screen Rocky 3 training arc (similar to what Tony D’Angelo did against Oba). Ricky vs. Oba was a bit underwhelming at the last PLE, partially due to the rest of the card outshining them. Let’s see how they do coming off the run-back?\nGM Ava berated Borne backstage for attacking Trick. Borne pointed out he waited a week. Ava then booked Borne and Trick for next week…\nThe camera cut to Briggs and Heights still brawling backstage. Briggs got the upper hand by giving Heights a Uranage through a table…\nEntrances for the tag team title match took place…\n3. “DarkState” Dion Lennox and Osiris Griffin (w/Cutler James, Saquon Shugars) vs. Je’von Evans and TNA X Division Champion Leon Slater for the NXT Tag Team Championships. Slater and Evans hit Dion and Griffin with consecutive Stereo Superkicks. Evans hit Shugars, Cutler, and Griffin with a dive. Slater hit Dion with a kick for a nearfall. Griffin tagged in and hit Slater with a power slam. Evans broke up Griffin’s pin. Evans dumped Griffin to ringside and did a leap to the announce table to kick Griffin.\nEvans hit Dion with a huracanrana and dropkick for a two count. Slater tagged in and tossed Evans into Dion for a rana. Slater and Evans hit Griffin with Stereo Dropkicks. Slater and Evans hit DarkState with stereo dives heading into break.[c]\nDarkState cut the ring in half on Evans. Evans got his window of opportunity after a superkick and Knee Plus on Dion. Slater and Griffin tagged in with Slater cleaning house. Slater hit Griffin with a handstand back elbow. Slater hit Griffin with a high crossbody for a two count. Evans tagged in and hit Griffin with a flip overhead kick. Slater hit Dion with a Blue Thunder Bomb.\nSlater hit Dion and Griffin with a Corkscrew Plancha over the ringpost. Evans hit Griffin with an RKO. Evans hit Griffin with a Frog Splash for a good nearfall. Slater knocked Shugars off the apron, but Griffin ran through him. Dion and Griffin hit Slater with a double power bomb. Evans accidentally gave Slater a Frog Splash after Griffin was dragged away. DarkState hit Slater with a Doomsday Device to pick up the win.\nOsiris Griffin and Dion Lennox defeated Leon Slater and Je’von Evans via pinfall in 11:08 to retain the NXT Tag Team Championships.\nKendal Grey and Wren Sinclair were chatting backstage about Kendal Grey defending the Evolve Women’s Title on Night 2 of Gold Rush. Wren said it was odd to see Charlie Dempsey in TNA last week because she thought he was still in Japan?…[c]\nJohn’s Thoughts: A decent tag team match with the miscommunication in the end allowing DarkState to retain the tag titles. DarkState’s booking has been weird as they are booked like bumbling idiots leading up to this match, but they plucked out a win as heels. Hopefully NXT finds a good direction to push them as right now they seem all over the place in a confusing way. I wonder if Evans accidentally hitting Slater with the splash is a set-up for WWE getting that banger Slater vs. Evans MOTY-type match on one of WWE’s PLEs where the last one happened on TNA’s?\nAnother clip from the John Cena interview aired, where Cena talked about his big Royal Rumble return after that big injury many years ago…\nA promo aired from WWE LFG Season 2 winner Shiloh Hill. Hill was typing on a computer. He talked about being a athletic and technology standout at Stanford. Hill talked about how he got into Stanford by doing online classes and getting into science and conspiracy theories. He said he also got the love for hurting people via football. Hill teased more to come…\nJohn’s Thoughts: Hill got some buzz by being a legit Tik Tocker who’s into the conspiracy theory and alien stuff. That can actually make a pretty fun wrestling gimmick and he already sounds well spoken.\nVic Joseph ran through the advertised Gold Rush Night 2 card…\nA hype package aired for next week’s Evolve Championship match between Jackson Drake and Sean Legacy…\nFatal Influence made their entrance…[c]\nVic Joseph hyped the WWE throwback LJN action figures…\nZaria and Sol Ruca were backstage where Zaria was defending looking out for Sol’s well being. Zaria called Sol’s pride stupid. Sol said her pride is what made her a double champion. Zaria said Sol can’t be champion if she’s injured. Zaria said they can shelve this conversation until after she wins the Speed Title next week. Sol walked away after shoving the white towel into Zaria’s chest…\nJohn’s Thoughts: Again, all signs point to Sol turning heel and I’m not the biggest fan of it due to Sol being such an exciting wrestler to watch and Zaria having that strong debut as a heel (which Booker T lampshaded on last week’s episode by pointing out how great Zaria’s debut was). This is NXT though and maybe Sol and Zaria might surprise us in the experimental roles.\nThe Culling made their entrance. Mike Rome handled the formal in-ring championship match introductions…\n4. Tatum Paxley (w/Shawn Spears, Niko Vance, Izzi Dame) vs. Jacy Jayne (w/Lainey Reid, Fallon Henley) for the NXT Women’s Championship. Tatum dominated the chain wrestling and rallied with right hands. Jayne hit Tatum with a hurcanrana. Tatum came back with chambered kicks. Tatum knocked Jayne off the apron and then hit Fatal Influence with an Asai Moonsault heading into break.[c]\nJayne was dominating the match with methodical offense, with seven minutes left at the top of the hour. Jayne hit Tatum with a Frankensteiner. Paxley got a moment of respite after a stiff superkick on Jayne. Tatum and Jayne traded Yay-Boo right hands with Tatum getting the rally. Tatum hit Jayne with a German Suplex. Tatum hit Jayne with a step up Enzuigiri. Tatum hit Jayne with a Harlem Hangover for a nearfall.\nTatum staggered Jayne on the top rope with a step up Enzuigiri. Tatum hit Jayne with a Superplex into a Spinebuster for a nearfall. Tatum slapped away the chair Izzi handed her. Jayne rolled up Tatum for a two count. Paxley hit Lainey with a Wrecking Ball kick. Jayne hit Tatum with a PK from the apron. Jayne hit Tatum with the Rolling Encore. Tatum kicked out of Jayne’s finisher.\nThe referee stopped Jayne from using the title. Tatum slipped to ringside. Spears and Vance prevented Tatum from entering the ring. While the referee was distracted with Jayne, Izzi hit Tatum with a Yakuza Kick. Jayne hit Tatum with the Rolling Encore for the victory.\nJacy Jayne defeated Tatum Paxley via pinfall in 11:28 to become the new NXT Women’s Champion.\nJacy Jayne celebrated her win up the ramp to close the show…\nJohn’s Thoughts: A solid match with Tatum continuing to show good proficiency at her match finishes. I thought she gained out of kicking out of Jayne’s finisher. I do raise a bit of an eyebrow of Izzi turning on Tatum so soon. I thought there was storyline potential out of Izzi letting Tatum put down her guard in front of her as an impetus to Izzi getting the title. Instead, we’re getting the standard betrayal storyline that doesn’t add as much nuance and ethos to Izzi. Could be fun though and I hope Izzi and Tatum find a way to make this feel more than just a standard feud.\nOn the other side, I do like Jayne continuing to roll on as she has earned all of our respect as a credible wrestler after initially being a fluke champ. Jayne winning also sets up a potential “draped in gold” scenario for next week if they want to go that direction (I’ll try my best to avoid spoilers, but I also assume that if I didn’t hear anything, nothing happened). A solid themed episode with a good crowd in the MSG Theater. A PLE format, but a step below given the matches didn’t have the elbow room of being off Network TV. Notable with the title change in the end at least. I’ll be by in a bit with my member’s exclusive audio review for the Dot Net Members and Patreon Patrons.",
  "word_count": 3320,
  "scraped_at": "2026-02-14T12:59:07.440765"
}