{
  "article_id": "022ef3b58de1",
  "url": "https://www.dailymail.co.uk/news/article-13580583/migrants-massing-Calais-astonished-Britain-France-heading-one-direction-SUE-REID.html",
  "title": "Ive never seen so many migrants massing in Calais . I am astonished",
  "date": "20240629T014500Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "I've never seen so many migrants massing in Calais. I am astonished. As Britain looks set to lurch Left and France to the Right, they'll be heading in one direction soon, writes SUE REID\nHis arm linked tightly in mine, the young African man in flip-flops leads me down a steep path to a secret new migrant camp in northern France.\nMy guide is a 24-year-old from Sudan called Omer, who has been waiting for a year in the ferry port of Calais to catch a ride on a boat or lorry to Britain.\n'My dream is to reach your country,' he says as he brushes down an old canvas chair for me to sit on amid piles of refuse and empty water bottles at the shanty camp.\nPoignantly, his dirty trainers have been placed tidily outside his tent which has been provided by a charity.\n'I refuse to stay in France where they hate us. There are so many migrants. More come every day. The French only want to get rid of us to Britain.'\nSue Reid talks to 24-year-old Omer (centre), who dreams of reaching the UK, and a group of migrants in Calais\nA throng of migrants head towards woodland at Coquelles, not far from Channel beaches\nI first met Omer on Wednesday near the centre of Calais walking down a street with four other twentysomething Sudanese men, who also aim to reach the UK.\nThey agreed to show me their living quarters, three miles away in woodlands off a narrow country lane called Rue de Judee on the outskirts of the city.\nWhen I get there, after following a map pin sent by Omer from his mobile phone, he greets me on the roadside.\n'You are the first person to see inside this camp apart from migrants like me,' he says. 'There are 50 of us here from the Sudan.'\nHis friend Ahmed, 21, adds: 'We want to come to London to play football for the Chelsea club and make ourselves a better life.'\nTheir words bring to mind Rishi Sunak's warning that if Labour wins Thursday's election, throngs of illegal migrants in France will seize the chance to cross the Channel.\n'I can tell you they are queuing up in Calais waiting for a Starmer government so they can come and stay here,' he said this week. 'They will be out on our streets putting pressure on public services.'\nGiven that some 50,000 incomers from sub-Saharan Africa, the Middle East and Balkan nations have crossed the Channel since Mr Sunak became Prime Minister in October 2022, he cannot claim to have solved the problem himself.\nBut the fact is I have never seen so many migrants massing here before.\nI have been reporting from Calais ever since a Red Cross refugee centre was first set up at the port in 1999, marking the start of the migration crisis in Britain. It operated for three years before being closed down by the French authorities at the request of the British government.\nI was writing about the crisis when, in 2016, France pulled down a migrant camp known as the 'Jungle' that had sprung up near the port, forcing those waiting to get to Britain to spread out along the northern French coast.\nWith the help of the smuggling gangs that soon embedded themselves in France, they began to jump on small rubber boats to Britain, paying £3,000-a -head for the 21-mile ride across the Channel.\nBut despite my many years covering the story I was frankly astonished by the numbers congregating in Calais this week.\nSome in Britain have suggested the increase is down to the looming prospect of a Labour government with policies that are soft on immigration.\nBritain has seen around 13,000 migrants come into Dover on small boats already this year, with 257 people making the journey on four traffickers' craft last Sunday alone\nAfter all, Sir Keir Starmer's party is promising to scrap the Rwanda deportation plan and allow those arriving on smugglers' boats to apply for asylum, an option currently banned under the Tories' Illegal Migration Act.\nBut the vast majority of the migrants here have never heard of Keir Starmer. When I asked Omer and his friends about him, they looked at me in bewilderment. A photo on my mobile phone of Starmer elicited a blank stare.\nAnother group of young Sudanese migrants squatting at a derelict former wine warehouse in Calais were equally ignorant of the political turmoil gripping both Britain and France, as both countries face national elections in which immigration is a central issue.\n'What is an election,' asked Musad, the only one who spoke English.\nAnd yet the confluence of these two elections could nevertheless dramatically increase migration in Britain, sending the number of small boats higher still.\nFor it is not just that a Labour victory on Thursday might make it easier for the likes of Omer to cross the Channel.\nIt is also that the election in France, the first round of which takes place tomorrow — to be followed by a second poll on July 7 — could usher in a hard-Right Prime Minister called Jordan Bardella, the poster-boy protégé of Marine Le Pen's National Rally party, which is determined to crack down on France's own migrant numbers.\nIf National Rally wins, it promises to stop what it calls the 'invasion' by Muslim migrants, such as Omer. Radical mosques will be closed and women will be banned from wearing the burqa or a headscarf in public places, including the street, in what the Middle East Eye, an influential magazine based in London, this week said was an effort by France to 'demonise followers of Islam'.\nAnd while most migrants themselves may be ignorant of all this, the people smugglers are only too aware of the political forces at work.\nThey will be sensing a business opportunity as more migrants look to flee from a hostile hard-Right France to a more welcoming socialist Britain.\nWatching election developments in Britain and France in Calais this week was Pierre-Henri Dumont, a local MP for the liberal-conservative Republican Party. It is opposed to Bardella's National Rally, which is predicted to emerge as the largest party in the National Assembly following the French election.\nSue visits the migrants' living quarters in woodlands off a narrow country lane called Rue de Judee on the outskirts of the city\nA rally organised by the Nouveau Front Populaire Party in the centre of Calais\nMonsieur Dumont believes the flow of migrants to the UK from France will continue to rise. 'Even if the migrants are stopped by sea, these smugglers will find another way to send them to you.\n'They will use planes to fly them into small airfields. They will hire speed boats, charging special VIP prices. It is impossible for France to stop the gangs who now have a stranglehold on the crossings.'\nBritain has seen around 13,000 migrants come into Dover on small boats already this year, with 257 people making the journey on four traffickers' craft last Sunday alone. And political parties in France of whatever persuasion have little hesitation in planning to push more of them our way.\nOn Wednesday evening in Calais, I watched a 'citizens' march' outside the city's magnificent grand theatre. It was staged by France's New Popular Front, a newly formed coalition of Leftist, green and communist parties to fight off the rising Right-wing.\nCalais, it claims, is so hostile to migrants that it is 'a death- bed for exiles' who should be allowed to leave for the more sympathetic UK.\nAmid the flag-waving and impassioned speeches, I spotted groups of migrants walking to catch buses to the beaches where they could rendezvous with the boats that would take them to Britain.\nThe only thing on their minds are the bateaux and reaching Angleterre, said a bearded pensioner called Eric wearily as he sat beside me at a café-bar. 'It is 'une tragedie' for both our countries.'\nA man in his 20s at the next table, who is now studying in Paris but was brought up in Calais, said: 'I know 80-year-olds at the march. They don't want the Le Pen Right-wing to win in this city, although I believe they will.'\nI left the café-bar and followed the migrants. As I trailed them through the streets, they were studying their mobile phones as they followed the directions the smugglers had given them that would lead them to the correct bus.\nAt a bus shelter on the road north to Dunkirk, 50 men, women, and some children — carrying plastic bags with a few possessions — were soon waiting in a silent queue. Two buses arrived, stopped, but none of them got on.\nOccasionally, a police car went past looking at the assembled throng but made no attempt to break them up.\nI see all this from the shelter on the other side of the road, where buses headed in the opposite direction, five miles south to Coquelles, a countryside commune which is near long beaches from where the White Cliffs of Dover can be seen on a clear day.\nSuddenly, the group of 50 ran across the road towards me en masse. They must have been tipped off about the bus that then arrived almost immediately at my stop — a bus they all climbed on before disappearing down the road.\nThe smugglers controlling the migrants had clearly ordered them to behave like this to confuse the police, making them believe the crowd was travelling one way when they were actually going in the opposite direction. I followed the bus by car. Less than 15 minutes later, it reached Coquelles, where the migrants got off.\nThey crossed the road and disappeared into a forested area a few miles from the Channel beaches. What was clear from this minor episode is that 'parcels' of migrants are being moved about Calais on an industrial scale as smugglers organise their rides by boat or lorry to Britain.\nThis week, the port's local newspaper, Nord Littoral, ran an extraordinary article exposing how the French authorities actively help the gangs to ply their trade in people.\nLast Saturday at 8pm, a Nord Littoral reporter was put on board the Abeille Normandie, a 'towing' ship leased by the French government, ostensibly to monitor the crossings of Channel migrants and their safety at sea.\nEarly on Sunday, as dawn broke, the Abeille Normandie spotted a migrant boat sailing towards the UK. As it closed in on the vessel, the ship used its thermal camera to find out quickly how many people were on board.\n'The images showed people riding on the inflatable with their feet in the water. The children were seated and protected in the middle of the boat. A father held his child in his arms as he touched his dream of getting to England,' the newspaper reported.\nBut what it said next was more disturbing. The article detailed how the Abeille Normandie's crew, on sighting the traffickers' inflatable, called up CROSS, the French sea-rescue service.\nIt, in turn, contacted the British coastguard, which immediately dispatched a Border Force vessel from the English coast to pick up the migrants directly from their flimsy boat at five in the morning and carry them into Dover.\nAn astonishing picture accompanying the article shows the mid-Channel migrant-transfer taking place, with the Border Force vessel proudly displaying a large red, white and blue Union Jack.\nThe migrants, one man carrying a baby girl dressed in a pink romper suit, are snapped being helped to climb a ladder from the little boat by the officers on board.\nBack in Calais, the patron of a restaurant near the airport told me he would be voting for the 'Le Pen' party because he believed France had been besieged.\n'We need change, we have had enough of the migrants over years and years. The day after the election finishes, I am going on holiday. And when I come back, I expect things already to be different under the National Rally.'\nAnd that can only be bad news for the UK. For if France moves to the Right, with the aim of ridding itself of migrants, as Britain votes in the Left, with its plans to welcome them in, a perfect storm is brewing — and the only winners will be the smugglers.\nMost watched News videos\n- Extraordinary moment mass brawl breaks out between Brits on flight\n- Finance expert's TV interview interrupted by adorable granddaughter\n- Moment driver veers to target e-bike riders before killing teen\n- Moment Swiss bar fire owners collapse after being confronted\n- Astonishing moment a street is swallowed by a sinkhole\n- Chilling police interview of ISIS fanatic plotting UK attack\n- Food vlogger dies after 'eating toxic devil crab'\n- Spy cam shows woman on her knees next to Jeffrey Epstein\n- Deepak Chopra confronted over his relationship to Epstein\n- Toddler opens car door in traffic and sends biker flying\n- New video shows man with backpack similar to Guthrie kidnapper\n- Israeli hostage reveals how she survived being tortured",
  "word_count": 2194,
  "scraped_at": "2026-02-14T13:12:02.179789"
}