{
  "article_id": "023302ed0e51",
  "url": "https://thenationonlineng.net/tinubu-hosts-oshoala-lauds-nigerian-women/",
  "title": "Tinubu hosts Oshoala , lauds Nigerian women - The Nation Newspaper",
  "date": "20231229T071500Z",
  "domain": "thenationonlineng.net",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sports\nDecember 29, 2023 by Bolaji Ogundele, Abuja\nTinubu hosts Oshoala, lauds Nigerian women\nPresident Bola Tinubu has lauded the achievements of Nigerian women on the global stage, saying they are changing the narrative by showing excellence, ingenuity and resilience in all fields.\nPresident Tinubu said as much when he, alongside the First Lady, Senator Oluremi Tinubu, hosted Asisat Oshoala, Super Falcons striker and 2023 CAF Women’s Player of the Year, in Lagos yesterday.\nThe moments with Oshoala was narrated in a statement by Special Adviser to the President on Media and Publicity, Ajuri Ngelale.\nPresident Tinubu and the First Lady had congratulated the Barcelona Femeni star on winning the best African female footballer of the year for the sixth time.\nThe President and the First Lady commended Oshoala for distinguishing herself in the sport, applauding her significant contributions to women’s football on the continent.\nRead Also: Nigeria’s progressive movement must deliver on quality education for all, jobs for youths – Tinubu\n“Nigerian women will always have a pride of place in the world. What our ladies have achieved in football, our women are achieving in all fields of endeavour around the world, rising to the top and demonstrating the best of the Nigerian character of excellence, tenacity, ingenuity, and resilience,” the President said.\nCognizant of the feats of star sprinter, Tobi Amusan, and the presence of multiple Nigerian women on the Forbes’ ‘2023 World’s 100 Most Powerful Women,’ List, including media mogul, Ms. Mo Abudu, and Director-General of the World Trade Organization (WTO), Dr. Ngozi Okonjo-Iweala, the President and the First Lady assured Oshoala of the nation’s continued support for her and other Nigerian women striving for excellence in their chosen paths.\nSpeaking to journalists after the warm reception, Oshoala said: ”I want to appreciate the President and the First Lady for giving me the opportunity to present the award to them. During the last World Cup, we had a couple of issues, and they intervened and have been very supportive to the girls, even after the competition.”",
  "word_count": 339,
  "scraped_at": "2026-02-14T12:30:49.922541"
}