{
  "article_id": "0278766ee4a7",
  "url": "https://www.90min.com/man-city-confirm-arrival-vivianne-miedema",
  "title": "Manchester City confirm the arrival of Vivianne Miedema",
  "date": "20240705T084500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Manchester City confirm the arrival of Vivianne Miedema\n- Vivianne Miedema has joined Man City after leaving rivals Arsenal\n- Dutch forward praises the level of \"ambition\" at her new club\n- Links up with international Dutch teammates Jill Roord and Kerstin Casparij\nManchester City have announced the signing of WSL all-time top scorer Vivianne Miedema following her shock departure from rivals Arsenal earlier this summer.\nAlso the Netherlands' leading goalscorer - either women's or men's - Miedema's exit from Arsenal as a free agent was confirmed in May following seven successful years at the club.\nHowever, she recently admitted actually considering leaving a few months earlier due to a “difficult” return from ten months out recovering from an anterior cruciate ligament injury.\n90min reported last month that Miedema's preference was to stay in England when searching for a new club, and that City were the frontrunners in the race to sign her.\nThe move up north will no doubt be less daunting for Miedema, as she is set to be reunited with her Dutch national teammates Jill Roord and Kerrstin Casparij at club level, having discussed the move with them with ahead of making a decision.\nWhen asked what drove her to join City, she said: \"The reason I chose City is because they have the same ambitions as me. They want to win the league and titles. Looking to the future, I've always said I want to play with the best players in the world and I think City have got that.\n\"I haven't played as much football as I would have wished over the past two years, but I think and hope my best years are still to come. I hope I'm going to be able to help the team as much as I can do.\"\nMiedema is set to join up with City for pre-season training at the end of July and the first-ever Perth International Football Cup in preparation for the 2024/25 season. But she will first link up with her country for UEFA Women's Euro 2025 qualifying matches against Italy and Norway.\nANALYSIS\nMiedema’s arrival is likely to take City’s already impressive frontline to another level. The club will no doubt be hungry for revenge and aiming to top the table, after narrowly missing out on last season's title to champions Chelsea on goal difference alone.\nMiedema will be linking up with the likes of Mary Fowler, Lauren Hemp, Jess Park and Khadija ‘Bunny’ Shaw in September. Shaw was awarded the WSL’s Golden Boot during the 2023/24 campaign, scoring 21 times in just 18 appearances, more than any other player in the English top flight.\nAdding Miedema to this mix will arguably see City boasting the most powerful frontline across the entire WSL. However, it'll be interesting to see how she adapts to having a lot more game time than she did at Arsenal, following various injuries.\nCity know what they are doing. Announcing Miedema as their first signing of the season is sending a clear message, one that says they have their eyes on the prize and no-one is getting in their way.\nIf Miedema wants silverware, then in my opinion, there's no better club for her to be at right now. City are worthy contenders for the title, and dare I say it, even the treble next season.",
  "word_count": 556,
  "scraped_at": "2026-02-14T12:22:59.242149"
}