{
  "article_id": "027d51b8f93e",
  "url": "https://www.90min.com/posts/mana-shim-the-champion-of-change-nwsl",
  "title": "Mana Shim : The champion of change within the NWSL",
  "date": "20230308T094500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Mana Shim: The champion of change within the NWSL\n90min is championing 10 influential women in football this International Women's Day.\nMana Shim revolutionized the National Women’s Soccer League when coming forward with allegations of continued abuse within the sporting organization, insisting her claims be heard for the greater good and safety of others.\nShim reported specific information to the Portland Thorns leadership, league officials and governing individuals for six years without being heard.\nThough she was previously silenced, ignored and pushed aside, Shim persisted.\nIn 2021, Shim and fellow NWSL player Sinead Farrelly, presented the allegations of harassment and sexual coercion against longtime league coach Paul Riley to The Athletic writer Meg Linehan in a bid to get attention one way or another. Within days of publication, the story began to gain tremendous international traction and make the necessary impact.\nMore players began coming forward with their own stories of abuse, while prominent NWSL figures called for system-wide action. Protests erupted across every league game across the country, as athletes stopped play in the sixth minute of the match in recognition of the six years it took for the allegations of Shim and Farrelly to come to light. Players, both on and off the pitch, ran to each other to join arm in arm and form one circle in the center of the pitch while fans held up signs in support of the women.\nTributes in support of Shim and Farrelly’s actions came flooding in.\n“I’m so grateful for Mana Shim and Sinead Farrelly. I can’t imagine putting that story out so publicly, and the courage it takes, but it also makes me sick that it has taken that article for us to do something about it,” Orlando Pride goalie Erin McLeod said.\n“She went through all the right steps to report someone who was sexually harassing her. And she was failed. She was failed by the system,” Alex Morgan said of Shim. “And I think that was the hardest thing at the time: What do we do now?”\nThe harrowing report championed by Shim and Farrelly - in addition to constant calls for change within the league - prompted former commissioner Lisa Baird to launch a comprehensive investigation into the claims and other allegations discovered across the league.\nSubsequently, Paul Riley and other figures involved with the systemic abuse and continued sexual harassment were removed by the NWSL.\n“I’m still damaged. This isn’t something that just goes away overnight because we talk about it,” Shim said. “It’s extremely vulnerable and detailed. I’m just so grateful for this opportunity to get these bad people out of the league, and really shine a light on this issue because it’s so prevalent. It’s not just this team, it’s not just this coach, it’s across the league, it’s across the sport, and we had to do something about it.”\nBut Shim insists more change is needed.\nShe will now serve as chair of U.S. Soccer’s participant safety task force, helping athletes feel comfortable within the organization while keeping officials accountable. Shim voiced the need to create an avenue for players to comfortably voice concerns, and be a part of a wider systemic change.\nU.S. Soccer created two additional task forces following the release of former U.S. Deputy Attorney General Sally Q. Yates’ independent investigation. Shim’s counterpart is U.S. Soccer board member and former USWNT player Danielle Slaton, who chairs the group tasked with implementing the specific recommendations from the Yates report.\nREAD MORE ABOUT 10 OF THE MOST INFLUENTIAL WOMEN IN FOOTBALL\n“Sally Yates’ report made it clear that, for far too long, leaders across the soccer ecosystem — including at U.S. Soccer — have not taken responsibility for protecting players,” Shim said.\n“But I believe in the capacity for change. As leader of the task force, I am committed to ensuring not only that Yates’ recommendations are implemented, but that we push beyond them. We need to find the root causes of our sport’s systemic failures and take action at every level — from the youth game to the professional game.”\nShim continues to champion change in women’s football on and off the field - she is a true inspiration.",
  "word_count": 699,
  "scraped_at": "2026-02-14T11:59:30.939695"
}