{
  "article_id": "02a3b0b02f37",
  "url": "http://www.tnledger.com/Default.aspx?newsDate=11/7/2025",
  "title": "The Nashville Ledger",
  "date": "20251106T073000Z",
  "domain": "tnledger.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Disrupting all that divides us\nOneGenAway aims to feed millions, chip away at barriers to unity, prosperity\n“We’re Chapter 22!” Chris Whitney presses a book into my hands, bright yellow to match his energy. The title is “Disrupt Everything and Win” by James Patterson (yes, that James Patterson) and Patrick Leddin, Ph.D., a former Vanderbilt professor. Whitney has boxes of them stacked in his tiny office, ready to hand out like the proverbial proud father with his cigars after the arrival of a newborn.\nAnyone else have trouble with our roundabouts? No?\nWell, I thought, this is embarrassing. After more than 50 years without a single moving violation or accident counted against me, I reckon myself as well above average on the driver scale. Superior, even.\nManning’s luxury provides soft landing for downsizers\nThe embattled Manning development on Woodmont Boulevard near Harding Road has enjoyed, at long last, some closings.\n42.1°F\nA Few Clouds\nWind: South at 3.5 mph\nHumidity: 53%\nEVENTS\nNashville Chamber Chat. Making the most of a membership investment is important, as your business plays a key role in the Chamber’s mission to create regional economic prosperity. Join us in our office in Capitol View where participants will learn about member benefits and engagement opportunities. Wednesday, 11:30 a.m.-1 p.m., Nashville Area Chamber of Commerce, 500 11th Avenue N., Suite 200, Boyle Conference Room, Nashville. InformationTop Davidson County residential real estate sales for October 2025\nTop Davidson County residential real estate sales for October 2025, as compiled by the Nashville Ledger.\nNo sugar-coating Ward’s terrible rookie season\nSo far, he’s a step backward from Levis\nJust a shade over the halfway point of his rookie season, it’s time to make an early evaluation on Cam Ward.\nTitans’ midseason grades: Failure in almost all subjects\nSince the Titans are on a bye week, it is time to give out our midseason report card grades for the team. Let’s just say that not many folks are on the honor roll. In fact, some may be headed for summer school just to keep from repeating this dismal performance.\nBud Adams, Robert Kraft among Pro Football Hall of Fame contributor semifinalists\nSix-time Super Bowl-winning owner Robert Kraft and Bud Adams, who founded the Houston Oilers and was a key part of the formation of the AFL, are among the nine contributors who advanced to the semifinal stage for the Pro Football Hall of Fame's Class of 2026.\nFew options for Preds with Stamkos contract\nWhen Predators general manager Barry Trotz spent big July 1, 2024, not on some big name but on over-30 free agents Steven Stamkos, Jonathan Marchessault and Brady Skjei, the hope was that the three established NHL veterans still had enough tread on the tires to help the team be competitive for years to come. The 2024-25 season was disastrous for those three and the Predators as a whole.\nNHL’s punch-drunk fight ‘code’ makes little sense\nFighting in the NHL is a divisive and much-debated topic. The years of multiple fights per game and roster spots occupied by players whose sole responsibility was dropping the gloves with opponents on a nightly basis are long gone. But fighting is still a thing in the NHL, albeit at a much lower rate than decades past.\nWounded Predators\nRecent injuries have started to hit the Predators roster. Here’s a look at who is out and when they may return.\nNeighborhood Health names chief clinical officer\nNeighborhood Health, Inc. has selected Matthew S. Joseph, M.D., MBA, as its chief clinical officer.\n3 Nashville restaurants earn Michelin stars\nThe Michelin Guide has unveiled its first-ever selection for the American South, naming three Nashville restaurants among the region’s inaugural Michelin Star honorees.\nComparing the new BMW X3, Mercedes-Benz GLC\nCompact luxury crossovers are ideal if you’re seeking a compelling blend of utility and style without having to pay full-size luxury SUV pricing. The BMW X3 has been a front-runner since the original model’s introduction in 2003, but it continues to face stiff competition from the Mercedes-Benz GLC.\nHaving trouble with Gen Z workers? Find a way to adapt\nAfter the interview, you gave a job applicant an “A” and hired her. Since then, she’s been late two days out of five, she leaves early most afternoons and her co-workers say she’s abrasive. You thought she’d be a great employee, but now you’re at the end of your rope.\nTennessee death row inmate Harold Wayne Nichols asks governor for life in prison instead\nNASHVILLE (AP) — Attorneys for Tennessee death row inmate Harold Wayne Nichols are asking the governor to convert his sentence to life imprisonment with just a month until his scheduled execution date.\nJudge to hear arguments on law cutting Planned Parenthood Medicaid funds\nA federal judge will hear arguments Wednesday about whether a spending law passed in July that ended Medicaid reimbursements for Planned Parenthood can remain in effect while legal challenges continue.\nWhy a Visa-Mastercard legal settlement could lead to your rewards credit card getting declined\nNEW YORK (AP) — Visa and Mastercard have proposed a settlement in their long-running legal dispute with merchants and retailers over how much they charge merchants to accept their cards.\nOnline gambling is everywhere. So are the risks\nNEW YORK (AP) — Online betting is more accessible than ever, with 14% of U.S. adults saying they bet on professional or college sports online either frequently or occasionally, according to a February poll by The Associated Press-NORC Center for Public Affairs Research. It's also in the news, with a growing list of sports betting scandals making headlines.\nWhat to know about the status of SNAP food aid as a vote nears to end the shutdown\nMany Americans who rely on SNAP benefits to help buy groceries are approaching their third week without aid after President Donald Trump's administration cut off the program due to the federal government shutdown.\nFDA names longtime cancer scientist Pazdur to lead drug center\nWASHINGTON (AP) — The Food and Drug Administration on Tuesday named a longtime regulator of cancer medicines to lead the agency's drug center, replacing the former drug director who was recently ousted after an ethics complaint.\nBy the Numbers: The government shutdown's toll on air travel in the US\nAmerica's aviation system is straining under the weight of the longest government shutdown on record: thousands of flight cancellations, long delays at major airports and frustrated travelers nationwide.\nMega Millions jackpot grows to $965 million for Friday's drawing\nThe Mega Millions jackpot has grown to $965 million for Friday's drawing after no ticket matched all six numbers, according to lottery officials.\nMore than 80 nonprofits receive $250M for global women's health from Melinda French Gates\nMore than 80 organizations that provide health care for women all over the world received grants Wednesday totaling $250 million from Melinda French Gates after a year-long application process.\nMichael Caine, Matthew McConaughey partner with ElevenLabs for AI voice cloning\nNEW YORK (AP) — Oscar-winning actors Michael Caine and Matthew McConaughey have made deals with voice-cloning company ElevenLabs that will allow its artificial intelligence technology to replicate their voices.\nAnthropic, Microsoft announce new AI data center projects as industry's construction push continues\nArtificial intelligence company Anthropic announced a $50 billion investment in computing infrastructure on Wednesday that will include new data centers in Texas and New York.\nMSNBC's name is being replaced, but its leaders insist that its mission will remain the same\nNEW YORK (AP) — Asked what viewers should expect when television's MSNBC makes its corporate divorce from NBC News final this weekend, network president Rebecca Kutler points to a poster on the wall of a conference room at its new offices off Times Square.\nAtlanta Fed president Bostic to retire in February, opening seat on key committee\nWASHINGTON (AP) — Raphael Bostic, president of the Federal Reserve Bank of Atlanta, will retire at the end of his current term in February, opening up a new seat on the Fed's interest-rate setting committee at a time that President Donald Trump is seeking to exert more control over the central bank.\nWith their government contracts in limbo, small businesses await a historic shutdown's end\nNEW YORK (AP) — The end of the longest U.S. government shutdown in history would be a relief for small businesses that depend on federal contracts or funding. For seven weeks, they've been reducing spending, weighing layoffs and looking for stable work while trying to reach shuttered government offices, according to several contractors.\nUnlucky penny: US Mint in Philadelphia to press final penny as the 1-cent coin gets canceled\nPHILADELPHIA (AP) — Back in 1793, a penny could get you a biscuit, a candle or a piece of candy. These days, many sit in drawers or glass jars and are basically cast aside or collected as lucky keepsakes.\nWhat to know as the US Mint in Philadelphia presses its final penny\nThe U.S. Mint in Philadelphia on Wednesday pressed its last penny, marking the latest step in the 1-cent coin's demise.\nSmall grocers and convenience stores feel an impact as customers go without SNAP benefits\nA little more than a year ago, Ryan Sprankle welcomed President Donald Trump to one of the three grocery stores his family owns near Pittsburgh. Trump was on the campaign trail; they talked about high grocery prices, and the Republican nominee picked up a bag of popcorn.\nThese are the 37 donors helping pay for Trump's $300 million White House ballroom\nWASHINGTON (AP) — President Donald Trump says his $300 million White House ballroom will be paid for \"100% by me and some friends of mine.\"\nMore Americans unhappy with the way Trump is managing the government: AP-NORC poll\nWASHINGTON (AP) — Approval of the way President Donald Trump is managing the government has dropped sharply since early in his second term, according to a new AP-NORC poll, with much of the rising discontent coming from fellow Republicans.\nEpstein email says Trump 'knew about the girls' as White House calls its release a Democratic smear\nWASHINGTON (AP) — Jeffrey Epstein wrote in a 2019 email to a journalist that Donald Trump \"knew about the girls,\" according to documents made public Wednesday, but what he knew — and whether it pertained to the sex offender's crimes — is unclear. The White House quickly accused Democrats of selectively leaking the emails to smear the president.\nGrijalva will be sworn in as the House's newest member, paving the way for an Epstein files vote\nWASHINGTON (AP) — As the House returns Wednesday for the first time in months, Democrat Adelita Grijalva will be sworn in as its newest member, more than seven weeks after winning a special election in Arizona to fill the seat last held by her late father.\nHouse returns for vote to end the government shutdown after nearly 2 months away\nWASHINGTON (AP) — House lawmakers made a long-awaited return to the nation's capital on Wednesday after nearly eight weeks away to potentially put an end to the longest federal government shutdown in U.S. history.\nA historic shutdown is nearly over. It leaves no winners and much frustration\nWASHINGTON (AP) — The longest government shutdown in history could conclude as soon as Wednesday, Day 43, with almost no one happy with the final result.\nSchumer faces criticism as shutdown nears end, but his job appears safe\nWASHINGTON (AP) — Senate Democratic leader Chuck Schumer led his caucus, and the country, into a record-breaking government shutdown and voted against reopening when a small group of his members defected. But there are still calls for him to step aside from Democrats who think he should have fought harder.\nElaine Luria helped investigate Jan. 6 and lost her House seat. Now she's attempting a comeback\nWASHINGTON (AP) — A Virginia Democrat who helped investigate the Jan. 6 insurrection at the U.S. Capitol is making a comeback bid after last week's sweeping election wins as her party looks to break President Donald Trump's grip on federal power in the 2026 midterms.\nRangers get an offensive outburst to beat the Predators 6-3 for their first home win this season\nNEW YORK (AP) — Mika Zibanejad scored to end a lengthy goal drought on home ice, Gabriel Perreault picked up his first NHL point and the New York Rangers used an offensive outburst to defeat the Nashville Predators 6-3 on Monday night for their first victory at Madison Square Garden this season.\nTrump pardons the husband of Republican supporter Rep. Diana Harshbarger of Tennessee\nWASHINGTON (AP) — President Donald Trump has pardoned Tennessee Republican Rep. Diana Harshbarger's husband, who pleaded guilty more than a decade ago to health care fraud and other crimes and served time in federal prison.\nTennessee death row inmate declines to choose between the electric chair and lethal injection\nNASHVILLE (AP) — Tennessee death row inmate Harold Wayne Nichols on Monday declined to choose between the electric chair and lethal injection for his Dec. 11 execution, meaning the state will default to lethal injection.\nLawsuit challenges TSA's ban on transgender officers conducting pat-downs\nA Virginia transportation security officer is accusing the U.S. Department of Homeland Security of sex discrimination over a policy that bars transgender officers from performing security screening pat-downs, according to a federal lawsuit.\nAfter mistaken deportation, US asks judge to let it send Kilmar Abrego Garcia to Liberia\nGREENBELT, Md. (AP) — U.S. government attorneys say they have cleared all the hurdles needed to send Kilmar Abrego Garcia to Liberia and are asking a federal judge to dissolve an order blocking his deportation.\nWhite House's 50-year mortgage proposal has one notable benefit but a number of drawbacks\nNEW YORK (AP) — The White House says it is considering backing a 50-year mortgage to help alleviate the home affordability crisis in the country. But the announcement drew immediate criticism from policymakers, social media and economists, who said a 50-year mortgage would do little to resolve other core problems in the housing market, such as a lack of supply and high interest rates.\nByHeart recalls all baby formula sold nationwide as infant botulism outbreak grows\nByHeart, a manufacturer of organic baby formula, recalled all of its products sold nationwide Tuesday, days after some batches were recalled in an expanding outbreak of infant botulism.\nMLB, sportsbooks cap bets on individual pitches in response to pitch-rigging scandal\nMajor League Baseball said its authorized gaming operators will cap bets on individual pitches at $200 and exclude them from parlays, a day after two Cleveland Guardians players were indicted and accused of rigging pitches at the behest of gamblers.\nUS Catholic bishops select conservative culture warrior to lead them during Trump's second term\nBALTIMORE (AP) — U.S. Catholic bishops elected Oklahoma City Archbishop Paul Coakley as their new president on Tuesday, choosing a conservative culture warrior to lead during President Donald Trump's second term.\nIndigenous groups get the spotlight at UN climate talks, but some say visibility isn't power\nBELEM, Brazil (AP) — Indigenous people are used to adapting, so when the power failed at their kickoff event at this year's United Nations climate talks, they rolled with it. Participants from around the world sweated through song, dance and prayers, improvising without microphones and cooling themselves with fans made of paper or leaves.\nSpace forecasters say severe solar storms could hit Earth and trigger auroras\nNEW YORK (AP) — Space weather forecasters issued an alert on Tuesday for incoming severe solar storms that could produce colorful northern lights and temporarily disrupt communications.\nThere's no timeline on when flight cuts will ease up after the government shutdown ends\nAirlines have canceled more 9,000 flights across the U.S. since the Federal Aviation Administration ordered flight cuts late last week, mostly to ease demand on control towers that are short-staffed during the federal government shutdown.\nWhile Trump threatens controllers, US flight cancellations will drag on even after shutdown ends\nAir travelers should expect worsening cancellations and delays this week even if the government shutdown ends, as the Federal Aviation Administration rolls out deeper cuts to flights at 40 major U.S. airports, officials said Monday.\nGovernment shutdown will have lasting effects on National Guard, advocates say\nWASHINGTON (AP) — As the government shutdown stretches on, military advocates are warning of long-lasting effects to National Guard troops and their readiness, while the military services are grappling with an inability to fully discharge active duty service members.\nKansas county agrees to pay $3 million over law enforcement raid on a small-town newspaper\nTOPEKA, Kan. (AP) — A rural Kansas county has agreed to pay a little more than $3 million and apologize over a law enforcement raid on a small-town weekly newspaper in August 2023 that sparked an outcry over press freedom.\nIn Trump-dominated media world, editing video takes on new significance — as BBC uproar shows\nIn the space of a few months, one of the more straightforward journalistic tasks — editing tape for broadcast — has been behind a $16 million legal settlement, a network's change in how it offers interviews on a news show and, now, the resignation of two top leaders at the BBC.\nShutdown leaves a mark on an already-struggling economy, from lost paychecks to canceled flights\nWASHINGTON (AP) — The longest federal government shutdown in U.S. history appears to be nearing an end, but not without leaving a mark on an already-struggling economy.\nChina's 'Singles' Day' shopping festival a gauge of Beijing's effort to get consumers to spend more\nHONG KONG (AP) — Alice Zhang, a 29-year-old marketer in the southern Chinese city of Guangzhou, has spent only roughly half what she did last year during the \"Singles' Day\" online shopping festival, switching to cheaper choices and giving up on buying new shoes after pay was cut by more than 20%.\nJapan's SoftBank says it has sold its shares in Nvidia for $5.8 billion, turning its focus to OpenAI\nTOKYO (AP) — Japanese technology giant SoftBank said Tuesday it has sold its stake in Nvidia, raising $5.8 billion to pour into other investments. It also reported its profit nearly tripled in the first half of this fiscal year from a year earlier.\nWhat to know about Trump's plan to give Americans a $2,000 tariff dividend\nWASHINGTON (AP) — President Donald Trump boasts that his tariffs protect American industries, lure factories to the United States, raise money for the federal government and give him diplomatic leverage.\nNew Trump directive could deny more visas based on applicants' health, finances\nWASHINGTON (AP) — A new directive by President Donald Trump's administration could make it more difficult for foreigners to visit or live in the United States if they have certain medical conditions such as diabetes or obesity or lack the economic resources and assets to support themselves.\nNewsom tells AP the eight senators who struck the shutdown deal aren't alarmed enough about Trump\nBELEM, Brazil (AP) — California Gov. Gavin Newsom said Tuesday he's stunned by eight senators' decision to break with Democrats and end the government shutdown and warned they're not alarmed enough about President Donald Trump's political norm-shattering.\nSpeaker Johnson faces an unruly House as lawmakers return for shutdown vote\nWASHINGTON (AP) — After refusing to convene the U.S. House during the government shutdown, Speaker Mike Johnson is recalling lawmakers back into session — and facing an avalanche of pent-up legislative demands from those who have largely been sidelined from governing.\nSenate approves bill to end the shutdown, sending it to the House\nWASHINGTON (AP) — The Senate passed legislation Monday to reopen the government, bringing the longest shutdown in history closer to an end as a small group of Democrats ratified a deal with Republicans despite searing criticism from within their party.\nTop diplomats from G7 countries meet in Canada as trade tensions rise with Trump\nTORONTO (AP) — Top diplomats from the Group of Seven industrialized democracies are converging on southern Ontario as tensions rise between the U.S. and traditional allies like Canada over defense spending, trade and uncertainty over President Donald Trump's ceasefire plan in Gaza and efforts to end the Russia-Ukraine war.\nTrump says Rep. Marjorie Taylor Greene has 'lost her way' for criticizing his foreign policy focus\nWASHINGTON (AP) — President Donald Trump on Monday said that key Republican ally Georgia Congresswoman Marjorie Taylor Greene had \"lost her way\" by saying that he's spending too much time on foreign affairs and should be more focused on inflation.\nAP Player of the Week: Vandy's Pavia piles up 489 yards in OT win against Auburn\nVanderbilt quarterback amassed a career-high 489 yards of total offense, throwing for a career-high 377 yards and rushing for 112 in a 45-38 overtime win over Auburn. The Associated Press Player of the Week became the first Vanderbilt player since at least 1996 to record 300 yards passing and 100 yards rushing in a game. Pavia also passed for three touchdowns and ran for one.\nMan accused of firing a gun during Capitol riot is arrested on kidnapping and sexual assault charges\nWASHINGTON (AP) — A man accused of firing a gun in the air during a mob's attack on the U.S. Capitol has been arrested on charges that he kidnapped and sexually assaulted a woman in Utah more than two years before the Jan. 6, 2021, riot, according to authorities and newly unsealed court records.\nDrug dealer granted clemency by Trump sent back to prison for violating terms of his release\nNEW YORK (AP) — A convicted drug dealer who had been granted clemency by President Donald Trump was sent back to federal prison on Monday for violating the terms of his release after being charged with several new crimes.\nSupreme Court rejects call to overturn its decision legalizing same-sex marriage nationwide\nWASHINGTON (AP) — The Supreme Court on Monday rejected a call to overturn its landmark decision that legalized same-sex marriage nationwide.\nLouisiana prison guards cut a Rastafari inmate's dreadlocks. Supreme Court will decide if he can sue\nWASHINGTON (AP) — The Supreme Court on Monday wrestled with whether a former Louisiana inmate can sue prison officials who cut off his dreadlocks in violation of his Rastafari religious beliefs.\nSupreme Court will decide whether states can count late-arriving mail ballots, a Trump target\nWASHINGTON (AP) — The Supreme Court on Monday agreed to decide whether states can continue to count late-arriving mail ballots, which have been a target of President Donald Trump.\nHow Gary Sinise is helping the nonprofit CreatiVets build 'a place to go when the PTSD hits'\nNASHVILLE (AP) — Richard Casper shakes his head as he touches one of the boarded-up windows in the once-abandoned church he plans to transform into a new 24-hour arts center for veterans.\nAt 101, WWII veteran Irving Locker has become a songwriter\nNASHVILLE (AP) — In a life filled with milestones, Irving Locker celebrated a new, unexpected one last week: He became a published songwriter.\nAn emerging shutdown deal doesn't extend expiring health subsidies. Here's what could happen to them\nNEW YORK (AP) — A legislative package that appears on track to end the longest government shutdown in U.S. history leaves out any clear resolution on the expiring Affordable Care Act tax credits that have made private health insurance less costly for millions of Americans.\nFDA will remove long-standing warning from hormone-based menopause drugs, citing benefits for women\nWASHINGTON (AP) — Hormone-based drugs used to treat hot flashes and other menopause symptoms will no longer carry a bold warning label about stroke, heart attack, dementia and other serious risks, the Food and Drug Administration announced Monday.\nInfant botulism in 10 US states linked to formula being recalled\nFederal and state health officials are investigating 13 cases in 10 states of infant botulism linked to baby formula that was being recalled, authorities said Saturday.\nUS flight cancellations expected to drag on even after the government shutdown ends\nNEW YORK (AP) — The flight cancellations at airports across the U.S. are expected to persist even after the government shutdown ends.\nUS airlines' daily cancellations exceed 2,700 as shutdown impact extends\nWASHINGTON (AP) — U.S. airlines canceled more than 2,700 flights on Sunday as Transportation Secretary Sean Duffy warned that air traffic across the nation would \"slow to a trickle\" if the federal government shutdown lingered into the busy Thanksgiving travel holiday season.\nWhat to know if your travel plans are impacted by the FAA's flight cancellations\nIf you have upcoming travel plans anytime soon, you might notice fewer options on the airport's departure board.\nTesla Cybertruck executive leaving the Musk-led automaker\nThe executive leading Tesla's Cybertruck business is leaving the Elon Musk-led automaker after eight years.\nA crisis at chipmaker Nexperia sent automakers scrambling. Here's what to know\nA battle for control of a little-known chipmaker has threatened global auto production by choking off the semiconductor supply chain, though there are signs the crisis is inching toward a resolution.\nBBC faces leadership crisis after news bosses quit over Trump speech edit, bias claims\nLONDON (AP) — The BBC reported Monday that U.S. President Donald Trump has sent a letter threatening legal action over the way a speech he made was edited in a documentary aired by the British broadcaster.\nChina announces restrictions on chemicals after deal with Trump on fentanyl tariffs\nWASHINGTON (AP) — China said Monday it is making good on its pledge to crack down on chemicals that can be used to make fentanyl, a key issue for President Donald Trump during recent talks with Chinese leader Xi Jinping as they aimed to take steps to ease a trade war.\nWarren Buffett warns 'Father Time' is catching up but he trusts Berkshire Hathaway successor\nOMAHA, Neb. (AP) — Billionaire Warren Buffett warned shareholders Monday that many companies will fare better than his Berkshire Hathaway in the decades ahead because of its massive size though others might say the company's prospects will dim because \"Father Time\" is catching up with the 95-year-old icon who plans to step down as CEO in January.\nWendy's to close hundreds of US stores in bid to halt falling profit\nWendy's plans to close hundreds U.S. restaurants over the next few months in an effort to boost its profit and make its remaining stores more appealing.\nA look at prominent people pardoned by Trump after they tried to overturn his 2020 election loss\nWASHINGTON (AP) — The pardons of dozens of Republicans accused of participating in efforts to overturn the 2020 election are a continuation of President Donald Trump's attempts to rewrite the history about his election loss.\nThese 8 Democrats voted with Republicans on the government shutdown deal. Here's how they explain it\nWASHINGTON (AP) — The Democratic senators — eight in total — faced almost instant blowback from members of their own party as they voted to allow the Senate to move forward on compromise legislation that would reopen the government.\nSenate takes first step toward ending the government shutdown\nWASHINGTON (AP) — The Senate took the first step to end the government shutdown on Sunday after a group of moderate Democrats agreed to proceed without a guaranteed extension of health care subsidies, angering many in their caucus who say Americans want them to continue the fight.\nWhat's in the legislation to end the federal government shutdown\nWASHINGTON (AP) — A legislative package to end the government shutdown appears on track Monday after a handful of Senate Democrats joined with Republicans to break the impasse in what has become a deepening disruption of federal programs and services, the longest in history.\nTrump pardons Rudy Giuliani and others who backed efforts to overturn his 2020 election loss\nWASHINGTON (AP) — President Donald Trump has pardoned his former personal lawyer Rudy Giuliani, his onetime chief of staff Mark Meadows and others accused of backing the Republican's efforts to overturn the 2020 election.\nStates face uncertainty as Trump administration tries to reverse SNAP food payments\nStates administering a federal food aid program serving about 42 million Americans faced uncertainty Monday over whether they can — and should — provide full monthly benefits during an ongoing legal battle involving the U.S. government shutdown.\nEU, Latin America and Caribbean nations hold summit overshadowed by US military operation\nBOGOTA, Colombia (AP) — Representatives of European, Latin American and Caribbean nations on Sunday began a two-day summit in Colombia to try to strengthen ties despite questions on the gathering's relevance and divisions in the Western Hemisphere over the U.S. military operation targeting alleged drug-carrying vessels.\nTrump is hosting Syria's al-Sharaa for a first-of-its-kind meeting at the White House\nWASHINGTON (AP) — President Donald Trump is hosting Syrian President Ahmad al-Sharaa at the White House on Monday, welcoming the once-pariah state into a U.S-led global coalition to fight the Islamic State group.\nKonecny and Vladar lead Flyers to 3-1 win over Predators\nNASHVILLE (AP) — Travis Konecny had a goal and an assist to lead the Philadelphia Flyers past the Nashville Predators 3-1 on Thursday night.\nRebuilding Titans center hope on Cam Ward, more cap space and draft picks as they reach bye week\nNASHVILLE (AP) — Outside linebacker Dre'Mont Jones had a message for the Tennessee Titans and their fans on his way out of town at the NFL trade deadline.\nNCAA revokes eligibility of 6 more college basketball players as it continues sports betting probe\nThe NCAA revoked the eligibility of six men's college basketball players for allegations of sports betting on Friday in three separate cases at New Orleans, Mississippi Valley and Arizona State.\nTrump pardons former Tennessee House speaker convicted of federal public corruption charges\nWASHINGTON (AP) — President Donald Trump has pardoned the former Tennessee House speaker and a onetime aide of public corruption charges after the White House said the Biden administration Justice Department \"significantly over-prosecuted\" both for a minor issue.\nTrump administration seeks to halt SNAP food aid payments after a court order\nBOSTON (AP) — President Donald Trump's administration asked a federal appeals court Friday to block a judge's order that it distribute November's full monthly SNAP benefits amid a U.S. government shutdown, even as at least some states said they were moving quickly to get the money to people.\nOpenAI faces 7 lawsuits claiming ChatGPT drove people to suicide, delusions\nOpenAI is facing seven lawsuits claiming ChatGPT drove people to suicide and harmful delusions even when they had no prior mental health issues.\nSupreme Court weighs longshot appeal to overturn decision legalizing same-sex marriage nationwide\nWASHINGTON (AP) — A call to overturn the landmark Supreme Court decision legalizing same-sex marriage nationwide is on the agenda Friday for the justices' closed-door conference.\nUS travelers scramble to adjust as airlines cut flights because of shutdown\nAnxious travelers across the U.S. felt a bit of relief Friday as airlines mostly stayed on schedule while gradually cutting hundreds of daily flights because of the government shutdown.\nWhat to know about 10% reduction in flights at US airports caused by the government shutdown\nNEW YORK (AP) — Hundreds of flights set for Friday have been cut at major U.S. airports as part of the Federal Aviation Administration's effort to phase in 10% reductions because of the government shutdown.\nTrump administration moves to loosen restrictions it once supported on a harmful pollutant\nWASHINGTON (AP) — Near the end of his first term, President Donald Trump signed into law a bill that aimed to reduce harmful, planet-warming pollutants emitted by refrigerators and air conditioners. The bipartisan measure brought environmentalists and major business groups into rare alignment on the contentious issue of climate change and won praise across the political spectrum.\nDeep in Trump country, coal miners with black lung say government is suffocating the 'working man'\nOAK HILL, W.Va. (AP) — Lisa Emery loves to talk about her \"boys.\" With each word, the respiratory therapist's face softens and shines with pride. But keep her talking, and it doesn't take long for that passion to switch to hurt. She knows the names, ages, families and the intimate stories of each one's scarred lungs. She worries about a whole community of West Virginia coal miners — including a growing number in their 30s and 40s — who come to her for help while getting sicker and sicker from what used to be considered an old-timer's disease: black lung.\nHonda's profit slips as President Trump's tariffs take their toll on Japanese automakers\nTOKYO (AP) — Honda reported Friday that its profit for the first fiscal half through September fell 37% from the previous year, as the damage from President Donald Trump's tariffs offset the lift from solid motorcycle sales.\nCornell University to pay $60M in deal with Trump administration to restore federal funding\nWASHINGTON (AP) — Cornell University has agreed to pay $60 million and accept the Trump administration's interpretation of civil rights laws in order to restore federal funding and end investigations into the Ivy League school.\nConsumer sentiment tumbles close to record lows in latest U Michigan survey\nNEW YORK (AP) — Consumer sentiment dropped to a three-year low and close to the lowest point ever recorded by the University of Michigan one month into the government shutdown, with pessimism over personal finances and anticipated business conditions weighing on Americans.\n'No hire' job market leaves unemployed in limbo as threats to economy multiply\nWASHINGTON (AP) — When Carly Kaprive left a job in Kansas City and moved to Chicago a year ago, she figured it would take three to six months to find a new position. After all, the 32-year old project manager had never been unemployed for longer than three months.\nChina's exports fall 1.1% in October, hit by a 25% drop in shipments to the US\nHONG KONG (AP) — China's exports contracted in October, hit by a 25% drop in shipments to the United States, the government reported Friday.\nPeloton recalls nearly 878,000 exercise bikes after several seat posts break\nNEW YORK (AP) — Peloton is recalling nearly 878,000 of its exercise bikes across the U.S. and Canada because the products' seat posts can break during use, posing fall hazards.\nSchumer offers Republicans a deal to extend health care subsidies, end shutdown\nWASHINGTON (AP) — Senate Democratic Leader Chuck Schumer is making a new offer to reopen the government on Friday as Republicans have refused to negotiate on their demands to extend health care subsidies.\nTrump has accused boat crews of being narco-terrorists. The truth, AP found, is more nuanced\nGÜIRIA, Venezuela (AP) — One was a fisherman struggling to eke out a living on $100 a month. Another was a career criminal. A third was a former military cadet. And a fourth was a down-on-his-luck bus driver.\nThe government shutdown prompts the cancellation of some Veterans Day events\nNormally on Veterans Day, volunteers gather at the Riverside National Cemetery in California to place flags alongside more than 300,000 gravesites. But not this year.\nTrump pardons former Mets great Darryl Strawberry on past tax evasion, drug charges\nWASHINGTON (AP) — President Donald Trump has pardoned former New York Mets great Darryl Strawberry on past tax evasion and drug charges, citing the 1983 National League Rookie of the Year's post-career embrace of his Christian faith and longtime sobriety.\nTrump is ramping up a new effort to convince a skeptical public he can fix affordability worries\nWASHINGTON (AP) — President Donald Trump is adjusting his messaging strategy to win over voters who are worried about the cost of living with plans to emphasize new tax breaks and show progress on fighting inflation.\nThe Congressional Budget Office was hacked. It says it has implemented new security measures\nWASHINGTON (AP) — The Congressional Budget Office on Thursday confirmed it had been hacked, potentially disclosing important government data to malicious actors.\nSenate Republicans vote down legislation to limit Trump's ability to attack Venezuela\nWASHINGTON (AP) — Senate Republicans voted to reject legislation Thursday that would have put a check on President Donald Trump's ability to launch an attack against Venezuela, as Democrats pressed Congress to take a stronger role in Trump's high-stakes campaign against Venezuelan President Nicolás Maduro.\nObama celebrates Tuesday wins and tells progressives that voters are rejecting the Trump agenda\nWASHINGTON (AP) — Former President Barack Obama made a surprise appearance Thursday at a progressive event in Washington, telling the crowd that American voters are rejecting the Trump agenda and offering hope that divisions within the Democratic party can be bridged.\nCoach buyouts piling up past $150 million, raising questions about whether the frenzy is sustainable\nMerely three weeks into the season, UCLA's DeShaun Foster and Virginia Tech's Brent Pry were out of a job. Seven weeks later, a half-dozen more coaches were added to the list of midseason firings – and high-profile ones at that.\nFederal judge orders Trump administration to fully fund SNAP benefits in November\nA federal judge in Rhode Island ordered the Trump administration Thursday to find the money to fully fund SNAP benefits for November.\nSupreme Court lets Trump block transgender, nonbinary people from choosing passport sex markers\nWASHINGTON (AP) — The Supreme Court on Thursday allowed President Donald Trump's administration to enforce a policy blocking transgender and nonbinary people from choosing passport sex markers that align with their gender identity.\nTrump administration speeds up new rules that would make it easier to charge some protesters\nWASHINGTON (AP) — The Trump administration is speeding up the implementation of new rules that would give the agency tasked with protecting federal government facilities greater authority to charge people for a broader array of offenses on or off those properties.\nMaryland sues Trump administration over location of FBI headquarters\nANNAPOLIS, Md. (AP) — Maryland officials sued President Donald Trump's administration Thursday for blocking the previously-approved construction of new FBI headquarters just outside the nation's capital.\nMan who threw sandwich at federal agent in Washington is found not guilty of assault charge\nWASHINGTON (AP) — A former Justice Department employee who threw a sandwich at a federal agent during President Donald Trump's law enforcement surge in Washington was found not guilty of assault on Thursday in the latest legal rebuke of the federal intervention.\nAppeals court gives Trump gets another shot at erasing his hush money conviction\nNEW YORK (AP) — A federal appeals court on Thursday gave new life to President Donald Trump's bid to erase his hush money conviction, ordering a lower court to reconsider its decision to keep the case in state court instead of moving it to federal court.\nBoeing won't face criminal charge over 737 Max crashes that killed hundreds of people\nDALLAS (AP) — Boeing will not face a criminal conspiracy charge over two 737 Max jetliner crashes that killed 346 people, after a federal judge in Texas on Thursday granted the government's request to dismiss the case.\nKey executive convicted of defrauding JPMorgan Chase is sentenced to over 5 years in prison\nNEW YORK (AP) — A top executive at a startup company that eased the process for college students applying for financial aid was sentenced Wednesday to over five years in prison for cheating JPMorgan Chase in a $175 million acquisition of the company four years ago.\nTrump unveils deal to expand coverage and lower costs on obesity drugs\nWASHINGTON (AP) — President Donald Trump unveiled a deal Thursday with drugmakers Eli Lilly and Novo Nordisk to expand coverage and reduce prices for the popular obesity treatments Zepbound and Wegovy.\nFDA warns websites selling unapproved Botox for cosmetic purposes\nU.S. health regulators on Wednesday sent warning letters to 18 websites selling counterfeit or unapproved versions of Botox and similar injectable drugs commonly used to smooth wrinkles.\nMusk could become history's first trillionaire as Tesla shareholders approve giant pay package\nNEW YORK (AP) — The world's richest man was just handed a chance to become history's first trillionaire.\nModern cars are spying on you. Here's what you can do about it\nWhile driving to a new restaurant, your car's satellite navigation system tracks your location and guides you to the destination. Onboard cameras constantly track your face and eye movements. When another car veers into your path, forcing you to slam on the brakes, sensors are assisting and recording. Waiting at a stoplight, the car notices when you unbuckle your seat belt to grab your sunglasses in the backseat.\nIRS Direct File won't be available next year. Here's what that means for taxpayers\nWASHINGTON (AP) — IRS Direct File, the electronic system for filing tax returns for free, will not be offered next year, the Trump administration has confirmed.\nThe FAA is slashing flights because of the shutdown. Here's what travelers can expect\nTravelers can expect to see fewer flights to many major U.S. cities starting Friday morning, when the Federal Aviation Administration said it would reduce traffic across 40 airports to ease the load on the nation's air traffic controllers.\nTravelers brace for chaos as US government shutdown threatens holiday flights\nNEW YORK (AP) — Travelers braced for canceled flights, scrambled plans and holidays stranded in airports as a U.S. government shutdown threatened to snarl trips across the country.\nMost major US airports – Nashville excluded – are among 40 targeted for shutdown flight cuts\nAirports in New York, Los Angeles and Chicago are among 40 of the busiest across the U.S. where flights will be cut starting Friday due to the government shutdown, according to a list distributed to the airlines and obtained by The Associated Press.\nThese are the airports that will reduce flights during the government shutdown\nThe Federal Aviation Administration is forcing airlines to cut 10% of their flights at 40 of the busiest airports across the nation to reduce pressure on air traffic controllers during the ongoing government shutdown and ensure that flying remains safe.\nAt White House meeting, Hungary's Orbán to seek Trump's blessing to keep buying Russian oil\nBUDAPEST, Hungary (AP) — When Hungarian Prime Minister Viktor Orbán visits President Donald Trump in the White House on Friday, his priority will be convincing the U.S. administration to turn a blind eye to Hungary's dogged commitment to buying Russian oil, a potential test of how deep the affinity goes between the two friendly leaders.\nZuckerberg, Chan shift bulk of philanthropy to science, focusing on AI and biology to curb disease\nREDWOOD CITY, Calif. (AP) — For the past decade, Dr. Priscilla Chan and her husband Mark Zuckerberg have focused part of their philanthropy on a lofty goal — \"to cure, prevent or manage all disease\" — if not in their lifetime, then in their children's. But during that time, they also funded underprivileged schools, immigration reform and efforts around diversity, equity and inclusion.\nLeaders of world's biggest polluters are no-shows as heads of state gather for UN climate summit\nBELEM, Brazil (AP) — World leaders descending on the United Nations annual climate summit in Brazil on Thursday will not need to see much more than the view from their airplane window to sense the unfathomable stakes.\nNational Retail Federation predicts first $1 trillion holiday shopping season\nNEW YORK (AP) — American shoppers are expected to spend more during this holiday shopping season than last year despite economic uncertainty and rising prices.\nDoorDash reports more orders than expected in third quarter, but warns of higher expenses ahead\nDoorDash reported higher-than-expected orders and revenue in the third quarter but warned investors that it will be spending significantly more on product development next year.\nGovernment says SNAP benefit cuts won't be as deep as announced for some families\nPresident Donald Trump's administration now says that SNAP food aid for November will be reduced less than originally announced, the latest in a political and legal saga that impacts how about 1 in 8 Americans can buy groceries.\nTrump taps DEI critic to lead workplace civil rights agency\nPresident Donald Trump has named Andrea Lucas as chair of the country's top workplace civil rights agency, the agency announced Thursday. The move signals a vote of confidence for Lucas's efforts to stamp out diversity programs, roll back protections for transgender workers and prioritize religious rights in the workplace.\nNancy Pelosi won't seek reelection, ending her storied career in the US House\nWASHINGTON (AP) — Speaker Emerita Nancy Pelosi will not seek reelection to the U.S. House, bringing to a close her storied career as not only the first woman in the speaker's office but arguably the most powerful in American politics.\nTrump is hosting Central Asian leaders as US seeks to get around China on rare earth metals\nWASHINGTON (AP) — President Donald Trump will host leaders of five Central Asian countries at the White House on Thursday as he intensifies his hunt for rare earth metals needed for high-tech devices, including smartphones, electric vehicles and fighter jets.\nBipartisan talks to end the shutdown intensify, but agreement elusive\nWASHINGTON (AP) — Bipartisan talks to reopen the government intensified on Thursday as lawmakers in both parties felt increased urgency to alleviate a growing airport crisis, pay government workers and restore delayed food aid to millions of people. But resolution still appeared far off amid internal disagreements in both parties over the best way to end the shutdown, now in its 37th day.\nTrump has other tariff options if the Supreme Court strikes down his worldwide import taxes\nWASHINGTON (AP) — President Donald Trump has warned that the United States will be rendered \"defenseless'' and possibly \"reduced to almost Third World status\" if the Supreme Court strikes down the tariffs he imposed this year on nearly every country on earth.\nTrump may become the face of economic discontent, a year after such worries helped him win big\nWASHINGTON (AP) — President Donald Trump got a serious warning from voters that he's out of touch with their fears about a deteriorating U.S. economy.\nDC National Guard deployment in the nation's capital ordered by Trump is extended to Feb. 28\nWASHINGTON (AP) — The Washington D.C. National Guard will be deployed to the nation's capital through the end of February, according to formal orders reviewed by The Associated Press.\nHegseth and Rubio share classified details on boat strikes with congressional leaders\nWASHINGTON (AP) — Top Trump administration officials briefed a small group of congressional leaders Wednesday on the growing military campaign to destroy alleged drug-smuggling vessels in the waters off South America, providing one of the first high-level glimpses into the legal rationale and strategy behind the strikes.\nTrump faces rare Republican pushback as he presses Senate to scrap the filibuster\nWASHINGTON (AP) — Republicans in Congress have spent most of the year acquiescing to President Donald Trump's demands — they've quickly confirmed his Cabinet nominees, passed his \" big beautiful bill \" of tax and spending cuts and kept his broad tariffs in place despite deep reservations.",
  "word_count": 7780,
  "scraped_at": "2026-02-14T12:13:10.418158"
}