{
  "article_id": "02aee2cc1a17",
  "url": "https://www.abante.com.ph/2023/12/28/pagsubok-tagumpay-dalamhati-sa-2023/",
  "title": "Pagsubok , tagumpay , dalamhati sa 2023",
  "date": "20231228T110000Z",
  "domain": "abante.com.ph",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Filipino sports fans are feeling a mixture of emotions this 2023, from the joy of winning, to the sadness of the passing of a well-known legend,\nLet’s look back at what happened in the last few months.\nJANUARY\nThe success of Ernest John Obiena shines early in the year 2023.\nObiena started the year s a silver medal in the opening of the indoor season at the Internationales Springer-Meeting in Cottbus, Germany with his reach of 5.77-metres behind American Sam Kendrick’s 5.82 metres.\nHe followed suit with gold in Perche En Or in Roubaix, France in the 5.82 meters to beat Jie Yao of China (5.70m).\nObiena’s back-to-back podium finishes immediately gave him the opportunity to kick off what the Philippines wants to send more athletes for the 2024 Paris Olympics.\nIn addition to Obiena,flyweight Aaron Bado led the country’s delegation to take home one gold, one silver and two bronze at the ASBC Asian U22 Boxing Championships in Bangkok, Thailand.\nThe fencers also delivered eight gold, seven silver and 11 bronze at the Southeast Asian Fencing Federation Championships in Kuala Lumpur to come second behind Vietnam, with 13 gold, 10 silver and 12 bronze.\nFEBRUARY\nEJ Obiena fulfilled his lofty streak to become one of the best pole valters in the world after the outstanding Filipino athlete performed the play that transformed his hot European indoor campaign in February.\nIn a short time, Obiena, 27, won two gold medals and one silver and bronze medals while touring Poland, Germany, Sweden and France.\nItaly-based Obiena started February, finishing third overall behind first-placer Armand Duplantis and silver medalist KC Lightfoot of the United States, at the Mondo Classic in Sweden.\nA few days later, it was Obiena’s time to lord it when he was leading the Orlen Cup in Lodz, Poland, with a 5.77 metre effort, further boosting his stock as one of the country’s best athletes.\nHis second gold also took place on Polish soil when Obiena made 5.87 to lead the Orlen Copernicus Cup.\nMARCH/APRIL\nGymnasticsCarlos Edriel Yulo ignited the country in March with the Creamline Cool Smashers and the Cignal HD Spikers in volleyball, while world champion Marlon Tapales and the TNT Tropang Giga celebrated rookie coach Jojo Lastimosa’s rise to the PBA Governors’ Cup crown in the clash crowd favorite Barangay Ginebra San Miguel in April.\nAfter a tumultuous start to his 2023 season with a bronze medal in the parallel bars in the first leg of the FIG World Cup Series in Cottbus Germany, Yulo is back to rebuild himself in the next three legs of the competition in two weeks.\nHe won the gold medal in his pet event floor exercise, in the Doha, Qatar leg as well as a bronze in the parallel bars at the Aspire Dome.\nThe Filipino dynamo hit his stride in the third leg by dominating the men’s parallel bars and vault event in the penultimate leg held in Baku, Azerbaijan.\nDespite the absence of popular ace player Alyssa Valdez, sidelined by injury, the Creamline Cool Smashers rose up on the occasion to carve out a 20-25, 25-20 25-18, 25-15 win over the Petro Gazz Angels to retain the PVL All-Filipino Conference crown.\nTots Carlos, Michele Gumabao, and Jema Galanza played key roles in their successful title defence after the two squads split their first two matches in the best-of-3 series.\nFilipino junior weightlifters captured the windfall, winning seven golds, four silvers and one bronze medal at the Youth World Weightlifting Championships at Ramazan Njala Sports Palace in Durrës, Albania.\nIn April, veteran boxer Marlon Tapales put the country back on the world map by beating a split-decision win over former unbeaten Murodjon Akhmadaliev of Uzbekistan to seize the IBF and WBA super bantamweight belts.\nThe first time was a charm for rookie mentor Jojo Lastimosa, leading TNT Tropang Giga against the Barangay Ginebra Kings 97-93 and former mentor Tim Cone in Game 6 to clinch their first PBA Governors Cup title in franchise history.\nMAY\nEach of the country’s 840-person delegations to the 32nd Southeast Asian Games in Cambodia has made May a prosperous month for Philippine sports.\nSEAG bets took 58 golds, 85 silvers and 117 bronzes – with accompanying meet records – in the 12-day competition in Phnom Penh.\nThe Pinoy warriors finished fifth overall but easily surpassed their 52-70-105 haul last year in Vietnam.\nGilas Pilipinas reclaimed the lost men’s basketball crown by redeeming and avenging 80-69 dispatch to host Cambodia.\nJUNE\nErnest John “EJ” Obiena and Carlos Edriel Yulo shine through the sports community to give Philippine sports a good finish in the first half of 2023.\nAfter having his own Southeast Asian Games record erased, Obiena climbed to higher heights as he joined the pole vault’s ultra-elite six-meter club on a sunny June afternoon in Bergen, Norway.\nIn one test, Obiena broke one of the toughest barriers in athletics to the Sparebanken Vest Bergen Jump Challenge gold medal and a place among the best pole-vaulters ever.\nYulo, for her part, dominated the Asian Artistic Gymnastics Championships in Singapore, where she anchored the Philippines’ three-gold, three-silver and three-bronze hauls.\nThe Filipino Para Games bets earned 34 golds, 33 silvers, and 50 bronze in the Cambodia meet to surpass the 28-30-46 collected last year in Indonesia. Leading it were six-gold winner Darry Bernardo and the chess delegation, who delivered 13 mints.\nDaniel Quizon led the standard and blitz events in the premier U20 division and earned his third GM norm as he led the 16-gold, 37-silver, eight-bronze harvest of the Philippines and second overall standing behind Vietnam.\nJULY\nWorld-caliber pole vaulter EJ Obiena is set to become the first Filipino to qualify for the Paris 2024 Olympics, while the Philippine national women’s football team’s notable play at the 2023 FIFA Women’s World Cup in New Zealand highlighted Philippine sports for the month of July.\nAfter suffering a heartbreaking 2-0 defeat at the hands of world No. 20 Switzerland in their debut at Dunedin Stadium on July 21, the Philippines, rated No 46, backed by their diehard fans from around the world, secured a 1-0 victory over No. 26 and tournament co-host New Zealand four days later in Wellington.\nThe extraordinary goal – courtesy of California-born forward Sarina Bolden – came in the 24th minute from a header that Kiwi goalie Victoria Esson was unable to deflect.\nThe Filipino duo of Johann Chua and James Aranas beat Joshua Filler and Moritz Neuhausen of Germany, 11-7, to win the World Cup of the Pool 9-Ball Championship.\nThe win was a record fourth for the country to lead one of the prestigious billiard events.\nAUGUST/SEPTEMBER\nWorld No. 2 and Asian pole vault record holder Ernest John “EJ” Obiena has launched the Philippines’ campaign in September to remember for the Philippines’ sporting warriors.\nObiena, who is the only Asian to reach 6 metres in the world, kept up with his lofty billing and produced the country’s first gold medal at the Hangzhou 19th Asian Games with a record-breaking Asian Games score of 5.90 metres.\nAlso shining was tennis star Alex Eala, who ended a 61-year thirst for the Pinay netters with her bronze in women’s singles, then teamed up with Francis Casey Alcantara to record a podium finish in mixed doubles.\nJordan Clarkson-led Gilas Philippines ended their stint at the FIBA World Cup with a 96-75 defeat to China in the classification stage to finish 24th overall and clinch a spot in the FIBA Olympic Qualifying Tournament.\nThe country also celebrated the successful World Cup hosting with a new record crowd of 38,115 set on opening night in the Philippines-Dominican Republic duel at the Philippine Arena.\nOCTOBER\nGilas Pilipinas and female athletes in billiards and jiu-jitsu once again demonstrated the Filipinos’ skill by showing strong motivation and motivation to elevate the Philippines with its October successes.\nGilas ended its 61-year agony with a storybook victory in men’s basketball at the Asian Games in Hangzhou, China, a victory highlighted by an epic comeback win over host Chinese in the semifinals, 77-76, and a payback 70-60 victory to the disappointing elimination Jordan in the finals.\nThe Nationals’ celebrated success in the sport closest to the hearts of Filipinos matched the gold medals won by jiu-jitsu artists Meggie Ochoa (-48kgs class) and Annie Ramirez (-57kgs category).\nWith pole vault star E.J. Obiena’s gold win in late September, the Philippines finished the Asian Games with four golds along with two silvers and 12 bronze.\nAlthough not in Asiad, pool stalwart Chezka Centeno also brought pride and honor to the country in other fields.\nCenteno led the Predator Women’s World 10-Ball Championship in Klagenfurt, Austria to join the elite club of Filipino global champions led by the distinguished Efren Reyes and Rubilen Amit.\nThe Para athletes continued the Philippines’ brilliance, winning 10 gold, four silver and five bronze medals at the Hangzhou Asian Para Games for the country’s ninth overall and best showing.\nBoxer Eumir Marcial and gymnasts Carlos Yulo and Aleah Finnegan punched their chairs in succession at the Paris Olympics.\nMarcial has qualified after taking silver in Hangzhou while fellow Tokyo vet Yulo earned her ticket to the World Artistic Gymnastics Championships in Antwerp, Belgium – the same tournament where Fil-Am Finnegan snatched hers.\nNOVEMBER\nWushu artists Mark Ragay, Mark Polo, and Vincent Ventura and other topnotch martial artists led the fight for the Philippines on the international stage in November.\nIn Muju, Korea, Patrick King Perez won gold in the mixed pair with Jocel Nibobla at the World Taekwondo Poomsae Open Challenge with the men’s team bronze with Ian Matthew Corton and Jeus Gabriel Yape.\nSa Yerevan, Armenia, nag-post si Sydney Sy Tancontian ng podium finish sa World Sambo Championship.\nThe youngsters also felt their presence, with Fide Master Gian Karlo Arca and jiu-jitsu prodigy Aielle Aguilar claiming world titles.\nArca, 14, won the World Youth Blitz Chess Championship in Montesilvano, Italy with 8.5 points in nine rounds, beating the title-winning rivals.\nAguilar, 6, was repeated as global ruler with her victory in the Girls Kids 2 White Belt 17kg category of the Abu Dhabi World Festival Jiu-jitsu Championships in UAE.\nDECEMBER\nThe sad month of December was filled with the passing of the so-called The Skywalker Avelino “Samboy” Lim two days before Christmas.\nMarlon “The Nightmare” Tapales also failed to defend his two-crown after being eliminated in the 10th round in his fight against Japan’s so-called “The Monster” Naoya Inoue.\nThe Philippine Sports Commission (PSC) has hosted two of its major multi-sports competitions focused on grassroots Batang Pinoy (BP) and elite athletes qualifying meet for the national squad Philippine National Games (PNG) despite the many issues, complaints and criticism.\nThe Pampanga Giant Lanterns were crowned champions and took home their first crown in the 2023 MPBL Finals after beating the Bacoor City Strikers by a 3-0 sweep five-game series.\nThe De La Salle Green Archers rose to a first-game defeat to claim the UAAP Season 86 men’s basketball tournament after beating the UP Fighting Maroons 2-1 in a do-or-die Game 3.\nThe San Beda Red Lions won the NCAA Season 99 basketball tournaments title after returning to losing the first game before beating the Mapúa Cardinals 2-1 in a do-or-die Game Three.\nHe also won the second All-Filipino Conference with Creamline Cool Smashers when he lost to the Choco Mucho Flying Titans in the best-of-three championship. Tots Carlos is the finals MVP while Sisi Rondina is the conference MVP.\n(Confused Oredo)",
  "word_count": 1910,
  "scraped_at": "2026-02-14T12:31:07.780923"
}