{
  "article_id": "02b705e27790",
  "url": "https://kfyi.iheart.com/content/2025-12-12-onlyfans-model-says-sherrone-moore-slid-into-her-dms-amid-scandal-arrest/",
  "title": "OnlyFans Model Says Sherrone Moore  Slid Into  Her DMs Amid Scandal , Arrest",
  "date": "20251212T151500Z",
  "domain": "kfyi.iheart.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "OnlyFans model Mia Sorety publicly claimed that former Michigan Wolverines head coach Sherrone Moore \"slid into\" her direct messages following news of his firing over an \"inappropriate relationship\" with a staff member and ensuing arrest.\nSorety, whose Instagram account is still followed by Moore's, wrote, \"I wasn't surprised he was all in my DMs trying to risk it all with an OF model,\" in response to criticism of Moore on X, with sports podcast host Justin Spiro claiming she was \"one of the many women he had such exchanges with,” along with a photo of the fitness influencer supporting the Wolverines at a game \"a couple years ago.\"\nSorety then confirmed \"he absolutely was\" in response to another X user who wrote \"$50 bucks he was probably AT LEAST in @miasorety's DMs.\"\nESPN's Pete Thamel reported on SportsCenter that Moore was acting \"strange\" in the lead-up to his firing.\n“There had been a lot of uneasiness on the Michigan staff, sources had told me Sherrone Moore had been acting strange, berating assistant coaches, not acting in a normal way,” Thamel said.\nAn initial investigation was reported to have calmed toward the end of Michigan's regular season, which concluded with a 27-9 loss to arch rival Ohio State on November 29, and began boiling over the past week, resulting in what was described as a \"rare\" move by Michigan, according to Thamel.\n“It is rare that you get a statement like the one Michigan had, being as explicit as they are, saying it was an inappropriate relationship with a staff member that led to Sherrone Moore’s firing,” he said.\nThamel reported that Moore was in custody in the Washtenaw County Jail in connection with \"an alleged assault\" hours after his firing with cause over an \"inappropriate relationship with a staff member,\" citing a press release sent by Pittsfield Charter Township, Wednesday night.\n\"Pittsfield Charter Township sent ESPN this press release, which does not name Sherrone Moore but references 'investigating an alleged assault.' Statement: 'A suspect in this case was taken into custody....,'\" Thamel wrote on his X account.\nRecords show that Moore was booked at 8:30 p.m. local time, however, no charges were listed at the time of publication Wednesday evening. University of Michigan athletic director Warde Manuel confirmed Moore's firing in a statement to Thamel earlier in the day.\n\"U-M head football coach Sherrone Moore has been terminated, with cause, effective immediately. Following a University investigation, credible evidence was found that Coach Moore engaged in an inappropriate relationship with a staff member,\" Manuel said via Thamel.\nMichigan associate head coach Biff Poggi, who returned to the position in 2025 after spending two seasons as the Charlotte 49ers' head coach, will take over as the Wolverines' interim head coach, according to Manuel. Poggi, 65, had previously served as an interim when Moore, 39, served a self-imposed two-game suspension during the 2025 regular season.\nMoore went 16-8 during his tenure as Michigan's head coach, which included a non-conference win against Bowling Green, as well as three wins against Penn State, Maryland and Ohio State credited to former head coach Jim Harbaugh during the 2023 national championship season when Moore served as acting head coach in Harbaugh's absence due to a suspension. The former guard replaced Harbaugh when the latter accepted the head coaching position with the NFL's Los Angeles Chargers in 2024 and went 8-5 (5-4 Big Ten) during his first season and 7-3 (6-2 Big Ten) in 2025.",
  "word_count": 577,
  "scraped_at": "2026-02-14T14:19:59.188872"
}