{
  "article_id": "02bf93a3350c",
  "url": "https://k2radio.com/cowgirls-defeat-spartans-behind-pedersens-career-high-24-points/",
  "title": "Cowgirls Defeat Spartans Behind Pedersen Career - High 24 Points",
  "date": "20230307T153000Z",
  "domain": "k2radio.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Cowgirls Defeat Spartans Behind Pedersen’s Career-High 24 Points\n* University of Wyoming press release\nLARAMIE -- The University of Wyoming women’s basketball team began its Mountain West Conference Tournament journey Monday night. The No. 2-seeded Cowgirls battled No. 10-seeded San Jose State inside the Thomas & Mack Center.\nWyoming relied on its defensive prowess en route to a 72-57 quarterfinal victory. The win advances the Cowgirls to the semifinals Tuesday at 8:30 p.m. MST where they’ll meet the winner between Colorado State and Boise State.\n“We are playing March basketball defensively,” associate head coach Ryan Larsen said. “That’s a good team. I’ve said it all year, both times we’ve played that team how much they’ve improved. We played well to get them today. That’s a good team, and we played really well today.”\nWyoming’s offense didn’t begin the game in the sharpest of ways, but it warmed up as the contest wore on. A good bit of that can be attributed to Malena Pedersen.\nThe recently named Mountain West Freshman of the Year poured in a career-high 24 points. She did it efficiently from all over, connecting on 7 of 11 from the floor, 2-for-4 from 3-point land and 8 of 9 from the charity stripe.\nThat spearheaded an offense that shot 48.9 percent (22-for-45) from the floor and 22.2 percent (4-for-18) from 3-point land. Wyoming made hay at the free throw line, making 24 of its 32 attempts.\nAllyson Fertig also scored in double figures, registering a double-double of 13 points and 11 rebounds. Quinn Weidemann chipped in nine points and three assists, while Marta Savic and Grace Ellis had nine and eight points, respectively.\nWyoming’s defense was a consistent force all night. It held San Jose State to 32.3 percent (20-for-62) shooting from the floor and 41.2 percent (7-for-17) from deep.\n“We switched some things up from what we’ve done in the past, and it worked pretty darn well,” Larsen said.\nJada Holland paced San Jose State with 17 points. Sabrina Ma and Aarion Nichols logged 11 points apiece.\nWeidemann opened the scoring with a 3-pointer at the 8:23 mark, as Wyoming scored the game’s first seven points. She added another bucket, and the Cowgirls built a 13-6 lead at the end of the first quarter.\nAfter scoring four points in the first 10 minutes, Pedersen quickly added to that total in the second frame. She poured in 10 more, helping to balloon the Cowgirls’ advantage to 29-16.\nFive straight points from Savic helped swell Wyoming’s lead to 20 at 43-23 midway through the third quarter. The Cowgirls kept their distance from then on out.\nUniversity of Wyoming’s Top 50 Football Players\nGallery Credit: 7220Sports.com",
  "word_count": 447,
  "scraped_at": "2026-02-14T13:46:08.022022"
}