{
  "article_id": "02c1234fd1fc",
  "url": "https://punchng.com/morocco-2025-flamingos-defeat-bantwana-2-0-in-second-leg/",
  "title": "Morocco 2025 : Flamingos defeat Bantwana 2 - 0 in second leg",
  "date": "20250316T000000Z",
  "domain": "punchng.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Nigeria’s Flamingos secured a comfortable 5-1 aggregate victory over South Africa’s Bantwana with a 2-0 win in the second leg of their FIFA U-17 Women’s World Cup qualifying fixture in Ikenne-Remo on Saturday.\nTwo-goal heroine in the first leg, Harmony Chidi coolly nodded home from an acute angle in the 37th minute, to compound the fixture for the visitors who lost the first leg at home 1-3.\nShakirat Moshood, who scored a goal in the first leg, was the provider from a well-taken free kick on the right. She turned provider again 11 minutes into the second half, when she found Aishat Animashaun, who lifted the ball over and above Samekelise Mthembu into the net for Nigeria’s second.\nZoe October, Thoriso Mphelo, Khmezi Khoza and captain Katleho Malebana impressed in the ranks of the Bantwana, but they could not find a way through the Nigerian defenceline of Hannah Ibrahim, Jumai Adebayo, Philomena Isaiah and Favour Iheagwam.\nHead coach of Nigeria’s women’s U-17 national team, Bankole Olowookere, had earlier emphasised the importance of maintaining focus despite their first-leg advantage.\n“We are very much aware of the fact that it is never over until it is over. It would be foolish to assume otherwise. Yes, we won 3-1 away in South Africa, but the contest is still alive. That is our mentality,” Olowookere had said before the match.\nThe Nigerian tactician’s cautious approach paid dividends as his charges delivered a disciplined performance to complete the job on home soil.\nSouth African coach Ntombifuthi Khumalo had expressed optimism before the match despite the challenging situation.\nVictory sprung the Flamingos to the final round of the qualifying race, where they face the winner of the fixture between Botswana and Algeria next month. Botswana currently hold a 2-1 advantage from their first leg encounter.\nThe Morocco 2025 FIFA U-17 Women’s World Cup will be the eighth edition of the biennial international youth football tournament.",
  "word_count": 319,
  "scraped_at": "2026-02-14T12:34:59.518304"
}