{
  "article_id": "02fe63ffd27a",
  "url": "https://www.hertfordshiremercury.co.uk/news/hertfordshire-news/hertfordshire-men-women-jailed-2019-3651288",
  "title": "The Hertfordshire men and women jailed in 2019 and their shocking crimes",
  "date": "20231215T011500Z",
  "domain": "hertfordshiremercury.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "As we come into the new year, some criminals will be spending time behind bars rather than with their families in the coming months and even years.\nPedophiles, rapists and burglars from across Hertfordshire and beyond were locked up for their crimes in 2019.\nHere are the criminals put behind bars last year - and what they did.\nLeon Browne\nA firearm supplier from Watford was jailed after fleeing the country to the Netherlands while under investigation.\nLeon Browne, 33, appeared at St Albans Crown Court on November 25, where he was found guilty and sentenced to 18 years in prison for conspiracy to transfer firearms and ammunition.\nBrowne, from Gladstone Road, went under investigation for the offence in 2016, but was not arrested until December 2018 after he fled the country.\nHe was extradited under the terms of a European Arrest Warrant and brought back to the UK to face justice.\nDetective chief inspector Tracy Pemberton from Hertfordshire Constabulary’s Serious and Organised Crime Unit, said: “As part of our continuing work targeting violent criminal networks, this conviction will help to disrupt the supply of firearms in the county.\n\"We have relentlessly pursued this investigation, using all our powers to bring offenders to justice.\n\"This is another key conviction which has made a significant impact on the criminal networks in Hertfordshire.\n“Operation Relentless is Hertfordshire Constabulary’s response to the on-going threat from organised criminal gangs.\n\"These groups pose a threat to local communities and the force is committed to identifying and relentlessly pursuing individuals and networks involved in serious and organised crime.\n\"As part of this work, we depend on information from members of the community to help us crack down on serious and organised crime.\"\nRosemary Mills\nA woman from Hatfield was put behind bars after she stole money from an older family member.\nRosemary Mills, 50, of Stockbreach Road, was jailed for a year for fraud and theft, appearing in St Albans Crown Court on Tuesday, November 12.\nIn March 2017, Mills had been trusted with her relatives bank card to buy them toiletries and withdraw money and their behalf.\nIn November of that year, the victim requested the bank card to be given back because Mill's visits to their care home had become infrequent and when she did visit she would not bring any money with her.\nMills told the victim they didn't need the bank card and that she would continue to look after it.\nIn February 2018, Mills suddenly returned the bank card. The victim was then taken for a visit to a garden centre by another family member and during the visit they went to an ATM machine and requested a bank balance.\nThe victim realised their bank balance was a lot less than it should have been and they ordered bank statements to see what had happened.\nThese showed a range of fraudulent activity including online transactions, cash withdrawals, card payments and iTunes payments.\nMembers of the family grew suspicious of Mills and her insistence on keeping the bank card. On March 13, 2018, they phoned her to tell her about these transactions and she denied being responsible and agreed when the family suggested the card could have been cloned.\nThe next day they rang again hoping she would confess. They told her that they were going to the bank to report the fraudulent activity.\nAfter returning from the bank, Mills called the family and admitted to spending the money.\nShe asked them not to call the police and said she could pay the money back at £25 a week as that was all she could afford.\nOn March 27, 2018, Mills was arrested on suspicion of theft and taken to Stevenage Police Station.\nShe pleaded guilty on Tuesday, November 12, to stealing £2858.30. She was then sentenced to a year in prison and a restraining order was put in place against the victim, preventing Mills from contacting them.\nDetective constable Sarah Hopkins, from the Constabulary’s Safeguarding Adults from Abuse Unit, said: \"Stealing from any victim is bad enough, but stealing from a vulnerable family member who trusts and loves you is especially cruel.\n\"I hope that Mills spends her time in prison reflecting on the severity of her actions and the pain it caused to the victim and wider family.\"\nAngela Taylor and Paul Cannon\nA woman and her new partner from Hitchin were sent to prison after killing her wealthy husband.\nAngela Taylor, 53, of Charlton Road and Paul Cannon, 54, of Pirton Road, were both found guilty of murder and arson.\nOn June 4, 2018, William 'Bill' Taylor, 70, a farmer, was reported missing from his home in Hitchin. On February 10 of this year, his body was found in the River Hiz near Charlton Road, Hitchin.\nBill had been married to Taylor since 1997 but had separated since 2015. A post-marital agreement had split his significant amount of land which was worth several million pounds.\nIn July 2017, Taylor then met Cannon and they began a relationship. By March 2018, she then began divorce proceedings against Bill's wishes.\nTaylor and Cannon had a venomous hatred for Bill and despite him signing over considerable land and property to her, Taylor didn't think this was enough.\nWhatsApp messages between the pair made it clear they were planning on murdering Bill and potentially recruiting others to carry it out.\nA week before Bill went missing, he reported an allegation of arson to the police after his vehicle was set alight.\nAfter a trial at St Albans Crown Court, on Monday, November 4, Taylor and Cannon were both found guilty of murder and arson.\nOn November 8, they were both handed a life sentence with a minimum of 22 years for murder. They were also sentenced to two years for the arson, which will run concurrently.\nDetective chief inspector Carl Foster, from the Bedfordshire, Cambridgeshire and Hertfordshire Major Crime Unit, said: \"I hope that Angela Taylor and Paul Cannon’s time behind bars is spent reflecting on their evil actions.\n\"Bill was a well-loved father and grandfather and not long after he was reported missing, he should have been celebrating his 70 birthday with his loved ones.\n\"My thoughts remain with Bill’s family, who have acted with dignity throughout the investigation and trial.\n\"While nothing will end their pain, I hope that this sentence gives them peace of mind, knowing that Bill’s murderers are facing justice in prison.\"\nDanny Armstrong\nA man has been put behind bars after attacking ambulance staff outside a club in Stevenage.\nDanny Armstrong, 28, of Eynesbury, Cambridgeshire, was jailed for 16 weeks after he assaulted seven emergency workers.\nOn Tuesday, November 18, at around 11.30pm, emergency services attended a report of a disturbance at The Forum.\nSix police officers and a member of the East of England Ambulance service were subsequently assaulted during the incident where they suffered minor injuries.\nAppearing by video link at St Albans Magistrates' Court, Armstrong pleaded guilty to seven counts of assault by beating of an emergency worker, criminal damage and racially aggravated harassment with sentences to run concurrently.\nHe was also ordered to pay £122 in victim surcharge.\nJason Robinson, Dean Dias, William Roberts, Kieran Kenna\nThese four men were sentenced to a total of more than 39 years in prison after being found guilty of drug related offences.\nThe men all formed part of an organised crime group, supplying cocaine to areas across Hertfordshire, particularly St Albans and also to surrounding counties.\nFollowing an investigation, the organised crime group was dismantled.\nThe four men appeared at Harrow Crown Court on November 18, having already been found guilty of conspiracy to supply Class A drugs.\nThey received the following sentences:\n- Jason Robinson, 35, or Orchard Crescent, Stevenage, was sentenced to 12 years\n- Dean Dias, 34, of Harrow Way, Watford, was sentenced to 10 years 4 months\n- William Roberts, 31, of Springfield Gardens, Woodford Green, was sentenced to 9 years\nKieran Kenna, 36, of Sheepfold Lane, Amersham, was sentenced to 8 years 6 month\nJoin our HertsLive WhatsApp messaging service\nTo receive WhatsApp messages with the main headlines, as well as breaking news alerts, text the word 'NEWS' to us via WhatsApp at 07557 825422.\nThen add the number to your phone contacts book as 'HertsLive'.\nNote: All requests to join our messaging service MUST be submitted via WhatsApp. Any SMS messages will not be added.\nYour phone number won't be shared with other members of the group.\nThe above mobile number can't be used for phone calls.\nAnother member of the group, Ashley Haw, 31, of Roundwood Road, Amersham, Buckinghamshire, is due in court on December 16, after pleading guilty to drug supply offences.\nDetective chief inspector Tracy Pemberton, from Hertfordshire Constabulary’s Serious and Organised Crime Command, said: \"These convictions are the result of a long term investigation into one of the major drug supply networks across Hertfordshire.\n\"We have managed to totally dismantle this organised crime group, which has been involved not only in drug dealing but also violent crime. Its members posed a great threat to the community.\n\"Operation Relentless is Hertfordshire Constabulary’s response to the on-going threat from organised criminal gangs.\n\"These groups pose a threat to local communities and the force is committed to identifying and relentlessly pursuing individuals and networks involved in serious and organised crime.\n\"As part of this work, we depend on information from members of the community to help us crack down on drug-related crime.\n\"Any information you can provide, no matter how small it may seem, could help us to identify and apprehend drug dealers.\"\nAllen Meredith\nAllen Meredith, 72, of Chipping Norton, Oxfordshire, was jailed for seven years after he pleaded guilty to multiple historic sexual offences against children.\nMeredith had been employed as a housemaster at The Royal Alexandra and Albert School in Surrey in the 1980s, before going on to work at The Royal Caledonian School in Bushey between the 1980s and 1990s.\nAs part of his role as 'housemaster', he was in charge of dormitories and would use his authority to get his victims alone in his bedroom, which is where he would carry out his abuse.\nThe offences came to light in 2016, when one of his victims reported the abuse he had endured to the police.\nThere were a total of 14 charges, all relating to offences that were committed against five victims who were all pupils at the schools Meredith had been working at.\nOn November 27, he appeared at St Albans Crown Court after pleading guilty at a hearing three weeks before.\nHe was sentenced to seven years in prison and will be placed on the sex offenders' register for life.\nDetective constable Jason Tinsey, who investigated the case, said: \"Multiple children suffered years of abuse whilst in Meredith’s care. He took advantage of his position of trust and authority in the most horrific way imaginable, and stole the innocence of these young children.\n\"His victims have been incredibly brave coming forward to report what happened to them, and I hope that this result can provide them with some sense of closure, so that they can move forward after seeing their abuser bought to justice.\n\"I’d like to take this opportunity to stress that we take all reports of abuse seriously. We are here to bring offenders to justice, regardless of how much time has passed, and we will always support the victim throughout the investigative process.\"\nDeshaun Campbell-Ngonga\nA man who was arrested in Watford has been jailed after police found he had links to county line drug-dealing.\nDeshaun Campbell-Ngonga, 19, of no fixed address, was sentenced to four years in prison for drug offences.\nOn May 30, 2019, Campbell-Ngonga was stopped by officers after he was spotted acting suspiciously in Queens Road in Watford.\nThey seized his mobile phone during the search, which was later found to be associated with a county line drug network operating in the area.\nOn July 11, a search warrant at an address in North London was served while Campbell-Ngonga was inside and another mobile phone linked to a county line that was operating in Basingstoke was seized.\nOfficers also found a quantity of cannabis and 10 grams of a cutting agent, known to be used with crack cocaine and heroin.\nCampbell-Ngonga was arrested and charged with supplying or offering to supply a controlled drug and remanded into custody.\nCampbell-Ngonga appeared at St Albans Crown Court on Tuesday, November 5, where he plead guilty and was sentenced to four years in prison.\nDetective constable Chris Duncan from Hertfordshire Constabulary’s Operation Mantis Team said: \"This was a great piece of detective work, from the initial stop and search of the offender, which identified his links to county lines, to the subsequent investigation and arrest.\n\"It will send a message to criminals who are exporting drugs and violent crime into our communities that they will be arrested and jailed.\n\"We have made many significant arrests and our continuing operations are having an impact on the county lines networks operating in Hertfordshire, and we will continue to disrupt gang activities and stop the supply of drugs into our towns.\"\nKane Fanelli\nA man in his twenties was put behind bars after he tortured and abused a toddler for years.\nKane Fanelli, 27, of Clover Close, Luton, was given a 22-year sentence at St Albans Crown Court on Thursday, October 17.\nBetween May 2018 and June 2018, Fanelli subjected an 18-month-old male toddler to a protracted campaign of abuse.\nThe child, who has now been safeguarded, suffered a catalogue of traumatic injuries including bruising, swelling, bite marks, burns, cuts and abrasions.\nOn Sunday, July 2018, the victim was presented at hospital with an injury and after doctors conducted a thorough physical examination, they discovered a large number of other painful injuries they deemed non-accidental and the police were called.\nOne of the paediatrician's who assessed the victim said that \"in over 25 years of paediatric practice he had rarely seen such extensive injuries in a child\" and that it was \"fortuitous he was alive\".\nThe victim was given medical treatment to relieve his pain before being immediately placed under police protection.\nFanelli was arrested on Thursday, July 4, 2018 before later being charged in connection with the investigation.\nOn October 17, Fanelli was found guilty of two counts of grievous bodily harm (GBH) with intent and one count of sexual assault against the victim.\nFour days later he was sentenced to an 18-year custodial sentence and an additional four years on extended licence at St Albans Crown Court.\nHowever, he will be assessed prior to release from prison to ensure he no longer poses a danger to the community.\nHis name will appear on the Sex Offenders’ Register indefinitely and he will also be subject to a lifetime Sexual Harm Prevention Order (SHPO) with a number of terms which prevent him having contact with any child under the age of 16.\nFanelli is prohibited from contacting the victim, who is now three years old and thriving in foster care.\nMohammad Ahmed\nA BMW driver from Epping has been jailed after his dangerous driving led to the death of a woman in her 70s on the A10 near Reed.\nMohammad Ahmed, 36, of Upland Road, of Thornwood, was sentenced two and a half years at St Albans Crown Court on Friday, October 4, after admitting causing death by dangerous driving.\nAhmed was driving a silver 320 BMW which collided with a Volkswagen Move Up on the A10 northbound carriageway, at the junction for Reed, on the morning of Sunday, July 14.\nRear seat passenger of the Volkswagen, Catherine Roberts, 77, of Links Side, Enfield, sustained fatal injuries. The driver, Kenneth Roberts, 80, was seriously injured and treated at Addenbrooke’s Hospital.\nAhmed was also disqualified from driving for four years and three months. He had pleaded guilty to causing death by dangerous driving at a previous hearing.\nPolice constable (PC) Neil Crosier, from the Bedfordshire, Cambridgeshire and Hertfordshire Road Policing Unit, said: “Ahmed’s dangerous driving on this morning cost the life of a much-loved lady and left her husband badly injured.\n\"Our thoughts remain with Catherine’s family at what continues to be a difficult time.”\nEdward Putman\nA lottery winner and convicted rapist has been jailed after conspiring with a Camelot employee to claim the £2.5million jackpot.\nEdward Putman, 54, was convicted in St Albans Crown Court on Friday, October 4, for using a fake ticket in 2009, reported The Mirror.\nThe builder from Kings Langley conspired with a security guard working for Camelot, his friend Giles Knibbs, who worked at the company from 2004 to 2010 and knew how to cheat the system, the court heard.\nPutman claimed he found the ticket under a seat in his van, but the jury heard that he had previously had convictions for rape and benefit fraud.\nThe authorities released an image of the ticket he used to con Camelot out of the jackpot in the forgery that even fooled the top Lotto operator.\nThe genuine winning ticket, which was bought in Worcester, has never been discovered.\nHis friend, Mr Knibbs, felt he did not receive a fair share of the winnings, the court heard, ending with a bitter argument between the pair.\nLater that year, Mr Knibbs killed himself after being arrested for blackmail, burglary and criminal damage.\nPutman denied his charges and entered the court covering his face and filming members of the media on his phone, but was found guilty by the jury.\nHe was subsequently jailed for nine years.\nPassing sentence, Judge Philip Grey said: \"You would have got away with this but quite plainly you were greedy.\n\"This crime struck at the integrity of the National Lottery. You have also undermined the public's trust in the lottery itself.\"\nThe Judge added the fact Camelot had been \"hoodwinked in this way will of course be damaging to its reputation\".\nPutman had been paid the jackpot by Camelot even though the bottom part of his slip was missing the barcode, the trial heard.\nThe court also heard that he had hatched the plot with Mr Knibbs - who then worked in the securities department at the Lottery operator - with the pair submitting a deliberately damaged forgery just before the 180-day limit to stake claims expired.\nHowever, Mr Knibbs became increasingly erratic and began revealing details of the con to other people.\nMr Knibbs confronted Putman in a heated argument in June 2015, breaking Putman's wing mirrors and stealing his phone.\nThe lottery worker was subsequently arrested for burglary, blackmail and criminal damage after Putman complained to police.\nHe later killed himself after fearing he would go down for \"10 to 15 years for blackmail\", the trial heard.\nEvidence suggested Mr Knibbs was initially paid £280,000 by Putman for his part, followed by much smaller increments totalling £50,000.\nThe scam began after Mr Knibbs saw documents being printed containing details of big wins that had not yet been claimed while working late one night.\nProsecutor James Keeley told the court there was \"some trial and error\" in producing a successful forged ticket.\nAs a result several different specimens had been made, each with one of the 100 different possible unique codes on the bottom.\nMr Knibbs had claimed Putman went to 29 different shops as the clock ticked down to claim the cash, providing a different ticket at each one, before the right number was found.\nMr Keeley said Putman eventually submitted the correct code at a shop in High Wycombe, on August 28, 2009.\nDespite his multi-million pound windfall, three years later in 2012, Putman was sentenced to nine months for benefit fraud after going on to claim £13,000 in housing and income support.\nHis previous convictions also include the rape of a teenager in the early 1990s, for which he was sentenced to seven years.\nJoyce Baker\nA woman in her sixties was jailed after funding her lavish lifestyle and gambling addiction by stealing money from a Berkhamsted-based company over six years.\nJoyce Baker, 61, of Briary Way, Hemel Hempstead, was convicted for fraud after pleading guilty to stealing more than £2million from her employer.\nShe appeared in St Albans Crown Court on September 9, 2019, where she was sentenced to five years and 10 months in prison, for abusing her position and eight breaches of a financial restraining order.\nDetective constable Liz Heath, of Hertfordshire Constabulary’s Serious Fraud and Cyber Unit, said: “Baker used her trusted position within the company to steal from her employer and conceal that the money was being siphoned into bank accounts she owned.\n\"Between 2012 and 2018 she was able to transfer small payments of a few thousand pounds disguised as payments to suppliers.\n“It wasn’t until Baker left the company that her financial activities came to light, but by this time the company had lost over £2m.\n\"After months of careful investigation we were able to gather enough evidence to build a case against her.\n\"Our investigators have done a great job and are now attempting to recover the stolen money through the Proceeds of Crime Act, by seizing assets belonging to the offender.\n\"The sentence handed out reflects the scale of the fraud and the impact her actions had on the company and its employees.”\nScott Anthony\nA Watford man was jailed after he tried to flee from police while in possession of Class A drugs.\nScott Anthony, 26, of Monica Close, was sentenced to seven years in jail after a trial at St Albans Crown Court on Friday, September 6.\nAnthony's car was stopped by police at around 11.50pm on March 9, after they received intelligence suggesting he was involved in the supply of drugs.\nOfficers noticed drug paraphernalia in the car and found four small wraps of cocaine after a search, but the defendant attempted to make off before being detained and arrested on suspicion of possession with intent to supply.\nAn investigation was carried out by the Constabulary’s Case Investigation Team (CIT), which involved extensive phone work and analysis.\nAs a result of the supporting evidence gathered, Anthony was charged and remanded and subsequently found guilty by unanimous verdict.\nDetective constable Ben Dransfield, who led the investigation, said: “This is a fantastic result, especially considering a relatively small amount of Class A was found during the initial stop.\n\"However, the hard work put into the investigations around Anthony’s phone enabled us to seal a conviction and custodial sentence.\n“Drug use and supply can have a huge impact on local communities as it often leads to more violent crime.\n\"We will not tolerate this kind of behaviour in Hertfordshire and will continue to crack down on those involved.”\nMohammed Adil Khan and Nasir Hussain\nTwo men from Watford were jailed for more than eight years after using a taxi to smuggle cocaine worth around £10,000.\nMohammed Adil Khan, 28, of Druban Road, and Nasir Hussain, 25, of Hagden Lane, were found guilty of conspiracy to supply class A drugs at St Albans Crown Court on August 29.\nBoth men played a part in supplying cocaine from Watford to the Luton area, with Khan working as a taxi driver while transporting the drugs.\nHussain used several mobile phones or 'lines' to sell the drugs to customers in Luton, as part of an organised drug ring operation.\nDetective chief inspector Tracy Pemberton of Hertfordshire Constabulary’s Serious and Organised Crime Unit said: “These convictions are the result of a long term investigation into the supply of drugs in Watford and other areas, we have made great progress in disrupting established drug supply networks in the area.\n\"Due to extensive covert work and intelligence we have gathered we have been able to make several key arrests, which has made a significant impact on the supply of drugs in Hertfordshire.\"\nBoth men were convicted after pleading not guilty to the crimes, with Khan sentenced to two years and nine months and Hussain sentenced to six years in prison.\nThe men were part of an organised crime group and were arrested following a lengthy and complex investigation as part of Operation Relentless by Hertfordshire Constabulary’s Covert Investigations Unit.\nDCI Pemberton added: “Operation Relentless is Hertfordshire Constabulary’s response to the ongoing threat from organised criminal gangs.\n\"These groups pose a threat to local communities and the force is committed to identifying and relentlessly pursuing individuals and networks involved in serious and organised crime.\n\"As part of this work, we depend on information from members of the community to help us crack down on drug-related crime.\n\"Any information you can provide, no matter how small it may seem, could help us to identify and apprehend drug dealers.\"\nRead the full story behind the drug dealers here.\nPalitey Faye\nA drug dealer who was found with cocaine worth over £12,000 at a property in Hemel Hempstead and ran a county lines drug network has been jailed.\nPalitey Faye, 22, from Souhborough Road, London, was sentenced to four-and-a-half years in prison after appearing at Luton Crown Court on August 7.\nOfficers from Hertfordshire Constabulary’s Operation Support Group arrested him at an address in Coleridge Crescent, Hemel Hempstead on June 26, 2019, after a warrant was served on the property.\nOfficers discovered cocaine in the property with an estimated value of more than £12,000.\nHe was sentenced for possession with intent to supply class A drug (crack cocaine) after pleading guilty.\nPC Rob Harlow from Hertfordshire Constabulary’s Operational Support Group, said: “We continue to target those who are involved in county lines drug dealing.\n\"These criminals set up their operations in our towns and bring violence, drugs and crime into our communities.\n\"Young and vulnerable people are often the ones who suffer the most, being drawn into criminal activities, drugs and even sexual exploitation.\n“We have made a significant impact on the county lines networks operating in Hertfordshire over the last year, disrupting gang activities and seizing large quantities of drugs and cash during these operations.\n“We continue to work with partners to raise awareness of county lines among young people, parents, teachers and other members of the community to help protect the vulnerable and prevent them from being pulled into this kind of activity.”\nDean Sarney, John Sebborn and Craig Raeside\nThree burglars who stole more than £660,000 worth of cars in 32 burglaries were jailed for more than 23 years between them.\nThe organised gang appeared at St Albans Crown Court on August 21, and were found to have targeted homes with high value cars in their driveways at night.\nHandbags and wallets were stolen from people's homes across Hertfordshire, Bedfordshire, Buckinghamshire and Essex from April to October 2018, before the burglars left in the victims' cars.\nDetective constable Paul Cullinan, of Hertfordshire’s Specialist Investigation Team said: “These defendants operated as part of an organised criminal group committing a spree of offences across the home counties.\n“They thought they were untouchable and displayed disdain for the law, but more importantly disdain for the victims of their crime.\n“They left a trail of misery behind them and I hope they spend their time behind bars thinking about the devastation they have caused.”\nDean Sarney, 36, of Derwent Road, Luton, and John Sebborn, 35 and of Three Star Park, Lower Stondon, were each sentenced to nine years and nine months imprisonment.\nCraig Raeside, 43, and of Ridgeway Road, Luton, was jailed for three years and nine months for his part in the series of offences.\nWayne Brown\nA \"dangerous\" stalker from Hatfield was jailed after he smashed his way into a woman's home with a metal pole.\nWayne Brown, 44, of Drovers Way, admitted to stalking a woman between April 14 and 25 this year and was sent to prison by a judge at St Albans Crown Court on Tuesday, July 31.\nHe also admitted to taking her phone, trying to check her messages, and asking who she was with.\nAdditionally, he would ask where she was going and he text her and broke into her home.\nNeighbours had reported seeing him crawling out of the victim's back garden under a hedge on more than one occasion.\nOn April 25, he smashed through her patio doors at the back of her home with a metal pole and entered her bedroom, grabbing her phone as she tried to call the police.\nJoin the Hertfordshire Court Watch group on Facebook for more\nWant to keep up to date with everything going on in courts across Hertfordshire?\nJoin the Hertfordshire Court Watch group on Facebook to see who is in the doc, the latest on live trials and who has been sent to prison.\nHe later returned, smashed another window and her TV and Sky box with the pole. Hertfordshire Constabulary arrested him shortly afterwards.\nHe was jailed for three years and four months and was also handed an indefinite restraining order to protect his victim upon his release.\nInvestigating officer, detective constable Natalia Allodi-Robertson, from the Domestic Abuse Investigations and Safeguarding Unit (DAISU), said: \"Wayne Brown is a dangerous offender who terrified the victim for months without a thought for her feelings.\n\"He stalked her and then broke into her home and damaged her property out of jealousy and malice towards her.\n\"This was the right result at court for the victim, who is relieved that the case has come to this positive conclusion.\n\"We want other victims to know that we take every report of stalking very seriously, and will always fully support victims throughout the investigative process and we bring offenders to justice.\"\nRead the full story here.\nDaniel Pateman\nA \"persistent domestic abuser\" from Stevenage who threatened to kill himself, his girlfriend and her father has been jailed.\nDaniel Pateman, aged 37, of no fixed abode, appeared before St Albans Crown Court on July 31, for mentally and physically abusing his then-girlfriend\nHis charges included biting her, punching her and threatening to kill her and he was sentenced to three years and nine months in prison after pleading guilty to four offences.\nPateman would threaten to kill himself and his girlfriend and her father, saying he would stab her and burn her house down.\nThe court heard that he would often turn up at her workplace and be aggressive, accusing her of cheating on him with other men and would control who she could spend time with.\nHe caused £5,000 damage to her house after breaking in, threatened to stab her and her family.\nHe was sentenced for:\n- Controlling or coercive behaviour in an intimate or family relationship - three years and nine months imprisonment and a restraining order for five years, not to go to his victim’s home in Stevenage, plus a £170 fine\n- Assault by beating - three months’ imprisonment, to run concurrently\n- Sending electronic communication with intent to cause distress or anxiety – 12 months’ imprisonment, to run concurrently\n- Damaging property – 12 months’ imprisonment, to run concurrently\nInvestigating officer, detective constable Ryan Lloyd, from the Domestic Abuse Investigations and Safeguarding Unit (DAISU), said: “Pateman is a persistent domestic abuser who constantly prays on his victim to control every aspect of her life.\n\"He didn’t admit all the offences until day two of the trial, which just added to his victim’s distress. I am glad to see him jailed for a lengthy spell.\n“We take every report of domestic abuse extremely seriously, and will always fully support victims throughout the investigative process. We are here to bring offenders to justice.”\nIf you have been a victim of domestic abuse, you can report it to police on the non-emergency number 101, or online at www.herts.police.uk/report.\nRodrigo Giraldo\nA Columbian refugee was jailed for life after being found guilty of murdering his wife at their home Hemel Hempstead.\nRodrigo Giraldo, (Alberto Rodrigo Giraldo-Tascon), aged 56, from Ritcroft Street, was convicted following a trial at St Albans Crown Court on July 29.\nHe previously pleaded guilty to preventing the lawful burial of Luz Margory Isaza Villagas, known as Margory.\nThe 50-year-old mother-of-three’s body was found in a shallow grave, in a wooded area of Northchurch Common, near Berkhamsted, on January 17 last year.\nShe had been placed inside a suitcase which had then been set on fire.\nConcerns for Margory’s welfare were raised by her family four days previously, after they received no telephone contact from her since the morning of January 13, which was described as very unusual.\nAt the same time, Giraldo began displaying erratic behaviour and apparently made admissions, reportedly saying in Spanish “Yo la mate”, which translated means “I killed her”.\nMargory was reported missing to police and officers attended the address. It was then that Giraldo told them they had an argument that morning and she had left.\nHe told officers he had gone to look for her at around 3pm that afternoon, when in fact he had gone to dispose of her body.\nHe was seen on private CCTV placing items into a bin, while wearing a blue latex glove, before moving his car out of sight of the camera.\nANPR and phone work showed that he then travelled to the burial site, taking the couple’s two-month-old foster child with him.\nDuring this time, Margory’s older children had made numerous attempts to phone her but all calls went to voicemail.\nFollowing an investigation by the Bedfordshire, Cambridgeshire and Hertfordshire Major Crime Unit, Giraldo was arrested on 14 January and later charged with Margory’s murder and preventing lawful burial.\nHer body was found by specialist search officers the following day.\nGiraldo pleaded guilty to preventing unlawful burial on July 5 but denied murder and went on trial on nine days later.\nThe court heard how Giraldo, a former Columbian policeman, was said to have become increasingly obsessed with Margory after she suggested they separate in September 2018.\nAt the time of her death, they were going through a trial separation but still residing at the same address.\nHow to report a crime?\nIf you have been a victim of a crime, or think you may have witnessed one you should report it to the police as soon as possible.\nThe information that you provide can be used to prevent other crimes and help to keep other people safe.\nThere are several ways to report a crime to the police:\n- If it is an emergency dial 999 from a mobile, telephone or payphone if available.\n- If it is not an emergency you should call 101 to report a crime or other concerns that do not require an emergency response, e.g. if your car has been stolen, property has been damaged, or suspect drug use.\n- You can also report a crime anonymously through Crimestoppers, either online or by calling 0800 555 111 - it is free.\nThe family had moved to the UK from Columbia in 1999 as refugees.\nGiraldo was found guilty by unanimous verdict and sentenced to life with a minimum of 19 years for murder, plus three and half years for preventing a lawful burial, to run concurrently.\nDetective inspector Justine Jenkins, from the Bedfordshire, Cambridgeshire and Hertfordshire Major Crime Unit said: “Our thoughts remain with Margory’s family at this understandably difficult time.\n\"Margory was a loving and kind mother to her three children and to a foster child who have all been cruelly robbed of their future together.\n“Giraldo had plenty of opportunities to confess to what he had done but instead kept up the pretence that he did not know what had happened to Margory, prolonging the agony and worry for her family.\n\"I am pleased he has now been found guilty and will be serving a life sentence, although this does not in any way make up for the hurt and anguish that he put his own children through.\n\"By pleading not guilty, he ensured that they had to go through the process of giving evidence during the trial, which has no doubt added to their upset.\n\"I commend them for their bravery and support of the investigation.”\nJulian Borja\nA drug dealer who used children to peddle crack cocaine and heroin across Hertfordshire was jailed.\nJulian Borja, 29, from Dongola Road, London, was sentenced to seven and a half years at St Albans Crown Court on June 26, 2019, after being arrested and charged with conspiracy to supply crack cocaine and heroin.\nBorja used a team of vulnerable young people to deliver drugs and move money around his network in Stevenage, which in sentencing HH Judge Kay described as a ‘chain of misery’.\nBorja was also given a Serious Crime Prevention Order as part of his sentence, which will prevent him from becoming involved in criminal activities for at least five years after he has served his sentence.\nHis arrest followed an intensive investigation in November 2018 by Hertfordshire Constabulary’s Operation Mantis team.\nDetective sergeant Jon Leak from Hertfordshire Constabulary’s Operation Mantis team said: “Borja was head of a County Lines gang operating in Stevenage where he groomed vulnerable young people and embedded them into his gang culture, exposing them to drugs and violence.\n\"Following months of excellent work on this investigation by the Operation Mantis team, we gathered the necessary evidence to ensure Borja’s conviction, which will make a significant impact on the supply of drugs in Hertfordshire.\n“We rely on members of the community to give us vital bits of information to help us protect our children and vulnerable people from these kinds of criminals, who often prey on people who lack confidence, support or family.\n\"Any information you can provide, no matter how small it may seem, could help us to protect your community.”\nDaniel Teagle\nA man from Cheshunt was jailed after he stabbed another man in the leg at a pub, causing the victim to suffer \"flashbacks\".\nDaniel Teagle, 31, of Bakerscroft, High Street, attacked the victim in his 30s at The Bell Public House in Burford Street, Hoddesdon on February 9, 2019.\nThe victim was flown to hospital by air ambulance after sustaining serious injuries and was placed in an induced coma after having emergency surgery.\nTeagle was arrested the next day and subsequently charged and remanded.\nHe was sentenced to 10 years in prison at St Albans Crown Court on Monday, June 17, after being found guilty of Section 18 Grievous Bodily Harm with intent following a five-day trial.\nDetective constable Claire Sprent from the Broxbourne Local Crime Unit said: “The actions of Teagle were completely disproportionate to what had happened between him and the victim and this has been reflected in the sentencing.\n“Thankfully the victim survived this attack, but is still experiencing pain and flashbacks. Teagle had no regard for his victim and quickly fled the scene after stabbing him.\n“This incident could have easily had a different outcome - with a man losing his life. I hope Teagle uses his time in prison to reflect on his reckless actions.\n“I also hope others see the very real dangers of carrying and using a knife.\n“Not only do you risk a custodial sentence for possession of a knife, but you could end up causing serious harm to someone, taking someone’s life or losing your own.”\nHe will serve the 10-year sentence concurrently with the four-month sentence for possession of a bladed article.\nShane, Wayne and Richard Parker\nThree brothers who committed more than 200 offences in a stealing spree across the South East have been jailed.\nShane, 24, of Sandacres Caravan site in Braintree, and Wayne, 25, of the same address, as well as, Richard Parker, 32, of Dixons Hill Road, Hatfield, went on the spree in September and November 2018.\nThey used stolen Audi cars to travel between counties in the east of England, breaking into business properties and cars and stealing items from them, in particular power tools.\nThis included stealing tools from vans parked in hotels in Dunstable, Luton, Braintree, and Hemel Hempstead.\nThey also broke into business properties in towns such as Basildon, Chelmsford, and St Albans.\nVarious offences were also committed in Suffolk and Cambridgeshire.\nThe brothers regularly changed the number plates on the cars to avoid being caught, and would returned the stolen vehicle to its hiding place in Essex, travelling home in their own personal cars.\nThe trio met with a stolen goods handler, James Nevin, 34, of Winslow Road, Milton Keynes in Dunstable to sell on their stolen property.\nThe total value of goods stolen was estimated at being between £75,000 and £99,000.\nThey were sentenced to more than three and a half years each at Chelmsford Crown Court on June 24 after pleading guilty to conspiracy to steal and conspiracy to burgle.\nNevin was sentenced to ten months in jail after pleading guilty to three counts of handling stolen goods on the same day.\nDetective inspector Andy Duddle, from ERSOU, said: “These three men wreaked havoc on areas across the eastern region, committing crimes on a daily basis in a ruthless and indiscriminate manner.\n“On some occasions it’s believe they committed more than 30 offences in one night.\n“Stealing tools from vehicles and breaking into business properties are far from victimless crimes.\n“The types of items the brothers were stealing were high value power tools which cost a lot to replace and which some people rely upon in order to be able to do their job and bring in a wage.\n“We’re committed to tackling cross border acquisitive crime such as this across the east of England as we recognise the serious impact this has on people on businesses so we’re glad the four men are now facing justice.”\nGavin Lendon\nA pedophile rugby coach was referred to as \"God\" by one of the girls he groomed and sent text messages of a sexual nature to.\nGavin Lendon, 52, of Lords Meadow, Redbourn, abused his position of trust at Harpenden Rugby Club from November 2017 to February 2018, St Albans Crown Court heard.\nHe messaged the teenagers using WhatsApp and Facebook messenger, using sexually explicit language and trying to persuade them to send him sexual images and engage in sexual activity with one another.\nHe was arrested when the father of one of the victims found worrying chat on his daughter’s Facebook messenger.\nWhen Lendon was arrested he told officers: “I know what this is about, it’s about one of the girls at rugby… I said I loved her, her friend saw it and thought grooming.”\nHe claimed there was no sexual motivation and that he felt ‘genuine concern’ and was trying to help.\nWhen presented with the chat he agreed it was inappropriate and went against his safeguarding training as a sports coach.\nIn one heavily sexual online chat group he set up with the two girls, Lendon was referred to as \"God\".\nHe sent the girls explicit images of women engaged in sex acts and asked them to send him photos.\nOn one occasion he collected one of his victims from school and took her to the Holiday Inn for something to eat.\nAnother time they had lunch at a Toby Carvery. He would often buy her alcohol at the rugby club.\nInvestigating officer detective constable Georgie Fenge, from the Child Online Safeguarding Team, said: “The victims in this case, two young girls, were exposed to disturbing sexually explicit messages by a man they should have been able to trust.\n“Lendon abused his position of trust as a local rugby coach and inflicted the young teenagers to a stream of appalling sexualised messages.\n“I am pleased to see this despicable man sent to prison and given a Sexual Harm Prevention Order for 10 years and a notification requirement for the next 10 years.”\nHe was jailed for 12 months on June 18 at St Albans Crown Court, after admitting two counts of inciting a child into sexual activity between November 2017 and February 2018.\nDarren Francey, chairman at Harpenden RFC, said: “As soon as we became aware of this investigation the individual in question was suspended from the club.\n“We worked with the Rugby Football Union and the police to ensure that safeguarding measures were in place and the individual’s membership has since been revoked.\n“Safeguarding the young players at our club is paramount and will remain so.”\nThe Constabulary’s Child Online Safeguarding Team (COST) carry out significant enquiries and officers provide on-going support to victims.\nIf you would like to contact the investigating officer in this case, please email at georgina.fenge@herts.pnn.police.uk or call the non-emergency number 101.\nYou can read advice for children and young people about going online safely is available on Hertfordshire Constabulary’s website here.\nThere is further advice for parents and carers here.\nRichard Martin\nA man who killed his brother over inheritance money on his own birthday and then started living in his house in Hemel Hempstead was jailed.\nRichard Martin, 53, went to his brother John’s home in Malmes Croft, Leverstock Green and murdered him with an iron bar on Saturday, June 9, 2018.\nHe later told police he planned to evict his brother, 55, from the house, which had previously belonged to their parents.\nRichard broke into the house on his birthday by smashing a glass pane in the kitchen door and confronted John.\nHe hit John with the bar, killing him, before later moving his body into the garden shed.\nFollowing the killing, Richard attempted to discard evidence and carried on with his normal life, even turning up for his 7am work shift as an engineer just hours after the murder.\nHe slept in John’s house and began to move his personal belongings from his own home in Barleycroft, into the Leverstock Green property.\nSuspicions were raised when John, who was described by friends as \"someone you could set your watch by\", failed to turn up for a tennis match.\nFriends and neighbours also noticed that his car was not parked in the usual place at his home – because Richard had moved it – and all the curtains were closed.\nThey’d also seen Richard walking the dog, which is something John would normally have done.\nPolice were called and when officers knocked on John’s door, Richard answered and said: “John can’t come because he’s dead. I killed him”.\nHe was arrested on suspicion of murder and later charged.\nRichard pleaded guilty to the offence on Friday, September 28, 2018 and he was jailed for 18 years at Luton Crown Court on June 6 the following year.\nDetective inspector Phil Moss from the Bedfordshire, Cambridgeshire and Hertfordshire Major Crime Unit said: “Richard has never shown any remorse for the pre-meditated murder of his brother and, after beating John to death, continued as normal – going to work, visiting his local pub and visiting the cinema with a friend.\n“He even began moving into the house, which he believed he had a claim to, and slept there at night following John’s death.\n“Due to the aggravating factor of Richard killing John for his own gain, the Judge has handed down a significant sentence, which means Richard will be in prison well into his old age.”\nMarios Demetriou\nA Benington man who took more than £1million from the elderly by lying about his mother’s death was jailed.\nMarios Demetriou, 51, of Three Stiles, befriended an elderly victim in 2012, telling them that he needed money to fight a court case relating to the murder of his mother.\nThe victim gave him several hundred thousand pounds and also recruited other friends to help fund the bogus legal case.\nDemetriou obtained more than £1.4m through the fraud, which he spent on gambling, and was arrested in January 2018 after he was reported to the police.\nHe was sentenced to six years in prison at Wood Green Crown Court May 30, 2019.\nDetective inspector of Hertfordshire Constabulary’s Serious Fraud and Cyber Unit, Rob Burns, said: “Demetriou took advantage of his mother’s death to ingratiate himself to his victims and then played on their sympathy.\n“He exploited their good natures to extract money from them, that they have spent a lifetime saving and which was meant to sustain them in their retirement.\n“Demetriou ran up significant gambling debts and used his victim’s money to pay these debts and to continue his gambling addiction.\n“This conviction will help to protect vulnerable people and also send a message to fraudsters that they cannot get away with targeting people in this way, it will end up with them serving a prison sentence.”\nArthur Murray\nA retired bank manager in his 70s who stole money from the Harpenden Residents’ Association has been jailed.\nArthur Murray, 72, of Northchurch near Berkhamstead, stole £18,000 from December 2015 to January 2017.\nHe put himself forward for managing the Cedar Maintenance account - a residential complex including 30 flats and nine houses in The Cedars, off Milton Road - using his previous experience as a bank manager.\nDetective constable Paul Edmondson from the St Albans Local Crime Unit, who gained specialist financial support from the Eastern Regional Special Operations Unit (ERSOU) said: “Murray had huge debts and saw this as an easy opportunity to steal money.\n“We are pleased he received a custodial sentence and we hope under the POCA order, we can compensate the victims for the loss of their money.”\nHe was sentenced for fraud at St Albans Crown Court on May 17 and given 14 months in jail and a Proceeds of Crime Act order was put in place.\nJudge Philip Grey said: “As a former bank employee you were trusted with other people’s money, but you treated it as your own.\n“There wasn’t one victim, but it was sustained theft and you have shown no remorse whatsoever.”\nIon Tanase - A man who stole tens of thousands of pounds worth of property during a burglary spree in Watford has been jailed for four years.\nIon Tanase, aged 49, of no fixed address, broke into a property on Cassiobury Drive before stealing a set of keys and more than £100 in cash on September 4, 2018.\nHe fled after he was disturbed by the occupant returning home.\nOn February 11 this year, he smashed a ground floor window of a property in Foxlands Close before stealing jewellery.\nTanase again smashed a ground floor window of a property in The Ridgeway before searching upstairs and taking a number of items of jewellery on March 20.\nOn April 12 he returned to Cassiobury Drive and used a wheelie bin to climb into a ground-floor window which had been left open.\nHe stole a large amount of jewellery and £600 worth of Indian rupees, which he later converted.\nTanase then took a trip to Europe but was arrested by Border Force on his return to the UK in early May, before being charged and remanded.\nHe pleaded guilty to four counts of dwelling burglary and one count of possession of criminal property and was sentenced to four years in prison at St Albans Crown Court on May 31 this year.\nA further 27 burglaries in Watford were taken into consideration, meaning a total of 31 offences were detected overall.\nTanase was named after victims' neighbours’ CCTV cameras captured him arriving and leaving the locations. Later, tests showed his DNA had been lifted from several crime scenes.\nThe Home Secretary will decide whether Tanase is to be deported to his native Romania once he has served his sentence.\nDetective inspector Jason Finnegan, from the Watford Local Crime Unit, said: “My team and I are extremely pleased with Tanase’s custodial sentence.\n“He used a bicycle to get around Watford and commit offence after offence but since he was charged and remanded, we have seen the number of reported dwelling burglaries plummet.\n“Burglary is a serious violation of privacy and can have long-lasting, far-reaching effects.\n“Tanase’s utterly despicable behaviour left some of his victims feeling unsettled and unsafe in their own homes.\n“I hope he uses his prison term to seriously reflect on his actions and think about the impact he has had on the innocent people he stole from.”\nScott Foran\nA burglar who broke into a home in Potters Bar while the owner was asleep and stole a car has been jailed.\nScott Foran, 38, of no fixed address, broke into a home on St Francis Close between 1.30am and 3.30am on December 13, 2018.\nHe stole the homeowner’s clothing, power tools, watch and wallet, as well as his blue Toyota Yaris.\nThe victim called the police, and investigations found his bank cards had been fraudulently in Towcester, Northamptonshire and Beaconsfield, Buckinghamshire.\nThree days later, on December 16, the stolen vehicle was found damaged in Northamptonshire.\nForensic work linked Foran to the victim’s home and CCTV enquiries established that he had used the stolen bank cards, and on January 14 this year Foran was arrested.\nHe appeared in St Albans Crown Court on May 9 and was sentenced to three years and four months in prison for burglary, theft of a car and two counts of fraud.\nDetective constable Barnaby Goding, from the Hertsmere Local Crime Unit, said: “Understandably, the victim was left shaken and unnerved at the thought of someone having broken in to his home as he slept.\n“I am glad that Foran has been brought to justice and I hope that he spends his time behind bars reflecting on the fear and misery he caused.\n“We always do all we can to track down those responsible for burglary and I hope that this sentence reassures the local community of that.”\nSix members of a drug supply ring\nSix members of a drug supply ring that tormented areas of London, Watford, and the South East have been jailed.\nThe men were part of an organised crime group that imported and supplied cocaine, and were arrested after a lengthy investigation by Hertfordshire Constabulary’s Covert Investigations Unit on March 23, 2017.\nIt is believed that across 17 trips, more than 150 kilos were imported into the UK. Over £400,000 in cash was also seized.\nThe men appeared at St Albans Crown Court on May 8 this year, receiving the following sentences:\n- Edmund Imeraj, 38, of Knyllys Road, London, conspiracy to supply class A drugs (Cocaine). Possession of Fraudulent ID document with intent - 16 years and 6 months\n- Afrim Imeraj, 36, of no fixed address - conspiracy to supply class A drugs - 13 years and 6 months\n- Erion Mehmetaj, 23, of Manor Way, London - conspiracy to supply class A drugs - 10 years 9 months\n- Vladimir Imeraj, 38, of Edingley Avenue, in Mansfield - concerned in supply of class A drugs - 8 years 1 month.\n- Mateos Jubani, 24, of Archabold Close, Enfield - conspiracy to supply class A drugs (cocaine), possession with intent to supply, being concerned in money laundering arrangement - 7 years and 6 months.\n- Ylber Xhameta, 47, of no fixed address in Rugby - conspiracy to supply class A drugs - 8 years 8 months.\nDetective inspector James Luxon, of the Covert Investigations Unit said: “Following months of excellent work on this investigation by my officers, we were able to compile enough evidence to secure these convictions against some very prolific criminals.\n“This case has made a significant impact on the supply of drugs in Hertfordshire.\n“As part of this work, we depend on information from members of the community to help us crack down on drug-related crime.\n\"Any information you can provide, no matter how small it may seem, could help us to identify and apprehend drug dealers.”\nPhilip Griffin\nA sexual predator from Welwyn who assaulted and exploited a child was jailed earlier this year has been jailed.\nPhilip Griffin, 32, of The Crescent, pleaded guilty to two counts of sexual assault by penetration and two counts of sexual exploitation of a child.\nThe sexual messages he sent to a girl, asking her to engage in sexual activities with him and asking her to send him nude photos between March and October 2016 when she was 16.\nHe was sentenced to a total of 54 months, consisting of 54 months for each sexual assault and six months for each exploitation offence, all to run concurrently at St Albans Crown Court on May 7, 2019.\nIn addition, Griffin will be placed on the Sex Offenders’ Register and a restraining order was granted preventing him from contacting the victim for 10 years.\nIn his summing up, Judge Michael Simon said: “It is quite clear that severe psychological harm has been caused to the victim as a result of the assault.”\nHe told Griffin the sexual assaults were “the culmination of your attempts of sexual advances to the victim”.\nMr Simon added that Griffin “pursued a course of conduct over an extended period”.\nDetective constable Fiona Curson said: “The victim has displayed incredible bravery throughout the protracted investigation and I would like to commend her for the courage she has shown.\n“It is good to finally see justice being done and I hope this sentence helps her to rebuild her life following the abuse that Griffin inflicted on her.”\nKologo Richards\nA Stevenage man who sexually assaulted a woman while on parole after previously assaulting and threatening to kill her was jailed in April.\nKologo Richards, 34, of The Oundle, was previously convicted of two counts of assaults on the victim on June 11, 2018, and made verbal threats to kill her when sentenced to eight weeks in prison and a restraining order.\nLater that year he assaulted her again at her home while on bail, and was arrested.\nOn November 19, 2018, at St Albans Crown Court, Kologo pleaded guilty to sexual assault and perverting the course of justice.\nHe pleaded guilty to threats to kill on January 9, 2019, and was sentenced to 10 years and 10 months in prison on April 1, for all three offences.\nHe will have to serve a further four years before he is allowed to apply for parole and will remain on licence for 10 years afterwards.\nDetective sergeant Marc Willmore said: “As well as being sent to prison for a significant time, Kologo has also been served a 10-year restraining order which prevents him from contacting the victim.\n“The victim has displayed incredible bravery throughout the investigation and I would like to commend her for that courage she has showed.\n\"I hope this sentence helps her to rebuild her life following the horrific abuse that Richards inflicted on her.”\nPaul Murphy\nA serial Stevenage shoplifter who used people’s contactless bank cards and carried a knife was jailed.\nPaul Murphy, 34, of Broadwater Crescent, was found to have committed theft on 12 occasions this year from March 20 to April 4.\nHe stole items including 10 sirloin steaks from the Co-op store on his road, and used a stolen bankcard on March 17, twice successfully withdrawing £30 with contactless transactions before two further attempts failed.\nHe was arrested on March 24 and found with a Stanley Knife, but committed four more thefts after his arrest.\nHe appeared at Hatfield Remand Court on April 5, 2019, where he pleaded guilty to all charges and was sentenced to 12 months in prison and ordered to pay compensation totalling £1,043.90.\nHakeem Kadri\nA Welwyn Garden City drug dealer was jailed after being found with Class A drugs.\nHakeem Kadri, 33, of Murphy Street, London, was found with crack cocaine and heroin on Hollybush Lane by the Operation Scorpion Team on November 2, 2018.\nOperation Scorpion officers work in a specialist unit that tackles acquisitive crime, such as burglaries, robberies and drug offences.\nKadri appeared at St Albans Crown Court on April 4, 2019, andd was sentenced to five years and seven months in prison.\nDetective constable Ben Dransfield, who investigated the case, said: “Hertfordshire Constabulary takes a strong stance against drug dealing and the Operation Scorpion Team work tirelessly to target those suspected of committing drugs offences.\n“I hope that this sentence reassures residents that we will do all we can to take drugs off our streets.\n“If you suspect that drugs activity is taking place in your local area, please never hesitate to report it to us. You might just have the missing piece of the jigsaw that allows us to catch an offender.”\nCallum Lidder\nA Harpenden man who was found with £100,000 worth of cocaine, a shotgun and live ammunition was jailed.\nCallum Lidder, 22, of Holly Lane, had his home searched May 21, 2018, after police received a warrant due to information that he was in possession of a gun.\nPolice found a sawn off shotgun with five cartridges in the boot of his hired Audi, and a large package of cocaine hidden inside a drum kit in his bedroom.\nLidder was involved in organised crime and was arrested later the same day after being tracked down in a vehicle on the M1.\nHe appeared in St Albans Crown Court on April 5, 2019, and pleaded guilty to possession of a firearm, possession of ammunition for a firearm without a certificate and possession with intent to supply Class A drugs.\nHe was sentenced to eight years in prison.\nDetective constable Barry Townson, from the Bedfordshire, Cambridgeshire and Hertfordshire Major Crime Unit, said: “If we receive intelligence to suggest someone is in possession of a weapon, then we will take action.\n“Thanks to the information we received, another gun and more illegal drugs were removed from the streets of Hertfordshire.\n\"If you have information about criminal activity in your area, please don’t hesitate to contact us. We will listen and we will do our best to make your community safer.”\nDaniel Valentine\nA man who subjected his girlfriend to a \"horrendous ordeal of abuse\", including throwing her to the ground and spitting at her, was jailed earlier this year.\nDaniel Valentine, of Mead Lane, Hertford, pleaded guilty on March 11, at Luton Crown Court to coercive and controlling behaviour and two counts of assault.\nThe court heard how the 23-year-old, over the course of a year-long relationship, had quickly become possessive and would question why his former partner was going out with certain friends.\nHe would make unwanted sexual advances and dismiss the victim when she highlighted his behaviour.\nValentine would also insist on checking the victim’s phone and as a result of his behaviour, the victim described feeling trapped in the relationship.\nShe lost her self-esteem and her friends due to isolation and the abuse she faced also affected her relationship with her family.\nOn April 17, 2018, Valentine physically assaulted the victim outside his home by pushing his head into hers and spat at her face.\nValentine pulled her hair and verbally abused her before concerned members of the public called the police.\nOn June 9, 2018, the victim was subjected to a further physical assault which took place at Valentine's home.\nValentine repeatedly threw her to the floor while trying to take her phone, before he took her to a nearby common where he continued to throw her to the floor and hit her.\nValentine was then arrested on June 11, 2018.\nOn April 1, last year, Valentine was sentenced at St Albans Crown Court to two years and six months in prison.\nTwo further charges of assault were ordered to lie on file.\nDetective constable Nick Jenkins, from Hertfordshire Constabulary's Domestic Abuse Investigation and Safeguarding Unit (DAISU), said: “As well as the custodial sentence, Valentine has also been given a lifetime restraining order which prevents him from contacting the victim.\n“Domestic abuse isn’t just about violence.\n“The coercive control law recognises the impact that threats, intimidation or verbal abuse over a sustained period can also have on victims.\n“It can leave them feeling isolated, drained of confidence and dependent on their abuser.\n“I hope this sentence goes some way in helping the victim to recover from the horrendous ordeal of abuse that Valentine subjected her to.”\nAnyone affected by domestic abuse in Hertfordshire can get support and guidance via the Herts Domestic Abuse Helpline on 08 088 088 088.\nAlternatively, visit the Herts Sunflower website here. In an emergency situation always call 999.\nAndrea Buzzanca\nA man who swung a meat cleaver at two police officers after falsely reporting he had been robbed was also jailed.\nPolice were called on April 13, 2018, by Andrea Buzzanca, of Stanstead Road, Hoddesdon, who claimed he had been robbed near Hertford Regional College on High Road, Turnford.\nThe 23-year-old used the phone at the police base next to the college to make the call and waited for officers to attend.\nTwo police officers from the Broxbourne Safer Neighbourhood Team were the first to arrive.\nAs the officers exited their vehicle, Buzzanca took a meat cleaver out of a bag and swung it at them, striking a female officer’s arm.\nShe managed to get back into the patrol vehicle and call for assistance.\nBuzzanca then backed away from the officers. He dropped the knife and was arrested.\nHe subsequently pleaded guilty to charges of attempting to wound with intent to do grievous bodily harm and possession of an offensive weapon.\nOn March 26, he was sentenced at St Albans Crown Court to four years in prison.\nDetective constable Sam Davey, from the Broxbourne Local Crime Unit, said: “This was a truly shocking act as the attending officers believed they were speaking with a victim of crime, not a would-be attacker.\n“Thankfully, neither officer was seriously injured.\n“However, due to the dangerous and reckless actions of Buzzanca, the outcome could have easily been a lot, lot worse.”\nChief inspector of Broxbourne, Craig Flint, added: “Despite coming under such a violent assault, both officers conducted themselves with complete professionalism, putting the safety of the public as their paramount concern.\n“Whilst our officers never know what they might deal with during their day, no one should expect to be targeted and attacked.\n“Thankfully such incidents are rare.”\nLuke Latham\nA man who slashed a motorist across the face with a knife in an unprovoked attack was jailed back in April.\nLuke Latham, 21, of no fixed address, was with his partner in the car park of the Marriott Hotel in Halfhide Lane, Cheshunt, on Saturday, October 13, 2018.\nThe couple had argued and Latham punched the woman.\nA man in his 30s was driving along the road when he spotted the woman who had fallen to the ground after being hit by Latham.\nThe motorist got out of his car and told Latham to leave her alone, but he approached the driver and slashed his face with a knife.\nThe victim, who had come to help, sustained a ten centimetre wound that extended all the way from his eye, down his cheek and to the bottom of his nose.\nAfter the assault, Latham fled from the scene.\nThe victim was aided by members of the public until the police and ambulance service arrived. Latham was subsequently located and arrested.\nHe was remanded in custody after being charged with assault occasioning grievous bodily harm, possession of a bladed article and common assault.\nIn early March, 2019, Latham was due to stand trial but he changed his plea to guilty after evidence was presented to the court from his mobile phone.\nThe device contained many messages from Latham requesting help and saying he had stabbed someone.\nDetective constable Martin Sturgess at Broxbourne Local Crime Unit said: “This was a callous and violent assault against a man who was only attempting to help a woman in distress.\n“The victim did nothing to warrant such a wholly unjustified and unprovoked attack from Latham.\n“I hope Latham now uses his time in prison to reflect on what he did and this should send a strong and clear message to anyone considering carrying a knife.\n“If you use a knife as a weapon, we will use all the powers at our disposal to bring you to justice and you can expect to be sent to prison.\n“In addition to this, if you carry a knife you should understand the very real risks and consequences of coming to harm yourself, or causing serious harm to someone else.”\nOn March 29, Latham was sentenced at Harrow Crown Court to seven and a half years in prison.\nHe will serve six years and nine months for the assault against the motorist, six months concurrently for possession of a bladed article, and two months to run consecutively for assaulting the woman.\nAdditionally, Latham was sentenced to seven months imprisonment, also to run consecutively, for breaching a suspended sentence imposed in 2017.\nThis was in relation to an offence of possession of a bladed article.\nSabri Naeem\nA domestic abuser was locked up for 14 years for a “horrific, spiteful and frenzied attack” on his ex-partner in Harpenden.\nSabri Naeem, 34, of Priory Road, East Ham, approached his former girlfriend on Milton Road, punching and kicking her to the ground at 2am on July 1, 2018.\nHe then hit her over the head with a full bottle of wine, before punching her repeatedly in the eye whilst wearing a glove with wire wrapped around it.\nShe sustained permanent damage to one of her eyes and was left with a broken wrist, as Naeem fled the scene and became a wanted person.\nAn officer tracked him down to a flat in East London where he was arrested and found to be in possession of suspected cocaine some weeks later.\nHe appeared at St Albans Crown Court on 29 March this year and was was found guilty of grievous bodily harm with intent and possession of a Class A drug.\nDetective constable Laura Bassett, from Hertfordshire Constabulary’s Domestic Abuse Investigation & Safeguarding Unit, said: “I am pleased that we have secured this conviction and have no doubt Naeem is a dangerous man.\n“His brutal and vindictive actions left a woman with potentially life-long injuries. My hope is that the victim in this case can move forward with her life, free from abuse.”\nDetective chief inspector, Stuart Cheek, added: “At the trial the victim chose not to give evidence against Naeem.\n\"Whilst it is a shame she could not support the prosecution, we recognise the difficult circumstances that many victims of domestic abuse face.\n“Excellent initial evidence gathering and then diligent detective work by DC Bassett meant that we did not need to rely solely on the victim’s testimony to secure a conviction.\n“In the end the jury concluded that Naeem was guilty of this horrific, spiteful and frenzied attack. He will now be staying in prison for a long time.”\nAnyone affected by domestic abuse in Hertfordshire can get guidance and support via the Herts Domestic Abuse Helpline 08 088 088 088 or by visiting the Herts Sunflower website.\nAaron Broome\nA prolific thief was put behind bars for a string of thefts in Hemel Hempstead.\nAaron Broome, 23, of Turners Hill, was arrested by officers in the town on March 21 and charged with 12 offences relating to January through to March in 2019.\nThese included stealing a red Alfa Romeo, handbag and other items from an individual in Hemel Hempstead Leisure Centre.\nHe stole bottles of whiskey from Nisa on Crabtree Lane on six occasions, and also stole a camcorder and soundbar from someone’s home.\nBroome failed to appear in St Albans Magistrates court for theft in January, and plead guilty to all of the charges at Hatfield Magistrates’ Court on March 23.\nDacorum Neighbourhood Team Inspector Jeff Scott said: “Broome is a prolific offender who repeatedly targeted a shop in Hemel Hempstead, brazenly stealing alcohol.\n“He then went on to target lockers at Hemel Hempstead Leisure Centre, even stealing the car keys from one before going outside the gym and taking the victim’s car.\n“Before being arrested Broome had been wanted by police for a short time. He was detained and arrested by a plain clothed Scorpion officer who spotted him in Queensway before arresting him in nearby Fig Tree Hill.\n“I hope that Broome spends his time in prison accessing the help and support available to help him to turn his life around so that he can become a useful member of society when he is released.”\nLevi Simms\nA man from Hitchin who beat his former partner until she lost consciousness was sent to prison for six years.\nLevi Simms, 23, of Highover Way, trapped his ex-girlfriend at knifepoint after brutally hitting her and pushing her against a wall where she passed out on July 27, 2018.\nEarlier in the day he had demanded she bring his belongings to an address in The Tene in Baldock, where he dragged her kicking and screaming into the property before the beating.\nShe was not allowed to leave until the following day, where she returned to her parents’ home in a distressed state.\nPolice arrested Simms at the address in Baldock, and the Hertfordshire Constabulary’s specialist Domestic Abuse Investigation and Safeguarding Unit investigated the incident.\nSimms was sentenced on March 18, 2019, at St Albans Crown Court for false imprisonment, common assault and breach of a restraining order.\nInvestigating officer detective constable Barnaby Goding said: “Simms actions left his victim in fear of her life.\n“He is a serial domestic abuser, having previously being convicted of battery on two other occasions against the same woman.\n“He now has some time to consider the consequences of his what he has done and the harm he has caused.\n“I hope this sentence brings some comfort to his victim who has suffered a great deal of pain and trauma because of Simms.\n“I would like to commend her for the bravery she has shown throughout the investigation and court case.”\nAnyone affected by domestic abuse in Hertfordshire can get guidance and support via the Herts Domestic Abuse Helpline 08 088 088 088 or by visiting the Herts Sunflower website.\nJosh Owen\nA man from Hemel Hempstead who was banned from begging in Hertfordshire was jailed for beaching the Criminal Behaviour Order.\nJosh Owen, 40, of London Road, Apsley, was given a two-year order on May 1, 2018, after he failed to comply with a Community Protection Notice instructing him to stop his persistent and aggressive begging.\nHe was arrested in the afternoon on March 11 the following year in Tring after being seen begging in the Sainsbury’s car park in Apsley on February 18.\nOwen appeared before Hatfield Remand Court the next day where he pleaded guilty and was sentenced to a total of 12 weeks in prison and must pay a victim surcharge of £115.\nHe will continue to be subject to the order upon his release.\nSergeant Mike Saunders, from the Dacorum Community Safety Unit, said: “Joshua Owen is a persistent offender who has breached his CBO nine times since it was issued on May 1.\n“Each time he has breached the order he has been arrested and brought before the courts and this time magistrates decided that he should serve a custodial sentence.\n“I hope that he takes the time while in prison to consider the detrimental impact his behaviour has on the local community and upon his release makes a real effort to stop offending and turn his life around.”\nSaheed Oyebamiji\nA man was jailed in March for raping a woman in her sleep at a Hatfield party.\nSaheed Oyebamiji, aged 25, from Lavidge Road in Greenwich, attacked his victim as she slept in her bedroom in August 2017.\nHe was sentenced to four years and nine months at St Albans Crown Court on March 1, 2019.\nOyebamiji pleaded guilty on the first day of the trial and was given a six-year custodial sentence, reduced by 20 per cent for pleading before trial. A lifetime restraining order was also put in place.\nDetective sergeant Ben Smith, from the Hertfordshire Constabulary’s Sexual Offences Investigation Team, said: “Understandably, this has been an extremely upsetting time for the victim.\n“I am pleased she was spared the ordeal of going through trial and that Oyebamiji is now serving a custodial sentence.\n“We take all reports of rape and sexual assault seriously and have specially trained officers available to help. If you have been a victim, please don’t suffer in silence.”\nInformation about the help and support available to victims can be found here.\nDean Simmons\nA man from Bushey who strangled and broke his partner’s jaw while drunk was locked up this year.\nDean Simmons, 34, from Chalk Hill, tore half her right ear off and broke one of her fingers as he prized a phone out of her hands at 5am on June 16, 2018.\nHe punched her and threw her to the floor, before fleeing his home address, but was found nearby cowering behind a bin outside a shop by an off duty special constable.\nThe officer had come to help Simmons’ victim, who was left in the street after the assault, and found by members of the public.\nThe matter was investigated by Hertfordshire Constabulary’s Domestic Abuse Investigation and Safeguarding Unit (DAISU).\nSimmons was found guilty of grievous bodily harm with intent at St Albans Crown Court on March 1 and was sentenced to seven years in custody.\nDetective sergeant Gordon King from the DAISU said: “Simmons started off being drunk and aggressive towards his victim on the night. This spiralled into a sustained attack on her that was vicious and cruel, and left her with lasting nerve damage.\n“I would like to commend her for her courage and bravery, not only on the night of the attack but throughout the investigation and court case.\n\"I hope the jailing of Simmons brings her some comfort. This case shows we take domestic abuse very seriously and the horrific abuse displayed by Simmons will not be tolerated in Hertfordshire.\n“I would also like to thank Oliver Ransom – a member of the public who came to the aid of the victim before officers arrived. He was a real comfort to the woman following this traumatic incident.”\nBrian Henry\nA man whose partner died from a heart condition after he racially abused and threatened her was jailed for assault and coercive behaviour in a relationship.\nBrian Henry, 56, of Blythway, Welwyn Garden City, was arrested after using racially abusive language and throwing grapes at his partner while intoxicated on August 15, 2017.\nPolice arrived at the couple’s home to find their dog had been protecting Henry’s partner by biting his hand, though he claimed the wounds were caused by her stabbing him.\nHe squeezed his hand so blood came out and said he was going to get her locked up, but she collapsed and died from an undiagnosed heart problem while talking to an officer outside.\nShe had previously reported that Henry had returned home drunk after being kicked out the pub, before spitting and swearing at, and pushing and hitting her on August 4, 2017.\nHe was arrested for racially aggravated common assault, and coercive and controlling behaviour, but later released with no further action.\nAfter the second assault occurring immediately before her death, Henry was reprimanded by police, appearing in St Albans Crown Court on February 12, 2019.\nHenry pleaded guilty to two counts of racially/religiously aggravated common assault/beating on the two dates, and also to engaging in controlling/coercive behaviour in an intimate/family relationship from December 29, 2015 to August 15, 2017.\nHe was sentenced for a total of 28 months for the two concurrent sentences and ordered to pay a victim surcharge of £120.\nMajor Crime Unit detective sergeant Laurence Rush said: “The abuse that this victim suffered under Henry had been going on for many years, and very tragically, in her last moments she was abused and assaulted by Henry.\n“Domestic abuse is not just about violence. Coercive and controlling behaviour is a crime too, and our investigation and ultimately the jail sentence given to Henry shows how seriously it is taken by the law.”\nStephen Hardwick\nA man who stole more than £100 in meat from supermarkets in Tring and Rickmansworth was jailed for shoplifting, assault and criminal damage.\nStephen Hardwick, 51, of Croxley View, Watford, entered the Co-op in Silk Mill Way, Tring, and placed meat worth £79 in a bag for life before leaving without making any attempt to pay on August 19, 2018.\nHe returned the next day and took more meat worth £68.05 without paying over two trips, emptying the bag in between.\nOn October 10 that same year he entered the Homestead Road Waitrose store in Rickmansworth and took elderflower gin, fillet steaks and Cote De Boeuf in a jute bag out of the shop without paying.\nSecurity staff challenged him outside the shop, and on the way back to the manager’s office he asked to use the toilet.\nHe damaged one of the cubicles and then attacked one of the male staff, injuring their thumb.\nHardwick pleaded guilty to all the offences at Hatfield Remand Court on January 29, 2019, and was also dealt with for breaching his suspended sentence.\nHe was jailed for a total of 28 weeks and was told to pay £200 in compensation to the staff member who was injured.\nMarius Mereson, Razvan Dorosin and Carmen Feraru\nA woman and two men who targeted and robbed the elderly and the vulnerable were put behind bars.\nMarius Mereson, aged 40, of no fixed address, Razvan Dorosin, aged 33, of Longbridge Road, Dagenham and Carmen Feraru, aged 47, of no fixed address, are distraction thieves.\nThey stole bank cards, cash and other items worth £19,790 from 16 people in Hertfordshire and Essex between July 31 and November 7 in 2018.\nThey came to the UK from Romania with the specific intention of stealing, St Albans Crown Court heard.\nThey pleaded guilty on February 7, 2019, and Mereson was sentenced by Judge Nigel Lithman QC for 32 months, while Dorosin and Feraru were given 27 months each.\nDetective constable Simon Smith said: “These three individuals came to the UK from Romania with the sole intention of committing crime.\n“They worked together to prey on the elderly and vulnerable who they saw as easy targets.\n\"Their eldest victim was a 98-year-old man. His bank card was stolen and they attempted to use it to pay for thousands of pounds worth of goods.\n“They also targeted a partially sighted woman and several people aged in their 80s.\n“This trio clearly have no conscience and did not give a second thought to the impact on their victims.\n“We were able to identify them through CCTV enquiries and the use of Automatic Number Plate Recognition (ANPR) technology.\n“All three had previous convictions in this country and their home country. The most serious of which is Mereson’s conviction in Romania for murder where he was jailed for eight years in 1998.”\nKalil Murray\nA county lines class A drug dealer operating in East Hertfordshire has been sentenced to three years in prison.\nKalil Murray, 19, from Keswick Drive, Enfield, was found with eight heroin wraps, 13 packages of crack cocaine, a small bag of cocaine and cannabis at the time of his arrest.\nHe was stopped by police on patrol in Turnford at 10.10am for speeding in his white BMW on High Road, and the car and passengers were searched due to the smell of cannabis.\nAlong with the drugs found then, Murray was in possession of cash and multiple mobile phones, and officers found 23 wraps of heroin and 19 wraps of crack cocaine at the station.\nHe had been hiding two packets of class A drugs in his underwear, and it was revealed that he was operating for a London gang in the area.\nCounty Lines is the name given to describe drug dealing, which involves criminal networks from urban areas expanding their activities into smaller towns and rural areas.\nHe appeared in St Albans Crown Court on February 8, 2019, and was jailed for three years.\nDetective constable Andy Burnett from the Constabulary’s Case Investigation Team said: “I am pleased with today’s sentence and I hope it serves as a warning to those thinking about coming into Hertfordshire to deal drugs that we are proactively hunting them down.\n“We will seek the fullest sentence possible to tackle their criminal behaviour, which is tormenting and destroying lives in Hertfordshire.”\nZamir Akram\nA drug dealer who was found carrying crack cocaine and heroin with the intent to supply in Welwyn Garden City is another on this list who will serve prison time.\nZamir Akram, 21, of Kent Street, London, was in posession of the class A drugs by the Operation Scorpion Team in Thistle Grove on 17 October, 2018.\nHe appeared in Maidstone Crown Court on January 24 and was found guilty of two counts of being in possession of class A drugs with intent to supply.\nHe will serve two concurrent two-year jail terms for the crimes and Akram was also sentenced to five years for other drug offences in Kent, which will be served consecutively.\nDetective constable Ben Dransfield, who investigated the case, said: “Hertfordshire Constabulary is committed to keeping communities safe from drug dealing and associated criminality.\n“I hope that this sentencing sends a clear message to those who wish to sell drugs.\n“Reports from members of the public make a real difference to our investigations and I would urge anyone who suspects drugs activity in their local area to please continue to report it to us.\n“Any information you provide could be the missing jigsaw piece which will lead us to catching an offender.”\nBryn Caddy\nA man who attempted to break into three properties in the weeks before Christmas last year was jailed in February.\nBryn Caddy, 36, of Dellfield Road in Hatfield, first tried entering two properties on Lockley Crescent and Chelwood Avenue on December 1 before fleeing the scene on foot.\nHe returned to the property on Chelwood Avenue on December 20 where he had tried to open the door on the first occasion, but failed to gain access again.\nHe was arrested on December 22 by the Operation Scorpion Team, who specialise in acquisitive crime, such as burglaries, robberies and drug offences.\nAfter appearing in St Albans Crown Court, he was sentenced to three years and four months on February 1 this year.\nPC Angela Wilcox, from the Operation Scorpion Team, said: “I hope this sentence reassures people that we will do all we can to trace those responsible for committing crimes in Welwyn Hatfield and bring them to justice.\n“If you spot suspicious activity in your area, please never hesitate to report it to us. Remember, if a crime is in action or someone’s life is in danger, always call 999 straight away.\n“Caddy was identified after being caught on home CCTV.\n\"This is a great way to help protect your property from being targeted and you can find a number of other tips on how to help keep your home secure on our website at www.herts.police.uk.”\nChristopher Storton\nA man who threatened to kill his partner while holding a syringe and a razor blade was jailed in January.\nChristopher Storton, of Grove Avenue in Harpenden, also assaulted his partner by throwing her to the floor, head-butting her and grabbing her by her hair.\nHis violence towards his partner only ended when police officers arrived at his address during the incident, back in June 2018.\nHowever, he continued to make threats against his partner and self-harmed in the presence of officers.\nHe also lunged at officers with a razor blade.\nStorton was detained and taken to hospital for treatment on his self-inflicted injuries, before he was later taken into custody after assessments conducted by mental health professionals deemed him fit to be questioned.\nThe incident was investigated by Hertfordshire Constabulary’s Domestic Abuse Investigation and Safeguarding Unit, with footage from the police officer’s body-worn cameras forming evidence against him.\nHe was later found guilty of making threats to kill and assault by beating against his partner, as well as affray and possession of an offensive weapon being the razorblade.\nHe was also found guilty of assault on a police officer and further affray in connection with a separate incident in Nottinghamshire.\nStorton was jailed for 26 months at a sentencing hearing at St Albans Crown Court on January 21, 2019.\nPC James Prior, from the DAISU, said: “Storton showed no regard for the safety of his partner, police officers or even himself during this incident.\n\"He threatened to kill his partner and to break the jaws of police officers. It was lucky that no one was more seriously hurt.\n“Domestic abuse is taken very seriously by Hertfordshire Constabulary and every report is investigated thoroughly. The safety of victims and their families is our primary concern.”\nJack Lee\nA man who left two pedestrians with life-changing injuries when he failed to stop following a collision was locked up in January.\nJack Lee, 22 of Sandy Lane in Watford, was driving a white Vauxhall Combo van along Hampermill Lane when he mounted a grass verge and hit two men.\nOne of the victims was taken to hospital with serious facial injuries, while the other was flown to a London hospital with life-threatening head and facial injuries.\nLee failed to stop at the scene, with police investigations revealing that the van was registered to a fake address in East London. On July 5, 2018, officers found the vehicle abandoned in Pinner.\nFollowing a number of enquiries, Lee was arrested on December 13, that same year, in Watersfield Way in Watford while driving a white Ford Transit van without a licence or insurance. He was later charged.\nHe appeared at St Albans Magistrates’ Court on January 22, 2019, where he pleaded guilty to driving without due care and attention, failing to stop after a road accident, driving without a licence and without insurance.\nHe initially lodge an appeal against his 18-week jail sentence, but withdrew it on the day it was due to be heard at St Albans Crown Court.\nPC Pete Talbot from the Bedfordshire, Cambridgeshire and Hertfordshire Road Policing Unit said: “The innocent victims in this case suffered very severe injuries and initially it was unknown whether one of the men – a 23-year-old studying for a Masters in Law - would survive his injuries.\n“He was air lifted to hospital with a catalogue of injuries including a brain haemorrhage, cracked skull and facial fractures and remained unconscious in the intensive care unit for more than two weeks.\n“Now back home he is working to piece his life back together and get back on track with his studies.\n\"His injuries have also left him with permanent facial scarring and he continues to attend regular medical appointments.\n“The other victim was just 21 years old at the time of the collision and had recently finished studying Economics.\n\"He suffered severe lacerations and has been left with impaired vision in his left eye. He also suffered memory loss, a broken nose and sternum.\n“The collision meant he missed an opportunity to secure a job through a finance graduate scheme and today he continues to deal with the consequences of Lee’s actions as he attempts to come to terms with what happened.\n“Lee has never shown any remorse for his actions and did his best to evade police, which meant his victims had to wait a long six months before he was identified and arrested.\n“Even after the collision Lee continued to drive illegally without a licence, showing a complete disregard for his victims and the laws of this country.”\nChristopher Coulton\nA man who broke into the home of an elderly woman with dementia was jailed after being captured on CCTV footage.\nThe incident happened on October 2, 2018 in Birchwood Garden, with the woman unaware that she had been burgled until officers found discarded property near his home.\nFollowing the report of suspicious behaviour being caught on the home CCTV, Christopher Coulton was identified and arrested on October 6.\nCoulton, 33 of no fixed abode, was sentenced to three years and four months in prison on January 8, 2019, at St Albans Crown Court.\nPC Angela Wilcox, from the Operation Scorpion Team, said: “We are pleased that Christopher Coulton is now behind bars and I hope this reassures residents that we will take strong action to target those who commit crime in Welwyn Hatfield.\n“If you spot suspicious activity in your area, please never hesitate to report it to us. Remember, if a crime is in action or someone’s life is in danger, always call 999 straight away.”\nAbdulaziz Sekkoum\nA teenager was jailed in January in connection with a number of drug and driving offences that were committed in Hertford.\nAbdulaziz Sekkoum, 19, from Great Cambridge Way in Enfield, was driving a car in Campfield Road in November 2018 when police attempted to stop the vehicle.\nHe did not stop and instead, crashed into a garden fence. Sekkoum was found to be in possession of a quantity of class A drugs.\nHe was arrested and charged with driving otherwise in accordance with his licence, possession with intent to supply Class A drugs and driving with no insurance.\nOn January 2, 2019, he was sentenced at St Albans Crown Court to three years and four months behind bars and was also given six points on his driving licence.\nTo read the full story click here.\nJulie Myers\nA woman was jailed for nine years after she threw a noxious substance in her ex-partner’s face during a dispute about money.\nOn July 2, 2018, Julie Myers, 57, met her ex-boyfriend in the car park of the Cricketers pub in Sarratt to agree a settlement over money owed, but instead brought an envelope containing tissues instead of money with her.\nThe pair were sat in Myers' car, but when the discussion got heated, she picked up a bottle and threw it in the victim’s face.\nThe substance in the bottle, that appeared to look like water, caused the man’s face to sting. He got into his car and drove to a friend’s house, where he was then taken to hospital and the police were called.\nForensic tests on the liquid revealed that it was a strong alkali - believed to be a domestic drain cleaner mixed with water.\nMyers, of Railway Terrace in Kings Langley, was arrested on suspicion of Section 18 Grievous Bodily Harm and was later charged with the offence along with a charge of being in possession of an offensive weapon - the liquid in the bottle.\nShe pleaded guilty at the earliest opportunity at St Albans Crown Court on September 14, 2018, and was sentenced at the same court to nine years in prison on January 16, 2019.\nDuring sentencing, Judge Philip Grey highlighted Myers’ cruel actions in her premeditated attack and said that she had planned to lure her victim to meet her with the intention of causing him serious harm.\nPC Alex Akers, from Hertfordshire Constabulary’s Domestic Abuse Investigation and Safeguarding Unit (DAISU), which works to protect victims of domestic abuse and their families from harm, said: “The victim in this case has been left with permanent scarring to his face as a result of the action of Myers.\n“The sentence passed by Judge Grey clearly reflects the seriousness of the assault and I would urge anyone suffering from domestic abuse to contact police as we have specially trained officers who will deal with your case sensitively and can provide you with support.”\nShane Brady and Alex Attico\nTwo men were sentenced to a combined total of more than ten years in prison in connection with burglary offences in Hertfordshire and conspiracy to commit burglary in London.\nShane Brady and Alex Attico were arrested on October 8, 2017 in Holders Hill, London, following reports that the men had broken into a property in Garratts Road, Bushey.\nThey were charged with committing burglaries in three locations - including Garrets Road, Little Bushey Lane and Hurstwood Drive in London - between October 6 and October 8.\nBoth men were later released by police on bail while enquiries continued. Attico was also charged with dangerous driving, driving with no insurance and driving while disqualified.\nAlmost a year later, in August 2018, officers executed a warrant at Brady’s home address and he was arrested for another burglary offence committed in Elmroyd Avenue, Potters Bar two days earlier.\nHe had been identified by officers through video footage from a doorbell that captured him breaking into the property.\nItems found inside a Volvo used in the burglaries included a laptop, an Apple Mac and a range of high-value jewellery that has since been returned to its owner.\nBoth Brady and Attico pleaded guilty to all charges on December 14, 2018, at St Albans Crown Court.\nBrady, 32 of Haringey Park in London, was sentenced to seven years for committing four burglaries, conspiracy to commit burglary and affray, whereas Attico, 21, of Braybrook Street in London, was jailed for three-and-a-half years for three burglaries, conspiracy to commit burglary, dangerous driving and driving whilst disqualified.\nDetective inspector Michael Macbeth, from the Hertsmere Local Crime Unit, said: “Shane Brady and Alex Attico committed a spree of burglaries. They had a complete disregard for their victims and thought they could evade police detection.\n“It is thanks to great work by our officers that these prolific criminals are now behind bars and we have been able to return stolen property to the rightful owners.”\nThe pair were sentenced at St Albans Crown Court on January 7, 2019.\nHow to get in contact with police\nAny information the public can provide, no matter how small it may seem, could help police to identify and apprehend violent criminals.\nSuspected drug use can be reported via the police non-emergency number 101. If a crime is in progress, always dial 999.\nYou can also use the Constabulary’s online reporting form here.\nIf you have information about drug supply or drug crime, you can report this online, speak to an operator in the Force Communications Room via the online web chat or call the non-emergency number 101.\nStay 100 per cent anonymous by contacting the independent charity Crimestoppers on 0800 555 111 or via their untraceable online form at crimestoppers-uk.org.\nIf you or someone you know has a drugs problem they can get help by contacting FRANK on 0800 77 66 00 or visit www.talktofrank.com.\nIn an emergency situation, always call 999.",
  "word_count": 16446,
  "scraped_at": "2026-02-14T12:05:34.163692"
}