{
  "article_id": "02ffae900c85",
  "url": "https://www.90min.com/posts/man-utd-women-2023-24-wsl-season-preview",
  "title": "Man Utd Women 2023 / 24 WSL season preview : Summer transfers & league prediction",
  "date": "20230929T143000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Man Utd Women 2023/24 WSL season preview: Summer transfers & league prediction\n- United enjoyed their best season last year, finishing second to qualify for the Champions League\n- Summer of transition in transfer market with key players coming in and leaving\n- Marc Skinner's side preparing to take on added pressure of playing in Europe\nBy Emily Keogh\nManchester United head into unknown territory in 2023/24 after a superb second-place finish earned Marc Skinner's side a place in this season's Women's Champions League.\nThe Red Devils stormed to the top of the WSL table last season, taking many by surprise, but were pipped to the title by reigning champions Chelsea in the final few weeks.\nThe pressure is now on Skinner's side to match loftier expectations, with the additional fixtures and travel into Europe a new challenge for United's players to overcome.\nMan Utd Women 2022/23 season recap\nUnited's challenge for the WSL title last season is all the more remarkable when you consider the club was formed just five years ago.\nBut Skinner's players were exceptionally impressive for the majority of the season, fighting tooth and nail with multi-time WSL winners Chelsea in search of their inaugural piece of silverware. The Blues ultimately prevailed, as they so often do, but United credibly held off Arsenal and Manchester City to finish second and secure a maiden voyage into Europe.\nThere was also slight disappointment as United lost out to Chelsea in the FA Cup final at Wembley, with their run to the home of football including wins over Sunderland, Durham, Lewes and Brighton & Hove Albion.\nMan Utd Women key players 2023/24\nStar player\nMaya Le Tissier's emergence last season after arriving from Brighton was a huge positive for Manchester United.\nThe 21-year-old got better and better as the season went on, growing into her role in front of Mary Earps, and showed a real appetite for breaking the lines in order to get United on the front foot. Le Tissier was so impressive that she forced her way into the England reckoning, and it appears to be a matter of time before she's a regular starter for Sarina Wiegman's Lionesses.\nOne to watch\nThere's plenty of excitement in Manchester at the prospect of watching Geyse, who has joined the club from Champions League holders Barcelona.\nClinical in front of goal and also a creator of chances for others, the Brazilian will add some much-needed depth to Skinner's attacking options, likely becoming a regular starter in all competitions to take the weight of expectation off the shoulders of Ella Toone.\nMan Utd Women manager\nWhen Casey Stoney departed Manchester United for the United States in 2021, Marc Skinner headed in the opposite direction on a two-year deal with the option of a third.\nFast forward to the present day and United are now firmly moulded in his identity, with his ability to progress things on the pitch amid background noise admirable. He now faces his biggest challenge to date, leading United into the Women's Champions League, but has already proved he's up for the challenge of overcoming any hurdle put in front of his side.\nMan Utd Women summer transfers\nIn\n- Evie Rabjohn (DF) - Aston Villa - details\n- Gemma Evans (DF) - Reading - details\n- Geyse (FW) - Barcelona - details\n- Emma Watson (MF) - Rangers\n- Hinata Miyazawa (FW) - Mynavi Sendai\n- Irene Guerrero (MF) - Atletico Madrid\n- Gabby George (DF) - Everton\n- Phallon Tullis-Joyce (GK) - OL Reign\n- Melvine Malard (FW) - Lyon - loan\nOut\n- Alessia Russo (FW) - Arsenal - details\n- Ona Batlle (DF) - Barcelona - details\n- Chloe Williams (MF) - Blackburn\n- Aissatou Tounkara (DF) - PSG\n- Jade Moore (MF) - Birmingham\n- Tara Bourne (MF) - Sheffield United\n- Niamh Murphy (DF) - Blackburn\n- Emily Ramsey (GK) - Everton\n- Ella Kinzett (DF) - Sheffield United\n- Eleanor Ashton (FW) - Derby - loan\n- Emma Taylor (DF) - Blackburn\n- Bella Reidford (MF) - Burnley - dual registration\n- Kirsty Hanson (FW) - Aston Villa\n- Grace Clinton (MF) - Tottenham - loan\n- Keira Barry (FW) - Crystal Palace - loan\n- Maria Thorisdottir (DF) - Brighton\n- Carrie Jones (MF) - Bristol City\n- Adriana Leon (FW) - Aston Villa\n- Vilde Boe Risa (MF) - Atletico Madrid\n- Ivana Fuso (FW) - Birmingham\n- Martha Thomas (FW) - Tottenham\n- Jess Simpson (DF) - Bristol City - loan\n- Sophie Baggaley (GK) - Brighton\n- Alyssa Aherne (FW) - Everton - loan\nThe summer transfer window has brought about significant change at United.\nOna Batlle, one of the world's best full-backs, and Alessia Russo, one of the world's best strikers, have departed for Barcelona and Arsenal respectively, with the club also seeing Kirsty Hanson, Maria Thorisdottir, Adriana Leon, Martha Thomas and Carrie Jones head out of the exit door to rival WSL clubs.\nThe good news is that continental-level players with huge experience have swanned into the arrivals lounge, including Geyse, Melvine Malard, and World Cup Golden Boot winner Hinata Miyazawa, and Mary Earps has remained at the club amid strong interest from Arsenal.\nMan Utd WSL prediction\nUnited's European exploits may hinder their ability to compete at the same level as last season, despite the apparent strengthening of the squad.\nA top-four finish in the WSL is likely the minimum expectation domestically, and the loss of key personnel like Batlle and Russo could affect how United start. They have enough quality to push on and match last season's achievements but must get off to a fast start to make that a reality.",
  "word_count": 949,
  "scraped_at": "2026-02-14T12:22:02.905374"
}