{
  "article_id": "03087b718da4",
  "url": "https://www.easternriverinachronicle.com.au/story/8571908/olympic-doubts-loom-over-key-matildas-pair/?cs=6364",
  "title": "Olympic doubts loom over key Matildas pair",
  "date": "20240327T233000Z",
  "domain": "easternriverinachronicle.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Key Matildas midfielder Katrina Gorry is in doubt for the Olympics with the West Ham star announcing her season has been cut short by an ankle injury.\nSubscribe now for unlimited access.\nor signup to continue reading\nAnd in more bad news, gun defender Clare Hunt has been sidelined with a foot stress fracture.\nGorry, Hunt and fringe defender Courtney Nevin (hip) have all withdrawn from the Matildas' squad for the April 10 friendly against Mexico in San Antonio, with no timelines on their respective returns.\nIt delivers more headaches for Matildas coach Tony Gustavsson, who has already had to recalibrate his side to cope with the loss of injured goal-machine Sam Kerr.\nIn-form Melbourne Victory striker Emily Gielnik, defender Winona Heatley and winger Sharn Freier have been called up as replacements.\nMidfield dynamo Gorry was forced off in the 21st minute of West Ham's 2-0 Women's Super League defeat by Chelsea at the weekend after a loose challenge. She left the stadium with her right foot in a moon boot.\nOn Wednesday, the London-based Gorry posted a message on social media saying her WSL season was over.\n\"I've spent the last few days sitting with my emotions,\" she wrote.\n\"Now it's time to face this next challenge and trust in my body to come back stronger.\"\nFive rounds of the Women's Super League remain, with the competition set to wrap up in mid-May.\nGorry and Arsenal's Kyra Cooney-Cross have created a formidable partnership in central midfield for the Matildas, whose first match of the Olympic football tournament is against Germany in Marseille on July 25 (July 26 AEST).\nFirst-choice central defender Hunt missed her club side Paris Saint-Germain's 3-1 win over Montpellier on Monday.\nDepending on how her recovery progresses, Hunt could also face a race against time to be fit for the Games.\nLeicester City defender Nevin had only just been recalled after she was dropped for February's Olympic qualifiers against Uzbekistan.\nGielnik's first call-up since June 2023 comes off the back of getting over a horror injury run and delivering red-hot ALW form.\nThe 31-year-old has tallied seven goals and two assists across 12 games.\nDenmark-based classy centre-back Heatley has been called up twice before, most recently in 2022, but is yet to debut.\nThe 22-year-old has been thriving with FC Nordsjaelland, leading the Elitedivisionen in defensive interceptions, blocked shots and ball progressions while she is second in the league for final third passes.\nLightning-fast left winger Freier, 22, has earned her first call-up after starring for Brisbane Roar.\nFreier, who has scored three goals and notched five assists, currently leads the ALW in key chances created and is third in overall chances set up.\nAfter the Mexico game, the Matildas will return to action for send-off games against China at the Adelaide Oval on May 31 and Accor Stadium on June 3.\nAustralian Associated Press",
  "word_count": 479,
  "scraped_at": "2026-02-14T12:22:19.541000"
}