{
  "article_id": "0337a8da2845",
  "url": "https://greatbendpost.com/posts/fd22960a-3b14-40fe-a8f5-98d28f8b69c8",
  "title": "Monday Sports Headlines and Scores presented by Barton Community College",
  "date": "20230828T120000Z",
  "domain": "greatbendpost.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "SEATTLE (AP) — Luis Castillo pitched seven shutout innings and the Seattle Mariners grabbed sole possession of first place in the AL West, beating the Kansas City Royals 3-2 to complete a three-game sweep. Teoscar Hernández and Julio Rodríguez homered as Seattle won for the 11th time in 12 games. The Mariners also improved to a major league-best 36-14 since July 1 for their best 50-game stretch since they also went 36-14 from April 23-June 18, 2003. It’s the latest the Mariners have had sole possession of first in a season since Aug. 24, 2003.\nPHILADELPHIA (AP) — Aaron Nola allowed one hit and struck out nine in seven sharp innings, Kyle Schwarber homered and the NL wild-card leading Philadelphia Phillies completed a three-game sweep of the St. Louis Cardinals with a 3-0 victory. Johan Rojas doubled among his three hits and Bryce Harper hit an RBI single for the defending NL champion Phillies. Philadelphia outscored St. Louis 22-3 in the series. José Alvarado tossed a scoreless eighth and Craig Kimbrel completed the two-hit shutout with his 20th save in 22 tries with a scoreless ninth. The Cardinals have lost nine of their last 11.\nBALTIMORE (AP) — Hunter Goodman, a 23-year-old Colorado prospect had two hits and RBI, scoring the tiebreaking run in the ninth inning of a 4-3 victory over the Baltimore Orioles 4-3 on Sunday that stopped the Rockies’ six-game losing streak. Goodman was selected in the fourth round of the 2021 amateur draft and the 23-year-old was at Double-A before he was moved up to Colorado’s top farm team at Albuquerque on Aug. 8. After hitting .371 with nine and 33 RBIs in 15 games with the Isotopes, Goodman was brought up to the Rockies on Sunday when they released Jurickson Profar.\nSOUTH WILLIAMSPORT, Pa. (AP) — Louis Lappe hit a walk-off homer and California beat Curacao 6-5 in the Little League World Series championship on Sunday, despite giving up a four-run lead. Louis flipped his bat and threw his arms in the air as he trotted around the bases, leaping onto home plate before he was greeted by his teammates surrounding the batter’s box. The leadoff hitter in the sixth inning, Louis lofted the second pitch he saw just beyond the left field fence. Curacao tied the game in the fifth on Nasir El-Ossais’s grand slam to center. Nasir also drove in a run in the third. Jaxon Kalish and Lucas Keldorf drove in two runs each for California.\nENGLEWOOD, Colo. (AP) — Among the Denver Broncos’ first handful of cuts Sunday was wide receiver Kendall Hinton, who famously filled in at quarterback against the New Orleans Saints in 2020 when all four QBs on the roster were deemed ineligible for violating the NFL’s COVID-19 protocols. Hinton made the Broncos’ 53-man roster as a receiver in both 2021 and ’22 and caught 39 total passes for 486 yards and a touchdown in 28 games, including a half dozen starts. The Broncos also waived receivers J.J. Koski and Nick Williams and defensive back Delonte Hood.\nMANHATTAN, Kan. (AP) — The Big 12 Conference sprung from the old Big Eight, a bunch of entirely public and largely agricultural schools. Now, the busy Power Five conference is adding BYU, Cincinnati, Houston and UCF, and four more schools are poised to join next year, creating a footprint that will soon stretch from the sands of Florida to Arizona. The ties that bound so many of the schools are long gone, emblematic of the lost allegiances in college football in general. Shared history and cultural norms, along with geographic sensibilities, have been cast aside as leagues such as the Big 12 pursue every last dollar to fund not just their football and basketball teams but their entire athletic programs.\nPROVO, Utah (AP) — BYU’s path to the Big 12 started with an unorthodox decision. The Cougars left the Mountain West in 2011 to play as an independent in football. BYU for 12 seasons cobbled together oddball schedules and racked up travel miles. The Cougars had the specific purpose of maintaining and perhaps even reviving a dormant national brand. Independence helped get more eyeballs on BYU football through an eight-year deal with ESPN. It also might have helped land the Cougars in the Big 12.\nSAN JOSE, Calif. (AP) — A decade later, Simone Biles is still on top. The gymnastics star has won her record eighth U.S. Championship, a full 10 years after she first ascended to the top of her sport as a teenage prodigy. Biles, now a 26-year-old newlywed considered perhaps the greatest of all time, posted an all-around two-day total of 118.40, well clear of Shilese Jones in second and Leanne Wong in third. Biles will next compete at the world championships in Belgium this fall, where she will look to add to her record total of 25 medals at the meet.\nBUDAPEST, Hungary (AP) — Ukrainian high jumper Yaroslava Mahuchikh won a gold medal to bring an emotional close to the track and field world championships. The very last person competing in the final event of the nine-day meet, Mahuchikh cleared 2.01 meters to win her first major outdoor title and set herself up as a favorite at the Olympics next year. Her evening came to a close moments after Femke Bol of the Netherlands, whose fall cost her team a medal in the mixed 4x400 relay on opening night, made up some 20 meters down the homestretch to win the women’s version of the race.\nBUDAPEST, Hungary (AP) — In some ways, track and field served up a tantalizing preview of what’s to come next year at the Paris Olympics. In others, the sport left the nine-day world championships with as many questions as answers. For every Noah Lyles and Sha’Carri Richardson, athletes who won championships and declared themselves the sprinters to beat, there was a Sydney McLaughlin-Levrone or Elaine Thompson-Herah, defending Olympic champions who either didn’t show up or barely showed up at all. There were a handful of champion track and field athletes who were not heard from or far from top form in Budapest but should be competing for titles starting in 340 days when the Olympic track meet starts in the Stade de France.\nATLANTA (AP) — Viktor Hovland is the FedEx Cup champion and it really wasn't close. Hovland played the best golf of his career in the final two weeks of the PGA Tour season. He capped it off at East Lake by winning the Tour Championship. Hovland started the final round with a six-shot lead and shot a 63. Xander Schauffele made him earn it. He shot a 62. Hovland played the final two weeks in 36-under par to win the last two FedEx Cup playoff events. Now it's a question whether he gets consideration as the PGA Tour player of the year.\nDAYTONA BEACH, Fla. (AP) — NASCAR driver Ryan Preece is headed home from the hospital about 12 hours after his car rolled roughly a dozen times during a terrifying crash at Daytona International Speedway. Stewart-Haas Racing says Preece is traveling back to North Carolina after getting clearance from doctors at Halifax Health Medical Center. The team earlier said Preece was “awake, alert and mobile” and “had been communicating with family and friends.” The 32-year-old Preece was able to climb out of his mangled No. 41 Ford on Saturday night with help before emergency workers put him on a gurney and into an ambulance. He initially went to the track’s infield care center before being transported to Halifax Health for overnight observation.\nSUNDAY SCORES\nINTERLEAGUE\nFinal N.Y. Mets 3 L.A. Angels 2\nFinal Colorado 4 Baltimore 3\nFinal L.A. Dodgers 7 Boston 4\nAMERICAN LEAGUE\nFinal Tampa Bay 7 N.Y. Yankees 4\nFinal Chicago White Sox 6 Oakland 1\nFinal Houston 17 Detroit 4\nFinal Cleveland 10 Toronto 7\nFinal Minnesota 7 Texas 6\nFinal Seattle 3 Kansas City 2\nNATIONAL LEAGUE\nFinal Miami 2 Washington 1\nFinal Chicago Cubs 10 Pittsburgh 1\nFinal Philadelphia 3 St. Louis 0\nFinal Milwaukee 10 San Diego 6\nFinal Arizona 5 Cincinnati 2\nFinal San Francisco 8 Atlanta 5\nNATIONAL FOOTBALL LEAGUE PRESEASON\nFinal Houston 17 New Orleans 13",
  "word_count": 1370,
  "scraped_at": "2026-02-14T13:37:36.854532"
}