{
  "article_id": "035495069b99",
  "url": "https://www.elevenwarriors.com/skull-sessions/2026/01/160954/skull-session-winning-the-transfer-portal-is-becoming-more-crucial-each-season-five-buckeyes-appear-in-mel-kiper-s-top",
  "title": "Skull Session : Winning the Transfer Portal is Becoming More Crucial Each Season , Five Buckeyes Appear in Mel Kiper Top 15 2026 NFL Draft Prospects",
  "date": "20260106T113000Z",
  "domain": "elevenwarriors.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Welcome to the Skull Session.\nNational champion Cardale Jones made an appearance at the Ohio State men's basketball game on Monday.\nNational Champion @CJ1two in the house @OhioStateFB x @OhioStateHoops pic.twitter.com/YcyOJi2yaD\n— Ohio State Buckeyes (@OhioStAthletics) January 6, 2026\nToo bad the Basketbucks fell to the No. 10 Nebraska Cornhuskers, 72-69.\nHave a good Tuesday.\nMORE TRANSFERS, MORE WINS? On3’s Andy Staples wrote an interesting column last week examining how success in the transfer portal increasingly translates to wins on the field.\nMario Cristobal’s Miami Hurricanes served as the primary case study. Staples opened by pointing to quarterback Carson Beck (Georgia), defensive end Akeem Mesidor (West Virginia) and defensive back Zechariah Poyser (Jacksonville State) as key portal additions Cristobal blended with high school signees like defensive end Rueben Bain Jr., offensive tackle Francis Mauigoa and wide receiver Malachi Toney to build a championship-caliber roster.\n“But no matter how a coach chooses to construct a roster, one thing has become apparent,” Staples wrote. “Staffs must win recruiting battles in the transfer portal, no matter how much or how little they decide to use it.”\nThe remaining eight teams in the CFP show there are a lot of roster-building strategies that work.\n— Andy Staples (@AndyStaples) December 30, 2025\nBut if your team wants to make next years CFP, its going to have to win in the transfer portal over the next few weeks.https://t.co/mrkCuX9SJv pic.twitter.com/B1sSSeDAWb\nStaples cited data from SportSource Analytics showing how reliant College Football Playoff quarterfinalists were on transfers to fill their starting lineups this season. Ole Miss leaned on the portal more than anyone, with 66.3% of its regular-season starts coming from transfers. Indiana (65.9%), Texas Tech (63.3%) and Miami (53.6%) followed. Oregon (42.6%), Alabama (38.1%), Ohio State (27.7%) and Georgia (9.6%) rounded out the list. Four of the top five teams in that group advanced to the CFP semifinals.\nAt face value, the data might suggest that the more transfers a team adds, the better it becomes. But, to me, the numbers underscore that portal success is less about volume and more about precision. Wisconsin and Purdue each brought in dozens of transfers this offseason, yet the Badgers finished 4-8, and the Boilermakers went 2-10. That’s why I don’t think Ohio State should abandon its high school-centric roster-building model in favor of the transfer portal, but I do think the Buckeyes can afford to be more aggressive than they were a year ago. Retaining the top-tier talent Ryan Day has signed while using the portal to address specific roster needs remains the clearest path forward.\nIt’s been a slow start to the transfer portal season in Columbus, especially compared to the frenzies in Bloomington and Lubbock. Still, Day and his staff have earned the benefit of the doubt.\nWith a Heisman finalist in Julian Sayin and college football’s best player in Jeremiah Smith, Ohio State is in its championship window — and the transfer portal may decide how much longer it remains open.\nDEVELOPED HERE. This week, ESPN’s Mel Kiper Jr. updated his top 25 prospects in the 2026 class. Five Buckeyes landed in the top 15.\nNo. 4 - Arvell Reese\n2025 stats over 13 games: 62 tackles, 9 tackles for loss, 6.5 sacks, 9 run stops, 2 pass breakups\nThis is a complete football player. Reese jumps off the Ohio State tape, playing the game like a veteran. I see natural instincts at the linebacker position that allow him to make plays most guys just can't make, and he has the burst to get home when turned loose as a pass rusher. Reese has been a big riser in this class.\nNo. 9 - Carnell Tate\n2025 stats over 10 games: 48 catches, 838 receiving yards, 9 receiving TDs\nOhio State has turned into Wide Receiver U, with Emeka Egbuka being the most recent star wideout to come out of Columbus. And while most of the college football world focuses on Jeremiah Smith (who isn't eligible for the 2026 draft), Tate is putting up some serious numbers and showing why he is a top prospect for this class. Tate has produced big plays on a regular basis, averaging 17.5 yards per catch this season. He is a precise route runner, has great hands and displays outstanding body control. And he'll also happily block for ball carriers, which NFL coaches love to see. Tate had a lower-body injury earlier this season and missed a little time.\nNo. 11 - Caleb Downs\n2025 stats over 13 games: 57 tackles, 5 tackles for loss, 2 INTs, 1 sack, 6 run stops\nDowns -- the brother of NFL wide receiver Josh Downs and the son of former NFL running back Gary Downs -- is basically an extension of the defensive coordinator. His football knowledge shows in his play; it's obvious when you watch him in the Ohio State defense. But what really impressed me is how well he picked up Nick Saban's system as a 2023 freshman at Alabama before transferring.\nHe diagnoses quickly thanks to excellent pre-snap instincts, and that allows him to play faster than his straight-line speed might suggest. Plus, Downs is solid in coverage, and he is a very reliable open-field tackler.\nNo. 12 - Sonny Styles\n2025 stats over 13 games: 74 tackles, 5.5 tackles for loss, 9 run stops, 3 pass breakups, 1 INT, 1 forced fumble, 0.5 sacks\nYou can tell Styles is a former safety; he has outstanding speed, and his burst allows him to spy the QB. Watch for him to dominate at the combine and in predraft testing. Styles is also a dependable tackler and closes in a flash. He really took the next step this season, even as he adapted to a new system under defensive coordinator Matt Patricia.\nNo. 15 - Kayden McDonald\n2025 stats over 13 games: 60 tackles, 8.5 tackles for loss, 3 sacks, 16 run stops, 2 forced fumbles\nThe Big Ten Defensive Lineman of the Year has had a huge breakout season. Consider that he had zero starts, zero sacks and just 24 tackles over the previous two seasons. McDonald has crushed all those numbers over 13 starts this season. He's a force on the interior, with incredible strength and quickness for a player at his size. And McDonald is active and sniffs out the football to make plays.\nI like to be an optimist, but even I must admit it’s hard to look at a Big Board where Ohio State players make up a third of the top 15 and not wonder what could have been for the 2025 Buckeyes.\nNope, don’t want to think about it.\nBut I will think about…\nHERE COMES THE BRIDE (TO BE). Emeka Egbuka is engaged!\n“Everything we prayed for and more,” Egbuka wrote in the caption of his engagement post with his now-fiancée, Laney Matriano.\nLike J.T. Barrett in Monday’s Skull Session, Egbuka needs no introduction around these parts. The 2024 national champion and three-time All-Big Ten honoree caught a school-record 205 passes for 2,868 receiving yards and 24 touchdowns in 60 games for the Buckeyes.\nI learned two things from Egbuka’s post: one, he had a girlfriend — lol — and two, his fiancée was a four-year starter for Notre Dame women’s soccer from 2022–25. A native of Willoughby, Ohio, Matriano made 72 starts at midfielder for the Fighting Irish, recording five goals and nine assists.\n“She is a very technical midfielder that always seems to be calm and composed, no matter what the situation. She makes the game look very easy. She also has a fantastic defensive presence,” Notre Dame coach Nate Norman once said of Matriano.\nCongratulations to Egbuka and Matriano. Here’s hoping they spend a long, happy (and competitive) life together.\nARE YOU SURE ABOUT THAT? This week, ESPN’s Bill Barnwell predicted winners for the NFL’s awards. His selections included Chris Olave winning Comeback Player of the Year, and Jaxon Smith-Njigba finishing runner-up to Rams wide receiver Puka Nacua for Offensive Player of the Year.\nComeback Player of the Year\n1. Chris Olave, WR, New Orleans Saints\nLast season was bleak for Olave, who dealt with concussions while playing for a losing Saints team. By the end of the season, the Saints had shut down their star wide receiver, who admitted that he considered retirement during the offseason. It would have been a shame to see such a talented wideout leave the game so early in his career, and in 2025, Olave was able to reemerge as one of the best receivers in the league.\nWhile he didn't always have the sort of quarterback play his talents deserve, Olave racked up 1,163 yards and nine touchdowns in what was his best pro campaign to date. After Tyler Shough took over as the starting quarterback in Week 9, Olave averaged 82.5 receiving yards, the 10th-highest mark in the NFL. And Olave was able to stay on the field all season before missing the Week 18 finale because of a blood clot in his lungs. If Shough continues to impress, Olave could end up challenging for Pro Bowl consideration next season.\n...\nOffensive Player of the Year\n2. Jaxon Smith-Njigba, WR, Seattle Seahawks\nWhat a fun season from one of the many superstar receivers to come out of Ohio State in recent years. As I noted in my All-Pro column, Smith-Njigba racked up more than 44% of the receiving yards amassed by all Seahawks in 2025, the highest share by any receiver in a season since Brandon Marshall was over 45% for the Bears in 2012. With all due respect to Cooper Kupp, Rashid Shaheed and AJ Barner, Smith-Njigba was the only player opposing defenses needed to worry about in the Seattle passing game -- but nobody was able to stop him.\nThe best play in football in 2025 was throwing the ball to Smith-Njigba off play-action. The third-year wideout averaged 5.9 yards per route run with play-action, the best mark for any wideout since 2018. The chunk yardage Smith-Njigba picked up on those plays made for consistent big days, as he had nine different 100-yard games, more than any other player. He just wasn't quite as dominant as his counterpart in the NFC West.\nUnfortunately for Olave, 49ers running back Christian McCaffrey is a lock to win Comeback Player of the Year at -835. I was surprised that McCaffrey didn’t even land in Barnwell’s top three for the award when he may garner MVP votes along with Rams quarterback Matthew Stafford and Patriots quarterback Drake “Drake Maye” Maye.\nFortunately for JSN, the NFL receiving yards leader also feels like a lock to win Offensive Player of the Year, so again, I was surprised to see Barnwell pick Nacua over him. I respect Barnwell’s opinion, but the consensus odds favor JSN to win the award at -5000, followed by Nacua at +1900.\nSONG OF THE DAY. \"East of Eden\" - The Figs.\nCUT TO THE CHASE. The Cleveland Browns fire Kevin Stefanski and the Cincinnati Bengals retain Zac Taylor... Kevin Stefanski couldn’t make an unworkable situation work in Cleveland... A child fell to the ocean, but alarms didn't go off until her father jumped... After 1-11 season, Oklahoma State looks to Indiana's roster-rebuild blueprint.",
  "word_count": 1870,
  "scraped_at": "2026-02-14T13:23:54.137019"
}