{
  "article_id": "03954c5f7541",
  "url": "https://weaintgotnohistory.sbnation.com/chelsea-fc-women/165230/chelsea-fcw-5-0-crystal-palace-fcw-womens-fa-cup-post-match-reaction",
  "title": "Chelsea 5 - 0 Crystal Palace , Women FA Cup : Post - match reaction",
  "date": "20260117T191500Z",
  "domain": "weaintgotnohistory.sbnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Match blackouts are unfortunately not unprecedented with Chelsea Women. It’s still a weird happenstance given how in modern football you can easily find ways to watch live quasi-professional matches in leagues and countries severely under the radar of the average sports watcher.\nChelsea FCW 5-0 Crystal Palace FCW, Women’s FA Cup: Post-match reaction\nMore than enough!\nTo our luck Chelsea have always been on top of the game when it comes to their online presence. Their official website has only turned for the better over the years and a occasion like today’s really shows it.\nSo even if our eyes nor our ears could take account of what was taking place on the pitch as Chelsea faced Crystal Palace at home in a Women’s FA Cup fourth round game, we could turn to the Blues’ official report/play-by-play instead.\nAs expected the Blues dominated the Eagles at Kingsmeadow from kick-off, not affording them an inch while keeping up the ante upfront. Soon Chelsea would be in front, with Erin Cuthbert delivering a nice opportunity at the far post to Millie Bright so the captain could head in the opener from a free kick routine.\nCuthbert wouldn’t stop here, as she provided Sam Kerr the assist to score our second goal in the first half. Less than ten minutes later Guro Reiten scored from the spot on a penalty opportunity she earned herself.\nWith better luck and worse goalkeeping Chelsea could very well be five or six goals ahead of Palace in the first 45 minutes of play, as the visitors showed little to no signs of being able to pull one back for themselves throughout. We could very well coast towards victory on this 3-0 lead built in the first half, but our plans were clearly different.\nSam Kerr opened our second half account early, with a header from a corner kick. And Alyssa Thompson followed suit, with a close range shot on a rebound from Sjoeke Nüsken’s long-range attempt in the 70th minute to wrap it all up.\nCarefree!\n- A front-two of Sam Kerr and Lauren James, with Alyssa Thompson and Johanna Rytting Kaneryd as wing-backs.\n- 12 shots on goal from us versus a single one from Crystal Palace in the entire first half.\n- Not as dominant in the second half, but more than enough to keep Palace shut.\n- Next up: Manchester City away in the Women’s League Cup semi-finals.\n- KTBFFH!",
  "word_count": 406,
  "scraped_at": "2026-02-14T12:13:26.760403"
}