{
  "article_id": "03bf11fea714",
  "url": "https://www.news-gazette.com/bailey_buzz/the-bailey-buzz-sept-19-2024/article_f62e792e-74fa-11ef-96c8-57fe77e5cf37.html",
  "title": "The Bailey Buzz , Sept . 19 , 2024",
  "date": "20240919T143000Z",
  "domain": "news-gazette.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Drop in a question of your very own BY CLICKING HERE or by emailing 25-year Vermilion County reporter Jennifer Bailey at jbailey@news-gazette.com.\nLast weekend's 5th Annual River to Rail event, the new Runnings store opening in Danville, a roadway question, Kiwanis Pancake and Sausage Day next week and a lot near Big Lots in Danville are all part of this week's The Bailey Buzz.\nHow many participated in this year's River to Rail Ride event?\nKevin Green, with Friends of the Kickapoo Rail Trail/Trails of the Grand Prairie board of directors, says, \"It was a perfect day for bicycling around the county. We had a total of 116 riders. The oldest was 84, Bonnie McElwee. The youngest was Marcus Vinson, 4.\"\nThe River to Rail Ride bicycling event was back this year on Sept. 14. It was hosted by the Vermilion County Conservation District and had four routes starting at Kennekuk County Park. All proceeds benefitted the continued development of the Kickapoo Rail Trail. The routes were 63 miles, 37 miles, 30 miles or 7.5 miles. Three of the routes took cyclists to the Vermilion County Kickapoo Rail Trail section which includes the 1/4-mile Trestle Bridge 90 feet above the Middle Fork River. The fourth route was within Kennekuk County Park, which was good for beginning cyclists and families with young children. There also was a lunch.\nThe Friends of the Kickapoo Rail Trail/Trails of the Grand Prairie has been finalizing plans with the Village of Oakwood to convert the old fire station, located next to the post office and which the group has now purchased, into a bunk house/bungalow with two guest rooms for cyclists who are traveling through Oakwood on bikes using the KRT, and a community room and coffee shop for the Oakwood community and the bikers and hikers using the KRT. Construction is to begin this fall. It is envisioned that Oakwood will be the Vermilion County hub for biking recreation, as soon as the trail is completed from Champaign to Danville, and all of Kickapoo, according to Green.\nWhat's going on with the center line on East 1200 North Road between Westville and Catlin Indianola Road? New asphalt has been laid and a new dashed yellow line painted down the center. The weird thing is a second dashed yellow line has been painted next to the first. This line has shorter dashes which are not straight, some are angled inward and others outward. It's this way the entire length of the road so it's not likely the road crew made a mistake.\nI checked with Vermilion County Highway Engineer Adrian Greenwell who had this to report, \"The road in question is what is called an unmarked state-maintained route. It is not a county highway.\" Greenwell said there is temporary pavement marking tape on the road. \"It is placed until the permanent pavement markings can be placed. They will heat and remove the temporary tape soon. For a time both the permanent and temporary markings will be on the road,\" according to Greenwell.\nWhen will the Danville Runnings store open?\nAccording to Runnings officials, the Danville store's grand opening starts on Oct. 17. They hope to open the doors in a soft opening a few weeks before that. The company announced in March that the store on North Vermilion Street would open this fall. As those traveling by have seen, signage and other changes have been taking place at the building and property. The Tilton Runnings store, formerly RP Home and Harvest, celebrated its grand opening in March. Runnings' acquisition of RP Home & Harvest occurred in 2023. The Danville site, 3363 N. Vermilion St., was part of the Home & Harvest acquisition, and was used as a distribution center by the previous owners. \"We think the city of Danville is a good match for us and we're proud to restore this building to a retail location,\" Runnings President Brian Odegaard said earlier this year through a press release. \"We see great promise here and we're looking forward to introducing the Danville community to Runnings.\" The Danville store is expected to employ around 50 people.\nWhen is Kiwanis Pancake Day in Danville?\nKiwanis representatives say the tradition has lived on for 74 years now. The annual Danville Noon Kiwanis Pancake & Sausage Day will be from 6 a.m. to 8 p.m. Sept. 26 at the David S. Palmer Arena. Note that the arena has a clear bag policy. Tickets are available for $8 at the door. Cash, check and credit cards are accepted.\nDanville Noon Kiwanis continues to find ways to raise money for local children and youth agencies in the community. The pancake day event is expected to bring more than 3,000 people to the arena. Through the generosity of sponsors, ticket sales and dedicated volunteers, thousands of dollars have been given away to children’s charities. Kiwanis is a global organization of volunteers dedicated to improving the world, one child at a time. Danville Noon Kiwanis has been serving the local community for more than 100 years. It has invested thousands of dollars into area youth and children services. The group currently has more than 35 members who attend weekly meetings every Thursday at noon at the VFW in Danville. \"We are so grateful for those who continue to serve and support Kiwanis Annual Pancake Day,\" states Danville Noon Kiwanis President Dave Anderson. \"We want to make sure we celebrate those who make this event possible and the agencies that are working to positively impact our local children.\"\nThe group distributed more than $18,000 at the 3rd Annual Day of Giving in April to: Arts in the Park, Boys & Girls Club of Danville, CASA, Danville Bears Football Club, Danville Family YMCA, Danville High School Madrigal Singers, Danville Music Boosters, Dayspring Women’s & Children’s Shelter, Fair Hope Ministries, Fellowship of Christian Athletes, Food for the Children Program, Girls Scouts of Central Illinois, Hooves of Hope, Bismarck-Henning-Rossville-Alvin Key Club, Peer Court, Prairielands Council – Boy Scouts, Project Success, Salvation Army, Shop with a Cop, The Dwelling Place, The Hope Center, Vermilion County 4-H Federation, Vermilion County Conservation Foundation, Vermilion County Dare, Vermilion County Museum Society, Vermilion County Red White & Blue Program, Vermilion County Youth Orchestra, Women’s Care Clinic and various highs school scholarships.\nI noticed crews working on the lot just north of Big Lots in Danville along Logan Avenue where apartments were torn down a few years ago and has been for sale. Has the lot sold and hopefully seeing some prep work for new development?\nDanville Community Development Administrator Logan Cronk says, \"Unfortunately, we are not aware of anything with that site. I too am hopeful of development at that location, but no one has contacted the city or submitted any plans yet.\"",
  "word_count": 1130,
  "scraped_at": "2026-02-14T12:09:03.295837"
}