{
  "article_id": "03f90c121f8c",
  "url": "https://scvnews.com/scv-sheriffs-station-advises-homeowners-businesses-to-secure-electrical-panels/",
  "title": "SCVNews . com | SCV Sheriff Station Advises Homeowners , Businesses to Secure Electrical Panels",
  "date": "20230125T053000Z",
  "domain": "scvnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "[Sign Up Now] to Receive Our FREE Daily SCVTV-SCVNews Digest by E-Mail\nInside\nWeather\nCalendar\nToday in\nS.C.V. History\nS.C.V. History\nFebruary 13\nSanta Clarita Valley Sheriff’s Station detectives have been investigating a burglary in which the victim’s home in Valencia was ransacked and approximately $85,000 worth of personal property was taken.\nDuring the investigation, deputies learned the power had also been shut off via an unlocked electrical panel, most likely by the thieves.\nTo help prevent thieves from having better access to your home, be sure to lock any electrical or service panels or boxes with a secured lock.\nRemember, power can control a home’s lights, surveillance cameras, security systems and door keypads, so be sure to secure those panels.\nThis applies to both residences and businesses.\nComment On This Story\nCOMMENT POLICY: We welcome comments from individuals and businesses. All comments are moderated. Comments are subject to rejection if they are vulgar, combative, or in poor taste.\nREAL NAMES ONLY: All posters must use their real individual or business name. This applies equally to Twitter account holders who use a nickname.\nREAL NAMES ONLY: All posters must use their real individual or business name. This applies equally to Twitter account holders who use a nickname.\nYou can be the first one to leave a comment.\nLATEST CITY HEADLINES\nFriday, Feb 13, 2026\nFriday, Feb 13, 2026\nThursday, Feb 12, 2026\nThursday, Feb 12, 2026\nThursday, Feb 12, 2026\nKeep Up With Our Facebook\nLatest Additions to SCVNews.com\nState Senator Suzette Martinez Valladares has announced the introduction of SB 1060, legislation establishing a statewide standard requiring large residential alcohol and drug rehabilitation facilities to be located at least 1,000 feet away from public or private elementary schools, secondary schools and daycare centers.\nOvertime and penalty kicks were not good to our Foothill League boys soccer squads in the playoffs on Feb. 11. And the result was that only one of five teams, yes, the one that did not have to go to overtime, collected a victory. None of the Foothill League girls teams had to go to overtime, and two out of four came away with victories on Feb. 12.\n<strong>1999</strong> - SCV & AV split off from 805 area code to become 661 [<a href=\"https://scvhistory.com/scvhistory/sg031305-manzer.htm\" target=\"_blank\">story</a>]<br>\n<a href=\"https://scvhistory.com/scvhistory/sg031305-manzer.htm\" target=\"_blank\">\n<img src=\"https://scvhistory.com/gif/pacific_telephone.jpg\" alt=\"Pacific Telephone\" style=\"margin-top:6px;width:110px;border:0;\">\n</a>",
  "word_count": 387,
  "scraped_at": "2026-02-14T12:14:18.324857"
}