{
  "article_id": "03ff219714c0",
  "url": "https://interaksyon.philstar.com/hobbies-interests/2024/08/06/281016/olympics-whats-happening-on-day-11-of-paris-games-on-tuesday/",
  "title": "Olympics : What happening on Day 11 of Paris Games on Tuesday",
  "date": "20240806T031500Z",
  "domain": "interaksyon.philstar.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "PARIS — The Olympics has entered its final week at the Paris Games with the city seeing a buzz of activity across venues including athletics, football, wrestling, artistic swimming, sailing, skateboarding and many more.\nAs many as 15 medals will be up for grabs on Tuesday, with a third being awarded in athletics.\nKERR V INGEBRIGTSEN\nBritain’s Josh Kerr hopes to unseat reigning champion Jakob Ingebrigtsen of Norway in the men’s 1,500 meters final.\nThe rivals have been feuding since Kerr denied Ingebrigtsen the world title last year in Budapest, with the two trading barbs ever since.\nThey were matched up in the semi-finals, with Ingebrigtsen crossing first although both coasted through the finish line.\nMedals will also be awarded in women’s hammer throw, men’s long jump, women’s 3,000 steeplechase and women’s 200.\nSOCCER SEMIS\nFour leading women’s teams aim for a place in the final.\nIn Marseille, world champions Spain meet Brazil, who shocked France in the quarter-finals, while four-times gold medalists the United States face 2016 champions Germany in Lyon.\nFIVE GOLDS\nCuban great Mijain Lopez, 41, will hope to become the first-ever athlete to win five golds in the same Olympic event when he begins his campaign in the men’s Greco-Roman 130kg category.\nWorld champion Zholaman Sharshenbekov will bid to become Kyrgyzstan’s first-ever Olympic gold medalist in the 60kg.\nAmerican Amit Elor is among a new generation pushing for Olympic glory in the women’s 68kg freestyle.\nCHINA SEEK GOLD IN ARTISTIC SWIMMING\nTen countries will showcase their team free routines in artistic swimming.\nWith Russia excluded from the Games and historically the dominant country in the event, China have an opening for the gold medal after winning silver at the past three Olympics.\nCHINA LOOK FOR ONE-TWO IN DIVING\nChina’s Quan Hongchan will seek to retain her title in the women’s 10-metre platform final after coming out top in the semi-finals.\nHer closest rival is teammate Chen Yuxi, who was runner-up three years ago and came second in the semis.\nCANOE SPRINT BEGINS\nCanadian paddler Riley Melanson talks to Reuters as slalom and rowing give way to the canoe sprint competitions, which get under way on the flat water at the Vaires-sur-Marne Nautical Stadium on Tuesday.\nEQUESTRIAN\nThe much-awaited individual showjumping final will be on the last day of classic equestrianism in Versailles before modern pentathlon athletes take over the venue.\nBritain, the U.S. and France achieved top ranks in last week’s nations’ competition.\nThree of the world’s top jumpers – Sweden’s Henrick von Eckermann, Austria’s Max Kuhner and Switzerland’s Steve Guerdat – are likely to seek redemption after their teams fared poorly.\nSAILING\nMarit Bouwmeester of the Netherlands and Matt Wearn of Australia look set to lead the hunt in the women’s and men’s dinghy medal races.\nOlympic champion Anne-Marie Rindom of Denmark, who also won bronze in Rio, and veteran Cypriot sailor Pavlos Kontides, silver medallist in 2012, will be in hot pursuit.\nYOUNGEST ATHLETE\nJapan’s 15-year-old Cocona Hiraki will seek top spot on the podium in the women’s park skateboarding competition at La Concorde after claiming silver on the sport’s debut in Tokyo.\nBut she will have to fend off 22-year old Sakura Yosozumi – a three-times X-Games medalist who won the gold in Tokyo.\nZheng Haohao, aged 11, will become the youngest athlete from China at the Olympics and also the youngest in the world to take part in the Paris Games.\nSibling rivalry will also be on show, with Australian Arisa Trew (14) and her older sister Ruby ‘Rockstar’ Trew (15) also in the competition.\n—Reporting by Rohith Nair in Paris; Editing by Ken Ferris",
  "word_count": 603,
  "scraped_at": "2026-02-14T13:02:42.385454"
}