{
  "article_id": "043682d3b458",
  "url": "https://wwnc.iheart.com/content/2023-03-06-settlement-in-dog-attackunca-dominates-big-south-tourneykiller-sentenced/",
  "title": "Settlement in Dog Attack , UNCA Dominates Big South Tourney , Killer Sentenced",
  "date": "20230306T144500Z",
  "domain": "wwnc.iheart.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Settlement Reached In Hendersonville Dog Attack\n(Hendersonville, NC) -- A settlement has been reached in the case of a Hendersonville dog attack. A police K-9 reportedly attacked and injured a man in the driveway of his home in August 2020. The city of Hendersonville announced last week that the family reached a settlement of one-point-seven-million-dollars in the case. The police officer that was partnered with the dog still remains with the department.\nUNC Asheville Heading To NCAA Tournament\n(Asheville, NC) -- UNC Asheville is heading to the big dance. The men's team capped off a Big South championship with a win over Campbell yesterday, which guarantees the fifth NCAA basketball tournament appearance for the Bulldogs in program history. At Harrah's Cherokee Center, Furman will take on Chattanooga for the men's Southern Conference championship in downtown Asheville tonight. Chattanooga won the women's title on Saturday.\nMan Sentenced For Murphy Murder\n(Murphy, NC) -- One man is heading to prison for a murder in Murphy. It's been close to seven-years since Kenneth Jones was shot to death at a home on Sunrise Street. Investigators say the suspect, Bryan Crisp, led police on a high-speed chase into Tennessee before his arrest. A judge sentenced him last week to at least 35-years after his conviction of second-degree murder.\nAsheville Popcorn Company Expanding\n(Asheville, NC) -- An Asheville-based popcorn company has big plans to expand. Poppy Handcrafted Popcorn has raised three-million-dollars from investors to help increase manufacturing space and the number of its employees. One of Poppy's CEOs says the company has just over 50-employees now, but that number could double in the next few years.\nAsheville Dog Featured In Cadbury Contest\n(Asheville, NC) -- This year's Cadbury Bunny mascot could be a dog from western North Carolina. A Maltese named Howie is in the semifinals for the mascot contest, which holds voting online beginning today. Cadbury opened up the possibility to name different animals as mascots several years ago. WLOS-TV reports Howie was adopted by an Asheville family after he spent years in a Chinese puppy mill.\nHaywood County GOP Holds Convention\n(Haywood County, NC) -- Haywood County's GOP is gearing up for the next year. WLOS-TV reports the party held its local convention meeting over the weekend. Congressman Chuck Edwards spoke at the event about his work at the nation's capitol.\nPedestrian Killed By Charter Bus In Dallas\n(Dallas, NC) -- The highway patrol is investigating a deadly pedestrian accident involving a charter bus in Dallas. A 33-year-old woman was reportedly killed by the bus when she was crossing Highway 321 on Saturday night. WCNC says no charges have been filed at this time.\nGaston Manufacturing Plant Laying Off 40-Plus\n(Gaston County, NC) -- More than 40 people are losing their jobs at a Gaston County manufacturing plant. A notice filed with the North Carolina Department of Commerce reveals Coats American will lay off those employees from its Dickson Road location by late April. The company specializes in industrial thread manufacturing for apparel and footwear businesses.\nTwo Dead In Gaston County Murder-Suicide\n(Gaston County, NC) -- Two people are dead in an apparent murder-suicide in Gaston County. Police found a man and woman dead inside a home on Mountain Meadows Drive early Sunday morning. Investigators say they believe the man killed the woman before killing himself. It's believed the couple were husband and wife.\nCharlotte FC Drops Second Game\n(Charlotte, NC) -- Charlotte FC is still looking for its first win of the season. The team fell to expansion team Saint Louis City by a score of three-to-one on Saturday night. Charlotte has dropped the first two matches, but can pick up win number-one at LA Galaxy this upcoming Saturday. Saint Louis has opened up its inaugural Major League Soccer season with two wins.\nNew School Opening Delayed In Charlotte\n(Charlotte, NC) -- The opening of a new school in Charlotte is being delayed. Construction delays and permitting issues are forcing a pushback to 2024 for the Elon Park elementary school. It will serve as relief for three other schools. Those students who were initially assigned to the new facility for 2023 will stay at their current schools for the next academic year.\nLongtime Huntersville Police Chief To Retire\n(Huntersville, NC) -- Huntersville's police chief is calling it a career. Chief Bence Hoyle announced last week that he's retiring effective June 1st after serving in the position for close to two-decades. His career in law enforcement dates back nearly 40-years. Major Barry Graham is taking over as chief, with around 25-years experience in the Huntersville department.\nFour Dead, Two Injured In Collision Between SUV And 18 Wheeler\n(Cumberland County, NC) -- Four people were killed in a fiery crash with a tractor trailer in Cumberland County Sunday. It happened shortly after 3 p.m. at the intersection of Hayfield and Goldsboro Roads along U.S. Highway 13 near Eastover. Investigators say an SUV carrying five people collided with an 18-wheeler, resulting in all of the occupants of the smaller vehicle being ejected. Both vehicles also burst into flames. Four of the victims were pronounced dead at the scene. The lone survivor was hospitalized with serious injuries. The driver of the tractor trailer's injuries were not life-threatening.\nPlanned Road Construction Project In Raleigh Delayed Until Tomorrow\n(Raleigh, NC) -- A major road construction project that was scheduled to get underway this weekend, has been pushed back until tomorrow. According to NCDOT, the work was postponed due to the weather. The massive project at the intersection Hillsborough Street and Blue Ridge Road, will involve rerouting traffic underneath Hillsborough Street, the railroad tracks and Beryl Road. Traffic will be closed off in that area for about six months.\nCooper To Deliver Annual State Of The State Address Tonight\n(Raleigh, NC) -- Governor Roy Cooper is scheduled to deliver his fourth State of the State address tonight. According to a news release, Cooper will address a joint session of the North Carolina General Assembly beginning at 7 p.m. During the speech, the governor is expected to highlight certain pieces of legislation he would like to see passed during the current session, as well as his proposed budget. Lt. Governor Mark Robinson will deliver the Republican response.\nDeath Of Woman Found In Durham Hotel Classified As A Homicide\n(Durham, NC) -- Durham police say a woman whose death was initially reported to have been caused by cardiac arrest, is now being investigated as a homicide. It happened early Sunday morning at the Sonesta Select Hotel on Residence Inn Boulevard. Officers arrived to find the unidentified adult female already dead. But upon further examination, it was determined the cause of death was the result of a homicide. No further information was released by police.\nAnimal Shelter Issues Urgent Plea For People To Adopt Pets Before Its Too Late\n(Wake County, NC) -- The Wake County Animal Center is asking the public for help by considering adopting pets who are in danger of being euthanized. The Center reported over the weekend, that it has taken in 90-dogs within the last week, pushing its occupancy to near capacity at 135. Operators are expecting more dogs to be brought in this week. The adoption fee is 95-dollars for most dogs. Those who've been at the Center for more than two weeks can be adopted for just 25-dollars.\nCanes Shut Out Tampa Bay 6-0 At PNC Arena Sunday\n(Raleigh, NC) -- The Carolina Hurricanes continued their winning streak Sunday, with a 6-0 route of the Tampa Bay Lightning at PNC Arena. The victory was also punctuated by an impressive performance from defenseman Shayne Gostisbehere, who was just acquired in a trade with Arizona last week. Gostisbehere had one goal and two assists for a total of three power play points, to help the Canes win their 14th out of the last 17 games. Frederik Andersen also got his first shutout of the season with 14 saves.",
  "word_count": 1321,
  "scraped_at": "2026-02-14T12:13:49.170877"
}