{
  "article_id": "043ce82047d7",
  "url": "https://www.pressdemocrat.com/2025/09/03/uc-san-diego-to-join-west-coast-conference-in-2027/",
  "title": "UC San Diego to join West Coast Conference in 2027 – The Press Democrat",
  "date": "20250904T103000Z",
  "domain": "pressdemocrat.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "UC San Diego is joining the West Coast Conference in 2027, giving the league 10 members for the 2027-28 school year in the latest round of conference realignment.\nThe Tritons will compete in 14 of the WCC’s 16 sponsored events, including men’s and women’s basketball, soccer, volleyball, baseball and softball. The school will seek a conference affiliation for the remaining 10 sports it sponsors.\n“We continually identify valuable opportunities to expand our membership, and the addition of UC San Diego greatly aligns with the goals of the West Coast Conference,” WCC Commissioner Stu Jackson said in a statement Wednesday. “UC San Diego’s meteoric rise during its recent NCAA Division I transition is the result of strong leadership, strategic investment and deliberate planning for postseason success.”\nUC San Diego completed its four-year transition to Division I last year, becoming the first school in NCAA history to have both its men’s and women’s basketball programs reach the NCAA Tournament in its inaugural year of Division I postseason eligibility.\nUC San Diego’s move will give the WCC eight schools from California.\n“We are excited to join the West Coast Conference, propelling our Triton scholar-athletes to new heights of excellence alongside top-tier teams in a range of sports and advancing our long-term strategic vision,” UC San Diego Chancellor Pradeep K. Khosla said in a statement. “This move expands our reach across major West Coast metropolitan areas, amplifying our audience, media coverage and national presence.”\nThe WCC is losing national basketball powerhouse Gonzaga to the Pac-12 next year, but added Seattle this year. Grand Canyon initially agreed to leave the Western Athletic Conference for the WCC in May, but backed out to join the Mountain West Conference instead, triggering a lawsuit for breach of contract.\n___ Get poll alerts and updates on the AP Top 25 throughout the season. Sign up here. AP college basketball: https://apnews.com/hub/ap-top-25-college-basketball-poll and https://apnews.com/hub/college-basketball",
  "word_count": 313,
  "scraped_at": "2026-02-14T12:20:15.731360"
}