{
  "article_id": "045bbf80b76f",
  "url": "https://thenews-chronicle.com/ndic-to-recover-n700-billion-from-defunct-heritage-bank-nigeria-to-face-south-africa-in-2026-fifa-world-cup-qualifier-tonight-trending-today/",
  "title": "NDIC to Recover N700 Billion from Defunct Heritage Bank ; Nigeria to Face South Africa in 2026 FIFA World Cup Qualifier Tonight – Trending Today",
  "date": "20240607T143000Z",
  "domain": "thenews-chronicle.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Hello and welcome! In today’s trending news stories;\n1. The Minister of Budget and Economic Planning, Wale Edu, has reassured that there is “no cause for alarm” regarding the ongoing minimum wage negotiations between Organized Labour and the Tripartite Committee. This assurance followed his and Budget Minister Atiku Bagudu’s meeting with President Bola Tinubu. President Tinubu recently directed the finance minister to propose a new minimum wage above N60,000, while Organized Labour demanded N494,000. Amidst this development, the Federal Government denied reports that it proposed N105,000 as the new minimum wage. Special Adviser to the President on Information and Strategy, Bayo Onanuga, clarified via X (formerly Twitter) that the reported figure was false. The Tripartite Committee meeting was stalled on Wednesday due to the lack of a new proposal after the initial N60,000 offer was rejected. The ministers of Finance and Budget have since presented a new figure to the President, expected to be discussed at the committee meeting today\n2. The NDIC’s Managing Director, Bello Hassan, committed to recovering over N700 billion in loans from the defunct Heritage Bank Plc, whose license was revoked by the CBN. He assured that payments to insured depositors will start this week, ahead of the 30-day requirement. Most depositors, holding balances under N5 million, will receive full coverage from the Deposit Insurance Fund. At takeover, NDIC found N650 billion in deposits, a figure expected to rise. Payments to uninsured depositors will depend on asset sales. Hassan noted historically low recovery rates but highlighted new powers under the NDIC Act 2023 to improve efforts. He denied political motivations behind the bank’s license revocation, asserting it was a regulatory action.\n3. The Supreme Court of Saudi Arabia has announced that the crescent moon of Dhu Al Hijjah was sighted on Thursday evening, making Friday, June 7, 2024, the first day of the Islamic month of Dhu Al Hijjah. This marks the beginning of the Hajj pilgrimage season. Key religious observances include Arafat Day on Saturday, June 15, 2024, and Salah Day, or Eid Al Adha, on Sunday, June 16, 2024. Eid Al Adha, also known as the “Festival of Sacrifice,” commemorates Prophet Ibrahim’s willingness to sacrifice his son in obedience to God. In contrast, Oman did not sight the crescent moon and will start Dhu Al Hijjah on Saturday, June 8, 2024. Consequently, Oman will celebrate Eid Al Adha on Monday, June 17, 2024.\n4. Former international Emmanuel Babayaro defended Daniel Amokachi for rejecting “demeaning terms” to work as Super Eagles assistant coach. Amokachi, appointed as an assistant to head coach Finidi George in May, declined the position after the Nigeria Football Federation (NFF) presented job conditions including no salary and discretionary involvement by the head coach. Babayaro criticized these terms as demeaning. In related news, South Africa’s national team, Bafana Bafana, endured a prolonged 18-hour journey to Uyo, Nigeria, for their 2026 FIFA World Cup qualifier against the Super Eagles. Delays included bureaucratic bottlenecks and the closure of Uyo airport. The team expressed their frustration but confirmed their arrival on Thursday. The team held a pre-match press conference and training session on Thursday tonight. On Friday, 6th June, Nigeria will face South Africa at 8:00 pm. Bafana Bafana’s Themba Zwane expressed optimism for a positive result, especially after their recent AFCON semi-final loss to Nigeria.\n5. Nigerian chess grandmaster Tunde Onakoya, who holds the Guinness World Record for the longest marathon chess game, is set to face 12-year-old chess prodigy Deborah Quickpen in a match on June 11, 2024. The match aims to promote education and unlock potential in children across Nigeria. Onakoya described this upcoming three-hour match as his hardest yet, praising Quickpen as the future of Nigerian chess. Proceeds from the match will support the expansion of chess in Nigeria. Quickpen, Nigeria’s number one chess prodigy, and the current National Women’s Chess Champion, will represent Nigeria at the FIDE Chess World Cup in Georgia next month. Despite her young age, she holds the title of Women’s Candidate Master and is ranked fourth in Africa across all female age groups.",
  "word_count": 677,
  "scraped_at": "2026-02-14T14:13:17.457786"
}