{
  "article_id": "046267d88a08",
  "url": "https://www.examiner.com.au/story/8487681/launcestons-a-league-involvement-ends-with-utas-stadium-snub/",
  "title": "Launceston A - League involvement ends with UTAS Stadium snub | The Examiner",
  "date": "20240116T080000Z",
  "domain": "examiner.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Launceston's lengthy involvement with the A-League has come to an end with the announcement that all three of Tasmania's upcoming matches in the national soccer competition will be in Hobart.\nSubscribe now for unlimited access.\nor signup to continue reading\nFootball Tasmania, the state government and adopted A-League club Western United talked up the two men's and one women's matches to be played at North Hobart Oval, but the announcement ends a sequence of games played at UTAS Stadium dating back to 2006 and attracting crowds in excess of 8000, even for pre-season friendlies.\nFootball Tasmania chief executive Tony Pignata confirmed the Launceston venue would not be considered for A-League matches again.\n\"Launceston's facilities are not up to scratch,\" he told The Examiner.\n\"York Park is a fantastic playing surface but we won't be playing our game in oval stadiums like that.\n\"I've been at York Park for many games and appearances are not great from a spectator point of view.\"\nAsked if he thought it was a snub for Northern soccer fans, he said: \"I can see that. I would be disappointed if I lived in Launceston, loved the game and could not attend ... but 2000 people at that facility just does not bode well for the game. You are so far away from the action, it's ridiculous.\"\nPignata said elite soccer matches would also not be played at the proposed Macquarie Point stadium in Hobart as the sport continues to push for a purpose-built rectangular venue of at least 10,000 seats.\nExplaining the move to North Hobart Oval, he said: \"North Hobart last year attracted a very good crowd and I think that facility is far better than anything in Launceston. It is an oval but is more intimate and the way it is structured and its size brings people closer to the action.\"\nNorth Hobart Oval staged a men's-women's double-header last January and will do the same on Saturday, February 3, a week after hosting John Aloisi's Western United against Western Sydney Wanderers.\nPress releases announcing the matches said Melbourne's Western United would continue its connection with the Launceston community through gala days and junior clinics but did not mention the end of the city's run of fixtures.\nWestern United executive chairman Jason Sourasis thanked the Tasmanian Government and Football Tasmania for their ongoing support, saying: \"We are proud of our ability to bring football to a brand-new audience down in Tasmania.\n\"We can't wait to bring three more exciting matches of elite football to North Hobart Oval, and hopefully everyone in the community can come together and enjoy it.\"\nMinister for Stadia and Events Nic Street said the two-year agreement between the Liberal Government and Western United cost $480,000.\n\"These three fixtures will deliver scintillating action for sports lovers, and we hope some big crowds will turn out to see high-quality football here at home in Tasmania,\" he said.\nLaunceston's involvement with the A-League began within a year of the competition's launch in 2005. Between 2006 and 2011, York Park hosted pre-season friendlies involving Melbourne Victory which attracted crowds of 6834, 8061, 4720, 6257, 4670 and 6300.\nThe first A-League roster match in the state in 2012 drew a Wednesday-night York Park crowd of 5268 which saw a goal from World Cup star Harry Kewell against Gold Coast United.\nWith Western United forming a partnership with the state in 2021, fixtures continued at the venue although post-COVID crowds dropped to 3203 and 2528 (against Central Coast Mariners and New Zealand Phoenix respectively) in 2021, then 1552, 2231 (both against Perth) and 1569 (Macarthur) in 2022 and 2690 against Wellington Phoenix last February.\nPerth Glory also played twice in four days against Brisbane Roar and Macarthur in 2022, attracting crowds of just 1146 and 723.\nNorth Hobart Oval was handed a national double-header last season with attendances of 2050 and 5127 for Western United's matches against Brisbane Roar (women) and Sydney (men) on January 21.\nThe A-League fixture announcement follows UTAS Stadium having its Big Bash League allocation cut from two games to one with the reduction in the size of the national Twenty20 competition from 14 games each to 10.\nLaunceston was also snubbed by international netball fixtures last year with Australia playing South Africa twice at Hobart's MyState Bank Arena despite the Silverdome staging all previous Diamonds fixtures in the state and recording a sell-out crowd for Collingwood's final-ever Super Netball match in June.\n2024 FIXTURES\nA-League Men\n- Round 14: Western United v Western Sydney Wanderers, 5pm Saturday, January, 27\n- Round 15: Western United v Sydney FC, 5pm Saturday, February 3\nA-League Women\n- Round 15: Western United v Central Coast Mariners, 2.15pm Saturday, February 3\nAll at North Hobart Oval",
  "word_count": 789,
  "scraped_at": "2026-02-14T12:41:23.922553"
}