{
  "article_id": "04c68f2f204d",
  "url": "https://www.nytimes.com/athletic/6725160/2025/10/19/hutton-sentnor-friendship-kc-current-uswnt/",
  "title": "USWNT Claire Hutton and Ally Sentnor : Kindred spirits carrying the torch for a new generation",
  "date": "20251019T123000Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Claire Hutton and Ally Sentnor don’t need words to communicate. They just connect.\nThe 19-year-old defensive midfielder and the 21-year-old forward for the Kansas City Current and the U.S. women’s national team have been inseparable ever since they met at a youth soccer camp in 2022 at the University of North Carolina. Hutton was a high-school junior committed to UNC, and Sentnor was a sophomore playing for the 23-time NCAA Champion Tar Heels. But to Hutton, she was already, “OMG, that’s Ally Sentnor.”\nAdvertisement\nNow, four years later, they’re finally neighbors, living two doors apart in Kansas City. The joy is written all over their faces as they talk to The Athletic over Zoom.\nThey finish each other’s sentences, breaking into laughter, their chemistry radiating through the screen. What began as a shared passion at a college training camp has evolved into a bond strengthened by shared milestones, most recently, Sentnor’s blockbuster trade from the Utah Royals to the Current in August, a move that turned their long-distance friendship into an everyday sisterhood.\nThey say they are kindred spirits.\n“We always knew of each other, but it wasn’t until we started going to youth camps with each other that we were like, ‘Oh my gosh, we’re so similar!’” Sentnor told The Athletic as they recalled their first real in-person meeting at UNC’s Chapel Hill campus.\n“I just knew I was going to be friends with her. It didn’t take long for me to trust her. I knew she was my friend,” Hutton recalled.\nUntil recently, most of their friendship unfolded miles apart.\nUpon graduating early from high school in the summer of 2023, Hutton trained with an array of NWSL teams and eventually chose to forgo her collegiate career at UNC, signing a three-year contract with the Kansas City Current that December.\nSentnor left college early after two consecutive NCAA tournament runs but continued her studies online to complete her degree. She was the top pick in the 2024 NWSL draft and joined the Royals. After a strong rookie season, she was traded to the Current in a record-breaking deal this summer. Hutton was eager for the trade to happen if it meant seeing her friend, and tried very hard not to jinx it.\n“At one point, I stopped texting Claire because if I got her hopes up and the trade fell through, I’d be the worst friend,” Sentnor recalled the months leading up to her arrival at the Current. “I told her, ‘I’ll let you know when it’s done.’”\nAdvertisement\nThey kept their weekly calls carefully scripted so that Hutton’s first question wasn’t “Is it done?” They started with what was for dinner, then maybe circle back. When it landed, the off-field fit was instant.\nOn the field, their connection leaves no space for words.\n“I get the ball and I almost always know she’ll be in that pocket,” Hutton explained. It’s Hutton’s shoulder check, her pivot and the lane that opens because Sentnor has already slid into the seam. No wave, no signals. Just the pass and the give-and-go that makes a complex rotation look like muscle memory.\nThe unspoken sync has yet to result in a goal for the Current, but now they have a chance to do so with the U.S. in this upcoming international window next week.\nIt will be their tenth camp together.\nTheir most memorable one was the time when they roomed together at the 2024 Under-20 World Cup in Colombia.\n“It’s like past lives,” Hutton said. “You don’t know why you love that person so much. You just do.”\nThe 2024 U20 World Cup was filled with drama. The young U.S. team left many games late, scoring winners well after 90 minutes. They finished the tournament with the program’s second bronze medal in 20 years (the last coming in 2004 against Thailand).\nDuring the tournament, Hutton took a ball to the head during practice the day before their quarterfinal match against Germany and had to enter concussion protocol, missing the following two games.\nSentnor, who captained the team in her second U20 World Cup, noticed Hutton struggling. Hutton was squinting, typing the wrong words in the text. Sentnor quietly took the reins and took care of her friend.\n“She leaned on me with the concussion, but she was my person that I could come back to the room and talk about everything throughout that tournament,” Sentnor recalls. “The responsibility (of being a captain) comes with drama and other things you have to deal with outside of soccer. Claire was my sounding board, which is so incredible because she was one of the youngest players on the team.”\nAdvertisement\nSentnor has accumulated 12 senior U.S. appearances and scored four goals and two assists. Hutton scored her first international goal for the USWNT on July 2, 2025, against Canada in a friendly match. The goal was a header from a corner kick in the 36th minute that gave the U.S. a 2-0 lead in a game they ultimately won 3-0. It was a pinch-me moment for her.\nStill, neither player is under the guise that they are a guarantee for Emma Hayes’ rosters for the next two years. The U.S. coach is giving every player a chance and runs training drills that are stripped-down and specific. In a recent camp, Hayes made center-backs repeat a single inside-foot touch around a cone until it was automatic; forwards rehearsed a micro-touch that sets up the next action, Hutton explained.\n“You can’t just work hard for the month leading up to (the World Cup), it’s the day in and day out right now that hopefully can get us selected for that World Cup team,” Sentnor says. “Every camp is a stepping stone, and the chance to represent our country on the biggest stage would be a dream come true.”\nFor the next three matches against Portugal and New Zealand, Hayes decided to reintegrate seasoned Europe-based players like captain Lindsey Heaps, midfielder Lily Yohannes, defender Emily Fox, forward Catarina Macario, goalkeeper Phallon Tullis-Joyce, and forward Alyssa Thompson. But she also did not disguise her delight at what Sentnor brings to the team.\n“She provides another option for us on the left-hand side that can tuck in as an extra 10,” she told reporters on Wednesday. “She may have added a little bit more flexibility than some other players in that situation.”\nWith the nonstop pressure to perform at the top level, Sentnor and Hutton manage to keep their nerves at bay with cooking.\nWhen they are not training, they cook in shifts and share ingredients.\nAdvertisement\n“If I run out of eggs, I’ve got Claire’s eggs,” Sentnor jokes. They’re both planners, both tidy and both food people. Hutton is trying to convert Sentnor to spice.\n“We started at mild. We’ll work to medium,” she said, revealing their shared love for a particular buffalo chicken recipe at the moment. In their free time, they keep a running list of Kansas City restaurants. Post-dinner sweet treats are non-negotiable. Hutton’s old superstition, ice cream the day before a match, died after one good game without it. “I guess the new superstition is no ice cream,” she says, unconvinced. But sweet treats will never not have a place in their kitchens.\nWhen they are not cooking together or training, they are working towards their childhood dreams. “One of the reasons we’re so close as friends and are able to be such incredible teammates is because we truly want each other to succeed,” Sentnor said. “We want the people around us to succeed.”\nHutton, a native of New York state, got to see the USWNT squad live, in Hartford, Connecticut, when she was a little girl playing soccer for the local Alleycats Soccer Club.\n“It was just a friendly, not even a World Cup match, but it was my first ever live soccer game,” Hutton said. “Seeing what these women represent, with all these fans here screaming and being involved in that, getting the signatures after, I feel like it was just that moment for me,” she said.\nOn Oct. 26, she will take the field in that very same stadium. This time, as the one being celebrated. It’s a full-circle moment, ten years in the making.\n“We were not around for the 99ers,” Sentnor said with a laugh. Her first jersey was the red and white striped Alex Morgan jersey. She wore the full kit, of course, with shorts and socks, everywhere she went.\n“I looked up to those girls and thought they were just untouchable. Like the coolest people ever existed,” she added. The U.S. will honor Morgan ahead of the match on Thursday in Philadelphia. “Now, meeting them and playing with them, I’m like, ‘Wait a second, this is kind of nuts!’ I have a picture with you from when I was, like, 12. So it really is crazy.”\nAdvertisement\nFor just 19 and 22, they are proud to wear the crest, and they’re equally determined to carry forward the work that Morgan’s generation once carried. Morgan helped lead the USWNT’s historic fight for equal pay and played a key role in the NWSL’s collective bargaining negotiations.\nNow that they have equal pay secured with a strong CBA in place, Hutton and Sentnor’s focus is on making “great” the baseline across the league. The job is not done until every NWSL team can offer the same opportunities as their owners at Kansas City offer, like their own stadium and state-of-the-art training facilities.\n“It isn’t OK just for one or maybe six clubs doing it; it needs to be done across the whole league,” Hutton says.\n“It can be very easy to get caught up in the individual game and the accolades and everything, but the way that Claire and I think about it is that we want everyone to feel a part of it,” Sentnor added. “We want everyone you know to be able to play at the highest level of their game. And it’s important to celebrate each other’s successes so that we can continue to drive the sport.”",
  "word_count": 1680,
  "scraped_at": "2026-02-14T12:20:58.727469"
}