{
  "article_id": "04cdc2e04b49",
  "url": "https://www.politics.co.uk/5-minute-read/2023/12/05/the-weird-and-wonderful-set-to-shape-the-future-of-british-politics/",
  "title": "The weird and wonderful set to shape the future of British politics",
  "date": "20231205T133000Z",
  "domain": "politics.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Change is coming to Westminster, no matter the outcome of the next election.\nWhether it’s a landslide Labour victory or a shock Sunak comeback, a new crop of aspirant MPs will be marching to Westminster in 2024/2025 as SW1’s retirees — feeling fatalistic, having served their time, or simply been thwarted by the Boundary Commission — exit stage left.\nSo far, 105 of 650 MPs have plans to retire from frontline politics, either voluntarily or at their party’s direction. But given the length of the current parliament, this level is expected to rise further in the coming months.\nThe current record for MP turnover between parliaments was set after the 1945 election, as some 324 of the UK’s then 640 MPs entered the House of Commons for the first time. However, if Labour emerges in 2024 or early 2025 with a majority resembling anything like the current polls, this 1945 touchstone could be under threat.\nSo, who are the individuals set to receive a personal windfall from the UK’s changing political tides?\nUsing data collated by the political mapping and visualisation platform, Polimapper, politics.co.uk has listed some of the most eye-catching individuals vying to participate in Britain’s next parliament.\nThe athletes\nActing on behalf of some 75,000 electors will be of little concern for some wannabe MPs, those who already have a track record of representation at the highest level.\nMost well-known of this cohort, of course, is James Cracknell (Conservative, Colchester), whose candidature is bolstered by his two Olympic rowing gold medals.\nBut he is far from alone. Also making up the “Class of 2024’s” jock cohort is Aisha Cuthbert (Conservative, Sittingbourne and Sheppey), who represented Team GB at the 2017 world synchronised swimming championships. Toeing the line in Westminster will come naturally to Cuthbert, one imagines.\nBringing a whole new meaning to the notion of parachuting into a safe seat, David Reed (Conservative, Exmouth), a former Royal Marine Commando, is seeking to impress the electorate with stories of his days representing Team GB in the sport of Parachute Display.\nBut it’s not just Conservative wannabe MPs who have a sporting pedigree, Henry Tufnell (Labour, Mid and South Pembrokeshire) once competed professionally in middle-distance 800 metres and 1,500 metres races, bolstered from his training regime high in the Kenyan mountains.\nTara Copeland (Lib Dem, Leyton and Wanstead) sports the captain’s armband for Leyton Orient F.C. At the last election, the Liberal Democrat Party won only enough seats to field a full football team, with no subs. Copeland will need to rely on a far better performance if her hopes of a high-profile transfer to SW1 are to be realised.\nThe action adventurers\nStamina and endurance are virtues in Westminster — whether you’re a rookie MP, forced to wait for much of a day’s sitting for just a few minutes of speaking time in a debate; a junior minister readying to deliver a pre-prepared response in Westminster Hall; or the prime minister, forced to answer questions for hours at the despatch box after delivering a significant statement.\nFortunately, for some aspirant MPs, stamina and endurance come in abundance.\nTake Roz Savage for instance (Lib Dem, South Cotswolds) who has rowed solo across each of the Atlantic, Pacific, and Indian Oceans — picking up four Guinness World Records in the process.\nThe journey from SW1 to his constituency on a Thursday afternoon will also be little concern for Andy MacNae (Labour, Rossendale and Darwen), a former professional mountaineer, who has led 15 expeditions in the Greater Ranges. He also serves as Chief Executive of Venture Xtreme, a company that plans adventures to extreme destinations. Westminster is MacNae’s next target, it seems.\nDoing battle for Plymouth Moor View — where incumbent Johnny Mercer, the combative Veterans Minister, resides — is Fred Thomas (Labour), an expert in arctic warfare and the former Royal Marines light heavyweight boxing champion.\nAlongside Thomas, a whole host of new combatants may soon be strutting around. Hoping to split their time between a stuffy Westminster office and the dojo hall are kickboxing fan Naushabah Khan (Labour, Gillingham and Rainham) — and fellow martial artists Warinder Juss (Labour, Wolverhampton West), who partakes when not playing his tabla (a set of double drums); Will Stone (Labour, Swindon North), a self-employed Brazilian Jiu Jitsu expert and active competitor; as well as one-time Brexit Party candidate, Craig Smith (Conservative, North West Leicestershire), the principal coach at the Stealth Black Belt martial arts academy in Coalville.\nAnd for their battle planning, parliament’s incoming action adventurer cohort could turn to Dr Mike Martin (Lib Dem, Tunbridge Wells), a former army officer turned author, whose works on psychology and conflict include the account Why We Fight, published in 2018.\nThe academics\nBolstering all the brawn above is this next cohort — the intellectually self-confident whose academic pathway, they hope, will devastate and woe their respective electorates in equal measure.\nIn total, of the 550 candidates selected to date, circa 6 per cent have a PhD, well in excess of the 1 per cent said to be found in the general population as a whole. One who hopes his post-doctoral pathway culminates in a parliamentary seat is Dr Adam Thompson (Labour, Erewash), the Associate Editor of the Journal of Precision Engineering.\nLuke Gardiner PhD (Conservative, Mid Derbyshire), another intent on appending a further abbreviation to his official title, completed his doctoral thesis, The Truth is Bitter, on the social and intellectual history of the Christian Roman Empire. His knowledge of how ideas can drive history could well be appreciated in any future Conservative leadership contest.\nPolitics isn’t rocket science — or is it? That’s a question Dr Ian Sollom (Lib Dem, St Neots and Mid Cambridge), who has a Cambridge PhD in cosmology (The Bayesian Analysis of the Cosmic Microwave Background Beyond the Concordance Model, for those seeking some bedtime reading) might be able to answer in time.\nIt will be no surprise that one-fifth of the country’s candidates so far selected in prime seats will have attended either Oxford or Cambridge. But 10, mainly Labour candidates, can also boast an education from one of the United States of America’s most prestigious universities — that is Harvard, Yale, or Stamford. These include: Tom Collins (Labour, Worcester), Kanishka Narayan (Labour, Vale of Glamorgan), Olly Glover (Liberal, Didoct and Wantage), Sarah Sackman (Labour, Finchley and Golders Green), Chris Murray (Labour, Edinburgh East), Hamish Falconer (Labour, Lincoln), Tom Hayes (Labour, Bournemouth East), Chesca Walton (Green Party, Hackney South and Shoreditch), and Chris Coghlan (Lib Dem, Dorking and Horley).\nIt’s not all high-octane…\nThere are other pathways to parliament that aren’t academic, sporting, or action-orientated, of course.\nEvoking anything but the warrior image, one assumes Eleanor Stringer (Labour, Wimbledon) is in full campaign mode when she describes her younger years as spent “looking for Wombles on the common”.\nBlazing a trail for the gift shop workers of the UK is Kate Smith (Lib Dem, Amber Valley), who mans the till at the National Tramway Museum in Matlock. Equally charming is the day job of Robert Reiss’ (Lib Dem, Penistone and Stocksbridge), who has spent the last eight years running a community café at Sheffield Cathedral.\nTodd Ferguson (Conservative, North Ayrshire and Arran) and Frank McNally (Labour, Coatbridge and Bellshill) may well regret they weren’t included in our sportsperson section; they enjoy a game of bowls at the Dalry and Wrangholm Hall clubs respectively.\nAnd Kathleen Robertson (Conservative, Moray) and Lucie Beattie (SNP, Caithness Sutherland and Easter Ross) will be able to compare their days as leading lights in their respective pipe bands of Forres and District and Ullapool and District.\nFor those new political faces looking for ideas on how to spend the long summer recess, on hand to provide travel advice could well be Liz Jarvis (Lib Dem, Eastleigh), who is the former long-standing Editor of Cruise International Magazine.\nThe high achievers\nFeeling ready to answer the call of history is a select group we are calling the “high achievers”, those who — having excelled and been decorated in their current industry — are now looking to find a fresh challenge in the Westminster bubble.\nTake Dr Alison Gardner (Labour, Stoke on Trent South), who is a senior scientific advisor at NICE and an expert in Artificial Intelligence and data ethics. She was only recently named in Computer Weekly’s list of the Top Most Influential Women in Tech.\nJosh Barbarinde (Lib Dem, Eastbourne) is an award-winning social entrepreneur who was decorated with an OBE from the Queen at the age of 26. It makes him one of the youngest recipients in history. That was before he became a fellow of the US State Department’s Young Transatlantic Innovation Leaders Initiative.\nEmanating from the corporate world we have Pauline Jorgensen (Conservative, Early and Woodley), the one-time Head of People Services and Business Efficiency at British Airways; and Charlotte Cane (Lib Dem, Ely and East Cambridgeshire), the former Finance Director of the Forestry Commission.\nFrom the world of medicine we have Zubir Ahmed (Labour, Glasgow South), a consultant surgeon who specialises in vascular and transplant surgery, and who only recently acquired an MBA; and Simon Opher (Labour, Stroud), a local GP who has been awarded an MBE for his pioneering of social prescribing.\nDr Jeevun Sandher (Labour, Loughborough) will be no stranger to decision-making at the very highest level — having once served as an economic advisor to the Ministry of Finance in Somaliland, co-writing the Somaliland National Development Plan no less.\nThe showpeople\nYou may recognise some of the next selection of aspirant MPs.\nOne Alex Clarkson (Conservative, Stevenage) is no stranger to the spotlight. His credits — beyond his time on Hertsmere Borough Council — extend to soaps Eastenders and Hollyoaks, as well as to the classic children’s series Postman Pat. In the latter, he played Ted Glen and Arthur Selby, a policeman. Might a position in the Home Office await?\nClarkson’s fellow thespian Ashley Gunstock (Green, Leyton and Wanstead) played the role of Robin Frank in The Bill from 1984-1989.\nFollowing in the footsteps of our current energy secretary Claire Coutinho — who once appeared as a contestant on the TV Cooking Show “The Taste” — Toni Guigliano (SNP, Falkirk) has reality TV pedigree as a former contestant on the Channel 4 show, Come Dine with Me. For those who missed the episode, Toni complained that he was depicted on the show as being “a food snob”.\nIf she can row past Cracknell, then taking things rather more seriously will be Pam Cox (Labour, Colchester), an Essex University academic and presenter of the BBC 2 series, Servants: The True History of Life Below Stairs.\nDoes MP4 — a rock band comprised of present and former parliamentarians — need a new member? Well, meet John Slinger (Labour, Rugby), who has written songs and played guitar in two separate rock bands. You may have heard his music being played on Radio 1 or seen the man himself when he supported Toploader and Muse at the Gloucester Guildhall Arts Centre. That said, an unlikely victor in Martin Dimery (Green, Glastonbury and Somerton) could also make a worthy addition to MP4’s line-up, having written an autobiographical account of his life on the road with a Beatles tribute act entitled “Being John Lennon”.\nAnd brace for barnstorming maiden speeches from Katie Lam (Conservative, Weald of Kent), who is the award-winning lyricist behind Broadway and West End shows; and Alison Hume (Labour, Scarborough), whose work on Summerhill won her the Royal Television Society’s 2008 writer of the year award.\nThe ‘Nepo babies’\nPolitical anoraks will also be pleased to hear that the Westminster tradition of keeping things in the family is also holding strong.\nFirst, there is Hamish Falconer (Labour, Lincoln), taking after his old man, Lord Falconer, the former long-standing New Labour cabinet minister and onetime flatmate of Tony Blair.\nUp next is Chris Murray (Labour, Edinburgh East and Musselburgh), son of former shadow Scottish secretary Margaret Curran.\nThen there’s Aphra Brandreth (Conservative, Chester South and Eddisbury), daughter of the former Chester MP and royal biographer, Gyles Brandreth.\nKeeping it around the dinner table you have Joe Dancy (Labour, Stockton North), partner of the current shadow health secretary Wes Streeting, and Jo White (Labour, Bassetlaw) partner of the former Bassetlaw MP, Lord Mann of Holbeck.\nFor those studying the psychodynamics of sibling rivalry, we have Greg Stafford (Conservative, Farnham and Bordon) — who could easily arrive at Westminster with his belongings on the day that his brother Alexander Stafford (the current MP for Rother Valley) leaves with his.\nArguably, the aspirant with the biggest boots to fill is Joani Reid (Labour, East Kilbride and Strathaven). She is the granddaughter of the Upper Clyde trade unionist, Jimmi Reid, a political figure whose 1972 “rat race speech” was once reprinted in full in the New York Times, with the newspaper declaring it as the best speech since president Lincoln’s Gettysburg Address. No pressure there then.\nOh, and while Roberto Weeden-Sanz (Conservative, Scarborough) may look like a body double for Canadian PM, Justin Trudeau (judge for yourself in this 2018 Sun article), be aware that there is absolutely no familial connection.\nAnd for the even more peculiar\nWill he enter parliament with a bang or prove a mere flash in the pan? Mark Wooding (Lib Dem, Central Devon) is looking to bring to public life his experience as the chief executive of the World Fireworks Championships.\nOr perhaps it will be slow and steady that wins the race: Stephan Aquarone (Lib Dem, Norfolk North) once produced a feature-length romantic comedy called Tortoise in Love.\nAnd looking to seize grab the reins of power are those with their own special talents. Glen Reynolds (SNP, West Aberdeenshire), is the owner of Open Minds Scottish Mobile Hypnotherapy. While Kristy Adams (Conservative, Mid Sussex) was recorded in 2010 as telling a church in Bedford how she healed a deaf man by placing her hands over his ears, according to the Daily Mirror.\nAnother interesting addition to our elected representatives could be Simon Hobson (Lib Dem, Torridge and Tavistock), who offers himself up on the back of his experience working in Columbia as the Chief Operating Officer for Kunna Cannabis company — a medicinal cannabis business.\nIf Westminster’s chess champion sisters (the Reeves, and the Eagles) fancy branching out into the world of board games, they could soon finally meet their match in Johnny Luk (Conservative, Milton Keynes). On top of winning an indoor world rowing silver medal (impressive, but not quite in the Cracknell class), the eight-year-old Luk was once a winner of the junior regional checkers championships in the Netherlands.\nSo what does it all mean?\nAnd if this has got your head spinning, decamp by asking what it is about politics that attracts such a range of eclectic characters to turn their hand to this pursuit.\nMoreover, with 200 or more new MPs being a very realistic possibility within the next year or so, consider this. If you picked a cross-section of 200 random British passport holders waiting at the departure gates of Manchester Airport or the Port of Dover, what are the chances that you might find even a handful with the backgrounds of those parliamentary candidates listed above?\nAs the ordinary elect the extraordinary, perhaps it is the very notion of a representative parliament that is having the last laugh.\nWith additional reporting from William Bracken.\nCORRECTION: A previous version of this article described Hamish Falconer as the prospective parliamentary candidate for Peterborough. This has since been changed to reflect the fact he is the prospective parliamentary candidate for Lincoln.\nJosh Self is Editor of Politics.co.uk, follow him on Twitter here.\nPolitics.co.uk is the UK’s leading digital-only political website, providing comprehensive coverage of UK politics. Subscribe to our daily newsletter here.",
  "word_count": 2634,
  "scraped_at": "2026-02-14T13:10:32.850795"
}