{
  "article_id": "0501b1f68d20",
  "url": "https://www.chicagotribune.com/2024/02/27/daywatch-kidney-transplants-after-age-70/",
  "title": "Daywatch : Kidney transplants after age 70",
  "date": "20240227T150000Z",
  "domain": "chicagotribune.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Good morning, Chicago.\nJon and Carol McCabe were in the Galápagos Islands with their family for the trip of a lifetime. The couple from Clarendon Hills shared 30 meals with their children and grandchildren and admired diverse wildlife.\nBut Carol’s health rapidly declined during the trip.\nCarol’s nephrologist broke the news a few months later that her kidney function had deteriorated to 14%, meaning her chronic kidney disease progressed to stage 5, described as “kidney failure.”\nHer husband knew he wanted to donate one of his kidneys, a hope that became a reality through Loyola Medicine’s Living Kidney Donor Program. The transplant gave the couple their “life back,” but was at times a complicated and emotionally fraught process.\nHere are the top stories you need to know to start your day.\nSubscribe to more newsletters | Puzzles & Games | Today’s eNewspaper edition\nJury empaneled in trial for man accused of killing CPD Officer Ella French\nThe jurors will hear opening statements this morning in a courtroom at the Leighton Criminal Courts Building likely to be filled with police officers, family members and other supporters.\nNorthwestern settles 2022 class action lawsuit alleging it engaged in financial aid scheme\nNorthwestern University has settled in a 2022 class-action lawsuit alleging the school and 17 other universities violated antitrust laws and illegally collaborated in a price-fixing scheme to limit students’ financial aid.\nThe university agreed to pay $43.5 million to settle the claim that it drove up the cost of attendance for students on financial aid.\nBring Chicago Home: Early voting continues, city gears up for appeal; county campaigns heat up\n“People should know in Chicago that the question is still on the ballot,” Johnson told reporters Monday. Attorneys for the administration asked the judge to press pause on enforcement of the ruling and also filed notice they would be appealing.\nJohnson did not answer when asked if his administration had erred in the drafting of the question or whether he would try to get the referendum question on November ballots if appeals failed. Friday’s decision from Circuit Court Judge Kathleen Burke found in favor of real estate interests who sued over the question’s wording and how city money would be spent.\nPritzker pushes maternal health funding at planned South Side birthing center\nGov. J.B. Pritzker’s $52.7 billion budget calls for $23 million to advance “birth equity” in a state where Black women are three times as likely to die from pregnancy-related medical conditions as white women, according to an Illinois Department of Public Health study covering the years 2018 to 2020.\nChase renovating its longtime Loop office tower\nLocated at 10 S. Dearborn St., the distinctive 55-year-old, steel-and-concrete tower — the tallest within the Loop’s elevated CTA train tracks — will undergo a top-to-bottom reimagining of office space, amenities and infrastructure.\nImprovements include a new lobby-level fitness center, an updated food hall, a refreshed outdoor plaza, enhanced conference centers at the top floors and new elevators to get there faster.\nChicago Red Stars join the teams seeking public funding for a stadium: ‘Women’s sports need to have a seat at the table’\nThe Red Stars are in the fact-finding phase of selecting a potential stadium site within the city, sources told the Tribune, and have not determined the level of funding that would be needed. Ideally, the club would find a location in Chicago that fits both a stadium and training facility.\nArlington Heights mayor denies claims of pressuring school districts in ongoing Chicago Bears land dispute\nArlington Heights Mayor Tom Hayes denied claims that he and other Village Board members are pressuring area school districts to lower their property value estimates of the former Arlington International Racecourse – now owned by the Chicago Bears football team – hoping to keep the village in the running as a place for a new stadium.\nColumn: 6 takeaways from an atypically busy week in February, including Scott Boras taking an ‘L’ and the Nike uniform fiasco\nFebruary is typically one of the least interesting months on the sports calendar, at least in the lull between the Super Bowl and March Madness.\nBut last week was full of intriguing storylines, writes Paul Sullivan.\nMy time as guest editor of Poetry Magazine\nIn tackling this, Rick Kogan was reminded not only what a joy there is in finding a new voice or hearing one long forgotten, but also what a remarkable thing Poetry Magazine has long been.\nIt was founded in 1912 — what a wild town this was then — by Harriet Monroe, who was an art critic for the Tribune. She famously described the magazine’s open-door policy. She said she wanted “to print the best English verse which is being written today, regardless of where, by whom, or under what theory of art it is written.”\nColumn: Rhymefest explores the dynamics between Black men and women in ‘James and Nikki: A Conversation’\nHistory is not just for school, writes Britt Julious. It is also meant to be used and referenced in our everyday lives. Few artists understand this quite like Che Armond Smith, aka Rhymefest. The beloved Chicago rapper, songwriter, producer and philanthropist may have made a name for himself through his Grammy and Academy Award-winning work on songs like “Jesus Walks” and “Glory,” but on his latest project, “James & Nikki: A Conversation,” he explores the racial, social and gender-based dynamics of Black men and women.\nPookie Crack Cakes in Bronzeville among 8 notable openings in Chicago and the suburbs\nButter pecan praline, caramel made from scratch and Pineapple Paradise are just a few of the flavors that have people lining up at Pookie Crack Cakes in Chicago.\nThey sell out of that cake, which Dedra Simmons, CEO and owner of the bakery on the South Side, describes as a mini cake loaf, every day they’re open.",
  "word_count": 974,
  "scraped_at": "2026-02-14T14:10:53.854495"
}