{
  "article_id": "051a57444023",
  "url": "https://news.yahoo.com/fifa-starts-proceedings-against-spains-154215475.html",
  "title": "FIFA starts proceedings against Spain Luis Rubiales for World Cup kiss",
  "date": "20230824T163000Z",
  "domain": "news.yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FIFA starts proceedings against Spain's Luis Rubiales for World Cup kiss\nAug. 24 (UPI) -- FIFA opened disciplinary proceedings against Spanish Football Association president Luis Rubiales for kissing midfielder Jenni Hermoso at the Women's World Cup, the world soccer governing body said Thursday.\nRubiales kissed the midfielder during the trophy presentation Sunday at Stadium Australia in Sydney. He was caught on camera as he pulled her head forward with both hands and kissed her on the lips.\n\"The FIFA disciplinary committee will only provide further information on these disciplinary proceedings once it has issued a final decision on the matter,\" FIFA said in a news release.\nFIFA said that Rubiales' actions \"may constitute violations\" of sections of its disciplinary code, which include \"behaving in a way that brings the sport of football and/or FIFA into disrepute.\"\n\"FIFA reiterates its unwavering commitment to respecting the integrity of all individuals and strongly condemns any behavior to the contrary,\" FIFA said.\nAfter Sunday's 1-0 title-clinching win over England, Hermoso initially said on Instagram Live and in interviews that she was not expecting the kiss and that she didn't like it.\nThe Spanish Football Association later released a statement and cited Hermosa as saying that the kiss was \"totally spontaneous\" and \"mutual.\"\nHermoso then released another statement through FUTPRO -- a women's soccer union -- saying that the union and her agency were \"defending [her] interests\" and discussing the matter with other involved parties.\nRubiales apologized Tuesday, but Spanish Prime Minister Pedro Sanchez told reporters the same day that the apology was \"not enough.\" Rubiales also was seen grabbing himself and throwing another player over his shoulder during the trophy celebration.\nThe Spanish Players Association, Spain's Liga F soccer league and FIFPRO, a world players union, also criticized Rubiales and called for \"immediate action to address to conduct.\" He faced additional criticism from soccer fans, and players, including United States Women's National Team star Megan Rapinoe.\n\"There was another picture that signals such a deep level of misogyny and sexism in that federation and in that man [Rubiales] at the final whistle, just grabbing his crotch,\" Rapinoe told The Atlantic.\n\"What kind of upside-down world are we in? On the biggest stage, where you should be celebrating, Jenni has to be physically assaulted by this guy.\"\nHermoso, 33, scored three goals and totaled two assists for Spain at the 2023 Women's World Cup. The Pachuca star has made more than 100 international appearances for Spain since 2012.\nThe Rubiales-Hermoso incident was the second one between a representative of a national team and player investigated by FIFA related to the 2023 Women's World Cup.\nFIFA announced earlier this month that it was investigating the Zambian team after a report surfaced claiming that coach Bruce Mwape rubbed a player's chest two days before the first match.\nFIFA did not immediately provide an update for that investigation when asked for comment Thursday morning.",
  "word_count": 486,
  "scraped_at": "2026-02-14T12:05:05.800311"
}