{
  "article_id": "052348756ddc",
  "url": "https://punchng.com/why-i-love-neymar-more-than-messi-ronaldo-actress-eguavoen/",
  "title": "Why I love Neymar more than Messi , Ronaldo – Actress Eguavoen",
  "date": "20230325T030000Z",
  "domain": "punchng.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Nollywood actress Angela Eguavoen, in this interview with PETER AKINBO, talks about her sports life, love for Neymar, ‘relationship’ with 1994 AFCON winner and ex-Eagles coach Austin Eguavoen, and more\nDid any sport catch your fancy while you were growing up?\nOh yes, that was back then, when I was in Paradise Schools in Benin City. At the inter-house sports, I used to participate in a lot of sporting activities. I loved swimming especially, but I also ran races and the sack races were fun to take part in because you would try your hardest not to fall, but the sack will do its best to bring you down. I did not win many medals for the school, but I really liked to participate in a lot of extracurricular activities.\nWhy do you love swimming?\nI was best at swimming. I just love to swim because it is a sport that deals with every part of the body, so, I just gravitated towards swimming more. Now, I still participate in swimming more than any other sport.\nDid your parents encourage swimming back then or were they more interested in your academic pursuit?\nMy parents are the kind of people that never discourage anyone from doing anything. They don’t tell you to stop or not pursue a particular interest, so, I always had the support from them and even when I later started participating in cultural activities, which led to my love for the theatre and acting.\nNowadays, do you still participate in any sporting activities?\nYes, I do a lot of walks, oftentimes throughout my estate and I use my jump ropes a lot in my house. I also encourage everyone around me to take a walk because it may seem little, but it does a lot for your body.\nWhat sport do you watch now for entertainment?\nIt’s only football and that is because of my man, he likes football too much and he is now influencing me also to watch.\nDo you have a favourite footballer?\nI like Lionel Messi and Cristiano Ronaldo but I love Neymar, he is my favourite.\nWhy is Neymar your favourite?\nHe is a very good footballer and he is good-looking and highly talented. He is loading with a lot of good attributes.\nDo you follow the Super Eagles?\nYes, I do and Victor Osimhen is my favourite player in the team. He is doing very well in Europe but I am not sure if only Osimhen will be able to carry the Eagles all the way. Hopefully, he is the missing link we need to do better. I am very proud of all that he is doing in Europe. Anyone putting Nigeria on the map, wherever you are, footballer, actor or a musician, as long you keep putting Nigeria on the map, I am always proud of whoever that person is because when you are winning, we are all winning.\nHow did you feel when the Eagles couldn’t qualify for the 2022 World Cup in Qatar?\nI was heartbroken, I was embarrassed. At this point, anything that has to do with Nigeria, I don’t put my hopes too high, so, I don’t end up getting disappointed. As they didn’t qualify, I didn’t take it to heart because it is Nigeria. I hope we can qualify for the next one now though, because I am impressed with the amount of talenyt in that team now and I believe Nigerians can succeed at whatever we put our hearts to do. See the way the music industry is booming now all around the world. It will be impressive if the football part of Nigeria can get all over the world. I don’t think it is impossible for us to win the World Cup.\nSo what country did you support at the World Cup since Nigeria was absent?\nMorocco. I really wanted them to win because they are Africans and also because they played very good football at the tournament.\nDo you think there is anything that can be done to make sports in Nigeria better organised?\nFirst of all, with the type of government we have in Nigeria, that doesn’t focus on proper training, they need to first deal with that aspect. The only thing Nigeria has gotten right when it comes to our football is the jerseys, the designs are always on point and so beautiful. So, they should make the training environment for the athletes beautiful too, and pay them very well and let them have good health insurance. I feel with these things, it is going to be way better and the players will actually be able to play really good football, both the male and female teams.\nHow far do you think the Super Falcons can go at the upcoming 2023 Women’s World Cup?\nI am very very proud of them for qualifying and I will definitely watch them at the tournament. I feel they should be able to do well. If the environment is conducive for them, they should be able to do really well.\nSo who is your favourite Nigerian footballer of all time?\nMikel Obi is my favourite footballer of all time and he even influenced my support for Chelsea. It is a Nigerian thing to always support our own.\nYour last name, Eguavoen, is same as that of former Super Eagles captain and coach Austin Eguavoen. Are you both related?\nI am not related to him, and I have been asked many times, so, it is now a normal thing for me. We are from the same state, so, there is a possibility of a relation but none that I know of. I wasn’t really following football when he played, so, I don’t know much of his playing days but we talk on socials, we follow each other on social media but have never met.\nWill you invest your children who intend pursuing a sports career?\nI will one hundred per cent because there is so much money in sports right now, and I love it. I love how it exposes you to the world and it feels like once you are there, you can be sorted. I just love everything about sports, and for the fact that there is so much money in it and it is a convenient thing to do. Of course, if any of my children have interest in it and they love it, I would support them.",
  "word_count": 1075,
  "scraped_at": "2026-02-14T12:26:22.103005"
}