{
  "article_id": "052fe8fae8b5",
  "url": "https://www.timeout.com/london/news/7-brilliant-spots-to-watch-the-womens-euro-2025-070125",
  "title": "The 10 Best Places to Watch The Women Euro 2025 in London",
  "date": "20250714T184500Z",
  "domain": "timeout.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "[title]\nIf you ask us, supporting the Lionesses should come with some sort of medical warning. Our hearts our still racing after Tuesday night’s agonising semi-final against Italy, when teenage sensation Michelle Agyemang once again rescued England from the jaws of defeat with an equaliser six minutes into stoppage time, before Chloe Kelly smashed home the rebound of her saved penalty late in extra time to take Sarina Wiegman’s comeback queens to another European final.\nWhen is the England vs Spain Euro 2025 final?\nThe reigning champions will get a chance to retain the historic title they clinched at Wembley three summers ago this Sunday July 27 at 5pm (BST), as they face Spain in the final in Basel in a repeat of the 2023 Women’s World Cup Final and a mirror of last summer’s Men’s Euros Final.\nEngland have faced Spain three times in the Women’s Euros, with those games coming in the three most recent tournaments. Spain won 3-2 in a group stage meeting in 2013, while the Lionesses won 2-0 in the 2017 group stages and came from behind in the quarter finals in 2022 to win 2-1 in extra time.\nWho is the favourite to win the Women’s Euros?\nThe bookies have given Spain marginally better odds than England, but in reality the match-up looks too close to call.\nSpain were the clear favourite heading in the Euros, put in some thoroughly dominant displays during the group stage of the tournament, and count current Ballon d’Or winner Aitana Bonmatí and two-time winner Alèxia Putellas in their starting line-up.\nOn the other hand, reigning champions England have five 2025 Champions League winners in their squad, and have had a day longer to prepare, while manager Sarina Wiegman is the first men’s or women’s manager in history to reach five major international finals in a row. Plus, if there’s one thing that’s certain about our Lionesses, it’s that they never know they’re beaten.\nIs it coming home again? Make a beeline for one of London’s best Women’s Euros Final screening parties this Sunday to find out. It’s set to be an absolute nail-biter!\nThe best places in London to England vs Spain in the 2025 Women’s Euros Final\nBaller FC x Signature Brew\nFan collective Baller FC were early to the party when it came to championing women’s footie, and have been hosting regular screening events for major club and international fixtures since the last Euros. After hosting screenings at Signature Brew’s Haggerston taproom for England fixtures throughout the tournament, the team is scaling up its festivities for the final, returning to the brewery’s Blackhorse Road base for Slaying the Euros, an entire day of activities celebrating women’s football and it’s out and proud fan culture. Ticket holders can expect pre-match karaoke hosted by footie meme page Studs, haircuts by queer barber Rooibos, an arm wrestling contest hosted by queer club night U-Haul Dyke Rescue, live music from all-female ten-piece brass band She's Got Brass, queer line dancing, and post-match DJs until 11pm. This is one of the hot tickets, so get yourself on the waitlist ASAP.\nSignature Brew Taproom, E17 5QJ. £19 (waitlist only).\nThe Old Nun’s Head\nSouth Londoners, this one’s for you! Female-fronted local radio platform foundation.fm has teamed up with Urban Outfitters brand iets frans for its Women’s Euros screenings at the Old Nun’s Head. This wonderfully offbeat, queer-friendly pub has been a super fun place to cheer on the Lionesses, with some cracking DJs like Heléna Star and I Jordan playing at post-match parties. It’s walk-ins only for the Final, so be sure to show up nice and early to secure a table, and fuel up ahead of kick-off with one of the pub’s famously ‘fit’ Sunday roasts.\nOld Nun’s Head, SE15 3QQ. Free (walk-ins only).\nTOCA Social\nTOCA Social will be welcoming Lionesses fans young and old into both of its London locations (the O2 and Westfield White City) as the girls set out to defend their title, with plenty to keep fans entertained during the pre-match buildup, from Sky Sports presenter appearances to special effects, live music and DJs. Do you turn to sweet treats to relieve your pre-game stress? Order a Leah Williamson Sundae – a chocolate and vanilla ice cream concoction based on what is apparently the captain’s dessert of choice.\nTOCA Social, SE10 0DX and W12 7GF. From £6 (ticket includes first drink).\nThe Prince\nThe Prince is packed with screens, so wherever you’re stationed indoors or outdoors at the enormous west London pub, you’ll be able to watch every single tackle, corner and goal of the Women’s Euro in HD. The sports-mad boozer is also offering some great drinks deals on its match-day drinks menu, including Budweiser pitchers so you don’t miss a crucial moment while fighting your way back to the bar.\nThe Prince, SW6 1TT. Free (booking advised).\nDalston Superstore\nLooking for somewhere to watch the big game among the gays and theys? Head down to east London’s most legendary queer venue, which will be showing the match across two screens on Sunday. It’s free entry, and you don’t even have to book, either, just show up in good time ahead of the 5pm kick off so you’ve got time to grab yourself a drink and soak up the pre-match atmosphere. It’s coming homo!\n117 Kingsland High Street, E8 2PB. Free.\nFive Points Taproom\nFive Points not only makes great beer, it also provides a great place to drink it. The Hackney brewery’s Mare Street taproom comes into its own during the summer months, when you can sink pints of JUPA in its sunny courtyard, feast on beer braised pork tacos and smoked half chickens from resident BBQ joint From The Ashes, and catch every minute of the match on its outdoor screen (there’s also one inside in case the Great British Summer does us dirty).\n61 Mare Street, E8 4RG. Free (booking advised).\nJust Eat x She’s a Baller Ballers’ Banquet\nDo you always treat yourself to a takeaway when there’s a big match on? This screening party is for you. Women’s Euros official sponsor Just Eat has teamed up with women’s footie platform She’s A Baller to host a screening party for the Final featuring free game day munchies from a curated line-up of Just Eat faves, footie-themed cocktails, panel talks, a temporary tattoo bar and games where you can win some delicious prizes. Under 18s are allowed at this one too, provided they’re with a parent or guardian. Just nab a free ticket for entry. Did somebody say...Just Eat?\nThe Little Violet Door, W1B 5PH. Free (booking required).\nBig Penny Social\nThe UK’s biggest beer hall is one of the go-to venues for major international fixtures, which are show on a ginormous 16x9ft one in its main space. Open from midday, it’s promising an electric atmosphere for the final, featuring pre-match entertainment courtesy of all-female brass band Sassy Brass. Tickets don’t guarantee seating, though, so get down nice and early to grab a table.\n1 Priestley Way, E17 6AL; £7.04 (waitlist only).\nThe 411\nAngel sports bar The 411 is just down the road from the Emirates, which happens to boast the highest number of women’s football game attendees in the Women’s Super League over the last few seasons, so there’s good reason to expect a lively atmosphere from the crowds here. Bookings are available for the final, but they’ll also be saving some space for walk-ins on the day.\nThe 411, EC1V 4AB. Free (booking advised).\n40FT Brewery\nSituated right next to fellow foodie hotspots Acme Fire Cult and Dusty Knuckle, 40FT’s Dalston taproom is always a vibey hangout in the summer months. The east London brewery has gone all out for the Euros, screening all the England games and even rustling up a limited-edition beer to celebrate the Lionesses. Head down to the final to sample Stargirl, a 3.4% XPA ‘packed with bright citrus, soft tropicals and a clean finish’. Our girls know a thing or two about clean finishes.\nBootyard, Abbot Street, E8 3DP. Free (booking advised).\nPop Brixton\nCatching the game doesn’t have to mean missing out on precious Vitamin D: Pop Brixton’s light and bright Greenhouse space will keep things summery as you keep up with the action. Grab a ticket to guarantee entry, nab a bench near the big screen, and soak up some women's football goodness.\nPop Brixton, SW9 8PQ. £5.\nBetween the Bridges\nCheer on the Lionesses from an atmospheric spot by the riverside at South Bank pop-up Between the Bridges, which has partnered with Pepsi for its Women’s Euros screenings this summer. Fans will be able to catch all the action in minute detail on three massive video walls, while enjoying noodles, burgers, sarnies and more from seven of London’s best street food vendors at Time Out Eat Street. Be sure to reserve a spot for guaranteed entry.\nThe Queen's Walk, SE1 8XX. £6.18 for guaranteed entry.\nFlat Iron Square\nThere’s no chance of you missing a crucial moment in the match at Flat Iron Square, where the game will be shown on no fewer than 18 different screens, including a 16ft wide jumbotron in the Taproom. The venue also features 16 different beers on tap, plus four street food vendors, and will be amping up the pre-match atmosphere with live DJs. Walk-ins will be allowed until the venue reaches capacity, but we’d advise booking to avoid disappointment.\n45 Southwark Street, SE1 9HP. Free (booking advised).\nEE Squad Social at Crystal Palace Park\nHoping to watch the match with your footie-mad teenager(s)? EE’s south London fan space is designed especially for teenage girls. The family-focused (read: booze-free) screening is staged as part of EE’s ‘Everyone Needs a Squad’ campaign for the tournament that aims to encourage young girls across the UK to experience the positive impact of being a part of a football network, and will feature plenty of entertainment alongside the game itself, including live music, creative workshops, prize draws and appearances from a few familiar faces.\nCrystal Palace Park, SE20 8DT. Free (booking required).\nBoxpark\nWe’ve all seen those videos of raucous England fans throwing their pints in the air during Boxpark Shoreditch’s summer football screenings. Willing to risk getting your brand new England kit absolutely soaked in beer? All four of Boxpark’s shipping container venues in Shoreditch, Croydon, Wembley and Camden are showing the final, but this is always one of the hottest tickets for big games, so book now to avoid disappointment.\nVarious Boxpark venues. From £11.52.\nThe Volley\nThe Volley boldly calls itself ‘the best sports pub in London’, and to be fair to it, we think it has a solid claim thanks to a great selection of beers on tap and some banging south Indian street food on offer courtesy of resident kitchen Calm Indian Cow. The Old Street is doing £5 negronis and spritzes during the final, and is also running tap takeovers with a roster of great female and LGBTQ+-owned UK breweries. That’s feminism!\n211 Old Street, EC1V 9NR. Free (booking strongly advised).\nVERSUS x Pinterest: The Locker Room\nFootie and fashion platform VERSUS has long been a champion of the women’s game, so it’s great to see that it’s partnered with Pinterest for a watch party at Peckham Arches celebrating ‘the intersection of women’s football, fashion and creativity. Fans can expect free food and drink, a pre-match panel discussion featuring some of the tastemakers shaping football culture today and an immersive installation showcasing the new waves of women’s football fashion, plus DJ sets before and after the game. Tickets will no doubt sell out in minutes, so be sure to nab yours quick!\nDovedale Business Centre, SE15 4QN. Free (booking required).\nPepsi x Corner Corner Fan Zone\nCanada Water street food hub Corner Corner has partnered with official tournament sponsor Pepsi to host a fan zone featuring great food, a long cocktail last and loads of entertainment alongside matches, including interactive games, live music and giveaway. The 1,698 sqm open-plan space can fit plenty of fans, so it’s a solid choice if you haven’t managed to sort a booking elsewhere for the big game.\nMaritime Street, SE16 7LL. Free.\nHackney council has unveiled a bold new nightlife strategy\nGet the latest and greatest from the Big Smoke – from news and reviews to events and trends. Just follow our Time Out London WhatsApp channel.\nStay in the loop: sign up for our free Time Out London newsletter for the best of the city, straight to your inbox.",
  "word_count": 2093,
  "scraped_at": "2026-02-14T12:44:01.694085"
}