{
  "article_id": "059eecdb5d1d",
  "url": "https://www.mirror.co.uk/news/health/jill-scott-reveals-how-tackles-36078818",
  "title": "Jill Scott reveals how she tackles key issue women face when playing sports",
  "date": "20251016T180000Z",
  "domain": "mirror.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Jill Scott reveals how she tackles key issue women face when playing sports\nAlmost half of women are keen to take up a sport of some kind but are often put off for a range of reasons\nA recent survey revealed that 64% of women have taken up a new sport in the past year, including rugby, football and tennis, inspired by the success of the Lionesses and English Roses. However, various obstacles still prevent many from taking up sporting activities.\nThe poll, which surveyed 2,000 adults, found that 46% of women are eager to engage in physical activity but feel something is holding them back. Common barriers include the cost of participation, lack of access to suitable spaces, and equipment designed for men. Other hurdles include confidence issues, low energy levels, and not having a companion to join them.\nThe study also discovered that 38% are trapped in a vicious cycle of not feeling fit enough to join a sports team - but aren't getting fitter because they're not participating.\nFurthermore, those surveyed are more likely to experience symptoms related to dehydration such as dizziness or a lack of motivation.\nThe research was commissioned by Liquid I. V., which found that although 75% acknowledged that staying hydrated helps improve their performance, a lack of knowledge often impacts their focus and drive.\nFormer England midfielder Jill Scott, who has teamed up with the powdered hydration brand for the brand-new Hot Seat Series, said: \"I know first-hand how important it is to stay motivated and hydrated, and having the right support can make all the difference.\"\nShe added: \"If you're playing in a big group match or going for a quick run, when you're working up a sweat, you're not just losing water – you're losing essential electrolytes that keep your muscles and mind performing at their best.\"\nThe study revealed that women's typical workout sessions are shorter than men's, with 30% of men exercising for over an hour, compared to only 21% of women.\nJessica Ennis was named by women as the most inspirational figure to encourage people to try new sports (19%), while men were more likely to choose footballers Harry Kane or Marcus Rashford.\nJill Scott added: \"Replacing both water and electrolytes, helped me to stay sharp, recover faster, and give my all every time I stepped on the pitch.\n\"Even now, staying hydrated is something I make a priority every day.\"",
  "word_count": 404,
  "scraped_at": "2026-02-14T13:06:54.081948"
}