{
  "article_id": "05cd731c6c28",
  "url": "https://www.france24.com/en/live-news/20230320-chelsea-and-arsenal-looking-to-end-english-drought-in-women-s-champions-league",
  "title": "Chelsea and Arsenal looking to end English drought in Women Champions League",
  "date": "20230320T204500Z",
  "domain": "france24.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Chelsea and Arsenal looking to end English drought in Women's Champions League\nParis (AFP) – The Women's Champions League knockout stage gets underway this week with Chelsea and Arsenal both hoping to become the first English team to lift the trophy since the Gunners in 2007.\nIssued on:\nBack then, when Arsenal beat Umea of Sweden in the final, the tournament was still known as the UEFA Women's Cup. It was only in 2009 that it was rebranded as the Champions League, with a group stage being introduced last season.\nChelsea and Arsenal showcased the increasing strength of the English Women's Super League as they romped to top spot in their respective groups this season, with the Gunners notably thumping reigning European champions Lyon 5-1 away in France.\nArsenal, who earlier this month beat Chelsea 3-1 to win the English League Cup, this week face Bayern Munich and are hoping to avoid a second straight quarter-final exit at the hands of German opponents after going out to Wolfsburg last season.\nBayern are currently two points behind Wolfsburg at the top of the Frauen Bundesliga and the two legs of their tie against Arsenal fall either side of a crunch meeting with their rivals for the domestic title.\nChelsea, meanwhile, head to France to play a Lyon side who have won the Champions League in six of the last seven seasons, and a record eight times overall.\nAnd yet Chelsea, who were beaten finalists in 2021, will not fear facing Sonia Bompastor's team, for whom Norway star Ada Hegerberg is close to a comeback from a long injury absence.\nAfter all, Emma Hayes's team beat Paris Saint-Germain home and away in the group stage, keeping a clean sheet in both games.\nThe London side are currently top of the WSL, two points clear of Manchester United and Manchester City with a game in hand on each while Arsenal are five points behind the leaders in fourth.\nIn Australia's Sam Kerr they have one of the most dangerous attacking players in the world, but Lyon are hoping to be a different proposition to the team outclassed by Arsenal in October.\nA different Lyon?\n\"We had a lot of injuries around that time. It is not an excuse, we still have to beat the good teams, but I think we were struggling a bit in the beginning of the season,\" Lyon's Danish international forward Signe Bruun told AFP.\n\"We qualified and that was the most important and now we are starting from scratch.\"\nBruun, who had a spell at Manchester United last season, believes the rising threat of English teams in Europe is no bad thing.\n\"It is very healthy for women's football that there are so many teams that can compete for the Champions League. I think that is also an important part of the improvement for the women's game,\" she said.\n\"I think it will be more and more rare that the same team wins twice in a row.\"\nBarcelona nearly retained the title last season, returning to the final only to lose to Lyon in Turin.\nDespite the ongoing absence of injured Ballon d'Or winner Alexia Putellas, they continue to crush all opponents in Spain and cruised through to the quarter-finals, where they will face Roma.\n\"Barcelona's numbers are crazy, incredible,\" said Roma coach Alessandro Spugna. \"I have seen a lot of Barcelona and the more I watch them the fewer weaknesses I see.\"\nWolfsburg, who have been to five finals in the last decade and won two, saw their hopes of advancing against PSG take a hit after Germany midfield star Lena Oberdorf was ruled out of Wednesday's first leg with a knee sprain.\nFixtures (kick-offs GMT)\nTuesday\nIn Munich, Germany (1745)\nBayern Munich (GER) v Arsenal (ENG)\nIn Rome (2000)\nRoma (ITA) v Barcelona (ESP)\nWednesday\nIn Lyon, France (1745)\nLyon (FRA) v Chelsea (ENG)\nIn Paris (2000)\nParis Saint-Germain (FRA) v Wolfsburg (GER)\n© 2023 AFP",
  "word_count": 659,
  "scraped_at": "2026-02-14T12:21:18.952873"
}