{
  "article_id": "05f382ce29cc",
  "url": "https://www.aol.com/spain-vs-switzerland-live-women-035403655.html",
  "title": "Spain vs Switzerland LIVE : Women World Cup result and final score as Aitana Bonmati stars",
  "date": "20230805T084500Z",
  "domain": "aol.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Spain vs Switzerland LIVE: Women’s World Cup result and final score as Aitana Bonmati stars\nAitana Bonmati scored a stunning brace as Spain reached the Women’s World Cup quarter-finals for the first time with a commanding 5-1 win over Switzerland.\nWith Spain under pressure to respond to their 4-0 defeat to Japan in the group stages, Bonmati scored the opening goal within six minutes after a lovely turn and finish in the box, only for Switzerland to receive a gift of an equaliser as Laia Codina scored an own goal from 40 yards.\nBut Spain’s response was emphatic, with Alba Redondo restoring Spain’s lead within five minutes, before Bonmati scored her second thanks to another sharp turn and finish in the box. With Spain cruising, Codina made amends for her earlier error with Spain’s fourth, scrambled in from a corner.\nSwitzerland had kept three clean sheets in the group stage, but Jenni Hermoso made it five in the second half with a curling finish. Spain did not call upon Alexia Putellas, who was dropped from the starting line-up, until the 77th minute but it did not take away from an improved performance after their dismal display against Japan.\nSpain will now play either the Netherlands or South Africa in the quarter-finals, while the action continues with Japan vs Norway in the last-16.\nWomen’s World Cup LIVE: Spain vs Switzerland\nFT! Spain thrash Switzerland 5-1 to reach the World Cup quarter-finals\n68’ GOAL! Hermoso makes it five as Spain cruise into next round (SWI 1-5 ESP)\n44’ GOAL! Switzerland fall apart as Codina makes ammends (SWI 1-4 ESP)\n36’ GOAL! Bonmati scores her second with another brilliant turn (SWI 1 -3 ESP)\n17’ GOAL! Redondo arrives at back post as Spain retake the lead (SWI 1-2 ESP)\n12’ OWN GOAL! Switzerland level after bizarre Spain backpass (SWI 1-1 ESP)\n5' GOAL! Bonmati turns and fires Spain into early lead (SWI 0-1 ESP)\nSpain make five changes as Alexia Putellas drops to bench\nSwitzerland 1 - 5 Spain\nFULL TIME! Women’s World Cup LIVE: Spain 5-1 Switzerland\n07:59 , Jamie Braidwood\nQuality from Spain, as they respond to their 4-0 defeat to Japan in style to reach the quarter-finals of the World Cup for the first time. Switzerland were disappointing and only had one shot throughout the match, but Spain’s pressing and intensity was sharp from the start as Aitana Bonmati led a brilliant performance from midfield.\nThey now overtake Japan to become the top scorers at the World Cup and Jorge Vilda’s side will be full of confidence again ahead of a quarter-final against either Netherlands or South Africa.\nWomen’s World Cup LIVE: Spain 5-1 Switzerland\n07:53 , Jamie Braidwood\n90mins; We’re into four minutes of added time. Switzerland are going out with a whimper as things stand.\nThe attendance at Eden Park tonight has been was 43,217, which is a record for a football match in New Zealand.\nThat record has already been broken several times this tournament.\nWomen’s World Cup LIVE: Spain 5-1 Switzerland\n07:48 , Jamie Braidwood\n86 mins: So what does this eye-catching Spain win mean for their chances of winning the World Cup? On this basis, you would fancy them to beat either the Netherlands or South Africa in the quarter-finals. That could lead to a rematch with Japan, or whoever comes through that side of the bracket. And how good must Japan be, to beat Spain 4-0?!\nSo many questions.\nWomen’s World Cup LIVE: Spain 5-1 Switzerland\n07:46 , Jamie Braidwood\n84 mins: Another change for Spain with Salma Paralluelo the next to be withdrawn. The Barcelona winger has looked impressive once again.\nWomen’s World Cup LIVE: Spain 5-1 Switzerland\n07:41 , Jamie Braidwood\n77 mins: Alexia Putellas is now on for Spain and the two-time Ballon d’Or winner will get the final 20 minutes of this last-16 tie. Does she come back into the starting line-up for the quarter-final? It was a huge call from Vilda to drop her today, but Bonmati’s performance has ensured Spain haven’t really needed her.\nWomen’s World Cup LIVE: Spain 5-1 Switzerland\n07:38 , Jamie Braidwood\nQuality from Spain’s record goalscorer, who joins Bonmati and Redondo on three goals at this World Cup.\nIt's safe to say Spain are heading into the #FIFAWWC quarter finals #SUI #ESP pic.twitter.com/QnYL7HDpEd\n— BBC Sport (@BBCSport) August 5, 2023\nGOAL! Women’s World Cup LIVE: Spain 5-1 Switzerland\n07:31 , Jamie Braidwood\nFIVE for Spain as Hermoso gets in on the act!\nIt’s poor from Switzerland as they give the ball away trying to play out from the back, but Spain were so quick once they won it back. It’s rolled through to Hermoso, who opens up her body and steers the finish into the far corner.\nWomen’s World Cup LIVE: Spain 4-1 Switzerland\n07:24 , Jamie Braidwood\n61 mins: Redondo cuts onto her left foot but shoots over from the edge of the box. After scoring in the first half the winger is up to three goals for the tournament, which is enough for a tie of second place. Bonmati is now also up to three goals overall.\nWomen’s World Cup LIVE: Spain 4-1 Switzerland\n07:18 , Jamie Braidwood\n56 mins: Ah, maybe not! Terchoun, the Swiss sub, plays a one-two with Bachmann and sets up the volley at goal. It’s straight at Coll, but that was a chance in what was Switzerland’s first shot of the whole match.\nWomen’s World Cup LIVE: Spain 4-1 Switzerland\n07:17 , Jamie Braidwood\n55 mins: In the group stage, many of the games that were one-sided in the first half were non-events in the second. Let’s hope that’s not the case, but Switzerland look well beaten and it’s been all Spain since the break.\nWomen’s World Cup LIVE: Spain 4-1 Switzerland\n07:14 , Jamie Braidwood\n50 mins: It’s obviously a long way back for Switzerland now - Paralluelo goes close with a left-foot shot that is bent towards the far post. Thalmann is equal to it.\nWomen’s World Cup LIVE: Spain 4-1 Switzerland\n07:09 , Jamie Braidwood\nBack underway in Auckland! Switzerland make three changes at half time: Sandrine Mauron, Meriame Terchoun and Viola Calligaris and on for Sow, Reuteler and Aigbogun.\nHALF TIME! Women’s World Cup LIVE: Japan vs Norway\n07:03 , Jamie Braidwood\nComing up after Switzerland vs Spain is a cracker of a last-16 tie between Japan and Norway. Japan have been the best team at the World Cup so far and now play a Norway side who are growing in confidence after a difficult start to Group A.\n“You can see the level of the World Cup is rising, so the women’s game is growing fast,” Norway coach Hege Riise told reporters. “Everyone said it was an easy group, we knew it wasn’t because it was a tight group for us. Playing the home team in the first game and not performing well was a little bit devastating for us.\n“But after that we got better step-by-step and when we needed a good win we went on to play Philippines and won 6-0. So confidence in the team is rising.”\nFutoshi Ikeda’s Japan side have impressed with their 3-4-3 system, scoring 11 times and keeping three clean sheets in the group stage. “Each player is performing their role,” he said. “They’re not only performing to their own capacity, but they are working as a unit. It’s all about the collective.”\nHALF TIME! Women’s World Cup LIVE: Spain 4-1 Switzerland\n06:59 , Jamie Braidwood\nSpain had 18 attempts in the first half. Switzerland had 0.\nCodina’s passback was the only attempt on the Spain goal.\nHALF TIME! Women’s World Cup LIVE: Spain 4-1 Switzerland\n06:53 , Jamie Braidwood\nWell, that was quite the half from Spain with four goals and an own goal. Aitana Bonmati has been the star with two brilliant goals, but the game turned when Spain responded to conceding a horror own goal with a brilliant attacking performance. Spain have been intense, pressing well, and Switzerland have been overwhelmed.\nGOAL! Women’s World Cup LIVE: Spain 4-1 Switzerland\n06:48 , Jamie Braidwood\nA killer blow for Switzerland on the stroke of half time - and this time it’s a defensive disaster from them. After keeping three clean sheets in the group stages, Switzerland have been all over the place today. They fail to clear a corner and Laia Codina is able to poke through a host of bodies to add Spain’s fourth, which will also make the centre back feel a lot better after her horror own goal earlier in the half.\nSpain’s response since then has been excellent.\nSpain are unstoppable! #FIFAWWC #SUI #ESP pic.twitter.com/gj6X8rMZKe\n— BBC Sport (@BBCSport) August 5, 2023\nWomen’s World Cup LIVE: Spain 3-1 Switzerland\n06:41 , Jamie Braidwood\nIt’s been the Aitana Bonmati show in Auckland.\nAitana Bonmati at the double!\nSpain are running riot against Switzerland in this first half.#FIFAWWC #SUI #ESP pic.twitter.com/w5ghXRhloa— BBC Sport (@BBCSport) August 5, 2023\nGOAL! Women’s World Cup LIVE: Spain 3-1 Switzerland\n06:37 , Jamie Braidwood\nBONMATI STRIKES AGAIN!\nAnother incredible goal from Bonmati, and a near identical copy from her first! Switzerland once again fail to clear the ball and it drops to Bonmati like she has magnets in her feet. Bonmati dummies and sends two defenders and Thalmann the wrong way, before turning onto her left foot and curling the shot into the empty net. Just exquisite.\nWomen’s World Cup LIVE: Spain 2-1 Switzerland\n06:35 , Jamie Braidwood\n33 mins: Double chance! Bonmati goes close twice in quick succession as the ball drops to the Barcelona star in and around the box. The first effort is blocked and from the corner Bonmati’s strike is palmed wide by Thalmann.\nWomen’s World Cup LIVE: Spain 2-1 Switzerland\n06:33 , Jamie Braidwood\n30 mins: Switzerland have struggled to deal with Spain’s counter-press so far but manage to play out from the back as Walti takes charge. There was a chance to switch play to Aigbogun, but Switzerland aren’t quick enough and the move breaks down.\nWomen’s World Cup LIVE: Spain 2-1 Switzerland\n06:29 , Jamie Braidwood\n26 mins: After some lovely work from Bonmati to win the ball back in the middle, Teresa Abelleira tries her luck from distance. It goes whistling over the bar.\nWomen’s World Cup LIVE: Spain 2-1 Switzerland\n06:25 , Jamie Braidwood\n22 mins: Spain look so dangerous in the final third and are building pressure well. Redondo puts in a dangerous cross from the right that Stierli is forced to hook clear.\nAt the other end, Switzerland work the ball nicely through to Sow as Bachmann dribbles past a couple of defenders. Sow, who was offisde, flashes the effort past the post.\nGOAL! Women’s World Cup LIVE: Spain 2-1 Switzerland\n06:19 , Jamie Braidwood\nAnd there it is! What a response this has been from Spain - and they deservedly retake the lead! Batlle’s inswinging cross goes just over Bonmati but Redondo is alert at the back post. She meets the cross and guides a well placed header into the far corner. Spain retake the lead in three minutes!\nSpain are back in front!\nYou can't take your eye off this match for even a second.#FIFAWWC #SUI #ESP pic.twitter.com/ar2K9aDAzA— BBC Sport (@BBCSport) August 5, 2023\nWomen’s World Cup LIVE: Spain 1-1 Switzerland\n06:17 , Jamie Braidwood\n14 mins: Well, what a start it’s been, and far from the assured one either Codina or Coll wanted. Barcelona though are creating plenty of chances at the other end. Parades heads over from an inswinging corner before Esther Gonzalez turns well in the box but sees her shot blocked from close range.\nGOAL! Women’s World Cup LIVE: Spain 1-1 Switzerland\n06:13 , Jamie Braidwood\nDISASTER FOR SPAIN! It’s a horrible own goal from Laia Codina, from about 40 yards out!\nCodina, brought in for her first World Cup start today, turns and attempts to play a pass back to the goalkeeper but gets the power and placement all wrong. It goes straight past Coll and into the empty net, handing Switzerland a gift of an equaliser.\n\"It's a terrible backpass, an absolute shocker!\"\nSpain have had a nightmare here - Switzerland are level in bizarre circumstances.#FIFAWWC #SUI #ESP pic.twitter.com/zjn0ayuISS— BBC Sport (@BBCSport) August 5, 2023\nWomen’s World Cup LIVE: Spain 1-0 Switzerland\n06:12 , Jamie Braidwood\n10 mins: Spain go hunting for the second as Hermoso flicks a near-post header just over the bar..., OH NO WHAT’S HAPPENED HERE!\nWomen’s World Cup LIVE: Spain 1-0 Switzerland\n06:11 , Jamie Braidwood\nSuch a sharp turn from Bonmati - just brilliant.\nThat didn't take long!\nSpain lead Switzerland within the first five minutes.#FIFAWWC #ESP #SUI pic.twitter.com/paS558oIvF— BBC Sport (@BBCSport) August 5, 2023\nGOAL! Women’s World Cup LIVE: Spain 1-0 Switzerland\n06:06 , Jamie Braidwood\n5 mins: Just the start Spain wanted and it’s a STUNNER from Aitana Bonmati!\nParalluelo’s cross to the back post finds Redondo and it takes a brilliant save from Thalmann to push it onto the post. Redondo keeps it alive and feeds it back to Bonmati, who sharply turns onto her left foot and slams the finish past Thalmann in one swift movement. If it was going to take something special to score the first goal against Switzerland at this World Cup, that certainly was from the Barcelona star!\nWomen’s World Cup LIVE: Spain 0-0 Switzerland\n06:05 , Jamie Braidwood\n2 mins: CrnogorÄeviÄ looks to slip an early ball through to Bachmann, but it just bobbles away and Coll get an her first touch for Spain. The goalkeeper’s every touch is being closed watched in what is the biggest game of the 22-year-old’s career.\nWomen’s World Cup LIVE: Spain 0-0 Switzerland\n06:01 , Jamie Braidwood\nUnderway in Auckland! Will Spain’s changes pay off or can steady Switzerland pull off another World Cup shock?\nWomen’s World Cup LIVE: Spain vs Switzerland\n05:59 , Jamie Braidwood\nThe anthems are played at the knockout stages of the Women’s World Cup are moments away!\nWomen’s World Cup: Spain vs Switzerland\n05:54 , Jamie Braidwood\nSwitzerland have never reached the quarter-finals of the World Cup before but were one of three teams who did not condede a goal in the group stages. In contrast to Spain’s debutant goalkeeper, the experience of 37-year-old Gaëlle Thalmann has been key for Switzerland’s defensive solidity. They will have to be prepared to spend long spells without the ball today.\nWomen’s World Cup: Spain vs Switzerland\n05:47 , Jamie Braidwood\nThere is surely no way Jorge Vilda can survive this team selection should it backfire and Spain lose to Switzerland in the last-16.\nDropping Putellas and handing a debut to a rookie goalkeeper for what is Spain’s second knockout match at the World Cup in history is a huge call.\nWomen’s World Cup\n05:37 , Jamie Braidwood\nMeanwhile, Fifa is investigating a complaint of misconduct in relation to Zambia at the Women’s World Cup.\nIt has been reported the alleged incident, said to involve head coach Bruce Mwape, took place during a training session ahead of Zambia’s final Group C match against Costa Rica.\nThe Football Association of Zambia (FAZ), however, stressed the organisation had not received any formal complaint from players or officials.\n“Fifa takes any allegation of misconduct extremely seriously and has a clear process in place for anyone in football who wants to report an incident,” a spokesperson said.\n“We can confirm that a complaint has been received in relation to the Zambian Women’s National team and this is currently being investigated.\n“We cannot provide further details regarding an ongoing investigation for obvious confidentiality reasons.”\nZambia Women’s coach accused of rubbing player’s chest at World Cup\nWomen’s World Cup LIVE\n05:29 , Jamie Braidwood\nLauren James inspired England to a thrilling Women’s World Cup victory over China and now the Lionesses are into the knock-out stages of the tournament.\nThe Chelsea forward has produced some spectacular strikes already down under, with England rebounding from the injury loss of Keira Walsh.\nSarina Wiegman has reshuffled the pack spectacularly and England have regained their confidence, particularly in front of goal.\nHere’s everything you need to know about the Lionesses’ next challenge in Australia:\nWhen do England play next? Women’s World Cup fixtures and route to the final\nWomen’s World Cup LIVE\n05:23 , Jamie Braidwood\nEngland goalkeeper Mary Earps hailed “mastermind” Sarina Wiegman whose system switch-up stirred the Lionesses to life and ensured they launched themselves into the World Cup’s knockout phase with a perfect record.\nWiegman’s move from a 4-3-3 to a 3-5-2 formation in the absence of injured midfielder Keira Walsh inspired a 6-1 victory over China to conclude the group stage and set up a last-16 meeting with Nigeria in Brisbane.\nAnd there was more hopeful news for Lionesses fans on Friday morning after it was revealed Walsh stepped up her recovery from the knee injury she sustained against Denmark, and was following an individual programme whilst her 22 team-mates trained together at the Central Coast Stadium.\nAsked if the new system had been in the works for a while, Earps replied: “No, not really, I mean obviously Sarina is the mastermind behind all the tactics and the formations, so yes, we just do as we’re told, we get in formation, do our job to the best of our ability and it paid off for us.”\nMore here\nMary Earps insists fearless England ready to avoid World Cup banana skin\nWomen’s World Cup LIVE\n05:15 , Jamie Braidwood\nThe race for the Women’s World Cup golden boot is taking shape as the group stages continue in Australia and New Zealand.\nJapan’s Hinata Miyazawa bagged a brace in the 4-0 victory over Spain to move top of the top-scorer standings. Alexandra Popp, one of the pre-tournament favourites for the golden boot, joined her on four goals but the Germany captain will be unable to add any more after the two-time champions crashed out in the group stages.\nLauren James among those on three goals after her stunning double in England’s 6-1 win over China. If two or more players finish on the same number of goals, the golden boot will be determined by assists and then on minutes played.\nWomen’s World Cup golden boot standings\nFour goals\nHinata Miyazawa (Japan) - one assist\nAlexandra Popp (Germany)\nThree goals\nLauren James (England) - three assists\nAry Borges (Brazil) - one assist\nKadidiatou Diani (France) - one assist\nSophie Román Haug (Norway)\nAmanda Ilestedt (Sweden)\nJill Roord (Netherlands)\nWomen’s World Cup LIVE: Team news!\n05:09 , Jamie Braidwood\nThe team news is in and the big news for Spain is that Jorge Vilda has decided to drop Alexia Putellas and his goalkeeper as he makes five changes from the 4-0 defeat to Japan. Barcelona’s Cata Coll replaces Misa Rodriguez in goal for Spain and will make her international debut in the knockout stages of the World Cup, while two-time Ballon d’Or Putellas drops to the bench.\nThere’s also a change at centre-back, with Laia Codina coming in for Rocío Gálvez. Mariona Caldentey and Olga Carmona are also replaced, with Esther Hernandez, Oihane Hernández and Alba Redondo all coming in. Big changes.\nSwitzerland: Thalmann, Stierli, Maritz, Riesen, Aigbogun, Reuteler, Sow, Waelti, Crnogorcevic, Bachmann, Piubel.\nSubs: Peng, Friedli, Marti, Felber, Arfaoui, Rey, Buehler, Mauron, Calligaris, Humm, Terchoun, Lehmann.\nSpain: Coll, Batlle, Paredes, Hernandez, Codina, Abelleira, Bonmati, Hermoso, Gonzalez, Redondo, Paralluelo.\nSubs: Rodriguez, Salon, Andres, Guerrero, Caldentey, Putellas, Navarro, Perez, Carmona, Galvez, Zornoza, del Castillo\n04:57 , Jamie Braidwood\nThe two squads inspect the pitch ahead of kick-off. We should have some team news any moment now...\n04:49 , Jamie Braidwood\nSwitzerland manager Inka Grings on her team’s progress to the last-16 and the improvements they must have to score more goals:\n“It feels very good to have made it through. There are a lot of things we can be satisfied with, and we are, but we’ve got to understand that the journey is not finished yet. I played in Germany long enough to see things differently. You’ve got to be able to instil a winning mentality. If you’ve got enough conviction, anything is possible.\n“It was something that we analysed intensively, we talked through with the team and [we will look to] also take the offensive players, assertive players, bring them more into the team. Of course we have to be more assertive in that run towards the goal.”\nWomen’s World Cup LIVE\n04:40 , Jamie Braidwood\nSpain head coach Jorge Vilda warned that his team won’t forget the 4-0 defeat to Japan as they begin their knockout stage campaign against Switzerland.\n“These types of defeats leave a deep mark upon us,” he said. “But they are also necessary in the evolutionary development of the team and process of growth.\n“We haven’t forgotten about it and we will not forget about it.\n“Switzerland have something very valuable, that in three games no-one scored a goal against them. That means that the defence is very solid.”\nSpain are playing in just their second knockout game at the World Cup, after being knocked out in the last-16 by the USA four years ago.\nWomen’s World Cup LIVE\n04:34 , Jamie Braidwood\nThe upsets at the Women’s World Cup group stage started on the opening day and ended with the biggest of all. Germany, the two-time champions and among the tournament favourites, are out before the quarter-finals for the first time in their history, a result that ranks as both the most stunning shock the tournament has ever seen, while also simply continuing the theme of the greatest group stage ever played at the Women’s World Cup. After all, hadn’t we learned to expect the unexpected?\nA 1-1 draw against South Korea sealed Germany’s fate, following their dramatic 2-1 defeat to Colombia earlier in Group H. It meant Morocco, making their Women’s World Cup debut, progressed ahead of the side who thrashed them 6-0 in the opening round. The first-ever 32-team Women’s World Cup and the decision to expand from 24 teams has been a resounding triumph: rather than creating a more predictable group stage, it has done the opposite and led to wonderfully chaotic, thrilling tournament football.\nHow the Women’s World Cup produced its greatest ever group stage\nHow the Women’s World Cup produced its greatest ever group stage\nWomen’s World Cup LIVE\n04:33 , Jamie Braidwood\nAfter 16 days and a group stage that was full of twists and turns, the state of play at the Women’s World Cup remains largely as it was before the start of the tournament: there is no standout favourite. Despite the shock exits of Germany, Brazil, and Canada, the tournament remains open to a number of teams and the list of contenders grew as the group stage progressed. No one is ruling out anyone, though as ever, when it comes to teams punching above their weight, the question at this point in the World Cup is how long they can sustain their momentum.\nOne of the differences between this year’s last-16 to four years ago and previous tournaments is there are more games than usual at this stage where there is a clear underdog. That, of course, is a result of a group phase like no other in Australia and New Zealand and its string of high-profile shocks. South Africa-Netherlands, Nigeria-England, Morocco-France, and even Jamaica-Colombia, all carry the edge of potential surprises.\nWomen’s World Cup last-16 preview\nCan England break cycle of World Cup shocks or will underdogs continue to thrive?\nWomen’s World Cup LIVE\n04:32 , Jamie Braidwood\nHow to watch today’s matches\nSaturday 5 August\nMatch 49: Switzerland vs Spain (06:00, Auckland) - BBC One\nMatch 50: Japan vs Norway (09:00, Wellington) - ITV 1\nWomen’s World Cup LIVE\n04:31 , Jamie Braidwood\nThe Women’s World Cup knockout rounds are set after the group stages featured a number of shocks and stunning upsets in Australia and New Zealand.\nGermany, Brazil and Canada were all knocked out in the groups, with Jamaica, South Africa and Morocco among those through to the last-16 for the first time.\nEngland are looking strong after Sarina Wiegman’s tactical tweak released Lauren James, with the Lionesses forward scoring twice in the 6-1 win against China.\nIt means England will play Nigeria in the last-16, with the knockout stages getting underway on Saturday with Switzerland vs Spain and Japan vs Norway.\nHere is everything you need to know about how to watch the Women’s World Cup.\nWomen’s World Cup TV schedule: How to watch every match today\nGood morning!\n04:30 , Jamie Braidwood\nHello and welcome as the Women’s World Cup knockout stages get underway this morning, with Spain facing Switzerland in the last-16.\nIt’s been a tournament defined by shocks and surprises so far, after a group stage that saw Germany, Brazil and Canada crash out while Jamaica, South Africa and Morocco advanced to the knockout phase for the first time.\nSwitzerland will look to keep the upsets coming as they take on Spain in Auckland. The Swiss have been defensively resilient so far and did not concede a single goal as they topped Group A ahead of Norway, New Zealand and the Philippines.\nSpain, meanwhile, are looking to respond to their 4-0 defeat against Japan in their final game of Group C. That result increased the pressure on head coach Jorge Vilda, as Spain look to rediscover their early form that made them contenders for the World Cup.\nFollow live updates from Switzerland vs Spain in the Women’s World Cup last-16, followed by Japan vs Norway.",
  "word_count": 4261,
  "scraped_at": "2026-02-14T13:26:35.800345"
}