{
  "article_id": "05fdbd6233f3",
  "url": "https://www.bbc.co.uk/sport/football/articles/crrxwjjqrxeo",
  "title": "WSL: 'Perfect reaction' as Man City hunt WSL title",
  "date": "2026-02-13T23:10:22.269Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_bbc",
  "body_text": "'Marvellous' Man City set WSL standard in rampant win\n- Published\n\"I don't need to motivate these players, they are fully aware where we are in the league and what we have done,\" said Manchester City manager Andree Jeglertz.\n\"Our attacking play was marvellous throughout the whole game. I'm really impressed and proud.\"\nThese comments came after his side had thrashed Leicester City 6-0 to regain their 11-point lead at the top of the Women's Super League.\nManchester City have won 14 of 16 games this season, including all nine of their home league matches, only dropping points in defeats at Stamford Bridge and Emirates Stadium against the defending WSL and European champions respectively.\nLast Sunday, they were stunned in losing to Arsenal but against Leicester showed their reaction to a rare setback with a superb performance against the league's bottom side.\nWhile the chasing pack all have at least one game in hand, City's closest challengers Manchester United are 11 points behind, Chelsea 12 and Arsenal a further point behind in fourth.\nWhile those three teams are fighting for Champions League places, it feels a stretch to imagine any of them stopping City claiming their second WSL title.\nIndeed against Leicester, despite scoring six, a rampant Manchester City side will be disappointed not to have got more.\nThey had 31 shots on goal with 15 on target, recording an xG of 4.61 and an astounding 232 passes in the final third, all highest totals for a WSL side this season.\nThis result increased their goal difference to +34, almost twice as good as next best Manchester United (+18) and made it 47 goals from 16 games, an average of 2.94 per game.\nHemp stars in big Man City win but still wants goal\nManchester City's desire for excellence can be summed up by the attitude of Lauren Hemp, who was player of the match after supplying two assists and creating 11 chances for her team-mates.\nAsked how satisfied she was, the England winger replied: \"Yeah, but no goal - I think I need to practise my shooting! But I am really happy to contribute where I can.\n\"We are really pleased. We've got a really confident group, everyone is contributing and the substitutes got involved too.\"\nMissing out on a Champions League spot last season means Manchester City have played 22 games in all competitions this season while, at the end of this weekend, rivals Chelsea will have played 25, Arsenal 27 and Manchester United 28.\nThe squad looks fresh as a result of the extra rest, none more so than star striker Khadija Shaw, who has scored 15 league goals this season, surpassing the 12 she scored last campaign.\nEven with the Asia Cup on the horizon and the departure of key players such as Yui Hasegawa, they look well equipped to prosper. Record signing Sam Coffey made her first start in this game and impressed in midfield.\nOn Sky Sports, ex-Manchester City captain Steph Houghton noted her old side's determination to succeed this season.\n\"There is always an added pressure when you are top of the league with a big points difference, and as a player you naturally feel in those first few days after being beaten [by Arsenal],\" she said.\n\"That was the perfect reaction.\"\nWith six games left, Manchester City need 12 points to claim the title. If results go their way, they could even win it at Old Trafford in three games' time on Sunday, 29 March.\nMaybe that would be enough to satisfy Jeglertz and this hungry group of players.\nBen Haines, Ellen White and Jen Beattie are back for another season of the Women's Football Weekly podcast. New episodes drop every Tuesday on BBC Sounds, plus find interviews and extra content from the Women's Super League and beyond on the Women's Football Weekly feed",
  "word_count": 642,
  "scraped_at": "2026-02-14T11:17:43.616264"
}