{
  "article_id": "060ceae6ace0",
  "url": "https://www.90min.com/posts/sarina-wiegman-the-manager-that-wins-wherever-she-goes",
  "title": "Sarina Wiegman : The manager that wins wherever she goes",
  "date": "20230308T141500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sarina Wiegman: The manager that wins wherever she goes\n90min is championing 10 influential women in football this International Women's Day.\nSarina Wiegman became the first coach to win back-to-back tournaments European Championship tournaments, having led the Netherlands to the Euro 2017 title five years before England's victory last summer.\nIt can be said that Wiegman had a competitive edge from a young age, playing football on the streets of her home country.\n\"When I first started kicking a ball around on the streets of The Hague, it was mostly with boys. There were no girls’ teams then, so I made sure my hair was cut really short and played in teams with my twin brother.\n\"Sometimes, when people saw I was a girl, they made trouble. Other times we got nice reactions. But most of the time it was hard to play.\"\nAs a player, Wiegman spent some time in the Netherlands before moving on to the United States to further develop herself as a player at the University of North Carolina at Chapel Hill.\n\"In the Netherlands, it felt like we were always fighting for our place. Like we weren’t accepted. I wanted more and I knew that, in the US, things were better for women’s soccer.\n\"America was like a soccer paradise for me. There was recognition, the facilities were great and we had good coaches – passionate coaches. The year I spent there changed my life. It changed my mindset. In America I had found something I was looking for.\n\"I was with a group of women and girls who wanted the same thing as I did. I’m sure there had been a few in the Netherlands, but they weren’t really in the environment where I had been. You felt that the coaches wanted to make you work hard and develop as a player, but that they also wanted to take care of you.\"\nWhile in the United States, Wiegman had the opportunity to play alongside several future stars of the USWNT, including Mia Hamm, Kristine Lilly, and Carla Overbeck. The mentality of striving for what women's football could become in America is what Wiegman brought back with her when she started coaching in her home country.\nAfter a short stint managing Ter Leede, Wiegman become the first manager of ADO Den Haag, one of the founding members of the first ever professional women's league. With Wiegman in charge, they won the National Championship in 2012 and the KNVB Cup in 2012 and 2013.\nShe then moved on to become an assistant coach for the Netherlands' national team, while also pursuing her UEFA Pro coaching license. As part of the process of receiving her license, Wiegman coached at Sparta Rotterdam.\n\"As the only female coach there, I knew I had to show that I had quality. That’s what I worked on all day. Work hard, put quality into everything and deliver.\n\"It was a new environment for me – the first time I was working with a professional men’s team. At first, I was always asking myself: am I doing the right things? But I observed how Alex Pastoor [the manager] and his coaches worked. Figured things out.\n\"I also got some confirmation that what I had been doing was working.\"\nREAD MORE ABOUT 10 OF THE MOST INFLUENTIAL WOMEN IN FOOTBALL\nAfter some time as assistant coach with the national team, Wiegman made the step up after Arjan van der Laan was sacked in 2016 to take charge of the team. At the time, the performances were poor, and morale within the dressing room was low.\n\"We had some friendly games, and these gave us opportunities to train our playing style. I didn’t change it, but I put some emphasis on certain things: arranging our counter-attack, our transitions between attacking and defending. We put a lot of effort into those things.\n\"The biggest focus was on our mentality, though. We had some players who were always talking about how good players from other countries were. We had to tackle that and change the way those players looked at themselves.\"\nThe Netherlands went on to win their first major international women's title, the Euros, only six months after her full-time appointment during the summer of 2017 - an incredible feat given that they had lost five of seven friendlies before she was made permanent manager.\nHer management caught the eyes of the English FA and in September 2021, after leading the Dutch team to the World Cup final, she took over from Phil Neville to coach the Lionesses. A clear match made in heaven, with Wiegman guiding England to a win at the 2022 Euros and becoming the first manager to win the competition with two different teams.\nEngland have transformed as a team under her managment, and fans are hopeful that Wiegman can continue her winning streak with a solid performance at the upcoming World Cup.\nThe 53-year-old will want to finally get her hands on the coveted trophy, but is well aware that it won't be smooth sailing.\n“We have five months to go but the games were good. We had a lot of chats with the team and we know we have to step up more because the opponents in the World Cup will be even better than we have had now.”\nMajor achievements\n- Ter Leede - Dutch championship: 2006/07\n- Ter Leede - KNVB Cup: 2006–07\n- ADO Den Haag - Eredivisie: 2011/12\n- ADO Den Haag - KNVB Cup: 2011/12, 2012/13\n- Netherlands - FIFA Women's World Cup runner-up: 2019\n- Netherlands - UEFA Women's Championship: 2017\n- England - UEFA Women's Championship: 2022\n- England - Arnold Clark Cup: 2022, 2023\n- The Best FIFA Women's Coach: 2017, 2020, 2022\n- UEFA Women's Coach of the Year: 2021/22\n- IFFHS World's Best Woman National Coach: 2020, 2022\n- Knight of the Order of Orange-Nassau: 2017\n- Honorary CBE: 2022 Special Honours",
  "word_count": 992,
  "scraped_at": "2026-02-14T13:03:12.497258"
}