{
  "article_id": "06117efd3def",
  "url": "https://www.cinemablend.com/television/nfl-charissa-thompson-erin-andrews-talk-about-taylor-swift-impact-bringing-female-viewers-to-league",
  "title": "NFL Charissa Thompson And Erin Andrews Want To Talk About Taylor Swift  Impact  On Bringing More Female Viewers To The League",
  "date": "20251125T021500Z",
  "domain": "cinemablend.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "NFL's Charissa Thompson And Erin Andrews Want To Talk About Taylor Swift's 'Impact' On Bringing More Female Viewers To The League\nLoving this girl power!\nYour Daily Blend of Entertainment News\nYou are now subscribed\nYour newsletter sign-up was successful\nWhen Taylor Swift and Travis Kelce hard-launched their relationship back in September 2023 — the biggest pop star on the planet seated next to Donna Kelce as the Kansas City Chiefs took on the Chicago Bears — the NFL was forever changed. Regardless of viewers’ knowledge or interest in professional football, everybody — EVERYBODY — started tuning in on Sundays. It was impossible not to notice, especially for women like Charissa Thompson and Erin Andrews, who opened up about the impact Swift has had on the league.\nNFL sportscasters Erin Andrews and Charissa Thompson paid a visit to the New Heights podcast, where the subject of Taylor Swift came up (naturally), as well as whether or not ultimate girl dad Jason Kelce is able to share his love of football with his daughters. While he hasn't gotten them on board just yet, Thompson did want to tell Travis Kelce how big a deal it is to have his fiancée at his games. She said:\nAll the dads, Brads and Chads complaining that the NFL overdid their coverage of Taylor Swift in those early days of her and Travis Kelce’s relationship can sit right down, because for a lot of girl dads, NFL games became something they could bond with their daughters over.\nIn fact, bonding with their fathers over sports is exactly why Charissa Thompson and Erin Andrews — whose own impact on women in sports media shouldn’t be overlooked — chose the career path they did. Thompson said:\nIt was great, also, to see how Travis and Jason Kelce embraced Swifties becoming football fans, as Taylor's loyal followers scooped up those No. 87 Chiefs jerseys and started tuning into New Heights, where the Super Bowl champions patiently explained the most basic fundamentals of the game for new fans. Jason agreed that talking to people about his future sister-in-law’s impact has been “awesome,” saying:\nIt’s possible that Erin Andrews had a hand in getting “your English teacher and your gym teacher together,” as she’s jokingly taken credit for the couple. However it happened, lots of Swifties are grateful to witness Taylor Swift finally get the “Love Story” she’s always wanted — and if it means having something else to bond with your dad or husband or brother over on Sundays, all the better.\nYour Daily Blend of Entertainment News\nHeidi Venable is a Content Producer for CinemaBlend, a mom of two and a hard-core '90s kid. She started freelancing for CinemaBlend in 2020 and officially came on board in 2021. Her job entails writing news stories and TV reactions from some of her favorite prime-time shows like Grey's Anatomy and The Bachelor. She graduated from Louisiana Tech University with a degree in Journalism and worked in the newspaper industry for almost two decades in multiple roles including Sports Editor, Page Designer and Online Editor. Unprovoked, will quote Friends in any situation. Thrives on New Orleans Saints football, The West Wing and taco trucks.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name.",
  "word_count": 558,
  "scraped_at": "2026-02-14T12:50:54.058774"
}