{
  "article_id": "0620b007be23",
  "url": "https://thestandard.org.nz/on-a-schism-by-the-unrighteous-and-immoral/",
  "title": "On a schism by the unrighteous and immoral",
  "date": "20230620T064500Z",
  "domain": "thestandard.org.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Written By:\n- Date published:\n3:03 pm, June 20th, 2023 - 21 comments\nCategories: election 2023, national, political parties, Politics -\nTags: democracynz, northland, sarcasm, schism\nIt always intrigues me that some political parties haven’t learnt the basic political lesson about politics. The latest from the fledgling Democracy NZ is a classic schism by people who don’t want to actually achieve anything useful. It has lost about a third of its candidates, the most senior ones, and an unknown number of volunteers over a dispute about their direction – just before a general election. It reflects the various aspects I have always noticed about people who proclaim ‘freedom’ rather than cooperation. They’re useless at achieving anything apart from unproductive chaos.\nDemocracyNZ has advertised its political platform as “freedom, family and farming”. Much of its rhetoric concerns opposition to the pandemic response and climate change regulations.\nIt had been seen as the leading light for the so-called freedom movement, which is split between various parties, including the Brian Tamaki and Sue Grey-led Freedoms NZ and the recently announced Leighton Baker party.\nStuff: Political party DemocracyNZ in turmoil after candidate exodus\nI am really un-surprised by this. We saw the same kind of incoherent splitting happen in the last few elections from pretty much the same group of charlatans for much the same reasons. The underlying reason reminds me of the observation of Dwight Eisenhower on political parties. This holds as true today as it did more than half a century ago.\nI wonder what he’d think of the modern Republician party of Trump and his minions. They appear to be operating, like the ‘freedom’ groups in NZ like Groundswell NZ, purely for seizing political power.\nCurrently the right are resembling the fracturing of previous decades of our ostensibly moral and righteous christian parties which was captured in this lovely diagram from wikipedia.\nIts [DemocracyNZ] polling has oscillated between 1-2%, well short of the 5% threshold, meaning its fortunes likely rest on King’s candidacy in the Northland electorate which he won for National in 2017.\nIt is understood that the exodus came after Cranston – who is also a prominent member of Groundswell NZ – was fired by the board on Saturday after expressing discontent with the actions of senior party figures. That resulted in the other candidates quitting in protest.\nDiscontent had been simmering for months over the party’s culture, leading to volunteers and members leaving the party.\nFour of the candidates released a joint statement on Monday morning, stating their belief that the party’s culture did not give confidence they could successfully implement changes if elected.\nStuff: Political party DemocracyNZ in turmoil after candidate exodus\nAbout the only interesting thing about this inevitable spat by the obviously unrighteous and immoral is the way that it demonstrates the inability of most of these movements to be effective. Andrea Vance summarised it in a column over the weekend about various electorate seats – including King’s Northland hopes.\nNorthland is a real contest. Conservation Minister Willow Jean Prime could win if the votes are split on the right between Maungaturoto farmer Grant McCallum, ACT’s Mark Cameron, and former MPs Matt King and Shane Jones.\nStuff: Want to know who is going to win the election? Watch these seats\nWhat a choice for the right-leaning voters in the North. She appears to have written this before the DemocracyNZ disintegration.\nMatt King, apparently not that good at dealing with issues in his own micro-party. That isn’t exactly going to help with his chances in that Nortland seat. Admittedly a disagreement with some lazy grifters from Groundswell who are intent on pollution and never paying for it was inevitable. It isn’t exactly a responsible position to be pushing the unpaid costs of farming on to the other productive and profitable parts of the NZ export economy as has happened fro the last 20 years.\nOf course the National candidate Maungaturoto farmer Grant McCallum is probably going to infuriate numbers of that same nutter and grifter right faction because he is appears to be somewhat rational. He obviously recognises that unbridled pollution by farming isn’t exactly a forward looking approach.\nMcCallum has lived in Northland since the late 1970s and owned and operated his Maungaturoto beef and dairy farm since 1995. He serves as chair of the Kauri Museum at Matakohe and has been a member of the Bluegreens executive since 2001.\nNorthern Advocate: National’s Northland election candidate is Maungaturoto farmer Grant McCallum\nHowever I’m sure that he will be happy with the disintegration in DemocracyNZ. It means that he won’t be having to fight the polluter nutters of the right as hard, while also trying to win the seat from Conservation Minister Willow Jean Prime.\n- Comments are now closed\n-\nI first read Trump minions as Trump morons.\n-\nTrump minions to Trump morons… makes sense to me\n-\nYES\n-\n-\n-\nFolks may get the Conservative party mixed up with the New Conservative party. This lot:\nI am an ordinary citizen, just like you… A runaway street kid from a life of abuse, violence and dysfunction with all that that entails, to a primary school teacher and the founding director of a charitable trust, and now law student.\nI know too well the issues our society is struggling with from broken families, broken mental health and addiction services, to broken housing. We need solutions, not separatist policies which do not move the people forward in unity. New Conservative has solutions with common sense, practical, realistic policies. https://www.nc.org.nz/team\nNew Conservative has a new language, set apart from the status quo.\nThey may not have thought this through properly: to move the people forward in unity isn't easy while using a new language. Most folks in Aotearoa prefer English.\nAlso, inventing a new language for a political party will be seen as radical by most, not conservative. Political marketing doesn't work well on the basis of contradiction.\n-\nQuite a contrast with 30 years ago, when Jim Anderton managed to unite 5 different parties under the Alliance banner. The parties (including the Greens) understood that there was a clear path forward, and they followed it …\n1) Campaign for MMP. Win referendum.\n2) Same election (1993) get a bridgehead under FPP (Anderton and Sandra Lee).\n3) Remain united for MMP election, 1996. Get 13 MPs.\n4) Go their separate ways in 1999.\nBetter to bury differences and break up after several terms, than never get into Parliament (or government).\nMoral of story: leftie co-operation works, rightie \"me me me\" does not.\n-\nDemocracyNZ's fortunes are likely rest on King’s candidacy in the Northland electorate?\nClean that off the whiteboard. King has as much chance of winning the seat as Billy Te Kahika has of being elected\n-\nBilly TK is appealing a 4 month prison sentence for incitment at a Queen St anti-lockdown rally under Covid measures. His appeal (grift) for funds from supporters focuses on staying out of jail, so doubt he's an election goer. He may even be in The Big House by then.\n-\nSorry, Billy TK Jnr.\n-\n-\n-\nSince this is 2%+ wasted vote on the day, does that effectively gain votes for a left government, or a right government?\nDoes this wasted vote pull votes mostly away from Labour+Greens, or National+Act?\n-\nMost of those don't vote anyway. As sovereign citizens they are not the (legal) entity named on the rolls voiding the contract with the corporate entity of New Zealand as referenced by Magna Carta and the treaty of Westphalia. Also, we all know the government uses the opportunity to impregnate the ballot papers with nanobots to track you after the election.\n-\nThe sad thing is how NACT is moving into that orbit – creating the concept of a gated community of those with health insurance, children in private schools studying for places in foreign universities, seeking a small sized nation state capability and growing their wealth here as a landlord class with limited tax contribution into their community. Very much the Magna Carta Lords of the Manor ruling above the lower class whose opinion counts for nothing.\n-\nAnd all very ironic considering they (including Roger Douglas and cronies, et al) created so many of NZ's present day problems.\nIts also quite the Libertarian way…gated communities with private police force, etc etc; ….\nThese self absorbed jerks want a kind of apartheid. Not so much race (altho…: (\nMaybe more of a wealth based system.\nThat…will never last. Plenty of history proves. And..the violence..will skyrocket.\nTheir gated walls will need to be ever bigger…more private police, more weapons. Until…..\n-\n-\nIf they can be persuadable to either not vote or vote Labour, we need to keep reaching out. One cranky and difficult conversation at a time.\nLoathe them sure, but disenfranchising them is the way to MAGA.\n-\n-\n-\nThese are the nutty fringe factions that are too obnoxious, egotistical and delusional to work with National or Act. Long may they froth in obscurity\n-\n…too obnoxious, egotistical and delusional to work with National or Act.\nHow is it possible to be more obnoxious, egotistical or delusional than the ACT cult?\n(By the way, why does the cult leadership let Brooke van Velden keep appearing opposite the infinitely sharper Chloe Swarbrick on TVNZ1 every Monday morning? She suffers a comprehensive whopping’ every single time.)\n-\nWhere van Velden learnt her ACT values, as described in her maiden speech:\n\"I studied economics and international trade at the University of Auckland. This is when I became an ACT supporter. Economics opened up my mind to alternative solutions to the big issues we face today, such as poverty and the environment. It was a revelation to me at the time that trade and free markets have pulled billions of people from hardship and poverty.\"\nAnd here I was, thinking it was the Depression era US New Deal, Savage's Welfare State legislation and the UK post-war Atlee government that pulled millions in those countries out of poverty, disease and capitailist exploitation. While colonialism and its capitalist predation of stable societies in Asia and Africa, in search of trade, destroyed them and plunged millions of their people into poverty, and many into slavery.\nGuess van Velden's economics classes skipped over those economic facts, and their results.\n-\n-\nWe should never forget that Luxon took over a week to make the easiest decision any leader could face … ruling out Brian Tamaki.\nNo moral compass and terrible political judgement.\n-\nWell put Especially the \"Froth\"\n-\nThese are people who advanced on Parliament with gallows to hang all the MPs, and replace them with their own folk. National is quite happy under Luxon to pander to these disgruntled voters. But Destiny and Sue Grey's Outdoor and Freedom Party, both involved in anti-lockdown events, scent the opportunity also.\nThis will be cannabilisation of mostly rightist parties, and perhaps the Greens, for the hippy-dippy crystal end of the anti-vaxers.\n-\n-\nLanguage, ain't it great!\nDwight Eisenhower\n“If a political party does not have its foundation in the determination to advance a cause that is right and that is moral, then it is not a political party; it is merely a conspiracy to seize power.”\nand\ntWiggle\nThis will be cannabilisation of mostly rightist parties, and perhaps the Greens, for the hippy-dippy crystal end of the anti-vaxers.\nVery perceptive Lprent and now that you have pointed it out I can see why I have always felt a lack in the anti-vaxxer parties continuing into power, now that the urgency around the pandemic has passed. The slant about encroaching on freedom, that I could have run an argument on, was suppressed by the conspiracy nanobots end including the Dirty Dozen (Kennedy et al).\nThey will find it difficult to now retreat or expand into sensible policies about the world in NZ ie a sane, sensible and moral cause. Their conspiratorial days are too close and too well remembered to give credibility to any but the original followers.\nAnderton & Dunne were able to cobble together parties or groups of parties because people could see the right cause and moral imperative they believed in and for these two guys, their good basic characters. Grey, Tamaki & their parties don't seem to have a right or just cause/s and their personal good characters are somewhat lacking.\n- Comments are now closed",
  "word_count": 2078,
  "scraped_at": "2026-02-14T12:00:18.099550"
}