{
  "article_id": "06239f84c9ba",
  "url": "https://www.centralmaine.com/2024/09/18/colorado-two-way-star-travis-hunter-hopes-to-play-on-both-sides-at-the-next-level/",
  "title": "Colorado two - way star Travis Hunter hopes to play on both sides at the next level",
  "date": "20240919T010000Z",
  "domain": "centralmaine.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "BOULDER, Colo. — About the only thing that doesn’t come easy for Travis Hunter on the football field is choosing sides.\n“Equal,” Colorado’s two-way standout wrote in an email interview with The Associated Press on whether he prefers catching passes or intercepting them.\nWhile scouts, analysts and fans debate whether he’d make a better cornerback or wide receiver in the NFL, Hunter said he fully intends to play both ways as a pro.\nThat’s his plan, anyway.\nBecause he can’t stand sitting out a snap, which is why he’s averaging about 125 plays a game this season. He’s a throwback player who’s following in the footsteps of past two-way stars such as Charles Woodson (Michigan) and Champ Bailey (Georgia).\nHunter’s coach, Deion Sanders, also was a two-way player in the NFL and the person he leans on for football advice on the field or life lessons during their fishing excursions.\nSanders, for one, believes his protégé can handle the workload on the next level, where several early mock drafts have him as a top-10 pick.\n“Pros go to a huddle. So he’s even getting more time to rest,” explained Sanders, whose Buffaloes (2-1) start Big 12 play this weekend against Baylor (2-1). “So with him getting that amount of rest, he cannot help but be a great pro.”\nMore valuable at DB or WR?\nIt’s hard to pick at which position Hunter may be more valuable. He’s clearly the top target of quarterback and fellow Heisman hopeful Shedeur Sanders with a team-leading 30 catches for 342 yards and five touchdowns.\nOn defense, Hunter has 11 tackles, one interception and two pass breakups despite teams sometimes shying away from challenging him. Against Colorado State over the weekend, he had five tackles and returned an interception 38 yards in a 28-9 win. For that, he was named the Big 12 Conference’s defensive player of the week.\nHe had a strong case to win the award on offense, too, with 13 catches for 100 yards and two TDs.\nSimply another day at the office for Hunter, who was on the field for 160 total snaps — not factoring in penalties — against Stanford last season. He’s pretty much got the green light to stay on the field. The only time he took a break last weekend was to catch his breath after chasing down a Rams tailback following a 62-yard run.\nHEISMAN HOPEFUL\nHunter’s tireless energy is why he’s among the favorites in the Heisman race, with Miami QB Cam Ward currently having the best odds, according to BetMGM Sportsbook.\nColorado’s lone Heisman winner was tailback Rashaan Salaam in 1994 when he rushed for 2,055 yards.\n“It would mean a lot to me to win the Heisman!” Hunter wrote. “It would be more than just an individual achievement — it would be a celebration for my teammates, coaches, and everyone who has supported me. We’ve all worked hard together, pushing one another to be our best.”\nFOLLOWING DEION\nSanders has served as a mentor to Hunter since the five-star recruit pivoted from Florida State to join Sanders at Jackson State. Hunter then followed his coach to Colorado, where last season he earned first-team All-American and first-team Academic All-American accolades.\nTheir bond extends beyond the football field. So does their competitive nature.\n“We both love to fish, and anytime we do it together it’s a competition to see who can catch the biggest fish,” wrote Hunter, who attended high school in Georgia. “He stresses the importance of being intentional and deliberate in every aspect of my life, not just football. He’s taught me that setting clear goals and approaching them with integrity and determination makes all the difference.”\nNIL DEALS\nFinancially, Hunter’s already developed quite a nest egg thanks to name, image and likeness deals ( $3.1 million, according to On3’s NIL valuation ). A deal with NerdWallet, a personal finance website, was announced Wednesday. As part of the deal — titled: “ Smartest NIL Deal Ever ” — he vowed to place 20% of the money into a savings account. Hunter is the third NCAA player to sign an NIL deal with NerdWallet, joining USC women’s basketball star JuJu Watkins and Rob Dillingham, the former Kentucky player who’s now in the NBA.\n“I try and make smart decisions on and off the field,” Hunter wrote.\nNOT-SO-HIDDEN TALENT\nBesides football and fishing, Hunter has another talent — “I’m an incredible dancer!” he wrote.\nHe posts videos of dance routines on social media. But he saves his best celebration moves for the field following big plays. He had a choreographed routine with his teammates after his interception against Colorado State. Hunter spun the football and they all gathered around it like it was a campfire and they were warming their hands.\nThe skit drew an unsportsmanlike penalty. All part of having fun.\n“I just live in the moment and take it day-by-day with equal amounts of gratitude and hard work,” Hunter wrote. “I have an amazing team around me that helps me stay focused on the right things that move me forward and allows me to perform at my best both on and off the field.”",
  "word_count": 861,
  "scraped_at": "2026-02-14T14:14:47.709306"
}