{
  "article_id": "0626cd226664",
  "url": "https://1035kissfmboise.com/standout-boise-state-player-announces-he-will-return-to-team/",
  "title": "Standout Boise State Player Announces He Will Return to Team",
  "date": "20230331T221500Z",
  "domain": "1035kissfmboise.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Standout Boise State Player Announces He Will Return to Team\nIt's certainly fair to say that Boise State basketball over the last two years has stolen a little bit of shine off of the long-time powerful football program. Eventually, the university was going to grow enough to have more than \"just a football team\" and Leon Rice has helped get them there. To be clear, the women's team has historically had great runs as well--it just happens to be the men on fire right now.\nThis year was their second in a row making a run at the Big Dance in March--something that Boise State fans (and we say this respectfully), just aren't used to. Let's be clear--the last loss that Final Four team San Diego State had was in Boise, against the Broncos!\nCould the Broncos make it three years in a row next year? A recent announcement has some hopeful.\nStar guard, Max Rice, has announced he's using his \"COVID year\" and is coming BACK!\nAt the end of the season, head coach Leon Rice said he's wanting to build a 'Super Team' and we can't wait to see what he pieces together from recruiting and the Transfer Portal!\nBoise is no stranger to great basketball games! Just weeks ago, downtown Boise hosted the Big Sky Conference championship games and an insane buzzer beater put the game front and center on ESPN!\nInsane Big Sky Basketball Moment Makes National Headlines\nGallery Credit: Credit: Mateo, 103.5 KISS FM\nOf all the folks who get praise within Boise State's athletic department, here's who we wish would get a little bit more:\nBoise State's Most Underappreciated Star\nGallery Credit: Credit: Mateo, 103.5 KISS FM\nThis Former Nampa Basketball Star is ESPN's Darling\nGallery Credit: Credit: Mateo, 103.5 KISS FM",
  "word_count": 298,
  "scraped_at": "2026-02-14T13:07:19.893638"
}