{
  "article_id": "06342bf4467f",
  "url": "https://www.westernpeople.ie/your-community/local-notes-kiltimagh-museum-needs-some-support_arid-69115.html",
  "title": "Local Notes : Kiltimagh Museum needs some support - Community",
  "date": "20250903T091500Z",
  "domain": "westernpeople.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Kiltimagh Museum was officially opened in the disused goods store of the old railway station on June 18th, 1989, by Thomas J Flatley, of Boston, an emigrant from the area.\nMr Flatley, who died in 2008, left Kiltimagh, aged 19, in 1950, with a £20 note in his pocket and made millions in the US through property development. He was a substantial benefactor to the initial museum project.\nToday the museum looks tired and is need of some attention. It is opened by appointment, by a team of volunteers, most notably Monica Browne, Martina Foley and Basil Burke. They respond to phone calls and online messages, and open the facility and show people around, as required. It is likely many passers-by would visit the museum if it had regular opening hours, but don’t bother to ring up from outside the door.\nThe volunteers, whose input has been exemplary, can’t be expected to open the place daily, but that doesn’t take away from the fact that the museum should have regular visiting hours. This is an ideal project for CE, Tús or RSS support and it is a shame that personnel from one or more of these schemes isn’t available to operate, what is a key component of the cultural capital of the town. It is also a shame given that a number of such schemes are headquartered in the town.\nKiltimagh is unique in that while it might not be one of the biggest towns in the county, it has an impressive catalogue of cultural attractions including the theatre, the emigrant park, the sculpture park, the poetry trail, the Velorail and the old forge. The museum doesn’t need much direct financial investment; the roof seems good and the building is dry and is home to many valuable historic artefacts. What it does need is a dedicated worker or two, who would meet visitors within set daily opening hours.\nIt is important in towns the size of Kiltimagh that all organisations and community leaders are facing the same direction and working together to promote all the various amenities a town has to offer. Kiltimagh has punched above its weight culturally for many years, and while new additions to the cultural stock of the town are always welcome, keeping those already established is important too.\nDespite leading by five points at half-time, Kiltimagh were beaten by Tourmakeady in the Treanlaur Catering Mayo GAA Junior Football Championship on Sunday week last. The match was the first championship game played at the recently realigned Gilmartin Park with the new 242-seat cantilever stand in use, mainly for shade from the sun on a beautiful summer’s day.\nThe grounds and facilities at the pitch are magnificent, and a credit to the committee that delivered the project, the contractors who did the work, and those that helped fund the endeavour. On the day, members of the club were on hand to facilitate orderly parking and the whole event ran very smoothly. It was a great day for the club and the community of Kiltimagh.\nExcept for the result.\nThe irony was that Tourmakeady’s main man, their captain, was former Kiltimagh marquee forward, Ronan Malee or Rónán O Maol Aoidh as he was named in the programme – Tourmakeady being in the Gaeltacht and all that.\nRonan was quiet enough until he picked up an injury with about ten minutes to go. I’m not sure was it vex at the knock he got, or was it a spray of Easy-Start applied by team medic, David Cameron, that got him fired up, but he ended up with a personal tally of 1-4, including a devastating goal (from a Kiltimagh perspective) near the end that sealed the victory.\n“It was a surreal week, leading up to the game,” Ronan told the\n. “Especially with the new pitch. I played in the last game played on this pitch, three or four years ago with Kiltimagh, so I didn't think it would transpire that I'd be back, especially with Tourmakeady!”Ronan is living in Tourmakeady now, and after retiring from Kiltimagh, didn’t expect he’d play championship football again.\n“After I retired I played soccer for a few years. I was lucky enough to captain a good Kiltimagh Knock United side for a couple of years.\n\"I stepped away from that this year, just with building a house over in Tourmakeady, and that's where my life is now and is going to be. My brother-in-law is on the management committee of Tourmakeady GAA club, and he invited me in to the panel when I went out and trained with them.\n\"It’s a great way to meet a few lads moving into the area, and that probably what was the main reason I lined out for them today. It was nothing to do with not wanting to play with Kiltimagh. It was just that's where my life is now.”\nRonan’s performance on Sunday week was well received by the Kiltimagh crowd – no grudges were borne visibly – and he received a warm round of applause as he left the pitch with his new teammates at the end of the game.\nI mentioned the irony of scoring against his old club in such an important match.\n“I gave probably close to 17 or 18 seasons with Kiltimagh. And I genuinely thought I had retired. I probably should have scored more against them today! I had a goal chance at the start of the second half as well that I'd be disappointed not to have scored.\n\"But that was something we worked on all year, that back-post goal. And luckily, it was just a turnover and we got in for a goal.\n\"We were underdogs today. We knew we had the workrate. We have good enough footballers. We've worked their system, what we want to play. We have a good gang of young fellas there, minors. But we're not through yet. We have to beat Kilmovee and try and get a home quarter-final and we go again. Nothing's won today.”\nI asked Ronan about Kiltimagh’s dominance of the first half and the fact that Tourmakeady didn’t score for the first 20 minutes.\n“The wind played a factor. We went in at half time five points down but that isn’t so much anymore with the two-pointers, and we thought at half-time we were in a fairly good spot.\nWe'd turned over the ball a good bit that we weren't happy with, unforced. But we got the scores and we just chipped away at it. The more and more as the game went on, the more and more we were wearing them down.\n\"We pride ourselves on our fitness. We dogged ourselves very early in the year and it stood to us today. And we’ve got a good core squad. The boys that came in did the job. It's a squad game and we just reset and go again for the next day.”\nRonan is building a house in Tourmakeady and hopes to be in residence at the end of the year. He’s still a fine footballer and was the difference between the two sides on Sunday week last.\nKiltimagh’s final game in the group stages of the championship will be against Northern Gaels at a neutral venue on this Saturday, September 6th.\nIt wasn’t all bad news in Kiltimagh GAA circles last week. The club had five winners in the Cairde Mhaigh Eo GAA Club Development Draw.\nAileen and Declan Shannon won yet again, alongside Frank McNicholas, Todd O’Mahony, Sinéad Higgins, and Noelle Kilduff and Cariosa Buke. All won €200 each.\nThe club extended its congratulations to the winners and sincere thanks to all who purchased tickets.\nKiltimagh Women’s Group will resume its meetings in the Parish Centre on Monday, September 8th, at 7pm. This will be the first gathering after the summer break.\nA guest speaker will give a talk on acupuncture and health, and further talks are planned for the coming months. All women in the community are welcome to attend.\nAnother enjoyable evening of cards was held at the weekly 25 Card Drive, with a fine turnout and plenty of competition right to the end.\nFirst prize on the night went to the pairing of Michael Costello and Danny Doherty, whose steady play saw them finish out in front. In second place were Chris Flatley and Manus Kilcoyne, while third prize was claimed by Jack Ryan and Alo Langan.\nThe 'Last 10' prize was shared between Mary and Richard Carney, and John Clancy and Pius Forde, after both pairs finished strongly. The spot prize went to James Walsh and Paddy Carney.\nRaffle winners on the night were Mary Doyle, Hugh Forde, Michael Costello and Jack Pidgeon.\nKeith Lydon came out on top in Round 13 of the Summer Poker League at Teach O’Hora, overcoming long-time rival John Reynolds in the heads-up finale. Paul Walsh finished in third place, with the other finalists being Nigel Maughan (4th), Michael Sheridan (5th), Nicky Cunnane (6th), Alan Sheridan (7th), Kieran McGee (8th), and Gerry Groarke (9th).\nDespite finishing runner-up on the night, Reynolds extended his lead at the top of the overall league table, where he now sits on 253 points. He holds a commanding advantage over Michael Higgins, who lies in second place on 228 points. The rest of the current top twelve are: AN Other 1 (208), Derry O’Sullivan (207), Michael Sheridan (195), Kieran McGee (183), Keith Lydon (179), Gerry Groarke (176), AN Other 2 (174), Pat Boyle (168), Enda Ruane (167), and Nicky Cunnane (159).\nKiltimagh GAA Club’s 50/50 draw brought a special win last week when four-year-old Frankie McNicholas claimed the jackpot of €656.\nThe death has occurred of Martin Joe Gill of Cloonmore, Ballyfarna, who passed away peacefully at home on August 23rd, with his family by his side.\nIn his 92nd year, Martin Joe was predeceased by his parents Martin and Bridget and his sister Maureen (Walsh, Kiltimagh). He will be sadly missed by his wife Maureen, son Joseph, daughter Margaret (Regan), son-in-law Pat, and his adored grandsons Darren and Ronan. He is also survived by his sister Tess (O’Boyle), brother John P. (Manchester), nephews, nieces, cousins, extended family, neighbours and friends.\nMartin Joe’s remains reposed at the Marian Funeral Home, Knock on Monday evening, with Funeral Mass on Tuesday afternoon in the Church of Our Lady, Barnacarroll, followed by burial in Barnacarroll Cemetery.\nMay he rest in peace.",
  "word_count": 1737,
  "scraped_at": "2026-02-14T12:20:16.967776"
}