{
  "article_id": "06358559ff77",
  "url": "https://news.yahoo.com/tjds-legacy-really-wants-player-223741952.html",
  "title": "TJD legacy ?  He really wants to be a player that brings Indiana basketball back . ",
  "date": "20230317T000000Z",
  "domain": "news.yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "TJD's legacy? 'He really wants to be a player that brings Indiana basketball back.'\nALBANY, N.Y. – Trayce Jackson-Davis jogs backward onto the MVP Arena floor, smiling as he beckons his teammates to follow him.\nThe No. 4-seed Hoosiers are about to begin their open-practice session here in the New York capital, before Friday’s first-round NCAA tournament game against Kent State. A smattering of fans cheer, as an instrumental rendition of the school fight song blares loudly across the arena stereo system.\nThis will be the 28th different arena floor onto which Jackson-Davis, one of the most-productive players in program history, has stepped in Indiana colors. For at least four days, it might be Jackson-Davis’ last.\nWhat will IU see from Kent State? We asked coaches who faced the Flashes.\nNCAA tournament picks: IU gets mixed reviews heading into March Madness\nHow do you contextualize a career so unlike so many others in the history of a basketball program that has its share of legends? Where does Trayce Jackson-Davis figure on your Indiana basketball Mount Rushmore? Has he already proven all he needs to? Do you want hardware in the cabinet first?\nWhen you can reduce his points and rebounds and blocks and wins and losses down to this — a player who committed to and stuck firmly with his team through four years, despite multiple opportunities to seek something better for himself at the expense of his team — how much does the rest of it matter? Has Jackson-Davis given IU everything required already?\n***\nTwo meetings, both in the spring of 2021, helped shape Jackson-Davis’ legacy in ways nothing on the court could, because nothing on the court would have happened without them.\nThe first, Scott Dolson remembers vividly. IU’s athletic director had just gathered the funding necessary to buy out Archie Miller’s contract, and fire Miller after four seasons in Bloomington.\nJackson-Davis was one of Miller’s prized recruits, a McDonald’s All American who routinely made unofficial campus visits by himself before he’d even committed to Indiana. Across two years playing for Miller, Jackson-Davis had grown into one of the best big men in the Big Ten, and now Miller was gone.\n“I remember talking to him,” Dolson told IndyStar on Thursday referencing that meeting. “I said, ‘Just hang in there, and I think we’re gonna bring in a coach that’ll be really good for you, good for us, good for our program.’\n“He just looked right at me and said, ‘I got you.’”\nWith the benefit of hindsight — sometimes it’s required — that decision charted a lot of what came next.\nJackson-Davis never entered the transfer portal across four seasons at Indiana. He only tested the NBA draft waters once. Yet too many times, people around him have vaguely mentioned his options outside Bloomington. Dolson even made a casual reference Thursday to “where were we gonna go in terms of where are we gonna go with the next head coach, but also what’s next for him?”\nHad Jackson-Davis decided to leave, no one would have blamed him. His coach certainly wouldn’t have.\nMike Woodson understood from his earliest hours as head coach of his alma mater that his first and most important recruiting battle was keeping his star forward in his locker room.\nWhen Woodson sat down with Jackson-Davis and his father, Ray, that same spring, practically every option imaginable would have been on the table for a 6-9 forward who’d just averaged 19 and nine as a sophomore in one of the toughest conferences in the country.\nWhatever Jackson-Davis and his father were expecting walking into that meeting, Woodson surprised them when he pressed play on film not of all the ways he wanted to sell Jackson-Davis on how he would fit into his system, but of all the ways Woodson believed Jackson-Davis needed to improve.\nDolson had promised Jackson-Davis a coach who would be good for him, and now, here he sat, in front of a man who had coached the Hawks and the Knicks, who had Carmelo Anthony in his corner, who was telling him not what he was, but what he wasn’t — and perhaps most importantly, what he could be.\nJackson-Davis not only reaffirmed his intention to stay with the Hoosiers that spring, he didn’t even enter the NBA draft to get scouting feedback. His feet and his soul were both grounded firmly.\n“All I can say to you, it's been everything to our program,” Woodson said. “Had he left, to me it would have been just like starting all over again, being a first time coach. For him to make the commitment to come back, it really set the stage for where we are today, because he didn't have to do that.”\n***\nJackson-Davis doesn’t care to talk very much about himself anymore. For months now, he’s deferred questions about his accomplishments in favor of addressing his whole team, and he’s downplayed awards and national honors to talk about winning the big prizes in an Indiana uniform.\n“I really don't think about it that much honestly,” he said Thursday. “I always just think about being there for my teammates, just taking it all in, and just taking it one game at a time.”\nThat hasn’t stopped everyone around him from talking about, thinking about and generally living in the discussion of his legacy. Other than how deep the Hoosiers can run into March, in Woodson’s second NCAA tournament berth in as many seasons, there is no discussion that dominates Indiana’s sphere of influence like this one.\nJackson-Davis’ decision to return prompted a wave of teammates to pull out of the portal and recommit to Woodson as well. His choice to come back last season, after a positive COVID-19 test held him out of the NBA combine, lent this season the substantial promise that still exists if the Hoosiers can make this a memorable March.\nAlong the way, Jackson-Davis also set IU career records for rebounds and blocks, and he’ll end his career — which he’s adamant about calling time on after this season, despite having a COVID-allowed fifth year available — third in program history in points.\nHe’s been a team captain twice, and a department cheerleader. A fairly regular face at women’s basketball games who openly encourages other Indiana programs on social media and has a brother in the football program now, it has seemed to matter increasingly to Jackson-Davis, as he’s grown older, that he is an IU athlete, not just an IU basketball player.\n“I could talk forever about Trayce,” Dolson said. “He symbolizes everything we want in a student-athlete. For him to really hang with us through a challenging time, as we try to get Indiana basketball back, for him to make that commitment to do that has been incredible.\n“For a player that always had a lot of options, he’s just dedicated himself. He really wants to be a player that brings Indiana basketball back. And at the same time, the whole athletic department, the whole university means something to him.”\n***\nWhat is “back” for this program? A national title? A Final Four run? This story is filled with questions lacking universally agreed upon answers. That’s the nature of legacy, and the nature of sports.\nIU will change dramatically after this season, whenever it ends. Jackson-Davis and, in all likelihood, Jalen Hood-Schifino will both head for the NBA. Race Thompson and Miller Kopp are out of eligibility. Xavier Johnson will seek one last year of it via a hardship waiver, but after appearing in 11 games this winter before breaking his foot, that’s by no means certain.\nIn the portal era, when cycles can develop in a matter of weeks and teams can be built from the ground up in one offseason, no program truly starts over anymore if it’s not allowed to.\nSo again, we ask: What is Trayce Jackson-Davis’ legacy?\nDoes it require trophies? If so, the margin for error is now painfully thin. Jackson-Davis will end his career without any Big Ten championships on his resume, and No. 13 Kent State marks the beginning of what will be a difficult NCAA tournament journey for a high-seeded but undeniably flawed Indiana team.\nSo, what has Jackson-Davis proven by staying these past two years, by buying in over and over?\nHe’s done some winning. He’s returned Indiana to the NCAA tournament. And he’s gotten substantially better even than he was after that sophomore season, perhaps even transforming himself into a late-first round pick. He’s proven Woodson’s methods can bring out the best in players who invest in them, a crucial commodity at a level of the sport that’s defined by player development.\n“I would be stupid to sit here and say that I don't want the best for my players because I don't think there's a coach in the world that doesn't want the best for his players,” Woodson said. “I only coach one way, and it's hard for me to change. I push players to play at a high level. That's important to me.\n“In doing that, you learn how to be a better basketball player. I have a track record for that. So I thought last season was a great season for him, and this season he's kind of knocked it out of the park because we've rode him all the way to this point.”\nIf they can ride him no further, then Jackson-Davis will end his career without the one thing he craves above all else. He ended his senior day speech by gesturing toward the five national-championship banners that hang inside Assembly Hall and saying it was time to add a sixth. It would for many fans cement his legacy as a program legend, but it is also his last chance to put a trophy in his program’s considerable cabinet. More existentially, it’s also his last chance to have a tangible impact on whether IU basketball climbs back to the lofty heights it once knew.\nHe says he doesn’t think about those sorts of things, but from time to time he still talks like a player who does. Finality is a part of sports, at every level. The end is the only thing promised to everyone.\n“We’ve accomplished a lot,” Jackson-Davis said Thursday, “but our story’s not finished.”\nPerhaps it isn’t. But even under the most-ideal circumstances, it is close enough to touch.\nThere have been so many arenas, so many late-night flights and early morning workouts and press conferences and pregame layup lines. No matter where this season finishes, Jackson-Davis only needs two hands to count the rest of it.\nWhat will be his legacy? Who gets to define that? Does it have to be something we can hold in our hands? Or is it enough that Jackson-Davis gave so willingly of himself for four years, bought into something bigger, then came to loudly, proudly represent it, put the whole before himself time and again, and still realized considerable personal achievement along the way?\nWhat makes an athlete — what makes a man — great, if not those things?\nFollow IndyStar reporter Zach Osterman on Twitter: @ZachOsterman.\nThis article originally appeared on Indianapolis Star: IU basketball: Trayce Jackson-Davis legacy missing March Madness run",
  "word_count": 1875,
  "scraped_at": "2026-02-14T13:07:39.080423"
}