{
  "article_id": "0645797808fd",
  "url": "https://www.offalyindependent.ie/2023/09/19/jenni-hermoso-accuses-spanish-fa-of-intimidation-and-threats-after-call-ups/",
  "title": "Jenni Hermoso accuses Spanish FA of  intimidation  and  threat after call - ups",
  "date": "20230919T100000Z",
  "domain": "offalyindependent.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Jenni Hermoso accuses Spanish FA of ‘intimidation’ and ‘threats’ after call-ups\nBy PA Sport Staff\nJenni Hermoso has accused the Spanish football federation of ‘intimidation’ and making ‘threats’ after the governing body called up a host of players who asked not to join up with the women’s national team.\nHermoso was not selected in Spain’s first squad since lifting the Women’s World Cup, but 15 of her title-winning team-mates were included in the 23-player group named on Monday despite announcing a boycott last month.\nThat followed the storm created by RFEF president Luis Rubiales kissing midfielder Hermoso on the lips as Spain’s players celebrated their World Cup final win against England on August 20. Hermoso insists she did not consent to the kiss.\nNew Spain head coach Montse Tome said Hermoso had been left out of the latest squad for her own protection during a press conference, while there was a fresh twist on Monday evening when players released a statement refusing their call-ups.\nHermoso then released a separate statement on social media, saying the RFEF has demonstrated that nothing has changed since Rubiales resigned from his post last week.\nThe 33-year-old posted in the early hours of Tuesday: “We have spent weeks, months, searching for protection from inside the RFEF that never came.\n“The same people who ask us to trust them are those who today announced a squad with players who asked NOT to be called up.\n“The players are certain that this is yet another strategy of division and manipulation to intimidate and threaten us with legal repercussions and economic sanctions.\n“It is more irrefutable proof that shows even today, that nothing has changed.”\nShe added: “I would like to make something very clear: A claim was made today stating the environment within the federation would be safe for my team-mates to rejoin, yet at the same press conference it was announced that they were not calling me as a means to protect me.\n“Protect me from what? And from whom?\n“I want to once again show my full support to my colleagues who have been caught by surprise and forced to react to another unfortunate situation caused by the people who continue to make decisions within the RFEF.\n“This is why we are fighting and why we are doing it this way.”\nA group of 81 players, including all 23 members of the World Cup squad, indicated three weeks ago that they would not play for Spain again while Rubiales remained RFEF president as a result of his behaviour at the final.\nAmid increasing pressure, Rubiales finally resigned from his post last week but 39 players, including 21 of Spain’s World Cup winners, released a statement on Friday saying that was not enough to trigger their return to national-team duty.\nThe players said they were not yet “in a safe place” to return and that the problems at the RFEF ran far deeper than Rubiales.\nRubiales has been banned from going within 200 metres of Hermoso as the national court in Madrid considered a complaint of sexual assault – something the 46-year-old denies.\nTome had been due to name her squad on Friday, but the announcement had to be delayed.\nBarcelona’s Mapi Leon and Patri Guijarro, who were not included in Spain’s World Cup party after signing a letter protesting against former manager Jorge Vilda, who was sacked during the fallout of Rubiales’ actions, were listed in Monday’s squad.\nTome said Spain were still “counting on” Hermoso, despite her omission.\n“We stand with Jenni,” she told a press conference. “We believe that the best way to protect her is like this, but we are counting on Jenni.\n“It’s the start of a new phase, the clock is ticking. There is nothing behind us and we really want to connect with these players.”",
  "word_count": 636,
  "scraped_at": "2026-02-14T13:50:53.188091"
}