{
  "article_id": "06740c9e01d7",
  "url": "https://www.arsenal.com/news/renee-praises-quality-and-intent-leicester-win",
  "title": "Renee praises quality and intent in Leicester win",
  "date": "20251102T201500Z",
  "domain": "arsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Renee Slegers was pleased with the quality we showed in a dominant 4-1 win over Leicester City in the Barclay's Women's Super League.\nAlessia Russo opened the scoring and set up an own goal before two fine strikes from Stina Blackstenius secured three points at the King Power Stadium. After our third straight victory, Renee provided her assessment on the game.\n\"Very happy with the three points, I think we had two days to get back to training from the international break and a lot of well invested time, together as players both on and off the pitch,\" our head coach said after the game, \"we had some new partnerships on the pitch today as well so that needs to click but I think it did really well, especially in the first half.\n\"The way we do things in possession made it really hard for Leicester today I think, but you'd have to ask them. We had quality, we had intent, we had tempo and a lot of fluidity in the way we moved and attacked spaces.\n\"I saw a lot of players playing on a really high level and to their strengths so that was good. I'm really happy with the game and three points to start this block.\"\nWith the likes of Olivia Smith and Frida Maanum absent for Sunday's game after sustaining injuries on international duty, Renee felt that those stepping into the team gave a good account of themselves.\n\"Yeah, I'm very happy with that. Credit to the players. Even though you haven't started much or haven't played much, you'll always need to be ready and the players were ready today.\n\"It shows how much they've invested and how hard they've worked in the background so I'm really happy.\"\nAlthough we didn't secure a third consecutive clean sheet, we scored our fourth goal of the afternoon less than a minute after conceding, a response our head coach was delighted with.\n\"Very important (to respond), I think that as well today the goals that we score in the first half, we score in moments that we are dominant and that's important for us but then also I thought there was so much strength.\n\"We conceded one goal but then, like you said, a minute after that we score again, so I'm really happy with a lot of things. Today was, it always is, but today you could see that it was a real team performance with different players contributing today, so I'm really happy.\n\"On top of that we spoke about what we want to feed to each other and the energy that we want to bring, but also always staying connected to the fans and representing what Arsenal and the fans as well and what they want to see and I think that we showed some really good football, the Arsenal way and the fans were fantastic today.\n\"Hopefully we fed them, but definitely they are feeding us.\"\nWhile over 1,500 Gooners made the trip to Leicester this weekend, there will be quite a lot more at Emirates Stadium for next weekend's meeting with Chelsea, and Renee is looking forward to being back in front of our home crowd.\n\"Incredible, I think 55,000 tickets sold already so it's going to be amazing. We look forward to the occasion and we know how invested they are and we're going to do everything we can to make that Emirates Stadium really special on Saturday.\"\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 603,
  "scraped_at": "2026-02-14T12:44:17.165989"
}