{
  "article_id": "06ba88cbaf8a",
  "url": "https://freerepublic.com/tag/*/index?more=4314565",
  "title": "Latest Articles",
  "date": "20250502T124500Z",
  "domain": "freerepublic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Search:\nKeywords\nUsers\nTitles\nYahoo\nHome·\nSettings·\nBreaking ·\nFrontPage ·\nExtended ·\nEditorial ·\nActivism ·\nNews\nPrayer PrayerRequest SCOTUS ProLife BangList Aliens HomosexualAgenda GlobalWarming Corruption Taxes Congress Fraud MediaBias GovtAbuse Tyranny Obama Biden Elections POLLS Debates TRUMP TalkRadio FreeperBookClub HTMLSandbox FReeperEd FReepathon CopyrightList Copyright/DMCA Notice\nMonthly Donors · Dollar-a-Day Donors · 300 Club Donors\nor by or by mail to: Free Republic, LLC - PO Box 9771 - Fresno, CA 93794\n-\nJussie Smollett and City of Chicago Reach Settlement In Lawsuit Over Hate Crime Hoax\nHate crime hoaxer Jussie Smollett and the city of Chicago have reached a settlement in the lawsuit stemming from the phony 2019 attack, according to a report. Smollett and the Windy City announced they have reached a settlement in the Midwestern metropolis’ $130,000 lawsuit that accused the former “Empire” actor of filing a false police report, according to NBC. The details of the settlement have yet to be announced, with both parties saying they “need more time to finalize documentation,” the outlet reported. The city filed suit against the “Mighty Ducks” alum in January 2019 after his claim to be... -\nBell: Albertans will get a vote on Alberta independence — bet on it, baby! (It’s happening!)\nThere will be a vote by Albertans on Alberta independence. Everyone who has their ear to the ground agrees. They say you can bet the farm on it. And just the fact there is an almost-certain vote on Alberta independence looming on the horizon will be a message heard across the country and right into the office of Prime Minister Mark Carney. You see, under changes being brought in by Alberta Premier Danielle Smith, the question of Alberta independence from Canada will be put to a vote of Albertans if the following happens. If a total of 177,000 Albertans, names... -\n\"Six to Swing\" - original jazz, by Yours Truly\nMy latest song. Start swinging! -\nExplosions heard in Crimea, peninsula heavily attacked by drones\nPowerful explosions are heard in many cities in Crimea, with eyewitnesses reporting attacks and strikes on military airfields in Sevastopol and Novofedorivka, according to the Telegram channels Krymskyi Veter and the partisan movement ATESH. According to eyewitnesses, around midnight Kyiv time, a powerful explosion occurred in the Feodosia area near the Crimean market. Later, public pages reported the launch of at least 15 drones from Cape Chauda. At 00:41, a loud explosion was heard on the northern side of Sevastopol, and at 01:08, there was an explosion near the airport in Simferopol. In Sevastopol, the Russian authorities reported the alleged... -\nUkraine DECLARES VICTORY as Russia’s Pokrovsk Plan CRUMBLES\nVIDEO: WOW! \"Ukraine DECLARES VICTORY as Russia’s Pokrovsk Plan CRUMBLES\" The Military Show 1.62M subscribers 5-1-2025 5:00 P.M. Video Length 20:47 https://www.youtube.com/watch?v=VxfH_AXunJM \"Russia’s long-running plan to seize Pokrovsk has collapsed. On April 30, Ukraine declared victory in the city, with the Ukrainian Center for Security and Cooperation confirming that Russian forces failed to capture the settlement despite concentrated efforts. Commander-in-Chief Oleksandr Syrskyi previously noted that some of Russia’s best military units were deployed to take Pokrovsk. Their failure marks a major defensive success for Ukraine at a time when the eastern front remains highly contested. This Pokrovsk win also blocks... -\nTrump seeks to rechristen ‘Victory Day’ holidays in US\nUS President Donald Trump on May 1 expressed his intent to rename two US holidays to “Victory Day” in his latest attempt to alter the country’s nomenclature. “I am hereby renaming May 8 as Victory Day for World War II and November 11 as Victory Day for World War I,” he wrote on his Truth Social platform. -snip- “Many of our allies and friends are celebrating May 8 as Victory Day, but we did more than any other country, by far, in producing a victorious result on World War II,” Mr Trump’s post said. - snip- “We won both wars,... -\nReform UK Wins One\nReform UK has won the first by-election of the new parliament in Runcorn and Helsby, beating Labour by just six votes. The vote was triggered in Labour’s 49th safest seat after Mike Amesbury, the former Labour MP, received a suspended prison sentence for punching a constituent. After a recount was called in the early hours of Friday, it was announced that Reform’s Sarah Pochin had won 12,645 votes, while Labour’s Karen Shore won 12,639. The Tories won just 2,341 votes. It comes as votes are being tallied in council areas across England. Reform are looking to gain the mayoralties of... -\nA Witch Hunt at the State Department\n\"Esteemed Comrades of the Ministry of Foreign Affairs! Today we ask you to review your files for any communications you may have had with unreliable elements who are critical of our Party and our leader. If you have had contact with journalists, researchers, or other subversives, we ask you to report these interactions in full to the senior comrades responsible for the important work of ideological vigilance. Also, please also indicate if you have encountered any suspicious use of the following terms…\" That’s not actually how Acting Undersecretary of State Darren Beattie communicated his request for information - snip =,... -\nTrump believes Mike Waltz will ‘make a better UN ambassador’ after being ousted as national security adviser, JD Vance claims\nPresident Trump removed Mike Waltz as national security adviser because the Floridian would be a “better UN ambassador,” Vice President JD Vance said Thursday — arguing that the former congressman’s nomination to rep the US in Turtle Bay could be considered a “promotion.” “We brought Mike on to do some serious reforms of the National Security Council. He has done that,” Vance told Fox News “Special Report” host Bret Baier. “I like Mike. I think he’s a great guy. He’s got the trust of both me and the president, but we also thought that he’d make a better UN ambassador... -\nTennessee highway patrol releases body-cam footage of 2022 traffic stop with Kilmar Abrego Garcia\nThe footage appeared to show highway patrol troopers being concerned that the illegal migrant was involved in human trafficking because he had eight other people in his car. He also kept changing his story, and possessed $1,400 in cash. The Tennessee Highway Patrol on Thursday released its bodycam footage of a traffic stop interaction it had with alleged MS-13 gang member Kilmar Abrego Garcia in 2022. Abrego Garcia was deported by the Trump administration earlier this year, but has become the face of one of the biggest deportation cases in recent history. Democrats have argued that Abrego Garcia was a... -\nU.S. Payoff for Ukraine Minerals Deal Faces Many Hurdles\n...ending the war with Russia that has been raging for more than three years is only the first hurdle that will need to be overcome before the United States can realize any potential windfall. Maps showing trillions of dollars of mineral deposits scattered across Ukraine — including in areas occupied by Russian forces — are based largely on outdated studies, and proper surveys could take several years to complete, experts said. The deposits might not be easy to extract; investors will need to pump billions into Ukraine to pull the resources from the earth. And the nation’s energy infrastructure —... -\nAMERICA PRAYER VIGIL (May 2, 2025) *PRAYER*\nJoin with fellow FREEPERS to pray for AMERICA: For those in Authority in Government, Family, Military, Business, Agri-Business; End to Sex Slavery; Healthcare, Education, Churches, and the Media.Forum threads labeled [Prayer] are closed to debate of any kind. -\nCommon Antibiotic Fights Lyme Disease Without Wrecking Your Gut Health\nDeer ticks, like the one photographed, can carry Lyme disease/ (KPixMining/Shutterstock) In a nutshell * The antibiotic piperacillin has shown remarkable effectiveness against Lyme disease-causing bacteria, Borrelia burgdorferi, at doses 100 times lower than doxycycline, the current standard treatment. * Unlike doxycycline, which affects beneficial gut bacteria, piperacillin targets only the Lyme bacteria without disrupting the microbiome, making it a safer option, especially for children and pregnant women. * The discovery opens the door for piperacillin to be repurposed as a highly effective treatment for Lyme disease, potentially even as a single-dose preventive therapy after a tick bite. Further research... -\nWhite House launches its own Drudge-style news aggregator\nHave you or a loved one lost your connection with the Drudge Report due to the overwhelming Left lean the news aggregator has taken as of recent? Well, I have great news: The White House has launched their very own Drudge Report, called \"The White House Wire.\" https://www.whitehouse.gov/wire/ So now, instead of scrolling the Drudge Report itself and being bombarded with anti-Trump leftism, you can log onto The White House Wire and get stories like this: And these: The site needs a little work to match the format of Drudge, but it'll get there. The White House Wire is a... -\nEnglish Football Association to ban transgender women from women’s soccer\nTransgender women will be barred from playing in women’s soccer in England from June 1, the English Football Association (FA) announced on Thursday. “We understand that this will be difficult for people who simply want to play the game they love in the gender by which they identify, and we are contacting the registered transgender women currently playing to explain the changes and how they can continue to stay involved in the game,” the organizing body for soccer in Britain said in a statement. The FA clarified to CNN Sports that this ban will impact all levels of women’s soccer,... -\nChina says it’s evaluating the possibility of trade talks with the U.S.\nChina said it is evaluating U.S. overtures to initiate trade negotiations, potentially paving the way for the world’s two largest economies to start talks to resolve a trade war that has rumbled financial markets and cast a pall on global economic activity. Senior U.S. officials have reached out recently “through relevant parties multiple times,” hoping to start negotiations with China on tariffs, a spokesperson for the commerce ministry said in a statement Friday. While assessing the possibility of starting any negotiations, Chinese authorities reiterated Beijing’s request for the U.S. to remove all unilateral tariffs. Failure to do so would indicate... -\nWhat We Know About The Illegal Immigrant Allegedly Helped By A Wisconsin Judge To Evade ICE\nThe man arrested by immigration authorities in Milwaukee - despite a Wisconsin judge’s alleged attempt to shield him - is being held in a neighboring county’s jail as controversy continues to swirl around the case.Eduardo Flores Ruiz, 30, was locked up in the Ozaukee County Jail awaiting further court action as of April 30.He is accused of injuring three people in a recent domestic dispute, online records show.The Mexico native is the defendant whom Judge Hannah Dugan is accused of assisting in an April 18 incident at the Milwaukee County Circuit Court.Flores Ruiz appeared at the court for a hearing... -\nHHS Releases 400-Page Report on Gender Affirming Care\nThe Department of Health and Human Services released a 400-page report today titled \"Treatment for Pediatric Gender Dysphoria.\" The report only addresses treatment for those 18 and under and appears to follow the UK's Cass Review in recommending more therapy for children and less use of medical intervention, such as puberty blockers and hormones.The 409-page Health and Human Services report questions standards for the treatment of transgender youth issued by the World Professional Association for Transgender Health and is likely to be used to bolster the government’s abrupt shift in how to care for a subset of the population that... -\nLate Breaking News: President Trump Signs “Ending Taxpayer Subsidization of Biased Media” Executive Order to Defund NPR and PBS\nIn a stunning new development, President Trump has signed a sweeping executive order defunding National Public Radio (NPR) and Public Broadcasting Service (PBS), the Democrats’ taxpayer-funded leftist propaganda machines. As The Gateway Pundit reported, the president previously called on Congress to defund the absurdly dishonest “news” organizations following a House Oversight DOGE subcommittee hearing, which exposed the stations’ already well-known bias and radical content. This includes documentaries about transvestites and transitioning, a documentary about “Racist Trees,” and so-called educational programming for young children, including toddlers, that featured a cross-dressing freak. They have continued pushing false narratives, especially about the Trump... -\nVice President JD Vance Explains Mike Waltz's Removal As National Security Advisor—It's Not What You Think It Is\nFormer Army Special Forces officer and Republican Florida representative Mike Waltz was removed from his post as national security advisor to President Trump Thursday. The spin from the leftist media was immediately that he was fired over his role in the “Signalgate” non-scandal—but Vice President JD Vance says that’s just not so. Waltz was almost immediately announced as the new ambassador to the United Nations, and in an interview with Fox News’ Bret Baier, Vance said that it should be considered a “promotion,” not retribution for the Signal brouhaha. He’s done his job, the VP said:President Trump removed Mike Waltz...\nBrowse by Forum\nGet Connected! Join Free Republic Today!\nAlready a Member? Log into your Free Republic account.\nBreaking News (News/Activism)\n- Dear FRiends, our FReepathon has fallen way behind. Please get your donations in as soon as you can. Thank you and God bless.\n- Sunday Morning Talk Show Thread 8 February 2026\n- The MAGA/America 1st Memorandum ~~ February 2026 Edition\n- Senate strikes deal to avert partial shutdown\n- US Border agents shoot two people in Portland, city officials say\n- Minnesota Gov Tim Walz to suspend re-election campaign amid Somali fraud scandal: report\n- One in custody after incident at Ohio home of JD Vance\n- Caracas, VenezuelaJanuary 3, 2026 6:30 AMUpdated: January 3, 2026 1:12 PMU.S. captures Venezuela's leader and his wife in a stunning operation and plans to prosecute them\n- President Trump says Maduro and his wife have been captured. A news conference will be held at 11 A.M\n- The MAGA/America 1st Memorandum ~~ January 2026 Edition\n- More ...\nFront Page News (News/Activism)\n- 'You exposed him to real danger': Father goes nuclear on school board after teachers sent his son to ICE protest\n- House passes SAVE America Act, sending Trump-backed election bill to the Senate\n- Trump set to gut US climate change policy and environmental regulations: White House official\n- Less than 14% of those arrested by ICE in Trump's 1st year back in office had violent criminal records, document shows\n- Lawler: ‘Not Realistic’ to Kick Out Over 25 Million Undocumented People\n- Fact Sheet: President Donald J. Trump Ensures Affordable Beef for the American Consumer\n- Democrats fear body cameras could be ICE’s new mass surveillance tool\n- Migrant, 70, who told girl, 12, to 'cover her head' before sexually assaulting her on way home from school is spared jail\n- Associated Press Complains That Winter Olympics Teams Are ‘Overwhelmingly White’\n- Appeals court sides with Trump admin with mass detention ruling\n- More ...",
  "word_count": 2492,
  "scraped_at": "2026-02-14T12:11:39.672324"
}