{
  "article_id": "06d0902cf05a",
  "url": "https://www.burntorangenation.com/2024/2/9/24068068/longhorns-daily-news-texas-steve-sarkisian-cfp-sec-big-12-softball",
  "title": "Longhorns Daily News : This is all you need to know about Texa Steve Sarkisian :  I came here to win a championship  ",
  "date": "20240209T234500Z",
  "domain": "burntorangenation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Texas Longhorns head coach Steve Sarkisian’s determination to take the program to the next level is making headlines again. To no surprise, given the success of the 2024 recruiting class and what Texas has to look forward to in future recruits in 2025, too.\nLonghorns Daily News: This is all you need to know about Texas’ Steve Sarkisian: ‘I came here to win a championship’\nPlus: Texas softball opens with win over San Diego\n“I came here to win a championship,” Sarkisian said during a press conference earlier this week, per Inside Texas. “If I can get one, then I want to get two. I’m borderline obsessed with it at this point. I know what it tasted like last year. I know how close we were, and I couldn’t wait to get back. Hopefully, that’s what our team starts to exude, this obsession with being the best because we have a locker room full of young men that are driven, that are focused, that want to be the best.”\nSarkisian later added, “They want to be the best students that Texas football has ever had. They want to be the best team. They’re totally going for it, but that’s the challenge day in and day out.”\nWHAT THEY’RE SAYING ABOUT THE LONGHORNS\nAustin American-Statesman: Bohls: All GPS systems lead NFL to Austin and Texas football\nAustin American-Statesman: Have questions about Texas softball as the season swings into action?\nAustin American-Statesman: Rodney Terry, Texas basketball worried about West Virginia, not NCAAs\nInside Texas: Five Longhorns part of Pro Football Focus’ list of top 101 college football players in 2023\nInside Texas: What’s Texas’ best lineup?\nICYMI IN BURNT ORANGE NATION\nRECRUITING ROUNDUP\nAustin American-Statesman: Golden: Steve Sarkisian has Texas football rising in new recruiting era\n247Sports: Five positions of need for Texas in 2025\n247Sports: Watch: Texas signee Melvin Hills III talks new DL coach Kenny Baker, what kept him solid with UT\n247Sports: Recapping the nine Texas Longhorns football signees including in the final Top247 for 2024\nInside Texas: On3’s No. 3 OT Ty Haywood talks Texas, recaps recruitment\nInside Texas: The latest on dynamic Houston 4-star teammates\nBIG 12 BREAKDOWN\nOur Daily Bears: MBB Scouting Report: Kansas Jayhawks\nFrogs O’ War: 2024 TCU Baseball Preview: Catchers\nFrogs O’ War: 2025 TCU football recruiting news\nBring On The Cats: Have the Wildcats finally found the winning formula?\nVanquish The Foe: BYU-Kansas State Preview: Cougars open as double-digit favorites\nWHAT WE’RE READING\nSB Nation: Writing the ultimate Hallmark movie script for the Super Bowl\nSB Nation: How Travis Kelce’s 3 postseason touchdowns led the Chiefs to Super Bowl 58\nNEWS ACROSS LONGHORN NATION AND BEYOND\n- Texas women’s basketball takes on TCU tomorrow at 3pm Central.\n- Texas softball began their 2024 season today with a huge win over San Diego.",
  "word_count": 470,
  "scraped_at": "2026-02-14T13:39:15.864399"
}