{
  "article_id": "06ecd3214ba7",
  "url": "http://www.nationalaccordnewspaper.com/president-tinubu-first-lady-laud-oshoala-nigerian-women/",
  "title": "President Tinubu , First Lady laud Oshoala , Nigerian women National Accord Newspaper",
  "date": "20231229T060000Z",
  "domain": "nationalaccordnewspaper.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By DAVID IORJA, Abuja –\nPresident Bola Tinubu and First Lady Oluremi hosted Asisat Oshoala, Super Falcons striker and 2023 CAF Women’s Player of the Year, on Thursday in Lagos.\nPresident Tinubu and the First Lady congratulated the Barcelona Femeni star on winning the best African female footballer of the year for the sixth time.\nThey both commended Oshoala for distinguishing herself in the sport, applauding her significant contributions to women’s football on the continent.\n“Nigerian women will always have a pride of place in the world.\n“What our ladies have achieved in football, our women are achieving in all fields of endeavour around the world – rising to the top and demonstrating the best of the Nigerian character of excellence, tenacity, ingenuity, and resilience,” the President said in a statement by his spokesman, Mr Ajuri Ngelale.\nTinubu also recalled the feats of star sprinter, Tobi Amusan, and the presence of multiple Nigerian women on the Forbes 2023 World’s 100 Most Powerful Women’s List, including media mogul, Ms. Mo Abudu, and Director-General of the World Trade Organization (WTO), Dr. Ngozi Okonjo-Iweala.\nThe President and the First Lady assured Oshoala of the nation’s continued support for her and other Nigerian women striving for excellence in their chosen paths.\nSpeaking to journalists after the warm reception, Oshoala said: “I want to appreciate the President and the First Lady for giving me the opportunity to present the award to them.\n“During the last World Cup, we had a couple of issues, and they intervened and have been very supportive to the girls, even after the competition.”",
  "word_count": 263,
  "scraped_at": "2026-02-14T12:30:51.516700"
}