{
  "article_id": "06fded44941c",
  "url": "https://www.theverge.com/23743849/ted-lasso-season-3-review-apple-tv-plus",
  "title": "Ted Lasso season 3 review : big and unwieldy but stuck the landing",
  "date": "20230531T190000Z",
  "domain": "theverge.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In the opening episode of Ted Lasso’s third season, the perpetually cheerful coach (Jason Sudeikis) found himself stuck between two worlds: the desire to stay with his soccer club, AFC Richmond, in England and complete some unfinished business with a found family and his need to go back home to the US and be with a son who is missing him very badly. It provoked a full-on existential crisis — and as the season wore on, the show itself experienced something similar.\nTed Lasso’s third season was unfocused and unwieldy, but it stuck the landing\nThe third — and presumably final — season of the Apple TV Plus series was stuck between a sitcom and prestige drama but still managed to end on a high note.\nTed Lasso’s third season was unfocused and unwieldy, but it stuck the landing\nThe third — and presumably final — season of the Apple TV Plus series was stuck between a sitcom and prestige drama but still managed to end on a high note.\nWith ballooning episode run times that were overstuffed with plotlines, the show found itself somewhere between the sitcom it started out as and the prestige drama it seemed to want to be. The result was a show that was unwieldy at times, losing sight of the things that made it such a phenomenon to begin with, while taking some strange and unnecessary detours. Thankfully, while the finale was long and self-indulgent, it remained focused — and sent off Coach Lasso with a beautiful goodbye.\nThis review contains spoilers for all three seasons of Ted Lasso.\nNow, a lot happened in season 3. The dozen hour-plus-long episodes attempted to weave together a number of different threads in what seemed like an attempt from the writers to cram in as much as possible before it was over. Somehow, though, the season felt both too stuffed and like many of those threads were woefully underdeveloped. It made for an awkward beast of a show.\nThe focus on drama often meant that the laughs were hard to come by, while the spread-out storylines meant that key pieces of the drama — Nate’s (Nick Mohammed) dismissal as manager at rival West Ham, Coach Beard’s (Brendan Hunt) dark history, Keeley’s (Juno Temple) struggle with the fallout from a sex tape leak, or even how AFC Richmond somehow managed to win 15 straight games — were either not explored enough or, in some cases, like Nate’s firing, not even depicted on-screen. I sometimes felt like I missed an episode and was playing catch-up.\nThat’s not to say there weren’t great moments. A painfully hilarious training session involving red string had me in tears, and there were wonderful explorations of side characters, like watching Leslie (Jeremy Swift) espouse his love for jazz on a trip to Amsterdam or Dani’s (Cristo Fernández) surprising turn from supportive friend to cold enemy when his Mexico team took on Van Damme’s (Moe Jeudy-Lamour) Canada in a match. Yes, these were diversions that didn’t help the season’s bloat problem, but they were short, complete, and helped develop the cast in a natural way. But because the episodes were both so long and so unfocused, these highlights were muddled by a show that was just trying to do too much.\nAt first glance, the finale — with the appropriately unsubtle title “So Long, Farewell” — appears to follow suit. I mean, it’s a whopping 75 minutes long. But despite that long run time, the episode stays focused on the moment, which involves saying goodbye to Ted and wrapping up most of the loose ends.\nAt the outset of the episode, Ted has already made up his mind. Ahead of the last game of the season, he’s going to leave Richmond to go back home to Kansas to be with his kid. Everyone knows he’s leaving. Team owner Rebecca (Hannah Waddingham) tries to get Ted to stay, offering a big raise and also subtly threatening to sell off the club if he departs. The team, meanwhile, goes full Lasso and sends him off with a choreographed number from The Sound of Music during their last practice together.\nThe stakes are high ahead of the final match. Richmond has a chance to pull off an underdog story and win the league and just so happens to be up against West Ham, the club owned by Rebecca’s supervillain ex-husband Rupert (Anthony Head). For once, Ted Lasso, the show about soccer, actually spends quite a bit of time on the game itself, and watching all of the dramatics unfold — improbable as many of them may be — had the same thrill as a real game. I found myself yelling at the screen the same way I did when my beloved Bayern Munich managed to steal away the German championship at the last second.\nReally, the finale hunkers down on the core traits of the show: sweet yet silly moments, strangely effective motivational speeches, lots of tears, and extremely on-the-nose moments when everyone pulls together, like when each member of Richmond held a tiny piece of the iconic (and ripped-up) “believe” sign. The episode is fairly predictable but also, damn it, they got me. If you’ve spent this much time with these characters, it’s hard not to get choked up seeing things like Keeley propose adding a women’s team at Richmond (finally!) or Roy (Brett Goldstein) start therapy (also finally!). Even the moments that seem a little too perfect, like Rebecca running into her mysterious Dutch hunk at the airport, are at least nice and satisfying. There’s a real catharsis to the episode, particularly when it comes to Nate’s expected redemption story and Rupert getting his comeuppance.\nThis is what good sitcom finales do: remind you why you loved these characters in the first place. Ted Lasso may have played at prestige drama, but this isn’t an ending about guessing who wins like in Game of Thrones or Succession. The results of the big game are, ultimately, not that important. It’s more like the last episode of The Fresh Prince of Bel-Air: knowing that things will change for these people but that everyone is moving in the right direction.\nDespite an ending that seems ripped out of a rom-com (which, naturally, Ted comments on), Ted Lasso is ultimately about friendship and the things that we can learn from other people. In that way, the finale was perfectly fitting: it shows how painful it can be when these relationships change but how necessary that change is for all of us. You just have to, you know, believe.\nAll three seasons of Ted Lasso are streaming now on Apple TV Plus.",
  "word_count": 1111,
  "scraped_at": "2026-02-14T12:14:53.750243"
}