{
  "article_id": "0718fd0bf7c2",
  "url": "https://www.hertsad.co.uk/news/national/23303949.leah-williamson-signs-three-book-deal-macmillan-childrens-books/",
  "title": "Leah Williamson signs three - book deal with Macmillan Children Books",
  "date": "20230207T113000Z",
  "domain": "hertsad.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Footballer Leah Williamson has signed a three-book deal with Macmillan Children’s Books.\nThe 25-year-old England captain’s first book will be called You Have The Power: Find Your Strength And Believe You Can.\nWilliamson led the Lionesses to glory at last summer’s Uefa Women’s Euros, becoming the first England football team to win an international tournament since 1966.\nShe is writing the non-fiction book with Suzanne Wrack, women’s football writer for The Guardian.\nThey will look at how Williamson’s own story can inspire young people to believe in themselves and see that they can also become leaders.\nThe book will run alongside a campaign centred around “reaching and inspiring as many young people, and especially girls, as possible”.\nThis initial publication will be followed by two fiction titles – one in 2023 and one in 2024.\nArsenal defender Williamson said: “I am thrilled to be publishing my first book with the team at Macmillan.\n“They truly share my passion in allowing young people, and girls especially, to realise their own potential and believe they can achieve whatever they put their minds to.\n“Since our win in the summer of 2022, and with the platform we now have, it feels as though it is the right time to reach out to help them find the strength to believe in themselves, allowing them to become whoever they want to be. I remember being that age, and I remember how tough it was.\n“At a time where I am still learning myself, I want to help guide these young people, and help them understand that it’s not about being perfect, it’s about growing and getting to a point that they are happy with.”\nLast year, Williamson was made an OBE in the New Year Honours List, was one of the honourees at the British GQ Men of the Year Awards, and a mural celebrating her Euros victory was created in her home town of Newport Pagnell, near Milton Keynes.\nIn January, it was announced that she has also been nominated for the Best Fifa Women’s Player award.\nMacmillan Children’s Books managing director Belinda Ioni Rasmussen said: “Leah is an inspiration to us all and, through her books, she will now pass on practical guidance specifically to children to help them to realise their dreams and potential in their own lives.\n“We couldn’t be more pleased to be welcoming her to our best-selling and award-winning non-fiction list of influential names and launching her powerful voice to young readers this year.”\n– You Have The Power: Find Your Strength And Believe You Can will be published on March 30 2023.",
  "word_count": 434,
  "scraped_at": "2026-02-14T13:03:31.478887"
}