{
  "article_id": "073dda0e696c",
  "url": "https://www.rollingstone.com/tv-movies/tv-movie-lists/100-best-movies-of-the-1970s-1234675927/",
  "title": "100 Best Movies of the 1970s – Rolling Stone",
  "date": "20230429T181500Z",
  "domain": "rollingstone.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The 100 Best Movies of the 1970s\nIt was the decade that gave us midnight movies, modern blockbusters, Blaxploitation epics, neo-noirs and the cream of the New Hollywood crop. The “Film Brats” were in full bloom, and after the studio system had let the bearded barbarians in through gate, audiences were gifted with what seemed like some new beautiful, bleak vision of American life on a weekly basis. Later, boxers, biking teens, baseball kids and broken-down hockey players would prove that sometimes, the underdogs win even if they don’t actually win. These were the years when we learned to be scared of sharks, masked slashers and pea-soup-spitting youngsters. (In all fairness fair to Regan MacNeil, the devil made her do it.)\nThere’s a reason that the 1970s are idolized, fetishisized and consistently namechecked by several generations of cinephiles: the sheer abundance of great movies that came out during that 10-year span, especially (but not exclusively) from American filmmakers. Looking back at the second golden age of Hollywood while this group of writers attempted to wrestle with the notion of the 100 best movies of the 1970s, it’s mind-boggling to think so many of what we now consider the high points of a still young-ish art form came from this small pocket of time. Our only regret is that we didn’t take this list up to 200, or even 300 titles. (Forget it, Jake — it’s a deadline thing.)\nHere are our picks for the greatest movies to come out of that fertile era of filmmaking, from godfather-led family businesses to tales in a galaxy far, far away. You won’t agree with all of these choices, but hopefully you’ll revisit every single film on this list and find something new in these documents of a wild, wacky, weird decade of movies. To quote a wise man: “It’s showtime, folks!”\n-\n‘The Rocky Horror Picture Show’ (1975)\nThere were “midnight movies” before the big-screen version of Richard O’Brien’s tongue-in-cheek stage show, assembled from the spare parts of science fiction double features, musical theater and underlined passages of “Notes on Camp.” But this would come to both define and refine the entire concept of filmdom cults, turning its after-hours screenings into interactive cosplay gatherings designed for a communal experience. O’Brien himself is Riff-Raff, the hunchbacked handyman who initiates lost innocents Barry Bostwick and Susan Sarandon into a world of freaks, geeks and sexual fluidity; their resistance is, of course, futile. And who needs Dr. Frankenstein when you have Dr. Frank-N-Furter, Tim Curry’s iconic mad scientist in fishnets and a man capable of making you shiver in antici…pation. It’s enough to make you believe that liberation was just a jump to the left — and then a step to the ri-iii-iiight — away. —David Fear\n-\n‘Saturday Night Fever’ (1977)\nMeet Tony Manero, age 19, a native of Brooklyn’s Bay Ridge. During the day, this outer-borough everyguy sells paint and bickers with his Italian-American family. But when the sun goes down and the lights at the local discotheque go up, Tony is a god. John Badham’s movie is so closely associated with the late ’70s disco craze that if you look the word in the dictionary, you’ll simply see a picture of John Travolta in white leisure suit, right hand pointing toward heaven. This was the movie that turned the Welcome Back, Kotter kid into a genuine star, as well as selling mainstream America on what had mostly been an underground club culture and giving the Bee-Gees a serious second-wind boost. The dance scenes are such kinetic time capsules that you almost forget how gritty and bleak the rest of the film is, and that it’s really a coming-of-age story about a guy outgrowing his knucklehead friends, his neighborhood and his own limited set of options. Just, y’know, watch his hair, ok?! He worked on it a long time. —D.F.\n-\n‘Cooley High’ (1975)\nSet in 1964 at the height of the Civil Rights Movement and scored by Motown’s vibrant back catalog, this coming-of-age tale follows a group of young, Black high schoolers in Chicago — led by the burgeoning poet Preach (Glynn Turman) and his college bound best friend Cochise (Lawrence Hilton-Jacobs) — through a series of teenage hijinks (sneaking out of class, fights at house parties). During a moment in which most Blaxploitation movies were pulling the public’s gaze toward stories of sex, crime, and drugs, director Michael Schultz (Car Wash) turned his attention to the rich inner lives of these young Black men. That pivot toward their bond of friendship didn’t just set Cooley High apart from the more sensationalistic movies it shared screen space with; it virtually redefined the perception of what a Black film could be during the decade. —Robert Daniels\n-\n‘F for Fake’ (1973)\nOrson Welles is at his slipperiest in this essay film, as he imports his gift for telling plummy tall tales on the talk-show circuit to a feature-film format. He starts by focusing on notorious art forger Elmyr de Hory, only to iris back and turn the proceedings into a meditation on the nature of truth itself, as well as the myths we tell ourselves to imbue our lives with meaning. Meanwhile, Welles’ partner — the enigmatic Oja Kodar — looms in the background, both clothed and unclothed. It’s a delightful head-trip and a reminder that an unbiased look at his rich catalogue yields more than just the Greatest Film of All Time. Even as a minor gem, F for Fake shines bright in his back catalog. —Mosi Reeves\n-\n‘Ganja and Hess’ (1973)\nNovelist, playwright, director, and actor Bill Gunn created Ganja & Hess at the invitation of an independent film company eager to market a blaxploitation film. But his resulting symphony of Afro-Caribbean heritage, voodoo rituals, Christian guilt, homoerotic allusions, and sexual tension didn’t meet his backers’ desire for a Black vampire quickie akin to Blacula. The plot centers on Hess Green (Duane Jones, who also starred in another horror masterpiece, Night of the Living Dead), an anthropologist who drinks the blood of an assistant (played by Gunn) who’s killed himself. He then falls in love with his assistant’s wife Ganja (Marlene Clark) when she comes to investigate. Gunn’s unique camerawork and garish visuals makes this as much an art film as an indie horror; it earned rave reviews at the 1973 Cannes Film Festival and is now properly recognized as a classic. —M.R.\n-\n‘Vanishing Point’ (1971)\nThere’s all other stoner desert-highway movies, and then there’s Vanishing Point. Twilight Zone veteran Richard C. Sarafian made a midnight movie that could give anyone a contact buzz. Barry Newman is Kowalski, the lone driver, behind the wheel of a Dodge Challenger on a high-speed mission to reach San Francisco. Are the cops in hot pursuit? Does he meet a Jesus-freak rock commune? Does he see a mystic vision of a blonde hippie biker riding her Harley naked to the guitar riffs of “Mississippi Queen”? Yes, yes, and obviously. His only guide: Cleavon Little as the blind radio DJ Super Soul, hailing Kowalski as “the last American hero… the last beautiful free soul on this planet!” His DJ rap has been set to music by both Guns N Roses (“Breakdown”) and Primal Scream (“Kowalski”) — a tribute to this meta-road flick’s impact. —Rob Sheffield\n-\n‘Wattstax’ (1973)\nSeven years after the Watts rebellion sparked by Martin Luther King Jr’s death, a concert featuring the recording artists of Stax Records took place at the Los Angeles Memorial Coliseum. Its aim was to heal the area. “I am somebody,” spoken proudly by Jesse Jackson, became its battle cry. Director Mel Stuart’s stirring documentary differs from similar chronicles of memorable shows like The Last Waltz, because it’s not really about the featured artists (such as the Staples Singers, Rufus Thomas, Isaac Hayes, among others). Instead, its interest arises from giving voice and witnessing the pointed conversations between Black folk about colorism, interracial dating, and the Blues. It’s the one concert film that tells Black people “you are somebody” in every single shot. —R.D.\n-\n‘Annie Hall’ (1977)\nFor just a moment, try and forget your feelings about Woody Allen in 2023, and go back in time to 1977 — when Annie Hall upended notions of the romantic comedy with its mix of direct address to the camera, lobster-cooking, and existential malaise. This Oscar-winning masterpiece plunges its audience into the neurotic psyche of Allen’s alter-ego Alvy Singer, as he becomes smitten with the eponymous WASP flibbertigibbet played by Diane Keaton. In part a study of American Jewish assimilation and in part the saga of falling in and out love, Annie Hall is still more than the sum of its perfect bits. And, yes, the bits still are delightful, from Christopher Walken’s creepy turn as Annie’s terrifying brother to the cocaine sneeze. But it’s the melancholy that made this the template for so many filmmakers to follow in the years to come. And, of course, there’s Keaton’s Annie herself, a dream woman with a deep soul beneath all her la di das. —Esther Zuckerman\n-\n‘Hester Street’ (1975)\nJoan Micklin Silver’s stunning debut about Jewish immigrants on the Lower East Side almost feels like an artifact from another time — not from the 1970s, to be clear, but from the late 19th Century when it takes place. Shot in black-and-white and spoken often in Yiddish, Hester Street begins as the story of Jake (Steven Keats), formerly Yankel, a man who believes he is thriving in his new home of New York City. But the perspective deftly, and heartbreakingly, shifts upon the arrival of his wife, Gitl (Carol Kane). Jake is disgusted by her old world ways and wants her to assimilate…just not enough so that she abandons her place in the home. His conflicting instructions are cruel, yet Gitl is not Jake’s limited picture of an American woman. Instead, she adapts to her environment in her own way. Silver cedes the film to Carol Kane’s incredible, Oscar-nominated performance, and the actor inhabits Gitl with wide-eyed worry as if she, too, has just arrived in this country. —E.Z.\n-\n‘The Bad News Bears’ (1976)\nThe Bicenntennial summer of ’76 was such a peak season to be a young baseball fan: the game’s hottest pitcher was Detroit’s longhair kid Mark “The Bird” Fidrych, while the hottest movie was The Bad News Bears. Michael Ritchie’s comedy starred a Little League squad full of misfit children who cuss like Marines, but it’s one of the most emotionally accurate — and funniest — sports movies ever made. Walter Matthau has the role of his life as Buttermaker, the cigar-chomping drunk asshole coaching a team sponsored by Chico’s Bail Bonds. (“Let Freedom Ring!”) But the Bears start to win when they get a girl pitcher, Tatum O’Neal, plus Harvey-riding delinquent Jackie Earle Haley. Every kid here became a cult hero: Lupus, who fixes the coach’s martinis. Engelberg, who tells him driving with an open whiskey bottle is illegal. (“So’s murder, Engelberg. Now put that back before you get me in real trouble.”) Ogilvie, pop culture’s first baseball stats geek, at a time when Bill James was still mailing his Abstract out of his garage. And Tanner, who basically invents Gen X the moment he tells the rival team, “Hey Yankees — you can take your apology and your trophy and shove ‘em up your ass!” Even the sequels bat above the Mendoza line. —R.S.\n-\n‘Smokey and the Bandit’ (1977)\nIt’s the ultimate Southern-fried good ol’ boy comedy, the most Burt Reynoldsian of Burt Reynolds’ 1970s movies (which is saying something), and the Citizen Kane of Redneck Cinema. A legend in bootlegger circles, the Bandit and his partner “Snowman” (country musician Jerry Reed) are hired to transport a truckload of illegal Coors beer — no, really — from Texarkana to Atlanta in a little over a day. Per Reed’s theme song, they “got a long way to go, and a short time to get there,” which gets complicated by Sally Field’s runaway bride and a posse of “smokeys” on their trail. Stuntman and longtime Reynolds buddy-turned-director Hal Needham not only tapped into his star’s inherent charm and comic timing, he also realized that the combo of car chases, trucker culture and Hee-Haw level humor (give it up for Jackie Gleason’s Buford T. Justice) would be one hell of a drive-in movie trifecta. The film was D.O.A. upon release until someone at Universal figured out to concentrate directly on the Southern theater market — at which point the movie took off faster than state troopers in hot pursuit of a speeding Trans Am. —D.F.\n-\n‘Wanda’ (1970)\nWriter-director-actor Barbara Loden’s sole feature film centers around a woman who’s just left her husband and lost her factory job. She then passively teams up with a small-time crook, flitting from barstool to backseat with the resignation of a prisoner who no longer dreams of escape. It’s a portrait of a broken spirit that was bleak even by the era’s standards. (Loden’s screenplay attracted little interest, which is why she ended up directing it herself; it’s a movie about someone paralyzed by society’s expectations, made by someone paralyzed by society’s expectations.) Yet it’s since been recognized as a compassionate, highly personal landmark of American independent cinema, and an object of fascination for writers and filmmakers intrigued by Loden’s short life and extraordinary sense of humanity. —Katie Rife\n-\n‘Rock ‘n’ Roll High School’ (1979)\nFor a brief but beautiful “1-2-3-4!” moment, the Ramones were movie stars. Rock ‘n’ Roll High School was Joey, Johnny, Dee Dee, and Markie, rocking their own black-leather A Hard Day’s Night. Since the average kid had no hope of hearing the Ramones on the radio, much less at CBGB’s, director Allan Arkush’s exploitation flick was the gateway drug for countless fans. (Big shout-out to Siskel & Ebert, who gave it a hey-ho let’s-go boost when nobody else did.) The hero: P.J. Soles as Riff Randall, the punk rebel who tells her evil principal (Warhol Factory dominatrix Mary Woronov), “I’m a teenage lobotomy!” Centering the film around the feminist fangirl was a prophetic move, which is why it was a sacred text for the 1990 riot-grrrl revolution, right down to Sleater-Kinney’s “I Wanna Be Your Joey Ramone.” It peaks with a blazing live set where Da Bruddas bash “Blitzkrieg Bop” and “She’s The One”; for the climax, they help Riff blow up the school. Gabba gabba hey! —R.S.\n-\n‘Small Change’ (1976)\nFrançois Truffaut emerged from a difficult childhood to become a filmmaker acutely sensitive to the perils faced by children and the ways the world takes advantage of the innocent and vulnerable. That makes Small Change, a slice of life set amongst the children of the French city of Thiers, of a piece with earlier Truffaut films like The 400 Blows and The Wild Child. That’s particularly true when its focus turns to the story of Julien (Philippe Goldmann), a boy whose abuse at first goes unnoticed by his teachers and classmates. But Truffaut makes the kid’s story part of a tapestry that mixes the whimsical with the bittersweet as it weaves together a variety of childhood experiences. It’s a tour de force on a miniature scale. —Keith Phipps\n-\n‘Pat Garrett & Billy the Kid’ (1973)\nSam Peckinpah gives us one elegiac ode to the Western, with Kris Kristoffersen as the wild-eyed outlaw and James Coburn as the cynical sheriff hired to gun his old friend down. The filmmaker also cast a kindred spirit: Bob Dylan, another poet of American mythos, in his first dramatic role. Dylan plays a wily drifter named Alias, handy with a guitar or a switchblade. (Alias what? “Alias anything you please.”) It’s practically The Last Waltz of Westerns, full of renegades beaten down by the road. The signature song: Dylan’s “Knockin’ on Heaven’s Door,” playing as dying gunslinger Slim Pickens sits by the river with wife Katy Jurado, two legends of the genre watching that long black cloud coming down. In a sadly typical story, the studio totally botched Peckinpah’s version — it took until the 1988 director’s cut for Pat Garrett to get recognized as one of his masterworks. —R.S.\n-\n‘The Passenger’ (1975)\nIn Michelangelo Antonioni’s last great film, Jack Nicholson plays an enterprising reporter, David Locke, so hellbent on covering a revolution in Chad that he hastily assumes the identity of a deceased arms dealer who died at his hotel. Locke weaves himself into his own story as he follows the trail that the dead man left behind, putting himself in danger as he befriends a woman (Maria Schneider — here billed only as “The Girl,” since it was still the sexist Seventies) who goes on the run with him. The Passenger in the title might well be the viewer who must make sense of who’s good and who’s bad in this nuanced, compelling thriller that benefits from Antonioni’s trademark slow reveals. —Kory Grow\n-\n‘The Discreet Charm of the Bourgeoisie’ (1972)\nWelcome to Luis Buñuel’s dinner party, where you can check out any time you like but you can never eat. The Spanish filmmaker’s late-career masterpiece gathers together a group of upper-middle-class folks — a who’s who of mid-’70s international stars, including Delphine Seyrig, Jean-Pierre Cassel, Bulle Ogier, Stephane Audran, and Fernando Rey — for a soirée. When they’re host is unprepared to serve them food, they all go in search of a communal meal, only to encounter terrorists, bishops, ghost-story-telling soldiers, and dreams within dreams within dreams. Curiously, none of them can get a bite to eat anywhere. Buñuel was always the missing link between André Breton and Monty Python, and this cockeyed comedy of manners still feels like his most perfect distillation between the satirical and surreal. Bon appétit. —D.F.\n-\n‘Night Moves’ (1975)\nArthur Penn’s neo-noir riff is a quintessential work of New Hollywood: a classic genre piece, given a fresh coat of paint and a contemporary sensibility, to say nothing of a bummer ending. In this case, the genre was the hard-boiled detective movie, but our gumshoe (Gene Hackman, at his bristling best) is a cuckolded, frustrated, perpetually disappointed former athlete whose deeply felt personal code is as much an anachronism as his disreputable profession. One dialogue exchange sums up not only the movie, but the decade in general: Asked who’s winning the football game he’s watching on television, Hackman replies wearily, “Nobody — one side is losing more slowly than the other.” —Jason Bailey\n-\n‘Amarcord’ (1973)\nItalian filmmaker Federico Fellini drew from the well of his formative experiences often, but arguably never as effectively as he did in this look back at his youth in 1930s Rimini, where kids run wild, townspeople play pranks on each other, everyone lusts after the local beauties and Mussolini’s black shirts start to creep, slowly but surely, into the provinces. It’s equal parts nostalgic for the past and wary of sentimentalizing it, combining a frightening look at the rise of Fascism with vignettes involving mentally unstable relatives, kooky local traditions and one extremely horny, buxom tobacco-shop owner. This set the template for almost every “memory” movie to follow, and you can see its DNA in everything from Roma to Armageddon Road. And it’s a great introduction to the singularly surreal, dreamy and mondo overripe style — an aesthetic that more than earned the filmmaker his own adjective of “Felliniesque.” —D.F.\n-\n‘The Bitter Tears of Petra van Kant’ (1972)\nSome films treat the notion that “you always hurt the ones you love” as a passing thought — Rainer Werner Fassbender’s caustic, cutting parable about amorous masochists turns it into a mantra. The insanely prolific German director outdid himself with this adaptation of his own play, about a fashion designer (Margit Carstensen) who falls madly in love with a model (Hanna Schygulla) and proceeds to put them both through hell. Power dynamics between the couple constantly shift back and forth; meanwhile, Petra’s silent maid (Irm Hermann), herself head over heels for her employer, bears witness to all of it and goes about her daily business. It’ll end in tears, and dear god, will they be bitter. You could not find a better example of scratching Fassbinder’s cynical, ironic surface and finding the bleeding romantic underneath. Nor, for that matter, a more devastating use of the Platters’ “The Great Pretender.” —D.F.\n-\n‘Young Frankenstein’ (1974)\nIf Mel Brooks had just released Blazing Saddles in 1974, dayenu. (For the goyim reading, that means: “it would have been enough.”) Instead, in one year he gave us both that classic and this perfect parody of Universal horror movies, a double whammy of zany tributes to the very act of moviegoing. The grandson of the legendary doctor Victor Frankenstein Frederick Frankenstein (Gene Wilder) — it’s pronounced “frah-ken-steen” — ventures to Transylvania to take over his family’s estate. He encounters all kinds of creepy characters, such as Frau Blücher [Horse sound], and eventually goes into the family business. The gags are not only goofy winners (“What hump?”) but also demonstrate Brooks’ deep reverence for cinema, specifically in this case the 1930s monster-movie canon. The film is also proof of Brooks’ belief in the power of putting on a show — or rather, “Puttin’ on the Ritz” — as long as nothing goes wrong and startles the monster. —E.Z.\n-\n‘A Touch of Zen’ (1971)\nSweeping epics were out of style in the New Hollywood of the ‘70s, but cinematic grandeur was alive and well in Taiwan. The first hour of King Hu’s masterpiece plays like a combination fairy tale and old-fashioned Western, telling the story of provincial artist Ku Shen Chai (Chun Shih) and his tentative romance with runaway princess Yang Hui-ching (Feng Hsu). Then the swordplay comes in, and the film unfolds into a transcendent, thrilling martial-arts tale. Its balletic fight scenes and feminist message have influenced directors like Ang Lee and Zhang Yimou, confirming it as a cornerstone of the wuxia genre. —K.R.\n-\n‘Suspiria’ (1977)\nDario Argento’s Pantone-perfect giallo dynamo may touch on haunted houses, witches, and other clichéd horror tropes. But the way he presents the terror that ballet student Suzy Bannion (Jessica Harper) encounters at a creepy boarding school makes you feel like you’re in the nightmare with her. When a character gets stabbed through the heart, you see a closeup of a knife piercing a beating heart; same with the screenplay’s maggots and barbed wire. Throughout, the rock group Goblin makes its own hellish racket by turning a ballerina jewel box theme into one of the most haunting and unforgettable scores in horror. You don’t watch Suspiria — you feel it. —K.G.\n-\n‘The Taking of Pelham One Two Three’ (1974)\nYou can glimpse the fingerprints of Joseph Sargent’s adaptation of Peter Godey’s novel on everything from Reservoir Dogs to Die Hard, but above all else, it’s one of the great New York movies. When Mr. Blue (Robert Shaw) announces to the riders of the downtown 6 that he and his three armed accomplices are taking their train and holding them hostage, it prompts the kind of bemused laugh that you can only get in New York. And only in New York would their plot unravel at the hands of a transit cop like Zachary Garber (Walter Matthau); his poor bedside manner, rumpled wardrobe, and face like a catcher’s mitt provide a Columbo-like distraction for investigative prowess — fully revealed in one of the finest closing shots in all of American cinema. —J.B.\n-\n‘Fantastic Planet’ (1973)\nEven in a year that brought such far-out fare as Alejandro Jodorowsky’s The Holy Mountain and Eiichi Yamamoto’s Belladonna of Sadness, René Laloux’s hallucinatory human-rights parable stands out. This animated film is strangely alluring, and not only because both the towering blue Draag humanoids and their human-like Oms pets are frequently unclothed. It’s filled with bizarre squid-like creatures, and the animation is stark and rigid, eschewing the fluid expressiveness of Disney film. Meanwhile, Alain Goraguer’s famed jazz-funk score whiles away in the background, making the proceedings seem like Jonathan Swift-like satire. Fantastic Planet is Laloux’s most famous work; the French animator directed several shorts and two more features (notably 1987’s Gandahar) before his death in 2004. —M.R.\n-\n‘Gates of Heaven’ (1978)\nThe simplest way to describe this achingly poignant and off-handedly comic Errol Morris experiment is that it’s a deadpan documentary about pet cemeteries, featuring interviews with the owners and operators of one failing and one thriving business. But this movie is ultimately about so much more. It’s a frank examination of family legacies, peppered with vivid portraits of how naive American optimism feeds the grinding machinery of success. And it’s a slice-of-life that is framed like a piece of art, with shots that are precisely arranged and adorned with eye-catching props, and then populated by people who wax philosophical — not just about cats and dogs, but about the subtle differences between life and death. —Noel Murray\n-\n‘The Devils’ (1971)\nKen Russell’s blasphemous firebomb is the rare example of a movie that actually has been suppressed by the powers that be. (The film was not publicly screened in its uncut form until 2004.) The onslaught of depraved and profane imagery is the primary culprit for its dances with censors, much of it related to Vanessa Redgrave’s bravura performance as a perverse abbess who accuses Oliver Reed’s playboy priest of witchcraft. But the political implications of the story — a searing critique of corruption and hypocrisy among self-styled moral authorities — are just as dangerous. In Russell’s vision, the celibate is the sinner and the libertine the saint, an inversion as provocative as the frequently snipped-out scene where Redgrave sucks on Christ’s side wound. —K.R.\n-\n‘Network’ (1976)\nNearly every absurd idea presented in the screenplay by Golden Age of television star creator Paddy Chayefsky has become unnervingly true in the era of Fox News. Peter Finch and Faye Dunaway both won Oscars for their respective roles: an anchorman whose on-air nervous breakdown (including the iconic “I’m as mad as hell, and I’m not going to take this anymore!” rant) somehow turns him into “the mad prophet of the airwaves”; and a sociopath network executive who will do everything, up to and including assassination, to goose ratings. Directed by Sidney Lumet, and featuring other magnificent performances by William Holden, Robert Duvall, Ned Beatty, and Beatrice Straight (who won an Oscar for one scene!), Network is as hilarious as it is chilling. What began as a satire has instead turned out to be prophecy. —Alan Sepinwall\n-\n‘Slap Shot’ (1977)\nThis hockey comedy feels like the demarcation point between Paul Newman’s young and beautiful movie-star phase and his weathered (but still beautiful) character-actor phase. He plays Reg Dunlop, player-coach for a failing minor league team in a dying steel town, who tries to drum up attendance with a new and incredibly violent style of play — spearheaded by the simplistic, ruthless Hanson brothers. Written by Nancy Dowd and directed by George Roy Hill, Slap Shot leans hilariously into the crude caveman personalities of Reg and his teammates, with Newman playing his role without the slightest trace of vanity, and the mix of profanity and physical comedy making this the funniest sports film ever. —A.S.\n-\n‘Get Carter’ (1971)\nThis landmark British crime flick marks the moment when the stage-y kitchen-sink dramas of Sixties British cinema coagulated into gloriously brutish thuggery. It finds London gangster Michael Caine hurtling on a train back to his Newcastle hometown to solve his brother’s mysterious death by alcohol poisoning, a journey that ends in bullets and blood. Director and screenwriter Mike Hodges based Get Carter on Ted Lewis’s pulp novel Jack’s Return Home, and he fills the screen with scenes of gray, cloudy exteriors and working-class malaise, and every character seems to hold secret trauma. At its center is Caine, who seems to radiate an uneasy calm that only breaks with violence. —M.R.\n-\n‘The Deer Hunter’ (1978)\nOne of the first American movies to take a cold, hard look at the aftermath of our involvement in Vietnam, the 1978 Best Picture Oscar-winner follows a trio of steel workers — played by Robert De Niro, Christopher Walken and John Savage — who enlist in the Army to fight overseas. All three become prisoners of war. Two return home with physical wounds and psychic scars; one remains in country, reliving his P.O.W. trauma on a nightly basis. Michael Cimino’s epic is mostly remembered for the intense sequences of the Viet Cong forcing them to play harrowing games of “Russian roulette.” But seen now, it’s the film’s first half that really stays with you, in which these young men and their hunting buddies drink, hang out, talk shit and let loose at a wedding. You get a real sense of this small town’s blue-collar community and the men’s camaraderie, which only makes the abrupt switch to the killing fields that much more jarring (imagine watching Diner and having someone suddenly switch the channel to Apocalypse Now halfway through). Yet that perfectly mirrors the sense of violent disorientation these all-American everyguys go through in ‘Nam, and the alienation De Niro’s character feels after returning home. This was also the movie that gave Meryl Streep her first big film role and gave us the last performance of the late, great John Cazale. —D.F.\n-\n‘Harold and Maude’ (1971)\nPart black comedy and part guide to living, Hal Ashby’s beloved cult film stars a cherubic Bud Cort as Harold, a directionless child of privilege who spends his days attending strangers’ funerals and performing fake suicides for a distant mother (Vivian Pickles). He meets Maude (Ruth Gordon), an elderly woman and fellow funeral enthusiast who possesses a zest for life that the morbid Harold can only dream of. As they become inseparable, Maude’s enthusiasm becomes infectious, tempered only by hints of the hard road she’s followed to reach the age of 79 and the suggestion that she doesn’t have much time ahead of her. Defiantly and inspiringly naive, it’s a black comedy that stares despair in the face and dares to laugh. —K.P.\n-\n‘The Life of Brian’ (1979)\nThis standout entry in Monty Python’s filmography may have one of the greatest final scenes in comedy history. The premise is that Brian Cohen (Graham Chapman) is born in a stable in Jerusalem, right next to the one where Jesus Christ was born. Much hilarity ensues and, without giving the obvious away, let’s just say that Brian’s fate isn’t much different from the son of God. As Eric Idle famously sings to the reluctant messiah at the end, “Always look on the bright side of life”; the song has since become a national anthem, with Idle reprising it at the 2012 London Olympics. All the Python members are great here, and Sue Jones-Davies stands out as Judith Iscariot. Watch out for a cameo from George Harrison, who financed Life of Brian through his HandMade Films company. —M.R.\n-\n‘The Wicker Man’ (1973)\nMay Day, 1973: a police sergeant arrives on the remote Scottish island of Summerisle, to investigate a missing child. But he finds himself in a strange pagan society where the locals dance around the maypole, practice ancient Celtic rituals, and have sex in the fields. Robin Hardy made The Wicker Man the ultimate folk-horror nightmare, right to the scream-worthy final minutes. Edward Woodward is the uptight Christian cop, aghast at the nudity on this island; Christopher Lee is the affable Lord Summerisle, who insists, “One should always stay open to the regenerative influences.” It’s a dark satire of post-hippie “back to the land” fantasies, where the innkeeper is Lindsay Kemp (a.k.a. David Bowie and Kate Bush’s real-life mime teacher) and his lascivious daughter is rock muse Britt Ekland. Paul Giovanni’s freak-folk music became part of the film’s legend — bizarrely, there was no official soundtrack album until the 1990s, yet tunes like “Willow’s Song” became hugely influential psych-prog classics. (As The Auteurs’ Luke Haines said, “Every British band makes its Wicker Man album.”) Tributes like Midsommar just reaffirm the original’s terrifying power. Sing, cuckoo! —R.S.\n-\n‘National Lampoon’s Animal House’ (1978)\nThis National Lampoon production set the slobs-vs.-snobs template that would define much of film comedy for the next few decades, and was by far the best film vehicle for the prodigious but specific comedic talents of the late, great John Belushi. As Bluto Blutarsky, the hard-drinking, filthy (in every sense) member of the disreputable Delta House fraternity, the SNL star is such a force of nature that you can’t help thinking of it as his film, even though fellow Deltas Tim Matheson, Peter Riegert, and Tom Hulce all have more prominent roles. He’s so charismatic that, when Bluto asks in the middle of an inspirational speech, “Was it over when the Germans bombed Pearl Harbor?,” nobody wants to interrupt to him to explain. —A.S.\n-\n‘Woodstock’ (1970)\nOne of the first major films of the 1970s looked back at one of the major events of the 1960s — and, in its own way, at the ethos of the entire decade. Director Michael Wadleigh led a team of young filmmakers (including a baby-faced Martin Scorsese) to Bethel, New York, to document the August 1969 festival of music and peace; their shoot was nearly as chaotic as the festival itself, running multiple cameras and exposing 50 miles of film during performances. Yet they gathered impressions and insights from organizers, attendees, and Bethel’s blindsided residents in addition to capturing artists like Santana, the Who, Crosby, Stills & Nash, and Jimi Hendrix at their height — and the result is a 360-degree portrait of a culturally defining event. It’s assembled with a you-are-there immediacy and coked-out energy — the vibes are exquisite and the performances are electrifying. With Altamont falling between the festival itself and the film’s release, this legendary concert film already played, even in those first screenings, like wistful nostalgia. —J.B.\n-\n‘Badlands’ (1971)\nOver the course of two months straddling 1957 and 1958, a 19-year-old garbage collector named Charles Starkweather brought his 14-year-old girlfriend Caril Ann Fugate on a Heartland killing spree that left 10 death and captured the public imagination. The story suggests another lovers-on-the-lam thriller like Bonnie & Clyde, but in his first feature, Terrence Malick heads off in own iconoclastic direction, ignoring the celebrity brouhaha to focus on the relationship between Kit (Martin Sheen) and Holly (Sissy Spacek) — one an antisocial greaser with an itchy trigger finger, the other a bored kid who thinks he looks like James Dean. Malick’s career-long interest in the natural world gives Badlands a dreamy, innocent quality that contrasts sharply with the casually shocking spasms of violence. —Scott Tobias\n-\n‘The Phantom of the Paradise’ (1974)\nIn a cooler alternate universe, Brian De Palma’s satirical riff on the Phantom of the Opera myth would be a Rocky Horror Picture Show-level midnight phenomenon. Paul Williams (who wrote most of the songs for this cult musical) stars as a diabolical producer whose plans to opens a new concert hall with a rock opera version of Faust; his plans are thwarted, however, by the mangled singer-songwriter (William Finley) who haunts the place. De Palma may have been early in his career, but he still unleashed his full arsenal of stylistic tricks — screens are split like crazy — and showed a willingness to bite hard on the hand that feeds him. —S.T.\n-\n‘Spirit of the Beehive’ (1973)\nIn the Spanish countryside of 1940, a six-year-old girl named Ana (Ana Torrent) finds herself haunted by Frankenstein, a film whose meaning she struggles to grasp but which seems profound in ways she can’t quite understand. After Ana befriends and aids a republican soldier who takes shelter in a crumbling sheepfold, she’s invested Frankenstein with a meaning of her own invention, incorporating its vision of a gentle, misunderstood monster into her growing understanding of death, disillusionment and the first stirrings of discontent. Set shortly after the conclusion of the Spanish Civil War and the ascent of Francisco Franco (and released in the Franco regime’s final years), director Victor Erice’s meditative, visually lush debut works both as a universal story about the end of childhood innocence and a barbed depiction of how complacency opened the door for authoritarianism — and the succeeding generation’s obligation to close it again. —K.P.\n-\n‘American Graffitti’ (1973)\nAnticipating the viscous wave of greaser nostalgia that would soak the Seventies from the Fonz to Grease, filmmaker George Lucas wrote American Graffiti about the happy-ish days of 1962, the year he turned 18 — when cool cats would cruise the strip to pick up chicks, drag race, prank cops, and talk trash. A sharp ensemble cast that included Richard Dreyfus, Ron Howard, Harrison Ford, Cindy Williams, and Paul Le Mat brought out the characters’ small-town, teenage ennui as they prepared to “finally get out of this turkey town” (Howard’s words.) Amid all the hi-jinks (“Your car’s uglier than I am,” 13-year-old Mackenzie Phillips says), there are also moments of real heart, like the the high-speed end sequence. Plus, the movie boasts what all the imitators lacked: Wolfman Jack. —K.G.\n-\n‘Harlan County USA’ (1976)\nImmediacy and intimacy are crucial components in so many great documentaries, but Barbara Kopple’s potent debut is a masterclass in bringing audiences into her subjects’ lives, making their struggles as palpable as our own. She takes us to the frontlines of the tense strike waged by Kentucky coal miners in the early 1970s, when they faced off with Duke Power Company, led by the monstrously callous capitalist Carl Horn. Shoving aside patronizing clichés about working-class life, the film stands as a tribute to honest labor, presenting the blunt decency of ordinary Americans forced to endure dangerous mining conditions while barely being able to keep their heads above water financially. It’s stirring in its simplicity — never more so than when activist and songwriter Florence Reece delivers a powerfully spartan rendition of “Which Side Are You On?” — and as gripping as a thriller once Duke Power starts threatening the striking workers’ lives. Kopple’s camera is right there to capture the terror and chaos. There’s little doubt whose side you’ll be on in this David-and-Goliath confrontation. —Tim Grierson\n-\n‘Day for Night’ (1973)\nFrancois Truffaut spent most of his early career making movies about a movie-mad young man (big up Antoine Doinel!) and/or films dedicated to emulating the styles of his auteur idols. In 1973, he finally got around to the subject of moviemaking itself — and gave us what may be the most passionate, poetic chronicle of capturing magic 24 frames per second. Starting with its famous opening crane shot, Day for Night (the title itself refers to an illusionary filmmaking trick) uses a fake film shoot to pull back the curtain on the agony and the ecstasy of telling stories with a camera, a crew and cockeyed notion of cinema as an art form. Yet even when Truffaut’s onscreen director Ferrand is struggling to get his vision onscreen or get his stars (namely Jean-Pierre Léaud and Jacqueline Bisset) to hit their marks, the movie never treats the sheer work of filmmaking as anything less than a miracle. It’s both an expose on how the cinematic sausage gets made and a love letter to those brave or foolish enough to make sausages at the same time. —D.F.\n-\n‘The Harder They Come’ (1972)\nIvan (Jimmy Cliff), a nobody with dreams of musical stardom, returns to Kingston hoping to be seen. He records a reggae track, one he’s sure will be a hit, called “The Harder They Fall.” But the strictures of authority — the church, the disc jockeys, the police—remain hostile to this outsider. Ivan becomes an outlaw after he murders a cop. Ironically, the notoriety rockets him to stardom. Perry Henzell’s rebellious film initially struggled to find an audience: It mostly played midnight-movie slots, while its accents required subtitles for American theaters. What didn’t need translating, however, was the reggae music, and the film’s soundtrack — featuring seminal hits like the title track, “Many Rivers to Cross” and “You Can Get It If You Really Want” — introduced Jamaica’s unique sights, sounds, and people to the world ready to devour it. —R.D.\n-\n‘The Friends of Eddie Coyle’ (1973)\nA true epitaph for the Seventies: “This life’s hard, man. But it’s harder if you’re stupid!” Peter Yates made this massively influential, anti-glamorous gangster movie about small-time Irish crooks in Boston — guys like Eddie “Fingers” Coyle (Robert Mitchum), a world-weary gun-running loser, who spouts street proverbs like, “Never ask a man why he’s in a hurry.” These racket guys are working stiffs; nobody’s comparing them to the Roman Empire. Yates shot on location in diners, dive bars, bowling alleys, with an eye for gritty local detail based on George V. Higgins’ novel. The stellar cast has Peter Boyle, Alex Rocco, and the scene-stealing Steven Keats as a cocky Mick Jagger-esque hood in a ’71 Plymouth Road Runner. Eddie Coyle was the first of the Boston Irish mob movies — there’d be a few more where this came from — but it’s never been topped. —R.S.\n-\n‘Carnal Knowledge’ (1971)\nLong before “toxic masculinity” became grist for think-piece mill, director Mike Nichols delivered one of the nastiest portraits of bad men ever committed to celluloid. Working from Jules Feiffer’s contemptuous screenplay, Jack Nicholson and “Arthur” Garfunkel play college chums Jonathan and Sandy, each of them pining for pretty coeds and jockeying to prove their sexual swagger. Candice Bergen’s Susan becomes relatively-more-sensitive Sandy’s girlfriend, but soon, scheming Jonathan wants her for himself. This sets in motion a decades-spanning study of these men’s cruelty, insecurity and competitiveness, which often targets innocent women (including Ann Margaret, whose role deservedly earned her an Oscar nomination) unlucky enough to cross their paths. Ruthlessly acted and unsparingly bleak, Carnal Knowledge draws its dark laughs from Jonathan and Sandy’s wretchedness, this poisonous satire gleefully mocking fragile male egos imperiled by the then-burgeoning women’s liberation movement. —T.G.\n-\n‘Sweetsweetback’s Badass Song’ (1971)\nTowards the beginning of Melvin Van Peebles’ 1971 protest film, sex-show performer Swwet Sweetback ends up killing a pair of cops when their brutality towards a Black activist goes too far. That sets our hero on a quixotic path through the underbelly of Los Angeles, where he encounters hustlers, sex workers, Hell’s Angels, and more racist pigs on his way to freedom in Mexico. The character’s lone-wolf attitude reflects that of Van Peebles himself, who ditched a deal with Columbia Pictures to make an independent feature that’s raw and revolutionary in both form and content. It ended up becoming one of the most successful indie movies ever made, helped give birth to a genre and has been cited by everyone from Huey Newton to Spike Lee as a cinematic call to arms. —K.R.\n-\n‘Dawn of the Dead’ (1978)\nIn 1968 George Romero’s Night of the Living Dead gave birth to the modern zombie movie while proving, however accidentally, that the swarms of undead could offer a dark reflection of the times that created them. A decade later, he was ready to truly harness the dark, satirical possibilities of the walking dead with this sequel to his horror classic. When a quartet of survivors reclaim a Pittsburgh shopping mall in the middle of a zombie-horde danger zone, they turn it into a paradise of consumerism all their own while doing their best to isolate themselves from the world outside. Their perilous existence serves as a perfect metaphor for a decade that had left the idealism of the 1960s behind and the limits of blinkered, materialistic pleasures — though Romero doesn’t exactly skimp on the shambling zombies or shocking gore, either. —K.P.\n-\n‘Cries and Whispers’ (1972)\nIngmar Bergman’s s punishing melodrama is drenched in the blood of unkempt emotions. The opening title cards are bright red, and so are the walls of the 19th century Swedish estate where one woman, Agnes (Harriet Andersson), is dying of cancer. Her two sisters, Maria (Liv Ullman) and Karin (Ingrid Thulin), wait her for death, losing themselves in memories of past trauma. Maria remembers how her infidelity led her husband to stab himself; Karin admits suicidal thoughts, thinking of an incident where she maimed herself with glass. When her husband sees her, she smears the blood on her face. Bergman’s oeuvre is filled with psychologically fraught fare, but few are as uncomfortably intimate and enthralling as this. —M.R.\n-\n‘Dusty and Sweets McGee’ (1971)\nTalk about a lost ’70s-cinema gem ripe for rediscovery: Writer-director Floyd Mutrux’s docudrama takes a sympathetic, but seriously unflinching at the junkie life, casting a handful of actual users to recreate scenes of scoring, stealing and scraping to get by. In between these gritty vignettes, he has other addicts give direct testimonials to the camera. All of it paints a harrowing picture of Los Angeles street life, which doubles as a snapshot of the idealistic Sixties sliding — or rather, spiraling downward — into the Seventies. And the movie’s incredible use of L.A. pop radio as a constant Greek chorus on the almost assuredly inspired Quentin Tarantino’s similar drive-time soundtrack in Once Upon a Time…in Hollywood. —D.F.\n-\n‘Coffy’ (1973)\nShe’s an emergency room nurse in Los Angeles who’s out for revenge after her sister gets hooked on dope…and believe us, you do not want to mess with her. Decked out with a massive afro and higher-than-higher heels, Pam Grier gives us nothing short of the first Black female superhero, going up against the pimps, pushers, crooked cops and politicians rotting America’s inner cities. With big punches, broad kicks, a sawed-off pump-action rifle and winking one-liners delivered with unbridled cool, Grier showed the Blaxploitation-flick game wasn’t just for men. Black women could take the system down too. —R.D.",
  "word_count": 7648,
  "scraped_at": "2026-02-14T13:00:04.987987"
}