{
  "article_id": "076e9b57bc62",
  "url": "https://www.bbc.com/news/articles/c708xl90d29o",
  "title": "The disappeared department stores of London days gone by",
  "date": "20241227T083000Z",
  "domain": "bbc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "London's disappeared department stores of days gone by\nOnce the bastion of middle-class ladies going up to town to shop, with deferential and attentive staff and a respectable place to lunch, department stores were a world away from today's shopping habits of e-commerce, fast fashion and middle aisles filled with snorkels, ladders and tapestry kits.\nIn the early 1900s, London had more than 100 - each offering a huge range of goods.\nHere are just some of the capital's behemoths of the time, now gone from the streets and all but gone from the memory.\nBourne & Hollingsworth, 1894-1983\nIf in 1969 one wanted to \"go gay Mexican\" as one advert put it, a remarkable garment called \"poncho pyjamas\" became available at Bourne & Hollingsworth on Oxford Street.\nThe promotion continued: \"Forget about sleeping in them. These are for girls who are wide awake to the trendiest fashions. Wear them for lazy evenings at home - or get-up-and-go to a party in them.\"\nThe brushed acrylic outfit, with a cowl neckline, flared trousers and bobble trim, was available in pink, blue, royal, green, red or white and retailed for £6 12s. 6d.\nIn today's money, allowing for inflation, that's just over £100.\nBourne & Hollingsworth also had a staff hostel for unmarried females on Gower Street, where presumably shop wages were insufficient to clad every resident in poncho pyjamas, no matter how much they wanted to go gay Mexican.\nOne hostel resident remembered: \"I first worked in the ladies' suit department and remember selling a suit to the actress Billie Whitelaw.\n\"When a client entered the department, the buyer would say 'forward 596' - we were given numbers instead of being called by our name.\n\"I loved my time there and frequently swam in the pool in the basement, and played table tennis in the ballroom.\"\nGamages 1878-1972\nIn 1878, 21-year-old Albert Gamage decided to use his savings of £40 (about £4,000 today) to open his own shop.\nHe and another man, Frank Spain, clubbed together and leased a small premises in Holborn.\nThe frugal pair lived in a back room and allowed themselves a maximum of 14 shillings a week for all expenses.\nMr Gamage bought out Mr Spain in 1881, and began to buy other small properties around his shop to expand the business.\nBy 1890, most of the block between Leather Lane and Hatton Garden was his.\nThis piecemeal method of acquisition led to the ever-growing emporium becoming a maze of ramps, passages and rooms, adding an element of adventure for customers as they wandered in search of bargains.\nA zoo department and a toy department were joined by a motor department selling cars, motorbikes and all associated accoutrements.\nTheir mail-order catalogues became famous for their offerings of toys and bicycles in particular.\nGamages also became the official supplier of Cub Scout uniforms.\nOne promotion in 1936 saw an elephant named Mae West co-opted to promote the Christmas bazaar.\nShe was photographed accepting an apple from a passing tram driver while ambling along Gray's Inn Road.\nThe image had an interesting future - it was often circulated with the false story that the notorious Kray twins used a stolen elephant to extort protection from tram drivers.\nIn 1910 it was announced Mr Gamage had \"invented a non-concussion flying helmet\" to protect aviators.\nHe died in 1930, without being concussed in the field of aviation, aged 74. He and his wife Jane had three sons and a daughter, lived in a manor house, and had nine servants.\nThe Holborn premises closed in March 1972 and disappeared in a massive redevelopment scheme.\nPratts c.1845-1990\nCaptain Darling, Blackadder's nemesis in the final series, worked at Pratts before World War One.\nIn one poignant scene, he said: \"Rather hoped I'd get through the whole show.\n\"Go back to work at Pratt and Sons, keep wicket for the Croydon Gentlemen, marry Doris...\"\nPratt's story began in 1840 when 13-year-old George Pratt started a drapery apprenticeship in Streatham Village. About five years later he bought the shop.\nOnly a small part of the building went above ground floor level, resulting in selling space on the lower-ground and ground floors only.\nEventually, departments were moved out of the main building. Soft furnishings went across the street, the dress department was moved further up the road, and warehousing was developed at two more locations.\nThe store was bought by Brixton rival Bon Marché in 1919, which in turn was bought by Selfridges in 1926.\nAnd then in 1940, the John Lewis Partnership bought it all.\nChiesmans 1884-1976\nTwo brothers, Frank and Harry Chiesman, opened a drapery shop in Lewisham in 1884.\nThe company became involved in recruiting for the war effort in 1914, even erecting a tent as a place for men to sign up to the local regiment.\nMen who served were written on an honour roll displayed at the store's original premises, Paris House.\nThe importance of the firm to previous employees was demonstrated when news of their exploits were printed in the local press, as the source was often other former employees.\nLewisham Borough News had updates gleaned from letters sent to Chiesmans.\nIn August 1915, FG Dawe wrote: \"I sincerely hope one or the other of the boys have kept you informed of our well-being.\"\nHe mentions a colleague, \"Pte McCrow has just recently joined us, so the firm is well represented.\"\nHe asked after ex-Chiesmans men serving elsewhere, refers to having seen a postcard of the roll of honour and asks the firm to send him a copy.\nMacrow is listed on the honour roll as having joined up in 1914. He was killed in action in December 1915.\nAnd the correspondent, FG Dawe, was killed at the Battle of Loos, just a month after writing his letter.\nStuart Chiesman, son of Frank, was wounded in the foot on the Somme in 1916 and medically discharged from the Army.\nHe was recovering in Brighton when - as recounted by the Blackheath Advertiser in July 1917 - he made a daring rescue of an eight-year-old girl.\n\"He threw down his crutches, tore off his tunic, and dived from the top of the pier.\n\"He brought the little girl, who was unconscious and in a serious state of collapse, to safety, although the wounded left leg - heavily bandaged - hung like a log in the water, the wound suppurating.\n\"Whilst he was engaged in rescuing the child, his gold watch and £5, left in his tunic pockets, were stolen.\"\nWhiteleys, 1863-1981\nUnlike the family atmosphere nurtured by the Chiesman brothers, William Whiteley had a hard head for business.\nIn 1848 he apprenticed to a large drapery in Wakefield, and after a visit to the Great Exhibition at Crystal Palace he set his ambitions on establishing his own vast emporium.\nBy 1863 he had enough money to set up in Westbourne Grove and by 1875 he had an unbroken row of shops.\nBut he was not well liked.\nSmaller businesses were annoyed he was taking their customers - he offered such a range of products at low prices that in 1876 a group of Bayswater tradesmen burned his effigy on Guy Fawkes Night.\nWhiteleys was set fire to a number of times.\nIn 1887 the New York Times ran an article called The Burning of Whiteley's Great Establishment: \"The loss is estimated at $2,500,000 – incendiarism is suspected.\"\nThe Times newspaper said: \"The outbreak could not be subdued until three large buildings, each of five floors, had been completely gutted, and three others very seriously damaged by fire, heat, and water.\n\"It was quickly seen by the firemen that the fire threatened to prove of as destructive a character as the three which have preceded it on the same spot in the last three years.\"\nOn 24 January 1907, William Whiteley was shot dead.\nA young man claiming to be his illegitimate son, Cecil Whiteley, had confronted him in his office, and tried to blackmail him.\nOn being sent away with a flea in his ear, \"Cecil\" shot Mr Whiteley and then himself.\nMr Whiteley died - Cecil, who was actually called Horace Rayner, did not.\nRayner had convinced himself of the family connection because his father and Mr Whiteley had both been \"friendly\" with a pair of sisters and would visit them together.\nThere was a quarrel, and the two men fell out, never to be friends again. One of the sisters was Rayner's mother.\nRayner was later convicted of murder and sentenced to death, commuted to a life term.\nHe was freed from prison after serving 11 years.\nAccording to heritage body Historic England, there was no luxury for the working-class women and girls Whiteleys \"exploited\" as shop assistants.\nAssistants had to stand all day, and were expected to work six days a week from 07:00 until 23:00.\nThey were forced to live at the shop, dine in the staff cafeteria - and pay for the poor-quality food provided.\nA letter from a member to the Shop Assistants' Union testified: \"The bedrooms are like barns, with water trickling down the walls…and we cannot sleep for the cold.\"\nWorkers were not allowed to go out, and could be fined for \"gossiping and idleness\".\nIn May 1880, the Kilburn Times reported a London shop girl had \"drowned herself, the act being attributed to excessive pain from standing for so many hours in the shop\".\nThe Pall Mall Gazette suggested in December 1887 that employers could \"provide reasonable comfort consistent with the business interests of the establishment,\" such as an afternoon a week off, and permission to sit down when it did not interfere with the job.\nSuch small comforts, though, did not transpire.\nFollowing his death, Mr Whiteley's two sons carried on operating the business, eventually selling to Gordon Selfridge in 1927.\nMarshall & Snelgrove 1837-1974\nAnother grand establishment on Oxford Street, Marshall & Snelgrove had an air of exclusivity cultivated by maintaining an on-site couturier workroom to supplement the ready-to-wear lines.\nA position as an apprentice in the store was so prestigious it could only be secured with a deposit of 60 guineas.\nIt even opened branches in fashionable resorts such as Scarborough and Harrogate to enable their customers to shop while on holiday.\nThe privations of World War One forced it, as a luxury brand, into partnership with Debenhams.\nThe arrangement carried on until 1919, when a full merger was made - although the Oxford Street store continued to trade under the Marshall & Snelgrove name.\nIn 1974 the building was renovated and the name was changed to Debenhams.\nOne of the extracurricular successes of Marshall & Snelgrove was its football team.\nCompeting as West End, the team's first recorded match was in October 1873, and in the 1879-80 season it reached the fourth round (last 10) of the FA Cup.\n(This achievement might be tempered with the knowledge the team benefited from one bye, and one walkover when another team withdrew.)\nIn the West End Challenge Cup - a more modest endeavour set up in 1881 for works sides from \"large retail houses\" they beat the Prairie Rangers (Harvey Nichols) 3–0 in the final in front of a crowd of 1,500.\nThe write-up included the memorable line \"Foster scored twice - the second by breasting home a corner\".\nListen to the best of BBC Radio London on Sounds and follow BBC London on Facebook, X and Instagram. Send your story ideas to hello.bbclondon@bbc.co.uk",
  "word_count": 1914,
  "scraped_at": "2026-02-14T12:33:39.374410"
}