{
  "article_id": "0787e5b8b4f1",
  "url": "https://www.popsugar.com/fitness/wnba-expansion-draft-49414908",
  "title": "How Does the WNBA Expansion Draft Work ? | POPSUGAR Fitness",
  "date": "20241128T213000Z",
  "domain": "popsugar.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Golden State Valkyries' Expansion Draft Could Shake Up Your Favorite WNBA Team\nThe Golden State Valkyries, the WNBA's 13th and newest franchise, will officially begin play in 2025. It's been 16 years since a new team joined the WNBA — the last time a new team joined the league was in 2008, when the Atlanta Dream hit the scene.\nAt that time, Barack Obama was elected president of the United States and the number one song in America was \"Low\" by Flo Rida featuring T-Pain. Months prior, Diana Taurasi, now the league's all-time leading scorer, won her first WNBA championship for the Phoenix Mercury. In other words, it's been a long time coming.\nWNBA players and fans have long clamored for league expansion because of how difficult it is for players to make final rosters and the fact that the league has had franchises in only 12 US cities since the late 2000s.\nFortunately, the Valkyries will offer an expanded roster (from the traditional 144 spots to 156) and even more WNBA representation on the West Coast. But how will the players be chosen? While the Valkyries have hired their head coach, president, and general manager, an expansion draft must take place to fill the roster — which means some of your favorite players may be switching teams. Ahead, we break down everything you need to know about the upcoming expansion draft, which players are protected, and how to tune in.\nWhat Is an Expansion Draft?\nAn expansion draft is a tool that is used in most professional American sports to help begin to build the roster of a new team. An expansion draft allows the new team joining a league to be able to select players from each of the existing teams. This aims to ensure that expansion teams begin with some established pro-level talent.\nHow Does the WNBA's 2024 Expansion Draft Work?\nAccording to a release from the WNBA, the Golden State Valkyries can select or draft at most one player from each WNBA team's roster of players. This roster includes both players who were active in 2024 and those whose negotiating rights have been retained by a team despite them being inactive. But according to Her Hoop Stats, a women's basketball analytics newsletter, the Valkyries don't have to select a player from each team. If there's a team that doesn't have players Golden State sees value in, the Valkyries can simply pass on picking up a player.\nWhich Players Can and Cannot be Drafted?\nTo make sure that the existing franchises aren't at risk to lose all of their best players in the expansion draft, there's something called a protected list, and these are players that the Valkyries cannot select. Before the expansion draft, current teams can designate six players to their protected list who were either on their roster in 2024 or that they have negotiating rights with, per the WNBA.\nThe front office of each team submitted their protected list 10 days before the date of the draft. In this case, lists were submitted by the end of the day on Monday, Nov. 25.\nNow, outside of these six untouchable players from each team, most of the rest of a team's roster can be drafted — with a few caveats. To understand which players can and cannot be drafted in the expansion draft, it's vital to understand the types of designations that are given out to players in the WNBA.\n- Core Players: These are designations mostly given to a team's most talented player. It's very similar to the NFL's franchise tag, a designation given to a franchise player to prevent them from leaving in free agency. Since the WNBA's 2020 collective bargaining agreement, players are allowed to be cored just twice, per Her Hoop Stats.\n- Unrestricted Free Agent: This is a designation given to a player who isn't signed to a contract or whose previous contract expired, allowing them to negotiate with any team.\n- Restricted Free Agent: This is a designation given to a player who can be offered a contract by a different team besides their former team. But, their former team has the first right of refusal and can match the offer from that different team.\nNow back to who can and cannot be drafted by Golden State, according to the WNBA:\n- The Valkyries CAN draft restricted free agents that aren't on a team's protected list.\n- The Valkyries CANNOT draft an unrestricted free agent who has been cored twice. This includes players such as Brittney Griner, Nneka Ogwumike, Tina Charles, Brionna Jones, DeWanna Bonner, and Natasha Howard, per CBS Sports.\n- The Valkyries CAN draft an unrestricted free agent that hasn't been cored twice but ONLY one player out of the 12 can be unrestricted. That unrestricted free agent that Golden State selects can be designated as the Valkyries core player if the team chooses.\nWhich Players Are Protected?\nThe short answer right now is we don't know. A source close to the situation told PS that the WNBA chose to make the protected lists private instead of releasing them to the public to preserve relationships between teams and their players.\nThe WNBA hasn't run a draft like this in over a decade. Current front offices are novices to a process like this and realize that public lists and the expansion drafts themselves put players in vulnerable positions.\n\"To be honest, I think the hardest thing about this is what the players are going through,\" Los Angeles Sparks General Manager Reagan Peebly told PS in a recent press conference. \"There's an unknown for them. And when I try to position myself in their shoes, goodness gracious, that's hard, and I'm looking at them right now like they're going to find out at the same time that we find out and the world finds out. That's tough. But again, there's growth in our league that's happening. I think this is the right way to go about it.\"\nOther leagues have decided to make these lists public, and there have been major ramifications as a result. The National Women's Soccer League, for example, has run three expansion drafts in the past four years, and the most recent expansion draft that happened nearly a year ago led to upheaval from players and coaches. Retired star Alex Morgan proclaimed that expansion drafts shouldn't exist.\n\"I don't think people actually realize the damage that is created by this process and what it does to players, clubs, and those relationships,\" Sean Nahas, head coach of the NWSL's North Carolina Courage, wrote on social media.\nAs a result, the NWSL's players association successfully bargained for the abolishment of all drafts, including amateur and expansion. A reminder: The WNBA's players union recently opted out of their current collective bargaining agreement. This all begs the question: Would public-protected lists in the WNBA create a similar upheaval? And could the players push for a similar ban on drafts? Only time will tell.\nCan a Current Team Block the Valkyries From Selecting a Player Outside the Protected List?\nKind of. In the ten days leading up to the expansion draft, teams can offer the Valkyries draft picks or player rights in exchange for Golden State Valkyries refraining from picking a certain player.\nWhat Other Ways Can the Valkyries Build Their Roster?\nThe expansion draft gives the Golden State Valkyries a foundation to begin with, but it doesn't marry Golden State to any of the players. Between the expansion draft and the first day of the 2025 regular season, the Valkyries can release or cut players they chose during the expansion draft.\nThe rules of the expansion draft allow the Valkyries flexibility. If the Valkyries negotiate and sign a free agent that they like better than someone they drafted in the expansion draft, they can trade that player or release them. The same goes following the amateur draft in April.\nThat said, the WNBA operates behind a salary cap, which means there's a limited amount of money each team can spend combined on players. According to WNBA salary cap expert Richard Cohen, \"expansion draft picks can be cut to immediately create more space.\"\nHow to Watch the Golden State Valkyries Expansion Draft\nESPN, one of the WNBA's primary television partners, will air the expansion draft on Friday, Dec. 6. The 30-minute special will air following the network's 6 p.m. ET edition of SportsCenter, and prior to an NBA doubleheader that features the Valkyries brother franchise, the Golden State Warriors.\nAfter Dec. 6, the Valkyries, the WNBA's 13th franchise and first expansion franchise in 16 years, will finally have some players. But this is just the beginning for the WNBA and expansion drafts.\nIn about a year's time, the league will go through this process once again. The Valkyries will be on the other side this time with two new teams from Toronto and Portland acquiring players from the 13 other WNBA franchises, making for a pretty exciting future for the league.\nJackie Powell has covered women's basketball since 2019, including college basketball, the WNBA, and international and high school prospects. In addition to PS, her work has appeared in Bleacher Report, Yahoo Sports, The Next, Sports Illustrated, the Hartford Courant, Slam, and Harper's Bazaar, and she hosts the \"Locked On Women's Basketball\" podcast every other week.",
  "word_count": 1557,
  "scraped_at": "2026-02-14T12:18:30.733634"
}