{
  "article_id": "07e2fdac4e4f",
  "url": "https://www.theguardian.com/science/2025/jul/28/englands-womens-euro-2025-penalty-hero-hannah-hampton-defies-eye-condition-with-study-and-strategy",
  "title": "England women Euro 2025 penalty hero Hannah Hampton defies eye condition with study and strategy | Science",
  "date": "20250728T180000Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Hannah Hampton had already saved one penalty in the shootout against Spain at Euro 2025 when Aitana Bonmatí, the back-to-back winner of the women’s Ballon d’Or, placed the ball on the spot and stepped back, taking a moment before the strike. Bonmatí thumped the ball hard and left, but Hampton was there, arms outstretched, to block the shot with both hands.\n“Better pens than the last time, let’s be honest!” Hampton said after the match, a reference to the more painful shootout against Sweden in the quarter-final that went to sudden death before England prevailed. Hampton saved two penalties that time, too.\nIt was an extraordinary tournament for Hampton, the Chelsea player who only became England’s first choice goalie in May after the retirement of Mary Earps from international football. Hampton’s penalty-saving record is perhaps even more impressive given that doctors told her that, because of an eye condition, she wouldn’t be able to play football.\nHampton was born with strabismus, or a squint, meaning that when she was looking at an object with one eye, the other would be looking in another direction. It was severe enough that she had three operations by the age of three to correct the misalignment. The surgery was not a complete success: Hampton told the i paper in 2022 how she would try to pour juice into a glass and miss if she wasn’t holding it.\nDuring a medical check-up at Stoke City, when Hampton was 12, doctors diagnosed another problem. She had impaired depth perception, meaning she struggles to tell how far away objects are. It is often seen in patients with strabismus.\n“Depth perception requires our eyes to be aligned, really from birth, and also for the visual input from the two eyes to be equal,” says Prof Jugnoo Rahi, an ophthalmic epidemiologist at the UCL Great Ormond Street Institute of Child Health. If children have misaligned eyes, the brain suppresses the input from one eye because the brain cannot cope with double vision. “If that goes on for a long time, if you can’t align the eyes through surgery, for example, then you get permanently reduced vision in one eye,” she adds.\nBut children who have limited depth perception grow up using other cues, the most obvious being that objects appear smaller when further away. It’s often the finer perception tasks that are most affected – threading a needle more than intercepting a speeding football. “People do learn,” Rahi says, “And I suspect if you’re also particularly talented and your hand-eye coordination is good, you may be better able to overcome that.”\nFrom Stoke City to Aston Villa and Chelsea, Hampton has certainly learned. After countless bloody noses and broken fingers from stopping the ball too near her face, or having her hands in the wrong position, she made a conscious effort to alter her hand position. It hasn’t stopped all the blood: in extra time against Sweden, a collision left her with absorbent tissue up her right nostril.\nHampton might be compensating in other ways, too. Setting aside the notes she had taped to her arm before the shootout with Spain – evidence she had done her homework – Hampton might be finely attuned to the subtle cues penalty takers reveal. And given the fraction of a second a goalie has to respond once the ball is kicked, these might be more important than depth perception.\nIn his book, The Penalty Kick: the Psychology of Success, Prof Daniel Memmert at the German Sport University in Cologne dissects the science of the art. Body movement is particularly revealing, he says. When a right-footed striker aims for the left corner, the supporting leg, hip and upper body all start to rotate to the left. If the goalie is looking, “they can anticipate the direction of the penalty”, he says. “It’s extremely difficult not to move the limbs like this if you are going for the left corner, and good goalies have this picture.” Often, such cues are picked up subconsciously, he adds.\nAnd then there are the tricks goalies can play. When goalies make themselves big – throwing their arms out in a Y-shape – strikers tend to shoot closer to the goalie. But it’s not the only tactic. “One of the most important factors is that you make the striker feel that one of the corners has a little more space,” says Memmert.\nIf the goalie stands slightly off centre – no more than 10cm left or right – a penalty taker who is still making up their mind will often shoot to the side with slightly more room. Even if they cannot perceive the extra space. If a goalie knows a striker favours one side, making a little more room can nudge them more in that direction, giving the goalie an advantage. “It’s the best trick a goalie can do because the striker will never know if the goalie is standing exactly in the middle or not,” says Memmert.",
  "word_count": 830,
  "scraped_at": "2026-02-14T12:58:37.214763"
}