{
  "article_id": "083569ab070f",
  "url": "https://home.nzcity.co.nz/news/article.aspx?id=371064&fm=psp,tst",
  "title": "The Breakers are one win away from the Australian basketball league finals after beating Tasmania 88 - 68 in their first semi - final play - off game in Auckland - both sides have caught the last flight out of Auckland ahead of Cyclone Gabrielle canc...",
  "date": "20230212T180000Z",
  "domain": "home.nzcity.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "News | Soccer\n14 Feb 2026 20:09\nNZCity News\n13 February 2023\nGolfer Michael Hendry has secured victory at the Victoria Open - he finished at 21-under par to win by four strokes.\nThe Wellington Phoenix men have again relinquished a lead for the eighth time this season to lose 2-1 to Macarthur FC and stay sixth on goal difference in football's A-League.\nThe club's women lost 1-nil at Western Sydney - they remain last.\nManchester United have scored twice late to beat Leeds 2-nil in the Premier League.\nThey're second ahead of Manchester City for now but City are poised to reverse the standings - they're up 3-nil over Aston Villa at halftime.\nPatrick Mahomes' reputation faces a test in today's Super Bowl LVII .\nHis Kansas City Chiefs take on the Philadelphia Eagles in Phoenix, Arizona - with the 27-year-old quarterback looking to get a second Super Bowl victory from three on his record.\nNorth Queensland and NRL league newcomers the Dolphins couldn't be separated over 80 minutes in Cairns as the sides began their pre-season trials with a 22-all draw.\nEngland are on the scoreboard in rugby's Six Nations, bouncing back from last week's home defeat to Scotland with a 31-14 win over Italy at Twickenham.\nA communication misunderstanding or brilliant alpha gamesmanship from Nagpur ground staff after Australia lost the first cricket test of the four-match series inside three days to India?\nThe visitors requested for pitches to stay dry so they could practice before heading to Delhi tomorrow for the second match starting Friday.\nThey turned up at the ground to find them drenched and unsuited for any use other than a potential pottery class.\nDouble time trial world champion and Olympic medallist Rohan Dennis has confirmed he will retire from professional cycling at the end of his season - he's 32.\n© 2026 Newstalk ZB, NZCity\nThe Wellington Phoenix men have again relinquished a lead for the eighth time this season to lose 2-1 to Macarthur FC and stay sixth on goal difference in football's A-League.\nThe club's women lost 1-nil at Western Sydney - they remain last.\nManchester United have scored twice late to beat Leeds 2-nil in the Premier League.\nThey're second ahead of Manchester City for now but City are poised to reverse the standings - they're up 3-nil over Aston Villa at halftime.\nPatrick Mahomes' reputation faces a test in today's Super Bowl LVII .\nHis Kansas City Chiefs take on the Philadelphia Eagles in Phoenix, Arizona - with the 27-year-old quarterback looking to get a second Super Bowl victory from three on his record.\nNorth Queensland and NRL league newcomers the Dolphins couldn't be separated over 80 minutes in Cairns as the sides began their pre-season trials with a 22-all draw.\nEngland are on the scoreboard in rugby's Six Nations, bouncing back from last week's home defeat to Scotland with a 31-14 win over Italy at Twickenham.\nA communication misunderstanding or brilliant alpha gamesmanship from Nagpur ground staff after Australia lost the first cricket test of the four-match series inside three days to India?\nThe visitors requested for pitches to stay dry so they could practice before heading to Delhi tomorrow for the second match starting Friday.\nThey turned up at the ground to find them drenched and unsuited for any use other than a potential pottery class.\nDouble time trial world champion and Olympic medallist Rohan Dennis has confirmed he will retire from professional cycling at the end of his season - he's 32.\nBlues fullback Zarn Sullivan has fresh motivation heading into the Super Rugby Pacific season More...\nOpenAI has deleted the word ‘safely’ from its mission – and its new structure is a test for whether AI serves society or shareholders More...\nBijou Phillips has launched an urgent appeal to find a kidney donor 19:51\nEntertainment:\nStacy Keibler says it was a \"gift from God\" to be with James Van Der Beek in his \"final days\" 19:21\nHealth & Safety:\nTwo sailors have been hospitalised after a nasty crash between the Black Foils and France, forcing the cancellation of racing for the day at the Auckland Sail GP event 18:57\nEntertainment:\nJames Van Der Beek's widow has launched a GoFundMe 18:51\nRugby:\nBlues fullback Zarn Sullivan has fresh motivation heading into the Super Rugby Pacific season 18:37\nEntertainment:\nNick Jonas admires Priyanka Chopra's \"willingness to get her hands dirty\" 18:21\nPolitics:\nThe US government has just entered another shutdown. Here's what it means this time 18:17\nCricket:\nAn international sporting rivalry is set for another chapter 18:07\nEntertainment:\nJennifer Garner channelled her dance background in The Last Thing He Told Me 17:51\nRugby:\nNews Chiefs recruit Kyren Taumoefolau is looking to continue his momentum after being named to start on the right wing for tonight's Super Rugby Pacific clash with the Blues in Auckland 17:37\nPower Search",
  "word_count": 811,
  "scraped_at": "2026-02-14T12:39:13.059522"
}