{
  "article_id": "08471a04915c",
  "url": "https://www.bbc.com/sport/football/articles/c753l17rgkdo",
  "title": "Goodison Park : Everton women team to use stadium as new home as demolition cancelled",
  "date": "20250513T203000Z",
  "domain": "bbc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Goodison Park to become home of Everton's women\n- Published\nGoodison Park is to become the home of Everton's women after the club scrapped plans to demolish the 132-year-old stadium.\nThe Blues will move to their new 53,000-seater arena at Bramley-Moore Dock this summer.\nDuring construction of the new facility on the Liverpool waterfront, Everton's previous ownership group announced plans for an £82m post-demolition renovation project at the Goodison site, which was set to include housing, a care home, retail units and a park.\nBut after being taken over by private investment firm The Friedkin Group in December, the club conducted a feasibility study about maintaining the stadium as a home for the women's team, and have now opted to continue operating the site.\nWith a capacity of 39,572, Goodison Park will now be the largest dedicated women's football stadium in the country.\n\"This long-term vision reflects the club's commitment to investing in the women's game and ensuring that Goodison Park continues to play a vital role in both football and the community,\" Everton said.\n\"The club's regeneration plans will retain Goodison Park's proud identity while giving Everton Women a world-class platform in the heart of Liverpool 4. For supporters, it offers the chance to be part of a new era in one of football's most iconic venues.\"\n\"The ambition is to create a team capable of challenging for honours - backed by high-quality facilities and a world-renowned home.\"\nThe club's CEO Angus Kinnear added: \"We know how treasured Goodison is, not only to every Evertonian, but to the game itself, and being able to keep such an iconic stadium at the heart of the legacy project is something that has been incredibly important to us.\"\nEverton's women's team have played at Walton Hall Park, one mile away from Goodison, since 2020. The stadium has a capacity of 2,200, but only 500 of those places are seated, and its pitch is a hybrid of real and artificial grass.\nPreviously one of the strongest women's teams in the country - including winning a league title in 1998, two domestic cups in the late 2010s, and reaching the quarter-finals of the Champions League in 2011 - Everton underwent a gradual decline in performance under previous owner Farhad Moshiri.\nThe Blues finished no higher than fifth in the Women's Super League (WSL) during the Iranian's time in charge, and ended this season's campaign in eighth. Their average home attendance was 2,062.\nBBC Sport understands Everton plan to improve Goodison Park's changing room facilities, and rebrand the exterior of the stadium to reflect the women's team's history and current squad, while Walton Hall Park will continue to be used to offer a space for grassroots football in Liverpool, predominantly in the girls' game.\n\"I'm beyond thrilled for the women's team,\" Julie Clarke, secretary of the Everton Fan Advisory Board, told BBC Radio 5 Live. \"Men's teams think Goodison is one the hardest grounds to go to, so hopefully that can become the case for the women's team.\n\"It's a huge commitment from our new owners. They wasted no time and spotted this opportunity. We've always said that Everton is more than a club, it's a community.\n\"The easy option would have been to sell up the land and make a profit. But they've done the right thing by continuing to invest in the community.\n\"We're not going to fill up a 40,000 capacity stadium immediately. But now, however big women's football gets in England, Everton will be ready for it in an iconic ground.\"\nFormer Everton and England goalkeeper Rachel Brown-Finnis added: \"It is fabulous news. The women's team including myself have played at Marine Football Club, we've played at Widnes Rugby League, we've played at lots of different homes but they have never felt like homes.\n\"It feels like this is Everton Women coming home.\"\nEverton also announced that Goodison Park will host selected academy matches from next season.\nThe club's under-21s side currently plays its home fixtures 16 miles away at the 6,000-capacity Haig Avenue stadium in Southport, but last week Everton opted not to renew that agreement.\nThe only player in the current Everton first-team squad who graduated from the club's youth academy is backup goalkeeper Joao Virginia, who signed from Arsenal at the age of 19 before spending a single season in the Blues' youth set-up.\nEverton will play their final men's first-team match at Goodison Park on Sunday (12:00 BST) against already-relegated Southampton.\nFor some fans who have spent months preparing for an emotional permanent farewell to Goodison, the news has realigned their emotions to an extent.\n\"There has been all this build up throughout the season, with the club saying 'there are two games to go at Goodison', 'there is one game left to go',\" said Barry Williams, a member of Everton fan's forum.\n\"And now it turns out it's still going to be there in September. I'm glad it's staying, but it feels like a bit of an anticlimax.\"\n'New owners have strong track record in women's game' - analysis\nEmma Sanders - BBC Sport senior women's football reporter\nEverton's women's team's future under the club's new owners - who have ambitions to return them to former glories - is an exciting one.\nOne of the eight founding clubs of the WSL - the first professional league in England - Everton's history runs deep.\nGoodison Park is a stadium rich with memories and the club hopes familiar surroundings can help grow the fanbase of the women's team and enable them to embark on a new journey under The Friedkin Group.\nThe signs have already been positive with investment provided in the January transfer window to improve Brian Sorensen's squad, and the Blues are looking to add more quality this summer.\nThe Friedkin Group has a strong track record of investment in women's football. Following their acquisition of a majority stake in AS Roma in 2020, they have won the women's Supercoppa Italiana twice in the past three years, and compete in Serie A - the top tier in Italy.",
  "word_count": 1012,
  "scraped_at": "2026-02-14T13:20:48.100226"
}