{
  "article_id": "085f3330b62f",
  "url": "https://www.yahoo.com/news/years-chaos-tyreek-hill-says-090000677.html",
  "title": "After years of chaos , Tyreek Hill says he cleaning up his life .  I lost my true self  ",
  "date": "20240317T094500Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "After years of chaos, Tyreek Hill says he’s cleaning up his life. ‘I lost my true self’\nTyreek Hill is one of the biggest names in the NFL, and no stranger to making headlines. His prowess on the field has earned him widespread recognition; his actions off the field, at times, a lot of scrutiny.\nHill was back in the limelight after a social media influencer and OnlyFans model who had enrolled her son in Hill’s football camp sued him in late February, accusing him of “violently” charging at her during a “friendly football lesson” at his Broward mansion, breaking her leg.\nThis isn’t the first time allegations of violence have surfaced surrounding Hill, 30, the Miami Dolphins star wide receiver. When in college, he pleaded guilty to throwing around his ex-fianceé “like a ragdoll” and was ordered to take anger management classes. When playing for the Kansas City Chiefs, Hill was the subject of a criminal investigation that was ultimately closed without charges after his 3-year-old son broke his arm. As a Dolphin, Hill was accused of slapping a charter boat worker after a day of deep-sea fishing.\nMost recently, police were called to his home in January after his wife’s cousin said she overheard him screaming at his wife, public records obtained by the Miami Herald reveal. Hill also is facing two paternity suits involving two women, each claiming he is the father of their child.\nHill’s football fraternity — the Dolphins’ top brass, coaches and his teammates — say Hill has changed since those headlines from earlier days. Shortly after a fire accidentally set by a child destroyed part of Hill’s Broward home in January, Dolphins quarterback Tua Tagovailoa told reporters that Hill was a strong person who had been dealing with a lot.\nAs he approaches eight years in the National Football League, Hill, who didn’t respond to the Miami Herald’s requests for an interview, talked in a recent podcast about how he’s “cleaning up” his life and trying to return to the faith-based roots of his grandparents.\n“I lost my true self from what my grandparents raised me to be when I entered the league,” Hill told the podcasters. “I completely forgot my relationship with God. And it really showed.”\nTroubles began in college\nIn 2014, Hill was kicked off the Oklahoma State University football team after pleading guilty to domestic assault and battery by strangulation after attacking his then-pregnant fianceé. He received three years probation and was ordered to complete a year-long anger management course, according to news reports.\nCourt records from the Oklahoma conviction — and legal action later taken in Kansas by Hill’s ex-fianceé, Crystal Espinal — were sealed.\nWith Hill’s criminal conviction, top-tier universities weren’t risking a bet on the star athlete, widely regarded as a top NFL draft pick. Coach Brett Gilliland of the University of West Alabama saw a different side to 20-year-old Hill, however.\nMore in Sports\nBarcelona fans tear into several players amid Atlético disaster\nAt the time, Gilliland told reporters that his first reaction to taking on Hill after reading his arrest report was “No.” But then he spoke to Hill’s previous coaches and mentors — and the player himself.\n“As you get to know the kid, get to know the people behind the kid, we started coming around to ‘Hey, there’s more to this,’” Gilliland told the Kansas City Star in 2016.\nGilliland also mentioned being swayed by Hill’s plea deal, which required that he work full-time or remain a college student. Hill’s conviction was expunged in 2018.\n“I did something I shouldn’t have done,” Hill told the judge while pleading guilty. “I let my feelings take control of me.”\nWhen they first talked in Gilliland’s office, Hill declared that he wanted to be one of the best players in the game, the coach recalls. He also wanted to prove that he was worthy of another chance.\n“He felt like he was not being seen in the light that he wanted people to view him in,” Gilliland said in an interview with the Herald. “He just came across like he wanted a chance to prove he wasn’t what people were viewing him as.”\nFor Gilliland, one of the things that stuck out the most about the standout was his mind-set: “He didn’t come in here as a guy that felt so highly of himself that he didn’t think he had to practice. He came every day to compete and to work. He had something to prove, and he wanted to prove it on the field and off it.”\nAfter a year at West Alabama, Hill was drafted in the fifth round (165th overall) of the 2016 NFL Draft by the Chiefs, who added quarterback Patrick Mahomes the following year.\nWhile still suiting up for the Chiefs in 2019, Hill and Espinal, his fianceé at the time, were investigated by Kansas’ child welfare agency after their 3-year-old son broke his arm. Child-welfare investigators temporarily removed the boy from their custody.\nProsecutors said they believed a crime was committed against the toddler but they didn’t press charges, saying there was no way to prove who did it.\n“We are deeply troubled by this situation and are concerned about the health and welfare of the child in question,” Kansas prosecutor Steve Howe told the Kansas City Star. “A child has been hurt. So, yes, as a prosecutor, as a father of four kids, yes, it frustrates me when someone hurts a child that you can’t do anything about it.”\nA fresh start in Miami\nBefore trading for Hill in 2022, the Dolphins said they spoke to a range of people in and out of the league connected to the wide receiver.\nTeams typically conduct background checks on draft prospects, which can be as little as talking to people that grew up around them or spent time with them in college, or as thorough as speaking to law enforcement and looking into past legal troubles if a player has had a run-in with the law.\nWhat the Dolphins uncovered, however, quelled the team’s anxiety.\n“Going forward, we feel good about it,” Dolphins general manager Chris Grier said in 2022. “We talked to a number of people that have been around Tyreek, especially in Kansas City the last few years. For us, we’re comfortable moving forward and the expectation, like him, will be for every player on the roster — it’s to be a good teammate and a good citizen in South Florida.”\nMiami signed Hill to a four-year, $120 million deal that made him the highest-paid wide receiver in the NFL. He led the league with 1,799 receiving yards this past season and was voted to the Pro Bowl for the eighth consecutive year as well as to the Associated Press All-Pro first team.\nWhile he boasts a glowing resume with the Dolphins, he has been no stranger to media attention — and controversy — throughout his time in Miami.\nHaulover incident\nIn June, after a deep-sea fishing outing, Hill exchanged words with at least two men who told him fishing from the Haulover Park Marina dock was off-limits. Hill had been trying to hook some of the big tarpon that hang around the charter fleet looking for scraps, a prohibited practice, according to the Herald’s reporting at the time. One of the men accused Hill of slapping him on the back of the head.\nThe Miami-Dade State Attorney’s Office closed the investigation in August without filing any charges.\n“I just can’t make boneheaded mistakes like that,” Hill told reporters.\nFire at his home\nOn Jan. 3, a fire engulfed a portion of Hill’s $7 million mansion at Landmark Ranch Estates near Davie, causing more than $2.3 million in damages. The early afternoon fire was caused by two children accidentally playing with a lighter, setting ablaze a cloth toy and, in fear, throwing the lit toy into a bedroom closet, before running out of the room, a Davie Fire Rescue report concluded. One of the children accidentally caused the fire, the report said, citing “statements made to investigators by the police.”\nHill’s wife, mother and the two children were inside the home; no one was injured.\n“Although it sucks to see rooms destroyed and everything you worked for destroyed, my main thing was health and making sure my kids are alright,” Hill said. “My wife’s good, my mom’s good and my nephews are good. So, that’s all that matters.”\nShortly after the fire, Tagovailoa told reporters that Hill is a strong person with a good outlook on life.\n“He has a good perspective [like,] ‘It’s not about me,’” Tagovailoa said. “And how he copes with it is definitely different. You can tell he’s mentally strong with how he goes about doing his business.”\nTwo weeks after the fire, on Jan. 22, Hill filed for divorce in Broward court, stating that his two-month old marriage to Keeta Vaccaro — whom he married in November in Austin during a bye week for the Dolphins — was “irretrievably broken,” court records show. But on social media, the Dolphins player denied that he was parting ways with Vaccaro; he blamed his attorney for the filing.\n911 call to Hill’s home\nHill fired his attorney and withdrew the divorce petition at the end of January. A judge dismissed the divorce on Jan. 30, the same day that Davie police were called to a “domestic dispute” at Hill’s mansion. A cousin of Vaccaro’s told a 911 dispatcher she was on the phone with her when she heard Hill screaming at his wife, police records obtained by the Herald show.\nVaccaro told police she and Hill were arguing over a post-nuptial agreement, the divorce filing and Hill removing her from his social media accounts, according to a police incident report.\nVaccaro told investigators she refused to sign the post-nup agreement, stating she felt “bullied, threatened and verbally abused.” She also reported that Hill “smashed” an unlit cigar in her face, the report says.\nThe Dolphins player said he “flicked” the cigar, but denied it striking her, according to police. Hill also said he and Vaccaro had been arguing a lot lately because his representatives advised him to have a post-nuptial agreement in place. Officers didn’t notice any visible marks on Vaccaro’s face or body, and there were no signs of a struggle in the home.\n“Due to conflicting stories and no evidence that a crime had occurred, no arrest was made,” the incident report says.\nMounting lawsuits\nHill has been no stranger to the Broward courts.\nIn 2023, two women filed paternity suits against him, seeking child support for children fathered by the NFL star. The babies were both born last year, court records show.\nPaternity testing established that Hill fathered a son with Brittany Lackner, according to court documents. Hill offered her $2,500 a month in child support, which her attorneys slammed as “woefully inadequate” as Hill is a “highly paid professional athlete.” They have since settled.\nIn another filing, Hill admitted to having a daughter with Kimberly Baker, who asked a judge to order Hill to pay child support. That case is still pending.\nHill shares three children with ex-fianceé Espinal, the victim in the Oklahoma domestic violence case and the mother of the 3-year-old boy whose arm was broken. Court records indicate that Hill is a “dutiful parent” to his children in Kansas, having established agreements on custody, timesharing and child support. He also has a son with a fourth woman.\nIn addition to the paternity suits, social media influencer Sophie Hall on Feb. 24 sued Hill in Broward circuit court, alleging that he broke her leg while she was visiting Hill at his Broward mansion last summer.\nIn May, Hall, 35, who lives in in New Port Richey near Tampa, connected with the NFL standout over social media after she purchased a ticket for her 10-year-old son to attend his summer football camp in Boca Raton. After a series of flirtatious Instagram messages, Hill invited Hall to spend a few days with him last summer at his Broward mansion.\nWhile there, she did some offensive line drills with Hill and his trainer in his backyard. At one point during the drills, she caused Hill to be pushed backward, “garnering laughter from the witnesses present at the time, including [Hill’s] mother, sister, friend and trainer,” according to the suit.\nThe Dolphins star’s demeanor suddenly shifted and he grew irate, the court documents say, adding that during one of the plays, Hill charged into the woman “violently and with great force.” Hall had posted TikToks in which she’s seen using crutches due to her broken leg.\nHill, according to the Dolphins’ official roster, stands at 5 feet, 10 inches and weighs 191 pounds. In a 2019 interview with a TV news channel about her modeling career, Hall said she stood at 6 feet 1 inch and weighed 250 pounds.\nThe woman’s attorney, Jonathan R. Gdanski, in the filing writes that Hill’s “aggression... is consistent with his history of violent and aggressive behavior towards women.”\nGrier, the Dolphins’ general manager, said he was “in communication with NFL security” and couldn’t comment on the allegations in Hall’s suit.\n“For us, Tyreek has been a good addition... but in terms of all the off-field stuff, we’ll have to get all the information before we can really comment on it,” Grier said.\nHill hasn’t been disciplined; the NFL declined to comment on the matter.\nDo NFL players face heat?\nNFL players who are accused of violence — even if criminal charges were later dismissed or dropped — rarely face consequences in their careers, and that’s especially true for star players, said Daniel Sailofsky, an assistant professor at the University of Toronto who has researched crime in the NFL.\n“The incentives for... decision makers for NFL teams... is to win and to fill their rosters of talented players who drive revenue through their ability to drive winning,” Sailofsky said. “It’s great for the team if those people are good people off the court or off the field, but it’s not necessary.”\nAttitudes toward domestic violence accusations have somewhat shifted in the NFL after widespread criticism related to Baltimore Ravens running back Ray Rice’s 2014 arrest, Sailofsky said. Rice was charged with aggravated assault, though that was dropped after he agreed to anger-management counseling.\nRice, who played six seasons for the Ravens before his career ended, was caught on surveillance footage punching his now-wife inside an elevator. In December, the Ravens reignited criticism about Rice when they honored him as a “Legend of the Game” during a match-up against the Dolphins. He never played again after the incident.\nFor Sailofsky, Hill is “the perfect example of a player whose talent level is so overwhelming that it has gotten him out of consequences.” Through interviews with decision makers in the NFL, Sailofsky uncovered that many weigh allegations and do a “cost-benefit analysis” to determine whether a player is worth the hassle.\nThey may also be inclined to look the other way. A player’s off-the-field behavior, he said, could “lower their value,” pushing teams to acquire an “A+-level asset for a C-level price.”\nHeadlines often blare from incidents involving star players, noted Alex Piquero, a professor of criminology at the University of Miami who has studied crime in the league.\n“You may not hear about another player who might be a second string player or reserve player... because it’s not newsworthy enough, even though there’s an alleged victim,” he said.\n‘Starting to come back’\nIn a recent interview on The Pivot Podcast, Hill opened up about his NFL career with the Dolphins and the Chiefs, also touching upon his past. The wide receiver acknowledged that being released from Oklahoma State after the “domestic dispute” had a deleterious effect on him.\n“My life was changed. It was trending up,” Hill said. “But what we don’t realize is that in that exact moment, it can be trended down too with just one bad mistake.”\nHill recalled the religious values that his grandparents instilled in him. He said he had a “few rough years” when he strayed away from them.\nSince then, Hill said he has devoted himself to “cleaning up” his life. He told the podcasters that he has been avoiding parties and women — and started attending church services with his wife.\n“Everything I’ve ever wanted is starting to come back for me,” he said. “Cause having off-field situations, you lose a lot of opportunities.”\nShortly after getting married in November, Hill told reporters that he was reaching a stage in his career where he wanted to be more mature outside of football.\n“I feel like everything that’s been happening to me, it’s been for good reason. I’ve been locked in in a different way,” he said. “Discipline with just my whole entire life. The way I just approach everything. I definitely eliminated a bunch of things, so that’s probably why I’m having some of the success that I’m having this year.”\nFor Dolphins coach Mike McDaniel, Hill takes his role as a captain seriously — and uses the leadership role to inspire the team. Hill was one of several team captains last season.\n“He’s been a captain and really this year, he’s just been the best version of himself and then some,” McDaniel said.\nMiami Herald staff writer Daniel Oyefusi contributed to this report",
  "word_count": 2902,
  "scraped_at": "2026-02-14T12:07:27.878376"
}