{
  "article_id": "087da8dc66ca",
  "url": "https://www.bbc.co.uk/sport/football/65911496#comments",
  "title": "France, Jamaica, Brazil and Panama: A guide to Group F at Women's World Cup 2023",
  "date": "2023-07-02T06:11:20.000Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_bbc",
  "body_text": "France, Jamaica, Brazil and Panama: A guide to Group F at Women's World Cup 2023\n- Published\n- comments\nThe 2023 Women's World Cup is taking place in Australia and New Zealand between 20 July and 20 August. Former finalists Brazil are in Group F, along with 2019 hosts France, Jamaica and debutants Panama. BBC Sport takes a closer look at those teams.\nBrazil\nManager: Pia Sundhage, 63, previously coached both Sweden and the United States, winning Olympic gold with the latter in 2008 and 2012, as well as taking them to the 2011 World Cup final. As a player, she scored the winning penalty against England as Sweden won the inaugural European Championship in 1984 at Luton's Kenilworth Road. \"Back then we didn't have any crowds at all,\" said Sundhage. \"It is a fantastic journey that women's football has taken.\"\nStar player: Marta, 37, should be fit for the tournament after an injury-hit 12 months which saw her miss the Finalissima defeat to England in March. She is Brazil's all-time leading scorer, with 115 goals in 175 games, and was part of the side who reached the 2007 World Cup final. This will be her sixth World Cup, but she is still capable of the quick-footed skill and flair which has seen her compared with male World Cup winners such as Ronaldinho, Romario and even Pele.\nForm guide\nTournament history\nFrance\nManager: Herve Renard, 54, was named France manager in March following Corinne Diacre's sacking after several players said they would no longer represent the country under her leadership. He has never coached in women's football before, but was in charge of the Saudi Arabia side which stunned Argentina at Qatar 2022. He also took Morocco to Russia 2018 as part of a peripatetic coaching career which has also included Lille, Ivory Coast - and Cambridge United.\nStar Player: Captain Wendie Renard, 32, was a key driver in Diacre's departure after saying she would miss this summer's World Cup \"to preserve my mental health\". She returned to the squad under Herve Renard and looks set to drive France from centre-back as she has done for 144 caps previously. \"It's the coach who will select me if I perform well with my club - but why not [make a return]?\" the Lyon defender said following the sacking of Diacre.\nForm guide\nTournament history\nJamaica\nManager: Lorne Donaldson was not well known even within Jamaican football when he was named coach of the Reggae Girlz in June 2022, however he guided them to World Cup qualification through the Concacaf Championship at the expense of hosts Mexico. He has since had to compete with added external pressures which have seen the team issue an open letter expressing concerns over facilities and preparation, with two crowd funders set up to help the team.\nStar player: Khadija Shaw, 26, emerged as one of the best forwards in the Women's Super League for Manchester City last season, scoring 31 goals in 30 matches across all competitions. Shaw - nicknamed Bunny - is the one true world-class player in the Jamaica team and is crucial to their chances. \"We're small in numbers but we can be big on the global stage, like in track and field,\" she told BBC Sport. \"It is the Jamaican way, for an island of three million people to be going to the World Cup back-to-back is unbelievable.\"\nForm guide\nTournament history\nPanama\nManager: This may be Mexican coach Ignacio Quintana's first senior role, however he had experience of women's international football as Nicaragua assistant manager. Appointed to Panama in 2021, he guided them through the World Cup play-offs earlier this year. He also helped ensure equal pay and conditions with the men's national team. \"Making sure that these players are really protected, that they have the same advantages as men's football... that's something that for us was paramount,\" he told ESPN., external\nStar Player: Marta Cox, 25, made her international debut at 14 and is a key cog in the Panamanian midfield. She scored the winning goal against Trinidad and Tobago that secured Panama's place at the intercontinental play-offs in New Zealand in February, before netting again again during the semi-final versus Papua New Guinea in Auckland. Cox was then a crucial driving force for her team in victory over Paraguay in the final to reach a first World Cup.\nForm guide\nTournament history\nHow will Princess Georgiana cope Down Under? A riotous royal comedy starring Catherine Tate\nWho are the greatest Ashes XI of the past twenty years? Greg James, Jimmy Anderson and Felix White debate - but do you agree with them?",
  "word_count": 773,
  "scraped_at": "2026-02-14T11:17:41.602001"
}