{
  "article_id": "0881e56f42d7",
  "url": "https://www.liverpoolecho.co.uk/news/showbiz-news/jayne-torvill-christopher-dean-among-33136979",
  "title": "Jayne Torvill and Christopher Dean among famous faces to be knighted in New Year Honours List",
  "date": "20251229T231500Z",
  "domain": "liverpoolecho.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Jayne Torvill and Christopher Dean among famous faces to be knighted in New Year Honours List\nThe Dancing On Ice judges have been recognised along with other stars such as Idris Elba and Merseyside's Alex Greenwood has received an MBE\nA number of famous faces have been recognised in the New Year Honours list. Sir Idris Elba, Sir Christopher Dean and Dame Jayne Torvill are among the stars to have been knighted in the Honours List.\nThere has also been recognition for some of Merseyside's best talent as Alex Greenwood has received an MBE for services to sport after England's Lionesses won the Euros this summer. The Bootle-born defender is joined by her teammates such as Keira Walsh, Georgia Stanway and Ella Toone, who were all part of the squad the beat Spain in July's memorable final.\nThe team’s Dutch manager Sarina Wiegman, who has won the Euros twice with England, and once with the Netherlands, has been awarded with an honorary damehood. Captain Leah Williamson has also been made a Commander of the Order of the British Empire (CBE).\nSir Idris shot to stardom with his role in The Wire and has gone on to enjoy a glittering career in film and television. The 53-year-old has been knighted for services to young people, having founded the Elba Hope Foundation, which supports community empowerment, education, youth advocacy and sustainable development.\nReacting to the honour, he said: “I receive this honour on behalf of the many young people whose talent, ambition and resilience has driven the work of the Elba Hope Foundation.\n“I hope we can do more to draw attention to the importance of sustained, practical support for young people and to the responsibility we all share to help them find an alternative to violence.”\nDame Jayne and Sir Christopher, who took home the Olympic gold at the 1984 Winter Games and saw success at the World, European and British Championships, are made a Dame and Sir for services to ice skating and to voluntary service.\nThe two later became the faces of celebrity competition show Dancing On Ice and retired from professional skating with a farewell tour earlier this year.\nDame Jayne said the timing of the honours seemed perfect timing, as she said: \"We had such a great time, we were so happy with the tour and the fact that we got through it.\n“It was a big thing for us to mark our career before retirement, and then receiving this award at the end of the year, it’s just finished everything. It’s perfect.”\nSir Christopher, 67, added: “It’s been mentioned by fans and supporters, but it’s something that we never realised might happen. If it did, that would be wonderful, but if it didn’t, there’s so many other people in the country that are deserving as well.”\nThey join other stars who rose to fame in notable partnerships, such as Paul Elliott, one half of the Chuckle Brothers, who is made a Member of the Order of the British Empire (MBE), and Matt Lucas, half of the comedic Little Britain duo with David Walliams, who becomes an Officer of the Order of the British Empire (OBE).\nMembers of England Women’s Rugby World Cup winning squad are also strongly represented, with Marlie Packer and Zoe Aldcroft becoming OBEs, along with coach John Mitchell.\nMitchell said: “I am incredibly honoured to receive this recognition, but I want to be clear that it reflects the work of the Red Roses World Cup-winning squad and the outstanding staff around them.”\nAldcroft said: “The recognition isn’t mine alone. This year I have felt nothing but love and support from so many people and I am extremely grateful.\n“My family’s belief in me on this journey has been unrivalled, and I am also fortunate to have been surrounded by an unbelievable group of players and staff who have given everything to the Red Roses.”\nTeammates Ellie Kildunne, Sadia Kabeya, and Megan Jones are made MBEs after the Red Roses defeated Canada in the final in September.\nPaula Radcliffe, a three-time London Marathon winner who held the women’s marathon world record for 16 years, is made an OBE. Elsewhere, The Kumars At No 42 actress Meera Syal, 64, becomes a Dame and broadcaster Gabby Logan, actor Warwick Davis and presenter and author Richard Osman are made OBEs.\nThe Rest is Entertainment host Richard, 55, who writes The Thursday Murder Club book series, said he was “absolutely thrilled” with the honour, while Warwick, also 55, said: “This is the best thing that’s ever happened to me and I’ve been in Star Wars.”\nWicked star Cynthia Erivo is made an MBE for services to music and drama, while football commentator Clive Tyldesley has received an OBE for services to sports broadcasting and to charity.\nWriter Roy Clarke, creator of sitcoms Last Of The Summer Wine, Open All Hours and Keeping Up Appearances, becomes a knight.\nPrime Minister Sir Keir Starmer said: “This year’s honours list celebrates the very best of Britain – people who put the common good ahead of themselves to strengthen communities and change lives.\n“Their quiet dedication speaks to the decent, compassionate country we are proud to be. On behalf of the whole nation, thank you – and congratulations to everyone recognised today.”",
  "word_count": 880,
  "scraped_at": "2026-02-14T13:07:15.061356"
}