{
  "article_id": "088337668843",
  "url": "https://www.orissapost.com/ireland-coach-pauw-denies-allegations-in-nwsl-report/",
  "title": "Ireland coach Pauw denies allegations in NWSL report",
  "date": "20230408T051500Z",
  "domain": "orissapost.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Austin: The coach of the Irish women’s national team called allegations of weight shaming during her time as a coach in the National Women’s Soccer League “absolutely ridiculous and false.”\n“There’s no truth in it,” Vera Pauw said Friday in advance of a pair of matches against the United States, the first set for Saturday at Austin’s Q2 Stadium.\nThe allegations against Pauw, who coached the Houston Dash in 2018, were outlined in a report resulting from an investigation into misconduct in the league that was released in December.\nThe overall investigation by the NWSL and its player’s union found widespread abuse and mistreatment of players. It followed a separate investigation commissioned by U.S. Soccer that found emotional abuse and sexual misconduct was systemic in the sport, impacting multiple teams, coaches, and players.\nAccording to the report, players said Pauw wanted to exert control over “every aspect of (their) lives,” including “everything you were putting in your body, every exercise you were doing.”\nThe report also said she did not want players to weight train because they might become too bulky, and once body-shamed a player who had pulled up her shirt to wipe her face.\nPauw, a former Dutch national team player, vociferously defended herself. She has been the coach of the Irish women since 2019.\n“I think the only thing I can do is say the truth. There’s no reason for having any doubt in the way I am dealing with teams,” she said.\n“In that report, there’s things said like body shaming, which is absolutely false. If there’s one thing that I don’t do, it is body shaming. There is no scale in my dressing room, there’s no fat percentages taken.”\nThe report said Pauw did not cooperate with the investigation and must accept responsibility and take accountability if she ever returns to the league.\nPauw called out what she believes is a double standard for women and men. “If I would have been a man, who would even care about something like that?” she said.\n“People would say, ‘It it is you task to prepare the players to be the best on the pitch. It’s your task as a coach to educate yourself, to study and bring over your knowledge to your players.'”\nShe said the focus should not be only on player safety but also on the safety of female coaches. Last year, Pauw accused an unnamed Dutch football official of sexual abuse during her playing career.\n“Not only me, but other women were put into this report alongside rapists,” she said. “Can you imagine? With my background. Do you know my background?”\nBoth investigations stemmed from allegations of misconduct and sexual coercion made by a pair of players concerning former Portland Thorns and North Carolina Courage coach Paul Riley in 2021. Riley, who was subsequently banned from the league, has denied the claims first reported by The Athletic.\nOne of those players, Sinead Farrelly, was named to Ireland’s squad on Friday. Pauw said she had a conversation with Farrelly before bringing her into the team to make sure she was comfortable.\nPauw said she plans to start Farrelly on Saturday. Farrelly, who has been training with the Irish team this week, recently signed with Gotham in the NWSL after nearly eight years away from the league.\n“Under pressure, she makes the ball free, and that gives a calmness in our play that we needed,” Pauw said.\nIreland and the United States are using the matches as preparation for this summer’s Women’s World Cup in Australia and New Zealand. The second match between the two teams is set for Tuesday in St. Louis.",
  "word_count": 608,
  "scraped_at": "2026-02-14T12:23:53.792801"
}