{
  "article_id": "088a5bbb943c",
  "url": "https://www.thetottenhamindependent.co.uk/news/national/uk-today/25234145.8-prolific-divers-englands-top-divisions-revealed/",
  "title": "8 most prolific divers in England top divisions revealed",
  "date": "20250612T143000Z",
  "domain": "thetottenhamindependent.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Relegated League One side Bristol Rovers have topped one table this season – being crowned the most prolific divers in England’s top divisions.\nThe West Country team recorded eight yellow cards for simulation, the most of any team over the course of the past three seasons.\nPremier League giant Chelsea followed with seven bookings for taking a tumble – the same number as Burton Albion.\nManchester City, Newcastle United, Crawley Town, Accrington Stanley and Barrow have been reprimanded six times each after being caught trying to con the ref.\nFootball statistician Statman Dave ran the numbers as part of Snickers’ wider Off Your Game campaign, with the Deep Diving Audit offering a data-led look at diving across English football.\nDave O’Brien, who pored over match footage, referee reports and extensive game insights to reveal all the most dramatic diving data, said: “Diving has always been a part of the game, but when you look at the numbers, like I’ve done for Snickers’ Deep Diving Audit, it’s clear that some clubs and players really know how to keep things interesting.\n“Whether it’s tactical, instinctive, or maybe even hunger-related, one thing is for sure, when players are off their game, it shows.\n“And sometimes, it’s not just the ball that goes rolling.”\nNearly all cases of diving occurred in the second half, with a particular uptick during the 90th minute – and 70 per cent of dives took place in the penalty area.\nWith Brighton & Hove Albion being named as the club players have dived against most in the Premier League.\nStrikers are responsible for 26 per cent of all dives over the last three seasons, whereas in defence, only one centre-back was carded for a diving offence.\nLooking at the 2024/25 campaign specifically, 75 per cent of dives occurred when the players’ team wasn’t winning, with the average dive last season lasting nine seconds.\nAdditionally, the average diving age is 22, they most typically wear white boots – and are also English, with these players making up 42 per cent of dives in the season just gone.\nDiving in the men’s game is significantly more prominent compared to the women’s – with just one diving booking found on record from the last three seasons in the Women’s Super League.\nSnickers has enlisted football experts Statman Dave and Nada Allali to create a video which uncovers the most over-the-top tumbles across the England's top leagues.\nDelia Lendais-Metral from the chocolate brand said: “Let’s face it, when you’re hungry, you’re not quite yourself.\n“The Snickers Deep Diving Audit taps into those moments when things go slightly off, on or off the pitch.”\n“Whether it’s a mis-timed slide or a full-blown flop, this is a fun reminder that staying fuelled helps keep you on your game.”\nMost dive-prone clubs of the past three seasons (22/23, 23/24, 24/25)\n- Bristol Rovers – 8 dives\n- Chelsea – 7 dives\n- Burton Albion – 7 dives\n- Manchester City – 6 dives\n- Newcastle United – 6 dives\n- Crawley Town – 6 dives\n- Accrington Stanley – 6 dives\n- Barrow – 6 dives",
  "word_count": 520,
  "scraped_at": "2026-02-14T12:58:12.254106"
}