{
  "article_id": "08d63af0d855",
  "url": "https://www.justarsenal.com/beth-mead-loves-the-arsenal-women-a-family-away-from-family/341865",
  "title": "Beth Mead loves the Arsenal Women -  A family away from family  ",
  "date": "20230611T120000Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Arsenal women’s 2022-23 campaign was no doubt inspirational as a Gooner. You may not know how inspiring Eidevall and his girls were even I wasn’t until Beth Mead’s claims in her interview about what inspires her sank in. On the club’s website, the striker had a lot to say about Arsenal: how the club believed in her that they had to wait a year after registering their interest in her services to recruit her from Sunderland, how she believes many look at their team and appreciate what they are doing and how the club makes everyone comfortable and feel at home.\n“I always loved Arsenal. The manager actually got in touch with me the year I was promoted with Sunderland and I chose to stay because I needed a little bit more experience at that level and wanted to play regularly. I was lucky that the club still wanted me in 2017 because it was the right time to move here. It’s so hard not to love Arsenal! I think even people who aren’t involved in the club still appreciate what we’re about.\n“I fell in love with the club as soon as I signed. Arsenal sits deep in my heart and I love being here. We’re pushing forward in the game and everyone in the club is so supportive of one another. As a women’s team, we’re never made to feel like outsiders. It’s been incredible to see the transition from where it started and be a part of that. It’s very much a family away from family.”\nJonas Eidevall is doing something special at Arsenal; the way he got Arsenal to win the Continental Cup, finishing in the top 3 and putting on a spirited performance in the Champions League that saw them reach the Semis without critical stars like Beth Mead is brilliant. Last year, Mead suffered an ACL injury that saw her miss the rest of the season and this summer’s world cup.\nThe Euros Golden Boot winner & Player of the Tournament should be back fit for next season to continue her exploits in the WSL and the Champions League and also help football lovers continue to love the Arsenal women.\nLike we do!\nMichelle Maxwell\nFollow Michelle on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 400,
  "scraped_at": "2026-02-14T12:45:58.636712"
}