{
  "article_id": "08ffc67a3f62",
  "url": "https://www.jamaicaobserver.com/latest-news/kerr-strikes-as-chelsea-win-record-breaking-womens-fa-cup-final/",
  "title": "Kerr strikes as Chelsea win record - breaking women FA Cup final",
  "date": "20230514T181500Z",
  "domain": "jamaicaobserver.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Kerr strikes as Chelsea win record-breaking women’s FA Cup final\nLONDON, United Kingdom (AFP)— Sam Kerr’s second-half goal proved the difference as Chelsea beat Manchester United 1-0 to win a third successive women’s FA Cup final in front of a record-breaking crowd at Wembley on Sunday.\nBut it needed a desperate block from Chelsea goalkeeper Ann-Katrin Berger in the seventh minute of added-on time to deny United an equaliser in front of a crowd of 77,390 — a world record attendance for a domestic women’s football match.\nChelsea manager Emma Hayes’s decision to bring on Pernille Harder just before the hour proved a turning point in a match where United had the better of the early exchanges.\nIt took United, in their first women’s FA Cup final, just 20 seconds after kick-off to put the ball into the Chelsea net only for the goal to be disallowed for offside.\nChelsea, the reigning English women’s Super League champions, failed to clear Ella Toone’s cross from the right and Leah Galton swept the ball in.\nBut the flag had gone up, with VAR confirming Toone had moved a fraction too early.\nUnited, who only established a women’s team in 2018, dominated the first half.\nThey almost broke the deadlock just after the half-hour when a free-kick from near half-way wasn’t properly cleared and the loose ball fell to Millie Turner, whose deflected effort was well saved by Berger.\nUnited went close again when Galton poked the ball over from six yards out from an Alessia Russo cross.\nBut three minutes before half-time, Chelsea almost punished United’s failure to take their chances.\nLauren James got ahead of the defence to loop a header towards the far from a driven cross.\nBut United goalkeeper Mary Earps, one of the heroines of England’s European Championship final winning team at Wembley last year, made a brilliant save to claw the ball away one-handed before colliding with the post.\nUnited’s Nikita Parris then won a free-kick right on the edge of the area but Chelsea went to the break with the match still all square.\nHayes brought on Harder just shy of the 60th minute and the striker had a chance to open the scoring moments after taking the field.\nMaya Le Tissier failed to deal with a long ball and Kerr raced on to it down the left wing.\nHer low cross found Harder, but her first touch saw the ball trapped under her foot, and she was unable to get sufficient placement or power on the shot to beat Earps.\nHarder, however, was instrumental in Chelsea going 1-0 up in the 68th minute when her superb low cross from out on the right found Kerr, who didn’t have to break stride as she turned the ball in at the back post.\nKerr’s goal meant the striker, who celebrated with her trademark back flip, had scored in three consecutive FA Cup finals.\nUnited almost made it 1-1 in the very closing stages when Berger flapped at a cross, only to block Galton’s shot before Chelsea cleared the danger to stay on course for another league and cup ‘double’.",
  "word_count": 522,
  "scraped_at": "2026-02-14T12:39:36.828132"
}