{
  "article_id": "092b89f16810",
  "url": "https://thenationonlineng.net/nigerian-athletes-who-made-waves-in-2024/",
  "title": "Nigerian athletes who made waves in 2024 - The Nation Newspaper",
  "date": "20241223T093000Z",
  "domain": "thenationonlineng.net",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "News\nDecember 23, 2024 by Wale Gbadebo\nNigerian athletes who made waves in 2024\nNigerian athletes have once again made a powerful impact on the global stage in 2024, showcasing their extraordinary talents and achieving remarkable success across various sports.\nThe spotlight recently fell on Ademola Lookman, who was awarded the prestigious African Footballer of the Year by the Confederation of African Football (CAF).\nThese exceptional athletes have embodied the resilience and determination that Nigeria is renowned for, setting records and dominating in football, boxing, and athletics.\nHere are the List of Nigerian athletes who made waves in 2024:\nAdemola Lookman (Football)\nAdemola Lookman, the Nigerian forward, has been a standout performer in Serie A with Atalanta. His remarkable season earned him the prestigious CAF African Footballer of the Year award, making him the seventh Nigerian to win this honor. Lookman played a pivotal role in Atalanta’s Europa League triumph, scoring a memorable hat-trick in the final. His contributions were also key to Nigeria’s qualification for the Africa Cup of Nations, where he netted three goals during the tournament.\nChiamaka Nnadozie (Football)\nChiamaka Nnadozie, one of the top goalkeepers in women’s football, has continued to build her legacy. Winning the CAF Best Goalkeeper award in back-to-back years (2023 and 2024), Nnadozie played an instrumental role in Nigeria’s success at both the 2023 FIFA Women’s World Cup and the 2024 Paris Olympics, cementing her status as one of the world’s best goalkeepers.\nKanyinsola Ajayi (Sprint)\nKanyinsola Ajayi has made waves on the track, marking 2024 as a breakthrough year. He claimed a GOLD medal in the men’s 60m at the SEC Championships in February. Outdoors, Ajayi set a personal best of 10.01s to win Bronze at the NCAA Championship and helped secure GOLD in the 4x100m relay. He won his first national title at Nigeria’s Olympic Trials, with a time of 10.14s, and earned a spot at the African Championships, where he finished fourth and led Nigeria’s 4x100m relay team to a Silver medal. Ajayi also made an impact at the Paris Olympics, defeating reigning champion Marcell Jacobs in his heat and reaching the semifinals.\nWilliam Troost-Ekong (Football)\nAs captain of Nigeria’s Super Eagles, William Troost-Ekong earned widespread recognition for his leadership and defensive prowess during the 2023 AFCON tournament, where he was named Player of the Tournament. His exceptional performances also saw him nominated for FIFA’s 2024 Best XI, solidifying his status as one of Nigeria’s most influential footballers.\nDivine Oduduru (Sprint)\nDivine Oduduru has cemented his place as one of the world’s top sprinters, delivering stellar performances in the 100m and 200m at international competitions. His efforts were instrumental in Nigeria’s success in relay events, particularly as a key member of the team that earned third place at a regional championship.\nAnthony Joshua (Boxing)\nAnthony Joshua continues to dominate the heavyweight boxing scene as a two-time world champion and global icon. Earning $75 million in 2024, Joshua remains among the sport’s highest earners, with his career earnings surpassing $200 million. He began the year with a dominant knockout victory over Francis Ngannou at the Kingdom Arena in Riyadh and has since been nominated for “Boxer of the Year” at the inaugural British Boxing Awards in March 2025. Joshua is also celebrated for his philanthropic efforts and community work.\nVictor Osimhen (Football)\nVictor Osimhen’s surprising transfer from Napoli to Turkish giants Galatasaray made headlines in the summer. The 25-year-old striker quickly made an impact, scoring nine goals and providing five assists in just 12 appearances across all competitions. Despite rumors of a potential mid-season move, Osimhen is expected to stay with Galatasaray for the remainder of the season, continuing to showcase his talent in Turkey after a summer filled with speculation.\nRead Also: Lookman helps Atalanta to Serie A top for Christmas\nVictor Boniface (Football)\nVictor Boniface has been on a remarkable run, scoring 20 goals in 33 league matches last season and continuing his excellent form this campaign with six goals in just ten appearances. With a total of 31 goals in 34 matches across competitions since joining Bayer Leverkusen, Boniface is becoming one of Europe’s top strikers and attracting attention from major clubs like Chelsea.\nFavour Ashe (Sprint)\nFavour Ashe has made an extraordinary rise in sprinting, highlighted by his groundbreaking 9.99s run at the Pepsi Florida Relays, becoming the first man globally in 2024 to break the 10-second barrier and earning a spot at the Paris Olympics. Ashe’s performances continued to impress as he set a new personal best of 9.94s at the NCAA East First Rounds and played a crucial role in helping Auburn secure a 2-3 finish at the NCAA Championships. His Olympic debut in Paris saw him reach the 100m semifinals, solidifying his place as one of the world’s leading sprinters.\nGodson Brume (Sprint)\nGodson Brume’s 2024 season was a standout, with notable achievements in the NCAA circuit. He became the second Nigerian sprinter, after Favour Ashe, to qualify for the Olympics in the men’s 100m, securing his spot with a 9.99s victory at the SEC Championships. Brume’s efforts also earned Nigeria a silver medal in the men’s 4x100m relay at the African Championships. While an injury kept him from competing in the Olympics, Brume’s talent and potential ensure a promising future.\nChidi Okezie (Sprint)\nChidi Okezie had a defining year in 2024, securing his first-ever international individual title with a victory in the men’s 400m at the African Games in Accra. His time of 45.06s earned him gold, making him the first Nigerian man to win the 400m title since Innocent Egbunike in 1987. Okezie also played a key role in helping Nigeria qualify for the Paris Olympics in both the men’s 4x400m relay and mixed relay, posting the team’s fastest time in two decades. He capped off the season with a lifetime best of 44.97s in Edmonton and competed in both the 400m and 4x400m at the Paris Olympics.\nChukwuebuka Enekwechi (Shot Put)\nChukwuebuka Enekwechi has continued to shine in shot put, solidifying his place as one of Nigeria’s top athletes in the discipline. His performances at the World Indoor Championships and his new personal best of 21.63 meters at the African Indoor Championships have placed him on the global stage. Enekwechi set a new Nigerian record of 21.91 meters at the Prefontaine Classic, highlighting his relentless pursuit of excellence in the sport.\nSamuel Ogazi (Sprint)\nEmerging sprint star Samuel Ogazi made significant strides in 2024, earning recognition with strong performances in both regional and international competitions. Ogazi clinched a bronze in the 400m at the African Championships and later reached the finals at the Summer Olympics, where he set a personal best. His performances marked him as one of Nigeria’s promising young sprinters.\nFavour Ofili (Sprint)\nFavour Ofili made history in 2024 by breaking the 14-year-old African 300m record with an astounding 35.99s. She also delivered impressive results in the 100m (10.78s) and 200m (22.33s), helping Nigeria secure a spot in the 4x100m relay at the Olympics. Her rapid rise positions her as a formidable contender in women’s athletics.\nEse Brume (Track)\nEse Brume, Africa’s long jump record holder, continued to dominate in 2024, maintaining her undefeated streak on the continent for nearly a decade. She won her fourth African Athletics Championship title and secured a 6.58m jump at the New Balance Indoor Grand Prix. At the Paris Olympics, Brume finished fifth, delivering Nigeria’s best performance in the event and reinforcing her place as one of the world’s elite jumpers.\nD’Tigress (basketball) / Rena Wakama\nNigeria’s D’Tigress made history at the Paris 2024 Olympics by reaching the basketball quarterfinals for the first time. Led by Murjanatu Musa, who averaged 10.7 points and 6.7 rebounds per game, the team demonstrated remarkable defense and secured impressive victories, including a stunning win over Australia. Rena Wakama was honored as the Best Coach of the Women’s Olympic Basketball Tournament, marking an incredible turnaround for D’Tigress following their winless campaign at Tokyo 2020.\nTheir opening game victory over Australia, ranked 3rd in the world, by 13 points was one of the biggest upsets of the Olympics. In their third match against Canada, D’Tigress clinched another win, making history as the first African team—male or female—to reach the Olympic basketball quarterfinals. From being the lowest-ranked team to advancing to the top eight, D’Tigress showcased their resilience and determination.\nNigeria’s Paralympic / Folashade Oluwafemiayo\nNigeria’s Paralympic team delivered an outstanding performance at the 2024 Paris Games, bringing home seven medals—two gold, three silver, and two bronze—solidifying their reputation as a dominant force in para-sports. Folashade Oluwafemiayo made history by breaking the world record in para-powerlifting, further elevating Nigeria’s standing in the global Paralympic arena.",
  "word_count": 1446,
  "scraped_at": "2026-02-14T12:34:06.853616"
}