{
  "article_id": "09324d626d93",
  "url": "https://www.uefa.com/womenschampionsleague/news/027f-179243562a44-9b20d956e9f7-1000--paris-vs-wolfsburg-preview/",
  "title": "Paris Saint - Germain vs Wolfsburg Women Champions League preview : Where to watch , predicted line - ups",
  "date": "20230322T024500Z",
  "domain": "uefa.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Paris Saint-Germain vs Wolfsburg Women's Champions League preview: Where to watch, predicted line-ups\nMonday, March 20, 2023\nArticle summary\nWhen is it? How can you watch it? What are the starting line-ups? All you need to know about the UEFA Women's Champions League quarter-final first leg between Paris and Wolfsburg.\nArticle top media content\nArticle body\nParis Saint-Germain and Wolfsburg meet in the UEFA Women's Champions League quarter-final first leg on Wednesday 22 March at Parc des Princes.\nParis vs Wolfsburg at a glance\nWhen: Wednesday 22 March (21:00 CET kick-off)\nWhere: Parc des Princes, Paris\nWhat: UEFA Women's Champions League quarter-final first leg\nHow to follow / Where to watch: Build-up and live stream from DAZN can be found here\nSecond leg: Thursday 30 March (18:45 CET kick-off), Wolfsburg Arena\nWhat do you need to know\nConsidering the ubiquity of both these clubs at this stage, it is surprising that this is only the second time they have collided in Europe after the 2014/15 semi-final where Paris came through after away wins in both legs. Paris missed out on quarter-final seeding after bookending their group campaign with defeats by Chelsea, a side Wolfsburg eliminated at that stage last season.\nThose Chelsea losses have been the only Paris defeats in 2022/23, however, other than in the Trophée des Championnes against Lyon, despite the continued absence of Marie-Antoinette Katoto. Ramona Bachmann, their quarter-final hero against Bayern last term, will doubtless be keen to repeat the trick against one of her former clubs.\nWolfsburg suffered a rare loss at home to Hoffenheim earlier this month, their first league defeat in more than a year, but have generally looked excellent this season with competition top scorer Ewa Pajor and Alex Popp both in the goals. However, a knee injury suffered in the weekend win against Potsdam by Lena Oberdorf made her seemingly a big doubt.\nForm guide\nParis\nLast six games (most recent result first): WWWWWW\nLast match: Paris 1-0 Thonon Évian Grand Genève, 18/03 (French Cup semi-final)\nWhere they stand: 2nd in Division 1 Féminine , French Cup final\nWolfsburg\nLast six games: WWLWWW\nLast match: Wolfsburg 5-0 Turbine Potsdam, 17/03\nWhere they stand: 1st in Frauen Bundesliga, German Cup semi-final\nWhere to watch\nEvery game in this season's UEFA Women's Champions League from the group stage onwards is broadcast live in most territories on streaming platform DAZN, together with YouTube. The YouTube stream will also be embedded in the UEFA.com MatchCentre and on UEFA.tv for all UEFA Women's Champions League games, with highlights to follow at midnight CET.\nSquad changes\nParis\nIn: Korbin Albert, Amalie Vangsgaard, Barbora Votíková\nOut: Estelle Cascarino, Magnaba Folquet, Alice Pinguet, Bénédicte Simon, Lydia Williams, Lina Yang\nWolfsburg\nIn: None\nOut: None\nStarting line-ups\nParis: Bouhaddi; Lawrence, Élisa de Almeida, Geyoro, Karchaoui; Hamraoui, Jean-François, Bachmann; Groenen, Diani, Baltimore\nWolfsburg: Frohms; Hendrich, Hegering, Janssen, Rauch; Oberdorf, Lattwein; Huth, Roord, Popp; Pajor\nView from the camps\nGérard Prêcheur, Paris coach: \"We love this stadium, it is perhaps the most beautiful pitch in the world. Therefore, it is easy to prepare mentally since we know that everyone wants to be there. Where you have to be sharp is on the tactical level. We have started to disclose it to the players and we still have [Tuesday's] training to be a little more precise.\n\"We need supporters, it's important for us. Tomorrow is an event in this magnificent stadium. I learned that we already have more than 15,000 coming. I would like to appeal to the fans: if we could get closer to 20,000 tomorrow evening for this great match, that would be fantastic.\"\nÉlisa de Almeida, Paris defender: \"Paris is the club of my heart so playing at Parc des Princes was a dream for me when I was little. As they often say, the crowd is the 12th man. I think there are a lot of games in which the fans helped us, I remember in particular the [quarter-final second-leg] last season against Bayern. There was also the victory against Real Madrid in December. I hope there will be many of them tomorrow and I wanted to say thank you to them for all they do for us. \"\nTommy Stroot, Wolfsburg coach: \"It's an away game in the quarter-finals of the Champions League, that speaks for itself. If you're in Paris on top of that, you know that there's a lot of individual quality and a special way of playing football here. These are topics for which we have prepared.\n[On Oberdorf's absence] \"Of course, a lot of thoughts go in the direction of Alex Popp, because she has often filled this position very well. Svenja Huth also filled in the centre last season. Of course we can also push up Marina Hegering, who did that against Roma from time to time. We looked at what could be the best solution and it's good that the opponents just don't know what's going to happen. Our flexibility in certain areas is an advantage.\"\nWhere is the 2023 UEFA Women's Champions League final being played?\nEindhoven's PSV Stadium will stage the 2023 UEFA Women's Champions League final at 16:00 CET on Saturday 3 June.\nFirst opened in 1910, the 35,000-capacity PSV Stadium has a long history of hosting major matches, including the UEFA Cup finals of 1978 (second leg) and 2006, the second leg of the 1988 UEFA Super Cup and three games at UEFA EURO 2000.\nOn 6 April 2018, 30,238 fans at the home of PSV Eindhoven watched the Netherlands beat Northern Ireland on the way to the FIFA Women's World Cup, a record crowd for any UEFA-organised women's qualifier. On 1 June 2019, a then Dutch record women's football attendance of 30,640 saw the Netherlands face Australia in a friendly at the stadium.",
  "word_count": 966,
  "scraped_at": "2026-02-14T12:44:56.077382"
}