{
  "article_id": "0968c4f04cdf",
  "url": "https://www.the42.ie/carla-ward-profile-6596387-Jan2025/",
  "title": "Street football , tragedy , motherhood : The making of new Ireland manager Carla Ward",
  "date": "20250118T081500Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "CARLA WARD WAS enjoying a glass of wine with her mother before the Christmas Markets in Sheffield when the initial approach was made.\nA few weeks earlier, the new Ireland WNT head coach had publicly declared her desire to return to management. She stepped down from her role as Aston Villa manager last May to “prioritise other important things in her life,” namely her five-year-old daughter Hartley.\nThe relentless schedule had taken its toll, while there was much more going on, including the breakdown of her 14-year relationship. As Ward told The Athletic last summer, “My life was coming down around me while I was still trying to manage.”\nFor the first time in years, she switched off. She holidayed and spent quality time with Hartley, and then a dream opportunity arose to join Emma Hayes’ USWNT staff for the Olympic Games. She got her first taste of international football alongside her mentor and friend; the work-life balance appealed.\nFive months later, Ward has landed her first international management job, succeeding Eileen Gleeson at the Ireland helm. She was in talks with another nation at the time of the initial approach, but sees this as “the perfect match”.\nIt’s an exciting, ambitious appointment, which has been well received, although regrettably — and typically — overshadowed by FAI drama concerning a predecessor.\nWard was the FAI’s “outstanding candidate,” through a surprisingly quick process in which there were no major leaks. Casey Stoney and Alan Mahon, now assistant coach, were among others spoken to, with FAI Chief Football Officer Marc Canham, CEO David Courell on the recruitment panel alongside Packie Bonner, Paul Cooke, Laura Finnegan and Aoife Rafferty.\nCanham and co are understood to have been impressed by the 41-year-old Englishwoman’s aims and ambitions for the role, and the wider Irish women’s football picture.\n“The number one objective is to qualify for the 2027 World Cup, and with Carla at the helm, we believe we’re going to give ourselves the best chance of achieving this ambition,” said Canham at Thursday’s unveiling.\nWard’s “track record of working with club teams and maximising their potential” stood out, along with how she is “clear in her conviction, but open to other views and ideas”.\nA new challenge now awaits amidst a colourful journey.\n*******\nWard’s football roots can be traced back to a council estate in Torquay. Born on the Isle of Wight, she moved to the seaside town in Devon during her early childhood and fell in love with the game, playing street football with boys.\nHer club career brought her from Bristol City and Bristol Rovers to Sporting Plaza de Argel in Spain; Leeds United and Lincoln Ladies to Sheffield FC and Sheffield United.\nThe midfielder was captain of Sheffield FC under FAI Head of Women and Girls’ Football Hannah Dingley, making over 200 appearances and scoring more than a century of goals from 2011 to 2017.\nAs with any career, there were highs, lows and everything in between.\nWard was faced with family tragedy in 2009 when her older brother Lee died in a car accident in Spain. She learned of the devastating news on the eve of a game, but played in his honour.\n“The hardest part of my career was losing my brother,” Ward told The Sheffield Star in 2018. “He was my biggest backer. He bought all my boots.\n“We had a big game in Liverpool on the Sunday and, on the Saturday night, I got a call saying he’d died in a car accident. I didn’t sleep and stupidly drunk all night. The manager said I didn’t have to play but I knew my brother would have been furious if I hadn’t. I got two quick goals and then missed the second half because I fell asleep at half-time.”\nIn 2013, Ward was told she might never play again after an innocuous injury turned serious, and emergency surgery was required on her back. Fortunately, she found herself on the right side of the 36% success rate and returned to football with the help of a spinal doctor.\nHer coaching career began at Sheffield United in 2018, moving from player-assistant to interim to permanent manager, and bringing the Blades from the FA Women’s Premier League Midlands Division One to a second-place finish in the Championship in 2020.\nShe did her utmost to stabilise Birmingham City thereafter, staving off relegation in a crisis-hit season and finishing up on the WSL Manager of the Year shortlist. As players aired complaints about a lack of basic supports and facilities to the board, Ward began rebuilding the team — which included Irish internationals Ruesha Littlejohn, Emily Murphy and Harriet Scott — and steered them to safety.\n“The whole world said ‘Don’t take it’ and I took it and achieved what I wanted to achieve,” she recalled this week.\nAfter resigning, Ward crossed the city and took charge of Aston Villa, the job she is best known for. She oversaw Villa’s ascension in the WSL: they finished ninth in her first season, and an impressive fifth the following year. They also reached the semi-finals of the FA Cup and League Cup competitions, while her marquee signing Rachel Daly won the WSL Golden Boot after Ward transformed her to a number nine from full-back.\n“Getting that over the line with the board was difficult because, trying to get them to pay for what they saw as a a right-back for that much money, I said, ‘Trust me,’” as Ward, who worked with Ireland’s Anna Patten at Villa, told The 42.\n“When she scored two on the first day of the season against City I was like, ‘Brilliant.’”\nShe has already hinted at Katie McCabe “being utilised in a different way” for Ireland.\nHer playing style? Exciting, she promises.\n“Energy is number one,” Ward tells this writer. “It’s aggressive in some phases, also compact in others. Exciting to play and watch.\n“You can’t say a Carla Ward team is not exciting, whether it be good or bad! We like the players to play with a lot of freedom. What you’ll see from my team now compared to previous years, is a very different way of playing.”\nThe most likely change will be a move away from a back three/five. “I don’t think I’ve ever played five at the back, apart from Chelsea and Arsenal away when we parked the bus, so to speak. I’m more of a back four.”\nThat Ward is just starting her Uefa Pro Licence may have raised some eyebrows, but perhaps even more so that it is not a WSL requirement. There is no questioning her top-level experience and credentials, though.\nWard is widely considered a people-first manager, with treatment and culture among her top priorities. She wants players playing with a smile on their face, and believes she can get the best out of them when they’re enjoying the environment. She’s energetic and fun, but authoritative and demands respect.\nPioneering is among her strongest leadership qualities, and, as evidenced from her rise in club football, being resourceful.\nDedication is another trait: From 5.15am wake up calls to late night finishes at previous jobs, endless hours on the road, and all the administration associated with management. She gives it everything.\nThat seems to be among Ward’s greatest strengths, but it’s something she will be cognisant of given the need to step away from Villa.\nThe tipping point came putting Hartley to bed one night around Christmas of 2023.\nAmidst all the football memories and anecdotes, and talk of tactics and style, this moment still hits hard for Ward.\n“She said to me, ‘Am I off school tomorrow?’ and I said, ‘Yeah, it’s Saturday’. She asked me, ‘Are you off?’ and I said, ‘No, I’m at football’. She said, ‘But Mummy, when am I going to spend some time with you?\n“My heart sank, it was an awful moment. We always say everything we do is for our kids, but I wasn’t seeing her or spending time with her, so that was the start of the tipping point, I felt energy withdrawing. It wasn’t until I stepped away that I realised the time spent with your kids is unrivalled.”\nInternational football will allow more of that for Ward, as she remains based in Sheffield and mindful of the better work/life balance. Mum first, manager a close second.\nHartley is well aware of her mother’s new role, and is looking forward to being part of the journey.\n“She absolutely buzzing! I showed her the national anthem, she gave it a right go and said we have to learn it together, I’m learning it.\n“Got her a kit as well. She told me when I left, ‘You’ve got one job, bring me back a kit!’”\nTask one complete.\nThe first of many, with another World Cup appearance the main objective.",
  "word_count": 1475,
  "scraped_at": "2026-02-14T12:23:15.955393"
}