{
  "article_id": "0999168a3664",
  "url": "https://www.gdnonline.com:443/Details/1313420/Barca-clinch-second-straight-Women%E2%80%99s-Champions-League",
  "title": "Football : Barca clinch second straight Women Champions League",
  "date": "20240526T000000Z",
  "domain": "gdnonline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Football – Second-half goals from Aitana Bonmati and Alexia Putellas earned Barcelona a 2-0 win over Olympique Lyonnais in the Women’s Champions League final yesterday, their second straight victory in the competition.\nBarca came into the game seeking to go one better than their 2019 and 2022 finals against French powerhouse Lyon, which they lost 4-1 and 3-1 respectively. This time around they finally found the right combination of organisation and individual brilliance to beat Lyon, the most successful team in the competition’s history, in a tense final.\nWith a huge number of their fans in attendance at the San Mames stadium in Bilbao, Barcelona survived an early scare when Lucy Bronze almost steered the ball into her own net in the 14th minute, but instead it struck the woodwork and bounced harmlessly away.\nAt the other end, Lyon’s Vanessa Gilles had to clear the ball off the line when a Mariona Caldentey shot that had been saved ricocheted goalwards and Caroline Graham Hansen also went close to scoring as the first half finished 0-0.\nBarca gradually got more of a grip on the game and Bonmati broke the deadlock in the 63rd minute with a shot from a tight angle which deflected off Lyon’s Gilles past keeper Christiane Endler.\nLyon sent on Norwegian striker Ada Hegerberg but the competition’s record goalscorer was unable to find the net despite a couple of decent chances. Instead, Putellas, who had been struggling with a persistent knee problem, came off the bench and netted a stoppage-time goal to seal Barcelona’s win.",
  "word_count": 258,
  "scraped_at": "2026-02-14T12:52:24.159424"
}