{
  "article_id": "099a978ed0a9",
  "url": "https://www.rockmnation.com/2023/3/14/23637947/the-revue-missouri-tigers-ncaa-tournament-postseason-oscars-special",
  "title": "Mizzou Basketball Revue : A Postseason Oscars Special ! ",
  "date": "20230314T153000Z",
  "domain": "rockmnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "If you don’t care about the Oscars or have a level of engagement with the movies that extends beyond nightly scan through Netflix’s home page, turn back. This isn’t the place for you.\nThe Revue: A Postseason Oscars Special!\nDennis Everywhere All At Once\nThanks for visiting our website, please come back for some of the sterling basketball and football analysis. Believe me, you don’t need this.\nNow that the (fortunate) normies have exited the playing field, welcome to the year’s dumbest Revue. Writing about the tournament before the Tournament proved a daunting challenge for this weekly exercise, one that I nearly punted (airballed?) on.\nFortunately for me, the Oscars wound their way into the public consciousness not 48 hours ago. They were, as always, deeply stupid and tiresome, and I watched and enjoyed all 200 minutes. I was even inspired to write ~1,200 words about them and Mizzou Basketball to distract from my blossoming anxiety about Thursday’s trip to Sacramento!\nBest Player in a Supporting Role\nBe honest... before the season started, you didn’t expect to see Dree Gholston’s name coming up so many times throughout the season. I don’t blame you. I didn’t either.\nThe arrival of Isiaih Mosley was supposed to be an open-and-shut case on the wing. Mosley, perhaps the most purely gifted scorer in all of college basketball, would pour in 15-20 a night for the Tigers while Gholston, a prolific bucket-getter in his own right, would operate as the man on the margins, providing valuable scoring punch off the bench.\nAnd then Mosley’s 2022-2023 happened. Gholston’s number was called. And the legend of Green Light Gholston commenced.\nNo player simultaneously occupied the space between “star” and “backup” quite as deftly as the Milwaukee transfer. He was almost never the headliner, except for when he was the headliner. He was never the guy whose number got called, at least until he called his own. Without him, Mizzou doesn’t have two signature road wins on its resume. Without him, the season doesn’t have two of its most cathartic moments.\nWithout him, do fans ever really fall in love with this team? It’s impossible to imagine.\nBest “Original” Song\nI’m not here to pretend this is English Premiere League football. We can’t all be spinning off dozens of renditions of “My Old Man’s a Dust Man” or eloquently imploring the owners of our team to shove it. But we can take a good pop song and put our own unique spin on it!\nThe history of songs belonging to franchises and programs is probably as old as organized sports and nearly as enigmatic in its association. Why did West Ham United adopt a WWI-era American novelty song as its anthem or Liverpool a 1945 Rodgers and Hammerstein show tune? Who decided “Sweet Caroline” belonged to the Boston Red Sox or who first decided “Chelsea Dagger” would be a good fit for Blackhawks games?\n“Mr. Brightside” isn’t exclusive to Mizzou Basketball. Hell, it may not be around for more than a season or two. But this year, when the energy around Mizzou Arena lit up faster than a guy having a smoke, the match seemed just right.\nBest Original Screenplay\nYou don’t write scripts like this because they seem too silly. Too juvenile. Too unlikely.\nIf you’re going to script them like this, however, at least have someone deliver the dialogue with aplomb.\nBest Director\nDirectors get a lot of credit in the movies. Sometimes too much, if you ask me. Part of the beauty of cinema is that it’s collaborative by necessity. A great soloist can make a memorable piece of music. A great painter can create a masterwork. A great filmmaker needs other great filmmakers to make something beyond themself. So it is with basketball.\nYou won’t find me subscribing to auteur theory after this Mizzou season. No one player made this team great. Sure, one guy helped out more than most (more below), but any given player could be the hero on most nights.\nBut one guy predominantly ran the show. Made sure the leaders knew their lines. Made sure the blockers hit their marks. Made sure the focus went where it needed to go. One guy directed Dennis Gates’ rousing production. And that guy was Nick Honor.\nBest Player in a Leading Role\nDoes Kobe Brown own a donkey named Jenny? I doubt it. While I think he’d probably make a good donkey owner — he seems like an industrious, kind person who would care for an animal entrusted to him — only 0.1 percent of the world’s donkeys live in the U.S. That’s 10-20 thousand donkeys, meaning there’s a .00006 percent chance that one of them belongs to Kobe Brown.\nNone of that has anything to do with Kobe Brown’s basketball ability, which doesn’t require another paragraph from me to extol. The virtues of having Kobe Brown on your basketball team are many. He’s tough as nails and strong as hell. He can handle the ball and pass it better than your average 6’8” player. He’s a serviceable, switchable defender. And now he can shoot threes at an over 40 percent clip. Scary hours for defenses, man, I’ll tell you what.\nIt just feels like a missed opportunity. Not because there’s a particular area in his game that needs major improvement. It’s just that if he had a donkey, that’s a built-in team mascot. He’d be the team’s Most Valuable Player without it... I’m just saying.\nBest (Big) Picture\nGoing into Sunday evening, eventual Oscar winner for Best Picture, Everything Everywhere All At Once, was a -2000 to win the award at DraftKings Sportsbook. The next closest contender? All Quiet on the Western Front at +1000. The cellar dwellars? Triangle of Sadness and Women Talking at +20000.\nIf you had to set the odds, what would you say the chances are that Dennis Gates has seen Everything Everywhere All At Once? He doesn’t strike me as a cinephile, but I can’t be sure he hasn’t at least run into it at a team bonding event or something. After all, it did make a ton of money.\nIf he hasn’t, maybe he should though. Because Everything Everywhere has all of the same elements of Mizzou’s season thus far. A frenzied, chaotic pace. A cast of also-rans, no-names and under-appreciated stars. Humor. Heart. Plenty of laundry.\nIts win is also just about as unexpected as Mizzou’s journey in 2023. If you’d have told me back in March that a movie featuring multiversal kung-fu and multiple butt plug sight gags, directed by the guys who made this and also this, would win Best Picture, I’d have said, “sure, and Mizzou is getting a double buy in the SEC Tournament next year.”\nThat’s just classic me.\nMaybe this pick is more hopeful than anything. We don’t know where Mizzou’s journey will end. It seems unlikely to end with gold and glory. Then again, so did the movie featuring a core emotional moment featuring a malaprop on the movie Ratatouille. Yet here we are.",
  "word_count": 1176,
  "scraped_at": "2026-02-14T12:53:56.723376"
}