{
  "article_id": "09bb6f627b7a",
  "url": "https://www.starsandstripesfc.com/uswnt-news/2024/12/12/24318194/phallon-tullis-joyce-uswnt-united-states-womens-national-team-call-up-caps-manchester-united-keeper",
  "title": "SSFC Spotlight : Phallon Tullis - Joyce could push for USWNT starting role",
  "date": "20241212T180000Z",
  "domain": "starsandstripesfc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The United States Women’s National Team closed out the year with a pair of friendlies against England and the Netherlands, registering a 0-0 draw and a 2-1 victory, respectively. However, the big news from the window was the international retirement of Alyssa Naeher, whose departure will leave a massive hole between the posts and open the door for a new number one. Earning her first senior call-up, Phallon Tullis-Joyce could potentially challenge for the spot as her profile continues to grow. The 28-year-old Manchester United goalkeeper is picking up starts in the Women’s Soccer League and has the opportunity to push for the big role.\nSSFC Spotlight: Phallon Tullis-Joyce could push for starting spot with USWNT\nThe goalkeeper has an opportunity to stake a claim.\nBorn in New York City and raised in the Long Island village of Shoreham, Tullis-Joyce played with Farmingdale United and Match Fit, claiming the US Youth National League Championship. She also competed with Westchester Elite in the semi-professional Women’s Premier Soccer League, the Long Island Rough Riders in the W-League, and multiple Olympic Development Program squads. At the high school level with Longwood, the goalkeeper was named team MVP during all five years while also earning two All-Long Island and All-State honors.\nTullis-Joyce then matriculated to the University of Miami, and, after redshirting her first year, amassed nine starts in her first year on the field. As a sophomore, she started in all 19 matches and set a program record by conceding 16 goals, followed by a junior campaign that involved another 16 appearances while registering four shutouts. Summers were spent with FC Surge in the WPSL and a local adult league in Juneau while working as a marine biology intern conducting research into Alaskan salmon. Her final season as a Hurricane included another 18 matches while being named Second Team All-Atlantic Coast Conference and ending her career with the second-most shutouts and minutes in program history. Additionally, the school provided the opportunity to work with sports psychologists in order to prepare her for the jump to the professional game.\n“While playing college soccer, I always knew that was just the dream for me,” she told Get Football News France. “In the United States, you have academics and athletics together and I really wanted to get a degree in marine science and biology and on top of that play in one of the best conferences. Afterwards, towards my junior and senior years, I started realising that I love, love soccer, and I didn’t want to stop anytime soon. Then I started looking at my options, started training harder and really was open for whoever would accept me as a goalkeeper.”\nAfter declaring for the 2019 National Women’s Soccer League Draft, Tullis-Joyce went unselected and instead signed for Stade de Reims following a trial, then competing in the second division of France. The new challenge meant dealing with “a bit of a learning curve” due to the “quickness” of the opponents’ passing and shooting. In her first few months as a professional, she made three appearances and helped Les rouges et blancs (The Red and Whites) secure promotion to the top flight while also claiming a third-place finish in the 2019 Women’s Euro Winners Cup beach soccer tournament, an experience that helped her “become a better goalkeeper.” Her second campaign involved 16 appearances as the club comfortably avoided relegation. The following season, she featured in 22 matches and secured a respectable sixth-place finish in the Division 1 Féminine, earning praise for her “exemplary” tenure that included being named captain.\nTullis-Joyce then returned stateside and signed for OL Reign on a one-and-a-half-year deal, making one appearance in her first season but putting in strong work during training to impress management. She was a starter in the following campaign that saw the club claim the NWSL Shield, featuring in 30 matches across all competitions and racking up nine shutouts while being named to the NWSL Team of the Month for May and the Challenge Cup Team of the Tournament – in light of her performance, the club signed her to a contract extension. The next year was a further 16 fixtures before a new opportunity came calling in September.\nManchester United paid a reported record transfer fee to acquire her from Seattle, with management citing her “maturity and experience” while hoping to provide “continued development.” In her first season in England, Tullis-Joyce served as a back-up to Mary Earps and made four appearances during the League Cup. She received the PFA Community Champion award for her time working with the club’s foundation and was able to thrive in a communicative goalkeeper room.\n“While I didn’t have much game time last season, I have been the starting goalkeeper for some big teams,” Tullis-Joyce shared with the BBC. “I definitely respect the decisions of my coaching staff. They were also very transparent on my role in the team and how they wanted me to develop. I always felt like I was being prepared, which I was very thankful for. I was grateful for the chances I had that might have been in the shadows but were there.”\nAfter Earps left for Paris Saint-Germain, Tullis-Joyce stepped into the number-one role, with the manager praising her as “an incredible footballer” and “the best shot-stopper” in his coaching career. She picked up a 3-0 shutout victory over West Ham in her debut and has made 11 combined appearances across all competitions, sporting a 5-1-3 record in the domestic league as a fourth-place Manchester United pushes for a Champions League spot. Despite taking the reins after a year as a back-up, there has been little sign of rust, with “impressive performances” of “classy handling skills” and command of the box.\nAt the international level, Tullis-Joyce was largely absent from the United States program outside of a U-23 camp and being included on the provisional squad for the 2022 CONCACAF W Championship. She earned her first senior call-up for the friendly matches against England and the Netherlands. Despite failing to make an appearance in either match, the retirement of Naeher creates the opportunity for her to push for a debut and receive further playing time.\nStanding above six-foot tall, Tullis-Joyce is an “physical, athletic” figure at goalkeeper with “size and shot-stopping ability” and has worked to become more of a factor in the build-up. Her time in France improved her “distribution, thought processes, sharpness, quickness, and [dealing with] different kinds of shots.” Observers praise her “tools to be world class” along with a strong “mentality and attitude” that “push her to [new] heights.” Hayes assessed her “shot-stopping and ability to cover the frame” as “second to none” but noted room for improvement in “building up with the team.”\n“The keeper is well-placed to deal with crosses and set pieces,” wrote Boh Blythin for Impetus Football. “She stays composed well under pressure, with her ability to make critical saves in important moments keeping Manchester United a competitive and attacking side in tight and challenging matches. Good game reading means Tullis-Joyce understands how to handle quick turnovers and help United transition from defence to offence. A skill like this is valuable, meaning fast delivery of the ball enables teammates to catch opponents off guard.”\nWith the retirement of Naeher, there is the opportunity for someone to grab the reins of the goalkeeping position. However, with several years until the next World Cup, Hayes will likely give multiple players the opportunity to stake a claim and compete for minutes. As a recent entrant into the program, Tullis-Joyce is a curious potential option who has steadily grown and developed during her professional career with regular steps up the ladder, taking a journey that could lead all the way to USWNT starter.",
  "word_count": 1292,
  "scraped_at": "2026-02-14T12:48:56.605345"
}