{
  "article_id": "09d96aad31af",
  "url": "https://www.afl.com.au/aflw/news/1031194/after-616-days-of-doubts-delays-and-decisions-isabel-huntingtons-long-wait-finally-ends",
  "title": "After 616 days of doubts , delays and decisions , Izzy long wait finally ends",
  "date": "20230914T054500Z",
  "domain": "afl.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "THERE is something Isabel Huntington has forgotten.\n\"I can't remember my pre-match routine,\" she tells AFL.com.au.\n\"I should have written it down. Actually, I don't know whether it worked anyway.\"\nShe'll need to remember it pretty quickly, though. Because, after 616 long and gruelling days filled with emotions ranging from doubt, to excitement, to acceptance, and just about everything in between, Huntington will be back playing in the AFLW this weekend.\n\"It's pretty weird, the thought of playing again,\" Huntington says.\n\"It feels so foreign to you after being out for so long, it's almost like you're starting your career from scratch. You don't know whether you'll be able to perform as you did before. It just feels weird, you forget so much.\"\nThe Giants told Huntington she would be making her long-awaited comeback during an impromptu team meeting held on Wednesday afternoon, her reward for more than 20 months' worth of operations, rehabilitation, and conversations around whether she would even return at all.\n\"There are so many times when you think, do I just give up? Is it actually going to work out? Is it worth it? You get used to the idea of questioning your career at a really young age,\" Huntington says.\nBut when the realisation hit for Huntington that she would finally make her comeback – and that she would be doing so in front of family and friends travelling up to Blacktown this Saturday when Greater Western Sydney hosts Richmond – the answer was yes. Yes, it was all worth it.\nIt was during an AFLW game on January 8, 2022, when Huntington ruptured the anterior cruciate ligament graft, most commonly referred to as the 'ACL', in her right knee. It was the second time that particular knee had failed her, and the third ACL injury Huntington had sustained in fewer than six years of football.\nFor the supremely talented and universally respected 24-year-old, a lot has changed in the time that has since elapsed. She's at a new club, living in a new city, playing under a new coach, working in a new field, surrounded by new teammates and new experiences. She has left Melbourne's football bubble, in doing so finding a newfound and richly deserved sense of balance in her life.\nLeaving the Western Bulldogs, the club that drafted her with the No.1 pick in 2017 and provided the home for her first 20 AFLW games, was a gut-wrenching decision. But it was a necessary one, one that crystalised in the months after her most recent injury.\n\"She needed the change as a human being, not so much as a footballer,\" Huntington's manager, Alex Saundry, tells AFL.com.au.\nHaving undergone a third knee reconstruction in the weeks after her most recent injury, Huntington couldn't turn on a TV, tune into radio station or even go to a local pub without seeing and hearing football everywhere. It was a constant reminder of what would be missing from her life for the next 20 months, as she started another brutally long period of rehabilitation.\nHuntington had long been tossing up a move to Sydney, where she had friends, family and a series of career opportunities. This was the perfect chance to finally pull the trigger. The Giants were interested, a trade was agreed, and one of the League's most high-profile moves was completed.\n\"For Izzy, it's always been about a little bit more than football,\" Saundry says.\n\"Her decision, particularly around changing her environment, it was more about moving forward and progressing. The conversation had two elements to it, the personal life and then the need for a bit of a different challenge in terms of her living situation. To their credit, the Dogs were fantastic in their understanding of Izzy needing a bit of a fresh start as an individual.\"\nAnd so came the move to Sydney. For Huntington, it was the culmination of months of weighing up the pros and cons, of listening to advice, and of closely considering what she wanted from the next phase of her life. Ultimately, it wasn't a football decision. After all she had been through, it couldn't be.\n\"When you suffer an injury like this, you're forced to shift your perspective a little bit and realise that footy can't be everything. It can just get taken away from you in a split second,\" Huntington says.\n\"After I did my third knee, I was certain that I just couldn't prioritise footy as the biggest and sole thing that I will use as the decision-maker in my life. That was a really big factor in coming up here. It just really drives home how much you need other elements of your life. Footy isn't and can't be everything, unfortunately.\n\"Having it in your ears and on your screens 100 per cent of the time, it really just reinforces that you're not playing and you're on the sidelines. It's genuinely refreshing up here, it's that reminder that there's more to life than a game.\"\nFor Huntington, footy has never been everything. She is simply too gifted in too many other facets of her life. She had previously studied a Bachelor of Science at the University of Melbourne, completing an honours thesis building synthetic kidneys through 3D printings of patient scans for surgeons to train on. They're studies she plans to resume after her comeback this season.\nIn Sydney, she has also found her purpose away from the field – but not entirely out of football – working as a player engagement manager for Footy for Climate, a non-for-profit organisation that seeks to push sustainable practices within the AFL. Huntington herself plays a crucial role in engaging with men's and women's players to further involve themselves in climate action and education.\n\"She's such an incredible person,\" Saundry says.\n\"Just seeing the frustration and the emotion she's gone through in the past couple of years, it's shattering. She's got such an incredible ability to be one of the best footballers in the competition. It's for no lack of trying, effort or talent. It's actually just how her body has let her down, that's factual.\n\"I'm just super proud of her resilience and her ability to make light out of the situation and find ways to keep investing in herself. It'll be really emotional for me to watch her come back. I couldn't be prouder of Isabel the footballer, but Isabel the person too.\"\n'Isabel the person' was introduced to her new Giants teammates by way of an all-club bonding activity. The premise, designed by the club's new AFLW coach Cam Bernasconi, was for everyone to explain the reasons why they loved footy. For Huntington, her presentation was focused on celebrating the success of others regardless of how that success was defined.\nGiants captain Alicia Eva, who has known Huntington for more than a decade after first coaching her as a 13-year-old while working in junior girls' football programs, was moved by the presentation. For the club, it was an instant reflection of the person they had just recruited, not only the footballer.\n\"You could never question her love of the game,\" Eva tells AFL.com.au.\n\"What we've always known about Izzy is that yes, she's such a talent and she's got such a strong game and adds so much. But you can tell she's someone who just loves being in a team environment. Even in years gone by where she hasn't been playing, she's offered and contributed so much to that team environment just by being herself.\n\"For Izzy to get back, that's success for her. For her to get back and play and enjoy football, a game she's grown up loving, it's incredibly important. That's her 'why' and I can't wait to celebrate that with her. She's like a little sister to me. I love her very much and I'm really pumped for the weekend.\"\nAll the while – amid study, work, moves and rehab – footy has bubbled away in the background for Huntington. It might no longer be the most central or defining part of her life, but it remains an important one.\nShe has found inspirations hard to come by during her recovery. After all, not many elite athletes have suffered three torn ACLs and returned to tell the story. But she was touched by a letter she received from Adelaide's dual premiership star Marijana Rajcic, one of the few that has, while she has also formed a close bond with young teammate Isadora McLeay as the teenager completes her own recovery from a long-term knee injury.\nThe timing of Huntington's most recent injury, combined with a decision to introduce dual AFLW seasons last year, meant she has essentially missed three campaigns. Meanwhile, a minor procedure to fix some cartilage damage in July has also forced a delayed start to the current season. But, after making it through a hastily arranged scrimmage match last week, she's finally been given the green light. On Saturday, she will be back.\n\"I feel like it's just a case of getting back out there,\" Huntington says.\n\"I've got no idea if I can perform the way I did in previous seasons. It'll hopefully come back to me pretty quickly. But I think, for the first few games at least, just getting a game under my belt and getting through will be really cool.\n\"I remember coming back from my last one, I think I had three disposals in my first three games. I was really just running around in circles like a headless chook, but it was just cool to get back out there.\n\"With ACLs, there's the return-to-play and then the return-to-perform timelines. They're pretty different, so it's tricky. The competition has changed as well. It's evolved so much. I've got no idea how I'm going to shape up against some of these new girls who have come in and started dominating.\"\nThe Giants don't have any concerns, though. After all, Huntington is a player who was crowned the AFLW's Rising Star, named in its All-Australian team, and awarded the Dogs' best and fairest in what was essentially her first full season in 2020. She had done all of that after being switched into an unnatural defensive role, as well.\nAt her best, whether it's forward or back, Huntington is genuinely among the best footballers in the AFLW competition. Having been starved of seeing such a talent for so long, her return is one that will undoubtedly be celebrated across the League.\n\"How exciting is that? That is the coolest thing,\" Eva says.\n\"Still, to this day, when Izzy is at full throttle, she is one of the best players in the competition. That is super exciting. That's why the club did take this gamble on her, for want of a better term. We recruited her while she was undertaking ACL rehab, but that was because of the person she is and also the footballer we know she can be. She is such a talent.\"\nFor Huntington, though, all she wants is to be back out there. Saturday's game in Blacktown will be the end of a long and frustrating, yet rewarding part of her football journey. Hopefully, it will also be the start of something special and sustained as well.\n\"I don't know if I'll be nervous or excited or indifferent,\" Huntington says.\n\"I've become so acclimatised to not playing footy, it's almost like I'm a staff member at this stage. It's almost weird playing, for me, as opposed to being weird watching. I feel like I'm pretty well acclimatised to just watching.\n\"It's probably good to reflect on the journey as well and I'm sure I will. It's taken a lot to get here and I'd like to think it's all going to be worth it, all of the tough times and all of the emotional ups and downs.\n\"But for now, it'll be pretty cool to just be out there. It's going to be sick.\"",
  "word_count": 1995,
  "scraped_at": "2026-02-14T13:25:57.838212"
}