{
  "article_id": "09f8f35a8e71",
  "url": "https://www.90min.com/arsenal-women-first-us-pre-season-tour",
  "title": "Arsenal Women confirm first ever US pre - season tour",
  "date": "20240610T183000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Arsenal Women confirm first ever US pre-season tour\n- Arsenal will be based in Washington DC from 15-26 August\n- Friendly matches will take place between Washington Spirit and WSL team Chelsea\n- Jonas Eidevall previously criticised for scheduling decisions that leave players tired\nArsenal Women will be heading to the United States for the first time this summer as part of their pre-season preparation.\nThe team will be based in Washington DC from 15-26 August, with friendly matches taking place against National Women's Soccer League side Washington Spirit and Women's Super League champions Chelsea.\nThe games will take place at Audi Field on 18-25 August, with a training camp at George Mason University.\nArsenal sporting director Edu Gasper said: \"We always want to create the best conditions for our teams to prepare and perform at their best in pre-season. This gives our players an opportunity to play and train in a new environment, in front of our supporters around the world.\"\nManaging director Richard Garlick added: \"To take our women's team to the US for the first time on tour is another sign of great progress.\n\"We know from our recent trip to Australia that the interest and love for Arsenal Women stretches far and wide. We want to build on that and bring our US supporters closer to the club.\"\nAlthough Arsenal's first match in Australia drew in crowds of over 40,000, the decision to go Down Under reignited a controversial debate on the correlation between scheduling and player welfare.\nNot only did the exhibition match take place just days before the season ended, it also concluded right before the next international window. This saw players returning to the United Kingdom right before the Lionesses' vital Euro 2025 qualifier against France on 31 May.\nDefender Leah Williamson and striker Beth Mead decided to opt out, but Alessia Russo was among seven senior internationals named in the squad.\nAt the time, England head coach Serena Wiegman criticised the Gunners' plans, claiming she was 'surprised' when she first heard about the exhibition match.\nThe most recent news of a trip to the US will see a handful of players, specifically those who've been involved in international qualifiers, arguably lose out on the opportunity to take adequate rest before the WSL 2024/25 season.",
  "word_count": 382,
  "scraped_at": "2026-02-14T12:22:31.245617"
}