{
  "article_id": "0a0dccf2c3a0",
  "url": "https://www.runnersworld.com/news/a60952943/man-runs-every-premier-league-stadium/",
  "title": "He Running to Every Premier League Stadium for Suicide Prevention",
  "date": "20240531T184500Z",
  "domain": "runnersworld.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Matthew Smith was only 10 years old when he lost his brother, Daniel O’Hare, to suicide. Daniel was 19 and had no history of mental health problems, nor had he shown any outward signs of his intention to end his life. His family was devastated by the sudden and unexpected loss, and they are still struggling to understand his choice.\nNow 29, Smith is an advocate for mental health, and he’s on a mission to run 900 miles to every Premier League stadium in England to raise money for the region’s services. The northeast region, where Smith lives, has the highest rate of suicides in the country, and he and his supporters are determined to change that. He plans to take on this ultrarunning challenge in his brother’s honor in August, and he has the goal of raising £135,000 ($171,882) and spreading awareness of suicide prevention. He told Chronicle Live that along the way, he’ll be delivering the message that “it’s okay to not be okay,” and that there is “always a way.”\nAfter losing Daniel in 2005, Smith and his younger brother and cousin started a nonprofit in his memory called If U Care Share, because they wanted to do something positive and prevent other families from going through the same kind of loss. They sold wristbands at soccer clubs that said “if u care share,” and raised over £50,000 ($63,655) for mental health charities.\nIn 2011, the charity was officially registered with three main objectives: prevention, intervention, and support for survivors of suicide loss. For more than a decade, If U Care Share has offered support to people who have lost loved ones to suicide and provided advice and assistance to people who are at risk of killing themselves.\nTwo years ago, Smith ran 250 miles from the charity’s headquarters in northern England to Downing Street in London to hand deliver a letter asking the U.K. government to include suicide prevention in the Levelling Up White Paper, a moral, social, and economic program.\nThis latest initiative came about because of Smith and his If U Care Share colleagues’ love of soccer and longstanding partnerships with the Premier League, the League Football Education, and the Women’s Super League.\n“It’s no secret that suicide prevention and mental health services have struggled recently due to significant funding restrictions, so I can’t thank everyone enough for believing in the charity, our mission, and myself,” Smith told Chronicle Live. “The money raised at the launch event will not only enable the challenge to go ahead, it will also save lives, support communities, and prevent suicide in a region that needs our help more than ever.”\nAbby Carney is a writer and journalist in New York. A former D1 college runner and current amateur track athlete, she's written about culture and characters in running and outdoor sports for Runner's World, Like the Wind Magazine, The New York Times, and other outlets. She also writes about things that have nothing to do with running, and was previously the editor of a food magazine.",
  "word_count": 508,
  "scraped_at": "2026-02-14T12:41:43.070183"
}