{
  "article_id": "0a2b003698c3",
  "url": "https://www.wtol.com/article/news/local/they-made-champions-out-of-us-toledo-troopers-story-hits-streaming/512-082908d4-b901-4000-86b7-16c2eb0b438f",
  "title": "  They made champions out of u | Toledo Troopers story hits streaming",
  "date": "20260119T223000Z",
  "domain": "wtol.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "TOLEDO, Ohio — Long before the modern explosion of women’s sports, a group of women in Glass City jerseys were quietly building the winningest dynasty in professional football history.\nTheir story went global Friday with the Amazon Prime release of \"We Are the Troopers.\" The feature documentary chronicles the rise of the Toledo Troopers, a powerhouse team that dominated the National Women's Football League in the 1970s.\nOperating in the pre-Title IX era, the Troopers defied social norms to play full-contact, professional tackle football. The team had a 58-5 record and seven national championships.\n\"It was a team that was formed by Bill Stout,\" said Gloria Jimenez, who played seven seasons with the Troopers. \"They trained us, taught us to play football, which was basically a man's game. And we became champions. They made champions out of us.\"\nThe documentary arrives at a time when women’s athletics are seeing record-breaking viewership, but producer Tom Sanders says the Troopers’ foundation was essential to that progress.\n\"It's just wild that these women were playing in a professional football league, and it was unheard of,\" Sanders said. \"They were seven-time world champions, undefeated for years in a row, so they really accomplished quite a great feat in their time playing.\"\nFor the players, the film is more than a highlight reel; it is a long-overdue validation of their struggle and success.\n\"Releasing on Amazon means this story can finally reach the audience it deserves,\" director Jonathan Kimble said.\nJimenez said that while the team didn't receive much recognition in the 1970s, their bond has remained unbroken for decades. The former teammates still meet for breakfast every month to stay in touch.\n\"I think it's time that, you know, they see the foundation and the legacy that the Toledo Troopers built for Toledo,\" Jimenez said. \"I think in today's society women want to be athletes, and I think that they have a right to be. They're aggressive, they're smart, they're intelligent.\"\nWhile the team hasn't taken the field in 40 years, Jimenez believes their impact is visible in the 60 women's football teams currently playing across the United States.\n\"We just laid the foundation for them,\" Jimenez said. \"I think we did something special.\"\n\"We Are the Troopers\" is available for streaming on Amazon Prime.",
  "word_count": 381,
  "scraped_at": "2026-02-14T12:51:33.038602"
}