{
  "article_id": "0a370bd10ccf",
  "url": "https://theathletic.com/4805213/2023/08/25/gonzalo-montiel-nottingham-forest-transfer/",
  "title": "Gonzalo Montiel denies the allegations against him – but what are Forest thinking ? ",
  "date": "20230825T170000Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "There are several questions posed by the signing of Gonzalo Montiel by Nottingham Forest, but you keep coming back to the most basic one: what are they thinking?\nMontiel’s signing was confirmed on Wednesday despite Forest being aware that the Argentina international has been accused of rape in his home country.\nAdvertisement\nThe specifics of the case were laid out in detail by The Athletic’s Guillermo Rai on Friday, but the short version is that in 2019, a party took place at Montiel’s house in Buenos Aires. A young woman alleges she was raped in a bedroom at the party and has identified Montiel and two other men as being responsible.\nMontiel and another man named in the case strongly deny any involvement in the alleged crime.\nThe right-back gave his account to investigators earlier this year. An Argentinian prosecutor told The Athletic that the case is still ongoing and that Montiel may be called to give evidence again. Montiel has not been charged.\nForest were sent a number of questions about the case by The Athletic, to which they responded: “The club has conducted due diligence and we are fully satisfied following conversations with his representatives.”\nBut again, we have to ask: what are they thinking?\nThey have knowingly signed a player who has been accused of a heinous crime. Again, Montiel denies the accusations, but the road ahead may not be smooth, and what if things don’t go quite as Forest might expect?\nForest’s assertion that they are “fully satisfied” essentially implies they do not think Montiel will be convicted but, as The Athletic has reported, both the lawyers of the alleged victim and the Buenos Aires prosecutor’s office say the club have not contacted them.\nThe case is ongoing, so even if Forest say they are “satisfied”, the Argentinian prosecutor clearly is not.\nIt should be made clear that there are significant differences between this case and the one involving Mason Greenwood, not least the audio and pictures that appeared on social media in the Manchester United forward’s case. Greenwood denied the accusations and the charges were discontinued because the UK’s Crown Prosecution Service felt there wasn’t a realistic prospect of conviction.\nGO DEEPER\nMason Greenwood and football - what happens next?\nAt the same time, there are certainly similarities, in as much as this is a Premier League football club trying to deal with a player under suspicion of committing an incredibly serious crime involving sexual violence against a woman.\nAdvertisement\nAnd yet while United handled that situation badly, reaching the right conclusion but for the wrong reasons, in their defence you could say they were dealt an extremely difficult hand. They had a player in their ranks, who had been there since he was a boy, who suddenly gave them a decision to make and a case to consider.\nThat’s not the case for Forest. They have walked into this entirely voluntarily. They knew the circumstances and yet signed Montiel anyway, we have to assume in the hope that he will not be convicted. They have made things deliberately complicated for themselves when they didn’t need to.\nOn a purely pragmatic level, they have recruited a player who simply might become unavailable to them at any time. Some new signings could get injured, some new signings might not fit with the team, some new signings might not get on with the manager. Things go wrong with new signings all the time, but most of them are unforeseen. This is the opposite of that. They knew this could be a problem and yet they did it anyway.\nBut they have also signed someone who has been accused of one of the worst crimes anyone can commit. Again, Montiel denies the accusations, but if he were to be convicted, they wouldn’t have a moral leg to stand on. They couldn’t possibly say there were caught unawares.\nWhat does this say to the woman involved? What does this say to all women? What does this say to all people, in fact? It says, not for the first time, that football does not take these sorts of accusations seriously.\nAs with Greenwood, we have to talk about the football considerations because even if it shouldn’t matter in the slightest, it clearly does. United would not have spent so long considering that case if Greenwood wasn’t an extremely talented and valuable footballer. On-pitch considerations are always taken into account in situations that should otherwise be moral.\nAdvertisement\nBut in this scenario, even that consideration is lessened. Yes, Montiel is a fine player, but he’s a right-back and Forest already have three of them: Neco Williams, Ola Aina and Serge Aurier. They have four if you count Giulian Biancone, who can play in that position but is returning from a serious knee injury. They signed Aina this summer. Williams has 30 caps for Wales and only missed the end of last season because he broke his jaw. Aurier was one of the surprises of last season and provided two brilliant assists in the 2-1 win over Sheffield United last weekend.\nThe club may not particularly rate Williams, who hasn’t been a regular starter since joining from Liverpool last summer. The injury to Aina which kept him out of that Sheffield United game might be more serious than it initially appeared. They might think they squeezed a lot of juice out of Aurier last season, or they might want to move him to play as a right-sided centre-back.\nBut it was still a signing Forest didn’t need to make. If this was a world-class player in a position Forest were deficient, you could at least understand the decision more on a purely football level, if not others.\nYou should be excited when a new player arrives at your club. Particularly when it’s an international. Particularly when it’s an Argentina international. Particularly when it’s the bloke who quite literally scored the winning penalty in the World Cup final not nine months ago.\nYou should be wondering about the football implications: does the player fit into the team? Is he better than the players the team already has? What qualities will they bring to make the team better? Will they be exciting to watch? Are they going to give me a moment that I will never forget?\nBut not this time.\nOn every conceivable level — football, moral, practical — it’s impossible to see why Forest have taken this decision.\nWhat are they thinking?\n(Top photo: Pedro Salado/Quality Sport Images/Getty Images)",
  "word_count": 1087,
  "scraped_at": "2026-02-14T13:26:06.992079"
}