{
  "article_id": "0a4ca4d2d8e8",
  "url": "https://news.sky.com/story/london-overground-rebrand-goes-live-here-are-the-new-names-and-colours-of-the-lines-13262211",
  "title": "London Overground rebrand goes live : Here are the new names and colours of the lines",
  "date": "20241128T150000Z",
  "domain": "news.sky.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "London Overground rebrand goes live: Here are the new names and colours of the lines\nChanges to the lines, which were previously described as a \"mass of orange spaghetti\" on maps, aim to celebrate \"untold elements of London's cultural history\".\nThursday 28 November 2024 13:57, UK\nThe six new names and colours of the London Overground lines have been officially launched by the Mayor of London.\nThe rebrand aims to celebrate \"untold elements of London's cultural history\" with names relating to the Windrush generation and England women's football team.\nTransport for London (TfL) is updating 6,000 station direction signs as well as maps, digital screens and online journey planners, with Sadiq Khan officially unveiling the changes on Thursday.\nThe updates are estimated to have cost £6.3m, so what differences can passengers expect to see?\nThe new names and colours of the London Overground lines are as follows:\n• Lioness: The yellow line running from Watford Junction to Euston. It also runs through the heart of Wembley, where the Lionesses won the UEFA Women's Euro final in 2022;\n• Mildmay: The blue line running from Richmond and Clapham Junction to Stratford, named as a celebration of a small but crucial charitable NHS hospital of the same name in Tower Hamlets;\n• Windrush: The red line running from Highbury & Islington to New Cross/Clapham Junction/Crystal Palace/West Croydon, a nod to the Windrush generation and arrival of HMT Empire Windrush in June 1948;\n• Weaver: The maroon line running from Liverpool Street to Enfield Town/Cheshunt/Chingford, it runs through certain areas that are known for the textile trade;\n• Suffragette: The green line running from Gospel Oak to Barking Riverside, derived from the groups that campaigned for votes for women;\n• Liberty: The grey line running from Romford to Upminster, a nod to what TfL calls a \"defining feature of London\". The name also references the motto of the borough of Havering, and its historical status as a royal liberty.\nLondon Overground lines have all been orange on TfL maps since the network was created in 2007, when the transport authority took control of services on four suburban rail lines.\nThe system has since expanded to 113 stations, but the use of a single colour has created what has been described as a \"mass of orange spaghetti\" on maps, making it difficult for some passengers to work out what train they need.\nBut the new names may not have curbed all confusion.\nWriting on X, one user said: \"Teething problems with London Overground. I thought I was on the Lioness Line, turns out my new line is Mildmay! Good thing getting to my platform was reflex and not following the names. Also I can barely recognise Mildmay on the tannoy!\"\nA second person said: \"How on earth are people supposed to remember these changes? Especially those of us that only use the tube line a few times a year and the London Overground once every three-four years.\"\nBut others seemed to enjoy the updates, with one saying: \"First journey on the renamed Mildmay Line, the railway formerly known as the Overground. Love these new names, paying tribute to London's heritage.\"\nAnd another said: \"Travelled on the newly renamed overground last night. I thoroughly approve of the Windrush line and the five other renamed lines.\"\nRead more:\nLord Blunkett demands action on Tube platforms\nSpeed limit cut on single carriageway roads being considered\n£3 bus fare cap could be scrapped\nLaunching the new lines on Thursday, Mr Khan said: \"I'm delighted to officially launch the six new line names and colours of the London Overground, in an historic change to the capital's transport network.\n\"These distinct colours and identities will not only make our fantastic London Overground network easier for customers to navigate, they also celebrate the best of London, from the contribution of the Windrush generation to our inspiring England women's football team, as well as other untold elements of London's cultural history.\"\nHe said the London Overground is \"now a reminder that we wouldn't be the city we are today without the energy and diverse experiences of everyone who lives here\".",
  "word_count": 688,
  "scraped_at": "2026-02-14T13:05:16.299646"
}