{
  "article_id": "0a8251a57562",
  "url": "https://www.blackenterprise.com/deshaun-watson-sexual-assault/",
  "title": "Deshaun Watson Still Scheduled To Play Despite Assault Claims",
  "date": "20240913T170000Z",
  "domain": "blackenterprise.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "September 13, 2024\nDeshaun Watson Scheduled To Play Sunday Despite New Sexual Assault Claims\nDeshaun Watson \"strongly denies\" claims made by the latest woman accusing him of sexual assault.\nDeshaun Watson will still play for the Cleveland Browns against the Jacksonville Jaguars Sunday despite another woman accusing the quarterback of sexual assault.\nCurrently more than 20 women have accused him of sexual assault.\nWatson expressed his surprise Wednesday at the civil lawsuit filed Monday, September 10, by a woman identified as “Jane Doe,” who claims Watson, 28, sexually assaulted her in her apartment before a dinner date in October 2020, CNN reports.\nWatson, who said he learned about the lawsuit when it became news, fielded questions during a press conference. He said his lawyer’s statement reflects his feelings on the matter.\n“We have asked him not to comment further while this matter works its way through the courts, but are comfortable he will ultimately be vindicated,” Watson’s attorney, Rusty Hardin, said in response to the latest suit.\n“We will be ready to defend this case in court at the appropriate time, but don’t intend to conduct our defense in the media,” Hardin added. “We would ask that people be patient while the legal process runs its course. In the meantime, Deshaun is going to focus his energy and concentration on football.”\nJane Doe filed the lawsuit in Houston. She is accusing Watson of sexual assault, battery, and intentional infliction of emotional distress in 2020. She seeks over $1 million in compensatory and punitive damages.\nThe plaintiff’s attorney, Tony Buzbee, released a statement Wednesday, refuting the claims made by Hardin and stating that he had reached out to Hardin 10 months earlier to negotiate a resolution. He also accused Watson of lying about being unaware of the latest allegations.\n“We knew this case was the most serious and egregious case brought against Watson to date and our client, who is rightly traumatized by these events, wanted to attempt a private resolution,” Buzbee wrote in an Instagram post. “We thought that was the best approach given the media storm surrounding the legion of other claims.\n“Unfortunately, Watson’s team or maybe his lawyers couldn’t or wouldn’t give this case the attention it was due…Watson was well aware of this victim and her claims immediately after it occurred and Watson was again reminded back when we filed the first lawsuit for the other multiple victims.”\nThe new suit is the latest of more than two-dozen suits filed against Watson that accuse him of sexual assault. In 2022, the NFL and the NFL Players Association agreed to suspend Watson for 11 regular-season games without pay and fined him $5 million after at least 24 civil lawsuits.\nThe lawsuits, brought by women, allege that the quarterback sexually harassed or assaulted them during private massage sessions while he was with the Houston Texans. Watson has consistently denied wrongdoing in those cases, with 23 lawsuits being settled confidentially. Two grand juries chose not to pursue criminal charges against him.",
  "word_count": 501,
  "scraped_at": "2026-02-14T14:14:55.794910"
}