{
  "article_id": "0a84a69028fe",
  "url": "https://www.thefa.com/news/2024/oct/26/five-things-you-might-have-missed-from-england-women-v-germany-20242510",
  "title": "Five things from England women v Germany",
  "date": "20241026T101500Z",
  "domain": "thefa.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The England women’s senior team returned to Wembley Stadium on Friday evening as they kicked-off their 2024-25 season.\nSarina Wiegman’s squad are preparing for next summer’s UEFA Women’s EURO Finals in Switzerland and lost 4-3 in a topsy-turvy game in front of 47,967 fans.\nAnd while there was plenty of action on the pitch, it was a busy night at the national stadium off it too.\nLionesses alumni receive their caps\nA number of former England players received their England Legacy caps retrospectively this evening. Among them were goalkeepers Kay Hawke (#166, one cap) and Lesley Shipp (#81, 16 caps), defenders Michelle Curley (#92, 5 caps) and Dunia Susi (#170, 21 caps), midfielder Sian Williams (#97 – 20 caps) and striker Carmaine Walker (#148 – 7 caps).\nHoughton's Wembley return\nSteph Houghton’s remarkable England career saw her win 121 caps for the senior team across 14 years. She featured in three World Cups in 2011, 2015 and 2019 and at the EURO Finals in 2013 and 2017 and was named as Lionesses captain in 2014. She went on to be a key player in a breakthrough moment for women’s football, as she led the team to a historical bronze medal in the 2015 FIFA Women’s World Cup in Canada, capturing the nation’s imagination and catapulting the growth of the women’s game even further. Wembley Stadium has been home to some of Houghton’s most memorable football moments. She famously scored the winner against Brazil in Team GB’s 1-0 victory at the London 2012 Olympics in front of a crowd of 70,000. She also walked up the famous steps to the Royal Box and lifted the Women’s FA Cup trophy in 2017, 2019 and 2020 with Manchester City. And on Friday, we paid a tribute to her contribution following her retirement from playing earlier this year.\nZara backs the Lionesses\nAmong our special guests on Friday was another England women’s international in Zara Musker, who represents the England women’s deaf team and was a key player in helping the Para Lionesses pick up a bronze medal at the world championships in Brazil last year. Ironically, Musker and her teammates beat Germany in that game to secure third place.\nBlack officials celebrate Black History Month\nAs Black History Month continues until the end of the month, we were pleased to welcome a group of Black officials to the Wembley Suite for the evening. Among the group were a number of recognised elite level officials including Sam Allison along with some of those who have been working at grassroots level for a number of years such as Patsy Andrews. The full list of guests for this celebration was Sam Allison, Troy Townsend, Ashley Hickson-Lovence, Abi Oyeleke, Juliette Joseph, Coral John, Raj Randhawa, Leon Mann, Joel Mannix, Dan Forbes, Jawahir Roble, Val Anekwe, Vinny Wagjiani, Leah Godfrey, Rashpal Shergill, Levi Gray, Angela Corrado, Harrison Blair and Lauren Impey.\nOlympians in attendance\nWe were also pleased to welcome four women who represented Team GB at the Paris 2024 Olympic Games earlier this year. Imogen Grant (Olympic Medalist Gold, women’s lightweight double sculls), Becky Wilde (Olympic Medalist Bronze, women’s double sculls), Sam Redgrave (Olympic Medalist Silver, women's four) and Emily Ford (Olympic Medalist Bronze, women's eight) all watched the game from Wembley’s Royal Box.",
  "word_count": 547,
  "scraped_at": "2026-02-14T13:05:42.586548"
}