{
  "article_id": "0a99657f336e",
  "url": "https://thenationonlineng.net/afcon-2025-sadio-manes-lesson-in-leadership/",
  "title": "AFCON 2025 : Sadio Mane lesson in leadership - The Nation Newspaper",
  "date": "20260124T063000Z",
  "domain": "thenationonlineng.net",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Nnedinso Ogaziechi\nJanuary 24, 2026 by Nnedinso Ogaziechi\nAFCON 2025: Sadio Mane’s lesson in leadership\nThe 2025 Africa Cup of Nations (AFCON) has come and gone as Senegal’s Teranga Lions beat the host team, Atlas Lions of Morocco to lift Africa’s most coveted football trophy. This year’s tournament more than ever exposed a lot about African football, the capacity of the Confederation of African Football (CAF), the beauty of nations imbuing players with a sense of self and patriotism, the values and limits of infrastructural development especially for sports and in this case, global football and every other thing in between.\nThe Kingdom of Morocco has in the last two decades taken the initiative to invest massively in the game of football through infrastructural and youth development. They have shown what focus can do especially for a game that is living out ‘the beautiful game’ tag. Global football has become some trillion dollar economic pie. It’s more than a game, it is now an economic and socio-political tool with diverse powers.\nFor the African continent, it is paradoxical that she gives the game so much in human capital yet, reaps so little economically due to leadership failures. The various leagues in the world have the brilliant imprints of African players; the English Premier League, Spanish La Liga, Italian Serie A, the German Bundesliga, the Ligue 1 of France and other continental leagues in Africa, Asia, South America which for obvious reasons are not in the same league as those in Europe.\nMorocco’s investment in football has given the nation a seat at the table of football politics and economic benefits. In the last fifteen years FIFA has given them hosting rights for; 2013, 2014 and 2022 FIFA Club World Cups, 2025 Under-17 Women’s World Cup and 2025 CAF Women’s Africa Cup of Nations (AFCON). They would be co-hosting the 2030 FIFA World Cup with Portugal and Spain. They would be the second African country to host World Cup after the 2010 South African experience. They have also given a boost to female football in the continent with their Atlas lionesses winning silver at the 2025 African Women’s Cup of Nations.\nHowever, because the impact of football has gone beyond the pitch of play, Morocco’s hosting of 2025 AFCON came with so many lessons for Africa as a continent. The post-independence Pan-Africanism spirit seems to have lost steam. The Moroccans through some actions during the games have shown that geography can be of economic value but without the sociological bonding that ought to exist between the citizens within the geographic region.\nThe several racist chants at black players and the bullying of Nigeria’s Stanley Nwabali whose towels were stolen and banana thrown at him and the bullying of the Senegalese reserve goal keeper by both officials, players like Hakimi and ball boys showed some citizens do not share in the African brotherhood neither do they care about sportsmanship in the game. The post-match taunting of the Senegalese coach, Pape Thiaw by some Moroccan journalists was as unprofessional as it was unethically anti-sportsmanship.\nThe leadership of national football associations and even CAF as a continental body must reform to align with set standards for the game not just for the on-the-pitch play but beyond that. Administration of football must not end at attending meetings and competitions. A country like Nigeria that has become notorious for stressing out players and coaches by not paying them allowances promptly must begin to get sanctioned by CAF. There should be no escapism under the cloak of, ‘not interfering with countries’ internal affairs’.\nThe welfare of coaches and players is fundamental to the emotional stability of those affected. The idea that Nigeria is a perennial culprit must be addressed holistically. The psychological impact of such administrative inefficiencies cannot be over-emphasised. CAF should wield the big stick if need be.\nThe huge security lapses during the games that saw ball boys withhold opponents’ throw-in balls or grab Keepers’ towels must urgently be seen to be sanctioned as a deterrent to others and in preparation for 2030 World Cup the country would be co-hosting. The attack on other country’s fans in some Moroccan stadia was not a good sight. The alleged Mysterious death of two journalists from Mali and Cameroun must be thoroughly investigated and justice seen to be done.\nRead Also: Sadio Mane: God of football was not with Senegal\nThe reported artificial ticket scarcity to the fans of other teams speaks volumes of the sense of hospitality of the Moroccans. If fans and tourists travelled thousands of kilometres to Morocco and ended up watching the matches of their country’s teams from hotel rooms due to some ticket sale shenanigans, Morocco should be investigated and sanctioned if found culpable. That would be a pre-emptive move towards efficiency in the future.\nDespite the very disappointing actions of both teams, the Senagalese coach during the final game was finally concluded with a Senagalese victory. There has been outrage by football lovers due to the leadership crises that led to the chaos during the final game. The referee, Jean-Jacques Ndala from DRC failed as a lead referee of the match for failing to earn the trust of the players by being, alert, fair and firm. The Senagalese disallowed goal ought to have been verified through the VAR before the decision to disallow the goal. To have dashed to VAR to verify and award a penalty to the Moroccan team was the real beginning of the chaos.\nReferees in Africa must understand that while everyone can concede that they are humans, they are still expected like Ceasar’s wife to be above reproach. They must show leadership and objectivity to earn respect and be truly part of the global game. They must be well trained and their training must manifest in the field of play. CAF must understand the value of refereeing to football as a sport. A lot of emotions come with football and refereeing expertly ought to be the calm amidst the storm.\nThere are reports that the Senagalese coach has been suspended by CAF for ordering his players to leave the pitch during the penalty argument. He did not show leadership. The spirit of the game is sportsmanship and it is achieved through obedience to the laws governing the game. He did not show good leadership at the most trying moment of African football on a global stage. He let his emotion get the better of his judgment. Leadership demands more than he gave at that instance.\nOn the contrary, Sadio Mane, the Senagalese football legend; two-time AFCON winner, Premier League Champion, Champions League champion, FA Cup winner, Carabao Cup winner, Bundesliga champion and a beacon for the game showed what leadership means. He was neither the coach, team captain or even assistant captain but just his integrity earned him the respect of his teammates that he ran to the locker room to tell persuade them to return.\nMane at that moment showed the world that leadership is not about titles, tags or positions. He displayed perseverance, humility, altruism, patriotism and a huge lover of African football. According to him, he refused to leave with his teammates because he had the reputation of the African football on his mind. It was not about emotions, it was not about ego, simply about showing leadership. It is significant that the suspended Senagalese captain, Kalidou Koulibali handed him the cup to lift after he received it from the CAF President. It was very significant, the world applauded the respect. Without the Captain’s band, a Mane has led his country to two AFCON victories and qualifications for two World Cups in a row.\nAs every football lover including Nigerian politicians applaud a Sadio Mane for his integrity, humility and altruism, this period must be one for introspection. Mane does not need a tag to impact the game and lives. He has invested heavily in schools, hospitals, Mosques and football back in his country, impacting lives in ways that is almost making him the symbol of football and philantophy in his nation. Despite his background and all he has achieved, he remains calm, unobtrusive and kind.\nIn a continent with several failed leaders and corrupt political class, Mane emerges as an icon of what leadership ought to be, productive, selfless, compassionate, patriotic and humane. Mane is so humble despite his exploits, he gives so silently and impactfully that only his works speak for him. He is the perfect silent and cheerful giver. Placed side by side most Nigerian politicians, even with his physical size, he towers above many of them who even after using the people’s money to build infrastructure pretend own them and publicize them for accolades and political expediencies.\nMane through his actions on and off the pitch is a great model to the youths not just in Africa but globally. His contributions to the game at both club and national levels can be seen through his many medals from several continents. Leadership is seen through actions not through rhetoric and ego trips seen in most politicians across the world. He has shown that leadership does not imbue anyone with certain qualities. People bring their innate qualities to leadership. Despite his achievements, he remains humble and thinks more about humans and the game.\nThe celebration of Senegal’s AFCON 2025 win across continents is not so much for the mere victory of the team, it is the human family looking beyond football. Their victory is seen as a befitting tribute to Mane and his teammates’ fighting spirit. The cohesion they showed helped them achieve success. He sees himself as an ambassador of a tripartite style; football, Africa and nation/club. Today he speaks to millions without talking. Mane has spoken to global politicians. Here’s hoping his ‘voice’ resonates with generations to come. Congratulations to Senegal.\n- The dialogue continues…",
  "word_count": 1644,
  "scraped_at": "2026-02-14T12:51:32.148083"
}