{
  "article_id": "0aaace64411b",
  "url": "https://www.cam.ac.uk/stories/black-british-voices-report",
  "title": "Black British Voices : the findings",
  "date": "20230928T200000Z",
  "domain": "cam.ac.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Black British Voices\nThe Findings\nThe largest survey to date of the opinions and attitudes of Black people in Britain has revealed a central split on the question of British pride.\nAround half (49%) of Black Britons consider themselves at least somewhat “proud to be British”, while almost half (45%) take little to no pride in Britishness.\nThe research also suggests that racial prejudice and insensitivity in UK workplaces remains entrenched, with a high percentage of respondents (88%) saying they have experienced racial discrimination at work.\nIn fact, almost all (98%) of those surveyed said they have compromised self-expression and identity to fit into the workplace – by adapting speech or hairstyles, for example – with appearance and cultural background cited as factors influencing lack of promotion or development.\nThe research has been conducted by the University of Cambridge’s Department of Sociology in collaboration with The Voice, Britain’s only national newspaper for Black communities, and London-based management consultancy I-Cubed, founded by two Black women.\nOver 10,000 Black Britons from across the UK completed an extensive survey covering a range of social and cultural issues, from media and politics to mental health. Cambridge researchers also conducted dozens of in-depth interviews with a subset of participants.\nEarly interviews for the Black British Voices Project (BBVP) began in 2020, with a survey launching the following year. The findings have now been analysed in full and brought together in a major 104-page report, presented at a House of Commons event.\nThe report reveals that extremely high levels of distrust and discrimination are still felt deeply across Black British communities when it comes to systems such as health, education and criminal justice.\nOn education, 95% of respondents believe the UK’s curriculum neglects Black lives and experiences, while fewer than 2% think educational institutions take racism seriously.\nSome 87% expect to receive substandard levels of healthcare because of their race, while 79% believe the police still use stop and search unfairly against Black people.\n“This report needs to start a conversation into the unequal outcomes that members of Black communities face in Britain,” said Dr Kenny Monrose, lead researcher and Cambridge sociologist.\n“A lot of nonsense is talked about Black communities being hard to reach. They’re not hard to reach, they’re easy to ignore. But if there's 10,000 people speaking, attention needs to be paid. You might not want to agree, but you’ve got to listen to what's being said.”\nThe findings should be a “wake-up call for Britain” argues Lester Holloway, Editor of The Voice. “We have many fourth-generation Black Brits and, as a community, we should be feeling part of this country. Yet the lived experience of racism in every area of life is leading many to not feel British.”\nBritish identity is highly divisive among Black communities. A majority (81%) describe themselves as British (either ‘definitely’ or ‘somewhat’). The question of pride in Britain is split down the middle, with 49% of respondents proud to be British, while an almost equal number (45%) feel the opposite.\nOne participant described his British pride: “I’m born here. I work here. I pay my taxes here. I bought my house here. Why should I not embrace it?” Others identify pride more locally, such as being a Londoner or NHS employee. However, many still see England’s St. George’s Cross flag as a threat.\n“When I see the [St. George’s Cross] hanging out the window, I’m crossing the road. I don’t feel safe,” said one interviewee. “I don’t think they understand that to us it’s a symbol of fear and racism.”\nThe acronym ‘BAME’ (Black, Asian and Minority Ethnic) was considered “unhelpfully homogenising” when classifying Britain’s diverse non-White population, according to the report. Three-quarters (74%) of respondents felt uncomfortable with this label.\nFaith matters more for Black communities than across the British population as a whole, with 84% of participants self-described as religious or spiritual (the 2021 census shows 56% of people in England and Wales identify with a religious faith).\nWhen it comes to sexuality, a high number of respondents (84%) believe that Black LGBTQ+ people experience discrimination from within Black communities, although over half (56%) of BBVP participants say that acceptance of Black LGBTQ+ people has improved compared to a decade ago.\nInterview data suggests there is still a fear of disclosing sexuality for many Black LGBTQ+ people, who worry about prejudice from church and family, as well as rejection from mainstream LGBTQ+ culture.\nAlong with widespread beliefs that UK education ignores Black experiences, and its institutions are unserious about racism, 41% of respondents “definitely” believe discrimination to be the main barrier to academic attainment for young Black people.\nSome interviewees discussed the importance of learning about histories of empire and slavery, while others pointed out the need to increase awareness of science and technology subjects in Black communities. Some 84% of BBVP participants felt that more Black teachers needed to be recruited.\n“I’m disappointed to the point where it makes me slightly emotional… that more has not been done to encourage Black male teachers to go in to secondary schools,” said one interviewee. Another said that having a Black teacher meant “[y]ou don’t have to prove that you’re not a bad student.”\nThe workplace is perhaps where Black Britons most often experience individual racist behaviour as well as more indirect institutional prejudice, according to the report. Just 9% of respondents said they had little to no experience of workplace discrimination.\nInterviewees spoke of a sense of pressure to justify their position, or feeling obliged to be the “go-to person” in matters of race. Equality, Diversity, and Inclusion (EDI) workshops often led to discomfort, with one interviewee saying they are for “White people to talk to other White people about race so they can tick a box…”\n“Just because you’ve got diversity doesn't automatically mean you've got inclusion, and that’s what's missing in these conversations,” said Monrose. BBVP respondents spoke of editing their names to assist pronunciation for co-workers, or altering clothing, hairstyles or speech patterns to “fit in”.\nSome 87% of survey participants said they have little to no trust Britain’s criminal justice system. Many comments focused on police behaviour that was felt to be unacceptable, yet tolerated by UK forces. A third of respondents say more Black officers would improve trust between police and Black communities, but a quarter think it unlikely even this would help much.\nWhen asked about media representation, a huge 90% of respondents feel that advertising has improved over the last decade when it comes to portraying Black culture. However, over 93% also say that both Black men and women are negatively stereotyped by the media, film and television.\nInterviewees talked of frustration with depictions of Black people as “victims rather than survivors”. Some pointed to double standards in media coverage of the personal lives of White and Black footballers. In fact, 63% of respondents felt that racism in sport has increased in recent years.\n“Those taking the knee were booed by fans who then cheered Sterling when he scored a goal,” said one interviewee of an England football match, who described it as “cognitive dissonance”.\nOnly 7% of research participants felt that Black people in Britain receive fair treatment from healthcare professionals. The report highlights recent studies showing Black women were four times more likely than White women to die during childbirth.\nSome 68% of respondents say they or a family member has suffered from mental health problems, and 87% say that Black families do not discuss mental health enough, including generational issues.\n“There’s some mental trauma that must’ve entailed growing up here as a Black man. The stories he tells…” said one interviewee of their father. Another participant described greater compassion shown to White prison inmates with psychiatric conditions than to Black inmates.\nThe report also explores Black people’s attitudes to business and politics in the UK. A huge 95% of participants consider financial literacy “critical” to more secure futures for Black Britons. The report argues that, for some, racial disparities in pay and pensions – combined with class hierarchies – create a “fatalism” about economic fairness.\nThree out of four respondents expressed the view that Black businesses are treated unfairly by investors and financial institutions. Some interviewees argue that gentrification is pushing Black businesses out of their neighbourhoods in major cities.\nOver 90% of all BBVP participants say they want to see more Black Members of Parliament. At a time of pervasive public cynicism about contemporary politics, an optimistic 22% also believe that Black politicians “have the power to address the needs of Black people in Britain”.\nThe Johnson government’s “Commission on Race and Ethnic Disparities” was singled out for criticism by a number of interviewees. “For a man who referred to Black Lives Matter protesters as thugs… were we expecting anything else?” said one participant.\n“We are mindful that historically black communities have been wary of reports conducted on race, as they attempt to limit or invalidate the reality of their lived experiences,” said Dr Monrose.\n“However, the carpet of data captured within this report reliably highlights the chronic level of racial disparities and unequal outcomes that they face on a daily basis.”\nMaya McFarlane, a Cambridge PhD candidate who worked on BBVP as an undergraduate and MPhil student, said she was “immensely proud” to be part of the project.\n“For centuries, sociological thought has been produced about Black people, but rarely has it been produced by us, or for our interests,” said McFarlane.\nDr Maggie Semple, OBE, co-founder of I-Cubed Consultancy, added: “We can no longer overlook the lived realities of Black people in the UK and be non-committal in providing impactful long-term solutions.\n\"This is an opportunity to acknowledge our views and opinions, with the intent of creating a better future for us all.”\nTop image: Getty (credit: Mads Perch)\nBottom image: Getty (credit: Alys Tomlinson)",
  "word_count": 1642,
  "scraped_at": "2026-02-14T12:03:44.717393"
}