{
  "article_id": "0ae40d00b3d3",
  "url": "https://lasvegassun.com/news/2023/dec/22/oregon-state-washington-state-affiliate-with-west/",
  "title": "Oregon State , Washington State affiliate with West Coast Conference for Olympic sports",
  "date": "20231223T083000Z",
  "domain": "lasvegassun.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Oregon State, Washington State affiliate with West Coast Conference for Olympic sports\nFriday, Dec. 22, 2023 | 9:38 p.m.\nSOUTH SAN FRANCISCO, Calif. — Oregon State and Washington State are joining the West Coast Conference as affiliate members for several Olympic sports for two years starting next season.\nThe league announced the additions on Friday. The Beavers and Cougars will compete in 12 conference sports.\nThe two schools will be part of the WCC for men's and women's basketball, women's soccer, volleyball, men's and women's golf, women's cross country and women's rowing.\nOregon State will also participate in WCC men's soccer and softball. Washington State will compete in WCC women's tennis and men's cross country.\nDr. Thayne McCulloh, president of Gonzaga and WCC chairman, said the addition of the two schools “fortifies the strength of the conference across these 12 sports.”\nEarlier this month, Oregon State and Washington State announced a football scheduling agreement with the Mountain West Conference for next season as they try to survive the collapse of the Pac-12, with the other 10 schools all leaving for other leagues next summer. The Beavers and Cougars will play six football games against Mountain West opponents and pay the league $14 million as part of the scheduling agreement.\nWashington State athletic director Pat Chun said the WCC affiliation gives 10 Cougar teams access to “championships as well as high-level competition.”\nOregon State AD Scott Barnes agreed. “This agreement represents an important step in our strategy to preserve options for the future viability of the Pac 12 conference,” he said in a statement.\nOregon State and Washington State will be eligible for WCC's postseason championships and the league's automatic berths to NCAA championships.\nWCC commissioner Stu Jackson said it was unprecedented to have an alliance between a Division I conference like his and Power Five institutions like Oregon State and Washington State. “So that's pretty cool,” he said.\nJackson said both schools are right in the league's geographic footprint so travel won't be an issue. With the dissolution of the Pac-12, Jackson said he knew those remaining school's priorities would be driven by football.\nJackson said the Beavers and Cougars approached the WCC about affiliating just three or four of their sports. “But that discussion over the course of the past couple months morphed into a much larger package of sports that we were amenable to and they were as well,” he said.\nThe two schools will also be part of the WCC's media rights agreements.\nHow Oregon State and Washington State will be added to conference schedules will be announced at a later date, the league said.\nThe WCC consists of nine schools, seven in California, along with Gonzaga in Washington and the University of Portland in Oregon.",
  "word_count": 459,
  "scraped_at": "2026-02-14T14:08:05.092871"
}