{
  "article_id": "0afbdd816db7",
  "url": "https://www.thisdaylive.com/index.php/2023/03/20/live-updates-governorship-assembly-elections-2023/",
  "title": "Live Updates : Governorship / Assembly Elections 2023 – THISDAYLIVE",
  "date": "20230320T054500Z",
  "domain": "thisdaylive.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Latest Headlines\nLive Updates: Governorship/Assembly Elections 2023\nTUESDAY, MARCH 21, 2023\n10:31am\nPDP Rejects Suspension of Enugu Governorship Election Results Collation\nThe Campaign Council of the Enugu State chapter of the Peoples Democratic Party (PDP) has disagreed with the Independent National Electoral Commission (INEC) on its decision to suspend the announcement of the final results and halt the declaration of Dr. Peter Mbah as the winner of the Enugu State governorship contest, stressing that the election management body was overreaching itself, as it could not, by law, suspend the declaration of an already collated result.\nThe PDP equally also said INEC was wrong to present the Abia and Enugu cases as the same.\nThe party stated these at a press conference addressed by the spokesperson of the Enugu State PDP Campaign Council, Barr. Nana Ogbodo, in Enugu on Monday.\nThe PDP said: “Putting the Abia and Enugu situations in one basket clearly shows that the national headquarters of INEC is mixing things up or has not been properly briefed. There is absolutely nothing like outstanding local governments as far as the collation process in Enugu State is concerned.\n“Unlike the situation in Abia State, the results of the entire 17 LGAs of Enugu State, including those of Nkanu East and Nsukka LGAs, have been fully collated by the Returning Officer, Prof Maduebibisi Ofo Iwe, on Sunday the 19th of March. What remains for the INEC is to sum up the returns by the Local Government Returning Officers and declare our candidate, Dr. Mbah the governor-elect.\n“That is why we are saying that INEC is overreaching itself; they have no powers at this stage to suspend the pronouncement or declaration of the winner of the election, which is our candidate.\n“Section 64(8) of the Electoral Act 2022 provides that where collation has been completed as in the present case of Enugu State, the duty of the collation officer, who collated the result is to announce the result and make a declaration. Therefore, having collated the results from Nsukka LGA and Nkanu East LGA, the statutory duty and legal responsibility of the State Returning Officer is simply to announce and declare the results, as INEC cannot, by law, suspend the declaration of result already collated”.\nOn issues relating to accreditation and votes cast in a polling unit and the fate of such votes where they exceed the number of accredited voters in such units, the PDP said such are guided by Section 51(2) of the Act.\n“The position of the law is that a Returning Officer has no power to cancel any results at the stage of collation. The only option open to any person dissatisfied with the process is to resort to Section 130(1) of the Electoral Act, which vests the power to receive and adjudicate petitions complaining of an undue election or undue return in an election in the tribunal or court.\n“As a matter of fact, we are dissatisfied with the result from Nsukka Local Government Area. We are dissatisfied with the results from Udenu, Isi-Uzo, Ezeagu, and more. But is not for us to take the laws into our hands or indulge in self-help. That is why we are ready to go and interrogate those results at the appropriate quarters because we can no longer complain as the collation has been completed.\n“INEC cannot choose the ones you will collate to release the result and the ones you will collate and withhold the result”, the PDP emphasised.\n“We believe that the Returning Officer for Nkanu East Local Government Area has duly complied with the provision of Sections 64(4)(a)&(b) and Section 64(a)&(d) of the Electoral Act 2022.\n”We consequently restate our position that the only option left to INEC acting through the State Returning Officer for the Enugu State Governorship Election under Section 64(8) of the Electoral Act 2022 is to announce the results and make a declaration of the winner of the election.\n“We therefore call on INEC to immediately announce the summation of the 17 local governments it has already collated and declare Dr. Peter Ndubisi Mbah the winner of the March election”, the PDP reiterated.\nThe PDP also expressed worries that the INEC was already overheating the Enugu polity by the needless delay in the pronouncement of the winner of the governorship election.\n“We will continue to caution that INEC should not take the patience of the electorate and people of Enugu for granted. We know what it took us today to rein in their voluminous anger as it relates to the delay in the declaration of Dr. Peter Ndubuisi Mbah as governor-elect and we are calling on the INEC to cease forthwith this foot-dragging and declare our candidate the duly elected candidate in the last election” the PDP stressed.\nThe party also condemned what it described as desperate and hypocritical approach of the Labour Party to the elections.\n“In the instance, our Enugu East senatorial candidate lost his election to return to the Senate to the Labour Party. It was the same process that produced the result that gave Labour Party the victory that also produced the winner of the governorship election in the Nkanu East in the same senatorial zone. But while the Labour Party has accepted the result for the Senate, they are contesting the governorship that the same process produced. This is hypocrisy”, the party concluded.\n7:11am\nPDP’s Kefas Agbu Wins in Taraba\nThe Independent National Electoral Commission (INEC) on Tuesday declared the candidate of the Peoples Democratic Party (PDP), retired Col. Kefas Agbu, as winner of last Saturday’s governorship election in Taraba.\nAgbu polled 257,926 votes to defeat the candidates of the New Nigeria Peoples Party (NNPP) Prof. Sani Yahaya who got 202,278 and Sen. Emmanuel Bwacha of the APC who polled 141,592 votes.\nThe returning officer for Taraba, Prof. Muhammed Abdulaziz, declared the results.\nHe said:”the PDP candidate, having won majority votes and satisfied all requirements of the law is declared winner of the Saturday polls and returned elected”.\nMeanwhile, the governor-elect Agbu has described his victory as a triumph of the people’s will.\nAgbu who said that the battle was a very tough one, noted that in every contest, there was bound to be a winner and a loser.\nHe urged all contestants to get onboard to build a Taraba of the future.\nGov. Darius Ishaku on his part congratulated the governor-elect and said that he was happy to be handing over to another PDP governor. (NAN)\n7:05am\nPDP’s Dauda Lawal Defeats Gov Matawale, Wins Zamfara Guber Poll\nThe Independent National Electoral Commission (INEC) on Tuesday in Gusau, declared Dr Dauda Lawal-Dare of the People’s Democratic Party (PDP) winner of the 2023 Governorship election.\nINEC Returning Officer, Prof. Kassimu Shehu, Deputy Vice-Chancellor, Federal University, Birnin Kebbi, Kebbi State, said Lawal polled 377,726 valid votes from the 14 local government areas.\nShehu said Lawal defeated Gov. Bello Matawalle of the APC and the incumbent Governor of Zamfara who scored 311,976 valid votes.\n“I Prof. Kassimu Shehu of the Federal University Birnin Kebbi, Kebbi State, certify that I am INEC Returning Officer for Zamfara State.\n“That Dr. Lawal Dauda of the PDP, having satisfied the requirements of the law, is declared winner and returned elected,” Shehu declared. (NAN)\n4:05am\nYPP Rejects A’Ibom Guber, House of Assembly Election Results\nOkon Bassey in Uyo\nThe Young Progressives Party (YPP), Akwa Ibom State, has totally condemned and rejected the conduct of the governorship and State House of Assembly in the state, vowing to challenge the results in the court.\nAt a press conference in Ùyo yesterday, the state secretary of YPP, Ambassador Kelvin Umoh alleged massive rigging, intimidation , violence and killing executed by agents of the state government and officials of the Independent National Electoral Commission (INEC) in the conduct of the elections.\n“Not only do we seek redress against the misconduct of the polls; we are also calling for dispassionate action against all perpetrators of evil on that Election Day and for those who killed innocent souls to face justice,” he said.\nUmoh, who said the elections were “not the will of the electorate In Akwa Ibom State” noted that reports from YPP agents, voters and independent observers corraborated by credible intelligence have given evidence that the elections were rigged against the will of electorate.\nThe YPP secretary also alleged that fake security personnel, who dressed in police, military and para-military uniforms, were used against YPP agents and supporters in polling units and registration area centres across the state.\n“The electorate in Akwa Ibom State witnessed a spectacle of well-orchestrated rigging scheme and bloodletting brazenly executed during the gubernatorial/state house of assembly polls by agents of Governor Udom Emmanuel–led administration and officials of INEC in favour of the Peoples Democratic Party (PDP).\n“At the collation and announcement of the gubernatorial election result on Sunday, March 19, 2023 by INEC, we, as a party, did not append our signature on the result sheet because it doesn’t reflect the will of the electorate in Akwa Ibom State.\n“Reports from party agents, voters and independent observers as corraborated by credible intelligence, were categorical that the conduct of the gubernatorial/state house of assembly election was a mere ruse on the intelligence of the electorate who had earnestly desired to use the opportunity to usher in the right leadership in the next dispensation for the State.\n“To pull the wool over the eyes of poll observers and members of the public, the rigging syndicate of the state administration and INEC officials selected a few locations to allow the conduct to run a bit fairly – mainly in most parts of Ikot Ekpene Senatorial District and Uyo Senatorial District while Eket Senatorial District was shambolic, as most of the polling units’ results were pre-written.\n“Worse still, the PDP state administration also deployed hired thugs who were dressed in police, military and para-military uniforms to kill, molest, maim and chase away YPP’s Party Agents and supporters in the Polling units and Registration Area Centres (RACs) across the State.\n“Instances abound like the case in Ibiono Ibom where PDP armed militia killed some of our supporters including Mr Abraham Bassey Ekpenyong at the INEC office. This dastardly act was carried out by a team of police men from Government House, Uyo led by Danjuma Saleh who moved in a convoy of six white Hilux pickup trucks.\n“In Atan Offot, Uyo, a YPP Local Government Agent was beaten mercilessly by thugs, about 15 in number, led by Mr. Ime Uwah, SSA to Governor Udom Emmanuel who personally had a gun with him.\n“Mr Ime Uwah’s gang also went around polling units in Atan Offot to chase away YPP agents and key supporters while carting away electoral materials and results from these units – inflated them and announced in favour of the PDP. This carting away was done even in the presence of foreign observers.\n“Furthermore, three of our supporters were killed at Etim Ekpo and several others in other LGAs across the state. Even at Onna LGA, where Governor Udom Emmanuel hails from, thugs in police and military uniforms led by his Chief protocol officer, Mr Edmond Ufang, intimidated and maimed our supporters freely. In fact, any person identified as a supporter of YPP was decreed as a persona non grata, deserving elimination” YPP State Secretary stated.\n“Aside these ugly scenes, the fact is that fake result sheets as against the originals pre-signed by the REC were used in collating results in most units across the state.\n“We have official reports that the same dastardly acts played out in other areas of the State including but not limited to all LGAs in Eket senatorial district, and some local government areas in the state like Ini, Ukanafun, Oruk Anam, Etim Ekpo, Ika, Abak, Essien Udim, Ikot Ekpene, Itu, Etinan, and Uruan.\n“Also worth mentioning is the massive hijacking of electoral materials in these LGAs by the PDP agents in collusion with INEC staff and security personnel in these areas.\n“For instance, materials in Ini LGA were hijacked to Dr Glory Edet’s house; that of Ika to Barr Utibe Nwoko’s house; that of Ikot Abasi to Engr. Uwem Okoko’s house; Eket to Hon Francis Archibong’s house; Oron to Senator Akon Eyakenyi’s house, etc.\n“On another plank, the state government and the PDP agents were seen brazenly and openly paying people N10,000 to buy their votes. Credible intelligence suggest that the state government and the PDP agents paid about N1.3 million per unit across the 4,353 units in the state, $5,000 to each ward across the 329 wards in the state as part of their voters buying strategy,” he stated.\nThe party called on the Department of State Services (DSS), National Intelligence Agency (NIA), Foreign Missions, International Observers and relevant bodies to stand up against the malfeasance by INEC and the PDP in the March 18 elections in the State.\n4:01am\nOvia West Women Protest Inconclusive Election in Edo\nAdibe Emenyonu in Benin City\nProtest erupted at the Independent National Electoral Commission office in Benin City, when women from Ovia South-west Constituency, protested the declaration of election in the area as inconclusive by the Returning Officer, Prof. Francis Omoruyi.\nThe women during the protest, said they wanted the electoral umpire to declare the APC candidate, Sunday Aghedo as the winner of last Saturday’s state assembly election.\nThe protest was on the heels of call by the chairman of Coalition of Registered Political Parties (CRPP), Dr. Samson Isibor, who alleged irregularities in several voting centres and massive vote-buying by agents allegedly loyal to the Peopels Democratic Party (PDP) led government in parts of Edo South senatorial district, Edo Central and Edo North.\nHe said the coalition would consider legal options to address the situation if the electoral umpire allowed the noticed irregularities unaddressed.\nAt the INEC office, spokesperson of the women, Mrs. Angela Okpame, while commending INEC for the conduct of the said: “We voted for Hon Sunday Aghedo in 2019 he was denied inauguration and so for four years, Ovia South West had no representation and by 2023, God did it again, we voted for him again to return to the house.\nHon Sunday Aghedo won the election, the result has been uploaded only for one man, Professor Omoruyi that wants to rub the name of INEC in the mud, announced that the election was inconclusive.”\nAlso, a petition by counsel to Aghedo, Ogbankwa Douglas said Aghedo won the election based on results declared at the wards by the “Returning Officers at the Ward, with copies of the prescribed Form EC8 Series, with no incidence whatsoever and with the results returned, being in full compliance with the Electoral Act, 2022.”\nAlso the state chairman of the APC, Col David Imuse called on the INEC to prevail on Omoruyi to release the results just as he expressed surprise that the returning officer is from the same Iguobazuwa that the Peoples Democratic Party (PFDP) hails, from receiving the protesters, INEC Head Voter Education and Publicity, Timidi Wariowei said he has listened to their complaints and the petition from Aghedo which he said the Benin office of the INEC would send to its headquarters where a final decision on the matter would be taken.\n4:00am\nEkiti Assembly Poll: Group Commends INEC, Says BVAS Best for Nigeria\nGbenga Sodeinde in Ado-Ekiti\nThe Independent National Electoral Commission (INEC) and the people of Ekiti State have been commended for a\npeaceful and credible election during Saturday election.\nNigerian Human Rights Community (NHRC), a leading human rights coalition that monitored the Saturday poll, specifically commended INEC performance, the public and government in Ekiti State.\nThe NHRC specifically noted that “the peaceful conduct of the election and the non-interference of the various institutions, including the political and security operatives, have left a remarkable milestone worthy of emulation in other states of the federation.”\nThe group commended INEC for the introduction of BVAS, saying it is the hope for Nigerians’ search for elections that meet international standards. NIHRC said it would produce a comprehensive account of the election to be distributed to local and international communities.\nThe group said all through the exercise, there were no killings, no reports of violence, no snatching of ballots papers, and voters were orderly while the political actors conducted themselves with decorum.\nIt said significantly, in many polling stations, based on the counsel of the state governor, preference was given to pregnant women, peoples living with disabilities and the physically challenged,” adding that: “Even though preference for vulnerable people is not a framework in the country, Ekiti has set the pace which should be emulated by others.”\nThe group also said INEC needs to create more polling units to encourage greater participation in future elections, adding that Ekiti State needs at least 500 more polling units. NIHRC said the turnout of voters was also low, and that it was an unimpressive decimal across the country.\nAccording to the group, “It appears while 988, 932 collected their PVCs, they could not exercise their democratic rights for various reasons, including but not limited to lack of cash to aid transportation, denial of access to personal funds stuck in banks and fuel scarcity in some areas,” adding that the shortcomings were not enough to significantly alter the outcome of the election.\n“Despite the challenges of BVAS, the innovation is the best Nigeria has ever seen. It eliminates rigging and manipulations. What INEC needs to do is to improve on service delivery,” it said.\nNIHRC, a coalition of over 100 civil society, in a report signed by Taiwo Adeleye and Fred Ojinika said the election was a true reflection of the free, prior and informed consent of the Ekiti people. The coalition described the Saturday poll in the state as a good reference point for future elections in Nigeria.\nThe group said its officials were impressed by the pre-election peace-building and conflict prevention efforts of the state Governor, Biodun Oyebanji, counseling the people on the pathway to greatness, and asked them to choose a peaceful and orderly election devoid of violence, saying: “It is important for political leaders to demonstrate affection for peace and stability.\n“While this is remarkable for a state that already has a female deputy governor, Speaker and Secretary to the State Government, there is still room for improvement.”\n3:55am\nKatsina PDP Threatens to Sanction Shema, Supporters over Anti-party Activities\nFrancis Sardauna in Katsina\nThe Katsina State Chapter of the Peoples’ Democratic Party (PDP) has threatened to sanction a former governor of the state, Mr. Ibrahim Shehu Shema, and his supporters for alleged anti-party activities.\nThe Chairman of PDP, Mr. Lawal Danbaci, disclosed this yesterday at a press conference in Katsina, where he said that the party would examine and follow its constitution to sanction all those involved in anti-party activities.\nDanbaci said: “We will follow our party’s constitution to sanction whoever is involved in anti-party activities.”\nAlso, the Director General of the state’s PDP Campaign Council, Dr. Mustapha Muhammed Inuwa, accused Shema and his supporters of working against the PDP during the March 18 governorship and House of Assembly’s elections.\nHe explained that virtually all Shema’s foot soldiers defected to the ruling All Progressives Congress (APC), alleging that the PDP leader was waiting for the swearing in of the Governor-elect, Dr. Dikko Umar Radda, to join APC.\nMeanwhile, Shema and his former aides have received Radda and his Deputy, Mr. Faruq Lawal Jobe, on a courtesy call at his residence in Katsina in the wee hours of yesterday.\nRadda and his entourage were received by the PDP leader and his former chief of staff and House of Representatives member-elect for Mashi/Dutsi Federal Constituency, Hon. Salisu Yusuf Majigiri, Mr. Idi Kwado, Bishir Tanimu, Lawal Dankaba, Rabiu Gambo Bakori, among others.\nShema, in his remarks congratulated Radda and his deputy for the victory and assured them that his door is always open for support and advice for the betterment of Katsina State.\nDuring the brief visit, special prayers were offered for the success of the incoming APC’s administration.\n3:50am\nPolice Arrest 26 Electoral Offenders in Benue\nGeorge Okoh in Makurdi\nDespite series of engagements and warnings to members of the public on the dangers of electoral offences, the police in Makurdi, Benue State, have arrested some recalcitrant persons engaged in violence during the last gubernatorial and state Assembly elections last Saturday.\nAccording to the state Police Pubic Relation Officer, (PPRO), CSP Sewuese Anene, 26 suspects were arrested across the state for various offences, including political thuggery, illegal possession of firearms, snatching of ballot boxes and intimidation of voters.\nExhibits recovered from them included three locally made pistols, cutlasses, knives and wraps of substance suspected to be Indian hemp.\nWhile condemning these acts, the state Commissioner of Police, Wales Abass, ordered detailed investigation into these cases, and promised to deal with the suspects in accordance with the laws.\nThe CP enjoined the people of Benue State to go about their normal activities and be assured that the Police Command is committed to the protection of lives and property during and after elections.\nMONDAY, MARCH 20, 2023\n11:12pm\nPDP’s Fubara Wins Rivers Guber Election\nBlessing Ibunge in Port Harcourt\nThe Independent National Electoral Commission (INEC) has declared Mr Siminalayi Fubara of the Peoples Democratic Party (PDP) as the winner of the governorship election in Rivers state.\nProf Akpofure Rim-Rukeh, the State Returning Officer, made the declaration Monday night, after a long wait for the last local government area collation officer to announce his result from Ahoada West.\nFubara polled a total of 302,614 votes from all the 23 LGAs to defeat his closest opponent, Mr Tonye Cole of the All Progressives Congress (APC) who had 95,274 votes, while Senator Magnus Abe of the Social Democratic Party (SDP) scored 46,981 votes.\nAccording to Prof Rim-Rukeh, the PDP gubernatorial candidate satisfied the requirements of the law to be declared winner of the March 18 governorship poll. He also declared that the Labour Party candidate, Mrs Beatrice Itubo scored 22,224 to occupy fourth position, NNPP scored 335 votes.\nProf Rim-Rukeh said the number of registered voters was 3,537,190, total number of accredited voters was 496,852, total number of rejected votes was 10,670, while the total votes cast were 494,604.\nHowever, at the end of the exercise, party agents signed the result sheets as declared.\n10:52pm\nAPC’s Alia Wins Benue Governorship Election\nThe Independent Electoral Commission (INEC) has declared Fr. Hycinth Alia of the All Progressives Congress (APC) as winner of the governorship election in Benue.\nThe INEC Returning Officer, Prof. Farouk Kuta, who is also the Vice Chancellor, Federal University of Technology Minna, announced the result in Makurdi on Monday.\nHe said Alia won the election with 473,933 votes to defeat his closest rival, Titus Uba of the PDP who got 223,913 votes.\nThe returning officer said though election did not hold in Kwande Local Government Area, the difference in votes between Alia and the PDP candidate was 251,020 votes.\nKuta explained that the election in Kwande LGA would not substantially affect the final vote tally even if it was held.\nHe added that he took the decision to announce the result in line with Section 24(2) of the Electoral Act.(NAN)\n10:43pm\nINEC Declares APC’s Uba Sani Winner of Kaduna Guber Election\nBy John Shiklam in Kaduna\nThe Independent National Electoral Commission (INEC) in Kaduna state has declared Senator Uba Sani of the ruling All Progressives Congress (APC) as winner of the governorship election in the state.\nINEC State Collation Officer for Gubernatorial Election (SCOGE), Prof. Lawal Bilbis,\nannounced this at the INEC headquarters in Kaduna on Monday night.\nHe said the APC candidate polled 730,002 votes to defeat his closest opponent, Isah Ashiru of the Peoples Democratic Party (PDP), who garnered 719,196 votes.\n“Senator Uba Sani having scored the highest number of valid votes and met the requirements of the law, is hereby declared the winner and returned elected” Bilbis said.\nHe said the LP recorded 58,283 votes while the NNPP got 21,405.\nEarlier in the day, there were wild jubilations in some parts of Kaduna metropolis following rumours that the PDP won the election.\nAccording to Bilbis, details of the results are as follows:\nNo. of registered voters: 4,335,208.\nNo. of accredited voters- 1,581,662\nAPC- 730,002\nPDP – 719,196\nLP – 58,283\nNNPP 21,405\nTotal valid votes cast: 1,546,747\nInvalid votes: 19,114\nTotal votes cast: 1,565,861\n10:39PM\nGov Zulum Reelected in Borno\nThe Independent Electoral Commission (INEC) has declared Gov. Babagana Zulum of Borno as the winner of Saturday gubernatorial election.\nThe Returning Officer, Prof. Jude Rabo, while announcing the result, said Zulum of All Progressives Congress (APC) pulled 545, 542 votes to defeat his closest rival, Mohammed Jajari of People’s Democratic Party (PDP) who got 82,147 votes.\nThe News Agency of Nigeria (NAN) reports that Zulum was reelected on the platform of APC defeating other 11 contestants in the race.\nNAN also reports that all the 28 House of Assembly seats in Borno were won by APC, with the incumbent Speaker of the assembly, Abdulkarim Lawan ( APC-Guzamala) who is the longest serving speaker winning for the fifth time.(NAN)\n10:23pm\nZamfara PDP Accuses IG of Deploying Special Police Team to Rig Poll\nThe Zamfara State chapter of the Peoples Democratic Party (PDP) has alleged that the Inspector General of Police, Usman Alkali Baba has deployed a team of special forces to aid rigging of the Zamfara governorship election.\nThe Peoples Democratic Party in a statement Monday in Gusau through the Dauda Lawal Media Office accused the Inspector General of allegedly conniving with Governor Bello Matawalle to rig the governorship election in his favor.\nThe Independent National Electoral Commission (INEC) has announced the results of 11 local governments out of 14 local government areas of the state.\n“As it stands, we have won nine local governments while the APC won two local governments. We are waiting for the official announcement of three local government areas: Kauran Namoda, Maradun, and Birnin Magaji”, it said.\nThe party further said: from the announced results by the Independent National Electoral Commission (INEC), it was winning with a wide margin.\nPDP said: “Our major concern is the interference of the Inspector General of Police, Usman Alkali Baba. We raised the alarm on election day that there was no police presence across the state. It was a plot by the Zamfara state commissioner of police to aid the ruling APC in manipulating the process.\n“Our verified sources have confirmed to us that the Inspector General of Police has deployed a team of special forces to Zamfara. They were flown to Sokoto from Abuja. We have learned that they are on their way coming into Zamfara to cause chaos and create tension in the state capital.”\nIt called on INEC Chairman, Professor Mahmoud Yakubu, to call the Zamfara State Resident Electoral Commissioner (REC) to order, adding “We have lost confidence in him.”\n“Zamfara State Resident Electoral Commissioner (REC) is intentionally delaying the process of the announcement of the result, giving the governor room for manipulation.\n“All collated results from 14 local government areas are ready and in the state collation center. We don’t know why they are delaying the process.\n“The president, security agencies, and international observers should pay close attention to the process in Zamfara state,” PDP said.\n6:21pm\nPDP’s Oborevwori Wins Delta Guber Poll\nThe Independent National Electoral Commission (INEC) has declared Chief Sheriff Oborevwori of the Peoples Democratic Party (PDP) as the winner of the March 18 governorship election in Delta.\nThe State INEC Collation Officer, Prof. Onuwari Georgewill, the Vice Chancellor, University of Port Harcourt, made the declaration on Monday in Asaba.\nGeorgewill said that Oborevwori polled a total of 360,234 votes to defeat his closest opponent, Sen. Ovie Omo-Agege of the All Progressive Party (APC) who scored 240,229 votes.\n“Sheriff Oborevwori having satisfied the requirements of the law is hereby declared the winner of the governorship election and returned elected,” he said.\nGeorgewill said that Mr Kennedy Pela of the Labour Party came third with 48,027 votes, while Mr Great Ogboru of All Progressive Grand Alliance (APGA) came fourth with 11,021 votes.\nHe said the number of registered voters was 3,221 687, while the total number of accredited voters was 710,829.\nGeorgewill added that the total number of rejected votes was 15,384 and the total votes cast was 687,121.\nA breakdown of the results on local government basis, as announced by the local government Collation Officers, showed that Oborevwori won in 21 Local Government Areas (LGAs),while Omo-Agege won in four out of the 25 LGAs of the state.\nOborevwori won in Ika North East; Aniocha North; Ndokwa East; Ika South; Patani; Sapele; Aniocha South; Uvwie; Okpe; Bomadi; Ethiope East; Oshimili North; Warri South; and Oshimili South.\nHe also won in Isoko North; Ethiope West; Isoko South; Ukwuani; Ndokwa West; Warri North; Burutu; and Warri South West.\nOmo-Agege won in Udu, Uvwie, Ughelli South and Ughelli North.(NAN)\n6:02pm\nKwarans Voted for Progress, Says Abdulrazaq\nKwara State Governor, AbdulRahman AbdulRazaq, has said the overwhelming victory that the All Progressives Congress (APC) recorded in Saturday’s polls underscored the desire of the citizens to continue along the path of positive progress Kwara has recorded over the past three years.\n“This victory is truly humbling, and we give all glory to God who has made this happen. It speaks to our people’s understanding of our history, their appreciation of the progress made between yesterday and today, and their commitment to a greater tomorrow. It reflects the wishes of Kwarans at home and in diaspora to sustain the gains of the past three and a half years. It means they appreciate our modest efforts to improve the lot of our state.\n“My profound appreciation goes to all the stakeholders for the truly pan-Kwara mandate: young or old, men and women, traditional and religious institutions, civil servants, private sector players, thoughts leaders, political leaders, market men and women, artisans, the media, students, and our young ones who energised our communities with that sweet, creative chant of Maa se lo.\n“For me, the victory is a call to consolidate on and further spread the gains of the past three and a half years and do much more for the people. I pledge to recommit myself to this. Together, we will build a Kwara whose politics will be anchored on giving equitable opportunities to all, expanding the state’s economic base, and delivering dividends of democracy to the citizenry in an atmosphere of peace and respect for the dignity of the human person.\n“I dedicate this election victory to God and to the people of our state — in the north, south, and central. They have shown once again that power resides with the people. Finally, I commend the peaceful conduct of the election, and especially congratulate the security agencies, the electoral umpire, and the political elite for jointly making Kwara polls the most peaceful in Nigeria,” the governor said.\n5:51pm\nAPC’s Umar Bago Wins Niger Guber Election\n* PDP Campaign Spokesman Quits Politics\nBy Laleye Dipo in Minna\nAll Progressives Congress candidate in Saturday’s governorship election in Niger state Alhaji Umar Mohammed Bago has been declared the winner of the contest.\nBago, a member of the House of Representatives polled 469,896 votes to defeat his closest challenger Alhaji Isah Liman Kantigi of the Peoples Democractic who scored 387,476 votes.\nThe Labour Party candidate Mr Joshua Bawa recorded 3,415 votes and the New Nigerian Political Party candidate Alhaji Ibrahim Sokodeke 3378 votes.\nWith his victory announced by the INEC returning officer, Professor Clement Allawa, Deputy Vice Chancellor University of Abuja, Bago will become the 7th Civilian governor of the state after Alhaji Mohammed Awwal Ibrahim, Alhaji Musa Mohammed Inuwa, Engineer Abdullahi Abdul Kure, Dr Muazu Babangida Aliyu and current Governor Abubakar Sani Bello.\nMeanwhile, the Director of Communications of the Isah Liman Kantigi Campaign Organisation Alhaji Mohammed Yahaya Usman on Sunday quit politics.\nYahaya Usman in a statement made available to THISDAY said he took the action for personal reasons.\nThe statement reads: “Either way it goes I have come full circle, I suspend my membership of partisan politics, I am now neutral.\n“I wish to focus on developing businesses with my social life with everyone\n“Those very close to me know about this plan long ago\n“I wish everyone the best in life.”\n5:25pm\nAPC Leads in Kaduna Guber Election, Residents Await Result from 1 LG\n*Govt warns against violence amid growing tension\nBy John Shiklam in Kaduna\nSenator Uba Sani, candidate of the ruling All Progressives Congress (APC) in Kaduna state is leading in the results of Saturday’s governorship election so far declared by the Independent Nation Electoral Commission (INEC) in Kaduna.\nOf the results announced in 22 out of the 23 Local Government Areas in the state, the APC is leading with over 12,000 votes in 10 LGA it won The PDP’s candidate, Isah Asharu, trails behind even though he won in 12 LGAs\nThe APC won in Giwa, Ikara, Kauru, Sabon Gari\nKubau, Zaria, Kaduna North\nKaduna South, Igabi and Birnin Gwari LGAs.\nThe PDP won in 12 LGAs namely; Kaura, Sanga, Kajuru, Jaba, Makarfi, Jama’a, Zangon Kataf, Soba, Chikun, Kagarko, Kachia and Lere.\nResult from the remaining one LGA – Kudan, the home of the PDP candidate was yet to be announced as INEC had adjourned collation and to 6pm.\nMeanwhile, there is growing tension in Kaduna the state as residents anxiously await the outcome of the election.\nThe state government, in a statement on Monday, said security agencies had been put on “high alert”, to crush any attempt to cause trouble.\nThe statement signed by Samuel Aruwan, Commissioner for Internal Security and Home Affairs, said the state government had received intelligence reports indicating plans by some individuals and groups to spread disaffection and instigate violence in Kaduna Metropolis and other major cities in the state.\nAruwan said “security agencies are conducting diligent investigations into these reports,” warning that “individuals and groups found to be behind such activities will be vigorously prosecuted.”\nThere has been growing tension in the state as residents await the outcome of Saturday’s governorship election.\nThe statement reads: “Kaduna State Government hereby informs citizens that security agencies are on high alert to contain threats to law and order throughout the State.\n“This development follows intelligence reports indicating plans by some individuals and groups to spread disaffection and instigate violence in Kaduna Metropolis and other major centres in the State.\n“Security agencies are conducting diligent investigations into these reports. Individuals and groups found to be behind such activities will be vigorously prosecuted.\n“It is important to reiterate that street protests remain strictly prohibited, to prevent any possible breakdown of law and order.\n“Government appeals to citizens to volunteer information on any activity which may pose a threat to public peace, law and order via these help lines: 09034000060, 08170189999”.\n4:20pm\nINEC Declares Otu of APC, C’River Governor-elect\nBassey Inyang in Calabar\nThe governorship candidate of the All Progressives Congress (APC) in Cross River State, Prince Bassey Edet Otu, has been declared winner of the March 18 governorship election in the state.\nThe state Returning Officer for INEC, Prof. Teddy Charles of the Federal University, Otuoke, Bayelsa State, who made the announcement on Monday afternoon at the INEC headquarters in Calabar, said the APC candidate polled 258,619 votes to emerge winner of the election.\nHe said Otu’s closest rival and candidate of the Peoples Democratic Party (PDP), Senator Sandy Onor, polled 179,636 votes.\nHe said the votes recorded by other parties that sponsored candidates and participated in the governorship election are as follows: AA: 405; ADC: 1620; ADP: 902; APP: 340; LP : 5, 957; NRM: 441; PRP: 3,052; SDP: 628; YPP: 333.\nThe returning officer said the number of registered voters in the state stood at 1,766, 466; and total number of accredited voters was 466,294.\nHe said the total valid votes cast was 451, 933, and the number of rejected votes was 8923.\nThe returning officer said the total votes cast in the election was 460,856.\nProf. Charles said the total number of cancelled votes was 44,486, and therefore, less than 78,983, which is the margin of votes between the highest votes cast and the second highest number of votes cast.\nThe returning officer, therefore, declared Otu Bassey Edet of the APC as the winner of the election and governor-elect having satisfied the constitutional and other legal requirements to be so declared.\n3:32pm\nAPC’s Nwifuru Wins Ebonyi Guber Election\nBenjamin Nworie in Abakaliki\nThe Independent National Electoral Commission (INEC) has declared the candidate of the All Progressives Congress (APC), Mr Francis Nwifuru, as the winner of Ebonyi governorship election.\nThe Returning Officer and Vice-Chancellor of University of Nigeria, Nsukka, Prof. Charles Igwe, announced that Nwifure scored 199,131 votes to defeat his closest challenger and candidate of the Peoples Democratic Party (PDP), Mr Ifeanyi Odii, who polled 80,191 votes.\nThe candidate of the All Progressives Grand Alliance (APGA, Prof. Ben Odoh, came a distance third position with 52,189 votes.\nMeanwhile, the declaration of Nwifuru as the winner of the governorship election has resulted in wide jubilation at the capital city, as supporters thronged the streets with musical instruments.\nThe governor-elect and Speaker of Ebonyi State House of Assembly, Nwifuru, dedicated his victory to God.\nHe said that he would strive to meet the needs of Ebonyi people and consolidate on the achievement of the present administration of David Umahi.\n“This is a thoroughly deserved victory for Ebonyi people, for continuity and consolidation on the brilliant works of the present administration. We came on Divine Mandate and together, we shall all work to meet the needs of Ebonyi people, that is why our manifesto is themed ‘The People’s Charter of Needs’.\n“During our campaigns, we laid before you, my dear people, what will be the essence of our administration and I make proud to say that we will not deter in fulfilling our promises to you.\n“I thank very specially, all my fellow candidates from all other political parties, who went on this journey with me fervently in a bid to make the lives of our people better. We brought out the best in one another and I make bold to say, that we are all winners,” Ebonyi governor-elect said.\n2:08pm\nINEC Suspends Collation of Governorship Results in Enugu\nGideon Arinze in Enugu\nThe Independent National Electoral Commission, (INEC) has suspended the collation of results for the governorship election in Enugu State. Mmecmme\nA breakdown of results collated Sunday shows that Peter Mba of the Peoples Democratic Party (PDP) is leading in the race, having won nine out of the 17 local government areas in the state.\nHe is closely followed by the candidate of the Labour Party (LP), Chijioke Edeoga, who won eight of the local governments announced.\nHowever, a winner is yet to be declared after INEC returning officer for the Enugu governorship election, Maduebibisi Ofo Iwe, announced the suspension of the collation of results for Nkanu East and Nsukka Local Governments following an allegation of non-usage of the Bimodal Voter Accreditation System (BVAS), gross irregularities and intimidation of voters.\nIn a statement in its official Twitter account on Monday, the National Commissioner and Chairman of Voter Education Committee of the commission, Festus Okoye, said that the decision to suspend the collation was taken after a review of the election.\n“Reports from Enugu call for a review of the results for the governorship election from the two outstanding local government areas of Nsukka and Nkanu East,” Okoye said in the statement.\n“Consequently, the commission hereby suspends the collation of results in the two outstanding LGs which are yet to be collated. A review will be undertaken immediately before the process is concluded,” he further stated.\nThe commission appealed for the understanding and patience of voters, parties and candidates in the affected state.\nMeanwhile, supporters of the two leading candidates in the governorship race, including Mba of the PDP and Edeoga of the LP have been protesting outside the headquarters of the INEC since Monday morning.\nWhile those of the PDP are calling on the INEC to declare Mba winner of the election, supporters of the LP candidate are alleging irregularities in the polls and insisting that the INEC must look at the results in their BIVAS and follow what the electoral act says.\n1:59pm\nPDP Supporters Protest, Ask INEC to Declare Mba Winner of Enugu Guber Polls\n...As LP supporters insist Electoral Act must be followed\nGideon Arinze in Enugu\nOver 200 supporters of the governorship candidate of the People’s Democratic Party (PDP) in Enugu State, Peter Mba are currently protesting outside the headquarters of the Independent National Electoral Commission, INEC in the state, following the delay in the announcement of their candidate as winner of the polls.\nA breakdown of results collated announced Sunday shows that Mba is leading in the race, having won nine out of the 17 LGs in the state. He is closely followed by candidate of the Labour Party, LP) Chijioke Edeoga who won eight of the LGs announced.\nHowever, a winner is yet to be declared after INEC returning officer for the Enugu governorship election, Maduebibisi Ofo Iwe announced suspension of the collation of results from Nkanu East, Enugu East and Nsukka LGs following an allegation of non-usage of the Bimodal Voter Accreditation System, (BVAS), gross irregularities and intimidation of voters.\nAt the time of this report, the collation of results are yet to resume, after the process was adjourned till this morning to allow for investigation into the allegations of irregularities in some areas.\nSome of the protesters who spoke to newsmen said INEC should declare Mba winner of the election because he won the highest number of votes announced so far.\n“We wonder what is delaying the commission from declaring him the winner,” they said. The Collation Center is not a tribunal. Whoever has grievances can go to court,”.\nContinuing, they said “INEC must be careful, the Resident Electoral Commissioner and the returning officer must also do the needful,”.\n“The people have made their choice,”.\nMeanwhile, supporters of the LP candidate are also protesting over the outcome of the election, insisting that INEC must look at the results in their BIVAS and follow what the electoral act says.\n” Over voting is not allowed, ” they said, referring to the results from Nkanu and Enugu East.\n1:50pm\nINEC Suspends Further Collation of Governorship Election Results in Abia, Enugu\nAdedayo Akinwale in Abuja\nThe Independent National Electoral Commission (INEC) has suspended the further collation of governorship election results in some parts of Abia and Enugu States.\nThe commission, however, assured that a review would be undertaken immediately before the process is concluded.\nINEC National Commissioner and Chairman, Information and Voter Education Committee, Festus Okoye, in a statement issued Monday said the Commission took the decision after its meeting held on Monday to review the conduct of the Governorship and State Assembly elections held last Saturday.\nHe said: “Arising from the meeting, the Commission took the decision to suspend forthwith further collation of the Governorship election results in some parts of Abia and Enugu States.”\nOkoye recalled that the commission’s office in Obingwa Local Government Area was invaded by thugs on Sunday and its officials held hostage in relation to the collation of results from the Local Government Area.\nSimilarly, he said reports from Enugu State call for a review of the results for the governorship election from the two outstanding Local Government Areas of Nsukka and Nkanu East.\nOkoye added: “Consequently, the Commission hereby suspends the collation of results in Obingwa Local Government Area of Abia State and the two outstanding Local Government Areas of Enugu State which are yet to be collated. A review will be undertaken immediately before the process is concluded.”\nThe commission appealed for the understanding and patience of voters, parties and candidates in the affected States.\n1:43pm\nMore Gubernatorial Election Results from Delta\nWith results declared for five more local government areas Monday, only two are outstanding.\nThe Delta State Resident Electoral Commissioner, Rev Monday Udoh, announced yesterday (Sunday) that supplementary election would be held today in certain wards in two local government areas due to the inability of INEC to conduct the exercise in those places owing to logistics challenges.\nThe INEC-declared results, in addition to those for 18 local government areas yesterday, are as follow:\n*Ughelli North LGA\nRegistered voters – 223,083\nAccredited voters – 55,130\nAPC – 34,955\nLP – 1,438\nPDP – 15,198\nValid votes – 53,232\nRejected votes – 1,453\nTotal votes cast – 54,685\n* Isoko South LGA\nRegistered voters – 140,822\nAccredited voters – 38,902\nAPC – 15,954\nLP – 492\nPDP – 19,963\nValid votes – 38,109\nRejected votes – 528\nTotal votes cast – 38,637\n- Ukwuani LGA\nRegistered voters – 89658\nAccredited voters -24,108\nAPC – 7,591\nLP – 791\nPDP – 14,640\nValid votes – 23,596\nRejected votes – 485\nTotal votes cast -24,081\n- Ndokwa West LGA\nRegistered voters – 104,754\nAccredited voters – 27,883\nAPC – 10,252\nLP – 935\nPDP – 15,539\nValid votes – 26,989\nRejected votes – 536\nTotal votes cast – 27,525\n- Warri North LGA\nRegistered voters – 110,363\nAccredited voters – 15,494\nAPC – 4,165\nLP – 205\nPDP – 10,367\nValid votes – 15,139\nRejected votes – 355\nTotal votes cast – 15,494\n1:17pm\nKatsina PDP Rejects Guber Election Result, to Seek Redress in Court\nFrancis Sardauna in Katsina\nThe Peoples Democratic Party (PDP) in Katsina State has rejected the result of the March 18 governorship and state House of Assembly elections in the state.\nThe Director-General of the state PDP campaign council, Dr. Mustapha Muhammed Inuwa, who disclosed this Monday while briefing journalists, said the party will seek redress in court.\nHe said: “We have totally rejected the result of the governorship and state House of Assembly elections in Katsina State, and we will challenge the result in court in order to retrieve our mandate.”\nHe alleged that the processes of the election were marred by irregularities and voter apathy, where intimidation and harassment of voters perceived not to cast their votes in favour of the APC were manhandled.\nInuwa added, however, that no amount of blackmail and intimidation would deter the opposition PDP in the state from reclaiming “its stolen mandate” and restore democracy in the state.\nHe claimed that the state government directed all workers, traditional and religious leaders to do all they could for APC to win the poll or lose their respective positions.\nThe Independent National Electoral Commission (INEC) Sunday night declared Dr. Dikko Umar Radda of the All Progressives Congress (APC) as the winner of the governorship poll in the state.\nAccording to the electoral umpire, the erstwhile director general of SMEDAN polled 859,892 votes to defeat the PDP candidate, Senator Yakubu Lado, who scored 486,620 votes.\nThe Returning Officer, Mu’azu Abubakar-Gusau, while announcing the result, said the New Nigeria People’s Party (NNPP) candidate, Mr. Nura Khalil, got 8,263 votes, Imrana Jaafar Jino of the People’s Redemption Party (PRP) secured 4,226 votes, while Ibrahim Abu-Musawa of the Labour Party (LP) secured 560 votes.\n12:35pm\nPlateau Governorship Election Result as Announced by INEC\n- JOS EAST\nAPC: 11852\nPDP: 9290 - BARKIN LADI\nAPC: 18,568\nPDP: 32,119 - BASSA\nAPC: 25,788\nPDP: 29,135 - LANGTANG SOUTH\nAPC: 12,437\nPDP: 16,104 - KANKE\nAPC: 35,436\nPDP: 6,870 - LANGTANG NORTH\nAPC: 20,756\nPDP: 27,826 - MIKANG\nAPC: 10,691\nPDP: 12,027 - PANKSHIN\nAPC: 28,827\nPDP: 15,957 - SHENDAM\nAPC: 30,815\nPDP: 17,733 - RIYOM\nAPC: 12,657\nPDP: 18,647 - WASE\nAPC: 35,011\nPDP: 26,557 - KANAM\nAPC: 48,710\nPDP: 28,706 - MANGU\nAPC: 25,570\nPDP: 77,279 - BOKKOS\nAPC: 20,779\nPDP: 26,529 - JOS SOUTH\nAPC: 35,403\nPDP: 84,103 - JOS NORTH\nAPC: 83,170\nPDP: 64,690 - .QUAN’PAN\nAPC: 24,900\nPDP: 31,727\nSUMMARY OF FINAL RESULTS ANNOUNCED\nAPC: 481,370\nPDP: 525,299\n12:24pm\nGuber Poll: Security Agencies on High Alert in Kaduna to Contain Threats to Law, Order\nJohn Shiklam in Kaduna\nThe Kaduna State Government has warned that security agencies are “on high alert” to contain threats to law and order across the state.\nThe Commissioner for Internal Security, Samuel Aruwan, said this in a statement on Monday in Kaduna.\nHe said the state government had received intelligence reports indicating plans by some individuals and groups to spread disaffection and instigate violence in Kaduna metropolis and other major centres in the state.\nAruwan said: “Security agencies are conducting diligent investigations into these reports. Individuals and groups found to be behind such activities will be vigorously prosecuted.”\nThere has been growing tension in the state as residents await the outcome of Saturday’s governorship election.\nThe Independent National Electoral Commission (INEC) on Sunday adjourned the collation of the governorship results to Monday by 12 noon after which the winner would be declared.\nSo far, results had been declared in 19 out of the 23 local government areas in the state with Uba Sani, the candidate of the ruling All Progressives Congress (APC) leading Isah Ashiru of the Peoples Democratic Party (PDP) with over 15,000 votes.\nAruwan’s statement read: “Kaduna State Government hereby informs citizens that security agencies are on high alert to contain threats to law and order throughout the state.\n“This development follows intelligence reports indicating plans by some individuals and groups to spread disaffection and instigate violence in Kaduna metropolis and other major centres in the state.\n“Security agencies are conducting diligent investigations into these reports. Individuals and groups found to be behind such activities will be vigorously prosecuted.\n“It is important to reiterate that street protests remain strictly prohibited to prevent any possible breakdown of law and order.\n“Government appeals to citizens to volunteer information on any activity which may pose a threat to public peace, law and order via these help lines: 09034000060, 08170189999.”\n11:38am\nKano Residents Defy Curfew, Celebrate NNPP’s Victory\nKano residents in the metropolis on Monday took to the streets celebrating the victory of the New Nigerian People’s Party (NNPP) candidates at the governorship and state assembly elections in spite of the curfew imposed by the state government.\nThe News Agency of Nigeria (NAN) reported that government imposed dawn-to-dusk curfew to avoid a breakdown of law and order following the tension generated from the collation of results of the governorship and state Assembly elections.\nAbba Yusuf of NNPP defeated his closest rival, the state Deputy Governor, Alhaji Nasiru Gawuna of All Progressives Congress (APC).\nYusuf polled 1,019, 602 votes against Gawuna’s 892,705.\nThe residents chanted victory songs and wielded placards with various inscriptions as they paraded in motorcades on the streets.\nSome of the placards read: “Alhamdulillah Kano is for Kwankwaso” and “Support for Abba Gida-Gida for progress of the state,” among others.\nDisplays by motorcyclists and tricyclists added colour to the celebrations.(NAN)\n11:25am\nGov Mohammed Reelected in BauchiFrom Segun Awofadeji in Bauchi\nThe Independent National Electoral Commission (INEC) has declared Senator Bala Abdukadir Mohammed as winner of March 18 Governorship election in Bauchi State.\nThe Governor won 15 of the 20 local government councils in the state, scoring 525,280 votes.\nHis closest rival, Air Marshall Sadique Abubakar of the All Progressive Congress (APC), scored 432,272 votes while Senator Jika Haliru of the New Nigeria Peoples Party (NNPP) got 60,496 votes to emerge a distant third.\nThe margin between PDP and APC is 93,003 votes.\nGovernor Mohammed (Kauran Bauchi) was declared re-elected by the State Returning Officer and Vice Chancellor, Federal University, Dutse, Professor Abdulaziz Sabo Mohammed on Monday.\nThe incumbent Governor recorded massive victory in 15 out of the 20 local government areas of the state.\nGovernor Mohammed won in Alkaleri, Bogoro Dass, Bauchi,Kirfi, Jama’are,Warji, Itas-Gadau, Dambam, Ganjuwa,Shira, Ningi,Toro, Tafawa Balewa and Zaki in results declared by INEC.\nHis closest competitor, Air Marshall Sadique Abubakar (rtd) of APC won five local government areas namely Giade, Darazo, Misau Katagum and Gamawa.\nBauchi Official Governorship Election Result:\n1) JAMA’ARE LGA\nAPC – 11,865\nPDP – 13,693\nNNPP – 3,253\n2)KIRFI LGA\nAPC – 11,631\nPDP – 13,454\nNNPP – 3,571\n3)BOGORO LGA\nAPC – 10,436\nPDP – 16,589\nNNPP – 3,365\n4)WARJI LGA\nAPC – 11,783\nPDP – 20,416\nNNPP – 1,812\n5)GIADE LGA\nAPC – 18,023\nPDP – 14,145\nNNPP – 1,114\n6)ITAS/GADAU LGA\nAPC – 16,206\nPDP – 18,778\nNNPP – 2,913\n7)GAMAWA LGA\nAPC – 22,565\nPDP – 21,558\nNNPP – 1,841\n8)DAMBAM LGA\nAPC – 11,325\nPDP – 13,307\nNNPP – 4,395\n9)SHIRA LGA\nAPC – 21,644\nPDP – 25,373\nNNPP – 2,536\n10)ZAKI LGA\nAPC – 19,637\nPDP – 26,420\nNNPP – 1,415\n11)GANJUWA LGA\nAPC – 17,606\nPDP – 20,924\nNNPP – 7,387\n12)DASS LGA\nAPC – 11,596\nPDP – 14,471\n13)DARAZO LGA\nAPC – 23,544\nPDP – 19,736\nNNPP – 3359\n14)ALKALERI LGA\nAPC – 15,798\nPDP – 34,387\nNNPP – 2069\n15)NINGI LGA\nAPC – 23,795\nPDP – 29,515\nNNPP – 4,178\n16)TAFAWA BALEWA LGA\nAPC – 22,928\nPDP – 35,100\nNNPP – 3,166\n17)MISAU LGA\nAPC – 26,448\nPDP – 16,351\nNNPP – 1,820\n18)KATAGUM LGA\nAPC – 35,774\nPDP – 25,218\nNNPP – 2,376\n19)TORO LGA\nAPC – 29,848\nPDP – 65,456\nNNPP – 3,634\n20)BAUCHI LGA\nAPC – 69,850\nPDP – 80,390\nNNPP – 5,749\n9:03am\nAbiodun Thanks Ogun Electorate, Says Power Belongs to God\nJames Sowole in Abeokuta\nOgun State governor, Dapo Abiodun, has commended the people of the state for renewing his mandate for another term of four years, just as he remarked that “Power Belongs to God.”\nAbiodun described his victory as heart-warming, and a “further proof that no man can play God or stop what God has ordained”\nThe Governor in a statement by his Chief Press Secretary, Kunle Somorin on Sunday, said though the election was keenly contested, his reelection came to him as a sign of good faith and a vote of confidence in his Administration by the people, assuring that his second term would usher in more goodies of democracy.\nHe said his victory is a further challenge to deliver on the manifesto of the All Progressives Congress (APC), even as he promised that he would continue with the government of inclusiveness that has been the hallmark of his Administration in the last four years.\nWhile commending the people for conducting themselves in a peaceful manner during the polls, the governor equally lauded the Independent National Electoral Commission (INEC), security agencies, the media and other relevant stakeholders for ensuring an atmosphere which enabled peaceful elections.\nAbiodun also thanked the party leaders, stalwarts and members of the APC in the state, who worked assiduously for the party’s victory, assuring them that he would continue to keep the flag of the party flying, by continuing to deliver good governance across the state.\nThe governor called on the opposition and well-meaning individuals in the state to join hands with him in order to move Ogun State to a higher pedestal.\nHe reiterated his Administration’s commitment to principle of equity, fairness and justice, maintaining that his Administration would not be characterized by favouritsm, nepotism and lopsidedness in situating developmental projects in all the four zones and three senatorial districts of the state.\nAccording to Abiodun, in his second term, he “shall ensure the completion of several projects, aimed at improving the standard of living of the people and the economic prosperity of the state from the unparalleled success already recorded”.\nHe promised to be inclusive participatory, transparent, accountable, fair and not develop any part of the state at the expense of the other, the statement concluded.\n8:50am\nBuni’s Re-election Well Deserved Victory, Says Senate President\nThe Senate President, Ahmad Lawan, has congratulated the Governor of Yobe, Mai Mala Buni, on his re-election for a second term of four years.\nThe News Agency of Nigeria (NAN) reported that the Independent National Electoral Commission (INEC) on Sunday declared Buni winner of the Saturday governorship election in Yobe State.\nLawan, in a statement on Monday in Abuja by his Special Adviser on Media, Ola Awoniyi, described the outcome of the poll as a well deserved victory for Buni and the All Progressives Congress (APC).\n“I heartily congratulate my dear friend and brother, the Governor of Yobe, Mai Mala Buni, on his re-election for a second term.\n“I also congratulate our great party, the APC, on the renewal of our mandate to continue delivering progressive governance to our people across Yobe.\n“For our governor and party, this is a well-deserved victory from a keenly contested poll,” he said.\nLawn said the victory, above all, was for the good people of Yobe, who have freely renewed the mandate they gave in 2019.\n“Fellow people of Yobe, you have again made a resounding statement of your full confidence in the leadership of Governor Mai Mala Buni.\n“I can assure you that our governor will in the next four years remain on the same path of good governance for the progress of Yobe and the well-being of our people,” Lawan stated.\nHe assured the governor that the people of Yobe would continue to support his mission to take the state to a greater height.\nNAN reported that Buni won in all the 17 local government areas of the state with a total of 317,113 votes.\nThe candidate of the Peoples Democratic Party (PDP), Alhaji Sharif Abdulahi, came a distant second with a total score of 104,259\nAnnouncing the results, at the Independent National Electoral Commission (INEC) office in Damaturu, the Returning Officer for the gubernatorial election in the state, Prof. Umar Pate, the VC of the Federal University of Kashere, Gombe State, said accredited voters were 459,492.\nHe said out of the number, 444,567 were valid votes. (NAN)\n8:25am\nZamfara PDP Alleges Plot to Manipulate Gov’s LGA Election Result\nZamfara state chapter of the Peoples Democratic Party (PDP) has alleged that the state governor, Bello Mohammed Matawalle, is plotting to manipulate the authentic results of his hometown, Maradun local government.\nAccording to the PDP, the governor has been in touch with top officials of the Independent National Electoral Commission (INEC) in his bid to manipulate the result of the local government in his favor.\nIn a statement Monday in Gusau, the party through the Dauda Lawal Media office, noted that the governor was not willing to accept defeat.\nThe statement read: “Governor Matawalle thinks that it would be that easy for him to manipulate the result of his hometown, Maradun. We have confirmed from verified sources that the governor has been in touch with top INEC officials, forcing them to allocate fake figures in his favor.\n“The Independent National Electoral Commission (INEC) has already uploaded results of 185 polling units out of the total 195 polling units of the local government.\n“Results from eight wards have been completed on the INEC election results portal while awaiting the upload of 10 polling units in two wards.\n“Even if the governor will succeed in forcing the returning officer of the Independent National Electoral Commission (INEC) in the Maradun local government area to allocate illegal figures to him, there is no way they can erase or manipulate the over 90% results uploaded so far on the portal.\n“He requested the INEC officials to add at least 50, 000 votes in his favor before announcing the result of the Maradun local government. The Independent National Electoral Commission (INEC) must exonerate itself from this unholy plot.\n“As part of the clandestine move by the governor, he ordered the unlawful arrest of the PDP chairman of Maradun local government. Our party agents across wards were targeted and arrested.\n“Abdulmutallib Sani and Nura Ibrahim were arrested in Janbako ward; Hamza Usman and Abdulhamid Bala were arrested in Maradun Nortth local government; Sani Umar and Nura Hamisu were arrested in Damaga/Gama Giwa ward; Ibrahim Sulaiman and Saidu Garba were arrested in Dosara/Birnin Kaya ward; Yahaya Yusuf and Sani Moh’d were arrested in Maradun South.\n“Also, Abubakar Jafar and Muhammad Abdulnasir were arrested in Faru Magami ward; Kamilu Lawal and Abdulrahman Tukur were arrested in Gora ward; Mustapha Yusuf and Lawali Kaya were arrested in Kaya ward; while Surajo Dan Galadima and Namadina Muh’d were arrested in Gidan Gogo ward.\n“Our source also confirmed that the governor has left Gusau for Maradun local government this morning, to execute the plan of manipulating the result.\n“We are calling on INEC to discountenance itself from this charade and investigate and punish all its officers who are complicit in this plot. We call on the security operatives to do the same.”\n8:17am\nKano Imposes Dusk-to-dawn Curfew over Poll Results\nThe Kano State Government has imposed a dawn-to-dusk curfew to avoid a breakdown of law and order following tensions generated from the collation of results of the governorship and state Assembly elections.\nThe state Commissioner for Information and Internal Affairs, Malam Muhammad Garba, made the announcement in a statement on Monday.\nHe said the decision was to prevent hoodlums from causing chaos in the already tensed situation.\nThe commissioner called on people in the state to remain indoors as security agents would not spare anyone or group bent on causing trouble.\nNAN reported that the Independent National Electoral Commissiom (INEC) had declared Abba Yusuf of the New Nigeria Peoples Party (NNPP) winner of the Saturday’s governorship election in the state after beating the Deputy Governor, Gawuna at the poll.\nThe results have generated tension in the state, prompting the government’s proactive measure to avert chaos. (NAN)\n8:04am\nINEC Declares NNPP’s Abba Winner of Kano Election\nThe Independent National Electoral Commission (INEC) has declared the candidate of New Nigerian People’s Party (NNPP), Malam Abba Yisuf, as winner of the March 18 governorship election in Kano State.\nAnnouncing the result on Monday in Kano, the state Returning Officer, Prof. Doko Ibrahim, the Vice-Chancellor of the Ahmadu Bello University, Zaria, said Yusuf polled 1,019,602 votes to clinch the seat.\nIbrahim said that Yusuf defeated his closest rival and incumbent Deputy Governor of the state, Malam Yusuf Gawuna, of the All Progressive Congress (APC), who scored 892,705 votes.\nHe said: “That I, Prof. Doko Ibrahim, declared that the election was contested by 18 candidates.\n“Having satisfied the requirements of the law and scored the highest number of votes, Abba Kabiru Yusuf of the NNPP is hereby declared winner and returned elected,” he said. (NAN)\n7:45am\nAbdullahi Sule Wins Nasarawa Governorship Election\nThe Independent National Electoral Commission (INEC) has declared Governor Abdullahi Sule and candidate of the All Progressives Congress (APC) as the winner of the governorship election in Nasarawa State.\nProf Ishaya Tanko, the INEC State Collation Officer and Returning Officer, made the declaration in Lafia Monday at the Nasarawa State Collation Centre.\nThe INEC returning officer said that the APC candidate polled a total of 347,209 votes to defeat his closest opponent, David Ombugadu, the candidate of the Peoples Democratic Party (PDP) who got 283, 016 votes.\nThe returning therefore, said: “Abdullahi Sule of APC, having satisfied the requirements of the law and scored the highest number of votes in the election is hereby declared winner and returned elected.” (NAN)\n7:38am\nINEC Declares NNPP’s Abba Winner of Kano Guber Poll\nThe Independent National Electoral Commission (INEC) has declared the candidate of New Nigerian Peoples Party (NNPP), Malam Abba Yisuf, as winner of the March 18 governorship election in Kano State.\nAnnouncing the result in Kano Monday, the state Returning Officer, Prof. Doko Ibrahim, the Vice-Chancellor of the Ahmadu Bello University, Zaria, said Yusuf polled 1,019,602 votes to clinch the seat.\nIbrahim said that Yusuf defeated his closest rival and incumbent Deputy Governor of the state, Malam Yusuf Gawuna of the All Progressive Congress (APC), who scored 892,705 votes.\nHe said: “That I, Prof. Doko Ibrahim, declared that the election was contested by 18 candidates.\n“Having satisfied the requirements of the law and scored the highest number of votes, Abba Kabiru Yusuf of the NNPP is hereby declared winner and returned elected,” he said. (NAN)\n7:34am\nPDP Wins 7 Assembly Seats Out of 11 in Bayelsa\nThe Independent National Electoral Commissiom (INEC) in Bayelsa State has declared seven Peoples Democratic Party (PDP) candidates as winners out of the 11 constituencies so far announced in the just concluded state House of Assembly elections in the state.\nThe News Agency of Nigeria (NAN) reported that INEC announced 11 out of the 24 seats in the Bayelsa State House of Assembly.\nThe Returning Officer for Nembe Constituency 2, Dr John Chika, declared Douglas Samson of the All Progressives Congress (APC) as the winner of the just concluded poll in the constituency.\nHe said that Samson polled 1,367 votes to defeat his closest rival, Mr West Alalibo of the PDP.\nThe Returning Officer for Nembe Constituency 1, Prof. Okechukwu Okeke, declared George Braah-Okigbanyo of the All Progressives Grand Alliance (APGA) as the winner of the House of Assembly poll.\nHe said Braah-Okigbanyo polled 2,928 votes to defeat his closest rival, Ben Ololo of the PDP.\nThe Returning Officer for Brass Constituency 3, Prof. Apuega Arikawei, declared Abraham Ingobere of the PDP as the winner of the poll.\nHe said Ingobere polled 5,973 votes to defeat his closest rival, Yousuo Oberiakuma of APC.\nAlso, the Returning Officer for Yenagoa Constituency 3, Dr. James Onukwu, declared Teddy Tombara of PDP as winner.\nHe said that Tombara polled 4,206 votes to clinch the seat.\nThe Returning Officer for Sagbama constituency 1, Dr. James Onukwu, declared Godbless Oyinke of the PDP as the winner.\nHe said Oyinke polled 9,633 votes to defeat others.\nThe Returning Officer for Sagbama Constituency 2, Dr. Jeremiah Samuel, declared Bernard Kenebai of the PDP as the winner.\nHe said Kenebai polled 5,780 votes to lead other contestants.\nThe Returning Officer for Yenagoa Constituency 1, Prof. Okechukwu Okeke, declared Amakoromo Waikumo of APGA as the winner.\nHe said Waikumo polled 4,971 votes to defeat his closest rival of the PDP who scored 4,593 votes.\nThe Returning Officer for Ekeremor Constituency 1, Prof. Joy Okeke, declared Porri Tari of PDP as duly elected.\nHe said Tari polled 4,216 votes to defeat his closest rival of the APC, who scored 1,562 votes.\nAlso the Returning Officer for Kolokuma/Opokuma Constituency 1, Dr. Robert Ene, declared Werinipre Pamoh of the PDP as the winner.\nHe said Pamoh polled 7,536 votes to defeat his closest rival of APGA who scored 1,474 votes.\nThe Returning Officer for Kolokuma/Opokuma Constituency 2, Dr. Lasisi Raimi, declared Wisdom Fafi of the PDP as the winner.\nHe said Fafi polled 6,708 votes to defeat his closest rival Mr Isowo Priebi, APC, who scored 3,362 votes.\nThe Returning Officer for Brass Constituency 2, Prof. Hudron Kari, declared Omubo Timinyo of APC as the winner.\nHe said Timinyo polled 3,175 votes ahead of Mr Adigio Inangaebite of PDP, who had 1,342 votes. (NAN)\n7:30am\nINEC Declares Kebbi Guber Election Inconclusive\nThe Independent National Electoral Commissiom (INEC) on Monday declared the gubernatorial election in Kebbi State as “inconclusive”.\nThe News Agency of Nigeria (NAN) reported that the election was keenly contested by the two giant political parties, the All Progressives Congress (APC) and Peoples Democratic Party (PDP).\nThe Collation and Returning Officer of the election, Prof. Yusuf Sa’idu of the Usman Danfodio University, Sokoto, announced the position at the collation centre situated at INEC headquarters in Birnin Kebbi.\nHe said there were cancellations in 20 of the 21 local government areas of Kebbi State cutting across a number of Registration Areas (RAs) in different polling units.\nSa’idu said: “We aggregated the total number of collected PVCs in those polling units and it came to a total of 91,829.\n“And when we checked the results, the two leading political parties in this contest, APC and PDP polled 388,258 and 342,980 votes respectively. When we looked at the difference, it stands at 45,278.”\nHe noted that they had no option than to refer to the electoral laws on page 31 of the Electoral Act 2022, section 51 sub-sections two and three for guidance.\nAccording to him, law reads: “Where the number of votes cast in an election in any polling unit exceeds the number of accredited voters in that polling unit, the presiding officer shall cancel the result of the election in that polling unit.\n“Sub section three of section 51 also states that where the result of an election is cancelled in accordance with sub-section two, there shall be no return for the election until another poll has taken place in the affected polling unit.\n“By virtue of this provisions and the powers vested in me as the collation and returning officer of 2023 gubernatorial election in Kebbi State, I, Prof. Yusuf Sa’idu of the Usman Danfodio University, Sokoto, hereby declare the gubernatorial election in Kebbi State inconclusive.” (NAN)\n5:43 AM\nYou’re Sore Losers, Ogun APC Tells Amosun, PDP\nThe Ogun state chapter of the All Progressives Congress (APC) has described the reported call by the Peoples Democratic Party (PDP) for a rerun of the just concluded gubernatorial election in Ogun state as an indication that the PDP and one of its major promoters, former Governor of Ogun State, Senator Ibikunle Amosun, are “bunch of sore losers”.\nThe APC through its State Publicity Secretary, Tunde Oladunjoye, in a statement released on Sunday in Abeokuta, said such a vile call, coming barely few minutes after the declaration of results by the Independent National Electoral Commission (INEC), and published by an Amosun-founded and funded rag sheet, could only have come from people who knew of their electoral loss, well ahead”.\nThe statement reads further:\n“It is unfortunate that we have to react to this baseless demand purportedly from PDP but intriguingly published by one of Amosun’s lackeys even when major newspapers are yet to report or give details of the governorship election results.\n“The just retired former political gladiators should first go back home and drink water and relax even as they lick their wounds. With their failure at the polls, it is still appearing to them as a dream because it is unbelievable to them that they could lose the election despite the humongous ill-gotten wealth and violence that the grandstanders displayed and deployed.”\nAPC joined the governor, Prince Dapo Abiodun, who was declared winner of the election, ” to thank our people for keeping faith with our party, despite serious and devious financial temptation, we urge our supporters to be, just like our governor, magnanimous in victory, avoid provocation, and report any threat to peace to the nearest police station\n4:22 AM\nPDP Leads in Edo Assembly Poll\nThe Peoples Democratic Party (PDP) won 12 seats out of the 19 constituency seats so far declared in the Edo House of Assembly elections conducted on March 18.\nThere are 24 seats in the Edo House of Assembly.\nResults from five other constituencies – Egor, Etsako I, Etsako II, Oredo East and Ovia Southwest have yet to be announced.\nThe All Progressives Congress (APC) has so far won six seats while Labour Party (LP) won one seat.\nMeanwhile, Mr Marcus Onobun, Speaker of the Edo House of Assembly and candidate of the PDP has won in Esan West, Esan Central and Igueben Federal Constituency in the rescheduled election.\nINEC’s Resident Electoral Commissioner in Edo, Mr Obo Efanga, said: “we had election into Esan Central/Esan West/Igueben Federal Constituency, which we could not conduct along with others on February 25.\n“Of the 24 state assembly seats, declaration have been made in 19 constituencies; we are yet to get information from the five constituencies remaining.’’\nIn the results declared so far, the PDP won in Akoko Edo I, Akoko Edo II, Esan Central, Esan North East II, Esan South East, and Igueben.\nIt also won in Ikpoba-Okha, Orhiomwon II, Ovia North East I, Ovia North East II, Owan West and Uhunmwonde.\nThe APC won in Esan North East I, Esan West, Etsako Central, Etsako East, Orhiomwon I and Owan East; while LP won in Oredo West. (NAN)\n4:12AM\nSanwo-Olu Reelected Governor in Lago\nGovernor Babajide Sanwo-Olu has been declared winner of Saturday’s governorship election in Lagos state. He was declared winner by the INEC returning officer at 01.15am Monday.\nThe Governor won 19 of the 20 local government councils in the state, scoring 762,134 votes.\nHis closest rival Gbadebo Rhodes-Vivour of the Labour Party, scored 312, 329 votes while Olajide Adediran of the PDP got 62,449 votes.\nAPC’s Radda Wins Katsina Governorship Election\n03:58 AM\nThe Independent National Electoral Commission (INEC), has declared Dr Dikko Umar-Radda of the All Progressives Congress (APC) as winner of the March 18 governorship election in Katsina State.\nAnnouncing the result on Sunday in Katsina, the State Returning Officer, Prof. Muazu Abubakar-Gusau, the Vice-Chancellor of the Federal University, Gusau, said Umar-Radda polled 859,892 votes to emerge the state governor-elect.\nHe said that Umar-Radda defeated his closet rival, Sen. Yakubu Lado-Danmarke of the Peoples Democratic Party ( PDP) who scored 486,620 votes.\nAbubakar-Gusau added that the election was contested by candidates from 13 political parties.\nHe said that the number of registered voters in the state was 3,516,719, while the number of accredited voters for the election was 1,399,291.\nHe added that the number of rejected votes was 20,579, while the total valid votes was 1,365,848 and the total votes cast was 1,386,427.\nHe said that the election was cancelled in 88 polling units due to some irregularities like violence and over voting.\n“That I Prof. Muazu Abubakar-Gusau, declared that the election was contested by candidates.\n“Having satisfied the requirements of the law and scored the highest number of votes, Dikko Umar-Radda of the APC is hereby declared winner and returned elected,” he said NAN\nSUNDAY, MARCH 19, 2023\n10:50pm\nAPC’s Aliyu Wins Sokoto Guber Election\nBy Onuminya Innocent In Sokoto\nThe independent National Electoral Commission (INEC) has declared Ahmad Aliyu Sokoto as a Governor elect of Sokoto State.\nAnnouncing the results at INEC collation centre on Sunday night, the returning officer and the Vice Chancellor Federal University Dutsinma Prof Armiyau Hamis said Ahmad Aliyu Sokoto of APC polled 453,661 votes to defeat his closest rival Mallam Saidu Umar of PDP who polled 404632.\nFrom the results, APC govermorship candidate won 17 local government areas out of 23 local government of the state while PDP won in 6 local governments.\nHere are results\nBinji LGA\nAPC: 13,410\nPDP:11,078\nWurno\nAPC: 17,350\nPDP: 13,099\nYabo\nAPC: 14729\nPDP: 12,014\nIsa\nAPC: 13,632\nPDP: 15,117\nGwadabawa\nAPC: 19,036\nPDP; 16,652\nRabbah\nAPC; 12,759\nPDP: 11,120\nTureta\nAPC: 9831\nPDP: 10,045\nBodinga\nAPC: 18986\nPDP: 16,440\nTangaza\nAPC: 16,254\nPDP: 9705\nKware\nAPC: 18,644\nPDP: 18,161\nSilame\nAPC:9983\nPDP:10,885\nDenge-Shuni\nAPC: 22,690\nPDP:18,506\nShagari\nAPC:14,264\nPDP:13,893\nSabon-Birni\nAPC: 26,884\nPDP: 20,680\nIllela\nAPC: 23,484\nPDP: 19,169\nGudu\nAPC: 12,118\nPDP: 10,718\nGada\nAPC:19,969\nPDP:18,434\nGoronyo\nAPC:16,567\nPDP:17,323\nSokoto South\nAPC:37,114\nPDP:33,363\nSokoto North\nAPC:35,333\nPDP; 33,190\nKEBBE\nAPC;14,902\nPDP:14,619\nTambuwal\nAPC 29489\nPDP 32779\nWamakko\nAPC 36233\nPDP 27642\n9:00pm\nKano Guber: NNPP Leads in 13 LGAs, APC in 9\nIbrahim Shuaibu in Kano\nThe Gubernatorial candidate of the New Nigeria Peoples Party (NNPP) in Kano State, Engineer Abba Kabiru Yusuf, is ahead of Dr Nasir Yusuf Gawuna, his rival of the All Progressives Congress (APC) in 13 local government areas out of the 22 so far declared at the state collation center.\nThe APC also won 9 local governments so far declared at the collation center.\nThe local government areas are Rano, Rogo, Wudil, Karaye, kibiya, Minjibir, Gabasawa, Ajingi, Albasu, Gezawa, Garko, Tudunwada and Bunkure.\nAlso, the 9 local government areas won by APC are Shanono, Kunchi, Makoda, Dambatta, Warawa, Kabo, Bagwai, Takai and Tsanyawa.\nBelow are details:\nRANO\nADP – 80\nAPC – 17,090\nNNPP – 18,040\nPDP – 225\nPRP – 10\nROGO\nAPC – 11,112\nADP – 42\nNNPP – 18,559\nPDP – 124\nMAKODA\nAPC – 15,006\nADP – 83\nNNPP – 13,956\nPDP – 101\nKUNCHI\nAPC – 13,215\nADP – 62\nNNPP – 10,674\nPDP – 39\nWUDIL\nAPC – 20,299\nADP – 276\nNNPP – 21,740\nPDP – 118\nKARAYE\nAPC – 14,515\nADP – 63\nNNPP – 15,838\nPDP – 77\nTSANYAWA\nAPC – 18,746\nADP – 78\nNNPP – 16,769\nPDP – 71\nMINJIBIR\nAPC – 16,039\nADP – 148\nNNPP – 17,575\nPDP – 189\nALBASU\nAPC – 16,959\nADP – 55\nNNPP – 19,952\nPDP – 293\nGABASAWA\nAPC – 17,584\nADP – 91\nNNPP – 19,507\nPDP – 1,269\nAJINGI\nAPC – 14,438\nADP – 306\nNNPP – 15,422\nPDP – 103\nKABO\nAPC: 23599\nNNPP: 16963\nPDP: 2118\nLP: 78\nKIBIYA\nAPC: 13260\nNNPP: 17157\nPDP: 52\nLP: 48\nGEZAWA\nAPC: 19961\nNNPP: 22077\nPDP: 277\nLP: 101\nSHANONO\nAPC: 17249\nNNPP: 13650\nPDP: 272\nLP: 58\nDAMBATTA\nAPC: 16995\nNNPP: 9674\nPDP: 1107\nLP: 25\nWARAWA\nAPC: 16296\nNNPP: 14629\nPDP: 201\nLP: 76\nBunkure\nAPC 17156\nNNPP 19277\nGarko\nAPC 8485\nNNPP 15839\nTudunwada\nAPC 24382\nNNPP 27434\nTakai\nAPC 25244\nNNPP 23666\nBagwai\nAPC 21295\nNNPP 17311\n8:54pm\nGov Buni Reelected Yobe Governor\nMichael Olugbode in Damaturu\nYobe State Governor, Hon. Mai Mala Buni of the All Progressives Congress (APC) has been returned re-elected. He was declared winner of the governorship election by the Independent National Electoral Commission (INEC) on Sunday in Damaturu.\nAnnouncing the result, Professor Umar Pate, the returning officer, said Buni of APC scored a total of 317,113 votes to defeat his closest opponent, Alhaji Sheriff Abdullahi of the Peoples Democratic Party (PDP) that polled 104,259 votes.\nGarba Umar of New Nigerian People’s Party (NNPP) polled 14,246 votes to come third.\nThe returning officer after announcing the votes of the candidates, said: “I Professor Umar Pate hereby certify that Mai Mala Buni, having satisfied the requirements of the law and scored the highest number of the votes, is hereby declared winner of the election”.\n8:51pm\nAPC Leads in Sokoto Guber Election\nOnuminya Innocent In Sokoto\nAll Progressives Congress candidate in the Sokoto State Governorship election, Ahmad Aliyu Sokoto, is leading in the results announced for so far.\nAccording to the results declared so far in twenty one local governments area of the state by the Independent National Electoral Commission in the state, the APC candidate is leading is closest rival Peoples Democratic Party candidate, Sa’idu Umar, in 17 LGAs. PDP leads in 3.\nMeanwhile, before the collation was suspended to resume by 8pm later in the evening, only two local governments which includes Wamakko and Tambuwal are expected to complete the process.\nThe breakdown of the scores of the two parties are as follows\nBinji LGA\nAPC: 13,410\nPDP:11,078\nWurno\nAPC: 17,350\nPDP: 13,099\nYabo\nAPC: 14729\nPDP: 12,014\nIsa\nAPC: 13,632\nPDP: 15,117\nGwadabawa\nAPC: 19,036\nPDP; 16,652\nRabbah\nAPC; 12,759\nPDP: 11,120\nTureta\nAPC: 9831\nPDP: 10,045\nBodinga\nAPC: 18986\nPDP: 16,440\nTangaza\nAPC: 16,254\nPDP: 9705\nKware\nAPC: 18,644\nPDP: 18,161\nSilame\nAPC:9983\nPDP:10,885\nDenge-Shuni\nAPC: 22,690\nPDP:18,506\nShagari\nAPC:14,264\nPDP:13,893\nSabon-Birni\nAPC: 26,884\nPDP: 20,680\nIllela\nAPC: 23,484\nPDP: 19,169\nGudu\nAPC: 12,118\nPDP: 10,718\nGada\nAPC:19,969\nPDP:18,434\nGoronyo\nAPC:16,567\nPDP:17,323\nSokoto South\nAPC:37,114\nPDP:33,363\nSokoto North\nAPC:35,333\nPDP; 33,190\nKEBBE\nAPC;14,902\nPDP:14,619\n8:00pm\nAPC Candidate, Dammodi, Wins Jigawa Guber Poll\nIbrahim Shuaibu in Dutse\nThe Independent National Electoral Commission (INEC) has declared Alhaji Umar Namadi Dammodi of the All Progressives Congress (APC) as the winner of the 2023 gubernatorial election in Jigawa State.\nAnnouncing the result Sunday, the INEC Collation Officer in the state and the Vice-Chancellor of Federal University, Birnin Kebbi, Prof. Zayyanu Umar Birnin Kebbi, said Dammodi of the APC having scored the high votes of 618,449 emerged winner and the newly elected governor of Jigawa State.\nHe explained that the total registered voters was 2,351,298, while the total accredited voters stood at 1,073,540, while the total votes cast were 1,052,793 votes.\nThe collation officer said the candidate of APC, Dammodi, scored 618,449 to beat his closest rivals of the Peoples Democratic Party (PDP), Lamido Mustapha Sule, who scored 368,726 votes and Ibrahim Aminu Ringim of the New Nigeria Peoples Party (NNPP) who poolled 37,156 votes.\n“That Namadi Umar Alhaji of All Progressives Congress (APC) having satisfied the requirements of the law and scored the higher votes is hereby declared winner and returned elected,” he said.\n7:45pm\nPDP in Early Lead in Zamfara Governorship Poll\nThe People’s Democratic Party (PDP) governorship candidate in Zamfara State, Dauda Lawal, is in early lead having won the three Local Government Areas declared so far at the collation centre in Gusua.\nIn Anka Local Government Area, PDP polled 17,116 votes against the APC which polled 10,156 votes while in Bukuyum Local Government Area, PDP polled 24,341 votes against APC’s 10,321 votes.\nIn Zurmi Local Government Area, PDP polled 24,328 votes while the APC got 21,027 votes.\nZamfara has 14 local government areas.\nThe collation of results is expected to continue at about 8pm.\n7:32pm\nGov AbdulRazaq, Mutawali of Ilorin Celebrate Victory.\nGov Abdulrahman Abdulrazaq and his brother, the Mutawalli of Ilorin, Dr Alimi AbdulRazaq, celebrating the Kwara governorship election victory Sunday.\nGovernor AbdulRazaq who contested on the platform of APC polled 226,956 votes to emerge as the winner of the election. His closest rival and candidate of the Peoples Democratic Party, (PDP) Shuaibu Yaman Abdullahi got 123,118 votes while Hakeem Lawal of the Social Democratic Party, (SDP) scored 17,321.\n6:55pm\nGov Abiodun Reelected in Ogun\nJames Sowole in Abeokuta\nThe Independent National Electoral Commission (INEC), has declared Governor Dapo Abiodun, candidate of the All Progressives Congress, as the winner of Saturday’s Governorship Elecrion in Ogun State.\nThe results declared by the State Returning Officer for the election, Professor Kayode Adebowale, showed that Abiodun scored 276,298 votes while his closest rival, Hon Ladipupo Adebutu of the Peoples Democratic Party (PDP), scored 262,383 just as the second runner up, Biyi Otegbeye of the African Democratic Congress (ADC), scored 94,754 votes.\nThe results, also showed that Abiodun won in 12 local governments while Adebutu, won in eight local government areas.\nHowever, the PDP has submitted a petition, to the INEC, asking the commission, to order a rerun in some polling units where results, were cancelled due to non functioning of BVAS and violence.\n6:54pm\nGov AbdulRazaq Reelected in Kwara\nHammed Shittu in Ilorin\nIndependent National Electoral Commission (INEC) on Sunday declared Kwara state governor, Alhaji AbdulRahman AbdulRazaq as the winner of the 2023 governorship election in the state.\nGovernor AbdulRazaq who contested on the platform of APC polled 226,956 votes to emerge as the winner of the election and reelected for second term in office.\nHis closest rival and candidate of the Peoples Democratic Party, (PDP) Shuaibu Yaman Abdullahi got 123,118 votes while Hakeem Lawal of the Social Democratic Party, (SDP) scored 17,321.\nThe governor won all the 16 local government areas of the state in the election results declared by the INEC Returning officer for the polls, Professor Isaac Itodo, the\nVice Chancellor, University of Markurdi, Benue state.\nThe INEC had on Saturday night started th3 announcement of the 2023 governorship election results with three local government areas with the governor clearing the three local government areas of Ekiti, Isin and Offa.\nAt the resumed collation of the election results on Sunday morning, which lasted till evening the APC governor also won in additional 13 local government areas.\nSee the full Kwara governorship election results:\n1. Ekiti local government\nNumber of registered voters, 44,016.\nNumber of accredited voters, 11,849\nAPC 6,836\nPDP 4,273\nTotal valid votes, 11,598\nRejected votes, 251\nTotal votes cast, 11,849.\n2. Isin local government\nNumber of registered voters- 42,238\nNumber of accredited voters -9,631\nTotal votes cast -9630\nValid votes -9,438\nRejected votes-192\nTotal votes cast-9,630\nAPC 5,274\nPDP 3,400\n3. Offa Local government area.\nNumber of registered voters -97,945\nAccredited voters -24,115\nTotal number of valid votes 23,531\nRejected votes -584\nOver voting in Essa wards 002 and 006 as such votes in the two PUs were cancelled.\nAPC -14,696\nPDP -6,705\nSDP -1,289\n4. Oke Ero\nTotal 43,944\nAccredited voters -11,942\nAPC -7,758\nPDP -3,768\nValid -11,808\nRejected 134\nTotal votes -11,942\n5. Oyun local government.\nReg voters 61672\nAccredited voters 16533\nAPC -8,991\nPDP -5,465\nSDP 1,068\nValid votes 16170\nRejected 348\nTotal votes 16528\nCancellation at Ijagbo due to over-voting in one PU\n6. Ilorin South local government\nReg voters 161,045\nAccredited 36,741\nAPC -20,148\nPDP -12,096\nSDP -2,356\nValid votes -35,949\nRejected votes -774\nTotal votes cast -36,723\n7. Asa local government\nReg 87923\nAccredited 29,061\nAPC -14,946\nPDP -11,183\nValid votes 27,907\nRejected votes -583\nTotal votes cast 28,490\nCancellation in two PUs due to\nviolent crisis\n8. Irepodun local government\nReg voter 89644\nAccredited 23,160\nAPC -12,860\nPDP – 7,614\nSDP -1,693\nTotal Valid votes -22,733\nRejected votes -427\nTotal votes cast -23,160\n9. Moro local government\nRegistered voters -81,646\nAccredited voters-24,928\nAPC -15,161\nPDP -6,823\nSDP -1992\nTotal Valid votes -24,466\nRejected votes -461\nTotal votes cast -24,927\nCancellation at one polling unit\n10. Patigi local government\nReg voters -68,136\nAccredited voters -21,930\nAPC -13,813\nPDP -6,544\nTotal valid votes -20,976\nRejected votes -748\nTotal votes cast -21,724\nCancellation at two PUs due to over-voting.\n11. Ilorin East local government\nRegistered voters -163,701\nAccredited voters -43,578\nAPC -23,925\nPDP -14,500\nSDP -2,645\nTotal Valid votes -42,170\nRejected votes -1,015\nTotal votes cast -43,185\nCancellation at two wards in two PUs due to over-voting\n12. Ifelodun local government\nRegistered voters -130,778\nAccredited voters -29,500\nAPC -17,599\nPDP -9,085\nSDP -1,559\nTotal Valid votes -29,006\nRejected votes -494\nTotal votes cast -29,500\n13. Kaiama local government area\nRegistered voters 87,871\nAccredited voters 22,440\nAPC -14,431\nPDP -6,297\nTotal Valid votes -21,773\nRejected votes -660\nTotal votes cast -22,433\n14. Edu local government\nRegistered voters: 112160\nAccredited voters: 42991\nAPC -22,458\nPDP -17,378\nTotal Valid votes -41,331\nRejected vote -998\nTotal votes cast-42,329\n15. Baruten local government\nRegistered voters -149,573\nAccredited voters -38,637\nAPC -28,060\nPDP -7,987\nSDP -1492\nTotal Valid votes -37,873\nRejected votes -627\nTotal votes cast -38,500\n16. Ilorin West local government area\nRegistered voters -273,635\nAccredited voters -85,736\nAPC -46,468\nPDP -32,372\nTotal Valid votes -83,758\nRejected vote -1,978\nTotal votes cast -85,736\nCancellation on ground of over- voting in three PUs\n6:40pm\nUpdated Results of Governorship Election in Delta State\n*Ika North-East LGA\nRegistered voters – 131,945\nAccredited voters – 34,807\nAPC – 4,733\nLP – 1,990\nPDP – 26,760\nValid votes – 33,807\nRejected votes – 918\nTotal votes cast – 34,725\n*Aniocha North LGA\nRegistered voters – 89,010\nAccredited voters – 16,846ph\nAPC – 4,386\nLP – 1,883\nPDP – 8,938\nValid votes – 16,316\nRejected votes – 530\nTotal votes cast -16,846\n*Ndokwa East LGA\nRegistered voters – 86,208\nAccredited voters – 20,434\nAPC – 9,044\nLP – 251\nPDP – 10,146\nValid votes – 19,843\nRejected votes – 485\nTotal votes cast – 20,328\n*Ika South LGA\nRegistered voters — 100,599\nAccredited voters – 27,800\nAPC – 6,790\nLP – 4,495\nPDP – 15,283\nValid votes – 27,149\nRejected votes – 651\nTotal votes cast – 27,800\n*Patani LGA\nRegistered voters – 49,385\nAccredited voters – 11,421\nAPC – 4,743\nLP – 85\nPDP – 6,069\nValid votes – 11,183\nRejected votes – 238\nTotal votes cast – 11,421\n*Udu LGA\nRegistered voters – 143,769\nAccredited voters – 26,908\nAPC – 13,154\nLP – 1,886\nPDP – 9,746\nValid votes – 26,141\nRejected votes – 575\nTotal votes cast – 26,716\n*Sapele LGA\nRegistered voters – 145,024\nAccredited voters – 30,983\nAPC – 12,090\nLP – 1,458\nPDP – 15,217\nValid votes – 29,815\nRejected votes – 957\nTotal votes cast – 30,772\n*Aniocha South LGA\nRegistered voters – 100,424\nAccredited voters – 21,149\nAPC – 4,622\nLP – 5,107\nPDP – 10,032\nValid votes – 20,468\nRejected votes – 603\nTotal votes cast – 21,071\n*Uvwie LGA\nRegistered voters – 191,215\nAccredited voters – 31,188\nAPC – 12,389\nLP – 6,340\nPDP – 9,776\nValid votes – 30,263\nRejected votes – 925\nTotal votes cast – 31,188\n*Okpe LGA\nRegistered voters – 117,111\nAccredited voters – 25,724\nAPC – 8,679\nLP – 1,155\nPDP – 14,544\nValid votes – 25,027\nRejected votes – 691\nTotal votes cast – 25,718\n*Bomadi LGA\nRegistered voters – 103,261\nAccredited voters – 17,946\nAPC – 4,728\nLP – 100\nPDP – 12,340\nValid votes – 17,559\nRejected votes – 379\nTotal votes cast – 17,939\n*Ethiope East LGA\nRegistered voters – 115,003\nAccredited voters – 30,466\nAPC – 11,600\nAPGA – 2,214\nLP – 350\nPDP – 13,030\nValid votes – 27,814\nRejected votes – 805\nTotal votes cast – 28,619\n*Warri South LGA\nRegistered voters – 187,140\nAccredited voters – 32,959\nAPC – 11,569\nLP – 3,743\nPDP – 15,299\nValid votes – 31,768\nRejected votes – 982\nTotal votes cast – 32,750\n6:38pm\nZamfara PDP Alleges APC Holding INEC Officials Hostage in Some Collation Centers\nThe Zamfara state chapter of the Peoples Democratic Party (PDP) has accused the state government and ruling All Progressives Congress of threatening INEC officials in some local government areas of the state.\nThe party said that all the results uploaded virtually had shown that PDP won by landslide.\nPDP in a statement issued Sunday in Gusau by the Dauda Lawal Media Office alleged that the state government was not happy with the outcome of the governorship election because it was not in its favor.\nThe Media office raised the alarm that there were serious issues at the moment at Bakura, Kaura Namoda, Shinkafi, Zurmi, and Bungudu.\n“It is clear that our governorship candidate, Dauda Lawal is coasting to victory in more than 80% of results so far uploaded on the INEC portal.\n“The Independent National Electoral Commission has uploaded 2839 polling units out of the 3529 polling units in Zamfara State.\n“But the information coming to us is that the state government is holding officials of the INEC hostage in the Bakura local government area, intending to disrupt and manipulate the remaining 5 polling units out of the 189 polling units yet to be uploaded.\n“In Kauran Namoda, Senator Sahabi Ya’u Kaura (allegedly) ambushed the collation center with thugs and police in his effort to disrupt the collation process. Two people were shot dead by the police accompanying the senator. INEC has uploaded 246 polling units out of 261 polling units of the local government.\n“Our major concern is the Shinkafi local government area where only 4 polling units were uploaded out of the 172 polling units of the local government area. We have learned that the state government is plotting to disrupt and manipulate the collation process in their favor.\n“There is a serious concern in Birnin Magaji and Zurmi local governments. The state government is hellbent to manipulate some of the results, with the help of some compromised INEC staff and some security agents.\n“We frown at the ongoing disruptions of collation of election results and violence across Zamfara as reports from our men and women on the field indicate infliction of violence and assault on PDP agents and representatives.”\n6:17pm\nINEC Releases More Results from Kaduna Governorship Election\nBy John Shiklam\nINEC has announced the result of the Kaduna governorship election in four more LGAs.\nSo far, the PDP has won in eight of the 11 LGAs so far released while the APC won three LGA.\nThe Collation of results from the remaining 12 LGAs will continue at 8:15pm.\nThe results are as follows\nJAMA’A LGA\nRegistered voters,173, 846\nAccredited voters – 490\nAPC- 19,920\nLP 6017\nPDP 28, 963\nTotal valid votes – 55,798\nRejected votes – 574\nTotal votes- 56, 372\nZANGON KATAF LGA\nRegistered, 175,145\nAccredited voters 53, 142\nAPC 11,448\nLP -7377\nNNPP 184\nPdp 33, 185\nTotal valid votes 52, 609\nRejected votes 533\nTotal votes cast 53,142\nKAURU LGA\nRegistered voters – 132,827\nAccredited voters – 58,311\nAPC- 26,915\nLP – 3,461\nNNPP- 455\nPDP – 26,342\nTotal valid votes 57,789\nRejected votes – 493\nTotal votes cast – 58,282\nSOBA LGA\nRegistered voters – 158,086\nAccredited voters – 61,480\nAPC – 27, 235\nLP – 457\nNNPP – 335\nPDP – 30, 874\nTotal valid votes, 59,406\nRejected votes – 981\nTotal votes cast – 60,441\n5:29pm\nAPC in Early Lead in Niger Governorship Poll\nBy Laleye Dipo in Minna\nThe All Progressives Congress APC candidate in Saturday’s Governorship election Alhaji Umar Mohammed Bago may be coasting to victory going by the results so far announced by the Independent National Electoral Commission in Minna\nOf the 11 local government areas result ls collated, Bago is leading his closest opponent Isah Luman Kantigi of the Peoples Democratic Party, PDP.\nBago won in 9 of the 11 local government areas declared while Kantigi is victorious in only 2 LGAs.\nThe NNPP and the Labour Party are trailing in that order.\nThe collated results are as follows:\nTAFA LG\nAPC 12,520\nPDP 12,082\nNNPP 11\nLP 206\nGURARA LG\nAPC 14,520\nPDP 11,506\nLP 176\nNNPP14\nPAIKORO LG\nAPC 21,855\nPDP 15,780\nLP 106\nNNPP 192\nMUNYA LG\nAPC 8,644\nPDP 10,208\nLP 21\nNNPP 13\nBOSSO LG\nAPC 24,794\nPDP 20,251\nLP 211\nSULEJA LG\nAPC 18,261\nPDP 15,551\nLP 1,664\nKATCHA LG\nAPC 17,037\nPDP 16,495\nLP 3\nEDATI LG\nAPC 9,225\nPDP 16,559\nLP\nBIDA LG\nAPC 27,778\nPDP 22,846\nLP 87\nNNPP 687\nCHACHANGA LG\nAPC 34,231\nPDP 27,989\nLP 323\nNNPP 144\nLAPAI LG\nAPC 21,795\nPDP 18,041\nLP 16\nNNPP 18\nMore results are to be collated later in the day.\n5:26pm\nSanwo-Olu Coasting Home to Victory\nSegun James\nThe Independent National Electoral Commission has released the results of the Lagos gubernatorial and House of Assembly poll with Governor Babajide Sanwo-Olu of the All Progressives Congress coasting home to victory.\nSanwo-olu won in all the 18 local government areas so far declared.\nHere is a breakdown of the results\nLAGOS ISLAND\nProf Simeon Oladipo – Collation Officer\nRegistered voters 200848\nAccredited voters – 41626\nAPC – 37760\nLP – 1317\nPDP – 1783\nTotal valid votes – 41234\nRejected votes – 389\nTotal votes cast – 41623\nAPAPA\nProf. James Akanmu – Collation Officer\nRegistered voters – 196950\nAccredited voters – 28867\nAPC – 21007\nLP – 4157\nPDP – 2487\nTotal valid votes – 28322\nRejected votes – 513\nTotal votes cast – 28835\nEPE\nRegistered voters – 160124\nAccredited voters – 35103\nAPC – 29614\nLP – 1515\nPDP – 3272\nTotal valid votes – 34790\nRejected votes – 313\nTotal votes cast – 35103\nAGEGE\nProf. Sunday Adeyemo Collation Officer\nRegistered voters – 365885\nAccredited voters – 48998\nAPC – 35845\nLP – 8486\nPDP – 3176\nTotal valid votes – 48284\nRejected votes – 680\nTotal votes cast – 48964\nAJEROMI IFELODUN\nPRrof J.A. Adewara\nRegistered voters – 394918\nAccredited voters – 64230\nAPC – 39798\nLP – 19821\nPDP – 2607\nTotal valid votes – 63200\nRejected votes – 1037\nTotal votes cast – 64230\nIKEJA\nProf Mohd Olawale – CO\nRegistered voters – 339879\nAccredited voters – 51199\nAPC – 32273\nLP – 15174\nPDP – 1616\nTotal valid votes – 49899\nRejected votes – 686\nTotal votes cast – 50585\nCancellation at 3 units\nCollected PVcs for Ikeja 299, 909\nMUSHIN\nPROF Abimbola Sowemimo – CO\nRegistered voters – 394463\nAccredited voters – 70028\nAPC – 52249\nLP – 11759\nPDP – 4006\nTotal valid votes – 68952\nRejected votes – 959\nTotal votes cast – 69911\n3 cancellations owing to over voting two units and one disruption\nTotal Pvcs collected 364192\nSURULERE\nProf. Owolabi Kuye CO\nRegistered voters – 401846\nAccredited voters – 75798\nAPC – 42451\nLP – 28069\nPDP – 2200\nTotal valid votes – 74001\nRejected votes – 990\nTotal votes cast – 74991\nCancellations at 8 polling units\nTotal PVCs collected in Surulere – 357326\nIBEJU LEKKI\nProf.\nRegistered voters – 134496\nAccredited voters – 27480\nAPC – 19369\nLP – 3785\nPDP – 3189\nTotal valid votes – 26580\nRejected votes – 899\nTotal votes cast – 27479\nCancellation at 2 polling units Lakowe and Abijo due to disruption and burning of BVAS machines and ballot boxes at Lakowe\nCommunity primary school Abijo, ballot papers and boxes burnt.\nTotal PVCs at Ibeju Lekki124149\nIFAKO IJAIYE\nProf Lukman Adams\nRegistered voters – 399938\nAccredited voters – 55322\nAPC – 38682\nLP – 13020\nPDP – 2262\nTotal valid votes – 54783\nRejected votes – 539\nTotal votes cast – 55322\nCancellation at a ward due to over voting\nTotal collected PVCs 321182\nBADAGRY\nProf. Tender Adeoye – CO\nRegistered voters – 227914\nAccredited voters – 53462\nAPC – 41482\nLP – 4863\nPDP – 5472\nTotal valid votes – 52612\nRejected votes – 818\nTotal votes cast – 53430\nLAGOS MAINLAND\nRegistered voters – 253546\nAccredited voters – 39836\nAPC – 26021\nLP – 9999\nPDP – 2362\nTotal valid votes – 39084\nRejected votes – 751\nTotal votes cast – 39835\nCancellation at 3 polling units, Epetedo2 and Owaya 1 due to disruption and snatching of ballot boxes\nTotal PVCs in Lagos Mainland – 215200\nALIMOSHO\nProf. Hamid Sulaiman\nRegistered voters – 850557\nAccredited voters – 132579\nAPC – 83631\nLP – 37136\nPDP – 7872\nTotal valid votes – 130524\nRejected votes – 1892\nTotal votes cast – 132416\nCancellation at two polling units due to disruption and over voting\nTotal PVCs in Alimosho –\nOJO\nProf Sunday Adebusoye CO\nRegistered voters – 329799\nAccredited voters – 58969\nAPC – 30797\nLP – 19027\nPDP – 3889\nTotal valid votes – 54450\nRejected votes – 910\nTotal votes cast – 55360\nCancellation at 43 polling units of 7 wards due to over voting, disruption as a result ballot snatching\nTotal PVCs in Ojo – 273899\nIKORODU\nProf Taiwo Adewunmi CO\nRegistered voters – 388971\nAccredited voters – 84103\nAPC – 64697\nLP – 13207\nPDP – 3797\nTotal valid votes – 82959\nRejected votes – 1130\nTotal votes cast – 84089\nKOSOFE\nProf. Elupeju Akande\nRegistered voters – 481341\nAccredited voters – 84123\nAPC – 49344\nLP – 26123\nPDP – 3537\nTotal valid votes – 81809\nRejected votes – 1460\nTotal votes cast – 83269\nCancellation at at some units in Ikosi Ketu\nOSHODI/ISOLO\nProf. Olujinmi Odunleye\nRegistered voters – 477236\nAccredited voters – 67210\nAPC – 36792\nLP – 24948\nPDP – 2515\nTotal valid votes – 65217\nRejected votes – 1658\nTotal votes cast – 66875\n35 cancellations due to over voting and ballot box snatching\n12009 pvcs collected and 35 Cancellations\nTotal Pvcs in Oshodi/Isolo – 442954\nSHOMOLU\nProf. Abayomi Okanlawon\nRegistered voters – 316752\nAccredited voters – 56397\nAPC – 36783\nLP – 15096\nPDP – 3130\nTotal valid votes – 55, 795\nRejected votes – 608\nTotal votes cast – 56393\nCancellations due to disruptions and snatching of ballot boxes.\n4:41pm\nPDP’s Ashiru in Early Lead in Kaduna\nBy John Shiklam in Kaduna\nThe governorship candidate of the Peoples Democratic Party (PDP) in Kaduna state, Isah Ashiru, has won five of the seven Local Governments so far released by the Independent National Electoral Commission (INEC) in Kaduna.\nThe results announced by the INEC returning officer at the commission’s headquarters in Kaduna, on Sunday, shows that the PDP won in five LGAs while the ruling All Progressives Congress (APC) won two.\nResults in the remaining 16 LGAs were still being awaited .\nThe results released on Sunday by the returning officer of the Independent National Electoral Commission (INEC), Prof. Lawal Bilbis of Usman Danfodio University, Sokoto shows that of the results released in seven Local Government Areas, the PDP won five while the APC won two.\nThe results are as follow.\n1. KAURA LGA\nAPC: 7,748\nLP: 12,950\nNNPP: 618\nPDP: 15,108\n2. GIWA LGA\nAPC: 30,773\nLP: 221\nNNPP: 547\nPDP: 28,869\n3. SANGA LGA\nAPC: 12,338\nLP: 2,135\nNNPP: 457\nPDP: 13,119\n4. KAJURU LGA\nAPC: 8,271\nLP: 1,773\nNNPP:982\nPDP: 23,125\n5. JABA LGA\nAPC:7,564\nLP: 2,871\nNNPP: 174\nPDP: 14,616\n6. MAKARFI LGA\nAPC: 25,670\nLP: 278\nNNPP: 532\nPDP: 26,128\n7. IKARA LGA-\nAPC 29,066\nPDP 28, 612\nLP 692\nNNPP 550\n3:47pm\nBreaking: Gov Makinde Reelected\nKemi Olaitan in Ibadan Oyo State Governor, Seyi Makinde, has been declared the winner of the March 18 governorship election in the state.\nHe was declared the winner by the state Returning Officer and Vice Chancellor, Obafemi Awolowo University (OAU), Ile Ife, Prof. Adebayo BanireHe polled 568,756 votes defeating 15 other candidates\n3:43pm\nHeavy security as tension rises at the Jos North collation centre\n3:36pm\nAbiodun Coasting Home to Victory in Ogun\nJames Sowole in Abeokuta\nGovernor of Ogun State, Prince Dapo Abiodun, is coasting home to victory in the Saturday’s Governorship Election in the Gateway State.\nThe results released by the Independent National Electoral Commission (INEC) Sunday afternoon, showed that Abiodun was leading in 12 local governments while his close challenger, Ladi Adebutu of the Peoples Democratic Party (PDP) was leading in seven states.\nThere are 20 local governments in Ogun State. The result of the Sagamu Local Government has not been declared.\n3:33pm\nAPC Clears 23 Ekiti Assembly Seats, SDP Picks 2, INEC Declares 1 Constituency Poll Inconclusive\nBy Gbenga Sodeinde in Ado Ekiti\nTwenty-three Candidates of All Progressives Congress in the Ekiti state Assembly election have been declared winners in 23 constituencies by Independent National Electoral commission INEC.\nIn a statement by the Ekiti State INEC, Head of voters Education and Publicity, Temitope Akanmu, the Resident Electoral Commissioner Ekiti State, Prof. Ayobami Salami, APC won twenty three seats out of the twenty six seats in the Assembly while Social Democratic Party, SDP won two.\nHowever, THISDAY gathered that Ido/Osi constituency one was declared inconclusive due to the disruption of the exercise by suspected hoodlums.\nConfirming this, INEC said, “The election at Ido Osi State Constituency 1 is inconclusive. This is due to the fact that the margin of lead principle indicated a need for supplementary elections to be held in 3 Polling Units before a clear winner could emerge.\n“This was borne out of violent disruption of the voting process in three polling units of PU 003, PU 012 and PU 014 all in Registration Area (Ward) 01.”\nThe commission added that supplementary election would be conducted in the constituency before a winner could be announced.\nSome of the candidates of the All progressives Congress APC who won their re-election bids include; the Deputy Speaker, Hakeem Jamiu, representing Irepodun/Ifelodun Constituency II, Hon. Barr. Adeoye Aribasoye Ikole II, Hon. Femi Akindele, Irepodun/ifelodun 1, Hon. Femi Akindele, and Princess Teju Okunyiga of Gbonyin constituency.\nHowever, candidates of the Social Democratic Party, SDP, in Ekiti East constituency one, Dele Ogunsakin and that of the Ise/ Orun constituency, Omotayo Babatunde won two seats in the Assembly to defeat their closest APC rivals.\n2:43pm\nThe results of remaining 15 LGs in Oyo State as announced by INEC :\n1) Ona-Ara Local Government\nAccord: 1,212\nAPC: 5,510\nPDP: 17,326\n2) Ibadan Northwest Local Government\nAccord: 1,291\nAPC: 5,947\nPDP: 19007\n3) Ibarapa East Local Government\nAccord: 1,885\nAPC: 7094\nPDP: 11,125\n4) Afijio Local Government\nAccord: 1,357\nAPC: 5,588\nPDP: 13,139\n5) Atiba Local Government\nAccord: 1,113\nAPC: 7,484\nPDP: 18,389\n6) Orire Local Government\nAccord: 1,895\nAPC: 9,216\nPDP: 13,767\n7) Ibadan Southwest Local Government\nA: 2,270\nAPC: 9,491\nPDP: 31,273\n8) Oluyole Local Government\nAccord: 1,386\nAPC: 6,592\nPDP: 21,700\n9) Atisbo Local Government\nAccord: 1,188\nAPC: 6,955\nPDP: 9,199\n10) Saki East Local Government\nAccord: 188\nAPC: 5,519\nPDP: 8,374\n11) Surulere Local Government\nAccord: 271\nAPC: 8,882\nPDP: 15,554\n12) Itewiwaju Local Government\nAccord: 2036\nAPC: 4,597\nPDP: 8034\n13) Ogo Oluwa Local Government\nAccord: 50\nAPC: 5,570\nPDP: 10,930\n14) Irepo Local Government\nAccord: 388\nAPC: 9,785\nPDP: 7,193\n15) Olorunsogo Local Government\nAccord: 998\nAPC: 4,851\nPDP: 5,838\n16) Ibadan Northeast Local Government\nAccord: 1,564\nAPC: 8,486\nPDP: 29,396\n17) Ogbomosho South Local Government\nAccord: 10\nAPC: 8,257\nPDP: 17,693\n18) Ibadan Southeast Local Government\nAccord: 1,846\nAPC: 9,147\nPDP: 23,585\n19) Ibarapa North Local Government\nAccord: 563\nAPC: 5,678\nPDP: 10,845\n20) Ibarapa Central Local Government\nAccord: 1,455\nAPC: 6,287\nPDP: 10,491\n21) Oyo West Local Government\nAccord: 431\nAPC: 7,599\nPDP: 15,084\n22) Oyo East Local Government\nAccord: 571\nAPC: 6,999\nPDP: 15,751\n23) Ogbomosho North Local Government\nAccord: 562\nAPC: 10,661\nPDP: 20,387\n24) Ido Local Government\nAccord: 822\nAPC: 7,865\nPDP: 19,284\n25) Kajola Local Government\nAccord: 1,710\nAPC: 9,523\nPDP: 13,562\n26) Lagelu Local Government\nAccord: 886\nAPC: 10,661\nPDP: 19,104\n27) Ibadan North Local Government\nAccord: 2,120\nAPC: 11,883\nPDP: 39,658\n28) Iseyin Local Government\nAccord: 501\nAPC: 9,694\nPDP: 25,740\n29) Egbeda Local Government\nAccord: 3072\nAPC: 7,377\nPDP: 30,444\n30) Saki West Local Government\nAccord: 607\nAPC: 13,753\nPDP: 17,452\n31) Ore-lope Local Government\nAccord: 1602\nAPC: 7077\nPDP: 6,483\n32) Iwajowa Local Government\nAccord: 269\nAPC: 6,441\nPDP: 9029\n33) Akinyele Local Government\nAccord: 1287\nAPC: 9,445\nPDP: 28,920\n2:23pm\nEnugu Governorship Election Results as Announced by INEC\nEzeagu\nPDP 7576\nLabour Party 5949\nAPC. 963\nAPGA 300\nOji River\nPDP 7365\nLabour Party 7747\nAPC. 1060\nAPGA 1060\nIgboEze North\nPDP 8738\nLabour Party 9955\nAPC 541\nAPGA 250\nIgbo Etiti\nPDP 8959\nLabour Party 11941\nAPC 939\nAPGA 1259\nUdi\nPDP 13633\nLabour Party 10109\nAPC 1648\nAPGA 1734\nAninri\nPDP 6520\nLabour Party 3431\nAPC 906\nAPGA 498\n2:21pm\nAbia Governorship Election Results as Announced by INEC\nUKWA EAST LG\nTotal Registered Voters 39,788; Accredited Voters 7,808\nAPC 560\nAPGA 646\nLP 2,273\nPDP 2,329\nUMUNNEOCHI LG\nAPC 2,034\nAPGA 581\nLP 5,940\nPDP 3,198\nUKWA WEST LG\nRegistered Voters 67,900; Accredited Voters 11,670\nAPC 1,209\nAPGA 830\nLP 2,833\nPDP 4,622\nBENDE LG\nRegistered Voters 105,182 Accredited Voters 22,492\nAPC 2,143\nAPGA 947\nADP 2,733\nLP 9,886\nPDP 3,410\nYPP 1,667\n2:18pm\nMore Governorship Election Results from Delta\nIka South LGA\nRegistered voters – 100,599\nAccredited voters – 27,800\nScores:\nAPC – 6,790\nLP – 4,495\nPDP – 15,283\nValid votes – 27,149\nRejected votes. 651\nTotal votes cast – 27,800\nTotal votes cast\nPatani LGA\nRegistered Voters – 49,385\nAccredited Voters – 11,421\nScores:\nAPC 4,743\nLP – 85\nPDP – 6,069\nValid votes – 19,843\nRejected votes – 238\nTotal votes cast – 11,421\n2:01pm\nLAGOS GOVERNORSHIP ELECTION RESULTS\n1. LAGOS ISLAND\nAPC – 37,760\nLP – 1,317\nPDP – 1,783\n2. APAPA\nAPC – 21,007\nLP – 4,157\nPDP – 2,487\n3. EPE\nAPC – 29,614\nLP – 1,517\nPDP – 3,272\n4. AGEGE\nAPC – 35,845\nLP – 8,486\nPDP – 3,176\n5. IKEJA\nAPC – 32,273\nLP – 15,174\nPDP – 1,616\n6. MUSHIN\nAPC – 52,249\nLP – 11,759\nPDP – 4,006\n7. SURULERE\nAPC – 42,451\nLP – 28,069\nPDP – 2,200\n8. IBEJU LEKKI\nAPC – 19,369\nLP – 3,785\nPDP – 3,189\n9. AJEROMI\nAPC – 39,798\nLP – 19,821\nPDP – 2,607\n10. IFAKO IJAIYE\nAPC – 38,682\nLP – 13,020\nPDP – 2,262\n11. BADAGRY\nAPC – 41,482\nLP – 4,863\nPDP – 5,472\n12. LAGOS MAINLAND\nAPC – 26,021\nLP – 9,999\nPDP – 2,362\n1:32pm\nPDP Wins 25 Osun Assembly Seats, APC Clinches 1\nThe Independent National Electoral Commission (INEC) in Osun State has declared 25 candidates of the Peoples Democratic Party (PDP) as winners out of the 26 seats in the state’s House of Assembly.\nThe commission also declared that the All Progressives Congress (APC) won only Boripe/Boluwaduro state constituency, which is the local government of Mr Gboyega Oyetola, the former governor of the state.\nThe INEC Resident Electoral Commissioner (REC), Dr. Mutiu Agboke, released the results to newsmen on Sunday at the commission’s headquarters in Osogbo.\nAgboke explained why the result of the Boripe/Boluwaduro state constituency could not be announced by the returning officers on Saturday, saying a decision could not be reached on the winner by the Returning Officer at that time.\nHe added that Section 65 of the Electoral Act gives the power of “reviewing” to INEC, adding that: ”It is that power of review that the commission explored in solving the issue.\n”Just like the Returning Officer said, it took us several hours before finding a solution.”\nEarlier, the Returning Officer for Boripe/Boluwaduro state constituency, Dr. Akanmu Alex, had declared Mr Popoola Olufemi of APC as winner of the election.\nAlex of Department of Science Education, University of Ilorin, while announcing the result amidst tight security, said Olufemi scored 15,594, while his closest contender, Aina Adesina of PDP scored 14,817 votes.\nHe said: “Popoola Olufemi of the APC, having satisfied the requirements of the law is declared winner of Boripe/Boluwaduro state constituency at the concluded Osun House of Assembly Election.”\nAlex explained that he could not announce the winner of the election on Saturday because there were two issues that affected the total votes scored by the two leading candidates.\nHe said there was ballot box snatching at a polling unit in Egbeda College Road Unit 16, adding that the results of Ada 2, Unit 5 was in contention.\nAlex said he had to review the situation and incidents within INEC guidelines and consulted widely through the night before he was sure of announcing the result.\nThe News Agency of Nigeria (NAN) reported that the REC had to mobilise additional security officials to the collation centre at Iragbiji town before the result could be announced.\nThe 25 state constituencies won by PDP are: Ifelodun, Ifedayo, Irepodun/Orolu, Odo-Otin, Olorunda, Osogbo, Atakumosa East and West, Ife Central, Ife East, Ife North, Ife South, Ilesa East, Ilesa West, Obokun, Oriade, Ayedaade, Ayedire, Ede North, Ede South, Egbedore, Irewole/Isokan, Iwo, Ola-Oluwa and Ejigbo. (NAN)\n1:23pm\nAbdulRazaq Wins in 12 Out of 16 LGs in Kwara\nHammed Shittu in Ilorin\nKwara State Governor and All Pro-gressives Congress (APC) governorship candidate in Saturday’s election, Alhaji AbdulRahman AbdulRazaq, has been declared winner in 12 out of 16 local government areas of the state so far declared by the Independent National Electoral Commission (INEC).\nAbdulRazaq defeated Alhaji Shuaib Yaman Abdullahi of the Peoples Democratic Party (PDP), the Social Democratic Party (SDP) candidate, Alhaji Hakeem Oladimeji Lawal and the New Nigeria’s Peoples Party (NNPP) candidate, Prof. Shuaib Oba Abdulraheem.\nThe local government councils so far won by the APC gubernatorial candidate are Asa, Ekiti, Offa, Oyun, Irepodun and Isin.\nOthers include Oke-Ero, Ilorin South, Ilorin East, Patigi, Ifelodun and Moro Local Governments of the state.\nThe four local governments’ results yet to be announced are Baruten, Edu, Kaiama, and Ilorin West Local Government Areas.\nThose announced are:\n1. Ekiti local government\nNumber of registered voters, 44,016.\nNumber of accredited voters, 11,849\nAPC 6,836\nPDP 4,273\nTotal valid votes, 11,598\nRejected votes, 251\nTotal votes cast, 11,849.\n2. Isin local government\nNumber of registered voters- 42,238\nNumber of accredited voters -9,631\nTotal votes cast -9630\nValid votes -9,438\nRejected votes-192\nTotal votes cast-9,630\nAPC 5,274\nPDP 3,400\n3. Offa Local government area\nNumber of registered voters 97,945\nAccredited voters 24,115ll\nTotal number of valid votes 23,531\nRejected votes 584\nOver voting in Essa wards 002 and 006 as such two votes were cancelled.\nAPC 14,696\nPDP 6,705\nSDP 1,289\n4. Oke Ero\nTotal 43,944\nAccredited voters -11,942\nAPC -7,758\nPDP -3,768\nValid -11,808\nRejected 134\nTotal votes -11,942\n5. Oyun\nReg voters 61,672\nAccredited voters 16,533\nAPC -8,991\nPDP -5,465\nSDP 1,068\nValid votes 16170\nRejected 348\nTotal votes 16528\nCancellation at Ijagbo due to over-voting in one PU\n6. Ilorin South local government\nReg voters 161,045\nAccredited 36,741\nAPC -20,148\nPDP -12,096\nSDP -2,356\nValid votes -35,949\nRejected votes -774\nTotal votes cast -36,723\n7. Asa local government\nReg 87923\nAccredited 29,061\nAPC -14,946\nPDP -11,183\nValid votes 27,907\nRejected votes -583\nTotal votes cast 28,490\nCancellation in two PUs due to\nviolent crisis\n8. Irepodun local government\nReg voter 89644\nAccredited 23,160\nAPC -12,860\nPDP – 7,614\nSDP -1,693\nTotal Valid votes -22,733\nRejected votes -427\nTotal votes cast -23,160\n9. Moro local government\nRegistered voters -81,646\nAccredited voters-24,928\nAPC -15,161\nPDP -6,823\nSDP -1992\nTotal Valid votes -24,466\nRejected votes -461\nTotal votes cast -24,927\nCancellation at one polling unit\n10. Patigi local government\nReg voters -68,136\nAccredited voters -21,930\nAPC -13,813\nPDP -6,544\nTotal valid votes -20,976\nRejected votes -748\nTotal votes cast -21,724\nCancellation at two PUs due to over-voting.\n11. Ilorin East local government\nRegistered voters -163,701\nAccredited voters -43,578\nAPC -23,925\nPDP -14,500\nSDP -2,645\nTotal Valid votes -42,170\nRejected votes -1,015\nTotal votes cast -43,185\nCancellation at two wards in two PUs due to over-voting\n12. Ifelodun local government\nRegistered voters -130,778\nAccredited voters -29,500\nAPC -17,599\nPDP -9,085\nSDP -1,559\nTotal Valid votes -29,006\nRejected votes -494\nTotal votes cast -29,500\n01:09pm\nGovernorship Election Results in Katsina State as Announced by INEC\n1.MUSAWA LGA\nRegistered voters : 84,131\nAccredited Voters: 35, 979\nAPC: 24,632\nPDP: 10,118\nNNPP: 580\nPRP: 16\n2.SANDAMU LGA\nRegistered voters: 74,399\nAccredited Voters: 31,877\nAPC: 21,055\nPDP: 10,641\nNNPP: 01\nPRP: 03\n3.BAURE LGA\nRegistered Voters: 11,3640\nAccredited Voters: 52,678\nAPC: 32,802\nPDP: 17,888\nNNPP: 62\nPRP: 12\n4.DUTSI LGA\nRegistered Voters: 64,743\nAccredited Voters: 24,298\nAPC: 15,631\nPDP: 8,419\nNNPP:10\nPRP: 10\n- DANDUME LGA\nRegistered Voters: 97,406\nAccredited Voters: 41,071\nAPC: 23,710\nPDP: 14,792\nNNPP: 220\nPRP: 146 - BATAGARAWA LGA\nRegistered Voters: 100,069\nAccredited Voters: 41,301\nAPC: 26,326\nPDP: 13,510\nNNPP: 212\nPRP: 81 - INGAWA LGA\nRegistered voters: 85,957\nAccredited voters: 36,034\nAPC: 22,080\nPDP: 12,255\nNNPP: 209\nPRP: 217 - BINDAWA LGA\nRegistered voters: 88,793\nAccredited voters: 42,922\nAPC: 28,997\nPDP: 12,165\nNNPP: 957\nPRP: 47 - KAITA LGA\nRegistered voters: 76,526\nAccredited voters: 35,568\nAPC: 24,121\nPDP: 9,824\nNNPP: 53\nPRP: 20\n10 MAI’ADUA LGA\nRegistered voters: 88,617\nAccredited voters: 407,68\nAPC: 28,436\nPDP: 11,506\nNNPP: 68\nPRP: 10\n11 ZANGO LGA\nRegistered voters: 73,235\nAccredited voters: 30,659\nAPC: 19,757\nPDP: 10,477\nNNPP: 04\nPRP: 14\n- RIMI LGA\nRegistered voters: 95,642\nAccredited voters: 43,188\nAPC: 28,202\nPDP: 13,823\nNNPP: 397\nPRP: 37 - KUSADA LGA\nRegistered voters: 61,313\nAccredited voters: 25,602\nAPC: 13,750\nPDP: 11,151\nNNPP: 05\nPRP: 17\n14 MANI LGA\nRegistered voters: 114, 440\nAccredited voters: 47,718\nAPC: 29,678\nPDP: 16,180\nNNPP: 231\nPRP: 28\n15: SAFANA LGA\nRegistered voters: 83,882\nAccredited voters: 26,879\nAPC: 15,417\nPDP: 10,460\nNNPP: 09\nPRP: 53\n16. FUNTUA LGA\nRegistered voters: 147,391\nAccredited voters: 53,353\nAPC: 31,924\nPDP: 19,849\nNNPP: 314\nPRP: 218\n17. DAURA LGA\nRegistered voters: 97,136\nAccredited voters: 38,186\nAPC: 26,548\nPDP: 10,689\nNNPP: 78\nPRP: 27\n18. MASHI LGA\nRegistered voters: 100,191\nAccredited voters: 38,756\nAPC: 28,793\nPDP: 8,896\nNNPP: 74\nPRP:11\n19. BATSARI LGA\nRegistered voters: 106,951\nAccredited voters: 31,535\nAPC: 20,053\nPDP: 10,247\nNNPP: 239\nPRP: 158\n20. JIBIA LGA\nRegistered voters: 98,311\nAccredited voters: 35,844\nAPC: 21,216\nPDP: 13,259\nNNPP: 22\nPRP: 34\n21. KANKIA LGA\nRegistered voters: 78,224\nAccredited voters: 35,156\nAPC: 18,249\nPDP: 14,830\nNNPP: 16\nPRP: 22\n22. CHARANCHI LGA\nRegistered voters: 73,766\nAccredited voters: 30,695\nAPC: 20,782\nPDP: 7,539\nNNPP: 66\nPRP: 11\n12:54pm\nMore Governorship Election Results in Ogun State as Declared by INEC\n1. ODEDA LGA\nRegistered voters: 94,048\nAccredited Voters: 23,975\nAPC: 11,089\nPDP: 8,050\nNNPP: 31\nADC: 3,651\nTotal valid votes: 23,349\nRejected votes: 626\nTotal votes cast: 23,975\n2. EGBADO NORTH LGA\nRegistered voters: 130,063\nAccredited Voters: 41,016\nAPC: 15,331\nPDP: 11,627\nNNPP: 64\nADC: 12,190\nTotal valid votes: 39,908\nRejected votes: 1,031\nTotal votes cast: 41,011\n3. EGBADO SOUTH LG\nRegistered voters: 133,001\nAccredited Voters: 34,213\nAPC: 15,047\nPDP: 10,913\nNNPP: 75\nADC: 6,435\nTotal valid votes: 33,064\nRejected votes: 1,149\nTotal votes cast: 34,213\n4. EWEKORO LG\nRegistered voters: 94,681\nAccredited Voters: 20,415\nAPC: 8,192\nPDP: 7,449\nNNPP: 60\nADC: 3,881\nTotal valid votes: 19,902\nRejected votes: 511\nTotal votes cast: 20,413\n5. ABEOKUTA SOUTH LG\nRegistered voters: 242,151\nAccredited Voters: 55,718\nAPC: 19,689\nPDP: 24,175\nNNPP: 99\nADC: 9,264\nTotal valid votes: 54,139\nRejected votes: 1,579\nTotal votes cast: 55,718\n6. IJEBU NORTH LG\nRegistered voters: 133,122\nAccredited Voters: 38,340\nAPC: 18,815\nPDP: 15,904\nNNPP: 22\nADC: 2,393\nTotal valid votes: 37,478\nRejected votes: 848\nTotal votes cast: 38,326\n7. IKENNE LG\nRegistered voters: 68,613\nAccredited Voters: 23,564\nAPC: 9,125\nPDP: 12,472\nNNPP: 09\nADC: 336\nTotal valid votes: 22,069\nRejected votes: 392\nTotal votes cast: 22,461\n10 polling units were cancelled due to violence and disruption of elections.\n8. IJEBU NORTH-EAST LG\nRegistered voters: 52,457\nAccredited Voters: 14,687\nAPC: 5,408\nPDP: 7,086\nNNPP: 27\nADC: 1,448\nTotal valid votes: 14,102\nRejected votes: 357\nTotal votes cast: 14,459\nBallot paper snatching at ward 6, unit 2. The result was cancelled.\n9. IJEBU-ODE LG\nRegistered voters: 90,760\nAccredited Voters: 25,730\nAPC: 12,907\nPDP: 10,714\nNNPP: 36\nADC: 1,348\nTotal valid votes: 25,257\nRejected votes: 473\nTotal votes cast: 25,730\n10. ABEOKUTA NORTH\nRegistered voters: 167,753\nAccredited Voters: 37,553\nAPC: 14,294\nPDP: 12,622\nNNPP: 34\nADC: 9,143\nTotal valid votes: 36,521\nRejected votes: 1,018\nTotal votes cast: 37,539\nThree units in Ward 6 were cancelled due violence.11. IJEBU EAST LG\nRegistered voters: 77,171Accredited Voters: 21,896\nAPC: 77,17PDP: 11,242NNPP: 45ADC: 18,885\nTotal valid votes: 21,352Rejected votes: 542Total votes cast: 21,894\nThere was cancellation in unit 6, ward 9 due to violence.\n12. REMO NORTH LG\nRegistered voters: 48,886Accredited Voters: 13,187\nAPC: 4,306PDP: 8,177NNPP: 06ADC: 327\nTotal valid votes: 129,39Rejected votes: 248Total votes cast: 13,187\nCancellation in four wards in seven polling units due BVAS malfunction and violence.\n13. IPOKIA LG\nRegistered voters: 136,281Accredited Voters: 45,035\nAPC: 21,338PDP: 19,189NNPP: 46ADC: 1,897\nTotal valid votes: 43,707Rejected votes: 1,328Total votes cast: 45035\n14. ODOGBOLU LG\nRegistered voters: 95,530Accredited Voters: 24,041\nAPC: 9,143PDP: 12,963NNPP: 10ADC: 1,281\nTotal valid votes: 23,608Rejected votes: 429Total votes cast: 24,037\nThere cancellations in 14 polling units due violence and refusal to use BVAS.\n15. OGUN WATERSIDE LG\nRegistered voters: 52,359Accredited Voters: 17,345\nAPC: 5,878PDP: 7,716NNPP: 56ADC: 2,575\nTotal valid votes: 16,888Rejected votes: 456Total votes cast: 17,344\nCancellation in two wards due to violence and destruction of sensitive, non materials and difficult terrain due to hyacinth.\n16. IMEKO AFON\nADC: 6,124\nAPC: 9,591\nPDP : 6,981\n17 ADO-ODO/OTA\nADC: 12,174\nAPC: 39,006\nPDP : 31,022\n18. OBAFEMI OWODE\nADC: 5,105\nAPC: 15,466\nPDP: 11,004\n12:49pm\nBlessing Ibunge in Port Harcourt\nPeoples Democratic Party has won the seven local government areas announced so far by the Independent National Electoral Commission in Saturday’s governorship election in Rivers State.\nThe seven local government areas won by the party include Ikwerre, where All Progressives Congress chieftain and former Minister of Transportation, Chibuike Amaechi, hails from.\nSee details:\nOgu/Bolo LGA\nPDP 7103\nAPC 1524\nSDP 310\nAccord 121\nOpobo/Nkoro LGA\nPDP 11538\nAPC 1426\nSDP 159\nLP 10\nTai LGA\nPDP 9276\nSDP 508\nAPC 295\nLP 13\nGokana LGA\nPDP 17455\nSDP 13840\nAPC 7410\nLP 97\nEleme LGA\nPDP 8414\nAPC 2662\nSDP 2251\nLP 544\nIkwerre LGA\nPDP 13716\nAPC 7503\nSDP 1447\nLP 895\nOyigbo LGA\nPDP 9886\nAPC 2793\nLP 2793\nSDP 796\n12:37pm\nAPC Wins 22 Out of 26 House of Assembly Seats in Ondo\nFidelis David in Akure\nThe All Progressives Congress (APC) has won majority seats in the Ondo State House of Assembly election held on Saturday.\nIn the results declared by the Independent National Electoral Commission (INEC) in the state, the APC won 22 seats out of the 26 constituencies across the 18 council areas of the state, while the opposition Peoples Democratic Party (PDP) won the remaining four seats.\nOndo is one of the eight states where governorship election did not hold on Saturday because the incumbent Governor, Mr Oluwarotimi Akeredolu (SAN), will complete his second term in office in 2024.\nThe results declared showed clearly that Saturday’s election was a two-horse race and a straight battle between APC and PDP across the 3,933 polling units and 203 political wards across the council areas of the state.\nThe APC won 22 and lost two seats in Akoko Akoko Southwest, one seat in Akoko Northwest, and one seat in Akure South LGA.\nIn the same vein, four out of eight serving members of the state Assembly who sought reelection suffered defeat in the election.\nThey include Tomide Akinribido (Ondo West 1 PDP); Favour Tomomewo (Ilaje 2, ADC); Hon. Taofeeq Muhammed (Akoko Northwest 2, APC) and Toluwani Borokini (Akure South1, APC).\nHowever, four other incumbent lawmakers were reelected. They include Oluwole Emmanuel Ogunmolasuyi (Owo 1 APC/Majority Leader); Oladiji Olamide (Ondo east APC); Ololade Gbegudu (Okitipupa 11, APC); and Abayomi Akinruntan (Ilaje 1, APC) who is returning for the third term.\nThree female lawmakers will be part of the 10th Assembly as the female APC candidates won in Owo 1, Idanre and Ilaje 2 constituencies.\nIn 2019, the APC won 23 seats in the Assembly, the opposition PDP won only two seats, Zenith Labour Party (ZLP) got the remaining one seat, while the ruling APC lost the state to the opposition PDP during the Presidential and National Assembly elections.\nAlso in 2019, Favour Tomomewo of Ilaje constituency 2 was the only female candidate, compared to 2023 where three females won the election.\nMeanwhile, a total of 208 candidates from 19 political parties contested the Assembly election to represent the 26 constituencies across the council areas.\n12:36pm\nGovernorship Election Results in Delta State as Declared by INEC\nIka North-East LGA\nRegistered voters – 131,945\nAccredited voters – 34,807\nAPC – 4,733\nLP – 1,990\nPDP – 26,760\nValid votes – 33,807\nRejected votes – 918\nTotal votes cast – 34,725\nAniocha North LGA\nRegistered voters – 89,010\nAccredited voters – 16,846\nAPC – 4,386\nLP – 1,883\nPDP – 8,938\nValid votes – 16,316\nRejected votes – 530\nTotal votes cast -16,846\nNdokwa East LGA\nRegistered voters – 86,208\nAccredited voters – 20,434\nAPC – 9,044\nLP – 251\nPDP – 10,146\nValid votes – 19,843\nRejected votes – 485\nTotal votes cast – 20,328\n12:25pm\nKwara Governorship Election Results as announced by INEC\n1. Ekiti local government\nNumber of registered voters, 44,016.\nNumber of accredited voters, 11,849\nAPC 6,836\nPDP 4,273\nTotal valid votes, 11,598\nRejected votes, 251\nTotal votes cast, 11,849.\n2. Isin local government\nNumber of registered voters- 42,238\nNumber of accredited voters -9,631\nTotal votes cast -9630\nValid votes -9,438\nRejected votes-192\nTotal votes cast-9,630\nAPC 5,274\nPDP 3,400\n3. Offa Local government area\nNumber of registered voters 97,945\nAccredited voters 24,115ll\nTotal number of valid votes 23,531\nRejected votes 584\nOver voting in Essa wards 002 and 006 as such two votes were cancelled.\nAPC 14,696\nPDP 6,705\nSDP 1,289\n4. Oke Ero\nTotal 43944\nAccredited voters -11942\nAPC -7,758\nPDP -3,768\nValid -11,808\nRejected 134\nTotal votes -11,942\n5. Oyun\nReg voters 61672\nAccredited voters 16533\nAPC -8,991\nPDP -5,465\nSDP 1,068\nValid votes 16170\nRejected 348\nTotal votes 16528\nCancellation at Ijagbo due to over-voting in one PU\n6. Ilorin South local government\nReg voters 161,045\nAccredited 36,741\nAPC -20,148\nPDP -12,096\nSDP -2,356\nValid votes -35,949\nRejected votes -774\nTotal votes cast -36,723\n7. Asa local government\nReg 87923\nAccredited 29,061\nAPC -14,946\nPDP -11,183\nValid votes 27,907\nRejected votes -583\nTotal votes cast 28,490\nCancellation in two PUs due to violent crisis\n8. Irepodun local government\nReg voter 89644\nAccredited 23,160\nAPC -12,860\nPDP – 7,614\nSDP -1,693\nTotal Valid votes -22,733\nRejected votes -427\nTotal votes cast -23,160\n9. Moro local government\nRegistered voters -81,646\nAccredited voters-24,928\nAPC -15,161\nPDP -6,823\nSDP -1992\nTotal Valid votes -24,466\nRejected votes -461\nTotal votes cast -24,927\nCancellation at one polling unit\n10. Patigi local government\nReg voters -68,136\nAccredited voters -21,930\nAPC -13,813\nPDP -6,544\nTotal valid votes -20,976\nRejected votes -748\nTotal votes cast -21,724\nCancellation at two PUs due to over-voting.\n11. Ilorin East local government\nRegistered voters -163,701\nAccredited voters -43,578\nAPC -23,925\nPDP -14,500\nSDP -2,645\nTotal Valid votes -42,170\nRejected votes -1,015\nTotal votes cast -43,185\nCancellation at two wards in two PUs due to over-voting\n12. Ifelodun local government\nRegistered voters -130,778\nAccredited voters -29,500\nAPC -17,599\nPDP -9,085\nSDP -1,559\nTotal Valid votes -29,006\nRejected votes -494\nTotal votes cast -29,500\n12:15pm\nBauchi State Governorship Election Result: Shira local government Governorship results:\n1)Tsaffi Ward:\nAPC =1844\nPDP=2173\nNNPP 103.\n2) Beli Gagidba Ward:\nAPC= 2121\nPDP=2363\nNNPP=264.\n3) Kulbori ward:\nAPC= 1260\nPDP=1354\nNNPP= 138.\n4) Bakal/Bagua ward:\nAPC= 2632\nPDP= 3705\nNNPP=213\n5) Zubo ward:\nAPC= 1076\nPDP=1311\nNNPP=167.\n6) Tumfafi Ward:\nAPC= 917\nPDP=893\nNNPP=84.\n7) Faggo Ward:\nAPC= 3797\nPDP=2848\nNNPP 193.\nThese are the seven wards out of eleven in Shira Local government area that have submitted their results so far.\n12:13pm\nPDP’s Makinde Wins 17 LGs, Awaits Result from 1 Council\nKemi Olaitan in Ibadan\nGovernor Seyi Makinde of Oyo State is coasting home to victory as the Peoples Democratic Party (PDP) has won in 17 out of the 18 local government announced so far by the Independent National Electoral Commission (INEC).\nThe governor, who is seeking reelection is contesting against a three-term Senator, Teslim Folarin of the All Progressives Congress (APC), and former Deputy Governor of Central Bank of Nigeria (CBN), Chief Adebayo Adelabu of Accord, among other contestants.\nBelow are the results as announced by INEC.\n1) Ona-Ara LG\nAccord: 1,212\nAPC: 5,510\nPDP: 17,326\n2) Ibadan Northwest LG\nAccord: 1,291\nAPC: 5,947\nPDP: 19007\n3) Ibarapa East LG\nAccord: 1,885\nAPC: 7094\nPDP: 11,125\n4) Afijio LG\nAccord: 1,357\nAPC: 5,588\nPDP: 13,139\n5) Atiba LG\nAccord: 1,113\nAPC: 7,484\nPDP: 18,389\n6) Oriire LG\nAccord: 1,895\nAPC: 9,216\nPDP: 13,767\n7) Ibadan Southwest LG\nA: 2,270\nAPC: 9,491\nPDP: 31,273\n8) Oluyole LG\nAccord: 1,386\nAPC: 6,592\nPDP: 21,700\n9) Atisbo LG\nAccord: 1,188\nAPC: 6,955\nPDP: 9,199\n10) Saki East LG\nAccord: 188\nAPC: 5,519\nPDP: 8,374\n11) Surulere LG\nAccord: 271\nAPC: 8,882\nPDP: 15,554\n12) Itewiwaju LG\nAccord: 2036\nAPC: 4,597\nPDP: 8034\n13) Ogo Oluwa LG\nAccord: 50\nAPC: 5,570\nPDP: 10,930\n14) Irepo LG\nAccord: 388\nAPC: 9,785\nPDP: 7,193\n15) Olorunsogo LG\nAccord: 998\nAPC: 4,851\nPDP: 5,838\n16) Ibadan Northeast LG\nAccord: 1,564\nAPC: 8,486\nPDP: 29,396\n17) Ogbomosho South LG\nAccord: 10\nAPC: 8,257\nPDP: 17,693\n18) Ibadan Southeast LG\nAccord: 1,846\nAPC: 9,147\nPDP: 23,585\n12:01pm\nOgun Governorship Election Result As released this morning by INEC\nODEDA\nAPC 11098 Winner\nPDP 8050\nADC 3651\nEGBADO NORTH\nAPC 15331\nPDP 11627\nADC 12190\nEGBADO SOUTH LG\nADC: 6,435\nAPC:15,047\nPDP: 10,913\nABK SOUTH LG\nADC: 9,264\nAPC: 19,689\nPDP: 24,175\n11:12am\nBENUE DECIDES 2023 GOVERNORSHIP ELECTION Results for 7 Local Governments\nUkum\nAPC 28,503\nPDP 9,418\nLogo\nAPC 15,574\nPDP 16,385\nAgatu\nAPC 7,482\nPDP 9,934\nGwer west\nAPC 10,747\nPDP 13,609\nOhimini\nAPC 7233\nPDP 6,785\nGwer East\nAPC 20,083\nPDP 12,085\nBuruku\nAPC 43,569\nPDP 7061\nTotal APC 133,191\nPDP 75,277\nAPC leading with 57,914 votes\n8:45am\nEmbrace Peace, Accept Poll Outcome, Lagos APC Tells LP’s Rhodes-Vivour\nThe All Progressives Peoples Congress in Lagos State says alleged threats by Labour Party’s (LP) governorship flag-bearer, Mr Gbadebo Rhodes-Vivour, at Saturday’s election shows the candidate’s lack of sportsmanship.\nAPC’s Publicity Secretary in the state, Mr Seye Oladejo, while reacting to alleged threats by Rhodes-Vivour in a statement on Saturday, said that the ruling party had no reason to be violent.\n“The attention of the APC has been drawn to a statement made by LP’s governorship candidate Mr Gbadebo Chinedu Rhodes-Vivour on Saturday’s elections.\n“He accused INEC and the police of provoking Lagosians’ and warning that\nif tonight Lagos State catches fire, it is not our fault’.\n“He says `a lot of places are still under attack by thugs and hooligans of the APC.\n“This scaremongering is typical of bad losers who lack the spirit of sportsmanship,’’ Oladejo stated.\nAccording to him, security agencies should note Rhodes-Vivour’s threat.\n“Should there be any breakdown of law and order in any part of our state, law enforcement agencies should know who to grab – Mr Rhodes-Vivour,’’ he added.\nOladejo also stated that the APC was also compiling reports of how its supporters were harassed and attacked during the exercise, saying “some of the reports are really scary.’’\n“Now the LP candidate is playing the victim. This old trick won’t work; discerning Lagosians know they are all lies deployed to attract sympathy.\n“Our party has no need to be violent because we are sure of the glittering credentials of our governorship candidate, Mr Babajide Sanwo-Olu who will never be associated with violence.\n“We advise LP and its candidate to embrace peace instead of threatening to bring down the roof on everybody. It won’t work,’’ Oladejo stressed.\nThe News Agency of Nigeria (NAN) reports that violent attacks by hoodlums disrupted the governorship and House of Assembly elections in parts of Lagos State on Saturday.\nRhodes-Vivour had earlier alleged that an agent of his party at the polls in the state had been shot dead.\nThe LP candidate, who said the election process was fraught with voter intimidation and suppression, alleged that INEC and the police were complicit in the killing.\nAddressing Lagos residents in a video recorded at the LP’s Situation Room, Rhodes-Vivour accused the electoral body and the security agencies of provoking the people. (NAN)\n8:05am\nPDP Wins Ede North Constituency in Osun\nThe Independent National Electoral Commission (INEC), has declared Mr Babajide Kofoworola, the PDP candidate for Ede North State Constituency, winner of the Osun State House of Assembly election.\nThe Returning Officer, Prof. Popoola Bayode of the Obafemi Awolowo University, declared Kofoworola winner having polled the highest number votes.\nKofoworola polled 17,530 votes to defeat his closest rivalry in the the All Progressive Congress (APC), Mr Abdulquadri Suleiman , who came second with a total vote of 9,010 .\nLabour party came third with just 13 votes . (NAN)\n7:22am\nPDP Wins Ede South Constituency in Osun\nThe Independent National Electoral Commission (INEC), has declared PDP’s Olayiwola Olalekan winner of Ede South State Constituency seat in Osun.\nINEC Returning Officer Muritala Monsuru declared Olalekan winner of the Saturday poll after collating the votes from all the wards.\nOlalekan polled 14,468 votes to defeat his APC rival, Mr Raji Sijuade, who got 5,204 votes. (NAN)\n7:06am\nPDP Wins Kaura Constituency in Kaduna\nThe Independent National Electoral Commission (INEC), has declared Mr Yusuf Mugu of the Peoples’ Democratic Party as winner in Kaura State Constituency of Kaduna State.\nReturning Officer in charge of the State Assembly election in the Constituency, Dr Yusuf Abubakar of the Ahmadu Bello University Zaria, announced that Mugu polled 14,085 to defeat four other contestants.\nHe said that Mr Afan Tandad of Labour Party came second with a total of 12,737 votes, while Mr Sunday Nehemiah of the All Progressive Congress came third with 8,715 votes.\nThe Returning Officer said Mr Isaac Gandu of the New Nigerian People’s Party trailed behind with 1,121 votes.\nAbubakar explained that a total of 37,260 voters were accredited out of the 101,275 total registered voters in the local government, of which 37,247 cast their votes. (NAN)\n6:55am\nAPC Wins Somolu Constituency 2 in Lagos\nINEC) on Sunday declared Mr Samuel Apata of the APC as the winner of Lagos State House of Assembly Constituency 2 seat in Somolu.\nThe News Agency of Nigeria (NAN) reports that the Governorship and House of Assembly elections were held nationwide on Saturday.\nProf. Issac Olasunkanmi Olusola, the Returning Officer for the Somolu Constituency 2, who declared the results at about 5.05 a.m. at INEC Collation Centre in Somolu, said that Mr Samuel Apata secured 21, 220 votes to beat his closest opponent, Mr Olusegun Fatai of the Labour Party (LP), who got 9, 664 votes.\nAccording to him, 10 political parties contested for the Somolu House of Assembly Constituency 2 seat.\nThe returning officer said that the election was contested and the candidates recorded the following votes.\nShobamowo Gbolahan Joseph, Accord scored 33 votes, Koledoye Johnson Ade, AA scored 19 votes, Ishola Rauf Shina, AAC scored 23 votes, Olaiya Ibrahim, ADP scored 66 votes, Adewole Dare Jerry, BP scored 48 votes, Olusegun Fatai, LP scored 9, 664 votes, Baale Taoreed Oladipo, NNPP scored 44 votes, Ajayi Ayodeji Johnson, PDP scored 3, 925 votes and Salami Basiru, SDP scored 22 votes.\nOlusola said, “I, Prof. Issac Olasunkanmi Olusola, hereby certify that I am the returning officer for the Somolu House of Assembly Constituency 2 election held on the 18th day of March, 2023 that the election was contested.”\nHe said that Apata, having scored the highest votes at the election, won the House of Assembly election for the Somolu Constituency 2.\n“Samuel Apata of APC, having satisfied the requirements of the law, has scored the highest number of votes; he is hereby declared the winner and returned elected on 19th March, 2023,” Olusola said. (NAN)\n6:32am\nAPC Candidate Wins Somolu Constituency 1 in Lagos\nThe Independent National Electoral Commission (INEC) on Sunday declared Mr Abiodun Orekoya of the All Progressives Congress (APC) as winner of the Lagos State House of Assembly Constituency 1 seat in Somolu.\nThe News Agency of Nigeria (NAN) reports that the Governorship and House of Assembly elections were held nationwide in Nigeria on Saturday.\nDr Waziri Adisa, the Returning Officer for Somolu Constituency 1, declared the results at about 4.50 a.m. at INEC Collation Centre in Somolu.\nHe said that Orekoya secured 14, 256 votes to beat his closest opponent, Mr Adelana Adesegun-Adewale of the Labour Party, who got 4, 865 votes.\nAccording to him, nine political parties contested for the Somolu House of Assembly Constituency 1 seat.\nThe Returning Officer added that Shittu Adedola-Olukorede of PDP scored 1,078, Awofodu Oluwabor-Oluwaseye of AA, 62 votes, Ayodele Gbenga-Johnson of AAC, 4 votes, and Olaleye Ezekiel-Oyefemi of ADC, 70 votes.\nOthers are Adeniyi Kolade of ADP, 37 votes, Ezitonye Peace Uzoma of BP, 21 votes, Gabriel Temitope-Dosunmu of NNPP scored 24 votes, and Awodeji Abdul of SDP had 1 vote.\n“Abiodun Orekoya of APC, having satisfied the requirements of the law and scored the highest number of votes, is hereby declared the winner and returned elected,” Adisa said. (NAN)\n5:45am\nINEC Announces Sunday for Commencement of Result Collation in Cross River\nINEC has declared the collation centre for the governorship and state house of assembly elections opened.\nDeclaring the event open, late on Saturday at the INEC Secretariat in Calabar, Prof Gabriel Yomere, Resident Electoral Commissioner (REC) for Cross River, thanked all who were present.\nYomere also used the opportunity to introduce Prof. Teddy Adies, State Returning Officer for the election.\nOn his part, Adies said the collation of results at the state level was after each of the results had been announced at the Local Government level.\nThe returning officer, who is from the Federal University Otueke, asked if any LGA was ready with their result and since none was ready, he postponed the collation to 5 p.m. on Sunday.\nHe said by then, many results would have come in for the collation to fully commence\nThe News Agency of Nigeria (NAN) reports that members of Inter Agency Consultative Committee on Election Security (ICCES) in Cross River witnessed the event. (NAN)\n5:10am\nINEC Fixes Sunday for Suspended Asari-Toru LG Election\nThe INEC in Rivers, on Saturday said that the Commission was ready to conduct the election of Asari-Toru Local Government Area and the ward 14 of Degema Local Government Area on Sunday.\nThe INEC Resident Electoral Commissioner (REC) Dr. Johnson Alalibo, disclosed this in a statement by Mrs Geraldine Ekelemu, the Public Relations Officer of INEC, in Port Harcourt.\nAlalibo stated that election could not hold in the LGAs due to the voters’ resistance of deployed election officials and materials for the Governorship and State House of Assembly elections.\nAlalibo said that the electorate and other stakeholders demanded to see the ward collation officer before they would allow the election to commence in Asari-Toru LGA.\nHe said that voters at ward 14 in Degema LGA equally demanded that the supervising Presiding Officer (SPO) must come to the Registration Area Centre with collation sheets, thereby disallowing the election to hold in the area.\nThe REC said that the Commission had decided to conduct the election at the areas on Sunday, standing on the premise and relying on section 24 of the Electoral Act 2022. (NAN)\nSATURDAY, MARCH 18, 2023\n10:16pm\nEFCC Arrests 65 Suspects over Alleged Voter Inducement\nThe Economic and Financial Crimes Commissiom (EFCC) Saturday arrested 65 persons in 28 states over alleged voter inducement during the governorship and Houses of Assembly elections.\nThis is contained in a statement issued by its spokesman, Mr Wilson Uwujiaren.\nUwujiaren stated that 20 of the suspects were arrested in Kwara, while 13 suspects were arrested in Kaduna State.\nHe added that 12 suspects were arrested in Rivers; four suspects each were arrested in Akwa Ibom and Cross River, while others were arrested in Gombe, Sokoto, Kebbi and Niger States.\n“Those arrested in Kaduna State were 10 males and three females. They were apprehended by EFCC operatives either working on intelligence reports or were chanced upon during monitoring.\n“A suspect allegedly involved in vote buying was nabbed at School Road, Unguwan Rimi in Kaduna. The suspect, who initially resisted arrest, is however in custody pending the conclusion of investigation.\n“Also in Kaduna, a team arrested a suspect with voter coupons, which he confessed would be used to trace and pay those who voted for his party,’’ Uwujiaren stated.\nHe added that the EFCC team monitoring voting around Local Education Authority School, Kabala Doki in Kaduna also arrested two suspects for vote buying.\nThe EFCC spokesperson noted that upon arrest, N67,500, a list containing names of voters, their PVC numbers and bank accounts details were recovered from the suspects.\nHe stated also that investigation showed that the major modus operandi of the suspects was to give cash, transfer money, coupons or send recharge cards to eligible voters to induce them.\nUwujiaren said a search of their persons and phones showed that most of them had transferred money into bank accounts of some voters on the lists recovered from them.\n“Some of the items recovered from the suspects were voter cards, monies, lists containing names and accounts details of voters and telephone recharge cards,’’ he stressed. (NAN)\n9:16pm\nNo Security Threat in Zamfara, APC Plotting to Disrupt Poll Result Collation, PDP Alleges\nZamfara State PDP Candidate, Dauda Lawal has alleged that the state government was hell-bent on disrupting the process of result collation.\nLawal in a statement by his media office Saturday in Gusau stated that the state government had perfected plans to issue a fake security threat in some local government areas of the state.\nHe said: “The Peoples Democratic Party (PDP) is in an early lead in the results so far collated from polling units across the state.\n“There was a massive turnout of voters, and the results coming out indicates that PDP is comfortably winning.\n“Elections were held successfully in all local government areas, but we learned that the governor is mobilizing thugs intending to disrupt the process.\n“We have uncovered that they want to disrupt the collation process in Shinkafi, Zurmi, Birnin Magaji, Anka, and Kauran Namoda local government areas.\n“We call on the security agencies in the country, INEC, and International Organisations to consider Zamfara as a flashpoint area and beam searchlight on it to monitor, and supervise the collation of results.”\n9:11pm\nZamfara PDP Guber Candidate Wins Polling Unit\nThe Peoples Democratic Party Governorship Candidate in Zamfara State, Dauda Lawal, has won his GRA II Health Centre polling unit, Madawaki, Gusau scoring 384 votes.\nHis closest rival and incumbent Governor Bello Mutawalle of All Progressives Congress polled 82 votes.\n6:37pm\nEl-Rufai Decries Voter Intimidation, Low Voter Turnout\nJohn Shiklam in Kaduna\nThe Kaduna State Governor, Nasir El-Rufai, has decried voter intimidation in Saturday’s governorship and state assembly elections in the southern part of the state.\nHe also lamented the low turnout of voters across the state.\nThe governor said although the election was generally peaceful across the state, he received reports of voter intimidation in Southern Kaduna.\nSpeaking in an interview with journalists shortly after casting his vote, El-Rufai commended the Independent National Electoral Commission (INEC) for improving on the election process.\n“Generally speaking, the process has been peaceful and smooth except in a few places in Southern Kaduna where we got a report of voter intimidation.\n“People are being asked to vote for one party or go back home,” he said.\nThe governor said security agencies were on top of the situation.\n“We anticipated some level of violence but by the grace of God, there was no report because security was put in place in response to that intelligence,” he added.\nHe said the All Progressives Congress (APC) was optimistic of a positive outcome of the election.\nAlso speaking in an interview after casting his vote at his LEA Kawo pulling unit, the APC governorship candidate, Senator Uba Sani, alleged that the opposition Peoples Democratic Party (PDP) was conniving with INEC officials to intimidate voters and thumb print ballot papers.\nAccording to Sani, voters in Zaria and Kajuru were being intimidated while ballot papers were being thumb printed.\nMany residents of Kaduna metropolis did not turn come out to vote.\nIn places like Barnawa, Sabon Tasha, Narayi, Kakuri, Kigo Road, Angwan Sarki, Anguwan Megero, among several places, voter turnout was low.\n6:25pm\nC’River APC Guber Candidate Lauds INEC on Peaceful Polls\n- One killed in Ogoja, four buses burnt in Odukpani\nBassey Inyang in Calabar\nThe governorship candidate of the All Progressives Congress (APC) in Cross River State, Prince Bassey Otu, has given high marks to the Independent National Electoral Commission (INEC) over the conduct of Saturday’s governorship and state House of Assembly elections in the state.\nSpeaking with journalists in his country home in Adiabo Okurikan, Odukpani Local Government Area, Otu said from feelers reaching him from the field, the elections were generally peaceful, and the Bimodal Voter Accreditation System (BVAS) machine were largely functional.\nOut, who voted in Efut Ward in the area, said: *Yes, I have full confidence in the BVAS. If you want to look at the election INEC have been conducting over the years, right from 1999 till date, even at bye-election, you’ll see that somehow they live up their game.\n“People must not forget where we are coming from, and the type of greed that has been injected into politics. The fact that our economy is very bad and people are looking at election probably as the only way out, as a result of that, it becomes a total war and at times INEC is at the receiving end.\n“INEC must also be given the benefit of doubt to continue to make sure that they perfect all their arrangements. There were issues with the BVAS but I don’t think that those issues should be key issues in giving judgement that BVAS is not working. I want to believe that INEC will continue to scale up with technology and everything to ensure that BVAS will deliver to the benefit of Nigerians.\n“I don’t think there’s a lot of challenge with the BVAS, I went there was no delay. I was captured and the tick came out and I voted so I believe that moving forward they’ll continue to make sure that things are added that will make it completely fine.”\nThe election in the state was generally peaceful except for few incidences of violence that occurred hours before the commencement of voting.\nIn Ikoneto, Odukpani Local Government Area, four buses in the convoy of a top member of the Peoples Democratic Party (PDP) were burnt beyond recognition and an SUV vehicle vandalised by people suspected to be youths of the community.\nAlso in Ogoja, a member of the APC, whose name was given as Joe, was allegedly shot and killed by a soldier when he allegedly attempted to tamper with the electioneering.\nThe police authorities in the state confirmed that they got a report that one person was shot dead by the police in Ogoja.\n6:10pm\nINEC Postpones Governorship, Assembly Elections in 10 Polling Units in VGC\nSegun James\nThe Independent National Electoral Commission (INEC) has postponed Saturday’s governorship and state assembly elections in 10 polling units in Victoria Garden City (VGC), Lekki.\nThe Resident Electoral Commissioner, Lagos state, Segun Agbaje made the announcement when he addressed reporters at VGC.\nAccording to him, corps members deployed as ad hoc staff on Saturday were hesitant to enter the VGC estate as they alleged that they were held hostage in the February 25 Presidential and National Assembly elections.\nAgbaje said the commission’s ad hoc staff set up voting materials in front of the estate on Saturday but the estate residents claimed that hoodlums might disrupt the process, so they did not feel secure and could not cast their votes.\nHe said the situation was difficult for security agents to contain hence he and his team had to come to the area.\n“We have eight polling units here with 6,024 registered voters and out of which 5,624 people have their PVCs,” he stated, adding that two other polling units at the estate’s main gate were also affected. “Eight here (in the estate) and two outside,” he noted.\n“After due consultation and further directive from the national headquarters that we should remobilise here tomorrow (Sunday) morning by 08:30am to conduct the elections, by 08:30am tomorrow (Sunday), we will reconvene here.”\n5:59pm\nThree Suspected Ballot Box Snatchers Killed, as Voter Apathy Mar Election in Delta\n*INEC workers, NYSC members scared off polling centres\n*Gunmen ambush INEC staff, snatch voting materials in Bomadi\n*Delta REC hints at early release of election results\nOmon-Julius Onabu in Asaba\nThe governorship and state legislative elections were generally peaceful across Delta State with the BVAS machines reportedly working seamlessly at practically all polling centres across the state but there was serious low turnout of voters with a few cases of violence reported.\nTwo young men were shot dead by military personnel at Mosogar in Ethiope West Local Government Area as they allegedly tried to flee a polling unit with snatched ballot boxes while one of two persons who disrupted the polling exercise at Utagaba-Uno in Ndokwa West Local Government Area was also reportedly killed.\nTHISDAY also learnt that unidentified persons ambushed and snatched voting materials from INEC officials early on Saturday in Tuomo area in Bomadi Local Government Area.\nHowever, Delta State Governor, Dr Ifeanyi Okowa, was accredited and cast his vote at Polling Unit 17 at Eghoma Primary School, Owa-Alero in Ika North-East Local Government Area of Delta State.\nHe voted at about 9.50am alongside his wife, Dame Edith and their daughter, who is also the candidate of the PDP for the Delta State House of Assembly in the election.\nOkowa, who was impressed with the smooth running of the process and working BVAS machines, appealed to the people to put behind them the disappointment over the failure of INEC in the previous election to keep its promise to upload the BVAS results.\nThe governor, who is the vice-presidential candidate of the PDP, said, “I have played my part in shaping the future of our great state. If you have a PVC, you should too!”\nNonetheless, Okowa also commended the security personnel for enduring that the process in the area was hitch-free and hoped that INEC would sustained the smooth proceess and upload the election results with the BVAS machines without delay.\nThe PDP governorship candidate, Hon Sheriff Oborevwori, was accredited and cast his vote at about 11.am at his polling unit in Osubi, Okpe Local Government Area while the APC flag-bearer, Senator Ovie Omo-Agege, was accredited about the same and voted at about 11.05am his unit in Orogun, Ughelli North Local Area of the state.\nThere were conflicting reports of disruption of election process at Evwreni in Ughelli North Local Government Area of Delta State, hometown of the 2015 governorship candidate of the Labour Party and a founding member of the APC, O’tega Emerhor.\nWhile a serving member of the State Executive Council was alleged to have led thugs to attack the polling centre and destroyed voting materials in some of the polling units in the community, another account alleged that the APC chieftain had masterminded the disruptive attack witnessed in the community on election day.\nThere was yet no independent confirmation of those behind the violence at polling units in Evwreni community at the time of filing this report even as the security personnel deployed in the community were apparently unable to stop the distruption or arrest the suspected thugs.\nHowever, some NYSC members serving as INEC adhoc staff and others on election duty reportedly sustained injuries while at least three BVAS machines were also reportedly smashed.\nConsequently, INEC recorded an unusual shortage of manpower in several.places, including parts of Ethiope East and Amai in Ukwani where voting could not take place at all in at least 16 units as the people refused participate because only about five INEC officials had arrived with voting materials just one or two units.\nIn a swift reaction to the incident, the Delta State Resident Electoral Commissioner (REC), Monday Udoh, berated the people for “taking the law into their hands” and preventing the few INEC officials from conducting any voting in the community.\nHe admitted that INEC in the state has been hit by shortage of manpower.\nUdoh, who lamented the voter apathy that characterized the entire eketoral process on Saturday, noted that the people ought to cooperate with the INEC personal that came since the Electoral Act 2022 had provided for continuation of voting the following day where voting could not take place due to inability of INEC to conduct election as scheduled.\nNevertheless, the Delta REC commended the relatively peaceful nature of the election and hinted at early collation and declaration of the governorship and state House of assembly results owing to the fact that there was very low turnout of voters, so that the electoral officers would have relatively less used ballots to compute the results.\nTHISDAY learnt that the drop in the number of INEC adhoc staff may not be unconnected with the harassment some of them, especially NYSC members, were subjected during the presidential and House of Assembly election on 25th February.\nMany corps-members simply opted out of the election duty due to threat of violence, beside the reported delay in the payment of their special duty allowance, alongside policemen deployed to INEC for the general election.\n5:28pm\nLP Guber Candidate Loses Polling Unit to Sanwo-Olu\nThe Labour Party candidate in the Lagos State governorship election, Gbadebo Rhodes-Vivour, has lost his polling unit to the incumbent, Governor Babajide Sanwo-Olu of the All Progressives Congress (APC).\nRhodes-Vivour polled 18 votes while Sanwo-Olu won with 29 votes.\nAnother contestant in the election, the Peoples Democratic Party’s Olajide Adeniran, popularly known as Jandor, polled two votes.\nOne vote was counted as void at polling unit 01 at Oshifila Street, Anifowoshe, Ikeja.\nIn the House of Assembly election at the polling unit, the APC polled 34, LP 15, while PDP polled one vote.\n5:33pm\nSanwo-Olu Wins Polling Unit\nGovernor of Lagos State, Mr Babajide Sanwo-Olu of the ruling All Progressives Congress, has won his Polling Unit (Unit 006, Ward E3, Eiyekole, Lagos Island).\nThe APC also won the Assembly election in the polling unit.\nGOVERNORSHIP:\nAPC – 121\nPDP – 01\nLP – 02\nAccord – 02\nASSEMBLY:\nAPC – 120\nPDP – 03\nLP – 02\nAccord – 01\n5:10pm\nLai Mohammed Delivers Polling Unit for AbdulRazaq\nHammed Shittu in Ilorin\nMinister of Information and Culture, Alhaji Lai Mohammed Saturday delivered his polling unit 006 Oro Ward 2 in Irepodun Local Government Area of Kwara State with 174 votes in the governorship election.\nThe main opposition party, the Peoples Democratic Party came second with 22 votes while the Social Democratic Party polled 16 votes.\nLabour Party didn’t record any vote.\nThere were 750 registered voters in the ward but 226 voters were accredited.\n5:07pm\nINEC Confirms Kidnap, Release of 19 Ad hoc Staff in Imo\nThe Independent National Electoral Commission (INEC) on Saturday, confirmed the kidnap of 19 members of its ad hoc staff while on their way to conduct the House of Assembly election in Ideato South Local Government Area of Imo.\nINEC’s Resident Electoral Commissioner for Imo, Prof. Sylvia Agu disclosed this in a statement on Saturday in Owerri.\nThe News Agency of Nigeria NAN) gathered that they were, however, released following intervention by security agents but election materials including BVAS machines are still missing.\nAgu said: “The attention of the commission has been drawn to a report from Ugbelle Registration Area (06) in Ideato South Local Government Area of Imo state where thugs carted away all electoral materials and took our staff hostage for some hours during the March 18 House of Assembly election.\n“The security forces were informed and a rescue operation was mounted.\n“Presently, all ad hoc staff on hostage have been rescued but no trace of the election materials.\n“While the commission remains grateful to the security operatives, it condemns such acts of thuggery, intimidation and disenfranchisement of voters and urge the public to continue to have confidence in the electoral process,” Agu stated.\nThe REC said a full statement on the matter will be issued later. (NAN)\n4:56pm\nThugs Destroy Election Materials in Ebonyi community, Police Confirm\nSome Political thugs have destroyed electoral materials including the Bimodal Voter Accreditation System (BVAS) machine and other sensitive materials in Omege Ward, Ezza North Local Government Area of the state.\nThe News Agency of Nigeria (NAN) reports that Omege ward is the polling unit of the All Progressives Grand Alliance (APGA) Gubernatorial candidate, Prof. Bernard Odoh.\nThe thugs also injured some voters at the polling unit.\nSP Onome Onovwakpoyeya, the Police Public Relations Officer, Ebonyi Command, who confirmed the incident said the electoral materials were initially destroyed.\nAccording to Onovwakpoyeya, yes, some sensitive materials were destroyed but later resent to the affected Polling Unit and election conducted in the area.\nAn electorate, who refused to mention his name said suspected thugs came into the polling unit and started shooting sporadically.\n“No fewer than three persons were shot. They have been taken to the hospital,” he said. (NAN)\n4:50pm\nPandemonium as thugs scatter ballot boxes in Lagos\nSome unidentified thugs on Saturday in Lagos chased voters away from polling units, as they attempted to steal ballot boxes.\nA News Agency of Nigeria (NAN) correspondent, who was at Ward F3 Polling Unit 13, Ago Palace Way, Lagos, watched with surprise as some thugs suddenly started chasing voters away with the aim of snatching ballot boxes.\nThe people ran for safety as the thugs continued to throw chairs and spray some chemical at them.\nNAN reports that the incident was ongoing when armed policemen swung into action and arrested one of the thugs while others fled.\nVoting, however, resumed as normalcy was restored by the policemen. (NAN)\n4:45pm\nICPC Deploys 400 Operatives to Prevent Vote-buying\nThe Independent Corrupt Practices and Other Related Offences Commission (ICPC) on Saturday said it deployed 400 officers and operatives to prevent vote buying in governorship and Houses of Assembly elections.\nThe ICPC Spokesperson, Mrs Azuka Ogugua, said in a statement in Abuja that the officer were already operating at the various wards and polling units.\nAzuka, said that the chairman of ICPC, Prof. Bolaji Owasanoye, addressed the election monitoring teams before their deployment.\nShe quoted Owasanoye as saying that “Our participation in the election monitoring is a call to an exceptional national duty.\n“Our relevance is neither an after-thought nor happenstance but arose from the recognition of our contribution to national development through the implementation of our enforcement and preventive mandates in combating corruption and associated ills.\n“Our importance led to the commission being made a member of the Inter-Agency Consultative Committee on Election Security (ICCES) which comprises our sister agency, the Economic and Financial Crimes Commission, the Military, Police, Department of State Security and other security agencies.\n“It has the Independent National Electoral Commission (INEC) and the Office of National Security Adviser as co-chairs. All these agencies will monitor the elections.”\nOwasanoye urged the officers to follow the ICPC guidelines for election monitoring and also comply with the ICCES code of conduct and rules of engagement for security personnel on election duty.\nThe ICPC boss also counseled the monitoring teams to act with discipline and integrity and directed them to put their body cameras to effective use.\nAzuka said the reports from field operations by the Election Monitoring Teams had been sent to the ICPC Situation Room at the Headquarters.\n“A vote-buyer at the Ba Sarki Polling Unit 002 central capital of Adamawa State fled on sighting the ICPC monitoring team.\n‘“Voting was observed to be going on smoothly in the Surulere area of Lagos State and some other locations in the State.\n“ICPC Election Monitoring Teams in Enugu State observed voter apathy at the polling units as only a few voters were on ground, ” she said.\nShe said that ICPC Election Monitoring Teams were also monitoring the election along with some international observers in some polling units in other states.\nShe recalled that the anti-corruption agency had on February 25 arrested nine vote-buyers in Osun, Ondo, Borno, Akwa Ibom and Sokoto States during the Presidential and National Assembly elections. (NAN)\n4:43pm\nMasked Thugs Storm Lagos Polling Units, Chase Voters Away\nMasked thugs on Saturday invaded some polling units at Ward D, Igando/Ikotun, Lagos State, and chased away voters in queue.\nThe thugs chased away the voters with sticks and knives at the polling units located at Ijegun Community School.\nThe polling units include 096, 116, 281, 094, 095 and 084.\nA News Agency of Nigeria correspondent, who monitored elections in the area, reports that the thugs came to the polling units on motorcycles.\nThey went from one polling unit to another chasing them away.\nThe attack compelled some voters to jump the school’s fence for safety.\nAlso at Polling Unit 227 located at Awonisi Gate on Ijegamo Road, the thugs also beat up a lady who tried to take their picture.\nThey allegedly took her phones and her automated teller machine cards.\nThey also beat up and wounded a man who attempted to challenge them.\nThe voters, including accredited ones, did not return to the polling units as at press time even after the thugs left.\nNAN reports that few police personnel were at area but were not armed.\nOne of them told NAN later that they couldn’t do anything because they were not armed.\nHe, however, said that a patrol team had been called.\nA police patrol team arrived at the scene later.\nOne of the team members said on condition of anonymity,” Why did they call us after the crisis has died down? They should have called earlier.”\nNAN had reported that voting was abruptly stopped at Unit 078, Ward F5, Okeafa, Ilamose Estate, Oshodi-Isolo Constituency 2, Lagos State, as thugs chased voters away with bottles and stones at about 10.52 a.m.\nNAN equally reported that thugs chased voters away and attempted to steal ballot boxes at Ward F3, Polling Unit 13, on Ago Palace Way, Okota, Lagos State.\nVoters ran for safety as the thugs threw chairs and poured some a chemical substance on them. (NAN)\n4:39pm\nAbdusalami Urges Contestants to Accept Polls Outcome in Good Faith\nLaleye Dipo in Minna\nA former military Head of State, Gen. Abdulsalami Abubakar, has charged candidates who contested the governorship and House of Assembly elections to accept the results in good faith.\nAbubakar made the plea shortly after casting his ballot at the uphill polling unit on Saturday.\nThe former Nigerian leader, who is also the Chairman of the National Peace Committee, said so far, the elections seems to free and fair.\n“So far from what I have seen, everything is going on smoothly. I was captured within a minute. I hope everything goes peacefully,” he said.\nCommenting on the poor voter turnout, the former head of state said he could not confirm emphatically since he had not gone round to see things for himself.\n“I have not gone round but it should be expected because people get tired to vote. I hope it will be peaceful throughout,” he said.\nThe Niger State Governor, Alhaji Abubakar Sani Bello, also speaking after casting his vote in Kontagora, described the process as peaceful and orderly, adding that the process was very seamless.\nBello commended the electorate for turning out to exercise their franchise, adding that he believes the All Progressives Congress (APC) candidates will emerge victorious.\nThe governor’s wife, Dr Amina Sani Bello, also cast her vote in Kontagora.\n4:19pm\nPolls: NSCDC Arrests Thugs in Enugu\nGideon Arinze in Enugu\nThe Nigeria Security and Civil Defence Corps (NSCDC) has confirmed the arrest of scores of suspected thugs in the Nsukka axis of Enugu State.\nThe spokesman of the Enugu State Command of the corps, Danny Iwuchukwu, who confirmed the arrest, said that it was carried out in the early hours of Saturday, the election day.\nHe said that the thugs, numbering over 100, were arrested by officers of the Nigerian Army providing security in the Nsukka axis after an intelligence tip-off at a popular hotel in Nsukka.\nHe noted that the thugs, who were arrested with AK47 rifles and other dangerous weapons, including axes, clubs and matchets have since been handed over to the Nigeria Police in Nsukka.\n4:05pm\nThugs Attack Plateau Polling Unit, Destroy Ballot Papers, Voters Registers\nSeriki Adinoyi in Jos\nSome suspected thugs have attacked Pangpit polling unit in Mikang Local Government Area of Plateau state destroying the voters register and ballot boxes.\nA voter at the polling unit, Mr. Joshua Kabiru confirmed the development, saying that trouble started when some party agents who observed that some voters were being guided before casting their votes started quarreling among themselves.\nKabiru said, “It was at about 11am on Saturday that the incident happened at the Pangpit polling unit in Mikang. Voting was just going on smoothly when we saw the party agents quarreling among themselves .From what I learnt, one of the party agents complained that some voters were not being given free hand to vote for candidates of their choice in the polling unit.\n“Suddenly, some people came and attacked the polling unit. In the process, they destroyed some of the votes cast and also the voters register. They also tore some of the used ballot papers and some people sustained injuries but INEC officials were not among those who sustained injuries. It took the intervention of some security agents who were deployed to the polling unit to bring the situation under control. But before the security men arrived, those who perpetrated the act had fled the scene.”\nIt was further gathered that following the incident, voting had been suspended in the area.\nSpokesman for the Plateau state Police Command, Mr. Alabo Alfred said Senior police officers had been deployed to all the Local Government Areas to handle every security issue that may arise as a result of the on going governorship and state House of Assembly elections in the state.\n4:00pm\nThugs Invade Polling Centre, Attempt to Snatch Ballot Boxes in Anambra\nDavid-Chyddy Eleke in Awka\nSome thugs, suspected to be armed, invaded Metu Memorial Primary School in Odoakpu area of Onitsha, Anambra State, Saturday, attempted to snatch some ballot boxes.\nA voter, Mr Chibuzor Ekene, told journalists that the men invaded the polling centre with a tricycle, and attempted to snatch the ballot boxes.\nHe said the men were suspected to have been sponsored by one of the popular political party contesting in the House of Assembly election.\nHe said: “They arrived and attempted to snatch and destroyed ballot boxes. The people were scared, and they ran away. They also attempted to snatch the phones of many voters.\n“The bad boys left before security could arrive the scene. Voting stopped temporarily after the incident.”\nThe Anambra State Police commissioner in charge of election duty, CP Aderemi Adeoye, confirmed the incident, saying that police operatives were able to confront the thugs, while they abandoned the act and fled.\n3:53pm\nOne Killed, Another Arrested for Vote Buying in Niger\n* Thugs invade polling station in Busu\nLaleye Dipo in Minna\nA middle-aged man was shot and killed in Sauka-kahuta area of Minna, the Niger State capital, during Saturday’s governorship and House of Assembly elections.\nAccording to eyewitnesses, the man was shot when he and others were throwing stones at security operatives deployed in the area to ensure orderly conduct of the elections.\nIt was not known why the man and others threw stones at the security men, neither was it known which of the security operatives shot the man.\nHowever, it was learnt that the police personnel, men of the Nigeria Security and Civil Defence Corps (NSCDC) were among the team of security men posted to the area for the polls.\nIt was gathered that the remains of the man were taken away by his colleagues probably for burial.\nTHISDAY can also report that operatives of the Economic and Financial Crimes Commission (EFCC) arrested the agent of one of the two leading political parties for alleged vote buying in the Sabongari area of Minna.\nThe agent was said to be giving some naira notes to voters to induce them to vote for his party when he was apprehended and taken away in an EFCC vehicle.\nIn Busu, Lavun Local Government of the state, thugs were reported to have invaded the Gbadagbadzu polling unit, destroyed the ballot boxes and scattering the votes already cast.\nThe thugs also injured three people who had cast their ballots and were waiting for the counting.\nThe presiding officers, according to reports, took to their heels for safety.\nWhen contacted, the Niger State Police Command Public Relations Officer, DSP Wasiu Abiodun, promised to get back to THISDAY but did not do so until the time of filing this report.\n3:40pm\nAPC National Chair Debunks Reports on Zoning of N’Assembly Positions\nSunday Aborisade in Abuja\nThe National Chairman of the All Progressives Congress (APC), Senator Abdullahi Adamu, has described as fake the widely reported news that the National Working Committee (NWC) of the party had zoned the various leadership positions in the National Assembly.\nAdamu made the clarification while addressing journalists after he cast his vote at his Keffi, Nasarawa State country home on Saturday.\nHe was reacting to a news report that Senator Barau Jibrin was being favoured to emerge as the Senate President because the NWC of the APC had allegedly zoned the Senate Presidency to the North-west.\nBut Adamu wondered why politicians would be engaging in wishful thinking instead of awaiting the official pronouncement from the party.\nHe said: “The report about the zoning arrangements for the 10th National Assembly is fake news. We have not done any zoning.\n“I have said it times without number since Monday. I am still saying the same thing. No zoning has been established yet and agreed to.\n“No zoning has been made public. Anybody who is saying anything is a rumour. It’s a wishful rumour.”\nAlso in a statement titled ‘APC Yet To Zone Key 10th National Assembly Positions’, signed by its National Publicity Secretary, Felix Morka, on Saturday, the party described stories of the zoning of leadership positions as false and misleading.\nMorka said: “The attention of the All Progressives Congress (APC) has been drawn to a report circulating on social media on purported zoning of key positions of the incoming 10th National Assembly. The report is false and misleading and should be disregarded in its entirety.\n“The party has not made any decision on zoning of positions or offices of the 10th Assembly.\n“As soon as a decision is made on zoning, it will be made public through the party’s official communications channel.”\nThe misleading reports, which was published by major newspapers on Saturday, had claimed that the NWC of the APC had finally opted to zone the Senate Presidency position to the North-west geopolitical zone, making the “odds to clearly favour Senator Barau Jibrin”.\nThe false report claimed that the decision on zoning was reached on Friday night by the leadership of the APC after consulting with the President-elect, Asiwaju Bola Ahmed Tinubu.\n“The decision takes pre-eminence over earlier suggestions in some quarters to zone the position to the South,” the debunked story further claimed.\n3:38pm\nPoor Turnout, Improper Configuration of BVAS Mar Election in Plateau\nAt Polling Unit 008 Dantanko Ward, Miango.\nINEC officials idle by 1:32pm, as only 70 voters from out of 840 registered voters turned up.\nSeriki Adinoyi in Jos\nPoor turnout of voters on Saturday characterized governorship elections in Plateau State with electorate accusing the Independent National Electoral Commission (INEC) of lacking integrity.\nWhile some male adults were seen playing draft and other games under the trees in front of their houses, the youths took over the football pitches all over Jos town to while away time.\nSome youths numbering over 30 at Dadin Kowa community Jos South Local Government Area of the state, who abandoned the voting exercise said blamed their actions on the outcome of the presidential election which they described as disappointing.\nOne of them, who identified himself as John Datti said, ” We came out in large en mass during the last presidential election hoping that our votes will count. But we were disappointed when INEC eventually announced the results which obviously did not reflect the voting pattern the votes of the people of the community.\n“It shows that our votes did not count and that is why we decided to come out to the pitch to play football rather than going out to waste our time in the name of voting which may still not count at the end of the day.”\nAnother youth, by name Sunday Igbigbi at Angwa Rukuba football pitch where they the youths also stages a football match, also corroborated Datti’s position. They called on INEC to learn to respect the Nigerians and their votes.\nIgbigbi said, “I can tell you that many Nigerians will not come out next time to vote at all if INEC’s integrity remains questionable. So, it’s up to INEC to use this last opportunity of governorship elections to save it’s face from shame.\nAt Polling Unit: 042 Tudun wada/Kabong Ward, Rukuba Road. Number of registered voters is 3144, accredited voters were just 500 in number.\nMeanwhile, initial hitches were experienced at Rabin polling unit, Du when configured BVAS still carries February 25th, 2023 date when the Presidential polls held.\nThe Returning Officer said the error must have emanated during the configuration of the BVAS. He returned the BVAS for proper configuration.\n3:06pm\nBode George Condemns Voter Suppression in Lagos\nSegun James\nAs violence and voter suppression are reported in parts of Lagos during the ongoing governorship election, former national Deputy Chairman of the People’s Democratic Party, Chief Olabode George, has described the election as a sham.\nHe faulted the conduct of the election, saying reports of snatching of ballot boxes, intimidation and harassments of voters is disappointing.\nGeorge made the remark after voting at his Cameron Road, Ikoyi, voting unit, insisting that the election was a sham.\nHe said, “The attitude of the APC is very disappointing. If you continue like this when things happen, don’t complain.\nHe said where he voted was peaceful but the reports he had received so far showed, there were ballot snatching and harassments of voters.\nHe mentioned Surulere, Ikeja, Somolu, Oshodi and Kosofe as areas where voters suppression were allegedly committed.\n“What is all this? They forget that the international community is watching. What kind of nation do we want to be in the eye of the comity of nations?\n“What I found was a general voters’ apathy. How would the outside world look at us because we can’t exist alone. We will wait and see the final outcome.\n“If this kind of attitude becomes a norm, it means we can’t do simple things right,” he added.\nThe PDP chieftain said the presence of military personnel should be to ensure that the process was orderly, saying “they are to ensure that people vote freely without any encumbrance.”\n2:54pm\nZamfara PDP Cries out over Arrest, Harassment of Party Leaders\nThe People’s Democratic Party, Zamfara State chapter, has decried the harassment and arrest of its members by the police.\nThe PDP, through its Publicity Secretary, raised the alarm following the arrest of some key members of the party by the police while elections are still in progress.\nThe PDP noted that the hatchet job by the ruling party, All Progressives Congress (APC) was targeted at frustrating the leaders of the party and as well threatening party members in order to ensure that the election process is not free and fair.\nThe party said: “It is unfortunate that the Zamfara State government is using the police to intimidate and harass members of the opposition across the state.\n“There is nowhere in the country where party members are being harassed like this.\n“Zamfara State government should stop intimidating our members. They have perfected so many evil plans to disrupt the process and suppress voters, but the people stood against them and their plans.\n“Now they have resorted to the use of the police to arrest our leaders across the state. We are not in military era.\n“We have confirmed so far that in Mafara LGA, our party leaders like Captain Mairiga and Alhaji Aliyu E.S were arrested this morning.\n“While in Anka LGA, the police have arrested Mustapha Ibrahim Mayanci, Mustapha Ibrahim Danliti Mayanci, Abubakar Usman Mayanci, and Sama’ila Mayanci among others.\n“We call on the Inspector General of Police, the Director DSS, and international election observers to watch the happenings in Zamfara very closely.\n“We are hopeful of winning the election in Zamfara, as our candidate Dauda Lawal is in the early lead from the results collated so far.”\n2:46pm\nPolls: Makinde, Wife Cast Votes in Ibadan\nKemi Olaitan in Ibadan\nGovernor ‘Seyi Makinde of Oyo State and his wife, Tamunominini, joined millions of voters in the state to cast their votes at the governorship and state House of Assembly elections.\nThe governor, who voted at Ward 11, Unit 01, Abayomi Iwo Road in Ibadan North East Local Government, said that he was impressed with the peaceful conduct of the election so far.\nHis wife, Tamunominini, voted at Unit 08 Army Barracks, Iwo Road, also in Ibadan North East Local Government of the state.\nMakinde had arrived the voting point at 10:40 am, and cast his vote at about 10:48am.\nHe had earlier been verified and accredited with the BVAS machine.\nThe governor, while speaking with journalists after casting his ballot, described the voting process as peaceful and commended the security agencies for doing a good job.\nHe called on the people to come out in good number to exercise their civic rights, urging those who were yet to cast their votes to be patient.\nHe expressed confidence that the people of the state would vote for him again.\nAccording to him, “In my own unit here, everything is going peacefully. The INEC officials came early. You yourselves can see that people are out here exercising their civic rights, and from the security aspect, it has been so far so good.\n“Let me also use this opportunity to tell people to come out. You know they were saying there will be security challenges, but as you can see, there are no security challenges. Our people are here voting peacefully.\n“I believe our people will vote Omituntun 2.0.”\n2:32pm\nGuber, Assembly Election Better Than Feb 25 Poll, Says Tambuwal\nGov. Aminu Tambuwal of Sokoto State has appreciated the general conduct of the March 18 Governorship and State Assembly elections in the state.\nTambuwal made the commendation shortly after he cast his vote at Community Girls’ Secondary School, Tambuwal, in Sokoto on Saturday.\nAccording to the governor, the exercise is truly and generally secure and free of rancor.\n“There is a lot of improvement when compared with the Feb. 25 Presidential and National Assembly elections.\n“The Independent National Electoral Commission (INEC) should keep to its promise of ensuring all-inclusive election across the country.\n“We were highly disappointed with the way INEC conducted the last elections in which the process experienced a lot of irregularities.\n“Comparing with the current elections, the situation is highly different from the report we are receiving so far across the state,” he said.\nTambuwal further added that if the situation was sustained to the end, the will of the people would truly prevail at the end of the exercise.\n“The election materials arrived most of the polling units in time and so far no issue of BVAS malpractice.\n“However, government needs to ensure the recruitment of more security personnel to address shortage of manpower in the country,” he added. (NAN)\n2:22pm\nResidents Unleash Dogs on Thugs at Lagos Polling Units\n*Police shoot suspected thug\nRebecca Ejifoma\nAgo Palace in Lagos is currently under tension as residents unleashed their dogs to chase away political thugs suspected to be loyal to the ruling All Progressive Party (APC),.\nAlso, police has shot one of the suspected thugs.\nTHISDAY gathered that the Ago Palace residents stood their ground to vote for the candidates of their choice.\nWhile a police van filled with armed officers was seen driving off, the thug shot was left behind gasping for breath on the ground.\n2:10pm\nFormer Osun Governor Gboyega Oyetola, casting his vote during the House of Assembly election, at his polling unit, Ward 01,\nunit 10, Boripe Local Government, Irágbìjí, Saturday\n2:00pm\nOsinbajo, Abiodun, Adebutu, Others Vote, Laud Process\nJames Sowole in Abeokuta\nThe Vice President, Professor Yemi Osinbajo, the Ogun State Governor, Prince Dapo Abiodun, the Governorship candidate of the Peoples Democratic Party (PDP) and other stakeholders have commended the organisation and process of the ongoing Governorship and House of Assembly election in Ogun State, describing it as improvement on the February 25, presidential and National Assembly elections.\nThe stakeholders, spoke shortly after casting their votes at their various units in Ogun State.\nOsinbajo, who voted at VP Unit 14 Ward 1, Ikenne Local Government, described the process as very excellent in his own unit.\nHe said, “My own polling booth here is excellent and i think everything is peaceful and the whole process has been conducted very well and i just hope and pray that this is how it is being carried out across the nation. It has been very pleasant experience that i was able to cast my votes and also so many of us have been able to cast our votes.”\nGovernor Dapo Abiodun of the All Progressives Congress, APC, voted at his Unit 3 Ward 1 in Regun area of Iperu town few minutes after 11.am while Oladipupo Adebutu voted at 10.59am at Ward 5, polling unit 4, Wesley Primary School Iperu.\nIperu is the home town of governor Abiodun of the All Progressives Congress (APC) and Adebutu, who is the governorship candidate of the People’s Democratic Party (PDP) and main challenger of Gov. Abiodun in the governorship race.\nAdebutu described the turnout of voters as impressive and expressed the hope that their expressed wishes would count at the end of the day.\nAlso, the Gubernatorial candidate of the African Democratic Congress (ADC) in Ogun state, Biyi Otegbeye, voted at about 10:01am at the State hospital, Ilaro, Ward 1, Unit 1, in Egbado South Local Government area of the state.\nOtegbeye while speaking with journalists, commended the electoral process, saying that, it is an improvement on what was obtained during the last presidential election.\n“To the glory of God, everything looks peaceful. Everybody is orderly and I can see the excitement and enthusiasm on people to cast their votes.\n“The electoral officers are on duty, they are cautious and everything seems to be going on smoothly at this particular time.\n“What I can see at this stage is that it is much more better than what we experienced during the Presidential election.\nOtegbeye said he was however, optimistic of victory for himself and his party at the poll.\n”I am expecting an overwhelming victory for myself and my party, the ADC”, he added\nAlso speaking, the newly elected senator for Ogun West, Solomon Adeola, commended the Saturday’s election process as a great improvement on the what obtained on February 25.\nMeanwhile, former President Olusegun Obasanjo was conspicuously, absent at his Ward 6 Unit 22, Totoro Abeokuta North Local Government.\nA media aide to the former president, Kehinde Akinyemi, said Obasanjo, has not been in Abeokuta, for over 10 days.\n1:46pm\nSokoto PDP Guber Candidate Votes, Confident of Victory\nThe Governorship Candidate of PDP in Sokoto State, Mallam Saidu Umar has described the l governorship election as a seamless exercise. He made this known while exercising his franchise at Ubandoma Polling Unit 020, Sabon-titi, Kofar Atiku area of Sokoto.\nUmar, while briefing newsmen immediately after casting his ballot, said “so far voting has been going on calmly, and peacefully in the area, and within the metropolitan areas.”\nCommenting on the recently held Presidential and National Assembly elections, Mallam Umar described today’s leg of the election as relatively better than the previous one.\nHowever, the PDP candidate said he remains upbeat about victory, when asked about his expectation at the end of the exercise.\n“The PDP, God willing, is optimistic of victory in the election”, he said\nHe called on eligible voters to come out and vote, and also safeguard their votes.\n1:36pm\nSoludo Lauds INEC for Early Commencement of Voting in Anambra\nDavid-Chyddy Eleke in Awka\nAnambra State Governor, Prof. Chukwuma Soludo, has commended the Independent National Electoral Commission (INEC) for early commencement of the voting process in the state.\nSoludo gave the commendation shortly after voting at Polling Unit 002 Ovuiyi Umueze, Isuofia, Aguata Council Area at 11:30 am\n“From the information available to me, I have sampled views across the state and it seems to be going on fairly well in terms of deployment of logistics and early commencement of election.\n“I think there is a great improvement compared to the previous election in terms of the arrival and deployment of materials. It seems to be going on well, relatively peaceful,” Soludo declared.\nThe governor, who expressed optimism that the will of the people will prevail, also said that the turnout of voters is low compared to the previous election and encouraged Anambra residents to step out and exercise their civic obligations by voting.\n“Anyone who is in the queue before 2:00 pm, will be allowed to vote and your vote will count. We expect the finishing, collation and announcement of results to end with a flourish,” the governor concluded.\n1:35pm\nTambuwal Votes, Confident of PDP’s Victory\nBy Onuminya Innocent In Sokoto\nGovernor Aminu Waziri Tambuwal of Sokoto State has voted at his polling unit.\nTambuwal who voted at his 033 polling unit, Kofar AJia Government Girls Day Secondary School, Tambuwal, a 11:30am was confident of the victory of PDP’s candidate Sa’aidu Umar.\nHe maintained that last month’s presidential and national assembly elections fell short of international electoral standard.\n“Look at last election, no national assembly seat was declared in the state. How can 9 federal house of representatives and 3 senate seats be declared inconclusive?” he asked.\nHe noted that PDP was popular among the people of Sokoto state, stressing the people of the state will massively vote for the party.\nHe however commended INEC for improving on last election, noting that INEC officials arrived polling units early on Saturday compared to last election.\nHe urged l people of the state to come out en mass to cast their votes for the candidate of their choice, saying this election will define their future.\n12:59pm\nEmenike Votes, Confident of Victory, Lauds INEC for Improved Voting ProcessEmmanuel Ugwu-Nwogo in Umuahia\nThe governorship candidate of the All Progressives Congress (APC) in Abia State, Ikechi Emenike, has expressed confidence in emerging victorious in the governorship contest.\n“I’m confident of victory. You can see the mood of voters. We are looking forward to victory by the grace of God by tomorrow,” he said.\nEmenike, who cast his vote in polling unit 11 Umukabia Okpuala at exactly 10:13a.m, told journalists that he was happy with the arrangements put on ground by the Independent National Electoral Commission (INEC) as the voting process was going on smoothly.\n“You can see that the BVAS is working well and I’m sure you can see that quite a lot of people are desirous to vote,” he said.\nHe advised the electorcal umpire “to ensure transparency and fairness to everybody”.\nMeanwhile, the governorship and state assembly election has shown remarkable improvement on the part of INEC as deployment of election materials was done on time.\nIn most polling units monitored at Umuahia North and Umuahia South Local Governments that make up the capital city, voting started on or before 9.00am.\nHowever, the enthusiasm of voters which manifested in the huge turnout of voters very early on voting day during the February 25 Presidential and National Assembly polls was lacking this time around.\nA senior citizen, Chief Orji Ukaonu, said that people have a sense of disappointment over the outcome of the presidential poll and it has dampened their enthusiasm for the governorship and state assembly elections.\n“People were driven by the enthusiasm generated by the candidacy of Peter Obi and they trooped out in large numbers to their polling units as early as 6.30am.\n“But after the result was announced, people were disappointed and unhappy. You can see the effect today as electoral officers are telling ones waiting for voters instead of the other way around,” he said.\nBut a party agent, who gave his name simply as Ukoha, said that it was expected that large number of voters would still turn out to vote “if they hear that the voting process is no more rigorous as it was during the presidential election”.\n12:55pm\nBuhari Votes, Says APC Will Triumph in Governorship, Assembly Polls\n.Asks electorate to vote according to their conscience\n.Osinbajo lauds voting process\nDeji Elumoye in Abuja\nPresident Muhammadu Buhari has predicted victory for the ruling All Progressives Congress (APC) in Saturday’s Governorship and State of Assembly elections across the country.\nAccording to him, Nigerians know the party “means what it says, and says what it means.’’\nSpeaking with newsmen on Saturday after casting his vote at Ward A, Sarkin Yara Polling Unit, 003 in his country home Daura in Katsina state, the President said “I am sure we are going to win, again’’.\nAccording to him: “Nigerians trust us because we mean what we say and say what we mean. We have maintained that trust. We told Nigerians that we will work for them, and we have done our best in education and health facilities, and Nigerians appreciate our efforts”.\nThe President urged the electorate to follow their conscience in choosing right leaders, both state executives and legislatures, admonishing that the era of vote buying had been diminished.\n“I am aware that the money is not there like before for people to sway voters, like they used to do. And if they bring out money now, the people should pocket it, and still vote their conscience,’’ he said.\nPresident Buhari noted that he was not surprised at the results of the Presidential elections on February 25, 2023, which saw Asiwaju Bola Ahmed Tinubu emerging as President-elect, since the APC campaigns were thorough, and detailed.\nThe President noted that the APC followed the constitutional procedure for the entire electoral process, choosing a party Chairman, Sen. Abdullahi Adamu, who had served as a two-term Governor in Nasarawa State, and legislator in the Senate, with an experience that will secure the electoral value and relevance of the party.\nOn deepening of democratic culture and rising awareness among Nigerians, President Buhari said the media had played a major role in empowering people with information on their rights, and providing a platform for voters to challenge leaders on promises and records.\nHis words: “The media is doing very well in creating awareness and enabling the right conversation. You can hear the tough questions for leaders during interviews on TV, radio and other platforms, and the journalists always press for answers”.\nMeanwhile, Vice President Yemi Osinbajo and his wife, Dolapo Osinbajo, on Saturday voted at the Egunrege Polling Unit 14, Ward 1 in Ikenne Local Government Area of Ogun State, expressing satisfaction with the conduct of the election.\nOsinbajo and his wife arrived the polling unit, got accredited and proceeded to cast their votes at exactly 10:34 am.\nSpeaking afterwards with journalists, the Vice President said “from here at my own polling unit, it is excellent. The whole process has been conducted very well and I just hope and pray that this is how it is being carried out across the nation.\n“It has been a very pleasant experience. I am glad that I am able to cast my votes and so many others who want to cast their votes have been able to do so,” he added.\n12:53pm\nObi Votes, Laments Vote Buying, Apathy\nDavid-Chyddy Eleke in Awka\nThe presidential candidate of the Labour Party (LP), Mr Peter Obi, has voted at his Amatutu polling unit in Agulu, Anaocha Local Government Area of Anambra State.\nObi, who cast his vote at about 11.20am, lamented that Nigeria has returned to the era of transactional politics, saying that the ongoing election is witnessing vote buying.\nObi also lamented the low turnout of voters in the state.\nHe said this may be because the people have lost interest in the system.\n12:36am\nNo Police Presence in Most Zamfara Polling Units, PDP Alleges\nThe Zamfara State Peoples Democratic Party has said that there is zero police presence in most of the polling units across the state.\nThe party in a statement through the Dauda Lawal Media Office, Saturday in Gusau, stated that elections were yet to commence in many polling units in the state.\nThe governorship elections were expected to commence early Saturday.\nThough in some states, concerns heightened over alleged moves by governors to rig the elections by all means possible.\nThe statement read: “It is worrisome the situation in Zamfara State at the moment, because elections are yet to commence in most of the polling units across the state.\n“The Police that is expected to provide security for INEC officials, election materials, and voters are nowhere to be found.\n“The Zamfara State PDP is worried and believes that this is a plan by the state government to resort to extra-judicial means to compromise the process.\n“There is already information of thugs attacking voters in Gummi, Zurmi, Bungudu, Mafara, and Shinkafi Local Government Areas.\n“We call on the Inspector General of Police to call the Zamfara state commissioner of police to order. The police should be neutral, not partisan.\n“It is only the security operatives that can thwart the plan to further compromise the electoral officers, thus making the falsification of results much easier than it was in the previous exercise.”\n12:20pm\nLow Turnout as Enugu Residents Elect Gov, State Assembly Members\nGideon Arinze in Enugu\nResidents of Enugu State appear to have lost hope and interest in the conduct of elections given the low turnout of voters that is currently being experienced at the ongoing governorship and state assembly elections.\nThis is unlike the last Presidential and National Assembly elections during which residents of the State trooped out in large numbers to vote, despite threats of sit at home.\nRecall that in some polling units where voting materials did not arrive on time, voters waited for several hours just to exercise their rights.\nHowever, while voting materials arrived on time today and voting commenced early enough, it was noticed in some of the polling units visited that the turnout was poor.\nAt the Central Primary School Ugwuaji and Afor Market Square Polling units, accreditation and voting started at 9am. But only a few voters turnout out. The story is the same across some polling units across the state.\nIt was also noticed that unlike in the last election when residents stayed back in their numbers to count their votes, most of them were leaving as soon as they cast their votes.\nAt the Central Primary School Ugwuaji and Afor Market Square, party agents who spoke to this reporter said that the low turnout being experienced was as a result of the outcome of the last presidential and national assembly election.\n“The outcome of the presidential election, particularly, was not what the citizens expected, one of them said. ” And that is why most of them have decided to stay back since their votes will not count,”.\nSome of those who voted in the last election but didn’t turn up for the state elections also told this reporter that they had lost hope and trust in the capacity of the Independent National Electoral Commission, INEC to conduct free and fair polls.\nAs at the time of this report, voting was still ongoing and no violence has been recorded yet.\n11:27am\nHeavy Security as Voting Commences in Lagos\nSegun James\nAmidst heavy security, voting has commenced in Lagos.\nThe President -elect, Asiwaju Bola Ahmed Tinubu was one of the early voters as he voted at his Alausa, Ikeja polling unit at about 09.40 am.\nGovernor Babajide Sanwo-Olu has just voted.\nTHISDAY Correspondent, who visited Awolowo Way, Ikeja, Agege-Motor Road, Oshodi, Mushin and Lagos Island noticed heavy security presence, made up of men of the Nigerian Army at known flashpoints along the axis.\nThe soldiers were moving in armoured trucks.\n11:23am\nTinubu Votes Amid Heavy Security\nPresident-elect, Sen. Bola Tinubu voted at 9.35 a.m. at Unit 085, Ward 03, Alausa, Ikeja amid tight security in the Governorship/National Assembly elections on Saturday.\nTinubu was accompanied by his wife, Oluremi and the Lagos Market leader, Chief Folashade Ojo.\nMr Dele Alake, his Media Spokesman, told journalists after he voted that the president-elect will not be able to grant interviews till later in the evening.\nThe News Agency of Nigeria (NAN) reports that barriers were used to demarcate the unit into sections and designated areas for voters, journalists and security operatives which is different from the previous situation.\nNAN recalls that during the Presidential and National Assembly elections on Feb. 25, hundreds of journalists and party supporters struggled to capture Tinubu’s arrival and voting.\nINEC officials were early and had completely set up before 8 a.m.\nAt exactly 8.30 a.m, Miss Adebola Adeniyi, the Assistant Presiding Officer III, made announcement, showed empty ballot boxes and the BVAS Machine and read out the election guidelines.\nShe said 324 voters registered in the unit.\nA combined team of Police, Nigeria Security and Civil Defence Corps, DSS, FRSC and Nigeria Immigration Service were on ground.\nThe heads of the various security organisations, including the commissioner of police inspected and patrolled the area before the arrival and departure of the president-elect. (NAN)\n11:16am\nLarge Turnout, Tight Security as Plateau Goes to Poll\nElectoral officers in most polling units across Plateau conducted peaceful accreditations of voters and voting amid huge turnout of voters on Saturday for the state governorship and House of Assembly elections.\nHowever, the News Agency of Nigeria (NAN) reports that voters’ turnout was poor in Jos North Local Government when accreditations and voting had begun in other polling stations.\nSome polling units in Kugiya, Bukuru and Dadin Kowa, in Jos-South began accreditations and votings immediately it was official time for the exercise.\nThe residents in Jos obeyed the restriction directive as most streets in the metropolis were deserted, no traffic and shops were locked up during the elections.\nMost voters commended the officials of the Independent National Electoral Commission (INEC) for arriving in polling stations promptly.\nVoting began as scheduled in polling units 028 (Gut), 024 (Shaka) and 017 (Air force Primary School) all in old Airport Road amid tight security\nPolling units in Kugiya, Bukuru Lowcost and Dadinkowa were set up before 8 a.m. awaiting the official time of 8.30 a.m. to begin accreditations.\nThe Presiding Officer in charge of polling unit 032, in Bukuru Lowcost , Mr Okoi Nsa, said that he and his team arrived as early as 7.15 a.m. to set up the place.\nSimilarly, the Presiding Officer in charge of polling unit 048, Dadinkowa, Miss Blessing Edoh, said that she was at the station as early as 6.30 a.m. to forestall a repeat of the incidence that occurred during the presidential and national assembly elections.\nIn polling units 043 and 006 at Kugiya, Jos South, as the polling units were set and the officers in charge were seen addressing the electorate before the commencement of the voting exercise.\nSome of the electorate who spoke with NAN expressed satisfaction on the prompt arrival of the INEC officials, noting that this would enable the electorate to cast their votes within the stipulated time.\nMrs Garos Pam, an electorate, commended the INEC officials for coming out early as this has enabled her to cast her vote in good time.\nAnother voter, Mr Moses Bitrus, said that because the exercise commenced in time, he spent less than 10 minutes to cast his vote.\nMiss Jummai Dalyop, said that the process this time was less cumbersome as compared to that of the presidential elections.\nAnother electorate, Mrs Joy Jacob said that this process would enable every eligible3 voter to cast their vote as the officials arrived early and the process was better.(NAN)\n11:13am\nAwka Records Poor Voters Turnout\nTurnout of voters in most polling units in Awka and environs for the March 18 State House of assembly election was very low, the News Agency of Nigeria (NAN) reports.\nCorrespondent of NAN who visited some polling units within Awka township reports that electoral officials arrived before 8a.m. in most of the units.\nThe polling units visited include Awka South Aroma 1, PU. 002, Aroma 2, 008, Aroma 3, PU.007, Amudo Hall 2, PU 009, Ukwuorji 5, PU. 006, and Ogbugbankwa PU. 011.\nAlso at Adabebe Amawbia Polling units 1 and 2 Polling, Agu Awka 09 polling units 005 and 0012, the turnout was low, there were presence of security operatives and party agents.\nPastor Emeka Okoli, a voter at Aroma Awka 1 told NAN that the poor turnout was due to the poor handling of the Feb. 25 presidential and national assembly elections.\n“As you can see many people are not here now, by this time during the last election, more than 150 people were already here.\n“For people to show up in their numbers in future elections, INEC must make sure they stick to the rules”, he said.(NAN)\n11:10am\nAPC, PDP Agents Kick as Materials Arrive Bauchi Ward Late\nAgents of All Progressives Congress (APC) and the Peoples Democratic Party (PDP), on Saturday, decried late arrival of INEC officials and materials at Haruna Memorial Primary School ward 029,\nThe ward is in Alkaleri Local Government Area of Bauchi state.\nSpeaking with newsmen, Mouktar Gidado, the PDP observer at the polling unit said he arrived at the venue exactly at 8am when election materials should have arrived.\n“However, I don’t know why the materials arrived at 9:20am and voting has not yet commenced though the electoral officers are on ground now.\n“I want to appeal to INEC that there should be a departure from late arrival of election materials. It is 9:30am and voters are still waiting”, he said.\nGidado, who is also the Special Adviser on Media and Publicity to Gov. Bala Mohammed of Bauchi State , said apart from the late arrival of election materials, everything was going on smoothly at the polling unit.\nAlso speaking, Abdullahi Gidado, the All Progressives Congress (APC) party agent at the polling unit, decried the late arrival of election materials.\nHe said some voters wanted to return home but he convinced them to stay.\n“We have been waiting since 8am and they arrived at 9:20am. We hope that the election will commence soon as they have already set up the polling unit.\n“Apart from the fact that INEC officials arrived late, there is no other issue here,” he said.\nThe News Agency of Nigeria (NAN) reports that as at 10am, election had not commenced at the polling unit. (NAN)\n11:08am\nVoting Starts Early in Nasarawa\nElection officials arrived early for the Governorship and State Houses of Assembly elections in Motor Park 001 and 002 Polling Units Gudi, Akwanga Local Government Area (LGA), Nasarawa State.\nThe News Agency of Nigeria (NAN) reports that the polling units visited by its Correspondent, accreditation and voting began simultaneously at exactly 9:08am.\nNAN also reports that Officials of the Independent National Electoral Commission (INEC) arrived most polling units around 8:30am and set up the place for voting.\nSecurity agencies such as Nigeria Police, Nigeria Immigration Service and Nigeria Security and Civil Defence Corps were present at the polling units to ensure security and to check vote buying. (NAN).\n11:02am\nMaterials Arrive, Voting Commences Early In Eket\nElectoral materials arrived early in polling units in some parts of Eket Local Government Area of the state for governorship and House Assembly elections.\nMr Solomon Daudo, Polling Officer said that electoral materials arrived at Unit 18 one of the wards in Ward 4 Urban, Primary School Atai Ndon at7:20 a.m on Saturday\nThe News Agency of Nigeria (NAN) reports that Wards 4 Urban comprises five units which are units 3, 4, 17, 18 and 19.\nDaudo said that everything was in place, as they were waiting for INEC authorisation to commence the election.\nMrs Dorathy Imoh, the polling officer said that electoral materials arrived polling units at 7:30 a.m.\nShe also that the security officers and party agents of different political parties were all on ground.\nMr Joseph Ekaette, Senior Polling Officer, (SPO) said electoral materials arrived Registration Area Technical Support (RATECH) centre Ikot Ibiok last night and distributed the materials before 7:30 a.m.\nNAN reports that voting later commenced by 8:30 a.m. (NAN)\n10:58am\nLarge Voter Turn-Out in Kano Amidst Tight Security\nA huge turnout of voters is being witnessed in the Governorship and House of Assembly elections in Kano as people troop out to exercise their franchise.\nThe News Agency of Nigeria (NAN) reports that voters, especially in parts of Municipal and Nasarawa Local Government Areas thronged their polling units as early as 7 a.m.\nThe election personnel and materials also arrived as early as 8 a.m. to various polling centres especially at the Emir’s Palace, Kwalli Police Station, School For Arabic Studies and the Old Kano State Library.\nOther polling units that witnessed the development were those located in Gidan Makama Primary School, Unguwar Gini Comprehensive Health Centre, Magwan Primary School and Government Junior Secondary School, Race Course.\nSimilarly, security was tight in all the areas visited with military personnel, the Police, Civil Defence, FRSC and other operatives manning major streets and screening people as they approached the polling stations. There was also compliance to the order restricting movement of unauthorized vehicles in the city with the streets virtually deserted.\nShops, shopping malls, restaurants and other places of human endeavour remained closed in compliance with the police order.\nNAN also observed that voter turnout was impressive as people came out early to cast their votes under a conducive atmosphere. (NAN)\n10:55am\nLarge Turnout of Voters in Mafa, Zulum’s Hometown\nThere is large turnout of voters in Mafa, hometown of Gov. Babagana Zulum of Borno, as accreditation and voting in the March 18 governorship/state assembly elections start.\nMafa is the headquarters of Mafa Local Government Area of Borno, about 35km from Maiduguri.\nThe News Agency of Nigeria (NAN) correspondent monitoring the exercise ine Mafa, reports that accreditation and voting started on time in most polling units in the town.\nSome of the voters who spoke to NAN said the turnout was unprecedented compared to the last election because of improved mobilisation.\nBulama Abubakar, said after casting his vote that ”we trooped out to cast our votes in support of our son, Prof. Zulum because he is seeking reelection.”\nHe commended the early arrival of officials and election materials at many polling units in the town which he said was a big improvement to the Feb. 25 presidential and National Assembly elections.\nAlso, Aisha Modu and Mustafa Lawan, said the large turnout was in solidarity for their son.\nNAN correspondent who also monitored the exercise in Jere Local Government Area, however, reports that many voters were still waiting for arrival of officials and materials in some polling units in the area.\n“It is already 9.30 a.m. but we are still waiting for the officials to come,” said Abubakar Ibrahim, a voter at a polling unit in Mairi ward of Jere LGA. (NAN)\n10:49am\nPolice Arrest Armed Thugs in Anambra\nDavid-Chyddy Eleke in Awka\nThe Anambra State Police Command has arrested five persons suspected to be thugs, mobilized to disrupt elections in the state.\nAccording to a short text message from the command’s spokesperson, DSP Toochukwu Ikenga, the men were arrested in Ihiala, with four pump action rifles recovered from them.\nIkenga said: “Five armed thugs were arrested in Ihiala and four pump actions recovered.”\nCP Aderemi Adeoye, who is heading the command’s personnel on election duty, was also quoted to have said that thuggery will not be allowed during the election.\n10:09am\nGo Out and Vote, Adeleke Calls on Osun Residents\nYinka Kolawole in Osogbo\nThe Governor of Osun State, Senator Ademola Adeleke, has called on residents of the state to go out and cast their vote, assuring them of safety and security.\nSpeaking early Saturday morning at his country home in Ede, the governor said:\n“You are still at home? Come out now and use your PVC as a democrat. It is safe outside. Exercise your right to vote and be voted for.\n“Don’t be scared to abandon your right to vote. Security agencies are in top form to ensure that your vote and my vote count. I have issued relevant directives to service commanders to secure lives and properties as we all vote today.\n“I need you good people of Osun State to vote massively. If you love democracy and good governance, stand up now and face your polling units.”\n10:03am\nHigh Turn-out of Voters in Osogbo Metropolis\nYinka Kolawole in Osogbo\nThere is high turn-out of voters in the governorship and state Assembly elections in Osogbo metropolis in Osun State, while security personnel are also present to maintain law and order.\nA chieftain of the All Progressives Congress (APC) in the state, Musbaudeed Ayodele Kusamotu, who spoke with THISDAY, urged the Independent Electoral Commission (INEC) to ensure free and fair polls.\nHe advised voters to be mature in the course of the exercise and avoid trouble.\nVoting is already in progress in some wards with security personnel on ground to provide adequate security for voters.\nSome of the wards visited are wards 3 unit 8 in Osogbo Local Government, wards 3 unit 3 Agana in Olorunda Local Government, Ward 1 Ataoja A, unit, polling unit 3 and ward 4 Fagbewesa, Osogbo.\n9:42am\nLow Turnout of Voters in Anambra\nDavid-Chyddy Eleke in Awka\nThere is a low turnout of voters in Anambra State in 5oday Assembly election, compared to the large number of people that thronged polling centres for the Presidential election three weeks ago.\nPolling centres visited in Awka, the state capital, showed near empty units as staff of the Independent National Electoral Commission, INEC, sat idly.\nAt Aroma junction 1, polling unit 008, Awka South Local Government Area, as at 9:20pm, only six persons had been able to vote, despite the commencement of voting at 8:30am, and the swiftness of the BVAS machines.\nA voter, Mrs Chika Ndu told our correspondent that: “People are not coming out because they feel their votes may not count because of what happened last three weeks.\n“It will take a level of enlightenment for people to accept to come out, because they believe their votes will not count.\n“I cannot believe that this same place where I found it difficult to cast my vote last three weeks, I can just come in and in less than three minutes, I had cast my vote.”\nAnother respondent, a journalist, Mr Damian Egwuonwu, said: “I think it is early, people will still come out.”\n9:35am\nPolling Units Open Early in Minna\n* Agents absent in centres visited\n* Poor voter turnout\nLaleye Dipo in Minna\nOfficials of the Independent National Electoral Commission INEC opened the various polling units in Minna the Niger state as early as 8am.\nHowever party agents were absent at the polling units visited as at 8:45am, resulting in polling not commencing.\nAt Umoru Audi primary school, polling officials arrived at 8am to set up for the election with only about 10 voters around.\nAll party agents were absent at the unit, so polling could not start .\n“We are waiting for the agents, even if we have one agent we will start, Aliyu, a polling official said.\nIn other areas, polling started at 8.30am but with few voters on the queue.\nTHISDAY observed non compliance with restriction of movements ordered by the police.\n9:31am\nVoting Commences in Anambra\nDavid-Chyddy Eleke in Awka\nVoting has started in Anambra State for the House of Assembly elections.\nPolling centres visited by THISDAY within Awka, the state capital showed that as early as 8:30am, most of the centres visited had started voting.\nThe state Resident Electoral Commissioner Mrs Elizabeth Agwu had in a press conference on Friday said that the commission was ready, and that voting would start early.\nObservation also showed that the BVAS had been very swift in capturing voters.\n8:47am\nAccreditation, Voting Commence in Sokoto\nBy Onuminya Innocent In Sokoto\nVoters in Sokoto State came out as early as 6am in to queue at polling units as they awaited the arrival of electoral officials.\nAccreditation and voting commenced at 8am\nat Gwiwa extension, behind Umaru Ali Shinkafi Polytechnic, College of Administration .\nA voter Murtala Yakubu told our correspondent that he was eager to elect who will pilot the affairs of the state for the next four years.\n8:42am\nINEC Disowns Fake ID for Security Personnel on Election Duty\nThe Independent National Electoral Commission (INEC) has distanced itself from a fake identify card for security personnel on election duty.\nThe commission did this in a statement by its National Commissioner and Chairman, Information and Voter Education Committee, Festus Okoye, in Abuja.\nOkoye said INEC’s attention had been drawn to an identity card for security personnel bearing the name and logo of the Commission with the inscription “Complete Access” boldly written in red at the bottom of it.\n“We wish to state categorically that the identity card did not emanate from the Commission. Identity cards for security personnel on election duty were issued by the security agencies and not the Commission.\n“Anyone bearing an identity card allegedly issued by the Commission for security personnel can only be on illegal duty. Such a person is liable to arrest and prosecution.\n“The public Is alerted to this diabolical action of some misdirected elements and to report any such person to the security agencies,” Okoye said.(NAN)\n7:03am\nTension As 28 States Elect Governors\n•Lagos, Kano, Kaduna, Oyo, Sokoto, Delta, Rivers, Benue, Plateau are battle grounds\n•993 state assembly seats also to be filled today\n•INEC promises uploading of results from polling units to Result Viewing Portal real time\nAhamefula Ogbu\nVoters in 28 states across Nigeria will today file out to elect governors who will run their affairs for the next four years, effective May 29.\nThere will also be voting into 993 state assembly seats across the 36 states of the federation in this rescheduled governorship and state houses of assembly elections.\nThe Independent National Electoral Commission (INEC), after a slipshod performance at the Presidential and National Assembly elections on February 25, largely due to failure to transmit and collate results electronically as assured, promised an improved performance today.\nINEC’s Chairman, Prof. Mahmood Yakubu vowed that today’s polls will be free and fair.\nYakubu urged parties and candidates to speak to their agents and supporters to see the elections as a contest and not war and to “refrain from acts of violence that may mar the elections or compromise the security of our personnel, observers, the media and service providers.”\nBy yesterday morning, INEC had concluded the distribution of sensitive materials for the governorship and house of assembly elections to all the wards.\nINEC Promises to Upload Results Real Time\nYesterday, INEC gave an insight into how polling unit results will be transmitted during today’s governorship elections.\nThe Chairman, Information and Voter Education Committee of INEC, Festus Okoye, while speaking on Arise News said “the law as of today prescribes a dual mode of either transmission of results or transfer of results.”\nHe said when polls closed at the level of the various units, the Presiding Officer who superintended the polling unit would enter the scores of the various political parties in form EC8A which is the polling unit level result.\n“The PO will sign that particular result sheet and stamp it, the PU agent or party agent if available will also countersign and copies will be given to them and the police.\n“That original result is what will be scanned and uploaded to our INEC Result Viewing Portal for public viewing. Not only that, the accreditation data that has arisen from that polling unit will also be uploaded, but the physical result and the BVAS itself will also be taken to the Registration Area Collation centre,” said Okoye.\nAccording to him, the Collation Officer will have the benefit of seeing the original results and the BVAS itself and have the benefit of looking at the accreditation data as transmitted, and the result sheet as transmitted from the polling unit.\n“That is the dual mode which the law has prescribed for the commission and that is the mode that we’re going to use for the purpose of this election,” said Okoye.\nSpeaking on real-time IREV delivery on Saturday, Okoye said results would be transmitted as soon as the polls closed from various polling units.\n“The commission is determined to improve on its previous performance. What we have done is to learn valuable lessons from previous elections that we conducted, and we’re going to put those lessons into our planning purposes and processes, and into our deployment purposes,” Okoye said.\nOn INEC’s readiness, he said, “In all the states of the federation, both the Bimodal Voter Accreditation System machines and all the sensitive election materials have left the Central Bank and the various state offices of the federation.\n“We want to ensure that all polling units open on time. Secondly, we made sure that we reconfigured all the BVAS that will be used for this particular election in terms of making sure that the BVAS perform optimally and also making sure that some of the challenges we had in the previous elections do not reoccur.”\nPolice Pledge Tight Security\nThe Inspector-General of Police, Usman Baba, is deploying over 400,000 officers and men for today’s operation.\nBaba, who urged voters to come out and vote without fear, promised tight security.\nHe has also ordered the restriction of all forms of vehicular movement on roads, waterways, and other forms of transportation, from 12 am to 6 pm on Saturday in all states where elections will be conducted.\nBaba said those on essential services such as officials of INEC, electoral observers, accredited media and observers, ambulances responding to medical emergencies, firefighters, amongst others are exempted from the restriction.\nHe noted that the directive excludes the Federal Capital Territory, as no election is being conducted therein.\nThe IGP reiterated the ban on all security aides to VIPs and escorts from accompanying their principals and politicians to polling booths and collation centres during the election.\nState-established and owned security outfits/organizations, quasi-security units, and privately-owned guard and security outfits are also barred from participating in election security management.\nThe IGP has also extended additional human and logistic support to police commands and formations across the country for effective election security management today.\nThe additional support includes the deployment of personnel, operational vehicles, non-lethal weapons, personal protective equipment (body armour), and anti-riot equipment among others.\nGubernatorial Battlegrounds\nAbia State\nIt’s a three-horse race in God’s own State. Incumbent Governor Okezie Ikpeazu of the PDP is pushing for his former Chief of Staff, Okey Ahiwe to succeed him.\nThis appears to be in danger because of Ikpeazu’s poor performance in the last eight years.\nThe bad situation is at a boiling point in this state. Teachers and civil servants are owed backlog of salaries, pensioners not paid, tertiary institutions losing accreditation, and all forms of development arrested, while political office holders and their families flourish.\nThis anger of the masses has already claimed the ambition of the Ikpeazu who desired to retire to the Senate but was trounced at the polls.\nThe PDP has Alex Otti of the LP and Ikechi Emmenike of the APC to contend with. The LP has upset the apple cart in several states and Otti who is riding the crest of the euphoria appears set to clinch the prize in Abia State. Emmenike of the APC will no doubt give him a good fight. It’s too close to call here.\nEnugu State\nThe state parades an array of strong contestants with front runners being Peter Mbah of PDP, Chijioke Edeoga of Labour Party and Frank Nweke of APGA.\nMbah enjoys a broad spectrum of support from political bigwigs in the state and with the state treasury at his disposal, being the candidate of the sitting governor and the state being a PDP state for long, Mbah who also parades a personal war chest will give a good fight.\nHowever, Edeoga of the Labour Party might ride on the back of the tsunami sweeping through the political space, added to the sympathy of having their senatorial candidate murdered, to clinch the coveted seat, especially as the Labour Party is wearing the messianic toga now.\nFrank Nweke, who even some “Obidients” favour because of his past records, is also a strong contender which also makes the state a battleground, especially as the state is known for its violent disposition of some old politicians. Allegations of arms stockpiling is already rife and it will be a tough fight between PDP struggling to retain the state and LP/APGA bent on wresting it from them.\nKano State\nThis is an APC state with a gladiator in the person of Rabiu Kwankwaso that has moved to the New Nigeria Peoples Party (NNPP) and Governor Abdullahi Ganduje of APC, though none of them is on the ballot.\nWhile Kwankwaso who swept the presidential ballot in Kano is supporting Abba Yusuf, Ganduje is backing Yusuf Gawuna.\nThe candidates of the governor and Kwankwaso are not only contesting but there is an ego war of who has the bragging rights over the state. Kano State is too close to call. The prize can go either way.\nBenue State\nThere is a marked departure from the past as a Catholic Priest, Father Hyacinth Alia, contesting under the APC, survived all intrigues to hold on to the ticket, while Herman Hembe latching on to the Labour Party’s acceptance to struggle to be elected governor to succeed Samuel Ortom, one of the G5 governors that bloodied the nose of their party over power shift to the South.\nOrtom, who lost his senatorial election, would strive to ensure his candidate of the PDP, Titus Uba wins, so there won’t be a double loss of his seat and that of his successor. Allegations of arming youths to steal mandates are rife in Benue. It’s a three-horse race here and too close to call.\nEbonyi State\nSince Governor Dave Umahi moved over to the APC on account of complaints of inequity in PDP, Ebonyi was suddenly racked by spates of violence and the governor is one to ram through his wish on issues of interest.\nSo, it is expected that he may, against all odds, do everything he can to deliver Mr. Francis Nwifuru to succeed him.\nUmahi however has Chief Francis Odii of the PDP to contend with in a predominantly PDP State before Umahi jumped ship.\nOn the shadows to spring surprises might be Labour Party’s candidate, Chief Edward Nkwegu who is riding on the back of Peter Obi and his Obidients. As usual, violence will make or mar the outcome of the contest. Nwifuru of the APC may pick this ticket.\nRivers State\nOld rivalries have been rekindled as former governor Rotimi Amaechi and incumbent Governor Nyesom Wike have squared up again with their support for candidates of their parties and brickbats are flying, often leaving issues to attack personalities.\nWike is pushing Similaye Fubara for his party, PDP, which he had campaigned vigorously against in the presidential election over the sharing of party positions, while Amaechi came back in full force leading the campaigns for APC, which fortune had dwindled with exit of many members over choice of candidates, with his candidate, Tonye Cole.\nThe presidential election saw a lot of violence when their direct interests were not at stake, and this signposts what will happen today. Candidates were attacked with dynamites and guns during campaigns so worse would be expected today as Wike will struggle to break the jinx of Rivers State governors not being able to determine their successors.\nSenator Magnus Abe of Social Democratic Party (SDP) is also in the race and can make the contest to go anyplace.\nOyo State\nIt is going to be a straight battle between incumbent Seyi Makinde of PDP and Teslim Folarin of APC.\nMakinde, being a G5 member that dared the party, is not enjoying the backing of some of Oyo PDP big wigs.\nEven with being an incumbent, with some of the parties collapsing their structure for him, Makinde still does not have that edge. Folarin is looking good for the Oyo State governorship.\nPlateau State\nWith Governor Simon Lalong’s failure to grab his senatorial seat, his quest to determine who takes over from him has become a serious agenda.\nSo far, his candidate, Dr. Nantwe Yilwada of the APC has Caleb Muftwang of PDP and Yohanna Margif of Labour Party to slug it out with, given their performances during the presidential elections. Margif has been bogged down by court orders which were cleared a few days ago.\nWith the backing of the incumbent governor, APC will strive to retain the state which has been a core PDP state till Lalong took it to APC.\nAlso, the general acceptance of the Labour Party in Plateau and the performance of its presidential candidate in the last election may throw up some upsets in favour of the Labour Party. Muftwang looks determined to return Plateau to the PDP. But anything can still happen in Plateau State today.\nLagos State\nThe loss of Lagos by the APC to little known LP in the Presidential election threw up a gamut of variables which sent strategists hurrying back to the drawing board.\nWhereas Lagos was seen as tug of war between the APC and their usual PDP, what could be a rib excised from PDP ended up causing an upset that has made the poster boy of Lagos, Governor Babajide Sanwo-Olu to start losing sleep due to the possibility of Gbadebo Rhodes-Vivour of the LP upstaging him.\nThis factor has seen a flurry of activities in churches, football stunts and visits to places that ordinarily would not be contemplated.\nLater statements by Rhodes-Vivour that he was going to open the account books of Lagos for people to see how funds of the state had been applied will definitely lead to a do or die contest. Moreso, when it comes with the threat that may smear reputations. The heat is already on in the state with threats of Oro cult and warnings to non-Yorubas not to rock the boat.\nDelta State\nAs for Delta State, apart from being the sitting Governor, Ifeanyi Okowa was also Atiku’s running mate, and the least expected from him was to deliver maximum votes in the Presidential election. However, he managed to garner 161,600 votes, trailing the LP by a distance.\nOkowa will be fighting today to take his preferred candidate, Sheriff Oborevwori, to the Delta State Government House, Asaba.\nApart from the rising popularity of the Labour Party, Okowa also has the candidate of the APC and Deputy Senate President, Ovie Omo-Agege to contend with.\nWith PDP chieftains, including the former governor of the state, James Ibori, and Senator James Manager both working at cross purposes with the Okowa administration, it would be interesting to see which of the parties have the last laugh today. It’s a three-horse here.\nSokoto State\nGovernor Aminu Tambuwal of Sokoto State may have won the North-west state for Atiku and his PDP in the February 25 presidential election. Yet, a dark cloud of uncertainty hangs over the governorship election. Today’s voting will be a keenly contested poll between Saidu Umar of the PDP and the APC’s Ahmad Aliyu. The race is too close to call in Sokoto State.\nKaduna State\nIn Kaduna State, Governor Nasir el-rufai will require a miracle to determine his successor.\nEl-rufai and the APC were badly trounced in the February 25 Presidential and National Assembly elections by the PDP, making today’s election a tough one for his favoured Ubah Sani. Isah Ashiru of the PDP will give el-rufai’s man a good run for his money. Victory can go either way. The race is too close to call in Kaduna State.",
  "word_count": 37652,
  "scraped_at": "2026-02-14T11:59:21.612008"
}