{
  "article_id": "0afbfb92eca2",
  "url": "https://www.healio.com/news/orthopedics/20240614/change-the-game-injury-challenges-in-female-athletes",
  "title": "Change the game : Injury challenges in female athletes",
  "date": "20240623T033000Z",
  "domain": "healio.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Change the game: Injury challenges in female athletes\nSince the passage of Title IX of the Education Amendments Act of 1972, participation of women in sports has steadily increased.\nAccording to a 2022 report from the Women’s Sports Foundation, the percentage of girls participating on high school varsity teams increased from 7% in 1972 to 43% in 2018 to 2019, the most recent reporting year. The report also noted the percentage of women competing on college teams increased from 15% in 1972 to 44% during the 2020 to 2021 academic year.\nDespite an increasing number of women in sports, inequalities still exist not only in participation opportunities but in research of injuries and care of female athletes, as well. A study by Ryan W. Paul, BS, and colleagues in The American Journal of Sports Medicine in 2023 showed 70.7% of 669 studies published from 2017 to 2021 in six top sports medicine journals isolated results for male athletes, 8.8% of studies isolated results for female athletes and 20.5% of studies evaluated male and female athletes. While female athletes were more frequently studied in softball and volleyball, researchers found male athletes were more commonly studied in basketball, soccer, rugby, hockey, Australian football, baseball and American football. Male athletes were also favored in the four major coed sports with large sample sizes: soccer, rugby, basketball and baseball/softball.\n“Medicine, in particular orthopedics and sports medicine, historically is a male-dominated field and most of the research has been done on male sex subjects, whether that includes animal studies looking at mice, rabbits or goats, or historical sporting studies looking at humans,” Rachel M. Frank, MD, associate professor in the department of orthopedic surgery at the University of Colorado School of Medicine, told Healio | Orthopedics Today. “Most of the early research was done on athletes who participated in sports, and most of the earlier studies before the 1970s — before Title IX — were of male athletes. Then people have simply taken the results from that data and those studies and extrapolated those to the female athlete.”\nHowever, all data from men cannot be extrapolated to fit female athletes, according to Frank, a Healio | Orthopedics Today Editorial Board Member.\n“Some things are similar in that an ACL tear is an ACL tear. But how we do the surgery and how we rehab the patient may differ in the male vs. female athlete,” she said. “What graft we select or the surgical decision-making that we do based on the patient’s baseline hyperlaxity, which more often is in females than males, may impact what we do and how we do it.”\nMultidisciplinary care\nOne defining factor between male and female athletes is that women are more likely to require multidisciplinary care, according to Miho J. Tanaka, MD, PhD, director of the women’s sports medicine program at Massachusetts General Hospital and associate professor at Harvard Medical School. This may include a nutrition evaluation, consideration of hormonal influences or screening for symptoms that may warrant a referral to a sports psychologist.\n“We know from studies that women are more likely to have non-orthopedic factors that can play into the management of their orthopedic injuries and we, as orthopedic surgeons, are not specifically trained to manage endocrine problems, nutrition and/or eating disorders,” Tanaka told Healio | Orthopedics Today.\nShe said the purpose of most women’s sports medicine programs is to provide comprehensive care by involving specialists from other departments to “weigh in on some of these aspects that can influence the musculoskeletal care of the female athlete.”\n“The challenge is being able to treat the athlete as a whole, when many of us are trained only in musculoskeletal health. But with the resources and expertise available through these multidisciplinary programs, we can continue to fill clinical gaps and further our knowledge to develop improved clinical guidelines,” Tanaka said. “Instead of fragmenting care by making it an ‘orthopedic’ vs. ‘non-orthopedic’ issue, we can coordinate and address all relevant aspects of care to formulate a patient-centric treatment plan.”\nSurgery, rehabilitation\nAbigail Campbell, MD, MSc, director of the Center for Women’s Sports Medicine at NYU Langone Orthopedics, said surgeons should have different surgical considerations between men and women.\n“We should not be fixing every single ACL in the same knee flexion angle. If a dancer or female who hyperextends gets an ACL surgery done in the same way that a male athlete does and they lose that hyperextension because of the technique used, they are going to be unhappy,” Campbell told Healio | Orthopedics Today. “You should be treating that patient a little differently and paying attention to their baseline mobility, what their other knee looks like and adjusting the surgical technique.”\nRehabilitation also needs to be considered as women may take longer than men to return to sport after surgery due to longer muscle recovery, according to Campbell.\n“When we are rehabbing [ACL] injuries in female athletes, you need to focus on the mechanics, not just work on your quad,” she said. “How are you jumping? How are you running? How are you landing? [This is] to make sure things do not take longer or potentially even retear.”\nACL injuries\nSome injuries are also more common among female athletes than male athletes. According to Mary K. Mulcahey, MD, women have about an eight times higher risk for suffering an ACL tear compared with men, which is due to modifiable risk factors. Mulcahey said women have quad-dominant deceleration, which means as female athletes slow down the quads are activated, which in turn pulls the tibia anteriorly and places stress on the ACL.\n“The other related problem is that female athletes do not have strong hamstrings, so the hamstrings cannot counteract the pull of the quads,” Mulcahey, chief of sports medicine in the department of orthopedic surgery and rehabilitation at Loyola University Medical Center and director of the women’s sports medicine program, said.\nWomen also tend to have a valgus landing pattern and land with stiff knees and hips, which can also put a lot of stress on the ACL, she said.\nIn addition, Gabriella E. Ode, MD, sports and shoulder surgeon at Hospital for Special Surgery, said non-modifiable risk factors, such as the width of the pelvis, angle of the knees and muscle balance, can put women at a higher risk of ACL tears.\n“There are some studies that say there might be a predisposition during certain times during their menstrual cycle that they are more prone to injury that can contribute [to ACL tears],” Ode told Healio | Orthopedics Today. “There is a complex interplay as to why but, certainly, the highest risk category for an ACL tear is going to be a female athlete who participates in a cutting-and-pivoting sport, like soccer, basketball, etc.”\nOther common injuries\nThe anatomy between the hip, knee and ankle can also predispose women to higher rates of patellofemoral pain and instability, according to Campbell.\n“Female hips tend to be wider, and that puts a different force on the kneecap in females compared to males and also that underlying potential ligamentous laxity that females have more than males,” Campbell said.\nMulcahey said relative energy deficiency in sport (RED-S), formerly known as the female athlete triad, can also contribute to stress fractures among female athletes. RED-S starts with low energy availability and leads to irregular menses, which impacts the bone, contributing to stress fractures, stress reactions and, ultimately, low bone density.\n“The underlying issue is not having enough energy to account for the amount that is being expended,” Mulcahey told Healio | Orthopedics Today. “That, oftentimes, is not purposeful. It is more that a lot of times as athletes are working out and expending so much energy they do not realize what they are supposed to be eating to help balance that. As a result, female athletes, especially in sports like cross country where they are running a lot and they have a low body mass by nature, are at a high risk for developing stress fractures.”\nInjury prevention\nTo reduce the risk of injuries in all athletes, a variety of injury prevention programs have been developed by different entities, according to Frank. One of the most utilized injury prevention programs is for ACL injury prevention for sports that involve cutting, pivoting, jumping and landing, which Frank said emphasizes 15 to 20 minutes of dynamic warm-up before training or starting a match.\nStress fracture prevention includes raising awareness about risk in certain populations, according to Mulcahey. She added that a sports nutritionist or a dietician can be involved to track energy expenditure and address the importance of energy availability before it becomes a problem.\n“Other things that can contribute [include] making sure [athletes] have the appropriate shoe wear, that they are training on the right surfaces, that they are not always running on hard surfaces, that vary running surfaces (eg, grass or a track or something that has more of a cushion),” Mulcahey said.\nChallenges in injury prevention\nHowever, a challenge with implementing injury prevention programs is “getting buy-in from coaches, family and athletes about the value and efficacy” of these programs, according to Mulcahey.\nFrank said injury prevention programs also consume a lot of time and resources and may be challenging to implement in lower socioeconomic environments where there may be one athletic trainer available for a high school with four or five or more different sports in a season.\n“We have a strategy, we have a vision, but accomplishing the task is a little bit more difficult,” Frank said. “There are good data to show that prevention programs help. That said, nothing is foolproof. There are still going to be ACL tears, unfortunately. There are still going to be injuries but, certainly, prevention programs help at reducing the rate of these injuries and, in particular, in our young female athletes.”\nContinued research\nAs sports medicine research continues to advance, Mulcahey said it is important to evaluate and report outcomes of female and male athletes separately.\n“The biggest area where we could have improvement is making a point to specifically evaluate the injuries in our male and female athletes, their outcomes, how do they do separately and does that, in turn, impact how we need to treat them or what we need to do postoperatively,” Mulcahey said.\nIn addition, Frank said it is important to understand the factors that play into injury prevention and sport performance.\n“The other side to all of this is not just injuries, it is performance and how can we optimize performance even in the uninjured athlete. Are there nuances to that in the female athlete? There probably are,” Frank said. “Looking at whether it is electrolytes, hormones, nutritional factors and/or different parameters in blood work and how can we optimize those for injury prevention, injury treatment, surgical recovery and, ideally, sports performance is important.”\nOptimize performance\nAlthough there are prevention strategies described for ACL tears, there are not as “clear-cut prevention strategies in place for stress fractures, as well as patellofemoral instability,” according to Ode. She said it is important to understand how strength, conditioning and optimization of performance correlate and influence injuries in female athletes.\n“Most of the literature that is out there in terms of nutrition, physical therapy and injury prevention uses cohorts of male athletes and there is a large number of them that do not have any female athletes in the studies at all,” Ode said. “Having studies that, at the very least, put forth the effort to include female athletes to understand if there are sex differences in treatment is probably, at the ground floor, the most important thing that we can start with because otherwise, we do not understand what the problems are.”\nSimilarly, Tanaka said it is important to identify how nutrition and hormones can affect surgical outcomes and whether those factors should be taken into consideration at the time of surgery. She said by having open communication with a multidisciplinary team, surgeons will be able to study and advance the standard of care in order to make better decisions for each patient individually, especially as female athletes and the sports they play continue to change.\n“It is not just the increasing number of female athletes that we are seeing that makes this a relevant topic, but the fact that our understanding of the female athlete is changing. The types of sports that they are playing, the ways in which they are playing sports [and] the opportunity women have within the field of sports is rapidly evolving,” Tanaka said. “That is what makes this topic important, but also challenging. The data that were relevant 10 years ago, 20 years ago may not be relevant today and could be very different 10 years from now. There is a great need for us to keep up with the changing times in order to be able to provide the best care for our female athletes.”\n- References:\n- Anderson N, et al. BMJ Open Sport Exerc Med. 2023;doi:10.1136/bmjsem-2023-001606.\n- Devana SK, et al. Curr Rev Musculoskelet Med. 2022;doi:10.1007/s12178-021-09736-1.\n- Emmonds S, et al. Sports Med Open. 2019;doi:10.1186/s40798-019-0224-x.\n- Fifty years of Title IX: We’re not done yet. https://www.womenssportsfoundation.org/articles_and_report/50-years-of-title-ix-were-not-done-yet/. Published May 4, 2022. Accessed April 17, 2024.\n- NCAA demographics database. https://www.ncaa.org/sports/2018/12/13/ncaa-demographics-database.aspx. Published October 2023. Accessed April 17, 2024.\n- Paul RW, et al. Am J Sports Med. 2023;doi:10.1177/03635465221131281.\n- Sonnier JH, et al. Am J Sports Med. 2023;doi:10.1177/03635465221128909.\n- Wallis CJD, et al. JAMA Surg. 2023;doi:10.1001/jamasurg.2023.3744.\n- Whitaker J, et al. Arthrosc Sports Med Rehabil. 2023;doi:10.1016/j.asmr.2023.04.018.\n- Zhang L, et al. J Pain. 2021;doi:10.1016/j.jpain.2021.03.001.\n- For more information:\n- Abigail Campbell, MD, MSc, of NYU Langone Orthopedics, can be reached at marlene.naanes@nyulangone.org.\n- Rachel M. Frank, MD, of the University of Colorado School of Medicine, can be reached at rachel.frank@cuanschutz.edu.\n- Mary K. Mulcahey, MD, of Loyola University Medical Center, can be reached at mary.mulcahey.md@gmail.com.\n- Gabriella E. Ode, MD, of Hospital for Special Surgery, can be reached at caccian@hss.edu.\n- Miho J. Tanaka, MD, PhD, of Massachusetts General Hospital and Harvard Medical School, can be reached at mtanaka5@mgh.harvard.edu.\nClick here to read the Point/Counter to this Cover Story.",
  "word_count": 2354,
  "scraped_at": "2026-02-14T12:08:03.669892"
}