{
  "article_id": "0afc7cf0ec91",
  "url": "https://www.redbrick.me/carla-ward-bids-farewell-to-aston-villa-women/",
  "title": "Carla Ward Bids Farewell To Aston Villa Women",
  "date": "20240620T160000Z",
  "domain": "redbrick.me",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sport Editor Lucy Blitz reports on Carla Ward’s Villa departure and what legacy she leaves behind at the Midlands club\nWhen the last whistle blew at Villa Park in mid-May to draw the Women’s Super League season to a close, tears fell throughout the Manchester City camp despite their final-day victory against the hosts.\nUnable to snatch the title from record-holders Chelsea, Gareth Taylor’s side struggled against a determined Aston Villa side who were not only looking to end the season with three points at home but keen to give departing manager Carla Ward a fitting send-off to draw her successful tenure to a close.\nDespite a loss to the Blues, Villa demonstrated Ward’s attitude to the very end – to never ‘park the bus’. Rachel Daly’s equaliser in the second half meant City had to struggle in their search for a victory, a situation all too common for those who come up against Villa, particularly at their 42,000-seater home. Ward’s side eventually left-empty handed, but a glance at any highlights package would confirm that this was a match that could have quashed City’s hopes well before the 90 minutes were played out.\nOverall, the 2023/24 season may not have witnessed the best of Villa on display, but it is hard to deny the impact that Ward has had over the midlands team since she arrived in 2021 – and her resilience to the army of critics that came her way is reflected across this top-flight side.\nLet us not forget, that it was only last season that Ward led Villa to their highest-ever WSL finish (5th in 2022/23) as well as a spot in the FA Cup semi-final. Armed with the likes of new signings Daly and Kenza Dali, Ward transformed Villa from a club still in the infancy of their top-flight days to one in contention for a spot in the battle for European football.\nAt the same time, Daly won the WSL Golden Boot on her debut season under Ward – more evidence of the manager’s ability for talent nurturing as well as the creation of one of the strongest partnerships in the league, as seen in Daly and Dali.\nHer record for fostering growth among a side who were previously written off in the League has attracted some stellar talent to the Villa ranks throughout her tenure – Daly leads the charge, but the additions of Lucy Staniforth, Jordan Nobbs and Rachel Corsie were a testament to Ward’s dressing-room culture. She has moulded Villa into a club that big-name players are not only interested in but can also thrive at.\nBeyond her tactics on the pitch, Ward’s attitude to big issues outside of football are further evidence of the hole she will leave with her departure – not just for Villa but for the wider community of women’s football. Her stances on player welfare and the importance of female coaching staff have encouraged discussions surrounding the number of women at top-level managerial positions, in the WSL and beyond.\nEmma Hayes recently made her move from title-holders Chelsea to take control at the US National Team, aiding concerns among some that the number of female managers across the WSL could soon be a harsh reality of the work still needed across the top-flight.\nBut while fans despair at the departure of two charismatic leaders, hope may not be lost for Ward’s biggest fans – as she has hinted that a return to the dugout by Christmas could well be on the cards depending on which club eyes up the Villa departee come ‘sacking season’.\nAs for who replaces Ward at Villa, the guess is anyone’s. The manager herself has made it clear she wants no part in the process. For now, her young daughter Hartley is all that matters – another stark reminder of the struggles faced by female coaching staff who have to juggle motherhood with management.\nMore from Redbrick Sport below:\nT20 World Cup Preview: A finely poised affair\nMatch Report: Arsenal take three points from Villa Park after late goals in WSL clash",
  "word_count": 679,
  "scraped_at": "2026-02-14T12:57:27.466348"
}