{
  "article_id": "0b009236e655",
  "url": "https://www.rockmnation.com/2023/9/12/23869262/mizzou-softball-releases-fall-ball-schedule",
  "title": "Softball releases Fall schedule , Mizzou Football gets a night game",
  "date": "20230912T143000Z",
  "domain": "rockmnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "First things first. Fate has interfered and dictated one of the things I write about up top. I kid you not, the Marc Cohn classic “Walking in Memphis” came on the radio a minute ago. I mean, when that happens, what can you do? (Besides sing the song, of course). You HAVE to write about the Memphis game time, right?\nSoftball releases Fall Ball schedule, Mizzou to the Lou gets a night game\nMizzou Links for Tuesday, September 12\nThat’s right, we have a game time for the Mizzou-Memphis game next Saturday. Right on schedule with their slow-as-molasses release of game times.\nFigures the Tigers get a coveted night game slot when they are playing indoors at the Edward Jones Dome The Dome at America’s Center (it’s apparently changed names since I last looked it up). Alas, it’s better than the 11am tipoff I thought fans were going to be stuck with so I’m a happy camper. AND only because Monday was my father’s birthday (HBD, Dad!), ESPN & Charter/Spectrum reached a deal so now that company’s subscribers can actually watch the action if they’re not there in person. #birthdayblessings\nMoving on.\nSoftball released its Fall Ball schedule on Monday, which is what I planned to focus on up top. On September 30, the Tigers will kick off their fall schedule against the Roos & MO State in KC, before hosting three other competitions at Mizzou Softball Stadium in October.\nAbout the competition:\nThe only true test should be Missouri State, whom the Tigers last saw in the NCAA Regionals two seasons ago. They are legit, well-coached, and always very competitive. Kansas City is the only other D-I team on the schedule, but overall, I’d say it’s a nice slate of good-prominent JuCo and D-II and D-III teams.\n- Kansas City: 9-43 | Summit League | Lost to no. 25 Missouri 5-11 in Tigers’ season opener in March 2023\n- Missouri State: 31-20 | Lost to 7-seed Belmont in the MVC Tourney, ending their season | Lost 2 games to Missouri in Columbia Regional in 2022\n- Kaskaskia College: 49-18 | Located in Centralia, Ill. | NJCAA Region XXIV Champions | Lost to Seminole State College (OK) in NJCAA D1 World Series\n- Columbia College: 26-19 | Claimed sixth-straight AMC tournament championship in ‘22 | Eliminated by 9-seed Marian University (Ind.) in NAIA World Series second round\n- Coe College: 39-11 | Eliminated by 3-seed Trine University in NCAA Division III Championships (it’d be like Mizzou losing in the Supers to JMU a few years ago)\n- Jefferson College: 16-22 | Located in Hillsboro, Mo. | NJCAA Division I\n- Missouri Southern State: 41-15 | Eliminated by 14-seed Rogers State in NCAA D-II Central Regional Tournament\n- Central Methodist: 42-12 | Eliminated by Georgia Gwinnett in 2023 NAIA World Series in 4th ever appearance in World Series\nAbout this year’s team:\n- Departures: Kendal Cook (grad transfer, Charleston Southern) | Payton Jackson (graduate) | Emma Nichols (graduate) | Maddie Snider (transfer, USF) | Hannah McGivern (graduate) | Megan Moll (grad transfer, FAU) | Addie Lange (graduate) | Megan Schumacher (grad transfer, GCU) | Riley Frizell (transfer, Louisville)\n- Transfers: Mya Dodge, Northern Iowa\n- Freshmen: Madison Walker (Olathe, Kan.) | Danielle Blackstun (O’Fallon, Mo.) | Stefania Abruscato (Smithtown, N.Y.) | Claire Cahalan (Columbus, Ga.) | Marissa McCann (Surprise, Ariz.) | Nathalie Touchet (Aledo, Texas) | Adi Koller (Texarkana, Texas) | Abby Hay (Columbia, Mo.)\nYesterday at Rock M\n- Matthew recapped VB’s weekend in Cincy: Mizzou Volleyball takes two of three at the Xavier Tournament\n- Quentin examined Five plays that defined Saturday’s 23-19 win over Middle Tennessee State\n- Sam talked with Rocco Miller about non-con scheduling on a new Dive Cuts\n- Dan wrapped up his thoughts on the game from afar (he lives in Brooklyn) in a notebook-style piece\n- Josh is back with a new MV3\n- IN CASE YOU MISSED; Read Sam’s Pourover— Pourover: When do we see progress?\nMore Links:\nFootball\n- St. Louis Post-Dispatch: ‘Luther is Him.’ Mizzou receiver Burden III looks elite in his sophomore season (Benjamin Hochman) | Pressure and penalties raise early questions about Mizzou’s offensive line (Eli Hoff) | A win is not a win. Mizzou’s rough showing creates concern, heading into K-State game (Hochman) | Mizzou football snapshots: PFF grades, snap counts for Tigers’ win against Middle Tennessee (Hoff)\n- Columbia Tribune: 7 thoughts from Mizzou football’s win over Middle Tennessee State (Chris Kwiecinski)\n- Saturday Down South: Stock report after Week 2 (Sydney Hunte) | 3 takeaways from Mizzou’s Week 2 victory over Middle Tennessee (Adam Spencer)\n- The Athletic: Ranking all 133 teams after Week 2 (Chris Vannini) | SEC football second impressions: Amid rough start, a vibe ranking of each team (Seth Emerson)\nThe Tigers are #53 in Vannini’s Top 133 list, behind SMU and Troy, and just ahead of CC, Florida and… Memphis.\nFrom Emerson’s vibe ranking:\n#9. Missouri: Not a resounding win over a team that got routed the week before at Alabama. Missouri didn’t take a two-score lead until the fourth quarter, then had to hold on. This was after a “meh” win over South Dakota. That seems to be the continual vibe with Mizzou these days: Meh.\nY’all… The vibes are not immaculate. Missouri was also #9 on Seth’s list last week, following week 1. Hmphhh. I agree. We’ve got very “Meh” vibes. ¯\\_(ツ)_/¯\n- PowerMizzou: Listen to State of the Tigers presented by James Carlton: Episode 7 (Gabe DeArmond & Jarod Hamilton) | Five-star WR Ryan Wingo gives the latest on his recruitment (Sean Williams) | How Missouri did versus Middle Tennessee State using PFF College (Hamilton)\n- This actually made me laugh way too hard, because it’s so true...\n- Pretty cool! There’s two Tigers on this list. One former (TJ) and one current, Nyles Gaddy. This is super cool for Gaddy; Rock M’s football minds really like him. Per the release, the senior finished with three tackles, 2 for a loss along with a pair of sacks for a 15-yard loss in the Tigers’ win over MTSU. It is the second multi-sack performance of his career and first in a Missouri uniform. Read more at MUTigers.com.\n- In case you haven’t watched this, this is good work by Connor McLain, who is working for both Mizzou Athletics and PowerMizzou. This video almost makes me forget the @#%&show we witnessed on Saturday.\n- Two former Tigers. Battling to the death\n- I don’t know what this is, but Parker said it was big news, so we’ll go with it\nHoops\n- Scenes from Mizzou Hoops commit Marcus Allen’s second OV to campus:\n- Can’t wait to watch Curt play this season!\nOther Mizzou Sports\n- DENNIS! GIVE US THE DEETS! Women’s Golf is currently at the Sam Golden Invitational in Denton, TX (North Texas) while Volleyball travels to Eastern Illinois for a two-game series on Thursday & Friday (6pm & 4pm, respectively). Soccer, meanwhile, travels to The Swamp to kick off SEC play on Friday at 6pm (SEC+).\n- This week in Mizzou sports (Trevon Bobo, PowerMizzou)\n- Riddle me this, XC runners\n- LFG, Bella! Didn’t take long for the All-Freshman team goalie to get back in the swing of things. Per the MU Tigers release:\nHollenbach helped the Tigers to a 2-0 week in net, totaling nine saves over two games and one clean sheet. After a penalty kick against border rival Illinois, the redshirt sophomore shut the door on the Illini, propelling the team to a 2-1 win. Following that performance, the keeper posted a shutout of Missouri State in St. Louis, making two point-blank saves to earn her first clean sheet of the season and fourth of her career.\n- Check out this soccer video as the Tigers wrapped up non-con:\n- The legend and weekend Mizzou Athletics Hall of Fame inductee\n- Former softball GA Kristin Hallam has found a landing spot at\n- the University of Pennsylvania!\n- Columbia Outlaws best Mizzou Rugby Club in season-opening scrimmage (Stephen Vierling, Missourian)\n———————————————————————————-\n- If you’re looking to sign up for ESPN+, Rock M Nation now has an affiliate link: click Here for ESPN+ Now!\n- If you’re looking to sign up for a new streaming service, you can try FuboTV: click HERE for FuboTV access — FuboTV now has ESPN, CBS, FS1 and more sports channels. (** RockMNation has affiliate partnerships. These do not influence editorial content, though RockMNation may earn commissions for products purchased via affiliate links.**)",
  "word_count": 1424,
  "scraped_at": "2026-02-14T13:09:32.729493"
}