{
  "article_id": "0b01099f9b39",
  "url": "https://www.bbc.co.uk/sport/football/68389898",
  "title": "Grace Clinton impressive England debut :  She plays like a natural  ",
  "date": "20240224T123000Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Grace Clinton's England debut could not have gone much better.\nShe scored 19 minutes into her first start under Sarina Wiegman, just moments after she had struck the post, and it contributed to an emphatic 7-2 thrashing of Austria.\nThe 20-year-old has caught the eye this season while on loan at Tottenham from Manchester United and she did not waste any time in impressing Wiegman in Spain.\nPlaying in an unfamiliar number eight position, Clinton did not look out of place alongside England midfield regulars Georgia Stanway and Ella Toone.\nBy the time she was substituted in the second half - receiving a warm hug from Wiegman before she took her seat in the dugout - she had shown a convincing reel of her skillsets and will surely get another opportunity to do so again soon.\n\"She plays like a natural. She wants to have the ball. She picks up the things we talk about very quickly and that's what you see on the pitch too,\" said England boss Wiegman afterwards.\n\"It was a new role for her so we did some tactics and some individual things and you can tell she takes things on board. She just goes out there and plays.\"\n'You work hard for these moments'\nSat in the stands at Estadio Nuevo Mirador, a 7,200-capacity stadium in Algeciras, a fair distance from England's hotel in Marbella, were Clinton's mum and dad, who had flown over in the hope of seeing her make her senior debut.\nClinton is one of several youngsters to have broken into the first-team squad under Wiegman and on Friday she proved to be an example for the under-23s players who have joined the Lionesses out in Spain.\n\"I can't even describe it to be honest, it feels amazing. I found out on Thursday night [I was starting],\" said Clinton.\n\"Throughout the week you might have ideas and stuff, but I couldn't believe it. It's surreal but you work so hard to get these moments so you really have to soak it in.\"\nClinton said she \"couldn't wait\" to \"see the reaction\" of her parents at full-time but joked that she expected a potentially \"harsh\" debriefing from her dad on where she could still improve.\n\"My dad knows his football so he will have a proper chat with me and I'll be there a while,\" added Clinton.\nPlaying alongside Stanway, who thrived in a deeper midfield role against Austria, and United team-mate Toone, Clinton said she felt \"really comfortable\".\n\"The girls supported me so much. It was nice playing with Tooney because I know her really well and Georgia was really helpful behind - so really comfortable,\" added Clinton.\n\"The number eight position this season is a bit new to me. Sarina told me at the start of the week she was trying new things so to be in there is different, but nice.\"\n'It's exciting she still has so much to work on'\nManchester City defender Alex Greenwood, who wore the captain's armband for England on Friday, hopes plenty of other youngsters can follow in Clinton's footsteps and make an impression on the main stage.\n\"This week we've had the under-23s squad with us so for them to see that happen will be a bit of motivation for them to know they can have an opportunity in the future,\" said Greenwood.\n\"Obviously we're really proud of Grace for taking her opportunity and getting herself a goal.\n\"She's brilliant. She's actually really mature for her age and is obviously a fellow Scouser as well so that's always nice to have another one in the camp.\"\nEarlier this season, Tottenham boss Robert Vilahamn said Clinton would be \"the next superstar in this country\".\nWith four goals and two assists in 13 appearances for Spurs, Clinton has been a standout performer in the Women's Super League, but Greenwood believes there is still more to come.\n\"She's a great kid, really energetic, wants to learn and is always asking questions, which I love about her. She takes criticism really well and wants to improve,\" said Greenwood.\n\"I think she's a really good midfielder on the ball and makes good runs into the box. She's an intelligent footballer and it's exciting that she still has so much to work on actually.\"\nDOMINO IS ON THE HUNT FOR VICTIMS, NOT LOVE...: A lone witch deliberately dates awful men in order to feed off them\nDEEP DIVE INTO PEP GUARDIOLA'S RELENTLESS PURSUIT OF PERFECTION: The methods that led him to leave a lasting imprint on the game",
  "word_count": 758,
  "scraped_at": "2026-02-14T12:41:08.506621"
}