{
  "article_id": "0b190ae875f4",
  "url": "https://www.fourfourtwo.com/features/jonas-eidevall-why-did-the-arsenal-manager-resign",
  "title": "Jonas Eidevall : Why did the Arsenal manager resign ? ",
  "date": "20241017T160000Z",
  "domain": "fourfourtwo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Jonas Eidevall: How an unpopular transfer and fan power forced the Arsenal manager to resign\nFan frustration around Jonas Eidevall seeped into the dressing room after disappointing results\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nJonas Eidevall had lost fan confidence after a disappointing start to the season but, according to reports, it was when he knew he had lost the dressing room that he handed in his resignation.\nThe Arsenal manager stepped down from his role after three years following a 2-1 loss to rivals Chelsea in the Women's Super League.\nThat defeat compounded their capitulation to Bayern Munich in the Women's Champions League where the Gunners had led but a 13 minute Pernille Harder hat-trick meant they lost their opening group stage match 5-2.\nWhen did the wheels start to come off for Jonas Eidevall at Arsenal women?\nThose two matches are not the sole cause of Eidevall resigning. The loss of the Gunners fan support began last season. Arsenal were impressive against title rivals Manchester City and Chelsea last campaign in the WSL, winning nine points when facing the two clubs.\nBut Arsenal then could not underline the victories because they would lose or draw to sides they should have been beating. For example, Arsenal defeated Chelsea 4-1 at the Emirates in December but a week later they lost 1-0 to Tottenham.\nLosing points to other sides meant they were out of the title race and it was a straight shootout between Man City and Chelsea come the final day of the season, the Blues won on goal difference for their fifth straight title.\nThe fans, while frustrated, did not turn their backs on Eidevall because of the bumpy nature of their WSL season though. The manager did bring in silverware with the Conti Cup and the squad were less consistent as players like Leah Williamson were returning from ACL injuries.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nThe major turning point from a fan perspective was Vivianne Miedema's departure. Miedema had not been a regular starter after recovering from her ACL injury and with her contract up at the end of the 2023/24 season, rumours started to circulate about her future. Then in May, just before the end of the WSL campaign, the Gunners announced Miedema would leave the club in the summer.\nFans were not happy the all-time top WSL scorer would depart and made their feelings clear on social media. Some supporters also took 'Jonas out' signs to Arsenal's last game of the season. The anger around Miedema's exit only grew after it was announced she would join their rivals Man City on a free transfer.\nVIDEO Why Lauren James Will Change Women's Football Forever\nMiedema was given a warm welcome by Arsenal fans at the start of the 2024/25 WSL season as Man City travelled to the Emirates to face Arsenal. The Netherlands international, who in FourFourTwo's view could still produce some of her best football, scored for City in the 2-2 draw.\nArsenal performances were not consistent and the pressure cooker was cranked up when they drew 0-0 at home to Everton, who sit at the bottom of the table, despite dominating possession. The Bayern defeat came next and it fuelled a reaction from supporters.\nBefore their match against Chelsea 'Jonas out' was spray painted on a wall close to the Emirates Stadium and P45s were waved at the boss by fans during the match. After Arsenal lost to Chelsea Eidevall walked down the tunnel, instead of applauding supporters as he was known to do.\nEidevall has not yet spoken on his departure but the club's sporting director Edu, who will play a part in the recruitment of his successor, said: \"We have great respect for the dedication and commitment he showed to our women’s first team and recognise the role he has played in the growth and development of Arsenal Women. We all wish him the very best for the future.\"\nRenée Slegers, Eidevall's assistant coach, has taken interim charge of the club and will remain in the role until a permanent replacement is found. She was thrown straight into the job as Eidevall resigned a day before the club played Vålerenga in the Women's Champions League, a game they won 4-1.\nWho could take over from Jonas Eidevall?\nLaura Harvey\nHarvey has taken charge of Arsenal before and was manager from 2010-2012. During her time with the club she won three consecutive league titles, two League Cups and an FA Cup.\nShe has continued to be successful throughout her managerial career and is currently in charge of National Women's Soccer League team Seattle Reign.\nSeb Hines\nHines is in charge of NWSL side Orlando Pride and has just won the Shield in the league.\nThe 36-year-old won the silverware after two years in charge. Orlando Pride is the only club he has worked for as a coach. He was their assistant coach for two years before being promoted in 2022.\nTony Gustavsson\nGustavsson left his role as Australia's head coach after the Olympics and so is available to be hired. He led the Matildas in their impressive semi-final run at the 2023 World Cup.\nHe also has other experience in the women's game such as working as the assistant coach of UWSNT when they won back-to-back World Cups in 2015 and 2019.\nCasey Stoney\nThe former Manchester United boss is currently a free agent and she was quickly linked to the role.\nHowever, reports suggest she is not being considered for the position.\nPhil Neville\nThe odds-makers may have the former Lionesses manager among the names who could take over but it is not a name that will be popular among fans.\nDespite his experience in women's football, Neville is a name that is unlikely to slot on the Arsenal manager's door.\nSarah joined the FourFourTwo team in September 2024 in a freelance role. She also writes for The Guardian, BBC and Rugby World where she specialises in women's football and rugby. Sarah has a bachelors degree in English and a master's in newspaper journalism.",
  "word_count": 1125,
  "scraped_at": "2026-02-14T12:23:04.471187"
}