{
  "article_id": "0b1cb1268f24",
  "url": "https://www.twnpnews.com/2025/04/wwe-announcers-list/",
  "title": "WWE Announcers : Complete List of On - Air Personalities",
  "date": "20250427T154500Z",
  "domain": "twnpnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Howard Finkel, Gene Okerland, Jim Ross, Michael Cole…perhaps nobody influences a fan’s emotion like a WWE announcer. Whether we teared up over Vince McMahon saying that Shawn Michaels’ boyhood dream had come true or when Samantha Irvin fought back her own tears announcing that Cody finished his story, WWE announcers get us right in the feels. They set the tone for the presentation and leave a calling that lasts a lifetime. So, who are the current WWE announcers? Here is an exhaustive list of voices on your WWE screen.\nMonday Night Raw\nWWE Raw is the longest-running weekly episode show in television history. Over the years, it’s had many announcers that left a mark in sports entertainment forever, including “Macho Man” Randy Savage, Jerry “The King” Lawler, Jim Ross, and Michael Cole. Some of us even have fond memories of Mike Adamle! Here are the current WWE announcers for the company’s flagship show.\nCommentator: Michael Cole\nFor almost 30 years, Michael Cole has been the Voice of WWE. Whether it’s Raw, SmackDown, or WrestleMania, whatever show needs a pick-me-up, WWE sends Michael Cole. In fact, Michael Cole is the current trainer for all future WWE announcers.\nMichael Cole started his onscreen career as a television journalist. The star even covered the frontlines of wars overseas. However, nothing could have prepared him for a three-decades-long career behind a WWE desk.\nWhile Michael Cole is beloved today, the WWE announcer had to earn the respect of fans. Many held Cole in contempt for replacing Jim Ross as the Voice of WWE. Michael Cole didn’t do himself any favors by becoming one of the most hated heels in 2011 and 2012. In fact, Michel Cole set up his own announce desk on Raw called the “Cole Mine.”\nWhile we hated him for saying horrible things about Jerry Lawler’s dead mother back then, we couldn’t imagine Raw without him calling Dominik Mysterio a piece of crap on Raw every week today!\nCommentator: Pat McAfee\nPat McAfee has become one of the world’s biggest (and most controversial) sports analysts. With his brash behavior and hot takes, Pat McAfee has become a national superstar. It’s only natural that WWE and Pat McAfee would create a long-standing onscreen partnership.\nThe former Indianapolis Colts punter first joined WWE as a special guest commentator for NXT Takeover events. He would quickly get bitten by the wrestling bug, partaking in a handful of matches over the past few years.\nPat McAfee first joined SmackDown when it debuted on FOX. The star would take an absence to host ESPN’s College Game Day.\nHowever, Pat McAfee would once again show up as a full-time commentator when Raw debuted on Netflix. This seemed to get under the skin of Corey Graves, who keeps filling in for Pat McAfee while McAfee takes leave to film other shows.\nAs of now, Pat McAfee is the Raw commentator for the long haul. We can be sure to see him dancing on the desk for many years to come.\nRing Announcer: Alicia Taylor\nAlicia Taylor is the vibrant voice you hear announcing the weights and hometowns of wrestlers every week on Monday Night Raw. She has the powerful roar to her voice that many people loved about Samantha Irvin. Also, like Irvin, Alicia Taylor was a singer prior to her WWE career.\nAlicia Taylor joined WWE in 2018 as a backstage correspondent for NXT. She would quickly become their ring announcer in early 2019. Alicia Taylor remained on the gold and black brand until 2024 when she would get promoted to the main roster. The talented star would briefly become the SmackDown ring announcer before moving over to Raw in early 2025.\nBackstage Interviewer: Cathy Kelley\nCathy Kelley is a long-time WWE fan who is now on her second run with the company. She first joined WWE in 2016 after she was spotted recapping WWE TV on After Buzz TV.\nCathy had humble beginnings in WWE, working closely with the production team. The interviewer spent most of her day in WWE’s headquarters in Stamford, filming and producing digital content.\nCathy’s charm and quick wit are undeniable. She’d eventually find herself in a backstage role on WWE TV. The star traveled with the shows for a couple of years before deciding to leave WWE in 2020.\nCathy wanted more opportunities on the main roster. She would come back in 2022 in the same role she left. However, rumor has it that Cathy Kelly has been training at the Performance Center for a different onscreen role. Many are speculating that Cathy Kelly is training to become a manager.\nBackstage Interview – Jackie Redmond\nJackie Redmond was one of the more popular WWE hires over the last few years. She gained a lot of credibility among sports fans for her NHL career. In fact, she’s become pretty close friends with fellow hockey enthusiast, CM Punk!\nJackie Redmond started her WWE career as a co-host of Raw Talk with Matt Camp. She would transition to a backstage role in 2023. Many fans credit her professionalism and ability to add credibility to storylines through her line of questioning.\nWWE allows Jackie Redmond to pull double duty. She is currently the host of The Jackie Redmond Show on the NHL Channel.\nRaw Talk Host: Megan Morant\nWith Jackie Redmond leaving Raw Talk, the show had large shoes to fill. Megan Morant has done a magnificent job as the latest co-host of the post-Raw talk show.\nMegan Morant started her career as a reporter for the New England Patriots. Too bad she couldn’t convince Tom Brady to make his teased WrestleMania 41 appearance.\nMegan Morant was recently off WWE TV because she had a baby. The star made her return earlier this year and has been bringing the gab to Raw Talk ever since!\nRaw Talk Host: Sam Roberts\nSam Roberts rose to fame as a Sirius XM radio host and producer. However, his biggest passion is WWE. The on-air personality created his own podcast called Not Sam Wrestling.\nThe WWE fell in love with his passion and dedication. They started offering Sam Roberts various roles in their digital programming.\nIn 2016, Sam became a regular fixture on many panels, including pre-shows to WWE PLEs. His most recent role was as co-host for Megan Morant on Raw Talk. He was also the host during Karrion Kross’ viral rant that has created a lot of buzz following WrestleMania week.\nSmackDown\nSince 1999, WWE SmackDown has become a staple on every wrestling fan’s schedule. From the iconic pairing of Michael Cole and Tazz to Lillian Garcia becoming the first breakthrough female ring announcer, to Booker T filling our ears with some “Schucky ducky quack quack,” the announcers of SmackDown add an extra layer of energy to the show. Here is the current SmackDown announce team.\nCommentator: Joe Tessitore\nOne of the newest additions to the WWE announcer roster is Joe Tessitore. The former Monday Night Football announcer shifted to Monday Night Raw in 2024.\nJoining Raw was a “dream come true” for the lifelong WWE fan. He was teamed up with Wade Barrett, and fans immediately noticed the chemistry between the two. They both moved to SmackDown in 2025 and have been the announce team for the blue brand since.\nCommentator: Wade Barrett\nWhile Wade Barrett has made a career of delivering bad news, he’s been delivering a lot of amazing analysis for WWE over the last few years. At one time, Wade Barrett was considered to be a future top star in WWE. While he became a multi-time WWE Champion, the UK star never made it to the next level. Wade Barrett would quit WWE in 2016, leaving many to believe he left before he realized his full potential.\nIt didn’t seem like Wade Barrett was interested in returning to the company. However, he would make a shocking return as an NXT commentator in 2020. Wade Barrett quickly became a fan favorite among analysts. He would get his main roster call-up in 2022.\nSince then, Wade Barrett has been switched back and forth between Raw and SmackDown, filling in gaps wherever needed. However, it seems like Wade Barrett and Joe Tessitore have a good rapport as SmackDown announcers. So, we might be hearing from this pairing for years to come!\nRing Announcer: Mark Nash\nMark Nash is the newest addition to the WWE announce team. The former boxing ring announcer joined the SmackDown team after Lilian Garcia retired earlier this year.\nPrior to joining WWE, Mark Nash was an interviewer, host, and announcer for a variety of sports, including hockey and football. He performed these duties under his real name, Mark Shunock.\nSince joining the sports entertainment industry, Nash was quickly thrust into the spotlight. He made his debut on SmackDown in the 02 Arena. Also, Mark Nash was included in John Cena’s first promo as the 17th-time World Champion. Cena made Nash introduce the new Champion as the “Greatest of All Time” and “The Last Real Champion.”\nTriple H is said to be a big fan of Mark Nash’s work. So, we can expect to hear him introduce wrestlers and announce the winners for years to come.\nBackstage Interviewer: Byron Saxton\nPerhaps no one in WWE has thicker skin than Byron Saxton. This WWE announcer has long been the butt of many jokes on television.\nByron Saxton didn’t always dream of being the dorky WWE announcer he plays today. In fact, he wanted to be an in-ring competitor. Byron cut his teeth as an independent wrestler before joining WWE developmental in 2007.\nThe future announcer would float around in the shuffle for years. He finally made his TV debut as a member of NXT Season 4. After being eliminated, he would come back to lose NXT Season 5: Redemption.\nIt seemed clear that being a WWE Superstar wasn’t in the cards for Byron Saxton. So, he transitioned to becoming a commentator and ring announcer for NXT in 2012.\nIn 2015, Byron would get his biggest breaks as a commentator. He was placed as a permanent fixture on Raw. However, WWE would swap him with other commentators on SmackDown and 205 Live before removing him from the announce table altogether.\nToday, Byron serves as a backstage announcer on SmackDown. He also acts as the ring announcer for many WWE House Shows. While he never made it as a wrestler, Byron Saxton is a one-time WWE 24/7 Champion. So, he has that going for him!\nNXT\nNXT has come a long way since debuting in a game show format. Triple H and Shawn Michaels have transformed NXT into a breeding ground for the Superstars of tomorrow. The black and gold brand goes beyond grooming professional wrestlers like Seth Rollins, Roman Reigns, and Bray Wyatt. It’s also a way for commentators and announcers to hone their craft. Everyone from Beth Phoenix to Wade Barrett to Renee Young has spent some time as an NXT announcer. Here are the voices of NXT today.\nCommentator: Vic Joseph\nVic Joseph is a long-time WWE commentator who has truly come into his own at NXT. The long-time wrestling fan first got experience as a ring announcer and commentator for various independent promotions, including Tommy Dreamer’s House of Hardcore.\nWWE signed the young talent in 2017. He provided commentary for a variety of WWE shows, including:\n- Main Event\n- 205 Live\n- NXT UK\n- Mixed Match Challenge\nVic Joseph’s biggest role was when he was placed as the lead announcer of Raw in 2019. This was during the short time that Paul Heyman was made the Executive Director of Raw. Perhaps Vic Joseph is a Paul Heyman Guy?\nMany feared that Joseph would face termination in the near future. However, he was placed in NXT, where he currently thrives as the lead announcer.\nCommentator: Booker T\nBooker T is a WWE Hall of Famer who brings a lot of energy to NXT. While Booker is known for his in-ring prowess, the star has been in the announcing booth for almost 15 years.\nBooker T became a color analyst for SmackDown in 2011. He was in the role for a couple of years. Since then, Booker has provided commentary on Raw, as well as analysis on WWE Kickoff shows for PLEs and WWE Backstage on Fox.\nThe WWE Hall of Famer joined the NXT announce team in 2022. Since then, he’s grown a deep connection with the NXT Universe. In fact, they recently shared impassioned chants about Hulk Hogan and Swerve Strickland to the amusement of Booker T.\nCommentator: Corey Graves\nPerhaps there is no commentator more controversial than Corey Graves. “The Savior of Misbehavior” has been known to play devil’s advocate in the announcer’s booth. Many believe he has a style very similar to WWE Hall of Famer Bobby Heenan, as Graves has been known to side with the heels.\nCorey Graves is just as controversial behind the camera as he is in front of it. That’s one of the reasons why he was the long-standing host of WWE’s former podcast, After the Bell.\nHowever, Corey Graves’ emotions can sometimes get the best of him. Graves has been a lead color analyst on Raw and SmackDown. However, he’s been traded back and forth many times over the past few years, especially as Pat McAfee’s schedule changes.\nAs a result, Graves got upset when he was sent to NXT. The former NXT Superstar was insulted by the perceived demotion for not “being as famous” as others. A week after that rant, he wasn’t on WWE television. This made many speculate that he was leaving the company.\nHowever, Graves was back the following week. The disgruntled talent stated that he is where he wants to be, which is in NXT.\nThat said, his wife, Carmella, was released in the past year. She also wasn’t happy with how she was let go, as it was after her pregnancy and while she was still dealing with health complications following giving birth. So, we will keep an eye on the ongoing Corey Graves-WWE situation.\nRing Announcer: Mike Rome\nWe don’t know what stands out most about Mike Rome, his voice or that hair! Mike Rome is a lifelong wrestling fan who always dreamed of working for the company. He’s been a staple in WWE for almost a decade, making his debut as a ring announcer for the Cruiserweight Classic and NXT.\nWithin a year, Mike Rome started popping up backstage as an interviewer. He’d finally become the ring announcer of Raw in 2019. The star would stay on the Raw brand for three years before being drafted to SmackDown.\nIn 2024, WWE started shaking up its announce teams. They promoted Alicia Taylor to SmackDown from NXT. In turn, Mike Rome returned to NXT, where he became a popular performer with the crowd.\nBackstage Announcer: Sarah Schreiber\nSarah Schreiber has been in the WWE announcers’ system since 2018. She started as a backstage announcer on Raw and SmackDown. However, her on-air roles were limited. So, the talent was sent down to NXT to hone her craft and find the right role for her.\nShe is currently one of the top backstage interviewers for NXT. In addition, Sarah Schreiber occasionally hosts live events for NXT when they go on the road for House Shows.\nBackstage Announcer: Kelly Kincaid\nKelly Kincaid might be familiar to those who follow the independent wrestling scene. She competed in Ring of Honor as Quinn McKay for many years.\nThe former Quinn McKay started anew in WWE as Kelly Kincaid in NXT Level Up. Instead of being a wrestler, Kelly was a ring announcer and backstage interviewer.\nMany fans agree that Kelly is more natural at interviewing. So, she’s become more active on NXT on CW. It’s great to see her follow her dreams to make it in WWE, even if it’s through a different career path than the one the former Quinn McKay imagined.\nBackstage Announcer: Blake Howard\nBlake Howard is a long-time sports and wrestling fan. He provided commentary to various independent wrestling and sporting events for years before getting on the radar of WWE.\nHe joined the company in 2022 as a commentator and interviewer on the now-defunct NXT Level Up. He is used sparingly on NXT. His most significant opportunity was covering Kelly Kincaid during her maternity leave in 2024.\nHowever, Blake has been known to fill in on commentary when needed. So, we will be sure to see more of him in the future!\nWWE Evolve\nWWE Evolve is a show on the streaming platform Tubi. It showcases WWE talent who are signed to the Performance Center. These athletes have been training to get a chance to make it to the NXT roster. This show gives them a platform to improve their trade, gain exposure, and create more content for wrestling-hungry fans. Let’s take a look at the announcers for WWE Evolve!\nCommentator: Peter Rosenberg\nPeter Rosenberg is a radio personality who has become deeply entwined with WWE content over the last few years. The former Hot 97 host joined WWE as a Pre-show analyst for PLEs in 2016.\nThe lifelong WWE fan has been used in various WWE shows as a talking head for documentaries and countdowns. He even became a WWE 24/7 Champion at the Royal Rumble 2021.\nWWE Evolve is the first commentary gig for Pete Rosenberg. He’s been stuck in many roles during his tenure at WWE. Let’s see how this one pans out for him!\nCommentator: Robert Stone\nRobert Stone brings the personality to WWE Evolve’s announce team. This former wrestler has had tremendous success in the past as Robbie E for TNA. After almost 20 years on the independents, Robbie E signed with WWE to become Robert Stone.\nRobert Stone quickly became a hot heel manager. His most notable role was managing Chelsea Green. Since then, Green has played various on-air roles, including General Manager of NXT. He’s currently trying his hand at commentary for the first time on Evolve. Many believe there might be a future for Robert Stone as a WWE announcer.\nRing Announcer: Blake Howard\nWith Sarah Schreiber and Kelly Kincaid as the predominant backstage interviewers for NXT, Blake Howard has settled into the role of WWE Evolve ring announcer. This is an excellent opportunity for the growing talent to find his voice and make a connection with the NXT Universe.\nWWE LFG\nWWE LFG stands for Legends and Future Greats. This show pulls back the curtain on what it takes to be a WWE Superstar. Season 1 saw Undertaker, Bubba Ray Dudley, Booker T, and Mickie James take young upstarts under their wings to compete for an NXT contract. WWE LFG Season 1 is already complete, and Season 2 has been announced. The format will be the same, but Michelle McCool is replacing Mickie James in a controversial fashion. It remains to be seen if the WWE LFG announce team remains the same. Here is the current talent calling the reality competition.\nCommentator: Vic Joseph\nAs the lead commentator of NXT, it makes sense for Vic Joseph to provide the play-by-play for WWE LFG. After all, he might be calling matches for these Superstars in the very near future!\nCommentator: Jeremy Borash\nJeremy Borash is one of the most influential figures behind the scenes over the last 25 years. He made his professional wrestling debut as a commentator for WCW in 1999. While these were the dying days of WCW, they opened a huge door of opportunity for Jeremy Borash. During this time, he was able to produce WCW Live! This online show helped draw back the curtain on kayfabe, helping to blur reality for current storylines.\nJeremy Borash would take these learnings with him after WCW closed, and he resurfaced in the newly-launched TNA in 2002. He would spend around 15 years with TNA in many roles, including producer and lead commentator, alongside the legend Mike Tenay.\nJeremy Borash signed with WWE in 2018 for a backstage role. He is credited with producing the Boneyard Match between The Undertaker and AJ Styles at WrestleMania 36. This was The Undertaker’s final match.\nTo this day, Jeremy Borash is heralded backstage for his work. So, it was a shock to see him put the headset back on and become a color commentator for WWE LFG. However, it’s been a pleasure to see him back on our screens in 2025 and beyond.\nRing Announcer: Alicia Taylor\nAlicia Taylor has a voice that’s extremely distinctive. She brings a lot of energy to her calls. That’s why she was selected to be the ring announcer for this show on A&E, which isn’t a network known to promote wrestling matches.\nWWE Announcers in Hall of Fame\nAudio calls from WWE announcers live on for generations. They provide the backdrop for many iconic documentaries and video packages to come. Who doesn’t remember JR screaming, “As God as my witness, he’s broken in half!” when Mick Foley was thrown off Hell in a Cell by The Undertaker? To this day, wrestling fans believe Ric Flair’s 1992 Royal Rumble win would only have met half as much if Bobby “The Brain” Heenan was freaking out over the match “Not being fair to Flair.” That’s why so many WWE announcers are enshrined in the Hall of Fame. Here are WWE Hall of Fame ring announcers!\nBruno Sammartino\nBruno Sammartino is known for holding the record as the longest WWE World Champion in history, spanning over seven years with a total of 2,803 days. However, the Italian hero was a commentator for almost a decade for WWWF and WWE.\nAs Bruno’s in-ring career slowed down, he transitioned to the announce desk. Bruno started doing sporadic commentary appearances in the late 70s. However, he became a regular by 1981. Bruno Sammartino was the color analyst for Championship Wrestling and All-Stars Wrestling.\nBruno Sammartino left the WWE before the 1990s as he didn’t like the direction the company was heading. The multi-time World Champion turned down many overtures to induct him into the Hall of Fame over the years.\nFinally, Triple H started building a relationship with Bruno Sammartino in 2011. He was finally inducted into the WWE Hall of Fame as the headliner for the Class of 2013.\nPat Patterson\nPat Patterson has the distinction of being the first ever WWE Intercontinental Champion, which he won in a “tournament‘ held in Rio de Janeiro. When his ring career was winding down, Pat Patterson used his wrestling knowledge to be a color commentator for Championship Wrestling in the early 80s.\nPat Patterson teamed behind the desk with the likes of Vince McMahon and Gorilla Monsoon. By the mid-90s, Pat left the commentary desk. He took on a large role backstage as a producer. In fact, Pat Patterson is the man who invented the Royal Rumble! Pat Patterson joined the WWE Hall of Fame in 1996.\nGorilla Monsoon\nGorilla Monsoon started his career as a feared in-ring competitor and ended it as the beloved babyface WWE announcer and figurehead. This WWE Hall of Famer spent many years terrorizing his opponents in the ring. When it came time to hang up his boots, Gorilla Monsoon put on the headset.\nGorilla Monsoon started his commentary career after Vince McMahon bought WWE from Vince McMahon, Sr. He was the lead announcer for the first eight WrestleManias. Gorilla was paired with Jesse “The Body“ Ventura for many years in a memorable duo. However, his most iconic pairing may have been with Bobby “The Brain“ Heenan.\nMonsoon and Heenan were best friends, and their chemistry on television was evident. Bobby would play the heel, saying outlandish things while Monsoon would bellow out his iconic, “Would you stop!?“ The two hosted Prime Time Wrestling, creating memorable skits that are talked about to this day.\nAfter his commentary career, Gorilla Monsoon became the President of WWE until his retirement. He was inducted into the WWE Hall of Fame in 1994. No one will ever forget Monsoon. In fact, his name, “Gorilla,” is used to describe the position in which wrestlers enter right before going out to the ring.\nJesse “The Body“ Ventura\nThere might not be a WWE announcer who’s more controversial than Jesse “The Body“ Ventura. He transitioned to behind the booth in 1985 after retiring from a successful in-ring career. His flamboyant heel persona translated well as a WWE announcer, naturally picking on fan favorites like Hulk Hogan, Tito Santana, and Jim Duggan.\nJesse Ventura played the color analyst in many popular duos, including Vince McMahon and Gorilla Monsoon. The star left the company in 1990 due to wage disputes and his desire to start a union.\nJesse Ventura jumped to WCW to continue his broadcast career, but it didn’t last long. Eventually, Ventura would become the Governor of Minnesota. Today, he remains a pretty controversial political analyst.\nFor many years, Jesse Ventura was blacklisted by WWE. The star sued them over royalties on home video releases that had Ventura on commentary. As a result, WWE removed Jesse Ventura from all past events.\nThankfully, Jesse’s commentary was returned once streaming took over physical media forms like VHSes and DVDs. While Jesse had a tumultuous relationship with WWE, he was still enshrined in the 2004 Hall of Fame class. Now, Jesse is back in the WWE family and has even reprised his role as a WWE announcer and commentator during the current reboot of Saturday Night’s Main Event.\n“Mean Gene” Okerlund\nPerhaps no backstage interviewer is more iconic than “Mean“ Gene Okerlund. Some of the most memorable catchphrases of all time include Hulk Hoga yelling, “Let me tell you something, ‘Mean‘ Gene,” or Ric Flair hollering, “Mean, by God, Gene!”\nGene Okerlund was the ultimate stickman. He was able to save interviews from going off the rails or make the crowd laugh with his quick wit.\nHe was a staple in WWE through the 80s and early 90s. In 1994, Gene Okerlund left WWE to join his friend Hulk Hogan in WCW. After WCW went out of business, Gene returned to the WWE fold.\nHe would provide commentary during the Gimmicks Battle Royal at WrestleMania X7 along with Bobby “The Brain“ Heenan. Then, Gene would become the host of WWE Confidential. Eventually, Gene’s role slowed down, sticking to guest appearances on throwback shows and becoming a regular in documentaries. Gene Okerlund was inducted into the WWE Hall of Fame in 2006.\nHoward Finkel\nHoward Finkel is credited as the first official employee of WWE when Vince McMahon bought the business from his Dad. This WWE Hall of Famer is also credited with coming up with the name of WrestleMania. The Fink was inspired by Beatlemania, which had swept America in previous decades.\nHoward Finkel has a distinctive voice that is synonymous with the 80s and 90s WWE. He is the reason ring announcers put a dramatic pause before the words, “Here is your winner,“ and “…And new“ whenever there is a new Champion announced.\nFink would continue his ring-announcing duties until 2000. He would eventually pass the torch to Lillian Garcia, even having an onscreen rivalry with his successor. The Fink made his last ring announcement at Survivor Series 2011. He used his iconic voice to announce WWE Champion CM Punk before his title defense in Madison Square Garden. Howard Finkel was welcomed into the WWE Hall of Fame in 2009.\nBobby “The Brain“ Heenan\nEveryone from Jim Cornette to CM Punk says that Bobby “The Brain“ Heenan is the greatest to ever be in the business. The man was a trifecta. He was an accomplished wrestler who turned into a box office manager and became one of the all-time greatest color commentators in wrestling history.\nBobby Heenan’s heel persona helped Andre the Giant vs. Hulk Hogan set an attendance record of over 93,000 people at WrestleMania III. His managerial skills made stars out of many WWE Hall of Famers, including Mr. Perfect, “Ravishing“ Rick Rude, and Ric Flair, among so many others.\nWhen Heenan retired from managing, he made his way behind the desk. His quick wit made even the most boring matches memorable. Plus, who can forget his banter and skits with the likes of Gene Okerlund, Gorilla Monsoon, and Lord Alfred Hayes?\nBobby Heenan left WWE for WCW in 1994. He was a part of many memorable moments, including calling Hulk Hogan’s famous heel turn when the nWo was formed at Bash at the Beach in 1996.\nToward the end of WCW, Bobby Heenan grew frustrated with the company. He would get into fights with Tony Schiavone on air. Many report that The Brain would even be drunk on set at times.\nBobby Heenan would return to WWE in 2001. He called the Gimmicks Battle at WrestleMania X7 with Gene Okerlund. WWE recognized Bobby Heenan in the 2004 Hall of Fame Class.\nLord Alfred Hayes\nIf you grew up on WWE Superstars of Wrestling and Prime Time Wrestling, then you are familiar with the voice of Lord Alfred Hayes bellowing, “Promotional consideration paid for by the following,” before cutting to adverts. Lord Alfred Hayes’ distinct British voice made him a standout on the WWE announce team.\nHe was their shill man for everything from ice cream bars to action figures to home videos. In fact, Lord Alfred Hayes was also the host of many home videos.\nBesides hosting and selling merch, the former wrestler would get behind the announce desk on occasion. Your Lordship has called matches on Saturday Night’s Main Event, All-American Wrestling, Superstars of Wrestling, and other old-school shows.\nLord Alfred Hayes also worked for the production team backstage. He would provide French commentary for international dubbing. While he never had an official Hall of Fame induction, Lord Alfred Hayes entered the Legacy Wing for the Class of 2018.\n“Rowdy“ Roddy Piper\nJust when they think they’ve got the answers, Roddy Piper changes the questions. That’s what made the Hot Rod such a joy to listen to in the commentary seat.\nRoddy Piper had the gift of gab, which made him a hated villain as host of Piper’s Pit. After getting into a fight with Adrian Adonis on the Flower Shop, Roddy Piper won over the fans. Without changing his personality, Roddy Piper would become one of the most popular color analysts in WWE during the late 80s and early 90s.\nHe would eventually get back into the ring around 1992. Hot Rod would eventually become WWE President in 1996, sanctioning the historic Iron Man Match between Shawn Michaels and Bret Hart at WrestleMania XII. Piper would leave WWE shortly after defeating Goldust at the same Pay-Per-View event in a Hollywood Back Lot Brawl.\nThe Scotsman would join WCW at Starrcade 1996 to reignite his long-time feud with Hulk Hogan. These two would continue their rivalry for many years. Piper would continue to wrestle sporadically, even picking up a WWE Tag Title win with Ric Flair in 2006. Roddy Piper entered the WWE Hall of Fame with the Class of 2005.\n“Macho Man“ Randy Savage\nThe “Macho Man“ is one of the most colorful characters in WWE history. It was a shock when the multi-time WWE Champion seemingly retired in the mid-90s to join the commentary desk full-time. However, it was always a pleasure to hear Macho Man on the mic.\nAfter The Ultimate Warrior defeated Randy Savage in a Retirement Match at WrestleMania VII, Macho Man slowly came back to TV as a commentator. He would join Superstars of Wrestling before becoming the lead color analyst on Monday Night Raw.\nAccording to Randy Savage’s brother in the star’s documentary, Savage didn’t like commentary. He wanted to get in the ring, but Vince McMahon wouldn’t let him. So, Randy Savage quit WWE and joined WCW in late 1994. In a rare moment, Vince McMahon sat at the commentary table and acknowledged Randy Savage’s departure. While Vince wished him the best, the two never made amends. Randy Savage died in 2011 and was inducted into the WWE Hall of Fame in 2015.\nJim Ross\nPerhaps no voice is more synonymous with WWE’s Attitude Era than “Good Ol’ JR.“ Jim Ross first got recognition for his talents in the Mid-South territory. The Oklahoma native eventually made his way to WCW, where he became a lead announcer in the late 80s and early 90s.\nJim Ross moved to WWE in 1993, making his debut in a toga at WrestleMania IX. He would play second fiddle to Vince McMahon, Jerry Lawler, and other WWE commentators. Many believed Vince McMahon never liked Jim Ross’ southern voice.\nJim Ross has a long history of being fired in WWE. His releases came after bouts of Bell’s Palsy, which left his face partially paralyzed. However, fans kept demanding for JR to come back. When he made a full recovery, he became the full-time lead announcer of Monday Night Raw.\nWhen the Attitude Era hit a fever pitch, Jim Ross was also the Head of Talent Relations. He had his finger in so many aspects of the business and was hitting on all cylinders. At its peak, JR had undeniable chemistry with Jerry “The King“ Lawler. Jim Ross played the perfect straight man to the heel and chauvinistic antics of The King. The two would be paired together for over a decade, creating a lifetime of memories for fans for decades to come.\nIn addition to being a great commentator, JR was the go-to person for in-depth interviews. His sit-down interviews made stars of Stone Cold Steve Austin, Mick Foley, and Kane. In fact, these types of interviews are replicated to this day.\nJR’s commentary role became diminished when he was drafted to SmackDown on live television in 2008. The Hall of Famer had no idea about the switch and was visibly upset on air. At this time, Michael Cole took JR’s spot as the lead announcer of Raw. It took Michael Cole decades to finally win the fans over after this replacement.\nJR would continue with WWE for a few more years, with his commentary role dwindling. He was eventually fired after hosting a panel for the WWE 2K14 video game during SummerSlam weekend. Ric Flair was drunk onstage and hijacked the panel, which upset WWE brass. While JR was let go, they brought him back not too long later, after his wife tragically passed away in a car accident.\nAfter JR’s contract expired, he made his way to AEW. Jim Ross was one of the original AEW announcers. He’s been battling health problems over the last few years, but still calls occasional matches for AEW. Good Ol’ JR was inducted into the WWE Hall of Fame in 2007.\nJerry “The King“ Lawler\nWhen you think of JR, you can’t help but think of Jerry Lawler. “The King“ was a huge star in the Memphis territory. His wrestling career has spanned five decades. As his first passion, no one ever thought that he’d have a side career as a WWE announcer that would last half as long!\nJerry Lawler first joined WWE in 1992 as a wrestler. He was cast as a top villain by being placed in a feud with Bret “The Hitman“ Hart. During this time, Lawler would harass Hart’s family, even confronting his parents on the balcony and making jokes about their age. The fans got a taste of the verbal abilities of Lawler and were about to get a lot more of it.\nWhen Lawler failed to connect with WWE fans as a full-time wrestler, he transitioned to a commentator. Jerry Lawler was the antagonist for many lead announcers, including Vince McMahon, Jim Ross, and Michael Cole.\nHe was known for heelish remarks and, during the Attitude Era, his insatiable thirst for “puppies.“ Jerry Lawler would remain the main color analyst on Raw for almost two decades. He even died in the seat at one point.\nJerry Lawler wrestled a match in 2012 where he received multiple Elbow Drops from Dolph Ziggler. After the match, Jerry Lawler would continue commentary. During the show, Jerry would have a heart attack while announcing. He’d return to the desk, staying until 2015, when he was moved to SmackDown. Lawler would continue to commentate and appear on Kickoff show panels sporadically until 2020.\nJerry Lawler joined the Hall of Fame in 2007 when he was inducted by William Shatner. “The King‘ served as the Master of Ceremonies for the Hall of Fame for many years. However, he’s battled many health problems as of late, which has caused him to forgo emcee duties during the last couple of WrestleManias.\nPaul Heyman\nBefore being a Wise Man, Paul Heyman was a wiseass on the announce table. While Paul Heyman was a manager as Paul E. Dangerously in WCW, he started filling in on the commentary booth on WCW Saturday Night, Main Event, and Clash of the Champions telecasts.\nEventually, Heyman was let go by WCW. He would join ECW and become their Head Booker and Owner. In 2001, ECW was going bankrupt. At this time, Jerry Lawler quit WWE when they fired his wife, The Kat.\nEnter Paul Heyman. Paul Heyman joined Monday Night Raw as Jim Ross’ new partner. The two didn’t get along onscreen and pushed each other’s buttons offscreen as well. Their banter worsened when Paul Heyman joined the WCW/ECW Alliance against WWE during the Invasion. These two would verbally spar to create the soundtrack over one of the most popular WrestleManias of all-time, WrestleMania X7.\nWhile Paul Heyman and JR had buzzworthy chemistry, their partnership was short-lived. Jerry Lawler returned to WWE in November 2001, and Paul Heyman was removed from the announce booth.\nShortly after, he’d go on to manage Brock Lesnar and begin his ascent to become, perhaps, the greatest manager of all time. Paul Heyman entered the WWE Hall of Fame in 2024 in Philadelphia. As you’d expect, Heyman went to the extreme with an expletive-filled acceptance speech.\nJohn Bradshaw Layfield\nJBL is more than just the longest-running WWE Champion in SmackDown history. The brash Texan-turned-New Yorker is also one of the most popular heel commentators of all time.\nJBL and Michael Cole became a popular duo when Bradshaw hung up the boots in 2006. They partnered together for many years to call SmackDown and Pay-Per-View events.\nIn 2013, JBL would join Monday Night Raw for a three-man booth that also consisted of Michael Cole and Jerry Lawler. Four years later, JBL moved back to SmackDown until he retired from commentary in 2017.\nJBL was inducted into the WWE Hall of Fame in 2020. He continues to pop up all over the wrestling scene today. We might hear him put the headset back on again in the future!\nMick Foley\nHe was an excellent promo artist and a best-selling author. Therefore, you’d think Mick Foley would transition to commentary seamlessly. It’s safe to say that his 2013 Hall of Fame induction was for his time as a competitor and not a commentator.\nMick Foley became a commentator on SmackDown in 2008. However, his run had a black cloud over it. Foley was paired with Jim Ross, who was blindsided by the announcement on live television that JR was being swapped from Raw to SmackDown.\nMick Foley would remain a commentator for a year. He ended up quitting because he was tired of hearing Vince McMahon berate him in his ear while he was calling the action.\nBooker T\nBooker T is a 5-time WCW Champion, but he’s also a 2-time Hall of Famer. While Booker T is a popular WWE announcer, his Hall of Fame nods are mostly for his in-ring work.\nBooker T first joined the WWE Hall of Fame as a solo act in 2013. He would be inducted for a second time in 2019 as a member of Harlem Heat, alongside his brother, Stevie Ray.\nBeth Phoenix\nNot only is Beth Phoenix a Hall of Famer and 4-time World Champion, but she has also become quite an accomplished WWE announcer. The Glamazon started dabbling in commentary around 2018. She was a guest commentator for the Mae Young Classic, Mixed Match Challenge, and the inaugural Women’s Royal Rumble Match.\nBeth Phoenix joined the NXT commentary team full-time in 2019. During her time, she worked with various talents, including Mauro Ranallo, Nigel McGuinness, and Wade Barrett. While she was gaining a lot of buzz as a commentator, Beth Phoenix decided to step down from her role in 2021.\nAround this time, her husband, Edge, had become a full-time wrestler for WWE again. So, Beth Phoenix decided to spend more time at home with the kids. While she is retired, Beth Phoenix teamed with Edge at the Royal Rumble 2022 to defeat The Miz and Maryse.\nBeth Phoenix is not currently under contract to any wrestling company, but you can hear her say the words, “You think you know me?“ before Edge (now Cope) comes down the aisle in AEW. The trailblazer was inducted into the WWE Hall of Fame in 2017.\nGordon Solie\nIf you have ever heard an announcer say that a bloody competitor is wearing a “crimson mask,“ you can thank Gordon Solie. One of the most recognizable voices in wrestling, Gordon Solie was a ring announcer and commentator during the golden years of wrestling. His most notable role was as the lead announcer in the 1960s for the trailblazing Championship Wrestling from Florida (CWF).\nIn the 1970s, Gordon Solie worked with the NWA and Georgia Championship Wrestling. As the 80s came to a close, Gordon Solie would sign with Jim Crockett Promotions, which became WCW. Solie would provide commentary for many shows, including Clash of the Champions.\nWhen WCW entered the 1990s, Gordon Solie started to do more backstage interviews before transitioning to rundowns and recaps. He retired in 1995. The late star entered the WWE Legacy Wing of the Hall of Fame in 2008.\nEric Bischoff\nWhile Eric Bischoff wasn’t a WWE announcer, he was one for WCW. Eric Bischoff was a lead announcer for WCW Monday Nitro while he was also serving as the President of the company. During this time, Eric Bischoff helped ignite the Monday Night War that catapulted the Attitude Era to meteoric levels.\nAs the voice of WCW, Eric Bischoff helped drive the nWo storyline. When he joined the heel faction, it helped propel WCW to defeat WWE for 83 weeks.\nWhile WWE won the war, Eric Bischoff was happy to do business with WWE. He would join the company, serving as Raw General Manager for many years. Eric Bischoff was inducted into the WWE Hall of Fame in 2021.\nMichael P.S. Hayes\nMichael Hayes is one of the most creative minds in wrestling history. He came up in the South as a wrestler, quickly gaining notoriety with the Fabulous Freedbirds in the Mid-South and NWA.\nMichael Hayes wasn’t the best mat technician and eventually found himself in more of a managerial role to other Freebird members. As Michael started to transition out of the ring, he would provide commentary for various WCW shows, including Main Event.\nHayes debuted in WWE as Dok Hendrix in 1995. He would host Slam Jams, which were infomercials for merchandise or upcoming shows. In addition, Dok Hendrix was the lead color commentator on the show Action Zone.\nMichael Hayes’ onscreen role was short-lived. Besides a short run as the manager of the Hardy Boyz in 1999, Michael Hayes has been mostly behind the scenes. Today, he plays a key role in many Main Event matches. He is a key producer for the Bloodline and Royal Rumble. Michael Hayes was inducted into the WWE Hall of Fame along with the Freebirds in 1996.\nOther Notable WWE Announcers from the Past\nWWE announcers make lasting impacts on the careers of wrestlers and memories of fans. While many deserve to be in the Hall of Fame or on TV, there is only so much room. However, these notable WWE announcers shouldn’t be forgotten!\nVince McMahon\nOne of the most synonymous names with WWE is Vince McMahon. Not only was he the Chairman of the company for over 40 years, but he was also the voice of the brand for multiple generations.\nVince McMahon got his start in wrestling as an announcer for his father, Vincent James McMahon. He would play the lead announcer for almost 25 years. Many people pan Vince’s commentary in retrospect. He had a tendency to call action as he saw it and yell, “What a maneuver!“ quite often.\nAs the Attitude Era started to unfold, Vince’s role as Chairman was becoming increasingly evident. During this time, Bret Hart would regularly get out of the ring to argue with Vince McMahon at the announce desk.\nIn 1997, Vince McMahon removed himself from the Raw announcement desk, leaving duties to the likes of Jerry Lawler, Jim Ross, and Michael Cole. However, Vince still didn’t acknowledge his behind-the-scenes role until the Montreal Screwjob, where he forced the ring announcer to ring the bell, so Bret Hart would lose the WWE Title to Shawn Michaels.\nAfter that, Vince McMahon became the most hated heel in the history of the business. However, some of Vince’s most iconic calls still live on in video packages to this day, including “Welcome to WrestleMania,“ The boyhood dream has come true,“ and “That’s gotta be Kane!”\nMel Phillips\nA name not often used fondly, Mel Phillips is the disgraced former WWE ring announcer who is still being accused of molesting ring boys in the 1980s. Mel Philips served as the ring announcer for WrestleMania III & IV, as well as various weekly television shows.\nThe ring announcer also had a prominent role backstage. He helped produce backstage segments and handled administrative tasks. Mel Phillips was also in charge of hiring the ring crew. He would hire underage boys and was accused of grooming and molesting them.\nIn 1992, Mel Phillips, Pat Patterson, and Terry Garvin were all fired for the allegations in the Ring Boys lawsuit. Pat Patterson was eventually brought back, but the other two never returned.\nThe Ring Boys lawsuit is still rearing its ugly head for the McMahon family. Vince and Linda McMahon, as well as WWE, have been named in a new investigation. These allegations had come to light once when Linda McMahon became a member of Donald Trump’s Cabinet.\nMike McGuirk\nBefore Samantha Irvin could run or Lillian Garcia could walk, Mike McGuirk crawled for women’s wrestling announcers. As the daughter of Leroy McGuirk, Mike was a second-generation star. The trailblazer became the first female WWE ring announcer.\nShe started with the company in the mid-80s and continued to call the action until she left WWE in 1993. Mike McGurik announced for many Coliseum home videos and syndicated shows. She was also the voice used in the highly acclaimed WWF WrestleFest arcade game!\nTony Chimel\nTony Chimel started as a ring announcer for WWE in the mid-80s. He was used on House Shows because he was friends with Gorilla Monsoon’s son, Joey Marella. Marella was a referee who tragically died young in a car accident.\nChimel would become a member of the production team before getting his big break in the 1990s and 2000s as the SmackDown ring announcer. The veteran announcer reached iconic status when he started drawing out the u’s when announcing Edge’s nickname. He’d famously say, “The Rated R Suuuuuuperstar.“\nLong after Tony Chimel stopped announcing on TV, Edge would have him make the ring announcement for the Rated R Superstar’s sporadic appearances. Sadly for Edge, Tony Chimel couldn’t make the announcement for his final WWE run. Tony Chimel was released by WWE in 2020.\nTodd Petengill\nWhen you think of mid-90s WWE, it’s hard not to think of Todd Petengill. That vibrant personality and mullet were all over the WWE TV studios, hosting everything from LiveWire to Action Zone to home videos.\nPerhaps, most famously, Todd Petengill was the host of the semi-monthly In Your House events. In fact, he was brought back to host the greatest hits of In Your House for WWE Home Video and has made appearances at NXT TakeOver events with the In Your House branding.\nLillian Garcia\nLillian Garcia is one of the longest-tenured WWE announcers in history. The singer-turned-announcer slowly earned the respect of fans after filling the large shoes of Howard Finkel. Many would give Garcia a hard time for flubbing names, but she powered through and became an icon for women in WWE.\nLillian Garcia has been used as an announcer for every major show and event. She also sang America the Beautiful at WrestleMania, Tribute to the Troops, and other key events.\nLillian Garcia took a few breaks from WWE but left for good in 2016 to take care of her mother. She would still make occasional appearances, even showing up in 2024 to pass the torch to Samantha Irvin. However, she’d take that torch back when Samantha quit WWE. Lilliam Garcia filled in to be the ring announcer for SmackDown in 2025.\nTerri Runnels\nPerhaps one of the most forgotten Divas of all time, Terri Runnels had a long and successful career in WWE. She started her career as a makeup artist in WCW. However, she would quickly get cast into the role of Alexandra York, managing the likes of Hall of Famers Mike Rotunda and Ricky Morton, as well as Mr. Hughes and Terry Taylor. During her time at WCW, she met her future husband, Dustin Rhodes.\nTerri debuted in WWE as Marlena. She was the manager of Goldust, portrayed by her husband, Dustin. Marlena and Goldust were among the hottest acts in WWE. However, their marriage started to fall apart behind the scenes.\nThe duo split onscreen in 1997. Goldust would move on to work with Luna Vachon before leaving WWE. However, Marlena remained with the company, settling into her new role as Terri.\nAt first, Terri remained a manager. She would manage Val Venis and then join forces with Ryan Shamrock and Jacqueline to create Pretty Mean Sisters (PMS). Terri even managed Perry Saturn, who dumped her because he was in love with Moppy…a mop.\nWith her managerial career behind her, Terri transitioned to a backstage interviewer. She was used regularly on Raw, SmackDown, and Pay-Per-View. As Trish Stratus became regularly used on WWE TV, Terri took over her hosting gig as an anchor for WWF Excess.\nJosh Mathews\nJosh Mathews started his wrestling career as a hopeful on WWE Tough Enough. While he didn’t win the contract, he earned one that lasted over a decade. Josh Mathews would join WWE as a backstage interviewer and host for divas contests.\nEventually, Josh earned his way behind the commentary desk. He started off as the play-by-play man for Velocity. Eventually, he graduated to ECW and NXT. Josh Mathews reached his peak in WWE as the lead announcer for SmackDown. He was in that role for almost three years before being sent to WWE Superstars and Saturday Morning Slam.\nJosh Mathews was released in 2014. He would join TNA, where he’d meet his future wife, Madison Rayne. Josh Mathews was recently released by TNA as the company’s partnership with WWE strengthened in 2025.\nJonathan Coachman\nIf you want a key example of a backstage talent who became a main onscreen character, look no further than Jonathon Coachman. The Coach started off as a minor character, often serving as the butt of a joke for The Rock.\nHe started his commentary work on Heat, teaming with Al Snow. The two got into a rivalry with Jerry Lawler and Jim Ross over being announcers for Raw. In fact, the two teams faced off for the rights to be Raw commentators at Unforgiven 2003. Coach and Al Snow won, but Lawler and Ross would get their spots back quickly.\nDuring this time, Coach became an assistant to Raw General Manager Eric Bischoff. Coach really honed his heel persona, getting involved in rivalries with the likes of Stone Cold Steve Austin and Batista.\nCoach became a full-time Raw commentator in 2005, where he remained until he left in 2008. The former WWE talent would move on to big gigs with ESPN. This opened the door for a temporary return to WWE in 2018. He was briefly placed in a three-man booth with Michael Cole and Corey Graves.\nIt became obvious that Coach lost a step. He was moved to backstage roles and added to Pre-show panels before being quietly released. Around this time, Jonathan Coachman was accused of sexual harassment by female ESPN co-workers. Coach hasn’t been on WWE TV since.\nJoey Styles\n“Oh my God!“ Joey Styles was a dark horse when it came to WWE longevity. However, the ECW alumnus had a pretty decent career as a WWE announcer.\nJoey Styles rose to fame as a solo announcer for ECW for the majority of the company’s run. An ECW loyalist to the bitter end, nobody expected Joey Styles to ever become a WWE employee. However, he got the call to be the lead announcer when WWE decided to throw a tribute Pay-Per-View in 2005 called One Night Stand.\nLittle did WWE know that One Night Stand would become a long-time stand. Vince McMahon would eventually resurrect ECW, launching a show on Syfy. Joey Styles and Tazz were the commentators for the highly panned reboot.\nJoey Styles became the lead announcer for Raw in 2005. However, his gig only lasted a year. The star would cut a famous “worked shoot“ promo on Raw, talking about how horrible it was to work for WWE and quit on the air. He would return to ECW until 2008, when he decided to retire from commentary.\nWhile Joey Styles did remain off TV, he was a key figure in WWE’s digital team back in Stamford. He was fired in 2016 after a Facebook Q&A with Cathy Kelly. During the interview, he criticized the company, including the announcing teams.\nJoey Styles would dip his toes back into commentary by becoming the lead announcer for Chikara and Evolve after his WWE release. However, Joey would make an inappropriate joke about grabbing a woman’s body part on Evolve.\nThis controversial joke was a reference to a viral comment Donald Trump had made. However, Chikara and Ecolve felt it crossed the line and both companies broke ties with Styles. Following the termination, Joey Styles left the limelight. He deleted his Twitter and hasn’t been seen on any wrestling circuits.\nTazz\nTazz started his career as a badass wrestler. However, he has evolved into one of the longest-running commentators in wrestling history. Tazz first joined WWE from ECW in 2000. He came in with a lot of fanfare, defeating the undefeated Kurt Angle in record time at the Royal Rumble in front of a capacity crowd in Madison Square Garden.\nIt only went downhill for Tazz from there. Tazz would be relegated to opening matches and, eventually, lost in the Hardcore Title scene. Seeing the writing on the wall, Tazz would retire from in-ring competition and put on a headset.\nHe joined the SmackDown commentary team and created an iconic duo with Michael Cole. Tazz would sit at the SmackDown desk for seven years. During that time, WWE launched its reboot of ECW. Tazz also served as the lead color commentator for three years on the failed show.\nTazz would join TNA, where he was a commentator for six years. He joined AEW in 2019 and has also been a regular member of the commentary team. It seems like a matter of time before Tazz gets inducted into the WWE Hall of Fame for this massive body of work.\nMatt Striker\nAs a teacher, it seemed like the perfect fit to put Matt Striker behind the commentator’s booth. The educator first joined WWE after a news story broke that Matt Striker was using sick time as a teacher to make indy dates.\nWWE would sign Matt Striker as a wrestler. However, they turned him into a manager, pairing the orator with Big Daddy V. Eventually, WWE decided to transition Matt Striker to the commentary booth.\nHe would team up with Todd Grisham to develop a sleeper for the commentary team. They even won a Slammy Award for their efforts.\nMatt Striker would move on to announce both Superstars and SmackDown around 2009. Both gigs lasted for two years until he was removed from the desk. Many feel he used too many insider terms like “marking out.“\nInstead of commentating, Striker became the host of the original incarnation of NXT. He would remain on the black and gold brand until his release in 2013. Matt Striker would continue to provide commentary for various promotions afterward, including Lucha Underground, AAA, and MLW.\nTodd Grisham\nAt one time, many thought Todd Grisham would become the voice of WWE. However, he was never given the real opportunity to get to the next level. Todd Grisham joined WWE as a commentator for Heat alongside Jonathon Coachman.\nAfter Heat was canceled, Todd Grisham joined the ECW roster. Here, he earned a Slammry Award with his co-announcer Matt Striker. It seemed like Grisham was destined for great things when he was called up to SmackDown. However, his role only lasted a year. He was replaced by Josh Mathews and demoted to NXT until he was released in 2011.\nJoJo Offerman\nJoJo joined WWE as a member of the first Total Divas roster. The show followed JoJo and Eva Marie as newbies in the business. However, it became clear that JoJo was not made to take bumps.\nHowever, she has a set of pipes. So, WWE transitioned JoJo out of the ring and made her the ring announcer for Raw. She would eventually be the lead announcer for many big events. However, WWE started slowly phasing JoJo out.\nBackstage, JoJo and Bray Wyatt fell in love and had a baby. They were engaged to be married when Bray Wyatt tragically passed away. JoJo is still supported by WWE through Bray Wyatt merchandise. However, she recently did ring announcing for one dark match before AEW Collision in Janaury 2025. We will see if JoJo comes back to wrestling.\nRenee Young\nRenee Young made wrestling cool for females, and she was a huge hit with the WWE Universe. The talented orator made her way to WWE from Score Television Network in Canada, where she hosted post-Raw content on The Aftermath.\nRenee has a history of improv and acting training. She made it her goal to become the new “Mean Gene.“ The two hosted classic WWE content together, and Renee would channel that wit into interviews on Raw and SmackDown.\nEventually, Renee would be the first female to join the commentary team, getting her start on NXT. She quickly graduated to the main roster and remained on Raw for a year before stepping down from the position.\nShe always said that commentary didn’t feel like the right fit for her. Eventually, Renee parted ways with WWE, citing that she wanted to do more with her career. She would follow her husband, Jon Moxley, to AEW. Today, Renee Young is a backstage interviewer under her real name, Renee Paquette.\nMauro Ranallo\nMauro Ranallo was a popular WWE hire among the fans. Unfortunately for the Bipolar Rock ‘N Roller, he didn’t enjoy his time with the company too much.\nThe MMA and boxing announcer joined WWE SmackDown as the lead commentator in 2016. However, his stint on the main roster didn’t take too long. Mauro Ranallo was paired with JBL, which was not a good match. JBL would pick on Mauro onscreen and offscreen, which was getting to the Bipolar Rock ‘N Roller.\nThe final straw seemed to happen when JBL picked on Mauro Ranallo for winning Best Television Announcer for the Wrestling Observer Awards. Mauro would take a leave of absence from WWE TV to deal with mental health issues.\nTo this day, JBL denies any malice in bullying Mauro Ranallo. Since then, Mauro hasn’t confirmed JBL’s involvement and insists that travel duties and mental health problems caused the breakdown.\nIt seemed like Mauro Ranallo was done with WWE, but he ended up returning as a member of the NXT commentary team. He brought his enthusiasm and “Mama Mia!“ exclamations to the black and gold brand, which felt like a much better fit.\nMauro Ranallo spent three years in NXT. He left the WWE in 2020 to pursue other projects. Most notably, Mauro Ranallo became the lead-time announcer for Showtime Championship Boxing.\nCharly Caruso\nCharly Caruso was an on-the-scene news reporter before making it to WWE. However, that experience surely helped her navigate the breaking news on WWE Raw. The star started off in NXT as a ring announcer in 2016, but she quickly graduated to the main roster to get the scoop from Superstars backstage.\nShe worked for WWE for five years as a talk show host, backstage interviewer, and pre-show analyst. One of her most memorable roles was hosting Raw Talk with R-Truth. Many viewers loved their witty banter.\nCharly Caruso would leave WWE in 2021 to pursue other interests under her real name, Charly Arnolt. However, she didn’t venture far from the TKO family as Charly Arnolt became the first female ring announcer for UFC. She also provides political commentary for the Republican Party.\nKayla Braxton\nKayla Braxton became one of the most popular backstage interviewers and pre-show hosts during her WWE tenure. Many fondly remember her back-and-forth bickering with Paul Heyman. Paul Heyman always insisted that Kayla had a crush on him when she was trying to get the latest news about the Tribal Chief.\nKayla Braxton left WWE in 2024 to pursue other projects. She still talks fondly about her time in WWE. It seems like the door is always open for a potential return.\nSamantha Irvin\nPerhaps no other WWE announcer had endeared themselves to the WWE Universe as quickly as Samantha Irvin did. The singer and former America’s Got Talent contestant took the wrestling world by storm with her powerful vocals, unique calls, and viral social media videos.\nSamantha Irvin was recruited into wrestling by Mark Henry. She signed with WWE in 2021 and started working as a backstage interviewer for NXT and 205 Live.\nWWE saw a star in Samantha and immediately put her on SmackDown as the lead ring announcer in 2023. By the end of the year, she became the primary ring announcer for both shows.\nWWE invested a lot of time into Samantha Irvin. They hired social media creators to follow her reactions during live shows and even used her entrance call at the top of Chelsea Green’s music.\nIn 2024, Lillian Garcia came on Raw to announce Kofi Kingston’s entrance. She also symbolically passed the torch to Irvin during an in-ring segment. So, it was a shock to many when Samantha Irvin requested her release by the end of the year and was replaced by none other than…Lillian Garcia.\nSamantha Irvin stated that she wanted to work on her music career. However, she also noted that she didn’t want to be a WWE announcer. Samantha Irvin wanted a different role, but WWE didn’t want to pursue that avenue.\nMany believed that Samantha Irvin would follow her husband Ricochet to AEW, but that hasn’t been the case yet. She did, however, do her first post-WWE wrestling event during WrestleMania week in Las Vegas. Samantha performed and sang during the live show The Last Match: A Pro Wrestling Rock Experience.\nScott Sanford\nScott Sanford is one of the longest-running announce team members in WWE history. The news anchor started with the company in 2009 and still records content for them to this day.\nScott Sanford does a lot of studio work, much like Todd Petengill used to. You might have seen Scott on Bottom Line, Raw Talk, or Low Down. He was also the lead commentator for WWE Superstars in the mid-2010s. He is not currently on TV but is still used for various in-studio productions.",
  "word_count": 10685,
  "scraped_at": "2026-02-14T12:11:54.239711"
}