{
  "article_id": "0b207827b8d1",
  "url": "https://www.globenewswire.com/news-release/2024/09/24/2952099/0/en/Brera-Holdings-PLC-Approved-to-Dual-List-Internationally-on-Upstream.html",
  "title": "Brera Holdings PLC Approved to Dual List Internationally on",
  "date": "20240924T124500Z",
  "domain": "globenewswire.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Brera Holdings PLC has been approved to dual list its shares on Upstream\nDublin, Ireland, Sept. 24, 2024 (GLOBE NEWSWIRE) -- Brera Holdings PLC (“Brera” or the “Company”) (Nasdaq: BREA) today announced it has been approved to dual list its shares on Upstream, a MERJ Exchange market and global securities trading app. Trading becomes available on Upstream on Tuesday October 1st at 10:00am ET under the ticker symbol ‘BREA’.\nThe dual listing on Upstream is designed to provide Brera the opportunity to access a global investor base outside the U.S. that can trade using credit, debit, PayPal, or USD$ unlocking liquidity and enhancing price discovery while globalizing the opportunity to invest in Brera, the only publicly traded multi-club ownership company focused on football (soccer). Brera will soon be able to offer its non-U.S. shareholders, investors, fans and followers unparallelled access to its securities in diverse countries where its teams compete, such as Macedonia, Mozambique, and Mongolia\nPierre Galoppi, CEO of Brera Holdings, stated, “This dual listing on Upstream presents an incredible opportunity for investors and fans to actively participate in professional sports club ownership through an international portfolio of teams on three continents. As the investment landscape in pro sports evolves, we are committed to democratizing access to this global game, allowing more people to engage with and support their favorite clubs. We believe we can create value by continuing to build out our multi-club ownership group, leveraging player trading and group commercial activities to enhance our overall impact and success, ultimately generating shareholder value and delivering returns.”\nInvestors and current Brera shareholders outside the U.S. can get ready to trade by downloading Upstream from their preferred app store at https://upstream.exchange/, creating an account by tapping Sign Up, and completing a KYC identity verification by tapping the profile icon on the home screen and tapping KYC.\nTraders on Upstream’s smart contract-powered platform will experience real-time trading and settlement, and a transparent order book that does not permit common market manipulations.\nPierre Galoppi, CEO of Brera, commented, “Building shareholder value is an ongoing goal of ours at Brera. We believe a dual listing on Upstream’s next generation market greatly supports this goal as we continue to develop and introduce initiatives and milestones that we’re excited to share with our international audience.”\nDetails on the Brera listing and deposit and trading instructions can be found at https://www.breraholdings.com/investor-relations. The Upstream market is open 5 days a week, 20 hours a day, Monday to Friday: 10:00am to 06:00am UTC+4 (1:00am to 9:00pm EST).\nTRANSFERING BRERA SHARES TO UPSTREAM:\nExisting non-U.S. shareholders may initiate the transfer of their shares by opening Upstream, tapping Investor, Manage Securities, Deposit Securities, then entering the ticker symbol ‘BREA’ and the number of shares to deposit, and tapping Submit. Next, investors enter their brokerage firm name and brokerage account number, then tap Submit. Lastly, investors tap Add E-Signature, sign their name on the screen using their finger, tap Done, and then tap Sign.\nAfter completion of the deposit request on Upstream, shareholders will receive via email an executed deposit form to submit to their current brokerage firm to initiate a withdrawal to the transfer agent. Shares will not be transferred without notifying the current broker and requesting a withdrawal. On listing day, shareholders will receive a push notification once the shares are deposited and available for trading on Upstream.\nABOUT BRERA\nBrera (Nasdaq: BREA) is focused on expanding its social impact football (American soccer) business by developing a global portfolio of emerging football and other sports clubs. The Company aims to create increased opportunities to earn tournament prizes, gain sponsorships, and provide professional football and sports-related consulting services.\nBrera is building on the legacy and brand of Brera FC, the first football club acquired by the Company in 2022. Brera FC, known as \"The Third Team of Milan,\" has been cultivating an alternative football legacy since its founding in 2000. The Company owns the trademarked FENIX Trophy Tournament, a nonprofessional pan-European football competition recognized by UEFA, which was inaugurated in September 2021 and organized by Brera FC. The FENIX Trophy has been described by BBC Sport as \"the Champions League for amateurs,\" with ESPN covering the 2024 FENIX Trophy finals. In October 2022, the Internet Marketing Association awarded Brera FC for \"Social Impact Through Soccer,\" recognizing the Company's international efforts.\nIn March 2023, Brera expanded into Africa with the establishment of Brera Tchumene FC, which was admitted to the Second Division League in Mozambique. The team won its post-season tournament and was promoted to Mocambola, the First Division in November 2023. The Company also acquired 90% of Fudbalski Klub Akademija Pandev, now known as Brera Strumica FC, in North Macedonia.\nAdditionally, in June 2023, Brera acquired a strategic stake in Manchester United PLC, achieving a 74% realized gain on part of the investment. In July 2023, the Company completed the acquisition of a majority stake in the Italian Serie A1 women's professional volleyball team, UYBA Volley S.s.d.a.r.l. The following month, Brera took control of Bayanzurkh Sporting Ilch FC in Mongolia, rebranding it as Brera Ilch FC. Plans for an Italian Serie B football club acquisition were announced in January 2024.\nIn June 2024, the North Macedonian women’s football club Tiverija Strumica officially became part of the Brera family, forming a wholly-owned subsidiary, Women's Football Club Tiverija Brera AD Strumica. Brera Holdings PLC is dedicated to creating bottom-up value from undervalued sports clubs, driving innovation, and achieving socially impactful outcomes. For more information, visit www.breraholdings.com.\nABOUT UPSTREAM\nUpstream, a MERJ Exchange market (https://merj.exchange/), is a global securities trading app. Powered by Horizon's proprietary, transparency-first, matching engine, Upstream allows investors outside of the U.S. to trade securities using just an app.\nUpstream is a MERJ Exchange market. MERJ Exchange is a licensed Securities Exchange, an affiliate of the World Federation of Exchanges, a National Numbering Agency, and a member of ANNA. MERJ is regulated in the Seychelles by the Financial Services Authority, https://fsaseychelles.sc/, an associate member of the International Association of Securities Commissions (IOSCO). MERJ supports global issuers of traditional and digital securities through the entire asset life cycle from issuance to trading, clearing, settlement, and registry.\nFor more information, please visit https://upstream.exchange/. Upstream is currently accepting applications to dual list at https://upstream.exchange/getlisted.\nDISCLAIMERS\nU.S. persons may not deposit, buy, or sell securities on Upstream.\nThis communication shall not constitute an offer to sell securities or the solicitation of an offer to buy securities in any jurisdiction where such offer or solicitation is not permitted. All orders for sale are non-solicited by Upstream, and a user's decision to trade securities must be based on their own investment judgment.\nMERJ operates a fair and transparent marketplace in line with international best practices and principles of operations of financial markets. Upstream does not endorse or recommend any public or private securities bought or sold on its app. Upstream does not offer investment advice or recommendations of any kind. All services offered by Upstream are intended for self-directed clients who make their own investment decisions without aid or assistance from Upstream. All customers are subject to the rules and regulations of their jurisdiction. By accessing the site or app, you agree to be bound by its terms of use and privacy policy. Company and security listings on Upstream are only suitable for investors who are familiar with and willing to accept the high risk associated with speculative investments, often in early and development-stage companies. U.S. persons may not deposit, buy, or sell securities on Upstream. There can be no assurance the valuation of any particular company's securities is accurate or in agreement with the market or industry comparative valuations. Investors must be able to afford market volatility and afford the loss of their investment. Companies listed on Upstream are subject to significant ongoing corporate obligations including, but not limited to disclosure, filings, and notification requirements, as well as compliance with applicable quantitative and qualitative listing standards.\nForward-Looking Statements\nThis press release contains information about our views of future expectations, plans, and prospects with respect to Brera's business, financial condition, and results of operations that constitute or may constitute forward-looking statements. Any and all forward-looking statements are based on the management's beliefs, assumptions, and expectations of Brera's future economic performance, taking into account the information currently available to it. These statements are not statements of historical fact. Although Brera believes the expectations reflected in such forward-looking statements are based on reasonable assumptions, it can give no assurance that its expectations will be attained. Brera does not undertake any duty to update any statements contained herein (including any forward-looking statements), except as required by law. Forward-looking statements are subject to a number of factors, risks, and uncertainties, some of which are not currently known to us, that may cause Brera's actual results, performance or financial condition to be materially different from the expectations of future results, performance or financial position. Actual results may differ materially from the expectations discussed in forward-looking statements. Factors that could cause actual results to differ materially from expectations include general industry considerations, regulatory changes, changes in local, national and international economic conditions and other risks set forth in \"Risk Factors\" included in our filings with the SEC.\nCONTACT INFORMATION:\nFOR MEDIA AND INVESTOR RELATIONS\nPierre Galoppi, Chief Executive Officer, Brera Holdings PLC\nEmail: pierre@breraholdings.com\nAttachment",
  "word_count": 1553,
  "scraped_at": "2026-02-14T12:48:13.053011"
}