{
  "article_id": "0b8a946289b6",
  "url": "https://www.yourdemocracy.net.au/drupal/node/36783",
  "title": "cartoonists of the world revolt ... or at least draw something like  je suis against le new york times that feeds me ... ",
  "date": "20231125T194500Z",
  "domain": "yourdemocracy.net.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "yourdemocracy.net.au\ndemocracy is not a spectator sport\nSaturday 14th of February 2026\n- conspiracy....\n6 hours 57 min ago - brutal USA....\n8 hours 52 min ago - men....\n9 hours 13 min ago - oil....\n9 hours 49 min ago - system....\n10 hours 36 min ago - not invited....\n11 hours 12 min ago - whistleblow.....\n1 day 32 min ago - demosocialism....\n1 day 9 hours ago - front cover up....\n1 day 9 hours ago - the trick....\n1 day 20 hours ago\nThe New York Times cuts all political cartoons, and cartoonists are not happy\nThe Times says it will turn to longer-form, graphic-novel-style commentary. Cartoonists see the move as yet another sign that the editorial-cartoon industry is foundering.\nUnfortunately, the importance of cartoonists is as big as a wet box of matches... But we do our best to shake the torpor of us...\n- By Gus Leonisky at 12 Jun 2019 - 7:25pm\n- Gus Leonisky's blog\n- Login or register to post comments\n- By Gus Leonisky at 12 Jun 2019 - 7:38pm\n- Login or register to post comments\nAcclaimed French cartoonist Jean Plantu called on the New York Times Tuesday not to ban political cartoons from its pages after a furore involving a caricature of Israeli Prime Minister Benjamin Netanyahu.\nThe artist who founded the Cartooning for Peace charity, told AFP the newspaper was wrong to bow to pressure and remove a drawing by Portuguese illustrator Antonio Moreira Antunes from its site.\n“Humour and unsettling images are part of our democracy,” Plantu said.\nNot having biting cartoons was “as stupid as asking children not to do drawings for Mothers’ Day,” he added.\nRead more:\nhttps://www.france24.com/en/20190611-france-cartoonist-plantu-stupid-new...\nread also :\nantiseptic wimps at the NYT... in ad nauseam, ad infinitum\n- By Gus Leonisky at 13 Jun 2019 - 8:16am\n- Login or register to post comments\n- By Gus Leonisky at 16 Jun 2019 - 8:51am\n- Login or register to post comments\n...\nParallel to that open sewer of satire in Georgian London were real open sewers. A lot of the humour of 18th-century satirists is coloured by the realities of urban living, and the colour is often brown. London was expanding exponentially northwards and westwards, but it was still a city with no flush toilets. No wonder, then, that there’s a kind of faecal satirical trickle-down, from Swift’s scatology, via Hogarth, to Gillray and his contemporaries. In The French Invasion; or John Bull, Bombarding the Bum-Boats, published in 1793 under a pseudonym, Gillray anthropomorphised the map of England into the body of George III, who’s firing turds out of his arse (Portsmouth) on to the French fleet. Likewise, Midas, Transmuting All into Paper, published in 1797, shows William Pitt vomiting bank notes and shitting money into the Bank of England.\nThis earthiness – “Hogarthian” defines it perfectly – didn’t necessarily age well. Swift’s dark last book of Gulliver’s Travels, which his contemporaries “got” with no trouble, led the Victorians to dismiss him as a deranged misanthrope. Gillray has suffered a similar fate, but the 18th-century audience had stronger stomachs. They had only to walk down the street to find not just shit in the gutters, but around the next corner, a child being publicly executed for stealing a bun. That said, it’s the rawness of their filthiness that makes Gillray and Hogarth far more approachable than many of their contemporaries.\nWhich gets us to the heart of the beast, and why Gillray in particular, 200 years after his death, still matters. Personally, I believe satire is a survival mechanism to stop us all going mad at the horror and injustice of it all by inducing us to laugh instead of weep. More simply, satire serves to remind those who’ve placed themselves above us that they, like us, shit and they, too, will die. That’s why, if we can, we laugh at both those things, as well as being disgusted and terrified by them. Beneath the veil of humour, there’s always a deep, disturbing darkness.\nRead more:\nhttps://www.theguardian.com/artanddesign/2015/mar/21/satire-sewers-and-s...\nGus: A paper like The New York Times needs more cartoonists, not none, to flush the often too seriously flawed slanted news down the sanitising toilets of satire.\nI dare the NYT to publish this above cartoon!\nRead from top.\nRead also:\nhttp://www.yourdemocracy.net.au/drupal/node/36561\n- By Gus Leonisky at 17 Jun 2019 - 11:12am\n- Login or register to post comments\nby Martin Rowson\nApril, it seems, really is the cruellest month for the New York Times. On 25 April, its international edition (formerly the International Herald Tribune) ran a cartoon by the Portuguese cartoonist António Moreira Antunes, previously published in the Lisbon paper Expresso and depicting Israeli prime minister Benjamin Netanyahu as a guide dog leading a blind Donald Trump. In the way of cartoons, the Netanyahu dog had a blue Star of David (presumably meant to signify the Israeli flag) dangling from his collar, while Trump wore a yarmulke.\nThere was an instant outcry condemning the cartoon’s antisemitic imagery, including in articles and editorials in the New York Times itself. As a result, the paper has decided it will no longer publish any political cartoons in the international edition (the NYT domestic paper dropped cartoons several years ago) and is terminating its contracts with in-house cartoonists Heng and the multi-award winning Patrick Chappatte. In a statement released on Tuesday, the paper announced that it would “continue investing in forms of opinion journalism, including visual journalism, that express nuance, complexity and strong voice from a diversity of viewpoints”.\nThis is a gross overcorrection, even though the outcry had some justification. While you can just about get away with claiming the blue Star of David signifies the state of Israelrather than Jewish people in general, the signification of Trump’s yarmulke is impossible to argue away: the implication is clearly that the US president has been “Judaised” by the dirty Israeli dog, both of which are common antisemitic tropes of the type notoriously published in cartoon form in the Nazi newspaper Der Stürmer.\nAs the Labour party knows to its cost, antisemitism is the most insidious of racisms and cartoonists in particular need to be increasingly careful when engaged in otherwise wholly justified images belabouring the actions of the Israeli government. This isn’t just to avoid online lynch mobs; we also need to nuance our work to make it absolutely clear that we’re condemning the Israeli government’s actions because they are rightwing nationalists (currently bizarrely cosying up to Hungarian prime minister Viktor Orbán, a blatant antisemite), and not because they’re Jewish.\nBut let’s get back to cartoons. The New York Times “disciplined” the unnamed editor responsible and announced that it would no longer be publishing any syndicated cartoons provided by CartoonArts International. But that wasn’t enough, and now the NYT cartoons are no more. Just like any other commercial enterprise, the New York Times can do what it likes, and I look forward to seeing some scathingly satirical tie-dyes in the pages of its international edition. But this cuts deeper than an over-reaction to an ill-judged cartoon. Cartoons have been the rude, taunting part of political commentary in countries around the world for centuries, and enhance newspapers globally and across the political spectrum, in countries from the most tolerant liberal democracies to the most vicious totalitarian tyrannies. As we all know, they consequently have the power to shock and offend. That, largely, is what they’re there for, as a kind of dark, sympathetic magic masquerading as a joke.\nThat’s also why the Turkish cartoonist Musa Kart is in jail, why the Malaysian cartoonist Zunar was facing 43 years imprisonment for sedition until a change of government last year; why five cartoonists were murdered in the offices of Charlie Hebdo in January 2015; why dozens of British cartoonists – including William Heath Robinson – were on the Gestapo death list. And why, for that matter, when in the late 1950s the London Evening Standard ran a cartoon by its Jewish cartoonist Vicky attacking the death penalty, this so shocked and outraged a GP in Harrow that he wrote to the paper regretting that Vicky and his family had escaped the Nazis.\nAs Kart said at his trial, cartoonists are like canaries in the coal mine – when they come for us, you know the politics is getting toxic. But we’re not just subject to the shallow vanity of tyrants or the fury of mobs. The greatest threat to cartoonists has always been the very newspapers we parasitise on. When the accountants moved in on the US newspaper industry in the 2000s, the first employees to go were the cartoonists, just like most newspapers that get closed down aren’t shut by governments but by their proprietors. Nor is it just money. I’ve been “let go” more times than I can count (the worst case was when the Times sacked me to make more room for Julie Burchill’s column, though in a previous incarnation on the Guardian’s personal finance pages in the 1980s I was redesigned off the page and replaced with what was charmingly called “a creative use of white space”).\nWe are, in short, expendable. Nonetheless, the New York Times’ decision is particularly irksome in its intoxicating combination of cowardice, pomposity, over-reaction and hypocrisy. As I observed at the beginning of this article, April is the cruellest month for the New York Times, as its much vaunted (and self-promoting) claim to be America’s “newspaper of record” was dealt an almost fatal blow when it was revealed in April 2003 that its star reporter Jayson Blair was a serial plagiarist who had fabricatedmany of his stories. You’ll note, however, that the paper did not stop using reporters altogether in order to rebuild its reputation. Nor did it issue a statement announcing that it would “continue investing in forms of news journalism, including textual journalism, that express nuance, complexity and strong voice from a diversity of viewpoints” and then fill its pages with copy from, say, accountants and astrologers. Although after the dumbness of this decision, just give it time.\n• Martin Rowson is a cartoonist and author\nhttps://www.theguardian.com/commentisfree/2019/jun/12/new-york-times-car...\nA few \"Anti-Semitic\" (they are not A-S — they are just the reality of what Israel is hypocritically doing) cartoons published on this site...\nSome by Gus, some by other penpushers:\nMore to come...\nSee also:\npoetic satire on the wrong side of democracy...- By Gus Leonisky at 19 Jun 2019 - 7:05am\n- Login or register to post comments\n- By Gus Leonisky at 19 Jun 2019 - 9:57am\n- Login or register to post comments\nNew Zealand’s immigration website deleted a fact sheet about Palestine from its website after it caused outrage for identifying Israel as Palestine on a map.\nThe government website published the map as part of a fact sheet about Palestinian immigrants in New Zealand, showing Israel highlighted in blue and marked as ‘Palestine’. The West Bank is not included in the highlighted area.\nRead more:\nhttps://www.rt.com/news/462157-new-zealand-israel-map/\nI believe this was not a joke....\n- By Gus Leonisky at 19 Jun 2019 - 4:19pm\n- Login or register to post comments\n- By Gus Leonisky at 22 Jun 2019 - 12:00pm\n- Login or register to post comments\nIranian cartoonist Kianoush Ramezani reacts to the International New York Times' decision not to publish a political cartoon after a controversy over a cartoon deemed antisemitic.\nHow on earth to explain what happened to Patrick Chappatte and the New York Times following the publication by the newspaper of the controversial drawing of this artist? The explanation may be to be found in an old Iranian proverb: \"One hundred wise men are unable to remove the stone that a single madman has thrown into a well.\"\nBut the \"sages\" of the NYT have gone beyond the \"stone\" and the \"crazy\", and have outright destroyed the \"well\"!\nSooner or later, they will regret not having any political caricature. I imagine that for Friday, August 2, 2019.\nI met Patrick Chappatte for the first time at the Caen memorial in 2011. He is a passionate man, a tireless defender of human rights and a brilliant draftsman, however always modest and realistic. Between 2011 and 2012 [period when I received the first international cartoon prize of the city of Geneva with three other Iranian cartoonists], I had the opportunity to meet him and get to know him better. , and I consider him a friend. I have been doing his wonderful job for over eight years, and I have the deep conviction that he is one of the most talented caricaturists of our time.\nRead more:\nhttps://francais.rt.com/opinions/63116-international-new-york-times-art-...\nRead from top.\nsharpener by Iranian cartoonist Kianoush Ramezani\n- By Gus Leonisky at 24 Jun 2019 - 8:47am\n- Login or register to post comments\n\"The highs and lows of cartooning. Today I was just let go from all newspapers in New Brunswick,\" De Adder tweeted. He later clarified that he had technically been under contract to work for Brunswick News Inc., and wasn't an employee who could be fired.\nBrunswick News Inc. responded in a statement on Sunday that \"it is entirely incorrect to suggest\" that it canceled a freelance contract with de Adder over the Trump cartoon.\n\"This is a false narrative which has emerged carelessly and recklessly on social media,\" the publishing company wrote. It said that de Adder never offered the Trump cartoon to the company and had already decided to \"bring back\" another cartoonist it said was popular with readers. \"[N]egotiations had been ongoing for weeks,\" it stated.\nDe Adder tweeted that he would bounce back from losing the job and that he just had to \"recoup a percentage of my weekly income.\" De Adder has a book he said will be released in September.\nHe did not respond to a request for further comment from CNN Business.\nRead more: https://edition.cnn.com/2019/06/30/media/canadian-cartoon-trump/index.html\nBrunswick News Inc. responded in a statement on Sunday that \"it is entirely incorrect to suggest\" that it canceled a freelance contract with de Adder over the Trump cartoon.\n\"This is a false narrative which has emerged carelessly and recklessly on social media,\" the publishing company wrote. It said that de Adder never offered the Trump cartoon to the company and had already decided to \"bring back\" another cartoonist it said was popular with readers. \"[N]egotiations had been ongoing for weeks,\" it stated.\nDe Adder tweeted that he would bounce back from losing the job and that he just had to \"recoup a percentage of my weekly income.\" De Adder has a book he said will be released in September.\nHe did not respond to a request for further comment from CNN Business.\nRead more: https://edition.cnn.com/2019/06/30/media/canadian-cartoon-trump/index.html\n- By Gus Leonisky at 1 Jul 2019 - 4:14pm\n- Login or register to post comments\n- By Gus Leonisky at 2 Jul 2019 - 4:18pm\n- Login or register to post comments\nSome British Jews feel affronted by alleged anti-Semitism in the UK Labour Party. But how many of the complainants empathize with complaints from West Bank Palestinians?\nThroughout history, thinking at variance with the mainstream was always unpopular and risky. However, at various times, it has been tolerated to different degrees. Today, it’s less and less acceptable than in the recent past.\nLiberals of all colors like to repeat German socialist Rosa Luxembourg’s critical stab at the Bolsheviks: “Freedom is freedom for those who think differently.”\nAnd, to spice it up, they often like to add Voltaire’s maxim: “I disapprove of what you say, but I will defend to the death your right to say it.”\nThat said, does our recent (and not so recent) experience not show that freedom for those who think differently is now acceptable only within the constraints of the predominant social pact?\nWe can see this clearly, right now, as the unwritten rule which determines the limits of what is acceptable is breaking apart, and different visions compete to impose themselves as hegemonic. Years ago, Noam Chomsky caused a scandal when he followed Voltaire’s maxim to its extreme: he defended the holocaust denier Robert Faurisson’s right to publish his book, and his argumentation even appeared in Faurisson’s book as an afterword.\nToday such a gesture would be immediately identified as anti-Semitic.\nRead more:\nhttps://www.rt.com/op-ed/463911-freedom-metoo-zizek-anti-semitism/\nPicture of cooperative bugs just for fun...\nRead from top.\n- By Gus Leonisky at 13 Jul 2019 - 12:29pm\n- Login or register to post comments\nRead from top.\n- By Gus Leonisky at 15 Jul 2019 - 2:23pm\n- Login or register to post comments\nRead from top.\n- By Gus Leonisky at 26 Jul 2019 - 6:07am\n- Login or register to post comments\nRead from top...\n- By Gus Leonisky at 3 Aug 2019 - 7:35pm\n- Login or register to post comments\nIsraeli Prime Minister Benjamin Netanyahu has called for a boycott of the producers of a HBO series which, he says, is “anti-Semitic” and “slanders Israel.”\nNetanyahu took to Facebook to call for a boycott of “propaganda” Channel 12 and its owner Keshet for creating the show ‘Our Boys’, which he says “besmirches the good name of Israel.” He urged his followers to stop watching the channel, especially those who have a ratings meter in their homes.\nRead more:\nhttps://www.rt.com/news/467686-netanyahu-hbo-our-boys-antisemitism/\nMore toons about the kingdom of David:\nAnd many more....\nRead from top.\n- By Gus Leonisky at 1 Sep 2019 - 10:52am\n- Login or register to post comments\nBy Robert Lipsyte / TomDispatch\nIn the spring of 1957, in search of a summer job before heading west to graduate school, I answered a classified New York Times ad for an editorial assistant. The personnel clerk at the paper was condescending. Bachelor’s degrees are a dime a dozen, she told me. For their newsroom, she said, they were looking for Ph.D. candidates and Rhodes scholars. Still, sighing at her own generosity, she let me fill out the paperwork.\nI did so, but not being much of a Times reader then, I quickly moved on. I spent the rest of that day filling out other applications around town. When I got home my mother said, “You had a crank call, Bobby. A man said that, if you show up tomorrow and pass a physical, you can start work immediately at the New York Times.”\nThe physical consisted of nothing more than showing up, and that editorial assistant post turned out to be for a copyboy (no girls allowed then) in the sports department. I hated the job — sharpening pencils, fetching coffee, filling pots of library paste from 7 p.m. to 3 a.m. for a dyspeptic crew of “copy readers” (now, staff editors), who seemed to take joy in molesting the words of superb writers like reporter Gay Talese.\nSixty-six years later, I had a rush of mixed feelings when the Times recently announced that it was going to abolish its sports department. How could they part with such a critical piece of my life? And, by the way, what took them so long?\nI had, in fact, long wondered whether the Times needed a sports department. Even back then, marketing polls showed that its readers who were avid sports followers mostly bought tabloids to satisfy their fandom. In-house, in fact, sports was known as “the Toy Department” and often provided a dumping ground for writers and editors who had messed up “outside” (as we sports types called the other Times departments we revered and resented).\nWhy Cover Sports?\nAs it happened, that summer job of mine would last 26 years (in two acts with a 20-year intermission) and, in that time, I came to love the majesty of the Times, its sense of mission, and the throb of the news flow. The sports section would be included in my new belief system. When I was anointed a reporter at 21, I felt as if I had been inducted into a knightly order dedicated to Truth and I’ve never been totally deprogrammed.\nAt the same time, during these past 66 years, even while writing on sports-related topics in genres ranging from art criticism to opera, I’ve continued to wonder about the true purpose of sports coverage. Is it to keep that industry profitable, critique and offer consumer reviews of performance, be that media platform’s most diverting section (like the comics in other papers), provide intelligence for gamblers, or offer real journalistic coverage of a compelling and useful window on society? Or maybe some combination of them all?\nSuch thoughts only intensified when I first saw the announcement that the Times was dropping its sports department.\nInitially, I felt angry and sad, as if it reflected unfavorably on how I had spent so much of my life. But that was silly. And after several weeks without a formal sports department, I’m not totally convinced it was such a bad idea.\nAfter all, so much of sports news is indeed trivial, a genuine waste of time and space, and continually updated reckless speculation (most of it soon to be discarded). Of course, that’s a description of a lot of news, some of it wrongly reported. At least in sports, no one dies from rumors of a coming baseball trade that never happens.\nAnd yet… the sports department was also something of a newspaper within a newspaper with its own deadlines, stand-alone pages, and version of standards. For instance, sports figures (like felons) weren’t referred to with the normal honorifics (Mr., Mrs., and Miss) as they were then in other sections of the paper, while a certain lack of rigor in the editing may actually have contributed to greater readability, individuality, and humanity.\nTimes’ Sports Goes Abroad\nFor several years now, the Times has been chipping away at its sports report, dropping stand-alone sections (most notably on Sunday) and cutting back on the number of daily pages of coverage. Covid’s effect on sports spectatorship affected some of those decisions, as did the paper’s campaign to become the Global Times, with stories about local teams replaced by European soccer news.\nEven my own interest faded. After all, I could get basic hard-core sports results any time online from ESPN or at a new site called The Athletic, even as my own old paper was focusing ever more on the Tottenham Hotspurs and ever less on the Yankees. I was born in the Bronx, so that mattered to me, at least on some level of hometown pride. But maybe the paper was trying to wean me from sports, so that I could concentrate on trendier revenue streams like recipes and word games (its newest toy departments).\nThen, last year, the Times tipped its hand by purchasing The Athletic, an online prose sweatshop of sports-content providers, for a mere half-billion-plus dollars. It was planning to outsource sports coverage, while displacing its own department’s unionized workers along the way. I felt genuine outrage! Wasn’t sports worthy of the paper’s standards and resources? Weren’t its workers worthy of protection? Next stop, they’ll gut the Culture Department! (Why do all those smarty-pants critics have to be NewsGuild members anyway? Why not pick them up on the corner like day laborers?)\nAdmittedly, The Athletic is good enough at what it does, covering games, human-interest stories, and some sports-related social and political issues with Associated Press-style detail and clarity. Yes, its reportage is far better than anything artificial intelligence could produce (so far), but it hardly has the panache displayed by the Times’ regular sports writers. The Athletic was, in fact, originally staffed by culling faltering regional papers for some 400 reporters theoretically devoted to covering every pro and college team imaginable (an ambition that has since been relaxed).\nMany of its staffers are up to scratch, even excellent, but most don’t have the depth of knowledge and sense of style of a hand-picked Times’ sports lineup. While, in the past 66 years, its sports department wasn’t always collectively the best in the nation (the Boston Globe, Los Angeles Times, Washington Post, and Newsday had their glory days, too), its roster of writers was invariably the deepest and most capable of explaining, say, the intricacies of pro football, as well as the medical disasters its plays could cause. In my time, the daily likes of Harvey Araton, Ira Berkow, John Branch, Steve Cady, Joe Drape, Gerald Eskenazi, Robin Finn, Jere Longman, Buster Olney, and William Rhoden would have been hard to match, and that’s not even to mention its superb columnists. Now, that team has been disbanded.\nThe New Game Plan\nNevertheless, the Times’ current plan seems workable enough. Readers who have scaled the paywall will have access to The Athletic and once again be able to read about their favorite local teams. Meanwhile, the former department staff of about 40 writers, editors, and videographers will do sports-related feature stories, analyses, and investigations from new perches in departments like business, international news, and culture. So far, so good, although the jury is still out.\nAn encouraging example of the new neo-sports department came out on a Sunday in late October. There were five packed sports pages at the back of the first section, while the lead story, which began on the front page, was a brilliant dive into the latest trend in the professionalization of college sports by Billy Witz, a seasoned varsity starter from the old sports department, and David Fahrenthold, an acclaimed investigative reporter acquired from the Washington Post. Then there was the kind of European soccer column I’ve come to expect from the entertaining Rory Smith and an excellent piece by jack-of-all-sports reporter Victor Mather on Native Americans being squeezed out of what was once their own game, lacrosse. (Consider it the latest inglorious chapter of colonization and oppression.) Meanwhile, major articles by Athletic reporters Doug Haller and Vic Tafur on the durability of basketball superstar Kevin Durant and the day’s National Football League games proved adequate fanboy fare.\nAll in all, no terrible loss of standards. (Meanwhile, The Athletic has been bulking up its staff, even adding a respected former Times sports editor, Jason Stallman.) Yet with the exception of the Mather and Witz-Fahrenthold pieces, neither trees nor bandwidth needed to be wasted on those other four Sunday stories in the Times itself, when you could read them at The Athletic, saving space for Donald Trump, Gaza, Hamas, Ukraine, the latest mass murders, biblical House Speaker Mike Johnson, and the rest of all-the-news-that’s-fit-to-print.\nOnce you start thinking like that, however, you’ve left the zone of sentimental sports writing and it’s time to start considering what we really need to know about our fun and games.\nA New Sports World or a New Scam?\nThat front-page piece by Witz and Fahrenthold is a fine (if somewhat tardy) example of what any sports page should be focusing on in 2023. The latest key to successful college athletic recruiting, they report, is forming a “donor collective” of ultra-rich boosters. They then act as recruiting agents for the coach, who can assure an incoming star player of a package of no-show jobs and top-notch endorsement deals that, for a future starter on a major college team, could easily become the equivalent of a $100,000 annual salary (or more). To add a little spice to the funding group, that collective can be created as a charitable organization so its donors can claim tax deductions. (If you wanted to add another wrinkle to that story, as Jason Fuller of National Public Radio reported, you could include the creation of “transfer portals” that allow disgruntled players to switch schools without the old penalty of losing a year of eligibility.)\nIt was great that the Times covered the latest round in the professionalization of amateur sports so effectively, but the question remains: under the new regime will they stay with it? In the years to come, will it even seem like an Athletic kind of story?\nKeep in mind that such investigations aren’t what hardcore sports fans tend to enjoy in their time outs from real life or what usually attract non-sports fans to the subject. And such reporting is expensive, too.\nOnly recently, however, we saw the sports version of journalism at the highest level in a blockbuster news piece by two of the Washington Post’s biggest stars, David Maranis and Sally Jenkins, writing about then-Republican House Speaker wannabe Jim Jordan. “As an assistant wrestling coach and graduate student at Ohio State from 1986 to 1994,” they reported,\n“he was on campus during the most grievous scandal in the school’s history. Over two decades, Richard Strauss, an athletic team doctor, molested scores of male students and athletes, especially wrestlers, with abuses ranging from excessive fondling of genitals during supposedly routine examinations to anal rape, according to a university report. When the crimes belatedly surfaced in 2018, Jordan insisted that he had been unaware of Strauss’s behavior.“\nHowever, wrestlers from Jordan’s time at Ohio State told the Post that they recalled team members complaining to Jordan and insisted that there was no way he didn’t know what was going on.\nTheirs is another story that should be a model for the new neosports department at the Times, along with the role of gambling in the current sports world (including the NFL’s once unthinkable official betting sites), and how women’s sports is faring in a time of transgender athletes (and how those transgender athletes are faring, too). And don’t forget what’s new in sports writing itself, including the two highest-priced practitioners of the trade today, 54-year-old Adrian Wojnarowski of ESPN and his one-time protégé, 29-year-old Shams Charania of The Athletic. They might not have been considered real sportswriters over much of the past 66 years of my service. Both are transactional reporters who cultivate inside sources in order to be the first to break the news — often, in this distinctly online sports world of ours, by seconds — that some basketball player is being traded or manager fired. Admittedly, it hasn’t yet been explained why the timing of such information is important to anyone but gamblers — and if that’s true, consider it one measure of where we are right now in Sports World 2023.\nWoj reportedly makes $7 million a year, while his rival Shams makes less. Arguably, he’s now the most important sports reporter at the Times. The question remains: Is he its future or proof of its ongoing decomposition?\nMaybe answering that question could be the Ph.D. thesis I was headed toward 66 years ago when I answered that ad for copyboy in the late, lamented sports department of the New York Times.\nhttps://scheerpost.com/2023/11/22/farewell-to-the-new-york-times-sports-department/\nREAD FROM TOP.\n- By Gus Leonisky at 26 Nov 2023 - 5:27am\n- Login or register to post comments",
  "word_count": 5120,
  "scraped_at": "2026-02-14T12:05:46.562783"
}