{
  "article_id": "0b8ed9fff8c2",
  "url": "https://www.peoplesreview.com.np/2024/07/09/69391/",
  "title": "Review of World Affairs - A Political and Business weekly",
  "date": "20240709T063000Z",
  "domain": "peoplesreview.com.np",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "* Biden brushes off poor debate performance/Vows to stay in race\n* Iran Reformist Wins Presidency\n* Keir Starmer New UK Prime Minister\n* French Assembly Elections: Far Right Kept Out of Power\nBy Shashi P.B.B. Malla\nBiden: Interview with ABC News\nIn a 22-minute interview with ABC News’, President Joe Biden said he’d only step down if instructed by “the Lord Almighty” [for a practicing Roman Catholic, this was quite blasphemous. Moreover, the choice is not his alone to make; the stakes are just too high for America and the world].\nBiden told reporters earlier he’s beaten former President Donald Trump before and has “gotten more done than any president has,” so he’s “completely ruling out” getting out of the 2024 race (CNN Politics/Shania Shelton, et. al., July 5).\n[Then is not now, and Biden has aged considerably since!]\nDuring the ABC interview, Biden downplayed his dismal debate performance, saying he was “sick” and “feeling terrible” before the debate.\nBiden also offered another excuse for why he wasn’t in control of the event: Trump continued speaking even while his microphone was muted.\n[It is quite a lame excuse. This only illustrates that Biden is aged – with the infirmities of age – and with the first signs of senility, equivalent to childish behavior]\nVice President Kamala Harris to the Breach?\nAs many look to Harris as the obvious successor if Biden steps aside, the vice president has repeatedly defended him. She told CBS earlier this week: “Joe Biden is our nominee.”\nIt is unclear if Harris watched Biden’s high-stakes ABC News interview Friday, and when asked by a reporter her thoughts on the interview, she waved and entered her motorcade.\nShe will travel to several states and participate in events aimed at key constituencies including Black, women and young voters.\nRepresentative Mike Quigley says “all that really matters is avoiding a second Trump presidency”\nDemocratic Representative Mike Quigley of Illinois, who earlier had urged President Joe Biden to leave the race, said that now is not the time for “cheerleading” (original: the activity of leading the crowd in shouting encouragement and supporting a team at a sports event).\nTwo of the most disturbing moments of the ABC interview, Quibly said were Biden saying he hadn’t watched the debate and all that really mattered was him giving his best effort to win the election.\n“With the greatest respect, no, all that really matters is avoiding a second Trump presidency,” Quigley told CNN’s Jim Sciuto.\nResponding to charges from Senator John Fetterman that the Democratic Party needs to “grow a spine” and support Biden, Quigley said that would be a recipe for disaster.”\n“What we need right now – and what I think takes a spine – is to step aside and recognize that the (current) president of the United States doesn’t have the vigour necessary to overcome the deficit here and it’s going to affect us all,” Quigley said.\nBiden aides say ABC interview accomplished what they hoped it would\nPresident Biden aides are trying to hold up the president’s high stakes interview with ABC News Friday night as a success while at the same time emphasizing that this is just the beginning of his attempt to offer reassurance after last week’s disastrous debate.\nTwo separate Biden aides used the word “strong” to describe the president’s sit-down with George Stephanopoulos. One of them said the president’s team felt that he used the opportunity to make the case that he is in fact the best candidate to take on Donald Trump. [He should watch the full version of the debate and then come to an honest conclusion!].\nThe president’s campaign has previewed that the president’s schedule in the coming days will more aggressively feature unscripted moments – including more interviews and a press conference next week. [However, the basic fact is that the longer Biden stays in the race, the more he damages the prospects of a possible new candidate and those fighting for seats in the House of Representatives and the Senate. There is indeed a real and pressing danger that Trump and the Republicans will capture the trifecta of power centres: the Oval Office, the House and the Senate.\nMoreover, there is also the acute possibility that Trump if re-elected will not only control the executive, but also the legislature (House & Senate), and the judiciary (the Supreme Court of the United States/SCOTUS is already heavily tilted in his favour).\nThus, for Biden to withdraw in support of a far better candidate, time is of the essence].\nHowever, even as Biden and his campaign publicly dig in, Democratic calls for the president to abandon his reelection bid have only been growing. And it’s abundantly clear that one interview will not be enough to squash widespread concerns.\nOne Democratic lawmaker who was despondent about Biden’s performance at the debate told CNN he thought the interview was “certainly better” than the debate.\nBut, he added: “We are still screwed.”\nGOP (or Republican) Senator Lindsay Graham calls Biden’s ABC interview “chilling”\nSouth Carolina Republican Senator Lindsay Graham issued a long (and brutal) statement calling President Joe Biden’s interview on ABC Tonight “chilling” and insisted that anyone who believes the president is as fit as he was at the start of his term should take their own “cognitive test.”\nThat was not a media interview of a sitting president. That was a therapy session with a former Democratic operative begging President Biden to get out of the race,” Graham wrote in a post on X, referring to ABC’s George Stephanopoulos, who served in the Clinton administration.\n[Graham has no axe to grind here and his words should have much weight!].\nRepresentative Lloyd Doggett says “urgent need” for Biden to withdraw from race grows more compelling each day\nTexas Representative Lloyd Doggett, the first sitting Democratic member of Congress to call on President Joe Biden to drop out of the 2024 race earlier this week, told CNN Friday that the need for (Biden) to step aside is more urgent tonight than when I first called for it.”\nWhile he described Biden as a “good man” and “an American patriot”, Doggett argued that “we can’t afford to lose this race and that’s why we have to pick the strongest candidate possible.”\nDoggett added that “every day he delays” making the decision to step aside, Biden “makes it more difficult for a new person to come on board who can defeat Donald Trump.”\nIran on the Mend?\nIran’s reformist candidate Dr. med. Masoud Pezeshkian, who advocates improved ties with the West, on Saturday won a runoff presidential election against ultraconservative Saeed Jalili (AFP/Agence France Press, July 6).\nPezeshkian is a 69-year old heart surgeon whose only previous government experience was as health minister about two decades ago.\nThe election came against a backdrop of heightened regional tensions because of the Gaza war, a dispute with the West over Iran’s nuclear programme, and domestic discontent over the state of Iran’s sanctions-hit economy.\nPezeshkian received more than 16 million votes, around 54 % percent, and Jalili more than 13 million, roughly 44 % percent, out of about 30 million votes cast.\nTurnout was 49.8 % percent, up from a record low of about 40 % percent in the first round. The regime relates voter turnout with its popularity and legitimacy.\nIn the mausoleum of Imam Khomenei in southern Tehran, Pezeshkian gave a speech thanking his supporters, saying their votes have “given hope to a society plunged into an atmosphere of dissatisfaction.”\n“I did not give false promises in this election,” said Pezeshkian, flanked by former foreign minister Mohammad Javed Zarif.\n“I didn’t say anything that I wouldn’t be able to do tomorrow.”\nIn an earlier post on X, Pezeshkian said the vote was the start of a “partnership” with Iran’s people.\nThe death of ultraconservative president Ebrahim Raisi in a helicopter crash necessitated the election, which was not due until 2025.\nUnder Raisi, Iran sought improved relations with China and Russia while mending ties with Arab neighbours, chiefly Saudi Arabia, to evert deeper isolation.\nSaudi Arabia led Gulf states in congratulating Pezeshkian.\nBoth Russia and China expressed hopes for further reinforcement of ties.\nHe has called for “constructive relations” with Western countries to “get Iran out of isolation.”\nHe favours reviving the 2015 nuclear deal between Iran and global powers.\nTrump unilaterally withdrew from the accord 2018, re-imposing sanctions, although Iran had faithfully maintained the terms.\nThis lead Iran to gradually reduce commitment to the terms of the agreement.\nThe deal had aimed to curb nuclear activity which Tehran maintains is for peaceful purposes.\nSupreme leader Ayatollah Ali Khamenei, who has the final say on all major policy issues, congratulated Pezeshkian.\nHassan Rouhani, a moderate in office until Raisi’s victory in 2021, congratulated Pezeshkian, and said voters had shown “they want a serious change in the state of governance in the country.”\nHowever, Iran expert Ali Vaez, from the International Crisis Group think tank, said on X that Pezeshkian will face challenges in implementing his platform because of “continued conservative dominance of other state institutions & limits of presidential authority” (AFP).\nUK General Election\nKeir Starmer has led Britain’s Labour Party to a landslide victory over Rishi Sunak’s Conservative Party [or Torries ] in last Thursday’s general election and became the country’s 58th prime minister.\nFor someone often derided as dull and without charisma, Starmer has delivered a sensational election result.\nHe won by promising voters change, but also calm, vowing to restore stability to public life and give Britain ‘the sunlight of hope’ after 14 years of turmoil under the Conservatives.\n“It’s the latest reinvention for a man who went from human rights attorney to hard-nosed prosecutor and from young radical to middle-aged pragmatist” (AP/Associated Press, July 5).\nHe was knighted for his role leading the Crown Prosecution Service, and opponents like to use his title ‘Sir’ to paint him as elite and out of touch.\nBut Starmer prefers to stress his humble roots and down-to-earth tastes.\nHe was the first member of his family to go to college, studying law at Leeds University and Oxford.\nHe loves soccer – still plays the sport on weekends – and enjoys nothing more than watching Premier League team Arsenal over a beer in his local pub.\nStarmer promised ‘a culture of change in the Labour Party’. His mantra is now ‘country’ before party’.\nHe has promised voters that a Labour government will repair Britain’s frying public services, but without imposing tax increases or deepening the public debt.\nStarmer will face pressure to deliver quickly.\nFrench Assembly Elections: Macron’s gamble has kept the far right out of power, but plunged France into uncertainty\n“I threw my live grenade at their feet” is how French President Emmanuel Macron reportedly saw his call for snap elections after a stinging far-right victory in June’s European parliamentary elections (CNN World/Sakya Vandoorne, July 7).\nIt was an explosive gamble and the final results took the country by complete surprise.\nFrance’s left wing impromptu alliance coming in first with 182 seats and the far-right trailing in third place 143 seats – a shocking reversal of last Sunday’s first-round results.\nThe Presidential Group came seond with 163 seats.\nOn Place de la Republique in Paris, news of the projected results was met with rapturous applause and fireworks as people embraced one another breathing a collective sigh of relief: in their eyes France had been pulled back from the brink.\nTurnout on Sunday was the highest in a parliamentary election for more than 20 years as French citizens took to the ballot box to make their feelings known: they did not want the far-right to govern.\nHowever, with the left falling short of the 289 seats needed for a majority and a weakened president, the national assembly is expected to be more fractured than ever.\nWhat’s certain is that France is set to enter a prolonged period of instability as three opposing ideological blocs with competing ideas and agendas try to form coalition(s) or find themselves stuck in a state of paralysis (CNN).\nHow instability might impact internationally\nWith such a divided parliament there is no hope for major structural reforms at a domestic level, the best the leftists can hope for are ad hoc alliances to vote through individual pieces of legislation.\nIt is equally hard to imagine how the current domestic constellation of forces would allow France to play an important role in world affairs, especially regarding Putin’s war in Ukraine.\nIt will be interesting to watch how everything plays out in the running NATO summit in Washington.\nThe writer can be reached at: shashipbmalla@hotmail.com\nThe views expressed in this article are the author’s own and do not necessarily reflect People’s Review’s editorial stance.",
  "word_count": 2128,
  "scraped_at": "2026-02-14T12:18:12.278065"
}