{
  "article_id": "0ba3bb32fcab",
  "url": "https://www.morningadvertiser.co.uk/Article/2025/08/11/when-does-the-premier-league-return-this-year/",
  "title": "When does the Premier League return this year ? ",
  "date": "20250811T110000Z",
  "domain": "morningadvertiser.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The number of live matches is increasing from 180 to 267, 215 of which will be shown on Sky Sports – up from 128 games last season – with the TNT Sports quota unchanged on 52.\nAmazon Prime’s deal to show 20 Premier League games a season has come to an end and it won’t show any matches in the forthcoming season.\nSky will show at least four games each week and eight out of 10 Premier League matches to be screened over the course of the season.\nIn particular, there will be more games shown on Monday and Friday nights, and Sky is introducing simultaneous broadcasts of 2pm Sunday games via Sky Sports+, as it already does for English Football League games.\nThe Premier League season kicks off with a Friday 8pm kick-off that sees Liverpool embarking on the defence of their title at home to Bournemouth.\nAston Villa v Newcastle provides the first Saturday lunchtime action the following day and is the first game on TNT, before Manchester City look to start putting some of the shortcomings of last season to bed away to Wolves in the 5.30pm start on Sky.\nSky’s first Super Sunday sees two trophy holders go head-to-head at 2pm, with Club World Cup winners Chelsea taking on FA Cup victors Crystal Palace. Last season’s surprise package Nottingham Forest are at home to Brentford on Sky Sports+ at the same time, to be followed by the heavyweight clash between Manchester United and Arsenal at 4.30pm on the main channel.\nNewly promoted Leeds United are at home to Everton in the first Monday night game.\nThe pros and cons for pubs\nEver since Sky Sports’ coverage of Premier League football began in 1993, the conundrum for pubs has been whether the extra business it brings justifies the investment in subscriptions and hardware.\nMark James, owner of the Boot Room, a sports bar with 12 screens and three Sky boxes, bang opposite Nottingham Forest’s City Ground, says he’s in no doubt it is.\n“We’re very sport-led,” he says. “When we started this business five years ago, we looked at match days and how we could maximise sales, and sport was the best way to do that.\nBrand and broadcast sport for pubs\nDrinks brands can help shape pubs’ in-venue marketing and promotion. Pubs should especially keep an eye out for activity around Guinness and Coca-Cola, respectively the official beer and soft drink of the Premier League – but others also have a role to play.\n“When customers choose where to watch the game, the drinks offer can be the deciding factor,” says Steve Cox, chief executive of Keystone Brewing, whose brands include Black Sheep and Big Drop.\n“Our Summer of Sport activation with Black Sheep Blonde, launched to align with Wimbledon, picked up pace during the Tour de France and is set to peak during the women’s and men’s football.\n“Participating pubs are backed with tailored PoS, such as branded pump clips, drip mats and glasses, reinforcing the idea that sport sells best when it’s supported in full.”\nTNT has an exclusive brewery partnership with AB InBev, giving customers 50% off TNT Sports when they take an additional draught line from AB InBev range.\nTNT has also teamed up with the pub sports information service Fanzo to launch TNT Sports Social this season.\nThe platform will give trade customers the opportunity to opt-in to allow TNT Sports to automatically update their social media pages with upcoming sports events on a weekly basis.\nIn addition, TNT will offer pub customers the opportunity to receive email marketing information about the pub.\nTNT also provides pubs with social media fixture marketing materials and downloads for posters and has a “support squad” that visits pubs during the season to give out physical PoS.\n“Even with the ridiculously high cost of £1,000 a month for Sky and TNT, it’s vital to have the screens and to make sure you make it work by acting on socials to generate a regular base [of customers] who are coming in and watching games.\n“We’re very much wet-led on match days and we don’t sell food, but we’ve still got 140 covers and reservations to create that atmosphere.”\nBut what about when Forest are playing away and the televised Saturday lunchtime game is, say, Wolves v Manchester City?\n“We still get the avid football fans coming in to get their fix of football and we go down a sort of breakfast/brunch route,” James adds. “We did it for one of the Lions rugby games recently and had 25 in for breakfast on a Saturday morning, which leads into a nice steady lunch and good afternoon. That’s the sort of thing you have to do.”\nThe Boot Room’s football business will be boosted this year by additional midweek European games for Forest for the first time in 30 years.\n“You do see a noticeable difference in sales when they’re doing well, and extra sales after a good result,” says James.\n“It’s good for us if Sky and TNT keep showing more games – it keeps you going on a Wednesday, Thursday and even Sunday afternoons. Two or three games on a Sunday can turn it into your busiest day of the week.”\nJames advises pubs to shop around for deals to keep subscriptions – which are pegged to the rateable value of the venue – manageable.\n“It’s £1,000 for two Sky boxes but by paying a bit extra for At The Races and doing a deal with AB InBev, we could get a third box and still keep within the £1,000 a month.”\nNo city is more crazy about football than Newcastle, and the city centre’s Fleet Street pub has been looking to cash in on that since opening just over a year ago.\nThe Star Pubs venue had a £330,000 refurb including a huge screen and top-quality sound system.\nPre and post-match talks are given by a rotating line-up of pundits, including ex-Newcastle players Steve Watson and John Anderson, and local sports writer John Gibson.\n“The key to success with sports is to focus on atmosphere before anything else,” says manager Baileigh Musgrove. “Halfway through the Premier League season we introduced a promotion for soft and alcoholic drinks for 10 minutes, whenever Newcastle scored.\n“It’s had an enormous impact on trade. Had we known, we would have done it from the start. Previously, we were packed out during home games while away games traded at 50% capacity. Now away games are busier than home matches. People also come in earlier and stay later.\n“It’s had a knock-on effect on non-match days too, increasing weekday trade by a third.”\nThe football-mad Royal Dyche in Burnley is excited about the local club’s return to the Premier League, but owner Justine Bedford says she’s still weighing up what promotion might mean commercially.\n“In the Championship, it was brilliant,” she says. “We were on Sky Sports a lot due to the launch of Sky Sports+ but it’s not the same format in the Premier League.\n“Many games get moved to 2pm or 4.30pm on a Sunday. We now play Liverpool on a Sunday and because it’s moved from a Saturday this will lower our takings for that weekend.\n“Comparing previous seasons, we always tend to do more trade in the Championship compared to the Premier League.\n“If Burnley play away and it’s on TV that’s great for us. We have a very Burnley FC-based clientele but some of our regulars support other teams – Fulham, Brighton, Liverpool, Manchester United and Chelsea, just to name a few – and these regulars will be in for every live game for their team.\n“We also have a strong bond with Helmond Sport in the Netherlands and Atalanta in Italy, and their fans come over frequently to watch Burnley games, as well as coming to visit the pub.\n“One thing the Premier League does bring is tourists. It’s great for our town but our trade can sometimes rely on results – the better Burnley do, the longer fans will stay out and celebrate.”\nBedford is planning extra investment as the season progresses.\n“After the new year, we plan to develop our stage area of the beer garden, [to] add in three extra screens, create a better sheltered area and improve the sound quality for commentary outside.”\nThe Royal Dyche changed its name from the Princess Royal seven years ago in honour of Sean Dyche, the manager who took Burnley into Europe.\nBedford says there are no plans to switch things up again in recognition of current manager Scott Parker winning the latest promotion.\n“He was brilliant last season and I think his style of football will suit our team when it comes to grinding out a result,” she says.\n“He’s even paid the pub a visit and we joked about changing the name to the Parker Arms. We did it for a day when it was our promotion parade. But the Royal Dyche is here to stay.”\nSo who’s going to win the 2025/26 Premier League?\nThe expansion of the Champions League as of last season means the distribution of TV revenue and, therefore, spending power increasingly favours the already-richest clubs.\nThe transfer fees during the close season paid by England’s five 2025/26 Champions League representatives are pushing a combined £1 billion, with three weeks still to go before the transfer windows closes.\nAll of which makes it hard to see beyond last season’s top four of Liverpool, Arsenal, Manchester City and Chelsea as potential title winners, especially with fifth-placed Newcastle seeming certain to lose star striker Alexander Izak.\nArsenal have spent big in a bid to turn Mikel Arteta’s serial bridesmaids into brides, but the main £64m investment in Swedish striker Viktor Gyökeres looks a risk, given his only previous success in England was in the Championship with Coventry City.\nChelsea have also given London’s luxury property agents a busy summer with a flourish of new arrivals, and they’ll start the season pumped by an impressive victory – though less classy Trump celebration – at the Club World Cup in the summer.\nManchester City’s intake includes the pricey midfield reinforcements Tijjani Reijnders from AC Milan and Ryan Cherki from Lyon. Despite their defeat in the FA Cup Final, there were signs during the spring that Pep Guardiola’s side had started to correct last term’s early season wobbles, and they will surely be in the mix again.\nCapturing the midweek European bonus\nWhile TNT plays second fiddle to Sky on the Premier League, it has a punchy package of European club football, with the UK live rights for the UEFA Champions League, games for which are on Tuesday and Wednesday nights. It also has the UEFA Europa League and UEFA Conference League games, primarily to be shown on Thursdays.\nAmazon continues to show a batch of 17 Tuesday night UEFA Champions League games and these games will also be available through a TNT sub.\nThe Champions League has 25% extra spice for English clubs this year, with five teams qualifying instead of four: Liverpool, Arsenal, Newcastle United, Chelsea and Tottenham Hotspur.\nAston Villa, Nottingham Forest, Crystal Palace, Celtic, Rangers and Aberdeen are all in the mix in the other European competitions.\nIt seems likely that next season won’t be the one-horse race it was last time round but, when plumping for a winner, it’s still hard to see past Liverpool.\nThe exits of Trent Alexander-Arnold and Luis Diaz, and arrivals of Hugo Ekitike, Florian Wirtz and Milos Kerkez, feel like a typically gentle Liverpool evolution, based on genuine quality over quantity, leaving them stronger than before.\nWhere to find all the other football in 2025/26 season\nSky dominates the broadcast rights further down the English football ladder, with a package of 328 English Football League championships matches, 248 each from League One and League Two, and all the season-finale play-off matches, all either on Sky Sports or Sky Sports+. It will also have all 93 matches in the Carabao Cup.\nThe FA Cup is split between TNT (40 live matches) and the BBC (14 fixtures), with S4C to show selected live matches involving Welsh clubs.\nThe Women’s Super League in England is divided between Sky and the BBC. Some games that are not chosen for coverage by those broadcasters will be shown live on YouTube.\nChannel 4 comes to the broadcast party with six live Women’s FA Cup matches, including the final.\nIn Scotland, Sky will show 60 live men’s Premiership matches live, while 30 Championship matches will be on BBC Scotland.\nThe Scottish Cup is split between the BBC and Premier Sports, which also has matches from La Liga in Spain.\nThe German Bundesliga is on Sky and Italy’s Serie A is accessible in the UK through TNT and DAZN.\nAlso look out for World Cup qualifiers on terrestrial TV in September and October.",
  "word_count": 2151,
  "scraped_at": "2026-02-14T12:58:33.900958"
}