{
  "article_id": "0bc41e36503e",
  "url": "https://www.managingmadrid.com/2024/11/24/24304634/florentino-perez-our-club-must-have-an-organisational-structure-that-protects-us-as-an-institution",
  "title": "Florentino Pérez :  Our club must have an organisational structure that protects us as an institution  ",
  "date": "20241124T173000Z",
  "domain": "managingmadrid.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Real Madrid president Florentino Pérez spoke at the 2024 General Assembly of Delegated Members on Sunday, and discussed a lot of things, ranging from the Ballon d’Or to Real Madrid’s potential future structure. For the latter, he said: “Our club must have an organisational structure that protects us as an institution and that also protects all of us as owners of Real Madrid. Rest assured that we will do everything necessary to ensure that this club remains the property of its members, as it has been for our 122 years of history. Ultimately, so that no one can take away our financial assets.\nFlorentino Pérez: “Our club must have an organisational structure that protects us as an institution”\nPérez spoke at the 2024 General Assembly of Delegated Members.\n“I confirm that we will bring to this Assembly a proposal for the reorganization of the club’s corporate structure that will clearly ensure our future, protect us from the threats we face and, above all, guarantee that the members are the true owners of our club, the real owners of our economic assets and in their own right.”\nPérez on the Valencia floods\n“I would like to begin by remembering the victims of one of the greatest tragedies we have experienced in our country in recent times. Our condolences and solidarity go out to all those who have suffered the terrible consequences of the DANA. All our strength and affection go out to those affected, especially to the families and loved ones of the deceased. We are all still dismayed by what has happened, especially in the Valencian Community, and we will never forget them. Our shield and our shirt are part of the hearts of millions of people. We are connected by the same feeling and by values that identify us, beyond our origin, our background, language, culture, ideology or religion.”\nPérez on the unity of the club\n“Today, Real Madrid is a big family. I sincerely believe that this is our greatest strength. The unity of the members, the unity of all of us, has allowed us to achieve everything we have achieved. We have built an institutional stability that allows us to face challenges with the conviction that we can overcome any adversity.”\nPérez on the recent successes of Real Madrid\n“We are experiencing a new golden age with 56 titles won in the last 14 seasons: 29 titles in football and 27 titles in basketball, including 9 European Cups: six in football and three in basketball. The legend of Real Madrid has grown in recent years, and this has also been possible thanks to the sacrifices that this club has made in a very difficult context, in socio-economic circumstances marked by the pandemic and post-pandemic, and by international conflicts. Despite this context of difficulties to which I referred earlier, Real Madrid has become the first football club in the world to exceed one billion euros in revenue.”\nPérez on 2024 for Real Madrid\n“It has been another historic year for Real Madrid. Here are the six titles won last season and the first one that has been achieved at the start of the current season. In football, the 15th European Cup; the 36th La Liga; the 13th Spanish Super Cup and the sixth European Super Cup won this summer in Warsaw. And in basketball, the 37th La Liga; the 29th Copa del Rey and the 10th Spanish Super Cup.\nInjuries are the worst thing about football and sport. But we know that Dani Carvajal and Eder Militão will successfully overcome this difficult moment and that we will soon see them back on the pitch as what they are: two of the great players of this team.\nI’ll start with our coach Carlo Ancelotti. With 14 titles, he is already, along with our beloved and always remembered Miguel Muñoz, the Real Madrid coach with the most titles in our history. And in the history of Real Madrid, which is gigantic, I want us to show our admiration, affection and gratitude to the players who have finished their time at Real Madrid after giving everything for this badge and this shirt. First of all, our captain Nacho, the man who lifted the Decimoquinta in London. One of our greatest youth players who arrived at Real Madrid at just 10 years old. He ends his time at Real Madrid as part of that select group with six European Cups.\nIt will be very difficult to see a player like Toni Kroos again. One of the best players in our history and one of the greatest legends of world football. He leaves with 23 titles at Real Madrid. Kroos has won his last Champions League to also be alongside Gento, with six European Cups, in the history of Real Madrid. And thanks also to Joselu. A Madridista at heart and a Real Madrid youth player who will always have the pride of having been the protagonist of one of those magical nights at the Bernabéu against Bayern Munich.”\nPérez on the youth teams\n“The academy is an essential part of understanding the history and identity of this club, because it is here that our young people are educated and grow in the values of Real Madrid. And the data clearly show that this is the best youth academy in the world. Currently, 191 footballers who have trained at Real Madrid City play in professional leagues. 51 do so in teams in the First Division of Spanish football, 84 in international leagues and 56 in our Second Division.”\nPérez on Real Madrid Femenino\n“Our team, coached by Alberto Toril, was runner-up in the League last season and qualified for the women’s Champions League for the fourth time in four years. And this past Wednesday, it confirmed its place in the Champions League quarter-finals with two games left in the group stage. We are firmly committed to continuing to contribute to the growth of women’s football.”\nPérez on Real Madrid Baloncesto\n“It is clear that, just like in football, in basketball we are also witnessing one of the greatest winning cycles in our history. And last season we again experienced something that is very difficult to achieve: the treble of the League, Cup and Super Cup. This team has played in the four finals of the four competitions in which we participate. And this is something that shows the hunger of some players who have won everything with Real Madrid.\nI want to have some very special words for the legends who have participated in this new golden era and who have decided to end their careers. Rudy Fernández has been one of the great legends of Real Madrid and of world basketball. And another of our great legends is saying goodbye to basketball as a professional player: Sergio Rodríguez.”\nPérez on Real Madrid’s finances\n“This year we have achieved an unprecedented milestone. Real Madrid has become the first football club to surpass the €1 billion mark in revenue. We have reached exactly €1,073 million in revenue, which represents a significant increase of 27% compared to the previous year. The financial results for the 2023-2024 season reaffirm our position as one of the strongest and most successful clubs in the world of sport.”\nPérez on the Bernabeu\n“And now I am talking about the Bernabéu, the home of Real Madrid and the most emblematic and iconic stadium in world football. We are, therefore, in the final phase of meeting the great challenge that Real Madrid set itself five years ago: that the Bernabéu be a universal avant-garde icon and an architectural emblem of the City of Madrid.\nIt is inconceivable that we have to read in some toxic digital media that the Bernabéu does not even have a license to hold football matches. Organising concerts is not a particularly lucrative activity for the club. We simply rent out the stadium and I want you to know that the income from this concept would be around 1% of our annual budget.\nTherefore, we are putting our stadium at the disposal of the people of Madrid. And it will be the authorities of our city and our community who will decide at any given time whether they want Madrid to continue being one of the main world venues, a reference point for major tours on the international music scene.\nAnd now I will also tell you about the concession of the underground car park next to our stadium. The City Council put this car park next to our stadium out to tender because it understood that it was the best way to serve one of the most important areas of Madrid and one with the least infrastructure, reserving a third of the spaces for residents under very advantageous conditions. Our club understood that we could collaborate with the city by entering the tender and making a great effort. Because, does anyone understand that to play 25 football matches a year, lasting two hours, an investment of almost 100 million euros is justified?”\nPérez on the current state of football\n“I have been warning for some time that our beloved sport is seriously injured. There are many social and economic indicators that prove this. The situation has never been as bad as it is now. Virtually all the major leagues are suffering a very significant setback.\nSpanish clubs are in crisis and the operation with CVC has only made the situation worse. And I can tell you that we will go to the Supreme Court if necessary to put a stop to its damaging effects on our football.\nIf the national leagues are facing increasing difficulties, the European competitions are not looking any better either. The new Champions League format has shown, as we predicted, that it is not the solution to the problems. UEFA has increased the number of matches, but each match is worth much less than before. And the competition will only arouse the passion of fans at the end of the season and not from the beginning, as one might expect.\nIn addition, the overload of the current football schedule is taking its toll on the health of the players, who are faced with an unprecedented schedule. This situation not only affects their performance, but is directly related to an alarming increase in injuries.\nAnd we have to say, in this regard, that only in what we have of the season, that is to say in only three months, in Real Madrid, we have had 14 injured players and a total of 22 injuries. And in our League, there have been, in the current season, nine cruciate ligament tears, of which two are players of our first team. According to the medical specialists, the causes of cruciate ligament tears are mainly due to fatigue. The greater workload of matches, with less rest between each match, has been shown to increase the risk of cruciate ligament injuries.\nFIFA has significantly extended the international window and has also created a Club World Cup that will deprive footballers of their essential annual rest. UEFA has increased the number of meaningless and unnecessary matches in the European tournaments it organises, disregarding the health of footballers. It has also created a new tournament: the Nations League. The result is the decline of football, with a calendar and formats designed without taking into account the main actors in this sport: footballers, clubs and fans.”\nPérez on the Super League\n“The Super League’s proposal to broadcast football for free, through the Unify platform, is truly innovative. And it proposes applying to football what has already been successful in the film, TV series and music industries. In the same way that Santiago Bernabéu’s vision drove the creation of the European Cup, overcoming opposition, as now, from FIFA and UEFA, Real Madrid has once again honoured its history.\nWe have a unique opportunity to build a new model of governance and competition, one that prioritises both the well-being of the players and the passion and enthusiasm of the fans. There is a real chance to change course, revitalise football and restore its greatness. And the sooner we do so, the better.”\nPérez on La Liga\n“Regarding our relationship with the managers of La Liga, we have two fundamental problems: the lack of transparency and rigor in their management, and their continuous attacks on our assets. Regarding the first, we regret that the lack of transparency in their management continues to be so alarming. For example, we are surprised that, at this point, we do not know (despite our insistence and our multiple requests to La Liga ), how La Liga justifies, for example, the money that it distributes to the media and to the clubs on a bilateral basis.”\nPérez on the Ballon d’Or\n“From here I tell Rodri that he has the affection and recognition of Real Madrid because, without a doubt, he deserved a Ballon d’Or, but not this year. His Ballon d’Or was last year, when he won everything with his team and scored the decisive goal in the Champions League final.\nIt is clear that this year the Ballon d’Or should go to a Real Madrid player, whatever criteria are applied. Personally, I believe that the Ballon d’Or should be organised independently and the votes for this award should be in the hands of people of recognised prestige and solvency in the world of football, who risk their reputation with their vote.\nFor all these reasons, in these circumstances, Real Madrid has considered it appropriate not to attend this edition of the Ballon d’Or gala.”\nPérez on Vinicius Jr\n“Vinicius, you’re the best player in the world. I want you to know that the Real Madrid fans are proud of you, for everything you have had to endure in many unfair times and moments, all this has made you the player you are today.”\nFinal words\n“Dear members. We have the responsibility to continue transmitting what we once learned from our elders and from the great figures who are our role models in order to continue being leaders in football and world sport. Unity is our strength to continue dreaming of a passion that is a universal feeling. It is a pride to be a Real Madrid fan.”",
  "word_count": 2380,
  "scraped_at": "2026-02-14T12:42:41.555954"
}