{
  "article_id": "0bccd88b80c5",
  "url": "https://www.hulldailymail.co.uk/news/uk-world-news/world-championships-athletics-britain-tendendo-10240284",
  "title": "Britain leading athletes urge government to back London 2029 World Championships bid",
  "date": "20250605T130000Z",
  "domain": "hulldailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The window to host one of the world's biggest sporting events could slam shut unless the government seizes the opportunity to invest, more than 100 of Britain's most celebrated athletes have warned.\nIn a powerful open letter to the Prime Minister, Olympic champions, global medallists and rising stars have called on the government to back the bid to host the 2029 World Athletics Championships at the London Stadium with £45 million of funding.\nJoining the list of supporters are Sir Mo Farah, Keely Hodgkinson, Dame Kelly Holmes, Jonathan Edwards, Dame Jessica Ennis-Hill, Paula Radcliffe, Katarina Johnson-Thompson, Dina Asher-Smith, and Daley Thompson - a cross-generational group of sporting legends united in their belief that this is a rare opportunity to inspire the nation, foster unity, and create a lasting legacy.\nThe involvement of the athletes lends additional support to the London 2029 campaign, spearheaded by Athletic Ventures - a collaboration between UK Athletics, London Marathon Events, and the Great Run Company.\n“This is the moment to deliver something extraordinary,” said Hugh Brasher, event director of the London Marathon and co-founder of Athletic Ventures.\n“London 2029 is not a risk; it’s about return on investment for the UK. Generations of athletes know the inspirational power of a home Championships but this is about more than medals. It’s a vision for what this country can achieve.\n“With government support in 2028, we will deliver the greatest World Championships yet: commercially robust, community powered, and globally resonant. It is set to deliver more than £400 million in economic and community impact across the UK. The time to act is now.”\nThe 2029 bid process is due to commence this summer, with organisers urging ministers to commit in the coming weeks to secure the Championships for the UK.\nGreat Britain won ten athletics medals at last year's Paris Olympics, their best return in four decades. London's Diamond League meeting is established as the biggest in the world, selling out in record time last week, while Birmingham will host next year's European Championships.\nAnd to underline the sport's grassroots appeal, a record-breaking 1.1 million people have applied to run in next year's London Marathon.\nOutgoing UK Sport chair Dame Katherine Grainger recently admitted frustration at the lack of major sports events coming to the UK, which had been a legacy ambition of staging the 2012 Olympics and Paralympics.\nEarlier this year, it was confirmed that the men's and women's Tour de France races will both begin in Britain in 2027, while in football, the UK and Ireland are staging the 2028 men's European Championship.\n\"When it comes to 'mega-events', after 2028 we've got nothing secure,\" she said.\nSport has worked hard to protect its government funding, despite warnings from the Institute for Fiscal Studies that cuts are inevitable for 'unprotected' areas – those outside the NHS, defence and schools.\nAnd UK Sport have already secured a record £330m in government and National Lottery funding to support Olympic and Paralympic athletes through to the Los Angeles Games in 2028.\nLondon Mayor Sadiq Khan has made no secret of his ambition to make his city the world's foremost sporting capital, with a successful 2029 event potentially crucial to his ambition to bring the Olympics back.\nLondon held the World Championships for the first time in 2017 and the event is still considered the gold standard, while it was also a huge commercial success with over 700,000 tickets sold.\n“This is a bid rooted in credibility and ambition,” said Jack Buckner, UK Athletics chief executive and co-founder of Athletic Ventures.\n“We know what home support can achieve and when our greatest athletes from past and present are unified with one message, their call should not be ignored.\n“With London 2029, we have the chance to deliver a World Championships that lifts the nation, inspires the next generation, and showcases Britain at its very best. We’re ready. Now we need the Government to stand with us.”",
  "word_count": 656,
  "scraped_at": "2026-02-14T12:50:00.694245"
}