{
  "article_id": "0bd38a68ad47",
  "url": "https://www.irishtimes.com/politics/2025/12/20/miriams-lords-week-fianna-fail-election-fiasco-report-bundles-jim-gavin-under-the-bus/",
  "title": "Miriam Lord week : Fianna Fáil election fiasco report bundles Jim Gavin under the bus – The Irish Times",
  "date": "20251220T071500Z",
  "domain": "irishtimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "When the Jim Gavin project exploded after launch, one question was repeatedly asked of the senior people in Fianna Fáil sent out to bat in the mortifying aftermath.\nWho set the ball rolling?\nWhose idea was it?\nWho suggested that the much garlanded former GAA manager was the man to finally restore the pride and presidency of Fianna Fáil?\nREAD MORE\nTaoiseach Micheál Martin or Jim Gavin?\nIt was hardly the football strategist and former Air Corps pilot, who said and did so little during his brief candidature to suggest he had the Right Stuff to win a presidential election?\nNobody seemed to know the answer.\nWhen the ill-fated enterprise crashed and burned, quiet man Gavin melted back from whence he had come while his erstwhile Fianna Fáil sponsors went into meltdown.\nThe party’s keenly anticipated review into the Fianna Fáil fiasco landed on Tuesday.\nThere was no “smoking gun”, pronounced the people who have to read these reports the minute they come out and tell the rest of us the upshot.\nBut there was a Top Gun.\nAnd to the deep disappointment of the Taoiseach and his fluent apologists, it was the former pilot and unfortunately forgetful Jim Gavin. He was asked five times, they stressed, if there was any outstanding issue in his recent past to do with a former tenant and he said there was none.\nIt pained them to point this out, but they can’t be blamed when he said nothing.\nEasing back on the contrition and their own inept handling of the campaign, they bundled Jim ever so tenderly under the bus.\nWe must remember, said concerned apologists for Micheál Martin, that at the heart of this is a man with a wife and family. Jim maintains his dignified silence and they won’t be rubbing it in.\nAnd yet...\nWhatever about Fianna Fáil’s train-wreck campaign, it is also difficult to feel any sympathy for him either.\nIf what is contained in the report is true, Jim Gavin wanted this job and he pitched for it as far back as June.\nOn June 9th, his old friend and fellow Dublin team-mate Keith Barr approached the deputy leader of Fianna Fáil, Jack Chambers, suggesting Jim would make a good president.\nSix days later, the man himself texted Jack “seeking to follow up on the initial contact”.\nSo it seems Micheál didn’t come looking for Jim: it was Jim who came looking for Micheál.\nAnd matters went on from there with meetings taking place over the summer.\nOn August 1st, Jim confirmed to the party’s general secretary that he wanted to put his name forward.\nAnother month passed before the candidate officially entered the fray, when he wrote to the parliamentary party to seek their support.\n“Over the last two months, members of the party and the parliamentary party have approached me to ask if I would be willing to put my name forward. I was very honoured to have been approached.”\nBut not, according to the report, before he approached the party himself in early June after Keith Barr helpfully sounded out Jack.\n“Since then, I have engaged in thoughtful conversations with people both in the party and in the wider community.”\nMicheál was gung-ho for him from the get-go.\nHe said he didn’t hold out much hope for the chances of the wily Billy Kelleher, who decided to make a contest of it by challenging his anointed candidate.\nOn the day Jim went public, the Taoiseach advised journalists at an event in Kerry to treat with great caution reports that Billy had the support of 30 colleagues.\nHe got a bit of a land when the Cork-based MEP got 29 votes despite the leadership lobbying heavily for his opponent.\nBut back to Jim.\nIt’s not like he was bounced into this calamity, or anything.\nNone of them come out well from it.\nOffer of parting gift adds insult to injury as Ireland is shafted at EU fish quotas negotiations\nThe Irish fishing industry is in shock following the outcome of last weekend’s marathon European Union quota negotiations at the Agri Fish Council in Brussels.\nDiscussions went on long into the night as EU fisheries ministers tried to hammer out a deal. But despite strong protests from Ireland and other small fishing nations, a decision was railroaded through by a power bloc of four larger member states which will see a major reduction in Irish fish quotas.\nTimmy Dooley, Minister of State with responsibility for fisheries, denounced the “predatory” move by France, Germany, Poland and the Netherlands as “a fundamental act of betrayal” and told the meeting it was “particularly upsetting that the charge had been led by those that benefited most from the access to Irish waters every year since ‘83”.\nTimmy, who headed the Irish delegation, was fuming. As the meeting broke up, EU ministers and their teams of advisers milled about, making the usual small talk as they prepared to leave.\nOne onlooker observed Catherine Chabaud, the French minister for the sea and fishery, approaching her Irish counterpart with a smile on her face and a gift bag in her hand.\n“Timmy!” she cried, offering him a bottle of French wine as a gift.\n“No thank you,” he said politely. “No thank you. It’s not appropriate.”\nShe was most taken aback. As were some others in the room who saw the scene unfold.\nMme Chabaud persisted. Non? He is not going to accept her gift?\nTimmy declined again, repeating that it would not be appropriate.\nAfter the French led the charge to shaft fishing families in Ireland’s vulnerable coastal communities, no amount of Gallic charm was going to soften the blow.\nIndustry leaders say the quota cuts – coupled with the established protection measures for Ireland swept away by this “blocking minority”, will be disastrous for the industry with more than 2,000 jobs now at risk.\nHow would it have looked if Timmy had walked away from those negotiations with a nice little present from the French under his oxter?\nHe might have ended up in a different type of deep water when he got home to Clare.\nMichael Healy-Rae enjoys good hair day thanks to Boxer’s wig\nThe Regional Independents held their last meeting before the Christmas break on Wednesday. There was a festive, giddy air to proceedings.\nThis might have been because Michael Healy-Rae was wearing a wig.\nIt was at the insistence of his fellow Minister of State, Kevin ‘Boxer’ Moran.\nBut why?\n“I’d be asking him all the time: What were you like with hair? You’d love to know,” said Boxer after the photos surfaced on Thursday.\nHe’s been browbeating Michael for months now.\n“I said to him: “If I bring a wig up to the Dáil you have to wear it” and he kept saying “No, no, no!” I wanted him to do it on Halloween night so we could put him out on the street to scare people. But he wouldn’t.”\nBut he finally prevailed this week.\n“When he came in with it under the cap, I called him Richie Kavanagh. He’s the spit of Richie Kavanagh.”\nIt was a big day for the OPW minister as his wife Michelle, son Jamie and his fiance Ali visited Leinster House with his first grandchild, seven-months-old Tilly.\n“They were in the canteen and the wife said: “Will you bring Tilly up to the office? So I brought her across to the chamber for Leaders’ Questions. She sat on my lap and was as good as gold.\n“Everybody took to her because she is full of smiles. John McGuinness was sounding off in the chair and didn’t Tilly look over and take a fit of laughing. People started looking around to see where the baby was and then somebody said ‘Boxer’s babysitting today’.”\nHe wore a musical Christmas tie in case Tilly needed a blast of Jingle Bells to stay awake during Taoiseach’s Questions.\nOnline trolls meet their match in Jennifer Whitmore\nWicklow TD Jennifer Whitmore is no stranger to people – men, usually – slinging derogatory insults at her on social media. They think it’s fun to make personal comments about her for all to see.\nShe doesn’t always let them away with it.\nThis week, she spoke in the Dáil in favour of a Bill to outlaw fox hunting. She posted video of her comments during the debate on her Facebook page. It was captioned “fox hunting needs to be banned”.\nA man posted back: “And you need to stay away from the fridge door.”\nJennifer did a little sleuthing and quickly found out who he is and where he was located.\nShe phoned him up from her kitchen. And filmed it.\nIn a very pleasant tone of voice, she asks about his business and then asked if he is also a nutritionist. “Do you also give heath advice?”\nHe quickly hangs up. When Jennifer rings back, the call goes to voicemail so she leaves a message.\n“You came on to my Facebook page last night and you commented about my weight. I’m just wondering why you thought you should be able to do that, whether or not you had any qualifications on it?”\nShe added: “I also just want to say it is really not cool to do that. So I would ask that the next time you have the urge to troll, please think twice, think about being kind.”\nThe Social Democrats TD for Wicklow has had a huge response to her video.\n“I just saw the remark and it was a case of: here we go again.\n“Then I thought, if he thinks he can come on to my Facebook page and publicly be rude to me, I’ll just ring him and have a chat, one to one.”\nJennifer says she had called up trolls before, but never caught it on video.\n“Sometimes, if people are insulting me on social media, I will go back to them. It depends on how I’m feeling.\n“Sometimes you just don’t want to be dealing with it and sometimes I’ll go back and I’ll just say to them – do you know it’s not OK to say things like that to people? You don’t have to agree with my position, but don’t be mean.”\nA surprisingly large number of people have messaged her privately to apologise.\nDeputy Whitmore feels people have to be reminded that they are on a public forum. One of the reasons she confronts these trolls is because their comments are frequently directed at undermining young women, who don’t tend to fight back.\n“Being mean to people has become really normal, and it shouldn’t.”\nBarry Heneghan ends annus mirabilis with a bang\nIt was a dizzying start to the year for political novice Barry Heneghan.\nAnd it’s been a dizzying end to the year for him too. But not in the way he would have wanted.\nHaving pulled off an unexpected win in Dublin Bay North by recapturing the independent seat once held by his mentor Finian McGrath, the 26-year-old from Clontarf made an explosive entry to national politics.\nBack in January, Barry found himself right in the thick of things after his decision to support the Government as part of the Michael Lowry led Regional Independents Group. With his forthright manner and jaunty inability to pass a live microphone, he gained an unlikely national prominence within weeks.\nWith the passing of time, Deputy Heneghan has eased back on the exuberance.\nClearly, he’s been learning the ropes and is now more cautious in his dealings with the media and more measured in his pronouncements.\nHis dizzying end to 2025 had nothing to do with politics: he got clattered during a rugby match last Saturday and was taken off the field with suspected concussion.\n“Just like my politics, I went head on.”\nDeputy Heneghan was in the back row for Clontarf last Saturday against Barnhall in Kildare when the collision occurred.\n“I was very dizzy afterwards and couldn’t concentrate. I didn’t have a clue what was going on, really. They are very particular about these things in rugby, and rightly so. I had to go off.”\nHis face took a bit of a battering too but after resting up he was checked over and given the all clear to return to the office in Leinster House for the last Dáil week of the year.\nUnfortunately, Barry couldn’t attend the Regional Independent Group’s final meeting before the break on Wednesday after getting the sad news of the death of his granny, Patty Heneghan, from Shrule in Mayo.\nA great woman by all accounts.",
  "word_count": 2104,
  "scraped_at": "2026-02-14T12:12:55.404952"
}