{
  "article_id": "0bf5af126ba2",
  "url": "https://www.bbc.com/mediacentre/2023/bbc-radio-and-bbc-sounds-christmas-2023",
  "title": "BBC Radio and Sounds delivers a Christmas cracker of a schedule for listeners this festive period",
  "date": "20231127T023000Z",
  "domain": "bbc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Introduction\nCharlotte Moore, BBC Chief Content Officer, says “Listeners will be spoilt for choice this holiday season with a stocking full of festive delights from BBC Radio and Sounds. Our stations will be soundtracking your Christmas with special guest takeovers, music mixes to get you in the party mood, and a whole host of brilliant storytelling, from the nostalgic to the supernatural, there’s something for everyone. BBC Radio and Sounds is the perfect companion, keeping listeners entertained right through to Christmas Day and into the New Year.”\nBBC Sounds\n- Christmas podcast specials of Yeti, 6 Degrees with Jamie and Spencer, Your Place Or Mine with Shaun Keaveny and Inside… Ghosts\n- Soundtrack the season with hours of uninterrupted curated mixes and festive specials from Charlotte Ritchie, Romesh Ranganathan, Sophie Ellis Bextor and more with our Christmas Music and New Year Sounds collections\n- Listeners can immerse themselves in Doctor Who The Missing Episodes over the festive period, with 26 episodes that were previously thought lost\n- Bingeable boxsets from some of the top podcasts of the year will be available in the Best of 2023 collection on BBC Sounds, including The Gift, The Banksy Story, History’s Secret Heroes, People Who Knew Me, Believe In Magic and A Very British Cult\n- Escape with audiobooks and adaptations such as The Years by Annie Ernaux, The Future by Naomi Alderman, The Blue Book of Nebo and Ian Fleming by Nicholas Shakespeare\nPop Music Radio\n- On Radio 2, Jane McDonald makes her presenting debut on the station playing seasonal classics, old and new, with Steve Wright presenting a festive Pick of the Pops and Beverley Knight bringing gospel magic to the evening\n- There will be a Sounds of the 60, 70s, 80 and 90s build up to the New Year’s Eve party with Michelle Visage live from LA as the clock strikes midnight\n- On Radio 1, Clara Amfo announces the winner of Radio 1’s Hottest Record of the Year, while Jack Saunders reveals who has been crowned The Official Christmas Number 1\n- The 1Xtra family will be joined by some of the listeners’ favourite comedians from across the UK trying to find the best joke of 2023, including 1Xtra’s own Eddie Kadi as well as Munya Chawawa, Slim, Darren Harriott, Kyrah Gray and more.\n- Legendary actor Bill Nighy sits in for Iggy Pop on 6 Music, bringing his own dapper rock and roll style to your Christmas listening\n- 6 Music’s Festive Takeovers return, hosted by Wayne Coyne, Alison Goldfrapp, Samantha Morton and Chaka Khan and Queermas is back, with mixes from ABSOLUTE., HAAi, Dorian Electra and TYGAPAW\n- BBC Asian Network are starting their Christmas celebrations early on the 8 December with an All Star DJ Takeover that sees 14 DJ’s going back-to-back every hour to soundtrack your Christmas playlist. Smash Bengali will take over BBC Asian Network’s Breakfast Show from 25 December for a fortnight of festive music, fun and games\nRadio 3, Orchestras and Choirs\n- BBC Radio 3 presents an array of special guests such as Lise Davidsen, Gareth Malone, John Rutter and Anna Lapwood, as well as top performances from the BBC Singers, London Philharmonic Orchestra’s Brass Ensemble and many more\n- On Sunday lunchtimes throughout December, broadcaster Clive Myrie returns to BBC Radio 3 to bring together a feast of Advent and Christmas classical music alongside some of his personal discoveries\n- The winner for this year’s BBC Radio 3 Carol Competition is to be announced after music lovers were invited to write a tune or melody to a new lyric by Poet Laureate, Simon Armitage. Titled Polaris, it is inspired by a transformative visit to Antarctica\n- Over the month of December the BBC Singers are involved in a range of Christmas activity. As well as performances, their Christmas album Carols Revisited has been released by Warner music\nRadio 4, 4 Extra and 5 Live\n- Marking 50 years since The Wombles first appeared on the BBC, Richard E Grant narrates a charming adventure from Wimbledon common for BBC Radio 4, directed by Johnny Vegas\n- Bill Nighy stars in A. L. Kennedy’s drama A Single Act, while Brian Cox bids farewell in comedy Bob Servant Says Cheerio\n- Uncanny’s Danny Robins joins Daisy May Cooper at her Cotswolds home for a spooky Uncanny Christmas Special\n- Strictly Come Dancing head judge Shirley Ballas, Barbie director Greta Gerwig and queen of the kitchen Delia Smith are this year’s festive castaways on Desert Island Discs\n- Ruth Jones will look back at her early comic inspirations for With Great Pleasure at Christmas\n- On 4 Extra, Christmas Eve marks a whole day of celebrations of the late great Nicholas Parsons, including his reading of A Christmas Carol, interspersed with original songs and carols\n- On BBC Radio 5 Live Colin Murray, Mark Chapman, Gordon Smart and Patrick Kielty will all present shows over the Christmas period\nBBC World Service\n- BBC World Service English brings listeners a two-part documentary told from inside the Arctic Circle in northern Norway and Iceland, exploring the ‘Polar Silk Road’\n- In The Studio invites us behind the scenes with renowned ‘A Little Life’ theatre director Ivo van Hove\n- Listeners can enjoy testing their knowledge on the big events of the year with The Newshour Christmas Quiz\nBBC Local Radio\n- Local BBC Radio will continue to connect with its local audience over the festive period with a special service to mark Christmas Day\n- All 39 stations will broadcast a specially commissioned programme called Make a Difference - Keeping the Faith at Christmas, a show that looks at kindness, giving, events, music and faith that really Make a Difference to people.\nBBC Sounds\nListeners can enjoy bonus festive episodes of some of their favourite podcasts on BBC Sounds this Christmas, including Your Place Or Mine with Shaun Keaveny, Yeti, Inside… Ghosts and 6 Degrees with Jamie and Spencer, all available over this holiday period.\nThere’s also music for every seasonal occasion with expertly curated music mixes and festive specials from Charlotte Ritchie reading A Christmas Carol for the Sleeping Forecast and Romesh Ranganathan’s For The Love Of Hip Hop, to Sophie Ellis-Bextor’s Kitchen Disco and Fearne Cotton’s Sounds of the 90s, with our Christmas Music and New Year Sounds collections.\nBack To Back Christmas and Back To Back New Year long listens return with hours of uninterrupted festive shows and mixes, making it even easier for listeners to find the best on-demand Christmas Music from the BBC.\nBingeable boxsets from some of the most popular podcasts of the year will be available in the Best of 2023 collection on BBC Sounds, including The Gift, The Banksy Story, History’s Secret Heroes, People Who Knew Me, Believe In Magic and A Very British Cult.\nListeners can also escape with a range of audiobooks and adaptations such as The Wombles, The Years by Annie Ernaux, The Future by Naomi Alderman, The Blue Book of Nebo and Ian Fleming by Nicholas Shakespeare in the Books and Stories collection, all on BBC Sounds this Christmas.\nPodcasts\nYour Place or Mine with Shaun Keaveny (Available now)\nIn a festive episode of the comedy travel podcast, comedian Maisie Adam tries to tempt Shaun off his sofa to visit the snowy wonderland of Santa’s hometown, Rovaniemi in Finland. Maisie is sure that Shaun, a Santa-like figure himself, will be drawn to the heavy metal bands, black drinks and reindeer.\nYeti – Omnibus (22 December)\nIn this special omnibus episode of Yeti, adventurers Andrew Benfield and Richard Horsey recount their long search for the mythical creature. The pair travel across the Himalayas from India, to Myanmar, to Nepal and finally Bhutan, looking for proof that it exists. Along the way they hear stories of footprints, sightings and encounters. They even come across some tangible evidence. Can they prove that the Yeti is actually real? And why do we need to believe in this enduring legend?\nInside… Ghosts Christmas Special\nNathan Bryon delves into the strange goings on at Button House with the cast of Ghosts in this special episode which releases alongside the last ever episode of the show.\n6 Degrees from Jamie and Spencer (7, 14, 21 December)\nThe boys are back and throughout December will be looking for three Christmas-themed celebrities from the biggest events of the festive period, alongside their usual festive silliness.\nDoctor Who The Missing Episodes (Available now)\nSadly not all of Doctor’s Who’s earliest years survive in the BBC archive. Many episodes have been lost, seemingly forever. Bit thanks to the ingenuity of the fans, sound recordings of these missing episodes survived and were returned to the BBC. Combined with the narration from the stars of Doctor Who, here’s a chance to listen to the three adventures starring the first two Doctors.\nChristmas Music\nFrom festive specials for some of our most popular music shows to bespoke mixes curated by our experts, music fans can soundtrack their Christmas for any occasion on BBC Sounds this year. listeners can search Christmas Music or head to the music tab in Sounds to enjoy:\nChristmas Chill: enjoy a calming Christmas escape with laid-back festive gems\n- Drift into a generous slumber with a very special edition of The Sleeping Forecast featuring Ghosts star Charlotte Ritchie reading excerpts from Charles Dickens' A Christmas Carol, alongside seasonal music from BBC Introducing.\n- New this year, Essential Classic Mix: Christmas Carols hosted by Georgia Mann is full of the biggest and best-known classic Christmas carols to get listeners into the Christmas spirit.\n- A Winter Walk features festive jazz and wintry soundscapes, and there’s two hours of choral music to set the mood with A Choral Christmas from the Mindful Mix.\nChristmas Hits: Christmas is covered with a collection of classic Christmas favourites\n- Festive editions of popular mixes including Sophie Ellis-Bextor’s Kitchen Disco: Massive Christmas Hits Sleighlist!, Sounds Of The 90s with Fearne Cotton: Festive Mixtape and Radio 1 Happy: Christmas Party.\n- The Ultimate Christmas Movie Mixtape sees Radio 1's film expert Ali Plumb pick out some of the most loved songs from holiday movie favourites.\n- Zoe Ball presents Christmas Crooners celebrating the Classic Christmas hits and Crooners everyone loves to hear.\nThrowback Christmas: Timeless, nostalgic and soulful with the very best in festive hip-hop, R&B and Gospel\n- Joelah and Keke host two festive editions of 1Xtra Throwbacks where they’ll be joined by very special co-hosts including the Pressed podcast girls Adeola Patronne and Mariam Musa, plus radio royalty Trevor Nelson and Clara Amfo for an unforgettable Throwback Party.\n- Romesh Ranganathan gets into the festive feeling for this special episode of For the Love of Hip Hop, taking a deep dive into his favourite Christmas Hip Hop bangers from the past and present, plus a special appearance from his mum too.\n- 1Xtra's R&B Chill: Christmas with Chuckie & Tazer features the pair’s favourite festive R&B slow jamz of all time.\nAlternative Christmas: Christmas with a twist, soothing seasonal tunes and alternative indie hits\n- Alternative Sounds of the 90s: Dermot's Festive Crackers sees Dermot pick his alternative 90s festive playlist featuring the likes of The Smashing Pumpkins, St Etienne, Teenage Fanclub and The Muppets. Plus film buff Edith Bowman picks a Double A side from Eels.\n- Enjoy two hours of unique winter vibes and gentle early morning energy from The Morning After Mix: Christmas Special to get you through the festive period.\n- 6Music's Indie Forever: A Wonderful Indie Christmastime provides your festive indie soundtrack, with music from the likes of Julian Casablancas, Blossoms, The Big Moon, Jet and more.\nNew Year Sounds\n- Sophie Ellis-Bextor's Kitchen Disco: Ultimate Disco Party Playlist features two hours of massive disco tunes from Dua Lipa to Donna Summer.\n- Radio 1 Happy: New Year’s Eve Party! will bring in 2024 with all the positive and uplifting tunes.\n- Sounds of the 90s with Fearne Cotton features a house party mixtape to celebrate the New Year and Alternative 90s with Dermot O’Leary sees Blur’s Alex James sharing two tracks from his favourite 90s artist.\n- 1Xtra R&B Chill: New Year Special is a party special hosted by Chuckie and Tazer featuring big guests to bring in the New Year.\nNew Year Relax: Blissful New Year vibes to fuel 2024 renewal\n- Mindful Mix: Fireplace Soundscape will have soothing sounds to help escape and relax.\n- A special Morning After Mix to start the year off right, curated by Slowdive\n- Enjoy a blissful Sleeping Forecast special for New Year with a unique journey to dreamland, mixing instrumental music and Radio 4's Shipping Forecast.\nMusic Year In Review: Celebrating the best music moments of 2023\n- Joelah and Keke look back at the big Throwback comebacks of the year in Throwback Party: 2023 Throwback Moments, from Rihanna headlining the Superbowl to 50 Cent at Wireless, what will make the cut?\n- Maia Beth looks back at the biggest and best pop releases of 2023 and picks her favourite new releases of the year in Best New Pop Extra – 2023 Lookback\n- A selection of mixes celebrating an amazing year in live music will be available including The Best of the Proms, Radio 1 Best of Big Weekend and Best of Radio 2 in the Park, looking back at iconic festival performances.\n- Best of Live Lounge relives the iconic performances from stars in 2023’s Live Lounge month with performances from Olivia Rodrigo, Usher and Leigh-Anne and Best of Radio 2 Piano Room is a compilation mix featuring highlights from 2023’s Piano Room\nBBC Radio 1\nThis Christmas, BBC Radio 1 will be bringing the best of festive cheer to listeners with lots of special content, from announcing the Hottest Record Of The Year 2023 to exclusively revealing this year’s Christmas Number 1.\nRadio 1’s Hottest Record Of The Year\nThursday 14 December, 6pm-8pm\nEvery day at 6pm, Radio 1 names a brand-new Hottest Record. It’s a slot known for launching and breaking some of the most exciting new music on the planet.\nThis December, Clara Amfo will be counting down through the Top 20 Hottest Records from the past 12 months, as voted for by Radio 1’s listeners, before revealing which track has earned the coveted title of Hottest Record Of The Year 2023.\nParamore’s ‘This Is Why’ was crowned Hottest Record Of The Year in 2022.\nVoting will open on 28 November and close on 6 December with the winner announced on 14 December.\n- • Presenter: Clara Amfo\n- • Production: BBC Audio Radio 1\nFM\nJack Saunders reveals The Official Christmas Number 1\nFriday 22 December, 4pm–5.45pm\nJack Saunders will count down the Christmas Top 40 and reveal the Christmas Number 1 on The Official Chart on Radio 1.\n- Presenter: Jack Saunders\n- Production: BBC Audio Radio 1\nFM\nRadio 1 Relax @ Christmas\nThursday 1 December – Sunday 25 December, 6am-10pm\nFrom 1 December, Radio 1 Relax will be providing a Christmas pick-me-up whenever you need it with a variety of Christmas tracks playing from 6am-10pm daily. Radio 1 Happy will also have a special uplifting show playing all of the Christmas hits and party bangers.\nFM\nRadio 1 Happy\nSaturday 9 December, 5am\nRadio 1 Happy will also have a special uplifting show playing all of the Christmas hits and party bangers, available now in BBC Sounds.\nFM\nBBC 1Xtra\nThis Christmas BBC 1Xtra is turning up the festive fun and decking the halls with bells of laughter! The 1Xtra family will be joined by some of the listeners’ favourite comedians from across the UK, trying to find the best joke of 2023. Included in the stellar line up of comedic maestros, will be 1Xtra’s own and recent Strictly Come Dancing contestant, Eddie Kadi, as well as Munya Chawawa, Slim, Darren Harriott, Kyrah Gray and more. They will be spreading their waves of Christmas joy across the nation on Christmas Day and Boxing Day.\n1Xtra will also see the triumphant return of a listener favourite – Jeremiah Asiamah’s Gospel Christmas show. From the jubilant rhythms to the soul-stirring harmonies, Jeremiah will deliver the best in gospel music to wake up the nation on Christmas morning.\nBBC Asian Network\nBBC Asian Network are starting their Christmas celebrations early on the 8 December with an All Star DJ Takeover that sees 14 DJ’s going back to back every hour to soundtrack your Christmas playlist.\nSmash Bengali will take over BBC Asian Network’s Breakfast Show from 25 December to 5 January for a fortnight of festive music, fun and games.\nAcross the Christmas and New Year period, Asian Network will be expanding their successful Asian Network Certified series to include Asian Network Christmas Mash Ups taking the best Asian sounds and fusing them with well-known Christmas Hits from years gone by, for everyone to enjoy something unique over the festive period.\nAs a Christmas Day and New Year’s Day special, the network will relive the BBC’s Bollywood Prom which paid tribute to Bollywood’s late, great ‘Queen of Melody’ Lata Mangeshkar.\nAll Star DJ Takeover\n8 December, 8am-12am\nSoundtrack the start of your Christmas with BBC Asian Network’s All Star DJ Takeover. 14 of the best British Asian DJs will go back-to-back showcasing the wide variety of genres and scenes within South Asian culture throughout the whole day. All mixes will be available on BBC Sounds to listen back to across the Christmas and New Year period.\nPresenters: Nikita Kanda (8-11am), Kan D Man (11-3pm), Nayha (3-6pm), Panjabi Hit Squad (6-8pm), AJD (8-9pm), DJ Limelight (9-11pm), Pritt (11pm-12am).\nMW\nBBC Radio 2\nRadio 2 is celebrating Christmas 2023 with a host of magical festive delights. On Christmas Day, Jane McDonald makes her presenting debut on the station playing seasonal classics, old and new, whilst sharing funny Christmas stories and advice on preparing sprouts!\nThere will be specials dedicated to broadcasting greats - Cilla Black presented by Sir Cliff Richard, Barry Humphries, Michael Parkinson presented by Jamie Cullum, and Paul O’Grady presented with archive audio from the man himself. Anneka Rice, Revd. Kate Bottley and Gary Davies are live on Christmas Day, with Steve Wright presenting a festive Pick of the Pops and Beverley Knight bringing gospel magic to the evening.\nSounds of the 60, 70s, 80 and 90s build up to the New Year’s Eve party with Michelle Visage live from LA as the clock strikes midnight! To kick off 2024, New Year’s Day brings Your Ultimate Madonna Song with the Top 40 countdown as voted for by Radio 2 listeners and more Madonna delights to mark her incredible career. Many of the shows will be available before broadcast on the Radio 2 Christmas Collection on BBC Sounds.\nTrevor Nelson’s Soul Christmas\nThursday 21 December, 10pm - 12am\nTrevor Nelson returns to the Royal Albert Hall in London to host his annual festive show. This year sees Chic's Kimberly Davis and The Kingdom Choir return to the stage to belt out some Christmas classics as well as the brilliant Lemar, Shola Ama and Zak Abel, and more. This will be a Soul Christmas show to remember!\nDance along to Soul and R’n’B with a classic Christmas twist this December at Trevor Nelson’s Soul Christmas.\nTrevor Nelson says: “Last year’s Soul Christmas concert was phenomenal so we are going to bring that feel good factor back again! The Royal Albert Hall is an incredible venue and I can’t wait to return with our unique orchestral soul celebration for 2023.”\nPresenter: Trevor Nelson\nProducer: Joe Haddow\nA Spiritland production\nKA\nDriving Home For Christmas with Richie Anderson\nSaturday 23 December, 3pm-6pm\nRichie Anderson keeps you company live on the day before the day before Christmas! Whether you’re Driving Home… already at your destination or elsewhere, he’ll be delivering the perfect soundtrack for this afternoon with some of his favourite festive classics!\nRichie will be chatting to listeners across the UK about what they’re getting up to, who they’re spending the big day with and maybe even taking a request or two. Plus, he’ll be hearing from some of his celebrity friends who’ve been sending through their own Christmas greetings.\nSo whether you’re top to toe in tailbacks, roasting chestnuts on an open fire, or frantically picking up some last-minute presents, Richie’s got your Christmas Eve Eve playlist sorted!\nPresenter: Richie Anderson\nProducer: Patrick Thomas\nA BBC Audio production\nKA\nZoe Ball's Christmas Crooners\nMonday 25 December, 6-8am\nZoe provides the perfect soundtrack to the start of your Christmas Day as she shares a festive selection of her favourite crooners.\nYou’ll hear the best in the business including Bing Crosby, Andy Williams, Billie Holiday, Sarah Vaughan, Gregory Porter, Elvis Presley and Ella Fitzgerald plus festive gems from The Carpenters, Barbra Streisand and Mr Christmas himself, Michael Bublé.\nPresenter: Zoe Ball\nProducer: Julie Newman\nKA\nGood Morning Christmas\nMonday 25 December, 8-10am\nLive on Christmas Day, the Reverend Kate Bottley celebrates with carols, festive greetings and a special message. The programme will feature a specially curated mix of listeners’ favourite seasonal songs and sing-a-long carols.\nPresenter: Revd. Kate Bottley\nProducer: Mark Plant\nA BBC Audio production\nKA\nJunior Choice with Anneka Rice\nMonday 25 December, 10am-12pm\nAnneka is live on Radio 2 this Christmas Day with Junior Choice. She’ll be playing children’s favourites tunes from across the decades. There will be sing-along favourites for kids of all ages and listeners are encouraged to message the show with their top picks.\nPlease join Anneka as she provides the perfect accompaniment to family Christmas morning, live from Wogan House. Get in touch by emailing anneka@bbc.co.uk, texting 88291 or sending a WhatsApp to 08000 288 291.\nPresenter: Anneka Rice\nProducer: James Santer\nA BBC Audio production\nKA\nGary Davies\nMonday 25 December, 2-5pm\nJoin Gary Davies live from BBC Radio 2 HQ as he sprinkles festive joy and gifts great music to keep up the seasonal spirit.\nIn this fully interactive show, Gary will be celebrating the festive day with your shoutouts and providing an uplifting seasonal soundtrack for listeners across the nation - whether cooking Christmas lunch or chilling out after too much food, travelling to loved ones, still opening presents, and also for the heroes around the UK who are working on Christmas Day to cover all our needs, from the emergency services to carers to shops, suppliers and service stations.\nGet ready to get in touch with your messages and Gary’s cracker of a playlist.\nPresenter: Gary Davies\nExecutive Producer: Kellie Redmond\nA Listen production\nKA\nChristmas with Jane McDonald\nMonday 25 December, 12-2pm\nMaking her Radio 2 presenting debut, this is two hours of festive fun with one of the nation’s favourite ladies, Jane McDonald. She’ll be playing classic seasonal tracks for all the family to enjoy, sharing funny memories and heart-warming stories of Christmases gone by and giving the odd bit of advice on preparing sprouts and such like!\nJane McDonald says: “I’m so excited to be spreading the Christmas cheer, making my presenting debut to millions of listeners on Radio 2! Do join me as we have so much to look forward to - sharing feel good tunes, seasonal stories to make us laugh out loud, plus sharing some top tips to make Christmas dinner a winner! I can’t wait to spend some time with you all on this special day.”\nExpect to hear Christmas favourites old and new from the likes of Mariah Carey, Wham!, Shakin’ Stevens, Elton John, Nat “King” Cole and many more as you munch on another mince pie before the big dinner.\nPresenter: Jane McDonald\nProducer: Ste Softly\nA Mostest production.\nKA\nBeverley's Great British Gospel Christmas\nMonday 25 December, 8-10pm\nBeverley Knight, West End star and Britain's soulful sweetheart, hosts an upbeat celebration of gospel music from the UK and Ireland, festive songs and traditional carols to round off your Christmas evening.\nBeverley Knight says: “I’m looking forward to getting into the spirit of Christmas, so to be hosting my Great British Gospel Christmas this evening on Radio 2, with incredible music from both heritage and upcoming gospel artists, is a joy!”\nPresenter: Beverley Knight\nProducer: Chris Mitchell & Bernard Achampong\nA We Are Unedited production.\nKA\nCilla Black At The BBC\nMonday 25 December, 10-11pm\nIn the 1960s Cilla Black was a major music star with many hit records and performing to sell-out audiences. Then in August 1967 - only days before his premature death - Cilla’s (and Beatles’) manager, Brian Epstein, engineered her switch to television with her own eponymous variety show. Here, Sir Cliff Richard celebrates the star as she made this move into presenting with the innovative and hugely successful BBC One series, Cilla.\nIt was a ground-breaking live TV series for Saturday nights. Light entertainment and reality elements were hosted with Cilla’s sense of humour, infectious personality and warm connection with big name guests and the public. With big opening and closing numbers and duets with music guests, it featured interviews, link-ups with the public in their own home using new technology, Vox Pops on the streets, comedy sketches plus, at one point, a fully scripted mini-play with Cilla taking a main role. Sir Paul McCartney even contacted Cilla to record a song, Step Inside Love, he composed specially for her to welcome audiences to each broadcast.\nGuests included Johnny Mathis, Andy Williams, Charles Aznavour, Tom Jones, Ringo Starr, Lulu, Sandie Shaw, Twiggy, Matt Monro, Sacha Distel, Dusty Springfield, Ethel Merman, The Shadows, The Wombles, Phil Everly, Marc Bolan and Ronnie Corbett. The show’s immediate success marked the beginning of a new phase of her professional life, making her one of Britain’s top-rated television entertainers. Regularly commanding audiences between 18 - 22 million, it ran for 66 shows across eight series until it ended in 1976. Decades later, ITV made Cilla the Queen of Saturday Night TV once again with Surprise Surprise and Blind Date.\nContributors include Jimmy Tarbuck, her son Robert Willis, Gillian Reynolds, Joe Brown, Sir Tim Rice, George Layton, Bob Harris, Tony Blackburn, Hank Marvin, Mike Batt, and arranger and musician Mike Vickers, bringing their memories and appreciation of Cilla’s talent, alongside archive clips and musical numbers from the series– many unseen or heard since original transmission and believed lost. Sir Cliff was a close friend and appeared on her show many times, singing together and helping the country choose the Song For Europe.\nSir Cliff Richard says: “Too many people that we love pass on, but fortunately, people like Cilla leave behind something that will remain in our memories forever. For me, it was a joy and a pleasure and an honour to have known Cilla personally and be in close touch with her constantly. So Cilla, God bless you, rest in peace, and just remember we are going to be screaming about you forever.”\nRobert Willis, Cilla’s son, says: “60 years ago, my mother - Cilla Black - began her illustrious career in show business. She was a trailblazer for women in pop music and television. I am thrilled we are celebrating her milestone anniversary with Cilla at the BBC, narrated by my mother's dear friend Sir Cliff Richard. Many of you will fondly recall my mother's Saturday night variety show 'Cilla'. The new documentary reflects on this incredibly special time in her life when she made the transition from chart-topping pop singer to much-loved star of TV. These ground-breaking shows were top telly viewing watched by over 18 million viewers each week. I hope everyone enjoys this heart-warming trip down memory lane which will be broadcast this Christmas on BBC Radio 2. My sincere thanks to Sir Cliff and my mother’s friends who contributed to this very special tribute.”\nPresenter: Sir Cliff Richard\nProducer: Mark Simpson\nA BBC Audio production.\nKA\nTony Blackburn’s Sounds of Soul\nTuesday 26 December, 12-2pm\nIf you’re looking for a well needed antidote to all that Christmas Music then look no further. For the next two hours Tony will provide the perfect soundtrack to your Boxing Day. As well as the odd cheesy joke and all your text messages, he will be playing his personal choices of the “Sounds of Soul” throughout the decades guaranteed to have you dancing and singing along all afternoon.\nPresenter: Tony Blackburn\nProducer: Julie Newman\nA BBC Audio production\nKA\nThe Best of Radio 2’s Piano Room\nTuesday 26 to Thursday 28 December, 7-9pm\nAcross three nights from Boxing Day, Vernon Kay looks back at this year’s Radio 2 Piano Room sessions. From February’s Piano Room Month and beyond, Piano Room has once again given listeners a whole host of music experiences to remember on Radio 2’s mid-morning show and on BBC Sounds. A stellar list of artists have performed live at Maida Vale studios with the BBC Concert Orchestra, who bring their own special sound and colours to these unique performances.\nThe guest list has featured great names from a wide range of music genres, including Stormzy, P!nk, Belinda Carlisle, Simply Red, Ellie Goulding, Sugababes, RAYE, Suzanne Vega, Haircut 100, Sophie Ellis-Bextor, U2’s Bono and The Edge, Jessie Ware, Def Leppard, Depeche Mode, Gregory Porter and many more.\nPresenter: Vernon Kay\nProducer: Bob McDowall\nA BBC Audio production\nKA\nRadio 2 Remembers Sir Michael Parkinson\nTuesday 26 December, 9-10pm\nJamie Cullum pays tribute to Michael Parkinson, celebrating their unique relationship and shared love of jazz, whilst giving an insight into Michael’s passion for music and how that has contributed to the nation’s appreciation of culture.\nJamie says: “Given how important the encouragement of Sir Michael Parkinson was in my early career, it was an honour to put together this special remembering the great man – reminiscing about our shared love for jazz, times we spent together and pulling out amazing interview clips with giants from the world of jazz and beyond.”\nThe show features highlights from Michael’s famous interviews with Oscar Peterson, Muhammad Ali, Paul McCartney, Buddy Rich and more. Plus Jamie recalls how it was Michael who changed his whole career in music by giving him the opportunity to perform on his television chat show in 2003.\nPresenter: Jamie Cullum\nProducer: Karl Bos\nA Folded Wing production\nKA\nRadio 2 Remembers Paul O’Grady\nWednesday 27 December, 9-10pm\nIn this special following the sad passing of Paul earlier this year, Radio 2 remembers and celebrates Paul O’Grady through his own words from the BBC Archive, looking back on his life and career. From his early years growing up in Birkenhead to his breakthrough as his alter ego Lily Savage, Paul was always a compelling storyteller. Here he recounts the strong female characters in his early life, working at the DHSS in Liverpool, the AIDS epidemic of the 1980’s and the impact that had on his life, particularly at the Royal Vauxhall Tavern where he would spend eight years perfecting the character of Lily Savage. These memories are recounted through Paul's BBC interviews with Sue Lawley on Desert Island Discs, Steve Wright, Jools Holland, Gay Britannia and Inheritance Tracks.\nProducer: Bob McDowall for BBC Audio\nKA\nRadio 2 Remembers Barry Humphries\nThursday 28 December, 9-10pm\nThis special, presented by Steve Wright, delves into the wonderful world of Barry Humphries celebrating his career with the multi-talented man behind-the-mask himself revealing the inspiration for his larger-than-life comedy characters, with Dame Edna Everage and Sir Les Patterson among those paying tribute.\nBorn in Australia in 1934, Barry’s highly provocative comedy characters were grounded in the tradition of the music hall and also honoured the rebellious spirit of the Weimar Cabaret of Berlin. There really was no-one quite like him! With lifelong success, even at the age of 89 he had no plans to retire, with another radio series in the pipeline and having won renewed acclaim on stage for his one-man show, The Man Behind the Mask, which was due for a West End run prior to his death in April 2023.\nA consummate performer to the end and looking back on an incredible career spanning many decades, expect to be treated to rarely-heard recordings from Barry’s extensive back catalogue, including extracts from Dame Edna’s first and critically acclaimed 1976 commercial recording of Housewife Superstar!, Barry’s lesser-known character, Sandy Stone, and his musical classical extravaganzas with world-class orchestras such as The Song of Australia.\nContributors include Meow Meow who appeared with him in the acclaimed stage show Weimar Cabaret, Ben Dawson – the pianist who accompanied Barry’s last stage tour in 2022, author Kadiatu Kanneh-Mason and radio critic Gillian Reynolds.\nPresenter: Steve Wright\nProducer: Clair Wordsworth\nA Strass House production\nKA\nNew Year’s Eve Party Sounds of the 60s with Tony Blackburn\nSunday 31 December, 1-3pm\nTony Blackburn is getting the NYE party started with two hours of 60s party anthems.\nTony says: “On New Year’s Eve, I’ll be getting the party started with the very best of the 60s tunes we all love - the tracks that will always stand the test of time from the best decade of music.”\nJoin Tony to kick start the New Year's Eve celebrations with hits from The Ronettes, The Beach Boys and Petula Clark. Plus he’ll be sharing listeners’ jokes and Colin the Cockerel will be making a special appearance.\nPresenter: Tony Blackburn\nProducer: Mollie Davidson\nA 7digital production\nKA\nNew Year’s Eve Party Sounds of the 70s with Johnnie Walker\nSunday 31 December, 3-5pm\nIt's time to power up the decade's party classics and get ready for New Year's Eve, 70's style!\nJohnnie Walker says: “I look forward to doing a very energised show live from Radio 2 to get everyone’s New Year’s Eve celebrations started. I’ll be taking requests, but focussing on tracks that rock. Stevie Wonder, Marc Bolan, Bowie, Sweet, The Jackson 5, Bruce Springsteen…. It’s a great excuse to play some of my favourite party tracks.”\nJoin Johnnie for his last show of the year and celebrate New Year's Eve with a glorious soundtrack from the 1970s. Dig out your party platforms, rock out in your best bell-bottoms and feel the groove with definitive tunes from the likes of David Bowie, Stevie Wonder, Marc Bolan and T.Rex, Sweet, The Jackson 5 and the Boss himself, Bruce Springsteen.\nPresenter: Johnnie Walker\nProducer: Liz Barnes\nA Listen Entertainment production\nKA\nNew Year’s Eve Party Sounds of the 80s with Gary Davies\nSunday 31 December, 5-8pm\nThe ‘Sounds Of’ New Year’s Eve celebrations continue with Gary Davies and a bumper three-hour edition of Sounds Of The 80s, live from the BBC’s Mailbox studios in Birmingham.\nGary says: “As we all know there’s no better music to party to than 80s music - so as we get ready to welcome in 2024 join me for 3 hours of banging tunes to get the celebrations underway!”\nExpect wall-to-wall 80s classics to take you back as we look forward to 2024!\nPresenter: Gary Davies\nProducer: Johnny Kalifornia\nA Listen Entertainment production\nKA\nNew Year’s Eve Party Sounds of the 90s with Owain Wyn Evans\nSunday 31 December, 8-10pm\nOwain Wyn Evans plugs in his vast collection of disco lights and provides a cocktail of hits for an effervescent 90's New Year's Eve Party.\nOwain says: “Give the disco ball a spin and fire up the smoke machine! I can’t wait to soundtrack your NYE with my CD collection of 90’s club-thumpers and anthemic hits from a decade packed full of great tunes. We’ll see out 2023 in style!”\nFeaturing a 90's mixtape to celebrate all things 'new', the music invokes sensational memories of the decade! Owain also takes a trip down memory lane to discover the perfect 90's party essentials.\nPresenter: Owain Wyn Evans\nExecutive Producer: Vicki Blight-Pitt\nA Bengo Media Production\nKA\nMichelle Visage’s Fabulous New Year Party\nSunday 31 December, 10pm-1am\nThere's only one way to see out the old and bring in the new this New Year's Eve and that is with Michelle Visage live from LA. Michelle will be playing the most fabulous party anthems that no year should start - or close - without.\nThree hours packed with floor fillers old and new, hand-picked by the hostest with the mostest. You’ll hear Madonna, Mariah Carey, ABBA, S Club 7, Queen and more - all guaranteed to fill you with optimism for the year ahead.\nPresenter: Michelle Visage\nProducer: Ste Softly\nA Mostest production\nKA\nYour Ultimate Madonna Song\nMonday 1 January, 2-5pm\nIn November, Radio 2 listeners were asked to vote for their favourite all-time Madonna song. The results are in… and today Scott Mills hosts the Top 40 countdown.\nThe show will also feature extraordinary facts, stats and behind the scenes insights from archive interview clips with Madonna herself alongside collaborators including Nile Rodgers and William Orbit. Plus famous fans such as Alesha Dixon, Gabrielle, Louise, Vicky McClure, Mark Owen, Faye Tozer and more describe their love for her.\nScott says: “Madonna has been an incomparable trailblazer since she first donned her lace fingerless gloves in 1983 and burst into the pop world with Holiday. What a dream for me to be able to spend three hours counting down Radio 2 listeners’ favourite tracks!”\nYour Ultimate Madonna Song will also be exclusively available on BBC Sounds from Boxing Day along with Michelle Visage: My Queen - Madonna and Madonna at the BBC - which are both broadcast on Radio 2 tonight.\nPresenter: Scott Mills\nProducer: Mark Simpson\nA BBC Audio production\nKA\nMichelle Visage: My Queen - Madonna\nMonday 1 January, 5-6pm\nMichelle Visage presents a show devoted to her queen, Madonna.\nMichelle will detail when her love for Madonna started, going back to the early days of Madonna in the New York clubs, before taking us on a journey over the decades celebrating the music, the videos, the tours, the films, the style, the costumes, the interviews, the statements and the defiance. All of these have made Madonna one of the most celebrated and talked about women of the modern age, the biggest-selling female artist in history and – above all – Michelle’s idol!\nMichelle says: “This is a show I’ve wanted to make my entire life, and is a personal and heartfelt love letter to the woman who changed my life... and the world. Her support of the lgbtqia+ community is legendary, and I can’t wait to celebrate her EVERYTHING!”\nPacked with classic hits, live performances, archive interviews and news reports, this show will remind us all just why Madonna is, and always will be, The Queen of Pop. As a belated Christmas present to Madonna fans, this programme is available exclusively on BBC Sounds on Boxing Day.\nPresenter: Michelle Visage\nProducer: Ste Softly\nA Mostest production\nKA\nMadonna at the BBC\nMonday 1 January, 6-7pm\nThis programme features BBC radio and television archive interviews with Madonna, the star of stage, screen and sound, discussing her rise to fame and fortune, her ambition, reinvention and controversies, all alongside key songs from across her incredible career.\nMadonna remembers her years in the worlds of dance, electronic music and disco, her acting in A League Of Their Own and Dick Tracy, and the furore over her book, Sex. Admitting she has an outrageous personality and a bold and confrontational style, listeners will discover how she prepares for tours and recording in the studio. She discusses her feelings for albums including Erotica, Bedtime Stories, Ray Of Light and Rebel Heart, and there are in-depth interviews from her first appearance on Radio 1 when Holiday had just reached No. 40 in the charts, through to later conversations with Jackie Brambles, Terry Wogan, Zoe Ball and Jo Whiley amongst others.\nThis show is available exclusively on BBC Sounds from Boxing Day.\nProducer: Mark Simpson\nA BBC Audio production\nKA\nBBC Radio 3\nThis year, BBC Radio 3 presents the best in classical music and spoken word with an eclectic programme that celebrates the sounds and stories that make Christmas such a special time of the year. From Elizabeth Alker exploring Yorkshire carols, through to Professor Fiona Stafford investigating the surprising secrets behind the Christmas pudding, there is much to look forward to this Christmas season. There is also an array of special guests such as Lise Davidsen, Gareth Malone, John Rutter and Anna Lapwood, as well as top performances from the BBC Singers, London Philharmonic Orchestra’s Brass Ensemble and many more.\nAlongside special Christmas programming, there will also be festive editions of BBC Radio 3 favourites, including Composer of the Week, In Tune, The Verb, Late Junction, J to Z, Record Review, Freeness and Night Tracks.\nClive Myrie at Christmas\nSunday 3 December – Sunday 24 December, 1pm – 2pm\nOn Sunday lunchtimes throughout December, broadcaster Clive Myrie returns to BBC Radio 3 to bring together a feast of Advent and Christmas classical music alongside some of his personal discoveries.\nSunday 3 December\nClive recalls the excitement of Advent as a child and reveals the Christmas jazz track which conjures up a particularly cosy Christmas feeling for him. He also explains how he tries to keep the festive spirit alive when working away at Christmas in difficult times, and reveals his family's tradition of watching a Christmas film on Boxing Day when he is at home.\nSunday 10 December\nClive reveals the yuletide television event which made him so excited when he was younger, and recalls skating with his wife at Christmas in Washington DC. He also looks back to his schooldays playing in the school orchestra at this time of year, and imagines what Christmas would have been like at the Bach's house.\nSunday 17 December\nClive discusses how extensive Christmas decorations can get, and reveals his favourite Christmas book. He also explains why presents can't go under the tree too early in the Myrie house.\nSunday 24 December\nClive recalls the highs and lows of his Christmases spent in Asia, and remembers the Christmas Eves of his childhood. He also explains what Christmas has in store for him this year.\nEC\nBreakfast – BBC Radio 3 Carol Competition Special\nThursday 14 December, 6.30am – 9am\nFor this year’s BBC Radio 3 Carol Competition, music lovers were invited to write a tune or melody to a new lyric by Poet Laureate, Simon Armitage. Titled Polaris, it is inspired by a transformative visit to Antarctica.\nAnother special aspect of this year’s competition is the addition of the 11-to-15-year-old category, which will see young people allowed to enter the carol contest for the first time.\nFour entries from each category, 11-15-year-olds, and 16+, have been shortlisted to go through to the second phase of the competition, with the successful entrants working with arranger, Iain Farrington (one of the twelve Coronation composers) to transform their melodies into finely crafted and fully harmonised Christmas carols.\nPerformed live to the public for the first time by the BBC Singers on this special Breakfast programme, the eight arranged carols will be presented across BBC Radio 3 programmes until Wednesday 20 December, when voting closes. The winning carol will be announced on Radio 3’s Breakfast show on Thursday 21 December, and played throughout the festive season.\nA panel of judges have shortlisted this year’s finalists, including broadcaster Clive Myrie, Blue Peter’s Mwaksy Mudenda, Dan Hyde, Director of Music at King’s College, Cambridge, and Beverley McGeown who operates Open Arts Community Choir in Northern Ireland. Chairing this year’s judges is Abimbola Amoako-Gyampah from the Coronation Gospel Choir, who performed at the Coronation of King Charles III.\nEC\nInside Music\nSaturday 16 December - Saturday 23 December, 1pm – 3pm\nInside Music in late December will feature two stars of the choral music world, Anna Lapwood and Eric Whitacre. They’ll be taking listeners deep into the heart of their personal Christmas classical selections, with insights and stories to conjure up a distinctive festive flavour.\nEric Whitacre\nSaturday 16 December\nComposer Eric Whitacre chooses music from Renaissance master Palestrina and Florence Price’s Song for Snow, as well as upbeat pieces by Tchaikovsky, John Adams and Leonard Bernstein. Eric also selects a handful of stunning Christmas choral pieces from Sarah Quartell, Benjamin Britten, Cecilia McDowall, Philip Stopford and Francis Poulenc as well as one of his own most celebrated works, Lux Aurumque.\nAnna Lapwood\nSaturday 23 December\nOrganist and conductor Anna Lapwood hosts a festive edition of Inside Music bursting with seasonal treats, including a favourite moment from Bach’s Christmas Oratorio and A Christmas Fantasy from the Ayoub Sisters. Plus, some of the UK’s best-loved carols are reimagined by the Brighouse and Rastrick Brass Band and then by pianist Alexis Ffrench.\nEC\nEBU Christmas Around Europe\nSunday 17 December, 9am – 11.30pm\nBBC Radio 3’s annual day of live and recorded Christmas concerts gathered together by the European Broadcasting Union.\nPresented in intervals throughout the day, this year’s offering includes concerts from Amsterdam (featuring the Choir of St John’s College, Cambridge), Stockholm, Helsinki, Reykjavik (featuring experimental ensemble Nordic Affect), Copenhagen, Hanover, Paris (the complete Nutcracker ballet) and London, with the BBC Singers.\n- 9am – 1pm EBU Christmas Around Europe: Part 1\n- 2pm – 3pm EBU Christmas Around Europe: Part 2\n- 4pm – 11.30pm EBU Christmas Around Europe: Part 3\nEC\nComposer of the Week: A Vaughan Williams Christmas\nMonday 18 December – Friday 21 December, 12noon-1pm\nIn this special week of programmes, Kate Molleson explores Vaughan Williams’ experiences of Christmas across his life, and the music he wrote to celebrate the festive period. Kate explores the composer’s early experiences of Christmas at his home at Leith Hill Place, through to festivities back in London during his later years where he would host an annual carol party at his home at Hanover Terrace. The series also discusses the composer’s last trip to the USA and we hear music from his Christmas pieces Hodie and The First Nowell.\nEC\nThe Essay: The Story of Puddings\nMonday 18 December – Friday 21 December, 11.45pm – 12.00am\nIn a new series of essays Fiona Stafford, Professor of Literature at Somerville College, Oxford, explores some of the world’s favourite puddings, all of which have surprising stories and have become symbols far beyond the pudding bowl.\nMonday: Tapioca\nTapioca is equally loved and loathed - this hot and cold ‘frog spawn’ pudding’s story is reverse imperialism; an east Asian dessert with many guises, seen as old-fashioned in Britain, now hyper-trendy, conquering new global markets as ‘pearls’ in bubble tea. Tapioca symbolises one of many puddings that came to Europe from ‘the colonies’ and was embraced and customised in the UK.\nTuesday: Summer Pudding\nSummer Pudding, the supposedly quintessentially English dessert (mixed berries encased in juice-soaked stale bread), began life as a symbol of health food for weight-conscious American women over a century ago. It’s an invention from Victorian times, originally called ‘hydropathic pudding’. Key ingredients: berries, sugar and stale bread. The changing variety of berries charts the growth of global trading and capitalism.\nWednesday: Crème Brûlée\nCrème Brûlée (meaning burnt cream) is a pudding thought of as a French creation (1697), but its surprising back story saw British food historians claim it was a creation by the chefs at Trinity College, Cambridge (founded in 1546), prompting French academics to then cite their version from the early 1500s. French aristocracy’s fervent embracing of Crème Brûlée as a wealth and status symbol put this pudding on the international map, but it was soon abandoned by the French post-Revolution.\nThursday: Pavlova\nPavlova is a much-disputed national symbol claimed by rival neighbours. A crisp meringue with whipped cream and fruit, it has become a source of pride and national identity for New Zealand and Australia, with both claiming its creation with disputed historical citations. For both, it is their Christmas dessert. But the pavlova actually symbolises the re-writing of history…\nFriday: Christmas Pudding\nChristmas pudding, a British icon. Initially seen as a medieval religious symbol, it now owes much of its modern prominence to Charles Dickens. Exported as Empire Pudding, it is loved by many around the Commonwealth. There are surprising local adaptations in Asia (especially India) and the Caribbean, with people adding spices and exotic elements to the dessert, renaming it as their own Christmas tradition.\nEC\nIn Tune Christmas Special\nWednesday 20 December, 5pm – 7pm\nLive from the Radio Theatre at BBC Broadcasting House in London, presenters Katie Derham and Sean Rafferty host a Christmas party celebration like no other.\nWith special live contributions from some of the show’s greatest performer friends, including cellist Natalie Clein, folk singer Cara Dillon, pianist Iain Farrington, Alex Mendham and His Orchestra, and the BBC Singers, the programme features some favourite Christmas classics alongside seasonal readings from poet Joseph Coelho.\nEC\nBreakfast: Radio 3 Carol Competition winner announced\nThursday 21 December, 6.30am – 9am\nIn this special edition of the Breakfast programme, the winners of the BBC Radio 3 Carol Competition are announced.\nFollowing the first public broadcast of the eight shortlisted carols on the 14 December, the public have been voting for this year’s winners from the 11-15-year-old, and 16+ categories.\nEC\nGareth Malone at Christmas\nThursday 21 December, 5pm – 7pm\nAs we approach Christmas, Gareth Malone chooses an eclectic mix of seasonal music to bring festive cheer as listeners wind down at the end of the day. Expect sleigh bells, wassailing, yuletide brass, and of course, some finely sung carols along the way, in the first of two special programmes for Christmas.\nFriday 22 December, 5pm – 7pm\nPut down that Christmas shopping, pour yourself something delicious, and join Gareth Malone for two hours of relaxing Christmas classical music to warm the heart and lift the spirits on a cold, dark night.\nEC\nThe Verb Christmas Special\nFriday 22 December, 10pm – 10.45pm\nIan McMillan hosts a special Christmas edition of The Verb from the Trades Club in Hebden Bridge, recorded in front of a live audience.\nEC\nLate Junction: WaqWaq Kingdom and NYX in session\nFriday 22 December, 11pm – 1am\nLate Junction’s end-of-year Christmas party features three magical musicians: the Japanese tribal bass duo WaqWaq Kingdom, vocalist Kiki Hitomi & producer Shigeru Ishihara (aka DJ Scotch Egg), and New Zealand’s Sian O’Gorman of the NYX drone choir. Recorded in Maida Vale studios in London and for their first collaboration together, they weave Japanese min'yō, choral sounds, mind-expanding noise and bass-heavy electronics, with a healthy dose of Gameboy music and some wonky 3D printed pipes.\nEC\nRecord Review Christmas Edition with John Rutter\nSaturday 23 December, 9am - 11.45am\nAndrew McGregor presents the best new recordings of Christmas music in a special festive edition.\nConductor and composer of so many Christmas favourites including All Bells in Paradise and Angels’ Carol, John Rutter unwraps the most exciting releases and shares his 'On Repeat' track – a recording which he is currently listening to again and again.\nEC\nThis Classical Life – Jess Gillam with Lise Davidsen\nSaturday 23 December, 12.30pm – 1pm\nJess Gillam is joined by the world-renowned Norwegian soprano and this year’s Last Night of the Proms star Lise Davidsen for a Christmas edition of This Classical Life. They share their favourite Christmas music, including old favourites and new discoveries, and chat about what gives them that festive feeling.\nEC\nSound of Cinema - Christmas Special\nSaturday 23 December, 3pm – 4.15pm\nSound of Cinema is in concert this Christmas with the BBC Philharmonic and conductor Ben Palmer, offering a festive mix of film music from across the decades.\nMatthew Sweet introduces scores from timeless classics such A Christmas Carol, It’s a Wonderful Life and Miracle on 34\nth\nStreet. Also included in the mix is music from Gremlins and The Chronicles of Narnia, plus an exuberant orchestral journey aboard The Polar Express. Matthew, Ben and the orchestra are also joined by the singer Nina Bennett for a Christmas moment marking the 60th anniversary of Dr Who.\nEC\nMusic Planet: A Folk Christmas\nSaturday 23 December, 4.15pm – 5pm\nKathryn Tickell explores Christmas folk music from the British Isles. Yorkshire and Derbyshire have their own rich folk carol repertoire that's still widely sung in pubs today, and Cornwall has also kept a distinctive tradition, which includes the celebrated Sans Day Carol. We'll also hear a carol in the Manx language, the song Leanabh an Àigh in Scots Gaelic, and there's a track from Ireland's The Chieftains, plus songs from a Welsh Christmas morning 'Plygain' service.\nEC\nJ to Z Christmas special\nSaturday 23 December, 5pm – 6.30pm\nJoin the J to Z presenters for a Christmas special full of winter warmth including music from Cassie Kinoshi’s jazz reimagining of The Nutcracker.\nOpera on 3: Rimsky Korsakov’s Christmas Eve\nSaturday 23 December, 6.30pm – 10pm\nA snowstorm has hit the village where the blacksmith Wakula (Mikhail Vekua) is unhappily in love with Oksana (Sofia Fomina). She'll only marry him if gives her the Tsarina's golden shoes. The villagers are singing Kolyadkas (Ukrainian Christmas carols) but Wakula is not in the mood for singing. In desperation, he turns to the devil to fly him to the capital to get the shoes for Oksana. Will this be enough to win her hand?\nAndrew McGregor, in conversation with Rosamund Bartlett, presents this concert performance recorded last year at the Berliner Philharmonie. The Berlin Radio Symphony Orchestra and George Enescu Philharmonic Chorus are conducted by Vladimir Jurowski.\nEC\nFreeness: Peace Pieces\nSunday 24 December, 12.00am – 1am\nOn Christmas Eve, Corey Mwamba presents a selection of new free jazz and improvised music to usher in peace and welcome the sacred, taking inspiration from Peace Piece by Bill Evans. Musicians and listeners share their ideas for ‘peace pieces’, focusing on musical works imbued with a sense of tranquillity, as well as performances that express the search and struggle for serenity, calm and peace.\nEC\nSunday Morning with Sarah Walker\nSunday 24 December, 9am – 1pm\nSarah Walker dons her finest festive jumper for a special Christmas Eve edition of Sunday Morning, featuring a feast of seasonal classical music. Sarah will be joined live in the studio by special guests from the London Philharmonic Orchestra’s Brass Ensemble who will be playing a selection of favourite Christmas tunes, as well as mixing in a few surprises.\nAlongside the live music, Sarah will be unveiling a playlist featuring composers and performers for whom Christmas is a particularly special time of the year.\nEC\nSunday Feature: While Shepherds Watched\nSunday 24 December, 6.15pm – 7pm\nElizabeth Alker explores the tradition of South Yorkshire carolling in this special Sunday Feature.\nOriginally sung in churches by musicians and choirs, the carol tradition in the Victorian era suffered a huge reverse in popularity. Carols, it seemed, had failed the Victorian humour test and all but a few were driven out of churches. However, these carols have found a new home in pubs around Sheffield and South Yorkshire where the tradition has survived intact.\nAccording to international carol singing expert, the musicologist Dr Ian Russell, Professor Emeritus of the University of Aberdeen, the movement is proving increasingly popular, spreading across county lines to other parts of the UK and abroad. The tradition of carol composing is flourishing there too, with over thirty charted versions of While Shepherds Watched, as well as revivals of once lost examples.\nElizabeth Alker sets out in search of lost carols, a thriving and binding social phenomenon, speaking with Dr. Russell, local punters and folk musicians like Kate Rusby, one of a number of musicians who are enabling this hidden tradition to flourish.\nEC\nSara Mohr-Pietsch’s Hygge Christmas\nSunday 24 December, 7pm – 9pm\nSara Mohr-Pietsch presents two hours of intimate, eclectic and beautiful festive music with a Scandinavian twist, evoking the famous Danish feeling of ‘hygge.’\nHer playlist includes tracks by Norwegian jazz pianist Bugge Wesseltoft, Swedish mezzo-soprano Anne Sofie von Otter, folk group Lodestar Trio, Norwegian trumpeter Tine Thing Helseth, Concerto Copenhagen and the Danish String Quartet.\nEC\nRadio 3 at Ronnie’s\nSunday 24 December, 9pm – 10.30pm\nGeorgia Mann visits Ronnie Scott's in London for an evening of the best Christmas jazz. Emma Smith and band perform new arrangements of well-loved festive tunes, from Ella Fitzgerald's I've Got My Love To Keep Me Warm to Barbra Streisand's Snowbound, and Director of Music James Pearson takes listeners on a whistle-stop tour through the venue's Christmas gigs of the past from famous jazz legends including George Melly and Buddy Rich.\nEC\nUltimate Calm with Ólafur Arnalds and Loreen\nSunday 24 December, 10.30pm – 12.30am\nIn this special two-hour seasonal episode of Ultimate Calm with Icelandic composer Ólafur Arnalds, Ólafur shares a selection of tracks to transport listeners out of the hectic noise that comes with this time of year, and reflects on how music can be an escape.\nWe visit two musical safe havens over the course of the episode, hearing the music that Ólafur’s special guests retreat to in times of stress. Swedish singer-songwriter and Eurovision winner Loreen shares a track that combines piano with the sounds of nature, and Jess and Camilla from English indie folk band The Staves pick a soothing song that makes them take a deep breath and gives them respite from the busy chaos of life.\nEC\nChristmas Morning live with Petroc Trelawny\nMonday 25 December, 9am – 1pm\nBring extra sparkle to festive celebrations by joining Petroc Trelawny, live from London’s Broadcasting House, with his uplifting selection of seasonal music and star guests.\nAs well as featuring music that celebrates Christmas traditions around the globe, Petroc will be playing personal favourites, and listeners will be able to message the show to request seasonal music of their choice for their Christmas morning.\nEC\nChristmas Afternoon with Sean Rafferty\nMonday 25 December, 3pm – 5pm\nFestive music to thrill, sooth and nourish on Christmas afternoon, with musical surprises and Sean's special guests.\nWords & Music: Seasons Greetings\nMonday 25 December, 5pm – 6.15pm\nIn this festive edition of Words & Music, actors Dominic West and Gemma Whelan read poetry and prose exploring everything that makes for a magical Christmas: family and friends, festive food, the giving of gifts, wintery weather, angels, shepherds, and three wise men.\nWith texts by C.S Lewis, Anne Brontë, Charles Dickens, Robert Louis Stevenson, and Laura Ingalls Wilder, and a feast of seasonal music from classical to contemporary.\nEC\nNew Music Show: Oh Bobby! An Experimental Christmas Pantomime\nSaturday 30 December, 10am – 12am\nTom Service presents Oh Bobby! - a brand-new, experimental Christmas pantomime composed by Adam de la Cour and performed by a troupe of new music practitioners, including Neil Luck, Lore Lixenberg, Alwynne Pritchard and more.\nThis is an unashamedly absurd take on the traditional panto, appealing to fans of the experimental and those who revel in the ridiculous. Taking the form of a radio play, and recorded live before a studio audience, the show is interactive, with the audience performing their part by responding to the live action.\nThe plot revolves around the misadventures of characters such as Tobbin, a Virtual Reality obsessed Cockney urchin; Windows Twanky, an AI Dame; and Blotto the sock puppet, as they traverse the pitfalls and pumice stones of the year 2035.\nEC\nBBC Performing Groups\nBBC Orchestras and Choirs will be celebrating Christmas with carol concerts, festive classics, movie music, and orchestral treats, with a number of concerts broadcast across BBC Radio 3, BBC Radio 2 and BBC Radio Manchester and Scotland.\nBBC Singers\nOver the month of December the BBC Singers are involved in a range of Christmas activity. As well as performances, their Christmas album Carols Revisited has been released by Warner music. Additionally, the Singers will perform shortlisted and finalist compositions for BBC Radio 3’s annual Carol Competition.\nHandel-Mozart: Messiah\nSunday 10 December, 7pm at Saffron Hall and Tuesday 12 December, 7.30pm at Barbican, London – TX Thursday 21 December, 7.30pm on BBC Radio 3\nThe BBC Singers and Chief Conductor Sofi Jeannin are joined by the Britten Sinfonia and soloists for Mozart’s version of Handel’s Messiah. Soloists are soprano Hilary Cronin, alto Helen Charlston, tenor Laurence Kilsby and bass Morgan Pearse.\nEC\nContemporary carols with the BBC Singers\nThursday 21 December, 2.30pm at Temple Church, London – TX Friday 22 December, 2pm on BBC Radio 3\nThe BBC Singers and Chief Conductor Sofi Jeannin join organist Ashley Grote for one of their festive highlights; a concert of carols old and new.\nBBC Concert Orchestra\nGospel Messiah with Marin Alsop\nThursday 7 December, 7.30pm at the Royal Albert Hall – TX Tuesday 12 December, 7.30pm on BBC Radio 3\nMarin Alsop brings the European premiere of Gospel Messiah to the Royal Albert Hall; a re-imagined version of Handel’s Messiah with musical arrangements by Bob Christianson and Gary Anderson. Alongside the BBC CO, the performance will feature tenor Zwakele Tshabalala and Vanessa Haynes, one of the finest voices on the British soul scene.\nEC\nA Christmas Gaiety\nTuesday 12 December, 7.30pm at the Royal Albert Hall\nDrag sensation Peaches Christ and conductor Edwin Outwater are throwing a Christmas party. With the BBC Concert Orchestra leading the music, there’ll be singing, dancing and special guests including Baga Chipz, Kerry Ellis and Le Gateau Chocolat.\nEC\nTrevor Nelson’s Soul Christmas\nMonday 18 December, 7.30pm at the Royal Albert Hall – TX Thursday 21 December at 10pm on BBC Radio 2\nAward-winning BBC Radio 2 and Radio 1Xtra DJ Trevor Nelson is a household name across the UK and he is a champion for R‘n’B music worldwide. After the success of concerts in 2019 and 2022, he returns with a host of special guests performing re-imagined and re-scored iconic tracks alongside the BBC Concert Orchestra.\nEC\nBBC Philharmonic\nBBC Philharmonic and BBC Radio Manchester’s Christmas Concert\nFriday 15 December, Dukinfield Town Hall time tbc – TX on BBC Radio Manchester with date and time details to be confirmed\nBBC Radio Manchester’s annual Christmas concert with the BBC Philharmonic with presenters and special guests to be revealed.\nBBC National Orchestra Of Wales\nCarols for Christmas with the BBC National Chorus of Wales\nSunday 10 December, 2pm and 4.30pm at BBC Hoddinott Hall, Cardiff and Sunday 17 December, 3pm at Prichard-Jones Hall, Bangor\nBBC National Chorus of Wales’s Artistic Director Adrian Partington brings glittering Christmas festivity to venues across Wales. Audiences will have the chance to sing along to festive favourites and there will be readings from BBC Wales presenters, accompaniment by the brass and percussion of BBC NOW, and massed choirs from across Wales.\nEC\nBBC Scottish Symphony Orchestra\nChristmas at the Movies\nSunday 17 December, 3pm at Glasgow City Halls and Monday 18 December, 7.30pm at Usher Hall, Edinburgh – TX on BBC Radio Scotland with date and time details to be confirmed\nThe BBC Scottish Symphony Orchestra’s annual festive feast of movie music returns to Glasgow City Halls, and for the first time will also be at Edinburgh’s Usher Hall. Singer and presenter Jamie MacDougall will present the evening and Roderick Dunk will conduct a programme of sumptuous sounds from Hollywood’s Golden Age, as well as John Williams blockbusters and Disney favourites.\nEC\nChristmas Classics\nWednesday 20 December, 7.30pm at Ayr Town Hall and Friday 22 December, 7.30pm at Aberdeen Music Hall – TX on BBC Radio Scotland with date and time details to be confirmed\nThe BBC Scottish Symphony Orchestra’s annual Christmas event returns to Ayr and Aberdeen for an evening of orchestral magic hosted by the wonderful Jamie MacDougall and conducted by Roderick Dunk.\nEC\nBBC Radio 4 and 4 Extra\nThis Christmas, Radio 4 will be taking listeners on a host of festive adventures, travelling overground and underground with childhood favourite The Wombles, narrated by Richard E Grant, directed by Johnny Vegas and based on Elisabeth Beresford’s original books.\nAs part of the ongoing celebrations of 100 years of radio drama, A.L. Kennedy's play A Single Act is led by Bill Nighy, in a homage to the inventiveness of radio. John Finnemore reprises his role in a return to Moominvalley in Comet in Moominland narrated by Samantha Bond.\nFans of the supernatural will be treated to paranormal enthusiast Danny Robins joining Daisy May Cooper for a special sleepover at her home to investigate some very mysterious goings on for an Uncanny Christmas special.\nThe Today programme will mark 20 years of Christmas Guest Editors with another host of influential names, including musician Ellie Goulding and author and screenwriter Hanif Kureishi.\nConversation across Radio 4 this festive season includes Desert Island Discs with film-director Greta Gerwig, head Strictly Come Dancing judge Shirley Ballas in the run up to Christmas and cookery legend Delia Smith on Christmas Eve. On Christmas Day, actress Ruth Jones will look back at her early comic inspirations for With Great Pleasure at Christmas. Whilst over on 4 Extra, a whole day of celebrations of the late great Nicholas Parsons, including his reading of A Christmas Carol, interspersed with original songs and carols.\nScreenshot will also be celebrating the Christmas classics with a Double Acts special and guests including one half of one of the most famous double acts of all: Stephen Fry.\nThere will be plenty to make listeners chuckle this Christmas as Martin Jarvis entertains a packed house with a new performance of Just William, and much-loved character Bob Servant, played by Brian Cox, announces his retirement from public life in a new two-part series, Bob Servant Says Cheerio. There’s seasonal specials of The News Quiz, Dead Ringers and The Infinite Monkey Cage.\nDesert Island Discs: Greta Gerwig, Shirley Ballas and Delia Smith\nSunday 10 December, 17 December, 24 December, 11.15am - 12noon\nEight tracks, a book and a luxury: what would you take to a desert island? Guests share the soundtrack of their lives. This December, the Desert Island Discs castaways includefilm-director Greta Gerwig, head Strictly Come Dancing judge Shirley Ballas in the run up to Christmas and cookery legend Delia Smith on Christmas Eve.\nMythical Creatures\n1/10\nMonday 18 December, 1.45pm – 2pm\nFantasy writer Rhianna Pratchett takes us across an enchanted British Isles to discover mythical creatures that lurk in all corners of the land. She uncovers what they can tell us about our history, our world and our lives today.\nIn the first episode of the series, Rhianna is on the trail of Black Dogs. She visits Suffolk, to hear a tale of a hellhound that left its mark on the small town of Bungay. It’s one of many spectral black dogs that are said to stalk coastal paths and lonely crossroads. Rhianna explores why Black Dogs appear so often in folklore, and their psychological link to fear and negative emotions.\nStoryteller: Michael Lambourne\nOther Contributors: Helen Bruce, Mark Norman\nPresenter: Rhianna Pratchett\nProducers: Lorna Skingley and Sarah Harrison\nExecutive Producer: Mel Harris\nProduction Manager: Nikki Cannon\nOriginal Music by Ben MacDougall\nSound Design and Mixing: John Scott\nA 7digital production for BBC Radio 4\nRB2\nA Wireless War\nMonday 18 December, 2.15pm – 3pm\nAt the outbreak of war in 1939, the BBC evacuated its newly-formed Radio Drama Company of actors, led by Val Gielgud, to Worcestershire. To mark a hundred years of radio drama at the BBC, a cast of current and former members of the RDC perform this new drama by Hannah Khalil. So how do you record a play in the stables of a Victorian stately home?\nFK\nWe Forced a Bot to Write this Show\nWednesday 20 December, 11pm – 11.15pm\n1/6\nWe forced Artificial Intelligence to digest massive amounts of human media and then write its own versions. Everything from The One Show, Game of Thrones, Friends, Songs of Praise and more via movies, fables, adverts, Shakespeare, poetry and, er, gardening tips (and much much more) are forever ruined by technology.\nWe take the scripts, push them word-for-word into the mouths of actors, and the result is absurdly, joyously - and then absurdly again - hilarious.\nThis is the comedy that conclusively proves that AI is an absolute idiot.\nBased on materials by Keaton Patti.\nAdapted by Jon Holmes.\nAdditional Material:\nJon Holmes\nSarah Dempster\nGareth Ceredig\nProduced and Directed by Jon Holmes\nAn unusual production for BBC Radio 4\nFK\nToast\nThursday 21 December, 12:30pm – 1pm\nSean Farrington and Sam White return with a special edition of the BBC Radio 4 series which examines grand business ideas that promised a lot to consumers but ended up… toast. In this Christmas episode, the pair examine the fortunes of the much-loved American toy superstore Toys ‘R’ Us. In 2018, it was forced to close all of its UK stores, but it’s making a comeback. So why did the firm disappear from the UK and how does it hope to appeal to consumers now?\nRB2\nThe Archers\nThursday 21 December, 7pm – 7.15pm\nCurmudgeonly Sykesy takes to the stage at St Stephen’s comedy night “Gagriculture!” to help raise much needed funds for the village church. As Sykesy performs his close to the wire humour to a packed Ambridge audience, Alan nervously wonders whether the show will encourage his congregation back after Peggy’s boycott, or drive them further away. Elsewhere Christmas is on the move for some villagers, an emergency leads to one couple getting unexpectedly close and Kate finds there’s no room at the inn for her.\n*Jasper Carrott plays the part of ‘Sykesy’ in The Archers and contributed some of his own material for Sykesy’s routine.\nFK\nDead Ringers Christmas special\nFriday 22 December, 6.30pm – 7pm\nAll the news plucked and roasted, without the gravy or sprouts. Featuring all the people you’d least like to have Christmas dinner with.\nPerformed by Jon Culshaw, Lewis MacLeod, Jan Ravens, Jess Robinson and Duncan Wisbey. Produced and created by Bill Dare.\nFK\nScreenshot: Double Acts\nFriday 22 December, 7.15pm – 8pm\nAt the festive time of year it’s hard to escape those classic double acts and their equally classic Christmas specials, think Morecambe & Wise, the Two Ronnies, French & Saunders. In this episode Ellen E Jones & Mark Kermode explore the origins, legacy, and evolution of the double act across film and TV, both in front of and behind the camera. Guests include one half of a double act whose members have both gone on to have successful careers beyond the partnership – Stephen Fry, once of Fry & Laurie.\nRB2\nToday programme – guest editors\nSaturday 23 December – Monday 1 January (no programme on Christmas Day and Sundays), Monday to Friday 6-9am; Saturday 7-9am\nFor the past 20 years, BBC Radio 4’s Today programme has handed over the editorial reins to high-profile public figures during the week between Christmas and New Year. This year, seven Guest Editors, including musician Ellie Goulding and presenter James May, will work on the BBC’s flagship news and current affairs programme during the festive period.\nThis year’s line-up includes:\n- Dr Nicky Fox – Associate Administrator for NASA’s Science Mission Directorate (23 December)\n- Hanif Kureishi – Author and screenwriter (26 December)\n- James May – Grand Tour and former Top Gear presenter (27 December)\n- Ellie Goulding - musician, activist and philanthropist (28 December)\n- Andrew Malkinson – cleared this year after being wrongfully convicted and jailed for 17 years (29 December)\n- Professor Jason Arday – sociologist, writer and fundraiser (30 December)\n- Dame Emma Walmsley - CEO global biopharma company, GSK (1 Jan)\nIA\nComet in Moominland\nSaturday 23 December, 3pm – 4pm\nReuniting the same team that brought you Moominland Midwinter, John Finnemore reprises his role as Moomintroll, and Samantha Bond narrates.\nWe return to Moominvalley for another story concerning the Moomins, in which Moomintroll sets off on a quest to discover the truth about the Comet. He meets new friends, has exciting adventures, and faces up to what looks like it might be the end of the world, but still finds time for some late-night dancing and a few cups of palm wine.\nNarrator . . . . . Samantha Bond\nMoomintroll . . . . . John Finnemore\nMoominpappa . . . . . Samuel West\nMoominmamma . . . . . Ann Bryson\nThe Muskrat . . . . . Cyril Nri\nSniff . . . . . Clare Corbett\nSnufkin . . . . . Alex Waldmann\nThe Hemulen . . . . . Edalia Day\nSnork Maiden . . . . . Jasmine Naziha Jones\nSnork . . . . . Adam Colborne\nWritten by Tove Jansson\nDramatised by Robin Brooks\nSound Design by Lucinda Mason Brown\nDirected and Produced by Fiona McAlpine\nAn Allegra production for BBC Radio 4 and BBC Sounds\nFK\nThe Infinite Monkey Cage\nSaturday 23 December, 7.15pm – 8pm\nBrian Cox and Robin Ince are joined by the longest running science show in the world, The Sky at Night, alongside comedian and astronomy enthusiast Dara O'Briain for the ultimate guide to studying the stars from your own back garden. Sky At Night presenters Dr Maggie Aderin Pocock, Chris Lintott and Pete Lawrence join the panel to offer their top tips to backyard astronomy over the winter season. From binoculars to telescopes and even the naked eye: meteor showers, planetary moons and oddly-behaving galaxies are just some of the heavenly phenomena visible with or without equipment from the comfort of your own garden or local park. An out-of-this-world seasonal special.\nExecutive Producer: Alexandra Feachem\nFK\nI’m Sorry I Haven’t a Clue\nSunday 24 December, 12pm – 12.30pm\n6/6 (repeat)\nEnd of 80th series. Back for a second week at the Dorking Halls, panellists Fred Macaulay, Milton Jones, Jo Brand and Omid Djalili compete with one another, with Jack Dee the unimpressed umpire. Piano accompaniment is provided by Colin Sell. Produced by Jon Naismith for BBC Studios. Repeat.\nThe Food Programme\nSunday 24 December, 12.30pm– 1pm\nCooking at Christmas is so much more than just the main meal, so this year Sheila Dillon, and chef Thomasina Miers, show us how to do more with less. Sheila Dillon joins chef Thomasina Miers in her kitchen who shows her why she thinks some of the most delightful meals at Christmas are made with the leftovers, and she shares her family tradition for doctoring mince pies, to make a much more extravagant treat. Plus the pair connect with friends whose lives this Christmas feel far from normal, to hear how tradition and food can bring joy, even in the most strained situations.\nPresented by Sheila Dillon\nProduced for BBC Audio in Bristol by Natalie Donovan\nRB2\nPilgrimage for a Pint\nSunday 24 December, 4.30pm – 5pm\nFolk musicians Julie Fowlis and Karine Polwart set out on a journey to the most remote pub in mainland Britain - The Old Forge in Inverie. Located on the Knoydart Peninsular on the west coast of Scotland, the pub is only accessible by a 15 mile hike through the hills from the nearest single-track road, or by sailing into Loch Nevis from the port of Mallaig.\nJoining Julie and Karine are fellow musicians Iain MacFarlane and Ingrid Henderson, and the poets Sarah Grant and Doug Wilson Garry. They have set themselves the challenge of writing a new song and composing poetry about their two different pilgrimages for a pint. Aiming to capture their experiences in words and music - and all in time for a special 'Sunday Session' at The Old Forge where they join the locals for a fun evening celebrating the recent community buyout of this remotest of pubs.\nMore songs from the The Old Forge session can be found on BBC Radio 2's The Folk Show with Mark Radcliffe on BBC Sounds.\nProducer: Lewis Harrower\nA Soundscape production for BBC Radio 4.\nRB2\nJust William\nSunday 24 December, 7.15pm – 7.45pm\nA brand-new classic stand-up performance. Martin Jarvis entertains a packed house at the Riverhouse Barn Theatre in Walton on Thames, Surrey, with a great comic story by Richmal Crompton. This classic tale was written a hundred years ago, but the comic invention is timeless.\nWilliam, inspired by the Vicar’s sermon, resolves to speak only the truth over Christmas. With unexpected results.\nSound Engineers: Martin Mitchell and Tom Bullen\nDirector: Rosalind Ayres\nA Jarvis & Ayres production for BBC Radio 4.\nRB 2\nHow To Play: The Nutcracker Suite with Birmingham Ballet\nMonday 25 December, 8.30am – 9am\nThe Royal Ballet Sinfonia invite us into their rehearsal rooms as they prepare for their Christmas season with Birmingham Royal Ballet, and performances of Tchaikovsky’s seasonal favourite: The Nutcracker. On Christmas night, Clara is whisked away on a fairy-tale adventure with her Nutcracker doll, travelling through swirling snowflakes to an enchanted kingdom of sweets. Conductor, Thomas Jung and members of the orchestra explain how they work together to bring this magical ballet music to life, including the famous Waltz of the Flowers and Dance of the Sugar Plum Fairy.\nRB2\nIan Fleming by Nicholas Shakespeare\nMonday 25 December, 9.45am – 10am\nIan Fleming's greatest creation, James Bond, has had an enormous and ongoing impact on our culture, but Fleming was only a thriller writer in his last twelve years. Fleming's personal life and impressive career in Naval Intelligence put him at the heart of critical movements in world history, whilst providing rich inspiration for his fiction.\nExceptionally well connected, and widely travelled, from the US and Soviet Russia to his beloved Jamaica, Ian had access to the most powerful political figures at a time of profound change. Nicholas Shakespeare's fascinating biography, with unprecedented access to the Fleming family papers, uncovers new material and throws new light on an extraordinary man. Ian Fleming would strive all his life to throw off the shadows of his gifted older brother, and be a complete man, but ultimately was then overshadowed by his own famous creation.\nAbridger - Rowan Routh\nProducer - Pauline Harris\nRB2\nWoman’s Hour\nMonday 25 December, 10am – 11am\nWe take a seasonal deep dive on the sprout to tell you why every woman needs them in her life.\nThe Brits’ love-hate relationship with the veg is well known, but did you know this humble member of the brassica family is in fact a veritable superfood that can bring health benefits to women?\nThe brussel sprout is rich in coumestrol, a type of phytonutrient that can help regulate the hormone estrogen.\nAnita Rani finds out how these mini cabbages came to our shores from Afghanistan via Belgium and how it became a Christmas day staple.\nWe’ll be hearing from sprout farmers, pickers and scientists, not to mention getting some cooking tips from the nation’s favourite chefs, as well as listeners’ tips about how they like to eat theirs.\nAnd yes, it is true that they don’t taste like they used to. About 30 years ago, a Dutch scientist identified the chemicals that made sprouts bitter and they’ve been modified to make them sweeter. So for more of that, roll up your sleeves, tune in and get peeling this “queen” of vegetables.\nTuesday 26 December, 10am – 11am\nWomen who have turned super-sleuth to uncover life changing facts. From searching for missing relatives, to shining a light on forgotten female musicians and delving into historical mysteries we hear from women who have dedicated their lives to digging for the truth.\nPresenter: Nuala McGovern\nProducer: Claire Fox\nMonday 1 January, 10am – 11am\nAs 2024 kicks off Woman’s Hour speaks to women who are finding peace in all aspects of life – at home, in their community and on the global stage. We hear from women involved in climate diplomacy, hostage negotiations and even those who have stepped in to reuniting feuding friends.\nPresenter: Hayley Hassall\nProducer: Lottie Garton\nFK\nWith Great Pleasure at Christmas: Ruth Jones\nMonday 25 December, 3.15pm – 4pm\nThe co-creator of the hugely-loved sit-com Gavin and Stacey shares some of her early comic inspirations as well as memories of growing up in Wales. Her readers are Steve Speirs and Yasmine Akram, with music from English folk musicians Kate Rusby and Damien O’Kane.\nRB2\nChristmas Miracle on Brighton Pier\nMonday 25 December, 4pm – 5pm\nTim McInnerny, Mark Benton, Paul Ready and Emma Cunniffe star in Jonathan Holloway’s homage to Philip Van Doren Stern’s short story, The Greatest Gift, which became the basis for Frank Capra’s award-winning movie, It's a Wonderful Life.\nIt’s Christmas Eve and The Boss - father of all angels - has gathered together his flock in heaven. They are remembering the year 2023, known as the Year of the Dying Ley Lines, when the fate of humankind and Earth depended upon Eustace, an undistinguished angel on his last day of service.\nHis final task was to save William McFadden who, on Christmas Eve at the crack of dawn in Brighton, had stood on a Ley Line and decided he no longer wanted to live.\nOnly by convincing William that his life was worth living could these vital ancient powers be restored.\nThe past, present and alternative futures collide in this magical drama.\nCast:\nThe Boss - Tim McInnerny\nEustace - Mark Benton\nWilliam McFadden - Paul Ready\nEllen - Emma Cunniffe\nBob - Ben Crowe\nAll other parts were played by members of the cast.\nProducer: Karen Rose\nSound design: David Thomas\nProduction coordinator: Sarah Tombling\nExecutive producer: Rosalynd Ward\nRecorded on location in Brighton and Hove\nA Sweet Talk production for BBC Radio 4\nFK\nThe Wombles\n1/6\nMonday 25th December, 6.15pm – 6.30pm (boxset available on BBC Sounds from 5th December)\nThe Wombles live under Wimbledon Common, and it is their special responsibility to 'tidy up' everything that untidy Human Beings leave behind.\nRadio 4 and BBC Sounds celebrate these much loved classic characters, marking 50 years since The Wombles first appeared on the BBC.\nThis joyful festive listen is based on the original books by Elisabeth Beresford, performed by Richard E Grant, directed by Johnny Vegas and nestled in a new soundscape for Christmas 2023.\nFull of fun and warmth, with an underpinning environmental message - this is novelty and nostalgia combined and a gift of Christmas comfort-listening for all to enjoy.\nEpisode 1: 'Bungo'\nWe are introduced to the Wombles' burrow underneath Wimbledon Common. Young Bungo has just chosen his name from Great Uncle Bulgaria's atlas and is ready to become a Womble of the World as he embarks on his first day of work, tidying the Common.\nCast and Credits:\nPerformed by............ Richard E Grant\nWritten by.................. Elisabeth Beresford\nAbridged by.............. Sally Harrison and Susan Vale\nScript Consultant..... Kate Robertson\nWith thanks to.......... Marcus Robertson\nProduced by.............. Sally Harrison\nSound Engineer........ Wilfredo Acosta\nSound Designer........ Alisdair McGregor\nDirected by................. Johnny Vegas\nThis is a Woolyback Productions and Holy Pie collaboration, for BBC Radio 4 and BBC Sounds\nRB2\nIt's a Fair Cop Christmas special\nMonday 25 December, 6.30pm – 7pm\nCopper turned comic Alfie Moore takes an audience through real-life crime scenarios. The topic, crime at Christmas. What's it like to be a bobby on the beat in the festive season?\nFK\nThe Other Side of Christmas\nMonday 25 December, 10.45pm – 11pm\n1/5\nA selection of classic English stories begins with a tale by Margery Allingham, one of the queens of the Golden Age of Detective fiction, featuring her much loved sleuth, Campion. This is the first of two parts.\nLater in the series, Mackenzie Crook reads a comic tale from his favourite author Thomas Hardy, in which a group of villagers on their return from market, reminisce about Christmases past.\nThen it’s back to the early 20th century with a couple of short pieces from Hector Hugh Munro, better known as Saki, whose skill for skewering the manners and pretensions of the upper classes is turned on the business of giving and receiving Christmas presents.\nTo conclude the series, another winter mystery - The Lion’s Tooth by Edmund Crispin finds the author’s amateur detective, Fen, assisting a convent in finding a young victim of kidnap.\nOn Christmas Day in the Morning by Margery Allingham\nRead by Celia Imrie\nAbridged and produced by Jill Waters\nA Waters Company production for BBC Radio 4\nFK\nUncanny: The Haunting of Daisy May Cooper\nMonday 25 December, 10pm – 10.45pm\nDaisy May Cooper believes her house is haunted. The ‘This Country’ actor and writer shares her Cotswolds home with the spirit of a dead highwayman and a pair of disembodied legs, amongst other things. Now she’s called on the help of supernatural expert Danny Robins to investigate. Can Danny survive the night in Daisy’s haunted house?\nRB2\nA Single Act\nTuesday 26 December, 2.15pm – 3pm\nby A.L. Kennedy\nSimon Pratt ..... Bill Nighy\nJoyce Zani ..... Amelia Bullmore\nBen Vane ..... Sebastian Croft\nDirected by Sally Avens\nCelebrating 100 years of Radio Drama, A.L. Kennedy's play is an homage to the inventiveness of radio and the world of sounds.\nSimon Pratt has always wanted to be part of a double act but he leads a singular life. Now his damaged grandson needs Simon but he can't seem to connect with him nor his neighbour Joyce, with whom he has had an aborted affair. Could the magic of conjuring laughter out of sounds be the key to a happier life for all three of them?\nBill Nighy is an Academy Award nominee for the film Living and he appears regularly on Radio 4 in the titular role of Charles Paris.Amelia Bullmore is an actress and playwright. She has appeared in Coronation Street, I'm Alan Partridge and Scott and Bailey. Sebastian Croft has appeared in Game of Thrones, Horrible Histories - the Movie, Heartstopper.\nA.L. Kennedy is an award winning novelist,. She also writes for stage, screen and radio and performs occasionally as a stand up comic.\nBob Servant Says Cheerio\nWednesday 27 December, 11:30am – 12pm\n1/ 2\nAfter an astonishing business career in Broughty Ferry, Bob Servant (Brian Cox) is proud and humbled to announce his retirement from public life.\nThis event has rightfully been honoured with two special radio programmes as Bob looks back on his career; righting wrongs, bearing grudges and offering what he has learnt about life, romance, and running a relatively profitable burger van.\nBob is a largely respected expert on most topics, and his front-footed determination is unfailing - whether providing advice on the best way to approach a funeral or compliment a woman; negotiating a pardon from Tayside Police for a litany of minor criminal charges; urging his doctor to provide on-air confirmation of his physical attributes, or - most importantly – persevering in his attempts to re-establish contact with Lulu, who he met outside a petrol station in 1983 and with whom, in his words, he formed a ‘genuine lifelong connection’.\nThe two episodes feature Jonathan Watson, Phyllis Logan, Greg McHugh and Rufus Jones, plus the promise of a climactic reunion between Bob Servant and Lulu.\nEpisode 1: Bob reflects on his childhood and his status as a largely respected writer of romantic fiction. We’ll hear extracts from his finest works – Lord Dundee’s Lover and Fifty Shades of Broughty Ferry. With the help of his lifelong pal Frank; Bob also recounts the momentous occasion when he first encountered Lulu.\nAlongside the archive of the Dundee Courier, where ‘thirty years of slander’ can be found, Bob Servant's life has been detailed in Neil Forsyth's award-winning books and cult TV series (also starring Brian Cox). Neil Forsyth is the writer and creator of the BBC's multi award-winning Guilt, plus hit BBC1 series The Gold, inspired by the Brink's Mat robbery. Tannadice Pictures.\nFK\n*edit 07/12/2023\nRumpelstiltskin’s Radio Drama Romance\nSunday 31 December, 3pm – 4pm\nThe Radio Drama Department are recording their annual Christmas Pantomime - this year Rumpelstiltskin & The Sleeping Beauty, an enjoyable mish-mash of traditional fairy tales, given a 21st century twist. But our harassed producer Graham finds the two days’ recording anything but enjoyable.\nBriony (the Witch) berates the play’s author for the story’s inherent sexism, the Prince worries about waking the Sleeping Beauty with a kiss without asking her permission first, and Lizzie wonders why her character appears to behave so stupidly and questions whether this reflects how others see her.\nMeanwhile in the production room, the PA has gone sick, the writer’s beloved dog is ailing, and Graham the producer finds to his horror that he has been allocated a Technical Producer with whom he has had a brief, thoroughly unsatisfactory liaison after a drunken party.\nWhat slowly becomes apparent, is that true-life events have begun eerily to mirror some of the main themes in the pantomime.\nGordon House, the writer, was once Head of BBC Radio Drama and Rumpelstiltskin’s Radio Drama Romance, starring Jon Strickland as the much put-upon Graham, is his affectionate tribute to the medium.\nAn Essential production for BBC Radio 4\nFK\nSigmund Troy’d\nSunday 31 December, 7.15pm – 7.45pm\nYou’ve seen him online, you’ve seen him on Comic Relief and now, for the first time, you can hear him on Radio 4! Join Troy Hawke in this award-winning show as he does battle with a new enemy on behalf of all people everywhere… psychotherapy!\nIn Sigmund Troy’d, everyone's favourite smoking-jacket wearing comic is here to let anyone with self-doubts know that everything is OK - you deserve what you have, you’re entitled to what you’ve earnt and, most importantly, you are good enough.\nA social media sensation and winner of the 2022 Leicester Comedy Festival’s Best Show award, Troy makes his BBC Radio 4 stand-up debut with a show that’s guaranteed to make you laugh and feel better about the world.\nWritten and performed by Troy Hawke\nProduced by Kurt Brookes\nA Made In Manchester production for BBC Radio 4\nFK\nNews Quiz Review of the Year\nFriday 5 January, 6.30pm – 7pm\nA look back on some of the best bits of News Quizzing from 2023\nIn this compilation episode Andy Zaltzman casts his satirical eye over the highs and lows of the year, in which the UK managed to hold of a Prime Minister for more than a year (well done us), The Economy moved about as erratically as a paper plane in a snow storm, and there were some events in the Middle East that made doing a light-hearted topical news show a bit of a challenge at times...\nHosted and written by Andy Zaltzman.\nProducer: Sam Holmes\nExecutive Producer: James Robinson\nProduction Co-ordinator: Dan Marchini\nA BBC Studios Production\nFK\n--\n*Paul Sinha’s Perfect Pub Quiz will no longer air as part of the BBC Radio 4 Christmas schedule.\nBBC Radio 4 Extra\nNicholas Parsons Day with Paul Merton\nSunday 24 December\nThis Christmas Eve on Radio 4 Extra, Paul Merton celebrates the life of Nicholas Parsons, presenting a day of documentaries, drama and comedy telling the story of his life, and showcasing his incredible gifts for acting, comparing and comedy.\nPaul also talks to Sue Perkins about their shared memories of being on Just an Minute, and being part of Nicholas’s legacy of more than 50 years as its chairman.\nNicholas Parsons CBE died on 28 January 2020 aged 96.\nIn what would have been his 100th birthday year (b. 10/10/1923) this Christmas Eve Radio 4 Extra celebrates his lifetime in entertainment.\nHighlights include:\nA Christmas Carol by Candlelight\nRecorded in 2018 when Nicholas was 95, never broadcast before and produced now for Radio 4 Extra’s Nicholas Parsons Day, Nicholas narrates a new musical version of Charles Dickens’ classic Christmas story, the tale of the redemption of miser Ebenezer Scrooge. Adapted - and with new songs - by Tony Norman.\nSteve Wright and Nicholas Parsons in the Afternoon\nEspecially made for Radio 4 Extra’s Nicholas Parsons Day – Steve Wright looks back at the many times he talked with Nicholas about his life and career on his BBC Radio 2 show.\nNicholas Parsons: Paul Merton talks to Sue Perkins\nFor Nicholas Parsons Day - Paul talks to Sue Perkins about their shared memories of Nicholas on Just a Minute, from his warmth, foibles and good humour to how he was the perfect host. Sue also reflects on the her challenge of following his remarkable 50 year legacy, as chair of Just a Minute.\nHow Pleasant To Know Mr Lear 1/2\nIn 1995 for BBC Radio 2, over two shows, Nicholas recorded his tribute to one of his favourite comic writers, the creator of The Owl and the Pussycat, Edward Lear. From 1995. [Part 2 25 December -Christmas Day 2130]\nDoon The Watta\nNicholas Parsons goes 'doon the watta' to the Clyde where he worked as an apprentice engineer in 1940s Glasgow. From 2010.\nThe Grantham Connection\nNicholas travels to his first childhood home, where his father was the local GP, and the Roberts family were his patients, with a daughter who was to be better known as Margaret Thatcher. From 1994.\nThe Arthur Haynes Show\nIn his big break in entertainment, Nicholas Parsons gives a masterclass of his comic straight man gifts dealing with a most disagreeable visitor, played by comedian Arthur Haynes. From 1962.\nListen To This Space\nNicholas stars in his own comic creation, in the wake of TV’s That Was The Week That Was, one of BBC Radio’s first radio satire shows. From 1966.\nJust A Minute – 1976\nA classic episode of the show Nicholas chaired from 1967 to his death in 2020, with Kenneth Williams, Peter Jones, Alfred Marks and Shelia Hancock. From 1976.\nJust a Minute’s Indian Adventure\nNicholas Parsons travels to India to explore how Just a Minute inspired 'Jamming' tournaments in Indian colleges. From 2012.\nJust A Minute – 2017\nThe last episode where future chair Sue Perkins played the game with Nicholas Parsons as host, alongside Gyles Brandreth, Andy Hamilton and Paul Merton. From 2017.\nNicholas Parsons Day with Paul Merton\nProducer: Peter McHugh\nMade for BBC Radio 4 Extra.\nFK\nBBC Radio 5 Live\nThis Christmas, as well as keeping listeners up to date with the latest news, BBC Radio 5 Live combines big name specials with a festive schedule of live sport, including coverage of the Premier League.\n5 Live Breakfast’s famous Win The Headlines competition continues throughout December with Rachel Burden and Rick Edwards.\nThe likes of Colin Murray, Mark Chapman, Gordon Smart and Patrick Kielty all present shows over the Christmas period, while listeners can also enjoy retrospective look back at an extraordinary year of news, sport and celebrity interviews and festive episodes of top-rated podcasts including the Strictly Come Dancing Podcast, Murder They Wrote with Laura Whitmore and Iain Stirling, 6 Degrees with Jamie and Spencer, and Different with Nicky Campbell.\n5 Live Breakfast – Win The Headlines Competition\nWeek days, 6am – 9am\n5 Live Breakfast's Win The Headlines continues throughout the month of December as Rick Edwards and Rachel Burden give listeners the chance to win tickets to some of the biggest sporting events in the world just before Christmas, including the Euro 2024 Final.\nListen to 5 Live Breakfast each weekday to be in with a chance to win.\nPatrick Kielty\n23 December 9-11am\nPatrick Kielty presents a special festive edition of his show. With great guests, it's the ultimate feel good start to the Christmas weekend.\nPresenter – Patrick Kielty\nProducer: Disruptive\nFighting Talk\n23 December, 11am – 12pm\nRick Edwards presents a hilarious look at the volatile world of sport with a festive twist, where guests compete for points with their sporting punditry. Informed comments are rewarded but witless outbursts are penalised.\nPresenter – Rick Edwards\nProducer: World’s End Production.\n5 Live Sport\n23 December, 12pm – 7.30pm\nMark Chapman presents live coverage and updates from across the Premier League matches at 3pm including Tottenham vs Everton, and live commentary of Liverpool vs Arsenal at 5:30pm.\n5 Live Sport\n24 December, 12pm – 3pm\nKatie Smith presents build up and live commentary of Wolves vs Chelsea at 1pm.\n606\n24 December, 3pm – 5pm\nYour football calls with Robbie Savage and Chris Sutton.\n5 Live Sport: 72+\n24 December, 5pm – 6pm\nAaron Paul presents a Christmas special focusing on the Championship, League one and League two football with special guest Sam Allardyce\n5 Live Sport: Women’s World Cup 2023\n24 December, 6pm-7pm\nA look back at the Women’s World Cup 2023 including the Lionesses journey to the World Cup final.\n5 Live Golf\n24 December, 7-8pm\nA look back at the highlights from this year’s Ryder Cup and Solheim Cup.\nGordon Smart\n24 December, 8–10pm\nJoin Gordon on Christmas Eve night for an insiders take on the biggest news and sport stories of the year, along with exclusive interviews with movers and shakers from the world of showbiz, sport and entertainment.\n5 Live Breakfast with Colin Murray\n25 December, 7am – 9am\nColin Murray sets up your Christmas day with special guests, festive fun, and the day's news and sport headlines.\nPresenter: Colin Murray\nNaga Munchetty at Christmas\n25 December, 9am - 11am\nNaga Munchetty presents the light-hearted guide to a stress-free Christmas Day, helping us handle anything we find awkward, annoying or infuriating.\nWhether you’re seeing too few people or too many, wondering about how to recycle waste or manage unwanted gifts, Christmas can throw up dilemmas, big and small.\nTo help her navigate the day, Naga will be joined by etiquette coach William Hanson, celebrity chef Atul Kochhar, TV critic Scott Bryan, environmental expert Less Waste Laura, poet Lemn Sissay, family therapist Hannah Sherbersky and mindful walking writer Adam Ford.\nWe'll have fun with writer and comedian Rob Temple, and hear a special performance by folk singer Kate Rusby.\nWe’ll question the rules and etiquette of Christmas and find out how to make it all a bit easier. What should you take if you’re visiting a friend or relative? Do you need to dress up? Is it ever okay to lie? When is it acceptable to ask guests to leave?\nNaga will also talk about Twixmas TV, Christmas music and Boxing Day walks.\nAG\nElis and John – Best of 2023\n25 December, 11am – 12pm\nElis James and John Robins look back at their best moments from 2023.\nPresenter: Elis James and John Robins\nProducer: Audio Always\nHeadliners with Nihal Arthanayake\n25 December, 12.30pm – 2pm\nNihal Arthanayake presents some of his best conversations from the biggest guests on his afternoon 5 Live programme this year.\nPresenter: Nihal Arthanayake\nStrictly Come Dancing: The Official Podcast\n25 December, 2pm – 2.30pm\n2018 Strictly finalist Joe Sugg teams up with producer Kim Winston to bring the fans an Access All Areas backstage pass to the Strictly Come Dancing final.\nPresenter: Joe Sugg, Kim Winston\nProducer: BBC Studios\nDifferent with Nicky Campbell\n25 December, 2.30pm – 3pm\nWhat does it mean to be different? Is it how we think? Or how we act? In this award-winning BBC podcast, Nicky Campbell explores just that in a special festive episode with Bryndis Fjola, an Icelandic Elf Whisperer.\nPresenter: Nicky Campbell\nProducer: Audio Always\n5 Live News\n25 December, 3pm-3.30pm\nKing Charles III delivers his Christmas message to the United Kingdom and the Commonwealth. Followed by a round-up of the day's main stories\nPatrick Kielty – Best of 2023\n25 December, 4pm-6pm\nPatrick Kielty presents a special Christmas edition of his show reflecting on some of the great guests he has spoken to in 2023.\nPresenter: Patrick Kielty\nProducer: Disruptive\nTailenders\n25 December, 7pm-8pm\nGreg James, Jimmy Anderson and Felix White with their alternative and festive look at cricket in a special programme to round off an eventful 2023.\nPresenters: Greg James, Jimmy Anderson and Felix White\nProducer: TBI Media\n6 Degrees from Jamie and Spencer\n25 December, 10pm – 11pm\nJamie and Spencer are back together for a festive edition of 6 Degrees.\nPresenters: Jamie Laing, Spencer Matthews\nProducer: BBC Audio\nMurder They Wrote with Laura Whitmore and Iain Stirling\n25 December, 11pm – 12am\nLaura Whitmore and Iain Stirling dive into some of the world's most jaw-dropping crime stories. Expect murder, mayhem, blackmail and more from this true-crime-obsessed couple.\nPresenters: Laura Whitmore, Iain Stirling\nProducer: Mags Creative\nMatch of the Day: Top 10\n26 December, 10am – 11am\nMatch of the Day presenters Gary Lineker, Alan Shearer and Micah Richards discuss and debate their major footballing event top 10s.\nPresenters: Gary Lineker, Alan Shearer, Micah Richards\nDefoe & Deeney Football Firsts\n26 December, 11am-11:30am\nJermain Defoe and Troy Deeney take you into the football world through their eyes as they reveal the first time they experienced seminal moments in their playing careers.\nPresenters: Jermain Defoe, Troy Deeney\nProducer: Folding Pocket\nMy Mate’s A Footballer\n26 December, 11.30am-12pm\nJoe Wilkinson has always wanted a professional footballer to be his mate. Step forward Patrick Bamford, who has signed up to this podcast to work out if the pair really can become true friends.\nProducer: Folding Pocket\n5 Live Sport\n26 December, 12pm-6pm\nMark Chapman presents build up and football discussion with live coverage and updates from across the Boxing Day Premier League, Championship, League one, League two and the Scottish Premiership matches. Plus commentary of the King George VI Chase from Kempton.\n606\n26 December, 6-8pm\nYour football calls with Robbie Savage and Chris Sutton.\nColin Murray\n26 December, 8pm -10.30pm\nColin Murray reflects on the day's news and sport headlines with updates of Manchester United vs Aston Villa.\nMatch of the Day: Top 10\n26 December, 10.30pm – 11pm\nMatch of the Day presenters Gary Lineker, Alan Shearer and Micah Richards discuss and debate their major footballing event top 10s.\nPresenters: Gary Lineker, Alan Shearer, Micah Richards\n5 Live F1 Review Of The Year\n26 December, 11pm – 12am\nProducer: IMG\n5 Live Boxing with Steve Bunce: Review of 2023\n26 December, 12am – 1am\nProducer: Left Peg Media\n6 Music\nChristmas on 6 Music this year promises to be a treat of festive delights to suit all tastes: legendary actor Bill Nighy sits in for Iggy Pop (Sundays, 4pm-6pm), bringing his own dapper rock and roll style to your Christmas listening; 6 Music’s Festive Takeovers return, hosted by Wayne Coyne (Christmas Day, 7pm-9pm), Alison Goldfrapp (Boxing Day, 7pm-9pm), Samantha Morton (Wednesday 27th December, 7pm-9pm) and Chaka Khan (Thursday 28th December, 7pm-9pm), as does Queermas (Friday 22nd December, 9pm-1am), with mixes from ABSOLUTE., HAAi, Dorian Electra and TYGAPAW; British-American three-piece group Gabriels is 6 Music’s festive Artist in Residence; and ringing in the New Year will be Stuart Maconie, with a Northern Soul Party and SHERELLE.\nIggy Pop... Bill Nighy sits in\nSunday 10 December, 4pm-6pm\nBill serves up a sonic cocktail to soundtrack listeners’ Sunday afternoons.\nIn the first of four shows this December, he spins some of his favourite artists, including Prince, Meshell Ndegeocello, The National and boygenius.\nHe also chats about being mistaken for other well-dressed people in the public eye, some of his favourite lyrics and the curse of dad dancing.\nBill Nighy says: “It feels good being back on 6 Music, it feels contemporary, feels pop, feels hip… I feel radical! And I am so looking forward to keeping Iggy Pop’s seat warm on these cold December afternoons.”\nDeputy presenter: Bill Nighy\nProducer: Adam Dineen\nA BBC Audio production\nSH8\nIggy Pop…Bill Nighy sits in\nSunday 17 December, 4pm-6pm\nThis week, Bill has solid gold songs from the likes of Primal Scream, Aretha Franklin, beabadoobee and the guv'nor himself, Mr Iggy Pop.\nHe also ruminates on how his dreams of becoming a lead singer were dashed by a prolonged period of difficult hair.\nDeputy presenter: Bill Nighy\nProducer: Adam Dineen\nA BBC Audio production\nSH8\n6 Music Artist in Residence - Gabriels\nMonday 18 December, 9pm-10pm\nBritish-American trio, Gabriels, are 6 Music’s Christmas Artist In Residence. The band will present eight new shows, which will be broadcast Monday 18 – Thursday 21 December and Monday 25 – Thursday 28 December (9pm-10pm).\nFormed in Los Angeles in 2016, Gabriels is made up of Jacob Lusk (vocals), Ari Balouzian (strings, production) and Ryan Hope (keys, production). They released their breakout single, Love and Hate in a Different Time, in 2021, which was referred to by Elton John as “one of the most seminal records I’ve heard in the last 10 years”.\nThe band have had an incredible year, from Jacob’s sensational performance at Glastonbury Festival with Elton, to receiving a nomination for Best International Group at this year’s Brit Awards. This year, Gabriels also reached Number Three in the UK Album Charts with the release of the second part of their 2022 debut studio album, Angels & Queens, and are one of the inaugural 6 Music Artists of the Year.\n6 Music's Artist In Residence is a journey into the musical soul of an artist, based around a theme or mood. Each episode of Gabriels’ series sees the band explore songs that have shaped the diverse musical trajectories of each member, such as Jacob’s gospel music heritage and Ryan and Ari’s experience as film score composers. They also share the music that unites them as a trio.\nThroughout the series, they’ll explore the inspirations behind their album, Angels & Queens; Ryan’s history on the dancefloors in North East England and London; and Ari’s eclectic mix of interesting blends. Plus there will be a special Christmas Day episode, featuring Jacob’s perfect songs for the winter season.\nPresenter: Gabriels\nProducer: Tom Raine\nA BBC Audio production\nSH8\nLauren Laverne’s Christmas Party, live from Maida Vale\nFriday 22 December, 7.30am-10.30am\nLauren gets listeners into the festive spirit with her very own Christmas party, coming live from Maida Vale studios.\nAfter returning as a duo this year with new music on Communion Records, The Staves will be performing a very special Christmas concert live on the show. Now a duo of Jess and Camilla Staveley-Taylor, the band will be performing new music, including their return single, You Held It All, as well as some festive classics. Plus, they'll be joined on stage by some good musical friends.\nLauren will also be joined by fellow 6 Music presenter, Huw Stephens, who'll be offering some rare Christmas jams from his extensive collection, ahead of starting his new daily show on Tuesday 9th January 2024.\nPlus, Professor Hannah Fry will be diving into The Christ-maths Of Life, looking at some of the fascinating facts and figures around this time of year, and it's the much-anticipated return of the People's Sleighlist, with all the Yuletide bangers picked by listeners.\nPresenter: Lauren Laverne\nProducer: Mark Higgins\nA BBC Audio production\nSH8\nQueermas\nFriday 22 December, 9pm-1am\nTo bring in the holiday season, four of music’s brightest talents, ABSOLUTE. (9pm-10pm), HAAi (10pm-11pm), Dorian Electra (11pm-12am) and TYGAPAW (12am-1am) guide listeners through their ideal queer disco party, sharing personal favourite tracks and stories along the way.\nNow an annual tradition on 6 Music, Queermas takes place the Friday before Christmas and sees the station welcome some of its favourite LGBTQ+ artists to the 6 Music decks.\nA staple across London’s queer club scene, ABSOLUTE. is a DJ and producer making four-to-the-floor, uplifting dance music. Having recently created an official remix of Kylie Minogue’s Padam Padam, ABSOLUTE. has garnered support from the world’s biggest DJ’s and collaborated with the likes of Joe Goddard and Bimini.\nHAAi is an Australian DJ and producer based in London. Known for her signature blend of psychedelic techno and electronica, she is a force to be reckoned with behind the decks. In 2018, she won BBC Radio 1’s Essential Mix of the Year, and in 2022, she released her debut album, Baby, We’re Ascending.\nDeemed one of the most important acts in experimental pop, Dorian Electra is an artist hailing from Texas. Having collaborated with the likes of Lady Gaga, Charli XCX and 100 gecs, their latest project, Fanfare, was released in October to critical acclaim. 2024 will see them embark on a world tour.\nBrooklyn-via-Jamaica DJ and producer TYGAPAW released their debut album, GET FREE, in 2020 and has since been unstoppable. Their blend of unrelenting techno with ballroom, dancehall and club music has led them to tour clubs over the world. Their latest project, love has never been a popular movement., was released in 2023 on fabric Records.\nPresenters: ABSOLUTE., HAAi, Dorian Electra and TYGAPAW\nProducer: Henrietta Rowlatt\nA We Are Grape production\nSH8\nIggy Pop... Bill Nighy sits in\nSunday 24 December, 4pm-6pm\nTwas the Nighy before Christmas and all through December, Bill Nighy is sitting in for Iggy Pop.\nOn this most Christmas of eves, expect a seasonal selection including Amy Winehouse, Willie Nelson, Alicia Keys and Bing as you've probably never heard him before.\nBill also spins some non-festive favourites to save your sanity, including one tune that attained the hallowed status of being his first ringtone.\nDeputy presenter: Bill Nighy\nProducer: Adam Dineen\nA BBC Audio production\nSH8\n6 Music’s Festive Takeover - Wayne Coyne\nMonday 25 December, 7pm-9pm\nFlaming Lips frontman Wayne Coyne is at the controls of the first of four 6 Music Festive Takeovers.\nHe’s sung about Christmas at the Zoo, covered White Christmas and even starred as alien Santa in the movie Christmas on Mars, so who could be better qualified than Wayne Coyne to take listeners into the evening on Christmas Day.\nAlong the way, listeners can expect music from the likes of Marvin Gaye, Yoko Ono, Nell, Miley Cyrus and David Bowie, plus stories from across The Flaming Lips’ 40 years at the heart of the indie music scene.\nWayne Coyne says: \"I'm very honored and grateful to be included in this year's Festive Takeover .. and I love that it will air on Christmas Day. I will be playing some of my OLD favorites and some of my NEW favorites and telling a few stories about my wonderfully weird childhood growing up in Oklahoma and how the magic of music combined with the magic of Christmas can evoke the deepest bliss a human can experience.”\nPresenter: Wayne Coyne\nProducer: Paul Sheehan\nA BBC Audio production\nSH8\n6 Music’s Festive Takeover - Alison Goldfrapp\nTuesday 26 December, 7pm-9pm\nAlison Goldfrapp - English musician and record producer, and one half of electronic music duo, Goldfrapp - will be bringing her taste and style to 6 Music as she presents her very own Festive Takeover.\nWith Goldfrapp, Alison released seven albums and hits include Strict Machine, Ooh La La, Lovely Head and A&E and was nominated for multiple awards, winning an Ivor Novello Award for Strict Machine. She released her debut solo album, The Love Intention, this year and has found further success in her musical collaborations with artists such as John Grant and Christina Aguilera.\nAlison says: “I’m looking forward to spending the evening with you all with my very own 6 Music Festive Takeover. I’ll be playing some classic and recent tunes including some wintry faves to get you in the spirit of the season.”\nPresenter: Alison Goldfrapp\nProducer: Angela Davies\nA BBC Audio production\nSH8\n6 Music’s Festive Takeover - Samantha Morton\nWednesday 27 December, 7pm-9pm\nSamantha Morton is a double Oscar-nominated, Golden Globe and BAFTA winner, who has been acting since the early 90s in Hollywood, independent movies and TV. Her breakthrough role was in Lynne Ramsay’s Morvern Callar, and she went on to star in films such as Minority Report with Tom Cruise, Sweet and Lowdown, Elizabeth: The Golden Age, The Whale and She Said as well as in TV series such as Harlots, The Walking Dead and The Serpent Queen.\nAlongside her acting work, Samantha is passionate about music and recently recorded an album with XL Recordings’ Richard Russell, which they will be taking on tour next year.\nFor her Festive Takeover, Sam will be playing a mix of her musical influences along with some of the newer artists she’s discovered in 2023.\nSamantha Morton says: “I’m so excited and a little nervous to be sharing some of my favourite records with you all, especially at such a special time of year. Love Sam.”\nPresenter: Samantha Morton\nProducer: Jax Coombes\nA BBC Audio production\nSH8\n6 Music’s Festive Takeover - Chaka Khan\nThursday 28 December, 7pm-9pm\nAmerican “Queen of Funk” Chaka Khan will be the final Festive Takeover host this year, bringing her signature energy and fabulousness to listeners as she creates a show to take listeners through the Bank Holiday.\nKnown for classical hits such as I Feel for You and I’m Every Woman, there really Ain’t Nobody like Chaka Khan!\nPresenter: Chaka Khan\nProducer: Mark Plant\nA BBC Audio production\nSH8\nIggy Pop…Bill Nighy sits in\nSunday 31 December, 4pm-6pm\nBill soundtracks the descent into New Year's Eve.\nExpect dancefloor classics from The Showstoppers and The Emotions, alongside grooves by Marvin Gaye, Freaky Realistic and Maribou State.\nBill also confesses to once being that bloke at parties who got hold of the record player and never let go. Thus, he's in his element once again with one hand firmly on the turntable tonearm and the other rifling through the stacks of vinyl.\nDeputy presenter: Bill Nighy\nProducer: Adam Dineen\nA BBC Audio production\nSH8\nStuart Maconie’s Northern Soul Party\nSunday 31 December, 8pm-10pm\nStuart Maconie presents two hours of Northern Soul bangers.\nSoundtrack your New Year’s Eve with guaranteed dance floor fillers from legendary clubs like The Golden Torch, Twisted Wheel, and of course, Wigan Casino.\nStuart previously celebrated the 50th anniversary of legendary Northern Soul venue Wigan Casino with a Northern Soul All Nighter with highlights including a special Northern Soul edition of The Craig Charles Funk and Soul Show and a broadcast of Stuart Maconie’s Northern Soul Prom, which was recorded at the Royal Albert Hall in July 2023.\nTonight’s show will be broadcast live from Salford.\nPresenter: Stuart Maconie\nProducer: Helen Hobday\nA BBC Audio production\nSH8\nSHERELLE\nSunday 31 December, 10pm-1pm\nEnter 2024 in style with SHERELLE's Massive Ravey NYE party. Listeners can expect exclusive mixes and a bag full of high-energy, nostalgia-fuelled records.\nMeet you front-left for three hours of sweaty, intimate vibes!\nPresenter: SHERELLE\nProducer: Ollie Brady\nA We Are Grape production\nSH8\nBBC Radio World Service English\nBBC World Service English brings listeners a range of festive treats this Christmas, including a 2 part documentary told from inside the Arctic Circle in northern Norway and Iceland, exploring the ‘Polar Silk Road’. In The Studio invites us behind the scenes with renowned ‘A Little Life’ theatre director Ivo van Hove; while listeners can enjoy testing their knowledge on the big events of the year with The Newshour Christmas Quiz. In CrowdScience’s 2023 Year-End Extravaganza the team will be answering questions they never got the chance to cover as well as catching up with some of their favourite guests from previous episodes; and the key climate stories of 2023 are rounded up in The Climate Review of the Year. There’s stand-up comedy from The Arts Hour New Year Comedy Special, featuring an international line up of top comedians; while World Service Correspondents’ Look Ahead aims to predict the events and trends which might shape 2024. And from the Royal Opera House in London, Georgia Mann presents the annual BBC World Service New Year Concert featuring members of the BBC New Generation Artists scheme.\nThe Tues Documentary - Stories from the New Silk Road: Norway\nTuesday 12 December, 9.30-10am\nIn the ‘High North’ of Norway in a coastal town called Kirkenes, inside the Arctic Circle, Anna Holligan is on the edge of what the Chinese refer to as the ‘Polar Silk Road’. The Northern Sea Route or North East Passage is an increasingly valuable shipping route for both Russia and China, heading east from this region, hugging the Russian coastline to Eastern Siberia.\nOn the Barrents Safari with guide Hans Hatle, Anna discovers how the Polar Silk Road could potentially change the fortunes for this most northerly Norwegian town. Port Director, Terje Jørgensen, wants to open up to Chinese shipping and is in talks with operators to increase the capabilities of the port. Terje’s point is simple, Kirkenes is geographically closer to Beijing via sea than any other port in Europe.\nIn 2010 a ship departed from Kirkenes bound for China with 41,500 tons of iron ore concentrate, arriving 22 days later. Via the Suez canal, the same journey would have taken over 40 days. It was the first time that a non-Russian ship had been along the Northern Sea Route along Russia’s Northern coastline, showing that this was possible and paving the way for China’s Arctic policy.\nHere, Anna shines a light on China’s wider ambitions in the Arctic. The region is rich in minerals, wildlife, fish, and other natural resources. So what does China’s Polar Silk Road mean for Norway and when the sea ice melts, who is set to benefit most?\nPresenter – Anna Holligan\nProducer – Peter Shevlin\nA C60 Media Production for the BBC World Service.\nES\nThe Tues Documentary - Stories from the New Silk Road: Iceland\nTuesday 19 December, 9.30-10am\nIn 2013, Iceland wrote history by becoming the first European country to sign a free trade agreement with the People's Republic of China. It was aimed at increasing exports from Iceland to China as well as opening up Iceland to cheaper Chinese consumer goods.\nGeothermal energy has meant that Iceland is, in effect, carbon neutral. Its expertise in this area has led to collaboration with China, and its geothermal model is changing China's energy mix. One man behind this collaboration is Atli Jonnsson, CEO of Arctic Green Energy. Anna Holligan asks him how will geothermal help shape the future needs of China's energy consumption? And how does geothermal put Iceland on the Silk Road map for more collaboration with China?\nIceland and China have steadily increased their scientific cooperation in the Arctic. In October 2018, the China-Iceland Arctic Science Observatory was officially opened in the city of Karholl in northern Iceland. Set up to monitor climate and environmental change in the Arctic, the observatory is managed by the Polar Research Institute of China and Iceland's Institute of Research Centres.\nAnna travels to this remote outpost, 440 km north of Reykjavík, to ask station manager Halldor Johannsson about the impact this collaboration has on Iceland. How is information shared with the second biggest economy in the world? And what could this eventually mean in terms of trade and transport across the Arctic region?\nPresenter – Anna Holligan\nProducer – Peter Shevlin\nA C60 Media Production for the BBC World Service.\nES\nIn The Studio – Ivo van Hove\nTuesday 19 December, 11.30am-12pm\nIvo van Hove is one of the most sought after theatre directors in the world. We join him in Paris, London and Amsterdam, where he works on productions that are often 'maximal' - big musicals, operas and dramas such as The Damned - but where he also loves to create 'minimal' intimate dramas - such as The Glass Menagerie or A Little Life - that are beautifully observed.\nHow does van Hove work? Why are actors of the calibre of James Norton and Isabel Huppert (who appear in the programme) so willing to work with him? And what drives his relentless thirst to bring new experiences to the theatre audience?\nPresenter – Susan Marling\nProducer – Susan Marling\nA Just Radio Production for the BBC World Service.\nES\nThe Climate Question – Climate Review of the Year\nFriday 22 December, 10.30-11am\nWith 2023 set to be the warmest year on record, we look back at some of the key climatic events. Drawing on 12 months of reporting, The Climate Question host, Graihagh Jackson, and BBC Climate Editor, Justin Rowlatt, bring together a global panel to discuss what the climate’s been doing, the latest climate science and how the world is progressing on finding policy and practical solutions.\nPresenter – Graihagh Jackson\nProducer – Nick Holland\nA BBC World Service Production.\nES\nCrowdScience – 2023 Year End Extravaganza, Part 1 and Part 2\nFriday 22 December and Friday 19 December, 8.30-9pm\nPart 1\nHappy holidays, Merry Christmas, and welcome to part one of CrowdScience’s year-end extravaganza! 2023 was a fascinating year - we answered questions about panic attacks, climbing plants, ostriches, even the weight of the internet - and in this episode we’ve got a smorgasbord of special features for you. We’re catching up with some of our favourite guests from previous episodes to find out what they’ve been up to; answering questions we never got the chance to cover; and topping it all off with a CrowdScience Christmas carol…\nProducer – Phil Sansom\nA BBC World Service Production.\nRD\nPart 2\nStart the countdown to midnight… this is part two of CrowdScience’s year-end extravaganza! 2024 is almost upon us, but there’s just about time to look back on some of the best stories we covered this year and reveal the parts that never made it onto the air. Tune in for a cornucopia of bonus content: audio that got left on the cutting-room floor; fascinating research we never got to cover; and what new years’ resolutions do we expect from the CrowdScience team?\nProducer – Phil Sansom\nA BBC World Service Production.\nRD\nA Festival of Nine Lessons and Carols\nSunday 24 December, 3-4.30pm\nFor millions listening around the world, A Festival of Nine Lessons and Carols, live from the candlelit Chapel of King's College, Cambridge, marks the beginning of Christmas. The service is based around nine Bible readings which tell the story of the loving purposes of God. They are interspersed with carols old and new, sung by the world-famous Chapel choir who also lead the congregation in traditional Christmas hymns.\nA new work has been commissioned for the Christmas Eve service every year since 1983, and this year Cheryl Frances-Hoad has written ‘The Cradle’, a setting of an English translation by Robert Graves of an anonymous seventeenth century Austrian text.\nA number of pieces by twentieth century composers such as Robin Nelson, Matthew Martin, Judith Weir, James MacMillian, Philip Ledger, William Mathias, and Peter Warlock, sit alongside traditional carols in arrangements by Sir David Willcocks and Christopher Robinson. The service also includes the carol ‘All the stars looked down’, composed by John Rutter in memory of the former Director of Music at King’s, Sir Stephen Cleobury.\nProducer - Ben Collingwood\nA BBC Production.\nES\nNewshour Christmas Quiz\nMonday 25 December, 2.30-3pm\nThey can ask the tough questions - but do they know the answers? On 25 December, Newshour on BBC World Service Radio will put its hosts to the test in the best of festive traditions: the Newshour Christmas Quiz. James Coomarasamy will be finding out what his colleagues can remember about the big, and not-so-big, events of the year. Big brains or blank faces: you decide. And who will be this year’s mystery guest?\nPresenter - James Coomarasamy\nProducer - Paul Schuster\nA BBC World Service Production.\nES\nHis Majesty The King’s Christmas Message\nMonday 25 December, 3-3.10pm\nCoverage of His Majesty the King's Christmas message to the Commonwealth.\nA BBC Production for the BBC World Service.\nES\nBBC Correspondents’ Look Ahead to 2024\nFriday 29 December, 10-11am\nNuala McGovern asks some of the BBC's top correspondents from around the world to gaze into their crystal balls and predict what 2024 might have in store. 2023 has been dominated by the conflicts in Ukraine and Israel and Gaza and a global cost of living crisis. Next year will see nearly half of the world’s population going to the polls, with general elections scheduled in the USA, UK, South Africa, India, Russia, Pakistan, Mexico and Venezuela, among others. How might the outcome of these affect the geopolitical tectonic plates? And will the economic picture improve? Big questions, but luckily we have some of the BBC's best minds on hand to provide plenty of answers.\nPresenter – Nuala McGovern\nProducer – Ben Carter\nA BBC World Service Production.\nES\nThe Arts Hour: Comedy Special\nSaturday 30 December, 8-9pm\nThe Arts Hour celebrates the New Year with some of the world’s finest comedians.\nNikki Bedi and South African comedian Tumi Morake host an international line-up of some of the best comics from around the world.\nTaking part in the New Year celebrations are:\nNew Zealand comedian Jarred Christmas, deftly mixing gags and story-telling.\nAmerican-born but now living in Denmark, Abby Wambaugh, whose comedy will warm the cockles of your heart.\nIgnacio Lopez, whose mixed Welsh and Spanish heritage brings a unique spin on the world.\nKenyan comedian Njambi McGrath, who is setting the world to rights one joke at a time.\nAnd finally Romanian comedian Radu Isac, who is not happy with the world but will bring a smile to your face.\nPresenters – Nikki Bedi and Tumi Morake\nProducers - Oliver Jones and Lucy Collingwood\nA BBC World Service Production.\nRD\nBBC World Service New Year Concert\nMonday 1 January, 10-11am\nFrom the Royal Opera House in London, Georgia Mann presents the annual New Year’s Day concert showcasing members of the BBC’s New Generation Artists scheme. Founded in 1999 the scheme supports some of the world’s finest young instrumentalists, singers and ensembles at the start of their international careers through performance and broadcast opportunities.\nThe starry line-up features Macedonian-Canadian mezzo soprano Ema Nikolovska, one of the most exciting and versatile young singers on stage today; she’s accompanied by Indian-American pianist Kunal Lahiry, the NGA scheme’s first ever collaborative pianist. British jazz pianist and composer Fergus McCreadie is acclaimed for his unique fusions of contemporary jazz and Scottish folk music. And we hear from cellist Santiago Cañón Valencia, the first ever Colombian New Generation Artist, praised for his flawless technique and unique brand of music-making.\nPresenter - Georgia Mann\nProducer - Juan Carlos Jaramillo\nA BBC World Service Production.\nES",
  "word_count": 20926,
  "scraped_at": "2026-02-14T12:05:43.149284"
}