{
  "article_id": "0c138f399cc6",
  "url": "http://www.rnanews.com/rwanda-to-host-eapcco-games-next-week/",
  "title": "Rwanda to host EAPCCO Games next week",
  "date": "20230318T163000Z",
  "domain": "rnanews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Rwanda will next week host the 4th edition of the Eastern Africa Police Chiefs Cooperation Organization (EAPCCO) Games.\nThe week-long interforce tournament, which kicks-off on Tuesday, March 21, will attract participants in 13 sports disciplines, from 8 EAPCCO member countries.\nThe 4th edition will be held under the theme: “Fostering Police cooperation in fighting transnational organized crimes through sports.”\nThe 13 sports disciplines include football, handball, netball, volleyball, beach volleyball, basketball, athletics, darts, Karate, Taekwondo, Judo, boxing and shooting.\nParticipating countries are Burundi, Uganda, Tanzania, Kenya, Sudan, South Sudan, Ethiopia and the host, Rwanda.\nThe Games will be played at 20 different grounds in Kigali and Bugesera District with the opening and closing ceremonies to be held at Kigali Pele Stadium and BK Arena, respectively.\nThe games will be live streamed on the RNP YouTube channel.\nOver 1250 players constituting 83 teams will represent their Police institutions and countries, with 55 men and 28 women teams.\nRwanda National Police (RNP) will compete in all the 13 sports disciplines.\nDuring a press conference on the upcoming EAPCCO Games, held on Friday, March 17, at the RNP General Headquarters at Kacyiru, CP John Bosco Kabera said: “All the EAPCCO Games will be free entry. These are the RNP teams but they are also representing the country. We call upon Rwandans to come and support their teams.”\nCP Bruce Munyambo, the Commissioner for Community Policing at RNP, said: “Rwanda is ready to host EAPCCO Games and the media fraternity is encouraged to be partners, enhance public awareness to ensure a successful competition.”\nThe EAPCCO Games strength Police cooperation in fighting transnational organized crime, promote talents of Police officers and enhance community policing among Police organizations by sharing the best practices and experiences.\nThe maiden EAPCCO Games were held in 2017 in Uganda, Tanzania hosted the second edition in 2018 and the third edition was held in Kenya in 2019.\nThe fourth edition was supposed to be held in Rwanda in 2020 but it was suspended following the outbreak of the COVID-19 pandemic.\nDuring the third edition, Rwanda came second after Kenya in general rankings, with 46 medals; 27 gold medals, six silver and 13 bronze.\nThe EAPCCO is a regional police body with a membership of 14 countries.\nEstablished in 1998, it aims at harmonizing, strengthening police co-operation and joint strategies, sharing of crime related information and harmonization of laws in order to enhance the capacity of law enforcement agencies to combat transnational organized crime.",
  "word_count": 412,
  "scraped_at": "2026-02-14T13:45:12.567411"
}