{
  "article_id": "0c274b5af886",
  "url": "https://english.pravda.ru/society/165773-lindsey-vonn-olympics-italy-crash-career-ending-fall/",
  "title": "Lindsey Vonn Olympic Comeback Ends in Horror After Devastating Crash",
  "date": "20260209T133000Z",
  "domain": "english.pravda.ru",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Olympic Games in Italy had barely settled into rhythm when the competition delivered what may stand as its most haunting image. Lindsey Vonn, one of the most recognizable figures in alpine skiing history, suffered a violent crash during the women's downhill and was evacuated from the course by helicopter, bringing her Olympic return to an abrupt and painful halt.\nPhoto: commons.wikimedia.org by U.S. Ski Team, https://creativecommons.org/licenses/by/2.0/\nLindsey Vonn wins World Cup Downhill globe 2010\nAt 41, the American star arrived at the Games carrying both enormous expectations and serious physical limitations. Only weeks earlier, she had torn the anterior cruciate ligament in her knee, an injury that normally ends seasons and often careers. Vonn, however, chose to defy convention once more, determined to write her final chapter on the Olympic stage.\nVonn's appearance at the Games already bordered on the improbable. On January 30, during a World Cup race in Switzerland, she lost balance at extreme speed and crashed into a safety barrier. Though she finished the run, medical staff transported her from the finish area by helicopter.\nDoctors soon confirmed the extent of the damage.\n\"I tore my ACL. There is also a bone bruise, which is typical for this type of injury, and damage to the meniscus. I can't say for sure whether that was there before or caused by the fall,”\nLindsey Vonn\nSuch trauma usually requires surgery and months of rehabilitation. Instead, Vonn resumed training almost immediately. She announced that she would compete wearing a stabilizing knee brace and reminded critics that she had raced through serious injuries many times before, often with medals as the result.\nOn February 8, after completing several controlled training runs, Vonn entered the downhill start gate wearing bib number 13. Thousands of spectators watched as she launched into what many hoped would be a triumphant farewell.\nLess than 15 seconds later, the dream collapsed. Vonn lost control on the course, crashed heavily, and remained on the snow unable to stand. Medical teams reached her quickly, and a helicopter carried her away from the slope as the stadium fell silent.\nThe incident sparked intense debate within the sports world. While some praised her resolve, others questioned the wisdom of competing under such circumstances.\n\"I can't shake the thought that at some point Lindsey's unquestionable sporting greatness simply went to her head. For the sake of that greatness, and necessarily in front of the whole world, she was ready for absolutely anything. Even for the scenario we saw today,\" Elena Vaytsekhovskaya, a former Russian diver, an Olympic champion, wrote.\nThe crash may mark the final competitive moment of Vonn's career. She previously retired in February 2019, explaining that constant pain from accumulated injuries had become unbearable.\nHer résumé spans nearly two decades at the highest level. Vonn debuted on the World Cup circuit in 2000, just weeks before her 16th birthday. Over the years, she endured repeated ligament tears, fractures to arms and legs, concussions, and countless lesser injuries that never made headlines.\nIn April 2024, she underwent a full replacement of her right knee, a procedure aimed at improving everyday life rather than enabling another comeback. Yet the absence of constant pain changed her outlook. In November 2024, at 40, she announced a return to elite competition.\nThe gamble initially paid off. In 2025, Vonn returned to the World Cup podium. She claimed a dominant victory in St. Moritz in December, her first in nearly eight years, and followed it with a downhill win in Zauchensee on January 10. Those results made her a genuine gold medal contender for Cortina d'Ampezzo before the Swiss crash derailed everything.\nCalling Vonn a legend hardly overstates her impact. She captured one Olympic gold medal in 2010 and two world championship titles in 2009, but her World Cup dominance defined an era. She won 84 races, claimed the overall title four times, and collected multiple discipline crowns across downhill, super-G, and combined events.\nAlthough Mikaela Shiffrin has since surpassed many of her records, Vonn's global recognition remains unmatched, driven in part by her life beyond competition.\nShe signed a major endorsement deal with Under Armour at 16 and continues to work with the brand today. Her commercial partnerships have included Red Bull, Oakley, Vail Resorts, GoPro, and Head. Beyond sponsorships, she runs her own apparel line, writes books, invests in businesses, and holds stakes in women's football clubs Utah Royals and Angel City.\nIn 2025, Forbes named Vonn among the 20 highest-paid athletes in the world.\nHer personal life has unfolded just as publicly. Born Lindsey Kildow, she adopted the surname Vonn after marrying former skier Thomas Vonn in 2007. The marriage ended in divorce six years later, though she kept the name.\nShe later dated golf icon Tiger Woods, a relationship that ended amid controversy after private photos were leaked online in 2017. Vonn also became engaged to NHL star P.K. Subban, but the couple never married.\nSince 2021, she has been in a relationship with tequila entrepreneur Diego Osorio. They remain together, with no immediate plans to wed.\nSubscribe to Pravda.Ru Telegram channel, Facebook, RSS!\nPopular\nLast materials",
  "word_count": 856,
  "scraped_at": "2026-02-14T12:38:07.791626"
}