{
  "article_id": "0c32e2c08248",
  "url": "https://www.southpeacenews.com/today-in-high-prairie-september-13-2023/",
  "title": "Today in High Prairie : September 13 , 2023 - ",
  "date": "20230912T220000Z",
  "domain": "southpeacenews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Today in High Prairie! See what’s happening today in town, celebrity birthdays, local history, world history and your daily horoscope. Please send your birthdays and community events to southpeacenews@hotmail.com and/or spneditor@outlook.com.\nWhat’s Happening Today – September 13, 2023\n10 a.m. – Big Lakes County meeting in chambers.\n10:30 – 11:30 a.m. – Story Time at HP Municipal Library.\n1 p.m. – Play Mah Jong at Joussard Homesteaders Centre.\n7 p.m. – Village of Girouxville meeting in council chambers.\n7 p.m. – Town of Falher meeting in council chambers.\n7 p.m. – AA meeting at Grouard in Brown Building behind Kapawe’no Hall.\n7:30 p.m. – Play cards at Joussard Homesteaders Centre.\nToday’s Celebrity Birthdays – September 13, 2023\n1475 – Cesare Borgia, Italian Aristocrat\n1660 – Daniel Defoe, Robinson Crusoe Author\n1775 – Laura Secord, Canadian War Heroine\n1831 – Andrew Noble, Science of Ballistics Founder\n1851 – Walter Reed, Yellow Fever Discoverer\n1857 – Milton S. Hershey, Hershey Chocolate Tycoon\n1860 – John Pershing, American WWI General\n1903 – Claudette Colbert, It Happened One Night Actress\n1912 – Reta Shaw, Mary Poppins Actress\n1924 – Maurice Jarre, Doctor Zhivago Composer\n1925 – Mel Torme, American Singer\n1926 – Emile “The Cat” Francis, New York Rangers Coach\n1941 – David Clayton-Thomas, Joy to the World Singer\n1944 – Peter Cetera, Chicago Lead Singer\n1952 – Randy Jones, Village People Musician\n1955 – Joni Sledge, We Are Family Singer\n1957 – Vinny Appice, Black Sabbath Drummer\n1975 – Rascal Flatts, County Singer\n1976 – Jose Theodore, Montreal Canadiens\nThis Day in Local History – September 13, 2023\nSept. 13, 1913: The Grouard News reports 500 tons of freight destined for Groaurd is tied up between Mirror Landing and Athabasca Landing.\nSept. 13, 1913: The Northern Transportation Company issues a public challenge to race its Northern Sun against the Hudson Bay Company’s steamer Slave River from Shaw’s Point to the mouth of the Slave River. General manager C.D.A. Barber sends a cheque for $1,000 to the Grouard News in the winner-take-all event. Judges will accompany each ship to ensure they do not exceed the registered steam pressure.\nSept. 13, 1915: Father Edward Petour O.M.I., is named as the first missionary for the High Prairie district by Bishop Grouard.\nSept. 13, 1915: District Fisheries inspector, Sid Travers, predicts the fishing industry on Lesser Slave Lake could reach $60,000 in the next year. Three companies are operating in the area: the Northwest Fishing Company, Alberta Fisheries Ltd. and the Slave Lake Fish Company.\nSept. 13, 1969: The Royal Canadian Legion opens its new hall in High Prairie. Comrade Bill Gordon cuts the ribbon, assisted by Madam Joy Manuel.\nSept. 13, 1969: Stan Daniels, president of the Metis Association of Alberta, tells the Alberta Weekly Newspapers’ Association that “you have made us nothing but jailbirds and drunks, you have turned our women into sluts.” He adds there is no “Metis problem” or “Indian problem” but a “people’s problem.”\nSept. 13, 1970: High Prairie’s Rogar Kosar reports to the training camp of the Philadelphia Flyers in Quebec City.\nSept. 13, 1971: A class for the mentally retarded is opened in the Anglican Church Hall in High Prairie. Mrs. R. Cox is classroom teacher and instructor. Its future is cloudy, however, because the Alberta Department of Education refuses to recognize it.\nSept. 13, 1972: Mary Stewart tells South Peace News she is interested in forming a kennel club in High Prairie, where people get together and talk about dogs and how to train and care for them.\nSept. 13, 1978: South Peace News reports Robert Snow purchases R&S Electronics in High Prairie and renames it Snowflake Electronics.\nSept. 13, 1982: Carol Beamish opens It’s a Small World Day Care in High Prairie.\nSept. 13, 1985: MLA Larry Shaben says the Alberta government promises High Prairie will have a new courthouse and Provincial Building by 1988.\nSept. 13, 1985: NPHL president Jack McAvoy steps down and High Prairie’s Wayne Forrester is elected to replace him. Forrester is elected over former Regal Tom Iannone.\nSept. 13, 1985: An NPHL entry bid from Slave Lake is approved by the NPHL, providing that they meet all the requirements of the league constitution.\nSept. 13, 1989: South Peace News reports that the High Prairie Figure Skating Club hires Mark Carpenter, Barb Zabolotniuk and Jodie Severson as coaches for the coming season.\nSept. 13, 1989: South Peace News reports that the High Prairie Pigeon Racing Club is formed.\nSept. 13, 1992: Ernie Masson is elected president of the High Prairie Regals.\nSept. 13, 1993: A Kinuso man is jailed two years less a day for having repeated sex with two girls, one aged 13, the other 15.\nSept. 13, 1993: CH2M Hill Engineering arrives in Faust to begin the cleanup of the old Osmose site.\nSept. 13, 1994: The Driftpile Swingers win the men’s fastball league title by defeating Gift Lake 4-0 on pitcher J.R. Giroux’s three-hitter.\nSept. 13, 2006: Peavine Metis Settlement announces it has purchased Arrow Energy.\nSept. 13, 2006: High Prairie town council does not deal with a concern from Loonie Plus owner Karen Peyre, who writes council demanding higher business fees for peddlers. Town manager Larry Baran says he is researching the matter. Currently, peddlers pay a $50 fee; Peyre asks it be at least $500. The next night the High Prairie Chamber of Commerce supports Peyre’s request.\nSept. 13, 2006: The M.D. of Big Lakes agrees to rezone property west of Joussard to accommodate Red Sky Grove’s plans to develop recreation lots.\nSept. 13-14, 2008: Hundreds attend various events at the High Prairie Settlement Celebration. A highlight of the weekend was the 1950s and 1960s dance at the High Prairie Municipal Library.\nSept. 13, 2009: Town of High Prairie treasurer Hermann Minderlein announces his resignation effective Oct. 9.\nSept. 13, 2010: Peavine Metis Settlement chair Raymond Carifelle hands over the hospital land transfer during Premier Ed Stelmach’s visit to High Prairie. Stelmach also comes to town and attends an oil industry workshop.\nSept. 13, 2011: Cleo Carifelle arrives from Slave Lake to present the Town of High Prairie with a goodwill banner for its efforts during the Slave Lake spring wildfire.\nSept. 13, 2011: Pitcher Burton Auger tosses a no-hitter to lead the Gift Lake Sluggers to a 3-1 win and the championship in the High Prairie Men’s Fastball League.\nSept. 13, 2014: The High Prairie Renegades football team loses its first-ever game 36-8 at Grande Prairie to the St. Joseph’s Celtics.\nSept. 13, 2016: High Prairie town council discusses the future of the religious tax exemptions on municipal property.\nSept. 13, 2017: South Peace News features a past history of High Prairie and area and the involvement of women in politics.\nSept. 13, 2017: South Peace News reports every incumbent councillor in Big Lakes County plans to seek re-election.\nSept. 13, 2017: A water line and truck fill to serve the Prairie Echo area is proposed at a Big Lakes County meeting. The project is estimated at $6 million.\nThis Day in World History – September 13, 2023\n122 – Building begins on Hadrian’s Wall, Northern England.\n1503 – Michelangelo begins work on his statue of David.\n1759 – British beat French forces at Plains of Abrahams [Quebec].\n1850 – The main-belt asteroid “12 Victoria” is discovered.\n1881 – America Lewis Howard Latimer invents and patents electric lamp.\n1899 – First ascent of 17,058-foot Mount Kenya.\n1906 – First airplane flight occurs in Europe.\n1922 – World record 136.4F in El Aziziyah, Libya [in shade].\n1931 – Capt. G.H. Stainworth flies world speed record 655 kph.\n1949 – Ladies Pro Golf Association of America formed in New York.\n1955 – Swiss inventor George de Mestral granted a patent for Velcro.\n1956 – IBM introduces the RAMAC 305 computer: weighs over a ton.\n1959 – USSR’s Luna 2 becomes first probe to contact another celestial body.\n1961 – Unmanned Mercury-Atlas 4 launched into Earth orbit.\n1964 – St. Louis is first NL baseball team to score runs in every game since 1923.\n1965 – Beatles release “Yesterday”.\n1965 – Beatles win first Grammy, for Best Group of 1964.\n1969 – “Scooby-Doo Where are You” debuts on CBS-TV.\n1970 – IBM announces System 370 computer.\n1971 – Nikita Khrushchev, Soviet premier, buried in Moscow.\n1971 – World Hockey Association forms.\n1974 – First broadcast of “The Rockford Files” on NBC-TV.\n1977 – First TV viewer discretion warning for show Soap.\n1977 – GM introduces first US diesel auto [Oldsmobile 88].\n1981 – April Moon sets women’s handbow distance record of 1,039 yds.\n1983 – US mint strikes first gold coin in 50 years [Olympic Eagle].\n1985 – Super Mario Bros. video game first appears.\n1987 – Cesium-137 stolen from abandoned hospital in Rio de Janeiro.\n1987 – Paul Lynch of Great Britain does 32,573 push-ups in 24 hours.\n1990 – “Law and Order” first premieres on NBC-TV.\n1991 – 55-ton concrete beam falls in Montreal’s Olympic Stadium.\n1997 – Elton John releases “Candle in the Wind 1997”, a tribute to Diana.\n1997 – Mother Teresa’s State Funeral held in India.\n2012 – 33,000 people evacuated after Guatemala’s Volcano of Fire erupts.\n2018 – Report: Islamic extremism by 121 groups cause 84,000 deaths in 2017.\n2018 – Spanish parliament votes to exhume former dictator Francisco Franco.\nToday’s Horoscopes – September 13, 2023\nAries [March 21 – April 20] – Group activities could escalate almost to a frenzy. New short-term goals could necessitate a lot of work. You might get caught in a rush of phone calls and errands. This should prove very positive for the group’s goals in the long term, but for now it could drive everyone crazy. Try to stay focused and just do what you have to do.\nTaurus [April 21 – May 21] – You could receive a phone call from a friend or relative you have not seen in a long time. This person might announce a pending visit, and very soon! You and your household might go crazy trying to make the place presentable. You will probably enjoy the visit, but the announcement will cause some temporary chaos.\nGemini [May 22 – June 21] – News about changes in your neighbourhood could throw your community for a loop. This may involve new businesses, laws, or ordinances that do not sit well with everyone. You can expect a lot of phone calls, impromptu meetings, and other community contact that could turn into heated quarrels. Be prepared, and stay focused.\nCancer [June 22 – July 22] – Technology could set a personal or job-related project back for you today. Computers, telephones, or other important equipment could malfunction and necessitate calling in a repairperson. Too many people could vie for your attention and make demands on you, causing you to feel distracted. The temptation to lose your temper and walk out could be strong. Do not do it!\nLeo [July 23 – Aug. 23] – Large social gatherings, perhaps group events or festivals, could put you in the middle of an agitated crowd. At first it could seem exhilarating, but after a while you could feel stifled. Still, you will not want to miss anything, so you will be in a quandary. It is OK to leave for a while and come back. The crowd should dissipate somewhat by the time you return.\nVirgo [Aug. 24 – Sept. 22] – Too many demands upon you could have you feeling a bit on edge today. If possible, this is a good day to get away by yourself for a while, as you might feel a strong need to get your head together. It is a great day to go for a workout or get out in the open if weather permits. Take a book with you and gather your thoughts.\nLibra [Sept. 23 – Oct. 23] – A speech or lecture you hear or read could cause your way of thinking to be suddenly and drastically altered. Some radical information could overturn concepts you have embraced for years, and this might shock you. Consider it objectively and you will realize it is not all that drastic a change. In the larger scope of things, all ideas stem from the same source.\nScorpio [Oct. 24 – Nov. 22] – Some rather shocking information could affect your current living situation and cause some upset in your household today. This might cause a lot of worry, although the situation probably is not as dire as it seems. Calm everyone down and view the situation objectively. It is better to find solutions than to become angry.\nSagittarius [Nov. 23 – Dec. 21] – A phone call from another state or country could bring some astounding information your way today, awakening you to events and ideas you have never considered before. You might be in a daze for a while. You may want to run this by friends to see what they think. Some interesting discussions could result. By day’s end, you will not be thinking the same way!\nCapricorn [Dec. 22 – Jan. 20] – If you are trying to get your finances together, today might not be the best day for it. Put it aside for now. Indulge in the lighter side of life. Get family or close friends together and head outside. You can enjoy a day at the park or zoo. Share some laughs and grow closer. Those more serious matters will still be waiting for you tomorrow.\nAquarius [Jan. 21 – Feb. 18] – A surprising phone call might come today from a close friend or business or romantic partner. This person might have encountered an unexpected upset and need to concentrate on getting it together again. An offer to help might meet with scant enthusiasm, as this person may prefer to take care of things alone. The trick is to be supportive and not take on the troubles as your own.\nPisces [Feb. 19 – March 20] – An unexpected development could throw you into a tailspin. This could involve a new person in your life or the reappearance of someone from the past. This presence could incite either personal or professional changes. These could seem like a lot to handle, but could be positive over the long term. Stay calm, deal with issues one at a time, and keep your sense of humour.",
  "word_count": 2396,
  "scraped_at": "2026-02-14T13:09:34.811573"
}