{
  "article_id": "0c4c5118d5bf",
  "url": "https://www.thenorthernecho.co.uk/news/24230946.fa-cup-finals-wimbledon-among-tickets-gifted-mps/",
  "title": "FA Cup Finals and Wimbledon among tickets gifted to MPs",
  "date": "20240406T053000Z",
  "domain": "thenorthernecho.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "North East MPs claimed more than £11,500 in gifted sports tickets in the last year, The Northern Echo can reveal.\nAccording to data from the Register of MP Interests, MPs in the North East were gifted £11,633.55 in tickets to sports events including men’s and women’s FA Cup finals, Wimbledon, WWE, and Newcastle’s sell-out game against PSG in the Champions League. The data covers the period from the start of 2023 to the end of February this year.\nLevelling Up Secretary Michael Gove apologised last week after breaking Parliamentary rules by not registering freebies from football club Queens Park Rangers.\nBut unlike Mr Gove, all the donations to North East MPs were registered in the proper way with the Parliamentary Register of Interests and there is no suggestion of foul play.\nOutgoing Bishop Auckland MP, Dehenna Davison, received the highest combined value of free tickets. Her hospitality tickets to the FA Cup Final and WWE event ‘Money in the Bank’ totalled £3,015.\nMs Davison’s FA Cup tickets were donated by the English Football League.\nThe Northern Echo understands the EFL has an engagement strategy which involves hosting MPs at matches.\nMeanwhile, Conservative Party Chairman and MP for North West Durham, Richard Holden received over £2,500 in tickets to two Premier League matches and hospitality at England’s One Day International cricket match against New Zealand.\nMr Holden was gifted hospitality tickets to Chelsea v Aston Villa on September 24, 2023 by the Premier League.\nThe Echo understands this was as part of the Premier League’s stakeholder engagement programme.\nLabour MPs round out the rest of the top five receivers of sports freebies, with Shadow Education Secretary Bridget Phillipson, MP for Houghton and Sunderland South, gifted tickets worth £2,215 to the Wimbledon Royal Box and the Ashes at the Oval.\nJarrow MP, Kate Osborne was gifted tickets to three separate football games, the Women’s FA Cup Final and the Women’s Nations League match between England and Scotland from the Football Association, and hospitality at Crystal Palace, gifted by the London club. These tickets were worth a combined £1,184.\n“We host key stakeholders at all of our events at Wembley Stadium and across the country,” an FA spokesperson told the Northern Echo.\n“Whilst a small number of tickets go to political guests through this stakeholder engagement, we also have a wider community and charity programme which last season provided over 50,000 complimentary tickets to our community and charity partners.\"\nNext on the list is Newcastle Central MP Chi Onwurah, who received a corporate ticket to Newcastle v Manchester United worth £780 from a private donor.\nCatherine McKinnell, MP for Newcastle North, received tickets to Newcastle Racecourse worth £600, while Teesside MPs Sir Simon Clarke and Matt Vickers also received tickets to football matches.\nSir Simon, Conservative MP for Middlesbrough South and East Cleveland, received two sets of tickets to Middlesbrough FC matches worth a combined £500 and Mr Vickers, Stockton South's Tory MP, was gifted tickets to England v Ukraine worth £499.\nRetiring Gateshead MP Ian Mearns was given a corporate ticket to Newcastle’s 4-1 demolition of football giants PSG by Newcastle Airport. It was worth £330.\nNone of the other MPs in the North East received tickets to any sporting events.\nProfessor Simon Chadwick, an expert on the politics of sport economy, told the Echo that MPs are more likely to choose to meet in hospitality suites because of the privacy they offer.\n“Hospitality areas of sports venues are ungoverned spaces that enable stakeholders to quickly and freely gain access to politicians and other important people,” Professor Chadwick said.\n“If one requests a meeting with an MP, it can sometimes take months if not years to gain access to them.\n“But invite them to a game and they will often say yes without hesitation. Once inside hospitality areas, there are no prying eyes which means that those who invited them can engage politicians without scrutiny from the likes of journalists.”\nMost read:\n- 'Picturesque' County Durham village named among poshest places to live in the UK\n- Former village pub to be converted into shop despite petition and traffic concerns\n- There is 'no hope' for Hitachi site claims former worker as uncertainty grows\nThe Northern Echo has contacted all MPs in the region who have registered gifts of sporting tickets in the last year but none responded to our requests for comment.\nA Labour Party spokesperson told the Echo: “All donations received by Labour members of parliament are registered in the proper way.”\nThe Conservative Party did not respond.",
  "word_count": 758,
  "scraped_at": "2026-02-14T12:57:38.971009"
}