{
  "article_id": "0c56cbd8d6e4",
  "url": "https://wtug.com/ixp/532/p/west-alabama-wednesday-briefing-94/",
  "title": "West Alabama Wednesday Briefing",
  "date": "20250402T194500Z",
  "domain": "wtug.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "West Alabama Wednesday Briefing\nGood morning West Alabama!! It is Wednesday, April 2, 2025. This is the 92nd day of the year with 273 days remaining.\nWednesday Morning Observations:\nThis is President Trump's \"Liberation Day\". This is the day he announces his \"reciprocal tariff's\" to punish other nations that have placed tariffs on U.S. goods. It has markets around the world shaky, fearful of a worldwide trade war that could, at minimum result in resurgent inflation and at worst topple economies and lead to a full-blown economic crisis.\nTrump claims it will trigger a, \"renaissance in U.S. manufacturing\", a new \"Golden Age for the U.S.\". Economist in the U.S. and around the world fear that view is wildly overly optimistic.\nTariff's historically have not been good for anybody, the country initiating the tariffs generally are countered by higher tariffs from the other nation(s). For example, The Smoot-Hawley Tariff Act of 1930 is blamed for deepening the Great Depression, leading to even high prices, more unemployment and worldwide economic decline.\nA tariff is the same as a tax being applied to goods being imported. It drives the cost up and reduces demand for the foreign product. Tariffs protect a country's domestic industries from foreign competition and raises revenue to fund their governments.\nIn principle Trump's reasoning sounds fair, if the other countries are placing tariffs on U.S. goods why not match that with a reciprocal tariff? \"They took advantage of us,\" Trump told reporters Monday.\nBut his aggressive rhetoric, and in some cases, name calling, have damaged U.S. relations with some of our strongest allies, especially Canada. He has treated those allies like enemies, and his threats are damaging our relationships with countries around the world. Even worse, all this comes at a time when international partnerships are critical due to threats from China, Russia, Iran, North Korea and a few other countries.\nThe Rose Garden announcement today should reveal how much the tariffs will be and how many countries and products will be affected. Trump has lowered his rhetoric a bit recently but still claims the higher costs from tariffs are worth it for the increase in manufacturing jobs that would be created over the long-term. The problem is any positive long-term results could be years away. What happens to the U.S. and worldwide economies in the short-term could be the disaster waiting to happen.\n(Opinions expressed in Morning Observations are those of the author and are not necessarily those of the ownership, management, staff or sponsors of Townsquare Media Tuscaloosa).\nWeather:\nThere will be a lot going on in weather activity this week into next. A Wind Advisory will be in effect between 1:00pm today until 1:00am tomorrow. 15 to 20mph sustained winds could gust to 40mph during the advisory period.\nUnseasonably high, even record high, temperatures will continue into the weekend but that will come to a screeching halt with a storm system Sunday. There will be a Slight (2 in 5) Risk for strong to severe thunderstorms Sunday afternoon.\nHigh temperatures in the upper 70s to near 80 over the weekend will tumble into the 60s next week. Overnight lows will be in the 40s beginning Sunday night with 30s possible later next week.\nRead More: Wind Advisory Info: Gusty Conditions Across Alabama\nRead More: Early April Severe Threat: Tornadoes, Damaging Winds, and Hail\nRead More: Is it Spring or Summer in Alabama? Temperature Preview Guide\nNews:\nIncumbent Defeated in District 1 Tuscaloosa Council Runoff\nShelton State Administrator Joe Eatmon unseated incumbent District 1 Tuscaloosa City Councilman Matthew Wilson in yesterday’s runoff election. Unofficial vote totals show Eatmon defeating Wilson by 175 votes. Less than a thousand votes were cast. Eatmon tallied 582 votes compared to Wilson's 407.\nWilson is the only incumbent to lose his re-election bid during this year's Tuscaloosa Municipal Elections.\nThe returns will be finalized by the council next week with Inauguration Day set for May 19th at Tuscaloosa City Hall.\nRead More: Joe Eatmon Unseats Matthew Wilson in Runoff for Tuscaloosa Council Seat\nTuscaloosa City School Board Approves Incentives for Interns\nThe Tuscaloosa City School Board has approved $48,000 for 10 paid interns with the agreement they become teachers in the city system after graduation.\nDeron Cameron, the Assistant Superintendent of Operations, told news partner ABC3340 there is a shortage of teachers, and the board hopes this will incentivize interns to remain with the city system after they graduate. He noted the program has previously helped the district retain six to eight teachers after their internship was completed.\n15-year-old Arrest for Shooting at TPD Officers in Alberta\nTwo TPD officers on patrol in the 600 block of 23rd Avenue East in Alberta Monday were allegedly shot at by a 15-year-old. During the incident a nearby, occupied residence was also struck by a bullet.\nTuscaloosa Violent Crimes Unit Commander Captain Jack Kennedy reported that the suspect fired at least 8 rounds in rapid succession at the officers\nThe suspect was arrested and has been charged with attempted murder and firing into an occupied residence.\nRead More: 15-Year-Old Charged With Shooting at Tuscaloosa Police Officers in Alberta Monday Night\nTPD Officers See a Gun Fired at a Local Apartment Complex\nA TPD officer witnessed a gun being fired at Rosedale Courts on Tuscaloosa's southside Monday night but was not involved in the incident.\nInaccurate and sensationalized posts on social media claimed the officers had shot someone at Tuscaloosa Housing Authority Complex.\nThe officer witnessed a 62-year-old man fire a gun into the air during an argument. The suspect was taken into custody and charged him with discharging a firearm in city limits, open beverage, third-degree reckless endangerment and third-degree domestic violence/harassment.\nThe woman was not injured.\nRead More: TPD Officer Witnesses Gunshot During Couple’s Fight, No One Injured\nGov. Ivey Releases Funds for Dometic Violence and Sexual Abuse\nGovernor Ivey is providing new funding to help victims of domestic violence, sexual assault, and other kinds of abuse. Some of the $160,000 will provide shelter and services for victims, while other funds will be used for training. Walker is the only West Alabama county involved in this funds release.\nCentreville Drops Facebook Live Broadcasts of Council Meetings\nMany local governing bodies across Alabama began broadcasting their meetings live during the COVID19 pandemic, the Centreville City Council was one of them. However, the council has announced on Facebook that they are dropping those broadcasts.\n\"In a group decision, the Centreville City Council meetings will no longer be aired on FB Live. For people to comment they need to come to the meetings.\" the post stated.\nThe council meetings will be recorded and posted to the city's new website.\nIvey Provides Funds to Help Victims of Dometic Abuse and Sexual Violence\nGovernor Ivey is providing new funding to help victims of domestic violence, sexual assault, and other kinds of abuse. Some of the $160,000 will provide shelter and services for victims, while other funds will be used for training. Walker is the only West Alabama county involved in this funds release.\nClick TuscaloosaThread.com for the latest West Alabama news, sports and weather throughout the day. Better yet, download the app.\nSports:\nBama Baseball Holds Off Samford 11-9\nThe 8th ranked Alabama Baseball Team continues to win its midweek games to build on its resume for post-season selection. Last night the Tide outlasted a very good Samford team 11-9 at the Joe.\nAlabama improves to 26-4 on the season and heads to No.16 Auburn for three games this coming weekend.\nRead More: No. 8 Alabama Holds on to Beat Samford 11-9\nRead More: Alabama Infielder Comes up Clutch Against Former Ball Club\nShelton State Women Come Tantalizingly Close to national Championship\nThe Shelton State Community College Women's Basketball Team came so close to bring home a national championship. The Buccaneers fell 62-53 to NW Florida State in the NJCAA National Championship game in Casper, Wyoming.\nShelton State (31-5) finished as the national runner up, the highest finish in program history.\nCongrats to Head Coach Madonna Thompson and team. Shelton State has been to 19 national tournament appearances, including five Final Four trips and now one championship game.\nRead More: Shelton State Falls Just Short of NJCAA Division I National Title\nTuscaloosa County High Hires New Head Football Coach\nChris Bell will reportedly be the new head football coach at Tuscaloosa County High School. Bell resigned the head coaching position at Robertsdale High School in Baldwin County on Monday.\nThe Wildcats struggled to a 1-9 record over all last season, 0-7 in Class 7-A Region 3.\nRead More: REPORT: Tuscaloosa County Hires New Head Football Coach\nClick Tide100.9 for the latest sports news.\nHave a wonderful Wednesday!",
  "word_count": 1448,
  "scraped_at": "2026-02-14T13:42:30.481967"
}