{
  "article_id": "0c56898593d5",
  "url": "https://liverpooloffside.sbnation.com/liverpool-fc-women-news-results/2025/1/17/24346242/liverpool-fc-women-beard-report-i-think-we-deserved-the-three-points-tonight-brighton-women-sam-kerr",
  "title": "Beard Report :  I Think We Deserved The Three Points Tonight  ",
  "date": "20250117T234500Z",
  "domain": "liverpooloffside.sbnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Women’s Super League returned to action on Friday with Liverpool Women hosting Brighton and Hove Albion Women at the St. Helen’s Stadium, ending their four match losing streaking with a 2-1 finish thanks to goals from Olivia Smith and an own goal forced by Grace Fisk.\nBeard Report: “I Think We Deserved The Three Points Tonight”\nThe manager gave his assessment of the away win against Brighton on Friday evening, including a debut for our own Sam Kerr (the other one).\n“Yeah, it was important. We’ve had, as I’ve said before, a tough first half of the season. I think we deserved [to win] the game on merit tonight,” manager Matt Beard said following the match.\n“A little bit of before in that we’ve had some really good chances where we could have finished the game off and we didn’t. Then we concede a frustrating goal. But I’m really proud of the girls.\n“I said to them before the game, as much as it has been a rough first 10 games, they have never downed tools at all. They have always worked hard. They have always come in and wanted to improve. As much as the position that we’re in isn’t a good position, I’ve been proud of what we’ve put in. And I think we saw a little bit of the old, last-season Liverpool tonight. If you look at the changes we made from the bench, it helped us in the game massively. So, really, really proud of the performance.”\nWhile the winning goal came from defender Grace Fisk forcing Brighton’s Jocelyn Carabali into the deflection with 8 minutes left, it was a hard fought match for both teams. The kind with just the right amount of “needle”, observed Beard.\n“You need it. At the end of the day, if you’re not going to be committed and put your bodies on the line then you’re not going to win football matches,” explained the manager.\n“If you look at the best teams in the world, it’s that work-rate, it’s that desire, it’s the will to get on the end of a cross or to block a shot. That’s what wins football matches. We haven’t not had that, we’ve just been unlucky with injuries and having to make loads of changes. Tonight was consistent.\n“I thought Sam Kerr had a fantastic debut, Smithy terrified them, probably [Poppy] Pattinson is lucky to be on the pitch, in my opinion, from watching it from up there [in the stands due to a touchline suspension]. Really, really pleased. We needed a league win here [at St Helens] as well. It sends the fans home happy tonight and we can enjoy a weekend off.”\nThe Women play again next Sunday, when they travel down to Leicester to face the Foxes at the King Power Stadium.",
  "word_count": 471,
  "scraped_at": "2026-02-14T12:43:17.280565"
}