{
  "article_id": "0c5dc59f0776",
  "url": "https://www.cardchronicle.com/2023/8/28/23846070/monday-afternoon-cardinal-news-and-notes-louisville-cardinals",
  "title": "Monday afternoon Cardinal news and notes",
  "date": "20230828T214500Z",
  "domain": "cardchronicle.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "—SPREAD CHECK: Louisville by 8.\nMonday afternoon Cardinal news and notes\nWe’re coming, Atlanta.\n—The fourth-ranked Louisville volleyball team got 2023 started with a Cardinal Classic sweep that included wins over Troy, No. 21 Washington State and Wright State. The Cards dropped just one set in the three matches.\n—The ninth-ranked Louisville field hockey team began its season in ideal fashion, knocking off Northeastern on Saturday morning and then turning around and upsetting No. 2 Northwestern one day later.\n—The CJ’s Alexis Cubit takes a look at the biggest storylines heading into Friday night’s tussle in Atlanta.\nThree Georgia Tech players to watch\nHaynes King, R-So., QB: The Texas A&M transfer earned the Yellow Jackets’ starting quarterback job over Zach Pyron, who started in two of three games played for Georgia Tech last season. King completed 104 of his 187 passes (56%) for 1,220 yard, seven touchdowns and six interceptions in six games last season for the Aggies.\nLaMiles Brooks, Jr., DB: The Bednarik Award watch list selection returns after leading the Yellow Jackets in interceptions with three (one for a touchdown), in addition to seven pass breakups and 52 tackles while starting in 10 of 12 games played. Pro Football Focus graded him as the fifth-best returning safety in the country.\nDontae Smith, R-Sr., RB: With Hassan Hall gone, Smith is Georgia Tech’s leading returning rusher after totaling 420 yards and a team-best five touchdowns on 87 carries over 12 games played.\n—Jack Plummer knows this is his last shot to make some college football memories.\n—The Cardinal Authority staff project the offensive and defensive MVPs for this year’s U of L football season.\n—The U of L men’s soccer team is back in action tonight against Bellarmine. Here’s a preview.\n—Hoping for a healthy, productive year for Mekhi. He deserves it.\n—The Athletic’s college hoops staff has a new early top 25 for the 2023-24 season.\n—The ACC is still moving towards adding Cal, Stanford and SMU. Probably. Potentially. Maybe. It’s possible. Sources say it’s on the table. There’s movement.\n—Jawhar Jordan says it’ll be nice playing in an offense this season where opposing defenses won’t be calling out the plays before Louisville runs them.\nTwo things Jordan is counting on: Without a running quarterback, the running backs figure to get the ball more. And with Brohm’s system, they can count on getting it in a wider variety of ways.\n“Of course we’re going to get the ball more, and it’s not going to be like RPO option-type where the quarterback just scans the ball or carries the ball himself,” Jordan said. “Definitely look forward to getting the ball more. ... It’s just been good learning the playbook and learning different positions. I looked at film from Purdue and saw how they used Rondale Moore. He was lining up in the backfield or out wide. I want to be that type of player for this team.”\nSomething all the backs have appreciated is the opportunity to operate in more space. A year ago, defenses keyed against Louisville’s running game, largely locking in on Cunningham to try to contain him.\nWith a more pro-style approach, defenses have to respect and key on the passing game, which creates running lanes.\n“Going against teams last year, they had 8-man boxes and you could just hear them calling our plays,” Jordan said. “So it’s kind of good that we’re more versatile now.”\n—The Daily Progress has Louisville all the way down at No. 9 in its first ACC football power rankings of the season.\n—The U of L women’s soccer team is still looking for its first win of the season after playing Northern Kentucky to a scoreless draw on Sunday.\n—Arizona State is self-imposing a one-year bowl ban, the school announced yesterday, in connection to violations made under Herm Edwards. Seems like a pretty shitty thing to do to the players that are beginning their season in less than a week now.\n—Carlik Jones has been absolutely lighting it up for the South Sudan team at the FIBA World Cup.\n—We’ve got game notes for Friday night. Those notes do not, however, feature a depth chart, something Jeff Brohm also did during his stint at Purdue.\n—The staff at All Sports Discussion predicts a Louisville football season that ranges anywhere from 9-3 to 5-7.\n—Jeff and Brian Brohm’s group of quarterbacks talk about a system that is more “free” than the one Scott Satterfield employed a year ago.\n“Well, a lot of it is the system and it’s a great system,” Plummer said. “The plan is very quarterback-friendly. I mean every quarterback he’s had back to Western Kentucky has played in the NFL and some are still playing in the NFL. That’s something that’s drawn me. My goals are to play at the next level and I think that this a this place will help me do that. Being at California was good for me, just getting a lot of game experience, starting all 12 games and learning that way, now coming back to a system that I know and like playing in, with familiarity with the coaches. I think it was a good decision.“\nJeff’s younger brother Brian, Louisville’s QB coach and co-offensive coordinator, says they’re glad to have someone who is deeply familiar with the system in their first year at Louisville.\n“It’s showtime for Jack,” Brohm said. “It’s his sixth year. He’s been a starter in multiple programs, done a really good job, both Purdue and at Cal. He’s a veteran guy and I think he’s kind of earned that right. . . . He’s really smart. He understands football, understands coverages defenses, fronts, blitzes — to the point where he can correct us coaches sometimes where he sees something. . . . He’s got good athleticism. He’s got good size, good pocket awareness and he throws a good football. So, he has a lot of the traits that you’re looking for in your quarterback. We’re always working on being consistently accurate. That’s one thing we’re always trying to improve.”\nThe Brohm system: “Quarterback friendly”\nIf you’re looking for how Jeff Brohm differs as a quarterback-friendly coach than, say, Scott Satterfield, who left Louisville for Cincinnati after last season, there’s no one better to ask than Brock Domann. He started 4 games for the Cardinals last season, and is back in the club’s crowded QB room this year.\n“There’s a lot more reading involved,” Domann said. “Last year in Satt’s offense, it was very strict. Like, 1-2-3 to 4, where in this offense we still have reads, but there’s a little more flexibility of like, ‘Hey, make a play. Get the first down.’ There’s a little more allowing you to see it differently. Because, both (Brohms) being quarterbacks they understand that my vantage point is different from anyone else’s. You know, one’s in the booth and one’s on the sideline, but you’re on the field and they just want you to take over. I really love that. I think you’re going to see a really high level of quarterback play because of that freedom.”\n—The U of L alumni group in Denver will be hosting a Friday night game watch at Stoney’s Bar & Grill, which is located on the corner of E 11th Ave. & N. Lincoln Street). Street parking is available within the immediate area, with nearby public parking lots at 1131 Lincoln, 1120 Acoma Street, and 1255 Sherman.\nWe’ll be doing a “where we’re watching” game post on Thursday, so if you’re planning to get together with a group somewhere outside of Louisville, email me the location at MikeRuth5@aol.com.\n—Bill Connelly of ESPN ranks the 50 greatest high school football teams of all-time, and one squad from Kentucky cracks the list.\n38. 2011 Louisville Trinity (Ky.)\nBy the 2010s, major high school programs were taking on national schedules, but if Trinity was looking for a test, it never found one. The Shamrocks took on storied programs from Tennessee, Indiana and Ohio (including St. Xavier and Archbishop Moeller) and outscored them by an average of 45-12. That seems dominant, but it pales in comparison to their average score in-state: 54-6. Led by future Louisville star receiver James Quick, Trinity was untouchable. Quarterback Travis Wright threw for 323 yards and four touchdowns (two to Quick) in a 62-21 state title game romp over Scott County.\n—One of the stars of the new “BS High” documentary on HBO that tracks the infamous Bishop Sycamore scandal is running back Mario Agyen, who is now a walk-on running back at Louisville.\n—Bill Connelly’s S&P projections for week one like Louisville over Georgia Tech by 16.\n—The week ahead in Cardinal sports:\nMonday, Aug. 28\nMen’s Soccer vs Bellarmine - 7:30 pm ET (Dr. Mark & Cindy Lynn Stadium)\nThursday, August 31\nWomen’s Soccer vs Illinois - 7:30 pm ET (Dr. Mark & Cindy Lynn Stadium)\nFriday, September 1\nCross Country at EKU Triangular\nField Hockey at Princeton - 11 a.m. ET\nVolleyball vs South Dakota (Columbia, Mo.) - 2 pm ET\nMen’s Soccer at UNC Greensboro - 7 pm ET\nFootball vs Georgia Tech (Atlanta, Ga.) - 7:30 pm ET\nSaturday, September 2\nVolleyball vs Northern Kentucky (Columbia, Mo.) - 12 pm ET\nSunday, September 3\nField Hockey at Pennsylvania - 1:30 pm ET\nVolleyball at Missouri - 3:30 pm ET\nWomen’s Soccer vs Central Michigan - 7:30 pm ET (Dr. Mark & Cindy Lynn Stadium)\n—Jeff Brohm was in the house for U of L volleyball’s Saturday night win over Washington State.\n—Fun fact: This is the first Louisville football game I ever attended.\n—Composite preseason college football rankings have Louisville as the No. 30 team in the country heading into the season.\n—Louisville Report takes a look at U of L football’s top remaining recruiting targets in the class of 2024.\n—Cardinal Authority has five things to know as we head into game week.\n—Let’s gooooooooo\n—The State of Louisville takes a closer look at Jeff Brohm’s passing offense.\n—KET has a video feature on Russ Smith and his bourbon endeavor here.\n—And finally, the Mike Rutherford Show kicks off game week from 3-6 this afternoon on 1450AM/96.1FM. You can stream the show here.",
  "word_count": 1706,
  "scraped_at": "2026-02-14T13:09:59.701730"
}