{
  "article_id": "0c61c398736f",
  "url": "http://www.china.org.cn/2025-11/28/content_118199656.shtml",
  "title": "Aitana Bonmati : women football can really help promote equality",
  "date": "20251128T051500Z",
  "domain": "china.org.cn",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "As Spain prepares for its UEFA Nations League women's football final against Germany, Spain's most famous female footballer Aitana Bonmati has discussed the role that the women's game can play in society.\nAitana Bonmati (front R) of Spain shoots during the Group C match between Japan and Spain at the FIFA Women's World Cup 2023 in Wellington, New Zealand, July 31, 2023. (Xinhua/Qin Lang)\nThe three-time Balon d'Or winner will lead the reigning world champions and runners-up in this summer's European Championship into the first leg of the Nations League final in Germany on Friday and then in Madrid on Tuesday night where Spain will play in the 70,000 capacity Metropolitano Stadium, which is usually home for Atletico Madrid.\n\"I like to highlight that we can be role models for boys and girls, but especially for boys,\" said Aitana in an interview with Spanish radio station, Cadena Ser.\n\"When I was young, my idols were men, so why can't it be the other way around now?\" she asked, explaining that she was now well-known public figure.\n\"I go to grounds and there are plenty of boys who recognize me, and it makes me feel happy. Years ago, I didn't think this would be possible,\" she commented.\nThe attacking midfielder believes the raised profile of the women's game in Spain and the success of the women's national team \"greatly contributes to equality.\"\n\"When you're a child and you grow up with the idea that women can be role models in sports, when you're older you have a greater awareness of equality. Children, when they're young, don't have prejudices, it's us adults who instill them,\" said Aitana.",
  "word_count": 275,
  "scraped_at": "2026-02-14T12:50:50.811999"
}