{
  "article_id": "0c6676f70adb",
  "url": "https://www.meathchronicle.ie/2023/10/08/lucy-quinn-determined-to-bring-ireland-to-next-level-after-historic-year/",
  "title": "Lucy Quinn determined to bring Ireland to next level after historic year",
  "date": "20231008T144500Z",
  "domain": "meathchronicle.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Lucy Quinn determined to bring Ireland to next level after historic year\nMichael Bolton\nFrom a first major tournament, to making their debut at the Aviva Stadium, it has been a historic 2023 for the Ireland women's football team, and Lucy Quinn has played a big part in it.\nThe Birmingham City striker was part of the Ireland squad who played in their first World Cup this summer. Despite encouraging performances, it ended in the group stage with one point.\nWhile Quinn described playing at a World Cup as a dream, she admits the Republic of Ireland could have achieved more down under.\nSpeaking to Breakingnews, the 31-year-old is hopeful the tournament can be used as motivation for the team to push on and reach more major tournaments.\n\"It was once in a lifetime, something I have dreamed about since I was really, really small. To be able to say I have done it, it just made me really proud to be Irish\", said Quinn.\n\"It was a tough one to take as obviously it was our first major tournament experience and we want to grow from that, but I think we could have achieved a little bit more.\n\"I think we were really lucky to not get an equaliser in that first game against Australia, and what a result that would have been. I think the Canada game and Nigeria were both really competitive, and could have gone either way.\n\"It was an unbelievable experience, you reflect on it and learn a lot, but I'm hungry for more now, and I am eager to reach another major tournament.\nFine margins\nIt was fine margins that cost Ireland at the World Cup. A penalty was the difference between them and Australia, who were hosts and finished in fourth place, while Olympic gold medallists had to dig deep from a goal down to win 2-1.\nThe World Cup showed what the standard is required for Ireland at future tournaments, and while Quinn admitted she wishes some parts of the campaign went differently, she is determined to make it right at future tournaments.\n\"The competitive athlete in you is kicking yourself. I still think about that Canada game, and think about things I would have done differently.\n\"I think you have to be realistic and say, we lost those games to Australia and Canada on fine margins, to teams who lost previous games on fine margins when they were new to major tournaments.\n\"I think whichever way you spin it, it's a process you have to go through, and I just wish I was a little bit younger so I would have more chances at putting those fine lines right I guess.\n\"For me, the more things you do at international level and at a major tournament or if you are out of your comfort zone a little bit, you are going to get better from that, you are going to learn a lot of different lessons on and off the pitch.\"\nNew era\nFast-forward to September, and more history was made for Ireland, for different reasons and in a different environment. After the FAI decided not to renew Vera Pauw's contract, Eileen Gleeson took charge of the team for the historic game against Northern Ireland, the women's team's first outing at Landsdown Road.\nAfter 31 minutes, Quinn became the first woman for the national team to score at the stadium in the 3-0 win to kick off their Nations League campaign, a moment she foresaw in the build up to the game.\n\"I had a moment the day before the game, when I was thinking someone is going to be the first person to put their name on the score-sheet, I would love for that to be me and for that to be something that I can say I have done and will be remembered amd be a really good day for the women to be there for the first time.\n\"When it actually happened, I couldn't believe it to be fair. I like to think that thinking about it the day before made me focus and just made me hit the shot when it came to me.\"\nIn that squad for the Nations League games against Northern Ireland and Hungary, it marked a new era, with experienced players like Niamh Fahey missing through injury, and Áine O'Gorman retiring. Caitlin Hayes made her debut, while Tyler Toland made her return after four years.\nOn Friday, the FAI announced Eileen Gleeson who, was an assistant to Pauw, will be in charge for the remainder of the Nations League campaign.\nIt's currently unclear where the FAI search for a new manager currently is, but Quinn believes players are out to raise their game after this summer.\n\"In any club or national team, when new management or staff come in, you want to show what you can do and prove a point. It was good to see everybody rise to the challenge and fight for a place in the team.\n\"It was good for everybody to just dig in and say we are not going to get comfortable with what we have achieved, we are going to push on with what's next.\n\"Football is fast, things happen, things change, and you just have to roll with the punches, and as a professional, you have to step up to the challenge of whatever that may be. I think it has helped that it has been Eilo that has stepped in because we know her and we are familiar with her, and she knows us, so I think that's been helpful.\"\nIrish in Birmingham\nBack in England, it has been a difficult start to the championship for Lucy at Birmingham, with one win in their opening five games.\nAlongside Lucy at Birmingham, is fellow Ireland internationals Louise Quinn, Jamie Finn and Lily Agg. Despite a slow start, Lucy Quinn is confident they can turn their season around.\nThe race for promotion to the Women's Super League will be competitive, and Quinn credits the advancements made in women's football for this.\n\"I think we haven't had much luck with things going our way, but then equally, you make your own luck, and at times we haven't done enough to make our own luck.\n\"Even with myself personally, I have been frustrated with some of the games and what I have been able to do.\n\"We have got an unbelievably talented squad. Some of the names we have got in now are international players, players that have played there for a long, long time.\n\"The Championship as a whole, is getting better, better and better. The clubs are becoming full-time, people are really competing now, everybody has a talented squad. I think there are four, five, maybe six names in the hat for promotion.\"",
  "word_count": 1136,
  "scraped_at": "2026-02-14T12:40:56.511116"
}