{
  "article_id": "0c68e06d42ce",
  "url": "https://theathletic.com/5393298/2024/04/08/richie-kyle-luton-town-teaching-premier-league/",
  "title": "Richie Kyle : From teaching PE to coaching in the Premier League with Luton Town",
  "date": "20240408T044500Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Do you want to understand the biggest story of the day before anyone else? Sign up here for our brilliant new daily newsletter\nBefore Rob Edwards agreed to become head coach at League Two side Forest Green Rovers in May 2021, he had an important journey to make.\nThe now-Luton Town manager, who led his new side to promotion to the Premier League in May 2023 seven months after taking charge, made the two-hour drive from his Midlands home to Liverpool. Why? He wanted to convince Richie Kyle, a former secondary PE school teacher, to become his assistant manager.\nAdvertisement\nWhile on the books at Barnsley in October 2013, Edwards, then 30, called time on his professional playing career due to recurring injuries. Still living with his family in Lytham St Annes, Edwards met Kyle, a new face at his old club, Blackpool. Kyle had given up a stable career in teaching physical education to take charge of Blackpool’s academy having met former England international Paul Ince, who took over as manager in 2013, while studying for their coaching badges.\nEdwards told Kyle he was keen on upping his coaching experience so Kyle invited him to coach Blackpool’s under-18s.\nA decade on and Edwards was in Kyle’s kitchen laying out his Forest Green masterplan — one which would result in Rovers winning the League Two title within a year.\n“He sat there for four hours and said this is how we’re going to play, this is what we’re going to do, this is how I see it going. He just sold it,” Kyle, 39, tells The Athletic from a cafe in Woolton Village, not far from where that crucial conversation with Edwards took place. “I thought, ‘he is the most ambitious person I’ve ever come across’. He has just got this ‘I know where I’m going to go and I know how I’m going to get there’ energy. I thought ‘I can’t say no’.”\nBefore that meeting, Kyle says he and Edwards had checked in on each other professionally but were never close. The reason Edwards thought of Kyle was because he had not forgotten his kindness and diligence.\nIn 2017, Kyle left Blackpool after being hired by the Football Association as an out-of-possession coach with England’s youth teams. When a similar role as in-possession coach came up, it was Edwards, who was managing Wolverhampton Wanderers under-23s, who came to mind. Kyle not only recommended Edwards for the job but rang him up to tell him to apply.\nWhen the pandemic struck in 2020, the Football Association made cuts. Kyle’s job was axed.\n“Redundancies came and he (Edwards) thought he would be last in and first out but they saw his ability,” Kyle says, during one of his flying visits home to his wife Charlotte and their children Abigail and George.\nAdvertisement\n“The hardest thing is leaving the kids and not being home,” he says. “I do feel guilty but I’m doing it for the right reasons, for our future. I remember after the play-off final (with Luton) saying, ‘This is why I’m away, this is the reward for the sacrifices’. We can use this experience to be in a better place.”\nKyle is scarred not only by those months of worry during redundancy back in 2020 but memories of having to borrow money for petrol from his family to make the daily commute to Blackpool’s academy. Keen to get into full-time coaching, he took a sizeable pay cut.\nAfter redundancy during Covid, he worried whether a job in football might come up again. It did, but in a completely unexpected role. Kyle knew former Lionesses assistant manager Bev Priestman from St George’s Park, where all England’s national teams are based.\nKyle messaged congratulations to Priestman after she was unveiled as Canada women’s national team head coach in October 2020. He never expected that would lead him to become Priestman’s assistant at one of the best women’s teams in the world who, in August 2021, won gold at the Tokyo Olympics. Kyle was in the process of relocating to Vancouver with his family but due to travel restrictions and personal circumstances, he was unable to step foot in Canada during his nine months in the job.\nWhen Edwards met Kyle in April 2021, the Olympics were three months away. He carried the guilt of leaving Priestman in the lurch so close to the games but hoped his work contributed to their success. He believed in Edwards and thought they could achieve something special.\n“When I look back and think we got promoted with Forest Green as League Two champions, went to Watford the following season and whatever happened there (Edwards was sacked after three months), then Luton where we won promotion in front on 90,000 fans at Wembley in the Championship play-off final — it was the right decision. I wouldn’t trade in an Olympic gold medal for what I’ve got now and what I’ve experienced. I’ve barely had time to breathe in the last couple of years.”\nAdvertisement\nSipping his green tea, Kyle takes stock of his journey from Archbishop Beck Catholic College in Liverpool to the Premier League.\nAt Archbishop Beck, he was coaching one of the best school teams in the country. “We had a starting XI of academy players like Jonjoe Kenny, who was at Everton, and Jordan Rossiter, who played for Liverpool. We won everything there was to win.”\nKyle, a boyhood Everton fan and season-ticket holder, coached at the club’s academy, with his first part-time coaching gig coming at Blackburn Rovers’ academy. His dream of playing for Everton was never realised despite time at Liverpool and Crewe Alexandra as a youngster. He ruptured his cruciate ligament in his knee twice. An injury to the cartilage in the same knee meant by the age of 18, a playing career was no longer an option.\nThat is when he got the best advice he has had: to become a teacher and coach part-time. He believes teaching helped land him the England role.\n“I applied thinking, ‘absolutely no chance, no way in a million years am I getting this but I’ll just go for the experience,'” he says.\n“What helped was the background doing my degree and teacher training, going into schools, doing presentations. I was confident because of the skill set teaching gave me.\n“Football’s mad because people look at you and think if you haven’t played or haven’t got that background… It is really difficult to break down the barriers and I know it is changing now but it has always had that culture of ‘Oh he/she hasn’t played, what do they know?’\n“I found it a massive barrier. I always thought if I get into full-time football, I’ll just be known as a PE teacher.”\nKyle has shaken off that teacher tag. Not only did he get promoted with Forest Green and Luton but he was assistant manager to Gary Bowyer at Blackpool when they won promotion to League One via the play-offs in 2017, beating Luton in the play-off semi-final.\nKyle went from not having enough money to commute to Blackpool to coaching Jude Bellingham, Jamal Musiala (who now represents Germany) and Cole Palmer in Florida at a Nike tournament while staying at The Ritz-Carlton hotel. His gamble paid off.\nAdvertisement\n“I was confident in the FA interview but I thought they will get Joe Cole or Steven Gerrard or whoever in — you know, an ex-England international. Then I always remember (FA head of development) Matt Crocker (now technical director for United States Soccer Federation) phoned me and said ‘You’ve got the job!’ I thought he was joking. He said your first camp is going to be with the under-16s in two weeks and you are going to America.”\nFor Kyle, England was his football degree. He said working with players of Bellingham’s level and alongside coaches like England manager Gareth Southgate was like studying at university. The Premier League — and being “death stared” by Jurgen Klopp — has been a PhD.\n“Have you seen the way Jurgen comes up to watch the (opposition) warm up and just stands there? We were having a laugh and I said if Klopp comes and stands and watches our warm-up, I’m going to stand and watch their warm-up. At the Kenny (Kenilworth Road, Luton’s home stadium) he comes up to the halfway, he stands right close — I didn’t realise he got that close — it is quite intimidating, and Paul Trollope (his fellow assistant manager) was laughing saying ‘Go on then, go on then!’\n“I remember in the emotions of the game there was a challenge or something that happened and I stood up and shouted something and sat back down. Klopp just death stared me for what felt like five minutes.\n“At Anfield he had a beer with us (after Luton’s 4-1 loss) and was very complimentary. He said he really loves what we are doing, don’t change and that Rob’s no fear football reminds him of himself when he was a young manager at Mainz.”\nKyle’s career has been an education but nothing prepared him for what happened on December 16 when Luton’s captain Tom Lockyer went into cardiac arrest during an away game against Bournemouth. Lockyer had collapsed on the pitch during the play-off final but regained his consciousness quickly and was taken to hospital. It was different in December. After collapsing in the 59th minute, Lockyer was dead for two minutes and 40 seconds before being revived.\n“We all absolutely knew it was serious,” Kyle says. “I remember at one stage the whole stadium went into this eerie silence. Everyone knew he wasn’t responding because we’d seen the defibrillator going on. It was horrible.\nAdvertisement\n“Then you’re thinking…” he says, before stopping himself. “I’ve not spoken about this. (At Wembley) I was getting information on the bench saying it was his ankle. We weren’t sure what was going on and because of the noise, it was chaotic, I don’t think it hit home. He was wearing an oxygen mask as he was going past but he was awake. I was able to compartmentalise it.\n“But the second time we knew exactly what had happened because we’d been through it. It gives me shivers now… I froze. Rob reacted so fast. He instantly knew. In my head, I was like, ‘I need to stay calm’. I just kept thinking of the other lads, we had loads of staff running around and the players were all coming over and we knew we had to take them inside — we knew how bad it was.\n“I knew at some stage someone might turn around and say, ‘Do you want to play the game or not? His health is more important but we need to be ready for this because if some of you can’t carry on after what has just happened it’s all right’.\n“A lot of them said, ‘let’s do it for Locks, let’s play’. But then when the news was coming out saying it’s a bit more serious and we don’t know how he is. It was like, ‘let’s not even think about the game now’.\n“It was just another moment in a mad couple of years. And that’s the thing — I can talk through my experiences at Blackpool and England, coaching badges and teaching, but nobody prepares you for standing in front of 22 Premier League footballers after their team-mate has just had a cardiac arrest and you’re like, ‘what the f*** do I say here?’ Nothing prepares you for that.”\nThankfully Lockyer is on the mend and a reflective Kyle is grateful for that. Both have much to offer football in the future.\n(Top photo: Caoimhe O’Neill/The Athletic)",
  "word_count": 1961,
  "scraped_at": "2026-02-14T13:04:57.509209"
}