{
  "article_id": "0c97c6a95458",
  "url": "https://www.cityam.com/the-record-salary-emma-hayes-is-set-to-earn-as-us-womens-manager/",
  "title": "Chelsea Emma Hayes to be best - paid female manager with US",
  "date": "20231105T171500Z",
  "domain": "cityam.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The record salary Emma Hayes is set to earn as US women’s manager\nChelsea boss Emma Hayes is expected to become the highest-paid female football manager when she takes over the US women’s national team (USWNT).\nHayes is the most successful coach in Women’s Super League history, having won 13 major trophies in 11 years, including six WSL titles.\nChelsea confirmed in November that Hayes would leave the club at the end of the season “to pursue a new opportunity outside of the WSL and club football”.\nThe 47-year-old is set to earn a record salary which could match US men’s team boss Gregg Berhalter’s $1.6m (£1.3m) pay packet, according to reports.\nThe US pays its men’s and women’s national team players equally following a six-year dispute over remuneration which wasd finally settled last year.\nHayes’s Chelsea pay packet is not known but the best-paid player in her team, Sam Kerr, is reported to earn around £400,000.\nIt is not yet clear when she will begin her new role with the USWNT, but she may be asked to juggle both jobs until the end of Chelsea’s season in May.\nHer appointment was approved by the US Soccer Federation in a vote on Saturday. England coach Sarina Wiegman had also been a target.\nHayes will be the long-term replacement for Vlatko Andonovski, who left the position after presiding over a failed defence of the Women’s World Cup in the summer.\nThe USWNT went to Australia and New Zealand among the favourites but were eliminated by Sweden in the last 16, their worst ever performance at the tournament.\nAndonovski’s former assistant Twila Kilgore has acted as interim head coach for the team’s four matches since then, winning three and drawing one.\nThe USWNT next play in early December, when they face China in back-to-back friendly matches in Florida and Texas.\nHayes started her coaching career in the US with the Long Island Lady Riders and, after a spell under Vic Akers at Arsenal, took her first management job at Chicago Red Stars in 2008.\nBruised by her sacking two years later, she considered her future in coaching while working for the family foreign exchange business, before accepting an offer from Chelsea in 2012.\nShe won the WSL and Women’s FA Cup double in 2015, beginning a period in which she established Chelsea as England’s leading team.\nThey have won the last four WSL titles, three of them as part of doubles, and led the team to a first ever Champions League final in 2021.\nHayes’s public profile has grown with her straight-talking punditry at major men’s tournaments, while she co-wrote a book, published this year, on the myth of the single great leader.",
  "word_count": 451,
  "scraped_at": "2026-02-14T12:22:17.035307"
}