{
  "article_id": "0ca3671c2cc8",
  "url": "https://www.nytimes.com/athletic/6100180/2025/01/30/georgia-stanway-england-bayern-injury/",
  "title": "Georgia Stanway injury comes as a huge blow for England and Bayern",
  "date": "20250130T230000Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Georgia Stanway has a trademark strut. It is not a way of showing off; it is just how she carries herself. Shorts rolled up, the gutsy midfielder’s no-nonsense playing approach means she makes her presence felt.\nNews of her rupturing the lateral collateral ligament in her right knee, sustained in training with her club Bayern Munich earlier this week, comes as a huge blow and raises serious questions as England prepare to defend their European Championship title this summer in Switzerland. Stanway had surgery on Wednesday and is expected to be absent for the next three to four months, with the Euros starting on July 2.\nAdvertisement\nThe former Manchester City midfielder has played more than 90 per cent of available minutes in the Bundesliga this season — the highest availability of her career — and is one of the first names on England manager Sarina Wiegman’s team sheet, starting all but two of the Lionesses’ games in 2024. The 26-year-old is a major cog in the England machine, a leader with a tireless work ethic who holds her team-mates to high standards and takes the game by the scruff of the neck. Alongside former City team-mate and friend Keira Walsh, she forms the beating heart of England’s midfield.\nGO DEEPER\nRanking the 50 players most likely to be selected for England's Euro 2025 squad\n“The grit, the dirty work, getting up to the ball, putting the tackles in, making sure to challenge their decision-making and making them uncomfortable — that’s what we did tonight,” said Stanway after England’s 2-1 win against Spain at Euro 2022.\nOff the ball, Stanway is crucial in setting the tone and on it, as shown by her passing network against Australia at the 2023 World Cup, she is instrumental in linking play, shuttling up, down and sideways, finding the half-spaces while Walsh dictates the tempo, occupying more central areas.\nOff the pitch, Stanway likes to take a light-hearted approach. “I’m happy to answer some questions, hopefully put a smile on some faces,” she said after a bruising 4-3 defeat by Germany in which she faced several of her Bayern team-mates. “When you ask a difficult question, I like to reply with a bit of humour.”\nWhile she is out — whether that includes the Euros or not — Stanway no doubt leaves a gaping hole and there is not a like-for-like replacement for her. She played every minute of the 2023 World Cup, save one 45-minute half against China, replaced by Laura Coombs while Jill Scott, now retired, was the replacement midfield engine in the dying minutes at Euro 2022.\nAdvertisement\nManchester United’s Grace Clinton seems the most likely candidate to fill the void. She has the physical potential needed off the ball and can pull the strings when in possession. She looked very comfortable when she started and scored the only goal for England in their 1-0 win against Switzerland in December, a performance which pleased Wiegman.\nBefore the game, however, the manager called for the United midfielder to be consistent, switched on at all times and understand the bigger picture rather than her own individual task. After the game, Wiegman acknowledged Clinton is on the right track and added that, hopefully, she keeps showing the same levels with her club. Clinton, however, has yet to find the same form at United that she managed during her loan spell at Tottenham Hotspur and has only started one of United’s four games of the new year.\nJess Park is another option and fulfils some of the No 8 duties required with Manchester City. Although small in stature, she holds her own and can be a terrier in the middle of the pitch — but her best qualities lie in her creative output going forward rather than disrupting the opposition’s midfield. Park’s club team-mate Laura Blindkilde Brown is an alternative but the 21-year-old is a raw talent and lacks the experience heading into a major tournament. Ruby Mace is playing regular 90-minute games for Leicester City and was deployed as a No 6 in place of Walsh against Switzerland. She could be repurposed as a more forward-thinking midfielder but is used to playing a deeper role for her club.\nEngland captain Leah Williamson, who came through the youth setup at Arsenal and with England as a box-to-box central midfielder, showed she could drive forward when she was used in midfield alongside Walsh and Stanway in two friendlies ahead of Euro 2022. But Wiegman opted to keep her in the back line and has never pushed her up since.\nOne issue is replacing Stanway, the other concerning problem is that Stanway is the backup to Walsh. Mace deputised in December but England do not have depth in those areas. In Walsh’s brief absence when injured at the World Cup, Wiegman turned to Coombs as a No 8, with Stanway dropping deeper against Denmark, and selected Katie Zelem against China. Neither Coombs nor Zelem has been called up recently.\nAdvertisement\nIt is too early to talk about whether Stanway will be available for this summer’s Euros. If she is available for selection, however, it is likely she will not have played any competitive football at domestic level before heading to Switzerland. That has not stopped Wiegman from selecting and starting players coming back from injury before though.\nAhead of the 2023 World Cup, Millie Bright sustained a knee injury in March but started in England’s opening game against Haiti and every subsequent match on the way to the final. In fact, the Chelsea captain described her injury as a “blessing in disguise” and said she felt “physically and mentally fresher” before flying to Australia. Bright, however, missed nearly six months of the following Women’s Super League season because of a knee issue, with then-Chelsea manager Emma Hayes saying her preparation going into the World Cup was not “ideal” and “she probably rushed herself back”.\nGiven how significant Stanway has been for club and country, neither will want to rush her back but they cannot afford to have the midfielder out for any longer than is already anticipated.\n(Top photo: Visionhaus/Getty Images)",
  "word_count": 1024,
  "scraped_at": "2026-02-14T12:43:15.845980"
}