{
  "article_id": "0cb287a48621",
  "url": "https://www.ok.co.uk/tv/lioness-leah-williamson-brands-controversial-30829275",
  "title": "Lioness Leah Williamson brands controversial Spain kiss  so sad  ",
  "date": "20230831T143000Z",
  "domain": "ok.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Lioness Leah Williamson brands controversial Spain kiss 'so sad' and 'misogynistic'\nLioness Leah Williamson has described president of the Spanish football federation Luis Rubiales' kissing Spanish midfielder Jenni Hermoso as \"so sad\" as she discussed \"misogyny\" in football\nEngland women's football star Leah Williamson has condemned the president of the Spanish football federation Luis Rubiales for kissing Spanish midfielder Jenni Hermoso after Spain won the FIFA Women's World Cup in August.\nLuis was seen planting a kiss on Jenni's lips as he congratulated the team for storming to victory against England in the final match of the tournament, which took place in Australia.\nLeah, who is one of the star players of the Lionesses appeared on Lorraine on Thursday, 31 August, as she spoke to Lorraine Kelly's stand-in host, Ranvir Singh about her new children's book.\nNaturally, given the controversy surrounding Luis Rubiales kissing Jenni Hermoso - which has seen the Spanish women's team refuse to play football until he resigns - Ranvir didn't miss an opportunity to ask Leah what she thought about the situation.\nLeah branded it \"so sad\" as she spoke about the \"misogyny\" of the world of football.\nThe footballer went on to discuss the video of Jenni laughing about the incident straight after it happened, before later releasing a statement which said that she \"felt the victim of aggression, a sexist act\".\nLeah said: “It’s conditioned behaviour [to laugh it off].”\nShe added: “Unless you’ve stood in the shoes of women and faced that… I don’t know anyone that hasn’t had that sort of experience and maybe not to those extremes… but a sexist, misogynistic experience throughout her life and she is conditioned to laugh it off.”\nSpeaking about the kiss incident itself, Leah said: “I think it’s really sad. I put myself in Jenni’s shoes as a female athlete, she should be celebrating the biggest achievement of her life and unfortunately it’s been overshadowed by this.\n“But I also think it’s important to remember we’ve lived in, especially football and women in football, we’ve lived in this misogynistic, sexist environment for one hundred years. It’s not changed.\n\"So for somebody to expect… I think she’s really brave to speak out and say ‘actually the shock of what happened after that and after that’s settled down, to think ‘no this is wrong’ and I’m not going to let that happen to future women'.\n“I think for [women in] football, I think it’s maybe different degrees but I think it’s actually a lot more common than you think and I think that’s why everyone is standing unconditionally with Jenni now because you don’t want something like this to happen but when it does, you have to use it to educate and re-educate people because it happens on a daily basis, just not in that form.”",
  "word_count": 469,
  "scraped_at": "2026-02-14T13:03:58.873351"
}