{
  "article_id": "0ccd525d5b12",
  "url": "https://www.thedaonline.com/news/university/benson-speaks-on-enrollment-increase-first-year-goals/article_a6f8bcf8-72ab-4feb-8c9c-a2bd4faba1cd.html",
  "title": "Benson speaks on enrollment increase , first - year goals",
  "date": "20250820T164500Z",
  "domain": "thedaonline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Newly-named West Virginia University President Michael Benson sat down for an interview with The Daily Athenaeum staff to discuss his goals for his upcoming term and answer questions about enrollment, academics, fundraising, Wren Baker and more.\nThis interview has been edited for clarity and length.\nDA: \"You recently visited 18 counties across West Virginia as part of your 'Welcome Home Tour.' What did you learn about West Virginia?\"\nBenson: “The 18 county tour was awesome. Actually, you have to add two more counties because we went to the [West Virginia] State Fair last week, which was great fun, but it was five days of really intensive visits. I think what was really reinforced everywhere we stopped was how much this university means to the state. So we saw it through extension services. You know, in 55 counties, we got offices in every one of them. Toured nine of our 25 hospitals, and when you see that WV on the side of a hospital, whether it's in Ripley or in Wheeling or in Charleston, I really believe the people that are patients or family members associate just the best quality care at any of those facilities. And that means a lot, because, as you know, health outcomes is something we really need to focus on in the state, because we kind of regret it when we’re in the bottom quartile in the area. So I came away so impressed with the quality of our facilities, the dedication of our staff. I went to a 4H camp. I went to historical sites. As a historian, I loved going to Wheeling and seeing Independence Hall. We ended our tour in Philippi at the covered bridge, and Civil War is kind of my history hobby, so that was very significant. And then, we ended in Grafton at the Mother's Day shrine. And the very last event was we, this may sound a little macabre, but I love cemeteries, because I love to see where people kind of have their final resting place and how it's maintained, and so we went to see Marmaduke Dent’s grave site. The city council member was there, and it needed some attention, because it doesn't have, like, a placard that said, you know, first WVU grad, first graduate of our graduate program. And so we're going to work with the city of Grafton, see if we can do that because that's a great, really, a very significant person in our history. We still have an annual Marmaduke Dent event. So and then from there, as I said, we came back to Morgantown, and since then, I hit two more counties. So I still have 35 to go. And we had the advantage of that week really kind of hunkering down and seeing as much as we could. So we'll try and pick up other counties in three or four day tranches between now and the end of next June.\"\nDA: \"What values do you hope to instill within the campus community during your time as president?\"\nBenson: \"Well, you know, I think you build on the values that are already here in terms of, you know, we're the land grant institution. So we have a land grant mission, which is at our core. And that means we are the University of West Virginia. I mean, this is the, this is the university that belongs to the people in the state. So I think, first and foremost, I think a primary value of mine is that, in many ways, I'm a steward of this responsibility. I mean, this is not my university. For whatever reason, I get on the media. I get a lot of attention in terms of interviews, and that's fine, but I speak not on behalf of myself. I speak on behalf of the University, and I represent you as students. I represent our students, our faculty and staff, and I take that responsibility very seriously. So I think primary, I mean, my primary value is to make sure I do everything I can to represent the University well. I think another value that, again, I sensed it was already here, is that West Virginians are really gritty, hard working people, and I think for a lot of folks, and we're new to West Virginia, I've lived all over the United States, and in other parts of the world. I think at times, they've been maybe second guessed or underestimated, certainly undervalued, and they have this kind of reputation of surprising people. When given opportunities, they rise up and do great things. I saw that firsthand when I visited Independence Hall and saw a few fans of 'Hamilton,' the room where it happened up there on the top floor. And you know, this is somewhat sideways, but I listen to a ton of podcasts, and yesterday I listened to one, 'Dan Snow's History Hit.' He's a British fellow, but there's a corollary to that, called 'American History Hit.' And this one was about what would have happened if Abraham Lincoln had not been assassinated. And the end of the discussion was, think about 1862 when West Virginia decided, 'Hey, we don't want to be part of what's going on in Virginia. We don't want to be part of the Confederacy.' And Lincoln went along with it because he wanted two more northern senators, you know, part of the Union. And he saw it as such kind of strategic stronghold that was very necessary. But I, the reason I say that is sitting in that room I thought about kind of the grit and determination of people to say we're going to do this because it's the right thing to do, not knowing what was going to happen. You know, the Civil War is still kind of in its nascent stages at that time. But I really, I thought a lot about that, and I was really kind of struck by the courage and temerity and the vision that people had in 1862 then, of course, our became officially a state the next year. So I always harken back to kind of history lessons to inform the present, at least from my from my perspective. So, you know, another value too is, you know, it kind of ties back to the first one. I hope everybody feels that they're a part of our university. So sure, I have a nice office in Stuart Hall, but I'm no more important than the person ,the boiler room engineer, or the person that cuts the grass, or a junior faculty member, and I really want people to sense that I feel a great part of a team. And that's not just words, because I'll show that through my actions, but I'm going to value every single member of our University family.\"\nDA: \"WVU enrollment has been dropping over the past decade. While at Coastal Carolina, enrollment and retention hit a record high. What specific strategies do you plan to implement at WVU to battle declining enrollment?\"\nBenson: “Well, first off, I'll say that, and I sent a note to our board last night that had the latest enrollment numbers, which are trending upward. So I'm very happy to say that. I think we've had some years of decline, but we have stopped that. So I think that's very, very good news. And I send a note to the board on a weekly basis, kind of keep them apprised, because I was told when I was hired that should be my number one priority, is focus on enrollment. At Coastal Carolina, it's kind of funny, because we joked that we could probably turn the lights on and open the doors and students would just show up. Because when you're 10 miles away from the ocean and in a beautiful setting and a really nice environment, you have a lot going for you. We have a lot going for us. You look at the spectrum of programs that we offer in terms of undergrad and graduate schools, the setting, I think Morgantown has a real college feel to it, college town feel. So, I'm going to take advantage of all those things in marketing, university. We just hired a brand new VP for Enrollment Management. His name is Fabrizio D’Aloisio. He goes by Faz, and you'll meet him, but he's coming from the University of Tennessee, where they announced, I think yesterday, another record kind of bumper crop of freshmen. So we're going to really rely on him and some of his strategies that he wants to implement. One that I'll mention, that I think you'll all appreciate. ... I shared this with a group the other day, if you look at how many high school graduates the state of Pennsylvania produced this last year, it's nearly 117,000. So West Virginia produced just shy of 17,000. So by sheer volume, we're surrounded by states like Pennsylvania, Ohio, even to a certain extent, Virginia, with larger student populations. So I will never, ever advocate that we turn away a West Virginia student because that's what we are. We're the flagship. So if there's a qualified, willing West Virginia graduate that wants to come here, there will be a place for them. And I'll state that unequivocally. That said, I think a lot of our future in terms of, and I've heard Faz talking about this, you have to open up that funnel even wider to make sure you get more applications, because applications will grow the more students apply, and it's either through the Common App or if they do it directly, but that's going to net us more students that want to come here. And you know, I look out my window at Stewart Hall, I see all the tours. I met with the tour guides yesterday, told them how much I appreciate what they do, because you don't have a second chance to make a first impression, and so many of those prospective students come with their families and really take a lot of cues from that tour guide. And I think the campus, in so many ways, sells itself. So I'm going to see if we can get more and more students from throughout the state. I heard from people during a tour we wanted to send kids from our school district, or we want to put them on a bus and have them go experience the campus because once they do that, I think they sense that, 'Hey, I want to be there.'\nDA: \"You have previously discussed implementing an on-campus housing requirement for sophomore students to boost retention. Have you made a decision, and are you engaging students in that conversation?\"\nBenson: “I approached that idea as merely an idea, but I think people kind of took it and ran with it. We don't have the capacity right now for that, but I wanted to look at different strategies. One reason is we had a freshman, sophomore requirement at Coastal, and we saw our retention number increase every single year. … We're actually having an outside firm looking at our bed stock, our inventory, where we need to add if we're going to go that route. … We've got, you know, 4,500 new freshmen on campus, and then you add in the transfer students and returning students. So that's one of many strategies that we're considering to focus on enrollment, retention and graduation.”\nDA: \"In addition to serving as president at multiple universities, you have also retained faculty positions. Do you plan to teach at WVU? How does teaching contribute to your role as president?\"\nBenson: “I think the President, I think administrative officers need to be a part of the most important thing that we do, and that is education. I love all the ancillary activities, whether it's going to a football game or participating in a club or doing a lot of other things outside the classroom, but what we do as a university is educate. So if I can be a part of that and show that's important to me and it's important to my administration, I think that's really, really important. So I've asked all my vice presidents, at some point, they need to teach a class too. They can team-teach it. … I've taught in political science. I've taught in history. … I’ve taught both online and in person. I much prefer in person, and I have a faculty appointment in history. I've met with my faculty colleagues, and I told them I'm like a utility infielder. … I really enjoy it. I think you find out a lot about how students are feeling a lot of times during the end of class, the last 10 minutes, I would just open it up. I said, you know, ‘What's your experience like?’ … I found that we got a lot of things done after I got input from students.”\nWVU biology graduate student Dionysios Patriarcheas [DA]: \"How do you perceive WVU’s academic reputation, and how do you plan to ensure that WVU remains an R1 institution while attracting scholars from all over the world?\"\nBenson: “I did meet with our international students yesterday and given the current environment, it’s a little bit challenging for these students, and also for institutions to know where they can attract those students. In my 30 years of doing this, I’ve always held that your entire campus, kind of a cultural tapestry, the environment is so enriched by foreign students, international students. They learn from us, but more importantly, I believe we learn from them. I learned that when I spent almost seven years overseas: two years in Italy, three years in England and a year-and-a-half in Israel. So, I will always maintain that for those qualified international students that want to come here for a specific program, and we have the seats, and everything is copacetic, we would love to have them here. In terms of the R1 statues, this is kind of getting down on the weeds, but the organization that ranks or categorizes institutions is called the Carnegie Institution. They changed somewhat of the qualifications for R1 status, R2. ... So it used to be if you produced a certain number of doctors each year, and you did ‘X’ amount of sponsored research, you were automatically an R1. So, that has been lowered somewhat. So, I’m not concerned at all that we’ll ever lose our R1 status. In fact, if anything, it's enabled smaller schools or maybe a smaller research portfolio to move into that category. What I will tell you is that our institutional reputation as the University, if you just were to take the Big 12, everything from private schools like TCU and Baylor to large regional universities, comprehensive universities, research universities, like Iowa State, Kansas State, Texas Tech, we're kind of in the bottom quartile in terms of a US News ranking. And some people say, ‘Well, why do you pay attention to that?’ Well, it's not that I pay a lot of attention to it, but parents do, students do, and it's the oldest ranking out there. Now, Princeton Review, Forbes, the London Times, there are a lot of ranking systems out there, and I believe that if you focus on what you're good at and continually improve, you just have to let the rankings kind of take care of themselves. Part of that too. I don't know if you know that, but in U.S. News, you know how they've come up with some of the rankings? They actually send surveys to chief academic officers and to presidents, saying, ‘What is your view of this institution?’ So a lot of it is, in many regards, kind of a popularity contest. So you'll see institutions will send out these very glossy, you know, tri-folds, or 12-page booklets about what they're doing in terms of research, faculty awards, etc. I will tell you that we're gonna have stretch goals at the University. Okay, this is not a time for us to be complacent or say we are where we are and that's as good as we're going to be, because I don't believe that. West Virginia University last year I think raised $282 million in private support. At the same time they did almost $270 million in sponsored research and development. So that means what the University spent on research, but also what we attracted from national agencies, whether National Institute of Health, National Science Foundation. I tell you that because you hear a lot of talk about the government really kind of backing off some of that support, and I really hope that we can continue to be aggressive in our grant applications, but also our support from private donors. Those are really good numbers. But if we want to aspire to get into the Association of American Universities… you all know what that is? The AAU was founded in 1900 by the presidents of five schools that you all have heard of: Michigan, Columbia, Harvard, Yale and Johns Hopkins, and it became the most prestigious grouping of universities in North America, because there are a couple of Canadian schools, McGill, University of Toronto. The last batch of American institutions that were just admitted included Arizona State, Notre Dame, UC Santa, Barbara, Tufts, and I really believe that that should be an aspirational goal for us because it is the best of the best. And if you look at the inventions, the medical discoveries, the technological advances that have come off of research campuses, probably 80% of them, 85% have come from an AAU institution. To give you an idea of who's a member of the AAU close to us: Penn State, Pitt, Ohio State, Virginia. I don't think VA-Tech is but they look at several criteria, and I'll end with this, is they look at how many of your faculty are members of the National Academy of Sciences, or National Academy of Medicine. For the first time ever, we have two faculty members that were elected: Sally Hodder, medicine, and…Mara McLaughlin in physics and astronomy, that's a really big deal. But if I were to go to Ohio State or Penn State or Pitt and looked at their faculty ranks, they would have a lot more members in those national academies. So I'm going to talk about it, and I'm going to aspire to it. That's not that now, that's not a popularity contest. …I told you the first criteria, members of the National Academies on your faculty, the publication rate of your faculty and what kind of publications they publish, in the citations of your faculty. So if I teach history, how many times is my work cited by other historians? Because that's kind of the ultimate peer review process. And the last one is how much [research and development] expenditure. So you all probably know I have a degree from Johns Hopkins, and for the 42nd year in a row, they led the country in terms of how much R and D they had, and last year was $3.8 billion, so that gives you a kind of idea of the task ahead of us. ... I think it's important for us to have stretch goals as an institution, and that should be one of them, that that should be a goal of ours.”\nWVU biology graduate student Dionysios Patriarcheas [DA]: \"Is attracting international students and maintaining a safe environment for them a priority?\"\nBenson: “It is. I'll tell you an experience I had when I was at Eastern Kentucky. At the time, we had quite a few Saudi Arabian students, and having lived in the Middle East, I have a real affinity for those students and also respect for different religions, whether it's Islam or Judaism or Hinduism or whatever faith one might have. But there was an incident where some of these Saudi students were targeted, and they asked me to come to kind of a meeting where they could talk about it, and they were upset. And I remember walking in and not knowing how it was going to go, but I just told them, our responsibility is to create an environment where you feel welcome and safe and like you can succeed. And in this instance, the institution has failed. So we kind of doubled down and said, 'We're going to re-up our efforts to make sure you do feel that this is a place where you can feel safe.' Because having gone to graduate school overseas, it's hard to do that. It's even doubly hard to do it in a different language. And so you can feel the sense of isolation sometimes that our international students have. I asked them yesterday, you know, all of you obviously speak a second language for the students from England, maybe not, but I said, ‘Okay, how many you speak two languages?’ Probably 30 hands went up. Three languages, probably 15. Four, there were two, and one student speaks five languages. You know, as Americans, we do a terrible job. Number one, showing any desire to learn a second language. And number two, kind of instilling in our students in high school the value of learning a different language and appreciating a different culture. So I hope that a kind of hallmark of my tenure is that I will always appreciate our international students and create an environment where they feel like this is a home for them, and they'll feel welcome. So I told their advisor, we're going to have a dinner for them over at Blaney House this semester and make sure we have food that's appropriate for everybody. But I really enjoy being with that group of students.”\nDA: \"What role do you see private funding, corporate partnerships and research funding playing in WVU’s future financial health?\"\nBenson: “We are a state supported institution. If you look at the amount of support we get from the state, we’re very grateful for that, but that’s not the bulk of our budget. If you were to look at kind of our budgetary pie and the silos of where the funds come from, you all provide the biggest kind of tranche of funding and that’s tuition and fees. Probably the second area would be auxiliary revenue, in terms of all the auxiliary enterprises that we have on campus, corporate sponsorships is up there. Research and development is certainly there, then the state support, but the private support is a huge component. So, you know, I've told our foundation that for a school our size, that's been around since 1867, that has as many living alumni as we have, we should raise $300 million annually. That should be our goal. And I know we can do it. I mentioned $282 million a year ago, this last year, so the fiscal year just closed. It dipped down just a little bit, but we need to stretch ourselves and be more aggressive. We're in the midst of a huge campaign. Our goal was $1.5 billion. I mean, if you had asked me or told me 10 years ago, West Virginia University is going to launch a public campaign and they're going to raise a billion and a half dollars, I don't think anybody would have believed that. So we've gone through, and I credit my predecessor a great deal, because Gordon Gee was a master fundraiser. He was really good at he's still good at it, and we have very loyal alumni that care very deeply about this place. So the key is to tap into that loyalty and to match philanthropic intent with institutional need, and that will be one of my many responsibilities, but one I really enjoy. I do. I mean people [ask me] ‘you like asking people for money.’ I said, ‘I like asking people for money for the most important thing that exists in this world, and that's education, because it can change lives more than anything else.’ So, you know, if I were to ask all of you, how many of you are first generation college students, or you came here on a scholarship, you know, look at how much it's impacted you. ...So, if I can go out and raise more money to provide more opportunities for more students like you, that's the best part of our job.”\nDA: \"You touched on wanting to cultivate a supportive environment for those international students, and you spoke to the importance of learning other languages. Do you plan to reinstate the Department of World Languages, [Literatures] and Linguistics?\"\nBenson: “I’ve been asked that before, and I think I’m too new in my role to maybe comment in terms of our long term goal. I’ll give you an example, my daughter speaks Khmer, she lived in Cambodia for a year and a half. My brother speaks Japanese, he lived in Japan. I speak Italian. My son married a woman from Mexico, and he speaks Spanish. They speak Spanish to each other, which is really kind of cool. And I love learning languages. I'm not a linguist. I studied Arabic and Hebrew and failed miserably in both. So, I value the role the University plays in teaching and trying to inculcate into all of us the need to learn a different language. Now, what happened in the past, is the past, but I will tell you, we're going to continue to continuously monitor the degree offerings that we have. As I said, you're not the first to ask me that question, so I will continue to look at it and see if there are ways that we can continue to show our institutional belief in and respect for teaching languages and different cultures.”\nAnonymous alum [DA]: \"Some alumni stopped donating to WVU following former President Gee’s program cuts. Do you plan to reverse any of those decisions? If not, what steps will you take to rebuild alumni trust and encourage us to give again?\"\nBenson: “Well, I'll say what I said before. I'm not going to make any commitments in terms of restoring anything that happened. I have heard from alumni that were disappointed, and I have to say that we were not alone in going through some kind of budgetary challenges. Those of you from Pennsylvania, you probably read that Penn State closed all their regional campuses. The president there, Neeli Bendapudi, is a good friend of mine. She was the president of the University of Louisville, when we were in Kentucky. And big state schools that you would think, you know, Big 10, they've got all this money coming from their TV contracts. Their enrollment has, you know, there's been kind of a persistent decline in some places, and so a lot of institutions, even our size, have had to cut back. So I don't think any of us can say…we can continue to do what we've done, and technology advances, AI degree programs and demand for those programs, those are shifting sands all the time. And so as a university, you've got to be nimble. I certainly hope our alumni feel that that diploma that I hope hangs on their wall or in their office or their home means a lot to them, and that my job as President is to make them even more proud of that diploma, as opposed to not wanting to donate to their alma mater. I hope I can reverse that. But you know what happened in the past is behind us, but we're going to move forward and focus on enrollment, focus on what we do well, do it even better. And if there are degree programs that we do need to consider, look at those. And I will tell you this, in terms of AI, we're looking at kind of seven weeks to Sunday, as they say, how many or how we can embed AI, particularly in the general education curriculum, and making sure students are very conversant and very proficient in the proper utilization of AI, because you go into the workplace now, and my guess is...more and more businesses are utilizing it every single day. And you know, it's not just Chat GPT putting in the prompt. You have to know how to do the prompt and how you get the information back. So all that to say, we continually monitor our program offerings, and I hope I can make all the alumni proud of their alma mater.\"\nWVU alum Edward Lance [DA]: \"What cost-cutting measures in University administration are you willing to entertain? Is an open-ended contract with a charter jet service, as has been the case with L.J. Aviation, still intact?\"\nBenson: \"I understand the contract is still intact. I will be very judicious about the use of the plane. It is true that it makes things much easier to get through to remote locations, especially if you take a group of people. But there are ways that we can certainly cut administrative costs. My office has seen several reductions in personnel from retirement or attrition positions that we're not going to fill. So I think it's really important for me to lead from the front, as they say, and show that we're trying to be very mindful and cognizant of the funds that we have and be judicious in the use of things like private jet travel. I fly commercially just about everywhere.\"\nDA: \"On April 12, the West Virginia Legislature passed a bill to establish a civics center at the University. How will WVU comply with the bill and fund the establishment of the center?\"\nBenson: \"So this is called the Washington Center, and it is a state appropriation that would fund five faculty positions, as well as a director. There’s also an advisory board, only one of whom is a WVU employee. So, I know all this because I spoke to the governor’s chief of staff last week about kind of the next steps. We have a working group between political science, philosophy, history and the idea, and it's not dissimilar to what we had in South Carolina, where we had to submit copies of syllabi of classes that were kind of in compliance with the state mandate that we taught the founding documents… they call the Civil War amendments… So it was kind of a broad spectrum of really important historical aspects of our countries, our national history. And this one is a, I've never had a center like this before in an institution, and we're the, as you know, the only one that got it, the funding. So in effect, it's kind of soft, what they call soft money. It's like we get a contract, or we get a grant at the university, and we're going to be compliant with the statute as we know it and understand it, but we're in discussions now with the governor's office about next steps for staffing it and how to move it forward.\"\nDA: \"State and federal support for higher education has been an area of concern. How do you plan to advocate for WVU’s needs in Charleston and Washington?\"\nBenson: \"Well, I have used this before, and I apologize if it's redundant, but in teaching either political science or history, we always go through the… first 10 amendments. So as journalists, you all appreciate the First Amendment because it impacts what you all do every day, the freedom of press, speech, assembly, freedom from a state religion, but also a freedom to practice any religion you want. And the last part is the freedom, or the right, to petition the government for a redress of grievances. So each of us around this table and in this University community and in our country has the right to go to Charleston or to their respective state capital and advocate for their cause. So I will do that. I enjoy it. I treat legislators just like I would a donor to the University. They have to be cultivated. They have to be told how their funding is being used. You have to be, I think, responsible, in being very forthright and telling them how those funds are being used. And it's true. I mean, whether it's at the state level, and we're not unique in terms of maybe our state support having declined over a multi-year period, but the federal support is also declining, and that's concerning, because… America recognized that technology and science were going to be the key to our economy moving forward. And so there were government sponsored labs, like Bell Laboratories. There were the National Science Foundation, National Institute of Institutes of Health, all of which were created for the purpose of supporting, particularly, research that was going on on research campuses throughout America, and we're one of those campuses. So I will be a very strong advocate for not really cutting off at the knees, what I would call the ‘secret sauce’ of our economy, and that is all of the amazing work that happens on research university campuses, that every day we probably take for granted… And I am passionate about this because this was what my last book was about, the founding of America's first research university, which changed our country. And it concerns me when we're not recognizing that America's, kind of greatness, and I'm not here to thump our chest about being Americans, but America's research university is the envy of the world, and it has been for centuries, the last two centuries, at least. And we are at danger right now, decimated, to the point that I don't know if it will be able to fully recover. So I appreciate, particularly, Senator Capito. She has really gone to the mat for us multiple times, but we all have to be, I think, advocates for what happens at research universities like West Virginia… I'm very passionate about this, because the future of our economy, of our nation and our technological advantages are inextricably tied to what happens at university campuses.\"\nDA: \"What is your vision for [WVU] Athletics at the University, and how does it align with your broader mission of the institution?\"\nBenson: \"Well, this comes on the wake of my being on the '3 Guys Before the Game' podcast yesterday, which was great fun because it was five of us. I got to go on there with Wren Baker, who I think is the best athletic director in America. And Wren had a good line. He said, 'What we do in athletics is not the most important thing, but it's certainly the most visible thing,' and I would agree, and if I were to curate articles about University, probably 75 to 80% would be about some tied to athletics. So while I'm a huge sports fan and I played college sports, it's not the most important thing we do, but it's a means to an end. First, it's a means to an end for a student athlete, so they can come here and get an education. And as I told the group yesterday, a lot of our kids are not going to play on Sundays. They're not going to play professionally. So an education is that means to an end, to get a degree playing a sport, to get a degree and to get a job. I'm looking forward to the Pitt game, and I can promise you that our teams will be competitive. We will certainly abide by all the NCAA rules and regulations that seem to change just about every other month, but it's a whole new landscape in terms of college athletics, one that I've never seen before, and doing this for 30 years. And I'm not alone in that assessment, because everybody says the same thing, so we're going to be competitive, we're going to live within our means. But what we do in terms of athletics, think about how it brings all these people together who may not otherwise come to campus. And as I understand it, Morgantown, on the fall afternoon, becomes the largest town in the state, and that tells you about how important it is, because no professional teams. We're the only division one power four school, and so we get a lot of attention. And I know a lot of people hang their hopes on how they feel on Saturday, how it will go the rest of the week. So looking forward to our first game here in about 10 days.\"\nDA: \"How do you plan on collaborating with Wren Baker to improve the quality of WVU Athletic facilities?\"\nBenson: \"Wren's got a very aggressive plan about what he wants to do with some of our older facilities. I'm talking about Milan Puskar Stadium, and certainly the Coliseum. You look at our other facilities, I had dinner with Coach [Randy] Mazey and his family the other night at his home at his invitation, which was a wonderful chance to get to know him. He built the [baseball] program into what it is today. The fact that our baseball team has been to two Super Regionals back-to-back, that we won the Big 12 last year, and we have, I would think, one of the most beautiful stadiums in the Big 12, if not the country. So I've been in the soccer stadium, I went to the Pride of West Virginia's new marching band facility the other night. It's beautiful. Finally, they have a facility to match the quality of their product. Our swim and dive facility out there at Mylan Park. So we have great facilities, some need a little bit of attention, and I have full faith and confidence in Wren that he'll come up with a plan. Number one, to pay for it, and number two, to ensure that it provides the best venue for our student-athletes to compete in, but also for our fans to enjoy themselves and cheer on the Mountaineers.\"\nDA: \"What were the challenges of the men's head basketball coaching search when working between two administrations?\"\nBenson: \"Yeah, I wouldn't say there were any challenges. I mean, Gordon was still president, President Gee, so I stayed in my lane. I had no authority whatsoever. If they called me and asked my opinion, I certainly shared it. Wren actually went to the the Women's NCAA Tournament game, which was at Chapel Hill, and Wren was right in the middle of the search, so after the game we found a quiet spot and he kind of told me what was going on with candidates and what he was leaning toward and I said I appreciated it. But again, that was before my time. So he made a great hire. I really like Coach Hodge, I've had a chance to meet him and his family and I think he's gonna do a great job.\"\nDA: \"Attendance numbers at athletic events reached record highs under you at Coastal Carolina. Are there any plans in place to aid WVU's attendance figures for sporting events?\"\nBenson: \"Yeah, I'll probably leave that to the athletic department. We did a few things at Coastal that were really good fun. I mean, the football games, I don't know if you saw, but our athletic director went to our food vendor which is Aramark that did all the concessions, and it wasn't a whole lot of money. He did the calculus and he said we could do free popcorn, soda, hot dogs and water. You come into the game and you can eat as much of that as you want and he rolled that out about three months ago and like, the Internet blew up. I mean, you would have thought we just split the atom. I mean, it was it was unbelievable the response and people like 'How can you pay for this?' We said we got so little from our food vendor in terms of the kind of the margin and how much we got from each game, they were the ones that took the the kind of risk and they made it up in selling what they call premium items. So a hamburger is going to cost you a little bit more. If you want a beer, which most places, if not all sell now. But that got a great deal of attention and really got our season tickets through the roof. I've heard here that this is the highest number of preseason ticket sales that we've done for season packages, so I'm encouraged by that. I really believe that the game day experience has to be fun. We used to do we had a DJ at our games, you know, the teal field was kind of cool, people like that, but I was at Sunday Night Lights the other night and I heard the band and I tried to kind of picture 60,000 people in there, and I cannot wait, and I when I say that in the in the football stadium. My favorite sport is track and field and cross country. I really enjoy watching that so you'll see me at soccer, volleyball, everything. I think it's really important the president to support all the teams and make sure every student-athlete feels supported by our attendance.\"\nDA: \"Are there any plans to increase donor support for WVU Athletics?\"\nBenson: \"Stay tuned for a pretty significant announcement here in the next several weeks about some of that support. But, from the obligations we now have with rev share, some of the other things that we didn't even plan on three, four years ago. The University has got to come up with ways to increase that revenue. So you do that through sponsorships, you do it through corporate relationships, you do that through private support, you do that through kind of creative, pricing for tickets and packages and that sort of thing. So you know, the deal with the free concessions. I mean as long as you get people in the stadium, they'll spend money in other ways, whether it's on apparel or a pop-up store. They’'ll get a hat or banner or whatever. So it all, in the aggregate, it all supports the athletic program and I'm very supportive of Wren. I mean he's been at this a long time. He knows what he's doing, and first and foremost, I'm gonna be a fan.\"",
  "word_count": 7095,
  "scraped_at": "2026-02-14T13:23:09.854855"
}