{
  "article_id": "0cefdc2ab0a4",
  "url": "https://www.blackwhitereadallover.com/2024/1/2/24015311/monthly-juventus-thoughts-december-2023-serie-a-max-allegri-analysis-juventus-women-scudetto",
  "title": "December Monthly Juventus Thoughts : Modern Strikers - Black & White & Read All Over",
  "date": "20240102T200000Z",
  "domain": "blackwhitereadallover.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "European leagues have always had a funny relationship with calendar years. Given that most seasons run from September-ish through May, the end of a calendar year tends to not be particularly significant. Then again, if you’re like me and you don’t believe in/care about New Year’s resolutions, this difference probably doesn’t matter.\nDecember’s Monthly Juventus Thoughts: Modern Strikers\nWe ended 2023 with a lot more optimism than we ended 2022 so, thankfully, there’s a lot to look forward to this year.\nNevertheless, on behalf of everyone here at Black & White & Read All Over, I want to thank you all for supporting this website and our fast-growing podcast. We don’t do this work for the money, so your support means a lot to us. Grazie!\nFighting for the title\nWe started the month of December with a dramatic 2-1 victory over Monza. The first highlight came almost immediately after kickoff as Monza defender Giorgos Kyriakopoulos needlessly dragged down Andrea Cambiaso in the box, which resulted in a Juventus penalty. Unfortunately, goalkeeper Michele Di Gregorio saved Dusan Vlahovic’s penalty and made a truly extraordinary fingertip save off the Serb’s rebounded shot. All that good work was undone just seconds later, as Adrien Rabiot powered in a bullet header from the resulting corner to put his team ahead.\nAfter the opener, Juve manager Max Allegri resorted to the type of tactics that we’ve become used to with him and were most prominently on display in the 1-0 away victory against Fiorentina: defend at all costs and protect the lead. And just like in that game, it seemed like we had done just enough to win the game; Monza managed just one shot on target all game. Unfortunately, the strategy backfired in the 91st minute when Valentín Carboni’s cross flew past everyone in the box and landed in the back of the net for the equalizer.\nBut wait, there’s more!\nA mere three minutes later, deep into stoppage time, man-of-the-match Rabiot dribbled all the way to the byline in a fantastic solo action and cut the ball back to Federico Gatti who, for some bizarre reason, was in the opponent’s box rather than his own. He first comically miskicked the ball but that ended up being a great assist to ... himself, as he blasted the ball into goal on his second attempt to seal a remarkable 2-1 victory!\nNext up, a big home game against the struggling defending champions Napoli. It was a game that showed just how much has changed in the balance of power in merely a few months as Napoli looked nothing like the team that overpowered Juventus and the rest of the league last season. The biggest example of that was when the visitors went on a lightning quick counter attack early in the first half. Victor Osihmen squared the ball for Khvicha Kvaratskhelia who was in a 1-on-1 opportunity against goalkeeper Wojciech Szczesny. With all the time in the world to finish his chance — one that he would have scored every day of the week last season — he somehow blasted his sort-of-shot, sort-of-lob well over the bar.\nGatti then scored his second goal in as many games a few minutes after half time. All credit has to go to Cambiaso for his perfect cross that made it easy for his teammate to head the ball into goal from close range: 1-0. Osihmen equalized for Napoli twenty minutes later as a result of Szczesny’s horrible pass out of defense, but thankfully the Nigerian was offside when he received the ball. For the remainder of the game, the Bianconeri did what it does best: successfully defend a lead. The game ended in a 1-0 victory and revenge for last season’s losses against Napoli!\nUnfortunately, a 1-1 draw away to Genoa brought the team back down to earth. Vlahovic and Federico Chiesa capitalized on a defensive error to win a penalty in the 28th minute; the latter stepped up to score from the spot and put Juventus in the lead. A solid first half led to an extremely poor second half as Genoa emerged from the break with renewed energy. They got a deserved equalizer when substitute Caleb Ekuban caused all kinds of trouble in the box and eventually nodded the ball to Albert Gudmundsson, who volleyed the ball into goal to get his team back in the game.\nAlmost immediately after the equalizer, Genoa keeper Josep Martínez nearly gifted Juventus the lead after another error in the back, but he just about cleaned up the mess he created before Chiesa could get a shot away. The goalkeeper then performed a spectacular save to deny Gleison Bremer’s attempt during a corner. That concluded an eventful second half but disappointing match for the Bianconeri: 1-1.\nThe team then traveled to Frosinone to play the Juventus B team a tough away match against Eusebio Di Francesco’s team. While all eyes were on Matías Soulé, Enzo Barrenechea, and Kaio Jorge — all on loan at Frosinone from Juventus — it was another youngster that caught everybody’s eye. Turkish striker Kenan Yildiz made his full senior debut as he replaced the injured Chiesa in attack. After scoring against Germany in his international debut a few months ago, Yildiz repeated the trick by scoring a stunning solo goal in the 12th minute after Filip Kostic capitalized on a poor pass out of the back by goalkeeper Stefano Turati.\nBut there’s a reason that Frosinone have one of the best home records in the league. In the second half, they put Juventus under serious pressure and got their reward through an equalizer in the 51st minute from Jaime Báez. The Bianconeri steadied the ship and created multiple solid chances, with the biggest ones coming from Vlahovic (saved) and Weston McKennie (crossbar). The two players who got the biggest chances in the second half then combined to score the winner a few minutes before the end. McKennie had all the time in the world to deliver an accurate cross to Vlahovic, who showed incredible technique to flex his neck and generate enough power to his header that flew past Turati in goal. A hard-fought 2-1 victory!\nThe last game of 2023 was a big one: a home clash against Allegri’s doppelganger Jose Mourinho’s AS Roma team. It was an unexpectedly entertaining match as both sides were more adventurous than what we’re used to seeing. The first half was an even match with both teams creating some big chances. Bryan Cristante’s shot deflected off Vlahovic onto the post, Paulo Dybala was inches away from scoring with an outside-of-the-boot shot, Vlahovic had a few good opportunities, and Kostic’s shot was heading towards the back of the net until a heroic clearance by Roma defender Evan N Dicka prevented a goal for the Bianconeri.\nThankfully, Rabiot scored the game’s first and only goal early in the second half as he beat the offside trap and ran onto an exquisite backheeled assist from Vlahovic, who had one of his best games in a while. McKennie had the opportunity to seal the win in the 84th minute but his shot in the 6 yard box went straight at goalkeeper Rui Patricio; if he had directed that shot anywhere else it surely would have been a goal.\nIt didn’t matter though as Juventus held onto their lead and Allegri got a 1-0 victory for the 76th time in his managerial career: a Serie A record!\nJuventus Women\nJuventus Women played only two games in what was a quiet December before the holiday break arrived. The first was a 4-0 victory over Pomigliano. Sara Gunnarsdottir scored the first goal after 30 minutes of play and Lineth Beerensteyn, one of the season’s MVPs so far, scored two in four minutes to give her team a comfortable lead. Barbara Bonansea finished the game off with a goal from a penalty in the 90th minute after Beerensteyn was fouled in the box: 4-0.\nUnfortunately, it wasn’t a happy end to the calendar year as the Bianconere fell to a 1-0 loss away to Sampdoria. Asia Bragonzi, on loan from Juve, scored from a header on one of the few attacks that Samp had in the match. It just wasn’t Juve’s game as they were wasteful and failed to convert the various chances they had. They stay in second place in the league, six points behind Roma.\nModern strikers\nDusan Vlahovic has, for better or (unfortunately quite often) for bad, been one of the most-discussed strikers in the league in 2023. He arrived in Turin with a massive price tag and even bigger expectations. But with only 29 goals and eight assists in 79 appearances, it’s easy to see why he has been the topic of so much (mostly negative) discussion.\nBut something seems to have changed in the last month or two. Not only has Allegri protected Vlahovic more, benching him when necessary to shield him from criticism in the media, but the Serb himself also seems to be succeeding more in supporting the collective rather than necessarily scoring plenty of goals. His hold-up play, first touch, and link-up play has improved significantly and Allegri seems to be happy with his performances even though he doesn’t necessarily score a lot.\nIt reminds me of the discussion about “modern” strikers. In the past teams relied on strikers to do one thing and one thing only: score goals. It didn’t matter if they had five touches all game and covered the same square meter of grass throughout the 90 minutes: as long as at least one of the few touches they had was a goal.\nBut teams, coaches, and even fans expect more from strikers these days. We want them to score, of course, but it seems like we’ve placed an almost greater priority on them being an active part of the team’s play. We want them to pass well, link up with midfielders, and be an active part (rather than result) of attacks. Dare I say, even, that some would be willing to accept strikers who score a below average number of goals in exchange for doing the aforementioned things excellently.\nPerhaps, then, Vlahovic has found a new path to silencing his critics. If he can further develop his qualities as a modern striker, while still scoring the odd goal here and there, there’s a chance he can still have a very successful career with the Bianconeri.\nICYMI: Super Teams\nWe’ll end this month’s review with the big news that came out of Luxembourg a few weeks ago. The European Court of Justice (ECJ) ruled that:\n“FIFA and UEFA rules making any new interclub football project subject to their prior approval, such as the Super League, and prohibiting clubs and players from playing in those competitions, are unlawful.”\nIt’s important to note that this doesn’t mean that the ECJ is endorsing or approving the Super League. They’re merely saying that, based on current EU competition law, FIFA and UEFA are “abusing a dominant position” through their attempts to block the Super League and punish clubs and players who want to play in it.\nIn the short-term, not much changes. Various clubs/organizations, including Inter, Manchester United, Atletico Madrid, Bayern Munchen, the Premier League, and others, quickly released statements that repeated their opposition to the Super League. Unsurprisingly, Real Madrid and Barcelona reaffirmed their support for it.\nBut what happens when the dust settles and people forget, as they inevitably always do, about this controversy? Call me a cynic, but I expect the other clubs to eventually change their minds once fans have calmed down. Granted, “eventually” might mean years or even more than a decade, but I believe it will, unfortunately, happen.\nLet’s hope I’m wrong.\nMost Popular\n- Report: Juventus could turn to Guglielmo Vicario in potential summer goalkeeper shake-up\n- Round 25: Juventus vs. Inter Milan match preview\n- Analyzing Juventus’ upcoming Champions League matchup vs. Galatasaray\n- Reports: Khephren Thuram a sudden doubt to face Inter due to bone bruise\n- Report: Juventus open talks with Pierre Kalulu over new contract through 2030",
  "word_count": 2020,
  "scraped_at": "2026-02-14T12:41:29.053905"
}