{
  "article_id": "0d139d831af3",
  "url": "https://bleacherreport.com/articles/25368495-mikaela-shiffrin-makes-history-world-cup-title-ahead-2026-winter-olympics",
  "title": "Mikaela Shiffrin Makes History with World Cup Title Ahead of 2026 Winter Olympics",
  "date": "20260126T211500Z",
  "domain": "bleacherreport.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Featured Video\nHarper's Rising Stars Game-Winner 🔥\nMikaela Shiffrin Makes History with World Cup Title Ahead of 2026 Winter Olympics\nWhile Mikaela Shiffrin will be under the spotlight during the 2026 Milano Cortina Olympics, she is already entering the Games as a record-holder.\nNancy Armour of USA Today noted the American won her seventh World Cup slalom of the season Sunday, which clinched this season's title. It is her record ninth slalom season title and broke a tie with Ingemar Stenmark (slalom and giant slalom) and Lindsey Vonn (downhill) for the most season titles in a single discipline.\nShiffrin won her latest slalom race by 1.67 seconds ahead of Switzerland's Camille Rast, continuing a dominant season that has seen her place first in all but one race.\nAnything less than slalom gold in the Olympics would be a stunning result at this point given her incredible season, although nothing is guaranteed at the Games. After all, she entered the 2022 Beijing Olympics as the slalom gold-medal winner in 2014 and the giant slalom gold-medal winner in 2018 but failed to win a single medal.\nShe posted Did Not Finish results in the grand slalom, slalom and combined races in Beijing while also finishing in ninth in the Super-G and 18th in the downhill.\nIt was a disappointing showing but one that could serve as a motivating factor this time around in Milano Cortina.\n\"The Olympics is a totally different challenge. I've had great Olympics, I've had tough Olympics,\" Shiffrin said.\n\"I try to go in with an open mind, good spirit, trust in my team. They've been amazing all season. We're coming in with some strong athletes so think it's time to enjoy that.\"\nRegardless of what happens at the Games, she is one of the greatest skiers of all-time and a record-setter in the sport. Now she will look to add to her already illustrious resume with a memorable performance in Italy.",
  "word_count": 323,
  "scraped_at": "2026-02-14T12:38:40.016274"
}