{
  "article_id": "0d3b4374b4e5",
  "url": "https://www.theglobeandmail.com/business/article-business-brief-ccm-bauer-sales-signal-a-shift-change/",
  "title": "Business Brief : CCM , Bauer sales signal a shift change",
  "date": "20241004T050000Z",
  "domain": "theglobeandmail.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "News this week that CCM and Bauer have found new owners comes at a pivotal moment in the business of hockey. More on that below, plus a look at why the markets aren’t a mirror of geopolitical shocks. But first:\nIn the news\nMisconduct: Magna International Inc. has launched an internal investigation into founder Frank Stronach’s history at the company in response to his arrest on sex-assault charges.\nOpen house(s): The Toronto housing market was deluged with homes for sale in September as sellers decided to list their properties after months of no action.\nRare opportunity: The Saskatchewan Research Council is attempting to go head-to-head with China and prove the case for private investment in rare earth minerals by building North America’s first rare earths processing plant.\nQuartz shuartage: Two North Carolina facilities that manufacture the high-purity quartz used for making semiconductors have been shut down by Hurricane Helene – with no reopening date in sight.\nIn focus\nThe changing economics of hockey\nOne of Canada’s longest-fought corporate battles is taking its fight outside, changing hands to new owners seeking to capitalize on hockey’s growth potential in new markets.\nBauer and CCM both came off the auction block this week, ending months of bidding for two companies that account for about 90 per cent of the North American hockey-equipment market.\nOn Tuesday, Andrew Willis reported that CCM – a company that started making skates from the scrap steel of its bicycle-making business – was being sold to a Swedish asset manager. That news came a day after Bauer, also founded in the early decades of hockey’s booming popularity in Canada, was moving into the control of Fairfax Financial Holdings.\nBauer and CCM can both trace their roots to Ontario at the turn of the 20th century, and have been battling for the hearts and feet of hockey-mad Canadians ever since. But both have run into similar challenges in recent years as families have moved away from the arena in favour of less capital-intensive pursuits such as basketball and soccer.\nYouth participation across the country fell by nearly 33 per cent over the past 15 years – a decline that was already under way well before the pandemic kept kids home.\nBauer chief executive Ed Kinnaly acknowledged that problem in 2022: “The number of kids getting involved in hockey in Canada is spiralling downward … but nobody’s talking about that.”\nIf no one was talking about it in those exact terms, perhaps they were addressing it another way: Anyone who has spent time in a rink will know they can safely fill awkward pauses in conversation with commentary on the price of hockey sticks these days.\nThat’s been true for decades now, but hockey retailers are increasingly feeling the pain. Even in Canada, the growing costs of equipment, ice fees, tournament fees, fee fees, has finally crossed a line.\nThere are cheerier trends at play: Since the first International Ice Hockey Federation World Women’s Championship in 1990, female participation in the sport has skyrocketed.\nAnd for the NHL, there really is hope. If its success in the U.S. hasn’t met its ambitions, the league still has Europe to dream about. Perhaps that’s why the most interesting thing about tomorrow’s tilt between the New Jersey Devils and Buffalo Sabres isn’t the game, or even the fact that it’s the season opener – but that it’s being played in Prague.\nThat’s a matter of perspective, depending on how much you root for the Devils or Sabres, but it’s likely true for the NHL and the new owners of CCM and Bauer. They’ll take growth anywhere they can find it, especially if they can’t even count on Canada any more.\nEarlier this year, after Willis first reported that CCM’s owner was exploring a sale, he noted that hockey is a “low-growth sport, with the number of players in Canada declining, in part because of the cost of gear.”\nIt might seem counterintuitive, then, to learn the owners of both CCM and Bauer were advising potential buyers to hike equipment prices to increase revenues. I wasn’t in on the negotiations, but I’d have to guess those price hikes would be aimed at families who don’t mind paying more for higher-end equipment as long as their child either graduates to the NHL (and by then might be afforded a discount at Sport Chek) or moves along to other interests.\nBut what was that again about the number of kids playing hockey spiralling downward? And what are the odds those are the very kids that hockey, and the makers of its equipment, need the most?\nViews\n- Government, airlines must pay for consumer advocates in complaints process.\n- Income inequality is our greatest threat, as it’s fuel for many other threats.\n- Behold the dairy lobby’s power, as Bloc holds Liberals hostage over supply management.\nCharted\nMind the gap\nSo, we have the United States barreling toward an election that could result in massive tariffs slapped on trade partners; a generational strike halting imports and exports along the U.S. East and Gulf Coasts that threatens to squeeze supply chains for months, if not years; and a battle in the Middle East building at a deeply uncomfortable pace.\nWhy, then, do markets look like this?\nAre investors indifferent to human suffering? The rising cost of goods that might arise from supply chain disruptions? How can anyone look around at the world and think: Buy!\nPut simply, Tim Shufelt writes, this is how the stock market is built: All of those dynamics come into play, but only when they begin to have an impact on a notable company’s earnings, or spread into global economic pain. Geopolitical strife is baked into the price of markets like the S&P 500, which closed yesterday near an all-time high.\n“Over a century of conflict, the stock market has demonstrated a near-immunity to geopolitics,” he writes. “From the Cuban Missile Crisis to Russia’s invasion of Ukraine, any negative reaction in stocks is typically recouped within days. Only when the global economy is threatened do these episodes tend to have any lasting financial impact.”\nMorning markets\nGlobal stocks dipped on Thursday and oil prices rose as markets weighed the risk of a widening Middle East conflict.\nWall Street and TSX futures pointed down ahead of the opening bell.\nOverseas, the pan-European STOXX 600 was down 0.53 per cent in midday trading. Britain’s FTSE 100 gained 0.39 per cent, Germany’s DAX dropped 0.39 per cent and France’s CAC 40 lost 0.68 per cent.\nIn Asia, Japan’s Nikkei gained 1.97 per cent, while Hong Kong’s Hang Seng lost 1.47 per cent.\nThe Canadian dollar traded at 73.88 U.S. cents.",
  "word_count": 1112,
  "scraped_at": "2026-02-14T12:19:09.320837"
}