{
  "article_id": "0d424cdaf6de",
  "url": "https://www.zdnet.com/article/your-apple-watch-is-getting-an-upgrade-here-are-the-best-features-in-watchos-11/",
  "title": "Your Apple Watch is getting an upgrade - here are the best features in WatchOS 11",
  "date": "20240621T191500Z",
  "domain": "zdnet.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Your Apple Watch is getting an upgrade - here are the best features in WatchOS 11\nAt its iPhone launch event on Monday, Apple not only unveiled the Watch 10 and Ultra 3 but shined a light on some of the new features coming with WatchOS 11. The next update headed to your Apple Watch has a handful of new features that aim to make the wearable on your wrist even better.\nAlso: Buying an Apple Watch Series 10? Consider these 3 features before upgrading\nBelow, we break down the coolest new features coming to your Apple Watch in WatchOS 11, as well as when you can expect them all to roll out. Notably, WatchOS 11 won't be supported by the Apple Watch Series 4, Series 5, or the original Apple Watch SE. If you have one of those watches, it's time to upgrade.\n1. Track your strain and recovery with Vitals and Training Load\nOne of the biggest additions to the Apple Watch in WatchOS 11 is the new Vitals app, which helps you explore and contextualize your health by tracking your heart rate, respiratory rate, wrist temperature, and blood oxygen while you're asleep. These metrics are processed through an algorithm and displayed on a chart the next morning to tell you whether you're in your normal range.\nIf two or more metrics are out of whack, you'll get a notification alerting you that certain lifestyle changes, alcohol consumption, illness, or other factors could contribute. It's essentially a recovery tracking tool like what Whoop and many other fitness bands offer but in an easier-to-use package.\nAlso: The best Apple Watches of 2024: Expert tested and reviewed\nTraining Load is also coming in WatchOS 11, allowing you to keep track of the strain you put on your body during workouts. It'll compare the last seven days of workouts to the last 28 days to indicate whether you're making meaningful progress toward your goals. Each workout you record will receive an effort rating on a scale from 1 to 10 based on a new algorithm that measures your activity and gauges intensity based on things like age, height, weight, heart rate, elevation, and more.\nSerious athletes will likely be drawn to these features since this is the first time Apple has shipped recovery and strain tracking on its watches. But plenty of casual users may also find these features useful when in the process of adopting healthier habits.\n2. Pause your rings\nEver get sick one day or just need a break, but you're concerned about not keeping your streak to close your Apple Watch's rings? Now, you don't have to worry about missing out on the day's progress. In WatchOS 11, Apple is giving you the ability to pause your rings for a day, week, month, or longer until you're ready to get back in the game.\n3. Better support for pregnancy\nWatchOS 11 will help those who are pregnant log their physical and mental health during their pregnancy, as well as display their gestational age and log any symptoms they frequently feel. Your watch will also advise you to review features like high heart rate notifications since, when pregnant, your heart rate tends to increase.\nAlso: These Oura Ring updates are all-in on women's health\nThe feature plays into the Apple Watch's cycle-tracking experience, so everything remains cohesive and easy to find.\n4. More widgets for your Smart Stack, including Live Activities\nThe Smart Stack, introduced in WatchOS 10, is improving slightly with some new widgets.\nApple is adding one for Shazam, Photos, Distance, and more. Plus, Smart Stack can now suggest widgets based on the time of day, the date, your location, common daily routines, and more to ensure contextual information is more accurately displayed. There are also some widgets that are interactive, so you can control apps directly from Smart Stack.\nPlus, Live Activities are coming to Smart Stack, so you can keep tabs on live events, Ubers, food orders, and more on your wrist.\n5. The Photos face, powered by machine learning\nThe Photos face is one of the most popular faces on the Apple Watch, given its high level of customization. And it's getting a facelift (pun intended) with WatchOS 11.\nYour watch will use machine learning to analyze your photo library and find the best snaps to use as a watch face based on aesthetics, composition, and facial expressions. Apple's algorithm will then optimize the image for the watch face and add depth effects, different colored backgrounds, fonts, and more. You can customize it on your own to your heart's content, plus get treated to a new look every time you raise your wrist.\n6. Double Tap now works with any app\nOne of the biggest complaints with the Apple Watch Series 9 and Ultra 2 was how limited Double Tap was. Up until now, the feature has only worked in select apps that supported scrolling by tapping your fingers. But now, it's expanding to all apps and third-party apps with WatchOS 11. Apple will also roll out the Double Tap API, which will let developers implement the feature in their apps.\n7. Check In comes to your wrist\nWith WatchOS 11, Apple is adding Check In. Originally launched in iOS 17, Check In allows you to keep track of a friend or loved one by having them confirm when they've reached their destination or have finished something like a gym session. Check In works within the Workout app and Messages.\n8. Tap to Cash for quick payments\nMove over, Venmo. Also in iOS 18, Apple is bringing Tap to Cash to WatchOS 11. Tap to Cash lets you hold your Apple Watch near another watch or iPhone to quickly send Apple Cash to someone else.\nAlso: How to use 'Tap to Cash' to send money in iOS 18\n9. Translate on the fly\nApple is adding the Translate app to WatchOS 11, allowing you to translate in any of 20 supported languages. Previously, the app was available only on the iPhone and iPad. When you're traveling abroad where a supported language is spoken, it'll automatically pop up in your watch's Smart Stack. Otherwise, choose the target and source languages and speak the words you want to be translated. Tap the Play button, and the translation plays through your watch's internal speaker.\n10. Improved workout tracking for GPS-specific workouts\nSoccer, American Football, Australian Football, Outdoor Hockey, Lacrosse, Downhill Skiing, Cross Country Skiing, Snowboarding, Golf, Outdoor Rowing, and other activities are being updated in WatchOS 11 to take advantage of enhancements in GPS positioning for more accurate results. You can also view your route maps for more workout types.\n11. Tickets in your Wallet get an upgrade\nIf you often use your digital wallet on your Apple Watch, you'll be intrigued by the improved ticketing experience. In WatchOS 11, Apple is adding more information on the event you're going to see, such as when the venue opens, what time it starts, and more. Plus, once you've loaded a ticket into your wallet and that special day approaches, you'll find seating information and other notable tidbits in a widget in your Smart Stack automatically.\nWhen does WatchOS 11 come out?\nRight now, WatchOS 11 is available as a public beta. The software update will officially roll out to all supported Apple Watches on Monday, September 16. You'll first need to update your iPhone to iOS 18, which will launch on the same day.",
  "word_count": 1247,
  "scraped_at": "2026-02-14T13:39:31.601366"
}