{
  "article_id": "0d507f115a23",
  "url": "https://www.thepinknews.com/2025/04/11/ben-stilwell-anti-gay-chants-millwall-fined/",
  "title": "Millwall charged by FA over anti - gay Ben Chilwell chants",
  "date": "20250411T140000Z",
  "domain": "thepinknews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Millwall charged by FA over anti-gay Ben Chilwell chants\nMillwall FC has been fined after fans made anti-gay chants towards Crystal Palace player Ben Chilwell.\nThe Football Association (FA) announced it has charged the south-east London team following an investigation into homophobic chants made by supporters during a FA Cup quarter-finals match on 1 March.\nDuring the match, which saw Crystal Palace beat its rival team 3-1, fans reportedly began singing a homophobic chant during the fifth and 20th minutes targeted specifically at Chilwell, who is on loan from Chelsea.\nAn FA spokesperson confirmed that Millwall had been charged with “misconduct” over failures regarding crowd control, adding that the club has until 16 April to respond.\n“The club failed to ensure its spectators and/or supporters (and anyone purporting to be supporters) conduct themselves in an orderly fashion and don’t use words of behave in an improper, offensive, abusive, indecent, or insulting way,” they continued.\nResponding to the fine, Millwall Football Club strongly condemned the chants against Ben Chilwell while emphasising its “zero-tolerance policy” against discrimination “of all kinds.”\n“The club remains committed to working tirelessly to eradicate homophobic chanting, and any other form of discriminatory abuse, from the sport,” they continued. “Everyone associated with Millwall Football Club has a responsibility to act as an ambassador of the club. Passion, loyalty, family, uniqueness defines the support for the club and discrimination of any kind is not tolerated.”\nOver the last year, FA has cracked down on homophobic chants during football matches in the UK after the controversial “Chelsea rent boy” chant was used against former player Frank Lampard.\nThe governing body stated in 2023 that clubs across its various football leagues, including the Premier League and the Women’s Super League, would be fined or subject to “formal disciplinary action” if fans used the chants during matches.\nThe Wolverhampton Wanderers became the first football club to be sanctioned over its supporters using homophobic chants in July 2023. The club was fined £100,000.\nSince then, clubs such as Tottenham Hotspurs, Leeds United, and Luton Town FC have been fined for homophobic chanting.\nSpeaking to PinkNews following the “Chelsea rent boy” controversy, the FA said it was “determined” to drive homophobia out of its football leagues, adding: “We continue to work closely with the Crown Prosecution Service (CPS), as well as the UK Football Policing Unit, in relation of the use of [the Chelsea rent boy chant].”",
  "word_count": 403,
  "scraped_at": "2026-02-14T12:58:20.192948"
}