{
  "article_id": "0d563052924d",
  "url": "https://bernews.com/2024/06/2024-denton-hurdle-award-student-winners/",
  "title": "2024 Denton Hurdle Award Student Winners",
  "date": "20240621T154500Z",
  "domain": "bernews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "2024 Denton Hurdle Award Student Winners\nThe 2024 Denton Hurdle Memorial Awards were held, with over 50 student athletes recognized for their accomplishments\nA spokesperson said, “Warwick Academy students claimed five of the six categories at the 2024 Denton Hurdle Memorial Awards held at Warwick Academy. A total of 53 student athletes were honored at the award ceremony which honored the late PE Teacher.\n“The Primary School Girls winner was Naomi MacGuinness. The Warwick Academy student had a year to remember. MacGuinness was impressive at the BSSF Primary School track and Field Championships when she broke two records. First she broke 23-year-old 800-meter record before shattering the Randy Benjamin Mile record by almost 24 seconds. She also won the Primary School division in the Front Street Mile in January and the Heritage Day junior classic in May while breaking yet another record. MacGuinness is also a keen footballer and made an impactful part in Warwick Academy winning the Primary School Girls seven a side tournament and KO Cup. She was also a member of the West All Star team. She was the team’s top scorer and scored the winning goal in the final of the tournament.\n“Honorable Mention in the Primary School Girls Division went to Cush Belboda from Purvis Primary and Evelyn Fahy from Somersfield Academy.\n“Belboda is captain of Purvis house and a member of the school dance group. She captained both the netball and football teams. She led Purvis to a third place school finish at the 2024 relay classic. She was also named the BSSF All Star MVP in both the football and netball All Star games.\n“Fahy is head sports girl at Somersfield Academy and is a prefect. She is a member of Harbour Amateur Swim Club and M.A.A.C jr running club. She represented her school in track and field, football, netball and cross country and was an all-star in netball.\n“Primary School Boys winner was Jemani Scott from West End Primary. Scott was crowned Champion Boy at the recent BSSF Primary School Track and Field Championships after winning the 200 meters and finishing second in the 400 and 800 meters. Scott also represented West End Primary in football, cricket and basketball. He is a member of Pacers Track Club and has a yellow belt in jiu jitsu. Off the field Scott is a member of the school choir and is West End Primary’s head boy and gold house captain.\n“Honorable mention in the Primary School Boys division was awarded to Cyme Dowling from Francis Patton School and Ajani Trott from Paget Primary.\n“Trott is the deputy head boy, house captain and prefect at Paget Primary. He served as captain for their football team. He was the BSSF 400-meter champion and came second in the fastest kid on the rock race.\n“Dowling is a junior prefect in waiting at Francis Patton which has P7 students. He is an active member for PHC boys football and St. David’s cricket teams. He also enjoys track and field and won the 2024 Randy Benjamin Memorial Mile.\n“Antoinette Barry was named the Middle School Girls winner. Warwick Academy’s Barry led her team to second place finishes in the middle school girls six a side and knock out cup finals. She represented Bermuda in the Caribbean Football Union under 14 championships in 2023. She is currently a member of the under 15 national academy. She was a member of the PHC Lady Zebras who lifted the 2024 Kappa classic Under 13 division. She was named defender of the year for league champions PHC Lady Zebras. Barry was also a finalist for the BFA Girl referee of the year.\n“Gabriella Cechini from Somersfield Academy was the 2024 runner up. Cechini excels in swimming and running and is a member of Harbour Swim Club and MAAC jr running club. She was the 2024 Middle School Girls Front Street Mile Champion and also won the 2024 Butterfield and Vallis 5k, The 2024 Middle School Cross Country Championships and the Middle School 800 and 1500 meters. She was also named the 2024 short course swimming championships 13-14-year-old female champion.\n“Warwick Academy swept the Middle School division when Zydon Lightbourne Furbert was named the Middle School Boys winner. Lightbourne Furbert also had a record breaking track performance at the BSSF Middle School track and field championships. He twice broke the over 13 boy’s records in the 200 and 400 meter events. He would go on to be crowned champion boy after also winning the 100 meters. Lightbourne Francis also was the 2024 Front Street Mile. He also excels in football where he led Warwick Academy to wins in the six a side tournament and knockout cup. He was the 2023 BFA under 13 division MVP and currently is a member of the Under 15 National Academy.\n“The Middle School boy’s runner up was Seruno Basden from the Whitney Institute Middle School. Basden participates in a wide range of activities. He was one of the leaders on the Whitney track team claiming a silver medal in the 400 meters. He was also the creator and teacher of the Whitney Institute drumline. He is a member of Pacers Track Club and also competes in taekwondo, equestrianism, tennis and is involved with dog clubs.\n“Adriana Argent from Warwick Academy won the Senior School Girls Division. The Deputy head girl, prefect and house captain was a regular fixture on any Warwick Academy female team. Argent was rewarded with the 2024 Bermuda Outstanding Teen Award for Sport. Argent has won medals at the Central American and Caribbean Swimming Championships and the CARIFTA Swimming championships. She also represented Bermuda in track and field and cross country. She can also be seen leading Warwick in football, netball, basketball and volleyball. Argent has won the Principals List for Academics from 2017-2024 and earned 10 GCSE passes, all at the highest grade of A*.\n“Katherine Bean Rosario from Saltus Grammar School was the Senior Girls runner up. Bean Rosario is currently competing for a spot on the Leeward Islands under 19 cricket team and could not make the ceremony. She is the Saltus head girl and prefect and house captain. She is a current member of the Bermuda Senior Women’s National Football Team and has played at the under 15, 17 and 20 levels. She has committed to Monroe College in New York where she has earned a scholarship to play football.\n“Matthew Banner gave Warwick Academy their fifth win of the night when he won the senior boys division. The Warwick head boy was also a student council member and part of the Warwick Academy debate team. He has attained the Duke of Edinburg Silver award and was part of the National debate team which competed in Vietnam in 2023. Banner also excels in badminton, basketball and is a national team member in volleyball where he won the 2023 most improved player. He earned his place on the Principals list for Academics, Community Service and Sports and earned nine GCSEs.\n“The runner up was Anijahe Santos Martin from Mount Saint Agnes Academy. Santos Martin was MSA’s Student Council president and National Honor Society Treasurer. He captained MSA in football, basketball and volleyball. He is a regular for the North Village senior men’s team and is a member of the under 18 national indoor volleyball team and the over 19 outdoor national team. He won the 2024 sports award at the Outstanding teen awards.”\nRead More About\nCategory: All",
  "word_count": 1245,
  "scraped_at": "2026-02-14T12:47:39.156791"
}