{
  "article_id": "0d5b5d45d80a",
  "url": "https://www.express.co.uk/comment/expresscomment/2011473/lucy-letby-facts",
  "title": "These are the facts on the Lucy Letby case - it tells us everything",
  "date": "20250207T170000Z",
  "domain": "express.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "These are the facts on the Lucy Letby case - and it tells you everything you need to know\nA press conference has reignited the debate over Lucy Letby's conviction, as experts claim her innocence.\nLucy Letby 'didn’t murder a single baby', screamed one headline. 'No murders were committed,' said another. Talk about misrepresentation of the facts! This was nothing but an opinion from a group of self-appointed “experts” who don’t believe this country’s most prolific baby killer is guilty.\nAnd they’re entitled to think that, but they cannot present it as fact.\nDon't miss: Lucy Letby whines she's 'wasting away' as she befriends notorious killer\nDon't miss: The 3 crucial steps killer nurse Lucy Letby must make to secure freedom\nThe facts are that Lucy Letby was convicted of seven murders and eight attempted murders. Yet at a staged press conference this week, these “experts” tried to present as fact that Letby is innocent – causing huge distress to the parents of the babies she killed in the process.\nThese “experts” have never clapped eyes on Letby. They never saw her 14 days in the witness box. They didn’t see the Post-it notes where she writes: “I am evil. I did this. I don’t deserve to live.”\nThey didn’t hear the testimony of seven respected consultants who worked with her and are convinced beyond doubt she did it.\nThey weren’t in the Appeals Court to see Letby’s TWO appeals thrown out and to hear one judge say Letby’s conviction rested on “circumstantial AND medical evidence being considered by the jury in its totality”, which this panel has not done.\nBut hey, they just KNOW she’s innocent and are demanding her immediate release?\nHow dare they! Those guilty verdicts came after a harrowing ten-month trial and they were backed up by the Appeal Court which not only threw out an appeal against Letby’s 14 convictions – seven for murder and seven attempted murders – but also another for the attempted murder of a newborn.\nBut still, these “experts” together with Free Letby’s cheerleader-in-chief David Davies, aren’t having it. Davies says we should all be listening to chief expert, a Canadian called Dr Shoo Lee who lives in Canada and is retired. I point out he’s retired because the doctor who gave evidence against Letby in the original trial, Dr Dewi Evans, is being criticised for being “retired” and not a working doctor.\nWell Shoo isn’t a working doctor either, yet we’re supposed to believe him when he says all the babies died of natural causes or bad medical care. And he says the countess of Chester Hospital, where the murders occurred, was so bad that had it been in Canada it would have been closed. No it wouldn’t because Canada’s own hospitals are in chaos and have been for years and among the biggest causes of death are medical mistakes.\nDon't miss: Lucy Letby birthday ‘celebration’ sparks fury as supporters claim she's innocent\nDon't miss: Jeremy Hunt apologises to Lucy Letby victims' families over investigation delay\nSo why are we taking lectures about our hospitals from a bloke who is oblivious to the problems of those in his own country? And if he’s such a fantastic expert, why didn’t he give evidence at the original trial?\nWhat this panel is doing is dangerous because it’s presenting as fact their opinion that hasn’t been tested in court. And as cheerleaders for Letby’s release, they are crucifying the devastated families of those dead babies who have said publicly they KNOW who their babies’ killer is. And they have accused those determined to free Letby as grossly disrespectful.\nOne of the mums dismissed what this panel did this week as “a publicity stunt” and said she’d emailed David Davies and told him: “You don’t speak for us. Nor does your panel. We believe in the British justice system.”\nHow dare these people presume to know more than a jury which had dissected the evidence for ten months and was directed by one of the country’s most experienced and respected judges. And I’m sick of listening to people who aren’t across the facts but have decided Letby’s innocent because, A) she was an overworked nurse and, B) because this “girl next door” surely couldn’t be capable of mass murder?\nAs for these experts – Dr Shoo Lee, seems more interested in correcting facts about his 1989 paper on air embolism in babies than the totality of the evidence around Letby.\nAlso panel member, Neena Modi, who it’s been suggested could have a vested interest in suggesting poor medical care was to blame for the baby deaths because she was in charge of the Royal College of Paediatrics and Child Health group when it conducted a discredited review into the countess of Chester hospital.\n“It was the tool which delayed the police being called in,” said a source.\nWe have a justice system in this country and, yes, it’s flawed. But it’s a damn sight safer than a self-appointed panel of experts acting as judge and jury without ALL the facts.\n++++++++++++++++++++++++++++++\nI’m desperately trying to give a damn as to why Hollywood diva Blake Lively (married to Ryan Reynolds) and actor/director Justin Baldoni are the talk of Tinseltown thanks to a spat which has ended in them suing each other.\nShe’s suing him for sexual harassment and mounting a smear campaign. He’s suing HER and Reynolds for hijacking the production of the film, It Ends With Us, and manipulating a smear campaign against him (double yawn).\nFrom where I’m sitting, it’s two spoiled, not-very-great Hollywood actors trying to show who has the biggest you-know-what.\nAnd it’s boring…\n++++++++++++++++++++++++++++++\nHealth Secretary Wes Streeting says diversity staff in the NHS are promoting anti-whiteness. Well that’s easily solved. He needs to find the ones who are doing it – and sack them!\n++++++++++++++++++++++++++++++\nActor Brian Cox, who calls himself a democratic socialist, hasn’t got much time for Labour’s Kier Starmer. Having met him on Question Time, Cox says: “He’s like a fart in a bath.”\nWhich I’d say sums up the feelings of an entire nation.\n++++++++++++++++++++++++++++++\nWhen a senior journalist asked Peter Mandelson a perfectly legitimate question about his friendship with the paedo, Jeffrey Epstein (who called him “Petie”), Mandy told him to “f*** off”.\nI’m wondering if Petie’s response would be the same if Trump asked him the question. I’m guessing it would be answered with Mandelson on his knees licking Mr Trump’s boots and begging his forgiveness…\n++++++++++++++++++++++++++++++\nThe halfwits in charge of the University of West England have slapped 220 trigger warnings on the works of Shakespeare.\nThey include accusations about adultery, references to wild animal attacks, family trauma, psychological distress, mourning, storms, and popping balloons\nIt might have escaped the notice of these ejits that all the aforementioned (apart from wild animal attacks) are aspects of everyday life which they are teaching students is terrifying.\nIt’s no wonder we now have a generation of cowering, fragile, snowflakes who need a trigger warning about popping balloons and can’t even do a day’s work because it’s bad for their mental health. Aren’t Universities supposed to prepare young people for life, not render them scaredy cats who are terrified of it?\n++++++++++++++++++++++++++++++\nDonald Trump has shown how easy it is to deal with the trans mob. He's smacked down all the extremists who insist blokes only have to THINK they’re women to be allowed to compete in women’s sport.\nSo surrounded by scores of girls and young women, he signed an executive order banning all trans women from women’s sport in high schools, universities and grassroots sports but most importantly in the 2028 Los Angeles Olympics.\nSo well done to all those frothing-at-the mouth trans agitators everywhere who were so determined to trample over women’s rights – because what Trump has just done would never have been possible without your lunacy…\nMeanwhile back in the UK, we still have a gutless PM too scared to say whether only women can have a cervix.\n++++++++++++++++++++++++++++++\nLeo Woodall, Bridget Jones toyboy in the new movie Mad About The Boy, says he can no longer use public transport because he makes husbands jealous.\nWoodall really needs to give his (big) head a wobble because while he’s pretty-ish, he's no Brad Pitt. If Woodhall needs justification for not using public transport now he’s a “star” let the reasons be a bit more real – likw because it’s a dirty, sweaty cesspit which herds people like cattle and where weirdos and perverts are allowed to run amok.\n++++++++++++++++++++++++++++++\nThe buffoons in Greater Manchester Police have published the personal details of the man who burned a Quran in the street. And in doing so they have wilfully put a target on his back. So if anything happens to this man it’ll be on them.\nBut here’s a question – if someone had burned a Bible on the streets of the UK would the police have even bothered turning up? One law for one religion in this country and another for all the rest…\n++++++++++++++++++++++++++++++\nLocal authorities who are currently jacking up your council tax by 10% and telling you your bins will be emptied just once a month because they’re skint are probably among those currently funding (with YOUR money) lots of life’s little luxuries for migrants – Playstations, yoga classes, tickets to football matches, driving lessons. Oh, and teaching them circus skills, although I’m not sure how many need lessons in performance art as they’re already adept at pretending to be fleeing war and persecution.\nBut it’s no damn wonder they’re coming in their thousands.",
  "word_count": 1605,
  "scraped_at": "2026-02-14T14:15:52.994434"
}