{
  "article_id": "0d8bee5b4162",
  "url": "https://www.basingstokegazette.co.uk/news/23795156.basingstoke-hospital-worker-faces-backlash-offensive-comments/",
  "title": "Basingstoke hospital worker faces backlash over offensive comments",
  "date": "20230918T093000Z",
  "domain": "basingstokegazette.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A BASINGSTOKE hospital worker has been publicly shamed on social media for offensive comments made on his account after his post about comedian Russell Brand went viral.\nRussell Simmonds, who has worked in theatre at Basingstoke hospital for 32 years, had a post on his X account, formerly known as Twitter, commenting on the rape and sexual assault allegations made against Russell Brand, saying: “Blokes. This #RussellBrand stuff could happen to any of us.”\nThe 51-year-old father-of-two added: “C4dispatches Women have an immeasurable power when it comes to sexual assault etc. Men are ruined, whether guilty or not. Weaponising lies are just as damaging as the truth. Innocent until proven guilty.”\nREAD MORE: Mum pays tribute to daughter, 17, from Basingstoke who died suddenly after night out\nHis posts received a huge backlash on the social media platform, with hundreds of people calling him out for his controversial views.\nHowever, it then came to light that his previously public X account and Facebook page contained a string of offensive comments which have since been shared with his employers at Hampshire Hospitals NHS Foundation Trust (HHFT).\nCommenting on a Sky News article about 409 migrants reaching UK shores in small boats in September 2020, his X page said: “Just shoot them in the face.”\nA post from July 9, 2011, said: “Well done England’s women. Now get in that kitchen and do what you’re best at.”\nIn another, referring to female commentators on Match of The Day, he posted: “Please just do one. It sounds s***. It is s***. Please stop. You’re ticking a box that was never there to be ticked.”\nSEE ALSO: Basingstoke schools set for catchment area shake-up ahead of new primary opening\nResponding to a Sky News article about the Duchess of Sussex opening up about ‘almost un-survivable’ online abuse, he posted: “Deserved.”\nIn July 2022, Mr Simmonds’ X account had a post saying: “So there’s a new halal shop opening in our town centre. F***. RIGHT. OFF.”\nPosting about the London terrorist attack in March, 2017, his X page said: “The irony of watching our emergency services battling to keep that w***** alive earlier. Rot in hell c***.”\nPressure mounted on HHFT to respond, with dozens of people sharing screenshots of the offensive posts with the trust.\nJust four months ago, the trust presented Mr Simmonds with a WOW! Award, which it said is given to staff to recognise their ‘dedication to living our CARE values’.\nPosting on LinkedIn about Mr Simmonds at the time the award was presented, the trust said: “Russell regularly works night shifts. He always starts work incredibly early to ensure his colleagues finish on time. He then stays late in the morning to ensure continuity of care, staying with patients he has escorted to theatre until they are asleep.\n“Russell never claims for these extra hours he works, saving the trust money.”\nThe trust, which follows Mr Simmonds’ Twitter account, added: “He genuinely always goes the extra mile for others.”\nFurther posts on Mr Simmonds’ X and Facebook page appear to show his dislike for female sports players, along with misogynistic comments referring to women as ‘birds’ and saying they are ‘useless at sport’ and should ‘get back home’ to clean the toilet.\nHis social media pages also contain frequent use of offensive words which are unprintable, as well as violent references.\nIn response to a BBC News article about two women who were left covered in blood following a homophobic attack on a bus in June 2019, Mr Simmonds’ X account referred to finding them and ‘cracking their ribs’. It is not clear whether the post was referring to the attackers or victims.\nIn a string of posts about the Lionesses England football team, he said: “Never mind? They were f****** crap. They’re not even good looking. Female w******.”\nSEE MORE: Basingstoke nursery compromising children's health and wellbeing served legal notice\nFollowing the backlash on social media, Mr Simmonds’ X account was made private on Sunday, September 17.\nHHFT posted on its X page the same day saying: “At HHFT there is zero tolerance policy towards any inappropriate or harmful behavoiurs. The safety of our patients and staff is absolutely fundamental, please be assured that your security is of utmost importance.”\nIt did not make reference to Mr Simmonds’ account but provided a link to its PALS team urging anyone with concerns to get in touch.\nThe Gazette has asked HHFT for a copy of its social media policy. It has not yet provided this.\nHowever, its social media policy from 2016 states: “If a member of staff identifies their association with HHFT or the NHS on their personal social media account – for example, by stating they work for HHFT or posting pictures of themselves in uniform or at work – and / or discusses their work, they are expected to behave professionally, and in a way that is consistent with the organisation’s values and policies.”\nIt adds: “Ensure your privacy settings are high enough that you don’t share more than you would like to, with anyone other than your friends.\n\"If you wouldn’t write it on the notice board in the canteen, don’t put it on social\nmedia.\"\nThe Gazette has asked HHFT and Mr Simmonds for a comment.\nThe trust responded with a statement following the publication of this article.\nA spokesperson said: \"Hampshire Hospitals NHS Foundation Trust has a comprehensive social media policy which is routinely updated and easily available to all staff, and we are reminding all those who work for us about their responsibilities when engaging on social media platforms.\n“At Hampshire Hospitals, we operate a zero-tolerance policy towards any harmful conduct, inappropriate or aggressive behaviours, whether in-person or online.\n“It is vital our patients and staff know that their safety and security is of the utmost importance to us, and that any reports of unacceptable behaviour will be immediately investigated whilst being handled with the utmost sensitivity.\n“If any member of the public has a specific concern then please do contact our patient Advice and Liaison Service by emailing palsandcomplaints@hhft.nhs.uk.”\nThe trust also stated that it only followed Mr Simmonds' X account after it became aware of the offensive posts.",
  "word_count": 1037,
  "scraped_at": "2026-02-14T13:03:54.089784"
}