{
  "article_id": "0d92c5712d49",
  "url": "https://www.financialexpress.com/business/brandwagon-ideas-that-inspire-3531701/",
  "title": "Ideas that inspire",
  "date": "20240622T053000Z",
  "domain": "financialexpress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By Parikshit Bhattaccharya\nIdeas are the most important beings on the planet. They carry the energy we need to move forward as a civilisation. They are harbingers of change, openers of mind, demolishers of discrimination, and engines for growth.\nSo, while there are a bunch of things that I could write about Cannes Lions (including my Jury duty in Industry Craft category) using this space, I would rather spotlight ideas that I saw at Cannes Lions 2024. They might just inspire someone who has not been keeping up with the festival. Here are some of my favourite ideas from this year’s festival:\nMeet Marina Prieto: Who is Marina Prieto? That’s what thousands of Spaniards asked when they came across the photos of a 100-year-old in Madrid’s subway stations.\nJCDecaux wanted to demonstrate the effectiveness of Metro advertising. By creating a buzz, they highlighted how well-placed ads in high-traffic areas could penetrate public consciousness and generate significant word-of-mouth.\nThe concept was simple yet powerful: showcase Marina Prieto, an endearing centenarian with a zest for life, in various everyday scenarios. From celebrating her 100th birthday to enjoying a leisurely nap, Marina’s genuine moments were displayed on posters throughout the Metro stations. These posters featured her Instagram handle, inviting the public to follow her journey. People started searching for Marina, discussing her on social media, and even taking selfies with the photos. The question on every Spaniard’s mind was: who is this lady, and how did she end up there?\nBefore the campaign, Marina’s Instagram account had a following of 28 people. However, as commuters began to interact with her story, her follower count skyrocketed to over 10,000.\nThe campaign’s success in driving online engagement underscored a critical point: Metro advertising can seamlessly bridge the gap between offline and online worlds, turning passive observers into active participants.\nOrange Women’s Football: This film uses deepfake technology to showcase the skill of female football players ahead of the World Cup, scoring 15 million ad views.\nThe ad begins as a compelling highlights package of French football stars such as Kylian Mbappé and Antoine Griezmann performing expert pieces of skill and scoring wonder goals. But halfway through, the ad pulls the rug from under the viewers by revealing the actual people behind the moments of football magic – players from the French women’s team. The agency went through over 80 games in the FFF’s archives to source the footage and achieved the seamless special effects using deepfake technology.\nSol Cement Sightwalks: Sol Cement developed Sightwalks, a series of cement tiles with numbered lines to help the visually impaired identify the types of businesses or establishments they are passing by.\nThe number of lines can tell them if the shop next to them is a bank, grocery store, accommodation, hospital, bus stop, pharmacy, and more as they count them from left to right using their walking sticks. Over nearly two years, the project underwent continuous iterations to ensure its effectiveness. A collaborative, multidisciplinary effort involving industrial designers, engineers, and leading associations for the visually impaired in Peru resulted in a tactile tile system.\nWhat sets this project apart is its open-source nature; Sol Cement has made the tiles a copyright-free invention, encouraging global adoption by cities, organisations, or individuals to improve urban accessibility for the visually impaired.\nBefore its successful implementation in Miraflores, extensive collaboration with various blind associations across Peru validated and tested the tactile tile system. This project stands as a testament to how creativity, innovation, and thoughtful design can make significant societal contributions.\nMagnum’s Find Your Summer: “Find Your Summer” encourages everyone to seek out those small, narrow, and fleeting moments of sunshine amid the harsh winter and relish them while enjoying a Magnum ice cream. The campaign tapped into the insight that many people deny themselves the joy of ice cream during colder months. It celebrated those who defy conventional wisdom, seeking moments of summer amidst winter’s chill. The hero film, set against a backdrop of a frosty cityscape, followed individuals discovering their own pockets of warmth and joy—a sunlit window, a soothing bath evoking tropical waters—each scene a testament to the enduring allure of summer. The campaign also involved dotcom and billboards that listed places in the city with sun spots with corresponding time bands.\nPhilips Refurb: Over 10 million gifts ended up in landfills last year. Many of these discarded items were still functional, painting a picture of wastefulness that Philips aims to change. Through its “Better than New” initiative, the company wants to focus more attention on the sale of refurbished products and support their sale in a forward-looking manner. The campaign included an engaging AR activation, a pop store and a complete rehaul of their e-commerce site.\nThe campaign aimed to raise awareness of the benefits of refurbished products, emphasising Philips’ circular business models that use fewer raw materials and generate less waste. By featuring more than 39,000 refurbished products that found new homes in 2022, the campaign highlighted Philips’ success in preventing 139 tons of e-waste and generating 18% of its revenue from circular.\nThe author is Chief Creative Officer, BBH India",
  "word_count": 854,
  "scraped_at": "2026-02-14T12:32:30.602246"
}