{
  "article_id": "0e01b75a3b3f",
  "url": "https://www.arsenal.com/news/preview-arsenal-women-v-london-city-lionesses-0",
  "title": "Preview : Arsenal Women v London City Lionesses",
  "date": "20250905T170000Z",
  "domain": "arsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Barclays Women’s Super League football returns to Emirates Stadium on Saturday (1.30pm) as we look to get off to a winning start in 2025/26.\nWe’ve had a week and a half to fully focus on this game after beating West Ham United 2-0 at the end of pre-season.\nLondon City Lionesses, meanwhile, recently finalised their pre-season with a 3-1 win at Leicester City.\nA RAPID RISE\nFounded in 2019 as a breakaway club from Millwall Lionesses, London City began life in the Barclays Women’s Championship, coming fourth in their maiden campaign.\nAfter falling to sixth in 2020/21, the club came close to promotion when they finished second and third in the following seasons.\nA disappointing drop off to eighth came in 2023/24 but, with the help of Isobel Goodwin’s 16 goals in the second tier, London City Lionesses were crowned champions on the final day of last season.\nWe sold Freya Godfrey to the Lionesses earlier in the summer, while Teyah Goldie also joined the club. Other WSL recruits are Nikitta Parris and Poppy Pattinson from Brighton, and Sophia Poor from Aston Villa. Jana Fernandez recently joined from Barcelona.\nAlso arriving in the summer: Katie Zelem and Alanna Kennedy, as well as Wassa Sangare on loan.\nWHAT THE MANAGERS SAY\nSlegers: “Of course, they've had their season in the WSL 2. This is also new for them and it's new for us. That's part of the challenge for us on Saturday.\n\"There are a lot of unknowns. Of course, we've seen them play last season and we have a good idea of who they are and what they are. At the end of the day, we haven't played against this team because it's very new with a lot of new players.\" - Read every word from Renee’s pre-match press conference.\nPrecheur: \"It’s not an easy one for sure, but it cannot be better than that. Look at the history of the club, how amazing it is and the first game of our history in the WSL, we play the champions of Europe in an amazing stadium.\n“And honestly, we have nothing to lose. I see not many people expecting us to do something, which is easier for us in terms of management. Whatever happens, we will have a lot of lessons from this game so, for me, only positive things.”\nFACTS AND STATS\nWe are unbeaten in each of our last 27 WSL games against newly promoted opposition (W24 D3), since a 1-0 loss to Manchester City in 2014, and have conceded just once across our last 13 such matches.\nSince their independent breakaway to become London City Lionesses in 2019, the Lionesses have lost all five of their meetings with us in all competitions by an aggregate score of 16-0, exiting the FA Cup last term following a 2-0 loss to us.\nLondon City Lionesses will be the 20th different side to compete in the WSL and the sixth from the capital city (Arsenal, Chelsea, West Ham, Spurs, Crystal Palace); each of the last nine debuting teams have failed to win their first game in the competition, since Sunderland beat Liverpool 2-1 in March 2015.\nWe were the leading goalscorers in the 2024/25 WSL season with 62 goals and, including in our final day 4-3 win against Manchester United, we scored 4+ goals in 10 different league games last term, at least four more times than any other side (Chelsea – 6).\nLondon City Lionesses went unbeaten in each of their final 11 WSL2 games to end their promotion winning campaign last term (W8 D3), their-joint best run in the league since their independent breakaway.\nWe have won each of our eight WSL home games under Renee Slegers and the Dutchwoman could become the first manager in the competition’s history to win each of her first nine, eclipsing Sonia Bompastor with Chelsea (drew ninth home match).\nBeth Mead is the all-time top goalscorer in WSL MD1 fixtures (8), netting five goals across her last three such appearances. Meanwhile only Bethany England (20) has scored more goals in the competition against newly promoted sides than Mead (15).\nNew London City Lioness Nikita Parris will be aiming to become the second player to score for six different teams in the Women’s Super League after Lucy Staniforth – the 31-year-old has never netted on her WSL debut for any of her five previous clubs however, including us (also Everton, Man City, Man Utd and Brighton).\nMATCH OFFICIALS\nStacey Fullicks has been appointed to take charge of Saturday's match. Her last game at Emirates Stadium was for our 4-0 win over Liverpool in March.\nShe then took charge of the 2025 Adobe Women’s FA Cup Final between Chelsea and Manchester United.\nReferee: Stacey Fullicks\nAssistants: Leoni Harland and David Middleton\nFourth official: Megan Wilson\nPREVIOUS MEETINGS\nLast time we met was for a 2-0 win in the quarter-final of the Adobe Women’s FA Cup in February, the goals coming from Laia Codina and Stina Blackstenius in Borehamwood on that day.\nPrior to that, we’ve played the Lionesses on two other occasions, beating them 4-0 away from home in the FA Women’s League Cup in February 2024 courtesy of goals from Kim Little, Cloe Lacasse and Alessia Russo, as well as a 1-0 win at home to them in the Women’s FA Cup in January 2022, in which Vivianne Miedema scored the only goal of the game at Meadow Park.\nHOW TO WATCH\nTickets are still available for those wishing to attend Emirates Stadium and cheer on our UEFA Women's Champions League winners!\nIf you can't make it to the match in person, take a look at the list here to see which broadcasters are showing the game around the world.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 984,
  "scraped_at": "2026-02-14T12:23:27.055601"
}