{
  "article_id": "0e167708a31a",
  "url": "https://www.macleayargus.com.au/story/8163980/why-the-southwell-sisters-re-signed-with-the-knights-for-five-years/?cs=305",
  "title": "Knights signings Hannah and Jesse Southwell backing local talent to help Newcastle enjoy sustained NRLW success | The Macleay Argus",
  "date": "20230419T073000Z",
  "domain": "macleayargus.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Southwell sisters recommitted to the Knights believing the club can enjoy sustained NRLW success with a side made up primarily of home-grown talent.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe Novocastrian siblings, who in their first campaign playing together last year helped Newcastle to a maiden premiership, have re-signed for five years.\nSpeaking about their new deals on Wednesday, Hannah, 24, and Jesse, 18, said they were over the moon to have their futures sorted.\n\"We wanted to stay here long term,\" Hannah said.\n\"We were born here, and raised here, so it's a very exciting time.\"\nJesse added: \"I'm so happy to be here. I don't have to move out of home, which is great. I love Newcastle, always have and always will, there's no better place.\"\nA NSW Origin representative, Hannah missed most of last season after suffering a knee injury in Newcastle's opening game, which was Jesse's debut appearance.\nThe Knights went on to claim the title in what was their second campaign after running last the season prior.\nThe duo always hoped to re-sign and their retention follows Tamika Upton and Yasmin Clydsdale penning five and three-year deals, respectively, last week.\nBut the Knights are set to lose a few players from their premiership-winning squad, including Jesse's former halves partner Kirra Dibb who was on Wednesday unveiled as a Cowboys signing.\nThe NRLW's expansion from six to 10 teams was always going to make it hard to keep everyone together and Emma Manzelmann (Cowboys), Romy Teitzel (Broncos), Bobbi Law (Dragons) and Millie Boyle have confirmed they won't be back.\n\"Players come and go in rugby league, that's what this sport is,\" Jesse said.\n\"I think the local girls that we have here are the best in the country, and the fact that we all get to stay home is huge - people don't understand how big that is.\n\"The fact that we're all home and we're all together is massive and I think that will benefit our footy for the long term, definitely.\"\nHannah, when asked about the loss of Boyle who she skippered the side with last season, added: \"Millie made her choice and I think the talent that we have here is undeniable.\n\"We've got a lot of good local girls coming through and I think they can definitely do the job.\"\nJesse recently joined Newcastle's NSW Women's Premiership team for the back end of the state competition.\nThe side finished fifth and missed the finals on for and against after a result didn't go their way in the final round at the weekend, but the Knights used this season as an opportunity to prepare a host of less experienced players for the NRLW.\n\"My season wasn't too long, but the girls that were playing in that comp were really, really good,\" she said.\nHannah, who won a premiership with the Roosters before joining the Knights last season, believes she will be right to play in the 2023 season-opener in late July, saying her recovery from a torn ACL was on track.\n\"It's been really good. I'm seven-and-a-bit months now, so hopefully round one I will be ready,\" she said.\nThe sisters' long-term deals in rugby league come after they've both pursued other sports.\nIn her youth, Hannah excelled at cricket, soccer and later rugby. She began her NRLW career at St George Illawarra in 2018.\nJesse won a Commonwealth Games gold medal in rugby sevens just weeks before the last NRLW season.",
  "word_count": 584,
  "scraped_at": "2026-02-14T12:15:07.226216"
}