{
  "article_id": "0e2c714b1551",
  "url": "https://www.baltimoresun.com/2025/11/29/messis-inter-miami-advances-to-mls-cup-final-with-5-1-win-over-nycfc-in-east-final/",
  "title": "Messi Inter Miami advances to MLS Cup final",
  "date": "20251130T061500Z",
  "domain": "baltimoresun.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By TIM REYNOLDS\nFORT LAUDERDALE, Fla. (AP) — Lionel Messi will play for another trophy. Jordi Alba and Sergio Busquets clearly aren’t ready to begin their retirements, either.\nTadeo Allende scored three goals — Alba and Busquets, a pair of longtime Messi teammates who will retire when this season ends, had the assists on his first two — and Inter Miami topped New York City FC 5-1 on Saturday night for the Eastern Conference title and a berth in the MLS Cup final.\nMateo Silvetti scored in the 67th minute for Inter Miami, with Messi setting up that goal — the 405th assist of his career for club and country, which is generally believed to be the most in soccer history. Telasco Segovia scored off a heel pass from Alba in the 83rd minute to turn it into a runaway, and Allende finishing off the hat trick in the 89th minute was the final play.\n“We have reached the final with a brotherhood of moving forward,” Inter Miami coach Javier Mascherano said. “The power of one group can overcome many things.”\nTennis star Carlos Alcaraz brought the East trophy onto the field to present to Inter Miami’s ownership, before it was handed to Messi. Fireworks, confetti and a ton of happy photos and hugs followed, but it was also clear this wasn’t the trophy Inter Miami wants most.\n“We have made a fantastic playoff run and are very deserving of reaching the final,” Silvetti said in Spanish.\nInter Miami — the No. 3 seed in the East — will play host to either San Diego or Vancouver for the league title on Dec. 6 at 2:30 p.m. Eastern. San Diego and Vancouver play for the Western Conference title later Saturday night.\nIt’ll be the first MLS final appearance for Inter Miami, which had never made it past the opening postseason round in any of its first five seasons. Messi’s club went 0-2 against Vancouver this season, losing both legs of a semifinal meeting in the CONCACAF Champions Cup by a 5-1 aggregate.\nJustin Haak scored in the 37th minute for NYCFC, which went 0-2-1 against Inter Miami this season.\nThe win moves Inter Miami one step closer to another trophy, after winning the Leagues Cup in 2023 and the Supporters’ Shield as MLS’ top regular-season team last year. Messi, a World Cup champion for Argentina and now eight-time Ballon d’Or winner, joined the team midway through the 2023 season when it was at the bottom of the MLS standings and in an 11-match winless streak.\nNow? The club’s brand is global, Messi’s No. 10 jersey in the club’s pink kit is sold all over the world, a new stadium near Miami International Airport is on the way for next season, Messi is signed through 2028, he seems like a lock to win his second consecutive MLS MVP award and the team is on the brink of an MLS title.\nStars flock to see this team because of Messi; Alcaraz was there Saturday night, as were some members of the U.S. women’s national team.\n“Everyone in the world knows who Lionel Messi is. … I think everyone thought he would come in here and do exactly what he’s done,” said U.S. women’s forward Lindsay Horan — whose Messi fandom goes back many years.\nMessi got struck along the left side of his head in the ninth minute and was briefly shaken up, remaining down near the center circle for a few seconds before eventually getting to his feet. He got tripped with Inter Miami on the attack about two minutes later, then took a direct kick from about 30 yards out — playing it into the box, but Silvetti’s header was easily caught by NYCFC goalie Matt Freese.\nInter Miami’s next chance came a minute later. This one was cashed in — a long pass from Busquets was controlled by Allende, who easily beat Freese from about 12 yards out for a 1-0 lead.\nAllende struck again on a header off a long pass from Alba in the 23rd minute, making it 2-0. And after Messi set Silvetti up for the 3-1 lead, what essentially was a 25-minute or so countdown to a celebration was underway.\n“This is a very satisfying result but the work continues,” Allende said in Spanish. “There is still work to do but happy with what we have accomplished.”\n___",
  "word_count": 733,
  "scraped_at": "2026-02-14T12:20:39.425440"
}