{
  "article_id": "0e3595b4f38c",
  "url": "https://www.dailypress.com/2023/12/07/region-state-roundup-third-annual-keepers-cup-futsal-tournament-and-silent-auction-is-this-weekend-in-newport-news/",
  "title": "Region / state roundup : Third annual Keepers Cup Futsal Tournament and Silent Auction is this weekend in Newport News",
  "date": "20231208T001500Z",
  "domain": "dailypress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FUTSAL\nThe third annual Keepers Cup Futsal Tournament and Silent Auction is set for this weekend.\nThe tournament is set for Saturday and Sunday at the HR Sportsplex, located at 630 79th Street in Newport News, and the silent auction is underway. Funds will benefit Luke Messick Charities and the Gweedo Memorial Foundation, which are 501C3 charities.\nMessick and Conner Gweedo were local soccer goalies who were killed in accidents involving distracted, reckless drivers. Gweedo (or Guido), was a Tabb High goalkeeper when he died in 2019, and Messick — a former keeper for Kecoughtan, Randolph-Macon and Lionsbridge FC — was killed in 2021.\nThe Gweedo Memorial Foundation dedicates donations towards educating new teenage drivers and their parents on safe driving practices. Luke Messick Charities collect used soccer gear, which is sent to support youth soccer in Ghana.\nGweedo’s mother, Tammy, a tournament co-founder, said about 20 teams are expected to play in the 5-on-5 event. More than 80 items are up for bids at 32auctions.com/2023FutsalTourney\nCOLLEGE FOOTBALL\nSmithfield grad named D-II All-American\nThe American Football Coaches Association named Virginia State cornerback Willie Drew, a Smithfield High graduate and James Madison transfer, to the NCAA Division II All-America first team.\nHe totaled 34 tackles, including 2.5 for loss, and forced a fumble. He defended 22 passes, including six interceptions; both of those totals were tied for second in Division II.\nHe is scheduled to play in the Senior Bowl in Alabama and the East-West Shrine Bowl in Texas as he hopes to be chosen in the NFL draft.\nHampden-Sydney names coach\nHampden-Sydney named Vince Luvara its head coach. He was the defensive coordinator and recruiting coordinator for Washington & Jefferson in Lancaster, Pennsylvania, since 2016, and the Diplomats went 66-16 in his eight seasons there. He will replace Marty Favret, who retired after 24 seasons with the Tigers.\nCNU players gain honors\nFour Christopher Newport players gained all-region honors from d3football.com after the Captains’ New Jersey Athletic Conference championship season.\nOffensive lineman Josh Hartley and punter Baylor Gallagher made the second team, and running back Gunner White and receiver/kick returner Trey Hayes were on the third team. Hartley is a Woodside High graduate, and White is from Tallwood.\nChadwell, Cignetti among semifinalists for top honor\nLiberty’s Jamey Chadwell and Curt Cignetti, who guided James Madison before taking the Indiana job, are among 14 semifinalists for the George Munger College Coach of the Year Award. Finalists will be announced Dec. 21, and the winner will be announced Jan. 10.\nCOLLEGE WOMEN’S BASKETBALL\nLocal connections help Virginia State move to No. 21 in nation\nVirginia State (7-0) moved into the Division II coaches’ top 25 at No. 21 and is the only Central Intercollegiate Athletic Association team in the poll.\nJunior transfers Tiyanna James, from Princess Anne High, and Amesha Miller, from King’s Fork, are key starters for the Trojans. Freshmen Alexis Blake, a Lafayette High product, and Kiara Beal, a Menchville High graduate, also are on the roster.\nIn their last game, Wednesday’s 75-56 victory over Barton, James had 19 points and four steals, Miller had 16 points and 10 rebounds, and Blake grabbed 10 rebounds.\nThey are coached for the second year by Nadine Domond, a former Iowa Hawkeyes and WNBA standout. She was on the staff at Hampton University, the Apprentice School and the Boo Williams AAU program. Her staff includes former Salem SunDevils head coach/Norfolk State assistant Kevin Harris.\nCOLLEGE FIELD HOCKEY\nCNU’s Asuncion again region’s Player of Year\nChristopher Newport’s Abby Asuncion was named the National Field Hockey Coaches Association Region VI Player of the Year in Division III for the second time. She led the Coast-to-Coast Athletic Conference with 14 goals and 33 points for a 17-1 team.",
  "word_count": 622,
  "scraped_at": "2026-02-14T13:10:25.449674"
}