{
  "article_id": "0e3d9aae19a4",
  "url": "https://www.nationalaccordnewspaper.com/spains-rodri-wins-ballon-dor-for-best-player-in-the-world/",
  "title": "Spain Rodri wins Ballon dOr for best player in the world National Accord Newspaper",
  "date": "20241029T054500Z",
  "domain": "nationalaccordnewspaper.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Spain and Manchester City midfielder Rodri won the Ballon d’Or award for the best player in the world on Monday evening.\nHe beat Brazil’s Vinicius Jr and England’s Jude Bellingham, both of Real Madrid, to the prestigious prize.\nBarcelona’s Spain midfielder Aitana Bonmati won the women’s award for a second time.\nRodri, a first-time winner of the award, was instrumental in helping his team win an unprecedented fourth successive Premier League trophy last season.\nHe was also named best player at this year’s European Championship after Spain lifted a record-extending fourth title.\nThe 28-year-old Madrid native is the first defensive midfielder to win the Ballon d’Or since Lothar Matthaus in 1990 and the third Spaniard to claim the prize after Alfredo Di Stefano (1957 and 1959) and Luis Suarez (1960).\nWhile the award has been dominated by Spanish league players, no Spaniard had won since Barcelona great Luis Suarez more than 60 years ago, despite Spain’s “golden generation” that won the 2010 World Cup, the 2008 and 2012 Euros.\nBut Rodri, the player City coach Pep Guardiola said is “the best midfielder in the world”, finally ended that run with a unique skillset that has made his club the dominant force in England and helped Spain rule Europe again.\n“Today is not a victory for me, it is for Spanish football, for so many players who have not won it and have deserved it, like (Andres) Iniesta, Xavi (Hernandez), Iker (Casillas), Sergio Busquets, so many others.\n” It is for Spanish football and for the figure of the midfielder,” Rodri said on stage at the ceremony.\n“Today many friends have written to me and have told me that football has won, for giving visibility to so many midfielders who have a job in the shadows and today it is coming to light.\n“I’m a regular guy with values, who studies, who tries to do things right and doesn’t try to follow the stereotypes and even so I have been able to get to the top, and it is thanks to all of you.” he added\nRodri became the third person not named Lionel Messi or Cristiano Ronaldo to claim the award since 2008.\nIt was the first time since 2003 in which neither Messi nor Ronaldo made the final 30-man list of nominees. (Reuters/NAN)",
  "word_count": 384,
  "scraped_at": "2026-02-14T12:52:56.685940"
}