{
  "article_id": "0e762ecaac31",
  "url": "https://www.independent.co.uk/life-style/patrick-brittany-mahomes-donald-trump-politics-b2693737.html",
  "title": "Everything Patrick and Brittany Mahomes have said about Donald Trump",
  "date": "20250207T203000Z",
  "domain": "independent.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Everything Patrick and Brittany Mahomes have said about Donald Trump\nThe NFL quarterback called Trump’s upcoming plans to attend the Super Bowl ‘cool’\n- Bookmark\n- CommentsGo to comments\nThe Super Bowl LIX has officially come to a close, as the event was of course a star-studded affair in New Orleans, which included Taylor Swift and President Donald Trump.\nFrom inside the Caesars Superdome, Trump watched the championship game, which saw the Philadelphia Eagles defeat the Kansas City Chiefs, 40-22.\nWhile Trump declined to say what team he’d be rooting for before the event, he did heap praise on Chiefs quarterback Patrick Mahomes, saying: “I don’t want to say, but there’s a certain quarterback that seems to be a pretty good winner.”\nThe next day, February 6, the president went a step further to congratulate the couple on welcoming their third child.\n“Congratulations to the Chiefs GREAT Quarterback, Patrick Mahomes, and his very beautiful and BRILLIANT wife, Brittany, on the birth of their new baby daughter, Golden Raye,” he wrote on Truth Social.\nDuring a pre-recorded interview before the Super Bowl on Sunday, Trump continued to praise Brittany and her speculated approval of him.\n“I just say that I've watched this great quarterback who has, by the way, a phenomenal wife, OK? She's a Trump fan, she's a MAGA fan, so I happen to love her, OK?\" he told Brett Baier of Fox News. “But she's a great person. I watched her being interviewed, I said, 'Wow, that's pretty good.' But, she's great. And he's great.”\nOver the years, fans have suspected that Patrick and his wife, former soccer player Brittany Mahomes, are supporters of the Republican; although, Patrick refused to publicly endorse a candidate in last year’s election.\nBrittany, on the other hand, hinted more strongly at her support when she “liked” an Instagram post from Trump about his “GOP Platform” two months before Election day.\nHere’s everything the famous couple has said about Trump over the years.\nJune 2020 — Patrick refuses to endorse a presidential candidate\nBack in 2020, when Trump was running against former president Joe Biden for re-election, Patrick led a voter registration drive with his former Chiefs teammate Tyrann Mathieu but refused to reveal who his vote was going to.\nThe drive came amid protests against the death of George Floyd and the resulting Black Lives Matter movement.\n“We need to come together and show that black lives do matter,” the quarterback said at the time. “I’m always going to be informed of my decision, and understand there’s going to be good and bad, but I’m going to stand behind my words and take whatever consequences come with it, and hopefully they’re positive. But I’m going to be the best person I can be first, whatever that is.”\nAugust 2024 — Brittany ‘likes’ Trump’s post on Instagram\nIn late 2024, before election day, eagle-eyed fans noticed Brittany had “liked” one of Trump’s “2024 GOP Platform” posts on Instagram.\nThe post included a list of 20 actions he planned to prioritize during his second administration, such as making federal funding cuts in schools and sealing the border.\nThe mother of three was immediately hit with backlash, causing her to remove her “like” from Trump’s post. However, Brittany went on to like comments on other posts promoting the Trump-Vance 2024 campaign.\n“I mean honestly, to be a hater as an adult you have to have some deep-rooted issues you refuse to heal from childhood,” Brittany wrote on her Instagram Story on August 23 in response to the criticism.\n“There’s no reason your brain is fully developed and you hate to see others doing well,” she continued.\nTrump then thanked Brittany for “defending” him in a message shared to his Truth Social account.\n“I want to thank beautiful Brittany Mahomes for so strongly defending me, and the fact that MAGA is the greatest and most powerful Political Movement in the History of our now Failing Country,” he said.\n“With Crime and Illegal Immigration totally out of control, INFLATION Ravaging all Americans, and a World that is laughing at the stupidity of our hapless ‘leaders,’ it is nice to see someone who loves our Country, and wants to save it from DOOM,” he added.\nSeptember 2024 — Patrick refuses to endorse a presidential candidate again\nThe NFL star refused to endorse a presidential candidate again throughout the entirety of the 2024 election campaign.\n“I don't want my place and my platform to be used to endorse a candidate or do whatever, either way,” he said during a September 11 press conference. “I think my place is to inform people to get registered to vote. It's to inform people to do their own research and then make the best decision for them and their family.”\nPatrick went on to say that his family’s willingness to put forth their political views doesn’t bother him.\n“I’ve grown up with people from every aspect of life and every background. I think the best thing about a football locker room, and kind of how I’ve grown up in baseball locker rooms is people can come together and achieve something and achieve a common goal,” he said.\n“I think if we can do that as a nation, I think we can get the best out of each other. I think that’s something that I do every single day. Whenever I’m hanging out with whoever, I’m not thinking about their political views or anything like that.”\nNovember 2024 — Patrick’s mom wears a MAGA hat to the Kansas City Chiefs game\nOn the eve of Election Day, Patrick’s mother Randi Mahomes publicly endorsed Trump when she showed up to a Chiefs game wearing a red Make America Great Again hat.\nIn a video shared by OutKick, the Mahomes matriarch can be seen wearing the cap and yelling: “Make America great again. Let’s do it. Woo!”\nFebruary 2025 — Patrick reacts to Trump attending the Super Bowl\nThe football player addressed the news about Trump attending Super Bowl LIX during a press conference on Wednesday.\nPatrick told reporters: “It's always cool to be able to play in front of a sitting president. Someone that is at the top position in our country.”\nThe quarterback was also asked about Trump’s previous comments about him when the president called him “a good winner.”\n“I don’t want to say, but there’s a certain quarterback that seems to be a pretty good winner,” Trump when asked what team he’d be rooting for.\n“It's cool to hear that he's seen me play football and respects the game that I play,” Patrick said.\nJoin our commenting forum\nJoin thought-provoking conversations, follow other Independent readers and see their replies\nComments",
  "word_count": 1117,
  "scraped_at": "2026-02-14T14:15:52.938823"
}