{
  "article_id": "0e780cc0a40e",
  "url": "https://news.sky.com/story/play-hard-party-harder-englands-red-roses-revel-in-world-cup-glory-at-london-celebrations-13440275",
  "title": "Play hard , party harder : England Red Roses revel in World Cup glory at London celebrations",
  "date": "20250928T194500Z",
  "domain": "news.sky.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Play hard, party harder: England's Red Roses revel in World Cup glory at London celebrations\nAfter beating Canada at Allianz Stadium on Saturday afternoon, the Red Roses partied hard. So too did England fans at London's Battersea Power Station.\nSunday 28 September 2025 20:25, UK\nEngland’s Red Roses promised they would celebrate hard after their World Cup win, and they kept their word.\nThe hoarse throats, sore heads and never-ending smiles on Sunday confirmed they'd had the night of their lives.\nThey strode out onto the balcony at the front of Battersea Power Station, southwest London, on Sunday afternoon, lapping up the love from thousands of fans who had gathered in the rain to share the celebrations.\nPlayer of the match in the final, flanker Sadia Kabeya, told Sky News it had been a big night: \"You can't go home until [captain] Zoe Aldcroft goes home and that girl stays out late.\"\n\"So, as you can imagine, it was a long night, but it was great night,\" she continued. \"You know, we've got to celebrate. This happens, you know, what, once every four years or so.\"\nThe team's victory over Canada in front of a world record-breaking crowd of 81,885 at Twickenham on Saturday represents a huge milestone for the game.\nRugby fan Akua, from London, bagged a last-minute ticket to the final and said it was \"magical, inspiring and empowering\".\n\"We just need to keep inspiring young girls and get them to keep believing in themselves,\" she added.\nRachel Baxter travelled down from Liverpool and had also thrown herself into the post-match celebrations.\nShe said: \"It is just amazing, it has been building so much. I was looking at the stands yesterday and there were no gaps, and I got a bit emotional.\n\"I am so proud it bursts your heart.\"\nIt hasn't happened by chance. The Rugby Football Union (RFU) has backed the women's game with record investment and the Red Roses are the best-funded women's rugby team on earth - but they still had to win it.\nThey saved their best performance of the tournament for the World Cup final and will now reap the rewards and hope the game continues to grow.\nRead more: Royals - and Russell Crowe - lead congratulations\nAmong the crowd was Lucy Bronze, a key player in the Lionesses football team that won the Euros again this summer, said she hoped the Red Roses enjoy the glory and embrace the opportunity it brings.\n\"We want to help lift little girls up, we want to help show little boys what girls are capable of,\" Bronze said.\n\"Being here today to celebrate them, I know they're huge fans of the Lionesses as well - and just celebrating strong powerful women being successful is just so good for the nation.\"\nDouble Olympic champion Dame Kelly Holmes joined the celebrations too after watching the final against Canada on Saturday.\n\"I didn't know much about women's rugby, yesterday I was there, now I'm a big fan,\" she said.\n\"So I just hope that we keep the momentum going... the Lionesses, the rugby women, the Red Roses, they brought like this pride in England.\n\"I saw the English flag being flown yesterday - that's why we fly the English flag, because we're proud of who we are - because sport is what brings us together.\"\nThe Red Roses carried their trophy off stage and went down to meet friends, family and their growing army of fans.\nIt's the party that none of them want to leave.",
  "word_count": 589,
  "scraped_at": "2026-02-14T13:06:56.039414"
}