{
  "article_id": "0e81d14d984d",
  "url": "https://www.the42.ie/northern-ireland-focus-6176050-Sep2023/",
  "title": "Northern Ireland not to be underestimated in  home nations clash  at Aviva Stadium",
  "date": "20230922T214500Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "THE REPUBLIC OF Ireland will not be underestimating Northern Ireland in their historic Nations League opener at the Aviva Stadium tomorrow.\nSo said interim head coach Eileen Gleeson and captain Katie McCabe several times in their pre-match press conference this afternoon.\n“New manager, Tanya [Oxtoby] in with a huge wealth of experience so we expect a very adaptable team,” Gleeson explained. “Any new manager galvanises new energy in different ways. I am sure Tanya’s methods will cause a stir in their team.\n“We are expecting a tough challenge tomorrow. They have also qualified for a major tournament. Tanya will drive them forward. They will come at us.”\nOxtoby’s appointment appears a good one. It took seven months to fill the vacancy left by Kenny Shiels, but it seems to have been worth the wait for Emma Hayes’ former assistant at Chelsea. She comes across as an impressive operator, her will to win and unwavering ambition clear for all to see.\nYet tomorrow is the starting point, a free shot of such, with over 38,000 fans expected at Lansdowne Road [KO 1pm, live on RTÉ Two]. The FAI confirmed such ticket sales this afternoon.\n“The pressure is not necessarily on us,” Oxtoby said. “We’re coming here to test ourselves against a team that’s come from a major tournament, where we want to be.\n“Whilst it’s going to be a fantastic occasion, and there’s going to be a little bit of nerves which is completely normal and natural, there’s no pressure as such from our point of view.”\nWith both sides under new management, it’s difficult to assess one another but Oxtoby believes her team can “maybe indirectly” capitalise on the Republic’s turbulence and fallout after Vera Pauw’s messy exit.\nThe Girls In Green, 23 places higher in the Fifa world rankings, are undoubted favourites but the North will be buoyed by the new manager bounce and looking to push on from their own first-ever major tournament appearance at last summer’s European Championships.\nThey effectively qualified ahead of the Republic, beating their group rivals Ukraine in a play-off.\nVeteran captain Marissa Callaghan sat beside Oxtoby in the press conference, hailing the “fresh start” and “refreshing” changing of the guard.\n“It is our first-ever Nations League game and quite fitting that it is our neighbours. I thought Ireland were outstanding in the World Cup, they fought hard and they have world-class players,” she said, with a special nod to Katie McCabe.\n“And for us to play a team like that, it will show us where we are.\n“It is tough off the back of a tournament. For us it’s a little bit different. A lot of us are in a part-time environment, so when we finished with the Euros we had to go back to our full-time jobs. It’s slightly different for the Ireland girls, they go back to their professional clubs.\n“Obviously I haven’t been involved in one myself so I don’t know what the processes are, but we focus on us, we focus on the task at hand tomorrow. It’s going to be an amazing occasion for everyone. We’ll have 37,000 tickets sold for it, it’s a home nations clash of two countries in Ireland. It’s going to be an exciting game hopefully.”\nCallaghan, 38, is player-coach of Cliftonville Ladies and has enjoyed a colourful career to date. Just where might a win against the Republic at the Aviva Stadium tomorrow rank?\n“For me, international football is a little bit different than club football. Every time you step out onto the pitch, that pride and passion you feel, you’d be up for every single game whether it’s a competition or a friendly.\n“The coaching staff has given us all the tools we need to go out and win this game tomorrow. If we win it, that’s incredible and what it would mean… we’d focus again towards Monday and Albania. We’ve had a fantastic week, lots of learning, lots of processes and principles that we want to go out and play with. Hopefully we can get the win.”\n“We’ve been on a journey for the last five years,” Callaghan adds. “To be honest, we never thought we’d achieve that. Reaching the Euros completely exploded the game within Northern Ireland.\n“We have more young girls getting involved at grassroots level, more clubs starting, more girls wanting to reach the highest playing level. For me, it’s been small stepping stones and hopefully we keep growing. The girls want to be role models for our young players. We’re a small country and have girls looking at us saying they want to play one day for Northern Ireland or coach.”\nCallaghan said she expects the return game, in December, to be held at Windsor Park.",
  "word_count": 789,
  "scraped_at": "2026-02-14T12:56:06.460584"
}