{
  "article_id": "0e90a9f65372",
  "url": "https://thebaltimorewire.com/2018/07/10/maryland-terrapins-headline-roundup/",
  "title": "Maryland Terrapins : Roundup of Headlines in Maryland Sports",
  "date": "20231227T110000Z",
  "domain": "thebaltimorewire.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Maryland Terrapins: Roundup of Headlines in Maryland Sports\nCheck out the latest headlines in the Maryland Terrapins news as the summer is now in full swing.\nMaryland Football\nNew Maryland Athletic Director Damon Evans cleared of improper relationship claims\nDamon Evans was cleared of any wrongdoing in a human resources inquiry about his relationship with a subordinate in the department, the Chronicle of Higher Education reported Thursday, June 28. The inquiry investigated wrapped up one year ago and no violation of university was found.\nDamon Evans Speaks on His Past and the future of Maryland Athletics\nIn his introductory press conference on Tuesday, June 26, Damon Evans spoke about a DUI that cost him his job as University of Georgia Athletic Director nearly a decade ago, Jordan McNair’s death and the investigation surrounding that and more.\nMore from Maryland Terrapins\n- Maryland Football: Terps honor Jordan McNair, beat Longhorns 34-29\n- Where Will Maryland Basketball’s Kevin Huerter Land in 2018 NBA Draft?\n- Maryland Terrapins Offensive Lineman Jordan McNair Dies\n- Remembering Maryland Basketball’s Cliff Tucker: Top 5 Best Moments\n- Maryland Basketball: Bruno Fernando is Back, Withdraws From NBA Draft\nThree-Star Westlake High School (Md.) Defensive End Deshawn Holt Commits to Maryland\nThe Maryland Terrapins earned their second 2019 commitment in June when Deshawn Holt committed Monday, June 25. He stated that after taking his Temple and Rutgers visits when he took his visit to Maryland and he felt like he was home. In 2017 for the Westlake Wolverines (8-3, 5-1 Southern Maryland Potomac Football Region), he recorded 29 tackles, six tackles for loss, four sacks, one forced fumble and one fumble recovery.\nMaryland Basketball\nHow the Atlanta Hawks and Kevin Huerter became a pair\nAtlanta Hawks Head Coach Lloyd Pierce was introduced to former Maryland Terrapins guard Kevin Huerter on his first day of work. Pierce noticed his youth physically and his creativity on the floor. In Jeff Ermann’s interview, Pierce discussed Kevin Huerter’s character and the Stephen Curry–Klay Thompson comparison with him and Trae Young as well.\nMelo Trimble expected to play for Chicago Bulls in NBA summer league\nFormer Maryland Terrapin Guard Melo Trimble played with the Iowa Wolves (Minnesota Timberwolves G-League Affiliate) and where he averaged 16.1 points, 5.4 assists, and 3.5 rebounds. He won’t be playing for the Timberwolves in this year’s Las Vegas Summer League. Will this be his stepping stone to earning a permanent spot on an NBA roster? The Chicago Bulls play their first summer league game against the Cleveland Cavaliers at 9:30 PM EST on ESPN 2.\nESPN ranks Maryland second behind UNC in draft talent study\nAccording to ESPN data, North Carolina and Maryland are the top two schools for recruits to attend in some of the following sports: football, Men’s and women’s basketball, men’s soccer, baseball, softball, hockey and men’s lacrosse. The Terps rank second behind only North Carolina in producing professional talent and are ahead powers like Duke, Kentucky and Notre Dame.",
  "word_count": 495,
  "scraped_at": "2026-02-14T14:08:01.560677"
}