{
  "article_id": "0e93f84896e3",
  "url": "https://www.espn.co.uk/espn/story/_/id/38033561/gotham-fc-ifeoma-onumonu-the-battle-get-nigeria-striker-spot-world-cup",
  "title": "Gotham FC Ifeoma Onumonu is up for the battle to get a Nigeria striker spot at the World Cup",
  "date": "20230719T074500Z",
  "domain": "espn.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Despite being part of a stacked Nigeria forward line that includes Asisat Oshoala, Desire Oparanozie and Rasheedat Ajibade, NY/NJ Gotham FC forward Ifeoma Onumonu wants to stand out at the FIFA Women's World Cup.\nAt 29, Onumonu is going to compete at only her second international tournament for the Super Falcons when she suits up in Australia this month. Her first tournament was the Women Africa Cup of Nations last year, which was a disappointment for the traditionally high-flying Falcons.\nCalifornia-born Onumonu, who played her youth and U23 football for the USA and played collegiate soccer at the University of California, was first called to the Nigeria squad in 2021. She will most likely play behind Oshoala on the depth chart when the competition kicks off, but she is ready to help drive Nigeria to success.\n\"I'm incredibly excited,\" the Gotham striker told ESPN. \"More than anything, it [the competition for a place] increases my focus.\n\"I've never been to a World Cup so this is going to be my first big international tournament. It is going to be difficult and I'm preparing for that.\n\"I don't want to just go to the World Cup, I want to compete. I'm not there just to go and say I went to a World Cup, I am there to actually win.\"\nOnumonu admits that aiming for the title might come off as overly ambitious, considering that Nigeria -- one of only seven countries to have qualified for every World Cup since the first edition in 1991 -- have only one quarterfinal appearance top their name, and that happened in 1999.\nShe added: \"For a lot of people, that sounds delusional, but you can't go into something, just to go. You can't go into something just to participate. I've never been the type to just want to participate in something, I want to actually affect it, I want to win.\n\"And so, the biggest thing is that I'm just focused on what I have to do. I'm trying to prepare, because I play to compete. And I think that kind of started months ago. So I'm excited. But I'm focused.\"\nWith tough games against Olympic champions Canada and hosts Australia ahead of them, it is looking a daunting prospect for the Super Falcons. Their pre-World Cup friendlies have not been much cause for optimism, with losses to Canada, the USA, Mexico, and Colombia.\nAdd to that, a dispute by the players over bonuses with the federation, who have insisted they would not pay any additional bonuses beyond the $30 000 FIFA is paying each player for participating, so things are not looking particularly promising.\nWhen the team gets on the field, however, their focus would be on winning football games, and Onumonu says that accomplishing big things at the pinnacle of the sport starts with self-belief: \"To some degree there has to be a change in mindset. We have to be a team that believes in our ability.\n\"WAFCON was a little bit of a disappointment. So I think it's just this switch in the mindset of belief, and coming together as a team.\n\"When we played against the USA, [former Nigeria forward] Mercy Akide* came to see us and told us afterwards that we have to come together as a team and really talk about what exactly we're trying to accomplish.\n\"And it starts from individual preparation. Like, individually, what is your role? What are you trying to accomplish? And how best can you help the team.\n\"I think the level of the team is increasing. So yeah, I really think it's going to be that shift of realizing that this is a possibility of winning, and that will, I think, get us to the next level.\"\nUnfortunately, that did not happen at the WAFCON, where the Super Falcons, serial winners of the competition, suffered humiliation, losing their opening game to eventual winners South Africa, scraping by in the quarterfinal against Cameroon before losing the semifinal on penalties to Morocco and the third place game to Zambia.\nThat Morocco loss was especially painful for Onumonu, who labored for 120 minutes as a lone striker, with precious little to forage on after Rasheedat Ajibade and Halimatu Ayinde were sent off for Nigeria.\nShe ended up missing the decisive penalty kick that cost Nigeria the game. It was a nightmare scenario for the forward.\n\"It was difficult,\" she recalled. \"We went to PKs and I was exhausted. It is not as though it was the frame, it was saved. And I give myself grief for that, like, that's what the goalkeeper is there for.\n\"But for me, as a striker, I expect to make every single PK. So, when she did make the save, it weighed a lot on me. I'm not necessarily one who kind of goes online to check comments, but for some reason, a comment caught my eye and it upset me.\n\"That was hard, but people are going to say what they were going to say because they don't know how hard it was, In that stadium with all their fans, it was incredibly difficult.\n\"But at the same time, I can't really blame myself for that one moment. Like, there were multiple moments in the game that could change the trajectory of the game.\"\nREAD: ESPN's Women's World Cup team-by-team preview\nOnumonu says she learned from that experience and the lessons will serve her well not just for the World Cup, but beyond: \"I am the type of player who expects so much of myself, I didn't think it would have been healthy for me to just kind of dwell on that. So I knew I had to let it go.\n\"I told myself this is just a learning experience at this point. So what are you going to do next with what you've just experienced? It took me a while. And even when I got back from Morocco, it still kind of weighed on me a little bit. But little by little, I got back the feel of it. And what kind of player I will like to be.\"\nThat experience is part of the journey to self-improvement and development that Onumonu carries with her to the World Cup, where she hopes to do what that iconic Class of 1999 did when they wrote their names in the Nigeria history books.\nShe said: \"I know I want to leave a mark at the World Cup. I'm still trying to figure that out. I just don't know what that looks like. I know that it is going to be part of my preparation as we get closer is to figure out what it is that I want to leave at that tournament.\"\n*ESPN writer Colin Udoh is married to Mercy Akide",
  "word_count": 1132,
  "scraped_at": "2026-02-14T13:38:08.685502"
}