{
  "article_id": "0e9e25ce1b0b",
  "url": "https://www.al-monitor.com/originals/2024/05/pique-probed-over-saudi-deal-host-spanish-super-cup",
  "title": "Pique probed over Saudi deal to host Spanish Super Cup",
  "date": "20240530T194500Z",
  "domain": "al-monitor.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Pique probed over Saudi deal to host Spanish Super Cup\nA Madrid court on Thursday placed former Barcelona player Gerard Pique under official investigation as part of a probe into suspected corruption in a deal to take the Spanish Super Cup to Saudi Arabia.\nSpanish football federation contracts signed since 2018 are being investigated, including one by disgraced former federation president Luis Rubiales to have the oil-rich Gulf state host the Spanish Super Cup.\nThe Super Cup contracts are worth 40 million euros a year ($43 million) with the deal brokered by Kosmos, a company owned by former Barcelona and Spain defender Pique.\nThe court said there are \"possible illegalities with criminal implications\" in the contracts, which included a clause to \"guarantee the payment of a commission of four million euros per year to Kosmos\".\nAs a result, the court said it had formally included Pique in a group of people now under official investigation over the alleged graft case which has rocked Spanish football.\nIn March, Spanish police searched 11 locations, including the RFEF's Madrid headquarters and Rubiales' house in Granada as part of the investigation into corruption and other crimes.\nRubiales was forced to step down as RFEF boss in September after forcibly kissing Women's World Cup star Jenni Hermoso following Spain's triumph in the Sydney final in August.\nProsecutors had in 2022 opened an investigation into the Super Cup deal after audio recordings between Rubiales and Pique were leaked in which they spoke of multi-millions value commissions.\nRubiales has always defended the legality of the deal to take the Super Cup to Saudi Arabia.\nPique has also insisted that everything was \"legal\", saying he was \"proud\" of the deal.\nThe probe was expanded in April to include Rubiales' successor, Pedro Rocha.\nThe Spanish Super Cup took place for the first time in Saudi Arabia in 2020.\nIt returned to Spain a year later due to the Covid-19 pandemic, but the subsequent three competitions have taken place in Saudi.\nPique had played twice with Barcelona in Spanish Super Cups in Saudi Arabia before retiring from football in November 2022.",
  "word_count": 351,
  "scraped_at": "2026-02-14T12:52:21.066349"
}