{
  "article_id": "0ec48ee2b7be",
  "url": "https://www.bbc.co.uk/news/articles/cewjqxxy2jxo",
  "title": "Fantasy Premier League : Is AI ruining fantasy football ? ",
  "date": "20260106T121500Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Is AI taking the fun out of fantasy football?\n- Published\nFor years, fantasy football has given every armchair manager the space to back up claims they \"could do a better job\" than the real thing.\nWhether you're competing against workmates, family members or strangers, the ability to pull together your own dream team is irresistible to millions of football fans.\nThe competitive pastime has spawned a whole industry of content creators offering weekly tips for anyone looking to gain an edge as they sift through stats and manage transfers.\nRecently, more players have been turning to Artificial Intelligence (AI) tools for advice - but not everyone agrees they have a place in the virtual dugout.\nFantasy Premier League (FPL) is the UK's most popular fantasy league, and claims to have more than 11 million players taking part.\nUsers select squads of 15 footballers, who each earn points based on their weekly on-pitch performance.\nThe catch? A £100m budget, constant price changes, and a strict limit on how many players you're allowed from each side.\nContent creator Ryan Jordan, who posts fantasy football tips and advice to his 15,000 followers on TikTok, says FPL makes the real-life game \"more engaging to watch\".\nThe Bristol City fan says it encourages him to pay attention to teams he might not usually follow, and makes \"every match really matter\".\n\"So even a team lower in the table that you might not want to watch on TV each week, you'll watch it because you've a player from their team in your FPL team,\" he says.\n\"It brings the community together to watch a lot more.\"\nRyan tells BBC Newsbeat he uses Fantasy Football Hub, an app which offers AI tools, including one that rates a manager's squad.\nHe says it gives advice on transfers, predicts how many points a certain player will achieve each week, and when it's best to play or bench them.\nFantasy Football Hub's founder Will Thomas told Newsbeat the app has attracted about 793,000 members since it launched in 2019, with about 59,000 of those paying a subscription to access AI features.\nOf those paid members, he said, about 28,000 signed up in 2025, with about 381,000 joining as free members.\nFantasy Football Fix, another popular app, told Newsbeat it had also seen user numbers climb.\nIt now has 690,000 members overall, up from about half a million in 2022.\nThe company believes one of its key features, an AI-powered chatbot the company says is trained on \"FPL-specific\" data, has contributed to the increase.\nNewsbeat understands the Premier League is set to add features to its official Companion app, which uses Microsoft's Copilot, to help users pick fantasy teams and strategies later in the season.\nBut do AI tools actually do what they claim?\nRyan says he mostly finds Fantasy Football Hub reliable.\n\"A lot of the time, some of the players they put in there are spot-on,\" he says.\n\"I'm not going to lie, there are some times I see a player and I think: 'What's he doing in there?'\"\nIn groups dedicated to fantasy football on Reddit and other platforms, some users argue that the subscription apps don't provide insights or data which players can't get elsewhere.\nAnd one of the biggest complaints is that they remove the elements of gut instinct and luck that keep people hooked on fantasy leagues.\nRyan says he understands why some people are against AI use, but he sees it as similar to getting advice from YouTube or podcasts.\n\"At the end of the day, I think people should play FPL in whatever way they enjoy most,\" he says.\n\"AI tools don't replace skill, they just support decision-making.\"\nTwo-thirds of FPL players who replied to a survey from Virgin Media O2 published in August, external said they were planning to use AI this season.\nHowever, many respondents told the company it \"takes the fun out of the game\" and others felt it was \"outright cheating\".\nIt's a view that Newsbeat encountered among fans travelling for the Aston Villa v Manchester United match in Birmingham last month.\nSupporters told us they felt puzzled by others using AI to help them pick their squads.\nWhen we spoke to Jake Thomas O'Donnell, a long-time FPL player, in Birmingham city centre, he was also unimpressed.\n\"I think AI ruins the banter a little bit,\" the Aston Villa fan said.\n\"People that use AI have no clue what they're doing and automatically become these great people.\n\"It should be done by the person.\"\nOther players we spoke to say they weren't too fussed about it - and some didn't even know AI was used by others.\n'I don't really see it spoiling the game'\nDani Gonçalves is a co-creator of Aerial Fantasy, one of several unofficial fantasy games developed for the Women's Super League after England's Lionesses won the 2022 Euros.\nIt opened the 2025-26 season with more than 30,000 users.\nDani argues there is little difference between following advice from an AI chatbot and a fantasy football \"expert\", such as a podcaster.\n\"People have always been trying to game the system and figure out a way to get the edge,\" she tells Newsbeat.\n\"I don't really see it spoiling the game.\"\nDani admits there is a risk that widespread AI use could lead to lots of similar-looking teams as \"everyone's using the same data\".\nBut she says those running fantasy leagues can use incentives to encourage players away from obvious or popular picks.\nAerial Fantasy, for example, offers \"visionary points\", or bonuses, boosting rewards for those who choose lesser-picked squad members.\nDani says there can also be a benefit for players who do enjoy the old-fashioned method of trawling stats and spreadsheets to optimise their teams.\n\"Some players really enjoy digging through all the data and finding that gem, and obviously using AI does make that faster,\" she says.\n\"They're almost more engaged than the person who is rolling the dice and just picking a random person.\"\nRelated topics\n- Published8 April 2023",
  "word_count": 1007,
  "scraped_at": "2026-02-14T13:06:58.222646"
}