{
  "article_id": "0ed9407fe7dd",
  "url": "https://www.broadcastnow.co.uk/broadcasting/dazn-launches-global-fast-channels/5181553.article",
  "title": "DAZN launches global FAST channels",
  "date": "20230502T174500Z",
  "domain": "broadcastnow.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Channels, named Combat and Women’s Football, will be available to viewers for free\nDAZN has launched two global FAST channels, DAZN Combat and DAZN Women’s Football.\nCombat is available in all territories except the US, Canada, Baltics, Crimea, Iran, Cuba, North Korea, Syria, and covers boxing and MMA, including live events, highlights, archive fights, documentaries and more. Content will come from DAZN’s deals with Matchroom Boxing, Golden Boy and MF & DAZN: X Series as well as combat sports including the PFL Archive, Ansgar Fighting League, Naciones MMA, Muay Thai for Life, Primetime Wrestling, KOK, MMA Bushido, Dream Boxing.\nMeanwhile, Women’s Football will be global except for MENA, China, Hong Kong, Taiwan and Macau, and includes content from the UEFA Women’s Champions League and Liga F, as well as archives, behind-the-scenes access and highlights. It will also air documentaries, including Equals, a six-part documentary series putting viewers one-on-one with some of the top stars in the women’s game and The Game that Changed Football, a film about the historic UWCL Clásico between FC Barcelona and Real Madrid CF in front of a sold-out Camp Nou in March 2022. The first live match on the channel will be the second leg of UWCL semi-final on 27 April, Chelsea FC Women vs FC Barcelona.\nLG will carry the channels globally (not including DAZN’s core territories) - they will be available on LG Channels in Argentina, Brazil, Mexico, the Nordics (Norway, Sweden, Finland, Sweden), Netherlands, France and Australia. In addition, Samsung TV Plus will be distributing the DAZN Women’s Football Channel in Australia and New Zealand, where the channel launched on the 26th April, and VIDAA will carry both channels in Australia, Brazil and Mexico. More partners will be added following the launch.\nThis shortly after DAZN launched DAZN Rise, a 24/7 FAST channel in Germany and Austria dedicated to women’s sport. DAZN VP of production and editorial operations Louise Lawler recently explained the broadcaster’s approach to women’s sport - which has seen it broadcast its UWCL content for free on YouTube, drawing large audiences.\nVeronica Diquattro, CEO of global markets at DAZN, said: “DAZN is the home of women’s football, boxing and fight sports globally. We are committed to increasing the global presence of these sports in markets across the world and the channels will help even more sports fans have greater access to top-tier sports rights across the globe. We already have an impressive rights portfolio of global rights properties in non-core markets and the global FAST channels highlight our commitment to provide frictionless, anytime, anywhere sports entertainment to passionate fans.”\nDaniel Palmisano, Samsung TV Plus head of business development, added: “In our commitment to deliver premium sports channels to Samsung TV Plus, I am thrilled to announce our partnership with DAZN for the launch of DAZN’s Women’s Football channel on Samsung TV Plus Australia and New Zealand. Now fans will be able to enjoy all the excitement of women’s football including the best football competitions live from around the world, on our growing platform.”\nChris Jo, senior vice-president of platform business at LG Electronics Home Entertainment Company, commented: “The user base of LG Channels in Europe has tripled in the last year, thanks to availability of a growing number of channels. With the addition of DAZN’s popular sports channels we expect more LG TV customers in Europe can enjoy their favourite game on the big screen at home.”",
  "word_count": 568,
  "scraped_at": "2026-02-14T12:55:31.893034"
}