{
  "article_id": "0ee96d84dc87",
  "url": "https://www.cnn.com/2024/12/24/politics/f-16s-maryland-rfk-stadium/",
  "title": "Unique deal could bring F - 16s to Maryland , NFL to DC",
  "date": "20241224T223000Z",
  "domain": "cnn.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The state of Maryland is set to gain control of the DC Air National Guard fighter squadron as part of a major deal that will see the nation’s capital take over the site of RFK stadium.\nThe Air Force approved the transfer of the 121st Fighter Squadron from Washington, DC, to the Maryland Air National Guard, according to spokeswoman Ann Stefanek. Maryland currently flies A-10 attack aircraft, but those are scheduled for divestment from the Air Force next year, according to the governor’s office.\nThe new development means the Maryland Air National Guard will soon fly F-16 fighter jets, a more advanced aircraft that serves as one of the mainstays of the Air Force’s fleet. The DC Air National Guard also defends the National Capital Region, which is some of the most sensitive airspace in the country. The fighter wing has a round-the-clock alert force as part of its mission. By contrast, the Maryland Air National Guard’s aging A-10 aircraft were primarily used in an overseas attack role when deployed.\nThe Maryland unit was supposed to transition into a cyber role, but the transfer of control of the fighter squadron will maintain the unit’s flying mission.\n“The men and women of the Maryland Air National Guard are some of the finest and most experienced pilots in the world. In partnership with our congressional delegation and federal partners, we have advocated vigorously to maintain Maryland’s flying mission, both in the interest of national security and to continue the proud tradition that Maryland plays in defending our country,” Democratic Gov. Wes Moore said in a joint statement with the state’s senators on Monday.\nThe transfer of the fighter squadron was a critical part of a complex deal that allows Washington, DC, to take over the land around RFK stadium, which could bring the NFL back to the nation’s capital, while also providing Maryland with funding to rebuild the Francis Scott Key Bridge.\nThe deal was at risk of collapse last week when a provision to transfer the stadium land to DC was stripped from a government funding package following opposition from President-elect Donald Trump and billionaire Elon Musk.\nBut in a surprise move early Saturday morning, the Senate unanimously passed a bill giving DC control of the land. The Robert F. Kennedy Memorial Stadium Campus Revitalization Act now awaits President Joe Biden’s signature after it passed the House earlier this year.\nThe Washington Commanders football team has played at Northwest Stadium, formerly known as FedEx Field, in Landover, Maryland, since 1997. The franchise previously played at RFK Stadium from 1961 until 1996.\nMaryland Air National Guard Brig. Gen. Drew Dougherty called the deal an “historic moment” for the unit.\n“Over the past few years, we have been resolute on our commitment to securing a future flying mission. This transition is the first step in delivering a path where we can maintain our highly experienced pilots and maintainers, positions that are critically manned across the total force, while still keeping Maryland at the forefront of cyber operation,” Dougherty said in a statement.\nDetails about the timeline and the transition of the fighters from DC to Maryland “will be announced at a later date,” said Stefanek.",
  "word_count": 532,
  "scraped_at": "2026-02-14T13:16:36.744501"
}