{
  "article_id": "0f0681390d52",
  "url": "https://ndsmcobserver.com/2023/09/18-collegiate-games-to-watch-this-week/",
  "title": "18 collegiate games to watch this week // The Observer",
  "date": "20230914T043000Z",
  "domain": "ndsmcobserver.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "On almost any given week, college athletics offer us an infinite number of choices. With hundreds of games out there, locating peak entertainment windows is a challenge for any viewer — myself included. And in mid-September, as fall sports conference schedules overlap with marquee first-month games, that challenge is heightened even further. So, beginning this week, I’ll outline the best of the upcoming collegiate schedule. Here are 18 games to keep an eye on over the next seven days.\nFootball\nAhead of next week’s loaded slate, week three does not feature a single ranked-on-ranked matchup. No. 15 Kansas State visits Missouri at noon on Saturday in a meeting of 2-0 squads. Though Mizzouri has traditionally owned the old Big 12 series, Kansas State is 15-5 against the Tigers since 1993. That includes a 40-12 Wildcat beatdown in Manhattan last September. While Kansas State has won its first two games comfortably, Missouri barely scraped by Middle Tennessee last week. Expecting their first non-conference sellout in 11 years, the Tigers seek a better performance on Saturday.In their first meeting since a nine-overtime showdown in 2021, No. 7 Penn State heads to Illinois at noon. The 1-1 Fighting Illini fell at Kansas last week in a game more lopsided than the 34-23 score would indicate. Meanwhile, quarterback Drew Allar has passed efficiently for a Nittany Lion offense that is averaging 510 yards per game. The sophomore ranks seventh in college football with a 78.2 completion percentage.\nAlso at noon, No. 14 LSU (1-1) opens SEC play with its College Football Playoff chances already on life support. Coming off a 72-10 thrashing of Grambling State, the Tigers will visit Mississippi State. The game features a battle of highly capable quarterbacks who both played poorly in their duel a season ago. LSU’s Jayden Daniels has passed for 615 yards in two games, while the Bulldogs’ Will Rogers hasn’t yet broken out but has played interception-free football.\nReturning to the non-conference schedule, No. 20 North Carolina hosts Minnesota in a tussle of undefeated teams. But neither squad has totally impressed through two games. The Golden Gophers scored a combined 38 points in defeats of Nebraska and Eastern Michigan. And after passing a week one test at South Carolina, the Tar Heels needed two overtimes to beat Appalachian State at home last week. With league play looming, this 3:30 game is a prove-it opportunity for both parties.\nMoving down to The Swamp, No. 11 Tennessee and Florida have the first SEC night game of 2023. Despite losing 16 of their last 18 matchups with Florida, the Volunteers are favored to top the Gators for a second consecutive season. The undefeated visitors throttled Virginia in week one but were not particularly sharp during their 30-13 defeat of Austin Peay last week. Meanwhile, 1-1 Florida hopes to avenge a season-opening loss at Utah with a ranked win at home.\nAnd though both teams have a loss, I can’t leave the Backyard Brawl off the list. After last year’s 38-31 barnburner at Acrisure Stadium, Pitt and West Virginia set their sights on Morgantown for a 7:30 kickoff. Both teams have different quarterbacks this time around. Pitt’s Phil Jurkovec and West Virginia’s Garrett Greene have been fine in their first year as starters for their respective teams. But one must take a step forward in his third game to keep his team above .500 under the lights.\nWomen’s Volleyball\nA loaded weekend on the court begins with a battle of 2022 Elite Eight qualifiers on Thursday evening. Fresh off a split with two top-15 opponents, No. 7 Oregon makes the long journey to face No. 8 Pittsburgh. Since a season-opening loss at BYU, the Panthers have outscored their competition 18-1 with contributions from back-to-back ACC Freshman of the Week Olivia Babcock.No. 6 Texas plays a tough pair of games this week. The defending champion Longhorns will host No. 19 Ohio State on Thursday, a day before welcoming No. 11 Washington State. Last season, the Longhorns knocked off Ohio State to reach the Final Four. The Buckeyes hope to avenge that game and halt a current four-game skid against top-11 competition. On the other hand, Washington State is riding high after its first top-10 win in two years on Saturday against BYU.\nSunday afternoon features two top-five matchups. The first, No. 5 Stanford at No. 2 Louisville, is scheduled for 1 p.m. While the Cardinal (Stanford) fell to fourth-ranked Nebraska on Tuesday, the Cardinals (Louisville) have yet to lose this season. The other marquee match brings No. 1 Wisconsin and No. 3 Florida together at 3 p.m. in Gainesville. The Badgers have won 25 consecutive regular-season games and the Gators already have three top-10 wins this season.\nMen’s Soccer\nAs conference play begins this weekend, the Sun Belt presents another top-five matchup, as No. 5 UCF hosts No. 4 West Virginia on Friday. Both teams are unbeaten through five games, with the Mountaineers coming off a 1-0 takedown of third-ranked Portland. For the Knights, this showdown marks their first conference game as a Sun Belt member.Staying in the Sun Belt, No. 2 Marshall faces a road test in its conference opener at No. 9 James Madison. Having outscored its first six opponents 22-2, the Thundering Herd boasts arguably the top offense in the country. But the Dukes topped Marshall in the quarterfinals of last year’s conference tournament and have the upside to prevail again on Saturday.\nLike the defending volleyball champion, the reigning men’s soccer king battles a difficult schedule this week. No. 7 Syracuse plays its first ACC road game Saturday at No. 20 Wake Forest. The Orange and its top-tier defense looks to contain Wake’s Roald Mitchell, who has nine points over his last three games. Looking ahead to Tuesday, Syracuse also visits No. 25 Cornell in an NCAA Tournament rematch.\nWomen’s Soccer\nA cross-divisional battle in the SEC on Thursday night leads off the women’s soccer week. After an impressive draw at home with third-ranked North Carolina, No. 7 Alabama welcomes No. 23 Georgia to Tuscaloosa. Needing a strong result to remain ranked, the Bulldogs have not defeated the Crimson Tide since 2010.To the surprise of no one, the ACC provides the game of the week on Friday at 4 p.m. No. 4 Florida State pays a visit to No. 8 Clemson on day one of conference action. Though the Seminoles have won five straight in the series, Clemson is off to a hot start. The Tigers rank among the ACC’s top two in both goals scored and goals allowed per game.\nSunday night shifts the headlines to the West Coast for a Bay Area brawl between No. 12 Santa Clara and No. 3 Stanford. The Cardinal has already defeated 10th-ranked Duke 4-0 as part of a 6-0-1 start. But for the 6-0-2 Broncos, this trip to Palo Alto represents their first meeting with a ranked opponent.\nSign up for our Observer Sports newsletter! Have an Irish sports question? Ask it for our Observer Sports mailbag!",
  "word_count": 1167,
  "scraped_at": "2026-02-14T12:15:20.793909"
}