{
  "article_id": "0f3516629c53",
  "url": "https://www.mirror.co.uk/news/royals/prince-william-makes-brutal-joke-34290055",
  "title": "Prince William makes brutal joke as child hands him drawing of himself",
  "date": "20241211T003000Z",
  "domain": "mirror.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Prince William makes brutal joke as child hands him drawing of himself\nPrince William, 42, revealed he is not ready for Christmas as he met soldiers and their families at a festive party for 1st Battalion Mercian Regiment in Wiltshire\nSpreading festive joy, the Prince of Wales delivered Christmas presents to youngsters and families at a Yuletide bash for the 1st Battalion Mercian Regiment in Wiltshire. Prince William, acting as colonel-in-chief, mixed with soldiers and their kin at Bulford Camp's Picton Barracks during a merry, jovial lunch.\nGreeted by the regimental mascot, 18-month-old Private Derby the ram and upon learning the Swaleside ram was the 33rd since 1858, he remarked: \"I can see you are holding on tightly, he looks fantastic, very smart.\"\nWhen informed that the mascot was headed to spend the festive period among ewes, William quipped: \"So he has quite a fun Christmas. Oh good luck to him.\"\nInside the sergeants' mess, he mingled, cracking jokes with servicemen, women, and their kids across ten tables. Ten-year-old Karson Heighway presented the 42-year-old prince with a post-it doodle of William which led the Royal to humorously comment: \"Is that me? \" and \"Looks like I have five nostrils.\"\nREAD MORE: Original Banksy mural destroyed by workers after fears it would attract graffitiImpressed, William carefully folded the picture and tucked it into his pocket.\nThe Mercian Regiment predominantly comprises individuals from the Midlands, and the event buzzed with football banter from fans of teams like Stoke, West Brom, Wolves, and Aston Villa.\nPrince William, who recently met with Donald Trump in Paris for the ceremonial reopening of the Notre Dame Cathedral, confessed he'll be watching Villa's Champions League match against RB Leipzig from home. He admitted: \"I was trying to get to the game but have got a lot of things going on.\"\nWhen quizzed about his Christmas plans with the Royal Family, he shared his anticipation for long walks with the family dog in Norfolk.\nHe confessed: \"Am I ready for Christmas? No, no way am I ready.\"\nHowever, he told another group that he was excited for a festive gathering with 45 family members \"all in one room\" but \"normally spread out\". Prince William asked five year old Alexander Fitzgerald about his Christmas wish list.\nHis father, Sgt Lee Fitzgerald, 39, later revealed: \"He said he wanted a Nintendo Switch and when they spoke about playing Mario Kart William said he was supposed to let your dad win sometimes.\"\nAll military personnel and their families donned Christmas jumpers for the occasion. Ten-year-old Isobelle McNeil and her younger brother Hunter, 5, presented William with a Santa hat gift and a Christmas card addressed to George, Charlotte and Louis.\nTheir mother, Fiona Dewar McNeil, shared: \"William asked what Father Christmas was going to bring for him and Hunter said he was going to get a big Tyrannosaurus Rex. He said 'I hope all your dreams come true'.\"\nSeven-year-old Sanganoo Kejhan presented Prince William with a hand-crafted Christmas card. The prince was left chuckling by 14-year-old Dylan Potter, who confessed to wearing two Christmas jumpers.\nRecalling their conversation, Dylan said: \"I asked what does a prince do for fun? He said he likes watching movies and hanging out with his children but because he is over 40 finds fun hard to come by.\"\nIn casual chats with families, William shared that he and Kate have been enjoying Netflix, including 'Black Doves' featuring Kiera Knightly. Despite the festive occasion, William declined to wear a Santa hat or a Christmas jumper.\nPointing at himself, he quipped: \"Some people don't own one.\"\nWhen questioned about his lack of a jumper, he humorously blamed his new equerry Squadron Leader Mike Reynolds, saying: \"I didn't know, you see that guy in the jacket, it's his fault and I will be having a word.\"\nTo the families present, he expressed: \"I hope you have a quiet Christmas.\"\nTowards the end of the event, he joked: \"Ten tables, it's like I'm speed dating.\"\nA Fijian choir, composed of soldiers from the Mercian Regiment, serenaded him with a song.",
  "word_count": 680,
  "scraped_at": "2026-02-14T12:49:01.325192"
}