{
  "article_id": "0f4a966cbaec",
  "url": "https://www.rnz.co.nz/international/pacific-news/556359/pasifika-sipoti-in-brief-for-27-march",
  "title": "Pasifika Sipoti in brief for 27 March",
  "date": "20250327T011500Z",
  "domain": "rnz.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "League\nThe PNG Hunters have made some changes to their line-up as they prepare for this weekend's Hostplus Cup clash against the Brisbane Tigers in Port Moresby.\nThe National newspaper reported the Hunters will host the Tigers on Sunday afternoon.\nThe Hunters lost 28-6 to the Falcons on 15 March and were on a bye last weekend.\nCoach Paul Aiton has called in fullback Sany Wabo as part of the changes for the game at home at the National Football Stadium.\nAthletics\nPNG runner Pais Wisil has set a new national record in the 60-metre sprint at the World Indoor Championships in China.\nHis time of 6.66 seconds was the 17th fastest from a field of 58 runners, earning him a semi-final spot.\nThis comes one week after breaking Peter Pulu's 30-year-old 100m record for PNG.\nThe Post Courier reported Athletics PNG President Tony Green saying these are not just national records but also significant performances.\nWisil has qualified for the Maurie Plant Meet in Melbourne next weekend, the premier event on the Australian Athletics calendar.\nHe is also preparing for the Mini Games in Palau, which begin in late June.\nRugby\nThe British and Irish Lions rugby team have confirmed the first match of their Australia tour will be against a combined First Nations and Pasifika team.\nThe tourists will meet the combined team at Melbourne's Marvel Stadium on 22 July.\nThat will replace the initial game against the now defunct Melbourne Rebels franchise.\nFootball\nThe Cook Islands Football Association has announced the appointment of Angela Wallbank as the head coach of the national women's team.\nCook Islands News reported Wallbank's coaching journey began in New Zealand, where she spent years coaching at club level.\nShe has also been an assistant coach with the Cooks national side, and head coach of the under-17s.\nWallbank will coach the squad into the OFC Women's Nations Cup in Fiji this July.\nNFL\nThree players with Pasifika heritage will be part of the University of South Florida's pro day in front of scouts from 32 NFL clubs.\nFormer Wallabies Jordan Petaia, Laitia Moceidreke and Laki Tasi will be in action at the NFL audition, as they try to impress scouts for possible contracts.\nNFL News reported the players have been part of the NFL's International Player Pathway training program at Florida's IMG Academy in the past 10 weeks.\nBasketball\nThe Pacific Mini Games in Palau will be the first to be recognised as a FIBA 3x3 Nations League event and a Commonwealth Games qualifier.\nOceania Basketball said that is a major milestone for the shortened version of the game, and that will see national teams earn direct qualification to the FIBA 3x3 U23 World Cup.\nAmanda Jenkins, FIBA Oceania Executive Director, hailed the development as a transformative step for 3x3 basketball in the region.\nShe said by integrating the Pacific Mini Games into a FIBA 3x3 Youth Nations League conference, the region's young athletes will have a clear and structured pathway to elite-level competition.\nBeach volleyball\nVanuatu's young female beach volleyballers are set to compete in their first regional tournaments.\nVanuatu Daily Post reported one team is competing at the Youth Championships in Queensland, Australia this week.\nThe event is part of Volleyball Australia's VolleySlam, featuring 655 teams across four tournaments, over a span of 10 days.\nThe second team will be at the Oceania Under-18 Championship in New Caledonia, from 6-9 April.",
  "word_count": 570,
  "scraped_at": "2026-02-14T12:34:34.912911"
}