{
  "article_id": "0f63d90d5d49",
  "url": "https://www.standard.net.au/story/9132371/maggie-johnstone-hoping-to-realise-aflw-draft-dream/",
  "title": "Maggie Johnstone hoping to realise AFLW Draft dream | The Standard",
  "date": "20251212T033000Z",
  "domain": "standard.net.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Playing football against boys when she was younger, Maggie Johnstone pictured herself one day taking on the men in the AFL.\nSubscribe now for unlimited access.\nor signup to continue reading\nIt's completely understandable. The South Warrnambool and Dennington product was beating the boys and was unaware the first national elite women's competition was in the midst of starting.\nThe AFLW came along in 2017 and showed the youngster, then just 11, a pathway to the highest level for females.\nReaching that level has long been a goal for Johnstone and on Monday, December 15, that dream could come true.\nThe 18-year-old is a very strong chance to be selected in the 2025 AFLW draft and is considered a first round prospect off the back of a dominant season for the Greater Western Victoria Rebels and Vic Country.\n\"It's obviously a little bit nerve-racking but I'm super excited,\" Johnstone told The Standard.\n\"Even if I don't go, I'm super happy for all the other girls and all my other mates that might go. I'm just looking forward to the night really, it's going to be pretty fun.\"\nJohnstone's 2025 season was a memorable one, brimming with accolades.\nThe tough 171-centimetre on-baller who can play forward and hit the scoreboard, co-captained the Greater Western Victoria Rebels in the Coates Talent League and averaged 21 disposals and kicked 13 goals from 13 games.\nThe teen, who boasts a penetrating kick and superb aerial skills, won the Rebels best and fairest, was runner-up in the league's top award and was named in the team-of-the-year on the half-forward flank.\nShe also represented Vic Country in all four games at the under-18 national championships, featuring in the best players twice and earning All-Australian selection.\nJohnstone's bottom-age year was impressive but she took her game to another level in 2025.\n\"Sort of being another year older (helped) and I think I did definitely put my head down over the off-season,\" she said.\n\"And especially in the back end of my bottom age year it all started to come together for me and I realised that I could actually take this all the way if I really wanted to.\n\"So I put my head down and worked really hard and worked on what I needed to work on and also improved my strengths. And I sought extra help from the Rebels and all the staff over there.\n\"I just worked on my weaknesses and refined strengths and I think I pushed myself that little bit harder because I had that motivation, (knowledge) I could do this and I think it all really paid off this year.\"\nRebels coach Sally Riley said Johnstone's consistency went to new heights in 2025, saying the teenager \"didn't have a bad game all year\".\nRiley, an AFLW premiership player with Adelaide, noticed the necessary change in Johnstone's belief.\n\"What changed, is it became a reality (for her) - this could potentially be real,\" she said.\n\"Maggie undersells herself a lot and we've spoken before that she didn't have the belief that she should have.\n\"And I'll never forget telling her (12 months ago) that 'Maggie, your mindset is honestly going to make or break you. So you need to sort it quick smart or you won't be a chance of getting drafted'.\n\"Sometimes a bit of tough love from her support network, I suppose, motivated her but she's put herself in a really good position for her dream to come true hopefully.\"\nRiley, who handed a 15-year-old Johnstone her under-18 Rebels debut in 2023, said the the club was already missing her presence.\n\"Because of how coachable she is, committed, seeks the feedback and is a real leader around the group,\" she said.\n\"Everywhere you get these players where you wish you could keep them forever purely because they make others better around them. Maggie's been outstanding to coach and wherever she ends up, the club are pretty lucky.\"\nRiley anticipates Johnstone will \"thrive\" in a professional environment given the opportunity.\n\"It will be a huge step up initially and quite the challenge,\" she said.\n\"Whether it's relocating, it might be interstate or living in Melbourne, it will be a huge change for Mags. But she was born to play at that next level where she's really challenged and she'll come into it quite well where she can play a pretty consistent role at that next level if a club gives her a chance.\n\"She'll love the environment, the training standards and I suppose the expectations, just because she's already done that at such a high level at juniors.\"\nJohnstone's footy journey began when she was eight in Warrnambool and District league club Dennington's Auskick program.\nShe took up the sport because she looked up to older brother Darcy, who was lining up for the Dogs - the same club her dad also played with.\nFrom there, she progressed to the under-12 side and stayed there until she could no longer play alongside the boys.\nShe then joined South Warrnambool's girls' program where she was thrust straight into its successful under-18 Western Victoria Female league team.\n\"That was a huge jump, starting at 14 in the under-18 girls',\" she said.\n\"It was awesome working against the bigger bodies and learning off them and all the mature girls up there.\"\nJohnstone, who boarded at Ballarat Grammar for her final two years of school in 2024 and 2025, is extremely appreciative of her parents, Leigh and Jeanna, for their support in chasing her football dreams.\nShe is grateful for all the time they have spent travelling, taking her to games and training sessions, as well as their ability to help keep her motivated.\nSpending a lot of her time in Ballarat, Johnstone lists Riley, Rebels boys' coach Eamon Gill and the club's talent operation's lead Brooke Brown as some of her biggest mentors.\n\"Brooke Brown and Sally Riley from the Rebels, they've been awesome for me over my journey with them over the past four years but also Eamon Gill,\" she said.\n\"He's in the boy's program but he lived in my boarding house. His wife (Emma) is my head of house, so basically my second mum down in Ballarat and he was my second dad.\n\"He's been awesome, we went for kicks and that sort of stuff at the school oval in the morning. He always had advice for me, doing vision and that sort of stuff, all those little extras that really help over the years.\"\nThe 2025 AFLW Draft gets under way at 7pm on Monday from Marvel Stadium.\nJohnstone, whose older sister Alyssa was previously on Geelong's VFLW list, said it would \"mean the world\" to hear her name called.",
  "word_count": 1120,
  "scraped_at": "2026-02-14T12:44:09.428047"
}