{
  "article_id": "0f72787ac42a",
  "url": "https://www.foxnews.com/entertainment/jurassic-park-celebrates-30th-anniversary-cast-then-now",
  "title": "  Jurassic Park  celebrates 30th anniversary : The cast then and now",
  "date": "20230611T111500Z",
  "domain": "foxnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Steven Spielberg's 1993 hit movie \"Jurassic Park\" is celebrating its 30th anniversary.\nThe movie brought dinosaurs to the big screen, and it also broke barriers in terms of computer-generated imagery and practical effects.\nIn the movie, Dr. John Hammond realizes his dream of bringing dinosaurs back from extinction, deciding to build a theme park around them. He is successful in his initial goal, however, during a test run prior to the park's grand opening, some of the dinosaurs escaped their enclosures and things go horribly wrong.\nHere is a look at where the film's stars are now:\nSam Neill\nNew Zealand actor Sam Neill started his career appearing in local TV shows in the 1970s, getting his big break in the 1977 film, \"Sleeping Dog.\" He followed that up with a number of successful roles, getting a Golden Globe nomination for his role in the miniseries \"Reilly: Ace of Spies,\" before getting cast as Alan Grant in \"Jurassic Park.\"\nAfter the success of \"Jurassic Park,\" Neill continued to act in both Australian and American films, including \"In the Mouth of Madness,\" \"The Jungle Book,\" \"Event Horizon\" and \"Bicentennial Man.\" He started the 2000s with a few smaller projects before retuning to the role of Alan Grant in \"Jurassic Park III.\"\nThe actor received an Emmy and Golden Globe nomination for his role in the miniseries \"Merlin.\" He continued to act in smaller films and TV movies, including \"Stiff,\" \"Framed\" and \"Perfect Stranger,\" and on shows such as \"To the Ends of the Earth\" and \"Mary Bryant\" before landing a 10-episode arc on \"The Tudors.\"\nNeill appeared in a few movies, such as \"Under the Mountain\" and \"The Vow\" with Rachel McAdams, he had a 14-episode arc on \"Crusoe\" and an eight-episode arc on \"Happy Town,\" followed by a starring role in the Fox drama \"Alcatraz.\"\nHe then had a recurring role on the popular Netflix show, \"Peaky Blinders,\" and appeared in movies like \"The Daughter,\" \"Hunt for the Wilderpeople\" and \"Sweet Country\" before joining the Marvel Cinematic Universe in \"Thor: Ragnarok\" as an Asgardian actor playing Odin in a play. He returned to the role in 2022 for \"Thor: Love and Thunder.\"\nIn 2019, it was announced he would be reprising his role as Dr. Alan Grant in the final installment of the \"Jurassic Park\" reboot trilogy, \"Jurassic World: Dominion,\" along with several other members of the original cast. His most recent acting credit was as Dennis Tanner in \"The Portable Door.\"\nWhile filming \"Omen III: The Final Conflict\" in 1980, Neill met and started a relationship with Lisa Harrow, and the two had a son together, Tim Neill. In 1989, Neill married makeup artist Noriko Watanabe and had a daughter, Elena, with her. He also adopted Maiko Spencer, Watanabe's daughter from a previous relationship.\nIn March 2023, Neill announced he was diagnosed with non-Hodgkin's lymphoma in March 2022. He was diagnosed after noticing that the glands in his neck did not feel right during the premiere for \"Jurassic World: Dominion.\" After learning about his diagnosis, Neill began writing a memoir.\n'JURASSIC PARK' STAR SAM NEILL REVEALS HE HAS 'FEROCIOUS' STAGE 3 CANCER\nShortly after revealing his diagnosis, Neill posted a video on Instagram, reassuring his fans he \"is alive and kicking\" and already going back to work.\n\"My news seems to be all over the news at the moment, and it’s sort of ‘Cancer! Cancer! Cancer!’ Which is slightly tiresome because, as you see, I am alive and well. And I have been in remission for eight months, which feels really good,\" he said in the video at the time.\nIn his memoir, Neill wrote about his experience filming the iconic movie, going into detail about when Hurricane Iniki hit the island of Kauai, Hawaii, where they were filming. He explained the entire cast was taken to the ballroom of the hotel they were staying in, saying it was a category 4 hurricane when it made landfall, wrecking the island and resulting in six deaths and $3 billion worth of damage.\n\"We almost died in the first few weeks where we were filming on Kauai in the Hawaiian archipelago,\" Neill wrote. \"One morning we were told to stay back at the hotel and expect a hurricane later in the day. I was down on the beach with Laura Dern, who asked me: 'Sam, do you think we might die today?' As these massive black clouds approached over the Pacific I found I had to tell her that in all honesty the answer was yes, I thought we might.\"\nLaura Dern\nLaura Dern comes from a family of actors and had already been nominated for a Golden Globe and Academy Award for her role in \"Rambling Rose\" before landing the role of Dr. Ellie Sattler in \"Jurassic Park.\"\nAfter the success of \"Jurassic Park,\" Dern appeared in Alexander Payne's \"Citizen Ruth\" and then had a guest spot on the sitcom \"Ellen\" for \"The Puppy Episode.\" In the episode, Dern played a lesbian who helps Ellen DeGeneres' character realize she's gay, leading to DeGeneres coming out on the show and in real life.\nWhile the guest appearance earned her a third Emmy Award nomination, it also resulted in a lot of backlash, according to Dern. When she was a guest on \"The Ellen DeGeneres Show,\" she revealed no one on her team wanted her to take the role, and as a result of doing it, she didn't get work for a while.\nIn 1999, Dern was nominated for a Golden Globe for her performance in the TV movie, \"The Baby Dance.\" She also starred in \"October Sky\" with Jake Gyllenhaal, \"Daddy and Them\" with Billy Bob Thorton, \"I Am Sam\" with Dakota Fanning, Sean Penn and Michelle Pfeiffer, and returned to the role of Dr. Ellie Sattler in \"Jurassic Park III.\"\nShe then starred in \"We Don't Live Here Anymore,\" \"Happy Endings,\" \"Lonely Hearts,\" \"Year of the Dog\" alongside Molly Shannon and John C. Reilly, and \"Recount,\" for which she won a Golden Globe Award and was nominated for an Emmy Award.\nIn 2010, Dern had the unique honor of getting a star on the Hollywood Walk of Fame at the same time as her mother, Diane Ladd, and her father, Bruce Dern, becoming the first family to receive the honor on the same day. From 2011 to 2013, Dern starred in her own HBO show, \"Enlightened,\" for which she won a Golden Globe and was nominated for an Emmy.\nOnce \"Enlightened\" came to an end, Dern starred in \"The Fault In Our Stars,\" \"When the Game Stands Tall\" and \"Wild,\" playing Reese Witherspoon's character's mother, a role that earned her a second Academy Award nomination.\nShe continued to act steadily, starring in \"Star Wars: The Last Jedi,\" \"The Trial,\" a role that earned her an Emmy and Golden Globe nomination, and \"Big Little Lies,\" a role that earned her an Emmy Award win in 2017 and nomination in 2020 as well as a Golden Globe Award win.\nIn 2019, Dern appeared in two movies that were nominated for best picture at the Academy Awards, \"Marriage Story\" and \"Little Women.\" In \"Marriage Story,\" Dern played a cutthroat lawyer who helps Scarlett Johansson's character during her divorce. For her role in the movie, she won an Academy Award, Golden Globe, BAFTA, Critics Choice Award and a Screen Actors Guild Award.\n‘JURASSIC PARK’S’ LAURA DERN, SAM NEILL REFLECT ON 20-YEAR AGE GAP ROMANCE\nMost recently, the actress returned to the role of Dr. Ellie Sattler in \"Jurassic World: Dominion,\" starred in \"The Son\" and lent her voice in two episodes in the second season of \"The White Lotus.\"\nAfter meeting musician Ben Harper at one of his concerts in 2000, he and Dern began a relationship, eventually tying the knot five years later in December 2005. The couple have two children together, a son, Ellery, born in 2001, and a daughter, Jaya, born in 2004. She is also stepmother to Harper's children from a previous relationship, his son, Charles, and his daughter, Harris.\nJeff Goldblum\nJeff Goldblum started his acting career in the mid 1970s, landing his first film role in 1974's \"Death Wish\" and acted steadily for many years before landing the role of Ian Malcolm in \"Jurassic Park.\" He had also already received an Academy Award nomination for directing the short film \"Little Surprises.\"\nFrom there, Goldblum continued to appear in successful films such as \"Nine Months\" and \"Independence Day,\" returning to the role of Ian Malcolm for \"The Lost World: Jurassic Park.\" Goldblum then didn't appear on-camera in a film for a few years, returning in 2000 for \"Auggie Rose\" and \"Igby Goes Down.\" He went on to star in Wes Anderson's 2004 movie, \"The Life Aquatic with Steve Zissou.\"\nHe later appeared as a guest in shows like \"Friends\" and \"Will & Grace,\" for which he received his first Emmy nominations, before getting cast as Detective Zach Nichols on \"Law & Order: Criminal Intent,\" replacing Chris Noth as lead detective.\nGoldblum then acted in \"The Switch\" alongside Jason Bateman and Jennifer Aniston, and \"Tim and Eric's Billion Dollar Movie\" before appearing in shows like \"Glee\" and \"The League.\" He then reunited with Wes Anderson, starring in the Academy Award nominated film, \"The Grand Budapest Hotel.\" Around this time, he began performing at the Carlyle Hotel with his jazz band.\nHe went on to appear in \"Last Week Tonight with John Oliver,\" \"Mortdecai,\" \"Inside Amy Schumer\" and \"Unbreakable Kimmy Schmidt,\" and he also voiced characters in multiple video games throughout the years, including \"Call of Duty: Black Ops III\" and \"Resurgence: It's Early Albuquerque.\"\nIn 2016, he reprised his role as David Levinson in \"Independence Day: Resurgence\" and then starred as Grandmaster in \"Thor: Ragnarok.\" From 2012 to 2018, Goldberg appeared in eight episodes of \"Portlandia,\" and also in 2018, provided his voice for the Academy Award-nominated animated film \"Isle of Dogs.\"\nAlong with voicing characters in the \"Jurassic\" video games as Ian Malcolm, Goldblum returned to the character in 2018 for \"Jurassic World: Fallen Kingdom\" and then again in the 2022 movie \"Jurassic World: Dominion.\" He then voiced a character in the animated movie \"The Boss Baby 2: Family Business\" and in the Marvel series \"What If…\"\nJEFF GOLDBLUM TAKES ONE MORE BITE OUT OF ‘JURASSIC WORLD’\nSince 2019, he has starred on the Disney + show \"The World According to Jeff Goldblum,\" for which he received two Emmy nominations. Most recently, the actor appeared in the shows \"Search Party,\" \"Dark Dice\" and \"Big Mouth,\" and it was announced in March 2023 he would star in the film adaptation of the Broadway musical \"Wicked.\"\nGoldblum was married to actress Patricia Gaul from 1980 to 1985, after which he married actress Geena Davis in 1987. The two were in a few films together, including \"Transylvania 6-5000,\" \"The Fly\" and \"Earth Girls Are Easy,\" and they were married for three years before Davis filed for divorce in October 1990. Their divorce was finalized a year later.\nIn 2014, the actor announced he was engaged to Olympic rhythmic gymnast, Emilie Livingston, with the couple officially tying the knot in November 2014. They have two children together, Charlie, 7, and River, 5.\nRichard Attenborough\nRichard Attenborough already had an illustrious career as an actor before taking on the role of Professor John Hammond in \"Jurassic Park,\" appearing on-screen for the first time in the 1942 film \"In Which We Serve.\" Prior to appearing in \"Jurassic Park,\" he hadn't acted since the 1979 movie \"The Human Factor.\"\nIn 1983, Attenborough won an Academy Award for best director and best picture for the 1982 movie \"Gandhi.\"\nFollowing the success of \"Jurassic Park,\" Attenborough starred as Kris Kringle in the 1994 remake of \"Miracle on 34th Street\" and appeared in the 1996 film adaptation of Shakespeare's \"Hamlet.\" Although he appeared in Shakespeare plays as a stage actor, his role in \"Hamlet\" was the only time he appeared in a movie based on one of his plays.\nHe continued to act, appearing in \"The Lost World: Jurassic Park\" and providing his voice for the shows \"Tom and Vicky\" and \"It's Itsy Bitsy Time.\" Attenborough was also a successful producer and director, creating films such as \"In Love and War,\" \"Grey Owl,\" \"Closing the Ring,\" \"Chaplin,\" starring Robert Downey Jr., and \"Shadowlands.\"\nAttenborough was involved in a number of projects outside the entertainment industry, including acting as the president of the muscular dystrophy campaign and becoming the charity's honorary life president in 2004. He also founded the Richard Attenborough Arts Centre in England, which works with emerging talent and individuals with disabilities to help them start their careers.\nAs an avid soccer fan and champion of the Chelsea Football Club in England, Attenborough served as director of the club from 1969 to 1982; between 1993 and 2008, he held the honorary position of life vice president. His friendship with the club started in the 1940s when he began training with them in order to get in shape for a movie role.\nThe actor married his wife, Sheila Sim, in January 1945 and the couple lived together in London until 2012. Together, the couple had three children, Michael, Jane and Charlotte.\nACCLAIMED ACTOR-DIRECTOR RICHARD ATTENBOROUGH DIES AT 90\nIn December 2004, the couple's daughter, Jane, her mother-in-law and her 15-year-old daughter, Attenborough's granddaughter, Lucy, passed away when a tsunami struck Khao Lak, Thailand, where they were vacationing. Jane's son, Samuel, survived uninjured, and her daughter, Alice, survived but suffered severe injuries to her leg.\nIn August 2008, Attenborough was admitted into the hospital and given a pacemaker, and a few months later returned to the hospital after suffering a stroke in December 2008. In 2011, his brother, David Attenborough, explained Richard had to use a wheelchair due to his 2008 stroke and would no longer appear in films.\nA year later, in December 2012, as Attenborough's health continued to decline, he moved into a retirement home, with his brother telling the public he required around-the-clock care.\nJust five days shy of his 91st birthday, Attenborough passed away in August 2014. Per his request, his ashes were interned beside those of his daughter, Jane, and granddaughter Lucy. He was survived by his wife of 69 years, his two children, six grandchildren and his younger brother.\nJoseph Mazzello\nPrior to getting the role of Tim Murphy in \"Jurassic Park,\" Joseph Mazzello had appeared in small roles in \"Radio Flyer\" and \"Jersey Girl.\" His role as the dinosaur-loving grandson of John Hammond who gets stranded on an island full of dinosaurs was his big breakout role.\nFollowing the success of \"Jurassic Park,\" Mazzello starred in \"Shadowlands,\" which was directed by his \"Jurassic Park\" co-star Richard Attenborough. He then starred in \"The River Wild,\" \"The Cure,\" \"The Lost World: Jurassic Park,\" \"Star Kid\" and \"Simon Birch.\"\nFor a few years, Mazzello made guest appearances on TV shows such as \"Providence,\" \"CSI: Crime Scene Investigation\" and \"Without A Trace\" before appearing in the films \"Raising Helen,\" \"The Sensation of Sight\" and \"The Social Network.\" He also starred in the miniseries \"The Pacific\" and \"Coma.\"\nThe actor then appeared in \"Justified,\" 'G.I. Joe: Retaliation,\" \"Person of Interest\" and \"Elementary.\" Most recently, he appeared in \"Impeachment: American Crime Story\" as Paul Begala, \"Bohemian Rhapsody\" as Queen guitarist John Deacon, for which he won a Screen Actors Guild Award for cast in a motion picture, and the 2023 movie \"Unexpected.\"\nAriana Richards\nAriana Richards had been acting in small parts for six years prior to landing the role of Lex Murphy, one of Richard Attenborough's character's grandchildren who got stuck in the park with Dr. Alan Grant on \"Jurassic Park.\"\nShe then made appearances on \"The Golden Girls,\" \"Into the Homeland,\" \"My Sister Sam,\" \"I'm Gonna Git You Sucka,\" \"Prance\" and \"Switched at Birth.\"\nFollowing the success of \"Jurassic Park,\" Richards starred in \"Angus,\" \"Born Free: A New Adventure,\" appeared in an episode of \"Boy Meets World,\" and then reprised her role as Lex in \"The Lost World: Jurassic Park\" in a brief appearance.\nShe also dipped her toe in the music industry, appearing in the 1997 music video for the song \"Brick,\" by Ben Folds Five.\nRichards then starred in \"The Princess Stallion,\" \"Broken Silence: A Moment of Truth Movie\" and appeared in an episode of \"Total Security.\" After taking a break from acting for more than 10 years, Richards appeared on-screen for the last time in the movie \"Battledogs.\"\nFollowing her retirement from acting, Richards turned toward a quieter life as an artist, traveling the world to showcase her art. She told People in 2022 \"if some great role or project finds [her],\" it \"could be a nice thing to\" return to acting.\nThe actress married her husband, Mark Aaron Bolton, in 2013, and the couple has a daughter together.\nSamuel L. Jackson\nSamuel L. Jackson had been acting both on stage and in front of the camera for two decades, having originated the character of Willie in the play \"The Piano Lesson\" at the Yale Repertory Theatre before taking on the role of Arnold in \"Jurassic Park.\"\nAfter a few more small roles in film, Jackson had his breakthrough when he starred as Jules Winnfield in Quentin Tarantino's hit movie \"Pulp Fiction,\" a role he later found out was written specifically for him. For this role, Jackson was nominated for an Academy Award, a Golden Globe Award and won a BAFTA Award. That same year, he was also nominated for a Golden Globe for his role in the movie \"Against the Wall.\"\nJackson went on to star in \"Die Hard with a Vengeance\" and \"A Time to Kill,\" a role that earned him his third Golden Globe nomination. He then starred in \"One Eight Seven,\" \"Eve's Bayou,\" \"Jackie Brown,\" in which he reunited with Tarantino, \"The Negotiator,\" alongside Kevin Spacey, \"Sphere\" alongside Dustin Hoffman and Sharon Stone, and as Jedi Master Mace Windu in \"Star Wars: Episode I - The Phantom Menace.\"\nThe 2000s started with Jackson getting honored with a star on the Hollywood Walk of Fame as well as with starring roles in the films \"Rules of Engagement,\" \"Shaft,\" \"Unbreakable,\" with Bruce Willis, \"The Caveman's Valentine\" and \"Changing Lanes.\"\nIn 2002, Jackson reprised his role as Mace Windu in \"Star Wars: Episode II - Attack of the Clones.\" He revealed in an interview on \"The Graham Norton Show\" that his character's unique purple lightsaber came about because he wanted to be able to find himself in the big fight scene, and he pitched it as an idea to George Lucas.\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\nHe then starred in \"xXx,\" \"No Good Deed,\" \"In My Country,\" \"Twisted,\" \"The Incredibles,\" \"Coach Carter\" and the final installment of the Star Wars prequel trilogy, \"Star Wars: Episode III - Revenge of the Sith.\" Jackson starred alongside Julianne Moore in \"Freedomland\" before starring in the movie \"Snakes on a Plane.\" He was also honored with a hand and footprint ceremony at the TLC Chinese Theater.\nHe continued to appear in successful films like \"Jumper\" before making his first appearance as Nick Fury in the Marvel Cinematic Universe in \"Iron Man.\" He appeared as Fury in the Marvel films \"Iron Man 2,\" \"Thor,\" \"Captain America: The First Avenger\" and \"The Avengers,\" as well as \"Captain America: The Winter Soldier,\" \"Avengers: Age of Ultron,\" \"Infinity War,\" \"Endgame\" and \"Captain Marvel,\" as well as providing his voice for the Disney+ animated series \"What If…\"\nJackson has also starred in \"Unthinkable,\" \"The Samaritan\" and \"Django Unchained,\" in which he reunited with Tarantino again. He later voiced a character in the animated film \"Turbo.\" He starred alongside Michael Keaton and Gary Oldman in \"RoboCop,\" following that up with \"Kingsman: The Secret Service,\" \"Barely Lethal\" and \"The Hateful Eight.\"\nThe actor has continued his run of successful films, starring in \"The Hitman's Bodyguard\" and its sequel, \"Hitman's Wife's Bodyguard,\" as well as \"Incredibles 2,\" \"Glass\" and \"Shaft.\" Most recently he starred in \"The Protégé\" and the animated movie \"Paws of Fury: The Legend of Hank.\"\nCLICK HERE TO GET THE FOX NEWS APP\nJackson married actress and producer LaTanya Richardson in 1980 after the two met while students at Morehouse College. The couple welcomed daughter Zoe in 1982.",
  "word_count": 3380,
  "scraped_at": "2026-02-14T12:14:43.958640"
}