{
  "article_id": "0f74d64d59be",
  "url": "https://wtug.com/ixp/532/p/west-alabama-tuesday-briefing-80/",
  "title": "West Alabama Tuesday Briefing",
  "date": "20241217T203000Z",
  "domain": "wtug.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "West Alabama Tuesday Briefing\nGood morning West Alabama. It is Tuesday, December 17, 2024.\nTuesday Morning Observations:\nIt was refreshing this past Saturday to watch the tradition, pageantry, good sportsmanship and discipline that is the annual Army vs Navy Football rivalry. It is an intense event that surpasses any other rivalry for year around awareness. Just ask a soldier stationed on the DMZ in Korea or sailor on an aircraft carrier in the Mediterranean what it means to them.\nWhat makes the Army/Navy rivalry special is the young men who have passed rigorous academic and physical tests just to qualify to be a cadet or midshipman. After that it is impressive to see young people who are rooted in patriotism and dedicated to service to their country compete. They know what they will do with their future is far more important to our nation than NFL draft status and big money contracts. They will contribute directly to our nation's security.\nThese young men wear the Army Gray or Navy Blue because they are committed to a higher calling at a time when so many young people have a negative view of patriotism and national service. They are fulltime students, fulltime cadets/midshipmen and part-time football players. They play the game because they love it not because they see dollar marks.\nThere is no \"Name, Image and Likeness\", no pay-to-play big bucks and no transfer portal. These young men are committed to playing for their service academies, loyal to their service and in most cases committed to sticking it out for four years with a schedule of classes, military training and football that most college players couldn't handle.\nNo matter what the season record for Army, Navy or Air Force academies, these young men are already winners when they step on the field simply because of who they are.\n(Opinions expressed in Morning Briefing are not necessarily those of the ownership, management or staff of Townsquare Media Tuscaloosa.)\nWeather:\nIf you are dreaming of a White Christmas it looks like that dream will not come true. The initial Christmas Day forecast calls for warmer temperatures across West Alabama. To see significant snow on the ground the long-range weather maps tells us it will take a trip to the Pacific Northwest or up north, way up north, to near the Canadian border to experience a Hallmark Christmas vista.\nThe 8 to 14 Day Outlook from the National Climate Prediction Center show above normal temperatures and a lack of measurable precipitation for most of Alabama past Wednesday of this week.\nRead More: Alabamians Who Want a White Christmas: Here’s Where To Find Snow\nThe Forecast:\nTopping the News:\nBird Flu is causing concern in Alabama. Tests at the Alabama State Diagnostics Laboratory in Auburn have confirmed Avian Influenza in 116,000 birds in Pickens and Cullman which had to be euthanized. State Veterinarian Dr. Tony Frazier believes the infestation came from migratory waterfowl.\nThe chicken facilities in these two counties are now under quarantine and birds within 6.2 miles of the infected flocks will be monitored.\nA December 8th wreck on Fayette County Road 73 near Glenn Allen killed Steven Bradley Collins, 40, and his toddler daughter, 2-year-old Ryleigh Collins in Fayette County. Also injured was Wendy Bailey, the child's mother, and she is still in critical condition. But in a press conference yesterday police stated they are desperately searching for answers about the location of 1-year-old Kahleb Rowan Collins who is unaccounted. Anyone with information is asked to 205-932-3205 and ask for Investigator Brandon Collins.\nRead More: ALERT: 1-Year-Old Missing in Fayette County After Wreck that Killed Father & Infant Sister\nAnother Winn Dixie store in Tuscaloosa County will close early next year and convert to an ALDI. The change-over comes after the German supermarket chain acquired Southeastern Grocers in 2023.\nCrime scene technicians recovered more than 200 shell casings after a firefight between a group of people at an apartment at Springville Landing in the 1000 block of Huffman Road in Birmingham.\nA 9-year-old child, in a nearby apartment, was wounded during the gunfire and was transported to a hospital with non-life-threatening injuries.\nOne group was at an apartment and the other group in the parking lot when the gunfire broke out.\nBirmingham Police continue to investigate.\nThe Choose Act goes into effect on January 2nd giving Alabama families $7 thousand in a state-funded education savings account for private school tuition. Only a specific group of students will initially be eligible. All students will be able to participate beginning in 2027.\nThe act was passed by the legislature this past spring at the urging of Governor Ivey.\nFor the second year in a row, Mind Changers, a non-profit organization dedicated to empowering and motivating young men and women, delivered toys to Eutaw Elementary School in Greene County.\nStudents Pre-K to 3rd grade received the early Christmas presents.\nThe City of Northport's Fourth Annual Christmas Open House is scheduled for this Thursday. The event will run from 5:00pm until 8:00pm at Northport City Hall (3500 McFarland Blvd.).\nHot chocolate and cookies with Santa will be a highlight of the holiday evening.\nTopping Sports News:\nThe Bama men’s Basketball Team is up to 6th in the new AP College Basketball Poll after knocking off Creighton Saturday night.\nThe Tide is back on the road Wednesday night at North Dakota. The game will tip at 8:00pm on the CBS Sports Network and the Crimson Tide Sports Network.\nUA returns home for a rare Sunday afternoon game at Coleman Coliseum against Kent State. That game tips at noon.\nRead More: The Tide Rise in AP Poll Following Rivalry Win Over Creighton\nThe 10-1 Alabama Women's Basketball Team remains just out of the AP Top 25 this week at #26. There are seven SEC teams ranked in this week's poll.\nBama's next game is in West Palm Beach, FL against Michigan State Sunday at 3:30pm.\nClick TuscaloosaThread.com for the latest West Alabama news, sports and weather. Better yet, download the app.\nHave a terrific Tuesday!!",
  "word_count": 1007,
  "scraped_at": "2026-02-14T13:16:58.933037"
}