{
  "article_id": "0fd9d13edc0f",
  "url": "https://www.themag.co.uk/2023/06/new-newcastle-united-2023-24-home-shirt-launched-newcastle-united-fans-react/",
  "title": "New Newcastle United 2023 / 24 home shirt launched - Newcastle United fans react",
  "date": "20230609T163000Z",
  "domain": "themag.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "New Newcastle United 2023/24 home shirt launched – Newcastle United fans react\nThe new Newcastle United 2023/24 home shirt has been launched on Friday (9 June 2022/23)\nA Newcastle United official announcement (see below) confirming that it will go on sale from Saturday.\nThe new Newcastle United 2023/24 home shirt / kit much anticipated.\nThis is how Newcastle United fans have reacted to the new shirt design, responding to the club’s launch on social media:\n‘Really like that! Best kit we’ve had for a while imo.’\n‘Will I still need to buy 4 sizes bigger or will this large actually be a large.’\n‘It really is amazing what difference a sponsor names. Now the sela matches the shirt it looks 400x better than the previous one.’\n‘Fantastic kit, best in a long time but shouldn’t be white socks.’\n‘Great shirt. Glad they listened about a black and white sponsor. Look good with the champions league badge.’\n‘First kit i will buy in about 8 years, looks beautiful.’\n‘How much are you selling it to a Man Utd fan?\nHate to admit but I like everything about this jersey.’\n‘Beauty.’\n‘Absolutely love it.’\n‘I like this jersey 10/10.’\n‘Why does it look like fifa?’\n‘White socks???’\n‘Superb, simple design. I love it.’\n‘Ooh I like it. Wasn’t sure about white socks but I do actually like it as a full kit.’\n‘Take my money!!!’\n‘That’s so much nicer than previous years.’\n‘Me likey a lot! Yes to white socks.’\n‘The white socks and having a logo in black and white works soo so well.’\n‘Our best shirt in years and they ruin it with white socks.’\n‘Looks ok. The shoulders area looks stuck on rather than a seamless part of the shirt. We’ve only got like a year left iirc with Castore. Then hopefully Adidas/Nike.’\n‘Belter’\n‘Stunning’\n‘What’s not to love.’\n‘It’s average I suppose.\nWe will need a Nike or Adidas to get a real good design.\nLook at the design inspiration in a Juventus shirt.’\n‘After some quite dodgy designs in recent years, this is a thing of simple beauty. Classic Newcastle United.’\n‘Love the new sponsor. Kit is bang average but very good for castore. Praying it’s the last kit from them.’\n‘It’s a beautiful shirt that like.’\n‘(Arsenal fan) The most Non-League looking kit that a Champions League side will ever wear.’\n‘This one’s actually quite lush. Didn’t expect it.’\n‘Website will crash tomorrow as we all log on to buy one.’\n‘Stunning kit fair play done a great job.’\n‘Gorgeous shirt, one of the best for many years!’\nNewcastle United 2023/24 home shirt official announcement – 9 June 2023:\n‘Premium performance sportswear brand Castore has today revealed the latest Newcastle United home kit, to be worn by the club throughout the 2023/24 season.\nThe new season marks three years of partnership between Castore and Newcastle, with the Manchester-based company designing and manufacturing high-performing playing and training kits for the Premier League side.\nAfter a successful campaign, which saw the Magpies finish inside the top four, next season’s kit will be the first to feature the Champions League logo in 20 years.\nThe new kit features a 1980s retro inspired collar and remains traditional, featuring the club’s iconic black and white stripes – celebrating past triumphs as the Magpies enter a new era under head coach Eddie Howe.\nThe jersey boasts a split side hem for movement, laser cut holes in the underarms for breathability, a dropped and shaped hem to give the top style, and the distinctive Newcastle United club crest woven on the left side of the chest.\nThe shorts feature contrasting panels and a side seam split for range of movement, with the woven crest on the right thigh. And finally, the socks include a cushioned heel and footbed, while displaying ‘NUFC’ proudly on the front, with Castore branding on the calf.\nTom Beahon, co-founder at Castore, said: “We are incredibly proud to reveal the latest Newcastle kit for the upcoming 23/24 campaign. This season marks our third with this fantastic club, and we couldn’t be happier to see their inspiring success in the Premier League this season.\n“The strip pays tribute to the rich heritage of Newcastle United Football Club, while encompassing a slick, modern style and key high-performance features required for elite level sports.\n“We’re looking forward to seeing the side take on Europe next season and will be hoping they can continue the impressive feats they have thus far achieved since Eddie Howe joined the club.”\nPeter Silverstone, Chief Commercial Officer at Newcastle United, said: “We are excited by the launch of our 2023/24 home kit, which we know will inspire both our men’s and women’s players on the pitch and our incredible fanbase off the pitch.\n“Castore has done an incredible job to design a sleek and modern kit that taps into our rich club heritage.\n“I think our fans will also be delighted with the way Castore have incorporated our new front-of-shirt sponsor, Sela, into this fantastic design.\n“Our teams and our fans will proudly wear this kit as we welcome the world to St. James’ Park next season; excitedly embarking upon another Premier League campaign and our return to the UEFA Champions League.”\nThe kit will be on sale in stores and at shop.nufc.co.uk from 8am BST on Saturday, 10th June 2023.’\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 908,
  "scraped_at": "2026-02-14T12:46:03.932869"
}