{
  "article_id": "100c6a1fa294",
  "url": "https://www.bbc.co.uk/sport/football/67106180",
  "title": "Women Super League : Five talking points as England star Beth Mead could return",
  "date": "20231014T034500Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Women's Super League: Five talking points as England star Beth Mead could return\n- Published\nThe Women's Super League has already provided plenty of drama after its first two weekends, with shock results and two unlikely clubs leading the pack.\nDefending champions Chelsea take on West Ham on Saturday in the weekend's opening game as they look to improve on last weekend's draw with Manchester City.\nOn Sunday - live on BBC One - Arsenal welcome Aston Villa to the Emirates, and a Lionesses star could make her long-awaited homecoming.\nHere are the main talking points before the weekend's games.\nMead could return at Emirates\nIt has been a difficult start to the season for Arsenal - they currently sit ninth with just one point from two games - but they could be significantly boosted this weekend as Beth Mead, who has been sidelined since rupturing her anterior cruciate ligament in November, could finally make her return.\nMead has scored 57 goals in 148 games for Arsenal and could be the perfect tonic to help to correct an underwhelming start.\n\"We have one more training session to go and if she comes through that she will be 100% ready for squad selection,\" manager Jonas Eidevall said on Friday.\nThere are still other notable ACL absentees missing from the squad, though, with club record goalscorer Vivianne Miedema only having recently returned to training, while Eidevall said there is \"no way\" England captain Leah Williamson will be back before Christmas.\nArsenal, who suffered a shock defeat at home to Liverpool on the opening day before drawing away to Manchester United, will face an Aston Villa side who have been tipped for big things this season but are yet to get off the mark this season.\nCan Liverpool and Leicester continue winning starts?\nFew would have predicted that Leicester City and Liverpool would be the only teams with perfect records after the first two games of the season.\nLeicester, who finished 10th in 2022-23, have beaten Bristol City and Everton, while Liverpool's record is arguably even more impressive thanks to triumphs over Arsenal and Aston Villa.\nFoxes manager Willie Kirk said: \"We're maybe a little bit ahead of the curve, but we're certainly not going to rest on our laurels, and we'll want to keep that improvement coming and get to the levels we think we can get to as soon as possible.\"\nLiverpool look to continue their bid to improve on last season's seventh-place finish as they welcome Everton to Anfield for the second season running, although they will be hoping for better than their 3-0 defeat last year.\n\"We're in a much different place to where we were this time last year,\" said Liverpool boss Matt Beard. \"With these games form goes out of the window - we've had a good start and they haven't.\"\nMore refereeing drama on the cards?\nThere has been no shortage of controversy in the opening two rounds of fixtures, with two red cards being handed out on both weekends.\nBefore the start of this campaign there had only been four weekends in total with two or more dismissals since the league was established in 2011.\nThe team hit hardest so far is Manchester City, who have had three players sent off in two matches. Alex Greenwood and Lauren Hemp will return after they each served one-match suspensions in midweek, but they're still without Leila Ouahabi who picked up a three-match ban in their opening game.\nAs a stringent crackdown on dissent across English football continues, will any more WSL players find themselves being caught out by the stricter rules?\nWill there be more early twists in the title race?\nAll of the traditional favourites for the Women's Super League title have faltered to some extent already this season.\nManchester City and Chelsea shared points last weekend, while Arsenal and Manchester United did the same.\nArsenal have just one point so far, while the rest of last season's top four are level on four.\nMan City will be strong favourites against pointless Bristol City, but the rest face trickier match-ups, with Chelsea taking on West Ham, Manchester United hosting Leicester, and Arsenal facing Aston Villa.\nIn a season with only 22 games, of which champions Chelsea lost only two last year, they will all be eager to avoid any more early slip-ups.\nStar strikers ready for starts\nChelsea's Sam Kerr and Manchester City's Khadija Shaw are still waiting for their first league starts after coming back from injury, but they could both be back and troubling defences this weekend.\nKerr came on as a substitute against City last weekend while Shaw started and scored against Everton in the League Cup on Wednesday.\nCity manager Gareth Taylor said it was \"fantastic\" to have her back, describing her as \"an influential player, a player the team really look to in terms of setting off everything we do\".\nShaw finished second in the Golden Boot race with 20 goals last term while Kerr was fourth, scoring 12.\nKerr will be hoping luck is on her side this time after narrowly missing out on a winner when she struck the woodwork in injury time against City last Sunday.",
  "word_count": 868,
  "scraped_at": "2026-02-14T12:22:18.140790"
}