{
  "article_id": "10371facfe45",
  "url": "https://www.jacksonville.com/story/entertainment/events/2023/02/22/monster-jam-in-jacksonville-what-to-know-about-monster-truck-event/69925436007/",
  "title": "Monster Jam in Jacksonville : What to know about monster truck event",
  "date": "20230222T123000Z",
  "domain": "jacksonville.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Monster Jam 101: What you need to know before Saturday's big event\nThe big trucks are back for an evening of smoke-throwing, tire-shredding, dirt-flinging destruction. Here’s what you need to know before heading out to Monster Jam on Saturday at TIAA Bank Field.\nWhat day is Monster Jam in Jacksonville?\nMonster Jam is scheduled for Saturday, Feb. 25.\nWhat time do the gates open for Monster Jam?\nGates open at 5 p.m. The event starts at 7 p.m. but a Monster Jam Trackside preview show, with driver interviews, merchandise giveaways and opening ceremonies starts about 6 p.m.\nWhat about the Pit Party?\nThe Pit Party is a separately ticketed event that runs from 2:30-5:30 p.m. at the stadium where fans can meet drivers and get a close-up look at the trucks. Tickets for the Pit Party are $20 and you must also have a ticket for the main Monster Jam to attend.\nWhere is Monster Jam Jacksonville?\nAgain this year, Monster Jam will be held at TIAA Bank Field, the home of the Jacksonville Jaguars.\nIs it better to sit high or low at Monster Jam?\nThat depends. Like a football game, lower seats in the middle of the stadium offer some of the best views of the action on the field. But noise levels can be very loud. How loud? The National Institute for Occupational Safety and Health studied the level of noise at a monster truck show in Cincinnati in 1998 and found that the crowd at the show was exposed to average noise levels of 90-100 decibels and maximum noise levels of around 125 decibels. Hearing protection is recommended for exposure over 85 decibels, so it’s a really good idea to bring earplugs.\nAre Monster Jam tickets are still available?\nYes. Tickets for Monster Jam are $20-$72. Everyone age 2 or older must have a ticket.\nHow early should I get to Monster Jam? Will traffic be bad?\nMonster Jam typically draws one of the largest crowds of the year. Couple that with new traffic patterns near the stadium and other downtown events (the Jacksonville Icemen play Saturday night at VyStar Veterans Memorial Arena, the Jacksonville Symphony plays a salute to Aretha Franklin and Tina Turner at Jacoby Symphony Hall, Frankie Beverly and Maze are at the Moran Theater, magician Justin Willman is at the Florida Theatre) and you can probably expect to sit in traffic for a while on Saturday. The best plan is to leave early and allow plenty of time before the 7 p.m. start time.\nIs there more than one Grave Digger?\nMonster Jam is a big business, too big to limit itself to one venue at a time. So, while fans are watching their favorite trucks smash cars in Jacksonville, other fans will be doing the same thing in Allentown, Pa.; El Paso, Texas; Wichita, Kansas.; and Hartford, Conn. Each one has its own Grave Digger competing.\nDo they crush cars at Monster Jam?\nRest assured that cars will be smashed (probably a few vans and buses as well). But drivers also compete in races, two-wheel skills contests and a freestyle competition.\nDo other countries have Monster Jam?\nIt’s hard to imagine anything more American than gigantic monster trucks smashing school buses in front of a stadium of cheering fans. But the rest of the world has started to take notice. Monster Jam will have events this year in South Africa, United Arab Emirates, Germany and the Netherlands.\nHow big are monster trucks? What kind of gas do they burn?\nIf you’re driving a car with an internal combustion engine, you’ll definitely burn more gasoline on Saturday than the monster trucks will. That's because they run on ethanol. They also stand 10 ½ feet high, weigh 12,000 pounds and generate 1,500 horsepower. The tires are 66 inches in diameter and weigh 645 pounds apiece.\nAre there any female drivers at Monster Jam?\nKayla Blood will drive the Soldier Fortune truck in the Jacksonville competition. She is one of at least 13 women competing this season.\nWho’s competing in Monster Jam in Jacksonville?\n- Grave Digger, driven by Adam Anderson\n- Megalogon, driven by Todd LeDuc\n- El Toro Loco, driven by Jamey Garner\n- Max-D, driven by Tom Meents\n- Bakugan Dragonoid, driven by Camden Murphy\n- Great Clips Mohawk Warrior, driven by Bryce Kenny\n- Soldier Fortune, driven by Kayla Blood\n- Velociraptor, driven by Travis Mowery\n- Kraken, driven by Nick Pagliarulo\n- Black Pearl, driven by Cole Venard\n- Jester, driven by Matt Pagliarulo\n- Vendetta, driven by Mike Christensen",
  "word_count": 761,
  "scraped_at": "2026-02-14T13:33:57.429453"
}