{
  "article_id": "10453d9be3a8",
  "url": "https://www.yachtsandyachting.com/news/260121/Get-your-entries-in-to-rockupandrace",
  "title": "Get your entries in for the # rockupandrace British Keelboat League at Marconi Sailing Club",
  "date": "20230328T173000Z",
  "domain": "yachtsandyachting.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Get your entries in for the #rockupandrace British Keelboat League at Marconi Sailing Club\nby Paula Irish 28 Mar 2023 17:06 BSTMarconi Sailing Club is looking forward to welcoming teams from across the country for the next fixture in the British Keelboat League. The #rockupandrace series will be visiting the club on the east coast over the weekend of 3-4 June 2023 and entries are now open.\nRun by clubs, for clubs, BKL events provide fun, fast turnaround racing with a rigged and ready-to-go fleet of one-design keelboats at each venue.\nAs British Keelboat Development Manager Richard Moxey sums up: \"It's exciting and inclusive and it's really easy to take part!\"\nClubs can enter teams into one or more event and the winner and runner-up from each go through to a national final. The top four then have an opportunity to compete in the European Sailing Champions League in 2024.\nThe BKL series motto is: \"THINK Football Champions League - SAIL British Keelboat League\"\nCompeting in Europe this year following their 2022 BKL performance are Strathclyde University (Vilamoura, Portugal); Marconi SC and West Hoe SC (Sopot, Poland) and Royal Northern & Clyde YC (Berlin, Germany).\nThe first BKL qualifier of 2023 took place in February and saw Strathclyde University winning on home waters in Hunter 707s. A variety of venues nationwide enables teams to choose an event close to home or with the boats most suited to their skill set.\nEntry is managed by each venue and upcoming BKL dates are as follows:\n- 3-4 June: Marconi SC, SB20s\n- 24-25 June: Royal Northern & Clyde YC, Sonars\n- 22-23 July: Royal Corinthian YC, 707s\n- 19-20 August: Rutland SC, RS21s\n- 9-10 September: Women's BKL, Royal Southern YC, J70s\n- 29 September-1 October: Final, Royal Southern YC, J70s\n- There is also a BKL Sailability event 1-2 July 2023 at Weymouth & Portland National Sailing Academy\nMarconi SC is hosting its first-ever event for the series having been a regular competitor over many years. Organiser Peter Ward, who is also Coordinator for the British Keelboat League 2023, said: \"We love the format. Firstly, the BKL for anybody, irrespective of their usual class, and secondly it provides really competitive racing that has progression through to becoming British champions and then representing your club in the Sailing Champions League in Europe.\n\"Although it's called a keelboat league, it's suitable for any competitive sailor as the boats are really like big dinghies - you will be able to sail the keelboats we use and sail them well, and you can choose your team from across your club. The real beauty of the BKL is that it's so easy to join in. You don't have to own or trail a boat, you just turn up, have a little practice sail and then you're straight into racing.\n\"Each race is only 15 to 20-minutes so if you get it wrong, you're soon finished and then you get another go. You might start the day at the back of the fleet but you'll soon get quicker and you get very close racing. There are more teams than boats and when it's your time off the boat, there is a sharing of information between the competitors and clubs and it's very sociable. It's a really fun weekend. Get a group of mates together and come along, you will love it!\"\nEnter the Marconi SC qualifier now and to keep up with all the latest news for the BKL series follow @britishkeelboatleague on social media or visit www.britishkeelboatleague.co.uk\nRelated Articles\nBritish Keelboat League Finals at Royal Thames YCBurnham SC clinch title with dominant performance Three days of racing in the Solent saw clubs from around the UK Battle for their Burgee in the British Keelboat League Finals hosted by the Royal Thames Yacht Club. Posted on 24 Sep 2025 Sixteen Teams to fight for BKL Crown in Cowes\nBritish Keelboat League Finals will be hosted by Royal Thames YC Following an intense series of qualifying events, sixteen of the best keelboat racing clubs will fight it out for the next three days in the Solent at the British Keelboat League Finals hosted by the Royal Thames Yacht Club. Posted on 19 Sep 2025 Double bill for British Keelboat League\nDavid Haw Memorial Trophy and Women's SAILING Champions League event An action-packed double bill for the British Keelboat League saw teams battling it out both on the Solent in the UK and with the SAILING Champions League in Germany. Posted on 2 Sep 2025 SAILING Champions League 2025 final\nBritish clubs battle it out in Kiel Three British clubs battled it out over three days of close racing against Europe's top keelboat teams at the 2025 SAILING Champions League final in Germany. Posted on 15 Jul 2025 British Keelboat League returns to Rutland\nSecond qualifier to be hosted at the club is in 10 days The British Keelboat League is returning to Rutland Sailing Club for another weekend of fast and fun racing at the premier inland venue. Posted on 9 Jul 2025 British clubs get set for Champions League final\nBritish Keelboat League teams representing three UK clubs are off to Kiel Keelboat teams representing three British clubs will be taking on Europe's finest in the 2025 SAILING Champions League final in Germany. Posted on 7 Jul 2025 British Keelboat League coming to Burnham\nAt the Royal Corinthian Yacht Club on 26th & 27th April The next round of the British Keelboat League 2025 will be hosted by the Royal Corinthian Yacht Club in Burnham-on-Crouch, Essex on the 26th & 27th April. Posted on 10 Apr 2025 Double bill for British Keelboat League\nBoysterous Cup at Royal Southern, and Scottish Student Keelboat Championship A double bill for the British Keelboat League at opposite ends of the UK saw 22 teams competing at sold out events in Scotland and on the south coast. Posted on 26 Mar 2025 British Keelboat League bonanza at Rutland\nSolent University team take victory, with Burnham first club The latest round of the British Keelboat League 2025 saw eleven teams competing at Rutland Sailing Club over a weekend of brisk and brilliant close racing. Posted on 20 Feb 2025 Enter now for British Keelboat League at Rutland\nYou can #rockupandrace this February in supplied RS21s Entries are live for teams to #rockupandrace at Rutland Sailing Club with the British Keelboat League. The club will be welcoming teams from across the Midlands and beyond over the weekend of 15-16 February 2025. Posted on 24 Jan 2025\nUpcoming Events\nOpen Series for ILCA 7 and Merlin RocketWembley SC- 15 Feb Open Series for ILCA 7 and Merlin Rocket\nWembley SC- 22 Feb Open Series for ILCA 7 and Merlin Rocket\nWembley SC- 1 Mar Open Series for ILCA 7 and Merlin Rocket\nWembley SC- 8 Mar Winter TT Chris Black Memorial for Sprint 15 & Sport\nGrafham Water SC- 8 Mar Open Series for ILCA 7 and Merlin Rocket\nWembley SC- 15 Mar Open Series for ILCA 7 and Merlin Rocket\nWembley SC- 22 Mar Open Series for ILCA 7 and Merlin Rocket\nWembley SC- 29 Mar Silver Tiller & SW Series for Merlin Rocket\nSalcombe YC- 11 Apr to 12 Apr Open Meeting for Albacore\nMaidenhead UK- 12 Apr",
  "word_count": 1215,
  "scraped_at": "2026-02-14T12:44:52.034092"
}