{
  "article_id": "1047c610fc8e",
  "url": "https://www.bbc.com/mediacentre/2024/bbc-rts-programme-awards-wins",
  "title": "The BBC wins big at the RTS Programme Awards 2024",
  "date": "20240329T074500Z",
  "domain": "bbc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It was an incredible night for the BBC that celebrated the work of the extraordinary creative talent we have here in the UK. The wins speak to our unwavering commitment to backing the very best British storytelling and recognised our ability to bring people together which will be so important to us going into the future. I’m especially proud of the quality and innovation on display that really cements our reputation as the home for creative excellence and demonstrates the unique value of the BBC.\nThe BBC scooped a phenomenal 21 awards overall across the 30 competitive categories and dominated last night’s RTS Programme Awards.\nThe BBC was recognised with wins for programmes and talent across an outstanding range of impactful BBC content that captivated audiences across the UK.\nHit drama The Sixth Commandment was the most awarded programme of the night picking up three, followed by The Eurovision Song Contest and prison drama Time which both received two.\nThere were wins for Alex Scott, Bella Ramsey, Chris Packham, Eanna Hardwicke, Gbemisola Ikumelo, Hammed Animashaun, Hannah Waddingham, Lucy Edwards, Sarah Phelps and Tamara Lawrance.\nProgrammes awarded were A Kind of Spark, EastEnders, Fight the Power: How Hip Hop Changed the World, Happy Valley, Juice, Once Upon A Time in Northern Ireland, Scam Interceptors, Sort Your Life Out and the All Ireland Senior Football Championship Final.\nCharlotte Moore, BBC Chief Content Officer says: “It was an incredible night for the BBC that celebrated the work of the extraordinary creative talent we have here in the UK. The wins speak to our unwavering commitment to backing the very best British storytelling and recognised our ability to bring people together which will be so important to us going into the future. I’m especially proud of the quality and innovation on display that really cements our reputation as the home for creative excellence and demonstrates the unique value of the BBC.”\nWinners detailed in full:\nArts\nFight the Power: How Hip Hop Changed the World – BBC Studios for BBC\nBreakthrough Award\nLucy Edwards – Japan: The Way I See It The Travel Show – BBC Current Affairs for BBC\nChildren’s\nA Kind of Spark – Story Media for BBC\nComedy Drama\nJuice – Various Artists Limited for BBC\nComedy Performance – Female\nGbemisola Ikumelo – Black Ops\nComedy Performance – Male\nHammed Animashaun – Black Ops\nDaytime\nScam Interceptors – BBC Studios for BBC\nDocumentary Series\nOnce Upon a Time in Northern Ireland – Keo Films & Walk on Air Films for BBC\nDrama Series\nHappy Valley – Lookout Point in co-production with AMC for BBC\nEntertainment Performance\nHannah Waddingham – Eurovision Song Contest 2023\nFormatted Popular Factual\nSort Your Life Out - Optomen Television for BBC\nLeading Actor – Female\nTamara Lawrance – Time\nLimited Series\nThe Sixth Commandment – Wild Mercury Productions and True Vision for BBC\nLive Event\nEurovision Song Contest 2023 – BBC Studios, Windfall Films for BBC\nPresenter\nChris Packham – Inside Our Autistic Minds\nSoap and Continuing Drama\nEastEnders – BBC Studios for BBC\nSports Presenter, Commentator or Pundit\nAlex Scott – FIFA Women’s World Cup – IMG for BBC\nSports Programme\nAll Ireland Senior Football Championship Final – BBC Northern Ireland for BBC\nSupporting Actor – Female\nBella Ramsey – Time\nSupporting Actor - Male\nEanna Hardwicke – The Sixth Commandment\nWriter – Drama\nSarah Phelps – The Sixth Commandment\nMO",
  "word_count": 565,
  "scraped_at": "2026-02-14T12:31:36.655248"
}