{
  "article_id": "1060adf7aee4",
  "url": "https://menafn.com/1109107694/Lefa-To-Shake-Up-Coaches",
  "title": "Lefa To Shake Up Coaches",
  "date": "20250120T111500Z",
  "domain": "menafn.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "(\nMENAFN- The Post)\nMASERU\nThe Lesotho Football Association (LEFA) is set to carry out a major shake-up of the country's national team coaches.\nThe significant changes are expected to affect“all the coaching and support staff rosters” of Lesotho's national teams.\nAccording to a leaked internal memo, the only coaching staff that are expected to remain intact are that of the senior men's team, led by Leslie Notši, and the Under-20 men's side under Halemakale Mahlaha\nThe positions of all other national coaches in the men's and women's sides are going to be reviewed with the expectation that coaches will be replaced.\nLEFA held a press conference yesterday to outline the potential changes which were first revealed in an internal memo issued on Monday by LEFA's secretary general Mokhosi Mohapi.\nAccording to the memo, the tenures of all national team staff ended on December 31 with the exception of the men's senior national team technical personnel and Under-20 team.\nLEFA clarified that the tenures of those two national team staff members had been extended until January 31.\nThat move was made to allow LEFA's new National Executive Committee, which was elected in November, enough time to deliberate on whether to retain or release the coaches in charge of Likuena and the Makoanyane XI\nMohapi headed a press briefing yesterday, which was also attended by LEFA's president, Advocate Salemane Phafane, where he addressed the developments.\n“We know the sentiments, when we sit we evaluate, there are reports that were called during the month of November, we look at the reports, those reports will say how you have performed and whether there is a case for reinstatement,” Mohapi said.\nTeam performance is one factor that counts.\nFor Likuena, it has been a topsy-turvy 12 months.\nLesotho reached the final stage of 2025 African Nations Championship qualifying but ultimately fell at the last step, 2-1 on aggregate to Angola, depriving Likuena what would have been their first-ever appearance at a continental finals\nHowever, Likuena were disappointingly knocked out in the group stages of the 2024 COSAFA Cup last July.\nFor now, Likuena remains in the 2026 FIFA World Cup qualifiers, and LEFA is cautious about disrupting their progress.\nLesotho are in Group C alongside Rwanda, South Africa, Benin, Nigeria and Zimbabwe.\nThey are fourth on the log with five points from four games and are only two points behind the leaders in what has been an impressive qualifying effort so far.\n“We are not going to be oblivious to certain performances that deserve to be elongated, and let's be fair; in that (internal memo) it does communicate with the exception of a team (Likuena) that is in competition. We will not destabilise it because a term has to be this way,” he said\nMohapi also said Under-20 coach Mahlaha is exempted owing to a two-year contract he signed.\nHowever, Mehalalitoe head coach Shalane Lehohla, who was engaged for a year, faces review.\n“As for Mahlaha, he was given two years, and he was engaged later. Shalane always knew he was taking the (women's national) team for a year, but don't look at the coaches only, look at the backroom staff as well, the analysis will be made like the president said,” Mohapi said.\n“The cake is too big, it has to be given to others to see if they can cook,” he added.\nDecisions by LEFA NEC's are expected after a meeting tomorrow\nTlalane Phahla\nMENAFN20012025000229011070ID1109107694",
  "word_count": 573,
  "scraped_at": "2026-02-14T14:16:17.386639"
}