{
  "article_id": "10657d07ca97",
  "url": "https://theathletic.com/4533387/2023/05/18/marcelo-bielsa-uruguay/",
  "title": "How Marcelo Bielsa  fell into Uruguay lap  after interest from Everton , Leeds , Mexico and more",
  "date": "20230519T040000Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Uruguay’s famed Estadio Centenario was the backdrop on Wednesday for what the local press in Montevideo called a historic moment for the tiny South American country. Marcelo Bielsa was formally announced as Uruguay’s next manager after signing a contract through June of 2026.\nA day prior, Uruguay Twitter and Instagram accounts made three cryptic posts to tease Bielsa’s appointment and set the global news cycle abuzz. No words were needed. Just an image of the classic cooler that he uses as a touchline chair and the paper cup of coffee that he sips on during matches, an image of a technical area filled with footsteps, and one of a tactics board.\n“Say no more, the big man is back. Better keep his coffee warm,” wrote one person on Twitter.\n— Selección Uruguaya (@Uruguay) May 15, 2023\nBielsa is indeed back. The Argentine will take his mercurial personality and dogmatic tactics back to South America to lead one of the continent’s most talented sides. The 67-year-old is Uruguay’s second-ever foreign manager and the second Argentine.\nAdvertisement\nDaniel Passarella briefly coached the Uruguayans during the 2002 World Cup qualifying cycle, but Bielsa represents a massive change for Uruguayan football. The Uruguay national side had previously been managed by Oscar Tabarez, who held the position for 15 years until his dismissal in November of 2021. Diego Alonso, 48, took over for Tabarez and managed Uruguay through the 2022 World Cup.\nBielsa, of course, is a world-renowned manager who will provide European and Premier League coaching experience to the two-time world champions. Despite Bielsa’s two prior international coaching stints with Argentina (1998-2004) and Chile (2007-2011), and constant courting from several other federations, his future after four years with Leeds United seemed destined to stay in England.\nIn the weeks after Leeds sacked him, Bielsa told people close to him that he intended to get back into coaching and would be open to managing another team in England, provided the offer was right. There was no suggestion of him retiring or stepping away from the game. He still had the appetite for a high-level job in Europe. He liked European football and was disappointed to have left Leeds prematurely.\nEarlier this season, Bournemouth and Everton were heavily linked with Bielsa and genuinely interested in bringing him back to the Premier League. Bournemouth, who at the time were fighting relegation, made concerted efforts to recruit the Argentine in November but were not able to close out a deal. After Everton sacked Frank Lampard in January, they got reasonably far down the line with Bielsa, whose wage demands for him and his staff could have cost the club up to £1m a month.\nCuriously, and perhaps in a classic Bielsa move, he flew into Heathrow Airport from South America unannounced and surprised Everton officials after the club thought that talks had officially ended. That’s when Bielsa proposed to first take over Everton’s Under-21s until the summer while his staff managed the first team in the interim. He had never taken a first-team job mid-season and was reluctant to do so this time. Everton were unconvinced by the idea and passed on him, hiring Sean Dyche instead. They are currently hovering one point above relegation.\nAdvertisement\nWhat nobody expected, Bielsa least of all, was that he and Leeds might reach a stage where they considered linking up for a second time. There were sections of the club’s fanbase who craved the fairytale of Bielsa returning to Elland Road but until very recently, it was merely a pipedream. Events leading up to his sacking and the dismissal itself had burned bridges between him and the incumbent regime.\nA fortnight ago, though, rumours began to surface that Leeds and prospective new owners 49ers Enterprises would be interested in appointing him again if the club were relegated. Bielsa had won promotion from the Championship before, claiming the title brilliantly in 2020, and could do so again. Though relegation would cast doubt on 49ers Enterprises’ ability to secure majority control of Leeds from chairman Andrea Radrizzani, the group remained interested in doing so and was exploring its options on the football side of the business.\nIn little over a week’s time, the club will be without a head coach. Sam Allardyce was appointed on a four-game basis, a last-gasp attempt to keep Leeds up, and he is not expected to stay on beyond the final match of this campaign. Leeds and whoever controls them going forward are in the market for a replacement, either in the Championship or the Premier League, and Bielsa’s name began to be mentioned in discussions about their next move, albeit tentatively.\nLast week, he was made aware that he was being spoken about at Elland Road. What appeared to have started as speculative chatter briefly grew legs. But in the end, the fairytale prospect came to nothing.\nTerms with Uruguay were finalised ahead of the weekend. An official announcement from South America came on Monday night, clearing the way for his first press conference.\nSo how did Uruguay finally land Bielsa if he wanted to stay in the Premier League? Their offer had been on the table for several months before he signed it. Uruguay set a deadline for Bielsa to decide with the June FIFA window looming. Other international jobs — Bolivia, the United States and Colombia — were mooted, but people around him did not see the same enthusiasm for them. Managing Uruguay genuinely excited Bielsa.\nAdvertisement\nOn Wednesday, Bielsa told reporters that he didn’t need to be convinced about accepting Uruguay’s proposal.\n“My desire to be part of this project comes from two different convictions,” Bielsa said. “One is the players that Uruguay have; I like the players who have represented Uruguay over the last few years. Second, it’s a national team that represents and identifies with the hard working culture of the country.”\nHowever, another source briefed on the matter, who was granted anonymity to protect their relationships with the Uruguayan football association, told The Athletic that Bielsa “fell into their lap.”\n“He lives next to their training facility, otherwise he’s not taking the job. Let’s be honest,” the source said.\nUnbeknownst to many outside of South America, Bielsa has a home in Montevideo and spends considerable time in the country. For years he has enjoyed the tranquility and privacy of the Uruguayan countryside.\nThere are of course cultural similarities between Argentina and Uruguay — neighboring countries who share a love for maté, literature, beef and football. But the sporting rivalry is far from friendly.\n“‘Similar but different’ is something that I read once about Uruguay and Argentina,” Bielsa said on Wednesday. “In football, whether you’re a foreigner or not, acceptance has one single word: victory.”\nUruguay, a country of less than four million people, has always punched above its weight. But with Bielsa, there’s a belief that Los Charrúas can not only live up to their potential in CONMEBOL, but also move past their underdog status outside of their region.\nUruguay produces elite footballers, nevermind the country’s limitations. Real Madrid’s Federico Valverde, 24, now captains the side. Liverpool’s Darwin Nunez, Tottenham central midfielder Rodrigo Bentancur, Manchester United winger Facundo Pellistri and Barcelona defender Ronald Araujo decorate Uruguay’s starting XI.\nAdvertisement\nGuaranteed talent and a comfortable commute to work weren’t the only reasons why Bielsa accepted the Uruguay job, though. In the end, it was the most attractive offer left standing.\nThe Mexican Football Federation (FMF), according to reports in Mexico, made a strong pitch to hire Bielsa as their senior national team manager, following Gerardo Martino’s resignation in December. Mexico crashed out of the World Cup in Qatar after failing to advance from the group stage for the first time since 1978.\nThat shock elimination coincided with one of the darkest moments in Mexico’s football history. Both the men’s Under-23 and women’s sides failed to qualify for next summer’s Olympic Games. The Under-20 men did not qualify for their respective World Cup that begins this weekend in Argentina, and Mexico’s senior women’s national team missed out on this summer’s Women’s World Cup.\nIn response, an emergency plan of action was formulated to reverse their fortunes. A group of Mexico’s most influential Liga MX owners formed a committee to not only choose the next manager, but reshape the entire national team program. Bielsa was at the top of their list.\nBielsa coached both Atlas and Club America in the 1990s. Jesus Martinez, president of Liga MX side Pachuca, led the charge to bring Bielsa back to Mexico. Multiple reports in Mexico named former Leeds United sporting director Victor Orta as Martinez’s top target to fill the same position for the Mexico national team. Orta’s close relationship with Bielsa was an immediate draw.\nBielsa would have been handed the reins to the senior team and have authority over the direction of Mexico’s youth programs. His wage demands wouldn’t be a problem for the deep-pocketed FMF.\nHowever, the decision-makers on that committee broke into factions. It was widely reported in Mexico that billionaire Alejandro Irarragorri, owner of Club Santos, Atlas and Spanish second division side Sporting Gijon, opposed Bielsa’s appointment. Irarragorri preferred his former employee, ex-Atlas manager Diego Cocca.\nAdvertisement\nAs a result, Martinez removed himself from the committee. In February, the 51-year-old Cocca, an Argentine, was hired as Mexico’s manager.\n“Bielsa wanted to be our coach,” Martinez told ESPN’s Futbol Picante earlier this month. “You have no idea what type of project we had proposed. It was impressive. (Bielsa) and I spoke for six hours. He was excited about what we had planned.”\nIn the meantime, Uruguay’s federation was in a holding pattern regarding the future of Diego Alonso, who managed the side in Qatar. Alonso, 48, took over after Uruguay fired Tabarez. With Uruguay in danger of missing out on Qatar 2022, Alonso’s men won four of their last five qualifiers to finish third behind Brazil and Argentina.\nAlonso was a surprise hire. He had no international coaching experience, but he implemented a more attacking style of play that suited his personnel, with more pressing triggers, and made modern sports science a part of his project, bringing Uruguay more into the present day after Tabarez was dismissed at the age of 74. Alonso brought in former Arsenal head physiotherapist Bruno Mazzioti to lead the national team’s performance team.\nFor a short time, Alonso was the hero and an unexpectedly wise choice. That changed when Uruguay were eliminated in the first round of the World Cup.\nAlonso was not fired nor did he resign. His contract ended after the World Cup, but a renewal seemed to be in the cards, despite the disappointment.\n“He’s still my number one candidate,” Uruguay Federation president Ignacio Alonso (no relation) told Radio Sport 890 in March. “We have the same confidence in him that we had back in December. That hasn’t changed.”\nIn spite of that public show of support, Diego Alonso is now unemployed. The momentum that a possible Bielsa hire generated overruled the federation president’s wishes. Ignacio Alonso heads a seven-person executive board, whose members have an equally strong voice on sporting decisions. With the world watching on Wednesday, Ignacio Alonso changed his tune.\nAdvertisement\n“This is the culmination of something that we all dreamed about,” he said. “Our paths crossed and we both believed in each other. Now we can communicate the pride that Uruguayan football feels in having Marcelo Bielsa as one of us.”\nThe Estadio Centenario pitch has hosted decades of memorable footballing moments. It’s a hallowed ground in South America and one of the continent’s most difficult atmospheres for visiting nations. It’s also severely battered by wear and tear, outdated by today’s modern standards. The Centenario hasn’t evolved, much like the Uruguayan FA.\n“He’s taking over a Premier League squad,” The Athletic’s source said. “But he’s not taking over a Premier League club, and he wants to approach it like that.” The same source likened the Uruguayan FA to a global brand that still operates like a small shop.\nMuch of the delay in confirming Bielsa’s announcement, the source said, came down to the federation’s unpreparedness in light of Bielsa’s demands, particularly regarding his staff. According to reports in Uruguay, Bielsa will keep a six-person team of assistants, including a video analyst based in Spain and two employees (an Argentine and a Spaniard) who will be responsible for the team’s logistics.\nIt is expected that Bielsa will move on from many of the tenured federation employees who have been with the team since the days under Tabarez. On Wednesday, Bielsa told reporters that he would include Uruguayans on his staff. Those roles have not been determined.\n“There are colleagues with whom I have worked for many years who will continue to stay close to me,” Bielsa said. “There are some components of my staff that I prefer that they’re nationals, or Uruguayans, because they’re going to help me connect more effectively with aspects of the country that are necessary to understand.”\nThat delay in Bielsa’s appointment also forced Uruguay to schedule lesser opponents for the upcoming FIFA window in June. Uruguay will face Central American countries Nicaragua and Cuba in Montevideo. Bielsa will use the window to begin to build team culture rather than establish a style of play, he told reporters on Wednesday.\n“It’s an opportunity to coexist with the players which isn’t a frequent occurrence,” Bielsa said. “That’s what I’m looking forward to.”\n(Top photo: PABLO PORCIUNCULA/AFP via Getty Images)",
  "word_count": 2250,
  "scraped_at": "2026-02-14T13:00:02.803371"
}