{
  "article_id": "10999b7415a7",
  "url": "https://www.yahoo.com/entertainment/taylor-swift-vegas-super-bowl-210055843.html",
  "title": "Taylor Swift is in her Red Era as Chiefs win Super Bowl in OT and she and Travis kiss on the field",
  "date": "20240212T064500Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Taylor Swift is in her Red Era as Chiefs win Super Bowl in OT and she and Travis kiss on the field\nCould there have been a more fairytale ending for Swifties watching the Super Bowl?\nFrom Taylor Swift's amazing \"87\" necklace to biting her white nails during OT and the kiss on the field when the Chiefs won, it was the cap to the rom-com we've been watching all season.\nThanks for watching all 13 (13!) Chiefs games with us when Swift attended. You were with us from the hot summer night when Swift cheered for her boyfriend Travis Kelce the first time (when we still didn't know if we should call him her boyfriend!). All the way until now with that very sweet kiss on the field. We dismissed the people who called their relationship a PR stunt, and leaned into the romance.\nSome of us already liked football (Austin Curtright, our sports reporter and Swiftie) and others (Bryan West, our fulltime Taylor Swift reporter) learned to appreciate the sport as we cheered for Taylor's boyfriend.\nWe only hope that Season 2 of this romance continues in Australia with the next leg of the Eras Tour - and with Travis Kelce as the male lead. (After they both get to celebrate and take a nap!)\nThe Taylor-Travis kiss we waited for\nAs the game ended, we watched, waiting for Taylor Swift to run to the field. We saw Patrick Mahomes' wife Brittany share the stage as the Vince Lombardi trophy was presented.\nWe listened as Travis Kelce sang \"Viva Las Vegas.\"\nAnd where was Taylor?\nWere you anxious, too, as we waited for Kelce to find Swift on the field?\nThe kiss was the pay off.\n'Come here, baby girl'\nOne of our favorite Instagrammers, Olivia Levin with Swifties for Eternity, caught this audio clip.\nTravis Kelce first hugs his mom, and then finds Swift and says: \"Come here, baby girl,\" and hugs Swift.\nAnd we're dying. We'll see you in three business days, OK?\nA dream week for Taylor and Travis\nOn Sunday, Taylor Swift won her 13th and 14th Grammys, made a historic win with her fourth album of the year award and broke the internet after announcing a brand-new album, \"The Tortured Poets Department.\"\nA week later, she watched boyfriend Travis Kelce win his second Super Bowl in a row.\nHow fun was this?\n\"It's a love story\" Taylor Swift congratulates Travis Kelce after Chiefs win Super Bowl\nHillary Clinton congratulates Taylor Swift's boyfriend\nNothing like Hillary Clinton jumping in with the Swifties and referring to Travis Kelce as simply: \"Taylor Swift's boyfriend.\" That's a movement we can join!\nRed (Taylor's version)\nTHE CHIEFS WIN SUPER BOWL 58 (25-19) over San Francisco!! Swifties are heard crying, screaming and throwing up (this phrase is a Taylor-Swift-ism if you’re new here). Red and gold confetti fell onto the field!\nOMG pic.twitter.com/qE9A69UZiH\n— NFL on CBS 🏈 (@NFLonCBS) February 12, 2024\nListen up Chads and Brads and Dads\nThe biggest name in music and, arguably, one of the most visible people in NFL circles, was undoubtedly mentioned countless times in bars and living rooms around the country.\nBut when it comes to TV, the 34-year-old singer/songwriter was on all of 55 seconds (51 seconds before the game-winning touchdown) out of a broadcast that took about four hours and 18 minutes to complete. This is counting her sightings from kickoff until the game went final.\nShe was also on camera for various moments before and after the game as well.\n-Gabe Zaldivar\nA very Taylor celebration\nTravis Kelce makes a clutch 22-yard reception to set up the Chiefs' game-tying field goal to send the Super Bowl to overtime tied at 19. Taylor Swift was shown in shock on the broadcast after the play.\nMAHOMES TO KELCE PUTS THE CHIEFS IN THE REDZONE 😳\n(via @NFL)\npic.twitter.com/wmvP96Uu4A— Bleacher Report (@BleacherReport) February 12, 2024\nA nervous nail-biter of a game\nThe CBS broadcast shows a nervous Taylor Swift as she watches the 49ers driving down the field late in the fourth quarter tied 16-16 against her Chiefs.\nTaylor biting her nails! The #Chiefs are tied #SuperBowl2024 pic.twitter.com/tNN2lQSxIb\n— Taylor Swift Updates (@SwiftNYC) February 12, 2024\nPaul McCartney joins Taylor Swift's suite\nSir Paul McCartney appeared in the Super Bowl suite to say hi to Taylor Swift. The two have been friends for years. In 2020, Swift interviewed McCartney for a \"Rolling Stone\" series called \"Musicians on musicians.\" The Time Magazine article mentioned that Swift has a framed note from McCartney that hangs in her New York apartment bathroom.\nTaylor Swift and Paul McCartney in the suite together! #SuperBowl2024 #Chiefs pic.twitter.com/xpc3K6rrM3\n— Taylor Swift Updates (@SwiftNYC) February 12, 2024\nA touchdown and a Taylor Swift sighting!\nShown for the fifth time on the broadcast, Taylor Swift was hype for the Chiefs' touchdown to take a 13-10 lead late in the third quarter. And, of course, Kansas City takes the lead with 13 points, Swift's favorite number.\"\nTaylor and co are LOVING IT pic.twitter.com/L8xeLAIm9n\n— NFL on CBS 🏈 (@NFLonCBS) February 12, 2024\nIf you're counting, and we are, CBS showed Taylor for the third time in the third quarter\nTaylor Swift makes her third appearance on the in-game CBS broadcast, this time as she dances and sings next to her friends inside Allegiant Stadium.\nLet's hope for another shot before the fourth quarter.\nTaylor Swift sings while watching the #SuperBowl with Ice Spice pic.twitter.com/iAX3TBzbX5\n— The Hollywood Reporter (@THR) February 12, 2024\nShaq, meet Taylor. Taylor, meet Shaq.\nShaquille O’Neal finally met Taylor! He shared a photo on instagram with Jamie Salter, the Chairman and CEO of Authentic Brands Group, who gifted her with the Judith Leiber bedazzled bag.\nLana Del Rey joins Taylor Swift in the suite\nSwift's friend Lana Del Rey was spotted in the stands just below the suite during the first quarter of the game. The two collaborated on \"Snow on the Beach\" on Swift's Grammy-winning album. And the two sat next to each other at the Grammys a week ago. Swift even took her hand and brought her to the stage when she won.\nThis Sunday, Swift brought her with her again. By the second quarter, Del Rey was in the suite with Swift, Ice Spice and others.\nTAYLOR SWIFT & LANA DEL REY AT THE SUPERBOWL ❤️❤️❤️❤️#SuperBowl #SuperBowl2024 #TaylorSwift pic.twitter.com/vpr7YG2lFz\n— Lee Hood (@Mofoman360) February 12, 2024\nIs there really a Taylor conspiracy?\nThere has been much discussion about a conspiracy with Taylor Swift and the Chiefs making the Super Bowl. But we don't think even Swift herself could create so many coincidences with 13.\nIt’s the Super Bowl of “13”s. It’s SB58 (5+8), held on Feb. 11 (2+11), where the Chiefs play the 49ers (4+9) and the halftime score continues the trend. San Francisco leads 10-3.\nIs Taylor also playing Taylor Swift Bingo?\nSo the Jumbotron on Allegiant Stadium showed Taylor Swift chugging a beer, or was it a wine? That is savage. Maybe she saw herself on the Jumbotron and is playing the same drinking game we are? Drink when the cameras show Taylor?\nOr is she giving her best Jason Kelce impersonation?\nIcon. @TaylorSwift13#SBLVIII pic.twitter.com/G0FzHIyiLB\n— NFL (@NFL) February 12, 2024\nTaylor Swift shown on Allegaint Stadium’s screens and she proceeds to chug her drink. #vegas #superbowl pic.twitter.com/mUij17FduH\n— Mick Akers (@mickakers) February 12, 2024\n'Barbie's' Ryan Gosling joins in on Taylor Swift fun\nRyan Gosling has joined in on the Taylor Swift wave, as he was featured in a comical Super Bowl commercial crying to Swift's song \"All Too Well\" in a promotion for his new movie, \"The Fall Guys.\"\nEvery photo of Taylor Swift at the Super Bowl\nWe are so lucky to have our USA TODAY photographers at the game - and bringing us some close ups of Taylor, so we can really discuss her fit - and her lipstick, and play our favorite game: How many people can you identify in the Super Bowl suite?\nUsher and Taylor collab?\nAnd they said sing now-ow… Taylor Swift has collaborated with many of the top music industry names and Usher is no exception. In 2011, the halftime show singer joined Swift during the “Speak Now” tour at the Philips Arena (now called the State Farm Arena).\nIt's a 'Love Story' we can get behind\nKansas City fans are “beggin’ you, ‘Please don’t go-o-o,’” before kickoff at Super Bowl LVIII Sunday. Hundreds of fans are heard belting “Love Story” in the Kansas City Power & Light District in Missouri.\nKC ❤️ Taylor Swift #ChiefsKingdom #SuperBowl #TaylorSwift @kmbc pic.twitter.com/5OYhPoDUVF\n— Peyton Headlee KMBC (@PeytonKMBC) February 11, 2024\nGo Taylor's Boyfriend\nOur favorite shirt either at the game - or at Super Bowl parties across the country might make Taylor the main character. And why not?\nAre you googling how to get Taylor's red lip?\nJust stop. We've got you.\nThe lip formula that Swift is rumored to wear is Pat McGrath’s LiquiLUST Legendary Wear Lipstick in the shade \"Elson 4\" lined with Pat McGrath’s PermaGel Ultra Lip Pencil in “Structure” (mid-tone nude).\nMore in Sports\nBarcelona fans tear into several players amid Atlético disaster\n“I’m sure you’ve seen footage of Taylor Swift dancing in the rain,” says Cincinnati Makeup artist Julie Niesen. “More than likely, she’s wearing a product like LiquiLUST that will endure dancing, and rain, kissing Travis Kelce.” The formula can last because it’s silicon-based, which is “very water proof” and requires an oil-based remover to take off, Niesen says.\nSad news though, Swifties. This exact makeup product has been sold out for months.\nShe recommends a handful of other formulas that offer slightly different shades at various price points. These recommendations include Rouge Dior Forever in the shade 999 \"Forever Dior”, which is also available in the liquid version, the Sephora Collection Cream Lip Stain Liquid Lipstick in shade 01 “Always Red” and NYX’s Suede Matte Liquid Lipstick in the shade “Kitten Heels.”\n-Bebe Hodges\nOur favorite description of Travis Kelce\nNickelodean for the win. Did you know they stream the Super Bowl?\nchecking in on the Nickelodeon broadcast pic.twitter.com/wMyvDzEYwf\n— Front Office Sports (@FOS) February 12, 2024\nTaylor Swift and fellow Grammy nominee and friend Lana Del Rey share a moment\nThey sat next to each other at the Grammys last week and now they meet again.\nThe “Snow On The Beach” collaborator approached Taylor's box from the stadium seats in a red leather jacket and dark jeans. A photo shows the two holding hands for a second, before Lana Del Rey returned back to the “cheap seats.” Later on, in the game, Lana was seen in the box. Whew!\nYou can follow us on Instagram to see more Taylor moments, see the best moments from Usher's half-time show - and maybe even a few shots of the game.\n📷| Taylor Swift and Lana del Rey at the SuperBowl! pic.twitter.com/3JawlAQoQ9\n— The Swift Society (@TheSwiftSociety) February 11, 2024\nLana Del Rey spotted at the #SuperBowl. pic.twitter.com/s4WHXH6JiF\n— Pop Base (@PopBase) February 11, 2024\nTaylor isn't at the Puppy Bowl, yet she has a presence\nTaylor didn’t make it to the Puppy Bowl, the ultimate sports event for those who consider puppies the MVP, but her doppelganger did. Cutting away from the action on the field, Taylor Sniffed and Travis Klawce were featured in the stands, enjoying the action.\nKlawce wore his namesake’s trademark “87” jersey, while Sniffed donned a sparkly kerchief around her neck.\nThey’re not the only doppelgangers at the bowl. Patrick Mabones, a hound mix, played for team Fluff.\n-Annemarie Dooling\nTaylor Swift sways to Post Malone's 'America the Beautiful'\nSwift, with her arms around Blake Lively, swayed to Post Malone's acoustic version of \"America the Beautiful.\"\nAnd did you miss Reba's beautiful national anthem?\n🎥| Taylor Swift & Blake Lively ❤️pic.twitter.com/o7SgMqEs2I\n— The Swift Society (@TheSwiftSociety) February 11, 2024\nWhose suite is Taylor Swift in?\nWe've confirmed that the suite is that of NFL Commissioner Roger Goodell.\nWho made Taylor Swift's adorable \"87\" necklace?\nTaylor Swift made a radiant statement at the Super Bowl in Las Vegas, rocking a custom diamond and yellow gold \"87\" pendant necklace from Stephanie Gottlieb Fine Jewelry, complementing her look with the Diamond Tennis Choker in rose gold. The \"87\" marks the launch of Stephanie Gottlieb’s new Varsity pendant, giving shoppers the opportunity to customize their own necklace with letters and/or numbers of their choosing, and characterized by the iconic varsity-letterman font. The necklace is $2,950.\nCan I buy that '87' football-shaped purse?\nIf you have $4,495, yes! According to one of our favorite Swifties, Instagram account @TaylorSwiftStyled says it's a Judith Leiber bag, a favorite you usually see on red carpets.\nWhat did Donna Kelce wear to the Super Bowl?\nNo one will mistake Donna Kelce for anyone else at this year's Super Bowl. Her custom jacket says, \"Mama Kelce\" on it.\nWhat did Taylor Swift wear to the Super Bowl?\nWhat we know: Taylor Swift arrived in a black corset style top and black jeans with rhinestone cutouts, $695 from AREA and similar to the AREA rhinestone embellished shorts she wore to an earlier game.\nShe also wore a gold \"87\" necklace. Her purse? An adorable football shaped purse with an \"87\" on it. Guess we know who she's rooting for!\nSwift walked with a red bomber jacket slung over her left shoulder. The jacket is a Kansas City Chiefs WEAR by Erin Andrews. It’s red with two white lines along the collar, base and vest stitched area. Andrews, a FOX Sports reporter, sells fashionable fan gear for women. This is the second time that Swift has sported one of her jackets. On Oct. 12 when the Chiefs played the Broncos, she wore a similar outfit to her Super Bowl appearance.\n🚨| Taylor Swift wearing an \"87\" necklace in support of Travis Kelce tonight! #SuperBowlLVIII pic.twitter.com/NvinwQ8ISG\n— The Eras Tour (@tswifterastour) February 11, 2024\nWho is in Taylor Swift's Super Bowl suite?\nWe spied Taylor Swift with fellow Grammy nominee and \"Karma\" collaborator Ice Spice, producer RIOTUSA, along with Blake Lively, who attended an earlier Chiefs game with Swift, and close friend Ashley Avignone. Travis Kelce's close friend Aric Jones was there, too.\nThe Kelce family was there. She also is hosting Travis Kelce's mom, Donna Kelce! Donna Kelce had said earlier in the week that the suites were \"pricey\" so she figured she'd be in the stands, and be happy. We also spied Travis' dad, Ed Kelce, and, of course, Jason Kelce. We're wondering if he's going to keep his shirt on.\nJason Kelce's wife Kylie was in the suite, too. You have to love Kylie, who as a die-hard Eagles fan refused to wear Chiefs gear and instead wore a red long sleeve T-shirt repping the University of Cincinnati, where the Kelce brothers played football before going pro.\nWe also saw her Swift's mom, Andrea Swift, her dad, Scott Swift, brother Austin Swift, and NFL Commissioner Roger Goodell.\nFriends who celebrated her birthday last year were also there: Miles and Keleigh Teller.\nDid you love Jason Kelce's overalls? We did!\nJason Kelce is going with the overalls, while Travis opted for something a bit shinier. pic.twitter.com/KXN6C9Qcfw\n— NFL on CBS 🏈 (@NFLonCBS) February 11, 2024\nTaylor Swift arrives at the stadium\nMore than two hours before kick off, CBS showed an image of Taylor Swift in a sleek black corset style top, red satin Chiefs jacket over her shoulder and her hair in a pony with a tiny braid, next to Ice Spice and Blake Lively at the stadium.\nShe's here.\nTaylor Swift has arrived at Allegiant Stadium for Super Bowl LVIII. pic.twitter.com/dYGYpt2dQ0— NFL on CBS 🏈 (@NFLonCBS) February 11, 2024\nTAYLOR SWIFT pic.twitter.com/jAPzQ5EHB1\n— Alexa ⸆⸉ ✨Taylor’s Version✨ ⸆ (@noitsalexa) February 11, 2024\nWho was Taylor Swift with as she arrived at the Super Bowl?\nTaylor Swift walked into the stadium following her mother, Andrea Swift. She walked with Blake Lively, who has attended a Chiefs game with Swift, and she brought \"Karma\" collaborator Ice Spice, whom she was spotted with at the Grammys last week. Ashley Avignone, one of her close friends, was there, as was her dad, Scott Swift, and brother Austin Swift.\nTAYLORpic.twitter.com/IcuBu35xcM\n— The Swift Society (@TheSwiftSociety) February 11, 2024\nBlake Lively wore Adidas red track pants with a cropped white tank and a matching red jacket. Ice Spice was sleek in all black.\nWhat did Travis Kelce wear for his gameday fit?\nTight end Travis Kelce was \"shimmering\" on his way to get on the Chiefs' team bus, CBS analyst Nate Burleson gushed on the network's pregame show.\nDressed in all-black as he left the hotel (\"Reputation?), Kelce will change into the Chiefs' home red jerseys when he arrives at Allegiant Stadium.\nNot to be outdone by his brother’s Amiri jacket and trousers, Jason Kelce showed up to Super Bowl LVIII in colorful Kansas City Chiefs overalls.\nYou can buy Jason Kelce’s overalls on pre-order and his bright red “big yeti” tee is available in multiple locations online.\nThe brothers have a knack for fashion, and Travis purchased designer jumpsuits for his teammates in the past, so neither Jason’s plaid overalls nor the shiny Amiri suit are out of character.\nWhat were Taylor Swift's best looks during the NFL season?\nSwift fans were treated to 12 game looks this season – from popping up in a box at Arrowhead Stadium in October in an Erin Andrews’ WEAR jacket to the AFC Championship game where Swift wore a bright red sweater and black mini.\nShe showcased vintage looks from Kansas City’s West Side Storey, a retro style jacket that was a replica of the one boyfriend Travis Kelce wore in December, and independent (and now NFL-licensed) designer Kristin Juszczyk. And she had us all seeing red!\nDid you have a favorite? USA TODAY’s Victoria Hernandez broke down Swift’s best game day looks.\nIs Taylor's dad giving off Big Dad Energy?\nWe love what a big Chiefs fan Scott Swift has become.\nThis fit is peak dad!\nIs Taylor Swift in Las Vegas yet?\nWe are waiting with you!\nAnd NFL Network Insider Ian Rapoport reported on NFL GameDay Morning that Taylor Swift has officially arrived in Las Vegas and is expected to attend Super Bowl LVIII to watch her boyfriend, Travis Kelce and the Kansas City Chiefs take on the San Francisco 49ers.\nGracie Hunt, daughter of Kansas City Chiefs CEO Clark Hunt, told People on Saturday that Swift will attend the big game.\n\"She's coming!\" Hunt told People. \"We're excited.\"\nWhen is Taylor Swift's next concert?\nSwift’s next Eras Tour concert is Friday, Feb. 16 in Melbourne, Australia. She performs three nights in Melbourne before heading to Sydney and then to Singapore on March 2.\nFollow Bryan West, the USA TODAY Network's Taylor Swift reporter, on Instagram, TikTok and X as @BryanWestTV who will report live from Melbourne.\nIt's a love story. Will Travis Kelce propose at the Super Bowl?\nWe’ve seen proposals at so many of the Eras Tour shows, that why wouldn’t Kelce propose to Swift if the Chiefs win?\nIt could be a very good end to what feels like a real-time rom-com for Swifties.\nKelce was actually asked this very question in one of many pre-Super Bowl Interviews. His answer, classic Kelce: \"I'm focused on getting this ring, and that’s all that my mind’s focused on right now.\"\nIs Taylor Swift in a Super Bowl commercial?\nThe most Taylor Swift of commercials doesn’t even feature the singer.\nBut you’ll feel like you saw her after watching Cetaphil’s early Super Bowl Commercial, which as of Friday had been viewed almost 3 million times.\nThe video shows a \"real-life father and daughter living in New York\" who are struggling to connect with each other.\nThe father, who is a football fan, has a difficult time figuring out how to interact with his teen, who only appears to be interested in her phone and skincare. The father approaches the daughter a couple of times over the course of the video, attempting to bond with little success.\nThe mere mention of “the most famous fan of the game” and suddenly dad and daughter are together – and we’re crying.\n-Amaris Encinas\nCan you bet on Taylor Swift at the Super Bowl?\nHow many times will CBS's Super Bowl broadcast show her on-air? Will the Super Bowl MVP mention her in his speech?\nSwift's relationship with Kansas City Chiefs tight end Travis Kelce has been one of the hottest topics of this NFL season.. The 14-time Grammy winner has attended all three of the Chiefs' playoff games up to this point but has a concert in Tokyo the day before the Super Bowl. That's left fans speculating whether she'll make it to Las Vegas in time for the big game.\nHowever, they won't be able to legally bet on such an appearance – or the number of them on the broadcast – at a United States-based sportsbook ahead of Sunday's game. Any such wagers are only available on betting sites outside those regulated in the U.S.\nThere are other prop bets not related to the outcome of the game that also aren't legal to bet on in the U.S. as well as some that are only available in certain states. But why is that?\n“The general rule of thumb in the U.S. for creating prop bets is that they need to be determined by action on the field and the result shown in the box score,\" BetMGM Senior Trader Tristan Davis told USA TODAY. \"This makes it difficult to offer prop bets on Taylor Swift since she doesn’t play the game.”\nIn other words, the name of the game in sports betting is wagering on the objective, on-field results, not the subjective decision-making of a TV broadcast director.\n-Jack McKessy\nCan Taylor Swift make it to the Super Bowl?\nThe big joke on Tiktok this week has been the math question: If Taylor Swift leaves Japan - and the time difference is +17 hours to Las Vegas an the flight takes about 13 hours, will she make it on time?\nLucky for us, our amazing graphics team has done the math - and has shown their work.\nEven the Embassy of Japan got in on this feat, as Swifties across the world suddenly have serious interest in air travel times.\n“Despite the 12-hour flight and 17-hour time difference, the Embassy can confidently Speak Now to say that if she departs Tokyo in the evening after her concert, she should comfortably arrive in Las Vegas before the Super Bowl begins,” the embassy said on Feb. 2, peppering the statement with references to popular Swift song titles.\nHas Taylor Swift played the Super Bowl half-time show?\nNo. Swift has never played at the half-time show, but she has performed at many big sporting events.\nIn 2022, the singer said she didn't want to perform until she finished rerecording all of her first six albums. She has two left: Reputation (Taylor's Version) and her debut album.\nHer first time singing at a major sporting event was in 2002 when as an adorable 12-year-old, she sang the national anthem before a Philadelphia 76ers Detroit Pistons game.\nShe has since performed at several other sporting events, including when Swift sang the national anthem at game 3 at the 2008 World Series in Philadelphia.\nHow did Taylor and Travis meet?\nWe could write a song about this, but honestly, don’t we just want Taylor to do it?\nTravis Kelce attended the second Kansas City show of Swift's Eras Tour. The tight end hoped to give Swift a friendship bracelet with his phone number on it but was unsuccessful.\nKelce called Swift out on his podcast New Heights.\n\"I was disappointed that she doesn't talk before or after her shows because she has to save her voice for the 44 songs that she sings,\" Kelce said to his brother, Jason.\nWhen word got to Swift, the singer reached out.\n“This all started when Travis very adorably put me on blast on his podcast, which I thought was metal as hell,” she said in her Time magazine interview for 2023 Person of the Year. “We started hanging out right after that. So we actually had a significant amount of time that no one knew, which I’m grateful for, because we got to get to know each other.\"\nThough they had been dating for weeks, Kelce made the first public comment about their relationship on the Pat McAfee Show in September.\n“I threw the ball in her court,\" he said, \"and you know, I told her, you know, ‘I’ve seen you rock the stage in Arrowhead. You might have to come see me rock the stage in Arrowhead and see which one’s a little more lit.'\"\nThis would set up the public launch of the duo's relationship.\nAdele is Team \"Taylor Swift's boyfriend\"\nTwitter/X user @picturetokurn joked the Super Bowl match-up is “Red” (49ers) versus “Red (Taylor’s Version)” (Chiefs), and Adele is team “Red (Taylor’s Version).” During her Las Vegas concert on Saturday, the singer said, “I think I want the Chiefs to win just because of Taylor Swift's boyfriend and all of you that are complaining about Taylor Swift being at games get a (bleeping) life.”\nThis article originally appeared on USA TODAY: Taylor Swift at Super Bowl: Kiss seals celebration with Travis Kelce",
  "word_count": 4244,
  "scraped_at": "2026-02-14T12:07:38.474604"
}