{
  "article_id": "10a5dcba16b2",
  "url": "https://www.lbc.co.uk/news/luis-rubiales-stand-trial-jenni-hermoso-world-cup-kiss/",
  "title": "Disgraced Spanish football boss Luis Rubiales to stand trial over Jenni Hermoso World ... ",
  "date": "20240509T103000Z",
  "domain": "lbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Disgraced Spanish football boss Luis Rubiales to stand trial over Jenni Hermoso World Cup kiss and could face jail time\nLuis Rubiales is facing jail after it was confirmed that he would stand trial over his unsolicited kiss with Jenni Hermoso during the World Cup.\nListen to this article\nRubiales faces one count of sexual assault and one of coercion for his alleged actions in the aftermath of the kiss.\nThe offences carry prison terms of one year and 18 months respectively.\nThe High Court said it would also try the former coach of the women's national team, Jorge Vilda, the team's current sporting director, Albert Luque, and the federation's head of marketing, Ruben Rivera.\nThe trio are accused of coercing Hermoso into saying the kiss was consensual.\nRead more: Disgraced ex-Spanish FA president Luis Rubiales arrested in corruption investigation\nRead more: Former Spanish FA chairman Luis Rubiales accused of 'inappropriately touching' England players\nRubiales was seen grabbing the Spanish forward after her side beat England's Lionesses at the final last year.\nAmid celebrations after the match he placed his hands on either side of her head and kissed her.\nThe incident sparked global outrage and calls for Rubiales to resign from his post as head of the Spanish football federation.\nHermonso said the kiss was unwanted and said it was demeaning. Rubiales, meanwhile, said it was consensual. He has denied any wrongdoing.\nThe court set a bail of 65,000 euros for Rubiales' charge of sexual assault, with a further 65,000 to be posted jointly between Rubiales, Vilda, Luque and Rivera for the coercion charge.\nA non-consensual kiss is considered sexual assault under international law.\nRubiales “grabbed the player’s head with both hands and surprisingly and without consent or the player’s acceptance, he kissed her on the lips”, court documents read.\nThe papers said once he realised his actions had “personal and professional consequences”, Rubiales and his supporters started to force “constant pressure” on Hermoso.\nHe wanted to exert pressure on her so that she would “publicly justify” the kiss as consensual, they said.\nRubiales was suspended by Fifa six days after the kiss and later resigned from the role.",
  "word_count": 360,
  "scraped_at": "2026-02-14T13:04:53.644620"
}