{
  "article_id": "10ad82f1e952",
  "url": "https://www.kirksvilledailyexpress.com/stories/highlights-recaps-from-truman-athletics-2022-23-seasons,13128",
  "title": "Highlights , recaps from Truman Athletic 2022 - 23 seasons | Kirksville Daily Express",
  "date": "20230606T154500Z",
  "domain": "kirksvilledailyexpress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Posted 6/6/23\nThe 2022-23 school year was an eventful one for Truman State athletes and teams. Let’s go back to August and highlight some of the top moments of the year for the Bulldogs.\nThis item is available in full to subscribers.\nTo continue reading, you will need to either log in to your subscriber account, below, or purchase a new subscription.\nPosted\nThe 2022-23 school year was an eventful one for Truman State athletes and teams. Let’s go back to August and highlight some of the top moments of the year for the Bulldogs.\nBaseball\nThe Truman baseball team may have finished with a 9-23 conference record, but there were still plenty of highlights and notable moments. Head coach Dan Davis reached a milestone with his 239th as Truman’s coach back on March 7, becoming the program’s all-time wins leader. That was not the only program record to fall this year.\nSenior Holden Missey became Truman’s all-time home run leader on April 22, hitting his 34th career home run in the game. He hit one before the season’s end to finish his career with 35. He was also named second-team All-GLVC after the season. He started every game for the Bulldogs as a pitcher and hitter, finishing with an OPS of 1.034, leading the team, and pitching 55.1 innings, the second-most on the team.\nBasketball\nThe Truman basketball teams finished on opposite ends of the standings, with the women’s team finishing third and the men’s team placing 11th. There were of course ups and downs for both teams.\nThe women’s team got off to a hot start, winning nine of their first 10 conference games. The Bulldogs closed out the regular season going 6-4 in their final 10 conference games and finished at 15-5, posting their most conference wins since the 2019-20 season.\nA blowout win over Maryville opened the GLVC Tournament for Truman, but a loss to Lewis in the semifinals ended the season. Senior Hannah Belanger had a stellar final season, cementing her place as one of the top players in program history.\nShe was named an WBCA All-American for the second time, becoming the first Truman player to receive that honor twice. She also broke the program’s single-season and career three-point records this season, tied the school mark for points in a season, moved into third place on the program’s all-time scoring list and was the first Truman player to be named GLVC Player of the Year. She finished her Truman career with 1,882 points. Belanger will play next season as a graduate transfer at Iowa State.\nThe men’s team started conference season 1-7 before a three-game winning streak saw them climb a bit in the conference standings. They then suffered a three-point loss to Maryville before earning an upset win over Missouri-St. Louis on Jan. 28. Missouri-St. Louis was ranked No. 17 in the nation at the time.The Bulldogs went 2-5 to close out conference season. Their 7-13 conference record saw them fall short of a conference tournament berth. Senior Elijah Hazekamp finished off his Truman career in style, averaging 15 points and 7.5 rebounds per game, leading the team in both categories. He was named first-team All-GLVC.\nCross Country\nThe men’s team finished in seventh place and the women’s team placed fifth in the conference last season. In the Midwest Regional, the men placed 20th out of 30 teams and the women placed 18th out of 33.\nSenior Nathan Key was named All-GLVC for the men’s team. The women’s team had three all-conference honorees in Addie Mathis, Breanna Mathes and Kate Yates. Mathes was also named GLVC Freshman of the Year.\nFootball\nThe Bulldogs had a strong season from start to finish, with plenty of success during the year and recognition once the season ended. After a season-opening loss to a strong Davenport team got things started, but Truman would not lose again for over two months.\nOver the course of an eight-game winning streak, the Bulldogs allowed an average of 16.3 points per game and scored 35 per game. They scored a season-high 59 points against Quincy on Oct. 29 and followed it up with 52 on Nov. 5 against McKendree.\nThis set up a season finale against Indianapolis with both teams entering the game with 5-0 conference records and 8-1 overall records. Indianapolis took the game and won the GLVC, but Truman’s season was not finished. They returned to the America’s Crossroads Bowl and won it for the third-straight time.\nTruman finished the season at 9-2, with both of its losses coming to teams that finished the season ranked in the top 25. Truman was also ranked to end the year, coming in at No. 25 in the AFCA Poll. They also had 18 players named to All-GLVC teams and head coach Gregg Nesbitt was named the Co-Coach of the Year.\nGolf\nThe women’s golf team had some mixed results throughout the season. They had high team finishes early on in the Kansas City Cup on Sept. 26 and 27, placing first out of six teams, and the Virginia McCoy Invite on Oct. 10 and 11, placing second out of six teams.\nThey participated in the GLVC CHampionships starting on April 21, and finished in 10th out of 11 teams. Senior Kara Hunt was the highest finisher for the Bulldogs, tying for 24th. In the second round, her score of 75 was tied for the lowest in the round as she finished her Truman career strong.\nSoccer\nThe men’s soccer team punched their first-ever ticket to the GLVC Tournament with a 2-0 win over William Jewell in the regular season finale. Unfortunately, an opening-round loss to second seed Lewis ended the Bulldogs’ season.\nTruman posted a 4-4-4 conference record and 5-6-6 overall record on the season. Head coach Duke Cochran was named GLVC Co-Coach of the Year in his 18th season with the program. Mac Knudsen and Luke Payne were tied for the team lead with 11 points with Knudsen recording five goals and an assist and Payne tallying four goals and three assists.\nThe women’s team started the season in remarkable fashion, holding their opponents scoreless for the first seven games of the season. They went 3-0-4 in that span and then went 0-6-3 over the rest of the season. Their 1-6-5 conference record had them finish in 11th place and miss out on the GLVC Tournament for the first time since Truman joined the conference in 2013.\nThe Bulldogs, led by goalkeepers Beth Hopwood and Tatumn Damron, allowed the second-fewest goals in the GLVC. The team was given the James R. Spalding Team Sportsmanship Award by the conference.\nSoftball\nThe Bulldogs were in a rebuilding year of sorts under new head coach Ron Ferrill, and there were plenty of positive outcomes that bode well for the future. Conference season started in tough fashion, with Truman losing 11 of their first 12 conference games. They then swept a home doubleheader against Southwest Baptist with a pair of one-run wins. This started a stretch where they went 6-6 over their last six conference games.\nTheir conference record of 7-17 put them in 11th place, falling short of the GLVC Tournament. McKenzie West was named second team All-GLVC. She was near the top of the team in many offensive categories, posting a .340 batting average and .956 OPS while tying for the team lead with three home runs.\nSwimming\nThe men’s and women’s swimming teams were able to celebrate a pair of swimmers this past season who represented Truman at the NCAA Division II Championships. On the men’s side, junior AJ Kohler swam the 200 free and 200 fly at the championships. He placed 21st in the free with a time of 1:37.52 and 23rd in the fly with a time of 1:49.47.\nAdelaide Reaser had a remarkable freshman season for the Bulldogs. She competed in four events at nationals. Her time of 10:15.21 in the 1000 free put her in 18th place and her time of 4:20.68 in the 400 individual medley put her 19th. She ramped it up in the 500 free, placing 14th with a time of 4:56.94 and earning honorable mention All-American honors. She was even better in the 1650 free, posting a time of 16:59.01 to finish seventh and earn All-American honors.\nTennis\nThe women’s tennis team posted an 11-11 record last season, but an 0-5 mark in conference matches. The team had some strong performers throughout the year.\nFreshman Sydney Dial had the team’s best record in singles play at 14-6. She saw most of her action playing at No. 5, where she was 10-3. The top doubles pair was senior Julia Fangman and junior Samantha Seggerman. The pair went 7-11, going 4-8 at No. 1 and 3-1 and No. 2. A lot of the team’s results were close, with the Bulldogs posting a record of 61-68 overall in singles play and 30-33 in doubles play.\nTrack and Field\nThe track and field season wound up recently with a group of Truman athletes competing at the NCAA Division II Championships. Seniors Ellie Weltha and Natalie Telep and junior Jacob Morris were the qualifiers.\nWeltha placed ninth in the shot put with a season high of 14.93 meters. She was named a second team All-American Telep competed in the javelin with a throw 39.89, finished in 18th place. The throw fell short of her season high of 44.6 meters set on May 11 in the Harding Last Chance Meet. Her career high remains 45.24 meters in the Truman State Twilight Meet on April 22, 2021.\nMorris competed in the hammer throw and discus. He placed 13th in the hammer throw and eight in the discus and was given All-American honors to join Weltha.\nVolleyball\nThe Truman volleyball team placed last in the GLVC with a 1-11 record as they still look to start heading in the right direction. They have three conference wins over the last two seasons. A strong freshman class from this past season should help anchor the team as they look to improve.\nThere were still positives this season, with the team’s lone conference win coming in dramatic fashion at home over McKendree on Sept. 30. Truman took the first two sets with relative ease before McKendree came back to force a decisive fifth set. The Bulldogs were up 14-10 and needed just one more point to win, but McKendree tied the score at 14. Truman took the final two points to win.\nThe team was led by freshman Jessica Proszenyak with 2.45 kills per set. Freshman setter Emma Baierl led the team with 6.75 assists per set and freshman Lexi Arnel led the team with 3.78 digs per set.\nX\nX",
  "word_count": 1787,
  "scraped_at": "2026-02-14T13:08:32.421630"
}