{
  "article_id": "10cd168cfc26",
  "url": "https://www.perthnow.com.au/opinion/adrian-barich-decoding-the-magic-of-the-matildas-the-team-that-stops-the-nation-c-12377916",
  "title": "Adrian Barich : decoding the magic of the Matildas , the team that stops the nation",
  "date": "20231104T200000Z",
  "domain": "perthnow.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Adrian Barich: decoding the magic of the Matildas, the team that stops the nation\nWhen the Dockers crushed the Eagles in a brutal “demolition derby” in August, piling on 17 unanswered goals to post a 101-point win in the most one-sided clash between the bitter rivals in two decades, I walked away from Optus Stadium thinking two things.\nFirstly — would Eagles coach Adam Simpson survive such an embarrassing loss? It was the club’s seventh 100-point thrashing in 32 games.\nSecondly — how did the Matildas become so big and what was their magic formula?\nAustralian sport changed forever that night. Such was the power of the Tillies, the AFL had turned three of their matches — including the derby — into Women’s World Cup live sites. This despite the world game being the AFL’s biggest threat in the battle for the hearts and minds of Australians.\nAt the AFL games at the MCG, Optus Stadium and the SCG, the league agreed to show the Matildas World Cup clash with France on the big screens around the grounds.\nTens of thousands of AFL fans around Australia were captivated by the Matildas’ dramatic shootout victory.\nThe Matildas magic was so powerful that the winner of the Glendinning-Allan medal in the derby, Freo’s Lachie Schultz, said his heart rate was much higher than it should have been before bouncedown due to the high-stakes shootout in the soccer.\nSchultz then named his favourite Matildas: “I love Steph Catley, I love Ellie Carpenter, they’re guns in the back half. Then up forward . . . they’re all guns. I just love them all.”\nI never thought I’d see a day where the AFL voluntarily embraced its rival football code, but such is the power of the Tillies.\nSo how did they become the team that stops the nation? And what is their magic potion?\nFive years ago in Perth, just over 7000 fans watched them thrash Thailand 5-nil. Last Sunday nearly 60,000 packed into Optus for a Olympic qualifier against minnows The Philippines, who they beat 8-nil.\nI think some of the Matildas magic touch is that they are like us in many ways. They’re extremely down to earth. And off the pitch, their leader, our own Sam Kerr, is exactly as she seems on it — kind and caring with a great personality.\nAfter every Matildas match the question “why does Mary Fowler wear gloves” also trends on Google.\nAnd who can forget Katrina Gorry playing with a heavy heart during the World Cup, mourning her father-in-law, who had passed away just two days earlier? Or goal-keeping hero Mackenzie Arnold bravely opening up about her journey with hearing loss?\nThe Tillies’ timing has something to do with their popularity, too. Women’s sport is on the rise and girl power is along for the ride. I know my daughter thinks virtually nothing is impossible for young girls in this modern world, and movies like Barbie have reinforced that. Is the glass ceiling about to be a thing of the past?\nNot many people know this but I was one of the first former AFL players to really embrace women’s sport. And in some ways, it was almost beaten into me.\nIt happened over a decade ago, 1200km from Perth in the remote BHP mining town of Newman, during a celebrity match between the Bush Turkeys and the Dingoes. I pulled on the boots alongside former Dockers Paul Hasleby and Antoni Grover and cricket great Brad Hogg.\nIt’s fair to say I was feeling pretty confident when a woman lined up on me at the first bounce.\nI reckoned she was in her early 20s and I was over 40 but without blowing my own trumpet, the fact was, I was a former West Coast Eagle.\nAnyway, I’m sure you can guess what happened next: she proceeded to test my football ability as she imposed herself on the contest as we say, at my expense.\nI felt like Bobby Riggs in 1973 when he was beaten in that tennis match by Billie Jean King; there was nowhere to hide and no one had any sympathy. In fact I think Hoggy and co thought it was hilarious.\nThis young woman could really play, as she flew into packs with little regard for her own safety and dished out crunching tackles.\nNeedless to say, I was immediately a believer in women’s footy and have championed it ever since.\nThat young woman’s name was Chelsea Randall. Not long after, she captained the Adelaide Crows to three premierships, was voted the AFLW’s most courageous player and has accumulated three All Australian blazers.\nChelsea is an amazing person. In a few short years, she went from being a postie in Esperance, to a regional manager in Newman who regularly drove 13 hours to play footy in Perth, to now one of the AFLW’s greatest ever players.\nWomen’s sport is on the rise and who wouldn’t want to support it?",
  "word_count": 829,
  "scraped_at": "2026-02-14T12:57:01.952536"
}