{
  "article_id": "10d4985a1508",
  "url": "https://www.postnewsgroup.com/a-look-at-the-2024-olympic-schedule-and-the-black-athletes-competing-in-paris/",
  "title": "A Look at the 2024 Olympic Schedule and the Black Athletes Competing in Paris",
  "date": "20240803T211500Z",
  "domain": "postnewsgroup.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "#NNPA BlackPress\nA Look at the 2024 Olympic Schedule and the Black Athletes Competing in Paris\nTHE AFRO — Take a look at some of the events and athletes you should keep an eye out for as the 19-day event unfolds.\nThe post A Look at the 2024 Olympic Schedule and the Black Athletes Competing in Paris first appeared on BlackPressUSA.\nPublished\n2 years agoon\nBy\nadmin\nBy Special to the Afro | The Afro American Newspaper\nThe 2024 Paris Olympics are under way and there are multiple athletes across the 32 sports being contested at the Olympic Games that should be on your radar. Take a look at some of the events and athletes you should keep an eye out for as the 19-day event unfolds.\nTrack and Field – Women\nSha’Carri Richardson\nRichardson is in search of redemption as she qualifies for the first Olympics of her young, accomplished career. The 2023 World Champion was ruled ineligible to compete at the 2021 Tokyo Olympics due to a positive drug test after winning the 2020 U.S. Olympic trials. She admitted to smoking marijauna to help deal with the death of her mother.\nNow, after repeating as the U.S. Olympic trials 100-meter dash champion, Richardson will look to claim the gold medal in Paris; something she didn’t even have a chance to do in 2021. As Richardson loves to say, “I’m not back– I’m better.”\nRichardson and her two training partners, Melissa Jefferson and TeeTee Terry, made history by becoming the first female training group to sweep an event at an Olympic trial meet. The women were coached by Dennis Mitchell, who will be looking to get the same result in Paris. The only coach to successfully lead his camp in sweeping both the national trials and the Olympics was Jamaican coach Glen Mills. Headlined by track and field legend Usain Bolt, Mills led his camp in sweeping the 200-meter dash at both the Jamaican trials as well as the 2012 London Olympic Games.\nThe 100-meter dash event begins Aug. 2 at 4:35 a.m. EST, with the event final taking place on Aug. 3 at 3:20 p.m. EST.\nThe 200-meter dash event begins on Aug. 4 at 4:55 a.m. EST, with the event final taking place on Aug. 6 at 3:40 p.m. EST.\nGabby Thomas\nThomas will look to use her Olympic experience to her advantage as she prepares for the trip to Paris. The 2021 Tokyo Olympic Games bronze medalist and 2023 World Championship silver medalist in the 200-meter dash will be looking to continue her strong 2024 outdoor campaign after dropping a world-leading time of 21.78 seconds at the U.S. Olympic trials.\nVeteran Jamaican sprinter and five-time Olympic medalist Shericka Jackson will challenge Thomas for the gold as she attempts the double (winning both the 100-meter dash and the 200-meter dash). Thomas’ teammate McKenzie Long will also be vying for a spot on the podium. The budding star has captured the hearts of America after the death of her mother. Long was able to channel her grief into motivation, winning the double at the 2024 National Collegiate Athletic Association (NCAA) Outdoor National Championships. She currently has the second fastest 200-meter time in the world right now at 21.83 seconds, according to World Athletics.\nThe 400-meter hurdles event begins on Aug. 4 at 6:35 a.m. EST, with the event final taking place on Aug. 8 at 3:25 p.m. EST.\nSydney McLaughlin-Levrone\nMcLaughlin-Levrone looks to continue to be in a class of her own as she prepares for the 2024 Paris Olympic Games. McLaughlin-Levrone is already the world record holder in the 400-meter hurdles, lowering the world record she already held to 50.65 seconds at the U.S. Olympic trials. The New Jersey native is already in contention for the best track and field athlete of all time, as she is an Olympic champion and a World champion in the 400 meter hurdles before the age of 25. She also currently has the fastest 400-meter dash time and sixth fastest 200-meter dash time in the world right now, but opted to focus solely on the 400-meter hurdles in Paris.\nVying for a podium finish is Anna Cockrell, who will be competing in her second Olympic Games. She finished seventh in the 2021 Tokyo Olympic 400-meter hurdle final, but was eventually disqualified due to a lane error. McLaughlin-Levrone’s stiffest competition will come from Dutch superstar Femke Bol. Bol is the world record holder in both the indoor 400-meter dash and the 300 meter hurdles.\nThe long jump event begins on Aug. 6 at 5:15 a.m. EST, with the event final taking place on Aug. 8 at 2:00 p.m. EST.\nTara Davis-Woodhall\n2024 World Indoor champion Davis-Woodhall, 25, looks to claim her first Olympic gold medal in Paris. Davis-Woodhall currently has the second furthest long jump distance in the world at 7.18 meters. Davis-Woodhall’s husband, Hunter Woodhall, will also be competing in 2024 at the Paralympic Games.\nFormer Florida Gator star Jasmine Moore, 23, made her second consecutive U.S. Olympic team and currently has the third furthest distance in the long jump at 6.98 meters (22 ft., 10.8 in.).\nThe 100-meter hurdle event begins Aug. 7 at 4:15 a.m. EST, with the event final taking place on Aug. 10 at 1:45 p.m. EST.\nMasai Russell\nRussell, a Maryland native, currently holds the fastest 100-meter hurdles time in the world at 12.25 seconds. The world-leading time was a breakthrough performance for the 24-year-old. Russell dropped the blazing time in the 100-meter hurdle final at the 2024 U.S. Olympic trials, taking home the gold.\nThe women’s short hurdles are one of the most competitive events in the world right now. Russell will be looking to continue her winning ways against world record holder and 2022 World Champion Tobi Amusan out of Nigeria and the reigning Olympic champion Jasmine Camacho-Quinn who was born in the United States but competes for Puerto Rico.\nTrack and Field – Men\nNoah Lyles\nLyles will be seeking to do something that only nine other men to grace this planet Earth have ever done – win both the 100-meter dash and the 200-meter dash at the Olympics. The historic Olympic “sprint double” has only been achieved four times since 1984, and three of those were courtesy of one of the greatest sprinters of all time, Usian Bolt. Lyles, the reigning 200-meter World champion, is the favorite in the 200 but the 100-meter dash is very much up for grabs.\nChallenging Lyles for gold in the 100-meter dash is Kishane Thompson of Jamaica, reigning Olympic 100-meter champion Lamont Marcel Jacobs and Kenya’s Ferdinand Omanyala.\nThe 100-meter dash event begins Aug. 3 at 4:35 a.m. EST, with the event final taking place on Aug. 4 at 3:50 p.m. EST.\nThe 110-meter hurdle event begins on Aug. 4 at 5:50 a.m. EST, with the event final taking place on Aug. 8 at 3:45 p.m. EST.\nGrant Holloway\nFive-time world champion and currently the second fastest man to ever run the short hurdles, Holloway will look to avenge his upset defeat at the 2021 Tokyo Olympics.\nReigning Olympic champion Hansle Parchment will be in the hunt to reclaim his title, while USA’s Daniel Robert will attempt to step out of Holloway’s shadow and have his breakthrough moment in Paris.\nThe javelin event begins on Aug. 6 at 4:20 a.m. EST, with the event final on Aug. 8 at 2:25 p.m. EST.\nCurtis Thompson\nThompson, now a two-time Olympian, will be looking to add an Olympic medal to his résumé. He is already an NCAA champion, a three-time American champion, and won the Pan American Games in 2023. He was the only javelin thrower from the United States to qualify for the Olympics.\nIndia’s Neeraj Chopra will be looking to reclaim his title as Olympic champion in the men’s javelin. Chopra was the first Asian athlete to win an Olympic gold medal in the javelin.\nThe shot put event starts on Aug. 2 at 2:10 p.m. EST, and the final takes place on Aug. 3 at 1:35 p.m. EST.\nRyan Crouser\nAlready regarded as the greatest shot putter of all time, Crouser will be looking to add yet another Olympic gold medal to his illustrious career. The three-time World champion and two-time Olympic gold medallist already holds both the world and Olympic records.\nCrouser’s stiffest competition will be fellow American Joe Kovacs. Kovacs defeated Crouser at the 2019 World Championships in Doha, but finished second to Crouser at both the 2016 Rio Olympics and the 2021 Tokyo Olympics.\nThe mixed 4×400 meter relay event begins on Aug. 2 at 1:10 p.m. EST.\nThe men’s 4×400 meter relay event begins on Aug. 9 at 5:05 a.m. EST.\nThe event finals take place on Aug. 3 at 2:44 p.m. EST and Aug. 10 at 3:12 p.m. EST, respectively.\nQuincy Wilson\nWilson will look to continue his historic season as the rising junior was named to the relay pool for Team USA. The 16-year-old phenom will have the opportunity to run for either or both the mixed 4×400 meter relay and the men’s 4×400 meter relay. That decision will not be made until the day of the event.\nMen’s Olympic basketball games begin on July 27 at 5 a.m. EST.\nThe bronze medal and gold medal games begin on Aug. 10 at 5 a.m. and 3:30 p.m. EST, respectively.\nMen’s Basketball – Team USA\nThe 2024 roster for Team USA Basketball appears to be one of the most talented teams in Olympic history, being challenged only by the 1992 Dream Team and the 2008 Redeem Team. Highlighted by LeBron James, Kevin Durant and Anthony Edwards, this team will look to prove to Noah Lyles and others that they are truly the best team in the world. Big additions to Team USA include Stephen Curry, who is surprisingly playing for Team USA for the first time ever, and 2023 NBA MVP Joel Embiid. James was awarded the honor of being Team USA’s flag bearer, making him the first male American basketball player with that distinction in Olympic history. Women’s National Basketball Association superstars Dawn Staley (currently head coach of the South Carolina Lady Gamecocks) and Sue Bird have previously been flag bearers for Team USA.\nThe group has a tough challenge ahead of them, however, as many believe that the basketball talent around the world is beginning to catch up with the Americans. Team USA’s biggest challenger will likely be Canada, sporting a roster that includes First Team All-NBA guard Shai Gilgeous-Alexander and Dillion Brooks. This is also believed to be the last Olympics for both James and Durant.\n*Derrick White has replaced Kawhi Leonard.\nMen’s 3×3 Basketball – Team USA\n3×3 basketball officially became an Olympic sport in 2017 and was contested for the first time at the 2021 Tokyo Olympics. Latvia took home the gold at the last Olympics, but Team USA will be looking for better fortune this time around.\nThe 3×3 roster is led by former NBA sharpshooter Jimmer Fredette and 3×3 veteran Kareem Maddox. Maddox, a Princeton grad, won Ivy League defensive player of the year honors back in 2011 and was a part of the 2019 FIBA 3×3 World Cup team that won gold in Amsterdam. He also holds two gold medals from the Pan American Games from both 2019 and 2023.\nMen’s Olympic 3×3 basketball games begin on July 30 at 12:35 p.m. EST\nThe gold medal and bronze medal game will take place on Aug. 5 at 4:30 p.m. and 3:30 p.m. EST, respectively.\nWomen’s Gymnastics\nThe USAs Women’s Gymnastics team is set to compete at the 2024 Paris Olympics where you will be able to watch the top US gymnasts like Simone Biles, Suni Lee, Jordan Chiles, Jade Carey, and Hezly Rivera. Biles is definitely someone to keep an eye on this summer as she has taken home over 30 Olympic and World medals. She is sure to make history as she makes her way to Paris.\nThe women’s gymnastics event begins on July 28 at 3:30 a.m. EST. The event final will take place on Aug. 6 at 6:38 a.m. EST.\nJessica Stevens\nOlympic athlete Jessica Stevens was born July 5, 2000 in Ellicott City, Md. She is in the 2024 Olympics for synchronized trampoline gymnastics and has her eyes on the gold this year. Stevens has a total of four world championship medals and earned a gold medal in 2023 for synchronized gymnastics during the Pan American Games.\nWomen’s Basketball\nTeam USA’s Women’s Basketball team is making history right now. The team has earned seven Olympic medals back to back. Their first match up will begin July 29. In Paris, they are set to play a number of teams that are in their equal group (group C) including Germany, Japan, and Belgium. To win gold, the Americans must advance from a team of 4 groups where they will then have to take home 3 consecutive wins in the knockout round. There is a multitude of talent on this year’s roster including A’ja Wilson, Brittney Griner, Diana Taurasi, Kelsey Plum, Alyssa Thomas and more.\nGames begin on July 29 at 7:30 a.m. EST, with the gold medal and bronze medal games taking place on Aug. 11 9:30 a.m. and 5:30 a.m. EST, respectively.\nWomen’s Soccer\nTeam USA’s Women’s Soccer team is headed to Paris with a roster filled up with 18 talented women. The team is now led by new head coach Emma Hayes, and she is ready and eager to fight for this year’s gold medal. The women’s team had a heartbreaking loss as the team had to exit the World Cup in 2023 unexpectedly. The opening ceremony took place on Friday, July 26, but the team had their first match on July 25 against Zambia. They will play against Germany on July 28 and face off against Australia on July 31. The quarter-finals will begin Aug. 3.\nGames begin on July 25 at 11 a.m. EST, with the bronze medal match taking place on Aug. 9 at 9 a.m. EST and the gold medal match on Aug. 10 at 11 a.m. EST.\nTennis\nTeam USA’s Olympic tennis team’s first tournament is set to begin July 27 to Aug. 4 in the Roland Garros on the red clay courts. This will be the first time Olympic tennis will be playing on the clay courts since 1992. Tennis was one of the nine original Olympic sports at the very first games in Athens in 1896. The team consists of gold medalists Coco Guaff, Jessica Pegula, Dannielle Collins, and Emma Navarro in singles. Desirae Krawczyk will be participating in the doubles round.\nThe games begin on July 27 at 6 a.m. EST, with the women’s singles gold medal match taking place on Aug. 3 at 6 a.m. EST. The women’s double gold medal match and single bronze medal match will take place on Aug. 4 at 6 a.m. EST.\nFive other Olympic athletes to keep an eye on:\nJahmal Harvey – Boxing\nJahmal Harvey, 21, was born November 19, 2002, in Oxon Hill, Md. Harvey is an Olympic boxer who is looking to bring the gold in Paris, back home. This is Harvey’s first time as an Olympic athlete, but he has some experience with participating in the Pan American Games back in 2023, in which he won gold. Harvey will be entering the 125-pound weight class in the Paris 2024 Olympics and is currently ranked No. 2 in the amateur featherweight category.\nTatiana Nazlymov – Fencing\nTatiana Nazlymoz, 19, was born Sept. 2, 2004 in Montgomery County, Md. She currently attends Princeton University as a sophomore. Nazlymoz competes in the Paris 2024 Olympic games for fencing and acclaims her fencing career to her father and grandfather, who were fencers as well. Nazlymov has some world championship experience as she competed with the women’s saber team in the Pan-American senior championships and won gold, but this will be her first time on an Olympic team.\nAaron Russel – Volleyball\nAaron Russel is a two-time Olympic athlete born in Baltimore. The 6’9” volleyball player who played at Pennsylvania State University is now going for the gold in the Paris 2024 Olympic games. Russel is pursuing to level up his bronze medal from the Rio 2016 Olympics to gold. Russel also plays club volleyball here in Maryland under former gold medalist Aldis Berzins.\nTaylor Knibb – Triathlon\nTaylor Knibb, a Washington, DC native, is competing in the Paris 2024 triathlon. Knibbs competed in the 2020 Olympics, where she won silver in the mixed relay, and is now making her way to Paris for gold.\nCarl Nickolas Jr. – Taekwondo\nCarl (CJ) Nickolas Jr. is a 23-year-old American taekwondo practitioner hailing from Oakland, Calif. Nickolas is a three-time Pan American Games gold medallist and won a silver medal at the World Championships in 2023. Nickolas is currently ranked as the second-best fighter in his weight category of 80 kilograms (176 pounds).\nThe post A Look at the 2024 Olympic Schedule and the Black Athletes Competing in Paris first appeared on BlackPressUSA.\nadmin\nYou may like\n-\nCOMMENTARY: The National Protest Must Be Accompanied with Our Votes\n-\nWhy Black Parents Should Consider Montessori\n-\nLIVE from the NMA Convention Raheem DeVaughn Says The Time Is Now: Let’s End HIV in Our Communities #2\n-\nVoChill\n-\nDon Lemon Made the Headlines, but Georgia Fort’s Arrest Shows No Journalist Is Safe\n-\nBlack Educators, Others Reimagine Future of Education\nLeave a Reply\nCancel reply\n#NNPA BlackPress\nCOMMENTARY: The National Protest Must Be Accompanied with Our Votes\nJust as Trump is gathering election data like having the FBI take all the election data in Georgia from the 2020 election, so must we organize in preparation for the coming primary season to have the right people on ballots in each Republican district, so that we can regain control of the House of Representatives and by doing so, restore the separation of powers and balance that our democracy is being deprived of.\nPublished\n3 days agoon\nFebruary 10, 2026By\nOakland Post\nBy Dr. John E. Warren, Publisher San Diego Voice & Viewpoint Newspaper\nAs thousands of Americans march every week in cities across this great nation, it must be remembered that the protest without the vote is of no concern to Donald Trump and his administration.\nIn every city, there is a personal connection to the U.S. Congress. In too many cases, the member of Congress representing the people of that city and the congressional district in which it sits, is a Republican. It is the Republicans who are giving silent support to the destructive actions of those persons like the U.S. Attorney General, the Director of Homeland Security, and the National Intelligence Director, who are carrying out the revenge campaign of the President rather than upholding the oath of office each of them took “to Defend The Constitution of the United States.”\nJust as Trump is gathering election data like having the FBI take all the election data in Georgia from the 2020 election, so must we organize in preparation for the coming primary season to have the right people on ballots in each Republican district, so that we can regain control of the House of Representatives and by doing so, restore the separation of powers and balance that our democracy is being deprived of.\nIn California, the primary comes in June 2026. The congressional races must be a priority just as much as the local election of people has been so important in keeping ICE from acquiring facilities to build more prisons around the country.\n“We the People” are winning this battle, even though it might not look like it. Each of us must get involved now, right where we are.\nIn this Black History month, it is important to remember that all we have accomplished in this nation has been “in spite of” and not “because of.” Frederick Douglas said, “Power concedes nothing without a struggle.”\nToday, the struggle is to maintain our very institutions and history. Our strength in this struggle rests in our “collectiveness.” Our newspapers and journalists are at the greatest risk. We must not personally add to the attack by ignoring those who have been our very foundation, our Black press.\nAre you spending your dollars this Black History Month with those who salute and honor contributions by supporting those who tell our stories? Remember that silence is the same as consent and support for the opposition. Where do you stand and where will your dollars go?\nOakland Post\n#NNPA BlackPress\nWhy Black Parents Should Consider Montessori\nBLACKPRESSUSA NEWSWIRE — I have found that there are some educational approaches that consistently provide a safer, more enriching, and more affirmative environment for Black children. The Montessori method, developed by Italian physician Maria Montessori and introduced to the U.S. in the early 20th century, is one such approach.\nPublished\n5 days agoon\nFebruary 9, 2026By\nOakland Post\nAs a mother of four children, I’ve done A LOT of school shopping. I don’t mean the autumn ritual of purchasing school supplies. I mean shopping for schools – pouring over promotional materials, combing through websites, asking friends and community members for referrals to their favorite schools, attending open houses and orientations, comparing curriculums and educational philosophies, meeting teachers and principals, and students who all claim that their school is the best.\nBut keep in mind – I’m not just a mom of four children. I’m a mom of four Black children, and I’m also a psychologist who is very interested in protecting my little ones from the traumatic experience that school can too often become.\nFor Black children in the United States, school can sometimes feel more like a prison than an educational institution. Research shows that Black students experience school as more hostile and demoralizing than other students do, that they are disciplined more frequently and more harshly for typical childhood offenses (such as running in the halls or chewing gum in class), that they are often labeled as deviant or viewed as deficient more quickly than other children, that teachers have lower academic expectations of Black students (which, in turn, lowers those students’ expectations of themselves), and that Black parents feel less respected and less engaged by their children’s teachers and school administrators. Perhaps these are some of the underlying reasons that Black students tend to underperform in most schools across the country.\nThe truth is that schools are more than academic institutions. They are places where children go to gain a sense of who they are, how they relate to others, and where they fit into the world. The best schools are places that answer these questions positively – ‘you are a valuable human being, you are a person who will grow up to contribute great things to your community, and you belong here, with us, exploring the world and learning how to use your gifts.’ Unfortunately, Black children looking for answers to these universal questions of childhood will often hit a brick wall once they walk into the classroom. If the curriculum does not reflect their cultural experiences, the teachers don’t appear to value them, and they spend most of their time being shamed into compliance rather than guided towards their highest potential, well…what can we really expect? How are they supposed to master basic academic skills if their spirits have been crushed?\nHere’s the good news. In my years of school shopping, and in the research of Black education specialists such as Jawanza Kunjufu and Amos Wilson, I have found that there are some educational approaches that consistently provide a safer, more enriching, and more affirmative environment for Black children. The Montessori method, developed by Italian physician Maria Montessori and introduced to the U.S. in the early 20th century, is one such approach.\nThe key feature of Montessori schooling is that children decide (for the most part) what they want to do each day. Led by their own interests and skill levels, children in a Montessori classroom move around freely and work independently or with others on tasks of their own\nchoosing. The classroom is intentionally stocked with materials tailored to the developmental needs of children, including the need to learn through different senses (sight, touch/texture, movement, etc.). The teacher in a Montessori classroom is less like a boss and more like a caring guide who works with each child individually, demonstrating various activities and then giving them space to try it on their own. The idea is that over time, students learn to master even the toughest tasks and concepts, and they feel an intense sense of pride and accomplishment because they did it by themselves, without pressure or pushing.\nI think that this aspect of the Montessori method is good for all kids. Do you remember the feeling of having your creativity or motivation crushed by being told exactly what to do, when to do it, how to do it, and why? The truth is that when presented with a new challenge and then given space, children actually accomplish a lot! They are born with a natural desire to learn. It is that spirit of curiosity, sense of wonder, and excitement to explore that Montessori helps to keep alive in a child. But that’s not the only reason that I think Black parents need to consider Montessori.\nFostering a love of learning is great. But more importantly, I think that Montessori students excel at learning to love. It begins with Montessori’s acknowledgement that all children are precious because childhood is a precious time. In many school systems, Black children are treated like miniature adults (at best) or miniature criminals (at worst), and are subjected to stressful situations that no kids are equipped to handle – expectations to be still and silent for long periods, competitive and high-stakes testing, and punitive classroom discipline. It’s easy to get the sense that rather than being prepared for college or careers, our children are being prepared to fail. Couple this with the aforementioned bias against Black children that seems to run rampant within the U.S. school system, and you end up with children who feel burned out and bitter about school by the time they hit 3rd grade.\nIn my experience, Montessori does a better job of protecting the space that is childhood – and all the joy of discovery and learning that should come along with that. Without the requirement that students “sit down and shut up,” behavioral issues in Montessori classrooms tend to be non-existent (or at least, the Montessori method doesn’t harp on them; children are gently redirected rather than shamed in front of the class). Montessori students don’t learn for the sake of tests; they demonstrate what they’ve learned by sharing with their teacher or classmates how they solve real-world problems using the skills they’ve gained through reading, math, or science activities. And by allowing children a choice of what to focus on throughout the day, Montessori teachers demonstrate that they honor and trust children’s natural intelligence. The individualized, careful attention they provide indicates to children that they are each seen, heard, and valued for who they are, and who they might become. Now that’s love (and good education).\nAs a parent, I’ve come to realize that many schools offer high-quality academics. Montessori is no different. Students in Montessori schools gain exposure to advanced concepts and the materials to work with these concepts hands-on. Across the nation, Montessori schools emphasize early literacy development, an especially important indicator of life success for young Black boys and men. Montessori students are provided with the opportunity to be\nsuccessful every day, and the chance to develop a sense of competence and self-worth based on completing tasks at their own pace.\nBut I have also learned that the important questions to ask when school shopping are often not about academics at all. I now ask, ‘Will my children be treated kindly? Will they be listened to? Protected from bias and bullying? Will they feel safe? Will this precious time in their lives be honored as a space for growth, development, awe, and excitement? Will they get to see people like them included in the curriculum? Will they be seen as valuable even if they don’t always ‘measure up’ to other kids on a task? Will they get extra support if they need it? Will the school include me in major decisions? Will the school leaders help to make sure that my children reach their fullest potential? Will the teacher care about my children almost as much as I do?’\nConsistently, it’s been the Montessori schools that have answered with a loud, resounding ‘Yes!’ That is why my children ended up in Montessori schools, and I couldn’t be happier with that decision. If you’re a parent like me, shopping for schools with the same questions in mind, I’d urge you to consider Montessori education as a viable option for your precious little ones. Today more than ever, getting it right for our children is priceless.\nOakland Post\n#NNPA BlackPress\nLIVE from the NMA Convention Raheem DeVaughn Says The Time Is Now: Let’s End HIV in Our Communities #2\nSet against the backdrop of the NMA conference, Executive Officers from the National Medical Association, Grammy Award Winning Artist and Advocate Raheem DeVaughn, and Gilead Sciences experts, are holding today an important conversation on HIV prevention and health equity. Black women continue to be disproportionately impacted by HIV despite advances in prevention options. Today’s event […]\nPublished\n1 week agoon\nFebruary 3, 2026By\nOakland Post\nSet against the backdrop of the NMA conference, Executive Officers from the National Medical Association, Grammy Award Winning Artist and Advocate Raheem DeVaughn, and Gilead Sciences experts, are holding today an important conversation on HIV prevention and health equity.\nBlack women continue to be disproportionately impacted by HIV despite advances in prevention options. Today’s event is designed to uplift voices, explore barriers to access, and increase awareness and key updates about PrEP, a proven prevention method that remains underutilized among Black women. This timely gathering will feature voices from across health, media, and advocacy as we break stigma and center equity in HIV prevention.\nAdditional stats and information to know:\n● Black women continue to be disproportionately affected by HIV, with Black women representing more than 50% of new HIV diagnoses among women in the U.S. in 2022, despite comprising just 13% of women in the U.S.\n● Women made up only 8% of PrEP users despite representing 19% of all new HIV diagnoses in 2022.\n● Gilead Sciences is increasing awareness and addressing stigma by encouraging regular HIV testing and having judgment-free conversations with your healthcare provider about prevention options, including oral PrEP and long-acting injectable PrEP options.\n● PrEP is an HIV prevention medication that has been available since 2012.\n● Only 1 in 3 people in the U.S. who could benefit from PrEP were prescribed a form of PrEP in 2022.\nOakland Post\nSEARCH POST NEWS GROUP\nCHECK OUT THE LATEST ISSUE OF THE OAKLAND POST\nADVERTISEMENT\nWORK FROM HOME\nHome-based business with potential monthly income of $10K+ per month. A proven training system and website provided to maximize business effectiveness. Perfect job to earn side and primary income. Contact Lynne for more details: Lynne4npusa@gmail.com 800-334-0540\nDiscrimination in City Contracts\nCOMMENTARY: The National Protest Must Be Accompanied with Our Votes\nCongresswoman Simon Votes Against Department of Homeland Security, ICE Funding\nPost Newspaper Invites NNPA to Join Nationwide Probate Reform Initiative\nCommunity Celebrates Turner Group Construction Company as Collins Drive Becomes Turner Group Drive\nNew Bill, the RIDER Safety Act, Would Support Transit Ambassadors and Safety on Public Transit\nTrump’s White House Pushes to Control California Wildfire Recovery\nGov. Newsom, AG Bonta to Local Law Enforcement: You Have Authority to Investigate Federal Agents\nDorothy Lee Bolden: Uniting Domestic Workers\nCracking Down on Human Trafficking, California DOJ Announces 120 Arrests\nCOMMENTARY: The Biases We Don’t See — Preventing AI-Driven Inequality in Health Care\nCalifornia Launches Study on Mileage Tax to Potentially Replace Gas Tax as Republicans Push Back\nBook Review: Books on Black History and Black Life for Kids\nBlack Caucus Members Join Legislative Democrats to Condemn Fatal Shootings by Federal Agents\nAs California Hits Aging Milestone, State Releases Its Fifth Master Plan for Aging\nOP-ED: AB 1349 Puts Corporate Power Over Community\nProtecting California’s Black Moms and Babies: Policies and Programs Struggle to Fix Deep-Rooted Maternal Health Inequities\nOakland Post: Week of December 31, 2025 – January 6, 2026\nWhy Peace on Earth Begins with Birth, a Q&A with Midwife Nikki Helms\nJefferson County (AL) Democrats Open Qualifying for 2026 Primary Elections\nSkater Emmanuel Savary Sharpens Routines for the 2026 U.S. Championships\nCOMMENTARY: With Gratitude and Praise for 2026\nFrom Civil Rights to ICE Raids, Trump’s Unchecked Power Puts Every Community at Risk\nFrom Civil Rights to ICE Raids, Trump’s Unchecked Power Puts Every Community at Risk\nOP-ED: The Dream Cannot be Realized Without Financial Freedom\nTravis Scott Teaches Us How to Give Forward\nFour Stolen Futures: Will H-E-B Do The Right Thing?\nNewsom’s Finance Director Joe Stephenshaw Opens 2026-27 Budget Debate with Cautious Plan\nStreet Lines: 2025 Jeep Wagoneer S Limited 4XE\nStreet Lines: 2025 Jeep Wagoneer S Limited 4XE\nHyundai Ioniq 5 Parking, Safety, and 360 View #shorts\n2025 Ioniq 5 New Wiper & Powerful Performance! #shorts\nElectric SUV Range: Is 259 Miles Enough? #shorts\nEV Charging: How Fast Can You Charge an Electric Vehicle? #shorts\nBiometric Cooling… Messaging Seats…Come on! 2025 Infiniti QX80 Autograph 4WD\nCharged Up: Witness the Magic of a Fully Electric Car! #shorts\nRange Rover Sport PHEV Included…: See What’s Inside This Luxury SUV! #shorts\nInvisible Hood View: Perfect Parking with X-Ray Vision! #shorts\nAI Is Reshaping Black Healthcare: Promise, Peril, and the Push for Improved Results in California\nESSAY: Technology and Medicine, a Primary Care Point of View\nSanctuary Cities\nThe RESISTANCE – FREEDOM NOW\nSTATE OF THE PEOPLE: Freddie\nECONOMIC BOYCOTT DAY!!!!!\nI told You So\nTrending\n-\n#NNPA BlackPress4 weeks ago\nOP-ED: The Dream Cannot be Realized Without Financial Freedom\n-\n#NNPA BlackPress4 weeks ago\nTravis Scott Teaches Us How to Give Forward\n-\n#NNPA BlackPress4 weeks ago\nFour Stolen Futures: Will H-E-B Do The Right Thing?\n-\nActivism3 weeks ago\nOakland Post: Week of January 21 – 27, 2026\n-\nActivism1 week ago\nLife Expectancy in Marin City, a Black Community, Is 15-17 Years Less than the Rest of Marin County\n-\nActivism1 week ago\nOakland Post: Week of January 28, 2025 – February 3, 2026\n-\nUncategorized1 week ago\nHomegoing Service for Education Advocate Oscar Wright, 101\n-\nActivism1 week ago\nMedi-Cal Cares for You and Your Baby Every Step of the Way",
  "word_count": 5786,
  "scraped_at": "2026-02-14T12:17:57.047887"
}