{
  "article_id": "10ec14e13e19",
  "url": "https://www.the42.ie/colin-healy-interview-6711873-May2025/",
  "title": "  The way Ive been treated is a lack of respect  - Colin Healy refutes FAI explanation of his exit",
  "date": "20250522T233000Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "COLIN HEALY HAS decided to break his silence on the FAI’s handling of his exit as WNT assistant coach last year to, in his own words, “put a line through it and move forward.”\nHealy thus sat down in Dublin this week with a small number of media outlets, including The 42.\nHe recounted the manner and revealed new details of his exit from the FAI, and reflected on the impact the story has had on him and his two children, as they continue to grieve the loss of their mother and Healy’s wife, Kelly, who died in April last year after a long battle with leukemia.\n**********\nHealy is back in football, appointed as Kerry FC manager earlier this month.\n“When the kids are at school and you’re home alone, it can be quiet and those thoughts can be difficult,” says Healy. “Getting back to work gives me a focus and a purpose and takes my mind off things, for some of the day anyway.”\nIt is Healy’s first job in football since the FAI decided not to renew his contract as assistant to senior women’s national team manager Eileen Gleeson in December, 2024.\nOn 16 January, the morning of Carla Ward’s public unveiling as Gleeson’s successor, Healy released a statement through his representatives explaining the manner of his departure, accusing the FAI of a lack of “transparency and compassion”.\nHealy revealed he had been offered a two-year contract as Cobh Ramblers manager in November last year, which would have allowed him to work full-time while living at home and raising his children Arran (20) and Holly (13).\nWhen he informed the FAI of the offer, Healy says chief football officer Marc Canham gave him assurances his contract with the FAI would be renewed, and so, in Healy’s words, he allowed his heart rule his head and rejected the Cobh job. The following month, Canham told Healy he was out of a job altogether.\nHealy spoke to his children and to his parents about the possibility of putting out a statement on the matter to set the record straight, knowing it would garner national media attention.\n“I felt I had to do it,” says Healy.\n“Christmas was tough for the family, it was tough obviously losing a job. I was quite hurt over Christmas and I felt I had to say something. I wouldn’t like if it was done to anyone else, so I wanted to say something.”\nHealy says he sought permission from the FAI to speak with Cobh Ramblers about the vacant manager’s role, for which he was ultimately offered a two-year contract. That offer came less than a month before Ireland’s Euro 2025 play-off against Wales. Were Ireland to lose that game, Healy, along with Gleeson, would have been out of contract.\nWhen Healy spoke to Canham about the job offer from Cobh, he says Canham offered him assurance about his continued job prospects at the FAI. Canham, says Healy, told him he would recommend to the board that Healy’s contract be renewed, “bar a hammering” in the play-off against Wales.\nHealy decided to say no to Cobh.\n“Eileen was fully sure we were going to be staying on,” says Healy. “I enjoyed my time working with the team at the FAI, so I turned down the (Cobh) job. It was a two-year contract around the corner from my house. Because I was led to believe I was going to be staying on.”\nIreland lost the Wales play-off 3-2 on aggregate over two legs.\nOn 9 December, Healy received a phone call from Canham, which he understood was part of the FAI’s official review of the previous international camp. “The review was just a conversation speaking about the match, it was very straightforward,” says Healy.\n“There were other people spoken to as well. You’re just having a conversation about the camp, you’re not saying, ‘We need to do this better and that better.’ It was a conversation about the match, how it went, and how was training. It was very straightforward.”\nThat call lasted around 30 minutes.\nTwo days later, on 11 December, Healy received a call from Canham to tell him the board had decided not to renew his or Gleeson’s contracts.\n“I was the assistant of the national team,” says Healy. “Would you not bring me up to Dublin and sit down to have a conversation? When I was a manager with Cork City and when you’re releasing players, you sit down with them and give them that respect. You have that conversation: you let them have their say and you have your say.\n“You show respect, don’t you? A four-minute phone call, thanking me for my service. I didn’t have to go back. I could have stayed off the whole year and said I’m not ready to go back. But I went back. I went back for the players, for the staff, and I went back for myself. I don’t think they showed too much respect for that.”\nHealy says Canham told him the board made the decision. It was not until a Eileen Gleeson told him in a later message that Healy learned that Canham had recommended to the board that his and Gleeson’s contracts should not be renewed. Canham later confirmed he had made this recommendation to the board. After the call with Canham, Healy was under the impression the board had made the decision without Canham’s recommendation.\nThe following day, on 12 December, Healy received a message from CEO David Courell thanking him for his service and expressing a wish that he would have continued with the FAI.\nIt was Healy’s impression that Courell believed Healy had left of his own accord as he had another job opportunity in the League of Ireland, rather than been told his contract would not be renewed.\nHealy replied to Courell to clarify he had been let go by the FAI.\n“To get a text saying, ‘I hoped you would continue’. . .I found it very strange to be honest”, says Healy.\nThe following day – on which the men’s 2026 World Cup qualifying draw event took place – Courell texted Healy again, to clarify that, yes, he knew he had been told his contract hadn’t been renewed and that he meant the FAI would be happy to work with Healy again if the new manager identified him as their preferred assistant.\nWhen Canham and Courell faced the media alongside Carla Ward on 16 January, they said Healy “misinterpreted” what they had said. Canham said he had offered “no absolute guarantees” to Healy about his contract, while Courell said “it couldn’t have been clearer” that Healy’s contract had not been renewed, and that Healy had misinterpreted his original message.\nHealy says he did not watch the press conference, but did read what Canham and Courell said.\n“I was going through an awful lot of stuff anyway,” says Healy, “but I was a bit upset by it.”\n“They said I ‘misinterpreted’ what they said. I didn’t like that obviously. It was on television so everybody sees it.\n“What was said in the text: they said it was a football decision that I wasn’t [given a contract renewal] but why did the CEO, in his text, say that he was hoping for me to continue? I find that very strange.”\nAsked if Canham and Courell were telling the truth at the press conference, Healy replies, “No”.\nHealy says he has not been contacted directly by Courell or Canham since. He says he has also not received any direct contact from FAI president Paul Cooke or the wider board of the FAI. He did meet with the FAI’s people and culture director, Aoife Rafferty.\nCanham will soon exit the FAI, having opted to leave his job. Asked if he has confidence in Courell’s ability to lead the FAI as CEO, Healy replies, “That is a hard question. I won’t answer that one.”\nHealy has had consistent public support from WNT players, including Denise O’Sullivan and Amber Barrett.\n“It means so much,” says Healy. “Amber, Denise, Katie [McCabe], they have all spoken up about it, and the coaches as well.”\nThere remains doubt as to Gleeson’s position with the FAI. It was widely reported that she had a clause in her contract entitling her to return to a staff position with the FAI once her duties as WNT head coach ended, though the FAI are refusing to comment as to whether she had assumed any job.\n“She’s brilliant with the girls, is a good coach and we had a good thing going,” says Healy of Gleeson, “but she was let down very badly as well, the way she was treated. It’s not nice and I imagine Eileen will have her say.”\nHealy says the entire episode has had an impact on his children.\n“It was not difficult for me, it was difficult for my kids,” he says. “And it was very difficult. I felt it was the right thing to do. I knew what it was going to bring but I spoke to the kids about it and they were happy for me to do it.\n“They were upset as well, from what happened. Holly used to go to the matches and she loved it. That was all taken away from her.”\nHealy says he would be open to working with the FAI again in the future, but says for the benefit of all in the future, the Association must stop doing this business over the phone.\n“It did surprise me, it really did, because it is the highest level,” he says. “That is what you are working with. I thought it would have been better but obviously it wasn’t. Really disappointing. I hope they change. I think they have to change. I don’t think it is good enough.\n“Whenever I am releasing players or when I was released as a player, you are sat down and spoken to. You are given the reason why you are released. You can have your say but you go out the door with a clear understanding of what has been said. And then that is it.\n“In all my career, when I was with Sunderland, Ipswich, these things happen but you leave the building knowing. It is not text messages or calls. It is face to face conversations.\n“I think Marc Canham said I was ‘so hurt’ and it was ‘regrettable’ and rightly so,” continued Healy, referring to subsequent media comments by Canham.\n“I travelled the world with Ireland. The U18s, we got to the European Championships, and U19s, we came third, and went to the World Cup with the U20s and I captained the U21s at one stage. Played senior. Did all my coaching badges with [men's U19 manager] Tom Mohan for three years, learning from one of the best coaches around.\n“The FAI have done so much for me, and I had some great years, but to leave the way it happened, hurt.\n“I don’t want to do these things but I felt like I had to.\n“Hopefully this does not happen to anyone else. Mistakes were made. Hopefully they do not do it again because it was not nice. I have given a lot to the FAI as a player and as a coach. The way I have been treated is a lack of respect.”\nThe FAI declined to comment any further following a request from The 42.",
  "word_count": 1910,
  "scraped_at": "2026-02-14T14:16:55.800041"
}