{
  "article_id": "10fa72c73887",
  "url": "https://www.thedailymeal.com/1232895/things-you-didnt-know-about-dr-pepper/",
  "title": "14 Facts About Dr . Pepper That Are Pretty Fascinating",
  "date": "20250603T223000Z",
  "domain": "thedailymeal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "14 Facts About Dr. Pepper That Are Pretty Fascinating\nWhen you think of soda, there are some brands that inevitably come to mind — like Coca-Cola and Pepsi — but one stands out from the crowd: Dr Pepper. Whereas other drinks can be categorized easily as cola, ginger ale, or root beer, Dr Pepper stands alone as its own not-easily-definable soda. The category is often referred to as a \"pepper soda,\" which refers not to the spicy plant peppers but instead specifically to the drink Dr Pepper. This type encompasses many of the knock-off and generic versions, such as Mr. Pibb (now reformulated and marketed as \"Pibb Xtra.\")\nDr Pepper is one of the oldest sodas still available today, having been founded in 1885. Yes, that is even before Coca-Cola. Yet, despite showing up as a relative underdog, Dr Pepper has persevered. Even while other soda companies have seen dips in popularity over the years, Dr Pepper sales continue to be strong and are even growing, according to CNN. Given this unique foothold, it is not surprising that Dr Pepper's history is full of fascinating facts.\n1. It all started in Waco\nDr Pepper's history starts at Morrison's Old Corner Drug Store in Waco, Texas in the early 1880s. As with many drug stores back in the day, this outlet was far better than the ones we have now, as they had a soda fountain, as well as a pharmacy. A man named Charles Alderton was a pharmacist in the store, but in his spare time, he enjoyed going over to the soda fountain and mixing up different concoctions.\nAlderton was so inspired by the smell of the shop he set to work trying to create a soda that tasted the way the room smelled. Of course, Alderton, as a pharmacist, took a downright scientific approach. He experimented with different combinations, using the flavors available at the soda fountain. He kept a journal with detailed notes on each experiment, trying to find a drink that met his set criteria. This became a project for him that he did not turn from until it was complete.\n2. The flavor is what makes it\nOnce Charles Alderton finally got the flavor near to his liking, he allowed Wade Morrison, the store's owner, to try it. The two worked out the final formula, and Morrison began to serve it to his customers. The drink quickly grew in popularity, with customers coming in specifically to order the drink.\nSoon, other drugstore soda fountains wanted in on the action, and they began to purchase syrup from Alderton and Morrison. There was just one problem. As a small independent soda fountain, they did not have enough supplies to keep up with the high demand.\nAs it turns out, Alderton was not too interested in solving this problem. His goal had been to create the drink, but he had no designs to market it further. He sold the company to Morrison and a beverage chemist named Robert S. Lazenby. The two of them took Dr Pepper and brought it into the broader world. In 1891, they formed the Artesian Manufacturing and Bottling Company, and in 1904, the pair brought Dr Pepper to the World's Fair Exposition in St. Louis, where they premiered the product to nearly 20 million people — setting the stage for Dr Pepper's expansion.\n3. The mysterious Dr. Pepper\nOf course, where would any product be without a great name? There is never a question about what someone is talking about when they speak of Dr Pepper. However, this was not the only name the drink had.\nWhen the drink was first served at Morrison's shop, customers would order it as a \"Waco\" after the name of the city where it was invented. Morrison is thought to have given the beverage the Dr Pepper moniker. However, there has been no proven connection to any real Dr Pepper or even where the name came from.\nThe company's website claims that Morrison got the name from a Dr. Charles Pepper, the father of a girl Morrison was in love with. However, Joy Summar-Smith of the Dr Pepper Museum told CNN this is unlikely, as Morrison was already married when he gave the soda its name. Some even claim that rather than referring to a person or the plant, the \"pepper\" actually refers to the \"pep\" the beverage gives you, at one point adopting the slogan \"Dr Pepper is the friendly pepper upper.\" The company dropped the period from its name in the 1950s. Sadly, we may never know the true inspiration for the soft drink's name.\n4. Becoming the King of Beverages\nOne of the company's early slogans was \"King of Beverages,\" which today makes a lot of sense, but in those days, Dr Pepper still had a long climb to claim its crown. The 1920s was a rough time for them, as Artesian Manufacturing and Bottling Company was purchased by Circle \"A\" Corporations, which went bankrupt just three years later. Nevertheless, the company managed to scrape itself together and became the Dr. Pepper Company.\nThe company continued to ramp up production and push the beverages through advertising. One of its biggest campaigns was during the 1920s and 1930s. Research of the time showed that people had a slump in energy during 10:30, 2:30, and 4:30. The company started using a \"10, 2, 4\" logo, which can still be seen today on historic buildings. Later, during World War II, sugar rationing hit the soda industry hard. Dr Pepper took this opportunity to promote its product not just as a drink, but as food and fuel. They went so far as to create a booklet called \"The Liquid Bite\" to promote Dr Pepper as a food source. This explains the slogan, \"Drink a bite to eat at 10, 2, and 4.\" While these were rough times, Dr Pepper managed to stay afloat through the Great Depression and two world wars.\n5. The rise to national success\nAfter World War II, Dr Pepper continued to putter along for a few years, staying a predominantly regional beverage in the south. However, that all changed in the 1960s with a series of smart marketing and some help from the United States courts.\nIn the 1960s, Pepsi sued Dr Pepper for trademark infringement in an attempt to squash Dr Pepper. Dr Pepper turned around and counter-sued and pulled off what D Magazine describes as a \"legal coup\" and got the courts to agree that the product is not a cola. This opened up distribution deals with companies that previously could only carry one kind of cola. Suddenly, Dr Pepper was able to go national.\nThen came Woodrow Wilson \"Foots\" Clements. He started as a Dr Pepper salesman but rose through the ranks. He eventually made his way into marketing, then as executive vice president, and all the way to being a chief executive officer. Clements is often credited for much of the success of the company, and it is clear why. From 1968 to 1977, under Clements, sales and earnings more than quintupled, making Dr Pepper a powerhouse and setting it up as a significant competitor.\n6. Hot Dr Pepper never quite took off\nDespite Dr Pepper's excellent products, there are a few attempts at marketing that never really took off. Hot Dr Pepper was one of the ones that just did not endure the test of time. That is right, Dr Pepper served steaming hot.\nThe first ads for Hot Dr Pepper started to show up in 1958, thanks to the company president Wesby R. Parker. Ads showing families enjoying the drink began to come out, with directions on how to make it. This included warming Dr Pepper in a pan and then pouring it over a thinly-sliced lemon in a cup. This may sound gross, but it was created as a way to keep selling soft drinks even during the winter when sales naturally slumped.\nThe push for Hot Dr Pepper lasted much longer than one might think, partly due to \"Foots\" Clements. Ads through the 1960s continued to run, using it as a holiday drink and featuring stars of the time. Hot Dr Pepper has not held on in the same way the company would have liked, but it is worth noting that Clements continued to enjoy Hot Dr Pepper as his morning drink for decades to come.\n7. There have been questionable ad campaigns\nIn 2011, Dr Pepper came out with a new low-calorie version called Dr Pepper 10. Despite a history of playful and wonderful slogans, this time Dr Pepper went straight for the sexism with the tagline \"Not for Women.\" It was bizarre, to say the least, and garnered public scrutiny. Representatives for the company claimed the rationale was due to data that showed men shied away from diet soda, and they wanted to make the product more manly. Dr Pepper 10 no longer shows up on the company's website and is likely discontinued.\nJust one year later, Dr Pepper released an ad detailing the \"evolution of Dr Pepper.\" The image showed what appears to be a gorilla, turning into a biped picking up a Dr Pepper, who turns into a homo sapien drinking the Dr Pepper. The ad sparked Internet outrage, particularly from Christian groups, some of whom threatened to boycott the company. The ad also sparked large debates about free speech.\n8. No one knows the flavor\nThe thing that makes Dr Pepper is undoubtedly the flavor. Charles Alderton set out to make a soda that tasted the way the fountain smelled, and he succeeded. The thing is, with all those flavors available to him, Dr Pepper could be a concoction of just about anything. The signature \"23\" on the label signifies the 23 flavors blended together to make the soda, but the exact flavors are a closely-guarded secret.\nThat, of course, has not stopped people from speculating. Common suggestions include black licorice, anise, ginger, molasses, orange, almond, cherry, and cola, among others. Some have even suggested flavors such as tomato.\nOne of the most common flavors suggested is prune. This rumor dates back to the 1930s and is still popular today. However, the company has stated Dr Pepper does not contain prune juice. At least we know who to blame, though. Dr Pepper has stated the rumor originated from a joke made by comedian Bob Hope that has stuck around ever since.\n9. There have been lots of flavors over the years\nWe all know classic Dr Pepper is the real star of the show, but in addition to that original recipe with 23 flavors, there have been a lot of variations over the years. Low-calorie versions such as Diet Dr Pepper, Dr Pepper 10, and Dr Pepper 0 have made appearances starting in the 1960s. For a long time, that was it, but in the 2000s, things began to get a little more interesting.\nIn 2002 Dr Pepper released Red Fusion which was a cherry-flavored soda. It did not do well and was discontinued a few years later. However, it walked so Cherry Vanilla Dr Pepper could run. This flavor is still around today and comes in a diet version, as well. Dr Pepper Berries and Cream came out in 2006 but was discontinued. Years later, in 2023, Strawberries and Cream Dr Pepper joined the line-up.\nDr Pepper Chocolate, Dr Pepper Vanilla Float, Dr Pepper Dark Berry, Dr Pepper Cherry, and Dr Pepper Cream Soda round out the added flavors category. However, one more section to consider is real sugar. First, Dr Pepper released Heritage Dr Pepper, and then Dr Pepper Made With Real Sugar. Both of these use cane sugar instead of corn syrup and feature retro-style cans and bottles.\n10. Dr Pepper has lots of branded products\nWe know Dr Pepper has done well for itself in part due to its exceptional marketing, aside from one or two missteps. This is partly because Dr Pepper has done an excellent job creating branded products over the years. For those who want the taste of Dr Pepper even when they are not drinking the soda, they had a deal with lip balm company Bonne Bell for its Lip Smackers, which lasted for almost five decades. Sadly, that arrangement expired in 2020.\nIf you still need a hit of the beverage's flavor, there are Dr Pepper Jelly Beans from Jelly Belly, Slurppees, Freezies, hard candies, cotton candy, peeps, and barbecue sauce. If you just want the allure of Dr Pepper around you without the taste, there are yet still more options — Dr Pepper plush toys, hats, and socks. Really, no matter where you go or what you are doing in life, there is a Dr Pepper product ready and waiting for you.\n11. It has famous fans\nDr Pepper is undoubtedly a popular brand, so it should come as no surprise that it has some famous fans. Author/vlogger John Green is a noted fan of the beverage, particularly the diet version. His book and podcast \"The Anthropocene Reviewed\" each has a segment on the beverage, in which he rates it 4.5 stars out of 5. In a vlog, Green taste tests Dr Pepper and its \"misbegotten pretenders.\" Green correctly identifies both Dr Pepper and Diet Dr Pepper.\nFootball player DJ Uigalelei was a fan and teamed up with the brand as part of its \"Fansville\" campaign. Dr Pepper also has some big-screen fans. Early in Jessie Eisenberg's career, he was in a 2001 commercial for Dr Pepper. Of course, in this day and age, you need some superhero support, which for Dr Pepper comes from our Friendly Neighborhood Spider-Man, who likes the drink so much they put him on the can.\n12. There is a Dr Pepper museum\nIt is hard not to get sucked into a tourist trap sometimes, and even harder when there is Dr Pepper involved. The company really is brilliant at marketing. For example, when they shut down their original bottling plant in Waco, Texas, they could have just abandoned it. But instead of doing that, in 1989, it became the Dr Pepper Museum, and in 1997 they added the Free Enterprise Institute.\nThe plant was built in 1906 by Milton Scott. While it no longer operates a full production plant, there is plenty to do there. Each ticket comes with a \"free\" Dr Pepper drink from the on-site soda fountain. From there, you can explore the museum, learn about the company's history, and engage in some of the various soda-themed activities, such as making your own beverage, tasting soda, and exploring the \"paranormal\" parts of the museum.\n13. The health benefits are disputed\nWe would all love to believe that the things we enjoy are good for us. Unfortunately, that is not always the case; however, Dr Pepper does have one very vocal advocate in the form of then 104-year-old Elizabeth Sullivan. CNN interviewed Ms. Sullivan as she was drinking a Dr Pepper. She credits the soft drink as the key to her longevity. To the naysayers, Sullivan had this to say: \"Two doctors have told me that if I drink it, I will die. But they died first.\" Sullivan says that despite the warnings, she has been drinking three a day for 50 to 60 years. At 104, she did not take any medication, and there was nothing medically wrong with her. Sullivan lived to be 106.\nThat is a pretty compelling argument. Still, health officials warn that Dr Pepper is not the elixir of life. A real Dr. Pepper — that is, Dr. Ginette Pepper – a professor at the University of Utah's college of nursing, points out that many of the ingredients in Dr Pepper have known health risks. She concedes that some people may see benefits from moderate caffeine consumption, but says Sullivan's longevity with Dr Pepper is likely more of a correlation, not causation.\n14. Virginia is the Dr Pepper capital\nDr Pepper was born in Waco, Texas. For the first few decades of its existence, it did not really make its way out of the south. Even today, the company is based in Texas and has a corporate office in Massachusetts. So, one would think the Dr Pepper capital would be somewhere in Texas. Right? Wrong. The capital is actually Roanoke Valley, Virginia.\nRoanoke Valley is where John W. \"Bill\" Davis set up a Dr Pepper bottling facility. He spearheaded several successful marketing campaigns, including radio programs where he asked people at home how many bottles of Dr Pepper were in their refrigerators and gave them a dollar for each bottle. His marketing even made Hot Dr Pepper happen for a little while.\nAll this led to consumption in the area skyrocketing. Consumption in the area was the highest of any place in 1957, 1959, and 1961, gaining them the title of Dr Pepper Capital of the World. The sign from the bottling plant Davis opened is still visible today.\nStatic Media owns and operates Daily Meal and Mashed.",
  "word_count": 2839,
  "scraped_at": "2026-02-14T12:35:58.905232"
}