{
  "article_id": "118553687b08",
  "url": "https://www.si.com/media/ryan-clark-public-feud-with-robert-griffin-gets-personal",
  "title": "Unseemly Ryan Clark – RG3 Feud Goes Public and Gets Personal",
  "date": "20250520T214500Z",
  "domain": "si.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Unseemly Ryan Clark–RG3 Feud Goes Public and Gets Personal\n1. I love a good public fight among sports media members. Everyone in this business, and I’m including myself here, has a big ego and we all think we’re much more important than we are, so when two people in this world go at it, I usually get a kick out of it.\nI especially get a kick out of it when the fight takes place on social media because it’s so embarrassing.\nI like it when sports media people fight about things like who should get credit for breaking a story or who is in an agent’s pocket. I don’t enjoy it when it gets super personal.\nThe back-and-forth that has taken place over the last couple of days between ESPN’s Ryan Clark and former ESPN employee, Robert Griffin III, crossed the line from entertaining to uncomfortable and cringe.\nIt all started when RG3 made a video saying that Angel Reese hates Caitlin Clark after the two women mixed it up over the weekend.\nClark then responded on his podcast by psychoanalyzing Griffin and coming to the conclusion that Griffin can’t sympathize with Reese because he’s married to a white woman.\n“The one thing we know about RG3 is he’s not having conversations at his home about what Black women have to endure in this country,” said Clark. “About what young Black women and athletes like Angel Reese have to deal with being on the opposite side of Caitlin Clark’s rise and ascension into stardom.\n“If you’re RG3, when is the last time within your household you’ve had a conversation about what [Angel Reese is] dealing with?” Clark continued. “You haven’t been able to do that because in both of your marriages, you’ve been married to white women.”\nClark also referenced RG3’s wife being in the background of the video and cheerleading what Griffin was saying about Caitlin Clark and Reese.\nThe entire thing immediately felt unseemly. One football analyst talking publicly about another football analyst’s wife just felt like a line was crossed.\nNaturally, Griffin made his own video to respond to Clark. And then Clark responded to that video by calling out Griffin’s work on ESPN.\nAs the war of words kept going, I kept thinking, “How do these guys not realize that doing this publicly on social media is a terrible look?” Nobody wins with this unless the end goal is engagement.\nI get where RG3 is coming from in wanting to defend his wife, but at some point you start to wonder what’s real and what’s being done for clicks. This isn’t an argument about who should be the No. 1 pick or whether the Steelers should get involved with Aaron Rodgers. If you’re legitimately irate about someone talking about your marriage, and rightfully so, I don’t understand how the first move is to grab your iPhone, go to the camera app, tap “video” and start responding so you can then send it out to your 2.2 million followers.\nWhy not just text or call Clark? Why does it have to be done publicly?\nBut make no mistake, Clark has crossed the line twice in talking about Griffin’s wife and then revealing that he “saved” (whatever that means) Griffin for an entire season on Monday Night Football.\nUgly. Unnecessary. Embarrassing.\n2. One more note on the Clark-RG3 fight. In his initial video Clark said that A’ja Wilson was the face of the WNBA. I’m not going to sit here and pretend I know anything about the WNBA. I don’t watch it and I don’t follow it.\nAll I know about the WNBA is what Caitlin Clark has done for ratings and attendance. How someone can say that any other player but Clark is the face of the league just seems completely and totally disingenuous to me.\n3. Speaking of...\nThe ratings power of Caitlin Clark continues to astonish. Mets-Yankees on Sunday drew 2.5 million viewers. It's the most-watched Sunday Night Baseball game on ESPN since 2018. Clark and the Fever on Saturday afternoon drew 2.7 million for their game, which was a 93–58 blowout.\n4. Awesome stuff here by Tyrese Haliburton and Pat McAfee. After a Pacers fan (wearing a Pacers jersey) was harassed by unruly and classless Knicks fans when New York beat Boston on Friday night to advance to the Eastern Conference finals, McAfee had the guy on his show Monday.\nMcAfee then surprised the fan by bringing on Haliburton to talk to the fan.\nHaliburton then surprised the fan by offering to bring him to Indiana for one of the ECF games.\n5. It seems as if the New York media hs turned on Juan Soto. This is what happens when you make $750 million.\n6. The latest episode of SI Media With Jimmy Traina features a conversation with ESPN legend Chris Berman.\nBerman talks about signing a contract extension with ESPN that will keep him with the network until 2029—his 50th year at ESPN, working the Super Bowl on Valentine’s Day in 2027 and the “Fastest Three Minutes in Sports.”\nBerman also discusses turning 70, the simplicity of NFL PrimeTime, whether he’s still mad that NBC and the NFL killed PrimeTime, Brent Musburger finally winning the Pete Rozelle Radio-Television Award, the circus currently surrounding Bill Belichick, recent concerts he’s attended and much more.\nFollowing Berman, Sal Licata from WFAN radio and SNY TV in New York joins me for our weekly “Traina Thoughts” segment. This week, we discuss the NBA playoffs, NBC hiring Michael Jordan to be a special contributor, the NFL schedule, Sal’s Mother's Day and Jimmy’s dad having a remote control disaster.\nYou can listen to the SI Media With Jimmy Traina podcast below or on Apple and Spotify.\nYou can also watch SI Media With Jimmy Traina on Sports Illustrated‘s YouTube channel.\n7. RANDOM VIDEO OF THE DAY: Happy 76th birthday to Cher. Perfect day to remember the time she called David Letterman a bad word in 1986.\nBe sure to catch up on past editions of Traina Thoughts and check out the Sports Illustrated Media Podcast hosted by Jimmy Traina on Apple, Spotify or Google. You can also follow Jimmy on X and Instagram.\nJimmy Traina is a staff writer and podcast host for Sports Illustrated. A 20-year veteran in the industry, he’s been covering the sports media landscape for seven years and writes a daily column, Traina Thoughts. Traina has hosted the Sports Illustrated Media Podcast since 2018, a show known for interviews with some of the most important and powerful people in sports media. He also was the creator and writer of SI’s Hot Clicks feature from 2007 to '13.",
  "word_count": 1114,
  "scraped_at": "2026-02-14T12:43:25.576455"
}