{
  "article_id": "11cff63a0116",
  "url": "https://nltimes.nl/2025/09/09/fc-twente-womens-team-receives-world-record-fee-internazionale-nikee-van-dijk",
  "title": "FC Twente women team receives world - record fee from Internazionale for Nikee van Dijk",
  "date": "20250909T193000Z",
  "domain": "nltimes.nl",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FC Twente women’s team receives \"record\" fee from Internazionale for Nikee van Dijk\nThis article was corrected, as FC Twente received a club record.\nFC Twente’s women’s team has received a \"record fee\" for the transfer of their striker Nikee van Dijk to Italian side Internazionale, the club stated. The attacker played for Twente for a year, scoring 19 goals in 38 games. The exact figure has not been reported.\n\"Nikée van Dijk (22) is transferring to Internazionale. The attacker is being sold to the Italian league's second-placed club for an FC Twente Women's record,\" the club wrote in a statement. Internazionale finished second in the Italian league last season, securing their first-ever qualification for the UEFA Women’s Champions League. The club aims to become a dominant force in Italian women’s football.\n“Even in women’s football, the amounts are getting crazier,” said René Roord, technical manager of FC Twente Women. Roord told Tubantia that recent figures show that women’s football is on the rise. The London City Lionesses just this week paid Paris Saint-Germain the equivalent of about 1.65 million euros to acquire midfielder Grace Geyoro.\nThat surpasses the previous record of 1.3 million euros, which the Orlando Pride from the National Women’s Soccer League paid to sign Mexican left winger Lisbeth Ovalle on August 21. Her transfer had broken the record set by Arsenal of about a million pounds just a week earlier. In September, Chelsea also paid a million pounds to Angel City in Los Angeles for forward Alyssa Thompson.\nAlthough those amounts still pale in comparison to transfers in men’s football, Roord added that he sees no point in comparing the two. “For me, that whole discussion doesn’t matter. It’s an illusion to think women’s football will come close.”\nThe technical manager added that women’s football is a different branch of the sport. “There is only one national sport, and that’s men’s football. Women’s football is growing nicely in the meantime, the players earn well, and increasingly so, especially compared to other women’s sports.”\nFC Twente will be hoping to increase their income more by qualifying for the Champions League. They will face GKS Katowice in Poland on Thursday, before playing the second leg in Enschede a week later. “Last year, the qualification for this brought in 400,000 euros; now it’s already 525,000 euros,” said Roord. Just by winning the two preliminary rounds, FC Twente was able to add 160,000 euros.",
  "word_count": 404,
  "scraped_at": "2026-02-14T13:22:17.239618"
}