{
  "article_id": "11ea3d416c95",
  "url": "https://theathletic.com/4263909/2023/03/01/brady-west-ham-women/",
  "title": "Karren Brady appointed as West Ham Women director",
  "date": "20230301T121500Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "West Ham vice-chair Karren Brady has been named as a director of the club’s women’s team.\nAs part of her new role, Baroness Brady will “lead a new senior level of focus and support across all areas of the women’s football and commercial operation, from the first team through to the academy.”\nShe is joined by executive director Tara Warren and director of ticketing Nicola Keye on the West Ham Women’s board.\nAdvertisement\n“I am delighted to be able to confirm this important and exciting new level of senior support for West Ham United Women, as we continue to enhance all areas of the football club and build upon our role as an equity leader in football,” said Baroness Brady.\n“The women’s game is the fastest growing sport in the United Kingdom and at West Ham United we have made tremendous strides forward since being granted FA Women’s Super League status five years ago.\n“Tara and Nicola have a wealth of valuable experience in football and business and together we will work tirelessly to ensure that West Ham United Women continue to go from strength to strength, on and off the field.”\nThe appointment of Baroness Brady, Warren and Keye aims to provide “additional focus, commitment and senior support to the women’s team’s ongoing development and growth.”\nBaroness Brady has been vice-chair of West Ham since January 2010. Warren had previously worked as the club’s executive director of marketing and communications prior to her promotion to the board in August 2022. Keye has been West Ham’s head of ticketing since November 2016 and had previously worked at Aston Villa.\nWest Ham currently sit seventh in the WSL under the stewardship of manager Paul Konchesky. The 2022-23 campaign is the former West Ham defender’s debut season in charge, having previously been assistant to former manager Olli Harder.\nKonchesky’s side took points off Arsenal in the WSL for the first time in the club’s history in February, before being knocked out of the Women’s League Cup semi-finals by Chelsea.\nWest Ham also exited the FA Cup at the quarter-final stage following Sunday’s penalty shootout defeat to Aston Villa.\nThe east London outfit are in their fifth season in the WSL after gaining entry to the top flight during a 2018 restructure of the division.\nGO DEEPER\nThe Journey to the Cup: Hawa Cissoko on racist abuse, respect and family values\n(Photo: Getty Images)",
  "word_count": 401,
  "scraped_at": "2026-02-14T12:21:26.653157"
}