{
  "article_id": "1211d27a452b",
  "url": "https://www.theguardian.com/world/2025/oct/14/first-edition-gaza-israel-ceasefire-peace-deal",
  "title": "Tuesday briefing : After the hostage release , five questions that will shape Gaza future | Palestine",
  "date": "20251014T064500Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Good morning. The last 20 living Israeli hostages in Gaza were freed yesterday, after more than two years in captivity. Meanwhile, huge crowds in Ramallah greeted some of the 2,000 Palestinians – 1,700 of them held without charge – released by Israel in exchange.\nEven against the backdrop of the horrors of the 7 October attack, and the Israeli assault that killed more than 67,000 Palestinians and left Gaza a wasteland, the scenes of reunion were overwhelming to watch. This picture gallery of Israeli hostages being reunited with their families captures something of an extraordinary day of catharsis and relief.\nThe question of what comes next is much more difficult; on a day of such heartfelt celebration it may even seem churlish. But if a durable peace is to be reached, it is also inescapable. Today’s newsletter, with Guardian senior international reporter Peter Beaumont, is about the alarming gaps in the Trump peace plan – and what is likely to fill the vacuum. Here are the headlines.\nFive big stories\n-\nEnvironment | Millions more homes in England, Scotland and Wales face devastating floods, and some towns may have to be abandoned as climate breakdown makes many areas uninsurable, a Guardian investigation has found.\n-\nUK news | Tommy Robinson claimed Elon Musk was paying his legal costs as he went on trial for refusing to comply with a request made by counter-terrorism police as he tried to leave Britain last year.\n-\nEspionage | The government made “every effort” to support the trial of two men accused of spying for China, security minister Dan Jarvis has said, as he accused the Tories of claiming the case was deliberately abandoned “without a shred of evidence”.\n-\nUK politics | The families of the murdered MPs David Amess and Jo Cox have voiced concern about a recent surge in violent political rhetoric in Britain.\n-\nNobel prize | Three experts in the power of technology to drive economic growth have been awarded this year’s Nobel prize in economics.\nIn depth: ‘There is no Palestinian ownership of this process’\nThe last few days were, perhaps, the best possible argument for the virtues of Donald Trump’s plan for Gaza: they saw the release of the hostages and Palestinian prisoners held by Israel, a ceasefire, and the partial withdrawal of Israeli troops. Jared Kushner, Trump’s son-in-law who helped broker the deal, boasted that “deal guys” like him had succeeded because they were prepared to leave the details for later; Qatari prime minister Sheikh Mohammed bin Abdulrahman Al Thani similarly said on Friday that “if we went for full-package negotiations, we wouldn’t have reached these results”.\nToday, the difficulties of that approach will start to come into focus – and, according to Peter Beaumont, the plan repeats a pattern seen in past attempts to engineer a lasting peace. “This was exactly the failure of the Oslo accords,” he said. “The idea was ‘let’s throw this against the wall and see if anything sticks’ – whole important strands were parked and put further down the road. And the far right started to carve up what was supposed to be the Palestinian state with settlements and roads.”\nHere are some of the questions that will have to be answered if the Trump plan is to prove any different.\nWill Israel withdraw its troops?\nSo far, Israel has pulled back from Gaza’s major cities, to a “yellow line” that means it now occupies about 53% of the territory. In theory, withdrawals will follow in two further stages: first, when an international stabilization force is mobilised; second, to a lasting “security buffer zone”.\nBut Benjamin Netanyahu’s language in recent days had a different emphasis. “The IDF remains deep inside Gaza territory and controls all of its dominating points,” he said in a statement last week. “We are encircling Hamas from all directions.”\nAbsent real carrots and sticks for Netanyahu, the recent precedents for further withdrawal are not promising. “They have occupied new territory in Syria indefinitely,” Peter said. “They were still hitting southern Lebanon a couple of days ago despite the ceasefire there. If we test the prospect of withdrawal here against how the country has abided by other agreements, what we see is that it is unlikely to happen.”\nWill Hamas disarm?\nDisarmament is a central tenet of the Trump plan – but on Saturday a senior Hamas official told AFP that disarmament was “out of the question”, adding: “The demand that we hand over our weapons is not up for negotiation”. Even as the hostages were released yesterday, there were images of armed fighters in parts of Gaza, an apparent attempt by Hamas to reassert its authority.\nNone of that is surprising, Peter said. “Hamas has stayed in power for so long because it has a virtual monopoly on the use of violence. And the history of their rule suggests that when they have arms, they will seek to develop their military infrastructure.”\nEven if Hamas agreed in theory, no detail has been provided on how disarmament might happen in practice. One model, cantonment, would see fighters moving to designated disarmament sites where they would surrender their weapons. “But there are obvious questions with that approach too,” Peter said. “They know how they are regarded by the likely players – would they agree to their weapons being placed under Egyptian control? Would they trust an international force? They are self-aware enough to know that once they give their weapons up, they are unlikely to ever see them again.”\nHow will the ‘international stabilisation force’ operate?\nThe text of the White House plan says that the US will “work with Arab and international partners to develop a temporary international stabiliastion force (ISF) to immediately deploy in Gaza.” It says that such a force will be “the long-term internal security solution”. In theory, it should give Israel the assurance that it can remove its forces without allowing Hamas to rebuild.\nWhile Arab and Muslim states appear to be likely to form the majority of any such force, many crucial details are yet to be worked out: whether it would have a mandate from the UN, what price contributing nations would ask, and exactly what it would be mandated to do. “No one expects that the force would fight Hamas,” a western diplomat told the FT. They argued that the mere presence of the force would make it harder for either side to resume the conflict even if it did “absolutely nothing”.\nPeter noted reasons for scepticism about whether the ISF could reliably prevent either side from acting, pointing to a recent grenade attack by an Israeli drone near UN peacekeepers in Lebanon. There might be wider lessons from that deployment, he added. “You would likely have a model similarly mandated to patrol and report on ceasefire violations. But in southern Lebanon, they have been pretty toothless. You would see UN forces on their bases, and then drive to a nearby village controlled by Hezbollah and be asked for your paperwork by a guy on a motorbike.”\nWill reconstruction work get under way?\nThe White House plan promises to “rebuild and energise” Gaza, drawing on “many thoughtful investment proposals and exciting development ideas. That vague promise reflects the imperatives pinpointed by Nesrine Malik in this excellent piece:\nPeace in Gaza represents an opportunity to forget; to erase from the collective consciousness an era in which some western countries took a bludgeon to international norms and institutions, and indeed their own domestic politics, in order to force through the destruction of Gaza.”\nWith vital detail again absent, a rapid “Marshall plan” for Gaza looks unlikely. “Palestinians are incredibly resourceful,” Peter said. “Given any kind of peace, they will quickly be clearing roads and trying to rebuild. But the scale of the damage is of course immense. And my sense is that Israel will constantly ask what guarantees they have that nothing will be diverted to military use, and put onerous conditions on the process.”\nAfter the 2014 war, Peter covered the reconstruction process, which, he reported at the time, moved “at a glacial pace”. “The deal was preposterous,” he said. “There were warehouses where people with the right bit of paper could buy building materials. But even with that kind of monitored process, you had a black market for material – right outside the warehouse, there were places you could go to buy recycled concrete or rebar that had been sold on. So we might see an unworkable system of monitoring, and ordinary people not able to get the stuff they need.”\nWill there be a transition to Palestinian-led governance?\nThe White House plan was devised with no meaningful input from Palestinian civil society on the ground in Gaza. The transitional government will involve Tony Blair but as yet no credible Palestinian figure. Netanyahu appears unwilling to accept the eventual role for the Palestinian Authority floated by the US; in any case, that body and its leader, Mahmoud Abbas, are deeply unpopular in Gaza. “There is no Palestinian ownership of this process,” Peter said. “It isn’t a grand peace deal with a vision of a state at the end of it.”\nIn its insistence that Hamas and anyone affiliated to it be cut out of Gaza’s future, the plan appears to stymie any prospect of a functional state from the beginning – something like the disaster of “debaathification” after the invasion of Iraq. “It fails to recognise that in many cases, doctors and engineers and police officers and nurses and people working in universities will have been Hamas-aligned,” Peter said. “In Iraq, a widespread policy of exclusion led very quickly to anarchy and sectarian violence.”\nGaza is different in many particulars, he added. “But what is missing from all of this is a meaningful reconciliation process that allows all Palestinians to have a chance at civil participation. That is hard to see as a deal that benefits Palestinian society.”\nWhat else we’ve been reading\n-\nThe memoirs of celebrities towards the end of their careers often make fine material for interviews, and Chis Godfrey’s conversation with Tim Curry, who wrote his book after a severe stroke in 2012, proves the point. “I’m astonished actually at how ambitious I’ve been,” he says. “I didn’t think of myself as ambitious at all.” Archie\n-\nThe Labour party was born from a wave of protest, writes George Monbiot, which makes it all the more depressing that Keir Starmer now leads the most illiberal UK government since the second world war. Aamna\n-\nThe French feminist philosopher Manon Garcia attended the Dominique Pelicot trial for weeks, and has now written a book about it. She tells Zoe Williams of her alarming conclusion: for Gisèle Pelicot’s rapists, “there’s something about what it is for them to be a man [that makes them] deeply convinced that they haven’t done anything wrong”. Archie\n-\nI love this Guardian tracker showing which rail operators are now nationalised and whether services are improving under public ownership. Aamna\n-\nMy colleague Emma Loffhagen spoke to leading British-Nigerian cultural figures to trace how the Nigerian community has shaped Black British culture and influenced the wider world. Aamna\nSport\nFootball | Two penalties from Kevin De Bruyne helped Belgium to a 4-2 victory over Wales in Cardiff, dealing a huge blow to the home side’s World Cup qualification hopes. A spirited Northern Ireland side fell to a 1-0 defeat against Germany. Meanwhile, Cape Verde became the second-smallest country by population to qualify for the World Cup after they beat Eswatini 3-0.\nCricket | Ben Stokes and Mark Wood are expected to be “raring to go” for the start of the Ashes next month, offering England a timely boost that sits in contrast to Australia’s ongoing concerns over the fitness of Pat Cummins.\nFootball | After Millie Bright announced her international retirement, Tom Garry reflects on the career of a player “on the list of England greats … a key figure in the generation of England players that transformed how the Lionesses viewed success”.\nThe front pages\nYesterday’s hostage and prisoner release makes a clean sweep of this morning’s front pages. “Truce brings joy as Israelis and Palestinians are freed” – that’s the Guardian, while the Times has “Two years of torment over as hostages reunited with families” and the Mirror calls it a “Day we thought we’d never see”. “Noa’s hero is home” is one reunited couple’s story in the Mail. It’s “Freed from hell” in the Sun. “The long, painful nightmare is over” says the Express and the Telegraph throws it forward with “Trump: let’s end Ukraine’s war”. The splash headline in the i paper is “We did not give up faith, we did not lose hope” and the Financial Times goes with “Trump declares ‘historic dawn’ after final 20 living Israeli hostages freed”. “Home – and now it’s time for peace” is the Metro’s version.\nToday in Focus\nRelease of Israeli hostages and Palestinian detainees: how the day unfolded\nAs Israel and Palestinian families waited for loved ones to be released, Trump met world leaders to continue ceasefire talks. Will Christou, Dan Boffey and Jason Burke report on an extraordinary day in the Middle East\nCartoon of the day | Ben Jennings\nThe Upside\nA bit of good news to remind you that the world’s not all bad\nAt 4,500 metres above sea level, Hanle in Ladakh has some of the clearest night skies on Earth. It became India’s first dark sky reserve in 2022. Twenty-five villagers, mostly women, trained as astronomy guides to boost tourism and protect the nearby observatory from light pollution.\nVisitors pay about £1.70 to stargaze and often stay in the guides’ homes. Since the first telescope was installed in 2000, Hanle has become a world-class astronomy hub.\nThe project now draws thousands of tourists, and homestays have grown from a few to 70, reviving the local economy.\nBored at work?\nAnd finally, the Guardian’s puzzles are here to keep you entertained throughout the day. Until tomorrow.",
  "word_count": 2340,
  "scraped_at": "2026-02-14T13:06:54.177431"
}