{
  "article_id": "1212bd396379",
  "url": "https://www.90min.com/features/3-best-wsl-managers-september-2024-ranked",
  "title": "3 best WSL managers : September 2024",
  "date": "20241011T030000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "3 best WSL managers: September 2024 - ranked\n- The 2024/25 WSL season is up and running\n- Manchester City are currently top of the standings\n- Chelsea and Manchester United won both of their opening two games\nThe 2024/25 Barclays WSL season kicked off last month and it’s been an exciting start to the campaign.\nManchester City are currently top of the standings after three games, although Manchester United and Chelsea have played a game less due to a postponement. Four teams sit with just one point at the bottom of the table, including Everton and West Ham United.\nThere has also been some big results, most notably Chelsea’s 7-0 thrashing of Crystal Palace, while Brighton & Hove Albion and Tottenham Hotspur secured comfortable 4-0 wins over their respective opponents.\nWith October upon us, here's 90min ranking of the top three WSL managers in the season's first calendar month.\n3. Marc Skinner (Manchester United)\nAfter a disappointing fifth place finish last term, it’s been a positive start to the new campaign for Marc Skinner's Manchester United. While greater tests are certainly to come, six points from their first two games is exactly what was needed.\nIn the opening game at Old Trafford, they cruised to a 3-0 victory at Old Trafford, with Grace Clinton and Leah Galton among the goals. Their match against Everton a week later was a much closer contest, but one goal proved to be the difference as they picked up another crucial win.\nSkinner will hope his side can maintain this level of consistency as they gear up for some difficult games against Tottenham, Brighton and Arsenal.\n2. Sonia Bompastor (Chelsea)\nAs far as starts to the season go, things couldn’t have gone much better for new Chelsea boss Sonia Bompastor. Her side edged a narrow 1-0 victory over Aston Villa in their opening game, and they defended resiliently to pick up the result.\nAgainst Crystal Palace on matchday two, the current WSL champions scored seven without response at Selhurst Park. Chelsea have laid down a marker already, but huge challenges are still to come with Arsenal next.\n1. Dario Vidosic (Brighton & Hove Albion)\nThe surprise of the season so far has undoubtedly been Brighton. They cruised to a victory against Everton in their opening game, and were only narrowly beaten by Manchester City at the end of September.\nNew managers in the WSL often undergo an adjustment period, and it takes time to implement new tactics and a style of play. But, the Seagulls haven’t looked like a team undergoing transition in their opening few games.\nThat’s a credit to Dario Vidosic and his ability to settle quickly in the WSL. Strong recruitment in the summer will have helped matters, but results have so far gone their way.",
  "word_count": 465,
  "scraped_at": "2026-02-14T12:23:06.262150"
}