{
  "article_id": "121747294d83",
  "url": "https://news.yahoo.com/that-was-this-year-151300810.html",
  "title": "That Was THIS YEAR ?! ",
  "date": "20231226T154500Z",
  "domain": "news.yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "That Was THIS YEAR?!\nThere's nothing like the end of a year that seems just to have started last week to convince us that time means nothing. Sure, everyone remembers where they were the moment Elon Musk challenged Mark Zuckerberg to a cage match, but...when was that? Late 2022? Early 2023? 1999? No way of knowing. This year of news wasn't just extensive, it was exhausting on a spiritual level. Thank god for the incredible performance of George Santos. Without him, we'd surely be lying facedown on the carpet, catatonic. (Yes, guilty, as we type half the staff is doing that anyway.)\nTo help ourselves out more than anyone else, we rounded up the cultural, political, and undersea transportation-related moments lost nearly entirely in this year of news, that made us question the notion of time itself.\nKevin McCarthy's 15-Round Rodeo for the House Speakership\nRight out of the gate, in the first week of the new year, the rodeo clowns in the Republican majority of the 118th Congress did not disappoint. After 14 consecutive losing votes, Kevin McCarthy finally became the fifty-fifth Speaker of the House of Representatives. If the speakership vote was a best of seven series — and maybe it should be — McCarthy lost the Stanley Cup, the NBA Finals, and the World Series — all in one week! But McCarthy refused to take the L, and forced an after hours vote on a Friday night. With some arm twisting, knee bending, and wrist slapping, McCarthy finally got the keys to the Speaker’s office, only to find out his party would change the locks ten months later. McCarthy was voted out in October and replaced by Speaker Pro Tem and future Jeopardy! question, Patrick McHenry. McHenry got to work immediately and evicted Nancy Pelosi from her hideaway office in the Capitol Building. But that wasn’t enough to keep Republicans from nominating Majority Leader Steve Scalise in a closed door, secret ballot vote. Scalise withdrew when it became apparent that he wouldn’t survive a vote on the floor. Next up was Jim Jordan, who was disqualified after three double-leg takedowns. A bid by Minnesota’s Tom Emmer was torpedoed by the party’s presumptive presidential nominee and defendant’s table seat warmer, Donald Trump. In desperation, with a looming budget crisis, Republicans then consulted a Magic 8 Ball and all signs pointed to yes for Mike Johnson, a four term back bencher who, we’ve since learned, has no bank account and has apparently paid for everything he owns with the loose change in his sock drawer. — Kevin McDonell\nTom Brady's No-For-Real-I-Mean-It-This-Time Retirement\nOn February 1, the QB GOAT announced he was retiring from football. Only this time around he truly meant it, he swore, like for real. The announcement came precisely a year after the first time Brady announced he was retiring from the sport, only to return to the NFL a month and a half later. — John Kenney\nThe War on Gas Stoves\nIn an interview with Bloomberg in January, a commissioner with the federal Consumer Product Safety Commission, Richard Trumpka Jr., declared gas stoves a health hazard and suggested that the agency might consider regulating or even banning them. The head of the agency quickly disavowed any such ban, but Trumpka’s comments nevertheless ignited an immediate culture war and prompted congressional Republicans to seize upon the right to cook with gas as a vital issue of human freedom. God, guns, and gas stoves! – John Kenney\n\"Angela Bassett Did the Thing\" at the BAFTAs\nAriana DeBose closes out 2023 as one of the main voices in Disney’s Wish, a movie we are not so much not believing happened in 2023 as not noticing happened in 2023. But in... we want to say…February? of this year, she was part of a truly timeless awards-show moment. She was onstage at the BAFTAs, doing a perfectly good job belting the opening number, a medley of “Sisters Are Doing It For Themselves” and “We Are Family,” when the music dropped out, the beat got peppier, and we — as a global family — said “Oh shit, she’s about to rap.” And she did. “Category is: Outstanding Debut,” she announced, and while “Charlotte Wells, we love Aftersun” is a rough line to kick off a rap break, the situation got much worse very quickly. In reality, she’s only rapping the names of other women who had debuted outstandingly this year for about 18 seconds, but it feels much longer. To make it worse, they kept cutting to stone-faced audience members. But for the big finish (of the rap break of the big opening number that’s still only halfway finished), Ariana calls out the female nominees in the big acting categories, and by the time she gets to “Angela Bassett did the thing,” her body language tells you she knows she’s in the homestretch. We cannot remember which thing Angela Bassett did, but we know Twitter briefly lit up to near-Adele Dazeem levels. It was cringe. It was camp. Ariana, you are all of us. Let’s all fire our agent. — Dave Holmes\nBanking Armageddon\nOn a Wednesday in early March, Silicon Valley Bank, the nation’s sixteenth largest at the time with more than $200 billion in assets, announced that it was seeking to raise money to bolster its balance sheet. That sparked a panic among its customers — and an old-fashioned run on the bank. (Think: It’s a Wonderful Life but with venture capitalists as the panicked depositors instead of Jimmy Stewart’s neighbors.) By Friday, more than $40 billion from SVB had been withdrawn and federal regulators had shut it down. A couple of days later, Signature Bank, with some $110 billion in assets, also collapsed. Then on May 1, First Republic Bank of San Francisco failed, too, surpassing Silicon Valley Bank to become the second-biggest bank failure in U.S. history. Was the banking system collapsing? Was economic Armageddon in the offing? In a word: Nope. By summer, the panic had passed. — Brian O’Keefe\nGoop on Trial\nDo you recall that this year a retired optometrist sued Goop for allegedly hitting him on skis during a trip to Deer Valley, to which she was like no, actually you hit me, and then she countersued him for $1? She was found guilty of looking resplendent and unbothered in a series of cream-colored ensembles, but not liable for the crash. America took the opportunity to imagine what it must be like to ski with Gwyneth in Deer Valley (resplendent, cream colored, unbothered). -Kelly Stout\nTrump's Hush-Money Indictment\nRemember back in April when Manhattan DA Alvin Bragg indicted Trump for lying about hush money payments to a sex worker. Oh, you don’t? Perhaps because you are just one person with many responsibilities and he's been indicted three more times since, all in the same year. — Abigail Covington\nFrank Ocean Didn't Show Up to Coachella\nLet’s see if we can do this from memory: Frank Ocean planned a big comeback as one of the headliners of this year’s Coachella, and the rumor was that he’d be releasing a new album, maybe even right after the set on that weekend one Sunday. He planned a big, splashy closing-night set, replete with an onstage skating rink and dozens of professional figure skaters, but then at the last minute, he said: let’s not. He scaled his performance way back, the live stream cut out, no new music dropped, dozens of professional figure skaters had to sit on a chartered bus and wait until they got the all-clear to go home, and Coachella’s organizers group-texted their friends like “Hey, would anyone like to buy a skating rink?\" Frank bowed all the way out of weekend two with a leg injury, which, while disappointing, gave Blink-182 an opportunity to swoop in and steal the whole show. — Dave Holmes\nLosers Boycott Bud Light\nIn April, Bud Light partnered with Dylan Mulvaney, a TikTok star who is trans for a cute little video in which she tried to hold a million beers at once and claimed not to know what March Madness is and then told the teams to “break a leg.” Various conservatives, all of whom could probably have used one of those beers she was holding, lost their minds. Under the misapprehension that tasteless beer is manufactured for cis-men and cis-men alone, some conservatives chose to boycott Bud Light’s parent company, Anheuser-Busch. Kid Rock shot a bunch of cans with an AR-15 and released this statement: “Fuck Bud Light and fuck Anheuser-Busch. Have a terrific day.” Our response? More for us. – Kelly Stout\nPrince Harry and Meghan Markle’s Definitely Real, High Speed, \"Near Catastrophic\" Car Chase with the Paparazzi in Manhattan\nIt really happened, guys. – Madison Vain\nThe Implosion of the Titan Submersible\nOn June 18, a very small submarine called the Titan submersible imploded in the North Atlantic, barely two hours into its expedition to see the wreckage of the Titanic. All five people aboard died — but the public didn’t know that yet. We only knew it was lost below the sea, and that the passengers ranged on the economic scale from rich to ultra rich. The U.S. and Canadian coast guards searched for the vessel for four days, with minute-by-minute coverage on the cable networks and across social media. At nearly the same time, a fishing vessel crowded with 750 migrants traveling from Libya to Italy sunk in the Mediterranean. Only 104 people survived. Between both accidents, 651 people were dead, an unthinkable loss of human life. Five of the dead — you'll never guess who: the rich to ultra rich ones — got the vast majority of the media coverage. It was arguably the most perfect, if heartbreaking, example of life in 2023. - Michael Sebastian\nLet's Talk About X, Baby\nTwitter became X with an epic rebrand to an easy to remember “X marks the spot”. As an added treat, you could chase your own significance by buying a coveted blue check mark for just $8 a month. The Twittersphere died, but hey at least we could all finally get verified. — Dorenna Newton\nThe Slap\nOh wait, was that last year? See, this is why we’re doing this. — Kelly Stout\nElon Musk Challenges Mark Zuckerberg to a Cage Fight\nThis guy again. Silicon Valley’s most notorious frenemies boiled over in 2023. In June, when tweets first began surfacing about a forthcoming product from Zuck’s Meta that would rival the Dogecoin founder’s Twitter—excuse me, X—Musk posted that he was “up for a cage match” if Zuckerberg was. Except rather than just meeting its fate as the 1,367,824th stupid tweet from Musk, the Facebook head honcho replied: “Send Me Location.” The news cycle that followed lasted almost two months. Dana White, the president of the Ultimate Fighting Championship, was reportedly spending his evenings speaking with each billionaire working out the details. Locations between Las Vegas and, Musk’s preference, the Roman Colosseum were floated. Unnamed sources either gleefully supported or, in the case of Zuck, as the New York Times reported, warned that this was “not the best use of time.” On August 13, Zuckerberg finally formally declined the match up, accusing Musk of not being serious about what would have surely turned into a slap fest. “Elon won’t confirm a date, then says he needs surgery, and now asks to do a practice round in my backyard instead,” he posted on threads. “If Elon ever gets serious about a real date and official event, he knows how to reach me.” If this is the revenge of the nerds, I’m not impressed. – Madison Vain\nIt Rained at Burning Man\nSince 1990, Burning Man has been held 100 miles north of Reno in the high Black Rock desert during Labor Day weekend where the weather typically features hot days, cool nights, and almost no rain. I said typically. This year a storm hit late Friday and dumped (this is not a typo) three months worth of precipitation onto the event in a single evening. The desert surface, normally hard and dusty, was transformed into a sticky slurry that trapped RVs, bikes, and glowing art cars. Many of the port-a-potties – normally sweltering fecal saunas — became unusable after being filled with sludge. At one point law enforcement officers abandoned the event. Escape for 70,000 people seemed impossible. But burners, for the most part, quickly adjusted to their new normal, devising footwear out of plastic bags and socks for trudging through the ooze and continuing to party. By Sunday morning, though, rumors of an Ebola outbreak and some incidents of cannibalism combined with improving conditions had a good chunk of attendees attempting an exodus. Some walked the fifteen miles to Gerlach, the nearest town while others embarked on Mad Max style escapes in their cars, trucks, and RVs. Diplo and Chris Rock hitched a ride in a pickup but eventually everyone made it home. Recently the Bureau of Land Management, the federal agency that approves use of the Black Rock desert, announced that the site had been cleaned properly and returned to almost pristine condition. That means Burning Man will certainly happen again next year, come hell, mud, or high water. And don't worry, the cannibalism thing was just a rumor...I think. – Danny Dumas\nTupac’s Alleged Killer Was Arrested\nThe greatest cold case in hip hop history was allegedly solved 27 years later when 60-year-old Duane “Keefe D” Davis was quietly apprehended while enjoying a tranquil Friday night walk on the outskirts of Vegas and you forgot all about it. He pleaded not guilty. — Dorenna Newton\nJimmy Buffett Died\nYour feeds were full of reminiscences and appreciations from lifelong fans...who still spelled it “Jimmy Buffet.” – Dave Holmes\nRupert Murdoch Left Fox News\nIn the same year we lost Succession’s Logan Roy, we bid farewell to his real-life doppelgänger Rupert Murdoch. Not in the mortal sense — the 92-year-old is still kickin'. But in November he did step down as chairman of his global media empire, which included the New York Post, Wall Street Journal, and Fox News. Few humans are more responsible for our current...uh...predicament, to put it one way, than Murdoch. His Fox News helped foment and promote the birther movement (remember that?), Donald Trump, and the normalizing of January 6. But don’t break out the champagne; his retirement won’t stop the poisoning. His son, Lachlan Murdoch, is chairman of the conglomerates and even if the Murdochs stepped away entirely, Rupert’s properties — particularly Fox News — have so thoroughly poisoned the world that his legacy will be harder to kill than Kendall Roy. -Michael Sebastian\nSenator Bob Menendez Stuffed Gold Bars In His Mattress\nGeorge Santos was the gift that kept on giving this year — perhaps to no one more than Bob Menendez. You remember him. In October he was accused of accepting bribes from a the government of Egypt and conspiring to act as a foreign agent on their behalf, charges he denied. But the fun didn't stop (or even really start) there: when the FBI searched poor Bob's home, they found a bunch of allegedly stolen gold bars stamped with serial numbers from a Swiss Bank. All of those are normal words. Nothing to see here. What's that over there? Look! A congressman who got Botox with campaign funds then went on Ziwe! — Kelly Stout\nCommander Biden Followed In Major's Pawsteps\nIn October, the Bidens’ family dog, a German shepherd named Commander, was evicted from the premises of the White House after it was revealed that he’d bitten at least a dozen members of the White House staff and the president’s Secret Service detail over a course of months. The removal prompted Republican representative Virginia Foxx, the chair of the House Committee on Education and the Workforce, to demand the White House produce any and all workplace safety complaints filed during the last two years, adding that it appeared “occupational hazards are prevalent in the White House.” — John Kenney\nMichael Stipe officiated the wedding of Frances Bean Cobain and Riley Hawk, son of Tony Hawk.\nYou know how “the quick brown fox jumps over the lazy dog” is a sentence that contains all 26 letters of the alphabet? “Michael Stipe officiated the wedding of Frances Bean Cobain and Riley Hawk, son of [former Esquire intern] Tony Hawk” is a sentence that contains everything at the highest stratum of cool to a person from Generation X. It’s almost too much to take in, isn’t it? It feels so big, your brain can easily get caught up on the smaller details, like “of course Tony Hawk named his son Riley — I bet there’s a Spencer in that family too” (There is! And a Keegan!) or “Is Frances old enough to get married?” (She is! This is in fact her second marriage!) But take it all in. Say it out loud: Michael Stipe officiated the wedding of Frances Bean Cobain and Riley Hawk, son of Tony Hawk and you will feel hopeful again, like you did in the '90s. Just don’t get on a skateboard; a broken hip is no joke at our age. – Dave Holmes\nBedbugs, Mon Dieu!\nThe city of Paris was hit with a sudden and pervasive bedbug infestation, and just in time for Fashion Week, prompting this remarkable perspective-free headline in Condé Nast Traveler: “The Bedbugs in Paris: Here’s What We Know So Far.” — John Kenney\nMarkwayne Mullin v. Sean O'Brien\nThe head of the Teamsters union, Sean O’Brien, nearly got into a fistfight with Oklahoma senator Markwayne Mullin in the middle of a Senate hearing. ‘Nuff said. — John Kenney\nYou Might Also Like",
  "word_count": 2957,
  "scraped_at": "2026-02-14T12:31:22.845837"
}