{
  "article_id": "122269dee369",
  "url": "https://www.austinmonitor.com/stories/2024/12/after-a-busy-2024-fuentes-looks-to-take-on-more-leadership-roles/",
  "title": "After a busy 2024 , Fuentes looks to take on more leadership roles - Austin Monitor",
  "date": "20241223T064500Z",
  "domain": "austinmonitor.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "With her first term and a smooth reelection behind her, Vanessa Fuentes returns to the dais in January with a fresh to-do list and aspirations of becoming the next mayor pro tem – a symbolic yet highly sought-after position.\nTaking stock of her work in 2024, the District 2 City Council member reflected on a wide range of more than 30 policy items she and her team crafted.\n“It really was all about delivering progress with a purpose,” she said of the assortment of resolutions and budget amendments ranging from recreational health to reproductive health care. “I think that speaks to the diversity of the community that I represent, and also speaks to the diversity of needs that we have over all of our city.”\nWorking families have been a centerpiece of Fuentes’ work, no matter what policy area she is pursuing. That focus will continue in her second term, she said.\nFuentes kicked off the year with a “Soccer City” initiative that expanded soccer opportunities in Austin through better access and programming and led to the creation of an interactive map of soccer fields on the city’s website.\nContinuing her work on a number of reproductive justice measures, Fuentes brought forward an item that reestablished the city’s abortion travel fund.\n“We’ve had Texas women die as a result of the abortion ban that we have in our state, so it was important that we took action at the local level to assure Austinites that we have their backs,” she said.\nFuentes also sought to allay the concerns of the immigrant community with an item condemning state Senate Bill 4, which authorizes police to arrest and detain suspected undocumented individuals for possible deportation.\nThe Fuentes measure reaffirms Austin’s place as a “sanctuary city” and makes enforcement of the state law a low priority for local officers.\n“At least here at the local level, our police officers will not be utilized to help facilitate those deportations,” she said.\nEarlier this year, Fuentes, with Council Member José Velásquez, hosted a “Know Your Rights” workshop for community members, and she is preparing for more anti-immigrant legislation at the state and national level in the new year.\n“President Trump has made very clear his intentions with the executive orders he’s going to be signing on day one,” she said, adding that she participated in a recent call with local policymakers across the state to discuss strategies for preparing communities for anti-immigrant actions. “It’s important that our community knows their rights and knows what resources are available.”\nFuentes is also proud of her collaboration with Travis County to establish a “counsel at first appearance” initiative, which now guarantees that people who are arrested in the county have legal representation at magistration.\nWith the cost of all forms of insurance rising each year, Fuentes, whose Southeast Austin district has a history of tragic flooding events, passed a budget amendment to pilot a flood insurance program. City staff from Austin’s Watershed Protection Department and Housing Department are heading up the program to determine solutions for residents to obtain affordable flood insurance while ensuring residents are prepared for the next big rain event.\nFor the new year, Fuentes already has her work cut out for her: She was recently appointed to the board of the National League of Cities and will chair its Transportation and Infrastructure Services Committee.\nAt the Council level, she hopes to continue chairing the Public Health Committee, which has been focusing much of its work on homelessness. That policy issue will continue to be top of mind in 2025, she said. She also hopes to keep her remaining Council committee assignments serving on Audit and Finance and Mobility – as well as on CAMPO’s Transit Policy Board.\nShe intends to stay focused on bringing about success for Project Connect and is excited about a new Capital Metro bus rapid transit service next year that will run along Pleasant Valley Road from Mueller to Goodnight Ranch in District 2.\nIn 2025, the Council member looks forward to more stability in the city’s administrative leadership, now that a new city manager and a new police chief have settled into their jobs.\nThree new Council members will be sworn in in January, which will mark the 10th anniversary since the first 10-1 council was sworn into office in 2015.\nFuentes feels fortunate to have served with several members of that first Council, including Mayor Steve Adler.\n“In the second half of my first term, I got to usher in Mayor (Kirk) Watson, and now we’re embarking on a new chapter in our local politics,” she said. “I’m excited to be part of it and to have an opportunity to continue serving my community for another four years.”\nThe Austin Monitor’s work is made possible by donations from the community. Though our reporting covers donors from time to time, we are careful to keep business and editorial efforts separate while maintaining transparency. A complete list of donors is available here, and our code of ethics is explained here.",
  "word_count": 840,
  "scraped_at": "2026-02-14T12:18:16.727579"
}