{
  "article_id": "123c89b21b1b",
  "url": "https://www.rockmnation.com/2025/5/7/24425014/mizzous-2025-hall-of-fame-class-is-a-great-one-and-other-tiger-news",
  "title": "Mizzou 2025 Hall of Fame Class is a Great One , And Other Tiger News",
  "date": "20250507T123000Z",
  "domain": "rockmnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Mizzou’s 2025 Hall of Fame Class is a Great One, And Other Tiger News\nThe Morning Commute for Wednesday, May 7th\nToday we’re talking about the Mizzou Athletics Hall of Fame.\nIf you didn’t catch the news, recently the Department of Athletics announced its latest class for its hall of fame.\nI fully acknowledge my extreme bias here, due to the fact that I worked in the department during the careers of every one of the inductees - but that being said, this class is a really strong one that merits celebration from all Tiger fans.\nIf you don’t want to read the release, the inductees include Mike Alden (Director of Athletics, 1998-2015), Bob Brendel (Administration, 1980-2000), Sophie Cunningham (Women’s Basketball, 2015-19), Alyssa Munlyn (Volleyball, 2015-18), Brock Olivo (Football, 1994-97) and Kareem Rush (Men’s Basketball, 1999-2002).\nForgive me as this turns into a bit of a personal journal, but I felt compelled to share some perspective on these individuals. Call it my personal brush with greatness?\nI’ll start with Bob Brendel. I owe this man so much that I really can’t begin how to explain it. Bob was the Sports Information Director (also now known as PR/communications) and is the foremost historian figure about Tiger Athletics. He hired me - a scraggly, unproven nobody just out of Mizzou’s J-school - to be a graduate assistant for his office in October of 1992. He hired me sight unseen, and frankly I think he was a little desperate to get a body in the door as he had a couple of unexpected staff departures after the school year started. Anyway, it was my good fortune with the timing, and Bob taught me just about everything it took to do the job. He forgot more than I ever knew about the business, but I think the greatest thing I learned is just how to treat people and build relationships. He also taught us how to have fun and enjoy the job and when you’re an overworked, underpaid staffer, that’s a big deal. I’m filled with pride to call Bob my mentor and friend and to see him receive this well-deserved honor. If you ever meet Bob and have some time, you need to get him started on telling stories about famous figures in Mizzou Athletics history. If anybody needed to write a book, it’s this guy!\nMike Alden is also someone I owe a ton to. I had been in the department for a few years already when he arrived as our AD in 1998. He went about the challenging job of changing the culture in the department and making us more of a modern-day organization and away from the old-school good ol’ boy days. He helped the athletic department become much more sound fiscally and to join the 21st century in the facilities arms race. The impact he made on Mizzou and college athletics in general is massive - all you have to do is take a look at all of his former employees who are ADs at universities all over the country (including Laird Veatch). Moreover for me, he gave me the chance to take over the Sports Info office in 2000, and that’s what I did until the pandemic blew things up in 2020. I will always be grateful for how Mike stuck to his guns and supported Gary Pinkel after the first few seasons when a lot of people wanted to move on to the next guy. Mizzou is not in the SEC today without the efforts of Mike, don’t forget that.\nI handled men’s hoops for the career of Kareem Rush, so I also take great pride in knowing that one of my guys will forever be enshrined in the hall of fame. Kareem was a great kid to work with, he had so much talent but he was one of those guys who didn’t act like it - in a good way. Such a silky-smooth lefty, and I’ll always remember his recruitment under Quin Snyder and how crazy that was for a time, but when he decided to be a Tiger, we all knew that was a watershed moment for Quin’s program. The Elite Eight run in 2002 will forever be such a fun time to look back on, and Kareem was front and center in that one before he took his talents to the league. He was fun to be around and always helped me out with doing interviews even when he didn’t feel like it. I’m glad he’ll be part of this hall of fame.\nI was never in charge of publicity for women’s hoops, but because of Sophie Cunningham, everybody in our office got involved at times, because she made it such a big deal. She was so fun to watch and was the type of player you kept your eyes on with-or-without the ball in her hands. Has there been a more clutch basketball player in Mizzou history - women OR men - than Sophie? I’m open to a debate certainly, but my first answer would be ‘no.’ She also just fit so well with the tough, blue-collar Midwest mindset - she took no sh%& off of anybody no matter how big they might be. A dynamic player and person who could probably run for Mayor in Columbia tomorrow and win. Humble brag alert, but when I had the distinct honor of being inducted into the Missouri Sports Hall of Fame in 2022, one of the highlights of my day was getting a bear hug from Sophie after the ceremony - that meant a ton to me. Maybe I can return the favor if I see her at the upcoming Mizzou event.\nI didn’t do a ton of work on a daily basis with either Brock Olivo or Alyssa Munlyn, but I was around them enough to develop a deep admiration and appreciation for the greatness they brought to Ol’ Mizzou. I got to see the work ethic that Brock displayed behind the scenes for Larry Smith’s football program, and the legends you hear about his exploits are all true. Similarly for Alyssa, she helped raise the profile of Team Kreklow’s program and brought a lot of well-deserved attention to the team. She’s no doubt one of the top volleyball players in program history.\nYou can check out more about the Mizzou Athletics Hall of Fame here. Do you have a favorite former player, coach or administrator who you feel deserves consideration for the hall? The general public is invited to submit nominations, and you can find a link here.\nYesterday at Rock M and Rock M+\nCorey Batoon loses two of his top four tacklers but four portal imports rank in the top eight of returning tacklers, including the top two spots on the roster. If experience truly is the best predictor of defensive success - which, as I wrote above, seems to be the case - then this staff did an excellent job of finding experienced pieces who were willing to join the brother of the wilderness (or whatever they’re calling it now) and provide a bump in the experience category...\nThanks to some transfer portal wins, it seems like the Tiger defense has a legit chance to plug and play in 2025!...\nAfter landing West Virginia transfer guard Jayden Stone on Sunday night, the Mizzou Basketball program officially announced the signing of UCLA transfer Sebastian Mack on Monday...\nDennis Gates and company have had a nice influx of transfer talent the past few weeks...\nMizzou Baseball blew a late lead against kU Tuesday, falling 6-5. The Tigers have now lost 12 straight games, extending a program record losing streak, and were swept in this season’s Border War...\nUgh. The Tigers gave up three runs in the top of the first to the alleged school to the west, but fought back to take a 5-3 lead. But ku scored three straight, including two in the eighth to take the lead. Mizzou had a runner in scoring position in the bottom of the ninth, but stranded him there...\n- Over at Rock M+: Get the latest info on Mizzou football, basketball and Olympic Sports, including a next-level analysis by Karen Steger at the recent statistical improvement by the Mizzou Gymnastics team!\nRock M Radio: Football Musings by the Before the Box Score Crew\nSubscribe to Rock M Radio on Apple Podcasts. Or stream episodes through Megaphone or Spotify. Have a question for us? Leave a 5-star review with your question and that show just might answer it in an upcoming episode!\nIf you like Rock M Radio drop us a Review and be sure to subscribe on your preferred podcasting platform. Follow @RockMRadio on Twitter and if you heaven’t already head over to our YouTube channel and click that subscribe button!\n(** RockMNation has affiliate partnerships. These do not influence editorial content, though RockMNation may earn commissions for products purchased via affiliate links.**)",
  "word_count": 1491,
  "scraped_at": "2026-02-14T13:20:58.251494"
}