{
  "article_id": "123e30d930f3",
  "url": "https://www.yahoo.com/news/opinion-revealing-rise-fall-daniel-170254385.html",
  "title": "Opinion | The revealing rise and fall of Daniel Jones",
  "date": "20241124T173000Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Opinion | The revealing rise and fall of Daniel Jones\nWhat a difference a couple of years can make in the life of an NFL quarterback. Two years ago, New York Giants QB Daniel Jones was the toast of the Big Apple. Alongside running back Saquon Barkley, Jones and his teammates surprised the football world by making it to the postseason and winning an upset victory on the road in Minnesota against a Vikings team that won 13 games.\nAbout to become a free agent, Jones had hit the jackpot. He threw for a career-high 3,200 yards and accounted for a total of 22 rushing and passing touchdowns. He threw only five interceptions. Giants fans and team management were in love with “Danny Dimes.” That offseason, the Giants rewarded Jones with a four-year contract worth $160 million.\nWhat has followed can only be described as a nightmare for both Jones and the G-Men.\nNFL quarterbacks get paid more than pretty much any other position in professional team sports. And if they’re successful, the prestige that comes with those fat paychecks is immense. But it’s also a position where loyalties shift quickly, with seasons and tens of millions on the line. Jones is just the latest example.\nJones asked for and was granted his release by the Giants on Friday after being demoted to the fourth-string QB spot on the roster. The decision to move on from Jones followed an injury-plagued 2023 season and a statistically dismal 2024 campaign that has left the Giants sitting at 2-8 coming into their game Sunday against the Tampa Bay Buccaneers. (Jones’ inability to carry his team past the lowly Carolina Panthers in Munich on Nov. 7 was a particularly noteworthy low.)\nSince signing his lucrative deal, Jones had a win-loss record of just 3-13, with 10 touchdowns and 13 interceptions. He missed most of last year after a neck injury and returned in 2024 to a team sorely missing its top offensive weapon, Barkley, whom the Giants allowed to walk away in free agency to the rival Philadelphia Eagles. Adding insult to injury, Barkley is having arguably his best season for an Eagles team sitting atop the NFC East division.\nDespite still having seven games left to play, the postmortem on the 2024 Giants has already begun. Who is to blame? Is it Jones? Is it head coach Brian Daboll? General Manager Joe Schoen? Honestly, the full answer might just be all of the above.\nThe Giants clearly bought into the hype surrounding their Cinderella-adjacent 2022 postseason. The unexpected playoff berth and a good, but not great, season from Jones, created the impression of momentum that quickly dissipated. So starved for success after the retirement of Eli Manning, the Giants thought the combination of Jones, Barkley and the coaching of Daboll could lead to glory. Management pushed their chips to the center of the table thinking they had a winning hand, only to realize they had completely misread their cards.\nA couple of years ago, the Denver Broncos went all-in on the Seahawks’ Super Bowl-winning signal-caller Russell Wilson. Two years and two head coaches later, Wilson was released (despite still being owed big money from Denver) and signed by Pittsburgh, where he’s enjoying success with the Steelers. But even early in 2024, there were reports that the Steelers were considering sending Wilson elsewhere in favor of former Bears quarterback Justin Fields.\nThe Jets, the long-suffering “other New York football team,” traded for former Super Bowl-winning quarterback Aaron Rodgers in 2023 to help end a Super Bowl drought of over 50 years. But just past the midpoint of Year 2 of Rodgers’ contract, the Jets’ season is in shambles, with reports surfacing this week of team owner Woody Johnson wanting to bench his aging 40-year-old star after the team’s loss to the Denver Broncos at the end of September.\nAnd then there’s the Cleveland Browns’ historically bad deal with Deshaun Watson, worth $230 million over five years. The often-injured Watson has a losing record and mediocre stat sheet. He was also signed after dozens of women sued him alleging sexual misconduct and harassment during his stint with the Houston Texans. (Watson was suspended 11 games and hit with a $5 million fine in 2022 for violating the league’s personal conduct policy, but a Texas grand jury failed to indict him on any criminal charges.)\nCan Daniel Jones replicate the success of Russell Wilson and find new life in another uniform? With the right pieces around him, maybe. I hear the Cowboys need a quarterback now that the also highly paid and underperforming Dak Prescott will be sitting out the rest of the year with a hamstring injury. Barkley has had success with another NFC East team. Maybe Danny Dimes can be redeemed in Dallas. Or not. That’s the problem with NFL quarterbacks. They fly closest to the sun, but some inevitably fall back down to Earth. Hard.\nThis article was originally published on MSNBC.com",
  "word_count": 829,
  "scraped_at": "2026-02-14T13:31:24.717396"
}