{
  "article_id": "126fe9e38efa",
  "url": "https://www.prokerala.com/news/articles/a1393517.html",
  "title": "Laureus Awards : Messi , Nadal , Verstappen among nominees for Male Sportsperson of the Year award",
  "date": "20230220T150000Z",
  "domain": "prokerala.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "London, Feb 20 : Lionel Messi, who led Argentina to a dream FIFA World Cup title, along with Kylian Mbappe, tennis legend Rafael Nadal, Max Verstappen, NBA champion Steph Curry and pole vault world-record holder Mondo Duplantis were among the nominees announced for the Laureus World Sportsman of the Year award.\nThe nominees for the Laureus World Sportsman of the Year Award spent 2022 climbing to the very pinnacle of their sport.\nMessi collected the one prize that had eluded him by leading Argentina to the World Cup while Kylian Mbappe, whose hat-trick in the final earned him the Golden Boot as the World Cup's leading goalscorer got shortlisted along with Nadal, who ended 2022 alone at the top of the all-time list of men's Grand Slam champions with 22 titles after victory in Australia and France.\nMax Verstappen joined Messi and Nadal as past winners of this Award on the 2023 shortlist after defending his Formula One world title. Duplantis broke the pole vault world record on three occasions and won world titles indoors and out. Steph Curry led the Golden State Warriors to a fourth NBA championship in eight years.\nFormula One world champion and current Laureus World Sportsman of the Year, Max Verstappen said: \"It's an honour to be nominated for the Laureus World Sportsman of the Year Award. Winning last year was an incredible moment for me: it is such a prestigious accolade, and it means even more when you're up against the world's best athletes. To be shortlisted again is an achievement in itself, so thank you to my team Oracle Red Bull Racing for the support throughout our Championship winning year, and thank you to the world's media for nominating me.\" The nominations for the 2023 Laureus World Sports Awards for the year 2022 were announced on Monday.\nThe world's pre-eminent sporting Awards ceremony will celebrate not only athletes who thrilled sports fans over the previous 12 months but several who will end their careers with a claim to be the greatest in the history of their sport.\nSix Nominees have been selected across seven nominated Laureus categories, with six inspirational programmes also shortlisted for the Laureus Sport for Good Award.\nMore than 1,400 members of the Laureus Global Media Nominations Panel decided on all but one category - the shortlist for the Laureus World Sportsperson with a Disability Award was chosen by a specialist panel from the International Paralympic Committee.\nThe Award winners in these categories -- along with recipients of the Awards presented at the discretion of the Laureus World Sports Academy -- will be announced at the Laureus World Sports Awards in the Spring.\nThe race for the Laureus World Sportswoman of the Year Award is led by two athletes who lit up the World Championships in Eugene, Oregon: Shelly-Ann Fraser-Pryce became a five-time champion over 100m, while Sydney McLaughlin-Levrone added the world title to her Olympic crown with a world record in the 400m hurdles.\nAt the World Aquatics Championships in Budapest, Katie Ledecky won four golds, taking her total to 22, a record for a female swimmer. Alexia Putellas, led FC Barcelona to a perfect season in the Spanish league and claimed a second Ballon d'Or. Mikaela Shiffrin regained her overall title at the Alpine Ski World Cup, while Iga Swiatek emerged from 2022 as the undisputed No.1 in women's tennis, winning in Paris and New York.\nTwo meteoric tennis talents have been nominated for the Laureus World Breakthrough of the Year Award. Carlos Alcaraz gave a preview of the next era in the men's game, winning the US Open to end the year as the sport's youngest-ever No.1-ranked player. In the women's game, Elena Rybakina won her first Grand Slam title at Wimbledon.\nScottie Scheffler won The Masters and tied for second at the US Open on his way to becoming golf's No.1. Also nominated are the Morocco Men's Football Team who captivated the world on their adventure to the semi-finals of the World Cup, Nathan Chen, the figure skater who added Olympic gold to a world title; and Tobi Amusan, who broke the 100m hurdles world record on the way to claiming Nigeria's first-ever gold medal at the World Athletics Championships.\nThe full list of Nominees is:\nLAUREUS WORLD SPORTSMAN OF THE YEAR AWARD\nSteph Curry (USA) Basketball\nMondo Duplantis (Sweden) Athletics\nKylian Mbappé (France) Football\nLionel Messi (Argentina) Football\nRafael Nadal (Spain) Tennis\nMax Verstappen (Netherlands) Motor Racing - defended Formula One World Championship in 2022\nLAUREUS WORLD SPORTSWOMAN OF THE YEAR AWARD\nShelly-Ann Fraser-Pryce (Jamaica) Athletics\nKatie Ledecky (USA) Swimming\nSydney McLaughlin-Levrone (USA) Athletics\nAlexia Putellas (Spain) Football\nMikaela Shiffrin (USA) Alpine Skiing\nIga Swiatek (Poland) Tennis\nLAUREUS WORLD TEAM OF THE YEAR AWARD\nArgentina Men's Football Team\nEngland Women's Football Team\nFrance Men's Rugby Team\nGolden State Warriors (USA) Basketball\nReal Madrid (Spain) Football\nOracle Red Bull Racing (Austria)\nLAUREUS WORLD BREAKTHROUGH OF THE YEAR AWARD\nCarlos Alcaraz (Spain) Tennis\nTobi Amusan (Nigeria) Athletics\nNathan Chen (USA) Figure Skating\nMorocco Men's Football Team\nElena Rybakina (Kazakhstan) Tennis\nScottie Scheffler (USA) Golf\nLAUREUS WORLD COMEBACK OF THE YEAR AWARD\nFrancesco Bagnaia (Italy) Motor Cycling\nChristian Eriksen (Denmark) Football\nJakob Ingebrigtsen (Norway) Athletics\nKlay Thompson (USA) Basketball\nAnnemiek van Vleuten (Netherlands) Cycling\nTiger Woods (USA) Golf\nLAUREUS SPORTSPERSON OF THE YEAR WITH A DISABILITY AWARD\nDiede de Groot (Netherlands) Wheelchair Tennis\nCatherine Debrunner (Switzerland) Para Athletics\nDeclan Farmer (USA) Para Ice Hockey\nCameron Leslie (New Zealand) Para Swimming and Wheelchair Rugby\nOksana Masters (USA) Para Cross-Country Skiing and Para-Cycling\nJesper Saltvik Pedersen (Norway) Para Alpine Skiing\nLAUREUS WORLD ACTION SPORTSPERSON OF THE YEAR AWARD\nJustine Dupont (France) Big Wave Surfing\nStephanie Gilmore (Australia) Surfing\nEileen Gu (China) Freestyle Skiing\nChloe Kim (USA) Snowboarding\nRayssa Leal (Brazil) Skateboarding\nFilipe Toledo (Brazil) Surfing",
  "word_count": 965,
  "scraped_at": "2026-02-14T12:52:11.896740"
}