{
  "article_id": "127032872329",
  "url": "https://www.nunesmagician.com/2023/3/15/23640518/celebrating-3-15-in-the-315-syracuse-orange-athletics",
  "title": "Syracuse Orange : Celebrating 3 - 15 Day in the 315 - Troy Nunes Is An Absolute Magician",
  "date": "20230315T210000Z",
  "domain": "nunesmagician.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Happy 3-15 Syracuse Orange fans! Whether you’re Salt City born and raised or someone making a pit stop here like me, 315 Day is the chance to celebrate Syracuse for what makes it special. Of course, part of that is the Athletics here on the hill, which is why I’m here to talk about some of the student-athletes that represent the city - literally.\nSyracuse Orange: Celebrating 3-15 in the 315\nWe look at the famed number combo’s current iterations.\nDuring his jersey retirement speech, Gerry McNamara spoke about now seeing “315” in a framed picture of him and Carmelo Anthony instead of just their uniform numbers, adding that he hopes #5 Josh Price will join him (#3) and Hakim Warrick (#1) in the Dome rafters.\nThat got me thinking about some of the other 3-15 pairings in Syracuse Athletics, and since there’s no time like the present, here are all the current combos playing an SU sport:\nCurrent 3-15 combos\nFootball: Mikel Jones, Derek McDonald\nThis linebacker duo is probably the most recognizable pair on the list. Jones was the defensive captain last season, guiding the 3-3-5 to strong performances against many of the tough opponents on SU’s calendar. McDonald meanwhile was thrust into action after injuries to Stefon Thompson and others, performing admirably and building his resume for 2023 and beyond. They combined for 123 tackles, five sacks, one interception, two forced fumbles, and a fumble recovery. While ‘Kel is off to the NFL Draft, Derek will be back in the two-deep this fall.\nMen’s Lacrosse: Carter Kempney, Caelin Lewis\nA pair of reserve players for Gary Gait. Kempney is a true freshman who has appeared in four games, scoring his first career goal on his first ever shot against UAlbany. Lewis, a redshirt sophomore, has appeared in two games but did not record any statistics.\nMen’s Soccer: Abdi Salim, Louie Bulger\nSalim returned for his senior season after missing all of 2021, helping guide a lockdown defense all the way to the program’s first NCAA Championship. He was rewarded by being selected #17 by Orlando City SC in the MLS SuperDraft. Bulger meanwhile was a reserve defender, appearing in three games and earning a ring all the same.\nWomen’s Basketball: Nyah Wilson, Asia Strong\nWilson worked as a bench piece for Felisha Legette-Jack’s squad, averaging 1.6 points and 0.9 rebounds during her limited minutes. Strong meanwhile has been the team’s second-best rebounder behind Dariauna Lewis, starting 21 games and averaging around 24 minutes.\nField Hockey: Vivian Rowan, Marie Sommer\nRowan, a sophomore, appeared in 18 games for Coach Agne Bradley’s team. Sommer dealt with injuries the majority of the season, reappearing against Boston College in the ACC Tournament.\nWomen’s Lacrosse: Ryann Banks, Natalie Smith\nBanks is a true freshman who hasn’t appeared a game yet for Kayla Treanor’s group. Smith on the other hand has appeared in all seven Orange games so far, scoring five goals, assisting on two more, and collecting seven ground balls.\nSoftball: Rebecca Clyde, Kaia Oliver\nA pair of SU seniors. Clyde spends most of her time over at the hot corner, while Oliver has transitioned into the primary Orange relief option.\nBonus: Current 3-1-5 Combos\nMen’s Basketball: Judah Mintz, Maliq Brown, Justin Taylor\nA.K.A. three players we dearly hope are all back for Adrian Autry’s inaugural season. The roles and numbers aren’t an exact match, but this trio has the potential to be reminiscent of G-Mac’s group, with a pure scorer and leader, a good defender/rebounder with a flair for the dramatic, and a distance shooter waiting for a big stage to shine on.\nMen’s Lacrosse: Carter Kempney, Harrison Thompson, Finn Kelly\nThompson unceremoniously lost the starting goalie job to transfer Will Mark, but he’s still here on standby should something happen. Kelly has not yet appeared on the stat sheet as he enters his sophomore season.\nMen’s Soccer: Abdi Salim, Russell Shealy, Amferny Sinclair\nSalim wasn’t the only Orange player to get drafted after their title run. Shealy’s impressive run as the team’s starting goalie, and Sinclair finished off his Syracuse career as the captain who scored the game winner in penalties against Indiana. Both were taken in the 2nd round, by the LA Galaxy and Real Salt Lake, respectively.\nWomen’s Basketball: Nyah Wilson, Kennedi Perkins, Georgia Woolley\nThe WBB 3-1-5 is a trio of guards. Like Wilson, Perkins saw some action off the bench, averaging 9.1 minutes, 3.1 points, and 1.1 assists as a true freshman. Wooley followed FLJ from Buffalo and had a sophomore season to remember, averaging nearly 30 minutes a game to go along with 12.0 points and 4.0 rebounds.",
  "word_count": 773,
  "scraped_at": "2026-02-14T13:07:45.705456"
}