{
  "article_id": "127aa4fc04d3",
  "url": "https://www.cardchronicle.com/2023/8/18/23834899/friday-afternoon-cardinal-news-and-notes-louisville-cardinals",
  "title": "Friday afternoon Cardinal news and notes",
  "date": "20230818T194500Z",
  "domain": "cardchronicle.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Very cool to note that our cover kid today is the product of a cover wedding from five years ago.\nFriday afternoon Cardinal news and notes\nAlex Jenkins (and Siva the Cat) are very over the Trentyn Flowers new and very ready for football in two weeks.\nTime flies. Remember football.\n—The U of L sports season officially kicked off last night with the U of L women’s soccer team playing Indiana State to a 0-0 draw. Cards still undefeated across the board in 2023-24.\n—Louisville volleyball will start the 2023 season at No. 4 in the preseason AVCA poll. The Cards sit behind only reigning national champion Texas, Wisconsin and Stanford.\n—Cardinal great Wesley Cox needs your help. He has lost both legs, but not his spirit of determination. A GoFund Me for Cox can be found here.\n—Was already a big Gravely fan before this.\n—A former walk-on from Eastern High School, Ramon Puryear is ready to show out in his new role on the defensive line.\n—Will U of L have a 1,000-yard wide receiver in 2023? There are several candidates who could make it happen.\n—Louisville’s defensed finished in the top 10 nationally in multiple categories last season. They have a chance to be even better in 2023.\n—The New England Patriots are back on the field for preseason action on Sunday, and everyone’s wondering what Malik Cunningham will do for an encore.\nCunningham’s dynamic playmaking ability has been a topic of discussion among teammates.\n“When you think of Louisville quarterbacks, you think of Lamar Jackson. He showed me how he compared some of his stats to Lamar and I was like ‘Wow.’ Malik is the real deal — even when it comes to playing wideout,” said Bryant, the fourth-year defensive back.\n“It’s fun,” veteran receiver JuJu Smith-Schuster added. “That dude is electric. When the football is in his hands as a quarterback, he is a very dangerous player.”\nWhile Cunningham showed that in the preseason opener, it came late in the game against the Texans, versus players who likely won’t be on Houston’s regular-season roster. Thus, the question remains whether Cunningham can produce similar results against higher-level competition.\nIf he shows he can, he would position himself to join a rare fraternity.\nOver the past 15 seasons, the Saints’ Hill (2022), the Jets’ Brad Smith (2010) and the Browns’ Josh Cribbs (2009) are the only players to total 50 or more snaps at both quarterback and receiver in a season, according to ESPN Stats & Information. That doesn’t include Drew Brees (2018) and Chad Pennington (2008), who aligned at receiver but primarily for alignment purposes and not to carry out the responsibilities of the position.\nOf his debut, Cunningham said: “I just felt like my running ability gave us a little more options on offense to open it up, so they didn’t know if we were going to pass or run. That was pretty fun.”\nWill the fun continue Saturday night?\n—High school football in Kentucky starts tonight. The CJ previews the area’s teams.\n—The Crunch Zone takes a closer look at U of L’s defensive line for the upcoming season.\n—Racing Louisville’s World Cup players are back and they’re looking to Fill the Fam Saturday night for their 7:30 matchup against Angel City. Card Chronicle readers can get 15% off tickets for the match by going here.\n—Brooke Brohm is already better than Brian.\n—Everyone knows Jack Plummer is the man at QB for Louisville this season, but the battle for QB2 is really heating up.\n—A surprise candidate for the backup job? Former top 100 recruit and current walk-on Harrison Bailey.\n—Although it won’t come in 2024, the ACC is still bracing for Florida State’s continued efforts to leave the conference.\n—Even if conference realignment might be healthy for football, it doesn’t seem to be healthy for any other sports.\n—Be our miracle, Jordan Pyke.\n—How much money would you have won betting on Louisville football over the last 10 years? The data is here.\n—Cardinal Authority is counting down the 50 most important players for the upcoming U of L football season.\n—The Big 12 left Gonzaga and UConn behind in its expansion plans. Both schools will be better off for it.\n—The Louisville-Kentucky volleyball game will be played on Weds., Sept. 13 at 8 p.m. inside the KFC Yum Center. Tickets are available here.\n—After their solid TV ratings a year ago, the U of L volleyball team will play six nationally televised matches this season.\n—The Falcons have signed former Louisville offensive lineman Trevor Reid.\n—Rick Bozich takes a closer look at the nine quarterbacks that Jeff Brohm has on his roster for this season.\n—Busting Brackets looks at the impact of Louisville losing Trentyn Flowers.\n—The safety of UK in the SEC and Louisville in the ACC could be in jeopardy as the college conference landscape keeps shifting dramatically. C.L. Brown explains.\n—Jack Plummer is making sure the guys up front are being taken care of.\n—The only tour Jack Harlow will be doing in 2023 is a six-stop tour across the state of Kentucky. You can register for tickets here.\n—The U of L field hockey team begins its 2023 season (sort of) with a scrimmage against Bellarmine this afternoon.\n—Yet another new restaurant is moving into Oxmoor Center.\n—Friday Irrelevance:\n—The Courier Journal’s All-Metro preseason football team offense is here.\n—Some local media members make their picks for the biggest high school football games of week one.\n—Burner Ball lists Kenny Payne as a “potential mover” in the coaching carousel.\n—Jermayne Lole continues to make “steady progress” from the injury that kept him off the field last season.\n—Pierce Clarkson certainly seems to be on an upward trajectory.\n“Every day just keep improving,” he said. “For myself, these are my first real reps at the college level. Just going through practices every day since I did miss the spring. But I’ve been feeling good and better out there every day I’ve been out there. Just knowing the knowledge I need to have. Knowing the playbook, knowing exactly what I’m supposed to be doing, knowing where the ball is supposed to be. I’ve been feeling a lot more comfortable out there since the time I first stepped on the field.”\nBrian Brohm, UofL offensive coordinator and quarterbacks coach, complimented the first-year Cardinal for his effort on and off the field.\n“He’s done really good in the meeting rooms of knowing what to do, answering questions,” Brohm said. “So, he’s very in tune that way. Now it’s just getting on the field and letting him go out there and execute.”\nMuch of that knowledge came while sidelined during the spring.\n“I just had to stay locked in mentally since I physically couldn’t be out there with the team every day working with them,” Clarkson said. “It was more of a mental battle. I had to sit in my playbook at home. I had to watch practice extra hard to see what they were doing. Then to cutups, just to get that extra knowledge that I was missing out on, and the actual reps I was missing out on every day that they were getting.”\n—The Game Theory podcast discussed Trentyn Flowers’ move to Australia.\n—Jermayne Lole is on the watch list for the Polynesian College Football Player of the Year award.\n—Brooks Holton of the CJ writes about the first big jolt to Kenny Payne’s quest for a successful year two.\n—No. 1 combo in the ACC and it doesn’t even include the former NFL MVP.\n—The 502 Circle is now a pare of the Collective Association.\n—Russ Smith says he wasn’t surprised by Trentyn Flowers’ departure.\n—Juniors Leah Macy and Alyssa Murphy - both high-level Division I recruits - have left the Mercy Academy basketball program.\n—For once, Lunardi and I are on the same page.\n—The Sporting News says that blaming the ACC for their own failures isn’t doing Florida State any favors.\n—Alexis Cubit of the CJ looks what we learned from U of L’s open practices.\n—The AP previews Jeff Brohm’s first season back home.\n—RIP, Tommy.\n—U of L track and field have wrapped up their coaching staff with the hiring of Ronnie Williams.\n—Hoosier Now says Indiana canceling its 2025 football game against Louisville is a smart move.\n—Defensive line depth should be a strength for Louisville this fall.\n—I will watch this every time it pops up on the timeline.\n—Athlon give Louisville a 43.9 percent chance of hitting the over on its 8.5 over/under win total for this fall.\n—U of L softball has added another player for 2024.\n—And finally, the Mike Rutherford Show is back at the Kentucky State Fair this afternoon from 3-5:30 on 1450 The Big X. We’ll be by pillar C15 in the South Wing if you happen to be around. If you’re not, you can stream the show here or by calling (518) 931-1125.",
  "word_count": 1499,
  "scraped_at": "2026-02-14T12:05:21.993360"
}