{
  "article_id": "1291e63e59c2",
  "url": "https://www.almanacnews.com/news/2023/08/27/woodside-high-alumna-jessika-cowart-makes-her-world-cup-debut-playing-for-the-philippines",
  "title": "Woodside High alumna Jessika Cowart makes her World Cup debut playing for the Philippines",
  "date": "20230827T161500Z",
  "domain": "almanacnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "When she was a kid, Jessika Cowart and her dad would bring lawn chairs from home onto Stanford University’s soccer field. They would quietly settle behind the goal posts to watch the women’s games. This was before the university added fencing that now blocks the view, back when soccer legends like Nicole Barnhart, Kelley O’Hara, Christen Press and Ali Riley dominated the field.\nNow, the 23-year old American Filipina, is one of those legends – this young midfielder-defender made her World Cup debut for the Philippines team in New Zealand, an experience that’s still sinking in.\n“It felt like a culmination of all the hard work that the people on this team before me had put in for that very moment. You felt like you were wearing their jerseys on top of yours,” Cowart said.\nHer journey to getting to the biggest stage in soccer started when she was very young. Before she turned to soccer, Cowart had a brief tryst with ballet. It wasn’t a match. Trading out ballet shoes for soccer cleats, her parents enrolled her in a local American Youth Soccer Organization league. She thrived there, and soon one of her coaches suggested trying competitive soccer. Once she made the move from a recreational team to a club team, everything clicked.\nCowart continued playing soccer into her teenage years, even playing on the Woodside High School varsity team for a year.\n“I feel super blessed and grateful to have been able to grow up and play soccer here. I had such great inspiration and it all came from growing up and playing here,” Cowart said.\nPlaying soccer as a professional athlete was Cowart’s dream, but a big part of that dream involved playing for the country where she and her family have ties, the Philippines.\nAn opportunity to represent her parents’ country of origin came to Cowart in 2013, when the Philippines national football team held a week-long training camp in Corona, California. The team was looking to build its squad for the 2014 AFC Women’s Asian Cup, and a coach invited Cowart to participate.\nThe team was interested in Cowart, but at the time, she didn’t have her dual citizenship for both the USA and the Philippines, and her Lola (grandmother) felt that she wasn’t quite ready to go abroad.\nIt wasn’t the right time then, but it got her foot in the door.\nIn college, Cowart played for the Washington Huskies, and after graduating in 2021, she went on to play for Turkey.\nIn 2022, Cowart was wrapping up her time playing for Turkey when she got a call from the same coach who had invited her to Corona back in 2013. Cowart knew the Philippines was trying to qualify for the World Cup, and the coach told her that if she wanted a shot at helping the team make it to the tournament, she should keep her 2023 summer plans open.\nIn the meantime, Cowart came back to California briefly to play for the California Storm, a semi-professional team, part of the Women’s Premier Soccer League based in Sacramento. The team has a number of notable alumni, including Brandi Chastain, Alex Morgan and Leslie Osborne. While there, Cowart was part of the team that won the national championship in 2022. She spoke highly of her time with the Storm and of the staff there.\n“They took me in after my first pro season. The coaching level there is so high. I feel like they prepared me so well,” Cowart said.\nJamie Levoy, a coach and the executive director of California Storm, enjoyed having Cowart on the team.\n“I feel like she made the team better as a whole because of what she demanded from herself, and expectations of her teammates to work hard and always give their best,” Levoy said.\nWhen asked whether she had kept up with Cowart’s World Cup debut, Levoy said she absolutely had been following along.\n“I stayed up for every game. I cried seeing her on the field. As a coach, there’s nothing better than seeing one of your players accomplish their dream,” Levoy said.\nCowart’s time with the California Storm was cut short, but for good reason: she finally had the opportunity to go play her first games with the Philippines team.\nIn the following months, she signed with the Damallsvenskan, the highest professional soccer league in Sweden. She joined the club team IFK Kalmar in January of 2023.\nAs months passed and summer grew closer, Cowart prepared on the field as well as off by getting her passport secured in May. The next month, she received a text saying she’d been selected for the Philippines World Cup team.\nCowart was ecstatic. She wanted to tell her parents right away, but they were in the Bay Area, fast asleep, while she celebrated alone in her apartment in Sweden. She initially planned to hold off, but then she saw a congratulatory video posted by the Philippines team’s social media page. It made her cry, and after 30 minutes, she couldn’t wait any longer and called them.\n“I was like, you’re going to wake up for this!” Cowart said, laughing.\nHer dream was one step closer to being realized, but a few logistical hurdles remained. Her games in Sweden ran right up to the dates when FIFA activities started, so while the rest of the Filipina players had a month to settle in, Cowart finished her last game on June 9 and finally flew out to join them on June 10. Her luggage was briefly lost in the airport when she landed, but luckily everything was sorted out and the excitement of the games overpowered any jet lag she may have felt.\n“To come straight off the plane and be immersed in the World Cup was so, so cool. I was like, ‘I’m going to play in that! Oh, that’s going to be me!’” Cowart said.\nThis year, the Philippines made history at the FIFA Women’s World Cup in Australia and New Zealand. It was the first time the women’s team ever played at the tournament, scored a goal and won a game – beating host nation New Zealand.\nThe moment Sarina Bolden scored that first goal was historic. “At first I was like, oh my God, I hope Serena was on side, I hope everyone was on side. And then my second thought was like, oh my God, did that just happen?” Cowart said.\nShe allowed herself to celebrate for a few moments, but knew there was a lot of work left to do to get a win.\n“My fourth thought was like dude, we have 60 plus minutes of play left in this game. We cannot lose our heads now, we have to stay focused,” she said.\nShe and the rest of her team did just that, defending well for the rest of the game until the final whistle blew. When it was all over, Cowart ran to hug her teammate Reina Bonta, the daughter of California Attorney General Rob Bonta.\n“I wasn’t gonna cry at all. And then I hugged her and I just started sobbing. To come back together after all these years at the World Cup and win our first game, I think it just hit me how big the moment was,” she said.\nOnce she was back in the United States, Cowart went out to dinner with her grandparents. Her Lolo (grandfather) asked her if she really sang the Philippines national anthem while she was at the World Cup.\n“He was like, you guys were lip syncing it weren’t you? And I was like no, I know the entire anthem,” she said.\nHe asked her to sing it for him in the middle of the restaurant, so she did.\nIt moved him to tears.\n“It really hit me how special it was to my family. To be able to represent, and bring pride to, that side of the family is super special. I’m grateful I could do that,” Cowart said.\nIt’s a privilege Cowart said she doesn’t take for granted and works hard to maintain. To play her best at the professional level, Cowart spends roughly 20 hours per week in training. She usually has one game a week and practices nearly every day, typically getting just one day off per week.\nIt might not sound like a full-time job, but when you add up the training time, gym sessions, rest and recovery, it all stacks up. And recovery, Cowart says, is absolutely essential. By recovery, Cowart doesn’t mean kicking back on the couch all day. For her, rest and recovery includes getting enough sleep, consuming plenty of protein and continuing to move her muscles so they don’t stay sore.\nBesides rolling, stretching and wearing compression gear, taking ice baths, something she learned in Sweden, is also a big part of recovery.\n“I hate it, but once I started doing that after games, my life changed and I automatically started feeling better,” she said.\nIn Sweden, Cowart doesn’t need to get into a tub full of ice cubes for the kind of ice bath you and I might imagine. Instead, she heads into the ocean.\n“In winter, the water in Sweden is frigid, it’s in the negatives. It’s the perfect little eight-minute ice bath,” she said.\nWhen she’s not playing, training or recovering, Cowart is studying. Her dad, who knows she’s a fan of true crime, sent her a post on Instagram about Arizona State University’s crime analysis program while she was still in Sweden. Now her once casual passion for true crime is turning into a path toward a master’s degree in crime analysis.\n“It helps, you know, being in school again. It gives me something to do when I’m done training,” she said.\nBalancing her online studies with activities at the World Cup was no easy feat, but Cowart said her professors were very understanding and helped her juggle deadlines with her busy international athletic schedule.\n“I could have maybe waited (until) after the World Cup to do it. But I’m grateful to be able to do both at the same time. I’m really enjoying it,” Cowart said.\nThere’s still a lot on the horizon for Cowart and the Philippines team as they navigate their post-World Cup schedule. The 2023 Asian Games, which will be held in India, are coming up in September, and the Olympic qualifiers will follow in October in Australia.\nCowart said she is excited about what’s next for women’s soccer overall.\n“It feels like change is happening, not just for me but within women’s soccer. I think the number of young girls playing soccer in the world will rise sky high,” she said.\nCowart said she’d also like to see more coverage of soccer games and different leagues in all parts of the world. As a woman in the realm of professional sports, Cowart is all too aware of the difficulties that female athletes face. One of those challenges is fighting for airtime and not knowing whether the games they play will be televised.\n“It’s scenarios like those that really only happen to female sports and it’s like, well, what are we doing wrong? These are the best moments of our lives; we want people to witness them and be part of them. What needs to change for it to just be the standard to televise female sports, at the very least the World Cup?” Cowart said.\nFor a few countries, the Philippines included, this was a concern. In the end, the Philippines did air their games, and Cowart is hopeful that the number of viewers from this World Cup will help grow the game everywhere.\n“I think the numbers (of viewers) from this tournament will help, definitely. But it’s so strange to me that that was even an option – that we just weren’t going to air the World Cup.”\nCowart and her teammates also had to worry about their social media accounts; she, and the rest of the team, had to add monitoring security to their social media profiles to filter out negative and hateful comments.\n“And it’s like, when have you ever heard of a male athlete having to do that? Like sure they get hate, but they don’t get the amount of hate that female athletes do. It’s kind of ridiculous,” Cowart said.\nCowart knows it’s an issue that doesn’t just impact women’s professional soccer.\n“The comment section is a dark place to be in for sure,” Cowart added. “It’s definitely something you have to battle as a female athlete, not just in soccer but everywhere.”\nKnowing that, Cowart likes to uplift women in sports whenever she can. And despite the challenges, Cowart said she knows the voices of supporters are always going to be louder than negative comments. The support helps, and it fuels her excitement for what’s ahead for both her and her Filipina teammates.\n“Obviously I’m excited for the rest of my career,” she said, “But I am really excited to see how the game grows and changes.”",
  "word_count": 2177,
  "scraped_at": "2026-02-14T12:40:00.702044"
}