{
  "article_id": "12ad7ec03412",
  "url": "https://www.sgvtribune.com/2024/03/01/alexander-life-on-the-lakers-roller-coaster/",
  "title": "Life on the Laker roller - coaster",
  "date": "20240302T013000Z",
  "domain": "sgvtribune.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The world according to Jim:\n• This week has been a prime example of what life is like for a Lakers fan these days – basically a mixture of torment and relief.\nDown by 21 points to the Clippers, in the last regular-season meeting in their shared building on Wednesday night, they came back on the strength of LeBron James’ will to beat their hallway rivals. Then, faced with a back-to-back against the nine-win Washington Wizards, they spun their wheels for much of the night – 11 ties, 14 lead changes, trailed for a little more than 26 minutes of what turned out to be 53 – but again won, in overtime, with LeBron again imposing his will when it mattered most. …\n• You think those who believe in Lakers Exceptionalism aren’t already worn to the nub? Their team is 33-28 in a season when both James and Anthony Davis have been relatively healthy (in terms of no extended absences), and they’re firmly in the play-in zone: Ninth place, 5½ games ahead of 11th-place Utah, 2½ behind sixth-place New Orleans.\nTheir longest winning streak is three games (five times, including the in-season tournament) and their longest losing streak is four (twice). They’re 0-2 against Denver this season and losers of seven straight overall to the Nuggets, including last spring’s playoff sweep. And wouldn’t it be just like them to knock off the champs Saturday night, before an ABC audience – and then turn around and lose four in a row. …\n• The point: Expecting consistency from this group is a fool’s errand. …\n• LeBron, the 39-year-old who absolutely doesn’t play like one, needs nine points to reach an astounding 40,000 for his career and should pick them up in the first half Saturday night. Where would the Lakers be without him? Don’t ask. …\n• Remember when we speculated a few weeks ago that the supposed working group of Big Ten and SEC administrators and athletic officials to, ahem, “discuss” issues involving intercollegiate athletics might be the first step toward further stratification? Don’t look now, but the Power Two are already trying to throw their weight around, with word this week that the proposal for a 14-team College Football Playoff format from 2026 on would include six guaranteed spots for, naturally, the Big Ten and SEC.\nPrediction: Within five years those conferences will break away from the NCAA and form their own association with their own rules. And just imagine how the suits at CBS and Turner Broadcasting will take that news, because it almost certainly would water down the NCAA basketball tournament. Their agreement to televise March Madness™ runs through 2032 and is only worth $1.1 billion per year. …\n• If you don’t think this is coming, if you don’t think the power schools are anxious to impose their will on everybody else, may we remind you of the changes to the men’s National Invitation Tournament effective this spring, reserving the first 12 spots for power conference entrants and taking away automatic bids for regular-season champions who don’t make the NCAA field – almost always from mid-major conferences and below. That was implemented by the NCAA, which runs the NIT.\nYou think there’s not some fear that the biggest conferences will break away, thus the desire to pacify them as much as possible? How long will it be before the power schools demand that mid- and low-major conferences lose their automatic bids to the big tournament, too? …\n• But there was one victory for the little guys Friday, albeit in a different sport. After Major League Soccer commissioner Don Garber made noises about removing its teams from the Lamar Hunt U.S. Open Cup – and U.S. Soccer rejected that proposal and reminded MLS that its status as a Division I league included participation in the country’s oldest soccer tournament – a compromise was announced. Eight MLS teams will participate, beginning with the Round of 32. …\n• LAFC’s first team will participate, as one of the top seven clubs that aren’t participating in the CONCACAF Champions Cup. Galaxy II, the developmental club in MLS Next Pro, will represent L.A.’s other franchise. It’s not a perfect solution – that would be everybody participating in the U.S. Open Cup and scrapping the Leagues Cup, which won’t happen – but at least MLS realized, sort of, that it’s part of a larger soccer ecosystem. …\n• Caitlin Clark’s announcement Thursday that she’ll turn pro after this season, and the Indiana Fever’s possession of the first pick in the WNBA draft creates a potential dilemma for SoCal fans who might want a glimpse of the new women’s basketball scoring leader. The Sparks’ lone home game against Indiana is May 24 – and it’s at the Walter Pyramid at Long Beach State, one of five early-season games scheduled for the 5,000-seat facility because of further renovation construction at their downtown L.A. arena.\nYou might want to order your tickets ASAP. As of noontime Friday the Viagogo site had courtside seats available at $1,936 each – no, that’s not a typo – and there were just four left in that location. …\n• As for that building on Figueroa Blvd., I’m tempted to begin calling it Voldemort Center. I’m not a big Harry Potter fan, but to me the former Staples Center is now The Arena Which Must Not Be Named. (Unless we’re allowed to call it Investment Scam Pavilion.) …\n• Belated congratulations to Bud Geracie, who recently retired as executive sports editor of the Bay Area News Group, our sibling organization. Why this matters: For 17 years he wrote a Saturday notes/one-liners/smart aleck column for the San Jose Mercury News, “In The Wake of the Week,” which turns out to be one of the templates for what you’re currently reading.\nThis one doesn’t always appear in the Saturday paper – usually, but not always – and the amount of snark depends on what’s going on in a given week. But the inspiration was, and is and always will be, greatly appreciated.\njalexander@scng.com",
  "word_count": 1014,
  "scraped_at": "2026-02-14T12:47:29.853421"
}