{
  "article_id": "12b1077ead0b",
  "url": "https://www.techradar.com/how-to/watch-ufc-286-live-stream",
  "title": "UFC 286 live stream : how to watch Edwards vs Usman online – start time , odds , full card",
  "date": "20230318T210000Z",
  "domain": "techradar.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "UFC 286 live stream: how to watch Edwards vs Usman online – start time, odds, full card\nWill ‘Rocky’ make a triumphant return to the UK?\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nYou are now subscribed\nYour newsletter sign-up was successful\nWatch a UFC 286 live stream\nYou can watch the UFC 286 mixed martial arts on ESPN Plus for $79.99 with a PPV pass. In the UK, Edwards vs Usman will be on BT Sport Box Office, priced at £19.95. It's the usual Kayo Sports PPV in Australia. Full details on how to watch a UFC 286 live stream on TV just below.\nUFC 286: preview and prediction\nBritish fighter Leon Edwards will be looking to seal a glorious homecoming on Saturday as he defends his Welterweight title against Kamaru Usman as the headline act for UFC 286 at the O2 Arena in London.\nThe trilogy match-up comes just seven months on from Edwards knocking out the seemingly unbeatable \"Nigerian Nightmare\" to take the crown, with this fight his first defence.\nThe two fighters went head-to-head early in their UFC careers back in 2015, with Usman coming out on top that evening, only for Edwards to claim revenge a full seven years later.\nEdwards will now look to prove that his shock win at UFC 278 was no one-off as he looks to seal his status as the undeniable talent at 170lb.\nThe first numbered UFC event to take place in the UK since 2016, Usman is likely to face a hostile crowd as he takes on the popular Jamaican born, Birmingham bred fighter.\nThe headline-act rematch may have a tough act to follow, however, with the co-main event being tipped as a fight of the year candidate with Justin Gaethje facing off against Rafael Fiziev in a much-anticipated lightweight clash.\nThe main card starts at 9pm GMT / 5pm ET. The Edwards vs Usman cagewalks are expected at around 10.30pm GMT / 6.30pm ET. Follow our guide below as we explain how to watch a UFC 286 live stream, so you can catch Edwards vs Usman and the rest in the Octagon.\nUFC 286 live stream: watch Edwards vs Usman in the US without cable\nSee UFC 286 exclusively on ESPN+ PPV\nExclusive US coverage can be found on UFC on ESPN Plus. The main card starts at 4pm ET / 1pm PT, with Edwards and Usman expected to enter the Octagon some time from 6.30pm ET / 3.30pm PT - depending on the duration of the other fights.\nThere are three options on cost, which depend on whether you already subscribe to the service.\n1. Existing ESPN Plus subscribers\nIf you already subscribe to ESPN Plus, then it's very straightforward. It's a classic pay-per-view scenario, and you'll need to spend $79.99 to watch UFC 286.\n2. UFC 286 + ESPN Plus\nIf you don't yet subscribe to ESPN Plus, you can take advantage of the value offer. You'll need to go for the UFC Bundle, costing you $124.98. That gets you both the UFC 286 PPV and a year-long subscription to ESPN+ that would normally cost $99.99 alone.\n3. UFC 286 + Disney Plus/ESPN Plus/ Hulu bundle\nYour final option is to buy access to UFC 286 and with it, get one month of access to the Disney Plus Bundle. So, that's 30 days of everything on Disney Plus - Marvel, Pixar, The Simpsons, Star Wars, etc - the full catalog of live sports and documentaries on ESPN+, and the hundreds of box sets and films on Hulu.\nUFC 286 live stream with the Disney Plus bundle\nUFC 286 and one month of the Disney Bundle $88.98\nGet UFC 286 plus a month of sports and entertainment with the Disney Bundle. So, that's your UFC 286 PPV plus a month's access to ESPN+, Hulu and Disney Plus streaming services. It's only $12.99 per month (with ads) thereafter if you'd like to continue. No contract. Cancel at any time.\nUFC 286 live stream without a PPV in Europe\nAs we say, you're kind of stuck if you're in the US. It's PPV or bust. Not so in Europe! Instead, it's sports streaming specialist DAZN that has the rights to the UFC 286 live stream.\nSo if you're a UFC fan in any of Austria, Italy, Germany or Spain, then get yourself over to the DAZN website.\nDepending on your region, DAZN offers Serie A and La Liga football, NFL and a whole host of other top rank live sporting content.\nHow to watch Edwards vs Usman: live stream UFC 286 in the UK\nBT Sport has exclusive broadcast rights to UFC events in the UK and Ireland right now, but unlike most UFC cards on the network, this blockbuster bill is a pay-per-view affair.\nThe PPV will set you back £19.95 and you'll need to tune into BT Sport Box Office for all the action from the O2, with coverage of the main show starting at 7pm on Saturday evening. Edwards and Usman are expected to enter the Octagon after 10.30pm GMT.\nThe broadcaster's coverage of UFC is also available via the BT Sport app and on its website, so you can live stream UFC on most devices these days - and don't forget that you can now get BT Sport without a massive commitment thanks to a BT Sport Monthly Pass.\nEdwards vs Usman: live stream UFC 286 in Canada\nThere are a host of pay-per-view providers offering a UFC 286 live stream in Canada.\nYou can head to the likes of Shaw, Bell, Rogers, SaskTel, Videotron, Telus, Eastlink or YouTube, with pricing at CA$64.99. It's also available on the UFC Fight Pass PPV.\nTune into the main card from 5pm ET / 2pm PT on Saturday afternoon. Edwards vs Usman is expected to start at around 6.30pm ET / 3.30pm PT.\nUFC 286 live stream: how to watch Edwards vs Usman online in Australia\nAs per usual, you'll find UFC 286 and Leon Edwards vs Kamaru Usman available on PPV in Australia, setting you back AU$59.95.\nThe main card is set to kick off at 8am AEDT on Sunday morning. Edwards and Usman are expected to make their way toward the Octagon at around 9.30am.\nSo to watch the fight, you'll need to sign up via the Foxtel site or Kayo Sports Main Event. You can live stream the whole event via your web browser and devices like Android, iOS, Samsung TV, Apple TV, Android TV, Telstra TV and Chromecast.\nYou can also catch all the prelims and the main card using UFC Fight Pass.\nEdwards vs Usman live stream: how to watch UFC 286 in New Zealand\nSky Arena is offering UFC fans in New Zealand an Edwards vs Usman live stream - with the PPV priced at NZ$39.95 for all the main card action.\nYou'll want to make sure you're watching from at least the 10am NZDT main card start time on Sunday to catch all the action.\nThe headline Edwards vs Usman fight is expected any time from 11.30am, depending on how the rest of the card plays out.\nWho is Leon Edwards\nJamaican-born British star Leon Edwards made his way out of a world of gang violence in Birmingham thanks to MMA.\n\"Rocky\" made his professional debut at 19, and would eventually sign up with the UFC four years later.\nHe has since gone on to chalk up 12 wins from 15 fights with his victory last year over Usman seeing become Britain's first champion since Michael Bisping back in 2016.\nWho is Kamaru Usman\nOne of MMA's best grapplers Usman took the welterweight crown from Tyron Woodley in 2019 at UFC 235.\nHis unexpected defeat to Edwards at UFC 278 ended a seemingly unstoppable run of 19 straight MMA victories.\nWhile the \"Nigerian Nightmare” is known for his floor work, he can punch his way out of trouble when needed, and perfectly illustrated his fists as a means of attack in knockout wins against the likes of Colby Covington, Gilbert Burns and Jorge Masvidal.\nEdwards vs Usman latest odds: who is the favorite to win?\nThe bookies appear to be tipping Edwards reign as champ as a short lived one, with Usman the favourite to win this third and final fight between the two fighters. The Nigerian Nightmare's odds of winning are currently hovering round the 4/11 mark, with Edwards the outsider at around 15/8.\nEdwards vs Usman: recent results\nThe last fight for both fighter was their encounter at UFC 278, which saw Edwards dispatch Usman with one of the all-time great knockouts.\nRocky's last-gasp left high-kick floored his opponent during the dying moments of the fifth round in Salt Lake City, Utah, last August, ensuring that the British fighter walked away with the 170lb title in hugely dramatic fashion.\nUFC 286 full card and highlights\nBeyond the Trilogy-deciding title fight of the headline act, and the much anticipated co-main event between Justin Gaethje and Rafael Fiziev, UFC 286 also boasts Jack Shore's long-awaited return to action. The Welsh star is set to make his debut at featherweight against Iranian-born Finnish fighter Makwan Amirkhani.\nMain card\nLeon Edwards (c) vs Kamaru Usman - Welterweight\nJustin Gaethje vs Rafael Fiziev - Lightweight\nJennifer Maia vs Casey O'Neill - Women's flyweight\nGunnar Nelson vs Bryan Barbarena - Welterweight\nMarvin Vettori vs Roman Dolidze - Middleweight\nPrelims\nJack Shore vs Makwan Amirkhani - Featherweight\nSam Patterson vs Yanal Ashmoz - Lightweight\nChris Duncan vs Omar Morales - Lightweight\nMuhammad Mokaev vs Jafel Filho - Flyweight\nEarly prelims\nLerone Murphy vs Gabriel Santos - Featherweight\nChristian Leroy Duncan vs Duško Todorović - Middleweight\nMalcolm Gordon vs Jake Hadley - Flyweight\nJoanne Wood vs Luana Carolina - Women's Flyweight\nJai Herbert vs Ľudovít Klein - Lightweight\nJuliana Miller vs Veronica Macedo - Women's Flyweight\n- Race ready? Where to find an F1 live stream for the Saudi Arabian GP\n- Football fanatic? Premier League live stream\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nKevin Lynch is a London-born, Dublin-based writer and journalist. The author of Steve Jobs: A Biographic Portrait, Kevin is a regular feature writer for a number of tech sites and the former Technology Editor for the Daily Mirror. He has also served as editor of GuinnessWorldRecords.com and has been a member of the judging panel for the BAFTA British Academy Video Game Awards. Alongside reviewing the latest AV gear, smartphones and computers, Kevin also specialises in music tech and can often be found putting the latest DAWs, MIDI controllers and guitar modellers through their paces. Born within the sound of Bow Bells, Kevin is also a lifelong West Ham fan for his troubles.",
  "word_count": 1792,
  "scraped_at": "2026-02-14T13:33:53.957816"
}