{
  "article_id": "13046afb1273",
  "url": "https://www.rri.ro/en/news-and-current-affairs/newsflash/june-16-2024-update-id779281.html",
  "title": "June 16 , 2024 UPDATE - Radio Romania International",
  "date": "20240616T173000Z",
  "domain": "rri.ro",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "June 16, 2024 UPDATE\nA roundup of domestic and international news\nNewsroom, 16.06.2024, 18:57\nLAW. A new law on increasing financial inclusion came into force on Sunday, so now all merchants in Romania are obliged to accept payment by card. The normative act stipulates that all natural or legal persons registered with the National Trade Register Office have the obligation to ensure the implementation and accept at least one non-cash payment tool. At the same time, merchants can also offer a cash advance service at payment terminals, in a maximum amount of 500 lei (around 100 euros) and can charge the cardholder a commission that cannot exceed 1% of the amount of the advance granted.\nBACCALAUREATE. More than 134,000 candidates registered for the summer session of the Baccalaureate exam, which begins on Monday with the oral exam in Romanian language and literature. There will be tests to assess language skills in the mother tongue, digital skills and language skills in an internationally spoken language. The written tests will take place between July 1-5, in the Romanian language and literature, the mandatory profile test, the profile and specialization test and the native language and literature test. According to the Ministry of Education, a candidate is declared passed if they cumulatively meet the following conditions: passing the competency assessment tests, passing all the written tests, receiving a grade of minimum 5 for each of these tests, obtaining, in the end, an average of at least 6 in the written tests.\nPEACE. Russia could put an end to the war of aggression against Ukraine, but it does not wish to do so, said the Romanian Foreign Minister, Luminiţa Odobescu, at the Global Peace Summit in Switzerland. The Romanian official explained that Moscow is politically, legally and morally responsible for the consequences of the war. Consequently, Odobescu pointed out, the Russian Federation must be judged by its deeds, not by its words. The final press release of the meeting reaffirms “the principles of sovereignty, independence and territorial integrity of all states, including Ukraine”. “We believe that in order to reach peace, the participation of all parties and dialogue between all parties is needed,” the document cited by FP states. It also emphasizes that “food security must not be militarized under any circumstances”, in the context in which the invasion of Ukraine, one of the main grain exporters in the world, had dramatic repercussions on the supply, as well as the stoppage of Russian fertilizer exports. Finally, the communiqué calls for the release of all prisoners of war, as well as the “illegally deported Ukrainian children”. 93 countries participated in the Summit, and the biggest absentees were Russia and China. The final declaration was signed by only 80 states. Among those that did not support the document are Brazil, Mexico, Saudi Arabia, South Africa, India, Indonesia, the Vatican\nOSCE. Romania has decided not to allow the Russian Federation delegation to participate in the annual session of the OSCE Parliamentary Assembly, which will take place in Bucharest between June 29 and July 3. The measure will be applied to all members of the Russian delegation, i.e. parliamentarians and technical staff. The same ban will apply to the delegation of Belarus, a country that supports the war started by Russia in Ukraine. The spokesperson for the Romanian Ministry of Foreign Affairs, Radu Filip, explained on Radio Romania News and Current Affairs that the decision is based on the known and consistent position of Romania in relation to Russia, in the context of the war of aggression against Ukraine. Moreover, some of the members of the Russian delegation to the OSCE Parliamentary Assembly are subject to restrictive measures at the European level, so they cannot be received on Romanian territory.\nCONGO. A Romanian citizen died and two others were injured in the clashes between the rebel groups and the government army of the Democratic Republic of Congo. The Romanian Ministry of Foreign Affairs has announced that one more person, a citizen of another state, was injured in the incident, which occurred near the city of Goma, on the border with Rwanda. The spokesperson for the institution, Radu Filip, has stated that the representatives of the Romanian diplomatic mission in Angola urged the Congolese authorities to obtain information in this case. At the same time, the Romanian MFA has stressed that a level eight travel warning is in place for Congo and that Romanian citizens must avoid any trip to that country.\nCAMPAIGN. The Romanian Police is carrying out a national campaign to combat crimes generated by discrimination based on race. The action, which takes place between June and July, is aimed at preventing the spread of messages motivated by prejudice and hatred against the Roma minority in the press and on social media. The campaign’s goal is to promote tolerance, under the slogan “It is in our power to discourage hatred”. Also, a department specialized in the investigation of crimes based on discriminatory criteria was established within the Criminal Investigation Department. The project is financed from European and national funds.\nTOURISM. Romania is being promoted as a tourist destination in Germany, given that, last year, most foreign tourists visiting Romania were German. More than 600 taxis on which images from our country have been posted are driving around Hamburg, Berlin, Munich and Frankfurt on the occasion of the European Football Championship, which Germany is hosting. The Romanian Minister of Tourism, Radu Oprea, has stated that this initiative continues the campaigns started in Paris, Rome and Milan. He believes that the selected images will increase the visibility of Romania and will attract foreign tourists eager “to see green, nature and (…) culture”. Each sticker placed on taxis in Germany has a QR code by means of w hich one access a brochure in German, with the help of which visitors can obtain relevant information about the various destinations in our country. The first match of the Romanian national football team at EURO 2024 will take place tomorrow against the national team of Ukraine. Romania is part of Group E and its opponents include Belgium and Slovakia.\nROWING. On Sunday, Romania won a bronze medal in the women’s sculls, in the third stage of the Rowing World Cup, hosted by Poznan, in Poland. The crew composed of Cristina Drugă, Larisa-Andreea Bogdan, Andreea Popa and Geanina Juncănariu was overtaken by the team from New Zealand, which won the gold, and Australia, which won the silver. In the women’s double rowing final, the Romanians finished in 4th place. (mi)",
  "word_count": 1087,
  "scraped_at": "2026-02-14T12:32:46.171834"
}