{
  "article_id": "130c20e0e4e4",
  "url": "https://georgetownvoice.com/2025/03/17/the-washington-spirit-look-poised-for-a-championship-run/",
  "title": "The Washington Spirit look poised for a championship run",
  "date": "20250317T150000Z",
  "domain": "georgetownvoice.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "After a painful loss in last year’s National Women’s Soccer League (NWSL) championship game, the Washington Spirit retooled and are out for revenge. New roster additions strengthened the team in key areas, and the Spirit boast one of the league’s strongest casts of returnees. Although injuries and absences threaten to derail this promising season, Washington has asserted itself among the favorites to win this year’s title.\nLast Season\nIn a storybook ending, the Orlando Pride defeated the Spirit 1-0 to win the NWSL championship. Marta, a legendary figure in soccer, and Barbra Banda, one of the best strikers in the world, willed Orlando to the title after years of mediocrity. Their team, which set the record for the league’s longest unbeaten streak, deservedly took home the win.\nStill, Washington’s performance last season deserves praise and credit. The Spirit finished as the second seed, four points behind the Pride, despite battling injuries, with standout midfielders Andi Sullivan and Croix Bethune out for much of the season. To a large extent, the squad depth—their quality backups at every position—made up for those losses.\nNew Additions\nThe team’s offseason moves looked to address some issues that left them agonizingly short last season. Midfielder Narumi Miura, formerly of the North Carolina Courage, joined the team as a free agent in December. Miura is a defensive midfielder who can anchor the Spirit midfield and allow attack-minded players like Bethune freedom to roam. Particularly with the absence of Sullivan, who announced her pregnancy in February, Miura’s passing accuracy and defensive efforts could be important for the Spirit’s success.\nThe Spirit also signed central defender Rebeca Bernal from C.F. Monterey in Mexico. Bernal is strong and experienced, helping to fill the center back spot left vacant by Annaïg Butel, who left Washington this offseason. Bernal will likely slot in alongside central defenders Tara McKeown and Esme Morgan, offering additional depth at that position. She can also play a defensive midfield role, like she did against the Pride in the Spirit’s preseason match.\nReturners\nMcKeown and Morgan sit at the core of a strong defensive line that only allowed 28 goals in 26 matches last season, tied for third-best in the league. Goalkeeper Aubrey Kingsbury anchors the unit, saving 75% of shots she faced last season, fifth best among goalkeepers who played at least 10 games.\nIn Washington’s midfield, Bethune, the 2024 NWSL Rookie of the Year, broke out for the Spirit last year. Bethune had more assists than any other player in the league and more goals than any other rookie, while only playing in 17 matches due to injury.\nForward Trinity Rodman, a fixture for the United States Women’s National Team, has been the Spirit’s standout attacker since her rookie year in 2021. Rodman was once again crucial for the Spirit last season, tallying eight goals and six assists. With a roster brimming with talent at all levels, Washington can compete with any team.\nObstacles\nIt won’t be an easy road to the title, though. The Pride are returning a strong roster, with Banda and Marta coming back for this season. The KC Current and NY/NJ Gotham FC, who finished in third and fourth, respectively, are also returning star players that could certainly challenge for a title.\nFurthermore, the Spirit’s roster currently lacks many of the team’s best players. The Spirit’s availability report shows a long list of key contributors who will be out for an extended period of time, including Sullivan, Bethune, forward Ouleye Sarr, and midfielder Heather Stainbrook. Additionally, Rodman has been dealing with a back injury since the 2024 Olympics, although she has reportedly been recovering well.\nThese injury concerns, as well as unforeseen absences, could keep Washington from reaching its full potential. However, fans have reason for optimism. Bethune, Rodman, and Sarr are on the road to recovery. Last season, the Spirit shined as one of the best teams in the league despite missing those three players, Sullivan, and others for portions of the season. The best teams can take injuries in stride and still perform at a high level, and the Spirit showed that capability.\nThe first glimpse at this season’s team came on March 7 in the Challenge Cup, a preseason trophy match. The Spirit had a chance for revenge on Orlando in the game, although neither team fought at full strength. The teams battled to a 1-1 tie during regular time and needed penalty kicks to decide the winner. The Spirit scored four penalty kicks while the Pride converted just two, and Washington took home the trophy. While just a preseason match that won’t affect the league standings, the win should be a good sign, with the Spirit vanquishing the team they fell short against last year.\nThe Spirit open their season on the road against the Houston Dash on Friday, March 14. Then, they host the KC Current for their home opener on Saturday, March 22. The Dash finished last in the NWSL last year, but the Current finished fourth, just a single point behind the Spirit. The two games will be a good test of the Spirit’s current strength as they look to avenge last year’s disappointment.",
  "word_count": 860,
  "scraped_at": "2026-02-14T12:24:03.358676"
}