{
  "article_id": "13307c0ebc34",
  "url": "https://www.arsenal.com/news/when-wilshere-beat-man-city-youth-cup-semis",
  "title": "When Wilshere beat Man City in the Youth Cup semis",
  "date": "20230328T180000Z",
  "domain": "arsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Jack Wilshere aimed to use his experience in the FA Youth Cup to inspire our under-18s against Manchester City in their semi-final tie at Emirates Stadium.\nOn Tuesday, April 4 2023, our new coach thought back to 14 years ago, when he was playing his part on that same pitch against the same opposition at the same stage of the competition, in the year we last got our hands on the famous trophy.\nBack in the 2008/09 season, we reached the last four by knocking out Aston Villa, Wolves, Sunderland and Tottenham Hotspur, thanks to a squad that would go on to amass over 3,000 professional appearances including Kyle Bartley, Francis Coquelin, Luke Ayling and Henri Lansbury.\nHowever it was Jack who was the most exciting member of that side, having already debuted for Arsene Wenger’s first-team in a Premier League match against Blackburn Rovers in September 2008 and continuing to feature fairly regularly up to the start of the cup run.\nAnd that experience gained at the highest level would stand him - as well as his teammates - in good stead by the time City pitched up in N5 in April 2009, skippered by Kieran Trippier and featuring future internationals Dedryck Boyata and John Guidetti in their ranks.\nWe had inflicted City’s first defeat all season by beating them 2-1 at the City of Manchester Stadium in the first leg the month before thanks to goals from captain Jay Emmanuel-Thomas and Gilles Sunu, but boss Steve Bould didn’t look to send his side out under instruction to protect their advantage - they looked to wrap up a final spot in style.\nOur stall was set out in just the first minute when Sanchez Watt raced onto a long ball by Emmanuel-Thomas and fired home, and the striker’s pace caused issues again on 20 minutes when he was brought down by visiting keeper Joe Clegg, allowing Wilshere to tuck home our second from the penalty spot.\nRelishing playing in front of nearly 10,000 supporters, the hosts were thriving and added a third nine minutes later when Bartley rose highest to head home a corner, and that was swiftly followed up when Watt pounced on some hesitation in the City defence to add a fourth.\nThe visitors pulled one back just before half-time through Ahmad Benali, but nothing could prevent Wilshere and co from setting up a final meeting with Liverpool where another emphatic 4-1 success would clinch the cup.\nNow 14 years on, Wilshere the coach has helped set the stage for our latest crop of young hopefuls to follow in his footsteps, as they dream of clinching silverware themselves in our colours.\nOur team against City (2009): James Shea, Craig Eastmond, Thomas Cruise, Kyle Bartley, Luke Ayling, Francis Coquelin, Emmanuel Frimpong, Jack Wilshere, Gilles Sunu, Jay Emmanuel-Thomas, Sanchez Watt.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 498,
  "scraped_at": "2026-02-14T12:44:51.353007"
}