{
  "article_id": "13444deb6bb7",
  "url": "https://www.mlb.com/athletics/news/2025-mlb-draft-prospects-famous-family-ties",
  "title": "2025 MLB Draft prospect famous family ties",
  "date": "20250710T153000Z",
  "domain": "mlb.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Just like every year, the 2025 MLB Draft will feature some very recognizable last names. That was the case again in 2024, with the sons of such MLB stars as Kevin Brown and Manny Ramirez hearing their names called.\nWho could be the next draftee to cause a little nostalgia? Here are just some of the 2025 Draft-eligible players with famous relatives, in baseball and elsewhere. Although being eligible for the Draft doesn’t guarantee that a player will be selected, we’re starting our list with those ranked by MLB Pipeline as among this year’s Top 250 Draft Prospects.\nThe 2025 Draft will be broadcast live from Atlanta on Sunday, with a pregame show at 6 p.m. ET on MLB Network and ESPN (as well as MLB.TV, MLB.com and in the MLB App) and the Draft at 7 p.m. ET. Coverage of Day 2 of the Draft -- consisting of rounds 4 through 20 -- will be streamed on Monday on MLB.com beginning at 11:30 a.m. ET.\n2025 MLB Draft presented by Nike\nDay 1 (Rounds 1-3): Pick-by-pick analysis | Top storylines\nDay 2 (Rounds 4-20): Round-by-round analysis\n- Tracker | Bonus tracker | Top 250 prospects\n- Best hauls | Biggest steals\n- Pipeline Podcast analyzes Draft\n- Picks with famous relatives | Quickest to the bigs\n- Corona HS makes Draft history\n- Complete coverage\nMore on the top picks:\n1. WSH: Willits | 2. LAA: Bremner | 3. SEA: Anderson | 4. TEX: Holliday | 5. STL: Doyle\n6. PIT: Hernandez | 7. MIA: Arquette | 8. TOR: Parker | 9. CIN: Hall | 10. CWS: Carlson\nTOP 250 PROSPECTS\nEthan Holliday, SS, Stillwater HS (Okla.) (No. 1 prospect)\nRelatives: Matt Holliday (father, 15 MLB seasons), Jackson Holliday (brother, Orioles second baseman)\nEthan could join Jackson, the first overall selection by the Orioles in 2022, as a No. 1 pick, but both brothers will be chasing the accolades and accomplishments earned by their father for a while. Matt Holliday was a seven-time All-Star, had 316 career home runs and 1,220 RBIs, and he won the World Series with the Cardinals in 2011 while playing in two others. He received MVP votes in eight of his 15 seasons.\nEli Willits, SS, Fort Cobb-Broxton HS (Okla.) (No. 5 prospect)\nRelative: Reggie Willits (father, 6 MLB seasons)\nReggie Willits played in 414 games over six seasons, all with the Angels. His best season came in 2007, when he batted .293 and had a .391 on-base percentage in 136 games. He’s one of nine players in the past 70 years to collect at least 800 at-bats without a home run. Willits currently serves as associate head coach at the University of Oklahoma, a role in which he has served for three seasons.\nQuentin Young, 3B/OF, Oaks Christian HS (Calif.) (No. 37 prospect)\nRelatives: Dmitri Young (uncle, 13 MLB seasons), Delmon Young (uncle, 10 MLB seasons)\nThe Young brothers each recorded more than 1,100 hits and 100 homers in the big leagues. Dmitri was the No. 4 overall pick in the 1991 Draft and was an All-Star with the Tigers (2003) and Nationals (2007). Delmon, the No. 1 overall selection by the Rays in 2003, was the runner-up American League Rookie of the Year in '07.\nCade Obermueller, LHP, Iowa (No. 53 prospect)\nRelative: Wes Obermueller (father, 5 MLB seasons)\nWes Obermueller played in five seasons for three MLB teams, winning six games for the Brewers in 2004. He also pitched a season in Japan and one in Korea. Like his son, he played collegiately at Iowa and is now the Hawkeyes’ director of player development.\nBrady Ebel, SS, Corona HS (Calif.) (No. 64 prospect)\nRelative: Dino Ebel (father, Dodgers’ third-base coach)\nDino Ebel has coached with the Angels and the Dodgers, where he’s been third-base coach since 2019. He coached third for team USA in the 2023 World Baseball Classic and will reprise that role in 2026. He played seven seasons in the Dodgers organization, reaching Triple-A.\nCam Leiter, RHP, Florida State (No. 114 prospect)\nRelatives: Kurt Leiter (father), Al Leiter (uncle), Mark Leiter (uncle), Jack Leiter (cousin), Mark Leiter Jr. (cousin)\nThis is the definition of a baseball family. Mark Leiter and Al Leiter pitched for nearly 30 combined seasons in the Major Leagues, with Al making two All-Star teams and helping the Marlins win the 1997 World Series. Mark Jr. and Jack are continuing the legacy as current players, and Kurt reached Double-A for the Orioles.\nJayden Stroman, OF, Patchogue Medford HS (N.Y.) (No. 130 prospect)\nRelative: Marcus Stroman (brother, Yankees pitcher)\nMarcus Stroman’s 2025 has been hampered by injuries, but he’s been a workhorse for most of his career, pitching at least 150 innings in five of his 10-plus seasons. The elder Stroman was an All-Star for the Blue Jays in 2019 and finished eighth in AL Cy Young voting while winning a Gold Glove in 2017.\nMicah Bucknam, RHP, Dallas Baptist (No. 131 prospect)\nRelative: Lyndsie White (cousin, former U.S. National Women's Rugby team)\nWhite was an All-American rugby player at Appalachian State and was selected to play for the USA Collegiate All-American team in 2013.\nTre Phelps III, SS, Georgia (No. 137 prospect)\nRelative: Angel Robinson (aunt, former WNBA player)\nRobinson was a McDonald’s All-American in high school, starred at the University of Georgia and then was selected No. 20 overall in the 2010 WNBA Draft. She played 64 games over three seasons with Seattle and Phoenix.\nEthan Hedges, 3B, Southern California (No. 159 prospect)\nRelative: Tim Hovland (uncle, former professional beach volleyball player)\nHovland earned more than $1 million while playing beach volleyball for two decades. He was inducted into the Beach Volleyball Hall of Fame in 2000 and the Volleyball Hall of Fame in 2024.\nGrant Jay, C/OF, Dallas Baptist (No. 170 prospect)\nRelative: Joey Jay (grandfather, 13 MLB seasons)\nJay won 99 games over 13 MLB seasons. He played in both All-Star games in 1961, including the first to end in a tie. That season, he won 21 games for the Reds and finished fifth in NL Cy Young voting. Jay won 21 games again in 1962.\nLorenzo Meola, SS, Stetson (No. 183 prospect)\nRelative: Tony Meola (cousin, former Team USA goalkeeper)\nTony Meola played in 100 soccer games for the United States, including two World Cups. He was drafted by the Yankees out of high school in 1987 but opted for the pitch over the diamond. He won an MLS Cup with Kansas City in 2000.\nIsaiah Jackson, OF, Arizona State (No. 214 prospect)\nRelative: Andre Jackson (brother, 3 MLB seasons)\nAndre Jackson earned his first and only Major League victory for the Pirates in 2023. He was drafted out of Utah in 2017 and still plays professionally, making 39 appearances in Japan in the last two seasons.\nOTHER DRAFT-ELIGIBLE PLAYERS\nBig names in baseball history\nKaeden Kent, SS, Texas A&M\nRelative: Jeff Kent (father, 17 MLB seasons)\nJeff Kent had an excellent MLB career from 1992-2008, hitting 377 home runs with an .855 OPS as a second baseman, while he was a five-time All-Star, four-time Silver Slugger Award winner and the 2000 NL MVP for the Giants. Kent had a borderline Hall of Fame case, receiving 46.5 percent of the vote (75 percent needed to be elected) in his final year of eligibility in 2023.\nBrady Counsell, SS, Kansas\nRelative: Craig Counsell (father, Cubs manager)\nCraig Counsell played 16 years in the Majors, racking up 1,208 hits as an infielder while winning a World Series with the 1997 Marlins and 2001 D-backs. His baseball career was only getting started, as Craig managed the Brewers for nine years from 2015-23 and has been the Cubs manager since 2024.\nMax McGwire, 1B, Saint Louis\nRelative: Mark McGwire (father, 16 MLB seasons)\nMark McGwire clubbed 583 home runs across 16 seasons, including three 50-homer seasons headlined by his 1998 season where Big Mac clubbed 70 home runs, the second most in a season in MLB history. In 2010, McGwire admitted to using performance-enhancing drugs, which is a key reason why he didn’t get elected to the Hall of Fame.\nAustin Pierzynski, C, The First Academy (Fla.)\nRelative: A.J. Pierzynski (father, 19 MLB seasons)\nA.J. Pierzynski had a distinguished 19-year career in the Majors, slugging 188 home runs as a backstop, appearing in two All-Star Games and winning a World Series with the 2005 White Sox. Pierzynski has been a full-time broadcast analyst with Fox Sports since 2017 and is a main host on the Foul Territory Podcast with Erik Kratz and Scott Braun.\nManny Ramirez Jr., OF, Tallahassee State\nRelative: Manny Ramirez (father, 19 MLB seasons)\nManny Ramirez was one of the most feared hitters of his generation, hitting 555 home runs with a .996 OPS with five teams from 1993-2011. Ramirez was a 12-time All-Star, nine-time Silver Slugger Award winner and finished top 10 in MVP voting nine times. He was a two-time World Series champion with the Red Sox in 2004 and ’07. Ramirez was suspended twice for violating MLB’s drug policy, which hindered his chances of making the Hall of Fame.\nCarsten Sabathia, 1B, Houston\nRelative: CC Sabathia (father, Hall of Fame inductee)\nCC Sabathia is one of the most accomplished left-handed pitchers in baseball history, having won 251 games with a 3.74 ERA in 19 seasons from 2001-19. Sabathia is one of four lefties in the 3,000 strikeout club, having been recently joined by Clayton Kershaw. Sabathia was elected to the Hall of Fame in January, his first year on the ballot.\nJake Casey, OF, Kent State\nRelative: Sean Casey (father, 12 MLB seasons)\nSean Casey was a three-time All-Star in his 12 MLB seasons, posting a career .302/.367/.447 slash line with 1,531 hits. The Mayor was a beloved Red, spending eight of his 12 seasons in Cincinnati. Casey is currently an analyst with MLB Network.\nActive players\nZach Yorke, C, Grand Canyon\nRelatives: Nick Yorke (brother, current Pirates Minor Leaguer), Robyn Yorke (mother, former All-American softball player)\nNick Yorke hit two home runs in 11 games for the Pirates in 2024 but has spent all of this season in Triple-A. Robyn Yorke was a four-time All-American at Fresno State, twice on the first team. She was the person, Nick says, who taught him how to hit.\nJayden Melendez, C, Pittsburgh\nRelatives: MJ Melendez (brother, current Royals outfielder), Mervyl Melendez (father, former Team USA baseball coach)\nMJ Melendez is in his fourth MLB season since being drafted by the Royals in the second round out of a Miami high school in 2017. He hit a career-high 18 home runs as a rookie in 2022. Mervyl Melendez, for whom MJ was named, played at Bethune-Cookman in Florida and was the head coach at Bethune-Cookman, Alabama State and Florida International. He has also coached for team USA at the youth level.\nOwen Puk, RHP, Florida International\nRelative: A.J. Puk (brother, current D-backs reliever)\nA.J. Puk, currently on the 60-day injured list, is in his sixth MLB season and one of baseball’s top relievers. Between the Marlins and Diamondbacks last season, he struck out 88 batters in 71 ⅓ innings with a 3.15 ERA in 62 games.\nZach Toglia, 3B, Portland\nRelative: Michael Toglia (brother, Rockies first baseman)\nMichael Toglia was a first-round pick of the Rockies in 2019 and made his debut for Colorado three years later. He clubbed 25 home runs in 2024, the 10th Rockies player 25 or younger to hit that many.\nMore baseball names to remember\nBlake Ilitch, RHP, Brother Rice HS (Mich.)\nRelatives: Chris Ilitch (uncle) and Mike Ilitch (grandfather), Tigers owners\nMike Ilitch, who passed away in 2017, was the founder and owner of Little Caesar’s Pizza and a huge influence in Detroit sports. He bought the Red Wings in 1982 and the Tigers in 1992, which are still owned under Ilitch Holdings, with Chris holding the current title of CEO.\nBryce Martin-Grudzielanek, SS, Southern California\nRelative: Mark Grudzielanek (father, 15 MLB seasons)\nMark Grudzielanek collected 2,040 hits in his 15-year MLB career. He made the All-Star team in his second season in 1996 with the Expos and won his first and only Gold Glove award as a 36-year-old for the Royals in 2006.\nCarson Brumbaugh, SS, Edmond Santa Fe HS (Okla.)\nRelative: Cliff Brumbaugh (father, 1 MLB season)\nCliff Brumbaugh appeared in 21 games between the Rangers and Rockies in 2001. The corner outfielder batted .217 with one home run.\nCaden Glauber, RHP, Catawba Ridge HS (S.C.)\nRelative: Keith Glauber (father, 2 MLB seasons)\nThe elder Glauber had a couple of brief stints as a reliever for the Reds, posting a 3.00 ERA in seven combined relief appearances for Cincinnati in 1998 and 2000.\nMaddox Miller, LHP, Oak Grove HS (Miss.)\nRelative: Matt Miller (father, 5 MLB seasons)\nMatt Miller spent five years in the Majors as a reliever, making 100 career appearances -- four for the Rockies in 2003 and the rest from the Guardians from 2004-07. He had a 2.72 career ERA.\nEli Jerzembeck, RHP, South Carolina\nRelative: Mike Jerzembeck (father, 1 MLB season)\nAfter suffering a freak injury when he was hit on the pitching elbow by a Jorge Posada throw, Mike Jerzembeck appeared in three games for the Yankees in 1998 with a 12.79 ERA. He missed all of 1999 and 2000 due to shoulder and elbow surgeries and was released midway through 2001.\nBrady Dallimore, C, Palo Verde HS (Nev.)\nRelatives: Brian Dallimore (father, 2 MLB seasons), Fred Dallimore (grandfather, longtime UNLV coach)\nBrian Dallimore hit .260 with one homer and a .701 OPS for the Giants from 2000-01, while Fred became one of college baseball’s winningest coaches with 794 victories in his 23 years at UNLV (1974-1996).\nBruin Agbayani, SS, Saint Louis School (Hawaii)\nRelative: Benny Agbayani (father, 4 MLB seasons)\nA five-year MLB veteran, Agbayani is best remembered for his four years in Queens, where he emerged as a linchpin for the Mets teams of the late ’90s -- including the 2000 team that won the NL pennant.\nIsaac Lyon, RHP, Grand Canyon\nRelative: Brandon Lyon (father, 12 MLB seasons)\nA 37th-round pick in the 1997 Draft, Lyon carved out a successful 12-year career as a relief arm -- a successful transition after spending his first two years in the Majors as a starting pitcher. He pitched to a 4.16 ERA while spending time with six different teams.\nCaden Marcum, RHP, Cloud County CC\nRelative: Shawn Marcum (father, 9 MLB seasons)\nMarcum made 167 starts across parts of nine seasons in the Majors, posting a 3.93 career ERA. His last appearance came with Cleveland in 2015, and he spent multiple seasons with both the Blue Jays and Brewers.\nAndre Duplantier II, RHP, Texas\nRelative: Jon Duplantier (cousin, 2 MLB seasons)\nJon Duplantier was a big-time prospect back in the last decade, ranked No. 1 in the D-backs' system by MLB Pipeline from 2018-19. He couldn't quite stick in the Majors but as of 2025 is enjoying a very successful stint in Japan. Andre's younger brother, Jayden, his teammate at Texas, is also Draft eligible.\nAiden Jimenez, RHP, Arkansas\nRelatives: Jason Jimenez (father, 1 MLB season), Ken Hottman (grandfather, 1 MLB season)\nAiden's dad and maternal grandfather had remarkably similar careers on paper -- both spent eight seasons in pro ball and appeared in exactly six Major League games (Hottman in 1971, Jimenez in 2002). Hottman passed away in 2018, shortly before his 70th birthday.\nAmari Bartee, OF, Hope International\nRelative: Kimera Bartee (father, 6 MLB seasons)\nKimera Bartee spent 1996 to 2001 as an outfielder for the Tigers, Reds and Rockies, then found a career in coaching. He coached for the Pirates, Phillies and Tigers before his death in 2021 at age 49.\nGarrett Bevacqua, OF, Lewis-Clark State College\nRelative: Kurt Bevacqua (father, 15 MLB seasons)\nBevacqua hit .236 with 27 home runs during his 15-year stint in the Majors, primarily as a bench bat. He played for six different teams, including the Padres, for whom he came up huge with two homers in the 1984 World Series, including a go-ahead, three-run shot in San Diego’s Game 2 win.\nJordan Williams, OF, Tampa\nRelative: Reggie Williams (father, 4 MLB seasons)\nReggie Williams spent time with both the Angels and Dodgers during the 1990s, including an impressive 29-game sample in 1998 with the Angels where he hit .361 with a .949 OPS. He was a career .250 hitter in 88 Major League games.\nOwen Washburn, 2B, Wichita State\nRelative: Jarrod Washburn (father, 12 MLB seasons)\nJarrod Washburn, a second-round pick by the Angels in 1995, is probably best remembered for the role he played in the club's 2002 season in which he won his only career World Series ring and later finished fourth in AL Cy Young Award voting.\nRyan Ward, SS, San Diego\nRelative: Kevin Ward (father, 2 MLB seasons)\nKevin was a pretty classic journeyman -- drafted by the Phillies in 1983, he finally made it to the Majors as a Padre in 1991-92 and retired at the end of the 1993 season, a full decade before Ryan was born. Kevin passed away due to brain cancer in March 2019.\nBlake McGehee, RHP, Louisiana-Lafayette\nRelative: Kevin McGehee (father, 1 MLB season)\nYou'll no doubt be more familiar with Casey -- no relation, by the way -- but Kevin McGehee made five relief appearances for the 1993 Orioles, almost a decade before Blake was born.\nJevin Relaford, SS, Florida Southern\nRelative: Desi Relaford (father, 11 MLB seasons)\nThe elder Relaford, also a compact shortstop, suited up for seven different teams in his career but was at his very best with the 2001 Mets. Maybe not so coincidentally, the Mets' 2001 season ended on Oct. 7, and Jevin was born on the 8th.\nSuccess in other sports\nJosh Gibbs, SS, Forsyth Central HS (Ga.)\nRelative: Tim Gibbs (father, taekwondo practitioner)\nThe elder Gibbs is an accomplished martial artist: He’s a third-degree black belt in taekwondo. No word on how that translates to baseball.\nNoah Edders, RHP, Troy\nRelative: Mostafa Edders (father, professional soccer player)\nMostafa Edders, a native of Morocco, played for his home country’s national team from 1985 to 1993. He’s now the director of coaching for the Green-White Soccer Club in Mount Pleasant Township, Ill.\nReese Chapman, OF, Tennessee\nRelative: Colton Underwood (half-brother, former NFL player and \"The Bachelor\" contestant)\nA former defensive end for the Illinois State football team, Underwood spent time on the practice squads of the Raiders and Eagles. He starred in the 23rd season of \"The Bachelor\" and was the first Bachelor lead to come out as gay.\nLogan Sauve, C, West Virginia\nRelative: Jeff Sauve (father, 2 MiLB seasons, 2 NFL seasons)\nThe elder Sauve carved out a solid career as a dual-sport athlete. After playing both baseball and football at Clemson, he pitched in the Red Sox farm system in 1995 and 1996 -- then went on to be a kicker in the NFL, spending time on the rosters of Green Bay and Washington.\nAnson Aroz, C, Oregon\nRelative: Aaron Semas (uncle, Professional Bull Riders, Inc. founder)\nSemas helped found Professional Bull Riders, Inc., serving on the organization’s board for more than 10 years. He retired as “one of the most consistent and toughest bull riders” in the sport, earning a spot in the PBR Hall of Fame.\nGable Mitchell, SS, Iowa\nRelative: Dan Gable (grandfather, Olympic wrestler and college coach)\nGable, an Olympic gold medalist and a two-time NCAA Division I national champion, is the most recognizable name in the history of U.S. wrestling. After an illustrious college career at Iowa State -- he lost just once, in his final match -- Gable later took over as head coach at Iowa, where he led the Hawkeyes to a whopping 15 national titles.\nDevin Obee, OF, Georgia\nRelatives: Terry Obee (father, 3 NFL seasons), Charlie Jones (cousin, 4 NFL seasons)\nDevin lettered in football in high school, and football certainly runs strong in his family. His father, Terry, played parts of three seasons as a receiver in 1991 and 1993-94. Meanwhile, his cousin -- Charlie Jones -- played for the San Diego Chargers from 1996-99.\nTyler Albright, OF, Duke\nRelative: Ethan Albright (uncle, 16 NFL seasons)\nEthan spent 16 seasons in the NFL as a long snapper, earning his first and only Pro Bowl nod in 2007.\nRJ Austin Jr., SS, Vanderbilt\nRelatives: Reggie Austin (father, 3 NFL seasons), Jay Austin (cousin, 1 MLB season)\nReggie played three seasons in the NFL with the Bears from 2000-02. There’s baseball lineage in the Austin family, too, with Jay taken by the Astros in the second round of the 2008 Draft.\nHunter Hyatt, LHP, Oregon\nRelative: Charles \"Chuck\" Hyatt (great uncle, Hall of Fame basketball player)\nCharles was inducted into the Naismith Basketball Hall of Fame as a part of its inaugural class in 1959. A three-time All-American at the University of Pittsburgh, he led the nation in scoring at 12.9 points per game in 1930 and is also a member of the National Collegiate Basketball Hall of Fame.\nMike Koszewski, OF, Kansas\nRelative: Ron Sobieszczyk (grandfather, 4 NBA seasons)\nSobieszczyk played parts of four seasons in the NBA with the New York Knicks and Minnesota Lakers, averaging 8.4 points per game in his career.",
  "word_count": 3551,
  "scraped_at": "2026-02-14T13:32:59.766630"
}