{
  "article_id": "1357392a8c7e",
  "url": "https://www.prokerala.com/news/articles/a1516808.html",
  "title": "Football : Spain to play Colombia in London under shadow of corruption probe",
  "date": "20240321T204500Z",
  "domain": "prokerala.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Madrid : , March 21 (IANS) Spain will play Colombia in West Ham United's London Stadium on Friday in the first of two prestigious friendly games ahead of the UEFA Euro 2024.\nFriday's match and the game against Brazil in the Santiago Bernabeu Stadium on Monday are the only two chances that Spain coach Luis de la Fuente will have to look at new players before naming his squad for Euro 2024 at the end of the season. The game will be played in a difficult atmosphere after the police raid on the headquarters of the Spanish Football Federation (RFEF) on Wednesday, reports Xinhua.\nSpanish Civil Guards made seven arrests as part of a corruption investigation into the contracts signed when Jose Luis Rubiales was RFEF president between 2019 and 2023. Rubiales was forced to resign after kissing Jenni Hermoso in the celebrations following Spain's triumph in the Women's World Cup final in 2023.\nWednesday's police raid took place while De la Fuente's squad was preparing for Friday's match, with goalkeeper David Raya admitting at a press conference that the news had taken the players by surprise.\nIn purely footballing terms, De la Fuente will want to have a look at FC Barcelona's 17-year-old defender, Pau Cubarsi at some stage in the game, while Athletic Club Bilbao's Dan Vivian could also start, with Dani Carvajal at right-back and Alex Grimaldo on the left.\nAs for centre-forward, Gerard Moreno is back after missing the 2022 World Cup finals due to injury and the Villarreal striker could be given a chance, with Alvaro Morata favourite to start against Brazil.\nDani Olmo and Nico Williams will probably start on the wings, while in midfield, Rodri Hernandez looks to be a fixture, with Fabian Ruiz competing with Real Sociedad duo, Mikel Merino and Martin Zubimendi for a second role.",
  "word_count": 305,
  "scraped_at": "2026-02-14T14:09:33.860091"
}