{
  "article_id": "136f986524a0",
  "url": "https://www.rnz.co.nz/international/pacific-news/573453/pasifika-sipoti-in-brief-for-18-september",
  "title": "Pasifika Sipoti in brief for 18 September",
  "date": "20250918T024500Z",
  "domain": "rnz.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Rugby\nSamoa will be looking to bounce back from last weekend's Pacific Nations Cup loss when they take on Chile in the first leg of a World Cup qualification playoff.\nCaptain Michael Alaalato'a said the team will have to lift after the last two disappointing weekends of losses to Fiji and the USA.\nSamoa missed out of qualifying for the 2027 World Cup in the Pacific Nations Cup series.\nThe winner of the two-game series with Chile will qualify for the World Cup, and the loser heads to the final qualification tournament in Dubai in November.\nRugby\nFormer All Blacks Folau Fakatava and Ngani Laumape are on the 'Ikale Tahi's radar for possible inclusion ahead of the 2027 Rugby World Cup.\nHaving secured their spot two weekends ago, Tongan head coach Tevita Tuifu'a said they have held initial conversations with the two players.\nBoth are currently playing in the National Provincial Championship (NPC) in New Zealand.\nTuifu'a said they will have follow-up discussions with the duo to see what their plans are.\nLeague\nFormer Wallaby Mark Nawaqanitawase is the Rugby League Players Association Players' Rookie of the Year, for the 2025 NRL season.\nFBC reported Nawaqanitawase, who finished as the NRL's leading try scorer with 24 tries, received the award during the 100% Footy broadcast on Channel Nine.\nClint Newton, chief executive of the players' association, said Naqawanitawase has continued to elevate his game since making his debut at the end of the 2024 season.\nRugby\nTonga rugby captain Ben Tameifuna says they head into this weekend's third place play-off in the Pacific Nations Cup carrying the hopes of fans and families.\nTameifuna said the team have learned a lot from Monday morning's 62-24 semi-final loss to Japan, as they turn their attention to Canada.\nA try-scorer against Japan, Tameifuna said they are counting on Tongans in Salt Lake City, where the game will be played on Sunday morning, to turn up in numbers and support them.\nFiji and Japan will meet in the Pacific Nations Cup final later the same day.\nFootball\nAction at two Oceania football tournaments begins this weekend.\nOn Saturday, the Futsal Men's Cup kicks off in Suva, Fiji.\nDay one matches will see New Zealand take on Solomon Islands at 4pm local time, before Vanuatu squares off against Fiji at 7pm.\nThen on Sunday, the Oceania Under-19 Women's Championship kicks off in Tahiti, with Cook Islands taking on Tonga in the opening game.\nSports qualifications\nThe Oceania National Olympic Committee has announced the launch of a certificate in sports administration and a diploma in sports management, marking a step forward for the development and growth of sport across Oceania.\nThe committee said the development of both qualifications are the result of a needs assessment and mapping exercise conducted by its Oceania Sport Education Programme.\nBoth qualifications comprise nine unit standards and will be open to all interested across Oceania.",
  "word_count": 484,
  "scraped_at": "2026-02-14T12:36:51.923618"
}