{
  "article_id": "137a5c6ab036",
  "url": "https://www.thenationalnews.com/news/2025/09/23/philippines-duterte-charged-with-three-counts-of-crimes-against-humanity-by-international-criminal-court/",
  "title": "Philippine Duterte charged with three counts of crimes against humanity by International Criminal Court",
  "date": "20250923T070000Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Former Philippines leader Rodrigo Duterte has been charged by International Criminal Court prosecutors with three counts of crimes against humanity, accused of involvement in at least 76 murders as part of a \"war on drugs\" while he was mayor and president.\nA heavily redacted charge sheet dated July 4, made public on Monday, lays out the accusations against the 80-year-old former leader, currently sitting in ICC detention in The Hague.\nThe first count concerns his alleged involvement as a co-perpetrator in 19 murders carried out between 2013 and 2016 while Mr Duterte was mayor of Davao City.\nThe second count relates to 14 alleged murders of so-called \"high value targets\" in 2016 and 2017 when he was president.\nAnd the third charge is about 43 alleged murders committed during \"clearance\" operations of lower-level suspected drug users or pushers.\nThese took place across the Philippines between 2016 and 2018, the prosecution alleged.\n\"The actual scale of victimisation during the charged period was significantly greater, as reflected in the widespread nature of the attack,\" said the ICC prosecutors.\n\"The attack included thousands of killings, which were perpetrated consistently throughout the charged period,\" they alleged.\nThe charges against Mr Duterte stem from his years-long campaign against drug users and dealers, which rights groups say killed thousands.\nThe arrest warrant issued for him on March 7 contained one charge of crimes against humanity relating to 43 alleged murders.\nThe prosecutors' charges came on the eve of what was scheduled to be Mr Duterte's appearance at the ICC to hear the accusations against him.\nHowever, that sitting was postponed as the court weighs whether he is fit to hear the charges.\nHis lawyer Nicholas Kaufman has said his client is not able to stand trial \"as a result of cognitive impairment in multiple domains\".\nMr Kaufman has urged the ICC to postpone proceedings against Mr Duterte indefinitely.\nHe was arrested in Manila on March 11, flown to the Netherlands that same night and has been held at the ICC's detention unit at Scheveningen Prison since.\nAt his initial hearing, he followed by video link, appearing dazed and frail, barely speaking.",
  "word_count": 355,
  "scraped_at": "2026-02-14T12:36:34.476104"
}