{
  "article_id": "138340c3114f",
  "url": "https://www.moreechampion.com.au/story/8754683/concussion-injuries-remain-key-issue-for-afl-aflw/?cs=9310",
  "title": "Concussion injuries remain key issue for AFL , AFLW",
  "date": "20240905T124500Z",
  "domain": "moreechampion.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The extent of the AFL's concussion issue is laid bare in its latest injury report, with several staff now working full-time in the area.\nSubscribe now for unlimited access.\nor signup to continue reading\nWhile injury rates overall are down in the AFL and AFLW, serious knee injuries remain a key problem for the women's game.\nConcussion has become a key focus for sport, given the health impacts on current and retired players.\nMelbourne premiership star Angus Brayshaw was forced to retire prematurely in February because of repeated concussions.\nSeveral former AFL players are involved in looming legal action against the league, because of ongoing health problems they say stem from on-field head knocks.\nThe league's injury report on the 2023 AFL and AFLW seasons makes a point of outlining what action is being taken in concussion research and player safety.\n\"The AFL continues to invest in, and support, research into concussion,\" the league said in a statement.\n\"There have been more than 30 rule changes, and there are more than seven full time employees working at the AFL in this space, across research and education.\n\"In addition to the funding already committed, player (match review) fines accumulated across the season go directly into concussion research.\"\nUnder the AFL and AFLW concussion guidelines, the earliest a player can return to the field is 12 days.\nThat means a player with a concussion must miss at least one game.\nThe most common injuries in the AFL last season were hamstring strains, concussions, calf strains and illness.\nFor the AFLW it was concussion, ankle injuries, ACLs and shoulders.\nKnee ACLs, or anterior cruciate ligaments, have been a key issue for the various women's football codes.\nWhile the incidence of ACL injuries continues to drop in the AFLW, they remain a leading cause of missed matches - 5.44 games per club last season.\nKEY NUMBERS IN THE AFL, AFLW 2023 INJURY REPORTS\nAFL\n* 34.9 new injuries per club (2022 - 44.1)\n* Injury prevalence at its lowest for the past decade, with 135.7 games missed per club in the season\n* Hamstring strains were at 4.71 per club, with concussions at 4.26\n* Concussions resulted in 9.89 matches missed per club per season in 2023, compared with 10.56 in 2022\n* All concussions (regardless of whether a match was missed or not) remained relatively stable at 6.66 per 1000 player hours, compared with previous seasons\nAFLW\n* 12.3 new injuries per club last season, consistent with the previous few seasons\n* Injury prevalence decreased to 36 matches missed per club, compared with 46.8 in season seven\n* Overall incidence rate of concussions in matches at 5.85 per 1000 player hours in 2023 - down from previous seasons\n* Incidence of ACL injuries in matches continued to decrease, with 2.51 ACL injuries per 1000 player hours\n* ACL injuries continue to be a leading cause of missed matches - 5.44 games per club during the 2023 season\nAustralian Associated Press",
  "word_count": 497,
  "scraped_at": "2026-02-14T12:09:08.901752"
}