{
  "article_id": "13a77f468387",
  "url": "https://www.dailymail.co.uk/news/article-12413403/Good-times-never-good-Lionesses-celebrate-reaching-World-Cup-final-3-1-win-Australia-dancing-Sweet-Caroline-drinking-Fanta-Sarina-Wiegman-tells-save-energy-game.html",
  "title": "Good times never seemed so good ! Lionesses celebrate reaching first World Cup final with 3 - 1 win over Australia by dancing to Sweet Caroline ( and drinking Fanta ) - before Sarina Wiegman tells them to save their energy for the next game",
  "date": "20230816T150000Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Good times never seemed so good! Jubilant Lionesses celebrate reaching first World Cup final with 3-1 win over Australia by dancing to Sweet Caroline in their dressing room - before Sarina Wiegman tells them to save their energy for the next game\n- England's Lionesses now prepare to face Spain in the country's first FIFA World Cup final since the 1966 win\nThe Lionesses celebrated reaching their maiden World Cup final, and England's first in nearly 60 years, by dancing to Sweet Caroline today - but there were only soft drinks in sight with one more step to go on the road to glory.\nThe team's official Twitter account posted three images from behind the scenes in Sydney, following an historic 3-1 win over old rivals, Australia.\nIt was captioned 'Good times never seemed so good!' - lyrics from the Neil Diamond classic which has become something of a celebratory anthem for England in recent tournaments.\nGoalscorers Lauren Hemp and Ella Toone led the jubilant scenes Down Under - but focus was clearly already turning to Sunday's final with Spain, as the players were pictured with cans of Fanta and Coke, rather than champagne.\nBoss Sarina Wiegman was clearly keen to keep a lid on celebrations, even telling defender Lucy Bronze to 'stop jumping' and to immediately begin preparations for Sunday's showpiece final.\nThe Lionesses celebrated reaching their maiden World Cup final, and England's first in nearly 60 years, by dancing to Sweet Caroline today - but there were only soft drinks in sight with one more step to go on the road to glory\nThe team's official Twitter account posted three images from behind the scenes in Sydney, following an historic 3-1 win over old rivals, Australia\nMary Earps of England and teammates celebrate in the dressing room following victory\nBoss Sarina Wiegman was clearly keen to keep a lid on celebrations, even telling defender Lucy Bronze to 'stop jumping' and to immediately begin preparations for Sunday's showpiece final\nReflecting on her coach's speech after the game, Bronze said: 'She just spoke a bit about the game today, she knew the crowd was going to be a big thing and we could control the game and win the game the way we wanted to, we did all those things and how proud she was of us.\n'We started jumping up and celebrating she grabbed me and said 'stop jumping, you need to get ready for the next game, let the kids do it, you stand still'.'\nAustralian fans were left crying into their beers as goals for England from Toone, Hemp and Alessia Russo sealed victory and put the Lionesses 90 minutes away from lifting two major trophies in just under 13 months.\nSecond half strikes for the European champions from Russo and Hemp silenced the home crowd of 75,000 hostile fans amid a febrile atmosphere in Sydney, with Hemp's strike coming just minutes after Sam Kerr had equalised.\nEngland will now take on Spain for the trophy this Sunday at 11am UK time, after they beat Sweden 2-1 yesterday to book their trip to the final.\nThe match comes just over a year after England won Euro 2022 by beating Germany and is England's first World Cup final since the men's famous triumph back in 1966.\nThe Lionesses have clearly captured the hearts and minds of a nation once again, as all three Boxpark fan zones in London sold out eight minutes after the final whistle.\nA Boxpark spokesperson said that 2,500 tickets across their sites in Shoreditch, Wembley and Croydon sold out in under 10 minutes.\nA fan zone at Boxpark Croydon turned into an impromptu dance floor on Wednesday as the Lionesses confirmed their place in the final, knocking out the host nation.\nThe only person who seemed to be sitting down when the final whistle was heard at the south London venue was a lone Australian at the front of the zone.\nLionesses fans put children on their shoulders, danced on tables and sang football hits following the historic victory.\nEngland's Rachel Daly posted a celebratory picture, with the caption: 'Said it before, I'll say it again... I LOVE THIS TEAM!!!!!'\nGoalkeeper Ellie Roebuck shared an image from the changing room, captioned: 'World Cup finally babyyyyy'\nElla Toone's partner Joe Bunney, who himself is a professional footballer, wrote: 'Proud doesn't even come close. Love you'\nGeorgia Stanway's brother posted an image of him shushing opposition fans, with the caption 'Done the Aussies in their back yard!'\nJohn Stanway shared another picture from the stands with his sister, who commented 'crazyyyy'\nA polaroid picture of England stars Katie Zelem, Ellie Roebuck and Lotte Wubben-Moy from the changing room\nBBC presenters Gabby Logan and Alex Scott pose with the England stars Lucy Bronze (left) and Millie Bright (third left) after the match against Australia\nThere were even celebrations in the BBC gantry during coverage of the semi-final match against Australia this morning\nEngland's Lionesses roar with pride in the changing room after their incredible win over Australia today\nLioness Keira Walsh embraces former England football star Jill Scott after the dramatic victory over Australia\nThe Lionesses substitutes pounce off the bench as they celebrate the historic win against Australia today\nWinger Niamh Charles performs a celebratory dressing room boogie for her teammates in a clip posted by Laura Coombs\nGabby Logan (bottom left) shares the scene from the Lionesses' changing rooms as they celebrate the historic victory\n'Just mates chatting about being in a World Cup final': Lionesses Lucy Bronze (right) and Millie Bright (left, wearing Matilda Sam Kerr's shirt) chatting in the changing rooms\nAlison Symonds-Tayler, 65, watched England make the final at Boxpark Croydon.\nDraped in a Union flag and wearing a matching bow, the south Londoner said: 'We deserved to win. I think we dominated throughout the match and it was very exciting.\n'I just think the girls did really well. Both teams did really well. There was a fantastic atmosphere. Boxpark did a great job.\n'I feel sorry for the Matildas because I have Australian family but I think the best team won today. I think it's great to have women's sport get the credit it deserves.'\nA young England fan who also watched the game at Boxpark Croydon said it would be 'amazing for all upcoming footballers' if the Lionesses win the World Cup.\nEmily Bowen, 15, who had painted a St George's flag on her face using red glitter, told PA: 'I was actually ecstatic when the full-time whistle went. The click of reality, we're through to a World Cup final.\n'After Australia equalised it was a bit nervy they were going to come back but (the Lionesses) stayed strong... I'm buzzing.\n'We went out to France for the 2019 World Cup and then all of the Euros games last year we were at. I try to follow them everywhere and anywhere.'\nWhen asked how she will react if England win the World Cup, the Kent resident added: 'I honestly don't know. Just seeing the growth from when they won the Euros, to see that carry on, if they win the World Cup it would be amazing for all upcoming footballers, inspiring all the younger girls.'\nDani Beazley, 51, vowed to return to Boxpark Croydon to watch England hopefully win the World Cup this weekend.\nMs Beazley, from Battersea in south-west London, said: 'I will definitely be back on Sunday. I'm with my daughter and my sister. The reaction in the whole place is unbelievable. The place erupted. It was just brilliant.\n'It is a brilliant atmosphere. (The music) goes on for an hour later and everyone is still enjoying themselves and having a lovely time. We are going to stick around for a while.\n'It's a great atmosphere and Sunday will just be amazing. It will be double this. I reckon England 2-0. Fingers crossed.'\nIn today's semi-final, both sides had early chances, with a key flashpoint just seconds in as Australia got a free kick after England's Keira Walsh fouled Kerr. Then, Alex Greenwood was booked on ten minutes for fouling the Aussie forward.\nEngland opened the scoring in the 36th minute when the ball skipped past Hemp inside the area and fell at the feet of Toone, who gave Australia goalkeeper Mackenzie Arnold no chance with a strike into the top right corner.\nThe Lionesses held a 1-0 lead at half-time, while millions of England fans watched on TV back home - with some taking a few hours off work to go to a pub or having it on the background while 'working from home'.\nNiamh Charles poses with her proud family in the stands after the Lionesses' victory against the Matildas\nLionesses goalkeeper Hannah Hampton poses with her parents in an Instagram snap thanking them for their support: 'From driving me around countries as a little girl for training and matches to a World Cup final'\nEngland's footballers celebrate following victory in the Women's World Cup semi-final at Stadium Australia in Sydney today\nAlessia Russo of England celebrates with teammates after scoring her team's third goal at the World Cup semi-final today\nEngland's players celebrate winning the Women's World Cup semi-final match against Australia at Stadium Australia today\nAustralia's fans are left in tears in the final minutes of the match as they go out of the World Cup in Sydney today\nAustralia fans react as they watch the live site screening of the semi-final match at Tumbalong Park in Sydney today\nAustralian football fans react at Vauxhall Food and Beer Garden in London today while watching the semi-final\nAustralia's head coach Tony Gustavsson and Australia's Sam Kerr react to their loss at the end of the semi-final today\nEngland fans celebrate following a screening of the Women's World Cup semi-final at Boxpark Croydon in London today\nElla Toone's boyfriend Joe Bunney celebrates his girlfriend's epic win with two friends\nJoe shared a video of Lionesses fans having a good drink to celebrate the semi-final win\nAs the second half began, England had an early scare when Australia's Mary Fowler sent in an expert cross for Caitlin Foord, although she could not angle the header dangerously enough and forced a save from Mary Earps.\nAnd the breakthrough for the Matildas came when Kerr scored a delightful goal in the 63rd minute after picking up the ball just inside the Australia half. She ran and ran before releasing an arrow-like long-range strike into the net.\nBut England retook the lead when Millie Bright sent a perfect long ball from the backline up to a running Hemp, who picked it up with ease, sneaked through the defence, drew out Arnold and fired into the goal in the 71st.\nAnd, 15 minutes later, Hemp slipped through the Matildas to pick out Russo on the edge of the box, who made it 3-1 in the 86th minute. England then saw out the rest of the match, including six minutes of injury time at the end.\nBronze was overwhelmed after the game, telling the BBC: 'This is the one thing I've always wanted, to be in the final of a World Cup and after two times of getting such disappointment, I honestly can't believe it.'\nWhen asked what manager Sarina Wiegman said, Bronze said: 'We played the game how we wanted to, we were resilient, determined, I couldn't hear much else she was saying to be honest!\n'We knew the crowd were going to be crazy tonight and she was saying about silencing them and I feel like we did that at the end after the third goal.'\nEngland fan parks - especially the Boxpark sites across London - had erupted after the Lionesses' first-half goal. Although the morning kick-off appeared to dampen the enthusiasm to send beers flying in the air following Toone's strike, one fan at BoxPark Croydon in South London was seen throwing his child in the air in delight.\nCricket fans also took great delight in the Lionesses taking the lead, with the Barmy Army tweeting: 'England lead the 6th test match'. England cricket captain Ben Stokes also appeared to enjoy the goal and tweeted 'lol'.\nEarlier, the national anthems for both teams were impeccably observed before kick-off, with a small section of England fans present amid a sea of gold and green shirts across the stadium.\nIt comes after England received a good luck message from David Beckham, his daughter Harper and England and Manchester United ace Marcus Rashford. There has also been an outbreak of banter between the two nations, after Aussies stole England fans' seats and sent up a helicopter to watch a training session.\nChants of 'it's coming home' rang out across venues and pubs as it became clear England were one step closer to lifting the trophy\nFans were jubilant as Alessia Russo made it 3-1 against Australia in the 86th minute\nAn Australia fan watching the game at the FIFA Fan Festival in Sydney - as it became clear that the Matildas weren't getting through to the final\nEngland fans celebrating after the Lionesses' victory was official at BOXPARK Croydon\nWomen's footballers (left-right) Poppy Pattinson, Millie Turner and Lucy Staniforth cheer as England make it 3-1 against Australia\nEngland fan Helen Mayhew celebrating Alessia Russo's third goal at BOXPARK Wembley\nAn England fan takes a selfie to remember after the full-time whistle is blown, propelling England into a final showdown against Spain\nLauren Hemp's goal sent fans to their feet screaming as venues across the country - like BOXPARK Wembley - screened the game on huge displays\nEngland fans went wild as Lauren Hemp scored in the 70th minute to take England up 2-1 against Australia, just minutes after the Aussies equalised\nEngland fans went wild as they celebrated Ella Toone's powerful drive into the top corner that put the Lionesses up 1-0 against Australia\nAn England fan during a screening of the FIFA Women's World Cup 2023 semi-final between Australia and England at BOXPARK Wembley, London\nEngland fans at the Croydon Boxpark in South London enjoy watching the Women's World Cup semi-final today\nEngland fans celebrate the opening goal during a screening of the match at Boxpark Wembley in London\nYoung England fans celebrate during a break at a training day in Stockport today while they watch the game\nFans in the Boxpark Shoreditch in East London watch as England take the lead in the match today\nEngland received a hostile welcome as they tried to end the Matildas' dream of World Cup glory on home soil - and were booed as they walked onto the pitch.\nAustralia has been in a celebratory mood this summer, having already retained the Ashes and won the Netball World Cup at the expense of the old enemy.\nAnd the exploits of their footballers in the Women's World Cup in recent weeks had further galvanised a nation which revels in its sporting rivalry with England .\nFor the English, memories are still fresh in the mind of Alex Carey's controversial stumping of Jonny Bairstow in the second Test at Lord's, which prompted booing and chants of 'Same old Aussies, always cheating' for the remainder of the series.\nEngland fans with the 'FreeLionesses' supporters group gathered in front of Sydney Opera House today, with some joking that there is 'no rivalry, it's not cricket'.\nOthers said the team were going to 'bring it home' and 'it's absolutely coming home', referring to the song Three Lions by Baddiel, Skinner and The Lightning Seeds.\nIt comes as the England team found themselves on the receiving end of a bizarre spying controversy after a training session was photographed from a helicopter.\nMeanwhile, tickets intended for England fans were bought up by Australians after a unique Lionesses code for an allocation of 1,970 was leaked on social media.\nA post on the Football Association's website said the access code 'Lioness' was exclusively for England fans.\nBut several Australian supporters managed to buy tickets in their opponents' section of the stadium and bragged they would be 'wearing Matildas' shirts.\nMost watched News videos\n- Extraordinary moment mass brawl breaks out between Brits on flight\n- Finance expert's TV interview interrupted by adorable granddaughter\n- Moment driver veers to target e-bike riders before killing teen\n- Moment Swiss bar fire owners collapse after being confronted\n- Chilling police interview of ISIS fanatic plotting UK attack\n- Astonishing moment a street is swallowed by a sinkhole\n- Israeli hostage reveals how she survived being tortured\n- Deepak Chopra confronted over his relationship to Epstein\n- Food vlogger dies after 'eating toxic devil crab'\n- Spy cam shows woman on her knees next to Jeffrey Epstein\n- New video shows man with backpack similar to Guthrie kidnapper\n- Toddler opens car door in traffic and sends biker flying",
  "word_count": 2804,
  "scraped_at": "2026-02-14T13:26:19.511587"
}