{
  "article_id": "13c7de14a1b8",
  "url": "https://www.espn.com/soccer/fifa-womens-world-cup/story/4882118/womens-2023-world-cup-playoffs-haiti-paraguay-impress",
  "title": "2023 Women World Cup playoffs : Haiti , Paraguay impress",
  "date": "20230220T034500Z",
  "domain": "espn.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "With all four Women's World Cup playoff semifinals done and dusted and the three finals set for Feb. 22 and 23, here's what we learned from the semis and who can still book their spot in this summer's World Cup.\nGROUP A\nCameroon 2-0 Thailand: Lionesses roar into final\nCameroon needed to lean on their more experienced players in order to get the job done against a veteran Thai squad. Although on top in the tie, the Indomitable Lionesses couldn't tip things in their favour until 33-year-old Gabrielle Onguene stepped onto the pitch to link up with 30-year-old forward Ajara Nchout. Onguene's two goals in three minutes towards the end of the second half ultimately made the difference.\nDespite getting the job done, Cameroon did struggle at times against a resilient Thai team -- with Portugal up next, they're likely to lose unless they can hit the ground running from the beginning and put in a complete performance. The Lionesses are further hampered by the suspension of their first-choice goalkeeper, Ange Bawou, as neither of her understudies boast much experience on the international stage.\nA long way from being the weakest side in the Asian confederation, Thailand again showed their experience and ability to play, yet as we have often seen from Chaba Kaew, they tend to fall short against teams with more depth.\nUp next: Cameroon vs. Portugal, Feb. 22 -- the winner joins USA, Netherlands, Vietnam in Group E of the World Cup\nGROUP B\nSenegal 0-4 Haiti: Les Grenadières reign supreme\nSomewhat of a new face in the African women's football world, Senegal battled well against a more experienced Haiti team, ultimately succumbing to what was the better team on the day. Haiti led 1-0 at the break and scored three times in 11 second-half minutes to put things beyond doubt.\nStill just a young nation on the world stage, Haiti had the advantage of several players who are in the French domestic league, with forwards like Nerilia Mondesir and Sherly Jeudy showing their quality when it mattered against Senegal. Haiti will be considered underdogs against an established Chile side that just suffered a heavy friendly loss against Argentina, though they have just the right balance of pluck and guile to advance.\nFor Senegal, however, over the course of their qualifying campaign, the West African nation showed they are a new force in the region. Although their bid for a spot at this summer's World Cup fell short, they'll be a nation to watch moving forward.\nUp next: Chile vs. Haiti, Feb. 22 -- winner joins England, Denmark and China in Group D in the World Cup\nGROUP C\nChinese Taipei 2-2 Paraguay: Paraguay's resilience pays off\nThe match of the round was, unquestionably, the blistering draw between Chinese Taipei and Paraguay in a see-saw face-off that looked like it could go either way before an unmissable penalty shootout with multiple twists and turns along the way.\nInitially struggling against a more experienced Taipei side, Paraguay grew into the game and, just when it looked lost at 2-0, they hit their opposition for a quick-fire double to restore parity, with Dulce Quintana playing a starring role. With intelligent play, La Albirroja found their footing well and seemed unfazed by the chaotic nature of the game, refusing to give up to the point of seeing out extra time with only 10 players on their pitch due to injury.\nA long way from being an established power in CONMEBOL, Paraguay (like Senegal in Group A) have shown their intent and ability throughout qualifying and could yet become as a key player in the region. However, for their final, the squad will have to recover from the two hours and 20 minutes (including stoppage time) they played on Sunday afternoon and any lingering fatigue could be costly in their pursuit of a World Cup berth.\nAlthough historically a strong team in their region, Chinese Taipei have often dwarfed been by the other nations at the top end of Asian qualifying in recent years, reduced to fodder for the likes of Japan and Australia. However, the first 78 minutes of their semifinal showed some of the best they have to offer -- just like completely losing control of the game after going 2-0 up showed some of their worst. Yet, their grit all the way to spot-kicks bodes well for the future.\nLike so many of the teams in these intercontinental playoffs, it feels very much like Chinese Taipei aren't going to concede the ground they made in their attempts to reach the World Cup.\nPapua New Guinea 0-2 Panama: Canaleras ease into final\nDespite having a narrow advantage over their opposition in the rankings, the challenge for Papua New Guinea was always going to be a tough one and with so much recent upheaval off of the pitch, there is certainly an argument to be made that fans didn't get to see the best prepared side. However, they were clearly second-best against Panama, failing to carry much of an attacking threat. In a sense, it felt like the game was all but lost once Panamanian midfielder Marta Cox opened the scoring after just 12 minutes.\nNot the most flamboyant team in CONCACAF, Panama still managed to display some flair in New Zealand, dominating the possession from the get-go and scoring two stylish goals along the way. Although the Canaleras didn't have to be at their best against their struggling opposition, they put in a confident 90-minute performance to rubber-stamp their quality.\nAs ever in play-off group C, there is an unpredictability in the air over the final, with it hard to call an early winner. That said, with 50 fewer minutes in Panama's legs, there may only be one winner if they can start quickly.\nUp next: Paraguay vs. Panama, Feb. 23 - winner joins France, Jamaica and Brazil in Group F of the World Cup",
  "word_count": 986,
  "scraped_at": "2026-02-14T13:03:21.204968"
}