{
  "article_id": "13d341be3540",
  "url": "https://www.islingtontribune.co.uk/article/hayes-fears-pitches-leaving-womens-game-out-in-cold",
  "title": "Hayes fears pitches leaving women game out in cold",
  "date": "20230127T170000Z",
  "domain": "islingtontribune.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Hayes fears pitches leaving women’s game out in cold\nChelsea boss saw her side’s home match against Liverpool abandoned after six minutes\nFriday, 27th January 2023 — By Steve Barnett\nEmma Hayes [Pedro Soares/SPP]\nEMMA Hayes is calling for a more level playing field between the Premier League and the top-flight of the women’s game when it comes to tackling bad weather.\nChelsea saw their home match against Liverpool in the Women’s Super League (WSL) abandoned after six minutes on Sunday due to a frozen pitch, while Arsenal’s trip to Brighton & Hove Albion was postponed just after 4pm on the same day – some two-and-a-half hours prior to kick-off. It caused outrage among supporters of women’s football, with Arsenal’s Vivianne Miedema and Beth Mead among those expressing their dismay.\nUnlike a number of Premier League and Championship stadiums, the majority of WSL grounds don’t have undersoil heating, and Hayes believes that is something that must change. The Chelsea boss, who grew up in Camden Town, said: “There is no doubt that up and down the country, frozen pitches are cancelling games in every league outside the Premier League, so these things happen.\n“But the WSL is the top division in the women’s game as far as I’m concerned and should be afforded the same access and opportunity that is there at the top division of the men’s game.\n“The WSL is the same level as the Premier League – just because we’re women, it doesn’t mean we shouldn’t be afforded the same access.\n“As far as I’m concerned this isn’t about Chelsea, it’s about women’s football and being in a place where we’re working hard to build a fanbase, to build a business, and all of those things without equal access to things for many years.\n“Undersoil heating is not environmentally friendly, so an environmentally friendly option for football pitches in an ideal world so that we can play in a top division is what I think we can all expect. Let’s hope we can continue to work towards that.”",
  "word_count": 341,
  "scraped_at": "2026-02-14T12:21:34.312988"
}