{
  "article_id": "13d8038c2683",
  "url": "https://news.yahoo.com/predicting-england-women-world-cup-063850607.html",
  "title": "Predicting England Women World Cup squad : Who on the plane and who could miss out ? ",
  "date": "20230531T074500Z",
  "domain": "news.yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Predicting England’s Women’s World Cup squad: Who’s on the plane and who could miss out?\nEngland manager Sarina Wiegman is set to name her squad for this summer’s World Cup in Australia and New Zealand, where the Lionesses will look to add to their Euros triumph with the game’s biggest prize.\nWiegman’s side will be among the favourites as England aim to win the World Cup for the first time, but the Lionesses have been rocked by the news that captain Leah Williamson has been ruled out of the tournament after rupturing her anterior cruciate ligament.\nSuddenly, the England manager could be without a core of players who started for the Lionesses at the Euros last summer, which puts pressure on having the right depth throughout the squad.\nAnd with Wiegman naming her squad today following the end of the domestic season, time has run out for players on the fringes of Weigman’s plans to stake their claim.\nSo ahead of the World Cup, who’s on the plane to Australia and New Zealand, and who’s hasn’t done enough to make the squad?\nBoarding cards printed\nKeira Walsh\nArguably the most valuable player in England’s squad, given her skillset at the base of the midfield. Player of the match in the Euros final, which helped convince Barcelona into paying a world record fee for her services last August. England simply don’t have another player like her.\nMary Earps\nEngland’s No 1 became World No 1 when Earps picked up the award for goalkeeper of the year at the Fifa Best ceremony last month. The 29-year-old was one of England’s standout performers at the Euros and although she made a rare mistake in the Finalissima, Earps was the hero in the penalty shootout.\nAlex Greenwood\nThe Manchester City defender wasn’t a starter during the Euros but looks to have claimed the left back spot now Rachel Daly is being played up front. England have since looked more balanced and Greenwood was excellent at the Arnold Clark Cup. Can also play centre-back, where she started in the Finalissima with Bright unavailable, and that’s where she may start with Williamson ruled out.\nGeorgia Stanway\nAnother who started every game throughout the Euros, the midfielder took a chance and joined Bayern Munich last summer after deciding to leave Manchester City. She has since established herself as one of the German club’s most important players and played a key role as Bayern beat Wolfsburg to the Bundesliga title.\nElla Toone\nThe inventive Manchester United midfielder played the role of super sub during the Euros but looks to have forced her way into Wiegman’s starting line-up ahead of the World Cup. One of England’s goalscorers in the Euros final, Toone faded towards the end of the campaign as United were beaten by Chelsea in both the WSL title race and FA Cup final.\nLauren James\nCould it be that England’s best player wasn’t even at the Euros last summer? James looks set to be one of the stars of the World Cup and has made an excellent start to her England career. The 21-year-old Chelsea winger won player of the tournament as England retained the Arnold Clark Cup.\nRachel Daly\nFrom England’s left back at the Euros to England’s striker at the World Cup? Daly scored an astonishing 22 goals for Aston Villa in the Women’s Super League to win the Golden Boot, and WSL player of the season. Her two-goal display against Italy in February gave Wiegman a selection headache but started on the bench in April’s double-header.\nAlessia Russo\nSubject to a world record transfer bid from Arsenal in January, the Manchester United striker now faces a battle with Daly to be Wiegman’s No 9. Russo has hit 11 goals for England in just 21 appearances, including that back-heel against Sweden, but struggled slightly against Brazil and Australia.\nChloe Kelly\nScored England’s winning goal in the Euros final but is set to play a bigger role during the World Cup. She had only recently returned from an ACL injury last July but has been in full flight this season for Manchester City. Outstanding on the left wing during England’s Arnold Clark Cup defence.\nLauren Hemp\nThe Manchester City winger was hyped as England’s breakout star ahead of the Euros and remains an exciting talent, but there is a chance Kelly and James have moved ahead of her in the pecking order. Although her place in the squad is safe, the 22-year-old faces a battle to take back her place in the team.\nAlmost there\nMillie Bright\nEngland’s vice-captain and one of Wiegman’s most important players has not played since March after suffering a knee injury playing for Chelsea in the Champions League. The centre-back was forced to pull out of April’s matches against Brazil and Australia but Emma Hayes expects her to recover in time for the World Cup.\nLucy Bronze\nAnother injury concern. Bronze has not played since undergoing keyhole surgery on her knee but the Barcelona right back is expected to be fit for the World Cup. Following the retirements of Jill Scott and Ellen White from last summer’s squad, Bronze is England’s most experienced player with 102 caps and remains one of the best in the world in her position.\nJordan Nobbs\nThe 30-year-old missed out on the Euros due to injury, but the decision to end her 12-year stay at Arsenal in January and join Aston Villa with the hope of getting more game time ahead of the World Cup has been an inspired one. That said, there is still a question over whether Wiegman is fully convinced: Nobbs didn’t play a minute against either Brazil or Australia.\nJess Carter\nThe versatile defender is one of Chelsea’s most consistent performers and is a huge asset to Wiegman due to her ability to play across the back four. Came straight back into the Arnold Clark Cup squad after missing the November internationals due to injury.\nLotte Wubben-Moy\nThe Arsenal defender is a key figure in the squad and was therefore a surprise omission ahead of the friendlies against Brazil and Australia - although she later replaced the injured Millie Bright. The 24-year-old was the “driving force” behind the Lionesses’ Euros legacy push, coming up with the idea to demand equal access to sport for girls in school and seems a natural replacement for her Arsenal team-mate Williamson in the squad.\nMaya Le Tissier\nA former England captain at Under-23 level, the Manchester United defender has impressed since stepping up to the senior side following the Euros. The 20-year-old is a ball-playing centre-back who is also comfortable at full-back, which is where she played at the Arnold Clark Cup.\nKatie Robinson\nLike Le Tissier, Robinson made the step up from Under-23 level to make her debut in November. Caught the eye with a couple of busy displays on the right wing at the Arnold Clark Cup, but faces a tougher challenge than Le Tissier for selection given the other attacking options available to Wiegman. The Reading forward may make it if Beth Mead is not fit.\nNiamh Charles\nAnother versatile defender, Charles came back into contention in November after being one of those to be cut from the preliminary Euros squad. Her inclusion may depend on how many defenders Wiegman decides to take to Australia, with Greenwood and Daly also able to cover left back.\nEllie Roebuck\nThe goalkeeper is clearly back-up to Earps but remains a solid number two for England. Wiegman may give Roebuck minutes in friendlies before the World Cup, but there’s no doubt Earps will be first choice when the tournament starts.\nOn the fringes\nBeth Mead\nMead is “ahead of schedule” in her ACL injury recovery and still working towards the summer’s World Cup. Mead, who claimed the Golden Boot and player of the tournament award when the Lionesses won the Euros on home soil last year, has been sidelined since sustaining the injury while playing for Arsenal in November. In March, Wiegman said Mead was at that point “not in our plans” for the World Cup, adding: “If a miracle happens and she goes so fast (in her recovery), then we will reconsider it – but at this moment I don’t expect that.”\nLaura Coombs\nThe Manchester City midfielder earned a first England call-up in over two years when Wiegman selected her for the Arnold Clark Cup. The 32-year-old was as surprised as anyone to return from the international wilderness. She has given herself a chance to make the World Cup and kept her place ahead of April, but didn’t play against Brazil or Australia.\nKatie Zelem\nThe Manchester United captain has been one of the top midfielders in the WSL for Marc Skinner’s league leaders this season, but missed out on April’s squad despite making the past three groups since the Euros. Zelem was on the standby list for the Euros but didn’t make the cut, and there is now work to do to make the World Cup. Faces a battle with Coombs for a place.\nBeth England\nEngland took the chance on a January move, leaving Chelsea for struggling Tottenham, and scored 12 goals in as many games over the second half of the season. The striker couldn’t have done much more - but was left out of April’s squad for the second successive international break despite her form for Spurs.\nNikita Parris\nThe 71-cap forward was another high-profile casualty of the Arnold Clark Cup squad, and has not been given another look since. Although she is playing consistently for an impressive Manchester United side, Parris has missed out on recent squads due to a lack of goals. Improved form over the final weeks of the season may sway Wiegman’s mind.\nEsme Morgan\nTipped by Manchester City manager Gareth Taylor as a future England captain, and Morgan returned to the squad for April despite being left out of the Arnold Clark Cup in February. Injury disrupted her 2021-22 season but Morgan has been in impressive form since. The versatile 22-year-old started alongside Williamson against Australia, but England weren’t as defensively secure as usual.\nJess Park\nWiegman had a look at the 21-year-old during the Arnold Clark Cup. She started in midfield against Italy and although she only lasted until half time, Park’s selection for fixtures against Brazil and Australia was a huge vote of confidence. Definitely one for the future, but certainly among consideration for now - particulary with Fran Kirby out of the World Cup. May be England’s wildcard - but a should injury ended her season early.\nLucy Parker\nThe West Ham defender was given the chance to make her England debut against Brazil and Australia with a recall to the Lionesses squad, but her wait for a first cap goes on after remaining on the bench. Parker was also selected in October, but had to withdraw due to injury.\nEbony Salmon\nThe striker made the all three England squads post-Euros but missed out on April’s fixtures. The 22-year-old wants to be England’s No 9 but is currently behind the more established Russo and Daly in the pecking order. There is not enough room for all three.\nHannah Hampton\nThe goalkeeper was dropped by England after the Euros due to “personal issues” but is now back in the Lionesses fold. Wiegman appears to be confident that the problems that arose off the pitch last year have been resolved.\nLonger shots\nSteph Houghton\nThe former England captain was left out of Wiegman’s Euros squad following an injury-hit season with Manchester City, and has not been given a look in since. Wiegman admitted it is unlikely Houghton will make the World Cup after the 34-year-old gave an interview to the BBC where she said she has not given up hope of being selected. Her chances could have improved after Williamson’s injury, should Wiegman look to replace her current captain’s experience.\nGabby George\nThe WSL’s player of the month for January was another notable absentee from the Arnold Clark Cup squad when it was named the following month. The Everton defender received her first call up in November but another now looks unlikely, despite her club form.\nDemi Stokes\nStokes was one of the most experienced players in the Euros squad but illness and injury have limited the defender’s WSL appearances for Manchester City this season.\nLucy Staniforth\nLike Nobbs, Staniforth joined Aston Villa in January in a bid to make the World Cup squad. The former Manchester United midfielder has not made an England squad since being included on the preliminary list for the Euros, where she was cut from the final 23.\nAshleigh Neville\nIt’s a subject of much debate that the Tottenham defender has yet to be given a look in by England, despite being included on the six-name shortlist for WSL player of the season last year. Unfortunately for Neville, that does not look set to change in 2023.\nLeah Galton\nThe in-form Manchester United forward scored 10 goals in the WSL this season, but has no plans to make herself available for international selection. Galton asked not to be selected by England after a call-up in 2019 and the 28-year-old says she is happy with the “balance” in her life without international football.\nMillie Turner\nThe centre-back was sidelined for six months last season due to an artery issue, but returned at the start of this campaign and was excellent in the heart of defence for Manchester United. She has still yet to make an appearance for England, or, like club team-mate Hannah Blundell, receive a call-up from Wiegman.\nOut\nLeah Williamson\n“Unfortunately the World Cup and Champions League dream is over for me and everyone will think that’s the main focus, but it’s the day to day of what I’m about to go through that is the most draining of my thoughts,” said a devastated Williamson after the worst possible news was confirmed. The captain went down in pain 12 minutes into Arsenal’s defeat to Manchester United and her club confirmed she had suffered a ruptured anterior cruciate ligament. A devastating blow.\nFran Kirby\nAnother huge blow. England had hoped to give Kirby time to rehabilitate after sustaining a knee injury sustained in February, but the Chelsea star has said there will not be enough time to make it back for the World Cup as she now requires surgery. “Unfortunately after a few months of rehab the decision has made that I will require surgery on my knee,” she said. “I have been trying my best to not have to undergo this but unfortunately my progress has been limited due to the issue in my knee. I’m absolutely gutted to announce my season is over and I will not be able to make the World Cup in the summer.”\nSandy MacIver\nThe goalkeeper, who has been a fixture of recent squads, has made herself unavailable for selection due to injury.\nPredicted England’s World Cup squad\nGoalkeepers: Mary Earps, Ellie Roebuck, Hannah Hampton\nDefenders: Lucy Bronze, Alex Greenwood, Millie Bright, Lotte Wubben-Moy, Jess Carter, Niamh Charles, Esme Morgan, Maya Le Tissier\nMidfielders: Keira Walsh, Georgia Stanway, Ella Toone, Jordan Nobbs, Laura Coombs, Katie Zelem\nForwards: Chloe Kelly, Alessia Russo, Lauren Hemp, Lauren James, Katie Robinson, Rachel Daly",
  "word_count": 2546,
  "scraped_at": "2026-02-14T12:21:46.923067"
}