{
  "article_id": "13dcd9873f77",
  "url": "https://www.standard.net.au/story/8318329/defending-champs-fully-focused-on-fresh-flag-challenge/",
  "title": "Nirranda ready for 2023 WDFNL semi - final netball clash against Merrivale | The Standard",
  "date": "20230823T040000Z",
  "domain": "standard.net.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A fully-fit Nirranda presents a scary challenge for all contenders.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe reigning premier has yet to field its full nine this season through injury or unavailability, with coach Lisa Arundell hopeful of having a complete line-up at her disposal for its first final on Saturday.\nThe Blues, who finished the 2023 season minor premiers, start their Warrnambool and District league finals campaign with a second semi-final against Merrivale.\nAfter reaching the pinnacle in last year's grand final, Nirranda had to retool for its premiership defence, integrating the likes of Keele Hillas and Montana and Bella Wallace into its top line-up following the retirement of defender Katie Ryan and departure of goalie Chelsea Quinn.\nDespite losing two premiership names, the Blues remain littered by big-name players.\nArundell praised defender Cloe Marr for \"a stand-out\" season, while the likes of reigning Wilma Wallace medallist Jo Couch, Steph Townsend and Amanda Gilbert dominate their positions.\nGilbert, in her second year at Nirranda, surpassed 800 goals this season after consolidating her shooting combination with Townsend. Experienced defender Lisa Anders hasn't played as many games this season but will be available for finals.\n\"Having the players from last year, I know what they're capable of,\" Arundell said.\n\"The strength in those players comes across the whole court and the other players slot in nicely within that and rise to that occasion.\n\"For the likes of Bella Wallace, to be able to come in and play, she's surrounded by Jo Couch, Cloe Marr, Steph Townsend and Amanda Gilbert - as a junior coming through the ranks and in her first year of senior netball that's a great set-up to have around you.\n\"She (Bella) has grabbed that opportunity and just ran with it as have the others.\"\nArundell revealed her team hadn't spoken about last year's premiership success when approaching the 2023 season.\n\"Apart from the experience of last year, there is not much else that we can carry over from last season,\" she said. \"It became a new focus.\"\nSaturday will resume an intense rivalry between the Blues and Tigers - with both sides the competition benchmark since 2019.\nThe Tigers got the better of the Blues in their most recent encounter in July, though Arundell believes her side has addressed the issues highlighted from that match-up.\nNevertheless, Arundell is well aware of the challenge the Elisha Sobey-coached Tigers present on any given day.\n\"We know what a quality outfit they are and how much they'll keep coming back,\" she said. \"Watching them Saturday (in a qualifying final) they're playing some really good netball. We won't be taking anything for granted.\"\nArundell revealed the Blues stayed sharped with a practice match and a Saturday training session during their week off, and had reset for finals which present a \"different ball game\".\n\"Finals present an unique game to what you actually play during the season,\" she said. \"The level of pressure is just so much more intense.\"\nOur journalists work hard to provide local, up-to-date news to the community. This is how you can access our trusted content:\n- Bookmark https://www.standard.net.au/\n- Make sure you are signed up for our breaking and regular headlines and newsletters\n- Follow us on Facebook, Twitter, Instagram and LinkedIn\n- Tap here to open our Google News page\n- Join our Courts and Crime Facebook group and our dedicated Sport\n- Facebook group\n- Subscribe",
  "word_count": 575,
  "scraped_at": "2026-02-14T12:56:13.156678"
}