{
  "article_id": "14245d5ee630",
  "url": "https://www.offalyindependent.ie/2025/03/31/mondays-briefing-manchester-city-and-aston-villa-book-fa-cup-semi-spots/",
  "title": "Monday briefing : Manchester City and Aston Villa book FA Cup semi spots",
  "date": "20250331T151500Z",
  "domain": "offalyindependent.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Monday’s briefing: Manchester City and Aston Villa book FA Cup semi spots\nBy PA Sport Staff\nManchester City boss Pep Guardiola saluted his senior players after seeing them drag the club to a seventh FA Cup semi-final on the trot.\nThere was cup joy too for Marcus Rashford as his first goals for Aston Villa helped to book a place in the last four at the expense of Sky Bet Championship Preston.\nElsewhere, it proved a more difficult day for Chelsea Women’s skipper Millie Bright and AC Milan midfielder Ruben Loftus-Cheek for very different reasons.\nPep Guardiola felt his “legendary” Manchester City players rediscovered their “heart” after they came from behind to sink Bournemouth 2-1 and reach a seventh consecutive FA Cup semi-final.\nSecond-half goals from Erling Haaland and Omar Marmoush booked City a last-four clash with Nottingham Forest after they trailed to Evanilson’s tap-in at the break with senior stars Kevin De Bruyne, Ilkay Gundogan, Bernardo Silva and Mateo Kovacic playing key roles.\nGuardiola said: “I spoke with the team at half-time so we are good. We are in your hands. We conceded just one shot on target. That means how Bernardo, Kova, the senior players, the legendary players that give the most incredible things in the club, they make a step up again and made an excellent performance.\n“I’m really pleased to be back at Wembley for a seventh time in a row. An incredible achievement.”\nMarcus Rashford is confident his best is still to come after firing Aston Villa into the last four with his first two goals for the club.\nThe on-loan Manchester United forward struck twice in the space of five second-half minutes to set up a comfortable 3-0 victory for the Midlands outfit in their quarter-final at Preston.\nThe 27-year-old England international, who is out of favour at Old Trafford, told the BBC: “It’s a great feeling. I feel like I’ve slowly been getting fitter and playing better football since I’ve been here.\n“It’s obviously nice for a forward to get a goal so hopefully, it continues. I think I can still get fitter. I missed a lot of football before joining up with them. At the minute my body feels good, I’m injury free and I’m enjoying my football.”\nChelsea head coach Sonia Bompastor admitted Millie Bright was “exhausted” after the captain was taken off at half-time during the Women’s Super League leaders’ 2-2 draw with West Ham.\nEngland defender Bright, who played every minute of the marathon four games in 12 days against Manchester City over the previous two weeks, came off with Chelsea leading 2-1, an advantage which was later cancelled out by Shekiera Martinez’s stoppage-time equaliser.\nBompastor said: “I don’t have any regret. My job is to make sure we try and win every game. With a really intense block [of games] I was trying to protect some players. It’s important to protect players’ health.\n“Millie was just exhausted. This game was a quick turn-around. I think sometimes maybe people don’t realise. There is a mental and physical aspect.”\nRuben Loftus-Cheek missed AC Milan’s 2-1 Serie A defeat at Napoli on Sunday evening after being rushed to hospital for emergency surgery.\nThe 29-year-old midfielder, who began his career at Chelsea, underwent a laparoscopic appendectomy after becoming ill during the build-up to the game.\nA statement on the club’s official website said: “AC Milan can confirm that Ruben Loftus-Cheek underwent laparoscopic appendectomy surgery today due to acute abscessed appendicitis.\n“The operation, which was performed by Professor Francesco Corcione and his team, went perfectly to plan.”\nOn Tuesday evening, Monday sees a series of Premier League clubs holding preview press conferences for matches.\nArsenal boss Mikel Arteta will face the media ahead of a home clash with Fulham at 11am, while Manchester United counterpart Ruben Amorim is due to follow suit at 1:15pm as he prepares for a trip to high-flying Nottingham Forest.\nForest head coach Nuno Espirito Santo, West Ham’s Graham Potter, Fulham boss Marco Silva and Vitor Pereira of Wolves will also be up, and Leicester’s Ruud van Nistelrooy and Ipswich’s Kieran McKenna will look ahead to Wednesday's fixtures.",
  "word_count": 689,
  "scraped_at": "2026-02-14T12:43:37.398275"
}