{
  "article_id": "1429c0accab5",
  "url": "https://www.sounderatheart.com/2024/06/valkyratings-cast-before-the-current-edition/",
  "title": "Valkyratings : Cast under the Current edition",
  "date": "20240616T180000Z",
  "domain": "sounderatheart.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "I ended the last edition of this column with a cautiously optimistic signoff.\nAs of this writing, the game has just kicked off. Go Reign. Let's turn our season around here.\nI regret to report that we did not, in fact, do that.\nAfter a first half that was messy as fuck but featured a Jordyn Huitema brace, actually having a lead for a few minutes, and ended on even terms at 2-2, the game was not by any means In Hand, but the vibes were genuinely decent. The Reign had, sure, absolutely biffed it defensively – twice – but they were also creating chances, punching with the class of the league, and getting service to a hungry Huitema with pep in her step and pure determination to get her head on that ball.\nUnfortunately, the second half also happened. And while the Reign have had their share of matches this year where they were in it, where they could – should! – have taken points from it, and where they can definitely feel hard done or unfortunate about the final result, this was not one of them.\nThis was an abject and unconditional surrender.\nThe Reign are now 2-1-9. The season is not yet mathematically lost, but it's awfully damn close. The ownership situation remains unresolved. The bright spots seem fewer and farther between. And while we were born in the Furt, molded by it, it has not been our ally.\nSo here we go again.\nGoalkeeper\nLaurel Ivory – 3\nThe good. Some of it wasn't her fault. A quality 19th minute save on Temwa Chawinga kept the game scoreless.\nThe bad. A whole lot of it was her fault. On the 45'+2 goal by Lauren, she allowed a ball that was entirely hers to claim to simply drop, uncontested in the six yard box while meekly retreating to her goal line. This was a pattern, incidentally – Ivory did not stop a single one of the 14 crosses she faced, and frequently failed to even challenge for balls in the air. The keeper cannot be the most tentative player in the air in her own six. In the 67th minute, isolated against Michelle Cooper, she couldn't decide between retreating and trying to make the save or coming out aggressively to cut off the play, and wound up doing neither, coming out aggressively too late and giving up a well-earned penalty and a caution where she was, frankly, fortunate to only give up a penalty and a caution.\nGoing forward. Being able to make the big save only really matters when you're actually making the big save, and after an electric start in goal, Ivory's struggled to do so the last few matches. Coupled with fatal indecisiveness in big moments, she's been making a strong argument for Claudia Dickey to resume starting duties as soon as possible.\nDefense\nSofia Huerta – 4\nThe good. The service was pretty good, probably as good as it's been all season. She set up Jordyn Huitema for a solid opportunity in the 3rd minute, found Veronica Latsko for the hockey assist on Huitema's opening 24th minute goal, picked up Bethany Balcer for a half chance from the top of the box in the 52nd, and had her footprints on two of the four decent looks the Reign generated in second-half stoppage time, desperately chasing even the slightest gasp of a positive note to finish on. With six clearances and two tackles won, she actually turned in some defensive intensity on a night when nobody had all that much of it.\nThe bad. Roasted with the entire rest of the backline in the 28th. An absolutely passive spectator in the 45'+2. Caught watching again in the 46th. Ran hard but simply could not get back in position in the 47th. The midfield was outnumbered, outworked, and overrun, but the back line got eviscerated by simple balls and straight line speed again and again, and Huerta was little help.\nGoing forward. One thing right, but two more wrong.\nAlana Cook – 2 (off 75' for Ryanne Brown)\nThe good. 🤷\nThe bad. Roasted with the entire rest of the backline in the 28th, and then inexplicably held up her recovery run, leaving Chawinga unmarked to tap home the equalizer. Completely lost track of the danger off the corner in the 45'+2, only able to watch the Current celebrate. Gave Chawinga infinite time and space to pick her cross in the 46th, and didn't so much as make her ask questions. Absolutely whiffed on Chawinga in the 47th, letting her in with space to run downhill and Ivory's goal in her sights. Consistently out of position in ways that Shae Holmes had to cover for, and that left McClernon isolated. The midfield was outnumbered, outworked, and overrun, but Alana Cook was challenged often, and came up short virtually every single time, when she even remembered to show up for the challenge at all.\nGoing forward. Cook has had occasional flashes of her old self, but this was dire, and she hasn't really looked healthy or confident at all this year. Desperately needing her to find some of her prior form, the Reign instead saw her leave injured after abjectly failing to positively impact the match.\nShae Holmes – 3\nThe good. Holmes had an incrementally less disastrous performance than Alana Cook. An aggressive take-on in the 30th minute directly led to Tziarra King blasting a shot that would've been pure vibes but failed to score.\nThe bad. Roasted with the entire rest of the backline in the 28th. Beaten too easily in the 18th. Marked nothing in particular and nobody threatening in the 45'+2. Did nothing to make Vanessa DiBernardo's life difficult in the 46th. Took herself out of the play by badly losing a too-aggressive challenge in the 47th. Whoof. The midfield was outnumbered, outworked, and overrun, but Shae also repeatedly folded under the pressure.\nGoing forward. I've been asking for Shae Holmes to get minutes where Lu Barnes has been a lock. I'm not actually dissuaded from that position, but this was an inauspicious start against, admittedly, one of the most lethal collections of attacking talent the league has ever seen.\nPhoebe McClernon – 4 (off 57' for Lauren Barnes)\nThe good. On an afternoon when absolutely everybody was getting fucking roasted left and right, Pheobe occasionally decided to do the other thing, with five successful challenges, leading the side, and leading everybody but Huitema (who had four) rather substantially.\nThe bad. Roasted with the entire rest of the backline in the 28th. Too slow to recognize the threat from Chawinga in the 18th. Caught in a position where she was forced to defend two attackers in the 46th, she covered neither. While the midfield was outnumbered, outworked, and overrun, the failure of McClernon (and Huerta) to effectively support was a cascade failure that led to Cook and Holmes facing downhill runners repeatedly.\nGoing forward. She was probably the least-worst defender in the match, and she's been more consistently decent than just about anybody on the roster, so... 🤷\nMidfield\nAngharad James-Turner – 3 (off 56' for Olivia van der Jagt)\nThe good. She had a successful tackle on the ball. (The Reign midfield, starters and substitutes, went 2 for 9 across the match, with the other successful tackle belonging to Ji So-yun.)\nThe bad. What can you even say? Haz was a non-factor when the Reign were punching, and a non-factor when the Reign folded, and continued to be a non-factor until Olivia van der Jagt replaced her. Her passing was Not It, she seldom touched the ball, and she repeatedly failed to even slow up the progression of a fast and skilled Current attack playing through her. With Veronica Latsko and Tziarra King pushing high up the pitch, James-Turner needed to be an anchor, and she was not. This was an ugly non-performance that added extra pressure to a back line that could not handle any pressure at all.\nGoing forward. How about we absolutely do not repeat this setup in midfield.\nJess Fishlock – 4\nThe good. When she got on the ball, she mostly chose the right pass.\nThe bad. With Angharad James-Turner catastrophically ineffective, Fishlock compounded that by providing basically no defensive bite. The Reign were perpetually outnumbered and outworked in the midfield, and while this 2024 version of Jess Fishlock is still capable of being an elite NWSL player and has shown as much, she doesn't have the range to roam and destroy all comers like she used to. Largely unsupported by either the fullbacks or the wingers, she simply could not keep up, and the Current ran right by her or bypassed her with a single ball with such regularity it hurt to watch (and hurt doubly to rewatch.)\nGoing forward. How about we absolutely do not repeat this setup in midfield.\nForward\nWhile Veronica Latsko and Tziarra King often operated as midfielders, they were listed as forwards on the Reign's lineup and predominantly occupied space comparable to the other forwards throughout the match, so I've opted to organize them with the forwards in this ratings column, please don't @ me.\nVeronica Latsko – 6\nThe good. Heck, but that 24th minute pass to Jordyn Huitema was a beautiful ball, and it gave the Reign the best vibes we'd had in a long, long time. Huitema found Latsko with an incisive pass earlier, and Latsko took a decent but ultimately too savable shot in the 2nd minute. Her eight (!) blocks not only led the team, but led the entire rest of the team, combined.\nThe bad. Latsko was increasingly a non-factor as the first half wore on, and she faded into irrelevance as the Current pulled away in the second. Aside from the dime she dropped to Huitema, her choice of pass left something to be desired.\nThe perplexing. Officially, the NWSL did not record Latsko's pass to Huitema as an assist, and to be clear, the NWSL is just staggeringly fucking incorrect about that. A mystifying, anti-vibes, and truly indefensible scorekeeping choice.\nGoing forward. Latsko didn't do much wrong, and her quick, perfectly weighted pass gave the Reign that so-elusive early lead. While her play is consistently good enough to demand more minutes, she struggles to actually keep up her intensity and quality for those more minutes when she gets them.\nJordyn Huitema – 8 (POTM)\nThe good. \"Air\" Jordyn Pamela Huitema scored a damn brace, and that should've wound up meaning more than it did. In the 24th minute, she timed her run perfectly and delivered a fabulous one-touch finish to Latsko's exquisite early cross. In the 41st minute, she went in hard as fuck to get her head to a low ball, putting it all on the line to give the Reign a 2-1 lead. A second-minute pass to Latsko was exquisite, wanting for a better finish. A 22nd minute pass gave Tziarra King an open look that AD Franch barely saved off the crossbar. She got her head on a third minute service from Huerta that she ultimately couldn't do enough with. She defended from the front and turned pressing into offense, winning more challenges than any Reign player not named McClernon, three of them in the attacking third. The first half was Jordyn Huitema's half, and it was sublime.\nThe bad. In the second half, the Current adjusted, and Huitema was starved for service. She was still a menace to the Current's backline on the press, but with the game state flipped on its head and the Reign falling apart behind her, she was unable to impact the game again.\nGoing forward. When your long-absent target forward returns from injury and scores two first-half goals, you need to make that kind of performance count for something.\nBethany Balcer – 5 (off 57' for Ji So-yun)\nThe good. A combination with Huitema in the 22nd minute led to a King shot and an unfortunately solid save by Franch. A decent run in the 52nd minute got her a look at goal off a Huerta ball.\nThe bad. Balcer touched the ball just 13 times, was a very forgettable 5 for 9 passing, couldn't get involved much in the defense. She was only 2 of 6 in aerial duels, normally a staggering point of strength for her. Playing in a throw-it-at-the wall-ass formation, she often seemed not to know what run she should make, and often wasn't on the same page with Huitema, King, and Latsko.\nGoing forward. It was an off night, but Balcer's running, challenging, and team-on-her-back determination have been a rare bright spot for the Reign this year. Getting more game reps with Huitema should help both time their runs with each other better.\nTziarra King – 5 (off 79' for Emeri Adames)\nThe good. King had two solid looks for herself, in the 22nd and 30th minutes, and later combined with Sofia Huerta to manufacture a good look for Boats. Unfortunately, none of those moves resulted in a goal. Her outside-in runs to create space and challenge the Current back line were consistently good, and mostly unrewarded.\nThe bad. King mostly didn't do much with the ball, either when she got an opportunity of her own or when she had a chance to make one happen for someone else. She often wasn't on the same page with Huitema, Balcer, and Latsko.\nGoing forward. King has been showing a more complete game over the past couple matches, but she still needs to take it up a notch to really be an asset week in and week out, and the Reign need to occasionally reward it when she makes an excellent diagonal run.\nSubstitutes\nOlivia van der Jagt – 5 (on 57' for Angharad James-Turner)\nThe good. She got Angharad James-Turner off the field.\nThe bad. The Current had already turned the match into a laugher, and while Olo was more impactful than James-Turner – and capable of both going to where the ball was going to be, and occasionally even completing a pass – she didn't change much. She couldn't simultaneously also sub for Alana Cook, Shae Holmes, and Laurel Ivory.\nGoing forward. Olo helped plug a hole in the midfield mostly by being slightly more aware that a soccer game was happening, but she doesn't offer much going forward, and the Reign were already down 4-2, so...\nLauren Barnes – 5 (on 57' for Pheobe McClernon)\nThe good. Lu came on and actually passed the ball to other players in blue, rather than inexplicably opting to perpetually turn it over to players in red. Lu is generally the captain for a reason, and there was a visible difference in connection and communication in back after she subbed on.\nThe bad. Two defensive subs in the 57th minute, while already trailing by two goals, doesn't tend to flip the outcome, and indeed Lu could not flip the outcome.\nGoing forward. Lu's calm and veterancy are, indeed valuable, and while she still showed the slower reaction time and less consistent decision-making that've plagued her this year, she also got the defense actually mostly on the same page, something they extremely had not been prior.\nJi So-yun – 5 (on 57' for Bethany Balcer)\nThe good. With Ji So-yun checking in to the midfield, the Reign were able to finally establish some spells of possession that didn't end in instantaneous turnovers and Chawinga sprinting full-bore at a shellshocked Laurel Ivory.\nThe bad. The Reign were already trailing, and Ji couldn't unlock the Current, let alone to the tune of the 3+ goals they needed.\nGoing forward. Ji probably continues to start most matches where she's not coming off multi-game weeks with her national team, and the Reign are better when she plays.\nRyanne Brown – 5 (on 75' for Alana Cook)\nThe good. In limited minutes, she didn't passively decline to defend, yielding an extremely high leverage chance.\nThe bad. I'm honestly not inclined to nitpick here. She played 15+ minutes and the Reign didn't concede.\nGoing forward. We have literally nothing to lose from giving Brown a start or two, just to see if she can find a bit of magic that the rest of the team cannot.\nEmeri Adames – 5 (on 79' for Tziarra King)\nThe good. In the 90'+7, trailing 5-2, Adames was playing hard anyway, collecting a ball from Olo and having a go from the top of the area. In the 90'+11, an interplay with Ji gave the Korean midfielder a modestly good look at goal. Adames got on the ball often, with nine touches – three of them directly challenging goal – in twenty-ish minutes. Emeri played hard and tried to make something happen even with the outcome long since in any sort of doubt.\nThe bad. I'm honestly not inclined to nitpick here. She played 10+ minutes and the Reign showed a little bit of life at the end of a brutal match.\nGoing forward. Two years from now, we will not regret any of the minutes we find for Emeri Adames now. Give her a chance to grow into what she can be.\nReferee\nBrad Jensen – 7\nThe good. It figures we get one of the best officiating performances of the year on one of our worst games of the year, eh? Anyway, Jensen's whistles made sense, he signaled advantage when there was actually an advantage, he called a stone-cold penalty with authority, he kept shit calm even as the game state unraveled, and he generally did a good job at his job.\nThe bad. Not much stands out. On another day, Temwa Chawinga maybe could have seen a yellow after her third high-energy foul, but then, she took as good as she gave, and Jensen handled it consistently.\nThe annoying. The extended wait checking on the Reign's opening goal was perplexing and a bit demoralizing? But that's on the VAR, not Jensen.\nGoing forward. I would love to see this standard of officiating be, well, standard.\nA Stray Thought\nIt's the hope that kills you, isn't it?\nThe Reign return to action at home against the Portland Thorns on Sunday, June 16th, at 1:00 PM. Oh wow, that's today! No matter how lost the season is and no matter how frustrating the team is, they should always show up with their best and bitterest against Portland. Damn the struggles, we've got bonfires in our blood.",
  "word_count": 3085,
  "scraped_at": "2026-02-14T12:23:57.805395"
}