{
  "article_id": "142d5784427b",
  "url": "https://www.atvtoday.co.uk/276405-sky/",
  "title": "Sky Sports secures exclusive united kingdom rights to inaugural FIFA Women Champions Cup finals",
  "date": "20260116T040000Z",
  "domain": "atvtoday.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sky will show every match live\nSky Sports will exclusively broadcast the Final Stage of the inaugural FIFA Women’s Champions Cup™ in the UK and Ireland, following a new partnership agreement with FIFA.\nThe landmark tournament brings together six continental champions to compete for the title in years when the FIFA Women’s Club World Cup is not staged. After two early-round fixtures, four teams will advance to the showpiece final stage, taking place in London across two matchdays on 28 January and 1 February.\nSky Sports will show every match live, beginning with the semi-finals at Brentford Stadium on Wednesday 28 January:\n- Gotham FC vs SC Corinthians – 12:30pm\n- Arsenal Women FC vs ASFAR – 6:00pm\nThe action then moves to Arsenal Stadium on Sunday 1 February, with the third-place play-off at 14:45, followed by the final at 6:00pm.\nSky’s coverage of the FIFA Women’s Champions Cup™ will be presented by a familiar team of experts including Izzy Christiansen, Caroline Barker, Natalie Gedra, Ellen Ellard and Courtney Sweetman-Kirk, offering in-depth analysis and insight throughout the tournament.\nAs the UK’s leading investor in women’s sports broadcasting, Sky Sports aired more than 75% of all televised women’s sport in 2025, delivering a year-round line-up that spans football, golf, cricket, netball, tennis, motorsport and rugby league.\nCompeting teams by confederation:\n- ASFAR – CAF\n- Arsenal Women FC – UEFA\n- Auckland United FC – OFC\n- Gotham FC – CONCACAF\n- SC Corinthians – CONMEBOL\n- Wuhan Jiangda WFC – AFC\nThe inaugural FIFA Women’s Champions Cup™ Final Stage will be shown live and exclusively on Sky Sports on 28 January and 1 February.",
  "word_count": 274,
  "scraped_at": "2026-02-14T12:51:34.191857"
}