{
  "article_id": "145c05be4e58",
  "url": "https://www.twtd.co.uk/ipswich-town-news/48542/negri-were-happy-where-we-are-leading-up-to-christmas",
  "title": "Negri : Were Happy Where We Are Leading Up to Christmas - Ipswich Town News",
  "date": "20241215T133000Z",
  "domain": "twtd.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sunday, 15th Dec 2024 10:45 by Kallum Brisset\nTown Women goalkeeper Natalia Negri believes the Blues, who are in Women’s FA Cup action against AFC Bournemouth at the Martello Ground, Felixstowe this afternoon, are in a strong position to push for promotion to the Championship at the halfway point of the league season.\nHaving finished third, second and fourth since promotion to the FAWNL Southern Premier Division in 2021, the Blues are currently sitting three points clear at the top of the table and hold a game in hand over second-placed Hashtag United.\nDespite the excellent form so far this campaign, Joe Sheehan’s side are refusing to get carried away with 11 league fixtures standing between Town and promotion to the Women’s Championship for the first time in the club’s history.\n“The girls are very happy with where we’re at leading up to Christmas,” Negri said. “It’s definitely a position we wanted to be in. We’re just trying to keep our heads down and take everything day-by-day and each weekend as it comes.\n“We’re probably in the most perfect position we could be in. We’ve got a lot of confidence going into the following year.\n“The beauty of this team is that we’ll always push to the very last whistle. With the girls now I back every single one of them to get a result out of either being behind or being in front.\n“Within the last few weeks we’ve had tougher opposition to come up against but it shows where we’re at and we’re able to compete against anyone that comes at us.\n“The gap between the Championship and our league is big. The girls have got every ability to go on and compete in the Championship if it was to happen, but right now it’s a good level for us to be competing at.\n“We want to earn a spot in the league above and now we’re in a position for us to be able to do that. If it were to happen I think we would cope quite well.”\nOn her own form, Negri added: “It was something that I spoke about coming in that I wanted to keep as many clean sheets as possible and I wanted to set my standards quite high.\n“It’s very important that we have a lot of pride in keeping clean sheets and keeping them out of our net.”\nNegri is one of a number of players who joined the club during a summer transfer window where the Blues looked to recruit players with experience of playing in the Championship or Women’s Super League.\nHaving signed from Crystal Palace after they were promoted to the WSL last season, Negri is enjoying her time at Ipswich even if it was a move that was initially unexpected.\n“I’m loving it,” the 20-year-old said. “It was a breath of fresh air coming in. Off the back of a promotion season with Palace it was important to try and bring in what I could here and I know that was something the club wanted to do as well. For me personally, it’s been a great move and I’ve really enjoyed it so far.\n“It was a move that I was always going to do at the end of the year. It wasn’t a move I was expecting but I’m glad it has come about. It was something I needed to do in terms of building confidence and Joe’s been able to help me do that here.\n“I was actually a bit of a late starter compared to most people. I started playing at Arsenal when I was about 13 and pushed on from there. I went on loan to Charlton when I was 17 and then made the permanent move to Palace, which was a great thing for me to do in terms of my career.\n“That was an unbelievable experience. I was there for two years so it was nice to see the club progress in that time. I’m hoping that we can do similar things here.”\nWhile Negri has kept nine clean sheets in her 13 appearances for Town so far, arguably her standout moment was in the previous round of the Adobe Women’s FA Cup where league rivals Hashtag were dispatched by the Blues on penalties following a dramatic 2-2 draw.\nSophie Peskett scored a last-gasp equaliser to send the tie to spot-kicks, in which Negri saved two penalties and earn herself the ‘Baller of the Round’ award for round two.\nNegri said: “It was a very emotional game. They got an early goal which was quite disheartening for us at the beginning, but we’re quite good at getting back into the game.\n“Conditions weren’t the best and it was a very difficult game to play in, I don’t think I’ve ever been involved in a game with that much wind in my life. We had the wind against us in the second half so that made things a lot harder.\n“A mistake from myself led to us conceding the second goal which was something I wanted to come back from very quickly. As a goalkeeper you’ve got to have the mindset of any mistake could cost you.\n“I had every faith in the girls to score and then when it went to penalties and I was very confident that we were going to win. I manifested it and it happened.\n“I’ve saved penalties but not in a competitive game before. It was definitely a proud moment for me and something that I wasn’t expecting, but it’s been good for my confidence.\n“The girls are great at shootouts, it’s difficult saving them but it’s just as difficult to put them in the back of the net and they did that brilliantly.”\nVictory over the Essex side set up today’s third-round clash with AFC Bournemouth (KO 1pm). The Cherries are currently top of the FAWNL Division One South West, a division below the Blues, having won all nine league matches this season.\n“It’s going to be a very tough game and one we can’t underestimate,” Negri warned. “They haven’t lost a game yet this year and are in very good form but so are we. It’s going to be a very competitive game and maybe more competitive than some we’ve had in this league.\n“It’s fair to say they could be playing in this division but it will be very interesting to see how much they’ve progressed from pre-season and how much we have too.”\nWith the initial staging of the third round tie postponed last weekend due to heavy rain, the draw has already been conducted. The winner will travel to three-time winners and WSL heavyweights Manchester City in the fourth round.\nNegri said: “It’s a difficult one, we don’t want to get ahead of ourselves because we’re not through yet. But personally for me I’m very excited for it and they’re the games you want to be a part of.\n“They’re a top side in women’s football and we probably couldn’t have come across much harder. I know the girls are going to be really up for it but we are very focused on getting through the next round first.”\nHaving been capped by England up to U19 level, Negri , who also qualifies for Italy and Spain, could be forgiven for thinking of a maiden call-up to the national team at U21 level given her recent success with Palace and form on display at the Blues.\nOn the international front, she said: “It’s something that I obviously speak about, but until the time is right it’s not something I’m pushing yet. It’s something that I would love to be a part of, but I want to be ready for it if the opportunity comes about and I don’t want to waste it if it was to come.”\nTWTD/ITFC/Matchday Images\nPlease report offensive, libellous or inappropriate posts by using the links provided.\n- Page:\n- 1\nYou need to login in order to post your comments",
  "word_count": 1335,
  "scraped_at": "2026-02-14T12:42:37.950258"
}