{
  "article_id": "1464a8b9232d",
  "url": "https://www.bbc.co.uk/sport/football/67749259",
  "title": "Democratising data - how Fifa primed World Cup underdogs to shock",
  "date": "20231221T184500Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sign up for notifications to the latest Insight features via the BBC Sport app and find the most recent in the series.\nWhen Argentina and France kicked off the Qatar World Cup final on 18 December 2022, they were more prepared than any teams in the history of the competition.\nWith the match shifted from the end of gruelling domestic seasons, their players were in peak physical form, but also their backroom staff, like every other in the tournament, had access to data and video analysis like never before - all provided by Fifa.\nAt the head of this data revolution was a man from the East Midlands, Chris Loxston, who now works for the San Diego Wave in the United States' National Women's Soccer League.\nWhen Loxston realised he was not going to make it as a footballer he wanted to ensure he could help those with more playing ability be their best. He worked with the British Olympic team before specialising in football with Saudi Arabia at the 2015 Asian Cup, and the United Arab Emirates, finally landing at Fifa in late 2017.\nHe was immediately tasked with preparing for the 2018 World Cup in Russia, where he was Fifa's only performance analyst.\nFour years later, Loxston was head of Fifa's performance analysis and insights department - leading a team of around 100 football analysts, data scientists and data engineers. So what changed?\n\"I think the lightbulb moment was Arsene Wenger,\" says Loxston.\nWenger joined Fifa as its chief of global football development in 2019 and was an early supporter of using data. He had been the Arsenal manager when the club acquired StatDNA,, external a pioneering US company, in 2012 and it instantly became Arsenal's data analytics department.\n\"We presented what we were doing to Arsene,\" says Loxston. \"He said: 'What you are doing is great, but I want to build the best football analysis centre in the world.'\"\nThe idea was to produce a system that gave equal access to information for all nations, irrespective of size or budget.\nIn 2014, Germany had used data to improve all aspects of their performance, external - and it paid off as they won their fourth World Cup. But few countries can match the size, organisation and budget of the German football federation.\nFour years later, Croatia - a country of four million people and a much smaller budget - similarly crunched numbers to help find their final and come within 90 minutes of turning tournament orthodoxy on its head.\n\"Since Uruguay lifted the trophy [in 1950], no nation with fewer than 40 million inhabitants has won the World Cup,\" said Wenger. \"Croatia came close, and they're a great role model that smaller nations can draw inspiration from.\"\nMarc Rochon, a Scot, was the man behind the data of Croatia's amazing run to a silver medal.\nHe had worked for Croatian manager Zlatko Dalic at Al-Ain in the UAE and when Dalic was put in charge of his own national team, Rochon got a message asking for his help.\nRochon operated as a one-man data analysis department for Croatia in Russia.\nAs the team battled through the knock-out stages, Rochon would be situated high in the stadium with two laptops in front of him, accessing software he had borrowed or paid for out of his own pocket, two TV screens and a radio.\n\"I was surviving on about two or three hours' sleep a day,\" Rochon recalls. \"I was hammering everything I could.\" He had access to Fifa video feeds but the data came from third-party suppliers.\nHe had to prepare video clips himself in real time as the match was being played.\nFour years later, Rochon was again part of the Croatia backroom team at the Qatar World Cup. By then the use of data had become more widespread. Croatia's opponents in their opening game - Morocco - had their own Brit working behind the scenes, in the shape of Harrison Kingston.\nKingston had worked his way to the Moroccan national team via the Welsh FA, Spurs Under-18s, Burnley and Liverpool.\nIn Qatar, he was one of three analysts working for Morocco. \"The data department has grown in my time here and continues to do so, not only in terms of numbers,\" Kingston explains.\n\"We have improved the impact of the work through education and by embracing new technologies. This has given the role of an analyst in Morocco more clarity, purpose and a clear professional status.\"\nThe enhanced Fifa data provided contextualised information to help Morocco upset more established powers.\n\"It showed us opponent tendencies,\" says Kingston. \"For example, Belgium's attacking patterns were heavily weighted down one side of the pitch. We used this to supplement our work during the tournament and our physical coaches benefited from the tracking reports.\"\nThe in-tournament data was used by the coaching staff to bolster team talks. \"Whether it be something simple like reinforcing just how positive a 0-0 was in that first game,\" explains Kingston.\n\"We were one of the very few teams to stop Croatia scoring in recent history. In preparation for our last-16 game against Spain, we used their possession figures - especially those against top teams - not only to identify what we already knew, but to help reinforce the coaches' game plan and make it clear to the players that they would have to be prepared to suffer for long periods without the ball.\"\nFifa's data uses a standardised football 'language' that everyone could use to compare and contextualise across tournaments and games, and ensure high-quality analysis is possible for all.\n\"We spent two and a half years developing the Fifa football language,\" explains Loxston. \"It is probably 10 times the depth of any other data provider on the market.\"\nOne area in which Fifa's language goes much further than before is the tracking of off-the-ball data.\n\"We have ball movement data to show that a player is typically on the ball for one minute 49 seconds,\" says Loxston. \"The clock starts when the ball touches the player's foot and ends when the ball leaves. It doesn't include the time when the ball is travelling to the next player. So a typical player playing 96 minutes has possession for a maximum of around 2% of the match.\"\nWhat Loxston and Fifa wanted to do was analyse what happens for the other 98% of the time.\n\"One of the new metrics we have is called 'offering to receive',\" says Loxston. \"That can be signalling for the ball, changing body shape or making a movement in an attempt to receive. Whether they receive the ball or not, we still capture that piece of information.\"\nAnd far beyond whether a pass is simply received or not, the 'offer' is broken down into groups based on where the player making the offer is situated: inside or outside of a team shape, between certain units, in behind the defence, and so on.\nTelevision viewers could also see the enhanced new metrics on screen during matches. Line breaks and receptions, ball recovery time and varying degrees of pressure on the passer were among the insights shared. More are available for the curious via the Fifa Training Centre website. , external\nAll of these events were tagged by a team of analysts coding the match in real time. Each player was assigned an analyst and the data was combined with optical tracking information, which used eight cameras to remotely track player movement 25 times a second.\nIf an event was logged by a human that did not match up with positions tracked automatically, a flag was raised and a further analyst would check why there was a discrepancy.\n\"Fifa had a football analyst and data scientist in communication with broadcasters, so they could say, for example: 'In the last five minutes England have made five line breaks - now would be a good time to share this on screen,'\" says Loxston.\n\"It wasn't just showing the possession stats every 15 minutes. It gives commentators more to talk about and the idea is to get people talking about football in a more intelligent way.\"\nLike having a Lionel Messi or Kylian Mbappe on the pitch, the data battles can be won by the nations who know how to best use what's at their disposal. \"Understanding the intelligence is just as important as having the people in your staff who are able to transfer that to the players. That's where the gold dust is,\" says Loxston.\n\"Fifa's data was our primary source for analysis, particularly the tactical footage being available live in games,\" says Kingston.\n\"I often said during the tournament it was like having additional analysts working for us. The time, energy and workload we were saved by the services provided by Fifa were invaluable and allowed us to compete, off the pitch, with other nations who might have had more resources.\"\n\"What we're seeing is some of the smaller nations starting to buy in and understand why this is important,\" says Loxston. \"Of course they are going to take time to come through, but we are starting to see them think outside the box and say: 'OK, how can we improve? How can we do things slightly differently?'\"\nIn the future, Kingston plans to use the data even more. \"In our case [we] will be using it more live in the game,\" he says. \"Fifa had these streams and data sets available but we didn't have the processes in place to benefit from this during the tournament.\"\nThe data revolution extended to the Women's World Cup in Australia and New Zealand, external earlier this year, but Qatar 2022 was the first time smaller and lower-ranked nations could use such rich data on the biggest stage.\nSaudi Arabia, Australia, Tunisia and Japan all gained famous upset wins against more celebrated football nations, while Morocco and Croatia, once again, seemed to benefit most and reached the semi-finals.\nData has long ago convinced football of its worth, now it is spreading deeper and further into the international game.",
  "word_count": 1682,
  "scraped_at": "2026-02-14T13:10:11.699425"
}