{
  "article_id": "146faee3652c",
  "url": "https://www.bbc.co.uk/sport/football/67752747",
  "title": "Rebecca Welch : The  resilient  and  empathetic  role model referee making her Premier League debut",
  "date": "20231222T133000Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Rebecca Welch: The 'resilient' and 'empathetic' role model referee making her Premier League debut\n- Published\nRebecca Welch - trailblazer, history-maker, role model.\nOn Saturday, the 40-year-old will become the first female referee to take charge of a Premier League game as Fulham host Burnley.\nTop flight officials in general have been under intense scrutiny this season, but \"resilient\" Welch will be leading the way as a role model for other female referees when she walks out on to the Craven Cottage pitch before the 15:00 GMT kick-off.\nAlready an experienced referee who has taken charge of matches at the highest level in the women's game, Welch's rise to the top of men's football in England has been meteoric.\nBBC Sport finds out more.\n'Welch is leading the way'\nWelch hails from Washington in Tyne and Wear and, alongside her job at the NHS, became a referee in 2010 before turning to officiating on a full-time basis in 2019.\nShe hit the headlines last week when it was announced she would be in charge of her first top-flight game, just two years on from becoming the first female appointed to an EFL match when Harrogate played Port Vale.\nHarrogate boss Simon Weaver praised Welch's \"very good\" performance on the day, making \"important calls\" and the \"right calls\" - and Welch has gone on an upward trajectory since, refereeing matches in the Championship and the third round of the FA Cup.\nIn the women's game, she has been a leading light for English officials in the Women's Super League as well as the 2017 and 2020 FA Cup finals.\nHer work has been recognised on the international stage too as she was added to Fifa's elite list of international match officials in December 2020, before refereeing at the Women's World Cup in Australia and New Zealand in the summer.\n\"We have not seen a female take charge of a Premier League game ever before,\" referees' chief Howard Webb told BBC Sport.\n\"We have some really talented officials in the men's and women's game. Rebecca is leading that.\n\"She went to the World Cup in Australia and New Zealand. She has been exposed to some big games and I am really confident she will deliver a game in the Premier League and be a really good model for women and girls to think refereeing is for them when previously they didn't.\"\n'Resilience has allowed her to progress'\nOn Saturday, Welch returns to Craven Cottage for the top job - a month on from serving as the fourth official during Fulham's 1-0 defeat by Manchester United.\nWelch has been described as someone who \"leads by example\" and has a \"real thirst for learning\", while her personality and individuality allows her to \"be herself\" on and off the pitch.\nShe is seen as being \"empathic\" towards players but still has the \"accountability to take tough and unpopular decisions for the right reasons\".\nAsked what her key performance characteristics are, one source close to Welch told BBC Sport: \"She is deeply committed and has a high work ethic.\n\"Those are the basic building blocks to then being able to learn quickly. She has resilience when learning from experience because not all decisions made by officials are correct. That is the bedrock of why she has progressed.\"\nMale players 'treated me with more respect'\nLast month, two teenagers were arrested for alleged misogynistic chanting towards Welch during Birmingham City's Championship match against Sheffield Wednesday at St Andrew's.\nFulham Lillies, a female-run supporters group, has spoken to the club to ensure any discriminatory abuse towards Welch is reported to the hotline available at the stadium.\nSarah Keig, co-founder of the group, told BBC Sport: \"We know there could be sexist abuse on Saturday so we have looked to pre-empt it by advertising the text message service around the ground.\n\"We want to give a message that it won't be tolerated. Since Covid there has sadly been an increase in anti-social behaviour and us female supporters have seen a lot of sexism.\n\"Welch's appointment is fantastic and we welcome it but we know from experience that there will be abuse given.\"\nWelch's selection comes in a season when match officials are under intense scrutiny following the high-profile error by VAR during Tottenham's win over Liverpool in September, with contentious decisions also discussed by Webb on television show Mic'd Up in his push for better transparency.\nManagers have vented their fury publicly too, with Brighton boss Roberto de Zerbi given a formal warning by the Football Association for saying he disliked \"80% of England's referees\".\nArsenal manager Mikel Arteta avoided punishment after calling VAR's decision to allow Newcastle's goal in their 1-0 win last month \"embarrassing\" and a \"disgrace\".\nWelch will be hoping the contest on Saturday runs smoothly so that her words from August continue to ring true at full-time.\nShe told the Sunderland Echo:, external \"Being a female referee has never really been a problem. In reality, if anything, I was probably treated with a little more respect by the players because I was a female ref.\n\"For me, being a female referee has never been problematical. No one has ever voiced dissension directly towards me. The feedback has all been positive and the social media trolls have kept away.\"\nOur coverage of your Premier League club is bigger and better than ever before - follow your team and sign up for notifications in the BBC Sport app to make sure you never miss a moment",
  "word_count": 919,
  "scraped_at": "2026-02-14T12:40:22.772742"
}