{
  "article_id": "1473b42599de",
  "url": "https://www.thenationalnews.com/opinion/comment/2025/09/15/uk-london-starmer-politics-right-wing-protest/",
  "title": "Starmer must hold the line against the united kingdom growing ultra - right",
  "date": "20250915T120000Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Keir Starmer, the British Prime Minister, was in his happy place on Saturday, at the Emirates football stadium watching the Arsenal team demolish Nottingham Forest.\nIn the view from executive boxes, where he must now sit for security reasons, there was plenty of red and white, the colours of the England flag that has been co-opted in the rise of the far-right across the country in recent weeks.\nNot many miles away, outside his No 10 Downing Street residence, the cross of St George (red on a white background) was the rallying banner for tens of thousands at a hate-filled march of anger against Mr Starmer’s government.\nClashes with the police and an attempted breakout to attack the counter demonstrations by anti-racists at Trafalgar Square brought the day to an ugly crescendo.\nHours earlier, as Mr Starmer’s fellow fans made their way to the early kick-off through the Victoria area of London, they may have noticed, as I did, a clutch of black-clad, well-built men from New Zealand’s Destiny Church, a fundamentalist organisation.\nThese evangelical Christians were there to perform a star turn at the rally, which was organised by the far-right activist Tommy Robinson. His slogan for the morning was \"Unite the Kingdom\" and Mr Robinson had called the event a free-speech festival as he issued a message that his supporters should not engage in violence.\nIn reality, his rally was an attempt to capture the mood that had seen crowds gather outside hotels housing migrants throughout the summer calling for the expulsion of new arrivals.\nMore than 100,000 Robinson supporters turned up and there were violent clashes with 26 police officers needing hospital treatment.\nThere was also a worldwide element of support that helped fuel the fever of those on the march. The men from New Zealand were there to perform a haka, a ceremonial war dance, to help rile up the crowd.\nAccording to a report by the UK advocacy group Hope not Hate, the leader of Destiny Church, Brian Tamaki, called the gathering to arms against other religions.\n\"This is a religious war,” it quoted Mr Tamaki as saying as he called for bans on the religious practices of “Islam, Hinduism, Bahai, Buddhism ... We’ve got to clean our countries up. Ban any public expression of other religions in our Christian nations.\"\nProof that Britain’s far-right feels that it is tapping into an international resentment vein was easy to spot at Saturday’s march. As the England flag fluttered there were video addresses by Elon Musk, French far-right polemic politician Eric Zemmour and Ezra Levant of Rebel News, Canada's far-right political commentary platform. The reporters on the scene said there were activists from Germany, Poland, Holland, Ireland, Spain, Belgium and New Zealand.\nMr Starmer is almost 15 months into his time in Downing Street but already he is touching levels of unpopularity that dogged his Conservative predecessors.\nWith the economy over-taxed and growth stalled, there is a sense that his government is stuck. It does not help that, despite a massive majority, there is evidence his Labour Party colleagues will not mobilise behind the agenda of change and growth that he won the election on in July last year.\nOver the weekend, the glow of the Arsenal victory is likely to have faded fast for Mr Starmer.\nHe was forced to throw out a cold bucket from the Downing Street door, proclaiming that he would not stand for assaults on police, or of intimidation of people for the colour of their skin or background.\nThe England flag, he continued, “represents our diverse country” and it would never be surrendered to be used as a \"symbol of violence, fear and division\".\nWhat is troubling about those words is that Mr Starmer may be overpromising. The meme of Operation Raise the Colours, which has seen the flag and the UK’s Union Jack suddenly sprout on homes and roads, has taken off.\nThe Starmer government is caught in something of a pincher if it resists this too strongly. The US right and those campaigners on the stage agitated on the basis of free speech.\nCabinet minister Peter Kyle, who is closely involved with delivering US President Donald Trump’s second state visit to the UK this week, pointed to those tensions when he was interviewed at the weekend.\nMr Musk’s contribution to the rally showed how the pressure is being applied. His contribution was a blatant call for Mr Starmer’s demise for presiding over the “erosion of the UK”.\nHe demanded the dissolution of Parliament and claimed the UK did not have another four years to play with under Mr Starmer as “violence is coming”.\nThe atmosphere on days like Saturday is toxic and it is down to the government to show it can handle this. Foreign embassies, including the UAE’s, told citizens last week to exercise caution during the demonstrations.\nPolice asked London’s Muslims to nonetheless keep to their normal routines.\nBigger tests lie ahead but Mr Starmer knows he must hold the line in the face of the chaos Mr Robinson is promoting.",
  "word_count": 844,
  "scraped_at": "2026-02-14T12:12:09.937530"
}