{
  "article_id": "14825c94123f",
  "url": "https://www.newcastleherald.com.au/story/8976233/newcastle-jets-reject-clayton-taylor-release-request/",
  "title": "Newcastle Jets reject Clayton Taylor release request | Newcastle Herald",
  "date": "20250526T203000Z",
  "domain": "newcastleherald.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "THE Newcastle Jets have rejected a second request for a release from Clayton Taylor and expect the attacker to be a key part of the rebuild under new coach Mark Milligan.\nSubscribe now for unlimited access.\nor signup to continue reading\nTaylor has a season to run on his contract in Newcastle but wants out.\nThe 21-year-old had surgery on his adductor earlier this month and his agent, Tony Rallis, believes it is not in the player's best interest to stay at the club.\n\"You can't have a young man being restricted in his playing action due to an under-resourced club and expect him to be happy,\" Rallis said told the Herald last week.\n\"There is not enough medical resources and quality sport science to adequately service the players.\"\nThe latest request was discussed at a meeting of Jets' owners last week.\n\"The board's position and our position is that we want Clayton to be a part of the roster this season,\" chief executive Tain Drinkwater said Monday. \"He signed a contract extension not too long ago. From our perspective, he is a key element in our roster.\n\"Mark has had coversations with Clayton. Clayton has expressed a desire to go, but we want him to be part of the club.\"\nTaylor first asked for a release in March after confirmation that then coach Rob Stanton would be parting ways with the club.\nTaylor went from a youth team player at Sydney FC to one of the brightest prospects in the country under Stanton.\nHe scored seven goals and supplied six assists last season.\nTaylor and Rallis are adamant a move is essential for the winger's development.\nStanton signed a contract extension in late December but parted ways after an impasse with management over football staffing levels and other resources.\nDrinkwater was appointed in April and told the Newcastle Herald last week that player welfare was a priority.\n\"We can't cost cut in that area,\" Drinkwater said. \"We have to make sure whatever we are spending in that space is delivering the high-performance standard that we need.\"\nThere are no transfer fees between clubs in the A-League.\nBar an on-sell clause, there is little incentive for the Jets to release contracted players they want to retain.\n\"Ideally, Clayton will see that Mark is building a roster that is really professional and he can continue to grow and develop here,\" Drinkwater said.\n\"We can look at what new oppoortunities exist in the new year.\"\nThe Jets have nine places available on the playing roster for next season.\nThe Herald understands that former Sydney FC midfielder Max Burgess is a target along with an overseas defender.\nMilligan is expected to finalise his coaching staff aftre the grand final on Saturday.\nMelbourne Victory assistant coach Nick Stavroulakis has been linked to a move to the Jets.\nDrinkwater confirmed that there was a short list of candidate for the A-Leaguen women's coaching position, with an appointment expected in the next week.",
  "word_count": 497,
  "scraped_at": "2026-02-14T13:20:26.365474"
}