{
  "article_id": "149aad3cce76",
  "url": "https://www.themag.co.uk/2024/08/st-james-park-ac-milan-clash-will-set-newcastle-united-women-up-for-an-exciting-season-ahead/",
  "title": "St Jame Park AC Milan clash will set Newcastle United women up for an exciting season ahead",
  "date": "20240807T181500Z",
  "domain": "themag.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "St James’ Park AC Milan clash will set Newcastle United women up for an exciting season ahead\nNewcastle United Women return to action at St James’ Park this weekend, as they take part in the Sela Cup tournament for the second summer in a row.\nThe Lasses face Italian giants AC Milan on Saturday 10th August, a 1pm kick-off as part of their preparations for their Barclays Women’s Championship campaign.\nThe Rossonere head to Tyneside to face a Newcastle United side that looks very different to the one that ended last season, with 12 players released over the summer and seven coming in.\nLocal girls Grace Boyes, Erin Nelson, Anna Soulsby and Sharna Wilkinson were perhaps expected to move on after a lack of first-team opportunities, while a season-long injury to Keira Skelton maybe worked against the youngster, as the team essentially moved on and up without her. Keira and Grace have signed with Middlesbrough, adding to the growing former Newcastle contingent on Teesside, while Anna Soulsby has moved to their expected title rivals Durham Cestria.\nFormer Sunderland-striker Nicki Gears and young Northern Ireland goalie, Lilie Woods both move on too, after being surprise additions during the January transfer window. As does Cara Milne-Redhead who ended last season out on loan with Norton.\nAs for the surprise departures, Jamaican international striker Paige Bailey-Gayle leaves having played just half a season after rumours of her failure to settle in the area and a dip in form throughout the final weeks of the season. Her fellow striker, Bridget Galloway, follows her out the door, signing with Nottingham Forest, despite scoring goals for fun during the first half of last season.\nClassy defender, Naomi Bedeau, also moves to the City Ground and despite putting in a series of solid performances, an injury which kept her out of the side during the final three months of the campaign perhaps counted against her.\nThe one I am most disappointed about is the departure of Tyler Dodds. The Gateshead-born winger had the ability to deliver a series of pinpoint crosses but once the club signed Beth Lumsden from Portsmouth, she lost her place in the team and her exit was not really a surprise.\nWith so many players having moved on, that has created plenty of places in the squad. With no less than three new strikers coming in. Jamaican international Shania Hayles arrives from Bristol City having scored the goals that fired the Robins to promotion two years ago. While Amy Andrews comes in from local rivals Durham having spent last season in the north east after making her name in the USA with Western Illinois University and Tormenta FC. Completing the forward options is Hull-born Sophie Haywood who arrives on a free from Sheffield United.\nThe 28-year-old striker started her career with Notts County before spending three years in American college football with South Alabama Jaguars and Texas A&M-Commerce Lions. Haywood returned to England in 2018 with Aston Villa, helping the club earn promotion two years later before going on to play two seasons in the top flight. Haywood moved to Sheffield United in 2022 and after two years in the Championship, heads North to Tyneside.\nThere’s also a new goalie for the Lasses this season with Claudia Moan signing from rivals Sunderland. With ten clean sheets and just 18 goals conceded in 22 games, Moan won the Golden Glove as well as the Championship Player of the Season award, as she back-stopped the Wearsiders to a promotion push last time out. However, the new signing is well known to her coach Becky Langley after the pair won the league together at Northumbria University some years ago.\nDefender Deanna Cooper arrives on a free from Reading after the Berkshire club pulled out of the Championship for the Women’s fifth tier, leaving the Lady Mags with just ten league opponents for this season.\nRachel Furness returns to the team she supports, having clinched promotion from the Championship twice in the past three seasons with Liverpool and Bristol City. The Sunderland-born Northern Ireland international is an all-action midfielder who has had a previous stint at Newcastle United between 2006-10.\nHowever, perhaps the biggest signing is that of Euro 2022 winner Demi Stokes. Arriving on a free transfer from Manchester City, the full-back has 69 caps for the Lionesses and has won nine major honours with her previous club. Stokes began her football career at Gateshead College before moving to Sunderland, so knows the north east well and can’t wait to make her Newcastle debut.\n“I am thrilled to be joining Newcastle United and returning home to the north east. I still have so much to give on the pitch and I’m excited to bring my experience to a club with such big ambitions. From the moment I spoke to the club, I felt valued and knew this was the right place for me to contribute to an exciting, new project.” Stokes said.\nHer Manager Becky Langley was equally excited to have the highly decorated defender at the club.\n“Demi is one of the best defenders in the country and we are delighted that she is joining Newcastle United. She’s an incredibly humble girl as well as an ambitious, driven northerner. We can’t wait to welcome her to the club.” She said.\nWhile the Championship season is still a few weeks away yet and there are still a couple of gaps in the squad to fill, this new-look team should set the pulses racing on this Saturday’s outing at St James’ Park.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 939,
  "scraped_at": "2026-02-14T13:05:01.838655"
}