{
  "article_id": "149e2963d15b",
  "url": "https://www.theblaze.com/news/blaze-news-original-inside-massachusetts-migrant-shelters-where-crime-flourishes-under-democrats-watch",
  "title": "Blaze News original : Inside Massachusetts migrant shelters where crime flourishes under Democrat watch",
  "date": "20250116T120000Z",
  "domain": "theblaze.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Photo by Craig F. Walker/The Boston Globe/Getty Images\n© 2026 Blaze Media LLC. All rights reserved.\nBlaze News original: Inside Massachusetts migrant shelters where crime flourishes under Democrats' watch\nJanuary 16, 2025\nSanctuary policies fail American citizens and the illegal aliens they supposedly protect.\nMassachusetts' sanctuary laws have allowed the state's shelters to devolve into a breeding ground for criminal activity, all while taxpayers foot the $1 billion bill.\nDemocratic leaders have long since claimed that sanctuary policies, which prevent local law enforcement agencies from coordinating with Immigration and Customs Enforcement officials, protect foreign nationals who are contributing members of the community.\nWhile illegal aliens were promised a sanctuary, a new report from the Boston Herald revealed that the situation in Massachusetts' state-run emergency shelters has turned into more of a nightmare.\n‘I had three women tell me they were raped by residents of the shelter.’\nA stack of incident reports obtained by the news outlet through a public records request showed that the state's sanctuary policies are failing not only American citizens but also the illegal aliens they supposedly protect.\nOptics over outcomes\nGovernor Maura Healey (D) has faced repeated criticism for her handling of the immigration crisis since she was sworn in to office in 2023.\nIn November, following President-elect Donald Trump's election victory, Healey dug in her heels on immigration, emphatically vowing to use \"every tool in the toolbox\" to \"protect\" illegal aliens from the incoming administration's mass deportation efforts. She insisted that her state police would \"absolutely not\" be cooperating with Trump's ICE agents.\nHealey's post-election statements, up until that point, aligned with her long-standing support for the state's sanctuary laws.\nHowever, within the same month, she announced plans to slash state-run shelter costs and shorten stay limits for families with children. Her administration stated that it would begin phasing out the use of hotels and motels to house individuals amid the ongoing immigration crisis.\nJust one month later, Healey appeared to try to distance herself from — or at the very least backpedal on her support for — sanctuary policies.\nIn two separate back-to-back interviews, she insisted that Massachusetts was \"not a sanctuary state.\"\nHealey's claims seem far from reality, considering that Massachusetts does not obey ICE detainer requests and it is the nation's only right-to-shelter state, requiring it to provide housing to all pregnant women and families with children under 21 years old. Such shelter guarantees have been extended to illegal aliens under the Healey administration.\nFurthermore, the right-to-shelter law does not just require Massachusetts to provide shelter but explicitly demands that the taxpayer-funded accommodations include refrigeration and basic cooking facilities. Some of the emergency shelter locations, such as hotels and motels, lack these amenities, requiring the state to expend further resources to pay vendors to deliver food to illegal alien residents.\nHealey told the Boston Herald in December that the state's \"emergency shelter system really was meant for Massachusetts families who were experiencing homelessness or housing insecurity and needed a place to go that was temporary.\"\nShe also claimed that \"violent criminals should be deported if they're not here lawfully,\" calling for local, state, and federal law enforcement agencies to work together to remove such threats from the community.\nHealey further stated that she hoped Trump would strengthen the border and that the two could find common ground on the immigration crisis.\nWhen sanctuary stories don't align\nWhile the governor stated one thing, ICE and local reports shed light on a different reality.\nDespite Healey's claims that Massachusetts is not a sanctuary for illegal aliens, ICE released a report in August declaring that the Plymouth County Superior Court of Brockton ignored its detainer request, releasing a foreign national on a $500 bond after he had been arrested for aggravated rape of a child. The alleged crime reportedly took place in the Rockland shelter, where the victim, a 15-year-old girl, was residing.\nAfter his release, ICE located and arrested Cory Bernard Alvarez, a 26-year-old Haitian national, near his residence in Brockton. Alvarez was allowed into the country through the Biden administration's CHNV program, which allowed the entry of 30,000 individuals monthly from Cuba, Haiti, Nicaragua, and Venezuela.\nThe federal immigration agency similarly reported that Dorchester District Court also ignored one of its detainer requests, releasing an illegal alien who had been accused of kidnapping and attempted rape.\nEmilio Jose Pena-Casilla, a 46-year-old Dominican national, was charged in Massachusetts with \"assault to rape, kidnapping, two counts of indecent assault and battery on a person 14 or older, and intimidating a witness/juror/police/court official,\" according to ICE.\nDespite the lengthy list of alleged heinous offenses, he was released on bail with a GPS tracker the day after ICE sent its detainer request.\nFortunately, ICE agents were able to apprehend the suspect without Massachusetts' cooperation, and he remains in federal immigration custody.\nIn late December, the Revere Police Department arrested Leonardo Andujar Sanchez, a 28-year-old Dominican national who had entered the country illegally.\nSanchez was apprehended at a Quality Inn in Revere, one of the 128 hotels in Massachusetts functioning as an emergency shelter.\nAccording to authorities, Sanchez had a loaded AR-15 and roughly 10 pounds of fentanyl in his possession.\nHealey has claimed that those residing in state-run shelters are subject to background checks, prompting the Massachusetts House Republican Caucus to question how Sanchez was allowed into the Quality Inn.\n‘She is 100% lying about that.’\nThe governor claimed that Sanchez had not applied for the state's emergency assistance program but was residing in the shelter with a family unit.\nLast week, ICE lodged a detainer request against Sanchez. At this time, he is in state custody, and it remains to be seen whether local officials will comply with the request and turn him over to federal agents.\nSanchez's arrest drew national attention, which may have prompted Healey to announce that the state would perform sweeps of its shelter units, beginning with the Revere location.\nHealey deflected any blame for the situation, instead pointing fingers at the Biden administration for the ongoing immigration crisis and its overwhelming financial burden on Massachusetts residents.\nInside Healey's shelters\nMore than 1,000 incidents were reported at Massachusetts' state-run shelters from 2022 through 2024, according to records obtained by the Boston Herald and reviewed by Blaze News.\nThe more than 3,000 pages of incident reports detailed a long list of alleged offenses, including death threats, theft, assault, drugs, and rape.\nOne of the most alarming reports detailed allegations that a father residing in one of the state-run shelters had raped his minor daughter \"multiple times, both on the journey to the U.S. and in the U.S.,\" resulting in her pregnancy.\nAt the time, Jon Fetherston was the former director of the migrant shelter, a Holiday Inn, and he was the one who reported the father to authorities.\n‘Nobody was being screened.’\nFetherston told Blaze News, \"I saw domestic violence. I saw gang violence. I had three women tell me they were raped by residents of the shelter. Two, I personally took to the police station, and a third, I had Department of Children and Families remove her from the shelter because she was raped by her own father, who got her pregnant.\"\nThe father became \"very agitated and started yelling at\" staff when his daughter was removed from his custody, according to an incident report. He was ejected from the shelter and offered a taxpayer-funded ride to another shelter location, which also housed women.\nFetherston explained that the \"big issue\" with the shelter was that he was not provided with the resources necessary to manage safety. He stated that the shelter had third-party security but that the security company struggled with staffing issues and the personnel were not always qualified.\nHe noted that the criminal activity he witnessed at the shelter spilled into the community.\nWhen asked about Healey's claims that all those residing in the shelters are vetted, Fetherston told Blaze News, \"She is 100% lying about that.\"\nHe stated there were \"numerous\" occasions when families scheduled to arrive at his facility for shelter accommodations never showed up. The state told Fetherston not to \"worry about it\" and that a new family would be sent to the shelter the same day, he said.\n\"Another family would show up and tell me their name, and their name would be different than the IDs that they presented me. So, no, nobody was being vetted. Nobody was being screened,\" Fetherston said.\nHe called the current shelter system \"pure chaos,\" adding that the state needs to implement proper vetting procedures.\nFetherston questioned whether Healey's shelter sweeps were actually happening.\n\"I'll believe it when I see it, because I don't think it's going to happen. I think she's just placating the public with that,\" he said. \"Her words and her actions do not match.\"\n\"There's 3,000 pages worth of documents of heinous crimes — sexual abuse, rape, drugs — and you're allowing it,\" Fetherston said, referring to Healey. \"But, more importantly, you're making the taxpayer fund this.\"\nThe state's taxpayers spent about $1 billion last year supporting the costly shelter system. Following the announcement of the inspections, Healey requested another $425 million from the state's reserve account to keep its emergency shelter program operating for another six months.\n\"Maura Healey has decided to protect criminals over the safety and welfare of women and children in the Commonwealth of Massachusetts. She's put every woman and child in the state in jeopardy, because we don't know who these people are,\" Fetherston added. \"Eventually, something horrible is going to happen.\"\n\"Shame on the governor,\" he remarked.\nFetherston told Blaze News that he had a brief conversation with Healey in December 2023 during the Army-Navy football game at Gillette Stadium, where he expressed his concerns to her about shelter safety. He said Healey instructed him to contact her office for further discussion. However, after he reached out several times in the following weeks, Healey's office never returned his calls.\n‘We are going to get to the bottom of why that wasn't happening.’\nPaul Craney of the Massachusetts Fiscal Alliance called Healey's \"failure to ensure\" safety at the state's shelters \"a shocking betrayal of both the residents relying on these facilities and the taxpayers funding them.\"\nCraney told Blaze News, \"The Massachusetts right-to-shelter law was originally passed to ensure that the indigent poor of the Commonwealth wouldn't be left out in the cold, not to act as a clearing house for incoming migrants. Instead of being safe havens for people in trouble, these shelters are now hot spots for criminal activity and danger.\"\n\"It's unacceptable that it took years of disturbing incidents, including theft, assaults, and even sexual assault, to prompt action,\" he continued. \"Governor Healey can order all of the sweeps and background checks she wants, but when it boils right down to it, we have no idea who the people crossing the border really are.\"\nCraney questioned how the state could run proper, thorough background checks when some individuals have provided false names.\n\"Massachusetts families deserve better than an administration that prioritizes excuses over solutions. Governor Healey needs to stop the blame game and reform the generous benefits and sanctuary state policies that are pulling so many illegal migrants towards the Massachusetts shelter system,\" he remarked.\nFrom bad to worse\nIn the wake of the release of the shelter incident reports and Sanchez's arrest, Healey made an alarming confession.\nAfter repeatedly claiming that those residing in state-run shelters must undergo background checks, she stated on January 10 that she had recently learned Criminal Offender Record Information checks had not always been conducted.\n\"We are going to get to the bottom of why that wasn't happening,\" Healey stated. \"CORI checks were being performed at those temporary respite centers, the overflow sites where new arrivals were going, and it was my understanding that they were being conducted system-wide.\"\nThe massive oversight prompted Healey to tap former Boston Police Commissioner Ed Davis to conduct an independent investigation into the matter, as well as provide recommendations on how the state could improve its security protocols.\nA spokesperson for Healey's office told Blaze News, \"As a former attorney general and prosecutor, the governor has no tolerance for any criminal activity at these facilities. It's why our administration has taken a number of actions to protect safety in our communities.\"\nThe governor's office noted that shelter providers are required to report criminal activity, and \"every shelter resident is already subjected to background checks, including SORI [Sex Offender Registry Information] checks and a [sic] warrant checks.\"\nThe spokesperson noted that CORI checks were previously only required for those entering the state's overflow sites but that Healey extended the requirement to all shelters.\nThe state's inspection of its shelters is \"almost complete,\" the spokesperson told Blaze News.\n\"We will be phasing out the use of hotel shelters by the end of 2025,\" the statement continued. \"And for the more than 6,000 residents who we have helped get work authorizations, every one of them is required to undergo additional vetting including fingerprinting.\"\n\"In the instance of violations of shelter policy, residents are disciplined, including up to removal from the program. Incidents that allege criminal conduct are referred to law enforcement,\" the spokesperson told Blaze News.\nLike Blaze News? Bypass the censors, sign up for our newsletters, and get stories like this direct to your inbox. Sign up here!\nWant to leave a tip?\nWe answer to you. Help keep our content free of advertisers and big tech censorship by leaving a tip today.\nWant to join the conversation?\nAlready a subscriber?\nCandace Hathaway is a staff writer for Blaze News.\ncandace_phx\nmore stories\nLoad More\nRelated Content\nLoad More\n© 2026 Blaze Media LLC. All rights reserved.\nGet the stories that matter most delivered directly to your inbox.\nBy signing up, you agree to our Privacy Policy and Terms of Use, and agree to receive content that may sometimes include advertisements. You may opt out at any time.",
  "word_count": 2330,
  "scraped_at": "2026-02-14T12:11:13.708675"
}