{
  "article_id": "14b9c7d0fb96",
  "url": "https://www.yahoo.com/news/why-coach-k-likes-um-160257888.html",
  "title": "Why Coach K likes the UM team and the player he predicts will be a pro . And football notes",
  "date": "20230315T170000Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Why Coach K likes the UM team and the player he predicts will be a pro. And football notes\nA six-pack of Miami Hurricanes notes as we await UM’s first-round men’s game against Drake on Friday in Albany, N.Y. (7:20 p.m., TBS) and the resumption of spring football practice on Tuesday:\n▪ Former Duke coach Mike Krzyzewski, now doing a show on Sirius XM, like this Canes basketball team:\n“They would be my dark horse if [Norchad Omier, who has an ankle injury], is healthy. He got hurt in the Duke game in the ACC Tournament. He was the one guy who is so-called undersized in height, but not in strength. I mean, he’s a strong player who did a good job against our height and athleticism. And he’s the missing link for them.”\nOmier has been rehabilitating his injured ankle all week, but his status for Friday remains uncertain, coach Jim Larranaga said Wednesday.\nHe did stretching and shooting on Wednesday. ”Whether he can actually run and jump, we’ll have to wait and see that [Thursday],” Larranaga said. “We’ll keep our fingers crossed whether he’s able to suit up on Friday.”\nKrzyzewski loves UM 6-6 guard Jordan Miller, who averaged 15.3 points, 6.2 rebounds, 2.7 assists, 1.3 steals and shot 54.1 percent from the field and 36 percent on threes.\n“I think the kid who played as well as anyone in our league was Jordan Miller,” he said. “[He’s] terrific. He’s gonna be a pro. He’s left-handed. He’s got length. He’s got a pro body, and he played like a pro. And so then you have guards, [Nijel] Pack and [Isaiah] Wong, right? Miami can match up against anybody. Their guards are outstanding.”\nAnd Coach K said: “I like Jim Larranaga. He’s one of the really outstanding coaches and good guys… If [Houston’s Marcus] Sasser’s not ready, Miami, and they still might advance if Sasser’s ready if they meet in the Sweet 16.”\nKrzyzewski’s show, Basketball and Beyond with Coach K, is available on the SXM App:\n▪ More UM feedback:\nMore in Sports\nBarcelona fans tear into several players amid Atlético disaster\nESPN’s Seth Greenberg, before the Omier injury: “They play with great spacing, no ego. They have shot makers. This team is dangerous in the NCAA Tournament.. [They have] guard play, shot makers, floor spacers and are committed defensively.”\nESPN’s LaPhonso Ellis, also before the Omier injury: “They have four guys who can beat you off the bounce and knock down the three. They can space the floor, kick out for threes. Omier has been absolutely terrific.”\n▪ Coach K is hardly alone in his admiration of Miller, who has been one of the market’s most under-the-radar really good players.\n“Jordan Miller is just a complete player,” Larranaga told Joe Zagacki on WQAM’s Hurricane Hotline. “He’s probably the most underrated player in the country, certainly the most underrated in the ACC.”\n▪ Quick Canes stuff: The improvement of guards Wooga Poplar and Bensley Joseph has been helpful this year. UM people think Poplar - who’s very talented - will take another big jump next year.\nPoplar’s three-point shooting rose from 21.4 last season (6 for 28) to 40.5 percent (34 for 84) this season.\nPoplar and Pack “can share that point guard position, but they can also play together,” Larranaga said. “They play off each other on offense; Bensley can play the point and let Nijel shoot. Nijel can play the point and let Bensley shoot.”...\nSpero Dedes and Deb Antonelli call UM-Drake on TBS…\nThe Sunday tip time for UM’s potential second-round game (against the Indiana-Kent State winner) will be announced late Friday night…\nThe UM women open the NCAA Tournament at 2 p.m. Saturday against Oklahoma State on ESPN.\n▪ UM vs. Drake is a 5 vs 12 matchup, with UM the fifth seed.\nSince the tournament expanded to 64 teams in 1985, Number 12 seeds have a 55-99 record against the No. 5 seed. Two No. 12 seeds won last year: New Mexico State beat UConn 70-63, and Richmond beat Iowa 67-63 to advance to the Second Round.\n▪ Through three football practices, some quick thoughts on UM’s defense, as the Canes take a respite this week for spring break:\nNew coordinator Lance Guidry - who had one of the nation’s best defenses at Marshall last season - will do a much better job disguising coverages than predecessor Kevin Steele did. The unit won’t be nearly as vanilla.\nThe front four - which so far this spring is missing likely starters Akheem Mesidor and Leonard Taylor and possible starters Jahfari Harvey and Jared Harrison-Hunte because of injuries - is very solid. All four should be back well before the season starts.\nBut depth at linebacker and safety is shaky. And the cornerback room has no highly-rated NFL prospect. It’s a decent -- not exceptional -- defense, on paper, one that needs a creative coordinator to lift them….\nTe’Cory Couch, who has played by far the most snaps at UM of any corner on the roster, has been working at the star position, which is a nickel role.\nIf he stays there, that would leave transfers Davonte Brown (UCF), Terry Roberts (Iowa) and Daryl Porter Jr. competing on the boundary to replace Tyrique Stevenson and DJ Ivey. Keep an eye on talented Chris Graves, the second-year corner…\nCorey Flagg Jr. held off former UCLA player Caleb Johnson last season and has been productive. But because of physical limitations, it’s not necessarily a good sign if Flagg keeps the starting middle linebacker job. Washington State transfer Francisco Mauigoa got some first-team work ahead of Flagg last week. Johnson has moved on…\nWith Mesidor and Harvey out, many of the spring defensive end snaps will go to Chantz Williams and Nyjalik Kelly, who impressed everyone as a freshman. Three freshmen will look to crack the rotation -- Collins Acheampong (injured for now), Reuben Bain and Jayden Wayne. Thomas Davis, a Manny Diaz recruit, also has been sidelined. Cyrus Moss, a heralded pass rusher in the Nevada prep ranks, must take a big step in year two….\nWith Taylor and Harrison-Hunte out, UM can get a long look this spring at defensive tackle transfer additions Thomas Gore (Georgia State) and Branson Deen (Purdue). Both are skilled pass rushers, according to Pro Football Focus; the hope is they will be strong run stuffers against high-level competition....\nUM’s spring game on April 14 at DRV-PINK Stadium in Fort Lauderdale won’t be on live television; it will be streamed on ACC Network’s digital platform available on the ESPN App.",
  "word_count": 1098,
  "scraped_at": "2026-02-14T13:07:46.313007"
}