{
  "article_id": "14cbf65b2183",
  "url": "https://www.the42.ie/ireland-wnt-8-6167751-Sep2023/",
  "title": "What are the key issues for Ireland as they return to action post World Cup ? ",
  "date": "20230917T124500Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "THE REPUBLIC OF Ireland Women’s National Team kickstart a new campaign this week.\nAfter their first-ever major tournament in the 2023 World Cup and the messy departure of Vera Pauw as manager, the inaugural Uefa Women’s Nations League moves into full view.\nUnder the watchful eye of interim manager Eileen Gleeson, Katie McCabe and co. face Northern Ireland at the Aviva Stadium on Saturday and Hungary in Budapest next Tuesday.\nOver 30,000 tickets have been sold for the historic first-ever women’s international at the Aviva, as the Girls In Green look to make a winning return to action.\nHere’s five issues or questions they’ll have to contend with:\n- Fallout from Vera Pauw’s exit\nIt’s been an eventful few weeks, to say the least. And that’s without getting into the lead-up to 29 August, when the FAI decided against renewing Pauw’s contract. A short statement was released after a marathon board meeting as the clock neared 11pm, and silence followed from the Association until Thursday’s media briefing with Jonathan Hill and Mark Canham.\nAn unhelpful vacuum was created in the interim, while Pauw gave her side of the story in an explosive statement and RTÉ interview. Her former players have stayed quiet — publicly, anyway — through the scrutiny and noise and it remains to be seen if and how they will address the exit in the coming days.\n“As we go into camp next week, I’m sure there will be comments from some our players on what has gone on,” Director of Football Canham said, with Chief Executive Hill adding: “We will not curtail anybody who wants to talk to a specific topic.”\nTyler Toland’s return to the squad will also pose further questions, meaning this story will continue to run.\n- New coaching faces\nGleeson is at the helm in a caretaker capacity, having acted as Pauw’s assistant in the first half of her tenure. The Dubliner departed to take charge of Glasgow City FC, and she is now the FAI Head of Women’s and Girls’ Football.\nGleeson will be assisted by Colin Healy and Emma Byrne. Former Ireland midfielder Healy has predominantly worked with men’s teams, between the U19 national team and Cork City, while this is a major step in Byrne’s coaching journey. The ex-Ireland captain and legendary goalkeeper is the country’s most capped women’s player with 134 appearances, while she enjoyed a glittering club career at Arsenal.\nShe will be a popular choice among the squad, having played with so many before McCabe followed in her footsteps as captain in 2017. Her appointment as assistant rather than goalkeeping coach is an interesting one, as Richie Fitzgibbon takes charge of that department. Fitzgibbon is FAI High Performance National Coach Educator, he holds a Uefa A Goalkeeping Licence and has worked with several underage international teams.\n- What’s the calibre of group opposition?\nIreland will be firm favourites to top Group B1. On paper, Northern Ireland, Hungary and Albania are lesser opposition — and significantly so. This presents a very different challenge.\nExplained: What’s at stake for Ireland WNT in ‘caretaker’ Nations League campaign\nThe Girls In Green are 24th in the Fifa World Rankings, updated after the World Cup, and 31st in Uefa’s coefficient points system. Northern Ireland are 47th/44th; Hungary are 42nd/26th; and Albania are 72nd/19th.\nThe focus is on the North, first and foremost. The 2022 European Championships was their first major tournament, while they have a new manager at the helm in Tanya Oxtoby. Simone Magill is among their best players, with the Republic winning 4-0 when they last met in August 2018.\n- Will there be a tactical change from the World Cup?\nPauw’s defensive approach and 5-4-1 formation served Ireland well through the years, though calls have heightened for a more front-footed style. Gleeson will likely lean into this as she makes her mark, but it’s important that defensive solidity remains. It will be interesting to hear from her on this in media duties through the week.\nIreland have shown promise when they let the shackles off and play with a bit more freedom — the first half against Canada at the World Cup springs to mind. The positioning of McCabe and Denise O’Sullivan is key, the world-class duo excelling in more offensive roles. Megan Connolly should return to her defensive midfield berth in due course, allowing for meaningful tactical change.\nTheir goalscoring woes will be in focus going forward. The Girls In Green have scored just four times in eight games in 2023; three of those in a friendly against Zambia and all from, or directly after, set-pieces. An out-and-out striker is needed, or a pacy goal threat to play off Kyra Carusa.\n- Squad changes\nGleeson has named a 25-strong squad for the upcoming double-header, with Toland undoubtedly the standout name. The Donegal midfielder returns for the first time since November 2019 after a public falling out with Pauw.\nSavannah McCarthy, Éabha O’Mahony and Emily Whelan are also recalled as Gleeson puts her stamp on the set-up. Shamrock Rovers defender McCarthy is back in the fold after an ACL injury, while O’Mahony and Whelan have been impressing under the radar at University of Texas and Glasgow City respectively.\nInjuries aside, other changes to the World Cup squad see Saoirse Noonan and Hayley Nolan come in, and Izzy Atkinson and Ciara Grant drop out along with Áine O’Gorman and Harriet Scott, who both recently retired from international football.\nThe FAI’s injury list is striking: Niamh Fahey, Megan Campbell, Aoife Mannion, Jessie Stapleton, Claire Walsh, Tara O’Hanlon, Roma McLaughlin, Jess Ziu, Sinead Farrelly and Leanne Kiernan.\nThe squad breakdown is as follows: Championship (9), WSL (6), NWSL (3), Continental Europe (3), SWPL (2), American Colleges (1) and WNL (1).",
  "word_count": 958,
  "scraped_at": "2026-02-14T13:25:55.535591"
}