{
  "article_id": "14d4bbbc57b1",
  "url": "https://fansided.com/international-womens-day-amy-trask-redefined-female-leadership",
  "title": "Merit over labels : How Amy Trask redefined female leadership in the NFL",
  "date": "20250307T201500Z",
  "domain": "fansided.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Amy Trask’s current profile picture is a fan-made meme: A headshot with laser beams shooting out of her eyes and a crown on her head. If it wasn’t evident by now, Trask, the former CEO of the then-Oakland Raiders, has fully embraced a 20-plus year nickname, the “Princess of Darkness.”\nOriginally intended as an insult given to her by anonymous NFL executives and later published in Sports Illustrated, the moniker was one that Trask not only owned but leaned into. Why reject it? Much like the Raiders themselves embraced that outsider, intensely fierce mentality, the first-ever female CEO of an NFL team made it part of her identity. And according to Trask, fans ran with it, holding up “Princess of Darkness” signs — and eventually, immortalizing the nickname with that laser-eye meme, a classic internet symbol of power and intensity.\n“I’ll forever be thankful to the people who gave me that name, notwithstanding that it was intended as an insult,” says Trask, now a CBS Sports analyst.\nShe turned what was likely meant as criticism into fuel. And she’s carried that self-assured energy throughout her career — merit over everything. The Princess of Darkness didn’t just survive 30 years in the NFL boys’ club, she thrived. Today, you’ll find her influence around the industry, reshaping how women are perceived in sports leadership, because for Trask, gender doesn’t define, merit does.\nFanSided is celebrating Women's History Month and International Women's Day by recognizing the women transforming the sports landscape on and off the field and redefining what it means to lead and inspire. Check out the full list here.\nBreaking front-office barriers\nTrask first joined the Raiders organization as an intern in 1983 while attending law school at USC. By 1997, she was named CEO and the highest-ranking female executive in the NFL — running the team as owner Al Davis’ right-hand woman.\nIn that aforementioned 2002 Sports Illustrated feature, Montreal Expos president Tony Tavares said, \"Al could search his entire lifetime and not find someone as trustworthy and loyal as Amy, or someone who could represent him better than she does.\"\n\"If your goal is to win, hire the best people — regardless of gender,” says Trask. And that’s what Davis did. “I owe my career to the fact that decades and decades and decades ago, Al did what is now being addressed. He hired Tom Flores [first Hispanic head coach]. He hired me. He subsequently hired Art Shell [first African-American head coach]. He didn't give a damn what your race was, your gender, your religion. Or any individuality that has no bearing whatsoever on whether you can do a job.”\nAnd to her point, Trask didn’t just earn a seat at Davis’ table, she changed the way the table operated. The impact she had on the Raiders during her 16-year tenure as CEO cannot be understated, keeping the franchise financially stable, navigating negotiations and implementing crucial controls that had been previously lacking. \"One of the things I’m most proud of is putting in a system of internal controls and checks and balances,\" she says.\nNot always easy next to Davis. Trask secured credit facilities to keep the team afloat, often facing immense pressure as a result of Davis' financial decisions. \"I remember at one point, during a very, very trying time, I asked him, ‘How do you sleep at night?’ And his response was, ‘I sleep at night because I know you don’t.’\"\nTheir dynamic was tough, she says, but deeply respectful. Their philosophies were similar, and their relationship was one built on trust, high expectations, a shared commitment to winning and a standard of accountability that shaped Trask’s leadership style — Davis expected nothing less than excellence.\n\"At one point, Al spit out, ‘You negotiate like a girl,’” Trask says. “I wasn’t offended. I was the girl he hired. When I completed the negotiation and achieved the highest valuation ever at that time, I dropped the documents in front of him and said, ‘Like a girl.’ And he just laughed and said, ‘You’re right.’\"\nThat became the title of her 2016 book, You Negotiate Like a Girl: Reflections on a Career in the National Football League.\nDeepening connections with a loyal fan base\nTrask strengthened the team’s connection with its fan base, spending time at tailgates and ensuring that Raiders supporters were not just appreciated, but cherished.\n“I learned the moment I joined the organization how important the fans are,” she says. “There is no league as we know it without fans. I understood and believed and advocated from the time I joined the organization that the fans were not only to be thanked, but to be cherished. There wasn't a home or road game at which I didn't spend time in the parking lot, walking with the fans, visiting their tailgates.”\nSo what’s her view on the move to Vegas? Nuanced. “I'm of mixed mind in the following sense,” she says. “For the fans who are following the team to Las Vegas and are attending games and loving the new stadium, I'm thrilled for them. For the fans in the Bay Area who are heartbroken that the team left again, I'm heartbroken for them.\n\"I will defend Raider fans until my last breath.”\nUsing language to shape perception\nAfter her 30-year tenure with the Raiders came to an end, Trask moved on to CBS Sports as a studio analyst. She also led the BIG3 as CEO and then Chairman of the Board. And when the BIG3 needed a new head coach, WNBA legend Nancy Lieberman was Trask’s first suggestion. The league’s leadership, including Ice Cube and Clyde Drexler, agreed — they saw her qualifications, not her gender.\nLieberman became the first and only female head coach in the league at the time and led her team to a championship in that first season. The following year, they brought in Lisa Leslie as the league expanded. And what happened? A championship in her debut season.\n“These are two women coaching all male teams in a league in which all other coaches are men,\" says Trask. “When Nancy won the championship, we were at the press conference, and every single question to the players asked about playing for a woman — ’What's it like playing for a woman?’ ‘How's it going playing for a woman?’ Finally, one of the players grabbed the microphone and said, ‘Stop putting woman in every question. We think of her as our coach.’ And my heart just wanted to pop with happiness. I got goosebumps when he said that.”\nFor Trask, true equality in sports happens when gender stops being the focal point of someone’s qualifications or achievements. She has consistently echoed this in her own career, focusing on merit and contribution in hiring and leadership decisions, not identity. Because much has changed within the sports landscape since she entered the NFL, but when is that change meaningful?\n“I’m often asked, [when a woman is hired], 'Are you excited?' And my answer is sure, but what's going to be truly exciting is when people are hired without regard to race or gender or any other individuality which has no bearing whatsoever on how they do their jobs — and when that is no longer newsworthy.”\nOne of the more significant shifts in women's roles within the NFL in particular has been what Trask calls on-field or game-related positions. At the start of her career, women were absent from coaching staffs, training rooms and officiating crews — their roles were largely limited to finance and legal departments, she says. The landscape has evolved, and it’s a credit to both individual trailblazers and shifting industry mindsets.\n“When Sarah Thomas was picked to officiate a Super Bowl, I was asked umpteen times — and the question was phrased really as a suggestion — that she was put in that role simply so the league could make a statement about gender inclusiveness,” Trask says.\n“And I laughed and said, ‘No, let me explain one thing to you, to everyone who said that to me. The league cares about one thing in officiating the Super Bowl, and that’s that there are no officiating errors. That the officiating is not a subject of discussion after the game is over. So when they picked Sarah Thomas to be one of the officials in that game, it wasn't because she was a woman. It was because she was suited for that job. I think that's a very, very significant step.\"\nTrask’s ultimate vision is a world in which women being hired, promoted or achieving success in sports is no longer buzz-worthy — and the language around it shifts — because it’s simply normal.",
  "word_count": 1451,
  "scraped_at": "2026-02-14T12:43:03.457494"
}