{
  "article_id": "14d7cd16916b",
  "url": "https://www.twtd.co.uk/ipswich-town-news/41672/edmundson-we-let-mcgreal-down-massively/onthisday",
  "title": "Edmundson : We Let McGreal Down Massively - Ipswich Town News",
  "date": "20231208T023000Z",
  "domain": "twtd.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Wednesday, 8th Dec 2021 10:49\nCentre-half George Edmundson admitted that the players let down interim manager John McGreal during last night’s woeful 2-0 defeat at Charlton.\nMcGreal, also a centre-half in his playing days, took temporary charge on Monday following former boss Paul Cook’s sacking on Saturday.\nAsked whether it was a difficult night, the 24-year-old, who was still in his kit following a lengthy post-match dressing-room post-mortem, said: “It was. We’ve had a long old talk in there. We knew we weren’t good enough tonight and it’s something we need to really go home and reflect on and look at ourselves in the mirror.”\nDid the weekend events take it out of the squad? Is that an explanation for the under par display? “We said before the game, that’s not an excuse. Things like that happen in football. We’re all professionals.\n“We’ve just got to move on from it and can’t use it as an excuse. We know we weren’t good enough tonight.”\nHe added: “You’re kind of wondering what’s going on but, like I said, you can’t use it as an excuse, I’ve been in this situation before, I’m sure all the other lads have.\n“We all know how it works and what happens. We’re professionals and we’ve just got to be professional.”\nWhy does he think the display was so poor? “A few things really. I thought we started off well in the first 25 minutes, were growing into the game and then I think the goal killed us, we could never recover from that really.”\nEdmundson, who joined Town from Rangers in the summer, was asked whether he felt the players let down McGreal.\n“Massively,” he admitted. “Fans, they travelled in their numbers. It’s obviously hard for John because he’s only been in for a day trying to get his point across to us. I think you could see it in glimpses but we have let him down tonight massively.”\nThe one-time Oldham youngster says McGreal hadn’t had time to tweak too much before the visit to the Valley.\n“He’s only been in for a day so he’s not tried to reinvent the wheel as such,” he said. “Like he’s said, he’s just tried to give us a few key pointers, which have come out in glimpses tonight but a game of football is 90 minutes and we’ve probably only shown it for 20, 25 minutes of the game.”\nAt the end there was an ugly confrontation between frustrated fans and players, and while some of the reactions were clearly over the top, Edmundson can see why supporters were exasperated.\n“Obviously, if I was in their shoes, I would be frustrated if I was watching my team playing like that,” he admitted.\n“I feel that frustration, we’ve spoken about it in the changing room in great depth, how we’ve got to be a lot better and show a lot more.\n“I think everybody’s come across with valid points. I don’t really say much in the changing rooms when we have discussions like that.\n“I feel like actions speak louder than words, so we can do all the talking we want in a changing room but we’ve got to go on to Wigan and put that into action.”\nThe result saw the Blues stay 11th but now nine points off the play-offs and 14 from the top two with a number of the teams above them having games in hand.\nEdmundson is well aware that the current position and the growing gap to the upper reaches is a concern.\n“We know that but in this league you’ve seen it year after year after year,” he said. “Teams go on a blip and then in the second half of the season they go on a mad run.\n“Everybody in this league beats everybody, it doesn’t matter where you are in the league. We’ve just to keep going, listen to John and take every game as it comes.”\nPhoto: TWTD\nPlease report offensive, libellous or inappropriate posts by using the links provided.\nOh and Phil, you forgot to add in his age\nI suggested Tony Pulis yesterday and got laughed off the messageboard but i hope after watching last nights disorganised cr@pfest i hope you can all see where i was coming from\nLet's see some of these thoughts translate into action !\nCOYB\nAfter you showered did you go and look how pretty you were and do your hair in the MIRROR, then I guess you went on your banking app to see if you 10k a week wages had gone in,\nThe players should look at the video of Nsiala with the fans to see what we are all feeling, I only paid £10 to watch on I follow, just think how much the 3000 fans paid in tickets and travel after a 8 hour+ day at work.\nStop tell us you let someone down go out there and put the effort in.\nWrong shape, selection of Donacien out of position, Evans Morsy Edwards Fraser and Bonne massively out of form and that should not have been allowed, surely McGreal had been briefed?\nWho exactly is accountable for picking that side?\nThat is the side and shape that has just cost Paul Cook his job. There's a clue there fellas, get it sorted there are huge and obvious priorities, like having a presence in the middle of the field, not hiding in front of the CB and going backwards and sideways like a demented crab.\nI had a chat with Wes Burns saturday and he indicated he would hopefully be back this weekend, thank the Lord !!\nSecond half Saturday we got better when we brought on Aluko, Humphreys and Pigott, Carrol has to be a better than Fraser and Evans put together, Chaplin looked purposeful last night.\nIts absolutely bl00dy obvious those players care, they should be where we start.\nFans are sick of the same rhetoric from so-called professional footballers!\nWhat about the 3k fans who braved the elements to watch that 5hit, any apologies for letting them down?\nEven the women are doing betters than u bunch of dickheafs\nYou need to login in order to post your comments",
  "word_count": 1035,
  "scraped_at": "2026-02-14T12:05:38.289002"
}