{
  "article_id": "14e40ba88515",
  "url": "https://www.sounderatheart.com/2023/09/match-preview-ol-reign-v-north-carolina-courage/",
  "title": "Match Preview : OL Reign v . North Carolina Courage",
  "date": "20230930T224500Z",
  "domain": "sounderatheart.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "OL Reign will be looking to get back on track on Sunday evening when they host the North Carolina Courage at Lumen Field. The game kicks off at 5 PM PT and will air on FOX 13+ locally, in addition to streaming on Paramount+.\nBoth teams are coming off a week of rest during the FIFA international window, where eight players joined their national teams. OL Reign will be slightly more rested, as the Courage played in the NWSL Challenge Cup final before the FIFA break, defeating Racing Louisville to earn back-to-back trophies.\nStarting centerback Malia Berkely will be out for the Courage, as she picked up a DOGSO red card in her last regular season game. Sofia Huerta and Rose Lavelle will also be out for the Reign.\n\"We're really hungry for results right now,\" defender Phoebe McClernon said in a pre-match press conference. \"We've had a few rough turnouts – whether that was because of our performance or the performances we were playing against or just the nature of soccer, results haven't exactly been going our way. And I think we're really hungry to win and we're gonna get after it.\"\nHere's everything you need to know ahead of the match.\nRecent Results\nThe Reign and Courage have both struggled recently. North Carolina is 0-3-2 in its last five matches, while the Reign are 1-4-0.\nOL Reign is coming off a 2-0 road loss to rival Portland, while the Courage fell 2-1 on the road against the Orlando Pride.\nStandings\nNorth Carolina sits in fourth heading into the weekend with an 8-7-4 record (28 points). OL Reign is just a point behind them in fifth with an 8-8-3 record (27 points). After 19 games, just five points separate second and seventh place.\nHead to Head\nThe Reign have historically struggled against the Courage, who dominated the league between 2017 and 2019. OL Reign are 3-10-2 all-time against North Carolina, but they have a better home record at 2-2-2.\nThe two sides faced off in May, which resulted in a 1-0 road loss for the Reign.\nQuick Stats\n- North Carolina has scored 27 goals while conceding 21. The Reign have scored 25 and conceded 23.\n- Kerolin has 9 goals this season and is a contender for the Golden Boot.\n- Kerolin and holding midfielder Narumi Miura each have three assists.\n- Megan Rapinoe has 49 regular-season goals. If she scores her 50th goal, she will become just the second player to score 50 goals for one club, joining Christine Sinclair.\nWhat to Watch\nNorth Carolina will dominate possession\nThe Courage average 60% possession in a match. Their offensive and defensive approach relies on the team keeping the ball away from the opposition. If you watch the Courage, you'll notice that they try to take no more than two touches before finding a teammate.\nTheir system relies on constant movement and quick passing. As a result, the Courage lead the league in passes, short and medium-length passes completed, and passes into the final third (Reign are second in that category).\nTo counter that, the Reign will need to be organized and really lethal in transition – and punish the Courage when they give the ball up.\n\"There's a very clear identity of what they believe in. You've got to acknowledge that they want the ball a lot, which we're actually all right with,\" head coach Laura Harvey said. \"We're fine with teams wanting the ball. We've always been a team where defensively, we believe that we can make it difficult for teams to break us down. So, I think just being very solid defensively and being deadly in transition is key against them.\"\nThey can still play more direct\nIf there isn't a pass available, especially along their backline, Courage players carry the ball into space. The Courage lead the league in carries, with left back Emily Fox and Kerolin being the primary players who carry the ball vertically.\nAnd while it can sometimes feel like a slow build-up as the Courage move the ball around their backline, they still have the speed to strike quickly when they see a defense is vulnerable.\nThis goal from Kerolin demonstrates their ability to play more vertically when the opportunity is there. Kerolin carries the ball into space, does a quick give-and-go with her teammate, and is off to the races behind the defense.\nKerolin has the speed to get behind defenses over the top as well, and the Reign will need to keep her in front of them at all times.\nWhile the Courage are not a high-pressing team, they are a team that likes to put pressure on their opponents and close down on the ball quickly. And when they do force a turnover high up the field, they know how to pounce in transition.\nThe Reign will have to be much better on the ball as they build out of their defensive third, or they will be punished.\n\"I think it's just about team defending and limiting their opportunities, and keeping our numbers behind the ball when we're defending, going organized, going together,\" McClernon said ahead of the match.\nHome dominance\nWhile the Reign have struggled mightily on the road this year, they are still dominant at Lumen Field, with a 6-2-1 home record. Only Portland has an equal number of wins after nine home matches. North Carolina, meanwhile, has six losses on the road, tied for the most in the league.\nIf the Reign want to qualify for the playoffs and find momentum heading into the postseason, they need results in their last two home matches. With the Reign sitting in playoff position heading into the weekend, getting points against the Courage will be an important push.\n\"We have our playoff destiny in our own hands currently,\" Harvey said ahead of the match. \"Getting points this weekend will help solidify that – there's no better task than that.\"\nInjury / Availability Report\nOL Reign\nOUT: Sofia Huerta (leg), Rose Lavelle (leg)\nNC Courage\nOUT: Emily Gray (SEI – knee), Riley Jackson (D45 – foot), Estelle Johnson (excused absence), Rikako Kobayashi (knee), Clara Robbins (SEI – lower leg), Meredith Speck (SEI – knee), Olivia Wingate (mid-body), Malia Berkely (suspension)\nHow to Watch\nOL Reign kicks off against the North Carolina Courage at 5 PM PT on Sunday, Oct. 1. The match will air on FOX 13+ in Seattle. It will also be available on Paramount+ in the U.S., TSN+ in Canada, and the NWSL website for other international viewers.",
  "word_count": 1091,
  "scraped_at": "2026-02-14T12:23:53.238484"
}