{
  "article_id": "150cd0536b6f",
  "url": "https://chimpreports.com/rogers-mato-strikes-real-star-accolade/",
  "title": "Rogers Mato Strikes Real Star Accolade",
  "date": "20230404T150000Z",
  "domain": "chimpreports.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Kampala Capital City Authority Football Club (KCCA FC) and Uganda Cranes lanky forward Rogers Mato has scooped the Real Star Sports accolade as the best of March.\nMato was among the seven sports personalities recognized for their excellence off his individual brilliance in March thanks to his poacher’s instincts. The awards ceremony happened at Lazio Bar and Restaurant in Kololo.\nLast month, the speed merchant scored two goals for KCCA FC, one against Arua Hill Sports Club in the StarTimes Uganda Premier League (SUPL) and one against Mbarara City in the Stanbic Uganda Cup round of 16 at the Phillip Omondi stadium, Lugogo.\nHe also scored Uganda Cranes’ lone strike against Tanzania’s Taifa Stars in the return leg of the 2024 Africa Cup of Nations qualifiers at the Benjamin Mkapa National stadium, Dar-es Salaam.\nHis goal under floodlights brought Uganda Cranes on level terms with second placed Tanzania (4 points) in group F with two more games to wind-up the campaign.\nUganda Cranes remained third while Algeria has maximum points (12) with Niger on the bottom (2 points).\nRally\nThe Moil rally crew of Yasin Nasser and Ali Katumba won the category. The crew finished second at the Kenya Equator Rally which doubled as the second round of the African Rally championship.\nNasser and Katumba beat Jas Mangat/ Kamya who finished third at the same event alongside Joshua Muwanguzi and Nakigozi who won the Jacob Oulanya memorial autocross in Omoro.\n“This is a good motivation for us to continue raising Uganda’s flag higher. Next wehave the Pearl of Africa Uganda rally and hope to be here again,” said navigator Ali Katumba.\nIn woodball, Real Star Joyce Nalubega won the first beach circuit with 39 strokes beating her closest challenger Lillian Zawedde by 10 strokes.\nNalubega, who joined the ministry of public service team from Eminents, was also on form winning the stroke singles at the Kyambogo Open with 97 strokes, one better than teammate Joan Mukova.\nShe called off the fruitful month with another podium finish taking silver in the women’s doubles of the women’s day championship.\nIn Boxing, Ratib Muwonge became the 11th Ugandan to win an African Boxing Union (ABU) belt. He reached the milestone after beating Tanzania’s Alberto Clement in the super lightweight category by unanimous decision at the 12th round at Club Obligato.\nKampala Old Boys (KOBs)’ Collin Kimbowa toppled the category. He played five games in the month of March helping his club to win all.\nThrough his ball carrying abilities, he enabled his side dismantle opponents defence that pushed KOBs to finish the month on top of the table with 55 points.\nAll winners\nDarts – Sarah Makanga\nRugby – Collin Kimbowa\nTable Tennis – Pavin Nangonzi\nRally – Yasin Nasser & Ali Katumba\nWood all – Joyce Nalubega\nBoxing- Ratib Muwonge\nFootball – Mato Rogers",
  "word_count": 472,
  "scraped_at": "2026-02-14T12:39:50.269163"
}