{
  "article_id": "1531413537f2",
  "url": "https://retailtimes.co.uk/hublot-celebrates-arsenals-victory-in-the-2024-25-uefa-womens-champions-league-final/",
  "title": "Hublot celebrates Arsenal victory in the 2024 / 25 UEFA Women Champions League™ final",
  "date": "20250527T110000Z",
  "domain": "retailtimes.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Congratulations Arsenal Women! Saturday night, in a Estádio José Alvalade in Lisbon, the Gunners defeated Barcelona in the 2024/25 UEFA Women’s Champions League™ final. Hublot is the Official Timekeeper of the UEFA Women’s Champions League™ and was on hand to time the game. Referee Ivana Martinčić wore the Big Bang e Gen3 connected watch, while Hublot’s iconic Big Bang Fourth Official’s Board kept track of substitutions and added time.\nArsenal Women’s victory marks the second time the Gunners have won the UEFA Women’s Champions League™, last raising the trophy 18 years ago. The win was particularly sweet because Arsenal has been the competition’s ‘nearly’ side on many occasions in the intervening years, reaching 16 quarter-finals and eight semi-finals, without adding to its trophy cabinet. It has also been one of the dominant sides domestically, winning England’s Women’s Super League three times since its inception in 2011 and finishing runner-up this season. Overcoming Aitana Bonmatí’s Barcelona, which was on the back of a two-season UEFA Women’s Champions League™ winning streak, only added to the team’s joy.\n“What a match! What a victory! My heartfelt congratulations to Arsenal Women on your hard-fought and richly deserved victory. It was a joy for us all here in Nyon to follow your progress through the tournament and to serve as the UEFA Women’s Champions League™ Official Timekeeper. We know just how long the season is and how demanding it is to keep reaching new heights and to surpass yourselves, something we strive constantly to do here at Hublot. And you did it! That’s why it’s so exciting for us to be a first-hand witness as the women’s game goes from strength to strength, breaking new ground, challenging the status quo, writing new rules. Enjoy your victory!” stated Julien Tornare, Hublot CEO.",
  "word_count": 296,
  "scraped_at": "2026-02-14T12:50:17.693579"
}