{
  "article_id": "1534aee669eb",
  "url": "https://www.on3.com/teams/kentucky-wildcats/news/ksr-gameday-kentucky-takes-no-7-alabama-tuscaloosa/",
  "title": "KSR Gameday : Kentucky takes on No . 7 Alabama in Tuscaloosa",
  "date": "20230107T170000Z",
  "domain": "on3.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "KSR Gameday: Kentucky takes on No. 7 Alabama in Tuscaloosa\nGood morning, folks! It’s gameday. In just a few hours, the Kentucky Wildcats (10-4; 1-1 SEC) will head into Coleman Coliseum for an afternoon showdown against the No. 7 Alabama Crimson Tide (11-2; 2-0 SEC) in what will be a massive resume-building opportunity for the ‘Cats.\nKentucky has yet to earn a win against a team ranked among the Top 70 in the NET rankings (or against a Quad 1 opponent) but a win against Alabama would change that. The Crimson Tide checks in at No. 8 in the NET. Head coach John Calipari will have his hands full with star freshman Brandon Miller, who leads the team in scoring at over 19 points per game while hitting on 44 percent of his outside shots on high volume. Miller first announced himself to the college basketball world with a 36-point performance against Gonzaga earlier in the season but has actually been somewhat contained over the last three games. The future NBA draft pick is averaging just 15.3 points during that mini-stretch, although he’s still grabbing double-digit rebounds and shooting 50 percent from the field. Stopping Miller will be a priority for the ‘Cats.\nJunior guard Mark Sears will help with the scoring load as he chips in 14.6 points per outing on a 42.5 percent clip from distance. Along with Miller, two more freshmen make steady contributions for Alabama, including 6-foot-10 Noah Clowney (9.8 PPG, 8.7 RPG) and 6-foot-3 point guard Jaden Bradley (9.1 PPG, 3.8 APG), the latter being a former Kentucky target.\nLet’s dive into some more pregame material ahead of today’s tipoff.\nTV, Radio Information\nToday’s game tips off at 1 p.m. ET on ESPN with Karl Ravech and Jimmy Dykes on the call. If you can’t watch the game, you can listen in a variety of ways.\n- TV: ESPN\n- Local Radio: 630 WLAP, UK Sports Network\n- Online: iHeart\n- Satellite Radio: Sirius 135 or 190, SXM app 961\nThe KSR Pregame Show will begin at 10:30 a.m. live from KSBar and Grille, so come on by if you’re on your way to Rupp, or listen via 630 WLAP, 840 WHAS, and 98.1 The Bull or iHeart Radio.\nVegas, Computers\nRiding an eight-game losing streak against the spread, Kentucky is coming to Tuscaloosa as a 5.5-point underdog. The over-under is set at 152.\nThe most points Kentucky has gotten all season, it’s the third time Kentucky has been the underdog in 15 games to date; the first being at Gonzaga where Kentucky did not cover the four, then a small underdog versus UCLA in the 10-point loss to the Bruins. Kentucky hasn’t covered any spread since November 23 versus North Florida.\nKenPom currently projects a 78-72 Alabama victory, giving the Wildcats just a 30% chance to pull off the upset on the road in SEC play. ESPN’s Matchup Predictor gives Kentucky a 29.2 percent chance to sneak out with the win.\nTale of the Tape\nChin Coleman previews Alabama; Nate Oats talks some smack\nOn Friday morning, Kentucky assistant coach Chin Coleman spoke with reporters to preview Alabama. He broke down what to expect from the offense and how UK can slow down star freshman Brandon Miller, along with much more. You can hear everything he had to say below.\nLater in the day, Alabama head coach Nate Oats also spoke with the media. He quickly made headlines by calling Kentucky fans “spoiled” and compared them to Alabama football fans, which is kind of a compliment? But also not really.\nTop 10\n- 1Breaking\nFB commit\nIn-state star picks UK over UofL\n- 2New\nStaff Predictions\nfor UK vs. Florida\n- 3Breaking\n13-2\nUK Baseball Wins Opener\n- 4\nUK-UF spread\nCats a big underdog\n- 5New\nEye-Opening Addition\nto UK Football Staff\nGet the Daily On3 Newsletter in your inbox every morning\nBy clicking \"Subscribe to Newsletter\", I agree to On3's Privacy Notice, Terms, and use of my personal information described therein.\n“They’re spoiled. It’s probably like Alabama Football fans, to be honest with you. Like, we’re not in the College Football Playoffs and everybody’s upset and acts like it’s a bad year. We were probably — I mean, shoot, I don’t know what the final football polls were, but after I watched those two games previous, it looks like we might be in the top three or four teams in the country and still people are upset around here. Well, Kentucky’s not in the top three or four, people are probably upset there. They’re a really good team though.”\nCollege Basketball on TV today\nKyra Elzy explains the Dre Edwards situation\nKyra Elzy is standing firm in her position regarding former Kentucky Women’s Basketball star Dre’Una Edwards. Yesterday, Edwards released a statement on social media claiming that Elzy is refusing to sign a waiver that would allow her to play this season at Baylor. (Because this is Edwards’ second transfer and she didn’t graduate, NCAA rules say she must sit this season out.) Not long after that tweet went out, Kentucky WBB released its own statement saying they wouldn’t sign the waiver because it implied that Edwards, the star of last year’s SEC Tournament championship run, wouldn’t have had a spot on next year’s team had she stayed, which was false.\nTo start her press conference previewing Kentucky WBB’s game vs. LSU on Sunday, Elzy addressed the issue, telling reporters she will not change her stance.\n“I would like to take this time to address the statement that Dre Edwards put out yesterday. We were asked by Baylor to sign the NCAA No Participation Opportunity form certifying that Dre would not have the opportunity to participate if she stayed at Kentucky and that is not correct. She would have had the opportunity to participate had she stayed.\n“Dre, along with Baylor and every other school that contacted us, had the understanding that she would not be able to play right away because she did not graduate. Our compliance addressed it with her in March. Everyone was clear about what would happen. She would need to sit a year to play a year. I addressed this in March. I’m 100% confident in what we offer our student-athletes academically and athletically to be successful. My priority is this program and our players. Dre decided to leave in March. We moved on and she moved on and that’s where we stand.”\nEdwards, who began her college career at Utah, spent three years at Kentucky and played two, averaging 9.7 points and 6.1 rebounds in 2020-21. Last season, she emerged as one of the top players in the SEC, averaging 16.8 points, 8.4 rebounds, 1.1 steals, and 1.0 blocks in 29.0 minutes per contest. Of course, in March, she hit the game-winning three to give Kentucky its first SEC Tournament championship since 1982.\nDiscuss This Article\nComments have moved.\nJoin the conversation and talk about this article and all things Kentucky Sports in the new KSR Message Board.\nKSBoard",
  "word_count": 1173,
  "scraped_at": "2026-02-14T13:35:12.596951"
}