{
  "article_id": "153882b17b57",
  "url": "https://www.dw.com/en/luis-rubiales-may-face-25-years-in-jail-over-world-cup-kiss/a-68684019",
  "title": "Luis Rubiales may face 2 . 5 years in jail over World Cup kiss – DW – 03 / 27 / 2024",
  "date": "20240327T153000Z",
  "domain": "dw.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Rubiales faces 2.5 years in jail for Cup kiss\nMarch 27, 2024Former Spanish soccer federation chief Luis Rubiales faces charges for kissing midfielder Jenni Hermoso on the lips against her will. Prosecutors have demanded a 2 1/2-year prison term.\nProsecutors in Spain on Wednesday demanded a 2 1/2-year prison sentence for former Royal Spanish Football Federation (RFEF) President Luis Rubiales following his forced World Cup kiss.\nRubiales faces charges of sexual assault and coercion in the case of the nonconsensual kiss he gave to the player Jenni Hermoso after the tournament final in Sydney in August.\nWhat the prosecutor's office said\nIn a document sent to Spain's National Court in Madrid, the prosecution noted that Rubiales had held the player's head. Then, it said, \"with both hands, and in a surprising manner and without the player's consent or acceptance, he gave a kiss on the lips.\"\nThe incident took place during the medal ceremony that followed Spain's 1-0 win over England in the final of the Women's World Cup in Australia.\nRubiales, who has denied wrongdoing, is accused of coercion for having pressured the athlete to \"justify and approve the kiss that she had received against her will,\"\n\"Given the personal and professional consequences that could result,\" the prosecutor's office noted, Rubiales could exert \"constant and repeated acts of pressure\" on Hermoso.\nThese, it said, prevented the latter from \"developing her life in peace, tranquility and freely.\"\nIn addition to the jail term, prosecutors also want Rubiales to pay at least €50,000 ($54,000) in compensation to Hermoso.\nProsecutors demanded that Rubiales, who eventually resigned in September amid the uproar that followed the kiss, be specifically disqualified from working in the sports field during the time of his sentence.\nIt also called for him to be placed on supervised release for two years and to be prohibited from communicating with Hermoso and approaching her within a radius of 200 meters (about 650 feet) for four years.\nIn addition, the prosecutor's office requested a sentence of one and a half years in prison for coercion for three other individuals: the former coach of the women's team Jorge Vilda, the former marketing director of the federation Ruben Rivera and the director of the men's team Albert Luque.\nRubiales is also being investigated in a separate probe into corruption regarding RFEF contracts, such as the transfer of the Spanish Super Cup to Saudi Arabia.\nrc/wd (AFP, EFE)",
  "word_count": 403,
  "scraped_at": "2026-02-14T12:31:48.026344"
}