{
  "article_id": "153fbf6e8061",
  "url": "https://www.theguardian.com/lifeandstyle/2025/sep/30/mary-fowler-makes-catwalk-debut-during-paris-fashion-week-in-show-celebrating-sisterhood",
  "title": "Mary Fowler makes catwalk debut during Paris fashion week in show celebrating sisterhood",
  "date": "20250929T234500Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Mary Fowler has made her catwalk debut for L’Oréal during Paris fashion week.\nThe Matildas and Manchester City football star signed with the cosmetics company last year.\n“This will be my first time walking a runway so I am a little nervous, but while it’s a little outside of my comfort zone, the opportunity to walk alongside extraordinary women in a celebration of women’s empowerment, inclusion, and sisterhood is truly inspiring,” Fowler told Guardian Australia before the event.\nL’Oréal ambassadors including Kendall Jenner, Jane Fonda, Helen Mirren and Gillian Anderson were expected to appear at the event at the Hotel de Ville.\nFowler is recuperating after rupturing an anterior cruciate ligament during an April FA Cup match against Manchester United, which was predicted to see the 22-year-old sidelined for the rest of the year.\nAustralian football is keenly watching her recovery in the lead-up to next year’s Asian Cup, which opens in March in Perth. But ACL injuries are notoriously slow to repair: Sam Kerr made a goal-scoring return for Chelsea this month after tearing her ACL in January 2024.\nBefore the show Fowler told Guardian Australia her recovery was going well and being ready for the Asian Cup was a “big motivator” but “I’ll be back whenever my body is ready”.\n“So far everything has been on track, but I’ve been really patient with myself because I want to make sure I’m doing what’s right for my body,” she said. “I’m confident things will keep progressing smoothly.\n“A rehab session for me currently consists of gym work, different jumping and landing exercises, and then some running or bike work. I like to take my time with my rehab work to make sure I’m doing it properly and getting the most out of it so I’m not too focused on how long the sessions take.”\nFowler said she had requested heels as part of her fashion ensemble because she loves wearing them.\nBut her usual fashion choices can be “quite basic some days”, she said. “My go-to outfit would most likely be baggy jeans, a knitted sweater and a pair of loafers. I love streetwear fashion but I also love looking artsy.”\nFowler said she has become quite passionate about beauty because “I’ve seen how closely linked feeling good in your own skin is to someone’s level of self-worth”.\n“I think a lot of beauty standards these days make young girls feel like they’re never enough,” she said.\nL’Oréal’s celebrity-heavy runway event, now in its eighth year, took place during the spring/summer 2026 womenswear showings but is not on Paris fashion week’s official calendar, which is determined by the Fédération de la Haute Couture et de la Mode and only includes fashion brands.",
  "word_count": 453,
  "scraped_at": "2026-02-14T12:59:43.753779"
}