{
  "article_id": "159aa75f33ce",
  "url": "https://www.cardchronicle.com/2024/12/12/24319777/thursday-afternoon-cardinal-news-and-notes-louisville-cardinals",
  "title": "Thursday afternoon Cardinal news and notes",
  "date": "20241212T230000Z",
  "domain": "cardchronicle.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "—Spread check (Sun Bowl): Louisville by 2.5.\nThursday afternoon Cardinal news and notes\nThe Kids 4 Kelsey movement is ready for Saturday.\n—It’s Sweet 16 match day for the Louisville volleyball team, which will host fourth-seeded Purdue at Freedom Hall tonight at (approximately) 9:30. ESPN2 will have the television coverage. Here’s a full preview.\n—Kasean Pryor underwent successful surgery on his knee on Wednesday.\n—The CJ’s Brooks Holton recaps Louisville’s narrow Wednesday night win over UTEP.\n—The U of L women’s basketball team is back in action tonight against Grambling State. This should be a get-right game against a Tigers team that has lost seven straight. Here’s a preview.\n—Louisville tight end Jamari Johnson has made it official and announced that he has entered the transfer portal.\nWe’re just a month removed from his dad swearing up and down during a radio interview that Jamari wasn’t going anywhere.\nThere are zero certainties anymore.\nBest of luck to Jamari with whatever’s next.\n—Pat Forde writes that Bill Belichick to North Carolina (which still feels insane to type) is the most stunning hire in college football history.\n—Harry Douglas talks (around 5:50 mark of video) about why the addition of Belichick will make the entire ACC better.\n—I’m happy to announce this afternoon that I’m running for office on the solo platform of making doing L’s Down, even alone in your own home, punishable by death\n—Boston College QB Thomas Castellanos is headed to Florida State.\n—Clemson wide receiver transfer Troy Stellato is on campus for an official visit today. Stellato caught 25 passes for 264 yards and a touchdown this season.\n—Rick Bozih pays tribute to the late Bob White.\n—Look, a law is a law.\n—Greg Sankey is already whining and trying to change the College Football Playoff because a 9-3 Alabama squad that lost to two 6-6 teams didn’t make it in.\n—Eric Crawford takes a first look at the first chapter of the new era of the Louisville-Kentucky hoops rivalry.\n—Chucky will be ready to go on Saturday.\n—Louisville has offered Howard offensive tackle transfer Camren May. He visits U of L tomorrow.\n—The Associated Press yesterday named Ja’Corey Brooks First Team All-ACC. Quincy Riley and Isaac Brown both made the Second Team.\n—Rich Rodriguez is officially returning as head coach of West Virginia football and will hope to restore the type of success he had during his time there from 2001 to 2007.\n—The Cards are also No. 10 on the “faced the best defenses so far list.”\n—If you’re a Louisville fan or alum in the Denver area, there will be a game watch on Saturday at Esters Virginia Village, which is located at 1950 S Holly St, Denver, CO 80222. Free street parking is available within the parking lot and immediate neighborhood area.\n—Will NIL-fueled showcases ruin Feast Week staples like the Maui Invitational and the Battle 4 Atlantis? It sure seems like it.\n—Former Louisville infielder Cooper Bowman is now a Cincinnati Red.\n—USC transfer QB Miller Moss was throwing L’s after the basketball victory last night.\n—Texas A&M QB Connor Weigman, who had received at least preliminary interest from Louisville, is headed to Houston.\n—Because these people are hellbent on ruining the one major sporting event in the country that pretty much everyone agrees doesn’t need to be changed, NCAA President Charlie Baker says progress is being made on expanding March Madness to 72 or 76 teams.\n—Louisville signee (and Kentucky state champion) Brock Coffman getting some airtime on SportsCenter.\n—Louisville City FC will have a new trophy to play for in 2025.\n—The Duke Chronicle writes about the “lesson” in the Blue Devils’ second half comeback against Louisville.\n—Kentucky sharpshooter Koby Brea talks Louisville.\n—Probably the best Pat Kelsey quote yet.\n—The Lexington Herald-Leader’s Mark Story breaks down the matchup between Louisville and Kentucky and predicts an 83-74 Wildcat victory.\n—The analytics like UK by double figures on Saturday.\n—Busting Brackets looks at three keys to a Louisville upset of Kentucky.\n—And finally, beat Grambling State and beat Purdue.",
  "word_count": 677,
  "scraped_at": "2026-02-14T13:17:02.160987"
}