{
  "article_id": "159d7dbfceee",
  "url": "https://www.justarsenal.com/kathrine-kuhl-shines-on-the-international-stage-so-why-not-for-arsenal-women/381850",
  "title": "Kathrine Kuhl shines on the international stage , so why not for Arsenal Women ? ",
  "date": "20241203T153000Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Kathrine Møller Kühl is a rising star in women’s football, representing both Arsenal in the Women’s Super League and the Danish national team. Currently on international duty with Denmark, Kuhl recorded an assist for the 1st goal in last night’s friendly match against Iceland, in Murcia, Spain. Denmark went on to beat Iceland 2-0.\nOn the international stage, Kühl has been very impressive. She received her first call-up to the U/17 national team in February 2019 and participated in the U/17 European Championship in Bulgaria. Her senior national team debut came in March 2021 in a friendly against Wales. She was notably the youngest player in Denmark’s squad during the 2023 World Cup, where she finished in the top 10 for distance covered, dribbles, and tackles.\nArsenal signed Kühl in January 2023, and she made her debut for the Gunners on January 26, coming off the bench in an FA Women’s League Cup quarterfinal match against Aston Villa. In January 2024, she was loaned to Everton, where she continued to impress, scoring her first goal in a 7–1 FA Cup victory against Nottingham Forest.\nAfter her 6 month stint with Everton, Kathrine returned to Arsenal Women’s first team but the 21 year old has not yet made it onto the pitch for our Gunners this season. We thought she might benefit from the Arsenal Management change in October, but the obviously very talented youngster is still warming the Arsenal bench. So why isn’t she getting any playing time with the club.\nKathrine’s national team head coach, Andree Jeglertz, made the point that “Kathrine needs to play football matches and perform for her own development. There’s fierce competition within the national team, and she’s well aware of that.”\nMichelle M\nFollow JustArsenal’s Gooner Women on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 320,
  "scraped_at": "2026-02-14T12:42:39.232750"
}