{
  "article_id": "15aebe6b7c05",
  "url": "https://www.derbytelegraph.co.uk/news/local-news/new-years-honours-2024-derbyshire-9002922",
  "title": "New Year Honours 2024 : Derbyshire people who made the list",
  "date": "20231229T230000Z",
  "domain": "derbytelegraph.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "New Year's Honours 2024: Derbyshire people who made the list\nMore than a dozen local people join the well-known national celebrities being honoured\nAn array of local people representing sport, charities, the medical profession, education and the voluntary sector feature in a bumper year for Derbyshire in the King's New Year's Honours list. They include the Dames Grand Cross of the Order of the British Empire (GBE), which is an upgrade for Derby South MP Dame Margaret Beckett DBE for parliamentary, political and public service.\nThe GBE order is limited to a small select group and Dames Grand Cross and comes as Dame Margaret, 80, completes 40 years as MP for Derby South as part of a political career which started as MP for Lincoln in 1974. She holds the record for the female MP with the longest service overall and is the only sitting MP who served in the Labour governments of the 1970s.\nShe became a Dame Commander of the Order of the British Empire (DBE) in the 2013 New Year's Honours. In March 2022, Dame Margaret announced she would stand down at the next General Election. She said: \"I was very taken aback to receive a letter saying that I would be receiving this honour. I am not very familiar with the honour but noticed there were a number of people processing who were members when I attended the King's Coronation.\n\"It is very nice to be honoured in this way and to be offered it and just a little intrigued as I was not aware of its existence until now. I have been asked to attend an appointment ceremony later in the year.\"\nAlso becoming a Dame Commander of the Order of the British Empire (DBE) is Dianne Jeffrey CBE, who was a trustee and founder chair of Age International. It is given for services to older people abroad and to the community in Derbyshire. She lives in the Hope Valley area. There is also an OBE for another local MP Maggie Throup, who represents Erewash, for political and public service.\nPOLL: What's the best thing to do in Derbyshire on a rainy day?\nAnother well-known celebrity included in the list is Millie Bright, who was born in Chesterfield and brought up in the north-Derbyshire village of Killamarsh. The Chelsea player, who has been made an OBE, won the European Championships in 2022 with England and captained her country all the way to the final of the most recent World Cup. Her fellow Lionesses Mary Earps and Lauren Hemp were made MBEs for services to football.\nFormer Derby County goalkeeper, from 1987-1992, Peter Shilton is made an CBE for services to football and to the prevention of gambling harm. He holds the all-time record for the most competitive appearances in world football of 1,390. In January 2020, he said that he had overcome a 45-year gambling addiction and has been working with the UK government to raise awareness of associated issues including mental health problems.\nThey are among 1,227 recipients nationally, 48% of whom are women, and 13.8% come from an ethnic minority background. The oldest recipient is Jill Gladwell, 97, of Stowmarket, who has become an MBE for her voluntary services to the Royal British Legion in Suffolk, while nine-year-old Tony Hudgell is the youngest recipient, and has been awarded a British Empire Medal (BEM) for services to the prevention of child abuse.\nOther well-known names include author Jilly Cooper (DBE) who becomes a Dame, lyricist Don Black, who wrote several James Bond songs, is made a CBE (Commander of the Order of the British Empire) along with domestic abuse campaigner Erin Pizzey and England cricketer Stuart Broad. Both television chef Paul Hollywood and radio DJ Steve Wright become MBEs.\nSinger Dame Shirley Bassey, who has sold more than 135 million records, is made Companion of Honour for her services to music, becoming the 64th living member of the order which can only have 65 members at any one time. Dame Shirley, who was born and grew up in Tiger Bay in Cardiff, told the PA news agency: “My heart is full of emotion and I am truly humbled.” Singer Leona Lewis is made an OBE.\nSir Justin Welby, the Archbishop of Canterbury, is made a Knight Grand Cross of the Royal Victorian Order (RVO) for his personal service to the Crown during the coronation at Westminster Abbey in May. Glastonbury Festival founder Sir Michael, listed under his full name Athelstan Joseph Michael Eavis, said he was looking forward to his investiture after being knighted for services to music and charity.\nPrime Minister Rishi Sunak said: \"The New Year’s Honours List recognises the exceptional achievements of people across the country and those who have shown the highest commitment to selflessness and compassion. To all honourees, you are the pride of this country and an inspiration to us all.\"\nLocal recipients also include:\nOfficer of the Order of the British Empire (OBE)\nMartin John Rigley MBE, formerly managing director, Lindhurst Engineering Ltd - for services to the East Midlands Covid-19 Response and to the community in Derbyshire and Nottinghamshire. He lives in the Sutton-in-Ashfield area of Nottinghamshire.\nRalph William James Rimmer formerly chief executive officer of the Rugby Football League - for services to Rugby League Football. He lives in Glossop.\nJohn Everitt, chief executive of the National Forest, which includes Derbyshire, Leicestershire and Stafffordshire - for dedication to the field of conservation. He said: \"This is recognition of the small part that I have played over more than 30 years to further the cause of nature conservation and help reverse biodiversity decline. It is also a reflection of how important this work has become in the era of climate change.\" He was previously chief executive of Nottinghamshire Wildlife Trusts.\nMember of the Order of the British Empire (MBE)\nSarah Elizabeth Armitage, chair of trustees of the Embark Federation - for services to education. She has spent more than 20 years volunteering in local schools, She was originally chair of governors at Richardson Endowed Primary School in Smalley. Now, as chair of the Embark Federation trust board, she has played a key role in helping the multi-academy trust to grow since its inception in 2019. It now serves 23 schools and 8,000 pupils across Derbyshire.\nShe said: \"It is an honour and a surprise to be awarded an MBE in the King’s New Year’s Honours List. I am passionate about fulfilling the potential of young people across Derbyshire, and it is nice to have been recognised in this way for doing something that I feel so strongly about, and also love doing.\"\nFiona Ann Lindop, specialist physiotherapist in Parkinson's Disease at the University Hospitals of Derby and Burton NHS Foundation Trust - for services to physiotherapy. She lives in the Belper area.\nPatricia Mary Pritchard (Tricia) - for services to childcare and early years. She lives in Derby.\nZahid Hamid, formerly a member of the Peak District National Park Authority - for services to National Parks.\nMedallist of the Order of the British Empire (BEM)\nChristopher Allen - for services to the community in Chesterfield.\nRobert David Cotterill - for services to business and to the community in Derbyshire.\nHoward Mansell Williams - for services to the Royal British Legion and to the community in Spondon. He is an army and police veteran, and a lifelong volunteer who has been a key member of his local Royal British Legion chapter for over 30 years. He received his Gold Badge from the Legion in 2000, denoting eight years of meritorious service. Under his leadership, the Poppy Appeal locally has consistently raised in excess of £30,000.\nWe send out the biggest stories in an email every day. Sign up for the main Derbyshire Live newsletter here.",
  "word_count": 1298,
  "scraped_at": "2026-02-14T12:30:43.810180"
}