{
  "article_id": "15d52b86f3ef",
  "url": "https://www.49erswebzone.com/articles/190502-49ers-select-alfred-collins-nfl/",
  "title": "49ers select Texas DT Alfred Collins in 2nd round of 2025 NFL Draft",
  "date": "20250426T003000Z",
  "domain": "49erswebzone.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The San Francisco 49ers selected Texas defensive tackle Alfred Collins with the 11th pick (No. 43 overall) in the second round of the 2025 NFL Draft. This marks the team's second straight pick aimed at strengthening the defensive front after selecting Georgia defensive end Mykel Williams in the first round.\nRELATED Alfred Collins says 49ers drafting him is 'not gonna be a mistake'\nNFL Scouting Combine:\nAt the NFL Scouting Combine, Collins posted a vertical jump of 26 inches and a broad jump of 8 feet.\nMeasurements:\nCollins is 6-foot-6 and 332 pounds. Additionally, he boasts an arm length of 34 5/8 inches and hands measuring 10 inches.\nHometown:\nBastrop, TX\nRELATED 5 Things To Know About 49ers Second-Round Pick DT Alfred Collins\nCollege Statistics:\nCollins registered 55 tackles (six for a loss), a sack, seven passes defensed, and a forced fumble through 16 games as a senior in 2024, per Sports Reference. Over his five collegiate seasons, he recorded 141 tackles (18 for a loss), seven sacks, 12 passes defensed, an interception, and two forced fumbles.\nLance Zierlein's NFL.com scouting report:\nCollins isn't going to stand out in one particular area, but he plays hard and has outstanding physical traits to blend right into an NFL defensive rotation. He's quick laterally to spoil landmarks for zone blockers and has the stride length to disrupt upfield if asked. He added mass in 2024 and was harder to move when his pad level was right, but he can be tardy to shed and tackle a gap over. He has the traits to become a more consistent NFL rusher but the production is still untapped. He's not a premier playmaker but he has the size, talent and alignment versatility to help fortify a defensive front as an early contributor and future starter.\nLance Zierlein's Player Comparison:\nJavon Kinlaw\nNFL.com Draft Bio:\n- 2020: Played in all 10 games with 1 start (22 tackles, 2.5 TFLs with 1.5 sacks, INT, 3 PBUs).\n- 2021: Played in all 12 games with 4 starts (25 tackles, 5 TFLs with 2 sacks, FF).\n- 2022: Played in 12 games with 1 start (17 tackles, 3 TFLs with 1 sack).\n- 2023: Honorable Mention All-Big 12 Conference. Played in all 14 games with 6 starts (22 tackles, 2 sacks, 2 PBUs). Shared time with 2024 NFL Draft picks Byron Murphy II and T'Vondre Sweat.\n- 2024: Second-team Associated Press All-American. Started all 16 games (55 tackles, 5.5 TFLs with 1 sack, 7 PBUs, FF, blocked kick).\n- Miscellaneous: Mother, Benita Pollard, was a women's basketball letter winner at Texas from 1990-94.\nPre-Draft Grade:\nCollins earned a pre-draft grade of 6.27 from NFL.com, which equates to an \"eventual average starter,\" per the site's 8-point grading scale.\nProjection:\nNFL.com projected Collins to be a second-round draft pick.\nPro Football Focus Draft Profile:\nCollins is a former five-star recruit from Bastrop, Texas, where he competed in football, basketball and track (shot put and discus). As a true freshman in college, he played in 10 games but made just one start, a theme that continued for most of his Longhorns career. That changed in 2024 when Collins stepped into a full-time starting role and became a positive presence.\nAt 6-foot-5 and 315 pounds, Collins now profiles more as an interior defensive lineman than an edge. He has good length for an interior player, paired with a strong upper body and powerful hands that allow him to dictate stack-and-shed moves and fight through double teams. However, his height and length also present challenges, as he naturally struggles with leverage.\nHis biggest drawback is how slow he can be to disengage. It's not that he can't shed blockers, but rather that he lacks urgency. A quicker processing speed in this area would make him a more impactful pass rusher.\nPro Football Focus Big Board:\nCollins ranks 74th on Pro Football Focus' big board.\nPro Football Focus Grading:\nCollins earned an overall Pro Football Focus grade of 87.2 in 2024.\nNFL Draft Buzz Summary:\nThe film doesn't lie - Collins dominates the run game with rare power and processing speed that will translate immediately to the NFL level. His ability to stack, shed, and control gaps jumps off the tape. When this 320-pound wrecking ball gets his hands on you, the play is effectively over. His instant recognition of blocking schemes and ability to maintain gap discipline while destroying blocks will make him an immediate difference-maker against the run.\nThe pass rush limitations are real - there's no sugar-coating his lack of a plan or counter moves when rushing the quarterback. But we're talking about a defensive tackle who can single-handedly shut down an opponent's ground game. His elite run-stopping ability and football IQ will earn him significant snaps from day one, particularly in a defense that emphasizes controlling the line of scrimmage. The Ravens, Jets, and Titans stand out as perfect fits, where his strengths align perfectly with their defensive philosophies.\nAfter diving deep into the tape, Collins profiles as a high-floor, moderate-ceiling prospect who'll anchor an NFL defensive line for years to come. His supernatural play strength and processing speed will make him a force on early downs, while his length and raw power provide a foundation to build upon as a pass rusher. Despite his limitations, this is a player worth targeting in the late second round - he's going to make some defensive coordinator very happy by consistently winning his gap and freeing up teammates to make plays.",
  "word_count": 918,
  "scraped_at": "2026-02-14T14:17:18.367187"
}