{
  "article_id": "15e8dad6388f",
  "url": "https://www.timescall.com/2023/12/04/rooney-cu-buffs-3-extra-points-dec-4-2023/",
  "title": "Rooney : CU Buffs 3 extra points ( Dec . 4 , 2023 ) ",
  "date": "20231204T224500Z",
  "domain": "timescall.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "BuffZone writer Pat Rooney discusses three topics surrounding CU Buffs athletics as the transfer portal opens and the basketball season rolls into month two.\nExodus begins\nThe transfer portal opened for football on Monday, and already a small herd of Buffaloes are beginning the journey elsewhere.\nIt should come as no surprise the first now-former CU players to announce their departures were among the scant holdovers who returned from the 2022 team — tight end Caleb Fauria, linebacker Marvin Ham II, running back Anthony Hankerson and offensive linemen Van Wells and Gerad Christian-Lichtenhan. As of Monday morning, that’s in addition to three assistants already on the way out in Sean Lewis, Tim Brewster and Nick Williams.\nOf those losses, the only ones that raise an eyebrow for me are Hankerson and Williams, and perhaps to a lesser extent Ham.\nThe writing was on the wall for Lewis as soon as he was stripped of play-calling duties for the final four games. As the tight ends coach, Brewster really only had one player to coach (Michael Harrison) and it seems like he was out the door pretty much as soon as the team plane returned from the finale at Utah. And no offense to the two young men off to find their fortunes elsewhere, but I’m all for razing the entire offensive line.\nFor my two cents, Hankerson was the most complete running back on the roster. He was their toughest between-the-tackles runner, and while Hankerson isn’t the same threat in the passing game as speedy freshman running back Dylan Edwards, he was a more than capable pass-catcher out of the backfield.\nMaybe there is a confidence Alton McCaskill IV can return to the pre-knee injury form he flashed as a youngster at Houston. Hankerson isn’t irreplaceable, and certainly there are reinforcements to be had in the portal. But running back was a group that underperformed compared to expectations this season, and any back considering emerging from the portal in Boulder might wonder how a player like Hankerson can go from a position of favor — “Hank is a dawg man. Hank is a great kid,” head coach Deion Sanders said after the win at Arizona State — to an afterthought and castoff in a matter of weeks.\nAs for Williams, a personal connection with new Syracuse head coach Fran Brown lured him from CU, but for a program still trying to gain traction under Sanders, losing a young, dynamic and personable young assistant is a tough loss, particularly on the recruiting front.\nOn the rise\nEarly returns say a buzz is returning to the CU Events Center.\nThe CU men’s basketball team drew 7,231 fans to Sunday’s rout of Pepperdine. That’s not a gaudy total, but it continues an early trend that is putting the men’s program well ahead of last year’s attendance pace.\nCU drew more than 7,000 fans for just three home dates out of 16 a year ago — Colorado State (10,003), UCLA (8,680) and Utah (8,432).\nColorado finished last year with an average attendance of 6,752, the lowest mark in 13 full seasons under head coach Tad Boyle. Through the first five home games this year, the Buffs have averaged 6,475 fans. Technically, that obviously is a lower average than last year’s Boyle-era attendance low, but the trend is on an upward trajectory. This year’s lowest attendance through just five games (Towson, 6,078) would have been the sixth-lowest attendance last year.\nBecause of last year’s early dates against Colorado State and Arizona State, a fair comparison with the first five games last year isn’t entirely accurate. Using the other first five home games last year besides the CSU and ASU games, CU averaged 5,483 fans (although the final two games of that sample occurred during the semester break).\nAdd that to the early turnout for the nationally-ranked CU women — the 1,893 on hand for the home opener against Le Moyne was the most for a nonconference home game in nearly seven years, and CU more than doubled that against Oklahoma State — and its shaping up to be an exciting winter at the Events Center.\nBrooklyn battle\nThe game on Sunday in Brooklyn for the CU men isn’t a must-win opportunity. The loss at CSU ultimately won’t be overly costly in the NET rankings, and a strong season in the Pac-12 still will set the Buffs up well for a possible NCAA Tournament berth.\nStill, the Buffs’ debuted at No. 54 in the season’s first NET rankings on Monday, and while the bulk of the season remains, some of the initial NET rankings for CU’s foes are less than encouraging (Iona 203, Milwaukee 335, Grambling State 353). CU won’t have a better opportunity to make NET gains outside Pac-12 play.",
  "word_count": 795,
  "scraped_at": "2026-02-14T13:10:32.021853"
}