{
  "article_id": "15f7c2a33e9e",
  "url": "https://www.fourfourtwo.com/news/what-is-the-wsl-maternity-leave-policy",
  "title": "WSL : What is the maternity leave policy in women football ? ",
  "date": "20241119T183000Z",
  "domain": "fourfourtwo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "WSL: What is the maternity leave policy in women's football?\nWSL maternity leave policy was updated in 2022 for players in the top-flight\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nWSL maternity leave was updated in 2022 when the Football Association and Professional Footballers’ Association agreed new regulations.\nThe policy has also been updated to include coaches in May 2024.\nIt says that players and coaches are entitled to 14 weeks maternity leave fully paid with statutory pay in place after that point.\nWSL maternity leave: How long do stars play while pregnant?\nMaternity pay in England's top-flight is also not conditional on how long they have been playing for the club.\nIn previous policies only players who had been at a club for 26 weeks would be granted maternity leave but that is not in the latest policy.\nThere are multiple examples of WSL players having children recently and returning to football. West Ham's Katrina Gorry has two children, as does Hammers' Dagny Brynjarsdottir.\nWest Ham's Kristie Mews announced her pregnancy with Chelsea's Sam Kerr on Monday.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nArsenal's Amanda Ilestedt is currently on maternity leave and Manchester United's Hannah Blundell has announced her pregnancy.\nHow long a player competes while playing is decided on a case-by-case basis between the player, club and medical professionals.\nUSWNT star Alex Morgan recently played her final game of football while pregnant. Morgan also trained throughout her first pregnancy. West Ham have not disclosed Mewis' plans throughout her pregnancy and in FourFourTwo's view, the information won't be shared unless the US international wants it to be public knowledge.\nMewis' contract with the Hammers runs until June 2025 and automatic contract renewals are not currently a part of the WSL policy.\nHowever, clubs cannot cancel a contract based on pregnancy. But it is also true that there would be no breach if Mewis' contract expires during her pregnancy and there is no renewal.\nAC Milan have just introduced a club policy that automatically renews a player's contract by a year if their deal is due to end during the season their pregnancy started.\nAlso, Kerr will be entitled to eight weeks paid absence. Mothers who do not carry the child in same-sex relationships are entitled to the leave but must take it in the first six months of the birth.\nKerr is currently sidelined with an ACL injury with no timeline for her return.\nSarah joined the FourFourTwo team in September 2024 in a freelance role. She also writes for The Guardian, BBC and Rugby World where she specialises in women's football and rugby. Sarah has a bachelors degree in English and a master's in newspaper journalism.",
  "word_count": 559,
  "scraped_at": "2026-02-14T12:23:02.487576"
}