{
  "article_id": "15fd22753976",
  "url": "https://graziadaily.co.uk/life/in-the-news/the-world-cup-is-what-you-dream-about-as-a-kid-alessia-russo-opens-up-about-team-chemistry-lioness-preparations-and-whats-changed-since-their-historic-euros-win/",
  "title": "  The World Cup Is What You Dream About As A Kid : Alessia Russo Opens Up About Team Chemistry , Lioness Preparations And What Changed Since Their Historic Euros Win",
  "date": "20230307T161500Z",
  "domain": "graziadaily.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Alessia Russo is an enchanting football player - literally, sometimes watching her feels as though you’re witnessing magic. From her backheel nutmeg goal that clinched England’s win against Sweden in the 2022 UEFA Women’s EURO, to her recent hattrick against Leicester City in the Women’s Super League, the Manchester United player has a knack for always being in the right place at the right time.\nWhat’s on her mind during those nail-biting moments? The big win, of course. ‘When I’m playing a big game all, all that goes through my mind is what I can do to help the team win,’ Alessia, a Beats by Dre ambassador, tells Grazia. ‘All that preparation is done before the game, so when it kicks off you’ve just got to go back to what you know and what got you there. It’s important to enjoy it too, lots of times big games can make you nervous which is normal because you want to do well, but you’ve just got to go out and enjoy the moment and the crowd and give it all you’ve got.’\nTeam chemistry is important too. ‘I think team chemistry is a big part of why we won the Euros,’ Alessia says. ‘When you know that the girls next to you are going to leave everything out on the pitch for you and you’re going to do the same, it takes your game to another level. And when you have that relationship off the pitch, when you come on the pitch you feel calm, relaxed, and ready to go.’\nAs is the right pre-game rituals to really psyche yourself up. For Alessia, that means the right playlist. ‘I listen to the same playlist every game day that I’ve made with Beats, it gets me in the zone and ready to perform,’ she says. ‘Music is a huge part of me as a person and a player.’\nThat playlist includes Bounce Back by Big Sean, Mob Ties by Drake, and Higher by Rihanna – no wonder she’s an ambassador for Beats headphones. ‘I grew up wearing Beats headphones to my under-15s camps, so they bring back a lot of memories, they make your music sound so good. Music is massive on a game day.’\nShe’ll undoubtedly be blasting them on repeat then in the run up to the FIFA Women’s World Cup, which officially begins on July 20 and lasts four weeks. How is Alessia feeling about the big tournament?\n‘The world cup is the pinnacle of football for every young girl, to have that opportunity coming up this summer just makes me want to work even harder to firstly get in the squad and then through the World Cup,’ Alessia says. ‘That’s what you dreamed about as a little kid, to play on the world stages. The competition is so high not only in England but across the world, it’s set out to be an amazing tournament.’\n<meta charset=\"utf-8\">Alessia wearing the BeatsFitPro earphones\nAlessia wearing the BeatsFitPro earphones in Tidal Blue.\nRight now, though, the focus is on club commitments, Alessia’s team currently sitting top of the Women’s Super League with 11 weeks left of play. Intensive World Cup training camps will begin in July, with the Lionesses heading to Australia to set up their main base at the Central Coast Stadium in Gosford. What’s training camp for such a huge tournament like?\n‘Once training camp starts it’s very competitive, but also very relaxed,’ Alessia says. ‘We train very hard but when we’re not training, we switch off and enjoy each other’s company, we play cards, boardgames, ping pong and just catch up with all the girls. We have such a good connection on and off the pitch that when you go to camp it’s nice to see some familiar faces.’\nAlessia also loves to unwind by shopping and watching films, really switching off so she can fully lock in when she’s on the pitch. And that pitch has all the more eyes on it this time around, with the Lioness win last summer proving a major success for the growth of women’s football as a whole.\n‘You can see how much the women’s game has grown now, well over the past 10 years but in particular after the Euros,’ Alessia says. ‘Women’s football had been needing the stages to match and we’ve finally got that, we’re getting more crowds, we’re on Sky, tournaments are being shown everywhere and that’s what we love as players.\n‘We want to be positioned where we belong, and you can see that coming to fruition now,’ she continues. ‘Now it’s our job as players to go out and put in performances and keep the game growing for the next generation of girls coming through.’\nBeats Fit Pro in Tidal Blue, Volt Yellow, and Coral Pink are available for purchase globally at apple.com, Apple Store locations and authorised resellers for £219.99 (UK)",
  "word_count": 817,
  "scraped_at": "2026-02-14T12:38:51.585595"
}