{
  "article_id": "161200df5691",
  "url": "https://www.aol.co.uk/everything-know-married-first-sight-120352260.html",
  "title": "Married at First Sight united kingdom 2024 line - up in full",
  "date": "20240916T084500Z",
  "domain": "aol.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Married at First Sight UK 2024 line-up in full\nWatch: Get your first look at MAFS UK S9\nMarried at First Sight UK season 9 is ready to make its way back down the aisle, with a new batch of hopeful singletons ready to take a chance on love with a complete stranger.\nFor all those who have missed the drama of this long-running newlywed series, Married at First Sight UK (MAFS) lets science take the reins to use hard data to romantically pair two people who are looking for love. However, as its title suggests, each new couple will only meet for the first time on their wedding day, with the pair committing to a joint life together.\nFrom there, the E4 show follows each couple’s ups and downs (emphasis on the downs) to see how many scientifically-matched couples make their pairings a forever thing and how many stumble right out of the gate.\nWith its last outing coming to a close with a dramatic two-part reunion special, the series is wasting no time getting back on the horse with Married at First Sight UK season 9.\nHere’s a look at the new singles looking for love.\nThe brides\nEmma\nSales Manager Emma penned a blog about her search for love, entitled Man of the Month. It followed her encounters with a different man each month, referred to as Mr January, Mr February and so on, but so far she hasn’t found The One.\nHowever, it sounds as if the 31-year-old from Bristol has high hopes for MAFS, as she said: “I think the experts are going to do me a solid and find me a nice match.”\nSacha\nSacha, 29, has been single for nine months and has decided to be celibate until the right person comes along. The aesthetics practitioner, who is from Birmingham, is into beauty pageants and kickboxing and is hoping to find someone funny and loyal.\nWhen Sacha’s perfect match does turn up, they had better be fans of her cats Olive and Diego. “A red flag to me is someone not liking cats,” she said. “I was always told to never trust a man that doesn’t like cats.”\nKristina\nKristina has said she’s struggled to meet anyone new as she comes from a small seaside town in East Sussex where everyone knows everyone. “I wanted to sign up because I felt like I was ready to meet the love of my life, said the dog walker, who is hoping to meet a “tall, dark, cheeky chappy”.\nThe 31-year-old suffers with Premenstrual dysphoric disorder (PMDD), which the NHS says can cause women to experience more severe symptoms of PMS, and hopes to meet someone who can support her and accept her.\nEve\nEve’s first serious romance was with a man and there was a time when she came close to marrying. But she realised she was gay at the age of 25.\nNow 31, the fitness coach, who hails from Omagh, is looking for someone motivated to settle down with. “I want to find somebody that I fall in love with and I want somebody to fall in love with me,” she said.\nHolly\nBeautician Holly doesn’t struggle to get dates but has found it hard to forge something lasting.\nThe 29-year-old from Huddersfield is a single mum, giving birth at 16 after not discovering she was expecting until 37 weeks. She is the last in her family to tie the knot so is hoping the MAFS process works for her.\n“I want to gain love, work on myself as well, and learn how to trust again,” she said.\nCharlie\nCharlie came out as gay five years ago, when she was 25, and said she has never been happier. She has been single for four years after a tough split and now wants to settle down and start a family with someone.\nThe lettings operations co-ordinator, who is from Surrey, is described as being the “life of the party”.\nRichelle\nRichelle divides her time between the UK and Guyana, where she was born. She has conquered the business world, becoming a business consultant after doing a politics degree, but still feels she is lacking in the romance stakes.\nThe 48-year-old is hoping the experts find her a partner who is “funny, fit, tall, driven, successful and financially independent”.\nPolly\nPolly, 28, has been single for seven months and is hoping the experts bring her the “beefcake tradesman” of her dreams. The careers advisor from Kent is from a big family and is hoping to find someone who treats her as well as her dad does.\n“I’m excited to go into the unknown, to have things that aren’t in my control and to just go into it open minded,” she said.\nLacey\nLacey is a ‘miracle’ IVF baby and anyone that comes into her life will also have to win over her twin sister and her mum.\nAn office manager from Hertfordshire, Lacey has done a lot of dating but after a 10-year relationship hit the rocks she has been single for years. Lacey, 27, is looking for someone who has emotional intelligence and can make her laugh.\n“I’d love to get a husband,\" she said. “I’m thinking long term so husband, babies, travel then move in together.”\nThe grooms\nAdam\nBarber Adam, 33, has been single for over a year but admits that he is quite picky when it comes to choosing a partner. He says he has never been in love before, so will Married at First Sight change that?\nAdam, who is from Nottingham, has said he is ready to find someone and start a family. “I would love the happily ever after,” he said.\nAlex\nAlex is in aviation operations but also hopes to be a professional boxer. He admits he has a bit of a “man about town” reputation but is looking for a stable relationship. The 28-year-old, who is from Birmingham, has been single for seven months and is hoping to find someone to take home to meet the most important woman in his life — his mum.\n“Maybe the experts can help me work out where I’ve been going wrong,” he said.\nCaspar\nGardener Caspar has never had a serious relationship but all that could be about to change. He said: “I want the wife. I want the 2.4 kids, white picket fence. I hope this process does this for me.”\nThe 34-year-old is a nature enthusiast, who lives with his two dogs in the New Forest. He thinks he is single because he struggles with confidence but is ready to push himself out of his comfort zone.\nKieran\nKieran 28, is looking for help in the romance department after having his heart broken in the past. “I’ve been unlucky in love,“ said the mechanic from Newcastle. ”I’ve been heartbroken and messed around and I really need the experts’ advice.”\nSelf-motivated, Kieran embraces new situations and after studying mechanics went off to join the circus to train as a clown.\nHe has since returned to his life as a mechanic and is now looking for the perfect partner.\nNathan\nEngineer Nathan has said he's tired of dating gym bunnies and models, and wants to find someone he can connect with on a deeper level and start a family with.\n“It will be cool to meet someone,” he said. “Hopefully we’re on the same vibe.”\nThe 24-year-old from Somerset has said his perfect match needs to be petite, funny, family oriented and someone with traditional family values.\nOrson\nOrson used to be a professional cricketer but is now a project engineer after an injury forced him to retire from the sport. The 41-year-old, from St Kitts and Nevis, has a two-year-old girl who is the light of his life, and while her happiness comes above everything else, he has said that he would love to find a partner.\n“I want to get married as I feel that is the only thing missing from my life,” he said.\nRoss\nPainter and decorator Ross, 32, is deaf and has played for Everton Deaf football club and the Deaf England squad.\nBorn and raised in Manchester, he has a big, close family and a daughter. But while he has had three serious relationships, none have gone the distance so far.\n“I’ve been engaged before and this is my third time lucky,\" he said. \"I’m looking forward to meeting my wife. I’m ready for this.”\nWhen will Married at First Sight UK season 9 start on TV?\nMAFS UK will return on 16 September at 9pm on E4. Viewers can watch at a time that suits them via Channel 4’s free streaming service.\nWho are the Married at First Sight UK season 9 experts?\nThe show’s previous panel of experts are returning to share their scientifically-led romance knowledge.\nThis will include dating coach, psychologist and expert on Married at First Sight Australia, Mel Schilling, professional match-maker Paul C Brunson and the UK’s leading sex and intimacy expert — and candid advice disher-outer — Charlene Douglas.\nMarried at First Sight UK season 9 starts on E4 at 9pm on 16 September.\nThis article originally appeared on Yahoo TV UK at https://uk.news.yahoo.com/married-at-first-sight-uk-2024-line-up-couples-120352674.html",
  "word_count": 1537,
  "scraped_at": "2026-02-14T13:30:36.756308"
}