{
  "article_id": "16308e677225",
  "url": "https://www.nytimes.com/athletic/6254718/2025/04/04/marinakis-charges-forest-postecoglou-var/",
  "title": "Marinakis claims conspiracy over charges ; Postecoglou takes aim at VAR ; QR code tattoo",
  "date": "20250404T124500Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Athletic FC ⚽ is The Athletic’s daily football (or soccer, if you prefer) newsletter. Sign up to receive it directly to your inbox.\nHello. Nottingham Forest’s Evangelos Marinakis is facing serious criminal charges in Greece. We’re here to explain the possible implications for him, for Forest and for his status as a Premier League club owner.\nPlus: the seven-a-side goal with 300m social media views, and a QR-code tattoo drama.\nAdvertisement\nMarinakis: ‘It’s Blackmail’\nForest owner hits out at report over sports violence charges\nIn the world of Nottingham Forest owner Evangelos Marinakis, expect the unexpected: unforeseen Champions League dreams on the pitch, politics, commotion and headlines off it.\nYesterday brought more of the latter. First, a media outlet in Marinakis’ homeland of Greece — where the billionaire owns league leaders Olympiacos — published a story naming him as one of more than 140 people who are to stand trial over “misdemeanour” charges of “inciting sports-related violence and supporting a criminal organisation.”\nAlmost immediately, Marinakis responded with an excoriating statement on Olympiacos’ official website (taken to be a response to the allegations against him, although they weren’t actually referenced), attacking Greece’s prime minister Kyriakos Mitsotakis, among others, and claiming he was the victim of “blackmail” and the establishment “weaponising the justice system”.\nThe charges linked to him relate to an incident in 2023 in which a policeman was killed during rioting in the Greek capital, Athens. The officer, 31, died after being hit in the leg by a flare amid fighting between fans of Olympiacos and their city rivals, Panathinaikos.\nNewspaper Kathimerini reports that Marinakis and other Olympiacos officials are accused of providing “all types of assets and financial means, knowing that by doing so they were facilitating or assisting in the commission of criminal activities by a criminal organisation”.\nIt is claimed that “their actions resulted in the commission of crimes and incited citizens to acts of violence against each other, leading to a disturbance of public peace”.\nMarinakis considers the charges against him to be false in their entirety. In his statement — an English version of which was later removed from Olympiacos’ site — he said: “My message is this, and it is clear: I am not afraid, I will not be blackmailed, I will not negotiate, I will not back down, I will not submit. The truth will come out. Democracy will prevail. Ultimately, we will prevail (as we always do).”\nAdvertisement\nWhat are the implications?\nIn the context of Forest, what this essentially amounts to is a Premier League owner indirectly accused of contributing to the death of a serving police officer, an offence Marinakis vehemently denies.\nIf he were to be convicted and sentenced to 12 months or more in prison, the rules of the Premier League’s owners’ and directors’ test (OADT) could force him to divest his existing, 100 per cent control of Forest. The OADT rules state:\n“…a person shall be disqualified from acting as a director” if they “have a conviction (which is not a spent conviction) imposed by a court of the United Kingdom or a competent court of foreign jurisdiction … in respect of which an unsuspended sentence of at least 12 months’ imprisonment was imposed … in respect of any offence involving any act which could reasonably be considered: to be dishonest (and, for the avoidance of doubt, irrespective of the actual sentence imposed); to have involved violence”.\nAs yet, the Premier League has not officially responded to a request for comment from The Athletic. Neither have Forest, though senior officials there support Marinakis’ insistence that the claims against him have no substance. A request for comment from Mitsotakis’ office is also pending.\nForest are massively on the up under Marinakis, this season’s Premier League surprise package and a club breaking their perceived ceiling. With Champions League qualification in their sights and an FA Cup semi-final ahead of them this month, they wait now to see where this off-the-pitch saga takes them and their owner.\nNews round-up\n- There’s no getting away from the fact that Arsenal’s luck with injuries has been horrible. Gabriel is the latest player to succumb, and a hamstring tear suffered in Tuesday’s 2-1 win against Fulham means we won’t be seeing him play again until next season.\n- After a fresh challenge from La Liga over their registrations, the Spanish government has sided with Barcelona and given approval for Dani Olmo and Pau Victor to crack on as before. Will that be the end of the matter?\n- The Premier League, meanwhile, is to investigate how Chelsea sold their women’s team to themselves, helping to turn a pre-tax profit of £128.4m ($168m) in 2023-24. No surprise that questions are being asked.\n- FIFA president Gianni Infantino has hinted that Russia — a pariah in world football since the country’s military invasion of Ukraine three years ago — might soon be brought back in from the cold. If Infantino’s saying it, it’s bound to happen.\n- Leicester City manager Ruud van Nistelrooy wants talks with the club’s hierarchy to make sure they’re “aligned” on plans for 2025-26. Nothing about relegation-bound Leicester suggests that partnership is destined for a happy ending.\n- This is quite a big tale from the Championship’s promotion scene: Leeds United boss Daniel Farke has ditched long-time No 1 goalkeeper Illan Meslier with seven matches left. It’s a brave call but Leeds have been faltering and Meslier’s errors have been costly.\nAnge anger: Postecoglou takes aim at VAR after cupping his ear at Tottenham fans\nChelsea versus Tottenham Hotspur last night goes into the drawer marked ‘not a classic’. A 1-0 home win keeps Chelsea in control of a Champions League spot. Dissent from the stands underlines the suspicion Spurs coach Ange Postecoglou is on inescapably thin ice.\nAdvertisement\nA word, though, about the banging volley from Chelsea’s Moises Caicedo (above) which VAR ruled out in the second half, one of two goals disallowed via replays. The decision was correct — Levi Colwill strayed fractionally offside in the build-up — but VAR dragged its heels in reaching it and was also painfully slow in deciding Pape Matar Sarr had fouled before driving in an equaliser a short while later.\nPostecoglou, who rashly cupped his ear towards a restless away end after Sarr’s effort found the net, said VAR was “killing the game, mate. You don’t know what you’re going to get”. Thank god the introduction of the Premier League’s new semi-automated offside system next weekend is promising to bring some light relief. Not that I’d recommend holding your breath.\nViral volley: Romoleroux strike reaches 300m people\nThe Queens League in Spain is the women’s answer to Gerard Pique’s hugely successful Kings League, a seven-a-side tournament founded by the former Barcelona and Spanish national team defender in 2022. This week, it spawned a viral sensation.\nYou won’t have heard of Antonela Romoleroux because until now, she had no profile to speak of and a modest 5,000 followers on Instagram. But then she popped up with a superb goal in the Queens League — and in no time, more than 300 million people have watched it online. That’s not a typo.\nThe competition says it’s the most viewed strike in the history of women’s football, which is a plausible claim considering the Queens League expects to amass 25 billion online impressions by the end of 2025. Investment is flooding in, shifting the landscape of football consumption once more.\nOur new women’s football writer Asli Pelit has the story of Romoleroux’s sudden celebrity — with quotes from the star herself. I’m praying she’s on pay per view.\nAround TAFC\n- Tomorrow, April 5, marks 25 years since two Leeds United fans were stabbed to death in Istanbul on the eve of a UEFA Cup tie between Leeds and Galatasaray. Back in 2020, I spoke to those most affected by the tragedy. It was sobering to hear how heavily it weighs on them. You can read the feature here.\n- The arrival of promotion and relegation in U.S. soccer is a hot topic but did you know that there was originally a plan to introduce pro-rel around the start of the 1990s? Let Pablo Maurer fill you in.\n- Conor O’Neill has produced some top analysis of how Nottingham Forest keep outwitting the Premier League’s main contenders. They really have struck gold in the past 12 months.\n- Atletico Madrid are emerging from a weapons-grade grilling. Their fixture list from late February to early April has just about killed them. What can Diego Simeone and company now pick from the bones of a ruined campaign?\n- Most clicked in Thursday’s TAFC: you flocked in your thousands to the South Park-style takedown of Jose Mourinho.\nQuiz question\nToday’s challenge is to put these pairings in order of the number of the times they appeared together for the club in question, from the highest to the lowest:\n1) Paul Scholes and Ryan Giggs for Manchester United; 2) Thomas Muller and Manuel Neuer for Bayern Munich; 3) Lionel Messi and Sergio Busquets for Barcelona; 4) John Terry and Frank Lampard for Chelsea; 5) Steven Gerrard and Jamie Carragher for Liverpool.\nIf this beats you, we’ll have the answer here later on today and it’ll also be in Monday’s TAFC.\nAdvertisement\nCatch a match\n(Selected games, times ET/UK)\nSaturday: Premier League: Everton vs Arsenal, 7.30am/12.30pm — USA Network, Fubo/TNT Sports; Aston Villa vs Nottingham Forest, 12.30pm/5.30pm — USA Network, Fubo/Sky Sports.\nLa Liga: Barcelona vs Real Betis, 3pm/8pm — ESPN+, Fubo/Premier Sports.\nSerie A: Milan vs Fiorentina, 2.45pm/7.45pm — Paramount+/TNT Sports, OneFootball.\nMLS: Real Salt Lake vs LA Galaxy, 4.30pm/9.30pm — MLS Season Pass/Apple TV.\nSunday: Premier League: Fulham vs Liverpool, 9am/2pm — Peacock Premium/Sky Sports; Manchester United vs Manchester City, 11.30am/4.30pm — NBC, Peacock Premium, Fubo/Sky Sports.\nSerie A: Atalanta vs Lazio, 12pm/5pm — CBS, Paramount+, Amazon Prime, Fubo/OneFootball.\nMLS: Inter Miami vs Toronto FC, 7pm/12am — MLS Season Pass/Apple TV.\nAnd finally…\nIf your club claims a domestic trophy for the first time in more than half a century — that’s right, we’re talking Newcastle United — what better way to mark it than by commissioning a tattoo?\nGraeme Davison did just that after Newcastle picked up the Carabao Cup last month. But rather than choosing something conventional, he went for a QR code linking to YouTube footage of the first goal in their 2-1 defeat of Liverpool in the final at Wembley, a thundering header scored by Dan Burn.\nAll good fun and in no time, a bit of publicity generated three million views of the video. Except as word spread, fans of other teams, including Liverpool, began trying to kill the link by claiming copyright infringement. They haven’t succeeded yet but, but they just might — and it’s a level of pettiness you have to admire.\n(Top photo: PAUL ELLIS/AFP via Getty Images)",
  "word_count": 1819,
  "scraped_at": "2026-02-14T12:11:54.547830"
}