{
  "article_id": "1631d7c1fe16",
  "url": "https://www.readingchronicle.co.uk/news/25197231.premier-league-star-scores-reading-fc-charity-match/",
  "title": "Premier League star scores in Reading FC charity match",
  "date": "20250529T224500Z",
  "domain": "readingchronicle.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Former Fulham, Wigan Athletic and Hull City star Jimmy Bullard made a celebrity appearance in a match contested between staff at Reading firm Select Car Leasing.\nThe game, held at the Select Car Leasing stadium, was organised to raise funds for the club’s official charity, the Reading FC Community Trust.\nFormer Soccer AM presenter and I’m a Celebrity…Get Me Out of Here! contestant Jimmy, now 46, played 75 minutes of the contest before withdrawing with a calf injury.\nDescribing his goal, which made the game 5-5 at the time, Jimmy told Select: “I picked it up 35 yards from goal, centre of the pitch. I’ve got it on my right and I’ve sent their best player for a Mars bar, cut in on my left, gone past him, and made out that I’m sliding it to the far stick.\n“Their centre half has dropped like he’s in a war, and then I’ve run up to the ‘keeper, given him the eye, jumped over him and stuck it into an empty net. It was lovely, it was. The goal took the game to 5-5 and it gave the team a bit of lift to go on and win it.\n“I was on fire until a bit of fatigue set in and I pulled my calf. Devastating. But it was so good - a great game.”\nJimmy says he rarely plays football these days as he focuses on golf instead. He’s now hoping the injury he’s picked up won’t stop him playing numerous golf tournaments this summer.\nHe adds: “I’ve never had an issue with my calves before - and I’ve got great looking calves!\n“To be honest, I don’t play a lot of football, not even five aside. I turned 40, my knees ain’t what they used to be, and with all those years of wear and tear training, it catches up with you. I thought, ‘I’d better knock this on the head’.\n“When you then step onto a big 11-a-side pitch like the Select Car Leasing stadium, it feels massive.\n“But I really enjoyed playing in the charity game - loved it. I was only supposed to play 20-25 minutes but I didn’t want to come off. If you love your football and you’re a football player at heart, it’s like a drug. I’d still be playing now if my body would allow me.”\nJimmy was ultimately on the winning side with the game finishing 7-5 in his favour.\nThe score was, however, irrelevant, with the real result being the money raised for the Reading FC Community Trust.\nThe Reading FC Community Trust is the Club's official and registered charity (charity number 1125817). As the community arm of the football club, they aim to change lives in the local community through caring for those who need our support, developing young aspiring footballers and coaches and educating through our excellent schools and college provision.\nThey aim to deliver a wide range of sessions and activities through four main activity pillars: Health, Education, Social Inclusion and Sports Participation.\nSince 2024, the Reading FC Women’s First Team and its associated youth pathway has also fallen under the stewardship of the Trust.\nThe Trust’s Manager Dave Evans said: “Since becoming Principal Partners of Reading FC in 2021, Select Car Leasing has always had strong bonds with the Reading FC Community Trust and we’re delighted to have their continued support.\n“Funds raised via the charity football match will be used to support the diverse range of activities the charity delivers to participants of all ages in the local and surrounding communities in Reading and Berkshire.\n“It was also fantastic to see a former England international like Jimmy Bullard taking to the field at the Select Car Leasing stadium. Jimmy never played for Reading during his career, but I think we can all agree that the Royals kit suits him!”\nSelect Car leasing co-founder and CEO Mark Tongue thanked Jimmy - a long-time ambassador at Select - for being such a good sport.\nHe added: “We hold a charity football match each year, raising funds for a diverse range of charities, and we’re thrilled to be able to bolster our support of the Reading FC Community Trust with this year’s fixture.\n“The Trust engages with more than 3,500 people from a wide demographic each and every week. It’s an operation that runs 24/7 and provides everything from alternative school provision and holiday camps to disability soccer sessions and a dementia cafe.\n“Without the Trust, the local community here in Reading would be a much poorer place and we’ll continue to offer Dave and the team our full backing.”\nSince 2021, Select has donated thousands of pounds to support the Trust in its provision of school holiday camps.\nIn March 2024, Select donated a free minibus to the Trust in support of its ‘Reading Alternative Provision’ (RAP) care, which supports children struggling with the school environment while offering alternative provision for young pupils.\nAnd in December 2024, Select became Principal Partner of both the Women’s First Team as well as the pathway teams - which falls under the Trust’s umbrella.",
  "word_count": 853,
  "scraped_at": "2026-02-14T13:32:32.292758"
}