{
  "article_id": "1681f53ec1e0",
  "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/manchester-ira-bomb-1996-arndale-13192606",
  "title": "The 1996 Manchester bomb : A day that changed our city forever",
  "date": "20230615T111500Z",
  "domain": "manchestereveningnews.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The 1996 Manchester bomb: A day that changed our city forever\nIt was the biggest ever bomb the IRA exploded on the British mainland\nIt was a day Manchester will never forget.\nOn June 15, 1996, the IRA singled out our city to be victim of the biggest bomb it had ever exploded on the British mainland.\nIt would injure hundreds and leave no building within half a mile unscathed, ultimately triggering a masterclass in city regeneration and a tooth-and-nail fight by the M.E.N. to report the truth.\nThis was a blast that tore through the heart of Manchester and which, within seconds, would have an impact that would last for two decades.\nREAD MORE: The 999 heroes who made sure nobody died in the IRA bomb\nThe day started in blazing midsummer sunshine.\nTwo hundred miles south in London, anti-terror police were on high alert amid fears the IRA could target the Queen’s Trooping the Colour parade.\nJust a few months earlier the Provos had ended a 17-month ceasefire by blowing up a lorry in Canary Wharf, killing two people.\nIn Manchester things were more relaxed. But police were nonetheless prepared for trouble – as thousands of football fans prepared to pour into town ahead of that afternoon’s Euro 96 match between England and Scotland.\nTV crews from across Europe were in town to cover the next day’s Russia v Germany game at Old Trafford. Thousands of shoppers were preparing to hit the streets too, many of them on the look-out for Father’s Day gifts.\nUnknown and unnoticed a white van was already on its devastating journey.\nJust before 9.20am, the streets had already begun filling up with crowds when two men in hooded anoraks and sunglasses left a heavily loaded Ford Cargo van outside Marks and Spencer on the corner of Cannon Street and Corporation Street. It was parked on double yellow lines with its hazard lights flashing.\nIt contained 3,300lbs of homemade explosive, three times the size of the Canary Wharf bomb.\nThey walked away, ringing an IRA chief in Ireland to let them know the job was done. The pair escaped in a burgundy Ford Granada, later abandoned in Preston.\nThree minutes after the van was abandoned, a traffic warden slapped a ticket on it.\nSome time after 9.38am a man with an Irish accent called Granada TV, Sky News, Salford University, North Manchester General Hospital and the Garda police in Dublin to warn a bomb would go off in one hour. He gave the location and used a code word known to Special Branch.\nOn their CCTV camera in Bootle Street station, officers watched in horror as footage was relayed showing people pushing up against and sliding along the side of the van, awkwardly parked on one of the city’s busiest shopping streets.\nOfficers then began one of the most extraordinary policing operations the country has ever seen: the evacuation of 80,000 people.\nAt first, they were not keen to go. Mancunians had become used to bomb scares and they had things to be getting on with.\nOne hairdresser refused to let his clients leave because they still had chemicals in their hair, arguing it would be ‘too dangerous’. A group of workmen wanted to stay put because they were on weekend rates.\nPolice officer Wendy McCormick found herself telling people in the Arndale: “I don’t want to die because somebody won’t finish their pizza.”\nIt was a Herculean task, aided by the luck of having extra police on duty for the match. Gradually, grudgingly, people began to move, turning into a flood as word spread that the scare was real. The police cordon extended out and out to a quarter of a mile, until there were no more officers to take it any further.\nBy 11.10am, the heart of Manchester city centre was deserted. Only one or two people were still within the exclusion zone, having somehow escaped knowledge of the evacuation.\nUnseen pictures of the aftermath of the Manchester IRA bombA pair of women working in the Arndale, on their way out for a walk, were only saved because they nipped back inside to get their bags. Two minutes before the blast, they were standing on the bridge directly above it.\nShortly after 11am the army bomb disposal squad – which had hurtled to Manchester down the M62 from Liverpool – was preparing to detonate the device from 200 yards away, just off Cross Street near Sam’s Chophouse.\nInspector Dave Comerford, link man between the police and the army, told colleagues over the radio that there would be two blasts – a smaller one as a remote controlled robot blew a hole in the side of the van, followed by the second, which would disable it.\nAt 11.16am, the first blast went off. At 11.17am, they ran out of time.\nWhen the bomb exploded, the blast could be heard from 15 miles away. It issued a force so powerful it travelled around 90 degree corners, knocking people to the ground and blowing out virtually every window within half a mile, leaving a 15m crater around it.\nGlass rained from the sky: a fine dust followed by shards and eventually a torrent of rubble and debris. From his vantage point on Cross Street, Chief Inspector Ian Seabridge later recalled that there was then a ‘sudden air of stillness’.\nThen every alarm in the city centre started wailing.\nIn Bootle Street police station, the screens showing CCTV pictures of the army operation went black. At Belle Vue ambulance control they heard the boom and the telephone switchboard lit up.\nWithin five minutes there were 60 calls to every street in the city centre. Five fire engines and 30 firefighters raced to the city centre from across the region. For over an hour afterwards 999 crews toured the city centre to pick up victims.\nAt Manchester Royal Infirmary they were treating 70 casualties within minutes.\nFor hours afterwards dazed, confused people staggered out of the city centre to find transport. People as far away as Kendals department store - now House of Fraser - had been injured as the windows blew out, having wrongly believed they would be safe under the store's canopy.\nMore than 200 people were hurt in the blast. Yet one fact from that day remains breathtaking – and a testament to that heroic policing operation. Nobody had been killed.\nNevertheless, Manchester city centre lay in ruins. Mannequins hung eerily from windows. Historic landmarks such as Manchester Cathedral, Chetham’s School of Music, the Corn Exchange and the Royal Exchange theatre would take years and millions of pounds to restore.\nLongridge House, the office block next to Marks and Spencer, would be demolished, while the bus station under the Arndale centre would never reopen.\nMuch of the city centre became a no-go zone for its residents and shopkeepers. Some 700 businesses were affected, wiping out a third of the city centre’s floorspace and leaving the council to leap into action in the days that followed in an attempt to save livelihoods.\nBy the time then-home secretary Michael Howard and later the Prime Minister, John Major, visited the ravaged city in the days that followed, city leaders were already planning how to get Manchester back on its feet.\nRead more of today's top stories here\nRead next:",
  "word_count": 1222,
  "scraped_at": "2026-02-14T12:00:31.237447"
}