{
  "article_id": "16a751d9fda0",
  "url": "https://news.webindia123.com/news/Articles/India/20250610/4325672.html",
  "title": "  Ladakh development close to PM Modi heart , Congress ignored it for past 70 years : BJP Pradeep Bhandari",
  "date": "20250610T124500Z",
  "domain": "news.webindia123.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Saturday, February 14, 2026\nNews\nLeh (Ladakh) | June 10, 2025 5:14:19 PM IST\nAddressing a press conference in Leh, the BJP leader also mentioned that the BJP fulfilled several demands that remained \"ignored\" under the Congress tenure.\n\"What was considered impossible to achieve under previous governments has been achieved by the Modi government in this 11-year tenure. For 70 years, Ladakh has been demanding the status of a Union Territory. The Nehru-Gandhi family was in power for 70 years, but the Modi government fulfilled this demand. The Modi government gave 5 new districts to Ladakh, a demand which was kept unfulfilled by the Congress in the past 70 years. Ladakh's development close to PM Modi's heart,\" BJP spokesperson said.\nHighlighting the key initiatives the BJP government took at the Centre in the last 11 years, Bhandari said that the BJP increased Ladakh's budget four times compared to what the UPA government (2004-2014) was sanctioning.\n\"On June 2, 33 per cent reservation was given to women in the Ladakh Autonomous Development Council. Women demanded this from Congress, but the BJP fulfilled it. 85 per cent of local youths got reservations in government jobs under PM Modi, but this was not done by Congress. 11 years of the Modi government have made the impossible possible. Airport modernisation is in its last leg here. Connectivity has always been an issue in Ladakh, but now the infrastructure development plan has been approved by PM Modi. Ladakh is being developed as the solar capital of North India. The country's highest altitude football stadium. Congress only gave Rs 400-600 crore, but PM Modi increased the budget four times to Rs 1600 crore,\" he said.\nCriticising Congress for neglecting Ladakh's interests and ignoring India's defence requirements, Bhandari claimed that Congress did not even purchase a single artillery gun for the armed forces during the 10 years of the UPA.\n\"Congress did not even purchase one artillery gun, machine gun, or bulletproof jacket in its 10 years at Centre. And now we are exporting defence equipment in more than 100 countries...There was a defence minister during Congress tenure who used to say that developing the Leh-Ladakh region would not sit well with Pakistan and China. In contrast, PM Modi was waving Tiranga at Chenab bridge, something Congress could not even dream of in the past 70 years,\" he said.\nHe added that the Prime Minister considers border villages India's first villages, while Congress always considered them the last.\nIn August 2019, after the abrogation of Article 370, Jammu and Kashmir and Ladakh became two separate Union Territories. (ANI)\nLATEST COMMENTS ()\nComments Not Available",
  "word_count": 437,
  "scraped_at": "2026-02-14T14:16:41.298513"
}