{
  "article_id": "16a98671734a",
  "url": "https://www.latimes.com/entertainment-arts/tv/newsletter/2023-03-24/screen-gab-76-screen-gab",
  "title": "NBC  Quantum Leap  revival has a lot to live up to . Caitlin Bassett doesnt seem fazed . ",
  "date": "20230324T194500Z",
  "domain": "latimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "NBC’s ‘Quantum Leap’ revival has a lot to live up to. Caitlin Bassett doesn’t seem fazed.\n- Share via\nWelcome to Screen Gab, the newsletter for everyone who fantasizes about jumping, “Quantum Leap”-style, out of this part of the space-time continuum.\nIn Screen Gab No. 76, Caitlin Bassett, who co-stars with Raymond Lee in NBC’s revival of the beloved time-travel series “Quantum Leap,” shares what she’s watching (and re-watching) and who, in all of history, she would like to leap into.\nAlso in this week’s Screen Gab, many more titles to stream this weekend, from an Oscar-nominated documentary about artist Nan Goldin’s battle with the Sackler family to a docuseries about a European soccer (sorry, football) team with shades of “Ted Lasso.” And as always, we want to know what you’re watching. Pretend we’re at the water cooler and give us your review of a TV show or streaming movie you’ve loved; it may be included in a future edition of Screen Gab. (Submissions should be approximately 100 to 150 words and sent to screengab@latimes.com with your name and location.)\nICYMI\nMust-read stories you might have missed\nSarah Snook wasn’t sold on ‘Succession’ at first. Now, she feels a ‘sense of loss’: As HBO’s “Succession” kicks off its final season on Sunday, the Australian actress reflects on the end of the series and how she has evolved alongside Siobhan “Shiv” Roy.\nCommentary: Iraq is the war no one wants to remember. As an Iraqi American, I can never forget: The invasion changed the course of Times TV critic Lorraine Ali’s life. Twenty years on, its aftermath is still playing out.\nAppreciation: Big role or small, Lance Reddick elevated every scene he was in: With indelible performances in “The Wire,” “Fringe” and the “John Wick” films, Reddick, who died on March 17 at age 60, “didn’t have to get loud to put the fear of God into a character or viewer.”\nIn ‘Yellowjackets’ Season 2, Juliette Lewis says Natalie is seeking ‘redemption’: The former child actor and ‘90s It Girl on returning to the fray with Season 2 of Showtime’s breakout hit and why she has always “gravitated toward underdogs.”\nTurn on\nRecommendations from the film and TV experts at The Times\nDirected by Laura Poitras, “All The Beauty and the Bloodshed” (now on HBO Max) is an engaging and unexpectedly uplifting portrait of the artist Nan Goldin. The Oscar-nominated documentary has an elegantly intertwined structure, presenting the story of Goldin’s life and art alongside her recent activism to remove the pharmaceutical billionaire Sackler family from its prominent position in the art world for its role in stoking the opioid crisis. The stories aren’t really so far removed from one another. Goldin has long had an activist streak, as the film chronicles her work during the AIDS epidemic of the 1980s, and her art has always unblinkingly reflected her own life and times. All of this brings out something new from Poitras as well, a warmth, emotion and feeling of connection that could at times be missing amid the precision and incisiveness of her previous work, including 2014’s Oscar-winning Edward Snowden doc “Citizenfour.” “All The Beauty and the Bloodshed” is an astonishing collaboration between two artists who insist on facing the world with an unsparing clarity. – Mark Olsen\nAs if to underscore the return of its “Ted Lasso” for a third and final season, Apple TV+ has added “Real Madrid: Until the End,” a captivating three-part documentary about a nonfictional football team and its drive to win the Spanish La Liga and the super prestigious European Champions League over the 2021-2022 season. It isn’t necessary, I can attest, to know much about soccer to invest in the series, whose back-from-beyond narrative is the stuff of innumerable sports movies, with one of football’s most successful organizations positioned — thanks to some historical bad luck — as a plucky underdog. Its colorful international cast of players and their equable manager, Carlo Ancelotti — returning after years to reverse the team’s fortunes — might easily have been invented in a Hollywood writers room. The action on the pitch is exciting, the team spirit inspiring, the progress of the season dramatic — which all suggests that “Ted Lasso” isn’t completely a work of fantasy. — Robert Lloyd\nCatch up\nEverything you need to know about the film or TV series everyone’s talking about\nYou could go into “John Wick: Chapter 4” cold this weekend, having never seen any of the previous installments in Keanu Reeves’ action franchise, and simply let the balletic mayhem wash over you for two hours and 49 minutes. But you’d be missing a wealth of world-building detail that has been painstakingly constructed over the course of the series as it has grown from a cult favorite into a genuine box office juggernaut. So for newbies ready to dive into the dark and violent world of John Wick — a universe governed by its own rules and logic, where no one ever calls 911 no matter how high the body count gets — here is a primer.\nThe first film, 2014’s “John Wick,” introduced Reeves’ titular hit man, a seemingly indestructible killing machine who is drawn out of retirement to seek vengeance against the men who killed his dog. Here we learn the key pillars of the Wick-ian universe, including the High Table, the governing body of assassins made up of the world’s most powerful crime lords; the Continental, a New York hotel catering to hit men; and the Bowery King (Laurence Fishburne), a shadowy figure who rules the underground realm. In the second and third films, Wick goes from hunter to hunted after he is declared “excommunicado” by Continental proprietor Winston (Ian McShane) for killing a crime boss on the hotel’s grounds. With a bounty on his head, alone and on the run, Wick begins the fourth film still trying to clear his name with help from the Bowery King and his subterranean network.\nIf that seems like a lot to keep in your head, it is. But should you ever find yourself feeling confused, you can always just switch your brain off and just gawp at the spectacle of some of the most innovative fight choreography and bonkers stunt work ever committed to film. After all, when it comes right down to it, John Wick is a pretty simple character to understand. As he says in 2017’s “Chapter 2,” “Whoever comes, whoever it is, I’ll kill them. I’ll kill them all.”– Josh Rottenberg\nGuest spot\nA weekly chat with actors, writers, directors and more about what they’re working on — and what they’re watching\nTwo beloved stars. An innovative concept. What then-Times TV critic Howard Rosenberg called one of “the boldest, freshest and most entertaining dramatic series on TV”: Any reboot of “Quantum Leap” has a lot to live up to. But Caitlin Bassett, the Dean Stockwell to Raymond Lee’s Scott Bakula in NBC’s revival series, doesn’t seem fazed — what person who mentions “Quantum Leap” successor “Xena: Warrior Princess” in aspirational tones could? Bassett recently swung by Screen Gab to discuss stepping into the accelerator, what she’s watching and who she’d trust as her “Observer” if she had to travel through space-time. —Matt Brennan\nWhat have you watched recently that you are recommending to everyone you know?\n“Ted Lasso,” because everyone needs more joy and kindness in their life. And of course… “Quantum Leap”!\nWhat’s your go-to “comfort watch,” the movie or TV show you go back to again and again?\nSorry, I can’t keep this to one. For shows, “Big Bang Theory,” “Modern Family,” “Fresh Prince,” “Friends,” “Golden Girls,” all the classic sitcoms, really.\nFor movies: “A League of Their Own”! And the “Harry Potter” series.\nAs with Al Calavicci (Dean Stockwell) and Sam Beckett (Scott Bakula) in the original series, Addison appears to Ben as a hologram “observer” to guide him through his leaps. Who would be your observer in real life, and whose observer would you be?\nMy observer would probably be my big sister, Stef Bassett. She is 10 years older than me, was the first one to go into performance (she was Sillabub in the “Cats” tour), the first one to move to New York City, came out after college, and just has generally been a hero and a guiding light for me. I absolutely would not have this career without her forging her path first, and she’s helped me so much to become the person I am today. Now she owns an oyster farm in Long Island, so even with me on a show, she’s still is somehow managing to be the cooler sister.\nAnd I’d be her observer. Mostly because, having a sister 10 years older than myself, I owe her a LOT of trash talk.\nIf you could leap into any person in any time period, who and when would it be and why?\nIn real life, it would probably be Eleanor Roosevelt, because I think she did amazing work, but also because I absolutely would like to know a few things about that era.\nIn pretend life, Xena. For obvious reasons.\nWhat’s next\nListings coordinator Matt Cooper highlights the TV shows and streaming movies to keep an eye on\nFri., March 24\n“Love Is Blind” (Netflix): Old married couple Nick and Vanessa Lachey are back to host a fourth season of this dating competition.\n“My Kind of Country” (Apple TV+): Encouraging diversity is the name of the game in this new music competition from Reese Witherspoon and Kacey Musgraves.\n“Reggie” (Netflix): Major League Baseball Hall of Famer Reggie Jackson — a.k.a. “Mr. October” — reflects on his storied career in this new documentary.\n“Up Here” (Hulu): “Arrested Development’s” Mae Whitman — her? — and Carlos Valdes (“The Flash”) meet cute in 1990s NYC in this musical 2023 rom-com.\n“Secrets of Sulphur Springs” (Disney, 8 and 8:30 p.m.): The tween-themed mystery drama set in a small Louisiana town conjures up a third season.\n“Twisted Sister” (Lifetime, 8 p.m.): She’s not gonna take it — no, she ain’t gonna take it! — in this new thriller. With Mena Suvari.\n“American Masters” (KOCE, 9 p.m.): Opera star J’Nai Bridges and country music’s Rissi Palmer share their struggles and triumphs as Black women in the performing arts in this new episode.\n“Saturdays” (Disney, 9 and 9:30 p.m.): Three young girls get their skate on at a roller rink in Chicago in this new coming-of-age comedy.\nSat., March 25\n“A Picture of Her” (Hallmark, 8 p.m.): See what develops between a small-town gal and a visiting photojournalist in this new TV movie. With Rhiannon Fish.\n“Every Breath She Takes” (Lifetime, 8 p.m.): Every move she makes, he’ll be watching her in this new thriller. With Tamala Jones.\nSun., March 26\n“Great Expectations” (Hulu): The Dickens, you say! The Victorian era author’s classic coming-of-age tale is adapted into a new miniseries. With Fionn Whitehead and Olivia Colman.\n“Rabbit Hole” (Paramount+): “24’s” Kiefer Sutherland is back on the clock in this new espionage drama about a corporate spy framed for murder. With Charles Dance.\n“Mark Twain Prize for American Humor” (CNN, 5 p.m.): Adam Sandler — really? Checks notes — yup, Adam Sandler is feted by his comedy peers at this year’s star-studded ceremony.\n“Eva Longoria: Searching for Mexico” (CNN, 7 p.m.): The “Desperate Housewives” actor savors the flavors of our neighbor to the south in this new six-part foodie travelogue.\n“Bonnie Boswell Reports” (KCET, 8 p.m.): The journalist looks at efforts to reduce pregnancy-related deaths in the new episode “Saving Moms.”\n“Home, Not Alone” (Lifetime, 8 p.m.): Their dream home becomes a living nightmare in this new thriller. With Andrea Bogart.\n“Ride” (Hallmark, 9 p.m.): Saddle up! “Last Man Standing’s” Nancy Travis stars as the matriarch of a rodeo family in Colorado in this new drama series.\n“Succession” (HBO, 9 p.m.): The Emmy-winning drama about a Murdoch-like media mogul and his fractious family is back for a fourth and final season. Brian Cox stars.\n“Yellowjackets” (Showtime, 9 p.m.): They’re not out of the woods yet as this decades-spanning mystery drama returns for Season 2. With Christina Ricci, Juliette Lewis and Melanie Lynskey.\n“HouseBroken” (Fox, 9:30 p.m.): While the humans are away, the cats and dogs will play in new episodes of the animated comedy.\n“Seeking Brother Husband” (TLC, 10 p.m.): There are two boys for every girl as couples become “throuples” in this new reality TV spinoff.\nMon., March 27\n“The Young and the Restless 50th Anniversary Celebration” (CBS, 8 p.m.): Cast members reunite as the long-running daytime drama marks a milestone in this new special.\n“The Bachelor” (ABC, 8 p.m.): Zach makes his selection in the competition’s season finale, followed by the customary “After the Final Rose” special.\n“The 2023 iHeartRadio Music Awards” (Fox, 8 p.m.): Pink and Taylor Swift are singled out for special honors at this year’s ceremony at the Dolby Theatre.\n“Independent Lens” (KOCE, 10 p.m.): Two young women in China push back against traditional gender roles in Violet Du Feng’s poignant 2022 documentary “Hidden Letters.”\n“American Dad” (TBS, 10 p.m.): CIA agent Stan Smith suits up for an 18th season of irreverent animated comedy.\nTue., March 28\n“Mae Martin: SAP” (Netflix): The nonbinary Canadian comic and “Flight Attendant” co-star cracks wise in this new stand-up special.\n“Finding Your Roots With Henry Louis Gates, Jr.” (KOCE, 8 p.m.): This just in: Journalists Jim Acosta and Van Jones explore their family histories in this new episode.\n“American Experience” (KOCE, 9 p.m.): The new episode “The Movement and the ‘Madman’” details how antiwar protests in 1969 helped derail President Nixon’s plans to escalate the conflict in Vietnam.\n“Renovation 911” (HGTV, 9 p.m.): This place is a disaster! Homes seriously damaged by flood, fire, etc., get the TLC they need in this new renovation series.\nWed., March 29\n“The Big Door Prize” (Apple TV+): Small-town residents trust their fates to a fortune-telling machine in this new fantasy comedy. Chris O’Dowd stars.\n“Emergency: NYC” (Netflix): This new docuseries gets up close and personal with EMTs and ER staffers as they respond to life-or-death situations.\n“Riverdale” (The CW, 9 p.m.): It ain’t exactly happy days as the gang finds itself stranded in the 1950s in the mystery drama’s Season 7 premiere.\nThu., March 30\n“RapCaviar Presents” (Hulu): Tyler, the Creator and Jack Harlow are among hip-hop artists sharing their stories in this new series.\n“Unstable” (Netflix): An eccentric entrepreneur (Rob Lowe) and his estranged son (real-life son John Owen Lowe) form an odd couple in this new comedy series.\nMLB Baseball (Fox Sports West, 7 p.m.; SportsNet LA, 7 p.m.) Play ball! Opening Day matchups include the Angels versus the Athletics and the Dodgers versus the Diamondbacks.\n“Prom Pact” (Disney, 8 p.m.): A straight-A student and her misfit BFF join forces to improve their social standing in this new TV movie. With Peyton Elizabeth Lee.\n“CSI: Vegas” (CBS, 10 p.m.): “I’ll Fly Away’s” Regina Taylor guest stars on a new episode of the forensics drama.",
  "word_count": 2499,
  "scraped_at": "2026-02-14T12:44:55.035711"
}