{
  "article_id": "16d906d57218",
  "url": "https://www.starsandstripesfc.com/2025/4/5/24400339/establishing-a-unique-character-and-winning-games-will-make-the-usmnt-likable",
  "title": "Establishing a unique character and winning games will make the USMNT likable",
  "date": "20250405T143000Z",
  "domain": "starsandstripesfc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The United States has emerged as a soccer country and has done it in a particularly American way. The sport has taken off in growth, there are more MLS teams than seem necessary and they draw particularly well in terms of attendance, networks and streaming services clamor to feature soccer in some capacity, and the World Cup is coming next year.\nEstablishing a unique character and winning games will make the USMNT likable\nWinning... It’s like, better than losing\nThings seem pretty great. And yet, there’s a problem, the USMNT keeps losing to Panama. More than that, the team hasn’t had a major win over a top international side in a decade. This is made worse by the fact that the team is lacking an identity. The team hasn’t shown who it is, what it values, and how it even plays consistently. As a result media narratives have cast the players as complacent pretty boys who don’t care about the national team.\nThis disconnection from a unifying sense of collective self comes from the fact that the team keeps losing. It loses to Trinidad & Tobago, it loses to Panama, it loses to Panama, it loses to Canada. The losses are a problem because a core part of the American identity is pretty straight forward: Americans love a winner. Coming out on top after a demanding competition forgives a lot of sins. This is true in business, politics, and especially in sports. Our nation may have equality and fairness as core values, but winning will trump that because: Scoreboard.\nThe US women have embodied this in impressive fashion. The 2019 World Cup winners ran up the score on outmatched competition, never so much as had to deal with the challenge of a score being even in a match beyond starting at 0-0, and can claim a place as one of the most dominant teams in sports history. When they won they celebrated parading the Stars and Stripes through Paris with Fight Night by Migos blasting in the background until a victory parade in New York City. To their detractors the team had the perfect retort: Scoreboard.\nFor the USMNT this presents a challenge when it comes to soccer. In the past the team could claim an underdog status and the wins were endearing because the sin of coming in as an expected loser was erased with every dos-a-cero, upset over World Cup champions, and growing reputation in the soccer world as a team that can win against anyone on its day.\nThe team did this not because of having superior tactics or technical skills. It did this with grit, determination, and athleticism. The team pulled off impressive victories despite lacking the technical ability that the rest of the world idolizes. The main soccer skills those teams had were being defensively organized, fast on the counter, tall on set pieces, and excellent at goalkeeping.\nThere is perhaps nothing more American than showing up and upending the sensibilities of the rest of the world and winning anyway. Imagine being a Spain fan with a midfield of Xavi, Alonso, and Fabregas and watching your team lose 2-0 to a team whose best player was on the LA Galaxy. The sport in the USA had just stepped forward from 40 years of failing to qualify for the World Cup and the skills of the players reflected a new soccer program. This worked until it didn’t and the expiration date for the athletic era of American men’s soccer was reached on October 10, 2017.\nIn the 7 1⁄2 years that followed chiseling WHAT ARE WE DOING? WHAT ARE WE DOING? on that era’s tombstone the team has tried to do something different. October 10, 2017 came on the heels of the failed experiment that Jurgen Klinsmann executed. His time as manager was marked by an attempt to transition from the athletic era to a more technical one. It ultimately failed because the players were not good enough to play the way the manager wanted and the manager wasn’t good enough to get them to adopt that style anyway. Bruce Arena brought back the athletic era and it ended against the Soca Warriors.\nThe tenure of Gregg Berhalter marked an attempt to do what Klinsmann couldn’t. This time the players seemed to be capable of playing in the style of the top nations in the world or at least could eventually develop into players capable of it. Starting in top 5 leagues reflected that and the expectation that they could hang with the big teams wasn’t unreasonable.\nWhile the USMNT was a missed handball call away from potentially reaching a World Cup semi-final in 2002, that was the exception to the rule. The 2006 version of the team had high expectations and was ranked 4th in the world according to FIFA. That team was bounced unceremoniously from the World Cup. Bob Bradley’s 2010 team lost a very winnable elimination game and was an upgraded version of the 2002 squad. That was it, the greatest success that the athletic era reached was needing a handball to have a chance to beat Germany and otherwise couldn’t beat Ghana.\nWhatever is said about the team now and its shortcomings, the current crop of players have moved the program forward. In the past beating Mexico was a nice surprise but this team has become favorites against El Tri. Somehow it is discussed as if becoming regionally dominant and constantly beating your rival is unimportant because the team hasn’t become Italy. And yet, beating Mexico is likable.\nCase in point:\nThere’s nothing unlikable about this. Winning is likable. Losing is not likable.\nJust look:\nThere are a lot of ways to win a soccer game and yet the notion that the USMNT should try to win like the best teams in Europe and South America because of the players in the pool is taken as a given. The team has gone from playing soccer to trying to play le football and so far it has failed to raise the level of the team in the only measurement that matters: Scoreboard. Worse yet, it seems as if a uniquely Un-American idea of caring what the world thinks has moved the team away from a winning strategy.\nThis insecurity was evidenced with Gregg Berhalter’s declaration that his team would “change the way the world looks at American soccer.” Frankly, this is unlikable. The way Berhalter went about doing this was by trying to get the USMNT to adopt positional play and use tactics that have worked for teams like Manchester City. His plan failed in the same way the last manager to bring in European sensibilities to the USMNT did.\nIn the years after the worst failure of American soccer in a generation, the question “WHAT ARE WE DOING, WHAT ARE WE DOING?” rings out from the past like a ghost haunting the team’s future. It’s a question still being asked along with, how can the USMNT be like top teams in Europe and South America? It’s the wrong question, the right one is how can the USMNT be like the best versions of the USMNT? Those gritty teams who did not care about what the rest of the world thought and who were likable because of the one thing that is most important to Americans: Scoreboard.",
  "word_count": 1224,
  "scraped_at": "2026-02-14T12:19:57.521193"
}