{
  "article_id": "17260c79b810",
  "url": "https://thepeoplesperson.com/2025/10/04/jess-park-outlines-what-man-united-must-do-to-become-unstoppable-after-draw-vs-chelsea-299678/",
  "title": "Jess Park outlines what Man United must do to become unstoppable after draw vs . Chelsea - Man United News And Transfer News",
  "date": "20251004T231500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Manchester United star Jess Park has revealed what her side must do to become an unstoppable force in the WSL, following their hard-fought 1-1 draw with Chelsea on Friday.\nUnited hold Chelsea to a draw\nChelsea’s 100 per cent start to the Women’s Super League season came to an end on Friday night, as United salvaged a draw against them at the newly-named Progress With Unity Stadium in Leigh.\nUnited made the brighter start of the two sides but it was Chelsea who struck first inside the opening 10 minutes, with Wieke Kaptein finishing off a clever backheel pass from Catarina Macario.\nBut the reigning champions’ advantage didn’t last too long, as Anna Sandberg restored parity in the 20th minute.\nThe defender fired a brilliant strike into the back of the net to register her first-ever goal for United.\nChelsea and United exchanged spells of dominance for the rest of the game, with both teams looking for a winning goal, but they eventually had to settle for a share of the spoils.\nAfter the final whistle, Park, who was named Player of the Match, told club media that United need to be more clinical in front of goal to take their game to the next level.\nPark’s post-match remarks\nThe summer signing said [as quoted by She Kicks], “We had really good moments in the game. Chances created, we need to stay a bit more clinical.”\n“Alternatively, they had good chances, Maya [Le Tissier] with a super tackle at the end that kept us 1-1. You’ve got to take it, but we’d like to win them games.”\nShe continued, “It’s really starting to click now. You’ve seen how many chances we created: we can build from the back, we can build it longer, we’re a bit more creative in the style. The [dynamism] is hard for teams to cope with.”\n“It’s coming together and I think if we just get a bit more clinical we’ll be right up there.”\nOn her time so far at United after joining the club from Manchester City, Park explained, “That’s what I wanted to do, come and play football and enjoy it and be creative and dynamic, linking with players. You can see it coming off now.”\n“We’ve worked on it in training, we’ve worked on it together, and I think we’re getting the little details a lot more right now.”\nUnited are back in action on Wednesday when they take on Norwegian outfit Vålerenga Fotball Damer in the Champions League.\nFeatured image Molly Darlington via Getty Images\nThe Peoples Person has been one of the world’s leading Man United news sites for over a decade. Follow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 447,
  "scraped_at": "2026-02-14T12:44:22.180802"
}