{
  "article_id": "17708e3383ec",
  "url": "https://www.themag.co.uk/2025/02/chelsea-co-owner-co-owns-site-reselling-carabao-cup-final-tickets-for-thousands-shameful-liverpool-v-newcastle-united/",
  "title": "Chelsea co - owner co - owns site reselling Carabao Cup final tickets for £thousands - Shameful",
  "date": "20250222T123000Z",
  "domain": "themag.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Chelsea co-owner co-owns site reselling Carabao Cup final tickets for £thousands – Shameful\nEarlier this month, we reported (see below) on the revelation that Chelsea co-owner Todd Boehly, the main man/face of that club, also co-owns a company that profits from Premier League tickets getting resold for many thousands of pounds.\nThe shameless reselling company Vivid Seats, that Todd Boehly co-owns, is also on the official Premier League list of unauthorised ticketing websites.\nQuite unbelievable, beyond shocking.\nTodd Boehly personally profiting, as a co-owner, from the disgraceful reselling/touting of Premier League tickets for many many times face value, many thousands of pounds above the normal price.\nThen the obvious thing is to complete the circle, whereby Chelsea co-owner Todd Boehly effectively using cash he makes from the reselling/touting site, to then help finance the shocking way Chelsea are financially allowed to run their club.\nHow can this be allowed to happen?\nAs Newcastle United fans (and Liverpool fans), Carabao Cup final tickets are currently like the proverbial gold dust.\nSo difficult to get.\nI have found a place where buyers from outside the UK can get as many as they want…\nYes, the company that Chelsea’s Todd Boehly co-owns, listing Carabao Cup final tickets for sale, for as much as £4,450.\nAway from the neutral areas of Wembley, the most expensive tickets in both the Newcastle United and Liverpool sections, are priced at £3,878.\nThe cheapest Newcastle United ticket listed is £1,940, the cheapest Liverpool section ticket is listed at £1,141.\nLooking on the Vivid Seats official site, the Board of Directors page, this is what you still find.\nWhat are the Premier League and other football authorities doing about this?\nHow can Todd Boehly be allowed to be a co-owner of Chelsea as well as facilitating the reselling of tickets for thousands more than face value?\nEvery Premier League club (and those in the three divisions below) gets an allocation of Carabao Cup final tickets. Cynical people might wonder where Chelsea’s allocation end up…\nMy original article on The Mag – 5 February 2025:\nThis new revelation on Chelsea co-owner Todd Boehly is truly mind blowing.\nThe Times report (see below) states that Chelsea condemn any of their fans who resell tickets at more than face value, threatening them with sanctions, including fans losing their season tickets.\nYet at the same time the co-owner and main man/face of the club, Todd Boehly, co-owns a company that profits from Premier League tickets getting resold for as much as tens of thousands of pounds.\nThe shameless reselling company that Todd Boehly co-owns, is also on the official Premier League list of unauthorised ticketing websites.\nThis is beyond shocking.\nSo basically, Chelsea have somehow been allowed by the Premier League ‘rules’ to stay within PSR limits despite spending well over £1.5 billion on players since Todd Boehly and his mates took control only two and a half years ago. This amidst all kinds of rumours/reports of using accountancy practices to sell one or more of the club’s training ground, hotels, women’s team effectively to themselves (part of the same overall business, same owners etc).\nThen The Times reporting that Todd Boehly is then personally profiting, as a co-owner, of disgraceful reselling/touting of Premier League tickets for many many times face value, up to tens of thousands of pounds.\nThen the obvious thing is to complete the circle, whereby Chelsea co-owner Todd Boehly will then be effectively using cash he makes from the reselling/touting site, to then help finance the shocking way Chelsea are financially allowed to run their club.\nWhen approached, The Times reporting that Chelsea ‘declined to comment’, no surprises there!\nThen the Premier League doing the same, also declining to comment. No surprises there either.\nThe biggest threat by far to the Premier League and fans, is the ever increasing number of American owners.\nThe American owners of Liverpool and Man U who twice were thrwarted in their attempts to steal away football for their own selfish greed.\nThey were key players in trying to create a break away European Super League (along with Chelsea, Arsenal, Spurs and Man City) that would have given them automatic qualification and ruined all major domestic leagues, especially financially. Whilst that ‘cunning’ plan followed an earlier one where these same six clubs tried to force through changes that would forever give themselves far greater voting powers over other Premier League clubs, so they could at any time force through future votes to award themselves even more money and control.\nThe total ‘punishment’, if you can call it that, was that collectively the shamed six clubs paid a fine which was the rough equivalent of a week of their collective wage bills. No European bans, no Premier League points deducted, only a nominal fine.\nThe Times report – 4 February 2025:\n‘Chelsea’s co-owner Todd Boehly is a director of a website that facilitates the resale of Premier League match tickets for tens of thousands of pounds.\nBoehly is co-owner of Vivid Seats, an American site that allows users outside the UK to buy and sell tickets, in many cases at huge mark-ups, to concerts and sporting events.\nThe company charges commission of 10 per cent, and an additional service fee. British fans cannot use Vivid Seats or other sites like it because it is illegal to resell tickets in this way in the UK. The Premier League includes Vivid Seats in a list of “unauthorised ticketing websites”.\nTickets are available on Vivid Seats for a swathe of upcoming Premier League matches. The cheapest tickets listed for Liverpool’s final home game of the season are priced at more than £1,700; the most expensive at nearly £20,000.\nChelsea have condemned ticket holders who sell on their seats for profit, stating on their website last year: “Supporters found to be selling their ticket for more than face value will be subject to a club investigation and sanctions, including the removal of season tickets, memberships and access to the away match ticket scheme.\n“This unfortunately occurs more often than you would expect, and the club has been forced to ban many members and season ticket holders. In some cases, the matter will be reported to the police for criminal prosecution.\n“The only place to purchase general admission tickets is via official Chelsea FC channels, including the club website and ticket exchange. Ticket holders can only transfer a ticket to a friend or family member for no more than face value.”\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1095,
  "scraped_at": "2026-02-14T12:11:02.277070"
}