{
  "article_id": "1771df08179e",
  "url": "https://theathletic.com/4547088/2023/05/24/usc-athletic-director-replacement-mandel/",
  "title": "Mandel Mailbag : USC AD candidates who could fuel Lincoln Riley success",
  "date": "20230524T093000Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Once upon a time, ACC commissioner Jim Phillips made a handshake agreement with the Big Ten’s Kevin Warren and the Pac-12’s George Kliavkoff to form an “alliance” that would bring much-needed “stability” to college athletics.\nLess than two years later, college athletics has never felt less stable at any time in my career — including within Phillips’ own conference.\nNote: Submitted questions have been lightly edited for length and clarity.\nAdvertisement\nIs the ACC TV deal actually below market for anyone except Florida State and Clemson? Based on the distributions announced last week, the per-school TV money seems comparable to the Big 12 and will likely be comparable to the eventual Pac-12 deal. It’s well below the Big Ten and SEC, but those two conferences get substantially better TV ratings. — Rob, Atlanta\nIf the ACC implodes, how much trouble are the “other seven” schools in? Duke to the Big 12? Syracuse and Boston College crawling back to the Big East for basketball? Wake Forest to the Sun Belt? — Matt, New York\nThe strangest thing about this mini-revolt within the ACC is that, to Rob’s point, most of those schools have little to no leverage. If every school became a free agent tomorrow, the SEC would presumably be interested in Florida State and Clemson. Miami often gets forgotten about because the Canes have been so bad for so long, but if/when “The U” gets it going again, it too, remains a valuable TV brand. The Big Ten would probably be a better fit for that university than the SEC.\nBut North Carolina, NC State, Virginia and Virginia Tech? While it’s been speculated going back to the (former UNC basketball player) Jim Delany era that the Big Ten had its eyes on Tobacco Road, at this point, none of these schools would add enough TV value to keep the current 16 schools whole.\nFlorida State AD Michael Alford is not wrong that his school is the ACC’s most valuable TV brand, as it has been for three decades. But it’s the same uneven dynamic in every other conference. Ohio State, Michigan and Penn State account for far more of the Big Ten’s reported $1 billion-a-year value than Indiana, Purdue and Northwestern. Whatever deal the Pac-12 ends up getting will be due in larger part to Oregon and Washington than Oregon State and Washington State.\nGO DEEPER\nDear Andy: More expansion? What's in it for the Big Ten and SEC?\nIs the ACC’s deal below market value? Maybe a little bit, just because it’s been seven years since it was signed and TV rights have exploded since then. The real cause for panic is that the gap will only grow wider as the other conferences come up for bid again well before the ACC’s is set to expire in 2036.\nAdvertisement\nIf the conference blew up tomorrow, most of the other schools would probably form a league of their own, maybe with 10-12 schools instead of 14. Perhaps they could absorb UConn to bolster hoops. It would be worth less than the ACC as currently constituted, but still well above the Group of 5 leagues. Duke basketball alone is probably worth more than many Power 5 football brands.\nOf course, all of this is moot unless those seven schools can figure out a way to get out of an agreement, the grant of rights, that was explicitly written to prevent this very scenario.\nStewart, with the resignation of AD Mike Bohn, do you think USC goes for a home run hire or someone in-house? Do you think it is likely that Bohn suggested a replacement for himself? USC has been on a roll in multiple sports with the hiring of Lincoln Riley, and transfers and commitments like Caleb Williams and Bronny James. — Connor T.\nHow does the resignation of Mike Bohn impact Lincoln Riley’s career at USC? I don’t mean to imply he could be fired, but with his biggest advocate gone does he still get all the resources he was promised? Does he start looking for other opportunities? — C.G.\nGiven Bohn’s abrupt departure was precipitated by an investigation into the workplace culture in his department that unearthed numerous complaints about his behavior and leadership style, we can safely assume he will have zero say in the next athletic director. And generally speaking, when someone is ousted under suspicious circumstances, the school looks for someone as far removed from them as possible. One possible exception would be Ed Stewart, formerly of the Big 12, who joined USC’s department in August and works directly with football.\nGO DEEPER\nMandel: USC faces more instability with Mike Bohn's resignation\nUSC needs to make a rock-star hire both to shepherd the move to the Big Ten and, as C.G. suggested, make sure Riley is taken care of. As I wrote last week, USC’s NIL initiatives have been incredibly clunky, in large part because Bohn himself pushed back hard against the advent of collectives. Riley will not be able to build a national championship program without comparable operations to the ones at not just Georgia and Alabama, but Oregon, which has the best-funded, most organized collective on the West Coast. The next AD needs to be fully aware and accepting of the new landscape, which Bohn clearly was not.\nOne of my first calls would be to Washington AD Jennifer Cohen, one of the most respected names in the profession. She would obviously bring West Coast familiarity. If it’s more important to have someone with Big Ten or SEC experience, there’s Washington State’s Pat Chun, who spent 15 years at Ohio State; Texas A&M’s Ross Bjork, who spent five years at UCLA; or Pitt’s Heather Lyke, who spent 15 years at Ohio State.\nAdvertisement\nMy question is, who will make the hire? Why would USC trust president Carol Folt to hire his replacement when she apparently failed to fully vet Bohn? The allegations against him of unwanted touching of women date back to Cincinnati. It’s hard to say how much of the blame falls on search firm Turnkey as opposed to USC itself, but at the end of the day, it was Folt’s hire, and she made it at a time when the university was trying to get out from under a bevy of other scandals.\nI’d be interested to hear what USC’s board members think about this latest athletics misstep.\nOn this week's Audible, @NicoleAuerbach joins us to talk:\nHow did USC botch another AD hire?\nWhat's really going on with those 7 ACC schools?\nWould the Big 12 really take UConn foootball?\n— Stewart Mandel (@slmandel) May 23, 2023\nAn interesting article was written this week in ESPN about the mess Tony Petitti inherited with an unfinished Big Ten TV contract. What are your thoughts on the reported buyouts required and night games in the winter months? How much luster is knocked off the deal, or is it just talking season fodder? — Clay M.\nI’m sure the unfinished business in question will get worked out, but it’s yet another example of just how out to lunch Kevin Warren was. How does someone sell a conference championship game they didn’t have permission to sell? And how do you sell a season-long prime-time package to NBC without making sure your most prominent programs are fully on board with playing November night games? It seems like he was in a rush to announce a deal and get all his pats on the back before having fleshed out all of the details.\nAnd then of course he left it for someone else to figure out.\nI know Larry Scott is the standard-bearer for major commissioner wreckage (the Pac-12 is still paying unexpected bills he left behind), but Warren’s brief tenure as Delany’s successor was bizarre and divisive. While there was no playbook for how to handle the difficulties of 2020, his communication skills during that period were woeful. It came out in a 2022 Sportico article that the ADs nearly held a no-confidence vote on Warren. But from what I’ve been told, the final straw (why he hadn’t been offered a new contract) was that some presidents weren’t fond of his post-USC/UCLA victory tour last year when he made some aggressive comments about future expansion before reaching any consensus on the issue from the people he serves.\nAnd now, on top of that, he may have overpromised on how much money they’d be receiving.\nThere are similarities galore between Warren and Scott — both came from outside college sports, determined to rock the boat. Both were 50,000-foot thinkers who left the on-the-ground details for their underlings to figure out. The big difference was Warren took over a thriving conference that was already printing money. It’d be hard for anyone to screw that up completely. Whereas the Pac-12 was dealing with inherent challenges long before Scott got there, and some of his ill-advised decisions exacerbated them.\nAdvertisement\nI’ve heard nothing but good things from those who have worked with Petitti, and his experience in television should help smooth over whatever issues still need to be resolved with Fox and NBC. But simply being open and transparent with his members would automatically be a big improvement.\nGO DEEPER\nWho is Tony Petitti? From the BCS's 'No. 1 son' to Big Ten commish\nStewart, pull out your crystal ball and make a bold, gutsy prediction for each Power 5 conference for the 2023 season. — Rob W., Columbia, S.C.\nOK!\nACC: NC State QB Brennan Armstrong will light up Notre Dame in Week 2. Armstrong was completely overlooked nationally at Virginia, where, in 2021, he threw for 4,449 yards and 31 TDs in 11 games before suffering a season-ending injury. He regressed considerably last season under new coach Tony Elliott, but in Raleigh, he’s reunited with his former OC, Robert Anae. That showcase Week 2 game will be a chance to reintroduce himself (or for most non-ACC fans, introduce himself for the first time).\nBig Ten: Maryland will upset one of Ohio State, Michigan or Penn State. Mike Locskley’s program has been getting a little bit better every year — from 3-9 to 7-6 to 8-5 — and brings back star QB Taulia Tagovailoa, veteran WR Jeshaun Jones and breakout RB Roman Hemby. The Terps hung with both the Wolverines and Buckeyes into the fourth quarter last season, but couldn’t get the stops they needed. One of those three games goes their way this year.\nBig 12: The conference champion will finish outside the top 10. Last year’s Big 12 was the strongest and deepest in many years, as evidenced by TCU playing in a lot of close games, then reaching the national title game. Unfortunately, all the top teams lost all their best players. (Obviously, that’s an exaggeration.) Either star-studded Texas will live up to its potential for the first time in 15 years and wreck everybody, or, more realistically, eight teams finish between 9-3 and 7-5.\nSEC: Florida finishes last in the SEC East. Billy Napier did a great job at ULL, but I’m failing to see much reason for optimism heading into Year 2, especially if ex-Badger Graham Mertz is his best option at quarterback. The returning roster was underwhelming, and the Gators lost a lot more to the portal than they gained. It’s not inconceivable that Vandy, which beat Kentucky and Florida late last season to finish 5-7, passes Florida in the standings.\nPac-12: My bold prediction for the Pac-12 is we will find out sometime between two weeks and two months from now that the league reached a decent-enough TV deal.\nPrevailing wisdom in the transfer portal era says that the gap between classes of college football teams will widen as the top G5/lower P5 teams will now frequently transfer to the big fish programs for more NIL opportunities. Prevailing wisdom in the 12-team College Football Playoff era says (hopes?) that the gap between classes of CFB teams will shrink as the middle class now has bigger stages to sell to top recruits.\nWhich force do you think will win out? — Will S., Los Angeles\nI keep waiting for this great NIL/portal reckoning that is going to relegate two-thirds of FBS to the scrap heaps. It would be one thing if the starting point for college football pre-2021 was something closer to widespread competitive equity, but in fact, such a thing never existed. No question, the Group of 5 schools are taking a hit, as it seems like the P5 is just looking at their all-conference teams and picking who they like. But at the same time, P5 schools are now reserving more of their scholarships for transfers, leaving less room for high-school recruits, which has a trickle down to the G5 level.\nAdvertisement\nThe most noticeable effect has been higher up the ladder. The portal has afforded the small pool of schools that already dominated the sport — mainly Georgia, Alabama, Ohio State and LSU — yet another means to reload on an annual basis. Just last week, LSU added Notre Dame’s leading rusher from last season, Logan Diggs. Georgia’s arguably one hole for this season was at receiver, so Kirby Smart went out and got All-SEC receiver Dominic Lovett from Missouri. Imagine if the Golden State Warriors lost Draymond Green in free agency and could turn around any player in the NBA to replace him, regardless of contract status. They would never have a down year again.\nAnd all of that may sound depressing within the confines of the current four-team Playoff, but good news — it’s going away.\nIt’s hard to predict the impact of the 12-team Playoff before it starts, but it absolutely has more potential to help the middle class than NIL or the portal. This will be the first time in the history of the sport that it has a truly national postseason format. The SEC and Big Ten may get the most teams in, but the champions of every other major conference are guaranteed a spot. One of the current Group of 5 champions is guaranteed a spot. Every program in the country now has the ability to point to Playoff contention as a selling point.\nMost of the very best players are still going to want to go to the handful of programs that consistently play for championships and produce NFL players. But it may mean a few of the highly rated West Coast QBs choose to stay on the West Coast, knowing they can reach the Playoff at any Pac-12 school. It may mean a kid who has an offer from Ohio State but knows it may take him a few years to start opts instead to go to Illinois and start right away. And who knows, if a Tulane or Memphis becomes a CFP regular, gets in and wins a game or two, they would elevate their program’s profile tremendously much like Gonzaga did in hoops.\nNone of that is going to mean the death of the upper class or turn Rutgers into a national title contender, but even if it chips a few players a year away from Georgia/Alabama, etc., it might allow someone else to catch up.\nHi Stew, there are five records that are sacrosanct in college football:\n• Nebraska’s 348 consecutive AP poll appearances\n• Nick Saban’s seven (and counting) national titles\n• Knute Rockne’s .881 winning percentage\n• Oklahoma’s 47-game winning streak\n• Florida State’s 14 consecutive top-5 finishes\nCould you rank these in the likelihood of them being broken or, if it’s not possible, someone threatening the record? — Drew\nThe most gettable of those is definitely Saban’s record, largely because he himself will always be a year away from making it eight. But also because Kirby Smart is only 47, 11 years younger than Saban was when he won his second ring in 2009.\nNext, I’d go with Nebraska’s admittedly ridiculous poll streak (1981-2002), again, because of Alabama. The program is currently at 245. It would take another 7-to-8 years, which is a lot, but the Tide don’t have to keep going 11-2 to do it. Some nine-win seasons would still suffice.\nAdvertisement\nI’d go with Rockne’s winning percentage next. On the surface, it looks awfully daunting, but believe it or not, Urban Meyer, who coached as recently as 2018, is currently No. 3 all-time (.854). So, winning almost 90 percent of your games may well be doable in the modern era. Possible contenders if they coach long enough: Ryan Day (currently .882), Lincoln Riley (.836) and Smart (.844).\nThe likelihood of someone replicating FSU’s 14-year top-5 streak (1987-2000) is extremely unlikely. Alabama is currently up to 15 consecutive top-10 seasons, but even the Tide have a No. 10 (2010), No. 7 (2013) and No. 8 (2019) in there. Bobby Bowden coached in an era with 11-game schedules (though he unquestionably loaded them up, and one bowl game). You’d have to be insanely consistent to pull that off.\nFinally, I’ll put the chances of a 47-game win streak at 0.2 percent. Bud Wilkinson did it from 1953-57. That was well before 85-scholarship limits, the portal, conference championship games and, coming soon, a 12-team Playoff. The longest streak of the last 15 years was by Clemson when it went 15-0 in 2018 and got to 14-0 the next year before losing in the title game to Joe Burrow. To get from 29 to 47, the Tigers would need to be undefeated for three consecutive seasons, which will soon require winning at least three Playoff games.\nGood luck with that.\nI appreciate the list you came up with, Dan, but there is one more sacrosanct record that I predict with extreme confidence will never be broken: Barry Sanders’ 238.9 rushing yards per game in 1988.\nI could see UTEP joining the ACC before another college running back averages 239 yards a game.\n(Top photo: Kiyoshi Mio / USA Today)",
  "word_count": 2992,
  "scraped_at": "2026-02-14T13:09:10.508694"
}