{
  "article_id": "1772c12bae0d",
  "url": "https://www.finanznachrichten.de/nachrichten-2023-11/60727250-college-of-dupage-chaparrals-will-defend-njcaa-national-title-crown-296.htm",
  "title": "College of DuPage : Chaparrals Will Defend NJCAA National Title Crown",
  "date": "20231121T194500Z",
  "domain": "finanznachrichten.de",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Two-time defending champions face Rochester Community & Technical College in NJCAA Division III Football Championship at the Red Grange Bowl on Dec. 2\nGlen Ellyn, Illinois--(Newsfile Corp. - November 21, 2023) - Two-time defending National Junior College Athletic Association (NJCAA) Division III champion College of DuPage will have its opportunity for a three-peat when the top-ranked Chaparrals take on the No. 2-ranked Rochester (Minnesota) Community and Technical College (RCTC) Yellowjackets in the third annual National Football Championship at the Red Grange Bowl on Saturday, Dec. 2, at COD's Bjarne Ullsvik Stadium and MacDougall Field on its Glen Ellyn campus, 425 Fawell Blvd.\nKickoff is noon and the game will be streamed on ESPN+.\nTickets are $10 and are available for sale (cash only) at the point of entry gameday. Advance tickets may be purchased through the McAninch Arts Center Box Office and available for pick-up at the game with proof of purchase.\nCOD (10-1 overall), ranked No. 1 all season long in NJCAA non-scholarship play, will defend its national title after leading the division in points (35.5), total offensive yards (4,068) and ranking second in yards/game (369.8).\nDefensively, the Chaps lead in fewest points allowed (15.7) and fumble recoveries (17), and rank second in yards allowed (199.8/game) and rushing yards (74.6/game).\nThe Chaparrals reached a 10-win regular season for the first time in 28 seasons. Their only loss came against NJCAA D1 power Iowa Central, and their victories include games against D1 Ellsworth (Iowa) and Georgia Military College.\n\"We're excited for the opportunity to play for the national championship,' said head coach Matthew Rahn. \"We've gotten better and better as the season has gone along. Our effort in the final game of the year against Georgia Military showed what we're capable of doing when we play at our best. We need to bring that same type of effort into the title game. Rochester was one of the better teams we played this season and they do some great things on offense and defense. We're confident that if we play our best brand of football and not have any mishaps, we should be able to take care of business.'\nThe game is a rematch of their Sept. 2 contest in which COD defeated the host Yellowjackets 24-21. Chaps QB Peyton O'Laughlin threw for two touchdowns and ran for another.\n\"We turned the ball over a bunch and had a small chance of winning, yet we found a way to win,' Rahn said of the earlier Rochester match-up. \"I really believe that our mental toughness played a big role in our winning a difficult game.'\nO'Laughlin leads the Chaps in passing (90 of 146 for 1,424 yards, 16 TDs, 5 INTs, 172.9 passing efficiency). All-American running back Jaden McGill averages 5.4 yards a carry with 9 TDs and has totaled 1,174 all-purpose yards.\nDefensively, the Chaps are led by reigning NJCAA Defensive Player of the Year SS Guy Goss, who is third in solo tackles (47) and eighth in total tackles (61).\nFreshman PK Christian Casillas is a three-time NJCAA Special Teams Player of the Week. He owns a season-high 51-yard field goal, is successful on 9 of 12 FG attempts and is 43 of 45 on PATs. His 70 points rank No. 1 among all specialists and second among all scorers.\nThe Yellowjackets captured the Minnesota College Athletic Conference championship, defeating North Dakota State College of Science 24-16 on Nov. 5 in St. Cloud, Minnesota. RCTC averages a division-best 379.8 yards per game with a daunting passing game, averaging a D3-best 226 yards and a contest with 24 TD receptions.\nThe national championship game recognizes the feats of the late Red Grange, one of football's all-time greats and arguably the game's greatest all-time offensive player. The Wheaton native, nicknamed the \"Galloping Ghost\" and the \"Wheaton Iceman,\" is a charter member of both the Pro (1963) and College (1951) Football Halls of Fame. His single-greatest feat remains almost fantasy - scoring four touchdowns in the opening 12 minutes versus the University of Michigan Wolverines in the University of Illinois Memorial Stadium dedication game on Oct. 18, 1924. All told in that game, he was responsible for six TDs and totaled 409 all-purpose yards.\nGrange went on to earn three All-American honors at Illinois and became the first major signing by Chicago Bears owner and head coach George Halas. Later that year, Halas took Grange and the Bears on a coast-to-coast tour in which the club played 16 games in nine weeks. That effort is thought to have saved the National Football League and fortified Grange as a household name in America, ranking among the likes of such legends as Babe Ruth and Jack Dempsey.\nFigure 1\nTo view an enhanced version of this graphic, please visit:\nhttps://images.newsfilecorp.com/files/9467/188248_f4b5e76b84f9690d_001full.jpg\nTitle Game home\nThis marks the third straight year the NJCAA D3 Football Championship at the Red Grange Bowl will be played at College of DuPage. The Chaps defeated Nassau (N.Y.) CC 34-29 in the inaugural championship Dec. 4, 2021, and then repeated with a 14-12 victory last season against North Dakota State College of Science. The championship site is in the third year of a four-year contract.\nCollege of DuPage is a member of the National Junior College Athletic Association and National Junior College Athletic Association Region IV. The College's Athletics program offers 10 men's and 10 women's sports teams each year, including outdoor track and field, indoor track and field, cross country, football, volleyball, golf, basketball, lacrosse, tennis, baseball, softball and soccer. All home games are played on the Glen Ellyn campus, 425 Fawell Blvd.\nCollege of DuPage Athletics\nContact: Sports Information Coordinator Mark Reinhiller\nEmail: reinhillerm@cod.edu\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/188248\nGleichzeitig vollzieht sich an der Wall Street ein lautloser Favoritenwechsel. Während viele auf Wachstum setzen, feiern Value-Titel mit verlässlichen Cashflows ihr Comeback: Telekommunikation, Industrie, Energie, Pharma – die „Cashmaschinen“ der Realwirtschaft verdrängen hoch bewertete Hoffnungsträger.\nIn unserem aktuellen Spezialreport stellen wir fünf Aktien vor, die genau in dieses neue Marktbild passen: solide, günstig bewertet und mit attraktiver Dividende. Werte, die nicht nur laufende Erträge liefern, sondern auch bei Marktkorrekturen Sicherheit bieten.\nJetzt den kostenlosen Report sichern – bevor der Value-Zug 2026 endgültig abfährt!\nDieses exklusive PDF ist nur für kurze Zeit gratis verfügbar.",
  "word_count": 1049,
  "scraped_at": "2026-02-14T12:05:46.590948"
}