{
  "article_id": "177f5ff854c4",
  "url": "https://highlandcountypress.com/miami-universitys-2023-hall-fame-class-announced",
  "title": "Miami University 2023 Hall of Fame class announced | The Highland County Press",
  "date": "20230619T161500Z",
  "domain": "highlandcountypress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Miami University’s 2023 Hall of Fame class announced\nMiami University Athletics will recognize one team and six worthy and deserving candidates in its Hall of Fame Class of 2023.\nThis year's Hall of Fame class is Lauren Collins (track & field), Rick Goins (men's basketball), Ryan Jones (hockey), Kim Kinzler (swimming & diving), Jess Kodiak (soccer) and Pete Lindsay (swimming & diving). Miami is also making history, inducting its first team into the Hall of Fame, beginning with the 1973 football team.\nThe 2023 class will be celebrated on Friday, Sept. 22 with a dinner. More information will be available soon.\nLAUREN COLLINS '04\nLauren Collins excelled during her time with Miami Track and Field, including earning MAC individual titles in the shot put (2003 outdoor), weight throw (2004 indoor) and hammer throw (twice, in the 2003 and 2004 outdoor seasons). Collins owns marks among the top five in program history in discus, shot put and hammer while still holding the RedHawks' indoor record for weight throw (19.21m).\nShe became the first MAC athlete to score all four years in the shot put, discus and hammer, earning Most Outstanding Performance honors at the 2003 MAC outdoor championships when she collected a total of 28 points for the Red and White. She advanced to represent Miami at the national championship meet that spring (hammer) as well.\nCollins' career awards include Academic All-MAC, First-Team All-MAC and USTCA Academic All-America recognition.\nRICK GOINS, '80\nRick Goins earned four letters and was a part of two MAC title teams (1977, 1978) during his four seasons with Miami basketball. He earned All-MAC honors in 1979 and the program's William Rohr Most Valuable Player award that same season. In 1980, he served as team captain and repeated as team MVP.\nGoins is a top-25 scorer all-time for Miami with 1,230 career points and is top-10 in career field goals. He led Miami in scoring with 16.4 points per game in 1979 and 15.4 points per game in 1980.\nIn 1978, Goins helped pull off one of the most significant victories in Miami program history, as the Red and White upset defending national champion Marquette University 84-81 (OT) in the NCAA Tournament.\nRYAN JONES '08\nRyan Jones did not miss a game in his college career, accumulating 147 points (90g-57a) in 161 games. Jones, a three-time team captain, still holds Miami's career record for game-winning goals (21) and ranks second in program history for goals scored. He was named a First-Team West All-American and Hobey Baker Hat Trick Finalist in 2008.\nJones' time wearing the Red and White included a CCHA championship (2006), a school-record 33-win season (2008), three All-CCHA nods, two CCHA All-Tournament teams and three consecutive trips to the NCAA Tournament.\nA 2004 draft pick of the Minnesota Wild, Jones went on to produce 100 points between Nashville and Edmonton in his NHL career from 2008-2014.\nKIM KINZLER, '90\nKim Kinzler was a seven-time MAC Champion in swimming during her time at Miami (1987-1990). She won titles in the 50 freestyle (1987), 100 freestyle (1987), 200 medley relay (1987, 1990), 200 freestyle relay (1987, 1990) and 400 freestyle relay (1987).\nKinzler played a key role in helping Miami's team secure back-to-back MAC Championships in 1987 and 1988. She was also an NCAA Qualifier and Olympic trial qualifier.\nJESS KODIAK, '12\nJess Kodiak earned four letters for the women's soccer program from 2009-12. Kodiak currently ranks fourth all-time in program history with 90 points and 32 goals and is third in assists (26). The 2012 MAC Player of the Year secured a school record 12 assists that season and finished the year with 36 points, fifth-most in school history for a single season. For her efforts, she was named third-team All-America by the NSCAA as a senior.\nShe earned First-Team All-MAC honors in 2011 and 2012 and helped Miami to a 20-3-1 (10-0-1 MAC) record her senior season. To go along with a regular-season MAC Championship in 2012, the RedHawks also captured a MAC Tournament Championships and an NCAA Tournament win over No. 20 Tennessee. She was also a two-time Academic All-MAC Performer in 2011 and 2012.\nPETE LINDSAY\nPete Lindsay served as head coach for 31 seasons for the Miami men's swimming and diving team. During his time, Lindsay won the Mid-American Conference Coach of the Year award six times (1991, 1994, 1996, 1999, 2005, 2006). Coach Lindsay took over the program in 1985, leading the Red and White to 17 top-two finishes in the MAC, including three championships (1997, 1999, 2006).\nHe currently holds a school-record 172 career dual meet victories. His program finished as high as 23rd in the NCAA Championship (1999) during his coaching career. Lindsay's tenure saw seven of his student-athletes combine to capture 10 MAC Swimmer of the Year awards. Additionally, six of his divers earned 11 total MAC Diver of the Year titles.\n1973 FOOTBALL TEAM\nThe 1973 football season is the opening chapter in a trilogy of seasons that helped Miami carve a unique niche in college football history. From 1973-75, Miami amassed an amazing 32-1-1 record, capturing three Mid-American Conference Championships.\nIn 1973 alone, under head coach Bill Mallory, Miami went a perfect 11-0, including wins over Purdue, South Carolina and Florida (in the Tangerine Bowl). In all, the football team outscored its opponents 223-76 in 1973, finishing the year ranked No. 15 in the final Associated Press poll.\nThe 1973 football team is the first team inducted into the Miami Hall of Fame.",
  "word_count": 917,
  "scraped_at": "2026-02-14T13:46:47.153569"
}