{
  "article_id": "1788bb542c7d",
  "url": "https://www.newsweek.com/prince-william-shock-princess-charlotte-viral-tiktok-photo-similarity-1780154",
  "title": "Prince William Shock at Looking Like Charlotte Goes Viral :  Incredible  ",
  "date": "20230209T173000Z",
  "domain": "newsweek.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Prince William was seemingly bowled over by seeing a photograph of himself as a child looking \"just like\" his daughter, Princess Charlotte.\nWilliam and Kate Middleton were visiting the Khidmat Centre, in Bradford, England, in January 2020 when they saw their love story recreated in a series of photographs placed on top of cupcakes baked by Siama Ali, of Cup Caker Bradford.\n\"Is that me?\" the Prince of Wales said. \"Doesn't it look like Charlotte? Doesn't it look like Charlotte? Is that me? Oh my goodness. Is that me? That looks just like Charlotte. That's incredible. I haven't seen that before. Very alike similarity.\"\nThe video, viewed more than 700k times and liked almost 80k times, was posted alongside a message which read: \"Her father's twin.\"\nOne comment liked 2,372 times read: \"Charlotte is William, Louis is Kate and George is a perfect mix of both.\"\nAnother read: \"And when Charlotte laughs she looks like her grandma.\" Charlotte's grandmother on William's side is Princess Diana and on Kate's is Carole Middleton.\nAnother comment read: \"When William sees Lottie he sees not only himself but Diana as well. What a blessing for him.\"\nThe picture of William was taken when he was 10 and visiting Buckmore Park Playscape, in Chatham, England, where he went go karting.\nAt the time, Ali wrote on Instagram: \"Will never forget their reactions😍😍 loved every second and was a honour to meet them. Kate shook my hand twice❤️ the top tier and all framed cupcakes were packed for them to take.\n\"What a honour🙈thank you to everyone for their love & support I cannot explain how I feel at the moment.\"\nPrincess Charlotte is William and Kate's second child, born two years after Prince George and three years before Prince Louis.\nFans also compared William to Charlotte after they appeared together in a video wishing England's women's football team, the Lionesses, good luck ahead of the Euro 2022 final, which they won.\nWilliam said: \"We both want to wish the Lionesses the best of luck for tonight. You've done amazingly well in the competition and we are rooting for you all the way.\"\nCharlotte added: \"Good luck. I hope you win. Bye.\"\nJack Royston is chief royal correspondent at Newsweek based in London. You can find him on Twitter at @jack_royston and read his stories on Newsweek's The Royals Facebook page.\nDo you have a question about King Charles III, William and Kate, Meghan and Harry, or their family that you would like our experienced royal correspondents to answer? Email royals@newsweek.com. We'd love to hear from you.",
  "word_count": 431,
  "scraped_at": "2026-02-14T13:03:25.304435"
}