{
  "article_id": "17997247cbdb",
  "url": "https://theathletic.com/4833777/2023/09/06/chelsea-riyadh-air-sponsorship-shirt/",
  "title": "Chelsea met with Saudi airline Riyadh Air over shirt sponsorship deal",
  "date": "20230906T111500Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Chelsea executives hosted representatives from Saudi state airline Riyadh Air and pitched a potential front-of-shirt sponsorship deal as the club continue talks with a number of companies to grow their commercial revenue.\nRiyadh Air, which already sponsors Atletico Madrid, is owned by Saudi Arabia’s Public Investment Fund (PIF), the majority owner of Newcastle United. The Crown Prince Mohammed bin Salman announced the formation of the new airline in March, which has still not flown a plane and does not plan to do so until 2025.\nAdvertisement\nChelsea officials, including chief executive Chris Jurasek, hosted a Riyadh Air delegation at Stamford Bridge for Saturday’s 1-0 defeat to Nottingham Forest. The club then pitched to the airline about a multi-year sponsorship deal for the men’s and women’s teams.\nAnother contender for the front-of-shirt sponsor is the betting website Kaiyun Sports, which announced a deal with Nottingham Forest last week.\nKaiyun Sports appears to target customers in China — where gambling is illegal — and accesses the UK market via a “white label” agreement with a company on the Isle of Man. It is unclear what country Kaiyun is based in or who its owners are, which is extremely unusual for a sponsorship deal of this prominence.\nGO DEEPER\nSpecial report: How Premier League shirt sponsors 'facilitate illegal gambling'\nChelsea are reassured, however, by the fact Kaiyun have existing deals with Real Madrid, Crystal Palace and Inter Milan, while the betting firm already has a partnership deal with Chelsea and was displayed on the billboards at Stamford Bridge on Saturday.\nThe club have previously had a deal with Asian gambling website Leyu Sports, which The Athletic revealed was fronted by non-existent employees, and called off a potential front-of-shirt deal with gambling website Stake in June after a fan-led backlash.\nPremier League clubs voted to ban all gambling firms from being front-of-shirt sponsors from 2026, but eight of the top flight’s 20 teams have such agreements this season.\nRead more\n: Analysed – Every Premier League club’s shirt sponsorship deal\nChelsea’s blue shirts have been blank so far this season as the club attempts to replace mobile network Three. There have been negotiations with Infinite Athlete, an “operating system for sports”, but the deal is still awaiting approval from the Premier League.\nInfinite Athlete is a recently formed company that came together when Tempus Ex Machina (a technology company which signed a seven-year partnership with Chelsea in April) acquired Biocore, meaning Tempus now go under the name Infinite Athlete. The investment fund Silver Lake — which owns more than 18 per cent of the City Football Group, the umbrella organisation which owns Manchester City — is also an investor in Infinite Athlete, but Chelsea do not consider this, or the fact Riyadh Air is owned by the majority shareholder of Newcastle, to be a deterrent.\nAdvertisement\nThe prospective front-of-shirt deal with Infinite Athlete is only expected to be for the remainder of this season as the company seeks to target the European sports market following its launch. Chelsea’s existing partnership with Tempus saw them install Match View X technology on the club’s app this season, giving fans the chance to watch games back and access player tracking, data and graphics.\nChelsea are scouring the market for longer-term deals that would kick in from the start of next season. Riyadh Air and Kaiyun Sports are just two of the companies to have held meetings with the club, but Chelsea sources, who wished to remain anonymous owing to the confidential nature of the discussions, said conversations are ongoing with others, including another major technology company in the U.S. and stressed that no deal with either the Saudi airline or Kaiyun is imminent. The club host prospective partners reasonably often at games and this does not always mean a deal will be concluded. For example, Chelsea have previously hosted the insurance company Allianz, but a deal did not come to fruition.\nKaiyun would also be interested in starting a potential front-of-shirt deal this season if the Infinite Athlete agreement is not finalised. However, that deal is at the Premier League approval stage and remains in pole position. The Premier League is reviewing both the market value of the deal and the funding behind the company.\nChelsea’s commercial team are focusing largely on businesses within the airline industry, along with insurance firms, technology companies, and the financial services sector for their long-term partnerships.\nClub sources indicated to The Athletic that Chelsea will be seeking an overall package of up to £60million ($75m) per year for the front-of-shirt sponsorship, to include both the men’s and women’s teams, with the club seeking to compete with the Emirates shirt deal secured by Arsenal.\nAdvertisement\nThe price may fluctuate based on a variety of factors, such as the length of a deal, the assets included in a contract and whether the club is competing in the UEFA Champions League. Chelsea will not take part in any European tournament this season after failing to qualify.\nEarlier this year, FIFA did not proceed with a proposed agreement for Visit Saudi, the Saudi state tourism board, to sponsor the women’s World Cup following a public backlash from female players involved in the tournament owing to the state’s record on women’s rights and laws that criminalise LGBTQ+ people. Saudi Arabia says, however, it is investing substantially in women’s football and launched the women’s Saudi Premier League in 2020.\nRead more:Is Saudi Arabia funding Chelsea?\nChelsea have sought to expand their commercial team over the past year, hiring a new chief executive in Jurasek and seeking to improve their digital and fan engagement strategy.\nIf Chelsea did sign a front-of-shirt deal with the Saudi airline, it would mean three of the Premier League’s ‘Big Six’ have a deal with a Middle Eastern state airline, alongside Manchester City (Etihad Airways) and Arsenal (Fly Emirates).\nIn July, Chelsea announced Oman Air as the club’s “official airline partner” in a multi-year deal.\nA Riyadh Air spokesperson said the company is “not engaged in such talks” in terms of formal negotiations, but did not deny that meetings have taken place.\nThe Athletic approached Chelsea, Kaiyun Sports and Infinite Athlete for comment.\n(Top photo: Harriet Lander – Chelsea FC/Chelsea FC via Getty Images)",
  "word_count": 1041,
  "scraped_at": "2026-02-14T12:56:10.412589"
}