{
  "article_id": "179e40a9cb0f",
  "url": "https://www.usmagazine.com/entertainment/news/who-is-carson-beck-5-things-to-know-about-the-miami-hurricanes-quarterback/",
  "title": "Who Is Carson Beck ? 5 Things to Know About the Miami Hurricanes Quarterback",
  "date": "20260101T014500Z",
  "domain": "usmagazine.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Few college football players have made more headlines than University of Miami quarterback Carson Beck — on and off the field.\nIn his first and only season with the Hurricanes, Beck led them to the College Football Playoff for the first time in the program’s history, helping to elevate the U back to its glory days. In the process, he has improved his NFL Draft stock, signed countless endorsements and ruffled plenty of feathers.\nBut none of that mattered when he stepped on to the field to lead Miami against Texas A&M University in the first round of the 2025 playoffs, guiding his team to a hard-fought 10-3 road win. It wasn’t pretty, as Beck threw for a season-low 103 yards, but it was enough for the Hurricanes to march on.\nBeck will soon hear NFL commissioner Roger Goodell call his name on draft night, thrusting him further into the national spotlight. In the meantime, keep scrolling for everything to know about Miami quarterback Carson Beck.\nCarson Beck Is a 2-Time National Champion\nBefore Beck arrived in Coral Gables, he played quarterback for another college football powerhouse, the Georgia Bulldogs. He backed up former Georgia QB Stetson Bennett on the Bulldogs’ 2021 and 2022 national championship teams before taking the reins in 2023.\nAs a second-stringer, he completed only 36 passes over the two championship seasons combined, but burst onto the scene in 2023 with 24 touchdown passes and nearly 4,000 passing yards in his first year as a starter.\nAfter leading Georgia back to the playoff in 2024-25 and now Miami in 2025-26, he has ended four of his five college seasons on the sport’s biggest stage.\nCarson Beck’s Parents Helped Shape His Football Future\nBeck’s father, Chris, is a retired Navy officer who played football for the Midshipmen in college for three seasons. He was also Carson’s first coach, guiding his youth team for 10 years.\nHis mom, Tracy, is now a kindergarten teacher in Florida, but was once a cheerleader for the NBA’s Washington Bullets (now the Wizards).\nThough they are now divorced, they are both a frequent presence at Carson’s games and have provided crucial support throughout his career. When Carson was at Georgia and struggling to compete with Stockton for the starting quarterback job, Tracy was there to prop him up.\n“It was just one of those moments, and he got through it,” Tracy told Dawg Nation in 2023. “I just said, ‘Carson, you’ve wanted this your whole life,’ and I don’t remember what truly happened. He might have just had a bad practice if I remember correctly.”\nTracy recalled her son asking for “one more” pep talk. “I just said, ‘Carson, go for it. You’ve had this dream your whole life. You’ve got this. I don’t know anyone else that perseveres more than you do,’ and that was it.”\nHe Dated Former Miami Basketball Player and Influencer Hanna Cavinder\nBeck committed to Miami out of the transfer portal in early 2025, at the same time influencer Hanna Cavinder (and her sister, Haley) was playing for the Hurricanes’ women’s basketball team.\nBeck and Hanna dated from 2024 to 2025 before a tumultuous breakup that involved allegations of cheating and some brutal quotes from Hanna.\nLooking back on it, Beck told ESPN that it had been tough to go through the breakup while in the public eye.\n“You make mistakes as a person, but it sucks that you have to go through something like that with someone that you care about, and now it’s all over the Internet,” he said in a profile published in October. “Half of what you see in the media is true. Half of what you see is not true. So, people pick their side of the story and run with it. The people that know the truth know the truth.”\nHe added, “It’s hard to say that I’m thankful for it all, but I am because I wouldn’t be the person that I am today without all of these things that have happened.”\nHanna Cavinder Says Carson Beck ‘Had an Ego’\nHanna spoke out after their breakup, insisting it wasn’t a result of the cheating rumors, but about how Beck behaved when they were together.\n“He has an ego,” she told Fox News at the time. “He wanted people to stop and take a picture. He would, like, flip off people at the bar, and I’d be embarrassed.”\n“So I broke up with him, and all this cheating s*** came out. I had no idea,” she added. “I didn’t break up with him because he cheated. I broke up with him because of who he was.”\nCarson Beck Is a Potential 1st-Round NFL Draft Pick\nBeck’s draft projections have fluctuated in recent months, but he stands a decent chance of going in the first round of April’s NFL Draft.\nConsidered a Round 1-caliber player at this time last year before falling off, Beck has played cleanly this season following a transfer from Georgia,” ESPN’s Matt Miller wrote in a story published December 7. “In a draft class without an established QB1, Beck has room to rise into the Round 1 picture.”\nIf that happens, Beck will make plenty on his rookie contract. The 32nd overall pick — the last in the first round — will sign a four-year deal worth more than $16.2 million.\nHe Is Reportedly Making Millions in Name, Image and Likeness Deals\nBeck is doing fine for himself already, thanks to the slew of name, image and likeness deals he has agreed to since he has been in college. While his exact earnings are not publicly disclosed, it was reported that Miami was able to land his services thanks to an NIL package worth more than $3 million, according to On3.\nThe quarterback has signed sponsorship deals with brands such as Chipotle, EA Sports, Powerade, Beats by Dre and more.\nBeck drew criticism in 2024 for purchasing a Lamborghini worth a reported $270,000, which some believe showed how much modern college athletics was driven by money. That Lamborghini and a luxury car belonging to Hanna were stolen from the couple during a home burglary in February 2025.",
  "word_count": 1029,
  "scraped_at": "2026-02-14T13:24:18.365733"
}