{
  "article_id": "17ac89fd78db",
  "url": "https://www.leighjournal.co.uk/news/national/24921919.seal-actual-seal-david-beckham-lead-super-bowl-ads/",
  "title": "Seal as an actual seal and David Beckham lead Super Bowl ads",
  "date": "20250210T063000Z",
  "domain": "leighjournal.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Laughter dominated the commercials as the Philadelphia Eagles dominated the Kansas City Chiefs during this year’s Super Bowl.\nBritish singer Seal became an actual seal, sad that he could not hold Mountain Dew with his flippers, while David Beckham and actor Matt Damon were long-lost twins bonding over Stella Artois.\nActor Eugene Levy’s eyebrows flew off and buzzed around after he ate some Little Caesars.\nFour old ladies went on a joy ride in a commercial for WeatherTech, while sloths had a case of the Mondays in an ad for Coors Light.\nTim Calkins, a professor of marketing at Northwestern University’s Kellogg School of Management, said this was a complicated Super Bowl for advertisers.\nMost ads were in development during last fall’s US presidential election race, so avoiding controversy was even more of a priority than usual, he said. The finalised crop of commercials features a lot of simple humour, nostalgia and few creative risks, he said. But even that approach can backfire.\n“That’s the challenge this year. Everybody wants to be safe, but you also want to be interesting,” Professor Calkins said. “Safe advertising isn’t the advertising you notice or remember.”\nAnd advertisers can’t afford not to be noticed. Some of the roughly 80 Super Bowl ads spots cost a record $8 million for 30 seconds this year.\nBudweiser brought back its Clydesdales for its Super Bowl ad, including a foal that wants to join the delivery team.\nMeg Ryan and Billy Crystal reenacted their famous deli scene from 1989’s When Harry Met Sally, except this time Sally was expressing her enthusiasm for Hellmann’s mayonnaise.\nThe Muppets searched for accommodations with Booking.com, while an Instacart ad featured a parade of familiar mascots like Mr Clean, the Jolly Green Giant and the Pillsbury Doughboy.\nDisney asked what the world would be like without the iconic characters it owns, including Elsa from Frozen, Bart Simpson and Marvel superheroes.\nAdvertisers are leaning on nostalgia more than they used to in Super Bowl ads, according to Kimberly Whitler, a marketing professor at the University of Virginia’s Darden School of Business.\nNods to the past can broaden the appeal of an ad to different generations and connect products to positive cultural moments, she said.\nPutting celebrities together in unexpected combinations can also broaden the appeal of a commercial. In their Super Bowl ad for Michelob Ultra, actors Catherine O’Hara and Willem Dafoe are pickleball champs.\nCelebrity chef Gordon Ramsay and comedian Pete Davidson teamed up for a HexClad commercial, while Post Malone, Shane Gillis and Peyton Manning had a block party with Bud Light.\nA slew of celebrities, including Matthew McConaughey, Martha Stewart, Greta Gerwig and Charlie XCX, appeared in an ad for Uber Eats.\nLinli Xu, an associate professor of marketing at the University of Minnesota’s Carlson School of Management, said celebrity endorsements can get people talking.\nBut with dozens of brands using them, there’s a risk of diminishing returns.\nCelebrities can also get so much attention that viewers don’t remember which brand they’re advertising, Xu said.\n“There is a balancing act in terms of having celebrities in the ads,” she said.\nCharles Taylor, a marketing professor at Villanova University’s School of Business, noticed more gross-out humour than usual.\nIn a commercial for Dunkin’, actor Jeremy Strong emerged from a can of coffee covered in grounds and brown liquid.\nA man’s tongue started dancing to celebrate cold foam from Nestle Coffee-Mate.\nAnd in a star-studded ad for Pringles, Chiefs head coach Andy Reid, basketball star James Harden and actor Nick Offerman all watched their iconic moustaches jump off their faces and soar through the sky to help deliver cans of the chips.\nBut it was not all fun and games at the Super Bowl this year. Pharmaceutical company Novartis urged women to get early detection for breast cancer, while Pfizer promoted its own efforts to cure cancer.\nDove warned that half of girls who quit sports have been criticised for their body type. Hims & Hers, a telehealth company, talked about America’s obesity epidemic.\nSeveral Super Bowl ads also made the case for AI as a helpmate.\nChris Pratt, Chris Hemsworth and Kris Jenner teamed up for an ad wearing Meta’s smart glasses, which use artificial intelligence to answer questions about what wearers are seeing.\nActor Walton Goggins pitched GoDaddy Airo, which uses AI to help build websites and social content. Google’s 50 States, 50 Stories campaign is showing viewers a small business from their state that’s using Google’s Gemini AI assistant.\nBut Cirkul, a water bottle brand, poked fun at AI, showing comedian Adam Devine accidentally ordering 100,000 bottles using the AI assistant on his phone.",
  "word_count": 774,
  "scraped_at": "2026-02-14T13:41:54.108629"
}