{
  "article_id": "17b4a07553b9",
  "url": "https://www.90min.com/posts/man-utd-considering-nine-managers-replace-erik-ten-hag",
  "title": "Man Utd considering nine managers to replace Erik ten Hag",
  "date": "20240324T151500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Man Utd considering nine managers to replace Erik ten Hag - report\n- Man Utd continue to weigh up future of manager Erik ten Hag\n- Dutchman has a contract until 2025 but not assured of anything\n- Zinedine Zidane, Graham Potter & Roberto De Zerbi considered\nBy 90min\nManchester United are reported to have as many as nine names on a managerial shortlist as they weigh up the future of current boss Erik ten Hag beyond this season.\nTen Hag still has another season left on the three-year contract he signed in 2022 upon joining from Ajax, but mixed results and the potential for a fresh start following the arrival of Sir Jim Ratcliffe as co-owner and a new sporting direction has brought uncertainty to the Dutchman's position.\nUnited have struggled to kick on since Ten Hag's promising first season in charge, losing 11 of their 28 Premier League fixtures in 2023/24 and trailing the top four by nine points – albeit with a game in hand on fourth place Aston Villa. They are at least expected to return to the FA Cup final for the second year in a row after being draw with second tier Coventry City in the semi-finals.\nDespite the disappointments of the last few months, ESPN writes that Ten Hag is optimistic there is still time to sufficiently impress Ratcliffe and the new hierarchy, which includes INEOS director of sport Sir Dave Brailsford and soon Omar Berrada as incoming chief executive.\nBut with an audit of United's football operations ongoing, there are \"no formal guarantees\" of Ten Hag keeping his job beyond this season as Ratcliffe and co. assess all the options. The former Ajax boss is said to have been part of the summer transfer window planning, but Brailsford has continued to also monitor alternative candidates to take over next season in case there is to be a change.\nLinks with Gareth Southgate have been well publicised this month, with Graham Potter, Roberto De Zerbi, Thomas Frank, Thomas Tuchel, Julen Lopetegui, Zinedine Zidane, Ruben Amorim and Julian Nagelsmann all now reported by ESPN to have been \"discussed internally\" on top of the England boss. Potter, Tuchel, Lopetegui and Zidane are all either currently or soon to be out of work.\nTen Hag's shorter-term future has at least been considered safe under the new regime.\nUnited's women's team face similar managerial uncertainty, with incumbent boss Marc Skinner out of contract in just three months' time and the team failing to match last season's achievements after slipping well out of contention in the WSL title race and hunt for Champions League places.",
  "word_count": 437,
  "scraped_at": "2026-02-14T13:10:57.370888"
}