{
  "article_id": "17b5f80875ec",
  "url": "https://greatbendpost.com/posts/dd6aede3-433f-4209-9394-e2b1f981bf31",
  "title": "Thursday Sports Headlines and Scores presented by Barton Community College",
  "date": "20240523T124500Z",
  "domain": "greatbendpost.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "KANSAS CITY, Mo. (AP) — Cole Ragans allowed one hit in six innings and Freddy Fermin drove in three runs as the Kansas City Royals beat the Detroit Tigers 8-3 for a series sweep. Ragans struck out a career-best 12 while holding the Tigers hitless until Riley Greene’s two-out single in the sixth. Tarik Skubal threw five innings, allowing four runs on six hits with two walks and six strikeouts. The loss snapped Skubal’s 14-game unbeaten streak dating to Aug. 29 last year. The Royals have won six straight. The Tigers have lost four straight.\nST. LOUIS (AP) — Brendan Donovan doubled home two runs and scored the go-ahead run on a throwing error, lifting the St. Louis Cardinals to a 5-4 win over the Baltimore Orioles to complete a three-game sweep. The Orioles had gone 106 consecutive regular-season series without being swept, a span of more than two years. Earlier Wednesday, the Cardinals beat the Orioles 3-1 in the completion of a game that began Tuesday night and was suspended because of rain. Nolan Gorman homered and drove in all three runs for the Cardinals in that game, and Lance Lynn got the win by allowing one run in six innings Tuesday night.\nARLINGTON, Texas (AP) — Owen Boerema pitched a seven-hitter for the first nine-inning complete game of his career and No. 6 seed Kansas State beat fourth-seeded West Virginia 8-4 in the Big 12 Tournament. Kansas State (32-23) advances to play in another elimination game on Thursday. West Virginia (33-33), which was eliminated, dropped to 0 for 6 over the last three seasons in the tournament. West Virginia put three runs on the board in the first inning, highlighted by Brodie Kresser’s two-run single. But Boerema settled down and only allowing four hits after the first. He finished with 10 strikeouts. The game turned in the fourth when Kansas State scored seven runs on only four hits. Kansas State had 13 batters come to the plate in the inning, six leading to a walk.\nARLINGTON, Texas (AP) — Carson Benge pitched effectively into the seventh inning with 10 strikeouts and had three hits to lead second-seeded Oklahoma State to a 7-2 win over 10th-seeded Texas Tech in the Big 12 Conference Tournament. The Cowboys were up 4-0 and Benge had allowed just two hits before Gavin Kash followed a one-out error with a home run to right field. Benge moved to designated hitter after that. Oklahoma State (37-16) plays eighth-seeded UCF on Thursday while the Red Raiders (31-25) face fifth-seeded Cincinnati in an elimination game. Benge doubled ahead of Zach Ehrhard’s home run in the first inning. Benge led off the bottom of the fifth with a single and came around to score on a bases loaded walk. He added a single in the sixth inning.\nARLINGTON, Texas (AP) — Landyn Vidourek hit the go-ahead single in the sixth inning and Kerrington Cross added a big three-run home run, leading Cincinnati to an 8-7 victory over Texas in a loser-out game at the Big 12 Tournament. Vidourek, Cincinnati’s No. 9 hitter, gave the Bearcats a 4-3 lead in the sixth when he drove in two unearned runs with a two-out single. He came to the plate with two on in the eighth inning but struck out. It proved to be no problem as Cross homered to left field, driving in three runs for a 7-3 lead. Cincinnati made it a four-run inning when Josh Kross scored on an error. Texas scored four in the eighth inning and had the tying run on second base in the ninth, but Chase Horst got out of the jam.\nARLINGTON, Texas (AP) — Oklahoma ace Braden Davis threw his first complete-game shutout in the Big 12 Tournament and the top-seeded Sooners beat No. 9 seed TCU 4-0 on Wednesday. Davis joins Jon Gray (2013) as the only Sooners to throw a complete-game shutout in the tournament. There have only been seven overall in tournament history, with the last coming in 2015. Davis allowed only four hits with nine strikeouts on a career-high 120 pitches to outduel Payton Tolle, the Big 12 pitcher of the year. It was Oklahoma’s first complete-game shutout since Braden Carmichael blanked Oklahoma State last season. Oklahoma (35-18) advances to the winner’s bracket to play Kansas on Thursday for their first matchup of the season.\nUNDATED (AP) — Oklahoma will need to get through a familiar opponent to earn a shot at a record fourth straight national softball title. The second-seeded Sooners will host Florida State in a best-of-three super regional series. Oklahoma beat Florida State in the national championship series last year and in 2021. Florida State has its own championship history, winning the national title in 2018 and playing in three of the last five championship series. Super regional play starts this week, with winners advancing to the Women's College World Series.\nMINNEAPOLIS (AP) — Luka Doncic had 15 of his 33 points in the fourth quarter to lift the Dallas Mavericks to a 108-105 victory over the Minnesota Timberwolves in Game 1 of the Western Conference finals. Kyrie Irving scored 24 of his 30 points in the first half for the Mavericks. They trailed 102-98 after a 3-pointer by Anthony Edwards with 3:37 left before an 8-0 run the Wolves didn’t stop until a tip-in with 10.5 seconds to go. Jaden McDaniels had 24 points for the Wolves. Edwards was stifled for 19 points in a team effort from the Mavericks.\nNEW YORK (AP) — Sergei Bobrovsky stopped 23 shots for his first shutout of the postseason, Matthew Tkachuk had a goal and an assist and the Florida Panthers beat the New York Rangers 3-0 on Wednesday night in Game 1 of the Eastern Conference final. Carter Verhaeghe and Sam Bennett also scored. Bobrovsky, who had six shutouts during the regular season, had the second of his career in the playoffs. Igor Shesterkin finished with 24 saves for Presidents’ Trophy-winning Rangers. They lost for the third time in four games after opening the postseason with seven straight victories. Game 2 is Friday night in New York.\nNASHVILLE, Tenn. (AP) — Patrick Mahomes said Wednesday that while he doesn’t agree with all the beliefs espoused by kicker Harrison Butker during a recent commencement address, the Chiefs quarterback respects his teammate’s right to make them be known. Butker delivered what has become a polarizing speech May 11 at Benedictine College in Atchison, Kansas, where the three-time Super Bowl champion said most women receiving degrees were probably more excited about getting married and having children, and that some Catholic leaders were “pushing dangerous gender ideologies onto the youth of America.” Earlier in the day, NFL Commissioner Roger Goodell declined to expand on the NFL’s statement distancing the league from Butker's comments.\nUNDATED (AP) — The NCAA is moving toward a $2.8 billion settlement that could resolve three antitrust lawsuits, but whether a fourth is also part of the agreement remains uncertain. Attorneys in Fontenot v. the NCAA say they would like their case to stay where it is in Colorado and not be moved to a California court. The NCAA and five major college conferences asked a Colorado judge to combine the Fontenot case with another being heard in the Northern District of California. Meanwhile, the Big Ten became the latest conference to approve the proposed settlement of the House case and the NCAA Board of Governors signed off on the proposal, too.\nUNDATED (AP) — TNT Sports will begin airing College Football Playoff games this upcoming season through a sublicense with ESPN. The five-year agreement announced Wednesday gives TNT two first-round games the first two years. Beginning in 2026, it expands to two first-round and two quarterfinals. ESPN’s $7.8 billion deal with the College Football Playoff, which was announced in March, allowed it to sublicense games to other networks. This will be the first season of the 12-team playoff. ESPN has carried the College Football Playoff since it started in the 2014 season. It replaced the Bowl Championship Series.\nDENVER (AP) — Peyton Manning says he has no desire to leave broadcasting with brother Eli and head to the executive suite of an NFL franchise. Manning says he gets his football fix doing the ManningCast broadcast of “Monday Night Football” games with his brother. Manning received an award Wednesday night honoring his work in the Denver community. Ahead of the event, he was asked if he would ever want to get into NFL ownership and he said he'd rather stick with his livecast with Eli that won its second Sports Emmy award this week\nWEDNESDAY SCORES\nMAJOR LEAGUE BASEBALL\nINTERLEAGUE\nFinal St. Louis 3 Baltimore 1\nFinal Minnesota 3 Washington 2\nFinal Cleveland 6 N.Y. Mets 3\nFinal St. Louis 5 Baltimore 4\nFinal Philadelphia 11 Texas 4\nFinal Colorado 4 Oakland 3\nAMERICAN LEAGUE\nFinal L.A. Angels 2 Houston 1\nFinal Kansas City 8 Detroit 3\nFinal Boston 8 Tampa Bay 5\nFinal N.Y. Yankees 7 Seattle 3\nFinal Toronto 9 Chicago White Sox 2\nNATIONAL LEAGUE\nFinal Miami 1 Milwaukee 0\nFinal San Diego 7 Cincinnati 3\nFinal Atlanta 9 Chicago Cubs 2\nFinal San Francisco 9 Pittsburgh 5\nFinal Arizona 6 L.A. Dodgers 0\nNATIONAL BASKETBALL ASSOCIATION PLAYOFFS\nFinal Dallas 108 Minnesota 105\nNATIONAL HOCKEY LEAGUE PLAYOFFS",
  "word_count": 1553,
  "scraped_at": "2026-02-14T12:41:44.531412"
}