{
  "article_id": "17c2f3b15289",
  "url": "https://www.nytimes.com/athletic/6015917/2024/12/26/favorite-trading-cards-2024/",
  "title": "Our favorite trading card buys of 2024 : Jackie Robinson , Caitlin Clark , Patrick Mahomes and more",
  "date": "20241226T114500Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "As 2024 winds down, it’s a great time to look back on what the last year has meant to your personal collecting journey. Some of The Athletic’s writers and editors have been doing just that, so here are our top five personal favorite pickups from ‘24.\nMichael Salfino\nJerry West 1961 Fleer SGC 4.5\nThe market for top vintage basketball cards has collapsed but you buy when there’s blood in the streets. I’m not a market timer. This isn’t modern collecting. “The Logo” was purchased at about 50 percent of peak value.\nRoberto Clemente/Hank Aaron/Willie Mays 1966 Topps Batting Leaders (raw)\nThe most undervalued card in vintage baseball given who is on it. After getting a 6.5, I saw one at a local show and offered $100. I think it’s a $300 card. I will always be a repeat buyer.\n1973 Topps ’53 Reprint Jackie Robinson PSA 5\nNever saw this card before finding it at a table at Fanatics Fest in New York. I had no idea how to price it. Purchased for $350. Just 300 were issued at a company banquet; 48 are graded. This presents as near mint.\n1972 Topps Roger Staubach SGC 7.5\nMaybe the toughest big-time card to find with a centered image in the vintage football hobby. I feel this card is better looking than at least 50 percent of PSA 8s. I have personally seen less than five that look this good.\n1954 Bowman Ted Williams SGC 2.5\nJust a dream card for me. I’ve been super picky about buying one for eight years. Virtually impossible to find centered. Famously rare given litigation at the time between Bowman and Topps, with Bowman forced to pull their Williamses.\nAdvertisement\nSteph Yang\nPokemon Violet EX Slowpoke 082/078 Holo Korean\nThis is a humble $1 card from a TCG card show that I randomly found as I was searching for something else to complete my Pokemon 151 collection. It’s cute and it’s in Korean, which I obviously connect with. Not every card needs to be a PSA 10 chase card and this one was a great reminder that sometimes you can just buy something fun because you like it.\nPokemon Sword & Shield Starter Set VMAX Charizard Japanese Edition\nI’m a simple woman. I see Charizard, I buy Charizard. I don’t know if I’ll ever try to sell this set, but I’m keeping it sealed since there’s not really a big chase card in here, and also the packaging is fantastic.\nCroix Bethune 2024 Parkside rookie auto\nI chased this card in packs for a while until I just gave in and bought what I wanted. This is another one that I don’t know if I’ll ever flip since I like Bethune as a player so much, but I have a sneaking suspicion it might appreciate in value eventually.\nIchiro Suzuki 1994 Takara Blue Wave PSA 9\nI don’t collect a lot of men’s sports cards but when I do I collect my favorite baseball player, Ichiro Suzuki (honorable mention: 2023 Topps Now Shohei Ohtani/Decoy Most Valuable Puppy card). This isn’t quite a rookie card, but I found it for a great price on eBay, and I don’t care about a 10 grade since it’s for my personal collection.\nParkside “Thank You, Sinc” farewell game pack\nParkside only made 190 of these packs for Christine Sinclair’s final regular season NWSL game in Portland, one pack for each of her record 190 international goals. They were sold exclusively in the stadium and I was lucky enough to get two packs — one I opened and sent the included autographed card to get graded, and the other I will keep sealed and close to my heart forever.\nAdvertisement\nLarry Holder\nPatrick Mahomes 2018 Panini Impeccable Indelible Ink Gold 9/10\nAll I kept hearing through my computer was “Larry Holder! Larry Holder!” I ran back to my laptop to learn I’d won easily the biggest hit of my first year back in the hobby after a 30-plus year absence. I landed this by winning a duck race among 80 ducks from Markman Breakers. I submitted the card to SGC and certainly wasn’t upset with the result given the difficulty of landing a gem mint 10 on such a thick card.\nRonald Acuna 2023 Topps Definitive Framed Auto 1/1\nI bought into a Definitive break for two reasons: I liked the price with the lengthy Braves checklist and Scotty from WeTheHobby brought so much energy that I couldn’t help myself. All the factors paid off when snagging this one-of-one Acuna autograph, especially since this occurred long before Acuna’s season-ending injury. (I also sold the card before the injury, too.)\nAnthony Edwards 2020 Panini Prizm Silver PSA 10\nNothing like going back to a stream you regularly watch and they start congratulating you as soon as your name pops up. I found out the day after a duck race that I landed a jewel card of one of the hottest names in the NBA hobby scene. This occurred after his market exploded during last season’s NBA playoffs, but that helped establish the prominence of this card moving forward.\nMike Trout 2024 Topps Sterling Connection Blue Auto 2/10\nA mystery repack caught my eye from Casa Breaks. And even though I paid a premium for the very slick card, I thought it was well worth the price. Then Trout goes down with another injury. Because of that, I figured why not send it in to PSA for grading, even though the chances of a 10 on Sterling cards are very tough given the intricacies of the series’ cards. So I was thrilled to snag a perfect grade on a cool card.\nChet Holmgren 2022-23 Flawless Distinguished Auto 6/25\nMore wheel spin madness for me to land quite the card. I won this one not long after the release of the coveted product, which helped because the Oklahoma City Thunder were surging on their way to the NBA playoffs. Being new back to the hobby, I didn’t realize the gravity of the hit when first presented with the card.\nAdvertisement\nCraig Custance\n2024 Allen and Ginter Hobby Box\nThis is the most fun I’ve ever had opening anything. My brother and I each got a box and he pulled a Usain Bolt autograph, which only raised my anticipation as I opened my packs. When I got to my auto, it turned out to be a graphic designer. What are you going to do? I also got a sausage card, a bunch of show dogs and the X-ray of a turtle. I could open these packs all day.\nGO DEEPER\nOur favorite cards in 2024 Allen & Ginter, including the first Westminster Dog Show cards\nCaitlin Clark 2022 Bowman University (1st) pink refractor\nI bought this in the spring during March Madness, fully prepared to be paying at the peak because everyone in the country was captivated by her at the moment. Turns out, that captivation is going to last a very long time.\nVictor Wembanyama 2023 Prizm PSA 10\nLook, had I known that the population count for PSA 10s of this card is somewhere in the millions or whatever (Ed. note: It’s up to 24,120 PSA 10s, according to GemRate.com, so it might as well be millions), I might not have been eager to shell out $120. But I found it at a local card show, and it was a father and his teenaged son behind the table. They told me how opening packs bonded them and how much they enjoyed doing local card shows together. Was I getting worked over? Maybe, but I love thinking of them when I’m flipping through cards and find this one.\nMax Clark 2023 Bowman Draft (1st) Chrome PSA 10\nI grew up a diehard Detroit sports fan and have a soft spot for the Tigers. It’s becoming apparent my investments in Spencer Torkelson and Casey Mize aren’t going to pay off, so I wanted a piece of the new generation. Did I grill Keith Law on Max Clark when I ran into him at the Winter Meetings in Dallas to make me feel better about this purchase? You bet I did.\nWilliam Heins 1910 Mecca Cigarettes T218 SGC 1.5\nI love vintage cards. I also have three kids to put through college so my dreams of investing in tobacco cards are on hold. In the meantime, when I spot these old cards in any sport at a price point I can afford, I grab them just for the history. William Heins was a bowler. He was born in Germany in 1890 and moved to the U.S. as a kid. He started bowling in 1896 and “later joined the crack Empire team and helped win many a championship.” When this card was printed, he was a manager at Albion Alleys in New York. How would I know any of this if this card didn’t exist? What ever happened to William Heins? What about Albion Alleys? Why was he bowling in suspenders and a tie? I love this stuff.\nAnnemarie Farrell\n2024 was a game-changer for women’s sports and as a lifelong fan and collector, it’s been a thrill to watch the momentum grow. No surprise then, I’ve been busy making sure my collection of women’s sports cards keeps up. Each one of the following cards represents a personal collecting achievement and athletes who helped shape the future of women’s sports. All rare finds of trailblazing icons and current stars, these cards tell a story of progress and resilience. And because this year has been so epic, I’m sneaking in a bonus sixth pick!\nBabe Didrickson Zaharias 1955 All American Sports Club (Hand Cut)\nReleased as a series of 9×12 uncut sheets, the 1955 All American Sports Club set featured 500 multi-sport athletes. While this isn’t her first card, this hand-cut card of the Associated Press Female Athlete of the 20th Century is among her rarest. It is the only card released during her lifetime that features her playing golf.\nAdvertisement\nKatie Smith 1999 WNBA Fleer Ultra /50\nSome cards are just worth the wait. As an avid Katie Smith fan, one giant hole in my collection was her 1999 platinum rookie card, numbed only to 50. The wait ended in August 2024 when I was finally able to add this to my well-established Smith card archive.\nCammi Granato 2004-05 Upper Deck Young Guns High Gloss /5\nUpper Deck Young Guns hockey cards are some of the most sought-after rookie inserts, and since 1990, over 1,000 NHL players have been featured — yet only once has a female player appeared: Cammi Granato. Her inclusion in 1994 was historic, and the rarest version of this card is the high gloss parallel, numbered to just five. This year, I finally tracked it down, completing a major milestone in my collection.\nDiana Taurasi 2011 Topps Allen & Ginter Logo Relic\nThe 2011 Allen & Ginter set featured basketball legend Diana Taurasi, and when I spotted this card at The National, I knew I couldn’t leave Chicago without it. This card stands out not only for Taurasi’s legendary status but because it includes a piece of the WNBA logo patch, making it an incredibly rare find.\nKatie Ledecky 2024 Topps Olympics Chrome Dynasty Patch Auto /5\nImagine the perfect recipe for an iconic card. Start with the greatest female swimmer of all time. Then, mix in her first mainstream autograph release and the elegance of the Topps Dynasty design. Add a multicolor, player-worn patch to compliment her on-card signature. The result? A rookie card with all the elements that make it a true standout.\nFour iconic American players, each with a transformative role in the evolution of women’s soccer. I love any card that can blend the past, present and future of sport — highlighting athletes that shape women’s sport across generations. Leaf truly scored with this one, capturing some of the most important female soccer players in one unique card.\nBrooks Peck\nJackie Robinson 1955 Topps PSA 3\nI started to get more into vintage baseball this year and this was one of the cards I knew I wanted to start with. For me, the ‘55 Topps set is a distillation of the beauty of baseball cards from that decade and Jackie Robinson is, well, Jackie Robinson. After a long search for the right example of this card, I missed out on a great looking PSA 4 at The National, but then I finally found a well-centered PSA 3 on eBay last month and had to snag it. What a card!\nAndrew McCutchen 2020 Topps “Uncle Larry” short print PSA 9\nOne of my favorite cards in my Philadelphia Phillies collection and, for my money, one of the greatest sports card images of all time.\nA’ja Wilson 2020 Panini WNBA Prizm Silver Prizm PSA 9\nWhile Caitlin Clark cards continue to rapidly rise in value, there are still some great deals to be had on other WNBA stars, including the now three-time MVP. 2020 was the first year for WNBA Prizm and there are only 17 PSA 9s (with no PSA 10s!) for Wilson’s Silver Prizm. I grabbed this in late September for just $33.\nYogi Berra 1960 Topps PSA 6\nWhile 1960 Topps has a really fun design, I have to admit that I only bought this card because I think Berra looked strikingly similar to my grandfather in this image. But when I showed it to my mom, she said she didn’t see it. Oh well.\nShohei Ohtani 2023 Topps Finest 2000 World’s Finest PSA 10\nAgain, this isn’t a super valuable card — it’s just a World Baseball Classic insert from Topps Finest — but I think it looks awesome with Ohtani in his Japan uniform and the flag-themed background. Plus combining Ohtani with the words “World’s Finest” is particularly fitting.\nCheck out our full sports memorabilia and collectibles coverage here.\nThe Athletic maintains full editorial independence in all our coverage. When you click or make purchases through our links, we may earn a commission.\n(Top photo: Craig Custance)",
  "word_count": 2352,
  "scraped_at": "2026-02-14T13:31:16.081413"
}