{
  "article_id": "17c8dd0a0c48",
  "url": "https://en.acnnewswire.com/press-release/english/103995/fujitsu-launches-",
  "title": "",
  "date": "20251201T160000Z",
  "domain": "en.acnnewswire.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Source: Fujitsu Ltd\nKAWASAKI, Japan, Dec 1, 2025 - (JCN Newswire) - Fujitsu today announced the launch of \"Fujitsu Accelerator Program for SPORTS,\" a global partner co-creation program aimed at fostering new innovation in the sports sector.\nThrough Fujitsu Accelerator, Fujitsu collaborates with startups and other companies to create new businesses and solve challenges by leveraging cutting-edge technologies such as AI and quantum computing. This new program seeks to expand the value and monetization potential of corporate sports. It will achieve this by combining the strengths of Fujitsu's sports teams and athletes—including its American football, women's basketball, and track and field teams—and facilities, with the innovative technologies and ideas of partner companies. Through co-creation, the program aims to generate new value in sports and related fields such as entertainment, tourism, and merchandise and build a corporate sports ecosystem.\nFujitsu will begin recruiting new partners who want to engage in new business creation from December 1. Selected companies will be determined after a pitch event scheduled for February 2026. Proof of Concept (PoC) initiatives are planned to commence from fiscal year 2026.\nThrough various collaborations facilitated by this program, Fujitsu will continue to promote \"improving people's well-being,\" one of the indispensable contribution areas of its materiality. In addition to promoting sports through its long-standing support for various teams and athletes, Fujitsu will further accelerate collaboration with local communities and encourage employee engagement.\nApplication Themes\n1. Athlete and Team Enhancement\n- Measures to improve athlete performance and results (e.g., training support, mental health support, etc.)\n- Data analysis and collection for team sports\n2. Well-Being\n- Health promotion initiatives targeting a wide range of people, from athletes to general participants and local residents\n- Efforts to improve exercise habits and encouragement to start an exercise regimen\n3. Fan Engagement Enhancement\n- Measures to enhance the appeal of corporate sports teams and athletes, and to attract fans\n- Merchandise sales utilizing team IP, improved viewing experiences, and digital fan-participation projects\n4. Regional Revitalization\n- Revitalization of areas around home arenas and grounds. Business planning in collaboration with local communities (local governments, educational institutions, shopping districts, etc.)\n- Tourism planning, especially initiatives linked to the Kawasaki area\n5. Social Inclusion\n- Access to sports for all demographics (para-sports, adaptive sports), sports experiences for elementary and junior high school students, and club activity support\n6. Operations and Business Foundation\n- Sports management platforms, corporate sports revenue models, event management, sponsor visibility, DX planning for venues, and athlete second career support\nFujitsu's Sports Teams\nFujitsu manages many sports teams including its American football team \"Fujitsu Frontiers,\" the women's basketball team \"Fujitsu Red Wave,\" and the track and field team. These teams have produced top athletes who aim for national and world championships. Athletes work as full-time employees of Fujitsu while engaging in their athletic activities, embodying the company's values and social mission through sports.\n1. Fujitsu Frontiers (American Football Team):\nEight-time X-League champions, aiming for an unprecedented ninth title.\n2. Fujitsu Red Wave (Women's Basketball Team):\nAchieved their second W-League championship in 16 years in 2023. A top team that values player autonomy.\n3. Track and Field Team:\nA top-level team that has produced world, Asian, and Japanese record holders. Athletes excel in a wide range of events, including race walking, marathon, and sprints.\n4. Other Sports Teams:\nIn addition to the above, Fujitsu also has various other sports teams, including in women’s cheerleading, men's basketball and volleyball, 9-man volleyball, swimming, horseback riding, and golf.\nUpcoming Schedule (Tentative):\n- February 6, 2026: Application deadline\n- February 26, 2026: Pitch event\n- March 2026: Selection of adopted companies\n- April 2026: Start of PoCs\nCompanies selected to participate in this program will be provided with opportunities to interview and survey athletes and staff belonging to Fujitsu's sports teams. Fujitsu will offer its training facilities for the PoCs, support the development of use cases, and promote and sell co-created services through the Fujitsu Group.\nFujitsu’s Commitment to the Sustainable Development Goals (SDGs)\nThe Sustainable Development Goals (SDGs) adopted by the United Nations in 2015 represent a set of common goals to be achieved worldwide by 2030.\nFujitsu’s purpose - \"to make the world more sustainable by building trust in society through innovation\" - is a promise to contribute to the vision of a better future empowered by the SDGs.\nAbout Fujitsu\nFujitsu’s purpose is to make the world more sustainable by building trust in society through innovation. As the digital transformation partner of choice for customers around the globe, our 113,000 employees work to resolve some of the greatest challenges facing humanity. Our range of services and solutions draw on five key technologies: AI, Computing, Networks, Data & Security, and Converging Technologies, which we bring together to deliver sustainability transformation. Fujitsu Limited (TSE:6702) reported consolidated revenues of 3.6 trillion yen (US$23 billion) for the fiscal year ended March 31, 2025 and remains the top digital services company in Japan by market share. Find out more: global.fujitsu\nPress Contacts\nFujitsu Limited\nPublic and Investor Relations Division\nInquiries\nTopic: Press release summary\nSource: Fujitsu Ltd\nSectors: Artificial Intel [AI], Sports\nhttp://www.acnnewswire.com\nFrom the Asia Corporate News Network\nCopyright © 2026 ACN Newswire. All rights reserved. A division of Asia Corporate News Network.\nhttp://www.fujitsu.com\nhttps://plus.google.com/+Fujitsu\nhttps://www.facebook.com/FujitsuJapan\nhttps://twitter.com/Fujitsu_Global\nhttps://www.youtube.com/user/FujitsuOfficial\nhttps://www.linkedin.com/company/fujitsu/\nConnect With us:",
  "word_count": 881,
  "scraped_at": "2026-02-14T12:50:48.882316"
}