{
  "article_id": "18014792486c",
  "url": "https://bernews.com/2026/02/concacaf-holds-41st-ordinary-congress/",
  "title": "Concacaf Holds 41st Ordinary Congress",
  "date": "20260202T113000Z",
  "domain": "bernews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Concacaf Holds 41st Ordinary Congress\nConcacaf convened its 41st Ordinary Congress in Managua, Nicaragua, bringing together invited guests, Concacaf senior leadership, and Presidents and delegates from the Confederation’s 41 Member Associations for a milestone gathering that also marks 10 years of leadership under Concacaf President and FIFA Vice President Victor Montagliani.\nA spokesperson said, “Concacaf President and FIFA Vice President Victor Montagliani presided over the Congress, alongside Concacaf General Secretary Philippe Moggio and members of the Concacaf Council.\n“As part of the opening program, President Montagliani expressed his sincere appreciation to President Manuel Quintanilla and the Nicaraguan Football Federation, as well as to local government authorities, for hosting the event and for their invaluable support in making the Congress in Managua a truly memorable gathering.\n“In his address, Montagliani recognized the collective work of Member Associations and reflected on a decade of progress across Concacaf, while reinforcing the Confederation’s continued focus on elevating football throughout the region.\n“He also highlighted the historic opportunity ahead as the region prepares to welcome the world for the FIFA World Cup 2026, congratulating the six qualified teams and extending his best wishes for Jamaica and Suriname as they compete in the FIFA Play-Off Tournament in March.”\n“Over the past decade, we rebuilt Concacaf on stable foundations,” emphasized Montagliani. “So today we have earned the right to think long term, invest with confidence, and aim higher than ever. As we step toward 2026, this is a moment to be proud, moment to enjoy and a moment to break through ceilings. Our continued success will come from staying united, leading through service, and protecting the integrity that makes progress possible.”\nA spokesperson added, “During the Congress, Member Associations reviewed and approved Concacaf’s 2026 budget and carried out official statutory business, key decisions, and updates aligned with the Confederation’s priorities and ongoing work across all 41 Member Associations.\n“Concacaf Council elections were also held during the Congress, with Lyndon Cooper of St. Lucia elected Vice President [Caribbean] after running unopposed.\n“Looking ahead, Concacaf’s calendar continues to gain momentum across the region, with a full slate of national team and club competitions set to take place throughout 2026.\n“Following the conclusion of the 2026 FIFA World Cup, the Confederation will kick off a new cycle of men’s national team competitions, beginning with the fifth edition of the Concacaf Nations League, where teams will compete for promotion and a place in next year’s Finals.\n“At the club level, the Concacaf Champions Cup will kick off on Feb. 3, featuring clubs from North America, Central America, and the Caribbean competing for the region’s top honor and a place on the global stage. The Confederation’s regional club competitions, meanwhile, will once again showcase clubs from across the region as they compete for continental silverware and qualification pathways.\n“In women’s football, the 2025/26 Concacaf W Champions Cup will conclude in May with the Finals in Pachuca, Mexico, bringing together the region’s top women’s clubs to crown a continental champion. The 2026/27 edition of the tournament will then launch with its Group Stage in August.\n“Women’s national teams will also be in focus in 2026, as the 2025/26 Concacaf W Qualifiers continue across FIFA international windows and culminate with teams qualifying for the 2026 Concacaf W Championship, which will serve as Concacaf’s qualification pathway to the 2027 FIFA Women’s World Cup.\n“Youth national teams from across the region will also compete in a full slate of events in 2026. For more information on Concacaf’s competitions, please visit concacaf.com.”",
  "word_count": 585,
  "scraped_at": "2026-02-14T12:38:24.813513"
}