{
  "article_id": "1827303ec90a",
  "url": "https://www.afl.com.au/news/1459837/best-long-reads-of-2025-homework-club-brainiacs-dad-duties-and-an-unexpected-bond",
  "title": "Best long reads of 2025 : Homework club , brainiacs , dad duties and an unexpected bond",
  "date": "20251229T020000Z",
  "domain": "afl.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FROM a suburban homework club, to unlikely friendships, YouTube fishing adventures, Daicos' secret weapon, and a Roo's six-month secret - our writers covered football from every angle in 2025.\nRelive some of the best feature writing from our team of award-winning reporters as you await footy's return in 2026.\nFor two hours each Monday, this Bulldogs champion helps kids with their homework\nSOME students are aware of who he is, others don't have a clue. But they all know Tom Liberatore will be there every Monday afternoon to lead the homework club at Caroline Chisholm Catholic College in Braybrook.\nFor two hours each week, no one cares how many clearances he had on the weekend or if the Western Bulldogs won. They have no idea a significant milestone is imminent. They just want help. That's why they are there. And that's why Liberatore is back in the classroom.\nIt is also why Liberatore spent so much time inside Port Phillip Prison last year. The 33-year-old mentored inmates aged between 18 and 25 across three different six-session programs, listening, caring and sharing.\nLiberatore has been on this trajectory for years. He started an arts degree at Melbourne University after graduating high school with an ATAR score in the mid-90s. Then he studied creative writing at RMIT. But when he missed all of 2018 after tearing his anterior cruciate ligament for a second time, he helped homeless buskers develop a platform to promote their music. Social work became not just his future, but his present.\n>> Read Josh Gabelich's award-winning insight into Tom Liberatore's off-field life HERE\nWhy Paul Curtis waited six months to tell North Melbourne Kangaroos he had a child\nWHEN Paul Curtis played his 50th game last season, he had his young son Elijah in his arms to run through North Melbourne's banner at Marvel Stadium.\nWhen the Roos had their pre-season team photo day earlier this year, two-year-old Elijah was there with his dad, wearing a mini long-sleeved No.25 blue and white jumper.\nBut Curtis wasn't always as comfortable with his fatherhood mixing with his football. It was not until Elijah was nearly six months old, midway through the talented half-forward's second year at Arden Street, that Curtis was ready to tell the Kangaroos he had a son.\n\"A lot of the boys thought I was joking. I'd tell them out on the track and they'd ask me for birth certificates and photos. And even when I showed them photos, they'd still think it was my brother's kid,\" Curtis told AFL.com.au.\n\"We did a lot of setting up the camera and having the boys walk in and be like, 'Whose baby is this?'. He was months old and they were like, 'How have I not known him this long?!'\"\n>> Read more from Cal Twomey's chat with Roo Paul Curtis HERE\nThe not-so-secret weapon that makes Nick Daicos nearly unstoppable\nRECRUITERS still talk about it. They were gathered at Duncan Mackinnon Reserve athletics track in Melbourne's south-east just days before the 2021 AFL Draft.\nAfter the second-straight season cut short by COVID in Victoria, scouts were keen on getting as much insight into draft prospects as they could, so player agency Connors Sports Management organised a running session for their draft crop. Clubs could come and watch for a final piece of their recruiting puzzle.\nJosh Rachele, Jake Soligo, Connor Macdonald, Darcy Wilmot, Josh Sinn, Tyler Sonsie and Campbell Chesser were among the players there that day.\nBy then, Nick Daicos knew he was headed to Collingwood as a father-son. But, having not played since July of that year, and nursing an ankle injury through the year, he viewed the running session as a last chance to impress. He didn't – and doesn't – usually miss too many of those.\nSo he flew around the track in their 2km time trial. As other prospects wilted, the 18-year-old Daicos glided. \"It still sticks in my head,\" said one recruiter there. \"We hadn't seen him do anything like it before. Everyone was in awe of his games and class, but his running probably went under the radar until that day.\"\n>> Read more of Cal Twomey's look into what made Nick Daicos standout from the rest HERE\nHow daggy dad-turned North into footballs most unstoppable force\nAMONG the many stories you could tell about Darren Crocker and a career in the game that spans more than 30 years, there's one in particular that is retold fondly within North Melbourne's AFLW program that exemplifies what makes the Kangaroos' all-conquering women's coach, and its team, the envy of the competition.\nIt dates back to early June 2020, when he was told that his application to take the reins of North Melbourne's AFLW side was successful. In a room flanked by the club's key decision makers, an emotional Crocker responded to the news with a simple line: \"I never thought I'd coach at the highest level again.\"\nThat comment alone validated North Melbourne's bold call to move on from inaugural coach Scott Gowans and hire Crocker. Although the AFLW competition was just six seasons old at that point, its athletes entirely part-time, and the majority of its programs still learning the ropes of what sustained success actually meant, Crocker has demanded everyone within the club treat it as such – as the highest level of the game – ever since.\n\"There has not been a moment where he's thought AFLW is not the highest level,\" North Melbourne's general manager of women's football, Erin Lorenzini, tells AFL.com.au. \"It's not a step down from men's footy for him. He just knew he was coaching at the highest level. He is all-in on that.\"\n>> Read Riley Beveridge's insight into what makes Roos premiership coach Darren Crocker tick HERE\nThe moments, magic and mayhem of the greatest 48 hours in Suns history\nTWELVE hours after the greatest win in club history, Gold Coast was back on the tools preparing for its next final.\nWell, the coaches were at any rate.\nPlayers and staff filtered into the Virgin Lounge at Perth Airport at 8.30am on Sunday, bleary eyed, but full of smiles following the previous night's fairytale elimination final win over Fremantle.\nCEO Mark Evans was so wired he didn't get to sleep until 5am. Ben Long had hardly slept. Brayden Fiorini the same.\nBut with half an hour to see off before boarding the longest trip in the country back to Coolangatta on the team's charter flight, assistant coach Josh Drummond was already back at work.\nOff-field movers and shakers: The AFL players who are a marketer's dream\nTHESE ARE the players who brands flock to, the ones you see on ads, who sell the most jumpers and merchandise for their clubs and tickets for the AFL.\nThe superstars and recognisable faces who are front and centre in photo shoots, who transcend not just their own tribal supporter base but sometimes even the general football fan to be a significant name in their state and across the country.\nWith the AFL and AFL Players' Association about to finally introduce their $35 million marketing fund to pay the best AFL and AFLW players more money, AFL.com.au has ranked the 12 most marketable AFL players in the competition in order. Plus, the next tier who are right behind them.\n>> Read Cal Twomey's look into who the League's most marketable players are HERE\nThey barely knew each other, now this unlikely trio are 'lifetime friends'\nWHEN Bailey Humphrey wants his housemate to do \"extras\", that means any place, any time.\nSo, when he's woken up by the tap-tap-tap of a soft football coming from Meara Girvan's bedroom as he tries to nod off to sleep, he's not bothered. In fact, he's pleased.\n\"I said to him the other night, 'do you hear me?',\" Girvan tells AFL.com.au.\n\"He said, 'actually, I did. I was half asleep and then I heard the kicking, and I thought, 'what'? Then I realised what you were doing and I smiled and thought, 'she's doing her extras'.\"\nHumphrey helping Girvan, who is a crucial backline cog in Gold Coast's AFLW team, has been just one benefit of the household crossover between the Suns' men's and women's programs.\nTheir three-bedroom apartment at Burleigh Waters, which also has a study, doesn't stop at that pair though, with Girvan's teammate Maddy Brancatisano also part of the mix.\nIt is an unlikely trio, who initially had outsiders asking who was dating who, to one that now feels like a family, one they hope will encourage others to follow their lead.\nHold onto your hats, the Wizard's got more tricks in store\nIT WAS the middle of January when Nick Watson put Adrian Hickmott on notice. The Hawthorn livewire told his forward line coach that he was starting to get confident about going for high marks again, having put away that trick in his first year of AFL football.\n'The Wizard' turned clairvoyant: a week later, the 19-year-old took the mark of the pre-season with an outrageous one-handed grab in Hawthorn's match simulation over teammate Seamus Mitchell. Video capturing the grab from close range deep in the pocket at Waverley Park went viral as excitement levels lifted ahead of Watson's second season.\n\"I used to always fly for those marks,\" Watson told AFL.com.au. \"I did my ankle early last season and that took away my confidence in going for them but I said to Adrian the week before it that 'I'm going to start flying this year, I can feel my confidence coming back'. My leap is definitely back.\"\nWhether it is the best mark Watson has taken remains up for debate, though.\n\"That was one of my best, I reckon,\" the small forward said. \"Maybe a school footy one back in the day was better but it's definitely up there.\"\n>> Read more of Cal Twomey's feature on Nick 'Wizard' Watson HERE\nThe long road back: How Mitch Lewis defied his own doubts after 12 months out\nMITCH Lewis knew as soon as he answered the call that it was the worst-case scenario. He had barely left Epworth Eastern when he had to pull his Hilux off the Eastern Freeway. Uncontrollable tears streamed down his face. Just when he'd come to terms with his season being over, he was now facing 12 months on the sidelines.\nThis wasn't the outcome he'd envisaged with when his partner, Shelbea Murphy, drove him back up the highway from Geelong two days earlier. Hawthorn knew he had done his medial collateral ligament in his first game back in three months, but thought he had escaped a dreaded torn anterior cruciate ligament.\nClub doctor Liam West helped the key forward shuffle off the ground after he was collected by Geelong defender Jake Kolodjashnij while going back with the flight of the ball. Lewis was only concerned about his head in that moment. Blood was gushing from his scalp, courtesy of an errant elbow. Ten staples were required to patch him up. He thought he'd be right to go back on, but then he tried to change direction on the boundary. His comeback was over.\nInside the away rooms at GMHBA Stadium, Lewis started screaming, letting out the pent-up frustration of a wasted year. He hadn't played since he strained his hamstring on Easter Monday. Since then, a kneecap issue had lingered, preventing him from training, let alone playing. His return in round 17 was only his fourth game of the season, but it was supposed to provide him with enough time to regain form and fitness to salvage something from the year.\n>> Follow along with Josh Gabelich as he tracked Mitch Lewis' recovery from a torn ACL HERE\nWhich player is doing FOUR degrees? Meet the AFL's brainy bunch\nPHILOSOPHY, astrophysics, politics, agriculture and enough business and commerce degrees to make a new Big Four company.\nWelcome to the other side of your favourite AFL players.\nOver the past 10 years, there's been an increasing focus on equipping players for life outside of football, and while trades are an ever-popular option, many opt to hit the books, one subject per semester at a time.\nWhile the Players' Association does not have a complete number of players studying at university across the board, last year saw 131 men's players apply for an AFLPA education and training grant for an undergraduate degree, while a further 14 applied for a grant for a masters.\n>> Read more from Sarah Black's look into the off-field interests of AFL players HERE\nHe 'refuses to put up with rubbish', and now Sean Darcy is back on top\nCOREY Wagner likes to joke that good friend Sean Darcy wouldn't know a screwdriver from a spanner, despite his country upbringing. But that didn't stop the pair from getting on the tools as Darcy searched far and wide for solutions during a run of repeated knee and ankle injuries.\nDarcy had decided he wanted regular access to an ice bath to help the management of a troublesome left knee that had been stalling his career, so he imported materials from the United States and called in former housemate Wagner to help build it in his backyard.\nIt took a handful of visits to Bunnings for the tight-knit pair to finish the job, but it was a demonstration of Darcy's determination to take control of his career and overcome the injuries that had plagued him since an ankle operation late in 2023.\nThe past 18 months have included two knee operations and a second round of ankle surgery, with Darcy finding himself in the spotlight as his position and value to the Dockers was heavily scrutinised.\nHowever, in the second half of this season, the powerful big man has emerged as a clutch player for Fremantle and a pivotal figure leading into the club's first finals series since 2022.\n>> Read Nathan Schmook's feature on Sean Darcy's road back to the top HERE\nThis rookie sometimes swears in meetings, but nobody minds\nTOM Cochrane remembers when he didn't have the answers.\nWhen he was a kid and would make involuntary head movements from side to side but not know why. When he could feel himself trying to hold a word in but losing control, letting it out and wondering how. When the disorientation led to questions – from himself and others.\nNow, the Port Adelaide first-year player knows exactly what was – and still is – going on. But the time before the young Power forward was diagnosed with Tourette's syndrome as a nine-year-old still stays with him as he lives with the condition, all the while chasing a dream to follow his dad, former Power and North Melbourne defender Stuart, as an AFL player.\n>> Read more from Cal Twomey's chat with Tom Cochrane HERE\n'I'm proud of how I look': Lions star hits back at body shamers\nSPORT is a beautiful thing, but an undercurrent of negativity and abuse still exists, particularly for those who subvert physical stereotypes of what a female athlete should be.\nTwo-time premiership forward Dakota Davidson has, unfortunately, been a lightning rod for much of that abuse in recent years, including an incident in week 10 last season which saw a fan ejected from RSEA Park.\n\"I'm quite a vibrant and passionate football player, and I like to wear my heart on my sleeve and show my true identity on the field, and that's something I'm really proud of,\" Davidson told AFL.com.au.\n\"And obviously behind screens and behind social media, there's always the keyboard warriors that definitely don't write the nicest things. So, over the years, after every game, I caught a lot of criticism, and I caught a lot of quite terrible messages.\n\"They're quite degrading, and they definitely make you question your worth and who you are as a person and especially a footballer, and it takes a big toll on not only your football ability, but your mental health.\"\n>> Read Dakota Davidson's raw interview with Sophie Welsh and Gemma Bastiani HERE\nWhy Josh Weddle wants to wear navy blue, and the 'shock' result that lit the fire\nJOSH Weddle wants to join the family business. It won't be anytime soon. But when his time in the AFL is over, the Hawthorn star plans on swapping the brown and gold for the navy blue uniform worn by both of his parents.\nSenior Sergeant Jarrod Weddle and Senior Constable Tania Perry have worked for Victoria Police for more than 30 years. They met at Carlton police station in 1991 after progressing through the academy in the late 1980s.\nVictoria Police courses through Weddle's veins. Josh's uncle has been in the same game for just as long, while his sister Jamie joined the force a few years ago.\nWeddle has played 59 games across his first three seasons at Waverley Park, establishing himself as one of the most versatile, damaging young players in the game. His ceiling is higher than most. Almost anything feels possible. But when this career eventually ends, a future fighting crime beckons.\n>> Read Josh Gabelich's feature on Hawks star Josh Weddle HERE\nSuns recruit's latest venture will have you hook, line and sinker\nTHIRTEEN minutes into the third video on Daniel Rioli's YouTube channel, the handline he has sitting on the banks of Tallebudgera Creek starts jumping.\n\"Bub, we're on,\" Rioli excitedly says to his fiancé Paris, who is filming the afternoon fishing adventure while keeping an eye on the couple's puppy, Bobby. \"It's big, it's big.\"\n\"You're joking,\" she says, almost giggling with excitement.\n\"No, I swear on our relationship.\"\nRioli fights, reels in the fish and gets it to land, much to the appreciation of some onlookers from the nearby overpass.\nThe 27-year-old is like a kid looking under the tree on Christmas morning.\n>> Read Michael Whiting's insight into how Daniel Rioli is reeling in viewers on social media HERE\nAs Jack Martin's body failed, his mind started playing tricks on him\nTHE THOUGHTS still run through Jack Martin's mind nearly every time he laces his boots.\nSometimes, it's as simple as, 'Can I get through this game?'. If he does, the next question inevitably follows - 'Am I going to pull up OK?'. At his lowest points, even trotting out to training has begged the thought, 'Will I finish this session?'.\nMartin's fitness had failed him towards the end of a five-year Carlton career that yielded just 54 senior games. More than that, his mind had started playing tricks on him as well. While he was always confident he could get back to being the player he had long promised to be, he needed to find an environment that could cater for a body that was fast becoming unreliable. He's found that at Geelong.\n\"To be honest, I don't even know how to explain it,\" Martin tells AFL.com.au on the eve of his long-awaited return to September.\n\"It's a funny one, because half the battle for me has been the mental game. It's between the ears. I haven't played a lot of footy over the last couple of years. Even now, during the week at training, I'll ask, 'Am I going to get through this?'. I'm sort of still facing those challenges.\"\nHe'd almost finished a medical degree, but then footy took over\nMONASH School of Medicine hadn't been faced with a request like this before. Students press pause all the time, but the university had never had someone defer a medical degree indefinitely to start an AFL career. That changed when the Western Bulldogs selected Sam Davidson in last November's AFL Draft.\nThe 23-year-old has already completed five years of medicine and only has one year left to finish his degree. Last year, Davidson studied an optional honours degree to help him to get to training on time, finally allowing him to give football a proper shot.\nIt worked. After spending half of 2022 playing for Sale City in the North Gippsland League, then the first five rounds of 2023 with South Mildura in the Sunraysia League, before ending that season with Maffra in the Gippsland League – all due to rural hospital placements – Davidson starred for Richmond in the VFL last winter.\nRecruiters started paying attention in the days before the Mid-Season Rookie Draft, after the kid with blond hair shone on the MCG in the Dreamtime at the 'G curtain raiser. When he kicked four goals against Port Melbourne a fortnight later, then six more against the Northern Bullants the next month, the cat was out of the bag. By the end of the season, Davidson won the Fothergill-Round-Mitchell Medal awarded to the best young talent in the VFL.\n>> Read Josh Gabelich's feature on Sam Davidson HERE",
  "word_count": 3466,
  "scraped_at": "2026-02-14T13:33:28.246231"
}