{
  "article_id": "182ffbcb1c83",
  "url": "https://en.vietnamplus.vn/vietnam-spain-relations-flourish-on-solid-foundation-ambassador-post308658.vnp",
  "title": "Vietnam - Spain ties thrive on solid foundation | Vietnam+ ( VietnamPlus ) ",
  "date": "20250121T061500Z",
  "domain": "en.vietnamplus.vn",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Hanoi (VNA) – The thriving Vietnam – Spain relations have evolved significantly, building upon their strong foundation nurtured for the last nearly five decades, Spanish Ambassador Carmen Cano de Lasala has said.\nIn a recent interview granted to the Vietnam News Agency, the diplomat highlighted the robust development of bilateral relations over the recent past, with Spain becoming the first country in the European Union to establish a strategic partnership with Vietnam – in 2009, paving the way for enhanced collaboration across multiple sectors. The two countries will celebrate the 30th anniversary of the Spanish Embassy in Hanoi in 2026 and the 50th anniversary of the diplomatic relations in the following year.\nShe held that the establishment of the Spanish Chamber of Commerce in Vietnam in the end of 2022 and the upcoming meeting of the joint committee on economic, trade, investment cooperation underscore the growing significance of bilateral trade ties.\nBeyond economic ties, the two countries share substantial potential for collaboration in culture, higher education, sports, tourism and Spanish language training, she said, adding amidst complicated geostrategy, they maintain a strong commitment to promoting multilateralism and international law – the important factors to adjust the bilateral ties and respond to global challenges.\nTouching on education cooperation, the ambassador noted higher education, research and development, and innovation are among the fields in which both sides are investing and wish to bolster connections. She laid stress on the recent signing of a letter of intent on technology transfer and innovation between Vietnam's Ministry of Science and Technology’s State Agency for Technology Innovation and Spain's Centre for the Development of Industrial Technology in September last year. She said the deal is expected to faciliate cooperation between enterprises of both sides in the domain.\nRegarding sports, particularly football, she noted Spain’s football has established its international prestige and influence, which helps popularise the country’s images across the globe. She also highlighted national football championships La Liga's presence in Vietnam, pledging to help boost cooperation in developing both men's and women's football, with a special focus on the youth's.\nOn infrastructure development, particularly regarding Vietnam's recently approved North–South high-speed railway project, the ambassador highlighted Spain's expertise in the field, and that the country ranks second globally in the expressway length and first in terms of the high-speed rail network length per capita, having developed one of the world's most important high-speed rail networks in just three decades.\nSpanish enterprises have demonstrated their capaciy in constructing quality high-speed rail systems in areas with complex terrains and climates, as evidenced by projects like the Mecca–Medina line in Saudi Arabia and the Almaty–Astana route in Kazakhstan. The companies stand ready to contribute their expertise to Vietnam's ambitious railway project, according to the diplomat.\nShe also underscored the environmental benefits of rail transport, which will help Vietnam achieve its net-zero emissions target by 2050. Drawing from Spain's experience, she elaborated how high-speed rail has revolutionised Spanish lifestyle and mobility, with trains reaching speeds of over 300 km/h connecting Madrid to Barcelona in less than three hours, helping promote tourism and investment while reducing pollution./.",
  "word_count": 516,
  "scraped_at": "2026-02-14T12:53:21.531019"
}