{
  "article_id": "18454c4cb77d",
  "url": "https://theathletic.com/4510695/2023/05/13/nils-nielsen-manchester-city-women-2/",
  "title": "Nils Nielsen , Man City first women director of football :  A couple of things are missing  ",
  "date": "20230513T044500Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "As you might expect, Nils Nielsen’s guitar has spent the past week gathering dust. A member of a blues band in his younger days and still sporting the floppy fringe and shaved sides of a post-punk icon, Manchester City’s first-ever women’s director of football likes to sit back and jam in his spare time.\nAdvertisement\nYet since his appointment was announced last week, he hasn’t had the chance. “I still have the desire to play,” he says. “Whenever the mood is there, for sure I will.”\nNielsen knows he has a job on his hands, though. For the first time in an impressive career, the former Denmark and Switzerland head coach has stepped away from the training pitch and moved upstairs to a role that will see him lead player development and recruitment across City’s first team setup.\nWhy? “Simple question, but not such a simple answer,” he says. “For me, it’s two sides of the same thing. It is a place where you still get to work with the team, with the players, but you have to make more overall decisions, so they are sustainable over a long period of time.”\nNielsen says he did not have to think twice once the call came from City, even if it represented something of a career change. “It’s still working with people. It’s still the exciting part of football I get to be part of.”\nNielsen could have had an easier first week on the job, though. Despite only dropping seven points across their previous 17 games heading into last weekend, Sunday’s 2-1 defeat away at Liverpool all but ended City’s title challenge and has left their chances of qualifying for the Champions League hanging by a thread.\nA lowest league finish since 2015 now appears likely. If we are entering the era of a ‘big four’ rather than a ‘big three’ in the Women’s Super League, then that paradigm shift is closing in on its first casualty.\nNielsen is fully aware failing to qualify for the Champions League could make the first few months of his new role more difficult than they might have been, particularly when it comes to recruitment. “It will not change what we try to do. How successful we are in doing it, I cannot say if it changes that,” he admits.\nAdvertisement\n“It’s clear that many of the players have in mind they want to be part of the Champions League. If you qualify, of course, it is slightly easier, but I also see the bigger picture here — even if we should end up number four this season, it doesn’t mean we have to close the club.”\nIf City fall slightly short of their usual standards this season, that cannot be separated from the departures of several experienced figures and seasoned internationals last summer. Any team would struggle when losing the likes of Lucy Bronze, Keira Walsh, Georgia Stanway and Caroline Weir in one window, not to mention Ellen White and Jill Scott’s retirements.\nThis overhaul in talent and the emergence of newer, fresher faces like Esme Morgan, Kerstin Casparij and Laia Aleixandri left City with the third-youngest squad in the WSL. Nielsen recognises he is now overseeing a squad that on one hand has huge potential further down the line, and on the other, issues to address in the here and now.\n“The long-term target is clearly that we want to be back on top, that we want to be the number one club in England,” he says. “If that happens, that cannot happen overnight. We cannot just say: ‘OK, we want that’.\n“We have a lot of talent, we have a lot of weapons that we can use, but there are elements we need to address fast and then over the next couple of years, other elements that we need to look at so we can keep improving every transfer window.”\nWith the growth of the women’s game and the increased competitiveness of the league, the stakes are rising. “Every season we need to be a little bit better than we were the season before. Otherwise, we are not going to catch up to the teams in front of us.\n“We need to always be competitive every season. Right now, we are a little bit behind the best teams, just a few points, but we need to catch up on that. That means we also need to act short-term.”\nAdvertisement\nNielsen will be taking a collaborative approach to recruitment, with head coach Gareth Taylor and scouts and performance analysts all consulted, but he knows where the buck stops. “Who is responsible in the end? Yeah, if the players we bring in don’t produce, it probably would be me recommending them.”\nHe does not detail each and every area of the squad that requires his attention between now and the start of next season, but he does drop one, slightly surprising hint. Despite Khadija ‘Bunny’ Shaw’s 18 goals putting her second to only Rachel Daly in the WSL scoring charts, added firepower is required.\n“I think most top teams would like to have a goal scorer, somebody that consistently puts the ball in the net, and we would like that, too,” he says. “But let’s see which one we’re going to get.”\nHis hope is that, whether City finish in the top three or not, the players and agents he is already speaking with can see the bigger picture beyond just next season. For Nielsen, greater integration of the academy is a major part of that vision.\n“I don’t see any reason to have an academy and invest in it if you don’t try to push players forward,” he says. Working alongside academy technical director Jayne Ludlow, he wants to clear a path to the first team for talent already within City’s system.\n“I think we are very well on the way. The facilities are great, the atmosphere is great, they work really hard, but there are a couple of things missing, linking the academy to the first team; that we need to do a little bit better. That will be what we are focusing on in the coming years.”\nOn this conveyor belt of emerging talent, Nielsen wants a mix of both locally sourced players and the best from elsewhere — once he has sat down and got his head around the post-Brexit regulations.\n“I’m honestly not familiar 100 per cent with Brexit,” he says. “I don’t even understand why you wanted out of the EU, but that is a completely different story. It’s up to you guys. What I’m hearing is that not many people actually thought it through, so now we are in this (situation).\nAdvertisement\n“The homegrown talent that actually comes from Manchester — if we can find them, they have to play with us,” he stresses. “If they are there, we need them.”\nYet listen to Nielsen talk about City’s state-of-the-art facilities or the atmosphere within the club and you know he is being sincere when he says that his most important task is to simply “connect the dots” and tie together a wider structure that has everything in place to succeed over the years to come.\n“Sometimes in a big club, everybody is so busy that you need someone to make sure that the left hand knows what the right hand is going to do. That’s one of my jobs.\n“I don’t think necessarily that we need to change that much,” he adds. “We need to add some things, but the quality is there. We need some elements that are not there right now, but long-term, we are in a very good position.”\n(Top photo: Marcio Machado/Eurasia Sport Images/Getty Images)",
  "word_count": 1283,
  "scraped_at": "2026-02-14T12:39:35.676434"
}