{
  "article_id": "185d8061650d",
  "url": "https://countercurrents.org/2024/07/who-are-the-olympics-for/",
  "title": "Who Are The Olympics For ? ",
  "date": "20240726T050000Z",
  "domain": "countercurrents.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "On Friday evening, the world’s attention will lock in on the opening ceremony of the Summer Olympic Games as they return to Paris, the birthplace of Pierre de Coubertin, the father of the modern Games. Over its 128-year history, de Coubertin’s Olympiad has experienced some quite radical changes. His inaugural 1896 Games in Athens saw participation from just a dozen nations, while 206 are expected to take part this summer in Paris. Only nine sports were featured in Greece, while 32 will be on display in France. Perhaps most crucially, today’s Olympics both incur billions of dollars in debt and generate billions in revenue, a stark contrast to the much more austere inaugural edition.\nYet, while it is true that the Olympic Games have evolved and expanded over time, the multi-sport mega event has never fully espoused the principles of Olympism and proffered African athletes the same respect as others. Indeed, the first African athletes to compete in the modern Olympics were a pair of South African marathon runners who competed in the 1904 Summer Olympics in St. Louis, Missouri: Len Taunyane and Jan Mashiani. However, the two were brought to the US not as professional athletes but as actors to reenact battles of the Anglo-Boer War for the 1904 World’s Fair, which was held in St. Louis in honor of the 100th anniversary of the Louisiana Purchase. At the fair, Taunyane and Mashiani participated in an event titled “Athletic Events for Savages” held on August 11–12. It is not clear how they were later registered in the Summer Olympics marathon on August 30, but what is known is that they finished ninth and 12th, respectively.\nIn the decades that followed, African athletes could compete only under the flags of their colonizers, whose repressive regimes controlled the frequency and manner in which indigenous athletes practiced sport. As the French say, “Plus ça change, plus c’est la même chose…”—the more it changes, the more it’s the same thing—and this year’s Olympics continue the tradition of discrimination.\nSeven years ago, when France was awarded the rights to host the 2024 Summer Olympic Games, a fresh-faced Emmanuel Macron celebrated by stating, “The Games are the Games for all, all territories, all sectors.” Just a few days before the Games kick off, it’s become abundantly clear to many Africans living in France and to French citizens of African descent that Paris 2024 will not be “the Games for all.”\nWhen it comes to freedom of expression, for instance, Muslim female athletes in France have been prohibited from wearing the hijab at the highest levels of sport for decades. Amnesty International’s July 16 report, titled “Hijab Bans in French Sport Expose Discriminatory Double Standards ahead of Olympic and Paralympic Games,” notes that French authorities have weaponized concepts like state neutrality to justify laws and policies disproportionately impacting Muslim women and girls. Amnesty also noted that France is the only European country enforcing bans on religious headwear through national laws or individual sports regulations. The International Olympic Committee (IOC) issued a weak response to the rights organization, stating, “Freedom of religion is interpreted in many different ways by sovereign states.”\nAfrican athletes also feel that historically their political concerns are often ignored by Olympic officials. Egypt boycotted the 1956 Melbourne Games when the IOC did not exclude Great Britain, France, and Israel, the countries responsible for the tripartite aggression during the Suez Crisis. In 1976, a near continent-wide boycott of the Montreal Games occurred due to the IOC’s refusal to ban New Zealand, whose national rugby team had toured apartheid South Africa earlier that year.\nToday, many Africans see a double standard in excluding Russia from the Olympic Games while maintaining Israel’s participation. The IOC’s explanation hinges on Russia’s violation of the Olympic Charter as it absorbed regional sports organizations in occupied Ukrainian territory (Kherson, Luhansk, Donetsk, and Zaporizhzhia). However, there have been no ramifications for the Israeli Olympic Committee, despite continued sporting activity in Palestinian-occupied territories, the complete destruction of sporting infrastructure in Gaza, and the massacre of no less than 300 sportspeople and officials since October 7, 2023.\nWhen Algerian Judoka Fethi Nourine forfeited his match at the 2020 Tokyo Games to avoid facing an Israeli opponent, he and his coach were subsequently banned for 10 years. It would not be a surprise to see other African athletes withdrawing from competing against Israeli athletes should they be drawn against one another in this year’s Games.\nSubscribe to Our Newsletter\nGet the latest CounterCurrents updates delivered straight to your inbox.\nOn the ground in Paris, Macron’s government has been working hard to present a polished Parisian image to the world at the expense of marginalized groups. Over the past year, police and courts have evicted around 5,000 people from the capital, mostly single men from war-torn countries like Sudan. According to reports from DW News and the New York Times, vulnerable migrants are often offered social housing outside of the capital, but they soon realize that they are being tricked into deportation or housing that does not meet the most basic standards.\nUnfortunately, none of these strategies are novel when it comes to hosting the Olympic Games. But as we consume several weeks’ worth of peak athletic performance, we should keep in mind that the organizers of Paris 2024 utterly failed to resolve underlying issues of inclusivity, fairness, and human dignity this summer.\nMaher Mezahi is a football journalist and host of the Africa Five-a-side podcast. Based in Algiers, he is a contributing editor for Africa Is a Country.\nOriginally published in: Africa is a Country",
  "word_count": 931,
  "scraped_at": "2026-02-14T12:09:35.274090"
}