{
  "article_id": "185f8530d56e",
  "url": "http://www.tnledger.com/Default.aspx?newsDate=1/30/2026",
  "title": "The Nashville Ledger",
  "date": "20260129T094500Z",
  "domain": "tnledger.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Fine wines made in Tennessee? Why not?\nGrowing industry takes root across the state\nOn a clear afternoon in East Tennessee’s Monroe County, a light breeze moves across a ridgeline draped in muscadine vines. From the tasting room at Tsali Notch Vineyard, the view stretches across farmland shaped by weather and time.\nWine Duo helps demystify buying, enjoying\nA bottle of wine shouldn’t require a glossary, credit check or a chemistry degree. Yet for many shoppers staring down a wall of labels, the experience can feel intimidating – hundreds of bottles staring back and no clear way to know what’s worth buying.\nDalton’s journey from cardiac care to muscadine vines\nFrom the center of the vineyard, the land opens in every direction. Mountains stack against the horizon. The sky feels as big as a Billy Wilder western. Rows of vines run long and straight, broken only by the gradual slope of the ground.\nHow to grow great grapes in difficult climate\nBy the standards of the global wine industry, Tennessee is not supposed to work.\nBetter gas up the car before hitting Tennessee’s wineries\nTennessee does not have a single, widely recognized wine capital. Instead, wineries are distributed across the state, often located near population centers or established tourism corridors.\n39.9°F\nA Few Clouds\nWind: calm mph\nHumidity: 58%\nEVENTS\nWomen in Business Winter Luncheon. Sarah Gibson, an AI strategist and university professor with more than 17 years of experience specializing in generative AI, communication law and ethics, and new media storytelling, will lead a discussion of how leaders can thoughtfully and effectively integrate AI into their organizations. Gibson is editor-in-chief of the “Journal of Human-Centered AI: Creativity and Practice” and the executive producer of the “AI and the Kid” podcast, co-created and hosted by her 10-year-old daughter. She holds a degree in electronic media from Abilene Christian University, along with a masters in radio, television and film from the University of North Texas. She currently serves as the Director of the School of Communication and the Faculty Fellow of AI for Lipscomb University. Tuesday, 11 a.m.-1 p.m., Haney Hall at Brentwood United Methodist Church, 309 Franklin Road, Brentwood. InformationLegislature is back with bundle of bizarre bills\nSubmitted for your consideration, a handful of under-the-radar bills that bear watching this legislative session.\nTop Davidson County commercial real estate sales for 2025\nTop Davidson County commercial real estate sales for 2025, as compiled by the Nashville Ledger.\nAverage US long-term mortgage rate ticks higher, holding near lowest point in more than 3 years\nThe average long-term U.S. mortgage rate edged up for the second week in a row, but remains just above its lowest level in more than three years.\nWill Titans management let Saleh be successful?\nRobert Saleh, the Tennessee Titans’ new head coach, is about to undertake a big challenge given the way ownership shifts coaches and executives in and out constantly.\nLet’s not pretend Vrabel doesn’t share some blame for firing here\nTitans fans, how are you feeling about Mike Vrabel? In perusing comments and the like on social media, there are plenty of Titans fans who are happy that Vrabel guided the New England Patriots to Super Bowl XL and are hoping he will bring home the prize he never quite got to in Tennessee.\nSeahawks should win Super Bowl\nThe redemption of Mike Vrabel versus the redemption of Sam Darnold. That’s sort of how Super Bowl XL shapes up.\nTrading up to get Josi has proven to be a great move\nNHL Drafts are often fertile ground for trades to be made. Sometimes big-name players with big contracts change hands, while other swaps involve teams sending draft picks to one another.\n4 Predators to represent countries in Olympics\nWith the NHL set to pause for nearly three weeks so that its players can represent their respective home nations at the upcoming Winter Olympics, most players are going to get a break from the grind of a season that has featured a compressed schedule due to the necessity to get the same 82-game regular season into a much shorter window due to the Olympics.\nThey said it\nNotable quotes from Bridgestone Arena:\nAirport Authority appoints Kreppein as chief of police\nThe Metropolitan Nashville Airport Authority has selected Beth Kreppein as chief of police for the Department of Public Safety, where she will lead law enforcement operations at both Nashville International Airport and John C. Tune Airport. Kreppein will oversee public safety, emergency response, security strategy and partnerships with local, state and federal agencies.\nMetro Council sets Feb. 3 budget public comments\nNashville residents will have an early chance to weigh in on the city’s budget at a pre-budget public comment period during the Metro Council meeting Tuesday, Feb. 3.\nLuxury plug-in SUVs: BMW X5, Mercedes GLE\nThe BMW X5 and Mercedes-Benz GLE are two popular midsize luxury SUVs that offer the latest in luxury, space and technology. Of course, neither vehicle is aimed at the cost-conscious car shopper, but this is a situation where you do get what you pay for.\nFinancial advice for those who had bigger priorities\nBefore you came out, you didn’t talk about it. But then you started to share, a little here a little there with people you trusted. Before that, though, no discussions.\nIs a ‘good enough’ plan right for your finances?\nI’m a classic satisficer: I’m usually quick about making decisions and often fall back on the tried-and-true. Some people are optimizers, carefully analyzing almost every choice, whether it’s a new sofa or a cup of coffee.\nGus Bradley rejoining Saleh as Titans defensive coordinator\nNASHVILLE (AP) — Gus Bradley is returning to the AFC South and reuniting with Robert Saleh as the Tennessee Titans defensive coordinator.\nTennessee QB Joey Aguilar gets a temporary restraining order in his bid to keep playing for the Vols\nKNOXVILLE (AP) — Tennessee quarterback Joey Aguilar has been granted a temporary restraining order in his lawsuit against the NCAA as he seeks an extra year of eligibility enabling him to continue playing for the Volunteers this fall.\nAment's big 2nd half leads No. 25 Tennessee over Ole Miss, 84-66\nKNOXVILLE (AP) — Nate Ament scored 26 of his 28 points in the second half to lead No. 25 Tennessee to its fourth consecutive victory Tuesday night with an 84-66 win over Mississippi.\nSupreme Court allows new California congressional districts that favor Democrats\nWASHINGTON (AP) — The Supreme Court on Wednesday allowed California to use a new voter-approved congressional map that is favorable to Democrats in this year's elections, rejecting a last-ditch plea from state Republicans and the Trump administration.\nGovernment lawyer yanked from immigration detail in Minnesota after telling judge 'this job sucks'\nWASHINGTON (AP) — A government lawyer who told a judge that her job \"sucks\" during a court hearing stemming from the Trump administration's immigration enforcement surge in Minnesota has been removed from her Justice Department post, according to a person familiar with the matter.\nJudge seems skeptical of legal justification for Pentagon's punishment of Sen. Mark Kelly\nWASHINGTON (AP) — A federal judge said Tuesday that he knows of no U.S. Supreme Court precedent to justify the Pentagon's censuring of a sitting U.S. senator who joined a videotaped plea for troops to resist unlawful orders from the Trump administration.\nProsecutors seek life sentence for man who tried to shoot Trump at a Florida golf course\nFORT PIERCE, Fla. (AP) — Federal prosecutors are set to ask that a man convicted of trying to assassinate President Donald Trump on a Florida golf course in 2024 be sentenced to life in prison at a hearing on Wednesday.\nRenters use 'rent now, pay later' services to manage monthly payments, but fees raise concerns\nNEW YORK (AP) — Rent can eat up an entire paycheck at the start of the month, so a growing number of renters are turning to a financial product that promises relief by letting them split the bill — for a price.\nWashington Post says cuttings one-third of staff, eliminating sports coverage\nThe Washington Post laid off one-third of its staff Wednesday, eliminating its sports section, several foreign bureaus and its books coverage in a widespread purge that represented a brutal blow to journalism and one of its most legendary brands.\nSuper Bowl LX ads feature AI, weight-loss drugs and celebs from George Clooney to Kendall Jenner\nNEW YORK (AP) — As Super Bowl Sunday approaches, the battle off the field for advertisers to win over 120 million-plus viewers will be just as heated as the rivalry between the New England Patriots and Seattle Seahawks.\nMusk vows to put data centers in space and run them on solar power but experts have their doubts\nNEW YORK (AP) — Elon Musk vowed this week to upend another industry just as he did with cars and rockets — and once again he's taking on long odds.\nTrump's border czar pulling 700 immigration officers out of Minnesota immediately\nMINNEAPOLIS (AP) — The Trump administration is reducing the number of immigration officers in Minnesota but will continue its enforcement operation that has sparked weeks of tensions and deadly confrontations, border czar Tom Homan said Wednesday.\nDemocrats demand 'dramatic changes' for ICE, including masks, cameras and judicial warrants\nWASHINGTON (AP) — Democrats are threatening to block funding for the Homeland Security Department when it expires in two weeks unless there are \"dramatic changes\" and \"real accountability\" for U.S. Immigration and Customs Enforcement and other law enforcement agencies who are carrying out President Donald Trump's campaign of federal immigration enforcement in Minnesota and across the country.\nBrothers of Renee Good, woman killed by immigration officer, call for action in Congress\nWASHINGTON (AP) — The brothers of Renee Good, one of two U.S. citizens killed by federal immigration officers in Minneapolis, called on Congress to do something about the violence on American streets as a result of immigration operations, warning Tuesday that the scenes playing out are \"changing many lives, including ours, forever.\"\nThe US authorizes a short extension to a longstanding African trade agreement. Here's what to know\nCAPE TOWN, South Africa (AP) — U.S. President Donald Trump has extended a 26-year-old free-trade agreement with African countries. Trump on Tuesday signed an extension of the African Growth and Opportunity Act, or AGOA. The agreement first introduced in 2000 gives eligible sub-Saharan African nations duty-free access to the U.S. market for some products. The deal came under question last year when Trump's administration allowed it to expire while enforcing global tariffs. The extension will last through Dec. 31. The U.S. trade office says the agreement would be modified to take into account the Republican president's America First policy.\nVance says US seeks to create a critical minerals trading bloc with its allies to counter China\nWASHINGTON (AP) — The Trump administration wants to create a critical minerals trading bloc with its allies that will use tariffs to maintain price floors and defend against China's tactic of flooding the market to undermine any potential competitors.\nFormer Indiana Rep. Lee Hamilton, leader of Sept. 11 panel, dies\nINDIANAPOLIS (AP) — Former Rep. Lee Hamilton, a crewcut-wearing Indiana Democrat who was a leading foreign affairs voice during three decades in Congress and helped oversee investigations of the Sept. 11 terrorist attacks, died Tuesday. He was 94.\nAmericans are exceptionally anxious about their political system, new Gallup polling shows\nWASHINGTON (AP) — Americans are exceptionally anxious about their political system, according to new international polling from Gallup, a situation that sets the country apart from other rich and powerful nations.\nUK will release files about Mandelson's ambassador appointment as anger mounts over Epstein\nLONDON (AP) — The U.K. government agreed Wednesday to release documents casting light on the decision to appoint Peter Mandelson as ambassador to the United States, despite his friendship with Jeffrey Epstein, as it tries to stem mounting anger over the revelations.\nHow Americans' top concerns compare to more than 100 other countries: Gallup poll\nWASHINGTON (AP) — Americans are exceptionally anxious about their political system, according to new international polling from Gallup, a situation that sets the country apart from other rich and powerful nations.\nTrump and Xi discuss Iran in wide-ranging call as US presses China and others to break from Tehran\nWASHINGTON (AP) — President Donald Trump said Wednesday that he and Chinese President Xi Jinping discussed the situation in Iran in a wide-ranging call as the U.S. administration pushes Beijing and others to further isolate Tehran.\nWhat Democrats are demanding in the fight over Immigration and Customs Enforcement funding\nWASHINGTON (AP) — Despite rare negotiations between Democrats and President Donald Trump, a bipartisan agreement on new restrictions for federal immigration enforcement in the next two weeks will be exceedingly difficult — or even \"an impossibility,\" as Republican Senate Majority Leader John Thune said.\nFederal Reserve governor Miran steps down from White House post\nWASHINGTON (AP) — Federal Reserve governor Stephen Miran has stepped down from his position as chair of the White House's Council of Economic Advisers, ending a controversial arrangement where he held positions at both institutions.\nComplaint accuses Gabbard of playing politics with intelligence, which spy agency rejects\nWASHINGTON (AP) — A complaint made about Director of National Intelligence Tulsi Gabbard months ago relates to an allegation that she withheld access to classified information for political reasons, according to a memo sent to lawmakers by the inspector general's office and obtained by The Associated Press.\nTrump calls Colombia's Petro 'terrific' after White House meeting while downplaying past insults\nWASHINGTON (AP) — President Donald Trump held a nearly two-hour meeting on Tuesday with his Colombian counterpart, Gustavo Petro, that both called friendly — a dramatic about-face from weeks earlier, when Trump accused Petro of pumping cocaine into the U.S. and threatened his country with military action.\nTrump says Washington has waited 200 years for the arch he wants to build. Not quite\nWASHINGTON (AP) — President Donald Trump says history is on his side.\nTrump signs bill to end partial government shutdown, setting stage for next fight\nWASHINGTON (AP) — President Donald Trump signed a roughly $1.2 trillion government funding bill Tuesday that ends the partial federal shutdown that began over the weekend and sets the stage for an intense debate in Congress over Homeland Security funding.\nNashville chosen as venue for 2028 Olympic soccer tournament\nThe LA28 Olympic and Paralympic Games today announced six additional venues across the United States – including Nashville's Geodis Park – that will host matches for the 2028 Olympic soccer tournaments.\nStamkos scores twice in 3rd in Predators' 6-5 comeback win over Blues\nNASHVILLE (AP) — Steven Stamkos scored twice in the third period to help the Nashville Predators rally for a 6-5 victory over the St. Louis Blues on Monday night.\nTennessee QB Joey Aguilar files lawsuit in Knoxville seeking additional year of eligibility\nKNOXVILLE (AP) — Tennessee quarterback Joey Aguilar has filed a lawsuit as he bids for an extra year of eligibility that would allow him to play this fall.\nFlorida congresswoman accused of stealing COVID-19 funds pleads not guilty 3 months after indictment\nMIAMI (AP) — A Florida congresswoman charged with conspiring to steal $5 million in federal COVID-19 disaster funds formally pleaded not guilty on Tuesday, nearly three months after her indictment.\nTrial of ex-FirstEnergy executives charged in $60M Ohio bribery scheme begins\nCOLUMBUS, Ohio (AP) — The $4.3 million payment that Ohio-based FirstEnergy made to veteran lawyer and lobbyist Sam Randazzo in 2019, shortly before he was appointed as the state's top utility regulator, is at the center of the latest criminal trial to get underway in a sweeping $60 million bribery scandal.\nParis prosecutors raid X offices as part of investigation into child abuse images, deepfakes\nPARIS (AP) — French prosecutors raided the offices of Elon Musk's social media platform X on Tuesday as part of a preliminary investigation into a range of alleged offences, including spreading child sexual abuse images and deepfakes.\nTrump's $10 billion lawsuit against the IRS raises conflict of interest concerns\nWASHINGTON (AP) — Legal experts say President Donald Trump's $10 billion lawsuit against the IRS over the leak of his tax information raises a plethora of legal and ethical questions, including the propriety of the leader of the executive branch pursuing scorched-earth litigation against the very government he is in charge of.\nHouse lawmaker raises new concerns over FDA's ultra-fast drug review program\nWASHINGTON (AP) — A Democratic lawmaker is raising new concerns about a Food and Drug Administration program designed to drastically shorten the review of certain drugs, including whether senior officials involved in the effort are complying with federal ethics rules.\nThe wealthy ramp up spending while other Americans tread water, new study finds\nWASHINGTON (AP) — Higher-income Americans and those with college degrees have ramped up their spending more quickly in the past three years than other consumers, according to new data released Tuesday, evidence of worsening inequality that may explain some of the growing pessimism about the economy.\nVatican's 'trial of the century' resumes after prosecutors suffer embarrassing setbacks on appeal\nVATICAN CITY (AP) — The appeals phase of the Vatican's \"trial of the century\" resumed Tuesday after a pair of setbacks for the pope's prosecutors that could have big repercussions on the outcome of the troubled case.\nSpain considers social media ban for under-16s, joining others in Europe\nMADRID (AP) — Spain plans to ban social media access for children under 16, Prime Minister Pedro Sánchez said Tuesday, in a move designed to shield young people from the harms of online content.\nChina to ban hidden door handles on cars starting 2027\nHONG KONG (AP) — China will ban hidden door handles on cars, commonly used on Tesla's electric vehicles and many other EV models, starting next year.\nRobotaxi pioneer Waymo gets $16 billion injection to accelerate its expansion plans\nRobotaxi pioneer Waymo has raised another $16 billion to help fuel its ambition for its fleet of self-driving cars to provide rides throughout the world while other deep-pocketed rival services backed by Tesla and Amazon try to catch up.\nFrance dumps Zoom and Teams as Europe seeks digital autonomy from the US\nLONDON (AP) — In France, civil servants will ditch Zoom and Teams for a homegrown video conference system. Soldiers in Austria are using open source office software to write reports after the military dropped Microsoft Office. Bureaucrats in a German state have also turned to free software for their administrative work.\nWhy China is building so many coal plants despite its solar and wind boom\nBEIJING (AP) — Even as China's expansion of solar and wind power raced ahead in 2025, the Asian giant opened many more coal power plants than it had in recent years — raising concern about whether the world's largest emitter will reduce carbon emissions enough to limit climate change.\nMAHA has reshaped health policy. Now it's working on environmental rules\nWASHINGTON (AP) — On New Year's Eve, Lee Zeldin did something out of character for an Environmental Protection Agency leader who has been hacking away at regulations intended to protect Americans' air and water.\nMore departures at the US attorney's office in Minnesota, AP sources say\nWASHINGTON (AP) — A new wave of departures is rippling through the U.S. Attorney's office in Minnesota, where additional federal prosecutors are leaving at a time of mounting frustration with the Trump administration's stepped-up immigration enforcement and the Justice Department's response to fatal shootings of civilians by federal agents, two people familiar with the matter said Tuesday.\nTrump administration's tongue-in-cheek names for immigration operations praised and slammed\nWASHINGTON (AP) — Operation Dirtbag in Florida. Operation Catahoula Crunch, also known as Swamp Sweep, in Louisiana. Operation Catch of the Day in Maine.\nEvery Homeland Security officer in Minneapolis is now being issued a body-worn camera, Noem says\nWASHINGTON (AP) — Every Homeland Security officer on the ground in Minneapolis, including those from Immigration and Customs Enforcement, will be immediately issued body-worn cameras, Secretary Kristi Noem said Monday, in the latest fallout after the shooting deaths of two U.S. citizens at the hands of federal agents.\nDon Lemon says a dozen agents were sent to arrest him even though he offered to turn himself in\nDon Lemon said about a dozen federal agents came to his Los Angeles hotel to arrest him last week, even though his attorney had told authorities he would turn himself in to face federal civil rights charges over his coverage of an anti-immigration enforcement protest that disrupted a service at a Minnesota church.\nTrump's $45 billion expansion of immigrant detention sites faces pushback from communities\nWith tensions high over federal immigration enforcement, some state and local officials are pushing back against attempts by President Donald Trump's administration to house thousands of detained immigrants in their communities in converted warehouses, privately run facilities and county jails.\nSeeking shelter from Trump's fury, U.S. trade partners reach deals with each other\nWASHINGTON (AP) — Bullied and buffeted by President Donald Trump's tariffs for the past year, America's longstanding allies are desperately seeking ways to shield themselves from the president's impulsive wrath.\nAustralia's central bank raises interest rate to 3.85% after 3 cuts\nMELBOURNE, Australia (AP) — Australia's central bank lifted its benchmark interest rate Tuesday by a quarter percentage point to 3.85%, after three rate cuts last year and as inflation surges.\nDisney parks chief Amaro named to succeed Bob Iger as CEO\nDisney has named its parks chief Josh D'Amaro to succeed Bob Iger as the entertainment giant's top executive.\nPayPal replaces CEO Chriss with HP's Lores\nPayPal is replacing CEO Alex Chriss with Enrique Lores, saying that the pace of change and execution at the company has not met board expectations over the past two years.\nPepsiCo plans price cuts as demand for its drinks and snacks slip\nPURCHASE, NY (AP) — PepsiCo is cutting prices on Lay's, Doritos, Cheetos and Tostitos chips this year to win back customers exasperated by years of price hikes.\nStates scramble to gerrymander US House districts after Trump sought edge in midterm elections\nWith the midterm election approaching, Republicans and Democrats in some states are scrambling for an advantage by redrawing their U.S. House districts to make it easier for their candidates to win.\nHouse passes bill to end the partial government shutdown, sending it to Trump\nWASHINGTON (AP) — The House on Tuesday passed a roughly $1.2 trillion spending package to end the partial government shutdown, sending the measure to President Donald Trump while setting the stage for an intense debate in Congress over Homeland Security funding.\nTrump hosts Colombia's Petro just weeks after insulting him as a 'sick man' fueling the drug trade\nWASHINGTON (AP) — President Donald Trump held talks with Colombian President Gustavo Petro at the White House on Tuesday only weeks after threatening military action against the South American country and accusing the leader of pumping cocaine into the United States.\nFootball, politics and protest: This year's Super Bowl comes at a tinderbox moment in the US\nWASHINGTON (AP) — Don't tune into the Super Bowl hoping for a break from the tumultuous politics gripping the U.S.\nTrump says he won't tear down the Kennedy Center arts venue but it needs to be closed for repairs\nWASHINGTON (AP) — President Donald Trump said Monday that he's \"not ripping down\" the Kennedy Center but insisted the performing arts venue needs to shut down for about two years for construction and other work without patrons coming and going and getting in the way.\nIntelligence director says Trump requested her presence at FBI search of Georgia election center\nWASHINGTON (AP) — Director of National Intelligence Tulsi Gabbard told lawmakers in a letter Monday that she attended an FBI search of the elections hub in Fulton County, Georgia, last week because President Donald Trump asked for her to be there.\nClintons finalize agreement to testify in House Epstein probe, bowing to threat of contempt vote\nWASHINGTON (AP) — Former President Bill Clinton and former Secretary of State Hillary Clinton finalized an agreement with House Republicans Tuesday to testify in a House investigation into Jeffrey Epstein this month, bowing to the threat of a contempt of Congress vote against them.\nTrump administration cuts number of sites for testing the 2030 census, focusing on the South\nThe Trump administration is eliminating four out of the six locations that had been slated for a practice test to try out new methods for the 2030 census, raising concerns that the U.S. Census Bureau might not learn enough about communities that have been traditionally difficult to count.\nUK politician Peter Mandelson under scrutiny over alleged leaks to Jeffrey Epstein\nLONDON (AP) — British police on Tuesday are assessing whether former Labour Party politician Peter Mandelson should face a criminal investigation for leaking sensitive government information to the disgraced financier Jeffrey Epstein.\nTrotz is retiring as Predators GM once a successor is found\nNASHVILLE (AP) — Barry Trotz is retiring as general manager of the Nashville Predators after just under three years on the job but will stay on through the March 6 NHL trade deadline and until a successor is found, playing a role in that process.\nMikayla Blakes scores 30 in No. 5 Vanderbilt's comeback win over Florida\nNASHVILLE (AP) — Mikayla Blakes scored 30 points and No. 5 Vanderbilt staged a third-quarter comeback to beat Florida 82-66 on Sunday.\nNo. 1 UConn hands Tennessee worst loss in storied rivalry, routing Lady Vols 96-66\nHARTFORD, Conn. (AP) — Azzi Fudd and UConn got a measure of revenge for the team's most recent loss, handing Tennessee the largest defeat in the history of the storied rivalry between the teams.\nSouthern US enters a second week of biting cold and prolonged outages\nRALEIGH, N.C. (AP) — Four homes blasted by icy winds on an eroding North Carolina island collapsed into the ocean and Florida farmers anxiously waited for frozen plants to thaw Monday as people across the eastern half of the United States coped with more than a week of sub-freezing weather.\nYet another judge rejects Trump effort to block offshore wind, saying NY project can resume\nA federal judge on Monday ruled that an offshore wind project aimed at powering 600,000 New York homes can resume construction, the fifth such project put back on track after the Trump administration halted them in December.\nUndercover investigation of Meta heads to trial in New Mexico in first stand-alone case by state\nSANTA FE, N.M. (AP) — The first stand-alone trial from state prosecutors in a stream of lawsuits against Meta is getting underway in New Mexico, with jury selection starting Monday.\nTop Justice Department official plays down chance for charges arising from Epstein files revelations\nWASHINGTON (AP) — A top Justice Department official played down the possibility of additional criminal charges arising from the Jeffrey Epstein files, saying Sunday that the existence of \"horrible photographs\" and troubling email correspondence does not \"allow us necessarily to prosecute somebody.\"\nMisconduct complaint dismissed against judge who handled El Salvador prison deportation case\nWASHINGTON (AP) — A federal appeals court judge has dismissed a misconduct complaint filed by the Justice Department against a judge who clashed with President Donald Trump 's administration over deportations to a notorious prison in El Salvador.\nPlanned Parenthood drops lawsuit against Trump administration's Medicaid cuts\nPROVIDENCE, R.I. (AP) — Planned Parenthood has moved to drop its legal challenge against the Trump administration for cutting off Medicaid funding to its abortion providers across the U.S.\nHHS unveils program to address homelessness and addiction, part of a set of new initiatives\nNEW YORK (AP) — Health Secretary Robert F. Kennedy Jr. on Monday announced that his department will devote $100 million toward a pilot program addressing homelessness and substance abuse in eight cities, building on an executive order President Donald Trump signed last week related to addiction.\nUS Attorney General Pam Bondi announces 2 more arrests in the St. Paul church protest\nMINNEAPOLIS (AP) — U.S. Attorney General Pam Bondi on Monday announced two more arrests following a protest at a Minnesota church against the immigration crackdown, bringing the number of people arrested to nine.\nWhen forever chemicals contaminate drinking water, private well owners may be the last to know\nSTELLA, Wis. (AP) — Kristen Hanneman made a small decision in 2022 that would upend life for her entire town.\nDisney's first quarter is powered by box-office hits 'Zootopia 2' and 'Avatar: Fire and Ash'\nDisney's fiscal first-quarter adjusted profit topped Wall Street's expectations, bolstered by box-office hits \"Zootopia 2\" and \"Avatar: Fire and Ash.\"\nJapan retrieves rare earth-rich mud from seabed to lower reliance on China\nTOKYO (AP) — Japan said Monday it has successfully drilled and retrieved deep-sea sediment containing rare earth minerals from the seabed near a remote island, as the country seeks to reduce its reliance on China.\nLabor Department delays January jobs report because of partial shutdown\nWASHINGTON (AP) — The Labor Department, citing the partial federal government shutdown, said Monday that it will not release the January jobs report on Friday as scheduled.\nTrump plans to lower tariffs on Indian goods to 18% after India agreed to stop buying Russian oil\nWASHINGTON (AP) — President Donald Trump said Monday that he plans to lower tariffs on goods from India to 18%, from 25%, after Indian Prime Minister Narendra Modi agreed to stop buying Russian oil.\nFlooded by cheap Chinese goods, Latin America is fighting back to protect its industries\nHONG KONG (AP) — China has been flooding Latin American markets with low-priced exports, especially autos and e-commerce goods, as its exporters adjust to U.S. President Donald Trump's tariffs and geopolitical moves.\nFrom Elon Musk to the former Prince Andrew, a who's who of powerful people named in Epstein files\nNEW YORK (AP) — From tech titans to Wall Street power brokers and foreign dignitaries, a who's who of powerful men make appearances in the huge trove of documents released by the Justice Department in connection with its investigations of Jeffrey Epstein.\nTrump administration to create a strategic reserve for rare earths elements\nWASHINGTON (AP) — The Trump administration plans to deploy nearly $12 billion to create a strategic reserve of rare earth elements, a stockpile that could counter China's ability to use its dominance of these hard to process metals as leverage in trade talks.\nGOP chair rejects Clintons' offer in Epstein investigation ahead of contempt of Congress vote\nWASHINGTON (AP) — The Republican chair of a House Committee rejected an offer Monday from former President Bill Clinton to conduct a transcribed interview for a House investigation into convicted sex offender Jeffrey Epstein, pushing the threat to hold both Clintons in contempt of Congress closer towards a vote.\nJustice Department says it's taken down Epstein-related files that may have had victim information\nWASHINGTON (AP) — The Justice Department said Monday that it had taken down several thousand documents and \"media\" that may have inadvertently included victim-identifying information since it began releasing the latest batch of documents related to disgraced financier Jeffrey Epstein on Friday.\nWhat recent polls show about the challenges facing Trump this year\nWASHINGTON (AP) — President Donald Trump might be bragging about his administration's work on affordability, but recent polling suggests that Americans aren't buying it as they grow increasingly frustrated with his leadership.\nOut with the old? Young Democrats are trying to convince voters to send a new generation to Congress\nSACRAMENTO, Calif. (AP) — Mai Vang wouldn't be born for another seven years when Bob Matsui was first elected to Congress from California in 1978. By the time Matsui died in 2005 and was replaced by his widow, Doris Matsui, Vang was still studying biology and sociology in college.\nJohnson says no quick House vote to end partial shutdown and blames Democrats for their ICE demands\nWASHINGTON (AP) — House Speaker Mike Johnson said Sunday it will be a few days before a government funding package comes up for a vote, all but ensuring the partial federal shutdown will drag into the week as Democrats and Republicans debate reining in the Trump administration's sweeping immigration enforcement operations.\nSpeaker Johnson faces tough choices as partial government shutdown drags and debate over ICE deepens\nWASHINGTON (AP) — House Speaker Mike Johnson faces tough days ahead trying to muscle a federal funding package to passage and prevent a prolonged partial government shutdown as debate intensifies over the Trump administration's sweeping immigration enforcement operations.\nWhat to know about the partial government shutdown\nWASHINGTON (AP) — The partial government shutdown is vastly different from the record closure in the fall.\nKennedy Center to close for 2 years for renovations in July, Trump says, after performers' backlash\nWASHINGTON (AP) — President Donald Trump said Sunday he will move to close Washington's Kennedy Center performing arts center for two years starting in July for construction, his latest proposal to upturn the storied venue since returning to the White House.\nFundraising hauls show RNC vastly outpacing Democrats ahead of midterm elections\nWASHINGTON (AP) — The Republican National Committee has vastly outpaced Democrats in the crush for cash ahead of the midterm elections, holding a nearly $100 million advantage at the close of 2025, according to year-end filings to the Federal Election Commission.\nTrump's failed bid to elevate an Arab American ally shows cracks in his political coalition\nWASHINGTON (AP) — When Donald Trump won his comeback campaign, he credited the mayor of a small Detroit suburb with helping him make inroads with Michigan's Arab American community. As a reward, Trump nominated Amer Ghalib to serve as U.S. ambassador to Kuwait.\nTens of thousands enter 6th day without power as Carolinas, Virginia prep for a winter storm\nBELZONI, Miss. (AP) — Tens of thousands of people entered their sixth day with no electricity Friday as the Carolinas and Virginia were preparing for a significant winter storm that could bring more snowfall than some parts of North Carolina have seen in years.\nFlorida braces for frost and possible snow flurries as winter storms hit other parts of the US\nMIAMI (AP) — Florida won't be getting hit with massive blankets of snow and ice like the rest of the U.S., but even frosty windshields and a few flurries can feel like Antarctica to people with permanent sandal tans.\nHypothermia risks increase in Mississippi and Tennessee with next wave of frigid temperatures\nBELZONI, Miss. (AP) — With another wave of dangerous cold heading for the U.S. South on Friday, experts say the risk of hypothermia heightens for people in parts of Mississippi and Tennessee who are entering their sixth day trapped at home without power in subfreezing temperatures.\nNew Titans coach Saleh eager to show what he's learned since his time leading the Jets\nNASHVILLE (AP) — Robert Saleh believes the Tennessee Titans were the best fit for him among the 10 teams looking for a coach this cycle.\nHischier scores 42 seconds into OT, Devils beat Predators 3-2 after Jack Hughes leaves in 1st period\nNEWARK, N.J. (AP) — Nico Hischier scored 42 seconds into overtime to give the Devils a 3-2 win over the Nashville Predators on Thursday night after New Jersey's Jack Hughes left the game in the first period and didn't return.\nPharrell calls for empathy from US leaders after being honored at Black Music Collective event\nLOS ANGELES (AP) — At a pre-Grammy event celebrating Black music's cultural power, Pharrell Williams used the Recording Academy stage to deliver a prayer — not for himself, but for U.S. leaders.\nJustice Department says it's releasing 3 million pages from its Jeffrey Epstein files\nNEW YORK (AP) — The Justice Department on Friday released many more records from its investigative files on Jeffrey Epstein, resuming disclosures under a law intended to reveal what the government knew about the millionaire financier's sexual abuse of young girls and his interactions with rich and powerful people including Donald Trump and Bill Clinton.\nJudge refuses to release a man charged with planting pipe bombs on the eve of the Capitol riot\nWASHINGTON (AP) — A federal judge has refused to order the pretrial release of a man charged with placing two pipe bombs near the national headquarters of the Democratic and Republican parties on the eve of a mob's Jan. 6, 2021, attack on the U.S. Capitol.\nThe Justice Department has opened a federal civil rights probe into the killing of Alex Pretti\nWASHINGTON (AP) — The Justice Department has opened a federal civil rights investigation into the shooting of Alex Pretti, the Minneapolis resident killed Saturday by Border Patrol officers, Deputy Attorney General Todd Blanche said Friday.\nTrump sues IRS and Treasury for $10 billion over leaked tax info\nWASHINGTON (AP) — President Donald Trump is suing the IRS and Treasury Department for $10 billion, as he accuses the federal agencies of a failure to prevent a leak of the president's tax information to news outlets between 2018 and 2020.\nAfter 200 years, the Farmers' Almanac bets on a digital reboot and new owner\nPORTLAND, Maine (AP) — The Farmers' Almanac isn't going out of business after all, but it is leaving Maine for the bright lights of New York City and a new owner.\nAnger and anguish spread across Cuba as it learns of Trump's tariff threat on those who provide oil\nHAVANA (AP) — Massive power outages in Cuba meant that many people awoke Friday unaware that U.S. President Donald Trump had threatened to impose tariffs on any country that sells or supplies oil to the Caribbean island.\nProtesters call for nationwide strike against Trump's immigration policies\nProtesters across the U.S. are calling for \"no work, no school, no shopping\" as part of a nationwide strike on Friday to oppose the Trump administration's immigration crackdown.\nJournalist Don Lemon has been arrested after he covered a Minnesota church protest\nWASHINGTON (AP) — Journalist Don Lemon and three other people were arrested Friday in connection with an anti-immigration enforcement protest that disrupted a service at a Minnesota church and increased tensions between residents and federal officials.\nConservative judge in Minnesota tries to keep Trump administration in check during crackdown\nA law enforcement agency executing the Trump administration's immigration crackdown has been described as a serial violator of court orders in Minnesota.\nFearing ICE, Native Americans rush to prove their right to belong in the US\nMINNEAPOLIS (AP) — When U.S. Immigration and Customs Enforcement flooded Minneapolis, Shane Mantz dug his Choctaw Nation citizenship card out of a box on his dresser and slid it into his wallet.\nTrump's choice of Warsh to lead Fed could reshape the world's most influential central bank\nWASHINGTON (AP) — President Donald Trump's nomination of Kevin Warsh to chair the Federal Reserve could bring about sweeping changes at a central bank that dominates the global economy and markets like no other.\nWarsh's challenge: Navigating Fed independence and Trump's demands\nWASHINGTON (AP) — Kevin Warsh has sought the job of Federal Reserve chair, off and on, since President Donald Trump first considered him for the position nearly a decade ago. Now that he is in line for the position, the enormity of the challenge ahead of him is clear.\nWho is Fed chair nominee Kevin Warsh?\nWASHINGTON (AP) — President Donald Trump says he'll tap former Federal Reserve governor Kevin Warsh as the next Fed chair to replace Jerome Powell in May — with Trump believing that he can finally get the booming economy that he promised to voters.\nUS producer prices rose 0.5% in December, more than expected, on uptick in services inflation\nWASHINGTON (AP) — U.S. wholesale prices rose a hotter-than-expected 0.5% in December.\nEurope sees modest growth, but the weaker US dollar looms as a threat\nFRANKFURT, Germany (AP) — The European economy recorded modest growth at the end of last year, pushing past turmoil over higher U.S. tariffs. But now the economy faces another hurdle: a stronger euro against the dollar that could weigh on exports.\nTrump threatens tariffs on any country selling oil to Cuba, backing Mexico into a corner\nWASHINGTON (AP) — President Donald Trump on Thursday signed an executive order that would impose a tariff on any goods from countries that sell or provide oil to Cuba, a move that could further cripple an island plagued by a deepening energy crisis.\nTrump threatens Canada with 50% tariff on aircraft sold in US, expanding trade war\nWASHINGTON (AP) — President Donald Trump on Thursday threatened Canada with a 50% tariff on any aircraft sold in the U.S., the latest salvo in his trade war with America's northern neighbor as his feud with Prime Minister Mark Carney expands.\nMore consumers are buying or selling gold. What to know about the latest rush and swings in value\nNEW YORK (AP) — The rush for gold climbed to new heights at the start of 2026, with prices hitting a fresh record earlier this week. And around the world, people have lined up to either sell pieces of the precious metal they already own or buy into the frenzy.\nAmEx profits surge 13% as affluent customers splurge on luxury goods and travel\nNEW YORK (AP) — American Express saw its profits grow 13% in the fourth quarter, as the credit card giant continues to benefit from its well-to-do clientele spending heavily on their cards on everything from luxury goods to restaurants to travel.\nApple's iPhone sales surge to new quarterly high despite early missteps in artificial intelligence\nApple's iPhone sales soared to a new quarterly record during the holiday season, despite artificial intelligence blunders that prompted the technology trendsetter to get a helping hand from Google.\nNewsom files a civil rights complaint against Dr. Oz over allegations of hospice fraud\nLOS ANGELES (AP) — California Gov. Gavin Newsom's office is demanding a civil rights investigation of Dr. Mehmet Oz, saying he discriminated against Armenians in a video claiming hospice fraud in Los Angeles, the latest front in the state's ongoing battle with the Trump administration.\nPushed by Trump, US allies are resetting relations with China\nBRUSSELS (AP) — Chinese President Xi Jinping has had a busy few weeks receiving Western allies seeking warmer ties with the world's second-largest economy.\nSenate leaders scramble to save bipartisan deal, avoid a partial shutdown\nWASHINGTON (AP) — Senate leaders were scrambling on Friday to save a bipartisan spending deal and prevent a partial government shutdown this weekend as some Republicans pushed back on a rare deal between President Donald Trump and Democrats.\nGillespie scores 21, Tennessee beats Georgia 86-85 in OT for Barnes' 850th career win\nATHENS, Ga. (AP) — Ja'Kobi Gillespie had 21 points, J.P. Estrella scored five of his 17 points in overtime, and Tennessee beat Georgia 86-85 on Wednesday night for coach Rick Barnes' 850th career victory.\nOle Miss, Vanderbilt flip locations for home-and-home series because of winter storm\nNASHVILLE, Tenn. (AP) — No. 18 Vanderbilt and Mississippi are flipping the locations for their home-and-home men's basketball series because of the impact of last weekend's winter storm.\nNew cold snap adds urgency to winter storm recovery across the South\nBELZONI, Miss. (AP) — Hundreds of National Guard troops in ice-stricken Mississippi and Tennessee mobilized Thursday to clear debris and assist people stranded in cars or stuck at homes still without electricity as the Southern states raced to recover from a crippling winter storm before another blast of dangerous cold hits Friday.\nCrews race to restore power, open roads as the US South braces for another blast of dangerous cold\nJACKSON, Miss. (AP) — Mississippi dispatched 500 National Guard troops to clear roads blocked by fallen trees and Tennessee had nearly 1,000 linemen scrambling to restore power to thousands of Nashville homes as the Southern states raced to recover from a crippling winter storm before another blast of dangerous cold hits Friday.\nFEMA could still support winter storm response in a shutdown, despite administration warnings\nThe Federal Emergency Management Agency would have enough money to respond to the massive winter storm still impacting large swaths of the U.S. even if a partial government shutdown begins at midnight Friday, experts and former FEMA officials said, despite Trump administration warnings to the contrary.\nHouse Republicans propose voting changes as Trump administration eyes the midterms\nWASHINGTON (AP) — House Republicans are proposing sweeping changes to the nation's voting laws, a long-shot priority for President Donald Trump that would impose stricter requirements, including some before Americans vote in the midterm elections in the fall.\nUS appeals court says Noem's decision to end protections for Venezuelans in US was illegal\nA federal appeals court ruled late Wednesday that the Trump administration acted illegally when it ended legal protections that gave hundreds of thousands of people from Venezuela permission to live and work in the United States.\nTesla made smallest annual profit since the pandemic, plans to spend big on robotaxis and robots\nNEW YORK (AP) — Tesla's annual profit plunged to its lowest level since the pandemic five years ago as it lost the title of the world's biggest electric vehicle maker to a Chinese rival and boycotts hammered sales.\nEPA plan would begin rolling back 'good neighbor' rule on downwind pollution from smokestacks\nWASHINGTON (AP) — The Trump administration on Wednesday took a step toward rolling back a rule that limits smokestack emissions that burden downwind areas in neighboring states.\nTrump's border czar suggests a possible drawdown in Minnesota, but only after 'cooperation'\nMINNEAPOLIS (AP) — The Trump administration could reduce the number of immigration enforcement officers in Minnesota, but only if state and local officials cooperate, the president's border czar said Thursday, noting he has \"zero tolerance\" for protesters who assault federal officers or impede the ongoing Twin Cities operation.\nTrump facing growing cultural revolt against immigration crackdown\nNEW YORK (AP) — No longer confined to the partisans and activists, the fierce backlash against Donald Trump's immigration crackdown has begun to break out across American culture, spanning the worlds of business, sports and entertainment.\nNew videos show Alex Pretti scuffle with federal officers in Minneapolis 11 days before his death\nWASHINGTON (AP) — Alex Pretti was forcefully taken to the ground by federal immigration agents after kicking out the tail light of their vehicle during a Minneapolis protest 11 days before he was shot and killed by Border Patrol officers, videos that emerged Wednesday show.\nA shadow network in Minneapolis defies ICE and protects immigrants\nMINNEAPOLIS (AP) — If there's been a soundtrack to life in Minneapolis in recent weeks, it's the shrieking whistles and honking horns of thousands of people following immigration agents across the city.\nBruce Springsteen sings out against Trump in 'Streets of Minneapolis'\nBruce Springsteen is dedicating his new song to the people of Minneapolis, criticizing President Donald Trump's ongoing immigration enforcement operations in the city.\nLayoffs are piling up, heightening worker anxiety. Here are some of the biggest recent job cuts\nNEW YORK (AP) — As layoffs pile up, workers are feeling increasingly anxious about the job market.\nUS applications for jobless benefits, a proxy for layoffs, tick down to 209,000\nWASHINGTON (AP) — U.S. applications for unemployment benefits inched down modestly last week, remaining at historically healthy levels despite recent high-profile layoff announcements.\nSouth Africa declares Israel's deputy ambassador persona non grata, orders him to leave country\nCAPE TOWN, South Africa (AP) — South Africa declared Israel's deputy ambassador persona non grata on Friday and ordered him to leave the country within 72 hours.\nAltria earnings fall short amid lower cigarette sales and competition for nicotine products\nWASHINGTON (AP) — Shares of Altria dipped Thursday after the tobacco giant reported flat earnings due to declining cigarettes sales and challenging competition for newer products, including flavored nicotine pouches.\nNorfolk Southern's profit slips 12% amid merger costs and economic uncertainty\nNorfolk Southern's quarterly profit slipped 12% amid the uncertain economy as well as unusual costs related to its efforts to merge with Union Pacific in an $85 billion deal that would create a transcontinental railroad.\nDow to cut about 4,500 jobs as emphasis shifts to AI and automation\nDow is planning to cut approximately 4,500 jobs as the chemicals maker puts more emphasis on using artificial intelligence and automation in its business.\nMicrosoft beats Wall Street expectations with $81.3B revenue\nREDMOND, Wash. (AP) — Microsoft said Wednesday that its revenue for the October-December quarter was $81.3 billion, up 17% from the same time last year as it furthers its goal to expand global adoption of its artificial intelligence tools.\nHouse Republicans propose stricter voting requirements as Trump administration eyes the midterms\nWASHINGTON (AP) — House Republicans are proposing sweeping changes to the nation's voting laws, a long-shot priority for President Donald Trump that would impose stricter requirements before Americans vote in the midterm elections in the fall.\nTrump eyes basing his new Board of Peace at a Washington building in legal limbo\nWASHINGTON (AP) — The Trump administration is looking at basing the new Board of Peace, which is tied to both the Gaza ceasefire and larger international ambitions, in the Washington building that formerly housed the U.S. Institute of Peace, according to four administration officials.\nFederal troop deployments to US cities cost taxpayers $496M and counting\nWASHINGTON (AP) — The Trump administration's high-profile deployment of federal troops to six U.S. cities has cost taxpayers roughly $496 million through the end of December, and continued deployment could cost over $1 billion for the rest of the year, according to new data from the nonpartisan Congressional Budget Office.\nImmigration was a Republican strength. Now some fear it's slipping away before the midterms\nWASHINGTON (AP) — Republicans are increasingly concerned that immigration enforcement is becoming a political liability in the upcoming midterm elections after two people were killed by federal agents during President Donald Trump's crackdown in Minneapolis.\nEscape from Washington? Senators look to start new chapters as governors\nWASHINGTON (AP) — There's increasingly one place that U.S. senators want to be — anywhere but Washington.\nDemocrats are poised to trigger government shutdown if White House won't meet demands for ICE reform\nWASHINGTON (AP) — Senate Democrats are threatening to block legislation that would fund the Department of Homeland Security and several other agencies Thursday, potentially bringing the government a step closer to a partial shutdown if Republicans and the White House do not agree to new restrictions on President Donald Trump's surge of immigration enforcement.",
  "word_count": 8401,
  "scraped_at": "2026-02-14T12:38:35.103736"
}