{
  "article_id": "187b1b219355",
  "url": "https://www.aol.co.uk/denis-compton-victoria-pendleton-louis-102653098.html",
  "title": "Denis Compton to Victoria Pendleton – Louis Rees - Zammit joins multi - sport stars",
  "date": "20240328T114500Z",
  "domain": "aol.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Denis Compton to Victoria Pendleton – Louis Rees-Zammit joins multi-sport stars\nFormer Wales and British and Irish Lions wing Louis Rees-Zammit is reportedly set to join reigning Super Bowl champions the Kansas City Chiefs.\nThe 23-year-old stunned the world of rugby in January by quitting the sport in an attempt to secure a contract with an NFL team in 2024, and his dream could soon come true.\nHere, the PA news agency looks at some other multi-talented sports stars.\nDenis Compton (cricket and football)\nCompton played 75 Test matches for England, making his debut in 1937 aged 19 and scoring his first century the following year against Don Bradman’s touring Australian side.\nHe had made his Arsenal debut in 1936 and went on to win the league title in 1948 and FA Cup in 1950 with the Gunners, the same year in which he helped Middlesex win the County Championship.\nBabe Didrikson Zaharias (athletics, golf)\nZaharias also excelled at basketball and baseball, but initially made her name in track and field, winning two gold medals and one silver in the 1932 Olympics in Los Angeles.\nZaharias won the javelin comfortably, took the 80 metres hurdles in a world-record time and finished equal first in the high jump before losing the title when her technique was deemed illegal.\nA latecomer to golf, she won more than 50 titles, including the US Women’s Open three times, and co-founded the LPGA.\nLottie Dod (tennis, golf, archery)\nBlue Plaque Rebellion goes live at #Wimbledon today – celebrating Lottie Dod https://t.co/WmQRZbJp1Q pic.twitter.com/hvJloMZFXd\n— Women's Sport Trust (@WomenSportTrust) July 13, 2017\nLottie Dod remains Wimbledon’s youngest women’s singles champion, winning the first of her five titles at just 15 years and 285 days old in 1887.\nLater turning her attention to golf, she won the 1904 British Ladies Amateur title and four years later won a silver medal in archery at the Olympic Games in London, where her brother Willy claimed gold in the men’s event.\nJim Thorpe (athletics, American football, baseball, basketball)\nThe first Native American to win gold for the United States in the Olympics, Thorpe won both the pentathlon and decathlon in Stockholm in 1912.\nHe lost his titles after it emerged he had previously been paid for playing semi-professional baseball, but they were eventually reinstated by the International Olympic Committee.\nThorpe played six seasons in Major League Baseball and for six NFL teams, as well as enjoying a less-well documented spell in professional basketball.\nVictoria Pendleton (cycling and horse racing)\nTwo-time Olympic champion track cyclist Victoria Pendleton announced in March 2015 that she had set her sights on riding in the following year’s Cheltenham Festival.\nShe made her competitive debut in August 2015 and won her first race, on March 2, 2016, on 5-4 favourite Pacha Du Polder at Wincanton.\nPendleton then achieved her stated aim of riding in the Foxhunter Chase at Cheltenham and finished fifth, describing the result as “probably the greatest achievement of my life”.",
  "word_count": 496,
  "scraped_at": "2026-02-14T12:31:45.628304"
}