{
  "article_id": "18ac45570add",
  "url": "https://www.rollingstone.com/politics/politics-features/human-toll-greg-abbott-border-war-eagle-pass-1234975140/",
  "title": "Eagle Pass : The Human Toll of Greg Abbott War at the Border",
  "date": "20240225T161500Z",
  "domain": "rollingstone.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Human Toll of Greg Abbott’s War at the Border\nEAGLE PASS, Texas — The video is 13 seconds long. In the foreground is an orderly green lawn, lit and safe. In the background, there are the lights of Mexico, Coahuila state. In the middle is the river. It’s a void, darker than the night sky.\nAmid crickets, a woman’s voice echoes from the void, or maybe a child’s. Then a man’s. They’re crying out for help.\nThe lawn belongs to former state Rep. Poncho Nevárez (D), who represented Eagle Pass in the Texas Legislature for eight years. Some time back, the state of Texas installed rows of concertina wire, the razor-bladed coiled fencing first invented to control cattle and then to mangle soldiers in the First World War. The wire hadn’t stopped anyone from crossing. Sometimes migrants injured themselves trying to cross. Sometimes it trapped them in the river. It is more dangerous than it looks, especially if you’re hungry and tired, and even more so at night.\nNevárez does that night what anyone with a conscience would do: He tries to help. The wire means he can’t easily reach the river. With difficulty, he makes his way into the void, but he can’t locate the source echoing cries with his flashlight. He calls the Border Patrol, but he knows they don’t do water rescues. The cries die out. In the morning, there is no trace of them.\n****\nGreg Abbott has one of the most impressive collections of toy soldiers in the country. It has always been good to be the governor of Texas, but the rights and privileges of the rank have grown since the turn of the century. Since 9/11, and especially in the last 15 years, the distinguishing feature of the governor’s office is the number of armed men and women it controls. The governor poses them, takes pictures with them, has them march back and forth. That’s the way one looks presidential.\nBut Abbott’s fondness for armed men goes beyond that: It seems to fill something in him that he lacks. Last year, after he suffered one humiliating setback in front of the legislature, he summoned the press to an airfield north of Austin, the state capital. He held a press conference at which he took no questions, and announced that he was sending more soldiers to the border. When it came time for him to do a Fox News spot, he spoke to a camera that was positioned to capture scenes of his soldiers marching onto their transport planes. The vibes were off: It seemed possible Abbott was about to announce the invasion of Poland.\nThe increasing militarization of the border, and the steadily increasing lethality of that militarization, predates Abbott. It began with his predecessor Rick Perry, and was tied up with the changes in American society brought about by the War on Terror, as well as a particularly awful period in Mexico’s drug war. In 2009, the Texas State Police started putting snipers on helicopters along the border. They were trained by vets back from Fallujah and Kandahar, among them Chris Kyle, the “American Sniper.” The chopper gunners were meant to be deployed against drug runners, hypothetically, but in 2012 one of them airholed a truck with nine Guatemalan migrants in the bed, driven by a 14-year-old boy. The survivors were deported, but they told a Guatemalan diplomat that before the shooting started, they had already removed the tarp covering them to show that the truck was transporting people, not drugs.\nThe state quietly shut down the sniper program, but otherwise continued arming. Gunboats, drones, helicopters. Perry was not a border hardliner in the way Abbott was: He had a connection to the older Republican Party whose leaders would still sometimes say things like “family values don’t stop at the Rio Grande,” as did George W. Bush, Perry’s predecessor.\nAbbott took office in 2015, amid one migrant wave, with seemingly no beliefs at all besides a dull kind of ambition that would occasionally lead his aides and advisors to suggest that he would make a fine president or vice president. For a long time, that seemed laughable. It got less funny. He has seized on the border crisis to make himself, for the first time, a future contender. In doing so, he may be changing the country with him.\nAbbott plays with his toy soldiers so much that it has become one of the primary ways of interpreting his mood. On Feb. 4, in Eagle Pass, he presents a formidable but still restrained collection of military hardware. He is holding a press conference along the river in Shelby Park, a 47-acre green space and golf course under one of the international bridges. Shelby Park is the home of the only boat ramp in the area: As such, it used to be a crucial part of operations conducted by the federal Border Patrol. As one of a long series of escalating provocations against the federal government, Abbott seized control of Shelby Park, stuffing it full of state police and the Texas National Guard.\nAs a backdrop to his press conference, there is a tasteful, symmetrical display: An Oshkosh military heavy-lift truck faces the cameras, flanked by two Humvees with armored cupolas. Beside them are two airboats on trailers — not the kind with machine guns that Texas runs down the river. The guns in this diorama are held by soldiers he has arranged in front, maybe a hundred, arranged in rows of two or three to color in the gaps between the machines. They’re in battle dress, body armor and carry rifles.\nThey look bored. These are weekend soldiers, National Guard. When Abbott first called them down here, in 2021, there was a wave of suicides in the Guard, as men and women discovered they would be postponing jobs and weddings to come to the river and do nothing much at all. Abbott said very little about that, but he has tried to make a better show of caring about them. For Thanksgiving last year, he came to the border to hand out meals to his troops — before endorsing former President Donald Trump’s presidential campaign, in front of another display of his military hardware, this time boats and helicopters.\nWe’re all here today because Abbott is adding a new set to his collection: Fourteen Republican governors — mostly from the south, and three from the northern border states of Montana, Idaho, and New Hampshire — are here to praise Abbott for his security operations on the border, and for sticking it in the eye of the Biden administration. Trump’s best hope of being elected in November is to keep the border in the news all year, which means Abbott’s toy cabinet has become an essential part of the Republican Party’s national strategy.\nAbbott speaks: He promises that the occupation of Shelby Park is only the start. Texas would seize control of more of the border, preventing the feds from accessing the river. The conflict over Shelby Park was beginning to look like a fledgling constitutional crisis, as his forces kept denying federal law enforcement access to the river — even when migrants were feared to be drowning. Abbott promised he would escalate. He only ever escalates.\nHe had to, he says, because the threat was so dire, the safety of the nation at risk. America was in “extraordinary danger, imminent danger,” he says. He is the Thin Greg Line. The other day, he says, a man who had “served in the Iranian military” had tried to cross. Who was he — what was his mission? (Nearly all Iranian men, even the most bitter critics of the regime in Tehran, have served in the Iranian military — they’re drafted.) The fact that many trying to cross the river are women and children fleeing sexual and physical violence never comes up. It never does.\nIt was a very effective show, and it played on Fox News for days. The whispering about Abbott as a potential Trump ticketmate — or at least a cabinet secretary — picked up.\nA week later, with the headlines fading a bit, Abbott upped the ante again. The state of Texas would be building a military base near Eagle Pass, to host up to 2,300 soldiers on a permanent base, allowing Abbott and future governors to “amass a large army in a strategic area.” The state calls this a “forward operating base.” That’s War on Terror lingo: FOBs were the satellite bases constructed in-country during the occupations of Iraq and Afghanistan. It spawned the derogatory term “fobbit,” to describe soldiers who never left the creature comforts of the little Americas the military had built in hostile lands.\nTo describe a base in Eagle Pass, though, it’s a little strange. It’s American soil. What is it forward of? It will have plenty of creature comforts, though. The base, The Texas Observer reported, could cost up to $500 million — on top of $10 billion already allocated to Abbott’s border security schemes in the last three years. The base will have “51 dorms, 15 ‘executive suites,’ three command centers, two motor pools, boat maintenance facilities, and a helipad,” along with “a host of amenities including a 15,000-square-foot dining facility with 24-hour service of ‘chef-driven meals’ and ‘buffet style meals,’ a fully equipped fitness center, a recreation center with a library and arcade, an outdoor basketball court, and a sand volleyball court.”\nEven in a rich state like Texas, $500 million is real money. The state’s schools rank among the lowest states in per-student spending, and the state has one of highest uninsured rates in the country. The federal government recently offered the state money for free school lunches this summer; it declined, saying that the relevant agency was too busy throwing two million people off of the state’s Medicaid program to do anything else. Abbott has been governor for a decade, and it is difficult to say what he has succeeded in doing to improve the lives of his constituents. His legacy consists entirely of keeping a few people out, at fabulous expense.\n****\nNevárez, the former state lawmaker, flew back to Eagle Pass the day of the governor’s press conference. “All the big dick planes were at the airport, which I’d never seen,” he says. “And, of course, our governor’s is the biggest one, he’s in a G5” — that is, a Gulfstream V, a top-of-the-line business jet. Abbott, of course, had the shortest distance to travel. “This is his big fucking show, right?” says Nevárez. “He can’t show up in some piece of shit.”\nNevárez is a one-of-a-kind Texas character who harbors the sneaking suspicion that many Texans don’t think he’s one of them, in the same way they may not think of Eagle Pass as Texas. He grew up here and in Piedras Negras, across the Mexican border, and travels between the two constantly, like many who live here. The towns have two names but function as one city. His law practice is in Eagle Pass. He records music in a studio across the river.\nHe served in the Texas House for ten years, as a rambunctious and often outspoken Democrat who was often more conservative than other members of his party. In 2017, when a Republican colleague bragged that he had called Immigration and Customs Enforcement on immigration protesters in the House gallery, he and Nevárez nearly brawled on the floor. (The Republican, Matt Rinaldi, threatened to shoot him. He now leads the Republican Party of Texas.)\nNevárez enjoyed Austin more and more, and then too much. In 2019, when passing through a special security entrance at the capital airport for lawmakers, he dropped an envelope from his office with cocaine in it. He didn’t run for election.\nHe’s sober these days, and unlike most sitting Texas lawmakers, now seems happy and well-adjusted. But that’s tempered by the frustration of being out of power while the governor turns his hometown into a military camp. There are the minor frustrations — when we drive around town, he points out state troopers sent by Florida Gov. Ron DeSantis (R), recognizable by their Dodge Chargers. There are the more existential ones — the slow, dawning realization that the camp may prove integral to Trump’s return to power, and that Abbott might have found a way to join him there. That’s to say nothing of the more grave problems, like the floundering migrants calling out to him in the middle of the night.\nWhat drives Abbott, I ask? I’ve been writing about him for ten years, and I still can’t detect much in him other than an insensitivity to other people’s suffering and an unfocused ambition that comes out mostly as a desire to see other powerful men bend the knee. Maybe that’s all there is, says Nevárez. He notes that Abbott has always been “very well protected” politically. “He basically was protected into the governorship,” Nevárez says. “They ran off other would-be challengers. He had a lot of people around to run a lot of interference for him.” Abbott rose almost purely by momentum to become the governor of what might be the most important state in the country, and wins reelection effortlessly. “What does that do to somebody, their ego, their ambition?” asks Nevárez.\nAbbott’s political instincts are both “terrible and amazing,” he says. “These are all fucking awful things he does and says and promotes. They only seem to work for a small segment of the state. And they defy, you know, humanity and goodness on a lot of levels. They defy good government and fiscal responsibility.” He gives as an example the state’s foster care system, which regularly sees little kids — citizens, as if that matters — drowned and beaten to death because Texas can’t figure out how to hire enough caseworkers. “In the case of these foster kids, they defy morality at its core.”\n“He’s suffered from none of it and probably will never suffer,” Nevárez continues. “These decisions he’s made are all fucking awful, but they’re incredibly effective — they work.” So far, the standoff in Eagle Pass has been effective too. Abbott’s approval rating in Texas is close to the highest it’s ever been, no small feat given how long he has been in office. Most importantly, the border standoff has helped him consolidate support among the right wing of his party, which has often been shaky in the last decade.\nAsk Americans what they think about the border, and it’s a mess. There’s agreement that the border should be secure. But even Texans — much less folks in Michigan — don’t necessarily know what that means or how to get there. They may not know what asylum is. This issue isn’t in most people’s vocabulary. They may not know that many folks who try to cross the river are trying to turn themselves in to authorities. They may not know that the border was essentially open a few generations ago, and that it is more locked down today than it has ever been. The confusion makes this fertile ground for politicians like Abbott and Trump.\nThere’s confusion in Eagle Pass, too. There have been times in the past few years where migrants and asylum-seekers seemed to overrun the city, and the situation was clearly untenable. But in general, crossings aren’t as numerous here as they are in far south Texas or the California and Arizona borders. The periodic crises and the often oppressive presence of security forces here has created a kind of “psychosis,” Nevárez says. Residents get frustrated. When there’s a surge of crossings, the international bridge may close, which means people can’t work or see relatives. The town’s economy depends on the bridge. Then, he says, you start to hear “fuck those people.” Maybe “you go to the emergency room to get stitches and you walk in there and there’s 20 migrants in there,” he says.\nThat’s a sentiment you hear all over the state, complaints about migrants accessing already-strained services, sometimes with darker overtones: A man at a rally once told me he often checked the maternity ward at his failing, local rural hospital to see how many brown women were giving birth. Instead of asking why his rural hospital was failing, in such a rich state, he blamed those he thought were newcomers.\nWhat’s different in Eagle Pass is that folks also regularly come into contact with migrants when they’re at their lowest, and most in need of help. “People can be shitty,” Nevárez says, “but individually there’s a lot of compassion for the migrants. People help them in whatever way they can.” One Christmas Eve, a group of Hondurans, including a family of four, crossed the river onto Nevárez’s ranch. “We were just about to eat,” he recounts. “So we invited them to dinner.”\n“It was one of the best Christmases we’ve had since my mother-in law died, since my sister died,” he says. They had been on a harrowing and terrifying journey and stumbled across the border onto exactly the right spot at exactly the right time. “The daughter was four or five,” he says. “We gave her gifts.” Another was a teenage girl. Some of the men were so emaciated they could fit in the donated clothes of Nevárez’s son. Some of the traumas they had encountered on the journey they could speak about; others they couldn’t. Fed, clothed, and finally safe, he says they were eventually pointed in the way of the border patrol.\nThere were many others. Months before, a 12-year-old girl and an 8-year-old boy came across. They had the phone number of relatives in Florida written on their arms. Nevárez says he got them happy meals and put them on the phone with family members, with whom they had been out of touch for days. He gets quiet, and has to collect himself. “The sound of their voices on the other line,” he says, he’ll never forget. “I didn’t want to cry in front of them.”\nHe helped when he could, in part to keep crossers from cutting his fence. But he, too, got annoyed. When the state came to ask him if it could put concertina wire on his land, he let them. “Biggest mistake I’ve ever made,” he says. The wire didn’t stop anybody from coming. The wire was laid down on a Thursday, he says. On Sunday, he was at the ranch. Up walks a “17-year-old girl with a 2-year-old child. And she’s pregnant. She was all cut up, but she had beat the concertina wire. And that’s when I realized it was worthless,” he says.\nHe would pull down the wire, if he could. But the state will not remove it. “I must have had fucking rocks in my head, letting them do that.” Belatedly, he realized that there was something worse than migrants cutting the fences on his ranch — that he had become implicated in moral injury. So, ultimately, are we.\n****\nMembers of the Border Patrol often call migrants “tonks.” The word has been in use for decades, and it’s not completely clear where it comes from. Some say that it’s an acronym, for something like “traveler outside native country.” But the “broadest consensus among those familiar with it,” HuffPost explained recently, “is that the slur comes from the sound made by slamming a heavy-duty flashlight or baton over a migrant’s head.” The agency has repeatedly tried to crack down on that kind of talk within the agency, but it doesn’t hold.\nThe slurs are, in a sense, adaptive, protective. To do the job the nation has asked them to do, they can’t allow themselves to see the migrants as fully human. Ten years of sharing jokes about using mag-lite flashlights on “an influx of rats,” as one agent put it in records obtained by HuffPost, can prepare a person to do their job when new bosses instruct agents to remove young children from their parents without a guarantee that they would ever be returned, as the Trump administration did.\nWhen Abbott sent state police to the border, he sent personnel who had not been trained to do their jobs in the same way. And he asked them to do more grisly and demoralizing work, by taking steps to make the river more lethal. There was the initial wave of suicides. Last summer, during one of the state’s worst-ever heat waves, a state trooper blew the whistle, writing to a superior that, with the introduction of razor-wire traps along the riverbank, “we have stepped over a line into the inhumane.”\nThe trooper wrote, in an email obtained by the Houston Chronicle, that “a pregnant woman having a miscarriage was found late last month caught in the wire, doubled over in pain. A four-year-old girl passed out from heat exhaustion after she tried to go through it and was pushed back by Texas National Guard soldiers. A teenager broke his leg trying to navigate the water around the wire and had to be carried by his father.” The Department of Public Safety, which is run and staffed by allies of the governor, offered a series of obfuscatory responses to the report — and then, in the following year, doubled down.\nEvery few months for the last few years, a horrible new report echoes from the river and creates the possibility that things have bottomed out — that the folks in charge might finally back off. But the crescendo keeps building.\nOn a right-wing radio show recently, the governor was asked what else the state could do at the border. “The only thing that we’re not doing is we’re not shooting people who come across the border,” Abbott said, “because of course, the Biden administration would charge us with murder.” His readiness with the answer gave the impression he had given it some serious thought.\nLast week, Texas Attorney General Ken Paxton (R), who has been under indictment for felony securities fraud for ten years without going to trial and was recently impeached by the Republican House, launched a bid to shut down a Catholic charity in El Paso. The charity, Annunciation House, helps give aid to migrants once they’ve reached the United States, in accordance with the law.\nThe whole political apparatus of Texas is out to get migrants — and anyone who may feel empathy for them. And it may all be prologue. The Trump campaign’s plan for immigration in his second term is to mobilize the National Guard in red states and use them to round-up migrants for deportation. Abbott may have given him a model.\n****\nOne afternoon, I cross to Piedras Negras. There’s a shelter for migrants here run by a Catholic order that tries to patch up the weary before they make the final jump. Nevárez tells me it was swarmed with people during the migrant surges a few months back, but I haven’t been able to reach the shelter by phone or email. The building is shut up, and there’s no one on the street at all.\nMigrant crossings have plummeted near Eagle Pass recently. The changes responsible have come from the Mexican side. Mexican soldiers man the riverbank, facing the Americans. There are checkpoints into town, and the Mexican security services are cracking the skulls of anybody who looks like they might be heading to Shelby Park. Only the Mexican government knows why. Perhaps the Biden administration has pressured them to direct migrants away from Abbott’s hot spot. Maybe they just want to keep commerce running. The world’s largest brewery is in Coahuila nearby, pumping out Corona for Americans. The beer must flow.\nAbbott has taken credit, but the credit is a consolation prize. He needs migrants to keep coming — he needs the footage to horrify Americans and raise his own stock in the minds of fearful people. Their suffering greases the gears of his political machine. By steering migrants away from Shelby Park, they’ve quietly sabotaged him. But that also means he will have to look for bigger and crazier stunts — particularly as the presidential election ramps up.\nThere are two ironies about Shelby Park, cast by the governor as the hot frontier between civilization and anarchy. The first is that the park is named after an illegal immigrant — one of ours. General Joseph Shelby fled south after the Confederacy was beaten and, instead of surrendering to Yankees, buried his battle flag in the Rio Grande and plunged into Mexico with some of his surviving soldiers, serving an illegitimate government there before his services were no longer required.\nThe second is that facing Shelby Park across the river is an American football stadium, the kind you might find at a small Texas high school, except more cheerful and vibrantly colored, blue and yellow. Nevárez’s son plays here. He helps coach the team in the evenings. (Because of Taylor Swift, he says, all the kids now want to be tight ends.)\nWe walk to the waterfront. There’s many rows of concertina wire. The state of Texas has spent millions of dollars securing Shelby Park. But even still, everywhere there’s wire, there’s still land that a migrant could reach — just enough. “Imagine all the fucking shitty things that had to have had to have happened to you for you to make it here,” Nevárez says. “Of course you’re going to try to cross. They’ll always try to cross.”\nThe square in Piedras Negras near the International Bridge is clean and safe. It’s decorated for Valentine’s Day. In a beautiful old Catholic church nearby, a priest is applying the marks of Ash Wednesday on parishioners young and old. The bells play Ave Maria. Before crossing back to the Land of the Free, I walk to the side of the bridge. Up the river, to the left, Nevárez’s team was starting to practice under warm lights. Across the river, beyond the rows of concertina wire, Shelby Park was blacked out, cold and dark.",
  "word_count": 4346,
  "scraped_at": "2026-02-14T14:10:56.945234"
}