{
  "article_id": "18b815c9dbab",
  "url": "https://www.hellomagazine.com/royalty/494359/prince-william-pens-personal-message-special-reason/",
  "title": "Prince William pens personal message during family break for special reason – details",
  "date": "20230531T194500Z",
  "domain": "hellomagazine.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Prince William took to Twitter on Wednesday evening to post a rare personal message for a reason close to his heart.\nThe Prince of Wales is a long-time Aston Villa fan, and he reposted a tweet from the club about player Ashley Young, which read: \"A true Aston Villa legend [handshake emoji]. Thank you for everything, @Youngy18 [purple heart emoji].\"\nWilliam sweetly added to his retweet: \"Ash, thank you for the memories. W.\"\nIt was announced earlier in the day that Ashley is set to leave the club after a two-year stint and fans loved the Prince's kind tribute, with one commenting: \"From a future King to a current King [crown emoji]\" and another agreeing: \"Kings recognise kings\". \"Spot on, Sir,\" replied a third, while the fourth added: \"Love this\".\nPrince William posted a heartfelt message\nIt's been a big day for football news, with the dad-of-three previously sharing his excitement about the selection of the England women's team for the 2023 World Cup.\nWilliam wrote: \"An exciting summer ahead for a team that's already achieved so much and inspired so many. Congratulations to every member of the @Lionesses squad and good luck! W.\"\nThe Prince of Wales, who is the chairman of the FA, presented the trophy to Chelsea after they won the winning team of the Women's FA Cup final at Wembley earlier this month, although it came after some personal disappointment as the team Chelsea beat Aston Villa 1-0 to reach the final where they emerged victorious against Manchester United.\nEarlier on Wednesday, the Prince of Wales also interrupted his half-term break from royal duties to make an announcement about one of his key projects.\nIn a retweet from William's official royal Twitter account on Tuesday, it was confirmed that the Earthshot Prize has partnered with YouTube \"to produce content which inspires users to drive action against climate change with stories of urgent optimism from around the world\".\nThe Earthshot Prize was founded by the Prince and The Royal Foundation in 2020 to find solutions to \"repair\" the planet. The YouTube channel will share mini-documentaries, Q&As and YouTube Shorts to help the Prize reach younger and more international audiences.\nSEE: Prince William's latest video sparks big reaction from royal fans\nIn a statement, the Prince said: \"The Earthshot Prize is all about showing the world that solutions to some of the biggest environmental challenges we face are out there.\n\"After two years of discovering impactful ideas and innovations, I am delighted that The Earthshot Prize is travelling to Singapore, where the ground-breaking solutions of our 2023 Finalists will be celebrated.\"\nAs is tradition, the five Winners of The Earthshot Prize 2023 will be awarded £1million in prize money to further boost their environmental solutions.\nThe glitzy ceremony is set to feature a variety of impressive performances from world-renowned musicians and artists. For the first time this year, the awards ceremony will be accompanied by a week-long series of events dubbed Earthshot Week.\nThese events will be aimed at mobilising and scaling innovative solutions to protect and repair the planet. Members of the public will also be invited to experience local activations centred on the 2023 cohort of Earthshot Prize solutions.\nWant to keep up to date with the latest stories? Sign up to our HELLO! Newsletters today.",
  "word_count": 550,
  "scraped_at": "2026-02-14T12:55:06.057443"
}