{
  "article_id": "18e8c64ad58d",
  "url": "https://www.irishnews.com/lifestyle/tvandradio/2023/06/14/news/sky_s_the_limit_for_robin_elliott_as_chatshow_airs_on_satellite_giant-3342622/",
  "title": "Sky the limit for Robin Elliott as chatshow airs on satellite giant",
  "date": "20230613T123000Z",
  "domain": "irishnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Robin Elliott’s popular local TV show has just gone national and the 44-year-old presenter rightly feels proud. Robin Elliott Live has a potential to reach audiences in up to 14 million homes right across the UK, up from the show’s previous NVTV reach of 100,000 homes a week.\nIt’s particularly sweet as he later recalls in an Ormeau Road cafe that one of his tutors at Belfast Met predicted he’d end up reading the traffic reports on local radio. “It does feel good although I was slightly nervous.”\nThe first programme, which aired on June 5, is bright, entertaining, and features a revealing interview with Calum Best.\n“He gave me good material, talking about his hair transplant and he now has a full head of hair thanks to a transfer from his beard,\" says Elliott.\n\"Calum Best also talked about his father and about managing a women’s football team.”\nIt gives Lorraine a run for her money with a fun item from Kim Kelly on whether men or women are more to blame for extra-marital affairs, based on American research, then a fairly serious interview with Mr Motivator (who quips to Elliott, \"Nice to see my body double....\") about encouraging blind and partially sighted people to do exercise.\nWhile planning his launch, Elliott wondered whether to feature more material from Britain: “In the end, though, I decided to remain pretty focused on here and showcase Northern Ireland, the best of our place.”\nHe borrowed the newest top of the range Mercedes from a mate and escorted guest stand-up Janey Godley around town in it, filming their experience for our entertainment.\nElliott’s interest in television started young, very young. As a toddler, he was transfixed by Coronation Street: “From the age of two, I was obsessed by the early days of Elsie Tanner on repeat.” She was The Street’s femme fatale, played by the late great Pat Phoenix, an actress who later married Tony Blair’s father-in-law.\nRobin Elliott was born to Northern Irish parents in Scotland before his father, also called Robin and a senior fireman, moved the family to a part of England, Bath, which features heavily in Jane Austen’s output.\nHe notes with a laugh: “Yes, it was fairly posh. My parents left Belfast in the '70s during the Troubles. We ended up in Bath living quite near Jane Seymour who had a fabulous big house, where Robbie Williams recorded Angels.\n\"Later on when I interviewed Midge Ure, and I discovered we virtually lived beside each other and he told me Phil Lynott of Thin Lizzy was in the area; of course, he died in the '80s and I was too young to know about that.”\nEvery summer, Robin and his family decamped to the place his parents regarded as home: \"I remember at school when after the holidays friends said they’d been to Italy or the south of France or Disneyworld or Spain, I said I’d been to Belfast where there were soldiers at checkpoints pointing guns at you, and bombs.”\nThe contrast was acute. “It was scary, but we got to visit family,” he remembers.\nMedia was always going to be his career. “Somebody once asked me how I got into radio and I said it was by accident,\" he says.\n\"But from an early age, I wrote stories and sketches, put on little shows, so in a way it wasn’t. What we really do is storytelling.”\nHe adds that music also influenced him, as it does now. “I was fascinated by my father’s record collection and listened to the Rolling Stones, Status Quo, I started putting tapes together and when we had long journeys in the car, would try to compile a mixtape.”\nAfter attending the appropriately named John Logie Baird primary school in Helensburgh, Scotland – home town of the inventor of television – Elliott went to secondary school in Bath: “The teachers there encouraged me and I played a slave boy looking after the king in Joseph.”\nHe decided to come to Northern Ireland and attend Belfast Met. “I did performing arts, got a BTEC where there were magnificent tutors like Aidan Browne of UTV and Maggie Cronin, both of whom became friends.”\nWhile waiting to start his drama degree at Queen’s, Elliott started a journalism course. We move on to the discuss the Schofield affair. “Eamonn Holmes made a good initial Tweet but hasn’t shut up since on GB News,\" offers Elliott.\n\"It is about an abuse of power. I like the This Morning format, on which my show is based, but I think it’s time for Holly Willoughby to go. I love Josie but am not a massive fan of the pairing of Dermot O’Leary and Alison Hammond.\n\"I think Paddy Kielty and his wife Cat Deeley should present it Monday to Thursday, then he could fly to Dublin on Friday to do The Late Late Show.”\nKielty is one of the first people Elliott interviewed and he has found him a nice, generous interviewee: “I was doing a Pat Jennings live show at Newry and everyone was paying tribute. Kielty came onscreen and behaved as if Pat was dead, then coming off and saying ‘He’s not dead?’ It was very funny but only Kielty could have got away with it.”\nIn terms of attracting top names to Robin Elliott Tonight, the host is optimistic. The time factor is a bit of an issue, he explains. “Sixty minutes becomes 53 minutes, then 48 minutes, with advertising. I need to do music, the arts plus local news items.\"\nIn terms of interviewing technique, Elliott favours the softly softly rather than the adversarial approach: “I don’t like that, it shuts people down. It’s a chat rather than an interview. I do my research but I don’t sit and write questions down.\n\"It surprises me sometimes when people are in the studio and forget they’re on TV. That’s when the magic happens. Paul Martin, the journalist, talked to me about his career and when I asked him whether gambling became an addiction, he said, yes, it had. And said he had never told anybody that except for family and friends – it was TV gold.”\nThere may be an Elliott media dynasty shaping up as Robin’s 16-year-old daughter, Ciena, is keen on performing. She has done music lessons with Robin’s now wife, Pauline Carville, and was in a panto with them last year.\n“It was Aladdin at the Crescent Arts Centre, I played the villain, I had to get my friend Rose Marie the singer in, somebody dropped out and Pauline played the Empress and I said, ‘Let’s keep the family together, it’s Christmas.’ so Ciena played a junior role. She absolutely loved it.”\nRobin Elliott Tonight airs on Mondays at 9pm on Sky 181 as well as Freeview channel 7 and Virgin 159, featuring celebrity guests, entertainment news and music.",
  "word_count": 1146,
  "scraped_at": "2026-02-14T13:08:27.797890"
}