{
  "article_id": "18f1e06b914d",
  "url": "https://www.myjoyonline.com/spains-bonmati-suffers-broken-leg-in-training/",
  "title": "Spain Bonmati suffers broken leg in training",
  "date": "20251201T051500Z",
  "domain": "myjoyonline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Audio By Carbonatix\nSpain midfielder Aitana Bonmati is set for a lengthy spell on the sidelines after breaking her leg in training.\nThe 27-year-old fell awkwardly during a morning practice session at the national team's training base in Las Rozas, Madrid, on Sunday.\nSpain were preparing for the second leg of their UEFA Women's Nations League final against Germany at the Estadio Metropolitano on 2 December.\nBonmati played 77 minutes of last Friday's first leg, which finished goalless, in Kaiserslautern.\nA statement from the Royal Spanish Football Federation said that \"following tests carried out by the medical services\", Bonmati was \"diagnosed with a fracture in her left fibula\".\nBonmati will return to Barcelona to begin her rehabilitation, and the injury setback is a disappointing end to what has otherwise been a stellar year for the player.\nShe became the first player to win the women's Ballon d'Or three times, achieved a domestic treble with Barca and reached the Euro 2025 final with Spain.\nBonmati was also named the Champions League's player of the season by UEFA.\nLatest Stories\n-\n‘Behind The Lens with Queen Liz’ explores the true meaning of Valentine’s Day, Love, Lust or Legacy?\n2 minutes -\n‘I wanted to be an architect but ended up as a nurse’ – Diana Hamilton reveals\n52 minutes -\nFrom wards to worship: Diana Hamilton reveals how nursing school shaped her destiny\n1 hour -\nMahama demands binding deadlines for African reparations\n2 hours -\nThis is not the time to settle political scores – Bawumia to government\n3 hours -\n5 definitive Valentine’s Day gifts to win your lover’s heart in Ghana\n3 hours -\n37% of SHS students exposed to drugs – Opare-Addo\n3 hours -\nNLC secures court injunction against striking tertiary unions\n4 hours -\nOSP says it remains guided by law after INTERPOL deletes Ofori-Atta’s Red Notice\n4 hours -\nWaiting in the Ring: life inside Bukom’s halted boxing scene\n4 hours -\nRed Notice cancellation: OSP official fires back at Ofori-Atta’s lawyers\n5 hours -\nOfori-Atta saga: Red Notice ends after arrest – OSP official clarifies\n5 hours -\nAAG raises alarm over billboard demolitions, calls for presidential intervention\n6 hours -\nHealth Minister to chair probe into ‘No Bed Syndrome’ death; promises system overhaul\n6 hours -\nPrime Insight to tackle ‘galamsey tax’ debate, cocoa reforms and Ayawaso East fallout this Saturday\n6 hours",
  "word_count": 400,
  "scraped_at": "2026-02-14T12:50:49.873215"
}