{
  "article_id": "18f5ed250309",
  "url": "https://www.ledburyreporter.co.uk/news/25719005.10-quiz-questions-2025-celebrity-traitors-oscars/",
  "title": "10 quiz questions on 2025 from Celebrity Traitors to Oscars",
  "date": "20251229T083000Z",
  "domain": "ledburyreporter.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Before we head into 2026, we thought it would be a great opportunity to take a look back at some of the trends and key moments that took place between January and December this year.\nDid you fully immerse yourself in Celebrity Traitors or did you cheer on the Lionesses at the Women's Euros this summer? Well, now you can test your knowledge of the year’s events.\nWith 10 fun questions, you can cast your mind back and try to get all the questions correct.\nFrom sport and TV to food and celebrities, we’ve got a variety of topics covered.\nPub quiz tips\n10 questions as we look back on 2025 with our quiz\nTo pass our quiz, you'll need to brush up on some sports, entertainment and film knowledge.\nThe Celebrity Traitors final gripped the nation with twists and turns which ended in comedian and TV presenter Alan Carr winning a large sum of prize money for his chosen charity.\nAlthough he made it all the way, he said his agent was sceptical about how far he'd get in the game show.\nSpeaking about the victory on the visual podcast, Uncloaked, Carr said he didn't expect to get far: “No, no, no, no, I did not even think I would get this far.\n“My agent had actually booked in things for the second week saying, ‘With your poker face you’ll be out’.\n“I go through customs I start sweating, when I go to a newsagents and it says no shoplifting.\n“I’ve got the worst poker face going, it’s a tug of war with my face.”\nOver in the sporting world, the nation cheered on the Lionesses as they were crowned back-to-back Women's Euros champions.\nEngland boss Sarina Wiegman was named women’s coach of the year at The Best FIFA Football Awards after leading the Lionesses to their Euro 2025 success.\nWiegman won the honour for a record-extending fifth time after England retained their European Championship crown with a dramatic final victory.\nHugely successful films were released in 2025, including Wicked, starring the likes of Cynthia Erivo.\nThe Tony-winning theatre and film star plays green witch Elphaba in Jon M Chu’s two-part adaptation of the Broadway hit, which is loosely based on Gregory Maguire’s 1995 novel of the same name.\nWicked: For Good, the second instalment, was released in November.\nTest your knowledge with our 2025 quiz\nSo if you think you have what it takes to be the 2025 quiz master, find out now and take our quiz.\nDid you get 10/10 or was it a tough round for you?\nIf you liked that quiz, you can see how British you are with the UK’s citizenship test.\nRecommended reading:\n- Do you have 20/20 vision? Find this hidden number in 30 seconds to find out\n- Unusual and rare road signs quiz: Can you identify them all?\nWhat is the history of the pub quiz?\nAre you a keen quizzer? The pub quiz has been around since the 1970s.\nIt's believed to have originated from a company called Burns and Porter which would share their quizzes in the 70s in order to encourage more regular visitors.\nThe regular pub quizzes saw pub numbers rise from 30 teams a week to a peak of 10,000 teams.\nBurns and Porter went on to publish their own line of pub quiz books and would continue to host weekly quizzes.\nHow well did you do? Let us know in the comments below.",
  "word_count": 579,
  "scraped_at": "2026-02-14T13:07:16.665434"
}