{
  "article_id": "190072d17445",
  "url": "https://www.mauinews.com/wire/?category=5190&ID=379114",
  "title": "Fans of other schools rejoice at ACC title game as Duke win increases CFP uncertainty | News , Sports , Jobs",
  "date": "20251207T203000Z",
  "domain": "mauinews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Fans of other schools rejoice at ACC title game as Duke win increases CFP uncertainty\nBy AARON BEARD AP Sports Writer\nCHARLOTTE, N.C. (AP) — It wasn’t hard to spot Ben Overby and James Turner as they weaved through the stands at Saturday night’s Atlantic Coast Conference championship game between No. 16 Virginia and Duke.\nThey were proudly wearing the purple of their alma mater, James Madison, which could potentially make the College Football Playoff thanks to the Blue Devils’ victory.\n“Nothing against UVA,” Turner said excitedly, “but we’re just here to support Duke.”\nConsider it a product of this most unlikely of pairings to determine the ACC title — Duke won 27-20 in overtime for its first outright league crown since 1962 — and the league’s uncertain standing for bids to the 12-team CFP. And that meant Saturday’s game attracted its share of curious onlookers, eager to see witness how it all might work out and how it might impact their favorite team.\nA validating two bids for the ACC? Just one? A “doomsday” scenario of getting shut out of the playoff entirely? They were all seemingly in play. The only certainty was a Virginia win would secure a CFP bid for a team that was picked to finish 14th in the league in the preseason, leaving Miami to wait.\nAnd now, after the five-loss Blue Devils claimed the first overtime championship game in ACC history, everyone must wait for Sunday’s unveiling of the bracket to find out whether a Power Four champion really could miss the CFP in favor of a second Group of Five winner in JMU.\n“Power Four wins are important,” Duke defensive end Wesley Williams said. “We’re a power conference, we’re conference champions, simple as that. We’re a tough team that deserves a chance.”\nChampionship bid?\nACC commissioner Jim Phillips had argued this week that his league deserved two bids: one for No. 12 Miami as the league’s highest-ranked team, the other for the Duke-Virginia winner as the league’s champion. Duke coach Manny Diaz had made the case, too, for the Blue Devils if they beat a 10-2 team ranked 17th by the CFP.\nStill soaked from the postgame celebration, Diaz did so again early Sunday, now with a complete resume.\n“That’s the whole point of why you play a Power Four schedule,” he said. “There’s a reason why these coaches are all leaving to go take Power Four jobs. There’s a recognition that that’s where the best competition is, and that’s no different than it is in our league.”\nYet Duke, which won a five-way tiebreaker to play in the ACC title game, entered Saturday unranked by the CFP selection committee. And JMU sat at No. 25 before beating Troy for the Sun Belt Conference title in a 12-1 season a night earlier, raising the possibility that the Dukes might out-duke Duke for the last of the automatic bids that go to the five highest-ranked conference champions.\nCompeting hopes\nThe tantalizing possibility had Overby buying tickets for the ACC title game days before the Sun Belt finale, just in case the Dukes moved closer to history.\nTurner waited until Friday night, once JMU asserted control against Troy.\n“We won the SBC, check that off,” said Overby, who like Turner is an accountant living in Charlotte. “But to make it to the CFP as a Group of Five team, that would be amazing.”\nThey weren’t the only fans in Charlotte closely watching and wondering what might happen next for teams that weren’t even on the field.\nShaun Harris stood out, too, from his front-row seat as he sported a custom orange No. 10 jersey of his beloved Miami. The regional account manager for a specialty pharmacy company has been buying tickets to the ACC title game for years in hopes the Hurricanes would get back here, roughly 100 miles from his Greenville, South Carolina, home.\nYet as he found himself sitting in a section filled with blue-clad Duke fans — “I’m literally sitting in the belly of the beast,” he said — Harris couldn’t stop thinking through the mistakes from the two losses that kept the highly ranked Hurricanes out of this game.\nWorse, those losses to Louisville and SMU could also keep Miami out of the CFP, even with a head-to-head win against the Notre Dame team in direct competition with the Hurricanes for a bid.\nHe held out hope that a Duke win might help the Hurricanes, with JMU getting the fifth champion’s bid and increasing the odds that the committee would choose Miami to avoid leaving out the ACC altogether.\n“It’s self-inflicted, so we really shouldn’t be in this situation,” Harris said, later adding: “You asked, I’m not optimistic.”\nWaiting game\nUltimately, Duke’s argument for a playoff bid leans on strength of schedule.\nNotably, Duke has seven wins against ACC teams compared to James Madison losing its only game against a Power Four opponent (at ACC member Louisville). And only two of JMU’s wins came against teams with a winning record, compared to Duke’s five.\nDuke athletic director Nina King served as chairwoman of the selection committee for the NCAA women’s basketball tournament from 2020-22, so she understands the “complicated” evaluation ahead for the CFP committee.\nStill, she said she’d be “disappointed” if the committee bypasses Duke, adding it would be “a disservice” to the title game’s significance.\n“Absolutely I think we’re deserving,” King said, standing on the field with celebrating Duke players. “But I fully appreciate the challenge the committee has in front of them.”\n___\nGet poll alerts and updates on the AP Top 25 throughout the season. Sign up here and here (AP News mobile app). AP college football: https://apnews.com/hub/ap-top-25-college-football-poll and https://apnews.com/hub/college-football",
  "word_count": 953,
  "scraped_at": "2026-02-14T12:50:46.427073"
}