{
  "article_id": "19152fda8ac3",
  "url": "https://www.texasmonthly.com/being-texan/the-power-and-the-glory-of-billy-graham/",
  "title": "The Power and the Glory of Billy Graham – Texas Monthly",
  "date": "20230904T164500Z",
  "domain": "texasmonthly.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This story is from Texas Monthly’s archives. We have left the text as it was originally published to maintain a clear historical record. Read more here about our archive digitization project.\nI can scarcely remember a time when revivals and revivalists did not fascinate me. As a small boy in Devine, Texas, in the late forties, I relished having the visiting evangelist over to our house for dinner during the annual “gospel meeting.” When the Baptists held a revival down the street, I often dropped in for a sermon or two, and numerous times I stood at the edge of a Pentecostal tent, wondering what might be going on inside the minds and bodies of the folk being whipped into a holy-rolling frenzy by the sweating, shouting, shirt-sleeved man striding back and forth on the flimsy little stage.\nI didn’t hold any revivals myself until I was fourteen, but they were authentic for their time and place—held in the open air, illuminated by yellow bulbs, with the crowd seated on wooden-slatted church pews and singing from tattered softback songbooks. Not all of my outings were a success. One dismal, week-long revival seldom brought more than a dozen people out to sit in the oppressive August heat, and it was hard to be confident I had the full attention even of this faithful remnant, since the bare, unfrosted floodlight directly over my head not only drew hundreds of night bugs but, with the intense glow of its high wattage, fairly baked my crew-cut scalp and forced my auditors to look off to one side to avoid permanent damage to their stricken eyes.\nStill, I was a pretty good speaker and my sermons were of sufficient quality to have merited previous publication—one of my favorites featured a stinging attack on the Bolsheviks—and when nice ladies said, “I’d sure love to hear you preach twenty years from now,” I never doubted that they would have the chance. As it happens, I don’t preach much anymore, but I am still intrigued by those who do and are really good at it. So I felt more than normal anticipation as I stood not long ago in the crowded lobby of the Jackson Hilton Hotel, waiting for a ride out to Mississippi Memorial Stadium to hear the world’s most famous preacher, Billy Graham.\nFor despite the small-town ambience and the Deep South setting, this was not some jackleg country preacher we were going out to hear, and the service would not have much in common with an old-fashioned camp meeting. This was, measured by results achieved during his own lifetime, the most successful evangelist in the history of Christianity. And the same sermon we would hear in a few minutes would eventually be heard and seen on television broadcasts around the world. Given their attitude toward popes and such, evangelicals are not likely to elect a pope anytime soon, but if they did, the only possible choice would be Billy Graham, who has been for almost thirty years not just the unquestioned symbol but also the single most dominating influence and power within the evangelical movement.\nI caught a ride with a carful of Baptist preachers, who worried about the dark rain clouds, counted buses bringing pilgrims in from all over the state, and wondered whether the Lord could draw a bigger crowd with Jerry Clower than he had two nights earlier with Johnny Cash and June Carter. At the stadium, the late evening sun and heavy overcast made the turf appear intensely green and heightened the sense that this was a numinous event. In the center of the field, backed up along one sideline, was the large blue-draped platform from which Billy Graham would speak. Light and sound towers stood in front on each side, and a small television studio had been built into the rear portion of the structure. Stretched across the top of the stadium a banner proclaimed, “He is the Way, the Truth, and the Life—John 14:6.” The audience, over 99 percent white, did not appear to be heavily weighted with pagans. Many carried Bibles; none looked out of place. The hairstyles and fashions of the women were those one stereotypically associates with Southern white ladies—neat, modest, feminine. Their husbands tended to favor double-knit sport outfits accented by white belts and shoes. Their children looked like pleasant little kids and were urged to act like it, too: “Michael, Becky, wave at Mr. Mac and Mrs. Jo.” “T.C. be still! You don’t realize you bother people, son!”\nAs is his custom, Dr. Graham spent the hour before the service in a small trailer tucked behind a temporary fence in one corner of the stadium visiting with friends, dignitaries, and others. Those others, on this occasion, included me. It was strange to be in such a small space with Billy Graham. He seemed somehow out of scale. The impeccably tailored suit, the instantly recognizable features now heightened by television makeup, the familiar North Carolina voice, and the sheer, undeniable presence of the man left me feeling it would be more comfortable to talk with him in a larger room—the Astrodome, for example.\nMomentarily it was time for the service to begin, and I took my position on the platform directly behind famous soloist George Beverly Shea. Graham sat down too, television floodlights came on, and the atmosphere on the platform tightened as cameras began to record the service for worldwide syndication a few months later. The television crew would attempt to produce a usable tape approximately one hour long, although minor editing would be required to meet precise time requirements and to reduce weak spots in the presentation. It would be tougher than usual this evening, since rain had begun to fall at almost the exact moment the cameras started rolling. The Graham organization did not want to lose this program. A substantial portion of the $100,000 expense of producing four tapes goes toward renting and transporting equipment and film crew. The team will settle for three good tapes from four nights of meetings, but if the fourth tape is usable, it costs little more than materials and crew expenses for one day and is therefore a real bargain. Several of Graham’s associates conceded that had it not been for this crucial economic factor, he might simply have offered a brief invitation and dismissed the crowd. But given the circumstances, every reasonable effort would be made to salvage the program.\nBefore the service, I had heard several people say that surely God would not allow it to rain on 25,000 of his children gathered to worship Him. The Graham team was unwilling to press its doctrine of special providence quite this far and had come prepared for the worst. Within seconds, the organ and piano were covered, a plastic canopy on four aluminum poles was erected over the pulpit area, and most platform guests donned raincoats and hoisted umbrellas thoughtfully placed at the side of their chairs. With Cliff Barrows leading them, the 5000-voice chorus sang as if the sun had just risen on Easter morning. If Billy Graham noticed it was raining, he did not show it. Instead, he sat in his familiar pose—left elbow resting on the arm of his chair, lips pressed to his doubled fist. For the first time, I noticed that not only were his sideburns snowy white, but that his hands had liver spots. Billy Graham is 59 years old, a grandfather several times over. Yet his power and magnetism are still such that, as far as I could tell, not one person showed the slightest intention of heading for cover as long as the man they had come to hear held his ground.\nBarrows introduced storyteller and comedian Jerry Clower, who got a standing ovation from his fellow Mississippians. Clower whooped and hollered. “Whooee!” he wound up, “I have done turned my hang-ups over to the One what was hung up for my hang-ups, and ain’t I having fun! Thank you! I love every one of you! Whoo!” Next up was H. L. Hunt’s daughter, June Hunt, who is attempting a career as a professional entertainer. Her feeble jokes and rambling testimony had some of the Graham team muttering, “Sing, June, sing!” Eventually, she not only sang well enough but put her umbrella aside to give the television cameras a better shot, a gesture that won the mutterers back to her side: “Bless her heart, she did that for TV.”\nWhen June finished, Dr. Graham, now wearing a tan trench coat, commended the crowd for sitting through the rain, assured them he no longer preached long sermons, thanked the governor of Mississippi for attending, and made a brief appeal for funds. By the time he began preaching on “The Wrath of the Lamb,” the canopy above his head had gathered enough rainwater to sag ominously. A man beside me said, “They better take care of that or it will split and drown ol’ Billy.” A member of Graham’s staff borrowed a pocketknife and deftly punctured the canopy twice, leaving Graham trapped between the sheet of rain falling in front of him and the double spout directly behind. His pants were soaked to the knee and he occasionally stepped back into the streams behind him, but the only time he interrupted his forceful discourse on God’s wrath toward sinners was when a bolt of lightning moved him to switch from a lapel microphone to the free-standing pulpit mike. He apparently felt that it would not be prudent even for Billy Graham to be attached to a live electrical wire during a lightning storm.\nBilly drove his few points home with the stabbing forefinger of his right hand and the limp-backed Bible brandished in his left; he sprinkled in anecdotes and simple jokes and wound up with dark warnings of a devil’s hell. Then he began what for centuries has been the hallmark of revival preaching: the call for a decision—now, tonight, before it is everlastingly too late. “Christ has died for you and you do not want hell and you do not want judgment. The Bible says, ‘Now is the acceptable time.’ You may never have another moment like this. If you want Christ with all your heart and all your mind and all your soul, the rain will not stop you.”\nA young girl, then a boy on crutches, then dozens, and finally hundreds of people left the stands and crossed the field to gather in front of the platform. Most carried some type of umbrella but many simply stood drenched in the downpour. As they came, they were joined by trained counselors who gave them booklets, helped them fill out decision cards, led them through the “plan of salvation,” and explained the correspondence course and other materials they would soon receive from the Graham Association. Graham appeared moved. “We will never forget . . . ” he began, and the microphones went dead. When power was restored he led them in a brief “sinner’s prayer,” then left the stadium as a local clergyman pronounced the benediction.\nBilly Graham, a member in good standing, despite his poor attendance record, of the First Baptist Church of Dallas, has spoken to more people about Jesus Christ, in person and electronically, than any other human being, living or dead. He has appeared before over fifty million people in person and has gathered in over 1,500,000 “inquirers” to sparkle in his heavenly crown. His crowds appear to be as large and the proportion of inquirers as high today as in the fifties. His weekly Hour of Decision radio broadcast is heard over 900 stations around the world, and he sends telecasts of three or four crusades a year into over 300 metropolitan areas, making them available to a potential 90 per cent of the world’s television audience. His Decision magazine, published in six languages and braille, has a circulation of almost four million, the largest of any religious monthly, with almost twice the combined circulations of Esquire, Harper’s, Atlantic, and Texas Monthly. Several of his books, published in many languages, have sold over two million copies apiece, a fact that helps explain the weeping, wailing, and gnashing of teeth among Doubleday editors when Graham left them last year for Word, Incorporated, of Waco. His film company, World Wide Pictures, has produced, in addition to documentary records of crusades and numerous short films, such commercially successful efforts as Time to Run, The Restless Ones, The Hiding Place, and Gospel Road, an account of the life of Jesus set to the music of Johnny Cash, Joe South, and John Denver. His syndicated column is carried by over 200 daily newspapers with a circulation of 29 million.\nIn recognition of these accomplishments, Graham has been Time’s “Man of the Year,” was named in the Gallup poll’s “Ten Most Admired Men in the World” every year between 1951 and 1974 (the poll has not been taken since 1974) and placed second to Nixon or Kissinger from 1969 to 1974. For two years in the mid-fifties, more newspaper and magazine copy was devoted to him than any other person in the U.S., including President Eisenhower. In an informal survey by the liberal ecumenical publication, Christian Century, conducted to see how many religious leaders were known to American churchgoers, Graham ranked sixty-two percentage points ahead of his nearest colleague. He has received the Big Brother Award for his work on behalf of the welfare of children, been cited by the George Washington Carver Memorial Institute for his contributions to race relations and by the Anti-Defamation League of the B’nai B’rith and the National Conference of Christians and Jews for his efforts to foster a better understanding between heirs of the biblical faiths.\nHe has been a friend of movie stars, athletes, and politicians, including every president since Truman, been honored by the police, military chaplains, the American Football Coaches Association, and the Freedoms Foundation at Valley Forge, Pennsylvania, and is the only living person depicted in stained glass in the National Cathedral in Washington, D.C. He has been saluted as “Salesman of the Year” (and decade) by various organizations, named “Mr. Travel” by Travel magazine, selected by the Fashion Designers of America for its “Best Dressed List,” received a Horatio Alger Award, recognized as an honorary Indian chief, been Grand Marshal of the Tournament of Roses Parade, appeared on Laugh-In, had his handsome visage stamped on a glass decanter (others so honored in the line included Theodore Roosevelt, Benjamin Franklin, and the Apollo XIII crew), and designated “Greatest Person in the World Today” by contestants in the 1976 Miss U.S.A. Beauty Pageant in Niagara Falls. Less tangibly, but more importantly, Billy Graham has come to function as what one writer calls, “A kind of symbol of consensus among many who think of themselves as the ‘decent people’ of America.”\nWilliam Franklin Graham, Jr., grew up on a prosperous dairy farm in Charlotte, North Carolina. His parents hoped their firstborn might enter the ministry but acknowledged it seemed a long shot. Though certainly no scoundrel, “Billy Frank” was not only high-spirited but more devoted to baseball than to the Bible. When he was sixteen he made a “decision for Christ” under the preaching of the fiery Southern evangelist Mordecai Ham, but his life underwent no striking change. The following summer he worked for the Fuller Brush Company and became an exceptional salesman. “Sincerity,” he would later say, “is the biggest part of selling anything—including the Christian plan of salvation.”\nWhen Billy finished high school he enrolled at ultrafundamentalist Bob Jones University, but after a year of mild friction over the school’s peculiar regulations, both he and the school’s administration decided he would be happier somewhere else. Still hoping for a baseball career, Graham enrolled in Florida Bible Institute at Temple Terrace, near Tampa and the spring training grounds of several major league teams. Unhappily, his athletic abilities did not match his aspirations and, no doubt influenced by his strong fundamentalist environment, he began to consider the ministry. Apparently, he was still not a spiritual stand-out; in fact, a young woman he loved broke up with him because she did not think him sufficiently devout. Not long afterward, while wandering alone on a golf course late at night, he had a moving religious experience on the eighteenth hole and made a firm commitment to become a preacher. After a successful revival at a Baptist church near Tampa, he was ordained a Baptist minister and went on to attend Wheaton College in Illinois where he received a B.A. degree in anthropology in 1943 and married Ruth McCue Bell, whose father, Dr. L. Nelson Bell, had been a medical missionary in China from 1916 to 1941.\nWhile in his first pastorate in a Chicago suburb, Graham took over a local weekly broadcast called, “Songs in the Night,” which consisted mainly of his preaching and songs by a young man named George Beverly Shea. In 1945 he signed on with Youth For Christ, a fledgling, but phenomenally successful, organization that specialized in weekly rallies offering young people a wholesome blend of entertainment, patriotism, and Christianity—its slogan was “Geared to the times, but anchored to the Rock.” “We used every modern means to reach the ear of the unconverted,” Graham recalls, “and then punched them straight between the eyes with the Gospel.”\nAs YFC’s first field representative, Graham traveled over a million miles between 1945 and 1949, including several trips to England and Europe. While converting thousands of young people, he also formed valuable ties with evangelical leaders throughout the hemisphere. In the process he began to assemble the team that is still with him today—George Beverly Shea, Cliff Barrows, George Wilson. Then, in 1949, came the revival that was to make Billy Graham a national celebrity. At the invitation of a group of Christian businessmen, Graham and his team erected the tent they called the “canvas cathedral with the steeple of light” (a Hollywood searchlight) and opened the “Greater Los Angeles Revival.”\nThe team was better prepared for this revival than for previous ones and had begun to utilize the techniques of organization that his predecessors had developed and perfected over the previous century. Attendance was good and decisions came at an acceptable rate. Then, during the fourth week of the meeting, William Randolph Hearst, who had admired the young evangelist’s work with Youth For Christ, sent the editors of his influential chain of newspapers a simple telegram: “Puff Graham.” And they did. A flood of publicity followed, including feature stories in major news magazines and wire services. Crowds and conversions mounted, reaching a total of 350,000 in attendance and 3000 decisions by the end of eight weeks. A few weeks later Henry Luce went to Columbia, South Carolina, to hear Graham in a crusade and pledged the support of Time, Life, and Fortune.\nIn November 1950, at the urging of two successful advertising men, Fred Dienert and Walter F. Bennett, whose agency handled several religious accounts, Graham launched a weekly radio broadcast simulating a crusade service on 250 ABC affiliates. By the end of the year, the Hour of Decision was receiving the highest Nielsen ratings ever of any religious program, and within five years would be heard on hundreds of stations around the world.\nGraham and his associates predictably claim that only divine assistance can account for his unparalleled success. It is worth noting, however, that he possesses in abundant measure three additional advantages that appear essential to evangelistic stardom: a simple non-denominational theology; a rational and efficient organization; and a distinctive personality and public style.\nLike all authentic evangelicals, Graham believes the Bible is the true, inspired, and infallible word of God, and as such, the final authority for Christian faith and practice. He acknowledges it contains a great deal of symbolic language and recalls with minor embarrassment a “rather foolish” attempt to delineate the exact dimensions of heaven in one of his youthful sermons. Similarly, his early descriptions of hell and the devil burned more brightly than those of today, and he waffles a bit on the nearness of the Second Coming: “It may be this year, it may be a thousand years from now.” It would be a mistake, however, to conclude that Billy Graham is going soft on doctrine. Those who wish to have fellowship in his crusades and other ventures must accept the deity of Christ, the virgin birth, the atonement, and the resurrection as literal facts. He clearly believes heaven and hell are real places, that the devil is a real person, and even acknowledges that “a few times, but very few,” he has personally and successfully commanded “a spirit of divination” (a demon) to come out of a person. And despite his sensible refusal to set dates, he clearly believes The End is a good deal nearer than it ever has been before: “There are about twenty-eight signs that Jesus said to watch for,” he told Newsweek, “and every one of them is happening.”\nThough his proclamations have become shorter and more polished, Billy’s basic message has not changed through the years. Unlike Norman Vincent Peale and Robert Schuller, who urge us to be as great as we can be through positive and possibility thinking, or Oral Roberts, who promises something good is going to happen to us, or Reverend Ike, who assures us we’ll never lose with the stuff he uses, Billy Graham starts on a downer: sinful humanity in rebellion against God. In sermon after article after book he gloomily—and at far greater length than I’m about to quote—ticks off the fruits of this rebellion:\n“The population increase is frightening . . . our city streets are turned into jungles of terror, mugging, rape, and death . . . Racial tension is increasing throughout the world . . . Communism is a dangerous threat . . . God is generally ignored or ridiculed . . .”\nBilly is not just making all this up. He reads at least three newspapers a day, has a UPI Teletype in his home, and his wife and several assistants clip magazine articles for him and give him books with the good parts already underlined, so he is able to support his views with quotations from the New York Times and the Washington Post and the Wall Street Journal, from Time and Newsweek and Reader’s Digest, from the writings of Mark Twain and George Orwell and John Steinbeck and the great Russian novelist Ivan Turgenev, from Dr. P. A. Sorokin of Harvard and the famous psychiatrist Erik Erikson and the British historian Arnold J. Toynbee and the Danish philosopher Sören Kierkegaard, and from John Lennon and Erich Segal and Vance Packard.\nThen again he gets a lot of information first-hand since he has been everywhere and knows just about everybody. People like Dag Hammarskjöld and Henry Kissinger and the President and the Pope have told him things are tough all over, as have the thousands of ordinary, troubled individuals Graham has met, who confirm that the world is going to hell in a handbasket. There is, however, some good news:\n“Man—distressed, discouraged, unhappy, hounded by conscience, driven by passion, ruled by selfishness, belligerent, quarrelsome, confused, depressed, miserable, taking alcohol and barbiturates, looking for escapisms—can come to Christ by faith and emerge a new man. This sounds incredible, even impossible, and yet it is precisely what the Bible teaches.”\nBilly not only soft-pedals the doctrines, some of them by no means minor, that divide evangelicals into denominations, but has been a major force behind a growing evangelical ecumenicity. Before he will accept an invitation to hold a crusade, for example, he insists that a strong majority of the evangelical churches in an area pledge their support. Then, during each crusade, he sponsors a tuition-free school, directed by Dr. Kenneth Chafin, pastor of Houston’s South Main Baptist Church, in which as many as 1500 ministers and selected laypeople, representing dozens of denominations, receive fairly intensive instruction in preaching, soul-winning, and church leadership.\nAnother aspect of Billy’s message has undoubtedly helped him. Working a combination Jesus never quite mastered, he manages to comfort the afflicted without afflicting the comfortable. Graham appeals to affluent evangelicals who perhaps need some assurance that the needle’s-eye door to the Kingdom of God is not quite so small as they had heard, and that wealth, if honestly gotten, is not only permissible but perhaps even a sign that God has smiled on them in a special way. They, in turn, take some of the risk out of Billy’s ventures. His decision to hold a crusade in New York City in 1969, for example, was reached in the boardroom of Mutual Life Insurance of New York; the executive committee for the crusade included the board chairman at MONY, his counterpart at Chase Manhattan, and the presidents of RCA and Genessco. Billy does not, however, put a divine stamp of approval on all that is American and middle-class; on the contrary, with clenched fist and pointing finger, with glaring eyes and accusing voice, he rings thundering disapproval down on much that he sees. Still, he offers forgiveness and everlasting life to those willing to accept it, without calling on them to make great personal sacrifices. If they love Jesus as he does, they may travel first-class, as he does.\nThe second component of Billy Graham’s success is his superb organization. In 1950, after it became clear he was not just another temporary wonder, Graham moved to put his ministry on a solid, businesslike basis. At the suggestion of associate George Wilson, he formed the Billy Graham Evangelistic Association, Inc. (BGEA), a non-profit corporation headquartered in Minneapolis. Today, with Wilson as chief executive, a staff of approximately 500 processes the mail, donations, and correspondence courses, publishes and distributes Decision magazine, and provides counseling-by-mail for those who write Graham with their problems. Also headquartered in Minneapolis are World Wide Publications and the Grason Company, which distribute books and materials related to Billy’s ministry. Films from World Wide Pictures are distributed from Minneapolis, but studios and production facilities are located in Burbank, California. Crusades are planned and executed out of Minneapolis. Walter Bennett & Company in Chicago and Philadelphia handles radio and television as it has since the Hour of Decision went on the air in 1950. In addition to these, the Graham organization maintains smaller operations in London, Paris, Sydney, Hong Kong, Kyoto, and Winnipeg.\nNowhere is the rationality, thoroughness, and efficiency of Graham’s organization more apparent than in the planning and execution of its crusades. Not surprisingly, he receives many more invitations to hold crusades than he can possibly accept. In the past, the strategic importance of the city in question was a key criterion. Is it a major population center? Does it have great political or economic importance? Will a crusade there win coverage in the newspapers of other cities? Today, because Graham’s crusades are nationally televised, cities are selected for their suitability as a studio. Politicians have learned to do the same thing for the same reasons. As the Reverend Charles Riggs, one of Graham’s longtime crusade directors, explained, “Since your big audience is on television, it is smarter to go somewhere where you will get better support and where it won’t cost you as much. A crusade in the South, for example, is many times less expensive than one in the North. In the North, things cost a lot more, labor unions run the cost up, whereas down in the South you get things donated.” For these reasons, Graham has turned in recent years to cities such as Jackson, Albuquerque, and Lubbock.\nOnce an invitation has been accepted, representatives from the host city form a nonprofit corporation that will be responsible for financing the crusade and developing the necessary organization. Several months before a crusade begins, the Graham association sends members of its team to open an office in the host city and involve as many people as possible in various facets of the crusade. A finance committee is charged with raising a sizable chunk of the quarter million dollars or so the crusade will cost. A prayer committee will set up daily meetings in thousands of homes. In Jackson, for example, three thousand groups averaging eight members apiece—more than 10 per cent of the city’s total population—met daily for a month before and during the week of the crusade.\nTo spur these groups to keep their commitments, the crusade team sponsors a prayer program each morning at 10:15 over a local radio station and again at 8:00 in the evening for family prayers. As laymen are organizing in this fashion, the Graham team holds a series of meetings to enlist the support of as many Protestant clergymen and their churches as possible to cooperate with the crusade, and may get over a thousand churches to participate in some way. A three-week Bible study program, classes for counselors, and a series of one-shot rallies, prayer breakfasts, and orientation sessions enable the Graham team to involve thirty to forty thousand, and sometimes as many as eighty thousand people in one or another facet of a crusade. With that accomplished before he hits town, Billy Graham really doesn’t have to worry much about drawing a crowd.\nTo those who attend a crusade or view it on television, the payoff of all this effort seems to come when hundreds, sometimes thousands of “inquirers” stream from the stands to make their “decisions for Christ.” Most perhaps imagine that Graham and his team have now done their job, have accomplished what they sought; but that is not at all the case.\nAs Graham offers the invitation, the aisles fill not only with inquirers, but also with counselors. Insofar as possible, a counselor seeks out an inquirer of the same sex and approximately the same age group and asks him or her to check the item on a decision card that most nearly matches the reason he or she has come forward—first-time commitment, rededication, special problem, etc. After a two- or three-minute review of the Gospel, the counselor presents the inquirer with a small packet of materials, which includes the Gospel according to John, a Bible study lesson, a devotional guide, and several Scripture verses printed on small cards to facilitate memorization. Finally, the counselor helps the inquirer complete the decision card, suggests they pray together, and urges the new friend in Christ to get in touch if any problems arise during the next few days.\nWithin minutes, the decision cards are transferred to what is known as the “Co-Labor Corps,” a group of 200 to 300 workers housed in an armory or gymnasium and looking like the combination of a political convention, the newsroom of a metropolitan daily newspaper, and a Christian beehive. There the cards are sorted into broad categories, such as denomination and type of decision, then passed on to researchers who fill in missing items with the help of zip-code books, criss-cross directories, and special computer print-outs prepared by the crusade team. “If a person comes here from Louisiana,” a supervisor told me, “and puts down his street address, chances are we can figure out what church and what pastor we should notify concerning his decision.”\nAfter retyping, the card, together with an explanatory letter, is then sent to a pastor who has either been named by the inquirer, or whose church members invited him, or whose participating church is nearest the inquirer’s home, or who has been specially selected by a “decision committee” charged with making such assignments. Though Graham is not anti-Catholic, he still regards his ministry as distinctly Protestant and does not assign cards to Roman Catholic churches. Neither would he honor a request to contact a leader of such cults as the Church of Scientology or the Reverend Sun Myung Moon’s Unification Church.\nThese letters are then metered, sorted according to zip code, taken to a special branch of the post office, and delivered in the next morning’s mail. This means that for virtually every person who responds to Graham’s invitation in an evening service, some pastor in a sixty-mile radius will have received a letter by noon the following day, urging him to contact the inquirer, take appropriate action, and report back to a follow-up committee.\nThe Graham organization is sensitive to the justifiable criticism that revival fires rapidly burn out and seeks to sustain them as long as it can. Beginning the day after the crusade closes, the radio station that has carried the prayer broadcasts begins a series of morning and evening programs dealing with what it means to be saved and how to live as a Christian. Three weeks later, all inquirers are contacted by telephone and asked about any difficulties they may have had, urged to attend church and join a Bible study group, and encouraged in the continuing struggle against sin.\nThe fact that a high proportion of inquirers list a pastor or church on their decision cards raises an issue that has been around since D. L. Moody, a nineteenth-century evangelist, began to keep track of responses to his preaching. Newspaper reporters at the revivals of the great mass evangelists, including Graham, have repeatedly noted that the “sinners” who responded to those evangelists’ persuasive entreaties have often carried well-worn Bibles and looked suspiciously like people who were not being exposed to organized religion for the first time. Only about half of Billy Graham’s inquirers—in Jackson and other Bible Belt areas, the proportion may be as low as a third—claim they are making a first-time commitment to Christ. Still, this does not mean Graham’s results are spurious or insignificant. If a substantial number of church folk whose light has begun to dim are plugged back into church systems on a high-voltage line, the crusade has performed an important function.\nAny preacher with the sense to keep his theology simple and the foresight to surround himself with able associates could probably achieve moderate success. But these alone do not produce an evangelistic superstar, any more than a good piano and high-quality lessons will turn out a Horowitz. If it were otherwise, we could recall more easily the names of some of the dozens of young evangelists who have been heralded as “the next Billy Graham.” What does Graham have that makes him so appealing to so many? He is attractive, forceful, and confident, to be sure, but one would hardly describe him as colorful; in fact, he seems almost dynamically bland. He seldom turns a memorable phrase, his mind seems innocent of complexity, and his observations are thoroughly predictable. All of us know several people who are intrinsically more interesting. And yet he is undeniably one of the authentic All-American Heroes.\nIn accounting for Graham’s success, observers have often noted the publicity bonanzas he received from Hearst and Luce. These were crucial, certainly, but despite the enormous boost they provided, it is important to remember that Hearst and Luce were not making a random selection or engaging in creation ex nihilo. Their empires had been built on a singular genius for matching a communication medium to the receptivity of a mass audience, and in Billy Graham they saw a man who not only had that same talent, but was himself the medium.\nPeople are drawn to Graham for his personal style and character. He is personable, charming, and, I believe, absolutely sincere. He is apparently even humble, expressing wonder at what he has done, awe at the responsibility of his position, and doubt that he is up to it. He works so hard that he has high blood pressure, can perform no heavy lifting, has thrombophlebitis and a recurring intestinal ailment, and from time to time has had to slow down because of an eye problem related to exhaustion. He leads a life of considerable personal discipline, rising early, reading five Psalms and one chapter of Proverbs, watching the Today show during breakfast, spending an hour in Bible study after breakfast, then working, jogging, writing, and closing the day with another round of devotions—the very sort of existence most evangelical Christians feel they should lead but seldom manage.\nHe also appeals to the people in the pews because they feel at home with him intellectually. His humor is obvious, as if gleaned from “Laughter is the Best Medicine” and “Today’s Chuckle.” He loves sentimental stories like the one about the mediocre football player who starred on the day his blind father died because “it was the first time my dad ever got to see me play.” And though he occasionally laments the fact he never took time to earn a doctorate (his PhDs are honorary), he does not pretend to be a theologian or a biblical scholar. In fact, he has openly admitted that when he suffered a period of doubt in 1949, he resolved it not by working through the problems that troubled him but by making a conscious decision not to think about them any more. “If that be intellectual suicide,” he says, “so be it.”\nThis simplicity pervades the literature Graham publishes and apparently reflects the concerns of his readers. A question-and-answer column in Decision magazine regularly deals with such chestnuts as why people no longer live as long as Methuselah did, where the sons of Adam and Eve got their wives, and whether the Garden of Eden can be located on a map. Thus, what one writer has said of Charles Finney, a well-known evangelist in the 1800s, may be equally true of Billy Graham: “He did not study the popular mind; he had it.”\nIt would be fatuous, of course, to imply that Billy Graham is the hero of all the people. Archfundamentalist Carl McIntire, outraged by what he regards as a damnable penchant for compromise, calls Graham “the greatest disappointment in the Christian world.” To liberal Christians he epitomizes a religious and, by implication, political outlook singularly inappropriate to contemporary societies. And to others who are cynical toward any who profess to live by lofty ideals or bone-weary at repeated disappointment in those they had dared trust, Billy Graham is simply not believable. In time, they are confident he will be exposed, and they will dance at his disgrace.\nIt would be unfair, however, to contend that Billy Graham always takes a conservative line on social problems. In the early years of his ministry, he sidestepped the racial issue, but by 1953 he insisted his crusades be completely open to all races, even in the Deep South, and refused invitations to South Africa for years. When he finally held crusades in Durban and Johannesburg in 1973, blacks constituted at least half of the audience and sat where they wanted to. At the risk of offending a sizable segment of his supporters, Graham toured Latin America in 1960 with Dr. Martin Luther King, Jr., and his organization prepared a series of spot announcements for use in the South, urging parents to “obey the law” on school integration.\nThe most scathing criticism leveled at Graham in recent years, of course, has been directed at his perceived role as “high priest of American civil religion” and, more specifically, as “court chaplain” to the Nixon administration. Graham’s political predilections—against militancy of most sorts, against disruptive protests, against involvement of the church in radical social action, in favor of rugged individualism and the work ethic—made it quite easy and natural for him to say, with complete sincerity, precisely what Nixon and his conservative Republican constituents wanted to hear.\nIn turn, Nixon’s background had prepared him for Billy’s brand of religion. The particular Quaker sect in which he was reared was not greatly unlike the fundamentalist and evangelical churches from which Graham draws most of his following. Nixon has credited Graham with having encouraged him to run for the presidency in 1968, and when he secured the nomination, Billy sat in on the session at which Spiro Agnew was selected as Nixon’s running mate. (Graham’s first choice, however, was Mark Hatfield.) Though he did not publicly endorse Nixon, the evangelist did appear as a member of the studio audience on question-and-answer TV shows, and when the wire services reported that his absentee ballot had carried Nixon’s name, the candidate’s camp readily exploited the information. As the corruption in the Nixon Administration came to light, Graham acknowledged Nixon may have abused their relationship, but refused to abandon his disgraced friend, a stance that was hardly motivated by a desire to enhance his own public image. “When a friend is down,” he said, “you don’t go and kick him—you try to help him up.”\nSince Watergate, Graham has conceded that if the President told lies, it was a sin and has called for national repentance “from the White House to your house.” His critics, including evangelicals, have observed pointedly that when David took Bathsheba and sent her hapless husband off to die in battle, the prophet Nathan did not simply preach a series of lessons decrying immodesty, adultery , and abuse of power, but strode into David’s presence and said accusingly, “Thou art the man!” But Nathan was a prophet and not an evangelist. Prophets are sent away from the court, cast into jails and cisterns, and threatened with death. Evangelists, like salesmen, hesitate to make a potential customer feel uncomfortable in a way that might risk loss of the sale.\nGraham’s religious and political beliefs have always given his ideological opponents plenty to shoot at, but the cynics among his detractors have been less fortunate. He has avoided any hint of the sexual scandal that has tainted several other ministries by making certain he is never alone with a woman other than his wife or a close relative even for a few minutes. And, throughout most of his ministry, he has been a model of financial integrity. At the close of his 1950 Atlanta crusade, the Atlanta Constitution carried two photographs side by side. One showed Graham waving goodbye to the city. The other showed money bags containing $9000 collected as a “love offering” for the five weeks the evangelist had spent in the city. The insinuation rankled Graham and his team, and he quickly accepted a recommendation that he scrap the love-offering system and place himself on an annual salary to be set by his board. At that time, his salary was set at $15,000; at present, it is $39,500. In addition to his salary, of course, he receives full expenses while away from home, plus income from his writings. He has also inherited land valued at $420,000 and sold other inherited properties for $250,000. Although he has established trust funds for his children, much of the considerable income from his books has gone either to charitable causes or back into his ministry. He estimates, for example, that he gave away approximately $600,000 last year. He is thus financially comfortable, but has not taken advantage of his position to build a personal fortune. His organization owns no airplane or stable of expensive automobiles; Graham’s two personal cars are a Volvo and a Jeep.\nBecause the BGEA is incorporated as a church, it is not required to file an IRS return and has not published a financial statement for the benefit of its donors. Still, Billy’s salary and rough estimates of the ministry’s income and overall expenses have not been dark secrets, and until mid-1977 virtually every investigation into Graham’s finances found him and his organization without spot or blemish. One of the most thorough of these investigations was conducted early in 1977 by Mary Bishop and Robert Hodierne of the Charlotte Observer, Billy’s hometown paper. According to the Observer, Graham said he was giving the most complete statement of his and his ministry’s finances that he had ever given and, moreover, that he was holding nothing back. He had told them, for example, that in 1976 the ministry had spent approximately $25 million and that it regularly spent all that it took in. The reporters claim they asked George Wilson if a list of organizations related to the ministry was complete and were told it was. Wilson also told them the organization owned no stocks or bonds and had no land holdings other than those directly related to operations.\nIn June 1977, however, the Observer broke a story that delighted skeptics and caused millions of true believers to wonder if even Billy Graham had gone the way of so many of his predecessors and colleagues. The paper revealed the existence of the World Evangelism and Christian Education Fund (WECEF), incorporated in Dallas and worth $22.9 million. Most of the holdings of the seven-year-old fund, which the paper said had been “carefully shielded from public view,” were in blue-chip stocks and bonds, but assets also included a 2600-acre tract of prime land in the Blue Ridge Mountains of North Carolina, purchased by Dallas attorney Jerry John Crawford in 1973 and held in his name until 1975. Though he used WECEF money, the Observer reported, Crawford did not mention Graham or any of his organizations while making the purchase. Further, when owners of land next to the tract asked if Graham or any of his people owned the land, they were told no as recently as the spring of 1977. That WECEF was a Graham organization is beyond question. Almost all of its funds have been funneled into it from BGEA. The board of directors is elected by the board of BGEA and the only two directors not also on the BGEA board are Graham’s wife and her brother.\nThe charges stung Graham and, in contrast to his long-standing policy of turning the other cheek to his critics, he characterized the Observer article as “grossly misleading” and set out to explain. WECEF, he insisted, had been established for three purposes: to provide support for such student-oriented programs as Campus Crusade, the Fellowship of Christian Athletes, and Young Life; to establish an evangelism institute on the campus of Wheaton College; and to develop a layman’s training center in Asheville, North Carolina. The fund’s very low profile, he said, had been seen as desirable, to avoid giving the impression that the ministry was so rich that it did not need small contributions, and also to avoid a flood of requests from needy projects. He also pointed out that the fund had not been kept a complete secret. Its creation in 1970 was announced at a news conference in Minneapolis. The Religious News Service and several religious journals mentioned the fund in the first year or two of its existence, and Peter Geiger, a respected religion reporter, interviewed Graham and mentioned the fund in a 1972 story in the Akron Beacon-Journal, a paper in the same chain as the Charlotte Observer. Furthermore, Graham claimed he had given the story to the Asheville Citizen just a few weeks before the Observer printed its account.\nThe WECEF flap was unfortunate and embarrassing, but not the debacle some anticipated. The legality of WECEF has never been questioned and there is no evidence whatever that any of its holdings have ever been misused or turned to anyone’s personal profit. Wheaton College, for example, has already received $8 million of the $15.5 million slated for the evangelism institute.\nGraham seems to have absorbed the lesson that, despite Jesus’ instruction to his disciples to be “wise as serpents and harmless as doves,” folks are still apt to be wary of said serpents. To avoid similar complications in the future, he has pledged to publish an annual financial statement and, in the interim, has given the press a 1976 statement that shows income of $28.7 million, over 90 per cent of which comes through the mail, and expenditures of $27.7 million, divided between evangelism and ministry, including WECEF (38 per cent); radio, television, and films (32 per cent); Decision magazine (10 per cent); foreign ministries and world emergencies (9 per cent); mailing and postage (6 per cent); and administrative expenses (5 per cent).\nThe recent controversies, added to the strains of dueling with the devil for decades, have wearied Billy just a bit. He admits he is sometimes tired and lonely and, exhibiting clear confidence in the message he brings, claims that the prospect of death sometimes seems welcome. “I would be very happy,” he told one interviewer, “if the Lord would say it’s time to go home. I’m looking forward to it because the pressures of my particular life are very heavy and I get very homesick for heaven . . . But I don’t want to be a cop-out either. I want to stay and do what he wants me to do.”\nObviously, he does not think the Lord is ready for him to lay his Bible on the shelf just yet. In the last six months he has held gatherings in Cincinnati, Manila, Calcutta, Hyderabad, and Madras, in addition to his widely publicized visit to Hungary. He admits he has made some inquiries about a crusade in the Soviet Union and says he might even accept an invitation to preach in Rome if the Colosseum could be fixed up and made safer for Christians than it was the last time they used it extensively. If his health holds and the Lord tarries, we can reasonably expect Billy Graham to remain active for at least another ten years. There are plenty of willing candidates around, but I see no one likely to step into Graham’s pulpit when he retires.\nMy personal prediction is that the current evangelical revival will level off by the end of the seventies, then enter a gradual decline, at least in this country, for several decades. Eventually, some young man or woman with just the right combination, a combination easy to describe but apparently harder to embody, will arise to join the elite ranks of world-class heavyweight evangelists. It may be that developments in communication and transportation will enable the new light to shine more brightly than Billy ever could, just as radio and television and jet power have enabled him to reach more people than any of his predecessors could have dreamed possible. But unless and until that happens, Billy Graham, whatever we may think of evangelists and the gospel they preach, has to be regarded as the best who ever lived at what he does—“a workman,” as the Scripture says, “that needeth not to be ashamed.”\nHomegrown Holiness\nFor those few Texans who occasionally sin, these evangelists may have the answer.\nDavid Terrell\nBrother David Terrell is one of the last of the full-fledged, fire-breathing fanatics—he would not think the term uncomplimentary—on the revival circuit. Terrell’s services often last four or five hours and feature his audience shaking, screaming, dancing, swooning, and running wildly around the perimeter of his six-pole tent. Terrell’s preaching is short on good news and long on drought and famine. For years he has been urging people to leave the corrupt cities and settle in rural areas, where they can raise their own food when the famine comes. In 1974, several hundred took him at his word and moved to tiny Bangs, Texas, just outside Brownwood, creating considerable consternation among the townspeople and a bit of a strain on the area’s welfare rolls.\nTerrell has offices in Fort Worth, but he is hard to pin down anywhere and is usually uncooperative with representatives of the media. His descriptions of world conditions—sample: “Caterpillars are five inches deep in Canada, eating up everything”—and his prophecies of imminent doom have, thus far, been so wide of the mark as to cast doubt on his claim of having a direct line to God. Though he presses his disciples to turn over most of their possessions to his ministry, he does not make a heavy push for funds either through the mail or at his meetings. Most observers think him extreme but sincere. The easiest way to sample his preaching is to tune him in at 9:45 a.m. on KCTA, “the Gospel Giant of the Southwest,” near Corpus Christi, at the 1030 spot on your radio dial; at 2:15 p.m. on KSKY (660) in Dallas; or at 10:15 p.m. on XERF (1560) from Del Rio.\nJames Robison\nA conservative Baptist, James Robison operates a flourishing independent ministry out of Hurst, Texas. Abandoned by his mother as an infant, Robison led a tough, transient childhood that left its mark on him. He professes to be shy outside the pulpit and talks of salvation with the relief and gratitude of a man who has just escaped a galloping terror. Young, athletic, and attractive, and with an appealing sense of humor, Robison enjoys great popularity. Real or imagined, his shyness disappears when he hits the pulpit. His blunt, forthright way of saying exactly what he believes, a trademark of his preaching, will probably prevent him from building a following comparable to Billy Graham’s, but those who support him regard this directness as his greatest asset.\nIn addition to a crowded schedule of one-night rallies and full-scale, stadium-packing crusades, Robinson produces a weekly television program that is seen on about fifty stations across the country. He is clearly on the way up.\nCharles and Frances Hunter\nCharles and Frances Hunter describe themselves and their ministry as “delightfully charismatic.” From their headquarters in Houston—the switch-board operator answers with “Hallelujah!” or “God is fabulous!”—they tour almost constantly, preaching to packed houses, conducting healing services, and administering the Baptism of the Holy Spirit, the primary manifestation of which is speaking in tongues. Frances, who is a natural storyteller, spices up their informal, sometimes rambling discourses with her humor, while Charles radiates an intense sincerity. Both smile so much and so broadly during meetings that one’s jaws ache sympathetically.\nCharles is a Houston CPA who has long been involved in church work, but, before Frances’ conversion, she was a hard-driving businesswoman with a five-pack-a-day cigarette habit and a fondness for martinis. Since she found the Lord and then Charles, she has not only conquered these vices, but also has managed in recent years to shed fifty pounds from her formidable frame, a struggle she details in God’s Answer to Fat—Lose It, one of fourteen books she and Charles have written, with total sales of over four million copies. Their weekly television program, The Happy Hunters, can be seen in most Texas cities, and they appear at Houston’s Evangelistic Temple on the third Thursday evening of each month. Come early to get a seat; stay late to get the Spirit.\nChris Panos\nChris Panos of Houston characterizes himself as “God’s spy—a real-life Christian version of James Bond [who] dashes in and out of iron and bamboo curtain countries, passing through customs with impunity, and smuggling Bibles, Gospels, and New Testaments into various communist countries.” A successful businessman turned evangelist, Panos concentrates most of his activities overseas. He has held crusades in over fifty countries and has been particularly successful in India, where he has drawn crowds of over 100,000. Panos has added a new twist to evangelistic fund raising by selling jewelry his followers have donated to his ministry. His newspaper, the Far East Reporter, offers such consecrated bargains as an antique diamond necklace, “given to win souls,” for $10,000. Panos also markets a book and a set of tapes explaining how anyone can hold evangelistic crusades, “complete with miracles.”\n- More About:\n- TM Classics\n- Baptists",
  "word_count": 9247,
  "scraped_at": "2026-02-14T12:04:30.432005"
}