{
  "article_id": "19282cd957b6",
  "url": "https://www.90min.com/fran-kirby-joins-wsl-club-following-emotional-chelsea-exit",
  "title": "Fran Kirby joins WSL club following emotional Chelsea exit",
  "date": "20240704T221500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Fran Kirby joins WSL club following emotional Chelsea exit\n- Fran Kirby has a new club following recent departure from Chelsea\n- WSL legend spoke about the importance of ambition of new side\n- Interest has also come from the United States and Scandinavia\nFormer Chelsea star Fran Kirby has signed with Brighton & Hove Albion to stay within the WSL for the next chapter of her illustrious career.\nThe 31-year-old England international bade farewell to the Blues at the end of last season, having made herself a club legend by winning seven WSL titles and eight other trophies since 2015.\nThere was interest from clubs in the United States and Scandinavia, while Tottenham Hotspur and newly promoted Crystal Palace were also options for Kirby to remain in London in particular. But her new team is not much of a further away on the south coast.\nFor Kirby, both staying in the WSL and finding a club that excites her were key factor. It is also an opportunity to reunite with ex-Chelsea colleague Maria Thorisdottir, who joined the Seagulls from Manchester United last summer.\n\"I wanted to stay in the league and when I spoke to Brighton and obviously my old teammate, Maria, it was some really exciting conversations in terms of the ambitions that the club has going forward,\" Kirby explained to Brighton's official website.\nAlthough England winner Katie Robinson has moved on and 2023/24 top scorer Elisabeth Terland is on course to join Manchester United, Brighton have already brought in Dutch defender Marisa Olislagers and Japanese forward Kiko Seike this week alone.\n\"I think you can already see that with the signings that have already been announced over the last couple of days where the club sees itself. And for me, it was just exciting to hear that kind of passion come from a football club and to be part of another project really and come in as a bit of an older, more experienced player,\" Kirby explained.\n\"I'm a competitive trainer, I'm a competitive player. I wanted to go somewhere where I could keep my standards up and help bring them into another club. I wanted to stay in this league because I still want to be competing week in week out. And as long as I can help a team progress, that's what I want to do.\n\"When I spoke to the people at Brighton and they told me how behind Tony Bloom is of the women's game and how much they want to invest in it and push it forward and then seeing the facilities here, for me it was a really exciting opportunity and one I couldn't really turn down.\"",
  "word_count": 446,
  "scraped_at": "2026-02-14T12:57:59.423492"
}