{
  "article_id": "194f8dca3aa3",
  "url": "https://billingsgazette.com/special-section/article_293e4cfc-93e0-43c6-a6e4-2c92364173ae.html",
  "title": "These are the winners of the 2026 Billings 40 under Forty",
  "date": "20260208T164500Z",
  "domain": "billingsgazette.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This year's 40 Under Forty recipients have been recognized by the Billings community for being outstanding young business professionals who are ambitious, tenacious, caring and innovative leaders in their fields.\nThe following Q&As with the winners can help give insight into why they're successful but also offers some sound advice that's applicable to the lives of anyone wanting to strive a little higher and reach a little further. A few of them even offer up a some good recommendations for your next binge watch.\nLUCA BATTISTOTTI\nAge: 28\nCompany and Title: Montana State University Billings Foundation and Alumni\nHometown: Billings\nEducation and/or Background: Bachelor in Business Administration Management with a minor in Marketing from MSUB and a Master in Public Relations from MSUB\nPeople are also reading…\nIf you couldn’t do this, what would you do instead?\nI love what I do. MSUB changed my life and shaped the person I am today. It means a lot to know that, in my role, I can give back and help students have a great experience.\nWhat other passions/callings are part of your life?\nI love staying active, and biking and running with friends are some of my favorite ways to do that. This past summer, I biked in the Italian Alps with a friend, which was an incredible experience. I also enjoy traveling with family and friends. I visit my family in Italy at least once a year, and those trips are always very special to me.\nWhat is the worst advice you’ve received and why?\nI’m sure I’ve received bad advice at some point in my life, but none that has really stuck with me. People often give advice with good intentions, but we’re all different; we see and interpret things in our own ways. What may be good advice for one person might not be the right guidance for someone else, depending on their perspective.\nWhat advice would you give a teenager about success?\nDefine your own success first. Don’t look at others and try to imitate their version of success. Once you’re clear on what success means to you, pursue it with passion and a strong work ethic to achieve your goals.\nWhat is one professional accomplishment you still want to achieve?\nThere are many, because I’m always looking for opportunities to learn, grow, and become even more valuable to my team. I believe continuous improvement helps me show up better in my role and support our collective goals.\nHow do you measure your own success?\nIn my current role, I measure success by the impact I’m able to make; supporting students, strengthening relationships with alumni and donors, and contributing meaningfully to my team. If I’m growing, adding value, and helping move MSUB’s mission forward, I consider that success.\nWhat is the hardest part of your job?\nMSUB has so many alumni that engaging with everyone is essentially impossible, but in our office we always say, “One Jacket at a time!” While it’s unrealistic to reach all 40,000+ alumni, my goal is to connect with as many as I can and make each interaction meaningful.\nWhat is the most rewarding/important aspect of your occupation?\nHearing the stories of alumni and the impact MSUB had on their lives is truly remarkable. It’s also incredibly meaningful to know that I can make even a small difference in helping students achieve their dreams.\nWho is your greatest mentor/inspiration?\nMy parents have always been my greatest inspiration. I’ve looked up to them my entire life, and I still do today. Their work ethic, values, and the way they navigate challenges have shaped the person I am. They’ve taught me the importance of kindness, perseverance, and staying grounded; qualities I try to carry with me in my personal and professional life.\nWhat advice would you give to anyone wanting to start a new business or excel in a business or field?\nWhether you want to start a business or excel in your field, you have to earn it. I truly believe that hard work always pays off. There will be failures along the way, but consistency, showing up every day, doing the small things, and always moving forward is what ultimately brings you closer to achieving your goals.\nHow do you view failure and success?\nI see failure and success as closely connected. Failure is a natural part of learning, and some of my biggest growth has come from situations that didn’t go the way I hoped. What matters most is how you respond; taking the lesson, adjusting, and moving forward.\nSuccess, for me, isn’t a single moment or achievement. It’s more about steady progress, becoming better over time, and staying true to the goals and values that matter to me.\nJOSHUA TONKOVICH\nAge: 39\nCompany and Title: K2 Civil Inc., General Superintendent\nHometown: Great Falls\nEducation and/or Background: High school diploma\nWhat other passions/callings are part of your life?\nI enjoy coaching youth sports. I’ve helped coach my son through baseball, football, and wrestling. I also coach my daughters through softball and wrestling; soon to be basketball as well.\nWhat advice would you give a teenager about success?\nWhatever it is you want to achieve, stick to it! Don’t give up! Stay on the right track, talk with adults who have been down that path and LISTEN TO THEM!\nWhat’s your guilty pleasure?\nThat would be my fishing boat; whether it’s a new fishing pole, upgrading the trolling motor, or a new lure.\nWhat is one professional accomplishment you still want to achieve?\nI would still like to own/invest in a business some day.\nHow do you measure your own success?\nI measure my success with the guys I work with. If I can help them figure out a situation on the job, or help them with managing a crew, that’s success in my opinion.\nWhat failure have you learned the most from?\nAlways double check elevations, structural sections, and all the small details in the plans. Missing the smallest detail can cost money or delay the schedule. Also, double check your utility locates.\nWhat is the hardest part of your job?\nThe hardest part of the job is something we can’t control, the weather. It can really change the schedule if it rains or snows.\nWhat was the last show you binge-watched?\nThe last show I binged watched was Landman. I worked in the oil field for 6 years, so I’ve got some interest in it.\nWhat is the most rewarding/important aspect of your occupation?\nWhen a project paves out. Once asphalt is down, we are typically finished up and starting a new project.\nWho is your greatest mentor/inspiration?\nI’ve had multiple mentors along the way. My dad, Mike Tonkovich, showed me that even if the job is hard, stick with it and eventually it’ll pay off. My supervisor, Dee Teter, taught me a lot about construction and management. I’ve had many more supervisors and mentors along the way.\nDo you have a motto that you live by?\n“Don’t give up, keep going!”\n“The grass isn’t always greener on the other side.”\n“Work smarter, not harder.”\nWhat advice would you give to anyone wanting to start a new business or excel in a business or field?\nIt’s going to be tough. Long days, stressful nights, always thinking about the job, and lots of phone calls. I started construction when I was 17 and I would’ve never thought my phone would be a required tool. But if you want it bad enough, GO FOR IT!\nHow do you view failure and success?\nFailure is not succeeding, but only if you give up. You can be successful and still have failures along the way. It’s how you learn from those failures, correct your path, and try to succeed again.\nWhat do you do for fun/relax/hobby?\nI enjoy fishing, camping, coaching, and sometimes just chill on the couch with my family.\nWhat’s the greatest gift you ever received? Why?\nThe greatest gifts I’ve received are my wife and kids. Providing for them and watching them succeed keeps me going.\nHANNAH TAGLIAFERRO\nAge: 38\nCompany and Title: Watkins Distributing, CFO\nHometown: Spokane, WA\nEducation and/or Background: BA from University of Washington and MBA from University of Idaho\nIf you couldn’t do this, what would you do instead?\nWorking for our family business was always something that I wanted to do, so it feels right that this is where I ended up. But if I wasn't in the beer/distribution business I would love to own a small boutique fitness studio.\nWhat other passions/callings are part of your life?\nI'm a mother of two amazing little boys who are 5 and 7, watching them grow up and helping shape them into good humans is the most important job I could ever have. It is a driving force behind how I lead, build, and contribute. They inspire me to create a better future—for my children and for the community they will grow up in.\nWhat is the worst advice you’ve received and why?\nThat something is going to be 'too hard'. Everything in life is hard, you have to choose your hard in life and move forward.\nWhat advice would you give a teenager about success?\nSurround yourself with the type of person you aspire to be. Energy is contagious and being around successful people leads to better outcomes.\nWhat is one professional accomplishment you still want to achieve?\nI would love to serve on a board of directors of a small business where I can apply my strengths and experience from running our own family company.\nHow do you measure your own success?\nFor me, success is rooted in my ability to adapt, learn, and keep progressing. When growth stops, so does success. Life is constantly changing, and staying aligned with that evolution is critically important.\nWhat failure have you learned the most from?\nOne recent failure showed me that I can't take everything on by myself and that I have to hand things off to my team and people that I trust. I have a tendency to 'just do it' versus delegating and allowing people to step up and do their jobs.\nWhat is the hardest part of your job?\nKnowing that I'm responsible for 400 people and their families' livelihoods; when you own and operate your own business your employees are your responsibility and it's a weight that isn't talked about often enough. As the CFO I have to balance decisions that are best for the overall health of the company but also what's best for our employees; most of the time those things align but when they don't it's incredibly difficult.\nWhat was the last show you binge-watched?\nBlack Rabbit\nWhat is your favorite book?\nPicking a favorite is pretty tough, but a book I really enjoyed recently was Tomorrow and Tomorrow and Tomorrow.\nWhat is the most rewarding/important aspect of your occupation?\nWe have some of the greatest supplier and retailer partners, so building relationships with people around the country is my favorite part of my job.\nWho is your greatest mentor/inspiration?\nProbably my Aunt Robin, she was a trailblazer in this industry during her time and leads with so much generosity and grace.\nDo you have a motto that you live by?\nEverything happens for a reason. Sounds cliche but I believe it whole heartedly.\nWhat advice would you give to anyone wanting to start a new business or excel in a business or field?\nDo it. The fastest way to learn and understand how business works is to dive right in. There are so many great resources that can help along the way and people who are willing to give advice or listen to the challenges that arise.\nWhat do you do for fun/relax/hobby?\nI enjoy staying active and being outside. My husband and I love to spend time at the lake or on the golf course during the summer, and in the mountains skiing in the winter.\nJOE OLIVO\nAge: 38\nCompany and Title: Valley Credit Union - VP of Member Experience\nHometown: Billings\nEducation and/or Background: Skyview High School\nWhat other passions/callings are part of your life?\nI am a huge supporter of Toys for Tots. I have run our Valley Toy Drive for the past 9 years. Every year it seems to get bigger and bigger - this year is looking like the biggest yet! I have a strong passion for anything that lets kids be kids and enjoy life to the fullest.\nWhat is the worst advice you’ve received and why?\nAnything that revolves around not being yourself. Working in banking there is a certain stereotype of the stuffy serious guys in suits. I have always believed in being yourself - if you're goofy then be goofy, if you're loud then be loud. You will never enjoy your work or your life if you are always trying to be something you're not. I am thankful to work somewhere that fully supports being myself (sorry Gidget).\nWhat advice would you give a teenager about success?\nWell, my work advice would be to find a career where you can give yourself true freedom. Freedom is not taking time off whenever you want or not having a boss tell you what to do. Freedom is going to the grocery store and not worrying about how much everything costs. Freedom is filling up your gas tank when it's low without worrying about it. Freedom is truly living within your means.\nWhat’s your guilty pleasure?\nGuilty pleasure implies that I am embarrassed by it.... which I am not embarrassed by anything — BUT I love a good trading card game or some 2000s Pop Music.\nWhat is one professional accomplishment you still want to achieve?\nI am going to Credit Union Management school through the University of Wisconsin - I have one year left so that will be nice to cross off the list!\nHow do you measure your own success?\nBy how people talk about me and to me. If my coworkers still come to me for help and advice it means I am doing a good job. If my wife and kids are still happy to see me when I come home, it must mean I am doing something right!\nWhat is the hardest part of your job?\nThe hardest part is helping other people see themselves how you see them. So many people struggle with insecurities and just can't see how great they really are. It's both the hardest part and the most rewarding part when you can get someone to realize just how much of an impact they make.\nWhat is your favorite book?\nAmazing Spider-Man — but if you're one of those weirdos who don't consider comic books to be \"books,\" then Ender's Shadow.\nWhat is the most rewarding/important aspect of your occupation?\nSeeing my coworkers succeed. A lot of my job is leadership development and it's extremely rewarding to see people grow and become leaders themselves. Seeing people go from Tellers to Branch Managers or higher is amazing to see.\nWho is your greatest mentor/inspiration?\nMy greatest inspiration is easily my wife and kids. For work my mentor is my boss, Casey Klein. He took a chance on a smart mouth, know-it-all kid, and gave me an opportunity to build a career for myself and my family. I will forever be indebted to him for that. For life, my mentor is my mom. She has worked her butt off her entire life, always had multiple jobs, raised 3 kids, and was always willing to go without, so someone else could go with. She is easily the best person I have ever and will ever meet.\nWhat’s the greatest gift you ever received? Why?\nMy wife and kids. I can't imagine life without them. They are so sweet, kind and funny. We have a sign in our kitchen that says \"This Kitchen Is For Dancing\" - our dance parties in there make all life's problems go away!\nSETH LIVENGOOD\nAge: 33\nCompany and Title: Rocky Mountain College: Assistant Professor of Aviation\nHometown: Treynor, Iowa\nEducation and/or Background: BS in Aeronautical Science from Rocky Mountain College. Master of Social Work from Walla Walla University.\nWhat other passions/callings are part of your life?\nContinuing to blend Aviation and Mental Health together. It’s a topic which isn’t often spoken about together, but it is necessary to increase the overall safety of the National Airspace System. I volunteer to be on the medical board of Pilot Mental Health Campaign; their goal is to work to increase mental wellbeing throughout the aviation industry by pushing for regulation change for the FAA. I see my work there as a perfect blend of two of my professional passions.\nWhat is the worst advice you’ve received and why?\nIn third grade, I forgot which direction the rounded top part of a 9 goes: to the left or to the right. So, using my resources, I found a 9 in the text book and copied it. Well, if you handwrite a 9, you would typically draw a downward straight line, but if you see it typed, it is a downward curved line. The teacher aggressively corrected me by saying: “that’s not how you do that”. Flash forward to college while I was studying in Germany for the semester…turns out it is a way to write your 9’s. It’s all about perspective and finding what works for you in your life.\nWhat advice would you give a teenager about success?\nIf I had one piece of advice I would give a teenager, it would be to change your thought process from comparing yourself to others to comparing yourself to your previous performance.\nWhat failure have you learned the most from?\nI failed my initial Certified Flight Instructor Checkride. It consisted of a 6 hour oral exam followed by a 2 hour flight. I passed the oral exam, but I failed on the flight portion about a quarter of the way through. Once you are told you have failed a Checkride, you are allowed to continue attempting the remaining portion of the exam. Up to this point in my aviation career, I had never failed anything, so it was new for me. I chose to continue with the Checkride. I passed the remaining portion of the flight. The next day, after receiving retraining, I became a CFI. This taught me priorities through compartmentalization. Something negative occurred, but I still had to focus on flying the airplane. In the moment, I knew I could prioritize efficiently and correctly and I have taken that lesson learned into my everyday life today.\nWhat is the hardest part of your job?\nThe hardest part of my job is knowing not every person is capable of being a pilot and it is my responsibility to uphold standards.I have an obligation to protect the aviation industry by producing a pilot who will be safe and competent. Also, I think it is important to advise the student by being transparent, honest, and realistic with their strengths and, sometimes, their strengths are not in the cockpit.\nWhat is the most rewarding/important aspect of your occupation?\nThe most rewarding aspect of being a professor is leading a student from zero knowledge of how to fly (or aviation in general) to being a well-rounded professional in the aviation industry. There is a certain time during the semester in which it just “clicks” for a student. You can see a change in their eyes when they switch from confusion to confidence. That’s a cool observation to have!\nWho is your greatest mentor/inspiration?\nI would have to say my dad. Many years ago, I called him asking for advice. After I got through explaining the situation (which I thought was the biggest problem in the world at the time), he took a breath and asked me, “Does it matter?”. I knew he was asking me to compare this to my values to evaluate if my thought process aligned or not. I take this statement and apply it to challenging aspects of my life to help provide clarity. He had a Line of Duty Death in 2014 while working for the Omaha Fire Department, but I can still hear the words.\nCARISA HAMRELL\nAge: 39\nCompany and Title: Altana Federal Credit Union\nHometown: Billings\nEducation and/or Background: High School Diploma from Skyview High School\nWhat other passions/callings are part of your life?\nI'm someone who feels most at home outdoors, whether I'm soaking up the sun, walking my dog, or heading out for a good hike. I love staying active, exploring nature, and finding little moments of peace in the fresh air.\nWhat is the worst advice you’ve received and why?\nDon't show emotion, it makes you weak. In my line of work, showing emotion and empathy isn't optional-it's essential. I build real connections with my members and support them as they make meaningful changes in their lives. Their progress and their stories inspire me, and they're the reason I come to work every day.\nWhat advice would you give a teenager about success?\nThe advice that I would give my teenager self is success isn't about having everything figured out early-it's about being willing to grow. Don't rush yourself. The path you take doesn't have to look like anyone else's. Stay curious, try things even if you're scared, and don't be afraid to change directions if something no longer feels right.\nWhat’s your guilty pleasure?\nMy guilty pleasure is cuddling with my dog on the couch while watching a little bit of \"trash\" TV-a perfect way to unwind and recharge.\nWhat is one professional accomplishment you still want to achieve?\nOne professional accomplishment I want to achieve is being awarded the CARES award. This is an award that employees of Altana FCU nominate. It's an opportunity to recognize a co-worker for the good things they do on a regular basis.\nWhat is the hardest part of your job?\nOne of the hardest parts of my job is caring too much. When I'm deeply investing in my members and employees, it's easy to take their struggles home with me. That level of care can be meaningful, but it can also become heavy-and learning to balance compassion with healthy boundaries is an ongoing challenge.\nWhat was the last show you binge-watched?\nThe last show I binge-watched was the Summer I Turned Pretty.\nWhat is your favorite book?\nMy favorite books right now are anything by Colleen Hoover. I love getting lost in her emotional, fast-paced stories.\nWhat is the most rewarding/important aspect of your occupation?\nThe most rewarding aspect of my work is helping members build or repair their credit after a life-changing situation. Being able to guide them toward financial stability and seeing the positive impact on their lives is incredibly fulfilling.\nWho is your greatest mentor/inspiration?\nI've always admired a previous branch manager I had, who consistently pushed me out of my comfort zone. She was an incredible leader who wore many hats-balancing her role as manager, being a supportive mentor, contributing to the community, and serving on multiple boards. Watching her lead with dedication was truly inspiring.\nDo you have a motto that you live by?\nOne of the guiding principles I live by is that worrying is like a rocking chair, it gives you something to do, but it gets you nowhere. I can sometimes overthink situations but keeping this perspective has helped me stay focused, move forward, and approach challenges with clarity and confidence.\nWhat advice would you give to anyone wanting to start a new business or excel in a business or field?\nStart a business around something you love, even if it's not yet your strongest skill. Passion will drive you through challenges and motivate you to learn and grow. Combine your enthusiasm with persistence, adaptability, and a willingness to learn.\nWhat’s the greatest gift you ever received? Why?\nThe most meaningful gifts that I received are handwritten notes expressing gratitude for my efforts in helping others achieve better outcomes. Such acknowledgements reflect the impact of my contributions and the value of fostering positive change.\nKRISTEN HOYER\nAge: 36\nCompany and Title: Workforce Development Manager, Billings Chamber of Commerce\nHometown: Sonoma, CA\nEducation and/or Background: El Dorado High School\nIf you couldn’t do this, what would you do instead?\nIf I weren’t in this role, I’d pursue work that lets me connect deeply with people. I’m drawn to roles where I can listen, guide, and help others recognize their potential, especially those navigating difficult circumstances. Any path that allows me to make a meaningful impact would feel right.\nWhat other passions/callings are part of your life?\nI’m passionate about creating opportunities for people to rebuild and move forward—whether that’s youth discovering their direction or adults seeking a second chance. Being part of someone’s healing, growth, or fresh start is a calling that matters deeply to me.\nWhat is the worst advice you’ve received and why?\nGrowing up, every report card said I ‘needed to stop talking so much.’ If I had taken that advice, or made myself smaller, I wouldn’t be where I am today. My voice and ability to connect with people have become my greatest strengths.\nWhat advice would you give a teenager about success?\nSuccess isn’t limited to one path. College opens amazing doors for many people, but some talents don’t require a degree; they just need to be discovered and developed. There are also great opportunities in the trades and hands-on careers that lead to strong, rewarding futures. Keep an open mind, because success can be built in many different ways.\nWhat’s your guilty pleasure?\nMy guilty pleasure is simple: cheese pizza and anything involving bread. Give me a fresh baguette with oil and vinegar, and I’m perfectly content.\nWhat is one professional accomplishment you still want to achieve?\nI want to help colleges and trade schools create short, accessible learning opportunities that give students real exposure to a wide range of careers. My goal is to bridge the gap between graduating high schoolers and the workforce needs of our community by giving them practical tools, experiences, and pathways to explore.\nHow do you measure your own success?\nI don’t measure success by money or titles. For me, success starts at home. If I’m raising kind, capable humans who will go out into the world and do even greater things, that’s the truest measure of success.\nWhat failure have you learned the most from?\nI’ve learned the most from failed friendships and relationships. Taking accountability frees me, and my faith reminds me to offer grace. Even when something fails, I don’t have to stay stuck, I can learn and move forward.\nWhat is the hardest part of your job?\nThe hardest part of my job is seeing how many workforce needs go unmet simply because awareness or access isn’t there yet. We have incredible opportunities in our community, but connecting the right people to the right paths, especially young people, takes time, persistence, and a lot of collaboration.\nWhat is the most rewarding/important aspect of your occupation?\nThe most rewarding part of my work is connecting with businesses and their owners at every stage of their journey.\nWho is your greatest mentor/inspiration?\nMy greatest inspiration is Jesus. His example challenges me daily to lead with compassion, extend grace, and love people well. I’m surrounded by amazing mentors, but His influence is the foundation for how I try to show up in both my work and my community.\nDo you have a motto that you live by?\nA motto I live by is ‘everything is 'figureoutable.’ My husband reminds me of that often, and it keeps me grounded when life feels chaotic.\nHow do you view failure and success?\nI see failure as a chance to learn, and success as the result of accountability; staying honest with yourself, owning your actions, and doing the work to improve. Both are essential if you want to grow.\nWhat’s the greatest gift you ever received? Why?\nThe greatest gift I’ve ever received is forgiveness. When you’ve been on the receiving end of someone’s grace, especially at a moment when you felt too far gone, there’s nothing more meaningful. It changes you.\nSHAE SAUNDERS, MD\nAge: 38\nCompany and Title: Riverstone Health, Faculty Physician\nHometown: Bozeman\nEducation and/or Background: Undergraduate: Metropolitan State University of Denver, B.S. Medical School: American University of Antigua, M.D., Residency: Montana Family Medicine Residency\nWhat other passions/callings are part of your life?\nOne of my strongest passions outside of my day-to-day work is advocating for women who are underserved or at risk. I spend a lot of time learning about women’s health and the persistent gaps in how we diagnose, treat, and truly understand women’s medical needs.\nWhat is the worst advice you’ve received and why?\nThe worst advice I’ve ever received was to “keep your head down, stay quiet, and don’t question things.” That mindset can prevent progress and holds people and organizations back. Processes and systems should absolutely be challenged, re-evaluated, and improved. And honestly, anyone who knows me knows that staying quiet isn’t really my style. Speaking up, asking why, and pushing for better solutions has consistently led to stronger collaboration and better outcomes in every environment I’ve worked in.\nWhat advice would you give a teenager about success?\nDo not let people think that you do not belong. You may look, think, or act differently from those around you, but that doesn’t diminish the value of your input, insight, or your right to a seat at the table.\nWhat’s your guilty pleasure?\nMy guilty pleasure is definitely skincare and makeup—I’m completely obsessed.\nWhat is one professional accomplishment you still want to achieve?\nI hope to advocate for healthcare in Montana—and for Montanans—on a national level. I’m incredibly proud to be from here, and it’s a big part of why I chose to come back to practice. Montana faces unique challenges in healthcare and its delivery that many other regions do not, and I'd love to help get increased funding and resources our healthcare system needs to better serve our communities.\nHow do you measure your own success?\nI measure my success through the lens of the people around me. Success, to me, is not just about personal achievements but also about how I contribute to the well-being and growth of those I interact with.\nWhat failure have you learned the most from?\nI wouldn’t point to a single failure, but early in my career I realized I needed to become a much stronger communicator. I used to assume that if something felt obvious to me, it didn’t need to be said—and that the team would naturally be on the same page. I learned quickly that this isn’t always true.\nWho is your greatest mentor/inspiration?\nMy greatest mentors are my parents. My father, a lifelong educator, taught me that people matter most, to choose the right thing over the popular thing, and to serve others with integrity. My mother’s strength, honesty, and determination have been central to my growth, especially as a woman in medicine.\nDo you have a motto that you live by?\n\"Don't get lost in the sauce.\"\nWhat advice would you give to anyone wanting to start a new business or excel in a business or field?\nI’m not a titan of industry, but the advice I always come back to is this: be passionate, be genuine, and be resilient.\nHow do you view failure and success?\nI've had to learn to view failure as information and data — not as my identity. It’s a natural part of growth and helps reveal where improvement is needed. On the other hand, I see success as a shared effort and an ongoing process, not a finish line. It shows me what’s working, what to reinforce, and how to build sustainable results.\nWhat’s the greatest gift you ever received? Why?\nIt may sound cliché, but the greatest gifts in my life are my husband and my daughter. My daughter is pure magic—she brings so much light into my world and gives me an entirely new sense of purpose. My husband is the most selfless, patient, and loyal person I know. I feel incredibly lucky to have him in my corner. I’m able to shine as brightly as I do because he’s always there, supporting me quietly and wholeheartedly. I truly don’t know what I would do without him—his steady, unwavering love is something I hold incredibly dear.\nALLISON REITZ\nAge: 30\nCompany and Title: Finance Analyst, First Interstate Bank\nHometown: Lake Ozark, Missouri\nEducation and/or Background: Bachelor of Science, Business Administration Management, Minor in Marketing from Montana State University Billings\nIf you couldn’t do this, what would you do instead?\nIf I was not in the banking industry, I would want to be in artist management for musicians.\nWhat is the worst advice you’ve received and why?\nThe worst advice I have received is to not socialize or talk at work. I believe it is important for co-workers to socialize and talk at work as it helps in building relationships and connections with each other, which in turn makes for a healthy work environment for all people involved. It also shows that even though it is a work environment, the people you work with are more than just an employee at a company, but a real person with real life issues and feelings.\nWhat’s your guilty pleasure?\nRomance movies, tv shows, and books.\nWhat is one professional accomplishment you still want to achieve?\nOne professional accomplishment I still want to achieve is to become a Finance Manager within the company I work for.\nWhat failure have you learned the most from?\nWhen I first started my career at my current employer, the person who trained me did not train me correctly on the tasks I was to do each day, which caused a lot of long, frustrating days where I felt like I maybe was not on the right career path. I learned a lot during this time of my career, and it helped me to learn a lot of things on my own and to help me grow my knowledge of the company and of my job overall. I look back and am grateful that I had that experience, even though at the time it was not a great experience.\nWhat is the hardest part of your job?\nThe hardest part of my job is time management and being organized. There are a lot of days where I am pulled in different directions for many different reasons, and I have to make sure that everything gets done, so being organized and having good time management is a must in my career.\nWhat is the most rewarding/important aspect of your occupation?\nThe most rewarding aspect of my occupation is seeing my co-workers succeed and do well each day. I do a lot of training in my career with my co-workers, so seeing them grow their knowledge and understanding more and more each day is rewarding for me.\nWho is your greatest mentor/inspiration?\nMy husband. He has come so far in his own career and seeing him have the accomplishments that he has had, inspires me to want to have the same things in my own career. He pushes me to be better in my career and in my personal life. He is a big part of why I am where I am today.\nDo you have a motto that you live by?\n\"You can do anything you set your mind to\" is the motto I live by. I believe that if you are driven and work hard for what you want, you will succeed and can get anything you want in life.\nHow do you view failure and success?\nI view failures as learning lessons and stepping stones to success. Without failures there would be no success, as failures teach us what not to do; so that we can make better decisions going forward.\nWhat do you do for fun/relax/hobby?\nCooking, traveling with my family, spending time with my family, and reading are some of my most relaxing and fun times that I have.\nWhat’s the greatest gift you ever received? Why?\nThe greatest gifts that I have received are my husband and my son. Everything that I do, I do for both of them, and they both push me to be better in every aspect of my life. Making them both proud is what I strive to do each and every day. I am so lucky to have them both in my life.\nKACI JANSMA\nAge: 39\nCompany and Title: RiverStone Health Bridger/Joliet, Physician Assistant\nHometown: Richey\nEducation and/or Background: BS in Health and Human Performance from MSU-Billings, Masters of Clinical Health Services from MEDEX Seattle at University of Washington\nWhat is the worst advice you’ve received and why?\nIn high school, a well-meaning teacher told me to stop prioritizing sports over the FFA program because I would “never get a sports scholarship to help with college”. While I agree that FFA and 4H are invaluable programs for many, I continued to follow sports and didn’t have to pay for the first 4 years of college thanks to volleyball. I’m grateful I didn’t take his advice!\nWhat advice would you give a teenager about success?\nThere is no such thing as inherited success. Achieving goals and progress takes lots of hard work, failures, setbacks and obstacles. Do not be discouraged and get creative about working through and around those difficulties. The work will eventually pay off and your scars and callouses will benefit you greatly.\nHow do you measure your own success?\nIf I can drive to work every day to join teammates I love while caring for patients who feel prioritized, I am succeeding greatly. My measurement of my own success is based solely on how much my cup is filled by my work and the care I’m providing for my patients.\nWhat failure have you learned the most from?\nMy failures have certainly been some of my greatest teachers. After I returned to work from my second maternity leave, I struggled greatly with finding balance with work and home life. I lost some quality of life, and it impacted my work and more importantly my family. Thankfully, my incredibly supportive husband helped guide me through the transition.\nWhat is the hardest part of your job?\nThe hardest part of practicing medicine today is seeing the gap between patients and the care they need due to insurance policies and the seemingly arbitrary coverage of various treatment options. It’s equally devastating to see the frequent changes in insurance coverage and access to resources for some of our area’s most vulnerable citizens. Many of my patients live well below the poverty level. This gives way to creativity in finding methods to appropriately care for my patients, but it is often a hopeless feeling to navigate.\nWhat is the most rewarding/important aspect of your occupation?\nThe most rewarding aspect of my job, and by far my favorite part, is the fact that as a community member, I get to take care of my friends, neighbors, church family, mail carriers, horse ferries, and countless other social connections. This gives me the unique and fortunate opportunity to truly love and personally invest in the health and wellness of my patients. I take a great deal of pride in my very personalized style of practice and feel that the compassion exuded from each member of the staff at Bridger and Joliet makes our small clinics a safe haven for people to feel genuinely prioritized.\nWho is your greatest mentor/inspiration?\nI am constantly aspiring to be like my dad, Larry Switzer. He is the epitome of a cowboy; a generous man of few words with an upright character based on unwavering work ethic and Christian morals. He sets a high standard I love working toward in my personal and professional life. I’m also incredibly grateful for several coworkers of mine like Dr. Megan Littlefield, Dr. Garth Brand, and Jeanie Mentikov.\nWhat do you do for fun/relax/hobby?\nI am so fortunate to be able to share a hobby with my husband and two daughters on our small horse ranch. We love riding, teaching our girls good horsemanship, and helping family and friends with ranch and cattle work whenever we get the chance.\nWhat’s the greatest gift you ever received? Why?\nFirst, my husband, Seth, and my two young daughters, Seeli Rae and Haddli Bel. They are the greatest gifts in the world. They are some of my favorite parts of myself. Second, my Dyson stick vacuum, because I live with the aforementioned humans and one stinky cow dog.\nSHELBY WILLLIAMS\nAge: 35\nCompany and Title: Century 21 Hometown Brokers, REALTOR\nHometown: Avon, SD\nEducation and/or Background: Bachelors Degree in Marketing from the University of Wyoming\nWhat is the worst advice you’ve received and why?\n\"You can do anything at half-effort.\" I don't think it's possible to be successful unless your whole heart's in it.\nWhat advice would you give a teenager about success?\nNo matter what it is you're doing, try hard, listen well, and invest early. Limit social media and commit to getting involved in-person. We're a product of the people we spend the most time with, so choose your circle wisely and know it's okay to cut relationships that no longer serve you.\nWhat is one professional accomplishment you still want to achieve?\nI plan to obtain my Broker's license someday and grow our team to better serve our clients and ensure each family is getting the attention they deserve.\nHow do you measure your own success?\nBecause I take so much pride in my work, I'm always flattered by a referral. It's the best compliment. The production plaque is just a number - it's the positive client feedback and return business that helps me gauge success. Real estate is a lifestyle and a career and I truly feel like I have work-life balance, which has been the goal all along.\nWhat failure have you learned the most from?\nWhen I was a senior in high school, I wanted to run the mile to try to break our school record. I typically ran shorter distances so it was intimidating. I decided I was 'too tired' that day and never got another opportunity. Since then, when something comes along I'd like to attempt - even if it's scary - I recall the regret from not trying at all.\nWhat is the most rewarding/important aspect of your occupation?\nThere is nothing better than a kiddo picking out their room and a parent with tears in their eyes. It's the best to be part of a new chapter for people. I keep a framed, hand written letter in my office from a client's daughter, thanking me for their new home. She's in high school now, but it still stands as one of my “whys.” It's so fun when I get integrated into families and clients turn into friends.\nWho is your greatest mentor/inspiration?\nI have several, but top of the list is my husband. He makes me want to be better and is the most logical person I've ever met. He's grounding and encouraging and has supported my career choice over and over as a true partner. Then there's Julie Seedhouse who's hashtag life goals. She's charismatic, smart, well spoken, futuristic, and goes after what she wants. She is a stellar friend that has taught me so much about life and real estate. I am so lucky.\nDo you have a motto that you live by?\nI find myself often saying, \"I'll cross that bridge when I get there.\" It reminds me to take one day at a time and although it's good to anticipate the future, it's not healthy to worry yourself to death about hypotheticals.\nWhat advice would you give to anyone wanting to start a new business or excel in a business or field?\nPersistence and consistency is key and be proud of what you're doing. I made a huge mistake being timid early on. I was afraid people would think I only see them as a transaction and glazed over the fact that I am here to help, if they want it. I love what I do and I should have been shouting it from the rooftops.\nWhat’s the greatest gift you ever received? Why?\nMy sisters. We've built a special bond growing up together and kept that intact. We're all the same, but a fraction different and there is massive comfort being able to confide in someone that understands you like no other. Our names have changed, but we're forever The Williams Girls. Oh, and my parents are pretty cool, too.\nREBECCA BUNN\nAge: 39\nCompany and Title: Controller at Montana State University Billings\nHometown: Billings\nEducation and/or Background: Bachelor of Science in Business Administration - Accounting from Montana State University\nIf you couldn’t do this, what would you do instead?\nI would probably work with animals; maybe open a pet boutique.\nWhat other passions/callings are part of your life?\nMy family is my greatest passion. My roles as a mother and wife are the most rewarding parts of my life.\nWhat is the worst advice you’ve received and why?\nThe advice \"Good things come to those who wait.\" You can't just sit back and expect good things to happen. Patience is absolutely a key virtue, but the real magic happens when you combine that patience with dedication and hard work toward your goals.\nWhat advice would you give a teenager about success?\nMy advice is to stop worrying about making mistakes. They're an inevitable part of being human. Instead, embrace them as learning opportunities that help you grow.\nWhat’s your guilty pleasure?\nReality TV and chocolate.\nWhat is one professional accomplishment you still want to achieve?\nOnce my son is older, I would like to go back to school and get my MBA.\nHow do you measure your own success?\nSuccess to me is setting goals, making changes, and feeling happy and content in what I am doing.\nWhat failure have you learned the most from?\nEarly in my career, I stayed in a position longer than I should have. I was working nearly every evening and weekend, which led to burnout and feeling unappreciated. This was a valuable lesson, teaching me the importance of a healthy work-life balance. Now I prioritize efficiency and set clear boundaries to ensure I can deliver my best work and still have time for my family.\nWhat is the hardest part of your job?\nImplementing new accounting standards can be challenging.\nWhat was the last show you binge-watched?\nThe Secret Lives of Mormon Wives. Did I mention that Reality TV is a guilty pleasure!\nWhat is your favorite book?\nI'm not sure if I can narrow it down to one book, but if I had to pick a book series, it would definitely be Harry Potter. I've read the books at least a dozen times and even got engaged in front of the Hogwarts castle at Universal Studios.\nWhat is the most rewarding/important aspect of your occupation?\nProblem solving is the most rewarding aspect of my work. Accounting is like a giant numerical puzzle, so when something doesn't go as expected, it's a challenge to figure out the problem. I enjoy analyzing the financial data to identify complex issues and find solutions.\nWho is your greatest mentor/inspiration?\nMy greatest mentor and inspiration is my mother. Beyond being a fantastic mother and friend, she possesses an incredible work ethic that she instilled in me. I watched her build her career from the ground up, starting in the mail room and ultimately rising to Vice President of Operations in banking, and now serving as a Bank Examiner. She showed me just how much can be achieved through dedication, hard work, and commitment.\nDo you have a motto that you live by?\nProgress, not perfection.\nWhat advice would you give to anyone wanting to start a new business or excel in a business or field?\nDo your research and set realistic goals for yourself and your business.\nHow do you view failure and success?\nWe all make mistakes and sometimes fail, but it's the lessons that we learn along the way that make us successful.\nWhat do you do for fun/relax/hobby?\nI have a one year old, so most of my free time is spent chasing after him. I also love traveling, reading, knitting, board games, and spending time with family and friends.\nWhat’s the greatest gift you ever received? Why?\nMy son and my husband. They bring so much laughter and happiness into my life.\nCOREY STREMCHA\nCompany and Title: Cushing Terrell - Design Lead\nHometown: Billings\nEducation and/or Background: Bachelor of Arts in Environmental Design and a Masters degree in Architecture.\nIf you couldn’t do this, what would you do instead?\nIf I wasn’t or couldn’t do what I am doing now, I think I would like to be involved in healthcare. My passion for architecture stems from its power to directly impact quality of life. Similarly, healthcare provides this opportunity and would fulfil my need to work in a field dedicated to public good.\nWhat other passions/callings are part of your life?\nI pursue art as a core passion, using my creative practice to produce original pieces. My mission is to ensure my art has a positive impact by contributing it to private organizations that can benefit from the donation, whether for auction, fundraising, or a charitable benefit. This is something I enjoy doing and allows me to create on my own time.\nWhat is the worst advice you’ve received and why?\nPerhaps the worst advice I have received is waiting for the right moment or right time to pursue your goals. There is no right moment. The advice to simply wait is problematic because it operates under a flawed premise; that there is a perfect, predictable moment when all factors will align, obstacles will disappear, and success will be guaranteed. Grab your opportunities.\nWhat advice would you give a teenager about success?\nI would advise a young person to define success on their own terms and set goals that align with their personal values and fulfillment. Remember to be patient—in a world of instant gratification, true success is rarely achieved overnight.\nWhat’s your guilty pleasure?\nA guilty pleasure I happen to have are the wonders of trash television. I like to provide commentary and assess the absurdity of the situations at hand. I may be among the best in this field.\nWhat is one professional accomplishment you still want to achieve?\nI find the most exciting part of my profession is that there is no 'final' accomplishment; it's a commitment to continuous advancement. However, my next significant goal is to hopefully provide mentorship, lead to the best of my abilities, work on becoming great at my craft and to hopefully one day be in a position of upper-level leadership.\nHow do you measure your own success?\nSuccess to me means that my daily work and efforts are aligned with my core values and professional goals. In architecture I get the rare opportunity to create usable spaces and structures. Hopefully these spaces enrich the environment and add to the world in a positive manner. The adage of, leaving a place better than when you found it.\nWhat failure have you learned the most from?\nI fail nearly everyday. I think the important thing is that you understand and grow from these failures and that sometimes setbacks are necessary for you to grow.\nWhat is the hardest part of your job?\nThe hardest part of my job may be time. The world moves very quickly and the expectations of response seem to have kept pace. So, I think turnaround, particularly in design, has become increasingly more difficult, making the process faster and perhaps more complex.\nWhat was the last show you binge-watched?\nHaha... oh boy. “The Garden” a strange profile on people who have created their own society. It’s wacky.\nWhat is your favorite book?\nAdventures of Huckleberry Finn.\nWhat is the most rewarding/important aspect of your occupation?\nCreating something greater than myself.\nWho is your greatest mentor/inspiration?\nMy father.\nDo you have a motto that you live by?\nYou’ll never know what another man doesn’t know. – Jack Benjamin\nHow do you view failure and success?\nI will take the low hanging fruit here. However, I firmly believe that success cannot be achieved without failure. Embrace your failures and try to grow and learn from them.\nWhat’s the greatest gift you ever received? Why?\nThe greatest gift I have received is my sense of humor, hopefully my compassion and lastly my education. All of these I owe my life to.\nMARK SCHAEFER\nAge: 36\nCompany and Title: Emergency Physician at St. Vs, Transfer Center Medical Director\nHometown: Bozeman\nEducation and/or Background: Bachelors in Science from Montana State University, MD at the University of Washington/MT WWAMI, Emergency Medicine Residency at Loma Linda University\nIf you couldn’t do this, what would you do instead?\nMountain bike, ski, hike, and if making ends meet didn't matter, try my hand at a little farming.\nWhat other passions/callings are part of your life?\nSpending time with my family, and being outside.\nWhat is the worst advice you’ve received and why?\nNothing stands out, but the best advice I've been given is to work where I would vacation.\nWhat advice would you give a teenager about success?\nIt's bound to be a rocky road, but if you put in the time and the effort you will eventually get there.\nWhat’s your guilty pleasure?\nPlowing snow with my 65 year old Oliver tractor.\nWhat is one professional accomplishment you still want to achieve?\nRetire.\nHow do you measure your own success?\nFor better or worse I tend to ignore success, and rather look at my mistakes.\nWhat failure have you learned the most from?\nI don't think there is any singular failure that I have learned from the most, everyday has lessons to be learned.\nWhat is the hardest part of your job?\nOur societal failures to address myriad social issues from drug addiction to homelessness to mental health.\nWhat was the last show you binge-watched?\nMasters of the Air.\nWhat is your favorite book?\nOne Man's Wilderness by Richard Proenneke.\nWhat is the most rewarding/important aspect of your occupation?\nHelping Montanans, and working with the transfer center to ensure that rural Montanans can get the care they need in an efficient manner when their community can't provide the resources they need.\nWho is your greatest mentor/inspiration?\nRonald Loge MD, an internist in Dillon, MT who I had the opportunity to work with during medical school.\nDo you have a motto that you live by?\nEveryday is a gift, to be taken literally and sarcastically\nWhat advice would you give to anyone wanting to start a new business or excel in a business or field?\nThe decisions made by those under your leadership often reflect on your leadership, take ownership of that.\nHow do you view failure and success?\nEveryone experiences successes and failures. How you celebrate successes, and how you react to and learn from your failures defines you.\nWhat do you do for fun/relax/hobby?\nI spend time with my family, and enjoy the outdoors and the state I have called home my whole life.\nWhat’s the greatest gift you ever received? Why?\nMy family, friends, and education are gifts that never lose their value.\nGREG ADERS\nAge: 31\nCompany and Title: Advanced Care Hospital Montana; Director of Therapy\nHometown: Billings\nEducation and/or Background: Doctorate of Physical Therapy from the University of Mary\nWhat other passions/callings are part of your life?\nI have become more involved with our family and faith in order to lead as a role model for my children. I have noticed education is becoming more of a calling as my career grows. I had so many great opportunities as a student, so I hope to shed this light to others. I have had many students under my direction on clinical rotations; and have been on many educational panels and calls for lectures at a few of these universities.\nWhat is the worst advice you’ve received and why?\n\"Fake it until you make it\". I hear this from time to time, but in the medical field it does not yield the best results. We take a lot of pride in our knowledge base and trust with the community and patients. Genuinely being honest if you do not know an answer is perfectly fine! You will gain a lot more respect from peers and yourself this way.\nWhat advice would you give a teenager about success?\nIt will not be something that will be given right away, but rather something to work towards. Your appearance and growth is built early on, such as in high school or college, and many will take note of your work ethic, time management, etc. to build early success. I have found goal writing to be extremely helpful to not only keep me on task, but push myself more than I thought I could.\nWhat’s your guilty pleasure?\nHas to be jamming out to Backstreet Boys!\nHow do you measure your own success?\nI measure success by my patient outcomes and my relationships with peers and colleagues who have told me positive influences of our therapy department. Simple interactions on a day to day basis such as sharing a laugh with our patients are just as good! At the end of the day I chose PT to help others return to their prior levels and allowing families and patients to achieve this makes it all worth the while.\nWhat failure have you learned the most from?\nNot all situations are created equal. I think in health care it's easy to see how doing something one way successfully could possibly work on someone else, but that is usually not the case. There are many layers to success and over time I have learned to take more time and effort towards support and resources to also assist with a successful transition, rather than falling into the same approach/treatment for everyone.\nWhat is the hardest part of your job?\nNot being able to fix something that a patient desperately is giving their all to fix. A prime example in my work is for those with a diagnosis such as a stroke that will not allow them to return to their previous activity as they knew it. I see it working with our younger spinal cord injuries as their lives have completely changed. This is emotional and difficult to see, however being able to help a patient in any way to see a new lease on life and a new level of mobility to be independent again make these situations the best in the end!\nWho is your greatest mentor/inspiration?\nI would have to start with my parents for providing an excellent foundation and creating great role modeling to allow myself to push myself in all aspects. I further gained a lot of insight and respect for my director of the PT program at the University of Mary.\nDo you have a motto that you live by?\n\"The true test of a person's character is how they treat the people in life that they don't need.\"\nWhat’s the greatest gift you ever received? Why?\nMaterial possessions come and go, but the wonderful gift of my 2 children with my wife have topped all. It has made a realization of my own parents' sacrifices and an appreciation of my own upbringing.\nBEN GLEASON\nAge: 33\nCompany and Title: Montana FWP (Fish, Wildlife & Parks), Region 5 Game Warden Sergeant\nHometown: Billings\nEducation and/or Background: Bachelors of Science in Ecology/Fish and Wildlife Management from MSU Bozeman\nIf you couldn’t do this, what would you do instead?\nIf I couldn't work in law enforcement, I'd love to open my own weight lifting gym.\nWhat other passions/callings are part of your life?\nMy biggest passion is being a dad. Although my kids are still very young, there is nothing more fulfilling than watching them succeed in things they are just learning or trying. My kids love to go in the garage and \"lift weights\" with dad as we listen to heavy metal music.\nWhat is the worst advice you’ve received and why?\nI try to filter out bad advice, but the worst advice I've received is when things aren't going your way, you just gotta hold on and hope for the best.\nWhat advice would you give a teenager about success?\nYour parents have your best interests in mind. Listen to them; they actually have \"been there and done that\" before.\nWhat is one professional accomplishment you still want to achieve?\nEventually I want to start my own firearms training company with my brother-in-law.\nHow do you measure your own success?\nMy success as a first line supervisor is measured by my team completing the mission of the agency. Equally as important, success is measured in the well-being of my team.\nWhat failure have you learned the most from?\nI learned the most from applying for the Sergeant position early on in my career and not getting selected. After going through the process, I learned a ton about my deficiencies and where I needed to improve. Based on that, I searched for specific leadership opportunities so I could build the skillset required to be successful as a Sergeant. A couple years later, I was selected as the Billings area Sergeant.\nWhat is the hardest part of your job?\nThe hardest part of my job is motivating and inspiring my staff when morale is low, but this is also one of the most rewarding parts of the job.\nWhat was the last show you binge-watched?\nHomeland on Netflix.\nWhat is your favorite book?\nJoe Pickett book series by C.J. Box.\nWhat is the most rewarding/important aspect of your occupation?\nThe most rewarding aspect of my current position with FWP is watching the individuals I supervise find success. As an instructor and first line supervisor, a significant portion of my job is ensuring my staff are receiving the training, equipment, mentorship, and experience they need to investigate wildlife crimes and hold those responsible accountable.\nWho is your greatest mentor/inspiration?\nSheriff Keifer Lewis in Prairie County Montana has been an incredible mentor, both personally and professionally. He has been there to listen, offer advice, learn from failures, and celebrate successes. He even officiated my wedding!\nDo you have a motto that you live by?\nWe don't stop playing because we grow old; we grow old because we stop playing. — George Bernard Shaw\nWhat advice would you give to anyone wanting to start a new business or excel in a business or field?\nNot everyone you work with or for has your best interests in mind. It's up to you to figure out which ones do.\nHow do you view failure and success?\nFailure is necessary for growth and development. Success is a result of learning from your failures, and making true change so those same failures do not happen again.\nWhat do you do for fun/relax/hobby?\nHunting/fishing, backpacking, camping, working out, and doing anything with my family.\nWhat’s the greatest gift you ever received? Why?\nMore than anything I’ve achieved or received, having amazing parents has been my greatest gift. Their support, sacrifices, and unconditional love mean more to me than words can fully express. Anyone who has spent time around Don and Linda Gleason has surely been impacted by their generosity, hospitality, and love for everyone around them.\nDYLAN MECCAGE\nAge: 30\nCompany and Title: Stockman Bank of Montana, Commercial Loan Officer\nHometown: Laurel\nEducation and/or Background: Bachelors Degree - Business Administration, Montana State University Billings\nIf you couldn’t do this, what would you do instead?\nIf I were given the opportunity and an unlimited budget, it would be fun trying to make it as a caddie on the PGA Tour. It would be a lot of work, but rewarding. If not that route, working for an MLB Team analyzing statistics.\nWhat other passions/callings are part of your life?\nI love to explore the outdoors, hiking/fishing in the summer, hunting in the fall. Occasionally, I enjoy a good round of golf. Additionally, I am an assistant coach for the Lockwood High School boys' basketball team – which is a great way to give back and help these young men develop both on and off the court.\nWhat is the worst advice you’ve received and why?\n\"Fake it until you make it\". Authenticity is key to long-term success. Be yourself. Be curious, ask questions, continue to show up, and do the work.\nWhat advice would you give a teenager about success?\nSurround yourself with people who are going to push you to be better, both as a person & professionally. Always be curious and work hard. Just keep showing up and doing the work. You'll be glad you did.\nWhat’s your guilty pleasure?\nSports card collecting. It's fun traveling to shows and selling cards, interacting with folks who enjoy the hobby and see what's popular and who's collecting what.\nWhat is one professional accomplishment you still want to achieve?\nTaking the next step within Stockman Bank and being a part of the management team.\nHow do you measure your own success?\nI tend to write down my goals (short-term and long-term). For me, it helps to have a vision on how to attack each goal. It's important to celebrate those achievements big or small. It will keep you hungry for more.\nWhat failure have you learned the most from?\nLosing can teach you a lot, as can winning. For example, when you lose - a person tends to ask the question \"What could I have done better or differently?\" How can I better prepare myself for the next time I face that situation to make sure I get a win? When you win, you can reflect on how you were able to get to the mountain top, what areas you dominated and what areas need to be fine-tuned. To keep it simple, you can learn from both failure and success - but you must make the time to reflect on both wins and losses.\nWhat is your favorite book?\nEleven Rings: The Soul of Success. This is a memoir by Phil Jackson (NBA Coach).\nWhat is the most rewarding/important aspect of your occupation?\nThe best part of my job is helping people. I get to work with some of the coolest people in town, and am able to use the tools I have at Stockman Bank to help grow and service their business needs on a day-to-day basis. My job is very rewarding.\nWho is your greatest mentor/inspiration?\nMy dad, he's my greatest mentor. My dad is the true definition of Grit. He has the \"nobody cares, work harder\" mentality. He's been a solid rock for me and my brother, and most importantly my mom. Whenever he commits to something, you can always expect 100% effort. He defines True Grit leads to True Success.\nWhat do you do for fun/relax/hobby?\nI have a passion for the outdoors, whether it be hiking the hills for elk antlers or fishing the Stillwater River, it's great for the mind to escape from the day-to-day grind. My favorite time of year is heading down to the wall tent with my friends for a week chasing deer and elk; a great time to hit the reset button.\nWhat’s the greatest gift you ever received? Why?\nMy family. I was blessed with great parents and grandparents who paved the way for me and taught me many valuable life lessons.\nTUCKER BING\nAge: 33\nCompany and Title: Director of Heart, Lung, and Vascular Services - Billings Clinic\nHometown: Santaquin, Utah\nEducation and/or Background: Finance Degree from Utah State University and Masters Degree in Healthcare Administration from the University of Minnesota\nIf you couldn’t do this, what would you do instead?\nI have always said I would want to be a forest ranger.\nWhat other passions/callings are part of your life?\nSpending time outside and seeing the amazing wilderness in Montana.\nWhat is the worst advice you’ve received and why?\nI had a leader tell me once that I should just be happy where I was and not strive to be any better. If we aren't striving to learn and be better, then work and life can be really unfulfilling, and many of the breakthroughs we have would never occur.\nWhat advice would you give a teenager about success?\nThere is no perfect path to success and happiness. As teenagers, sometimes we are sold this linear path to success, but success is different for everyone, and the path to get there is bumpy. Define what happiness means to you, and don't worry about what other people think.\nWhat’s your guilty pleasure?\nChocolate chips!\nWhat is one professional accomplishment you still want to achieve?\nThere are a lot of things I would still like to achieve, but I would like to continue to grow services in Billings for the Heart, Lung, and Vascular service lines in a way that allows people from the greater geographic area to get the care they need without long wait times and/or long travel times.\nHow do you measure your own success?\nAllowing the people I lead to be successful is the biggest measure of my own success. If my team (in a professional setting) and my family (in a personal setting) are thriving, then I am successful.\nWhat failure have you learned the most from?\nDuring the pandemic, in a previous organization, we bought a practice. It was instant chaos, and there were a lot of mistakes that could have been avoided, but we were able to fix the problems that resulted; and I have a long list of things to not do again.\nWhat is the hardest part of your job?\nMy job is different every day, and the curve balls come all the time. It is almost impossible to anticipate some of the things that happen, and it can be challenging to start each day not knowing how it is going to end.\nWhat was the last show you binge-watched?\nAvatar the Last Air Bender with my kids.\nWhat is your favorite book?\nEndurance by Alfred Lansing.\nWhat is the most rewarding/important aspect of your occupation?\nConnecting the work I do each day to people in the community and greater region who are able to receive care that isn't available in many other places.\nWho is your greatest mentor/inspiration?\nMy maternal grandfather. He lived next door to me until I left home to go to college, and I learned more about hard work from him than anyone else I have known.\nDo you have a motto that you live by?\nLeave things better than you found them.\nWhat advice would you give to anyone wanting to start a new business or excel in a business or field?\nTry not to boil the ocean. Focus on a few things where you are uniquely valuable, and double-down on those things.\nHow do you view failure and success?\nMy family is the most important thing in my life, and I view success through that lens. Everything else in life should support and value my family life, and if something is detracting from that, it deserves a review.\nWhat do you do for fun/relax/hobby?\nGo camping, play outside, and read Harry Potter as a family.\nWhat’s the greatest gift you ever received? Why?\nMy grandmother gave me dozens (maybe hundreds) of books as a child and helped instill in me a love for reading. This has helped me immensely in my academic and now professional life, and it also has given me an outlet for stress and an escape on bad days.\nREBECCA NEWMAN\nAge: 38\nCompany and Title: Newman Restoration, Vice President\nHometown: Sheridan, WY\nEducation and/or Background: BS in Secondary Science Education from MSU\nIf you couldn’t do this, what would you do instead?\nI would go back to teaching or work in some capacity with kids.\nWhat other passions/callings are part of your life?\nBeing a mom, helping my community; especially kids and families in various ways.\nWhat is the worst advice you’ve received and why?\n“You can do it all.” This is not something that someone outright told me, but a perceived notion I had learned somewhere along the way. It's a bad concept that leads to burnout and feeling like a failure. It’s a work in progress but I have learned to ask for help and delegate tasks.\nWhat advice would you give a teenager about success?\nTo measure success internally based on your personal values, interests, and goals. Do not measure your success by comparing yourself to others, everyone is on their own journey and at different places in their lives.\nWhat’s your guilty pleasure?\nToaster strudels!\nWhat is one professional accomplishment you still want to achieve?\nTo grow the company and step out of my day to day operational roles.\nHow do you measure your own success?\nI measure my own success in how well I am balancing my work and home life. Are my kids taken care of and getting enough quality time? Is the culture of our team synergistic and sticking to our core values?\nWhat failure have you learned the most from?\nThere have been many over the years, but from a business standpoint, the most important lesson I have learned is to hire based on our company’s core values. The culture we create and the individual team members create the core of everything we do.\nWhat is the hardest part of your job?\nThe hardest part of my job is balancing the different roles I fill.\nWhat was the last show you binge-watched?\nSullivan’s Crossing\nWhat is your favorite book?\nHarry Potter series.\nWhat is the most rewarding/important aspect of your occupation?\nBeing blessed enough to give back to the communities we serve.\nWho is your greatest mentor/inspiration?\nMy mom. She is tough as nails and never gives up. She taught us to always do our best and have integrity.\nDo you have a motto that you live by?\nLead with Love.\nWhat advice would you give to anyone wanting to start a new business or excel in a business or field?\nThat it’s not just doing the big things right, it is the small things that will set you apart: doing things the right way, not cutting corners, being respectful, having good communication and customer service.\nHow do you view failure and success?\nI view failures as an opportunity to learn and get better. Success is always a moving target, but happiness and health is always a part of it.\nWhat do you do for fun/relax/hobby?\nHang out with my family in the mountains doing various activities, reading, yoga, gardening.\nWhat’s the greatest gift you ever received? Why?\nMy college tuition was paid for by my grandparents. It was such a blessing to graduate without student debt.\nMATTHEW KOTTKE\nAge: 35\nCompany and Title: MK Mechanical Founder and Owner\nHometown: Billings\nEducation and/or Background: High School, 5 year Union Apprenticeship, Master Plumber\nWhat other passions/callings are part of your life?\nI am active in my children’s PTA, Billings Piping Industry JATC. I enjoy interviewing and hiring the next generation of apprentices.\nWhat is the worst advice you’ve received and why?\nThe worst advice I’ve received is to slow down. If I would have listened, I wouldn’t have given life my all, and therefore I wouldn't be where I am now.\nWhat advice would you give a teenager about success?\nTeenagers out there ignore the drama. Find your North Star and work your butt off to get there.\nWhat’s your guilty pleasure?\nMy guilty pleasure is sneaking in quiet outdoor moments like a peaceful walk or a scenic view where I can unplug and just enjoy nature, especially when it turns into quality time with my kids and family.\nWhat is one professional accomplishment you still want to achieve?\nOne professional accomplishment I still want to achieve is expanding my business across all of Montana, building a strong presence statewide while continuing to deliver high-quality work and meaningful impact in every community I serve.\nHow do you measure your own success?\nI measure my success by the balance I maintain between professional growth and personal fulfillment—seeing my business grow and make an impact, while still having the time and presence to enjoy the outdoors and be fully present for my children and family.\nWhat failure have you learned the most from?\nThe failure I’ve learned from the most was trying to do everything on my own. It taught me the value of delegation, asking for support, and building systems that allow both my business and my personal life to grow sustainably.\nWhat is the hardest part of your job?\nThe hardest part of my job is communication and to make sure expectations are clear, everyone is aligned, and messages are understood across all facets, especially while juggling multiple priorities and responsibilities.\nWhat was the last show you binge-watched?\nThe last show I binge-watched was the last season of Stranger Things with my wife and 13 year old son.\nWhat is your favorite book?\nMy favorite book is Into Thin Air by Jon Krakauer.\nWhat is the most rewarding/important aspect of your occupation?\nThe most rewarding and important aspect of being a plumbing business owner is providing reliable solutions that truly help people, while building a trusted company that supports my family, creates opportunities for my team, and serves the community with integrity.\nWho is your greatest mentor/inspiration?\nMy greatest mentor and inspiration is my Grandfather Ralph. He taught me patience and workmanship from a young age.\nDo you have a motto that you live by?\nOne motto I live by is set the goal, reach it, raise the bar, and set the next one.\nWhat advice would you give to anyone wanting to start a new business or excel in a business or field?\nStart with a clear vision, stay consistent, and don’t be afraid to learn as you go. Communicate well, build the right team, and focus on doing quality work every time. Set goals, reach them, then set new ones and remember that long term success comes from persistence, adaptability, and integrity.\nHow do you view failure and success?\nI view failure and success as connected. Failure is a lesson and a stepping stone. It shows me what needs to change or improve. Success isn’t a final destination, but progress toward a goal. When I reach one, I take what I’ve learned and set the next goal, continuing to grow both personally and professionally.\nWhat’s the greatest gift you ever received? Why?\nThe greatest gift I’ve ever received is my family. My wife Sarah and our children. Their love, support, and the joy we share together make every day meaningful and remind me what truly matters in life.\nMOLLY SCHILTZ\nAge: 32\nCompany and Title: Special Events Coordinator at Yellowstone Art Museum\nHometown: Billings\nEducation and/or Background: BA in Art and Architectural History from Roger Williams University in Bristol, Rhode Island\nIf you couldn’t do this, what would you do instead?\nI probably would do something with environmental protection or animal rescue.\nWhat other passions/callings are part of your life?\nI am a big fan of the great outdoors and feel blessed to live in such a beautiful state full of preserved nature to explore!\nWhat is the worst advice you’ve received and why?\nIt is terrible advice to tell someone that they should stick to what they are good at. Being a beginner at something (at any age) is one of the most exciting parts of life.\nWhat advice would you give a teenager about success?\nI assume that teenagers today already know more than I ever will about most things. I would just ask that they don't lose hope and treat themselves and others kindly. That would be the biggest success.\nWhat’s your guilty pleasure?\nA little treat after dinner/after most meals.\nWhat is one professional accomplishment you still want to achieve?\nI'd love to know that the arts and cultural institutions are sustainably funded and thriving in Billings.\nHow do you measure your own success?\nI measure my own success by keeping an annual personal and professional journal that I occasionally will look through and take stock of past big projects, travel, etc. Without a tangible record, I would probably feel too focused on the future to reflect on what has already been achieved.\nWhat failure have you learned the most from?\nAs a young professional I took on too much, and have since learned the power of a happy and motivated team. It is better to do a few things really well than many things \"meh\".\nWhat is the hardest part of your job?\nSaying no. (See previous response)\nWhat was the last show you binge-watched?\nThe Studio- so good!\nWhat is your favorite book?\nA Little Life.\nWhat is the most rewarding/important aspect of your occupation?\nIt is most rewarding to work with creative people and see a vision or an idea tangibly emerge over time. It isn't something that everyone gets to experience, and I'm lucky to observe and partake in this process in many ways, multiple times a year. It is even better when the community gets involved and that idea resonates in even bigger ways than expected.\nWho is your greatest mentor/inspiration?\nThe women in my life. My mother and sisters who collectively know everything, my best friend who keeps me social and connected with other fabulous ladies, and all the inspiring artists and women that keep this community healthy, safe, beautiful, and fun.\nDo you have a motto that you live by?\nBe the change you wish to see in the world.\nWhat advice would you give to anyone wanting to start a new business or excel in a business or field?\nAsk questions and don't hesitate to reach out to people you admire.\nHow do you view failure and success?\nAs a very fluid spectrum with endless potential to learn and grow.\nWhat do you do for fun/relax/hobby?\nMy hobbies are seasonal — I love to backpack and fly fish with my husband and our two dogs the most. I am also a huge fan of any live music (especially outdoors), and going to movies. When I can't go outside, I relax by listening to audiobooks and doing a 1000 piece puzzle — it's way more fun than it sounds.\nWhat’s the greatest gift you ever received? Why?\nThe greatest gift I have ever received was a tea organizer from my then boyfriend, now husband (he really saw me). My tea cabinet was a mess and now it is glorious.\nBO BRUINSMA\nAge: 35\nCompany and Title: Billings Public Schools\nHometown: Elk Point, SD\nEducation and/or Background: BA, Political Science, University of South Dakota ('13) & MPA, University of South Dakota ('17)\nWhat other passions/callings are part of your life?\nI'll use this part to shout out some local organizations doing great work. Eagle Mount, Billings TrailNet, the Billings Public Library Foundation, St. John's United, Special Olympics, and AccessBillings all come to mind as organizations that serve important roles in the Billings community and deserve support.\nWhat is the worst advice you’ve received and why?\nBasically any advice coming from prescribers of the \"grind set\" mentality that is prevalent in professional spaces these days. I don't think focusing obsessively on your own self-improvement is productive and it's actually just created a lot of lonely, angry people. I'm a proponent of hard work and self-improvement, but don't make it your entire personality.\nWhat advice would you give a teenager about success?\nIt's cool to be kind and care about other people, especially ones that you don't know, are different from you, or don't look like you. It's as easy as ever to be cruel or mean to others if they are in any way different from you. It's important to work hard and be ambitious in your career, but you'll be remembered more for how you treated people than any amount of wealth, awards, or recognitions you can accumulate professionally.\nHow do you measure your own success?\nIt's a little cliche, but I just want to be able to look myself in the mirror and be able to be proud of the work I'm doing.\nWhat failure have you learned the most from?\nIt's mostly recognizing that if you aren't failing at least some of the time, you're probably being a little complacent. I'd rather fail trying something big and audacious that I really believe in rather than never go for it because I'm worried it might not work out.\nWhat is the hardest part of your job?\nPublic education in Montana is critically underfunded. Nobody wants to pay more taxes, but taxpayers also have an obligation to provide a quality, free public education to Montana children. The world students are walking into after graduation is more complex every day, and yet we still expect to fund schools like we did in the 1980's. I wish our schools had more resources to educate students.\nWhat is the most rewarding/important aspect of your occupation?\nAs a school district employee, I get to work with so many people who are passionate and deeply care about providing the best educational opportunities as possible for kids in our community. I honestly wish more people in Billings would recognize and appreciate our teachers like they do law enforcement, first responders, and our military.\nWho is your greatest mentor/inspiration?\nI have a bunch of people I could mention here, but the one I have to say is Dr. Mike Roche. I still think about things/ideas that Dr. Roche taught me as a student in his undergraduate classes, and conversations we had when I was his teaching assistant while I was in graduate school. He is one of the smartest, most thoughtful, intense, yet compassionate people I've ever met.\nDo you have a motto that you live by?\n\"Hold strong opinions loosely.\" I am strong in my convictions and beliefs, but contrary to what my ego tells me, I am not right about everything all the time.\nWhat do you do for fun/relax/hobby?\nMy initial answer was going to be watch sports, but that is rarely fun nor very relaxing given the teams I have chosen to be a fan of. So I torture myself with sports, and when I am looking to do something fun or relaxing, it's usually any time I get to spend with my partner Sam, friends and family, or our animals.\nWhat’s the greatest gift you ever received? Why?\nMeeting my partner Sam five years ago. She is the best and I'm a better person because I get to be around her all the time.\nDAVID ROTH\nAge: 39\nCompany and Title: MetraPark - Box Office Manager\nHometown: Billings\nEducation and/or Background: B.S. Montana State University 2009, M.S. MSU-B 2016\nWhat other passions/callings are part of your life?\nI enjoy music and cooking. I love live music, making a good meal, or mixing a cocktail. Even down to the science involved in smoking meats and making differing flavors work together; it's all interesting to me. I enjoy entertaining and being around people. If my food can bring people together and put a smile on their faces, I will be happy.\nWhat is the worst advice you’ve received and why?\n\"You'll figure it out.\" At the end of the day, sure I did. But the path to get there was miserable and absolutely soured my opinion on the situation. There was no direction and I was left with zero confidence along the way. To me, there's not much point in learning or doing something if all of the effects will be negative. Communication is important.\nWhat advice would you give a teenager about success?\nAsk questions and build relationships. Build confidence and skill in your job/craft/passions by asking questions and doing things right. People can see passion and confidence, and that will open up a lot of opportunities. You truly never know who you will have an impact on, or when those moments will come up again in life.\nWhat’s your guilty pleasure?\nI still enjoy a good bite of fresh cotton candy.\nHow do you measure your own success?\nThis is a two-fold answer for me. One is by the feedback I get from my own staff. If they are having fun and enjoying the work, I feel accomplished. I get great joy from seeing my team work together as a cohesive unit, and enjoying the work they do. This bleeds over to the customer service side of the industry. The Box Office is one of the first experiences someone will have coming into the area, and I strive to make it a positive one. People come to MetraPark to enjoy an experience outside of their daily lives, and if we can help make that experience a good one, I've done my job. Being someone who enjoys live events as well, I have a standard that I expect, and I try to implement that here.\nWhat is the hardest part of your job?\nI am very grateful that I enjoy my job very much, which makes it difficult to point out anything \"hard\" about it. But I would say that the hardest part is reminding myself that I will not always make everyone happy, no matter how hard I try. I will always do my best, but you can't please everyone, even when things are not in your control.\nWhat is the most rewarding/important aspect of your occupation?\nSeeing a full arena of smiles for an event that we put so much work into building.\nWho is your greatest mentor/inspiration?\nMy grandfather, Frank Newman. He was the definition of a family man and lived for making his grandkids smile. I never once heard him complain about anything and he was always there to lend a hand.\nDo you have a motto that you live by?\nIt sounds trite, but \"lead by example\". I will never ask one of my staff to do something I wouldn't do myself. (This also includes returning shopping carts).\nWhat advice would you give to anyone wanting to start a new business or excel in a business or field?\nI try to live and work by being relational, not transactional. Get to know people and build relationships. Ask questions and listen to needs. Making a positive, memorable impact on people holds a lot of weight. And as always, under-promise, over-deliver. People don't forget.\nWhat’s the greatest gift you ever received? Why?\nThe most meaningful gift was my Grandpa Ken's Montana State University Silver Bobcat jacket. It's got a lot of sentimental value, as he was a big part of my childhood, so it's nice to have a consistent reminder of him. It's priceless.\nANNA VICKERS\nAge: 35\nCompany and Title: City of Billings/Yellowstone County - Planning Division Manager\nHometown: Prairieville, LA\nEducation and/or Background: I earned degrees in Political Science and History from Louisiana State University with plans to attend law school. Before starting, my dad encouraged me to travel, a decision that led me to Montana. After moving to Missoula, a role at an engineering firm introduced me to planning and its impact on communities. Eleven years later, I’m proud to call Montana home and have spent the last three years in Billings shaping growth and development.\nWhat other passions/callings are part of your life?\nI’m passionate about the outdoors and the sense of clarity, peace, challenge, and connection to nature it gives me; but I’m equally passionate about supporting people, either by mentoring, volunteering, or helping others grow in their roles. Both feed different parts of who I am. I currently serve as Vice President on the board of the Montana Association of Planners, a volunteer organization dedicated to the professional growth of land use planners. This past legislative session, I co-chaired the legislative committee, where we testified on bills and advocated for best planning practices while addressing pressing issues like housing availability and affordability.\nWhat is the worst advice you’ve received and why?\nI was once advised to ‘keep your head down and just do your part.’ In both private and public sector work, that’s the opposite of what drives progress. Collaboration, transparency, innovation, and community engagement are essential. The best outcomes come from digging in, asking questions, and working across teams.\nWhat advice would you give a teenager about success?\nYour name is your brand. Everything you put your name on — whether it’s homework, a summer job, or a small responsibility — reflects who you are and what you want to be known for. If you hand in work that’s rushed or half-done, ask yourself: is that the reputation you want to build?\nYour name will follow you farther than any job title or organization you work for, so protect it. Lead with integrity, give your best effort, and let the quality of your work speak for the kind of person you are becoming.\nHow do you measure your own success?\nSuccess, to me, is simple: am I better at it than I was the last time? Do I find myself facing new challenges and adversaries? If so, that means that I must have conquered and grown.\nWhat failure have you learned the most from?\nEarly in my career, I put all my energy into meeting cliche expectations that I thought would lead to a promotion, only to realize that relying solely on someone else’s word was not enough. The experience taught me the importance of advocating for myself, setting realistic goals, and balancing ambition with sustainability.\nWhat is the hardest part of your job?\nOne of the hardest parts is managing expectations, which includes helping residents, developers, and colleagues understand the planning process while balancing regulations and community goals. It’s often a delicate conversation, but it’s also what makes the work meaningful.\nWhat is the most rewarding/important aspect of your occupation?\nI enjoy finding solutions. Often “road blocks” can occur within development or regulations, and I savor the challenge of solving those puzzles to help the community.\nWho is your greatest mentor/inspiration?\nMy parents have been my greatest inspiration.\nDo you have a motto that you live by?\nIf not me, then who? I mostly say this to myself when I feel tired and/or overwhelmed.\nHow do you view failure and success?\nLike everyone else, I hate failing. It gnaws at me. Even though failure is inevitable in life, it still eats at me and consumes my thoughts when it happens. I tend to become fixated, like a bloodhound on a scent, unable to focus on anything else until I’ve learned and conquered the skill associated with my defeat. But I’ve learned that failure is the most fundamental part of achieving eventual success. It’s where real growth happens.\nWhat’s the greatest gift you ever received? Why?\nThe greatest gift I’ve ever received is the love and support of those closest to me — my dog Charlie, my parents, my sister and best friend Amy, my fiancé Dillon and my favorite niece, Vivian.\nNATHAN BATES\nAge: 37\nCompany and Title: Billings Clinic Supportive and Palliative Care Department - Physician/Medical Director and Riverstone Health - Hospice Medical Director\nHometown: Phoenix, Arizona\nEducation and/or Background: BS Bioengineering - Arizona State University, DO - Midwestern University AZCOM\nIf you couldn’t do this, what would you do instead?\nSurgical tech or stay-at-home dad\nWhat other passions/callings are part of your life?\nIt is a profound honor and privilege to be a husband, father, son, brother, and friend.\nWhat is the worst advice you’ve received and why?\n“Don’t date any peers in medical school”. We were warned multiple times and received a didactic lecture on the reasons why we shouldn’t date our fellow students in medical school. 11 years and two children later, I am happy to report that dating and marrying Kari (the smarter, prettier Dr Bates) was/is a terrific idea.\nWhat advice would you give a teenager about success?\nKeep asking questions. Remain curious. Education provides the foundation for learning; however, maintaining a passion for knowledge is a personal responsibility.\nWhat’s your guilty pleasure?\nDoritos. Leave the bag. Don’t ask questions.\nWhat is one professional accomplishment you still want to achieve?\nRetirement.\nHow do you measure your own success?\nSuccess is vague. Joy is a better marker for life \"success.\" I use SMART (Specific, Measurable, Attainable, Relevant, and Time-bound) goals professionally as a framework to help eliminate vague aspirations or unachievable goals.\nWhat failure have you learned the most from?\nAt age 18, a vision to \"help save the women and children\" inspired me to move to Uganda with a non-profit group. While I initially failed and realized the naiveté of that goal, the experience proved transformative. I gained a valuable perspective on NGOs and learned critical lessons about creating sustainable change for communities in need. I met wonderful people and it sparked a journey that has shaped and transformed my life and vision. That vision has evolved and continues to guide who I am and what I do today.\nWhat is the hardest part of your job?\nGrief. “The expectation that we can be immersed in suffering and loss daily and not be touched by it is as unrealistic as expecting to be able to walk through water without getting wet.” - Rachel Naomi Remen.\nWhat was the last show you binge-watched?\nBob’s Burgers, but Arrested Development is a series that I have watched 8 times start to finish.\nWhat is your favorite book?\nDemystifying Opioid Conversion Calculations: A Guide for Effective Dosing - Mary Lynn McPherson, PharmD, PhD, BCPS.\nWhat is the most rewarding/important aspect of your occupation?\nPeople. Human connection is at the heart of everything I do, making it an absolute joy to meet new patients and people every day. I am also incredibly fortunate to work alongside a team of awesome, caring, and resilient providers and staff.\nWho is your greatest mentor/inspiration?\nThe writings of Dr. Ira Byock helped fuel my passion for Palliative Care.\nDo you have a motto that you live by?\n“My world's on fire, how 'bout yours? That's the way I like it, and I'll never get bored” -Smash Mouth\nWhat advice would you give to anyone wanting to start a new business or excel in a business or field?\nEmbrace honesty. Admit ignorance. Find the right humans to help guide and support you. Aim big, but remain connected to the financial and social realities that surround you.\nHow do you view failure and success?\nBoth are opportunities and not endpoints.\nWhat do you do for fun/relax/hobby?\nPranks, hot pepper gardening, cooking, fishing, skiing, and dance parties with my kids.\nWhat’s the greatest gift you ever received? Why?\nPerspective. My father, mother, and siblings have always set examples of exploring the world and meeting humans from diverse backgrounds. Each new perspective gives you a more robust understanding of reality around you.\nDANIELLE CAMPANELLA\nAge: 30\nCompany and Title: Billings Clinic Foundation, Philanthropic Advisor - Annual Gifts\nHometown: Billings, MT\nEducation and/or Background: Bachelor of Science in Human Development and Family Science\nIf you couldn’t do this, what would you do instead?\nIf I weren’t in my current role, I would pursue work as a culture coach or vibe consultant, helping organizations intentionally design environments where people feel inspired, valued, and connected. I’m deeply interested in how culture, energy, and design influence performance and belonging.\nWhat other passions/callings are part of your life?\nGolf and travel. Golf has taught me patience, focus, and resilience, while travel fuels my curiosity and perspective by exposing me to new people, places, and ways of thinking.\nWhat is the worst advice you’ve received and why?\n“Own it.” While accountability matters, I’ve learned that no meaningful work is ever owned by one person. The most impactful outcomes are bigger than any individual and are built through shared purpose and collaboration.\nWhat advice would you give a teenager about success?\nSuccess is often invisible. It’s trying three times as hard as others, even when no one sees the effort, and especially when no one sees the failures. Consistency and grit matter more than recognition.\nWhat is one professional accomplishment you still want to achieve?\nServing a full term as an engaged, contributing board member. I value governance, strategy, and long-term impact, and I’d love to support an organization at that level.\nWhat failure have you learned the most from?\nEarly in my career, I experienced a period of instability that forced me to reassess my habits, priorities, and direction. It was a pivotal “sink or swim” moment that required resilience, adaptability, and hard work. Through rebuilding, professionally and personally, I learned the importance of making intentional choices, surrounding myself with positive influences, and staying grounded in healthy routines. That experience taught me that setbacks don’t define you, how you respond and move forward does.\nWhat is the hardest part of your job?\nManaging several Annual Fund campaigns at the same time, each with different goals, timelines, and audiences, while staying flexible as priorities shift. It’s a constant balancing act between moving things forward and adjusting in real time.\nWhat was the last show you binge-watched?\nThe Secret Lives of Mormon Wives, Real Housewives of Salt Lake City, and Love Island Australia.\nWhat is the most rewarding/important aspect of your occupation?\nSeeing how meaningful donations turn into real, tangible impact in healthcare. Whether it’s funding projects and buildings, supporting patient assistance and employee crisis funds, or something as simple as providing books for pediatric patients, I get to see generosity directly improve lives. Knowing that my work helps connect donors’ intentions to outcomes that truly matter is what drives me every day.\nWho is your greatest mentor/inspiration?\nNichole Mehling, President of the Billings Clinic Foundation. She leads with authenticity, grace, and confidence, and consistently believes in her team; especially when it matters most. Her motivation is contagious, and I’ve seen her create an environment where we are inspired to do our best work in support of our patients and community.\nDo you have a motto that you live by?\n“Just go with it.” Adaptability has been one of my greatest strengths.\nWhat advice would you give to anyone wanting to start a new business or excel in a business or field?\nTell your story. Be clear about who you are, why you care, and why others should care. By using real, honest examples, people will connect to authenticity rather than perfection.\nHow do you view failure and success?\nFailure is not getting back up. Success is choosing to try again.\nWhat’s the greatest gift you ever received? Why?\nA small skiing mouse ornament wearing a fur coat. It was thoughtful and deeply nostalgic, symbolizing an early and meaningful moment in my relationship with my fiancé when we skied closing weekend at Big Sky. It reminds me that the most meaningful gifts aren’t about size or cost, but about intention, shared memories and the stories behind them.\nSARAH RESTAD\nAge: 25\nCompany and Title: Cushing Terrell\nHometown: Billings\nEducation and/or Background: Northeastern University\nWhat other passions/callings are part of your life?\nWow I feel like I have a new passion pretty much all the time. I really love learning and trying new things. I'm big into baking, crochet, and basically any other hobby that captures my interests. I'm a really big animal lover and I have 4 cats so they are also a pretty big part of my life.\nWhat advice would you give a teenager about success?\nTeenage me was really concerned about success at all times. Sometimes it feels a bit like I should have slowed down and enjoyed the world around me. I think it's really important to remember that success should never come at the expense of joy.\nWhat is one professional accomplishment you still want to achieve?\nI'd really like to get my Professional Engineer license (PE).\nHow do you measure your own success?\nI've struggled with this a lot, I have pretty high expectations of what I should do and what success looks for to me personally. The farther I've gotten in my career the more I've realized that success doesn't have to look the same every day. Some days success is getting everything off my to-do list and some days it's helping where I can to make others’ projects go smoother. Success is different day-to-day and honestly I think that's what keeps me motivated to keep trying new things and learning every day.\nWhat failure have you learned the most from?\nI've failed quite a few times in my life. I had a big dream of going to MIT when I was in high school and I never got in. At the time it seemed like a huge failure but with time I realized I wouldn't change a thing about how my life turned out. Sometimes failures feel huge in the moment but looking back you realize they might have changed your life for the better.\nWhat is the hardest part of your job?\nI think one of the hardest parts of engineering is that it's a really wide field. My job is one small bit of what electrical engineering is, so we don't really learn much of what I do in my job in school. There's a lot of learning on the job and personally I really like that.\nWhat is the most rewarding/important aspect of your occupation?\nDefinitely seeing the final project built and occupied. I remember seeing the first building that I designed fully constructed and it was a great experience, and every time I drive past it I still point out the window and say \"I designed that!\"\nWho is your greatest mentor/inspiration?\nMy greatest mentor would probably be my grandfather.\nDo you have a motto that you live by?\nI really like Einstein's quote, \"Everyone is a genius but if you judge a fish by its ability to climb a tree it will live its whole life believing it's stupid.\"\nHow do you view failure and success?\nI wish I had some profound thing to say that failure is not failure if you learned something from it or that there really is no such thing as failure. I've struggled a lot through my life with what failure means to me and holding myself to pretty impossible standards; so failure was almost guaranteed. I have realized more recently that holding yourself to impossible standards does not make you try harder and do your best work, it burns you out and makes everything more difficult. Don't get me wrong, failure is the most important step to learning but it used to be debilitating for me. Now I don't judge myself for my failures, or at least I try not to, and I give myself credit for my little successes and that really makes a difference.\nANDREW GASKILL\nAge: 29\nCompany and Title: Stockman Bank - AVP, Ag Loan Officer\nHometown: Ashland\nEducation and/or Background: Montana State University - Finance\nIf you couldn’t do this, what would you do instead?\nI would likely either be back on my family ranch in Ashland or pursuing a sports related career.\nWhat other passions/callings are part of your life?\nMuch like what I would be doing if I weren’t in banking, I have a passion for all things Ag as well as all things sports. I am also very passionate in my faith and sharing that faith with others.\nWhat is the worst advice you’ve received and why?\n“Fake it till you make it” You can truly only fake it for so long. Do not be afraid to admit when you need help or do not know what you are doing. From my experience, people are willing to help and enjoy getting to share their knowledge with you.\nWhat advice would you give a teenager about success?\nNever stop working hard. It may not always feel worth it, but hard work and effort are recognized, and you will get rewarded.\nWhat’s your guilty pleasure?\nRewatching old Philadelphia Phillies and MSU Bobcats highlights (specifically the Miracle in Missoula)\nWhat is one professional accomplishment you still want to achieve?\nNever stop learning so that I can continue to build customers’ trust and become the go-to Ag loan officer in the area.\nHow do you measure your own success?\nBy looking back at where I started with the bank as an intern in 2019. It is easy to get stuck in the “daily grind” of a job, so taking time to reflect on where it all started can go a long way in showing how much my hard work and dedication has paid off.\nWhat failure have you learned the most from?\nOvercommitting myself and struggling to say “no.” It is a constant work in progress, but I have learned that the initial discomfort from saying “no” is worth going through to avoid the added stress that comes with having to balance a busy schedule, with fitting in other tasks that I should not have committed to in the first place.\nWhat is the hardest part of your job?\nFinding an ideal life/work balance during Ag operating renewal season. It is easy to spend too many hours at the bank and ultimately take that work home with you.\nWhat is your favorite book?\nThe Bible\nWhat is the most rewarding/important aspect of your occupation?\nGetting to see the light in customers’ eyes when they turn the corner and go from several tough years in a row to selling calves at record high prices. The smiles on their faces when they come in with their calf checks makes it all worth it.\nWho is your greatest mentor/inspiration?\nGrowing up, my parents and my uncle. Professionally, I owe most of where I am at with Stockman Bank to Travis Wright who got me started with the bank and bought into me right away.\nDo you have a motto that you live by?\nToday is a perfect day for a perfect day.\nWhat advice would you give to anyone wanting to start a new business or excel in a business or field?\nIt is “life/work” balance, not “work/life” balance. There is obviously a certain time commitment to your business, but burnout is very real, so finding the proper life/work balance is crucial to staying fresh and excited about your business or field.\nHow do you view failure and success?\nFailure is never fun, but it ultimately is a great way to learn and grow. You also can’t dwell on your failures, or you may not reach the point of success coming out of that failure.\nWhat do you do for fun/relax/hobby?\nFishing, softball, golf, and getting back to the ranch during branding season.\nWhat’s the greatest gift you ever received? Why?\nThe gift of salvation. Without salvation, nothing I have achieved in my life so far would have been possible.\nLINSAY FOLEY\nAge: 39\nCompany and Title: Kinetic Marketing & Creative, Traffic Director\nHometown: Billings\nEducation and/or Background: Bachelor of Science in Business Administration - Management and Marketing, MSU Billings\nIf you couldn’t do this, what would you do instead?\nI’d spend my time rescuing, fostering, and helping dogs find their forever homes.\nWhat other passions/callings are part of your life?\nSpending meaningful time with my husband is an important part of my life. We’ve been trying to travel more, whether that means visiting family or seeking out new experiences, like attending once-in-a-lifetime concerts.\nWhat is the worst advice you’ve received and why?\nI've received plenty of advice over the years, not all of it helpful. I've learned to consider guidance carefully, keeping what aligns with my values and letting the rest go. But if I have to answer, I’d say “just go with it.” To contribute effectively and avoid the pitfalls of staying silent, you need to speak up, ask questions, and advocate for yourself.\nWhat advice would you give a teenager about success?\nDo what makes you happy -- that’s the first step to success. Happiness doesn’t mean it will be easy but it does mean the effort will be worthwhile.\nWhat’s your guilty pleasure?\nRewatching all of the Harry Potter movies several times a year.\nHow do you measure your own success?\nI ask myself questions like: Am I proud of my work? Did I bring value to the table? Did I leave things better than I found them? If the answer is yes, I consider myself successful.\nWhat failure have you learned the most from?\nI applied for a management position that I felt confident about but ultimately didn’t get the job. Fresh out of college, it was disheartening and a little embarrassing but I recognized my worth and didn’t let it discourage me. Instead, I used the experience to learn and prepare for future opportunities.\nWhat is the hardest part of your job?\nNot getting stuck in established ways of thinking and making time to evolve and adapt with an open mind.\nWhat was the last show you binge-watched?\n“The Rookie.”\nWhat is your favorite book?\nI can’t pick a favorite but some honorable mentions from the last year or so include Jennette McCurdy’s and Connie Chung’s autobiographies, “Housemaid” by Freida McFadden and The Kindred’s Curse saga.\nWhat is the most rewarding/important aspect of your occupation?\nCollaborating with a team of talented individuals and seeing the strategy, creativity, and all of the pieces come together to produce impactful results for our clients.\nWho is your greatest mentor/inspiration?\nI’ve been fortunate to learn from many people over the years. Each has influenced me in different ways and contributed to who I am today.\nDo you have a motto that you live by?\nLive with integrity.\nHow do you view failure and success?\nFailure and success are part of everyday life. I’ve reframed how I view failure — I see it as an opportunity to reflect and grow. That, in itself, is a form of success.\nWhat do you do for fun/relax/hobby?\nI like to relax by listening to audiobooks or rewatching a favorite movie or show, usually while working on a puzzle and hanging out with my dogs and husband. I also love visiting my sister and nephew whenever I can. And watching college football — Go Griz!\nWhat’s the greatest gift you ever received? Why?\nAside from my wonderful, supportive family and husband, the greatest gift I’ve received was a “trip around the world” that gave me the opportunity to visit New York City — something I likely would not have done on my own.\nKEIFER DAUGHERTY\nAge: 30\nCompany and Title: Sibanye Stillwater Smelter Operations Foreman\nHometown: Colstrip\nEducation and/or Background: B.S. Metallurgical and Materials Engineering - Montana Tech\nIf you couldn’t do this, what would you do instead?\nThe mining industry has had a positive impact on my personal and professional development since childhood. Whether employed at Sibanye-Stillwater or elsewhere, I would likely stay focused in the mineral processing industry. Considering options, if no boundaries existed, I would be a professional golfer, traveling the world.\nWhat other passions/callings are part of your life?\nMy family and dogs are an important part of my life, spending as much time as possible with them. I also enjoy riding my Harley and hitting the links.\nWhat is the worst advice you’ve received and why?\n\"Just keep your head down and do the work.\" While hard work is important, I’ve learned that operational improvement requires a team working together asking the hard questions and ultimately challenging the “that’s the way we’ve always done it philosophy” Some of the best outcomes I’ve been a part of came from not keeping my head down—but rather keeping my eyes and ears open.\nWhat advice would you give a teenager about success?\nEducation and good grades are important for scholarships and career opportunities — but don’t forget to have fun as a kid.\nWhat’s your guilty pleasure?\nSports Wagering, the analytics of sports betting and the “behind the scenes” of bookmakers really interests me.\nWhat is one professional accomplishment you still want to achieve?\nI would like the opportunity to be involved in the patenting process of a new engineering design, that improves our business.\nHow do you measure your own success?\nI view success as being accountable to myself and others. Following through with commitments to achieve both personal and professional goals.\nWhat failure have you learned the most from?\nIn my opinion failures are only failures if you don’t learn from them. Take every opportunity to analyze undesirable outcomes, and formulate action plans to optimize processes until success is achieved.\nWhat is the hardest part of your job?\nMaking difficult decisions that are not the popular decision. Evaluate the pros and cons and make the best decision that moves your team, department, and company in the right direction.\nWhat was the last show you binge-watched?\nStranger Things\nWhat is your favorite book?\nOne Flew over the Cuckoo’s Nest\nWhat is the most rewarding/important aspect of your occupation?\nWorking with a talented group of dedicated individuals — everyone watches out for each other and works together to achieve common goals.\nWho is your greatest mentor/inspiration?\nI don’t have one specific mentor - the people I value the most have shown consistent accountability and follow-through. I appreciate people who send a consistent message each and every day, regardless of who they are talking with.\nDo you have a motto that you live by?\nActions and consistency speak louder than words and unreliability.\nWhat advice would you give to anyone wanting to start a new business or excel in a business or field?\nIt’s okay not to have all the answers — what’s important is perseverance and never giving up.\nHow do you view failure and success?\nA failure is only temporary — keep trying until you get it right and achieve success.\nWhat do you do for fun/relax/hobby?\nAnything outdoors — hunting, fishing, camping, golf.\nWhat’s the greatest gift you ever received? Why?\nMy support system, family and friends are always there for me when times get tough.\nTYA CAMPBELL\nAge: 37\nCompany and Title: Intermountain Health; Hospital Medicine Medical Director, Credentials Chair\nHometown: I graduated from Lavina High School, I grew up 20 miles south of Roundup.\nEducation and/or Background: Undergraduate at MSU Billings, Medical School at Ross University, Residency at Billings Clinic in Internal Medicine.\nWhat other passions/callings are part of your life?\nMy family has truly shaped who I am. As the youngest of six in a big family with 16 nieces and nephews, there’s always something happening! I also have two grown stepchildren and a granddaughter who bring so much joy to my life.\nWhat is the worst advice you’ve received and why?\nThe worst advice I’ve ever received was not to go to medical school. Ignoring that advice turned out to be the best decision I’ve made—I love what I do, and it’s incredibly rewarding to make a difference in people’s lives every day.\nWhat advice would you give a teenager about success?\nLife is full of ups and downs, but neither defines you—the way you respond does. Success isn’t about never failing; it’s about reflecting, adapting, and moving forward. Every day is an opportunity to try something new, and that’s a gift. Stay true to your values, embrace challenges, remain curious, and never be afraid to take chances.\nHow do you measure your own success?\nI measure success by growth, reflection, and the people who surround me. Medicine is constantly evolving, and growth allows me to continue providing the best care for patients. Reflection keeps me grounded and helps me understand different perspectives. And the people around me—family, colleagues, and friends—are a true measure of success because meaningful relationships are invaluable.\nWhat failure have you learned the most from?\nThe failure I learned the most from was attending an international medical school after not being accepted into a U.S. medical school. At the time, it felt like a major setback, but ultimately it made me stronger and shaped me into a better physician. It pushed me far outside my comfort zone and taught me the true depth of sacrifice and commitment that this profession requires. Through that journey, I discovered a new level of grit and determination, and I gained lifelong friendships with incredible people who have had a profoundly positive impact on my life.\nWhat is the hardest part of your job?\nThe hardest part of my job is the need to quickly build trust with people I’ve never met—often during some of the most difficult moments in their lives. On any given day, I may be helping someone navigate end-of-life decisions while also supporting another patient recovering from an elective procedure. Staying present and keeping perspective in every encounter can be challenging, knowing these are not ordinary days for my patients. In any profession, there’s a risk of becoming numb, but I consider it an honor to help people during such vulnerable times.\nWhat is the most rewarding/important aspect of your occupation?\nOne of the most important aspects of my work is being trusted with the details of patients’ lives—sometimes things even their families don’t know. Guiding someone through uncertainty and helping them feel supported during vulnerable moments is a privilege.\nWho is your greatest mentor/inspiration?\nMy greatest mentor and inspiration is my mom, who is truly amazing. She taught me resilience, unconditional love, and the importance of giving and supporting others.\nDo you have a motto that you live by?\nMy motto is to treat everyone as if they were your grandparent, parent, spouse, child, niece, or friend—because they are to someone.\nWhat advice would you give to anyone wanting to start a new business or excel in a business or field?\nMy advice would be to embrace the concept of “extreme ownership” as Jacko Willink states—take full responsibility for everything; successes and failures. Don’t make excuses. Surround yourself with strong, capable people who challenge you and share your values. Success in business or any field isn’t a solo mission; it’s built on trust, accountability, and a team that pushes each other to be better every day.\nWhat’s the greatest gift you ever received? Why?\nThe greatest gift I’ve ever received is my faith in Jesus Christ and my family.\nHOLLY CREMER\nAge: 38\nCompany and Title: Leavitt Great West Insurance, CL Team Lead\nHometown: Huntley\nEducation and/or Background: MSUB Bachelor's Degree\nWhat other passions/callings are part of your life?\nI find traveling incredibly engaging. With a background in sociology, I am fascinated by understanding human behavior and the reasons behind the actions of different groups. This curiosity aligns perfectly with my interest in exploring diverse cultures and societies.\nWhat advice would you give a teenager about success?\nPut yourself in positions where you will succeed. That doesn’t mean you shouldn’t take on new tasks, new responsibilities, trying new things, or challenge yourself. But don’t set yourself up for failure.\nWhat’s your guilty pleasure?\nAny hot dog in any baseball park. Could be a Chicago dog, Dehler dog, or simply a children’s sized Nathan’s Famous.\nHow do you measure your own success?\nPositive feedback and appreciation such as \"thank you\" and \"great job\" are my primary motivators and how I measure my success. As a mentor and manager, I believe my success is reflected in the well-being and happiness of my team members in their careers. It's essential to consistently foster an environment where everyone feels valued and supported. This requires ongoing effort and dedication to ensure that each individual can thrive and reach their full potential. By continuously working to create such a positive atmosphere, I am fulfilling my role and contributing to the overall success of our team.\nWhat failure have you learned the most from?\nI’ve been thrown off a horse many times, and each time my father insisted that I get back on by myself. His message was clear: if at first you don’t succeed, try again.\nWhat is the hardest part of your job?\nAs a people pleaser, I find it challenging to meet everyone's expectations. I've always been inclined to say \"yes\" to every request, but I've learned that I can't please everyone all the time. Prioritizing tasks and identifying the right people to specialize in different areas has been crucial in directing efforts effectively. Additionally, understanding that I can't be an expert in all subjects has helped me focus on my strengths and delegate responsibilities appropriately.\nWhat is the most rewarding/important aspect of your occupation?\nI get to fix a problem or solve a Rubik’s cube for our clients. Insurance is a complex language, and nothing rarely fits into a neat box. My job is to come up with a solution that can align with their specific needs/wants. I get to be their problem solver. Also, collaborating with my team to brainstorm and exchange ideas is truly invigorating. I absolutely adore my coworkers and cherish the camaraderie we share.\nWho is your greatest mentor/inspiration?\nI've been fortunate to surround myself with people who inspire me daily while at work or home. My husband and my family have been invaluable mentors, guiding me through some of the most significant decisions in my life.\nDo you have a motto that you live by?\nIt’s Good to Be Together\nHow do you view failure and success?\nSuccess encompasses various elements and is significantly influenced by happiness, motivation, passion, and positivity. When an individual embodies these qualities, they inherently find themselves in a successful state, driving them to pursue goals with energy and enthusiasm, fostering growth and achievement.\nHappiness reflects overall satisfaction and contentment with life, leading us to approach challenges with a positive attitude and resilient spirit, making the journey more enjoyable and enhancing our ability to overcome obstacles.\nMotivation propels us forward, keeping us focused on our objectives and encouraging persistence even when the path becomes difficult. A motivated person is driven by purpose and determination, essential for long-term success.\nPassion adds depth to our pursuits, inspiring creativity, and innovation, and often influencing those around us positively.\nPositivity shapes our outlook on life, influences our interactions, fosters resilience, and attracts positive experiences and opportunities. In essence, success is a state of being cultivated through happiness, motivation, passion, and positivity, creating a powerful framework for achieving goals and leading a fulfilling life.\nJOSH BUNZ\nAge: 39\nCompany and Title: Intermountain Health St. Vincent Regional Hosptial. Nurse Director ED, Trauma and Patient Care Services\nHometown: Riverside, CA\nEducation and/or Background: BSN- Health Science, MSN - Nursing\nIf you couldn’t do this, what would you do instead?\nWorking with my wife on our business, Apogee Yellowstone here in Billings.\nWhat other passions/callings are part of your life?\nI love running marathons and ultramarathons. Bow hunting is a huge passion of mine along with shooting my bow. Both passions challenge and scare me which motivates me daily!\nMy other calling is working with my wife in building our alternative education center called Apogee Yellowstone. Our goal is to provide children with an education that prepares them for life (not just more school). We are dedicated to growing stronger families and a stronger community.\nWhat is the worst advice you’ve received and why?\nWhen in an argument with your wife, just tell her to calm down. No need to explain more lol :)\nWhat advice would you give a teenager about success?\nIt's more than a mile. It is a journey. Give yourself grace to fail and have the discipline to move forward.\nWhat’s your guilty pleasure?\nBuilding Lego's with my 5 year old son.\nWhat is one professional accomplishment you still want to achieve?\nContinue to serve the Billings community through healthcare and motivate younger kids to go after their dreams.\nHow do you measure your own success?\nBe better than the person I was yesterday. 1% adds up over time. This is through giving my best effort each day even though some days I will not be at my best.\nWhat failure have you learned the most from?\nI don't have one specific failure but I have had a huge amount of failures during my life so far. Some big and some small. From these failures, I have been shaped into the person I am today; through dedication, persistence, and grace.\nWhat is the hardest part of your job?\nCommunication. Healthcare is ever evolving and changes are occurring at a rapid pace. Ensuring my team understands the \"why\" can be very challenging.\nWhat was the last show you binge-watched?\nBluey and Peppa Pig. All thanks to my wonderful kids!\nWhat is your favorite book?\nCan't Hurt Me - David Goggins.\nWhat is the most rewarding/important aspect of your occupation?\nMentoring and being part of my high-performing team. It is rewarding to see improved patient care and outcomes that drive the overall success of our healthcare organization.\nWho is your greatest mentor/inspiration?\nI draw my inspiration from men who do hard things such as David Goggins, Cameron Hanes, my uncle (Danny Bunz) who played for the San Francisco 49ers as Linebacker in the 80's.\nDo you have a motto that you live by?\n\"More than the Miles\" & \"GOOD\"\nWhat advice would you give to anyone wanting to start a new business or excel in a business or field?\nFind something you truly have a passion for; that sets the fire inside you. Do not be afraid to fail because it will come. Don't let failure deter you from the goal you have set. Be persistent and do the little things daily. Those little daily habits will turn into something much greater than ever imagined.\nHow do you view failure and success?\nFailure is necessary to success. Without success there will be no failure. Failure is part of the process. Embrace it. Learn from it. Be better from it.\nWhat do you do for fun/relax/hobby?\nRunning, shooting, and working on my bow. Going out to dinner with my wife when we can break away from our kids.\nWhat’s the greatest gift you ever received? Why?\nSilver coin necklace from my dad before he passed away from cancer. The silver coin is from a Spanish ship that sank in the 17th century that he got when he was in Europe. My dad, myself, and brother all have the same necklace. This holds a bond between all of us.\nJOSHUA CEDERBERG\nAge: 36\nCompany and Title: Director of Therapy at The Rehab Hospital of Montana\nHometown: Broadview/Billings\nEducation and/or Background: Doctorate in Occupational Therapy\nWhat other passions/callings are part of your life?\nI've always had a passion for fitness and helping others, which is why a majority of my 20s and early 30s were spent in a gym setting.\nWhat is the worst advice you’ve received and why?\n\"People Suck. People will suck your time and energy if you allow them.\" In a number of ways this is very true and teaches us to create boundaries. But it also creates tendencies of looking at someone in need with a negative light.\nWhat advice would you give a teenager about success?\nA Professor/Mentor of mine always loves to say \"Trust the Process\" and that is the best piece of advice I have ever got. Things may not be going the way we want them, but if we trust in the process and put in the work, it all works out in the end.\nWhat is one professional accomplishment you still want to achieve?\nI would like to own my own business at some point in my life. Something where I can combine my therapy degree with a fitness setting. Combining Prehab and Rehab.\nHow do you measure your own success?\nWe succeed by the victories of those around us. For me, it's not about my own successes. I am not in the profession I am in because I want my name written on a plaque somewhere. As an Occupational Therapist, it's as simple as teaching someone to put on their own socks in the morning. As a leader, it's giving your team the tools they need to teach someone to put on their socks in the morning. Truly, the victories and successes of those around me are how I can measure my own success.\nWhat failure have you learned the most from?\nMy Undergrad degree was not an easy process. There was a lot of starting and stopping trying to find the right path. Through that process, I was able to really learn a lot about myself and how I succeed/fail.\nWhat is the hardest part of your job?\nI want to help everyone at the exact same time.\nWhat is the most rewarding/important aspect of your occupation?\nAt the Rehab Hospital of Montana, we have the ability to impact so many lives. Watching the success of the patients that we treat is honestly the best part of what we do. Patients will come to us in a wheelchair or stretcher because they are not able to walk. They will then turn around and walk out the front doors at discharge. It's amazing to watch and the most rewarding aspect of what we do.\nWho is your greatest mentor/inspiration?\nThere are so many people in my life that have made lasting impacts, but there are two that have come to mind. Gerri Glover was the best boss I have ever had and taught me so much in the early years of my 20s. Professionally, Dr. Paula Kitzenberg made a lasting impact on my career. These two helped to shape me into the person that I am today.\nWhat advice would you give to anyone wanting to start a new business or excel in a business or field?\nEven baby steps are still steps. Every single step toward your goals, no matter how big or small, are steps in the right direction.\nWhat do you do for fun/relax/hobby?\nI do my best to read and spend time with my kids as much as I can. With 2 small kids at home, the word \"relax\" can take on different forms.\nWhat’s the greatest gift you ever received? Why?\nI am not a person for material things. Every holiday we are always asked \"what do you want for Christmas.\" There is nothing that I really want. I would prefer a dinner out or just quality time with those around me than material objects.\nSARAH SCHROEFEL\nAge: 28\nCompany and Title: Beyond the Chronicles - Owner & TDS Fiber - Assosicate Manger Field Marketing\nHometown: Worland, WY\nEducation and/or Background: I hold a Bachelor’s degree in healthcare administration with a focus in Long-Term Care from Montana State University Billings. I am also a Certified Dementia Educator with a passion for aging services and community-based impact. Currently, I’m pursuing a Master’s degree in Philanthropic Studies through the prestigious Lilly Family School of Philanthropy at Indiana University; where I’m focusing on corporate giving, grantmaking, and community investment.\nWhat is the worst advice you’ve received and why?\nOne of the most misleading pieces of advice I have received is the idea that success is defined by constantly climbing the corporate ladder. For a long time, I equated professional worth with titles and promotions, always chasing the \"next step\". But over time, I realized that growth does not always come from upward movement. Sometimes, expanding laterally, taking on new challenges, or deepening your impact where you are is far more fulfilling. This shift in perspective helped me avoid burnout and reconnect with what makes me feel purposeful. Success looks different for everyone, and I have learned to define it on my own terms.\nWhat advice would you give a teenager about success?\nSpend time with older adults. Volunteer in a nursing home, ask questions and really listen. There is so much wisdom, humor, and perspective held by generations that came before you and sadly it is often overlooked or undervalued.\nWhat is one professional accomplishment you still want to achieve?\nI am someone who thrives on growth and I have several aspirations across the different areas in my life. As a basketball official I would love to earn the opportunity to referee a state tournament. At TDS, I hope to continue expanding my team while deepening a positive impact in the Billings community. And through my business, Beyond the Chronicles, I aim to host multiple large-scale events each year and eventually build a nationwide association that supports and connects others who are passionate about book themed events.\nHow do you measure your own success?\nI do not want to measure my success in titles or accolades. For me, success is being trusted and invited into rooms where decisions are made. I find the most fulfillment in knowing that the time and care I put into my work and community is meaningful to others and that they see me as someone worth listening to.\nWhat failure have you learned the most from?\nThe failure that has taught me the most is not knowing my own worth, and as a result, saying yes too much and not advocating for myself. Early in my career, I found myself in a situation where I overextended or undervalued my contribution simply because I did not feel empowered to speak up. Over time, I realized that failing to set boundaries and communicate my value was not just exhausting, it was a disservice to myself and those I worked with. I have since learned to stand my ground and to surround myself with people who respect and recognize my contributions.\nWhat is the hardest part of your job?\nThe hardest part of my job is finding balance. Between my role at TDS, owning and running a business, officiating high school basketball, and pursuing graduate studies, my schedule stays full.\nWho is your greatest mentor/inspiration?\nMy greatest inspiration has always been my mom. She passed away from cancer when I was 14, but in the short time I had with her I got to see what true strength and grace looks like.\nWhat advice would you give to anyone wanting to start a new business or excel in a business or field?\nTake the jump. Starting a business is scary, but momentum builds when you move forward with purpose. Surround yourself with people who believe in you and your vision.\nHow do you view failure and success?\nI believe that success and failure are deeply connected. We should set some goals high enough that we do fail and that failure becomes a natural and expected part of growth. Failing is not a sign of weakness, it is how we grow and learn. At the same time, I have learned the importance of pausing to acknowledge and celebrate success. Too often, I move quickly from one accomplishment to the next without taking time to reflect on the progress I have made.\nJESSICA HART\nAge: 37\nCompany and Title: ZooMontana\nHometown: Billings\nEducation and/or Background: Montana State University - Go Cats!\nWhat is the worst advice you’ve received and why?\nSomeone once told me, \"You’d have a much easier time if you just lowered your expectations.\" While that might be true, it wouldn't be me. I view high expectations as a compliment to my team — it means I believe we are capable of greatness.\nWhat advice would you give a teenager about success?\nWork hard and fail forward. Mistakes are the best teachers you’ll ever have. My biggest advice is to identify your passion and be intentional with it. If it’s your career, amazing. If it’s your hobby, build a professional path that gives you the time and means to protect it.\nWhat is one professional accomplishment you still want to achieve?\nHonestly? I’m living it! Being less than a year into my role as CEO, my current 'accomplishment in progress' is successfully leading this organization through its next chapter. I’m enjoying the challenge of refining our operations and vision. My goal is to become the kind of leader who inspires others to pursue their own '40 Under 40' dreams.\nHow do you measure your own success?\nI measure success by my level of genuine happiness. In a professional world often obsessed with metrics, I’ve found that my best leadership happens when I’m fueled by joy.\nWhat failure have you learned the most from?\nFailure is a strong word—I prefer to see it as a pivotal lesson in recognizing my worth. The experience I learned the most from was staying in a role too long, where the leadership wasn't truly invested in my success. I spent a lot of energy trying to work around a culture that wasn't built for growth, thinking I could personally fix the alignment issue. It taught me that loyalty is a gift you should give to organizations that value your vision. That lesson is exactly what prepared me to lead ZooMontana today; I now know that real success happens when you stop trying to force a fit and start leading where you are truly empowered to win.\nWhat is the hardest part of your job?\nThe hardest part is the constant tug-of-war between the future and the present. My mind is naturally wired for big-picture strategy and 'what’s next' for ZooMontana, but the real magic happens in the 'here and now.' I’m learning that while the long-term vision is vital, slowing down to focus on the immediate needs of my team and our animals is just as important.\nWhat is the most rewarding/important aspect of your occupation?\nThe best part of my job? The people. They are the heartbeat of ZooMontana.\nDo you have a motto that you live by?\nIf you aren’t having fun, find a way to. Life is too short. When you prioritize enjoyment, the 'hard' work feels lighter, the memories are sweeter, and the results are always better.\nWhat advice would you give to anyone wanting to start a new business or excel in a business or field?\nI’ve taken an unusual path to lead ZooMontana, and it’s given me a perspective you can’t get from a textbook. My best advice is to stop overthinking and start doing. If you have the passion, take the first step today. You’ll figure out the rest as you go, and often, the most unexpected journeys lead to the most meaningful success. Just start.\nHow do you view failure and success?\nSuccess isn't a straight line—it’s built on a foundation of lessons learned the hard way. I have a funny habit of finding myself taking the hard way. Whether by choice or by fate, those uphill climbs are where the real growth happens. Great leaders don’t let a setback define them; they use it to sharpen their vision.\nWhat’s the greatest gift you ever received? Why?\nThe greatest gift I’ve ever received is the title of 'Mom.' My path to get there was a winding one, which makes the joy of having my kids even sweeter.\nCALEB SCHREIBEIS\nAge: 35\nCompany and Title: Four9 Design, President, CEO\nHometown: Billings\nEducation and/or Background: Montana State University, Mechanical Engineering\nIf you couldn’t do this, what would you do instead?\nIf I weren’t doing this, I’d still want to be building something, likely in a mission-driven role with ambitious goals.\nWhat other passions/callings are part of your life?\nI am married to the most wonderful woman and I am the father of some incredible children. Being a husband and a father is the greatest privilege of my life.\nWhat is the worst advice you’ve received and why?\nThe worst advice I’ve received is to “play it safe” and wait until everything feels perfectly ready. Building anything meaningful requires taking managed risks, learning through challenges, and trusting the process even when the path isn’t completely clear.\nWhat advice would you give a teenager about success?\nFocus on showing up consistently, being willing to learn, and not being afraid of failure. Success is built over time through resilience, curiosity, and surrounding yourself with people who challenge and support you.\nWhat’s your guilty pleasure?\nCookie dough ice cream.\nWhat is one professional accomplishment you still want to achieve?\nOne accomplishment I still want to achieve is helping Four9 Design fully capitalize on the opportunity ahead of us. Continuing to grow in a healthy way while staying true to our values and creating lasting impact for our team and clients would be something I’d be deeply grateful to be part of.\nHow do you measure your own success?\nI measure success by the quality of the relationships around me and the impact our work has on others. If we’re growing with integrity, navigating challenges with resilience, and staying grateful along the way, I consider that success.\nWhat failure have you learned the most from?\nStarting the company taught me that early mistakes and missteps are unavoidable, especially when you’re building something from scratch. Those challenges forced me to stay grounded, to be more resilient, seek better counsel, and stay grateful for the lessons that helped shape how we operate today.\nWhat is the hardest part of your job?\nThe hardest part is making decisions that affect people you care about, especially when the path forward isn’t always clear. Leading through uncertainty requires perseverance, humility, and a constant awareness that the responsibility goes beyond just the work itself.\nWhat is your favorite book?\nMy favorite book is usually the next one that helps guide me through whatever life or work challenge I’m facing. I’m grateful for books that offer perspective, challenge thinking, and provide insight I can apply both personally and professionally.\nWhat is the most rewarding/important aspect of your occupation?\nThe most rewarding part of my work is building and growing high-performing teams. Creating an environment where people are challenged, supported, and able to do their best work together is something I’m very grateful to be part of.\nDo you have a motto that you live by?\nI try to live by the idea of doing the right thing, even when it’s hard or inconvenient. Staying grounded in that mindset has helped me navigate many challenges along the way.\nWhat advice would you give to anyone wanting to start a new business or excel in a business or field?\nIt'll be harder than you think, for longer than you think, but you only fail when you give up.\nHow do you view failure and success?\nSuccess cannot be achieved without failure, so make sure your failures count!\nWhat do you do for fun/relax/hobby?\nWhen it's best, it usually involves family, warm weather, a beach, and a football.\nWhat’s the greatest gift you ever received? Why?\nThe greatest gift I’ve ever received is growing up in Montana, where I was instilled with strong character and a clear sense of right and wrong from my family at an early age. Those values continue to guide how I lead, make decisions, and show up for others, and I’m deeply grateful for that foundation.\nDREW LEVEAUX\nAge: 39\nCompany and Title: HUB International, Partner/Producer\nHometown: Billings\nEducation and/or Background: MSU '09 with a business management major and minor in entrepreneurship\nWhat is the worst advice you’ve received and why?\n\"Can't be done.\" I've got a stubborn side, and this never sits well with me. Some things truly can't be done in a certain way but taking that seems like quitting. More often than not, the answer is somewhere in the middle and there is always a way to find common ground to achieve quality outcomes.\nWhat advice would you give a teenager about success?\nBe patient and curious. Good things most often take time, but curiosity has opened the most doors for me. If you are generally interested in other people, and what makes them tick, then it can lead to so many great things in life. Not only in business, but a lifetime full of friendships and connections as well.\nWhat is one professional accomplishment you still want to achieve?\nContinuing to build my own book of business, but long term, helping to lead the company. It has been a fun ride these last 17 years with HUB and it's been an honor to be a part of the growth. Helping others build on and achieve that success has always been a passion and one I would love to explore in the future.\nHow do you measure your own success?\nThere are so many business metrics, but ultimately it's how my wife and kids greet me when I come home.\nWhat failure have you learned the most from?\nRelationships and family are everything, but they take time and consistent input. There is no such thing as a healthy one-way relationship. When you invest in others, you get it back tenfold. I've been guilty of getting too caught up in the daily hustle and not in what is truly important, family and friends.\nWhat is the hardest part of your job?\nThe insurance business is rewarding, but unfortunately, bad things happen. Oftentimes when disaster strikes, it's one of the darkest hours for our clients and the lives of everyone involved. The conversations aren't always easy, but being there for them is important.\nWhat is the most rewarding/important aspect of your occupation?\nProtecting someone's entire livelihood. There are so many creative ways to go about insurance these days, that becoming my client's trusted partner is very rewarding.\nWho is your greatest mentor/inspiration?\nMy parents. In business it is my dad, Rene. He has a tremendous knack for being a firm leader, but one that makes it easy and someone people want to work with. His ideas are on point and it's always nice to have a sounding board for all things business. My mom, Deb, in terms of faith. I'm not overly boisterous about it, but my strong faith is the guiding light. It is calming and gives me strength in all aspects of life and she instilled that in me early.\nDo you have a motto that you live by?\nBe nice and make other people smile.\nWhat advice would you give to anyone wanting to start a new business or excel in a business or field?\nWork hard and listen more than you speak. All people have an important journey that they are on. When you generally care for others, success wants to find you. I used to have a poster hanging on my wall that said, \"Luck is preparation that meets opportunity.\" I really believe that if you put in the time and effort, good things find you.\nWhat do you do for fun/relax/hobby?\nI'm an avid golfer and also really enjoy traveling. If I'm near any body of water, I'm happy. We've also recently started a little family business building and remodeling homes, which has been interesting and exciting.\nWhat’s the greatest gift you ever received? Why?\nMeeting my wife Emily and having our two children, Jack and Ella. Having those three as my \"why\" has provided clarity, focus, and fun!\nCASSANDRA DENNISON\nAge: 39\nCompany and Title: Classy & Sassy Coffee - President\nHometown: Polson\nEducation and/or Background: High School Diploma\nIf you couldn’t do this, what would you do instead?\nI've always had a passion for Naturopathy, health and fitness. I previously, before starting my company, competed in fitness competitions. Fitness competition gave me an even better insight into the human body. It is all very intriguing.\nWhat other passions/callings are part of your life?\nI love to cook and bake! Serving my family and loved ones is one of my favorite things to do. Watching my 6 daughters play basketball and volleyball brings me so much joy. I love to hunt and fish with my wonderful husband. Nature has a way of calming your soul in a way nothing else can.\nWhat is the worst advice you’ve received and why?\n\"You should slow down, success will come in time.\" That statement has been something that has stuck with me. Success does not come easy. You need to invest dedication, hard work, determination, and a positive attitude to see progress. Giving 50 % has never been an option to me.\nWhat’s your guilty pleasure?\nI find pleasure in cleaning. A clean space is a peaceful space and sets you up for success. I have always had a niche for cleaning and organizing. I also enjoy interior decorating.\nWhat is one professional accomplishment you still want to achieve?\nI would like to franchise our business to the surrounding states and help other driven individuals grow and succeed.\nHow do you measure your own success?\nWatching our employees become successful in their positions and continuing to grow within our company; going on vacations and accomplishing goals they've been working towards. It brings me joy to assist in helping our employees become successful not only in their career, but in their own personal lives.\nWhat failure have you learned the most from?\nI don't look at anything as a failure. I look at it as a learning experience, and stepping stone that will guide you to the path of success if you are willing to learn and adapt.\nWhat is the hardest part of your job?\nI always want all customers and employees alike to be satisfied. Unfortunately, we can't always please everyone. Giving yourself grace in knowing that you're showing up every day doing your best, is the understanding that needs to happen in order for you to not become discouraged.\nWhat is your favorite book?\nThe Bible.\nWhat is the most rewarding/important aspect of your occupation?\nI take pride in mentoring our employees. I am a servant by nature, and I believe God has called me to serve our employees and community. Seeing our employees grow and excel in life is so rewarding.\nEvery day we get the opportunity to be a bright light in our customers' day. We don't simply serve coffee, we serve love.\nWho is your greatest mentor/inspiration?\nMy late father-in-law, Dr. Loren Evans. He was a Professor of Veterinary Medicine at the University of Pennsylvania for 32 years. He taught us so much that money can't buy. His life- long lessons and tender love and understanding are something that will stick with me forever. I think of him often, and always appreciate that he set the bar so high for our family.\nHow do you view failure and success?\nI was raised to work hard regardless of what is going on. I keep my head down and continue to work hard daily for my family, my employees, and my customers. If we fail, we get back up and learn from our mistakes. When we succeed, we continue to work hard and be humble, because we don't know what the next day holds.\nWhat’s the greatest gift you ever received? Why?\nMy children and my husband. They are my world! The Lord has blessed us ten-fold with our incredible daughters, and I couldn't be more grateful. My husband is such a pillar of strength and joy in my life and I wouldn't be who I am today without his love, support, and guidance.\nDELAND WEYRAUCH\nAge: 35\nCompany and Title: Deputy Medical Examiner, Montana State Medical Examiner's Office\nHometown: Ray, ND\nEducation and/or Background: Doctor of Medicine - University of North Dakota; Medical Residency (Pathology) - Yale-New Haven Hospital; Fellowship (Forensic Pathology) - Connecticut Office of the Chief Medical Examiner\nIf you couldn’t do this, what would you do instead?\nWithin medicine, I liked the idea of Physical Medicine and Rehabilitation (for example, working with patients who had suffered spinal cord injuries).\nWhat other passions/callings are part of your life?\nFamily and friends. I have a wife, Stephanie, two daughters, Zara and Vivienne, and we try to have an active social calendar.\nWhat advice would you give a teenager about success?\nSuccess always looks great on other people... but for you to actually enjoy your own success, it has to align with your morals and ethics. You must value the work you did to get to your success, for its own sake. Awards and recognition might be nice sometimes, but they are not fulfilling.\nWhat’s your guilty pleasure?\nSports talk radio.\nWhat is one professional accomplishment you still want to achieve?\nI have not yet had a leadership/administrative role, but feel I might be suitable for a role like that some day in the future.\nHow do you measure your own success?\nWhether I am meeting the internal standard I hold myself to as a doctor.\nWhat failure have you learned the most from?\nGenerally, many doctors are uncomfortable thinking about the possibility that they make mistakes. But the truth is, every doctor, no matter how competent or excellent, will make mistakes, and these mistakes carry the greatest potential for both self-improvement and impactful teaching lessons for others. We learn, in part, by remembering when we were wrong.\nWhat was the last show you binge-watched?\nBobby Flay's Triple Threat\nWhat is your favorite book?\nCandide, by Voltaire\nWhat is the most rewarding/important aspect of your occupation?\nAs an autopsy physician, I would say providing answers and explanations for the family members and loved ones of those who have died suddenly, unexpectedly, or under questionable circumstances. I feel that among the skills needed in this job, one of the most important is communication.\nDo you have a motto that you live by?\nWork hard, have fun.\nWhat advice would you give to anyone wanting to start a new business or excel in a business or field?\nYou don't have to do hard things all by yourself. Look for people who know something you do not, and see if you can work with them, or learn something from them.\nHow do you view failure and success?\nTotally intertwined - you cannot have one without the other. And very often, the failure comes first. One of the best attitudes you can give yourself is to not merely tolerate failure, but actively seek it out and appreciate it.\nWhat’s the greatest gift you ever received? Why?\nA surprise birthday party from my wife, who had gathered many of my closest friends from miles and miles around.\nThe 2026 Billings 40 Under Forty class.",
  "word_count": 26467,
  "scraped_at": "2026-02-14T12:38:12.167654"
}