{
  "article_id": "195c25c897be",
  "url": "https://www.sounderatheart.com/2024/09/ships-log-september-28-in-search-of-miracle-max/",
  "title": "Ship Log , September 28 : In search of Miracle ( Max ) ",
  "date": "20240928T214500Z",
  "domain": "sounderatheart.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "\"What do you have worth living for?\"\nAt the late stage of the season, there are a few types of teams remaining – those eliminated, those playing spoiler, those seeking the Cup and those who need a miracle.\nSeattle Sounders do not slot easily into those groups, or maybe frustratingly so into the group that needs a miracle. A team with so many trophies sets a rather high bar for itself. A \"failed\" season can be one where they are merely good enough to get close to finals, but never appear.\nSides like Austin, Dallas and St. Louis are seeking miracles to just make the postseason. Teams like Vancouver, Portland and Minnesota are seeking miracles to host a playoff game.\nThat isn't the standard here.\nSeattle is a win away from earning a playoff spot and a handful of wins from hosting in the first round.\nWinning playoff games, not just hosting them, is the expectation.\nRight now, that would take a miracle – one that has to come from the second tier of the team.\nJordan Morris and Albert Rusnák are performing well enough. Each compare well to the best 9s and 10s in the league (not Messi, though).\nThe defense is clearly capable. It's the fourth best in the league by raw goals against (Houston, tonight's opponent, is 3rd). Seattle is 3rd by xGA (Dynamo are 6th). By G+ Goals Added against the Sounders are 5th (Houston is 9th). If you aren't convinced in the defense at this point, maybe because they make errors once in a while, like every team – the Crew have a top-two defense by every measure and they do things like clothesline attackers to go down a man.\nBut the offense hasn't been great.\nThe third-best attacker is Paul Rothrock. He's been much better than any expectation.\nLA Galaxy have four attackers with 10 or more goals and five or more assists. RSL sold one of their best, but Anderson Julio and Diego Luna are still better than what Seattle has. Colorado's Cole Bassett has a strong 9 goal and 7 assist season.\nLAFC's third best compares to Rothrock, for now, but there's a decent chance that Oliver Giroud becomes their second option (he hasn't scored in MLS play yet).\nWho is going to be Seattle's miracle?\nWho can accompany the deft play of the swashbuckling Rusnák and the pure strength of Morris?\nSaturday night's match against Houston is a fine time for someone to rise up and show their true love of the team. To point that sword, with nary a waver and stare down one of the better defenses in MLS.\nThe run-in is brutal. Two opponents are competing for that fourth home-field slot. The other two are Cascadia opponents ready to pounce above Seattle if anyone falters. Oh, and three of those four are in the next 8 days.\nPay close attention tonight to Paulie, Georgi and just maybe the once-heroic attacker Cristian Roldan. Those three are going to be who puts Seattle on the road of conquest.\n\"It'd take a miracle\"\nUse our affiliate links to support your bloggers when buying merch and tickets.\nCatching up on Sounder at Heart\nHere's what you missed on the site this week.\nSounders\nNext match: Saturday night at 7:30 pm PT hosting Houston Dynamo on MLS Season Pass. The Sounders make the playoffs if they win, OR if Seattle draw vs. Houston AND Dallas lose/draw vs. Orlando, OR if Dallas lose vs. Orlando AND Austin lose/draw vs. Salt Lake.\n- Everything you need to know about Sounders-Dynamo\n- Sounders relishing ‘opportunity’ to face likely playoff teams\n- Sounders ready to hit stretch run hard after brief break\n- Where Sounders project to finish in Western Conference\n- Realio’s Ratings: What are we doing?\n- Nos Audietis: What does the future hold for Brian Schmetzer?\n- Nos Audietis Mailbag: How high will Obed Vargas’ price go?\n- Jackson Ragen officially re-signs with Sounders\n- MLS Fantasy Week 28: Three to go\nReign\nNext match: Sunday afternoon at 3 pm PT hosting Bay FC on KONG and NWSL+. Reign cannot be eliminated this weekend, but they are five points below the playoff line and Bay FC (9th on tiebreakers).\n- The Cooler Guild: Playoffs, we *might* have a problem\n- Valkyratings: Angels In Retreat edition\n- Reign parched in Houston with a 1-0 loss\nDefiance\nNext match: Sunday night at 7 pm PT hosting Houston Dynamo 2 on YouTube. Defiance are two points short of winning a third-straight Pacific Division title. They'd need to pass LAFC2 and The Town in their final two matches.\nSpokane\nZephyr are on the road for the first time, heading to DC Power on Sunday at 11 am PT on Peacock+. Zephyr have 5 pts in 4 played, while Power have 2 points in five.\nVelocity play next on Wednesday at Nick Hexum-owned Union Omaha. That match is at 10 am PT on SWX and ESPN+. Omaha already clinched and are pursuing another trophy. Spokane is in 7th, but in easy striking distance of home-field in the first round.\nLooking back at the news\nEverything else you need to know\nTraffic is going to be tough in the region this weekend.\nFrom the 3rd Degree's Hate Watchers Guide to the Weekend on Seattle not having re-signed Brian Schmetzer yet.\nLook, the guy is only the most successful coach in the history of your club, even if you include the NASL team in that history. Why he’s not been extended, why he has to answer questions it, all feels like an ownership that is in the mood to prove to themselves and their fans who the real geniuses were all along. Sort of like how Jerry Reinsdorf got rid of Phil Jackson in 1998, immediately after the Bulls won six NBA titles in eight years.\nEarlier this year Christine Sinclair retired from Canada. She's now declared that she's done with playing club soccer at the end of the year, as well. She'll retire as one of the most potent scorers in soccer, at any level.\nWhy left-wing German club St Pauli are selling their stadium to fans: 'It's the home of the people'. Lumen Field is not for sale.\nChris Henderson to Atlanta rumors are heating up.\nThe Men's Club World Cup venue announcement is at 2 pm PT today. Expect 8-12 venues with Seattle being one of those. The Sounders are on the clock. FIFA has already started celebrating Seattle's soccer history.\nDisgraced former Chicago Red Stars head coach Rory Dames was named 400 times in the Yates report on systemic abuse in the NWSL. He's no longer listed at the SafeSport database for reasons no one seems prepared to explain.\nOliver Giroud isn't having fun traveling 20+ hours a month.\nThis newsletter was made possible through the support of Full Pull Wines, a boutique wines reseller that has been sponsoring us since 2011. You can join their mailing list here.",
  "word_count": 1162,
  "scraped_at": "2026-02-14T12:23:59.040854"
}