{
  "article_id": "197378cc7cec",
  "url": "https://www.hollywoodreporter.com/movies/movie-news/2024-black-list-screenplays-revealed-1236082839/",
  "title": "2024 Black List of Best Unproduced Movie Scripts Revealed",
  "date": "20241210T203000Z",
  "domain": "hollywoodreporter.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The 2024 Black List has been announced with scripts tackling everything from Tickle Me Elmo to Wicked Witch actress Maggie Hamilton’s experience filming The Wizard of Oz.\nThe annual list of the town’s best-unproduced feature screenplays voted on by a group of 500 film executives features 83 scripts from writers, known and unknown, repped and unrepped.\nTopping this year’s list is One Night Only by Travis Braun, which takes place in a world where premarital sex is illegal save for one night and follows two strangers as they attempt to find someone to spend that night with. Other scripts tackle the 1990s lawsuit that brought to light the health dangers of silicone breast implants (Bust by Matt Ackels), the early life of Anthony Bourdain (Tony by Lou Howe and Todd Bartels, already set up at A24), and the rise and fall of Abercrombie & Fitch (King of the Freshman by Matt Bailey).\nRelated Stories\n“Twenty years can feel like a long time or a blink of an eye depending on the moment,” said Black List founder Franklin Leonard. “Throughout that time, this is always the best part: Finding and sharing great stories well told with the rest of the community of folks who care about them. I look forward to these scripts finding the success and audience that previous annual Black List scripts have found and to watching these movies in theaters as soon as they’re available.”\nPast Black List screenplays that have gone on to awards success include Promising Young Woman, Spotlight and Challengers. Earlier this year, Leonard’s company expanded to include fiction and unpublished manuscripts.\nCheck out the full 2024 Black List below.\n60 mentions\nONE NIGHT ONLY by Travis Braun\nTwo strangers scramble to find someone to sleep with on the one night of the year when premarital sex is legal.\nAgency: UTA\nAgent(s): Charles Ferraro, Zoe Prince\nManagement Company: Echo Lake Entertainment\nManager(s): Matt Horwitz, Kara Hume, Amotz Zakai\nStudio: None\nProduction Companies: Olive Bridge Productions\n39 mentions\nPLAYDATE by Marie Østerbye\nWhen taking her daughter to a playdate at a new friend’s house, Alice suddenly comes face to face with her childhood bully, Katrine. An evening of seemingly polite dinner conversation and catching up turns into a night of psychological warfare as the two women reveal the scars of the past and the wounds of the present while their two young daughters play mind games of their own.\nAgency: None\nAgent(s): None\nManagement Company: Artists First\nManager(s): E. Brian Dobbins, Haley Jones\nStudio: None\nProduction Companies: Gloria Sanchez Productions\n38 mentions\nALIGNMENT by Natan Dotan\nA board-member at a booming AI company wrestles with corporate politics and warped incentives as he tries to prevent his colleagues’ willful ignorance from causing a global catastrophe.\nAgency: None\nAgent(s): None\nManagement Company: Untitled\nManager(s): Faisal Kanaan, Ben Rowe\nStudio: Fifth Season\nProduction Companies: MakeReady\n37 mentions\nLOVE OF YOUR LIFE by Julia Cox\nMaya — a smart, wry nurse — is swept up in an immersive love, one that sets her life on a trajectory she never would have imagined.\nAgency: CAA\nAgent(s): Adam Perry, Kelly Berger\nManagement Company: Project D\nManager(s): Allison Doyle\nStudio: Amazon/MGM\nProduction Companies: General Admission\n29 mentions\nHOW TO SAVE A MARRIAGE by Ross Evans\nIn hopes of spicing up their marriage, a husband and wife join a mysterious couples retreat, only to discover it’s a front for a dangerous cult.\nAgency: Paradigm\nAgent(s): Ethan Neale\nManagement Company: Entertainment 360\nManager(s): Evan Silverberg, Geoff Shaevitz\nStudio: Sony\nProduction Companies: Icki Eneo Arlo, E 360\n28 mentions\nDON’T BORROW TROUBLE by Caroline Glenn\nA broke TaskRabbit in debt to her estranged sugar daddy holds a stolen painting she’s been tasked to deliver for ransom, leading to a deadly cat-and-mouse chase across the weirdest corners of New York City.\nAgency: CAA\nAgent(s): Brian Kend, Pete Stein, Connie Yan\nManagement Company: None\nManager(s): None\nStudio: None\nProduction Companies: T-Street\n25 mentions\nZADDY by Sarah Ramos\nTwenty-something fitness instructor Ellie Noone has been toiling away in the LA rat race for years, until her luck changes when she meets an attractive older man with a mysterious past that’s as complicated as his skincare routine.\nAgency: None\nAgent(s): None\nManagement Company: Linden Ent\nManager(s): Trent Hubbard\nStudio: None\nProduction Companies: Gold Company\n24 mentions\nCLEAN BREAK by Ryan Brennan\nMary, a hair trigger pool hustler, has her hedonistic lifestyle all figured out until she meets Ray, a fellow pool shark. Will she change her ways and let herself fall in love? Or just kill him and make a break for it…\nAgency: WME\nAgent(s): Danny Greenberg, Perry Weitzner\nManagement Company: Untitled\nManager(s): Sam Warren, Adam Klein\nStudio: Searchlight\nProduction Companies: Scott Free\nTICKLE ME ELMO by Aaron Karo\nThe true story of how one toy saved Sesame Street, shocked Wall Street, and tickled the nation.\nAgency: Gersh\nAgent(s): Jeff Greenberg, Greg Pedicin\nManagement Company: Linden Ent\nManager(s): Trent Hubbard\nStudio: None\nProduction Companies: Misher Films\n23 mentions\nBUST by Matt Ackels\nIn 1991, Houston TX, millions of women sport the latest fashion trend: breast implants. But when they develop life-threatening side effects, they’ll need a special kind of lawyer to seek justice. This is the incredible true story of a women’s public health crisis, a gunslinging plaintiff lawyer, and the biggest lawsuit in American history.\nAgency: Gersh\nAgent(s): Dave Alexander, Shan Ray\nManagement Company: Heroes and Villains Entertainment\nManager(s): Markus Goerg\nStudio: None\nProduction Companies: Smoke House Pictures\n22 mentions\nTHE 7 GUYS YOU DATE BEFORE MARRIAGE by Julia Yorks\nAfter her 10-year relationship collapses, a newly single woman dives back into the dating pool, navigating seven wildly different romantic entanglements that prepare her for her future husband.\nAgency: CAA\nAgent(s): Austin Denesuk, Stephanie Smalling\nManagement Company: Rain Management\nManager(s): Matt Rosen, Mike Vanderhei\nStudio: None\nProduction Companies: Olive Bridge Productions, Mischief Entertainment\nNASTY by Isabella Jarosz\nAfter an injury sidelines Dylan’s ability to train for the Olympics, the determined gymnast must regain the trust of her demanding coach while facing off against a prodigious new competitor threatening to eclipse her place in the spotlight.\nAgency: CAA\nAgent(s): Kelly Berger, Drew Leffler, Maia Paterno\nManagement Company: Untitled\nManager(s): Sam Warren, Raz Moayed\nStudio: None\nProduction Companies: None\nVANISHED by Samuel Franco , Evan Kilgore\nTen years after she disappeared as a teen, Violet, now 25, turns up with no memory of what happened to her, but as her family welcomes her home, it quickly becomes apparent that the past cannot be forgiven or forgotten.\nAgency: None\nAgent(s): None\nManagement Company: Rain Management\nManager(s): Matt Rosen, Jonathan Baruch\nStudio: None\nProduction Companies: None\n20 mentions\nASSEMBLY REQUIRED by Kevin Yang\nDuring a clandestine overnight stay in the Burbank IKEA, four friends get caught in a firefight between rival criminal organizations, forcing them to figure out how to save each other — and the store they love so much.\nAgency: None\nAgent(s): None\nManagement Company: Untitled\nManager(s): Steve Yurovsky\nStudio: None\nProduction Companies: None\nTEST DRIVE by Matt Venne\nA down on his luck car salesman takes a mysterious stranger on a test drive – which turns into a dangerous and unsettling crime spree across the rain-soaked streets of Los Angeles.\nAgency: Independent Artists Group\nAgent(s): Joe Fronk, Sheryl Petersen\nManagement Company: Heroes and Villains Entertainment\nManager(s): Joseph Cavalier\nStudio: 20th Century Studios\nProduction Companies: Safehouse Pictures\n19 mentions\nBLOODY MINGO by Jonathan Easley\nInvestigating the crime scene of a potential homicide in the Appalacian mountainside, a deputy encounters a strange mountain community that claims to be haunted by an evil witch that lives in the woods.\nAgency: Gersh\nAgent(s): Dave Alexander\nManagement Company: Traction\nManager(s): Zak Kristofek, Jason Tamasco\nStudio: None\nProduction Companies: None\n18 mentions\nTHE 13TH HOUR by Anna Klassen\nWhen a group of teenagers repair an old clock with a mysterious 13th numeral, they are granted an extra hour where their actions have no consequence\nAgency: WME\nAgent(s): Brett Rosen, McCall Koenig\nManagement Company: Untitled\nManager(s): Faisal Kanaan\nStudio: None\nProduction Companies: Lab Brew\nBO KNOWS INFINITY by Adam Best\nBo Jackson gets stuck in a time loop. Lessons are learned.\nAgency: None\nAgent(s): None\nManagement Company: Writ Large\nManager(s): Nadya Panfilov\nStudio: None\nProduction Companies: None\nDECOYS by Jack Waz\nWhen two cocky self-proclaimed CIA badasses learn they’re being used as diversions, they must prove to themselves and the world that they’re capable of being real heroes.\nAgency: UTA\nAgent(s): Alex Rincon\nManagement Company: Fourth Wall\nManager(s): Russell Hollander\nStudio: None\nProduction Companies: None\nDIANA DESTROYS A WEDDING by Elizabeth Evans\nWhen her youngest son proposes to a middle-class farmer, New York business icon DIANA IVY incentivizes her dysfunctional children to protect the family name the only way she knows how… by creating a competition: whoever can break up the couple during their luxurious seven-day destination wedding will inherit The Ivy’s Lake Como Estate.\nAgency: None\nAgent(s): None\nManagement Company: Redefine\nManager(s): Max Goldfarb\nStudio: None\nProduction Companies: None\n17 mentions\nOVER ASKING by Caroline Dries\nAfter a chance encounter with a powerful female litigator, a seemingly perfect couple begin to ask questions about marriage, power, gender, and sex.\nAgency: WME\nAgent(s): Zach Druker, Marc Korman, Danny Greenberg\nManagement Company: Entertainment 360\nManager(s): Geoff Shaevitz, Jill McElroy\nStudio: Paramount\nProduction Companies: Sunswept Entertainment\nSKIN by Matisse Haddad\nWhen famed Beverly Hills dermatologist Amelia Williams’ status begins to slip as she ages, she makes a revolutionary discovery that allows her to completely revitalize her appearance and maintain her lifestyle. It just requires a bit of murder every now & then.\nAgency: None\nAgent(s): None\nManagement Company: Bellevue Productions\nManager(s): John Zaozirny, Zack Zucker\nStudio: None\nProduction Companies: Story in the Sky\n16 mentions\nAMERICAN MONSTERS by Chris Grillot\nA senator and his estranged son must fight to survive when they’re stranded at a hunting ranch where mythical beasts from global folklore are genetically engineered as dangerous game.\nAgency: CAA\nAgent(s): Bryant Barile\nManagement Company: Rain Management\nManager(s): Matt Rosen\nStudio: None\nProduction Companies: None\nTHE BUSBOY by Elad Ziv\nAfter a mysterious busboy manipulates his way into a job at the most exclusive nightclub in South Beach, he quickly rises through the ranks using ruthless tactics.\nAgency: None\nAgent(s): None\nManagement Company: Bellevue Productions\nManager(s): John Zaozirny\nStudio: None\nProduction Companies: Co Created Media\nFRAGMENTS by Jake Moses\nAfter a tragic accident, a young nurse finds herself blacklisted and out of work until she’s approached by a detective with a unique job offer—become the caretaker for a murder suspect who may be faking his Alzheimer’s diagnosis.\nAgency: None\nAgent(s): None\nManagement Company: Housefire\nManager(s): Jon Hersh\nStudio: None\nProduction Companies: Boulderlight, Housefire Management\nTONY by Lou Howe, Todd Bartels\nIn 1975, a wayward young Anthony Bourdain stumbles into a summer dishwashing job in Provincetown and discovers his life’s calling.\nAgency: CAA\nAgent(s): Kelly Berger, Pete Stein\nManagement Company: Mosaic\nManager(s): Dawn Saltzman, Emily Rose\nStudio: A24\nProduction Companies: Star Thrower\n15 mentions\nFELLOWSHIP by Cassie Keet\nA burgeoning artist is offered a once in a lifetime fellowship, luring her into the dark side of New York’s elite art world.\nAgency: Independent Artists Group\nAgent(s): Nick Beldoch, Halle Mariner, Sheryl Petersen\nManagement Company: Industry Entertainment\nManager(s): Kasey Muraszko\nStudio: None\nProduction Companies: Premeditated Productions\nSHUTOUT by Alejandro Adams\nA talented young pool player from the Bronx navigates the male-dominated world of pool hustling, guided by a seasoned gambler, as she rises to international fame and grapples with the moral complexities of the game.\nAgency: None\nAgent(s): None\nManagement Company: Range Media Partners\nManager(s): Michael Kagan, Jay Baker\nStudio: None\nProduction Companies: Roth/Kirschenbaum, Mark Bomback\nSTARDUST QUEEN by Joe Ferran\nA prodigiously gifted young assassin attempts to escape the rule of her vicious step-mother and ascend to fame as a late-90’s pop star.\nAgency: None\nAgent(s): None\nManagement Company: Empirical Evidence\nManager(s): Derrick Eppich\nStudio: 30West\nProduction Companies: Birchall Entertainment\nTIMESHARE by Mark Townend\nIn the not-too-distant future, where a new technology allows an individual to project their psyche into the body of another, thus creating a body-sharing gig economy, a financially-struggling married couple accepts a wealthy man’s proposal to use the wife’s body for a single night, but soon that decision causes their relationship and lives to spiral out of control with fatal consequences.\nAgency: Paradigm\nAgent(s): Babacar Diene, Varun Monga\nManagement Company: Bellevue Productions\nManager(s): Jeff Portnoy\nStudio: None\nProduction Companies: Vertigo and Entertainment 360\nTOLUCA LAKE by Mark Fleming\nWhen Gavin discovers the girl of his dreams is actually a persistent hallucination caused by a rapidly growing brain tumor, he’s forced to question what’s real, what really matters, and what’s the best way to end things with someone that’s slowly — or not-so-slowly — killing him.\nAgency: None\nAgent(s): None\nManagement Company: Range Media Partners\nManager(s): Alain Carles, Will Iannacone\nStudio: None\nProduction Companies: None\n14 mentions\nAIDa by Alexis Jacknow\nA new mother finds the perfect nanny in AI, only to learn that a “perfect” caregiver might be the most dangerous kind of all. This psychological thriller examines the disparity between human nature versus AI nurture and asks the question, could AI ever replace us as parents?\nAgency: Verve\nAgent(s): Parker Davis Olivia Mascheroni\nManagement Company: Artists First\nManager(s): Allen Fischer, Haley Jones, Katie Zipkin-Leed\nStudio: None\nProduction Companies: None\nTURNAROUND by Elyse Hollander\nAfter beloved movie star Tom Adair is found dead, the outpouring of grief and sympathy quickly elevates his best friend Alec Donavan to movie star status. Now Alec must contend with his newfound fame and success – and the fact that he and his agent/girlfriend Karynn Pieper secretly murdered Tom and are haunted by his vengeful ghost.\nAgency: CAA\nAgent(s): Laura Gordon, Adam Perry, Connie Yan\nManagement Company: Bellevue Productions\nManager(s): John Zaozirny\nStudio: None\nProduction Companies: Bellevue Productions\n13 mentions\nCRUSH by Michael Jones\nA woman wakes up in a room with no recollection of how she got there. The ceiling descends.\nAgency: None\nAgent(s): None\nManagement Company: Anonymous Content\nManager(s): Ian McKnight\nStudio: None\nProduction Companies: 6th & Idaho\nDETOUR by Will Widger\nWhen a feuding rap group’s tour bus breaks down in the middle of nowhere, three hip hop superstars find themselves locked in a life-or-death struggle to survive the night as they are hunted by a group of locals with a hidden agenda.\nAgency: None\nAgent(s): None\nManagement Company: Kaplan/Perrone Entertainment\nManager(s): Josh Goldenberg, Aaron Kaplan\nStudio: None\nProduction Companies: Federal Films, Polygram\nGOOD FOR US by Alix Lerner\nAfter surviving a terrifying home invasion with her two young children, a woman leans on her husband for support, but soon suspects that it was not a random incident and that her husband might have somehow been involved.\nAgency: None\nAgent(s): None\nManagement Company: Bellevue Productions\nManager(s): Kate Sharp\nStudio: None\nProduction Companies: Berlanti / Schechter Productions, Bellevue Productions\nHOWL by Madison Vanderberg\nAll hell breaks loose when a famous—but notoriously troubled—actor announces on a talk show that in less than an hour, he’ll turn into a werewolf … all on live TV.\nAgency: Verve\nAgent(s): Michael Chung, Isaiah Williams\nManagement Company: 3 Arts\nManager(s): Daniel Vang\nStudio: None\nProduction Companies: Weed Road\nKING OF THE FRESHMAN by Matt Bailey\nDuring the glittering ascent of Abercrombie & Fitch, a bold CEO and his enigmatic British partner craft an empire of desire, exclusivity, and allure – only to see their legacy unravel as a scandal of exploitation and power threatens to expose the dangerous lengths they went to in their pursuit of perfection.\nAgency: Verve\nAgent(s): Parker Davis, Noah Liebmiller, Isaiah Williams\nManagement Company: Time Train\nManager(s): Adam Rejwan\nStudio: None\nProduction Companies: Netter Films\nMOTHERBOY by Tess Brewer\nWhen a woman becomes trapped in a snowstorm with her overbearing mother-in-law and husband over the Thanksgiving holiday, she begins to suspect that their relationship is not as maternal as it seems. BARBARIAN by way of an erotic, Hallmark holiday movie.\nAgency: None\nAgent(s): None\nManagement Company: Anonymous Content\nManager(s): Ian McKnight, Kate Hart\nStudio: None\nProduction Companies: None\nOLD SOULS by Hannah Stoddard, Jenny Ulmer\nA trio of sassy, elderly women receive a unique offer from Death for a week of youth in exchange for their lives.\nAgency: None\nAgent(s): None\nManagement Company: Heroes and Villains Entertainment\nManager(s): Joseph Cavalier\nStudio: None\nProduction Companies: None\nPAPARAZZO by Christian Nilsson\nDesperate for fast cash to help his ailing mother, an opportunistic outcast partners with a wily paparazzo who entangles them in a homicide involving young celebutantes.\nAgency: None\nAgent(s): None\nManagement Company: Housefire\nManager(s): Jon Hersh\nStudio: None\nProduction Companies: Passage Pictures\nROAD TEST by Kris Bertin, Naben Ruthnum\nA young woman long overdue in getting her driver’s license finally takes her road test, only to find herself receiving direction from a psychotic instructor who wants her dead.\nAgency: Transatlantic Agency\nAgent(s): Laura Cameron\nManagement Company: Range Media Partners\nManager(s): Andrew Nallathambi\nStudio: None\nProduction Companies: BoulderLight Pictures\n12 mentions\nBATO BATO by Donn Kennedy\nWhen his family is murdered and child kidnapped, a Neanderthal goes on an epic rampage journey to save her from the new dominant species.\nAgency: WME\nAgent(s): Connor Armstrong\nManagement Company: None\nManager(s): None\nStudio: None\nProduction Companies: Boulderlight Pictures, Bad Grey\nMOMMY’S HOME by James Morosini\nWhen a 24-year-old woman is unfrozen decades later in a futuristic society, she struggles to adjust while finding herself the unwitting target of a global conspiracy.\nAgency: CAA\nAgent(s): Bryant Barile, Joe Mann\nManagement Company: Anonymous Content\nManager(s): Ryan Cunningham, Kami Putnam Heist\nStudio: Lionsgate\nProduction Companies: Anoymous Content, Craig Flores\nOUT THERE by Kate Folk\nBased on the short stories “OUT THERE” and “BIG SUR” by Kate Folk. Fresh off a breakup, Meg is thrilled to meet Roger, who seems like the perfect man: disarmingly handsome, sweet, and obsessed with her. But she’ll soon discover that a disturbing secret lies behind Roger’s perfection, and will have to decide how far she’s willing to go on behalf of true love–even if the person she loves happens to be fake.\nAgency: CAA\nAgent(s): Will Watkins\nManagement Company: Untitled\nManager(s): Merideth Bajana, Erick Mendoza\nStudio: None\nProduction Companies: Merman\nROT by Geo Bradley\nHaunted by the death of his hoarder mother, an antisocial man suffering from obsessive compulsions takes work as a trauma cleaner in hopes of facing his past, but the job soon begins to infest and unravel his mental state.\nAgency: Verve\nAgent(s): Noah Liebmiller, Nicky Mohebbi\nManagement Company: None\nManager(s): None\nStudio: K Period Media, Intrepid Pictures\nProduction Companies: Mike Flanagan\nTHE TELLER by Ben Ripley\nA timid, overlooked bank teller with incredible sleight-of-hand dexterity teams up with a rogue FBI agent to rob her own bank.\nAgency: Verve\nAgent(s): Parker Davis, Noah Liebmiller, Adam Weinstein, Olivia Mascheroni\nManagement Company: Brillstein Ent Partners\nManager(s): George Heller\nStudio: None\nProduction Companies: Catchlight Studios, Zoic Pictures\nTRAPPED by Jill Blankenship\nA woman trapped in a tight cave shaft must fight to escape when the shaft starts unexpectedly filling up with water\nAgency: WME\nAgent(s): Scott Seidel, Zach Druker, Niki Montazaran, Danny Greenberg\nManagement Company: Kaplan/Perrone Entertainment\nManager(s): Josh Goldenberg\nStudio: None\nProduction Companies: Prologue Entertainment\nTURPENTINE by Justin Varava\nWhen a deadbeat son hires his friends to rob his own mother and father in order to pay an outstanding debt to a local drug dealer, things don’t go as planned, and family bonds are stretched to their furthest extremes.\nAgency: CAA\nAgent(s): Drew Leffler, Rob Kenneally, Austin Denesuk\nManagement Company: Untitled\nManager(s): Cooper McCary, Sam Warren\nStudio: None\nProduction Companies: T-Street\nTHE WRONG SIDE OF THE RAINBOW by Dan Woodward\nInspired by the disastrous making of THE WIZARD OF OZ, Maggie Hamilton fights to keep her role as the Wicked Witch, while resisting the forces stifling Judy Garland’s childhood.\nAgency: None\nAgent(s): None\nManagement Company: LIT Entertainment\nManager(s): Kendrick Tan\nStudio: None\nProduction Companies: Incognegro, LIT Entertainment\n11 mentions\nBOY, GIRL, FIG by Kayla Sun\nAden was born with a rare condition where he becomes invisible to those who love him. He struggles when he falls in love with his childhood best friend.\nAgency: CAA\nAgent(s): Kelly Berger, Max Miller\nManagement Company: Bellevue Productions\nManager(s): Zack Zucker\nStudio: None\nProduction Companies: Imagine Entertainment\nIS THIS YOU? by Kaitlin Fontana\nMaura and her mother Jeanne have always had a tricky relationship. But when Jeanne starts publishing essays about her troubled daughter’s teenage years, those versions of her appear like hormone-fueled poltergeists hell-bent on ruining the real Maura’s tenuous adult stability.\nAgency: Verve\nAgent(s): Noah Liebmiller, Olivia Mascheroni, Olivia Ghersen\nManagement Company: SpectreVision\nManager(s): Christina Campagnola\nStudio: None\nProduction Companies: None\nLITTLE BLACK DRESS by Alyson Weaver Nicholas\nWhile on hiatus from filming “Breakfast at Tiffany’s,” international movie star Audrey Hepburn is recruited by the CIA to hunt down a Nazi criminal hiding in Buenos Aires with ties to her past.\nAgency: None\nAgent(s): None\nManagement Company: First Story Entertainment\nManager(s): Jason Lubin\nStudio: None\nProduction Companies: None\nMOM? by Marc Bloom\nWhen a deadly virus infects mothers and turns them against their offspring, a father must do whatever it takes to protect his daughter from her mom.\nAgency: Verve\nAgent(s): David Boxerbaum\nManagement Company: Housefire Management\nManager(s): Jon Hersh\nStudio: None\nProduction Companies: Housefire Management, Platinum Dunes\nSATURN RETURN by Gaelyn Golde\nEve and Anders dated for a decade. Now, Eve is going to see Anders for the first time in years… at his dad’s funeral. Together, they confront their shared past and the infinite nature of love, even after it dies.\nAgency: CAA\nAgent(s): Pete Stein, Celestine Au, Connie Yan\nManagement Company: 3Arts\nManager(s): Nora May\nStudio: Neon\nProduction Companies: Plan B\nSPIN THE BOTTLE by Jeff Feuerstein\nConvinced her disastrous dating life stems from breaking the rules of Spin the Bottle two decades ago, Hallie enlists her former crush to track down—and finally kiss—the boy she rejected that night, hoping to lift the curse and find true love.\nAgency: None\nAgent(s): None\nManagement Company: None\nManager(s): None\nStudio: None\nProduction Companies: Rideback, The Menagerie\nTWIN SOUL by Dani Feito\nWhen a psychiatrist and his sickly wife travel to their country cabin for a quiet Thanksgiving weekend, they will have to deal with the unexpected visit from one of his patients, who claims his dead twin brother is after him for revenge. It will quickly become clear things aren’t what they seem.\nAgency: None\nAgent(s): None\nManagement Company: Epicenter\nManager(s): Jarrod Murray, Allard Cantor\nStudio: None\nProduction Companies: Epicenter\nVICKY by Alessandra Clark\nThe incredible true story of Victoria Woodhull’s improbable run to become the first female President of the United States, 50 years before women even had the right to vote.\nAgency: None\nAgent(s): None\nManagement Company: Untitled\nManager(s): Faisal Kanaan, Cooper McCary\nStudio: None\nProduction Companies: 1.21\n10 mentions\nA BAND OF WOLVES by Reynaldo Leal\nAfter surviving a rival tribe’s raid, a pregnant Mesolithic woman forms an unlikely alliance with a wolf in order to survive the unforgiving prehistoric wilderness.\nAgency: None\nAgent(s): None\nManagement Company: Empirical Evidence\nManager(s): Derrick Eppich\nStudio: None\nProduction Companies: Empirical Evidence\nBRIDGEHAMPTON by Jeremy Leder\nRecently dumped Ezra Green accidentally brings a terminally ill woman home to Bridgehampton for a long weekend with his eccentric family. Don’t judge — he needs to cope with his estranged father who just got out of white-collar prison.\nAgency: Gersh\nAgent(s): Abram Nalibotsky, Julien Levesque\nManagement Company: Bellevue Productions\nManager(s): John Zaozirny, Zack Zucker\nStudio: None\nProduction Companies: None\nCAMP DAVID by Megan Amram, Joseph Carnegie\nIn 1981, a young George W. Bush and his siblings are hunted by a masked killer while partying at Camp David.\nAgency: Carnegie: Verve\nAgent(s): Carnegie: Bryan Besser, Chris Noriega\nManagement Company: Amram: Entertainment 360\nManager(s): Amram: Clifford Murray\nStudio: None\nProduction Companies: Point Grey\nINTIMACY by Sam Rubinek\nA rising movie star and her struggling playwright husband meet with a pretentious director and a manipulative intimacy coordinator to rehearse a sex scene. Over one chaotic day, power struggles, petty jealousies, and explosive accusations threaten their marriage – and the careers of everyone involved.\nAgency: Verve\nAgent(s): Jillian Holch\nManagement Company: Underground Management\nManager(s): Trevor Engelson\nStudio: None\nProduction Companies: Mood Bath Pictures, Tilted Windmill Pictures, Planetarium Productions\nONBOARDING! by Jackson Kellard\nWhen a group of new hires get invited to their company’s corporate retreat, things quickly take a turn as they discover the only way to land the job is to survive the weekend. Literally.\nAgency: None\nAgent(s): None\nManagement Company: Rain Management\nManager(s): Lucius Cary, Matt Rosen\nStudio: None\nProduction Companies: Hidden Pictures\nRIDE OR DIE by Alexander Vargas\nA debt-ridden Peloton instructor finds his entire class held hostage by a bomber during one of his live-in-studio classes.\nAgency: None\nAgent(s): None\nManagement Company: 831 Entertainment\nManager(s): Alex Pelham\nStudio: None\nProduction Companies: Ace Entertainment\nTHE ROAD TO COLD VALLEY by Arun Croll\nIn search of a lost family heirloom, a graduate student and his friends take a road trip to the ruins of the remote Japanese American internment camp where his ancestors were incarcerated during World War II. But after a car breakdown and a series of misunderstandings, the group must fight for their lives as they are stalked across the desert at night by an unhinged, racist mechanic.\nAgency: None\nAgent(s): None\nManagement Company: Writ Large\nManager(s): Eric Borja, Nadya Panfilov\nStudio: None\nProduction Companies: None\nTHREE HIT MEN AND A BABY by David Matalon, Matthew Altman\nThree of the world’s top hitmen must take on their most challenging assignment yet—babysitting an infant who holds the key to their survival.\nAgency: Paradigm\nAgent(s): Ethan Neale, Matt Snow\nManagement Company: The Gotham Group\nManager(s): Brooke Lindley, Charlie Scully\nStudio: Lionsgate\nProduction Companies: 87North\nTIPSY by Barry Galperin, Memo Noriega\nA young couple, feeling the pressures of adulthood, are thrown into a supernatural drinking game that tests their commitment, relationship, and more.\nAgency: None\nAgent(s): None\nManagement Company: None\nManager(s): None\nStudio: None\nProduction Companies: None\nTRUE* MERMAID STORY by Matthew Carnahan\nA struggling screenwriter’s life spirals into chaos when he becomes obsessed with telling the true* story of a mermaid’s life and death.\nAgency: Verve\nAgent(s): Chris Noriega, Nicky Mohebbi, Noah Liebmiller, Adam Levine, Jillian Holch\nManagement Company: None\nManager(s): None\nStudio: None\nProduction Companies: Low Spark, Joel Ehninger\nUNTIL YOU by Cameron Fay\nWhen a chance encounter thrusts two perpetually single best friends into each other’s lives, they navigate the blurry lines between friendship and love.\nAgency: Paradigm\nAgent(s): Mark Ross, Ethan Neale, Zac Simmons\nManagement Company: Kaplan/Perrone Entertainment\nManager(s): Josh Goldenberg, Aaron Kaplan\nStudio: None\nProduction Companies: Di Novi Pictures\n9 mentions\nBITTER SWEET SYMPHONY by Matthew Kic, Mike Sorce\nIn the last days of the Britpop era, enigmatic musician Richard Ashcroft’s quest to transform an obscure Rolling Stones cover into the iconic single “Bitter Sweet Symphony” sparks a legal battle that threatens to both destroy his band The Verve and silence the song forever. ALMOST FAMOUS meets THE SOCIAL NETWORK.\nAgency: Paradigm\nAgent(s): Varun Monga\nManagement Company: Brillstein Entertainment Partners\nManager(s): Jared Ceizler\nStudio: None\nProduction Companies: None\nDO NOT DISTURB by Ben Miller\nWhen a bumbling pretty-boy criminal screws up a job, he and his scruffy partner decide to lay low at a luxury LA hotel where they cross with a British playwright and a Hollywood starlet.\nAgency: None\nAgent(s): None\nManagement Company: Rain Management\nManager(s): Lucius Cary\nStudio: None\nProduction Companies: None\nDOG by Lucy Campbell\nLukas and Sofia’s new life in a small town is shattered when they return home one night to find their dog gruesomely killed – was it a wild animal, a neighbour or a sinister, supernatural force from the valley? Desperate for the truth, Lukas embarks on a witch hunt after evidence points to a young local boy – but as they are plagued by further unexplained, malevolent events, the family unit unravels with devastating consequences.\nAgency: None\nAgent(s): None\nManagement Company: Writ Large\nManager(s): Matt Dartnell, Melisa Baloglu, Eric Borja\nStudio: None\nProduction Companies: Yoki, Inc.\nDYERSVILLE by Will Hettinger\nTwo Federal Marshals guarding the most important cooperating witness in Chicago’s history — a legendary gangster— are forced to reckon with their own complicated pasts and with the first mole in the history of the witness protection program. Inspired by true events.\nAgency: CAA\nAgent(s): Darian Lanzetta\nManagement Company: Kaplan/Perrone Entertainment\nManager(s): Michael Wilson, josh Goldenberg\nStudio: Netflix\nProduction Companies: Higher Ground\nEX-CONS by Michael Montemayor\nA former husband-and-wife jewel thief duo, now divorced and in jail, must team up to help the authorities catch the most elusive thief of all: their son.\nAgency: None\nAgent(s): None\nManagement Company: Kaplan/Perrone Entertainment\nManager(s): Tobin Babst, Ben Neumann\nStudio: None\nProduction Companies: Project X Entertainment\nGOLDEN BOY by Connor Martin\nTo save his cash-strapped soccer club, the owner of SSC Napoli stakes his reputation and the taxpayers’ dollars on a mercurial, drug-addicted star named Diego Maradona.\nAgency: None\nAgent(s): None\nManagement Company: Stride\nManager(s): Austin Aronson\nStudio: None\nProduction Companies: None\nGRAVE EXPECTATIONS by Sam Wright\nAfter the recession hits their funeral business hard, a desperate mother is convinced by her manipulative daughter to start a risky side hustle – selling body parts. Based on a true story.\nAgency: None\nAgent(s): None\nManagement Company: Writ Large\nManager(s): Melisa Baloglu\nStudio: None\nProduction Companies: Rough House Pictures\nIT’S NOT YOU, IT’S ME by Shane Kennedy, Ant Simpson\nWhen Nick and Sophie break up just days before the lavish destination wedding of his best friend and her sister, they vow to keep it a secret until after the nuptials. But what should be a simple white lie becomes a living nightmare when a mystical encounter turns them into the one thing they hate most in the world: each other.\nAgency: None\nAgent(s): None\nManagement Company: Art/Work Entertainment\nManager(s): Spencer Robinson, Cindy Ambers\nStudio: None\nProduction Companies: Sugar23\nMILDRED by Josh Corbin\nYears after being banished from her family, an aging matriarch returns to the family business to save her estranged children from a deadly criminal syndicate.\nAgency: Paradigm\nAgent(s): Ethan Neale, Matt Snow\nManagement Company: Writ Large\nManager(s): Noah Rosen\nStudio: None\nProduction Companies: Range Media Partners\nNDA by Audrey Ellis Fox\nThrough a maddening day of mediation for an office harassment claim she filed, the clock is ticking on Dana as she questions the price of her silence, sanity, and the truth.\nAgency: CAA\nAgent(s): Albert Lee\nManagement Company: Writ Large\nManager(s): Melisa Baloglu, Matt Dartnell\nStudio: None\nProduction Companies: Mighty Engine\nA PAYROLL TO MEET by Joseph Sloman\nBased on David Whitford’s best-selling book chronicling the true story of college sports’ greatest scandal, a Dallas real estate tycoon spearheads the rise-and-fall of SMU football’s Pony Express.\nAgency: Gersh\nAgent(s): Mark Hartogsohn\nManagement Company: Greenlight Management\nManager(s): Adena Chawke\nStudio: None\nProduction Companies: Bradley Whitford, Menagerie Productions\nRIPE! by Tusk (Kelly Furrh and Olivia Mitchell)\nNothing says “it’s complicated” like breaking your crush’s arm. Set in rural Spain against the backdrop of a passionate soccer rivalry, the story follows young protagonists Sophie and Gloria as they navigate their relationship.\nAgency: None\nAgent(s): None\nManagement Company: Artists First\nManager(s): Corrine Aquino, Haley Jones, Matt Shepley\nStudio: None\nProduction Companies: Juxtapose Studio, O’House Productions, Adam Kopp, Liz Siegal\nTHUMB by Cesar Vitale\nWhen a lonely and socially-stunted young woman mistakenly receives a severed thumb in the mail, she makes it her life’s obsession to return it to the hand it once belonged to — putting her on a collision course that will upend her world forever.\nAgency: CAA\nAgent(s): Adam Perry, Connie Yan, Matt Felker\nManagement Company: Untitled, Jen Au Management\nManager(s): Jennifer Levine, Jennifer Au\nStudio: Bluestone\nProduction Companies: Weed Road Pictures\nYELLOW WALLPAPER by Taylor Streitz\nA headstrong woman living in 1975 America descends into madness as she battles postpartum depression, dismissive family, and a gaslighting husband. The mounting oppression and untreated psychosis come together to tell the origin story of a haunted house.\nAgency: Verve\nAgent(s): Valarie Phillips\nManagement Company: Echo Lake\nManager(s): Dana Jackson, Amotz Zakai\nStudio: None\nProduction Companies: None\nTHR Newsletters\nSign up for THR news straight to your inbox every day",
  "word_count": 5350,
  "scraped_at": "2026-02-14T13:31:19.079270"
}