{
  "article_id": "1973a4a75224",
  "url": "https://pacific.scoop.co.nz/2024/03/goalless-draw-enough-for-labasa-women-fc-to-advance-to-semi-finals/",
  "title": "Pacific . scoop . co . nz » Goalless Draw Enough For Labasa Women FC To Advance To Semi - finals",
  "date": "20240318T121500Z",
  "domain": "pacific.scoop.co.nz",
  "source_country": "New Zealand",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "gdelt",
  "body_text": "Goalless Draw Enough For Labasa Women FC To Advance To Semi-finals\nPress Release – Oceania Football Confederation\nFijis Labasa Women FC will play in the semi-finals of the OFC Womens Champions League, following a 0-0 draw with defending champions AS Academy Fminine that sees the holders eliminated. After their surprising heavy defeat to Auckland United, holders …\nFiji’s Labasa Women FC will play in the semi-finals of the OFC Women’s Champions League, following a 0-0 draw with defending champions AS Academy Féminine that sees the holders eliminated.\nAfter their surprising heavy defeat to Auckland United, holders AS Academy Féminine needed a big result against Labasa Women FC to have a chance of retaining their crown, while Labasa just needed a point to make the semi-finals and improve on their own finish from last year.\nRoneel Avnith Ram named an unchanged side from Labasa’s 2-0 dispatch of Veitongo FC, while Coralie Bretegnier made just one change from the starting XI against Auckland, replacing Ludovica Leitha Kalo with the competition’s youngest player, 14-year-old Emmanuelle Buama, for her first start.\nAS Academy started directly, with captain Alice Wenessia again at the heart of the side’s attacking forays, pinging a through ball from deep to Ronaldine Hnaune, with the 17-year-old caught marginally offisde.\nAs in previous matches, AS Academy were comfortable setting up for shots from outside the area, favouring trying to catch Selai Tikoisuva off-guard. Wenessia’s effort from distance was well cleared by the Fijians, with the resulting counter-attack almost proving fuitful, but Anasimeci Volitkoro couldn’t apply the finishing touch to give her side the lead.\nLabasa’s best effort on goal also came courtesy of Volitokoro’s rapid counter attack shortly before hal-ftime, as the winger drew a sharp double save from Anais Barth, with team mate Stella Naivalulevu unable to take advantage of the chaos in the box. The forward then missed a golden opportunity to take the lead a minute later, missing an empty net with Barth left stranded.\nAS Academy started the second half determined to seize control, with Joceline Kourevi going direct with an early chance. While she didn’t score it signalled a statement of intent from the New Caledonians, who knew they needed a goal to keep their title defence alive.\nMinutes later, Labasa thought they had won a penalty after Volitikoro went to ground in the box chasing a delightful through ball from Natieta Leba but the referee waved away the appeals.\nAs the game entered the final 20 minutes tensions rose between the two sides, with Wenessia cautioned having caught Kumar with a late challenge.\nVolitikoro came close to breaking the deadlock late on with a wonderful solo run through AS Academy’s backline, but the Fiji international was unable to hold the ball up for more support to flood through in attack, and her shot crashed into the side netting.\nDespite both sides continuing to push for an opening goal, the match ended as the tournament’s first goalless game – a result that was welcomed by Labasa, who will now advance to the last four, as AS Academy Féminine’s defence comes to a premature end.\nAS Academy Féminine: 0\nLabasa Women FC: 0\nHT: 0-0\nContent Sourced from scoop.co.nz\nOriginal url",
  "word_count": 534,
  "scraped_at": "2026-02-14T10:38:23.687102",
  "_text_extracted": true
}