{
  "article_id": "197e2a597fee",
  "url": "https://allafrica.com/stories/202602090372.html",
  "title": "Ghana : GFA Hires 5 to Strengthen Black Stars Technical Team Ahead of 2026 World Cup",
  "date": "20260209T120000Z",
  "domain": "allafrica.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Ghana football association (GFA), in consultation with key stakeholders, has moved to significantly bolster the Black Stars' technical setup with the appointment of five experienced professionals ahead of the 2026 FIFA World Cup in north america.\nthe strategic additions are aimed at enhancing the team's competitiveness and ensuring a well-balanced technical structure as Ghana prepares for the global showpiece to be hosted by canada, mexico, and the united states of america.\nfrench tactician, alain ravera, has been named as an assistant coach. ravera brings significant international experience, having previously served as an assistant coach with the guinea national team and top french side, AS Monaco. he is joined in the role by black queens head coach, kim lars björkegren. the swedish guided the black queens to a bronze medal finish at the 2025 women's africa cup of nations and has successfully led the team to qualification for the 2026 WAFCON, which he will also oversee.\nfor performance analysis, the FA has appointed spanish national, josé daniel martínez alfonso, who currently serves as an assistant coach and video analyst with major league soccer side, atlanta FC.\nFollow us on WhatsApp | LinkedIn for the latest headlines\nRelated Articles\n- Match Review Panel to meet todayJanuary 17, 2025\n- World Combat Ju Jutsu President in Ghana for 2022 Africa Open launchNovember 9, 2021\nthe medical department has also been reinforced with the return of carlos lozano romero as team physiotherapist. lozano previously worked with the Black Stars during Ghana's 2022 FIFA World Cup campaign in qatar, and his reappointment ensures continuity, familiarity with the team environment, and proven professionalism.\ncompleting the technical additions is british-born ghanaian performance specialist, dwayne peasah paa kwesi, who has been appointed performance coach. a long-serving support figure when called upon, his role will focus on physical conditioning, player optimisation, and overall performance enhancement throughout the World Cup campaign.\nthe appointments are strictly for the 2026 FIFA World Cup campaign and are in line with long-standing GFA tradition, which sees the Black Stars' technical team augmented whenever Ghana qualifies for major tournaments.\nthe five experts will work alongside the existing technical team led by head coach, otto addo, as Ghana intensifies preparations for the summer tournament and aims to make a strong impact on the global stage.",
  "word_count": 380,
  "scraped_at": "2026-02-14T12:38:08.219407"
}