{
  "article_id": "1981a67ad4e0",
  "url": "https://www.bbc.co.uk/sport/football/66531964",
  "title": "Women's World Cup memorable moments: Lord of the Rings, dislocated shoulders and presidential bets",
  "date": "2023-08-18T18:02:05.000Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_bbc",
  "body_text": "Women's World Cup memorable moments: Lord of the Rings, dislocated shoulders and presidential bets\n- Published\nThe Women's World Cup is almost over and has provided many memorable moments on the pitch.\nGreat goals have been scored, heroes have been made and on Sunday England or Spain will be crowned champions.\nBut away from the football there have been other memorable - and amusing - moments you may have missed.\nFortunately, BBC Sport has collated some of the best...\nLord of the Rings fan goes viral\nThere's always one, isn't there?\nAustralia's run to the semi-finals brought many joyous scenes as the country celebrated the Matildas' historic progress.\nIt was clear that even non-football fans were getting wrapped up in the moment, and one of the most memorable scenes after Australia's thrilling quarter-final win against France was from inside a plane where everyone was gripped by the penalty shootout.\nWell, almost everyone.\nWith dozens of screens showing those tense final moments, one person was blissfully unware of the surrounding drama as they watched Lord of the Rings.\nIt is a great film, but perhaps the biggest surprise is that it is 2023 and there exists someone who hadn't seen it yet.\nThat moment when you're watching the wrong game...\nWhile people on the ground and in the air were gripped by that tense shootout, for one person Australia's progress to the semi-finals felt less intense.\nThat's because, while former Deputy Prime Minister Barnaby Joyce was watching Australia beat France, the hotel he was at inadvertently put on a replay of a friendly between the two sides from July.\nAustralia won that game 1-0, so nowhere near as nerve-wracking as penalties.\n\"I know it was an incredible penalty shootout which we never saw. We went and had dinner because we thought they'd won 1-0,\" Joyce said., external\nAustralian journalist injured in the line of duty\nIt isn't every day you see your team reach the World Cup semi-finals, so it's understandable if celebrations get pretty wild.\nHowever, reporter Isobel Cootes celebrated Australia's victory over France so much she dislocated her shoulder.\nShe was back to work the following day, albeit with her shoulder in a sling.\nIt wasn't to be for Australia as they were beaten by England in the semi-finals, but perhaps it was a good thing for Isobel that there wasn't another chance for a wild celebration...\nKeeping it clean, again\nIt has become a World Cup tradition - after the partying and celebrations of a Japan win die down, their players and fans stay behind long after the final whistle to make sure they leave everything spotless.\nThe Japanese once again drew global praise as supporters were seen picking up litter in the stands following the 5-0 victory over Zambia in the group stage.\nThe players did their bit too as they tidied up the dressing room and left messages of thanks to stadium staff before they left.\nColombians brought the noise\nThere are about 10,000 miles between Colombia and Australia, but that didn't stop the South Americans being one of the best-supported teams at the World Cup.\nThe loud, colourful Colombians were one of the outstanding features at the tournament and their ear-splitting, goose bump-raising renditions of the national anthem had to be heard to be believed.\nMuch of the backing came from expatriate communities of Colombians in Australia.\n\"There is a trend in Colombia to go and work in Australia, to travel, to study English - many Colombians are doing that. So there are a lot all over Australia,\" Valentina Pena, sports broadcaster for W Radio Colombia, told BBC Sport.\n\"The thing is, we are not only so many - we are really loud. We are Latino people.\"\nSpain relocate because of boredom\nWe get it. An international tournament goes on for a long time and, behind all the tension and excitement of games, and once most of the touristy bits are done, there are long spells with very little for players to do.\nMaybe it's not so bad if you are based in a bustling city like Sydney or Wellington, but for those situated in smaller places with not quite as much to do, it is understandable things may eventually get a bit dull.\nThat's what happened in the case of Spain, who left their training base in the Palmerston North in New Zealand early because of boredom.\nTeam officials stressed, external that the players and staff did enjoy their time there, praising the people, their hotel and the facilities, but the lack of things to do, particularly in the evenings, ultimately took its toll.\nSweden coach walks into cupboard\nOn the eve of Sweden's World Cup semi-final against Spain, coach Peter Gerhardsson will have had a lot on his mind.\nThat's the excuse he should have used when he finished his pre-match news conference by standing up and walking straight into a broom cupboard.\nGerhardsson looked a little perplexed when he opened the door to see shelves and household cleaning products, but was promptly redirected to the actual exit by a geographically sound cameraman.\nConfusion chaos after VAR review\nPublic speaking is never easy.\nIf doing it in a room full of people is nerve-wracking enough, imagine doing it in front of thousands inside a stadium?\nThat's what officials at this World Cup have had to do, with decisions made by the video assistant referee (VAR) now being communicated to the fans.\nIt is the first time that this has been done at a senior international tournament, with the responsibility for making the announcement falling to the on-pitch referee.\nIt has had a couple of teething problems, namely in Spain's group game against Zambia when Jennifer Hermoso initially had a goal ruled out for offside.\nAfter a lengthy VAR check, referee Oh-Hyeon Jeong initially stood by the decision, announcing \"no goal\", but then swiftly backtracked: \"No, wait... no offside. Goal!\"\nA bet is a bet\nThis World Cup has been talked about everywhere from pubs to the corridors of power.\nBefore Australia's quarter-final against France, Australian Prime Minister Anthony Albanese, tagging French President Emmanuel Macron, wrote on social media: \"How about a bet Emmanuel Macron? If the Matildas win tonight, you'll support Australia in the semi-finals. If France win, I'll support France. Deal?\"\nMacron took up the bet and followed through on the deal after France lost, throwing his support behind Australia for their semi-final with England.\n\"Nothing personal against our English friends, but a bet is a bet,\" Macron posted.",
  "word_count": 1087,
  "scraped_at": "2026-02-14T11:17:43.338202"
}