{
  "article_id": "19b77952debf",
  "url": "https://metro.co.uk/2026/01/04/anthony-joshua-posts-first-update-since-fatal-car-crash-nigeria-26052265/",
  "title": "Anthony Joshua posts first update since fatal car crash in Nigeria",
  "date": "20260104T131500Z",
  "domain": "metro.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Anthony Joshua has posted his first social media update since the fatal car crash in Nigeria which killed two of his friends.\nThe 36-year-old was involved in a devastating crash on the Lagos-Ibadan expressway in Makun on Monday morning.\nJoshua’s close friends and long-term members of his team Sina Ghami and Latif ‘Latz’ Ayodele lost their lives in the tragic accident.\nThe funerals of the two men will take place today, Sunday January 4, at London Central Mosque.\nIt was confirmed that Joshua flew back to the UK on Saturday from Nigeria.\nThe two-time world heavyweight champion escaped with minor injuries and has posted on Instagram for the first time since the accident at the start of this week.\nThe Olympic gold medallist is pictured with family and friends, one of whom is holding a picture of Ghami.\nHe wrote: ‘My Brothers Keeper ❤️🪖❤️’\nWho were Anthony Joshua's friends Latif Ayodele and Sina Ghami?\nThroughout his time in boxing, Anthony Joshua has kept a close-knit circle of friends and associates around him, plenty of those working silently behind the scenes during his ascent to the summit of the sport.\nBoth Ghami and Ayodele were part of that group, considered good friends having worked closely with him for years.\nWho is Latif ‘Latz’ Ayodele?\n‘Latz’ is a long-time friend of Joshua’s and has been part of the AJ team going all the way back to his maiden world title victory over Charles Martin in 2016.\nAyodele was Joshua’s personal trainer and a dedicated Muslim having converted to Isam in 2012.\nHis Instagram feed is littered with images and videos of him alongside Joshua in the gym and relaxing away from it.\nJust hours before the crash, he shared a video on Instagram of him and Joshua smiling and laughing over a game of table tennis.\nLatif worked with a number of other prominent sports men and women with New Zealand rugby legend Sonny Bill Williams among those paying tribute.\nAccording to his Facebook profile, he attended St Joan of Arc Catholic School in Rickmansworth, a few miles from Joshua’s hometown of Watford.\nWho is Sina Ghami?\nGhami was Joshua’s strength and conditioning coach, a role he held for more than a decade.\nHe was also the co-founder of Evolve Gym in London. Their website states Ghami was a qualified sports and exercise rehabilitator who specialises in musculoskeletal injuries and corrective exercise.\nGhami was at Joshua’s side throughout his career, including his crowning moment against Wladimir Klitschko at Wembley Stadium in 2017.\nHis last Instagram story appeared to be a shot of Joshua’s motorcade through Lagos.\nThe driver of the black Lexus SUV, Adeniyi Mobolaji Kayode, appeared at a hearing at Sagamu High Court at which he denied all charges against him including dangerous driving. He claims the brakes of the vehicle were not in working order, leading to the fatal crash.\nHis lawyer Olalekan Abiodun made the stunning revelation that Joshua was urged to move to the back seat of the car as his 6f 6in frame was blocking the wing mirror.\nMore Trending\nThe driver’s lawyer told the Daily Mail: ’My client has pleaded not guilty and what happened was an accident, I haven’t had a full chance to speak with him yet but I know he is saying the brakes did not work.\nJoshua was discharged from hospital on New Year’s Eve. Joshua’s mother Yeta Odusanya rushed to her son’s bedside following the tragedy with the pair paying their respects to his ‘departed friends’ at a funeral home on Wednesday afternoon ahead of their repatriation to the UK.\nA statement from the regional governments of Lagos and Ogun said: ‘Anthony Joshua was discharged from hospital late this afternoon though heavy hearted and full of emotions over the loss of his two close friends he was deemed clinical fit to recuperate from home.\n‘Anthony and his mother were at the funeral home in Lagos this afternoon to pay their final respects to his two departed friends as they were being prepared for repatriation scheduled for later this evening.’\nMORE: Tyson Fury announces return to boxing 12 months after fifth retirement\nMORE: Police launch hunt for man linked to fatal crash involving Anthony Joshua\nMORE: Anthony Joshua may not fight again after devastating car crash, Tyson Fury’s promoter fears",
  "word_count": 718,
  "scraped_at": "2026-02-14T13:24:06.451850"
}