{
  "article_id": "19b97112f0d8",
  "url": "https://patriotpost.us/digests/109901-mid-day-digest-2024-09-03",
  "title": "Mid - Day Digest",
  "date": "20240903T181500Z",
  "domain": "patriotpost.us",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Mid-Day Digest\nTHE FOUNDATION\n“I want an American character, that the powers of Europe may be convinced we act for ourselves and not for others; this, in my judgment, is the only way to be respected abroad and happy at home.” —George Washington (1795)\nIN TODAY’S DIGEST\n- Executive News Summary\n- Featured Analysis: More Blood on the Hands of Team Biden/Harris\n- More Analysis\n- Best of Right Opinion\n- Best of Videos\n- Short Cuts\n- Memes and Cartoons\nEXECUTIVE NEWS SUMMARY\nDouglas Andrews, Thomas Gallatin, & Jordan Candler\nGovernment & Politics\n“Meet the Press” coughs up a major correction about Kamala: Kristen Welker is no Tim Russert. But as the host of NBC News’s “Meet the Press,” it seems she’s not even up to the low standard set by her immediate predecessor, Chuck Todd. A case in point came this weekend when Welker tried to attack Donald Trump for his recent appearance at Arlington National Cemetery to honor 13 fallen American warriors. Welker’s guest, Republican Senator Tom Cotton, had said of Harris, “She was four miles away — 10 minutes. She could’ve gone to the cemetery and honored the sacrifice of those young men and women, but she hasn’t. She never has spoken to them or taken a meeting with them.” To which Welker replied with a fake fact-check, “They did meet them during the dignified transfer. They were with them at the dignified transfer.” Um, no. As “Meet the Press” put it in an X post shortly afterward: “On our broadcast this morning, we incorrectly implied that both President Biden and Vice President Harris attended the dignified transfer of 13 American service members killed during the Afghanistan withdrawal. Biden was in attendance but Harris was not.” Ouch.\nWasn’t Walz supposed to help Harris in Minnesota? Normally, a vice-presidential nominee is supposed to help the ticket by solidifying support in the state from which he hails. Apparently, though, no one ever told “Coach Tim Walz” this. Indeed, the deployment-dodging, valor-stealing, ChiCom-sympathizing former unpaid assistant high-school football coach and current governor of Minnesota actually appears to be hurting Kamala Harris’s polling in the Land of 10,000 Lakes. At least according to a new poll from KSTP. “Harris now leads Trump 48% to 43%, a significant decline for her from the previous survey that showed her up 50% to 40%,” reports the New York Post. That is, the Post notes, “the opposite of a post-convention bump that normally would have been expected.” Moreover, the sampling favored Democrats, “with Dems making up 40% of the sample, Republicans 35%, and independents the remainder.” If the Democrats are forced to play defense in reliably blue states like Minnesota, they may well be in big trouble come November 5.\nTim Walz’s political origin story does not add up (Washington Examiner)\nIs Harris’s polling surge fake? Recent polls show that Kamala Harris has either surpassed Donald Trump or is in a dead heat with him in the race for the White House. According to Suffolk University/USA Today, Harris has surged past Trump and now holds a five percentage point lead over him nationally. This represents quite a swing from just two months ago when Trump led Joe Biden by four percentage points. However, given Harris’s sustained unpopularity as vice president, some question the validity of the current polling data. Critics contend that the pollsters have been oversampling Democrat voters, and based upon percentage comparisons from both the 2016 and 2020 election results, they appear to have a point. The benefit of artificially inflating Harris’s numbers would be to gin up Democrat voter enthusiasm and encourage more campaign donations while at the same time discouraging support for Trump. Furthermore, given the fact that the vast majority of the mainstream media is in the tank for Harris, it’s not surprising that what we’re currently seeing is pollaganda at play rather than a genuine reflection of Americans’ opinions.\nKamala Harris goes viral with “cringe” new accent at Detroit rally (Fox News)\nBiden joins Harris at Labor Day rally, returns to campaign trail (Roll Call)\nPelosi claims Harris won an “open” primary (Daily Wire)\nAbout that list of anti-Trump Republicans: In recent days, much has been made within the Harris campaign and the mainstream media (but we repeat ourselves) about a list of “more than 200” people who used to work for former Republican Presidents George H.W. Bush and George W. Bush, and former Republican presidential nominees John McCain and Mitt Romney, who’ve nonetheless penned an open letter to endorse Kamala Harris for president. That seems huge if true. But it’s mostly not true. As The Daily Signal reports, “Many of the signatories were interns or apolitical staff, and many of them went on to work for then-President Barack Obama and current President Joe Biden.” Still others, we can be sure, are of the Trump-derangement strain. Columnist Tyler O'Neil reports that many are apolitical staff, such as “a guy who flew Marine One for George W. Bush (props) who also flew Marine One for checks notes Barack Obama. Not exactly a GOP politico, huh?” But hey, let’s not let the facts get in the way of a great narrative.\nRep. Chip Roy has a simple bill that mandates proof of citizenship to vote, but the media says Dems might shut down the entire government to oppose it (Not the Bee)\nEPA gives $20M to black colleges for electric bikes: In a move designed to reinforce the climate change narrative, the Environmental Protection Agency is giving a nearly $20 million grant to Dillard University, a private historically black college in New Orleans, for the purpose of combatting the “climate crisis.” Part of the means of “fighting” this so-called climate crisis will be the purchase of electric bikes for 300 families. The rest of the grant will go to the school for expanding its electric bike-sharing program, which includes the installation of bike charging stations and the fitting of campus buildings with solar panels. Reason Foundation senior transportation policy analyst Marc Scribner blasted the spending as “just bad federal policy design.” That’s climate policy in a nutshell.\nSecurity\nAnother Islamic convert, another terrorist in the making: Theirs is the Religion of Peace™, they’ll tell you. And if you don’t believe them, they’ll slit your lousy infidel throat. We haven’t heard much news stateside of late about the ongoing war between radical Islam and the West, but that’s not for lack of effort on behalf of the jihadists. As PJ Media reports via Las Vegas’s KLAS: “Joshua Robles, 16, has been ‘accused of plotting an ISIS-inspired terror attack.’ … Ultimately, Robles was deemed to be so dangerous that bail was set at $1 million. … Authorities think that Robles was ‘building explosive devices similar to the ones that killed three and injured hundreds in the 2013 Boston Marathon bombing.’ There is some indication that he planned to carry out an arson jihad attack on New Year’s Day 2024.” Robles had also been searching for floor plans for a local Las Vegas high school. On a sheet of notebook paper found in Robles’s bedroom, he reportedly wrote, “There is no god but Allah and Muhammad is his prophet.” Under that: “DEATH TO JEWS.” But again, Islam is a religion of peace.\nU.S. Marines attacked by mob in Turkey (Daily Wire)\nNorthern border sector continuing to break records in apprehensions (Center Square)\nThe U.S. has seized Venezuelan President Nicolas Maduro’s presidential airplane (Not the Bee)\nEconomy\nCA Dems reject no tax on tips: California Democrat lawmakers voted down a bill introduced by Republicans that would have eliminated the state’s tax on tips. Republicans saw the recent embrace of the tax-elimination policy first advanced by Donald Trump and subsequently embraced by Kamala Harris as a winning issue that would boost revenue for California’s tipped workers, primarily in the restaurant industry. Yet the Democrats’ overspending turned a $97 billion surplus into a $31.5 billion deficit in just two years, so the notion of the Golden State’s government losing more tax revenue was a no-go for the state’s Senate Democrats. Republican State Senator Rosilicie Ochoa Bogh, who introduced the legislation, responded to the downvote, stating, “It is deeply disappointing that the legislature chose not to consider a proposal that could have provided much-needed relief to California’s workers.”\nShake Shack shuttering six California locations after $20 fast food minimum wage (Just the News)\nVolkswagen says it could close plant in Germany for the first time ever (CBS News)\nCulture\nReagan movie divides critics and audiences: Movie critics, like the Leftmedia, apparently put politics before art and, as a result, have difficulty recognizing and appreciating what everyday Americans see and enjoy. Case in point is the recently released “Reagan” film starring Dennis Quaid. Critics have panned the Ronald Reagan biopic, giving it only an 18% approval rating on Rotten Tomatoes, whereas audiences have apparently loved the film, giving it a near-perfect 98% approval rating. Indeed, that Rotten Tomatoes divide represents the largest disparity between critics and the general public in Hollywood history. Critic Adam Nayman from The Ringer was representative, dismissing the film as a “berserk Saturday Night Live sketch.” Yet the wider public has gushed over Quaid’s excellent depiction of Reagan. And the opening weekend numbers appear to support the general audience’s reaction, as the film outperformed expectations of $5 million in ticket sales by pulling in $10 million. Maybe if critics could get outside of their own leftist political worldview, they would be able to recognize and enjoy good movies like the rest of the country.\nReparations bills die on final day of California’s legislative session despite urgent protests (Sacramento Bee)\nA powerful California general was credibly accused of anti-Semitism. Gavin Newsom gave him a promotion. (Washington Free Beacon)\nWomen’s college adopts women-only admission policy, angering students and faculty (National Review)\n26 states have blocked Title IX, nearly 700 schools won’t comply (Center Square)\nWorld\nHamas threatens to release video showing six slain hostages’ “last message” (Jerusalem Post)\nMaduro orders arrest of presidential opponent (Daily Wire)\nBrazil Supreme Court upholds judge’s decision to block Elon Musk’s X across country (NY Post)\nFar-right success in German votes piles new pressure on Scholz’s government (AP)\nFor the Executive Summary archive, click here.\nFollow Thomas Gallatin and Jordan Candler on X/Twitter.\nFEATURED ANALYSIS\nMore Blood on the Hands of Team Biden/Harris\nNate Jackson\n“If there was something we could have done to save you, and we didn’t think of it, I beg your forgiveness,” said a desperately grieving Rachel Goldberg at Monday’s funeral for her 23-year-old Israeli-American son, Hersh Goldberg-Polin. “We tried so very hard, so deeply and desperately. I’m sorry.”\nI’m reminded of the words of King Theoden in The Lord of the Rings: The Two Towers when he visited the grave of his only son: “No parent should have to bury their child.”\nTragically, in this broken world, as in J.R.R. Tolkien’s mythical Middle Earth, parents do sometimes have to bury their children. Worse, they have to do so because of the actions of evil men.\nGoldberg-Polin was one of more than 250 hostages taken by Hamas terrorists during their brutal October 7 assault on Israel. Born in Berkeley, California, he moved to Israel in 2008. He lost part of his left arm in a grenade explosion during the attack. Hamas jihadis killed more than 1,200 Israelis (including 45 Americans), and many of the 250 hostages have since died or were murdered in captivity. In recent days, Hersh and five others were executed — shot in the back of the head — and their bodies were found over the weekend in a tunnel beneath Rafah, a city in the southern Gaza Strip.\nThe other five victims were Eden Yerushalmi (24), Ori Danino (25), Almog Sarusi (27), Alexander Lobanov (33), and Carmel Gat (40). Roughly 100 hostages remain in Gaza, and it’s not certain they’re all alive.\nIsraeli Prime Minister Benjamin Netanyahu offered heartfelt condolences, saying to the families, “I am asking for your forgiveness that we didn’t manage to bring them back alive. We were very close, but we couldn’t make it.” Grief and sorrow weren’t all he offered, though. “Israel is not going to ignore this massacre,” he added. “Hamas will pay a heavy price for this — a very heavy price.”\nAs if inhabiting an alternate fantasy universe, however, American leftists inexplicably blame Netanyahu for the terrorism of Hamas — a proxy of Iran, which Democrats seem bent on appeasing. In fact, after news of the hostage deaths broke, Joe Biden and Kamala Harris yet again urged Israel to show restraint.\nBiden did break from vacation early to issue a statement saying he was “devastated and outraged” and that “Hamas leaders will pay for these crimes.” But he also said he’s “still optimistic” about a ceasefire that can only be had by offering big concessions to those same Hamas leaders.\nMoreover, it was Team Biden/Harris that demanded a delay in Israel’s entry into Rafah. Biden called it a “red line” and even withheld weapons to enforce the point. “I have studied the maps,” proclaimed an obviously incompetent Harris at the time. “There’s nowhere for [Palestinian civilians] to go,” and if Israel went in, she added, there might be “consequences.” The resulting three-month delay clearly benefited only Hamas. Israel managed to evacuate a million Gazans, though the six dead hostages had nowhere to go.\nNow, Harris is trying to sound tough. “Hamas cannot control Gaza,” she said. Yet Biden on Monday accused Netanyahu of not doing enough to reach a hostage deal with Hamas. The mixed messages have been disastrous, and Netanyahu correctly said it sends a message to Hamas: “Kill more hostages.”\nIndeed, Iran-backed Hamas felt emboldened in the first place because of the Biden/Harris surrender and retreat from Afghanistan. A weak and feckless American administration has deadly consequences around the world, and, in that regard, Harris is the incumbent.\nFollow Nate Jackson on X/Twitter.\nMORE ANALYSIS\nMark Alexander: The New York Times Shreds the Constitution — Demos hope their dullard constituents are too ignorant to discern the difference between a democracy and a Republic.\nDouglas Andrews: Did Kamala Lie About Flipping Fries? — Her as-yet unverifiable claim about having worked at McDonald’s while in college is well worth looking into.\nThomas Gallatin: The Disastrous Biden/Harris Clean Power Plan 2.0 — The plan imposes a 90% carbon capture emissions rule onto all future fossil-fuel power plants.\nEmmy Griffin: Foreign Nationals Arrested for Swatting — There are now over 100 instances of fake emergencies.\nMichael Swartz: The First American ‘No-Go Zone’ — A Denver suburb gives us a chilling glimpse of the future in the Biden/Harris regime’s open-borders America.\nRCI: The Sad Lesson of School Sex Abuse — When it comes to dealing with the problem, it’s often pass the trash, not catch the trash.\nBEST OF RIGHT OPINION\nFor more of today’s columns, visit Right Opinion.\nBEST OF VIDEOS\n‘We Invited Trump’ — Eight of the 13 Gold Star families send video messages to Kamala Harris in response to her tweet attacking Donald Trump for an incident while attending a ceremony with them at Arlington Cemetery.\nVeep Thoughts With Kamala Harris (Vol. 20) — Harris finally sat down for an interview with a friendly journalist but struggled to reassure voters who question her competence.\nPastor James Ward Jr: The Truth Behind DEI Initiatives — Dr. Phil tackles DEI. A discussion on diversity, equity, and inclusion in this insightful episode.\nSatire: Kamala’s Promises — She didn’t do anything in four years. Give her another four years to not do anything!\nSatire: TDS Commercial — Ask your doctor about Independence!\nSHORT CUTS\nStraight From the Horse’s Mouth\n“Let’s be clear. My values have not changed.” —Kamala Harris\nFor the Record\n“Harris claimed, ‘I haven’t changed my values.’ Maybe not, but she sure has changed her positions to attract the independent voters she must have to win the all-important swing states. … Commentators who claim she is ‘racing toward the middle’ mean she is making a pragmatic journey to get votes, not something born out of conviction.” —Cal Thomas\nDelusions of Grandeur\n“I have served with President Biden for almost four years now. And I’ll tell ya, it’s one of the greatest honors of my career. Truly. He cares so deeply about the American people. He is so smart and loyal to the American people. … He has the intelligence, the commitment, and the judgment and disposition that I think the American people rightly deserve in their president.” —Kamala Harris\n“I think history is gonna show not only has Joe Biden led an administration that has achieved those extraordinary successes, but the character of the man is one that he has been in his life and career, including as a president, quite selfless and puts the American people first.” —Kamala Harris\n“I am running because I believe that I am the best person to do this job at this moment for all Americans.” —Kamala Harris\nThe BIG Lies\n“My first thought was not about me, to be honest with you. My first thought was about him.” —Kamala Harris regarding the Joe Biden coup\n“When Joe Biden and I came in office during the height of a pandemic, we saw over 10 million jobs were lost. … Hundreds of people a day were dying because of COVID. The economy had crashed. In large part, all of that because of mismanagement by Donald Trump of that crisis.” —Kamala Harris\n“Today, we know that we have inflation at under 3%. A lot of our policies have led to the reality that America recovered faster than any wealthy nation around the world.” —Kamala Harris\n“The root causes work that I did as vice president, that I was asked to do by the president, has actually resulted in a number of benefits.” —Kamala Harris\n“We have laws that have to be followed and enforced that address and deal with people who cross our border illegally. … I would enforce our laws as president going forward. I recognize the problem.” —Kamala Harris\n“I have spent my career inviting diversity of opinion.” —Kamala Harris\nLack of Self-Awareness Award\n“One of my highest priorities is to do what we can to support and strengthen the middle class.” —Kamala Harris\nWorld’s Smallest Violin\n“My wife the English teacher told me my grammar’s not always correct. But again, if it’s not this, it’s an attack on my children for showing love for me, or it’s an attack on my dog.” —Tim Walz when asked, “The idea that you said that you were in war, did you misspeak, as the campaign has said?”\nBelly Laughs of the Day\n“I certainly own my mistakes when I make ‘em.” —Tim Walz\n“[Harris] is a homework doer.” —CNN’s Abby Phillip\nDezinformatsiya\n“Harris was not the border czar.” —CNN’s John Berman\nPolitical Futures\n“A lot of pro-life activists have worked for a very long time to eradicate abortion. At a time they are on defense, the presidential candidate they are backing turning his back on them too feels raw and feels like a betrayal for them. … Pardoning those who went to prison for praying at abortion clinics would be one way to remind those voters that there really are differences between the two sides that matter in the real world. Emphasizing regulatory control is another. Trying to change the message in the middle of a campaign through improvisation will end badly.” —Erick Erickson\nAnd Last…\n“Somehow, in the whirlwind of campaign 2024, we have reached the point where it’s news that the Democratic nominee for president of the United States of America will answer questions from the press.” —Matthew Continetti\nMEMES & CARTOONS\nFor more of today’s memes, visit the Memesters Union.\nFor more of today’s cartoons, visit the Cartoons archive.\nPlease join us in prayer for our nation — that righteous leaders would rise and prevail and we would be united as Americans. Pray also for the protection of our Military Patriots, Veterans, First Responders, and their families. Please lift up your Patriot team and our mission to support and defend our Republic’s Founding Principle of Liberty, that the fires of freedom would be ignited in the hearts and minds of our countrymen.\nThank you for supporting our nation’s premier online journal of Liberty.\nSemper Vigilans Fortis Paratus et Fidelis",
  "word_count": 3389,
  "scraped_at": "2026-02-14T13:15:00.411500"
}