{
  "article_id": "19c54ef4ead3",
  "url": "https://theathletic.com/4484164/2023/05/03/womens-fa-cup-final-sell-out-var/",
  "title": "Women FA Cup final tickets sell out , VAR and goal line technology confirmed for first time",
  "date": "20230503T121500Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The 2023 Women’s FA Cup final between Chelsea and Manchester United is set to be played at a sold out Wembley for the first time.\nThe FA announced all tickets for the match at the 90,000 capacity stadium have sold out 11 days out from the showpiece event.\nThe fixture will also see VAR and goal line technology in use for the first time in the competition’s history.\nAdvertisement\nThe Women’s FA Cup final has been staged at Wembley since 2015 and an attendance record of 49,094 was set during last season’s final between Chelsea and Manchester City. Chelsea ran out 3-2 winners in extra time.\nThis season’s final is set to comfortably eclipse that figure and should set a new record for the highest attended women’s club match in England, which was only recently broken during Arsenal’s Champions League semi-final defeat against Wolfsburg. A crowd of 60,063 were at the Emirates to see Wolfsburg’s 3-2 extra-time victory.\nIt represents the fourth successive women’s fixture at Wembley to sell out following the Euro 2022 final, October’s friendly between England and the USWNT and April’s Finalissima between England and Brazil.\nBaroness Sue Campbell, the FA’s Director of Women’s Football said: “We had a strategic ambition to sell out the Vitality Women’s FA Cup Final at Wembley Stadium by 2024, so to have done that a year early is a fantastic achievement.\n“Those fans lucky enough to have a ticket, should be treated to a brilliant spectacle as well as having the opportunity to be part of Women’s FA Cup final history. It’s always one of my favourite days of the season and a showcase of the best women’s football. I can’t wait to see a packed stadium and hear the atmosphere the fans generate with the world watching on.”\nSuffolk-based official Emily Heaslip has been confirmed as the referee for the 2023 FA Cup final. Georgia Ball and Chloe-Ann Small are the assistant referees, Abigail Byrne is the fourth official and Sophie Dennington is the reserve assistant referee.\nMichael Salisbury will be supported by assistant Sian Massey-Ellis on VAR duty.\nSelect Group Women’s Professional Game director Bibi Steinhaus-Webb said: “As part of the continued development of our officials, we have been preparing for the introduction of technology in this season’s Vitality FA Women’s Cup Final for a sustained period of time.\nAdvertisement\n“Broadening the knowledge and expertise of the officials to be ready to effectively operate VAR and goal-line technology has become a key focus of our training, coupled with the sessions officials undergo when they are away on FIFA and UEFA duty.\n“Anything that can aid our match officials in their decision making has to be welcomed, especially given how the game continues to evolve and produce more complex situations which need to be judged on a match-by-match basis.”\nThe Women’s FA Cup final takes place on May 14.\nChelsea are looking to defend the trophy for a third successive season and win the competition for a fifth time while Manchester United are making their maiden appearance in a Women’s FA Cup final as they attempt to win their first major trophy.\nGO DEEPER\nThis Is Me: Fara Williams\n(Photo: Getty Images)",
  "word_count": 532,
  "scraped_at": "2026-02-14T12:55:32.461906"
}