{
  "article_id": "19d287d2093f",
  "url": "https://www.theadvocate.com.au/story/8212302/victory-a-matter-of-time-for-strikers-in-physical-clash-with-clarence/",
  "title": "Devonport execute dominant second - half in NPL Tasmania contest | The Advocate",
  "date": "20230528T051500Z",
  "domain": "theadvocate.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It may have taken until the second-half of Saturday's game against Clarence Zebras for the Devonport Strikers to score, but it was a contest coach Tom Ballantyne felt his side were in control of from the outset.\nSubscribe now for unlimited access.\nor signup to continue reading\nConceding a late penalty goal in the opening half, the Strikers made amends early in the second term by the boot of Brody Denehey.\nLed by milestone man Miles Barnard on his 100th game, Devonport managed another late goal to seal the match 2-1 at Wentworth Park.\nIt was a pleasing result for Ballantyne, who believed his side took their opportunities when presented.\nI felt the win was a matter of time for us [on Saturday], rather than in the previous week it was more frantic.\n- Devonport Strikers coach, Tom Ballantyne\n\"We had some really good moments in this game and had a lot more control [than in last weekend's Lakoseljac Cup semi-final],\" Ballantyne said.\n\"I felt the win was a matter of time for us [on Saturday], rather than in the previous week it was more frantic.\"\nWhile Ballantyne felt his side's dominance was clear, he acknowledged the physicality the Zebras brought to the table.\nALSO IN SPORT:\n\"They match up physically very well against us. Their strikers are strong and powerful and they have some really good wingers.\"\nIn the under 21 NPL Tasmania competition, the Strikers conceded a two-nil loss to Clarence.\nIt was a tough day at the office for Devonport in the Women's Super League, with the Strikers falling short 6-2 against Kingborough Lions.\nIn the Northern Championship, Devonport got the upper-hand on Burnie, finishing 5-2.\nSomerset proved too strong for Ulverstone, taking a one-nil victory.\nNorthern Rangers executed a dominant win over Launceston United, winning four-nil at home.",
  "word_count": 302,
  "scraped_at": "2026-02-14T12:39:28.208802"
}