{
  "article_id": "1a39fe29b73a",
  "url": "https://www.dailymail.co.uk/tvshowbiz/article-12808629/Im-celeb-ITV-bosses-blame-Jamie-Lynn-Spears-Grace-Dent-departures-weather-rain.html",
  "title": "EXCLUSIVE Scrambling Im A Celebrity bosses blame Jamie Lynn Spears and Grace Dent departures on the terrible WEATHER in camp as series goes into meltdown and producers battle to fix  mes of jungle show",
  "date": "20231130T081500Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "EXCLUSIVE Scrambling I'm A Celebrity bosses blame Jamie Lynn Spears and Grace Dent's departures on the terrible WEATHER in camp as series goes into meltdown and producers battle to fix 'mess' of jungle show\n- Meet the 2023 I'm A Celeb campmates\n- READ MORE: Inside Jamie Lynn Spears' tumultuous relationship with her sister Britney as she QUITS I'm A Celeb\nI'm A Celebrity... Get Me Out Of Here bosses have blamed the dismal Australia weather for the celeb departures from the show this week.\nJamie Lynn Spears shocked the camp with her exit on Wednesday, just days after restaurant critic Grace Dent suddenly quit.\nThe official line from ITV bosses is that the women left because of 'medical reasons,' but insiders have told MailOnline that the jungle storms have also been a huge factor.\nA source spilled: 'The weather in the jungle this year has been terrible. The campmates have had barely one full day of sunshine and have had to contend with endless rain which has only made the already gruelling living conditions worse.'\n'The weather has really affected the mood in camp. Everyone is miserable and wanting to leave.'\nI'm A Celebrity... Get Me Out Of Here bosses have blamed the dismal Australia weather for the two shock departures from the show\nA source spilled: 'The weather in the jungle this year has been terrible. The campmates have had barely one full day of sunshine and have had to contend with endless rain'\n'The forecast predicts more sunshine next week so hopefully that will make everyone happier and give them all a boost.'\nThe camp was hit by thunderstorms before the celebs entered ten days ago, with the rain not letting up since.\nCelebrities are partly sheltered from downpours by a retractable white canopy that hangs above the main camp, Radio One DJ Chris Moyles revealed last year.\nWhen the weather turns torrential, it stops the campmates from getting rained on directly and protects the fire from being put out - but celebrities are still at risk of getting soaked if they sleep in the hammocks on the edge of camp.\nITV has been plunged into chaos, with insiders at the channel saying that they are 'struggling to keep up with the drama'.\nOne source describes the situation on the popular programme as a 'mess,' while they fear there could be more departures in the coming days as the atmosphere in the jungle becomes even more tense.\nIt is the first time in the show's 23-series history that two contestants have left on medical grounds, with insiders claiming staff on the programme 'aren't sleeping' due to the stress.\nJamie Lynn Spears shocked the camp with her exit on Wednesday , just days after restaurant critic Grace Dent (pictured) suddenly departed\nThe camp was hit by thunderstorms before the celebs entered ten days ago, with the rain not letting up since\nCelebrities are partly sheltered from downpours by a retractable white canopy that hangs above the main camp, but have to brave the rain when moving around the jungle\nWhile questions will be raised over what has changed this year, one anonymous source insisted the producers carried out stringent psychiatric tests on the participants before they joined and blamed the problems on 'bad luck'.\nOn Wednesday afternoon, a spokesman for the show confirmed Jamie Lynn – the younger sister of singer Britney Spears – had left.\nHe said: 'Jamie Lynn Spears has left I'm A Celebrity... Get Me Out Of Here! on medical grounds.\n'She's been a fantastic campmate who has triumphed at trials and bonded well with her fellow celebrities.'\nShe has had a very emotional time in camp and has frequently been filmed in floods of tears over the difficult conditions and missing her family back home.\nShe left the show days after Grace left the jungle amid fears over her 'unwell' appearance and after Nella Rose was taken out of the camp to be treated by medics - although she has since returned.\nFood critic Grace had stunned her camp mates after saying the night before: 'I just want to go home.' Meanwhile, while TikTok star Nella Rose was briefly taken the camp to receive treatment from medics on Tuesday, sparking fears she would also quit altogether.\nOne source told the Mail: 'People working on the show aren't sleeping, it is a mess. Nobody can keep up with what is going on, it is like nothing we have ever seen before.\n'Hopefully things will settle down but it is fair to say things have been chaotic. As with all of these things, the truth is expected to come out in the coming weeks.\n'As for now, everyone else involved in the show is thinking 'whatever next?'\nITV is likely to now face questions over what has been different this year. Never before have two contestants left within two days of one another – or another competitor be taken off for medical treatment so close to the departures.\nHowever, sources at the broadcaster insist that the same – if not more stringent – psychiatric tests have been carried out for the contestants.\nOne said: 'The usual protocol is in place, it all just seems to be bad luck this year. Perhaps they just haven't gelled in the same way this year.'\nA spokesperson for the Channel told MailOnline: 'We have rigorous and robust processes in place to assess all of our camp mates ahead of being confirmed to participate in the show.\n'We have an on site medical team and psychologist to ensure that health and wellbeing, and duty of care towards the participants, is prioritised at all times.'\nMeanwhile, ITV bosses are also furious with Nigel Farage's team who have complained to the channel after he was seen nude in the shower.\nThey claim the network has broken an 'indecency' clause in his contract. They are also whinging that the producers are left wing.\nOne ITV insider said: 'It is becoming really tiring and annoying now.'\nDuring her time in the camp, Jamie Lynn discussed her fractured relationship with her sister Britney, insisting 'families fight' (pictured in 2017)\nBritney 'has always been forced to play the role of mother to Jamie Lynn and still feels that sort of responsibility,' a source previously said (the pair are pictured in 2003)\nA show spokesperson said: 'She's been a fantastic campmate who has triumphed at trials and bonded well with her fellow celebrities'\nViewers will see Jamie Lynn's exit from the show in Wednesday night's episode, and the campmates are aware of her departure. It has been confirmed that she will not be replaced.\nMs Spears openly admitted she missed her two children, daughters Maddie, 15, and Ivey, five, but in recent days appeared to have settled into camp life.\nJamie Lynn is expected to receive her full fee for taking part in the show, as any star who stays in the camp for longer than 72 hours is expected to be paid in full.\nFollowing the news of Jamie Lynn's departure, viewers took to X, formerly known as Twitter, to share their disappointment.\nOne posted: 'So proud of Jamie because she's com so far in such a short amount of time sometimes it just gets too much for someone especially Jamie who is from the States she should be proud of herself.'\n'I'm not surprised after last night's episode, can't say I'm not disappointed,' another shared, while a third added: 'Given last night's episode I can't say I'm shocked.'\nOne added: 'Shame, I thought she was growing into it.'\nSome wrote: 'That's a proper shame coz I liked her.'\n'Really warmed to her after the first few days, she was one of the best in there, shame but kind felt inevitable'.\n'That's sad. Good luck to her. It's brutal in there. I guess it's the survival of the fittest'.\n'Jamie should be so proud of herself she's held out for as long as she possibly could. Sometimes you just have to say enough is enough. So proud of her no matter what.'\n'Feel sad for Jamie Lynn Spears as she has become the second to leave I'm A Celebrity due to medical reasons. She has had to put her mental health first which I respect.'\n'Can't say I'm surprised but I think it's a shame she was really good in challenges and trials'.\n'Gutted Jamie Lynn has left ImACeleb. She was my favourite'.\nFollowing the news of Jamie Lynn's departure, viewers took to X, formerly known as Twitter, to share their disappointment\nThe actress openly admitted she missed her two children, daughters Maddie, 15, and Ivey, five, (pictured in 2019) but in recent days appeared to have settled into camp life\nDuring Tuesday's show, viewers saw Jamie Lynn break down in tears once again after being offered a small square of chocolate by her campmates\nIt comes just two days after Grace Dent decided to leave the jungle on Monday, after 'losing all her energy' in camp and reaching breaking point as she faced the prospect of doing another Bushtucker Trial.\nWithin three hours of the announcement being made Grace was spotted at Brisbane Airport as she made her return to the United Kingdom.\nThe 50-year-old food critic refused to talk to press at the airport and kept her head down as she rushed through the terminal.\nDuring Tuesday's show, viewers saw Jamie Lynn break down in tears once again after being offered a small square of chocolate by her campmates.\nShe began crying after eating the tasty treat, as she took herself away for time alone and was later comforted by former boxer Tony Bellew.\nThe chocolate bar came as a reward after Marvin, Sam and Tony's successes at The Misery Hotel, offering the campmates their first taste of chocolate since entering the jungle.\nSam, as team leader, decided to crack open the chocolate for a morale boost after the camp experienced extremely wet weather.\nSpeaking in the Bush Telegraph he said: 'The heavens have opened. I've never seen a wetter day than right here, right now. In my entire existence by the way. It's like a monsoon. I'm team leader, I'm on my throne, I want people to be happy.'\nSam rallied his camp by saying: 'Do you know what we need? A bar of chocolate!'\nThe news went down very well as everyone began to celebrate and Fred painstakingly chopped the bar up into equal parts.\nThis meant that by the time the chocolate was divided into 11 parts, everyone only had a tiny morsel to taste each.\nSam said in the Bush Telegraph: 'The camp went wild! Everyone's clapping. It was like we'd won the World Cup!'\nAs they shared out every crumb Tony laughed: 'The struggle is real!' and Josie chose to save hers for another time, saying she would have 'chocolate rice'.\nIn the Bush Telegraph Tony said: 'I let a piece of chocolate melt on my tongue in my mouth. That was a very strange thing to do. The jungle has made me soft.'\nBut the chocolate did not go down well with everyone as Jamie Lynn took herself away from camp to cry.\nWhen she walked back in, fellow campmates Tony and Danielle Harold checked up on her.\nTony said: 'OK, mate?' while Danielle gave her a cuddle.\nJamie Lynn said: 'That little square of chocolate p*****d me off.'\nDanielle said: 'It's because it gives you a taste of what's outside…'\nJamie Lynn laughed: 'I probably should have just let someone eat it. I feel a little better maybe. I just needed to cry.'\nNick encouraged her: 'Have a little cry J.'\nJamie Lynn in the Bush Telegraph said: 'I just want more chocolate.'\nIn the Bush Telegraph Tony said: 'She's just getting frustrated, she misses her kids. She's so far away from home. It's good to just go and ask someone how they're doing. Just look out for each other. Everyone should have that attitude with everybody.'\nChecking on her near the creek, Tony asked her: 'How you doing girl?'\nJamie Lynn said: 'I needed a change of scenery. I was struggling earlier.\n'I'm just tired of sitting up there. I'm sorry I didn't mean to make you come all the way down here.'\nGiving her a hug Tony said: 'Don't be silly, I was coming to see how you was.'\nDuring her time in the camp, Jamie Lynn discussed her fractured relationship with her sister, insisting she's learned not to speak publicly about any difficulties between her and her pop star sibling, 41, but admitted her family 'fights better than most'.\nAmerican star Jamie claimed both she and Britney had 'complicated' upbringings which they'd both dealt with in different ways but, despite their differences, Britney would be 'concerned' about her suffering in the jungle.\nShe insisted Britney would be 'checking on me heavily' and would have been concerned about her daily crying at the start of this year's ITV series.\nIn camp, Sam asked Jamie Lynn: 'Do Britney's kids really like you? Are you like the cool aunt? Do you think she's watching you on this?'\nJamie Lynn said: 'I can imagine she'd be worried about me on here. I think she's probably checking in on me heavily.\n'I do think she's probably like, 'Why would she do that?' She asked me that before I came here, she was like, 'You're really going to do it?' I was like, 'I'm going to go to Australia and check it out.'\n'My crying, she'd probably be like, 'Ya'll get her the f*** out of there, right now!' She's a good big sister, she is.\nDiscussing her relationship with Britney, Jamie Lynn previously said she's learned not to speak publicly about any difficulties, but admitted her family 'fights better than most'\n'Yeah, I love her. Me and her throw down. The world's seen that. I've learned to stop talking about it publicly, but you know what, family's fight. Listen, we just do it better than most.'\nSam replied: 'But everyone does man. Everyone's got stuff they argue about all the time.'\nJamie Lynn said: 'Me and her both have had a very complicated upbringing. We've had very complicated circumstances and we both had to deal with them in different ways.\n'Sometimes we took it out on each other when perhaps we shouldn't have.\n'I've never, ever… I've been the one person in her life - and she can say this - I've never taken anything from her, you know? I've been the one person in her life who's always said, 'I just want to be your sister'.\n'We just had a really weird life so we can't explain it to many people, but at the end of the road I know that that's my family, I love them.'\nViewers mocked Jamie Lynn Spears as the camp fell into silence when she insisted she loved her famous sister Britney.\nJamie Lynn insisted 'I love my sister' when retired jockey Frankie Dettori, 52, asked her if it was true she and her older sister did not get along during Friday's episode.\nWhile Jamie Lynn did not deny rumours of a falling out, she did say she loved her sister, prompting the rest of her campmates to sit in silence after hearing her words.\nJamie Lynn also shared insight into Britney's wacky rider during her Las Vegas residency,\nBritney's younger sister appeared on Dancing With The Stars before featuring on I'm A Celeb\nOutside of her shows at the Planet Hollywood Resort and Casino, The Hit Me Baby One More Time superstar stayed in a luxurious three-floor suite at the Rio, which had previously been inhabited by Elton John.\nAfter Made In Chelsea's Sam Thompson described to Jamie Lynn how he imagined her home life would be, she revealed Britney is a big fan of crawfish - and that it was her special request in Vegas.\nBritney was said to have imposed a strict ban on her sister Jamie Lynn ahead of her stint on I'm A Celebrity, warning her not to mention her name as the pair attempt to rebuild their relationship.\nThe hitmaker reportedly finds it 'sad' that her estranged younger sister continues to use her stardom to make money, and has encouraged her to land contracts in her own right.\nViewers of the show took to Twitter to mock the situation after the scene aired on Friday, with one person writing: ''Yeah I love my sister…' I bet you do Jamie Lynn after hiring the woman who created her conservatorship as your business manager.'\nSomeone else wrote: 'Big Brother's bird noises would've had more personality than Jamie Lynn admitting to loving her sister 'enthusiastically'.'\nAnother person wrote: 'Love Frankie for asking Jamie Lynn the questions no one else is brave enough to ask!'\nWhile someone else shared: 'Love Frankie straight to the point with Jamie Lynn.'\n'Britney banned Jamie Lynn from talking about her,' a source told DailyMail.com exclusively. 'She told her to, for once, make her money without feeling the need to use her sister's name to get a contract.\n'For Jamie Lynn's entire career, every show, every appearance, every interview is Britney, Britney, Britney. It's just sad.'\nThe insider cited Jamie Lynn's short-lived spot on Fox's Special Forces: World's Toughest Test - which aired a clip of Jamie Lynn in tears while discussing her self-esteem issues brought on by being Britney's sister.\n'The producers used it as an opportunity for her to dish on Britney and she did, tears and all. It was perfect for what they needed out of her,' the source continued.\nBritney's request for Jamie Lynn to keep her name out of her mouth comes after a slew of reality television appearances, and interviews, in which she brought up her sister.\nIn January, Jamie Lynn was cast in Fox's grueling reality competition show, Special Forces: World's Toughest Test.\nDuring the first episode, Jamie Lynn broke down in tears as she discussed Britney achieving global fame when she was just a child, admitting she wants to prove that she is 'worth something' too.\n'Growing up, my sister became famous, worldwide famous, when I was very young,' Jamie Lynn said.\n'I guess I just wanna like [proving that] I'm just like worth something. I'm so proud of her, love her to death, but I don't know. Sometimes I feel like I don't really have anything for myself,' she added.\nJamie Lynn quit during episode two, citing her daughters as the reason for her departure.\n'Like, I just can't do it one more night. I can't do it,' Jamie Lynn said while confiding in Spice Girl Mel B at the start of the episode.\nIn October, Jamie Lynn became a contestant on Dancing With The Stars and, according to Variety, earned $125,000, which is the standard pay for a celebrity who completes rehearsals and two weeks of competition.\nBritney was said to have imposed a strict ban on her sister Jamie Lynn ahead of her stint on I'm A Celebrity, warning her not to mention her name\nJamie Lynn and her partner Alan Bersten, were booted during week two after scoring 16 out of 30 for their cha-cha routine.\nBosses were said to be furious at her early exit – because they had allegedly been planning for an 'incredible' on-screen reunion between the actress and Britney.\nIn Britney's recent memoir The Woman In Me, she dragged Jamie Lynn for a response she got from her sister when she reached out about the abusive conservatorship she was held in by her father Jamie Spears, for 13 years.\nIn a text message, Britney claimed that Jamie Lynn told her: 'Stop fighting it. There is nothing that you can do about it, so stop fighting it.'\nI'm A Celebrity bosses were already said to be fearing more stars could quit the show after Grace Dent's departure, as the campmates battle with trying conditions in Australia.\nThe group have been left hungry after Nella Rose and Frankie Dettori failed to win any meals for camp in the latest trial.\nThe show's producers are now worried more campmates may sensationally quit the jungle.\nA source told The Sun: 'Nella and Frankie's trial fell flat. No coins or stars. What's worse backstage is it was a two-month build to create that set and it's resulted in a s*** trial.\n'Her going back empty handed - and this awful weather - have left a real sense of misery.'\nOn Tuesday, Nella was removed from camp to be treated by on-site medics, sparking fears she'd also quit the show.\nInsiders have now confirmed she sought treatment for a 'physical medical emergency,' with the timing deemed 'unfortunate' as she had to be seen urgently during the live segment of the show.\nI'm A Celebrity bosses were already said to be fearing more stars could quit the show after Grace Dent 's departure and Nella's medical scare\nThe emergency was not linked to any injury sustained in a trial. Just hours before her removal from camp, the social media star was tended to by animal handlers after a snake wrapped itself around her during her latest trial.\nA source has told The Sun: 'It was unfortunate timing that Nella had to be taken out of camp just before the live scenes.'\n'She had to be seen by the team with a physical, medical emergency but it was dealt with swiftly.\n'Nella has had a rough time so far but she is a tough cookie and will be back smiling and laughing with the other campmates in no time - this wasn't anything to do with her mental health.'\nAn ITV spokesperson confirmed to MailOnline that Nella has since rejoined the camp after her visit to the medic on Wednesday morning, Australian time.\n'During last night's live broadcast, Nella Rose required medical treatment on site and was deemed unable to take part in the trial. Nella has since rejoined camp,' they confirmed.\nNella was noticeably absent in Tuesday night's live segment of the show which was filmed between 7am and 8am on Wednesday morning in Australia.\nEarlier in the episode, the public voted Nella in for her sixth Bushtucker Trial alongside the champion jockey Frankie Dettori but viewers claimed they missed out on winning any stars because of how slow Nella was.\nMost watched News videos\n- Extraordinary moment mass brawl breaks out between Brits on flight\n- Finance expert's TV interview interrupted by adorable granddaughter\n- Moment driver veers to target e-bike riders before killing teen\n- Moment Swiss bar fire owners collapse after being confronted\n- Chilling police interview of ISIS fanatic plotting UK attack\n- Astonishing moment a street is swallowed by a sinkhole\n- Israeli hostage reveals how she survived being tortured\n- Deepak Chopra confronted over his relationship to Epstein\n- Food vlogger dies after 'eating toxic devil crab'\n- Spy cam shows woman on her knees next to Jeffrey Epstein\n- New video shows man with backpack similar to Guthrie kidnapper\n- Toddler opens car door in traffic and sends biker flying",
  "word_count": 3849,
  "scraped_at": "2026-02-14T13:27:46.309729"
}