{
  "article_id": "1a52cc5a55d7",
  "url": "https://wrif.com/2024/02/27/nfl-player-wants-to-recoup-belongings-after-storage-unit-sold/",
  "title": "NFL Player Wants To Recoup Belongings After Storage Unit Sold",
  "date": "20240227T154500Z",
  "domain": "wrif.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "NFL Player Wants To Recoup Belongings After Storage Unit Sold\nStorage Wars is a very entertaining show. You never know what you might find in a storage locker that was abandoned. Well, what would happen if you realized your storage…\nStorage Wars is a very entertaining show. You never know what you might find in a storage locker that was abandoned. Well, what would happen if you realized your storage locker ended up being sold at an auction without you knowing about it? That happened! Now, an NFL player wants to recoup his belongings after his storage unit was sold.\nMazi Smith is now looking to get his belongings back. Turns out, there were a lot of valuable items inside his locker!\nNFL Player Wants To Recoup Belongings After Storage Unit Sold\nDallas Cowboys defensive tackle, and former University of Michigan player, Mazi Smith is trying to get back thousands of dollars worth of his old University of Michigan cleats, sneakers, and other memorabilia after his old storage locker in Ann Arbor was sold at an action, according to Daily Mail.\nIn an email, attorney Levi G. McCathern II told Daily Mail, \"Mazi Smith was completely unaware that his personal belongings had been sold until he was sent the TikTok video of the man who purchased the storage unit where his belongings were being stored.\"\nThe winning bidder, Vincent Broadway, revealed the contents of the storage locker on TikTok. In the video, he alludes to it being a former Michigan football player, but doesn't identify Smith by name. However, he did say it was a Wolverine taken in the first round of the 2023 draft. Well, there was only one Wolverine: Mazi Smith.\nThe attorney did eventually confirm the locker belonged to Smith. He says it fell through the cracks during Smith's transition into the NFL. It happens. That's something you can definitely forget about with all the excitement and craziness happening during that time, I imagine. That's why they were delinquent on rent and the locker went into auction.\nNow, they're trying to get the stuff back and are hopeful that Broadway will be cooperative. Hopefully, he gets a little cut or something. Fair is fair!\nCheck out Broadway's TikTok video below!\nDave & Chuck The Freak’s Top 10 Peep Shows Of 2023\nIt's that time of the year again. When we all look back at our favorite movies, albums, shows, and more from 2023. All of those are very important. There's one list you can't forget to share, though. Introducing Dave & Chuck The Freak's Top 10 Peep Shows of 2023!\nWe took the most popular Dave & Chuck The Freak Peep Show videos from 2023 and made a list! In the end, we were left with 10 hilarious videos.\nWhat Is The Dave & Chuck The Freak Peep Show?\nNow, you might be wondering, \"what is the Dave & Chuck The Freak Peep Show?\" I'm not going to embarrass you for asking. Not everyone knows about it! Let's change that. The Peep Show are videos from Dave & Chuck The Freak's show. The cameras are always rolling and we pull some of the best clips to share so you can laugh along with us!\nThe Peep show allows you to feel like you're right there in studio with Dave & Chuck The Freak. It's almost as if you're a part of their conversation. Of course, they can't hear you. Nor will they react to your witty comments (because they can't hear you). However, it still gives that same feeling.\nYou can actually learn a lot while watching Dave & Chuck The Freak's Peep Show. Maybe you never knew that character was actually Chuck doing a voice. Perhaps you didn't know it was Andy who said that hilarious line. Now, you can be fully in the know! It's all thanks to the Peep Show!\nHowever, the problem with putting together a Top 10 list is a lot of funny stuff doesn't make the cut. That means Carol And Her Moth, Fluffy The Cat, and more are left on the cutting room floor. As you may remember, those were some hilarious videos. Yet, they weren't good enough for the top 10. That's saying something!\nHere are the top Dave & Chuck Peep Shows of 2023! Make sure to keep up with the Peep Show at DaveAndChuckTheFreak.com!\nDave's Music Video\nDave & Chuck the Freak talk about the popular Reggaeton artist Chucho Flash again after he released a music video and used an image of Dave in the intro. The show talked about him last year when he was arrested and a clip from that Peep Show got Dave into the music video.\nChuck's Secret Acting Gig!\nDave & Chuck the Freak watch a new HIV drug commercial after a listener e-mailed into the show saying a person from the commercial looks like Chuck and wondered if he took a side-job in acting. Is it actually Chuck?\nDoodley Boop\nDave & Chuck the Freak were talking about a story involving a Florida man and find out that he is currently missing. This breaking news turns the segment dark-sided and leaves Dave with only one thing to say...\"Doodley Boop\".\nIf She Dies...She Dies\nDave & Chuck the Freak talk about two firefighters in Washington, D.C. who are under investigation after they allegedly stopped at Chick-fil-A to pick-up food before responding to their emergency call. Not what you look for in first responders.\nDave Watches Porn\nDave & Chuck the Freak talk about a man in New York who works as a sensual masseuse that just married 10 women at the same time. After searching through his videos they discover he does a little more than sensual massage which leads to Dave creating a new word. SHA-DOUGLE!!\nRV Jumps Huge Gap\nIt's like a scene out of a movie. Dave & Chuck the Freak talk about an older couple that jumped a 200 foot gap in their RV to try and make it on a ferry they needed to catch.\nMakes No Damn Sense!\nLife has many puzzling mysteries. Dave & Chuck the Freak discuss Twisted Tea back wax, bourbon deodorant, and other things that \"make no damn sense\".\nA Journey Into Dave's Mind\nDave has the song 'Pennies From Heaven' stuck in his head and says he can't figure out why. Chuck quickly helps him out by realizing it was used in the movie 'Elf' and that Dave has a story about pennies coming up later in the show.\nMcNugget Riots\nDave & Chuck the Freak talk about a woman who found pennies inside her Chicken McNuggets and the press conference the police department held. Then, they imagine riots breaking out all over Ohio due to fear of unsafe McNuggets at McDonald's locations across the state.\nChuck's Metal Detecting Sleepover\nDave & Chuck the Freak talk about the mystery metal detecting trip Chuck went on over the weekend and hear about the the living conditions, the food, and any treasures he might have found. Where's my invite for the next trip? Sign me up!",
  "word_count": 1183,
  "scraped_at": "2026-02-14T14:10:46.157877"
}