{
  "article_id": "1a5c47bcda6d",
  "url": "https://www.birminghammail.co.uk/news/uk-news/jury-out-joey-barton-social-32833525",
  "title": "Jury out in Joey Barton social media case",
  "date": "20251107T170000Z",
  "domain": "birminghammail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Jury out in Joey Barton social media case\nBarton, 43, claims the posts in questions were nothing more than \"crude banter\"\nA decision could soon be reached in the trial of former footballer Joey Barton, who stands accused of posting \"grossly offensive\" messages to pundits Eni Aluko, Lucy Ward and TV presenter Jeremy Vine, on social media.\nThe jury in the trial, which is being held at Liverpool Crown Court, has heard how Barton allegedly \"crossed the line between free speech and a crime,\" and has now retired to deliberate its verdict.\nForty-three-year-old Barton described Ward and Aluko, who grew up in Birmingham, both former professional footballers and now pundits, as the \"Fred and Rose West of football commentary,\" after a televised FA Cup match in January 2024 between Crystal Palace and Everton.\nHe subsequently superimposed the faces of the two women onto an image of the serial killers.\nBarton is alleged to have continued his tirade of abuse, adding that Aluko, who played for Birmingham City, belonged in the \"Joseph Stalin/Pol Pot category\" as she had \"murdered hundreds of thousands, if not millions, of football fans' ears\". In another post, he wrote: \"Only there to tick boxes. DEI is a load of sh*t. Affirmative action. All off the back of the BLM/George Floyd nonsense\".\nThe ex-Manchester City, Newcastle United and Marseille player is also accused of implying Jeremy Vine harboured a sexual interest in children after the presenter questioned whether Barton had a \"brain injury\" and often referred to him as \"bike nonce\" on X, formerly Twitter.\n\"Have you been on Epstein Island? Are you going to be on these flight logs? Might as well own up now because I'd phone the police if I saw you near a primary school on ya bike,\" Barton is alleged to have asked Vine.\nLiverpool Crown Court heard how Barton believes he's the subject of a \"political prosecution\" and that rejects claims his intention was \"to get clicks and promote himself,\" adding that his posts about Aluko and Ward were \"dark and stupid humour\" and that he was \"trying to make a serious point in a provocative way\".\nHis tweet directed at Vine, referencing convicted paedophile Jeffrey Epstein, was \"crude banter\", and \"bike nonce\" was a well-known phrase used by non-cyclists about cyclists, the former Bristol Rovers manager claimed. Barton maintained he had no intention of suggesting Vine was a paedophile.\nProsecutor Peter Wright KC argued, in his closing remarks to the jury of seven men and five women, Barton had crossed the line \"by some considerable margin\" beyond what society finds acceptable.\n\"Mr Barton is not the victim here. He is not the free speech crusader that he would like to paint himself to be,\" Mr Wright contended.\n\"He is not some martyr to be sacrificed on the altar of political correctness.\n\"He is just simply an undiluted, unapologetic bully. A little bully who takes pleasure sitting there with his phone in his hand and then posting these slurs.\"\nMr Wright described Ward, Aluko and Vine as the \"collateral damage of his self-promotion\".\nIn his closing remarks, Simon Csoka KC, defending, told jurors it was their responsibility to determine where the boundary between free speech and crime lies, but suggested if it was set \"far too low\" then free speech becomes \"completely worthless\".\nMr Csoka stressed that freedom of speech in society is a privilege that should not be taken lightly, but it comes with its own set of challenges.\n\"One of the prices is that people will say things that are puerile and offensive. They may say things that are hurtful or in bad taste,\" Mr Csoka argued.\n\"They may get it wrong with a wind-up. They may not realise the impact of what they say.\n\"But those are all things, are they not, that can be tolerated and the reason they can is because freedom of speech is so important.\n\"What we say is that these idiotic or, at times, even offensive, shocking tweets do not go beyond the line. They don't become grossly offensive.\"\nBarton, from Widnes, Cheshire, denies 12 charges of sending a grossly offensive electronic communication with intent to cause distress or anxiety between January and March of the previous year.",
  "word_count": 705,
  "scraped_at": "2026-02-14T13:33:11.532303"
}