{
  "article_id": "1a5cdf25a33c",
  "url": "https://www.independent.ie/opinion/letters/letter-to-the-editor-i-could-have-suffered-same-fate-as-tragic-psychiatric-patients/a1216400652.html",
  "title": "Letter to the Editor : I could have suffered same fate as tragic psychiatric patients",
  "date": "20230618T020000Z",
  "domain": "independent.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Letter to the Editor: I could have suffered same fate as tragic psychiatric patients\nSir — In last week’s Sunday Independent, Colin Murphy wrote that “in the 1950s, Ireland had the highest proportion of psychiatric beds in the world” and also that an inquiry is warranted into former psychiatric institutions similar to other residential institutions that have been investigated in Ireland. I agree.\nWhy did Ireland lock up so many of its citizens in psychiatric hospitals and in many cases leave them languishing there for years and even decades?\nAs a young man of 20 in 1985, I was twice psychiatrically hospitalised in St Patrick’s, Castlerea, which is now a prison. In total, I spent three months in the hospital.\nWhile there, I met a lot of elderly men and women who had spent most of their adult lives in the hospital, having been admitted decades earlier. It’s very likely that if I had grown up the same time as those people, then that would have been my fate, too.\nPeople were forgotten about in these institutions. In the years after my time in the hospital, these people were moved out into the community into supported accommodation. Sadly, it was too late for many of them, as they were in their twilight years.\nWe have shone a light on to so many dark aspects of our history. It’s time the forgotten patients of the psychiatric system are honoured, even in death.\nTommy Roddy, Ballybane, Co Galway\nYour brief chat may be someone’s lifeline\nSir — Julia Molony notes that, “based on a survey of 1,000 people, one in five people in Ireland say they feel lonely most or all of the time” (June 11). While loneliness is now new, there is increased awareness of it in recent years.\nThe World Health Organisation agrees that “social isolation and loneliness are increasingly being recognised as a priority public health problem and policy issue for older people”. And, as Julia Molony points out, younger people are affected, too.\nThe HSE website has good information about various kinds of loneliness that are sometimes difficult to discuss. It also points out that “everyone goes through lonely periods in life. Feeling lonely does not mean there’s something wrong with you”.\nThe HSE outlines practical steps, including realistic advice about physical activity, prioritising mental health, maintaining self-esteem, managing online time, linking with groups, and various other measures.\nMost of all, people who are not lonely can do a great deal for those who are: chatting for that little bit longer with someone who might seem isolated, pausing for a few minutes more with anyone who seems keen to talk for longer, and realising that brief contacts which might not mean a lot to you can mean the world to someone else.\nBrendan Kelly, Professor of Psychiatry, Trinity College Dublin\nMen’s Shed can be an answer to loneliness\nSir — The Sunday Independent editorial last week on loneliness and the effect it has on the mental and physical health of our population was very informative.\nOne of the country’s best organisations for helping in this regard never gets enough credit: the Men’s Shed movement.\nIreland has more than 450 branches and they are open to men of all ages. All are made welcome and activities are designed by the members themselves. A growing number of Women’s Sheds are being established.\nAs a member of a Men’s Shed, I would highly recommend the benefits to everybody, young and old, of joining one.\nBrian Lube, Co Meath\nWe need to get tough about litter problem\nSir — The amount of rubbish left on our beaches during the summer months is appalling and a national disgrace. However, our filthy beaches are not just littered during the swimming season but all year round because of teenage beach parties which involve leaving everything and anything behind, including disposable barbecue paraphernalia.\nThose who leave rubbish behind don’t give a damn and expect others to clean up after them. Why should we have a whole army of people cleaning up our villages and towns again and again in perpetuity when no effort is being made by the Government, that anyone can notice, to change the habits of those who litter.\nWe are one of the most heavily littered countries anywhere in the world, showing total disrespect for the country and the environment in which we live.\nGlass bottles and corroded cans represent very serious dangers to those on the beach, especially children who can suffer life-changing injuries.\nUnfortunately, our beaches have become rubbish tips and it is time for the Government to get very serious about a disgraceful problem which requires prosecution and awareness campaigns.\nMaurice Fitzgerald, Shanbally, Co Cork\nWake up, America, to the threat of Donald Trump\nSir — During Brexit and post-Brexit days there was much that issued from the House of Commons that vexed me and very little that enthused me. That was until the outcome of the Privileges Committee inquiry which found that Boris Johnson committed multiple contempts of parliament by “deliberately” lying about Partygate and, in its conclusions, further accused the former prime minister of launching “an attack on our democratic institutions”.\nOne sincerely hopes the relevant institutions in the US have been closely observing the UK’s awakening to the threat to democracy posed by Johnson so that in due course Donald Trump, the single greatest threat (inclusive of Vladimir Putin) to democracy in our world, will never again occupy the White House.\nMichael Gannon, St Thomas’ Square, Kilkenny\nBoris Johnson, please note the job of King is already taken\nSir — Where to now for Boris Johnson? He does realise, doesn’t he, that he cannot be King?\nPeter Declan O’Halloran, Belturbet, Co Cavan\nOur feathered friends deserve protection\nSir — It has emerged this month that the Department of Heritage may be close to removing threatened birds from the open season order.\nThe overdue move would help protect some of the country’s most vulnerable amber- and red-list birds from the shooters who find fun in blasting them out of the sky.\nIf Heritage Ministers Darragh O’Brien and Malcolm Noonan are serious about saving our feathered friends from finality, the one and only option is to permanently stop the targeting of all 15 endangered species on the shooting list.\nSwift progress must be made to protect these winged wonders of nature before they slide even closer to extinction.\nPhilip Kiernan, Irish Council Against Blood Sports, Mullingar, Co Westmeath\nPoliticians leading us down slippery slopes\nSir — I commend Eilis O’Hanlon on her excellent article last Sunday, outlining the terrifying spectre of introducing euthanasia into this country. The “slippery slope” phenomenon which has materialised in Canada and indeed much closer to home in many European countries, is impossible to avoid, even with the best will in the legislative and medical world.\nWhy do Irish politicians and lobby groups think that we in Ireland can formulate watertight laws, when other countries, with vast experience under their belts, have failed to do so?\nOur politicians, hugely influenced by lobby groups and NGOs without democratic mandates, are leading us onto one slippery slope after another.\nSinéad Tracey, Leitrim Village, Co Leitrim\nI’d totally get behind an assisted living bill\nSir — Any chance the Government would bring in an assisted living bill? Or is that too much to expect?\nAileen Hooper, Stoneybatter, Dublin 7\nDoctors’ support of cannabis overstated\nSir — The headline ‘Most Irish doctors support use of cannabis’ which accompanied the piece written by Terence Cosgrave in the Sunday Independent (June 11) greatly overstated the findings.\nThis article is based on a survey carried out by the Irish Medical Times. The survey got responses from 89 doctors in total. Information on the number of doctors in Ireland taken from the Medical Workforce Intelligence Report shows that 21,680 doctors retained their place on the Medical Council’s register in 2021.\nThis means 99.99pc of doctors registered in Ireland did not respond to the survey. The findings in that case hardly warrant reporting and are misleading.\nProfessor Mary Cannon, RCSI University of Medicine and Health Sciences\nNice weather thanks to climate change\nSir — Summer solstice, on Wednesday, is the longest day of the year or, as Met Éireann might put it, the day in the year with most daylight. We can expect, at least, 17 hours of daylight. The sun is at its highest over Ireland at this time of year, delivering the warm weather and glorious sunshine of the past few weeks.\nAlthough the sun begins to slowly journey south, the next three months is the period when nature is most active in all its glory. The trees are in full foliage, plants and shrubs are blooming, hay and silage is being saved and the coastline and landscapes are at their finest and prettiest. It’s summertime and the living is easy. It’s a time to treat ourselves to sumptuous 99s and ice-cold drinks.\nThe effects of global warming on Ireland’s summer are more apparent than ever this summer. The sea around our coast is warming much faster, already reaching 15C in late May and likely to surpass 20C by August. Jellyfish — harbingers of warm water — are already basking off the Wild Atlantic Way.\nSummer season is lasting longer and Mediterranean temperatures are becoming the norm. Although the summer solstice is upon us, the good weather should keep our green and pleasant land blooming well into September. Make the most of it!\nBilly Ryle, Tralee, Co Kerry\nThis Government’s priorities are skewed\nSir — Instead of trying to fix the problems with our asylum process, we have a Justice Minister who seems hell-bent on a process to eliminate free speech.\nThis country has massive problems — homeless people; young people emigrating; an energy crisis; lack of doctors, nurses, gardaí, teachers — but this Government’s priorities seem elsewhere.\nFor the first time in 30 years I will not vote for any party and will vote Independent.\nPeter Woods, Drogheda, Co Louth\nBroadband firms are getting away with it\nSir — The European Electronic Communications Code (EEEC) has now been transposed into Irish law. It is an important piece of legislation. The regulations are designed to provide protection and means of redress for inferior services, including broadband and TV streaming. Having spent 18 years with one of the biggest service providers and over 30 years in the industry in a private capacity, I still observe the dreadful abuse of basic standards that unsuspecting customers are subjected to in both the commercial and domestic sectors every day.\nIt can begin with clickbait advertising where you are invited to enter your Eircode and you are rewarded with a message that, “Congratulations” — you are in an area where fibre broadband with ultra high speed is available. In most housing estates fibre may be available to the manhole on the footpath or a distribution case.\nThere is common practice, once you sign for a new provider, for them to simply go through an optics procedure in your home and leave you connected to the existing copper cable.\nService providers are walking in and out of private residences without as much as showing a customer a qualified speed test of their new connection. This abuse extends to thousands of customers who have “switched” for better service but end up with the exact same circuit with the exact same speeds. The fibre they now think they have is in a manhole out on the road because in the 1970s armoured cable was used from manhole to home without the use of ducting.\nAfter you buy streaming TV packages with broadband included you may discover that your new package is not as optimal as you had anticipated. Then you are told you need an added subscription to see programmes in HD.\nAfter you pay for all your TV upgrades, you discover your new €2,000 UHD TV is useless because you require a minimum broadband speed of 30 megabits per second (Mb/s) to stream a UHD film but you’ve only got 20Mb/s and little Johnny is on YouTube upstairs. That’s when you discover you are still on a copper cable with 20Mb/s and the whole process of trying to find a better service provider starts all over again.\nMedia and communication companies must declare what extra services and upgrades are NOT included, clear definition of broadband speeds and technical specifications must match installations. Companies who advertise services with slogans like €30 a month for the first six months and €60 a month thereafter without disclosing that the €60 comes with a Vat add-on of 23pc must be held to account.\nIf, just for once, we could avoid the constant Eamon Ryan bashing, enforce proper advertising standards and issue adequate fines and redress for customers, then the legislation will work. Otherwise we will all get what we deserve.\nTom Fennelly, Firhouse, Dublin 24\nTeams of 13 players, six points for a goal\nSir — There are more problems and inequalities in our Gaelic games than the much-discussed “hand-pass possession” and “blanket-defence” systems.\nIf memory serves me correctly, as far back as 1974 the then director-general of the GAA, Seán Ó Síocháin, expressed his concern that the newly established Thomond College of Physical Education, Limerick, would produce coaches who would have a detrimental effect on the games by indulging in too much tactics, stunting traditional, natural flair.\nThe fitness of modern inter-county players suggests to me that the teams should be reduced to 13-a-side and a maximum of three substitutes should be allowed. This would open up the playing space and help those with smaller panels to select from.\nIncrease the value of a goal to equal six points. Currently, it is too easy to win from long range with points. Bring back the closed fist hand pass. While we’re at it, let’s look at the “square ball”, handling the ball on the ground and the steps rule.\nWe may be proud of our unique product, but we have some distance to go before trying to sell it to the International Olympic Council.\nSP O’Dwyer, Raheny, Dublin 5\nFootball has turned into a big borefest\nSir — Thirty warriors took the field, from Limerick and from Clare,\nAnd thrilled Munster thousands, with bravery and flair.\nFootball used to be like that, back in the good old days,\nWhen balls were belted up the field, and backs and forwards flayed.\nThe 50-50 contest was the essence of the game,\nBut now it’s all possession, not to give the ball away.\nSomething must be done to make football great again,\nFor as opposed to hurling, it is one boring pain.\nNicky Barry, Killarney, Co Kerry\nConsultant shortage on southside only\nSir — The HSE is launching a recruitment campaign to attract consultants back to Ireland. I never realised that there was a dire shortage of consultants on the southside of Dublin. To quote the ad: “You found yourself in North Sydney, now find your roots in south Dublin.”\nSurely such a crisis requires an urgent parliamentary question.\nDr Aidan Hampson, Artane, Dublin 5",
  "word_count": 2519,
  "scraped_at": "2026-02-14T12:00:19.905047"
}