{
  "article_id": "1a82f496f73e",
  "url": "https://www.mirror.co.uk/news/uk-news/blistering-heatwave-scorching-politics-red-36488529",
  "title": "A blistering heatwave , scorching politics and the red hot Sex Pistols , welcome to 1976 ! ",
  "date": "20260103T184500Z",
  "domain": "mirror.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "EXCLUSIVE: A blistering heatwave, scorching politics and the red hot Sex Pistols, welcome to 1976!\nScorching sunshine, the Sex Pistols swearing live on teatime telly and women striking for equal pay - 1976 was a year of scandal and shocks but it also came with a great soundtrack\nThe summer of 1976 was the driest in more than 350 years and 50 years later, one then teenager turned historian is reminding us of the politics and music that exploded on to the culture as a nation sweltered.\nChristopher Sandford, then a 19-yearold Cambridge University student, recalls in his book, 1976: The Year That Scorched, when temperatures in July hit 35.9C and thermometers registered 30C for weeks - with some areas going 45 days without rain.\nNow 69, Brit Christopher, who lives in the US, remembers it as a year of phenomenal contrasts, saying: \"Bombs were going off regularly because of the IRA - and yet strangely enough, right in the middle of this turbulence, there was an incredible heatwave.\n\"There were sad times, but also amusing ones. Times were hard - there was an economic crisis and workers were striking. This was set against a soundtrack of The Sex Pistols and Abba that brought moments of light.\"\nREAD MORE: 'David Bowie wanted to make the album of his life before he died two days later'Such was the spiralling comedy and tragedy of that year, when ex-professional footballer turned MP Denis Howell was appointed drought minister, he showed reporters how he was conserving water by sharing baths with his wife, Brenda.\nBut the year had begun with a storm before the heatwave arrived. Mirror readers would have opened their January papers to news of winds of 110mph sweeping over East Anglia, flooding of coastal streets and rail and air traffic coming to a standstill. The Old Vic Theatre in London was damaged when scaffolding crashed into the foyer, killing 23 people, and the roof of a stand at Stoke City football ground blew off.\nJust a couple of days before the heatwave officially began that June, Christopher remembers the England vs West Indies cricket match being called off because of rain. \"I was a big cricket fan,\" he tells the Mirror. \"I remember going to Lords on June 19 and it started to drizzle before play. It wasn't torrential rain, but it didn't stop and eventually we were sent home without a penny in compensation.\n\"It was ironic, as a couple of days later marked the start of the UK's longest period of sustained dry weather for more than 350 years, and its driest summer for more than 200. Over the next 10 weeks papers like the Daily Mirror were full of pictures of bikini-clad sunbathers cooling off in the nearest stretch of water.\" These images were accompanied by photos of businessmen in bowler hats rolling up their trousers and paddling in the fountains at Trafalgar Square.\n\"It was so hot I couldn't sleep at night,\" Christopher recalls. \"I remember walking into Victoria Station one very hot morning and a huge swarm of ladybugs were circling around \"Ladybirds struggle to find vegetation when it is that hot - but seeing them swarming around was rather eerie, almost like a disaster film.\" It was also an unexpected year in the world of sport. In May, second division Southampton defied 50-1 odds to beat manchester-united-fc>Manchester United in the FA Cup Final at Wembley.\nThe British Grand Prix at Brands Hatch was won by the Austrian Niki Lauda, after the home favourite James Hunt crossed the line first, only to be disqualified on a technicality. And in golf, the Open Championship will be remembered for the impact of crane operator Maurice Flitcroft, a newcomer at 46, who took part in the Open's qualifying competition.\nMaurice got lost driving to the Royal Birkdale course, and went straight to the bar on arrival. His subsequent score of 121 for the round - putting him 49 over par - was 38 shots more than taken by the next worst player. Meanwhile, in politics, Prime Minister Harold Wilson resigned, saying he wanted to make way for a younger man - despite being succeeded by James Callaghan, who at 63 was four years his senior. During the ensuing days, Wilson claimed he had been forced from office. Rumours circulated that rogue elements of the UK Author security forces had wanted him out because of his left-wing policies.\nAnd the pound plummeted against the dollar, leading to speculation there might be a second British Civil War. \"I was struggling because I was a student on a grant, but there were a lot worse off than me,\" Christopher recalls. \"Every day on the front pages there would be the latest exchange rate and if the pound went down a point or two it was reported as a huge problem.\"\n\"It led to Chancellor Denis Healey turning his car around on his way to a conference in Hong Kong in September, because the pound had lost three points against the dollar and was continuing to fall.\"\nBut women at the Trico factory in Brentford, West London, won a massive victory for equality when they secured the same basic pay as male counterparts, after 21 weeks of industrial action. Christopher remembers other moments of celebration - including the release of Abba's album Arrival and chart-topping singles Dancing Queen and Money, Money, Money.\n\"I remember almost every song on Top of the Pops either had the word dance and/or love in it,\" he adds. \"Although I wasn't a massive Abba fan, Dancing Queen was infectious with a chorus that was hard to resist.\" At the opposite end of the spectrum came punk rockers The Sex Pistols. They were just coming on to the scene, so you had the contrast between the happy, smiley crowd who liked Abba, the Bee Gees and Barry Manilow and then them,\" says Christopher.\nAnd then came Bill Grundy's interview one teatime in early December on BBC TV with The Sex Pistols. When the band's guitarist Steve Jones said the F-word on live TV, it became a national scandal, plastered across the front pages. And the Mirror had undoubtedly the most memorable coverage. Our headline, The Filth and the Fury, became the title of Julien Temple's 2000 documentary film about the band.\n\"I thought the headlines were hilarious. I was 19 and was enjoying the whole anti-establishment side of it,\" adds Christopher. \"It was a great way to end what was a pretty turbulent and dark year with drama, fun and controversy. I suppose the best way to describe 1976 was tragicomic - a year like no other where moments of darkness were also filled with comedy.\"\n1976: The Year That Scorched, by Christopher Sandford (The History Press, £22.99), is out now.",
  "word_count": 1132,
  "scraped_at": "2026-02-14T14:22:32.483864"
}