{
  "article_id": "1a8bc5b285a8",
  "url": "https://asianews.network/the-big-question-who-will-be-singapores-next-million-dollar-athlete/",
  "title": "The Big Question : Who will be Singapore next million - dollar athlete ? - Asia News NetworkAsia News Network",
  "date": "20251030T041500Z",
  "domain": "asianews.network",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "October 30, 2025\nSINGAPORE – In less than two years as a professional golfer, Singapore’s Shannon Tan has wasted no time making her mark on the Ladies European Tour (LET) and collecting milestones along the way.\nHer latest came on Oct 26, when the three-time LET winner surpassed $1 million in career earnings, after finishing tied-44th at the Wistron Ladies Open in Taiwan.\nEven her rapid progress has come as a surprise to the 21-year-old, who said: “When I first turned pro, my goal was just to learn and get better every week.\n“I definitely didn’t expect things to happen this quickly. My focus was always on improving and adapting to life on tour.\n“Looking back now, I’m really proud of how much I’ve grown – both on and off the course.”\nIn crossing the million-dollar mark, the world No. 97 golfer sits among a select group of Singaporean athletes to have hit the financial milestone, including football legend Fandi Ahmad, veteran golfer Mardan Mamat and Olympic champion swimmer Joseph Schooling.\nWith Tan the latest sportsperson to meet the mark, who will Singapore’s next million-dollar athlete be? And what is the significance of being a millionaire in an increasingly lucrative, big-money global sports world?\nWhy $1m still matters in Singapore\nLike Tan, former star striker Fandi Ahmad did not think much about joining this exclusive club before he became the country’s first sports millionaire in 1992.\nFor Fandi, the driving force was his passion for football and his desire to be a role model.\nThe 63-year-old told The Straits Times: “The salary I earned was a recognition of my ability and I took it as a responsibility to show that it is possible to make a living out of playing sports.\n“At that time, up until the mid-1990s, Singapore sports were mostly amateur level and athletes played more for passion and enjoyment.\n“As the professional era came for football, we had to push harder and do extra work to become better and remain at the peak for as long as we could.”\nSince Fandi’s landmark achievement, a few other Singaporean footballers have also accomplished the feat, as the sport has become more professionalised regionally.\nLions captain Hariss Harun, for instance, was on a reported monthly salary of US$20,000 (S$25,900) to US$30,000 at Malaysia Super League giants Johor Darul Takzim from 2014 to 2021.\nSince Fandi’s days as a footballer, the landscape has changed significantly, with some sports experiencing global exponential growth.\nA study by Morgan Stanley Research showed that the global sports industry’s sales totalled US$521 billion in 2024, growing at an average rate of eight per cent annually.\nSome international athletes have reached eye-watering heights in their earnings.\nFour-time National Basketball Association All-Star Devin Booker signed a two-year extension in July with the Phoenix Suns worth US$145 million.\nFive-time Ballon d’Or winner Cristiano Ronaldo made headlines that same month, when it was reported that his new two-year contract with Saudi club Al Nassr is worth nearly £492 million (S$845 million).\nWhile women’s sports usually do not draw as huge a payout – on the WTA Tour the highest earner for 2025, world No. 1 Aryna Sabalenka, has earned US$12,313,519, while the LPGA Tour’s Minjee Lee tops the 2025 money list at US$3,815,672.\nThe world’s highest-paid female footballer, Barcelona’s Aitana Bonmati, reportedly earns between €750,000 (S$1.1 million) and €1 million annually.\nAcknowledging that $1 million remains a significant sum, James Walton, sports business group leader of Deloitte Asia Pacific and South-east Asia, pointed out that inflation and the increasing cost of sport – from equipment to travel, coaching and physiotherapy – has changed the equation.\nHe said: “One million is a fantastic milestone but let’s be clear – the cost of playing the sport, the cost of reaching that level is also increasing accordingly as well.”\nDoes being an athlete pay in Singapore?\nWhile only a handful of Singaporean athletes have reached this milestone, Fandi believes sport has become more lucrative over the years, and he is pleased to see local athletes like Tan succeeding on the international stage.\nHe said: “Professional sport has definitely gotten more lucrative over the years and the landscape has changed in many sports with increased sponsorship and competitions.\n“As some of us have proved, sport pays if you can back up your potential and ability with discipline, determination and dedication.”\nWalton also believes there are more opportunities for Singaporean athletes to be financially stable today, thanks to support schemes like the Sport Excellence scholarship (spexScholarship).\nIt was launched by the Government in 2013 to offer support, such as monthly stipends, to athletes deemed to have the potential to excel on the Asian and global stage.\nMore recently, Sport Singapore has expanded its offerings in its high-performance sports system – including the introduction of the Sports Excellence Potential (spexPotential) programme in 2023 to strengthen the backing for youth athletes who show promise of winning gold medals at the SEA Games level.\nAnother key initiative is the Major Games Award Programme (MAP), which was set up by the Singapore National Olympic Council in 1993 to provide cash incentives for medals attained at the SEA, Asian, Commonwealth and Olympic Games.\nUnder the MAP, swimmer Joseph Schooling earned $1 million for his historic gold at the 2016 Rio Olympics, while table tennis players Li Jiawei and Feng Tianwei have also benefited from the programme.\nA 2012 report by The New Paper showed that Li, who won a team silver and team bronze at the 2008 and 2012 Olympics respectively, earned an estimated $1.27 million from MAP.\nIn 2016, it was reported that Feng, with an Olympic team silver (2008) and two bronzes (women’s singles and team in 2012), accumulated almost $3 million in prize money and winnings, including MAP money, during her career.\nFor para-athletes, a similar scheme exists, with the Athletes Achievement Awards (AAA) launched by the Singapore National Paralympic Council in 2002.\nWhile there is still a disparity in the rewards between able-bodied and para-athletes, the gap has narrowed over time – particularly after the achievements of seven-gold Paralympian Yip Pin Xiu, who has earned over $2 million from the AAA, sparked revisions to the amount.\nIn 2016, it was $200,000 for a gold won at the Paralympics, before it was doubled to $400,000 for the Tokyo Games in 2021, and then $500,000 at the 2024 Paris Games.\nThe rise of social media has also created more opportunities for athletes, providing a platform that has made it easier for them to work with brands to reach their target audience.\nWalton said: “It has been an absolute game-changer for athletes who now can tell their own story 24/7, in their own terms, on their own channels, directly to the target audiences that they and their sponsors want to reach… they’re no longer at the mercy of popularity and trends.”\nHe also noted that more companies are now providing opportunities for athletes to work and train part-time or full-time.\nHe added: “It’s still a challenge – Singapore is an expensive place to live in, it’s an expensive place to train but there are definitely more avenues now with the support of Sport Singapore and the Government and private sector than there were 10 years ago.”\nSport has become more competitive\nDespite more opportunities for today’s athletes, five-time Asian Tour winner Mardan Mamat, who became Singapore’s first $3 million sportsman in 2016, also believes that competition has become fiercer.\n“There are a lot of opportunities but the standard of golf is getting better and better throughout the years,” said the 57-year-old, who was Singapore’s first golfer to win on the Asian and European Tours.\n“A good example is, the golf courses we played in Indonesia last time, even one-under par you can make the cut, but now it’s three-under to make the cut.\n“A few golf tournaments we played in Thailand like Black Mountain Golf Club, it used to be three, four under to make the cut, now it’s six under to make the cut.\n“It’s not easy but you need to be patient and you need to work things out one thing at a time.\n“But, if you’re patient and you’re hungry to win, you can do it.”\nHow lucrative a sport is also depends on various factors, including its global appeal.\nBadminton, with over 300 million participants and 700 million fans worldwide, and football – which has over five billion fans globally – present greater opportunities.\nHowever, sponsorship investment can also depend less on participation numbers and more on audience demographic, noted Walton.\nFor instance, golf and tennis, which see their top-tier tournaments offering multi-million prize purses, attract brands targeting high net worth audiences, despite having lower participation rates.\nAn R&A Global Golf Participation report showed there are 108 million golfers around the world, excluding the United States and Mexico.\nThe International Tennis Federation reported over 100 million players in 2024.\nWalton said: “The perfect formula for being financially well-to-do in sports is that you are successful.\n“You have the right image, you have the right story that you are playing in a market where you are good market size, where there are sponsors who believe in that product, in the sport and you, and with a government and sporting ecosystem that is promoting and pushing that sport.\n“All of that is just topped by you being successful.”\nWho is Singapore’s next sports millionaire?\nUnder the national sports blueprint Vision 2030, the Government has worked to make Singapore more active and engaged in sport, including bringing in high-profile events such as the World Aquatics Championships from July to August, in its bid to raise interest and participation.\nBut Walton stressed that while the Government has made significant strides, the private sector must also play a larger role.\nSome, like badminton’s world No. 9 Loh Kean Yew and cue sports’ Aloysius Yapp, who won three consecutive Matchroom major titles in 2025, are not far behind Tan.\nLoh has earned about $930,000, including $495,000 in donations after his win at the 2021 world championships, while Yapp’s career earnings stand at $763,684.\nThese figures exclude sponsorship deals, which are typically not disclosed publicly.\nHowever, sport is still not a professional pursuit for most Singaporeans. Many juggle their game with full-time jobs or studies, particularly in teams sports such as netball, floorball and water polo, despite their regional success.\nWalton said: “The Government has done a lot but, with so many athletes out there, there’s only so much they can do. The absolute best thing would be for private companies to come in, pick an athlete, pick a sport.\n“It doesn’t have to be a champion – you can get good mileage of supporting a sport/athlete that no one else is supporting and help them tell their story, help lift them up and the impact on the athlete will be immeasurable.”\nSingapore Sports’ million-dollar club\nFandi Ahmad (football)\nHariss Harun (football)\nBaihakki Khaizan (football)\nShahril Ishak (football)\nMardan Mamat (golf)\nShannon Tan (golf)\nYip Pin Xiu (para-swimming)\nJoseph Schooling (swimming)\nLi Jiawei (table tennis)\nFeng Tianwei (table tennis)",
  "word_count": 1847,
  "scraped_at": "2026-02-14T12:44:18.175086"
}