{
  "article_id": "1ab5be6ffe2e",
  "url": "https://www.oregonlive.com/ducks/2024/08/oregon-ducks-mailbag-broadcast-coverage-backup-quarterback-battle-the-kicking-game.html",
  "title": "Oregon Ducks mailbag : Broadcast coverage , backup quarterback battle , the kicking game",
  "date": "20240820T143000Z",
  "domain": "oregonlive.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Welcome to the first edition of the weekly Oregon Ducks mailbag, where readers ask questions about all things Ducks and The Oregonian/OregonLive’s Ryan Clarke provides some answers.\nSubmit questions for future Ducks mailbags to RClarke@oregonian.com or on Twitter/X: @RyanTClarke. Responses will be posted on Tuesdays throughout the season.\nHello, Ryan. Two piece McNugget for you: 1. What is the most interesting or noteworthy story about any player(s) this year we may not know? 2. What do you think is good about ducks? -Trent G.\nHowdy, Trent. There are plenty of interesting, personal stories to be found on this Ducks roster, comprised of players from all over the country who are either new to the program or longtime Autzen residents.\nSome that have piqued my interest so far this fall: Kobe Savage, Jestin Jacobs and Ajani Cornelius. Much more to come from me on the profile front this season. Amid all the discussion about position battles, power rankings, conference standings and playoff seeding, I am most interested in who these athletes are as people.\nTo your second question, I think it is good that ducks are versatile in their ability to thrive in the air, on land, and in water. There’s a football metaphor in there somewhere that I’m sure Dan Lanning has used at some point during a team meeting.\nFor all the flaws in distribution of the Pac-12 Network, its regional approach to coverage was excellent. Viewers could see all major sports not broadcast by national networks and most minor sports, including softball and volleyball. Will that depth of coverage change with Big 10 Network? -Drex H.\nIt seems, at least in the early going, that the Big Ten Network is making an effort to produce plenty of content out West as the four new teams enter the conference. Not only to introduce folks from the Midwest to these schools and their histories, but to give fans well-produced looks at football media days/training camps along with coverage of smaller sports as their seasons get underway.\nOregon’s first football game vs. Idaho will be on Big Ten Network, and the UO women’s soccer team’s 2-0 start was broadcast on the B1G+ app.\nHow is communication on the defensive side of the ball going, both with starters, but when the younger players are in the scrimmage as well? -Jim\nWe in the media don’t get to see much of Oregon practices or scrimmages by way of substance, and the coaches’ lips are usually pretty sealed when it comes to sharing specific details. However, based on what we have heard, this experienced defensive unit has communicated well throughout fall camp. As the old coaches’ cliché goes, still plenty of work to do.\nObviously, adding veteran players in the portal like Jabbar Muhammad and Derrick Harmon helps with that effort, but we’ve heard about young guys standing out as well. True freshman defensive back Dakoda Fields is a name that has popped up. Longtime Ducks like Jeffrey Bassa continue to set the tone for that group, though.\nMy question is about recruiting. Can you explain what it means when you report that a recruit has an offer of a scholarship? Are they in writing? Can they only be accepted under certain conditions? It appears to me that in many cases schools are unwilling or not ready to accept a commitment. -Mike E.\nScholarship offers are typically verbal, and are by no means a guarantee of a roster spot for a prospect. They are an indication of a school’s heightened interest in a particular athlete, and whether they receive a full scholarship offer in writing or multiple years guaranteed depends on both the sport and the athlete. And a verbal commitment does not guarantee a player has or will receive a written offer. Or even end up at that school. Recruits flip all the time.\nWhat is always in writing is a National Letter of Intent (NLI). That is a binding contract that players typically sign on various national signing days. Schools dole out far more verbal “offers” than they actually end up providing by way of tangible scholarship offers, and even less players end up signing on the dotted line. This mass list of players you see get “offers” is an approach used by schools to cast a wide net, and create contingencies in the ever-evolving world of recruiting. Never has this been more chaotic and uncertain than in modern college football, particularly due to a different acronym with the same letters: NIL.\nAt this moment who is #2 QB?-Jon H.\nDante Moore, a former five-star Oregon commit who flipped to UCLA and started for the Bruins last season as a freshman. He came to Eugene via the transfer portal this offseason with a presumed understanding that he’d be Dillon Gabriel’s backup, and you’ll more than likely see him in the second half vs. Idaho on Aug. 31 if he’s healthy. And perhaps in future games if the Ducks are up big, or if offensive coordinator Will Stein is cooking up plays to utilize Moore’s evident mobility. And in the worst-case scenario: if Gabriel gets hurt.\nEither way, Moore could end up being Oregon’s starter in the 2025 season once Gabriel moves on to the NFL. Other quarterbacks on the 2024 roster behind Gabriel and Moore are redshirt freshmen Austin Novosad and Brock Thomas, and true freshman Luke Moga.\nHow does the University of Oregon pick the person to represent UO as the Duck mascot? -Bradley W.\nThe Duck is an iconic university mascot, and has been making the rounds throughout the Midwest as the season approaches and Oregon enters the Big Ten.\nWe never learn the names of the students inside the mascot outfit, and that’s by design, but the school shared some of their stories in a narrative piece.\nWhile it’s unclear whether the website or tryout program is still updated/active, areyoutheduck.com has information for UO students interested in becoming the Duck. It does require some level of physical fitness, it seems, with all that running around and push-ups after scores. Not to mention attempting to climb the gates outside rival football stadiums.\nHi Ryan. Maybe you’ve done it recently and I missed it, but would love to see an in depth article on the current Ducks kicking (field goal and punting) personnel. Who’s new and who’s back. I know Cam Lewis is gone and would be interested in who’s winning the kicking competition. -Kevin K.\nI had a chance to interview new Ducks kicker Atticus Sappington — a transfer from Oregon State — during spring ball. That was a fun story. I’d expect him to be taking field goals this year for the Ducks.\nAndrew Boyle is competing with Sappington for kickoff duties and could end up taking place kicks as well if he wins out. And Ross James will be back as Oregon’s punter, a reliable presence at a key position for the Ducks.\nOur friend Tyson Alger of The I-5 Corridor had a great story on Oregon long snapper Luke Basso from media day. Specialists are people, too.\nMore Oregon Sports stories\n-- Ryan Clarke covers the Oregon Ducks and Big Ten Conference for The Oregonian and co-hosts the Ducks Confidential podcast. He can be reached at rclarke@oregonian.com or @RyanTClarke.\nOur journalism needs your support. Subscribe today to OregonLive.com.",
  "word_count": 1221,
  "scraped_at": "2026-02-14T13:15:49.757580"
}