{
  "article_id": "1abf2b4b06c1",
  "url": "https://www.theadvocate.com.au/story/8927336/wynyard-burnie-and-circular-head-ahead-of-2025-nwfl-womens-season/?cs=2605",
  "title": "Wynyard , Burnie and Circular Head ahead of 2025 NWFL Women season | The Advocate",
  "date": "20250403T213000Z",
  "domain": "theadvocate.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The first bounce of the NWFL Women's season is just days away, and anticipation is building ahead of what is shaping up to be an exciting season.\nSubscribe now for unlimited access.\nor signup to continue reading\nIn part two of our season preview, we've caught up with three of the seven coaches to find out how their team is tracking, who the players to watch are, and what to expect in 2025.\nThe NWFL Women's competition will begin with a gala day on Saturday, April 5, at Ulverstone.\nWYNYARD\nCoach: Keegan Weller\nCaptain: Olivia Smith\n2024 finish: Runners-up (12 wins and two losses)\nIns: Taya Radford (Circular Head), Barli Tuxworth (Circular Head), Abbie Weller (Burnie)\nOuts: Amy Bissett (QAFL), Ellie Poke (SANFL), Tayla and Elise Hoiberg-Cox (Burnie), Annalise Hursey (Circular Head)\nPlayers to watch:\n1. Ella Moodie: \"She's a first-year under 18 Devils' player this year, and she's only going to get better and better.\"\n2. Olivia Pringle: \"She's really setting the track on fire. Her attack on the ball is second to none. She's put in a lot of effort over the pre-season.\"\nCoach's comments:\n\"I want us to enjoy the little things whether it's each other's company before the game or whatever it is,\" Weller said.\n\"And when things aren't going our way, just to embrace the grind of things. It's easy when things are going well, it's just when things get tough who steps up.\n\"That's what I want us to focus on this year.\"\nBURNIE\nCoach: Clint Schulze\nCaptain: Kirby Brakey and Brittney French\n2024 finish: fourth (six wins and eight losses)\nIns: Tayla and Elise Hoiberg-Cox (Wynyard), Ciara Voss (mainland), Alysha McGrail (Penguin)\nOuts: Asha Porteous (Circular Head), Rachel Glover, Georgia Eade\nPlayers to watch:\n1. Piper Wickham: \"She's still eligible for under 17s but will play senior football this year. She looks like she's got all the tools to be a really good footballer.\"\n2. Brianna Keep: \"I think she will be key for us this year with the style we want to play football.\"\n3. Kaylah Keogh: \"She just loves football and trains hard. If you're the opposition's best player, you're going to see a lot of Kayla running with you throughout the year.\"\nCoach's comments:\n\"We want to be more competitive and create an identity that's ours, and play a style of football that we want to play,\" Schulze said.\n\"I think if we concentrate on that, the wins will come. We can't worry about who we're playing week in, week out, but we've just been trying to knuckle down on what we stand for.\"\nCIRCULAR HEAD\nCoach: Scott Williams\nCaptains: Leahna Mclaren and Zara Saward\n2024 finish: Last (Two wins and 12 losses)\nIns: Caroline Klink (Victoria), Sophie Marriott (Queensland), Annalise and Paige Hursey (Wynyard), Asha Porteous (Burnie), Abbey Edwards (Wynyard)\nOuts: Alana Jago, Kristy Douglas\nPlayers to watch:\n1. Annalise and Paige Hursey: \"I think the Hursey girls will be fantastic. They've had a great pre-season.\"\n2. Sophie Marriott: \"She's never played before but has been very impressive over the pre-season\".\nCoach's comments:\n\"They've all been very impressive [on the training track]. We've been training since early November and only had the three weeks off over Christmas,\" Williams said.\n\"We strategically haven't played any practice matches because we've been working on our own stuff.\n\"As long as we're competitive and we win a few games along the way, I'll be happy with that.\n\"If we bridge the gap between the other six teams, it makes the whole competition better.\"",
  "word_count": 590,
  "scraped_at": "2026-02-14T13:42:34.213890"
}