{
  "article_id": "1ac4650ed1f4",
  "url": "https://www.arsenal.com/news/preview-arsenal-women-v-brighton-hove-albion",
  "title": "Preview : Arsenal Women v Brighton & Hove Albion",
  "date": "20251011T101500Z",
  "domain": "arsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Barclays Women’s Super League football is back at Emirates Stadium as we take on Brighton & Hove Albion at 2.30pm on Sunday.\nWe’re looking to get back to winnings ways following recent defeats to Lyon and Manchester City, as well as draws with Aston Villa and Manchester United.\nThe WSL table has us fifth going into this weekend, but three points could take us up to fourth depending on United’s match with Everton.\nSEAGULLS SETTLING IN\nBrighton have also had a mixed start to the season, drawing 0-0 at home to Aston Villa on the opening day before losing 2-1 at City.\nThat was followed by an impressive 4-1 win at home to West Ham United though, in which our loanee Rosa Kafaji was on the scoresheet.\nThe Subway Women’s League Cup brought about a 2-0 win away to Portsmouth, and the Seagulls were back in WSL action with a 1-0 win over Everton, with loanee Michelle Agyemang getting her first goal of the season.\nThen came a 1-0 loss at Tottenham Hotspur prior to Wednesday’s 2-1 defeat at West Ham United in the League Cup.\nTo confirm, Rosa and Michelle are both ineligible to play against us on Sunday.\nWHAT THE MANAGERS SAY\nSlegers: “I think they do a lot of interesting things. They're unpredictable in the way they set up. Both in and out of possession, they change from game to game, and they seem to have a really interesting philosophy. I think they play good football. It's going to be a good opposition, so I have a lot of respect for what Dario is doing with Brighton.\n\"We're prepared for different scenarios in this game because they can come out and do different things. Just like last year, their set-ups were different in the home and away game, so we'll see what they will bring on Sunday. So we'll have to prepare for different scenarios.\" - read every word of Renée’s pre-Brighton press conference.\nVidosic: ““We haven’t really had the opportunity to train too much this week because of the games coming thick and fast. But every game is an opportunity to learn.\n“We know that Arsenal possess a lot of strengths, especially when they play at the Emirates. They’re on a little bit of a run of results that I don’t think have been fair. We know it’s going to be tough.”\nFACTS AND STATS\nWe have won each of our first 13 WSL meetings with Brighton by an aggregate score of 49-2.\nBrighton have lost each of their seven away games against us in the WSL, conceding 26 goals; among sides to visit us as often in the competition, only Reading (3.9) average more goals conceded per game than the Seagulls (3.7).\nBrighton have lost 10 of their 13 away games in the WSL since the beginning of last season (W3), with no team suffering more top-flight defeats on their travels in that period.\nSince she made her WSL debut for us back in February, only two players (minimum 500 minutes) have a better minutes per goal or assist rate in the competition than Chloe Kelly (91 – 4 goals, 3 assists in 637 minutes).\nIn 2025, Mariona Caldentey has been directly involved in more goals in the WSL than any other player (15 – 9 goals, 6 assists) – in that period she has scored or assisted in 12 of 17 league appearances for us.\nMATCH OFFICIALS\nKirsty Dowle has been appointed to take charge of Sunday’s game. She saw over our 0-0 draw away to Manchester United this season, and has recently operated in matches across the National League, EFL Trophy and League Two.\nReferee: Kirsty Dowle\nAssistants: Phoebe Horner and Lauren Whiteman\nFourth official: Phoebe Cross\nBRIGHTON’S LAST VISIT\nBrighton will be hoping it’s not a similar outcome to our previous encounter with them at Emirates Stadium, when goals from Beth Mead, Caitlin Foord, Frida Maanum, Lina Hurtig and Alessia Russo saw us knock five past them without reply.\nIn fact, that was our second 5-0 win at home to them in a row, as we’d also beaten them by the same scoreline at the end of the 2023/24 campaign courtesy of strikes from Maanum, Russo, Vivianne Miedema and a Jorelyn Carabali own goal.\nHOW TO WATCH\nTickets are now on general sale for those wishing to attend this fixture and cheer us on.\nOtherwise, it’s being shown live on BBC Two, BBC iPlayer and the BBC Sport website in the UK. Find out which other broadcasters are showing the action live around the world.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 790,
  "scraped_at": "2026-02-14T12:44:21.131678"
}