{
  "article_id": "1ae5cb1a8d0e",
  "url": "https://www.thenationalnews.com/news/us/2025/05/29/nvidia-gives-strong-forecast-despite-chip-export-controls/",
  "title": "Nvidia gives strong forecast despite chip export controls",
  "date": "20250528T223000Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Nvidia on Wednesday forecast strong growth for the second quarter of the 2026 fiscal year, despite a loss in revenue due to export controls on its H20 AI chips to China.\nNvidia expects revenue of $45 billion in the second quarter, plus or minus 2 per cent. That comes after taking an $8 billion hit due to export control limits related to the H20 chip.\nNvidia beat first-quarter estimates, reporting revenue of $44.1 billion, up 69 per cent from a year ago. Analysts polled by Factset expected the company to record first-quarter revenue of $43 billion.\nNvidia said it made a profit of $18.8 billion. Data centre revenue came in at $39.1 billion, compared to $22.5 billion for the same time last year.\nThe earnings came weeks after Nvidia announced major partnerships with the UAE and Saudi Arabia during US President Donald Trump's visit to the Gulf.\nNvidia chief executive Jensen Huang was also present at the unveiling of the UAE-US AI Campus in Abu Dhabi during Mr Trump's visit. NVidia has also joined OpenAI, Oracle and Abu Dhabi's G42 to build Stargate UAE, which will operate in the campus.\nAnd before Mr Trump's visit to Riyadh, Nvidia joined Amazon Web Services and Advanced Micro Devices to collaborate with Humain, the Saudi Public Investment Fund's new AI company.\nNvidia has a similar agreement in Taiwan.\n\"We have a line of sight to projects requiring tens of gigawatts of Nvidia AI infrastructure in the not-too-distant future,\" Nvidia chief financial officer Colette Kress said during a conference call.\nMr Huang said: “Countries around the world are recognising AI as essential infrastructure – just like electricity and the internet – and Nvidia stands at the centre of this profound transformation.\"\nMr Huang also said global demand remains \"incredibly strong\". Meanwhile, the Blackwell NVL72 AI supercomputer, which he called a \"thinking machine designed for reasoning\", is in full-scale production.\nNvidia shares rose more than 5 per cent to $140.09 during after-hours trading. Its stock was virtually flat when trading closed on Wednesday, 0.51 per cent lower at $134.81 a share.\nNvidia was among a number of tech giants that suffered large drops in share price after Mr Trump first announced his larger-than-expected tariff policy last month. But like other companies trading on Wall Street, it has since recovered.\nChina drove much of the attention on Wednesday after the Trump administration had placed stricter export controls on Nvidia's H20 AI chip in April.\nNvidia said it incurred a $4.5 billion charge in the first quarter of the 2026 fiscal year because of those controls on China. It had previously warned the latest export rules would cause it to take a hit of $5.5 billion in inventory write-off.\nDuring the conference call, Mr Huang said Nvidia cannot reduce its Hopper chip further to comply with the latest chip controls.\n\"As a result, we are taking a multibillion-dollar write-off on inventory that cannot be sold or repurposed,\" Mr Huang said.\nCommenting on the latest controls, he said shielding Chinese companies from American competition \"only strengthens them abroad and weakens America's position\".\n“Nvidia was banking that the Trump administration was not going to block their exports of these H20 AI chips,” said Gregory Allen, director of the Wadhwani AI Centre at the Centre for Strategic and International Studies\n“The Trump administration has gotten tougher on China even as it has gotten lighter on restrictions placed on other places around the world, like the UAE, like Saudi Arabia,” Mr Allen told CNBC earlier on Wednesday.",
  "word_count": 586,
  "scraped_at": "2026-02-14T12:11:25.245502"
}