{
  "article_id": "1ae7e0301045",
  "url": "https://www.sounderatheart.com/2025/10/match-preview-seattle-reign-vs-utah-royals-4/",
  "title": "Match preview : Seattle Reign vs . Utah Royals",
  "date": "20251017T030000Z",
  "domain": "sounderatheart.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Seattle Reign play their final 2025 regular-season home match on Friday night, hosting the Utah Royals at Lumen Field on October 17. The match kicks off at 7 p.m. PT and will air on FOX 13+ in Seattle and NWSL+ for all other viewers.\nThe match is an important one for the Reign's postseason goals. They can clinch a playoff spot with a win, and if they beat Utah and then the Orlando Pride in their final match of the regular season, the Reign can host a first-round playoff match.\nStanding in their way is one of the hottest teams in the league right now. Despite sitting in 12th place, Utah has been one of the most dangerous teams since the league returned to action in August. Since returning to league play, Utah has a 4-2-5 record. The Royals had their eight-game unbeaten streak snapped last week by the San Diego Wave.\nAs Reign head coach Laura Harvey told reporters ahead of the match, Utah didn't shift tactics dramatically after the league break. They're just doing all the little things better and have gained a lot of confidence.\n\"Tactically, structurally, how they try to do things is very similar to what it was then. I think they're just doing it better,\" Harvey said. \"They've got confidence. They're in great form.\"\nHead-to-Head\n- The Reign are 7-2-3 all-time against Utah; that includes a 3-1-1 record at home.\n- The Reign beat Utah 4-1 on the road in June before the league took a month-long break.\n2025 and recent results\n- The Reign and Utah sit 13 points apart, with the Royals (5-12-7) at 22 points and the Reign at 35 points (9-7-8).\n- The Reign have scored 29 goals and conceded 27. Utah has scored 26 and conceded 40.\n- Last week, the Reign came from behind to earn a 1-1 home draw against Bay FC, while the Royals fell 3-2 to San Diego at home.\n- The Reign are 4-3-4 at home, while the Royals are 2-5-5 on the road.\nOffseason and midseason moves\n- The Royals didn't lose many starters in the offseason, but did part ways with several rotational players – including defender Zoe Burns and forwards Michelle Vasconcelos, Cam Tucker, and Hannah Betfort.\n- They added Canadian forward Bianca St-Georges, Guatemalan forward Aisha Solórzano, Spanish defender Nuria Rábano, and Danish defender Janni Thomsen.\n- In August, they transferred Ally Sentnor to Kansas City and brought Slovenian international striker Lara Prašnikar over from German side Eintracht Frankfurt. She scored 44 goals in 122 appearances from 2020 to 2024.\n- Defender Tatumn Milazzo, who joined Utah as a free agent, tore her ACL earlier this season.\nUtah players to watch\nMina Tanaka: The Japanese forward / attacking midfielder leads the Royals with six goals, and four of them have come in Utah's last four matches. She also has one assist, picked up in a 3-2 win over Louisville in September. As she's gotten more touches, Utah's positive results have followed. The Reign will need to keep a close eye on her movement. Tanaka can score in many ways — poaching a deflection in the box, making a great run to find a teammate's pass, or calmly bringing a ball down and volleying in her shot.\nNuria Rábano: The left back seems to be flying under the radar in the NWSL, and I'm not sure why. Rábano has two assists and is tough to get around on the wing. She sits just ahead of the Reign's Sam Meza in tackles won and sits in the 96th percentile among fullbacks in clearances and 87th percentile in blocks.\nCloé Lacasse: Typically lining up on the left wing, Reign fans might remember Canadian forward Lacasse for the hat trick she scored against Seattle last year. She made an instant impact after joining Utah mid-season in 2024, but tore her ACL in October. Lacasse recovered quickly and was back on the field for the Royals in August. She's already notched a goal and an assist in her return. Lacasse is a speedy forward who has great instincts in the box and great timing on her runs. She can score easily with both feet. The Reign will want to avoid a repeat of 2024 by cutting off passes to her and tightly marking the forward.\nWhat to watch\nUtah's press: Utah loves to put teams under pressure. They lead the league in fouls per match (14.4 compared to 9.7 for the Reign), and their PPDA (passes per defensive action) is 9.2. That means Utah allows 9.2 passes for every defensive action they take—interception, tackle, foul, etc. The lower the number, the more a team likes to pressure their opponents. As you can see from this McLachBot chart, Utah's pressure numbers are among the highest in women's soccer.\nThe Reign's PPDA, in comparison, is 12.5, a sign of how comfortable the Reign are defending with numbers. Expect Utah to try to disrupt the Reign frequently as they attempt to build possession. For the Reign, they'll need to be smart about when they try to play through the pressure and when they try to bypass it with long balls over the top. They got it right against Utah in June. Can they repeat that at home?\nTransitional moments: Utah has become more comfortable as the season progressed in letting other teams have possession and punishing them in transition. It's what made the Royals so hard to defend at the end of the 2024 season — and they only added more players who are good in transition since then.\n\"I think if you don't respect them for who they are, they can play through you very easily. They have the players to be able to do that, and we felt that last year,\" Harvey told reporters before the Reign's first match against Utah this season.\nThe Reign can't afford to make mistakes building from the back. Utah will punish them. Expect the Reign to come out with a high press to counteract their opponents – and find their own opportunities in transition – while also keeping enough numbers in defense that limit Utah's attacking threats.\nWin it for Lu: This is Lauren Barnes' last regular-season match at home, as the club original announced she'll retire at the end of the season. The club legend has led the Reign for 13 years and deserves a hero's sendoff. Her teammates will be motivated to win in front of all their home fans for Lu. Those in attendance will be able to write messages of gratitude and their favorite Lu Barnes memory on an oversized \"Thank You\" wall, which will be gifted to Lu during a post-match retirement ceremony.\nInjury / Availability Report\nSeattle Reign\nOUT: Lynn Biyendolo (knee), Jordyn Huitema (illness), Veronica Latsko (SEI – lower leg), Sally Menti (lower leg), Cassie Miller (D45 – leg), Olivia Van der Jagt (excused absence)\nUtah Royals\nOUT: Imani Dorsey (hip), Mia Justus (hand), Cece Kizer (lower leg), Alex Loera (SEI – knee), Tatumn Milazzo (SEI – knee), Kaleigh Riehl (hamstring)\nINTERNATIONAL DUTY: KK Ream (USA U17)\nHow to watch\nThe Reign host the Royals at 7 p.m. PT on Friday, October 17. The match will air on NWSL+, as well as on Fox 13+ in the Seattle area.",
  "word_count": 1216,
  "scraped_at": "2026-02-14T12:24:06.400254"
}