{
  "article_id": "1afa324a258e",
  "url": "https://worthplaying.com/article/2023/7/5/news/138123-xbox-game-pass-reveals-8-new-pcxbox-titles-being-added-in-july-2023-as-part-of-wave-1/",
  "title": "Worthplaying | Xbox Game Pass Reveals 8 New PC / Xbox Titles Being Added In July 2023 As Part Of Wave 1",
  "date": "20230705T204500Z",
  "domain": "worthplaying.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Xbox Game Pass is Microsoft's digital gaming subscription service that gives you unlimited access to over dozens of Xbox One, PC, and Backward Compatible games for $9.99 USD per month.\nWith Xbox Game Pass, you can download and play a broad range of games in full fidelity on your Xbox One.\nEach month, Xbox Game Pass will add a new set of games to the catalog so there is always something new to play across a diversity of experiences, genres, ratings and more. For gamers, this means endless play of full-fidelity gaming experiences without having to worry about streaming, bandwidth or connectivity issues.\nAvailable Today\nGrand Theft Auto V (Cloud and Console)\nWhen a young street hustler, a retired bank robber, and a terrifying psychopath find themselves entangled with some of the most frightening and deranged elements of the criminal underworld, the U.S. government, and the entertainment industry, they must pull off a series of dangerous heists to survive in a ruthless city in which they can trust nobody — least of all each other. Includes both the Xbox One and the Xbox Series X|S versions of Grand Theft Auto V.Sword and Fairy: Together Forever (Cloud, Console, and PC)\nEnter a realm that blends ancient mythology with traditional Asian aesthetics in Sword and Fairy: Together Forever! Weaving its tale between the three clans of Human, Deity, and Demon, it puts you in command of a memorable party of characters, each with unique personalities, motives, skills, strengths, and weaknesses.Coming Soon\nMcPixel 3 (Cloud, Console, and PC) – July 6\nMcPixel 3 is a mind-blowing save-the-day adventure that sees the titular wanna-be hero avert one disaster after another at every turn using unconventional yet entertaining methods of mayhem.Common’hood (Cloud, Console, and PC) – July 11\nCommon’hood is a squatter settlement simulation game with highly customizable base building tools. Gather salvage materials, grow your own food, research new technology, craft new tools, and build a new home. Common’hood invites you to explore and discover unique characters that will go from strangers to family, helping the community overcome the shortage of food and shelter.Insurgency: Sandstorm (PC) – July 11\nBattle in the war-torn environments of a contemporary conflict through a series of intense co-op and PvP multiplayer modes. Feel every bullet and fear every impact in fierce close quarters combat as your team fights toward victory.Exoprimal (Cloud, Console, and PC) – July 14\nAvailable on day one with Game Pass: Every month is T. Rex awareness month in Exoprimal! Squad up and take down hordes of dinosaurs in a series of endless wargames run by the artificial intelligence Leviathan. Blending PvE and PvP combat with a variety of objectives and powerful exosuits to pilot, no two matches of Exoprimal play out the same.Techtonica (Game Preview) (Cloud, Console, and PC) – July 18\nAvailable on day one with Game Pass: Dig into the sub-surface, bioluminescent world of a rogue alien planet as you explore and construct sprawling factories in Techtonica. Work alone or in co-op to master automation, gather resources, research new technologies, mold the destructible terrain, establish a base of operations, and uncover long-forgotten secrets.The Cave (Cloud and Console) – July 18\nThe Cave is an adventure game from Monkey Island and Maniac Mansion creator Ron Gilbert, and Double Fine Productions, the award-winning studio behind Psychonauts and Brütal Legend. Assemble your team of three from seven unlikely adventurers, each with their own unique personalities, and then descend into the mysterious depths.DLC / Game Updates\nRace like Barbie and Ken in Forza Horizon 5 – Available now\nBarbie… in Forza?? Check your Message Center today to receive the very special 1956 Chevrolet ‘Barbie Movie’ Corvette EV and Ken’s 2022 GMC ‘Barbie Movie’ HUMMER EV Pickup, now available for download! See ‘Barbie The Movie’ only in theaters July 21.FIFA 23 Women’s World Cup – Available now\nExperience the FIFA Women’s World Cup Australia and New Zealand 2023 now in FIFA 23 at no extra cost. Play for the most coveted prize in women’s football, complete with all 32 qualified nations, stadium dressings, cinematics, match presentations, dedicated commentary, and more.Hi-Fi Rush: Arcade Challenge! Update! – Available now\nHi-Fi Rush fans, get ready to return to the pit: Tango Gameworks’ rhythm-action brawler is getting not one, but TWO new ways to play in the Arcade Challenge! Update! – a free addition for all Hi-Fi Rush players.Wo Long: Fallen Dynasty – Battle of Zhongyuan DLC – Available now\nGame Pass members save up to 10%! Conquer new scenarios and face new demons in Wo Long: Fallen Dynasty’s first DLC, Battle of Zhongyuan. Take on the demon-plagued Three Kingdoms and overcome the odds of deadly combat!Sniper Elite 5: Kraken Awakes DLC – July 6\nGame Pass members can save 10% on Season Pass Two, which includes the upcoming Kraken Awakes DLC. This final content pack includes a brand-new mission, a new Mod.712 pistol, and skins to complete an all-American look for Karl. Plus, check out the free multiplayer map – The Abandoned Quarry.Xbox Game Pass Ultimate Perks\nMadden NFL 23: EA Play Ultimate Team Pack – July 6\nUnlock your EA Play Ultimate Team Pack, featuring new players to upgrade your Madden NFL 23 Ultimate Team! Game Pass Ultimate and EA Play members can automatically claim this Pack by entering Ultimate Team from July 6 to July 31.Sea of Thieves: Obsidian Banjo Pack – July 6\nFor a limited time, claim items from the prized Obsidian set! This pack contains the Obsidian Banjo, Onyx Compass, and Obsidian Hull. Perk content requires Sea of Thieves to use.Xbox Game Pass Quests\nNew July quests are available starting today! Find new Quests by going to the Xbox Game Pass section on your console or on the Xbox Game Pass Mobile app and start earning Microsoft Reward points.\nAvailable Now:\n- Earn an Achievement (50 Points – Daily) – Earn an achievement in any Game Pass game\n- Peggle 2 (250 points – Ultimate only) – Hit 100 Orange Pegs\n- Ghostwire Tokyo (5 points) – Play\nLeaving July 15\nDon’t let the following games leave without showing a little love! There’s still time to start fresh or pick up where you left off. You can also also use your membership discount to save up to 20% to keep them in your library.\n- Exo One (Cloud, Console, and PC)\n- PAW Patrol The Movie: Adventure City Calls (Cloud, Console, and PC)\n- Spelunky 2 (Cloud, Console, and PC)\nFor a complete list of all games offered through Xbox Game Pass, visit here. And be sure to check back in each month to see the newest additions to the catalog.\nAs an added benefit, Xbox Game Pass members can purchase all Xbox One games in the catalog – and related add-ons – at an exclusive discount, allowing you to dive deeper into the Xbox Game Pass titles you love most, and make them part of your permanent library.\nIf you haven’t tried Xbox Game Pass yet, you can play free for 14 days.",
  "word_count": 1169,
  "scraped_at": "2026-02-14T13:38:21.419565"
}