{
  "article_id": "1b0750896e66",
  "url": "https://news.unm.edu/news/dust-off-your-lobo-pride-for-unm-homecoming-2025",
  "title": "Dust off your Lobo pride for UNM Homecoming 2025",
  "date": "20251010T021500Z",
  "domain": "news.unm.edu",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Get ready to unleash your Lobo pride with the festivities at Homecoming 2025. This year’s theme, Desert Boots and Lobo Roots, celebrates the UNM legacy and embraces the spirit of the Southwest. Join us Oct. 13–18 as the Alumni Relations Office host a series of events leading up to the Lobos’ 100th homecoming game.\nThis year’s homecoming week will feature seven events, including President Stokes’ S’mores Roast, Homecoming Hoops: Meet the Pack, the Division for Change and Empowerment Open House, ReUnite at Hodgin Hall, the Young Alumni Roundup, and the Homecoming Tailgate.\nExclusive merchandise is also available, including the 2025 UNM Homecoming T-shirt, bandana and “belt buckle” pin. For more information, visit 2025 Homecoming Merchandise.\nHomecoming Events\nPresident Stokes’ S’mores Roast\nOct. 13, noon to 1:30 p.m., SUB Atrium\nAlumni, students and staff are invited to join President Stokes in the Cactus Garden for her final S’mores Roast to kick off homecoming week. Stop by the tents for a delicious treat! In the event of inclement weather, the event will move to the Student Union Building Atrium.\nLobo Living Room, Homecoming Hoops: Meet the Pack\nOct. 14, 5:30–8 p.m., The Pit\nJoin alumni at The Pit for an evening celebrating Lobo basketball during Homecoming 2025. Meet the Pack is an exclusive chance to connect with the men’s and women’s basketball teams, gain insight into the upcoming season, see a live on-court preview and hear from key leaders shaping the future of Lobo Athletics.\nHear from new men’s basketball head coach Eric Olen, women’s basketball head coach Mike Bradbury and athletic director Fernando Lovo. Admission is free and open to all alumni, but space is limited. Register here.\nDivision for Change and Empowerment Open House\nOct. 16, 8:30–10:30 a.m., Scholes Hall, Roberts Room\nThe Division for Change and Empowerment works to strengthen UNM’s core values by creating access for, and cultivating the potential of all Lobos. Stop by Scholes Hall during Homecoming 2025 to learn more about the division’s work and services. The open house will showcase their initiatives across UNM. Breakfast will be provided.\nReUnite at Hodgin Hall\nOct. 16, 5:30–8 p.m., Hodgin Hall Alumni Center\nAlumni are invited to bring their Western best and their finest cowboy boots to an evening of reconnection, live music, surprises and complimentary bites. Curated whiskey, wine and spirit tastings will be available for $25 per person.\nAdmission is free, and donations will be accepted for the Lobo Food Pantry. Attendees are encouraged to bring a gallon bag (or larger) of toiletries; a special homecoming gift will be given as a thank you. Click here to register.\nYoung Alumni Roundup\nOct. 17, 6–8 p.m., Flock of Moons Brewing Company\nJoin the UNM Young Alumni Chapter and the Albuquerque Run Club for a lively evening rounding up recent grads and alumni under 40.\nThe night begins with the Homecoming Howl Run at 6 p.m. at Flock of Moons Brewing Company. The route will loop through campus, swinging past Hodgin Hall for a special homecoming surprise, before returning between 6:30 and 7 p.m.\nNon-runners are welcome at 6 p.m. for snacks, music and great company while cheering on the runners. Afterward, alumni registered for happy hour can claim one of 50 free drink tickets. Stick around for a live DJ, raffles for Lobo gear, exclusive drink specials and more.\nPartial drink proceeds benefit the UNM Young Alumni Scholarship Fund. Register for happy hour online, where you can also find donation options.\nHonors College Homecoming and Open House\nOct. 18, Honors College\nThe UNM Honors College will host a Homecoming and Open House event on Saturday, Oct. 18, from 11 a.m. to 2 p.m. This family-friendly event will feature an art exhibition at the Spectra Gallery, a kids' room with fun crafts, and a silent auction fundraiser to support Scribendi, the Honors College Literature & Arts Magazine.\nNot able to attend it in-person? No worries, this event is hybrid and can be accessed via zoom.\n- Topic: Honors Homecoming 2025\n- Time: Oct. 18, 2025 11:00 AM Mountain Time (US and Canada)\n- Join Zoom Meeting: https://unm.zoom.us/j/95569251817\n- Meeting ID: 955 6925 1817\nHomecoming Tailgate & Football Game\nOct. 18, University Stadium\nThe week of festivities wraps up with a cherry and silver celebration. The rally will take place at the newly constructed Louie Lane, where alumni will gather under the Lobo tent for food, music and giveaways.\nAdmission is free for attendees and guests. Discounted game tickets are available while supplies last. Registration and ticket preorders are open. Bubba’s 33 is offering a preorder of its green chile cheeseburger and a drink for $12.\nAlumni can purchase a special-section football ticket for $13 (available for pickup at Hodgin Hall, Oct. 6–16, Monday–Friday, 9 a.m.–4 p.m., or at the Oct. 18 tailgate).\nA tailgate meal bundle is available for $23, including one burger meal and a special alumni football ticket. A two-meal, two-ticket bundle is $40.\nLimited quantities of merchandise will be for sale at the tailgate via credit/debit card, Venmo and cash.\nHomecoming Football History\nThe Lobos enter the weekend with an all-time homecoming record of 46-50-3. This marks their 100th homecoming game and their first against Nevada. UNM holds a 3-6-1 all-time record against the Wolf Pack and will look to improve it in front of a rowdy cherry-and-silver crowd.\nStay connected with UNM alumni through social media channels and check out the Events Calendar to stay updated on all things Homecoming 2025.",
  "word_count": 908,
  "scraped_at": "2026-02-14T13:43:33.715256"
}