{
  "article_id": "1b24afdf2832",
  "url": "https://punchng.com/falcons-winning-2006-wafcon-unbeaten-my-best-moment-ekpo/",
  "title": "Falcons winning 2006 WAFCON unbeaten my best moment – Ekpo",
  "date": "20230428T010000Z",
  "domain": "punchng.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Efioanwan Ekpo. Remember her? She is the pint-size former Super Falcons midfielder who was a handful for opposing defences during her time with the women’s national team, winning the WAFCON in 2002, 2004 and 2006, as well attending two World Cups. She opens up on her career in this interview with JOHNNY EDWARD\nHow do you feel winning three Women’s Africa Cup of Nations with the Super Falcons during your playing days, as well as playing at two Olympics and two World Cups?\nFor any player, the dream has always been to win trophies and I’m glad to have achieved that with the team, as well as featuring at the World Cup and the Olympics. Playing for the Falcons at the highest level like I did back then was the greatest moment of my career. As a team, we gave our best each time we were on the pitch. Players always showed hard work, discipline, dedication and determination to win every game and that is why our era remains the best. We dominated Africa till most of us retired from the team.\nThat is not what it is with the current team…\n(Cuts in) I don’t want to comment or say anything about this current team. Whatever it is, I am sure the current players and coaches have the answer to that.\nYou talked about how the players of your era gave everything each time they played. How competitive was the team back then?\nVery competitive, we had so many talents in the squad then. From Mercy Akide, Perpetua Nkwocha, Maureen Mmadu, Patience Avre, Ifeanyi Chiejine, Florence Omagbemi, our captain at that time, and Vera Okolo. So, you know if you were not playing well you will be out of the team. We had good coaches then, who ensured we were always at our very best.\nWhat were your best moments as a player?\nWinning matches and titles were unarguably my best moments. The 2006 WAFCON was my best tournament with the Falcons because we won the title on home soil going unbeaten. Also scoring my first goal for the team against Algeria was awesome for me. We were already four goals up at that time before my goal came. It was a long-range strike, which I regard as the best I scored for the team.\nWhat about your worst moments as a player?\nMy worst moment is anytime I lose a match. I always feel bad, just like my debut appearance at the World Cup in 2003. We didn’t win a game. It was painful but we improved in our next outing at the 2004 Olympics, reaching the quarter-finals of the Games but unfortunately, we lost 2-1 to Germany.\nYou played alongside two of the best strikers the Falcons ever had: Mercy Akide and Perpetua Nkwocha. How influential were they in the team?\nIt was wonderful playing with them because we were always assured of goals each time we played. They brought different qualities to the team, which helped us a lot.\nHow did you start playing football?\nI started playing football at a tender age on the streets in Calabar and at that time, not many people wanted their daughters to play football. I just had the passion to compete and football gave me that opportunity. Then I joined Pelican Stars and from there my career flourished.\nWere your parents in support of you playing football?\nYes, my parents were supportive at that time but they insisted I must go to school which I did.\nHow did you manage to combine football and education at that early age?\nIt wasn’t easy initially, but I always found a way round it. Sometimes I skipped training to go for tests and exams and I did the same for some of my trainings as well.\nThe Falcons will be making their ninth appearance at the Women’s World Cup in Australia and New Zealand. What are their chances of qualifying from the Group B, having been drawn alongside Australia, Canada and Ireland?\nThis is another Falcons team entirely, not the team I know. I don’t want to talk about this team for so many reasons. I wish them all the best at the World Cup.\nHow would you rate the Nigerian Women’s Football League?\nThe league is developing better than it was in the past. The organisers are doing well, but a lot of work must be put into it to make it better, so, that our teams can compete with the rest of the clubs in Africa. I’m happy with the way the season ended and I feel it was successful as there were no issues at all. Everything went as planned. The organisation was perfect but they must do better. Other countries are developing as well.\nYou have been coaching for some years now, what has been the experience like?\nIt was something I had in mind to do even before I retired. I’m happy that I’m living the dream now with Pelican Stars. My plan is to build a strong team that will gain promotion back to the elite division. We were relegated last season, so, that still hurts. We will use that as a motivation to play our games and excel. Our aim is to be in the topflight and we all know that Pelican Stars have been a team to reckon with. It is a surprise to everybody to see us down, but this thing happens in life. We are building a younger team and very soon some of them will be making waves in the national team.\nThere were reports that some of your players left the team because of poor welfare packages by the Cross River State Government. What really happened?\nThat is in the past and I don’t want to dwell on that again. What I can say now is that we do not owe any player again and we pay our players as at when due. We may not be paying our girls like the top clubs in the elite division, but we do not owe.",
  "word_count": 1013,
  "scraped_at": "2026-02-14T12:39:39.030413"
}