{
  "article_id": "1b432ac039b5",
  "url": "https://www.wsws.org/en/articles/2025/12/04/bcfp-d04.html",
  "title": "Timeline of the Hillsborough disaster and cover - up as it unfolded ( 1989 - 2025 ) ",
  "date": "20251205T034500Z",
  "domain": "wsws.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "April 15, 1989\nAn estimated 54,000 people attend the FA Cup semi-final between Liverpool and Nottingham Forest. Ninety-four men, women and children are killed and 766 injured. Two more subsequently die as a result of their injuries. They were crushed and suffocated to death after David Duckenfield, the chief constable of South Yorkshire Police (SYP) gave the order to open Gate C at 2:52 p.m., just before kick-off. As a result, thousands of fans were directed into two already dangerously overcrowded pens.\nAbout 10 minutes after the match was stopped at 15:06, Duckenfield lied in telling Football Association (FA) chief executive Graham Kelly that Liverpool supporters had forced the gate open.\nThe Football Association selected the Hillsborough ground for the semi-final despite it not having a valid safety certificate and two previous incidents when the games had to be delayed due to crowd congestion.\nApril 16, 1989\nConservative Prime Minister Margaret Thatcher, and her press secretary, Bernard Ingham, visit Hillsborough. Ingham said he was informed the deaths were caused by a “tanked-up mob.”\nApril 19, 1989\nThe Sun, owned by Rupert Murdoch, publishes its notorious front-page headline, “The Truth”. It was a pack of lies saying that as people were dying Liverpool supporters stole from them, urinated on police officers and beat up “brave cops.”\nAugust 1, 1989\nLord Justice Taylor’s official report blames police mismanagement of the event and criticises South Yorkshire Police for blaming Liverpool supporters instead of accepting responsibility. No one is charged and made to stand trial, or even disciplined.\nNovember 19, 1990–March 28, 1991\nAn inquest into the deaths is held and the jury returns a majority verdict of accidental death.\nOctober 29, 1991\nDavid Duckenfield, the chief constable of South Yorkshire Police, retires on a full pension escaping imminent police disciplinary action.\nJanuary 13, 1992\nDisciplinary action against Superintendent Bernard Murray, the police control box commander at Hillsborough, is dropped.\nNovember 5, 1993\nAn application by six of the families for a judicial review to quash the perverse inquest verdict is rejected by Lord Justice McCowan.\nDecember 5, 1996\nITV broadcasts a drama documentary, Hillsborough, written by Jimmy McGovern. This contains new evidence pointing to police responsibility for the disaster and an orchestrated cover-up.\nJune 30, 1997\nLabour government Home Secretary Jack Straw orders the “scrutiny” of new evidence by Lord Justice Stuart-Smith. It emerges that South Yorkshire Police changed 164 officers’ accounts of the disaster before sending them to the Taylor inquiry. Regarding calls for a new public inquiry into Hillsborough, in light of the revelations, incoming Labour Party Prime Minister Tony Blair writes in a internal document, “What is the point?”\nFebruary 18, 1998\nThe Labour government rules out a public inquiry into Hillsborough. Straw claims new evidence looked at by Lord Justice Stuart-Smith had not added “anything significant” to the material available to the Taylor inquiry.\nJanuary 2010\nIn response to widespread anger at the cover-up, the Labour government, now headed by Gordon Brown, finally establishes the Hillsborough Independent Panel (HIP) and agrees to release previously confidential documents.\nSeptember 12, 2012\nThe Hillsborough Independent Panel, which has reviewed 450,000 documents disclosed to it, publishes its 394-page report. It collected documents from more than 80 organisations, including the South Yorkshire Police, Sheffield City Council, the South Yorkshire coroner and the fire and ambulance services.\nNew medical evidence reveals that 58 victims “definitely or probably” had the capacity to survive beyond 3:15 p.m. South Yorkshire West District Coroner, Dr Stefan Popper, had ruled in 1991 that those who died had already received their critical injuries by 3:15 p.m., so evidence beyond that point was not required as to the cause of death. This resulted in no evidence ever being heard regarding the role of the police and failings of the emergency services after that time.\nMichael Mansfield, the legal representative of the Hillsborough Family Support Group, describes what followed the Hillsborough disaster as “the biggest cover-up in British legal history.”\nTheresa May, the Conservative home secretary, is forced to accept the HIP report and orders a criminal inquiry into the disaster, Operation Resolve.\nDecember 19, 2012\nThe “accidental death” verdict of the first inquests is quashed in the High Court by three judges.\nMarch 31, 2014\nThe new inquests begin in Warrington, northwest England.\nApril 26, 2016\nAfter two years, the longest case ever heard by a jury in British legal history, the jury delivers its verdict that the 96 men, women and children who died at Hillsborough were unlawfully killed.\nJune 28, 2017\nThe Crown Prosecution Service (CPS) announces, more than 28 years after the Hillsborough disaster, the first prosecutions of anyone involved in the deaths and subsequent cover-up. David Duckenfield is charged with the manslaughter of 95 people; five others are handed lesser charges.\nAugust 21, 2018\nCharges against Sir Norman Bettison, a chief inspector in the South Yorkshire Police force at the time of Hillsborough, are dropped. He faced four counts of misconduct in a public office over his role in trying to blame the fans for what happened. The CPS withdrew the case after one witness died and contradictions came to light in the evidence of another two.\nApril 3, 2019\nThe jury in the trial of David Duckenfield, the former police chief superintendent in charge of policing at Hillsborough, was dismissed after failing to reach a verdict.\nNovember 29, 2019\nSouth Yorkshire Police match commander, David Duckenfield, is found not guilty of gross negligence manslaughter for the deaths of 95 Liverpool fans, in a retrial, by a majority of 9-1. He was not tried over the death of the 96th victim, Tony Bland, as he died more than a year and a day after the disaster.\nMay 26, 2021\nThe collapse of the prosecution of retired police officers Donald Denton and Alan Foster, and South Yorkshire Police solicitor Peter Metcalf ends any possibility of bringing to justice anyone responsible for the deaths of 96 people in the Hillsborough football disaster and the decades long-cover-up that followed. Denton (aged 83), Foster (74) and Metcalf (71) were accused of changing statements by police officers prepared for Lord Justice Taylor’s 1989 public inquiry into the disaster, to withhold evidence implicating South Yorkshire Police for the loss of life at Hillsborough.\nJune 4, 2021\nSouth Yorkshire and West Midlands police agree to compensate 601 people for their suffering over the police campaign aimed at avoiding responsibility for the disaster and blaming the victims instead.\nA statement by law firm Broudie Jackson Canter said: “Through this civil claim for misfeasance in a public office 601 victims sought justice and accountability for the deliberate, orchestrated and thoroughly dishonest police cover-up that suppressed the truth about the responsibility of the police and blamed the football supporters for the horrific events that unfolded at the Hillsborough Stadium on 15 April 1989.\n“96 Liverpool supporters were unlawfully killed as a result of the police failings that day, and countless others suffered physical and psychological harm. The distress and heartache caused by the loss of life, and the injuries caused to those who survived, were made significantly worse by the lies told and the cover-up that followed. As a result of the cover-up, that was maintained for nearly 30 years, the victims, both the bereaved and the survivors, and their families and loved ones, suffered additional psychiatric injury. No amount of money can compensate them for the ordeal they have suffered but this settlement acknowledges both the cover-up and its impact upon each of the victims.”\nJuly 27, 2021\nAndrew Devine, the 97th victim of the Hillsborough disaster dies aged 55. Andrew suffered lifelong injuries at Hillsborough that left him with severe and irreversible brain damage requiring 24-hour care. The following day, Senior Coroner Andre Rebello said that Andrew was the Hillsborough disaster’s “97th fatality” and, as with the other 96, was unlawfully killed.\nDecember 2, 2025\nThe final Independent Office for Police Conduct (IOPC) report finds that 12 police officers who were involved in the disaster would have faced disciplinary cases of gross misconduct if they were still serving. None will face any consequences, let alone legal action, because they are all retired.\nFill out the form to be contacted by someone from the WSWS in your area about getting involved.\nRead more\n- Final investigation into 97 deaths at Hillsborough stadium caps decades-long cover-up\n- Police falsified evidence about 1989 Hillsborough football disaster\n- Report on Hillsborough football disaster exposes “biggest cover-up in British legal history”\n- British Labour Party continues coverup of Hillsborough football disaster\n- Andrew Devine, the 97th Hillsborough disaster victim dies 32 years after suffering lifelong injuries\n- UK: Hillsborough stadium disaster prosecution collapse ends 32 year fight for justice\n- Hillsborough: A powerful and moving account of Britain’s worst sporting disaster\n- Scandal deepens over Hillsborough disaster cover-up",
  "word_count": 1467,
  "scraped_at": "2026-02-14T12:12:59.064175"
}