{
  "article_id": "1b6b53c40959",
  "url": "https://metro.co.uk/2024/08/20/olympics-exhausting-crawled-onto-pitch-play-21457496/",
  "title": "Olympics are exhausting , but Id have crawled onto the pitch to play | Football",
  "date": "20240820T193000Z",
  "domain": "metro.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "I have to admit I would have done anything to be at the Olympics. I definitely have some ‘FOMO’.\nA Games is an amazing experience and one which I got to have in Tokyo three years ago, albeit during the coronavirus pandemic.\nWhen we failed to qualify Great Britain for Paris, it was very hard indeed. I would have crawled onto the pitch to be at the Olympics!\nBut maybe there is a silver living in there somewhere, as tough as that is to admit because it was very difficult to watch from afar wanting to be there. And that is I’ve managed to have a proper break this summer without a tournament to play in. I even managed to have a family holiday for the first time in 15 years.\nI’m very relaxed going to the US on tour with my new club Chelsea and in that respect it’s been good to have a rest. I guess you have to take your blessings where you can find them.\nI’ve had two extra weeks off while Barca players have had an arduous season stretching back to last summer’s World Cup final.\nThere’s no doubt the women’s football schedule is more demanding than it was a few years ago and I believe Paris showed that when it came to Spain’s performance.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nEmma Hayes is a great manager and to win gold at the Games is a great start to her journey with the USA team.\nBut the Olympics was quite difficult for the Spanish, who included many of the former Barcelona team-mates I have just left behind.\nThe truth is players like Aitana Bonmati, Alexia Putellas and Salma Paralluelo, some of the very best footballers in the women’s game, didn’t get to show their quality as they would have hoped to.\nAnd that is because the programme at an Olympic football tournament is so relentless. Not only are you required to play every three days after a gruelling season but you also have to travel a big country like France to do so. And on top that there can be extra-time and penalties too. Nobody plays every three days like that in the normal season, so I don’t know why that has to be the case at a Games.\nI was watching Spain thinking ‘that looks painful’. It must have been excruciating to push your body like that. The physical output involved is huge and there is not a load of recovery time. For me, Spain are the best footballing side around but it was clear how much they were struggling, and they were not the only ones.\nThe US, though, had the fresher players because they are midway through the NWSL campaign back in the States so they were the ones able to see out games, such as the final, where they beat Brazil 1-0 at Parc des Princes while Spain lost the bronze-medal match with Germany.\nMaybe the story in Paris would have been Marta signing off with gold at the age of 38 instead of a third Olympic silver medal. But that result doesn’t take away from her story. Any player would be happy to have achieved just a quarter of what she’s done in the game. She has been the driving force in Brazilian women’s football.\nMarta has long been an inspiration of mine – her quality on the ball is unmatched and she will go down as one of, if not the greatest to have played the women’s game.\nAs she has got older, she has lost none of the ability to inspire her team-mates. She still wants to be there at 38 and that acts as a motivation for me. It makes me feel just the same.\nBut there aren’t always fairytale endings in sport, as we saw with Marta. I also know Spain’s time will come again.\nI’ll keep going until someone tells me to stop\nI’M so pleased to be at Chelsea and back in England and the Women’s Super League.\nMore Trending\nPeople talk about your age when you reach your 30s but football is something I love so much and why would I not want to keep going?\nI want to go on until someone else tells me to stop, if my body allows. You just want to go on forever as a player. I like looking for new challenges and want to have been to every corner of the world to play, if I can, when I retire.\nI want to take in styles of football, teams and cultures so that I’ve lived out my passion to the fullest. I’m looking forward to every moment of doing that with Chelsea.\nAs a British, female-led brand, ALIGNE are proud to be partnering with Lucy Bronze as we champion women in sport. Female athletes are the epitome of confidence and strength and Lucy represents everything ALIGNE stands for.\nMORE: Four Chelsea stars left out of latest squad in fresh transfer message\nMORE: ‘We’re not masking for fun – covid hasn’t gone away’\nMORE: ‘Vampire psychopath’ accused of murdering dozens of women escapes from police",
  "word_count": 906,
  "scraped_at": "2026-02-14T12:57:42.993371"
}