{
  "article_id": "1b6e0b0f6c2b",
  "url": "https://www.newstatesman.com/politics/scotland/2025/11/scotland-must-learn-from-english-schools",
  "title": "Scotland must learn from English schools",
  "date": "20251122T101500Z",
  "domain": "newstatesman.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It’s not often you hear an SNP politician speak approvingly about matters English. The nationalists are often more prone to talking down our neighbours in comparison to a perceived Scottish exceptionalism.\nIt was a breath of fresh air, therefore, to talk this week with Maree Todd, the Scottish sports minister. We were discussing the rise of women’s football in Scotland, and she was full of praise for the Lionesses and the impact their global success has had not just on England, but on the women’s game in Scotland too. It’s certainly hard to imagine many Scots reacting as positively to an England men’s World Cup win next year.\nThe women’s game is culturally different to the men’s: matches are often unsegregated between rival fans, the crowds are more family-based and the atmosphere generally friendlier and less tribal. There is support between teams and countries, all of whom have a shared interest in growing the sport. Todd had a wonderful line: “sisterhood is stronger than nationhood”.\nSolidarity between the UK’s nations is not what it was. Support for Scottish independence sits just shy of 50 per cent, while polling suggests we may, before too long, have an English nationalist prime minister, Plaid in power in Wales, Sinn Fein ruling Northern Ireland and an SNP first minister. This does not necessarily seem like a recipe for harmonious and constructive co-existence, or to promise a bright future for the Union. It is a consequence of Keir Starmer’s failure.\nOne sad result of the constitutional pitched battle that has dominated Scotland politics for more than a decade has been the refusal to consider that English policymakers may occasionally have a good idea. The SNP position has usually been that if England is doing something then Scotland damn well won’t. This has been self-defeating in a number of areas.\nThe one that rankles with me most is education. No one claims the English schools system is perfect, but its recent story is one of success. It has soared up the international charts due to a programme of reform pursued by consecutive governments, both Labour and Conservative. Scotland, meanwhile, has been traveling in the other direction under the control of a “progressive” education establishment and a government afraid of challenging those vested interests.\nThis week, Enlighten, the think tank I run, played host to Sir Nick Gibb, arguably the most successful and consequential schools minister England has ever had. Gibb was in post for most of the 2010s and into the early 2020s, and his innovations lie at the heart of the success story. He is softly spoken and cerebral, with a genuinely expert grasp of his subject matter (a rarity in politics). He has recently published a book explaining how he did it: Reforming Lessons: Why English Schools Have Improved Since 2010 and How This Was Achieved.\nIn short, Gibb oversaw the expansion of the academy programme – he is generous about the role played by his Labour predecessors – that brought new leadership to failing schools and freed up successful heads to run their schools as they saw fit. There were changes to accountability and teaching methods, a curriculum based on knowledge, and improvements to pupil behaviour. There was an intense focus on phonics and East Asian methods for teaching maths, both of which had a dramatic and quick impact.\nGibb and his immediate boss, Michael Gove, faced opposition from the English education establishment, but sought to work with and persuade their critics. Gibb kept good personal relations with his opponents in the unions. He says he compromised where necessary, introducing reforms until his plan had largely been achieved in full. It’s a smart political strategy – after all, how do you eat an elephant? One bit at a time.\nToo many of Scotland’s schools are in poor fettle. And yet, so far, our political leaders – I’m not just talking about the SNP here – show little intention of properly grasping the issue. Surely, if a strong education system is the closest thing society and politics have to a silver bullet, this should be their number one priority. As May approaches, can we expect manifestos to display some genuinely radical thinking, or will the parties continue to kow-tow to the received wisdom of the conservative establishment, despite the track record of failure and decline? If anything is worth spending your precious political capital on, surely our children and their future prospects are it. Most successful systems across the world have similar measures at their core, so why resist what is obviously best practice?\nGibbs says he is not a particularly ideological politician, and is more interested in “what works”. What a good and all-too-rare way to approach politics. And what a legacy this now former MP and minister has left behind.\nSisterhood may well be stronger than nationhood. To the rational mind, lots of other things should be too, including smart, proven public policy success. I’m told Scotland’s education secretary Jenny Gilruth has asked to meet Nick Gibb. I hope she’s in listening mode, and that she finds his lessons as inspiring as I did, and that she then acts upon them.\n[Further reading: Tinkering with ECHR definitions will not help the government]",
  "word_count": 870,
  "scraped_at": "2026-02-14T13:06:49.420778"
}