{
  "article_id": "1b768acf286c",
  "url": "https://www.wbay.com:443/2024/10/17/packers-sign-kicker-brandon-mcmanus-replace-struggling-rookie-brayden-narveson/",
  "title": "Packers sign kicker Brandon McManus to replace struggling rookie Brayden Narveson",
  "date": "20241017T043000Z",
  "domain": "wbay.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Packers sign kicker Brandon McManus to replace struggling rookie Brayden Narveson\nGREEN BAY, Wis. (AP) — New Green Bay Packers kicker Brandon McManus said he’s thankful for his latest opportunity and confident the circumstances that kept him out of the NFL earlier this season are behind him.\nHe joined the team Wednesday as Green Bay signed the 33-year-old veteran to replace struggling rookie kicker Brayden Narveson, who has missed a league-high five field-goal attempts. McManus had been out of a job since the summer, when two women sued him in civil court alleging he sexually assaulted them when they were working as flight attendants on the Jacksonville Jaguars’ trip to London.\nMcManus and an attorney representing him said the lawsuit had been resolved. McManus did not go into specifics.\n“The case has been resolved,” lawyer Brett Gallaway said in a statement. “I look forward to seeing Brandon play for the Packers on Sunday.”\nA message sent to lawyers representing the women who filed the suit was not immediately returned. The latest documents accessible on the Duval County Circuit Court records site are from earlier this month and do not reflect the case being closed.\n“It’s been a difficult time these last couple of months,” McManus said. “I’m happy that it’s in the past now. I was hoping and working hard for another opportunity. I’m extremely grateful for the Green Bay Packers for giving me that next chance to come back out here and play the game I love.”\nThe NFL said late last month it didn’t find sufficient evidence that McManus violated the personal conduct policy.\nIn court documents initially filed in late May under pseudonyms and then again in early September using their names when a judge ruled the lawsuit didn’t meet the criteria for anonymity, the women allege McManus tried to kiss one of them and rubbed up against both while they were trying to perform their work responsibilities during the Sept. 28, 2023, trans-Atlantic flight. The team was on its way to play a pair of games in England.\nThe AP Top 25 college football poll is back every week throughout the season!\nGet the poll delivered straight to your inbox with AP Top 25 Poll Alerts. Sign up here.\n“The matter’s been resolved,” McManus said. “I was always up front and honest about it. That’s how I was able to kind of get through this all.”\nMcManus signed with Washington as a free agent in March and was on the Commanders’ roster when the lawsuit was filed. They released him soon after.\n“Obviously he wouldn’t be available right now if those accusations weren’t out there, but I think the league did a really thorough investigation, and we leaned on that as we went through it,” Packers general manager Brian Gutekunst said.\nGutekunst said he spoke to McManus about it Tuesday.\n“We wanted to make sure that we did our due diligence,” Gutekunst said. “We feel really good about that, where we sit right now. We’re excited to get him out there.”\nThe Packers have struggled to find a reliable kicker since moving on from Mason Crosby, who held down the job from 2007-22 and remains the franchise’s all-time leading scorer.\nGreen Bay selected Anders Carlson out of Auburn in the sixth round of the 2023 draft, but he capped an inconsistent rookie season by missing a 41-yard field goal in the fourth quarter of a 24-21 playoff loss at San Francisco. After Carlson and veteran Greg Joseph competed for the job in training camp, the Packers went in a different direction and claimed Narveson off waivers from the Tennessee Titans.\nNarveson was 12 of 17 on field-goal attempts. The Packers (4-2) decided they needed a more experienced kicker as they compete in a demanding NFC North, where every team is at least two games above .500.\n“Brayden’s a very talented, young kicker,” Gutekunst said. “But he’s young. He’s going through some things for the first time. I think where our football team is at right now, we know how important these games are.\n“I thought it was important that if we had an opportunity to get a veteran kicker who’d been through some of these fires and some of this pressure that our team is going to go through over the next few weeks, I thought it was important that we acquire one. And really Brandon was the only one that was out there.”\nMcManus, a Philadelphia native who played college football at Temple, spent his first nine years with Denver and was with the Broncos when they won the Super Bowl in the 2015 season. He played for Jacksonville in 2023.\nHe has made 81.4% of his career field-goal attempts. Carlson made 81.8% of his field goals last year, and Narveson had made 70.6% of his field goals this year.\nMcManus’ value is his reliability from inside 50 yards.\nHe has made just 54.9% of his career attempts from 50-plus yards (45 of 82) but has been accurate on 90.8% of his other attempts (208 of 229). He also has made 97.2% of his extra-point attempts (312 of 321).\nNarveson missed five field-goal attempts this season without attempting any from beyond 49 yards. Carlson was just 4 of 8 from 40-49 yards last season and missed five extra-point attempts.\n“He’s an experienced guy, and certainly (we) have confidence (in him),” Packers coach Matt LaFleur said. “Obviously wouldn’t have done it if we didn’t.”\nNOTES: WR Dontayvion Wicks practiced on a limited basis Wednesday after a shoulder injury had knocked him out of the Packers’ 34-13 victory over the Arizona Cardinals on Sunday. ... The Packers signed WR Malik Knowles to the practice squad.\nCopyright 2024 The Associated Press. All rights reserved.",
  "word_count": 956,
  "scraped_at": "2026-02-14T12:42:55.750129"
}