{
  "article_id": "1b8574830afc",
  "url": "https://english.hani.co.kr/arti/english_edition/english_editorials/1008593.html",
  "title": " [ Column ] Let stop looking at women athletes through lens of misogyny",
  "date": "20260110T154500Z",
  "domain": "english.hani.co.kr",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "[Column] Let’s stop looking at women athletes through lens of misogyny\nPosted on : 2021-08-22 11:52 KST Modified on : 2021-08-22 11:52 KST\nThe root of this structural discrimination is the tendency to view women athletes as “female,” rather than “athletes”\nA still from a documentary on athletes on Korea’s national team that was broadcast on the KBS show “Docu Insight” on Aug. 12 (KBS screenshot)\n“Kang Cho-hyun, the silver medalist in the air rifle event at the Sydney Olympics, is extremely popular — and pretty, too.”\n“Ki Bo-bae has won two events in archery. This ‘archer with a pretty face’ is here with us today.”\n“Koreans now view Yeon-jae as something of a cherished ‘little sister.’”\n“The beauties on the volleyball team are enjoying soaring popularity.”\nThese lines appear in a scene from a documentary on athletes on Korea’s national team that was broadcast on the KBS show “Docu Insight” on Aug. 12.\nThe producers of the documentary dug into the TV channel’s archives to find examples of commentators paying more attention to women’s physical appearance than their athletic ability. The documentary is at once a testament to the long history of such discrimination against female athletes, as well as a confession and penance for KBS’ own complicity in that history.\nFollowing that archive footage, the camera turned to Kim Yeon-koung, one of Korea’s best-known volleyball players.\n“They always call us ‘beauties’ and refer to us as the ‘squad of beauties.’ But no one refers to male teams as a ‘squad of hunks,’ you know?” Kim said with a sad smile.\n“The reason that bothered me is that it always seems like physical appearance is the first thing mentioned about female athletes. The first thing they ought to talk about is our talent.”\nS. Korean women’s volleyball team celebrates their victory in the 2014 Asian Games over in a kimchi jjigae dinner. (Hankyoreh photo archives)\nIt’s widely known that women made up 49% of the athletes in the Tokyo Olympics. That parity wasn’t achieved until 125 years after the first modern Olympics when not a single woman participated.\nNevertheless, men still account for an overwhelming percentage of coaches and members of the International Olympic Committee. The documentary about the national team cites the genders of athletic leaders registered with the Korean Sport & Olympic Committee: 22,213 men and 4,386 women.\nThe producers ask Kim On-a, a female handball player on the national team, why there aren’t more female coaches in handball, considering that women have won more medals in the sport.\n“It just seems like there are a lot more men. Most of the coaches for business handball teams are men, so there are fewer coaching options for women,” Kim said.\n“To be honest, I didn’t give it much thought when I was younger, but now that I’m older, I often wonder why the women who’ve won medals don’t take leadership roles and whether there aren’t any spots for them.”\nThe number of coaches isn’t the only difference. Women tend to make less money and receive less support than men even when they have similar careers in the same sports.\nJi So-yun, a South Korean who plays for Chelsea FC Women — part of the UK Football Association Women’s Super League, assumed that her games would take place at Stamford Bridge, Chelsea’s home stadium, but was shocked to find herself kicking the ball around an empty lot in the neighborhood. She recalled asking the team to provide more support.\nPark Se-ri, coach of the national golf team and an icon of Korean golf, said she’d been stunned by the gap in prize money between men’s and women’s golf tournaments. Kim Yeon-koung remembered being angry when she heard that the salary cap had been frozen for female athletes but steadily increased for male athletes.\nThe root of this structural discrimination is the tendency to view female athletes as “female” rather than “athletes.”\nThe documentary played a section of video from the 2016 Olympics in Rio de Janeiro. While watching a swimmer whose performance had improved around the time of her marriage, the commentators glibly suggested she was benefiting from “the love of her husband,” who happened to be her coach. The comments suggested that the swimmer hadn’t improved because of her own diligent efforts, but because of help from her husband.\nFive years have passed since then, the situation doesn’t seem to have improved very much, as can be seen from “The Girls Who Hit Goals,” a program about women’s soccer on SBS, another major Korean broadcaster. When Myeong Seo-hyeon aggressively breaks through the defense and goes on the attack, announcers Bae Seong-jae and Lee Su-geun said, “She must have learned that from her husband,” referring to famous soccer player Jong Tae-se. They said the same thing about Shim Ha-eun — wife of retired football player Lee Chun-soo — when she made a good kick.\nForegrounding a man’s help over the woman’s individual effort naturally undervalues the time she spent improving her skills.\nSports has always been a series of attempts to overcome one’s own limitations and the eyes of the world. But female athletes have had to fight against even more prejudices and restrictions simply because of their gender.\nAlong with faithfully recounting female athletes’ lonely struggle to change this reality, the documentary eloquently conveys the importance of gender equality in sports — a goal that remains unachieved.\nThe documentary offers a montage of clips that make its purpose clear. The montage begins with a clip of Park Bong-sik, the first woman to represent Korea in the Olympic Games, in London, in 1948.\nThe final clip shows An San, a Korean archer who won three gold medals in this year’s games. Despite that splendid achievement, An has faced harassment online by people prying into her politics and trying to figure out if she’s a feminist based on her hairstyle and the fact that she wears a badge to honor the memory of the victims of the Sewol ferry accident.\nA website set up to figure out women’s feminist leaningsOn the very day that KBS aired the documentary about the national team, a certain website triggered a controversy online.\nUnfortunately, it’s already routine for celebrities to be subjected to ideological scrutiny and asked to declare whether or not they’re feminists because of their words, actions, clothing, hairstyle, and reading choices. Now, for the first time, a website has been set up for that explicit purpose.\nThis crude website, whose founder claims to be a man in his twenties, gauges the feminist status of famous people in various jobs — including singers, actors, announcers, politicians, and writers — under arbitrary criteria and labels them as “suspected,” “confirmed,” or “vanguard.”\nI’m not going to write the name of the website here because I don’t want to give its founder the satisfaction of getting attention.\nThis is a time when even athletes who pinned the Korean flag onto their chest for the Olympics can’t dodge cyberbullying, ideological prying, and unwelcome comments about their physical appearance. And now, a self-styled feminist detector is scoring people’s ideology on an arbitrary scale, egging on a witch hunt and even more harassment online.\nPerhaps these two incidents on Aug. 12 offer the best explanation of why we all need feminism. We need it so that people’s efforts and achievements aren’t judged differently according to their gender and so that we can all be treated with human dignity.\nBy Lee Seung-han, TV columnist\nPlease direct comments or questions to [english@hani.co.kr]\n광고\n- [Column] Moment of truth: What the Epstein files really show us\n- [Editorial] Coupang’s lobbying in US won’t win back Korean customer base\n- [Column] Today’s diverging paths of human virtue, hegemony and tyranny\n- [Column] As South Korea profits from arms, North Korea pays in lives\n- [Column] Trump loses steam, Takaichi gains momentum — where does that leave Korea?\n- [Column] Back to the bad old pre‑WWII days\n- [Guest essay] Will humans be crushed by the AI tide, or carried by it?\n- [Guest essay] UNC is not the boss here — Korea needs to say so\n- [Column] Bond warfare threatens mutually assured destruction\n- [Column] How North Korea’s upcoming party congress could change history\n- 1In Korea, Filipino home helpers are expected to do double duty for half the pay\n- 2[Column] Today’s diverging paths of human virtue, hegemony and tyranny\n- 3Ex-interior minister knowingly advanced unconstitutional martial law plot, court rules\n- 4Coupang asks for US attorneys to ‘sit in on’ Korean government probe over Zoom\n- 5South Korea reviewing charter of Trump’s ‘Board of Peace’ as it weighs membership\n- 6US acknowledges Korea’s investment process differs from Japan’s, says Foreign Ministry\n- 7Snowboarder Choi Ga-on pulls off stellar comeback to win Korea’s first Olympic gold in snow event\n- 8Former bodyguard’s dark tale of marriage to Samsung royalty\n- 9[Column] Trump loses steam, Takaichi gains momentum — where does that leave Korea?\n- 10US spearheads critical minerals trade bloc to check China’s dominance",
  "word_count": 1504,
  "scraped_at": "2026-02-14T12:44:34.864644"
}