{
  "article_id": "1bb4e9fbc169",
  "url": "https://weaintgotnohistory.sbnation.com/chelsea-fc-women/2024/4/27/24141507/chelsea-vs-barcelona-femeni-uefa-womens-champions-league-semifinal-preview-team-news-how-to-watch",
  "title": "Chelsea vs . Barcelona , UWCL semifinal : Preview , team news , how to watch",
  "date": "20240427T074500Z",
  "domain": "weaintgotnohistory.sbnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Chelsea made history last week in Barcelona, beating the heretofore invincible locals thanks to some heroic defending and a lovely goal from Erin Cuthbert: a captain’s goal to write herself even further into Chelsea history. It was the first home game Barca had lost in five years, and the first in six years in which they failed to score.\nChelsea FCW vs. Barcelona Femení, UEFA Women’s Champions League semifinal: Preview, team news, how to watch\nHistory beckons\nBut the job is not done.\nBarcelona will not go quietly. The shock of last weekend will surely only further inspire their collection of ridiculously talented footballers, to reach their fourth Champions League final in a row.\nBut if we’re talking history, there’s plenty that beckons outgoing Chelsea manager Emma Hayes, in what will be her last match at Stamford Bridge. A sold-out Bridge will be ready to bear witness. Time to make history.\n“We’re ready, we want to be in this position, and I look forward to the crowd helping us because we need them tomorrow.”\n-Emma Hayes; source: Chelsea FC\nDate / Time: Saturday, April 27, 2024, 17.30 BST; 12:30pm EDT; 10pm IST\nVenue: Stamford Bridge, SW6\nReferee: Iuliana Demetrescu (on pitch); Ovidiu Hategan (VAR)\nForecast: Rainy\nChelsea team news: Injuries and Chelsea are practically synonymous these days in the wide world of football, but there’s some good news here for Hayes & Co, with Millie Bright, Nathalie Björn, and Maren Mjelde all back in contention to help reinforce the defense. I don’t imagine any of them would make their long-awaited comebacks with a start against this Barcelona team, but perhaps they can help close out a potential win late on.\nUp front, we’re still missing striker Sam Kerr and Mia Fishel, but Mayra Ramírez is proving a handful who can often only be stopped through illegal means. Now if only the referees would start calling all the fouls on her...\nRegardless of who plays or what sort of plan Hayes crafts for this massive game, we’re going to have to be nothing short of perfect.\n“Barcelona can hurt you in so many different ways that for us as a team we have to be so, so mindful that you cannot switch off for one single second ... We know we have to be perfect to be able to progress.”\n-Emma Hayes; source: UEFA\nBarcelona team news: Unlike Chelsea, Barcelona had a match midweek, but a fully rotated squad made quick work, away, of relegation-threatened Levante. Most of the usual starters didn’t even travel.\nTheir full focus has been on this second leg since the final whistle of the first, and they will bring the full and fit and merciless might of their squad to bear upon us.\n“I have full confidence that we will go there to win the game — something we are used to doing.”\n-Jonatan Giráldez; source: The Athletic\nPreviously: History was made in Barcelona.",
  "word_count": 488,
  "scraped_at": "2026-02-14T12:52:32.126103"
}