{
  "article_id": "1bb738f7901a",
  "url": "https://www.theguardian.com/environment/2024/apr/23/mother-trees-and-socialist-forests-is-the-wood-wide-web-a-fantasy",
  "title": "Mother trees and socialist forests : is the  wood - wide web  a fantasy ? | Trees and forests",
  "date": "20240423T050000Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "There are a lot of humans. Teeming is perhaps an unkind word, but when 8 billion people cram themselves on to a planet that, three centuries before, held less than a tenth of that number, it seems apt. Eight billion hot-breathed individuals, downloading apps and piling into buses and shoving their plasticky waste into bins – it is a stupefying and occasionally sickening thought.\nAnd yet, humans are not Earth’s chief occupants. Trees are. There are three trillion of them, with a collective biomass thousands of times that of humanity. But although they are the preponderant beings on Earth – outnumbering us by nearly 400 to one – they’re easy to miss. Show someone a photograph of a forest with a doe peeking out from behind a maple and ask what they see. “A deer,” they’ll triumphantly exclaim, as if the green matter occupying most of the frame were mere scenery. “Plant blindness” is the name for this. It describes the many who can confidently distinguish hybrid dog breeds – chiweenies, cavapoos, pomskies – yet cannot identify an apple tree.\nAdmittedly, trees do not draw our attention. Apart from plopping the occasional fruit upon the head of a pondering physicist, they achieve little that is of narrative interest. They are “sessile” – the botanist’s term meaning incapable of locomotion. Books about trees often have a sessile quality, too; they are informative yet aimless affairs, heavy on serenity, light on plot.\nOr, at least, they were until recently. The German forester Peter Wohlleben’s surprise bestseller, The Hidden Life of Trees (published in English in 2016), has inaugurated a new tree discourse, which sees them not as inert objects but intelligent subjects. Trees have thoughts and desires, Wohlleben writes, and they converse via fungi that connect their roots “like fibre-optic internet cables”. The same idea pervades The Overstory, Richard Powers’ celebrated 2018 novel, in which a forest scientist upends her field by demonstrating that fungal connections “link trees into gigantic, smart communities”.\nBoth books share an unlikely source. In 1997, a young Canadian forest ecologist named Suzanne Simard (the model for Powers’ character) published with five co-authors a study in Nature describing resources passing between trees, apparently via fungi. Trees don’t just supply sugars to each other, Simard has further argued; they can also transmit distress signals, and they shunt resources to neighbours in need. “We used to believe that trees competed with each other,” explains a football coach on the US hit television show Ted Lasso. But thanks to “Suzanne Simard’s fieldwork”, he continues, “we now realise that the forest is a socialist community”.\nThe idea of trees as intelligent and cooperative has moved swiftly from research articles to “did you know?” cocktail chatter to children’s book fare. There is more botanical revisionism to come. “We are standing at the precipice of a new understanding of plant life,” the journalist Zoë Schlanger writes. Her captivating new book, The Light Eaters, describes a set of researchers studying plant sensing and behaviour, who have come to regard their subjects as conscious. Just as artificial intelligence champions note that neural networks, despite lacking actual neurons, can nevertheless perform strikingly brain-like functions, some botanists conjure notions of vegetal intelligence.\nThis is an age of many minds, it would seem. Oddly, it took grappling with new technology – the internet, artificial intelligence – for us to see intellectual capacities in our oldest companions, trees. In this new light, they appear much more like us, or perhaps us as we would wish to be. There is a form of redemption on offer: having for centuries treated trees as timber, we are now invited to embrace them as kin.\nBut before enfolding their rough barks in our soft arms, it may do to pause a beat. Whereas researchers must usually toil in respectable obscurity for decades before their ideas attract notice, the intelligent-plant notion is moving at top speed. Public demand, as much as peer review, is driving the train, with popular books reporting excitedly on studies that scientists are still debating – sometimes outracing the science entirely. It’s worth asking what makes us so eager to ascribe human qualities to the arboreal world. Might we be missing something important when we gaze into the wooden mirror and see only ourselves?\nThe title of Simard’s 1997 Nature article was almost impeccably dry – “Net transfer of carbon between ectomycorrhizal tree species in the field” – and a casual observer might have missed the study’s significance. Botanists have long understood that fungi called mycorrhizae formed symbiotic relationships with trees, exchanging water and nutrients for photosynthesised sugars. What Simard and her co-authors showed is that the sugars made their way not just to the fungi but to other trees in the forest, seemingly travelling through the fungi. The journal’s editors sensed promise. They made it Nature’s cover story, commissioned a foreword by a leading botanist, and affixed an indelible pun: this was the “wood-wide web”.\nIt wasn’t Simard’s metaphor, but she has pounced on it. The forest, she has written, is “like the internet”: a system of “centres and satellites, where the old trees were the biggest communication hubs and the smaller ones the less busy nodes, with messages transmitting back and forth through the fungal links”. Rather than rivals scrabbling over resources, connected trees are what Simard calls “supercooperators”.\nSimard’s fellow foresters were initially unmoved by her idea of the harmonious forest. Simard describes, after publishing, having her government research budget threatened and her findings mocked. “No other animal closes ranks faster than Homo sapiens,” Powers wrote in his fictionalised account of the episode. But the problem wasn’t the whole species so much as its male members, in Simard’s telling. “Miss Birch” is what the men called her within earshot – just a Scrabble tile away from what they called her outside it.\nMuch-needed support came from women. Simard has singled out the mycorrhiza expert Melanie Jones, who sat on Simard’s doctoral committee and co-authored the Nature article, and several female companions who accompanied her on her research. All this suggested another metaphor to Simard: maternity. Although the conifers she studied had both male and female organs, the way mature trees aided seedlings via fungal networks “felt like mothering to me”. She imagined “the flow of energy from the Mother Trees as powerful as the ocean tide, as strong as the sun’s rays, as irrepressible as the wind in the mountains, as unstoppable as a mother protecting her child”.\nThere has been, indeed, something unstoppable about the idea of networked mother trees. In her memoir, Finding the Mother Tree, Simard writes that her ideas inspired James Cameron’s 2009 film Avatar, in which all forest life connects via a biological network to large trees (the film also features an ecologically sensitive female scientist). It is unclear how much Cameron, who was already at work on Avatar before the “wood-wide web” paper appeared, knew of Simard’s research. Still, the resemblance between her theory and Cameron’s fantasy – in what somehow remains the highest-grossing film in history – attests to the idea’s exquisite zeitgeistiness.\nThe idea became even more zeitgeisty in 2016, the year of the Brexit vote and Donald Trump’s election. That was when Simard gave her much-watched Ted Talk, How Trees Talk to Each Other (approaching 8m views), and appeared with Wohlleben in the documentary Intelligent Trees. It was also when Wohlleben’s phenomenally popular Hidden Life of Trees was published in English, with an appreciative afterword by Simard. Wohlleben, who cannot pass by a tree without attributing human qualities to it, described trees as learning, disciplining their offspring and forming powerful friendships. Simard’s research, he explained, revealed their “maternal instincts … You might even say they are nursing their babies.”\nWohlleben’s book has sold more than 3m copies in more than 35 editions. Powers’ The Overstory, featuring its Simardian character, won the 2019 Pulitzer prize for fiction. This year, Time magazine named Simard one of the world’s 100 most influential people. Amy Adams’ and Jake Gyllenhaal’s production companies have bought the film rights to Simard’s Finding the Mother Tree, with the intention that Adams would play Simard.\nIt is rare for academic ideas to reach the Amy Adams stage without drawing scholarly fire. Since 2023, three articles have appeared in scientific journals, with 45 authors in all, arguing that the claims made on behalf of the wood-wide web have far outstripped the evidence. The objections are numerous. Many studies of inter-tree transfers have found only minuscule amounts of sugars shuttling between the trees – “statistically significant” but not necessarily “biologically significant”, one group of authors says – and most don’t rule out the possibility that the resources travelled through the air or soil rather than fungally. Despite Wohlleben’s insistence in Hidden Life that in a mycorrhizally conjoined forest “it is not possible for trees to grow too close to each other”, studies have not generally shown that seedlings ensconced in fungal networks do better when close to older trees (they often do worse). And although many trees are colonised by mycorrhizae, there is debate about whether those mycorrhizae actually form a durable network through which nutrients and signals could pass.\nNature, the original venue for Simard’s research, recently ran an explosive news feature by Aisling Irwin on the “groundswell of unease” among ecologists with public discussions of mycorrhizal networks. Irwin reports on the scientists’ general scepticism and on a particular episode that has raised concerns. In her memoirs, Simard makes much of the idea that “mother trees” favour their kin. She describes in detail field research by her graduate student showing that seedlings placed in a fungal network “survived better and were noticeably bigger” if they were genetically related to nearby older trees. But that field study, the critics have noted, actually showed the opposite: the related seedlings were likelier to die, though the trend was not statistically significant. (Simard says that other studies by the student, from the laboratory, support her claims and she’d merely made a narrative choice to describe the results as emanating from the forest. “I do not, and would never, imply anything misleading when presenting research,” she told Irwin.)\nWhat makes the recent criticisms of Simard’s work so striking is that some come from her former colleagues and admirers. The first critical review of evidence was by three scientists – Justine Karst, Melanie Jones and Jason Hoeksema – who had all co-authored papers with Simard. The lead author, Karst, has discussed how she was inspired by Simard’s research to become a mycorrhizal ecologist. The second, Melanie Jones, appears in Simard’s memoirs as a hero who supported Simard when few others would. Jones co-authored the 1997 “wood-wide web” article, though she no longer stands fully by it. It was the cultural obsession with intelligent trees, from television shows to airport books, that impelled Karst, Jones and Hoeksema to reconsider their own earlier work.\nSimard, who is preparing detailed replies, regards these in-the-weeds debates as distracting from the urgent task of protecting forests. She has described the attention that Karst, Jones and Hoeksema’s criticisms have received as “an injustice to the whole world”. Perhaps, but it is exceedingly hard to read the recent reviews of evidence and retain faith in the wood-wide web as settled scientific fact.\n“Why do we so badly want this to be true?” Karst has asked. Maybe the unrelenting news of global warming and its attendant catastrophes – wildfires, hurricanes – has driven readers for respite toward calmer environmental stories. Or perhaps recent political cruelties have led us to seek reassurance that, in nature, beings are thoughtful and kind. The connective aspect seems important, too, as if trees’ fungal friendships could release us from our phone-checking isolation. Fairly or not, we’ve loaded our aspirations on to the forest: be the tree you want to see in the world.\nThe literary scholar Rob Nixon sees the wood-wide web as an economic parable. Most often, he notes, popular understandings of nature connect to politics, as people look to the natural order to legitimate the social one. In the 1970s, when free markets were gaining support, books like Richard Dawkins’s The Selfish Gene (1976) highlighting capitalist dynamics in nature won large audiences. If you see society as fundamentally competitive, you’re primed to see biology that way, too. But since the 2007-8 financial crash, Nixon explains, prevailing economic instincts have tilted in the other direction. It’s satisfying, for the leftishly inclined, to imagine connected forests as what Wohlleben calls “gigantic redistribution mechanisms”.\nThe wood-wide web narrative, Nixon believes, transcends science. Beyond the peer-reviewed research, there is something about the concept that, to many, just feels instinctively right. It gives us the trees for our times: anti-capitalist, feminist and extremely online.\nThe Hidden Life of Trees is the title of Peter Wohlleben’s book. This must not be confused with The Secret Life of Trees, by Colin Tudge, which also tells the mycorrhizal story. Nor should either be confused with The Secret Forest, the book that the Suzanne Simard character writes in The Overstory.\nSuch titles are just one or two words away from the title of the most notorious botany book ever written: The Secret Life of Plants, a 1973 bestseller by Peter Tompkins and Christopher Bird. That book, like Wohlleben’s, rejected the idea of plants as “senseless automata” and sought to portray them as perceptive, energetic and intelligent. Plants, like animals, transmit electrical pulses through their bodies. Such pulses, Tompkins and Bird believed, could reveal plants’ thoughts.\nA series of wild experiments ensued, which can serve as a reminder both of the importance of peer review and of how fun the 1970s were. If people had sex on holiday, would their plants back at home know? All it took to find out was a begonia, electrodes and a lakeside cottage. “Chapter 1: Plants and ESP,” was the book’s auspicious beginning, and from there matters moved swiftly on to energy fields, faster-than-light communication and aliens.\nThe book inaugurated an odd era of people talking to their houseplants and playing them classical music. The CIA and US army funded research into vegetal perception (plants could be deployed in airports to detect the “turbulent emotions” of would-be hijackers, Tompkins and Bird suggested). Stevie Wonder, fresh off an extraordinary streak of innovative hit albums, infuriated his label by releasing a double LP titled Stevie Wonder’s Journey Through the Secret Life of Plants. “Most felt it was mad to conceive,” he sang, “that plants thought, felt and moved quite like we.”\nIt was not Wonder’s finest lyric, and, in hindsight, the whole episode seems fairly preposterous – the intellectual counterpart to the age’s waterbeds and extra-wide neckties. After the plant-talking fad receded, Tompkins moved on to his next enthusiasm: finding the lost land of Atlantis. But The Secret Life of Plants hung heavily over botany for decades as an admonition against excess. Research on plant sensation and reaction was hindered. “The twin gatekeepers of science funding boards and peer review boards – always conservative institutions – closed the doors,” Zoë Schlanger writes.\nThis was unfortunate, Schlanger feels, because plants really are capable of remarkable things. Alongside the wood-wide web idea has come a surge of new plant writing, including Monica Gagliano’s Thus Spoke the Plant (foreword by Suzanne Simard), Paco Calvo and Natalie Lawrence’s Planta Sapiens, Daniel Chamovitz’s What a Plant Knows and Stefano Mancuso’s The Revolutionary Genius of Plants, all chronicling uncanny plant behaviour. Maybe The Secret Life of Plants, absurd in its particulars, nevertheless got the general idea right.\nSchlanger describes today’s plant scientists as walking a fine line. They want to tout their findings but understandably fear overdoing it. For many, to speak of “plant sensing” is all right, but “plant behaviour” is iffy, “plant intelligence” is treacherous and “plant consciousness” is the sky falling. The anthropologist Natasha Myers has reported a “wavering between enchantment and disenchantment” among botanists. Among themselves, they speak animatedly of plants’ desires, but when they publish they “remove all reference to the plants as active agents”.\nAnd yet they move. Most plants do so slowly in the expected ways – leaves reaching for light, roots for moisture – but some, like climbing vines, move with unexpected agility. Viewed in real time, vines are innocently immobile. Sped up via time-lapse photography, they become tiny, nefarious krakens, their tendrils methodically probing for targets to latch on to.\nThe most intriguing research concerns dodder vines, which cannot photosynthesise and thus must quickly find other plants to parasitise. Researchers have found that they can detect qualities of potential hosts – species, distance, even health – before making contact, and they aim toward the best prey, such as tomato plants. They can pick up chemical trails in the air, and they will even grow more toward LED lights that are arranged in the shape of suitable hosts, suggesting that the vines’ light-sensing abilities may amount to a rudimentary form of sight.\nWith time-lapse videos, we can see vines sensing and reacting. Most other plants’ behaviour is invisible. Vines aside, plants are pitiful athletes, but they are often quite gifted chemists, exhaling and secreting sophisticated compounds to entice, repel or poison their neighbours. Trees excel here. The woodsy sweetness of balsam trees, the tang of pines: these are not perfumes but chemical weapons deployed in an interspecies war. They are insecticides, and there is something softly psychotic in how much we delight in their smells.\nInterestingly, trees can smell themselves, or at least detect their own airborne chemical compounds. A leaf, being eaten, can emit gases that prompt other branches – and other nearby trees – to defensively fill their own leaves with toxins. It is well known that acacias secrete sugars and proteins to recruit ants as foot soldiers in their campaign against vines and caterpillars. If trees do communicate underground, I like to think of them swearing like sailors while, rooted in place, they fend off waves of piratical attackers.\nProponents of plant sentience have a favourite plant, the boquila vine, which grows in Chilean and Argentine rainforests. In 2013, the ecologist Ernesto Gianoli realised that the boquila could convincingly imitate other plant species. It hides from its harassers, such as snails and beetles, by matching the shape, size and colour of its leaves to those of its neighbours. Gianoli notes that it can mimic plants that haven’t formed part of its evolutionary history, which would seem to indicate it somehow senses their forms in real time. The boquila is hard to grow outside its native environment, so research is slow. Still, boquila enthusiasts (including Wohlleben, in an over-oxygenated sequel to Hidden Life) have made much of a man in Utah who appears to have induced one to imitate a plastic plant on his windowsill.\nFor bolder botanists, such findings reopen the old question of whether plants can think. Plants lack brains – traditionally felt to be a prerequisite for intelligence – but, then again, so do computers. With chatbots showing what can be achieved by neural networks, it might be time to reconsider plants. Perhaps they also have what Stefano Mancuso calls “distributed intelligence”, with the root system acting as “a sort of collective brain”.\nThe ethical implications are exhausting. Taking plants’ moral standing seriously throws even veganism into disarray. “If plants also have sentience,” the philosopher Philip Goff asks, “what is there left to eat?” Still, the argument for plant consciousness is straightforward and emphatic: just look what they can do. Surely, by the time a vine is strategically transforming its body to mimic a plastic houseplant’s, it crossed the consciousness threshold long ago.\nThere is, however, a counterargument: the spinal cord of a rat. Sever a rat’s spinal cord from its brain (pausing to contemplate the chain of choices that brought you to this act), and you will find that the isolated spinal cord can still direct affairs with surprising competence. It can retract the legs when they receive electric shocks. It can, more impressively, learn to anticipate shocks and direct the legs to avoid them. It is capable of more sophisticated forms of learning than any plant has been shown to be. But is a rat’s spinal cord conscious?\nConsciousness is frustratingly hard to define. Perhaps it inheres in many things, even parts of things. Or perhaps evolutionary forces can programme sophisticated behaviours – flexible and sensitive to environmental cues – that nonetheless operate without the special spark that signifies intelligent life. Reasonable, well-informed people disagree wildly about where to draw the line, from the panpsychists who regard atoms as conscious (in a limited way) to the conservatives who have questions about chimpanzees.\nThe only beings whose consciousness we agree on are humans. Beyond them, we judge candidates on whether they seem to have subjectivities like ours. In other words, the question of consciousness is fundamentally narcissistic; things merit esteem to the degree that they remind us of ourselves. This is the implicit premise of many plant and tree books, with their chorus line of mother trees, socialist fungi and cunning vines performing high kicks for human approval. But is it the best way to think about nature? As Justine Karst put it to me, “Do we not have the capacity to love and care for things that are not like us?”\nTrees are, ultimately, not like us. They have torsos, limbs and crowns, and we often personify them as benevolent helpers. But stray from the forest path or let the sun go down, and their weird, sinister qualities soon emerge. It is the dark woods – “savage, rough and stern” – that lead to the underworld in Dante’s Inferno. The same dark woods, per peasant lore, teem with witches, wolves and unsupervised German children. The numerous tales about perilous forests appeal to a deep-seated sense that there is something unsettling about trees. They are a familiar sight but an alien presence.\nOne source of their strangeness is their size. As saplings they match our height and meet our gaze, but they continue to grow, some higher than humans can comfortably apprehend. The ecologist Meg Lowman describes the treetops as a still-unexplored “eighth continent”. The tallest trees, the redwoods of northern California, contain whole environments in their canopies. There are grasses, ferns, aquatic crustaceans and, indeed, other trees up there, unsullied by the earth, inhabiting the redwoods’ sky worlds.\nThe California redwoods are the tallest life forms on Earth. The biggest exceeds 115 metres: essentially the length of a large football pitch, but straight up. They are “so huge that they shut you up”, writes Anne Lamott. The redwoods famously appear in Alfred Hitchcock’s masterpiece Vertigo. But they appear there only in part. It was virtually impossible for Hitchcock to fully capture both his actors and the trees in the same shot without making the actors appear ludicrously small, so he cropped out all but the bases of the massive trees.\nThe philosopher George Santayana, born in Madrid, visited those redwoods in 1911. He found northern California “intellectually emptier than the Sahara” but was awed by its “virgin and prodigious” landscape. The place was a standing chastisement to European philosophy, Santayana felt. It taught “the vanity and superficiality of all logic, the needlessness of argument”. In such an environment, he reflected, you can no longer feel that nature is yours to command: “You must feel, rather, that you are an offshoot of her life; one brave little force among her immense forces.”\nTrees attain more-than-human scales not only in metres, but in years. They are the only organisms in view that conspicuously outlive us, and some do so by multiple orders of magnitude. We usually last for decades; trees can last millennia. Such trees are not timeless but “timeful”, the historian Jared Farmer writes in his poignant book Elderflora: A Modern History of Ancient Trees. They contribute “chronodiversity” to a biological world otherwise measured in days, years and decades.\nOld trees, like roots bulging through the pavement, unbalance our sense of time. In Manhattan’s Washington Square Park, surrounded by New York University’s buildings, the Hangman’s Elm protrudes as an eerie relic from the 17th century and a stern warning to the undergraduates. As long-lived trees go, that elm is not especially impressive. The UK has yews that are, literally, ancient, in that they date to antiquity and are thousands of years old. The oldest known tree, a bristlecone pine in California, is about five millennia old, meaning that it was a sapling in the bronze age. (There is a tree in Chile that might be older. And a few trees can create physically connected, genetically identical copies of themselves; these clonal trees “live,” in the sense of carrying on in replica form, even longer.) Caring for the environment, Farmer believes, will require learning to “think in the fullness of tree time”.\nTree time, however, appears to be running out. In 2005, scientists set out to examine the largest African baobabs: massively thick trees that don’t have just one stem, like most trees, but multiple, fused together. The most famous, Chapman’s Baobab in Botswana, has six stems that range from about 500 to 1,400 years old. Or, it had six stems. On 7 January 2016, the whole thing tumbled over. Two years later, the researchers announced that nine of the 13 oldest baobabs, or at least their largest or oldest stems, had collapsed since the study started.\nOther long-lived trees – the cedars of Lebanon, the California redwood – are also perishing. The culprit is probably the obvious suspect: climate change. Trees equipped to survive in a place do poorly when the qualities of that place, such as temperature, water supply and length of seasons, change drastically. With time, tree species could adapt or find new habitats. The problem is just that arboreal evolution and migration are painfully slow, and global heating is painfully fast.\nA tree, Farmer writes, is “a radically nonhuman thing”, and a large, old tree is especially one. If trees have conceptual value, it is not because their similarity to us elicits our sympathy, but because their difference from us enlarges our horizons. They are the most visible markers on the evolutionary road not taken. Trees stand in for all the photosynthesising, carbon-dioxide breathing, fixed-in-place species that share our world yet have fundamentally different ways of living in it.\nContemplating trees should be, above all, an exercise in humility. The mountains and woods, Santayana told his California audience, allow you to “take yourselves simply, humbly, for what you are, and to salute the wild, indifferent, non-censorious infinity of nature”. Perhaps the presence of beings older, larger and more numerous than we are – whether or not they resemble internet users or our mothers – can be a reminder that we are not everything, and that everything is not us. “Let us therefore be frankly human,” Santayana enjoined. And let the trees be trees.",
  "word_count": 4482,
  "scraped_at": "2026-02-14T13:14:01.922778"
}