{
  "article_id": "1bbc812aa13a",
  "url": "https://www.theguardian.com/business/article/2024/jul/13/beacon-hope-england-euros-pubs-vital-lift-spain",
  "title": "  A beacon of hope : England Euros success gives pubs a vital lift | Hospitality industry",
  "date": "20240713T071500Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Culture lovers flocked to the Hockley Social Club this year to marvel at the Birmingham Royal Ballet performing highlights from Tchaikovsky’s Sleeping Beauty. On Sunday, it will be the balletic grace of local lad Jude Bellingham that awakens the spirits of 1,000 football fans gathering to watch England battle Spain in the Euro 2024 final.\nThe success of the Three Lions heralds a badly needed money-spinner for the venue, one that is particularly poignant because it came courtesy of a last-minute winner from another Birmingham hero, Aston Villa’s Ollie Watkins.\n“We were booked up within minutes of the final whistle going,” says Jack Brabant, a Villa fan and director of the social club and its sister venue, Digbeth Dining Club. “It was a flood, we were just watching the ticker going up and we had to close off bookings completely.”\nThe British Beer & Pubs Association (BBPA) has estimated that Gareth Southgate’s men reaching the final means British bar staff will pull 10m extra pints, worth £48m. The broader hospitality sector stands to enjoy a boost of between £700m and £800m across the whole of the tournament, according to the trade body UK Hospitality.\nThe upper end of the estimate is dependent on good weather and an England victory that would see fans take full advantage of government-approved late licensing, until 1am. That is why the final is “more than just a match; it is a beacon of hope”, according to the chief executive of the Night Time Industries Association, Michael Kill.\nThe hospitality sector has had a rough time over the past four years, starting with the Covid-19 pandemic, which forced pubs, bars and clubs to shut their doors for weeks at a time. Successive blows have choked off the sector’s recovery, with more than 500 pubs closing for good in 2023.\nNow, Euro 2024 offers the biggest tournament takings boost since the 2018 World Cup. Covid restrictions were still in place for Euro 2020 [held in 2021] while Qatar 2022 was staged in winter, cannibalising pre-Christmas sales, and matches mostly kicked off during the day.\n“I can’t emphasis how important this is,” says Duncan Sambrook, managing director of Sambrook’s Brewery, which will be screening the final on five giants screens at its taproom in London’s Wandsworth. “It’s all been doom and gloom in our industry, one crisis after another. Staffing crisis, followed by energy crisis, followed by the cost of living crisis.”\nEngland’s success has come just when the sector needs it most, particularly given the poor summer weather so far. Sambrook’s takings on Wednesday, during the semi-final, were four times what they would normally be. Sunday’s surge could be even bigger on what would normally be a relatively quiet night.\nThe taproom has arranged its seating to create a “stadium feel” and staff – in more than twice their normal numbers – will be wearing specially made shirts with their names on the back, emulating the sporting stars on the screen.\nExtra brewing began weeks ago, to ensure that the taps wouldn’t run dry if England – or in theory Scotland – made it to the latter stages.\nKate Nicholls, chief executive of UK Hospitality, says the average sales uplift across the sector had been 30% on match days in the group stages but has since accelerated to 40%.\nShe is hoping the sporting party will last beyond the tournament. “People are marketing it as a summer of sport. Yes you’ve got the Euros but on the back of that people are coming in to watch the cricket and lots of pubs are advertising the Olympics.”\nThe sport-loving crowd has diversified too, with the triumphs of England’s women’s team broadening the customer base. The audience for the Lionesses, says Nicholls, brought in more extra revenue than the Six Nations rugby tournament.\nAt Hockley Social Club, some of the ballet connoisseurs might even put in an appearance on Sunday.\n“The great thing about when teams do well is that it brings out the occasional fans, but they don’t necessarily want to be part of that beer-throwing laddish behaviour,” says Brabant.\nThe venue has even married culture with football, with musicians from Birmingham Symphony Orchestra playing pieces including Nessun Dorma, the soundtrack to England’s agonising semi-final defeat at Italia 90.\nLike the title of Puccini’s aria, the hospitality sector is hoping that, come Sunday, nobody will be sleeping.",
  "word_count": 729,
  "scraped_at": "2026-02-14T13:05:08.495794"
}