{
  "article_id": "1bcb31336342",
  "url": "https://news.yahoo.com/patrick-kane-derrick-rose-more-110000286.html",
  "title": "Patrick Kane , Derrick Rose and more : Nine No . 1 draft picks made by Chicago professional sports teams",
  "date": "20230626T114500Z",
  "domain": "news.yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Connor Bedard, Derrick Rose, Shawon Dunston and more: The 10 No. 1 draft picks made by Chicago’s pro sports teams\nWe’re No. 1!\nIt has been 10 years since a professional sports team in Chicago had the first draft pick, but the Blackhawks selected 17-year-old Canadian phenom Connor Bedard in the first round of the NHL draft in Nashville, Tenn. (The Bears did have the first pick for the first time in 77 years in April’s NFL draft but traded it to the Carolina Panthers.)\nBedard joins a short list of 10 athletes since 1940 who were selected at the top of their draft classes by Chicago teams.\nHere’s a look back at them and how they fared.\nBears: Tom Harmon\nDrafted: Dec. 10, 1940\nBears owner George Halas’ “astute handling of trades,” as the Tribune called it, gave the team three of the first 10 picks in the 1940 draft, including the top spot.\nHalas selected Harmon, a Gary native considered by many who covered college football — including the Tribune — to be its best player that year. When the Tribune awarded him its Silver Football trophy in early 1941, he said, “This moment is perhaps the happiest in my life.” That was just months after the Michigan running back became the school’s first Heisman Trophy winner.\nYet Harmon had his sights set elsewhere. Instead of signing a contract with the Bears, he signed one for $15,000 with Columbia Pictures — to star in a film called “Harmon of Michigan.”\nHarmon did play football in Chicago in 1941 but not for the Bears — before more than 98,000 fans at Soldier Field as part of the Chicago Tribune All-Star Charity Football Game.\nBears: Bob Fenimore\nDrafted: Dec. 16, 1946\nUnlike Harmon, Oklahoma A&M (now Oklahoma State) halfback “Blonde Bomber” Fenimore did sign with the Bears — but not before a trade was considered with the Buffalo Bisons of the All-America Football Conference. Trade talk was abandoned, however, after Bisons team doctors reported calcium spots on Fenimore’s injured knee.\nAs he prepared to play in the College All-Star Game in August 1947, Fenimore told reporters: “I don’t wear a knee brace. I should, but it slows me down. Every bit of speed counts, you know.” He wouldn’t participate in the game, however, because of the injury.\nHe played in 10 games for the Bears during the 1947 season but wrote a letter to Halas stating he would sit out the next season because of back and groin injuries incurred from exercising on a horse apparatus at a gym. He remained in Oklahoma, where he became an insurance salesman.\nBlackhawks: Patrick Kane\nDrafted: June 22, 2007\nThe Hawks won the NHL draft lottery in 2007. Instead of picking fifth, as the standings dictated, they garnered the first selection for the first time in franchise history.\nThe Hawks interviewed Kane, Kyle Turris and James van Riemsdyk several times in the weeks leading up to the draft in Columbus, Ohio. Of the three, only Kane said publicly that he wanted to play in the NHL the next season — Turris and van Riemsdyk wanted to play college hockey.\nThe Hawks selected Kane, a native of Buffalo, N.Y., with the No. 1 pick, and van Riemsdyk was chosen second by the Philadelphia Flyers, making it the first time the first two selections were U.S.-born players.\n“It’s unbelievable if you look at players who have gone No. 1,” Kane says. “(Vincent) Lecavalier, (Sidney) Crosby, (Alexander) Ovechkin all went No. 1, and they seem to be taking over the league.”\nThe Hawks front office hoped Kane’s selection — “a historic pick,” as general manager Dale Tallon called it — would become the future of the franchise sooner rather than later. Just hours before making the selection, Tallon cleared some payroll and picked up two young players by trading the team captain, often-injured veteran defenseman Adrian Aucoin, to the Calgary Flames.\n“We’re going to be a young team, so he will get every opportunity to play,” Tallon said after choosing Kane. “We’ll put him with good players and see what happens.”\nDuring his 16-year tenure with the Hawks, Kane won three Stanley Cups. His 1,225 points, 1,161 games and 67 game-winning goals rank second, third and fourth in franchise history, respectively. He was traded to the New York Rangers earlier this year and could become an unrestricted free agent July 1.\nBlackhawks: Connor Bedard\nDrafted: June 28, 2023\nThe Blackhawks took about a minute and a half once the clock started during the 2023 NHL draft to select Connor Bedard with the No. 1 pick, christening him as the “cornerstone” of their attempt to build the next Chicago sports dynasty.\nWith fans at Bridgestone Arena chanting, “Let’s go, Hawks,” general manager Kyle Davidson stepped onto the podium and said: “I’d like to say hi to all the Blackhawks fans back in Chicago, Blackhawks fans here today and Blackhawks fans watching around the world.\n“And with the first overall selection in the 2023 NHL draft, the Chicago Blackhawks are very proud to select, from the Regina Pats of the Western Hockey League, Connor Bedard.”\nNow Bedard goes from loads of potential to the “Chosen One” who needs to fulfill that promise.\nBulls: Elton Brand\nDrafted: June 30, 1999\nThen-Tribune columnist Skip Bayless said the Bulls should consider the top pick “more as a potentially tradable commodity than a cornerstone” during a draft class that had no clear favorite. That’s why he said the team should choose Rhode Island standout Lamar Odom.\nThe Bulls did the opposite. They chose the 6-foot-8, 275-pound Brand and established the 20-year-old power forward as the cornerstone of a rebuilding effort.\nBrand arrived in Chicago after two years at Duke — the first player to leave Mike Krzyzewski’s program early — where he earned national player of the year honors from seven outlets. He earned NBA Rookie of the Year and All-Rookie honors, then was traded two years later to the Los Angeles Clippers — where Odom was still on the roster.\nBulls: Derrick Rose\nDrafted: June 26, 2008\nThe 19-year-old Englewood native returned home. Rose led Simeon to back-to-back state titles, was named Mr. Basketball of Illinois in 2007 and was the point guard on a Memphis team that was runner-up in the NCAA Tournament.\n“Of course it’s going to be pressure,” Rose said via conference call from New York. “But I’m used to playing in Chicago, so I don’t think that will matter.\n“It means a lot to play at home. They had great players like Michael Jordan, Scottie Pippen, Dennis Rodman, all of them, B.J. Armstrong. Just knowing I can be a part of that history, it’s amazing. Playing there for the Bulls, I just can’t wait.”\nThe Bulls selected Rose over Kansas State power forward Michael Beasley, a player they liked so much that sources confirmed they made trade overtures to the Miami Heat for the second selection. Those were rebuffed, and the Bulls focused on Rose.\n“For us right now (Rose is) a perfect fit,” general manager John Paxson said. “He’s a very, very talented young man. In this league, point guards are really hard to find. He has a strength about him at that position that most guards don’t have in this league. Great burst, very fast with the ball.\n“I think he’ll make other players better. And he’ll give us some leadership abilities as we go on, which we really need.”\nLike Brand and Michael Jordan, Rose was named Rookie of the Year. He became the youngest MVP in NBA history at age 22 in 2011 and was named an All-Star three times. But injuries derailed his trajectory. Rose tore the ACL in his left knee on April 28, 2012, then had surgeries to repair torn right menisci in November 2013 and February 2015.\n“It may be simplistic to say Rose’s left ACL tear serves as the delineation for the too-good-to-be-true ascension for Rose and his subsequent falling out of favor. But it’s true,” Tribune reporter K.C. Johnson wrote when Rose was traded to the New York Knicks in 2016.\nCubs: Shawon Dunston\nDrafted: June 7, 1982\nDunston did not have an agent. The New York native never had been to Chicago and knew about Wrigley Field only from seeing it on television.\n“An old park but a nice one,” the 19-year-old shortstop said after the Cubs picked him.\nAfter seven seasons as the Cubs’ starting shortstop, which included two All-Star selections, Dunston missed most of the 1992 and ‘93 seasons after back surgery, then the final 49 games of the 1994 season because of the MLB players strike. All that waiting gave Dunston, whose contract with the Cubs was for one more season, plenty of time to think about his future.\n“I feel I want to sign one more contract and then go on,” he told the Tribune in February 1995. “I want to be with my wife and kids. People say it’s boring, but when you get away from your family two or three days, you miss them.”\nBut Ryne Sandberg’s return to the Cubs after the 1995 season meant Dunston’s exit. He became a free agent coming off a season in which he hit .296 with 14 home runs, 69 RBIs and 10 stolen bases. His batting average and RBI total were career highs for the 32-year-old. He signed with the San Francisco Giants but returned to the Cubs for a season in 1997.\nWhen asked how fans in the bleachers who kept a Shawon-O-Meter would go on without him, Dunston responded: “They move on, just like when (Greg) Maddux left and Andre Dawson left and Rick Sutcliffe left and everyone else left. I am no one special. They are going to remember me, don’t get me wrong. But it is not like I am the greatest Cub who ever played.”\nRed Stars: Zakiya Bywaters\nDrafted: Jan. 18, 2013\nThe Pac-12 Player of the Year at UCLA was the first draft pick in the NWSL, which started after the bankruptcy of the Women’s Professional Soccer League.\nBywaters scored two goals in six games her rookie year despite being sidelined for majority of the season. She scored two more goals in 19 games in 2014. Unfortunately, Bywaters would never recover fully from her injury and the Red Stars eventually waived her. Read more here.\nWhite Sox: Danny Goodwin\nDrafted: June 8, 1971\nIt wasn’t a surprise when the Sox took the 17-year-old catcher from Peoria — the team announced its decision a day before the draft. Yet it was a shock when the 6-foot-1 star chose to get a college education at Southern University in Louisiana — with the goal of becoming a dentist — instead of signing with the team. He was selected with the No. 1 pick again by the California Angels in 1975. Read more here.\nWhite Sox: Harold Baines\nDrafted: June 7, 1977\nSox owner Bill Veeck scouted the 6-2, 175-pound left-handed hitter himself — Baines lived near Veeck’s former home in Maryland.\n“He’s got good speed and he’s a natural hitter,” Veeck told the Tribune in 1977. “I saw him play in Little League, and he impressed me even then. I’ve been watching him for six years.”\nBaines made his major-league debut April 10, 1980, starting in right field in a 5-3 loss to the Baltimore Orioles at Comiskey Park, facing ace Jim Palmer and winding up 0-for-4. Veeck sold the team in 1981 to a group led by Jerry Reinsdorf, and Baines said he didn’t get to know the maverick owner who supposedly discovered him.\n“He was a nice man with no money,” Baines said. “I’m always thankful because he gave me my start. He took me over (Paul) Molitor and people like that. He didn’t have to do that.”\nAfter a couple of nondescript seasons, Baines came of age in 1982, hitting 25 home runs and driving in 105. The next season he helped lead the Sox to the American League West title, finishing 10th in AL Most Valuable Player voting.\nHe was in the prime of his career in 1989 when the Sox sent him to the Texas Rangers on July 29, along with infielder Fred Manrique, for a package of young players that included Sammy Sosa and Wilson Alvarez.\nThe deal upset many in the Sox clubhouse, including catcher Carlton Fisk.\n“Harold and Freddy, two major-leaguers for one,” Fisk said. “And not just a major-leaguer — Harold Baines. Harold Baines! You know what I mean? Harold Baines!”\nNo one knew at the time Sosa would go on to become one of the game’s most prolific home run hitters after being dealt to the Cubs. While running for president in 2000, former Rangers managing partner George W. Bush was asked during a GOP debate what the biggest mistake of his adult life had been.\n“I signed off on that wonderful transaction: Sammy Sosa for Harold Baines,” Bush cracked.\nBaines played 14 of his 22 seasons for the Sox in 1980-89, 1996-97 and 2000-01 and had 2,866 hits and 1,628 RBIs in his 22-year career.\nHe was emotional when a life-size bronze statue of his likeness — replete with right leg kick — was unveiled at Guaranteed Rate Field in 2008.\nThe six-time All-Star was elected to the Baseball Hall of Fame along with former Cubs closer Lee Smith via the Today’s Game Era ballot. The selection became a heavily debated topic. Baines and Smith joined Roy Halladay, Edgar Martinez, Mike Mussina and Mariano Rivera in the Hall’s Class of 2019.\n“When you see a guy like Hank Aaron and guys like that, and you’re in their midst, yeah, that’s very special,” Baines said of the Hall ceremony. “I never envisioned myself being on the same stage with a person like that. All of them, they all deserve to be there and it’s very special to be a part of that.”\nHe was inducted on July 21, 2019. Fellow Sox Hall of Famers Fisk, Tim Raines, Frank Thomas and Jim Thome were among those in attendance on Aug. 11, 2019, as the Sox honored the longtime outfielder and designated hitter’s induction and accomplishments.\nSources: Tribune reporting and archives; the teams; NWSL; NFL\nSubscribe to the free Vintage Chicago Tribune newsletter, join our Chicagoland history Facebook group and follow us on Instagram for more from Chicago’s past.\nTwitter @rumormill",
  "word_count": 2401,
  "scraped_at": "2026-02-14T13:24:38.727247"
}