{
  "article_id": "1bdef3bb44f9",
  "url": "https://www.newsday.com/news/nation/vatican-pope-leo-prevost-latest-y33314",
  "title": "The Latest : Pope Leo XIV celebrates his first Mass as pontiff a day after his election",
  "date": "20250509T151500Z",
  "domain": "newsday.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Latest: Pope Leo XIV celebrates his first Mass as pontiff a day after his election\nVATICAN CITY — Pope Leo XIV celebrated his first Mass on Friday, a day after his historic election as the first U.S.-born pope in the Catholic Church's 2,000-year history while congratulations poured in from world leaders and statesmen at the start of his papacy.\nOn Thursday, Cardinal Robert Prevost emerged onto the loggia of St. Peter’s Basilica at the Vatican, following the conclave and the appearance of white smoke from the Sistine Chapel chimney, signaling that a new pontiff has been chosen. His election overcame the traditional prohibition against a pope from the United States.\nLeo, a 69-year-old Chicago-born Augustinian missionary who spent his career ministering in Peru and took over the Vatican’s powerful office of bishops, wore the traditional red cape — which Pope Francis had eschewed on his election in 2013 — suggesting a return to some degree of rule-following after Francis’ unorthodox pontificate.\nLeo's first words to the crowds below — “Peace be with you” — emphasized a message of dialogue and missionary evangelization. He spoke to the crowd in Italian and Spanish, but not English.\nHere is the latest:\nUS cardinals celebrate to ‘Born in the U.S.A.’ and ‘American Pie’\nSpeakers blasted the songs as the U.S. electors shared their thoughts on the first U.S.-born pope, Cardinal Robert Prevost.\n“I took a look at Bob and he had his head in his hands and I was praying for him,” said Cardinal Joseph Tobin, describing the moment when he cast his vote in the Sistine Chapel. “And then when he accepted, it was like it was made for him.”\nThe cardinals met on a stage decorated with the Stars and Stripes and a Vatican flag at the Pontifical North American College.\nSome said Prevost’s U.S. nationality wasn’t a factor. They were most concerned with “who among us can bring us together, who among us can strengthen the faith and bring the faith to places where it has grown weak,” Cardinal Wilton Gregory said.\n▶ Read more about the American cardinals’ celebration\nDalai Lama, Mormon leaders send greetings\n“When the world is witnessing so many challenges, your election brings new hope not just to the Catholic community, but to people everywhere who are seeking a happier life in a more compassionate, peaceful world,” the Tibetan Buddhist leader wrote.\nThe Dalai Lama recalled meeting previous popes, reflecting his “firm belief in the oneness of humanity” and his commitment to “promoting inter-religious harmony.”\nThe leaders of The Church of Jesus Christ of Latter-day Saints wrote that “as fellow followers of Jesus Christ, we look forward to continued opportunities to work together to bless the lives of God’s children everywhere. May we strive to follow the example of Jesus Christ to care for the poor and needy, become peacemakers and create a world where faith and goodness can flourish.”\nRussian Orthodox Church leader notes ‘civilizational challenges’\nCongratulating Pope Leo XIV on his election, Patriarch Kirill said “You are beginning your ministry as the Primate of the Roman Catholic Church at a special historical moment, connected both with a number of civilizational challenges and with certain omens of hope.”\n“In this context, the relationship between the Christian East and West acquires special significance for the fate of the world,” he added.\nThe message cited by Russia’s state news agency RIA Novosti expressed hope that the relations between the Roman Catholic Church and the Russian Orthodox Church will “will progressively develop.”\nCardinal Reinhard Marx: ‘I can tell you, I am very happy’\nMarx, the archbishop of Munich and Freising and a progressive close to Pope Francis in his vision, would not speak of conclave discussions. But he said that before they were sequestered, small groups of cardinals would say, ”‘What about this one, what about that one?’”\nMarx took note of Prevost — an American with deep experience in Latin America, strong linguistic and cultural fluency, and a history of leadership as Superior General of the Augustinians. “That convinced me to say, this could be a possibility,” said Marx, adding that he was struck by the future pope’s temperament when they met last year.\n“We had a very good conversation,” Marx said. “I realized he’s a man who listens, takes arguments seriously, weighs them. You can’t just place him into one camp — he really tries to build bridges. I liked that very much.”\nPope Leo XIV's first foreign trip could be to Turkey\nHe's been invited at the end of May to travel to Turkey to commemorate the 1,700th anniversary of the First Council of Nicaea, a landmark event in Christian history and an important moment in Catholic-Orthodox relations.\nPresident Recep Tayyip Erdogan meanwhile sent a congratulatory letter expressing Turkey’s desire to strengthen ties with the Vatican to promote global tolerance and collaborate in addressing humanitarian crises, particularly in Gaza.\n“I am fully confident that the sincere and constructive dialogue established with Pope Francis will continue with you as well,” Erdogan wrote, according to a Friday statement from the Turkish president’s office.\nIs he a Cubs fan or a White Sox fan? Leo XIV’s brother sets it straight\nChicago’s two baseball teams demand fierce loyalties. Some early reports on the new pope's allegiances prompted extra celebrations on the city’s northside, where Wrigley Field’s iconic marquee announced “HEY, CHICAGO. HE’S A CUBS FAN!”\nBut his brother, John Prevost, set the record straight in an interview with WGN-TV: “He was never ever a Cubs fan, so I don’t know where that came from. He was always a Sox fan.”\n“Family always knows best,” the southside White Sox said. A jersey with his name on it is already on its way to Rome, “and of course, the Pontiff always is welcome at his ballpark,” the team statement said.\nAs for city’s long-suffering football team, one fan said the Bears now have a direct line to God. Another said the Bears won’t be on the wrong side of Hail Marys. Quarterback Caleb Williams could use that help. “Daaaaaa Pope,” he posted on X.\nChicago bishop: ‘Not just a hometown hero’\nChicagoans gathered Friday morning at Holy Name Cathedral to celebrate the election of native Chicagoan Pope Leo XIV.\nBishop Lawrence J. Sullivan, the vicar general of the Archdiocese of Chicago, celebrated the Mass. In his homily, Sullivan said they come to give thanks and pray for the new pope as he takes on the enormous task of leading the Catholic Church.\n“More importantly than celebrating a hometown hero, or far more important than celebrating the fact that we have our first pope from the United States,” Sullivan said. “The real celebration is that God has given us a shepherd.”\nPope wasn’t just Chicago-born — the city shaped him\nRobert Prevost was born in 1955 in the south side Chicago neighborhood of Bronzeville and grew up in suburban Dolton, where he attended Mass and elementary school at St. Mary of the Assumption, before studying theology at the Catholic Theological Union of Chicago in Hyde Park. He taught in local Catholic schools.\n“We are overjoyed that someone who is beloved and known to us is now the beloved leader of the whole entire church,” said Barbara Reid, a Dominican sister and president of the Catholic Theological Union.\nJohn Doughney, a fellow 1969 St. Mary’s grade school graduate, remembers Prevost as a “friend to everyone” and a “kind, caring, compassionate young man.”\n“Even when he was 12 and 13, it was apparent to all of us that he knew what his calling was,” he said. “It would’ve shocked all of us if he didn’t go into the priesthood. We’re so proud of him.”\nChicagoans hope Leo XIV continues the city’s history of social justice\n“For Catholic Chicagoans, to have a native son who has been born and raised in a city where support and care of all has always been central to who we are as a city, it really speaks volumes,” said Mary Perrotti, director of advancement at the city’s Frances Xavier Warde School. “I truly believe his upbringing in Chicago informs his ministries, his compassion and sense of justice.”\n“There’s tears of joy, of hope, of motivation to rise to this moment and leave this world better than we found it,” said Raul Raymundo, co-founder of a Chicago community advocacy group called the Resurrection Project.\nRaymundo, an immigrant from Mexico who grew up in Chicago’s Pilsen neighborhood, said he hopes Leo XIV will “continue Pope Francis’ legacy and Chicago’s legacy of social justice and compassion, especially in welcoming immigrants.”\n▶ Read more about Leo XIV’s Chicago roots\nLeo XIV’s brother expects him to be a ‘second Pope Francis’\nJohn Prevost described his brother as being very concerned for the poor and those who don’t have a voice.\n“He’s not going to be real far left and he’s not going to be real far right,” he told The Associated Press in an interview. “Kind of right down the middle.”\nThe new pope grew up the youngest of three boys — his brother John is only a year older.\nJohn remembers Robert Prevost being very good in school, and enjoying playing tag, Monopoly and Risk. They only had vacations together after Robert graduated eighth grade and left for seminary school. But these days, he said the brothers talk on the phone every day — Robert will call him and they’ll discuss everything from politics to religion, and even play the day’s Wordle.\nJohn Prevost said he’s not sure how they’ll handle staying in touch in the future: “It’s already strange not having someone to talk to,” he said.\nOn Jesus as Savior, not superman\nIn another reference to the ills of today’s world, Leo said: “Today, too, there are many contexts in which Jesus, although appreciated as a man, is reduced to a kind of charismatic leader or superman.”\n“This is true not only among non-believers but also among many of the baptized, who thus end up living at this level, in a state of practical atheism. This is the world that has been entrusted to us, a world in which, as Pope Francis taught us so many times, we are called to bear witness to joyful faith in Christ the Savior.”\nPope Leo XIV decries ‘the neglect of mercy’\nIn impeccable Italian, Leo decried that in today’s world “there are many contexts in which the Christian faith is considered something absurd, meant for the weak and unintelligent. Contexts where other certainties are preferred, such as technology, money, success, power, pleasure.\n“These are environments where it is not easy to bear witness to, and announce, the Gospel, and where believers are mocked, opposed, despised or at best tolerated and pitied. Yet, precisely for this reason, they are the places where mission is urgently needed. Because the lack of faith often carries with it tragedies such as the loss of meaning in life, the neglect of mercy, violations of human dignity in the most dramatic manners, the crisis of the family and so many other wounds that afflict our society.”\nPope Leo XIV’s first words in English as a pope\nThe first U.S.-born pope in history used Italian and Spanish in his blessing to the crowd on Thursday from the central balcony of St. Peter’s Basilica.\nBut at the start of his first Mass on Friday morning, he turned briefly to his native English to address the cardinals who elected him as the leader of the Catholic Church. He began by quoting the responsorial psalm about praising the Lord for his wondrous works.\n“I invite you to recognize the marvels that the Lord has done, the blessings that the Lord continues to pour out upon all of us,” Leo told them. “Through the ministry of Peter, you have called me to carry that cross and to be blessed with that mission.”\nThe Vatican outlines Pope Leo's schedule for May\nThe Vatican says Pope Leo XIV will be formally installed as pope at a Mass on May 18 and will preside over his first general audience on May 21.\nThe Vatican provided a schedule of Leo’s upcoming agenda that includes meetings with cardinals, Vatican officials, the media, diplomatic corps and the general public.\nThe Vatican also said that Leo had asked all heads of Vatican offices, who technically lost their jobs with the death of Pope Francis, to return to work until further notice. It said he wanted to take time for “reflection, prayer and dialogue” before taking any further decisions on confirming them definitively.\nA Hong Kong Catholics' plea for a more harmonious world with Pope Leo\nHong Kong’s Roman Catholic Cardinal Stephen Chow and the faithful are praying for Pope Leo's emphasis on bridge-building, a synodal church and a church for the poor, according to a statement from the church's communication office.\nThe statement said they are also looking to Leo's call for collective efforts from believers worldwide to build a more harmonious world.\nA former British colony that returned to Chinese rule in 1997, Hong Kong enjoys greater religious freedoms as a semi-autonomous city than mainland China.\nThe pope's first homily\nIn his homily, delivered in fluent Italian, Pope Leo XIV touched on faith, power and corruption. As Cardinal Robert Provost, he had done years of missionary work in Peru and on Friday, as pope, he addressed the significance of that work in keeping the faith alive.\nHe said there are “contexts where it is not easy to preach the Gospel and bear witness to its truth, where believers are mocked, opposed, despised or at best tolerated and pitied.\"\n\"Yet, precisely for this reason, they are the places where our missionary outreach is desperately needed,” he said.\nLeo celebrated Mass in Latin and Italian, and his prepared homily was in Italian. He offered some initial comments in English, unprepared, off-the-cuff before he began reading his homily.\nA Bosnian cardinal's admiration\nBosnian Cardinal Vinko Puljic, the longest-serving among the cardinals who were in the conclave, said he was honored to be chosen to stand next to the new pope at the loggia of St. Peter’s Basilica when Leo XIV emerged as the pontiff.\nPuljic described the pope as “very spontaneous but subtly spontaneous.” He told the Catholic Press Agency in Bosnia in an interview published Friday that it's his impression that the pope \"communicates well, that he has an ability to listen and hear, and I hope he will preserve those qualities.”\nPuljic, who will be 80 later this year and whose health has fragile, said the initial vote in the conclave was “dispersed,” but that it then narrowed toward Cardinal Robert Prevost because it became clear that he has the “capacity to lead.”\nThe new pontiff's first Mass\nLeo has celebrated his first Mass as pontiff, presiding in the Sistine Chapel over the cardinals who elected him to succeed Francis and follow in his social justice-minded footsteps.\nWearing white vestments, the pope processed into the Sistine Chapel and blessed the cardinals as he approached the altar and Michelangelo’s “The Last Judgement” behind it.\nIt was in the same frescoed chapel that the Chicago-born missionary Robert Prevost was elected on Thursday afternoon the 267th pope.\nA few minutes earlier on Friday, the cardinals processed into the chapel wearing ceremonial white miters on their heads.\nWhen the pope was a young boy...\nOne of Pope Leo XIV’s neighbors intuited when he was still a young boy that he would someday become pope.\nJohn Prevost, one of Leo’s brothers, says he thinks it happened when Leo was in first grade.\n“One of the neighborhood ladies across the street said to him, ‘You will be the first American pope,’” he said. “How she did that, who knows?”\nIsraeli leaders hope the new pontiff will help in ‘building bridges’\nPrime Minister Benjamin Netanyahu wished Pope Leo XIV “success in fostering hope and reconciliation among all faiths,” in a post on X on Thursday.\nRelations between Israel and the Holy See have been strained since the start of the Israel-Hamas war. Pope Francis regularly criticized Israel’s military actions in Gaza, condemning reports of famine. He also made daily calls to Christians in Gaza, contacting those sheltering at Holy Family Catholic Church in Gaza City to ask about safety and access to food and water.\nIsrael’s President Isaac Herzog said Israel looks forward to welcoming the new pope to the Holy Land and expressed hope Leo's papacy will be \"one of building bridges and understanding between all faiths and peoples.”\n“May we see the immediate and safe return of the hostages still held in Gaza, and a new era of peace in our region and around the world,” Herzog said.\nPope Leo XIV’s first appointments have been set\nVatican spokesman Matteo Bruni says:\nTaiwan looks to work with the new pope to spread the message of peace\nTaiwan’s President Lai Ching-te has extended his congratulations to the new pontiff and said his diplomatically isolated island hopes to work with the Vatican on spreading peace, justice, religious freedom, unity and compassion.\nThe Vatican is the only state in Europe to have formal diplomatic ties with Taiwan and Taipei has worked hard to maintain a close relationship with recent popes.\nAbout 2% of Taiwan’s population of 23 million are Catholic, though the church's roots go back hundreds of years on the island. Most Taiwanese follow Buddhism.\nChina’s state-backed church organizations offer congratulations to the new pope\nChina's official news agency Xinhua reported on Friday that the Chinese Catholic Patriotic Association and the Bishops’ Conference of Catholic Church in China — both under the Chinese government — congratulated Leo.\nThe Vatican’s relations with China were severed in 1951 after the Communist Party came to power and the expulsion of foreign priests. The country’s estimated millions of Catholics were divided into the state-recognized church and an underground one that stayed loyal to Rome.\nIn 2018, the Vatican and China signed an accord over the thorny issue of bishop nominations, and the deal was extended in 2024 even though Rome previously acknowledged that it was far from ideal.\nThe Holy See’s outreach to China under late Pope Francis has drawn criticism, especially from American conservatives who have accused the Vatican of selling out the faithful who have been forced underground. Hong Kong’s outspoken Roman Catholic Cardinal Joseph Zen also criticized the deal.\nFilipinos welcome the first US-born pontiff\nThe Philippines is the largest Roman Catholic nation in Asia and there were hopes the late Pope Francis would be succeeded by a prominent Filipino Cardinal, Luis Antonio Tagle, from the laidback city of Imus just south of Manila.\nStill, Leo's election was welcomed and Philippine President Ferdinand Marcos Jr. said he prays that the new pope would \"continue to bring the church closer to the poor and disadvantaged.”\n“I wanted the candidate from the Philippines … but let’s accept this choice because this was God’s plan,” Alexandra Bonilla, a 20-year-old student, said at a cathedral in Imus.\nAustralia's prime minister says Pope Leo's leadership comes at an ‘important time’\nAnthony Albanese said on Friday that he will invite the new pope to the 54th International Eucharistic Congress, a gathering of Roman Catholic clergy and lay people, in Sydney in 2028.\n“As the first North American Pope, Pope Leo XIV’s leadership comes at an important time for the Catholic Church and for the world,\" Albanese, a Catholic, told reporters in the Australian capital Canberra.\nWhat is a core value for Augustinian priests?\nA religious order is a community of Catholics — which can include priests, nuns, monks and even lay people — dedicated to a particular type of mission and spirituality. A core value for the Order of St. Augustine that the new pope belongs to is to “live together in harmony, being of one mind and one heart on the way to God.”\nPope Francis was the first pope from the Jesuit religious order ever, and the first in more than a century and a half to come from any religious order. The previous one was Gregory XVI (1831-1846), a Camaldolese monk. In all, 34 of the 266 popes have belonged to religious orders — and six of them before Leo XIV were Augustinians, according to America, a Jesuit magazine.\nThe idea of a US pontiff was taboo. Prevost overcame it\nPope Francis brought Prevost to the Vatican in 2023 to lead the office that vets bishop nominations, one of the most important jobs in the Catholic Church.\nPrevost kept a low public profile in Rome, but was well known to the men who count. Significantly, he presided over one of the most revolutionary reforms Francis made, when he added three women to the voting bloc that decides which bishop nominations to forward to the pope. In early 2025, Francis again showed his esteem by appointing Prevost to the most senior rank of cardinals.\nBack in Prevost’s old diocese in Chiclayo, Peru, the Rev. Fidel Purisaca Vigil said Prevost would have breakfast with his fellow priests after saying his prayers each day. “No matter how many problems he has, he maintains good humor and joy,” Purisaca said in an email.\n▶ Read more about Robert Prevost’s background\nSarra Sounds Off, Ep. 22: Top guards, hockey champs and more On the latest episode of \"Sarra Sounds Off,\" Newsday's Michael Sicoli talks about the top guards in boys basketball on Long Island, plus Jared Valluzzi on the Suffolk hockey finals, a look at Long Beach wrestler Dunia Sibomana-Rodriguez and the plays of the week.\nSarra Sounds Off, Ep. 22: Top guards, hockey champs and more On the latest episode of \"Sarra Sounds Off,\" Newsday's Michael Sicoli talks about the top guards in boys basketball on Long Island, plus Jared Valluzzi on the Suffolk hockey finals, a look at Long Beach wrestler Dunia Sibomana-Rodriguez and the plays of the week.",
  "word_count": 3642,
  "scraped_at": "2026-02-14T14:17:07.195417"
}