{
  "article_id": "1bdf30dc1ecb",
  "url": "https://www.westmeathindependent.ie/2024/03/24/athlone-towns-fai-cup-success-100-years-ago/",
  "title": "Athlone Town FAI Cup success 100 years ago | Westmeath Independent",
  "date": "20240324T143000Z",
  "domain": "westmeathindependent.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Athlone Town’s FAI Cup success 100 years ago\nWhile memories of Athlone Town's women's FAI Cup glory last November remain vivid, there are very few who can recall details of the last FAI Cup win for the club's men's team.\nThat victory is in the distant past and in fact, Sunday last, St Patrick's Day, marked the centenary of Athlone Town's sole victory in the men's FAI Cup. The competition was then known as the Free State Cup and 1924 represents Athlone's only entry in the cup roll of honour. It was Cork opposition which faced Athlone in that final in the shape of Fordsons, a team associated with the Fordson tractor plant in Cork.\nIt was somewhat of a novel pairing in what was only the third cup final, but both sides had earned their right to contest the showpiece of club football in the country, with Athlone having seen off Bohemians and Shelbourne en route to the decider.\nThe League of Ireland itself was only three years old at that stage, having formed following a break away from the Belfast-based Irish Football Association (IFA) which, up to then, had governed the game across the 32 counties.\nAthlone had entered the Free State Cup as a junior, non-league team in the 1921/22 season and then become members of the Free State League in the following season.\nThe history of football in Cork is a tale of a variety of clubs, but Fordsons were the kingpins of football in Munster at that stage. They had reached the last four of the cup in 1922/23 and went on to win the 1926 decider, before, in the way of many Cork outfits, transforming into Cork FC in 1930, after Ford pulled their support for a League of Ireland team.\nAthlone’s cup campaign began with a 2-0 home win to another now defunct league team, Midland Athletic, which drew its players from the ranks of Midland and Great Western Railway based in Dublin. It secured Athlone a quarter-final berth away to Shelbourne, who had just been pipped for the league title by Bohemians.\nShelbourne had been unbeaten on home soil all season, including in ten home league games, of which they had won nine, and in seven shield games and four Leinster Senior Cup games at Shelbourne Park.\nIn front of an attendance of over 5,000 at the Ringsend venue, Athlone produced a shock 2-0 win with goals from Jim Kennedy and the fleet footed Frank Ghent securing the win, but not without a starring display from goalkeeper Paddy O’Reilly.\nIt was on to the semi-final then, against league champions Bohemians, again in Shelbourne Park, which had to be upgraded to accommodate the 11,000 attendance.\nA tough, high intensity battle ended scoreless, necessitating a replay on the same ground on March 1, 1924.\nThis time over 9,000 were in attendance in what were described as Arctic weather conditions to witness Bohemians being put to the sword in another surprise win for Athlone side, who had suffered a big blow with the absence of their key defender John Joe Dykes from Sligo.\nA defensive mix up allowed the alert Ghent to seize on a loose ball to put Athlone in front after just 12 minutes. The Midlanders had to endure a major Bohemians’ onslaught for much of the game and only strong defending and some superb saves by O’Reilly kept the Dubliners at bay before Athlone began to threaten again in the final quarter.\nThe vital second goal came through Norman Lyster with just seven minutes left to send the large Athlone crowd wild.\nThe Evening Mail rather stiffly remarked: “The big Athlone following almost got out of hand when the second goal was scored but the stewards dealt with the incident.”\nThe Sunday Independent noted: “When under presssure there were times when it was hard to believe that they had only eleven men operating.”\nA cup final date with destiny now awaited Athlone on March 17 in Dalymount Park. Facing them were Fordsons, who had received a bye in the opening round and had then overcome league teams Jacobs and St James’s Gate.\nThe game was played in front of an estimated attendance of 22,000, with spectators spilling out onto the pitchside around both goals and along the sidelines.\nAthlone lined out as follows: Paddy O’Reilly, Joe Monahan, James Hope, Terry Judge, John Joe Dykes, Tommy Muldoon, Norman Lyster, Denis Hannon, Jim Sweeney (captain), Tommy Collins and Frank Ghent.\nMonahan, Muldoon, Lyster, Hannon, Sweeney and Ghent were from Athlone. Collins was a Moate man, Hope and Judge were from Mullingar. Dykes (from Sligo) and O’Reilly, a Dubliner, were the only players from outside Westmeath on the team.\nAthlone wearing light blue, employed their preferred style of play, of resolute defending, and high and long clearances, combined with intense, fast-paced pressure and swift attacks.\nIt had proved successful in unsettling the more composed Shelbourne and Bohemians outfits and was to prove similarly effective against a Cork side, who one newspaper said had been left “bewildered” by their opponents’ tactics.\nAlthough Athlone were far superior on the day, the only goal came just on the 20-minute mark.\nThe dangerous Ghent raced away down the left after Muldoon and Collins had combined to release him. His cross was met by centre forward Jim Sweeney whose goalbound shot deflected off a Fordsons defender. Hannon was first to reaction and raced onto the loose ball, and fired to the net through a group of converging Cork defenders.\nAthlone had been by far the better side in the opening quarter and could easily have been well in front before Hannon's strike.\nHowever, a more even second half resulted in chances ab both ends and Athlone were indebted to keeper O'Reilly for a fine save at the foot of his post in almost the last action of the game. It ensured a remarkable achievement of not having conceded a goal throughout the cup run.\nTeam captain Sweeney was presented with the trophy afterwards, the only time an Athlone Town men's player has lifted the FAI Cup to scenes of unconfined joy that were matched later that night when a large gathering including the Athlone Brass and Reed Band greeted the team on their homecoming to the Midlands and Great Western Railway Station in Athlone.\nFive of the Athlone players, O'Reilly, Muldoon, Dykes, Hannon and Ghent were subsequently chosen to represent Ireland at the 1924 Olympic Games football tournament. All five started in the quarter-final game against Holland.\n#The full story is told in the book 'When We Were Kings' by Tadhg Carey",
  "word_count": 1102,
  "scraped_at": "2026-02-14T12:47:01.847224"
}