{
  "article_id": "1be510c90187",
  "url": "https://www.wsls.com/business/2023/12/21/the-super-league-had-its-day-in-court-and-won-what-is-it-and-why-do-some-fans-and-clubs-object/",
  "title": "The Super League had its day in court and won . What is it and why do some fans and clubs object ? ",
  "date": "20231221T184500Z",
  "domain": "wsls.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "MANCHESTER – The Court of Justice of the European Union ruled Thursday that soccer's governing bodies UEFA and FIFA acted contrary to EU competition law by blocking plans for a breakaway Super League. Emboldened by that ruling, organizers quickly revealed plans for the new competition designed to change the face of European soccer.\nThat news was celebrated by Real Madrid, which along with Barcelona, has been leading the fight to get the new competition off the ground.\nRecommended Videos\n“Today a Europe of freedoms has triumphed, and also football and its fans have triumphed,” Madrid president Florentino Pérez said. “We are facing a great opportunity to improve European club football.”\nA previous attempt to launch a Super League in 2021 collapsed when clubs backed out in the face of angry fan protests. And despite the latest ruling, it is unclear if the competition has wide backing or if clubs would be willing to join and risk alienating supporters and challenging UEFA.\nWHAT IS THE SUPER LEAGUE?\nIn 2021 a group 12 of Europe's most storied clubs announced plans to create a new Super League. Proposals for the 20-team elite tournament would have seen 15 top clubs protected from relegation.\nIt would have effectively replaced the Champions League — Europe’s elite club tournament — and had the potential to impact domestic leagues given the guaranteed entry of teams regardless of their success in national competitions.\nReal Madrid, Barcelona, Atletico Madrid, Manchester United, Manchester City, Liverpool, Arsenal, Chelsea, Tottenham, Juventus, AC Milan and Inter Milan were part of the original breakaway group.\nNow only Madrid and Barcelona are publicly driving the project, which includes a revised 64-team format across three competitions and also a Women's Super League.\nWHO CHALLENGED IT AND WHY?\nDespite the majority of the original clubs backing down due to public anger in 2021, Madrid, Barcelona and Juventus carried on the fight. Italy's record 36-time champion, Juventus, withdrew earlier this year.\nClubs claimed European soccer's governing body, UEFA, abused its market dominance of competitions. The case was heard in July last year and in February A22 Sports Management — a Madrid-based company that is promoting the Super League — announced revised plans for the competition.\nWHAT'S NEXT?\nPromising greater riches to the clubs involved and free live streaming of games for fans, the Super League hopes to avoid the pitfalls that led to its collapse the first time around.\nThe ruling did not say the project must be approved, but it does pave the way for a rival competition to the Champions League if organizers can get the backing of Europe’s top teams.\nA22 has revealed plans for three new competitions involving 64 teams, based on league and knockout formats. It did not provide details about when it expected to launch or what support it had from specific clubs.\n“The challenge is, working with sporting clubs and others, whether the best competition in the world can be created,” said Bernd Reichart, the CEO of A22. “We believe it can be and that is the objective of this initiative.”\nA22 also announced its plans for a Women’s Super League with 32 teams playing in two different competitions. Again, the tournament would be based on a league and knockout format.\nBUT SOME STILL OPPOSE THE SUPER LEAGUE?\nYes, opposition could still come from clubs, fans, governing bodies and even governments.\nThe protests in 2021 led to the clubs that backed out issuing groveling apologies to their fans for their part in the plans. They would be reluctant to do anything that could cause a repeat of that backlash.\nThe Premier League is the most successful domestic competition in the sport and part of its owners’ charter states that clubs “will not engage in the creation of new competition formats outside of the Premier League’s Rules.”\n“The ruling does not endorse the so-called ‘European Super League’ and the Premier League continues to reject any such concept,” the League said Thursday. “Supporters are of vital importance to the game and they have time and again made clear their opposition to a ‘breakaway’ competition that severs the link between domestic and European football.”\nA U.K. government bill proposed by King Charles would block English teams from trying to join a breakaway league.\nThe European Club Association, which represents Europe’s top teams, dismissed the interloper, saying the sport had “moved on from the Super League years ago” and pointing to “a few individuals pursing personal agendas to undermine the very foundations and basic principles of European football.”\nECA chairman Nasser Al Khelaifi also runs one of UEFA’s biggest commercial clients, Qatari broadcaster beIN Media Group, and is president of French champion Paris Saint-Germain, which rejected the Super League’s offer to join in 2021.\nThe close working relationship between Al Khelaifi and UEFA President Aleksander Ceferin should be key to resisting a new project outside their organizations’ control.\nUEFA said it remained “resolute in its commitment to uphold the European football pyramid” and that rules, which were amended in 2022 “comply with all relevant European laws and regulations.”\nARE THERE WIDER IMPLICATIONS?\nWhile the Super League is the only known rival to the Champions League, the ruling could lead to more breakaway proposals.\nSaudi Arabia's public investment fund successfully backed the LIV Golf series, which has lured a number of the world's best players to its tour. Theoretically, a similar bid could be launched to back a breakaway soccer competition by any state, consortium or individual with enough money.\n“We have won the right to compete. The UEFA monopoly is over. Football is free,” Reichart said. “Clubs are now free from the threat of sanctions and free to determine their own futures.”\nWhile soccer is a very different prospect from golf, the court's ruling has the potential to be a landmark moment for that sport, too.\nAs with the Super League, backing from clubs, will be fundamental to any future proposals and there is little evidence that there is a wide-reaching appetite to form a breakaway.\n___\nJames Robson is at https://twitter.com/jamesalanrobson\n___\nMore AP soccer: https://apnews.com/hub/soccer",
  "word_count": 1011,
  "scraped_at": "2026-02-14T12:46:27.926725"
}