{
  "article_id": "1bfb22d42431",
  "url": "https://www.bbc.co.uk/news/articles/crrkgzy52keo",
  "title": "New Year Honours 2026 : Idris Elba knighted as Sarina Wiegman and Lionesses recognised",
  "date": "20251230T014500Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Idris Elba knighted as Sarina Wiegman and Lionesses lead New Year Honours\n- Published\nActor Idris Elba is knighted and England women's football coach Sarina Wiegman is made an honorary dame in the New Year Honours.\nFigure skating duo Jayne Torvill and Christopher Dean are given a damehood and knighthood respectively, while there is also recognition of the Red Roses winning the women's rugby union World Cup.\nThere are 1,157 recipients in this year's list with Wiegman and several of her Lionesses honoured after their victory in the European Championships last summer.\nEngland captain and two-time European champion Leah Williamson is made a CBE, while Ella Toone, Keira Walsh, Alex Greenwood and Georgia Stanway are all given MBEs to recognise their contributions to the triumph.\nIn the world of entertainment, there is a damehood for comedy actor and writer Meera Syal as well as OBEs for actor Warwick Davis and sports broadcaster Gabby Logan. A CBE has been conferred to mezzo-soprano Alice Coote.\nAuthor and TV host Richard Osman is recognised for his work, as are comedian Matt Lucas and Wicked star Cynthia Erivo.\nBetty Brown, who has campaigned against wrongful prosecutions by the Post Office, is appointed an OBE.\nTelevision and film\nLuther star Idris Elba becomes Sir Idris in recognition of his charity work with young people. He has launched an anti-knife crime campaign and founded the Elba Hope Foundation alongside his wife Sabrina, providing grants to organisations across the UK, the US and Africa.\nHe was a beneficiary of the Prince's Trust as a teenager, when he was given a £1,500 grant to attend the National Youth Music Theatre programme.\nSince then he has risen to prominence in TV show The Wire and established a film career, with starring roles in Beasts of No Nation and Mandela: Long Walk to Freedom among others.\n\"I receive this honour on behalf of the many young people whose talent, ambition and resilience has driven the work of the Elba Hope Foundation,\" Sir Idris said.\nMeera Syal, now Dame Meera, was part of the team that created sketch show Goodness Gracious Me, which explored British Asian culture, and played the grandmother in The Kumars at No. 42.\nShe is recognised for her contribution to drama, literature and charity, having also written several novels and plays.\nLast of the Summer Wine and Open All Hours writer Roy Clarke is knighted, while actor and presenter Warwick Davis said of his OBE: \"This is the best thing that's ever happened to me - and I've been in Star Wars.\"\nLittle Britain comedian Matt Lucas and quiz-show-host-turned-author Richard Osman are also given OBEs, while comedian Bill Bailey, actor Sally Lindsay and children's TV star Paul Chuckle are made MBEs.\nMatch of the Day presenter Gabby Logan and football commentator Clive Tyldesley are appointed OBEs.\nTV chef Marcus Wareing and Location, Location, Location presenter Phil Spencer receive MBEs.\nMusicians and the arts\nActor and singer Cynthia Erivo is appointed an MBE, as is singer Ellie Goulding who is recognised for her work as an environmental ambassador. Scottish singer Eve Graham, who was a member of the New Seekers, is also made an MBE.\nErivo, who starred in Wicked and its 2025 sequel Wicked: For Good, said it was \"an honour I could never have thought would happen\".\nThere is a strong classical contingent to this year's list with conductor Richard Farnes, a former music director of Opera North, being made a CBE along with opera singer Alice Coote and composer Max Richter.\nAs well as his own albums, Richter is known for composing soundtracks for film and television including Waltz with Bashir and Chloe Zhao's Hamnet, which is tipped for an Oscar.\nPoet Prof Andrew McMillan is made an MBE for services to literature.\nSports personalities\nWiegman receives an honorary title after guiding the Lionesses to their second successive Euros title, becoming the first England football team to win a major trophy on foreign soil.\nForeign citizens can be conferred knighthoods or damehoods but are not dubbed and cannot use the title Sir or Dame.\n\"When I first arrived in England, I could never have imagined the respect and warmth I've experienced,\" said Wiegman, who is from the Netherlands. \"I deeply thank the fans for their support\nThe Lionesses are not the only English team to be recognised for success on the global stage.\nFollowing the Red Roses' victory at the Women's Rugby World Cup, lock Zoe Aldcroft, flanker Marlie Packer and head coach John Mitchell are all made OBEs. Megan Jones, Sadia Kabeya and Ellie Kildunne are appointed MBEs.\nIce skaters Torvill and Dean - now Dame Jayne and Sir Christopher - won gold at the 1984 Winter Olympics in one of the most watched television events ever in the UK. They are recognised for their services to ice skating and voluntary service.\nThe pair performed together for the final time during this year's finale of Dancing on Ice. Dame Jayne said: \"It was a big thing for us to mark our career before retirement, and then receiving this award at the end of the year, it's just finished everything. It's perfect.\"\nSir Christopher added: \"We're really humbled by it.\"\nOlympic runner Paula Radcliffe becomes an OBE, while former Tottenham Hotspur chairman Daniel Levy is appointed a CBE for his services to charity and the community.\nFormer Welsh rugby player Jonathan Davies is also made a CBE for his work as president of the Velindre Cancer Care Trust.\nPoliticians\nAs always there are several political figures on the list, with former Labour minister Anneliese Dodds made a dame. There are also gongs for former Labour MPs Jonathan Ashworth and Tristram Hunt.\nSir Tristram, a historian, is director of the Victoria and Albert Museum and is recognised for his services to that industry.\nMr Ashworth is recognised with a CBE for his charity work on behalf of the children of alcoholics.\n\"It was never something I expected,\" he said. \"Speaking up for the thousands of children who suffer in silence is something that matters deeply to me.\"\nAnother ex-Labour MP to be knighted is Adam Ingram, who was a minister under Sir Tony Blair, while former Welsh Labour MP Christopher Ruane is appointed an OBE. Sir Tony's former diary secretary Kate Garvey is made an OBE.\nCampaigners\nAs well as celebrating the success of people in the public eye, the honours list also highlights the unsung achievements of people who make major contributions to their local communities, charities and to fields such as education and healthcare.\nBetty Brown, the oldest surviving victim of the Post Office Horizon IT scandal, is given an OBE for services to justice for her part in the campaign against wrongful prosecutions. She said she would wear the award in honour of the other subpostmasters.\nAlso recognised is Jeff Edwards who, aged eight, survived the Aberfan disaster in which a coal waste tip came crashing down a hillside and engulfed his school and surrounding homes - killing 116 children and 28 adults.\nMaths teacher Bobby Seagull is appointed an MBE for his work campaigning for public libraries to be better supported.\nSpeaking to the BBC how he kept his news a secret, he said: \"I thought about, should I message my family on WhatsApp? But I thought like, this deserves more than a thumbs up emoji.\n\"I would tell each person in turn... I have a little niece called Emma and I told her I've got an MBE and she's like, 'Uncle Bob, MBE. Uncle, Bob, MBE.'\"\nAlso appointed an MBE is Ellen Roome, a mother who has campaigned for legal reforms to give parents access to children's social media accounts following the death of her son Jools Sweeney, 14, in 2022.\nMervyn Kersh, a British Army veteran of the Normandy landings and the liberation of the Bergen-Belsen concentration camp, is awarded the British Empire Medal (BEM) for his services to Holocaust remembrance and education.\nMr Kersh has routinely spoken to schoolchildren about his experiences but warned of increasing antisemitism in the UK: \"What's disappointing is the antisemitism that I see everywhere, hear everywhere, or read.\"\nHolocaust survivor Lydia Tischler is awarded an MBE for services to Holocaust remembrance and child psychology. Sarah Anderson, the founder of mental health charity the Listening Place, receives a damehood for services to suicide prevention.\nThe oldest person on the list is 102-year-old John Hearn, who receives a BEM for services to judo and to the community in north-east England.\nThe youngest recipient is Olympic gold medal-winning sports climber Toby Roberts, 20, who receives an MBE.\nGet our flagship newsletter with all the headlines you need to start the day. Sign up here.\nRelated topics\n- Published30 December 2025\n- Published9 February 2025\n- Published13 June 2025\n- Published29 December 2025",
  "word_count": 1465,
  "scraped_at": "2026-02-14T13:07:07.116216"
}