{
  "article_id": "1c0a1288a698",
  "url": "https://www.nytimes.com/athletic/5891523/2024/11/04/donald-trump-united-states-world-cup-2026/",
  "title": "Donald Trump , Jared Kushner and the race to host the 2026 World Cup",
  "date": "20241104T114500Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In 2026, the United States will stage the men’s World Cup for the first time in over three decades and this week, the world will learn whether Republican candidate Donald Trump or Democrat opponent Kamala Harris will be the nation’s president during the tournament.\nThe bidding process and lobbying efforts for the 2026 World Cup, which will be co-hosted by neighbours Canada and Mexico, took place during Trump’s previous presidency, from 2016-20, and as one of the most divisive politicians in U.S. history, he presented various complexities for the bid committee on the campaign trail.\nAdvertisement\nThe so-called United bid, comprised of senior figures from U.S., Canadian and Mexican soccer, launched its campaign formally in April 2017, with north African nation Morocco announcing a rival bid that August.\nBy then, Trump had pledged to build a “big, beautiful wall” between the United States and Mexico, and make Mexico pay for it, as a cornerstone of his successful 2016 presidential campaign. He had also signed an executive order that limited entry into the U.S. for refugees and banned foreign nationals from several predominantly Muslim countries entering the U.S. for 90 days. Then, as the World Cup bidding process intensified, potential voters were further disturbed to read widespread reports in the American media which claimed Trump had caused offence by asking why his country should accept immigrants from “s***hole” countries such as Haiti in the Caribbean and some African nations.\nFor the bidding team, this presented obvious challenges, most notably because the 2026 process was the first implementation of a one-member, one-vote system, meaning they were canvassing the support of the 211 nations who were members of FIFA, world football’s governing body. Even by June 2018, when the vote took place, the concept of a United bid appeared to be undermined by trade wars between Trump’s administration and its two neighbours, as the U.S. imposed tariffs on Mexican and Canadian steel and aluminium and the Mexicans hit back with tariffs on American agriculture. To further complicate matters, FIFA member associations were shaken up when U.S. federal prosecutors brought soccer’s world governing body crumbling to its knees, starting with the indictment of nine FIFA officials and five corporate executives for racketeering conspiracy and corruption in May 2015.\nAnd yet, despite all of that, the United bid emerged successful in the vote at the FIFA Congress in the Russian capital Moscow at the beginning of the 2018 men’s World Cup. The United bid secured the support of 134 member associations, while 65 voted for the Moroccan bid. Iran voted for “none of the above.”\nHow, therefore, did the United bid navigate the choppiest of political terrains to emerge victorious? The Athletic has spoken to numerous sources involved with the bidding process on either side, all of whom wished to remain anonymous to protect relationships and owing to the sensitivity of their discussions. During our conversations, we learned:\n- Jared Kushner, Trump’s son-in-law, became the key contact in the White House for the United bid and, even as recently as this year, he remained key in securing the World Cup final for MetLife Stadium in New Jersey.\n- Officials from the U.S. and Moroccan bids informally discussed the possibility of Morocco stepping away from the race, but the U.S. curtailed those conversations when they were asked to commit to supporting a future Morocco bid in return.\n- Officials within the U.S. bid sought to actively downplay concerns about Trump’s inflammatory rhetoric, attempting to persuade voters that either he did not reflect the bid, or that he did not mean exactly what he had said, or to reassure them by saying it was unlikely he would be president in 2026.\n- The United bid became a joint effort with Mexico and Canada as officials felt a need to minimise the U.S. presence, partly because of concerns of any lingering hostility from FIFA due to the U.S. Department of Justice’s clampdown but also due to fears that Trump may have alienated voters.\n- Saudi Arabia became a strong ally of the United bid in the Middle East, and multiple trips were made by bid officials, including former United States Soccer Federation (USSF) president Carlos Cordeiro, as well as by Kushner. The Saudis were also seeking to enhance relations with FIFA to boost their own aspirations of future men’s World Cup host nation status, which has now been all but secured for 2034.\nKeep politics out of sport? When it comes to bids for major sporting events, that is neither likely nor realistic.\nAdvertisement\nPolitical support for hosting a World Cup goes beyond vanity. It is, in fact, completely necessary. In an ideal world, FIFA desires unfettered visa access for competing players, staff from federations and fans who may wish to visit during the competition. It also requires guarantees from state departments including security, transport and commerce. FIFA, for example, is granted non-profit status in its home base of Switzerland, providing key tax exemptions despite driving billions in revenue, and it likes such goodwill to be extended when it takes its competitions around the world.\nAccording to the Bid Evaluation Report for the 2026 World Cup, FIFA secured a full tax exemption for marketing, ticketing, hospitality and media revenues arising from the tournament from Mexico but only a “limited” one from Canada. In the case of the U.S., the bid report described a “close-to-full exemption” and stated that a letter of support had been sent from Trump on the matter, but this is not legally binding. It was, however, a significant statement within a FIFA bidding environment because the Moroccan bid had accepted FIFA’s templated format for exemptions, meaning the U.S. were under pressure to match up.\nThe United bid knew it needed to develop strong ties with the White House. It leaned on Robert Kraft, the 83-year-old billionaire and owner of the NFL’s New England Patriots and New England Revolution of Major League Soccer. Kraft was named honorary chairman of the bid. He had been a friend of Trump, a relationship Kraft has previously said grew closer following the death of his wife Myra in 2011. Kraft said in an interview with the New York Daily News that Trump attended the funeral and called him “once a week for the whole year” to check on his friend. Trump had also often attended the owner’s suite at Gillette Stadium in Foxborough.\nTrump would later praise Kraft for his “excellent advice” on the World Cup bid and Kraft used his contacts to engage Kushner, the husband of Trump’s daughter Ivanka and a senior advisor to the president. Kushner ran a White House department named the Office of American Innovation and this was the connecting point for the bid.\nWhen contacted last month by The Athletic in relation to the role of the White House in the bid and leveraging relationships, Trump’s media advisor Jason Miller sent a text message in which he said: “That was all Jared.” The Athletic attempted to contact Kushner via his fund Affinity Partners but received no comment on any points raised within this article.\nAdvertisement\nKushner hosted meetings at the White House with officials from the bid. A source present recalls: “He was asking, ‘What do we need to do? How can we help?’.”\nHe would later attend U.S. national team games in Qatar during the World Cup in 2022 and, even if he did not strike those involved as a passionate soccer fan, they realised Kushner grasped the sheer scale and importance of hosting a global soccer tournament.\nAnother person adds that Kushner and Trump “wanted it to be a victory for the administration, something to bring jobs and show they could deal-make with other countries”.\nBut Kushner’s interest in the World Cup extended beyond the successful bid. Even after Trump left office in January 2021, he remained engaged on attempts by the New York/New Jersey host committee to bring the World Cup final to MetLife Stadium. The Athletic can report for the first time here that Kushner, who grew up in New Jersey, helped to co-ordinate the final push to beat Jerry Jones and the AT&T Stadium in Arlington, Texas, to host the final.\nIn the weeks before the announcement in February, Kushner spoke with Gianni Infantino and also helped assemble a key meal attended by the FIFA president, the New Jersey governor Phil Murphy and some of New York’s most prominent businessmen and dealmakers in a get-together regarded as key to getting it over the line. FIFA, Kushner and Murphy’s office did not respond when contacted on the matter.\nAs for Kraft, he was commended in the Oval Office by Trump shortly after the 2026 World Cup was secured. During a visit by Infantino, in which the FIFA president told Trump, “You are part of the FIFA team now”, Trump revealed that Kraft was the first person to approach him with the idea of supporting the bid. Kraft, for his part, has since had a reward of his own, with Gillette Stadium securing seven fixtures for the World Cup, including a quarter-final.\nYet his relationship with Trump has soured. In a recent radio appearance, he compared the Trump presidency to “being like having someone who’s a drunk fraternity brother become (president).” He added that he had not spoken to Trump since January 6, 2021, when riots took place at the U.S. Capitol.\nAdvertisement\nInfantino’s relationship with Trump appeared to blossom, however. Infantino visited the Trump White House on three occasions, as well as playing golf with him in New Jersey and lunching with him at the World Economic Forum in Davos in January 2020. This was in the same week the U.S. Senate introduced ground rules for Trump’s impeachment trial.\nIntroducing Trump at the Davos event, Infantino said: “President Trump is definitely a sportsman. I am lucky enough in my life to come across some of the most talented athletes in soccer. And President Trump is made of the same sort of fibre. He is a competitor. He wants to compete, he wants to win. He wants to show who is the best. He says actually what many think, but more importantly, he does, then, what he says.” Trump thanked Infantino, saying: “You’ve been my great friend.”\nInfantino has not been granted similar photo opportunities within the Oval Office by Biden, but Infantino did hold a series of inter-agency meetings earlier this year with other senior administration figures ahead of the World Cup.\nTrump’s reassurance on tax matters was not the only one he offered. In a letter dated May 2, 2018, and first reported by the New York Times, Trump wrote to Infantino and said he was confident that “all eligible athletes, officials and fans from all countries around the world would be able to enter the United States without discrimination”.\nFor the bid team, this was a vital intervention, because member associations had been asking how exactly the U.S. intended to circumvent the fact that the nation’s president had sought to limit travel from countries such as Iran, Libya, Syria, Yemen, Chad, North Korea and Venezuela. Iran have qualified for the past three World Cups.\nThe U.S. was never likely to sign up to all the visa waivers that FIFA truly desired — certainly not in the manner Qatar were prepared to do — but an indication of intent from the president went a long way to smoothing matters. Besides, even if the Trump administration had offered up full guarantees, there was no legal way to provide an assurance that it would not subsequently be changed by Congress or the next U.S. government.\nA senior bid source explains: “It acknowledged what FIFA wanted, but it didn’t provide an iron-clad guarantee. From the U.S. standpoint, it was, ‘Listen, we can’t sign these blanket guarantees’. We’re going to soften them, respect the spirit but we’re not going to be able to fully commit to what FIFA is wanting.”\nAdvertisement\nAs it transpires, FIFA has raised repeated concerns over the past year with the U.S. government, including in official meetings involving Infantino at the White House, over worries supporters may be deterred from the 2026 men’s World Cup due to excessive wait times to process visa applications to visit the country. The tournament begins in 584 days and it will be at least another 12 months before many countries will be assured of qualification, yet the wait times for U.S. visa interviews in two Mexican cities remain in excess of 250 days, while it is 710 days in the Colombian capital of Bogota and 455 days in the Ecuadorean capital of Quito. In the Turkish city of Istanbul it is a 713-day wait.\nIn some locations, those wait times have diminished due to renewed investment in processing, but FIFA remains concerned that the delays may undermine Trump’s original reassurances.\nThe challenge for the United bid was to ensure the co-operation of Trump’s White House yet minimise the impact of his more unpopular interventions. After controversially missing out to Qatar for the 2022 tournament, U.S. Soccer had raised the idea of another World Cup bid with advisors to President Obama before he left office in January 2017. While there was cautious support, the Obama White House, which had previously hosted the later deposed FIFA President Sepp Blatter as part of its pursuit of the 2022 edition, was anxious to avoid any repeat of photo opportunities in the Oval Office for FIFA representatives who may later become controversial figures.\nGO DEEPER\nSepp Blatter, Michel Platini, 2m Swiss francs and the 'sports trial of the century'\nThe bid also conducted polling and research to test public support for hosting a World Cup, particularly amid FIFA’s discredited reputation. The bid found support among men, women and younger age groups, as well as within a soccer-supporting community that tends to lean liberal-progressive.\nSoon enough, Trump was in situ. One early decision was to bring Mexico and Canada into the bid. The motivation was two-fold. Firstly, there were fears the U.S. Department of Justice’s role in bringing down FIFA executives may mean lingering resentment towards the U.S. among the FIFA electorate, while Trump’s more incendiary comments also caused anxiety.\nA source close to the bid recalls seeing significant protests at San Diego airport following Trump’s executive order to introduce the travel ban and worrying it could derail the bid. Multiple people say that reassurance was needed for voting nations across the world. In some cases, members of the United bid would say Trump “did not really mean” what he was saying, referring to comments from several years before. On other occasions, they would simply tell the voters that Trump would not be president by 2026 in any case because, even if he secured consecutive terms, he would have been out of office by 2025. Nobody involved in the bid foresaw a scenario where Trump lost out on a second term but sought to gain re-election in 2024.\nIn public, the bid occasionally played up Trump’s interest, partly on the instructions of Kraft, who insisted that the bid underline Trump’s support for Mexico’s involvement, but also because they needed Trump’s co-operation with FIFA. When the United bid was launched at Freedom Tower in New York City, U.S. Soccer President Sunil Gulati said: “The president of the United States is fully supportive and encouraged us to have this joint bid.” He added: “He is especially pleased that Mexico is a part of this bid and in the last few days we’ve gotten further encouragement on that. We are not at all concerned about some of the issues that other people may raise.”\nThe initial U.S. discussions with Mexico actually came through their relationship with Emilio Azcarraga, the chairman of the Mexican television channel Televisa, rather than directly with the Mexican Football Federation. Only this week, Azcarraga stepped down from his role at Televisa because he is under investigation by the U.S. Department of Justice in a FIFA-related issue, according to the company’s report to Mexico’s stock market.\nAdvertisement\nIn 2023, Televisa reached a $95million (£73m) settlement in a U.S. investor lawsuit which accused the group of bribing FIFA officials to secure the rights to four World Cup tournaments between 2018 and 2030. Televisa denied wrongdoing despite agreeing to settle.\nAccording to those on the U.S. side, the Mexican bid members rarely, if ever, brought up the matter of Trump’s comments about building a wall, but were insistent on one point: hosting the opening match of the World Cup, which was secured for the Azteca Stadium in Mexico City. Mexico and Canada agreed to be junior partners, taking 13 games apiece out of 104 matches during the first 48-team World Cup, leaving the U.S. with 75 per cent of the fixtures. Every game from the quarter-finals onwards is to be held in the U.S..\nThe combined effort helped frame the bid’s narrative. As one source explains: “The worst thing would have been to go down the line of, ‘the U.S. is the greatest country in the world, we deserve this, there is no choice, it is ours’.”\nThe United bid’s emotional appeal came in the alliance between three neighbours from the Americas but the core of the messaging was rational. The United bid book spoke of breaking “new records” in attendance and revenue. With ready-made state-of-the-art NFL stadiums, Cordeiro promised “the most profitable FIFA World Cup ever”, targeting revenues of $14billion and profits for FIFA of nearly $11bn.\nFor the 211 member associations that receive funding from FIFA, this made for a logical and powerful pitch. Essentially, a rising tide could float all boats. The competition for the U.S. was also diminished owing to FIFA’s rotation principle, meaning confederations must wait two cycles before hosting another World Cup. As such, Europe and Asia could not apply, given Russia and Qatar were due to host the 2018 and 2022 editions.\nThe only rival came from Africa, where Morocco had previously tried and failed to secure a World Cup in 1994, 1998, 2006 and 2010. In the formal FIFA evaluation reports, which assess stadiums, facilities, accommodation, transport, media markets, marketing potential, connectivity, ticketing and hospitality, its technical committee awarded Morocco 2.7 points out of five and highlighted “high” risks on stadiums, accommodation and transportation. The United bid, however, received four points out of five.\nBut the U.S. had been rated positively before, most notably for the 2022 edition, only to be stunned when Qatar’s name was picked out of the envelope instead. Lobbying for votes would remain essential.\nAdvertisement\nThe battle between the U.S. and Morocco may not have intensified at all. During a FIFA Congress in 2017, an informal conversation took place between officials from both sides, in which the U.S. posited whether Morocco would go through with the bid. The word they had back was the Moroccans would only drop out in the event the Americans agreed to offer support and endorsement for a Moroccan bid in future tournaments.\nThe U.S. officials were not prepared to agree, partly because there is no way to bind future administrations, but also because in 2017, there were some hefty likely contenders for the 2030 edition; with whispers about China and Saudi Arabia considering bids, while a pan-South American bid was also being prepared to mark the 100th anniversary of the World Cup’s inaugural edition in Uruguay. As it turns out, the 2030 edition will now be held in Morocco, as well as Spain, Portugal, Uruguay, Argentina and Paraguay, in a six-nation and three-continent extravaganza, subject to a FIFA vote regarded as a formality in December.\nAs such, the U.S. bid got to work. For all of the questions about Trump, there were, one person says, some places that “would have voted for Morocco even if we had Martin Luther King or Gandhi as president”. Morocco had hoped to sweep up the vote across Africa and the Middle East and any route to success required this to happen.\nThis, however, underestimated the strength of American geopolitical ties in the Gulf states in particular, as well as Kushner’s burgeoning relationship with Saudi Arabia. According to reporting by Vanity Fair, Kushner “directly asked” the Saudi Crown Prince Mohammed bin Salman for his nation’s support as early as the summer of 2017 during a visit to the country. The publication also said Kushner made the same request to the House of Khalifa in Bahrain. Both nations voted for the United bid.\nTurki Al-Sheikh, the chairman of the General Entertainment Authority in Saudi Arabia and a close confidant of Bin Salman, told Bloomberg in June 2018: “They (the U.S.) knocked on our door from 2017, before everyone, and we don’t close the door to allies. Our brothers in Morocco didn’t ask for help for us on this issue until a month ago, and we’d given our word to the Americans.”\nThe Saudis also appeared to facilitate support from the region. Around the same time, Al-Sheikh headed up a new regional bloc, called the South West Asian Football Federation, which for a while looked as though it may take on legitimacy from FIFA and rival the Asian confederation. The group included Pakistan, Sri Lanka, India, Nepal, Bangladesh, Saudi Arabia, Bahrain, Maldives, Yemen, Oman, Kuwait and the United Arab Emirates.\nOn two occasions, U.S. bid officials, led by Cordeiro, travelled to Riyadh to pitch to this group of nations. Of the 12 nations in the bloc, 10 ultimately supported the U.S. over Morocco, with only Yemen and Oman siding with the African nation. The United bid also benefited from a Gulf split that developed during this time while Qatar’s neighbours implemented a land, air and sea blockade against the state that was due to host the 2022 World Cup. Moroccan and Qatari relations appeared to remain intact, with Qatar’s vote going Morocco’s way, while those blockading Qatar leaned towards the United bid.\nAdvertisement\nAs for Trump, bid sources say the U.S. bid did not ask him to make direct appeals to voters, unlike when Obama was president. But he did become involved via his favourite medium as president: Twitter. The interventions were inflammatory.\nOn April 26, 2018, a couple of months before the vote, Trump wrote: “The U.S. has put together a STRONG bid w/ Canada and Mexico for the 2026 World Cup. It would be a shame if countries that we always support were to lobby against the U.S. bid. Why should we be supporting these countries when they don’t support us (including at the United Nations)?”\nThe tweet was interpreted by many to be a veiled threat towards nations who rely on U.S. international aid or political support. In the case of World Cup voting, FIFA statutes forbid state intervention in football matters and decisions are supposed to be made by football executives, rather than government leaders. But the boundaries between the two can often blur.\nTake, for example, a remarkable story from the U.S. bidding process for the 2022 World Cup, when Obama was president. A message was conveyed to the U.S. bid that Jacques Anouma, then an Ivorian member of the FIFA executive committee and financial advisor under the presidency of Laurent Gbagbo, wanted a phone call from the White House to their Ivorian counterparts. While the U.S. bid initially thought the matter to be solely football-related, it rapidly emerged that this was a time of unrest and violent clashes in the Ivory Coast, and Gbagbo would later be charged in connection with violence following a disputed election in 2010. The violence contributed to the deaths of 3,000 people. He went on trial at the International Criminal Court, denying all allegations, and was later acquitted. The White House at the time, however, were concerned that any phone call, even soccer-related, would be seen as a political endorsement.\nNot everyone involved in the United bid was unhappy with Trump’s intervention and several describe the Trump administration as “hugely supportive” of the bid. While they concede there were days they would wake up wondering what the president might say next, they also thought it was important for FIFA to see that Trump was engaged and wanted his country to host the tournament, even if his style was contentious.\nThe U.S. also sensed an opportunity to eat into Moroccan support within Africa, despite the confederation previously having committed to get behind Morocco. Trump made a second hint during a press conference in the White House Rose Garden alongside the Nigerian president, Muhammadu Buhari. Trump said: “I hope, all African countries and countries throughout the world, that we also will be supporting you and that they will likewise support us in our bid.”\nDirect appeals were made by Gulati throughout the bidding process to the South African federation, which swung to the United bid, as well as 10 other African nations: Benin, Botswana, Cape Verde, Guinea, Lesotho, Liberia, Mozambique, Namibia, Sierra Leone and Zimbabwe.\nAdvertisement\n“I recall United officials went to five southern African countries because there was ‘intelligence’ that said that they may not be pro-Morocco, even though there was a regional effort to lock up that sort of region,” says one person who worked on the bid. “And so they flew all over Africa with personal diplomacy. Carlos Cordeiro had access to people and he deserves credit for that win, because a broad media-driven strategy was not going to be as effective as the personal diplomacy strategy.”\nTrump still managed to have a run-in with Namibia when, during a United Nations address, he twice referred to “Nambia”, a state that does not exist. South Africa had called in U.S. officials to explain Trump’s disparaging comments about Africa, while Ebba Kalondo, the Namibian spokeswoman for the African Union, told the Associated Press news agency that Trump’s comment flew “in the face of all accepted behaviour”. The Botswana government also condemned his comments. Yet South Africa, Namibia and Botswana all voted for the United bid.\nTwo notable swings came in Russia plumping for the United bid at the last moment, and even Venezuela, impacted by the travel ban, fell in line with South American federation CONMEBOL.\nAs for the United bid, they continued to make the point that this was not about the state of play in 2018. “This is about what’s happening eight years from now,” one person recalls. “Trump’s almost certainly not going to be president eight years from now, was the view. We tried to carefully, appropriately separate ourselves.”\nWhether that will be so easy by the time the World Cup comes around will be determined by the outcome of this week’s election.\n(Top photos: Getty; Joe Raedle/POOL/AFP, Oliver Contreras/Sipa/Bloomberg, Masashi Hara; design: Dan Goldfarb)",
  "word_count": 4437,
  "scraped_at": "2026-02-14T12:10:31.915238"
}