{
  "article_id": "1c29fe9a8b14",
  "url": "https://www.independent.co.uk/lgbt/pride-list-2024-lgbt-changemakers-b2554470.html",
  "title": "The Independent Pride List 2024 : the LGBT+ people making change happen",
  "date": "20240601T193000Z",
  "domain": "independent.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Independent's journalism is supported by our readers. When you purchase through links on our site, we may earn commission.\nThe Independent Pride List 2024: the LGBT+ people making change happen\nThe Independent’s Pride List is back again, celebrating the LGBT+ community’s biggest change-makers over the past 12 months\n- Bookmark\n- CommentsGo to comments\nBritain is proud to be viewed as an accepting and inclusive nation, never better seen than during its annual Pride celebrations. Yet support must be year round in order to make positive changes in laws and attitudes to ensure the country is an inclusive environment in which everyone can thrive.\nIn an election year in which trans issues continue to be weaponised in politics in an attempt to win votes, LGBT+ inclusive sex education has become yet another polarising issue, along with the ongoing discourse around toilet use. And earlier in the year, horrific details of the tragic and disturbing murder of 16-year-old trans teen Brianna Ghey pushed the issue into full view for everyone to see.\nSobering figures from Stonewall reveal almost half of young LGBT+ people have thought about trying to take their own life, they are also twice as likely to suffer bullying, anxiety and other mental health issues.\nKey cultural queer moments of the past 12 months include the EastEnders storyline with Zack Hudson. The soap worked with the Terrence Higgins Trust to update the public’s knowledge that people on effective HIV treatment cannot pass the virus on. The BBC’s Strictly Come Dancing also had its second male same-sex dancing couple competing on the show, and they even came joint second.\nPrevious annual lists have included the likes of Suzy Eddie Izzard, Dame Kelly Holmes, Miriam Margolyes and Gok Wan. Their omission from this year’s list is not to say they’re no longer valued in this space, much to the contrary.\nSome people from last year have featured again as it’s key not to underestimate the importance of visibility by taking LGBT+ people into the homes of middle England. Longevity of careers and dedication to the cause have also earned some people a consecutive place on this year’s list.\nIncluded in the list are those deemed important trailblazers and visible ambassadors in the community.\nReflecting The Independent’s philosophy of making change happen, the Pride List is not just a roll-call of big names but honours the influence of those making a difference to LGBT+ lives in Britain and beyond. Publishing the list today marks the start of Pride Month, which culminates in the annual Pride in London march on Saturday 29 June.\n1. Ncuti Gatwa\nWith the return of the world’s most famous doctor this year, Ncuti Gatwa has become the 15th incarnation. He is not only the first person of colour to play the part, but also the first openly queer person to do so. His starring role gave visibility to queer people of colour, marking a pivotal moment in the TV show as it celebrated its 60th birthday.\nGatwa, who came out publicly as queer last August, first appeared in the Christmas Doctor Who specials in 2023, but you may recognise the Scottish-Rwandan actor from Netflix’s hit Sex Education, where he played Eric Effiong and earned a Bafta, or as one of the Ken dolls in the hit Barbie movie.\nGatwa has also used his platform to criticise the government’s anti-trans rhetoric. He said trans people have been used as a scapegoat, and openly attacking trans people is being normalised, leading to an increase in hate crimes against the trans community.\n2. Alex Scott\nFormer professional footballer, and now top sports commentator, Alex Scott is known for representing England with the mighty Lionesses and Great Britain in the London 2012 Olympics as well as fronting the Women’s World Cup football coverage in July 2023 and for taking part in Strictly Come Dancing in 2019.\nThis year, Scott has spoken about the racist and misogynistic abuse she has previously suffered, including being trolled online after being wrongly named as replacing Sue Barker in A Question of Sport. She said the trolls had claimed she only got her BBC job because she was “ticking some mythical ‘diversity box’”. Though she doesn’t often speak about her relationships, she confirmed her relationship with singer-songwriter Jess Glynne late last year after keeping it under wraps for some time.\n3. Victoria McCloud\nAs the UK’s first trans judge, Victoria McCloud was also the youngest judge of the Queen’s Bench (now King’s Bench) when appointed aged just 40 in 2010. McCloud resigned from the role in April in order to apply to intervene in a Supreme Court appeal brought by For Women Scotland, which she couldn’t do while still a judge.\nIf the appeal is successful, it would affect the whole of the UK, not just Scotland, and it would mean women like her, who have their transgender identity on their birth certificate (known as a gender recognition certificate) would no longer be recognised as that gender. This would affect an estimated 9,000 people who would have to be recognised only as having the gender they were assigned at birth. McCloud has also said that when she transitioned in the Nineties, it was a more liberal and accepting time compared to now.\n4. Andrew Scott\nLoved for his role as the “sexy priest” in Phoebe Waller-Bridge’s hit comedy Fleabag, Andrew Scott has been having a moment for some time now. First this year came his starring role as Adam in the gut-wrenchingly beautifully filmed and written All of Us Strangers alongside Paul Mescal, which fans say has been criminally overlooked for an Oscar. In the film, the pair form a tender relationship where both need each other to heal past traumas. For Scott’s character this meant fantasising about finally being able to come out to his parents who died in a car crash when he was a child and realising he was gay during the Aids crisis in the Eighties. Clarisse Loughrey, The Independent‘s chief film critic, gave the film five stars and said Scott is “an actor of fierce intelligence, [who] channels shrewdness into tragedy for the greatest performance of his career”.\nIt was quickly followed up by his spine-tingling creepy rendition of Tom Ripley in the Netflix series, Ripley, based on Patricia Highsmith’s books. Scott plays a remorseless and machiavellian character who is obsessed with Dickie Greenleaf (Johnny Flynn).\nThough Scott talks openly about his sexuality now, he recently revealed he had been advised to keep it private within the industry, but came out in 2013 in an interview with The Independent.\n5. Wes Streeting\nAs the shadow secretary of state for health and social care, Wes Streeting could be about to become a key member of the next government.\nStreeting is the Labour candidate for Ilford North, vice president of the Local Government Association, a patron of LGBT+ Labour, previously worked at Stonewall and has condemned the toxic culture around transgender equality.\nLast year saw the publication of his first book, One Boy, Two Bills and a Fry Up: A Memoir of Growing Up and Getting On, detailing his upbringing in a working-class family. He came out as gay in his second year of university while at Cambridge. He’s also a practising Anglican and has spoken about how his faith made it hard for him to accept his sexuality. His partner is Joseph Dancey, a communications and public affairs adviser.\n6. Crystal\nFirst appearing on the UK’s first RuPaul’s Drag Race show in 2019, Canadian-born drag artist Crystal has gone on to host queer TV shows and their own podcast too.\nOutside of broadcasting, Crystal was known for becoming embroiled in a Twitter argument with now-disgraced actor Laurence Fox in 2020. After Fox called for people to boycott Sainsbury’s for supporting Black History month on the social platform, Crystal said Fox was a racist, which he denied. He then went on to call Crystal a paedophile, which as well as being defamatory is also a historic trope for gay men.\nFormer Stonewall trustee Simon Blake was also involved in the Twitter exchange and also falsely accused of paedophilia, and joined Crystal in taking Fox to court. The case lasted three-and-a-half years, finally ending this year when Crystal and Blake won, and were awarded £90,000 each. Crystal has gone on to speak out about online trolls and the extreme levels of abuse they’ve faced since Fox defamed them.\n7. Rosie Jones\nComedian, actor, writer and children’s book author Rosie Jones has been in shows such as Casualty and Call The Midwife, written for hit TV series Sex Education and The Last Leg and often appears on comedy panels.\nLast year Jones, who was born with cerebral palsy, made a hard-hitting documentary based on one of thousands of abusive messages she receives daily on Twitter/X. She reported one which read “you are retarded”, but the social media platform refused to take action, which led her to make the documentary Am I Retarded? on Channel 4. Jones, who came out as gay in 2017, used the documentary to raise awareness of how serious the tirade of abuse is and to highlight how little discourse or support there is around ableist online trolling.\nJones also strives to make comedy and TV more inclusive as, growing up, she only saw white males as comedians, but never saw any lesbian disabled people, like her. Any token disabled people that she did see on the TV were often portrayed as victims and weren’t thought to have sexualities, she said.\n8. Tia Kofi\nRuPaul’s Drag Race has seen such huge success both in the US and UK, that it led in 2022, to a spin-off series, RuPaul’s Drag Race UK vs The World, which airs on the BBC and has international visibility.\nLast year the second series was won by Tia Kofi, who was crowned “Queen of the Mothertucking World”. Kofi had come second in the main RuPaul’s Drag Race show back in 2021, so finally winning was not only a personal victory, but Kofi was also the first person of colour to ever win a UK series, and only the fifth to make it to the final. Kofi said it was important to them to be the first person of colour winner, as it meant they were able to represent people who haven’t seen themselves reflected on Drag Race UK.\n9. Self Esteem\nRebecca Lucy Taylor is best known by her stage name, Self Esteem. Through her solo pop career, she’s continually championing diversity and inclusivity, where her experience of being bi, working class and from the North feeds into the diverse narrative of her music.\nHer work channels her own insecurities, from society’s pressures around body sizing and perceived beauty and youth to the everyday experiences of thirtysomething women. It’s these narratives that steer away from traditional moulds of pop that make her so relatable to her audience.\nShe came out as bi in 2013, and her second album Prioritise Pleasure album earned her nominations from the Brits and Mercury awards. Though she didn’t win, she encouraged the Mercury Prize organisers to donate the food that would have been served at the event to the homeless, after it was postponed following the news of the Queen’s death in 2022. In 2023, she was made an honorary Doctor of Music at the University of Sheffield, near to where she grew up in Rotherham.\n10. Olly Alexander\nOlly Alexander has broken free from being known as Years & Years’ frontman, with a successful solo singing and acting career, playing the lead role in It’s A Sin about young people in London during the Aids crisis.\nThis year saw him represent the UK in the Eurovision competition with his Eighties-inspired pop bop, “Dizzy” with spoken sections in low tones that mimic the Pet Shop Boys’ style.\nBefore he was revealed as the UK’s act, in October 2023, Alexander, along with other artists, signed an open letter from LGBT+ activist group, Voices4 London, calling for an immediate ceasefire in Gaza. The letter described what was happening in Gaza as “genocide” and also called Israel an “apartheid regime”, which led to calls for the BBC to remove him, which they rejected as it happened before he was announced as the representative.\nControversy followed and this year, Queers for Palestine (another activist group) called for Alexander to boycott the competition, suggesting that taking part in the event alongside Israel’s entrant normalised the war in Gaza. Alexander issued a statement that said he would stay in the competition, but that he stands “united against all forms of hate, including antisemitism and Islamophobia”.\n11. Layton Williams\nOne of the UK’s most popular TV shows, Strictly Come Dancing saw its second male same-sex couple take to the dancefloor together in 2023.\nActor Layton Williams (known for Bad Education) was partnered with Ukrainian professional dancer Nikita Kuzmin, which once again brought same-sex couples right into the homes of British families on primetime TV programming. The pairing followed in the footsteps of the show’s first male and female same-sex couples, Nicola Adams and Katya Jones in 2020, and John Waite and Johannes Radebe in 2021.\nWilliams and Kuzim’s pairing was hugely powerful and saw them come joint second in the competition, with EastEnders actor Bobby Brazier and Dianne Buswell.\n12. Jonathan Bailey\nJonathan Bailey is having a huge year, that’s only going to get bigger. In 2023, he starred alongside Matt Bomer in the romantic drama miniseries Fellow Travelers, which depicts a male romance beginning in 1950s America and running up to the Eighties. For his role, Bailey won a Critics’ Choice Television Award for Best Supporting Actor.\nMay also saw the return of Netflix’s raunchy Regency-era period drama Bridgerton. It was the first series that thrust Bailey into stardom and made him a heartthrob. He’s also playing Fiyero Tigelaar in the two-part film adaptation of the West End’s musical, Wicked, opposite pop superstar Ariana Grande and British singer and actor, Cynthia Erivo (also in this list).\nAs a gay actor, his roles aren’t limited to his real-life sexuality. Though it’s widely known he prefers to keep his private life away from the spotlight, he works hard to be visible and to be the role model that he didn’t have growing up, and supports LGBT+ charities noting that young LGBT+ people are much more likely to suffer with poor mental health.\n13. Beth Mead\nArsenal and Lionesses player Beth Mead, along with fellow Arsenal player and partner, Vivianne Miedema, made an impactful five-part documentary, Step By Step in 2023, about injuring their anterior cruciate ligaments (ACL).\nBoth of them suffered the same injury in consecutive months in November and December 2022. It is an agonising tear or sprain that often makes a terrifying loud sound when it happens, resulting in surgery and a painful and long road to recovery that can be anywhere from six months to a year.\nOf course, with that come lengthy periods away from the sport and a loss of fitness, but aside from the physical issues there are mental issues too. There’s been a rise in the number of women in sport suffering from these injuries. They are six times more likely to suffer one than men, due to factors including the width of women’s hips, boots being designed for men and a lack of strength and conditioning from a younger age. The documentary raised awareness, with them trying to help younger players avoid the same problems they had endured.\n14. Juno Dawson\nAuthor Juno Dawson has long been an active voice for trans people. Her first book, This Book Is Gay, was written 10 years ago and is one of the most banned in the US. Why? It’s about relationships and sex education for the LGBT+ community. Dawson is still standing strong on her belief as a former teacher in helping teenagers and young adults navigate everything from relationships and love to families and more through her books.\nIn 2022, Dawson released a hit fantasy book Her Majesty’s Royal Coven. In the last year, she hosted The Official Doctor Who Podcast and brought her much-loved So I Got to Thinking podcast based on Sex and The City to a close.\n15. Pet Shop Boys\nWith a new album out, the Eighties duo, Neil Tennant and Chris Lowe, continually prove themselves one of Britain’ best pop acts. Much of their 40-year career has celebrated queer culture, despite Tennant (who keeps his life fairly private) only coming out in 1994, and Lowe keeping an even lower profile both on and off the stage having never openly spoken about his sexuality.\nThe band’s 15th studio album, Nonetheless, was given 4 out of 5 stars by The Independent‘s chief albums critic, Helen Brown and is full of the disco synth and their signature spoken lyrics. In her review of the album, Brown says: “Romance and threat are balanced like a stiletto on a wonky kerb as Tennant launches into one of his deadpan Brit ‘West End Girls’-style raps – a neat tribute to the 1984 hit, which celebrates its 40th birthday this month.”\nThe album’s track, “New London Boy” is based on Tennant’s own experience of London’s gay scene in the Seventies, with lyrics like: “Skinheads will mock you/ Call you a f**. Last laugh is yours/ There’s a brick in your bag”, which Brown says is a reference to a Geordie drag queen who carried a brick in her handbag for self-defence.\n16. Joe Lycett\nForever a wind-up merchant, Joe Lycett is one of the most prominent bisexual men in comedy whose popularity seems to know no bounds. He does seem to ruffle some feathers every now and again, such as when he planted fake news stories in the media earlier this year. Critics claimed it was unfair on already short-staffed and struggling news rooms.\nIn 2023, his TV show Late Night Lycett, was widely praised for reinvigorating the tired chat show format including working with his two aunties, Pauline and Margaret. A real celebration of queer culture with gay icons such as Joanna Lumley, Alan Carr and plenty of hun culture, it won a Bafta at the 2024 Awards.\nAs well as his comedy in stand-up and his TV show, Lycett uses his platform to call out homophobia too. In October 2023, Lycett used his classic sarcastic letter writing technique to masquerade as a Tory supporter, tweeting former home secretary, Suella Braverman, who had claimed “simply being gay is not enough” to claim asylum, and pretended to agree with her.\n17. Rylan\nAnother long-standing member of the LGBT+ community, Rylan’s ever-presence on our screens as a presenter, radio DJ, podcaster and author is always joyous and serves as visible representation on everything from morning breakfast shows to primetime TV and radio shows.\nIn 2023, Rylan played himself in the UK’s longest running soap, The Archers on Radio 4, where he stopped at the fictional village in Ambridge to judge the village’s Eurovision Variety Show on his way to Liverpool to present the Eurovision song contest. Though it had its first openly gay character way back in 1996, followed by a gay marriage in 2006, his inclusion was still a pivotal moment in the show, which is still listened to by millions of people.\n18. Hanif Kureishi\nAuthor Hanif Kureishi is one of Britain’s best contemporary writers, having penned My Beautiful Laundrette and The Buddha of Suburbia, both of which feature gay relationships as a nod to Kureishi’s bisexuality. The Buddha of Suburbia is semi-autobiographical and the protagonist Karim Amir is a mixed-race queer teenager growing up in Bromley, who is desperate to escape to the far more exciting and open London.\nSince the start of 2023, Kureishi has been writing weekly newsletters via his Substack, The Kureishi Chronicles, which has more than 26,000 subscribers worldwide. It has become his creative outlet which he dictates from his hospital bed following a near-death collapse in Rome in December 2022 which has meant he is unable to write himself as he has lost the majority of movement in his limbs. Dictated to his wife or sons, his weekly writings are eloquent and deeply thoughtful, covering subjects such as the loss of sexuality, his new daily life and memories from before the accident among many other topics. His book, Shattered, will be published later this year,\n19. Sir Elton John\nGracing the world-famous Pyramid stage at Glastonbury, Sir Elton John said there was no more fitting place to say goodbye to his British fans as part of his final tour, Farewell Yellow Brick Road. His performance was the most-watched from the festival ever, with 120,000 people in the crowd and 7.3 million viewers at home, doubling the previous record held by Diana Ross.\nHe finally ended the tour in July last year, after it went from the planned three years to a lengthy five years due to the pandemic and a hip injury. Though 77 now, John played 330 concerts and the tour became the second-highest grossing of all time, making $939.1m (£736m) just behind Taylor Swift’s Eras tour which grossed $1bn.\nJohn has long been an icon in the LGBT+ community, having came out in 1976 by telling Rolling Stone magazine he was bisexual aged just 29. Turning to politics last year, John (along with husband David Furnish) also released a statement after former home secretary Suella Braverman said “simply being gay is not enough” to claim asylum.\n20. Russell T Davies\nWelsh screenwriter Russell T Davies previously worked on Doctor Who between 2005 and 2010, and came back in 2023 as the head writer of the new series to celebrate its 60th anniversary, which fittingly stars Ncuti Gatwa as the show’s first openly gay central figure.\nDavies has long championed the LGBT+ community and represented it on screen with the likes of Cucumber in 2011 about Manchester’s gay scene and later Banana. One of his most famous and best works was It’s A Sin, a semi-autobiographical show about the HIV and Aids crisis during the Eighties and Nineties, where Olly Alexander took the starring role and the Pet Shop Boys wrote the theme tune.\nIn his personal life, after being together for 13 years, Davies cemented his relationship with Andrew Smith with a civil partnership in 2012 following Smith’s cancer diagnosis. Smith died in 2018.\n21. Wegan\nNicknamed Wegan, a mashup of their actual names, Whitney and Megan Bacon-Evans, they are an influencer couple who campaigned to help change the unfair rules about IVF NHS accessibility for same-sex couples.\nIn 2021, they launched a landmark judicial review into discrimination they faced accessing IVF treatment as a lesbian couple claiming it amounted to a “gay tax”. As a lesbian couple, they’d have to go through 12 rounds of artificial insemination before the NHS would consider them for IVF, which the couple said could cost up to £50,000, compared to a straight couple who would be considered for it after two years of unprotected sex. Their campaign ended in July 2023 with a victory as NHS Frimley Integrated Care Board (ICB), their local clinic, agreed to address the inequality.\n22. Andrew Lumsden\nIn 2022, Pride celebrated its 50th anniversary since it started its annual marches, which was no doubt in part made possible by one hugely influential LGBT+ activist, Andrew Lumsden who sadly passed away in November 2023, aged 82.\nThe trailblazing figure was key in pushing for LGBT rights which he began campaigning for in the Sixties, including demanding that homosexuality wasn’t treated as a sickness, calling for changes to laws, and for public attitudes to allow freedom for all. He helped organise the first Pride march which took inspiration from New York’s movement, and he went on to be a founding member of the Gay Liberation Front’s (GLF) London chapter in the Seventies.\nAs a journalist, Lumsden also set up Gay News, a fortnightly paper writing positively about the LGBT community, at a time when national papers refused to write about homosexuality, or only published stories framing it within criminal activity. Later in the Eighties, he became the first gay editor at a mainstream publication when he took the editorship of the New Statesman, where he also came out to his readers.\n23. Nancy Kelley\nNancy Kelley was the CEO of LGBT+ rights charity Stonewall, until stepping down in July 2023. In that time, Kelley oversaw Stonewall’s campaign to ban conversion therapy (an outdated practice used to “cure” certain sexual orientations or gender identities on the grounds that they are mental illnesses) and continued its powerful work pushing for more inclusive sex and relationship education in schools. Kelley worked to break down barriers for trans and non-binary people to live safely, and continued to push for equal human rights so that LGBTQ+ people everywhere can live their lives to the full.\nAs a gay woman, she lives in London with her American civil partner and their two sons who they adopted, which she says is possible only thanks to Stonewall’s campaigning.\n24. Graham Norton\nLast year marked presenter and chat show host Graham Norton’s 25th year in broadcasting. He is famed for his instantly likable charisma and a relaxed and quick-witted style that’s often riddled with innuendos, The Graham Norton Show alone has run for 17 years, and counting. The cheeky Friday night entertainment show sees the world’s biggest celebrities, actors and artists gracing the famous red sofa, and inevitably getting the giggles after a drink or two and revealing more in their anecdotes than their publicist would like them to.\nHis smooth style that puts interviewees at ease has earned him the accolade as the king of the chat show and borderline national treasure status. Norton also had the honour of presenting the campest of all shows, Eurovision, in Liverpool, which hosted it on behalf of 2022’s winner, Ukraine.\n25. Jack Rooke\nFollowing the first successful series of Big Boys in 2022 which resulted in six Bafta nominations, comedian and TV writer Jack Rooke’s second series was released in February this year to rave reviews. Nick Hilton, The Independent’s chief TV critic, gave the new series 4 out of five stars, saying Rooke’s comedy is “something to be savoured”.\nRooke is praised for his ability to portray serious issues and feelings but with hilarious comedy to lighten the load while connecting with middle England. The comedy is loosely based on Rooke’s 2020 memoir, Cheer the F**k Up and Edinburgh Fringe shows about Rooke’s mental health after two devastating deaths, including that of his father Laurie who died from cancer when Rooke was just 15, and the suicide of his best friend, Olly.\nThe coming-of-age tale focuses on a bunch of misfits at the fictional Brent University in 2014 and offers a portrait of LGBT+ lives at the time, with heavy doses of niche pop culture. It dives into men’s mental health, coming out, unlikely friendships, the nuances around family and chosen family and plenty of laugh-out-loud gags.\n26. Joseph Galliano-Doig\nCo-founder of Queer Britain, the UK’s first LGBT+ museum and former editor of Gay Times, Joseph Galliano-Doig was awarded an MBE for services to heritage, charity, and diversity and inclusion in the 2024 New Year’s Honours List.\nQueer Britain was opened in 2022 in King’s Cross to tie in with Pride’s 50th anniversary. It’s the largest museum of its kind in the world, which reflects every race, gender and orientation to give representation to minorities that are often overlooked or forgotten in history. It fills an important gap in the country’s rich cultural landscape, and is a shared space for people to come together. Inside, it houses item such as Oscar Wilde’s prison cell door, Olly Alexander’s outfit from his Glastonbury 2016 performance and a wall where visitors are encouraged to write their response to the question “what does it mean to be seen?”\nGalliano-Doig talks about continually coming out from the age of 15 and the multiple times throughout life he has to do it again, from meeting new people to even correcting shop assistants. He hopes the museum is a place for people to learn more about the LGBT+ community and to be accepting of everyone.\n27. Phyll Opoku-Gyimah\nThe British political activist, also known as Lady Phyll, is celebrated for her work on race, gender and LGBT+ rights and is a prominent lesbian activist. She co-founded the UK Black Pride movement in 2005 and was appointed as the first CEO of UK Black Pride in November 2023. The role is seen as groundbreaking as the first full-time role of its kind, and is testament to Opoku-Gyimah’s unwavering support. She was previously Black Pride’s executive director, as well as the executive director of Kaleidoscope Trust, which campaigns for LGBT+ rights around the world. Though she has stepped down from Kaleidoscope Trust, she continues her support as a patron of the organisation.\nThe new Black Pride role was created following the success of 2023, and the need for year-round events, as well as pushing for more change and to break down barriers that the LGBT+ Black community face.\n28. Yasmin Finney\nYasmin Finney is no stranger to our TV screens – nor this list, where she was also featured last year. Finney first made a name for herself in the breakout role playing trans character Elle Argent in the LGBT+ teen drama Heartstoppers. For this debut performance, she was nominated by the Children’s and Family Emmy Awards for the Outstanding Supporting Performance award.\nThe 20-year-old trans actor has also taken up the role of Rose Noble in Doctor Who, though she’s not the first openly trans person to be cast in the long-running show, which was Bethany Black in 2015. Finney also plays a trans character in Doctor Who, and has said she hopes her visibility helps other people like her, though she doesn’t want to be pigeonholed in her roles. Finney has spoken out about not being privileged enough to have gone to drama school or to see theatre productions regularly.\nFinney first gained a following on TikTok, where she shared her life as a teenage Black trans woman in Britain to her two million followers, as well as appearing on the covers of British Vogue, Elle UK and Teen Vogue.\n29. Andrew Haigh\nOne of the biggest films so far of 2024 has undoubtedly been All of Us Strangers. Though it was widely described as being snubbed at the Oscars, it earned six BAFTA nominations and was given five out of five stars by The Independent‘s chief film critics, Clarisse Loughrey.\nWritten and directed by Andrew Haig, the intimate lucid drama is about loneliness, trauma, grief, gay identity and the HIV/Aids crisis. It’s loosely based on Japanese writer Taichi Yamada’s 1987 novel, Strangers, about a man who meets two strangers who he thinks resemble his dead parents.\nSome of it is very close to home for Haigh, not just metaphorically, but also physically as some scenes were shot in his own childhood home. Haigh has talked about the loneliness he felt in his 20s and how he wanted to cast a gay actor in the lead role. In his personal life, Haigh is married to novelist Andy Morwood and they have two daughters together.\n30. Jill Scott\nJill Scott has been a brilliant representative for womens’ football on Gary Neville’s popular Overlap podcast. She’s woven her sexuality and the challenges she’s faced into funny and touching segments, subverting traditional blokey football commentary and bringing LGBTQ+ issues to the podcast’s million subscribers.\nThe former professional footballer is known as part of the Lionesses’ winning Euros team in 2022 (second to being crowned Queen of the Jungle), and continues to be a powerful advocate for women’s football. She’s still integral in inspiring more women to get involved in the sport and shedding the stigma that the women’s game is inferior.\nEarlier this year, she spoke out about how keeping women’s football in smaller grounds means it will never have the opportunity to grow. Scott has been engaged to long-term partner Shelly Unitt since March 2020.\n31. Cat Burns\nBritish-Liberian artist Cat Burns is one of music’s most exciting rising stars and writes about her experiences as a Black queer woman in her music. Her song “Free” describes how hard she found coming out, including lyrics such as: “If you only knew/ how scared I was to tell you”, continuing with “Living a lie for a life can be tiring/ So I choose the truth”. She has also spoken about finding it hard to reconcile her sexuality with her ethnicity.\nLargely inspired by the gospel music her mother sang, she first found fame on TikTok in 2020, aged just 20, with her song “Go”. This went on to chart at number two in the UK singles and earn her nominations for both an MTV Europe Music Award and three BRIT Awards, including Song of The Year, Best Pop/R&B and Rising Star, as well as singing at the BRIT Awards 2023 ceremony.\nAs well as talking about her sexuality, Burns has been open about the struggles she has recently faced after being diagnosed with both autism and ADHD. This July will see the release of her highly anticipated debut album, Early Twenties.\n32. Nicholas Cullinan\nArt historian and curator Nicholas Cullinan previously oversaw the National Portrait Gallery’s biggest overhaul in history, which cost a staggering £41.3m.\nAt the start of the year, Cullinan was appointed director of the British Museum, the UK’s biggest museum, a role which he’ll take up in the summer. He’s said it will be “the most significant transformations, both architectural and intellectual”.\nIt was his leadership in the three-year renovation of the National Portrait Gallery that attracted the board to Cullinan. He’ll oversee a decade-long modernising project planned for the British Museum encompassing both the building and all of its collections too, and which is expected to cost £1bn. Cullinan’s appointment of one of the world’s most important and prestigious museums, as a gay man, is a big one for the LGBT+ community as well as the art world.\n33. Clare Balding\nAs a longstanding broadcast journalist and sports commentator, 2023 saw Clare Balding take over the reins as the BBC’s lead presenter for Wimbledon, replacing Sue Barker, who retired after serving an impressive 30 years.\nAgain this year, Balding will spearhead the BBC’s coverage at Wimbledon. As an award-winning journalist, she’s worked at the tournament as a reporter, commentator and presenter for the BBC since 1995. Balding has long been synonymous with sport, including becoming an amateur flat jockey. She has also broken down gender barriers in sport commentating and representation, including presenting the America’s Cup, and with her presidency of the Rugby Football League until December 2022. Balding publicly came out in 2003 and entered a civil partnership with radio presenter partner Alice Arnold in 2006, and converted it to a marriage in 2015.\n34. Cynthia Erivo\nCynthia Erivo continues to be one of the most visible queer British Black women at the moment, which also earned her a place in last year’s Pride List.\nThis year will see the release of the long-awaited first part of the film Wicked, where she plays Elphaba Thropp alongside Ariana Grande and British actor Jonathan Bailey (also in this list) which will show off both her acting talents and her powerful voice.\nFor her work, she’s won Emmy, Grammy and Tony awards, while aside from her acting and singing, she’s also a prominent activist championing the LGBT+ community. She was recently awarded the Rand Schrader award (named after an American Aids and gay activist) at the Los Angeles LGBT Centre gala, where she was praised for her achievements in activism and entertainment.\n35. Sam Smith\nOscar and Grammy-winning singer Sam Smith, who announced in 2019 they were non-binary, is the modern epitome of non-confirming queerness.\nMore recently, Smith has become known for their fashion as well as their music, which was noted at the December 2023 British Fashion Awards. Here, Smith won the Cultural Innovator Award, and their outfit fittingly paid homage to the late Vivienne Westwood.\nLast year saw the release of their album Gloria, celebrating queer identity and experience and the song Unholy won a Grammy award in 2023. It’s named after what Smith calls the possibly feminine energy that’s been freed from inside of them.\nWith songs such as “I’m Not Here To Make Friends”, they’re continually making statements that are more cheeky than anything but become steeped in controversy. Critics call the music video “vulgar”, while defenders say the response is queerphobic. Later this year, the artist will be headlining the BBC Proms, as will Florence Welch of Florence + The Machine.\n36. Alan Cumming\nThe Scottish actor is the host of the US series of The Traitors. Last year, saw America’s second series which was full of serious drama and theatrics, treachery and plenty of tartan and showmanship from Cumming. The US show was expected to hit the UK at the start of 2024, though fans will have to wait a little longer than expected.\nCumming is bisexual and supports plenty of charities, including LGBT Youth Scotland. Though he’s a supporter of the movement, he’s also said he wishes there wasn’t a need for Pride, in the hope of a more inclusive society.\nLast summer, he helped produce the UK version of Broadway musical A Strange Loop, written by playwright and composer Michael R Jackson. It’s a musical about a Black gay man writing about a man writing a musical and the Broadway show was nominated for 11 Tony Awards and went on to win best musical and best book of a musical.\n37. Sandi Toksvig\nDanish-British presenter came out as a lesbian in 1994, despite warnings she’d never work again. After she did so, her family received death threats.\nShe’s been a forthright campaigner on gay marriage in the UK, reinforcing the idea that being gay is not a lifestyle choice. Last year marked 10 years since the landmark gay marriage ruling, and on 17 July 2013 (the day gay marriage was passed through) she renewed her vows with partner Debbie Toksvig, and their 2007 civil partnership was later recognised as a marriage.\nToksvig has long spoken out against the power of the church when it comes to gay marriage. In 2022 she wrote an open letter to the Archbishop of Cantebury, Justin Welby, after he reaffirmed the church’s long-held position that gay marriage was wrong. The following year, Toksvig and Stephen Fry sent a joint letter to then justice secretary, Dominic Raab, calling for humanist marriages to be recognised, claiming their unofficial status discriminates against LGBT+ people, noting that two thirds of queer people are not religious.\n38. Kelly Simmons OBE\nAs the former director of the Women’s Professional Game at the FA, Kelly Simmons retired after a successful 30-year career working there. During this time, Simmons made landmark contributions, including to help totally transform the landscape, outlook and attitudes towards women’s football.\nShe also helped pave the way to establish England’s women’s youth teams and drive the success of the Women’s Super League and Women’s Championship. She helped make the Women’s Super League fully professional at the start of the 2018-19 season.\nSimmons used to be branded “crazy” on social media after airing ambitious hopes for women’s teams. When she started the role, there were 80 women’s teams, and now there are more than 3 million women and girls playing the sport across the country, thanks in part to the Lionesses’ Euros win. Simmons is now part of the group responsible for delivering the recommendations made in Karen Carney’s review of women’s football.\n39. Amber Bain\nAmber Bain goes by the stage name The Japanese House, pointing to the name of the summer home Bain stayed in as a child and where she experienced her first queer romance with the girl next door. Through her music, she’s amassed a wide following among teenagers, transforming her into an icon among the young LGBTQ+ community.\nThough she now says she’s “fallen in love with the whole queer experience”, in an interview with The Independent, she also notes that she first found it hard to come to terms with being gay.\nShe’s been making music since 2015, and has been much celebrated for her new album, In The End It Always Does, whose songs openly refer to her sexuality and relationships with women. The song “Friends” referred to sex in a polyamorous relationship and was about Bain being in a throuple.\n40. Oliver Hermanus\nOne of this year’s hit TV shows is Mary and George, based on Benjamin Woolley’s 2017 non-fiction book The King’s Assassin. The bawdy 17th century miniseries sees Mary (Julianne Moore) use her best weapon, her son George (Nicholas Galitzine), to change the fortunes of a family who have been left with nothing. Her plan is to pimp out her son and make him the lover of King James I, whose homosexuality is apparently well known.\nDirected by self-described queer artist, Oliver Hermanus, the work is an erotic drama full of deceit, betrayal, seduction and lust. The South African was previously best known for directing Moffie in 2019. The film’s title is an Afrikaans’ anti-gay slur and is based on an autobiographical novel by South African writer André Carl van der Merwe about his time serving in the South African army during apartheid. Other recent works include the compellingly beautiful film Living in 2022, where Bill Nighy gave a “standout” performance, according to The Independent‘s film critic Clarisse Loughrey.\n41. Sue Day\nSue Day was, until earlier this year, the chief financial officer and chief operating officer of the Rugby Football Union.\nAs a former England rugby captain, she’s continually been a driving force for quality in sport, for which she was awarded an OBE in 2020. Back on the pitch, Day is England women’s top try scorer with 61 tries in 59 caps. In 2013, she became the first female president of Wasps FC in their 146-year history.\nShe’s also a founder trustee of the Women’s Sports Trust which promotes women’s participation in football by ensuring there are decent facilities, equipment and opportunities. Day will go on to become the FA director of women’s football later this year, where she’ll be responsible for leading the next phase of development for young women and girls.\n42. Munroe Bergdorf\nTrans model and activist, Munroe Bergdorf was appointed as UN Women UK’s first UK Champion at the end of 2023, continuing to be a visible person within the trans community.\nThough her appointment in this role sparked backlash from some groups, Bergdorf has continued to speak out about equality for trans people and transphobia. In July 2023, she said that even though Gen Z are the most out queer generation, they’re growing up in the most transphobic time in memory. She’s also called to help protect LGBT+ nightlife amid the closure of queer venues.\nLast year also saw Bergdorf publish her book, Transitional: In One Way or Another, We All Transition. Part moving memoir and part powerful manifesto, Bergdorf uses her own experience to show transitioning is deeply rooted in human experience.\nIn 2017, she made history and became the first trans face of L’Oréal, though controversy soon followed after social media posts she made calling out white supremacy came to light which led to her being let go and an onslaught of online abuse. She was later re-hired in 2020.\n43. David Hockney\nAs one of the most influential and recognisable artists of the 20th century, David Hockney’s work has often explored sexuality in the form of domestic situations such as pools or showers. These include Peter Getting Out of Nick’s Pool (1966) portraying the back of a naked man lifting himself out of a pool, and Man in Shower in Beverly Hills (1964). Hockney came out as gay in 1960, aged just 23. At the time, it was still illegal to be homosexual in the UK until the Sexual Offences Act 1967 law decriminalised it seven years later.\nHis immersive exhibition, “Bigger & Closer (not smaller & further away)”, opened in London’s Kings Cross in February 2023, and ended up being extended many times until the end of the year. It was so popular that it’s even coming back this year. The projection installation takes people on a journey through his seven-decade-long career, to see it through Hockney’s eyes.\n44. Robert Rinder\nCriminal barrister Robert Rinder, best known as Judge Rinder, became a TV personality via his show that started 10 years ago where he arbitrates real-life small claims disputes for which he’s dubbed the UK’s answer to Judge Judy. He also guest hosts on Good Morning Britain and previously hosted a BBC Radio 5 Live series Raising the Bar, where he demystified the legal system. He’s spoken about his experiences of being a barrister coming from a working-class background, not going to Oxbridge, being Jewish and also being gay.\nThis year, he left the courtroom and took part in a travel show, Rob and Rylan’s Grand Tour, with real-life friend, Rylan, in Italy following in the footsteps of Lord Bryon on the 200th anniversary of his death. Both have been through painful divorces in recent years. Rinder and his co-host are brought together over their shared experiences (they even shared the same lawyer) and bring a tenderness to the celebrity travelogue format, though have denied their relationship is anything more than platonic.\nRinder penned his first novel, The Trial in 2023, a whodunnit murder case set in the Old Bailey, which was quickly followed up this year with another thriller, The Suspect, published this month.\n45. Bimini\nDrag artist Bimini first hit screens back in 2021, appearing on RuPaul’s Drag Race. But since then, they’ve reached new heights, including being friends with London Mayor, Sadiq Khan, where Bimini was even present at Khan’s recent signing-in ceremony after securing a third term as mayor this year. Khan had previously tweeted in support of Bimini in 2021 after being dismayed that they didn’t win Drag Race.\nEarlier this year at the Brit Awards, Bimini used their platform as a presenter to share a vital and powerful message for trans and non-binary people across the UK. Their speech started by saying: “Right now in the UK, it’s a really difficult time for some people, trans people and non-binary people even more so… I just want you to know that everyone in this room loves you and you are valid,” before ending with the statement: “Trans rights are human rights.”\n46. Evan Davis\nEvan Davis is a visible gay journalist hosting Radio 4’s current affairs show, PM. He’s a former BBC economics editor and has also presented Today, The Bottom Line and Newsnight, as well Dragons’ Den since 2005,\nHe is largely a private person, and in the early days kept his sexuality secret at work, which he says was a mistake he now regrets. More recently he spoke out last year about how he tragically learned on his wedding day that his father had died, taking his own life following bowel cancer. It had been planned, though not to the day, as his father was an advocate for assisted dying.\nDavis married French landscape architect Guillaume Baltz in 2022 at a small ceremony for those who had not attended their civil partnership years earlier. They have been together for nearly 20 years.\nHe’s talked widely about knowing he was gay during his teenage years, but has previously said it doesn’t define him, saying he’s a presenter who is gay.\n47. Jack Murley\nJack Murley is a ground-breaking LGBT+ sports broadcast journalist. He’s hosted the BBC’s LGBT Sport Podcast since 2018, which is the first and only dedicated show shining a light on sport stars around the world who are also members of, or connected to, the LGBT+ community.\nThis year, the same show’s format has morphed into the The Jack Murley Sports Show, continuing his expert storytelling within sport and queer communities. He quickly garnered a reputation for being a go-to voice on the LGBT+ sporting community and his work helps give a voice to a part of the LGBT+ world that’s often spoken for without a seat at the table. He’s talked about being gay and often calls out homophobic criticism over his coverage.\nHe’s interviewed more than 350 people for the podcast, and past guests have included Charlotte Galloway, co-founder of Women’s Football Collective and Jake Daniels, the UK’s first publicly gay professional footballer.\n48. Edward Enninful\nAfter stepping down as editor of British Vogue a year ago, Edward Enninful’s influence has continued across the fashion world as a Black gay man, where he still champions representation across the spectrum, including LGBT+, disability and race.\nLast year he was one of the few major fashion figures to speak out against Ozempic, hitting back with covers featuring plus-sized models. He published British Vogue’s first disability issue in April last year, featuring cover stars including model Ellie Goldstein, who has Down’s syndrome, and actor Selma Blair, who has multiple sclerosis, which Enninful said was one of his proudest moments.\nHe also released his memoir, A Visible Man (which is shortlisted for the British Book Awards), appeared on the cover of Time magazine, and served as a global ambassador for the Prince’s Trust.\n49. Arlo Parks\nMercury Prize-winning British artist Arlo Parks co-wrote a song on Beyonce’s critically acclaimed new album, Cowboy Carter.\nParks told The Independent‘s music editor Roisin O’Connor that it was a “massive, beautiful surprise” to learn a song she co-wrote was included on the record-breaking album, which debuted at No 1 in the UK charts, and sold more than 40,000 copies within its first week of release.\nThe 23-year-old, who is openly bisexual, worked on the track “Ya Ya”, which samples Nancy Sinatra’s “These Boots Are Made for Walkin’” and also interpolates The Beach Boys’ “Good Vibrations”.\n50. Romy Madley Croft\nRomy Madley Croft may be better known as one third of indie band the xx, but she has finally followed her other bandmates in embarking on a solo career under the name “Romy”. Her debut album, Mid Air, was released last year and was ranked number No 1 on Attitude’s list of the 12 best LGBTQ albums of 2023. The publication said: “The lyrics remain candid and raw. The end result delivers goosebump-inducing moments that come wrapped in enthralling beats… Mid Air is a seminal record with a track suited to every mood.”\nCroft identifies as gay and the whole album is a love letter to queer clubbing, quite removed from the moody tunes from the xx, and has been produced with dance music’s artist of the moment, Fred Again. Croft was nominated for a Grammy for Best Dance/Electronic Recording for the album track “Strong” and for best British Dance Act at the Brit Awards.\nJoin our commenting forum\nJoin thought-provoking conversations, follow other Independent readers and see their replies\nComments",
  "word_count": 8506,
  "scraped_at": "2026-02-14T12:48:00.522225"
}