{
  "article_id": "1c43e3b5d078",
  "url": "https://article.wn.com/view/2024/07/17/Your_Child_Does_Not_Exist_Here/",
  "title": "  Your Child Does Not Exist Here  - Worldnews . com",
  "date": "20240717T021500Z",
  "domain": "article.wn.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Additionally, the survey showed child workers in El Salvador were predominantly male, between the ages of 14 and 17 years (75 percent), and rural (60 percent). These findings likely significantly underrepresent the prevalence of girls engaged in domestic work, a form of labor that often goes undercounted and unrecognized due to its hidden nature within households.\nThe survey found that nearly 24 percent of Salvadorans between the ages of 15 and 24 were not occupied in education or employment, in comparison to the Latin American average of 17 percent. Nearly 43 percent of Salvadorans of that age who were not studying or working were from households with incomes in the lowest 20 percent.Violence Against Children\nIn El Salvador, children and young adults face many types of violence. They experience higher levels of violence than adults, which undermines their basic human rights and threatens their development.\nAccording to Cristosal, high rates of early and forced pregnancies among adolescents, widespread sexual violence, and alarming levels of problematic alcohol consumption are related to a broader context of violence. Disciplinary practices within families frequently involve both physical and psychological abuse. Such problems, together with pervasive gang violence, contribute to elevated school dropout rates, participation in criminal groups, and migration among children and youth.\nFor years, the homicide rate among children in El Salvador has been one of the highest globally, reflecting an alarming level of violence and severe violations of the fundamental rights to life and physical security. Homicide has consistently been the leading cause of death among Salvadoran children and young people aged 10 to 19.\nThe Institute of Legal Medicine (Instituto de Medicina Legal, IML) documented some 6,300 homicides of children and adolescents (ages 0 to 19) from 2005 to 2013. Of these, the majority—89 percent—were among teenagers aged 15 to 19, and 87 percent were male. In El Salvador, 2,714 children from ages 0 to 17 were murdered, from January 2014 to March 2022, the government reported, before declaring information on homicides classified for seven years. Discrepancies in figures reported by various government agencies complicate the assessment of the true scale of child homicides.\nA study conducted in 2023 by the Pan American Journal of Public Health (PAJPH), highlights the high homicide rates among those aged 10-19 in El Salvador for the decade from 2010 to 2019. Disappearances—meaning, in El Salvador and elsewhere in the region, the seizing of people, by any perpetrator, against their will, with their fate and whereabouts unknown—have notably affected children in El Salvador. In addition to kidnappings to increase territorial control, gangs appear to use disappearances to kill, lowering official homicide counts, particularly during negotiations with governments.\nSexual violence is pervasive in El Salvador, disproportionately affecting women and girls. Between 2019 and 2022, official data show that 22,745 women and girls were victims of sexual violence. Authorities reported 5,277 female victims of sexual violence, including 2,107 of rape, only in 2022.\nThere is a high rate of teenage pregnancy. In 2015, 24,944 pregnancies were reported among girls and adolescents aged 10-19, translating to an average of at least 68 girls and adolescents becoming pregnant every day. While this figure decreased to 10,352 in 2022, it still means that, on average, at least 28 girls and adolescents became pregnant daily. A total of 496 girls under the age of 14 became pregnant in 2022. Under the law the age of consent is 15. El Salvador criminalizes abortion under all circumstances. Even if the pregnancies were a result of rape or posed serious risks to the girls’ lives and health, they would not have legal access to abortion. Click to expand Image\nA Human Rights Watch researcher visited the IVU Community (Colonia IVU), on September 22, 2023, in San Salvador, El Salvador, to investigate the impact of the government's anti-gang measures on communities controlled by gangs. © 2023 Human Rights Watch\nUnderlying causes and effects of teenage pregnancy include high school dropout rates, discrimination against women and girls, child marriage and early unions, and sexual violence. A study by the United Nations Population Fund (UNFPA), a UN agency, reported that in 2022, the Institute of Legal Medicine conducted 2,019 expert assessments related to sexual violence against girls and adolescents between the ages of 10 and 19.\nGang recruitment severely affects Salvadoran children. Gangs proliferate in areas of concentrated disadvantage. Children with limited access to essential services are at heightened risk of abuse and exploitation by gangs. Deprivation increases children’s vulnerability to coercion or enticement into gangs.\nIn El Salvador, gang membership remains a predominantly male phenomenon. According to a study based on a purposive sample of 1,196 respondents with record of gang membership, most members reported being recruited during their teenage years. The average age for joining a gang among respondents in this study was 15, for males, and 18, for females.\nThe ECLAC reported, in 2015, that gang presence affected 214 out of 262 municipalities in the country, particularly those around the city of San Salvador. A separate study found gang members were present in at least 80 percent of schools and exert control over the territories where schools are located and abuse students through threats, extortion, and recruitment. Click to expand Image\nA Human Rights Watch researcher visited the\n(Centros Urbanos de Bienestar y Oportunidades, CUBO) at the IVU Community (Colonia IVU), that seek to prevent violence by increasing economic and educational opportunities for youth in vulnerable communities, San Salvador, El Salvador, December 22, 2023. © 2023 Human Rights Watch\"Urban Centers of Wellbeing and Opportunity\"\nGangs recruit children primarily through coercion and persuasion, often within contexts of deprivation. Coercive tactics include kidnapping, violence, and threats of physical force against children or their family members. Continuing pressure, including from peers; the need for protection against harassment; and the desire to flee from abusive situations lead children to join gangs. Hundreds of families living in areas controlled by gangs have left their homes to escape violence, and in some instances, to prevent forced recruitment of children.\nRecruitment also involves promises of access to drugs, power within schools and local communities, and sexual activities, either forcibly or through relationships with gang members.\nGirls and young women experience gang violence differently. Many are coerced into non-consensual sexual relationships, known as “noviazgos,” with gang members. In such situations, they endure sexual violence, are treated as “gifts” among gang leaders, and may be trafficked sexually.\nCriminal organizations manipulate, exploit, and groom children to play diverse roles, including as assassins. Initially tasked with surveillance and tracking, children gradually receive assignments of increasing violence. To demonstrate their loyalty, children, mostly 15 and 16 years old, are often required to kill someone. Girls play traditional gender roles. Typically, the tasks assigned to them involve caregiving or monitoring, as well as the transport or hiding of drugs or weapons.\nGang membership severely alters a child’s development and potential. Children find themselves trapped in a cycle of continuous criminal activity. It can range from theft to homicide, and it effectively anchors children’s lives to the gang indefinitely.\nThe pattern of gang recruitment, in El Salvador, leads to continuous violations of children’s rights, including their right to life, humane treatment, health, education, recreation, and personal liberty.Past Security Policies\nPast governments have oscillated between closed-door negotiations with gangs, which failed to disarm gangs and protect the population, and repressive measures that increased human rights violations and failed to sustainably decrease violence.\nThe governments of Presidents Francisco Flores (1999-2004) and Antonio Saca (2004-2009) launched and implemented the “Iron Fist Plan” (Plan Mano Dura), in 2003, and the “Super Iron Fist Plan” (Plan Súper Mano Dura), in 2004. They mostly deployed joint police and military anti-gang squads to patrol the streets. According to FESPAD, a Salvadoran nongovernmental organization, authorities relied on flimsy evidence, including tattoos and overall appearance, for mass arrests of alleged gang members. More than 19,000 people were arrested between July 2003 and August 2004, FESPAD reported in 2005. Around 84 percent of those detained were later acquitted by Salvadoran judges, in most cases, due to lack of evidence. Other studies report similar rates.\nThe efforts failed to protect children and to provide lasting solutions to pervasive gang violence. Studies have found that mass incarceration ends up strengthening criminal organizations by facilitating recruitment from prisons and allowing them to develop systems of criminal control over civilian populations as detainees are released.\nThe administration of President Mauricio Funes (2009-2014), representing the Frente Farabundo Martí para la Liberación Nacional (FMLN), launched a process of negotiation, in 2012, with gang leaders from the MS-13 and from the two factions of the Eighteenth Street Gang. The aim was for the gangs to reduce killings in exchange for better conditions in prisons. The process, commonly referred to as “the truce” (la tregua), reportedly included cash payments to gang leaders and several transfers of gang leaders from maximum security prisons to less restrictive detention facilities.\nHomicide rates declined significantly between 2010 and 2013: from 64 and 70 per 100,000 people, in 2010 and 2011, respectively, to 41 and 40 per 100,000, in 2012 and 2013. But disappearances surged, and numerous studies showed that, throughout the process, gangs continued exerting control over large parts of the country and were involved in other crimes, including extortion and threats.\nIn May 2014, the truce broke down, leading to a surge in gang violence. By 2015, El Salvador had the highest homicide rate in the hemisphere, with 106 murders per 100,000 people.\nThe truce also had the unintended consequence of increasing gangs’ awareness of their political power. Repeatedly, they have unleashed waves of violence, seemingly to push the government into making concessions.\nImplementation of repressive policies has often led to human rights violations, eroding public trust in state institutions, and undermining the rule of law. Common threads in Salvadoran security strategies have included granting greater powers to state security forces (police and military); increasing prison sentences; lowering the age of criminal responsibility for children in conflict with the law; imprisoning people en masse; expanding the use of pretrial detention; and legislating new, overly broad criminal offenses, focused on people’s alleged belonging to a group, instead of their engagement in violence, such as “terrorist organizations” (organizaciones terroristas) and “unlawful association” (agrupaciones ilícitas).\nIn 2006, legislators enacted the Special Law against Acts of Terrorism, defining “terrorist organizations” broadly. The law imposes harsh punishments for acts committed by organizations that, “by their form of execution, or means and methods employed, evidence the intention to provoke a state of alarm, fear or terror in the population.” Among other concerns, the definition allows criminalizing, as terrorism, acts that cause “fear,” a relatively low threshold. Although the law requires intent to “cause alarm, fear or terror within the public,” it does not require intent to endanger lives or physical or mental integrity, or to cause other serious harms.\nIn 2010, during the administration of President Funes, the Legislative Assembly passed a law banning gangs and criminal groups, associations, and organizations. In 2015, the Supreme Court issued a ruling classifying MS-13, the Eighteenth Street Gang and others as “terrorists,” citing attempts to “assume the exercise of legal authority” from the state.\nUnder legislation in effect since 2016, gang members in El Salvador can also be prosecuted for membership in an unlawful association, under provisions that target anyone who “takes part” in gangs, who is the “creator, organizer, chief, leader financer” of a gang, or who “promotes, helps, facilitates or favors the creation or presence” of such groups or, knowing that such groups are unlawful, “receives direct or indirect benefit,” by having relations “of any nature” with gangs, “even without being a part of them.”\nUnder the Salvadoran constitution, responsibility for public safety is assigned to the National Civil Police (PNC). However, subsequent governments have blurred the line between the police and the military, involving the armed forces in internal security matters through joint patrols. Eroding the distinction between law enforcement and military roles has led to militarization of policing and an increased risk of excessive force.\nWidespread impunity exacerbates the problem. For example, between 2014 and 2018, police officers committed 116 extrajudicial killings, the Human Rights Ombudsperson’s Office reported. The Office found that only two had resulted in convictions as of late 2018. The legal framework, including a 2013 reform to the Code of Criminal Procedure, grants judges overbroad powers to dismiss charges against officers when they commit crimes “during the fulfillment of their duties.”\nInternal accountability mechanisms have largely remained ineffective. The 2014 Organic Law of the Inspector General’s Office of Public Security, charged with oversight and supervision of public safety institutions, granted the office autonomy from the police, placing it under the Ministry of Justice and Public Security. However, the unit relies on police investigation and disciplinary control units, which compromises its independence.\nRepressive approaches have led to mass arrests, often made solely on the basis of allegations, without sufficient evidence or proper legal procedures. This has resulted in rapid growth of the prison population, leading to severe overcrowding and inhumane conditions. Gangs consolidated their power within several prisons across the country. Enabled by prison policies that segregated detainees according to their membership, gangs were able to strengthen their structures from within the prisons.\nPresident Bukele’s crackdown on gangs in El Salvador stands out from previous efforts due to its unprecedented scope, intensity, and lack of checks and balances. With a legislature controlled by government supporters and a coopted judiciary, Bukele has been able to pursue these mass arrests unhindered.The Impact on Children\nPast security policies have also contributed to the stigmatization and criminalization of children and young people, particularly from low-income communities, who have often been targeted based on their tattoos, general appearance, or place of residence.\nThe stigmatization of children in high-violence environments hinders their ability to exercise and enjoy their rights. Involvement with the criminal justice system exposes them to various forms of violence, mistreatment by state officials, and barriers to securing employment, exacerbating their social exclusion.\nSalvadoran governments have often resorted to the juvenile justice system as a primary means of addressing the alleged involvement of children in gangs, and their exploitation. However, this approach fails to recognize that children are, first and foremost, victims of a series of accumulated human rights abuses. Instead of prioritizing their rehabilitation and reintegration, the Salvadoran juvenile justice system tends to treat them as criminal offenders, disregarding the complex social, economic, and psychological factors that contribute to their involvement in unlawful activities.\nJuvenile detention facilities in El Salvador have, for years, been overcrowded, understaffed, unsanitary, and lacking adequate infrastructure, creating a dangerous and dehumanizing environment that fails to prioritize the well-being and rehabilitation of detained children.\nAdditionally, the control exerted by many gangs in detention centers has created an environment in which violence, intimidation, and exploitation thrive. The pervasive influence of gangs has led to forced recruitment, sexual violence, and the perpetuation of criminal behavior, as children are pressured to join gangs for protection or face severe consequences for resisting.Legal Framework on Juvenile Justice and Children’s Rights\nAs a state party to the Convention on the Rights of the Child (CRC), El Salvador is obligated to protect the rights of children, including by ensuring that actions take their best interests as a primary consideration, they are not arbitrarily deprived of liberty, and are treated in a manner consistent with their age, dignity, and worth in all judicial proceedings.\nUnder international human rights law, children should only be deprived of liberty under exceptional circumstances: when non-custodial measures are inadvisable, after careful review, and considering principles such as legality, last resort, and proportionality. The CRC specifies that a state’s response must be proportional to the gravity of the offense, society’s needs, and the child’s circumstances (the child’s age, lesser culpability, and circumstances and needs, including, when relevant, those related to mental health). When children commit serious crimes, states may consider measures proportional to the offender’s circumstances and the crime’s seriousness, considering public security and punishment. However, the child’s best interests and reintegration into society should always be prioritized.\nThe Constitution of El Salvador establishes the right of every child to live in family and environmental conditions that support their integral development. It requires the state to provide protection and create institutions for the welfare of mothers and children. It also sets forth the obligations to safeguard the “physical, mental, and moral health” of children and guarantee their right to education and assistance. It stipulates that children engaging in “antisocial behavior” (conducta antisocial) constituting a crime or offense shall be subject to a “special legal regime.”\nSalvadoran law also criminalizes, with up to 20 years in prison, the “recruitment, induction, facilitation, use, coercion, promotion or instrumentalization” of children and other vulnerable groups for committing crimes or for participating in criminal groups, terrorist organizations, and organized crime groups. The Law Against Human Trafficking, passed in 2014, defines “human exploitation” to include the use of children in criminal activities and penalizes those who “deliver, capture, transport, transfer, receive persons” for exploitation with 10 to 14 years imprisonment. Salvadoran law also protects children from economic exploitation, specifically mentioning the use, recruitment, or offering of children for illicit activities such as drug production and trafficking as a form of exploitation.\nJuvenile justice in El Salvador is governed by the “Grow Up Together Law for the Comprehensive Protection of Children and Adolescents” (Ley Crecer Juntos para la Protección Integral de la Primera Infancia, Niñez y Adolescencia, or simply Ley Crecer Juntos). The law, which took effect in January 2023, applies to people under 18, replacing the previous Law on the Comprehensive Protection Law for Children and Adolescents (Ley de Protección Integral de la Niñez y Adolescencia, LEPINA).\nThe Grow Up Together Law upholds “comprehensive protection” and the “best interests of the child” as its core guiding principles, to serve as a foundation for interpreting and applying juvenile criminal laws in El Salvador. At the institutional level, the Grow Up Together Law created a new administrative body, the National Council for Early Childhood, Children, and Adolescence (CONAPINA), which oversees the protection of children’s rights. Among others, CONAPINA is responsible for the administration of centers and programs for administrative detention and for the implementation of socio-educational measures for children and adolescents convicted of crimes. CONAPINA is tasked with ensuring humane treatment in detention, including adequate food and clothing, comprehensive health care, and access to education and professional technical training. It is also responsible for ensuring incarcerated children’s eventual re-integration into society.\nThe law provides that children have a right not to be deprived of their liberty in an arbitrary or illegal manner. It guarantees children a fair trial, including the presumption of innocence until proven guilty, and the rights to be informed promptly and directly of the charges against them, to have prompt access to legal and other appropriate assistance, and to have their cases heard without delay.\nUnder the law, deprivation of liberty, confinement, or foster care of children are a last resort. Such measures must be exceptional and temporary, accomplished within established time limits. Confinement or custody of children in police detention centers or adult penitentiaries is prohibited.\nInternational standards call for the placement of children in the least restrictive setting possible, with priority given to “open” facilities. Contact with peers, family members, and the wider community counteracts the detrimental effects of detention on a child’s mental and emotional health and promotes their eventual reintegration into society. Accordingly, international standards call for the placement of children in the least restrictive setting possible, with priority given to “open” facilities. Every facility, whether open or closed, should give due regard to children’s need for “sensory stimuli, opportunities for association with peers and participation in sports, physical exercise and leisure-time activities.” The United Nations Rules for the Protection of Juveniles Deprived of their Liberty, known as the “Havana Rules,” call for detention centers to provide children with “adequate communication with the outside world;” to permit daily exercise, preferably in the open air; and to integrate children’s education, work opportunities, and medical care, as much as possible, into the local community.\nInternational standards forbid closed confinement, placement in a dark cell, “or any other punishment that may compromise” a juvenile’s “physical or mental health.” In addition, states should establish and follow strict norms in imposing disciplinary sanctions. Norms should identify conduct constituting an offense, delineate the type and duration of sanctions, and provide for appeals. Children should have the opportunity to be heard in their own defense before disciplinary sanctions are imposed and on appeal. When these standards are not met, particularly when children are confined in solitary confinement, such confinement may constitute cruel, inhuman, or degrading treatment or punishment, in violation of the Convention on the Rights of the Child, the International Covenant on Civil and Political Rights, and the Convention against Torture.\nThe legal framework for juvenile justice in El Salvador is also governed by two other laws: The Juvenile Criminal Law (Ley Penal Juvenil, LPJ) and the Law on Monitoring and Control of Juvenile Offenders Subject to the Juvenile Criminal Law (Ley de Vigilancia y Control de Ejecución de Medidas al Menor Sometido a la Ley Penal Juvenil). This Juvenile Criminal Law applies to children over 12 and under 18 years of age.\nEl Salvador’s Juvenile Criminal Law establishes three main types of hearings: the initial hearing (audiencia inicial), the preliminary hearing (audiencia preparatoria), and the trial (vista de causa). The initial hearing should be held within 72 hours of the child’s arrest, and the judge determines whether there is sufficient evidence to proceed with the case and decides on precautionary measures. These measures, including pretrial detention, are legally limited to 90 days and judges can extend them for 30 more.\nThe preliminary hearing normally takes place within 90 days of the initial hearing, and the prosecutor presents the charges, the judge determines whether there is enough evidence to go to trial. The trial should be held within 10 days of the preliminary hearing, and the case is presented before a juvenile court judge, who determines the child’s responsibility and the appropriate measures to be applied. According to the law, the entire process, from the initial hearing to the final resolution, should not exceed 120 days.\nThe judge responsible for overseeing the implementation of the measures shall, every six months, conduct an automatic review of the measures imposed on the child. This review aims to ensure that the child is participating in a training and education programs, and that both the measure itself and the conditions under which it is being carried out do not hinder the child’s process of reintegration into society.\nUnder the law, children may be sentenced to any of six types of “socioeducational measures” including orientation and socio-familial support, admonishment, imposition of rules of conduct, community service, probation (libertad asistida), and confinement. The strictest, confinement, is to be imposed only when individually warranted, in “exceptional circumstances,” and for the “shortest possible time.”\nThe Juvenile Criminal Law introduced important due process guarantees and alternatives to traditional criminal prosecution, including conciliation, diversion, and the possibility of waiving criminal action in certain instances. It established a range of sentencing options, prioritizing non-custodial educational and restorative measures, with deprivation of liberty only as a measure of last resort. The provisions relating to detention provided that children might be held in special juvenile detention centers known as “confinement centers” (centros de internamiento), different from those intended for offenders subject to ordinary adult legislation. Such centers had to separate detainees according to age, sex, and whether they were in pretrial detention or had been sentenced. The law also established “intermediate centers” (centros intermedios) for adolescents between 18 and 21 years old, which are administered by the General Directorate of Intermediate Centers (Dirección General de Centros Intermedios).\nThe Law on Monitoring and Control of Juvenile Offenders, also enacted in 1995, regulates the execution and oversight of sentences imposed by juvenile courts. It created the role of Juvenile Sentencing Implementation Judge (Juez de Ejecución de Medidas al Menor), overseeing implementation of sentences and their potential modification, substitution or revocation, to ensure their effectiveness and the reintegration of children.\nBut subsequent reforms have introduced more punitive elements to the largely progressive legal framework. For example, on March 24, 2010, the Legislative Assembly amended the Juvenile Criminal Law, increasing the maximum sentence for children from 7 to 15 years of confinement for certain serious offenses, such as homicide, kidnapping, and rape.\nIn 2010, the Law of Proscription of Gangs and Criminal Groups, Associations, and Organizations (Ley de Proscripción de Maras, Pandillas, Agrupaciones, Asociaciones y Organizaciones de Naturaleza Criminal) established a dual legal framework within the juvenile criminal justice system: one that seeks to adhere to international human rights standards and another, targeting gang membership, with ad hoc procedures and longer prison terms.\nWhen a child is detained by security forces, the Juvenile Criminal Law provides that the Attorney General’s Office must be informed within six hours. The child must initially be placed in “administrative detention” in a “shelter” (Centro de Resguardo), for up to 72 hours. According to CONAPINA, there are four such shelters in the country, in San Salvador, Santa Ana, Sonsonate, and San Miguel. Only the San Salvador shelter was built to accommodate detained children; the other three are repurposed police stations.\nChildren who are ordered to be held in detention (either pretrial or serving prison sentence) by a judge are placed in confinement centers known as “Social Integration Centers” (Centros de Inserción Social, CIS). There are four CIS facilities in El Salvador:“Female” CIS (CIS Femenino) in San Salvador state;El Espino in Ahuachapán state;“Freedom Path” (CIS Sendero de Libertad) in Cabañas state; andTonacatepeque in San Salvador state.\nHuman Rights Watch interviewed two former government officials with extensive knowledge of El Salvador’s juvenile prison system. They told us that although the centers are supposedly designed particularly to house children, these lack any specialized accommodations or resources tailored to children’s unique needs. While current access to these centers is highly restricted, one of the former officials told Human Rights Watch that during his tenure the cells “were no different from a cell in an adult prison.”\nHe said that cells measured six by six meters, with brick floors and iron bunk beds with mattresses. Overcrowding often forced children to sleep on mattresses on the floor, and some slept in hammocks. One toilet accommodated all detainees of the cell, as many as 20 to 30 young people. A bathroom held only a sink for bathing with tap water, he said.\nHe said that children held in confinement centers “mostly governed themselves,” given the limited resources and supervision provided. During his time working in the juvenile prison system, the ratio of guards to detainees was 1 to 10. While there is no universally agreed-upon standard for a well-functioning prison system, some academic literature suggests a ratio between 1:1 and 3:1, that is to say, between one and no more than three detained people per guard on average.President Bukele’s First Term and the State of Emergency\nSince he took office in 2019, President Bukele has severely eroded El Salvador’s democratic institutions. His party, Nuevas Ideas, won a supermajority in the February 2021 legislative elections. Soon after, legislators summarily removed and replaced the Constitutional Chamber judges and the Attorney General and passed laws allowing arbitrary dismissal or transfer of judges and prosecutors.\nIn September 2021, the new Constitutional Chamber allowed President Bukele to run for re-election, contradicting longstanding jurisprudence.\nThe Bukele administration also undermined transparency and accountability, notably by weakening the agency overseeing public information access. The government has fostered a hostile environment for journalists and civil society members, who face digital and physical harassment, surveillance, dubious criminal investigations, and other attacks for their work on corruption and human rights issues. President Bukele and his allies have further eroded public trust in independent media and civil society groups by baselessly labeling them “gang supporters.”\nOn March 27, 2022, the Legislative Assembly passed a law declaring a broad “state of emergency” that suspended, for 30 days, the constitutional rights to freedom of association and assembly; privacy in communication; the rights to be informed of the reason for arrest, to remain silent, and to legal representation; and the requirement to bring anyone detained before a judge within 72 hours.\nPresident Bukele requested the suspension of rights, portraying it as necessary to address a spike in gang violence that month. Ninety-two people were killed, seemingly by gangs, between March 24 and 27 in El Salvador, with March 26 having the highest daily homicide rate in several years, according to official records.\nAccording to the digital outlet El Faro, the wave of violence in March was the result of collapsed secret government negotiations with the MS-13 gang.\nThe state of emergency is based on article 29 of the Salvadoran Constitution, which allows the Legislative Assembly to suspend certain constitutional rights in extreme circumstances, such as a foreign invasion or “serious disturbances of public order.” The 30-day state of emergency, which under the constitution can be extended once for the same time period, has been extended 27 times at time of writing. However, since August 2022, the Assembly has narrowed the state of emergency. While the rights to freedom of association and assembly are no longer suspended, the amended state of emergency still curtails several other constitutional rights, including the right to privacy in communication, the right to be informed of the reason for arrest, the right to remain silent, the right to legal representation, and the requirement to bring detainees before a judge within 72 hours.\nInternational law allows countries to temporarily derogate or suspend some of their human rights obligations only in very limited circumstances. Under article 4 of the International Covenant on Civil and Political Rights, which El Salvador has ratified, governments may derogate from some of their obligations under the covenant “in time of public emergency which threatens the life of the nation.” Derogations should be only those “strictly required by the exigencies of the situation.” The United Nations Human Rights Committee, which is charged with providing authoritative interpretations of the covenant, has made clear that states of emergency may not be used as a justification to violate peremptory norms of international law, for example through arbitrary deprivations of liberty or by deviating from fundamental fair trial principles.\nSimilarly, article 27 of the American Convention on Human Rights allows governments to derogate from some obligations in times of “war, public danger, or other emergency that threatens the independence or security” of the nation, provided that such measures are strictly required by the emergency and consistent with other obligations under international law.\nFollowing the declaration of a state of emergency, the Legislative Assembly passed a set of criminal law reforms that affected rights and significantly expanded mandatory pretrial detention.\nOn March 30, the Assembly reformed the Juvenile Criminal Law, establishing “prison sentences” for children as young as 12. The reform increased the maximum prison sentence to 10 years for children aged 12 to 15 for “gang association” and up to 20 years for those aged 16 to 18.\nThese amendments contradict guidance by the UN Committee on the Rights of the Child, an expert body that provides authoritative interpretations of the treaty, which has recommended that states not reduce the minimum age of criminal responsibility “under any circumstances” and has urged states to increase their minimum age to “at least 14” in light of scientific evidence about human development during adolescence. The long prison sentences set by the Assembly also run counter to the Convention on the Rights of the Child, which establishes that imprisonment of children shall be used only as a measure of last resort and for the shortest appropriate time.\nThe reform does not allow for modification, substitution or judicial revocation of a provisional detention measure, and detention can be extended until sentencing. Such provisions violate international human rights standards on due process and the right to liberty and security of the person, which specifically provide that pretrial detention should be the exception rather than the rule, and should be avoided in the cases of children, and run counter to El Salvador’s own Juvenile Criminal Law.\nOn March 30, 2022, the legislature also modified El Salvador’s Code of Criminal Procedure to allow for indefinite pretrial detention. Previously, the law said that pretrial detention should never exceed 12 months for “less serious crimes” or 24 months for “serious crimes.” For defendants accused of being part of “terrorist or unlawful association,” the new Code of Criminal Procedure eliminates any time limits, violating the right to trial within a reasonable time under the International Covenant on Civil and Political Rights. As the UN Human Rights Committee has noted, “xtremely prolonged pretrial detention may also jeopardize the presumption of innocence.”\nThe Legislative Assembly also expanded mandatory pretrial detention to apply to all crimes committed by members of gangs. This provision is inconsistent with international human rights standards requiring an individualized determination that pretrial detention is reasonable and necessary for purposes such as preventing flight, interference with evidence, or the recurrence of crime.\nA law passed on April 5, 2022, allows criminal charges against anyone who “participates in the creation, assists or creates” any type of publication, image, graffiti or other form of visual expression that “explicitly or implicitly” transmits “messages” about or that “allude to” the various types of gangs. The penalty is up to 15 years in prison. The law similarly allows criminal charges against people who use media outlets to “reproduce or transmit messages or statements created or allegedly created” by gangs that “could generate a state of anxiety and panic in the population in general.”\nThese vague and overbroad provisions are inconsistent with international human rights protections for freedom of expression, which may only be restricted when necessary and proportionate to achieve a legitimate goal, such as to protect national security or the rights of others. In November 2023, the Assembly amended the Criminal Code. The revised version maintains the prohibition on visual expressions related to gangs but removes the specific restrictions on media outlets.\nOn October 26, 2022, lawmakers amended the “Law Against Organized Crime” (Ley Contra el Crimen Organizado), creating “Courts against Organized Crime” (Tribunales Contra el Crimen Organizado) in charge of cases against criminal organizations and their members. The amendment allows authorities to try children jointly with adults under a single legal process that, in the case of children, is overseen by two judges—an organized crime judge and a child justice judge. The Courts against Organized Crime began operating in June 2023.\nSince March 2022, police officers and soldiers have conducted hundreds of indiscriminate raids, particularly in low-income neighborhoods, arresting over 80,000 people, including some 3,000 children. The arrests have often targeted communities where people have, for years, suffered insecurity and lack of economic and educational opportunities. The government has not published updated figures on how many of those arrested have been released; in August 2023, they reported 7,000 released, without specifying how many children.\nHuman rights groups, including Human Rights Watch and Cristosal, have documented widespread human rights violations committed during the state of emergency, including arbitrary arrests, enforced disappearances, torture and other ill-treatment of detainees, and due process violations. Salvadoran human rights groups report that as of April 2024, at least 244 people have died in prison. The circumstances of many deaths in custody during the state of emergency suggest state responsibility for those deaths. The authorities reported in April 2024 that no children had died in detention during the state of emergency.\nDuring the state of emergency the country has experienced a significant reduction in homicides, with the government reporting a 2023 homicide rate of 2.4 homicides per 100,000 people. There has also been a significant decrease in other violent crimes, such as extortion and kidnappings. However, government restrictions on accessing homicide and other data and changes in the ways killings are counted make it hard to estimate the extent of the reduction and the prevalence of other crimes.\nIn May 2024, the media reported that CONAPINA had shut down a website providing statistics on crimes against children and adolescents, such as sexual abuse, trafficking, and mistreatment.\nThe improvements in public safety have been welcomed by many Salvadorans who have long suffered pervasive gang violence in their communities. Many children in formerly gang-controlled areas now feel safer going to school and playing outside. The reduction in violence and extortion has also allowed some families to allocate more resources toward their children’s education and well-being, as they no longer have to pay “renta” (extortion fees) to gangs. The relative of a detained child told Human Rights Watch:\nI live in a village where we were besieged by gangs. They existed in the area, and we used to live in terror or face extortion here like in other places. People feared them. You couldn’t even look at them. The situation has improved for moving around; they used to ask for your ID. In that sense, it has gotten better. You can walk freely now.\nWhile acknowledging security improvements, many people interviewed by Human Rights Watch expressed concern that such improvements have come at the expense of innocent people who have been arrested and offered virtually no possibility to legally dispute the charges against them. One mother, whose son was detained during the state of emergency, said:\nI laugh when I hear people mentioning the improvements in public safety. It’s true, it has improved. But what’s security when you cannot hold your child, when you don’t know if he is dead or alive.\nImpact of the State of Emergency on Children\nIncreased Detention of Children\nEl Salvador’s repressive security policies, past and current, have resulted in the mass detention of children. Between 2018 and 2021, the four juvenile detention centers in the country held, in total, an average of 805 children per year.\nThe state of emergency, announced in March 2022, led to an unprecedented surge in the detention and conviction of children. While government figures are inconsistent, CONAPINA told US authorities that 3,319 children were detained between March 2022 and December 2023. Of these, 841 were reported to remain in prison as of January 2024—262 in pretrial detention and 579 serving sentences. The Public Defender’s Office told Human Rights Watch that it had provided legal representation to 2,928 children detained between March 2022 and April 2024. On February 22, 2024, Justice and Security Minister Gustavo Villatoro said in a press conference that 1,065 children had been convicted during the state of emergency, without providing a specific timeframe for when these detentions occurred. Click to expand Image\nLegislative amendments that increased sentences for children associated with gangs and multiple official figures obtained by Human Rights Watch reveal a shift in the Salvadoran juvenile justice system toward a more punitive approach during the state of emergency.\nFrom 2018 to 2022, Salvadoran courts sentenced a total of 1,108 “children and adolescents,” meaning those between the ages of 12 and 18, to confinement in detention facilities, according to the Supreme Court. The percentage of alleged juvenile offenders sentenced to “confinement,” in comparison to other types of sentences, rose from 26 percent in 2018 to 53 percent in 2022, suggesting an increasing tendency to imprison young offenders. Meanwhile, the number of young offenders sentenced to the imposition of rules of conduct, which involves measures such as mandatory attendance at school or work centers, dropped from 28 percent in 2018 to 20 percent in 2022. Likewise, the use of “family orientation and support,” a type of sentence that provides assistance and direction for young offenders within their home, dropped from 10 percent in 2018 to 7 percent in 2022. Click to expand Image\nAt the same time, the number of children charged with “unlawful association” and “terrorist organization,” two broadly defined offenses involving association with gangs, skyrocketed, with unlawful association charges increasing 34-fold from 100 in 2021 to 3,452 in 2022 and terrorist organization charges increasing from 55 to 181. Click to expand Image\nHuman Rights Violations\nSome 3,000 children have been swept up in mass detentions between March 2022 and April 2024. Many have no ties to gang activity or connection to criminal organizations.\nHuman Rights Watch documented the cases of 66 children who have been subjected to abuses including arbitrary detention, torture, other forms of ill-treatment, and police harassment. Of those, 25 had been released from police stations and detention facilities. They reported poor conditions in custody, including at times extreme overcrowding, unhygienic facilities, and lack of adequate food and health care. Some children have been detained at police stations, sometimes alongside adults, contravening both Salvadoran and international standards that mandate the separation of children from adult detainees. Prosecutors and judges have exacerbated these abuses through due process violations and unfair trials.Arbitrary Detention\nClick to expand Image\nA mother shows a Human Rights Watch researcher a video of the police detaining her son during the state of emergency, on December 18, 2023, in San Salvador, El Salvador. © 2023 Human Rights Watch\nBoth police and soldiers have participated in the arrests of children during the state of emergency, especially in low-income neighborhoods and rural areas. Although police conducted the majority of detentions documented by Human Rights Watch, soldiers were involved in 16, either alongside police or independently.\nPolice and soldiers rarely, if ever, showed a search or arrest warrant, and rarely informed children or their families of the reasons for the arrest. In five cases, children were told they were being taken for informal questioning at a police station, and were detained there. Police thus avoided the requirement for an arrest warrant, while temporarily calming the concerns of relatives and delaying families’ efforts to seek information about a child’s legal status, location, and well-being. In some instances, security forces threatened family members with detention if they asked questions.Lucas Pérez\nOn May 31, 2022, police detained Lucas (pseudonym), a 15-year-old student, at his home in Sonsonate state. A relative interviewed by Human Rights Watch said Lucas was having breakfast with family members when police arrived. They searched his phone and told him he was being arrested. Lucas’s sister, then 18, who took care of her younger siblings, asked the officers to show an arrest warrant, and they refused. She asked them the reason for the arrest and told them Lucas was a student. They demanded her phone and detained her as well. Both Lucas and his sister were held at a police station in Sonsonate for nine days. When a relative inquired about the reasons for the arrests, a police officer cited a “phone call” and said she could “thank the neighbors.”\n“We used to fear gang members,” another relative said, “but now we are also afraid of the police. Nobody knows why they detain you. Just because a neighbor does not like you, you can be arrested.”\nAt Lucas’s first hearing, on June 9, a judge revealed charges of unlawful association and sent him to pretrial detention for 60 days. Several weeks after a second hearing, in September, a judge sentenced him to two years in prison. A relative was allowed to see him during the hearings but could not talk to him. As of April 2024, he was at the Freedom Path confinement center, in the city of Ilobasco, in Cabañas state. Lucas’s sister was also still being held at the Apanteos prison facility in the state of Santa Ana, around 60 kilometers northwest of San Salvador.\nClick to expand Image\nA man leaves packages for his loved ones at a shelter and a juvenile prison on September 21, 2023, in Ilopango, San Salvador, El Salvador, amid the country's ongoing crackdown on gang violence. © 2023 Human Rights Watch\nAs described above, under Salvadoran law, children who are arrested should be held in administrative detention, at shelters, for up to 72 hours before appearing before a judge. Under the state of emergency this limit was extended to 15 days. Human Rights Watch identified many cases in which the duration of detention in shelters or police stations exceeded the standard 72-hour limit, with some detentions lasting up to the new maximum of 15 days.\nIn 12 cases documented by Human Rights Watch, children were held at police stations alongside unrelated adults, for periods ranging from 1 to 11 days. Detaining children with unrelated adults places them at risk of abuse and is prohibited under Salvadoran law and international standards set forth in the Convention on the Rights of the Child and the International Covenant on Civil and Political Rights.Yaneth Aguilar\nOn July 1, 2022, soldiers detained 16-year-old Yaneth Aguilar (pseudonym), in the middle of the night at her home in a rural town in Sonsonate state. Yaneth was in her second year of high school. The soldiers arrested her, saying they had “received a phone call” accusing her of collaborating with gangs. One soldier told a relative of Yaneth that she would be detained for 72 hours. “If you present the documentation of her school attendance,” he said, “she will be released.”\nYaneth was held at a police station in Sonsonate for eight days. Relatives who took food to her said they found her scared and crying, sharing a cell with adults as well as children.\nYaneth was then held, for seven days, at the Metropolitan shelter in Ilopango, just outside San Salvador.\nFifteen days after her arrest, Yaneth appeared before a juvenile judge for the first time and learned she was being charged with unlawful association. She said she was not able to talk to her lawyer before the hearing. She was sent to pretrial detention, along with seven other children.\nYaneth was kept in pretrial detention, at the Female confinement center, in Ilopango, for a year.\nOn July 1, 2023, a juvenile judge granted her conditional release, requiring her to participate in educational programs and receive guidance and supervision from the court for six months. On December 22, a court ruled that she had completed her sentence.\nTorture and Other Forms of Ill-Treatment\nHuman Rights Watch documented 22 cases of children who were beaten and physically ill-treated by security forces during and after arrest, at police stations, shelters, and confinement centers in El Espino, Freedom Path, Tonacatepeque, and Female. Police or soldiers repeatedly kicked and beat them with batons and belts.\nIn particularly serious incidents, eight children interviewed by Human Rights Watch described burnings, suffocation, and mock executions. These and other abuses likely amount to torture or other cruel, inhuman or degrading treatment or punishment. Authorities interrogated the children about gang affiliation, ordering them to reveal the names of gang members or to confess to being part of a gang. One such victim turned 18 the day after his arrest.\nAuthorities often used abusive language—and sometimes death threats—during the physical abuse. One child told Human Rights Watch that during his arrest, soldiers said, “You are lucky we found you at your home. If you had been on the streets, we would have killed you.”\nThirteen children said security officers denied them blankets or mattresses, and they had to sleep on the floor for several days or weeks. In two cases, children were subjected to sleep deprivation. In almost all of the cases documented by Human Rights Watch, detained children were denied family visits during weeks or months in detention.\nSix children who were detained told Human Rights Watch that sometimes guards would beat them or abuse them and other children all at the same time, saying they did so as punishment for somebody else’s misbehavior. Punishments also included taking away their mattresses and clothes, reducing the number of meals they received, spraying pepper spray into their cells, and making them wear the same clothes for days before they were laundered.\nFour girls reported seeing, several times, guards handcuffing certain girls and manacling their wrists to the wall above their heads and leaving them for the entire night because they or others had “behaved badly.” Another child said he witnessed guards “throwing tear gas in children’s faces” several times and beating them for misbehaving.\nSuch treatment amounts to collective punishment, a violation of international human rights standards for the treatment of detainees. For example, the United Nations Standard Minimum Rules for the Treatment of Prisoners provide that “collective punishment and all cruel, inhuman or degrading punishments shall be completely prohibited as punishments for disciplinary offences”; the UN Rules for the Protection of Juveniles Deprived of Their Liberty include similar standards. The Mandela Rules also emphasize that “disciplinary sanctions or restrictive measures shall not include the prohibition of family contact” (Rule 43.3) and that “instruments of restraint shall never be applied as a sanction for disciplinary offences.” (Rule 43.2) Further, under the UN Rules for the Protection of Juveniles Deprived of Their Liberty, the use of restraints and force “should not cause humiliation or degradation, and should be used restrictively and only for the shortest possible period of time,” only after “all other control methods have been exhausted and failed,” and then “only as explicitly authorized and specified by law and regulation.”\nAlthough the Juvenile Criminal Law prohibits the National Civil Police from keeping records on crimes attributed to children—except in those cases determined by the Attorney General’s Office or a judge—four people with knowledge about police procedures, including police officers, told Human Rights Watch that the police in reality keep records of detention of children, in violation of domestic and international human rights standards protecting children’s privacy and due process rights.Selected Cases\nAntonio Juárez\nPolice detained Antonio Juárez (pseudonym), a-17-year-old construction worker, at his home, at around 9 p.m., on May 24, 2022, in the town of Los Planes de Renderos, in San Salvador state.\nThey ordered him to remove his shirt, apparently searching for tattoos, which he did not have. “Someone” had filed an “anonymous complaint” against him, an officer said.\nThey detained him, without showing an arrest warrant, and took him to a police station a few kilometers away, in the town of Panchimalco. An officer told a relative who visited Antonio that he would be released “after three months in jail, if he has not committed any crime.” He was being held with two others, the relative said, one of whom appeared to be an adult. That was the last time she, or any other relative, saw or talked to Antonio, for more than a year.\nThe next day, on his 18th birthday, Antonio was taken to a police station in San Marcos, a city some 15 kilometers to the north. The following night, he was delivered to Izalco, a maximum-security prison for adults in the state of Sonsonate, where he would be held for four months.\nPrison guards ordered all newly arrived detainees to strip to their underwear, Antonio said, and some 50 officers from the Police Order Maintenance Unit (UMO), a unit in charge of public order, including in the penitentiary system, beat them with batons for an hour.\nOne guard asked Antonio about his gang affiliation. He said he had been “detained arbitrarily” and was “not a gang member.” The guard beat him with a baton. “In here no one is a civilian,” Antonio recalled him saying. “You have to be something.”\nAntonio said he heard the guard tell a colleague, “We will hold this one in the where are raping . They have already raped four.”\nAntonio was taken to a “completely dark” basement cell that held some 320 detainees and so crowded that they had to sleep on the floor or standing, he said. Guards took detainees out only every three or four days to a toilet. Some “defecated in their boxers,” Antonio said.\nOne of Antonio’s cellmates asked him to which gang he belonged, and when he denied any gang membership, another cellmate threatened, “If you are not a gang member we will tear you apart, because you do not exist.”\nPrison guards and detainees beat him, separately, every day. When guards searched the cell, they ordered detainees to line up outside. They often hit Antonio and his cellmates with batons or kicked them in the back or torso. A UMO officer beat Antonio so severely once, he said, that he broke a rib. He said he did not receive medical care.\nWhen food was provided, it was once a day, to eat with their hands. Water was scarce, and tasted “dirty,” Antonio said. Some days, up to three in a row, the guards would withhold food, he said.\nFungus bloomed on Antonio’s skin, he said, and he could not walk. He asked to see a doctor, to no avail.\nAfter a month and a half, he was transferred to a different cell, at ground level. Seeing the sun, after so many days in the dark, made him dizzy, he said, and he passed out.\nAfter four months in Izalco, Antonio was taken to La Esperanza, also known as Mariona adult prison, in the state of San Salvador, where conditions were relatively better, he said, and “the beatings diminished.” He sometimes attended meetings organized by detainees to read the Bible.\nOn December 12, 2022, a judge ordered Antonio released on the condition that he check in regularly at a police station and stay in the country, according to a court document that Human Rights Watch reviewed. He was able to leave the prison two days later.\nA juvenile judge “provisionally acquitted” Antonio on February 21, 2023, citing “lack of merit to promote criminal action.”\nAntonio said he had personal knowledge of 11 detainees who died during his time in Izalco and Mariona, including some who were seemingly killed during beatings by UMO officers.Roberto Linares\nRoberto Linares (pseudonym), a 13-year-old student, was having lunch at home, in the city of Apopa, some 20 kilometers northeast of San Salvador, on November 11, 2023. Three soldiers entered his house and, without showing a warrant, arrested him. They said “someone” had “reported him to the authorities.” One soldier slapped him in the head and called him a “faggot.”\nThe soldiers forced Roberto to walk six blocks, handcuffed, to a military station, where they asked him repeatedly to “provide names of gang members,” he told Human Rights Watch, and “deliver the weapons and drugs.” He denied any association with gangs.\nIn an entrance hall, they forced him to kneel, facing a wall, for about two hours. At one point, a soldier placed a hood over Roberto’s head and choked him for several seconds, saying he was going to kill him.\nLater that day, a policeman took him to a police station in Apopa, telling him the arrest was for unlawful association. Police transferred him, the next day, to the Metropolitan shelter in Ilopango.\nAt a hearing on November 29, a judge granted alternative measures to detention, requiring Roberto to check in every 15 days, for two months, at a police station. Roberto told Human Rights Watch he is “scared he’ll be detained again.”Luis Mejia\nLuis Mejia (pseudonym), a 16-year-old construction worker and student, was playing with another teenager in a park near his home in Apopa, on December 7, 2022, when six police officers approached. Without showing a warrant or providing any reason, they detained him, taking him away in a police car.\nThey drove for 15 minutes, to what Luis told Human Rights Watch was the home of a policeman, a “family house,” with two floors. An officer wearing boots forced Luis to place his hands on a table and stepped on them, he said, calling him a “rat” and kicking him once in the ribs. Luis believes the police officer disliked him because he had “spoken to his niece.”\nAbout half an hour later, officers took Luis to a police station, where he was held, with other children, in a cell, where he had to sleep on the floor.\nThe next day, they transferred him to the Metropolitan shelter in Ilopango, where he was held in a cell with 15 other children roughly his age, none of whom were allowed to go outdoors. Some nights, a prison guard would wake them by “passing a baton through the bars,” he said, and once, the same guard handcuffed Luis and two others who were laughing to the cell bars for three hours.\nOn his third day at the Metropolitan shelter, Luis began vomiting bloody phlegm. He was taken to a prison clinic in the detention center and given medication. The doctor diagnosed probable “food poisoning.” Luis told Human Rights Watch that the food always contained a “white powder.” His testimony is consistent with the accounts of other children who told us of food smell and tasted badly because of “powder.”\nOn December 22, Luis appeared before a juvenile judge—the first time, since the arrest, that his mother was able to see him and talk to him. He and five other children at the hearing, whom he did not know, were charged with unlawful association.\nThe judge ordered Luis released, on the condition that he checked in at a juvenile court every month for three months.\nIn late February 2023, several soldiers and a police officer showed up at Luis’s home again, asking him to “hand over” a certain person. When he said he did not know the person, they struck his head against a post. “We do not want to see you in this place again,” one of them said. “If we do, we will kill you.”\nThat same day, Luis left Apopa, moving to Santa Ana, 50 kilometers north. Soon after, soldiers and police again arrived at his home in Apopa, a relative said, and they came four times that week, asking for him each time. “If I see him again,” the relative recalled them saying, “I will kill him in jail.”\nLuis returned home six months later, in August. On October 11, police showed up and arrested him. They had received “a phone call,” they said, reporting him as a gang member. They took him to the Metropolitan shelter again, where he said the food had improved but detainees were not allowed to leave their cells. He shared a cell with seven other children.\nAfter 14 days there, guards took Luis to a courthouse, where he was charged with unlawful association. Police testified that a woman in Apopa had reported Luis for gang affiliation, but the judge ordered his release.\nLuis has faced challenges in finding a job because of his criminal record, and harassment has continued. One officer approached him in a park in Apopa in January 2024, telling him, “You have six months. Once you turn 18, we will take you again.”José Gutiérrez\nSoldiers stopped 16-year-old José Gutiérrez (pseudonym) when he was returning home from a football match on May 11, 2022, in the rural town of Sensuntepeque, Cabañas state. José was in his first year of high school, a student identification that Human Rights Watch reviewed shows.\nOn an empty lot near the street leading to the courthouse, the soldiers forced him to strip to his underwear. They burned his torso with a cigarette lighter and ordered him to confess his gang affiliations. They took photos of him in his underwear, the relative said, and released him.\nThree days later, as he was heading to a football game with friends, a police patrol stopped him again. They took him to a police station. When a neighbor informed family members about the arrest, they went to the police station and were told that José “was being investigated, because someone had reported him.”\nHe was held at the station for 11 days. A lawyer who visited José there told relatives that he was sharing a cell with adults.\nA few days after José was detained, a relative filed a complaint at the Human Rights Ombudsperson’s Office (Procuraduría para la Defensa de los Derechos Humanos, PDDH). She said the PDDH official with whom she filed the complaint sent her WhatsApp messages saying she “was pretty” and that “he could help” her “speed the proceedings,” but it was “up to” her. Human Rights Watch saw the messages but was unable to confirm that the number belonged to a PDDH official. The relative said that when she stopped replying, the official stopped returning her calls.\nOn May 25, 2022, José appeared before a judge, along with six other children, for the first time. He was charged with unlawful association and sent to pretrial detention. Police transferred him to the Freedom Path confinement center in Ilobasco.\nAt a second hearing, an “informant” testified against José, calling him a “lookout” for the gangs, a relative who attended said. But the informant seemed to contradict himself, saying later that he “did not recognize” José, the relative said.\nJosé’s lawyer, from the Public Defender’s Office, asked the court to authorize a bodily inspection of his client, to show that he did not have gang-related tattoos. In November, a prosecutor, the defense lawyer, and a relative were granted access to the detention center for the bodily inspection. José had no gang tattoos, but the relative said that his body was covered with fungus and scabies. She blamed prison conditions.\nOn September 4, 2023, a judge sentenced José to six years in prison, followed by six years of “conditional release,” consisting of educational programs and court guidance and supervision. A relative who attended the hearing said the prosecution presented testimony from a police officer, and spoke of a photo and audio found in José’s phone, which supposedly linked him to gangs. But the purported phone evidence was not introduced at trial.\nJosé’s lawyer appealed the sentence, but it was upheld. José remains incarcerated, as of April 2024, at the juvenile detention center Freedom Path.Alba Escobar\nFifteen-year-old Alba Escobar (pseudonym), a high-school student, was waiting to board a bus on February 15, 2022, in a rural town in Ahuachapán state, when police detained her. Searching her purse, they found a bag of marijuana.\nPolice officers told a relative who went to a police station looking for her the same time every day, for 10 days, that they did not know where she was. On the 11th day, an officer said Alba was at the police station in the nearby town of Santa Ana.\nAfter 15 days in custody, Alba appeared before a judge for the first time and was charged with “possession and trafficking of drugs.” The judge ordered her release, pending trial, on the condition that she check in once every two weeks, for a month, at a police station.\nAlba told a relative that, while she was in custody, a police officer had struck her on the back with a wet leather belt and threatened to “drown her in a pail of water,” if she did not disclose names of gang members. She returned home “traumatized and wounded,” a relative said.\nAt a trial on May 19, a judge sentenced her to two years in detention.\nMore than a year later, in June 2023, Alba had a virtual hearing, in which authorities reported on her activities in detention. A relative who was able to talk to Alba briefly, by video, said that she reported prison guards hitting her and that she believed she was being punished because “five girls tried to escape from prison.”Daniel Villalobos\nPolice detained 17-year-old construction worker Daniel Villalobos (pseudonym), on April 26, 2022, in the town of Suchitoto, Cuscatlán state. Daniel had dropped out of school in sixth grade to provide for his family.\nPolice appeared at his workplace, arrested him and a colleague, without warrants. One booted officer kicked Daniel repeatedly, saying, “I am going to beat you up until you give me names.” He protested that he didn’t know any, and that he was “just working.”\nAt a police station where officers held Daniel for a few hours, the same policeman hit him, until another officer said to “leave him alone.” The kicking left bruises on Daniel’s ankles.\nAnother officer told Daniel, “You will be detained for 40 years, for the crimes of unlawful association, selling drugs, and homicide.” That afternoon, police transferred him to the Metropolitan shelter in Ilopango.\nGuards took Daniel to an office inside the detention center, where he said a guard asked him about his gang affiliation. “If you say the wrong thing,” the guard warned, “you will end up at a prison where will beat you.” He told the guard he did not belong to any gang. The guard searched his body for tattoos associated with gangs, and when none were found, sent him to the “cell for civilians,” Daniel said.\nHe shared the cell with some 100 other children, although the numbers changed over time. He was not allowed to leave the cell and had to share a mattress.\nGuards sprayed for mosquitos twice, he said, without letting detainees leave. “I felt poisoned,” he said.\nOn May 10, he appeared before a judge, and was charged with extortion, homicide and unlawful association. Daniel said he asked the prosecutor for the evidence against him and was shown a picture that authorities had found on his phone, of him smoking marijuana. A judge ordered him released on condition that he check in at court in the city of San Vicente every six months, according to Daniel.\n“I came out angry,” Daniel said. “Now I have to check in at a courthouse for 10 years. My life has been ruined. I am afraid they will arrest me again. I do not want to lose my youth in there.”\nHe said he is considering leaving El Salvador.Lucrecia Pérez\nLucrecia Pérez (pseudonym), a 16-year-old student, was awakened, on the night of July 1, 2022, by officers knocking on her door in a small town in the state of Sonsonate.\nThey told her to get dressed, she told Human Rights Watch, and said she was being arrested. When she asked why, they said they could not tell her. Officers took a photo of her and loaded her into a police car with other detainees.\nSeveral police and a soldier took her to a police station in Sonsonate, where she was held for a few hours. “Provide a name or you will pay instead,” one police officer said, pressing her to incriminate other people as gang members. Click to expand Image\nThe bedroom of Lucrecia Pérez (pseudonym), then-17, at her aunt's house on December 16, 2023, in a rural town in Sonsonate, El Salvador. Lucrecia was detained for a year and charged with collaborating with a gang. © 2023 Human Rights Watch\nOfficers took her to another police station in Sonsonate, where Lucrecia said she shared a cell with some 25 others, including adult women, and slept on the floor.\nRoughly a week later, police took Lucrecia, along with three girls from her community, to the Metropolitan shelter in Ilopango. “The first few days I was sad, desperate,” she said. “I felt that the days did not pass by.”\nShe shared a cell with 40 other girls, she said, and they had to share mattresses. Normally, guards gave them three meals per day, but sometimes just one. Lucrecia fell ill with chicken pox and was treated at the detention center clinic. Despite exhibiting symptoms of this infectious disease, she said she was not isolated from the rest of the detained population. Lucrecia’s account suggests the shelter failed to implement appropriate quarantine protocols and preventative measures to contain the outbreak.\nThe guards warned that when one detainee was misbehaving “the others would pay,” she said, and indeed, they punished all, when some “behaved badly” or “fought among themselves.” Guards sometimes threw tear gas into the cell as punishment. Several times, they handcuffed certain girls to the cell bars and suspended them from their arms for the night. “They started yelling for the guards to take them down, when they could not stand it anymore,” Lucrecia said. But the guards did not relent.\nOn July 14, authorities took Lucrecia before a juvenile judge for the first time. She was not able to talk to her lawyer before the hearing, and only learned in the courtroom that she was being charged with unlawful association. The judge sent her to pretrial detention, along with seven other children.\nOn January 9, 2023, Lucrecia appeared again before a judge, along with seven other children. A relative who attended the hearing said a police officer testified that, rather than being arrested at home, Lucrecia had been detained, along with other people, on the streets.\nThe judge said that if she and the seven others all pleaded guilty to collaborating with the MS-13 gang, their prison sentences would be reduced. She and the other children agreed to plead guilty. Lucrecia told Human Rights Watch that she was innocent, and only pleaded guilty to avoid a longer sentence. All received one year in prison, including the time they had already served.\nA judge ordered “conditional release” for Lucrecia on July 1, 2023, and ordered that a “multidisciplinary team,” consisting of a psychologist and a social worker, visit at her home every three months, to complete a psychosocial analysis. Lucrecia’s mother had been detained on January 11, 2023, so her aunt took her in when she was released. She said that “Lucrecia did not want to go outside at first.” She had to change schools because she was “afraid of what other people would say.”\nOn December 22, a court ruled that Lucrecia had served her sentence.Harassment and Stigmatization\nPolice and soldiers regularly harass children on the streets of low-income communities. Children and their family members told Human Rights Watch that security forces routinely stop children, as well as adults. They often beat them and threaten them with detention, falsely accusing them of being gang members.\nHuman Rights Watch documented seven cases of security forces threatening children who had been released from the juvenile justice system with re-arrest once they turn 18. Repeated harassment has led several children interviewed to leave their communities, often disrupting their education and separating them from their families. Some children and their relatives said they were considering leaving El Salvador for fear of being arbitrarily detained.\nIn April 2024, the news outlet El Diario de Hoy reported that the Education Ministry was asking teachers to report students with “antisocial behavior,” using a specific form. Human Rights Watch interviewed two teachers who confirmed this. The practice raises serious concerns about the rights and privacy of students, especially considering that most of them are children. Forcing educators to inform on children’s suspected links to gangs undermines trust between teachers and students, turning schools into an environment of surveillance and suspicion instead of a safe space for learning and development. Moreover, labelling students based on the subjective criterion of “antisocial behavior” can lead to stigmatization, discrimination, and possible abuse by authorities.\nHuman Rights Watch documented the cases of three children who were arrested in Usulután state on April 11, 2024, following reports from their own schoolteachers. According to family members interviewed, police accused the children, ages 15 and 16, of creating a graffiti associated with gangs. They denied creating the graffiti. A prosecutor charged them with unlawful association. As of mid-June, the children remained in pre-trial detention at the Freedom Path juvenile detention center in Ilobasco.\nOn May 2, 2024, the Civil National Police posted on X that police had detained a 17-year-old student from Soyapango for “being a member of the MS-13 gang.” The police suggested the arrest was based on drawings found in his notebook, which school authorities had reported to the police.\nIn several instances, Justice and Security Minister Gustavo Villatoro posted images on social media showing the faces of children who had been detained during the country's state of emergency, undermining the children’s right to privacy. Additionally, he used highly dehumanizing and stigmatizing language, including by describing children as “rotten generations” (“generaciones podridas”) and “cancer.” Such practices risk further marginalizing at-risk youth.Selected Cases\nRicardo Durán\nOn June 7, 2023, six police officers arrived at the home of 15-year-old Ricardo Durán (pseudonym) in the rural community of Apopa, San Salvador state. Ricardo had left school that year to work in construction, and he showed the officers a work certificate indicating that he did not have a criminal record, he said. But police officers ripped up the papers, he said, and without showing a warrant, arrested him.\nOfficers took him to a police station called “El Penalito,” in San Salvador. He was held in a cell with 35 other people, including some adults. They transferred him, on June 8, to the Metropolitan shelter in Ilopango. At the shelter, he said he shared a cell—and only five mattresses—with 40 other children, who slept crowded together. Ricardo sometimes slept on the floor. The food was inadequate—sometimes only two meals a day. “I lost a lot of weight,” he said. Click to expand Image\nRicardo Durán (pseudonym), 16, holds his mother at a commercial center on September 23, 2023, in Apopa, San Salvador, El Salvador. Ricardo was detained soon after this photo was taken. © 2023 Human Rights Watch\nOn June 16, guards took him to a courthouse where a prosecutor charged him and six others with unlawful association. In September, a judge ordered his release on the condition that he check in once a week, for three months, at a police station.\nAt home in Apopa, three police officers harassed Ricardo and his family repeatedly, he said. They would appear at the house about once a week, sometimes saying that neighbors had accused him of collaborating with gangs. “Wherever saw him,” whether at a park or at his home, “they beat him,” a relative said. At least three times, twice with his brother, they took him to a police station and held him for hours. Each time, officers beat him, a relative said.\nEach time Ricardo was detained, the family showed the police a document ordering his release, a relative recounted. Once, the officers said it was “worth nothing.” Another time, they said they would arrest his lawyer and the judge who had released him “for taking part in the release of gang members.” When Ricardo told the police that his mother would report them to authorities, an officer replied, “That can no longer affect us.”\nOn September 22, four police officers approached Ricardo when he was carrying a motorbike across a local park. One booted officer said, “We told you not to come to the park,” and kicked him in the calves for several minutes, Ricardo said. A Human Rights Watch researcher interviewed him the next day and saw the bruises on his legs. He did not defend himself or run, he said, because he “feared would kick him harder or take him back to the police station.”\nOn November 4, an officer detained Ricardo and took him to the police station. Authorities transferred him, the next day, to the Metropolitan shelter, and held him for nine days.\nAt a mid-November hearing, a prosecutor charged him with unlawful association, extorsion and threats and sent him to pretrial detention for four months at El Espino confinement center in the state of Ahuachapán, roughly 100 kilometers northwest of San Salvador. As of April 2024, he remained imprisoned there. His family has not been able to speak with him since the arrest.Abel Rodríguez\nOn June 1, 2022, the police detained Abel Rodriguez (pseudonym), a 14-year-old student.\nAbel was leaving a store in Acajutla, Sonsonate state, where he had delivered bread for his mother’s home baking business when he witnessed a police shootout. Abel ran. As he passed one of the police officers apparently involved, the officer struck him on the head with a gun. A relative who was nearby saw Abel handcuffed on the ground, an officer kicking him in the face and chest. When she asked the officer to stop, he said, “Mind your own business.”\nAbel was held for nine days at a police station in the city of Sonsonate before appearing before a judge for the first time on June 10, along with five other children. The prosecutor charged him with unlawful association, and the judge sent him to pretrial detention for 90 days in the confinement center in Tonacatepeque, San Salvador state.\nAfter several hearings were suspended, on October 16, guards finally took Abel to a courthouse where he was allowed to speak briefly with a relative. Abel said that a prison doctor had told him he was malnourished. The prosecution alleged only that Abel “had run” when he saw the police. A judge sentenced Abel, on October 24, to two years in prison.\nHis family has seen him only twice since then, during court hearings in May and November 2023. A relative said that a psychologist and social worker told her that Abel was taking classes and exhibiting “excellent behaviour,” but that the judge could not free him because “nobody the state of emergency will be released until they complete their sentence.”\nThe relative who witnessed Abel’s beating and arrest, meanwhile, was being harassed. Soldiers arrived at her house one night in June 2023, when she and her 7-year-old son were sleeping, and said they had “received information about her.” They forced her to strip to her undergarments so that they could search for tattoos associated with gangs. They took a photo of her and left. A few days later, the relative fled her home.Violence and Mistreatment by Other Detainees\nSeveral children reported experiencing abuse while being held at shelters and confinement centers. One recounted authorities questioning him about potential gang affiliations, before placing him in a cell. “They asked me if I was part of MS-13, Barrio 18, or a civilian,” he told Human Rights Watch. Although he said he had no gang ties, authorities placed him in a cell with children who were apparently gang members and routinely abused him.\nSeveral children told Human Rights Watch that they or others had suffered violence by other detainees, including beatings and in two cases sexual violence, and that guards did little or nothing to protect them.\nSome said that cells were in practice controlled by gang members who called themselves “cell leaders.” They oversaw tasks including cleaning and food distribution, often using violence to enforce their rules. In some cases, they subjected detainees to interrogations about their gang affiliation.Selected Cases\nAgustín Díaz\nFor years, the family of Agustín Díaz (pseudonym) had suffered due to gang control of their neighborhood in Cuscatancingo, San Salvador state. The gangs tried to recruit Agustín when he was 12 years old. Gang members beat his stepfather and threatened his mother, a community leader, in June 2021, after she helped police distribute food during the Covid-19 pandemic lockdowns. The family was forced to flee to Mejicanos, a city near San Salvador. But the family now lived in an area under the control of a different gang. Agustín could not attend school “because of gang presence” and took online classes instead. For months, Agustín “did not leave the house” out of fear of gangs.\nSo the family fled again, to San José Guayabal, Cuscatlán state, some 30 kilometers north of San Salvador.\nOn April 29, 2022, a police officer and a soldier stopped Agustín, then a 16-year-old student, and his mother, at a checkpoint. They took his cellphone and said that they would “escort them home for a raid of their house.”\nWithout ever showing a warrant, they raided the house, questioned the family and left. But a few hours later, police officers returned. Without saying why, they detained Agustín and his father and took them to a police station in nearby Suchitoto.\nAuthorities at the station ordered them to undress and placed them in different cells. Agustín tried to hug his father before they parted, he said, but a police officer pushed him to the floor and kicked him in the head.\nSoldiers transferred Agustín, that night, to another police station. Along the way, they stopped in the middle of the road, and one of the soldiers placed a gun to his head, pulling the trigger repeatedly and laughing. The soldiers told him to run, saying he was a “scourge” who “deserve to die.” Soldiers cuffed Agustín’s feet, and he could barely move. He did not attempt to run.\nWhen they arrived, the police repeatedly beat Agustín, on both legs, with a metal chair while he was standing. It was raining, he said, and they placed him alone in an outdoor cell that had no ceiling. When he fell asleep, an officer kicked him, saying, “This is not the time to be sleeping.” Agustín and a relative told Human Rights Watch that they were never given the name or location of that second police station.\nBefore dawn, police transferred him again to the Metropolitan shelter where he was placed in a cell with three beds and 70 other children, Agustín said. He slept on the floor, next to a flooded bathroom. Two of the guards on the night shift were particularly “cruel,” he said, confiscating children’s blankets, pouring water on the floor that children had to sleep on, and turning the light on and off throughout the night. They said if the children “behaved badly,” they would take them out for “exercise,” an excuse to beat them.\nSix of Agustín’s cellmates called themselves the “cell leaders” and used the beds. One questioned Agustín about his affiliation with gangs. When Agustín remained silent, the cellmate took a hot piece of iron from the roof and pierced Agustín’s eyebrow.\nThe “cell leaders” kicked him virtually every day, counting the seconds out loud, always up to 13—an apparent reference to the MS 13 gang. They covered the cameras inside the cell with clothing, Agustín said, to keep the guards from knowing what was happening.\nOn his sixth day in prison, guards took him to an office within the detention center, where a doctor vaccinated him against Covid-19. When he returned to the cell, other detainees took him to the cell’s bathroom, grabbed him by the arms, and asked if he had “disclosed any information about them to the doctor.” He said he had not, but they placed the same piece of iron that they had used to pierce his eyebrow on the spot on his upper arm where had been vaccinated, Agustín said.\nHe fell ill for three days, running a high fever, he said. He received no medical attention.\nAgustín ate only five meals during the 12 days of his detention. Most days at the Metropolitan shelter, prison guards “threw us the food like we were dogs,” he said. The “cell leaders” kept Agustín’s portions. When Agustín refused to hand over breakfast one morning, a “cell leader” beat him. Agustín said that the food was sometimes “raw;” he drank little water, because “it tasted bad.”\nOn May 11, he appeared before a judge and learned that he was being charged with “unlawful association.” The judge ordered his release on condition that he not leave the country.\nBack home, the police harassed Agustín. In October, one told him, “I do not want to see you in the park.”\nAgustín fled once again, to Ciudad Delgado, in San Salvador state, this time fearing the authorities—and arbitrary detention. A relative told Human Rights Watch that Agustín “now cries every time he sees soldiers or police officers.” Police harassment caused him to leave school, a relative said. As of June 2024, he was working in the construction sector.Lucía Ramirez\nLucía Ramírez (pseudonym) and her family live in the city of Santa Ana, some 60 kilometers northwest of San Salvador. When MS-13 controlled the area, Lucía’s mother, a domestic worker, paid extortion fees of US$ 50 a week to gang members who, she said, threatened that “if I did not pay, they would kill me.”\nLucía, who left school at age 11, was 16 years old and unemployed on April 1, 2022, when several police and soldiers entered the house she shared with her boyfriend, a 15-year-old agricultural worker, and arrested them both. They did not show a warrant or say why they were making the arrests, a relative who was present said.\nThe officers photographed Lucía handcuffed and took her to a police station in La Candelaria, some 20 kilometers northwest of Santa Ana. Authorities transferred her, the next day, to the Metropolitan shelter, some 80 kilometers southeast of Santa Ana. Guards at the Metropolitan shelter beat her repeatedly with batons, a relative said.\nOn April 17, prison guards took Lucía to a courthouse, where a prosecutor charged her and five other children with unlawful association, and a judge sent them to pretrial detention. Police reports reviewed by Human Rights Watch alleged that Lucía and three others were detained on the street as they were “preparing to commit” an unspecified “crime.” In contrast, a relative told Human Rights Watch that Lucía was arrested at her home and the police report provided no evidence that she was preparing to commit a crime.\nIn mid-May, several detained girls assaulted Lucía in a prison bathroom, a relative said. When she resisted, they beat and kicked her.\nPrison guards responded by sending Lucía to what her family called a “punishment cell.” It was completely dark, they said, and authorities gave Lucía no food and almost no water during the three days she was held there.\nWhen guards sent her to a shared cell, the girls who had assaulted her beat her again and left her unconscious. Authorities took her to a clinic inside the detention center. She was unable to walk for the first several days. She stayed in the clinic for a week.\nDuring a hearing in which her family was able to participate virtually, authorities informed them only that Lucía “had fallen ill.” The judge released her on condition that she not leave the country.\nA year later, the judge acquitted her of all charges. A relative said that incarceration “changed Lucía.” “Now, she is always angry, frustrated.”Abusive Conditions in Custody\nSalvadoran law establishes that “inhumane or degrading disciplinary measures, such as corporal punishment, confinement in dark cells, and isolation, cannot be applied under any circumstances.” It also prohibits “reducing food portions, denying contact with relatives, and imposing collective punishments.” Use of force is only allowed “in specific circumstances,” which are not specified by the law.\nIn practice, however, children in detention were subjected to these and other forms of abuse. Human Rights Watch interviewed 28 children or their relatives who described appalling conditions in detention, including often overcrowded and unsanitary cells, lack of adequate nutritious food, lack of—or denial of—access to medication, adequate medical care, and education.\nFor example, a 17-year-old girl told Human Rights Watch that she spent “seven days in a dirty, overcrowded cell,” with “water spilling” from broken toilets into the dormitory where children slept, some without mattresses. The food, she said, was “bitter.” Such an environment is dangerous for detained children, not only physically but also psychologically, undermining their dignity and hindering any meaningful efforts toward their reintegration into society.\nWhile conditions in El Salvador's juvenile detention centers have for a long time been deplorable, the increasingly punitive approach against children has resulted in at least temporary overcrowding in shelters, where children are held awaiting trial, and in juvenile detention facilities. As of October 2021, the combined official capacity of El Salvador’s four juvenile detention facilities was 500, with El Espino accommodating 100 children, Freedom Path and Tonacatepeque 150 each, and Female 100. However, in September 2022, 1,730 children and adolescents were reported held in these centers, authorities said. El Espino held 381, Freedom Path 701, Tonacatepeque 322, and Female 326, meaning that the centers were at 381 percent, 467 percent, 214 percent, and 326 percent of capacity, respectively.\nAuthorities appear to have taken some steps to reduce overcrowding. In January 2024, CONAPINA told US authorities that 841 remained in prison as of January 2024—262 in pretrial detention and 579 serving sentences—and the rest had been released.\nCONAPINA told Human Rights Watch, in April 2024, that the total capacity of the centers had been expanded to 1,400, with new capacities as follows: El Espino 300, Freedom Path 400, Tonacatepeque 500 and Female 200. It did not explain how it had expanded the centers’ capacity from a total of 500. If these figures are accurate, the total number of children who remain in detention would be significantly smaller than the total capacity of the juvenile detention facilities, though it is unclear how many children are currently being held in each of the sites.\nThe budget of the juvenile penal system experienced a consistent decrease from 2022 to 2024, according to the national budgets passed by the Legislative Assembly. The budget decreased by 4 percent from 2022 to 2023 and by 4 percent from 2023 to 2024. Overall, the budget saw a reduction of 8 percent between 2022 and 2024. Click to expand Image\nSalvadoran law also establishes that “schooling, vocational training, and recreation are mandatory” in juvenile detention facilities. International standards call for every child in detention to have “a suitable amount of time for daily free exercise, in the open air when weather permits,” and “additional time for daily leisure activities.” Yet, several children who spoke with Human Rights Watch had been denied a chance to study while in detention or were only allowed to do so intermittently while detained.\nSalvadoran and international law prohibit restricting communication with family members. For example, the United Nations Rules for the Protection of Juveniles Deprived of their Liberty, provide that “every juvenile should have the right to receive regular and frequent visits, in principle once a week and not less than once a month, in circumstances that respect the need of the juvenile for privacy, contact and unrestricted communication with the family and the defense counsel.”\nYet in almost all cases of children detained Human Rights Watch documented, relatives were not allowed to visit while the children were held at police stations, shelters, and juvenile detention centers. Relatives were only allowed to see them during court hearings, sometimes virtually. In some cases, authorities allowed relatives to speak briefly to the children, either virtually or at a courthouse.\nAccess to detention centers in El Salvador is heavily restricted and government authorities did not respond to most of Human Rights Watch’s information requests on prison conditions. Human Rights Watch interviewed a health professional who visited the Freedom Path confinement center in June 2022 and the Female confinement center in May 2023, providing medical care to 90 and 60 children, respectively. His evaluations took place in a private office within the prison, ensuring confidentiality. Otherwise, his access was limited to the “common areas” and the health facilities inside the prison.\n“It was shocking,” he said. “Children were extremely thin,” with “their eyes bulging from malnutrition.” Authorities cooked the food in a huge pot, he said. “Only the food at the bottom got cooked; the rest remained raw. They had to either eat the raw food or go without eating.”\nHe said the Freedom Path confinement center was overcrowded. If one detainee contracted a skin disease, he said, everyone in the cell would catch it. Children believed to be members of various gangs were placed together, he said, and those in pretrial detention were placed with those serving sentences. The United Nations Standard Minimum Rules for the Treatment of Prisoners provide that pretrial detainees should be kept separate from those serving sentences.\nChildren told the health professional that bathrooms were “filthy,” and water was sometimes unavailable. One boy told him, “ have to urinate in a bucket and use it to flush the toilet.”\nThe health professional witnessed diseases and conditions including tuberculosis, fungal infections and scabies, severe malnutrition, and digestive problems, including diarrhea. The children often remained untreated, he said, and guards did not provide medication for chronic illnesses, for example, asthma inhalers.\nGirls told him of sexual abuse, both by guards and other detainees. He treated many for vaginal infections, which he believed may have resulted from abuse.Selected Cases\nTeófilo Aguirre\nIn mid-February 2024, 13-year-old Teófilo Aguirre (pseudonym), and four other classmates in the city and state of Chalatenango recorded a video in which one of them made a hand gesture associated with gangs and posted the video on social media. On February 18, Justice and Security Minister Gustavo Villatoro posted photos of the video on X, saying that Teófilo had been arrested. “We are not willing to tolerate any action related to these terrorist groups and their culture of death,” he said. But after a few hours, Teófilo was released.\nThe next day, police arrested Teófilo again outside of his school, in the state of Chalatenango.\nPolice accused Teófilo and the others who had appeared in the video of unlawful association, but after three hours at a police station in Chalatenango, they were released.\nOn February 20, the police went back to the school, saying that the release had been “a mistake.” They detained the five children again.\nThe police paraded them around town in a police vehicle before delivering them to a police station in Chalatenango. Teofilo’s lawyer, who gained access, said Teófilo was held with 10 other children and kept in a small, 3x4 meter cell with one mattress. The cell was exposed to the sun. The lawyer compared it to a “chicken cage.”\nAfter 12 days, on March 4, Teófilo and the other 10 children appeared before a judge at an Anti-Organized Crime Court in San Salvador. The judge granted Teófilo and six others “conditional release,” meaning that they would be “supervised” by their schools, while the investigation continued for the rest of a mandated 60 days.Cecilia Flores\nAt about 1:00 a.m. on July 1, 2022, police and soldiers knocked at the door of the house where Cecilia Flores (pseudonym), then a 15-year-old student, and her family lived in a small town in the state of Sonsonate.\nWithout showing a warrant, they arrested Cecilia. A relative recalled the police saying that they had “received a phone call claiming that she was the girlfriend of a gang member.” When she denied it, an officer said, “Someone does not like you,” which the family interpreted as someone reporting her out of spite. Click to expand Image\nCecilia Flores (pseudonym) lives in a rural town in Sonsonate, El Salvador, where her parents have kept her bedroom just as it was before her arrest. Photo taken on December 16, 2023. © 2023 Human Rights Watch\nCecilia was held at a police station in Sonsonate, where she was held for seven days, in a cell with both children and adults. She had to shower with her clothes on, she said, because she had no privacy and male officers often spied on her, she said.\nOn the way to her first hearing, on July 14, in Santa Ana, some 70 kilometers to the east, Cecilia said a prison guard suggested he was going to marry her. “I am going to meet my mother-in-law at the hearing,” she recalled him saying. “You can be freed during the hearing, but just you. You know how you can pay me.”\nAt the hearing, police officers testified that they had arrested her “on the streets with other gang members,” she said. A prosecutor charged her with unlawful association and sent her to pretrial detention at the Female confinement center.\nGuards at the center “took out of the cell and suspended them from their handcuffed hands all night long,” Cecilia said, and she heard girls “screaming because they could not bear it, saying that they would urinate there.”\nGuards threw tear gas at the cell on four occasions after some girls disobeyed rules, Cecilia said, and girls sometimes vomited blood after the exposure to the gas.\nCecilia received no medical attention, she said, when she fell ill with chicken pox. Despite having a contagious illness, she was not isolated from others.\nAfter pleading guilty in January 2023 under circumstances described in the next case (Carolina) below, Cecilia was taken back to the Female confinement center. She was “conditionally released” on July 1, 2023, and on December 22, a court ruled that she had completed her sentence.Carolina González\nOn July 1, 2022, several police officers and soldiers arrived at the home of Carolina González (pseudonym), a 17-year-old student, in a town in the state of Sonsonate.\nThey said they were arresting Carolina for “collaborating with gangs.” They did not provide an arrest warrant. They took two photos of her, one next to a soldier. Then they loaded her into a police vehicle with some 10 people, and took her to a police station in Sonsonate, where an officer asked her to “deliver a gang member.” He named a gang member by alias, promising to “set her free” in exchange for the person’s true name. Carolina said she did not know who it was.\nShe was held at the station for seven days, sharing a cell with 25 others, including adults. They had to sleep “almost one on top of the other,” she said, and officers “threw the food into the cell instead of waiting for us to take it.”\nOn July 7, police transferred her to the Metropolitan shelter in Ilopango. Authorities held her there for seven days. The toilet leaked water onto the floor where she and other detainees slept, she said. The food had a “bitter” taste and came sprinkled with a “very ugly yellow powder.”\nOn July 14, she appeared, for the first time, before a judge, in Santa Ana, some 70 kilometers east. Police officers testified that they had arrested her, not at home, as she told Human Rights Watch, but “on the streets with other gang members.” She was charged with unlawful association and sent to pretrial detention at the Female confinement center, where she shared a cell with 36 other girls, and a mattress with one of them.\nOn January 9, 2023, she and seven others, including Lucrecia and Cecilia, whose cases are described above, appeared before a judge. The judge said that if one of them refused the deal they were being offered—to plead guilty to collaborating with the MS-13 gang in exchange for having their prison sentence halved—they would all receive longer sentences. They all pleaded guilty as charged and were sentenced to a year in prison. “We did not have an option,” Carolina said. “We all wanted to see our moms.”\nCarolina was taken back to the juvenile detention center. On February 9, 2023, several detainees tried to escape, Carolina said. The guards punished all the detainees. For 15 days, they did not let the girls go to the prison patio and did not provide dinner. The guards transferred Carolina to a cell with girls who, she said, “behaved badly,” and she was forced to sleep on the floor as punishment. “I was not able to sleep because of how hungry I was,” Carolina said.\nA judge ordered Carolina’s “conditional release” on July 1, 2023. Her biggest hope had been to see her grandmother, who had raised her. But she learned, upon her release, that her grandmother had passed away. A relative said that the family had asked prison authorities for permission to let Carolina attend the funeral, but the authorities had refused. On December 22, 2023, a court ruled that Carolina had served her sentence.Due Process Violations and Unfair Trials\nUnder Salvadoran and international law, children accused of crimes have a right not to be detained arbitrarily or subjected to other forms of unlawful detention. Children also have a right to the basic guarantees of a fair trial, including the right to be presumed innocent until proven guilty, to be informed promptly and directly of the charges against them, to have prompt access to legal and other appropriate assistance, and to have their cases heard without delay. Imprisonment of children should be a last resort and for the minimum period possible, and pretrial detention in particular should be limited to exceptional circumstances.\nBut during the state of emergency in El Salvador, authorities have routinely violated children’s fundamental rights to fair legal processes for children accused of a crime during the state of emergency. Violations included failure to show warrants and to inform detainees of the grounds for the arrest, prolonged and unnecessary use of pretrial detention, inadequate access to legal representation, and improper restrictions on contact with family members.\nMost detainees had public defenders who faced an immense workload and often failed to provide an adequate defense. As of April 2024, there were 281 public defenders in El Salvador, each representing an average of 281 cases. The situation was also dire for children in the juvenile criminal justice system. With over 3,000 juvenile criminal cases and only 27 public defenders assigned to the Juvenile Criminal Unit, each defender was responsible for approximately 108 cases on average.\nIn most cases that Human Rights Watch documented, the prosecution presented unreliable or uncorroborated evidence, such as statements solely from security officers or from anonymous informants—and courts convicted children on that basis. In four instances, judges and prosecutors abusively pressed children to plead guilty, including in groups.\nIn almost all cases documented in this report, prosecutors accused the children of the broadly defined and vague crime of unlawful association enacted in 2016. As described above, it criminalizes anyone who “takes part” in a gang, is the “creator, organizer, chief, leader financer” of a gang, or “promotes, helps, facilitates or favors the creation or presence” of these groups or, knowing such groups are unlawful, “receives direct or indirect benefit” from relations “of any nature” with gangs, “even without being a part of them.”Selected Cases\nRoberto Gámez\nFourteen-year-old ranch employee Roberto Gámez (pseudonym) was on his way to his girlfriend’s house, in the city of Ilobasco, Cabañas state, on May 10, 2022, when three police officers stopped him. Roberto ran away, as a relative explained it, “because he was scared.”\nThe police arrived at Roberto’s home a few minutes after he did and, without providing a warrant, detained him. They held him at a police station in Sensutepeque, some 30 kilometers away, for 15 days.\nAt his first hearing, along with five other children, on May 25, the prosecutor charged Roberto with unlawful association and a judge ordered that he be sent to pretrial detention at the Freedom Path Confinement Center in Ilobasco for six months.\nHuman Rights Watch examined the court file detailing Roberto’s case. According to a police statement, unspecified “local inquiries” indicated that Roberto associated with MS-13 gang members and was unemployed. No details were provided, the report said, because the “informants” had asked not to be identified. The file also included police testimony that Roberto had fled when officers stopped him.\nOne officer cited in the file said he had received a “tip” about three individuals, including Roberto, on a bridge. When police attempted to stop them, he said, the three tried to escape.\nThe file also cited an “expert witness” who was said to have interviewed unnamed witnesses and concluded that Roberto was an “active MS-13 member with a collaborator role.” Another “expert witness” said he had analyzed Roberto’s phone, finding “photos, music, and voice messagesindicative of gang affiliation,” including one photo of a man with a gun and another of a man with sneakers that are “common among gang members.” But another report included in the file said that while Roberto lived in an area “under MS influence,” he did not “seem to identify with the gang.” The report noted that Roberto was employed on a ranch.\nIn October 2023, after almost a year-and-a-half in pretrial detention, a judge convicted Roberto for the crime of unlawful association and sentenced him to five years in prison and five years under “conditional release,” meaning in this case educational programs and the court’s monitoring with the assistance of social workers.\nAs of April 2024, Roberto remained imprisoned at the Freedom Path confinement center. A relative saw him at a virtual hearing in January 2024 and was able to talk to him for five minutes.Kevin Morales\nOn April 8, 2022, police and soldiers arrested 17-year-old Kevin Morales (pseudonym) and his 21-year-old brother Pablo (pseudonym) at their home in a rural community that is part of the town of Santiago Nonualco, La Paz state.\nThey ordered the family to “hand over the weapons,” a relative who was present said. The family replied that they did not have any. They accused the brothers of unlawful association and threatened to arrest the relative who had asked about the warrant “if he did not shut up.”\nThey took the brothers, together, to a police station in Santiago Nonualco, and two hours later, released Kevin. The next day, police transferred Pablo to a police station in Zacatecoluca, a few miles away, and later to La Esperanza prison, in the state of San Salvador.\nOn July 15, police returned to the family’s home, accusing Kevin of unlawful association. They “paraded him around,” handcuffed, for a kilometer, a relative said, so that neighbors would see that he had been arrested. They eventually delivered him to the same police station in Santiago Nonualco.\nThe next day, police took Kevin to the Public Defender’s Office in Zacatecoluca and a few hours later moved him to the Metropolitan shelter in Ilopango.\nKevin appeared before a judge for the first time in late July and was charged with unlawful association. Family members were not allowed to testify. A police officer testified that they had detained Kevin not at home but on a “hill” where “ had an operations camp,” a relative who was present at the hearing said. The prosecutor used that testimony to accuse Kevin of gang connections. The judge ordered Kevin to be held, pretrial, at a juvenile detention center in Tonacatepeque, some 70 kilometres north.\nOn September 7, 2023, a judge sentenced Kevin to seven years in prison, followed by three of “conditional release,” consisting of court monitoring with the assistance of specialists, and compliance with educational programs.\nA relative who was present at the trial said the only evidence presented by the prosecution was the police testimony saying Kevin was arrested at the gang operations camp. The judge, the relative said, denied a defense request to be allowed to provide testimony to refute it.\nIn April 2023 Kevin was transferred to Penitentiary Farm in Ilobasco, a detention center for juveniles between the ages of 18 and 21, in Cabañas state. A relative was able to talk to him briefly during a virtual hearing in November 2023.Ricardo Gómez\nAt 6 a.m. on July 2, 2023, police officers awakened 15-year-old high school student and carpentry apprentice Ricardo Gómez (pseudonym), at his home in the city of Cuscatancingo, in San Salvador state.\nWithout showing a warrant, they arrested him, saying that “someone had reported him to the authorities,” a relative who was present said. They photographed him and took him to a police station in Cuscatancingo.\nA few hours later, police took Ricardo to the Public Defender’s Office, where authorities told a relative that he had been accused of “unlawful association.” “Don’t worry,” a police officer assured the relative, “we are giving him back.”\nLater that day, officers transferred Ricardo to the Metropolitan shelter in Ilopango.\nRicardo appeared before a judge on July 17, 2023, in San Salvador and was charged with unlawful association. He was not able to speak with his defense lawyer or his relatives before or during the hearing, a relative who was present told Human Rights Watch, and the judge sent him to pretrial detention.\nPolice took Ricardo to Freedom Path confinement center in the city of Ilobasco, Cabañas state.\nOn January 16, 2024, authorities brought Ricardo to a court hearing at an Anti-Organized Crime Court in San Salvador, where police officers testified that he was a “gang member,” a relative said.\nHis family denies it. The relative, who was present in the hearing, said that he saw Ricardo “covered with boils and skin fungus.” Ricardo, who was able to talk with his family very briefly, said that these were due to “lack of hygiene” in the detention center.\nRicardo remained in detention as of April 2024. Two hearings were suspended because the police “did not show up at court to provide testimony,” a relative said.Lucio Menéndez\nSixteen-year-old Lucio Menéndez (pseudonym) was on his way home from lunch out in a rural area of Meanguera municipality, in the state of Morazán, on April 19, 2022, when police and soldiers arrested him.\nThey told a relative that Lucio was detained “because of a phone call” informing on him. Police took him to a Meanguera police station and, after a few hours, transferred him to a shelter in San Miguel. His family was not allowed to see or talk to him at the shelter.\nOn April 29, Lucio appeared before a judge for the first time, was charged with unlawful association, and was sent to pretrial detention at Freedom Path in Ilobasco, for 90 days.\nSeveral court hearings were postponed until November 18, 2022, when a judge sentenced Lucio to 12 years in prison. The ruling, which Human Rights Watch reviewed, cites only a police officer’s testimony as evidence. The officer said he stopped Lucio because he had a “a suspicious look.” He said he asked Lucio for his name and used a “police database” indicating that, according to six “anonymous” sources, Lucio was “an active gang member for the MS-13 with the rank of collaborator.”\nA relative said the sources never presented a formal criminal complaint against Lucio and that there was no formal record of the information they had allegedly provided to the police.Sonia López\nOn April 16, 2022, 15-year-old childcare worker Sonia López (pseudonym) was at home in a rural community of Joateca municipality, in the state of Morazán, when police arrived, demanding her cell phone. Sonia had dropped out of school in 7th grade, during the Covid-19 pandemic. A relative said that police arrested her, citing a photo that officers said they found in her phone. They did not explain what the photo showed.\nA police officer took her to a police station in Joateca where Sonia spent the night. The next day, police transferred her to a shelter in San Miguel, where she was held for some 15 days. A relative said she could not talk or see her during this time.\nSonia appeared before a judge two weeks later, was charged with unlawful association, and sent to pretrial detention at the Female confinement center for 90 days.\nOn November 18, 2022, a judge sentenced Sonia to 10 years in prison. The ruling, which Human Rights Watch reviewed, cites a police officer’s testimony as the sole evidence against her. In his testimony, the police officer said he and others arrested Sonia because a police data base identified her as a “member of MS-13.” He said police and anonymous locals had seen her as “suspicious because she collaborated” with the gang. “Previously, we had not deprived her of her liberty because there was no arrest or administrative warrant this time we moved forward with the deprivation of liberty of the young woman because of the state of emergency.” As of April 2024, Sonia was serving her sentence at the juvenile detention center in Ilopango.\nTomás Solano\nOn April 16, 2022, 16-year-old construction worker Tomás Solano (pseudonym) and a cousin were having dinner at their grandfather’s home in a rural town in the state of Morazán when police arrived.\nPolice arrested both boys, saying they were “active gang members,” and took them to a police station in the nearby town of Osicala, a relative who was present said. A few hours later, they transferred Tomás to a shelter in San Miguel.\nAfter two weeks, Tomás appeared before a judge for the first time, was charged with unlawful association, and sent to pretrial detention for 90 days.\nAuthorities postponed hearings until November 18, when a judge sentenced Tomás to 12 years in prison. The ruling, which Human Rights Watch reviewed, cites an officer’s testimony as the sole evidence against him. The officer said he had received a call from a police chief reporting “two people extorting locals.” He said he went to the street identified as the scene of the extortions and found and arrested Tomás and his cousin. A relative of the boys who was at dinner at the grandfather’s house with them was not allowed to testify, the ruling shows.\nThe police officer testified that he had had information “for the last three months” indicating that Tomás was a gang member. However, he admitted that there were no formal records of the information or of criminal complaints against Tomás.\nIn April 2024, authorities transferred Tomás to the Rehabilitation farm detention facility in Ilobasco for youth between 18 and 21 years old.\nLong-Lasting Consequences of Detention for Children\nThe accounts of children interviewed by Human Rights Watch who were detained and released during the state of emergency reveal deplorable conditions of detention and routine cases of abuse.\nThe consequences of detention for children deprived of liberty in such contexts can be profound and long-lasting. Detention significantly disrupts children’s education, often causing extended school absences that lead to academic setbacks and increased dropout risks. Additionally, the stigma associated with detention hinders social reintegration, damaging personal relationships and community acceptance.\nRicardo Durán, a 15-year-old student at the time of the detention, told Human Rights Watch:\nIf you’ve been detained, you’re already considered a bad person. Because you were detained, you’re seen as bad. Neighbors and police look at you with suspicion. The police come to see where you work and ask what you’re doing. If you’re at home, they come to harass you. I’m afraid they’ll detain me again.\nChildren held in detention are at risk of suffering from mental health issues such as depression, anxiety, and post-traumatic stress disorder (PTSD), which can manifest in symptoms like insomnia and nightmares. The detention experience can also cause significant damage to their long-term cognitive and physical development.\nLucrecia Pérez (pseudonym), a 17-year-old girl in Sonsonate state, told Human Rights Watch:\nWhen I first arrived I felt sad, desperate. The days seemed to drag on endlesslyI couldn’t sleep, and when I did, I had nightmares of being killed, sometimes waking up crying I lived in fear of being detained again by security forces. I changed schools because I felt like people were staring at me. It left me feeling ashamed.\nDetention is a highly traumatic experience for children, as it involves a loss of control, enforced separation from the outside world, detachment from their community, culture, and religion, and the inability to experience life as predictable, meaningful, and safe. The longer children are detained, the more likely they are to be exposed to traumatic events and experience feelings of isolation, detachment, and loss of confidence, as research has shown a clear link between the length of detention and the severity of psychosocial and developmental issues faced by children.\nA relative of a 17-year-old who was detained and released after a year in prison said:\nAfter the detention, he feels resentment. Now he has picked up the bad habit of drinking. He says to me: ‘Mom, I don’t feel well. I will never forget what I went through there; when I drink, I forget.’ Suddenly, I see him crying in his bed. Whenever he starts remembering, he tells me it’s 11 o’clock at night, and at this hour, we were getting a good beating from the UMO .\nAnother relative described how her son is after two years in prison:\nHe came out disoriented, he doesn’t want to talk, he doesn’t want anyone to see him. I don’t know what to do with this situation because I want him to be like he was before.\nExtensive research in the field of criminal justice has shown that children detained with adults are more likely to engage in future criminal activities compared to children held with their peers. Furthermore, studies in juvenile justice indicate that children who have experienced detention have worse outcomes compared to their peers who have committed offenses but are placed in community-based alternative programs, including lower educational attainment, reduced employment rates, increased suicide rates, and higher rates of re-arrest.\nA relative told Human Rights Watch:\nAll my daughter experienced was mistreatment. They beat her. There, you have to defend yourself; no one defends you. She came out worse, more frustrated by everything she has lived through. Now she fights with her sister, hits her. She doesn’t want to study or work.\nSimilarly, Luis Mejía (pseudonym) said:\nI left school because I was afraid they would arrest me again. I lost my job because. Now they ask me for criminal records where it shows I was detained two times. Now I’m afraid I won’t get another job.\nCarolina González (pseudonym) told Human Rights Watch:\nMy grandmother died while I was imprisoned. I feel like it was my fault, because she suffered when I was detainedShe got depressed my world ended. Sometimes I feel angry, we were very closeThe only time I feel happy now is at the beach, I feel my sorrows go away.\nIn situations of extreme violence, the mistreatment and torture of children in detention can lead to alienation and a desire for revenge, potentially driving them to join criminal groups. Lucas Rodríguez, who was 15 years old when detained, told us: “I left prison worse than when I went in. Prison only hardens you.”\nAdditionally, when children who are not associated with gangs perceive that they may be detained based on mere suspicion of involvement, they may be more inclined to seek protection by joining such groups. The conditions in confinement centers can also contribute to children being recruited by gangs for protection or being forced to join them to stay alive.\nFor children who have previously experienced gang violence, detention may serve to reinforce their experiences of unfair or unjust treatment and their perception that life is unsafe, uncertain, unstable, and unpredictable. In this way, detention can become a continuation of the child’s abuse, further compounding the trauma they have already endured.\nRecommendations\nTo the Government of El Salvador:\nEstablish an ad hoc mechanism to review the cases of people detained during the state of emergency. The mechanism should:Prioritize for prosecution cases involving higher-level gang leaders and perpetrators of violent crimes by gangs, including killings, rape, and child recruitment.Promptly release people who have been detained without adequate credible evidence.Design and implement non-carceral measures such as diversion programs for people convicted of gang membership who were not linked to violent crimes and who meaningfully participate in robust re-integration programs.Prioritize reviewing cases of children, people with disabilities, pregnant women, and people with serious health conditions.Develop and implement a new rights-respecting security policy to dismantle gangs and protect the population, including children. Such policy should:Prioritize strategic criminal prosecutions, focused on prosecuting higher-level gang leaders and conducting serious investigations of violent crimes and other offenses—such as money laundering and extortion—that are likely to meaningfully impact the gangs’ structure, power and influence.Ensure that gang leaders are effectively prosecuted for the offense of using children to commit crimes, in addition to being held responsible for the underlying criminal acts.Implement violence prevention initiatives at school, family and community-based levels for children, including those under the typical age of gang recruitment in El Salvador, including family activities, mentorship and after-school programs.Implement rehabilitation programs for recruited children, including by offering vocational skills and training programs, treatment for substance use disorder, psychological support and therapy, reenrollment in formal education, and assistance in developing positive social networks and connections.Implement reintegration programs for children who have committed violent or otherwise criminal acts and who might have been exposed to arrest or detention, including restorative justice interventions, support with accessing the job market, tattoo removal, public campaigns to combat stigma and discrimination, and reenrollment in formal education.Prioritize investigating and prosecuting child recruitment, including of girls for sexual services and of boys forced to commit crimes in gangs.Improve police effectiveness and accountability, including through success metrics and training that are firmly grounded in protection of human rights, and the implementation of meaningful oversight mechanisms.Reduce prison overcrowding, including by ending the unnecessary or prolonged use of pretrial detention, applying alternatives to imprisonment for people with disabilities or with underlying health conditions and for older people, and by using, when appropriate, reporting requirements and other less-restrictive measures.End the state of emergency.Ensure detention of children is only used as a last resort, for the shortest appropriate period, in accordance with Salvadoran law and international standards.Urgently improve conditions in prisons, starting with juvenile detention facilities, to ensure they meet international standards, including by:Ensuring detainees are treated in a humane and dignified manner, with sufficient access to space, food, water, adequate medical treatment, and sanitation.Enhancing the quality and availability of therapeutic and rehabilitation services, including access to education and health services in juvenile detention facilities, and provide comprehensive support for former offenders to facilitate their successful reintegration into society.Prohibiting disciplinary measures involving solitary confinement or punishments that may compromise children’s physical or mental health and provide clear guidelines for staff.Ending incommunicado detention and ensure that detainees can communicate and receive visits from their families and lawyers.Ensuring that children are always held separately from adults, and that pre-trial detainees are held separately from people serving sentences.Sending the unequivocal message that abuse of detainees is prohibited, and sanctioning law enforcement and detention center administration officials who engage in abuse of detainees.Allowing international monitors and Human Rights Ombudsperson’s Office to conduct unrestricted and unannounced monitoring of all detention facilities where children may be held in order to ensure their human rights, including to be free from torture and other cruel, inhuman or degrading treatment or punishment.Implement Salvadoran law requiring that the National Civil Police not keep records on offenses attributed to children.Ensure that training programs for police officers incorporate obligations on respecting the human rights of all citizens, including vulnerable groups, such as children in low-income communities who may come into regular contact with security forces.Ensure that police officers do not harass people, including those who have been released from detention.Work with the Legislative Assembly to ratify the International Convention for the Protection of All Persons from Enforced Disappearance; the Optional Protocol to the Convention against Torture and Other Cruel, Inhuman, or Degrading Treatment or Punishment; and the Optional Protocol to the Convention on the Elimination of All Forms of Discrimination against Women.Comply fully with the 2011 Law on Access to Public Information, including by publishing public interest information, such as historic and current homicide rates, information on the implementation of the Territorial Control Plan, and the prison population, as well as by responding in a timely and fair manner to public information requests.Increase funding to the Public Defender’s Office to ensure it is able to provide adequate and timely defense.Refrain from posting on social media photos of detained people, especially children, and from prejudging them as criminals based on their clothing, where they live, their tattoos, or their family relationships.Work with the Legislative Assembly to amend the Law of the Inspector General for Public Security, charged with monitoring the work of security forces, to ensure its independence and strengthen its oversight of police activities.Collaborate with the Ministry of Education to analyze causes of school dropout, develop targeted support programs, and gradually raise the compulsory education age from 15 to 18, addressing economic factors and other barriers to keep vulnerable youth in school.To the National Council of Early Childhood, Children and Adolescents (CONAPINA):\nEnsure that conditions of confinement for children meet all of the requirements of health, safety, and human dignity established under the Juvenile Criminal Law and international standards, including guaranteeing that children are housed separately according to their age, physical development, and severity of offense.Guarantee children’s rights to receive schooling and professional training, be treated with dignity and respect, and receive visits on at least a weekly basis, and for each child to have their own mattress and bedding and access to items necessary for the maintenance of hygiene and personal cleanliness.Ensure that qualified medical professionals are available in each detention facility to attend to the health needs of children.Guarantee that children accused of criminal offenses committed are promptly charged, provided with access to legal counsel, and treated in accordance with international juvenile justice and fair trial standards.Ensure young adults between the ages of 18 and 21 are housed in separate detention centers or in separate sections of detention centers holding children under the age of 18.Establish a complaint system independent of juvenile detention facilities’ guards to ensure that abuses can be promptly and independently investigated.To the Legislative Assembly:\nEnd the state of emergency.Raise the statutory minimum age of criminal responsibility to at least 14 years old, as recommended by the Committee on the Rights of the Child.Revoke the 2022 and 2023 reforms to the Special Law Against Terrorist Acts, the Juvenile Criminal Law, and the Law Banning Gangs, Bands, Groups, Associations and Organizations, and the Law Against Organized Crime and bring these laws and the Criminal Code and the Code of Criminal Procedure in line with international standards, including by eliminating mandatory pretrial detention and narrowing the definitions of terrorism and unlawful association.Amend the Law of the Inspector General of Public Security to improve and increase oversight of the police.Repeal the 2021 reforms to the Judicial Career Law and the Organic Law of the Attorney General’s Office, which undermine the independence of judges and prosecutors.Reform the Penitentiary Law to ensure that it complies with international legal standards, including by ensuring that detainees have access to family visits and private meetings with their lawyers.To the Attorney General’s Office:\nDevelop and implement a policy of strategic criminal prosecutions to address gang violence by improving prosecutors’ technical capacity to gather credible evidence, prioritizing the prosecution of higher-level gang leaders, investigating violent crimes, as well as other offenses—such as money laundering and extortion—that are likely to meaningfully impact the gang’s structure, power and influence.Promptly initiate thorough, impartial investigations into unlawful connections between gangs, government officials, and security forces.Conduct prompt, thorough, and impartial investigations into allegations of human rights violations, such as those documented in this report, including instances of arbitrary detention, sexual violence, torture, and other ill-treatment of detainees, as well as into circumstances such as suspicious deaths in custody.Conduct prompt, thorough, and impartial investigations into government officials who may have failed to comply with court decisions ordering the release of detainees.To the Human Rights Ombudsperson’s Office:\nRegularly inspect juvenile detention facilities without notice to monitor conditions, including by seeking private and confidential meetings with detainees, and releasing comprehensive reports of the visits, including on allegations of ill-treatment, overcrowding, lack of access to adequate or timely medical care, and poor sanitary conditions.Conduct swift investigations into allegations of human rights violations and report on the office’s findings in a transparent and periodic manner.Work with the National Penitentiary Office, the Attorney General’s Office, and the Public Defender’s Office and CONAPINA to ensure respect for the rights of children who have been detained.To the Judiciary:\nEnsure that all children in conflict with the law are prosecuted exclusively in specialized juvenile courts, separate from the adult criminal justice system.Strengthen and expand the capacity of El Salvador’s specialized juvenile justice system to handle all cases involving children in conflict with the law, in accordance with international standards.Enforce the right to legal representation for all children in conflict with the law, and provide access to quality, independent, public defense services.Ensure that people, including children, are only being prosecuted on the basis of reliable and corroborated evidence and that nobody is sentenced unless prosecutors can show, beyond any reasonable doubt, their responsibility in a crime.Establish strict protocols and oversight mechanisms to prevent the use of coercion, intimidation, or any other form of improper pressure to extract confessions from children during interrogations or court hearings.Establish clear guidelines and oversight to prevent arbitrary detention and ensure that children are not subjected to abuse, ill-treatment or torture during arrest or interrogation by security forces.Protect the privacy and identity of children involved in criminal proceedings and put in place safeguards to shield them from public stigma, retaliation or revictimization.Comply with international standards on juvenile justice by ensuring pretrial detention is used only as a last resort, based on individualized assessments of necessity and reasonableness, prioritizing alternative measures and ensuring that, in the cases where detention is deemed necessary, juveniles are held in appropriate facilities separate from adults and with strict adherence to legal time limits.Make public data on the duration of court proceedings, backlogs, and compliance with statutory time limits in juvenile cases.To the Public Defender’s Office:\nWork with the Legislative Assembly to increase staffing and ensure that the legal assistance provided to people effectively protects due process rights and the right to effective legal representation.To the Inter-American Commission on Human Rights:\nPromptly publish the Commission’s report on human rights violations committed during the state of emergency in El Salvador.In the Commission's next annual report, consider including El Salvador in Chapter IV.B, which highlights country situations where there is a “systematic infringement of the independence of the judiciary”, where the “free exercise of the rights guaranteed in the American Declaration or the American Convention has been unlawfully suspended”, or where the “State has committed or is committing massive, serious and widespread violations of human rights,” among others.Consider requesting permission from El Salvador’s government to conduct an on-site visit to with a specific focus on children in detention.Closely monitor the human rights situation in El Salvador and publicly condemn human rights violations in the country, including against children.Closely monitor the processes to appoint new members of the Supreme Court in September 2024 and a new Attorney General in January 2025, and urge Salvadoran authorities to respect international human rights standards on judicial independence.To the UN Committee on the Rights of the Child:\nUrge the Salvadoran authorities to put an end to the arbitrary detention of children and to conduct thorough investigations into arbitrary detention, torture, and other forms of ill-treatment against children.Request information from the Salvadoran government on children detained during the state of emergency, about children charged in the juvenile court, the sentences they receive, the detention centers to which they are assigned, and the conformity of Salvadoran law and practice with the Convention on the Rights of the Child.Encourage the government to take measures to fight discrimination and stigma against children who have been released from prison and support them through social protection schemes, psychosocial support, education, and reliable vocational training.To all Member and Observer States of the UN Human Rights Council:\nCondemn human rights violations in detention facilities in El Salvador, including against children.Call on states and international financial institutions to incorporate specific measures to ensure any support to Salvadoran security forces and government does not contribute to or enable torture, ill-treatment, enforced disappearances and arbitrary detention.Bring attention to the situation in El Salvador and raise human rights concerns during Council meetings and debates, including during Interactive Dialogues with relevant Special Procedures mandate-holders or in their statements under items 3, 2 or 4.To the governments of the United States, Canada, Latin American countries, the European Union, and EU member states:\nPublicly and privately oppose human rights violations committed by Salvadoran security forces and press, in a multilateral manner, for respect of human rights and the rule of law.Refrain from providing loans or other economic support to El Salvador’s police, army, prison system, and Attorney General’s Office until there are meaningful human rights improvements, and include measures in any future aid or loans to these entities to ensure that support does not contribute to human rights abuses.Increase support for independent media outlets and civil society groups in El Salvador, including through financial assistance.Press Salvadoran authorities to restore judicial independence including by conducting, at the appropriate time, independent, fair, and transparent processes for the selection of Supreme Court justices and the attorney general, and abrogating laws that undermine judicial independence.To international donors and funders, including the Central American Bank of Economic Integration:\nSuspend or refrain from approving loans benefiting El Salvador’s National Civil Police, Ministry of Defense, prison system, the National Council of Early Childhood, Children and Adolescents and Attorney General’s Office and develop specific, measurable, and significant human rights benchmarks to include in any future financial support to these institutions, such as:Concrete steps toward eliminating torture and other forms of ill-treatment in detention.The effective implementation of an ad hoc mechanism to review the cases of people detained during the state of emergency, with the objective of selecting cases of violent crimes by gangs that should be effectively prosecuted as a matter of priority and promptly releasing people who have been detained without sufficient credible evidence.Significant and growing reductions in reports of arbitrary detentions and due process violations reported by detainees.Evidence of credible and timely criminal investigations of abuses committed by members of the armed forces and the National Civil Police.Rights-respecting reforms of legal frameworks adopted in the context of the current state of emergency that severely undermine human rights.Improvements in detention conditions, including reduction of overcrowding and increased access to medical care.Increased access of independent monitors to interview detainees in Salvadoran detention centers.Conduct an independent external audit of any funding provided in recent years to El Salvador’s National Civil Police, Ministry of Defense, prison system, and Attorney General’s Office to ensure that funds have not enabled human rights violations.Closely monitor the situation in El Salvador, including by conducting regular meetings with civil society groups, to verify human rights conditions and ensure that the bank’s funding is not enabling further abuses.\nAcknowledgments\nThis report was researched and written by a Human Rights Watch staff member whose name is withheld for security reasons.\nIt was reviewed and edited by Juanita Goebertus, Americas director; Juan Pappier, Americas deputy director; Margaret Knox, Americas senior editor/researcher; Sarah Yager, Washington advocacy; Lucy McKernan, UN advocacy deputy director; Cristina Quijano Carrasco, women’s rights researcher; Brian Root, senior quantitative analyst; Sarah Saadoun, Economic Justice and Rights senior researcher; Michael Bochenek, children’s rights senior legal advisor; and Kayum Ahmed, health and human rights special advisor. Babatunde Olugboji, Program deputy director, and María McFarland Sánchez-Moreno, senior legal advisor, conducted program and legal review, respectively.\nAmericas Division senior associate Johan Romero contributed to the report production. The report was prepared for publication by Travis Carr, publications officer.\nHuman Rights Watch would like to thank the human rights, children’s rights and humanitarian organizations that provided important information for this research.\nAbove all, we are deeply grateful to the victims of abuse who trusted us with their stories.\nFor Human Rights Watch’s prior reporting on the state of emergency in El Salvador see, among others, Human Rights Watch and Cristosal, We Can Arrest Anyone We Want: Widespread Human Rights Violations Under El Salvador’s “State of Emergency” (Human Rights Watch: New York, 2022), https://www.hrw.org/report/2022/12/07/we-can-arrest-anyone-we-want/widespread-human-rights-violations-under-el; “El Salvador: Leaked Database Points to Large-Scale Abuses,” Human Rights Watch news release, January 27, 2023, https://www.hrw.org/news/2023/01/27/el-salvador-leaked-database-points-large-scale-abuses; “El Salvador: Sweeping New Laws Endanger Rights,” Human Rights Watch news release, April 8, 2022, https://www.hrw.org/news/2022/04/08/el-salvador-sweeping-new-laws-endanger-rights; “El Salvador: Broad ‘State of Emergency’ Risks Abuse,” Human Rights Watch news release, March 27, 2022, https://www.hrw.org/news/2022/03/29/el-salvador-broad-state-emergency-risks-abuse-0; Juan Pappier (Human Rights Watch) “Bukele’s Old Recipes to Address Gang Violence Are Set to Fail,” El Faro, June 21, 2022, https://www.hrw.org/news/2022/06/21/bukeles-old-recipes-address-gang-violence-are-set-fail.\nHuman Rights Watch and Cristosal, We Can Arrest Anyone We Want: Widespread Human Rights Violations Under El Salvador’s “State of Emergency”.\nSee “El Salvador: Leaked Database Points to Large-Scale Abuses,” Human Rights Watch news release.\nConvention on the Rights of the Child (CRC), adopted November 20, 1989, G.A. Res. 44/25, annex, 44 UN GAOR Supp. (No. 49) at 167, UN Doc. A/44/49, entered into force September 2, 1990, art. 1. El Salvador ratified the CRC on July 10, 1990.\nInter-American Commission on Human Rights, Organized Crime and the Rights of Children, Adolescents and Young People: Current Challenges and State Action (Washington: Inter-American Commission on Human Rights, 2023), https://www.oas.org/en/iachr/reports/pdfs/2023/NorteCentroamerica_NNAJ_EN.pdf (accessed April 14, 2024); Cristosal, Generation Without Return: Report on Childhood and Youth 2016-2018 (“Generación sin retorno: Informe de niñez y juventud 2016-2018”), n.d., https://cristosal.org/ES/wp-content/uploads/2023/02/Generacion-sin-retorno-Informe-de-ninez-y-juventud-2016-2018-min.pdf (accessed April 14, 2024).\nInternational Crisis Group, El Salvador’s Politics of Perpetual Violence (Brussels: International Crisis Group, 2017), https://www.crisisgroup.org/latin-america-caribbean/central-america/el-salvador/64-el-salvadors-politics-perpetual-violence (accessed July 1, 2024), p. 8.\nIbid.\nIACHR, Organized Crime and the Rights of Children, Adolescents and Young People: Current Challenges and State Action, pp. 17 and 18.\nWalter Murcia, El Salvador’s Gangs: Proposals and challenges to socially include youth in contexts of urban violence (“Las pandillas en El Salvador: Propuestas y desafíos para la inclusión social juvenil en contextos de violencia urbana”) (Santiago: Economic Commission for Latin America (ECLAC), 2015), https://www.cepal.org/sites/default/files/publication/files/39362/S1501050_es.pdf (accessed on July 1, 2024), p. 16; International Crisis Group, El Salvador’s Politics of Perpetual Violence (Brussels: International Crisis Group, 2017), https://www.crisisgroup.org/latin-america-caribbean/central-america/el-salvador/64-el-salvadors-politics-perpetual-violence (accessed July 1, 2024), p. 11; IACHR, “Human Rights Watch news release 077/2023,” April 4, 2023, https://www.oas.org/en/IACHR/jsForm/?File=/en/iachr/media_center/PReleases/2023/077.asp (accessed April 14, 2024), p. 30.\nIACHR, Organized Crime and the Rights of Children, Adolescents and Young People: Current Challenges and State Action, p. 18; UNICEF, “Violence against Children in Latin America and the Caribbean 2015-2021,” 2021, https://www.unicef.org/lac/media/34481/file/Violence-against-children-full-report.pdf (accessed April 14, 2024), p. 184; Charles M. Katz and Luis Enrique Amaya, “The Gang Truce as a Form of Violence Intervention: Implications for Policy and Practice,” International Journal of Conflict and Violence, vol. 9, no. 1 (2015), https://www.ijcv.org/index.php/ijcv/article/view/2851 (accessed April 14, 2024), p. 130; Max G. Manwaring, A Contemporary Challenge to State Sovereignty: Gangs and Other Illicit Transnational Criminal Organizations in Central America, El Salvador, Mexico, Jamaica, and Brazil (Indiana: Strategic Studies Institute, U.S. Army War College, 2007), p. 14.\nMax G. Manwaring, A Contemporary Challenge to State Sovereignty: Gangs and Other Illicit Transnational Criminal Organizations in Central America, El Salvador, Mexico, Jamaica, and Brazil, p. 14.\nSonja Wolf, Mano Dura: The Politics of Gang Control in El Salvador (Austin: University of Texas Press, 2017), p. 51; IACHR, Organized Crime and the Rights of Children, Adolescents and Young People: Current Challenges and State Action, pp. 32 and 33.\nJosé Miguel Cruz, “Criminal Violence and Democratization in Central America: The Survival of the Violent State,” Latin American Politics and Society, vol. 53, no. 4 (2011): 1-33, https://doi.org/10.1111/j.1548-2456.2011.00132.x (accessed May 1, 2024), p. 26; Mo Hume, “Mano Dura: El Salvador Responds to Gangs,” Development in Practice, vol. 17, no. 6 (2007): 739-751, https://doi.org/10.1080/09614520701628121 (accessed May 1, 2024), p. 744.\nSee, e.g., Human Rights Watch and Cristosal, We Can Arrest Anyone We Want: Widespread Human Rights Violations Under El Salvador’s “State of Emergency”.\nJosé Miguel Cruz, “The Root Causes of the Central American Crisis,” Current History, vol. 114, no. 769 (2015): 43-48, https://doi.org/10.1525/curh.2015.114.769.43 (accessed April 26, 2024), p. 47; IACHR, Situation of Human Rights in El Salvador (Washington: Inter-American Commission on Human Rights, 2021), http://www.oas.org/en/iachr/reports/pdfs/2021_ElSalvador-EN.pdf (accessed August 19, 2022), p. 18; Human Rights Watch and Cristosal, We Can Arrest Anyone We Want: Widespread Human Rights Violations Under El Salvador’s “State of Emergency” .\nCentral Bank of El Salvador (Banco Central de Reserva de El Salvador), “Household and Multipurpose Survey 2022 Results” (“Resultados Encuesta de Hogares y Propósitos Múltiples 2022”), May 2023, https://www.bcr.gob.sv/documental/Inicio/vista/0c0aa5ade233aa9a7345923e9329407a.pdf (accessed April 14, 2024), p. 53.\nIbid., p. 51.\nIbid.\nEconomic Commission for Latin America and the Caribbean (ECLAC), “Population living in extreme poverty and poverty by age, sex and area,” CEPALSTAT, https://statistics.cepal.org/portal/cepalstat/dashboard.html?theme=1&lang=en (accessed April 18, 2024).\nIbid.\nIACHR, Organized Crime and the Rights of Children, Adolescents and Young People: Current Challenges and State Action, pp. 17 and 18.\nSalvadoran Foundation for Economic and Social Development (Fundación Salvadoreña para el Desarrollo Económico y Social, FESPAD), “The Situation of the Rights of Children and Adolescents in 2022” (“Balance Situación de los Derechos de la Niñez y Adolescencia 2022”), 2022, https://www.fespad.org.sv/balance-situacion-de-los-derechos-de-la-ninez-y-adolescencia-2022/ (accessed April 14, 2024), p. 30.\nCentral Bank of El Salvador (“Banco Central de Reserva de El Salvador”), “Household and Multipurpose Survey 2022 Tabs” (“Tabulados Encuesta de Hogares y Propósitos Múltiples 2022”), May 2023, https://www.bcr.gob.sv/documental/Inicio/vista/334c365a724463fe55770bdf4154b653.pdf (accessed June 28, 2024), p. 27\nMinistry of Education, General Education Law (“Ley General de Educación”), Decree 917, signed into law on December 12, 1996, https://www.transparencia.gob.sv/institutions/mined/documents/558585/download#:~:text=EDUCACION%20BASICA-,Art.,cuando%20la%20imparta%20el%20Estado (accessed April 14, 2024), arts. 5 and 20.\nFESPAD, “The Situation of the Rights of Children and Adolescents in 2022,” p. 64.\nECLAC, “Percentage of population between ages 15 and 19 that completed primary education, by sex and area,” n.d., https://statistics.cepal.org/portal/cepalstat/dashboard.html?theme=1&lang=es (accessed April 14, 2024).\nInter-American Development Bank (IDB), “Promoting School Permanence in El Salvador and Honduras: Guidelines for Policy Development” (“Promoviendo la permanencia escolar en El Salvador y Honduras: lineamientos para el desarrollo de políticas”), 2021, https://publications.iadb.org/es/promoviendo-la-permanencia-escolar-en-el-salvador-y-honduras-lineamientos-para-el-desarrollo-de (accessed April 14, 2024), p. 11.\nIbid.\nGrow up Together Law (“Ley Crecer Juntos”), Decree 431, signed into law on June 22, 2022, (accessed May 1, 2024), art. 87; ECLAC, “Years of education of the economically active population, by sex and area” (“Años de educación de la población económicamente activa, por sexo y área”), CEPALSTAT, https://statistics.cepal.org/portal/cepalstat/dashboard.html?theme=1&lang=es (accessed April 14, 2024); Central Bank of El Salvador, “Household and Multipurpose Survey,” p. 52; ECLAC, “Urban open unemployment rate, by sex and age groups” (“Tasa de desempleo abierto urbano, según sexo y grupos de edad”), CEPALSTAT, https://statistics.cepal.org/portal/cepalstat/dashboard.html?theme=1&lang=es (accessed April 14, 2024).\nCentral Bank of El Salvador, “Household and Multipurpose Results 2022,” p. 11.\nOrganization for Economic Co-operation and Development (OECD), “Education and skills formation for development in El Salvador”, 2023, https://www.oecd-ilibrary.org/docserver/03577bb5-en.pdf?expires=1720364504&id=id&accname=guest&checksum=0E2F878263E7F81EC867182586D40DC8 (accessed April 14, 2024), p. 379.\nUNESCO, “Education 2030: Incheon Declaration and Framework for Action for the implementation of Sustainable Development Goal 4,” 2015, (accessed May 1, 2024), p. 67.\nUNESCO Institute for Statistics, “SDG 4 Data: El Salvador,” http://sdg4-data.uis.unesco.org/ (accessed May 1, 2024).\nECLAC, “Public expenditure on education as a percentage of total government expenditure,” CEPALSTAT, https://statistics.cepal.org/portal/cepalstat/dashboard.html?theme=1&lang=es (accessed May 1, 2024).\nCentral Bank of El Salvador, “Household and Multipurpose Survey 2022 Results,” p. 54.\nIbid.\nIbid.\nCentral Bank, “Household and Multipurpose Survey Results,” p. 56; ECLAC, “Urban open unemployment rate, by sex and age groups” (“Tasa de desempleo abierto urbano, según sexo y grupos de edad”), CEPALSTAT, https://statistics.cepal.org/portal/cepalstat/dashboard.html?theme=1&lang=es (accessed April 14, 2024).\nCentral Bank, “Household and Multipurpose Survey Results,” p. 56.\nGovernment of El Salvador et al., “Violence Against Children and Youth Survey in El Salvador” (“Encuesta de Violencia contra Niños, Niñas y Adolescentes en El Salvador”), 2017, https://files.mutualcdn.com/tfg/assets/files/El-Salvador-VACS-Report-2019.pdf (accessed April 14, 2024), p. 3.\nCristosal, Generation Without Return: Report on Childhood and Youth 2016-2018, pp. 19 and 20.\nGovernment of El Salvador et al., “Violence Against Children and Youth Survey in El Salvador,” p. 3.\nIbid. See also International Labour Organization (ILO), “New Forms of Child Labour” (“Nuevas formas de trabajo infantil”), 2018, https://www.ilo.org/wcmsp5/groups/public/---americas/---ro-lima/---sro-san_jose/documents/publication/wcms_669938.pdf (accessed April 14, 2024), p. 25.\nUNICEF, Hidden in Plain Sight: A statistical analysis of violence against children, September 2014, https://www.unicef.org/media/66916/file/Hidden-in-plain-sight.pdf (accessed April 14, 2024), p. 37; Pan American Health Organization (PAHO), “Homicide mortality,” n.d., https://www.paho.org/en/enlace/homicide-mortality#top2 (accessed July 4, 2024).\nIbid.\nUNICEF, Informe de Situación de la Niñez y Adolescencia en El Salvador, November 2014, https://siteal.iiep.unesco.org/sites/default/files/sit_investigacion_pdf/1840.pdf (accessed April 14, 2024), p. 20.\nIbid.\nNational Council for Children and Adolescents (Consejo Nacional de la Niñez y de la Adolescencia, CONNA), “Compendium of Data Related to the Rights of Girls, Boys and Adolescents in El Salvador” (“Compendio de datos relacionados a los derechos de niñas, niños y adolescentes en El Salvador”), March 22, 2022, p. 3; Ministry of Justice and Public Safety, “Classified Information 2022” (“Índice de información reservada 2022”), July 27, 2022, https://www.transparencia.gob.sv/institutions/mjsp/documents/498411/download (accessed July 5, 2024).\nFor instance, in 2015, the Institute of Legal Medicine documented 781 homicides of children under 17, while the National Council for Children and Adolescents (CONNA) recorded 731 cases for the same age group. See “Institute of Legal Medicine” (Instituto de Medicina Legal, IML), “Examinations carried out by forensic doctors of the Institute of Legal Medicine, performed on persons deceased in acts of violence (homicides), occurring in El Salvador in the year 2015” (“Reconocimientos realizados por médicos forenses del Instituto de Medicina Legal, practicados a personas fallecidas en hechos de violencia (homicidios), ocurridos en El Salvador en el año 2015”), April 26, 2016, https://transparencia.oj.gob.sv/es/documentos/248 (accessed April 26, 2024); CONNA, “Report of Activities 2015-2016” (“Memoria de Labores 2015-2016”), n.d., https://www.transparencia.gob.sv/institutions/conna/documents/141834/download (accessed April 26, 2024), p. 17.\nAntonio Sanahueza et al.,“Homicide among young people in the countries of the Americas,” Rev Panam Salud Publica, vol. 47 (2023), https://www.ncbi.nlm.nih.gov/pmc/articles/PMC10361419/#:~:text=In%20the%20Americas%2C%20the%20age,adolescents%20and%20young%20adults%2C%20respectively (accessed May 10, 2024).\n“Disappearance” used in this sense is distinct from an “enforced disappearance,” which requires the involvement of state agents, either directly or indirectly through authorization, support, or acquiescence. See, for example, Human Rights Watch, Mexico’s Disappeared: The Enduring Cost of a Crisis Ignored (New York: Human Rights Watch, 2013), p. 14, https://www.hrw.org/report/2013/02/20/mexicos-disappeared/enduring-cost-crisis-ignored; FESPAD, “Disappearances in El Salvador” (“Desaparición de personas en El Salvador”), April 2021, https://drive.google.com/file/d/1U6d8M8h0RgZmZ0jx4gdhnAeu-pn_o3CN/view (accessed April 15, 2024), p. 56.\nCarlos Carcach and Evelyn Artola, “Disappeared persons and homicide in El Salvador,” Crime Science Journal, vol. 5 (2016) https://crimesciencejournal.biomedcentral.com/articles/10.1186/s40163-016-0061-x (accessed July 3, 2024).\nMinistry of Justice and Public Security (Ministerio de Justicia y Seguridad Pública), “Report on the State and Situation of Violence against Women - El Salvador 2022” (“Informe de Hechos: Estado y Situación de la Violencia contra las Mujeres - El Salvador 2022”), April 2023, https://www.seguridad.gob.sv/dia/download/informe-de-hechos-estado-y-situacion-de-la-violencia-contra-las-mujeres-el-salvador-2022/ (accessed April 14, 2024), p. 47.\nIbid., p. 46.\nUnited Nations Population Fund (UNFPA), “Ensuring zero pregnancies of girls and adolescents: El Salvador Map 2023” (“Llegar a cero embarazos de niñas y adolescentes: Mapa El Salvador 2023”), July 2023, https://elsalvador.unfpa.org/sites/default/files/pub-pdf/mapa_embarazos_2023_web.pdf (accessed May 1, 2024), p. 8.\nIbid., p. 73.\nIbid.\nIbid., pp. 18.\nCriminal Code (Código Penal), Decree 1030, signed into law on April 26, 1997, https://www.asamblea.gob.sv/sites/default/files/documents/decretos/F5A086EB-9DB7-4CA8-818E-D67F29AF54EC.pdf (accessed June 4, 2023), art. 159.\nCriminal Code, Decree 1030, art. 133.\nUnited Nations in El Salvador, “An Initiative to Reach Zero Pregnancies in Girls and Adolescents in El Salvador” (“Una iniciativa para llegar a cero embarazos en niñas y adolescentes en El Salvador”), July 20, 2023, https://elsalvador.un.org/es/240003-una-iniciativa-para-llegar-cero-embarazos-en-ni%C3%B1as-y-adolescentes-en-el-salvador#:~:text=El%20pa%C3%ADs%20va%20en%20la,diarios%20en%20ni%C3%B1as%20y%20adolescentes (accessed April 14, 2024).\nUNFPA, “Ensure zero pregnancies of girls and adolescents: El Salvador Map 2023” (“Llegar a cero embarazos de niñas y adolescentes: Mapa El Salvador 2023”), p. 39.\nIACHR, Organized Crime and the Rights of Children, Adolescents and Young People: Current Challenges and State Action, p. 51.\nThis study is based on a non-probability purposive sample of 1,196 people and its results are not representative of all gang members in the country. José Miguel Cruz et al., “The New Face of Street Gangs: The Gang Phenomenon in El Salvador,” Florida International University, https://lacc.fiu.edu/research/the-new-faces-of-street-gangs-in-central-america/the-new-face-of-street-gangs-the-gang-phenomenon-in-el-salvador-eng.pdf (accessed May 10, 2024), p. 18.\nIbid., p. 17.\nWalter Murcia, El Salvador’s Gangs: Proposals and challenges to socially include youth in contexts of urban violence, p. 15.\nAugusto López Ramírez, “Gangs in Public Schools in EL Salvador” (“Pandillas en escuelas públicas de El Salvador”), Revista Policía y Seguridad Pública, vol. 5(1):2225-5648, https://biblat.unam.mx/hevila/Revistapoliciayseguridadpublica/2015/vol1/6.pdf (accessed July 3, 2024), p. 266.\nILO, “New Forms of Child Labour” (“Nuevas formas de trabajo infantil”), p. 42.\nIbid., p. 43.\nIbid.\nIbid., p. 44.\nIACHR, Organized Crime and the Rights of Children, Adolescents and Young People: Current Challenges and State Action, p. 62.\nIbid., p. 61.\nIbid., p. 129.\nIbid.\nIACHR, Organized Crime and the Rights of Children, Adolescents and Young People: Current Challenges and State Action, p. 127.\nSonja Wolf, Mano Dura: The Politics of Gang Violence in El Salvador, p. 51.\nIbid. See also FESPAD, “Public Safety Plans Fail” (“Planes de Seguridad Fracasan”), February 18, 2010, https://www.fespad.org.sv/planes-de-seguridad-fracasan/ (accessed June 28, 2024).\nFESPAD, Annual Report on Juvenile Criminal Justice 2004 (Informe Anual Sobre Justicia Penal Juvenil 2004), January 31, 2005, https://www.fespad.org.sv/informe-anual-sobre-justicia-penal-juvenil-el-salvador-2004/ (accessed May 9, 2024), p. 28.\nIbid.\nWolf, Mano Dura: The Politics of Gang Control in El Salvador, p. 51.\nIACHR, Organized Crime and the Rights of Children, Adolescents and Young People: Current Challenges and State Action, p. 32.\nBenjamin Lessing, “Counterproductive Punishment: How Prison Gangs Undermine State Authority,” Rationality and Society, vol. 29 (2016), no. 3: 257–97.\nJosé Miguel Cruz, “The Politics of Negotiating with Gangs: The Case of El Salvador,” Society for Latin American Studies, vol. 38 (2019), p. 7.\nOscar Martínez et al., “Government Negotiates Reduction in Homicides with Gangs,” El Faro, March 14, 2012, https://www.elfaro.net/es/201203/noticias/8061/ (accessed May 10, 2024); Wolf, Mano Dura: The Politics of Gang Control in El Salvador, p. 232.\nUnited Nations Office on Drugs and Crime (UNODC), “Homicide Country Data,” n.d., https://dataunodc.un.org/content/data/homicide/homicide-rate (accessed April 18, 2024).\nJosé Miguel Cruz, “The Politics of Negotiating with Gangs: The Case of El Salvador,” p. 7; International Crisis Group, El Salvador’s Politics of Perpetual Violence, p. 10.\nUNODC, “Homicide Country Data,” n.d., https://dataunodc.un.org/content/data/homicide/homicide-rate (accessed April 18, 2024).\nIbid.\nManuel Meléndez-Sánchez, “What’s Behind the Spike of Violence in El Salvador?” Lawfare, April 11, 2022, https://www.lawfareblog.com/whats-behind-spike-violence-el-salvador (accessed April 28, 2024).\nIbid.\nSpecial Law against Acts of Terrorism (Ley Especial contra Actos de Terrorismo), Decree 108, signed into law on September 21, 2006, https://www.acnur.org/fileadmin/Documentos/BDL/2016/10430.pdf (accessed April 14, 2024), art. 4 (m); “El Salvador: Terrorism Law Misused Against Protesters,” Human Rights Watch news release, July 30, 2007, https://www.hrw.org/news/2007/07/30/el-salvador-terrorism-law-misused-against-protesters.\nSpecial Law against Acts of Terrorism, Decree 108, art. 1\nIbid.\nLaw Banning Gangs, Bands, Groups, Associations and Organizations of a Criminal Nature (Ley de Proscripción de Maras, Pandillas, Agrupaciones, Asociaciones y Organizaciones de Naturaleza Criminal), Decree 458, signed into law on September 10, 2010, https://www.refworld.org/docid/56a24bd44.html (accessed May 10, 2024), art. 1.\nConstitutional Chamber of the Supreme Court, resolution 22-2007AC, August 24, 2015, https://www.jurisprudencia.gob.sv/DocumentosBoveda/D/1/2010-2019/2015/08/B254E.PDF (accessed August 26, 2022).\nAmendments to the Criminal Code (Reformas al Código Penal), Decree 337, signed into law on March 30, 2022, https://www.diariooficial.gob.sv/seleccion/30735 (accessed July 5, 2024), art. 2.\nWashington Office on Latin America (WOLA), “Youth Gangs in Central America: Issues in Human Rights, Effective Policing, and Prevention,” November 2006, https://www.wola.org/sites/default/files/downloadable/Citizen%20Security/past/GangsReport_Final.pdf (accessed April 14, 2024).\nWOLA, “Youth Gangs in Central America: Issues in Human Rights, Effective Policing, and Prevention,” p. 10.\nHuman Rights Ombudsperson’s Office, Special Report by the Human Rights Ombudswoman Raquel Caballero de Guevara, on Extralegal Executions Attributed to the National Civil Police, in El Salvador, 2014-2018 (“Informe especial de la señora Procuradora para la Defensa de los Derechos Humanos, licenciada Raquel Caballero de Guevara, sobre las Ejecuciones Extralegales atribuidas a la Policía Nacional Civil, en El Salvador, período 2014-2018”), August 2019, https://elfaro.net/attachment/1076/Informe%20especial%20sobre%20ejecuciones%20extralegales.%20PDDH.pdf?g_download=1 (accessed July 1, 2024), p. 22.\nIbid., p. 87.\nUN Special Rapporteur for Extrajudicial, Summary or Arbitrary Executions, “El Salvador End of Mission Statement,” February 5, 2018, https://www.ohchr.org/en/statements/2018/02/el-salvador-end-mission-statement (accessed July 1, 2024).\nUN Special Rapporteur for Extrajudicial, Summary or Arbitrary Executions, “Report of the Special Rapporteur on extrajudicial, summary or arbitrary executions on her mission to El Salvador,” UN Doc. A/HRC/38/44 (2018), https://www.ohchr.org/en/documents/country-reports/ahrc3844add2-report-special-rapporteur-extrajudicial-summary-or-arbitrary (accessed July 1, 2024).\nIACHR, “Report of the state of El Salvador to the Inter-American Commission on Human Rights on the status of compliance with the recommendations contained in the report “Situation of Human Rights in El Salvador” approved after the in loco visit conducted in 2019 (“Informe del estado de El Salvador a la Comisión Interamericana de Derechos Humanos sobre el estado de cumplimiento de las recomendaciones contenidas en el informe “Situación de los derechos humanos en el salvador” aprobado tras visita in loco realizada en 2019”), July 2022, https://www.oas.org/es/CIDH/docs/anual/2022/notas/SLV_nota_1.pdf (accessed July 1, 2024), p. 6.\nIbid.\nSonja Wolf, Mano Dura: The Politics of Gang Violence in El Salvador, p. 72.\nIACHR, Situation of Human Rights in El Salvador, p. 18.\nIbid.\nWolf, Mano Dura: The Politics of Gang Violence in El Salvador, p. 51.\n“El Salvador: Legislature Deepens Democratic Backsliding” Human Rights Watch news release, November 1, 2021, https://www.hrw.org/news/2021/11/01/el-salvador-legislature-deepens-democratic-backsliding; Manuel Meléndez Sánchez and Alberto Vergara, “The Bukele Model: Will It Spread?,” Journal of Democracy, vol. 35 no. 3, 2024, pp. 84-98, https://muse.jhu.edu/pub/1/article/930429 (accessed July 5, 2024).\nUNICEF, “Analysis of the situation of childhood in El Salvador” (“Análisis de Situación de la Infancia El Salvador”), 2014, https://www.unicef.org/elsalvador/sites/unicef.org.elsalvador/files/2018-12/Analisis_de_Situacion_de_la_Infancia_El_Salvador_UNICEF_2014.pdf (accessed April 14, 2024), p. 114; Cristosal, “Generation Without Return: Report on Childhood and Youth 2016-2018,” p. 105.\nIACHR, Organized Crime and the Rights of Children, Adolescents and Young People: Current Challenges and State Action, pp. 81, 82.\nIbid., p. 69.\nIbid.\nIbid., p. 117.\nConvention on the Rights of the Child, arts. 3, 37 and 40.\nConvention on the Rights of the Child, art. 40; Committee on the Rights of the Child, General Comment No. 24 (2019) on children’s rights in the child justice system, UN Doc. CRC/C/GC/24 (2019), art. 95 (g)-(h).\nCommittee on the Rights of the Child, General Comment No. 24, para. 76.\nConstitution of the Republic of El Salvador, Title II, Chapter II, Section One, art. 34.\nIbid., arts. 34 and 35.\nAmendments to the Criminal Code (Reformas al Código Penal), Decree 349, signed into law on April 5, 2022, https://www.diariooficial.gob.sv/seleccion/30739 (accessed July 5, 2024), art. 153(a).\nLaw Against Human Trafficking of El Salvador (Ley especial contra la trata de personas), Decree 824, signed into law November 14, 2014, arts. 3 and 54.\nGrow up Together Law (“Ley Crecer Juntos”), Decree 431, art. 86(h).\nIbid.\nSalvadoran law, like other legal systems in the Americas, makes a distinction between “children” (“niños y niñas”) and “adolescents” (“adolescentes”), specifying different age ranges for each category. However, for clarity, we will generally use the term “children” to refer to all individuals under 18 years old, except when directly quoting legal provisions or discussing specific domestic legal definitions that differentiate between “children” and “adolescents.”\nGrow up Together Law (“Ley Crecer Juntos”), Decree 431, art. 152.\nConstitution of the Republic of El Salvador, art. 12; Grow up Together Law (“Ley Crecer Juntos”), Decree 431, art. 67.\nGrow up Together Law (“Ley Crecer Juntos”), Decree 431, art. 67.\nSee UN Standard Minimum Rules for the Administration of Juvenile Justice, G.A. Res. 40/33 (1985), comment to art. 19.\nSee UN Rules for the Protection of Juveniles Deprived of Their Liberty, UN Doc. A/RES/45/133, December 14, 1990, arts. 59-62.\nIbid., art. 32.\nIbid., arts. 38, 45, 47, 49, 59.\nIbid., art. 67.\nIbid., art. 68.\nIbid., art. 70. See also Convention on the Rights of the Child, art. 12(2).\nSee UN Committee on the Rights of the Child, General Comment No. 24, art. 95 (g)-(h).\nJuvenile Criminal Law (Ley Penal Juvenil), Decree 863, signed into law on June 8, 1994, https://www.asamblea.gob.sv/sites/default/files/documents/decretos/8149596E-872F-4E5E-983C-5EF36B5F4080.pdf (accessed May 1, 2024), arts. 53, 80 and 81.\nJuvenile Criminal Law, Decree 863, art. 53.\nIbid., art. 17.\nIbid., art. 53.\nIbid., art. 17.\nAmendments to the Juvenile Criminal Law, Decree 342, signed into law on March 30, 2022, https://www.asamblea.gob.sv/sites/default/files/documents/decretos/F206BC53-441C-4D71-93FF-FCEF3C15FC89.pdf (accessed May 1, 2024), art. 8.\nIbid., art. 5.\nJuvenile Criminal Law, Decree 863, art. 53.\nIbid., art. 119.\nIbid.\nLaw on Monitoring and Control of Juvenile Offenders (Ley de Vigilancia y Control de Ejecución de Medidas al Menor Sometido a la Ley Penal Juvenil), Decree 361, signed into law on June 7, 1995, https://www.oas.org/dil/esp/Ley_de_vigilancia_y_control_de_ejecucion_de_medidas_al_menor_sometido_a_la_ley_penal_juvenil_El_Salvador.pdf (accessed May 1, 2024).\nIbid., art. 3.\nAmendments to the Juvenile Criminal Law (Reformas a la Ley Penal Juvenil), Decree 309, signed into law on April 9, 2010, https://www.asamblea.gob.sv/sites/default/files/documents/decretos/171117_073111539_archivo_documento_legislativo.pdf (accessed May 1, 2024).\nLaw Banning Gangs, Bands, Groups, Associations and Organizations of a Criminal Nature, Decree 458.\nNational Council for Early Childhood, Childhood and Adolescence (Consejo Nacional de la Primera Infancia, Niñez y Adolescencia, CONAPINA), “Programs Unit” (Unidad de Programas), https://www.conapina.gob.sv/contactenos/unidadprogramas/ (accessed February 29, 2024).\nHuman Rights Watch phone interview with a former government official, March 1, 2024.\nHuman Rights Watch phone interview with a former government official, March 3, 2024, and with another former government official, April 18, 2024.\nHuman Rights Watch phone interview with a former government official, March 3, 2024, and with another former government official, April 18, 2024. Human Rights Watch sent an official information request to CONAPINA on April 5, 2024, requesting information on security, administrative and technical staff at confinement centers. On May 3, 2024, authorities replied that such information was “confidential” (on file with Human Rights Watch).\nIbid. Human Rights Watch sent an official information request to CONAPINA on April 5, 2024, requesting information on security, administrative and technical staff at confinement centers. On May 3, 2024, authorities replied that such information was “confidential” (on file with Human Rights Watch).\nElías Carranza, “Penitentiary situation in Latin America and the Caribbean, What to Do? (“Situación penitenciaria en América Latina y el Caribe ¿Qué hacer?”), Anuario De Derechos Humanos, vol. 8 (2012), https://anuariocdh.uchile.cl/index.php/ADH/article/download/20551/21723/0 (accessed May 9, 2024), p. 48.\nOffice of the High Commissioner For Human Rights (OHCHR), “El Salvador: Dismissal of Constitutional Chamber and Attorney General seriously undermines the rule of law,” May 2, 2021, https://www.ohchr.org/en/2021/05/el-salvador-dismissal-constitutional-chamber-and-attorney-general-seriously-undermines-rule?LangID=E&NewsID=27053 (accessed July 1, 2024); Jimmy Alvarado, “Bukele’s Legislative Assembly Ousts Supreme Court Magistrates and Attorney General,” El Faro, May 2, 2021, https://elfaro.net/en/202105/el_salvador/25452/New-Legislative-Assembly-Ousts-Supreme-Court-Magistrates-and-Attorney-General.htm (accessed July 2, 2024). See also, José Miguel Vivanco and Juan Pappier (Human Rights Watch), “The U.S. can stop El Salvador’s slide to authoritarianism. Time to act,” Washington Post, May 18, 2021, https://www.washingtonpost.com/opinions/2021/05/18/bukele-el-salvador-biden-human-rights-watch-authoritarianism/ (accessed July 5, 2024); “El Salvador: New Laws Threaten Judicial Independence,” Human Rights Watch news release, September 2, 2021, https://www.hrw.org/news/2021/09/02/el-salvador-new-laws-threaten-judicial-independence; IACHR, “IACHR and UN expert reject legislative reforms that remove judges and prosecutors in El Salvador and calls for respect of guarantees for judicial Independence,” September 7, 2021, https://www.oas.org/es/cidh/jsForm/?File=/es/cidh/prensa/comunicados/2021/234.asp (accessed July 2, 2024).\nConstitutional Chamber of the Supreme Court, ruling 1-2021, September 3, 2021, https://www.jurisprudencia.gob.sv/portal/apls/2021/09/1-2021PerdidaDerechosCiudadania.pdf (accessed July 1, 2024).\nSee, for example, Message posted on X by @nayibbukele, May 3, 2020, https://twitter.com/nayibbukele/status/1257094989391245320?s=20&t=umKkpd1TgR53FKZsunZEhw (accessed July 2, 2024); Message posted on X by @jorgecastro_sv, November 18, 2022, https://twitter.com/jorgecastro_sv/status/1593593520388018177?s=46&t=WAEVzvi_iFXuTpKBHhfxLA (accessed July 2, 2024).\n“El Salvador: Broad State of Emergency Risks Abuse,” Human Rights Watch news release, March 29, 2022; State of Emergency (Régimen de excepción), Decree 333, signed into law on March 27, 2022, https://www.diariooficial.gob.sv/seleccion/30732 (accessed July 2, 2024).\nPermanent Mission of El Salvador to the United Nations, “Report by the State of El Salvador in Response to the Joint Communication of Special Procedures regarding Allegations or Risks of Human Rights Violations in the Context of the State of Emergency and Reforms to the Criminal Legislation” (“Informe del Estado de El Salvador a la comunicación conjunta de los procedimientos especiales sobre alegaciones de presuntas violaciones de derechos humanos o el posible riesgo de ellas en el marco del régimen de excepción y reformas a la legislación penal”), July 29, 2022, https://spcommreports.ohchr.org/TMResultsBase/DownLoadFile?gId=37045 (accessed July 2, 2024), p. 3.\nCarlos Martínez, “Collapsed Government Talks with MS-13 Sparked Record Homicides in El Salvador, Audios Reveal,” El Faro, May 17, 2022, https://elfaro.net/en/202205/el_salvador/26177/Collapsed-Government-Talks-with-MS-13-Sparked-Record-Homicides-in-El-Salvador-Audios-Reveal.htm (accessed July 2, 2024).\nConstitution of the Republic of El Salvador, art. 29.\nLegislative Assembly, “The Assembly Backs the Government in the fight against Gangs by Extending the State of Emergency” (“Asamblea respalda al gobierno en el combate a las maras al extender el régimen de excepción”), October 15, 2022, https://www.asamblea.gob.sv/node/12408 (accessed July 2, 2024).\nState of Emergency, Decree 476, signed into law on August 17, 2022, https://www.diariooficial.gob.sv/seleccion/30822 (accessed July 2, 2014); State of Emergency, Decree 503, signed into law on September 14, 2022, https://www.diariooficial.gob.sv/seleccion/30842 (accessed November 15, 2022); State of Emergency, Decree 530, signed into law on October 14, 2022, https://www.diariooficial.gob.sv/seleccion/30864 (accessed July 2, 2024).\nInternational Covenant on Civil and Political Rights (ICCPR), adopted December 16, 1966, G.A. Res. 2200A (XXI), 21 UN GAOR Supp. (No. 16) at 52, UN Doc. A/6316 (1966), 999 UNT.S. 171, entered into force March 23, 1976, ratified by El Salvador on November 30, 1979, art. 4.\nIbid.\nUN Human Rights Committee, General Comment No. 29: Article 4: Derogations during a State of Emergency, UN Doc. CCPR/C/21/Rev.1/Add.11 (2001), para. 11.\nAmerican Convention on Human Rights (“Pact of San José, Costa Rica”), adopted November 22, 1969, O.A.S. Treaty Series No. 36, 1144 UNT.S. 123, entered into force July 18, 1978, reprinted in Basic Documents Pertaining to Human Rights in the Inter-American System, OEA/Ser.L.V/II.82 doc.6 rev.1 at 25 (1992). El Salvador ratified the American Convention on Human Rights on July 18, 1978.\nSee, for example, Human Rights Watch and Cristosal, We Can Arrest Anyone We Want: Widespread Human Rights Violations Under El Salvador’s “State of Emergency”; “El Salvador: Sweeping New Laws Endanger Rights,” Human Rights Watch news release, April 8, 2022.\nAmendments to the Juvenile Criminal Law, Decree 342, art. 2.\nIbid.\nUN Committee on the Rights of the Child, General Comment No. 24, para. 22.\nUN Convention on the Rights of the Child, art. 37(b).\nAmendments to the Juvenile Criminal Law, Decree 342, art. 3.\nIbid., art. 54. See, for example, International Covenant on Civil and Political Rights (ICCPR), arts. 9(3), 14(2); UN Committee on the Rights of the Child, General Comment No. 24, paras. 85-89; UN Human Rights Committee, General Comment No. 35: Article 9 (Liberty and security of person), UN Doc. CCPR/C/GC/35 (2014), paras. 38. Prolonged pretrial detention may also jeopardize the presumption of innocence. UN Human Rights Committee, General Comment No. 35, para. 37.\nAmendments to the Code of Criminal Procedure, Decree 339, signed into law March 30, 2022, https://www.asamblea.gob.sv/sites/default/files/documents/decretos/DEFEE597-6A3F-4B36-A16E-897F128BC1D6.pdf (accessed July 6, 2024), art. 1.\nICCPR, art. 9(3); UN Human Rights Committee, General Comment No. 35, para. 37.\nIbid.\nAmendments to the Code of Criminal Procedure, Decree 339, art. 5.\nSee, for example, UN Human Rights Committee, General Comment No. 35, para. 38.\nAmendments to the Criminal Code, Decree 349, art. 1. See also Amendments to the Law Banning Gangs, Bands, Groups, Associations and Organizations of a Criminal Nature (Reformas a la Ley de Proscripción de Maras, Pandillas, Agrupaciones, Asociaciones y Organizaciones de Naturaleza Criminal), Decree 350, signed into law on April 5, 2022, https://www.diariooficial.gob.sv/seleccion/30739 (accessed July 4, 2024).\nAmendments to the Criminal Code, Decree 349, art. 1.\nSee, for example, UN Human Rights Committee, General Comment No. 34, Article 19: Freedoms of opinion and expression, UN Doc. CCPR/C/GC/34 (2011).\nAmendments to the Criminal Code, Decree 880, signed into law December 1, 2023, https://www.asamblea.gob.sv/sites/default/files/documents/decretos/0F6413E6-7275-470C-8FCD-730A854D3D16.pdf (accessed July 4, 2024), art. 1.\nIbid.\nAmendments to the Law Against Organized Crime, Decree 547, November 29, 2022, https://www.asamblea.gob.sv/sites/default/files/documents/decretos/0DBB218F-96FA-40CB-A5BC-C12E9F09CFFF.pdf (accessed July 5, 2024), art. 1.\nIbid., art. 3.\nUnited States Department of State, 2024 Trafficking in Persons Report, “El Salvador,” June 25, 2024, https://www.state.gov/reports/2024-trafficking-in-persons-report/el-salvador/ (accessed July 3, 2024); State of Emergency, Decree 27, signed into law June 7, 2024, https://www.asamblea.gob.sv/sites/default/files/documents/decretos/787B313E-3D48-4B3B-B76F-876651A5FD53.pdf (accessed July 5, 2024).\nClaudia Espinoza, “Minister confirms 7,000 people have been released during the state of emergency” (“Ministro confirma que han liberado a unas 7,000 personas en el régimen”), La Prensa Gráfica, August 23, 2023, https://www.laprensagrafica.com/elsalvador/Ministro-confirma-que-han-liberado-a-unas-7000-personas--en-el-regimen-20230822-0083.html (accessed July 5, 2024).\nSee, e.g, Human Rights Watch and Cristosal, We Can Arrest Anyone We Want: Widespread Human Rights Violations Under El Salvador’s “State of Emergency”.\n“Organizations register 6,305 complaints of human rights violations in two years of the state of emergency regime” (“Organizaciones registran 6,305 denuncias de violaciones a derechos humanos en dos años del régimen de excepción”), Cristosal news release, San Salvador, April 4, 2024, https://cristosal.org/ES/organizaciones-registran-6305-denuncias-de-violaciones-a-derechos-humanos-en-dos-anos-del-regimen-de-excepcion/ (accessed May 1, 2024).\nHuman Rights Watch and Cristosal, We Can Arrest Anyone We Want: Widespread Human Rights Violations Under El Salvador’s “State of Emergency” .\nInformation provided to Human Rights Watch by the National Council of Early Childhood, Children and Adolescents via email, on May 3, 2024 (on file with Human Rights Watch).\nNational Civil Police, “2023 Was the Safest Year in El Salvador’s History” (“El 2023 fue el año más seguro en la historia del El Salvador”), January 1, 2024, https://www.pnc.gob.sv/el-2023-fue-el-ano-mas-seguro-en-la-historia-del-el-salvador/ (accessed April 26, 2024).\nUNODC, “Homicide Country Data,” n.d., https://dataunodc.un.org/content/data/homicide/homicide-rate (accessed April 26, 2024).\nLeonardo Cerón, “Conapina closed website with statistics on violations against children” (“Conapina cerró sitio web de estadísticas sobre vulneraciones a menores de edad”), Diario El Mundo, May 7, 2024, https://diario.elmundo.sv/nacionales/conapina-cerro-sitio-web-de-estadisticas-sobre-vulneraciones-a-menores-de-edad (accessed May 7, 2024).\n“Bukele’s Regime Dismantles Gangs in El Salvador” (“Régimen de Bukele desarticula a las pandillas en El Salvador”), El Faro, February 12, 2023, https://elfaro.net/es/202302/el_salvador/26691/R%C3%A9gimen-de-Bukele-desarticula-a-las-pandillas-en-El-Salvador.htm (accessed April 26, 2024).\nIbid.\nHuman Rights phone interview with a victim’s relative, November 1, 2023.\nHuman Rights Watch in-person interview with a victim’s relative, San Salvador, September 20, 2023.\nSalvadoran Institute for the Comprehensive Development of Children and Adolescents (Instituto Salvadoreño para el Desarrollo Integral de la Niñez y la Adolescencia, ISNA), “Population in Juvenile Detention Facilities between 2018 and 2021” (“Población en CIS 2018 al 2021”), https://www.transparencia.gob.sv/institutions/isna/documents/491687/download (accessed April 14, 2024); ISNA, “Population in Juvenile Detention Facilities between 2009 and 2018” (“Población en CIS 2009 al 2018”), https://www.transparencia.gob.sv/institutions/isna/documents/299232/download (accessed April 14, 2024).\nUnited States Department of State, 2024 Trafficking in Persons Report, “El Salvador”.\nInformation provided to Human Rights Watch by the Public Defender’s Office via email, on April 29, 2024 (on file with Human Rights Watch).\nMessage posted on X by @LPGJudicial, https://x.com/LPGJudicial/status/1760752752789983539?s=20 (accessed March 7, 2024).\nSupreme Court, “Movement Occurred in Courts with Jurisdiction over Juvenile Criminal Matters, January to December 2022” (“Movimiento Ocurrido en las Instancias con Competencia en Materia Penal Menores, Enero a Diciembre 2022”), https://transparencia.oj.gob.sv/descargar/3/20944/Movimiento%20Ocurrido%20en%20Instancias%20con%20Competencia%20en%20Materia%20Penal%20Menores%20-%20A%C3%B1o%202022/24-02-2023 (accessed May 14, 2024); Supreme Court, “Movement Occurred in Courts with Jurisdiction over Juvenile Criminal Matters, January to December 2021” (“Movimiento Ocurrido en las Instancias con Competencia en Materia Penal Menores, Enero a Diciembre 2021”), https://transparencia.oj.gob.sv/descargar/3/19718/Movimiento%20Ocurrido%20en%20Instancias%20con%20Competencia%20en%20Materia%20Penal%20Menores%20-%20A%C3%B1o%202021/07-03-2022 (accessed May 14, 2024); Supreme Court, “Movement Occurred in Courts with Jurisdiction over Juvenile Criminal Matters, January to December 2020” (“Movimiento Ocurrido en las Instancias con Competencia en Materia Penal Menores, Enero a Diciembre 2020”), https://transparencia.oj.gob.sv/descargar/3/17941/Movimiento%20Ocurrido%20en%20Instancias%20con%20Competencia%20en%20Materia%20Penal%20Menores%20-%20A%C3%B1o%202020/17-03-2021 (accessed May 14, 2024); Supreme Court, “Movement Occurred in Courts with Jurisdiction over Juvenile Criminal Matters, January to December 2019” (“Movimiento Ocurrido en las Instancias con Competencia en Materia Penal Menores, Enero a Diciembre 2019”), https://transparencia.oj.gob.sv/descargar/3/16157/Movimiento%20Ocurrido%20en%20Instancias%20con%20Competencia%20en%20Materia%20Penal%20Menores%20-%20A%C3%B1o%202019/20-05-2020 (accessed May 14, 2024); Supreme Court, “Movement Occurred in Courts with Jurisdiction over Juvenile Criminal Matters, January to December 2018” (“Movimiento Ocurrido en las Instancias con Competencia en Materia Penal Menores, Enero a Diciembre 2018”), https://transparencia.oj.gob.sv/descargar/3/13266/Movimiento%20Ocurrido%20en%20Instancias%20con%20Competencia%20en%20Materia%20Penal%20Menores%20-%20A%C3%B1o%202018/13-03-2019 (accessed May 14, 2024).\nIbid.\nIbid.\nUnless otherwise noted, this case is based on a Human Rights Watch phone interview with a victim’s relative, February 13, 2024.\nJuvenile Criminal Law, Decree 863, art. 118. The Convention on the Rights of the Child requires children deprived of their liberty to be separated from adults “unless it is in the child's best interest not to do so”; the ICCPR prohibition has no such exception. See Convention on the Rights of the Child, article 37(c); and the International Covenant on Civil and Political Rights (ICCPR), article 10(b).\nUnless otherwise noted, this case is based on a Human Rights Watch phone interview with the victim and a relative, November 9, 2023.\nJuvenile Criminal Law, Decree 863, art. 14.\nSentence enforcement court of Santa Ana, decision of December 2023 (on file with Human Rights Watch).\nConvention against Torture and Other Cruel, Inhuman or Degrading Treatment or Punishment, adopted December 10, 1984, G.A. res. 39/46, annex, 39 UN GAOR Supp. (No. 51) at 197, UN Doc. A/39/51 (1984), entered into force June 26, 1987, art. 1. The Convention defines torture as “any act by which severe pain or suffering, whether physical or mental, is intentionally inflicted on a person for such purposes as obtaining from him or a third person information or a confession, punishing him for an act he or a third person has committed or is suspected of having committed, or intimidating or coercing him or a third person, or for any reason based on discrimination of any kind, when such pain or suffering is inflicted by or at the instigation of or with the consent or acquiescence of a public official or other person acting in an official capacity.”\nSee below case of Antonio Juárez below. Human Rights Watch phone interview with a victim’s relative, October 31, 2023; and an in-person interview with the victim, Panchimalco, December 17, 2023.\nHuman Rights Watch phone interview with a victim, May 10, 2024.\nHuman Rights Watch in-person interview with the victim, San José Guayabal, September 22, 2023; Human Rights Watch in-person interview with the victim, Apopa, September 23, 2023.\nUnited Nations Standard Minimum Rules for the Treatment of Prisoners, rule 43 (e).\n“All disciplinary measures constituting cruel, inhuman or degrading treatment shall be strictly prohibited, including corporal punishment, placement in a dark cell, closed or solitary confinement or any other punishment that may compromise the physical or mental health of the juvenile concerned. Collective sanctions should be prohibited.” UN Rules for the Protection of Juveniles Deprived of Their Liberty, rule 67.\nUnited Nations Standard Minimum Rules for the Treatment of Prisoners, rules 43(3) and 47(1).\nUN Rules for the Protection of Juveniles Deprived of Their Liberty, rule 64.\nHuman Rights Watch phone interview with a juvenile judge, January 17, 2024; Human Rights Watch phone interview with a former government official, March 1, 2024; Human Rights Watch phone interview with a police officer, May 10, 2024; Human Rights Watch phone interview with a police officer, May 10,2024. See Convention on the Rights of the Child, art. 40(vii); UN Standard Minimum Rules for the Administration of Juvenile Justice, art. 21(1): Juvenile Criminal Law, Decree 863, art. 30.\nUnless otherwise noted, this case is based on a Human Rights Watch phone interview with a victim’s relative, October 31, 2023; and an in-person interview with the victim, Panchimalco, December 17, 2023.\nInvestigation court of San Salvador, decision of November 2023 (on file with Human Rights Watch).\nInvestigation court of San Salvador, decision of February 2023 (on file with Human Rights Watch).\nUnless otherwise noted, this case is based on a Human Rights Watch phone interview with a victim’s relative, November 30, 2023; and an in-person interview with the victim, Apopa, December 17, 2023. Human Rights Watch also reviewed a document indicating he was a student. Education, Science and Technology Ministry, “Grades” (Boleta de Calificaciones), 2023 (on file with Human Rights Watch).\nSpecial Court against Organized Crime of San Salvador, decision of November 2023 (on file with Human Rights Watch).\nUnless otherwise noted, this case is based on a Human Rights Watch phone interview with a victim’s relative, November 29, 2023; an in-person interview with the victim, Apopa, December 17, 2023; and a phone interview with the victim, February 9, 2024.\nUnless otherwise noted, this case is based on a Human Rights Watch in-person interview with a victim’s relative, San Salvador, September 18, 2023, and a phone interview on February 20, 2024.\n“School Enrolment Certificate,” 2022 (on file with Human Rights Watch).\nComplaint filed before the Human Rights Ombudsperson’s Office, 2024 (on file with Human Rights Watch).\nInvestigation court of Sensutepeque, decision of September 2023 (on file with Human Rights Watch).\nUnless otherwise noted, this case is based on a Human Rights Watch phone interview with a victim’s relative, December 20, 2023.\nUnless otherwise noted, this case is based on a Human Rights Watch phone interview with a victim’s relative, January 18, 2024; and a phone interview with the victim, February 20, 2024.\nUnless otherwise noted, this case is based on a Human Rights Watch phone interview with a victim’s relative, November 1, 2023; and an in-person interview with the victim in Sonsonate, December 16, 2023.\nSentence enforcement court of Santa Ana, decision of December 2023 (on file with Human Rights Watch).\nHuman Rights Watch in-person interview with a victim’s relative, San Salvador, December 19, 2023; Human Rights Watch in-person interview with a victim, San José Guayabal, September 22, 2023; Human Rights Watch phone interview with a victim’s relative, January 18, 2024; Human Rights Watch phone interview with a victim, February 20, 2024; Human Rights Watch phone interview with a victim’s relative, November 27, 2023.\nHuman Rights Watch phone interview with teacher, May 3, 2024; Human Rights Watch phone interview with a teacher, May 30, 2024.\nJorge Beltrán Luna, “Ministry of Education Orders Profiling of Students with Antisocial Behaviors” (“Educación ordena fichar a alumnos con conductas antisociales”), El Diario de Hoy, April 17, 2024, https://www.elsalvador.com/noticias/nacional/educacion-ordena-fichar-alumnos-conductas-antisociales/1136835/2024/ (accessed April 26, 2024).\nHuman Rights Watch phone interview with a victim’s relative, June 10, 2024; Human Rights Watch phone interview with a victim’s relative, June 10, 2024; Human Rights Watch phone interview with a victim’s relative, June 10, 2024.\nMessage posted on X by @PNCSV, May 28, 2024, https://x.com/PNCSV/status/1786215377963237720 (accessed May 7, 2024).\nMessage posted on X by @Vi11atoro, https://x.com/Vi11atoro/status/1788720348776567255 (accessed May 28, 2024); Message posted on X by @Vi11atoro, https://x.com/Vi11atoro/status/1759309255998427324 (accessed May 28, 2024); Message posted on X by @Vi11atoro, https://x.com/Vi11atoro/status/1793626194794934741 (accessed May 28, 2024).\nIbid.\nUnless otherwise noted, this case is based on a Human Rights Watch in-person interview with a victim’s relative, Apopa, September 23 and San Salvador, December 19, 2023; and an in-person interview with the victim, Apopa, September 22, 2023.\nUnless otherwise noted, this case is based on a Human Rights Watch phone interview with a victim’s relative, January 19, 2024.\nIbid.\nIbid.\nHuman Rights Watch in-person interview with a victim, San José Guayabal, September 22, 2023.\nUnless otherwise noted, this case is based on a Human Rights Watch in-person interview with a victim’s relative, San Salvador, December 19, 2023; and an in-person interview, San José Guayabal, September 22, 2023.\nUnless otherwise noted, this case is based on a Human Rights Watch in-person interview with a victim’s relative, San Salvador, December 20, 2023; and an in-person interview with the victim’s lawyer, San Salvador, December 19, 2023.\nInvestigation court of Santa Ana, decision of June 2022 (on file with Human Rights Watch).\nInvestigation court of Santa Ana, decision of June 2023 (on file with Human Rights Watch).\nJuvenile Criminal Law, Decree 863, art. 120; UN Standard Minimum Rules for the Administration of Juvenile Justice, comment to art. 121.\nIbid.\nHuman Rights Watch phone interview with a victim’s relative, November 15, 2023; and in-person interview with the victim in Sonsonate, December 16, 2023.\nSalvadoran Institute for the Comprehensive Development of Children and Adolescents (Instituto Salvadoreño para el Desarrollo Integral de la Niñez y la Adolescencia, ISNA), “Anexo OIR 2021-060”, https://www.transparencia.gob.sv/institutions/isna/documents/463613/download (accessed July 1, 2024).\nISNA, “Statistical Report Third Quarter. Period January to September 2022, Social Integration Programs” (“Prontuario Estadístico Tercer Trimestre. Periodo Enero a Septiembre 2022. Programas de Integración Social”.\nIbid.\nUnited States Department of State, 2024 Trafficking in Persons Report, “El Salvador”. As documented in this report, many of the children released remain under restrictions of liberty, such as court orders to check in periodically at police stations. Many have also suffered police harassment and rearrests after judges released them.\nInformation provided to Human Rights Watch by the National Council of Early Childhood, Children and Adolescents, Children and Adolescents via email, on May 3, 2024 (on file with Human Rights Watch).\nInformation provided to Human Rights Watch by the National Council of Early Childhood, Children and Adolescents, Children and Adolescents via email, on May 3, 2024 (on file with Human Rights Watch).\nInformation provided to Human Rights Watch by the National Council of Early Childhood, Children and Adolescents, Children and Adolescents via email, on May 3, 2024 (on file with Human Rights Watch). The government has publicly reported some infrastructure improvement projects for juvenile detention facilities. See Salvadoran Institute for the Comprehensive Development of Children and Adolescents (Instituto Salvadoreño para el Desarrollo Integral de la Niñez y la Adolescencia, ISNA), “Works in Execution” (“Obras en Ejecución”), 2021, https://www.transparencia.gob.sv/institutions/isna/executing_works/7181.pdf (accessed April 14, 2024); ISNA, “Works in Execution”(“Obras en Ejecución“), 2022, https://www.transparencia.gob.sv/institutions/isna/executing_works/7196.pdf (accessed April 14, 2024).\nSee 2022 General Budget Law (Ley de Presupuesto general para el ejercicio financiero del año 2022), Decree 246, signed into law on December 27, 2021, https://www.diariooficial.gob.sv/seleccion/30670 (accessed May 14, 2024), p. 113; 2023 General Budget Law (“Ley de Presupuesto general para el ejercicio financiero del año 2023”), Decree 245, signed into law on December 27, 2022, https://www.diariooficial.gob.sv/seleccion/30670 (accessed May 14, 2024), p. 119; 2024 General Budget Law (Ley de Presupuesto general para el ejercicio financiero del año 2024), Decree 242, signed into law on December 27, 2023, https://www.diariooficial.gob.sv/seleccion/31175(accessed May 14, 2024), p. 113.\nIbid.\nJuvenile Criminal Law, Decree 863, art. 120; UN Standard Minimum Rules for the Administration of Juvenile Justice, comment to art. 60.\nSee Juvenile Criminal Law, Decree 863, art. 121.\nUnited Nations Rules for the Protection of Juveniles Deprived of their Liberty, art. 60.\nHuman Rights Watch in-person interviews with a doctor, San Salvador, September 19, 2023, and December 20, 2023.\nIbid.\nUN Standard Minimum Rules for the Treatment of Prisoners, rule 11 (b).\nMessage posted on X by @Vi11atoro, https://x.com/Vi11atoro/status/1759309255998427324 (accessed March 7, 2024).\nIbid.\nUnless otherwise noted, this case is based on a Human Rights Watch phone interview with a victim’s relative, November 15, 2023; and an in-person interview with the victim in Sonsonate, December 16, 2023.\nUnless otherwise noted, this case is based on a Human Rights Watch phone interview with a victim’s relative, November 15, 2023; and an in-person interview with the victim in Sonsonate, December 16, 2023.\nSentence enforcement court of Santa Ana, decision of December 2023 (on file with Human Rights Watch).\nConvention on the Rights of the Child, arts. 52, 53 and 54.\nConvention on the Rights of the Child, art. 40. Committee on the Rights of the Child, General Comment No. 24, paras. 13-18; UN Rules for the Protection of Juveniles Deprived of their Liberty, arts. 1-2.\nIbid. See also UN Rules for the Protection of Juveniles Deprived of their Liberty, art. 17.\nInformation provided to Human Rights Watch by the Public Defender’s Office via email, April 29, 2024 (on file with Human Rights Watch).\nIbid.\nHuman Rights Watch in-person interview with three victims, Sonsonate, December 16, 2023; Human Rights Watch phone interview with a victim’s relative, November 11, 2023.\nAmendments to the Criminal Code, Decree 337, art. 2.\nUnless otherwise noted, this case is based on a Human Rights Watch phone interview with a victim’s relative, January 18, 2024.\nInvestigation court of Sensuntepeque, decision of October 2023 (on file with Human Rights Watch).\nIbid.\nUnless otherwise noted, this case is based on a Human Rights Watch phone interview with a victim’s relative, January 18, 2024.\nSentence enforcement court of San Vicente, decision of November 2023 (on file with Human Rights Watch).\nUnless otherwise noted, this case is based on phone interviews with a victim’s relative, July 7, 2023, and January 24, 2024.\nUnless otherwise noted, this case is based on phone interviews with a victim’s relative, October 17, 2023.\nInvestigation court of San Francisco Gotera, decision of December 2022 (on file with Human Rights Watch).\nUnless otherwise noted, this case is based on phone interviews with a victim’s relative, January 22, 2024.\nInvestigation court of San Francisco Gotera, decision of December 2022 (on file with Human Rights Watch).\nUnless otherwise noted, this case is based on phone interviews with a victim’s relative, February 22, 2024.\nInvestigation court of San Francisco Gotera, decision of December 2022 (on file with Human Rights Watch).\nIbid.\nManfred Nowak, The United Nations Global study on children deprived of liberty, July 11, 2019, UN Doc. A/74/136,\nhttps://omnibook.com/global-study-2019/liberty/page-001.html (accessed May 5, 2024); Jason Schnittker and John Andrea, “Enduring stigma: the long-term effects of incarceration on health, Journal of health and social behavior, vol. 48(2), 2007, https://pubmed.ncbi.nlm.nih.gov/17583269/ (accessed May 29, 2024), pp. 115-130; Paula Braverman and Robert Morris, “The health of youth in the juvenile justice system,” Juvenile Justice: Advancing Research, Policy, and Practice, 2011, https://onlinelibrary.wiley.com/doi/abs/10.1002/9781118093375.ch3 (accessed May 29, 2024), pp. 44-67; Barry Holman and Jason Zeidenburg, “The Dangers of Detention: The Impact of Incarcerating Youth in Detention and Other Secure Facilities,” Justice Policy Institute, 2006, https://justicepolicy.org/wp-content/uploads/2022/02/06-11_rep_dangersofdetention_jj.pdf (accessed May 29, 2024).\nHuman Rights Watch in-person interview with a victim’s relative, Apopa, September 23 and San Salvador, December 19, 2023; and an in-person interview with the victim, Apopa, September 22, 2023.\nNowak, The United Nations Global study on children deprived of liberty, pp. 191, 298.\nHuman Rights Watch phone interview with a victim’s relative, November 1, 2023; and an in-person interview with the victim in Sonsonate, December 16, 2023.\nIbid.\nHuman Rights Watch phone interview with a victim’s relative, October 31, 2023; and an in-person interview with the victim, Panchimalco, December 17, 2023.\nHuman Rights Watch phone interview with a victim’s relative, April 23, 2024.\nRichard Redding, “Juvenile Transfer Laws: An Effective Deterrent to Delinquency?” Juvenile Justice Bulletin, US Department of Justice Office of Juvenile Justice and Delinquency Prevention, June 2010, https://www.ncjrs.gov/pdffiles1/ojjdp/220595.pdf (accessed May 1, 2024).\nIbid.\nHuman Rights Watch phone interview with a victim’s relative, December 20, 2024.\nHuman Rights Watch in-person interview with a victim, Apopa, December 17, 2023.\nHuman Rights Watch in-person interview with the victim, Sonsonate, December 16, 2023.\nHuman Rights Watch phone interview with the victim, June 4, 2024.\nRelated Content\nJuly 16, 2024 News Release\nEl Salvador: Rights Violations Against Children in ‘State of Emergency’\nEnd Torture, Arbitrary Arrests, Inhumane Detention Conditions\nJuly 16, 2024 News Release\nEl Salvador: Rights Violations Against Children in ‘State of Emergency’\nRegion / Country\nAmericas El Salvador\nTopic\nChildren's Rights\n------------------------------------------------\nClick for original article\n...... read full story",
  "word_count": 30016,
  "scraped_at": "2026-02-14T12:09:44.969785"
}