{
  "article_id": "1c473a1b3738",
  "url": "https://www.twtd.co.uk/ipswich-town-news/43321/efl-matches-postponed-as-mark-of-respect/onthisday",
  "title": "EFL Matches Postponed as Mark of Respect - Ipswich Town News",
  "date": "20230909T190000Z",
  "domain": "twtd.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Friday, 9th Sep 2022 11:37\nTown’s League One game against Cambridge United at Portman Road and all other Premier League and EFL fixtures scheduled for this weekend have been postponed as a mark of respect to Her Majesty, Queen Elizabeth II, who died yesterday aged 96.\nA statement released by the EFL reads: “Further to discussions on Friday morning it has been determined that all EFL fixtures from 9-10 September will be postponed as a mark of respect by the National Sport to the passing of HRH Queen Elizabeth II.\n“This is aligned with the approach that the Premier League and the FA will take with their competitions this weekend.\n“Further information, in respect of how football, clubs and their supporters will commemorate Her Majesty’s reign will be confirmed at an appropriate point. Details regarding rearranged games will be announced in due course.”\nTown are set, as it stands, to return to action on Tuesday evening when Bristol Rovers visit Portman Road.\nIpswich Town Women's FA Women’s National League Cup determining round tie at QPR on Sunday is also off.\nMeanwhile, BBC Radio Suffolk's Life's a Pitch will not be broadcast on Saturday.\nPhoto: Action Images via Reuters\nPlease report offensive, libellous or inappropriate posts by using the links provided.\nThis whole charade of \"YOU MUST GRIEVE\" can get in the bin already.\nThere were games cancelled for Diana so this was always going to happen.\nwhat did shankly say about football ??\nWe've just spent 4 days celebrating her 70 years of service but we're now asked to spend 2 weeks mourning her life. Doesn't sit right. I think it should be all about celebration except for the funeral which is the dedicated mourning event.\nNone of this really affects me, I wasn't going to the Cambridge game anyway. But I don't see how not playing a football match is respectful but tv still broadcasting entertainment is ok?\nWhat does this achieve?\nThe rearranged game will probably be played midweek...which means the tickets I bought for my grandkids will hopefully be refunded.\nYou need to login in order to post your comments",
  "word_count": 353,
  "scraped_at": "2026-02-14T12:04:24.404374"
}