{
  "article_id": "1c6fb42a3ce2",
  "url": "https://theathletic.com/5318342/2024/03/06/liverpool-commercial-strategy/",
  "title": "Inside Liverpool commercial strategy : Blue - chip deals , U . S . focus and closing Man City gap",
  "date": "20240306T060000Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The battle off the field in the Premier League is as keenly contested as the one on it.\nLiverpool’s recently published accounts for the 2022-23 season showed that commercial income had risen by £25million to £272m ($345.5m at the current exchange rate) – moving above broadcast and other media revenue to become the club’s biggest source of cash.\nAdvertisement\nThat figure has almost doubled in the space of five years but they are still playing catch-up on two of their domestic rivals. Manchester City lead the way with annual commercial revenue of £341million, followed by Manchester United on £303m.\nCan Liverpool bridge that gap?\n“I wouldn’t be here if I didn’t believe we could,” their commercial director Ben Latty tells The Athletic.\n“We’ve only really seen a huge step-change in our commercial growth over the past five years. I feel like we’re only just getting started.\n“It’s competitive out there, but we’re in a really good position to push on and provide the funds to help further drive on-field performance. We talk about ‘the virtuous circle’ in terms of how we operate as a club. Commercial success and football success are intrinsically linked.”\nSignificant progress has already been made on that front this season, which will be reflected in the next set of accounts.\nOver the past eight months, Liverpool have signed lucrative multi-year deals with four blue-chip brands in Google Pixel (mobile phone partner), Peloton (digital fitness partner), UPS (global logistics and shipping partner) and Orion Innovation (digital transformation partner) worth more than £45million in total.\nIn December, they agreed a new 10-year contract with Carlsberg – extending their partnership with the Danish brewer to a remarkable 42 years. The value of the kit deal with Nike continues to rise amid record sales, and talks are underway with the sportswear giant overextending it past the current expiry date in the summer of 2025.\nNegotiations over a renewal are also taking place with insurer AXA, which sponsors Liverpool’s training kit and has the naming rights to the training centres for both the men’s and women’s teams.\nThe pursuit of such blue-chip firms is a concerted strategy, which the club believes ties in with their global profile — Liverpool have more than 173 million cumulative followers across their social media channels.\nAdvertisement\n“We’re on course to once again be the most-watched club on TV worldwide this season. That would make it four out of the last six seasons,” Latty says.\n“It’s also the content and the activation we provide our partners. We have double the number of engagements in terms of sponsor-branded content versus our closest competitor. That’s not just in the Premier League, that’s across European football. We sit together with our partners and come up with content initiatives.\n“You’ve got a passionate fanbase, the global reach of the club, the values we uphold and respectable ownership as what FSG (Fenway Sports Group, which owns the Premier League club as well as major league baseball’s Boston Red Sox and Pittsburgh Penguins in NHL ice hockey) have done in sport gives confidence that they’ll keep delivering for Liverpool.”\nIt is also no coincidence that all four of the club’s most recently signed partners are based in America, the home of FSG, where Liverpool have 67 official supporters’ clubs and international academies across 12 of its 50 states.\nLiverpool’s Premier League match against Arsenal in December was the most watched Premier League match in U.S. history, with an average of 1.96million viewers across traditional broadcaster NBC plus its Peacock and NBC Sports digital platforms, along with an additional 328,000 on Telemundo’s Spanish language broadcast.\n“That shows you the appetite for the Premier League and for Liverpool,” Latty adds. “We have this unique window in the U.S., given the time zones (weekend afternoon kick-offs in England happen in the mornings in the States). We’re not competing with any other U.S. sports. That provides huge growth potential. It’s a key market for us too in terms of the growth of our retail business and it’s a mature market for sponsorship in terms of the way they commercialise their sports over there.\nAdvertisement\n“There’s a real focus from U.S. companies in terms of trying to reach a more global audience and one way to do that is through Premier League football. What club do you go for? Long may it continue Liverpool FC being number one on that list.”\nWho you associate yourself with is important, as Liverpool know only too well.\nIn 2019, the club ended a partnership with Russia-owned gaming firm 1xBet, which had its UK licence suspended after reports of its website hosting betting on cock-fighting and using pornography to encourage gambling. The following year, a deal with coconut-water brand Chaokoh wasn’t renewed amid allegations of animal cruelty by the Thai company, which denied illegally capturing monkeys and using them to pick the fruits.\nBoth deals were reminders that it is not simply the number on the cheque which matters, but the image projected by those sponsorships.\nLiverpool v Manchester City could help decide the Premier League title race – and The Athletic is analysing every angle that matters.\n- Klopp v Guardiola is the most fascinating rivalry of modern era\n- Unbeaten runs to clinch the title: What might be good enough this time?\n- Shearer: Managers’ touchline act is for their players – here’s why they do it\n- City’s 1,000-pass policy silences crowds – Anfield will be ultimate test\n- Nunez: Scoring streaks and the difference between technique and skill\n“I’m very keen on ensuring we partner with the right brands,” says Latty. “That comes with some tough decisions sometimes in terms of who we continue conversations with and who we don’t.\n“We set out on a year-long research piece aligned to our strategy: what is it that blue-chip brands are looking for? One of the key elements was the company you keep — making sure they are joining a family alongside like-minded, blue-chip global brands.\n“A lot of hard graft goes into these deals. Some take years from the first contact to announcing the partnership. With a big organisation, there are many different stakeholders and you have to bring them into our world in terms of what we can offer them compared to others.\n“We haven’t seen any impact in terms of not being in the Champions League this season. We still touch every corner of the world. We still drive the TV audiences and the digital reach. We’ve got a great product to sell to blue-chip brands around the world.”\nLatty, who reports to chief executive Billy Hogan, returned to Liverpool as commercial director two years ago after leaving his job overseeing commercial operations for Bristol Sport, which incorporates Bristol City in the Championship, the second tier of English football, and the top-flight Bristol Bears rugby union team. He had previously worked for the club between 2013 and 2021 in a variety of partnership roles.\nAdvertisement\nLiverpool have an ever-growing 80-strong staff working on partnerships, split between Liverpool, London, New York and Boston in the U.S., Singapore, Hong Kong and Japan’s capital Tokyo.\nThose talks over potential renewals with Nike and AXA currently figure high on the agenda.\n“We are having those conversations with AXA and hopefully we can get to a good outcome,” says Latty.\n“As for Nike, given the sheer volume of kit we produce around the world and the distribution related to a deal like that, there is a long path leading to those types of deals. We are having ongoing conversations with them. I can’t break any confidentiality in terms of where they are heading.”\nWhat about a possible naming-rights deal for the redeveloped Anfield Road Stand, which lifted capacity for home matches beyond 60,000 when the upper tier belatedly opened fully last month?\n“We have debated and discussed it,” Latty says. “Nothing is off the table related to that.\n“Of course we would consider it, but I think the biggest potential and most likely outcome in terms of commercialising the Anfield Road end is going to be having themes and areas of it. Whether it’s the naming rights to a hospitality lounge or an activation space within the fan zone, which is going to hold 2,500 fans pre-game.\n“Those kinds of things are going to be more interesting to the blue-chip partners we’re speaking to.”\nCommercial revenue will also be bolstered by a pre-season tour of the States this summer, with games against Arsenal at the home of the NFL’s Philadelphia Eagles and Manchester United in the 77,000-capacity American football stadium at the University of South Carolina.\nBy then, there will be a new manager at the helm. Jurgen Klopp’s force of personality, as well as his team’s achievements, have lifted Liverpool’s profile to new heights throughout his eight-year Anfield reign — he’s the star of a Peloton TV advert.\nWhat kind of impact will his exit at the end of this season have commercially?\nAdvertisement\n“Jurgen is such a big part of this club’s recent history and he is the leader of the club in so many respects. But I do believe that we are in a great position to maintain the process we’ve started,” adds Latty.\n“The foundations are strong to continue the commercial success we’ve seen over the past few years. We have the right team in place off the pitch as well as on it.”\n(Top photos: Getty Images; design: Eamonn Dalton)",
  "word_count": 1574,
  "scraped_at": "2026-02-14T12:47:27.301575"
}