{
  "article_id": "1c733da0148d",
  "url": "https://thechronicle.com.gh/herve-renard-to-take-over-as-france-women-coach/",
  "title": "Herve Renard to take over as France women coach - The Chronicle News Online",
  "date": "20230330T094500Z",
  "domain": "thechronicle.com.gh",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Herve Renard has resigned as head coach of Saudi Arabia’s men’s team and is set to lead France at the Women’s World Cup this summer.\nThe Saudi Arabian Football Federation (SAFF) said on Tuesday that Renard, 54, requested his contract be terminated.\nHe will replace Corinne Diacre, who was sacked after several key players said they would no longer represent their country under her leadership.\nThe Women’s World Cup will take place from 20 July to 20 August.\n“[Renard] has an offer from the French Federation and expressed his desire to take this opportunity,” SAFF president Yasser Al-Misehal told Saudi Sports Channel.\n“We were informed four days before the current international window and I received a letter from the French Federation, and consulted with the board of directors and we decided to accept this request.”\nThe Frenchman took charge of Saudi Arabia in July 2019 and guided them to their second successive World Cup finals, where they shocked eventual champions Argentina with a 2-1 win in Qatar last year.\nAfter a friendly loss to Bolivia on Tuesday, Renard – who has never managed a women’s team – told reporters: “I would like to thank everybody in Saudi for their support during almost four years.\n“I think I did the maximum with the team. I can’t reach another level so I prefer to be honest with everybody. Thank you again, it was a fantastic time.”\nRenard has won the Africa Cup of Nations as head coach with both Zambia and Ivory Coast – the first person to lead different countries to the AFCON title.\nCredit: bbc.com",
  "word_count": 265,
  "scraped_at": "2026-02-14T12:25:03.797350"
}