{
  "article_id": "1c82476c93e5",
  "url": "https://www.the42.ie/carla-ward-9-6878278-Nov2025/",
  "title": "  Positivity breeds positivity . There a real opportunity here in these next two to three years  ",
  "date": "20251118T170000Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "THE FEEL-GOOD FACTOR around Irish football right now is undeniable.\nThe buzz since Sunday, when Troy Parrott fired the men’s senior national team to the World Cup play-offs, has been palpable.\nFrom Portugal to Hungary, the last few days have been special, with the U17s also on a brilliant run at the World Cup in Qatar.\nLast month, the women’s senior team stunned Belgium in their Nations League promotion/relegation to boost their own chances of qualifying for back-to-back World Cups.\nAbbie Larkin was the late hero on that occasion, another Dublin inner city product.\nAnd Ireland women’s boss Carla Ward is keen to continue the feel-good factor, believing her side may have even prompted the surge.\n“I would say they probably felt that after we beat Belgium, if I’m honest,” Ward told her squad announcement press conference, when asked if the achievements of the men’s team had whetted her appetite for further success.\n“Me and Heimir (Hallgrímsson) had that conversation yesterday. I think positivity breeds positivity.\n“I always say and I’ve said from quite a young age, if I walk in the room and smile at you, you’re going to smile back, right? I think when you’re breeding positivity, results are going your way and you want to be part of that. It’s not just the men, the women, the U17s. I mean that was unbelievable the other day.\n“And I think there’s an air around that everybody wants to play their part. But we’ll all say the same thing, it’s a really good moment. And to continue these moments, we’ve got to work extremely hard.”\nWard will finish her first year in charge with a training camp in Marbella, Spain next week, which includes a behind-closed-doors international friendly against Hungary. (Fitting?)\nFrom the lows of a 4-0 defeat in Slovenia, to the highs of Leuven last month, and the various challenges that go hand in hand with Irish football in between, it has been a whirlwind.\n“It’s been challenging. Make no bones about it,” she reflects. “I said it to you: it was going to be difficult to start, messy in the middle. And I’d like to think we see some beautiful little pieces in the end.\n“It’s been a really transitional period. I was adapting to international football. I still am. I’m learning all the time. I’ve probably had to adapt more than I anticipated.\n“We’re on the right track is what I would say. But me being me, I always want more and to improve every area of what we’re trying to do.\n“The expectation over here is high. I love that actually, because it puts that little bit of added pressure on you. And I work well with the pressure, when it’s nice pressure anyway.”\nWard sees “unbelievable opportunity” for Irish football going forward: both the men’s and women’s senior teams are in with a shot of World Cup qualification in 2026. But she warns too of further off-field difficulties: job cuts loom as part of an FAI restructure.\n“I think there’s a real positivity about it. Let’s be really honest, there was a lot of negativity around and lots of challenges, lots of things to face. And you lot (the media) have grilled me about all of those challenges along the way.\n“I kept saying if we can get over — and we’re still not over it yet — but if we can get past these difficult, times there is such an unbelievable opportunity for Irish football, there really is.\n“There’s going to be some difficult times with the restructure, which is going to be tough. But I think what the outcome of that will be should set Irish football up to be a little bit more successful. So I think there’s a real opportunity here in these next two to three years.”\nMeanwhile, the FAI have decided where next year’s home World Cup qualifiers against France, Netherlands and Poland will be played, but are yet to announce the venues.",
  "word_count": 665,
  "scraped_at": "2026-02-14T14:20:56.540776"
}