{
  "article_id": "1c91994e9dfe",
  "url": "https://www.justarsenal.com/villa-lose-4-players-brighton-5-big-names-depart-chelsea-will-arsenal-women-only-lose-rafaelle/340717",
  "title": "Villa lose 4 players , Brighton 5 , big names depart Chelsea - will Arsenal Women only lose Rafaelle ? ",
  "date": "20230526T164500Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Villa lose 4 players, Brighton 5, big names depart Chelsea – will Arsenal Women only lose Rafaelle? by Michelle\nThe summer transfer window is upon us and WSL clubs are announcing player departures with some gusto. But what’s on the cards for Jonas Eidevall’s Arsenal Women squad? We already know that Arsenal’s Brazilian team captain is jumping on a jet plane to the sunshine and the bosom of Orlando Pride this summer, with Eidevall saying via Arseblog:\n“For reasons that our beyond our control she will leave, she is sad, we are sad. But I really cherish the memories we have with her and thank her for her contributions she made to the club. I hope she can have a really strong performance tomorrow and we can have a really nice sending off for her.”\nArsenal Women have been exceptionally quiet on the ‘moves’ front thus far.. Will our Gunners only lose Rafaelle?\nhttps://www.justarsenal.com/arsenal-women-need-to-add-a-top-defender-to-their-transfer-wishlist-as-rafaelle-departs/340660\nCarla Ward’s Aston Villa have recently announced that 4 players will be departing. Emily Gielnik, Chantelle Boye-Hlorkah and Katie McCabe’s partner and Republic of Ireland teammate Ruesha Littlejohn will depart when their contracts expire, while Natasha Harding will also leave.\nMelissa Phillips Brighton are losing their captain Megan Connolly and goalkeeper Megan Walsh, as well as Victoria Williams, Kayleigh Green and Danielle Carter, after The Seagulls – who have been through four managers this season – moved out of the WSL relegation zone last weekend.\nChelsea’s Emma Hayes has been gutted by the loss of captain Magdalena Eriksson and forward Pernille Harder, who both play their last match for Chelsea tomorrow, 27th May.\n“There are not enough words to describe the impact Magda has had, not just on this football club but on me,” Hayes told the BBC. “She has been a wonderful leader, someone who has helped drive the team and its standards to the levels that we’re at.”\nHayes also has the highest respect for Harder, saying that she is “one of the best attacking players in the world”.\nJonas Eidevall’s Arsenal already has a lot of recruiting to do through the summer transfer window, on the striker front, but with Rafaelle leaving and defenders Leah Williamson & Laura Wienroither out of action due to ACL injuries, likely not returning before the second half of the 2023-24 season, defenders will be on his growing list of desirables too..\nSo, back to my original question – will our Gunners only lose Rafaelle? Who else do you think could be on the move?\nCOME ON YOU GOONER WOMEN!\nMichelle Maxwell\nFollow Michelle on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 453,
  "scraped_at": "2026-02-14T12:21:46.812528"
}