{
  "article_id": "1ca448d08523",
  "url": "https://www.90min.com/features/5-wsl-players-to-watch-paris-2024-olympics-ranked",
  "title": "5 WSL players to watch at the Paris 2024 Olympics",
  "date": "20240724T111500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "5 WSL players to watch at the Paris 2024 Olympics - ranked\n- The Olympic group stage for women's football begins on 25 July\n- 12 countries are competing for the gold medal\n- Plenty of WSL players will be representing their nation\nTwelve countries are getting ready to compete in the women's football tournament at the 2024 Olympics in Paris, with Canada going in as reigning champions from three years ago.\nThe group stage begins on 25 July, with the gold medal match scheduled just over two weeks later on 10 August, making it more intense than most major international competitions.\nFrance will be hosting some of the best players in the world, and 90min has hand picked the top five to watch from the Barclays Women's Super League...\n5. Jayde Riviere (Canada)\nWSL club: Man Utd\nFull-back Jayde Riviere signed her first professional contract when she joined Manchester United in January 2023.\nBut the 23-year-old has already tasted success at the Olympics, after being part of Canada's gold medal-winning squad in 2021. She’s also represented her country at two different FIFA World Cups.\nHowever, Riviere struggled with a string of minor injuries for much of early 2024, ruling her out of the CONCACAF W Gold Cup in February. But, having returned to fitness at club level, Riviere got the call for the Olympics.\nDespite a stop-start few months at United, she shouldn’t be underestimated. At full fitness, Riviere is a force to be reckoned with, and will no doubt be crucial as Canada aim to defend their title.\n4. Mariona Caldentey (Spain)\nWSL club: Arsenal\nArsenal confirmed the arrival of Mariona Caldentey earlier this summer, after she had spent the previous years at Barcelona.\nCaldentey has an ability to play as a forward and an attacking midfielder, meaning she is a persistent threat for any opponent. The 28-year-old has an immense ability to break down any backline, and with 114 goals under her belt for the Catalan side, it's almost a given that she’ll hit the back of the net representing Spain in this tournament.\nThis will be the first time that Arsenal fans will really get their eyes on the new signing, who is going to be wearing red and white next season in the WSL. Spain are going to be hungry for more success after being crowned champions of the World Cup last summer in Australia.\n3. Sandy Baltimore (France)\nWSL club: Chelsea\nForward Sandy Baltimore has been hailed as one of the most exciting signings of the summer transfer window in the WSL, having joined Chelsea on a long-term contract after leaving Paris-Saint Germain.\nThe 24-year-old has spent most of her career at the French club, making her first-team debut at just 15, and went on to make more than 150 appearances across all competitions.\nBaltimore already has plenty of international experience under her belt too, playing 28 times for France. There is no doubt that she will be eager to use the Olympics as her opportunity to make a statement to her country, as well as Chelsea, that she is a fierce competitor.\n2. Mary Fowler (Australia)\nWSL club: Man City\nMary Fowler predominantly plays as a forward but is versatile and can move back into midfield when required.\nThe Australian penned a deal with Manchester City in 2022, after leaving French club Montpellier, where she spent most of her youth. Although she spent a lot her first season on the bench, she was nominated for the Best FIFA Women's Player the following year after a hugely impressive World Cup on home soild, and later got more game time at club lebel.\nThis summer marks Fowler's second time at the Olympics and she already has over 50 international caps for the Matildas, despite being only 21-years-old. After more experience in the WSL, and on an international stage, Fowler is set to be a staple feature for the Matidas in France.\n1. Mayra Ramirez (Colombia)\nWSL club: Chelsea\nChelsea responded to Sam Kerr's ACL injury in January by spending big on Mayra Ramirez, who went on to score five times for the Blues before the season was out - including twice in the final day demolition of Manchester United.\nWhen she first joined Chelsea, the striker had made 30 appearances for Colombia, and was pivotal in helping them to reach the quarter-finals of the 2023 World Cup, where they were beaten by runners-up England.\nRamirez has been praised for her tenacity, strength and willingness to do whatever it takes to win, something that Colombia will be reassured to know they've got going into the Olympics.\nREAD THE LATEST WOMEN'S FOOTBALL NEWS, FEATURES & ANALYSIS",
  "word_count": 779,
  "scraped_at": "2026-02-14T12:22:58.756170"
}