{
  "article_id": "1caa2f3d6176",
  "url": "https://www.chortle.co.uk/news/2023/06/25/53393/could_maisie_adam_and_katherine_ryan_be_lionesses",
  "title": "Could Maisie Adam and Katherine Ryan be Lionesses ? : News 2023 : Chortle : The united kingdom Comedy Guide",
  "date": "20230625T123000Z",
  "domain": "chortle.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Could Maisie Adam and Katherine Ryan be Lionesses?\nMaisie Adam and Katherine Ryan have been training with England’s top women’s footballers for a new Sky show.\nThe comedians were put through their paces by Jill Scott – the midfielder who retired from the sport after last year’s Euros victory and went on to win I'm a Celebrity… Get Me Out of Here!\nAdam is a massive football fan – who became star-struck when meeting her hero, Lioness Millie Bright, on Channel 4’s Big Fat Quiz Of The Year last year. On the programme she gushed about how England’s win in the 2022 Euros was the ‘best day of my life’.\nHowever, Ryan - who was on Adam's team on the Channel 4 quiz - has never publicly expressed any interest in the sport.\nTheir programme, The Lionesses is being made as a League Of Their Own special and will involve the comedians learning what it takes to be a world-beating player.\nThe show airs on Sky Max on July 12, eight days before the month-long Women's World Cup kicks off in Australia and New Zealand.\nThe comics and Scott were also all seen together at the Women's FA Cup Final at Wembley in May, where Chelsea defeated Manchester United 1-0.\nLeeds Utd fan Adam last month played in the charity Soccer Aid match at Old Trafford, alongside the likes of Mo Gilligan and Usain Bolt - the day after she got married. Scott was on the opposing team, which the comic said was ‘incredible and terrifying in equal measure’ ahead of the match.\nAdam is also currently presenting a four-part Radio 4 series, The Beautiful Game, in which she discusses her love of football - and the unspoken sexism that underpinned it growing up.\n‘In primary school everyone just played football no matter who you were,’ she said. ‘It was only when I went to high school that suddenly I realised I had been enjoying watching, attending, following and playing a sport that I absolutely was not meant to enjoy, watch, attend, follow or indeed play.\nListen to episode one of the programme, which Adam has described as a ‘pure passion project’, here.\nPublished: 25 Jun 2023",
  "word_count": 367,
  "scraped_at": "2026-02-14T12:54:43.290582"
}