{
  "article_id": "1cb733cf12b1",
  "url": "https://www.thenationalnews.com/news/mena/2025/08/03/saudi-arabia-and-jordan-denounce-itamar-ben-gvirs-provocative-visit-to-al-aqsa-mosque/",
  "title": "Saudi Arabia and Jordan denounce Itamar Ben - Gvir  provocative  visit to Al Aqsa Mosque",
  "date": "20250803T170000Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The UAE and Saudi Arabia have condemned “provocative” practices by Israeli officials at Al Aqsa Mosque compound, after Israel's far-right National Security Minister Itamar Ben-Gvir visited the holy site on Sunday.\nThe UAE \"strongly condemned\" Mr Ben-Gvir's storming of the compound and said it considered it \"a provocative escalation and an unacceptable act of extremism.\" The statement from the foreign ministry also called on Israel to condemn the attacks and hold those involved accountable, \"particularly ministers and officials within the Israeli government.\"\n“Such practices fuel conflict in the region,” Saudi Arabia's Foreign Ministry said.\nThe Jordanian Foreign Ministry described the act as a “flagrant violation of international law and international humanitarian law, an unacceptable provocation, and a condemned scalation”, stressing that Israel holds no sovereignty over Al Aqsa Mosque.\nUnder a delicate decades-old status quo arrangement with Muslim authorities, the compound is administered by a Jordanian religious foundation and Jews can visit but may not pray there.\nThe Waqf, the foundation that administers the complex, said Mr Ben-Gvir was among another 1,250 who ascended the site and who it said prayed, shouted and danced.\nIsraeli Prime Minister Benjamin Netanyahu said in response to the visit that: “Israel's policy of maintaining the status quo on the Temple Mount has not changed and will remain unchanged.”\nNew anger erupted in Israel after Hamas and Palestinian Islamic Jihad released two videos of Israeli hostages held in Gaza, as efforts to get a ceasefire deal stall and the country’s far-right government appears to favour continued fighting to a ceasefire.\nPIJ released a six-minute video on Thursday showing distressed hostage Rom Braslavski, 21, which it said was recorded days before contact was lost with his captors.\nThe next day, Hamas released a video of emaciated Evyatar David in a tunnel, part of which filmed him digging a hole that he said he thought would be his grave. The video was published as Steve Witkoff, US Middle East envoy and a pivotal figure in ceasefire negotiations, was visiting relatives of Israeli hostages.\nThe footage caused rage in Israel, as well as the Israeli government. Mr Braslavski’s mother said: “Don’t cry over the children in Gaza – cry for Rom,” according to The Times of Israel.\nOpposition leader Yair Lapid wrote in a post on X: “Let every government member watch Evyatar's video tonight before going to sleep and try to fall asleep while thinking of Evyatar trying to survive in a tunnel.”\nProtesters also blocked a motorway in Tel Aviv on Sunday morning, calling for a hostage deal in solidarity with the hostages.\nPolling consistently suggests that Israelis also oppose the war, with the majority concerned for the well-being of hostages and Israeli soldiers. Concern over the war’s effects on Gazan civilians remains low, with 74 per cent of Israeli Jews saying “they are not distressed by the humanitarian situation in Gaza”, according to a poll published on Sunday by Israeli think tank INSS.\nThe continuing opposition to the war inside Israel comes as many ministers double down on the necessity of continuing the conflict. Far-right Israeli Heritage Minister Amichay Eliyahu said on Wednesday that releasing hostages should not be the main goal of the war.\n“[Hostages] should be called 'prisoners of war … and 'prisoners of war' are dealt with at the end of the war,” he added.\nMr Ben-Gvir, who leads the Otzma Yehudit party to which Mr Eliyahu belongs, said on Sunday that the “only way” to return hostages and win the war against Hamas was by sending the message that “we are already occupying all of the Gaza Strip, declaring sovereignty across the entire Gaza Strip, eliminating every Hamas member and encouraging voluntary emigration”.\nMr Ben-Gvir made the comments at the flashpoint Al Aqsa compound in Jerusalem where he also prayed, challenging rules covering one of the most sensitive sites in the Middle East.\nHamas called its attacks on southern Israel on October 7, 2023, “Al Aqsa Flood” and said they were in part response to the breaches of the mosques status quo, including by ministers in Mr Netanyahu’s government.",
  "word_count": 678,
  "scraped_at": "2026-02-14T12:58:35.310887"
}