{
  "article_id": "1cc85d8c5fe1",
  "url": "https://gostanford.com/stanford-athletics-fan-policies",
  "title": "Stanford Athletics Fan Policies",
  "date": "20240617T130000Z",
  "domain": "gostanford.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Clear Bag Policy\nIn an effort to improve fan safety, Stanford Athletics will implement a Clear Bag Policy for all athletic events beginning with the new school year (September 1, 2023).\nThis policy limits the size and types of bags that are permitted inside athletic venues. It is not a restriction on many of the items that fans have brought into the stadium in the past, but it will enhance safety at Stanford events as a clear bag is easily and quickly searched.\nUnapproved bags will not be permitted inside any Stanford athletic venue. Fans with unapproved bags will be asked to return their bags to their vehicle, check them (if the service is available), or transfer their belongings to an approved clear plastic bag before entering the venue.\nApproved bags include clear plastic, vinyl, or PVC bags that do not exceed 12\"x6\"x12\" and small clutch bags or purses no larger than 4.5\" x 6.5\" (approximately the size of a hand) with or without a handle or strap.\nAll fans are subject to search. Fans are encouraged to bring only necessary items to events. No items on the Prohibited Items list will be allowed into Stanford venues (although special considerations will be made for guests with special medical needs and individuals caring for infants).\nFans with medically necessary items may bring them in a non-clear bag, for privacy reasons, but they may be subject to additional screening. Diaper bags are considered ‘medically necessary,” but will be subject to additional screening (an infant must be present).\nWhy has this policy been adopted?\nPublic safety and venue security policies are reviewed each year, looking for ways to improve. These proactive measures will both enhance safety inside the stadium and speed the security screening process for all fans. This policy limits the size and types of bags that are permitted inside each venue, but is not a restriction on many of the items that fans have brought into the venues in the past. This policy will enhance safety at our games as a clear bag is easily and quickly searched. The public deserves to be in a safe and secure environment.\nAre other venues and sports facilities limiting bags or doing enhanced screening?\nYes. All major sports venues in Northern California and a majority of Pac-12 universities have adopted similar entry procedures. In fact, Michigan, Michigan State and Penn State do not permit any bags. The limitation on bag size and type is a further enhancement for both safety and convenience. Metal detector screening of individuals entering stadiums provides an additional level of safety for fans.\nHow does this make it more convenient for fans?\nThis will enable us to move fans through our security checkpoints much faster. Mandating a standard sized clear bag (12\" x 12\" x 6\") eliminates the need for bag templates to check bag sizes. It will allow venue staff to be more efficient and effective in checking bags that are brought into the venue. Fans will also enjoy an improved sense of safety.\nWhat can guests expect at the gates/doors at Stanford Stadium/Maples Pavilion?\nFans with approved clear bags will have their bags checked at the gates/doors. Bags which do not comply with Stanford's clear bag policy can be checked at a bag check station (football - Cagan Stadium or between gates 9 and 10; basketball - northwest entrance).\nAll fans will be asked to remove phones, cameras, keys and other large metal objects from their pockets before walking through a metal detector. If the device detects a foreign object, the guest will be checked with a hand-held wand, with further security follow-up, if needed.\nWe've added self-ticket scanners at each of the gates, where fans can scan their ticket for entry; staff will be on-site to assist, should a fan need help. This will also allow fans to quickly scan their ticket and enter through the gates.\nIf I have a diaper bag or certain medical items/equipment, what do I do?\nDiaper bags are permitted, but will be subject to screening. You must have the infant(s) present for which the diaper bag is being carried when the diaper bag is screened. Fans with medically necessary items may enter at any gate/entrance but will be subject to additional screening. Supervisors at each entrance will assist.\nDoes this mean it's going to take longer to enter the stadium?\nStanford is making every effort to ensure that this security enhancement does not slow the process of getting into the game. Initially, as with any new process, fans may experience longer wait times. We will have extra staff on duty to help facilitate the quickest entry possible. We encourage fans to arrive more than 30 minutes before kickoff and tipoff, to enjoy shorter wait times.\nWhat can I do to help get into the stadium quickly?\nArrive early, know which items are prohibited and avoid bringing a bag.\nIs this like the TSA at the airport?\nNo, the process may look similar to airport screening, but fans will not be asked to remove their belts, shoes, or jackets and our equipment is specifically calibrated to detect metal objects.\nI have a medical device that sets off metal detectors. What should I do?\nDiscretely contact the security personnel at the entry gates. They are trained and prepared to help you with an alternative screening method.\nCan I bring in a wheelchair through the metal detector?\nGuests with wheelchairs will not have to go through the walk-through detectors, but they will be subject to an alternative screening method, utilizing a handheld electronic metal detecting wand, in addition to the standard clear bag search.\nWill these procedures be in place at other events?\nThese procedures will be in place for football games at Stanford Stadium, men's and women's basketball games at Maples Pavilion, and other select events to be communicated.\nWill clear bags be available through Stanford or on the day of a football or basketball game?\nSimple clear bags will be available at Guest Services tents located outside of the venues. The Stanford Bookstore and Athletics Shop will sell clear bags before and on gameday, Alternatively, we suggest that you use a one-gallon clear Ziploc bag.\nCan I carry cameras, binoculars, phones, or tablets separately from what I put in a clear bag?\nYes. We are limiting only the type of bags carried into the venue, not items that you normally bring to an event. Fans can continue to carry permitted items in their pockets or hands such as keys, phones, wallets, blankets, etc., if you choose not to put them in a clear bag or clutch. In addition you can carry a blanket over your arms, and binoculars and/or camera around your neck or in your hands without the case. You can use the clear bag and clutch to carry other items.\nWhat kind of bags are approved to bring into the venue?\n• Clear plastic, vinyl or PVC bags that do not exceed 12\" x 12\" x 6\"\n• One-gallon clear plastic bags (Ziploc bag or similar)\n• Small clutch bags approximately the size of a hand, with or without a handle or strap (can be carried separately or within a plastic bag)\nProhibited Items\nStanford Athletics wants all fans to enjoy Cardinal athletic events in a safe and enjoyable environment.\nAll guests are subject to search before being admitted into any athletic event (see bag policy).\nThe information below is subject to change without notice.\nThe following items are PROHIBITED inside the Stanford athletic venues:\n- Alcohol of any kind and illegal drugs\n- Animals (except service animals)\n- Artificial noisemakers\n- Non-clear bags larger than 4.5”x6.5” or clear bags larger than 12”x12”x6”\n- Balls, whole fruits/vegetables (unless cut into small pieces) and other potential projectiles\n- Balloons\n- Banners and/or signs\n- Bicycles, skates, scooters, skateboards, roller blades, and roller shoes\n- Cameras with lenses longer than six inches\n- Clothing that is derogatory, profane, scanty, or offensive\n- Fireworks\n- Hard plastic, glass, ceramic or metal bottles, hydration packs, and soft plastic bottles (need to be sealed or empty) larger than 20 oz.\n- Laser pointers\n- Metal seatbacks (unless ADA compliant)\n- Open containers\n- Open umbrellas\n- Poles, selfie-sticks, monopods and tripods\n- Remote controlled devices of any kind (cars, drones)\n- Seat cushions larger than 18”\n- Strollers or portable chairs (unless ADA compliant)\n- Tobacco products (including e-cigarettes)\n- Video Cameras\n- Weapons, replica weapons\nAdditional items may be denied without notice for the safety and security of all participants, fans, and staff.\nProhibited items and facility rules subject to change during post-season events.\nFan Code of Conduct\nStanford Athletics is committed to serving its fans by providing a safe and celebratory gameday experience. The Fan Code of Conduct has been established to ensure that fans’ Game Day experience is consistent with that commitment.\nFailure to follow this code may result in ejection from the facility, revocation of ticket privileges and/or arrest.\nAll fans are expected to refrain from the following behavior at all events:\n- Any action that disrupts other guests' enjoyment of the game\n- Engaging in action that causes a disruption or interferes with the game\n- Profanity or other offensive language, whether spoken or appearing on apparel\n- Smoking or use of e-tobacco products\n- Throwing of items or liquids\n- Entering the court or field of play at any time\n- Failure to retain ticket and/or present it to event staff if requested to do so\n- Resale of tickets at the venue\n- Violation of state or local laws\n- Possession of any item listed on the “Prohibited Items” list\n- Use of foul, abusive, obscene, or discriminatory (on the basis of gender, sexual orientation, gender identification, age, race, national origin, religion, military status, disability status or any other characteristic) language or gestures\n- Fighting, taunting, or threatening remarks or gestures\n- Intoxication or signs of impairment related to alcohol or drug use. Fans that appear to be impaired will not be permitted into the stadium and may be subject to arrest.\n- Failure to follow the directions of law enforcement or stadium management\n- Sitting in a seat other than one's ticketed seat location\n- Smoking and/or tobacco use (including e-cigarettes)\nStanford Athletics reserves the right to determine what constitutes unacceptable behavior. Fans are encouraged to report inappropriate behavior to team/venue personnel by texting the Athletics hotline at 650-200-CARD for immediate response on game day.\nThe department welcomes fans’ help in its efforts to provide an enjoyable experience for all.",
  "word_count": 1763,
  "scraped_at": "2026-02-14T13:12:08.834293"
}