{
  "article_id": "1ce356de3ab7",
  "url": "https://www.90min.com/features/ranked-the-5-best-players-wsl-gameweek-8-2024-25",
  "title": "RANKED : The 5 best players of WSL gameweek 8",
  "date": "20241119T173000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "RANKED: The 5 best players of WSL gameweek 8\n- Eight weeks of the 2024/25 WSL season are now complete\n- Every single top flight game took place at a Premier League stadium\n- Chelsea are now top of the league standings with a game in hand\nAnother dramatic weekend of Women's Super League action is now complete and there is a new leader.\nSonia Bompastor's Chelsea secured a crucial victory over title rivals Manchester City to claim top spot, while Aston Villa and Everton claimed their first wins of the campaign. Brighton continued their bright start to the season and Arsenal closed the gap with a significant north London derby triumph.\nCrystal Palace returned to the bottom on goal difference following their last-gasp defeat to Villa, while West Ham United and Leicester City also sit on the same number of points. But Manchester United put themselves within touching distance of the top three with a 2-0 win over Leicester.\n90min have ranked the top five performers in the WSL from gameweek eight…\n5. Celin Bizet\nManchester United got back to winning ways with a much-needed 2-0 victory away at Leicester. Elisabeth Terland opened the scoring on the stroke of half-time, before Celin Bizet sealed the win with a late second.\nBizet already had three assists to her name this season, but Sunday’s strike was her first goal for the club. Her influence is growing in the team and her performances could be key to United reclaiming a top three place.\n4. Fran Kirby\nBrighton's promising start to the season continued over the weekend as they secured a narrow 3-2 victory over West Ham. They initially went 2-0 up, with Fran Kirby assisting Rachel McLauchlan’s opener, but the visitors scored twice in quick succession to level the scoreline in the second half.\nWith less than 10 minutes left on the clock, Kirby scored her third goal of the season to clinch the win for the Seagulls. They remain third in the standings, three points behind Manchester City in second.\n3. Alessia Russo\nArsenal made it six games unbeaten under interim boss Renee Slegers with a 3-0 north London derby win over bitter rivals Tottenham Hotspur on Saturday. In-form Alessia Russo opened the scoring inside the opening few minutes with an outstanding first time finish inside the box.\nFrida Maanum and Stina Blackstenius added to the tally, but it was Russo's breakthrough that set the Gunners on their way early in the game. They are now fourth in the table and just one point behind Brighton in third.\n2. Courtney Brosnan\nEverton finally secured their first win of the WSL season on Sunday and it came against Merseyside rivals Liverpool. Although the penalty decision that gifted the Toffees their winning goal in the first half was extremely contentious, Courtney Brosnan's goalkeeping heroics in the second half ensured they held on to that advantage.\nMost notably, Fuka Nagano would have scored a Liverpool equaliser if not for an outstanding double save from the Republic of Ireland international. The win takes Everton off the bottom of the table and into ninth place.\n1. Maika Hamano\nChelsea secured a crucial victory in the title race over Manchester City on Saturday. Mayra Ramirez opened the scoring late on before Guro Reiten added a second minutes later.\nBut, it was 20-year-old Maika Hamano who was the standout performer at Stamford Bridge as she set up Ramirez for Chelsea's first. She had the difficult task of keeping compatriot Yui Hasegawa quiet and did an outstanding job, while also providing an attacking outlet for her teammates. It was a dominant performance from the Japanese youngster.",
  "word_count": 607,
  "scraped_at": "2026-02-14T12:23:03.332550"
}