{
  "article_id": "1d0b0ec103d6",
  "url": "https://www.nzz.ch/english/orphans-of-the-is-caliphate-face-death-if-they-return-home-ld.1850021",
  "title": "Orphans of the IS caliphate face death if they return home",
  "date": "20240926T131500Z",
  "domain": "nzz.ch",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Orphans of the IS caliphate face death if they return home\nYears after the Islamic State group's defeat, thousands of children born to jihadis remain stranded in camps. Although they bear no responsibility for the Islamists' crimes, they are met with scorn, often from their own family.\nSummary\n- Families tied to IS fighters are grappling with harsh realities in the wake of the caliphate's collapse.\n- Children of IS fighters frequently lack identity papers and endure social isolation.\n- Reintegrating into Iraqi society is nearly impossible, hindered by deep-rooted hostilities and financial obstacles.\nA dozen boys kick a football between tents stamped with the U.N. refugee agency's logo. The sun beats down, and the heat is oppressive, but the boys play on, watched by their amused sisters and cousins. Nearby, Ghazal Saha sits in the shade of a patched tent, her face weathered by years of hardship, framed by a black veil. The elderly woman has been the caregiver of her 20 grandchildren since her last sons were killed eight years ago.\nThe matriarch lives with her grandchildren in the Hassan Sham refugee camp in northern Iraq, around 30 kilometers east of Mosul. Her entire family has been ravaged by war. Five of her sons were killed in an airstrike during Mosul’s siege in 2016. The other three were arrested by Iraqi troops and Kurdish militias. It’s been so long that Saha has lost hope of seeing them again. They were all fighters for the Islamic State group.\nSince Mosul fell in 2017, the family has been living in tents, moving from one refugee camp to the next. Initially, they were placed in the Jidda camp, where families of IS fighters were rounded up. They later moved to Hassan Sham in semiautonomous Iraqi Kurdistan. «We've been here for more than four years. These children only have God and me to look after them,» sighs Saha, letting her prayer chain slide between her fingers.\nWithout identification papers, little help from the state\nBehind a curtain in their tent, five mattresses are stacked where the older boys sleep. Like many children born during the Islamist group's reign, Saha's grandchildren have no identity papers. Those born before 2014 lost their papers in the chaos of the battle for Mosul. «There is no ration card without identity papers. We therefore receive only our grandmother's ration every month,» explains 16-year-old Anas. This only gets them by for a few days and then they have to manage on their own, he adds.\nAnas’s cousin, Abdelaziz, 17, sits apart from the others on a plastic chair, glued to his phone. He doesn’t mix much with the other kids in the camp. While they gather to go swimming in the river, he prefers to stay in his tent. «Everyone here knows who we are. Some don’t care, others won’t speak to us,» says the young man, his eyes partly obscured by a mop of black hair as he scrolls through TikTok videos.\nWith no internet at home, he replays the same clips downloaded from the camp’s offices, where Wi-Fi is free. «This way I can see what’s happening outside the camp, in the rest of the world,» he says. He does not post anything himself; his profile remains empty. «I’m not a TikToker,» he says and smiles. «I just watch.»\nToo many enemies at home\nSecretly, the young man dreams of escape, of leaving behind the camp. «I want to become a farmer, work the land like my family always did,» he says softly. «But for that I have to go far away, somewhere where nobody knows me. Where no one knows my father.» Like other families in the camp connected to IS, Anas, Abdelaziz and their cousins know that they will never be able to return home. «We have too many enemies, even in our own family,» says Abdelaziz.\nGrandmother Saha adds: «My brother won’t let us come back. He and his sons fought against the Islamic State. For him, we are the embodiment of evil.» In a society haunted by the memories of the Islamist group's brutal reign, the orphans of the caliphate are struggling to find their place. For teenage boys especially, the risk of being killed in revenge for their fathers’ crimes is a constant threat in their home villages.\n«If we go back, they’ll kill Abdelaziz and Anas. That’s how it works – it’s blood for blood,» says Saha. Returning home would be possible only with the approval of clan leaders, but such permission often comes with a steep price. Thirty-seven-year-old Dallal Ali Khela, for example, would have to pay 800,000 dinars (around $616) to return with her daughters. «How am I supposed to raise the money?» she asks. She is currently raising her daughters Amal and Nur, aged 14 and 8, on her own.\nHer husband, an IS fighter, was killed in 2015. Like Saha, she lives in extreme poverty and relies on ration packs and the few vegetables she can grow in the small garden next to her tent. Unable to pay the bribes, her daughters remain marked by their father’s legacy. «I can’t protect my daughters the way a man would,» she admits.\nWiping away tears, Dallal recalls how her own brother stripped her daughters of their inheritance – a farm in the Nineveh Plains. «My own brother,» she laments. «He reported me to the authorities as an IS member and only withdrew the complaint on the condition that I forfeit any claim to the farm,» she says. «I am a woman. My clan has chosen not to protect us, so we are on our own.»\nFor many families, children are a burden\nIn Kabr al-Abd («Tomb of the Slave»), nearly a third of the men pledged allegiance to the black banner of IS in 2014. Kaysar was one of them. He died in 2016, leaving behind his wife and their three-month-old son, Azel. After Mosul was liberated, Kaysar’s widow found a new husband and abandoned Azel. «She found a man who was willing to marry her and left the child behind because it was too much of a burden,» says Um Kaysar, his grandmother, who is now raising him.\nAccording to Faisal Tarek Rashid, head of the orphanages and youth facilities in the province of Baghdad, this is not uncommon in Iraq. «Many families see children as an economic burden, but more than that, as a social liability,» he says. Children without family support are sent to orphanages. In Baghdad, three children of IS fighters are growing up behind the brightly painted walls of one such facility.\nThey are the sons of foreign fighters from Tajikistan, Uzbekistan and Turkey who were born in Iraq during the IS caliphate. Twelve-year-old Sahed, his hair neatly combed to one side, has only vague memories of his father. «I remember how the army surrounded our house. I saw my father killed. I wanted to get some water, but the soldiers took me away. I haven’t heard from my mother since,» he says quietly.\nIn the dormitory he shares with his friends, young Mohammed shows the drawings that fill his notebooks. When the adults praise him, a shy smile lights up his face as he flips through the pages. A social worker accompanying the visit explains that many of the children do not fully understand their histories. There have been problems. One child was beaten by two other boys whose parents had been killed by IS fighters.\nThe government has tried to repatriate children from Syria\nWar, violence and deprivation have left deep and lasting scars. «Post-traumatic stress, depression, isolation, aggression, anger,» says Sheila Khaled Arif, the director of the orphanage. «Last year, we had to transfer a family of seven to a special detention center in Karbala. We couldn't deal with the violence. They beat the other children, sang jihadi songs and even attacked a member of staff who wasn't wearing a veil.»\nEven now, thousands of orphans remain in camps like al-Hol in Syria, where the women and children of jihadis are held by Kurdish militias. Iraqi authorities refer to al-Hol as a «ticking time bomb,» with the children there seen as vulnerable to extremist indoctrination. Since May 2021, the Iraqi government has repatriated 8,199 of the roughly 30,000 Iraqis who were in the camp in Syria.\nUpon arrival in Iraq, many of these families are placed in a specialized camp in the Nineveh Plains. Some, however, return through private arrangements, often brokered by tribal leaders with implicit approval from the government. «They are usually relieved when they arrive, because the living conditions in Iraq are much better than in Syria,» says a young nurse in Mosul, who prefers to remain anonymous.\nThe young woman frequently travels with the semiofficial convoys from Syria and offers a tragic account of the children’s plight: «These children have been the main target of IS propaganda for years. They’re malnourished, sometimes violent and suffer from numerous traumas,» she says. Iraqi society remains conflicted over their fate, viewing them as either victims or potential threats.\nLingering grievances\n«The situation varies from child to child,» says Faisal Tarek Rashid, head of the province of Baghdad’s orphanages and camps for displaced persons. «Some are too young to remember IS, while others have lived under this ideology for years since the fall of Mosul.» The ideology of jihadism still lingers in parts of Iraq, and the grievances that led segments of the Sunni population to support IS a decade ago remain largely unresolved.\nIn Kabr al-Abd, most families have lost a son, a husband or a father to the caliphate. Today, no one in the village near Mosul openly declares allegiance to IS. However, the central government in Baghdad and the Shiite militias, which wield great influence in the state, are met with quiet hostility. At the same time, however, many of the inhabitants have not forgotten the suffering that IS has brought to the community and their families.\n«As long as I live, I will never again make the mistake of letting a child fall into the hands of these people,» says Um Kaysar with a sigh as she watches her 8-year-old grandson playing in the garden from the door of her house. «God willing, I would rather die than endure this pain again.»\nFor more articles in English, visit our homepage or sign up for our free newsletter.\nLatest articles\nBelow, you’ll find links to a selection of our free content. If you’d like access to all of our premium content via the full version of our newsletter, please upgrade here.\nGlobal reporting. Swiss-quality journalism.\nIn today’s increasingly polarized media market, the Switzerland-based NZZ offers a critical and fact-based outside view. We are not in the breaking-news business. We offer thoughtful, well-researched stories and analyses that go behind the headlines to explain relevant events in the U.S., in Europe and worldwide. To produce this work, the NZZ maintains an industry-leading network of expert reporters around the globe who work closely with our main newsroom in Zurich.\nSign up for our free newsletter or follow us on Twitter, Facebook or WhatsApp.",
  "word_count": 1853,
  "scraped_at": "2026-02-14T13:14:26.550627"
}