{
  "article_id": "1d20fcb4ce20",
  "url": "https://www.yahoo.com/entertainment/celebrity/articles/inside-patrick-mahomes-winning-love-120000399.html",
  "title": "Inside Patrick Mahome Winning Love Story With Brittany Mahomes",
  "date": "20250917T141500Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Inside Patrick Mahomes' Winning Love Story With Brittany Mahomes\nOriginally appeared on E! Online\nEven as a teen, Patrick Mahomes was making game-winning plays.\nYears before the Kansas City Chiefs quarterback—who announced he and wife Brittany Mahomes welcomed baby No. 3, daughter Golden Raye Mahomes in January—was leading his team to three Super Bowl victories, the three-sport Whitehouse High School athlete (a star QB, he also played basketball and baseball) was just another 18-year-old trying to dream up an Insta-worthy promposal for his cheerleader girlfriend of more than two years.\nHe'd done the whole scrawl-prom?-all-over-her-car thing for her senior year in 2013, \"SCARING the crap out of me,\" Brittany shared on her feed at the time. And he'd gone \"cute and simple\" with a cookie cake invite to his winter formal later that year. So for 2014's big dance, he landed on a golf theme, teeing up his ask with a homemade sign and enough balls to spell out his simple query.\nMadly in love, as evidenced by the number of times they used social media to brag on one another's accomplishments, the teens truly thought they had what it took to go the distance.\nMore from E! Online\nNever mind that he was set to lead the Texas Tech University Red Raiders, some 450 miles from where she was already playing soccer at the University of Texas-Tyler.\n\"This boy has my whole heart!\" the then-high schooler explained in one November 2013 snap. \"So freaking proud of youu! I love you so much!\"\nWhere countless idealistic college freshman have failed, Patrick and his high school sweetheart have sprinted to an easy victory.\nSome seven months after the Chiefs QB snagged his first world championship back in 2020, he turned up at Arrowhead Stadium to get his ring and give away another. \"On a day that was meant to celebrate you, you turned it into celebrating us,\" Brittany proclaimed of the Sept. 1 proposal that saw Patrick upgrading his teenage machinations to a plan more befitting his status as the NFL's new wunderkind.\nA lit-up marquee and a suite dripping with flowers and candlelight replaced handwritten signs and Mrs. Fields confections, while prom tickets were swapped out for an emerald-cut diamond with as many carats as they'd spent years together.\nMore in Sports\nBarcelona fans tear into several players amid Atlético disaster\nThe words he said forever etched in her mind, Brittany recounted how her forever teammate had created the perfect day: \"You took my entire breath away and I could not have imagined anything better.\"\nExcept maybe another little surprise that the now-30-year-olds—born just 17 days apart in 1995—had been growing. Their big reveal came exactly four weeks later when Brittany posted, \"Mom & Dad, taking a small detour to the wedding.\"\nAfter welcoming baby girl Sterling Skye Mahomes in February 2021, the couple temporarily put a pin in wedding planning, eventually marrying in Maui 13 months later. But by then, their future had been set for the better part of a decade.\nToasting to \"a lifetime\" with him on their seventh anniversary in March 2019, a full year and a half before their engagement, Brittany addressed those concerned about the slow pace they were taking to the altar. \"To everyone that's gonna ask when we are getting married,\" she said, \"the answer is whenever we want.\"\nBecause while the haters are gonna hate, hate, hate, these are two people who have become very adept at shaking it off.\n\"I think social media used to get to me a lot and now, honestly, I don't give a f--k what people have to say about me anymore,\" Brittany shared on an August 2024 episode of the Whoop podcast, crediting Patrick with supplying the necessary Xs and Os. \"I think he's helped me get to that point to where I'm strong in who I am, I'm confident in who I am, I'm confident in mine and his relationship. I'm confident in our life, so why does what other people say have to matter at all?\"\nBecause these two have been making winning plays for awhile now.\nBack in college, as Patrick was cementing his reputation as a gunslinger, becoming the Red Raiders' third leading passer in program history and topping the nation in total offense his final two years, his girlfriend was racking up her own victories on the pitch.\nSigning on to play soccer at the University of Texas satellite campus \"because it was close to home and I knew a few girls that played here that loved it and told me I need to join the family,\" Brittany scored a record-setting 18 goals her senior year, making her an exciting prospect for professional leagues worldwide.\nAnd so weeks after Patrick was selected 10th in the 2017 NFL draft, cutting his college career a year short, Brittany signed a contract of her own with Iceland's UMF Afturelding/Fram (\"I could never pass up such an amazing experience to go do what I love,\" she explained), leading local station KLTV to dub the then-21-year-olds \"the power couple of East Texas.\"\nAnd after a year navigating 3,000-plus miles worth of long distance that saw Brittany win a championship and Patrick secure his spot as the Chiefs' starting QB, they decided to stake their claim in western Missouri.\nJoining Patrick in his Kansas City digs, Brittany made use of her kinesiology degree, founding at-home workout brand Brittany Lynne Fitness.\nExplaining her transition away from professional sports, she said on her site, \"By the end of my first season, I truly began to fall in love with being in the gym more than being on the soccer field. Playing sports my whole life got me into fitness and playing in college taught me about strength training, wellness and maintaining peak fitness to perform at an elite level.\"\nShe's learned a bit about marketing as well. Between her Insta workouts, her partnership with clothing line Balance Athletica and a game day style that regularly earns her upwards of hundreds of thousands' worth of double-taps, she's built up a dedicated fanbase, one loyal enough to even give her pups Steel and Silver a follow.\nAnd while Patrick was putting together championship seasons, becoming the youngest Super Bowl MVP, signing record-breaking multimillion-dollar contracts and snapping up baseball teams, Brittany was making her own money moves, joining an ownership group that brought NWSL team Kansas City Current to their adopted city. (He invested as well in 2023.)\n\"I have a true level of appreciation for what these incredible women do on a daily basis,\" she said in a statement. \"We have the greatest fans and community here in KC and I can't wait to huddle around this team.\"\nFirst she had some business to take care of with her own squad.\nA month after he signed his 10-year, $477 million contract extension in 2020, Patrick plunked down cash on an 8-acre piece of land to build their dream home. Confident they'd put down roots, he explained in Netflix's Quarterback, \"I was like, 'I'm gonna be here, I might as well build the exact house I want.'\"\nFor the pair, who moved in shortly after his second Super Bowl win, that meant a massive pool, golf hole, a 50-yard football field and enough space for a growing family.\nTwo months after their Hawaii vows, Brittany and Patrick announced they were expecting a sibling for daughter Sterling. Son Bronze joined the squad in November 2022 and in July 2024, the fam revealed they were expanding the roster. \"Round three,\" Britanny wrote on Instagram of adding another daughter to the team, \"here we come.\"\nAs for a potential fourth quarter, Patrick told reporters during a Jan. 14 press conference, \"We'll see down the line, maybe. But my goal was always three. So, we've had three. And we'll stick there for a while and see if we need to come back and get another one late.\"\nEither way, the Mahomes' future has continued to appear bright.\nAs Patrick led his team on the field, Brittany has busied herself playing cheer captain alongside another familiar face. \"Twinning & Winning,\" Brittany captioned one Instagram with Taylor Swift who, in case you haven't heard, is engaged to the boy on the football team, Patrick's go-to tight end Travis Kelce.\nAnd while the Sports Illustrated swimsuit model hasn't won, say, 14 Grammys, she's certainly Patrick's MVP.\n\"She has her head on her shoulders the right way,\" Patrick told E! News in July 2023. \"She's my rock. She's the one that, through tough times, can get me through.\"\nTackling the role of quarterback in their family, she makes everything he does on the gridiron possible. As he told E!, \"Having someone that supports you every single day like I do is the reason that I am in the position that I am today.\"\nAs they both celebrate their milestone birthdays, let's relive all the victories they've enjoyed so far.\nHigh School Sweethearts\nA Growing Team\nHalloween Celebrations\nAn Extra Special Holiday Season\nSuper Bowl Sterling\nMet Gala Moments\nMother's Day Outing\nRed Carpet Ready\nThanksgiving Portrait\nChristmas Cuties",
  "word_count": 1519,
  "scraped_at": "2026-02-14T14:17:54.395737"
}