{
  "article_id": "1d2a4cdf92e8",
  "url": "https://www.nytimes.com/athletic/6102773/2025/02/02/rubiales-trial-hermoso-explained/",
  "title": "The Luis Rubiales trial explained : The kiss , the fallout , the accused and the key witnesses",
  "date": "20250202T063000Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "When the president of the Spanish Football Federation kissed one of his national team’s players after they had won the 2023 Women’s World Cup, it was a moment that stunned the wider world.\nFor the Spain forward Jenni Hermoso and her team-mates, that win should have been the highlight of their sporting lives. Spain had never won the Women’s World Cup before. Instead, their achievements were overshadowed by the behaviour of Luis Rubiales and those around him.\nAdvertisement\nIn the three weeks that followed, Hermoso was threatened with legal action by the Spanish Football Federation (RFEF), Rubiales resigned (eventually), the team’s head coach Jorge Vilda was sacked, and 81 Spanish players said they would refuse to represent their country.\nStarting on Monday, and across 13 days in court, Rubiales will stand trial for alleged sexual assault and coercion of Hermoso. He maintains that the kiss was consensual, while the prosecutors will argue the opposite and that attempts were made after the incident to force Hermoso into agreeing with him.\nAlso on trial are Vilda, the team’s World Cup-winning head coach, Albert Luque, the former sporting director of the Spain men’s team and a former Newcastle United forward, and Ruben Rivera, the former marketing director of the RFEF.\nProsecutors are asking for a two-and-a-half-year sentence for Rubiales (one year for the alleged sexual assault and 18 months for the alleged coercion) and 18 months for the three co-accused of coercion. All four have denied any wrongdoing.\nThe Athletic will be at Spain’s Audencia Nacional court in Madrid each day to report on proceedings.\nBefore it begins, here is a reminder of what happened, the fallout, the 18 months since, and everything we know about the upcoming trial…\nThe kiss and the hours afterwards\nAfter Spain beat England 1-0 on August 20, 2023, at Sydney’s Stadium Australia to win their country’s first Women’s World Cup, thanks to a goal by left-back Olga Carmona, the victorious players were presented with their medals by the FIFA president, Gianni Infantino.\nFurther along the podium stood Rubiales, who congratulated each Spain player as they passed.\nWhen Hermoso arrived, the pair appeared to share an embrace, with the federation president grabbing her head with his two hands, then kissing her on the lips.\nAdvertisement\nSoon afterwards, while watching a video of the kiss with her team-mates in an Instagram live broadcast, Hermoso said: “Yeah (it happened), but I didn’t like it, but what could I do? Look at me.”\nAlthough most Spanish media did not immediately process the gravity of what had happened, criticism of Rubiales’ actions mounted after the game — including from Spain’s then-equality minister (now member of European Parliament) Irene Montero, who described it on X as “sexual violence”.\nNo demos por hecho que dar un beso sin consentimiento es algo “que pasa”. Es una forma de violencia sexual que sufrimos las mujeres de forma cotidiana y hasta ahora invisible, y que no podemos normalizar. Es tarea de toda la sociedad. El consentimiento en el centro. Solo sí es sí\n— Irene Montero (@IreneMontero) August 20, 2023\nSpeaking on Spanish radio station Cadena Cope that night, Rubiales said the kiss had been “a peck between two friends celebrating” and those who criticised it were “idiots”, “losers” and “dickheads”.\nOn the same programme, Hermoso said: “I didn’t like it (but) it will just end up as an anecdote. The important thing is we are world champions.”\nThat night, the RFEF released a press statement that quoted Hermoso as saying, “It was a totally spontaneous mutual gesture amid the joy of winning a World Cup… nobody should bother more about a gesture of friendship and gratitude.”\nHowever, a source familiar with the situation, speaking anonymously to protect their position, told The Athletic at the time that Hermoso did not provide any such comment.\nThere was also widespread criticism of Rubiales appearing to grab his crotch in wild celebration just after the final whistle in the stadium’s VIP area alongside Spain’s Queen Letizia and her then-16-year-old daughter, Sofia.\nThe alleged coercion\nAfter the final, a party of 300 players, coaches, family members, federation staff, journalists, politicians and sponsors flew back to Madrid in a specially chartered plane.\nAdvertisement\nDuring that journey, Rubiales allegedly pressured Hermoso to make a joint statement saying the kiss had been consensual, her team-mates later said in the Netflix documentary The Kiss That Changed Spanish Football.\nVilda is accused of having approached Hermoso’s family on the plane, asking them to intervene with the player to help out Rubiales and suggesting there could be consequences for her career if she did not.\nDuring a stopover in Doha, Qatar, Rubiales recorded a video statement in which he did not mention Hermoso by name but said he “regretted” a “mistake” and “if there are people who felt hurt by this, I need to apologise”.\nHe also claimed that nobody in the Spain camp felt he had done anything wrong but that “it was something natural, normal”. He said he was “sure” those criticising him “will have their motives”.\nThe prosecution case against Luque relates to messages the former Newcastle striker sent to Hermoso and a friend, shown in the Netflix documentary, saying she should support Rubiales. He denied coercing Hermoso when he testified as a defendant in the Rubiales case in October 2023, according to several Spanish media reports, but admitted to having sent her messages.\nWhen the federation suspended Luque, he released a statement in April 2024 that did not deny having sent the messages but said, “I have not committed any unlawful act, either during the performance of my professional or private activities.”\nProsecutors maintain Rivera’s actions were part of the coercion Hermoso faced to change her story and support Rubiales’ version of events. In the Netflix doc, Hermoso says the RFEF’s then-marketing director told her to call the organisation’s integrity department to say “nothing” had happened. She says: “I didn’t want to, I didn’t know what I was signing”.\nAdvertisement\n“I never coerced (Hermoso),” Rivera told radio station Cadena SER that month. “I’d no reason to do so. This is a battle in a war which has nothing to do with me. I’m relaxed about the judicial process, as obviously I’m totally innocent.”\nThe fallout and Rubiales’ resignation\nAfter greeting the Spain team on their return to Madrid on August 22, Spain’s prime minister, Pedro Sanchez, suggested Rubiales should resign. The president of Liga F (the top division of women’s football in Spain), Beatriz Alvarez Mesa, said in an interview with Spanish public television station La 1 that his behaviour had been “unacceptable”.\nOn August 24, FIFA announced it had opened disciplinary proceedings against Rubiales for his behaviour after the final.\nAs the pressure built, many at the federation and in Spanish football generally assumed Rubiales had no option but to step down. Yet on August 25, he chaired an extraordinary session of the RFEF assembly at which he shouted five times “I will not resign” from the podium and referred to “a little peck” that had taken place after he had asked Hermoso for her consent.\nThis speech, which also called his critics “false feminists”, was given a standing ovation by many of those present — including Vilda and the head coach of the men’s national team, Luis de la Fuente, who later apologised and said he had been unable to control his emotions.\nRubiales did apologise for grabbing his crotch in celebration after the World Cup final but suggested he had done it in solidarity with Vilda after previous protests from Spain’s players.\n“I want to say sorry for an event which happened in the box,” Rubiales said. “I’m going to explain it, looking at Jorge Vilda. We’ve gone through a lot, they’ve wanted to do to you the same thing that now they’re doing to me. They’re trying to create a false discourse and turn it into reality.”\nEighty-one Spain women’s team players responded that afternoon with a letter, released via the players’ union FUTPro, saying they would not play again for the national team until the leadership of the RFEF changed.\nAdvertisement\nHermoso said in that statement: “Mr Luis Rubiales’ words explaining the unfortunate incident are categorically false and part of the manipulative culture he has generated. At no time did the conversation to which Rubiales refers to in his address take place, and, above all, was his kiss ever consensual.”\nThe RFEF responded with its own statement, sharing four images it said proved Rubiales’ version of the kiss, and threatening Hermoso with legal action if she did not stop spreading “lies” about what happened.\nThe following day, August 26, Rubiales was provisionally suspended from all football-related activities for 90 days by FIFA and ordered to refrain from contacting Hermoso.\nThe federation responded with two more statements. The first accepted the suspension while saying Rubiales would fight to prove his innocence. The second (which was soon removed) doubled down on its accusation that Hermoso had lied, accusing the player of “serious contradictions” in her account of events and claims she had been “abducted” by her union FUTPro and other interested parties who wanted Rubiales removed from his post.\nThe following Monday (August 28), Rubiales’ mother, Angeles Bejar, entered a church in her hometown of Motril to begin a hunger strike aimed at getting Hermoso to say she had given Rubiales consent to kiss her. After three days inside, Bejar was moved to Motril’s Santa Ana Hospital for medical treatment and that night, Rubiales went to the hospital to pick her up and bring her home.\nRubiales’ resignation came on September 10 during an interview with British journalist Piers Morgan in which he claimed to have already “apologised” for the “peck” with Hermoso. He claimed it was a “mutual act” and that he had asked for her consent in advance.\n“I’ve been through many processes, criminal as well, and nothing has ever stuck,” Rubiales told Morgan. “I’ve full faith that the truth will come out and everything will be fine.”\nAdvertisement\nThe legal proceedings\nSpanish prosecutors opened a sexual assault investigation into Rubiales on August 28, 2023. Hermoso gave testimony to prosecutors a few days later and soon filed an official legal complaint with the Audiencia Nacional (Spain’s national high court).\nThe prosecutors then began to gather evidence and receive more testimony, including speaking with Rubiales in October 2023 (when he denied any wrongdoing).\nIn January 2024, the Audiencia Nacional recommended that the case investigating Rubiales’ kiss go to trial, with Judge Francisco de Jorge saying there was evidence the kiss was “not consensual”.\nDe Jorge also ruled that there was sufficient evidence to proceed with coercion charges against Vilda, Rivera, and Luque given “indications of the existence of a concerted action (…) agreed with Rubiales (to) break the will of Jennifer Hermoso” by “getting her to agree to record a video in which said that the kiss had been consensual”.\nIn May, De Jorge ordered the opening of the trial, which begins on February 3, 2025, in Madrid.\nWhat do we know about the trial format?\nThis case at Audiencia Nacional will be held before a single judge, with no jury. Normally, trials at the Audiencia Nacional involve three magistrates, but due to the relative brevity of the possible sentence, there is only one. It has historically been used to try cases of grave seriousness and social impact — including organised crime, terrorism, drug trafficking and crimes against the Spanish crown. It has jurisdiction for this case as Rubiales’ alleged crimes were committed outside Spanish territory.\nTwenty-seven witnesses are set to be called to testify in front of Judge Jose Manuel Clemente over three weeks.\nHermoso (represented by Senn, Ferrero, Asociados Sports & Entertainment) will be the first witness called on February 3. She will attend personally, travelling from Mexico, where she plays for Liga MX Femenil club Tigres.\nAdvertisement\nDuring the trial, the judge will also hear evidence from current and former employees of the RFEF, including members of the communications teams and the current head coaches of the women’s team (Montse Tome, who was Vilda’s assistant) and the men’s team (De la Fuente).\nHermoso’s brother, Rafael, and team-mates from the national team are also set to testify. They include Misa Rodriguez, Irene Paredes, Alexia Putellas and Laia Codina.\nTwo of Rubiales’ daughters, Ana and Lucia, who attended the final and were on the flight home, are set to be called, too.\nFrom February 12, the four accused will be called to give evidence.\nWho is Hermoso and where is she now?\nHermoso is one of Spain’s most iconic players, not just for her on-pitch performances — she is the national team’s record scorer (57 goals, 19 ahead of Veronica Boquete in second) and second in their all-time appearances (123 games, four behind Alexia Putellas) — but also her role in driving the professionalisation of women’s football in Spain.\nShe has played for Tigres in Mexico since early 2024, but her career began at Atletico Madrid, where she played from 2004 to 2010. From there, she moved across the Spanish capital to Rayo Vallecano (2010-13) before a brief spell in Sweden with Tyreso. The bulk of her senior career has been spent at Barcelona, over two stints from 2014-17 and 2019-22. She has also played for Paris Saint-Germain and Pachuca — her first Mexican side, who she joined in 2022.\nShe has won seven league titles — one with Rayo Vallecano, five with Barca and another with Atletico Madrid — along with Barca’s first Women’s Champions League in 2021. She was the top scorer in Spain’s top division five times between 2016 and 2021.\nHermoso, Putellas and Paredes are three of the players who have had the most influence and weight in the Spain and Barca dressing rooms over the past decade. They have been with the national team for so long that they jokingly call each other “dinosaurs”. Hermoso is known for being a joker — she was the designated team DJ in Barca’s dressing room.\nSince winning the World Cup and the aftermath of that triumph, Hermoso has found some peace in Mexico, although the process has proved devastating and exhausting.\nAdvertisement\nShe has scored 10 goals in 36 matches for Tigres since signing for them at the end of 2023, winning the Campeon de Campeones title in July against Monterrey. She also helped Spain win the inaugural UEFA Women’s Nations League title last year. But she has not featured for the national team since October after being dropped from the squad in November.\nWhat else should we know about Rubiales?\nEven before the incident with Hermoso in August 2023, Rubiales’ presidency was already the focus of another investigation (not connected to the Hermoso case) by Spanish prosecutors known as ‘Operacion Brodie’.\nInvestigators confirmed they were looking at potential crimes including corruption, money laundering and misuse of federation funds between 2018 and 2023, potentially including the deal that took the Supercopa de Espana to Saudi Arabia, and construction work at the Estadio de la Cartuja in Sevilla, where the Spain team often play. Rubiales has always denied any wrongdoing and no charges have been brought.\nRubiales resigned from his position as vice president of European football’s governing body UEFA when he left the RFEF. In October 2023, FIFA banned him for three years from all football-related activities for his behaviour after the World Cup final.\nUnable to work in football, Rubiales has since been involved in a failed cryptocurrency project and some investments in the Dominican Republic. Last March, his residence in Granada was searched by Operacion Brodie investigators, as was the federation’s HQ at Las Rozas outside Madrid and Estadio de La Cartuja. In early April, he was detained and questioned by Spanish police, immediately after flying back from the Caribbean island, having been ordered to present himself by a judge.\n“I’ve suffered such a media beating that I cannot work in Spain, from football or anything else,” Rubiales told Spanish station La Sexta in April. “I’ve never taken a ‘mordida’ (a ‘bite’, an illegal commission).”\nWho are the other three accused?\nVilda had been part of the coaching setup for Spain’s women’s team since 2009 and enjoyed great success. He was appointed senior coach in 2015 and Rubiales made him the RFEF’s women’s sporting director in 2018.\nAdvertisement\nRubiales sided with Vilda when players complained before the 2023 World Cup and offered him a new €500,000-a-year contract in the wake of his “I will not resign” speech.\nAfter FIFA suspended Rubiales, Vilda criticised the “improper behaviour” of Rubiales, but did not step down as head coach even as 11 of the team’s other 13 staff resigned. He was sacked a fortnight later.\n“My conscience is clear: I’ve given 100 per cent over 17 years and I did not deserve my sacking,” Vilda said in an interview with the Spanish radio station Cadena Ser. “What hurts most is that my honour and behaviour are questioned.”\nA month after being fired by the RFEF, Vilda was hired by the Moroccan federation to be its women’s national coach and co-ordinator of its underage teams.\nDuring his playing career, Luque appeared for Real Mallorca, Deportivo La Coruna, Newcastle, Ajax and Malaga. He won 17 senior international caps for Spain and played at the 2002 World Cup and Euro 2004.\nAfter retirement, the Catalan worked as a TV pundit and was also an advisor to Rubiales, before becoming sporting director of the men’s national team in January 2023. Luque was also a shareholder (with Rubiales among others) in an olive oil company called GRX Export that has been investigated during Operacion Brodie.\nMarketing professional Rivera previously worked for Red Bull, Nestle and Coca-Cola before joining the Spanish Footballers Association (AFE) in 2016, when Rubiales was AFE president. He joined the federation after Rubiales became RFEF president two years later.\nLuque and Rivera remained in their roles until March 2024, when they were both suspended, and they were sacked a couple of months later after Judge De Jorge found “indications of the existence of a concerted action (…) agreed with Rubiales (to) break the will of Jennifer Hermoso” by “getting her to agree to record a video in which said that the kiss had been consensual”.\nAdvertisement\nHow soon will we know the verdict?\nAfter the testimony is heard, Judge Clemente could take days or weeks to return a verdict.\nThe prosecution is asking for a two-and-a-half-year sentence for Rubiales but he may not face incarceration if he is given a sentence of under two years. In Spain, if a sentence is less than two years then the defendant can usually pay damages and not be sent to prison if they do not have prior convictions.\nRubiales, Vilda, Luque and Rivera will have a chance to challenge any verdict at the Audiencia Nacional’s appeal court, and then potentially at Spain’s supreme court.\n(Additional reporting: Guillermo Rai, Laia Cervello Herrero)\n(Top photos: Getty Images; design: Eamonn Dalton)",
  "word_count": 3166,
  "scraped_at": "2026-02-14T12:53:18.994902"
}