{
  "article_id": "1d59b6a29dc7",
  "url": "https://www.90min.com/posts/leah-galton-all-i-want-is-to-play-in-the-champions-league-with-man-utd",
  "title": "Leah Galton : All I want is to play in the Champions League with Man Utd",
  "date": "20230207T181500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Leah Galton: All I want is to play in the Champions League with Man Utd\nManchester United have firmly established themselves as one of the WSL’s elite more than ever this season, seeking to break up the top three that has been unchanged since 2015.\nWith that would come Champions League football for the first time, the obvious next step for a club that has always wanted to be compete with the very best since reforming a senior squad less than five years ago and starting out in the second tier Women’s Championship.\nUnited made light work of the Championship in their maiden season, before immediately rising through the WSL and finishing fourth in the table behind Chelsea, Arsenal and Manchester City three years in a row.\nLeah Galton has been at United since day one, recruited for the original squad, and has been a huge part of the club’s progression during that time.\nWith Champions League football now becoming clearer on the horizon if United can maintain their form and performances levels from the first half of the season, the excitement becomes more real.\n“All I’ve ever wanted to do is just walk out to the [Champions League] theme tune onto the pitch. I think that would be a childhood dream ticked off if we could get there,” Galton tells 90min.\n“I’m just aiming for that goal. Obviously, it would be nice to play against other competition and see where our team stands against other great teams around the world.”\nUnited have already had a small taste of that kind of action, playing a pre-season tournament against Paris Saint-Germain and Bayern Munich last summer and beating the former.\nBut it has been no easy ride to get to this stage. Under the management of Casey Stoney, United finished just one point adrift of third place Arsenal in 2020/21, agonisingly close. A year later, they were again fourth under Marc Skinner, eventually pipped by Manchester City after slipping up away from home too many times - six points were lost from winning positions late on against Tottenham, Everton and West Ham, while late equalisers were also conceded against Arsenal and City.\nThe 2022/23 campaign has been different. United have already won away games they didn't last season - among them, beating Arsenal away in the WSL for the first time. They were disappointed to only draw at City, having never taken so much as an away point against them in the league before.\nThe mentality has changed and there is a winning mindeset that wasn’t there before.\n“I think this year we’ve just had a confidence about us,” Galton says. “I feel like the group of girls we have is solid and the new girls that came in this year were obviously a great addition to our team. We have depth now and we just feel a bit more confident going into big games and big weeks.”\nGalton describes herself as being left ‘really upset’ after the derby, a 1-1 draw at the Etihad Stadium in front of more than 40,000 fans. She scored United’s goal, before eventually City equalised.\nLeah Galton wears the new adidas X Speedportal, available from www.adidas.co.uk/football-shoes\n“Looking back at it now, it was a very equal game and it could have gone either way, definitely. But, in the moment, it just felt like the last 10 minutes we were on top and I felt like that was our chance to take three points and to give us a bit more of a gap,” the 28-year-old explains.\nGalton is excited to face City again later in the season as a result.\n“Last season, we would go into those games, like: ‘Let’s just not lose…let’s try and take a point’. That was kind of our mentality, whereas this year, it’s very much: ‘We’re going to win this game and we’re going to make sure we do it well’,” she says.\n“It’s just when you look at the table and see another contender in the top three, it’s the best feeling because that’s your team and you know you’ve built it from when it’s been going in the Championship below and, now, you’re up there with the bigger teams.\n“Now you know you’re taking points [off rivals] - you’re beating Arsenal, drawing against City. Obviously, we lost against Chelsea, but it’s just nice to be in the mix and I think we deservedly are. We’ve got a good enough squad to be up there and we just need to keep getting the three points and make sure we’re not slipping up on games that we should really be winning.”\nThere are a number of factors behind the progression at United. It wasn’t always the case, but this is now an experienced group of players, the core of whom have been together for a long time. Galton, along with the likes of Katie Zelem and Mary Earps are far from new to the WSL, but all three are playing arguably the best football of their careers right now.\n“We’ve played together for a while now so I think we have very good understanding of each other on the pitch and I definitely think that helps,” Galton explains.\n“More so between me and Zel because I’m nearer to her on the pitch, so I know when she’s going to go long, I know when she wants someone to feet. I think we have a very good understanding. Even with Mary, even though I’m not near the backline, I still have a good connection with her on long kicks and going for counters. Time has given us that added benefit.”\nUnited have famously had quite a settled team for most of the season. But it is the competition behind the scenes from a busy summer transfer window and further new faces in January that has served to keep the starters on their toes. “There is that bit of doubt in yourself thinking am I going to be good enough? But you have to then prove yourself on the pitch.”\nUnited players also thrive off a notoriously vocal fanbase that is starting to increasingly fill home stadium Leigh Sports Village and travels to away games in big numbers. Many players adore that level of support and Galton, who been assigned an infuriatingly catchy chant, is no exception.\n“To be fair, when I hear my chant, I do end up singing it…I wake up singing it in the morning, which is really bad, but it’s really catchy,” she jokes.\n“Vilde [Boe Risa]’s is a good one and Hayley Ladd’s is great because [the fans] just want 12 Hayley Ladds at the end of the song, which is the best thing for me.\n“I like all of them, to be fair, they’ve done well with the songs.\n“Just the turnout of fans is amazing. You hear them all game - they don’t stop for 90-plus minutes. I don’t know how they have a voice in the morning…they probably don’t, which is incredible that they come and do that. You hear every single person, even all the kids.”\nUnited sold enough tickets to open all four stands at Leigh for consecutive WSL home games against Chelsea and Liverpool either side of Christmas, which Galton admits gave her the ‘good goosebumps’ walking out onto the pitch and being surrounded by fans on all sides.\nEven more it makes her want to ‘win for my team in front of all these people’.\nIt is that drive to succeed and those wins that keep coming that will ultimately get Galton and United to where they dream of being.\nFor more from Jamie Spencer, follow him on Twitter!",
  "word_count": 1279,
  "scraped_at": "2026-02-14T12:21:30.411884"
}