{
  "article_id": "1d698f09cc30",
  "url": "https://953thebear.com/ixp/531/p/sec-approves-and-implements-injury-reports/",
  "title": "SEC Approves and Implements Injury Reports",
  "date": "20240829T234500Z",
  "domain": "953thebear.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "SEC Approves and Implements Injury Reports\nWe are less than six hours before the start of the SEC playing football games, and the conference has added one more wrinkle into the upcoming season.\nIt was previously reported that the SEC would likely implement mandatory injury reports for all teams ahead of the 2024 season. This is not a new idea, with conference officials bringing up the idea during Spring Meetings in Destin, Florida.\nThe idea was once again brought up during SEC Media Days in Dallas, Texas, and again following Alabama's first scrimmage.\nInjured players would be listed as either \"questionable\" or \"out\" depending on their injury status ahead of the game.\nWith less than six hours until two SEC teams begin playing, the SEC has officially approved and will move to enforce injury reports for the 2024 season, according to Pete Nakos of On3 Sports.\nArkansas will start its season on Thursday night against Arkansas at Pine-Bluff, and Missouri will start against Murray State on Thursday as well.\nThis rule will also affect baseball and men's and women's basketball, effective immediately.\nThe SEC is the second conference to enforce injury reports, with the Big 10 doing so in 2023. LSU and Florida both released injury reports last season and were the only SEC members to do so.\nThe original purpose for the injury reports was for gambling purposes, but coaches will now have another wrinkle to think about when game planning and trying to ensure other teams don't get a competitive advantage in game planning.\nIn the case of Alabama, three players would be listed on the injury report heading into week one. Jaeden Roberts, Jam Miller, and Jeremiah Alexander were all banged up during Fall Camp for Alabama.\nDuring the opening press conference on Monday for the game against Western Kentucky, head coach Kalen DeBoer mentioned that Miller and Roberts are expected to return to action against the Hilltoppers, while Alexander is \"close\" but would likely miss the first contest of the season.\nThe reports will be only for in-conference games for the SEC, according to Chase Goodbread of Tuscaloosa News.\nInjury reports will be released on Wednesday, Thursday, and Friday, designating players as available, probable, questionable, doubtful, and out.\nOn game day, another report will be released 90 minutes before kickoff, designating players as available, game-time decisions, or out.\nWyatt Fulton is the TIde 100.9 DME and Brand Manager, primarily covering Alabama Crimson Tide football and men's basketball. For more Crimson Tide coverage, follow Wyatt on X (Formerly known as Twitter) at @FultonW_.\nAlabama Football Fall Camp Practice 8.3.2024\nGallery Credit: Wyatt Fulton\nAlabama Football Fall Practice 8.1\nGallery Credit: Wyatt Fulton\nAlabama Fall Camp 7-31-24\nGallery Credit: Wyatt Fulton\nCrimson Tide's NFL Draft First-Rounders During Saban's Tenure\nGallery Credit: Jacob Harrison\nAlabama's 2024 A-Day\nGallery Credit: Wyatt Fulton\nAlabama's Final Four Loss to UConn\nGallery Credit: Wyatt Fulton",
  "word_count": 482,
  "scraped_at": "2026-02-14T13:30:53.565998"
}