{
  "article_id": "1d80705bace5",
  "url": "https://www.pedestrian.tv/news/mary-fowler-nathan-cleary-relationship-confirmed/",
  "title": "Mary Fowler & Nathan Cleary Confirms Relationship W / Paparazzi Pics",
  "date": "20231102T074500Z",
  "domain": "pedestrian.tv",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "After months and months of speculation, it has been sorta confirmed that Australia has a new sports power couple. Move over, Lleyton and Bec Hewitt, we’ve now got Mary Fowler and Nathan Cleary.\nPound that sizzling celeb couple alarm ‘cos it seems the Fowler and Cleary are together after the paparazzi managed to cop a couple of shots of the pair lounging around in the Perth sun.\nIn the photos, which were published by Daily Mail Australia, the Matildas forward can be seen getting cosy with the Penrith Panthers captain. In some pics, the pair were holding hands, and in others, they were just laying on the grass, basking in the rays.\nThe photos were posted a couple of days after the Matildas smashed the Philippines (ugh, it still hurts as a Filipina-Australian) in the Asian Olympic Qualifier with an 8-0 win. The Matildas continued to come out on top on Wednesday evening after the football stars defeated Chinese Taipei with a 3 – 0 win.\nIt was in this match that Fowler secured a complete screamer of a goal, landing her player of the match.\nRumours first swirled of a romance between Cleary and Fowler after the lads of the Hello Sport podcast, Thomas Birmingham and Eddy Simpson, claimed they saw a Sydney Morning Herald article about the sporty pair on an ice cream date.\n“They’re both sponsored by Adidas and could’ve been doing a function together but if you have an ice cream with someone, that’s saying something,” Birmingham said.\nSoon after that got sports fans amped up — keep in mind this was smack bang of the Tillies glory run at the 2023 Women’s World Cup — a source from Cleary’s camp told The Daily Telegraph that it was “just ice cream”.\nFair enough.\nUntil, a week later, another paparazzo shot of the pair walking across the Nepean River surfaced, with sources confirming it was Cleary and Fowler.\nIn early September, the Penrith Panthers captain attempted to shut down the rumours in an interview with News Corp.\n“It is what is, it’s a little bit annoying to not have a private life but I like to not talk about it too much and keep anything I can private,” Cleary said.\n“Things take off pretty quick with social media but I’ll try to keep a private life if I can.”\nAll was quiet for a while. Cleary managed to nab the NRL Premiership title for the third time in a row with his the Penrith Panthers and Fowler had returned to the UK to play for Manchester City in the Super League.\nBut it was a cheeky selfie in Perth that sparked the rumours again. Fans spotted the NRL player roaming around the Western Australian city during the Matildas Olympic Qualifiers, and of course, many assumed she was there to cheer on his gal.\nNeither Cleary nor Fowler have officially hard launched their relo on social media or beyond, but I think the pap shots are super obvious.\nAs much as Tillies fans hate this idea, I think they’re so cute, even though I loathe Cleary as a Parramatta Eels fan.\nWill be waiting for a proper IG hard launch. Stay tuned.\nImage source: Getty Images / Brendon Thorne & James Worsfold",
  "word_count": 544,
  "scraped_at": "2026-02-14T12:40:44.113564"
}