{
  "article_id": "1d937765802c",
  "url": "https://www.fcbarcelona.com/en/club/news/4153656/bihub-invest-in-rimbarlat-a-start-up-developing-therapies-to-accelerate-muscular-regeneration",
  "title": "BIHUB invest in Rimbarlat , a start - up developing therapies to accelerate muscular regeneration",
  "date": "20241022T131500Z",
  "domain": "fcbarcelona.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "BIHUB invest in Rimbarlat, a start-up developing therapies to accelerate muscular regeneration\n- label.aria.viber Viber\n- label.aria.whatsapp WhatsApp\n- label.aria.twitter Twitter\n- label.aria.facebook Facebook\n- label.aria.messenger Messenger\n- label.aria.link label.aria.tick Copy link\nThe Barça Innovation Hub (BIHUB) is taking another step in its program of investing in start-ups, becoming a shareholder in Rimbarlat, a company that is developing therapies that speeds up muscular regeneration in acute injuries for elite sportsmen and women.\nThe project will enter into a phase of clinical trials in the coming months thanks to the agreement with BIHUB as the scientific team for the study will be able to make use of the facilities at the Club's Medical Services as well as the help of its professionals.\nPotential reduction of up to 50% in recovery time\nThe new therapy has shown in the initial phases of the study to have promising potential and could bring a reduction of up to 50% in recovery time. From that base, Rimbarlat has developed a viable project that could become standard for professional sports clubs who are searching to shorten the recovery process for athletes following injury. The project caught the interest of BIHUB due to the value it can bring in regenerative therapy for FC Barcelona and for the world of football in general.\nRimbarlat was created in 2020 in Barcelona by Luis Santiago and Jorge Martín from La Coruña and the company is currently based in Cosymbio Labs in the Poblenou district of Barcelona. Dedicated to development and services in Technological Science and also research in the areas of biomedicine and physiology, the business bases its work on basic applied research projects focused on innovation.\nRimbarlat, seventh start-up for BIHUB\nRimbarlat is the seventh start-up to involve BIHUB after the announcement of similar initiatives with Visualfy, OLIVER, Onalabs, CeleBreak, Made of Genes and Fyxbody.\nVisualfy is a company that works to promote accessibility for the deaf and hard of hearing; OLIVER is a solution that makes data management accessible to grassroots sports clubs seeking to boost athletic performance; Onalabs is developing a device for measuring biometric parameters through sweat; CeleBreak is an application that brings together amateur footballers for matches, Made of Genes works in the area of molecular studies and personalised health; and Fyxbody provides solutions to create and plan training and recovery sessions.\nBarça, right at the forefront of innovation\nFor over a year now, the Barça Innovation Hub (BIHUB) has been successfully exploring a new strategic line to support entrepreneurial talent in the sports sector, which has materialised by becoming a shareholder of several start-ups that offer bold products and value services.\nThe main objective of these investments is to extend the club’s drive to innovate in an environment where emerging companies are able to adapt high-potential technologies and solutions much faster than large companies can. The club, in exchange, offers its main brand assets, its know-how and access to its athletes and facilities, thus forging new synergies with its stakeholders.\nThe new portfolio of start-ups that BIHUB is creating has positioned the club at the very forefront of the transformation of sport and has helped put the Barça name at the service of the diversification of the Catalan economic fabric. On a nationwide level, it is allowing Barcelona and Catalonia to develop an added-value economy that promotes local talent and also attracts global ones.\nStatement by Joan Laporta, president of FC Barcelona:\n\"Deepening our knowledge of recovery from muscular injuries is becoming a key focus for the FC Barcelona Medical Services faced with the ever-expanding sporting calendar. For that reason, the investment in Rimbarlat attempts to keep the Club at the forefront of research that should allow us to offer better and more efficient treatment to our athletes. We hope that this study can build on the positive results recorded in the initial phases and treatments can be developed that shorter recovery times in muscular injuries.\"\nStatement by Luis Santiago, CEO of Rimbarlat:\n“Myself and my partner Jorge Martín are delighted by this strategic alliance with FC Barcelona. We believe that the Club is firmly committed to deepening knowledge and supporting biotech business. We are convinced that the human and technical support that they bring will help us achieve our goals, which will being about a sea-change in sporting injuries.\"\n- label.aria.viber Viber\n- label.aria.whatsapp WhatsApp\n- label.aria.twitter Twitter\n- label.aria.facebook Facebook\n- label.aria.messenger Messenger\n- label.aria.link label.aria.tick Copy link",
  "word_count": 736,
  "scraped_at": "2026-02-14T12:53:03.513657"
}