{
  "article_id": "1d974fbe914c",
  "url": "https://www.winnipegfreepress.com/uncategorized/2025/05/01/michigan-state-athletic-director-alan-haller-leaving-tom-izzo-will-be-co-interim-ad",
  "title": "Michigan State athletic director Alan Haller leaving , Tom Izzo will be co - interim AD – Winnipeg Free Press",
  "date": "20250501T164500Z",
  "domain": "winnipegfreepress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Michigan State athletic director Alan Haller leaving, Tom Izzo will be co-interim AD\nAdvertisement\nEAST LANSING, Mich. (AP) — Michigan State athletic director Alan Haller is leaving the school and deputy athletic director Jennifer Smith and men's basketball coach Tom Izzo will serve as co-interim ADs, university president Kevin Guskiewicz announced Thursday.\nRead this article for free:\nor\nAlready have an account? Log in here »\nTo continue reading, please subscribe:\nMonthly Digital Subscription\n$1 per week for 24 weeks*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $4.00 plus GST every four weeks. After 24 weeks, price increases to the regular rate of $19.95 plus GST every four weeks. Offer available to new and qualified returning subscribers only. Cancel any time.\nMonthly Digital Subscription\n$4.99/week*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $19.95 plus GST every four weeks. Cancel any time.\nTo continue reading, please subscribe:\nAdd Free Press access to your Brandon Sun subscription for only an additional\n$1 for the first 4 weeks*\n*Your next subscription payment will increase by $1.00 and you will be charged $16.99 plus GST for four weeks. After four weeks, your payment will increase to $23.99 plus GST every four weeks.\nEAST LANSING, Mich. (AP) — Michigan State athletic director Alan Haller is leaving the school and deputy athletic director Jennifer Smith and men's basketball coach Tom Izzo will serve as co-interim ADs, university president Kevin Guskiewicz announced Thursday.\nRead unlimited articles for free today:\nor\nAlready have an account? Log in here »\nHey there, time traveller!\nThis article was published 01/05/2025 (289 days ago), so information in it may no longer be current.\nEAST LANSING, Mich. (AP) — Michigan State athletic director Alan Haller is leaving the school and deputy athletic director Jennifer Smith and men’s basketball coach Tom Izzo will serve as co-interim ADs, university president Kevin Guskiewicz announced Thursday.\nHaller’s last day will be May 11. Guskiewicz did not disclose the reason for Haller’s exit.\n“I’m grateful for Alan’s leadership since I joined the university and appreciate the success our programs have seen under his leadership,” Guskiewicz said in a statement. “He is deeply committed to this university and has led with honesty and integrity.”\nGuskiewicz said a national search would begin to find a successor to Haller, who was promoted from deputy athletic director in 2021.\nHaller played football and ran track at Michigan State and later worked 13 years in the school’s Department of Police and Public Safety. He joined the athletic department in 2010 and had a number of roles.\nUnder Haller, the Spartans won Big Ten championships in men’s basketball, women’s soccer, women’s gymnastics, men’s hockey and women’s cross country, as well as postseason appearances for several programs.\n“This is a pivotal time for college athletics, where innovation, effective communications and community engagement are more important than ever,” Guskiewicz said. “Our next athletic director will lead one of the nation’s more storied athletic programs, home to 23 varsity sports, a passionate fan base, a long legacy of academic and athletic excellence and, most importantly, an ambitious future.”\nHaller’s exit comes as Division I programs prepare for major changes in college athletics. Schools will be allowed to share up to $20.5 million in revenue with athletes beginning July 1, pending final approval of a multibillion-dollar antitrust settlement. The direct payments to athletes will be in addition to third-party name, image and likeness deals facilitated by school-affiliated collectives.\nMen’s basketball has continued to be the Spartans’ most successful revenue sport under Haller, with Izzo’s team winning the 2025 Big Ten regular-season championship and reaching the NCAA Elite Eight.\nFootball is in a three-year down cycle. The Spartans were 5-7 overall and 3-6 in the Big Ten last season, Jonathan Smith’s first, and they are projected to finish in the bottom half of the conference again this year.\nHaller earned high marks for his hiring of women’s basketball coach Robyn Fralick, who has led the Spartans to back-to-back 20-win seasons and NCAA Tournament appearances, and men’s hockey coach Adam Nightingale, whose program has swept Big Ten regular-season and tournament titles two straight years.\nIt has been a tumultuous decade for Michigan State athletics off the field of play. Haller was an associate athletic director when a female Michigan State graduate filed a complaint about disgraced sports doctor Larry Nassar’s sexual abuse in 2014. MSU agreed to pay $500 million to settle claims from more than 300 women and girls who said they were assaulted by Nassar, who is serving a life sentence in a federal prison.\nThree months into his tenure in 2021, Haller signed off on a $95 million, 10-year contract for football coach Mel Tucker. Two years later Tucker was fired after he was said to have sexually harassed activist and rape survivor Brenda Tracy during a phone call in April 2022.\nIn 2022, seven Michigan State football players were charged for their actions during a melee in Michigan Stadium’s tunnel after a loss to the Wolverines.\n___\nAP college sports: https://apnews.com/hub/college-sports",
  "word_count": 876,
  "scraped_at": "2026-02-14T14:17:16.747477"
}