{
  "article_id": "1d9ba9262091",
  "url": "https://www.abc.net.au/news/2023-10-28/sam-kerr-two-calf-injuries-during-world-cup/103035290",
  "title": "Matildas superstar Sam Kerr reveals she suffered two calf injuries during World Cup",
  "date": "20231028T060000Z",
  "domain": "abc.net.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Matildas superstar Sam Kerr reveals she suffered two calf injuries during World Cup\nMatildas superstar Sam Kerr has revealed she suffered a second calf injury during Australia's World Cup campaign, injuring her right leg in the third-place play-off defeat against Sweden.\nKey points:\n- The Matildas face the Philippines in Perth on Sunday afternoon\n- Sam Kerr says the country will present a tough test for Australia\n- The superstar also revealed she suffered a second calf injury during the World Cup\nKerr suffered a serious calf strain to her left leg prior to the start of the tournament, and sat out the Matildas' first three games before coming on as a substitute against Denmark.\nClearly impeded during the tournament, Kerr then injured her other calf in Australia's final game.\nThe second injury explains why Kerr has been eased into Chelsea's Super League campaign, and why Matildas coach Tony Gustavsson cautioned the Perth fans not to expect too much from the superstar during Australia's three Olympic qualifiers in the city.\nKerr managed to play half an hour in Australia's win over Iran on Thursday, and it appears she is still not ready for full minutes.\n\"I re-did my calf in the Sweden game, well not re-did it, did the other one,\" Kerr said.\n\"I was rehabbing that, and came back, and I've just had a bit of an icky run during the last two months.\n\"But I'm getting back to full fitness, enjoying being back on the park.\"\nKerr, who turned 30 last month, came on in the 65th minute with the Matildas 1-0 up against Iran on Thursday. Just 12 minutes later, she put the result beyond doubt with a simple finish.\nKerr said she was delighted to be playing in her home town for the first time in five years, and is looking forward to playing in front of a capacity crowd at Perth Stadium.\n\"It feels good, it's exciting, I love being back in Perth,\" she said.\n\"I've been nagging everyone to get some Perth games, so I'm glad it's finally happened.\n\"It was nice to score in front of the Perth fans to be honest, we haven't played here for a while.\"\nKerr said she had caught up with her family \"a little bit\", and was looking forward to get to the beach for recovery after the Philippines match on Sunday.\nShe said she had been blown away by how the Matildas' popularity had soared in recent months.\n\"We could have never imagined the support we would have had from the Australian public during the World Cup,\" she said.\n\"I think we kind of knew it would be big, but the support we got from everyone has been amazing.\n\"We gained so many football fans over the last two months.\"\nKerr said the Matildas were ready for the challenge of the Philippines, who she said would present the most formidable test in the run of Perth matches.\n\"They're a really good defensive team, they set up in a good block and it's hard to break down,\" she said.\n\"On the counter they're really strong.\n\"It was always the big one for us (the Philippines), this tournament.\n\"Everyone's really ready for tomorrow.\"",
  "word_count": 535,
  "scraped_at": "2026-02-14T12:17:03.374643"
}