{
  "article_id": "1dbac258d6a3",
  "url": "https://theprideoflondon.com/posts/chelsea-women-8-0-bristol-city-3-takeaways-reiten-thrusts-blues-back-into-title-race-01hx55hym97r",
  "title": "Chelsea 8 - 0 Bristol City : 3 takeaways , Reiten thrusts Blues back into title race",
  "date": "20240506T140000Z",
  "domain": "theprideoflondon.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "And just like that, Chelsea Women are back in the mix. Emma Hayes didn't seem to believe. Neither do we. Like the legendary New York Yankee Yogi Berra once said, 'It ain't over until it's over.' Well, boys and girls, it ain't over.\nWith the news of Arsenal's late magic trick as inspiration, Emma Hayes' West Londoners thrashed a helpless Bristol City team 8-0 for the club's largest league win since March 2022 to move right back into the thick of the Women's Super League title race.\nFrom deflation on Wednesday to elation on Sunday. It's been one remarkable stretch for Chelsea, a side that practically accepted the fact that it fumbled this last available piece of silverware.\nThe Norweigan Guro Reiten was involved in five of the eight goals as the Blues moved three points back of Manchester City with a game in hand. Its eight finishes propelled the four-time defending champions into a +1 advantage in the potential title-deciding category, goal difference. It was the second time in the last four meetings that CFCW managed to put eight or more past BCFC's defense.\nSimilar to that home sendoff last year in Kingston upon Thames for Pernille Harder, and Magdalena Eriksson, you could not have scripted it better for Fran Kirby, Maren Mjelde, and especially Hayes in the final home fixture of the 2023/24 campaign. While it wasn't the most convincing first 45 minutes, the Chels put their foot on the gas in the second and never removed it. The confidence was oozing out of the entire team as the passionate fans kept urging the team on to find as many goals as possible. It was quite the atmosphere, an environment that matched the occasion.\nFrancesca Bentley had a long day at the office between the Robins' sticks as eight of the home side's 15 second-half shots were on target. It was a straight-up clinic in the final third. A performance of champions, if you will. That's Hayes' Chelsea for you. They knew they needed some help, but once they got it, the Blues made no mistake.\n\"If you told me at the beginning of the day Arsenal would beat City in the last five minutes and we would win 8-0, what are the odds of that?\" Hayes described. \"That shows when you have belief. I said to the players if Man City slip up we have to be ready. Today was another opportunity to get closer to something that was slipping out of our grasp.\"\nWith Lauren James and Mayra Ramirez out of the team entirely, seven different West Londoners decided to contribute to at least one goal. Lauren Smith and Bristol created some promising opportunities going forward, but that final touch was always lacking.\nWhat a day it was for the club as a whole though. 13 goals in 180 minutes for the men and women combined on Sunday. Cross those fingers, and start praying to those football gods cause this run-in is shaping up to be a gripping one throughout the entire club.\nNow, with three points against Robert Vilahamn Tottenham, Chelsea will move even on points with the Citizens, setting up a Matchweek 22 to decide it all. Let's not get ahead of ourselves just yet. I say we continue to enjoy this one, at least right now. Here is a look at three things we took away from the drubbing of the Robins.",
  "word_count": 569,
  "scraped_at": "2026-02-14T12:41:51.824521"
}