{
  "article_id": "1dbc7e6b446d",
  "url": "https://www.rnz.co.nz/news/sport/563032/football-ferns-bounce-back-with-2-1-win-over-venezuela",
  "title": "Football Ferns bounce back with 2 - 1 win over Venezuela",
  "date": "20250603T224500Z",
  "domain": "rnz.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Football Ferns have bounced back by beating Venezuela 2-1 in their second international friendly in Spain as the side aims to build more competition for starting spots.\nThe South Americans, who are ranked 51st in the world, opened the scoring but New Zealand hit back through Milly Clegg before Jacqui Hand put them ahead in the 73rd minute.\nMidfielder Katie Kitching was happy with the improved performance from the Football Ferns, who are 32nd in the FIFA rankings.\n\"It was a tough match again they made it hard for us but we stuck to the game plan and came out with the win so really happy about that,\" Kitching said.\n\"We had lots of positives and lots of things to work on from the first game so we used the time we had off the pitch to work on it go through film work together and hopefully implement it today which we did.\"\nKitching was given the captain's arm band towards the end of the match.\n\"Yeah really special I didn't really expect Flea (Annalie Longo) to give it to me but yeah it was really nice to be captain even for a little bit.\"\nFootball Ferns coach Michael Mayne was disappointed with his side's 3-1 loss to Venezuela on Sunday and thought some of the individual performances weren't up to scratch.\n\"Obviously made a few changes based on that and I think the players that started the game got us on the front foot,\" Mayne said.\n\"Our reaction over the last few days to come in, work a little bit harder, be a bit braver with the ball ...we controlled good periods of that game so I'm 100 percent pleased with the reaction.\"\nMayne said building competition within the squad was important.\n\"I trusted the group that there was players that wanted to step in and have the opportunity so there's a number of players there that have done the work the last couple of days to I guess answer some questions I had in my head so they've trained really well, they've recovered really well.\n\"I think that was the biggest difference, is that competition, if a player doesn't perform there's going to be someone waiting in this team now ready to take their spot and so I just think that drives the performance so that's been the biggest shift.\"\nMayne, who is settling in after his appointment to lead the team for the 2027 World Cup, said they were getting a lot out of their tours.\n\"I'm working the players pretty hard, these tours ... we're looking at different ways to work, there's a number of things we trialled this tour around our trainings and structure so the players are responding to that ...the buy-in has been top class.\"",
  "word_count": 463,
  "scraped_at": "2026-02-14T12:35:58.216567"
}