{
  "article_id": "1df54c85e504",
  "url": "https://greatbendpost.com/posts/2dc83cc3-efad-4161-a129-3cca40b28cf5",
  "title": "College baseball future may see greater imbalance in competition , high school prospects squeezed out",
  "date": "20250219T230000Z",
  "domain": "greatbendpost.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Division I baseball season is less than a week old, and coaches already are planning for 2026 when it's all but certain scholarship limits will be removed, rosters downsized and players will have opportunities to make more money.\nThey expect the fallout to be fewer opportunities for high school recruits at the top level of the sport, especially if the NCAA adopts a proposal that would extend eligibility from four to five years. They also predict a greater imbalance in competition.\nAll is contingent on a federal judge approving the settlement of antitrust allegations against the NCAA and the nation’s biggest conferences. A hearing is set for April 7 and changes would go into effect July 1, a few days after the baseball season.\nThe framework for baseball would cap rosters at 34 with no scholarship limit for schools that opt in to the revenue-sharing model tied to the so-called House settlement. Currently there’s a 40-man limit during the season and a maximum of 11.7 scholarships that can be spread among up to 32 players.\n“I still think the majority of teams are going to be giving partial scholarships to at least part of their roster,” Nebraska coach Will Bolt said. “Reading the tea leaves, it doesn’t look like anyone is going to come up with 34 fulls.”\nNo change in power structure\nAuburn athletic director John Cohen, previously head coach at Mississippi State and Kentucky, doubted the new rules would shake up college baseball's power structure. Only about half of the more than 300 Division I programs currently award 11.7 scholarships, and many of the ones that do could at least double that number next year. Programs that don't award 11.7 now still might struggle to offer that many going forward.\nWith just a handful of programs generating a profit, financial constraints preclude big scholarship increases at most schools without additional fundraising. Even for schools where increasing scholarships is feasible, Title IX guidelines requiring proportional opportunities for men and women would have to be considered.\nThe House settlement also would allow athletic departments to share up to $20.5 million in revenue among athletes across all sports starting next school year. Football and men's basketball players would be expected to receive the lion's share. How much is available to baseball players likely would be a fraction of what athletes in revenue-producing sports get and could amount to little or nothing for programs outside the Power Four.\nModest NIL earnings for most\nMost players now receive partial scholarships and try to capitalize on opportunities allowing them to make money on their name, image and likeness. According to Opendorse's 2024 annual report, the top 25-earning baseball players could expect to make just under $48,000 per year, based on deals tracked by the NIL platform from 2021-24.\nCohen said that figure seemed low.\n“What I know about NIL currently is there is no accurate way to illustrate who’s doing what,” he said, “so it’s hard to speak intelligently about NIL because what you’re relying on is third-party information. You hear things and you just aren’t sure what to believe.”\nClemson coach Erik Bakich said he thought the $48,000 figure seemed high. Either way, he said, NIL money is not lucrative for the vast majority of baseball players.\n“The majority of NIL in college baseball has been about paying your bills, not play for pay,” Bakich said. “College baseball players are using NIL dollars to pay for cost of attendance. I’m for anything that reduces out-of-pocket cost for parents and anything that eliminates the need for any college kid to take out any type of loan debt.”\nCoaches said an often-overlooked consequence of roster reductions would be the squeeze it puts on high school prospects, especially at the top end of Division I.\nBolt, the Nebraska coach, said he had honest and difficult conversations with some of his players last fall about where they fit in and whether they should consider transferring, perhaps to a lower division. Bolt typically has carried 45 or 50 players in the fall. The NCAA fall roster limit remains fluid but coaches have recommended it be 38 with the cutdown to 34 on Dec. 1.\nBolt said it takes the typical freshman about three semesters to show whether he can be successful in Division I. The window of opportunity probably will shrink after this year.\n“Unless you’re a top-100 (high school) prospect or unless you’re turning down significant money in the draft to go to college and it’s a no-brainer you can play at the Division I level as a freshman, the junior college route does become a very desirable option,\" Bolt said.\nOlder players stick around\nThe shortening of the Major League Baseball amateur draft from 40 rounds to 20 beginning in 2021 has kept more players in college longer. The transfer portal has allowed teams to fill immediate needs rather than roll the dice with young players. And teams would get older yet if there's passage of a proposal now under consideration to extend athlete eligibility from four to five competitive seasons.\nThere also is some question about how junior college years will be counted against NCAA eligibility following the federal court injunction that gave Vanderbilt football player Diego Pavia an extra season after he argued his junior college years limited his ability to capitalize on NIL.\nOregon State coach Mitch Canham said all those factors mean promising high school players who don't project to be an immediate starting position player or key member of the pitching staff will be passed over in coming years.\n“With a roster of 34, you don’t have room to keep a whole bunch of guys around to develop, which is tough because that’s something we’ve done a lot of,” Canham said. “It's almost as if, am I going to trust an 18-year-old who has never played Division I baseball to come in and do this? You better make sure. Or are you going to get a 21-year-old (transfer) who has hundreds of at-bats and experience against older competition?”",
  "word_count": 1008,
  "scraped_at": "2026-02-14T13:19:18.416008"
}