{
  "article_id": "1df9f38e9736",
  "url": "https://995qyk.com/2024/02/28/season-4-ted-lasso/",
  "title": "Will There Be A Season 4 of Ted Lasso ? ",
  "date": "20240229T160000Z",
  "domain": "995qyk.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Will There Be A Season 4 of Ted Lasso? Cast Gives Mixed Answers\nOne of America’s favorite sitcoms is getting some attention again with rumors of a possible season 4 reboot. The Ted Lasso cast was stirring things up at the SAG Awards…\nOne of America's favorite sitcoms is getting some attention again with rumors of a possible season 4 reboot. The Ted Lasso cast was stirring things up at the SAG Awards on Sunday, February 25. The show's stars, Jason Sudeikis, Hannah Waddingham, Juno Temple, Brendan Hunt, and others all wore matching AFC tracksuits at the SAG Awards after-party. Many were speculating it was because this would be their last award show together as a cast. But some cast members kept the hope alive of a possible season 4 of Ted Lasso during some red-carpet interviews. Nothing has been confirmed or denied by Apple TV, yet. For now, all Ted Lasso fans can do is wait and \"believe\"...\nIn the pre-award show interview with Laverne Cox and E! News, she asked Sudeikis if we could see more of Ted in the future. To which Sudeikis replied, \"I'm not sure if I am the only one to ask.\" Co-star Brendan Hunt then chimed in and said \"I have a mortgage now\" (because of the success of the show). \"Now we have to figure out what to do with those mortgages,\" Sudeikis joked.\nAnother Ted Lasso star who wasn't afraid to drop any season 4 hints at the 2024 SAG Awards is Juno Temple. The star, who portrays Keely Jones, said in an interview with Extra TV that \"no one has been officially told no, and no one has been officially told yes\". Temple also said that even if season 4 doesn't happen, she's open to the possibility of a spin-off series.\nMore Ted Lasso Season 4 Rumors...\nThe rumors of a season 4 of Ted Lasso started around November last year when cast member Nick Mohammed shared this Tweet. Hard to believe that Apple TV producers wouldn't have something up their sleeve if they let this slide.\nBut wait, the rumor mill still hasn't stopped spinning. Phil Dunster, aka Jamie Tartt, added fuel to the fire in an interview with People during the 75th Emmy Awards. When asked about the third season being the last season, PureWow reported that Dunster responded with \"Well, if it is the final season\". And like the answers from his co-stars, he clarified to say, \"We just don't know (yet).\"\nWhat Could Happen In Season 4?\nDie hard Ted Lasso fans hang on to hope for a possible reboot with a line from Rebecca: \"It’s that I refuse to accept that you’re not coming back.\" In the final episode, we see Ted at home coaching his son's soccer, err football, team. Roy Kent has taken over AFC Richmond's head coach role. And Keely comes to Rebecca with the idea of starting a Richmond women's team. Even if Sudeikis doesn't come back as the main star of the show, certainly, there is plenty of room for cameo scenes or other spin-off ideas. Only time will tell...\n‘Ted Lasso’ Finale: Where Do The Characters Go From Here?\nAfter three seasons, Apple TV's Ted Lasso ended after dropping its series finale yesterday (May 31). The producers have always said that it will end after three seasons. Jason Sudeikis, who stars as the title character, developed the series with Bill Lawrence, Brendan Hunt (who plays Coach Beard) and Joe Kelly, told Deadline that, \"This is the end of this story that we wanted to tell, that we were hoping to tell, that we loved to tell.\" But Sudeikis and his team have expressed being open to spinoffs. And surely Apple TV would love to continue the stories of at least some of the characters. On the other hand, Apple is a company that prides itself in innovation. Many streamers put a lot of work into bringing back old characters (Disney+ mostly lives off of new stories in the Marvel and Star Wars universes, Paramount+ has done well by spinning off The Good Fight from The Good Wife and preserving the Star Trek universe). But Apple is a company that the iPod revolutionized; and when the iPod became obsolete, they quietly said goodbye to it.\nOn the one hand, the finale neatly wrapped up the most compelling storylines. It may not have been perfect, but neither is life - that's sort of Ted Lasso's message. But unless you're a troll, it was a pretty satisfying ending. They nailed the landing in a way that few series have. On the other hand, they certainly left room for more stories to be told.\nSo we thought it would be fun to look at where our characters ended up, and how their stories can continue in potential spinoffs or specials. It should go without saying but we'll say it anyway: There are spoilers ahead, so don't read this unless you've finished the series.\nAFC Richmond Women's Team?\nThe final moments of the finale gave us a thread that could easily be spun into an entirely new show. Keeley (Juno Temple) suggests starting a team in the women's league and clearly Rebecca (Hannah Waddingham) loves it. It would also give the writers an entirely new cast of players to play with (and hey, maybe they'll add more women to the writers' room).\nColin Hughes\nA compelling storyline this season had Colin (Billy Harris) struggling with coming out of the closet and ultimately sharing his truth with his teammates, who had no problem with it, although Isaac McAdoo (Kola Bokinni) seemed annoyed that he kept it a secret for so long. It's surely a storyline that many LGBTQ athletes can relate to. At the time, he said he was only going to share his truth with his team, but he kissed his boyfriend Michael (Sam Liu) on the pitch after the game. It would be interesting to see how Colin's story progresses.\nNate and Jade\nNate \"The Great\" (Nick Mohammed) seemed to lose himself this season, as he left Richmond to be the manager of rival team West Ham United. He was brought back to earth by his new girlfriend Jade (Edyta Budnik) who neither knew nor cared about his football career. He rejoined Richmond as a \"kit man,\" but it seems likely that he'll be promoted to his former post as assistant coach by their new manager...\nRoy Kent\nFirst he asked to join the \"Diamond Dogs\" (pretty surprising) and then he was named team manager, replacing Ted (not surprising, and much deserved). Roy is a fascinating character and it would be interesting to see how he handles the job.\nRebecca Welton\nWe loved episode six (\"Sunflowers\"), the episode where the team had a night out in Amsterdam. Rebecca spent a lovely night with a great dude on his houseboat. He was played by Dutch actor Matteo van der Grijn; we never learned his name, as he and Rebecca never told each other their names. There was no sex, just dinner and conversation and a sweet goodbye. Of course, they had a very \"rom com\" encounter in the last minutes of the episode where we meet his daughter. She introduces herself \"I'm Rebecca.\" It would be interesting to see how that relationship progresses, and we catch a glimpse of the three of them together at Higgins' barbecue. But really, it's such a perfect ending for her, we almost don't want to know any more details.\nSam Obisanya\nWe loved Sam Obisanya (Toheeb Jimoh)'s storyline and we hope that his restaurant becomes a huge success. We also hope he and chef Simi (Precious Mustapha) get together!\nJamie Tartt\nThe relationship between Roy and Jamie Tartt (Phil Dunster) has been one of the show's most interesting storylines. It took a wild turn in the finale when they actually fought (off screen) over Keeley, before \"allowing\" her to decide which of them she wanted to be with. That discussion happened off-camera as well, but we saw the final result: she showed them to the door. But she's still working for the team, Roy is the coach and Jamie is the team's star, so there's surely still some drama there. By the way, when the \"Diamond Dogs\" had their conversation in the finale about whether or not people can change, Jamie (and Rebecca) are the best examples of characters who did change quite a bit. Note that Jamie passed the ball often in the final game. He's a different person and a different player than he was in season one.\nCoach Beard\nWe finally learned Coach Beard (Brendan Hunt)'s real name: Willis. Actually, Ted Lasso addressed him as such in an earlier episode, saying \"What are you talking about Willis?\" But Ted being Ted, most of us assumed this was a pop culture reference to \"Different Strokes.\" Now we know that his name actually is Willis. And Willis is committed to his wild relationship with Jane Payne (Phoebe Walsh). She's pregnant and they got married at Stonehenge. Weirdly, Ted wasn't there. You'd think he could have returned to England for that! And Beard is still working as a coach, underneath Roy Kent.\nKeeley Jones\nAs hesitant as we are about the idea of spinoffs, a show focusing on Keeley (Juno Temple) where we catch glimpses of Rebecca, Roy, Jamie, etc., might be a lot of fun. While her arc in season three was kind of weird, she's still an awesome character with a lot of heart.\nTrent Crimm\nTrent Crimm (James Lance)'s story seems pretty complete, his book is out, and it's a success. It's hard to imagine what else they could do with him. Although he could write an unauthorized book on Rupert Mannion (Anthony Head).\nAFC Richmond\nWe're glad that 'Ted Lasso' wrapped up while it was still great. That said, there seemed to be so many interesting stories to be told about all of the AFC Richmond players and we applaud the writers for doing their best to get us invested in so many members of the team.\nDr. Sharon Fieldstone\nIn another offscreen development, somehow Dr. Sharon Fieldstone (Sarah Niles) was convinced to return to the team. And wouldn't you know it, Roy Kent has now agreed to counseling. See, people CAN change!\nTed Lasso\nIf we can make a pop culture reference that Ted may or may not appreciate, we're glad that the Avengers series continues in the Marvel Cinematic Universe, even though their heart and soul, Steve Rogers (Chris Evans) and Tony Stark (Robert Downey Jr.) are no longer with them. Tony, of course, is dead. But an elderly Steve is still with us. But his story ended perfectly in \"Avengers: Endgame.\" Contriving some reason for us to see him again would cheapen that ending. The same is true here: Ted's story ended perfectly. We don't know if he will get back together with Michelle (Andrea Anders) but we know they're going to give it a shot. That's all we really need to know. The last scene of Ted coaching Henry's (Gus Turner) soccer game, with Michelle on the sidelines was perfect. At the very least she seems to have dumped Dr. Jacob (Mike O’Gorman) -- a guy with questionable ethics in the first place: he was Ted and Michelle's therapist and later became her boyfriend.",
  "word_count": 1894,
  "scraped_at": "2026-02-14T12:17:19.300193"
}