{
  "article_id": "1e2e9123846e",
  "url": "https://www.90min.com/features/tottenham-wait-silverware-rumbles-on-progress-cannot-be-ignored",
  "title": "Tottenham wait for silverware rumbles on but progress cannot be ignored",
  "date": "20240513T211500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Tottenham’s wait for silverware rumbles on but progress cannot be ignored\n- Manchester United won the 2024 Women’s FA Cup final with a 4-0 win over Tottenham\n- Spurs have enjoyed an impressive season under Robert Vilahamn but it has ultimately ended in heartbreak\n- Ella Toone, Rachel Williams & Lucia Garcia were among the goals for United\nAt the start of the 2023/24 season, few could have predicted Tottenham Hotspur would be 90 minutes away from their first piece of major silverware in the women’s game.\nAfter three comfortable mid-table finishes in their first few seasons in the Women’s Super League, Spurs found themselves in the thick of a relegation battle last term. As a result, in March last year, previous manager Rehanne Skinner was sacked after her side suffered nine straight defeats in the WSL.\nVicky Jepson took charge on an interim basis until the end of the campaign, steering the Lilywhites to safety as Reading were the side to ultimately succumb to the drop. The January arrival of Bethany England significantly aided Spurs’ chances of survival, but they sailed far too close to the wind for the club and supporter’s liking.\nAs a result, the summer incited plenty of change, including the appointment of former BK Hacken coach Robert Vilahamn. Shrewd recruitment and the introduction of an exciting style of play that offers the players greater freedom propelled the club to new heights this term - culminating in their first ever Women’s FA Cup final.\nIn Manchester United, however, Spurs faced a team they have never beaten before. In their previous 12 meetings, the Red Devils had won 10 of those games, drawing only twice.\nA 4-0 loss against United in December was very nearly rectified only a matter of weeks ago when Vilahamn’s side snatched points off them for the first time since 2021 with a 2-2 draw at Leigh Sports Village. Spurs came from behind to lead 2-1, before a stoppage time goal from Maya Le Tissier meant things ended all square.\nThe result would have given Spurs plenty of optimism to cause an upset in the final. Despite being underdogs, they’d also knocked out Manchester City en route to Wembley and other WSL opposition in Leicester City.\nAll Spurs lacked heading into Sunday’s showpiece under the Wembley arch was experience and that proved to be decisive on the day.\nUnited had been there just 12 months previous. They’d already experienced the heartbreak of losing a final when they were overcome 1-0 by Sam Kerr and Chelsea.\nDetermined not to suffer the same fate this time around, it didn’t take United long to gain full control of proceedings over the weekend. After a flurry of missed chances, the Red Devils ended the first half with a one-goal advantage, courtesy of an outrageous Ella Toone strike.\nRachel Williams made it two shortly after the break and a brace from the player of the match, Lucia Garcia, shattered Spurs’ hearts and ensured the trophy would be heading to Manchester. Once Vilahamn’s side were knocked down, it’s clear they didn’t have the know-how or belief to turn things around in circumstances where the stakes were so high.\nHowever, a 4-0 thumping at the hands of one of the newly-established WSL elites shouldn’t take anything away from the progress made by the club this season. If anything, Spurs are ahead of schedule and if they continue on this upward trajectory, it shouldn’t be long before they find themselves within touching distance of silverware once again.\nThe Lilywhites have been warned by the previous rise and fall of teams in and around them in the WSL. They themselves have fallen victim to the growing competitiveness of the division when they found themselves toying with relegation a mere 12 months ago.\nMaintaining pace is easier said than done and much will depend on this summer’s recruitment. Player of the season nominee, Grace Clinton, is only on loan at Spurs and Vilahamn must ensure they keep investing in the right players if they're to continue to compete.\nThe Spurs boss insisted post-match his side will learn from the defeat, while captain England insists the scoreline doesn’t reflect the team’s season and there is still plenty to be proud of.\n“We’re going to have to pick ourselves up as we’ve got a game again on Wednesday,” she told reporters. “Man Utd have experience and they showed that today.\n“We can be proud of getting there [to the final]. I think everyone wrote us off even getting here and we’ve gone from a relegation battle last season to an FA Cup final. I'm proud of the team for what we've done this season and how we've fought.\n“Unfortunately, we ran out of fight today.”\nBut, it is the defiant words of the manager that should lift the spirits of supporters in the wake of such a heartbreaking defeat. While it’s hard to escape the reminder of just how close they were to doing something no other Tottenham team, men or women, have done in 16 years - this feels like the start of something.\n“If you remove the feelings today and summarise this next week, you know we’re going to be quite happy with an FA Cup final and sixth place in the league,\" Vilahamn said in his post-match press conference. “We have had a great season and we keep building.\n“This is not the end, this is just the beginning.”",
  "word_count": 907,
  "scraped_at": "2026-02-14T12:57:31.225765"
}