{
  "article_id": "1e3216890822",
  "url": "https://www.abccolumbia.com/2023/12/12/uscs-marcus-lattimore-clemsons-lucas-glover-headline-the-south-carolina-athletic-hall-of-fames-class-of-2024/",
  "title": "USC Marcus Lattimore , Clemson Lucas Glover headline the South Carolina Athletic Hall of Fame Class of 2024",
  "date": "20231213T011500Z",
  "domain": "abccolumbia.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "USC’s Marcus Lattimore, Clemson’s Lucas Glover headline the South Carolina Athletic Hall of Fame’s Class of 2024\nCOLUMBIA, S.C. (Dec. 12, 2023) – University of South Carolina running back Marcus Lattimore of Duncan, Clemson University golfer Lucas Glover of Greenville and University of North Carolina’s Ivory Latta of McConnells highlight the 10-member South Carolina Athletic Hall of Fame’s induction Class of 2024.\nAlso being enshrined include former NBA standout and coach Clifford Ray of Union, Coastal Carolina quarterback Tyler Thigpen of Winnsboro, S.C. State football coach Oree Banks, College of Charleston and North Charleston basketball star Anthony Johnson, Clemson baseball coach Jack Leggett, Chester and Harvard basketball great Allison Feaster and Columbia basketball legend William Partlow.\nThey represent the largest class of inductees for the South Carolina Athletic Hall of Fame, which had its first induction in 1960.\n“Once again, we have another impressive class that will be enshrined in our state’s hall of fame in May,” said Executive Director Andy Solomon. “Our nominating committee has a most difficult challenge annually, and this year was no exception. They created a competitive ballot from more than 200 names and the best rose to the top. We are thrilled with the tremendous individuals who create the Class of ’24.\n“I’m personally excited that eight of the 10 inductees are from the Palmetto State,” he added.\nThe South Carolina Athletic Hall of Fame’s Induction Banquet honoring the class of 2024 is set for Monday, May 20, at the Columbia Metropolitan Convention Center. The 10 individuals will be forever enshrined with the state’s highest athletic honor.\nThe SCAHOF Banquet is the largest annual celebration of Palmetto State sports stars under one roof. The tradition of recognizing past inductees, the “Walk of Legends,” is one of the event’s highlights. The affair, which includes a reception and dinner, begins at 5:30 p.m. Tables of eight may be purchased online at https://www.scahof.com/\nOree Banks\nOree Banks had an illustrious career that spanned over 30 years as a coach and athletic administrator. His career included football head coaching stints at S.C. State and West Virginia State where he posted a 15-year overall record of 76-63-3.\nBanks went 44-27-2 in eight seasons at S.C. State (1965-72) and was named the SIAC Coach of the Year in 1965. He compiled a 34-9 record (.784 pct.) in his first five seasons as Bulldog coach and during that span, was ranked 4th nationally in winning percentage among active coaches in the college division. He had a 32-36-2 record over seven seasons at West Virginia State (1977-83).\nIn addition, Banks served as head coach of the inaugural East-West Black All-Star Classic played at the Houston Astrodome in 1971.\nBanks was an assistant under some of the nation’s most recognized coaches, including Grambling State’s Eddie Robinson (1964-65) and South Carolina’s Paul Dietzel (1973-74), where he became the first full-time African-American coach in Gamecock football history. He also had assistant coaching tenures at Virginia (1975), Wisconsin (1976) and Marshall (1986-89).\nWhile at WVSU, he was appointed to the Board of the American Football Coaches Association (AFCA), which made him the third African-American coach to serve in this capacity behind Eddie Robinson and Florida A&M’s Jack Gaither.\nHe is a member of the NAIA Hall of Fame and evolved as an advocate for African-American coaches in assisting them with high profile jobs and careers. He most recently has been involved in working as a drug and alcohol speaker, visiting with hundreds of college athletes about drug and alcohol abuse.\nAllison Feaster\nAllison Feaster was born in Chester, attended Chester High and graduated from Harvard University with a degree in economics. In her senior year at Harvard, she and her Crimson teammates became the first No. 16 seed in the history of the NCAA men’s or women’s Division I basketball tournament to knock off a No. 1 seed in the first round, defeating Stanford, in a game in which Feaster recorded 35 points and 13 rebounds in the 71-67 win in 1998.\nFeaster was named to the 1997-98 Kodak All-America team after leading the nation in scoring (28.5) and also averaging 10.8 rebounds per game. She was named second team All-America by Women’s Basketball News Service and honorable mention All-America by the Associated Press. She was the 1997-98 Eastern Collegiate Athletic Conference Player of the Year, a three-time Ivy League Player of the Year and All-Ivy League first team all four seasons. She led Harvard to a 23-5 record as a senior, the best record in the program’s history. She established school career records for most points (2,312), rebounds (1,134) and steals (308).\nAs a junior, she was the only Division I player to be ranked in the top 15 in scoring (12th) and rebounding (14th). During her rookie season she was selected to Basketball America’s All-Freshman team. Feaster led the Crimson to three consecutive Ivy titles, while achieving nearly every Harvard and Ivy scoring record. She averaged 28.5 ppg to lead the nation in scoring in 1998. She was drafted fifth overall in the 1998 WNBA Draft by the Los Angeles Sparks and enjoyed a 10-year career in the WNBA scoring 2,260 career points. She played for Los Angeles, Charlotte Sting and Indiana Fever. She is currently the VP/Team Operations and Organizational Growth for the NBA’s Boston Celtics.\nLucas Glover\nGreenville native Lucas Glover was a starter on four Clemson NCAA Tournament teams from 1997-01 where the Tigers finished second, eighth, seventh and second in the nation, respectively. Glover was a two-time first-team All-American by the Golf Coaches Association (2000 & ‘01), and was honorable mention as a sophomore for the 1998-99 season.\nAt Clemson, Glover won 1997-98 Carpet Classic as a freshman, 1998-99 Mauna Kea Intercollegiate as a sophomore and 2000-01 Puerto Rico Classic as a senior, finishing his career with 519 birdies, still second in Clemson history. He was a three-time South Carolina Amateur Champion (1998, ’99 & ’00) becoming the only player since 1937 to win the S.C. Amateur title three consecutive years. Glover played for the United States in the 2001 Walker Cup and the United States Palmer Cup team in 2000 and 2001.\nHe was named to the ACC’s 50-Year Anniversary golf team in 2002 as he was first team All-ACC in 1999-00-01. He graduated from Clemson in 2005 finishing his degree while he was on PGA Tour and was inducted into the Clemson Athletic Hall of Fame in 2007.\nAs a professional, Glover has won six times on the PGA Tour, including twice in 2023 when he won the Wyndham in Greensboro and the FedEx St. Jude Championship in Memphis. He won the 2009 US Open Championship, the only former Clemson golfer to win a major championship.\nAnthony Johnson\nAnthony Johnson became the College of Charleston’s first NBA draft pick when he was selected 40th overall (2nd round) by the Sacramento Kings in 1997. During Johnson’s college career, the Cougars compiled an impressive 101-17 overall record including four Trans America Athletic Conference championships, two National Invitational Tournament and two NCAA Tournament appearances including the program’s first-round 75-66 victory over Maryland in the NCAA Southeast Regional in 1997. His number 24 was retired by the College of Charleston.\nThe North Charleston, S.C. native was named the 1997 TAAC Player of the Year, first team All-TAAC and honorable mention All-American by the Associated Press. He finished his Cougar career with 959 points and a school-record 520 assists. He also set a school-record by dishing out 7.2 assists per game in 1996-97.\nJohnson played at the College of Charleston (1992-97) for 2001 SCAHOF inductee John Kresse. He prepped at R.B. Stall high school and spent 13 years in the NBA with the Kings (1997-98, 2008), Atlanta Hawks (1999-00, 2000-01, 2007-08), Orlando Magic (2000, 2008-10), Cleveland Cavaliers (2001-02), New Jersey Nets (2002-03), Indiana Pacers (2003-06), Dallas Mavericks (2006-07).\nHe played in three NBA Finals as a member of the Nets (2002-03) and Magic (2009). Johnson also played in 100 career playoff games scoring a career-high 40 points with the Pacers against the New Jersey Nets in the 2006 NBA Playoffs. He averaged 5.6 points, 2.9 assists and 19.6 minutes played over 793 career games.\nMarcus Lattimore\nDespite an abbreviated career due to injury (2010-12), Duncan native Marcus Lattimore ranked sixth on the University of South Carolina’s all-time rushing list with 2,677 yards, and owned the school record for rushing touchdowns (38) and overall touchdowns (41). His best season came as a freshman in 2010 when he rushed for 1,197 yards on 249 carries. He was named SEC Freshman of the Year and also earned unanimous Freshman All-American honors.\nIn 2010, Lattimore rushed for 182 yards on 37 carries in the Gamecocks’ 17-6 victory over Georgia. Against top-ranked Alabama, he had 23 carries for 93 yards, two rushing touchdowns and one receiving touchdown in USC’s 35-21 upset win. He rushed 40 times for 212 yards and three TDs in a 36-14 win at Florida that clinched the Gamecocks’ first SEC Eastern Division title.\nLattimore was a fourth-round pick by the San Francisco 49ers in the 2013 NFL Draft. He never played a game for the 49ers and retired from playing football at the age of 23.\nHe founded the Marcus Lattimore Foundation, which is committed to youth and initiatives, emphasizing Christian values, character, life-skills development, education and health and wellness in South Carolina.\nLattimore served as the head football coach at Heathwood Hall prep school (2016-17) in Columbia and two years as the Gamecocks’ Director of Player Development (2018-19).\nLattimore prepped at Byrnes high school where he had nearly 8,000 rushing and receiving yards and scored 104 touchdowns during his career. He led Byrnes to 4A state titles in 2005, 2007 and 2008. He was named Parade Magazine All-American, South Carolina’s Mr. Football, S.C.’s Gatorade Player of the Year and one of seven finalists for U.S. Army national player of the year in 2009.\nJack Leggett\nIn his 22 seasons (1994-15), Jack Leggett led Clemson to 955 victories (43 per season), 21 NCAA Tournament appearances and six College World Series berths. Clemson was the seventh-winningest program in the nation during his time as head coach, while his six trips to Omaha tied for ninth most in the nation during his tenure. Of his 955 wins, 244 (26 percent) came against teams ranked in the top 25 of at least one of the three major polls.\nHe had 135 wins over top-10 teams, 68 victories in NCAA Tournament competition and directed Clemson to a winning record in ACC regular-season games in 21 seasons. Clemson’s program was one of only 11 in the country that played in the NCAA Tournament each of the seven seasons from 2009-15. His number 7 was retired by Clemson on April 15, 2023.\nPrior to his move to Clemson, Leggett served as head coach for 14 years at Vermont (5 years) and Western Carolina (9 years) where he combined for 377 wins. He posted 302 victories at Western Carolina and 75 at Vermont, giving him 1,407 for his career. Leggett was inducted into the American Baseball Coaches Association (ABCA) Hall of Fame in 2014.\nIvory Latta\nIvory Latta was a four-year starter who led the University of North Carolina to back-to-back Final Fours and was named the 2006 ESPN.com, USBWA, Basketball Times and Gballmag.com National Player of the Year.\nAs a 5-6 point guard from McConnells and York Comprehensive High, Latta’s UNC teams compiled a four-year record of 121-17 that included three Atlantic Coast Conference championships, two Final Fours and an Elite Eight. She finished her career as UNC’s all-time leading scorer, becoming just the second player in program history to earn consensus All-America honors two years in a row. She also finished her career as the school’s all-time leader in career three-pointers, three-point percentage and free-throw percentage.\nAs a sophomore in 2005, she earned third-team Associated Press and Kodak honorable mention All-America honors. She also led the Tar Heels to the 2005 ACC title, picking up most valuable player honors in the process.\nLatta guided UNC to the 2006 Women’s Final Four in Boston and was the 2006 ACC Player of the Year while earning first-team All-America accolades from the AP, Kodak/WBCA, ESPN.com, USBWA, Basketball Times, Gballmag.com and the Wooden Award committee.\nDespite offseason knee surgery, Latta was again a consensus All-America performer as a senior in 2007 and led UNC back to the Women’s Final Four in Cleveland. She also earned the ACC Tournament MVP award, making her the first player – male or female – to win the award three consecutive years. She collected first-team All-America honors from the AP, Kodak/WBCA, USBWA and the Wooden Award committee. She was the recipient of the Nancy Lieberman Award.\nShe was selected 11th overall in the 2007 WNBA Draft by the Detroit Shock where she was a two-time WNBA All-Star (2013, 2014). Her No. 12 jersey was retired by UNC.\nWilliam Partlow\nWilliam Partlow was a historical and pioneering basketball coach in Columbia (1960–69) during segregation. His teams at Booker T. Washington High captured six S.C. State Championships and sent several of his players to major universities such as Kenny Washington (UCLA), Landy Watson (Oklahoma), Samuel Oglesby (West Virginia), Leon Benbow (Jacksonville/Chicago Bulls) and Roscoe Wilson (who played for Coach Partlow at Benedict College). He was the coach and mentor to several members of the SCAHOF including George Glymph, Carl Williams, Kenny Washington and Sam “Herc” Goodwin.\nPartlow became head basketball coach and athletics director at Benedict where he won several tournament championships. In 1976, Partlow moved to San Francisco and became the first African American Athletics Director at San Francisco State University. During his tenure, he hired two young football coaches who became Super Bowl-winning coaches, Mike Holmgren and Andy Reid.\nHe was enshrined in the Johnson C. Smith University Athletic Hall of Fame (1994), San Francisco State University Athletic Hall of Fame (2007) and the Gaston County (NC) Athletic Hall of Fame (2011).\nClifford Ray\nClifford Ray of Union, S.C. and Sims high school played 10 seasons in the NBA with the Chicago Bulls (1971-74) and the Golden State Warriors (1974-81). He played college basketball at the University of Oklahoma, graduating with a Bachelor of Fine Arts degree.\nSelected in the third round of the 1971 NBA draft by the Bulls, Ray was a very effective defender and rebounder. He was named to the 1972 NBA All-Rookie team, and led the NBA in rebounds per minute played in each of his first two seasons. His best season with the Bulls came during the 1973–74 campaign when he averaged 9.3 points and 12.2 rebounds per game while helping the Bulls reach the NBA Western Conference Finals for the first time.\nIn 1975 he helped the Golden State Warriors to the NBA championship. Ray led the team in rebounding and finished second in minutes played per game. For his career he averaged 7.4 points (5,821 total), 8.9 rebounds (6,953 total) and 2.2 assists per game (1,728 games).\nRay worked as an assistant coach with the Dallas Mavericks (1987-93). He then coached in the Continental Basketball Association (CBA), where he landed his first head coaching job with the Fort Wayne Fury (1993-94). Ray returned to the NBA and worked as an assistant coach with New Jersey (1995-96), Golden State (2000-02), Cleveland (2002-03), Orlando (2004-05) and the Boston Celtics (2006-10). Ray, who helped the Celtics win the 2008 NBA championship, finished his career with the Sacramento Kings (2012-13).\nTyler Thigpen\nWinnsboro native Tyler Thigpen, who prepped at Fairfield Central high school, took his quarterbacking skills to Coastal Carolina University where he became first player in Big South Conference football history to be drafted in the NFL when he was selected by Minnesota in the seventh round in 2007.\nHe led the Chanticleers from 2003-06 to a 30-8 record and as a senior, he was named Don Hansen’s Weekly Gazette National Offensive Back of the Year (2006) and was a finalist for the Walter Payton Award (2006). He earned first-team All-America honors (AP, AFCA and Don Hansen) and was voted the Big South Conference Player of the Year in 2006 after posting a conference-record 3,296 passing yards and throwing a league-record 29 touchdown passes.\nThigpen played seven years in the NFL with the Kansas City Chiefs (2007-09), Miami Dolphins (2009-10) and Buffalo Bills (2011-12) throwing for 3,222 yards and 21 touchdowns. His best year in the NFL came in 2008 with the Chiefs when he started 11 of 14 games, threw 18 touchdown passes and ran for three.",
  "word_count": 2753,
  "scraped_at": "2026-02-14T14:08:16.030639"
}