{
  "article_id": "1e3369215c63",
  "url": "https://www.cityam.com/trump-is-making-russia-the-next-ioc-presidents-burning-issue/",
  "title": "Trump is making Russia the next IOC president burning issue",
  "date": "20250320T091500Z",
  "domain": "cityam.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Trump is making Russia the next IOC president’s burning issue\nIf Trump can claim to have brokered peace in Ukraine, and with swathes of the world still beholden to Russia, the IOC will have to accept them back into the Olympics, says Ed Warner.\nThe final bell has sounded at the IBA Women’s World Boxing Championships in Nis, Serbia. The tournament’s medal table is emblematic of the challenge that the incoming IOC president faces in adjusting to the new world order.\nIf Donald Trump steamrollers a truce between Russia and Ukraine, however fragile, then reintegration of the Russian Olympic Committee becomes his, or her, unavoidable top priority.\nBoxing has long been a battleground for the sporting and political forces of East and West. The IOC has wrested control of the sport from its international governing body, the IBA, at the past two Olympics, concerned by alleged governance failings and frustrated by judging controversies at previous Games.\nIt has gone further in encouraging the establishment of a rival body, World Boxing, with the threat of exclusion of the noble art from LA28 held over nations to encourage them to secede from the IBA and switch to the newcomer.\nThe IBA has a Russian president and a British CEO. While its sources of funds are unclear (the last set of accounts on its website are to June 2022), the governing body has found the dollars to pay substantial prize money at its championships: $100,000 per world gold medal, from an overall pot trumpeted at $80m over four years.\nThe IBA ratcheted up its conflict with the IOC by offering prize money to Olympic medalists last year, even though it was frozen out of the Games. The greatest noise, however, surrounded the two female boxers whose sex became the subject of global scrutiny during the Olympics.\nThomas Bach, outgoing IOC president, has recently taken a leaf from Donald Trump’s comms playbook by dismissing this furore as “fake news” confected by the IBA. “This was part of the many, many fake news campaigns we had to face from Russia before Paris and after Paris,” Bach said.\nA total of 239 boxers from 51 countries took part in the IBA champs in Nis. Ireland aside, the medal table largely reads like a roster of friends of Vladimir Putin. However, boxers from the likes of Germany, Sweden, Australia and Spain competed too.\nWorld Boxing can now claim 84 member nations, although some still entered fighters in last week’s IBA tournament. The IOC has apparently now cleared the way for the sport to be included in Los Angeles, under World Boxing’s auspices.\nHow, though, to reintegrate Russia, or to include any nations who cling to IBA membership in preference to World Boxing? After all, $100,000 is not to be sniffed at for ‘amateur’ athletes.\nRussia’s exile from Olympic sport has taken the form of two steps forward, one back. First, athletics led the way in excluding its Russian federation because of the systematic doping scandal that broke in 2015.\nThe second forward step was taken by the IOC after the invasion of Ukraine in 2022, the Russian Olympic Committee being suspended from membership. The reverse step has been the inclusion of individual Russian athletes in many sports by virtue of either their deemed drug-free status and/or political neutrality.\nA journalist asked me this week how the new IOC president could find their way to readmit a formal Russian team because its nation had broken the “Olympic truce” by waging war during a Games. My answer, given the emerging new world order, was: how could they not?\nHowever unsavoury that may seem to many, a US leader presiding over a peace he will claim to have brokered, and swathes of the world still beholden to Russia, will prove impossible forces for the IOC to resist.\nWhether or not Seb Coe prevails in the IOC election (and you may well know the result by the time you get round to reading this) his oft-cited refusal to bow to British government pressure to boycott Moscow 1980 as an athlete will likely be trotted out as an example of the importance of sport standing above geopolitics. Only, of course, if there is a prevailing truce.\nRemember, barring unforeseen events or a change in the US constitution, LA28 will see President Trump in the home straight of his final term of office. Even the mighty IOC will have to yield to superior PR forces.\nLooney tunes\nThe Toon Army celebrates Newcastle United’s first domestic silverware in 70 years. Some 88,513 were at Wembley for the men’s Carabao Cup final.\nThe day before, a crowd of 14,187 meant that Derby County’s Pride Park was under half full for the equivalent Women’s League Cup. The media story after the match wasn’t so much of Chelsea’s victory, but of a pitch both they and opponents Manchester City deemed unfit for the occasion.\nOver the weekend, Sky News reported that the city’s leading rugby club, Newcastle Falcons, are in line for an emergency loan of around £4m from other clubs and Premiership co-owner CVC. The squad salary cap for the competition is £6.4m per club (although certain exclusions allow for higher overall spending on players).\nThe Falcons, bottom of the table (again), spend well below the cap and can be thankful the top division in English rugby is effectively closed. Its last published accounts show losses of over £2m and net liabilities approaching £21m.\nIn other news, Newcastle United manager Eddie Howe is reported to be in line for a £3m bonus for winning the Carabao Cup.\nTime and again, the financial gulf between the Premier League and both the rest of football (men’s and women’s) and other leading team sports is laid bare. The tensions this creates bubble just below the surface and often break through.\nWitness the moves to shore up the Falcons, whose average home gate of just over 6,000 suggests any loan may have to become permanent unless a new owner with deep pockets and a wealth of optimism can be unearthed.\nWitness too the latest upheaval in rugby league, where Super League clubs have effectively forced the departure of all the independent directors of the RFL.\nSuper League and RFL commercial partner IMG must, like CVC in rugby union, be wondering quite what it has got itself into.\nEd Warner is chair of GB Wheelchair Rugby and writes his sport column at sportinc.substack.com",
  "word_count": 1072,
  "scraped_at": "2026-02-14T12:34:52.085634"
}