{
  "article_id": "1e580c90b627",
  "url": "https://ghanaiantimes.com.gh/new-zealand-outline-plans-for-fifa-world-cup-windfall/",
  "title": "New Zealand outline plans for FIFA World Cup windfall",
  "date": "20250328T090000Z",
  "domain": "ghanaiantimes.com.gh",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "New Zealand outline plans for FIFA World Cup windfall\nNew Zealand will look to invest its World Cup windfall in talent development to ensure the All Whites’ return to the global stage is sustainable, the nation’s soccer chief Andrew Pragnell said.\nThe All Whites missed out on the last three men’s World Cups but the team booked their ticket to the 2026 finals in North America on Monday with victory over New Caledonia in the final of Oceania qualifying.\nFIFA have not confirmed prize money for 2026 but teams that qualified for Qatar 2022 and were eliminated from the group stage earned $10.5 million, including $1.5 million to cover preparation costs.\nThe money can make a big difference in small nations like New Zealand, which has only two professional teams and a sports market dominated by rugby.\nAround 40% of New Zealand’s World Cup windfall will go to the players under an agreement with the nation’s players union, while much of the rest will be ploughed into grass-roots and talent pathways, said Pragnell.\n“It wasn’t a boom-or-bust situation if we didn’t make it but there is a lot of pressure to keep resourcing the game at all levels,” Pragnell told Reuters.\n“Qualification enables us to continue to do that, to continue to develop the talent and refine player pathways. It is critical for the growth to be sustainable.”\nWhile the All Whites have a modest world ranking of 89, the local game enjoyed a boost from co-hosting the Women’s World Cup with Australia in 2023 and the momentum has continued with the addition of Auckland FC to the A-League.\nOwned by American billionaire Bill Foley, Auckland FC are top of the table in their first season with seven rounds left before the playoffs.\nStrong match-day attendances at Auckland’s home Mount Smart Stadium have put to bed concerns that the market might not support a second professional team in New Zealand along with Wellington Phoenix.\nAuckland FC will enter a team in the A-League Women 2025/26 season, providing another pathway to professional football for New Zealand’s female talent.\nPragnell said NZF would soon announce details of a legacy fund from the Women’s World Cup.\n“We will be managing it carefully to invest back into the game. It’s critical we use all our assets,” he added.\nThe All Whites’ buildup to their third appearance at a World Cup next year is likely to keep the ball rolling for fan engagement.\nNew Zealand’s qualification for their last World Cup at the 2010 finals in South Africa triggered celebrations across the country as Ricki Herbert’s team won an intercontinental playoff against Bahrain, ending a 28-year absence from the global event.\nThe nation rallied around the team as they held Italy, Slovakia and Paraguay to three draws and exited the group stage with acclaim.\nThe Chris Wood-captained All Whites can expect the same attention as they look to reach the knockout rounds for the first time at the expanded, 48-team World Cup co-hosted by the United States, Canada and Mexico.\nWith Nottingham Forest forward Wood starring in the Premier League with 18 goals and players performing in other European leagues, fans are right to be excited, said Pragnell.\n“I think it is a time to raise our expectations,” he said.\n“We’ve got a lot of players in Europe. And the quality continues to grow.”-Reuters",
  "word_count": 559,
  "scraped_at": "2026-02-14T12:34:25.740861"
}