{
  "article_id": "1e7f04f1e975",
  "url": "https://gearjunkie.com/womens/mentrual-cycle-athletic-training-questions",
  "title": "Is Your Period Messing With Your Training ? Here What the Experts Say",
  "date": "20250903T020000Z",
  "domain": "gearjunkie.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "If you’ve ever had a period, it’s natural to assume it affects your performance as an athlete: How could cramping, bloating, nausea, and exhaustion not influence how fast you run or bike?\nIf, however, you try to find information about this topic, it might as well be the wild west. Only very recently did scientific research begin to treat the menstrual cycle in athletes as a serious subject. There’s a whole corner of Instagram dedicated to fitness influencers (who are not medical experts) instructing people on how to train and eat for the different phases of their cycle.\nTo cut through the noise and get some real answers, we talked to two experts: Dr. Natalie Brown and Esther Goldsmith. Brown is a research officer at the Welsh Institute of Performance Science and founder of Optimal Period, a program dedicated to supporting female athletes.\nGoldsmith is a sport and exercise physiologist who was part of the team at Orecco that developed FitrWoman, an app that helps women track and understand their cycles. Today, Goldsmith works with developing and elite female athletes at Sports Wales Institute.\nWhen it comes to the role of the menstrual cycle on female athletic performance and what to do about it, it can be hard to make sense of everything online. Here, Brown and Goldsmith answer common questions about training and menstruating, and break down the best approaches to address your cycle and meet your athletic goals.\nQuestion #1: Does my period affect my athletic performance?\nWhat the experts say: Science says no. Women’s experiences say yes.\nScientific studies on this subject tend to isolate one very specific element of athletic performance. “We’re going to put women in a lab and they’re going to either cycle, run, or breathe and we’re going to measure one really controlled variable. Inevitably, the conclusion would be, there’s less difference [while on their period versus not],” Goldsmith explained.\nIn this 2025 study, for example, scientists had 37 female cyclists complete a virtual time trial on different phases of their cycles. Ultimately, most of these kinds of studies yield similar results: The effects of menstruating on performance are slim to none.\nWhile these studies are methodologically sound, Goldsmith pushes back against the idea that they represent the full experience of having a period or its effects: “What these fail to take into account is the subjective experience of the female athlete,” Goldsmith said.\nA study on grip strength in menstruating women, for instance, doesn’t capture how mood swings or insomnia affect a climber’s ability to send their project on the wall.\n“We know perceptually — how it makes people feel — has an effect on performance,” Goldsmith said. “If you’ve got disturbed sleep because of your period, that’s really going to affect how you’re performing.”\nIn her work, Goldsmith talks to plenty of female athletes about how they feel like they struggle during their period, and that subjective element is receiving more and more attention in science. “Because of those subjective studies, more and more things are being done [to help] because we can’t just let female athletes suffer,” Goldsmith said.\nWhat You Should Do: Monitor Your Cycle and Symptoms\nPeople’s cycles and experiences can vary so vastly that there’s no blanket recommendation Goldsmith and Brown can make except one: Track your cycle. Whether it’s using an app like FitrWoman or just writing it down old-school in a journal, it’s important to note how you feel during different times in your cycle and what’s going on in your body.\nBrown suggests taking notes on whether certain triggers, like stress, make period symptoms worse and responding accordingly: “You can really hone in on the strategy that you need to put in place for you,” Brown said.\nQuestion #2: Do I need to alter my training for different phases of my cycle?\nWhat the Experts Say: No.\nMedical experts break down the menstrual cycle into different phases — menstrual, follicular, ovulation, and luteal — based on what is happening in the uterus and ovaries to prepare for an egg. Changes in hormone levels absolutely do occur during these phases, and there is a ton of information online about how to change training or diet for each of these phases.\nIn her work with elite female soccer players, Goldsmith does not endorse this approach: “I’m not advocating for changing training around the cycle. It’s definitely not how we work. I don’t believe there’s evidence to do that,” she said.\nBrown points out that not only does a cycle vary from person to person, but one person’s cycle can also vary widely from month to month.\n“One cycle, they might experience something different than in the next cycle. There’s so much variability,” Brown said. “If your cycle is unpredictable and highly variable, planning training around its phases is an imprecise task with ultimately little payoff.”\nWhat You Should Do: Listen to Your Body\nWhile Goldsmith and Brown don’t endorse changing training for specific phases, they do encourage and empower people to listen to their bodies. “It’s about being really savvy on an individual basis,” Goldsmith said.\nAs an example, Goldsmith mentions prioritizing recovery. If you feel tired from your period and had a hard workout, try to incorporate more stretching or sleep that day. Your training plans aren’t set in stone, and you should make adjustments as needed.\nQuestion #3: Does the menstrual cycle make women more prone to injury?\nWhat the Experts Say: That’s unclear.\nACL injuries are some of the most feared, and most common, injuries among soccer players. While research does show that women are more likely to injure their ACLs than men, the explanation behind that fact doesn’t lie with the menstrual cycle.\n“I’ve had top-level WSL (Women’s Super League) players worrying about certain phases of their cycle because they thought they were going to get injured at that point, which is just ludicrous,” Goldsmith said.\nGoldsmith states that there are a multitude of other reasons behind these injuries, which stem from gender inequalities in sport. “We don’t have the right training in place for female physiology … We don’t have the access to physios, access to soft tissue [work],” she said.\nShe also cites the poorer quality of equipment and fields that women play on compared to men, for example. During the 2015 Women’s World Cup, players pushed back against playing on artificial turf instead of grass; this inferior surface was harder on their bodies and made recovery more difficult.\nBrown says there isn’t enough research to directly link cycles with ACL injuries. “We don’t actually know the effects on ACLs, and if they [menstrual cycles] are the only thing causing them,” she said.\nWhat You Should Do: Find Good Support\nFinding a coach and other athletic professionals who support your access to athletic trainers, recovery care, and other injury-prevention tools can make a big difference physically and mentally.\nBrown and Goldsmith hope that eventually, all athletes can feel comfortable and safe discussing their periods and other health issues with their coaches. “Make sure you can talk to somebody about it because that’s the biggest thing I’ve really experienced as working with youth athletes is that they’re so embarrassed, like some of them can’t even say the word period,” Goldsmith said.\nQuestion #4: If I lose my period, should I go on hormonal birth control?\nWhat the Experts Say: That’s not enough.\nA sudden and sustained loss of your period is a major warning sign for RED-S (relative energy deficiency in sport), a condition brought on when athletes operate on caloric deficiency for an extended period of time. It can result in injuries to bones, tendons, and muscles, and a host of other mental and physical problems.\nTreatment for RED-S should involve a multi-pronged approach that includes nutrition and mental health services, but in Brown’s experience, some doctors just place athletes experiencing a loss of their periods on hormonal birth control, usually the pill.\n“That’s probably the biggest myth I’d like to bust,” Brown said. “If you do have a bleed with a hormonal contraceptive, that’s not the same experience [as the menstrual cycle]. That’s just a withdrawal of hormones.”\nPlacing the athlete on birth control does not address the underlying cause — lack of adequate calories coming in versus calories being expended — and they will continue to experience RED-S. Goldsmith echoes these concerns.\n“That [putting an athlete on the pill] is not an intervention,” she said. “That’s just sticking a plaster on. That’s not helping anything.”\nWhat You Should Do: Watch for RED-S Symptoms and Talk to a Doctor You Trust\nA sudden, sustained loss of a period means you should consult a medical professional. Be cautious of anyone advocating the birth control pill as a quick fix.\nOther symptoms of RED-S to look out for include: mental slowness or fogginess, low heart rate, trouble staying warm, and frequent illnesses.\nQuestion #5: If I menstruate, should I take an iron supplement or other vitamins?\nWhat the Experts Say: For most people, no.\nIt’s a well-established fact that women are more likely to be iron-deficient, in part because of the blood loss that occurs during menstruation. While both Goldsmith and Brown confirm that yes, menstruating women should be making sure they’re getting enough iron, they also maintain that the source of that iron matters.\nWhat You Should Do: Skip Most Supplements and Eat a Balanced Diet\nHow you get your iron matters. It’s best practice for iron and other micronutrients to come from your diet, not a pill or supplement.\n“There’s lots of companies out there that trying to sell you that there’s this amazing multi-vitamin to help with your menstrual cycle and you actually can you just get it from your diet because that’s gonna be better absorbed and more appreciated by your body,” Goldsmith said.\nVegans and vegetarians should pay special attention to their iron intake, as many iron-rich foods come from animals. Plant-based sources of iron include lentils, tofu, and spinach.\nWhile Brown finds that most dietary supplements and multi-vitamins have limited effects, she does endorse taking a Vitamin D supplement. Her athletes in the U.K., a famously cloudy place, often experience Vitamin D deficiency, which can result in muscle and bone pain, affecting athletic performance.",
  "word_count": 1709,
  "scraped_at": "2026-02-14T12:20:19.616516"
}