{
  "article_id": "1e9682977435",
  "url": "https://schonmagazine.com/hermes-aw26-a-tribute-to-veronique-nichanian/",
  "title": "hermès aw26 | a tribute to véronique nichanian",
  "date": "20260126T151500Z",
  "domain": "schonmagazine.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Every season, it seems like fashion is being pushed to its limits. Véronique Nichanian couldn’t have expressed it better: “I want to stop that because it’s not interesting anymore, the way it’s going faster and faster,” she told in a recent interview before her last show at Hermès. After 37 years at the helm of the Maison, Nichanian presented her last Autumn/Winter 2026 collection inside the Palais Brongniart. Many were wondering how she would end her legendary legacy before handing it to her successor, Grace Wales Bonner, and she did it in the way that defines her the most – crafting garments that would last a lifetime.\nThe collection was a reunion of textures and favourite looks Nichanian had showcased during her reign at Hermès: Look 5, for instance, is a moka calfskin jumpsuit from the Autumn/Winter 1991 collection. It walked with the same relevance and ease as Look 14, a verdigris deerskin coat from Spring/Summer 2001, which looked just as honed today as it did a quarter-century ago.\nThe collection was built on these “hybridisations,” where the past informs the present without necessarily clashing. We saw this clearly in Look 41, a single-breasted jacket from Autumn/Winter 2010. Its navy wool flannel was shocked by a flash of orange Neoprene – or “gale of laughter in the night” as the show notes described – reminding us that Nichanian has always played with technical wit. Details like the étrivière stitching on Look 32 (a blouson from Spring/Summer 2002) are selfish pleasures meant only for the wearer to truly appreciate.\nThese archival heavyweights sat comfortably beside new innovations, like Look 3, a double-breasted suit in pinstriped leather created for 2026. The palette itself felt like a grounding force: a spectrum of peat, burnt grey, bark and inky midnight blues that anchored the lighter flashes of cumin and quartz.\nBut let’s talk about the accessories, specifically the bags that had the front row leaning in. The star of the season is undoubtedly the Plume Fourre-Tout On Radio, a literal leather boombox. Whether rendered in sleek box calfskin or the rugged charm of Barénia, it manages to be both a workhorse and a sign of continued evolution for the Maison. It pairs perfectly with the elegant punctuation of Look 59, a khaki mirror crocodile suit that closed the show, offering a texture that felt almost liquid under the lights.\nFor accessories, the Hermès H08 watches returned in titanium featuring the H1837 movement, while necks and lapels glittered with a surprising amount of hardware. Boucle Sellier Onde necklaces and rose gold brooches set with moonstone and black jade offered a decadent counterpoint to the functional tailoring. The footwear, which included high lace-up ankle boots in Toscan calfskin, grounded a wardrobe that felt deeply human.\nNichanian’s departure might mark the end of an era, but she leaves behind a wardrobe that will continue to inspire the way we think about fashion.\nDiscover the collection here.\nphotography. courtesy of Bruno Staub (in situ)\nwords. Gennaro Costanzo",
  "word_count": 499,
  "scraped_at": "2026-02-14T12:38:40.146571"
}