{
  "article_id": "1ea10fbd596d",
  "url": "https://www.nytimes.com/athletic/6929601/2025/12/31/usl-players-association-wages/",
  "title": "USL Players Association asks for  livable wage as talks stall before New Year deadline",
  "date": "20251231T164500Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In late November, just as the holiday season was about to begin, 22 professional soccer players from USL Championship sides FC Tulsa and Pittsburgh Riverhounds SC walked onto Oneok Field in Tulsa, Okla., dressed in matching black shirts. These shirts displayed a unified message: “Pro Rel? Try Pro Standards First.”\nAdvertisement\nIt was a subtle, yet loud statement — a jab against the United Soccer League’s plan to launch a first division men’s league and later implement promotion and relegation across their ecosystem — all while players have remained in a tense, year-and-a-half-long negotiation over their new collective bargaining agreement with the league. Ahead of their championship match, the players made their stance clear.\n“There’s this disconnect between what is being put out publicly, and how players are being treated internally,” Duke Lacroix, an 11-year veteran of the league and current president of the USL Players Association, told The Athletic. “This is what is being publicly displayed — the pro promotion-relegation the league’s advocating for, and we’re still lacking professional standards.”\nBroadcast didn’t show it:\nUSL Championship players walked out in PRO REL? TRY PRO STANDARDS FIRST shirts.\n300+ supporters across @steelarmy, @tulsa_83_united & @918brigade held the same message.\nPlayers stood up. Supporters stood up. Broadcast hid it.#StandUpForStandards pic.twitter.com/eNOVQMvDTt— USLPA (@USLPlayers) November 23, 2025\nThe USL Championship, a second-division professional men’s soccer league, sits one step below Major League Soccer. There is a history of fluidity between the two leagues, as multiple USL clubs have successfully transitioned to MLS. Now, the USL is at a crossroads.\nThe USL Players Association and USL Championship players have been in negotiations with USL since Aug. 1, 2024, and are on the verge of entering 2026 with an expired CBA. Players have steadily grown more vocal in their public messaging over the last year; their November protest was one of their most visible actions yet. Now, with their contract set to expire at midnight on Wednesday, Dec. 31, a potential work stoppage looms in the new year.\nAdvertisement\nOn Tuesday night, following their final bargaining session of 2025, and the 38th session since bargaining began, USL Championship players published an open letter to their supporters. They outlined how negotiations with “USL Headquarters” remain at a standstill. They specified that this USL HQ is separate from the clubs themselves. When players signed their first CBA in 2021, players wrote, they “agreed to an extremely limited starting point” so the league could survive and grow.\n“Over the past four-plus years, we have watched the USL expand rapidly. We have witnessed the launch of new leagues, including the women’s Super League and the announced launch of a Division 1 league,” players said in the letter. “We have seen announcements of new stadiums and ambitious growth plans. We have heard public discussions about promotion and relegation. Now it is time to take care of the players who make this league possible.”\nThe letter outlined three figures from 2025: roughly 85 percent of players did not have 12-month contracts; more than 25 percent of players were not offered a health insurance option by their clubs; and about 25 percent of players made less than $35,000 in gross salary.\nThe league “must take an active role in investing in and strengthening the USL Championship,” players said. “We are not asking for anything radical. We are asking for continued progress towards professional standards and livable wages that reflect the growth of the league we compete in every week. As our CBA expiration date passes tomorrow, we remain resolute in this pursuit and committed to bargaining in good faith.”\nThe USL declined to comment on ongoing negotiations when reached Tuesday night. Talks are scheduled to resume on Jan. 8.\nThe USL operates one of the largest soccer ecosystems in the U.S. The league boasts more than 200 USL-affiliated teams across all levels, which include lower divisions like League One, League Two and the W League.\nAdvertisement\nLast summer, USL launched a professional D1 women’s league, the Gainbridge Super League. It’s the second D1 women’s league in the U.S., along with the National Women’s Soccer League. Players in the Super League took the first step toward bargaining for their first CBA in early December. Players in the league who spoke exclusively with The Athletic hoped this first negotiated contract would set a standard across all teams and allow the league to flourish and remain sustainable in the long-term. While the women’s players are also represented by the USLPA, the women’s negotiations are separate from the men’s teams.\nMeanwhile, the USL Championship is currently the USL’s top men’s league, sitting in the second tier of men’s professional soccer in the United States. USL plans to launch a new D1 league by 2028, becoming the second D1 men’s league in the U.S. after Major League Soccer.\nIt plans to implement a promotion-relegation system between its tiered men’s leagues, falling in line with several leagues around the world and becoming the first American soccer league to do so. This means teams that finish last in a league’s top division would be relegated to the second division, while a team that finished at the top of the second division would be promoted in their place.\nOn the men’s side, negotiations have zeroed in on several key issues, from mandating that clubs provide players with healthcare, increasing compensation and improving working conditions. The current minimum compensation for a USL Championship player is $2,600 per month over a 10-month contract, and that figure can include other expenses, such as housing or healthcare, according to the terms of their 2021 CBA.\n“We are advocating for better baseline workplace conditions,” said Lacroix, who plays for the Colorado Springs Switchbacks and the Haiti national team. “Encompassed in that is having health security, so health insurance, adequate housing, and increasing the base compensation level, and workplace safety. Just basic standards that you would expect across any employment opportunity, as well as in professional sports, specifically.”\nWith the success of MLS and NWSL on display as the U.S. prepares to co-host the biggest edition of the FIFA men’s World Cup next summer, it’s easy to forget the precarious state that professional soccer leagues in the U.S. were in historically. Leagues like the North American Soccer League, which featured greats such as Pele and Franz Beckenbauer, came and went. As did others on the women’s side, including Women’s Professional Soccer and the Women’s United Soccer Association. The USL, which was founded in 1986 as an indoor league, evolved into the massive organization it is today.\nPlayers in the USL Championship credit their first CBA with pushing the league forward. Its success, they argue, allowed the league to be in a place where its leaders are ready to build towards a men’s D1 league.\nAdvertisement\n“They’re launching that off of the work that the USL Championship has done, and Super League is starting to do,” said Joe Farrell, who announced his retirement earlier this month after a decade in the USL. “You wouldn’t expand your business if your business and your workers weren’t giving (you) a good product.”\nFarrell spoke with The Athletic about his decision to retire despite offers to continue playing. While proud to have chased a childhood dream for so long, Farrell fell behind compared to former college teammates or high school friends who chose more traditional paths. They were able to build a 401(k) or afford to start families, while Farrell sometimes went years without health coverage and lived in an apartment with roommates. His health coverage relied on whether the team he played for offered it.\n“We want to be treated as professionals, and that comes along with health care, that comes along with (competitive) salaries,” said Farrell, now 31. “We are not aspiring for millions. We’re aspiring for a nice apartment.”\nFarrell began working more closely with the USLPA over the last three years, taking a role on the union’s board of directors while still an active defender. He spoke emotionally about how his niece and nephews look up to him, inspiring him to push for more stability in the league. In them, he sees the next generation.\n“It’s not about myself,” Farrell said. “It’s about how can I help the boys and girls who want to be professional soccer players in America in 10, 20 years from now.”\nThough the Super League and USL Championship players negotiate separately, the two sides have learned from one another as they navigate their own bargaining. There have been instances where the women’s players stood in solidarity with the men’s players, especially on social media, and vice versa. Those in the Super League also value the experience the men already have in negotiations.\n“We’re living parallel lives,” Meaghan Nally, a center-back for the Carolina Ascent, told The Athletic. “We’re all professional soccer players, so their fight is our fight. When they’re fighting for professionalism and basic standards that echoes very close to home for us, because we’re in the same job.”\nThe Super League’s business model revolves around providing more women’s soccer players the opportunity to play professional soccer in the U.S., largely launching teams in cities where the NWSL is not. In establishing more teams, this gives more players the chance to either continue playing after college or to start playing competitively at an even younger age than they imagined.\nAdvertisement\nIt’s a similar sentiment on the men’s side. For Farrell, all he ever knew was playing in the USL, which features players of all ages from all over the world. At 31, he said he was one of the oldest players in his locker room. The league also features players preparing for the biggest tournament of their lives in 2026.\n“We’re going to have players in the World Cup, which is amazing,” Farrell said. “Yet, will those players have health insurance? I don’t know. Will they be able to send their kid to a daycare? Would they be able to afford an apartment that they’re comfortable in? That’s a different story, and that’s what we’re looking to change.”\nWith the men’s contract expiring on Wednesday, either the league or the USL Championship players could opt for a work stoppage. “Our goal is to try to avoid that as much as possible,” Lacroix said. The league, which operates with a spring-to-fall schedule, starts its 2026 season in March. Preseason is slated for mid-January.\nOver the past year, Farrell witnessed the unity among players across the USL and the community behind USL Championship teams. During the championship final last month, fans of the Riverhounds and FC Tulsa carried signs with the same message that players wore on their shirts. After the final, players associations from sports leagues around the country reached out to them, including those representing players in the National Football League, Major League Baseball, MLS and NWSL.\n“It’s more than just our fight at this moment. What we are able to achieve in the coming months, or however long this takes, that will help push the player pool forward. It will help push the league forward. It will help push U.S. soccer forward,” Farrell said. “This is a critical moment, and that’s why 22 guys heading into their most important game of their lives decided to wear a T-shirt. It was more than a T-shirt. It was the future of what we do.”",
  "word_count": 1892,
  "scraped_at": "2026-02-14T12:44:43.001414"
}