{
  "article_id": "1eb2b38b98d2",
  "url": "https://lasvegassun.com/news/2023/may/23/southern-nevadas-finest-prep-stars-honored-for-eff/",
  "title": "Southern Nevada finest prep stars honored for efforts on and off the field",
  "date": "20230523T114500Z",
  "domain": "lasvegassun.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Southern Nevada’s finest prep stars honored for efforts on and off the field\nTuesday, May 23, 2023 | 2 a.m.\nSun Standout Awards\nThe Sun Standout Awards on Monday celebrated the best in preps for the 2022-23 school year. And there was much from which to choose.\nThere are 23 sports played by about 20,000 athletes in the Clark County School District. Our selection committee received more than 150 nominations for various awards, pegging a group of finalists that excelled on the playing field, classroom and in the community.\nWe picked student-athletes from all over Southern Nevada. They played a variety of sports, including two boys volleyball players. It’s the first time boys volleyball has been represented in the six years of the show.\nWe also recognized a pair of female wrestlers, two nationally ranked teams, multiple state players of the year and athletes who shattered state records. We detailed the good works of our students making an impact through community service.\nHere are this year’s standouts, along with their stories and achievements.\nMale Athlete of the Year\nDedan Thomas Jr., Liberty basketball\nThomas started his high school career with two goals: Win a state championship and be the state player of the year.\nHe accomplished both, leading the Patriots to the state title in 2022 and this season being named the state Gatorade Player of the year.\nThe junior averaged 23 points, five assists and four rebounds per game in leading Liberty to its second straight state championship game appearance — and did so getting each opponent’s best effort.\n“Everyone came after us. We got everyone’s best game,” he said of the competition as Liberty was the defending state champion.\nThe 6-foot-1 guard increased his scoring average by nearly 10 points per game this season, using his quickness and electric finishing ability to impact the game. A sample: Thomas went for 24 points in an overtime win against Coronado, 26 in a victory against Bishop Gorman and 27 in a win against Foothill.\nMore impressive: He made 46.8% of his shots.\nThomas said he developed into more of a complete player this season and is a capable scorer from all three levels. He also developed into the vocal leader at Liberty, because “everyone trusts me. They respect me.”\nThomas averaged 26 points per game in the playoffs, but Liberty was upset in the championship game by Durango.\nThis month, Thomas verbally committed to UNLV, where his father, Dedan Thomas Sr., was a point guard in the early 1990s.\nFinalists\nMicah Alejado, Gorman football: Alejado was the state Gatorade Player of the Year — a rarity for a junior. The Hawaii-commit passed for 3,575 yards and 54 touchdowns to lead Gorman to a top-five national ranking and state championship. In the winter, he became the 19th bowler competing in a Nevada Interscholastic Activities Association match to record a perfect 300 game.\nNoah Barrus, Shadow Ridge volleyball: Barrus was a driving force in Shadow Ridge’s state championship season in posting 1,014 assists and 284 service points. He had an eye-popping 10.4 assists and 5.5 digs per set.\nJordan Evans, Palo Verde swimming: Evans was part of Palo Verde’s 200 medley relay and 200 freestyle relay state championship teams, and placed second in the 100-yard breaststroke to help the Panthers win the team title by 71 points.\nQuentin Gomez, Palo Verde soccer: It’s rare that a defender is the best soccer player in town, but Gomez was dominant for the Panthers in being named the Class 5A Player of the Year. He scored seven goals — and had a hand in saving countless others. He will play in college at Washington University in St. Louis.\nFemale Athlete of the Year\nMadeleine Hebert, Coronado swimming\nCoronado senior Madeleine Hebert remembers watching gold medalist swimmers Missy Franklin and Katie Ledecky compete in the 2012 Summer Olympics in London on television and gaining motivation to follow in their footsteps.\nA few years later, she swam against Ledecky in the 400 freestyle. She said her time was the 20th-fastest out of about 80 swimmers at that meet.\n“I’ve never been focused on place,” she said. “I’ve always been focused on improving my time.”\nHer times for Coronado have been record-setting over the past two years, including Saturday when she established a state record in the 200 freestyle at 1 minute, 47.63 seconds in winning the state championship.\nThe record she broke? Hers from last year, when she won state at 1:47.98\nHebert dominated the state meet Saturday, also winning the 100 freestyle (49.98), and being part of the state-champion 200 freestyle relay and 400 freestyle relay as Coronado won the team championship.\nShe holds the Coronado record for all four events.\n“I would say the biggest thing for me is I’m pretty versatile,” Hebert said. “I go from 50 to 500 and I hold records at Coronado for every single one of them. I think the biggest thing is I’m very focused on staying not categorized in one place.”\nThis likely won’t be the last you hear of Hebert, who in the fall will swim at North Carolina State — the nation’s No. 4-ranked program.\nFinalists\nJuliana Alejandro, Centennial wrestling: Posted a 47-0 record in setting a Centennial mark for career wins at 142. Didn’t surrender a point at the state tournament, and finished opponents so quickly, she was on the mat for less than 2 minutes over three matches. Ranked No. 9 nationally at 101 pounds.\nAli’a Matavao, Liberty volleyball, basketball and track: Averaged 18 points and 12 rebounds per game in basketball, and was the state Gatorade Player of the Year for the second straight season. In track, she won the state championship in the long jump and shot put to help Liberty win the team title.\nAvari Morris, Green Valley softball: Morris had 223 strikeouts in 138 innings pitched en route to an 18-4 record. At the plate, she batted .500 with 53 hits, 18 doubles and 36 RBIs.\nAngelina Sayles, Coronado volleyball: Had 266 kills, 233 digs, 75 aces and 25 blocks in leading the Cougars to the state title. Was the 5A Southern Region and state Gatorade Player of the Year.\nCoach of the Year\nLaShondra Rayford, Las Vegas girls basketball\nThe Las Vegas High girls basketball team trailed Desert Pines by 13 points in the fourth quarter of the state championship game.\nYet, Rayford didn’t panic. She remained calm, kept players focused and guided them to a comeback for the ages. The Wildcats rallied for a 51-49 victory for the program’s first state title since 1978.\n“I was just confident we would get it done,” Rayford said. “I felt like it was right for us. I felt like it was our time.”\nRayford received phone calls and letters of congratulations from countless alumni of the school in the days and weeks after winning the championship. It reaffirmed what she already knew — Las Vegas High, the city’s oldest high school, is a special place.\nThe same is true of her team.\nIt dominated Class 4A opponents, winning league games by an average of 36 points. The Wildcats challenged Class 5A opponents in a nonleague games because they wanted to play better competition and be ready for the rigors of the playoffs.\nThat preparation paid off against Desert Pines with the season on the line. Layla Faught got fouled with 3.9 seconds remaining and the game tied. She calmly sank both free throws to clinch the championship.\n“It was less about me and more about the players,” Rayford said. “They are such amazing kids. They all love each other. This is probably the first time in my career along with last year where I’ve had a team, a program where there are no issues. Not a single one. Not an argument. Not a fight. Not a disagreement. They made it a team.”\nFinalists\nKeJuan Clark, Mojave basketball: Considered one of the valley’s best young coaches, Clark led the Rattlers to a second straight Class 4A state championship and 23-5 record.\nAndrew Flynn, Shadow Ridge cross country: The Mustang boys placed three runners in the top 20 of the state meet to win the Class 5A title.\nTyler Marchant, Palo Verde tennis: He guided the Panthers to Class 5A Southern Region and state team championships, and did so in both boys and girls.\nTeam of the Year\nSlam Nevada wrestling\nThe Slam Nevada wrestling team graduated many key contributors from last season’s state championship team, opening the door for perennial contender Spanish Springs in Northern Nevada to be the state favorites.\nThat motivated the Slam wrestlers.\nAt the state tournament, 11 Slam wrestlers placed in the top four and five were individual champions in a commanding victory. Spanish Springs took second after finishing 30 points back.\nJosiah Maestas (113 pounds), Drake Hoolman (120 pounds), Brenden Agcaolli (126 pounds), Manuel Saldate (132 pounds) and Gabriel Delgado (157 pounds) won individual state titles. And all are underclassmen.\nThey get better by competing against one another in practice, coach Zach Hocker said.\n“They love the sport,” Hocker said, “so they do the work because they want to be better.”\nThey broke their own state record for pins in a season, finishing with 379, and extended their win streak against Nevada opponents to 64.\n“When we work as hard as we do every day in the room, we build a bond with each other,” Delgado said. “And that bond goes to tournaments and we get stronger as we help each other and support each other.”\nFinalists\nCentennial girls basketball: The Bulldogs didn’t lose to a local opponent in winning their eighth straight championship. The closest result? A 39-point win in the state championship game.\nFaith Lutheran girls soccer: In one of the most competitive girls soccer seasons in recent memory, the Crusaders prevailed 1-0 in overtime of the state championship game. The thrilling run was punctuated by not allowing a goal during the state tournament.\nPalo Verde boys tennis: The Panthers went undefeated to win the state championship, and they were rarely challenged. Palo was so dominant that many observers said its reserves were the second best team in Nevada.\nCitizen of the Year\nLeslie Maldonado Carrasco, Chaparral volleyball, softball\nMaldonado Carrasco saw others struggling in her east Las Vegas neighborhood and was determined to make it a better place.\nSo, she got to work — and doesn’t plan on stopping anytime soon.\nHer outreach included planting trees at the Las Vegas Wash for the nonprofit Green Up, volunteering at Opportunity Village’s Magical Forest over the holiday, and coordinating an effort to write get-well cards to senior citizens who are hospitalized.\n“We need to change, and I would like to be the change,” she said.\nHer good works impacted the Chaparral community, especially the look and feel of the campus. She spearheaded a beautification project to enhance the school campus.\nIn addition to competing in two sports, she played trumpet in the school’s jazz band and was president of the Key Club. She’ll attend UNLV in the fall to study event management.\n“She is one of the brightest young women that I have had the honor to coach,” said Chris Sanders, her volleyball coach.\nFinalists\nJoyce Calimag, Cristo Rey St. Viator basketball and track: She participates in regular service projects with Catholic Charities, Shade Tree and Three Square. Calimag, through a work-study program at Cristo Rey, has spent the past two years working at the Clark County Commission. She’ll attend UNR to study social work.\nAdrian Rodriguez, Canyon Springs football, wrestling and volleyball: Rodriguez, who is part of the ROTC at Canyon Springs and intends to enlist in the National Guard, volunteers feeding homeless veterans. A two-sport varsity performer, his outreach also includes reading at his siblings’ elementary school and organizing a Canyon Springs contingent to participate in the Martin Luther King Jr. parade. He’s also a scholar-athlete. “That kid, man, he’s going places. He’s a leader,” Principal Lou Markousis said.\nGame of the Year\nSilverado basketball wins at buzzer\nThe Silverado basketball team had a comfortable lead of 17 points in the third quarter of this playoff game against Valley. But games are an entire 32 minutes — something the Skyhawks soon learned.\nValley stormed back to take the lead with 4 seconds remaining on an off-balance 3-pointer from Elijah Flowers. That’s when Silverado called timeout, and with their season in the balance, called a play they had only run once — and that was in practice.\nCue heroics from Jake Wohl, who took a pass from Cyril Franklin Jr. and raced up the court as the final seconds ticked off the clock. Wohl stopped about 35 feet from the basket and attempted the Hail Mary heave. It was nothing but net, and fans quickly stormed the court to celebrate.\nCoach Cyril Franklin Sr. sensed his kids had confidence they could execute the play. And Wohl is a capable 3-pointer shooter who made 40% of his attempts on the season.\nThe shot propelled Silverado for an unlikely playoff run in which the Skyhawks advanced to the state championship game. They finished 16-10 overall and lost four league games, but wouldn’t be denied in the playoffs.\n“They worked hard at it and got better,” Franklin Sr. said. “We are just getting started. We have a lot of kids back.”\nMale Rising Star\nChristian Thatcher, Arbor View football, wrestling\nAs a linebacker, Thatcher started hearing from college football recruiters last year during his freshman season at Arbor View.\nSoon, the scholarship offers started coming. On May 3, his status as an elite recruit was cemented.\nIn one afternoon, the 6-foot-2, 190-pound sophomore was offered scholarships by Southern California, Colorado and West Virginia.\n“You probably aren’t going to have a better day than that,” his father, Jamie Thatcher, told him.\nESPN ranks Thatcher as the nation’s No. 2 overall linebacker prospect for the class of 2025. He’s a four-star recruit who also has offers from a who’s who of other programs — Oregon, Oklahoma and Texas A&M.\n“I kind of expect (the offers) now at this point,” Thatcher said. “Of course it’s awesome, but I’ve worked hard for this. and it’s all paying off so I just thank God and feel very blessed this is happening.”\nHe logged 133 tackles last season for perennial power Arbor View.\nHe wants to end his career as Nevada’s all-time leading high school tackler. The record stands at 427, set by Damonte Ranch’s Richie Garcia from 2014-17. Thatcher has 232 tackles through two seasons.\n“I’m on pace,” he said. “Two more years, we should beat it.”\nThatcher also had success in wrestling, where he took second in the state tournament at 190 pounds.\nFinalists\nBraxton Rowley, Coronado volleyball: Had 767 assists for the Cougars, who were ranked in the top 30 nationally. He averaged 4.8 digs per match to go with 284 service points and a 93% service percentage. Was part of the USA Junior Nationals all-tournament team.\nLogan Scott, Faith Lutheran cross country, track: The sophomore won the state championship in cross country in the fall, and in the spring won three events at the state meet in leading the Crusaders to the Class 5A team state championship.\nCJ Shaw, Mojave basketball: The sophomore was the Class 4A Player of the Year in averaging 26 points, six rebounds and four assists to lead Mojave the state championship.\nMelvin Whitehead, Liberty wrestling: Whitehead has a 106-1 record against in-state opponents over the past two seasons in winning consecutive state championships. He won five tournaments and took fourth place at nationals.\nFemale Rising Star\nBrynn Kort, Coronado golf\nKort sensed she was having a good golf outing at Toiyabe Golf Club in Northern Nevada during the first round of the Nevada state championship.\nBut she didn’t worry about her score — or the other girls in the field.\n“I didn’t know the score until the end (of the first round),” Kort said of her record-breaking scorecard of 8-under par on the opening day of the two-day event. “I only knew I was playing good.”\nKort set a state record by going 12-under par in the championship — four strokes better than the previous mark set by Green Valley’s Alexandra Kaui in 2010 — and winning the tournament by 10 strokes.\nKort’s efforts helped Coronado repeat as champions, besting the second-place school by 34 shots.\nTeammates Joanne Lee, Ali Mulhall and Lilly DeNunzio finished second, third and fifth, respectively.\nFinalists\nEmma Albanese, Slam Nevada wrestling: Won the state championship and finished with a 38-0 record, including 31 wins by pin. She’s ranked No. 3 nationally at 112 pounds.\nAngelina Guerrero, Durango volleyball: The sophomore was second in Nevada with 463 kills. She also had 295 digs and 43 aces in earning first-team all-state honors.\nKeonni Lewis, Democracy Prep basketball: The freshman averaged 20 points per game on the way to earning 2A state player of the year honors. More important: Her team won the state championship.\nJaylani Palmer, Shadow Ridge flag football: The freshman had 2,133 receiving yards and 37 total touchdowns, and a valley-best 22 interceptions as the Mustangs won the state championship.\nScholar-Athletes of the Year\nJustine Dunaway, Liberty; Bruce Woodbury, Boulder City\nOur Scholar-Athletes of the Year had a lot on their plates during the season. Between school, practice, homework and volunteer work, there aren’t many slow moments.\n“I just manage the time, assign different slots to different things,” said Dunaway, who played volleyball and softball at Liberty. “I’m not the best at it, but I do the best I can.”\nDunaway finished with a 5.25 weighted grade-point average to rank sixth out of 741 seniors at Liberty. She was the softball team’s captain, leading them in home runs.\nDunaway also volunteered coaching a youth softball team, and worked as a math and viola tutor.\nIn a day and age when athletes focus on solely one sport, Woodbury was a starter the past two years for Boulder City in football, basketball and baseball. Those teams this season combined to post a 53-21 record, including the baseball team going 14-1 in league play with Woodbury leading the way in the outfield.\nHe also shined in the classroom with a 4.9 grade-point average to rank third out of 129 seniors at Boulder City.\nWoodbury will attend BYU in the fall, while Dunaway will play softball with Williams College in Pennsylvania.\nUnsung Hero\nThis category honors adult supporters of the prep sports that are prevalent at all schools. Fittingly, the women we honored each were hesitant to have their good works celebrated. They prefer to work behind the scenes with little fanfare.\nRachel Levy, Desert Oasis trainer: Levy had prepared for a severe incident of this nature countless times.\nSo, when she heard frantic screams calling her name from observers at Desert Oasis High School after a flag football player collapsed and was unconscious, reacting was second nature.\nLevy used CPR to resuscitate the teen, who was transported by ambulance to a nearby hospital. Ashari Hughes, 16, died of cardiac arrest later that evening — a surprise to many in the Desert Oasis community who saw her alert after Levy’s efforts.\n“It was just like how we practice,” Levy said. “It’s what we prepare for.”\nLevy has since revised the school’s emergency response plan and conducted training with school administrators in preparation for future situations. She also leads CPR renewal training with coaches.\nShe hopes most will never need to put the practice into action. But, as she can attest, when tragedy occurs, everyone must know what’s expected of them and how to execute.\nFinalists\nKim Van Velkinburgh, Liberty athletics: Van Velkinburgh’s job title is athletic secretary. Her impact in the Liberty community is much deeper. She’s the ticket taker at all events, processes paperwork for student eligibility, and keeps things organized in the athletic office. More important: She’s become a second mother to the athletes, always there to listen and keep their spirits up in a job that’s become her passion.\nDeborah Wetherby, Southeast Tech contributor: When the Southeast Tech girls basketball team was looking for ideas to honor its seniors, Wetherby stepped up and coordinated the effort. The girls received specialty designed basketballs — all of which she paid for. And when the program was hosting a fundraiser earlier in the year and falling short of their goal, Wetherby wrote a check to cover the difference. Her mentality: Give teens, regardless of their background and financial means, a memorable experience.\nHank Greenspun Lifetime Achievement Award\nEd Cheltenham,\nSpring Mountain Youth Camp\nDuring more than three decades at the Spring Mountain Youth Camp, Cheltenham won 13 state championships in track and field and another two titles in basketball.\nHis most notable contributions came as a probation officer at the facility. The Mount Charleston-based Spring Mountain Youth Camp is an alternative to prison for teenage boys who need to be rehabilitated after committing delinquent acts.\nCheltenham said sports are a vital part of rehabilitation because they bring a sense of normalcy, discipline, teamwork and a glimpse at life off the mountain. Spring Mountain competes in Class 1A in the Nevada Interscholastic Activities Association in a handful of sports.\n“I love working with kids and making a difference in their lives,” he said. “They need someone to help them and it became my calling.”\nCheltenham, 74, spent a total of 35 years working at the camp before his retirement in 2015. He later returned in a part-time capacity to continue coaching.\n[email protected] / 702-990-2662 / @raybrewer21",
  "word_count": 3592,
  "scraped_at": "2026-02-14T12:14:56.202445"
}