{
  "article_id": "1eb8e9feb73c",
  "url": "https://www.justarsenal.com/eidevall-everything-is-possible-on-arsenal-womens-champions-league-title-hopes/335798",
  "title": "Eidevall :  everything is possible  on Arsenal Women Champions League title hopes",
  "date": "20230329T163000Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Eidevall: “everything is possible” on Arsenal Women’s Champions League title hopes by Michelle\nSpeaking at his pre-match press conference at Arsenal‘s London Colney, Eidevall is confident that Arsenal Women can beat Bayern Munich tonight, in the second leg of the UEFA Women’s Champions League quarter-final.\nOver 15,000 tickets have already been sold for the fixture, which kicks off tonight at 20:00 UK at Emirates Stadium, but tickets can still be purchased here. This could be a record-breaker for Arsenal Women, in terms of attendance figures for a Women’s Champions League fixture.\nWhen asked about the possibility of Arsenal going further in the Champions League competition this year, Eidevall adopted his usual mantra of ‘one game at a time’. However, the sense of belief in Arsenal Women’s dressing room right now must be incredible, particularly with what they have achieved in March so far.\n“I think we can beat any team on any given day. That is such a great feeling to have.” Eidevall said “We know it’s going to be determined by small details but this set of players could play any team in the world and I know we would have a chance of beating them. That is one of the greatest feelings to have because then you know that everything is possible.\nArsenal Women have won the title once before and remain the only English club to do so, but that was back in 2007.\n“Champions of the continent is probably the greatest trophy you can win in club football,” he continued. “The fact that we’re the only English club to achieve this so far is something that we are very proud of. Of course, if we could repeat this in the future, it would be great.\n“But let’s make the most of it tomorrow. Maybe we can progress and then once you reach the semi-finals, I think everyone is capable of winning the trophy.”\nDo you think our Gunners can do it? Can they reach the semi-finals with a dominant win over Bayern Munich tonight? With the March they’re having I wouldn’t put anything past them right now! Imagine starting March with a Conti Cup win over Chelsea and ending with qualification to the Champions League semi-finals?\nCOYGW!!\nMichelle Maxwell\nFollow Michelle on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 402,
  "scraped_at": "2026-02-14T12:25:14.685472"
}