{
  "article_id": "1ec59020eea1",
  "url": "https://www.irishfa.com/news/2024/june/u16-girls-to-play-at-supercupni-once-again",
  "title": "U16 girls to play at SuperCupNI once again",
  "date": "20240627T130000Z",
  "domain": "irishfa.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Northern Ireland will be aiming to retain the trophy when they compete in the girls’ premier section in this year’s SuperCupNI tournament.\nA Northern Ireland Under-16 girls’ development side defeated Americans Surf Select in the decider just over 12 months ago.\nThis year the holders will be facing debutants Wolverhampton Wanderers and two club teams from the Republic of Ireland in the group stages in the eight-team premier section (Group B) within the international youth football tournament.\nThe two other teams in Group B are Dublin side Shelbourne and Galway United.\nCompeting in Group A are Manchester United, Aston Villa and American outfits USSSA and Surf Select.\nAntrim and Newtownabbey will once again be hosting matches and finals in the girls’ sections at SuperCupNI (junior and premier).\nNorthern Ireland’s first game is due to be against Shelbourne at Dixon Park in Ballyclare on Monday 22 July (7pm), while the following day the U16 girls will be up against Galway United at Chimney Corner (4.30pm).\nTheir third and final group game is scheduled for Wednesday 24 July – against Wolves at The Diamond in Rathcoole (4.30pm).\nNorthern Ireland’s placing in the group will then determine if they take part in the final of the Girls’ U16 (Premier) Cup, Globe or Vase later that week.\nDanielle McDowell Tuffey, the Irish FA’s Girls’ Elite Youth Academy Manager, will act as head coach for the U16s.\nThe Mayor of Antrim and Newtownabbey Mark Cooper said: “It is an honour for our borough to host the SuperCupNI 2024 girls’ tournament for the third consecutive year as we continue to promote and develop women’s football in Northern Ireland.\n“This prestigious tournament brings together some of the best youth female football teams from around the world.”\nMatches in the wider SuperCupNI are set to be staged at venues in three council areas: Causeway Coast and Glens, Mid and East Antrim and Antrim and Newtownabbey.\nFormer Northern Ireland and Leeds United star Stuart Dallas will officially open SuperCupNI 2024.\nDallas, who retired as a player earlier this year, will lead 66 teams from all four corners of the globe in the traditional parade through the streets of Coleraine on 21 July before officially declaring the tournament open at the Coleraine Showgrounds.\nThe 2024 SuperCupNI will kick off with group games the following day, while the tournament will draw to a close with finals day on 26 July.\nFor further information on the tournament go to www.supercupni.com.\nImage: Northern Ireland’s U16 girls’ development squad won the girls' premier section trophy at last year’s SuperCupNI.",
  "word_count": 425,
  "scraped_at": "2026-02-14T12:32:18.359560"
}