{
  "article_id": "1ec82cd046b0",
  "url": "https://english.aawsat.com/varieties/4552856-womens-international-friendly-tournament-holds-press-conference-taif",
  "title": "Women International Friendly Tournament Holds Press Conference in Taif",
  "date": "20230918T063000Z",
  "domain": "english.aawsat.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A SpaceX rocket lifted off from Florida early on Friday with a crew of two US NASA astronauts, a French astronaut and a Russian cosmonaut headed to the International Space Station for an eight-month science mission in Earth orbit.\nThe two-stage Falcon 9 rocket, topped with an autonomously operated Crew Dragon capsule dubbed Freedom, was launched from the Cape Canaveral Space Force Station, along Florida's Atlantic Coast, at about 5:15 a.m. EST (1015 GMT).\nA live NASA-SpaceX webcast showed the 25-story-tall vehicle rising from the launch tower as its nine Merlin engines roared to life, gulping 700,000 gallons of fuel per second, emitting clouds of vapor and a reddish fireball that lit up the predawn sky, Reuters reported.\nThe four crew were set to reach the space station on Saturday afternoon after a 34-hour flight, docking with the orbiting laboratory platform some 250 miles (420 km) above Earth.\nThe mission, designated Crew-12, marks the 12th long-duration ISS team that NASA has flown aboard a SpaceX launch vehicle since the private rocket venture founded in 2002 by billionaire Elon Musk began sending US astronauts to orbit in May 2020.\nCrew-12 was led by Jessica Meir, 48, a veteran astronaut and marine biologist on her second trip to the space station, nearly seven years after making history with NASA colleague Christina Koch by completing history's first all-female spacewalk.\nJoining her was Jack Hathaway, 43, a former US Navy fighter pilot and rookie astronaut; European Space Agency astronaut Sophie Adenot, 43, a master helicopter pilot from France; and Russian cosmonaut Andrey Fedyaev, a former military pilot on his second mission to the ISS.\nUpon arrival, the team will get busy with a host of scientific, medical and technical research tasks in microgravity, according to NASA.\nThose include studies of pneumonia-causing bacteria to improve treatments on Earth, and experiments with plant and nitrogen-fixing microbe interactions to boost food production in space.\nCrew-12 will be welcomed aboard the space station by three current ISS occupants - NASA astronaut Chris Williams and Roscosmos cosmonauts Sergey Kud-Sverchkov and Sergei Mikaev.\nFour Crew-11 members who were supposed to have stayed aboard until the arrival of Crew-12 departed a few weeks early, when an undisclosed serious health condition affecting one forced an unprecedented medical evacuation flight home in mid-January.\nThe ISS, which spans the length of a football field and ranks as the largest human-made object in space, has been continuously operated by a US-Russian-led consortium that includes Canada, Japan and 11 European countries.\nThe first hardware for the outpost was launched more than a quarter century ago. It was conceived as part of a multinational venture to improve ties between Washington and Moscow following the Soviet Union's collapse and the end of Cold War rivalries that spurred the original US-Soviet space race in the 1950s and 1960s.\nNASA has said it is committed to keeping the space station operating until the end of 2030.",
  "word_count": 486,
  "scraped_at": "2026-02-14T13:51:08.849716"
}