{
  "article_id": "1ee08c3482ef",
  "url": "https://uk.finance.yahoo.com/news/trivago-becomes-official-sponsor-flagship-075500538.html",
  "title": "trivago becomes official sponsor of flagship 2023 Women Football Awards",
  "date": "20230331T083000Z",
  "domain": "uk.finance.yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Düsseldorf, Germany - March 31, 2023 - trivago, the global hotel comparison website, has announced a new partnership with the Women's Football Awards 2023, becoming sponsor of the prominent „International Football Player of the Year Award”. The ceremony, which comes ahead of the 2023 Women's World Cup, will honour the people, brands and organisations who are contributing to the phenomenal growth of the sport in the UK and internationally.\nThrough this partnership, trivago, sponsor of the English Premier League's Chelsea Football Club and of the 2023 IHF Men's World Championship, is further supporting millions of fans and travelers to come together and to celebrate. The announcement is also a step forward in the company’s commitment to diversity and inclusion.\n“Gathering and connecting with other people is at the core of the sport and travel industries. That’s why we’ve teamed up with major sport industry players over the past years. We are thrilled to be a part of this exciting event and look forward to supporting the growing women's football community and their allies.\" Matthias Tillmann, CFO and CMO at trivago.\nThis collaboration will enable trivago to increase its brand visibility and to reach a broader audience as women’s football is continuously gaining traction across the world.\ntrivago will be joined by stars from the women’s game at the ceremony, as well as male football allies and celebrities for this major celebration.\nFormer Liverpool and England defender turned Sky Sports presenter Carragher, who is a prominent advocate for the growth of women’s football, said:\n“trivago is a huge global brand and we are delighted to have their support for the 2023 Women’s Football Awards as the sponsor of the hotly anticipated International Football Player of the Year category.”\nCo-host Aluko, who made 102 appearances for the England national team and is now a leading women’s football broadcaster, added:\n“The Women’s Football Awards is going to be an event of celebration that will shine a light on players, individuals and organisations doing phenomenal work to grow the women’s game.”\nThe public can now nominate for the Women’s Football Awards shortlist at www.womensfootballawards.com, which will be announced on 4 April 2023 ahead of the awards event.\n############\nMedia Contact\ncorentine.aronica@trivago.com\nAbout trivago\ntrivago is a global hotel and accommodation search platform. We are focused on reshaping the way travelers search for and compare different types of accommodations, such as hotels, vacation rentals and apartments, while enabling our advertisers to grow their businesses by providing them with access to a broad audience of travelers via our websites and apps. Our platform allows travelers to make informed decisions by personalizing their search for accommodations and providing them with access to a deep supply of relevant information and prices. As of December 31, 2022, we offered access to more than 5.0 million hotels and other types of accommodation in over 190 countries, including over 3.8 million units of alternative accommodation, such as vacation rentals and apartments.",
  "word_count": 490,
  "scraped_at": "2026-02-14T12:24:51.886439"
}