{
  "article_id": "1ee73ad81fb1",
  "url": "https://www.90min.com/posts/chloe-kelly-hilarious-new-nickname-arnold-clark-cup-golden-boot",
  "title": "Chloe Kelly has hilarious new nickname after winning Arnold Clark Cup golden boot",
  "date": "20230223T023000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Chloe Kelly has hilarious new nickname after winning Arnold Clark Cup golden boot\nEngland forward Chloe Kelly revealed she has been dubbed the ‘tap-in queen’ due to a string of close-range finishes for the Lionesses.\nKelly scored the most famous goal in English women’s football history from three yards out to beat Germany in the Euro 2022 final last summer and carried on her reputation as a poacher as the Lionesses thrashed Belgium to retain the Arnold Clark Cup on Wednesday night.\nKelly scored twice in the 6-1 hammering, adding to her earlier strike (from the edge of the box, it must be said) in the opening game against South Korea to claim the overall golden boot.\nHer first against Belgium was bundled in from a matter of inches after an excellent run from Lauren James, while she capitalised on a spill from goalkeeper Nicky Evard to get her second.\n“It is a great feeling, it was great preparation and we are building momentum,” the Manchester City star told ITV on helping England win the tournament – Kelly wasn’t involved in the 2022 edition due to her ongoing recovery from an ACL injury.\n\"It is great to win the golden boot but I didn't even realise. I think it is a good achievement but I think the team has been brilliant and we keep moving forward,” she added.\n\"Lucy [Bronze] said I am the tap-in queen so I will take that.\n\"It is very special to be part of an amazing group of staff and players and the performance on the pitch shows how incredible we are and a massive step going forward.”\nEngland are next in action against Brazil in April for the 2023 Women's Finalissima, a new competition that pits the European champions against the South American champions. A home friendly is booked against Australia in Brentford later that month, with the Lionesses to open their World Cup campaign against first time qualifiers Haiti on 22 July in Brisbane.",
  "word_count": 331,
  "scraped_at": "2026-02-14T13:03:17.841846"
}