{
  "article_id": "1eef876e78b9",
  "url": "https://www.justarsenal.com/arsenals-eidevall-demands-pitch-improvements-of-course-players-are-going-to-get-injured/337624",
  "title": "Arsenal Eidevall demands pitch improvements  of course players are going to get injured  ",
  "date": "20230420T173000Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Arsenal’s Eidevall demands pitch improvements “of course players are going to get injured” by Michelle\nCaptain of the Lionesses and Arsenal, Leah Williamson, suffered what appeared to be a serious injury last night, as our Gunners took on Manchester United at Leigh Sports Village. Leah was injured only 12 minutes into the match, signalling to the bench for attention, and had to be helped from the pitch, to head down the tunnel.\nArsenal’s manager, Jonas Eidevall, stated after the match that there is currently no update on the duration of Williamson’s absence, implying that the pitch at Leigh Sports Village may have played a role in her injury.\nAs per SkySports, speaking after the match, Eidevall discussed Leah’s injury saying that the Man United pitch conditions may have caused it:\n“I don’t have too much information on it (Leah’s injury). Of course, it’s not good that she has to come off.”\n“I think if you see the pitch here today, it is a pitch that has a lot more to ask for and I think it’s going to continue here with the playing schedule. Playing on pitches like that, of course players are going to get injured.\n“It is something we all need to improve on, the facilities where we play, if we want to keep the players on the pitch.”\nLeah Williamson has become an essential part of Arsenal’s midfield, moving forward from her usual position in our Gunners back line. Her move to midfield was particularly necessary, in light of the injury to captain Kim Little, in the opening minutes of Arsenal’s 2-0 win over Bayern Munich at Emirates Stadium. in the UEFA Women’s Champions League quarter-final.\nLeah’s injury will also have sparked deep concern for England Women Manager Sarina Wiegman, as Leah captains the Lionesses. The FIFA Women’s World Cup 2023 takes place in July and August, in Australia and New Zealand. Losing Leah would be a major blow to Engand’s national team, with Arsenal’s Beth Mead’s World Cup attendance also seriously in doubt, due to her ACL injury.\nAre our women’s football pitches inferior to that of our men’s? It wasn’t only Leah that was slipping and sliding around Leigh Sports Village pitch last night – lot’s of players were taking big tumbles..\nSending healing thoughts to Leah for a quick recovery..\nFollow Michelle on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 415,
  "scraped_at": "2026-02-14T13:25:05.218236"
}