{
  "article_id": "1eff7ffe4032",
  "url": "https://www.mercurynews.com/2025/06/06/photographers-notebook-the-final-frame/",
  "title": "Photographer Notebook : The Final Frame – The Mercury News",
  "date": "20250607T054500Z",
  "domain": "mercurynews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Hey folks, your humble daily news photographer here.\nFrom time to time our editors ask us to do a “Photographer’s Notebook” — something to give readers a peek behind the lens.\nWell, the time is ripe for me.\nThis is my final assignment.\nAfter 45 years of chasing deadlines (the last 35 here at the mighty Bay Area News Group), I am hanging up my press pass and putting down the viewfinder.\nWith your kind indulgence, allow me to share a few images.\nI will limit this to 35 photos, maybe too many, but I want to recall the old film days when cameras let you shoot only 36 exposures.\nAnd I will save the last frame in case I see one more shot…\nResidents flee Oakland Hills Fire, Oct. 20, 1991.\nBill Graham helicopter crash, 1990\nPG&E lineman class, Livermore\nUSS Carl Vinson sailors call home after six months at sea. Alameda, 1993\nPugsley braves the rain. Concord, 1996\nApaloosa saved from drowning. Walnut Creek, 1998\nThe Drive-Thru Easter Pageant, 1995, Concord\nFinal pitch. Willie Mays and the Giants say good bye to Candlestick Park, Sept. 30, 1999\nCandlestick Park demolition. June, 2015.\nLess than two weeks after the 9/11 terror attack, Barry Bonds hits his 69th home run of the season in 2001.\nConstruction workers shag fly balls hit by San Francisco Giants during construction of Pacific Bell Park in 1999.\nCranes line up alongside the Bay Bridge as construction starts on the new eastern span. Oakland, 2004.\nLightning strikes the new Salesforce Tower. San Francisco, 2017. (Karl Mondon/Bay Area News Group)\nVictorian home saved. San Francisco, 2021.\nTransamerica Pyramid pokes through fog. San Francisco, 2022.\nSun rise through Stanford Dish. Stanford, 2019.\nMoonset, Pigeon Point Lighthouse. Pescadero, 2020.\nOlympian, swimmer Natalie Coughlin. Santa Clara, 2004\nThe Beast, Oakland Raider Marshawn Lynch, 2018\nOakland boxer Andre Ward wins Olympic gold, Athens, 2004\nCapsize, Tiburon, 2011\nAmerica's Cup victory. San Francisco, 2013\nBaby powder flies as St. Francis celebrates the first Northern California school to defeat De La Salle's powerhouse football time in thirty years, Mountain View, 2021\nRobb Nen and Bobby Estalella, Giants clinch, San Francisco, 2000\nBuster Posey and Brian Wilson celebrate Giants pennant win, Philadelphia, 2010\nMegan Rapinoe and Alex Morgan, Olympic victory, Scotland, 2012.\nGolden State Warriors' Stephen Curry and Klay Thompson celebrate, San Francisco, 2022\nGiants mascot Lou Seal sits among cardboard cutouts of fans during covid season, San Francisco, 2020\nCaldor Fire, Lake Tahoe, 2020\nTubbs Fire, Santa Rosa, 2017\nCamp Fire, Paradise, 2018\nWater drop rainbow, Clear Lake, 2018\nBay Bridge lightning, San Francisco, Aug., 16, 2020 Karl Mondon/BANG File\nThe Mercury News returns to downtown San Jose, 2014",
  "word_count": 447,
  "scraped_at": "2026-02-14T14:16:39.589798"
}