{
  "article_id": "1f1c83666c9d",
  "url": "https://cornellsun.com/2023/03/30/cornell-athletes-discuss-ivy-leagues-lack-of-athletic-scholarships-following-lawsuit-filed-by-brown-athletes/",
  "title": "Cornell Athletes Discuss Ivy League Lack of Athletic Scholarships Following Lawsuit Filed by Brown Athletes",
  "date": "20230331T050000Z",
  "domain": "cornellsun.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Two basketball players from Brown University filed a class action lawsuit against the Ivy League on March 7, arguing that Ivy League universities, including Cornell University, are in violation of antitrust laws by refusing to offer student-athletes athletic scholarships.\nOut of the 350 schools that compete in NCAA Division 1 athletics, the Ivy League’s eight institutions are currently the only ones to not offer athletic scholarships.\nDue to the 1945 “Ivy Group Agreement,” Ivy League institutions have never offered athletic scholarships. Furthermore, the Improving America's Schools Act of 1994 contained a provision under Section 568 that validated Ivy League colleges’ ability to collectively decide not to give athletic scholarships so long as students are admitted on a need-blind basis — which means that admissions policies are independent of a student’s ability to pay for tuition.\nHowever, Section 568 expired on Sept. 30, weakening the legal support for the Ivy League’s lack of athletic scholarships. The lawsuit contends that Ivy League schools’ agreement to not compete with each other in athlete recruitment through offering scholarships and other educational reimbursements violates the Sherman Antitrust Act of 1890, which outlaws actions that impede interstate commerce and marketplace competition.\nThis lawsuit follows recent broad changes in college athlete compensation. In 2021, the Supreme Court unanimously decided that the National College Athletic Association’s strict policies limiting the monetary benefits offered to student-athletes violated federal antitrust laws in National Collegiate Athletic Association v. Alston. Following the ruling, the NCAA also adjusted its policies to allow athletes to profit from their name, image and likeness.\nThe plaintiffs, current women's basketball player Grace Kirk and former men’s basketball player Tamenang Choh, are requesting punitive damages — legal recompense provided when the defendant is found guilty of a charge — in addition to any other remedies the court deems fit for all current and former Ivy League student-athletes recruited since March 7, 2019. If this request is granted, former, current and future Big Red athletes would receive appropriate compensation for their commitment to their sports.\nIn non-Ivy League schools, athletic scholarships tend to cover a portion of tuition costs or fees, but vary in size depending on the type of recruitment agreement and the NCAA sport.\nIn the past decade, Cornell has boasted more than 20 national championship teams, 20 Ivy League crowns and 11 individual national champions. In spite of this success, some Cornell student-athletes told The Sun they feel the no-scholarship policy hinders the University’s athletic programs by depriving various sports of outstanding athletes.\nCornell, along with the other Ivy League institutions, instead attracts students through its academic prestige. Will Carnevale ’25, member of Cornell men’s soccer team, described that if afforded the opportunity, he would have committed to an academically comparable university that provided an athletic scholarship.\n“The best players are not going to want to pay for school. Most of the people at a top level get a full ride to places like Duke and Stanford,” Carnevale said. “If I could have found a similar academic-level college that would also give me financial support for athletics, I definitely would have taken that over an Ivy League just because of the amount of money that I am still paying and the time I am putting in while getting no financial help.”\nErika Chin ’26, who competes for Cornell women’s fencing team, also said that she was disappointed by the University's lack of athletic scholarships. Chin explained, however, that her priority remains in her academics and that she appreciates the academic benefits the University provides to student-athletes.\n“[When I entered Cornell,] I kept academics in mind, I never went in with the intention that [my] athletic [priorities] would overpower [my] academic [priorities],” Chin said. “[As a student-athlete,] we have tutors and the study room at Bartels. My coach is [also] very understanding of our commitment to athletics and academics.”\nSydney Beers ’25, a Cornell women’s gymnastics team member who was a USA Gymnastics all-around national collegiate champion, described that she ultimately prioritized more prestigious academics over an athletic scholarship when committing to Cornell.\n“Not being able to receive a scholarship did have an influence on my decision to attend the school, however, I knew that being an athlete at an Ivy League school was a once-in-a-lifetime opportunity,” Beers said. “I get to do the sport I love while also receiving a great education.”\nHowever, Beers expressed the team’s financial frustrations due to the University not providing athletic scholarships.\n“There have been times though that my team and I have felt underfunded due to not having the perks that athletic scholarships give,” Beers said.\nLalo Serrano Apodaca ’24, a member of the men’s soccer team, noted that the University’s need-based financial aid policy — which applies to all undergraduates — provides some athletes with more affordable educational opportunities. Cornell awards financial aid based on demonstrated need, and is committed to meeting that need through grants, loans and student employment opportunities.\nStill, Serrano Apodaca agreed that athletic scholarships could elevate sports teams at the University.\n“[Not having athletic scholarships] does affect competition but I believe that need-based aid is fairly generous,” Serrano Apodaca said. “[However,] the level of play could definitely be higher if kids know that they could get their whole college [degree] paid for.”\nThe pipeline from college to professional athletics in the Ivy League does not appear as strong as in other Division I schools. While football is the most popular NCAA sport, there are only 14 active former Ivy League players in the National Football League, with none from Cornell.\nSimilarly, no Ivy League team has received a single-digit seed in NCAA basketball since Princeton in 1998. This year, Princeton became only the second Ivy League team ever to make the Sweet 16 of March Madness — the yearly collegiate basketball tournament.\nCarnevale said that Cornell’s lack of athletic scholarships contributes to the unsupportive and discouraging athletic culture at the University.\n“Our locker rooms, our equipment, just in terms of that stuff, we don’t get the same [level of infrastructure as other collegiate athletic programs] … We have old high school lockers and not much equipment. We are almost pushed to the side,” Carnevale said. “Without a scholarship, there is less incentive to continue to play the sport, especially if you’re not seeing the results you want.”\nWhen requested for comment by The Sun, the University referred to the Ivy League’s statement about the lawsuit.\nIvy League Executive Director Robin Harris defended the no-scholarship policy, referring to the world-class athletic and academic opportunities provided at Ivy League institutions and to need-based financial aid opportunities.\n“The Ivy League athletics model is built upon the foundational principle that student-athletes should be representative of the wider student body, including the opportunity to receive need-based financial aid,” Harris said. “In turn, choosing and embracing that principle then provides each Ivy League student-athlete a journey that balances a world-class academic experience with the opportunity to compete in Division I athletics and ultimately paves a path for lifelong success.”\nIn an email, media relations director Rebecca Valli told The Sun the University does not have any additional comments at this time.\nAllan Rikshpun ’25 is a Sun contributor and can be reached at ar748@cornell.edu.",
  "word_count": 1203,
  "scraped_at": "2026-02-14T12:44:47.270712"
}