{
  "article_id": "1f530bc7740a",
  "url": "https://www.thenationalnews.com/news/uae/2025/09/22/abu-dhabi-updates-rules-on-pupil-absences-for-private-schools/",
  "title": "Abu Dhabi issues rules on pupil absences for private schools",
  "date": "20250923T070000Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Abu Dhabi’s Department of Education and Knowledge (Adek) on Monday updated its rules on attendance and absence for private schools.\nIssued with immediate effect, the update specifies what constitutes excused or unexcused absence and what constitutes medical absence, as well as requirements on skipping schoolwork and parental responsibility.\nIf a pupil in grades 1 to 12 misses more than 5 per cent (nine days) of school, it is flagged as a “concern”, while in nursery the absenteeism rule is extended to 10 per cent (18 days). Schools will “identify frequent lateness and take appropriate action at their discretion”, Adek said.\nThe rules set out that absence is excused for:\n- Illness\n- Emergency medical appointments\n- Family loss (1st or 2nd degree relative)\n- Official duties\n- Competitions/events\n- Government public holidays\n- Study/exam leave\n- Government-mandated closures\nAbsence will be unexcused under these criteria:\n- Family holidays during school days\n- Staying home without notifying the school\n- Non-emergency medical appointments\n- Non-severe weather\nMedical leave\nFor medical absences, the rules specify a limit of up to three consecutive days and a maximum of 12 days annually for leave excused by parent-written sick notes.\nAny period of medical leave that exceeds three days will require a sick leave certificate issued by the Department of Health.\nIn addition, if a pupil exceeds 12 missed school days in an academic year, parents must submit Department of Health medical reports.\nAll pupils must catch up on missed work and tests, even in the event of excused absence. Adek also warned that parents have a responsibility to notify schools of any absence and provide documents to avoid it being marked as unexcused.\nNational measures\nThe Ministry of Education approved its attendance and absence guidelines for the 2025-26 academic year earlier this month.\nFive key measures were introduced, including a warning system activated after one day of unexcused absence. A notification system will inform parents immediately if their child misses school.\nA pupil’s absence is to be counted as two days if they miss school on a Friday, or the days before or after public holidays, the ministry added.\nWhat about Dubai?\nAlso this month, Dubai introduced new technical guidelines on how private school staff are hired, supported and dismissed in the emirate.\nThe measures include a standardised hiring criteria based on KHDA-approved requirements for qualifications, experience and conduct. Existing teachers must meet the new standards by 2028.\nSackable offences were listed as:\n- Criminal convictions and child protection breaches\n- Gross professional misconduct\n- Repeated unprofessional behaviour, such as dishonesty, inappropriate social media use, or culturally insensitive actions\nThese offences would result in deregistration, meaning a person is barred from working in any KHDA-regulated private school, early childhood centre, university or vocational institute in Dubai.\nEducators who resign mid-term, regardless of whether they serve their notice period, must wait 90 days to join another school. All educators must complete induction modules on safeguarding, inclusion, UAE values and professional ethics.\nNew teachers recruited\nThe academic year started on August 25, with the Gems school group welcoming more than 1,700 new teachers across the UAE and Qatar. That was lower than last year, when 1,850 teachers were recruited, but group chief education officer Lisa Crausby said it was a “good sign”, because the retention rate was improving.\nTaaleem, which operates more than 30 schools in the UAE, told The National it recorded a “significant increase in teacher recruitment this academic year, reflecting both the population boom across the country and the continued growth of our schools”.\n“In August alone, we successfully onboarded more than 500 new teachers, alongside senior leaders, learning assistants and administrative staff,” it added.\nTaaleem said there was “strong interest” from teachers in other countries who are interested in working in the UAE. It said a new hiring model meant the group starts planning recruitment a year in advance and recommended that teachers demonstrate “adaptability, cultural awareness and commitment to professional development”.",
  "word_count": 660,
  "scraped_at": "2026-02-14T12:12:05.673780"
}