{
  "article_id": "1f62fb3d799a",
  "url": "https://thepeoplesperson.com/2025/08/27/elyh-harrison-man-united-youngsters-loan-takes-off-in-impressive-display-298141/",
  "title": "Elyh Harrison : Man United youngster loan takes off in impressive display - Man United News And Transfer News",
  "date": "20250827T094500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Manchester United loanees Elyh Harrison and Dan Gore were in action last night for their new teams.\nHere you can follow all of United’s loanees in the men, women and academy squads.\nHarrison impresses\nThe United keeper has had a bit of a nondescript loan for Shrewsbury Town so far but all that changed last night with a fine performance.\nShrewsbury defeated Chelsea’s under-21s 3-1 in the Football League Trophy.\nThe evening started off poorly for Harrison as he could not stop The Blues’ opener when a ball was played across the goal and it was tapped in by Shim Mhueka from close range.\nThe Shrews fought back to equalise soon after though then Harrison pulled off a fine stop to keep the scores level against the West Londoners.\nThe ball was once again played across goal but this time the United keeper could get down low to his left hand side and beat away the effort on target.\nHe made another impressive intervention when he tipped a fierce effort onto the crossbar to keep the scores level.\nHarrison made two saves in the match and claimed a high ball to alleviate pressure from his defence.\nThe young keeper also completed 70% of his passes with him finding his intended target five times from long balls.\nHe was also able to make one clearance in the game. Playing such a crucial role in defeating such famous opponents will surely give him more confidence heading into future fixtures.\nThe Shrews will next be in action when they take on Accrington Stanley on Saturday.\nDan Gore\nGore had a less impactful night as his Rotherham United side lost 1-2 at Barnsley in the second round of the Carabao Cup.\nHe was not in the starting line up but came on in the 62nd minute of action.\nGore only managed to complete seven out of 10 passes and failed to complete either of his dribbling attempts.\nThe midfielder was also weak in his duels, losing five out of six ground battles and his only aerial contest.\nStill, he will be pleased with his football coming thick and fast after so many injuries and he will next be in action when Rotherham travel to Doncaster Rovers on Saturday lunchtime.\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 380,
  "scraped_at": "2026-02-14T12:58:31.073388"
}