{
  "article_id": "1f9642de7b0e",
  "url": "https://www.thisdaylive.com/2025/07/27/von-apologises-to-nigerians-for-misinformation-on-super-falcons-blames-hacking-for-error/",
  "title": "VON Apologises to Nigerians for Misinformation on Super Falcons , Blames Hacking for Error – THISDAYLIVE",
  "date": "20250727T221500Z",
  "domain": "thisdaylive.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Latest Headlines\nVON Apologises to Nigerians for Misinformation on Super Falcons, Blames Hacking for Error\nOlawale Ajimotokan in Abuja\nThe management of the Voice of Nigeria (VON) has tendered an unreserved apology to the nation after it wrongly published on its website that the Super Falcons of Nigeria lost the 2025 Women’s Africa Cup of Nations (WAFCON) 2-0 to Morocco when the match was still ongoing.\nThe DG of VON Mallam Jibrin Baba Ndace, tabled the apology in a statement Sunday following a public outcry that trailed the report that was published on the night the Falcons rallied from two goals down to beat Morocco 3-2 in Rabat for an historic 10th continental victory.\nNdace attributed the disturbing development to a possible identity theft through hacking, saying the agency was already investigating such security breach.\nThe management also acknowledged the error and assured the public that appropriate internal reviews were underway to strengthen editorial processes and uphold journalistic integrity.\nThe statement reads: “Dear Esteemed Nigerians and Friends of Voice of Nigeria,\n“On behalf of the management and staff of the Voice of Nigeria (VON), I extend my heartfelt gratitude to everyone who reached out with concern, support, and constructive feedback following the regrettable publication on our website on the night of Saturday, 26th July 2025, regarding the WAFCON 2025 Final between Nigeria and Morocco.\n“The erroneous report, which prematurely and falsely announced a Nigerian loss before the conclusion of the match, was both inaccurate and deeply unfortunate. Voice of Nigeria aligns with this historic moment, as our Super Falcons mounted a courageous comeback to defeat hosts Morocco 3–2, securing a record-extending tenth WAFCON title and affirming their place at the pinnacle of African women’s football.\n“We sincerely apologise for the misinformation and the confusion it caused. The integrity of our journalism is paramount, and we take this incident seriously. While initial reviews pointed to an internal lapse, we are also investigating the possibility of a security breach or identity theft through hacking, which may have contributed to this disturbing development. As a public institution, we cannot rule out such cyber threats and are taking appropriate steps to enhance the security of our digital platforms.\n“It is important to clarify that while internal editorial processes are being reviewed and strengthened, we are not placing sole responsibility on any individual staff member, including the sports reporter initially associated with the story. Rather, this episode underscores the need for comprehensive institutional safeguards to prevent such occurrences in the future.\n“As part of our ongoing internal reforms, we have introduced key editorial structures, including an Investigative Desk, a Fact-Checking Unit, and a Monitoring and Evaluation Team. We have also undertaken strategic staff redeployments to enhance accountability, build resilience, and boost editorial efficiency across our platforms.\n“These reforms reflect our broader commitment to repositioning VON as a more responsive, transparent, and globally respected media institution. At Voice of Nigeria, we embrace the responsibility that comes with being Nigeria’s official international broadcaster. We remain steadfast in our dedication to our three pillars: People, Platform, and Partnership.\n“We are deeply thankful for your engagement. Your voices remind us that accountability is not a burden; it is a cornerstone of public service.\n“Once again, thank you for standing with us not just in times of national celebration but also when we are called to reflect, correct, and improve”.",
  "word_count": 560,
  "scraped_at": "2026-02-14T12:12:29.171663"
}