{
  "article_id": "1f9809d252f0",
  "url": "https://metro.co.uk/2023/11/21/man-utd-chief-john-murtough-reacted-ineos-axe-rumours-19853423/",
  "title": "How Man Utd chief John Murtough has reacted to Ineos axe rumours | Football",
  "date": "20231121T120000Z",
  "domain": "metro.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "John Murtough is confident he still has a role to play at Manchester United going forward despite speculation he will be axed when Sir Jim Ratcliffe takes control.\nThe British billionaire is set to complete his purchase of a 25 per cent stake in the Premier League club this week, with the £1.3billion deal securing him control of sporting matters.\nChanges are already afoot behind the scenes in anticipation of an official announcement, with CEO Richard Arnold confirming he would step down before the end of the year.\nMurtough, who has been football director at Old Trafford since 2021, was expected to be the next high-profile figure out the door.\nRatcliffe and his Ineos Group team are believed to have identified United’s recruitment as an area of significant weakness and it has been Murtough who has headed up the department for the last two years.\nUnited have already been linked with a host of potential replacements, from former Tottenham and Monaco sporting director Paul Mitchell to Crystal Palace’s Dougie Freedman.\nBut, according to The Telegraph, Murtough expects to play a part in any transition under Ratcliffe and is hopeful he will be kept on beyond that.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nWhile he is unlikely to continue playing a key part in transfers, there is a feeling that his role – which extends across the academy and women’s set-ups – could evolve into something different.\nThe appointment of a new sporting director is almost an inevitability at this point, but that does not necessarily mean Murtough needs to be axed.\nIf it works for all parties, he could be handed a new role with a change to his remit and responsibilities and Ineos will need to decide if the long-serving football director – who has been at Old Trafford for over a decade – holds value to them beyond any transitional period.\nMore Trending\nThe Telegraph’s report also rubbishes suggestions that Murtough has already cleared out his office ahead of an impending exit.\nWhile departing CEO Arnold is said to have disengaged in recent weeks, Murtough has continued to work diligently and is still putting plans in place for the January transfer window.\nHe has taken a short holiday during the international break but is due back at Carrington on Wednesday, while he is said to be a visible and busy presence around the training HQ despite the increasing speculation over his future.\nMORE: Nice boss reveals Sir Jim Ratcliffe leadership style ahead of Manchester United deal\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.",
  "word_count": 487,
  "scraped_at": "2026-02-14T13:10:40.415977"
}