{
  "article_id": "1fab201e0932",
  "url": "https://azcapitoltimes.com/news/2025/11/24/meet-arizonas-power-50/",
  "title": "Meet Arizona Power 50 | Arizona Capitol Times",
  "date": "20251125T000000Z",
  "domain": "azcapitoltimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Skip to content\nMeet Arizona’s Power 50\nMeet Arizona’s Power 50\nWelcome to the inaugural Power 50.\nStaff//November 24, 2025//\nStaff//November 24, 2025//\nThese are the state’s most important people — those who hold the power and wield the influence to shape the landscape of Arizona now and in the future. From legislative leaders and behind-the-scenes strategists to business moguls and grassroots changemakers, this inaugural list goes beyond titles to spotlight the individuals who make things happen. Whether they wield power from the Capitol, a courtroom, the halls of higher education — or sometimes from the shadows — these are the players to watch.\nWhile this is by no means an exhaustive ranking of Arizona’s most impactful leaders, this list serves as a reference point and highlights those actively steering the political agenda. We hope it sparks discussion about Arizona’s future.\nBut you shouldn’t get too caught up in the rankings. The difference between No. 14 and No. 35 probably isn’t really that great.\nThis list will evolve annually. As a reader, you can be a part of it. Liked the direction we went in? Let us know. Didn’t see someone you believe should be on the list? Tell us about them.\nWe look forward to continuing to engage with you on these and other key players — and issues — shaping the state.\nThank you for reading the Arizona Capitol Times.\nTeri Hayt, Managing Editor.\n-\nGov. Katie Hobbs: As the first Democrat elected governor of Arizona in nearly two decades, Hobbs has ushered the state through a new era of divided government. While sparring with the Republican-controlled Legislature over the last three years, she broke the state’s veto record twice, narrowly avoided a historic government shutdown and managed to see a few of her own priorities cross the finish line. Hobbs, a frequent punching bag for Republicans, is celebrated by fellow Democrats for signing a repeal of the state’s near-total abortion ban, quashing the most extreme Republican legislation and increasing access to health care and other essential services. The governor will lead the top of the ticket for Democrats in the state in 2026 when she seeks a second and final term on the ninth floor.\n- Attorney General Kris Mayes: As the state’s chief law enforcement officer, Mayes stands as a Democratic bastion and counterweight to state and federal Republican policy. Since taking office in 2023, her focus has remained steady on enforcing stronger consumer protections, combating the fentanyl crisis, and targeting fraud in the state school choice program. Mayes has waded into, or decidedly stepped out of, political battles. After she refused to defend the state’s 15-week abortion law, the courts struck it down as unconstitutional. She also initiated the prosecution of the 2020 “alternate” presidential electors and is pursuing novel water litigation using public nuisance law. At the federal level, her office joined more than two dozen lawsuits against the Trump administration and saved the state an estimated $1.5 billion in federal funds. She is seeking reelection in 2026.\n- President Donald Trump: When Trump returned to the White House last November, Arizona was one of the key states to deliver him a victory. His influence was evident in the policies proposed by state Republican lawmakers, who reiterated their support for the president throughout the last legislative session. And Republican lawmakers have shaped much of their policies around his agenda, including bills calling for state law enforcement agencies to support federal immigration enforcement efforts, ending diversity, equity and inclusion initiatives at universities and government agencies and reducing the size of government.\n- Sen. Warren Petersen: Petersen, R-Gilbert, is preparing for his last legislative session as Senate president before he embarks on his campaign for state attorney general. On the campaign trail, he has touted his conservative bona fides and involvement in more than 80 lawsuits, prompting some to refer to him as the “de facto” attorney general. Petersen has either led or joined legal action in numerous issues, including the drafting of the state’s Election Procedures Manual, the Arizona Motion Picture Production Program and litigation over Arizona’s Save Women’s Sports Act. Petersen has also helped lead the Republican effort to advance President Donald Trump’s agenda at the state Legislature and has met with members of the president’s administration in the last session.\n- Rep. Steve Montenegro: As one of the most experienced members of the Arizona Legislature, Rep. Montenegro, R-Goodyear, was elected by his Republican colleagues as House Speaker for the 2025 and 2026 legislative sessions. Montenegro was first elected to the Arizona House in 2008 and served in the chamber until 2017, when he unsuccessfully ran for Congress in a special election in 2018. He returned to the Legislature in 2023 and became the state’s first Latino speaker. Despite some close calls in his first session as speaker, Montenegro has led the chamber to a bipartisan budget and ensured Arizona’s Division of Developmental Disabilities received emergency funding to keep services available for about 60,000 Arizonans.\n- Secretary of State Adrian Fontes: Fontes rode in on a blue wave in 2022 to continue a legacy of Democratic control at the Secretary of State’s Office that began with Gov. Katie Hobbs’ in 2019. A widely-respected elections expert, having steered Arizona’s largest county through the contentious and unprecedented 2020 election cycle during his time as Maricopa County recorder, Fontes uses his unapologetic air and commanding voice to fend off challenges to the security and effectiveness of Arizona’s election system. Known for his political ambitions, he has contemplated runs for governor and Congress in the last year, but will run for reelection in 2026 alongside the other top Democrats in the state.\n-\nSuperintendent of Public Instruction Tom Horne: A seasoned politician, Horne returned to the Arizona Department of Education in 2023 as superintendent after serving in the same position from 2003 to 2011 and serving as attorney general between 2010 and 2015. He took the helm at the dawn of the universal expansion of the Empowerment Scholarship Account program — the state’s school choice program, which has grown to more than 90,000 enrollees from around 12,000. Horne has trained the department to focus on ensuring greater academic outcomes and stronger school safety — chiefly by deploying more armed police officers on school campuses. He’s come back to familiar crusades from his first term, too. He litigated to ensure that students learning English are taught in English and serves as the current presidential administration’s muscle in enforcing the ban on diversity, equity and inclusion and critical race theory. As he looks ahead to his next term, Horne will face Republican Treasurer Kimberly Yee to keep his seat.\n- Michael Crow: While many see the president of Arizona State University since 2002 as simply the leader of the state’s largest public university, some see him for what he really is — the unofficial king of Tempe, Arizona. Under his leadership, ASU campuses in Tempe and beyond have evolved into some of the most innovative public universities in the United States. His vision has not only significantly expanded ASU’s enrollment but also increased its impact on Arizona’s economy, workforce development and global reputation. Crow has championed university partnerships with local industries and governments, aligning ASU’s programs with Arizona’s economic needs in its technology, sustainability and health care sectors. In 2024 alone, the university reported a $6.1 billion impact on the Arizona economy. Beyond academia, Crow has been an influential voice in Arizona’s public policy, science and education reform. His forward-thinking leadership continues to shape the state’s educational and economic landscape, making him a key figure for the state’s continued growth and progress.\n- U.S. Sen. Ruben Gallego: Gallego became the first Latino to represent Arizona in the Senate after he was elected in November 2024. Gallego has sought to make a national impact since taking office and he spent considerable portions of 2025 travelling to Pennsylvania, Iowa and New Hampshire to support other Democratic candidates, engage with voters and discuss the issues facing the Democratic Party. The national spotlight has fueled rumors of a 2028 presidential run. His high-profile Senate committee assignments reflect his commitment to border security, energy, housing and Arizona’s veterans, ensuring he remains an influential voice within the national conversation on these important state and national issues. A U.S. Marine Corps combat veteran, he has advocated for Medicaid expansion, veterans’ issues and protecting the state’s water supply throughout his legislative career.\n- U.S. Sen. Mark Kelly: Not to be confused with his twin brother and astronaut Scott Kelly, Arizona’s senior senator has made his own meteoric rise through the Democratic Party after first being elected to the Senate in 2020. Briefly rumored to be Kamala Harris’s 2024 running mate, Kelly was a key bipartisan voice in the $52 billion CHIPS and Science Act in 2022 that brought many microchip manufacturing jobs to Arizona. He has now set his sights on congressional reforms, including banning stock trading by members of Congress and ending corporate political action committees.\n-\nErika Kirk: Kirk has emerged as an influential figure in Arizona following the death of her husband, Charlie Kirk. After his assassination, she was unanimously appointed CEO and chair of Turning Point USA, one of the most influential conservative youth organizations in the country. Her leadership now carries not only political significance but also emotional and symbolic weight as she steps into the public eye amid national attention and personal loss. A former Miss Arizona USA raised in Scottsdale, Erika Kirk has long-standing ties to the state. Her influence is rooted not just in politics, but in faith-based media, where she has built a platform around Christian values and conservative messaging. With Turning Point’s national headquarters based in Phoenix, her leadership places Arizona at the center of a growing youth political movement. She is now seen as a unifying and strategic voice for a major segment of conservative America.\n-\nCharlie Kirk (posthumously): Republican candidates and conservative activists in Arizona who align with the youth-MAGA/Turning Point ecosystem still benefit from the network that Charlie Kirk helped build. Kirk’s work, as founder of Turning Point USA, a nonprofit that advocates for conservative politics on high school, college and university campuses, helped propel young conservative and Christian students at Arizona’s universities to mobilize, register and debate in favor of conservative politics and has played an undeniable role in solidifying Arizona as an important battleground state for national political debate. That influence has forced Democrat and moderate campaigns across the state to rethink their political strategy to account for this new, highly mobilized Republican base. And while the dynamic has changed since Kirk’s passing, the institutional momentum he created through youth chapters, activist culture and voter registration drives has only been emboldened by a new symbolic memorialization of his politics and character among his supporters.\n-\nKimberley Yee: Approaching eight years as head of the Treasurer’s office, Yee has maintained steadfast control while growing the state’s cash reserves. Since being elected in 2018, she has doubled assets under management to $30.2 billion from $15.4 billion. She oversaw a record high in total distributions, boasting $6 billion since taking office. Under her tenure, she’s also seen the Permanent Land Endowment Trust Fund increase by about $4 billion. Yee was the first Chinese American Republican woman to win statewide office, the first Asian American woman elected to the Arizona Legislature and the second woman to serve as Senate Majority Leader. Now, Yee looks to lodge a challenge against incumbent Superintendent Tom Horne.\n-\nSen. T.J. Shope: Shope, R-Coolidge, sponsored one of the few bills passed into law on June 30 that sought to address two of the state’s biggest issues — water conservation and housing development. The Ag-to-Urban legislation, which garnered bipartisan support, will allow farmers to sell agricultural land and the accompanying water rights to developers to boost the state’s housing supply and preserve groundwater. Shope, who serves as chair of the Senate Natural Resources committee, has been a vocal advocate for the Colorado River negotiations and for ensuring Arizona isn’t shortchanged during the discussions.\n- Sen. Jake Hoffman: As chairman of the Senate Director Nominations Committee and the Arizona Freedom Caucus, Hoffman, R-Queen Creek, has emerged as one of the most influential Republicans in the Legislature. Hoffman’s leadership of the nominations committee has put him at odds with Democratic Gov. Katie Hobbs. The committee has rejected several of Hobbs’ agency director nominees, although more were approved this past session. As Freedom Caucus chair, Hoffman has recruited and endorsed a number of Republican candidates for state and national offices and wields considerable influence within the party.\n- Rep. Julie Willoughby: After being appointed by the Maricopa County Board of Supervisors to the Statehouse to replace expelled lawmaker Liz Harris in 2023, Willoughby, R-Chandler, has quickly climbed the ranks of the House GOP caucus. When House lawmakers were running out of time to address a funding shortfall for the Division of Developmental Disabilities this year, Willoughby was among the lawmakers advocating for Arizonans who depended on the program, going against a House GOP proposal that was vetoed by the governor and working with House Democrats to find a solution just days before funding expired. Willoughby is now running for the state Senate next year and has positioned herself as one of the most influential lawmakers at the Legislature.\n- U.S. Rep. Andy Biggs: With eight-years of experience in a deep-red Congressional District 5, Biggs officially jumped into Arizona’s gubernatorial race earlier this year. The congressman quickly picked up an endorsement from Trump and the late leader of Turning Point USA, Charlie Kirk. Biggs is a former leader of the Congressional Freedom Caucus and a member of the powerful House Judiciary and Oversight Committee. He also brings state legislative chops to the table, having served in the Legislature for 14 years, including as Senate President for four of those years.\n- U.S. Rep. Yassamin Ansari: Arizona’s youngest representative in Congress is already having an impact in D.C. Ansari was named the president of the House Democratic freshman class at the beginning of the 119th U.S. Congress after she narrowly emerged from Arizona’s 2024 Democratic primary race for its third Congressional district by just more than 40 votes. The former Phoenix vice mayor is the youngest woman in Congress and the first Iranian American Democrat in the U.S. House. Ansari, a member of the House Natural Resources Committee and the House Oversight Committee, has stood staunchly opposed to the Trump administration’s immigration policy with surprise oversight visits to Immigration and Customs Enforcement detention facilities, calling for better living conditions for detained individuals.\n- Rep. Gail Griffin: One of the Capitol’s worst-kept secrets is that no water policy gets through the Legislature without Griffin’s seal of approval. The chairwoman of the House Natural Resources, Energy and Water Committee has held the role in various forms since her career as a state lawmaker began in 1997 and she has frustrated both Democrats and Republicans seeking a bipartisan update to Arizona’s rural groundwater law. Griffin, R-Hereford, has long opposed Active Management Areas in the state and has advocated for alternative solutions, which she says give rural communities greater local control and flexibility over groundwater management, but she has presented a roadblock to the governor’s efforts to regulate groundwater pumping in rural parts of the state.\n- Terry Goddard: Goddard serves as president of the Central Arizona Project board, which sets taxes and policies for the canal system that brings Colorado River water to homes throughout the state. A power player in negotiations over future use of the Colorado River, Goddard — a former Phoenix mayor, two-term attorney general and three-time gubernatorial candidate, is an unwavering advocate for Arizona’s future.\n- Gina Swoboda: Swoboda stepped into the role of Republican Party chair in 2024 to help deliver the state to President Donald Trump and increase GOP seats in the Arizona House and Senate. The party turned out to be the greatest swing state margin for Trump and raised $20 million, with the majority of the money used to directly contact voters. Trump endorsed Swoboda in her original bid for party chair and in her reelection, and she also received support from state and federal lawmakers. In July, Swoboda was hired by the state House of Representatives to help craft elections policy after working in the Arizona Senate as an elections consultant, where she served for three legislative sessions.\n- Regina Romero: Tucson’s first Latina mayor may have started her mayoral career in 2019, but she is no amateur. She spent nearly 20 years on the Tucson City Council — the first woman to ever hold the position. She has been an advocate for progressive policies in Tucson, supporting affordable housing projects and serving as the co-chair of Mayors against Illegal Guns. Having won reelection in 2023, Romero has gained traction within the Democratic Party and was the only mayor invited by the White House in 2024 during former President Joe Biden’s administration to join a federal delegation in Mexico for the inauguration of Mexico’s President Claudia Sheinbaum.\n- Kate Gallego: Gallego, the mayor of Phoenix, has represented city residents for more than a decade. After first being sworn in to the city council in 2014, she became the city’s second female mayor in 2019 and has served in the position for more than half a decade. Gallego has set a goal to make Phoenix the most sustainable desert city in the U.S. She has led efforts to build electric vehicle charging infrastructure throughout the city and established an Office of Heat Response and Mitigation to address the extreme summer temperatures that residents face. Gallego pushed back this year against lawmakers who wanted to fund renovations at Chase Field to keep the Arizona Diamondbacks in town and helped negotiate the final version of the bill.\n- Thomas Galvin: The new chairman of Maricopa County Board of Supervisors has made his mark as the leader of the nation’s fourth most populous county. Elected chairman in January, Galvin announced ambitious goals, including bringing back the Arizona Coyotes after the NHL team left for Utah in 2024. Fed up with the nation routinely waiting for word on the county’s vote tally on presidential election nights, Galvin has also helped lead Republican efforts to change state law to deliver faster election results. He also spearheaded a nearly $500,000 independent review of the county’s election processes and procedures to address complaints of recent election administration from 2020 and 2022.\n- Tom Buschatzke: As director of the Arizona Department of Water Resources, Buschatzke serves as the state’s chief negotiator on Colorado River guidelines and the protector of its water supply. Buschatzke started his career in water as an intern in the department he would eventually lead, and is now a widely-respected policy expert who can be found taking part in every meaningful conversation about Arizona water. Most recently, Buschatzke has used his authority to enact groundwater pumping restrictions in rural areas, create new active management areas in dwindling basins and usher in new state laws allowing farmland to be converted for residential use.\n- John Boelts: As president of the Arizona Farm Bureau, Boelts is a leading voice in groundwater management policy discussions for rural areas. Last session, he supported a measure from Sen. Tim Dunn that would’ve imposed a series of restrictions intended to preserve groundwater in Gila Bend, Hualapai Valley and the Willcox Groundwater Basin. Boelts has advocated for policies that strike a balance between establishing conservation measures to preserve groundwater and ensuring property owners’ water-use rights. He is also a generational farmer who owns Desert Premium Farms in Yuma.\n- Lea Márquez Peterson: Márquez Peterson is the longest-serving member of the Arizona Corporation Commission and the only statewide elected official who resides in southern Arizona. She became the first Hispanic woman in a statewide position after Gov. Doug Ducey appointed her to the commission in 2019. Now in her final term, Márquez Peterson wants to increase transparency and awareness of the commission’s work, which primarily revolves around regulating the state’s major public utility companies. When she finishes her tenure, Márquez Peterson will no doubt be recruited by Republicans to run for any number of high-profile seats at the state or federal level.\n- Nick Ponder: Ponder, the senior vice president for governmental affairs at HighGround Public Affairs Consultants, has emerged as an authority on two of the state’s most pressing issues — groundwater and affordable housing. As a lobbyist representing the League of Arizona Cities and Towns, he testified on the proposed Arizona Starter Homes Act. Ponder also represented rural counties and cities in discussions on groundwater management policy.\n- Danny Seiden: As president and CEO of the Arizona Chamber of Commerce and Industry, Seiden has tirelessly worked to bolster the state’s economy and businesses. Seiden brings a public policy background to the role, having served as former Gov. Doug Ducey’s deputy chief of staff after helping run his 2014 gubernatorial campaign. Seiden is a familiar face at the Arizona Capitol, where he can often be found chatting with lawmakers and testifying on legislation impacting the business community. Most recently, Seiden and his team at the Arizona Chamber of Commerce helped ink a deal for stadium upgrades to the Arizona Diamondbacks’ Chase Field.\n- Stephen Roe Lewis: A strong voice for Arizona’s tribal communities, the Gila River Indian Community governor has helped find solutions for long-standing issues facing the community. Lewis helped organize the opening of a managed aquifer recharge site, which has helped the community secure access to water and serves as a key cultural identity achievement. He’s prioritized youth educational opportunities and veteran support, and he was one of Arizona’s 2020 presidential electors. Lewis is in his third term as governor and serves as the National Congress of American Indians’ secretary.\n- Brenda Burman: Burman leads the Central Arizona Project as its first female general manager where she is tasked with sustainably managing the 336-mile canal system that distributes Colorado River water to Arizonans. In 2017, Burman became the first female commissioner of the U.S. Bureau of Reclamation after previous water policy roles in the U.S. Department of the Interior, The Nature Conservancy and U.S. Sen. Jon Kyl’s office. She is also an attorney with experience in Native American water rights, making her a strong asset for Arizona’s water policy community.\n- Sandra Watson: Watson is the president and CEO of the Arizona Commerce Authority, a state agency dedicated to bringing companies, jobs and capital to the state. She is one of the state’s longest-serving agency heads, having been appointed to her role when the ACA was created in 2011. Watson and the ACA have been credited with helping Arizona become a semiconductor manufacturing hub, bringing countless jobs and investments to the state.\n- Tom Savage: Lawmakers have grown accustomed to seeing Savage in the halls of the House and Senate for nearly a decade. Savage, who joined the League of Arizona Cities and Towns as a legislative associate in 2016, now serves as the League’s legislative director and represents cities at the Capitol for a wide range of issues. Before joining the League, Savage worked as a House staffer and helped research policy issues for the Agriculture, Water and Lands, and Energy, Environment and Natural Resources committees.\n- Jen Marson: As executive director of the Arizona Association of Counties, Marson’s expertise encompasses property taxes, elections, public records, criminal justice, law enforcement, justice, superior courts, education and then some. Her experience working in multiple government jurisdictions makes her the go-to person to take the stand at any number of committee hearings for counties across the state. As a certified election office, Marson has fought against election mistrust and misinformation for years. She continues to be recognized for her work, having won the Arizona Capitol Times’ Best Government Lobbyist award two years in a row.\n- Buu Nygren: A self-described carpenter, public servant and father, Nygren has spent the past two years constructing a better future for Arizona’s tribal communities as the president of the Navajo Nation. But his tenure has not been without problems, he faced a recall petition but a Navajo Nation investigation cleared Nygren of the accusations. Despite the investigation, his long term vision and steady commitment to his people did not falter. He is one of the more powerful and influential cultural and political leaders in the state. His priorities include access to water, modern infrastructure, affordable housing, and a thriving economy for tribal lands. To that end, Nygren was instrumental in negotiating with Hopi and San Juan Paiute leaders to secure a historic water rights settlement between the tribes. He also made clever use of the American Rescue Plan Act to secure more than $500 million in funding for infrastructure projects. A steadfast defender of Navajo sovereignty, he has worked to protect tribal lands from the transportation of uranium from the Pinyon Plain Mine south of the Grand Canyon.\n- Arizona Supreme Court Justice Clint Bolick: Bolick, first appointed to the court in 2016 by Gov. Doug Ducey, fought an effort to remove him from the bench over his vote to keep a statewide abortion ban in place. Despite a coordinated and funded campaign against his candidacy, Bolick kept his seat with 58% of the vote. He continues to advocate for an independent judiciary and further civic education on the state’s judicial retention system, especially as the race attracts more political and campaign interest each year. Before ascending to the state’s high court, Bolick served as the vice president for litigation at the Goldwater Institute and as the president and general counsel for the Alliance for School Choice, where he advocated for school choice, private property rights, freedom of speech and federalism.\n-\nArizona Supreme Court Justice Maria Elena Cruz: Cruz, the newest member of the Arizona Supreme Court, brings a wealth of experience from rural Arizona and is the first Latina and Black justice to serve on the court. Cruz started her career as a prosecutor at the Yuma County Attorney’s Office, pivoted to criminal defense, and then worked in family and criminal law as a solo practitioner. She has worked as a judge pro tem for the Cocopah Indian Tribe, as a superior court judge and as a presiding judge in Yuma County. Before her ascent to the state high court, she served on the Arizona Court of Appeals for eight years. Hobbs chose Cruz in January after a lengthy nomination process, slotting her to fill the vacancy left by former Chief Justice Robert Brutinel.\n-\nKarrin Taylor Robson: After a loss in the 2022 Republican gubernatorial primary, Robson has continued her fight to become Arizona’s governor. Robson is an attorney and land use consultant who has dabbled in lobbying and public service, including a stint on the Arizona Board of Regents. For the 2026 gubernatorial primary, she rebranded from an old-guard Republican backed by critics of President Donald Trump to a “MAGA” darling with the president’s endorsement. Robson is hoping her self-funded campaign war chest and lifelong conservative values are enough to make her Gov. Katie Hobbs’ challenger next year.\n- Andy Gaona: As the governor’s go-to outside counsel and a leading election attorney in the state, Gaona has sparred in court over election contests in 2020 and 2022, served as the go-to voice on campaign finance, ballot access and the inner workings of elections, and drafted and defended a host of voter initiatives over the past 10 years. He waded into and successfully defended the statewide initiative to enshrine a right to abortion, a measure to legalize marijuana and the funding fix for Arizona schools under Proposition 123. He continues to serve as a partner at Coppersmith Brockelman, where he co-leads the election and political practice with the governor’s former general counsel, Sambo “Bo” Dul.\n-\nKen Kendrick: Kendrick, a Paradise Valley resident, is more than just a baseball fan, he’s Arizona’s MVP for anything related to the Arizona Diamondbacks. Kendrick has played a pivotal role in intergovernmental relations between the state’s premier professional baseball team and its government. He was pivotal in negotiating a bill that authorized up to $500 million in public funding for stadium renovations, effectively securing the team’s future in the state and establishing an enormous tax base for Phoenix residents. Moreover, through the Ken Kendrick Grand Slam Awards and the Arizona Diamondbacks Foundation, Kendrick has contributed significantly to Arizona philanthropy, providing nearly $2 million in funding to Arizona nonprofits between 2024 and 2025. His work to renovate youth sports fields in places like Arcadia and South Mountain, and his work in the Give Back Jersey Program to supply Diamondbacks-themed apparel and uniforms to thousands of young athletes in Arizona, have both contributed significantly to the health and well-being of Arizona’s youth sports leagues.\n- Rick Smith: Smith, the founder and CEO of Axon, has solidified his status as an influential leader of one of Arizona’s most prominent companies. Axon is known for developing the Taser, body cameras and other safety technology. The homegrown company flexed its lobbying muscles last session when a ballot referendum threatened to derail the construction of its global headquarters in north Scottsdale. Smith rallied with dozens of employees and worked with lawmakers to garner support for a bill that would allow the company to complete the project. He accomplished his goal when Gov. Katie Hobbs signed a law that cleared a path for the company to proceed with its plans.\n-\nMichael Bidwill: Following the death of his father in 2019, Bidwill has worked to keep ownership of the Arizona Cardinals in the Bidwill family. He took over as the team’s president in 2006 and helped create State Farm Stadium in Glendale, which has brought an economic surge to the area and hosted multiple Super Bowls and large events, including the 2025 Memorial for Charlie Kirk and Taylor Swift’s Eras Tour in 2023. With an estimated net worth of $1.4 billion, Bidwill has taken an interest in engagement with the NFL and has held various committee roles, including the league’s Conduct Committee and the Player-Owner Committee. In 2016, he was inducted into the National Football Foundation Leadership Hall of Fame.\n- Jenny Clark: As founder of Love Your School, a multi-state school choice advocacy and support organization, Clark continues to be the first line of defense in strengthening, growing and defending school choice options in the state. Her main focus continues to be the Empowerment Scholarship Account program, with resources and one-on-one support for families to sign up, obtain disability diagnoses, and secure funding for the child to attend private school or create a tailored homeschool option. But her work does not end there. She’s assisted families with disabilities in navigating the public school system and in obtaining tax credit scholarships through School Tuition Organizations. She served on the State Board of Education from 2022 to 2025, appointed by former Gov. Doug Ducey.\n- Marisol Garcia: Garcia leads the premier labor union for more than 22,000 Arizona public school educators and has continually gone to the mat for all school employees at the local, state and federal levels. During her tenure as president of the Arizona Education Association, Garcia has transformed the union into a more visible, organized presence in political battles and public school education advocacy. Garcia has pushed for paying all school employees through the continuation of Proposition 123, a school funding measure relying on the state land trust fund. She’s fought for educators in her own district, the Isaac Elementary School District, amid a financial crisis. And she, of course, leads the charge in securing additional funding for schools across the state while fighting against what she calls “unfunded mandates”— education policies without a proper fiscal note. Garcia was first elected as Arizona Education Association president in 2022 and was reelected in May 2025.\n- John Ward: Ward, executive director of Empowerment Scholarship Accounts at the Arizona Department of Education, assumed responsibility for a program hurtling toward a $1 billion price tag, with 91,000 enrollees and growing. Prior to his current role, Ward served as the chief auditor for the department and a manager at the Arizona Auditor General’s office. He’s continued to walk a tightrope, ensuring no misspending of state funds while maintaining enough flexibility for families — a dance that continues to bring him equal doses of praise and criticism from state school choice advocates and program participants.\n- Tammy McLeod: While some plant seeds to grow trees, McLeod, through her leadership of the Flinn Foundation, plants seeds that grow industries. She has remained a mobilizing and industrious philanthropist in Arizona’s higher education community for almost a decade. McLeod has led Arizona’s bioscience sector to tremendous growth in funding, wages and jobs. Her work on the Flinn Foundation’s Arizona Bioscience Roadmap, which sets the state’s strategy for fostering growth in the industry, created the blueprint for the last decade of growth in Arizona’s bioscience community. Moreover, her work to update that roadmap for implementation in 2025 will set the course for the billion-dollar industry through the next decade.\n- Elizabeth S. Chatham: While some make their names by who they attack, others make theirs for who they protect. The latter is the case for Chatham, Arizona’s premier immigration attorney, community leader and diversity advocate. Named one of the “Most Influential Women in Arizona Business” by AZ Big Media in 2025, Chatham has built a legacy in Arizona through her legal work for Fortune 500 companies, startups, universities and more. She has dedicated herself to helping the state’s at-risk populations navigate complex U.S. immigration laws, including visa card applications, green card strategies, naturalization and more. Chatham’s work bridges the gap between Arizona’s government and its immigrant communities, and her legal expertise has made her an influential figure in Arizona’s business and political communities.\n-\nJessica Nuñez: While many would crumble and fall in the face of family tragedy, Nuñez proves that some are still willing to stand up and fight for what they know is right for their family. Nuñez rose to prominence in Arizona in 2024 and 2025 through her advocacy work after her teenage daughter, Alicia Navarro, went missing in 2019. While Navarro resurfaced four years later, her disappearance lit a fire under her mother. Even after their reunion, Nuñez’s powerful message of “never lose hope and always fight” resonated widely across the nation, prompting new calls for support for neurodivergent youth, missing children, online safety and mothers in advocacy.\n- Monica Villalobos: Villalobos brings people, data and power together. As CEO of the Arizona Hispanic Chamber of Commerce, she’s a strong advocate for Hispanics across the state. And she’s not just a figurehead. Villalobos is actively shaping Arizona’s economic landscape by working with government leaders and co-chairing key committees, like the one that helped Gov. Katie Hobbs build her administration. Through the Chamber’s annual DATOS report, she gives business and political leaders clear insight into the growing power of Arizona’s Hispanic market. She’s also a connector, building bridges between communities, companies and policymakers. With deep roots in both business and academia, she’s actively using her platform to open doors for others.\n- Robin Reed (posthumously): Reed earned his reputation by who he elevated. As CEO of the Black Chamber of Arizona, he worked tirelessly to open doors for Black-owned businesses, pushing for real access to funding, partnerships and opportunity across Arizona. He didn’t just talk about equity — he rolled up his sleeves and worked to build it. Reed’s influence reached far beyond business. He mentored leaders, advised nonprofits, and sat on boards that shaped Arizona’s education and community development. He was a key figure in bringing the state together across racial, class and industry lines. He always focused on how to make Arizona stronger and more inclusive. What made him truly powerful wasn’t just his resume — it was his character. People listened to Reed because he spoke with wisdom, led with heart, and always followed through.\nYou don't have credit card details available. You will be redirected to update payment method page. Click OK to continue.",
  "word_count": 6019,
  "scraped_at": "2026-02-14T12:44:11.416879"
}