{
  "article_id": "1fd878d00c92",
  "url": "https://www.propublica.org/article/allende-zetas-cartel-massacre-and-the-us-dea",
  "title": "How the U . S . Triggered a Massacre in Mexico",
  "date": "20230826T024500Z",
  "domain": "propublica.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "ProPublica\nHow the U.S. Triggered a Massacre in Mexico\nThe inside story of a cartel’s deadly assault on a Mexican town near the Texas border — and the U.S. drug operation that sparked it.\nThere’s no missing the signs that something unspeakable happened in Allende, a quiet ranching town of about 23,000, just a 40-minute drive from Eagle Pass, Texas. Entire blocks of some of the town’s busiest streets lie in ruins. Once garish mansions are now crumbling shells, with gaping holes in the walls, charred ceilings, cracked marble countertops and toppled columns. Strewn among the rubble are tattered, mud-covered remnants of lives torn apart: shoes, wedding invitations, medications, television sets, toys.\nIn March 2011 gunmen from the Zetas cartel, one of the most violent drug trafficking organizations in the world, swept through Allende and nearby towns like a flash flood, demolishing homes and businesses and kidnapping and killing dozens, possibly hundreds, of men, women and children.\nThe destruction and disappearances went on in fits and starts for weeks. Only a few of the victims’ relatives — mostly those who didn’t live in Allende or had fled — dared to seek help. “I would like to make clear that Allende looks like a war zone,” reads one missing person report. “Most people who I questioned about my relatives responded that I shouldn’t go on looking for them because outsiders were not wanted, and were disappeared.”\nBut unlike most places in Mexico that have been ravaged by the drug war, what happened in Allende didn’t have its origins in Mexico. It began in the United States, when the Drug Enforcement Administration scored an unexpected coup. An agent persuaded a high-level Zetas operative to hand over the trackable cellphone identification numbers for two of the cartel’s most wanted kingpins, Miguel Ángel Treviño and his brother Omar.\nThen the DEA took a gamble. It shared the intelligence with a Mexican federal police unit that has long had problems with leaks — even though its members had been trained and vetted by the DEA. Almost immediately, the Treviños learned they’d been betrayed. The brothers set out to exact vengeance against the presumed snitches, their families and anyone remotely connected to them.\nTheir savagery in Allende was particularly surprising because the Treviños not only did business there — moving tens of millions of dollars in drugs and guns through the area each month — they’d also made it their home.\nFor years after the massacre, Mexican authorities made only desultory efforts to investigate. They erected a monument in Allende to honor the victims without fully determining their fates or punishing those responsible. American authorities eventually helped Mexico capture the Treviños but never acknowledged the devastating cost. In Allende, people suffered mostly in silence, too afraid to talk publicly.\nA year ago ProPublica and National Geographic set out to piece together what happened in this town in the state of Coahuila — to let those who bore the brunt of the attack, and those who played roles in triggering it, tell the story in their own words. They did so often at great personal risk. Voices like these have rarely been heard during the drug war: Local officials who abandoned their posts; families preyed upon by both the cartel and their own neighbors; cartel operatives who cooperated with the DEA and saw their friends and families slaughtered; the U.S. prosecutor who oversaw the case; and the DEA agent who led the investigation and who, like most people in this story, has family ties on both sides of the border.\nWhen pressed about his role, the agent, Richard Martinez slumped in his chair, his eyes welling with tears. “How did I feel about the information being compromised? I’d rather not say, to be honest with you. I’d kind of like to leave it at that. I’d rather not say.”\nThe Massacre\nAs sundown approached on Friday, March 18, 2011, gunmen from the Zetas cartel began pouring into Allende.\nA few miles outside of town, the gunmen descended on several neighboring ranches along a dimly lit two-lane highway. The properties belonged to one of Allende’s oldest clans, the Garzas. The family mostly raised livestock and did odd contracting jobs, including coal mining. But according to family members, some of them also worked for the cartel.\nNow those connections were proving deadly. Among those the Zetas suspected of being a snitch — wrongly it turns out — was José Luis Garza, Jr., a relatively low-level cartel operative, whose father, Luis, owned one of the ranches. It was payday, and several workers had gone to the ranch to pick up their money. When the gunmen showed up, they rounded up everyone they could find and took them hostage. After nightfall, flames began rising from one of the ranch’s large cinder-block storage sheds. The Zetas had begun burning the bodies of some of those they’d killed.\nFrom Allende the gunmen moved north along the dry, flat landscape, rounding up people as they covered the 35 miles to the city of Piedras Negras, a grimy sprawl of assembly factories on the Rio Grande. The attackers drove many of their victims to one of the Garza ranches, including Gerardo Heath, a 15-year-old high school football player, and Edgar Ávila, a 36-year-old factory engineer. Neither had anything to do with the cartel or with those the cartel believed were working with the DEA. They just happened to be in the way.\nThe next morning, Saturday, March 19, the gunmen summoned several heavy-equipment operators and ordered them to tear down dozens of houses and businesses across the region. Many of the properties were in busy, well-to-do neighborhoods within sight or earshot not only of passersby but also of government offices, police stations and military outposts. The gunmen invited townspeople to take whatever they wanted, triggering a free-for-all of looting.\nGovernment records obtained by ProPublica and National Geographic indicate that state emergency response authorities were deluged that Saturday with some 250 calls from people reporting general disorder, fires, fights and home invasions throughout the region. But numerous people interviewed said no one came to help.\nThe Operation\nSeveral months earlier, in the Dallas suburbs, the DEA had launched Operation Too Legit to Quit after some surprising busts. In one, police had found $802,000, vacuum-packed and hidden in the gas tank of a pickup. The driver said he worked for a guy he knew only as “El Diablo,” the Devil.\nAfter more arrests, DEA Agent Richard Martinez and Assistant U.S. Attorney Ernest Gonzalez determined that El Diablo was 30-year-old Jose Vasquez, Jr., a Dallas native who’d started selling drugs in high school and was now the leading Zetas cocaine distributor in east Texas, moving truckloads of drugs, guns and money each month.\nAs they prepared to arrest him, Vasquez slipped across the border to Allende, where he sought protection from members of the cartel’s inner circle.\nBut Martinez and Gonzalez saw an opportunity in his escape. If they could persuade Vasquez to cooperate, it would give them rare access to the senior ranks of the notoriously impenetrable cartel and a chance to capture its leaders, particularly the Treviño brothers, who had killed their way onto the list of the DEA’s top targets. Miguel Ángel Treviño was known as Z-40, Omar as Z-42.\nWhat Martinez wanted were the trackable PINs, or personal identification numbers, of the Treviños’ BlackBerry phones. Vasquez had left the agent plenty of leverage. His wife and mother were still living in Texas.\nTo avoid capture, the Zetas had their closest lieutenant in Coahuila, Mario Alfonso “Poncho” Cuéllar, provide them new cellphones every three or four weeks. Cuéllar assigned the job of buying the phones to his right-hand man, Héctor Moreno.\nUnder pressure to get the phones’ PINs, Vasquez turned to Moreno, using a little leverage of his own. It was Moreno’s brother, Gilberto, who had been caught driving the truck with $802,000 in the gas tank. Facing 20 years in prison, Gilberto had confessed that he was working for the Zetas and that the cash belonged to the Treviño brothers.\nVasquez arranged for his lawyer in Dallas to represent Gilberto and promised not to let anyone else in the cartel know about Gilberto’s incriminating statements. Moreno repaid the favor by agreeing to get Vasquez the numbers. But when the time came, Moreno had second thoughts.\nThe Takeover\nLawlessness was not unfamiliar to people in Allende. Because of its proximity to the U.S. border — residents do their weekend shopping in Texas — there had long been families engaged in smuggling who lived quietly within their communities. But by 2007 the Zetas moved in with the money and muscle of a hostile occupation. They vanquished rivals, took control of critical government agencies, turned local police into their henchmen and transformed the region into a haven for all kinds of criminality.\nThen the traffickers embedded themselves in society — buying businesses, staging galas, recruiting from or marrying into local families.\nThe Mexican newspaper El Universal published a story about the 2009 murder. It reported that Piña’s body, found behind a Catholic elementary school, had been “riddled with bullets.” The story said the rancher’s tongue had been cut out, his fingers cut off and one of them was stuffed inside his mouth. The killers attached a written missive: “We don’t mess with you. Don’t mess with us.”\nThe Leak\nAbout three weeks after Vasquez provided the PIN numbers to the DEA, the cartel’s leaders got word that one of their own had betrayed them and launched a frenzy of retribution.\nLaw enforcement sources close to the case said that after Martinez gave the intelligence to his superior, it was passed to a DEA supervisor in Mexico City. He, in turn, shared it with a Mexican federal police unit that had been specially created to conduct operations under the DEA’s direction.\nMost members of the Sensitive Investigative Unit receive mandatory training and vetting by the DEA. But several current and former DEA agents said despite that vetting, the unit has long had a poor record of keeping information out of the hands of criminals. Among the most glaring problems, they say, is that Mexico doesn’t allow the DEA to scrutinize the unit’s supervisors in the same way as it does the unit’s members. Two law enforcement officials close to the Zetas case said their own inquiries revealed that a supervisor in the SIU was responsible. Former senior members of the Mexican Federal Police who worked closely with the unit did not respond to multiple requests for interviews.\nEarlier this year, one of the unit’s supervisors, Iván Reyes Arzate, turned himself in to U.S. federal authorities to face charges of sharing information about the DEA’s investigations with drug traffickers. It’s unclear if Reyes was the source of the leak in the Allende case.\nAs for the Zetas, it wasn’t hard for them to identify who within the cartel may have betrayed them since very few people had access to their PIN numbers.\nVasquez, Moreno, Cuéllar and Garza, whose family’s ranch was the scene of many of the killings, fled to the United States when the massacre began and agreed to cooperate with U.S. law enforcement in exchange for leniency. Their horrifying accounts of what was going on in Allende made American authorities aware of what they had unleashed.\nThe Aftermath\nFor years state and federal authorities in Mexico didn’t appear to make a real effort to delve into the attack. Mexican federal authorities said their predecessors didn’t investigate because the killings couldn’t be linked to organized crime, but acknowledged that they also have not investigated.\nEstimates of the number of dead and missing vary wildly between the official count, 28, and the one from victims associations, about 300. ProPublica and National Geographic have identified about 60 people whose deaths or disappearances have been linked by relatives, friends, victims’ support groups, court files or news reports to the Zetas siege that year.\nRelatives were left on their own to try to piece together what had happened and to rebuild their lives.\nIn May 2011 Héctor Reynaldo Pérez filed a missing person report with state authorities. His sister, who had married a Garza, had disappeared along with her entire family. Less than a year later, Pérez himself disappeared. A report by independent human rights investigators at the Colegio de México found evidence that Pérez was last seen in the custody of Allende police officers.\nAfter that, few victims’ relatives dared to turn to authorities for help, much less talk publicly about their ordeal. Several moved to the United States.\nNo family lost more members than the Garzas. Nearly 20 are believed dead, including 81-year-old Olivia Martínez de la Torre and her 7-month-old great-grandson, Mauricio Espinoza. The baby’s siblings, Andrea and Arturo Espinoza, 5 and 3 at the time, turned up at a Piedras Negras orphanage after their parents had been killed.\nTheir paternal grandmother, Elvira Espinoza, a hotel housekeeper in San Antonio, went with her husband to fetch them.\nThree years after the Zetas’ rampage, Coahuila’s governor, Rubén Moreira, announced that state officials would investigate what happened in Allende. With great fanfare, officials launched a “mega-operation” to collect evidence and find the truth. Victims’ families and Allende residents say it has been little more than a publicity stunt. The inquiry has produced no conclusive DNA results, nor a final tally of the dead and missing.\nFewer than a dozen suspects have been arrested — most of them former local police and cartel grunts who followed orders. No one has been charged with murder. In 2015 the Coahuila State Prosecutors’ Office began a series of meetings with relatives of those victims whom investigators believed — based on confessions — were dead. They handed out death certificates, despite having no bodies, that listed such causes of death as “neurogenic shock” and “total combustion due to direct exposure to fire.”\nThe Treviño brothers were eventually captured, Miguel in 2013 and Omar in 2015, in operations led by Mexican marines. Since then, the cartel’s hold on Coahuila has weakened, and nightlife has returned to Allende, though many residents remain emotionally scarred and leery of strangers. They fixate on reports of drug-related violence, worrying that the Treviños are exerting control over the drug trade from prison.\nThe DEA takes credit for the captures but won’t say what, if anything, it did to investigate how the information about the PIN numbers wound up in the hands of the Zetas. Terrance Cole, Martinez’s supervisor in Dallas, and Paul Knierim, then a DEA supervisor in Mexico City who served as a liaison with the DEA-trained Mexican federal police unit, declined to be interviewed.\nKnierim has since been promoted and is now the agency’s deputy chief of operations in Washington.\nBut Martinez agreed to speak, briefly choking up when asked about his role in the massacre. Named agent of the year in 2011, he is now battling kidney cancer, and so far aggressive treatment has failed. Russ Baer, a DEA spokesman, twice flew from Washington, D.C., to Texas to monitor interviews with Martinez and another agent there. As Martinez spoke, Baer interrupted to stress that the top Zetas were in prison and the agency’s investigation was ultimately a success.\nInterviews for this story have been condensed and edited for space and clarity.",
  "word_count": 2552,
  "scraped_at": "2026-02-14T12:04:58.286888"
}