{
  "article_id": "1fdfe5c8708c",
  "url": "http://europe.chinadaily.com.cn/a/202402/06/WS65c16ef3a3104efcbdae9d49.html",
  "title": "Dalian sets new goals to boost its soccer legacy",
  "date": "20240206T030000Z",
  "domain": "europe.chinadaily.com.cn",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Dalian sets new goals to boost its soccer legacy\nDalian in Northeast China's Liaoning province has unveiled a blueprint aimed at boosting the development of local soccer in an ambitious move to revitalize its reputation as a \"soccer city\".\nThe \"Dalian Soccer Development and Revitalization Plan\", which was announced on Saturday at a citywide soccer development conference, earmarked an annual investment of 50 million yuan ($7 million), starting in 2024, to bolster various initiatives, including campus soccer, youth training, community soccer, professional soccer and women's soccer projects.\nAccording to the plan, Dalian will establish its own annual soccer super league, starting this year, and develop the league into a comprehensive, year-round event that covers the entire region. By 2025, the goal is to develop a soccer industry exceeding 20 billion yuan.\n\"We'll make efforts to become more competitive, aiming to be a Chinese Super League club within three years,\" said Chen Dong, general manager of Dalian Yingbo Football Club, a China League One team.\nChen expressed his confidence in Dalian's soccer development, emphasizing the club's commitment to its pivotal role in driving forward the city's soccer initiatives. He said that in the new season, the club's lineup will mainly comprise players from Dalian or those who participated in the city's youth soccer training programs, providing more opportunities for young players.\nBoasting a glorious soccer legacy, Dalian has trained more than 200 Chinese international players since 1949. It was also part of the first group of nine key national soccer development cities during the 14th Five-Year Plan (2021-25), endorsed by the General Administration of Sport in January 2022.\nThe latest initiative comes after the dissolution of the Dalian Professional FC, a prominent Chinese Super League club. Last month, when Dalian Pro announced that it was disbanding due to financial difficulties, countless fans in the city and beyond expressed their frustration.\nWith the goal of revitalizing Dalian's reputation as a \"soccer city\", the plan also emphasizes exploring unique development paths and experiences tailored to match the city's characteristics.\nIt aims to fortify soccer training programs, promote community soccer, foster a conducive development environment, strengthen women's soccer foundations, expand talent pools, boost soccer-related economic activities, and take forward Dalian's unique soccer culture.\nKey initiatives outlined in the plan include hosting over 35,000 matches annually, gradually increasing the number of soccer fields to over 1,300, and registering more than 2,000 coaches and 2,500 referees by 2025.\nThe plan also envisages strengthening soccer training at 300 schools, building and operating two city-level and 12 district-level youth soccer training centers, and registering over 22,000 young players.\nFormer international player Sun Jihai, who is considered a trailblazer for both Chinese and Asian soccer, expressed his support for the plan, highlighting the focus on soccer reform and youth training.\nSun recently signed a cooperation agreement with Dalian Jinpu New Area to establish a soccer training program, targeting talented young players nationwide, ages eight to 18, with a 10-year comprehensive training cycle.\n\"The program, based in Jinpu, will adopt an integrated approach, combining professional soccer skill training with academic education to ensure holistic development of the participants,\" he said.\nThe former Manchester City defender said he aims to transform Jinpu into a core base for future soccer development, spreading its influence across Northeast China and the Beijing-Tianjin-Hebei region.\nShi Futian in Beijing contributed to this story.\nMost Popular\n- Guangdong beats Macao 2-0 in first leg of soccer cup\n- Para teams set to leave mark on ice\n- US skier Johnson wins women's downhill as Vonn crashes at Milan-Cortina Games\n- Su Yiming clinches first medal at Milano-Cortina\n- Over 300 athletes from 35 countries and regions kick off Asian championships in Tianjin\n- Legacy of Beijing 2022 lives on as Milan welcomes Games",
  "word_count": 626,
  "scraped_at": "2026-02-14T12:41:17.836479"
}