{
  "article_id": "1fe3455302cd",
  "url": "https://www.nytimes.com/athletic/5783006/2024/09/21/chelsea-sonia-bompastor-key-takeaways/",
  "title": "Sonia Bompastor first Chelsea WSL game : Key takeaways from Aston Villa win",
  "date": "20240921T073000Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sonia Bompastor collected her first points as Chelsea manager with a 1-0 win against visitors Aston Villa on the opening night of the new Women’s Super League season.\nA left-footed effort from the edge of the area by Sweden winger Johanna Rytting Kaneryd just past the half-hour proved the only goal of the game. But Bompastor needed goalkeeper Hannah Hampton to be alert in saving her opposite number Sabrina D’Angelo’s header from a free-kick in stoppage time to ensure a first competitive win.\nAdvertisement\nThough an impressive pre-season had given the impression that Chelsea would hit the ground running, this display at home ground Kingsmeadow against opponents who finished in the bottom half last season showed Bompastor has more work to do.\nThe performance revealed how many unknowns there are about this Chelsea side, who have a new leader for the first time in 12 years after Emma Hayes left at the end of last season to manage the U.S. women’s national team.\nDid the attempt at a possession-based style work?\nA switch to a more possession-based style was emphasised by Bompastor during pre-season as a key difference between her and Hayes. But Chelsea struggled to control the ball against Villa and the game finished with them having had 47.5 per cent of it. They only registered lower than that in four games all last season — in WSL wins over Manchester United and Arsenal and against Barcelona in both legs of their Champions League semi-final defeat.\n“We didn’t recognise during the game where we should have played,” Bompastor said in her post-match press conference.\n“You need to take into account the scenario of the game, especially the second half. Aston Villa were trying to score. They put us under a lot of pressure. When the opposition put you under pressure, you have to find a more direct style of play. That’s the way it works sometimes, because if you keep playing short when the opposition are pressing you, it can be difficult.”\nCredit should also be given to Villa, who are a bit of an unknown under their own new manager, Robert de Pauw. De Pauw explained after the game that he had set his team up to disrupt Chelsea’s attempts to control the ball. Villa began the night with four midfielders. “In the first 10 minutes, Chelsea were ‘storming’, and the only way you can lower that storm is to keep the ball yourself,” he said. “That’s why I chose players that can hold onto the ball. After 10 minutes, it calmed down.”\nAdvertisement\nBompastor pointed to Villa’s 2-1 pre-season win over Manchester City, second to Chelsea last season only on goal difference, as evidence of her opposition’s competence. They will cause problems for more teams than Chelsea.\nDid any old faces take their chances?\nA new manager coming in gives a squad a clean slate and two players have looked like they are already thriving under Bompastor.\nMatch-winning midfielder Rytting Kaneryd had fought her way into Hayes’ starting line-up by the end of last season but was still a little goal-shy in her second year with Chelsea. Her finish on Friday night was far removed from the player who had only scored five goals in her previous 71 appearances for the club.\n“We were talking with JoJo (Rytting Kaneryd) and trying to make her realise she is able to come inside and shoot with her left foot,” said Bompastor. “She was practising that over the last week. I’m so happy because it worked tonight. A great shot, a great goal. It will give her more confidence.”\nKadeisha Buchanan also impressed. The Canada international defender previously played under Bompastor at leading French club Lyon. She left for Chelsea after Bompastor’s first year in charge, 2021-22, and struggled to establish herself in Hayes’ team. Against Villa last night, she was used on the right of a centre-back pairing with Millie Bright.\n“I know Kadeisha really well, I know what she can bring to the team. She has so much experience. She’s a real defender, she likes to defend one-on-one. She’s so strong,” Bompastor said post-match.\nWith England defender Jess Carter having left over the summer to join New York-based Gotham FC, there is a centre-back position to be claimed, and Buchanan turned in an artful audition here.\nGO DEEPER\nWSL storylines to watch: The Bompastor era begins, but fewer women managers\nHow did the Bronze Age start?\nChelsea’s ‘star’ signing this summer has been Lucy Bronze, but the 125-cap England right-back demonstrated some of the concerns around her recruitment in this match. At points, she looked out of her depth positionally as she tried to deal with impressive Villa full-back Paula Tomas.\nAdvertisement\nSpeaking at the WSL’s media day ahead of the start of the season, Bronze emphasised that how defensive or attacking her game is always gets influenced by whoever her manager is at the time.\n“Maybe people think that I’ve only ever done one thing,” she said. “But I’ve always done what the manager has asked me to do. If that’s to defend for 90 minutes, I can defend. I enjoy it — that’s why I’m a defender!”\nBronze has shown, in recent appearances for England and previous club Barcelona, that at age 32 (33 next month) she cannot get up and down the line like she used to. But her role for Chelsea might have subtly altered over the past week anyway — and not by choice.\nBompastor revealed ahead of the Villa match that left-back Niamh Charles had had surgery on a dislocated shoulder sustained in Chelsea’s final public pre-season warm-up game against Dutch side Feyenoord. This was a big blow for the club. Charles was one of their outstanding performers from last year, ironically with Hayes having wanted her to model her game on Bronze herself.\nCanada international full-back Ashley Lawrence started in her place here but there was not the same purpose in her play when it came to pushing up the field that Charles had offered in pre-season. In those games, Bronze had tucked in more, either as part of a quasi-back three or to offer support in midfield.\nBronze’s influence at Chelsea goes beyond football, with her experience and leadership crucial in a dressing room with plenty of young players. But Bompastor will have to make adjustments to ensure she gets the best out of her.\nGO DEEPER\nAitana Bonmati exclusive: Barcelona's Ballon d'Or winner tells it like it is\n(Top photo: Ryan Pierse/Getty Images)",
  "word_count": 1084,
  "scraped_at": "2026-02-14T12:22:53.488056"
}