{
  "article_id": "20013929d24b",
  "url": "https://japantoday.com/category/entertainment/fall-music-releases-pop-powerhouses-country-classics-hip-hop-heavyweights-and-beyond",
  "title": "Fall music releases : Pop powerhouses , country classics , hip - hop heavyweights and beyond",
  "date": "20230909T000000Z",
  "domain": "japantoday.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The requested article has expired, and is no longer available. Any related articles, and user comments are shown below.\n© Copyright 2023 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.Fall music releases: Pop powerhouses, country classics, hip-hop heavyweights and beyond\nBy MARIA SHERMAN LOS ANGELES©2026 GPlusMedia Inc.\n5 Comments Login to comment\nCapuchin\nBeen a solid year for music so far. These are my personal recs that have been on heavy repeat on my personal music listening device of choice.\nBudos Band - Frontier's Edge EP\nMore epic, dusty, cinematic funk and afro-beat from the New Yorkers.\nStuck - Freak Frequency\nExcellent album of propulsive, angular, polit-punk that fans of Fugazi and Minute Men might appreciate.\nJPEGMAFIA & Danny Brown - Scaring the Hoes\nBest hip-hop album of the year so far. If you want rap with imagination and ingenuity look no further.\nWeval - Remember\nSuper chill, lush electronic-pop from the Dutch duo with impeccable production skills.\nMADMADMAD - Behavioural Sink Delirium\nSquid - O Monolith\nMore excellent case studies in the recent UK revival of forward thinking rock bands that prove that guitar based music isn't dead and still ripe for exploration.\nMoonraker\nEd Sheeran though. What is it about him? I just don't get it.\nThanks for the recommendations, Capuchin. I'm always on the lookout for something else.\nbrowny1\nCapuchin - surely a heap of variety there. I'll check the Budos Band and Weval.\nDanny Browns lyrics are like a pastiche from the 90s women hater genre - as in hate ya guts fervor.\nstarpunk\nMoonrakerToday 09:49 am JST\nEd Sheeran though. What is it about him? I just don't get it.\nMe either. I had hope for his potential at first but he just seems like a wussy to me.\nThanks for the recommendations, Capuchin. I'm always on the lookout for something else.\nYeah, thanks for the references. Gonna check them out on bandcamp and/or Youtube. They're good sources for finding new interesting music.\n'Turn the dial for a coupla miles but I couldn't find the rock'n'roll!' - Bryan Adams\nLet alone any with brains!\nI remember during college how videogenically cute Kylie and playful was and songs were the times were good. I still want to do the LocoMotion with her but her recent stuff has been sex robotic junkola.\nDoja Cat's new release cover art brings out the arachnophobia in me. I hate spiders! I seen one, color it dead.\nI heard a track or two of Dolly's new 'rock' album and I'm not impressed. Sorry, folks. Getting inducted into the R'm'R HOF doesn't mean you are. At least Willie Nelson put out a reggae CD and reggae is a genre of rock.\nAnd the writer forgot something big coming out next month. Two things, actually. A VH box set of the 'Van Hagar' years is coming out in Rocktober, from '5150' to 'Balance' with a bonus CD of B-sides, movie themes and other extras. And LBNL, the Rolling Stones have a new CD of all new songs (12 of them!) coming up this October. Check out their visually appealing in every way (mhm) new video for 'Angry', which is anything but in content ; )\nStrangerland\nEd Sheeran though. What is it about him? I just don't get it.\nBut millions and millions do. And as music is subjective, the only objective qualification to whether an artist is any good, is whether people like that artist or not. And clearly, many, many people like him, so objectively, he is very, very good.\nNot my type of music, but I respect his talent for creating music many people love. How many of you have ever written a song? Did it sell millions?",
  "word_count": 628,
  "scraped_at": "2026-02-14T13:37:15.942925"
}