{
  "article_id": "200a40bffcc7",
  "url": "https://www.nzherald.co.nz/entertainment/oj-simpson-made-in-america-made-by-tv/WVD5HNXCARGETHVX6N7QAN552I/",
  "title": "OJ Simpson : Made in America , made by TV",
  "date": "20240412T073000Z",
  "domain": "nzherald.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In OJ Simpson’s life and trials, television was a spotlight, a microscope and a mirror.\nOne of the strangest quotes I can remember associated with O.J. Simpson came from broadcaster Al Michaels during the notorious freeway chase in 1994. Michaels, a sports commentator now covering the flight from the lawof one of America’s biggest celebrities, said that he had spoken with his friend Simpson on the phone earlier. “Al,” Michaels recalled him saying, “I have got to get out of the media business.”\nFor a man who was about to be arrested and charged with the murder of his ex-wife, Nicole Brown Simpson, and her friend, Ron Goldman, it was an odd statement. But it was accurate. Simpson, during and after his pro football career, was a creature of the media business. With the freeway chase, and the acrimonious trial on live TV, he would essentially become the media business. Simpson, who died Wednesday at age 76, was one of the most-seen Americans in history.\nWhat did people see when they looked at OJ Simpson? A superstar, a killer, a hero, a liar, a victim, an abuser, an insider, a pariah — often many of these at once. In his fame and infamy, he was an example of what celebrity could make of a person and a symbol of what the media could make of a country.\nSimpson’s football career made him a TV star in itself, as he became the first NFL running back to rush for more than 2,000 yards in a season, with the Buffalo Bills. But he found his way into mass-market stardom during the commercial breaks, doing endorsements for RC Cola, Chevrolet and, most famously, Hertz rental cars.\nAs the documentary O.J.: Made in America would later detail, race was a subtext of Simpson’s fame, even in his pitchman days. There was a sense of social relief in having white America, after the civil-rights battles of the 1960s, embrace a charismatic Black star. It felt good for the country to like O.J.\nBut it also required a complex negotiation, particularly in his most famous ad campaign, for Hertz. There was anxiety over how white viewers would take the image of a powerful Black man running through an airport — would it be thrilling or threatening? The commercials made sure to include white onlookers cheering “Go, O.J., go!” as if to validate his passport to mainstream stardom.\nActing roles followed, in Roots, the Naked Gun movies, the early HBO sitcom First and Ten. His fictional and pitchman roles would play up his image of innocuous charisma — an image that would echo surreally in his televised trial and the public reaction to it.\nThe murder case would show electronic media’s power to bring a country together and to rip it apart. The low-speed chase on the Southern California freeway was one of those where-were-you-when monoculture moments, like an earthbound perversion of the moon landing. It happened on a Friday night, interrupting Game 5 of the NBA Finals, riveting tens of millions of viewers, none of them — at home or in the broadcast studios — knowing if they were about to witness a death on live TV.\nBut amid this classic mass-media, global-village moment, there were signs that the case was already becoming something more surreal and disjointed, a macabre carnival that would consume TV. People showed up on the freeway with signs and cheers, as if to an NFL playoff game. A prank caller, evidently a Howard Stern fan, got on the air on ABC and saluted the anchor Peter Jennings with a hearty “Baba Booey.”\nThe trial, once it began, was the biggest series on TV, although even that feels like an understatement. What part of TV, in 1994 and 1995, wasn’t the O.J. Simpson trial? It was The Tonight Show, Larry King Live and Norm Macdonald’s Weekend Update on Saturday Night Live. It was the first topic of conversation in the morning and the last, on cable news, at night. It inspired a Seinfeld episode and a fantasy sequence on Roseanne in which prosecutor Marcia Clark (Laurie Metcalf) crawls out of the TV to talk to Roseanne Conner (Roseanne Barr), who provides her with the missing murder weapon.\nThe trial was all TV. It was every kind of TV. It was a soap opera. It was a legal thriller. It was an interactive whodunit before the age of murder podcasts. It was a social drama that exposed racial chasms and the flaws of the legal system. It was a dark comedy with buffoons, villains and comic-relief figures.\nIt was a tragedy too, of course, and viewers could not agree which part of it was a tragedy, and that too was the tragedy.\nIt was also a preview of coming attractions. It was the model for the all-in immersion coverage that 24-hour news would apply to everything from wars to missing-persons cases to sex scandals. All-O.J.-all-the-time would seamlessly become all-Clinton-Lewinsky-all-the-time, complete with legal commentators reprising their roles.\nBut even as the Simpson case showed the media’s power to plunge us all into the same story, it also revealed how different communities could inhabit different realities. We could watch the same trial, with the same testimony, but disagree not just on the proper verdict but on the stakes of the case.\nIt was open-and-shut or it was built on fraud. It was about domestic violence against women or it was about racism. It was about how the rich and famous were above the law or about how Black defendants were beneath it. It was about the crimes of a person or the crimes of a system.\nLike the home audiences caught reacting to the verdict, some cheering and some wailing, we would become a split-screen nation. Eventually, with TV news augmented by partisan outlets and social media, people would come to many more stories — elections, wars, pandemics — encased in their own ecosystems, listening to their own experts, believing their own facts.\nAs for the Simpson case, TV would eventually catch up with the more complicated reality. In 2016 both the Made in America documentary and the miniseries The People v. O.J. Simpson: American Crime Story laid out the case against Simpson as well as the trial’s racial-historical context. Taken together, they suggested that you could believe Simpson guilty without believing the system innocent.\nNuance and complexity are still possible. But they tend to work on the slow, patient timetable of history. As far as the daily news is concerned, on the other hand, we still live in the world that the Simpson trial created. This week, OJ Simpson finally left the media business. The rest of us are stuck with it.",
  "word_count": 1118,
  "scraped_at": "2026-02-14T13:39:54.910262"
}