{
  "article_id": "201e1ccddd7e",
  "url": "https://www.fcbarcelona.com/en/club/news/3952796/premiere-for-barca-one-fc-barcelonas-new-free-streaming-platform",
  "title": "Premiere for Barça One , FC Barcelona new free streaming platform",
  "date": "20240405T014500Z",
  "domain": "fcbarcelona.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Premiere for Barça One, FC Barcelona's new free streaming platform\n- label.aria.viber Viber\n- label.aria.whatsapp WhatsApp\n- label.aria.twitter Twitter\n- label.aria.facebook Facebook\n- label.aria.messenger Messenger\n- label.aria.link label.aria.tick Copy link\nToday saw FC Barcelona present Barça One, the new worldwide free streaming platform through which the Club gathers the best selection of Barça-based content from across the audiovisual market. The project makes the Club's content available to everyone by offering it free of charge around the world, in a first of a kind endeavour.\nThe best in the category for football content worldwide, the OTT was presented at the Mirador Torre Glòries in Barcelona, one of the city's most iconic buildings, which was lit up in blaugrana for the occasion. Presented by the comedian Charlie Pee and journalist Llorenç Tarrés, the event was attended by FC Barcelona president, Joan Laporta, who was joined by men's football first team players, women's football first team players, and several players from the Club's handball, futsal and roller hockey teams.\nFramed by the legendary \"Go out and enjoy\" slogan, the event saw speeches from both the institution and its management, featuring Joan Laporta, the Club's president, Toni Cruz, Barça Studios director, and Elena Neira, a new digital business expert and Barça One consultant.\nThe event also featured a few words from Xavi Hernández and Araujo, the protagonists of two of the new shows on the platform ('The Album' and 'Origins'), plus Marta Torrejón from the women's football team, and the respective captains of the handball, futsal and roller hockey teams, Dika Mem, Sergio Lozano and Sergi Panadero.\nThe event was also attended by Maria Assumpció Romero, FC Barcelona member 454, who was the first person to try the platform as a representative of the FC Barcelona fans, who can now enjoy this new audiovisual service.\nWhen it comes to the content, the new Barça One formats were presented by the people who feature in the relevant spaces, namely Mireia Germán and Diego Lorijn (Barça News), Robert van Eeckhout, Marc Brau, Pol Martínez and Llorenç Tarrés (Barça Live) and Patricia Domínguez (new originals).\nThree user levels: from free of charge to 1.99 euros a month\nBarça One is a natural and necessary evolution from Barça TV+ that brings to fruition the Club's commitment to create a benchmark project in the entertainment industry. Using Barça One simply requires downloading the platform's app using any smart device or Smart TV or going to the website.\nThe platform has three user levels. The most accessible option is available free of charge with advertising. Another free of charge option requires registration, but allows for channel customisation, creation of personal playlists, receiving recommendations, watching exclusive content, and receiving scheduling information, among other features. Lastly, there is a Premium subscription service for 1.99 euro a month, with no adverts and the option to download content to watch wherever and whenever you want.\nThis range of modes means FC Barcelona are adapting to new reality of streaming services, with a formula of freely available content that alleviates the financial burden for the user. It is a change in business model that will represent a new way to generate income worldwide and is an opportunity to spread the Barça brand internationally. Furthermore, the platform is readied for interactive and non-invasive advertising formats, improving both user experience and offering major opportunities for advertisers around the world.\nAvailable throughout Europe, the United States of America, Uruguay, Argentina, Brazil and Mexico\nFC Barcelona members will have access to the Barça One Premium version free of charge, and previous BarçaTV+ subscribers will automatically obtain the Barça One Premium service for the same period they contracted BarçaTV+.\nBarça One aims to reach the entire world from Barcelona and the content will go out in Catalan, Spanish and English. It is initially available throughout Europe, the United States of America, Uruguay, Argentina, Brasil, and Mexico, and will soon be rolled out in other countries.\nA commitment to live and original content\nBarça One has a wide range of live content that includes a news programme from Monday to Friday featuring all the latest news about the Club (Barça News), live programmes during men's first team training sessions (Barça Live), recordings of youth football matches, etc.\nWhen it comes to producing original content, there is the notable documentary series 'Origins', which goes into the path and personal background of the men's first team players, with the first episode featuring Araujo already available, soon to be followed by episodes about Balde and Fermín López, plus the 'The Album' series, which features the Club's legendary figures, with an episode featuring Xavi Hernández already available, and episodes about Rafa Márquez and Deco also soon to follow.\nSeries about men's and women's first teams\nThere will also be a place for the women's team in ‘Born to Play’, which tells the stories of the different players, beginning with episodes on Patri Guijarro and Fridolina Rolfö. And this summer Barça One will be releasing one of its biggest products, the first team documentary from the 2023/24 season, which will be focusing especially on the younger players.\nAnd there is also a series called ‘We are the Academy’, which will be looking at different soccer schools that the club runs around the world.\nOther sports and club history\nAs well as extensive live coverage of the men's and women's Gamper Trophy events and the presentations of the different teams, Barça One will also be offering year-round coverage of its other sports teams. Fans will be able to enjoy live broadcasts of the Final Four of the Futsal Champions League, with Barça opening on May 3 against Sporting Lisbon.\nThe service will also be screening over 1,500 hours of video from the Barça TV archives (matches, shows, reports, historic content and so on). All of these contents will be showcasing the things that make the club so unique in the world, meaning it can reach out to so many different audiences and also the fans of the future.\nStatement by Joan Laporta, president of FC Barcelona:\n“This is day for congratulation with the launch of Barça One. It is the finest audiovisual platform that a sports club has ever had, a window on the world with the very best Barça themed content. Barça is more than club and will also be just so because of its audiovisual service”.\nStatement by Toni Cruz, director of Barça Studios\n“We have been working on Barça One for a year, a product that is right at the forefront of the sports streaming world. A change like this doesn't just happen on its own. This has been a real team effort. The Barça One content will explain who we are and where we've come from, including our men's and women's players. We will be giving exposure to groups like the Barça Legends, the Fundació Barça Genuine too, so the whole world can see what kind of people we are at Barça. And we'll be doing it in Catalan, Spanish and English. Come in and enjoy!”\n- label.aria.viber Viber\n- label.aria.whatsapp WhatsApp\n- label.aria.twitter Twitter\n- label.aria.facebook Facebook\n- label.aria.messenger Messenger\n- label.aria.link label.aria.tick Copy link",
  "word_count": 1193,
  "scraped_at": "2026-02-14T12:52:39.168013"
}