{
  "article_id": "203046cafb36",
  "url": "https://www.thehindubusinessline.com/companies/pumas-new-boss-takes-helm-trailing-adidas-and-a-recovering-nike/article69889482.ece",
  "title": "Puma new boss takes helm trailing Adidas and a recovering Nike",
  "date": "20250803T093000Z",
  "domain": "thehindubusinessline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "For more than two years, Puma SE’s top brass spoke of “elevating” the German brand and making its sneakers and apparel more aspirational. Since arriving last month, Chief Executive Officer Arthur Hoeld has delivered a fairly blunt verdict: Puma, if anything, is now perceived as cheap.\nHoeld, a decades-long veteran of cross-town rival Adidas AG, has the task of turning Puma around and charting a return to profit and growth. It’s not the first time the 77-year-old brand has needed a makeover, and former bosses like Jochen Zeitz, now head of Harley-Davidson Inc., and Bjorn Gulden, who became CEO of Adidas in 2023, both found ways to revitalize Puma’s leaping cat.\nBut Hoeld has significant hurdles to clear. Fast-growing brands like On Holding AG, New Balance and Hoka are winning customers and taking more shelf space at retailers. Adidas is still riding high on its retro Sambas, while industry leader Nike Inc. is bouncing back under company veteran Elliott Hill with products like the Vomero 18 running shoe, after a rare rough patch for the Swoosh.\nThen there are challenges Puma can do little to control: a fast-appreciating euro and US President Donald Trump’s trade tariffs ramping up industry costs. Hoeld took the first step toward what looks like a textbook reset on July 24, delivering a brutal financial reappraisal that sees a 20% plunge in sales in the coming months and Puma losing money this year.\n“That tells you that something is really quite wrong,” said Piral Dadhania, an analyst at RBC Capital Markets. “This is a fairly high-risk sort of turnaround. The execution becomes much more relevant in that situation.”\nHoeld first has to stop the bleeding. He is inheriting a growing pile of unsold sneakers and apparel in warehouses around the world that could take Puma more than a year to work through and to convince retailers to buy from the brand again, Deutsche Bank analyst Adam Cochrane said in a note.\n“It’s pretty toxic,” said Ingo Speich, a portfolio manager with Deka Investment in Frankfurt, a major Puma shareholder. “If you produce more and more shoes and widen your product range — at the same time as you get less retail space because other brands are far stronger — then it gets difficult.”\nAfter Puma’s profit warning, Hoeld linked the inventory challenge to big-picture questions that could take months to answer and even longer to execute on. “Do we have the right products for our consumers and our wholesale partners?” he asked. “If so, why is our brand not achieving the required visibility and engagement?” He promised to unveil his strategy in late October.\nThe slump is badly timed. The sneaker world has transformed in the past decade as Adidas and Nike pulled back from many retail partners, prioritizing direct-to-consumer sales channels in hopes of boosting profits. That approach backfired, with consumers embracing smaller brands like On, Hoka and New Balance that secured their products more space on retailers’ shelves.\nPuma, though, failed to capitalize on Nike’s stumbles, while Adidas quickly reversed course under Gulden, winning back retailers who couldn’t get enough of the three-striped Sambas and similar models. Since Hill returned to Nike last fall, he’s been repairing relationships with retail partners including Amazon.com Inc., and the company appears set for a new era of growth.\nUnderdog\nFor decades, Puma has occupied a tricky spot in the sporting goods world. Though it competes in everything from football and basketball to running, it’s much smaller than its main rivals Adidas and Nike in that multi-sport game. Its products typically command lower prices, though it’s had success when it carves out a niche, often as the underdog brand.\nWhen Gulden arrived at Puma in 2013, he refocused the company on performance sports and leaned heavily on the brand’s one genuine superstar: sprinter Usain Bolt. The Jamaican inspired the slogan “Forever Faster” and featured on a TV ad frolicking with women in a hot tub. “Calling all troublemakers,” he said. “For danger, risk and potential fugitive status.”\nFast-forward just over a decade and there was little of that rebellious spirit in Puma’s “Go Wild” ad this spring, which was aimed at everyday runners looking for feel-good vibes. The campaign struggled to stand out against Adidas’s no-stress “You Got This” push, or On’s video featuring Sesame Street’s Elmo urging runners clad in the brand’s plushly cushioned trainers to not be so hard on themselves — because “soft wins.”\nYet it’s Puma’s Speedcat sneaker that typifies the brand’s turmoil. In 2023, Puma was slow to bring back its retro Palermo trainer to compete with Adidas’s Samba. At the time, Puma leaders said they would punch back by owning the likely follow-up trend for thin-soled, “low-profile” sneakers.\nTheir hopes were pinned on the ’90s-era Speedcat — originally a product of Zeitz’s push to get Puma into motorsports — becoming a blockbuster. Celebrities including Jennifer Lawrence began to wear them in 2024 and Puma finally scaled up production earlier this year, with ex-CEO Arne Freundt saying it could be one of the hottest shoes of the summer.\nDisappointment\nPuma now acknowledges the shoe simply hasn’t caught on.\nAdding insult to injury, Adidas swooped in with its similar Taekwondo franchise to capture post-Samba demand, and it’s now outperforming Puma’s Speedcat models on StockX, according to the resale platform.\nThe Speedcat was key to Puma’s strategy to elevate the brand and help it command higher prices for other products. Instead, some versions of the €110 ($127) sneaker can be purchased for as low as €88 on its website. Versions of the €100 Palermo are discounted as much as 30%. Adidas sells some versions of its Samba for nearly twice as much.\nSpeich hopes Hoeld’s decades of sales experience at Adidas will help. He spent years overseeing its retro footwear and apparel business, and led the Europe, Middle East and Africa division. He was head of global sales until October.\nIf Puma can produce some hot new products, Hoeld may do a better job of getting them into the right stores in front of the right customers, according to Speich. It’s not a matter of turning the brand “upscale,” he added.\nHoeld singled out the running franchise as having immediate potential. In 2021, Puma reentered the sport with its “Nitro” foam shoes, winning praise from hardcore runners and professionals. But it was slow to target more casual buyers, and Puma is currently only available in 20 of running-chain Fleet Feet’s nearly 300 locations in the US, for instance.\n“When we talk innovation in our industry, running is one of these sports that matters,” Hoeld told reporters. “We are going to make sure that Nitro is going to be seen globally as a key platform for future success of Puma.”\n©2025 Bloomberg L.P.\nPublished on August 3, 2025",
  "word_count": 1132,
  "scraped_at": "2026-02-14T13:32:57.549866"
}