{
  "article_id": "2031a03ffb24",
  "url": "https://markets.financialcontent.com/stocks/article/bizwire-2023-6-30-budweiser-global-celebrates-2023-fifa-womens-world-cup-with-the-return-of-bringhomethebud",
  "title": "Stock Market | FinancialContent Business Page",
  "date": "20230630T113000Z",
  "domain": "markets.financialcontent.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Budweiser, an Anheuser-Busch InBev (AB InBev) (Brussel:ABI) (BMV:ANB) (JSE:ANH) (NYSE: BUD) global brand and the Official Beer of the FIFA World Cup™, commends women in football with “The World is Yours to Take” film in celebration of the upcoming 2023 FIFA Women’s World Cup™.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20230630907006/en/\nBudweiser Global Celebrates 2023 FIFA Women’s World Cup™ with the Return of #BringHomeTheBud (Photo: Business Wire)\nThis summer, Budweiser will rally fans across the world to cheer on their favorite women’s football teams as they seize the opportunity for greatness and give their all for the title of World Cup champions. To be released on July 10th, just days before kickoff, “The World is Yours to Take” film features footballer Lionel Messi hyping up players and fans alike for the tournament and asking the question who will #BringHomeTheBud for their nation this year. The program is an extension of Budweiser’s long-term commitment to football and aims to shine a light on the talented women taking the pitch in July for the 2023 FIFA Women’s World Cup™.\nThroughout the tournament, Budweiser will again bring its iconic asset created during the 2022 FIFA World Cup™ - the Bring Home the Bud crates of beer. Tapping into participating countries’ national pride, victories will often result in crates dropped, reminding fans that greatness, and the championship celebration, are closer than before.\n“For generations, football fans around the world have celebrated their team’s victories with an ice-cold Budweiser,” said Richard Oppy, global vice president of Premium Brands, AB InBev. “This summer, we are proud to support the women playing on the pitch as they give fans epic moments to celebrate and ultimately Bring Home the Bud. We are honored to again work with superstar Lionel Messi who humbly accepted the opportunity to pass on the torch to the reigning team that embodies determination and pride - just like himself.”\nAt the conclusion of the tournament, Budweiser will cheers the winning nation with a celebration fitting of a World Cup champion. As a part of the celebration, the brand will debut the final “The World is Yours to Take” film and unveil the team who will ultimately Bring Home the Bud.\n“There is no greater feeling than celebrating a World Cup with your team with the fans from your homeland cheer you on from afar and with the fans cheering us in the Stadium,” said World Cup Champion Lionel Messi. “Budweiser helped Argentina celebrate our World Cup victory last year, and I’m happy to partner with them this summer to pass the baton to the next champion of the 2023 FIFA Women’s World Cup.”\nIn addition to sponsoring the FIFA Women’s World Cup 2023™ tournament, AB InBev and Budweiser have a long and proud history of supporting individual women's National football teams around the world including the U.S., Colombia and UK National teams.\n#BringHomeTheBud is the second iteration of the viral campaign that first debuted during the men’s 2022 FIFA World Cup™ in Qatar that drove unprecedented business success, including doubled product sales globally during the month-long tournament, increased brand awareness and solidified Budweiser’s role at the intersection of sports and culture. Fans can watch Lionel Messi introduce the campaign in “The World is Yours to Take” film on Budweiser’s YouTube channel on July 10th.\nProduction Details\n“The World is Yours to Take” film was developed and produced by Wieden+Kennedy in collaboration with FIFA.\nAbout AB InBev and Budweiser\nAB InBev is a publicly traded company (Euronext: ABI) based in Leuven, Belgium, with secondary listings on the Mexico (MEXBOL: ANB) and South Africa (JSE: ANH) stock exchanges and with American Depositary Receipts on the New York Stock Exchange (NYSE: BUD). As a company, we dream big to create a future with more cheers. We are always looking to serve up new ways to meet life’s moments, move our industry forward and make a meaningful impact in the world. We are committed to building great brands that stand the test of time and to brewing the best beers using the finest ingredients. Our diverse portfolio of well over 500 beer brands includes global brands Budweiser®, Corona® and Stella Artois®; multi-country brands Beck’s®, Hoegaarden®, Leffe® and Michelob ULTRA®; and local champions such as Aguila®, Antarctica®, Bud Light®, Brahma®, Cass®, Castle®, Castle Lite®, Cristal®, Harbin®, Jupiler®, Modelo Especial®, Quilmes®, Victoria®, Sedrin®, and Skol®. Our brewing heritage dates back more than 600 years, spanning continents and generations. From our European roots at the Den Hoorn brewery in Leuven, Belgium. To the pioneering spirit of the Anheuser & Co brewery in St. Louis, US. To the creation of the Castle Brewery in South Africa during the Johannesburg gold rush. To Bohemia, the first brewery in Brazil. Geographically diversified with a balanced exposure to developed and developing markets, we leverage the collective strengths of approximately 167,000 colleagues based in nearly 50 countries worldwide. For 2022, AB InBev’s reported revenue was 57.8 billion USD (excluding JVs and associates).\nBudweiser is a medium-bodied, flavourful, crisp American-style lager. Brewed with the best barley mallet and a blend of premium hop varieties, Budweiser is an icon of optimism and celebration which is enjoyed in over 60 countries around the world and is committed to brewing every Budweiser with 100% renewable electricity.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20230630907006/en/\n\"This summer, we are proud to support the women playing on the pitch as they give fans epic moments to celebrate and ultimately Bring Home the Bud,\" said Richard Oppy, global vice president of Premium Brands, AB InBev\nContacts\nMedia\nBudweiser /AB InBev\nMedia.relations@ab-inbev.com\nAllison+Partners\nBudGlobal@allisonpr.com",
  "word_count": 932,
  "scraped_at": "2026-02-14T12:27:51.432000"
}