{
  "article_id": "20588ee70cf0",
  "url": "https://www.dailylocal.com/2023/09/26/penn-states-james-franklin-confirms-ohio-state-ads-claim-that-athletes-are-asking-for-5000/",
  "title": "Penn State James Franklin confirms Ohio State AD claim that athletes are asking for $5 , 000",
  "date": "20230926T233000Z",
  "domain": "dailylocal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Penn State football coach James Franklin confirmed testimony last week by Ohio State athletic director Gene Smith that it has become common for prospective athletes to ask for $5,000 to visit a college’s campus.\n“We’re all dealing with the same challenges and issues,” Franklin said Tuesday at his weekly press conference. “We all are. So, yeah, sometimes I think things are said publicly that maybe you guys weren’t aware of before. But yeah, we’re all dealing with the same challenges and issues because most of us are all recruiting the same guys.\n“That’s about as far as I’ll get into that.”\nSmith appeared before the House Committee on Small Business in Washington to discuss the impact of name, image and likeness (NIL) rules on college sports. He and others contend that federal legislation is needed.\nAccording to USA Today, Smith said in written testimony and statements before the committee that more than 420 Ohio State athletes have at least one NIL deal and that athletes across all of the school’s teams have more than 2,000 deals.\nHe said the Ohio State athletes who have attracted the most NIL attention have been from the football and women’s volleyball teams.\nFashanu honored: Penn State offensive tackle Olu Fashanu was named Tuesday as the Outland Trophy Player of the Week by the Football Writers Association of America.\nThe Outland Trophy is presented annually to the best interior lineman in college football and is the third-oldest major college football award, created in 1946.\nThe 6-6, 317-pound Fashanu has not allowed a sack since the start of last season. According to Pro Football Focus, he’s allowed one pressure on 120 pass protection snaps this season.\nHe was named to The Associated Press, The Sporting News and PFF preseason All-America first teams.\nFashanu has helped the Lions score at least 30 points in 11 consecutive games, the nation’s longest streak. They’ve scored in every quarter this season.\nInconsistent special teams: Franklin said he would like to see more consistency from the Penn State special teams, especially from the kickers.\nAlex Felkins has made 5-of-7 field goals, including one that was blocked, and Sander Sahaydak has missed both of his attempts.\n“Our units are playing well, fast, aggressive and hard,” Franklin said. “I think we just need to be a little bit more consistent at the specialist positions.”\nRiley Thompson has averaged 41.4 yards, but his net punting ranks 95th in the FBS. Eight of his 14 punts have been downed inside the 20 or have been fair caught. The Lions have allowed 51 yards on punt returns.\n“You really have to talk about drive starts with punting,” Franklin said, “because although we’re not crushing the ball, it’s difficult for people to get returns on us.”\nGabe Nwosu has been very successful on kickoffs, sending 17 of his 24 boots into the end zone for touchbacks.\nPlayers of the game: Franklin said the coaching staff named all five starting offensive linemen as the Offensive Players of the Game in the 31-0 victory over Iowa.\nPenn State gained 397 total yards and 28 first downs and held the football for 45:27.\nEdge rusher Chop Robinson was selected the Defensive Player of the Game after he had two tackles, a sack, a forced fumble and two quarterback hurries.\nLinebacker Dom DeLuca was chosen as the Special Teams Player of the Game after he had two tackles, one for loss, a forced fumble and a pass breakup.",
  "word_count": 577,
  "scraped_at": "2026-02-14T13:49:47.636010"
}