{
  "article_id": "2066d864ee55",
  "url": "https://www.heraldscotland.com/politics/viewpoint/24163248.george-galloway-man-knew---learned/",
  "title": "George Galloway : The man I knew - and what I learned about him",
  "date": "20240305T201500Z",
  "domain": "heraldscotland.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In some small way, George Galloway helped me to decide on my future career. As a student, I campaigned for him in the 1987 General Election, when he was elected as an MP for the first time.\nJust a few months later, I fought through a scrum of reporters to attend a meeting of the Glasgow Hillhead Labour Party executive committee, where I backed a vote of no confidence in our newly elected member, after he admitted to extra-marital affairs.\nIf Galloway, then a rising young star of the party, represented politics, I reflected, I wanted no part of it. And besides, the journalists looked like they were having way more fun.\nWhat happened next, taught me three things about \"Gorgeous George\" that still hold true to this day.\nThe first is that, if you support him, sooner or later he will let you down. Usually sooner. The second is that, when he’s backed into a corner, he reverts to a peculiar, effete patois that makes him sound like a censorious Victorian patriarch. And the third is that it’s always, always only ever about George.\nHis victory in the Rochdale by-election will doubtless end the same way as previous \"triumphs\": prematurely and in disappointment.\nThroughout the 1987 campaign I, and my fellow activists, pounded the streets of the constituency and worked into the early hours, stuffing envelopes and manning phone lines. I took time out from studying for my university finals to help fight, tooth, and nail, for each of the 17,958 votes that saw him returned to Westminster.\nREAD MORE: George Galloway wins chaotic Rochdale by-election\nREAD MORE: The gladiator in a fedora: Kevin McKenna meets George Galloway\nREAD MORE: So what's the bigger outrage? Commons procedure or Israeli barbarity?\nFollowing Labour’s ignominious defeat under Michael Foot four years previously, no-one expected the party to lay a glove on the still rampant Conservatives. Winning the tight, marginal seat of Hillhead - then held by former Labour Home Secretary Roy Jenkins for the SDP - was a consolation prize of which we were all rightly proud.\nOf course, we knew George had baggage. When he was selected as the local candidate he was under investigation by a charities’ auditor, over a £21,000 travel and expenses bill - then a significant sum - he had racked up as general secretary of the international aid charity War on Want. He was cleared of any wrongdoing.\nAs a leading Labour activist and a former chairman of the Scottish party, he was renowned as a formidable political organiser. But, at a time when toppling Thatcher’s Tories was an abiding priority for the left, he had some idiosyncratic preoccupations, including supporting his home city Dundee's twinning with the West Bank town of Nablus and having the PLO flag flying over the council chambers.\nJust a few weeks after the election, he convened a press conference to discuss his libel action against the BBC’s reporting of his expenses – the genesis of another obsession, that of litigating against those deemed to have besmirched the Galloway name.\nQuestioned about expenses incurred at a conference in Mykonos in 1985, he volunteered: “I travelled to and spent lots of time with people in Greece, many of whom were women, some of whom were known carnally to me. I actually had sexual intercourse with some of the people in Greece.”\nSorry, what?\nHe went on to claim that he had been subjected to accusations within War on Want that he had indulged in homosexuality and wife-swapping. The big top was raised and the Galloway circus was in full swing.\nThe accuations were damaging in the more socially conservative context of the time, not least because his election literature had promoted him as a committed family man, replete with pictures of his then wife Elaine and five-year-old daughter.\nSince then, of course, there has been more… much more, as he lurched from one cringing controversy to another, laying bare intimate details of his private life and the full extent of the Galloway political psychosis to a now-wearied public.\nAs Britain’s most prominent contrarian, the now four-times-married politician has associated himself with some of the world’s most odious characters, including Sadaam Hussein, Bashar al-Assad and Vladimir Putin.\nHe supported Hezbollah and Hamas; defended Chinese authorities' crackdown on protests in Hong Kong and denied the persecution of Uighur Muslims; defended the Iranian government, denying that lesbian and gay people are at risk of execution; and he described Russia's annexation of Crimea in 2014 as legitimate.\nThroughout it all, it’s fair to ask that in representing four constituencies (Glasgow Hillhead/Kelvin, Bradford West, Bethnal Green, and Bow and now Rochdale) as MP for the Labour Party, the Respect Party and now the Workers Party of Britain over the past 37 years, what has he achieved? What lasting changes for the better has he made to the lives of his constituents?\nOf course, it’s perfectly legitimate for a politician to choose a path that will never bring them into proximity with power. There are legions of one-man and woman awkward squads - Tam Dalyell, Kate Hoey, Dianne Abbot, Bob Marshall-Andrews, Dennis Skinner to name a few - who have spent most of their careers on the backbenches, pursuing pet interests and holding the government of the day to account.\nBut George never had the stamina or the self-discipline to pursue a project to its meaningful conclusion. On the single issue in which he could have become a fulcrum of effective opposition, the 2003 war in Iraq, he was expelled from the Labour Party after giving an interview to Abu Dhabi TV in which he suggested British troops should refuse to obey orders.\nIronically, he could have done more good, if he had never been elected. In the four years he led War on Want, its income grew sevenfold, from an overdraft of £60,000 to a surplus of £416,763.\nHe was also responsible for proposing a new scheme in which supporters of charities would receive tax relief on their donations, now a fundamental part of Third Sector funding.\nThe next time I met George was at a football match in the mid-1990s. A friend worked for a newspaper that had a corporate box at Celtic Park and I was invited to take up a spare place when one of the VIP guests pulled out at the last minute.\nOver the pre-match meal I sat opposite George and his guest for the day, the Pakistani High Commissioner in Scotland. He didn’t recognise or remember me and I didn’t prompt him.\nAs he eschewed the offer of alcohol (he’s teetotal which, to me, is another reason to be sceptical), he sucked on a fat Montecristo cigar and sought to make a historical equivalence between British rule in the Indian sub-continent and in his family’s native Ireland.\nAs his guest smiled unconvincingly, I thought how much he had changed in the intervening years. But then it occurred to me that he hadn’t really changed at all.",
  "word_count": 1166,
  "scraped_at": "2026-02-14T14:10:30.979069"
}