{
  "article_id": "206ef35d8ec8",
  "url": "https://theathletic.com/4647127/2023/07/18/womens-world-cup-2023-brazil-team-guide/",
  "title": "Women World Cup 2023 : Brazil team guide",
  "date": "20230718T051500Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It’s one of those facts that seems like it can’t possibly be true but is: Brazil have never won the Women’s World Cup. It feels like a strange quirk of history, not just because the country has enjoyed such success in the men’s game but also because so many of the most recognisable female stars of football’s modern era — Marta, Formiga, Cristiane — have been Brazilian. The 2-0 defeat by Germany in 2007 (their only final to date) still hurts, as does the unavoidable sense of decline since. Brazil have failed even to make the quarter-finals in the past two World Cups, so it’s probably for the best that expectations are on the modest side this time.\nGO DEEPER\nA guide to Group F at the Women's World Cup: Fascination everywhere, on and off the pitch\nManager\nA former striker who scored 71 times for Sweden, Pia Sundhage then made her name in management with the USWNT, guiding them to back-to-back Olympic gold medals in 2008 and 2012. Affable yet steely, Sundhage has — by the admission of the players themselves — brought European rigour to the Brazil setup. Fittingly, she also has a big, World Cup-shaped hole in her CV, having come up just short when the Americans, who led twice in the match, lost to Japan on penalties in the final 12 years ago.\nAdvertisement\nFormation\nSundhage employed a back five in the first half of the Finalissima against England earlier this year, but that was just an experiment. Her usual system is a 4-4-2, with minor variations depending on personnel.\nThree key players\nCentral defender Rafaelle is not just the captain of the team; she is its heartbeat. Strong and dominant but classy on the ball, she sets the tone from the back and spreads confidence to those around her. Having missed the 2019 tournament through injury, she will also be desperate to make up for lost time. Further forward, much will turn on whether or not Debinha can put recent fitness problems behind her. She is Brazil’s most reliable goalscorer by some distance and Sundhage will have her fingers firmly crossed.\nThen, of course, there is Marta, arguably the greatest women’s player of all time, scorer of a record 17 World Cup goals across five tournaments.\nAt 37, she is not the force she once was — not even a guaranteed starter any more, in fact — but she remains a talismanic presence and as with Lionel Messi in the men’s tournament last year, her team-mates are desperate to help end her World Cup hoodoo at last.\nGO DEEPER\nRafaelle: 'We owe what we have today to those who fought for it in the past'\nNotable absences\nThe only real big miss for Brazil is Lorena, their first-choice goalkeeper, who injured her knee in March. Leticia Izidoro is expected to deputise, with experienced campaigner Barbara back in the squad as cover.\nStrength\nBrazil kept clean sheets in all six games en route to Copa America glory last year, and their back four will be key again. Kathellen is a steady presence alongside Rafaelle in the centre, and there is quality on the flanks. Left-back Tamires is into her mid-30s but what she lacks in pace, she makes up for with experience and technical skill. On the right, the tireless Antonia has become one of the team’s unsung heroes.\nAdvertisement\nQuestion mark\nSundhage favours function over fantasy; as such, Brazil can look a little short on ideas when it comes to creating chances. Marta can still do damage when she drops off the front, but there is no other natural playmaker. Can the wide players — most likely Ary Borges and Adriana — provide enough spark?\nWildcard\nKerolin is not yet a household name but there is a growing feeling she is the next Brazilian superstar. A forward for most of her career thus far, the 23-year-old has been recast as a central midfielder by Sundhage in recent months and looks a complete natural there.\nQualification/recent form\nBrazil qualified by winning last year’s Copa America without conceding a goal. Performances outside South America have generally been less commanding, although the 2-1 victory away to Germany in an April friendly was a huge confidence boost.\nGroup difficulty\nBrazilian hearts sank when they got France — after 11 meetings, the Selecao are still searching for their first win (six defeats, five draws). Luckily, the other two sides in Group F look more beatable: Panama are making their World Cup debut and Jamaica, although improving, rarely trouble the top sides.\nTravel schedule\nIf any of the Brazil players want to visit New Zealand, they’ll have to do so on their own time. They will be based just north of Brisbane and won’t travel any further than the 2,000 miles to Adelaide, where they begin against Panama and will also play their round of 16 tie should they win the group, no matter how far they progress.\nTo win the World Cup, they will need…\n…the stars to align. Nobody truly thinks this is a vintage Brazil side; even the players speak of being in transition, looking for a new identity. The idea of Marta bowing out with a World Cup winner’s medal is an appealing one, but for that to happen the team will have to raise their level — and hope several others stall.\nDid you know?\nSundhage is a talented musician and singer. She stunned the Brazil players by performing a handful of Brazilian songs early in her tenure and is rarely too far from her trusted acoustic guitar.\nPossible starting XI\n(Top photo: Getty Images; design: Eamonn Dalton)",
  "word_count": 942,
  "scraped_at": "2026-02-14T13:27:13.590946"
}