{
  "article_id": "206fb2e9c397",
  "url": "https://www.sbs.com.au/news/podcast-episode/first-major-changes-to-defence-industry-in-40-years-evening-news-bulletin-1-december-2025/tdfofhvzz",
  "title": "First major changes to Defence industry in 40 years | Evening News Bulletin 1 December 2025",
  "date": "20251201T053000Z",
  "domain": "sbs.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Key Points\n- First significant changes to Australian Defence procurement in decades\n- Work needed to manage secure energy supply in renewables transition\n- Sam Kerr faces fitness test ahead of last match before Asian Cup\nListen to Australian and world news, and follow trending topics with SBS News Podcasts\nTRANSCRIPT\nThe federal government has announced a sweeping overhaul of the defence department they say is aimed at ending years of cost blowouts and major project delays.\nThree existing groups - involved with capability acquisition, naval shipbuilding, guided weapons and explosive ordnance - will be combined into a single Defence Delivery Agency.\nA National Armaments Director will oversee the agency - with the government also flagging further changes across the defence department to centralise acquisition.\nDefence Industry Minister Pat Conroy says a systemic rethink was needed.\n\"It is the biggest reform to the defence organisation in fifty years, and it's all about getting the equipment the brave men and women of the Australian Defence Force into their hands sooner, while providing, as Richard said, better bang for buck for taxpayers. What we've seen is a rise in complexity of projects: 15 years ago, 27 per cent of defence projects were complex. That has now doubled to almost 60 per cent of projects being complex.\"\n---\nThe Australian Energy Market Operator says that if the renewable transition comes online without delay, Australia remains on track to comfortably meet its electricity needs as coal plants close.\nHowever the latest AEMO snapshot also points to looming issues with supporting infrastructure that's needed to keep the grid stable, like synchronous condensers.\nIn particular, the operator says the grid is not prepared for the scheduled closure of Eraring coal plant in NSW in 2027, raising the prospect of widespread blackouts.\nOpposition leader Sussan Ley says she has serious concerns about whether the energy grid is prepared for the current pace of transition to renewables.\n\"Large scale batteries, long storage batteries have their place, but they're not there in sufficient capacity right now to balance the grid. Otherwise, we would not have this warning from the energy market operator if long storage batteries were online and developed and in place to do their job.\"\n---\nThe Greens are calling on the federal government to introduce a 25-per-cent tax on liquified natural gas exports as policymakers search for solutions to looming shortages on the east coast.\nThe measure was first proposed by the Australian Council of Trade Unions, and the new tax would replace an existing measure, known as the Petroleum Resource Rent Tax.\nCalls for reform come as the government prepares to release its strategy for securing gas supplies into the future ahead of shortages expected from 2028.\nGreens resources spokesperson Steph Hodgins-May says the 25-per-cent tax would incentivise domestic supply without the need to open new gas fields.\n\"This country doesn't have a gas supply problem. It has a gas export problem. For too long, these tax bludging gas corporations have been writing the rules with successive governments cheering them on. The Greens will not support any incentives or subsidising that enhances the prospect of future gas projects, opening up in this country. It is appalling that successive governments have overseen a tripling of gas prices since gas exports began.\n---\nNew South Wales Police say over hundreds of people have been charged during a three-day operation targeting youth crime and street gangs around transport hubs in Sydney.\nIt's the fifth sting under Operation Waratah, and resulted in 533 charges, 161 drug detections, 579 searches; and the seizure of 34 knives and other weapons.\nSuperintendent Andrew Evans says over 210 police were deployed each day for three days last week.\n\"I can indicate that the aim of the operation was to reduce the incidence of youth and street gang violence on the public transport network and in and around CBDs. The operation was highly successful, and the operational footprint was from Dapto in the south, Blue Mountains to the west, and Chittaway Bay to the north and obviously metropolitan Sydney.\"\n---\nTo sport now, and in football news, Sam Kerr faces will face a match-eve fitness test to determine whether she'll play in the Matilda's final game before the Asian Cup.\nKerr was reportedly nursing a tight calf on Friday night when she missed the Matilda's 5-0 torching of New Zealand in Gosford.\nThe striker recently returned to play with Chelsea after spending time off the field following a knee reconstruction in January last year.\nMatilda's coach Joe Montemurro says Kerr could still play in Tuesday night's game against the Kiwis in Adelaide.\n\"Oh, she is in the mix at the moment. She's training with us. She's been in the last two camps. We're obviously looking at a lot of different scenarios leading into a tournament, as I've said. You know, we have to be prepared for many, many different scenarios, and you know, Sam's a component of that like every other player. And as I said, she's tracking well, and you know, she's growing at Chelsea with match minutes, and she's really integrated well here.\"",
  "word_count": 851,
  "scraped_at": "2026-02-14T12:59:06.857828"
}