{
  "article_id": "207c1db09e67",
  "url": "https://www.thenationalnews.com/news/mena/2025/05/06/israel-ngo-bans-letter/",
  "title": "International groups condemn Israel move to tighten control over aid and rights organisations",
  "date": "20250506T204500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "More than 50 international aid organisations have condemned Israel’s tightened restrictions on humanitarian groups operating in Gaza and the occupied Palestinian territories, warning that new registration rules pose a “grave threat to humanitarian operations and international law” amid a deepening humanitarian crisis.\nIn a joint open letter, Oxfam, Doctors Without Borders (MSF), Save the Children, the Norwegian Refugee Council and others rejected Israel’s March policy that allows it to ban international NGOs if they or their staff support boycotts of Israel or accuse it of violating international law.\nThe letter expressed concern over the requirement to submit complete staff lists and other sensitive information, including about their families, when registering.\n“In a context where humanitarian and healthcare workers are routinely subject to harassment, detention and direct attacks, this raises serious protection concerns,” the 55 humanitarian groups wrote in the letter.\nIsrael has argued the requirements are necessary to vet employees for any ties to militants. But aid groups fear this could endanger their teams, saying hundreds of humanitarian personnel have been killed in the conflict.\n“By framing humanitarian and human rights advocacy as a threat to the state, Israeli authorities can shut out organisations merely for speaking out about conditions they witness on the ground, forcing INGOs to choose between delivering aid and promoting respect for the protections owed to affected people,” the groups said.\nThey called on donors and the international community to use all possible means to protect humanitarian operations, and to take concrete political and diplomatic action beyond statements of concern to ensure unhindered humanitarian access and prevent the erosion of aid delivery.\nThe crackdown coincides with Israel’s new aid distribution plan for Gaza, where a two-month blockade has pushed more than a million people to the brink of famine.\nThe proposal would funnel limited food supplies through six Israeli-controlled centres, with security handled by US private contractors.\nThe UN and all aid organisations operating in Gaza jointly announced on Sunday they would not co-operate with the Israeli-US plan to establish the new mechanism for aid delivery because it “contravenes fundamental humanitarian principles and appears designed to reinforce control over life-sustaining items as a pressure tactic – as part of a military strategy”.",
  "word_count": 366,
  "scraped_at": "2026-02-14T12:11:36.348971"
}