{
  "article_id": "207dc31028f3",
  "url": "https://cartilagefreecaptain.sbnation.com/2023/1/21/23565108/tottenham-hotspur-women-deloitte-money-league-sixth-highest-revenue-europe",
  "title": "Deloitte : Tottenham Women had sixth highest 2021 - 22 revenue in Europe",
  "date": "20230121T144500Z",
  "domain": "cartilagefreecaptain.sbnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Every year, Deloitte releases a report ranking European football teams by the amount of revenue they bring in based on their publicly released financial statements. They call it the “Money League.” This year, for the first time, Deloitte has also released a Money League report for European women’s football teams, using the same criteria. And while the numbers are minuscule compared to what’s made by men’s football clubs, it still represents what is hoped will be the start of continued growth in the women’s game over the coming years.\nDeloitte: Tottenham Women had sixth highest 2021-22 revenue in Europe\nSurprising, and positive news!\nAnd perhaps surprisingly, Tottenham Hotspur Women started off high on the Money League rankings. According to Deloitte, Spurs Women generated €2.1m in revenue in the 2021-22 season, putting them sixth in the Money League table, just €0.1 behind Arsenal in fifth place, though well behind Barcelona and Manchester United at the top of the table.\n2022 Deloitte Money League WOSO Rankings\nDeloitte started their report by noting that this is the first time that all 20 the clubs in the men’s Money League have constituent women’s football teams, with 85% of them playing in the top flight of their league system. It’s also worth pointing out that these are European only rankings and do not include revenues for American NWSL clubs, because the report focuses on the top 20 clubs from the men’s rankings. (It would be interesting to see, for example, where some of the higher-profile NWSL teams would land on this list, as well as women’s football powerhouse Lyon, which is also not on this list as the men’s team is not in the Money League)\nTottenham’s revenues lag significantly behind those of Manchester City and Manchester United, which is not that surprising. City in particular has been able to increase their revenue via participation in the Champions League in recent seasons (also what has benefitted Barcelona, two time Champions League finalists), and while United has only had a women’s team for a few years now they have a parent club that has significant and historic infrastructure in place to generate income. But also interestingly, Tottenham finished AHEAD of Chelsea, a large and very successful WSL club and one that competes in the Champions League regularly. It’s not exactly clear why.\nDeloitte doesn’t dig into each team’s specific financial numbers, which might prove illuminating as to why some teams finished higher than others. However, the report notes that the revenues generated by WSL clubs higher on this list — Tottenham included — are in part due to high profile matches in their clubs’ large stadiums. Spurs Women in particular had several matches at the Tottenham Hotspur Stadium in 2021-22 that had high attendance and significantly boosted their revenue; continued use of large stadiums for WOSO matches will be one way to help foster a virtuous cycle of positive growth in the European women’s game.\nIt’s interesting that Spurs’ reported revenue came so close to that of Arsenal, a club that significantly and historically puts out a better product on the pitch. Revenue clearly does not directly equate to quality, but it goes without saying that clubs with higher revenues have a much easier path to better players, which leads to better performance. And then there’s the Chelsea question, and that’s one I’d love to get more information on — it’s possible that Chelsea Women are simply subsidized to a greater extent by the club than others on the list.\nThe revenues generated by even the richest of European WOSO teams are a tiny fraction of what’s generated by the men’s game. That said, Deloitte’s report is high on the future of women’s soccer in Europe, noting that continued revenue rises will rely on several strategies including the bundling (or unbundling) of commercial rights with clubs’ mens teams. Tottenham Hotspur Women appears to be trending in the right direction, but the hopes are a rising tide will lift all boats.",
  "word_count": 664,
  "scraped_at": "2026-02-14T12:21:34.851751"
}