{
  "article_id": "2089c4482924",
  "url": "https://www.express.co.uk/showbiz/tv-radio/2141463/breaking-itv-presenter-faints-live-air",
  "title": "Moment ITV presenter Laura Woods faints on live TV as show yanked off - air",
  "date": "20251202T203000Z",
  "domain": "express.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Moment ITV presenter Laura Woods faints on live TV as show yanked off-air\nBeloved TV presenter Laura Woods was hosting the England Women's football match against Ghana when the incident happened.\nTV Presenter Laura Woods collapsed on live TV while presenting the England Women's friendly football match against Ghana. The beloved pundit was hosting the match alongside Ian Wright and Anita Asante when the shocking incident occurred. As she opened the match, the broadcaster explained the role of the Lionesses when she fainted while the cameras were still rolling.\nThe 38-year-old TNT presenter fell forward during the interview, collapsing into Wright and Asante as her stunned co-hosts attempted to keep her upright. But then the blonde bombshell collapsed to the ground completely before the camera pulled away to a wide shot of the stadium.\nREAD MORE: ITV Midsomer Murders makes major series announcement as return confirmed\nREAD MORE: Major sporting event to be shown on free-to-air TV in major £80m twist\nMoments later, ITV pulled the show off the airwaves and threw to an advert break as worried fans flocked to social media to see if the presenter was okay. One user penned: \"Hope Laura Woods is ok\" as another agreed: \"Hope Laura Woods is okay after that [prayer emoji].\"\nA third chimed in with: \"Really hope Laura Woods is okay [grimace emoji] Fair play to Ian Wright and Anita Asante for catching her [applause emoji] Fair play to the stand-in presenter who stepped in, some effort that [applause emoji].\"\nMeanwhile a fourth added: \"Upsetting to see Laura Woods faint. Glad @IanWright0 caught her. Speedy recovery [prayer emoji].\" When the show returned from the break, Woods had been replaced by her fellow presenter, Katie Shanahan, who immediately updated viewers at home on Woods' condition.\nShanahan - who until now had been acting as ITV's pitch-side reporter - stepped in at the last minute and reassured viewers that the host was being well looked after. She said: \"As you might have noticed, we don't have the wonderful Laura Woods. She has just been taken ill and is in very good hands.\"\nMeanwhile, others praised Shanahan for stepping in so soon after Laura's incident, with one user writing: \"Full respect to the presenter who had to step in with zero notice after Laura Woods fainted. She's making it looks easy.\"\nAnother agreed: \"Gosh, I hope Laura Woods is okay? Just watching the Lionesses #ENGvGHA Bravo Katie Shanahan, who stepped in at a moment's notice.\"\nLater on in the match, Wood's fiancé, Adam Collard, also issued a positive update online. He penned: \"Laura is all ok and with the right people. Thank you for all your kind messages.\"\nWoods is one of TV's most well-respected sports presenters on the airwaves. She was a regular host on Sky Sports before she made the switch to TNT Sports in July 2023. Months later, she announced she was dating Love Island womaniser Adam Collard, with the happy couple announcing they were expecting their first child the following year.\nSeveral months into her pregnancy, the former Celebs Go Dating alumna got down on one knee and popped the question while they were on holiday together in Cornwall. Woods then ventured into the world of parenting in January this year, returning to TV in April for TNT's coverage of the Champions League semi-final between Barcelona and Inter Milan.",
  "word_count": 560,
  "scraped_at": "2026-02-14T12:50:47.474947"
}