{
  "article_id": "2091b63fea92",
  "url": "https://theprideoflondon.com/posts/chelsea-women-complete-guide-to-the-2024-paris-olympics-01j2ena3e9t0",
  "title": "Chelsea Women : Complete guide to the 2024 Paris Olympics",
  "date": "20240715T203000Z",
  "domain": "theprideoflondon.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "We still have over a month until we actually get our first glimpse of Sonia Bompastor's Chelsea Women. Before then, many of the club's stars are slated to compete in the most well-known competitive sporting event in the world, the Olympics. Similar to what we did prior to the Women's World Cup, The Pride of London is here to give you everything you need to know in order to watch West London's representatives.\nOnly 12 teams are competing on the women's football end, so the number of players in this major tournament from Chelsea is significantly lower compared to 2023. At the last World Cup, there were 19 Blues, the most of any club team last summer. In France, you'll see just six West Londoners, one fewer than what we originally thought (not counting the one reserve, Eve Perisset).\nWho will be there? Who could be returning to Cobham with some bragging rights? What are the games to watch? Let's dive in.\nChelsea Women players representing their country in France\nDefenders: Kadeisha Buchanan (Canada), Ashley Lawrence (Canada)\nAlongside former Blue Jessie Fleming, Kadeisha Buchanan and Ashley Lawrence have their eyes on capturing back-to-back gold medals for Canada. Buchanan, and Lawrence, two players who played starting roles in Canada's most recent friendly against Australia, were two of the three individuals to be named to the starting XI in all six matches by Bev Priestman at the previous Olympics. In the only match the Chelsea center back captained her country during that tournament, Lawrence recorded the crucial assist to earn the CONCACAF outfit a draw vs. Great Britain.\nThe last time we saw the former Lyon defender in blue was when she received that incredibly harsh second yellow card in the second leg of the UEFA Champions League semifinal against Barcelona. Lawrence, who showed flashes amid competing for time with Perisset during her debut campaign in West London, was Hayes' starting right back in two out of Chelsea's last four games in May.\nMidfielders: Sjoeke Nusken (Germany)\nNote: Catarina Macario, who made the USWNT's 18-player roster, was ruled out of the Olympics by Emma Hayes due to consistent irritation in her right knee. She was replaced on the roster by NJ/NY Gotham FC's Lynn Williams.\nIf you asked me which Chelsea player you should keep an eye on the most in France, I'd say without hesitation Sjoeke Nusken. One of the most versatile players in European club football is going to be critical to the success of the German national team in France.\nHer ability to not only play center back but the six, the eight, or even the 10 if necessary is extraordinarily useful for interim coach Horst Hrubesch. That unpredictability will have opponents guessing come kick-off time. From what we've seen in the UEFA Women's Euro qualifiers, her playing time is going to skyrocket from the 45 minutes she competed last summer at the World Cup. In the latest friendly for Germany, a defeat to Iceland, Nusken served in a starting midfield role alongside one of Eintracht Frankfurt's newcomers, Elisa Senß.",
  "word_count": 511,
  "scraped_at": "2026-02-14T12:57:57.549286"
}