{
  "article_id": "209b087cc35d",
  "url": "https://www.bbc.co.uk/sport/football/65915089#comments",
  "title": "United States, Vietnam, Netherlands, Portugal: A guide to Group E at 2023 Women's World Cup",
  "date": "2023-07-02T06:11:33.000Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_bbc",
  "body_text": "United States, Vietnam, Netherlands, Portugal: A guide to Group E at 2023 Women's World Cup\n- Published\n- comments\nThe 2023 Women's World Cup is taking place in Australia and New Zealand between 20 July and 20 August. Defending world champions the United States are in Group E, along with the Netherlands and debutants Vietnam and Portugal. BBC Sport takes a closer look at those teams.\nNetherlands\nManager: Andries Jonker, 60, has worked at Barcelona and Bayern Munich as assistant to Louis van Gaal, and managed Wolfsburg's men's team in the Bundesliga. It is the second time the former Arsenal academy manager has taken charge of the Netherlands women's side after an interim spell in 2001. He returned in August 2022 after Mark Parsons' exit following defeat in the quarter-finals at Euro 2022. Even with Jonker at the helm, it will be a tough ask for the Netherlands to repeat their 2019 run to the World Cup final.\nStar player: The loss of Vivianne Miedema - one of the best forwards in the world - to an anterior cruciate ligament injury is a huge blow but the side remains packed with experience. Jill Roord, 26, is closing in on 100 caps for her country and is trusted by Jonker. The former Arsenal midfielder was a substitute in the 2019 final but Roord is expected to play a key role for her country in New Zealand. A versatile performer, she can play on the wing or in a more central attacking position.\nForm guide\nTournament history\nPortugal\nManager: Francisco Neto's achievements in guiding Portugal to a first World Cup have not gone unnoticed. \"Congratulations on this historic clearance,\" wrote Portugal legend Cristiano Ronaldo on social media after Carole Costa's 94th-minute penalty against Cameroon in February secured qualification. Reaching the World Cup is the culmination of nine years of progress under Neto, whose side are the highest ranked of the eight debutants at this tournament.\nStar player: Seven of Portugal's 23 players in New Zealand have 100 caps or more, including Benfica forward Jessica Silva, who helped Lyon win the Champions League in 2020. Silva, 28, was 12 when she watched Brazil legend Marta on television at the 2007 World Cup. \"I can't be like Marta - no-one can - but she inspired me growing up and I would like to give even a little of that inspiration to someone else if I can,\" says Silva. \"The thought of young kids watching me at a World Cup is amazing to me.\"\nForm\nTournament history\nUnited States\nManager: Vlatko Andonovski, 46, takes charge of the four-time world champions on the World Cup stage for the first time after the former defender from North Macedonia was appointed soon after the 2019 triumph in France. He will have to do without highly influential captain Becky Sauerbrunn and other injured players including Mallory Swanson, new Chelsea signing Catarina Macario and Sam Mewis. That's 400-plus caps of experience alone. \"I know how much it means for this country to be the best, to be on top, to be trend setters, to lead the world,\" says Andonovski.\nStar player: Fourteen of the 23 players named by Andonovski have not appeared at a World Cup before. Alex Morgan - along with Megan Rapinoe and Kelley O'Hara - is appearing at her fourth. Morgan, who turns 34 on 2 July, is a two-time World Cup winner, a three-time Olympian and a United States living legend with connections in high places. \"She is someone I consider a friend, someone I am a massive fan of,\" said pop star Taylor Swift, who appeared in a social media video, external to announce the USA squad for the World Cup.\nForm guide\nTournament history\nVietnam\nManager:Mai Duc Chung, 72, is a national treasure back home. When Vietnam walk out to face defending world champions the United States at Eden Park, Auckland, on 22 July, it will be the first time a Vietnamese men's or women's team has competed at a World Cup. \"We've been looking forward to this moment for a long time,\" says the manager with a wealth of coaching experience including assistant, technical director and manager roles at club and national team level, in men's, women's, youth and senior football in Vietnam.\nStar player: Tran Thi Thuy Trang, 34 will captain Vietnam at their maiden World Cup. The midfielder's experience and leadership skills will be crucial as Vietnam negotiate a group featuring 2019 runners-up the Netherlands - as well as the defending world champions. \"Facing big teams like the United States is a huge challenge but it is an opportunity for myself and the team to learn from them,\" she says.\nForm guide\nTournament history\nHow will Princess Georgiana cope Down Under? A riotous royal comedy starring Catherine Tate\nWho are the greatest Ashes XI of the past twenty years? Greg James, Jimmy Anderson and Felix White debate - but do you agree with them?",
  "word_count": 823,
  "scraped_at": "2026-02-14T11:17:46.675810"
}