{
  "article_id": "20d30dda653c",
  "url": "https://www.90min.com/posts/chelsea-owners-write-open-letter-fans-disastrous-2022-23-season",
  "title": "Chelsea owners write open letter to fans following disastrous 2022 / 23 season",
  "date": "20230608T110000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Chelsea owners write open letter to fans following disastrous 2022/23 season\nChelsea's ownership group have admitted there's 'a lot we can do better' in an open letter to fans on their first season in charge.\nThe Blues endured an utterly horrid 2022/23 campaign, the first under the ownership of Todd Boehly and Clearlake Capital, as they finished 12th in the Premier League and lost a whopping 16 games despite spending roughly £600m on new players.\nBoehly's ownership also oversaw a number of managerial changes too, with both Thomas Tuchel and Graham Potter being sacked during the season.\nIn an open letter to fans, published on the club's official website, the ownership conceded improvement is needed but vowed to step up next season.\nChelsea's owners' open letter in full\nIt’s been just over a year since we completed our purchase of Chelsea. It was and remains a privilege for us to be custodians of our wonderful club. Twelve months on, we want to take the opportunity to speak directly to all of you, our supporters, as we reflect on the season just gone.\nOur promise to you was to make our fans proud. We remain completely committed to the long term and sustainable success of our club and fulfilling that promise we made to you. We know the huge potential we must grow to develop Chelsea FC and it is a role we take seriously. Everybody working here is relentlessly focused on driving us forward.\nClearly, for our men’s team, it has been a disappointing season and there is a lot we can and will do better. Throughout these difficult periods, our fans have supported our players and our team across the country, and Europe with unfailing loyalty. We could not be more grateful for your incredible support. The atmosphere at the Bridge when we played Dortmund will live long in our memories and serves as an important reminder of where we want to be.\nOur women’s team has celebrated another astonishing season, winning the Double with an unprecedented fourth successive WSL title and third successive FA Cup. Whilst we just fell short in the Champions League, the team played in front of incredible crowds at Stamford Bridge and demonstrated their quality against the best European sides. There are not enough positive things to say about Emma Hayes, her backroom staff, and squad who have dealt with adversity, injury and Emma’s period of absence. Their character and hunger to win is second to none. We were also delighted to see Emma named the LMA’s WSL Manager of the Year and Sam Kerr winning the FWA Women’s Footballer of the Year award back-to-back.\nREAD THE LATEST CHELSEA NEWS, TRANSFER RUMOURS & GOSSIP\nFor all the challenges of the past year, we are optimistic about the future. We are looking forward to welcoming Mauricio Pochettino as the head coach of our men’s team in July. We are building a modern scouting, talent identification, and recruiting infrastructure within our sporting department, led by Laurence Stewart and Paul Winstanley, which will help us to identify and transform the squad around elite talent, a squad capable of consistently competing to win the Premier League, raise domestic cups and compete and win at the highest level in European football. We have also appointed Chris Jurasek as CEO to drive our business forward off the pitch, which in turn will make us more sustainable on the pitch.\nThe success we are aiming for is only possible with our supporters behind us. We are proud of the creation of our Fan Advisory Board, which will meet for the first time over this summer, and we are confident its new members will ensure you are at the heart of decision making at our club. We will continue to ensure your voices are heard as we look to the future.\nFor now, on behalf of the board and everyone at the club, thank you for your outstanding support. We hope you all have a good summer and look forward to welcoming you back to the Bridge in August.\nLISTEN NOW\nOn this edition of Son of Chelsea, part of the 90min podcast network, Daniel Childs bids farewell to N'Golo Kante & reacts to the latest transfer rumours!\nIf you can't see this embed, click here to listen to the podcast!",
  "word_count": 719,
  "scraped_at": "2026-02-14T12:46:05.646540"
}