{
  "article_id": "20f78f16f24d",
  "url": "https://www.theguardian.com/world/2025/may/06/we-know-what-is-happening-we-cannot-walk-away-how-the-guardian-bore-witness-to-horror-in-former-yugoslavia",
  "title": "  We know what is happening , we cannot walk away : how the Guardian bore witness to horror in former Yugoslavia | Bosnia and Herzegovina",
  "date": "20250506T050000Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Among many courageous correspondents covering the war in the former Yugoslavia, the reporting of Ed Vulliamy and Maggie O’Kane received plaudits and numerous awards. Both were inexorably drawn to where the action was, and wrote unblinking, vivid accounts. But what made their work controversial was their refusal to be neutral. For many journalists, including some of their colleagues at the Guardian, it was vital to maintain the distinction between being a witness – a “neutral” observer – and becoming actively caught up in the conflict. Some felt they crossed a line that should not have been crossed.\nThe war – a series of ethnic conflicts that started in 1991 and lasted for nearly a decade – left an estimated 140,000 dead and as many as 4 million displaced. During the course of their reporting, Vulliamy and O’Kane became involved partisans, in the cause of the Bosnian Muslims, in particular. For O’Kane, “There really was no parity of guilt in this”. Vulliamy, too, saw the Muslims, more than any others, as the “victim people” of the war, and his reporting became a passionate indictment of their oppressors.\nOne Guardian critic of Vulliamy and O’Kane’s approach said that it turned the reporter into “an outraged participant”. Another of their colleagues, himself a respected foreign correspondent, spoke of the rise of “a Maggie O’Kane school of foreign reporting”: “I think she was the epitome of this kind of journalism. The sort of print version of TV journalism, where you begin the article with a closeup of some sort of agonised scene and then you pull back to the wider context. But everything has to begin with a crying baby, a starving child, the weeping widow sort of foreign coverage, which was very different from the Ian Black, Martin Woollacott, Jonathan Steele, Richard Gott approach, which was much more cerebral and analytical.” On one occasion, after a political story had been displaced to accommodate another startling dispatch from Bosnia, it was denounced as “political pornography” by Gott, the paper’s literary editor, at a lively morning meeting.\nIn fact, both styles – graphic reportage and contextual commentary – ran very effectively side by side in the Guardian’s coverage of the war. The Guardian’s Europe correspondent, Ian Traynor, and his mentor, Martin Woollacott, provided particularly perceptive analysis. The best of the reporting combined all these elements, carrying context within penetrating reportage, for example in Julian Borger’s dispatches covering the terrible collapse of the Muslim “safe” enclave of Srebrenica; and would later be the case in Steele’s reporting from Kosovo.\nHaving stepped over the line of neutrality, Vulliamy controversially became the first journalist to give evidence to the international criminal tribunal for the former Yugoslavia (ICTY), trying war crimes in The Hague. In doing so, he went with his conscience against a great deal of advice. “Some of the colleagues I most admire have counselled strongly against testifying,” he revealed. He subsequently testified in six more trials, including that of Bosnian Serb leader Radovan Karadžić. The war had changed his life. “I was a serious pacifist who believed that all war was wrong; now I believe that war is necessary to end things that are even worse than war.”\nO’Kane did all she could to provide contact details of survivors and witnesses when these were sought by investigators as a result of what she had written, but appearing as a witness at The Hague tribunal was something she declined to do. “I think it makes it more dangerous and more difficult for us to do our job [as journalists]. We would be seen as a threat and an enemy combatant.”\nThe war introduced O’Kane to the Guardian. She found that her background as a Catholic in Belfast provided her with insights that helped her to penetrate the complexities of sectarian rivalries in Yugoslavia. One of her childhood memories was of being woken, aged about eight, by a bomb “just up the road at the Co-op”; a blast that shattered her bedroom windows, showering her bed with glass. In the prevailing atmosphere of 1970s Northern Ireland, several members of her extended family had been drawn to the periphery of the IRA, and this perhaps accounted for her father’s decision to move the family to Skerries, a seaside village north of Dublin, when O’Kane was 12. She started her career in journalism as a crime correspondent for the Sunday Tribune newspaper and Magill magazine. The editor of Magill was the journalist and later novelist Colm Tóibín, who recognised O’Kane’s acute eye for detail and suggested she develop it by reading Truman Capote’s true-crime classic, In Cold Blood.\nO’Kane’s first reports came from Croatia, mainly from the Adriatic city of Dubrovnik, which was under a naval blockade. She had been smuggled into the city by a sympathetic Croatian crew member who hid her in the bunks on board a ship carrying European Community observers.\nHer reports were notable for the way they gave voice to ordinary people swept up by events. This was especially true of the trapped citizens of the Bosnian capital Sarajevo, a city from which she reported at regular intervals throughout its four-year siege. She made her first visit there in the spring of 1992, making one stage of her journey in a Red Cross convoy that came under heavy artillery fire that killed several people. She left Sarajevo on that occasion in a sombre group of vehicles that carried the coffin of Jordi Pujol, a young Spanish photographer killed in the city by a mortar bomb – his body became their passport through the checkpoints.\nLike Vulliamy, O’Kane had made documentary films for television before covering the conflict for the Guardian, and perhaps it was this visual sensibility that gave their writing such a graphic, closeup quality. O’Kane wrote that being in Sarajevo, with Serbian militias firing at will from the surrounding hills, felt like being in a doll’s house from which a giant had lifted the roof. Two months later she was reporting from another siege, this time from the topographical point of view of the Serbian forces commanding the mortar batteries around Goražde. Her report began: “Commandant Slavo Gub stands on top of a mountain and unscrews the legs of a green tripod to mount his telescopic sights. The streets of Goražde jump up the mountain.” This last phrase gave her report an immediate and startling reality for Peter Murtagh, on duty that evening on the foreign desk in Farringdon Road. He was so struck by the image, he went to the Guardian’s editor, Peter Preston, and said “You’ve got to read this.”\nPreston pulled it up on his screen, and while he was reading it, he said, without looking up: “This young woman has written herself into a job.” O’Kane went on to report for the Guardian for more than 20 years, spending her first decade on the paper in a succession of war zones, including Afghanistan, Iraq and Chechnya.\nWhile O’Kane was in Dubrovnik, she was joined by Vulliamy, who had come directly from reporting the battle for Vukovar, the besieged Croatian town, then entering its final and most brutal phase. The four-month siege was to end about three weeks later. It was followed immediately by the massacre of more than 200 people, shot by Serbian militias and buried in a mass grave.\nO’Kane and Vulliamy shared a ferocious commitment to speaking truth to power. O’Kane, as soon as she arrived in the comparative safety of Split after that first visit to Sarajevo, wrote an open letter to the British prime minister, published in the comment section beneath the headline: “Save Sarajevo, Mr Major.” It was a relentless recital of the agony being inflicted on the multi-ethnic citizenry of the Bosnian capital by militias under the ultimate control of Radovan Karadžić, president of what was soon to be called Republika Srpska. “I’ve interviewed Mr Karadžić a few times,” she wrote, “and it seems to me he gets a bit crazier every time.”\nVulliamy had been told to keep an eye on Yugoslavia from his base in Rome. While he was in Dubrovnik, a flotilla of 30 small ships, led by a car ferry carrying medicine and food, negotiated its way through the blockade. It also carried the Croatian president of Yugoslavia, Stjepan “Stipe” Mesić, who had assembled the convoy.\nVulliamy had now been in Yugoslavia for more than a month and was due for a break. He also had a ticket for a key Napoli-Milan football match, a passport to sanity, burning a hole in his pocket. “I figured that what comes in must get out, so I hitched a ride with Stipe Mesić on the car ferry, planning to get to Ancona in time to make it to Naples in time for this game.” O’Kane stayed on in Dubrovnik for another two weeks.\nOn 29 July 1992, the Guardian published O’Kane’s most startling dispatch so far. The report was splashed across the front page, under the headline: “Muslims’ nightmare under the long hot Yugoslav sun.” O’Kane’s language was unequivocal. Referring to the area of Prijedor, 30 miles or so north-west of Banja Luka, she wrote: “In the four concentration camps in this area in the top corner of Bosnia that the Serbs are claiming for their new Serbian Republic of Bosnia, there are at least 14,000 Muslims being held.”\nO’Kane had reached Banja Luka by bus from Belgrade. The city was in the process of being closed off. The bus, in which O’Kane sat, indistinguishable from her Serbian fellow passengers, had passed checkpoints where cars carrying journalists were being turned back. When she checked into a hotel she found she was its only resident.\nAt about four in the morning she had a caller. “It was a Red Cross worker, a young Serb guy, who said, ‘You have to understand what is going on.’ He was the one who alerted me.” He took her to a house where boys under 16 and men over 60 who had been released from the camps were staying. Among those she interviewed was a family who had been held for a time in what she called “Trnopolje concentration camp”. One of the other camps she mentioned was Omarska. O’Kane quoted a witness: “They’ve been sitting there for two months, there’s no cover, no water to wash and no room to lie down.”\nThe main horror conveyed by this particular dispatch was the plight of women and children packed into a train of cattle wagons. Again she interviewed a witness. “They had come from Trnopolje camp. I only saw a few women’s faces and they were sticking their arms out of two barred windows high up in the wagon, but I knew the wagons had to be full because of the noise. The women were crying and the children were screaming. They were screaming, ‘Water!’ Just a glass of water. It was a hot day and the wagons were in the open. They didn’t have a toilet.” They were being removed to Zenica in an exercise of ethnic cleansing. By the time the train reached the Bosnian city, 110 miles from Trnopolje, five days later, 11 had died.\nThere was an immediate response to the article from the Bosnian Serb leader, Karadžić, who had been in London for talks on the day it was published. In a letter to the editor, he said: “Your article on the front page of today’s newspaper is sensational and cannot be ignored. It is completely false to suggest that the Bosnian Serbs have organised concentration camps or that we hold civilian prisoners … I have made an offer to British journalists to make a list of places where they believe such camps exist. I will ensure that they can visit them.”\nThe day that Karadžić made his promise, Paul Webster, the foreign editor, was having a drink with O’Kane and Vulliamy at the Coach and Horses pub near the Guardian’s Farringdon office. It was a handover meeting before Vulliamy flew out to return to Yugoslavia in place of O’Kane. Vulliamy recalled: “Paul had given us an unforgettable, terrifying brief – the best any editor has ever given me: ‘Get into the thick of it, but I don’t want to hear a word from you unless you have the splash [the headline story].’” Webster made a call to Karadžić that night, reaching him on his car phone as he made his way to Heathrow. Webster said the Guardian wanted to accept his invitation and was sending someone out immediately.\nOne of the most controversial episodes of the war was about to unfold. After delays that dragged out for five days, the journalists were escorted on a restricted visit to Omarska and then to Trnopolje. “At first, I had been reluctant to call Omarska and Trnopolje ‘concentration camps’, because of the many unique facets of the Holocaust and its scale,” Vulliamy wrote. “On reflection, though, I see that ‘concentration camps’ is exactly what they were.”\nIt was in Trnopolje that the skeletal Fikret Alić was photographed and filmed gazing through strands of barbed wire, providing what quickly became perhaps the single image most readily associated with the Yugoslavian war.\nProcrastination on the part of the United Nations, failure to agree a course of action among the members of Nato, allowed the terrible toll to continue. “Safe havens” protected by UN forces were finally established in the spring of 1993, initially around Srebrenica. They proved to be anything but safe.\nA report written by Haris Nezirovic, a 26-year-old Bosnian journalist for the newspaper Slobodna Bosna, described how 35,000 people were living in basements, wrecked cars, destroyed houses and the ruined streets of Srebrenica, as refugees flooded in from fighting in the surrounding villages.\nBy April 1993, Srebrenica had been under siege for a year. A message from an amateur radio operator, which the Guardian ran on the front page, conveyed the people’s desperation: “We beg you to do something, whatever you can. In the name of God, do something.” A UN resolution ratified the establishment of Srebrenica as a safe haven on 6 May, but by that time, Serb forces had already entered the city.\nA Guardian editorial on 14 August was unequivocal. “It should be said quite clearly where this paper stands. We would put many thousands more troops, wearing UN berets, into Bosnia; and we would allow them not merely to defend themselves, but to make the havens truly safe and Sarajevo a protected city. Because we know what is happening, we see no possibility of walking away.”\nThe headline on an article by Hella Pick, on the same page as that editorial, acutely summarised the mess of indecision: “Bumbling while Bosnia burns.” Members of Nato had at last agreed that airstrikes could go ahead, but with the proviso that they be limited to supporting humanitarian relief. Pick, one of the Guardian’s most experienced foreign and diplomatic correspondents, summed up the polarity in American and British positions. “London and Washington have been at opposite ends of the spectrum throughout the interminable debate, with the Americans more gung-ho, and deeply resentful of Britain’s angst at being sucked into a vicious civil war. The Europeans are not meeting their responsibilities, with Britain the most cowardly of all.”\nThe siege continued. On 5 February 1994, a 120mm mortar hit the busy Markale open market in the centre of Sarajevo, killing 68 people. It was, the Guardian declared, “the worst single act of butchery in the 22-month siege of the city”. Two days later, Nato declared an exclusion zone around Sarajevo, reinforced by President Clinton’s blunt statement that “Nato is now set to act”. Martin Woollacott, in a front-page commentary, noted, “For the first time in the dark history of the Bosnian conflict, the west has credibly threatened to use force, and the effects already appear to have been magical – a Sarajevo ceasefire agreed within hours.”\nThe peace did not last long. The response of Bosnian Serb forces to the declaration of an exclusion zone around Sarajevo was to fight their way into the “safe area” of Goražde. This finally provoked Nato’s first attack in the two-year war: on 10 April 1994, two US F-16s dropped 500lb bombs on Serbian positions, following up with another raid the next day. In retaliation, the Serbs intensified the shelling of Goražde, seized 150 UN personnel as hostages, killed two SAS men and shot down a British Sea Harrier.\nThe random bombardment of Sarajevo also resumed, and the plight of the other so-called safe areas worsened.\nIn May 1995, Julian Borger reported from Sarajevo during a week that was experiencing the heaviest bombardment for 18 months. “The UN has given up all pretence of protecting the six Bosnian ‘safe areas’ it designated in 1993,” he wrote. Borger spoke to a shopkeeper washing blood from the pavement. “‘Fuck the UN’, was all he said.”\nNothing, it seemed, was able to avert the fate of Srebrenica. In July 1995, as Srebrenica was overrun, the 350 Dutch UN peacekeepers who had the impossible task of protecting the area were forced to capitulate, after promised airstrikes were abandoned. Srebrenica finally fell on 13 July. Evidence that a massacre had taken place built swiftly, through accounts given by refugees and by the Dutch personnel who had been forced to abandon the UN post. A story in the Observer by John Sweeney and Charlotte Eagar quoted a Dutch army captain: “The Muslim men were separated from their families and moved to a white building. I heard shots coming from the building.”\nThe full horror of Srebrenica emerged over the following weeks and months. Early in August, the New York correspondent Mark Tran reported that the US had presented the security council with “compelling evidence”, including aerial photographs of mass graves, that up to 2,400 Bosnian men were massacred after the fall of Srebrenica. The UN report, immediately leaked to the Guardian, along with the testimony of Red Cross officials, made clear the probability that the number would be very much greater.\nAt the fall of Srebrenica, thousands fled into the surrounding country seeking to make their way to the safer ground of Tuzla, 162 miles away to the north-west, where a refugee camp had been set up. The front page of the Guardian on 15 July carried an image that became emblematic of the horrors of this European war. Borger provided the words that went with it. “In a crowd of over 10,000 refugees sprawled across Tuzla’s cornfields, a young woman hanged herself yesterday. No one knew her name. No one wept for her when her body was cut down from a tree, and only a single policeman kept vigil over her corpse as it lay abandoned by the gate of the heaving, sweating camp.” She had been, Borger wrote, “one of the scatterlings of Europe, torn away more than once from friends, relatives and familiar places.”\nTowards the end of July, the Croatian military began an offensive against the Serb enclave of Krajina in Croatia, causing an initial exodus of 20,000 refugees, a number eventually to grow tenfold. In the Guardian of 5 August, Borger’s report from the Croatian capital, Zagreb, was splashed across the front page under the headline, “Croats launch all-out war.” Ian Traynor, in a profile of the leader of Croatia, Franjo Tuđjman, called him “a president who has passed from communist fanatic to nationalist zealot”. The full nature of the disaster that had overcome the Serbs of Krajina was reflected in the Guardian’s front-page photograph of 9 August, showing the logjam of cars, trucks, men, women and children that had reached the border with Serbia, forming a queue that stretched back for 40 miles.\nTowards the end of the month, on Monday 28 August, a 120mm mortar shell landed at the entrance to the covered main market of Sarajevo, killing 43 people. Vulliamy wrote the page one story from Zagreb, pointing out the bombing’s potential, and possibly its purpose, to stall the US-driven peace talks. The Guardian carried a gruesome eyewitness account from Sarajevo by the Associated Press reporter Srećko Latal: “Journalists joined taxi drivers and market vendors in heaping bodies into the back of vehicles to rush them to hospital. Some fell apart as they were lifted by the survivors. Blood-soaked material frayed and split and severed limbs dropped to the ground … policemen collected legs and arms into plastic bags.” The excruciating detail was unusual for the paper; it represented an ultimate point of exasperation and despair.\nNato began bombing targets around Sarajevo at 2am local time on Wednesday. The following day’s front page carried the headline: “The defining moment.” Alongside the combined report from Vulliamy, Ian Black and John Palmer was a dramatic photograph of a massive plume of smoke rising from an ammunition dump at Pale, the town near Sarajevo that the Bosnian Serbs had made their headquarters. The report gave details of “18 hours of concerted air and artillery bombardment against Serbian military positions across Bosnia”. An editorial called the bombing “a major gamble”.\nLetters to the editor the next day, Friday 1 September, carried a range of opinion about the bombing, and about the Guardian’s reaction to it. First was a letter from the MPs Tony Benn, Tam Dalyell and others, utterly condemning the marketplace massacre, but also condemning Nato’s intervention. “The international community loses all moral authority when it adds to the many atrocities which have already taken place.”\nOn 5 September, amid dissatisfaction with the lack of progress in the withdrawal of heavy weapons from the vicinity of Sarajevo, Nato launched a new onslaught on Serb positions in the biggest single operation in its history.\nMeanwhile, the US chief negotiator, Richard Holbrooke, arrived in Belgrade for talks with the Serbian president, Slobodan Milošević. In a comment piece, Jonathan Steele described the American policy as “bomb and talk, or Vietnam revisited”. The “Americanisation” of the war was not automatically bad, he wrote, but “there is always something inherently cowardly and heavy-handed in the choice of bombs”.\nOn 11 September, Ian Traynor in Zagreb and David Fairhall, the Guardian’s defence correspondent, reported that, for the first time, Tomahawk missiles had been launched from the USS Normandy in the Adriatic. The main targets were Serb air defence systems around Banja Luka in response to continued Serb refusal to comply with the exclusion zone around Sarajevo. Several days later, Nato agreed to suspend airstrikes for 72 hours on the promise that the rebel Bosnian Serb forces would at last lift the siege of Sarajevo.\nOne of the last towns to be reclaimed by Bosnian Muslim forces was Donji Vakuf, about halfway between Sarajevo and Banja Luka. Its fall, Traynor reported, represented a huge morale-boost for the largely refugee army that fought for it.\nTony Harrison, whose memorable poem A Cold Coming had been published during the Gulf War, now contributed another, The Cycles of Donji Vakuf, carried in full on the front page. It was inspired in part by the sight of one of the victors, a Kalashnikov over one shoulder, a looted mandolin over the other, knees bumping his chin as he made away on a child’s bicycle.\nThe war was now in its final phase. In November, representatives of the main protagonists met near Dayton, Ohio, for what a Guardian headline called “Bosnia’s search for Pax Americana”. Their talks were in progress when Karadžić and Gen Ratko Mladić were indicted at the war crimes tribunal at The Hague with specific reference to the massacre at Srebrenica.\nMilošević – later also to be tried in The Hague – represented Bosnian Serb interests at Dayton in the absence of Karadžić. On 21 November, Milošević, Tuđjman and the Bosnian president Alija Izetbegović initialled the agreement, in what the front-page report called the biggest foreign policy triumph – and the greatest political gamble – of Clinton’s presidency.\nThe Dayton accord, in the division of territory that came out of it, seemed a tacit endorsement of the ethnic cleansing of the four bloody years leading up to it, something presented as an essential compromise in the cause of peace. The ideal of multi-ethnicity was abandoned and former Yugoslavia faced a future newly divided along ethnic lines – or, more accurately, religious lines – between the Orthodox Republika Srpska, the largely Muslim Bosnia and Herzegovina and Catholic Croatia. It reaffirmed that Kosovo with its Albanian Muslim majority was part of Serbia. It was towards Kosovo that eyes now turned as the next likely flashpoint.\nAdapted from Witness in a Time of Turmoil: Inside the Guardian’s Global Revolution Volume One: 1986–1995 published by Guardian Books. To support the Guardian, order a copy from Guardianbookshop.com. Delivery charges may apply.\nListen to our podcasts here and sign up to the long read weekly email here",
  "word_count": 4133,
  "scraped_at": "2026-02-14T12:11:37.439079"
}