{
  "article_id": "21076989ddcf",
  "url": "https://www.thewrap.com/jane-fonda-lily-tomlin-rita-moreno-sally-field-palm-springs-film-festival-80-for-brady/",
  "title": "Jane Fonda , Lily Tomlin , Rita Moreno , Sally Field Hit 80 for Brady Premiere",
  "date": "20230107T184500Z",
  "domain": "thewrap.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "On Thursday night in a desert resort east of Los Angeles, the Palm Springs International Film Awards filled a cavernous convention center with an all-star lineup of honorees: Viola Davis, Cate Blanchett, Michelle Yeoh, Steven Spielberg…\nAnd 24 hours later, the Palm Springs International Film Festival officially opened with another all-star lineup: Lily Tomlin, Jane Fonda, Rita Moreno and Sally Field.\nThe venue was different (the Palm Springs Convention Center on Thursday, Palm Springs High School on Friday) and so was the level of formality and glitz (lots of bling on Thursday, not so much on Friday). But the biggest difference was that the 10 honorees on Thursday were there representing 10 different films, including “The Woman King,” “Tar,” “Everything Everywhere All at Once” and “The Fabelmans,” while Friday’s event was the world premiere of a single movie, “80 for Brady,” which stars that formidable quartet of legendary women.\nThe ”Brady” of the title is another legend, quarterback Tom Brady, who both acts in and serves as a producer on “80 for Brady,” but who couldn’t make the trip to Palm Springs since he’s got a football game to play in Atlanta on Sunday.\nBut hey, who needs Brady when you’ve got Tomlin, Fonda, Moreno and Field? Not PSIFF, for which “80 for Brady” turned out to be an ideal opening-night film to kick off the first in-person festival since January 2020. Light, funny and perfectly matched to the demographic in a city that has always been both a show-business retreat and a popular retirement spot, director Kyle Marvin’s film is a “based on a true story” account of three women in their 80s and one in her 70s who take a trip to Houston to see their idol Brady play in 2017’s Super Bowl LI.\nExactly how true it is to the story on which it’s based is a matter of speculation, though it’s safe to say that the real women probably didn’t have nearly this many misadventures along the way. But in a way, the rising improbabilities help the film mimic the real Brady’s journey in that particular Super Bowl, in which his New England Patriots fell behind 28-3 and then staged the largest comeback in Super Bowl history to win in overtime.\n“80 for Brady” starts out slow, too, despite the stellar cast, but picks up steam with the help of Billy Porter as Lady Gaga’s choreographer Gugu, Guy Fieri as himself and a string of ludicrous set pieces that allow four gifted comic actresses to have fun.\nThe Palm Springs audience clearly wanted to laugh at the beginning of the movie and had no choice in the matter by the end. TheWrap will run a full review closer to the Paramount film’s opening on Feb. 3 – but as somebody who has never once rooted for Brady in any football game, I found myself rooting for him in the movie.\nThen again, the people to root for in “80 for Brady” are clearly the 80s, not Brady. That was brought home in a post-screening Q&A with Tomlin, Fonda, Moreno, Field, Marvin and actor Harry Hamlin, who plays a hunky former football player who falls into a flirtatious relationship with Fonda’s Trish.\nThe session began with moderator Dave Karger asking Tomlin about her string of work with Fonda. There was the Netflix series “Grace and Frankie” from 2015 to 2022, followed by a pair of movies. The first was Paul Weitz’s “Moving On,” which premiered at last year’s Toronto Film Festival and is also playing in Palm Springs, followed by “80 for Brady.”\n“After seven years of ‘Grace and Frankie,’ we worry about being seen together that much,” Tomlin said. “But then we try to pass over that and get another job.”\nThe Q&A quickly turned into the four women alternately praising and teasing each other, with Field talking about how she looked in the mirror as they were rehearsing one dance scene and thought to herself, “I’m dancing with Rita Moreno!”\nMoreno then jumped to her feet to imitate Field’s enthusiastic dance moves. “I watched her dance,” she said, “and I thought, ‘She’s gonna steal this f—ing movie!’”\nBrady and a few of his former teammates also acquitted themselves well in the film, including a particularly funny locker-room encounter between Fonda’s Trish and the impressive physical specimen of former Patriot tight end Rob Gronkowski, about whom Trish had written erotic fiction. “Jane, how would you say Gronkowski was?” Karger asked. “Was he a natural actor?”\nFonda shrugged. “Who cares?”\nThe movie, by the way, ended with a new song by 13-time Oscar nominee and recent Honorary Oscar winner Diane Warren, which means it’s probably a sneak preview of at least one entry on next year’s Oscar song shortlist. The song, “Gonna Be You,” is sung by a quintet of formidable women: Dolly Parton, Belinda Carlisle, Cyndi Lauper, Gloria Estefan and Debbie Harry. “Diane came flying in, the way she does, and helped get all those women,” Marvin explained.",
  "word_count": 832,
  "scraped_at": "2026-02-14T13:35:10.770314"
}