{
  "article_id": "210ca376e8bf",
  "url": "https://www.ok.co.uk/lifestyle/lioness-ella-toone-tattoo-kiss-30716734",
  "title": "Touching meaning behind Lioness Ella Toone celebration after semi - final goal",
  "date": "20230816T134500Z",
  "domain": "ok.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Touching meaning behind Lioness Ella Toone's celebration after semi-final goal\nEagle-eyed viewers were quick to notice Lioness Ella Toone's special celebration as she fired England into the lead during their semi-final match against Australia\nElla Toone previously revealed the special meaning behind her goal celebrations as England took on Australia in the semi-final of the Women's World Cup.\nThe footballer, 23, is currently in Australia and New Zealand hoping to take the Lionesses to the final after a nail-biting match against the national team.\nDuring the match Ella, who plays as an attacking midfielder for Women's Super League club Manchester United, scored a stunning strike in the 36th-minute.\nViewers noticed during her celebration that Ella kissed her wrist before making a love heart with her hands.\nThe footballer previously revealed her reason for doing this after unveiling a tattoo on her wrist which she had alongside some of her closest friends.\nSpeaking to BBC Sport, she said: “Yeah, I’d do an absolute madness. I definitely do think about that and in tournament football moments fall to different people and if you take them moments, and we’ve definitely had a lot of them throughout the tournament.\n“I’m sure if it falls to me in the box then I’d be buzzing if I put it away.”\nElla added that her besties have given her \"strict instructions\" to pay tribute to them if she were to score a goal.\n\"We all got a matching tattoo before I came out,\" she said.\n“They want me to kiss it and do a little love heart. So I promised them that I’d do that.”\nAway from football, it was recently revealed that Ella's boyfriend was non-league footballer Joe Bunney, who she also paid a touching tribute to.\nThe pair were photographed hugging and kissing on the beach in Ibiza.\nA source told The Sun: “Ella and Joe are very much in love and have been together for a while now. They are both from Manchester and have mutual friends who introduced them.\n“Those who know them think they are the perfect pairing. Joe is Ella’s biggest cheerleader and he could not have been more proud to watch her lifting the trophy at the Euros.\n“They keep their love life out of the spotlight usually but Joe couldn’t resist joining Ella in Ibiza to celebrate with her.”\nOn Joe's birthday, Ella penned a romantic tribute to her boyfriend, saying: \"BIG happy birthday to my soul mate. Thank you for being you. can’t wait to keep doing life together & making more special memories along the way!! Cheers JB for the endless love & laughter.\"",
  "word_count": 437,
  "scraped_at": "2026-02-14T12:40:19.874047"
}