{
  "article_id": "210e9a1eb18d",
  "url": "https://www.standard.net.au/story/8351464/hfnl-2023-awards-south-goalie-toast-of-the-division-three-competition/?cs=10266",
  "title": "Juanita Russell wins 2023 Hampden league division three netball best and fairest | The Standard",
  "date": "20230917T083000Z",
  "domain": "standard.net.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "South Warrnambool's Juanita Russell knows a league best and fairest is won off the back of many.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe Roosters' division three shooter took out the Symone Moloney medal as the competition's best player on Sunday, beating out Terang Mortlake's Holly Fowler on 26 and Hamilton Kangaroos' Saskia Gould on 24 for the title.\nRussell, 35, said she was in disbelief to win the award, instead acknowledging the invite as an honour in itself.\n\"I didn't come in with any expectations, but felt I had a good season... but not this good a season,\" she said with a laugh.\nThe mother-of-two said the Roosters' division three team had meshed well to make a finals run this year, before losing a tight elimination final to Koroit.\n\"We've got a really cohesive side, that really plays well, reads well together which I suppose individually for me, allows for me in the shooting position to get those goals and assist the team in winning those games,\" she said. \"It's an individual award, the trophy but it's a whole team effort to get there.\"\nRussell, who started her junior netball career in Casterton and Sandford, had a decade-long hiatus from the sport before returning to the game when she moved back to the south-west.\nShe soon chose South Warrnambool as her home and hasn't looked back.\n\"I always wanted to play... but we moved away and did university as well,\" she said. \"It wasn't the right time, so it was one of those things when I got back to Warrnambool I wanted to get back into it for myself.\"\nThe property manager, who has remained largely injury-free on the netball court, says playing for the Roosters is a great social outlet.\n\"You work, you have kids, you get busy, and netball is just the one place you can be you,\" she said.\n\"The club here is really inclusive and supportive, you get that sense of community, you meet people you probably never would have before hand.\n\"It's that one thing you do for yourself.\"\nOur journalists work hard to provide local, up-to-date news to the community. This is how you can access our trusted content:\n- Bookmark https://www.standard.net.au/\n- Make sure you are signed up for our breaking and regular headlines and newsletters\n- Follow us on Facebook, Twitter, Instagram and LinkedIn\n- Tap here to open our Google News page\n- Join our Courts and Crime Facebook group and our dedicated Sport\n- Facebook group\n- Subscribe",
  "word_count": 423,
  "scraped_at": "2026-02-14T13:25:56.309622"
}