{
  "article_id": "2129b9d91611",
  "url": "https://www.gatestoneinstitute.org/21185/jew-hunting-open-season",
  "title": "Jew - Hunting : Open Season in the West",
  "date": "20241208T124500Z",
  "domain": "gatestoneinstitute.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "November 7. Amsterdam. As soon as a soccer match between the Netherlands' AFC Ajax, a Dutch soccer club, and Israel's Maccabi Tel Aviv ends, Maccabi supporters who came from Israel and several European countries to attend the match, are attacked. Many are chased through the streets, beaten, thrown to the ground, punched, kicked, stabbed, and thrown into the icy water of the city's canals. While the attackers shout anti-Semitic slurs, the victims, in an attempt to escape, shout back that they are not Jewish.\nThe attackers film what they do, then post the videos on social networks. Five Israelis are hospitalized; dozens of others, some wounded, lock themselves for hours in their hotel rooms. The Israeli government sends planes to rescue the Jews. A jihadi pogrom has just taken place in the city where Anne Frank and her family hid until they were turned over to the German occupiers and sent to death camps.\n\"This is a very dark moment for the city, for which I am deeply ashamed,\" said Femke Halsema, Amsterdam's \"left wing\" mayor.\n\"We must not look away from antisemitic behavior on our streets,\" King Willem-Alexander of the Netherlands was even more explicit.\n\"History has taught us how intimidation goes from bad to worse, with horrific consequences. Jewish people must feel safe in the Netherlands, everywhere and at all times.\"\n\"There is nothing, absolutely nothing to serve as an excuse for the deliberate search and hunting down of Jews,\" stated Dutch Prime Minister Dick Schoof, also \"left-wing\".\n\"We have become the Gaza of Europe,\" said Dutch MP Geert Wilders.\n\"I will NOT accept that. NEVER. The authorities will be held accountable for their failure to protect the Israeli citizens. Never again.\"\nOne of the victims wrote:\n\"I finished four months reserves in Gaza and what I experienced here is no less scary. There is war out here. I got run over and someone pulled a knife on me. I am lightly injured but not willing to get treatment here, only in the country... They are everywhere. No police. Whole chaos. Everything was preorganized.... One in four persons walking around the street is Muslim who comes to attack Jews\".\nThe attackers appeared to be mostly Muslims with Palestinian flags. In Europe, saying that one is for the Palestinians has become the politically correct way of saying one loathes Israel and Jews.\nWilders, who lives under constant police protection after his life was threatened in 2005, has for years been warning of the dangers that arise from a growing Muslim presence in his country.\nThe Netherlands has long been filled with Islamic hatred. Filmmaker Theo Van Gogh was brutally murdered in Amsterdam in 2004 by an Islamist who claimed that making a film, \"Submission,\" about Muslim women filling shelters for victims of abuse, was offensive to Islam. A paper with a knife stuck into van Gogh's belly threatened that Ayaan Hirsi Ali and Geert Wilders, who had both worked on film, would be next.\nAyaan Hirsi Ali, a victim of female genital mutilation, had fled her native Somalia to escape a forced marriage, became Dutch, went through university, and was elected to the Dutch parliament. After van Gogh was murdered, when she too received 'round-the-clock protection, her neighbors complained that her presence was endangering them. She was accused of having lied in her asylum application -- apparently an excuse to harass her for being critical of Islam – was stripped of her citizenship, and fled to the United States.\nWilders won the Dutch general election in November 2023 and his Party for Freedom (PVV) became the largest in the Dutch parliament. He should have become prime minister, but other parties blocked him from forming a coalition. The coalition government that was formed rejected his participation, a move Wilders declared unfair and \"constitutionally wrong.\"\nNo one was arrested during or after the pogrom. The attackers were only put on buses and dropped off on the outskirts of the city.\nIsrael's Mossad had warned Dutch authorities and police that plans for violence against Jews were circulating on November 7 and urged them to increase security at the stadium, hotels, train stations and in the Amsterdam city center -- to no avail.\nWhen violence did break out, the police did almost nothing to stop it.\nAyan Hirsi Ali wrote:\n\"Today, a large part of the police force in Amsterdam is made up of second-generation migrants from North Africa and the Middle East. Since October 7 last year, some officers have already refused to guard Jewish locations such as the Holocaust Museum.\"\nDemonstrations in Amsterdam were banned the day after the pogrom for an indefinite period, but took place anyway. On November 11, a tram was set on fire, windows smashed, and police officers pelted with stones by young men shouting, \"cancer Jews\". Five men were arrested on November 12, then released. Forty-five suspects were identified. Eight were arrested.\nWhat is happening in the Netherlands is happening in other Western European countries as well.\nAnti-Semitic attacks are becoming more numerous in France, as with the torture and murder of Ilan Halimi, the murder of two elderly women, Mireille Knoll and Dr. Sarah Halimi, and a slaughter in Toulouse in 2012, where an Islamist murdered Jewish schoolchildren. A massacre in Paris in 2015 showed that Islamists would murder Jews who had simply come to shop in a Jewish supermarket.\nIn Paris, at the pro-Hamas demonstrations that followed the massacre of Jews in Israel by the Iran-backed terrorist group Hamas on October 7, 2023, demonstrators shouted \"Death to the Jews\" and \"Death to Israel.\" Several demonstrations ended in riots, with Jewish businesses attacked or covered with Stars of David, sometimes accompanied by the German word Jude.\nWhen Jews were attacked on the streets, or students on the London Underground were attacked by groups of young Muslims, the British police ignored the attacks.\nOn November 12 in Berlin, members of a Jewish youth soccer team were assaulted by a \"pro-Palestinian\" mob wielding sticks and knives.\nIn the United States, Jewish students have been attacked, sometimes violently, and anti-Semitic attacks have been increasing. Anti-Israel and pro-Hamas demonstrations are accompanied by anti-Semitic acts. Jewish students at the University of Pittsburgh were recently beaten with a glass bottle by a man wearing a keffiyeh, and another student, wearing a Star of David, was beaten by a group of Muslim students.\nIn Canada, a report by the Canadian Centre for Israel and Jewish Affairs (CIJA) concludes: \"increasingly Canada is becoming a physically unsafe country for Jews.\" Last month, an Iranian plot to assassinate a Jewish human rights lawyer and former federal minister, Irwin Cotler, was foiled. A Vancouver resident recently remarked:\n\"Walking around the city, you would think that we live next door to the Gaza Strip. Pro-Hamas protests and bomb threats to Jewish institutions make me feel uncomfortable disclosing I am Jewish and for my own safety.\"\nSimilar testimonies come from Toronto and Montreal.\nThe Muslim anti-Semitism so common in Muslim countries has spread by immigration to Western Europe and North America, accompanied by Islamic organizations and the arrival of radical imams who constantly incite hatred of Jews, Israel and the West. In Western Europe, Muslim neighborhoods have become hotbeds of delinquency and crime, from which non-Muslim populations have fled.\nWestern European political leaders first claimed that Muslim populations would integrate and not cause any friction. When it became clear that many Muslims were not integrating, and were instead creating unrest, political leaders chose to practice willful blindness and presumably gave in out of fear of riots.\nSome organizations claim that those who say Muslim integration is a failure, or that Muslim hatred of Jews is pervasive, are accused of being racist, xenophobic, or belonging to the far right. Organizations fighting anti-Semitism never speak out about Muslim anti-Semitism. Instead, they accuse the \"far-right\" of anti-Semitism. \"Far-right\" anti-Semitism does exist, of course, but for the most part, since World War II, does not attack Jews or murder them.\nConversely, far-left movements have drawn closer to Islamic organizations, perhaps based on their common wish to re-order society more to their everyone-equally-poor-and-tyrannized liking. They have supported the \"Palestinian cause\" with increasing vehemence: the \"far-left\" in Europe is now resolutely \"anti-Zionist\" and filled with an anti-Jewish hatred similar to that of the most radical Muslims.\nSo long as courageous politicians like Geert Wilders are pushed to the margins, the situation in Europe can only get worse. European political leaders are afraid of Muslim unrest and of losing potential votes. They have commensurately become increasingly anti-Israel. French President Emmanuel Macron urged completely stopping arms deliveries to Israel. \"You can't defend a civilization by sowing barbarism\" he told Israeli Prime Minister Benjamin Netanyahu, without mentioning the incessant poundings on Israel by Hamas and Hezbollah.\nThe pro-Hamas demonstrations and the occupations of universities by violent anti-Semites in recent months should be seen as red alerts. History shows that letting the hatred of Jews and Israel without a firm response only grows and can only lead to anarchy.\n\"Israel is the only place, where Jews are defended,\" wrote the Columnist Caroline Glick. \"[W]ithout Israel, there would be no Jewish people.\"\nIsrael tried to keep the much-touted \"ceasefire\" from vaporizing. As the journalist Daniel Greenfield noted:\n\"The ceasefire lasted approximately 4 days.\n\"Lucy and the football.\n\"Ceasefires with terrorists always play out the same way. An elaborate series of understandings are reached through an extended process of negotiations.\n\"The terrorists start violating them within 24 hours.\n\"If Israel is involved, the world immediately blames Israel.\n\"Biden's Lebanon ceasefire lasted approximately 4 days. During that time, Hezbollah began advancing back to its old positions, setting up rocket launchers, fortifying and preparing to launch new attacks. All in violation of the ceasefire. Israel responded by taking out the incoming forces and Hezbollah is back to firing rockets into Israel.\n\"So much for the ceasefire.\"\nAnd:\n\"Offering to negotiate with Islamic terrorists is a statement of weakness. Jihadists only offer to negotiate out of fear, weakness or to entrap us, and they assume we do the same thing. Nothing would ever convince them that we genuinely want to live in peace with them, or that we prefer alternatives to violence. So any time we offer to negotiate, they see it as weakness or a trick.\n\"If our diplomats ever understood this cultural reality, they would stop being baffled when the negotiations fall apart.\"\nDr. Guy Millière, a professor at the University of Paris, is the author of 27 books on France and Europe.",
  "word_count": 1752,
  "scraped_at": "2026-02-14T12:10:00.055774"
}