{
  "article_id": "216dfabc2058",
  "url": "https://www.juneesoutherncross.com.au/story/8948705/serie-a-matches-postponed-for-popes-funeral/?cs=6417",
  "title": "Serie A matches postponed for Pope funeral",
  "date": "20250422T210000Z",
  "domain": "juneesoutherncross.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Saturday's Serie A fixtures have been suspended along with other sports events in Italy because of the funeral for Pope Francis in Rome.\nSubscribe now for unlimited access.\nor signup to continue reading\nGiovanni Malago, president of the Italian Olympic Committee (CONI) asked for this measure to be taken after the government declared five days of national mourning.\nMalago also asked for a minute of silence to be observed before all sports events during the week.\nEarlier media reports had suggested that Serie A might make an exception for Inter Milan's clash with visitors AS Roma to allow Simone Inzaghi's side additional rest time ahead of their midweek Champions League semi-final at Barcelona\nBut that match, along with Lazio v Parma and Como v Genoa, has been rescheduled. The matches in Milan and Como will be on Sunday, Lazio's in Rome in Monday.\nThe Women's Six Nations rugby union match between Italy and Wales in Parma, scheduled for Saturday is also affected but a new date is not yet decided.\nDignitaries and visitors from around the world are expected to be in Rome for the funeral of the pope who died on Monday morning following a stroke and heart failure, according to the Vatican.\nThey are to include United States president Donald Trump, in what will be his first trip abroad since starting his second term in January.\nMonday's four Serie A Games were postponed and have been rearranged for Wednesday.\nIn Argentina the late Pope is being honoured at his local hometown soccer club in Buenos Aires, San Lorenzo de Almagro, where the football-loving head of the Roman Catholic Church remained a member during his 12-year papacy.\nFans from the first-tier Primera División club started gathering from Monday at the club's chapel to the south-west of the Argentine capital to bid farewell to their best-known member.\nSpecial commemorative jerseys will be worn for Saturday's match against Rosario Central, club president Marcelo Moretti said.\nwith Reuters\nAustralian Associated Press",
  "word_count": 329,
  "scraped_at": "2026-02-14T12:53:45.759087"
}