{
  "article_id": "21795ce90975",
  "url": "https://www.rockmnation.com/2024/11/8/24291081/commute-brady-cook-really-might-not-play",
  "title": "Commute : Brady Cook really might not play ? ",
  "date": "20241108T160000Z",
  "domain": "rockmnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Commute: Brady Cook really might not play?\nThe Morning Commute for Friday, November 8th, 2024.\nThe injury report came out Wednesday and Brady Cook was listed as questionable. As of last night still questionable.\nVegas knows all, however. And the line has gone from Mizzou favored by 3 to OU favored by 3, which would indicate the odds makers aren’t very positive about Cook’s prospects to play. Maybe more importantly is if Cook can play like he’s capable of playing and not the banged up QB we saw two weeks ago?\nMissouri is clearly a better team with a healthy Cook. Regardless of any talk coming from Eli Drinkwitz, there doesn’t seem to be much fan confidence in Drew Pyne. And if you’ve read the OU Preview, you know the Sooners don’t have much going for them this year, but they do have a good defense!\nShould Cook not play it would probably increase their odds of winning the remainder of their games and a shot with a Bowl win to get to 10 wins. Should Cook play maybe he’s able to spur the Tigers on against OU and pull out a win, but putting him at risk of further harm down the road with three more games to play? What say you, Mizzou fans?\nI say go for broke, if he can play let him play.\nYesterday at Rock M and Rock M+\n- With it being Sooners week, what better way than to bask in the glory of winning recruiting battles against the boys from Oklahoma:\nThe Kirkwood, Missouri native committed to the Sooners in Aug. 2005. But during the 2005 college football season, Maclin was a regular attendee at Mizzou football games and developed a strong relationship with the coaching staff. A few months after committing to the Sooners, Maclin had a change of heart. He called then-OU wide receivers coach Darrell Wyatt and then-head coach Bob Stoops to tell them he would no longer be a Sooner.\nThere are some recent ones, but back when Maclin chose the Tigers it was when Stoops really had their program rolling. Before the 2005 season OU had 11 or more games 5 straight seasons including a National title. Meanwhile Missouri was coming off a disappointing 5-6 season.\n- It’s Friday, and that means Between the Numbers time on the Sooners:\nOklahoma’s offense is far apart from the two Tiger tormentors. Alabama’s offense ranks 3rd overall in SP+, and Texas A&M is 19th; Oklahoma is 56th.\nI’m fully prepared for this to end up like 9-6, which means it’s probably going to be a weird 56-49 game or something.\n- Sammy Stava talked to a Sooner’s site to get their take, and some updated Bowl projections with a couple picks for the Gator Bowl against Louisville. That seems mostly optimistic, so I’d be down.\n- Is it really time to talk about 2027 recruiting for Men’s Hoops? Matt Harris thinks so. Here’s his scout on one of the Tigers top targets Scotty Adkinson:\nDigging into Adkinson’s play-type data underscores why coach Dennis Gates and his assistants are exerting such early efforts. Adkinson’s at his best when blazing down the floor in transition, whether it’s leading the break (1.111 PPP), sprinting the right channel (1.200 PPP), or leaking out (1.571 PPP) ahead of the pack.\nAdkinson is attending Webster Groves, my alma mater. So I’m paying close attention to his progress.\n- The Mizzou women’s team defeated Southern in their home opener 66-51.\n- Over at Rock M+, there’s been plenty of good breakdowns post-Memphis. Including DataMizzou’s new feature The Verdict, a video breakdown for subscribers.\nWe spoke a little bit beforehand in the scout that Memphis struggled in scramble mode. That is when they overextended themselves trapping ball screens or overplaying perimeter players. You know how you beat it? You pass the ball. The one good look Mizzou got in the series of clips I shared was when the moved the ball around the perimeter (a rare reversal to the weak side; the near side as you’re viewing) and Pierce passed up a good look for a better luck against a late recovering defender.\nI cataloged the 14 offensive possessions where Mizzou went from up 11 to down 8. Plus Matt Harris provided the most recent update on Davion Hannah.\nRock M Radio: BTBS is ready for the Sooners\nSubscribe to Rock M Radio on Apple Podcasts. Or stream episodes through Megaphone or Spotify. Have a question for us? Leave a 5-star review with your question and that show just might answer it in an upcoming episode!\nIf you like Rock M Radio drop us a Review and be sure to subscribe on your preferred podcasting platform. Follow @RockMRadio on Twitter and if you heaven’t already head over to our YouTube channel and click that subscribe button!\n(** RockMNation has affiliate partnerships. These do not influence editorial content, though RockMNation may earn commissions for products purchased via affiliate links.**)",
  "word_count": 829,
  "scraped_at": "2026-02-14T13:40:22.262979"
}