{
  "article_id": "218718d01f55",
  "url": "http://www.bangladeshsun.com/news/278761764/messi-meets-india-champions-adidas-star-athletes-unite-at-purana-qila",
  "title": "Messi Meets India Champions : adidas Star Athletes Unite at Purana Qila",
  "date": "20251218T113000Z",
  "domain": "bangladeshsun.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "ANI PR Wire\n18 Dec 2025, 15:16 GMT+10\nBusinessWire India\nNew Delhi [India], December 18: adidas, committed towards fostering a dynamic multi-sport culture in India, brought together football legend Lionel Messi and some of the nation's most inspiring world champions. Set in front of the majestic Purana Qila, this moment reinforces adidas' enduring vision to create a global stage for sport where excellence is recognized and celebrated beyond borders.\nThe iconic heritage site transformed into a confluence of greatness as Messi shared a rare interaction with Sumit Antil (World Para Athletics Champion - Javelin), Nishad Kumar (World Para Athletics Champion - High Jump), Nikhat Zareen (Women's World Boxing Champion), Renuka Thakur (Women's T20 World Champion), and Kuldeep Yadav (Men's T20 World Champion). More than just a meeting, this was an exchange of mutual respect between athletes who have achieved greatness in their respective sports at a global stage.\nFrom Messi's triumphs at the FIFA World Cup and beyond to Sumit and Nishad's dominance in para-athletics, Nikhat's precision in the ring, and the World Cup heroics of Renuka and Kuldeep, this gathering symbolized the shared language of respect for athletes across sport. By bringing together champions from football, cricket, boxing, and para-athletics, adidas reiterated its belief that sport in India is evolving beyond boundaries.\nSpeaking on the moment, Vijay Chauhan, GM, adidas India, said: \"At adidas, we believe that sports is the ultimate unifier. Bringing a legend like Lionel Messi together with India's finest world champions and seeing them interact and inspire one another, reinforces this belief. This isn't just about individual greatness, but about the collective spirit of the three stripes that connects athletes across borders and disciplines.\"\nSharing his experience, Lionel Messi said, \"Sport knows no borders, and meeting these incredible Indian champions today has been a reminder that while the sports we play may be different, the passion and drive to win are the same. adidas has always stood for athletes across the globe, and it is a privilege to stand alongside these World Champions who are writing their own history and inspiring a new generation in India.\"\nThis historic union at Purana Qila serves as a powerful testament to the adidas spirit, bringing together legends of today to inspire the champions of tomorrow, united by the drive to push boundaries and redefine what is possible.\nLink to the collaboration post: https://www.instagram.com/p/DSXcN-dEiQB/?utm_source=ig_web_copy_link&igsh=MzRlODBiNWFlZA==\n(ADVERTORIAL DISCLAIMER: The above press release has been provided by BusinessWire India. ANI will not be responsible in any way for the content of the same)\nShares\nShare\nTweet\nShare\nFlip\nEmail\nGet a daily dose of Bangladesh Sun news through our daily email, its complimentary and keeps you fully up to date with world and business news as well.\nPublish news of your business, community or sports group, personnel appointments, major event and more by submitting a news release to Bangladesh Sun.\nMore InformationKolkata (West Bengal) [India], December 18 (ANI): The Indian Deaf Cricket Association (IDCA), supported by the Board of Control for...\nKolkata (West Bengal) [India], December 18 (ANI): Cricket icon and a defining Kolkata figure, Sourav Ganguly, has joined Tiigers of...\nNew Delhi [India], December 18 (ANI): Former Indian cricketer Aakash Chopra expressed surprise at New Zealand all-rounder Michael Bracewell...\nNew Delhi [India], December 18 (ANI): After the cancellation of the fourth T20I between India and South Africa at Lucknow due to excessive...\nMount Maunganui [New Zealand], December 18 (ANI): The New Zealand opening pair of Tom Latham and Devon Conway established a new record...\nAdelaide [Australia], December 18 (ANI): The snicko drama continued on day two of the third Ashes Test at Adelaide, with English wicketkeeper-batter...\nBEIJING, China: China's economic momentum faded sharply in November, underscoring mounting concerns that the country is running out...\nNEW YORK, New York - Wall Street closed lower on Wednesday, with losses across major U.S. benchmarks as investors retreated from equities,...\nHEFEI, China: Volkswagen is trying to reinvent itself in the country that once powered its global success and where it is now fighting...\nNEW YORK CITY, New York: Spanish infrastructure group Ferrovial is set to deepen its footprint in U.S. capital markets, becoming the...\nSHENZHEN, China: Huawei's latest flagship smartphone showcases incremental progress in China's domestic chipmaking push, with its processor...\nSTARBASE, Texas: SpaceX has taken a significant step toward the public markets, launching a secondary share sale that values the rocket...",
  "word_count": 726,
  "scraped_at": "2026-02-14T12:37:36.560789"
}