{
  "article_id": "21884a4f12da",
  "url": "https://www.myjoyonline.com/wpl-2025-26-army-ladies-jonina-ladies-falter-as-hasaacas-ladies-beat-oak-ladies/",
  "title": "WPL 2025 / 26 : Army Ladies , Jonina Ladies falter as Hasaacas Ladies beat Oak Ladies",
  "date": "20260119T140000Z",
  "domain": "myjoyonline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Audio By Carbonatix\nHasaacas Ladies closed the gap on the top two in the Southern Zone of the Ghana Women's Premier League following their win over the weekend.\nThe Hasmal Ladies claimed a narrow win over Oak Ladies on Saturday as Abiba Issah scored in her second consecutive game for the club.\nThe win takes the club to within two points of Army Ladies and one point behind Jonina Ladies who are second on the league table.\nArmy, who currently sit top of the league, suffered defeat at the expense of Epiphany Warriors, losing 1-0 at home on matchday 10.\nJonina Ladies were only able to pick up one point from their meeting with Soccer Intellectuals after playing out a 0-0 draw. The result means Jonina have failed to win back-to-back games for the first time this season.\nLadyStrikers were 1-0 winners over Samartex Ladies at home as the struggles of the latter continue at the start of the second round.\nPolice Ladies were on the road against Halifax Queens, picking up all three points against the bottom-rocked side.\nLatest Stories\n-\n‘I wanted to be an architect but ended up as a nurse’ – Diana Hamilton reveals\n22 minutes -\nFrom wards to worship: Diana Hamilton reveals how nursing school shaped her destiny\n39 minutes -\nMahama demands binding deadlines for African reparations\n1 hour -\nThis is not the time to settle political scores – Bawumia to government\n2 hours -\n5 definitive Valentine’s Day gifts to win your lover’s heart in Ghana\n3 hours -\n37% of SHS students exposed to drugs – Opare-Addo\n3 hours -\nNLC secures court injunction against striking tertiary unions\n4 hours -\nWaiting in the Ring: life inside Bukom’s halted boxing scene\n4 hours -\nRed Notice cancellation: OSP official fires back at Ofori-Atta’s lawyers\n4 hours -\nOfori-Atta saga: Red Notice ends after arrest – OSP official clarifies\n5 hours -\nAAG raises alarm over billboard demolitions, calls for presidential intervention\n5 hours -\nHealth Minister to chair probe into ‘No Bed Syndrome’ death; promises system overhaul\n5 hours -\nPrime Insight to tackle ‘galamsey tax’ debate, cocoa reforms and Ayawaso East fallout this Saturday\n6 hours -\nCocoa crisis, galamsey complicity and election credibility to dominate this Saturday’s Newsfile\n7 hours -\nINTERPOL deletes Red Notice for Ofori-Atta as extradition process continues — OSP confirms\n7 hours",
  "word_count": 398,
  "scraped_at": "2026-02-14T12:21:10.449016"
}