{
  "article_id": "218b84577a20",
  "url": "https://www.legit.ng/nigeria/1668109-adeboye-warns-chasing-wealth-soul-god-hate-enjoyment/",
  "title": "Adeboye Warns Against Chasing Wealth Over Soul :  God Does Not Hate Enjoyment  ",
  "date": "20250809T201500Z",
  "domain": "legit.ng",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Adeboye Warns Against Chasing Wealth Over Soul: “God Does Not Hate Enjoyment\"\n- RCCG General Overseer Pastor Enoch Adejare Adeboye has called on Christians to be wary of chasing worldly wealth over their souls\n- Pastor Adeboye made the call while speaking at the ongoing 73rd Annual Convention of the church in Ogun state\n- The cleric emphasised the importance of believers in maintaining spiritual discipline and fighting every temptation for worldly things if they want to live victoriously in Christ\nPastor Enoch Adejare Adeboye, the General Overseer of the Redeemed Christian Church of God (RCCG), has called on Christians not to prioritise material wealth above their spiritual well-being, saying such is \"an act of stupidity.\"\nThe cleric made the call while speaking at the ongoing 73rd Annual Convention of the church, when he emphasised the importance of believers in maintaining spiritual discipline and fighting every temptation for worldly things if they want to live victoriously in Christ.\nAdeboye's statement reads in part:\n“God does not hate enjoyment. But the body you pamper, shine, and make up will perish one day. Take care of the spirit, for that is what will go to heaven. The body does not want you to be an overcomer.”\nThe cleric explained that though God permits prosperity but the danger is relentless pursuit of wealth through ungodly means, some of which include cheating, lying or stealing, noting that all these contradict the life of an overcomer.\nPastor Adeboye speaks on Super Falcons' victory\nAt the convention, the cleric earlier sent an important message to President Bola Ahmed Tinubu over the financial rewards given to the victorious Super Falcons after their historic 10th Women’s Africa Cup of Nations (WAFCON) win in Morocco.\nSpeaking during the service on August 3, Adeboye commended the president for appreciating the players but argued that the coaches and technical officials deserved equal, if not higher, recognition for their role in guiding the team to victory.\nIn his sermon, Pastor Adeboye revealed that football is not won by strength alone but by strategy and wisdom, which the coaching staff provides.\nWhy Super Falcons win WAFCON - Pastor Adeboye\nThe RCCG general overseer stressed that without the tactical input and guidance of the coaches, the players might not have been able to clinch the title.\n“You need a coach to win; coaches have the knowledge and wisdom required to win. If you don’t know how to win, you will lose. To be a part of the winning team in life, you must know how to win. You need wisdom. Wisdom is better than strength.”\nThe RCCG leader suggested that the technical crew should not earn less than the players, because their planning, analysis, and instructions were instrumental in securing the 3-2 comeback victory against hosts Morocco in Rabat.\nPastor Adeboye speaks on his death\nLegit.ng earlier reported that Pastor Enoch Adeboye of the Redeemed Christian Church of God shared that he will pass away on a Sunday after church service and a meal of pounded yam.\nRCCG convention: Emotional reactions trail Pastor Adeboye's walking Step: \"Lord strengthen him more\"\nHe told worshippers during the church’s annual convention that death does not always follow illness and urged Christians to claim their God-given blessings.\nAdeboye’s sermon focused on healing, prosperity, fruitfulness, and long life, stressing the need to resist spiritual opposition and fight for divine rights.\nSource: Legit.ng",
  "word_count": 563,
  "scraped_at": "2026-02-14T13:44:26.119959"
}