{
  "article_id": "2192a42f227f",
  "url": "https://www.mirror.co.uk/news/politics/nigel-farage-cant-make-up-35799361",
  "title": "Nigel Farage cant make up his mind on key policy - and it not the first time",
  "date": "20250827T110000Z",
  "domain": "mirror.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Nigel Farage can't make up his mind on key policy - and it's not the first time\nIt is not the first time Nigel Farage has chopped and changed on his policies, with comments on the House of Lords and benefits all at times being contradictory\nNigel Farage is facing fury after yesterday unveiling a hard-right blueprint for mass deportations - despite previously saying it was \"literally impossible to do\".\nThe Reform UK leader's proposals - which are full of gaping holes and a lack of detail - are likely to face a host of legal and practical challenges. The draconian plans, which include paying the Taliban to take back migrants, were torn to shreds after Mr Farage failed to give any detail on the costs, the location of detention centres or where deportation flights would leave from.\nAnd the slapdash plans come off the back of Mr Farage himself last year saying it was \"literally impossible\" to deport all illegal immigrants. He told GB News last year: “It’s impossible to do. Literally impossible to do. For us, at the moment, it’s a political impossibility.”\nJust 24 hours after unveiling his big plans, Mr Farage proved his tendency to flip-flop on the detail - and rolled back on part of his proposals. Despite yesterday confirming women and children would be detained under his plans, he today reversed on that pledge and said they are not part of Reform UK's plans \"for the next five years\".\nREAD MORE: Nigel Farage condemned over 'toxic' deportation plans - 'This is not who we are'And it is not the first time Mr Farage has chopped and changed on his policies, with his comments on the House of Lords and benefits having been at times contradictory. It is noted that Mr Farage has made his announcements off the back of a 'Lawless Britain' campaign where he has sought to link crime with migration amid tensions and protests connected to asylum hotels.\nYesterday saw charities and campaigners accuse Mr Farage of stoking anger within communities and exploiting the small boats crisis for political gain. Labour ministers said his proposals \"are back-of-the-fag-packet plans without the substance on delivery\".\nBBC Presenter Jon Kay told Reform UK's former chair Zia Yusuf that Mr Farage's major plans appeared \"a flip-flop\", saying: \"That's quite a flip-flop isn't it, by Mr Farage, to say, 12 months ago, it's politically impossibly, and now he's saying, yeah, we're going to do it.\"\nMr Yusuf said: \"Nigel has taken the view that this not only can be done, it must be done, as Winston Churchill said: 'He who never changes his mind never changes anything.'\"\nIs Mr Farage a good communicator - as many people think - or does he just appear so because he seems to shift his position depending on the political weather? The Mirror takes a look at some of Mr Farage's recent changes in stance.\nGeneral election U-turn\nMr Farage is known for trying to capitalise on political opportunities when he thinks he might gain the most from them. Perhaps his biggest U-turn of all was last summer - when he said he wouldn't stand in the general election and then dramatically announced he would. \"I've changed my mind,\" he declared.\nAt an emergency press conference in London last June, Mr Farage said: \"Difficult though it is, I can't let down those millions of people, I simply can't do it, it'd be wrong. So I have decided I've changed my mind, it's allowed you know, it's not always a sign of weakness, it could potentially be a sign of strength. So I am going to stand in this election.\"\nIt led to a hastily arranged Reform UK campaign that saw the party plagued by controversial stories about its election candidates.\nBenefits position change\nElsewhere, it has been noted that Mr Farage's political narrative goes in whichever direction he thinks the public wants. He was accused of making \"fantasy promises\" earlier this year after he surprisingly announced he wants to scrap the two-child benefit limit and reinstate universal winter fuel payments - both traditionally left-wing moves.\nAnd it marked a change in tone from Mr Farage's previous comments criticising the welfare state, such as in 2023 when he claimed some people on benefits are “too fat … too stupid, too lazy” to work.\nHouse of Lords switch\nLikewise, his position on the House of Lords recently changed. Earlier this month Mr Farage wrote to Keir Starmer demanding Reform UK peers be nominated to the Lords. It was a significant change in position from him previously calling for the unelected House of Lords to be abolished.\nIn a letter to the PM, Mr Farage criticised Reform UK not being allowed to nominate anyone. He said: “My party received over 4.1 million votes at the general election in July 2024 [and] have since won a large number of seats in local government, led in the national opinion polls for many months and won the only by-election of this parliament... The time has come to address the democratic disparity that exists in the upper house.”\nTampering with British flag\n\"Fake patriot\" Mr Farage was accused of hypocrisy earlier this month after flogging football shirts with a modified British flag - despite slating England and Team GB for doing the same thing.\nThe Reform leader branded it an \"absolute joke\" last year when the England team's jerseys included a multicoloured version of the St George's flag. And he also lashed out at Team GB merchandise - saying he was \"dead against\" changes to the Union Jack.\nBut earlier this month he unveiled a range of Reform-branded footie kits that featured a pale blue and white version of the British flag, without a dash of red to be seen. Labour MP Mike Tapp told The Mirror: \"Nigel Farage is a fake patriot, so it is quite fitting that he is wrapping himself in a fake British flag.\"\nScotland change\nMr Farage U-turned on a plan to scrap all MSPs - just last month.\nHe previously wanted to axe Scotland's parliament and put Scotland’s Westminster politicians in there only when they decide on Scottish matters. But he later reversed his position, telling The Scottish Sun: “I don’t think you can turn the clock back. We’re not going to reverse devolution.”\nREAD MORE: Join our Mirror politics WhatsApp group to get the latest updates from Westminster",
  "word_count": 1067,
  "scraped_at": "2026-02-14T14:18:20.895671"
}