{
  "article_id": "21bc1730be0d",
  "url": "https://punchng.com/turkish-delight/",
  "title": "TURKISH DELIGHT ! ",
  "date": "20250414T014500Z",
  "domain": "punchng.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "On a drab weekend for most Nigerian stars, there was something to cheer in Turkey as former Edo Queens player and Falcons midfielder, Olise opened her account in the Turkish women’s topflight. ABIODUN ADEWALE reports\nTURKEY\nCHIOMA OLISE (TRABZONSPOR)\nNigerian midfielder Chioma Olise came on as a second half substitute and inspired Trabzonspor Women to an emphatic 4-0 win over ALG Spor in their Turkcell Women’s Football Super League clash on Sunday. After a goalless first half, the former Edo Queens player broke the deadlock in the 52nd minute, scoring the opening goal that ignited Trabzonspor’s attack and sent the home fans into jubilation. Nine minutes later, in the 61st minute, Diana Lucas Msewa doubled Trabzonspor’s lead, and she further extended it to 3-0 in the 65th minute. Azra Ardos completed the rout in the 76th minute, sealing a comprehensive 4-0 victory for the home side.\nDAVID OKEREKE (GAZIANTEP)\nOkereke bagged his third assist of the season and powered Gaziantep to their 12th win of the season in their 2-1 win over Hatayaspor on Sunday. The Nigerian forward set up Halil Dervisoglu for the match-winner in the 59th minute. Gaziantep had gone down by a goal to their visitors but began their comeback on the stroke of halftime when Dervisoglu assisted Emmanuel Boateng. Meanwhile, Okereke, who joined the club from Torino in the summer now has eight goals and three assists after 24 games this season.\nBRIGHT OSAYI-SAMUEL (FENERBAHCE)\nOsayi-Samuel was booked for elbowing an opponent in Fenerbahce’s 3-1 win over 10-man Sivasspor. The Super Eagles defender was cautious for the rest of the game as he completed 90 minutes to help Jose Mourinho’s side keep the pressure on league leaders Galatasaray. It was his second booking of the season in 19 league games.\nOLAWOYIN, AKINTOLA (RIZESPOR)\nThere was no respite for 10-man Caykur Rizespor as they were beaten 2-0 by Tranzonspor on Sunday with both Ibrahim Olawoyin and David Akintola unable to salvage anything for them. While Olawoyin was on for the entire duration of the game, Akintola played for 67 minutes as they areedging closer to the relegation zone. They are just three points away from safety.\nANTHONY NWAKAEME (TRABZONSPOR)\nAfter returning from a lengthy spell on the sidelines as a substitute last week, Nwakaeme got his first start for Trabzonspor, playing for 80 minutes in their 2-0 win over Rizespor.\nITALY\nADEMOLA LOOKMAN (ATALANTA)\nAfter three consecutive defeats, Atalanta returned to winning ways with a 2-0 victory over Bologna on Sunday but Ademola Lookman’s goal drought continued. The Nigerian forward has not scored in his last four games for the club, with his last coming in the 4-0 drubbing of Juventus before March’s international break.\nFISAYO DELE-BASHIRU (LAZIO)\nAfter inspiring their last league win on his full return from injury, Dele-Bashiru kept his place in the starting lineup as Lazio faced Roma in the Rome Derby. He had three goals and one assist in 18 games this season.\nBELGIUM\nJORDAN TORUNARIGHA (GENT)\nNigerian defender Torunarigha was booked for rouging but he was very instrumental for 90 minutes as Gent recorded a priceless 1-0 away win over Antwerp in the Belgium league title chase.\nAROKODARE, SOR (GENK)\nTolu Arokodare and Yira Sor fired blanks as league leaders Genk saw their advantage on the log reduced to one point no thanks to a 1-0 defeat at home against defending champions Club Brugge. They were undone by a stoppage time penalty.\nRAPHAEL ONYEDIKA (CLUB BRUGGE)\nOnyedika was on for 86 minutes as reigning champions Club Brugge cut the gap on Genk to one point in the Belgium top division.\nCYPRUS\nFRANCIS UZOHO (OMONIA)\nAfter making his third league appearance last week, Uzoho was dropped to the bench again as Omonia played out a 1-1 draw in APOEL.\nSCOTLAND\nCYRIEL DESSERS (RANGERS)\nDessers came on as a second half substitute, playing just 15 minutes as Rangers fought back for a 2-2 draw against Aberdeen. They delayed Celtics title confirmation but their rivals are still destined to claim the crown this season. The striker has 12 goals and two assists this season.\nSPAIN\nRASHEEDAT AJIBADE (ATLETICO WOMEN)\nAfter coming on as a substitute in their last two games, Super Falcons captain Ajibade returned to the bench and didn’t get a minute in their 6-0 drubbing against Barcelona Women. Despite making a bright start to the league, Ajibade has had a quiet campaign, no thanks to injuries with six goals and two assists in 17 games.\nEDNA IMADE (GETAFE)\nImade is among the top scorers in the Spanish Women’s topflight with 13 goals so far but she was silenced on Sunday despite Granada’s 2-1 win at Tenerife.\nRINSOLA BABAJIDE (TENERIFE)\nBabajide scored a goal and assist before the international break but she also seemed to have been halted by the break as she couldn’t help Tenerife from falling to a 2-1 defeat against Granada.",
  "word_count": 811,
  "scraped_at": "2026-02-14T12:43:35.512356"
}