{
  "article_id": "21c210d74691",
  "url": "https://www.brandonsun.com/business/2025/05/20/after-success-in-france-canadian-defender-vanessa-gilles-joins-bayern-munich",
  "title": "After success in France , Canadian defender Vanessa Gilles joins Bayern Munich – Brandon Sun",
  "date": "20250520T150000Z",
  "domain": "brandonsun.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "After success in France, Canadian defender Vanessa Gilles joins Bayern Munich\nAdvertisement\nCanadian international defender Vanessa Gilles, who spent the last three seasons with France's Lyon on loan from Angel City FC of the NWSL, has been sold to Bayern Munich.\nRead this article for free:\nor\nAlready have an account? Log in here »\nWe need your support!\nLocal journalism needs your support!\nAs we navigate through unprecedented times, our journalists are working harder than ever to bring you the latest local updates to keep you safe and informed.\nNow, more than ever, we need your support.\nStarting at $15.99 plus taxes every four weeks you can access your Brandon Sun online and full access to all content as it appears on our website.\nSubscribe Nowor call circulation directly at (204) 727-0527.\nYour pledge helps to ensure we provide the news that matters most to your community!\nTo continue reading, please subscribe:\nAdd Brandon Sun access to your Free Press subscription for only an additional\n$1 for the first 4 weeks*\n*Your next subscription payment will increase by $1.00 and you will be charged $20.00 plus GST for four weeks. After four weeks, your payment will increase to $24.00 plus GST every four weeks.\nCanadian international defender Vanessa Gilles, who spent the last three seasons with France's Lyon on loan from Angel City FC of the NWSL, has been sold to Bayern Munich.\nRead unlimited articles for free today:\nor\nAlready have an account? Log in here »\nHey there, time traveller!\nThis article was published 20/05/2025 (270 days ago), so information in it may no longer be current.\nCanadian international defender Vanessa Gilles, who spent the last three seasons with France’s Lyon on loan from Angel City FC of the NWSL, has been sold to Bayern Munich.\nAngel City said the 29-year-old centre back from Ottawa will join the German side on July 1 once her loan with Lyon concludes. Her contract with Munich runs through June 30, 2028.\n“Vanessa is a player who always gives 110 per cent on the pitch. That’s the kind of character that fits in perfectly with FC Bayern and our philosophy,” said Francisco De Sá Fardilha, technical director for the Bayern women’s team. “She’s one of the best central defenders in the world, as far as tackling and defending in the penalty area are concerned.\n“She also has plenty of experience at the very highest level. Vanessa has won the Olympic Games with her country, Canada, and has also played in the Champions League final. In that respect, she’ll definitely help us in the big games, particularly in Europe.”\nGilles has won 51 caps for Canada and is one of the first names on Canadian coach Casey Stoney’s team sheet. Dominant in the air, Gilles has scored eight goals for Canada.\n“Everyone knows Munich, everyone knows the history of this great club,” Gilles said. “I’m looking forward to working with a team that has represented high ambitions for many years. That’s a very good fit for my goals, be it at domestic level or in the Champions League. In addition, the family environment around the whole club impressed me a lot from the start.”\nThe Bayern women are coming off their third straight Bundesliga title — and seventh in all — after finishing the season with a 19-1-2 record. Bayern, knocked out of the women’s Champions League by Lyon in the quarterfinals, won every league game in the second half of the season.\nBayern is also home to Canada captain Alphonso Davies, a star fullback with the men’s team.\nSince joining Lyon, Gilles has made 77 appearances, with nine goals and five assists in 6,644 minutes played. She helped the club to the UEFA Champions League title in 2022 and French league titles in 2022 and 2024.\nGilles, who scored Angel City’s first-ever regular-season goal on April 29, 2022, played collegiate soccer for the Cincinnati Bearcats between 2014 and 2017. She joined Cypriot club Apollon Limassol before moving to France with Girondins Bordeaux, where she worked under incoming Bayern coach José Barcala.\nShe signed with Angel City in January 2022, before being loaned out to Lyon in September that year.\nStoney called the move to Munich “an exciting new chapter” for Gilles.\n“Sometimes change is good,” she said. “It’s a new league, new team. Sometimes being uncomfortable is a good thing. It’s going to stretch you and challenge you. Tactically, a little bit different, I’d say, in the German league than the French league. And again, Champions League football at the highest level.\n“It’s only going to benefit her in the long run. She’s had a fantastic career at Lyon and I’m sure she’s excited about this new chapter.”\n—\nThis report by The Canadian Press was first published May 20, 2025",
  "word_count": 800,
  "scraped_at": "2026-02-14T12:24:05.164495"
}