{
  "article_id": "21e744b4f555",
  "url": "https://www.broadcastnow.co.uk/bbc/lisa-nandy-media-and-telecoms-2025-and-beyond-conference-speech-in-full/5205685.article",
  "title": "Lisa Nandy : Media & Telecoms 2025 and Beyond Conference speech in full",
  "date": "20250603T164500Z",
  "domain": "broadcastnow.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Culture secretary addressed delegates in London\nI said when I addressed the Royal Television Society at the end of last year that there is a choice ahead of us, whether we choose to be the last guardians of this chapter or the first pioneers of the next. And those of you in this room are those pioneers, public service broadcasters, providing an engine room of talent development and creativity, a strong independent sector producing and distributing British content seen at home and around the world on screens big and small, a rich and varied press holding the powerful to account, not always comfortably for us in government, but essential to the functioning of a healthy democracy, and an advertising ecosystem that underpins all of this and makes it possible.\nYou and your sectors are central to the cultural, democratic and economic life of this country and many other countries around the world. This government values what your sectors bring to the economy, to skills and good jobs, and as a symbol of that, we have chosen to back the creative industries as one of the eight highest growth industries in the UK in our forthcoming industrial strategy. Over the last decade, the creative industries have increased their output at more than one and a half times the rate of the rest of the economy. They, you, are a major UK employer. You drive growth at home and you project the UK overseas. Collectively, you underpin a hugely important industry for this country. And whilst we will have more to say on the sector plan shortly, that will put rocket boosters under the creative industries, I want to say now that this government recognises your value and we have your back.\nBut the media is, and always has been, about much more than that. And there’s one issue above many others that I want to talk with you about today. Trust. Last summer, when many of our towns and cities went up in flames, nobody could ignore the fractured nature of society. We have found multiple ways to divide ourselves from one another over recent decades, and it feels at times that we’ve lost the ability to understand one another. When people are working harder than ever before, but can’t make ends meet, when their contribution is not seen or valued, when politicians display a violent indifference to the things that matter, a decent high street, transport, a viable football club, it is no wonder that people lose trust, trust in our leaders, trust in our democratic institutions and trust in each other.\nThat’s when news and information becomes critical. Not the sort of news and information that helps to polarise and divide, but trust in news that builds a shared understanding of the world.\nAnd we’re all of us in this room custodians, custodians of our institutions, but more than that, custodians of a cohesive, self confident country. And who of us can look at this country and the world right now and say that we’re succeeding?\nWe know that people rate traditional news sources high on trust, accuracy and impartiality. We also know that news sourced via social media is rated significantly lower, and I think we’re all aware of the darker side of social media, where facts are disputed and division is sown. Against that backdrop, your work is not just important, it is central to the future of this nation.\nI’ve always believed in the power of media, because it is in my blood. My mum was one of the only female editors at Granada TV in 1989, running a busy newsroom on the day that Hillsborough happened. I remember vividly as a 10 year old sitting in the newsroom with my sister until late into the night as the horrific scenes unfolded, watching her make the agonising call for the cameramen on the ground to keep filming rather than aid the rescue effort. That footage would later become critical in achieving justice for the 97, revealing evidence of a cover up and improving safety in stands at football grounds.\nI watched my stepdad make the call to commission ‘Who Bombed Birmingham?’ and persist with the program over several months despite intense opposition. That documentary didn’t just go on to ensure the release of the Birmingham Six. It exposed a miscarriage of justice that would send shockwaves through the country and lead to major reforms to the criminal justice system that persist to this day. It’s in these moments that great journalism shines a light into the darkest parts of our country, holds up a mirror to those in power, and reasserts the power of the people.\nI can think of no better recent example of this than last summer, as our towns and cities were set ablaze by violent thugs. It was local media on the ground who countered mis- and disinformation in real time. And they told the real story, the story of our communities, who came together to defend all of us in all of our diversity and led the community fightback.\nOur national and local media is, in short, too important to fail. But we appreciate as a government that you are businesses with a bottom line, and you have been operating in the toughest of environments for some time. You don’t need me to tell you that consumer habits are changing. Seventy one percent of UK adults consume online news in some capacity, twice as many as a decade ago, and that includes some eighty eight percent of 16 to 24 year olds. Just one in 10 pick up a print newspaper, compared to over half of over 75s. And for Gen Z, internet influencers are considered almost as trustworthy as traditional media. So I’m glad that the next session in this conference is focused on news and media in the AI age.\nBut these aren’t the only changes that we are collectively grappling with. When it comes to the media sector, there is enormous upheaval. Print advertising is down by a third, but online advertising has more than doubled. Broadcast viewing is down by a quarter, but on demand viewing is soaring, and the advent of AI, with its enormous potential to support creativity, comes with fresh challenges around copyright, authorship and fair compensation. The consequences of this can be stark and they can be uneven. Take, for example, the dramatic shift in TV commissioning patterns that have seen the UK become a world leader in high end, at the same time that smaller producers have seen the value of their commissions fall by a third and too many talented creatives left out of work.\nWe’re living through a revolution, but just as with the invention of the printing press and every revolution since, we don’t run from it, we adapt again, and we learn how to become stronger for it, in a new age. And at a crucial point in our history, governments have always proactively partnered with industry to forge a new path forward, like the Annan Committee in 1974, a landmark review into the future of broadcasting that my dad was a member of. It led to the creation of Channel Four, a recognition that the country had changed, with working classes, women and minority communities crying out to be heard in this new society and a nation that needed to define itself once again.\nWe’re in a similar period of transition now, and transitions need to be managed. Our job as a government is to create the framework so you can keep providing rigorous journalism in an evolving news landscape, among which the creative output that is only produced by people coming together across every part of the United Kingdom, that resonates with them and their lives. That’s why we’ve already acted in the last year to fix the foundations, implementing the Online Safety Act to keep users safe while protecting press and media freedom, recognising the value and importance of recognised news publisher content. Implementing the new digital markets regimes to allow you to challenge market dominance that negatively impacts your business, and convening the National Committee for the Safety of Journalists, to bring industry and government together to protect journalists and allow you to speak truth to power.\nI’ve heard from you the need for fair competition and a government that supports you. That’s why we’ve already acted to protect the sustainability of the sector, implementing the Media Act, delivering a new, more sustainable settlement for our public service broadcasters, so they can continue to invest in high quality original UK content, as well as a level playing field for our radio stations. Hearing your concerns about less healthy food advertising restrictions and acting quickly to support clarity and common sense. Increasing funding for community radio stations this year to £1 million to help support hyper local stations that represent and unite their communities. Providing clarity on foreign state ownership of newspaper enterprises, a tough and crucially workable regime to protect our newspapers from foreign interference, while ensuring sustainable investment so that our papers can thrive, and making changes to the media ownership regime to protect news in all its forms from influences that could risk our plural and trusted media.\nBut I do want to pause for a moment on AI, which has been the subject rightly of so much debate, not just here, but across the world. We are determined to find a way forward that works for the creative industry and creators, as well as the tech industries. Creators are the innovators, fundamental to our economic success in the future. And with my colleague Peter Kyle, we’re working together to find a better solution. The issue of AI and copyright needs to be properly considered and enforceable legislation drafted with the inclusion, involvement and experience of both creatives and technologists. And so as soon as the Data Bill is passed by Parliament, Peter and I will begin a series of roundtables with representatives from across the creative industries to develop legislation, with both houses of Parliament given time to consider it before we proceed. We approach you with no preferred option in mind. During the consultation we have heard you loud and clear that what works for one part of the creative industries doesn’t work for another. Now you know as well as I do that in this international landscape, there are no easy solutions, but this government is determined to work with you to find a solution with transparency and trust as its foundation. We have heard you loud and clear.\nI will never stop working for creatives to deliver solutions, transparency and the empowerment that you need in the digital age. We are a Labour government, and the principle of people must be paid for their work is foundational, and you have our word that if it doesn’t work for the creative industries, it will not work for us.\nPeople are at the heart of this industry, and so we’ve also acted to support the people at the heart of this sector, supporting the launch of CIISA to tackle head on the issues of workplace culture that have plagued our creative industries for too long and denied us a chance to harness the full range of talent that exists in our country. I’ve been particularly pleased to see the BBC’s recent announcement that it will no longer commission companies who are not signed up to the CIISA standards. That is what leadership looks like. I’m publishing updated online safety guidance to support journalists to report in the public interest without fear. I’m proud of what we’ve been able to achieve together in just one year.\nBut as the sector evolves, so must we, and we want a vibrant and sustainable media ecosystem with PSBs, streamers, indies, radio, TV, press, thriving across the UK, and not just individually, but collaborating together to invest in the skills, infrastructure and co-productions that we need, and when you do well, we won’t penalise you through new taxes and levies, but ensure that we have a regulatory framework that incentivises inward investment that creates opportunities for businesses, both big and small, and the UK talent to be showcased across the world.\nTake Bad Wolf as an example. First, a successful indie partnering with the BBC, then getting long term investment from Sky, HBO and most recently Sony, and now with the help of the Welsh Government, one of the anchor tenants of the Cardiff creative cluster. Or the growing cluster of audio producers in Manchester, such as Made in Manchester and Audio Always supported by the shift of BBC commissioning to the region.\nI told you this government would have your back, and we will. Over the coming months, we will build on Ofcom’s Public Service Media Review during the summer by taking action to ensure our public service broadcasters can continue to do what they do best long into the future. We will publish a Local Media Strategy to ensure that people in every town, city and village can access trust in news that reflects their lives as reserves better, helping them to hold local public services to account. As a government, we are committed to the biggest devolution of power out of Westminster and Whitehall in a generation, which will make local news and local media the most important that it has ever been.\nWe will launch the BBC Charter Review later this year to support a BBC that is empowered to continue to deliver a vital public service funded in a sustainable way. A BBC that can maintain the trust and support of the public in difficult times, support the wider ecosystem, and that is set up to drive growth in every part of the United Kingdom.\nLater this month, we’ll publish a Creative Industries Sector Plan to turbocharge the growth of creative industries right across the UK. To support film and TV clusters from Birmingham to Belfast. To tap into the huge potential for growth that exists across our country.\nMy commitment to you is an open and collaborative partnership with the government so that we can walk through this transition together. We will play our part, but we need you to play yours. We need more collaboration within your sector and especially between our public service broadcasters, to tackle these great social and economic challenges, working together in a number of areas, particularly tackling mis- and disinformation and promoting high quality news by investing in your journalism arms, partnering more rather than competing with or undercutting local news publishers, improving media literacy by helping consumers find and recognise accurate and impartial news reporting, supporting initiatives like BBC Verify and the Local Democracy Reporting Service.\nWe need you to work together to promote high quality children’s content. We all want our young people to grow up to see the high quality content that will educate and inform and equip them for the world. But also to inspire young people who see themselves and their opportunities in your content, bringing untold benefit to the industry in inspiring future generations of content makers. We make great children’s content in the United Kingdom, but we don’t collectively promote it enough.\nAnd also to understand how you can lead on this great transformation, thinking creatively about alternative ways to monetise your content and assets, and crucially, working together to move to where people are building on and developing more shared platforms and operations, like freely at radio player to help manage costs that make it easier for audiences to access your content.\nWe need you to take seriously the need to shift resources, opportunities and commissioning power to every nation and region. There is a principle that will run through our industrial strategy like a thread: economic growth, good jobs, skills and opportunities. Not just in one part of the country, but in every single nation and region, across our towns, villages and cities. So we need you to step up and do more, not just paying lip service to the need for regional and national content, but really embedding yourselves in those communities to make sure that those voices are heard, those stories are told. Because talent is everywhere, but opportunity is not.\nIn a world where trust is at a premium, it’s easy to draw divisions: broadcasters versus streamers, online versus print, local versus national, big versus small. But we have to reject that way of thinking. Because despite all the talk of challenges, and there are many, the fundamentals of our media sectors are strong. They have great talent and infrastructure, and I hope that we can work together to create a great policy framework too, so that you can continue to be the custodians of our national life and usher this country into the coming decade.\nIt’s my firm belief that this country has been through difficult times, buffeted by global forces and decision-making at home, and we need to take this moment to recover our sense of self confidence. When it comes to the creative industries, whether it’s film, TV, fashion, music, arts, culture, we are really good at this stuff. We light up the world with the content that we’re able to make and produce and we change lives here, at home and overseas.\nRecently, I was in India and then Japan, and I couldn’t fail to be impressed by the esteem in which British media and creatives are held. Millions of people around the world watch big budget dramas like ‘Doctor Who’ and ‘Bridgerton’, but they also watch a slew of other fantastic shows and formats from ‘Planet Earth’ to ‘Come Dine With Me’ and everything in between. They read our news, they watch our adverts, they listen to our podcasts.\nWhat that does is not just project the UK to the rest of the world, but it connects people in an increasingly fragmented, divided and polarised world. So many of the people I spoke to wanted to come and make things in the UK with the UK, we are a cultural powerhouse. No one will be a more passionate advocate for our sectors than me or our ministerial colleagues at DCMS.\nSo know that you have our full support as we enter this new era. Know that I am confident that if we work together, we can face head-on these challenges and make the most of change as a country. We’ve been drifting too long, but now is the time to chart a new course, a media that is fiercely independent, that creates and produces some of the best content in the world. That draws on the talent that exists in every corner of our country to shape, define and give voice to our national story, and provide those moments that bring us together in shared experience at a time when so much of our consumption is fractured and polarising. As we look to this new era and a new country, let nobody say that it falls to anybody else. It falls to us",
  "word_count": 3187,
  "scraped_at": "2026-02-14T14:16:47.170575"
}