{
  "article_id": "21e994f96902",
  "url": "https://www.france24.com/en/live-news/20240517-brazil-to-host-2027-women-s-world-cup-as-gaza-overshadows-fifa-meeting",
  "title": "Brazil to host 2027 Women World Cup as Gaza overshadows FIFA meeting",
  "date": "20240517T080000Z",
  "domain": "france24.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Brazil to host 2027 Women's World Cup as Gaza overshadows FIFA meeting\nBangkok (AFP) – The Women's World Cup will take place in South America for the first time after Brazil was chosen to host the 2027 edition at a FIFA congress Friday marked by debate about the war in Gaza.\nIssued on: Modified:\nAfter the success of Australia and New Zealand last year, FIFA members picked Brazil over a European bid in a push to expand women's football to new continents.\nDelegates meeting in Bangkok voted by 119 votes to 78 to send the 10th Women's World Cup to the land of samba football, beating a joint bid from Belgium, the Netherlands and Germany.\nThe decision sparked celebrations from the Brazilian bid team.\nBrazilian Football Confederation President Ednaldo Rodrigues hailed it as a \"victory for Latin American football and for women's football in Latin America\".\nBrazil, home of women's football great Marta, scored higher than its European rival in FIFA's evaluation report.\nFIFA inspectors had noted the \"tremendous impact on women's football in the region\" that South America hosting the Women's World Cup would have.\nBrazil's bid includes 10 stadiums used for the men's World Cup in 2014, with Rio de Janeiro's famous Maracana lined up for the opening match and final.\nBut work needs to be done, in particular to the Amazonia stadium in Manaus which has stood almost unused for a decade.\nUnlike their male counterparts, who have won five World Cups, Brazil's women have never lifted the trophy and made a group-stage exit in 2023.\nLast year's tournament set records, including earning $570 million in commercial revenue.\nOn the pitch it defied fears that increasing the size from 24 to 32 teams would dilute the spectacle, with over 1.4 million fans streaming through the turnstiles to witness a host of shocks.\nGone were the lopsided scorelines that were a feature of previous World Cups, reflecting a growth in the standard of women's football.\nSeven teams notched their first World Cup wins and the United States and Germany, who between them had won six of the previous eight tournaments, were both dumped out early.\nThe only sour note came in the aftermath of last year's final in Sydney, in which Spain beat England 1-0.\nSpanish football federation chief Luis Rubiales sparked outrage when he forcibly kissed midfielder Jenni Hermoso during the medal ceremony, and now faces prosecution for sexual assault.\nGaza debate\nThe 74th FIFA congress, making its debut in Thailand, made its choice by open vote for the first time as the organisation seeks to move on from the corruption and shady dealing that dogged it in the past.\nDelegates had their choice simplified last month when the United States and Mexico withdrew their joint bid, deciding instead to focus on trying to win the right to stage the 2031 edition.\nAs the Brazil tournament approaches, the focus will be on the huge financial disparity between men's and women's football.\nPrize money for the 2023 Women's World Cup was a record $110 million, but that was still far short of the $440 million on offer to teams at the 2022 men's finals in Qatar.\nThe congress also heard a call from the Palestinian FA (PFA) to suspend Israel from the world body and ban Israeli teams from FIFA events.\nPFA head Jibril Rajoub said the Israeli FA (IFA) had broken FIFA rules, adding: \"FIFA cannot afford to remain indifferent to these violations or to the ongoing genocide in Palestine.\"\nHis Israeli counterpart Shino Moshe Zuares rejected the call as \"cynical, political and hostile\", insisting the IFA had not broken any FIFA rules.\nFIFA supremo Gianni Infantino said the body would take independent legal advice on the matter and decide by July 20 what action to take, if any.\nSignificant changes\nThe congress also approved changes to FIFA statutes, removing the rule fixing the organisation's headquarters in Zurich, where it has been since 1932.\nThe rule now says the location of the HQ will be \"determined by a decision passed by the congress\", opening the way for it to move from the Swiss city.\nDelegates also voted to multiply the number of committees from seven to 35, reversing steps taken in 2016 to clean up FIFA after it was rocked by a wave of corruption scandals.\nThe remits of the new committees include women's football, the fight against racism and eSports, but critics say they risk re-establishing a patronage system the reforms had sought to abolish.\nInfantino also floated the idea of an under-15 World Cup or festival, as well as a \"legends\" World Cup.\n© 2024 AFP",
  "word_count": 771,
  "scraped_at": "2026-02-14T12:08:46.917709"
}