{
  "article_id": "21eb7eaf9a35",
  "url": "https://internationalviewpoint.org/spip.php?article7935",
  "title": "Brazil : a victory in a tragedy underway - International Viewpoint",
  "date": "20230101T183000Z",
  "domain": "internationalviewpoint.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In the final moments, Lula and his team finally came out of their offices and engaged in a popular campaign. This changed the atmosphere between the two rounds. A mix of activists, intellectuals, voters from all walks of life including the working classes, all faced the fear fuelled by Bolsonaro’s government and took to the streets. At the same time, many networks were activated to support Lula, to detect “fake news”, to circulate verified texts and to spread the main instructions, especially the most popular ones. All this was done more or less spontaneously, in an effort that brought together forces from various lefts with adherents and sympathizers of the Workers’ Party, the PT, with anti-Bolsonarists of all tendencies. There was no systematic organization, which made the slogans all the more heterogeneous, and tilted the whole electoral campaign towards a personalized support for Lula.\nNevertheless, everyone - because it was repeated enough - knew that this election was only the beginning of a rather hard struggle and that it was necessary to keep up and take forward popular organizing in order to ensure the transmission of presidential power and, in addition, to preserve the slogans and demands in the face of a powerful proto-fascism. It was necessary to confront the media as a whole, some of which displayed an anti-Bolsonarist position but without support for the PT. But also to attack several Bolsonarist social networks and their algorithms (YouTube, WhatsApp, Telegram, Facebook and others), which counted on big funding, including from the US.\nThe dominant classes - especially the most concentrated sectors (banks, mega-owners in agribusiness, part of the industrialists) - showed their dissatisfaction with Bolsonaro, but this did not mean any support for the PT. We should not forget the military and police forces that supported Bolsonaro without stopping the threats coupled with blackmail.\nAs expected, the day after Lula’s victory - by a narrow margin of 2.1 million votes - Bolsonarists organized roadblocks to demand the cancellation of the elections, demanding military intervention, all under the watchful eye of the military and police (who, by the way, did everything to prevent the poorest voters in several regions from reaching their polling stations). After almost a fortnight of blockades, these Bolsonarists finally gathered around the military headquarters from where they continue to shout putschist slogans.\nImmediately after the commemorations, the PT and Lula himself made one last use of these popular networks, which are so valuable for consolidating popular reorganization, despite their great diversity. But they did so in the opposite direction - to immobilize them, to silence them, to demobilize popular activity, to break this fundamental chain of communication. They joined the mainstream media, which also took the vow of the three monkeys - not to listen, not to see, not to speak.\nThus, for the last forty days we have silently witnessed the daily presence of the far right, its obvious rapprochement with the military despite Bolsonaro’s silence. But we have also seen these putschists cover themselves in ridicule, with the online broadcast of their sick behaviour.\nThere have been popular protests, especially from some social movements, such as the MTST - Movement of Workers Without a Roof, small parties located in a true anti-capitalist left, as well as anti-fascists. But the calls for calm were renewed by the PT, despite the success of some football fans who broke through blockades to attend their matches and some spontaneous breakthroughs of these blockades by people without visible organization.\nThis highlights the process that is underway. For the newly elected government, it is a matter of reserving all decisions at the highest level of the chain of command, of cooling the ardour of popular participation, and of remaking a coalition that claims to range from the left to the ruling classes, as well as harbouring sectors of the right and even the extreme right. This is a much broader spectrum than that of the previous PT governments. In short, a national union that includes fascist or fascist forces.\nIt is not an easy situation and we must not forget that we are facing a rather dramatic circumstance. It can be calculated that a third of those who voted for Bolsonaro are fundamentally Bolsonarist, that is to say, each day closer to fascist positions. Among them, a significant section belongs to the working classes. And this despite the almost 700,000 deaths of the pandemic, largely due to the genocidal policies of Bolsonaro and his team. Brazil is the only country in the world where an austerity policy has been constitutionalized, with 50.8% of the national budget devoted to paying the public debt and/or interest. [1] This constitutional amendment has been renamed the “end of the world ceiling”. The big banks, financial funds, brokers - Brazilian or foreign - are the beneficiaries of this debt. In contrast, the most miserable received intermittent aid, as during the pandemic even Bolsonaro was obliged to ensure their survival, and their number reached 21.5 million people in November 2022. [2] Many of these subsidies were granted illegally (the percentage is not yet known) at the time of the elections, although the law formally prohibits this. The bad faith - for the benefit of the banks - went further. Consigned loans, i.e. intended to be repaid by future deductions from these aids, with abusive interest rates, were offered as if they were a donation and put the poorest people in debt for a long time. On the other hand, almost two million people received these grants at the last minute without being registered, and some of them were given to the military or to pro-Bolsonaro sectors.\nThe outlook is even bleaker: the parliament elected in 2022 is predominantly hard right, as are the elected governors. Six of them belong to forces close to the left, out of a total of 27, while the rest belong to the right. [3]\nThe institutional situation is dramatic and almost all the administration for popular rights is being ravaged - education, health, science, public transport, climate change issues, support for indigenous peoples, support for women, anti-racism, urban tragedies, etc. Inequalities are growing. The only institutions that emerge unscathed from this proto-fascist government are the armed forces, the police, the judiciary and parliament. All very well paid, and infiltrated by proto-fascists with political rightists of all colours.\nThe social crisis is enormous and the economic crisis affects the poorest people most of all, because a good part of the Brazilian bourgeoisie has cashed in on its profits.\nSo the election of Lula, despite all the hesitations during this campaign and the first steps of the transition, despite the worrying range of political alliances, despite the risk of a new and even more serious popular disengagement from any form of political organization, this election therefore gives a real breath of fresh air. This is despite the acceptance and ongoing naturalization of the measures taken after the 2016 media-parliamentary-legal coup. The Bolsonaro government has been so terrible, has stirred up so many brutal forces, so many setbacks that even a very limited new government at least opens up avenues for social and political struggles, against the censures already underway by religious sects and other arch-conservatives. It signifies relief, but remains in the shadow of growing concerns.\nOther aspects deserve attention.\n1. The Armed Forces-FFAA, the police, the militias\nThe Bolsonaro family is called the “familícia” because of its close proximity to the militias of Rio de Janeiro. A rather complex phenomenon to describe in a few words, these are armed gangs, with a long history that spans the 20th century and which acted with the agreement of the military during the 1964-1988 dictatorship. Increasingly close links between these armed gangs, the police and the FFAA have been forged around the sale of drugs (which they pretend to fight), property speculation and the sale of illegal services, taking over public services (transport) or private services (sale of gas, internet access, among other activities).\nThe confrontations result in a permanent struggle for territory, contribute to strengthening the links between militiamen and police officers, and ensure a very lucrative economic activity. There is no absence of the state, but rather a particular form of its presence in popular territories. These militias control the popular territories with a rare ferocity, and can eliminate (kill) economic or other opponents. The Bolsonaro government has strengthened the militias throughout the country, especially by authorizing the sale of arms and encouraging the CACs - collectors, marksmen and hunters - which total around 700,000 people with a heavy arsenal. Among these CACs are several medium-sized landowners, as well as certain segments of the middle classes. They outnumber the armed forces, which number 360,000, and the military police, which number 406,000. [4]\nYet this group is predominantly Bolsonarist. Why have they not carried out the coup d’état that they kept promising? Why didn’t the FFAA come out of their barracks against Lula, despite the insistence of the Bolsonarists? The answer is rather international - the instant recognition of Lula’s election, in the first place. Secondly, General Mourão, Bolsonaro’s vice-president, said last November that a military coup would risk international sanctions; a fear that seems to respond to signals from the US. [5]\nSo, for now, there will be no military coup. But these autocratic and fascist forces remain intact and everything leads us to believe that the future Minister of Defence will not apply punishments decided against these putchists. [6]\n2. The bourgeoisies\nThe Brazilian bourgeoisies are fundamentally run through by the interests of the foreign bourgeoisies, especially those of the US. They are not fragile bourgeoisies, neither economically nor politically. While in 2020 (the last year of official statistics) the total stock of foreign investments in Brazil reached US$765.4 billion, Brazilian investments abroad reached US$448.0 billion. [7] Politically, with the agreement and participation of large foreign companies, these bourgeoisies have carried out two central political actions over the last thirty years.\nFirst, to finance almost the entire spectrum of political parties at election time. This has allowed them to blur the divide and control the evolution of partisan policy proposals.\nSecond, and this is little studied, they have built up a huge network of non-profit entities, parallel to the formal trade union network of employers. This parallel network performs multiple tasks - bringing together and politically organising the different economic sectors; establishing multi-sectoral associative forums, to present “technical policies” for the whole economy; ensuring that Think Tanks have a huge influence in the whole of higher education; and finally, weaving a mesh of entities geared towards the popular sectors. This last network presents itself as “political, but not partisan” and through it these bourgeoisies act to destroy universal policies at the same time as they propose a “new” policy of “poverty reduction”, based on entrepreneurship, meritocracy, etc. With this network, they control the news of almost all public education with a “movement” called “All for Education”; they try to control public health (“All for Health”). This has been done with the agreement of PT governments. They present themselves as “democratic” but they participate in fascist groupings, according to their interests.\nThere are of course divisions in these bourgeoisies, and limits. The 2016 coup seems to have been supported mainly by the less economically concentrated layers of these bourgeois classes. The results, however, favoured all but a small handful of the larger ones, hit by the Lava-Jato operation, with the support of the US (and other foreign governments), which curbed the appetite for more autonomous (imperialist) Brazilian investment abroad. It seems that these tensions between these various sectors of the bourgeoisie continue, and the Bolsonaro government has both favoured the mega-property of agribusiness, but also the intermediate sectors, openly allowing them to break the law, invading indigenous lands, turning a blind eye to mining and Amazonian timber extraction, activities carried out by the more politically fascistic, medium-sized sectors. So much so that the big agri-mining and forestry companies, which accepted everything for a while, have cooled down a bit with Bolsonaro due to international denunciations.\nAnother important division runs through these bourgeoisies - formed in close alliance with the US, their main client being China.\n3. The popular strata\nTheir situation is even more difficult. Most of the trade unions are very weakened and do nothing to reverse the situation, at least for the time being. In a meeting with several trade union centres on 1 December 2022, Lula said, without causing a real outcry, that he would focus on “attracting foreign investment, especially direct investment, so that we can achieve a new regulation of the world of work, without wanting to return to the past.” [8]\nPolitically, the working classes are divided over Lula and Bolsonaro, including in several capitals, such as Rio de Janeiro. Only in the deep Northeast did the vast majority vote for Lula.\nThere has been a small reduction in the unemployment rate, but there are still 10 million people without work; around 39 million people in precarious or disenfranchised activities [9], and these figures are increasing with the growth of the informal economy (‘uberization’ and others). Around 80 million people are in debt [10]; 33 million people are in a situation of famine, around 125 million in various degrees of food insecurity [11], inequalities are growing; there is a sharp decline in public services... Social movements have been persecuted but, despite this, have not dissolved and have gained support from certain middle classes, intellectuals and cultural circles. So there are huge concrete difficulties linked to survival, but there is a diffuse, albeit fairly combative, fermentation among indigenous peoples, feminists, anti-racists and ecosocialists.\nIn short, Bolsonaro was defeated electorally. Everything leads us to believe that the PT is trying to recompose alliances from above, and to make it difficult for workers to organize themselves. For this, the bourgeois “non-profit” entities are already in place, proposing new compromise policies, and in good agreement with the fascists, always present, and in arms. After a small moment of respite, the struggle has only just begun.\nArticle reviewed by Irene Seigle. Translated by International Viewpoint from l’Anticapitaliste.",
  "word_count": 2355,
  "scraped_at": "2026-02-14T13:00:00.294273"
}