{
  "article_id": "21f7b254424e",
  "url": "https://theleader.info/2024/09/21/contract-signed-to-bring-world-cup-of-nations-to-torrevieja-in-2025/",
  "title": "Contract signed to bring World Cup of Nations to Torrevieja in 2025 ! ",
  "date": "20240921T144500Z",
  "domain": "theleader.info",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "More than 35 countries from around the world have already applied to take part in The World Cup for Walking Football, due to be held in Torrevieja, in October 2025.\nThe handing over of the games from the UK where it was held last year, to Spain, was officially carried out at the venue for the event, the Sport’s City, in Torrevieja.\nPaul Carr, Chairman of FIWFA met with the Councillor for Sport, Diana Box, along with event organisers Mark Coleman and Mark Kavanagh to launch the games for 2025.\nThe organisers were also celebrating the announcement of the tournament sponsor Desire properties. Owner of the Costa Blanca business Krisztian says:\n“We are beyond excited to announce that Desire Properties will be the main sponsor of the 2025 Walking Football World Championship in Torrevieja!\n“This amazing event will bring together teams from countries around the world across four different gender and age categories. As the main sponsor, it’s an honour and a huge responsibility to support both the Spanish national team and the organizing committee in creating a competition where fair play and the joy of football at any age are the top priorities”.\nThe bid to host the games in Spain was won by two ex-pat enthusiasts originally from the UK but living on the Costa Blanca who were determined to bring the games to Spain after the inaugural games in the UK last year when England won the over 50’s and 60’s cups with Spain coming fourth overall.\nMark Kavanagh, and Mark Coleman, both aged 58, have been playing and coaching Walking Football and have now won the bid to host the games for more than 60 countries around the world. The pair have coached at semi-professional and professional level with Youth teams and academy professional level in the UK.\nThe World Cup of Nations event is held every two years, the first one being held in the UK at St George’s Park in Burton on Trent last year.\nNext year Team Spain will enter teams in the over 50’s and 60’s and women over 40. The age groups include 50’s, 60’s and 70’s for men and 40’s, 50’s and 60’s for women.\nOrganiser and campaigner Mark Kavanagh says: “This is a dream come true – we cannot believe we are bringing the World Cup of Nations and more than 30 countries to Torrevieja here on the Costa Blanca. We simply love the game and wanted to bring the sport to as many people as possible – this puts us firmly on the map”.\nAs well as coaching Team Spain – which includes both Spanish and English players – Kavanagh and Coleman will be creating a team to organise the event which will bring thousands of people into the area at the end of holiday season, worth many millions of euros to the local economy.\nMany aspects of the tournament are still available for sponsorship – anyone interested should contact Mark at mkavanagh@live.co.uk\nPhoto: Mark Kavanagh, Diana Box, Mark Coleman, Robbie Burns, Paul Carr",
  "word_count": 506,
  "scraped_at": "2026-02-14T12:33:13.434474"
}