{
  "article_id": "2241b21d9c26",
  "url": "https://www.dungogchronicle.com.au/story/8922924/late-drama-in-newcastle-jets-controversial-defeat-to-melbourne-victory/?cs=410",
  "title": "Late drama in Newcastle Jet controversial defeat to Melbourne Victory | Dungog Chronicle",
  "date": "20250321T130000Z",
  "domain": "dungogchronicle.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Newcastle coach Ryan Campbell reckons the use of video assistant referee (VAR) in A-League Women could have changed the result in a controversial 4-3 loss to Victory in Melbourne on Friday night.\nSubscribe now for unlimited access.\nor signup to continue reading\nHe acknowledged its implementation, however, was restricted by not all A-League Women (ALW) venues having the infrastructure to support the technology that is used in the men's game.\nThe Jets clawed their way back from a 3-0 deficit to be level at 3-3 in the 92nd minute at Home of the Matildas in Bundoora on Friday night, only to concede a controversial last-gasp goal.\nThe goal came off a corner six minutes into stoppage time, after five minutes of additional play had been signalled.\nIt was scored by Victory defender Kayla Morrison while Jets player Sophie Hoban lay prone on the ground in the goalmouth. Replays showed Morrison pushing Hoban out of the way as the corner kick was taken.\nThere was also some suggestion post-match that Alana Jancevski's left-footed corner kick, taken from the left, had swung out over the byline before curling back in.\n\"It would be lovely to have it,\" Campbell said of VAR.\n\"Obviously, there are the logistics of having it at different venues, but a place like that definitely you should have it.\n\"It's one of those things where if the ground is equipped and capable of it, you should definitely have it.\"\nThere has long been talk of using VAR in A-League Women to bring it in line with the men's competition, but Australian Professional Leagues (APL) announced in October it would not be introduced this season.\n\"The implications of VAR are significant in terms of venue infrastructure, TV production and technology and are not feasible for the Ninja A-League Women as it stands,\" APL said in October.\n\"The APL regularly reviews all operational elements of the game in line with global standards, and this includes VAR, and this will continue to be a topic under discussion in seasons to come.\"\nIt was a topic of discussion post-match on Friday night with the result almost certainly killing off Newcastle's faint finals hopes while keeping Victory in the premiership race with three rounds remaining.\nSecond-placed Victory rose to 41 points and within striking distance of leaders Melbourne City (43) while the Jets slipped to 10th over the weekend and stayed on 20 points, five points adrift of the top six before sixth-placed Brisbane (25) played third-placed Adelaide (36) on Sunday night.\n\"The ball went out off the boot and it was clearly out ... take out that one, and it's a definite foul on Sophie,\" Campbell told the Newcastle Herald post-match.\n\"So the ball went out but the second one is it's a clear foul by Morrison on Sophie in the first part, and then Morrison ends up scoring ... if it was a men's game, then the VAR look at that and straight away you review it and it's not a goal.\n\"It's one of those ones where the logistics of it are difficult, but I think if you're going to have a competition that is supposed to be at the highest level of professional football then those decisions have a huge effect on teams' results and where they finish in the table.\"\nJets captain Cassidy Davis also expressed her frustration when interviewed post-match by Paramount+.\n\"The ball went out, so everyone kind of stopped and were ready to take a goal kick then the ref called it a goal,\" Davis said.\n\"Just talking to refs, they said it went out, so I don't understand why they gave it a goal. We're pretty disappointed ... ball out and a foul.\n\"I can't say much more than we're really frustrated with that last call because our season is on the line.\"\nVictory made a blistering start to lead 3-0 after 22 minutes. Matildas striker Emily Gielnik scored in the first and 11th minutes then Jancevski extended the advantage with a long-range strike.\nBut the Jets fought back to trail 3-2 at half-time. Lauren Allan headed home in the 43rd minute then the ball ricocheted off Hoban's knee and into Victory's net in the 45th minute after the tireless midfielder pressured defender Claudia Bunge.\nHoban then slipped a precision pass through Victory's defence to put substitute Sheridan Gallagher on goal in the 92nd and the dual-code talent slotted past Melbourne keeper Courtney Newbon.\nThe Jets host Western United at No.2 Sportsground on March 30. It will be the side's last game at the inner-city venue this campaign and they will have to train elsewhere for the remainder of the season to make way for rugby union.\nMATCH REPORT: HIGH DRAMA AS JETS CONCEDE CONTROVERSIAL LATE GOAL\nThe Newcastle Jets staged a stunning fightback to come from three goals down and be level at 3-3 in stoppage time only to concede a controversial late goal against second-placed Victory in Melbourne on Friday night.\nThe star-studded Victory made a blistering start to lead 3-0 by the 22nd-minute mark.\nBut the Jets fought back with two late first-half goals before substitute Sheridan Gallagher equalised at 3-3 in the 92nd minute.\nThe game, however, ended in controversy when unmarked Victory defender Kayla Morrison volleyed into the Jets' net off a corner in the 96th minute with Newcastle midfielder Sophie Hoban prone on the ground in front of her.\nThe goal sealed a 4-3 win.\nReplays show Morrison pushing Hoban out of the way as the corner kick was taken. The corner kick found Claudia Bunge out the back of play and the Victory defender headed back into the goalmouth for an unmarked Morrison to volley home.\nJets players appealed for the goal to be disallowed but referee Molly Godsell signalled the goal would stand after consulting the linesperson. There is no VAR (video assistant referee) in A-League Women.\nThere was also some suggestion post-match that Alana Jancevski's left-footed corner kick, taken from the left, had swung out over the byline before curling back in.\nAdding to the drama was the fact the matchwinner came in the sixth minute of stoppage time. Five minutes of stoppage time had been signalled.\n\"The ball went out off the boot and it was clearly out ... take out that one, and it's a definite foul on Sophie,\" Jets coach Ryan Campbell told the Newcastle Herald post-match.\n\"So the ball went out but the second one is it's a clear foul by Morrison on Sophie in the first part, and then Morrison ends up scoring ... if it was a men's game, then the VAR look at that and straight away you review it and it's not a goal.\n\"It's one of those ones where the logistics of it are difficult, but I think if you're going to have a competition that is supposed to be at the highest level of professional football then those decisions have a huge effect on teams' results and where they finish in the table.\"\nJets captain Cassidy Davis also expressed her frustration when interviewed post-match by Paramount+.\n\"The ball went out, so everyone kind of stopped and were ready to take a goal kick then the ref called it a goal,\" Davis said.\n\"Just talking to refs, they said it went out, so I don't understand why they gave it a goal. We're pretty disappointed ... ball out and a foul.\n\"I can't say much more than we're really frustrated with that last call because our season is on the line.\"\nThe loss dealt a potential killer blow to the Jets' faint finals hopes.\nWhile Victory improved to 41 points and within striking range of leaders Melbourne City (43), who have played an extra game, with three rounds remaining, Newcastle stayed ninth on 20 points.\nThey are five points adrift of the top six with the rest of the round to play out over Saturday and Sunday.\nThe Jets went into the round-20 exchange on a three-match winning run.\nBut they quickly found themselves chasing the game.\nMatildas striker Emily Gielnik scored at a tight angle in the first minute then doubled down with a near-post header off a corner 10 minutes later.\nBy the 22nd minute, the Jets trailed 3-0 and it was all one-way traffic.\nJancevski added to Gielnik's brace with a long-range effort that caught out Jets goalkeeper Danielle Krzyzaniak. The ball skipped in front of the Canadian and then through her hands and into the net.\nBut, just like they had done in Brisbane five days earlier to beat the fifth-placed Roar 3-2, the Jets fought back.\nLauren Allan made the score 3-1 when she headed home from close range in the 43rd minute after Davis delivered a long ball into the goalmouth.\nHoban found the back of the net two minutes later in the most unlikely of circumstances.\nThe tireless midfielder blocked Bunge's ball out of defence with her knee and it ricocheted in at the near post from the edge of the 18-yard box.\nHoban, who has been in stand-out form all season, then made a lethal run up middle of the park in the 92nd minute and threaded a precision pass through two defenders to find Gallagher on goal with only shot-stopper Courtney Newbon to beat.\nWith plenty of composure, Gallagher slotted past Newbon and into the bottom left corner to make it 3-3.\n\"The fact that we are disappointed with the result and we are disappointed with the way it ended is probably testament to the girls and how they dug in and actually kept themselves in the game,\" Campbell said.\nCampbell stuck with the same starting side which came from behind to beat Brisbane in round 19.\nGallagher returned from serving a one-match suspension via the bench.\nThe Jets are back at home in round 21, when they host fourth-placed Western United (29) at No.2 Sportsground on March 30.\nMeanwhile, Jets duo Emma Dundas and India Breier have been named in a 25-player Young Matildas squad for a training camp in Sydney between March 31 and April 8.\nIn NPL Women Northern NSW on Friday night, defending champions Charlestown beat Adamstown 3-0 at Lake Macquarie Regional Football Facility and, in NPL Men, Edgeworth were 4-0 winners over Rosebud at Adamstown Oval.",
  "word_count": 1713,
  "scraped_at": "2026-02-14T12:49:19.385528"
}