{
  "article_id": "225086b1179c",
  "url": "https://www.asiaone.com/lifestyle/best-things-do-week-feb-20-26",
  "title": "Best things to do this week : Feb 20 to 26",
  "date": "20230220T063000Z",
  "domain": "asiaone.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Stuck in a boring old routine of work, eat, sleep and repeat?\nBreak through the cycle with exciting events and workshops this week. From female-led music festivals, to soothing sound baths and poetry slams — the world is your oyster!\nHere's whats going on in Singapore this week.\nWomen Take Centre-Stage at The Alex Blake Charlie Sessions\nWith International Women's Day just around the corner, what better way to celebrate than with a showcase of some of the best voices of modern-day indie pop, rock, folk, showcase and techno music?\nAfter its 2019 debut, 24Owls presents The Alex Blake Charlie Sessions back again this year with a line-up featuring the melodious Vietnamese-American artist thuy, break-out star Lyn Lapid, American indie-rock darling Football Mommy, and more.\nYou can also expect film streamings, book readings by female authors, art exhibits, food and shopping opportunities — what's not to like?\nThe Alex Blake Charlie Sessions run Feb 21 to 25, 2023, at Pasir Panjang Power Station A, 27 Pasir Panjang Road, Singapore 117537. For tickets and more details click here.\nCatch Tim Reaper on First-Ever Asia Tour\nRavers! Get ready to jump to the beat, as Revision music presents a night of contemporary Jungle music featuring Tim Reaper from London.\nSupported by Carhartt WI, the producer-artist is making his way to Singapore as the final stop after touring Osaka, Tokyo and Seoul.\nExpect nothing short of big basslines, rolling breakbeats and the euphoric, elevated sounds of Jungle. Tim Reaper is known for his famed DJ sets at Boiler Room Festival London 2021, Bass Coast Festival Canada, and Pete Tong's BBC Radio 1 Essential Mix.\nHe has also launched his own Future Retro label, and ventured beyond the Jungle music realm to offer his audience diverse yet focused range of sound, inspiration and influence.\nRevision presents Tim Reaper (Future Retro London, UK) runs on Feb 25, 2023, at ikigai izakaya the riverwalk, 20 Upper Circular Road, #B1, #01/06 The Riverwalk, 058416. For tickets, click here.\nLove, Death & Robots Poetry Slam\nAs if being human was not hard enough, Word Forward is taking a deep-dive into what it means to a be a machine in Love, Death & Robots Poetry Slam. We look into the concept of love and emotions with these uber-intelligent robotics that surrounds us.\nFor a sneak preview, here's some of the questions you will find yourself pondering: How can you tell if your charismatic tinder match is real or ChatGPT?; Could a machine love you better than any human ever could?; As androids learn to take over our mundane everyday tasks, are they secretly waiting for the day they shall reign?\nThink away the night along with your human, humanoids and artificial intelligence friends at this slam, and open mic event.\nLove, Death & Robots Poetry Slam runs on Feb 23, 2023, at Blu Jaz Cafe, 11 Bali Ln, Singapore 189848. For tickets, click here.\nSoak In The Peranakan Heritage at Revamped Museum\nAfter nearly four years of renovation, the Peranakan Museum has reopened its doors again to the public in 2023.\nThe refreshed space now gives each of the museum's permanent galleries its own distinctive look and feel, and spotlights a particular aspect of Peranakan culture through universal themes of 'Origins', 'Home' and 'Style'.\nExplore the multi-faceted Peranakan identity of Arab Peranakans, Chinese Peranakans, Chitty Melakans, Eurasian Peranakans and Jawi Peranakans through stories, interviews and over 800 objects on display.\nThe Peranakan Museum will also feature a dedicated retail space as part of efforts to support craftsmanship and design from Singapore and the region.\nThe Peranakan Museum is located at 39 Armenian St, Singapore 179941. For more details, click here.\nA Soothing Sound Bath To Recharge\nAfter a week of endless work and fun, recharge for the week ahead with a soothing sound bath.\nIn this Ministry of Yoga Wellness workshop, unwind in a hammock and let the sound and vibrations tuck you in for a relaxing, cleansing and rejuvenating session.\nLend a listening ear and meditate to the sound of the Himalayan Singing Bowls, and other accompanying healing instruments such as Chimes and Drums etc that slow down brain waves to a deeply restorative state activating the body's system of self-healing.\nReady to float and heal? Let's focus on your well-being this week.\nFloating Sound Bath in Hammock runs on Feb 26, 2023, at Ministry of Yoga Wellness, 34 South Bridge Rd, #02-01, Singapore 058668. For tickets, click here.\nALSO READ: Peranakan Museum reopens with 9 galleries chock-full of culture and memories\nThis article was first published in City Nomads.",
  "word_count": 762,
  "scraped_at": "2026-02-14T13:34:02.434519"
}