{
  "article_id": "225af32af592",
  "url": "https://www.printmag.com/podcasts/2024/design-matters-sarah-lewis/",
  "title": "Design Matters : Sarah Lewis – PRINT Magazine",
  "date": "20241209T174500Z",
  "domain": "printmag.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sarah Lewis is a celebrated art and cultural historian and professor at Harvard University, focusing on the intersection of visual representation, racial justice, and democracy in the United States. She has published multiple bestsellers and joins to discuss her new book, The Unseen Truth.\nDebbie Millman:\nSome people think that race is a fiction, yet it is a fiction that our society has kept lethally alive for a long time now. How? Well, it is all about the details. To make a fictional world seem real, you have to fill it in with images and sensory information. You also have to leave most of the real world out. But if you succeed, the real world will look a little different for your readers.\nIn her new book, The Unseen Truth: When Race Changed Sight in America, Sarah Lewis traces the visual history of race in America. She explains how art, photographs, movies, and pop culture turned the fictional idea of race into a destructive cultural fact. It’s a scholarly tour de force and a literal eye-opener.\nSarah Lewis is a celebrated art and cultural historian and a professor at Harvard University. She’s also the founder of Vision and Justice, a civic initiative to reveal the important role of visual culture in shaping how we think. Sarah Lewis, welcome to Design Matters.\nSarah Lewis:\nThank you so much for having me. It’s really an honor to speak with you.\nDebbie Millman:\nSarah, I understand when you were in high school, you were a 400-meter sprinter.\nSarah Lewis:\nHow did you find this out? Yes, I was. I loved running. That was my race, hard, hard race.\nDebbie Millman:\nAnd so did you have hopes to be an athlete of some sort?\nSarah Lewis:\nI did. I grew up in that era when Flo-Jo was running and made us understand that dreams were realized on the track, and those dreams I thought might be mine too. I thought I might run professionally, and genetically I was fast. But I didn’t love the training, I didn’t love the regimen. So in the end, I still run. I don’t run competitively, but I keep threatening I’ll do more marathons and things like that to keep it going.\nDebbie Millman:\nYou were born and raised in New York City and you were named after your grandfather, Shadrach Emmanuel Lee, with whom you share the initials S-E-L. In 1926 when he was in the 11th grade, he was expelled from a New York City public school for asking why his history textbooks only showed images of white Americans. Can you talk about what happened next?\nSarah Lewis:\nMy grandfather went through the experience that you described so beautifully, and I knew nothing about it until he died. When I was in college getting ready to go to his funeral, I asked my mother why he didn’t have a high school diploma. He was so sharp and understood so much. I didn’t understand. I was in college at Harvard at the time, and she told me this story.\nShe told me that what came next is, and that’s really what transformed my own understanding about the power of the arts, was it was startling to me. She told me that he dared to ask his teacher why he was perceiving that answer that African-Americans, in particular, had done nothing to merit inclusion in those textbooks. And he was asking about the whole world. He wanted to know where Asian Americans were, Latin Americans were, Indigenous folks were.\nHe didn’t accept her answer, and he was expelled from public school from high school for his so-called impertinence at refusing to do so. He became an artist, he became a musician. And in those paintings, drawings, he created the very genre scenes he knew he should have been able to find in those textbooks. He was consistent and insistent on ensuring that the whole world was present in those images. I grew up at his knee wanting to draw, learning to paint from him as stunned by this visual display that I described.\nAnd so when I learned about what he did next, there really that day at his funeral, I realized, well, of course that in bearing his initials, S-E-L, my name is so much less cool than my grandfather’s though, Shadrach Emmanuel Lee. I was in lineage and I realized in that moment I could be in lineage with a set of questions that I now realize and occupy the mission of my life. What is the role of art for justice in American society? And that’s really what he was asking his teacher. And the answer is one that he lived out.\nAt that time in college, I think many of us studying the arts were not told much about the connection between culture, art and racial politics. So I began to teach myself and that work results in the courses I teach at Harvard and many of the publications that have come out since.\nDebbie Millman:\nAs you were growing up in addition to sprinting, you also took salsa lessons and inspired by your grandfather. You also started painting. What kinds of things were you painting at that time?\nSarah Lewis:\nI was painting the way that my grandfather did. I was in a class, I went to Brearley all-girls school in New York growing up. The program, the curriculum there really focused us on still lives and figurative painting. So I was doing what was asked of me as I learned to paint, but I was without knowing it making sure the whole world was present too. My mother showed me recently a very early painting I made when we were asked to paint pilgrims and it was maybe an eight or nine. My pilgrim was Black. My pilgrim was Black, but these same kind of black buckled shoes.\nAnd I love that no one corrected me, that yuck age. No one told me about this history, and in so doing, they were letting me create a visual image that inserted my own identity as the center. And of course, I now deeply understand the tensions in the fabric of this country between slavery and freedom and teach on this of course at Harvard. But at the time, the paintings I made telegraphed that I understood that we all count in American society.\nSo that’s what I was up to. I thought I might, after I abandoned my running ambitions, be an artist. And even in my first year, not really after that, but first year at Harvard, I thought I would be a painter still, but love that I’m able now to think about the significance of the arts in a broader way than I probably could have if I was an artist full time.\nDebbie Millman:\nWhen you applied to Harvard, you wrote your application essay on failure. Why that topic?\nSarah Lewis:\nCan I just say I need to salute the extraordinary research you do with all of your guests, and I’m feeling the benefit of it here myself. Oh my goodness, you know so much about the journey. Thank you.\nDebbie Millman:\nThank you.\nSarah Lewis:\nI did. I wrote about failure from my application essay to Harvard, and it was, I thought without even asking anyone such an ill-advised idea, I didn’t tell anyone about it. I made this decision and I remember even asking my parents to leave the house one day over the weekend so I could write the piece in piece, and then it was a Sunday the next day and bring it to school and submit it.\nIt was about failure broadly, but really more about the gift of failure that comes and that we all know happens in the creative arts. I was interested in the improbable but irreplaceable foundations of these experiences we wish we didn’t have for the transformation and potentially the triumphs that could come.\nI’d had this experience that was unique at the time, and I wrote about it, that experience. It was the NAACP when I was growing up had an Olympiads. It was this Olympic competition, multiple fields, so you could enter it in painting or the sciences, and every state had a competition and then there was a national competition and it would take place in an arena the size of a football field. The awards were given out to an audience that large. It was extraordinary.\nAnd I had won in the painting category in one year and as a ninth grader and then won at the national level. The prize was a computer and some money, and so as a kid it had a huge impact on me and I didn’t think anything of my work on that level until that award. I tried again two years later and I don’t think I even placed enough to go to the national level, and it felt like a massive failure because of how public it was for my peers.\nIt began my own just pursuit, which led to other work, other publications about the gift of failure because I think especially when you’re going to schools that really condition you to believe in your own success, failure goes against your very understanding of who you are and can rock you to your core, especially as a young person. So I wanted to write a piece that was a vulnerable one for the application to speak to a kind of resilience that I thought I’d cultivated through the process. And I’m glad it worked.\nDebbie Millman:\nHow did you cultivate, but how did you… I mean, that’s pretty young to cultivate. I’m still working on trying to understand my own rejections and failures in a more sort of productive, mature way. How were you able to do that at such a young age?\nSarah Lewis:\nIt’s a great question. I’m not sure that I can process it with you. I don’t know that I’ve asked myself that question internally. But at that age, I was 17, 18 young Black woman growing up in New York City and Manhattan at that, I think I had learned even then to take the gift of being underestimated seriously. And it’s connected to the idea of failure, right? Because when you’re underestimated, you are seen to be a failure in effect in the eyes of whomever is judging you as compared to who you actually are and who you could be, and you’re aware of that gap in their perception of you and the fact of who you can become.\nAnd that gap is failure. That gap is a failure of imagination. It’s a failure of judgment. It’s a failure of the history of narratives that have told women who they can be, that told Black women who they can be.\nSo what I was already gleaning from what the world was telling me was that I was going to have to contend with this sort of environment, which failure was around me despite my successes. That experience is one that I drive strength from now still because I think the odds of me just walking a street and someone assuming that I do what I do if they look at me are pretty low still, right?\nDebbie Millman:\nYeah. I hate to say yes, but yes.\nSarah Lewis:\nEven though I’m a deep optimist.\nDebbie Millman:\nHow do you feel about failure now?\nSarah Lewis:\nI’m inspired by failure and try to push myself to that edge. As you know, I wrote about failure in the Rise nearly 10 years ago now. What that book taught me was just how little we speak about the importance of failure in our lives. And so on a personal level after publishing it, I challenged myself to try to be as brave as the entrepreneurs and athletes and explorers and artists that I profile in the book.\nWhen you work as a writer or an academia or even in the arts, you have to secret away those experiences of failure. So what I try to do is create space for the innovation that happens only through failure. In, say, teaching with the students, I’ll ensure that there’s a gift-of-failure policy in the larger classes so they can experiment with, say, one piece of writing and then produce another piece of writing and drop the lower grade of the two so they can feel free in that sense.\nSo I think you have to build it in programmatically, and I build it into with my own experiments in writing in particular, but lately I’m trying to do it through pursuits. I used to mention salsa dancing. I used to dance a lot after work and things and just, I love taking classes and now I want to do that too. I’m going to try to pick up another form of dance. I know I’m not going to be good it at the start. I think that’s part of the point.\nDebbie Millman:\nYeah, I mean, one of the issues that I contend with on the regular is feeling afraid to start something new because somehow I’ll humiliate myself with the lack of talent or knowledge or just sort of savoir faire, but I’m trying to work on that. I’m working on it.\nInitially you went to Harvard pre-med, which I read and was sort of shocked at. But I understand a Proctor in your freshman dorm room gave you a copy of Richard Powell’s book, Black Art and Culture in the 20th Century. Is that what sort of motivated you to begin to shift your idea about what you wanted to study?\nSarah Lewis:\nYes. Yes. That sweet Proctor, that spirit, she’s actually a dear friend of mine now, April Yvonne Garrett. That was a moment. I really hope and I know that people are, but I really hope people pay attention to those dewdrops on your journey, those moments that feel amplified in your own sense of what happened during the day because it matters. That moment mattered when she gave me that book and I sensed it, and I knew it at the time.\nIt mattered because, well now I think people privilege and honor the role of the artist even more so than they did say 20 years ago. But to go to Harvard and to be a young Black woman going to Harvard with the sacrifices my family made for generations for me to be there, being in the arts was nearly the last advisable path to take.\nSo yes, I was pre-med. I was thinking I would be a doctor that’s safe and I can help people and my spirit is to help and to help heal. So it was necessary for me to have lanterns on an alternate path, and that book was one of those lanterns. It was to say, this can be done, you can be a writer and do this. There’s a whole history that you could be part of. And this book really was the guide to looking at that path, Richard Powell’s book.\nDebbie Millman:\nYou went on to get a master’s in philosophy from Oxford University and a master’s of art at the Courtauld Institute of Art in London. Sarah, why two master’s degrees? Were they concurrent? How did you manage this?\nSarah Lewis:\nYeah, so I received a Marshall Scholarship to go to study abroad for three years after college, and it gives you this opportunity. It’s fantastic to study anywhere in the UK that you can get in. And I decided to do two degrees, one in economic and social history at Oxford, and the other in art history. Hadn’t yet committed to a doctorate and at the time certainly wasn’t going to do it in the UK because I wanted to be around my friends, and so I wanted to come back.\nBut I hadn’t, you can see with the choice the sort of split between economics and social history and the arts. I hadn’t yet found a way to bring together this connection between art and politics. So I felt as if I had to go down two different paths to give myself the arsenal I needed to understand it more fully.\nSo it’s not an unusual thing to do on that fellowship, though. A lot of people end up with those two degrees, but it was also right after 9/11. And I think because I had lost a good friend in the towers and had a lot of friends just pass from accidents of different kinds, I really benefited from having a three-year period to figure myself out to understand how I could best contribute if I could to society.\nDebbie Millman:\nI understand that when you were in London, you saw Olafur Eliasson’s The Weather Project. I just interviewed Olafur about his current exhibits that he’s having in London, in New York, in Korea, about how we see what we see reflected back to us, which I think has some really interesting overlaps with your work. What was it about The Weather Project that inspired you so much?\nSarah Lewis:\nMy God, do you know, I think I’ve just put together for the first time when I became interested in studying vision itself. It was through that exhibition, it was through seeing that show.\nDebbie Millman:\nOh, wow.\nSarah Lewis:\nSo at the time, I was curating at the Tate Modern in London, working with Donna De Salvo who came over to Whitney after that. And throughout the time of that, really was an internship as curatorial assistant, The Weather Project was up. So every day, I would leave my office and experience people having a Truman Show-like experience in effect. They were able to see themselves seeing and see the artifice of the world around them.\nBut what stunned me most and just for those who haven’t seen it, it’s in the Turbine Hall at the Tate. Olafur Eliasson created an extraordinary half dome that feels like a sun, and then with mirrors completes it so that it appears to be a circle. And you look up at it and can see the artifice, but the response to it was people lying on the ground as if they were on a beach somewhere underneath a sun.\nAnd it was stunning to witness because of course it would be winter months and people were doing that and the floor is the floor. And you know what happens on the floor, people were just so… It was such an embodied response and it made me think about how seeing transforms being, how just the act of looking at something can change your, not just behaviors but your even rational sense of what to do in a space.\nSo that probably was the moment I wrote about that piece for one of the masters papers, and I loved, I still remember how much the research excited me. And it gave me a sense of just how much we miss when we don’t address the power of the arts for transformations in society. That was the beginning.\nDebbie Millman:\nIn one of the interviews that I read, you said that that experience got you thinking about James Joyce. And of course my eyes and ears perked up because I’m a big fan, and you described it as a kind of wonder and aesthetic experience that you’re not moved to possess or critique or judge but simply to behold. And I think that’s such a wonderful way of thinking about what art can do, how you just behold it and it sort of takes you over in some way.\nSarah Lewis:\nThat’s it. I mean, even the words as you so well know to describe, the power of an aesthetic experience conveys that we’re in an altered state. We’re stunned or dazzled or we’re knocked out, these are the words we use because there’s a suspension in those judgments. It’s as if you vividly describe it with those words. And that’s why the arts have, I think, the capacity to transform how we see the world. In that altered state, you can revise what you see when you emerge out of it.\nDebbie Millman:\nYeah. So you published The Rise: Creativity, The Gift of Failure, and the Search for Mastery in 2014. And I believe that you actually began working on your book first from that experience writing your essay for your application to Harvard. But then when you were getting your PhD from Yale, you’ve said that writing that book was an audacious act. In what way?\nSarah Lewis:\nYes. Well, for a number of reasons. Practically speaking, when you’re a graduate student, you’re supposed to be, and I was writing a dissertation. You’re not supposed to be writing another book alongside of it with, of all places [inaudible 00:22:12] publisher.\nDebbie Millman:\nUnless you’re Sarah Lewis. Sarah Lewis does that.\nSarah Lewis:\nApparently. Apparently, ignorance is bliss, I guess. So I did it and my commitment to myself was, you can do this so long as the excellence of the academic work doesn’t suffer. So in my mind, it was anytime I would say take a break from academic work and binge something, I would be writing instead. So I wrote The Rise instead of doing those other things.\nAnd it gave me so much nourishment. My God, that process of writing that book is one of the greatest gifts I gave to myself. I had no idea what it would do in the world. I did not write that book thinking that it would go on to be translated into seven languages and take me around the world in terms of the conversations it would prompt. No idea.\nI wrote it really to save my own sense of possibility and sense of becoming. It’s a book that looks at those improbable foundation’s so-called failure, near wins that artists of all kinds have that led to the works we celebrate, whether it’s a Kafka or a Faulkner or a Cézanne or you name it, and how that takes place in the lives of those who are innovators, Nobel Prize-winning scientist and explorers.\nBut it really is a book that is helpful for anyone who wants to understand the process of their own becoming, because no matter what our role is, that is going to be an experience that we have. We are going to fall short of a goal that we have. The question becomes how do you give yourself the propulsion to move forward to become the self you know can be.\nSo I wrote it because I wanted to understand that myself truly, and then realized that the guides and the different themes that were emerging through interviews and research were not just helpful for me, but apparently helpful for others. So doing all of that while being a student, I did seem audacious.\nBut I now look at the lifespan of an artist process and actually look at what’s happening in their twenties and thirties differently as a result. I think there is an increased risk-taking that can come when you simply don’t know what an endeavor entails, and so you’re willing to do it. If I really knew, I don’t think I would’ve, but thank God I did it anyway.\nDebbie Millman:\nThere were some lines that I found in the book and also in my research that really sort of stopped me in my tracks. You said that failure is not something that might be helpful, it actually is the process. And it sort of made me reconsider how much I avoid doing anything that I’ll fail at in that process I’m avoiding actually doing the thing.\nBut then you also said that success is a hollow word, and it is typically a designation that someone else gives you. So it’s an evaluation, which also kind of took me, it seemed like I could understand the steps to get to the unseen truth in terms of what people tell you that something means.\nSarah Lewis:\nI love that you’ve landed on the term evaluation. Evaluation and assessment, that really is the bridge between the projects. The term failure was once used to describe financial ruin, bankruptcy. It was never meant to be applied, I don’t think, to the human spirit, but we do use it, and it’s a term applied to us from others. So it’s an evaluation which never really takes into account someone else’s goals for themselves or who they will become after that moment.\nIn writing The Unseen Truth, I was interested in evaluations of other kinds to do with race and society, and it led to that book writing, The Rise. There’s a chapter in The Rise where I meditate on leaders like Frederick Douglass, thinking about societal failure. Frederick Douglass gives a speech that was really unknown when I began writing The Rise in 2010 about the power of pictures in the middle of the American Civil War, and it stunned his audience.\nHe delivers it in 1861 in Boston, and they’re expecting, you can imagine him to think about anything else but the power of imagery, this new technology. He became the most photographed American man of the 19th century because he understood the function and the force of images to change how we evaluate who counts and who belongs in society.\nAnd so he’s thinking through the impact of this technology for societal failure, to not understand the dignity and humanity of all. That chapter, Beauty, Error, and Justice in The Rise led to the work Vision and Justice, but specifically The Unseen Truth, because I wanted to understand really the failures of evaluation in a more rigorous way, in a more detailed way.\nDebbie Millman:\nWell, what’s so interesting to me about your notions of failure and success, we do so much to avoid failure. Yet when we achieve success, for most people, they’re never content with just that. Then there’s the next success and then the next. And so there’s this really interesting tension between the sort of avoidance of failure and the pull towards more and more success, and it seems like you can’t really have one without the other.\nSarah Lewis:\nYeah, that’s exactly the irony, right? And the paradox. I love, there’s a parable and effect that opens the book, my barn having burned down, I can finally see the moon. There’s this way.\nDebbie Millman:\nYes. I love that quote.\nDebbie Millman:\nIn 2008, President Obama formed an arts policy committee and invited you to serve on it, and he was actually the first presidential candidate ever to form an arts policy committee during his campaign. What was that experience? How did that, one day like, “Hey, Sarah. It’s Barack.” How did that happen?\nSarah Lewis:\nI do remember receiving a call from the co-chair. And around that time, I was up for a position at the National Endowment for the Arts that I accepted and then realized wasn’t exactly right for me as deputy director. And being, I think at that stage in my career, I had a sense that there’s more writing I wanted to do, curating I wanted to do, and not policy work just then. So at the time, it was probably natural for me to be part of it and he was the first. I think if we think back to the impact of Shepard Fairey’s poster, Hope poster, it’s probably really easy to envision why this extraordinary presidential candidate would understand the importance of visual messaging for politics.\nDebbie Millman:\nYes. And language, just the word Hope and what that signifies. Was that the most important thing you learned from President Obama? You mentioned language, and…\nSarah Lewis:\nHis ability while speaking in conversation or in speeches to let silence speak and to allow himself time to consider how an idea will land, I think, was instructive for me as a young Black woman in particular because in those pauses, in that silence, there is a modeling of the mindfulness, I think, that’s still required in our civic life to ensure that especially I think African-Americans are not misunderstood.\nDebbie Millman:\nOr underestimated.\nSarah Lewis:\nOr underestimated, exactly. So that model has stayed with me for some time, I will say. He’s a generational talent. There’s so much we learn from the Obamas: both the model of their partnership, their love, the bravery. But in terms of how we present ourselves as Black people to the public, I think that what I’ve just described he was able to do so effectively is I think the most salient lesson.\nDebbie Millman:\nYou’ve stated that “In the history of the United States, perhaps the biggest question we have is how to tell the story of who we are. And in representational democracy, the answer has always been representation itself. The arts, images, culture, performance have long been a way to work through the blind spots of norms and laws that did not honor the full humanity of all those who in this extraordinary country.” Sarah, is that what first inspired your Vision & Justice project in 2016?\nSarah Lewis:\nYes. Where would we be in our understanding of the United States without culture, without art? Try to explain it to someone and you really can’t. The project began with that idea, but it found its roots and I think its fire through honoring the legacy of which we’re a part. Frederick Douglass really first had this idea in American politics, and to see as I did this speech, he delivers about that in the Library of Congress untouched, as I did as a student, gave me a sense of lineage, made me understand that yes, the realization I had about the function and power of art and culture for justice was important, but I was certainly not the first to have it. And I’m not even speaking about my other colleagues who’ve written about this too.\nFrederick Douglass states at the end of his speech so poignantly, “It might take over 150 years for this idea to be understood about the importance of representation in our democracy.” And it’s a humble line and it really was a call to action as I read it. It really was stating, will you be one of the individuals I had in mind to continue this work?\nAnd so Vision & Justice was born of answering that call and pointing, as I did in the first “Vision & Justice” issue of Aperture in 2016 in the publication, to the many artists who I know Douglass had in mind, whether it’s LaToya Ruby Frazier or Carrie Mae Weems or Awol Erizku, Deborah Willis, so many others, and the writers who give us a sense of the importance of understanding visual literacy for racial literacy like the late Maurice Berger, so many others. And that convening through the framework of Vision & Justice of makers who are transforming narratives of who counts and who belongs is really how Vision & Justice began.\nDebbie Millman:\nThe Vision & Justice project is now part of your core curriculum at Harvard. Your Vision & Justice organization has become an initiative that marshals resources, whether it’s public-facing courses, publications, conferences, to educate the public about the urgent work of art and culture for equity and justice in the United States. And I think from my understanding of your body of work and your practice, all of this has led to the publication of your new book, The Unseen Truth: When Race Changed Sight in America. Would you say that’s correct?\nSarah Lewis:\nAbsolutely.\nDebbie Millman:\nWould you say that’s accurate?\nSarah Lewis:\nThat is accurate.\nDebbie Millman:\nNow, the book took you over 10 years to write, and in the process you had a near-death experience in a gruesome car crash. How did you recover? How did you survive? How did you recover? And how did that impact the journey of this book?\nSarah Lewis:\nYes. That experience was a miracle, and I truly have nothing but gratitude for it. It is not a physical experience I would wish on anyone. It was a pandemic experience. It was pre-vaccine when I was driving on the West Side highway and a car hydroplaned after a long day of rains or hours into my vehicle, lost control of his car. And my own nearly flipped over, hit the concrete divider, and the airbags deployed in the car. And it’s really because of that fact that the airbags deployed when they did, and I’m sure divine intervention, that I’m still here. When the EMTs came, they kept asking at least twice, “Is there anyone else in the vehicle?” because of the speed of the impact that they registered and all the rest. And I didn’t have any… I think I have a minorly fractured rib, which we realized later, but really nothing that you would imagine would’ve taken place given that the car was totaled.\nThe gratitude that I have for that experience is to do with how intensely I experience this just love for the fact of life itself. It’s indescribable because I would walk around with gratitude for life before, but to come so close and know that unless there’s some kind of intervention, you are going to go. And you don’t and you’re all right and it’s painful. You can walk around, you can heal and continue to do this work. I don’t take a second of it for granted, a second of it. I look at a little flower on the street and I just think of just the gift I had to still be here to enjoy these small beauties, these large experiences of other kinds.\nThe Unseen Truth was on my laptop in that car. I was driving up to Harvard to keep writing. And as I healed, I realized that I had to include a lot more fire. The foundation of the book was there and the research was there. But when you crawl out of a burning car that has just crashed to save your own life, and I’ve seen way too many movies. You know what can happen when you open those car doors. I, despite thinking that, did that and are all right, changes your filter for what you think you’re actually afraid of. So this is a book that required me to be fearless, and I hadn’t yet arrived at that point when I began. So thanks to that experience, the book, I think, is what it needed to be. And I’m in the place I need to be be excited about life in all of its forms.\nDebbie Millman:\nThe book tackles one of the greatest lies in American life, in American history, that there is no basis to the radicalized world of American society that puts white Americans on the top. And the true significance of this history has gone unseen until now. This all began for you with an image you discovered in your first week at Yale in the library. Can you describe the image for our listeners?\nSarah Lewis:\nYes. I came across a photograph taken by the most celebrated photographer of the era, Matthew Brady, of a woman who was standing full-frontal to the camera looking quite powerful in a dress, the sash. Her hair is teased to look as if it’s in an afro. She herself was alabaster white in terms of her complexion. And I learned that she was a performer known as a Circassian beauty performer, a so-called exemplar of white racial purity put on stage by PT Barnum in the 1860s. And she would go on to become his highest-grossing performer at the time. I could find so little scholarship on what the real implications of that performance was for the American public that I decided I had to write. So that was the photograph I landed on. And there were others I did find that same day that showed the development of the performance into one that really lampooned the idea of race itself, women who looked like Angela Davis being put on stages as exemplars of white racial purity, that kind of thing. That’s what began.\nDebbie Millman:\nYou begin The Unseen Truth by detailing the story of the Caucasus during the Civil War era in America. So, for our listeners that might not know, what was that, and who were the Circassian people?\nSarah Lewis:\nWe use the term Caucasian and we think we know what it means.\nDebbie Millman:\nWrong.\nSarah Lewis:\nWrong. And that’s what American society understood in the 19th century. So we think we’re referring to a group of people that we consider to be white. Why do we use the term Caucasian? Well, it came about the work of a naturalist who designated the Caucus region in the Black Sea area as the so-called homeland of the white race for reasons that seem ridiculous to us today because there weren’t white people there. There were no white people there. Exactly. So how did that come about?\nWell, this is how racial lore gets hardened into fact. The lore was to do with the beauty of the women, which became an indication of racial superiority. It was the symmetry of a skull is another indication of racial superiority. The lore of the skin and the complexions of the women there, which proved to be false, and biblical lore in the Bible and Genesis, Noah’s Ark, it’s claimed it comes to rest in the region. This was the so-called data that was used to define that region and inaugurate it as the homeland of whiteness, and the terms stuck for centuries. It was debunked, though still used, during the American Civil War. And this is what’s been forgotten in history, and it’s critical that we recall it now.\nSo at that same time, there was something happening called the Caucasian War. And not a metaphor, an actual Caucasian war. And it’s taking place because Russians and the Ottoman Empire are battling for access to the Black Sea and are creating incursions on the Caucus region itself. It results in what many now consider to be a genocide of the peoples in the Caucus region. But the reporting that comes out in the newspapers at the time debunks all of the different lies that had hardened into fact about the type of people that were actually there. So it became clear that there was no such thing as racial whiteness in the region. And you can see what could have happened next but didn’t. When you see a very lie at the basis of the whole regime of racial hierarchy, you realize that you must dismantle it. But we didn’t.\nDebbie Millman:\nSo, an 18th-century German physiologist coins the term Caucasian as a synonym for white in color and claims that the Circassian people were the purest Caucasians of all. PT Barnum, who I think was reincarnated to Donald Trump, then brings these women we think, maybe, who knows if they were really Circassian, in 1864 to his museum on Broadway as the purest example of the white race. And this is the origin story of Caucasians in America.\nSarah Lewis:\nYes. And he puts them on stage as a visual exam and a prompt and a prodding to really ask the American public if they’re willing to hold onto this term, because the performers he’s putting on stage are meant to represent white racial purity but look nothing like that idea. We forget how central the world of performance and the entertainment complex was for dealing with racial politics. So Barnum’s American museum, which we think of as all these humbugs and fakes and curiosities, he was provoking the American public. He was creating a space to work out how these fictions had become fact. So that’s exactly what happened in 1865.\nSo that, seeing that image, made me think about what has been unseen in American life. I don’t know that I would’ve written the book though if not for stumbling across in the footnote of someone else’s book, Charles King. The fact that Woodrow Wilson himself was fixated and interested in this idea, and we can talk about that too. But at the end of World War I, he effectively creates a PT Barnum spectacle. He asks in 1919 from his chief of staff of the Army stationed and Azerbaijan if he can have a report about the look of the women from the Caucus region. And in the archive you see it, they produce a report. They produce a 70-person party of so-called Circassian women that they admit we’re not really Circassians, some were Georgian, et cetera, and they say no one can tell the difference anyway. It doesn’t matter.\nBut why? Why would he ask for this in the middle of the codification of a racial regime that seems to be absolute in American life. This is a period where the Klan is active. We have white racial supremacy dominating the land in terms of the history of racial terror. Why ask for a report? Well, it indicates the nervousness at the heart of the racial project about whether there’s really any factual basis for racial domination at all, and there is no basis for this.\nDebbie Millman:\nSo essentially he got this information but ignored it.\nSarah Lewis:\nAccident of history. He asked for the information, he suffered a stroke so he never could receive it. But it didn’t really matter because he threw his administration through the federalization of segregation and through his understanding of the power of visual culture cohered a regime to instantiate racial domination with impunity despite the fiction of it all.\nDebbie Millman:\nWoodrow Wilson authorized the widespread imposition inside the federal bureaucracy. He opposed women’s suffrage. He was very much an orchestrator of segregation at that time. Yet I discovered that and I learned from your book, scholars have generally ranked Wilson in the upper tier of US presidents.\nSarah Lewis:\nThat’s right.\nDebbie Millman:\nIt’s another perpetuated misrepresentation of reality.\nSarah Lewis:\nExactly. And flies in the face of what he actually did, which was not to represent the type of racism that existed in the period but, in fact, to go steps further. Another way in which we distort our own history.\nDebbie Millman:\nSo your discoveries show that there was really a widespread confirmation bias to secure very intentionally this vision of white, physical, moral, intellectual, and spiritual superiority that were completely based on lies.\nSarah Lewis:\nYes. And to do one thing more, which is to instantiate that unspeakable idea that there is a basis for legitimating racial hierarchy without using outright decree. He inaugurates the idea that we’re working through today, that we can use tactics that are aesthetic, that are creative, that are about public and signaling through monuments to state what will never be said publicly.\nSo what I most was excited about in the book was being able to salute the Black clerks who work for Woodrow Wilson who see that he’s using visual tactics to cohere this racial regime. One of them is Freeman Henry Morris Murray, who’s an activist, a writer, and sees what Wilson is doing and writes the first book in the United States about the relationship between race, politics, and aesthetics. In 1916, on his own printing press, publishes this book, tries to get it published by others and they reject it. It really details and outlines the origins of the debates we’ve had about monuments today. He saw these Confederate monuments going up on courthouse lawns and understood what it meant and what it allowed politicians not to say because the monument spoke. So Wilson’s work was to marshal the force of this and signaling power of the arts to cohere this regime of racial domination. And that’s what’s so insidious and that’s what is part of the legacy we’re working through right now.\nDebbie Millman:\nI want to read a couple of paragraphs that you write in The Unseen Truth. You state, “The project of modernity requires that we modulate our understanding of how race transformed what we even call vision.” And you quote WJT Mitchell who said that, “Race is a medium and a frame, something we see through.” And you go on to state that race is a frame, a window, a screen or lens rather than something we look at, and you call this condition sight or visual conditioning. And I’m wondering if you can talk a little bit more about how we are conditioned to see the things that we see.\nSarah Lewis:\nOne of the avenues and case studies that might be most vivid is to think about how in fact the court system worked through these lies that became facts to think about how our sight was conditioned. So what happened when the lies the fiction of the Caucus region was laid bare through visual culture? The Supreme Court needed to figure that out because immigration cases were based upon the terms, these fictions themselves. Racial science created the term Caucasian, and you see Supreme Court justices trying to work out whether they could use this term anymore at all.\nAnd what happens in the 1870s is they begin to state instead we’re just going to use, quote, common knowledge about the idea of who’s Caucasian and who’s not. Literally that’s the term, common knowledge. So what that comes to mean is that every day evaluative modes of determining who is who form the basis of Supreme Court cases regarding who is granted entrance into the United States.\nDebbie Millman:\nRight.\nSarah Lewis:\nSo when we describe in this seemingly abstract way, race is a frame, well, it’s a quite literal frame for the portal of entrance even into the United States. Visual tactics we use to determine who enters the category of whiteness that has stakes and consequences for who is demonized, who is exalted, who’s granted citizenship and who is not. Visuality is a deeply political tactic and we’ve been conditioned to think to understand how we utilize it best through this account of racial narratives over time.\nDebbie Millman:\nSo when white people are filling out a form or a census, they really have no idea that the term legitimizes a racial regime.\nSarah Lewis:\nThat’s exactly right. That’s exactly right. And those that fill out that form and happened to be from the Caucus region know it best. I went there to finish the book with Nell Painter, the extraordinary historian, and I heard a number of those stories of them, actual Caucasians coming to United States and being completely confused about why the term for their ethnic group was used as an umbrella for racial whiteness. And there’s the irony. And also when you look at the accounts of the attempts to make sense of the languages that those, the Adegui people in the Caucus region speak, it’s just, it’s comical because there’s the use of the term doesn’t match the understanding of what’s actually happening there. The details about the language are completely misunderstood.\nDebbie Millman:\nThere is another term that I learned while reading The Unseen Truth, and that is an aesthetic encounter. If you can please, for our listeners, share what an aesthetic encounter is because I think anybody living in America has experienced at least one or two.\nSarah Lewis:\nA way to consider it’s how many movements began when a work of art with extraordinary aesthetic force transformed our perceptions of the world entirely, and it’s more times than we could possibly know. I began The Unseen Truth after learning about a few of these aesthetic encounters. One most gripping for me was learning about the life of Charles Black Jr. who listens to Louis Armstrong, understands the genius and the lyricism coming out of his trumpet, his horn. And it’s 1931, it’s deep segregation in Austin, Texas where he’s hearing Louis Armstrong. And because of this aesthetic encounter, he is able to question the rational world around him that has legitimated segregation. He asks himself, “If there is genius coming out of the body of this Black man, can segregation be right?”\nSo much of what we owe the arts is the ability to understand and see what we don’t know we don’t know about ourselves and about each other. And Charles Black Jr. goes on in that moment after really processing what he doesn’t know he doesn’t know to walk towards justice as he describes it. He goes on to become one of the lawyers in the Supreme Court case Brown v. Board of Education, that outlaw segregation in the United States or works to. And he goes on teach constitutional law at Columbia and Yale and he holds this annual Armstrong listening night to honor the aesthetic encounter, to honor the power of the arts for the transformational moments that lead to justice with a capital J in public life.\nThese aesthetic encounters, I think we don’t honor enough because they are so often private, not discussed, unheralded. In The Unseen Truth, I write about these aesthetic encounters as moments which I myself was forced to reckon with, the false construction that legitimates racial hierarchy. In The Metropolitan Museum, I passed one day, actually after that miracle car collision, I was healing and taking my time doing things and walked through an area of The Met. I’ve never gone in fully the arms and armor collection in Wayne.\nDebbie Millman:\nOh yes, this is a good story.\nSarah Lewis:\nAnd there saw arms and armor that were labeled Caucasian armor. And I thought, because I had sustained a concussion, “Okay, I need to read this again.” And I read the label more closely and realized that it referenced armor from the Caucus region, but the term Caucasian was not being used to signal whiteness necessarily. But the label counts on my knowing the difference, counts on my holding and suspension that for the moment, we’re not going to think about racial whiteness. We’re going to look at the actual geography and ignore the fact that there is this contradiction in the two terms.\nAnd there are other encounters. The MFA Boston had a painting called A Circassian from 1870 of the first that enters the museum collection, later called The Caucasian Soldier, and it’s just nested up in this wall and salon hang of other works by American painters who travel abroad. And I stopped in my tracks and thought, “Wait a second, is this meant to be a painting of a quote-unquote white person, or is it meant to be a representative figure from the Caucus region?” And where’s the arena to process this? There’s none. So, writing about these aesthetic encounters surface the way in which visual culture gives us evidence of these moments of fracture, when you see the breakdown of terms that we’ve used just to cohere this regime racially in American life.\nDebbie Millman:\nYou write how seeing is not just a retinal act. It’s never been about observation only. Seeing is about reading the world. And it seems as if these experiences have really solidified how the world is presented to us and then the bias that we have in believing it all. How do we begin to create more representational justice?\nSarah Lewis:\nSo I find the most important way to slow down and ask yourself what you are seeing and why. What’s the strategy behind it?\nI recently went to a building that made the importance of this seemingly simple act very significant, and it was the Washington National Cathedral. I went and I was asked to speak on a panel about the removal of the Confederate stained-glass windows that that cathedral had for decades. And after the killing of the Emanuel IX by Dylann Roof, white supremacist, the dean and canon decided to remove the propaganda that saluted the Confederacy in this building.\nNow, this building is meant to be a place of worship for all, and it’s set on a mountain site in DC that really rivals the height of the Capitol. So you can imagine my surprise when I went into this building and saw something that seemed to contradict the very ethos of the building itself. The canon, Leonard Hamlin, beautiful spirit, he took me through and I wanted to see the site where the newly installed windows would be. These are now installed. Kerry James Marshall created the new stained-glass windows, and Elizabeth Alexander, the poet, offered the text and the tablets below. So we walked towards this site in the nave and I stopped because to the right directly next to these new windows was a tomb, and the tomb is that of Woodrow Wilson himself.\nDebbie Millman:\nOh my God.\nSarah Lewis:\nHe’s the only president who’s buried there. And I was stunned by the juxtaposition, the redemptive, racially redemptive, new windows and his tomb. Now, when I say tomb was right there, I mean ground floor of the nave where parishioners worship is his tomb is to the right. So you could be in your chair and his tomb would just be directly next to you. It felt as if I was looking at an American portrait.\nDebbie Millman:\nYou were, yeah.\nSarah Lewis:\nAnd so you have to pause long enough to ask what you’re seeing and why. The tension though being willing to reside in that tension, in that moment was key for me. We could talk forever about the history of that church and just how many civil rights leaders were part of that work as well. It’s the site where Martin Luther King Jr. delivers his final Sunday sermon and where there was a memorial week later for him with 4,000 attending. But yet, and still we have a marker and a reminder of the extension of Jim Crow rule through Wilson’s tomb and the stained-glass windows that are meant to honor his regime.\nHow could that have gone unmentioned in all the reporting about the new stained-glass windows? I wondered. There was no article mentioned which Wilson’s tomb was there, and I wouldn’t have known myself unless I stopped and took the time to think through how we construct narratives to bolster regimes of who belongs and who counts through the visual landscape.\nWhat we are seeing and why, well, this is a question that we see our politicians taking more seriously. Think of the work of Bryan Stevenson, the leader who is really focused on criminal justice reform, who’s argued successfully before the Supreme Court countless times. He has taken to what he calls narrative work. He has decided to marshal the resources of the Equal Justice Initiative to create a complex of memorials and monuments to honor lives that have not been saluted, that were taken unjustly from racial terror and lynching. This is a lawyer who’s seeing the importance of cultural work, of what we’re seeing, not seeing and asking why. Sherrilyn Ifill, the former NAACP legal defense fund leader, has taken to having conversations with artists from Mark Bradford to Glenn Ligon, to Carrie Mae Weems about the importance of the cultural narratives that they’re putting forward to right this balance.\nSo if we start to get away from the idea that as you know, culture is not a respite from life, design is not just a kind of luxury, but instead salute the indispensable work of visual culture for conditioning us to see each other justly, then I think we’ll be on a path to a more true sense of the levers that have been required for justice in the United States.\nDebbie Millman:\nIn Susan Sontag’s book On Photography, she asked if we’ve become desensitized to images because there are so many around, and it seems like we’re also doing that with language and the general acceptance the public seems to have now more than ever for the racist language we’re experiencing from politicians that at one point would’ve outraged us, and we’re now just like, “Oh, boys will be boys, men will be men, politicians will be politicians.” Are we becoming more and more conditioned to not see and not hear what we don’t want to? What is around in surroundings?\nSarah Lewis:\nYeah. I share your same concern. I see it the same way. One of the questions though I have is whether we are becoming less tolerant of viewpoints that aren’t our own or whether we are letting the switches that shift through just technology itself with the algorithmic changes determine what we see and what we don’t. Meaning I don’t know that it’s will. I don’t know that it’s personal choice. I think it’s programmatic and platform decisions that by and large shifted our viewing tactics.\nYou would think given the coarseness of our politics, the teaching Vision & Justice as I do at Harvard would be a really contentious process that I would have a lot of rancor in the classroom. I’m teaching some of the most difficult topics in American life. That’s not the case for me. Why? Well, I should say it’s been difficult for a lot of us, but when you’re teaching from an object, when you’re teaching from an image, it depersonalizes the history or even the current event you’re dealing with. So it’s no longer a fractious debate about what I think and what you think. It’s about a fact in the room embodied by that object, embodied by that sculpture or that image. And it allows for, I think, the creation of a kind of arena as opposed to a conflict.\nSo if that can be the case just without the power of an Instagram or another platform transforming what’s in front of me, if I can have a conversation like that with 18 to 22-year-olds, with my colleagues, I have conviction still in the power of the image to elicit extraordinary conversations. The question becomes what happens when you are only given to see a certain set of images through devices that are not your own?\nI was on a panel recently at the Boston Book Festival and one question came from an individual who wanted to know what I thought of photographs of conflict, and they were thinking about Gaza and Eddie Glaude, who’s also on the panel, added that there are decisions made to switch on and off the number of images you’re seeing about a political event. So at a certain moment, you remember the glut of images we were seeing about Gaza. I don’t see as many and I have not done a thing to my own algorithm, but we know the same amount of images are being taken. I think that just speaks to the invisible actor, which behind the question that you’re asking there.\nDebbie Millman:\nIn the epilogue to The Unseen Truth, you described the foundations of racial hierarchy as a photograph with no true negative. Where do we go from here to correct this false narrative?\nSarah Lewis:\nThe book presents the evidence, the evidence of the fictions that we have chosen to live with. After seeing them, where we go from here is to ask whether we have the will to no longer willfully, deliberately ignore it and move forward, but to make a new choice to see each other justly finally.\nDebbie Millman:\nSarah, my last question is, it’s about a new course you’re creating at Harvard on Beyonce. Tell us about that.\nSarah Lewis:\nSo there’s a class on Taylor Swift. Why not a class on Beyonce? That’s first one.\nDebbie Millman:\nAbsolutely. I told my wife about it, and we decided that we’re going to ask if we could sit in.\nSarah Lewis:\nCome on. I love it. I love it.\nDebbie Millman:\nWell, no, I understand that it’s really not about her music as much as it is on the visual stylings behind her film and videos and so forth, which is always so extraordinary. And actually, once I saw that you were doing this, I was really surprised that it’s not been talked about more in a scholarly way because it is so extraordinary and investigating where she is inspired to find these images and use them and expand upon them is such an important part of understanding who she is.\nSarah Lewis:\nWell, you just created the summary for the course description that matches on my computer. So there you go. It’s exactly why I’m changing a class. And it is a Trojan horse, right? To be able to think through all the ways that she’s referencing, sources that are focused on Black diaspora, broadly defined performance, visual culture, music. I can’t wait. I can’t wait.\nDebbie Millman:\nSarah Lewis, thank you, thank you, thank you for writing your new book. Thank you for making so much work that matters in so many ways. And thank you for joining me today on Design Matters.\nSarah Lewis:\nAnd thank you for your extraordinary work that’s really nourished me from many years. I’m excited to have this chance to talk to you.\nDebbie Millman:\nThank you.\nSarah Lewis:\nYeah.\nDebbie Millman:\nThank you. Sarah Lewis’s new book is titled The Unseen Truth: When Race Changed Sight in America, and you could read lots more about her at sarahelizabethlewis.com. I’d like to thank you all for listening. And remember, we can talk about making a difference, we could make a difference, or we can do both. I’m Debbie Millman and I look forward to talking with you again soon.\nAnnouncer:\nDesign Matters is produced for the Ted Audio Collective by Curtis Fox Productions. The interviews are usually recorded at the Masters in Branding Program at the School of Visual Arts in New York City, the first and longest-running branding program in the world. The editor-in-chief of Design Matters Media is Emily Weiland.",
  "word_count": 10426,
  "scraped_at": "2026-02-14T12:09:59.267970"
}