{
  "article_id": "22692d91cd4c",
  "url": "https://www.maitlandmercury.com.au/story/8895394/maitland-mustangs-triumph-at-seaside-classic-in-port-macquarie/?cs=172",
  "title": "Maitland Mustangs triumph at Seaside Classic in Port Macquarie | The Maitland Mercury",
  "date": "20250218T224500Z",
  "domain": "maitlandmercury.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Maitland Mustangs have claimed their first trophies for the season, with their reigning NBL1 East champions men and Waratah League women's team winning the Seaside Classic tournament titles at Port Macquarie over the weekend.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe two teams collected a handy $7500 winner's cheque each and great preseason trial games in a tournament which drew plenty of praise from Mustangs men's coach Luke Boyle.\nThe Mustangs men defeated hosts Port Macquarie 74-50 in the final, with Boyle full of praise for the Dolphins side, which plays in the NSW Waratah Senior League.\nThe Mustangs women defeated Lismore Storms 50-22.\nThe tournament drew teams from across the state as well as across the border into Queensland. Other NBL1 East teams included the Newcastle Falcons.\n\"We played three round games and the top two played off for the title,\" Boyle said\n\"There was another Queensland team who had some NBL players and they just beat Port Macquarie in the round game earlier.\n\"They decided they were going to go home early, probably partly because we beat them by 30 in the first game.\n\"We ended up playing Port Macquarie in the grand final and we won by about 24 points. They put up a good fight.\n\"It was a really terrific event and we got a lot from it.\n\"The boys executed well, but we missed a lot around the ring. I think it was just a bit of fatigue of playing four games with seven or eight blokes,\" Boyle said.\nThe Mustangs went without championship players James Hunter, Dan Milburn, Josh Clifford, and Will Mortimer, as well as new import Mandrell Worthy. James Beavis only played two games.\n\"We pulled in a few of the Youth League boys and we had a bit of a super sub with (former Mustang) Will Cranston-Lown coming away with us as well,\" Boyle said\nThe team in Port Macquarie also featured championship players Christian Little. Jay Cole, and Luka Vea, as well the experience Jack Edwards who missed the 2025 finals because of Australian touch football commitments.\n\"They played really well. Defensively they were fairly good actually,\" Boyle said.\n\"It was just around continuity, and some guys getting used to some different positions as well because we had some guys playing out of position, we had some guys in the position they are going to play this year but having to get used to moving around a bit.\n\"With limited numbers we were trying to have to juggle that around all weekend. I think we had Will Cranston play in the 4 (power forward) at one stage.\"",
  "word_count": 442,
  "scraped_at": "2026-02-14T12:49:47.502164"
}