{
  "article_id": "22767fa4fa99",
  "url": "https://www.marketscreener.com/news/olympic-gold-medalist-brandi-chastain-nba-all-star-blake-griffin-world-series-champion-albert-pujo-ce7d50d9dc8cf724",
  "title": "Olympic Gold Medalist Brandi Chastain , NBA All - Star Blake Griffin , World Series Champion Albert Pujols and More Join the 2026 Hilton Grand Vacations Tournament of Champions",
  "date": "20251215T193000Z",
  "domain": "marketscreener.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "LPGA Tour season opener brings together golf, live music series and exclusive hospitality experiences in Orlando\nHilton Grand Vacations Inc. (NYSE:HGV), the premier vacation ownership and experiences company, announces an all-star celebrity and entertainment lineup for the 2026 Hilton Grand Vacations Tournament of Champions. Olympic gold medalist Brandi Chastain, NBA All-Star Blake Griffin, World Series champion Albert Pujols and 2025 reigning champion NHL All-Star Joe Pavelski are some of the celebrities set to be paired with top LPGA players for four days of unforgettable competition and celebration.\nThe HGV Tournament of Champions kicks off the 2026 LPGA Tour season and remains one of the most-watched and most-anticipated events in professional golf. Beyond the world-class competition at Lake Nona Golf & Country Club, HGV will host an exclusive three-night concert series featuring performances by Kelly Clarkson, The Beach Boys and Ella Langley.\n“We’re proud to continue our partnership with the LPGA and host an event that celebrates the pinnacle in women’s golf,” said Mark Wang, CEO of Hilton Grand Vacations. “The HGV Tournament of Champions is more than a competition — it’s a signature experience that reflects our commitment to delivering world-class hospitality and unforgettable moments for our members and guests.”\nThe HGV Tournament of Champions serves as a flagship event under the HGV Ultimate Access program, the company’s exclusive experience platform. With thousands of distinct offerings each year, HGV Ultimate Access reflects the company’s commitment to creating elevated, high-value experiences that connect members and guests through sport, travel, live entertainment and more.\nThe 2026 celebrity field will feature a mix of returning fan favorites and exciting newcomers, including:\n-\n“The Bachelor” TV personality Wells Adams\n-\nPro Football Hall of Famer Marcus Allen\n-\nNBA champion Ray Allen\n-\nActor and producer Robbie Amell\n-\nActor and comedian Brian Baumgartner\n-\nFIFA Women’s World Cup champion and Olympic gold medalist Brandi Chastain\n-\nAward-winning actor Don Cheadle\n-\nWorld Series champion Roger Clemens\n-\nSuper Bowl champion Victor Cruz\n-\nNBC News meteorologist Dylan Dreyer\n-\nOlympic tennis medalist Mardy Fish (past champion)\n-\nSuper Bowl champion Dwight Freeney\n-\n“The Bachelor” TV personality Joey Graziadei\n-\nNBA All-Star Blake Griffin\n-\nPodcaster and content creator Hally Leadbetter\n-\nWorld Series champion Jon Lester\n-\nWorld Series champion Derek Lowe (past champion)\n-\nMLB All-Star Jeff McNeil (past champion)\n-\nSportscaster and former NCAA national champion head coach Urban Meyer\n-\nWorld Series champion Kevin Millar\n-\nFormer NBA player Chandler Parsons\n-\nNHL All-Star Joe Pavelski (defending champion)\n-\nAward-winning actor Michael Peña\n-\nWorld Series champion Albert Pujols\n-\nNHL All-Star Tuukka Rask\n-\nActor and television host Alfonso Ribeiro\n-\nActor Timothy Simons\n-\nPro Football Hall of Famer Emmitt Smith\n-\nNBA champion JR Smith\n-\nWorld Series champion John Smoltz (past champion)\n-\nWorld Golf Hall of Famer Annika Sörenstam\n-\nAMA Motocross champion James \"Bubba\" Stewart\n-\nMajor League Soccer All-Star Taylor Twellman\n-\nPro Football Hall of Famer Brian Urlacher\n-\nActor and singer Jack Wagner\n-\nActor and comedian Larry the Cable Guy\nThe 2026 HGV Tournament of Champions will take place Jan. 29 to Feb. 1, 2026, at the Lake Nona Golf & Country Club in Orlando, Florida, with national coverage on NBC, Golf Channel and Peacock. LPGA Tour champions from the past two seasons will compete for $2.1 million in official prize money, while celebrity participants will play for a separate $500,000 purse in a modified Stableford format.\nTo learn more and inquire about sponsorship opportunities that provide exclusive access to the tournament and concert series, visit www.HGVLPGA.com.\nAbout Hilton Grand Vacations Inc.\nHilton Grand Vacations Inc. (NYSE:HGV) is recognized as a leading global timeshare company and is the exclusive vacation ownership partner of Hilton. With headquarters in Orlando, Florida, Hilton Grand Vacations develops, markets, and operates a system of brand-name, high-quality vacation ownership resorts in select vacation destinations. Hilton Grand Vacations has a reputation for delivering a consistently exceptional standard of service, and unforgettable vacation experiences for guests and more than 720,000 Club Members. Membership with the Company provides best-in-class programs, exclusive services and maximum flexibility for our Members around the world.\nFor more information, visit www.corporate.hgv.com. Follow us on Instagram, Facebook, LinkedIn, X (formerly Twitter), Pinterest and YouTube.\nAbout the LPGA\nThe Ladies Professional Golf Association (LPGA) is the world’s premier women’s professional golf organization. Created in 1950 by 13 pioneering female Founders, the LPGA, whose Members now represent nearly 40 countries, is the longest-standing professional women’s sports organization. Through the LPGA Tour, the Epson Tour, the LPGA Professionals, and a joint venture with the Ladies European Tour, the LPGA provides female professionals the opportunity to pursue their dreams in the game of golf at the highest level. In addition to its professional tours and teaching accreditation programs, the LPGA features a fully integrated Foundation, which provides best-in-class programming for female golfers through its junior golf programming, and its LPGA Amateurs division, which offers its members playing and learning opportunities around the world. The LPGA aims to use its unique platform to inspire, transform and advance opportunities for girls and women, on and off the golf course.\nFollow the LPGA online at www.LPGA.com and download its mobile apps on Apple or Google Play. Join the social conversation on Facebook, X (formerly known as Twitter), Instagram and YouTube.\nAbout the LPGA Tour\nThe LPGA Tour is the world’s leading competitive destination for the best female professional golfers in the world. The Tour hosts more than 32 annual events across 12 countries for over 200 athletes, awarding total prize funds exceeding $129 million and reaching television audiences in more than 220 countries. Follow the LPGA Tour on its U.S. television home, Golf Channel.\nAbout Lake Nona Golf & Country Club\nRecognized as one of the world’s top private golf club communities, Lake Nona Golf & Country Club sits at the heart of Lake Nona, one of the fastest growing and innovative master-planned communities in America that is establishing a new standard of living for its residents with groundbreaking initiatives around technology, mobility, and wellbeing. For nearly 40 years, Lake Nona Golf & Country Club has delivered exceptional Central Florida living, combining natural splendor with a dynamic lifestyle amidst a sanctuary of luxury estate homes. The unique opportunity to live and play at Lake Nona is enhanced by a wealth of amenities, including a Tom Fazio-designed, championship golf course, a fully equipped golf performance center, a 40,000-square-foot Clubhouse, an array of sports and recreational facilities and services, and a trio of waterways. Guided by a continual pursuit of excellence, highlighted by exceptional family experiences and outstanding service, Lake Nona Golf & Country Club will continue to set the benchmark for lifestyle-driven club communities for years to come.\nFor more information, visit: www.lakenona.club.\nAbout Lake Nona\nPlanned and developed by the Tavistock Development Company, Lake Nona is one of the fastest growing and most innovative communities in America. Located in Orlando, Florida, the 17-square-mile community has established a new standard of living for its residents with groundbreaking initiatives around technology, mobility, and wellbeing. Lake Nona is located contiguous to Orlando International Airport in the most visited destination in the U.S. The smart and connected community’s advanced infrastructure and commitment to collaboration has drawn visionary companies and entrepreneurs from across the globe to join its living lab environment accelerating economic growth and opportunity across health and life sciences, education, hospitality, and sports and performance. Lake Nona’s attractive business ecosystem is enhanced by a thriving cultural landscape defined by iconic architecture and engaging public art installations, miles of trails and walkable green spaces, weekly signature events, shopping, dining and entertainment options set amongst Central Florida’s beautiful natural landscape and year-round sunshine.\nFor more information, visit www.lakenona.com.\nhttps://cts.businesswire.com/ct/CT?id=bwnews&sty=20251215730792r1&sid=frzb2&distro=ftp\"/>\nView source version on businesswire.com: https://www.businesswire.com/news/home/20251215730792/en/",
  "word_count": 1299,
  "scraped_at": "2026-02-14T12:50:34.588332"
}