{
  "article_id": "228c2d1173de",
  "url": "https://www.arsenal.com/news/preview-wolves-v-arsenal",
  "title": "Preview : Wolves v Arsenal",
  "date": "20240420T113000Z",
  "domain": "arsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The opportunity for us to bounce back from a tough week and return to the top of the Premier League arrives at Wolves on Saturday night, plus the chance to create a small slice of club history.\nHaving not conceded since Nottingham Forest netted a late consolation in January, we could record a sixth successive clean sheet on the road should we keep Wolves at bay at Molineux for the first time in our league history. That coupled with goals at the other end would be just the tonic for Mikel Arteta who looks to return us to winning ways.\nThat is also something our opponents are desperate to do as they haven’t picked up maximum points in any of their last four encounters. However, Gary O’Neil’s team are a dangerous side on their day, as Manchester City and Tottenham Hotspur will attest to having both departed Wolverhampton pointless this term.\nCup setback sparks downturn\nHaving spent the majority of the campaign in the upper half of the bottom half of the table, a run of seven wins from 11 matches either side of the new year saw Wolves creep into the top 10 and flirt with the possibility of capturing European football.\nHowever the brakes have been put on that charge following their shock FA Cup exit at the quarter-final stage by Coventry City, who ran out 3-2 victors at Molineux. Subsequent defeats to Aston Villa and West Ham United have been sandwiched between draws at Burnley and Nottingham Forest, and as a result they’ve slipped to 11th as the season threatens to peter out.\nThe Old Gold though have four of their last six fixtures at home, and with games against ourselves, Manchester City and Liverpool on the horizon, could still have a major say in the destination of the Premier League trophy.\nWhat the managers say\nArteta: \"The context is clear. If we win we are top of the league. That’s the context, we don’t need anything else to be motivated or to go to that game with our minds clear and our purpose very, very clear.\n\"It’s been a very intense journey and we deserve to be at the top fighting at such a level so you’re going to have to go through that. This job, this industry is constantly testing your resilience and your ego. Things go well and things don’t go well and you have to be able to navigate and go through those moments in a natural way, understanding the context and looking at the positives.\" - read every word from Mikel’s pre-match press conference\nO’Neil: “I am really positive about the situation. It’s a tough situation. If you ask me, the Wolves fans, the playing group, we’d have loved to have a fully-fit squad available to us for the last few games and next few games, and to be chasing down the teams above us, but it hasn’t gone that way.\n\"There’s still loads of positives to take from it, the young lads being around it, and learning things for next season. There’s a lot of stuff we can do and we’re still aiming to beat another team in the top six.”\nTeam news\nMikel Arteta will hope to have a fully fit squad to choose from for this game, all bar Jurrien Timber who continues his comeback from a knee injury.\nWolves have been rocked by injuries to three players this week, with Matheus Cunha, who has been involved in nine goals in his last nine Premier League games, picking up a calf injury against Forest, the same problem that has ruled out Nelson Semedo. Craig Dawson has also undergone surgery on a groin issue.\nO’Neil will hope to have star man Pedro Neto back before the end of the campaign but his hamstring injury means he’ll be missing on Saturday, while Rayan Ait-Nouri has been a key player in recent weeks but he is struggling with a calf issue.\nThe only other concerns are Jean-Ricner Bellegarde who is nursing a knee problem, while youngsters Noha Lemina and Leon Chiwome are also missing.\nTalking tactics\nAdrian Clarke: Wolves have shown tactical versatility this season, regularly switching between a back three and back four, but of late 3-4-2-1 appears to be O’Neil’s favoured formation.\nWithin that framework they are excellent at crowding space inside the engine room. Wolves’ two industrious central midfielders are well supported by the three forwards ahead of them, who are happy to drop back out of possession. It is also not unusual to see one of their spare centre-backs pushing into the midfield too.\nThis tactic helps Wolves turn over the ball inside the middle third before launching quick transitions. They are a side that will explode into life on those counter-attacks, and cause opponents problems. They have had the second-highest number of shots from fast breaks in 2023/24.\nOne of the words I’d use to describe O’Neil’s style of play is aggressive – Mario Lemina and Joao Gomes both rank inside the top 10 for tackles won. They are also very athletic, particularly from turnovers where they encourage players to sprint forward at pace to get inside the box.\nFacts and stats\nAfter completing the league double against us in 2020/21, Wolves have now lost each of their last five against ourselves, failing to score in both home defeats in that run.\nWolves have lost three of their last five Premier League home games, more than they had in their previous 15 at Molineux.\nWe have scored in our last 32 meetings with Wolves in all competitions, our joint-longest scoring streak against an opponent (also a current run of 32 vs West Bromwich Albion).\nWe have kept a clean sheet in each of our last five away league games, our joint-longest ever run (also five between February and April 1997). The last team to record a clean sheet in six consecutive Premier League away games were Liverpool, between December and March in 2014/15.\nWe have conceded just two goals in the first half of our 12 Premier League games so far in 2024. Both of these strikes came in the 45th minute.\nLeandro Trossard has scored four times in 16 substitute appearances in the Premier League this season, as many as he has in his 12 starts. He averages a goal every 218 minutes as a starter this term, compared to one every 86 minutes when coming off the bench.\nBukayo Saka has been involved in eight goals in his last seven away league games, scoring seven and assisting one. His 13 away goal involvements overall this term (8 goals, 5 assists) is the most by an Arsenal player in a single Premier League campaign since Alexis Sanchez’s 20 in 2016/17.\nPablo Sarabia has been directly involved in eight goals in his last 11 home appearances in the Premier League (4 goals, 4 assists).\nMatch officials\nPaul Tierney is the man in the middle at Molineux, which is the fourth time he’s taken charge of us this term. We are unbeaten on the previous three occasions, drawing 2-2 with Fulham before beating Crystal Palace and Newcastle United at Emirates Stadium.\nWolves meanwhile have won one and lost one of the two matches Tierney has overseen in 2023/24, beating Bournemouth but losing to Aston Villa.\nReferee: Paul Tierney\nAssistants: Scott Ledger, Mat Wilkes\nFourth official: Darren Bond\nVAR: John Brooks\nAssistant VAR: Wade Smith\nRecent trips to Molineux\nOur record at Wolves during the Premier League era has been pretty strong, as we have won seven of our nine visits, including our last when a brace from Martin Odegaard saw us clinch a 2-0 win in November 2022 in what was our final game before the World Cup break.\nThe season before saw us claim a 1-0 win thanks to a goal from Gabriel, despite the sending off of Gabriel Martinelli for two quickfire bookable offences.\nWolves’ last success came in 2020/21 when we saw two other men red-carded as David Luiz and Bernd Leno were dismissed during a 2-1 defeat to the hosts, with Ruben Neves and Joao Moutinho overturning Nicolas Pepe’s opener.\nLook back at five of our best wins at Wolves, including Bukayo Saka’s first Premier League goal\nLive coverage\nAn hour before the game, you can tune into Breakdown Live on Arsenal.com and the official app for the best build-up.\nNick Bright and Adrian Clarke will fill you in on everything you need to know about our opponents and how the game might pan out, as well as look at all the various Premier League permutations as the finishing line gets closer.\nAdrian will also do an academy round-up as well as a look ahead to Arsenal Women’s clash against Leicester City at Emirates Stadium, and then at kick-off, they’ll hand over to Dan Roebuck and Jonathon Rogers at Molineux who’ll provide live commentary to keep you right up to date with proceedings.\nYou can also find out which broadcasters are showing the game wherever you are in the world\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 1533,
  "scraped_at": "2026-02-14T13:01:31.854765"
}