{
  "article_id": "2293d59d212e",
  "url": "https://www.chessdom.com/womens-world-chess-cup-2025-quarterfinals-are-set/",
  "title": "Women World Chess Cup 2025 , quarterfinals are set – Chessdom",
  "date": "20250714T214500Z",
  "domain": "chessdom.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FIDE Women World Chess Cup 2025 is taking place July 5 – July 29 in Batumi, Georgia, and is one of the major events of The Chess Calendar. A total of 107 participants (increased from the initially announced 103 participants) will compete for 691 000 eur prize fund.\nThis is the third edition of the FIDE Women’s World Cup. The first one was in Sochi in 2021 and was won by Alexandra Kosteniuk. The second one was in Baku in 2023 and was won by Aleksandra Goryachkina. Now both of them will participate in the FIDE Women’s World Chess Cup 2025 in Batumi together with a strong field of world’s best players.\nFollow daily the live games from the Women’s World Cup\nThe competition has reached its quarterfinal stage with the following pairings: Lei Tingjie-Omonova, Dzagnidze-M.Muzychuk, Humpy Koneru-Kosteniuk, Song-Javakhishvili, Zhu Jiner-Divya, Lagno-Harika, Tan Zhongyi-Osmak and Kamalidenova-Vaishali. This is also a decisive moment where we will see who qualifies for the Candidates Chess 2026. Eight players have played the Candidates before – Lei Tingjie, Dzagnidze, M.Muzychuk, Humpy Koneru, Kosteniuk, Lagno, Tan Zhongyi and Vaishali. Eight players have never entered the Candidates – Omonova, Song, Javakhishvili, Zhu Jiner, Divya, Harika, Osmak, and Kamalidenova. Out of those, Zhu Jiner is already qualified for the Candidates.\nFIDE Women’s World Cup round of 16 day 1 (Written by IM Michael Rahal ; Photos: Anna Shtourman)\nVantika (born in 2002), Kamalidenova and Song Yuxin (both 2005), Omonova (2006) and specially Lu Miaoyi (2010), have honed their skills through practice and dedication, making them more effective and suitable for the intended purpose – rapid and blitz tiebreaks.\nElnaz Kaliakhmet, also born in 2010, has yet to display her own rapid and blitz skills – she unexpectedly took down GM Nino Batsiashvili in the second-round classical games!\nIt’s make or break time!\nThis afternoon I could feel the tension in the room. With only 32 of the original 107 players left in the mix, qualifying to the fourth round of sixteen is already a huge success: a free day, a decent pay-jump and a chance for a shot at the title.\nBut sometimes you have to play it safe. The first game to finish was IM Carissa Yip’s 13-move draw against GM Vaishali Rameshbabu. Playing with White, and visibly surprised by Vaishali’s opening choice, Yip decided to force a quick three-fold repetition in the Symmetrical variation of the English Opening.\nChecking with my database, this particular draw has already been played quite often at the highest level. Unfortunately, the local Netflix crew that came to the venue to record some footage of the American star will have to return tomorrow for the second game of the match!\nIt didn’t take too long for another couple of games to end. GM Anna Muzychuk played solidly in the classical line of the Greco Gambit and forced a draw by perpetual check on move 22 against IM Song Yuxin, while IM’s Polina Shuvalova and Lela Javakhishvili clocked in a 98% accuracy score with no inaccuracies to draw just after the 30-move threshold.\nBut from that point onwards the battle was ferocious and the wins started to roll in.\nIndian IM Vantika Agrawal scored the upset of the day by defeating GM Kateryna Lagno on the White side of the 5.Na4 Grunfeld side-line. Vantika already enjoyed a big positional advantage in the middlegame, but Lagno’s 21…Nxe5? just precipitated a winning sequence that left the player from Delhi with an extra piece.\nIn her postgame interview and game analysis, a very happy Vantika explained her thought process.\nShortly afterwards, with all the games approaching the time control, three games finished with a decisive result.\nIM Divya Deshmukh had already equalised comfortably with Black against IM Teodora Injac, but the position was still in the drawing zone around move thirty. However, with less than three minutes for the last ten moves, Injac started to play inaccurately and Divya was able to pick up a couple of pawns and eventually the full point.\nMeanwhile, GM Bella Khotenashvili was also under three minutes with sixteen moves to go against GM Mariya Muzychuk, in a complicated position.\nThe correct move was 24.b3, protecting the c4 pawn. After the exchange of queen’s, White should be able to hold the position, according to the engine. However, after she played 24.Qc2? Muzychuk captured the c4-pawn with her knight and won an exchange shortly afterwards.\nIn her postgame interview with Charlize van Zyl, Muzychuk said that she thought her opponent had missed 24.Qc2 Nxc4 25.Rd1 Qb6! with the double threat on the e5 rook and also 26…Na3+ winning the queen, because she started to shake her head.\nGM Zhu Jiner also achieved a head start in her match against IM Alexandra Maltsevskaya, with a model game on how to increase the pressure against your opponent’s king in the advance variation of the Caro-Kann.\nThings slowed down a bit after the time control scramble until seed number one GM Lei Tingjie managed to convert the full point in a queen ending against former Women’s World Champion GM Antoaneta Stefanova.\nEnding of the day\nPlaying with Black, Lei Tingjie has an extra passed pawn in a pure queen ending. With a few precise moves, she was able to force the exchange of queens and take home the full point.\n43…Qf1+ 44.Kh4 Qe2! Threatening checkmate on g4 and the pawn on h2 45.Kh3 Qe6+! 46.Kg2 Qd5+ and Stefanova resigned. After the exchange of queen’s White’s king is too far away to stop the a-pawn.\nA few minutes later, GM Nana Dzagnidze finally forced her opponent to resign when there was no hope left in the position. GM Valentina Gunina blundered a tactic on move eighteen but kept fighting until the bitter end.\nMore or less at the same time, IM Yuliia Osmak converted her two extra pawns against IM Lu Miaoyi, notching up a very important win in her hopes to qualify for the next round.\nAmazing endgame studies\nOne of the most amazing positions of the tournament occurred in the game between IM Meri Arabidze and GM Alexandra Kosteniuk. The former 2021 World Cup winner missed an endgame study-like win and had to settle for a draw even though she had an extra rook. Check out the unbelievable move sequence she had to find to win the game!\nIn the rest of the games of the round, GM Harika Dronavalli (vs IM Stavroula Tsolakidou), IM Klaudia Kulon (vs GM Humpy Koneru), IM Irina Bulmaga (vs GM Tan Zhongyi), IM Meruert Kamalidenova (vs WGM Anna Shukhman) and finally WFM Elnaz Kaliakhmet (vs WIM Umida Omonova) were pressing during the whole game and enjoyed good chances to win, but all five of their opponent’s defended tenaciously and achieved a draw.\nFIDE Women’s World Cup round of 16 day 2\nThe second games in the two-game matches of the FIDE Women’s World Cup continued to deliver tension and unpredictability—ranging from solid, careful maneuvering to explosive tactical skirmishes—and today was no exception.\nIn the earlier rounds, players were often seen smiling and chatting casually, but today painted a different picture. With elimination looming for many, the playing hall was pin-drop silent. As players arrived and settled into their games, some closed their eyes in meditation while others stared intensely at the pieces before them.\nAmong those fighting for survival, Kateryna Lagno stood out. Despite losing to Vantika Agrawal yesterday, she arrived early and appeared in high spirits. In this unforgiving format, there’s no time to dwell on past mistakes—something Lagno, with her vast experience, clearly understands. That resilient mindset was on full display not just in her game but across several crucial matchups. Let’s take a look at what happened today:\nEarly qualifiers\nLei Tingjie, Zhu Jiner, and Mariya Muzychuk confirmed their status as top seeds by winning both games and cruising into the Round of 16.\nUmida Omonova, Humpy Koneru, Lela Javakhishvili, Tan Zhongyi, and Meruert Kamalidenova also scored vital second-game victories to secure their spots in the next round.\nMeanwhile, Divya Deshmukh and Yuliia Osmak, both of whom had won their first games, held comfortable draws today to advance.\nDivya shared her thoughts after the match, admitting: “I wasn’t too happy about the pairing with Injac—she’s a strong player and has been doing well recently—but I felt I got lucky yesterday.”\nComebacks\nOnly two players who lost yesterday managed to fight back and force tiebreaks. Valentina Gunina, came very well prepared today dismantling Nana Dzagnidze Caro-Kann Defence after the Georgian GM missed a powerful pawn thrust.\nIn a slightly inferior position, Nana played seemingly logical 21…Rg6??, which failed to 22.e6!\n“As a Caro-Kann player I don’t like playing against c6 myself which is what Nana played, so my coach and I prepared something special with 3.c4,” Valentina shared after the game.\nIt did not too long for Gunina to wrap it up. After 22… Nc5? 23.Nc6! Nana threw in the towel.\nKateryna Lagno essayed Saemisch system against Vantika Agrawal’s Nimzo-Indian and prevailed in a sharp tactical melee leveling the score and sending their match to a tiebreaker.\nRound of 16 on the line\nLagno – Agrawal and Gunina – Dzagnidze will join the pairs Arabidze – Kosteniuk, Song Yuxin – Anna Muzychuk, Stavroula Tsolakidou – Harika Dronavalli, Carissa Yip – Vaishali R (who drew both games) to contest for a place in the round of 16.\nIn her short interview after the game Carissa explained that she took a quick draw yesterday because there’s not much available in the line. She pressed hard today but Vaishali played and defended really well to secure a draw.\nTiebreaks\nThe World Cup tiebreaks are unforgiving. In such high-stakes, compressed formats — especially with time controls like 15+10 and 10+10 — there’s so little room for error or recovery. The story of GM Vaishali versus IM Carissa Yip stands out not just for the result, but for the emotional and psychological arc behind it.\nEven though all the third-round tiebreak matches were interesting in their way, I was paying special attention to the match between India’s GM Vaishali, elite GM Praggnanandhaa’s older sister, and IM Carissa Yip, the America star that has a local camera crew following her around preparing a Netflix special on women’s chess.\nCarissa Yip being followed by a Netflix crew adds another layer. The spotlight can be motivating, but also creates added pressure. Vaishali, on the other hand, might have flown under that radar, and her underdog success makes for a compelling story.\nIn the first two rapid games, Vaishali was completely lost—something she candidly admitted in her post-game interview. But she fought on, defending as best she possibly could, just hoping for the results to turn around. Vaishali’s ability to survive lost positions in the early rapid games shows deep psychological fortitude. In knockout formats, surviving can be just as crucial as winning.\nJust like in football matches, if you keep on hitting the post, don’t be surprised if your opponent scores in the last minute – you have to get the job done. And Vaishali exactly did that.\nIn the first 10/10 game she played superbly. Her quote — “even though I’m not better at all, this is the best position I have had in the whole match” — is both honest and telling. It shows how players gauge hope and energy not just by the objective evaluation of position, but relative to the flow of the match. That moment, perhaps, was the turning point.\nOnce Vaishali won the first 10/10 game, the psychological burden flipped. Yip, who had been pressing before, now had to play catch-up under pressure — a very different psychological space.\nAlthough she was visibly tired, Vaishali picked up her mom immediately after the game and joined us in the media center within five minutes for a short interview. She even took the time to analyze the key game for all of us.\nOne of the other Indian players competing this afternoon had a similar situation. After playing extremely well against GM Kateryna Lagno in the two classical games and the first three rapid games, IM Vantika Agrawal imploded in the final 10/10 game of the day, allowing Lagno to advance, as in the second round against FM Anastasia Avramidou.\nVantika’s level of play was impressive, and the heartbreak of narrowly missing out must have been very difficult to deal with. Facing someone as experienced and strong as GM Kateryna Lagno and pushing her to the limit is no small feat. Taking Lagno to the final Armageddon-style rapid game (“10/10”) shows how tightly contested the match was.\nAs a side-note, playing the Flank Attack against the French Defence is particularly interesting. It’s not often seen at the top level — especially in such high-stakes games — so for Lagno to deploy it not once but twice with White is bold and worthy of study.\nWithout a doubt, IM Song Yuxin was the underdog story of the afternoon. Her victory isn’t just a personal triumph — it’s a reminder of how deep preparation, resilience, and nerves of steel can turn the tables in elite chess. With five Chinese players in the final 16, it’s clear that the country continues to produce world-class talent at an astonishing rate.\nGM Anna Muzychuk surprised her opponent with the 2.c3 Alapin Variation against the Sicilian in the first game of the match. Although she’s been a lifelong 1.e4 player, Muzychuk had rarely ventured into this line, last playing it back in 2023. The unexpected choice appeared to catch Song off guard; she mishandled the opening and quickly landed in a losing position.\nAlready ahead in development, Muzychuk’s 11.Qb3 followed by 12.Bf3 highlighted the weaknesses on Song’s queenside and her lack of piece play. The game was over on move 17.\nNeeding just a draw to clinch qualification, Muzychuk adopted a cautious strategy. For 45 moves, the game remained balanced, with a symmetrical two-rook endgame suggesting a peaceful outcome. However, chess is a merciless game — one imprecise move was all it took for Song to seize the initiative. Doubling rooks on the seventh rank, she broke through Muzychuk’s defenses and levelled the score.\nIn the third game, Song refined her earlier approach to the Alapin and reached a strong position. With accurate and confident play, she gradually outplayed Muzychuk to take the lead.\nThe fourth and final game saw Song pressing with an extra pawn in a slightly better endgame. A draw was enough to win the match, and she played sensibly to neutralize any counterplay, securing the result and the match victory.\nCheck out her post-game interview!\nPlaying for Switzerland, GM Alexandra Kosteniuk defeated IM Meri Arabidze (from Georgia) by 1.5-0.5: the only 2-game tiebreaker.\nIn game one, Kosteniuk got a promising advantage from the opening against the Philidor Defence but eventually the game simplified into an equal rook ending, resulting in a draw. But in game two, Kosteniuk, playing Black, unleashed her knights, causing chaos in the center and setting up a mating net to secure the win.\nIn her postgame interview with Charlize van Zyl, Alexandra expressed mixed feelings — she enjoys the experience, but is aware of the pressure and the risk of being eliminated at any moment.\nThe match between GM’s Nana Dzagnidze and Valentina Gunina was arguably the most dramatic of them all. In the first game, Gunina emerged from the opening with a clear advantage, but a series of inaccuracies allowed Dzagnidze to steer the game toward an apparent draw. Just as both players seemed to have accepted the inevitable, Gunina blundered an exchange and was forced to resign.\nDetermined to even the score, Gunina took a bold approach in the second game, opting for a highly risky opening in a do-or-die effort to win — and this time, her gamble paid off.\nCheck this out! A beautiful tactical sequence that showcases the power of a well-timed sacrifice and precise calculation. White’s king is under pressure, and the position is ripe for a tactical strike. Black’s idea is to use the knight and rook coordination to exploit weaknesses around White’s king.\nGunina played 34…Nxh4!, a stunning knight sacrifice. The goal is to open lines and unleash a tactical motif involving a fork. After 35.Rxg4 Nf3+! The point of the sacrifice! A check that drives the king into a vulnerable position. 36.Kg2 Nxe1+ picking off the rook on e1 with check, and subsequently the queen on d3, ending up with an extra piece and a won position. Nana played 35.Rxe5, but it did not help either.\nUnfortunately, Gunina was unable to maintain her strong play. She blundered a full piece in an equal position in the third game and, more importantly, failed to convert a +4 advantage with extra material in the final game—despite being in a must-win situation.\nThe final match of the day was the very intense and closely fought encounter between GM Harika Dronavalli and IM Stavroula Tsolakidou.\nIn the first game, Stavroula’s missed an opportunity with 30.Qg4 followed by 31.h5 that could have given her a strong attacking position against Harika’s king. It’s always fascinating how one move can change the tide so much.\nShortly afterwards, Harika missed a win after Stavroula’s inaccuracy — that’s the drama of top-level chess, where even great players can overlook critical moves in complex positions.\nGM Shyam Sundar, the Indian national team trainer, was right there to analyze and help. Having a strong coach to provide insights right after the game can frequently be invaluable.\nArriving late to the second game must have been stressful for Tsolakidou, and although Harika gained momentum, it’s impressive both players managed to keep their composure, leading to a draw.\nThe final 10/10 games were very intense—Stavroula’s resilience under pressure was clear, even if the final blunders were costly. Overall, this kind of high-level competition is a tremendous opportunity for growth and experience.\nCharlize caught up with Harika just before she left the venue and got her thoughts.",
  "word_count": 2995,
  "scraped_at": "2026-02-14T13:44:30.076971"
}