{
  "article_id": "22d0fcf61733",
  "url": "https://www.southernhighlandnews.com.au/story/8952320/matilda-caitlin-foord-scores-in-arsenals-stunning-win-over-lyon/?cs=300",
  "title": "Matilda Caitlin Foord scores in Arsenal stunning win over Lyon | Southern Highland News",
  "date": "20250428T050000Z",
  "domain": "southernhighlandnews.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Arsenal's three Matildas have helped them to a famous Women's Champions League semi-final triumph at all-conquering Lyon with Caitlin Foord finding the target in the remarkable 4-1 win that sets up a final against champions Barcelona.\nSubscribe now for unlimited access.\nor signup to continue reading\nFoord, who'd declared how she felt Arsenal could still pull off one of the great shocks in European women's football, celebrated with her fellow Australia internationals Steph Catley and substitute Kyra Cooney-Cross on Sunday as the Gunners overturned a 2-1 first-leg deficit in France.\nThe home club, eight-times European champions, were left stunned and crestfallen, with Lyon's Australian manager Joe Montemurro having seen his side capitulate to the club he once managed so successfully in England.\nIt was also a massive disappointment for Lyon fullback Ellie Carpenter, whose dream of a third Champions League winner's medal was shattered after she'd been tormented all afternoon down her right flank by the excellent Foord.\nBut Renee Slegers' Arsenal now face their ultimate test in the final in Lisbon on May 24 against a rampant Barcelona side who'd earlier outclassed Chelsea 4-1 for a second time in a week, sealing an 8-2 aggregate victory which gives them a shout at a third-straight crown.\nIt was also the end of any faint hopes the injured Sam Kerr may have harboured about making a return to Chelsea's ranks for the biggest match in women's soccer.\nInstead it's Arsenal, who since their 2007 European title have lived in their London neighbours' shadow, who'll go to the Alvalade Stadium after a 5-3 aggregate win which felt wholly unexpected amid an accident-prone showing from Europe's most celebrated women's club.\nLyon keeper Christiane Endler began the shambles after misjudging a fifth-minute corner, with an attempted clearance then hitting her on the back and bouncing in for an own goal.\nMariona Caldentey's superb strike made it two before Alessio Russo cashed in on a succession of defensive errors to score 30 seconds after the resumption.\nIn the 63rd minute, Lyon centre back Vanessa Gilles slipped and fell in her own area, allowing Foord to pounce on the gift to hammer home gleefully.\nThat really sealed the deal even before Melchie Dumornay grabbed an 81st-minute consolation.\nAt Chelsea's Stamford Bridge, Barcelona were again in a different league to the English champions, just as they'd been in Catalonia seven days earlier.\nKerr was still not ready to return to action after more than a year out with her ACL injury but even the Australian captain's presence could hardly have helped the Blues against the silky slick visitors.\nBarcelona were ignited by a wonderful first-half solo goal from the world's best woman player, Aitana Bonmati, who surged all the way from inside her own half at pace before ripping home an unstoppable shot from the right edge of the box.\nBarca went 3-0 up through Poland captain Ewa Pajor and Claudia Pina in the space of three minutes just before halftime, before Salma Paralluelo scored a fourth in the last minute, only for Dutch midfielder Wieke Kaptein to grab a stoppage-time consolation.\nIt was the end of another European dream for Kerr and Chelsea, who reached the final back in 2021, only to be routed 4-0 that day by Barcelona. Four years on, it felt as if nothing had changed.\nAustralian Associated Press",
  "word_count": 556,
  "scraped_at": "2026-02-14T12:53:44.371776"
}