{
  "article_id": "22e315912012",
  "url": "https://www.90min.com/arsenal-3-2-bayern-munich-match-report-talking-points-gunners-dazzle-champions-league",
  "title": "Arsenal 3 - 2 Bayern Munich : Match report and talking points as Gunners dazzle in Champions League",
  "date": "20241219T030000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Arsenal 3-2 Bayern Munich: Match report and talking points as Gunners dazzle in Champions League\n- Arsenal clinched a 3-2 win over Bayern Munich on Wednesday\n- Gunners claim top spot in their group as knockout stage nears\n- Late penalty from Mariona Caldentey erupts Meadow Park\nArsenal fired home a late winner to claim a 3-2 victory over Bayern Munich in the UEFA Women's Champions League.\nThe Gunners were eager to shoo away the ghosts of the past after falling to a 5-2 defeat in October's reverse fixture. A win under the lights of Meadow Park would ensure either side could nip the top spot in their group, with the Renee Slegers side only needing a draw.\nThe fans at Meadow Park were treated to a European spectacle, as both sides battled it out under the lights in a Champions League classic. An own-goal lifted the Arsenal spirits early, but a Magdalena Eriksson brace put Bayern Munich back in the league as the second half kicked off.\nBoth sides will now eagerly await the quarter-final draw that will decide who they will next face in the Champions League. The draw will take place on February 7, with the quarter-finals hosted on March 18/19 and 26/27.\nHow the game unfolded\nIt wouldn't be long before the Gunners drew blood, as a pin-point corner delivery by Kyra Cooney-Cross was headed home by Caitlin Foord from close range. A rendition of ABBA's 'Voulez-Vous' boomed through Meadow Park as the Gunners fans sung Foord's name in celebration.\nHaving scored nine goals in ten games, Alessia Russo tested her firing form by taking on two Bayern defenders on the edge of the box. Able to manoeuvre herself to get the strike away, the shot fired well over the crossbar.\nWitb their spot at the top of their group now under threat, Bayern were hungry for an equaliser. Steph Catley's desperate header cleared Klara Bühl's strike away from danger, but the clearance only fell as far as Giulia Gwinn, who fired her shot into the stands.\nBühl tested the angles as she steered past Emily Fox down the left side, but her strike was kept out by Daphne van Domselaar who palmed the ball away for a corner. The corner wreaked havoc for the Gunners, but it was Catley who was able to clear away the danger as the home fans let out a sigh of relief.\nThe German giants got one back in the 38th minute, as Georgia Stanway towered over Russo at the back post of Gwinn's corner delivery before Magdalena Erikkson fired home the scraps to bring the score level.\nThe second half commenced in cagey fashion, but it was Arsenal who were awarded the golden opportunity to take the lead. Blackstenius found her stride down the width and took a touch past Bayern goalkeeper Ena Mahmutovic, but blundered the opportunity to put her chance away.\nThe German giants were far more clinical at the other end, as a brilliant delivery from Gwinn floated took a touch from Eriksson to sail past Daphne van Domselaar and give Bayern the lead.\nMeadow Park were treated to a game of end-to-end football, as another set piece set the Gunners up for glory. McCabe's superb delivery located Russo on the back post, and the English striker hammered home the equaliser from range.\nIf the game wasn't already nail-biting enough, it would reach new levels in the 85th minute as Arsenal were awarded a penalty for a handball inside of the box. Cool, calm, collected, Caldentey. The Spanish maestro fired home her strike from the spot the win the game for the Gunners in remarkable fashion.\nPlayer ratings\nCheck out the player ratings for Arsenal vs Bayern Munich here.\nGunners show their fight\nIf we learned one thing from the start of Arsenal 2024/25 season under Jonas Eidevall, it's that they were the first to back down from a fight. The Gunners were nothing short of lacklustre, bowing out at the first sign of adversity. But recently, it couldn't be further from the case.\nRenee Slegers has these players falling in love with football over again, and long gone are the times when the Gunners would drop their heads after conceding at 2-1. Aided by the noise of the Meadow Park faithful, Arsenal showed that they have got their fighting spirit back over recent weeks.\nThe Russo leveller at 2-2 was the closest thing Arsenal fans have seen since their spirited effort in the injury-riddled 2022/23 campaign, and the mentality transformation since Slegers took her post is a breath of fresh air.\nHas interim head coach Renee Slegers done enough to get the job?\n\"Last Christmas, I gave you my heart, but the very next day, you gave it away. This year to save me from tears, I'll give it to Renee Slegers\", sung the North Bank in numbers. The Arsenal fans are convinced, so should everyone else be too?\nSlegers has now remained unbeaten in 11 consecutive games as interim head coach, and has Arsenal back playing their exciting brand of football.\nThe Dutch manager has unlocked potential, with Russo scoring 10 goals in 11 games after commencing the 2024/25 campaign scoreless across eight matches. Catley and Williamson have settled into their roles as a centre-back pairing and have executed their game plans brilliantly, and the Gunners looked composed across all areas of the field.\nNow beating Bayern Munich, what more can those in the backroom be looking for in their search for a manager?\nBlackstenius and Russo do more to hinder each other than shine\nWe've seem glimpses of the work that Alessia Russo and Stina Blackstenius can do alongside each other in order to boost this Arsenal side. Those moments have often come in the later stages of Women's Super League (WSL) matches recently, with Blackstenius' oncoming seeing Russo pushed back into the midfield role. This has often worked to benefit the Arsenal attack, but tonight it did nothing but hinder it.\nThe pairing started alongside each other last week against Valerenga, with Russo deployed on the wing. This was an exceptional move by Slegers, as Russo's ability to invert combined with Blackstenius' strength in strike really made for an exciting showing. Although against Bayern Munich, it seemed that the two were lost in translation.\nHaving scored nine goals in ten games, perhaps the decision to start Russo in the midfield meant that she wasn't able to leave an immediate imprint on the game. The English forward looked slightly disjointed, and was unable to queue her runs in time with Blackstenius's.\nArsenal's second goal did enough to show Russo's pure striker instinct, smashing home a volley from range after a well-timed run toward the back post. The 25-year-old is in firing form, and her name should be the first name on the team sheet, in the number nine.",
  "word_count": 1145,
  "scraped_at": "2026-02-14T12:42:36.896431"
}