{
  "article_id": "22fac7ef2cc8",
  "url": "https://www.inverness-courier.co.uk/news/inverness-couriers-happier-highlights-of-2023-october-337590/",
  "title": "Inverness Courier happier highlights of 2023 : October",
  "date": "20231230T201500Z",
  "domain": "inverness-courier.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Inverness Courier's happier highlights of 2023: October\nSome media may focus on doom and gloom but we like to share positive stories about people in our communities.\nHere's a selection from October:\nWalls were painted, cookers cleaned and grass strimmed during a busy day of action to give some love and attention to an Inverness refuge for women fleeing domestic abuse.\nMore than 70 volunteers responded to a call by Inverness Women's Aid (IWA) to join in Operation Love Your Refuge to help revitalise the accommodation which provides a safe space for women and children.\nIt follows a period of uncertainty for the 12-flat refuge after it emerged it was under threat of closure earlier this year.\nA boy from Inverness has opened of a new theatre area at the Royal Hospital for Children in Glasgow after he endured gruelling treatment there when battling cancer.\nCourageous Riley Maclennan was saved from cancer thanks to a stem cell transplant in 2021.\nThis year's Miss Scotland winner has spoken out about the realities behind the scenes, and how 'beauty pageants' shouldn't be stigmatised as 'all about looks', but rather about the charity work and 'what's within'.\nChelsie Allison (26) scooped the title as Miss Scotland last week, where she was up against 11 other women from across the nation.\nA young rugby fan from Inverness had a weekend he won’t ever forget after playing an important role during Rugby World Cup 2023 in France.\nAlastair Grant led Scotland onto the pitch against Ireland in Saint-Denis as a defender of Tomorrow and mascot ahead of the two teams continuing their Rugby World Cup campaign.\nA paramedic who helped save the lives of at least 11 people has been honoured at the Pride of Britain Awards.\nDuncan Tripp (60), who works from Inverness and lives in Lossiemouth, described it as \"surreal and humbling\" to receive the This Morning Emergency Services Award at the event, which aired on ITV.\nA suicide prevention charity supporting people in Moray and the Highlands has netted a massive windfall.\nMikeysline was set up in 2015 following the deaths of three young men in the Highlands.\nIts text-based support and online 1:1 support service is expanding its reach in Moray.\nAnd a charity football match at Mosset Park in Forres generated a £2700 boost.\nA Dingwall 34-year-old was buzzing after winning a popular singing contest in Inverness.\nJoanne Ross took the stage by storm for the latest edition of Ness Factor, which saw £86,000 raised for Highland Hospice.",
  "word_count": 418,
  "scraped_at": "2026-02-14T12:30:21.065030"
}