{
  "article_id": "230e0915566d",
  "url": "https://thebusinessjournal.com/pac-12-to-add-boise-st-fresno-st-san-diego-st-colorado-st-in-2026-poaching-mountain-west/",
  "title": "Pac - 12 to add Boise St ., Fresno St ., San Diego St ., Colorado St . in 2026 , poaching Mountain West",
  "date": "20240913T020000Z",
  "domain": "thebusinessjournal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Pac-12 to add Boise St., Fresno St., San Diego St., Colorado St. in 2026, poaching Mountain West\nValley Children's Stadium photo via gobulldogs.com\nWritten by RALPH D. RUSSO AP College Football Writer\nAfter being poached almost into oblivion, the Pac-12 is fighting off extinction by plucking schools from the Mountain West.\nThe Pac-12 announced Thursday that it in 2026 it will add Boise State, Colorado State, Fresno State and San Diego State alongside Oregon State and Washington State in a rebuilt Conference of Champions.\nThe additions rob the Mountain West of four of its more prominent schools and successful football programs, most notably Boise State. It still leaves the Pac-12 two schools short of the eight it needs to have in place in two years to be recognized as a conference by the NCAA, so more moves are expected.\nThe Pac-12 and the departing schools will likely be on the hook for about $110 million in exit fees and penalties to the Mountain West.\nIt is a remarkable bounce-back move by a conference left for dead a year ago when 10 members scattered to competitors across the country after being unable to secure a lucrative media rights deal that former Pac-12 schools such as Southern California, Oregon, Washington, Utah and Stanford believed would keep them competitive with other leagues.\n“For over a century, the Pac-12 Conference has been recognized as a leading brand in intercollegiate athletics,” Commissioner Teresa Gould said in a statement. “We will continue to pursue bold cutting-edge opportunities for growth and progress, to best serve our member institutions and student-athletes. An exciting new era for the Pac-12 Conference begins today.”\nThe Pac-12 said it evaluated potential new members using five criteria: academics and athletics performance; media and brand evaluation; commitment to athletics success; geography and logistics; culture and student-athlete welfare.\nPac-2\nThe Pac-12 is currently operating as a two-school conference, with Oregon State and Washington State the only remaining members, taking advantage of NCAA rules that allow for a two-year grace period. Oregon State President Jayathi Murthy and Washington State President Kirk Schulz welcomed their new conference mates in a joint statement.\n“We eagerly anticipate their uniquely insightful contributions during this transformative era for the conference and collegiate athletics,” they said.\nOregon State and Washington State have a football scheduling agreement in place this season with the Mountain West, giving them six opponents each from the league. A Sept. 1 first deadline to renew the deal came and went.\nPart of that deal included millions of dollars in additional fees for the Pac-12 if it poached Mountain West schools.\nOregon State and Washington State should be able to afford the fees that remain. While the schools have publicly downplayed having a war chest, they do have about $250 million at their disposal from the two remaining years of the current College Football Playoff agreement; a contract with the Rose Bowl that expires after 2025; revenue accrued by Pac-12 teams in recent years from NCAA men’s basketball tournament units; and Pac-12 Network assets.\nOregon State and Washington State also have an affiliate membership in place for this school year and next with the West Coast Conference for men’s and women’s basketball and other Olympic sports.\nBest of the rest\nLeaders at Oregon State and Washington State have insisted since the Pac-12 collapsed that unless an invitation came from a power conference their priority was to keep the Pac-12 alive.\nWhether the Pac-12 will be considered a power conference again, on par with the Big Ten, Southeastern Conference, Atlantic Coast Conference and Big 12, seems unlikely, but the league is trying to position itself as the best of the rest — especially in football.\nBoise State is the most notable addition as the strongest and most consistent football program outside of the power conferences for more than two decades. The Broncos have 16 double-digit victory seasons since 2002, when they were members of the Western Athletic Conference.\n“What a great day to be a Bronco!” Boise State athletic director Jeramiah Dickey said.\nBoise State is finally moving up, but the Pac-12 it enters hardly resembles the Conference of Champions it was for more than 100 years.\nThe collapse of the Pac-12 was the culmination of three tumultuous years of conference realignment in college sports, all of which went into effect this year and ushered in the superconference era.\nThe Big Ten now has 18 schools, spanning from coast-to-coast. The ACC has 17 football-playing members, including former Pac-12 schools Stanford and California. The SEC and Big 12 each have 16 schools.\nThe Pac-12 appears to be taking a different approach, trying to build a slimmed-down conference instead of just merging with the full, 12-member Mountain West.\nLeft behind\nThe Mountain West will be left with Air Force, UNLV, Nevada, Utah State, New Mexico, Wyoming, San Jose State, Hawaii as a football-only member, and an uncertain future.\nCommissioner Gloria Nevarez said late Wednesday that the MWC board of directors was meeting to discuss the next steps.\n“All members will be held to conference bylaws and policies should they elect to depart,” she said. “The requirements of the scheduling agreement will apply to the Pac-12 should they admit Mountain West members.”\n___\nFollow Ralph D. Russo at https://twitter.com/ralphDrussoAP\n___\nGet poll alerts and updates on the AP Top 25 throughout the season. Sign up here. AP college football: https://apnews.com/hub/ap-top-25-college-football-poll and https://apnews.com/hub/college-football",
  "word_count": 899,
  "scraped_at": "2026-02-14T12:48:25.427756"
}