{
  "article_id": "231bebe835af",
  "url": "https://www.walesonline.co.uk/news/wales-news/outstanding-people-wales-nominated-years-33332357",
  "title": "All the outstanding people in Wales nominated in this year St David Awards",
  "date": "20260131T063000Z",
  "domain": "walesonline.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "All the outstanding people in Wales nominated in this year's St David Awards\nThese are some of the most remarkable people in Wales this year\nTeachers attacked by a schoolgirl and a man who ran into a house to rescue a mother and her child from a vicious dog attack are among the astonishing stories told in the nominations list for this year's St David Awards. Also on the list is an 11-year-old boy who tragically lost his mother and sister in a car crash and has used his harrowing experience to help others.\nNominations for the national awards held annually at the Senedd each March are decided by a panel of former winners and public servants in Wales, while the eventual winner is chosen by the First Minister. The list recognises some of the most exceptional people in Wales - whether they've shown bravery, community spirit, or excellence in their field which can be anything from business to sport.\nSupremely popular Cardiff Danish bakery company Brød and our 2025 Pinc List winner Lauren Price also find themselves on the coveted list. All finalists will receive a St David Awards certificate and the winner in each category will receive a St David Awards trophy designed and made by a leading Welsh artist. You can read all about the nominees and what the panel said about them below.\nBravery award\nLiz Hopkin, Fiona Elias, Darrel Campbell\nThe outstanding teachers of Ysgol Dyffryn Aman are being honoured as finalists for the St David Awards in recognition of their extraordinary bravery during a knife attack at their school on April 24, 2024. Deputy headteacher Fiona Elias, additional learning needs coordinator Liz Hopkin, and a pupil all sustained multiple stab wounds in the incident.\nDespite her severe injuries Liz’s courageous actions were instrumental in saving lives. Former assistant headteacher Darrel Campbell responded rapidly, successfully disarming the attacker and preventing further harm. Fiona Elias has shown bravery and resilience by returning to work within a short period following the attack, continuing to support pupils and staff during a challenging time.\nTheir collective bravery protected other pupils and staff and brought much-needed reassurance during a moment of crisis. Their actions not only averted tragedy but also exemplified the highest standards of integrity, selflessness, and commitment to the entire school community.\nJames Reilly\nJames Reilly, a former Royal Engineer commando, has continued to demonstrate courage and service long after his military career. Now settled in Wrexham with his wife Sarah, daughter Mara and newborn son Dylan, James has transitioned to civilian life as a dedicated plumber and heating engineer, making a positive impact in his local community.\nHis heroism was put to the ultimate test at Greenfield Valley Heritage Park where he selflessly responded to a woman in grave distress in icy waters. Without hesitation James entered the freezing water, securing and reassuring the woman as he and others worked together for over an hour until emergency services arrived.\nJames’ decisive action, with help from bystanders and fire officer Chris Argent, saved a life that day.\nWilliam Newbury\nWilliam Newbury, from Bridgend, demonstrated exceptional courage in the face of danger during a harrowing incident in Cardiff on March 30, 2025. While visiting friends in the Llanrumney area William heard desperate screams and discovered his friend Emily Drew and her newborn baby under attack from three dogs inside their home.\nWithout hesitation he entered the property through a window, quickly securing the baby in a pushchair and ensuring the child’s safety outside. As the dogs continued to attack, William bravely assisted Emily in escaping through the window, closing it behind her to prevent the dogs from following.\nTrapped inside, William used a baby gate to defend himself, enduring a sustained attack for around 15 minutes. His selfless actions resulted in serious injuries, requiring a week in hospital, multiple surgeries, and leaving lasting scars.\nYoung person award\nCian Evans\nCian Evans, a remarkable 11-year-old from Pontardawe, has shown extraordinary resilience and compassion in the face of unimaginable tragedy. At the age of two Cian survived a devastating car accident on the M4 that claimed the lives of his mother, Rebecca, and unborn sister, Cari.\nDespite suffering severe injuries and enduring multiple surgeries, Cian has transformed his pain into a powerful drive to help others. He continues to see specialists for ongoing treatment but remains undeterred in his mission to support those in need.\nCian recently completed the Welsh three peaks challenge, raising over £10,000 for Harry's Fund, a counselling service supporting children and families facing trauma.\nAdditionally he raised £2,700 for the Welsh Air Ambulance by undertaking the walk 100km virtual challenge in April 2023. Cian’s unwavering determination, selflessness, and fundraising efforts have provided vital lifelines for others, making him an outstanding role model and a truly deserving nominee for a St David Award in the young person category.\nAnwen-Grace Rodaway\nAnwen is an inspiring young person from Gŵyr, recognised for her exceptional resilience, kindness and determination. Diagnosed with autism, Anwen has overcome significant personal challenges to excel academically and personally.\nShe served as a representative on the Welsh Youth Parliament at just 13, becoming a strong voice for young people with disabilities, raising awareness about the underdiagnosis of girls with autism and leading initiatives such as beach cleans and interviews on social issues.\nFollowing lockdowns, Anwen was unable to return to education due to poor mental health. Despite setbacks Anwen returned to education, achieving outstanding results at Gower College Swansea, winning both photography and humanities and languages student of the year awards. She created supportive spaces for LGBTQ+ students and contributed to her college’s equality panel.\nCurrently she is writing a novel and is in her first year of filmmaking at Aberystwyth University where she is academic student union rep. Anwen’s dedication and positive spirit in striving to bring about change serve as inspiration to all young people in Wales.\nBowen Cole\nBowen’s commitment is reflected in his work as the Black, Asian and minority ethnic officer at Gower College Swansea and his efforts to amplify underrepresented voices across Wales. Bowen has worked with the Queen Elizabeth II Memorial Committee, been featured as the poster student for Gorseinon across south Wales, and engaged with prominent leaders including King Charles III and Paul Kagame.\nInternationally Bowen has contributed to diplomacy through S4C’s ‘Taith i Rwanda’ and through engagement with the Rwandan High Commission, where he was invited to support ties between Rwanda and Wales. Through national media work with the BBC and S4C, Bowen conveys outstanding empathy, leadership, and a deep commitment to public service.\nBusiness award\nBrød\nBrød – The Danish Bakery, established in 2015 by Betina Skovbro, stands as a shining beacon of cultural heritage and business excellence within Cardiff. Drawing deeply on her Danish roots, Betina has introduced Wales to authentic Scandinavian baking, successfully transforming Brød from a humble neighbourhood café into a nationally celebrated artisan bakery.\nWelcoming thousands of customers every week, Brød has evolved into a distinctive, vibrant community hub. Now operating across four sites, the business employs over 40 staff. The business has also hosted 10 apprenticeships in its first decade, offering crucial opportunities for new bakers to develop artisan skills.\nBrød prioritises the local economy by sourcing ingredients regionally and minimising food waste through digital platforms like Too Good To Go. Brød has shown an exceptional blend of cultural tradition, skilled craftsmanship, and community spirit.\nRockwool Ltd\nRockwool is a trailblazer in Welsh manufacturing, renowned for its pioneering production of stone wool insulation from natural volcanic rock. Based in Bridgend, the company’s innovative products are celebrated for their outstanding fire resistance, soundproofing, and thermal efficiency—making them vital for safe and sustainable buildings across the UK.\nEmbracing the principles of the circular economy, Rockwool invests in advanced, energy-efficient production processes and champions recyclability, actively reducing carbon emissions. As a significant employer in Wales, Rockwool is dedicated to nurturing local talent by engaging with schools, apprentices, and community organisations, inspiring the next generation of STEM professionals.\nTheir insulation solutions feature in prominent construction projects nationwide, with Bridgend recognised internationally as a centre of excellence in the field. Through collaboration with government and industry partners, Rockwool helps to shape safer, greener building standards, underscoring Wales’ global impact in science and technology.\nde Novo Solutions\nde Novo Solutions was founded in 2021 by Mark Sweeny in Langstone, Newport,and has quickly established itself as one of the UK’s leading SME businesses. Mark has harnessed the power of Oracle Cloud and ServiceNow to transform finance, HR, procurement, and payroll for major clients including HM Treasury, the Ministry of Justice and Swansea City Council.\nUnder his guidance, de Novo has achieved significant commercial success, and has developed unique service propositions enabling digital and AI transformation, pioneering industry solutions for central and local government and education.\nMark’s achievements include being named GBEA Wales technology entrepreneur of the year with de Novo ranked number eight Sunday Times 100 fastest growing companies as well as the Deloitte’s UK Tech Fast 50 in 2025.\nHis dedication extends beyond business growth; being committed to nurturing Welsh talent through apprenticeships and mentoring. Mark’s vision and community focus demonstrate how innovation and leadership can drive both economic success and positive social change in Wales.\nCommunity champion award\nFaith in Families\nFaith in Families is a powerhouse of compassion and innovation, redefining the role of a community charity in Swansea. In neighbourhoods grappling with poverty and crisis their Community Cwtches provide safe spaces where children flourish and families find vital support.\nIn 2024 Faith in Families pioneered Cwtch Mawr, Wales’s first Multibank. In its first year alone the initiative generated nearly £28 million in social value. By November 2024 Cwtch Mawr had distributed over one million essential items, supporting more than 30,000 families and keeping surplus goods in use.\nTheir holistic approach includes childcare, advice, training, and family support groups, empowering parents, upskilling adults, and nurturing brighter futures. Guided by their motto, “Hugs not Handouts”, Faith in Families restores dignity, instils hope, and builds resilient communities. Their extraordinary impact makes them a truly deserving finalist for the St David Award for Community Spirit and a beacon of what is possible when compassion meets action.\nParent Learning Group\nThe Parent Learning Group at Cathays High School, led by Adult Learning Wales tutor Christina Roy, is a remarkable example of grassroots community empowerment in Cardiff. Since 2014 this vibrant initiative has worked tirelessly to support parents - predominantly women from diverse backgrounds - by providing both accredited and non-accredited courses, a breakfast club, and a vital food sharing programme.\nTheir holistic approach not only tackles educational disadvantage but also addresses the day-to-day needs of families in one of Wales’ most multicultural communities where over 65 languages are spoken. The group’s impact is profound, with hundreds of women gaining qualifications, re-entering employment, and building confidence to support their children’s learning.\nDuring the pandemic they delivered life-saving health awareness sessions and successfully boosted vaccine uptake. Their Clean Cardiff Community project and numerous accolades, including the Inspire! Adult Learner Award, demonstrate an ongoing commitment to social, economic, and health wellbeing. The Parent Learning Group’s lasting legacy is one of inclusion, resilience, and positive transformation for families across Cardiff.\nRusna Begum\nRusna Begum, a distinguished community champion from Newport, is celebrated for her unwavering commitment to service, leadership, and inclusion. An NHS professional by day, Rusna also founded KidCare4U, which supports nearly 500 people weekly, empowering women, young people, and working with diverse families from marginalised households.\nRusna inspires others as a magistrate, a member of the Independent Advisory Panel for Gwent Police, and as a board member of the Bevan Foundation, among various voluntary roles. Rusna’s initiatives have broken barriers in education, sport, and employment—enabling women to gain work experience, young people to access coaching qualifications, and making the Duke of Edinburgh Award accessible for the first time in her community.\nShe has championed culturally sensitive health and wellbeing programmes, advocated for accurate public health messaging during the pandemic, and fostered pride through cultural celebrations. Rusna’s compassionate leadership and advocacy for diversity have transformed countless lives, making her a role model and an inspiring figure within Welsh society.\nCulture\nLuke Evans\nLuke Evans is celebrated for his exceptional achievements as an actor, singer, and advocate. Born in Pontypool and raised in Aberbargoed, Luke’s journey from the valleys of south Wales to global stardom embodies resilience, talent, and unwavering pride in his Welsh heritage.\nFrom acclaimed performances in London’s West End to starring roles in international blockbusters such as The Hobbit trilogy, Dracula Untold, Beauty and the Beast, and Fast & Furious 6, he has captivated audiences worldwide. Luke is a passionate advocate for LGBTQ+ visibility and mental health awareness, using his platform to champion inclusivity and self-acceptance.\nHis memoir Boy from the Valleys offers inspiration and hope, reflecting his authenticity and courage. Luke has also released two studio albums: At Last, and A Song For You. To celebrate his second album he recorded a special homecoming concert, Luke Evans Showtime! at ICC Wales Newport.\nLuke exemplifies the St David Award for Culture through his exceptional creativity, cultural pride, and meaningful contributions to Welsh culture both at home and abroad.\nMax Boyce\nMax Boyce MBE stands as a legendary figure in Welsh culture, whose unique blend of comedy, music, and poetry has resonated across generations. Born in Glynneath, Max captured the heart of the nation from the 1970s onwards, using his wit and warmth to celebrate Welsh identity, rugby passion, and the spirit of mining communities.\nHis iconic album We All Had Doctors’ Papers topped the UK Albums Chart, and his timeless anthem “Hymns and Arias” still echoes across stadiums, uniting fans and communities.\nBeyond the stage Max has acted as a cultural ambassador, bringing Welsh humour, values, and resilience to global audiences. His charitable work, moving poetry—such as When Just The Tide Went Out—and enduring popularity are testaments to his lasting impact.\nHonoured with an MBE and a statue in his hometown, Max Boyce’s commitment to Wales and its people is unwavering, making him a truly deserving nominee of the St David Award for culture.\nWest Glamorgan Youth Theatre\nWest Glamorgan Youth Theatre Company (WGYTC), founded in 1975, is a cornerstone of Welsh cultural life, celebrating 50 years of nurturing young talent across south Wales. Renowned for inspiring creativity, WGYTC has propelled countless performers, writers, and creative professionals onto national and international stages—from the West End and the Royal Shakespeare Company to acclaimed television, film, and radio productions.\nIts alumni, including Michael Sheen and Russell T. Davies, have shaped the creative industries and Welsh identity, while others have gone on to enrich education, healthcare, and communities, passing on the spirit of artistry and resilience. The company prides itself on innovative, inclusive productions staged in diverse venues, fostering confidence, collaboration, and a sense of belonging.\nDespite funding challenges, WGYTC continues to inspire over 75 young people annually, with its legacy touching more than 3,000 lives. Today WGYTC stands as a testament to the enduring power of the arts to transform lives and strengthen the rich cultural fabric of Wales.\nEnvironment champion award\nCynrig Hatchery\nAt the heart of Welsh species recovery stands the Cynrig Hatchery team—Dr John Taylor, Oliver Brown, Richard Davies, and Haydn Probert of Natural Resources Wales. Tirelessly dedicated, these specialists rear and restore some of the UK’s most threatened wildlife: water voles, white-clawed crayfish, freshwater pearl mussels, and Arctic Char.\nTheir work is a blend of scientific skill, adaptability, and innovative thinking—feeding and cleaning seven days a week, perfecting breeding methods, and developing sustainable solutions like hydroponic vegetable growing for water voles.\nThe team’s efforts have seen over 7,000 crayfish successfully reared, 10,000 water voles reintroduced, cutting-edge salmon tracking environmental impact trials, the first reintroduction of freshwater pearl mussels in Wales and the restoration of a rare population of Arctic Char facing imminent extinction.\nAlways humble, they share their knowledge widely, nurturing both wildlife and the next generation of experts through volunteer engagement. The Cynrig Hatchery team’s commitment and determination are a model of environmental stewardship, protecting biodiversity and helping secure Wales’s most at-risk species.\nDani Robertson\nDani Robertson is an inspirational environmental champion, serving as the dark skies officer for Eryri National Park. Dani manages the UK’s largest international dark sky reserve, where her unique role begins as dusk falls.\nShe leads 'Prosiect Nos', forging partnerships across Wales to tackle the growing threat of light pollution. Dani’s work blends scientific expertise, conservation, and a deep cultural appreciation, as she advocates tirelessly for the protection of Wales’ night skies for wildlife, communities, and future generations.\nThrough innovative lighting strategies, public engagement events, and bilingual outreach, Dani reconnects people with the wonder of the stars. Her influence extends from shaping national policy—having coauthored Wales’s Good Practice Guidance on dark skies—to inspiring millions through her BBC1 documentary and book.\nThrough her steadfast dedication, Dani has made Wales a leading example in dark sky conservation, showcasing resilience, ingenuity, and stewardship—qualities central to the St David’s Award for environment.\nGail Davies-Walsh\nGail Davies-Walsh is a transformative leader in Welsh environmental protection, currently serving as CEO of Afonydd Cymru—the umbrella body for Wales’s six Regional Rivers Trusts. With over 25 years’ experience in the water sector, Gail combines deep technical and scientific knowledge with an unwavering commitment to the health and biodiversity of Welsh rivers.\nSince joining Afonydd Cymru, her dynamic advocacy has positioned her as a trusted voice to government, statutory bodies, and communities alike. Gail’s achievements include pioneering funding strategies, fostering organisational resilience among the trusts, and championing nature-based solutions to river restoration.\nHer influence extends from shaping major national policies and regulations to empowering local groups and raising public awareness on critical issues, such as agricultural pollution and water quality. Frequently sought after by the media and policymakers, Gail’s collaborative, positive, and results-driven approach has left a tangible legacy—ensuring cleaner, healthier rivers for generations to come.\nInnovation, science and technology award\nBarrett Centre for Helminth Control\nThe scientists at the Barrett Centre for Helminth Control, Aberystwyth University, stand at the forefront of global innovation in parasitology, blending a century of Welsh scientific heritage with pioneering modern research. Renowned for their world-leading work on parasitic flatworms, they have unravelled the complex lifecycles and vulnerabilities of these devastating organisms, which threaten the health of millions across the globe and inflict enormous losses on agriculture.\nTheir collaborative, cross-disciplinary approach has delivered breakthroughs in molecular biology, vaccine and drug target identification, and the use of artificial intelligence for drug discovery. The centre’s groundbreaking environmental DNA detection methods have transformed livestock management in Wales and beyond, enabling earlier, more accurate disease surveillance and prevention.\nTheir research not only saves lives but also protects livelihoods, supporting farmers and healthcare professionals with knowledge exchange and practical solutions. Humble yet visionary, this dedicated team exemplifies the spirit of Welsh innovation—combining scientific rigour, compassion, and community engagement to tackle some of the world’s most persistent health and food security challenges.\nDr Elin Haf Davies\nDr Elin Haf Davies stands as a formidable force at the intersection of science, technology, and social impact. Hailing from rural north Wales, Elin Haf’s journey began in paediatric nursing at Great Ormond Street Hospital and evolved through a PhD in neuroscience and as a regulator at the European Medicines Agency.\nAs founder and CEO of Aparito, based in Wrexham, she has revolutionised remote patient monitoring, making clinical trials more accessible for patients worldwide by using innovative digital solutions. Her leadership saw Aparito’s success attract global pharmaceutical giant Eli Lilly, yet she remains at the helm, ensuring continued Welsh excellence with global reach.\nBeyond her entrepreneurial acumen, Elin Haf’s adventurous spirit, demonstrated by ocean rowing across two oceans, reflects her resilience and drive to raise awareness and funds for rare diseases. A published author and inspirational speaker, Elin Haf champions children’s health and empowerment, working with numerous charities. Her dedication to innovation and community makes her a deserving nominee for this award.\nProfessor Joanne Davies\nProfessor Joanne Davies, head of simulation and founding director of SUSIM at Swansea University, is a pioneering figure in medical education and healthcare innovation. Renowned for her blend of compassion and cutting-edge expertise, Joanne tirelessly transforms the training landscape for students and clinicians, bridging academia, industry, and healthcare to ensure simulation-based learning yields real-world impact.\nHer visionary leadership has positioned Wales at the forefront of medical training, integrating the highest educational and research standards including use of innovative technology and bespoke digital platforms to enhance competence, resilience, teamwork, patient and system safety.\nJoanne’s influence extends globally, forging collaborations with NHS Wales, industry leaders, international partners, and leading groundbreaking programmes from Swansea to the Middle East and Zambia. Her visionary approach and leadership sets new standards for flexible, resilient education, supporting frontline staff where it matters most.\nHumble and empathetic, Joanne leads with integrity and a relentless drive for improvement, inspiring those around her and delivering lasting benefits to patients, professionals, and the Welsh community. She exemplifies innovation with humanity.\nPublic services award\nDr Tipswalo Day\nDr Day is an inspirational obstetrician and gynaecologist dedicated to transforming maternity care for women in Wales and beyond. As a consultant at Glangwili General Hospital, Carmarthen, she is a driving force behind a perinatal team celebrated for its award-winning commitment to patient safety and a positive workplace culture.\nRenowned for her passion for equitable care, Dr Day has pioneered initiatives that have significantly reduced stillbirths and birth-related brain injuries through improved teamwork and a culture of learning. A gifted educator, she has developed innovative training resources and led programmes recognised at national level.\nDr Day’s commitment to tackling disparities is evident in her founding of Race Matters in Maternity, Wales’ first conference dedicated to addressing inequalities in maternity outcomes. Frequently consulted as an expert, she serves on advisory boards and has been recognised with multiple prestigious awards for her advocacy and leadership. Dr Day is a true ambassador for safer and more inclusive NHS services, embodying compassion, excellence and positive change.\nInnes Robinson\nInnes Robinson stands as a transformative figure in Welsh education, serving as executive headteacher of both Pencoedtre High and Whitmore High. Originally from England and joining the profession through the Teach First programme in London, Innes has made an indelible mark on schools across south Wales.\nRenowned for his infectious enthusiasm and relentless positivity, he is a catalyst for meaningful change, inspiring staff, pupils, and parents alike. Innes was appointed to Pencoedtre High during a critical period following special measures and industrial action, and in astonishingly little time, he revitalised the school’s culture, behaviour, and ethos.\nHis hands-on leadership, unwavering ambition, and visible presence across both schools have galvanised communities, instilling a renewed sense of pride and purpose. With a proven track record, having played a key role in the successful turnaround of three schools, Innes has not only elevated educational standards but also fostered environments where students flourish and staff feel empowered.\nJan Luke\nJan Luke is the heart of Roch CP School, Pembrokeshire, serving as both a loved learning support assistant in Years 5 and 6 and one of the school’s ELSA and wellbeing champions. Renowned for her boundless compassion and tireless commitment, Jan goes above and beyond to nurture pupils’ emotional and social wellbeing.\nJan founded a nurture group that is already transforming the lives of vulnerable children, offering consistency, care, and creative support. Whether collecting surplus food for cooking projects, leading afterschool/holiday clubs, or bringing her energy as district commissioner of Pembrokeshire Pony Club, Jan’s impact extends far beyond the classroom.\nIn times of tragedy she emerges as a steadfast source of strength, guiding both pupils and staff through grief with empathy and resilience. Despite her own health challenges, Jan is always present, offering a listening ear, practical help, and unwavering support. Her quiet determination, humility, and ability to inspire trust make her an unsung hero—one whose influence will be felt for years to come.\nRobert Scott\nRobert Scott is a dedicated prison officer at HMP Berwyn whose journey epitomises the transformative power of education within public service. Initially joining the Young Adults Training pilot as a learner, Rob’s proactive spirit saw him complete the level two train the trainer qualification with Adult Learning Wales.\nNow he leverages his experiences to inspire and facilitate peer-led training sessions for fellow officers, fostering a culture of collaboration and continuous professional development within the prison. Rob’s impact reaches far beyond personal achievement; his commitment has galvanised colleagues to embark on their own learning journeys, strengthening the partnership between Adult Learning Wales, the Prison Officers Association, and HMP Berwyn.\nValuing teamwork, mutual respect and the importance of lifelong learning, Rob leads by example, believing every individual can improve with the right support. His unwavering dedication, humility, and ability to nurture positive change is exceptional, ensuring his influence will benefit the prison community for years to come.\nSport\nJess Fishlock MBE\nJess Fishlock MBE, born in Cardiff, is Wales’ most capped footballer and a trailblazer in women’s football. Making her senior debut at just 16, Jess quickly established herself as an outstanding talent, becoming the first Welsh player—male or female—to reach 100 caps, and ultimately representing her country 165 times.\nHer leadership was pivotal in guiding the Wales Women’s National Team to their first ever UEFA EURO Championship finals in 2025, marking a historic milestone for Welsh football. Jess’ club career spans continents with title wins in England, Australia, Scotland, Germany, and France, including Champions League triumphs with Frankfurt and Lyon.\nOff the pitch she is a respected advocate for equality, earning an MBE in recognition of her services to football and the LGBTQ+ community. Jess’ unwavering commitment, resilience, and inspirational presence have made her a role model for aspiring athletes. Her sporting achievements and dedication to her country are truly remarkable.\nLauren Price MBE\nLauren Price, born in Newport and raised in Bargoed, is a trailblazing Welsh athlete whose extraordinary journey has redefined success across several sports. Initially excelling in football and kickboxing, Lauren’s relentless determination led her to boxing, where she made history at the Tokyo 2020 Olympic Games as Wales’ first-ever Olympic boxing champion, securing gold in the middleweight division.\nHer Olympic triumph was a landmark moment, inspiring a new generation of Welsh athletes. Transitioning to the professional ranks, Lauren has maintained an unbeaten record and captured the WBA, IBF, WBO, and Ring Magazine world welterweight titles in 2024, earning widespread respect for her technical prowess and sportsmanship.\nBeyond her athletic achievements, Lauren is a proud ambassador for Wales, frequently celebrating her roots and motivating others with her story of resilience and versatility. Her groundbreaking accomplishments continue to shape the future of women’s boxing and bring immense pride to Welsh sport. Lauren was also crowned winner of WalesOnline's Pinc List 2025.\nAlan Williams\nAlan is a national dinghy sailing coach and coach developer from Caernarfon. He has been pivotal in coaching and supporting young sailors to develop from grass roots dinghy sailing on the coastal waters and lakes of Wales to international sailing competitions and the Olympic Games.\nAlan coaches year-round, often in challenging sea states and strong winds, supporting sailors to develop their skills. He has inspired several generations and ensured that sailors and their families have a lifelong love for the sport. Many he has coached are now involved professionally or volunteering across Wales and the UK.\nAlan teaches national race coaching qualifications and has authored 2 dinghy sailing coaching books translated into numerous languages. He has been instrumental in developing safety management strategy at UK level and is passionate about driving excellence in coaching and mentoring.\nVolunteering\nAdvocates and Angels\nAdvocates and Angels, a volunteer-driven charity founded in Swansea by Bethan Germon in memory of her daughter Lydia, stands as a beacon of hope for Welsh families facing disability, illness, hospitalisation, or bereavement.\nMotivated by personal experience and compassion, Bethan and her dedicated team of unpaid volunteers provide vital emergency Chrysalis care packages to parents and children during moments of crisis, ensuring comfort and dignity when it is needed most.\nTheir support extends to bespoke resources for carers of children with complex needs, as well as the Butterfly Club, which offers solace to bereaved families. With an impressive record of assisting more than 10,000 families, Advocates and Angels works in close partnership with NHS wards, hospices, and community groups, delivering peer-led advocacy and Welsh-language support.\nDespite limited funds and no paid staff, the charity’s empathy, resourcefulness, and unwavering commitment ensure that no family in Wales faces hardship or grief alone, embodying the true spirit of voluntary action and community care.\nBrian Jones\nBrian Jones, from Penmaenmawr, Conwy, is a remarkable volunteer whose devotion has defined the British International Search and Rescue Dogs (BIRD) team for over four decades. Now in his 80s, Brian continues to play a pivotal role as team leader, guiding BIRD through countless emergencies both at home and overseas.\nHe has been instrumental during major events such as earthquakes (two in Turkey, India, Pakistan, Algeria) and floods (Mozambique), and in supporting humanitarian efforts for Kosovan and Ukrainian refugees. In addition he has been involved in searches for many missing persons in Wales and England.\nBrian’s steadfast dedication is matched only by his tireless fundraising, standing in all weathers at the Mona car boot sale every week to ensure the team’s vital work continues. He is renowned for his gentle approach, sharing wisdom with generations of volunteers and offering support without judgement.\nWhether organising training, attending international deployments, or lending a compassionate ear, Brian’s humility and courage set him apart. His lifelong commitment to helping others has made a profound difference, establishing BIRD as a cornerstone of rescue services and making Brian a truly deserving nominee for this award.\nEileen Hodge\nEileen Hodge, based in Conwy, co-founded a charity Therapy Dogs Nationwide 10 years ago. She has devoted more than two decades to voluntary work supporting children and vulnerable individuals. She leads a team of 30 dedicated volunteers for a national charity, using her dogs, which are temperament assessed for their suitability, to offer comfort, companionship, and confidence to those facing emotional, behavioural, and developmental challenges.\nEileen’s innovative approach sees her and her dogs visiting schools, libraries, and medical centres, helping children overcome fears, build literacy skills, and improve classroom behaviour. She also provides valuable support to people living with dementia, autism, and mental health conditions. During the pandemic Eileen’s compassion was particularly evident as she travelled the region to help anxious children cope with vaccinations.\nTirelessly recruiting new volunteers, organising events, and raising awareness, Eileen has transformed countless lives across north Wales. Her empathy, leadership, and unwavering dedication make her not only an inspiration to those she supports, but also an outstanding nominee for this award.",
  "word_count": 5121,
  "scraped_at": "2026-02-14T12:51:13.529590"
}