{
  "article_id": "231fa7b815f5",
  "url": "https://weaintgotnohistory.sbnation.com/chelsea-fc-women/2024/4/14/24129922/manchester-united-vs-chelsea-womens-fa-cup-semifinal-preview-team-news-how-to-watch",
  "title": "Manchester United vs . Chelsea , Women FA Cup semifinal : Preview , team news , how to watch",
  "date": "20240414T081500Z",
  "domain": "weaintgotnohistory.sbnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "After the disappointment of (yet another) League Cup final defeat against Arsenal, for the second year running, we can bring back some good cheer by reaching the final of the other domestic cup as well, as we take on Manchester United in the semifinals of the Women’s FA Cup today.\nManchester United vs. Chelsea, Women’s FA Cup semifinal: Preview, team news, how to watch\nWembley calling\nAnd considering that it’s Spurs against Leicester City in the other semifinal, our semifinal is, in essence, the final of this competition already — just as it was the actual final last year (with Chelsea winning, 1-0).\nWe’ve had two weeks to reflect and recover a bit from the defeat against Arsenal, though many in the squad have had international commitments, and coming back from a break like that is never easy. Hopefully we can find our groove early.\nDate / Time: Sunday, April 14, 2024, 14.35 BST; 9:35am EDT; 7:05pm IST\nVenue: Leigh Sports Village, Greater Manchester\nReferee: Kirsty Dowle\nForecast: Rainy, breezy, cool\nOn TV: BBC One (UK); none (USA); elsewhere\nStreaming: BBC iPlayer (UK); ESPN+ (USA)\nManchester United team news: United have been the best of the rest after the big three this season in the WSL, but they are winless against that trio, including a 3-1 defeat to a Lauren James hat-trick at Stamford Bridge back in January.\nACL injuries have been a scourge on many a team this season, and United have three players currently sidelined with them: Jess Simpson, Gabby George, and Emma Watson. The availability of Canada international Jayden Riviere is also in doubt after she missed out on national team duty.\nChelsea team news: Our own ACL-injury crew includes Sam Kerr and Mia Fishel, while defenders Aniek Nouwen, Maren Mjelde, and Millie Bright remain sidelined. On the bright side, Bright has returned to partial team training this week, though Emma Hayes was reluctant to put a concrete date on a potential return after so many months out for the team captain.\nWinning games and trophies has taken on additional meaning this season, but that’s only part of the motivation as we look to avoid another disappointment like against Arsenal.\n“The team wants to win for themselves. They want to win for the football club. They want to win for the families. They want to win because they’re winners. They’re sick to death of what they need to do for me.\n“And that’s fair, it’s not about me, it’s about them and us as a collective making sure we maximise the situations we are in. There are three pieces of silverware up for grabs and I’m very grateful to be in the position to be competing for them.”\n-Emma Hayes; source: Chelsea FC\nPreviously: We’ve won 10 of the 11 meetings all-time against this iteration of Manchester United, drawing once — though last year’s FA Cup final was decided just by the narrowest of margins.",
  "word_count": 488,
  "scraped_at": "2026-02-14T12:22:36.851863"
}