{
  "article_id": "236287adb53a",
  "url": "https://theprideoflondon.com/posts/everton-0-1-chelsea-women-3-standouts-macario-key-as-blues-punch-ticket-into-fa-cup-semifinals-01hrmjkerw61",
  "title": "Everton 0 - 1 Chelsea Women , 3 standouts : Macario key as Blues punch ticket into FA Cup",
  "date": "20240311T164500Z",
  "domain": "theprideoflondon.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This is what a club defined by winning does. Head on the road for the third time in the span of a week, and find a way to earn a result. Chelsea Women weren't fresh by any means, but at Walton Hall Park on Sunday afternoon the west Londoners edged Everton 1-0 to move into the final four of one of the most illustrious cup competitions in the world of football. Brian Sorensen's crew came to play, something anyone could have guessed considering the trouble it caused Manchester City the weekend prior in the league.\nThe Merseysiders challenged the west Londoners' backline much more than in the last WSL fixture. Sorensen's team forced Zecira Musovic into four stops including a solid one off the boot of Kathrine Kühl, but that common theme in the final third remained. Goals have been at a premium for EFC, especially against top-flight opposition.\nThe American Catarina Macario stole the headlines once again off the bench, converting her second goal in as many appearances this season. An intelligent progressive run from ex-Everton loanee Aggie Beever-Jones accompanied by some brilliant off-ball movement and a finish from the Blues' No. 9 was all that was needed to oust the Toffees from the FA Cup.\nEmma Hayes made six changes from the lineup that was deployed in the Conti Cup semifinal including a completely new front line. The Swede Musovic slotted into the starting XI for the first time since the Conti Cup quarterfinal at Kingsmeadow against Sunderland A.F.C. Nathalie Bjorn, who was cup-tied against Man City started as the right-sided center-back, but an injury forced Niamh Charles into the match. Jess Carter moved from right back to center back alongside Sjoeke Nusken. Hayes expressed that Bjorn felt something in her calf, and that \"it was fair to say there'll be something there with that.\"\nSince January 30 when the west London outfit traveled to Brighton and Hove Albion, the club has amassed eight clean sheets in the last nine fixtures. Or as Macario said, \"le clean sheet...again.\"\nChelsea is set to find out its semifinal opponent on Tuesday morning on BBC Radio 5 Live Breakfast around 8:20 GMT. Manchester United, Tottenham Hotspur, and Leicester City remain from this weekend's action with the west Londoners the only side left in the competition that has ever won it in the past.\nBefore the next FA Cup opponent is revealed, here are our biggest standouts from another triumphant afternoon in northern England.",
  "word_count": 412,
  "scraped_at": "2026-02-14T12:57:13.947560"
}