{
  "article_id": "23900a4592b1",
  "url": "https://www.goldderby.com/article/2023/nick-mohammed-ted-lasso-interview-transcript/",
  "title": "Nick Mohammed ( Ted Lasso ): Complete Interview Transcript",
  "date": "20230707T193000Z",
  "domain": "goldderby.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Best Picture\nOne Battle After Another\n78.4%Best Director\nPaul Thomas Anderson (One Battle After Another)\n91.2%Best Actress\nJessie Buckley (Hamnet)\n90.4%Best Actor\nTimothée Chalamet (Marty Supreme)\n76.6%Best Supporting Actress\nTeyana Taylor (One Battle After Another)\n72.7%Best Supporting Actor\nStellan Skarsgård (Sentimental Value)\n80.0%Best Adapted Screenplay\nOne Battle After Another\n91.6%Best Original Screenplay\nSinners\n91.2%Best Casting\nSinners\n80.8%Best Cinematography\nSinners\n65.5%Best Costume Design\nFrankenstein\n89.2%Best Film Editing\nOne Battle After Another\n74.0%Best Makeup and Hairstyling\nFrankenstein\n94.9%Best Production Design\nFrankenstein\n85.3%Best Score\nSinners\n92.2%Best Song\nKPop Demon Hunters (Golden)\n86.7%Best Sound\nF1\n81.8%Best Visual Effects\nAvatar: Fire and Ash\n92.8%Best Animated Feature\nKPop Demon Hunters\n92.5%Best Documentary Feature\nThe Perfect Neighbor\n90.5%Best International Film\nSentimental Value\n64.8%Best Animated Short\nButterfly\n79.1%Best Documentary Short\nAll the Empty Rooms\n84.1%Best Live Action Short\nA Friend of Dorothy\n66.2%Subscribe to\nAlerts & Newsletters\nBy providing your information, you agree to our Terms of Use and our Privacy Policy. We use vendors that may also process your information to help provide our services.\nDuring a recent Gold Derby video interview, senior editor Matt Noble spoke in-depth with Nick Mohammed (\"Ted Lasso\") about Season 3 of his Apple TV Plus feel-good comedy, which is eligible at the 2023 Emmys. Watch the full video above and read the complete interview transcript below.\nMohammed plays Nathan \"Nate\" Shelley, who turned his back on AFC Richmond at the end of Season 2 and becomes head coach at rival club West Ham United. The shift in storyline required the actor to stay away from many of his \"Ted Lasso\" cast members for much of Season 3, and essentially made Nate the new antagonist of the series.\n\"It felt like a very different role,\" Mohammed stated in our webchat. \"He's out on his own. He's out on a limb ... It was great to have lots of interactions with new people, but yeah, God, of course I missed hanging out in the locker room and getting to be on the sidelines with Jason [Sudeikis] and Brendan [Hunt] and Brett [Goldstein].\"\nSEE Watch more than 400 interviews with 2023 Emmy contenders\nMatt Noble: Nick Mohammed plays Nathan Shelley in the Emmy award-winning comedy series, Ted Lasso. I'm Matt Noble with Gold Derby. Just sort of start, Nick, by asking, it doesn't look like Nate's having a whole bunch of fun at West Ham. How much fun were you having in season three?\nNick Mohammed: Oh, lots of fun because listen, it was very different. It felt like a very different role to certainly season one and even season two. I know that sort of charted Nate's downfall, but yeah, he's out on his own. He is out on a whim and out on a limb. Sorry. Yeah, it was fun because I was obviously getting to work with other kind of characters, Anthony Head playing Rupert, who's brilliant and so nice, and Eddie who plays Jade and Spencer who plays Derek. It was great to have lots of interactions with new people, but yeah, God, of course I missed hanging out in the locker room and getting to be on the sidelines with Jason and Brendan and Brett. So I really tried to use as much of that feeling of abandonment in the performance of Nate, because I think he's going through a similar thing. He's sort of almost got imposter syndrome. He's in a completely different environment and he's just facing a whole load of new sort of challenges. And so not in a pretentious way, but I tried to channel as much of that kind of energy into the performance, because that is exactly where he finds himself at the start of this season.\nMN: Was that the biggest challenge for you, channeling that energy, or was there something else?\nNM: Oh no, there's definitely some... they've not been out yet, but in episodes 10 and 12 in particular, there's some difficult scenes and so they were genuinely difficult. I mean, I can't go into too much detail because I don't don't want to spoil anything, but particularly the season finale, it happened to be, and I don't know whether it was by design or fortuitous that we ended up filming scenes, some of Nate's last scenes on the very last day of the whole shoot, and bearing in mind, because we generally don't know if that is it, that might be the end of the whole thing. So obviously there was a sort of element of it being kind of quite emotionally charged anyway, but because of the nature of the scene as well, it was meant to be an emotional scene, but it ended up just becoming quite real. Something's really weird, kind of blurring between reality and then stuff that we were shooting. So it was wonderful as a result of that and it felt actually genuinely very cathartic, but really quite challenging as well. But I'll wait. We can speak about it once it's been out.\nMN: Yeah. Well, and whether it's the end or not, it has been talked about that there was a three season story for the show that gets rounded out at the end of this year and the end of this season. So without spoiling how things end for Nate, how do you feel about that three season arc that Nathan had?\nNM: I think the writers have absolutely nailed it. I feel like they, and it's been so sort of seeded and drip fed, but so kind of sensitively paced, I think, to make it feel real. Because I think that the last thing that they would've wanted that it felt... I mean, it does feel like a heel turn when he betrays Ted at the end of season two, but it still needed to add up. It still needed to feel that it hadn't just come absolutely out of nowhere. For Ted it feels like it's come out of nowhere, but actually all the sort of warning signs and the red flags are sort of there charting Nate's downfall.\nAnd I think similarly now, and obviously we're not at the end of the season so I can't speak too openly, but we are showing... I think even from episode one of season three in the press conference, we see these moments of just regret in Nate's eyes of, \"What have I done? Why am I here?\" And he is still the same guy. He still is riddled with all this insecurity and lacks this sort of self-confidence and self-worth and that's playing out in slightly different ways, but we are seeing cracks begin to show. I think episode nine has just been out and it's the first time that we've seen him just an act of, it is not a huge thing, but there's an act of defiance against Rupert. He's just not gone with him with these women to this bar. He's just gone back to Jeff. You can see that we're building towards... of course there's unfinished business between him and Ted and Richmond. Of course, it'd be mad for them not to deal with it in some way. Whether it's a redemption thing is a whole different matter because in a way, that's not really even up to us. That's sort of up to an audience as to whether they feel Nate's done enough. For some people they'll always crave their pound of flesh because of what he did at the end of season two and for others they're like, \"Yeah, I can see that Jade is a force for good in his life.\" But even then, Nate still hasn't accepted responsibility. I personally don't feel up until this point Nate has done anything that would mean that he's fully redeemed. I don't think he's done enough yet.\nMN: Yeah, I'd agree with that. And I think an interesting thing with Nate this season is we have seen that arc from the sort of biggest underdog at Richmond to this sort of to be a bit reductive, like the villain or the foil, the antagonist of this season. But we still see him being a very confused character in a lot of ways. He is the villain that's just being a real douche bag to Ted and got those great scenes like that, but we also see him struggling to ask a girl out at the restaurant and all. So we see still a real innocence and vulnerability to him at the same time we see this real sort of sinister side and dark side of Nate. How do you find clarity in that confusion as an actor?\nNM: I kind of question the writers a lot when we're going into scenes and often they'll rewrite on the day and Jason's all over it, and particularly this season, wanting to find clarity for whichever actor is doing something. Because often is the case with Nate that he's saying or doing one thing, but actually inside, we need to see it eating him up or we need to see that it's not quite what he believes. We need to show that confusion in him. So it is a challenge. You kind of walk a bit of a tightrope actually, because on the one hand, Nate, even in episode one of season three, there's that bit where he's reversing his little mini in between two really fancy cars and that's a really kind of goofy, funny moment mean. It's almost like something out of Mr. Bean. It's almost like physical comedy aspect to it. And his sort of clumsiness is quite physical and that's been there from season one. But then you cut to these quite raw emotional scenes of Nate. But it's all there in the writing. It's just about, I guess, sort of navigating it in the most realistic way possible, again, for it to feel authentic and believable because you want people to feel invested and you want people to feel like he's a real person. And I think that he is a real person in that he is, to a large extent, misunderstood. I'm not condoning his actions, particularly when he betrayed Ted and when he was inappropriate, made an inappropriate move on Keeley in season two. I'm not excusing that behavior, but he is misunderstood and he doesn't believe he's a villain. He doesn't. And even if he does have any kind of awareness that some of his actions might have been villainous, we're all allowed to make mistakes mean. If ever Ted Lasso taught us anything, it is about, we're allowed to make mistakes and we're allowed to find our way back. That is the whole point of the show. And for Nate, without giving anything away, Nate represents that in a nutshell, but across three seasons to say it's really drawn out. But yeah, so we'll see where it's headed.\nMN: Yeah. And look, we can make mistakes and all that sort of stuff, like the whole first season, Rebecca was trying to sabotage the club and undermine Ted at every step of the way. And at least in Ted's eyes and the team's eyes, she found redemption and forgiveness there. And I think with Nate, I guess-\nNM: Jamie, too.\nMN: Jamie as well, yeah. He was the big sort of antagonist of season one as well, a bully who's become sort of an advocate for the underdog and the Ted Lasso way. I guess partly with Nate, it's also, as bad as some of his actions might be, he has at least in his mind, justified them, which is why he doesn't see them as villainous. And I think he plays the victim a bit, too. Sort of like, \"I'm entitled to this because of how I've been treated.\"\nNM: Completely. And there's a sad truth to that, not exclusively, but let's say someone who has been at the hands of a bully, give them a bit of power, a bit of responsibility and you see them emulating what was done to them because it's sort of all they know. And particularly with Nate, because he doesn't have a support network, he's been clearly mistreated by his dad and has this very toxic relationship, never been able to do in his dad's eyes, Ted coming along in his life filled a massive hole and it empowered him in a brilliant way. When Ted then stepped away because Ted in his way just thought, \"Oh, well, Nate's fixed,\" or whatever, Nate very quickly spiraled out of control again because he felt abandoned. He suddenly was been given all this praise and then it felt like it had been taken away. And so he started to just questioned himself and very quickly, because his mental health is not great, very quickly spiraled out of control and started lashing out in all the wrong directions, including stuff that was done to him, which he would never have wanted previously. But it is no surprise that he lashes out at Colin and Will the kit man, because that's who he was and how he feels like he was treated by these people. So he takes that out on them.\nMN: We still see hints that he's sort of inspired by Ted and even trying to emulate Ted in certain areas. And particularly recently, when he tried to get the Love Hounds-\nNM: Oh, God. Yeah.\nMN: ... going at West Ham.\nNM: Yeah, it was really funny.\nMN: Yeah. Talk to us a bit about that scene, because that was one of Nate's probably funniest scenes of the season.\nNM: Yeah, it was really fun because actually there's something, what I really liked about that was actually yes, because it was just genuinely played for laughs. There's so many funny lines in it, especially Jadran and Sam who play Disco and Roger respectively, who are brilliant and some of their lines were great, so funny. And actually, I watched that episode back and it had not really dawned on me, even though I'd obviously read it, it had not dawned on me at how well edited it was in terms of we're literally cutting from the Diamond Dogs to then the Love Hounds. We're really seeing the chasm of the difference between these two support networks mean. Nate's one is just nonexistent. It doesn't fire up at all. Rupert doesn't show up. But ti's so tragic. I mean, that's why Ted Lasso works so well, is because they can make us laugh, but then instantly make us see the tragedy in that. When finally Disco and Roger leave the room and I think Roger says, \"Are we in trouble?\" He's like, \"No, you're not. You're not in trouble.\" But Nate is just left alone again. He's just alone. He's so alone. I would say 60, 70% of the shots of Nate, he's on his own, and it's really deliberate. It's so deliberate from the writer's part to create this feeling of isolation, such that as an audience we kind of start to question whether we should forgive him. We talked about Rebecca and Jamie having redemption arcs, but all Ted Lasso has always been about, for me, is always about our capacity for forgiveness and it's actually really interesting how quickly we were able to forgive Rebecca and Jamie, but actually not so much Nate. I've noticed that, and possibly rightly so, he did overstep [inaudible 00:12:42] maybe that we were really tested and I think it's because we grew so fond of him in season one and really rooted for him. So the betrayal in season two felt like a real personal knife in the back for so many of the fans of Ted Lasso that it was too much.\nMN: That's an interesting thing because yeah, I guess with Rebecca and Jamie, the starting off point was the sort of ill intent-\nNM: They were already...\nMN: ... of those characters and we slowly, it was revealed that there was a real humanity behind that. Whereas Nate, we saw that humanity up front.\nNM: Yeah. Got rid of it or kind of replaced it with ego and all the toxic stuff and now we're trying to then re-justify it with his insecurities reemerging. So it's a really interesting, as an actor, it's like you kind of relish it as a challenge. And like I say, I feel like as writers of the show, they've just nailed it because it's really... you don't see that much. It's a really dynamic journey, but you don't often see it in a supporting role. Your lead cast might kind of get those arcs, but not often a supporting role. Supporting roles are almost there to be constant, to keep your lead players in to bounce off and change. But yeah, so it's been a real thrill to do that.\nMN: What have you learnt from this role and from this performance, Nick?\nNM: Oh God, I don't know. I mean, I feel like generally the show is a force for good. There's so many brilliant life lessons that you can take from the show. And even the most obvious one, be curious, not judgmental. I honestly try and I hope I would... done it before Ted Lasso, but I do almost find myself sort of stopping myself and being like, \"Just don't instantly just sort of judge or kind of think, 'Oh, well that's that because of that,' just try and just and think, just try and put yourself in someone other's shoes, try and empathize more and be curious about someone's behavior and not instantly write them off.\" And so undoubtedly I've taken that feel. It's such a positive message. But I mean, also the friendships I've made from with the cast and the crew, obviously we're a real family and I don't know, I guess it's been really, this is the first role that I've done where I've had to, I guess, challenge myself. It's not always been bringing out the kind of comedy in the role that was absolutely part of it, but so much more in season two and certainly what's to come in season three ends up being quite emotional and quite raw, and that was a real test. And frankly I just had a lot of support from Jason and all the creators who were always there to help us through the more kind of testing scenes.\nMN: Yeah. Is there a particular choice that you made in the final season that you're particularly proud of or maybe that you thought was particularly an important choice for you to make?\nNM: There's a physical choice, but you'll only notice it on the watch back, I think, in terms of his posture, I think. He bears a very heavy weight at the start of season three, doesn't Nate? Because he has to absolutely account for his action. There's a lot riding on him making it work for West Ham. I kind of really consciously tried to physically show... as much as they were isolating him, I was trying to physically show this sort of this way. And he's often very hunched, often face down because he is also on social media, he's just preoccupied by what people are saying about him. So I tried to create this sort of, I guess this... I'm getting too pretentious about it, this almost sort of tension in him. And we start to see it lift. There's a moment where you see it lift in episode four because he interacts with Ted, but you won't notice that until you re-watch it. And then it's his interactions with Jade start, he just starts to open out. And you's also seeing in his hair and his costume changes, very subtle changes to hair. We actually change wigs in episode 10, which is about to come. You won't really know, but there's a very slight change. It's a softer look. There's a softer look to him. There's a kind of choice of clothes, the choice of what he... and obviously this isn't me, this is costume department, but it was all discussed. It was a big discussion that we had on what suits do to him, what kind of high turtlenecks do to his sort of posture and physicality. It just make him really uptight actually, and a slow de-robing of Nate as we're getting into these law few episodes. So yeah, look out for that.\nMN: Oh yeah. I also love thinking about the show, too, and thinking about Nate this season, just some of his zingers against Ted and just boy, if an English Premier League coach who was running the top team in the league just started making fun of the team that's facing relegation, I feel like there'd be a lot of negative coverage around that particular coach. It's one thing for maybe an Arsenal Liverpool to be exchanging jabs and things like that, but I'm like, \"Oh boy.\"\nNM: Yeah, it's horrible. I remember when I read that because I remember, because I've known broadly where Nate has been headed for a long time, but I remember really anxiously kind of anticipating episode one of season three thinking, \"I wonder,\" as in I wonder how they're pacing it, basically. And then I read stuff in the press room and I was like, \"Oh no, they're really doubling down on Nate's behavior. Oh, crikey. Yeah, I'm in it for the long haul.\" But yeah, it's fun, though. It's really fun.\nMN: If you were to just sum up in one sentence, Nick, what the Ted Lasso experience has meant to you, what would you say?\nNM: Oh, the most overwhelmingly joyful rollercoaster, because there have been highs and none of us could anticipate where it's sort of taken us. And I couldn't go because my daughter had just been born, but the fact that they went to the White House, they're like, \"what? [inaudible 00:19:08]\" The idea that the show could suddenly inform mental health policy. I mean like, God, it's mad, absolutely mad. But we're so grateful for it. But it has been just the most joyful rollercoaster. I've loved every minute.\nMN: Well, Nick, thanks so much for talking to us today. All the best of luck with the Emmy Awards this year.\nNM: ….\nMN: It's a team about an underdog football team, but you guys are sort of the West Ham of the Emmys, just coming in …\nNM: Look, there's a lot of great shows out there, a lot of great competitions. And so we would never rest on our laurels. Of course because we've been there before, there's that slight kind of like, \"Oh, will it happen again?\" But none of us are really in it for that. At this point, we're just so grateful that the show has resonated with people and we're very grateful for the work, and so yeah.\nMN: People, to watch this interview, you can go to goldderby.com and Nick, just thanks so much for your time. It's always so lovely to chat.\nNM: Thanks. Well, good to chat again, Matt. Take care.\nPREDICT the 2023 Emmy nominees through July 12\nMake your predictions at Gold Derby now. Download our free and easy app for Apple/iPhone devices or Android (Google Play) to compete against legions of other fans plus our experts and editors for best prediction accuracy scores. See our latest prediction champs. Can you top our esteemed leaderboards next? Always remember to keep your predictions updated because they impact our latest racetrack odds, which terrify Hollywood chiefs and stars. Don’t miss the fun. Speak up and share your huffy opinions in our famous forums where 5,000 showbiz leaders lurk every day to track latest awards buzz. Everybody wants to know: What do you think? Who do you predict and why?\nSIGN UP for Gold Derby’s free newsletter with latest predictions\n2023 Emmy Predictions: Best Comedy Supporting Actor\nNews & Predictions\nGet the latest updates on awards and entertainment news\nMore from Gold Derby\nMost Popular\nOscar History\n10 Comments\nNews & Predictions\nGet the latest updates on awards and entertainment news\nBy providing your information, you agree to our Terms of Use and our Privacy Policy. We use vendors that may also process your information to help provide our services.\nEditor's Picks\nGold Derby is a part of Penske Media Corporation. © 2026 Gold Derby Media, LLC. All Rights Reserved.\nad",
  "word_count": 4100,
  "scraped_at": "2026-02-14T13:01:20.509720"
}