{
  "article_id": "239c66509338",
  "url": "https://www.ksl.com:443/article/51143066/late-goal-from-tejada-snaps-3-game-losing-streak-for-utah-royals",
  "title": "Late goal from Tejada snaps 3 - game losing streak for Utah Royals",
  "date": "20240929T061500Z",
  "domain": "ksl.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Estimated read time: 2-3 minutes\nThis archived news story is available only for your personal, non-commercial use. Information in the story may be outdated or superseded by additional information. Reading or replaying the story in its archived form does not constitute a republication of the story.\nSANDY — An up-and-down season for the Utah Royals has had more lows than highs, but Saturday's 1-0 home win over Racing Louisville got the team back on an upward trajectory.\nThings started out a little grim with injuries to starting goalkeeper Mandy Haught and Paige Monaghan before five minutes passed in the game.\nUtah's depth was already thin with Brecken Mozingo and Mina Tanaka missing another week, but BYU alum Cameron Tucker jumped in for Monaghan and rookie Cristina Roque replaced Haught for her first NWSL start.\nThe stoppages prevented any real rhythm from forming in the first half as just one shot found its way on frame between the two teams through 45 minutes.\nAna Tejada tested the goalkeeper a couple of times early in the second half and then smashed one into the back of the net from about 30 yards out for the lone goal of the match in the 78th minute to win it.\nAna Tejada pulled up from a different state 🚀 pic.twitter.com/fUhR7At3Vs\n— National Women's Soccer League (@NWSL) September 29, 2024\n\"Scoring that goal tonight, to her, is like a mental something, which is very positive for her,\" interim head coach Jimmy Coenraets said of Tejada's game-winner. \"It will encourage her to keep on doing what she's been doing.\"\nUtah's passing and cohesion through the midfield looked much improved with Tejada back on the pitch after she missed the last outing due to yellow card accumulation.\n\"She can only be happy with what she did tonight,\" Coenraets added about the 22-year-old center-back-turned-midfiedler. \"But it's also finding those outlets and the midfield was just a bit easier today.\"\nRoque earned a clean sheet in her first NWSL start and Coenraets said he expects to get several players back from injury next week on the road at Portland when he hopes \"the availability report is less than 10 players long.\"\nThe Portland match will be on Oct. 5 at 8 p.m. MDT.",
  "word_count": 373,
  "scraped_at": "2026-02-14T12:24:02.929918"
}