{
  "article_id": "23c033f4a2ff",
  "url": "https://www.mirror.co.uk/gaming/ea-fc-24-wsl-tots-32669141",
  "title": "EA FC 24 WSL TOTS : release date , leaks and predictions for new TOTS squad",
  "date": "20240425T131500Z",
  "domain": "mirror.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "EA FC 24 WSL TOTS: release date, leaks and predictions for new TOTS squad\nAnother brand-new squad is set to be released as part of the EA FC 24 TOTS promo this week.\nThe first-ever women's TOTS squad is set to be released in Ultimate Team very soon, with the EA FC 24 WSL (Women's Super League) TOTS squad next up.\nEA Sports kicked off the TOTS promo in EA FC 24 Ultimate Team with the TOTS Live squad last week, featuring live TOTS player items that can be upgraded based on real-life performances. This was the first TOTS Live squad we've ever seen in Ultimate Team, and the big changes are set to continue with the release of the EA FC 24 WSL squad.\nAfter being added to Ultimate Team for the first time in EA FC 24, this will be the first TOTS promo with women's squads, and the WSL TOTS promises to be one of the best of the entire promo. The WSL features some of the biggest names in world football, including the FIFA 23 cover star Sam Kerr.\nThere was no public fan vote to select who could feature in the EA FC 24 WSL TOTS squad, though with Chelsea Women, Arsenal Women, and Manchester City Women dominating the league, the team may end up picking itself.\nHere's everything we know about the upcoming EA FC 24 WSL TOTS squad, including leaks, predictions, and the official release date.\nREAD MORE: EA FC 24 Squad Battles TOTS rewards: TOTS packs and player picks feature as rewards updatedREAD MORE: EA FC 24 Champions TOTS rewards: red picks return as FUT Champs rewards updatedEA FC 24 WSL TOTS: release date\nEA Sports released the EA FC 24 TOTS release schedule last week, and based on this and a new loading screen in Ultimate Team, the WSL TOTS squad release date is set for tomorrow, Friday, April 26 at 6pm BST / 1pm EST / 10am PDT. The promo squad is expected to be available in packs for a week before being replaced by another TOTS squad on Friday, May 3.\nThe release schedule originally displayed that the WSL TOTS would be released in the same week as the Premier League TOTS and a Mixed TOTS, but the latest Ultimate Team loading screen suggests all three squads could be released simultaneously. The loading screen also teases an English striker from the WSL pace with 97 pace and 97 dribbling.\nEA FC 24 WSL TOTS: leaks\nThe only leak for the WSL TOTS so far comes courtesy of @FutPoliceLeaks, with the leaker revealing Chelsea Women's Lauren James will be included in the squad. This is backed up by the loading screen in UT, with James the only player who seemingly fits the subtle hints we've been given so far.\nEA FC 24 WSL TOTS: predictions\nBased on the 2023/24 WSL season so far, this is the squad we expect to see for the EA FC 24 WSL TOTS squad. Remember, these are just predictions, and none of these players are confirmed to feature in the promo.\n- GK: Khiara Keating (Manchester City Women) - 92 OVR\n- RB: Ashleigh Neville (Tottenham Women) - 91 OVR\n- CB: Lotte Wubben-Moy (Arsenal Women) - 89 OVR\n- CB: Alex Greenwood (Manchester City Women) - 92 OVR\n- LB: Katie McCabe (Arsenal Women) - 93 OVR\n- CDM: Katie Zelem (Manchester United Women) - 90 OVR\n- CM: Jill Roord (Manchester City Women) - 92 OVR\n- CM: Jessica Park (Manchester City Women) - 91 OVR\n- RW: Lauren James (Chelsea Women) - 96 OVR\n- ST: Khadija Shaw (Manchester City Women) - 94 OVR\n- LW: Lauren Hemp (Manchester City Women) - 95 OVR\nManchester City Women, Arsenal Women, and Chelsea Women are all set to dominate the WSL TOTS squad, with the top three in the league a level above the rest this season. Saying this, don't be surprised to see some inclusions from other clubs, with a few Manchester United stars in line to feature.\nChelsea Women's Ramirez, Man City Women's Laia Aleixandri, and Brighton Women's Elisabeth Terland have already received TOTS items, with the trio included in the TOTS Live squad. As with every promo in EA FC 24, we can expect to see some more WSL TOTS players released as SBCs and Objectives, so keep your eyes peeled for those.",
  "word_count": 732,
  "scraped_at": "2026-02-14T12:22:35.626590"
}