{
  "article_id": "23c4e638d385",
  "url": "https://www.rnz.co.nz/international/pacific-news/544683/pasifika-sipoti-for-13-march",
  "title": "Pasifika Sipoti for 13 March",
  "date": "20250313T003000Z",
  "domain": "rnz.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Rugby\nFiji and Moana Pasifika sides will take part in the Super Rugby Under-20 tournament, which gets underway in Taupo on Saturday.\nFiji is scheduled to meet the Hurricanes in the opening match at the Owen Delany Park.\nFiji coach, Senirusi Seruvakula said they are excited about the opportunity, where they can test players ahead of the Oceania championship.\nMoana Pasifika will meet the Crusaders in the third game of the day.\nThe semifinals will be held on 18 March, with the final on 22 March.\nLeague\nThe PNG Hunters will meet the Sunshine Coast Falcons in Brisbane this weekend, in the Hostplus Cup rugby league competition.\nIt will be the team's first game for the season, following the cancellation of their round one clash against the Cutters last weekend due to ex-Cyclone Alfred.\nThe National newspaper reported Hunters coach Paul Aiton will field the same lineup that was to have met the Cutters.\nCricket\nFiji and Papua New Guinea will meet Japan in a round-robin format at the men's Under-19 cricket World Cup qualifier in April.\nThe National reported the winner will qualify for the 2026 Under-19 World Cup in Namibia.\nFootball\nFIFA has approved two new competitions for women's football at their recent council meeting.\nA FIFA statement said the Council has given the go-ahead for the FIA Women's Champions Cup to kick-off in 2026, and the FIFA Women's Club World Cup in 2028.\nOceania will have one spot for the club world cup, going into a play-off for three qualifying spots against five other teams.\nTo get to the champion's cup competition, the Oceania representative will have to win the preliminary stage play-off against the Asian champion, before going into the second-round preliminary match.\nFootball\nThe new Football Federation Samoa chief executive officer wants to help drive Samoa Football towards more success.\nFaumuina Margaret Crichton has been appointed to the position.\nOceania Football reported the former Samoan football and hockey representative has deep roots in the local sports community and is set to steer the Federation's strategic direction.\nCrichton said she had always dreamed of returning home from the United Kingdom and helping develop the next generation of players and work with stakeholders to build a stronger, more inclusive, and successful future for Samoan football.\nBeach volleyball\nThe defending champions of men's beach volleyball at the Pacific Mini Games - Vanuatu's Stivano Banga and James Chilia - are focused on successfully defending their title at the Palau event this year.\nVanuatu Daily Post reported Banga saying they look forward to competing in the Palau Games, as they continued with their preparations at home.\nThe Mini Games gets under way in late June.",
  "word_count": 445,
  "scraped_at": "2026-02-14T12:35:02.138775"
}