{
  "article_id": "23c87b7d60e8",
  "url": "https://fortune.com/2023/03/28/wrexham-manchester-united-friendly-san-diego-ryan-reynolds-rob-mcelhenney/",
  "title": "Ryan Reynolds , Rob McElhenney Wrexham to play Manchester United in San Diego",
  "date": "20230328T164500Z",
  "domain": "fortune.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Soccer sensation Wrexham is coming to America. Not just on television screens, but on the pitch.\nThe fifth-tier Welsh side, which has become a fan favorite since Hollywood stars Ryan Reynolds and Rob McElhenney bought it and launched a documentary series, “Welcome to Wrexham,” will play Manchester United in a friendly on July 25 at San Diego State’s 35,000-seat Snapdragon Stadium.\n“We hope to become America’s team — sorry,” McElhenney said at news conference Monday, where he shared the dais with Andrew Cole, a former Manchester United player who is now an ambassador for the hugely popular team, and former U.S. national team star Landon Donovan, who is co-owner and executive vice president of soccer operations for the San Diego Loyal.\nWrexham will compete in a $1 million, winner-take-all, seven-on-seven tournament in June in Cary, North Carolina. But the match against Manchester United in the United States will be much bigger for many reasons.\n“Not bad, not bad,” McElhenney said. “We’ve been very clear from the very beginning that our ultimate goal is to get to the Premier League, which a lot of people laughed at, but I don’t think they’re laughing at us much now. The truth is, the system is in place for that very thing to happen.\n“We had hoped that at some point we’d be playing Manchester United in the Premier League,” he added. “We didn’t realize it would be in three years. Obviously this is a friendly. We had hoped that maybe in eight to 10 years time we’d actually be playing with you guys,” McIlhenney said to Cole.\nMcElhenney said Wrexham will play other friendlies while in the United States with specific details to come.\nReynolds and McElhenney took over beleaguered Wrexham in February 2021 and their documentary — about their journey, the team, its fans and its city — premiered in August. Wrexham is the third-oldest football team in the world and plays in the English National League, the fifth tier of professional soccer.\n“I believe we can become America’s football team because we don’t have to worry about the regionalization, right?” McElhenney said. “I’m a massive Philadelphia Eagles fan, so American football, and obviously if you’re trying to grow that fan base in the U.S. it’s tricky because there are various regions where people have their own teams. So with an English football team, or a Welsh team that plays in the English system, we don’t have to worry about that regionalization. So you can be from Des Moines, you can be from Minnesota, you can be from West Texas and be a Wrexham fan.”\nMcElhenney, who was wearing a Wrexham cap, said the team keeps selling out of its gear and knows it has a fan base on this side of the Atlantic Ocean.\n“We know it’s a lot of Americans, we obviously know the postal codes, but also because a lot of baseball caps are getting sold and that’s not a huge market in the UK,” he said.\nSeveral local United supporters attended the news conference and McElhenney told them: “One more thing I’ve found about football, too, is you can have two teams. Because we’re separated by so many leagues — for the time being — you can have two teams. They’re going to play their hearts out. Maybe you can fall in love with our team as well.”\nThe match will be part of a summer U.S. tour by Manchester United. A youth-focused team drawn from its traveling squad, supplemented by academy prospects, will face Wrexham as part of a week-long training camp in San Diego.\nCole said he hasn’t seen “Welcome to Wrexham” but knows that the documentary is “spreading football. Football is a global game. Even if you don’t know about football, when it comes to World Cup time, everyone watches football. It’s a language, football is. I think what Wrexham are doing is absolutely fantastic, having the opportunity to come out here and play football out here and spread it throughout the world.”\nDonovan said it’s a big deal that this match is coming to San Diego, which is growing in stature in the soccer world.\n“You can argue that these are the two most relevant soccer clubs, certainly by American standards,” Donovan said. “I will say this anecdotally — my wife knows nothing about football/soccer at all. She knows who Manchester United is and she knows who Wrexham AFC is now, probably because two cute guys run the show.”\nOn Saturday night, a crowd of 30,854 at Snapdragon Stadium — a record for a National Women’s Soccer League opener — watched star Alex Morgan score on a penalty kick in the 88th minute of the San Diego Wave’s 3-2 win against the Chicago Red Stars.\nSan Diego reportedly is in line for an MLS expansion team by December.",
  "word_count": 804,
  "scraped_at": "2026-02-14T12:25:18.461438"
}