{
  "article_id": "23cd2170e03d",
  "url": "https://bernews.com/2024/03/leilanni-nesbeth-signs-with-chicago-red-stars/",
  "title": "Nesbeth Signs Three Year Contract With Red Stars",
  "date": "20240307T171500Z",
  "domain": "bernews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Nesbeth Signs Three Year Contract\nThe Chicago Red Stars released a statement officially announced the signing of Bermudian Leilanni Nesbeth, saying that she “joins the team on a three-year contract through the 2026 NWSL season.”\nThe statement said, “The Chicago Red Stars today announced the signing of draftee and midfielder Leilanni Nesbeth. Nesbeth. Chicago’s first-round and tenth overall draft pick in the 2024 National Women’s Soccer League [NWSL] Draft, joins the team on a three-year contract through the 2026 NWSL season.”\n“Leilanni brings a wealth of experience that will undoubtably help her succeed here the way she has with Bermuda and in college,” said Chicago Red Stars general manager, Richard Feuz.\n“We are very happy to welcome Leilanni to the Red Stars and look forward to seeing her develop her game to this next level in her career.”\n“I’m so excited to officially join the team and ready for the season ahead! I’m looking forward to playing in front of the fans at SeatGeek and having some fun,” said Nesbeth.\nThe report said, “Nesbeth joins the Red Stars from Florida State University, where she helped the Seminoles win the NCAA National Championship in 2021 and 2023. In addition to her 15 goals and 14 assists, Nesbeth’s accolades at FSU include earning spots on the 2023 NCAA Tournament All-Tournament Team and the ACC All-Conference Second Team in 2022 and 2023. At the end of her Seminole career, Nesbeth tallied five game-winning goals and 72 starts across 89 appearances and 4,994 minutes played. Nesbeth has also played professionally for English side Brighton & Hove Albion in the Women’s Super League in 2018.\n“A Bermudian international, Nesbeth earned her first senior call up for the Bermudian women’s national team in 2022. The midfielder scored a brace during her first cap February 22, 2022, before increasing her international goal tally to five with her first hat-trick for Bermuda April 12, 2022. Prior to playing at the senior international level, Nesbeth received call ups to the Bermudian under-17 and under-20 national teams in 2018 and 2020, respectively.\n“The Red Stars begin the 2024 National Women’s Soccer season March 16 when they take on the Utah Royals in Sandy, UT. The club returns to Chicago for their home opener at SeatGeek Stadium March 23 against Seattle Reign FC. Tickets are available now at chicagoredstars.com/tickets.”",
  "word_count": 388,
  "scraped_at": "2026-02-14T12:41:07.773641"
}