{
  "article_id": "23d9e3a611c6",
  "url": "https://b1057.com/340286/indianapolis-airport-hits-record-10-million-passengers/",
  "title": "Indianapolis Airport Hits Record 10 Million Passengers",
  "date": "20241216T214500Z",
  "domain": "b1057.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Indianapolis Airport Hits Record 10 Million Passengers\nIndianapolis had a very busy year in 2024, with the airport breaking records. In 2024, over 10 million passengers traveled through Indianapolis International Airport, the highest in its history.\n“Ending 2024 with 10 million passengers after the Big Ten championship was fitting,” said IAA Executive Director Mario Rodriguez.\nDriven by events like the NBA All-Star Game, spring break, the Total Solar Eclipse, the Indy 500, and Memorial Day weekend, the first half of the year brought 5.2 million travelers.\nJune and July were the airport’s busiest months ever, with nearly 2 million passengers. August also broke records, with over 824,000 travelers. Summer events like the U.S. Olympic Swim Trials, National Eucharistic Congress, Brickyard 400, and Gen Con added to the numbers.\nThe year was so big that 2024 saw Lucas Oil Stadium’s concert attendance record broken four times. Thanksgiving travel boosted numbers further, and December began strong with the Big Ten championship.\nEvents projected to big more passengers through Indianapolis Airport:\n- The WWE Royal Rumble, Feb. 1 at Lucas Oil Stadium.\n- The 2025 Big Ten Women’s Tournament March 5-9, and the 2025 Big Ten Men’s Tournament March 12-16 at Gainbridge Fieldhouse.\n- The Indianapolis 500, May 25 at Indianapolis Motor Speedway.\n- The WNBA All-Star Game, July 19 at Gainbridge Fieldhouse.\n- Gen Con 2025, July 31-Aug. 3 at the Indiana Convention Center\n- LIV Golf Indianapolis, Aug. 15-17 at The Club at Chatham Hills.\n- The 2025 Big Ten Football Championship, Dec. 6 at Lucas Oil Stadium.\nIndianapolis Airport Hits Record 10 Million Passengers was originally published on wibc.com",
  "word_count": 269,
  "scraped_at": "2026-02-14T13:40:03.483122"
}