{
  "article_id": "23fb9638d0d5",
  "url": "https://www.areanews.com.au/story/8697973/clare-wheeler-from-newcastle-jets-to-olympic-matildas-glory/?cs=9307",
  "title": "Clare Wheeler : From Newcastle Jets to Olympic Matildas glory | The Area News",
  "date": "20240716T124500Z",
  "domain": "areanews.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Football is a game of moments.\nSubscribe now for unlimited access.\nor signup to continue reading\nTiming your runs, taking chances, producing game-changing tackles, seizing opportunities when they present themselves.\nClare Wheeler has done all of the above to book her ticket to Paris and a first appearance at an Olympic Games.\nIt is a moment the Newcastle Jets product has always dreamed of and worked hard for.\nWheeler's selection in Tony Gustavsson's 18-player Matildas squad for the Olympics is testament to her mental resolve, patience and ability to overcome adversity.\nKicking off\nWheeler's journey started with Adamstown Rosebud Junior Football Club aged 10 at the encouragement of a friend.\nShe honed her skills at Hunter Sports High and came through the Emerging Jets program before earning a W-League contract with the Jets as a 15-year-old.\nThe combative midfielder, now 26, played seven national league seasons with Newcastle between 2013 and 2020 and earned the Cheryl Salisbury Medal for player of the year on multiple occasions as an important, no-nonsense, reliable team member.\nIt is no surprise to Craig Deans, who coached Wheeler at the Jets, that she has taken her game to another level.\n\"The best lesson for every kid that plays the game is just to work hard and be patient and have a good attitude, and if you're good enough you'll get to where you want to get to,\" Deans says.\n\"She is the absolute epitome of that. I haven't really seen anyone who just puts their head down and works like she does. If you watch her play, she's just always giving 100 per cent.\n\"If they've only got 18 players in that squad for the Olympics, you need someone like her because you know she's going to be dependable. She's going to be able to play every minute of every game if you need her to because she's fit and strong.\n\"She's tough. She's physically tough and she's mentally tough.\"\nTaking a chance\nIt was a move, not made easily, to powerhouse Sydney FC for the 2020-21 season that put Wheeler on a quick upward trajectory.\nA starring role for the Sky Blues earned the former Australian under-20 representative not only an A-League championship but also an overseas contract at Danish big guns Fortuna Hjorring.\nA Matildas' call-up followed in September 2021 then a contract with Everton in the prestigious Women's Super League.\nBoth came after Wheeler sat glued to Australia's history-making run at the Tokyo Olympics in 2021, where the Matildas lost the bronze medal play-off, with a burning desire to be part of the action in Paris.\nBut, it is still hard to believe that three years later that is where she is headed.\n\"Football moves so quick,\" Wheeler says.\n\"And, that's just the life of a professional footballer and as an athlete things can change so drastically.\n\"Honestly, if you told me that my move to Denmark would then lead me to a move to the UK to then also be a Matilda and go to a World Cup and now go to an Olympics, I would have been like, 'Oh really'. I had no idea. But that's what's happened in the last three years.\n\"When I was making that move, it was because I just wanted to leave everything out on the table. I wanted to go do it so it wasn't a 'What if?'\n\"I didn't want to end my career being, 'What if I went overseas?', or 'What if I took myself out of my comfort zone'. I'm so happy I did that and I took that risk, and where I am now is testament to why it's important to do that and keep doing that.\"\nDriving force\nWheeler has remained a permanent fixture in the Matildas set-up since earning her first cap.\nShe was included in Gustavsson's 23-player squad for the record-breaking FIFA Women's World Cup co-hosted by Australia and New Zealand last year.\nThe Matildas captured the hearts and attention of the nation with a best-ever performance at the tournament, making the semi-finals and finishing fourth.\nWheeler, however, was one of several players unused throughout the World Cup as Gustavsson stuck solid to a core 14 or 15.\n\"It is challenging to not take to the field,\" Wheeler says.\n\"But, what I took away from that World Cup, I was just in awe of the growth of the game and just seeing packed-out stadiums. It was amazing to feel that atmosphere and see the support behind women's sport.\n\"From there, I wanted to make the Olympics. It's always been a dream of mine and from conversations with Tony, it was all about just keep adding layers to your game.\"\nSeizing the moment\nWith only 18 spots open for the Olympics, selection was going to be ruthless and Gustavsson said \"very good players in strong form\" would miss out.\nWheeler was not used during crucial Olympic qualifiers against Uzbekistan in February but did not let it deter her, producing consistent minutes and performances for Everton.\nHer break came against Mexico in Texas in April, where the diminutive playmaker was given her first minutes for the Matildas in five months with World Cup star Katrina Gorry sidelined by a long-term ankle injury.\nThe window was open.\nGustavsson was settled on all but a few positions when the final chance to state a case for inclusion came with two games against China in Adelaide (May 31) and Sydney (June 3).\nThe squad for Paris was being named on June 4.\nWheeler featured in both, starting in Adelaide then coming off the bench in Sydney to immediate effect by timing her run to perfection and scoring with a header off Steph Catley's free kick.\n\"There's certain times where everything that you've done as a footballer kind of boils down to a few moments, and in football those are few and far between,\" Wheeler says.\n\"But, it definitely felt like one of those moments where it was either make or break.\n\"You probably saw from my reaction after I scored that it wasn't a planned celebration. It was just pure emotion.\n\"I cringe a little bit when I watch it but it's just pure emotion. I was just really happy to take my opportunity. It felt like a do-or-die moment.\"\nTarget acquired\nNewcastle, and Northern NSW Football, has a rich history of producing Matildas and will be represented by Wheeler and Dudley Redhead Football Club junior and San Diego Wave midfielder Emily van Egmond, one of Australia's most experienced players, in Paris.\nA family photograph of Wheeler sitting on the shoulders of dad Ken holding a mini Olympics flag during the Sydney 2000 Games posted on Instagram marked the selection moment.\n\"He's over the moon,\" says Wheeler, who lost her mum Kim to cancer when she was 19.\n\"He's the first person I told when I found out that I was going to make the Olympics and he wasn't even surprised. He said, 'I knew it. I had no doubt.' Just to have that belief in me is really special.\n\"That photo I posted on socials with me and my dad during those 2000 Olympics, it's a really great moment to share with him, that I'm actually going to an Olympics of my own and he's going to be there watching me. It's a really sweet moment.\"\nFinishing touch\nThere was little time for Olympics selection to sink in with Paris, and a tough group of Germany (July 26), Zambia (July 29) and United States (August 1), looming large.\n\"I keep telling myself that I'm going to an Olympics, and doing the fitness we're doing now I believe I'm going to the Olympics, because I'm dying at the fitness,\" says Wheeler, who is now in a pre-Games camp with the Matildas in Spain.\n\"I'm hoping for a medal. That's the overarching goal. To come away with something tangible. I wasn't there for the last Olympics but was there for the World Cup and to be so close to a medal.\n\"For me in particular, I want to make an impact and play a role in this Olympics and help the team in whatever way I can and then get that photo at the end of it with my dad next to me and a medal around my neck.\"\nGoing the distance\nWheeler knows it will take \"everything\" for the Matildas just to get out of the group and her contribution cannot be under-rated with quick turnarounds making squad depth key.\nOne thing is certain - any match minutes the Novocastrian is given will be delivered with a no-holds-barred, never-say-die attitude and work ethic.\n\"The key thing is to just keep going and make the most of your opportunity,\" she says.",
  "word_count": 1458,
  "scraped_at": "2026-02-14T12:42:26.937767"
}