{
  "article_id": "2405863aa3e4",
  "url": "https://www.aol.co.uk/news/roger-daltrey-humbled-knighthood-213000255.html",
  "title": "Roger Daltrey  humbled  by knighthood",
  "date": "20250613T221500Z",
  "domain": "aol.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Roger Daltrey ‘humbled’ by knighthood\nRoger Daltrey, the frontman of The Who, has said he is “humbled” to be knighted for his services to charity and music, calling the honour a “dream come true”.\nSir Roger, who co-founded the rock band in 1964, is among several high-profile names in the King’s Birthday Honours List, including West End star Elaine Paige and Oscar-winning actor Gary Oldman.\nThe actor’s knighthood comes months after he told journalists he didn’t “know why” he had not had a “nod from the royals”.\nPenny Mordaunt, the former Commons leader, former footballer David Beckham and teenage darts player Luke Littler have also been recognised in a list of 1,215 recipients.\nJust under half (48 per cent) of all those listed were women, with 95 years between the youngest and oldest individuals, aged 11 and 106, respectively.\nSir Keir Starmer, the Prime Minister, said: “This year’s Birthday Honours List is a powerful reminder of the extraordinary dedication, compassion, and service that exists in every corner of our country.\n“From community champions to cultural icons, each recipient reflects the very best of Britain. I extend my heartfelt congratulations and gratitude to them all.”\nRock recognition\nSpeaking of his knighthood, Sir Roger, 81, said: “It’s strange, it’s an experience that I’ve never had before, I’m very humbled by it.”\nHe is the patron of the Teenage Cancer Trust, one of four charities supported by last year’s Telegraph Christmas appeal, and has been involved with it for more than three decades.\nHe added: “It’s kind of weird, but I am deeply honoured to get this, especially for the charity Teenage Cancer Trust, and I accept it on their behalf really, because this honour is really for all unsung heroes.\n“It’s a dream come true for me, but it’s especially a dream because the charity means so much.”\nMeanwhile, Sir Gary Oldman, who won an Oscar, Bafta and Golden Globe for his performance as Winston Churchill in Darkest Hour, was recognised for his services to drama.\nThe 67-year-old also played Harry Potter’s godfather Sirius Black in several of the movies in the fantasy franchise and more recently won an Emmy for his portrayal of notorious MI5 boss Jackson Lamb in Slow Horses.\nLast year, Sir Gary told the BBC he did not know why he had been overlooked by the honours system.\nAt the time, he was the only British Oscar winner of best actor or actress this century to have not received some kind of honour.\nWest End icon and EastEnders star\nMusicals icon Dame Elaine Paige will be made a Dame nearly six decades after her West End debut.\nThe 77-year-old, who is the voice behind some of the biggest hits in musical theatre, said she was “absolutely over the moon” about the news.\nDame Elaine, who has been an ambassador for brain injury and neurodisability charity The Children’s Trust for over 35 years, has starred in musicals such as Cats and Evita.\nThe singer and actress, who has been honoured for her services to music and charity, said: “Music and the charitable causes I support are the mainstays of my life.”\nShe added: “In the words of Rodgers and Hammerstein, ‘There Is Nothin’ Like A Dame’ – and this newly-minted one is absolutely over the moon and truly grateful. Wow!”\nTracy-Ann Oberman, the West End star and playwright, has been made a Member of the Order of the British Empire (MBE) for her work for Holocaust awareness and fighting anti-Semitism.\nThe Jewish actress said: “This recognition is deeply meaningful and I’m grateful to all who have supported this journey.”\nMs Oberman recently called out comedian Dawn French for a social media video in which the latter appeared to mimic Israel’s supporters amid the military campaign in Gaza, for which French later apologised.\nMordaunt gets damehood\nPenny Mordaunt, former cabinet minister, has been awarded a damehood after her sword-wielding role at the King’s Coronation.\nThe former leader of the House of Commons becomes a Dame Commander of the Order of the British Empire for political and public service in the King’s Birthday Honours.\nThe former Conservative MP for Portsmouth North held the 8lb Sword of State aloft for almost an hour during the Coronation of the King at Westminster Abbey in 2023.\nShe was the first woman in history to perform the role at a Coronation as Lord President of the Privy Council.\nLabour MPs Sir Mark Tami and Chi Onwurah have also been awarded a knighthood and damehood.\nDame Chi said: “I grew up on a council estate in Newcastle in a one-parent family. I never thought about being made a dame, as you can imagine.”\nAnother mandarin in receipt of an honour is Sarah Healey, the top civil servant in the Ministry of Housing, Communities and Local Government.\nDame Sarah praised being able to work from home while serving in the Department for Digital, Culture, Media and Sport, as it allowed her to spend more time on her Peloton exercise bike.\nPhil Douglas, the Border Force chief, has been made a Companion of the Order of the Bath for “services to border security and public service”.\nMr Douglas assumed the role in November 2021, since when small-boat crossings across the Channel have continued to soar.\nPeter Hyman, a former senior adviser to Sir Keir Starmer and ex-strategist for Sir Tony Blair, will be made a CBE for his services to politics and education, after his charity Voice 21 contributed to Sir Keir’s push for oracy to be included in the curriculum.\nA handful of union bosses are also lined up to be made OBEs, including Dave Ward, a former general secretary for the Communication Workers’ Union, representing postal workers.\nSue Ferns, a former deputy general secretary for Prospect trade union, which represents a range of workers, including those in the energy sector, has been made an OBE.\nRoyal Household honours\nThe King has personally honoured the Queen’s GP, as well as his own senior surgeon.\nDr Nicholas Brown, apothecary to the Queen, and Ranan Dasgupta, who was appointed sergeant-surgeon to the Royal Medical Household in March 2023, have been made Lieutenants of the Royal Victorian Order (RVO).\nAlso honoured is Dr Timothy Wakeford, the Royal family GP who serves the household at Highgrove, the King’s Gloucestershire estate.\nMeanwhile, Lee Dobson, the King’s head valet, a member of the RVO, has now been made a lieutenant.\nCommander Anne Gillian Sullivan, the Princess Royal’s long-serving deputy private secretary is made a CVO and David Quick, the Duke and Duchess of Edinburgh’s house manager at Bagshot Park, their Surrey home, becomes a member of the order.\nAwards of the Royal Victorian Order are in the King’s gift and are bestowed, independently of Downing Street, to those who have served the monarch or the Royal family in a personal way.\nLong-awaited knighthood for Beckham\nFootball legend David Beckham and rugby player Billy Boston have both been knighted respectively for their services to football and charity and rugby league.\nSir David, the former England captain and Manchester United midfielder, was among those who queued for 13 hours to pay his respects to the late Queen when she died in 2022.\nThe day before Sir David was knighted, he was seen chatting with the King at a St James’s Palace ceremony for the monarch’s foundation, of which the former Manchester United midfielder is an ambassador.\nHe has been made a knight for his services to sport and to charity, having partnered with Unicef and campaigned with Malaria No More, a charity working to eradicate the disease.\nSir David was made an OBE in 2003 and has been in the running for a knighthood for more than a decade.\nSir Billy, 90, is the first rugby player to receive a knighthood. He made almost 500 appearances for Wigan Warriors in the 1950s and 1960s. He is also a trailblazer for black sports stars and received his honour from the King at Buckingham Palace earlier this week due to concerns for his health.\nVirginia Wade, the last British woman to win the singles tennis titles at Wimbledon in 1977, has been made a CBE, while the retiring double Olympic triathlon champion Alistair Brownlee has been made an OBE.\nFrom Alexandra Palace to Buckingham Palace\nTeenage darts sensation Luke Littler has become one of the youngest-ever sports personalities to be made an MBE.\nLittler, who turned 18 in January shortly after winning the most recent World Darts Championship, is named alongside Luke Humphries – who beat him in the 2024 world final – in the King’s Birthday Honours list.\nThey follow iconic players of the 1970s and 1980s, Eric Bristow and John Lowe, as only the third and fourth darts players to be made MBEs.\nLittler has been the inspiration behind a global revolution in the sport over the past 18 months, with hundreds of darts academies now thriving across Britain and the sport particularly booming among children.\n“To be recognised by the King for what I have achieved, and also for my contribution to playing in and promoting the sport that I love, is something that I never thought possible – to say that I’m looking forward to visiting Buckingham Palace is an understatement,” said Humphries, 30.\nMan behind the King’s cypher\nTim Noad, the designer behind the King’s cypher, has been made an MBE for services to calligraphy, heraldry and design.\nHe is a lesser-known recipient on the honours list, as his work has traditionally been anonymous.\nThe 58-year-old, who has worked at the College of Arms for 39 years, was chosen to submit 10 cypher designs for the King to choose his preferred monogram.\nThe designer, who previously studied calligraphy, heraldry and illumination at Reigate College, tried out a range of different styles in the process of creating the iconic cypher.\nReflecting on the honour, Mr Noad, from west London, said he was “absolutely delighted” and “immensely proud”.\nHe added: “My name is quite often not associated with the work I’ve done and I think that is only becoming more regular these days, but I think in the past, traditionally, the kind of work that I do was anonymous really.”\nMeanwhile, a woman who was recognised for her charitable work following the death of her twin brother, said the King’s openness about his cancer diagnosis had been “really good” for men with the disease.\nJenna Speirs, and her parents Caroline and Duncan Speirs, were each awarded a British Empire Medal (BEM) for their work with Calum’s Cabin.\nThe charity, which helps children with the disease spend time away with their families, was founded after Miss Spiers’s brother Calum died of cancer aged 12, in 2007.\nIt is the first time three family members have all been named on an honours list.\nAward for Regeneration trilogy novelist\nAuthor Pat Barker, who is best known for her Regeneration trilogy – including Booker prize-winning The Ghost Road – has been awarded a damehood for her services to literature.\nBorn to a working-class family in the North Riding of Yorkshire, Dame Pat never knew who her father was and she was brought up by her grandparents after her mother left.\nDame Pat began writing fiction in her mid-20s. The Regeneration trilogy, published from the early to mid-1990s, focused on the First World War and dealt with themes such as trauma, sexuality, mental illness and social class.\nElsewhere, Strictly Come Dancing duo Tess Daly and Claudia Winkleman have been made MBEs amid a turbulent few years for the popular BBC reality show.\nDaly, 56, who has co-presented Strictly since 2004, and Winkleman, 53, who also fronts the award-winning TV game show The Traitors, have been honoured for their services to broadcasting.\nWinkleman said she was “incredibly grateful,” saying she will “celebrate with Tess by doing a paso doble”. Daly described the honour as “the greatest surprise” of her life.\nSculptures and ceramics\nThe sculptor behind the Angel of the North has been appointed to the Order of the Companions of Honour.\nSir Antony Gormley, whose iconic steel sculpture was erected in Gateshead 27 years ago, will join an array of notable members including Sir David Attenborough, David Hockney and Sir Paul McCartney.\nThe Turner Prize-winning sculptor said he would accept the honour for services to art with a “profound sense of responsibility and gratitude” to those who had supported and collaborated with him.\nThe Order of the Companions of Honour was founded in 1917 by George V to recognise outstanding achievements in the arts, sciences, medicine and public service. Membership is limited to 65 people at any one time and those who receive it wear the initials CH after their name.\nMeanwhile, Emma Bridgewater has been made a Dame for her services to ceramics.\nDame Emma said: “I’m honoured and very happy about the award; what a marvellous accolade this is – for the people, and the pottery traditions of Stoke-on-Trent! I feel clear that whilst I receive it, they won it, and they so richly deserve such recognition!\n“I feel privileged indeed to have learned about ceramics from the long suffering, resilient and excellent people of Stoke.\nKnown as the “queen of pottery”, Dame Emma already has close ties with the Royal family.\nShe previously launched a range for the King’s Coronation, which included a “three cheers for King Charles” mug.\nSouthport heroes\nNHS responders to the Southport attack have also been recognised.\nThe Southport killer was sentenced to a minimum of 52 years in prison for the murder of three young girls and attempted murder of a further 10 during a Taylor Swift dance class last July.\nPaul Smith, a senior paramedic at North West Ambulance Service, was a first responder and treated the little girls – some as young as six years old – on the scene following the knife attack.\nHe was recognised for prioritising the needs of the injured over his own safety and has been awarded a BEM by the King.\nDr George Bramham was also part of the first-responder team and has been made an MBE, as have Martin Johnson and Elizabeth Parsons, who were part of the surgical team in theatre who treated the children sent to Southport Hospital in the aftermath.\nRev Martin Abrams, a chaplain at the hospital, has also been made an MBE for his services to the community of Merseyside and West Lancashire on a daily basis, but also his role during major events such as the Covid pandemic and as the spiritual and community lead following the tragic events in Southport.\nYoung and old\nAt 106 Norman Irwin is Northern Ireland’s oldest man and recipient on the honours list.\nAs the UK marked the 80th anniversary of VE day last month he was one of a dwindling number of Second World War veterans who could still remember the historic day.\nMr Irwin, who is described by friends as inspirational and a brilliant role model, served in North Africa during the Second World War.\nBorn just a few days after the end of the First World War in 1918, Mr Irwin went on to serve in the Second World War, volunteering in April 1939 to join the Coleraine battery of the Royal Artillery as a gunner. He is the last surviving member of the artillery unit.\nHe was awarded a BEM for services to the community in Coleraine, County Londonderry.\nDavid Irwin, 77, his son, said: “He did find it bittersweet commemorating the 80th anniversary of VE Day. He had a lot of memories of people that he lost during the war.\n“He found the war totally abhorrent and now he just does his bit to try and help people understand what they all went through and hopefully it never happens again.”\nAt the other end of the age spectrum, Carmela Chillery-Watson is the youngest recipient on this year’s list.\nAged just 11, she is the youngest person to have been made an MBE.\nMiss Chillery-Watson, has LMNA congenital muscular dystrophy – a progressive muscle-wasting condition that affects her movement, heart and lungs.\nShe was diagnosed with the condition in 2017, aged three, and in recent years has helped charity Muscular Dystrophy UK raise more than £400,000 by doing around 25 fundraising and awareness campaigns.\nDetermined to help others with muscular dystrophy and similar conditions, she gained thousands of supporters during lockdown as she showed others her physiotherapy exercises as an alternative to workouts with fitness coach Joe Wicks.\n“I’m just really ecstatic and surprised that I’m receiving the honour,” she said, reflecting on the award.\n“It’s incredible.”\nHer mother Lucy Chillery-Watson, 49, said: “I’m bursting with pride – it’s insane.”\nShe added: “Carmela just wants to help others, she’s got very old shoulders for a little kid and she’s very caring.”\nEveryday heroes\nMembers of the public who have dedicated their lives to extraordinary causes were also recognised in the honours list.\nAmong them is Charlotte Charles, the mother of Harry Dunn.\nMr Dunn, a motorcyclist, was killed aged 19 after a “head-on collision” with Anne Sacoolas, the wife of a US diplomat, who was driving on the wrong side of the road near RAF Croughton in August 2019.\nMs Charles, who has campaigned relentlessly in the wake of her son’s death, has been made an MBE for services to road safety.\nGeoffrey Roberts, who fought in the Battle of Arnhem, was also made an MBE just weeks before his 100th birthday.\nThe veteran, from Peterborough, was given the honour for services to the commemoration of the Second World War battle and to charity.\nMr Roberts’ daughter, Claire Welburn, said her father had been surprised when he found out about the news but added that he says he is one of “the lucky ones” and that the “the heroes are the ones lying in the cemetery”.\n“His first words actually were ‘I’m not very happy about that’,” she said.\n“It’s taken him a while to come to terms with it, because he always says, ‘I didn’t do anything’.\n“I keep saying to him, ‘it’s not about what you did in the war, dad, it’s about what you’ve done since, it’s about your act of remembrance’.”\nMeanwhile, the daughter of an MP murdered in the Brighton bombing 40 years ago said she was “deeply honoured” to be made a CBE.\nJo Berry, 67, founded charity Building Bridges for Peace in 2009, as part of her work to campaign for reconciliation in the wake of Sir Anthony Berry’s death.\nThe former Conservative MP for Enfield Southgate was killed when a bomb tore apart the Brighton Grand Hotel, where Margaret Thatcher and members of her cabinet were staying while the Conservative Party conference took place.\nThe bomber, IRA member Patrick Magee, was handed eight life sentences at the Old Bailey in 1986, with a recommendation he serve a minimum of 35 years.\nHe was released in 1999 under the terms of the Good Friday Agreement.\nTwo days after the bombing, Ms Berry, who was 27 at the time, embraced peace rather than hatred and as part of her work she met Magee in 2000.\nSince then they have appeared together at events hundreds of times.\nAccepting the CBE for services to peace and reconciliation, she said: “When I read the letter I was in shock, such a surprise. I’m deeply honoured to receive this award.”\nMs Berry added: “For me it’s about everyone who’s supported me on my journey to help me achieve what I’ve achieved.\n“I also see it as for everyone who’s chosen empathy over hatred.”\nMark King, founder of the Oliver King Foundation, has been made an OBE for services to public health.\nThe foundation, which Mr King set up following the death of his son who died from a sudden cardiac arrest while competing in a swimming race at school, aims to roll out defibrillators to every public building.\nIn 2023 Mr King welcomed confirmation from the Department for Education that defibrillators had been installed in all schools that did not previously have one.\nPooja Kanda, whose 16-year-old son was murdered with a ninja sword yards away from his Wolverhampton home, has been made an OBE, while Alison Madgin, the mother of 18-year-old Samantha Madgin, who was knifed to death in Wallsend, has been made an MBE alongside her daughter Carly Barrett.\nReflecting on the honour, Ms Barrett said: “It was quite bittersweet, obviously we’ve had to lose Samantha to receive it and it was her I wanted to tell.”",
  "word_count": 3415,
  "scraped_at": "2026-02-14T12:49:54.864008"
}