{
  "article_id": "240b5e5cf0f6",
  "url": "https://wtug.com/ixp/532/p/west-alabama-friday-briefing-86/",
  "title": "West Alabama Friday Briefing",
  "date": "20250124T210000Z",
  "domain": "wtug.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "West Alabama Friday Briefing\nGood morning West Alabama. It is Friday, January 24, 2025. It is the 25th day of the year with 340 remaining.\nFriday Morning Observations:\nThe 10th ranked Alabama Gymnastics Team has a golden opportunity to jump squarely in the national spotlight tonight. Number one ranked Oklahoma will be at Coleman Coliseum for a Friday Night Heights matchup on the SEC Network. It is the SEC home opener for the Crimson Tide.\nIn its first-ever Southeastern Conference competition, the Oklahoma women's gymnastics team earned a 197.775-196.750 victory over then No. 10 Missouri last Friday night inside Lloyd Noble Center in Norman.\nThe Tide opened the season as one of the few teams to earn a 197-plus in 2025 in a 197.025 victory over North Carolina. Kicking off SEC competition in Kentucky, the Tide fell to the Wildcats 197.300-196.100.\nBama and the Sooners have faced off in either regular season or postseason competition every year since 2006. In that stretch, the Sooners lead the series 27-10 and have won 23 straight meetings. This will be the first trip to Tuscaloosa for the Sooners since winning the 2021 Tuscaloosa Regional.\nThis is one of those meets the Tide needs a packed house. Tonight is Be the Change/Alumni Night.\n- Be the Change: Recognized during pre-meet festivities all season long, the honorees are individuals within Alabama Athletics and the Tuscaloosa community who have made a lasting impact on the Alabama gymnastics program, and embodies the program's Fierce Joy culture\n- Alumni Night: The program's alumni will be celebrated for their return to The Capstone during pre-meet festivities, with a special recognition highlighting the anniversaries of the 1995, 2000 and 2015 SEC Championship-winning teams.\nTickets are still available for tonight's meet. Click HERE.\nMeet Day information HERE.\nA Crimson Tide win tonight would position Bama to move up in the rankings and give the team a solid foundation for the rest of the season. Let's pack the house.\n(Opinions expressed in Morning Briefing are those of the author and are not necessarily those of the ownership, management, staff or sponsors of Townsquare Media Tuscaloosa.)\nWeather:\nToday will be another rollercoaster ride for temperatures. Variable cloudiness during the day will be accompanied by highs in the mid 40s. But clear skies tonight will see another night of subfreezing readings in the low 20s.\nThe warmup will take hold over the weekend with day and night temperatures remaining above freezing and daytime highs by Tuesday in the low 60s.\nWest Alabama continues to suffer from Abnormally Dry to Moderately Dry conditions according to the Current U.S. Drought Monitor. All of Marengo County continues in Severe Drought.\nThe Sumter County town of York is encouraging residents to boil their water this morning. Due to problems at York’s main well, a citywide outage is resulting in low water pressure across the water system. The city hopes to have the water system repaired by this afternoon.\nIllegal Weapons Found in Northport Narcotics Raid\nWest Alabama Narcotics Task Force raiding a residence on Barnes Settlement Road in Northport found a hand grenade, illegal firearms, methamphetamine and more Wednesday.\nPolice found and detained nine different men and women inside the home, including a 22-year-old Brandon Mccraw, who was in a garage that had been converted into a bedroom.\nRead More: Police Find Hand Grenade, Illegal Guns During Northport Narcotics Raid\nChamber of Commerce Honors\nThe Chamber of Commerce of West Alabama held their 124yh annual dinner and awards presentation at the Bryant Conference Center last night. The night's biggest honor is the Charles H. Land Member of the Year Award, which was given to Tim Harrison of Harrison Construction Company.\nRead More: West Alabama Chamber Honors Community Leaders at Annual Dinner\nUpdating Teacher Certification\nThe Alabama State Board of Education is re-writing outdated state teacher certifications. The certifications set a statewide standard for colleges with teacher training. State School Superintendent Dr. Eric Mackey told reporters the current certifications do not match advances in teaching core classes like math, reading and science.\nUA is one of 24 colleges and universities in Alabama that recommends teachers for certification.\nTuberville Optimistic Trump will Move Space Force HQ to Huntsville\nAlabama's Senior Republican U.S. Senator Tommy Tuberville is voicing confidence that President Trump will move the U.S. Space Force Headquarters from Colorado Springs to Huntsville.\nHuntsville scored higher than any other location for placement of the U.S. Space Force Headquarters, but the Biden Administration selected Colorado Springs, home to the Air Force Academy. Huntsville is known as the \"Rocket City\" and is home to NASA's Marshall Space Flight Center and the Redstone Arsenal.\nSpace Force HQ would bring thousands of jobs and contribute nearly a billion dollars annually to Huntsville's economy. Tuberville is predicting the White House will have an announcement in coming days.\nLegislative Bill Would Improve Alabama Pre-Natal Care for Women\nThe next Alabama Legislative session begins in less than two weeks and the prefiled bills are piling up in the hopper. One of them is House Bill 89, also known as the Alabama Maternal Healthcare Act; it would extend presumptive Medicaid eligibility to pregnant women.\nCurrently 11-percent of pregnant women in Alabama do not receive prenatal care.\nThe bill has received bipartisan support.\nAlabama Power Grant Helping Greene County Students\nStudents in Greene County now have free rides to and from the County's career center thanks to a grant from Alabama Power and the West Alabama action group. Officials call the grant a game changer.\nThe board of education stated transportation can be a huge barrier for students in rural Alabama who are looking to pursue technical and trade opportunities. Bryan Davis, a senior at Greene County high school. He says the rides will help him complete dual enrollment classes at Wallace State.\nThe grant will help expand the dual enrollment program in Greene County.\nMcAbee Contract Work at BSI\nMcAbee Construction, Inc. of Tuscaloosa was awarded a contract back in September for work at Birmingham Shuttlesworth International. Their winning bid was $691,596.\nMcAbee conducted an equipment replacement operation that involved a helicopter lifting, transporting, and lowering cooling towers in various locations at the airport.\nDue to the location of the cooling towers and the weight of the units, a helicopter known as a Sikorsky S-64 Sky Crane was used to complete the mission. McAbee was required to coordinate all activities including safety plans, traffic control, and the actual disconnecting and installation of piping, electrical, and programming for the new unit.\n“This project was not your everyday equipment replacement,” said Matthew Nelson, Vice President of Facilities for the Birmingham Airport Authority. “Replacing the cooling tower required a highly specialized operation with a lot of attention to detail,”\nA press release from BSI includes a link to a video of the work being done.\nTopping Sports News:\nBrandon Miller's Rookie Year Over\nFormer Crimson Tide basketball forward Brandon Miller has had a tremendous start to his NBA career, but it has come to a screeching halt due to a season ending injury.\nThe Charlotte Hornets announced on Thursday that Miller underwent surgery to repair a torn scapholunate ligament in his right wrist, ending his season.\nRead More: Former Alabama Forward Undergoes Season-Ending Surgery\nIt is \"Retro Night\" for Bama Men's Basketball Against LSU in Prime Time Tomorrow\nIt is \"Retro Night\" Saturday night for the Crimson Tide Men's Basketball team. Bama will be wearing throw-back uniforms. They are Alabama’s second throwback uniform of the season and third in as many years. It’s the inverse of last year’s white home jersey, this one being crimson with white letters and numbers. “Crimson Tide” stretches across the front of the jersey, above and below the player’s numbers, while the classic block A with an elephant is on the shorts’ right leg.\n#4 Alabama (1-3 overall, 5-1 SEC) will host LSU (12-3 overall, 1-4 SEC) at 7:30 in Coleman Coliseum.\nLSU comes to Tuscaloosa averaging a total of 79.7 PPG offensively this season, while also allowing 69.6 points per game to opponents. LSU’s most notable stat is likely their 5.4 blocks per game, which ranks No. 11 in all of college basketball.\nYou can see the game on the SEC Network and be heard on the Crimson Tide Sports Network (95.7 The Bear, Tide 100.9 and 1230AM WTBC).\nTide Football Sets A-Day Game\nBama Football fans will get their first chance to view to the 2025 Crimson Tide Football Team during the Golden Flake A-Day Spring Game scheduled for Saturday, April 12 at Saban Field at Bryant-Denny Stadium.\nThis will be Head Coach Kalen DeBoer's second spring training and the final practice of spring drills.\nKickoff time and other game day information will be released at a later date.\nClick TuscaloosaThread.com for the latest West Alabama news, sports and weather. Better yet, download the app.\nHave a wonderful warmer weekend and ROLL TIDE!",
  "word_count": 1479,
  "scraped_at": "2026-02-14T14:16:13.792247"
}