{
  "article_id": "2414df19e5d9",
  "url": "https://www.uefa.com/returntoplay/news/027f-17946543f954-509f73a2f145-1000--driving-development-at-regional-club-licensing-workshops/",
  "title": "Driving development at regional club licensing workshops | Inside UEFA",
  "date": "20230322T024500Z",
  "domain": "uefa.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Driving development at regional club licensing workshops\nMonday, March 20, 2023\nArticle summary\nLocalised events bring licensing community together to share progress and highlight system's successes.\nArticle top media content\nArticle body\nDenmark, Liechtenstein and North Macedonia have each hosted all-important UEFA regional club licensing workshops in recent weeks.\nThe workshops provided the opportunity for all 55 of European football's member national associations to receive updates from UEFA and learn about some of the best practices and case studies from across the game.\nEach of the three host associations highlighted the progress made in various aspects of club licensing, sharing specific national initiatives they have adopted with a top-division club also sharing how they have benefited from the system. HB Køge from Denmark, Liechtenstein's FC Vaduz and FK Rabotnički from North Macedonia presented their achievements in various fields of work, including social responsibility, financial matters, community and youth football.\nAleš Zavrl, UEFA head of club licensing:\n\"These gatherings provide an ideal platform to exchange views and brainstorm ideas on how club licensing and financial sustainability processes can continue to be an important part of our joint activities for the better governance and financial sustainability of European club football.\"\nDuring each of the sessions, representatives addressed the importance of the evolving digitalisation of the club licensing processes to ensure more efficiency of the system for the benefits of licensors and clubs.\nThe gatherings follow the publication of UEFA's latest European Club Footballing Landscape report, its annual club licensing benchmarking study on European club football. Focused on the game's emergence from the pandemic, its key topics and learnings were presented to the participants at the workshops.\nThe report again provides the most authoritative, detailed, and comprehensive review of the European football finance landscape, competition landscape and players landscape, and this year’s edition focuses closely on how European top-division clubs have emerged from the COVID-19 pandemic.\nUEFA's club licensing system\nUEFA is a global pioneer of the club licensing system and we aim to promote good governance in club football throughout Europe, continuously developing the system in consultation with its stakeholders to adapt to the ever-evolving landscape of European football.\nThrough the UEFA Club Licensing and Financial Sustainability Regulations and the UEFA Club Licensing Regulations for the UEFA Women's Champions League, UEFA sets the requirements clubs must meet in order to participate in our club competitions.\nThe system is based on a number of principles, including equal treatment to ensure that all clubs, no matter their size or financial capability, are treated the same across the board.\nBased on the principle of subsidiarity, UEFA's 55 member associations or their affiliated leagues act as the decision-makers when it comes to licensing clubs. However, the member associations are given a certain amount of flexibility in terms of how they implement the licensing system in order to allow them to adapt the system to the local environment in which football operates.\nUEFA has a fundamental role establishing the regulations and the minimum criteria, but also in the training and education of national associations and clubs, and assists them to ensure the system is successfully applied.",
  "word_count": 519,
  "scraped_at": "2026-02-14T12:44:55.485665"
}