{
  "article_id": "2418376b2191",
  "url": "https://www.westernpeople.ie/your-community/local-notes-enjoying-the-chat-at-kilkelly-festival-_arid-71188.html",
  "title": "Local Notes : Enjoying the chat at Kilkelly Festival . - Community",
  "date": "20250924T184500Z",
  "domain": "westernpeople.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "There was no winner of the Charlestown Sarsfields GAA lotto jackpot of €18,500 in the weekly draw held on Sunday, September 14, and the following were the four numbers drawn;1, 2, 17 and 30. The winners of the 2 x €50 weekly prizes were Michael Morley and Padraig Kivlehan. The latest jackpot increased to €18,600 and the draw was held on Sunday, September 21.\nSign up now for ballet classes that inspire confidence and creativity in your little ones. Ballet classes for children age 3 + with a qualified instructor, who is supportive and creative in local venues. For more information and to book 089 407 9074.\nA silent protest takes place every Friday evening on the N17/N5 Overpass from 6-7pm with numbers growing week on week as the horrors of what continues to unfold in Gaza impacts on more and more people across the country. Many have been moved to take action via protests of one form or another and the silent protest taking place at the above overpass is another indication of the depth of feeling and anger that’s out there as the people of Gaza suffer untold hardship and loss of life which is stirring up lots of emotions and outrage in people acoss all strands and facets of the community.\nCharlestown Sarsfields senior ladies made their exit from the county senior championship when they were defeated by defending county champions Westport in the final round of group games played at the Westport GAA grounds recently.\nWestport came through on a 2-9 to 1-5 score line and qualified for the semi-finals having topped the group with the Sarsfields having already secured their senior status by virtue of their round 2 victory over Castlebar Mitchels.\nThe ladies were faced with a tough task in trying to take down the champs in their own backyard with the Westport ladies firm favourites to retain their title as they have been the form team all season. The Sarsfields were commendable in the way they went about their job however as, despite the final score line, they more than made a match of it as they posed plenty of problems for a Westport side that had to call on all their class and talent to see off the doughty and cussed challenge which the green and white ladies presented.\nThe game was played against a backdrop of wet and windy conditions which mitigated against any free flowing football but the home side had that bit of extra penetration and scoring ability in their forward line which proved pivotal to the final outcome. The Sarsfields kept battling away despite the odds being stacked against them but the hill became ever steeper after the interval as Westport pulled away a glut of scores in the middle part of the half.\nShona Mahon goaled for the Sarsfields late on to provide some solace and consolation for their second half endeavours but Westport ran out worthy winners with the Sarsfields delighted to secure their senior status as they had Castlebar Mitchels on the head to head who now face into the relegation play-offs with the Sarsfields focusing all their attention on a shield final showdown with near neighbours Kilmovee.\nSinead Halligan and her management team can be pleased with their overall championship performance with the opening round defeat to Carnacon, perhaps, the one that got away as the ladies never really got to the pitch of the battle on the day. They more than atoned, however, in their next outing against Castlebar as they eked out a result against the odds some might say to secure their senior status for 2026 with a lot of new, young players being introduced and being exposed to senior championship football for the first time. This can only augur well for the years ahead with all minds now turning to the small matter of a shield final and a clash with Kilmovee Shamrocks which always gets the sap rising with the ladies keen to finish the season a high note if nothing else.\nWomen`s Box-Fit classes (fun fitness for all ages and levels) take place every Wednesday at the Charlestown Boxing Club headquarters (Old Cloonfane School) from 7.30-8.45pm. The cost is €60 per an eight week block or €10 per session (pay as you go). The instructor is Keely Stevens, five times national champion. Call 089 4977388 for more details.\nYoga classes with Tish takes place in the Charlestown Arts Centre on Tuesday nights at 7.15pm. All are welcome.\nSt Joseph’s Community, Charlestown, take on St Joseph’s College, Foxford, in the Post-Primary Flanagan Cup D Championship at the Moy Davits GAA grounds on Wednesday, September 24, with the throw-in timed for 12.30pm.\nRegistration for all teams for the coming 2025-2026 season playing under the banner of the Charlestown Cubs Basketball Club is currently open and can be accessed by logging onto the Charlestown Cubs Basketball Facebook page and following the necessary links.\nSalsa dancing classes continue in the Town Hall Arts Centre on Wednesday from 7.30-8.30pm and all are welcome.\nThe Charlestown Organic Community Garden remains open to the general public on Wednesday and Saturday afternoons and is well worth checking out as they have a splendid array of flowers and vegetables on display with the place looking serene. The volunteers have done a terrific job all summer and deserve all the support they can get with the new raised beds a huge addition to the place.\nCongratulations and best wishes are extended to David Caffrey, son of Sean and the late Kathleen Caffrey, Brackloon, Charlestown and Sarah Duffy, daughter of Padraig and Mary Duffy, Rooskey, Charlestown on their wedding which took place in Malaga, Spain recently. David and Sarah are wished every good wish for the future, health and happiness and many years of wedded bliss.\nA 4 week flower arranging class with Angela Tansey will begin at Carracastle Community Centre on Wednesday, September 17, at 7.30pm. €10 deposit required and booking is essential. Contact Angela at 087 6039449 to confirm your place and for more information.\nFor knitters, crocheters, hand stitchers, embroiderers, from beginners to experts, whatever your fabric art may be, Yarn Tales is the place for you. The group meet every Thursday from 10.30am-1pm at the Charlestown Art Centre. For more information contact Pamela on 089 4795664.\nThe next Community Coffee Morning takes place on Friday, October 3, in the Arts Centre from 11am-1pm. Lift access is available and all are welcome for a cuppa and a chat.\nA marriage enrichment weekend takes place in The Focolare Centre, Curryhills, Prosperous, Co.Kildare from November 7-9. The course is open to all married couples, and for more information/booking www.marriageencounter.ie.\nCharlestown Sarsfields U17 team lost out to Tourmakeady in the latest round of fixtures played in division 2 of the U17 grading league played at Fr O’Hara Park recently. The West Mayo lads prevailed on a score line of 2-16 to 1-15 with the result just about a fair reflection as the visitors came on strong in the closing stages to eke out the win.\nThe Sarsfields were missing Sean Breheny from their starting line-up and he was sorely missed as he brings so much to the pitch when he’s fit and well.\nThe game was balanced on a knife-edge throughout with never more than a score between the teams at all times but Tourmakeady made their push for victory in the latter stages of the second half with a 1-3 blast putting some daylight between the teams for the first time in the match.\nThe Sarsfields rallied with Shea Haran cracking home a terrific goal in the dying embers but it came too late as the Gaeltacht men managed the game out well to the final whistle to seal a good victory with the Sarsfields left to rue some missed chances and turnovers which hindered their overall performance. They battled well however and still have a chance of making the play-offs if victory can be secured in their remaining games.\nMayo Genealogy Group will hold their AGM at the next meeting which will be held at the Museum of Country Life, Turlough at the October meeting on Saturday, October 11, at 11am. Everyone interested in genealogy, family trees, DNA, history, folklore, or local history is welcome to attend any of the meetings which take place on the second Saturday of each month.\nThe Genealogy Group and friends have organised a two-night three day outing to Donegal/Derry area from Wednesday, October 8 to Friday, October 10. Spaces are still available, so for anybody interested contact Mary on 086 1280338. This is sure to be an interesting and enjoyable trip.\nDrama Club meetings have resumed in the Arts Centre on Thursday nights at 7pm and new members are most welcome.\nSympathy is extended to Darragh McMeel, Bellaghy, Charlestown, on the death of his father Eugene McMeel, Warrenpoint, Co. Down, which occurred recently. Deepest condolences are tendered to the bereaved.\nCharlestown Sarsfields edged out near neighbours Swinford in the latest round of fixtures in division 3 of the U15 grading league with a narrow 2-12 to 3-8 victory in a cracking contest played at Fr O’Hara Park recently. The Sarsfields had to go deep to secure the victory with the visitors matching them score for score in an end to end encounter that provided plenty of thrills and spills for both sets of managements and spectators. The Sarsfields were delighted to get over the line with this victory keeping them in the shake-up for qualification for the play-offs.\nIntensive group sessions to prepare for the 2026 State exams which covers all Junior and Leaving Certificate Maths topics. Focus on exam strategy, timing and confidence building. A new topic every week will be covered. Consistent attendance means better results. Small group sizes for personalized support. It is perfect for students who want to boost grades and deepen understanding. Classes are held at Kilkelly Trimoige Community Centre on Saturday mornings. The cost is €30 per 90 minute session. There are limited spaces so early booking is essential. Email : PHMathsgrinds@outlookcom for more information.\nThere was a good turnout at the first bridge game of the season held in Walsh’s Bar, Main Street, Charlestown, on Wednesday, September 17, and the following were the prizewinners; 1st Hilary McDonagh and Tom Ginty, 2nd Frances and Robert Heaky, 3rd Michael and Pat Brennan, 4th Tom Dunne and Mary Lynskey.\nThe game takes place every Wednesday at 8pm in Walsh’s Bar, Main Street, Charlestown and new members are most welcome.\nThere was a good turnout at the weekly 25 card game held at the Yeats County Inn, Curry, on Tuesday night, September 16, at 9pm, and the following were the prize winners; 1st Teresa McIntyre and Veronica McCarrick, 2nd Joe Mahon and Kevin Maloney. Raffle winners were; Mary O’Hara, Veronica McCarrick and Vera Scally.\nA chiropody clinic will be in O’Donnell’s Total Health Pharmacy, The Square, Charlestown on Wednesday, October 1. To book an appointment call 094 9254177. Services include professional nail trimming, com removal, fungal advice, verruca treatment, callus removal and full feet check-up.\nCharlestown Cubs Basketball are looking for new volunteers for the coming season. They are looking for enthusiastic people to help make this basketball season a success. No experience is necessary – just bring your energy and a willingness to help. Opportunities include coaching support, fundraising activities, team assistance et al... People/volunteers are welcome for all age brackets. Whether you can commit a little time or a lot, your support will make a difference for the club’s players and the community. Contact the club via the Charlestown Cubs Basketball Facebook page for further information.\nJude Walsh from the Mayo Beekeepers Association will be giving a live demonstration and talk on beekeeping from 2pm-4pm on Saturday, September 27, at the National Museum of Country Life, Turlough Park, Castlebar. Discover the world of bees at this engaging event – perfect for nature lovers, families and curious minds of all ages. Admission is free. Booking is required. Telephone +353949031751or email bookingscountrylife@museum.ie.\nClaremorris Further Education Centre are offering classes involving upskilling in literacy, numeracy and computers Monday and Thursday every week, from10am-2pm. For more information contact 094 9362762 or alternatively email infoeastsouthmayo@msletb.ie.\nThe Annual Croi Night Run sponsored by Benecol is coming to Charlestown on Friday, October 17. Register at croinightrun.ie and complete your 5km your way - walk, jog or run - with all funds going towards Croi’s fight against heart disease and stroke. Go to croinightrun.ie and select register - ‘Take part in your Area’. Fill in your details and select ‘Join a Run’, select (East Mayo AC Track) from the drop-down. Complete form. Let`s light up the country together with the electric energy of the Croi Night Run.\nThe Adult Arts and Crafts Group meet every Wednesday from 11am-1pm in the Charlestown Arts Centre Barrack Street.All are welcome.\nCongratulations and best wishes are extended to Ray Lenehan, Airport Road, Charlestown, who reached Hawaii-50 recently. Ray ushered in the number 50 in typically low-key fashion with little or no fuss had or created. It would have been remiss of me, however, not to give him a few lines as another member of the county and Connacht championship winning team has reached the half- century mark and in right good fettle too, he is, might I add. Ray lined out at full-back in the Sarsfields historic successes of 2001 and was a lionhearted defender who defended his patch with tigerish determination as he went toe to toe with the best club forwards in the game with very few getting the better of him it must be said. He always kept himself in great shape and was a real pillar in the backline who led by example as he attacked from the front and made many inspirational clearances in his pomp. He gave good service to the Sarsfields for the best part of a decade and more and was always consistent in terms of his performances especially when he was at the top of his game.\nThe years have been kind to Ray as he still looks like he could make the weight in the 4.30 at Leopardstown with not a spare gram to be seen on the waistline with running and golf just two of his twin passions. He strikes a mean ball off the tee by all accounts and is well capable of booming that ball for miles down the fairway and has created quite a reputation for himself on the golf circuit with as he grows in stature with the driver and putter respectively.\nI’m not sure he’ll take too kindly to these few lines but he can always blame his brother Val who tipped me off but suffice to say he’s in mean shape as he takes his place in the fifty club and joins a very celebrated cast indeed with several more high profile having turned or about to turn onto this very significant number. I’m sure Val and the rest of the crew produced a cake to commemorate the occasion with all fifty candles standing proudly on every square centimetre of the delicious offering. One thing for sure Ray had little difficulty extinguishing the flame as just one mini-breath would have sent those candles high into orbit. Here’s hoping he embraced the occasion in full and wishing him continued good health and happiness into the future and many more celebrations of this nature in the years ahead.\nSenior strength and conditioning classes are held at Carracastle Community Centre on Wednesday mornings at 11am. Chair based exercises and light weights are used. For more information and to book your place, contact Sarah at 086 3879635.\nLiving Well is a free HSE programme which helps people living with a long-term health condition to manage their condition and improve their overall well-being. Anyone with chronic illness such as diabetes, arthritis, COPD, cardiac illness, anxiety, etc. can benefit from these workshops. A new programme commenced in Claremorris Primary Care Centre on Wednesday, September 17 from 10.30am-1pm, continuing weekly at that time for six weeks. Places are free but advance registration is required. To find out more, contact Liam Gildea on 086 014 2575 or by email at lgildea@southmayo.com.\nDance classes with Gina continue at Carracastle Community Centre on Wednesday evenings at 8pm. Learn to jive, waltz, quickstep and line dance. €10 per person. For more information and to book contact 085 7704647.\nThere was no winner of the Curry GAA lotto jackpot of €3900 in the weekly draw held on Monday, September 15, and the following were four numbers drawn on the night; 2, 13, 22 and 23. The following were the winners of the €20 weekly prizes; Esme Gilligan, Darby Leonard Jnr and John A. Kennedy. The latest jackpot increased to €4000 and the draw took place on Monday, September 22.\nThe 30th anniversary of the Carracastle Lass takes place on Saturday, October 18, at 8pm in Carracastle Community Centre. If you would like to sponsor an entrant (aged over 18) to represent your business/company, contact 086 1660196 or email carracastlelass@gmail.com for more information.\nAlone is a national organisation that enables people to age at home. They have a National Support and Referral Line for older people. If you are in need of advice, support or information, call 0818 222 024, seven days a week from 8am -8pm.\nSenior Line is Ireland’s national telephone service for older people open every day of the year from10am-10pm. Freephone 1800 80 45 91. Callers may feel isolated, alone and may wish to discuss a problem in confidence, or for company during the day. Senior Line’s older volunteers are trained to listen, to support, to discuss options and to refer callers to other helpful services, if necessary. Senior Line 1800 80 45 91 is open every day of the year at the above times.\nThere was a good turnout at the weekly darts competition held in Walsh’s Bar, Main Street, Charlestown, on Sunday, September 14, as The Duke and Boom Boom scrapped it out in another epic instalment of the weekly classic. Governor Gus was immense as ever in his role as match referee ensuring both men towed the line impeccably. Boom Boom surged out of the blocks and had the first two sets tucked away in the blink of an eye such was his accuracy and precision among the trebles and doubles. The Duke found his range in sets three and four and powered his way with some sizzling darts.\nThis set the crowd up nicely for a fifth set decider and it didn’t disappoint as it went all the way to a sudden death shootout with the Duke once again clawing his way back from the brink with a full double top finish raising the roof as Boom Boom looked poised to collect with double sixteen at his mercy. Boom Boom made the better start in the sudden death leg but a maximum from the Duke narrowed the odds considerably with both men reaching the double simultaneously. Breheny had first peg at the double but his final dart grazed the wire of the double eighteen bed which allowed the Duke a look at a check-out of 68. He nailed treble twelve with his first dart, paused before fixing that beady stare of his at double sixteen as a hush descended on the auditorium. He released the dart and it never deviated from its intended path, landing plum in the centre of the green bed to set off wild scenes of celebration.\nBoom Boom was stunned as his jaw hit the floor but credit to him he raised the hand of the victorious Duke aloft and was most gracious and sporting in defeat. The Duke strode to the winner’s podium in typically swashbuckling fashion and took the acclaim of his large band of supporters as he celebrated his sixth victory of the season. A grandstand finish to a terrific final and one which made for a great spectacle for all lucky enough to witness and be present for it.\nInformation Classification - GREEN: Unrestricted",
  "word_count": 3346,
  "scraped_at": "2026-02-14T12:36:23.787096"
}