{
  "article_id": "243b8aef40cf",
  "url": "https://www.90min.com/alessia-russo-incredible-to-have-wsl-players-trading-cards",
  "title": "Alessia Russo : It incredible to now have WSL players on trading cards",
  "date": "20250306T233000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Alessia Russo: It's incredible to now have WSL players on trading cards\n- The first ever Barclays WSL Adrenalyn XL trading cards by Panini hit UK shelves\n- Alessia Russo is among five Golden Ballers in the 360-card set\n- Arsenal & England striker wasn't able to collect female players growing up\nArsenal and England striker Alessia Russo grew up collecting football stickers and trading cards, just like most other young fans and aspiring future players.\nBut at that age, the players that Russo was collecting and swapping were all male stars.\nEven for someone born in 1999, who has been fortunate enough to enjoy a professional career from day one – unlike many older teammates, visible female football stars weren't part of her childhood.\nPlayers like Kelly Smith, Alex Scott, Rachel Yankey and Jill Scott were superstars to those dedicated few who knew women's football, but it was a very small market and the game hadn't yet permeated the wider cultural space where those players also existed in people's minds beyond sport itself.\nThe rapid growth of women's football in England in the last few years, pushed by the progressive on-field success of the Lionesses since 2019 and exploding in 2022, has also been accelerated by the increased visibility of the players themselves, in marketing, merchandise and media appearances.\nPanini has been a driver of that, first with success of official Barclays WSL stickers albums since last season, and now the launch of the first ever WSL Adrenalyn XL trading cards from the iconic brand.\n\"I used to collect Panini cards and stickers and trade them in the playground when I was younger. It's nice that that women's football is involved in this now. I'm so grateful to be a part of it all,\" Russo said to mark the new collection going on sale this week.\nIn the collection of 360 cards, Russo is one of five Golden Ballers, the most desirable items to find, alongside the likes of Chelsea's Lauren James and Manchester United's Grace Clinton.\n\"To be in the collection as a Golden Baller, it’'s not something I envisaged. But it's great, and I'm so grateful,\" Russo said.\n\"I remember trading male cards when I was a kid, and to have WSL cards and female cards, it's incredible. It's more visibility for the game and shows that football is a place for everyone.\n\"[Panini’'s] involvement in the women's game is great. Trading cards when you're a kid is kind of where your love for football comes. And I know when I was younger, I used to love getting new sticker books and collecting them. To have the women's collection our game now is great.\n\"Hopefully it can go on to inspire more girls in future generations.\"\nAlessia Russo was speaking to OneFootball at the launch event for the Panini Barclays Women's Super League Adrenalyn XL Trading Card collection. The album is available now in UK retailers!",
  "word_count": 489,
  "scraped_at": "2026-02-14T12:23:09.587680"
}