{
  "article_id": "243b51799d74",
  "url": "https://www.theguardian.com/australia-news/2025/feb/16/with-a-cost-of-living-election-to-fight-dutton-strikes-a-delicate-balance-on-the-trans-debate",
  "title": "With a cost - of - living election to fight , Dutton strikes a delicate balance on the  trans debate  | Peter Dutton",
  "date": "20250215T201500Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "When Peter Dutton called a rare Canberra press conference on Tuesday to respond to Donald Trump’s tariffs strike, the opposition leader may well have been expecting questions about another matter close to home.\nA day earlier, a clear majority of the Coalition’s 30 senators supported Pauline Hanson’s call for a parliamentary inquiry into the “human cost of experimental child gender treatments”, such as puberty blockers.\nThe motion was soundly and predictably defeated in what is a left-leaning Senate.\nBut the sight of 18 Liberal and National senators siding with the One Nation leader sent a message: trans issues are not a preoccupation of a fringe minority but rather an increasingly mainstream concern inside the Coalition party room.\nAsked at Tuesday’s press conference if he had sanctioned his colleagues’ stance, Dutton confirmed Coalition senators were granted a conscience vote on Hanson’s motion, meaning even shadow ministers could decide their own position.\nHe left it there, eager to shift to another topic.\nThe response was indicative of Dutton’s wider approach to managing this front of the culture wars. He doesn’t want to give oxygen to a potential distraction; not with a cost-of-living election to fight in the coming months.\nBut nor is he gagging or explicitly rebuking his Liberal colleagues who do. It is a delicate balancing act, one seemingly designed to preserve hard-won party unity without jeopardising his election hopes.\nDutton has adopted a different approach on abortion rights, swiftly shutting down the debate as soon as it threatened to erupt late last year.\nLiberal insiders believe Dutton is right to avoid trans issues.\nGhost of Deves and force of Coalition’s hard-right\nBut some worry the actions of the Coalition’s hard right forces are undermining him, leaving the party exposed to a repeat of the controversy that plagued Scott Morrison’s 2022 election campaign.\nThe party paid the price after Warringah candidate Katherine Deves’ old comments describing trans children as “surgically mutilated and sterilised” resurfaced during the campaign, damaging Liberal MPs in nearby seats under siege from teal independents.\n“It threw rocket fuel on the fire, energised our opponents and confirmed what people thought about us,” one Liberal source told Guardian Australia.\nThe Deves saga followed a divisive and harmful debate over religious discrimination laws, which ended with five Liberal MPs crossing the floor to support protections for gay and transgender students.\nIn the postmortem to the 2022 election, the Liberal senator and prominent moderate Andrew Bragg suggested the “very regrettable”, “very undignified” and “very hurtful” episode should serve as a lesson for his party.\n“I don’t think people want the Liberal party to go there,” Bragg told ABC radio at the time.\nIn the three years since, momentum for the Liberals and Nationals to go there again has built inside the parties’ grassroots membership, the backbenches of parliament and on nightly Sky News panel shows.\nThe transgender debate has centred on two areas: the campaign to “protect” women’s sport from transgender athletes, and the case to review or ban medical treatments for children with gender dysphoria.\nHanson has long agitated for inquiries into gender treatments, but last week’s motion was the first since her home state of Queensland banned the administration of puberty blockers for new patients while it reviews the treatment.\nWithin days of the Queensland announcement, the federal government tasked the National Health and Medical Research Council (NHMRC) with developing new guidelines for the care of children with gender dysphoria.\nHanson wanted the treatments subjected to a parliamentary inquiry that would hear testimony from individuals who went through them, and parents who were “pressured, misled or denied” the right of consent.\nThe inquiry would also consider the case for a national ban on gender-related medical interventions for under-18s, according to the proposed terms of reference.\nAmong the 18 senators who agreed was the Coalition’s most senior senator, Michaelia Cash, fellow shadow cabinet members Bridget McKenzie, Perin Davey, Jacinta Nampijinpa Price, Jonno Duniam, Susan McDonald and Claire Chandler, along with high-profile backbenchers Matt Canavan and Alex Antic.\nThree Liberals – Bragg, Richard Colbeck and Maria Kovacic – opposed the motion, while several others were absent from the vote, including the shadow health minister, Anne Ruston, senior Liberal moderate Jane Hume, and fellow moderate Dave Sharma.\nThe health minister, Mark Butler, said the Coalition was “deeply divided” on the issue.\n“I thought that Peter Dutton, as the leader of the Coalition, made it clear that he didn’t want division and politics played around this question,” he told reporters on Tuesday.\nAnna Brown, the chief executive of Equality Australia, took heart from the Liberals who opposed the “unnecessary and harmful” motion as she pleaded with politicians not to turn trans youth into a “political football”.\n“Trans young people and their families are busy going to school and spending time with friends – a national election campaign focused on their lives has the potential to do a great deal of harm,” she told Guardian Australia.\n‘Confronting debates’ on gender treatments\nWhile Dutton hasn’t leaned into trans issues, he hasn’t been totally silent either.\nIn a Sky News interview with Peta Credlin earlier this month, Dutton said it was important that parents’ views were respected in “confronting debates” over child gender treatments.\n“We know that there are two sexes, and we know that, you know, for many families, for different reasons, this is a very confronting debate. I respect somebody’s privacy, their privacy, their sexuality, their situation, and that’s paramount to me, but again, we have to have a society which respects parental rights and the rights of children to be innocent,” he said.\nThe opposition leader was also asked about trans women in sport in the wake of Trump’s move to ban them from female competitions at US schools.\nIn response, Dutton said it was not “in the spirit of sport” for women to be denied their Olympic dream or a place on a team by someone with a “physiological advantage over them”.\nDutton’s office has never published a transcript of the 6 February interview.\nAfter it was broadcast, Butler accused Dutton and Credlin of trying to stoke a culture war over something that was “not an issue in Australia”.\nCoalition insiders sense community concern about transgender athletes in female sport is growing, giving Dutton cover to prosecute the issue if he wanted to.\nIt is a different story for abortion.\nAfter debate over abortion rights raged during the Queensland state election, likely costing the LNP votes in metropolitan seats, Dutton implored his colleagues not to put the issue on the national agenda.\nEven Canavan – arguably the strongest anti-abortion voice in the Coalition – agreed it was best avoided.\nDutton doesn’t want the distraction, not with an election to win.",
  "word_count": 1118,
  "scraped_at": "2026-02-14T14:15:44.168035"
}