{
  "article_id": "243cd7fc7564",
  "url": "https://www.elevenwarriors.com/skull-sessions/2023/03/137953/skull-session-urban-meyer-claims-ohio-state-would-have-beaten-tcu-in-the-cfp-tom-herman-is-an-underdog-again-at-fau-and",
  "title": "Skull Session : Urban Meyer Says Ohio State Would Have Beaten TCU in the CFP , Tom Herman is an Underdog ( Again ) at FAU and Todd McShay Touts C . J . Stroud Mobility Against UGA",
  "date": "20230321T120000Z",
  "domain": "elevenwarriors.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Welcome to the Skull Session.\nOhio State football returns to practice this week, and in the middle of those sessions lies Ohio State's pro day. Buckle up Buckeye fans; it's gonna be a fun week.\n— Ohio State Football (@OhioStateFB) March 20, 2023\nLet's have a good Tuesday, shall we?\nWHAT COULD HAVE BEEN. Had Ohio State defeated Georgia in the Peach Bowl on New Year's Eve 2022, Urban Meyer believes the Buckeyes would’ve beaten TCU in the 2023 national championship game.\nThe former Ohio State head coach and most recent program leader to carry the Buckeyes to the summit of college football made that stance clear on a recent episode of On3's The Hard Count with JD PicKell.\n“Well, they did it. They were a field goal away. Maybe they get a little closer and the kicker hits a field goal, Ohio State has its ninth national championship right now. They would’ve beat TCU. Unless someone got injured or turnovers, they would’ve had the more talented team. We saw what happened with Georgia in that game. So they’re right there. They have to beat the team up North. They have to get to Indianapolis. Ohio State is as strong a program as there is in the country. Recruiting is elite. They’ve got an elite coaching staff and elite players. So they’ve just got to take care of business.”\nTo borrow from Brian Hartline when he was asked if Marvin Harrison Jr. should have won the Biletnikoff last season, anybody with two eyes could have seen Ohio State would win the national championship game over TCU in 2023. Anyone that thinks otherwise is delusional.\nI mean, seriously, Ohio State was in the driver's seat for most of its College Football Playoff semifinal matchup with Georgia. It wasn't until a Series of Unfortunate Events – Harrison's concussion from a controversial hit in the end zone, Kirby Smart's perfectly-called timeout and Lathan Ransom's tumble in man-to-man coverage – that the Bulldogs overcame the Buckeyes. Even then, Georgia only beat Ohio State by one point, 42-41.\nAs Meyer mentioned in the clip, the Buckeyes were a Noah Ruggles 50-yard field goal away from their second national championship game appearance of the Ryan Day era. Had they made it, Ohio State likely would have won it all.\nThe Ohio State-TCU matchup may not have turned out the same as the historic 59-7 beatdown Georgia handed the Horned Frogs in Los Angeles, but Meyer believes, I believe and anyone with two eyes should believe that the scoreboard would have heavily favored Ohio State.\nBut ultimately, the past is the past. Ohio State can't worry about it now. It shouldn't worry about the future, either, because the future will worry about itself. The best thing the Buckeyes can do is focus on today, the present, the here and now. If they do that, Day and Co. may bring that coveted CFP trophy back to Columbus for the first time since 2014.\n\"YOU LOOK ALIVE AGAIN.\" Ohio State's 2014 national championship makes images of many people, places and things come to mind: Cardale Jones, Ezekiel Elliott, Tyvis Powell, the Superdome, Jerry World, \"85 Yards Through the Heart of the South.\"\nThat championship also makes me think of Tom Herman, the 2014 Broyles Award winner who called Ohio State's offense en route to the title. His efforts that year led to a meteoric rise in the college football world. In 2015, he became the head coach at Houston, a program he led to a 22-4 record in two years. He then moved on to Texas, where he went 32-18 across four years before Steve Sarkisian replaced him.\nAfter Herman and the Longhorns parted ways, he spent a year as an analyst for the Chicago Bears. His boss, Matt Nagy, was fired after Herman's first season, forcing him to seek new employment. Following a quick pit stop as a TV analyst, Herman met with Florida Atlantic athletic director Brian White to discuss a role as the school's next football head coach. Herman knocked the interview out of the park. So much so that White offered him the job that same day. Herman accepted.\nNow in \"paradise,\" Herman spent some time with The Athletic's Chris Vannini over the past few weeks. Here's an excerpt from the article, which describes the start of Herman's time in Boca Raton, Florida:\nNow Herman is back on the sideline as the Florida Atlantic head coach. He’s in “paradise,” as FAU calls itself, with its Boca Raton campus less than three miles from the Atlantic Ocean. The men’s basketball team’s run to the Sweet Sixteen has put another spotlight on the school, and the football coach loves it.\nHerman stays in a dorm room and rides a black electric scooter to work. His personal record from room to office is three minutes. A bad day is five minutes. The scooter tops out at 15 miles per hour. It’ll be this way until his family moves over from Austin later this year. When he was introduced at a press conference in December, fans and other coaches took notice of how much thinner and younger he looked. Michelle told him, “You look alive again.”\nThe 47-year-old Herman now dances at practice. He took FAU players to the beach, and they tossed him in the ocean. He dressed in a goofy basketball uniform as the team played some hoops.\nHe’s no longer in the fishbowl that is the Texas head coaching job, where everyone judged him on everything. He was booted out of the spotlight and is the underdog again, a position in which he’s always thrived.\n“I love it here,” Herman said. “This place has all the ingredients. It’s an up-and-coming product.”\nMy main takeaway? Herman looks \"alive again.\" He's back in the underdog role, where \"he's always thrived.\" Even more, he's surrounded by players at FAU that believe in and embrace the underdog role – players that, as it says later in the article, \"were probably told they were an inch too short, a step too slow, this, that or the other. They're out to prove something.\"\nAn entire program that has a chip on its shoulder? That's a scary proposition. Look out for Herman and the Owls in 2023 and beyond.\nSTROUD'S GEORGIA GAME STILL SHINES. C.J. Stroud's performance against Georgia is still front of mind for NFL draft analysts as April 27 approaches. In his team's 42-41 loss, Stroud completed 23 of 34 passes for 348 yards and four touchdowns. He also showed a willingness to maneuver around the pocket and run the football on occasion.\nESPN's Todd McShay is one of those analysts, as he tweeted Monday that continues to be impressed by what Stroud accomplished against the Bulldogs' top-five scoring and total defense in the Peach Bowl.\nJust re-watched tape of CJ Stroud vs. Georgia in CFP semi. It was a loss but OSU dropped 41 on a UGA D that allowed just 14.3 ppg. Stroud played his best game in his biggest moment. His mobility and creativity here is what NFL teams have been starving to see. pic.twitter.com/MFOwozwbHp\n— Todd McShay (@McShay13) March 20, 2023\nMany Twitter users were quick to praise McShay for his comments, with one person stating \"this game sold me on Stroud\" and another claiming \"Stroud is the best quarterback prospect since Peyton Manning.\"\nA quick aside, I can definitely see the first one as true, but the second one? I love Stroud, but let's be real here.\nBack to the regularly scheduled program. Another user noted that Stroud had shown tremendous mobility in the pocket all season for Ohio State and that it was even noticeable as early as the season opener against Notre Dame. They provided clips of several scramble scenarios that required Stroud to be active and move outside the pocket to make a throw:\nStrouds ability to make throws on the run has always been there. He made these 2 throws in the season opener vs Notre Dame to extend TD drives in a tight game. pic.twitter.com/mTHNLPYUO7\n— The South Stands (@south_stands) March 20, 2023\nAll of this to say, is Stroud the most mobile quarterback ever? Certainly not. But he can extend plays and make accurate throws with proficiency, and that has stood out to analysts (and likely scouts, coaches and execs, too) as the draft draws near. Add it as another positive in the incredible résumé of C.J. Stroud – a résumé that will become even more impressive as he adds becoming a first-round pick to that in a little over 30 days.\nOLYMPIC VILLAGE. It's the middle of March. Ohio State football has spring practices but no games, Ohio State men's basketball isn't in the postseason, the Blue Jackets are in the Connor Bedard sweepstakes and the Crew's season won't start hitting its full swing for at least a few weeks.\nThose four factors mean Columbus needs something to root for this time of year. But who will fill the role of The Local Team? Right now, it needs to be Ohio State women's basketball.\nThe Buckeyes defeated North Carolina, 71-69, at Value City Arena on Monday in a game that went down to the wire. But thanks to senior guard Jacy Sheldon's game-winning basket with 1.8 seconds left in regulation, Ohio State is headed to its second consecutive Sweet 16, where they will face UConn on Saturday in Seattle, Washington.\nJACY SHELDON GAME-WINNER. pic.twitter.com/KNEHAWYkoG\n— Eleven Warriors (@11W) March 20, 2023\nIf Ohio State can down the Huskies, it would be the program's first trip to the Elite Eight since the 1992-93 season – a year in which the Katie Smith-led Buckeyes made it all the way to the national championship and finished runner-up to Texas Tech in an 84-82 classic.\nThat said, there's a lot on the line for the scarlet and gray on Saturday. Do yourself a favor and watch the Buckeyes this weekend and appreciate an Ohio State team that has actually reached the Sweet 16 consistently ... oops, didn't mean to write it like that...\nDo yourself a favor and watch the Buckeyes this weekend and appreciate an Ohio State team that has been one of the best teams in the country all season long. I promise that they won't disappoint.\nSONG OF THE DAY. \"Last Night\" by Morgan Wallen.\nCUT TO THE CHASE. Hall of Fame coach Rick Pitino accepts job at St. John’s... Quentin Tarantino Is preparing his final movie, tentatively titled \"The Film Critic\"... How Allen Iverson created the blueprint for the modern sports superstar... Uber Eats mystery unfolds as Los Angeles residents sent dozens of free meals from fast food chains... RUOK? Day moves to a new date, time.",
  "word_count": 1788,
  "scraped_at": "2026-02-14T13:44:58.143740"
}