{
  "article_id": "246a1471194f",
  "url": "https://www.winnipegfreepress.com/world/2023/09/22/ap-news-in-brief-at-1204-a-m-edt-289",
  "title": "AP News in Brief at 12 : 04 a . m . EDT – Winnipeg Free Press",
  "date": "20230923T044500Z",
  "domain": "winnipegfreepress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "AP News in Brief at 11:04 p.m. EDT\nAdvertisement\nWith House Republicans in turmoil, colleagues implore GOP holdouts not to shut down government\nRead this article for free:\nor\nAlready have an account? Log in here »\nTo continue reading, please subscribe:\nMonthly Digital Subscription\n$1 per week for 24 weeks*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $4.00 plus GST every four weeks. After 24 weeks, price increases to the regular rate of $19.95 plus GST every four weeks. Offer available to new and qualified returning subscribers only. Cancel any time.\nMonthly Digital Subscription\n$4.99/week*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $19.95 plus GST every four weeks. Cancel any time.\nTo continue reading, please subscribe:\nAdd Free Press access to your Brandon Sun subscription for only an additional\n$1 for the first 4 weeks*\n*Your next subscription payment will increase by $1.00 and you will be charged $16.99 plus GST for four weeks. After four weeks, your payment will increase to $23.99 plus GST every four weeks.\nWith House Republicans in turmoil, colleagues implore GOP holdouts not to shut down government\nRead unlimited articles for free today:\nor\nAlready have an account? Log in here »\nHey there, time traveller!\nThis article was published 22/09/2023 (876 days ago), so information in it may no longer be current.\nWith House Republicans in turmoil, colleagues implore GOP holdouts not to shut down government\nWASHINGTON (AP) — Working furiously to take control of a House in disarray, allies of Speaker Kevin McCarthy implored their Republican colleagues Saturday to drop their hardline tactics and work together to approve a conservative spending plan to prevent a federal shutdown.\nIn public overtures and private calls, Republican lieutenants of the embattled speaker pleaded with a handful of right-flank holdouts to resist further disruptions that have ground the House to a halt and back McCarthy’s latest plan to keep government open before next weekend’s Sept. 30 deadline for a shutdown.\nRepublican Rep. Garrett Graves of Louisiana said the holdouts are “absolutely hallucinating” if they think they can wrap up work without the need for a temporary measure that many of them have shunned before time runs out.\n“An important part of this strategy is going to be ensuring that we do everything we can to avoid a government shutdown,” Graves said after a Saturday afternoon conference call with lawmakers.\nBut in a sign of the deep divisions still ahead, one of the conservative holdouts, Rep. Matt Rosendale, R-Mont., walked past the McCarthy allies’ news conference at the Capitol, telling reporters he remained firm in his position.\n___\nSouthern East Coast hit by flooding as Ophelia weakens to tropical depression and moves north\nANNAPOLIS, Md. (AP) — Residents in parts of coastal North Carolina and Virginia experienced flooding Saturday after Tropical Storm Ophelia made landfall near a North Carolina barrier island, bringing rain, damaging winds and dangerous surges.\nThe storm came ashore near Emerald Isle with near-hurricane-strength winds of 70 mph (113 kph), but winds weakened as it traveled north with the center of the storm crossing into Virginia by evening, the U.S. National Hurricane Center said. Ophelia is expected to sweep northeast Sunday along the mid-Atlantic coast to New Jersey.\nAt 7:44 p.m. EDT, the center said that Ophelia had slowed to become a tropical depression, which is a weak form of a tropical storm, and all storm surge and tropical storm warnings had been discontinued.\nStill, videos from social media showed riverfront communities in North Carolina such as New Bern, Belhaven and Washington experiencing significant flooding. The extent of the damage was not immediately clear.\nWinds were decreasing, and the system was expected to track toward the northeast by Sunday. “Additional weakening is expected, and Ophelia is likely to become a post-tropical cyclone tomorrow,” said a Saturday night hurricane center statement.\n___\nUS diplomat says intelligence from ‘Five Eyes’ nations helped Canada to link India to Sikh’s killing\nTORONTO (AP) — Information shared by members of an intelligence-sharing alliance was part of what Canadian Prime Minister Justin Trudeau used to make public allegations of the Indian government’s possible involvement in the assassination of a Sikh Canadian, the U.S. ambassador to Canada said.\n“There was shared intelligence among ‘Five Eyes’ partners that helped lead Canada to (make) the statements that the prime minister made,” U.S. Ambassador David Cohen told Canadian CTV News network.\nCTV News released some of Cohen’s comments late Friday, and the network said that it would air the full interview with the U.S. envoy on Sunday. No further details were released about the shared intelligence.\nOn Thursday, a Canadian official told The Associated Press that the allegation of India’s involvement in the killing is based on surveillance of Indian diplomats in Canada, including intelligence provided by a major ally — without saying which one.\nThe “Five Eyes” intelligence-sharing alliance is made up of Australia, Canada, New Zealand, the United Kingdom and the United States.\n___\nMenendez gains a primary opponent as calls for his resignation grow after indictment\nWASHINGTON (AP) — Rep. Andy Kim of New Jersey announced on Saturday that he will run against Sen. Robert Menendez in the state’s Democratic primary for Senate next year, saying he feels compelled to run against the three-term senator after he and his wife were indicted on sweeping corruption charges.\nKim’s surprise announcement came as a growing number of Democrats are calling for Menendez to step down. Pennsylvania Sen. John Fetterman became the first Democratic senator to do so, and several members of New Jersey’s congressional delegation, along with the state’s Democratic governor, have said he should resign.\n“This is not something I expected to do, but I believe New Jersey deserves better,” Kim said in a statement. “We cannot jeopardize the Senate or compromise our country’s integrity. I believe it’s time we restore faith in our democracy, and that’s why I am stepping up and running for Senate.”\nThe calls for Menendez, the Democratic chairman of the Senate Foreign Affairs Committee, come after he and his wife Nadine were indicted on Friday for using his powerful position to aid the authoritarian government of Egypt and also to pressure federal prosecutors to drop a case against a friend. The three-count indictment lists a series of bribes they were paid by three New Jersey businessmen in exchange for the corrupt acts — gold bars, a luxury car and cash.\nIt is the second indictment on bribery charges for Menendez — and the second time he has had to relinquish his post as the top Democrat on the Foreign Relations panel. He regained the leadership spot in 2018 after the case ended with a deadlocked jury.\n___\nAuto workers still have room to expand their strike against car makers. But they also face risks\nEven after escalating its strike against Detroit automakers on Friday, the United Auto Workers union still has plenty of leverage in its effort to force the companies to agree to significant increases in pay and benefits.\nOnly about 12% of the union’s membership is so far taking part in the walkout. The UAW could, if it chose to, vastly expand the number of workers who could strike assembly plants and parts facilities of General Motors, Ford and Stellantis, the owner of the Jeep and Ram brands.\nYet the UAW’s emerging strategy also carries potentially significant risks for the union. By expanding its strike from three large auto assembly plants to all 38 parts distribution centers of GM and Ford, the UAW risks angering people who might be unable to have their vehicles repaired at service centers that lack parts.\nThe union’s thinking appears to be that by striking both vehicle production and parts facilities, it will force the automakers to negotiate a relatively quick end to the strike, now in its second week. To do so, though, some analysts say the union might have to act even more aggressively.\n“We believe the next step for UAW is the more nuclear option — going for a much more widespread strike on the core plants in and around Detroit,” said Daniel Ives, an analyst with Wedbush Securities. “That would be a torpedo.”\n___\nSpeaker McCarthy is giving hard-right Republicans what they want. But it never seems to be enough.\nWASHINGTON (AP) — Staring down a fast-approaching government shutdown that threatens to disrupt life for millions of Americans, Speaker Kevin McCarthy has turned to a strategy that so far has preserved his tenuous hold on House leadership but also marked it by chaos: giving hard-right lawmakers what they want.\nIn his eight months running the House, McCarthy has lived by the upbeat personal mantra of “never give up” as he dodges threats to his speakership and tries to portray Republicans as capable stewards of the U.S. government. He has long chided Washington for underestimating him.\nBut with the House GOP majority in turmoil, all but certain to hurl the country into a shutdown, McCarthy has set aside the more traditional tools of the gavel to keep rebels in line. Instead, he has acceded to a small band led by those instigating his ouster, even if that means closing federal offices.\nIt’s an untested strategy that has left McCarthy deeply frustrated, his allies rushing to his side and his grip on power ever more uncertain with the Sept. 30 deadline to fund the government a week away.\n“We still have a number of days,” McCarthy said Saturday as he arrived at the Capitol.\n___\nUNGA Briefing: There’s one more day to go after a break — but first, here’s what you missed\nUNITED NATIONS (AP) — It’s almost the end of the U.N. General Assembly high-level meeting that brings world leaders together at U.N. headquarters in New York. Here are the highlights of what happened Saturday at the United Nations and what to keep an eye on Tuesday, the last day (Monday’s off for Yom Kippur).\n— Russian Foreign Minister Sergey Lavrov made no mention of his country’s war in Ukraine from the dais, but was naturally asked about it in a subsequent press conference. He had harsh words for the United States and the West in both places.\n— Armenia and Azerbaijan both spoke at the General Debate. Both critiqued the international community’s response to the situation in Nagorno-Karabakh, albeit for different reasons. Neither, interestingly, made use of the right of reply after speeches concluded Saturday night (only Iran and the United Arab Emirates did).\n— As Venezuela’s foreign minister spoke at the United Nations, The Associated Press visited the hotel just blocks away that’s become a center for asylum-seekers from the country.\n— Speech count: 30\n___\nUkraine targets a key Crimean city a day after striking Russia’s Black Sea Fleet headquarters\nKYIV, Ukraine (AP) — Ukraine on Saturday morning launched another missile attack on Sevastopol on the occupied Crimean Peninsula, a Russian-installed official said, a day after an attack on the headquarters of Russia’s Black Sea Fleet that left a serviceman missing and the main building smoldering.\nSevastopol was put under an air raid alert for about an hour after debris from intercepted missiles fell near a pier, Gov. Mikhail Razvozhayev wrote on the messaging app Telegram. He later added that another missile fragment fell in a park in northern Sevastopol, parts of which had to be cordoned off. Ferry traffic in the area was also halted and later resumed.\nLoud blasts were also heard near Vilne in northern Crimea, followed by rising clouds of smoke, according to a pro-Ukraine Telegram news channel that reports on developments on the peninsula. Crimea, illegally annexed by Russia in 2014, has been a frequent target for Ukrainian forces since Russian President Vladimir Putin ordered a full-scale invasion of Ukraine in February 2022.\nUkraine’s intelligence chief, Kyrylo Budanov, told Voice of America on Saturday that at least nine people were killed and 16 others wounded as a result of Kyiv’s attack on the Black Sea Fleet on Friday. He claimed that Alexander Romanchuk, a Russian general commanding forces along the key southeastern front line, was “in a very serious condition” following the attack.\nBudanov’s claim couldn’t be independently verified, and he didn’t comment on whether Western-made missiles were used in Friday’s attack. The Russian Defense Ministry initially said that the strike killed one service member at the Black Sea Fleet headquarters, but later issued a statement that he was missing.\n___\nA Black student was suspended for his hairstyle. Now his family is suing Texas officials\nHOUSTON (AP) — The family of a Black high school student in Texas who was suspended over his dreadlocks filed a federal civil rights lawsuit Saturday against the state’s governor and attorney general, alleging they failed to enforce a new law outlawing discrimination based on hairstyles.\nDarryl George, 17, a junior at Barbers Hill High School in Mont Belvieu, has been serving an in-school suspension since Aug. 31. Officials with the Houston-area school say his dreadlocks fall below his eyebrows and ear lobes and violate the district’s dress code.\nGeorge’s mother, Darresha George, and the family’s attorney deny the teenager’s hairstyle violates the dress code, saying his hair is neatly tied in twisted dreadlocks on top of his head.\nDarryl George’s supporters allege the ongoing suspension by the Barbers Hill Independent School District violates the state’s CROWN Act, which took effect Sept. 1.\nThe lawsuit also alleges that Gov. Greg Abbott and Attorney General Ken Paxton, in their official duties, have failed to protect George’s constitutional rights against discrimination and against violations of his freedom of speech and expression. George “should be permitted to wear his hair in the manner in which he wears it … because the so-called neutral grooming policy has no close association with learning or safety and when applied, disproportionately impacts Black males,” Allie Booker, the family’s attorney, wrote in the lawsuit.\n___\nBirthplace of the atomic bomb braces for its biggest mission since the top-secret Manhattan Project\nLOS ALAMOS, N.M. (AP) — Los Alamos was the perfect spot for the U.S. government’s top-secret Manhattan Project.\nAlmost overnight, the ranching enclave on a remote plateau in northern New Mexico was transformed into a makeshift home for scientists, engineers and young soldiers racing to develop the world’s first atomic bomb. Dirt roads were hastily built and temporary housing came in the form of huts and tents as the outpost’s population ballooned.\nThe community is facing growing pains again, 80 years later, as Los Alamos National Laboratory takes part in the nation’s most ambitious nuclear weapons effort since World War II. The mission calls for modernizing the arsenal with droves of new workers producing plutonium cores — key components for nuclear weapons.\nSome 3,300 workers have been hired in the last two years, with the workforce now topping more than 17,270. Close to half of them commute to work from elsewhere in northern New Mexico and from as far away as Albuquerque, helping to nearly double Los Alamos’ population during the work week.\nWhile advancements in technology have changed the way work is done at Los Alamos, some things remain the same for this company town. The secrecy and unwavering sense of duty that were woven into the community’s fabric during the 1940s remain.",
  "word_count": 2574,
  "scraped_at": "2026-02-14T13:50:21.106042"
}