{
  "article_id": "247550f25bef",
  "url": "https://www.90min.com/features/5-things-we-learned-england-boost-euro-2025-qualification-hopes-crucial-victory-ireland",
  "title": "5 things we learned as England boost Euro 2025 qualification hopes with crucial victory over Ireland",
  "date": "20240713T123000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "5 things we learned as England boost Euro 2025 qualification hopes with crucial victory over Ireland\n- England secured a narrow 2-1 win over the Republic of Ireland on Friday night\n- Alessia Russo and Georgia Stanway were on the scoresheet at Carrow Road\n- Sarina Wiegman’s selection risk paid off and two players were handed senior debuts\nEngland boosted their chances of qualifying for next summer’s Euros in Switzerland with a crucial 2-1 win over the Republic of Ireland on Friday night.\nAlessia Russo opened the scoring early doors following a well-worked move involving Keira Walsh, Georgia Stanway and Beth Mead. Stanway then gave the Lionesses some breathing space in the second half as she calmly converted a penalty after Lauren Hemp was brought down in the box.\nDespite a late goal from the Republic of Ireland, it was a mere consolation for the visitors as the game was arguably already won with just seconds left on the clock. Results elsewhere mean England are one step closer to qualifying for next summer’s finals and retaining their European crown.\nHere’s five things we learned from England’s crucial win over the Republic of Ireland.\nQualifying state of play\nGroup 3 in League A is starting to take shape as France booked their place at Euro 2025 with a narrow win over Sweden on Friday night. England, on the other hand, are in pole position to qualify in second.\nA point against Sweden in the final group game on Tuesday night will be enough for the Lionesses and they could still finish top of the group in the unlikely event France lose to the Republic of Ireland and they beat Sweden.\nHowever, should England lose in Gothenburg next week, Sweden will qualify in second place due to the head to head between the two teams. Sarina Wiegman’s side require some form of a positive result next week to put their qualification beyond doubt.\nHampton gets the nod\nAs Mary Earps returned to the squad following injury, there were plenty of question marks over who Wiegman would select against Ireland. Hannah Hampton did an outstanding job in the two games against France last time out and is one of a growing number of goalkeepers ready to push for the number one spot.\nHer excellent distribution served England well throughout the game and her calmness on the ball was evident. Hampton was minutes away from securing a clean sheet if not for the last-gasp goal from the visitors to make it 2-1.\nWhether she’s done enough to keep her place next time out against Sweden remains to be seen. Wiegman may opt to offer both Hampton and Earps equal game time given the latter has recently recovered from injury.\nRotation pays off\nAside from the goalkeeper, there was plenty for Wiegman to ponder ahead of Friday night’s game at Carrow Road. A number of players, including Leah Williamson, Ella Toone and Lucy Bronze were on yellow cards and risked suspension, while others are playing their way back from injury.\nAs a result, the manager opted for wholesale changes in the backline as Alex Greenwood partnered Williamson in the first half, Maya Le Tissier came in at right-back and Jess Carter started on the left. Further changes were made at half-time as Williamson made way for Millie Bright.\nIn midfield, Manchester City star Jess Park came in alongside Walsh and Stanway and was a bright spark for the Lionesses in the middle of the park.\nThe sheer number of changes could have resulted in an unsettled backline, but it was a risk that paid off for the manager. Despite Ireland’s goal right at the death, England were firmly in control of proceedings throughout the game and they didn’t pick up any unnecessary suspensions.\nDouble debut\nIt was a night to remember for two young England stars as Tottenham’s Jess Naz and Chelsea’s Aggie Beever-Jones were handed their senior Lionesses debuts. Naz was initially named on the standby list when the squad for the summer internationals was named back in May.\nHowever, injury to Lauren James resulted in a promotion to the full squad shortly after the players reported for training a couple of months ago. Now, she has a first senior cap to go with her maiden Lionesses call-up as she replaced Russo late on and it was very nearly the dream debut for the forward as she came agonisingly close to getting on the scoresheet.\nBeever-Jones was also awarded her senior England debut on the night. She replaced Lauren Hemp in the latter stages of the game and she very nearly set up Stanway for a second if not for a wayward finish.\nEngland lack clinical edge\nDespite a much-needed victory, the scoreline was far tighter than England would have hoped. Wiegman’s side dominated the game for large periods and had 16 attempts on goal compared to Ireland’s four.\nHowever, only six of those were actually on target for the Lionesses. England cannot squander so many chances against Sweden next time out as Peter Gerhardsson’s side will most certainly punish them if that’s the case.\nEngland must discover their clinical edge as they may struggle to create the same number of chances against stronger opposition. They learnt the hard way in the reverse fixture at Wembley in April when Russo’s early goal was cancelled out by a Sweden equaliser in the second half.",
  "word_count": 899,
  "scraped_at": "2026-02-14T13:05:07.562521"
}