{
  "article_id": "2480e0835543",
  "url": "https://www.sounderatheart.com/2025/05/ships-log-may-20-takeaways-from-mls-rivalry-week/",
  "title": "Ship Log , May 20 : Takeaways from MLS Rivalry Week",
  "date": "20250521T030000Z",
  "domain": "sounderatheart.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "With the Seattle Sounders' 1-1 derby draw at Portland in the books, there were a few other Rivalry Week results that caught my eye.\nChief among them is the continued descent of Inter Miami CF, who appear in real danger of watching their season go off the rails. It's not just that they've won only one match in their last seven across all competitions. It's the nature of the defeats. A 3-0 rout at the hands of Orlando City SC was just the latest result that devolved into a non-competitive contest.\nIt's been a shocking downturn for Lionel Messi and the Barca Boys. After setting the single-season points record a season ago, I was among those who figured they would remain a dominant force in 2025, despite their disappointing playoff exit against Atlanta United. I can't say with certainty exactly what's gone wrong, but it seems we might be witnessing the perils of building a team around star players who are mostly in their mid-to-late 30s, then handing the head coaching reins to someone with no experience at the club level. It's entirely possible that their talent ultimately wins out and they get back to their dominant ways, but right now the vibes feel ominous in South Florida.\nSunday night's El Tráfico fixture between LAFC and the LA Galaxy was both entertaining, and a near-ideal result from my perspective. The Galaxy's 87th-minute leveler from Marco Reus was a nice highlight in an improved performance, but they're still winless through a record 14 matches (0W-10L-4D). LAFC, meanwhile, will certainly feel like they dropped points after leading a winless rival until the game's waning moments, only to concede the leveler.\nLastly, I agree with the widespread consternation regarding the scheduling for these matches, which had these clubs playing their derbies at the end of a three-match week. Fixture congestion and squad rotation are a part of life in MLS, but having the league's best rivalries taking place with the clubs all running on fumes was just unfortunate. Hopefully we never see that again.\nUse our affiliate links to support your bloggers when buying merch and tickets.\nCatching up on Sounder at Heart\nHere's what you missed on the site this week.\nSounders\nNext match: Saturday, May 24 vs. FC Dallas | 12 pm PT | MLS Season Pass\n- Postgame Pontifications: A healthy rivalry\n- Sounders at Timbers, recap: Just not good enough\n- Lobbing Scorchers Kickoff: Grading the Seattle Sounders' road trip\n- Seattle Sounders at Portland Timbers: community player ratings form\n- Timbers vs. Sounders: Highlights, stats and quotes\nThis newsletter was made possible through the support of Full Pull Wines, a boutique wines reseller that has been sponsoring us since 2011.\nReign\nNext match: Friday, May 23 vs. Washington Spirit | 7 pm PT | Prime Video\n- Three stats: Seattle Reign vs. Racing Louisville\n- Reign earn hard-fought road win against Louisville\n- Reign at Louisville: Highlights, stats, quotes\nDefiance\nNext match: Sunday, May 25 vs. North Texas SC | 7 pm ET | MLS Season Pass\nLooking back at the news\nEverything else you need to know\nSan Diego FC continues its homestand amid concerns about Snapdragon field conditions (San Diego Union Tribune)\nHow the growing USL W is helping women’s soccer flourish in Seattle (Seattle Times)\nNWSL Power Rankings: Chawinga's brilliance keeps Current No. 1 (ESPN)\nLionel Messi criticizes MLS refereeing ahead of potential Inter Miami contract renewal (Backheeled)\nRivalry Week: Who took bragging rights in 2025? (MLSSoccer)\nMajor League Soccer market values: Latte Lath now third most valuable - Zaha drops by 25% (Transfermarkt)\nMatt Doyle's Power Rankings (Tactics Free Zone)",
  "word_count": 606,
  "scraped_at": "2026-02-14T12:19:46.425181"
}