{
  "article_id": "248761c95a01",
  "url": "https://thestandard.org.nz/open-mike-14-03-2023/",
  "title": "Open mike 14 / 03 / 2023",
  "date": "20230313T220000Z",
  "domain": "thestandard.org.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Written By:\n- Date published:\n6:00 am, March 14th, 2023 - 63 comments\nCategories: open mike -\nTags:\nOpen mike is your post.\nFor announcements, general discussion, whatever you choose.\nThe usual rules of good behaviour apply (see the Policy).\nStep up to the mike …\n- Comments are now closed\n-\nThis is why zerohedge is so useful a source.\nand the development will do far more damage than a few burping cows down under ….\nhttps://www.zerohedge.com/political/biden-gives-go-ahead-giant-alaska-oil-project-greens-furious\n\"President Biden pledged during the election campaign: \"I guarantee you we’re going to end fossil fuels.\"\nThe same President Biden today has – much to the angst of conservationists – authorized a giant ConocoPhillips oil project in northwest Alaska.\nThe authorization represents one of the most significant climate decisions yet for Biden\nChristy Goldfuss, a former Obama White House official who now is a policy chief at the Natural Resources Defense Council, said she was “deeply disappointed'' at Biden's decision to approve Willow, which NRDC estimates would generate planet-warming greenhouse gas emissions equivalent to more than 1 million homes.\nWillow is projected to output 180,000 barrels of oil per day, or around 1.5 percent of total American oil production.\nOver its 30-year lifespan, Willow is expected to produce over 600 million barrels of oil while contributing up to $17 billion in revenues for state and federal governments as well as local communities.\"\n-\nWell spotted Maurice. Biden is old school \"drill baby drill\".\nEven Starmer in the UK has said he will not allow any more oil/gas drilling licences in the UK if he becomes PM.\n-\n-\nHere is a great video that explains very simply how the banking fractional reserve system works and how a run on a bank is almost certain to sink it. In relation to the bank that went down in the US the other day.\nThis guy manages finance portfolios and also is ex army so comments on the Ukraine situation. But what he says here about banking is really good.\nProbably explains in part why banks need large profits. Because, they are doing that through really high leverage which is incredibly risky if it goes wrong.\n-\nWhy are there not mechanisms to prevent a run on banks. It seems to be a fatal flaw in the capitalist system.\nJohn Key's mate, Jamie Beaton of Crimson Education was involved in the run on SVB and therefore contributed to its downfall.\n-\nThere are, deposit insurance.\n-\nPrivatising profit, socialising cost.\n-\nOr don't and wipe out depositors.\nBTW, you can make depositors whole while still prosecuting any fraud and replacing the management involved. Unless its the bank (as in the business entity) rather than the bank management causing the problems this seems appropriate.\n-\nIn the 1930s FDR sought solutions, to the bank run problem, from the economics profession. Chicago University offered the 'chicago plan' which would have entailed imposing a 100% reserve ratio on banks. The problem with this would have been that all monetary expansion would have to have come from government. This would have been difficult to manage unless all banks became government owned 'public utilities'. I suppose this would have been unacceptable in a 'free enterprise' economy like America's, albeit that it seems to work very well in China, where their banking system is owned by government.\n-\nDeposit insurance and full reserve protocols are the same. Either the state guarantees that you will be able to withdraw the insured sum, or that that sum is $ for $ held by the bank at all times. Its the same in either case.\nThe actual important parts of the Chicago plan for preventing bank collapses were implemented, including the Glass Stegall act which at the time separated retail and commercial lending and meant deposits were not put at risk by backing highly leveraged lending. That worked for a long time, but US banking practice has since moved on in ways where these became combined again.\nThe problem is that the bank is not solvent any more and will not repay all its liabilities (including deposits) without a bailout. Likely that's because there was a bunch of fraudulent lending occurred by the bank. Putting that all down to a run on deposits, a very natural reaction when people discover their deposits were loaned out fraudulently, is a bit simplistic.\n-\nDeposit insurance and full reserve protocols are the same.\nThe two are not the same. There is an upper limit to how much deposit insurance will pay out. Deposit insurance also encourages reckless lending.\n-\nYour absolutely right there, they are the same up to the insured limit.\nSince they are the same, they encourage reckless lending to the same degree. But the actual thing which discourages reckless lending is the effective regulation.\nSVB shareholders were wiped out BTW, while depositors are being largely made whole. What happens to the bank executives will depend on any prosecutions which occur of anything they did wrong.\n-\n-\n-\n-\n-\n-\nTo a max of $250k only in US, acording to Guardian. Not much good if your company has millions in there.\n-\nYes, it says $250K which is low if its a business account, but watch what actually happens. There are apparently payroll firms within the accounts and they won't be left short to pay people.\n-\n-\n-\nIf you think about it, the banking system is legalised fraud. In fact, it started out as fraud in the days of gold merchants who stored gold for clients. They would write a certificate for the clients stating that they were holding x amount of gold for them which the clients could then use as collateral.\nThe gold merchants worked out that they could lend out the gold, and effectively write out fraudulent certificates. So long as all of the clients didn't ask for their money back at once they were ok.\n-\nSince at least Roman lending practices its always been the case that deposits are repaid in kind. You get back the same amount but not the same deposits made and this has always been a part of a legal definition for how deposits work.\nLook at the definition of the word mutuum.\nhttps://en.wiktionary.org/wiki/mutuum\n-\n-\n-\nCan't trust these bankers:\nThe government had scrambled to try and sell Silicon Valley Bank to a private company and finding a purchaser is still a possibility. But a Treasury official said Sunday that regulators ultimately decided to move forward with the plan to make depositors whole, in part because it was proving to be challenging for a potential buyer to vet the bank’s books by Monday.\nThe Treasury official emphasized that the actions should not be considered to be a “bailout,” because the company’s shareholders and those who own its debt would be wiped out.\nhttps://www.nytimes.com/2023/03/12/business/janet-yellen-silicon-valley-bank.html\nExcept:\nA trust owned by Silicon Valley Bank Chief Executive Officer Greg Becker sold $3.6 million worth of shares in his bank last week, days before the bank disclosed a $1.8 billion loss that triggered a fatal run on the bank, according to company filings.\nOn Feb. 27, the trust sold $3.6 million worth of shares while acquiring options worth $1.3 million. The trades were scheduled on Jan. 26 through an SEC rule that allows insiders to schedule sales ahead of time to allay suspicions of trading on insider information.\n-\nRight wing venture capitalist Peter Theil involved in SVB collapse…\n“What finally doomed SVB was that the resulting losses prompted a panic among depositors. This was in no small part thanks to far-right billionaire Peter Thiel’s VC firm Founders Fund, which, after finding out its investors were having trouble transferring money to its SVB accounts, ordered them to send them to other banks and had withdrawn all of its cash by the time the bank started melting down late last week. ”\n-\n-\nSome more explanatory detail, my bold:\nIn the case of SVB, regulators allowed it to make risky bets with its deposits (while the bank’s executives insisted that the bets weren’t risky). More generally, SVB and other banks are often not required to maintain enough of a financial cushion to withstand a crisis. Financial cushions — effectively, cash or other forms of insurance — tend to reduce banks’ profits, which is why bankers resist them. But without a healthy cushion, a bank can collapse during a crisis, and taxpayers must sometimes bail it out. When that happens, the bankers and their investors often emerged unscathed.\nOnce SVB began to falter, financial industry executives and investors again began clamoring for government help. In the short term, the government may indeed need to step in to avoid a spreading crisis. But the less immediate questions may be uncomfortable for the bankers: How can the people who caused this crisis bear financial responsibility for it? And how can the U.S. economy end this cycle of booms that benefit banks and busts that hurt everyone else?\nhttps://www.nytimes.com/2023/03/13/briefing/silicon-valley-bank.html\nand a cherry on the top:\nSilicon Valley Bank on Friday paid out annual bonuses to eligible U.S. employees, just hours before the bank was seized by the U.S. government, Axios has learned from multiple sources.\nhttps://www.axios.com/2023/03/11/silicon-valley-bank-paid-bonuses-fdic\n-\n-\nThe biggest annual rise in the cost of living in over 30 years.\nThe cost of living becomes leading election issue..\nGovernment removes GST off food and wins in a landslide.\nGovernment brings in a FTT and windfall tax that more than covers the GST off food, allowing the government to deliver on all their other policies.\nVs.\nGovernment does nothing.\nOpposition wins treasury benches\nScraps climate mitigation.\nNew government begins massive austerity program.\nInequality, social and biosphere decay all increase.\nCrime goes up, leading to dystopian repressive policing and enforcement and punishment,\n-\nGovernment just raised super and the benifits, got rid of mostly stupid policies, they gonna win any way\n-\nA cost of living increase in superannuitants' income is seen by those voters as 'business as usual' for a government. They certainly won't be expecting a regime change to result in sinking-lid pensions. So don't count that as pork-barrelling. However, they may be in for a nasty surprise. Means-testing, anyone?\n-\nA cost of living increase in superannuitants' income is seen by those voters as 'business as usual' for a government.\nAlso raises in benefits. Please don't let this be an election policy or touted as something special that this Govt has done, because it is not. To continue with fair policies developed over many years should not be thrown into the pot. By all means have in house policy reviews to improve these as all effeicient bodies should do.\nIf we do want to look at benefits etc why not have a look at the WEAG report and move on with innovative ideas that we are not doing now.\nhttps://www.weag.govt.nz/weag-report/\nThe Nats etc will have all sorts of ideas such as raising the age & means testing. Let us look at these and fight them for what they are.\nNot every single thing that this Govt has done, including the BAU ones should be lauded. Otherwise we will find ourselves fighting things on efficiency grounds rather than true policy grounds.\nSo called 'Efficiency' arguments always plays into the Nats hands. A better idea is to ensure that the business of govt is well funded, departments are well staffed and impediments to BAU are stripped away.\nFrom years in the PS I can hand on heart say that the biggest impediment to efficient delivery of both policy and BAU is any sort of wholesale restructuring, realignment, right sizing or any other weasel or waffle words you want to call it.\nMy thoughts are that the restruscturings of the late 1980s/1990s put a blight on service delivery by Govt that lasted into the 2000s and may still be felt in some Govt Depts. Productivity was slashed as people fought for their jobs, depts had to retool in policy brains etc.\n-\nIts been quoted here before, but bears repeating: restructuring as a solution is as old as government, and solves very little!\n“We trained hard—but it seemed that every time we were beginning to form up into teams we were reorganized. I was to learn later in life that we tend to meet any new situation by reorganising, and what a wonderful method it can be for creating the illusion of progress while actually producing confusion, inefficiency, and demoralisation.”\n― Petronius Arbiter\n-\n100%\n-\n-\nCost of living increase for NZ Super is business as usual. All the Government does is confirm the increase by Order in Council.\nSee https://www.legislation.govt.nz/act/public/2001/0084/latest/whole.html#DLM113924\nSection 15 says increase auto by CPI\nSection 16 says min of 66% national average wage (NAW)\nAs the 66% generally holds the actual increase in Super is the NAW increase. But this year CPI was higher so the % of NAW will be above 66% and so no top up above CPI.\nIt doesn't seem like any politicians know how it works (worrying) as it's being sold as a extra benefit to pensioners (nope, just what they're entitled to, nothing more) by the Govt and the opposition hasn't pointed it out.\n-\nYes agree with this….continuing with BAU is an expectation not something new. To claim it as 'rah, rah something we have done as a Govt' is spurious and hopefully it is not being done. They should claim for additions/improvements to the lot of everyone or particular people but not for standing still or for meeting legal entitlements. COL increases are not an extra entitlement.\nIt doesn't seem like any politicians know how it works (worrying) as it's being sold as a extra benefit to pensioners (nope, just what they're entitled to, nothing more) by the Govt and the opposition hasn't pointed it out.\n-\n-\nI don't see it as pork barreling, I see it as good ideas, means testing is ridiculously expensive and complicated and the people you're targeting most will dodge it anyway,\n-\nPension means testing works for Oz. And UK. You need to declare income regularly, ie, a pension is not a basic entitlement, but something you continually reapply for. And if your assets are too much, you fund your own retirement.\n-\n-\n-\nLabour could form a government with the support of the Greens and Te Pāti Māori, according to the latest 1News Kantar Public Poll.\nBut the two main parties are still neck and neck, with just two points separating National and Labour.\nSome people will find any excuse to do the barest minimum possible.\nI suggested if the government removed GST from food to help address the cost of living crisis and replaced it with an FTT and windfall tax, and could win the election in a landslide.\n\"Government just raised super and the benifits, got rid of mostly stupid policies, they gonna win any way\" bwaghorn\nIf Labour can just scrape in, why should they do more?\nMaybe, because it's the right thing to do?\nLabour could form a government with the support of the Greens and Te Pāti Māori, according to the latest 1News Kantar Public Poll.\nBut the two main parties are still neck and neck, with just two points separating National and Labour.\n-\n-\nplease forget about taking gst off food. its a logistical nightmare for small businesses to piss around and run two different sets of accounts. they do this in aus and its a real pain in the arse. cooked chicken= gst, raw chicken = no gst etc,etc. just forget it. the one good thing about our gst, sales tax ,vat is that it applies at the same rate to all goods and services. before the pedants get here, Im aware that there are exceptions. but it is still the easiest system for a small business to work.\n-\n\"…its a logistical nightmare for small businesses to piss around and run two different sets of accounts. they do this in aus and its a real pain in the arse. cooked chicken= gst, raw chicken = no gst etc,etc. just forget it.\" woodart\nI didn't say take GST off some food. Taking GST off some food would definitely act to make it complicated. That would be stupid.\nThere have been many specious excuses made why this shouldn't be done, this is just one of them.\nI have been reliably informed by an accountant that making all food GST free is a simple one off change to accounting software. That's it, simple.The specious complexity argument is demonstrated in an opinion piece by Stephen Hickson of The Conversation who writes 'Some bad ideas never go away'\n(I might add, no matter how much some people wish it would)….It's an idea that voters like. A recent poll suggests 76 percent of New Zealanders support removing GST from food. But regardless of the support, removing GST on food always was, and still is, a bad idea….\n…..As inflation increases to levels not seen for 30 years, the main reason given now is to ease the cost of living stress on those struggling to keep up….\n…..Removing GST on food, or some types of food – for example, \"healthy food\" – makes that system more complex and costly.\nThere are a number of potential complications.\nLet's start with the obvious – what would count as \"food\"? Is milk powder food? Probably yes, so what about milk? Or flavoured milk? Oranges are food, so what about 100 percent natural orange juice? A broad definition of \"food\" would include lollies, potato chips, McDonalds and KFC, but many would object to removing GST from these on health grounds….\n….n Australia, the question of whether an \"oven baked Italian flat bread\" is a bread (so not subject to GST) or a cracker (subject to GST) went to court, and involved flying a bread certification expert from Italy to testify….\n….In Ireland, the court was required to rule on whether Subway was serving \"bread\" or \"confectionery or fancy baked goods\" due to the difference in GST treatment.\nIn the UK, guidance on how GST on food is applied runs to 40 pages with 130 example categories; in Australia, an 87-page document covers some 1500 food types…\n….The 2018 Tax Working Group (TWG) didn't support removing GST on food. It emphasised how such exemptions lead to \"complex and often arbitrary boundaries\", particularly when trying to target specific types of food such as \"healthy food\".\nThey also stated that such exemptions are a \"poorly targeted instrument for achieving distributional aims\".\nThis is important given the current push to help New Zealanders, particularly those on low incomes, with the cost of living.\nAll this specious argument really boils down to, is that we shouldn't go down the complex, some foods and not other foods, exemption route. GST off food no exceptions! We don't need experts and courts to tell us what food is, we all know what food is.\nGST is a regressive flat tax, that neoliberals love because it targets those whose incomes go mostly on paying for their cost of living, whereas wealthy people with excess income above their cost of living, can invest and bank a lot of that income, these investments and returns do not attract GST. GST allows the rich to keep a lot more of their excess wealth. Neoliberal philosophy is based on the idea that if rich people become richer, society becomes richer. It was no coincidence that after GST was introduced by the notoriously neoliberal fourth Labour Government that it was quickly followed by income tax cuts on the highest earners.\nLabour's commitment to the 'Purity' of GST is symptomatic of Labour's continuing commitment to neoliberalism.\n-\n. none of that screed changes the fact that having two different tax rates makes more work. yr accountant friend doesnt do the donkey work at the coal face of small business. when youve got to be an expert on ALL aspects of business, not just the books, any extra complication is not welcome.Im NOT a fan of gst, having experienced it as a business owner, and customer, but if we have it, lets not complicate it further.\n-\nLabour's commitment to the 'Purity' of GST is symptomatic of Labour's continuing commitment to neoliberalism.\nLabour's commitment to the 'purity of GST' is a symptom of their commitment to common sense. Adjustment of income tax rates would be a better means of redistribution.\nIf we wished to monkey around with GST, we would want to distinguish between healthy foods and unhealthy foods, and maintain GST on the latter. This would cause enormous complications.\n-\nYeah we get it.\nAustralians can manage it, but NZ tax officials are shambling morons that could not find their bottoms with both hands and a searchlight.\nAustralia exempts:\n- bread and bread rolls without a sweet coating (such as icing) or filling – a glaze is not considered a sweet coating.\n- cooking ingredients, such as flour, sugar, pre-mixes and cake mixes.\n- fats and oils for cooking.\n- unflavoured milk, cream, cheese and eggs.\n- spices, sauces and condiments.\n- bottled drinking water\nIt's just so advanced NZ public servants could never handle it.\n-\n\"If we wished to monkey around with GST, we would want to distinguish between healthy foods and unhealthy foods, and maintain GST on the latter. This would cause enormous complications.\" mikesh\nWhich makes me wonder why would countries like Australia, And Britain and Ireland follow such a stupid practice?\nMy view is that the partial removal of GST from food was probably the result of a last ditch effort by neoliberal lobbyists to try and keep GST on as many food items as possible, no matter how impossibly complex it makes the GST system..\nOf course the partial removal of GST off food would create 'enormous complications'. Which is probably what the neoliberals wanted.\nNeoliberalism is a faith based science. Challenge the faith, and the neoliberals will fight you all the way to keep as many food items as possible inside the GST regime and things will deliberately be made to be very complicated as a result.\n-\nWhich makes me wonder why would countries like Australia, And Britain and Ireland follow such a stupid practice?\nPolitical pressure, probably.\n-\n-\n\"Labour's commitment to the 'purity of GST' is a symptom of their commitment to common sense.\" mikesh\nThere is no alternative.\nTina, There Is No Alternative was coined by Roger Douglas the founder of the far right Backbone Club lobby group inside the 4th Labour government caucus that tried to get that government to enact even more extreme right wing measures, including the privatisation of the public health system, as set out in the infamous Gibbs Report on Health.\nhttp://www.eastonbh.ac.nz/1997/07/the_health_reforms_and_the_blitzkreig/\nDavid Lange's call for a 'Cup Of Tea' breather to halt this proposed neoliberal dismantling of the Social Welfare health system caused a split inside the Labour caucus between the Backbone Club and the supporters of Lange. This split led to the breakaway formation of the far right Act party.\nOf course there was an alternative – tax the rich more. Douglas a millionaire himself wouldn't have a bar of it, but not only out of self interest, but because it went against his belief in his theory of 'Trickle Down'.\nTrickle Down being a neoliberal concept that making the rich richer makes society richer.The following is a slobbering corporate hym in praise of GST.\nGST, making New Zealand a low income tax paradise for millionaires. by PwC Partner Eugen Trombitas.\nCelebrating 30 years of GST – New Zealand’s best export\nEugen Trombitas\nPartner at PwCAugust 18 2016\n….the most significant tax reform in New Zealand throughout the entire 20th century. It’s also one of our best exports to the world – along with the All Blacks….\n….The speed of execution of the GST policy, after the July 1984 snap election, was remarkable. It took everyone by surprise and involved a lot of political courage, as well as fine minds to execute the plan….\n…..Our effective GST helps keep our personal income tax rates lower across the board than comparable OECD countries.nnual GST take is more than $17 billion and contributes about 30% to overall tax revenue….\nhttps://www.linkedin.com/pulse/celebrating-30-years-gst-new-zealands-best-export-eugen-trombitas\n-\nTina, There Is No Alternative was coined by Roger Douglas\nTINA, there is no alternative was first coined by Margaret Thatcher.\n-\nIt's attributed to Herbert Spencer's mid 19th C book Social Statics.\n-\nTrue. But these days it is associated mainly with Margaret Thatcher.\n-\nExcept in New Zealand where it is associated mainly with Roger Douglas.\n-\nNo it isn't. TINA is a Thatcher catchcry erroneously attributed to Roger Douglas because people felt there was a similarity in the pair's respective outlooks.\n-\n-\n-\n-\n-\n-\n-\nAll this specious argument really boils down to, is that we shouldn't go down the complex, some foods and not other foods, exemption route. GST off food no exceptions!\nThat sort of argument would be valid for abolishing GST altogether, an option I would support since GST seems to have no useful purpose. I think it was introduced originally as a tax which could not be legally dodged for tax avoidance purposes. However it's questionable whether this is a justification for it given its regressiveness.\nHowever if we are going to have a GST anyway I don't think there is any reason why food should be excluded. The poor can be helped, through the tax system, in other ways.\n-\nPS: I thought that GST was not payable on second hand goods. However, when I bought my most recent car, which was second hand, the dealer charged GST. I assume this is normal, but it does seem to be an anomaly. The rationale for exempting second hand goods would be that GST would have been paid on the the item when it was first purchased new. In other words GST can be paid many times on the same vehicle if it changes hands many times through a dealer.\n-\n\"Labour's commitment to the 'purity of GST' is a symptom of their commitment to common sense.\" mikesh\nMikesh, you oppose GST being taken off food because it would destroy the 'purity' of GST. But you support it being taken off second hand goods?\nAm I right in presuming that the reason second hand goods are exempt from GST is because poorer people who tend to spend proportionately more on buying second hand goods more than rich folk?\nWhy can't the same 'commitment to common sense' be applied to food?\nAfterall poorer people pay proportionately more of their income on food than rich people do.\n-\n-\n-\n-\n-\n-\nAnd now some good news.\nFollowing unprecedented solidarity action by fellow presenters and public pressure.\nIn a massive victory for free speech Gary Lineka returned to Match of the Day,\nGary Lineker is BACK! Match of the Day host to return following backlash with BBC set to allow him to tweet without restrictions\nChris Burton\n|13 Mar 2023\nWHAT HAPPENED? The former England international found himself caught up in a social media storm after comparing language used in the British government’s asylum policy to that which could be found in 1930s Germany. He was ordered by the BBC to apologise for his actions, and was stood down from presenting duties after refusing to do so. A show of unity from Lineker’s fellow presenters delivered an unprecedented wave of walkouts and there was no commentary or punditry on offer across the BBC’s weekend football coverage.\n-\nExcellent – now let's see the govt. walk back the equally ill-considered sacking of Rob Campbell.\n-\nIndeed. When it comes to free speech the world has a long way to go.\nA Russian sports presenter who tweeted нет войне would be imprisoned. (and sacked)A sign or tweet with “нет войне” can earn up to 15yrs in prison. And over 14,000 Russians have been arrested for saying exactly that.\nhttps://twitter.com/Adbusters/status/1503798461619060736\n-\nYes they (Labour Govt) are all over the place with what these Govt appointees to boards etc are expected to do, able to do. It is perhaps lucky that the Nats are similarly bewildered.\nThey have allowed a level of imprecision in language to explain what is usually a very careful and distinct category of people/what they do/how they are described/how they are 'governed'\nPeople like Rob Campbell, Steve Maharey and Ruth Dyson in their roles as Govt appointees on Boards are not Public Servants…….aaaaaaaaaagh tears hair out including eyebrows!\nDo we really have to accept this dumbing down in case it frightens the horses or something or is it just slap dash, we can't be bothered educating people…move on to the next lot of Govt business that we can deliver something slap dash on.\nI asked before if Hipkins has employed some of the lesser lights such as Luxon did with the 'Hawaii is really Te Puke' snafu.\nVery disappointed as it has not put to bed anything, public servants, the real ones are now being lumped into some category of not being impartial in the delivery of Govts policies by News media.\nThe Westminister tradition is that public servants are voiceless and defended, if need be, by their Ministers or the Govt.\n-\n-\n-\n[deleted]\n[What is your intention with dumping YT clips here without any commentary or clear (political) point? Lift your game – Incognito]\n-\nIt speaks for itself, oh! does it run counter to the narrative you like to share on here? Zelensky is admitting to Nazis being in charge and American mercenaries in Ukraine in 2014, an inconvenient truth. Is that explanation enough?\n[If you dump links or YT clips here without any added commentary or point of your own, it is highly likely that you will be considered a troll. Trolls often whine that ‘it speaks for itself’, which is s typical lazy troll argument.\nIf you make up stuff about the contents and/or meaning of material, it is highly likely that you will be considered a troll with an agenda.\nIf you allege or insinuate that this site has an editorial policy of some kind or an approved and ‘official’ narrative, you clearly don’t know how things work here and haven’t read the site’s About (https://thestandard.org.nz/about/) and Policy (https://thestandard.org.nz/policy/) sections. Read these sections – ignorance is no excuse.\nIf you want to keep your commenting privileges here this Election Year, you need to lift your game. This is your only warning – Incognito]\n-\n[deleted]\n-\nWell I'm sure it's great for Adelaide ship-building teams, but no I'm not particularly impressed by nuclear-armed submarines in the South Pacific, whether they are run by Australia or not.\nBiden To Announce Deal For Australia Nuclear-Powered Attack Submarines | HuffPost Latest News\nIt obviously asks what role our new Poseidons will have in this.\nI sure don't feel the need to be a Peacenik but WTF to the proliferation of nuclear arms into Australasia.\n-\nBiden himself has reiterated that the Aussie subs will be nuclear powered but NOT nuclear armed.\nOur nations have made clear commitments to meet these objectives, including that:\n- As a non-nuclear-weapon state, Australia does not – and will not – seek to acquire nuclear weapons;\n- Australia will not enrich uranium or reprocess spent fuel as part of this program;\n- Australia will not produce its own nuclear fuel for its SSNs;\nThough the rotational force may be problematic:\nSubmarine Rotational Forces. As early as 2027, the United Kingdom and the United States plan to establish a rotational presence of one UK Astute class submarine and up to four U.S. Virginia class submarines at HMAS Stirling near Perth, Western Australia.\nGuess we will just have to look for Aussie flags flying from the periscope?\n-\nThe point is to extend the range of their subs – now basically a coast guard, to take out any foreign military ships trying to land.\nNuclear powered ones can be at sea for longer (thus more at the same time), and thus participate in any engagement further afield.\nThere purpose is the containment of Chinese military/navy (to the sea off China-Taiwan) kept away from ASEAN and Japan/South Korea (protect other trade routes if there are sanctions on China).\nThe need for them diminishes (rather than ends) if there is a deal over the future of Taiwan (say formally recognised as part of China from 2049, and only before then if Taipei and Beijing agree to terms over autonomy).\n-\nThe P8's & the Frigates is always has been Trade Protection which is a wee bit hard to train for in Peacetime as Shipping Companies, Unions & Freight Forwarding services etc don't like getting bossed by the military to do Convoy (Trade Protection) Exercises.\nSo they practise their respective skill sets within various Allied Surface Battle, Escort & Support Groups.\nP8's might get a tad more busy as the various Subs run along in the kermadec trench, which btw is being mapped by the Chinese courtesy of Joint NZ MFAT Funding arrangement!\nGoing to be some need to review what kind of Navy that NZ wants in future, considering that NZ's economy is an export led & is heavily dependent on have freedom of navigation IRT the various Sea Lanes of Communications to those Export Countries & same same in reverse for all those imports the NZ relies on to keep the economy ticking.\nSome very hard questions need to be asked now! At political, defence, economic, trade & foreign affairs level at where NZ goes now?\nOr else NZ will get sucked into to this shit sandwich weather it wants too or not & I doubt many here would have the guts or prepared to sacrifice something for Armed Neutrality which \"might\" avoid NZ from sucked into this vortex of this impending shit sandwich heading this way?\n-\nWell said as ever Scud.\n-\n-\nQuestions for the Australian government;\nIs it the Australian government and armed forces intention to respect New Zealand laws?\nIs it the Australian government and armed forces intention to keep Australian nuclear powered vessels out of New Zealand administered waters?\nWill the Australian government and armed forces publicly agree to keep all non-New Zealand devices and installations, as defined in the relevant New Zealand legislation, out of New Zealand.\nWill the Australian government publicly agree not to disregard New Zealand's Nuclear Free laws?\nIn line with a lawful request of the New Zealand authorities, if specifically asked, whether or not the Australian government and armed forces are operating any nuclear vessel in New Zealand waters, will the Australian authorities agree to provide the New Zealand authorities an answer?\nIn line with the neither confirm nor deny nuclear policy of both your US and UK AUKUS partners – if specifically asked, will you neither confirm nor deny if you operating any nuclear vessels in New Zealand waters?\nContinental Shelf Act 1964\n…..every act or omission which takes place on or under or above or about any installation or device (whether permanent or temporary) constructed, erected, placed, or used in, on, or above the continental shelf in connection with the exploration of the continental shelf or the exploitation of its natural resources shall be deemed to take place in New Zealand; and\n(b)\nevery such installation or device shall be deemed to be situated in New Zealand….\n(c)\nevery court in New Zealand which would have jurisdiction (whether civil or criminal) in respect of that act or omission if it had taken place in New Zealand shall have jurisdiction accordingly; and\n(d)\nevery power of arrest or of entry or search or seizure or other power that could be exercised under any enactment (whether passed before or after the passing of this Act) or under any rule of law in respect of any such act or omission or suspected act or omission if it had taken place or was suspected to have taken place in New Zealand may be exercised on or in respect of any such installation or device as if the installation or device were in New Zealand; and\n(e)\nwithout limiting the provisions of the Customs Acts (as defined in the Customs Act 1966), every installation or device, and any materials or parts used in the construction of an installation or device, which are brought into the waters above the continental shelf from parts beyond the seas shall be deemed to have been imported into New Zealand…..\n-\n-\nA real chewy and entertaining discussion between Katherin Ryan and Patrick Smellie, starting at 12 min. It's on the gap between recent aspirational government planning documents and the reality of implementation. Katherine mentions wider comments as a mix of critique, with a kind of regret for the old Public Service.\nRNZ Katherine Ryan interview discussing government transformation policies\nMorning Report often brings analytical depth that is missing conspicuously elsewhere. It's due 90% to Ryan's energetic curiosity, without the barbs of Kim Hill, but certainly with a bigger breadth of topic. Her poor brain at night, when does it rest? Whereas one can imagine Kim easily switching off with a stiff G&T.\n-\nSorry, Nine to Noon\n-\n-\nPublished in the Guardian about the UK. It equally applies here.\n- Comments are now closed",
  "word_count": 6233,
  "scraped_at": "2026-02-14T13:07:50.447970"
}