{
  "article_id": "249ebbe1fa4d",
  "url": "https://metro.co.uk/2024/05/29/barca-supporters-changing-means-a-hardcore-fan-20923195/",
  "title": "How Barca supporters are changing what it means to be a  hardcore  fan | Football",
  "date": "20240529T073000Z",
  "domain": "metro.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "When you conjure up the image of a hardcore fan, images of violence, chaos or abuse might come to mind. Among the great moments of football history, mayhem often also ensues.\nBut the definition of a ‘hardcore fan’ is changing, the new generation of supporters say. For Barcelona fans at the club’s Women’s Champions League final in Bilbao, they say it’s possible to be dedicated without being disruptive.\nGeorgina Léger is a content creator, former journalist and, most importantly to her, a Barcelona FC fan. She is eager to move away from the ‘hooliganism’ some people associate with top teams.\n‘We’ve had them [hooligans] in Barcelona,’ the 27-year-old tells Metro from the lobby of the Mercure Jardines hotel in the city centre.\n‘Almost every big club has its own hooligans. I don’t think they are real hardcore fans to be honest. To be a fan of a team means you align with the club in every way; with its victories and with its defeats.\n‘Hardcore fans are the ones who are willing to travel for their team, to stay up late if their team is playing in a different time zone, it’s being superstitious, it’s talking non-stop with your friends about football. It’s so many things which do not involve any sort of violence, homophobia, racism, or hate of any kind.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘That’s not what sport is about.’\nBarcelona has a reputation for football fandom, with the club intertwined with Catalan culture. Younger fans are able to embrace this way of being with two teams, since Barça Femení became fully professional in 2015 and took European football by storm.\n‘I feel proud to be a women’s football fan’, 11-year-old Rafik tells Metro the day after the Champions League final.\nIn Rafik’s bedroom back home in Barcelona, he is building his own personal museum. Football tops – including the likes of Arsenal, Hibernian, Crystal Palace and Cambridge United – adorn his walls as he grows his collection of memorabilia. One of the 11-year-old’s favourite shirts is, of course, Barcelona FC.\n‘I have one Barça top that is really special’, Rafik explains. ‘It’s been signed by 10 players on the Barça women’s team including Alexia [Putellas]. When I think of Barça, I think of the women’s team because currently they are the ones keeping the club alive.’\nHe admits the struggling Barça men’s team ‘is now a mess’ who are ‘failing a lot’, which has helped fuel fan excitement around the women’s side scooping trophies and wins left, right and centre.\nRafik, who watched Saturday’s game with his sister, parents and grandparents, got to witness Alexia Putellas’ goal and Chloe Kelly-esque celebration in all its glory. He was still giddy with excitement the following day when he spoke to Metro.\nHe adds: ‘Barça Femení is inspiring both young girls and boys. This team and these players are what any child dreams of being.’\nSupport for the women’s game is consistent, figures show, with three of the biggest crowds in the history of the UEFA Women’s Champions League in the 2022/23 season.\nAverage revenues of the top 15 women’s football clubs in Europe were also found to have grown by 61% to €4.3m euros over the last year. Barcelona Women remained at the ‘summit of women’s football’ in Europe, both on- and off-pitch. The club reported €13.4m in revenue for the 2022/23 season, a year-on-year increase of 74%.\nSpeaking outside the San Mamés Stadium where this year’s Champions League final took place, a group of men proudly explained to Metro they were fans of both teams.\nRafa, in the queue for entry with his friends, answered questions through his English-speaking friend Ana as the group moved up the ticket queue. He felt the ‘respectful’ support of women’s fans was making waves across football as a whole.\nAna translated for him: ‘When he was very young, Rafa was inspired by the team. He has supported them ever since then. He enjoys watching both the men’s and women’s teams play. It is a different experience, he says the women supporters can be more respectful.’\nIn Plaza Nueva, around half an hour from the San Mamés Stadium, the small square was blanketed in a sea of blue and red as men, women and children prepared for the game with pintxos, beer and music. One group of kids were having a dress rehearsal ahead of the match, lining up in front of a fountain to lift a huge hand-painted sign with the name of Ballon D’or winner Aitana Bonmati emblazoned on it.\nJordi Oquinena, a dad with the group, told Metro: ‘We are from Sant Pere de Ribes, the hometown of Aitana Bonmatí, a footballer player at Barcelona football team.\n‘We are always feeling very proud, as the children are. We are passionate. A bit crazy? Maybe.’\nJuana, 68, also paused for a quick chat on the day of the game. She explained through broken English how she had gone to Barcelona games since she was a young girl. ‘I have always watched Barcelona play’, she says. ‘Now with the women, I can see even more. They are very powerful and they make us [women] feel powerful.’\nAnd for Georgina, Rafik, Jordi, Rafa and Juana – what makes them a hardcore fan?\n‘We follow the football team wherever they go’ says Jordi. ‘They [Barcelona] are part of me’, adds Rafa. For Juana, she shrugs and points at the badge on her Barcelona top – with Putellas on the back. ‘I am always Barcelona’, she says.\nYoung Rafik, 57 years her junior, feels the same. He adds: ‘For me Barça is literally “more than a club,” it is a community filled with passion. These players inspire everyone in the crowd.’\nGeorgina says it’s the values associated with her football club which have shaped her life, journey into the creative industry and outlook on her future.\nMore Trending\n‘I’ve been a Barcelona fan since I was born’, Georgina explains.\n‘My family is half French but I was born and raised in Barcelona. Whether you like sport or not, a lot of people identify with the club because of what it represents. It’s a matter of sport, but it’s also a matter of identity. It’s about Catalan values of effort, teamwork, not always taking the easy route but also caring about the journey as well. All of this resonates with me and a lot of people in Barcelona, in Catalonia and across the world.\n‘That’s what makes Barcelona FC different.’\nREAD MORE: This is the ready made response Jill Scott has for anyone who questions women’s football\nDo you have a story you’d like to share? Get in touch by emailing Josie.Copson@metro.co.uk\nShare your views in the comments below.\nMORE: My cat went missing for over nine years, we still laugh at where we found him\nMORE: Jude Bellingham reveals message from Jadon Sancho ahead of Champions League final\nMORE: This painful condition is silently having a major impact on relationships",
  "word_count": 1214,
  "scraped_at": "2026-02-14T12:48:07.316450"
}