{
  "article_id": "24a5b653a56f",
  "url": "https://www.ksl.com/article/50720522/mighty-mai-mai-grad-transfer-libero-powers-no-9-byu-womens-volleyball-to-4-0-start",
  "title": "Mighty Mai Mai : Grad transfer libero powers No . 9 BYU women volleyball to 4 - 0 start",
  "date": "20230831T210000Z",
  "domain": "ksl.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Estimated read time: 4-5 minutes\nThis archived news story is available only for your personal, non-commercial use. Information in the story may be outdated or superseded by additional information. Reading or replaying the story in its archived form does not constitute a republication of the story.\nPROVO — Shortly before BYU women's volleyball celebrated its first home match of the 2023 season Wednesday night, new libero Kamaile Hiapo was celebrating her second week since arriving in Provo.\nThe Arizona graduate transfer was handed a big welcome by the announced crowd of 3,304 fans in the Smith Fieldhouse.\n\"It was really funny,\" recounted Hiapo, whose teammates call her Mai Mai. \"We were coming back from the Montana trip, and we reminded everybody it's a week anniversary for me on the team. It was really fun; there were all celebrating.\"\nHiapo totaled nine digs and seven assists, and Erin Livingston continued her run of form with 12 kills, three aces and three blocks, to help the No. 9-ranked Cougars to a 25-22, 25-26, 25-19 win over LMU in front of an announced crowd of 3,304 fans in the Smith Fieldhouse.\nWhitney Bower dished out 22 assists, six digs and four blocks for BYU (4-0), and Kate Prior added seven kills for the Cougars.\nBut in a match against a team ranked among the best nationally in total defense, with the Lions coming off a loss to defending national champion Texas and a win over Long Beach State, the Cougars needed the defensive punch of the fifth-year senior from Gilbert, Arizona — a 5-foot-7 converted outside hitter who totaled 24 kills, 453 assists and just shy of 1,600 digs in her time with the Wildcats.\nShe even smacked her first kill in a BYU uniform, though the one is not her career-high, she's quick to add.\n\"It's my favorite,\" Hiapo said. \"I love killing the ball.\"\nTHIS RALLY🤯🤯🤯 pic.twitter.com/85lN66hZOP\n— BYU Women's Volleyball (@BYUwvolleyball) August 31, 2023\nWith one year of eligibility remaining after earning her degree, Hiapo followed her older brother BJ — who played libero for the BYU men's volleyball team from 2009-11 — and gave Provo a try.\n\"It was a lot for me to graduate college and get my degree, so I think everybody is happy that I'm finally here and able to do my thing,\" she said. \"It's awesome being here before school starts, too.\"\nThe Cougars are glad she made the trip, too. Hiapo had double-digit digs in the Cougars' 3-0 start at the Ellesyn Invitational, including 14 in a 3-1 upset of then-No. 5 Pitt and 17 against host Montana.\nNo wonder when she settled into the back row after Loyola Marymount (1-2) held BYU to just .148 hitting in the first set, the Cougars synced right up until Eden Bower laid down her fifth kill with the match-winner in the third.\nThe transfer was everywhere, defense became offense, and Hiapo's passing helped BYU overturn an early 14-10 deficit into a 3-point win in the opening set before Livingston, Prior and freshman Mia Lee took over.\n\"We're all getting comfortable with who is next to each other, who is passing,\" BYU coach Heather Olmstead said of her transfer libero. \"We're still learning each other, and she's taken a leadership role. She lets the front row know that she's behind, and she communicates to the front row, which I think is helping the whole team.\"\nFor as much as Livingston gets deserved credit, the All-Big 12 preseason honoree owes her success to the passing game, she said.\n\"It's our defense and setters,\" Livingston said. \"Whitney and Kamaile, as our libero, set me up with good balls, so I was able to take rips because of their really good sets.\"\nOn a night when Nebraska broke a world record with 92,003 fans at Memorial Stadium — the most-attended women's sporting event in world history, according to the Associated Press, to beat out the previous record of 91,648 held by FC Barcelona women during a Champions League match against Real Madrid — the Cougars showed off their own unique home-court advantage a week before classes begin.\nOlmstead praised the Huskers' record-breaking sweep of Omaha.\n\"What a great day for women's volleyball,\" Olmstead said. \"I get the childs thinking about what Nebraska is doing for the sport of women's volleyball, and the fact that 90,000 people wanted to witness a volleyball game in a football stadium. It's good for momentum, for getting volleyball on TV, and for getting us seen more. It's a fast-growing sport, and we want as much exposure as we can. Kudos to Nebraska for making that happen.\"\nCould BYU pull off a similar feat, perhaps filling 65,000-seat LaVell Edwards Stadium for an outdoor match (and maybe even combined with a concert like Nebraska pulled off with country artist Scotty McCreery)? The Cougars have a passionate fan base, especially for volleyball, and reside in a state where the sport boasts immense popularity — from Utah State, which sold out its 3-0 sweep Wednesday night against Utah 3-0, in the north to the Cougars' Utah County neighbor at Utah Valley and beyond.\nLivingston praised the Huskers' efforts, but she'd love to see her team try to match the feat.\n\"It's so special that they did that, and that so many fans came out to watch women's sports,\" Livingston said. \"It's huge. It's really cool to see it build each and every year. ... I was also thinking, we need to do this.\"\nBYU continues its homestand with the doTERRA Classic, beginning Thursday night against McNeese State (8 p.m. MDT, ESPN+) and continuing Saturday against UC Davis (5 p.m. MDT, ESPN+).",
  "word_count": 942,
  "scraped_at": "2026-02-14T13:09:57.932832"
}