{
  "article_id": "24b6fe99400b",
  "url": "https://news.yahoo.com/lionesses-campaign-pays-off-girls-000100447.html",
  "title": "Lionesse campaign pays off as girls granted equal access to school sport",
  "date": "20230308T010000Z",
  "domain": "news.yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Lionesses’ campaign pays off as girls granted equal access to school sport\nGirls will be granted equal access to all school sport as part of a package of measures unveiled by the government to coincide with International Women’s Day.\nSchools will be told they must deliver a minimum of two hours of PE each week and that girls and boys should be able to play the same sports in lessons and extra-curricular clubs.\nThe move comes in response to a campaign launched by England’s Lionesses squad in the wake of their European Championship triumph last summer, in which they urged the government to pass measures to ensure that all girls get the chance to play football at school.\nPrime Minister Rishi Sunak said: “Last year the Lionesses’ victory changed the game. Young girls know when they take to the pitch that football is for them and, thanks to the Lionesses, they too could be a part of the next generation to bring it home for their country.\n“We want schools to build on this legacy and give every girl the opportunity to do the same sports as boys, as well as provide a minimum of two hours of PE. This means every child can benefit from regular exercise and we are proud to provide them with the support needed to do so.”\nThe government said the measures would be backed by over £600million in funding over the next two academic years, specifically designed to help improve the quality of PE and sports in primary schools.\nEngland women’s captain Leah Williamson said: “The success of the summer has inspired so many young girls to pursue their passion for football.\n“We see it as our responsibility to open the doors for them to do so and this announcement makes that possible. This is the legacy that we want to live much longer than us as a team.”\nThe announcement comes just over six months after the government was accused of jeopardising the Lionesses’ legacy by overseeing the continued sell-off of school playing fields.\nData obtained by the Liberal Democrats showed that 94 schools had sold their playing fields since January 2015, although some have been replaced with indoor sports facilities.",
  "word_count": 368,
  "scraped_at": "2026-02-14T13:03:16.917512"
}