{
  "article_id": "24c283500595",
  "url": "https://www.the42.ie/deloitte-money-league-6934538-Jan2026/",
  "title": "Real Madrid top football rich list as Liverpool surge and United drop",
  "date": "20260122T110000Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "REAL MADRID STAYED top of football’s rich list as Liverpool outstripped their English rivals for the first time, according to Deloitte’s Money League study on Thursday.\nSpanish giants Madrid generated nearly €1.2 billion in revenue in the 2024/25 season despite failing to win a major trophy.\nThe refurbishment of the club’s Santiago Bernabeu stadium into a multi-purpose venue continues to pay rich dividends — Madrid’s €594 million of commercial revenues alone would be enough for a place in the top 10.\nBarcelona climbed back into second place in Deloitte’s table (€975m) despite delays forcing them to play the whole season away from the Camp Nou, which is still being redeveloped.\nBayern Munch were third on the list (€861m), marginally ahead of Paris Saint-Germain, whose income was boosted by winning the Champions League for the first time.\nThe rest of the top 10 is dominated by Premier League clubs, with Liverpool leading the English contingent for the first time.\nAn expansion of Anfield plus a return to the Champions League and winning the Premier League title boosted the Reds’ revenue to €836m.\nManchester City and Manchester United both slipped down the list.\nPep Guardiola’s City fell from second to sixth after an early exit from the Champions League and a third-placed Premier League finish following four consecutive titles.\nUnited dropped behind Arsenal to eighth after missing out on the Champions League and finishing 15th in the Premier League.\nTogether, the 20 top-earning clubs in Europe reported an 11% increase in revenues to €12.4bn.\n“It is no coincidence that the clubs in the top half of the ranking are those with the ability to focus on commercial revenue development, particularly as domestic broadcast rights plateau,” said Tim Bridge, lead partner in the Deloitte Sports Business Group.\n“There is a pivotal shift in some club business models with an increased focus on maximising the impact of their brand and their stadium assets.\n“The presence of on-site breweries, hotels and restaurants is now commonplace and illustrates a strategic move to diversify income and create year-round entertainment destinations.”\nThe first 32-team Club World Cup had an impact, helping lift Bayern into the top three for the first time since 2020/21, while Benfica, in 19th spot on the 20-team list, are the first entrant outside the traditional “big five” leagues of England, Spain, Germany, Italy and France in four years.\nArsenal were the highest-earning women’s team for the first time after winning the Champions League.\nThe Gunners, with revenues of €25.6m, edged out London rivals Chelsea and Barcelona.",
  "word_count": 422,
  "scraped_at": "2026-02-14T12:51:29.943987"
}