{
  "article_id": "24c436fb68f2",
  "url": "https://www.thetablet.co.uk/features/the-pope-from-the-ends-of-the-earth/",
  "title": "The Pope from the ends of the earth",
  "date": "20250421T151500Z",
  "domain": "thetablet.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "When Cardinal Jorge Mario Bergoglio of Buenos Aires stood on the balcony of St Peter’s in Rome after being elected Pope on 13 March 2013, he told the cheering crowds that the cardinals of the Roman Catholic Church had “gone to the ends of the earth” to find the new pontiff.\nHe was a man from the periphery, and during his twelve years as Pope he put people on the peripheries – people in the developing world, those whose countries were most affected by climate change, the poor of rich cities like Rome, refugees and trafficked people – at the front and centre of his papacy.\nWhile millions of Catholics, as well as those of other faiths and none, loved him, there were many who were vehemently opposed to his papacy. They considered his concern for migrants, his excoriating critiques of unbridled capitalism, his focus on the environment, his desire to reform the Church, his loosening of strict teaching on divorce and remarriage, his reaching out to LGBT Catholics and his engagement with other faiths to be dangerously radical and subversive. And some of those who welcomed his election as a breath of fresh air were disappointed that a Pope they considered a force for progress did not deliver the changes to Church teaching they wanted.\nHe was, undoubtedly, a remarkable figure, whom history will remember for a number of firsts: the first pope from the Americas, the first from the global south and the first member of the Jesuit order to occupy the throne of Peter. And perhaps above all – because it was symbolic of all he stood for – he was the first to take the name Francis, honouring the poverello from Assisi who loved God, served the poor, pursued peace, wrote poems in praise of the sun, the moon and the stars, and heard a voice telling him, “Francis, go and rebuild my Church which, as you see, is in ruins.”\nBorn on 17 December 1936 in the Flores neighbourhood of Buenos Aires, Jorge Mario Bergoglio was from a family of migrants from Italy. He worked in various jobs in his youth, including as a bouncer, a janitor and a chemist, and developed a passion for football and the tango. He had part of one lung removed after a pulmonary infection when he was in his early twenties and became prone to bouts of bronchitis in winter. He decided to enter the Society of Jesus and was ordained on 13 December 1969. Only a few months after taking his final vows in 1973, at the age of just 36, he became provincial of the Jesuits in Argentina and Uruguay. The role, in which he was to serve for six years, proved to be full of pitfalls.\nHe cracked down on liberation theology – the rethinking of Catholicism imbued by the mood of Vatican II and, according to its critics, left-wing political ideology – within the order. At its 32nd General Congregation, called by its Superior General Pedro Arrupe in 1975, the focus of the order shifted to social justice, from educating an elite to serving the poor. After the completion of his term as provincial in 1980 Bergoglio became rector of the Jesuit seminary in Buenos Aires, where he insisted the seminarians should go out into parishes and work with the poor. But in the eyes of the liberation theologians, this was the traditional response to poverty: showing charity rather than challenging its causes. Bergoglio’s most controversial decision was to hand the Jesuit Universidad del Salvador to a conservative Peronist group, the Iron Guard. It was something for which many Jesuits never forgave him.\nBetween 1976 and 1983 Argentina was ruled by a brutal military junta, and some 10,000 people, including priests and nuns, were “disappeared” in the so-called “Dirty War”. Among them were two Jesuit priests, Ferenc Jálics and Orlando Yorio, who lived alongside Marxist groups in the slums. Bergoglio ordered them to move out of the shanty town and live in a conventional Jesuit house. They refused. Soon after being told by Bergoglio that they were no longer part of the Jesuits, they were arrested, taken to one of the junta’s interrogation centres and tortured. It eventually took five months to secure their release. The debate over how the two priests came to be freed rather than murdered has lasted far longer. Some claim that it was because Bergoglio intervened. But while Jálics publicly absolved Bergoglio of complicity in his ordeal, Yorio died in 2000 believing that he had betrayed him. Bergoglio helped smuggle seminarians who had worked in the slums out of the country. Others were helped by him clandestinely. But he did not speak out publicly against the military regime. For many Argentinians, his decision to keep his counsel and work behind the scenes tainted his record.\nBergoglio was a divisive figure among the Jesuits in Argentina. He attracted many followers, who found him a charismatic figure. They liked his personal lifestyle, the simplicity of his way of life, the lack of ostentation. Others found him authoritarian. After he completed his term as rector, the order’s leadership did not know what they should do with him. They found him to be meddlesome and critical of their work. Eventually he was effectively exiled to Córdoba, Argentina’s second city, by the Superior General in Rome, Peter-Hans Kolvenbach. From being leader of the Argentinian Jesuits at the age of 36, Bergoglio was now, still only 50, stripped of all responsibilities.\nIn an interview shortly after he became Pope, he told Fr Antonio Spadaro: “I found myself Provincial when I was still very young. I was only 36 years old. That was crazy. I had to deal with difficult situations and I made my decisions abruptly and by myself. My authoritarian and quick manner of making decisions led me to have serious problems and to be accused of being ultra-conservative. I lived a time of great interior crisis in Córdoba.”\nJorge Bergoglio: Christians must embrace the failure of the Cross\nNot the full story – Austen Ivereigh on the Pope’s new autobiography\nSomething dramatic certainly happened. The Jesuit provincial who had been an authoritarian figure, travelling in a chauffeur-driven car, was transformed into a man of humility. The change became apparent when he arrived back in Buenos Aires in 1992, appointed as an auxiliary bishop by the Archbishop of Buenos Aires, Cardinal Antonio Quarracino. In 1997, Bergoglio was appointed coadjutor archbishop; after Quarracino’s death in February 1998, he became metropolitan archbishop; he was created cardinal by John Paul II in the consistory of 2001.\nBergoglio’s empathy with those at the bottom of the economic ladder was evident in his simple lifestyle, which included travelling on the Buenos Aires metro. He encouraged the laity to get more involved with the Church, warned of the dangers of “clericalism”, built bridges between the Catholic charismatic movement and evangelical Pentecostalism and promoted interreligious dialogue, especially with Jewish and Muslim leaders.\nAlthough Bergoglio had come second in the ballot that elected Cardinal Joseph Ratzinger as successor to John Paul II in 2005, hardly any commentator mentioned his name as a possible candidate in the conclave that followed Pope Benedict’s surprise resignation 2013. The short speech he gave in one of the gatherings of cardinals that preceded the conclave, in which he said that the Church had become “too navel-gazing” and urged that it needed to go out to tell the world the good news of Christ and connect with people at the “peripheries”, convinced several cardinals that Bergoglio would be the right man for the papacy.\nAt the fifth vote Bergoglio reportedly secured 90 out of 115 votes, well over the two thirds majority needed to be elected. Later he was to recall that his friend Cardinal Claudio Hummes hugged him after he was elected and whispered, “Don’t forget the poor.” At that moment he decided to take the name Francis to honour the Italian saint, so associated with the concerns that were to come to shape his pontificate: the poor, ecology, peace, and the call to “rebuild my Church”.\nThe next day, the new Pope took an ordinary car, not a limousine, to the Basilica of Santa Maria Maggiore to offer prayers to the Virgin Mary and to stop at the altar where the founder of the Jesuits, St Ignatius of Loyola, had celebrated his first Mass. He announced that the papal apartments in the apostolic palace were too big for him and he didn’t need them. Instead he remained living throughout his pontificate in the Casa Santa Marta, where he and the other cardinals participating in the conclave had stayed. Like his decision to abandon the traditional papal garb, such as the mozzetta, the little red and fur-lined cape used by his predecessors, and the red shoes that popes have sometimes worn, it sent a message that he would continue to live simply.\nIt was clear from early on that Francis wanted to bring about major reform in the Church. He moved out four of the five cardinals who ran financial affairs and replaced them with his own appointments as well as bringing in lay experts to advise him. He appointed eight cardinals from across the globe to advise him on governance of the Church and curial reform. Several of them had previously been outspoken in their criticism of curial dysfunction and the way the Church dealt with sex abuse. It would signify what was to come – bold reforms that would involve more lay people, men and women, participating in synods, first speaking in them, and later having equal standing with cardinals and bishops when it came to voting.\nDuring an in-flight press conference on his way back to Rome from his first papal trip, World Youth Day in Rio de Janeiro, he was asked about reports that there were groups of gay priests in the Vatican. He answered: “If a person is gay and seeks the Lord and has goodwill, who am I to judge?” It was a response that became a leitmotif of a papacy marked by mercy rather than judgement.\nA gesture that moved people across the world was his decision to conduct the traditional ritual of washing people’s feet on Maundy Thursday – to commemorate Christ washing the feet of his disciples – not in St Peter’s Basilica but in a youth prison, where he tenderly washed the feet of 12 prisoners, Christians, Muslims and atheists, young and old, men and women. At the Chrism Mass that same first Maundy Thursday after his election, he reminded more than a thousand priests, bishops and cardinals present that a priest should be a shepherd who is close to his people, with “the smell of the sheep”.\nThe Maundy Thursday feet washing dismayed some conservative Catholics, who saw it as an unnecessary setting aside of tradition. It was an antipathy that continued throughout Francis’ pontificate, which was marked by bitter resistance from some in the Church to his reform agenda. When he released his post-synodal response to the Synod on the Family, the apostolic exhortation Amoris Laetitia, in 2016, beside much that was conventional Catholic teaching there was an opening of the door towards a readmission to the sacramental life of the Church in some circumstances for divorced and remarried Catholics. This led to an extraordinary attack by four cardinals, who said the document had caused “grave disorientation and confusion”. There was greater outrage when the Dicastery for the Doctrine of the Faith published Fiducia Supplicans in December 2023, declaring that priests could give blessings “outside of a liturgical framework” to “couples in irregular situations and same-sex couples” without “officially validating their status or changing in any way the Church’s perennial teaching on marriage”.\nThe Pope of Blessing – Fiducia Supplicans\nPope Francis and the permanent revolution\nFrancis sought to unify Catholics around the new form of the Roman rite that had emerged after the Second Vatican Council. He considered that after sixty years the older forms of the Roman rite still favoured by some traditionalist Catholics should be gradually but firmly discontinued. His motu proprio, Traditionis Custodes, published in 2021, not only repealed Benedict’s Summorum Pontificum, which had enabled wider use of the older form of the Roman rite, but went further in restricting it. He was seen by his opponents to be lacking in pastoral sensitivity.\nIn his 2015 encyclical, Laudato si’ on climate change, Pope Francis attacked consumerism and environmental degradation, which had its greatest impact on the poorest people. The encyclical was welcomed by climate scientists, global leaders and environmental campaigners as well as by Catholics around the world concerned about the impact of climate change on people’s communities, homes and livelihoods. His blunt critique of consumerism and the “throwaway culture” and his outspoken concern for refugees and marginalised made him both a revered and an anathematised figure, inside and outside the Church. One of the first visits of Francis’ pontificate had been to the island of Lampedusa, midway between Tunisia and Sicily, where many of those attempting to reach Europe from the north coast of Africa end up, their corpses sometimes washed onto its shores. Praying at an altar made from the wood of wrecked migrants’ boats, he coruscated those “in this globalised world” who have “fallen into globalised indifference; we have become used to the suffering of others”.\nFrancis’ commitment to justice for the poor took him to the global South on many occasions, perhaps most memorably on a joint peace-making visit to war-torn South Sudan alongside the Archbishop of Canterbury Justin Welby and the Moderator of the Church of Scotland Dr Iain Greenshields in February 2023. It was an unprecedented journey of peace – and an unprecedented ecumenical mission.\nIt had long been a goal of Vatican diplomacy to bring Chinese Catholics together under one hierarchy of bishops. After several years of negotiations, in 2018, the Chinese government and the Vatican signed an agreement over the appointment of bishops, the details of which have never been published, which in practice allows the Chinese government to recommend bishops before they are appointed by the Pope – although he can veto them. While defenders say Vatican diplomats are playing a long game, critics see Francis as naïve at best in his assessment of the potential for religious freedom under the Beijing regime.\nPope Francis’ critics came from different quarters. Many Catholic women who welcomed Pope Francis’ election grew frustrated at what seemed like obfuscation and delay over women deacons and a wider failure to make full use of the talents of women in the Church. He appointed women to senior positions in the Vatican, including Sr Simona Brambilla as prefect of the department responsible for religious orders, and Sr Raffaella Petrini, the first-ever female secretary general of the Vatican City State, responsible for the territory’s health care system and police force. But he stuck to the status quo when it came to the Church’s teaching on the ordination of women. His desire for more involvement of the laity in the Church led to the Synod on Synodality and in October 2023 its general assembly gathered in Rome, in part to discuss women deacons, concluding that the topic required further study and conversation. In May 2024 Francis took the question of women deacons – along with other contested issues – off the discussion table, so that the synod could focus on synodality itself, instead assigning it to a study group. That same month, in an interview with a US TV show, he ruled out women becoming deacons.\nFrancis’ handling of the sexual child abuse by priests and its cover-up sometimes caused alarm and despondency among Catholics and people outside the Church, including victims and survivors. It began well: in 2014 he set up the Pontifical Commission for the Protection of Minors, an advisory body within the Vatican, to evaluate the Church’s work and initiate reforms. But some of its members became increasingly disillusioned about the extent to which the Church was willing to change. In 2023, the Jesuit priest Hans Zollner, one of the Church’s foremost experts on sex abuse, quit the commission, protesting at shortcomings in its accountability, transparency, competence and responsibility.\nFrancis introduced important reforms. He put in place new rules that made it mandatory for all dioceses to set up systems for reporting abuse and cover-ups, and had extensive revisions made to canon law to force bishops to take actions against priests who abuse minors and vulnerable adults. But while he showed he was willing to act against those clerics too lax in dealing with abuse or even involved in it, to some he was too slow to recognise and address the roots of the problem. For years rumours had swirled around Cardinal Theodore McCarrick, the former Archbishop of Washington, both in the US and in the Vatican, but it took until 2018 for the Holy See to remove him from ministry and until 2019 for him to be laicised. After Fr Gustavo Zanchetta, whom he had appointed bishop of Oran in Argentina, quit over abuse accusations, Francis gave him a post in Rome. Zanchetta was eventually sentenced in Argentina to four and a half years in jail for sexually abusing seminarians. Francis’ treatment of Zanchetta outraged those who believe the Church’s chief problem is its protection of abusers and its failure to listen to victims and survivors, a consequence of what Francis himself called “the culture of clericalism”. The case left him open to charges of hypocrisy.\nThroughout his pontificate, Francis was excoriated by some for being too “left-wing”. In his encyclical Fratelli Tutti, signed in Assisi and released on 4 October 2020, St Francis’ feast day, he took an uncompromising stand against the “myopic, extremist, resentful and aggressive nationalism” that he saw as growing across Europe, the US and parts of Latin America. But there were concerns that Francis did not fully appreciate the grave threat that Russia under Putin posed to the democratic world, and his response to the beleaguered Ukrainians, whose country was invaded by Russian forces in 2022, was not as fulsome as many would have liked.\nIn March 2024 Francis was criticised for suggesting that Ukraine should negotiate an end to the war with its neighbour. While US President Donald Trump might have had some sympathy with the Pope’s desire to end the war through talks, there was little common ground between the two, making for tense relations between the United States and the Holy See. During Trump’s first presidency between January 2017 and January 2021, Francis made his opposition to Trump’s planned wall between Mexico and the United States clear, and in 2019 said he was willing to meet the President to urge him not to separate children from their families through his migration and deportation policies. Then, within a month of Trump’s inauguration for his second term in January 2025, Francis wrote a letter to the US bishops which was clearly a rebuke to the president, warning that “the act of deporting people who in many cases have left their own land for reasons of extreme poverty, insecurity, exploitation, persecution or serious deterioration of the environment, damages the dignity of many men and women, and of entire families, and places them in a state of particular vulnerability and defencelessness”. On Holy Saturday morning, Vice President J.D. Vance met the Secretary of State Cardinal Pietro Parolin and Archbishop Richard Gallagher in the Vatican, who reminded him of the Church’s position on migrants and refugees. Vance had a brief private meeting with Francis yesterday, Easter Sunday, shortly before he appeared in his wheelchair to bless the faithful in St Peter’s Square. The Vatican announced this morning, Easter Monday, 21 April, that Pope Francis, the 265th successor of St Peter, had died at 7:35 a.m. at the age of 88.\nIn the latter years of his pontificate, Francis had had several health problems, and was seen regularly in a wheelchair. He was taken to the Gemelli Hospital in Rome to be treated for pneumonia in both lungs on 14 February, and had two close brushes with death. He was discharged from hospital on 23 March. He continued to work. On 9 April he had a private meeting with King Charles and Queen Camilla at the Vatican on 9 April, and wished them a happy twentieth wedding anniversary. Even in his last illness he made almost daily calls to the parish priest of the Holy Family church in Gaza City, where Catholics and others sought shelter during the bombardment of Gaza by Israel that followed Hamas’ massacre of Israelis on 7 October 2023. Fr Gabriel Romanelli said the Pope’s calls were “words of comfort”. Others, too, said that they received phone calls from the Pope – spontaneous, simple gestures that were part of how he lived. And it was this, perhaps even more than his interventions on the world stage, or his encyclicals, or the conflicts with the Curia, for which Francis will be remembered. How he lived struck a chord with people inside and outside the Church: a simpler life, focused on Christ, not on the trappings of office, and a ready, pastoral sympathy for people’s troubles.\nPope Francis: the wounded prophet\nPope Francis: a prophet of hope in a despairing world\nThe Church, he said, should be like a field hospital after battle, tending to people’s wounds. In March 2020, during the Covid pandemic, he stood, completely alone, in a dark, rain-soaked St Peter’s Square. “We were not shaken awake by wars or injustice across the world, nor did we listen to the cry of the poor or of our ailing planet,” he said. “We carried on regardless, thinking we would stay healthy in a world that was sick.” But the pandemic, he said, was “a time to choose between what matters and what passes away, a time to separate what is necessary from what is not.”\nIt was the Pope as the great communicator. The man from Argentina, from the periphery, had an uncanny ability to speak the language of people across the world and reconnect many to their faith. It was his greatest gift as pope.\nJorge Mario Bergolio, born 17 December 1936, Buenos Aires, Argentina, elected Pope 13 March 2013, taking the name Francis, died Rome, 21 April 2025.\nThe full obituary will appear in The Tablet edition of 26 April 2025.\n0 Comments\nFounded in 1840, The Tablet is the leading independent English-language Catholic weekly, celebrated for great writing, astute analysis, brilliant arts and books reviews and trustworthy reporting from correspondents in Britain, Ireland, Rome and across the world.\nIndependent, high-quality journalism is at the heart of what we do. The Tablet does not have deep pockets and we are not funded by rich donors. If you appreciate our work please consider supporting The Tablet’s Development Fund. It only takes a moment and you can cancel at any time.\n- Support with £5 per month\n- Support with £10 per month\n- Support with other amount.\nMOST READ ARTICLES\n-\n1\nSeamus Heaney – a ‘wide pre-reflective stare’\n-\n2\n‘The whole thing is relational’: Archbishop Moth embraces ‘leadership of service’\n-\n3\nCommission finds 50 child abuse cases in Polish diocese\n-\n4\nChurch of England urges fresh commitment to ‘ending poverty in all its forms’\n-\n5\nHonouring Catholic tradition and social teaching, this school is committed to academic excellence and the happiness of every child\n-\n6\nFollowing a grandmother’s footsteps through Albanian history\nFROM THE EDITOR'S DESK",
  "word_count": 3921,
  "scraped_at": "2026-02-14T14:17:40.603950"
}