{
  "article_id": "24e0c5dea70f",
  "url": "https://www.sbs.com.au/news/article/its-happening-everywhere-advocate-says-mary-fowler-racism-incident-goes-deeper/kj0buoxg2",
  "title": "  It happening everywhere : Athletes react to Mary Fowler alleged racism experience",
  "date": "20251121T024500Z",
  "domain": "sbs.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "French football club Montpellier has issued a statement denying racism allegations made by Australian former player Mary Fowler, while the Matildas share their support alongside prominent sporting figures.\nIn her new book, Bloom, Fowler alleges she experienced racism from a teammate during her time with Montpellier.\nShe recalls there was a post-match presentation on the field for departing players, who were given flowers, but Fowler says she and a Dutch teammate, Ashleigh Weerden, were left out.\n\"Afterwards, when we got inside the changing room, some of our teammates questioned why we hadn't received any flowers,\" Fowler wrote.\n\"We shrugged our shoulders, just as clueless as they were.\n\"A few of the girls laughed about it and then one of the other players came over and handed my friend and me some bananas, saying, 'Here, have these.' That was the cherry on top.\"\nFowler said not receiving flowers was one thing, \"but as two of only six black girls in the squad, receiving bananas wasn't something I could laugh off and forget about it\".\nShe also shared other experiences at Montpellier, in a chapter titled Not So Great Days, admitting she considered quitting the sport during her time in France.\nMontpellier responded by saying there was no evidence to support Fowler's account and indicated it was considering legal action.\n\"Some of them are particularly serious, and the shortcut that results from them, portraying the club as a racist entity, is unacceptable,\" the club said in a statement.\nFowler joined Montpellier in 2020 at the age of 17 and spent nearly three seasons with the club before signing with Manchester City in 2022.\n'It's about time we call it out'\nIn an interview with SBS News, former AFL Women's player Akec Makur Chuot backed Fowler, saying she was proud of her for speaking out about her alleged experience.\n\"I think it's about time that we call it out and that our lived experiences are acknowledged and our dignity is respected as well because we're the victims,\" she said.\n\"It's not just only happening in France, it's happening everywhere. It's happening right here in Australia.\"\nChuot was drafted by Fremantle in the 2016 AFLW draft, making her debut in 2017. She later joined Carlton, Richmond and Hawthorn, playing 40 games across six seasons before announcing her retirement in 2023.\nShe said racism is an experience common for athletes.\n\"I know a lot of players that have just decided to walk away because of either racism or discrimination,\" she said.\n\"They've just decided it's better for their mental health and physical health.\"\nAbout Fowler's alleged experience, Chuot said by sharing such an incident, \"you're not just advocating for change for yourself, you're advocating for change for a lot of people\".\n\"In order for solutions to happen, it will take all of us, from people with really high profiles like Mary, to the people who are at the local clubs,\" she said.\nMatildas head coach Joe Montemurro has also come out in support of Fowler.\n\"The only reaction that I've got on that is 'that courageous girl',\" he told reporters in Sydney on Friday.\n\"It's a great example of what needs to be done. It's amazing to talk about these issues, which faces a lot of young sportspeople at the moment.\"\nIn a social media post, former Socceroo captain Craig Foster also shared his support for Fowler, calling her \"brilliant and clearly very brave\".\n\"Racism is ever-present in society and, of course, sport all around the world, and athletes must be supported when exposing what they face daily,\" he wrote on X.\nA recent national survey by Sport Integrity Australia found nearly half of athletes and coaches who witnessed and experienced bullying, racism and body shaming choose not to report it formally.\nThe study surveying more than 1,200 community and professional athletes and coaches found 46 per cent of athletes would not report body shaming, 43 per cent racism, 40 per cent bullying, and 38 per cent inappropriate sexual behaviour.\nThe study noted the lack of formal reports was due to uncertainty about the seriousness of the issue or how to seek help.\nReaders seeking support with mental health can contact Beyond Blue on 1300 22 4636. More information is available at beyondblue.org.au. Embrace Multicultural Mental Health supports people from culturally and linguistically diverse backgrounds.\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
  "word_count": 734,
  "scraped_at": "2026-02-14T12:13:03.145730"
}