{
  "article_id": "24e2103d841f",
  "url": "https://www.miragenews.com/aramco-named-official-sponsor-of-2026-fifa-1611357/",
  "title": "Aramco Named Official Sponsor of 2026 FIFA Women Cup",
  "date": "20260130T171500Z",
  "domain": "miragenews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Aramco named Official Sponsor of first-ever women's intercontinental club competition ahead of trophy decider in London on 1 February 2026\nPartnership continues long-standing collaboration between FIFA and Aramco in relation to women's football development\nArsenal Women FC and SC Corinthians to compete for intercontinental crown, with tickets for third-place play-off and final available now at FIFA.com/tickets\nAramco has been named Official Energy Sponsor of the inaugural edition of the FIFA Women's Champions Cup™ , which is set to crown the first-ever women's intercontinental club champions in London on Sunday, 1 February 2026. The agreement between FIFA and Aramco marks a natural progression in the company's efforts to promote and grow the women's game. In close collaboration with FIFA, Aramco has been supporting development programmes in line with FIFA's Women's Football Strategy . This includes contributing to participation pathways and the visibility, sustainability and commercial growth of women's football on the international stage. \"This is an incredibly exciting moment for women's football. A major new tournament creates fresh opportunities for players to compete on a global stage and for fans to experience the very best of the women's game,\" said Sara Booth, FIFA's Elite Women's Football Director.\n\"The partnership with Aramco is a powerful signal of our belief in the future of women's football, allowing FIFA to elevate the Women's Champions Cup even further, accelerate its growth and continue the remarkable development in the women's game that we have witnessed in recent years. Together we are building momentum that will inspire players and audiences around the world.\" Rania Biltagi, Aramco's Head of Sponsorships and Partnerships, added: \"Our sponsorship of the FIFA Women's Champions Cup 2026 is another exciting milestone for Aramco. Building on our major worldwide partnership with FIFA, we are providing more opportunities for women to play and grow the game.\"\n\"At Aramco, we have a proud history of providing energy around the world, inspiring progress, enabling communities and empowering individuals. This tournament provides a global stage for female players to shine and, importantly, inspire countless others around the world. Our commitment to women's football is also aligned with our wider ambition to promote youth engagement, expand career readiness and create new pathways for women to pursue their dreams, whether as athletes, engineers or future industry leaders.\"\nSupporters continue to look forward to the action set to unfold at Arsenal Stadium this Sunday, when the first women's intercontinental club champions will be crowned. The venue will host both the third-place play-off between CAF Women's Champions League winners ASFAR (Morocco) and Concacaf champions Gotham FC (United States) at 14:45 GMT (15:45 CET), followed by the final at 18:00 GMT (19:00 CET) between UEFA Women's Champions League holders Arsenal Women FC (England) and CONMEBOL Libertadores Femenina titlists SC Corinthians (Brazil), bringing the maiden instalment of the FIFA Women's Champions Cup to a memorable close.\nTickets for the FIFA Women's Champions Cup 2026™ medal matches are available now via FIFA.com/tickets .",
  "word_count": 488,
  "scraped_at": "2026-02-14T12:38:30.136650"
}