{
  "article_id": "24ed363e7e8c",
  "url": "https://www.birminghammail.co.uk/news/showbiz-tv/every-disney-user-uk-faces-31766703",
  "title": "Every Disney+ user in united kingdom faces £1 , 000 fine for watching new TV show",
  "date": "20250602T060000Z",
  "domain": "birminghammail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Every Disney+ user in UK faces £1,000 fine for watching new TV show\nThe streaming giant announced it had won the broadcasting rights for the UEFA Women’s Champions League across Europe for the next five years.\nDisney+ viewers could be slapped with whopping £1,000 fine if they tune into huge new sports boost. The streaming giant announced it had won the broadcasting rights for the UEFA Women’s Champions League across Europe for the next five years.\nBut viewers require a TV Licence to watch live content - even through a streaming platform like Disney+. And being caught without a TV Licence can result in a hefty £1,000 fine.\nBut viewers are warned any form of live broadcasting in the UK requires a TV licence by law, regardless of the platform used. Daniel McAfee, Head of Legal Operations at Lawhive, has cleared up the rules and says that regular Disney+ viewing doesn't require a TV licence.\nREAD MORE UK could face new 'blanket' speed limit with millions of drivers warned\nHe said: \"For standard, on-demand content such as TV series, films, or other non-live programming on Netflix, a TV licence is not required.\" But he warned that \"under UK law, any live television broadcast requires a valid TV licence, regardless of the streaming platform.\"\nThose caught watching live content without a licence face fines up to £1,000, or £2,000 in Guernsey. TV Licensing previously issued a warning back in November ahead of Netflix's Jake Paul vs Mike Tyson live fight.\n\"A TV Licence is needed to watch live content on streaming services, watch or record a TV programme on any channel and when using BBC iPlayer,\" a rep said at the time.\n\"Further information is available on the TV Licensing website or via the customer services team, who can help with any queries.\"\nDisney+ EMEA general manager Karl Holmes said: \"The UEFA Women's Champions League is the very best in football performance, dedication and passion.\n\"Bringing this incredible tournament to our customers speaks to our commitment of delivering a huge range of bold and dynamic entertainment.\n\"As women's football continues to grow with audiences worldwide, we're proud to offer the thrill and excitement of every single match to Disney+ customers across Europe, at no extra cost.\"\nUefa marketing director Guy-Laurent Epstein added: \"The UEFA Women's Champions League has seen exceptional growth in recent years, with record-breaking attendance, rising standards, and increasing global interest.\n\"These new broadcast deals not only reflect this but are important milestones in the continued development of women's football in Europe, underscoring its growing importance and appeal to fans worldwide.\"",
  "word_count": 432,
  "scraped_at": "2026-02-14T12:50:04.166895"
}