{
  "article_id": "252db6db623c",
  "url": "https://tribune.com.pk/story/2408092/womens-team-in-dubai-saga",
  "title": "Women team in Dubai saga",
  "date": "20230325T093000Z",
  "domain": "tribune.com.pk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Women’s team in Dubai saga\nPakistani footballers are training in city for Olympic qualifiers without any announcement\nSecrecy and the lack of transparency around the Pakistan women’s team continue as it has been revealed that the players are in Dubai training for the Olympic qualifying round, but nobody knows why the Gulf state was chosen as the training venue.\nThe Express Tribune learned on Wednesday about the women’s camp being shifted to Dubai from Lahore, while none of the Pakistan Football Federation (PFF) social media handles mention the development.\nThe PFF Normalisation Committee has been extremely secretive when it comes to the women’s game.\nPakistani women are to play in the Olympic qualifying round for the first time in history. They will kick off their campaign in the tournament against the Philippines on April 3, while the two other teams in Group E are Hong Kong and hosts Tajikistan.\nOnly on Friday, Philippines women celebrated their best position in the FIFA world ranking, they are in 49th place.\nMeanwhile, the PFF NC said that they sent all 23 of those in the camp to Dubai.\nIt has been learnt that four players are not with the rest as their visas have been rejected.\nThe modus operandi of the PFF NC and the management led by head coach Adeel Rizki is not only suspicious but also begs the question of why women are being kept isolated, whereas men’s teams are a lot more open about their operations.\nEarlier, several women footballers, who were part of the historic comeback of Pakistani girls on the international stage with the South Asian Football Championship, spoke out against the toxic environment, verbal, and emotional abuse and blatant nepotism in the national camp and within the national team management perpetrated by the head coach Rizki. The NC Head Haroon Malik has been complacent in the matter when the women spoke up about the abuse.\nWhen The Express Tribune enquired about the hush-hush nature of the training tour, at first the PFF NC media manager denied the update but later admitted that the women are, indeed, in Dubai for training.\nThe information made available to The Express Tribune shows that the players in the national camp are also not allowed to post anything about the Dubai training on social media and they are not allowed to share any information with their friends either.\nHowever, when asked on which date the camp was moved to Dubai, no exact date was given.\nSimilarly, when asked about the duration of the camp the answer to the question was just as uncertain, “eight to 10 days”. The team will be announced a few days before the tournament.\n“You can say that Dubai was doable for us,” The PFF NC member Shahid Khokhar told The Express Tribune when asked why Dubai was the choice for training the women. Maria Khan, the US-born player lives in Dubai, which may be the reason for shifting the training camp there.\nKhokhar did not reply to the question directly but added, “There is no particular reason as such. It is a golden opportunity for the players. They are training there in an international environment.”\nThe team also has diaspora players in the camp.\nThe camp was called with mostly the same players who played a friendly tournament, Four Nations Cup, in January against hosts Saudi Arabia, Mauritius and Comoros. Pakistan finished second in the event.\nThe PFF NC also delayed the announcement of the players named in the camp last month, while there had been no trials for the selection of the most important matches in Pakistan women's football history, which is the Olympic qualifying tournament.\nMany stars of women’s football have been omitted from the national squad altogether, despite them being fitter than those included in the camp.\nMany players continued to play football during the eight-year lapse in women's team activity which was caused by the institutional crisis of the PFF.\nHowever, they were shown the door despite showing the capabilities and will to play in favour of the coach’s club footballers or the diaspora players.\nRizki, a UEFA License B, has previously shown an absolute preference toward the diaspora players, so much so that he selected three of them and they did not have the Pakistani passport.\nThe tournament’s organising committee of Four-Nation Cup refused to let the three players be on the field due to the missing passports.\nWhen asked why updates about the women's team are not made public, the PFF NC member did not give any reason either. \"We just didn’t put it out on the media because we were busy in the meetings,” said a PFF official.\nThe NC Chief Malik redirected the queries regarding the Dubai camp to Khokhar and added that he is ‘very happy’ that men's and women’s teams are active.\n“I am very proud of the work they are putting in and everyone on the team as well,” said Malik.\nCOMMENTS\nComments are moderated and generally will be posted if they are on-topic and not abusive.\nFor more information, please see our Comments FAQ",
  "word_count": 849,
  "scraped_at": "2026-02-14T12:26:22.086526"
}