{
  "article_id": "25464f959f29",
  "url": "https://www.townandcountrymag.com/society/tradition/a65338414/prince-william-england-lionesses-switzerland-womens-euros-2025/",
  "title": "Women Euros 2025 : Prince William Cheers on Lionesses in Zurich",
  "date": "20250709T180000Z",
  "domain": "townandcountrymag.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Prince William made a visit to Zurich to cheer on the Lionesses in a fierce match against the Netherlands on Wednesday. The pressure is on for England as the team became the first reigning champion to lose a Women's Euro opener, as France won that match 2-1.\nThe Prince of Wales visited the team at England’s national football center in St. George’s Park on June 30 before the Lionesses departed for Switzerland. There he heard from head coach Sarina Wiegman and other senior FA personnel on how the team was preparing for the tournament. The Prince of Wales also helped with pressing the lettering onto some of the players' jerseys. “It’s a lot of pressure,” he joked at the time.\nAs patron of England's Football Association, it had been speculated William might make an appearance at some point during the European tournament. He presented the trophy to the English women’s national team when they won at home in 2022, but he did not travel to Australia when they made the Women’s World Cup final in 2023. (He later apologized, but he did meet with the team before when he was still president of the FA.) As Prince of Wales, Prince William also shared a message of well wishes for the Welsh team, making their first appearance ever in the Women’s Euros, on Instagram Stories on Saturday.\nOther royal families have also made the trip to Switzerland for their women’s teams. Queen Maxima and Princess Ariane attended the first match for the Netherlands against Wales on July 5, seeing the Orange Lionesses win by 3-0, and King Philippe of Belgium also turned up for his country’s match against Spain on Monday.\nEngland will next play Wales on Sunday, July 13 at 3 p.m. eastern.\nRachel King (she/her) is a news writer at Town & Country. Before joining T&C, she spent nearly a decade as an editor at Fortune. Her work covering travel and lifestyle has appeared in Forbes, Observer, Robb Report, Cruise Critic, and Cool Hunting, among others. Originally from San Francisco, she lives in New York with her wife, their daughter, and a precocious labradoodle. Follow her on Instagram at @rk.passport.",
  "word_count": 361,
  "scraped_at": "2026-02-14T12:12:44.701821"
}