{
  "article_id": "2550439cf55d",
  "url": "https://www.fourfourtwo.com/news/who-is-the-most-expensive-american-player-of-all-time",
  "title": "Who is the most expensive American player of all time ? ",
  "date": "20241226T130000Z",
  "domain": "fourfourtwo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Who is the most expensive American player of all time?\nSoccer (football) is now seriously big in the USA and they are producing some talented players moving for big money\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nUnited States are co-hosting the next FIFA World Cup in 2026 and Stateside football (or soccer) has come along way since the last time they hosted. Back then, in 1994 - the same year a certain football magazine launched, the game lagged way behind other American sports, in both participation and spectator numbers.\nEverything since has changed. The MLS has become home to some of the biggest stars the game has produced, while soccer participation numbers are only second to Basketball in team sports.\nAmerica now also produce top quality players - they have ruled women's football for decades and the men's team has improved slowly - bar a difficult last few years. Many of the top USA internationals now ply their trade in the best and biggest leagues throughout Europe. But which Americans have moved for the highest transfer fees? Let's find out.\nWho is the most expensive American player of all time?\nCristian Pulisic is the current holder for the record transfer fee spent on an American player.\nPulisic's move from Borussia Dortmund to fellow European heavyweights Chelsea back in 2019 cost $65million - £58million in English money.\nOverall, Chelsea fans might not feel they got huge value for the money they spent. But the forward provided a crucial contribution in their 2021 Champions League win, scoring in the away leg of the semi-final against Real Madrid - in doing so becoming the first American to score at that stage of the competition.\nHe left Chelsea for AC Milan in 2023 for the more modest - but still sizeable - sum of £20million.\nWho held the all-time record transfer fee for an American prior to Cristian Pulisic?\nPrior to Pulisic bursting onto the scene, the most expensive transfer involving an American international was defender John Brooks.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nBrooks moved from Hertha Berlin to Wolfsburg in 2017 for close to £16million ($20million). Brooks was born in Germany and has never lived in the States but won 45 caps for the national side, the defender eligible through his father.\nThis broke the previous record which involved a Premier League club, Sunderland paying AZ £10million for Jozy Altidore back in 2013.\nThe full list of the top 10 most expensive American footballers of all time\nJack has worked as a sports reporter full-time since 2021. He previously worked as the Chief Women’s Football Writer at the Mirror, covering the England Women’s national team and the Women’s Super League. Jack has reported on a number of major sporting events in recent years including the 2023 FIFA Women’s World Cup on the ground in Australia. When not writing on football, he can often be spotted playing the game somewhere in west London.",
  "word_count": 602,
  "scraped_at": "2026-02-14T12:33:48.717301"
}