{
  "article_id": "2561d2122f53",
  "url": "https://www.90min.com/man-utd-on-track-cost-cutting-plans-major-redundancies",
  "title": "Man Utd  on track  with cost - cutting plans after major redundancies",
  "date": "20241126T171500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Man Utd 'on track' with cost-cutting plans after major redundancies\n- Man Utd publish accounts from first three months of 2024/25 season\n- Club made less money than same period in 2023/24 but was profitable\n- The results of cost-cutting and redundancy plans are becoming clear\nManchester United have reported a small net profit for the first three months of 2024/25, despite revenue falling by almost 10% compared to the same period last season.\nIncome across commercial, broadcast and matchday streams for the three months up to 30 September came in at £143.1m, down from £157.1m a year prior.\nHowever, the arrival of the new ownership structure has seen a significant focus on cost-cutting, seeking to streamline the club's business. Part of that saw controversial plans to make around a quarter of employees redundant, as well as scrapping activities seen as \"non essential\".\nThe results of reduced spending show in the balance sheet, recording a slender £1.4m net profit from reduced revenue, compared to a £25.8m net loss over the same timeframe in 2023/24.\nThe period in question does not cover any costs associated with sacking former men's team manager Erik ten Hag and appointing new head coach Ruben Amorim. Those figures will be included in the next quarterly accounts up to the end of 2024, likely to be published some time in February.\n\"The season is now well underway for both our men's and women's team, and we are keen to ensure both are as competitive as possible,\" said chief executive Omar Berrada, who formally started work on 1 July following gardening leave at rivals Manchester City.\n\"We are delighted to have appointed Ruben Amorim as head coach of our men’s team and remain committed to returning Manchester United to the top of domestic and European football.\n\"Our cost and headcount reductions remain on track, and we are pleased to have seen further commercial traction, and welcome new partner Heineken, through their Tiger brand.\n\"Our renovation of the Carrington Training Centre is progressing well, while the Old Trafford Regeneration Task Force continues its work. Once it has delivered its recommendations, we will then take some time to digest them and evaluate all our options in the upcoming year.\"",
  "word_count": 369,
  "scraped_at": "2026-02-14T13:17:48.159998"
}