{
  "article_id": "256922374697",
  "url": "https://www.themag.co.uk/2025/05/eddie-howe-receives-lma-john-duncan-award-newcastle-united/",
  "title": "Eddie Howe receives LMA John Duncan Award",
  "date": "20250529T093000Z",
  "domain": "themag.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Eddie Howe receives LMA John Duncan Award\nEddie Howe has been recognised at the League Managers Association (LMA) end of season awards.\nArne Slot was named manager of the year.\nEddie Howe receiving the LMA John Duncan Award.\nThis was presented after a season in which Newcastle United won their first domestic trophy in 70 years. United then going on to secure Champions League qualification by finishing top five in the Premier League\nLMA official announcement – 27 May 2025:\n‘The League Managers Association is pleased to confirm Liverpool Manager Arne Slot as the recipient of The Sir Alex Ferguson Trophy for LMA Manager of the Year.\nThe coveted award, voted for by the full LMA membership, was announced at the 33rd Annual Awards Ceremony at JW Marriott Grosvenor House London on Tuesday evening.\nSlot was also honoured as the Premier League Manager of the Year sponsored by Barclays following a panel vote after leading Liverpool to their first Premier League title in five years in his first season in charge, becoming just the fifth manager in league history to do so.\nLMA Chief Executive Richard Bevan OBE said:\n“The LMA’s members recognised the incredible role Liverpool manager Arne Slot has played in leading his team to the Premier League title in a fantastic debut season in English football and he will be presented The Sir Alex Ferguson Trophy for LMA Manager of the Year and the Premier League Manager of the Year award at a more appropriate time.”\nOther awards presented on the night included, Daniel Farke, who won Sky Bet Championship Manager of the Year after Leeds United secured promotion back to the Premier League, whilst Birmingham City Manager Chris Davies collected the Sky Bet League One Manager of the Year following his title-winning debut season as a manager. Grant McCann of Doncaster Rovers picked up the Sky Bet League Two Manager of the Year award after assuring third tier football next season.\nThe Barclays Women’s Super League Manager of the Year went to Sonia Bompastor after leading Chelsea Women to the WSL title.\nBompastor was also joined by Oliver Glasner (Crystal Palace), Eddie Howe (Newcastle United), Ange Postecoglou (Tottenham Hotspur) and Renée Slegers (Arsenal Women) in receiving the LMA John Duncan Award.\nIn awarding the John Duncan Awards, the LMA recognises individuals who have achieved notable and historic successes for their clubs.\nBompastor was acknowledged for achieving the domestic treble with Chelsea Women in her first season at the helm, Howe for victory in the Carabao League Cup and Newcastle’s first major trophy in 70 years, and Glasner for leading Palace to their first ever major trophy and venture into European football by winning the Emirates FA Cup.\nPostecoglou was recognised for triumph in the UEFA Europa League earlier this month, whilst Slegers oversaw Arsenal Women’s success in winning the UEFA Women’s Champions League.’\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 491,
  "scraped_at": "2026-02-14T12:23:17.888270"
}