{
  "article_id": "259a2645d4c2",
  "url": "https://www.tomsguide.com/news/new-on-paramount-plus-in-november-2023-all-the-new-shows-and-movies-to-watch",
  "title": "New on Paramount Plus in November 2023 All the new shows and movies to watch",
  "date": "20231101T080000Z",
  "domain": "tomsguide.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "New on Paramount Plus in November 2023 — All the new shows and movies to watch\nEvery new Paramount Plus show and movie you should see this month\nHere at Tom’s Guide our expert editors are committed to bringing you the best news, reviews and guides to help you stay informed and ahead of the curve!\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nDaily (Mon-Sun)\nTom's Guide Daily\nSign up to get the latest updates on all of your favorite content! From cutting-edge tech news and the hottest streaming buzz to unbeatable deals on the best products and in-depth reviews, we’ve got you covered.\nWeekly on Thursday\nTom's AI Guide\nBe AI savvy with your weekly newsletter summing up all the biggest AI news you need to know. Plus, analysis from our AI editor and tips on how to use the latest AI tools!\nWeekly on Friday\nTom's iGuide\nUnlock the vast world of Apple news straight to your inbox. With coverage on everything from exciting product launches to essential software updates, this is your go-to source for the latest updates on all the best Apple content.\nWeekly on Monday\nTom's Streaming Guide\nOur weekly newsletter is expertly crafted to immerse you in the world of streaming. Stay updated on the latest releases and our top recommendations across your favorite streaming platforms.\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nThere's a slew of new movies and shows hitting Paramount Plus in November 2023. This new content join the streaming service ahead of the holiday season, bringing original Paramount films and TV shows, classic films, dramas, and much more.\nThis month introduces Lawmen: Bass Reeves, the latest series from Yellowstone creator Taylor Sheridan, which follows the story of the first Black U.S. Marshal in the American west, and the supposed inspiration behind the popular Lone Ranger character.\nAlso this month is the debut of the long-awaited Good Burger 2, set 26 years after the first film, following inventor Dexter Reed (Kenan Thompson) and co-worker Ed (Kel Mitchell) as they return to their former burger joint workplace, Good Burger.\nHere's everything that's new on Paramount Plus in November 2023, starting with our top picks.\nOur top picks\nLawmen: Bass Reeves (November 5)\nExecutive produced by Yellowstone creator Taylor Sheridan and created by Chad Feehan, Lawmen: Bass Reeves explores the history behind monumental figure and the first Black U.S. Marshal in American history. Known for his bravery and commitment to justice, Reeves stood tall as a beacon of heroism in the post-Reconstruction era, capturing over 3,000 notorious criminals without sustaining a single wound. This series will look into Reeves' history as a peace officer in the Indian Territory and bring it to the small screen to shine a light on one of history's biggest unsung heroes.\nColin From Accounts (November 9)\nWhen Ashley (Harriety Dyer), a 29-year-old medical student, decides to lift her spirits with a a little spontaneous rebellion, she doesn't know she’s setting the stage for a quirky love story with Gordon (Patrick Brammall), a fortysomething microbrewer. Their paths collide in an unconventional manner, leaving them responsible for a hefty vet bill and an injured dog, leading Ashley to move in with Gordon. As they navigate this unexpected living arrangement, their chemistry is undeniable, but their future? It's looking brighter with every mishap.\nThe Curse (November 10)\nThe Curse is a series from the slightly demented minds of Nathan Fielder and Benny Safdie. A newlywed couple (Fielder and Emma Stone) attempt to start a family, but find matters hilariously complicated by a rumored curse. With all that going on, they navigate the weirdness of co-starring in their own HGTV show, \"Flipanthropy.\" Not quite a comedy, not quite a mystery, this genre-bending series looks like it has all the hallmarks of Fielder's unsettlingly side-splitting work with some of Safdie's touches of mystery, a la Uncut Gems.\nGet instant access to breaking news, the hottest reviews, great deals and helpful tips.\nJFK: What the Doctors Saw (November 14)\nThe death of John F. Kennedy has always been surrounded by conspiracy theories and secrets, and this is one more documentary to explore one of the more interesting findings following his assassination. Seven physicians, all firsthand witnesses at the Parkland Hospital ER when JFK was rushed in, stand united in their account, asserting that one of the entry shots that took his life originated from the front. Not only does this contradict established theories, but it challenges what we all think we know about how it all went down that fateful day.\nGood Burger 2 (November 22)\nWelcome to Good Burger, home of the Good Burger! Can this sequel take your order? Dexter Reed (Kenan Thompson) makes his comeback to the iconic fast food joint in the latest installment of Good Burger, years after the original movie debuted. Down on his luck and fresh out of failed inventions, Dexter finds solace in a return to his burger-flipping life along with best friend Ed (Kel Mitchell). The duo, alongside a new crew, dive headfirst into some seriously silly antics as Dexter crafts a bold plan to turn his fortunes around. But it may very well be at the cost of the burger joint everyone loves.\nEverything coming to Paramount Plus in November\nORIGINALS, EXCLUSIVES, PREMIERES & EVENTS\n11/1: Ink Master (Season 15) premiere\n11/5: Lawmen: Bass Reeves premiere\n11/7: De La Calle premiere\n11/7: FBI True (Season 4) premiere\n11/9: Colin From Accounts premiere\n11/10: The Curse* premiere\n11/14: JFK: What the Doctors Saw premiere\n11/22: Good Burger 2 premiere\nNew shows\nNovember 1\nKung Fu Panda: Legends of Awesomeness (Season 2)\nRuPaul's Drag Race Holi-Slay Spectacular\nNovember 3\nLet's Make a Deal Primetime**\nNovember 6\nThe Eternal Memory\nNovember 12\nAssassin Club\nNovember 14\nNCIS: Sydney (Season 1)**\nPAW Patrol (Season 8)\nPay Or Die\nNovember 15\nBasketball Wives (Season 10)\nThe Loud House Thanksgiving Special\nThe Exhibit: Finding the Next Great Artist (Season 1)\nNovember 16\nGhosts UK (Season 1)**\nNovember 21\nA Song Film by Kishi Bashi : Omoiyari\nAlive in Bronze\nBirthing a Nation: The Resistance of Mary Gaffney\nLast Song from Kabul: The Day The Music Stopped\nTattoo on My Brain\nThe ABCs of Book Banning by Grace Lin\nNovember 22\nDrag Race Mexico (Season 1)\nThe Last Cowboy (Season 3)\nNovember 28\nThe Billion Dollar Goal (Season 1)\nNew movies\nNovember 1\nA Boy Named Charlie Brown\nA Very Brady Sequel\nAbove the Rim\nAeon Flux*\nAlfie (2004)\nAlong Came a Spider\nAmerican Gun\nAshby\nBad Santa\nBad Santa 2\nBlack Hawk Down\nBloodsport*\nBlue Hawaii\nBlue Velvet*\nBoomerang*\nBounce\nBridget Jones: The Edge of Reason\nBridget Jones's Baby\nCadillac Man*\nCatch Me If You Can\nChicago\nChristmas Eve\nCity of God\nCold Mountain\nCool World*\nDetective Story\nDreamgirls\nEasy Come, Easy Go\nEnemy at the Gates\nEveryone Says I Love You*\nFerris Bueller's Day Off\nFootloose (2011)\nForces of Nature\nFour Brothers\nFun in Acapulco\nFunny Face\nG.I. Blues\nGirls! Girls! Girls!\nGladiator\nGrumpy Old Men\nHappy Christmas\nJay and Silent Bob Strike Back\nKeeping Up with the Steins\nKing Creole\nKinky Boots (2005)\nKiss the Girls\nLike a Boss (2020)\nLong Shot\nLove, Rosie\nMenace II Society*\nMistletoe Ranch*\nMoonlight and Valentino\nMy Fair Lady\nMystic Pizza*\nNo Strings Attached\nParadise, Hawaiian Style\nPeanuts: Bon Voyage Charlie Brown (And Don't Come Back!!)\nRabbit-Proof Fence\nRace for Your Life, Charlie Brown\nRat Race\nRemember Pearl Harbor\nReservoir Dogs*\nRoman Holiday\nRosie the Riveter\nRoustabout\nRules of Engagement\nRunaway Bride\nSabrina (1954)\nSahara\nSands of Iwo Jima\nSanta Stole Our Dog!\nSaving Christmas*\nSaving Private Ryan\nScooby-Doo (2002)\nScream 4\nScrooge (1970)\nShutter Island\nSmall Time Crooks*\nSnake Eyes\nSnoopy, Come Home\nStaying Alive\nStop-Loss\nSunset Boulevard\nSuperstar\nThe Actors\nThe Babysitter\nThe Bad News Bears* (1976)\nThe Big Short\nThe Boy in the Striped Pajamas\nThe Collective*\nThe Color Purple\nThe Counselor*\nThe Crying Game*\nThe English Patient\nThe Godfather (Remastered)*\nThe Godfather Coda: The Death of Michael Corleone (Remastered)*\nThe Godfather Part II (Remastered)*\nThe Heartbreak Kid\nThe Kite Runner*\nThe Lincoln Lawyer\nThe Out-of-Towners (1999)\nThe Out-of-Towners (1970)\nThe Perks Of Being A Wallflower*\nThe Romantics\nThe Stepford Wives (2004)\nThe Switch\nThe Terminal\nThe Town\nThe Traveler\nThe Truman Show\nThe Uninvited\nThe War of the Worlds (1953)\nThe Wiz*\nThe Woman in Red*\nThe Wood\nUncommon Valor\nUnfaithful*\nUp In The Air\nVirtuosity\nWall Street*\nWhat Men Want\nWhat Women Want\nWhen Harry Met Sally*\nWolves of War*\nNovember 9\nLucky Number Slevin\nMiracles Across 125th Street\nNovember 14\nThe Accused\nNovember 15\nDead Shot*\nThe Crusades*\nNovember 23\nSouthpaw*\nNovember 27\nThe Lesson*\nNovember 28\nEarth Mama*\n*Title is available to Paramount+ with SHOWTIME® subscribers.\nSports\n11/4: Big Ten on CBS – Ohio State @ Rutgers*\n11/4: SEC on CBS – Missouri @ Georgia*\n11/4: SEC on CBS – LSU @ Alabama*\n11/5: NFL ON CBS Week 9 (check local listings)\n11/5: Rockwool Italy Sail Grand Prix*\n11/5: Barclays Women’s Super League – Arsenal vs. Manchester City\n11/7-11/8: UEFA Champions League Matchday 4\n11/7: UEFA Champions League – AC Milan vs. PSG\n11/8: UEFA Champions League – Arsenal vs. Sevilla\n11/9: UEFA Europa League – Matchday 4\n11/9: UEFA Europa Conference League – Matchday 4\n11/11: SEC on CBS*\n11/11: 2023 NWSL Championship Game*\n11/12: NFL ON CBS Week 10 (check local listings)\n11/12: Courage in Sports: Grid Iron Greatness*\n11/12: Serie A – Lazio vs. Roma\n11/16 & 11/20: Concacaf Nations League – Costa Rica vs. Panama\n11/17 & 11/21: Concacaf Nations League – Honduras vs. Mexico\n11/17 & 11/21: Concacaf Nations League – Jamaica vs. Canada\n11/18: WCRA Rodeo Carolina*\n11/18: SEC on CBS\n11/19: NFL ON CBS Week 11 Doubleheader (check local listings)\n11/19: Barclays Women’s Super League – Manchester United vs. Manchester City\n11/23: NFL ON CBS Thanksgiving Day – Washington Commanders @ Dallas Cowboys\n11/24: Big Ten on CBS – Iowa @ Nebraska*\n11/24: SEC on CBS – Missouri @ Arkansas*\n11/25: SEC on CBS*\n11/26: NFL ON CBS Week 12 Doubleheader (check local listings)\n11/26: Serie A – Juventus vs. Inter\n11/28-11/29: UEFA Champions League – Destination Miami (Matchday 5)\n11/28: UEFA Champions League – PSG vs. Newcastle United\n11/29: UEFA Champions League – Real Madrid vs. Napoli\nThroughout November: Italian Serie A competition\nThroughout November: Concacaf Nations League qualifiers\nThroughout November: Concacaf W Gold Cup qualifiers\nThroughout November: Argentina Liga Profesional de Fútbol competition\nThroughout November: Campeonato Brasileirão Série A competition\nThroughout November: Scottish Professional Football League competition\nThroughout November: Combate Global competition\nThroughout November: AFC Champions League competition\nThroughout November: Barclays Women’s Super League competition\n*Title is available to Paramount+ with SHOWTIME® subscribers.\nBrittany Vincent has been covering video games and tech for over 13 years for publications including Tom's Guide, MTV, Rolling Stone, CNN, Popular Science, Playboy, IGN, GamesRadar, Polygon, Kotaku, Maxim, and more. She's also appeared as a panelist at video game conventions like PAX East and PAX West and has coordinated social media for companies like CNET. When she's not writing or gaming, she's looking for the next great visual novel in the vein of Saya no Uta. You can follow her on Twitter @MolotovCupcake.",
  "word_count": 1880,
  "scraped_at": "2026-02-14T12:40:48.353750"
}