{
  "article_id": "259f81d61953",
  "url": "https://www.city-journal.org:443/html/big-fix-15466.html",
  "title": "The Big Fix : Looking back at college basketball first great scandal , which dethroned the game from its place atop New York sports . ",
  "date": "20230316T151500Z",
  "domain": "city-journal.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The college basketball world is reeling from last week’s FBI announcement of a major investigation into bribery and other corrupt practices in the game, a sordid episode involving at least six schools—most prominently, the University of Louisville, the 2013 NCAA champion. At the center of the story is Louisville coach Rick Pitino, now on administrative leave, pending his eventual dismissal. One of the greatest coaches in the game’s history—a gifted motivator, tireless worker, and brilliant strategist—Pitino now looks at a future in which his vast legacy on the court is erased by a legacy of scandal. Pitino’s fall from grace makes for a tragic story, but those with knowledge of college basketball history know that the game has been down this road before and that legendary coaches have often featured prominently in that narrative. While Pitino’s predicament looks familiar to college sports fans today, there was a time when such incidents were so unthinkable that their public revelation threatened to destroy the sport itself—especially in New York City, once the mecca of the game.\nNew York remains America’s professional sports town par excellence, with marquee franchises, legendary heroes, and world-famous stadiums and arenas. It helps that the city is the national center for commerce and communication, where venerable teams like baseball’s Yankees, basketball’s Knicks, and football’s Giants enjoy national—and, increasingly, global—exposure of the kind denied to smaller-market franchises. For the same reason, the headquarters for Major League Baseball, the National Basketball Association, the National Hockey League, and the National Football League are all located within a few blocks of one another, in midtown Manhattan.\nFinally, a reason to check your email.\nSign up for our free newsletter today.\nIn the big town, where professional teams are king, fans often view college sports as diversions—on the level, say, of professional golf. Yet it wasn’t always so. There was a time, beginning in the 1930s and lasting until some years after World War II, when college basketball attracted as much, or more, spectator interest as the city’s pro franchises, even the Yankees and Brooklyn Dodgers. New York’s major academic institutions—City College, Long Island University, New York University, St. John’s, and Columbia—fielded nationally competitive teams and hosted college titans from around the country before large crowds in Madison Square Garden. City College won the national college basketball championship in 1950, and New Yorkers were as proud of that accomplishment as any of the titles won by the pro teams. Yet, soon afterward, the college game’s popularity collapsed in New York, sabotaged by events hard to imagine unfolding anywhere else. It was never fully to recover.\nIn late 1931, during some of the Great Depression’s worst days, New York mayor Jimmy Walker persuaded Ned Irish, a young sportswriter for the New York World-Telegram, to organize a charitable program of college basketball games, with the proceeds to go to relief for the city’s poor and unemployed. On December 31, a near-capacity crowd of 15,000 showed up at the old Madison Square Garden on Eighth Avenue and 49th Street to watch a three-game matinee featuring Fordham University against City College, Columbia versus New York University, and St. John’s taking on Manhattan College. Impressed with the turnout, Irish (with the mayor’s encouragement) put together similar programs over the next two seasons, which yielded even greater fan support—so much that Irish became a full-time sports promoter. In his first venture, in 1934, he organized an intersectional doubleheader at the Garden between Notre Dame and NYU and St. John’s and Westminster College, drawing more than 16,000.\nFrom then until the early 1950s, college basketball enjoyed unrivaled support in New York City. Thanks to Irish’s promotional skills, Madison Square Garden became a mecca for the game, attracting regional powers like Kentucky, Kansas, Indiana, Ohio State, UCLA, and North Carolina to battle against New York’s top collegiate teams, for which the competition proved a financial boon. Instead of a few hundred spectators in bandbox campus gyms, the New Yorkers now played before sold-out crowds in the Garden. It wasn’t long before several city teams—NYU, St. John’s, City College, and Long Island University—started using the Garden as their de facto home arena. New York’s professional basketball team, the Knickerbockers, then played in the college game’s shadows.\nIn 1938, Irish created the National Invitation Tournament (NIT), college basketball’s first postseason competition, bringing several nationally ranked teams to the Garden each March to do battle in what sportswriters dubbed the “world series” of college hoops. Eight teams clashed in the inaugural event, with eastern colossus Temple University defeating the University of Colorado in the championship game before 15,000 spectators. In response, the National Collegiate Athletic Association launched its own postseason tournament in 1939, bringing its title game to the Garden several times. Throughout the 1940s and into the 1950s, the two tournaments fought for primacy, but players and coaches viewed the NIT as the more prestigious because its games took place in the Garden and involved at least a metropolitan team or two in the mix.\nBy the late 1940s, the Garden was drawing as many as 750,000 fans per season to its extensive schedule of college games, while households across the region tuned in to Marty Glickman’s radio broadcasts. New Yorkers took particular pride when their racially and ethnically diverse teams upstaged the largely white and “WASPish” teams from other parts of the country. City teams usually had a representative mix of Jewish, Irish, and Italian kids, recruited from local high schools. And CCNY and LIU actively recruited African-American players at a time when they had few opportunities to play elsewhere. In 1950 and 1951, the city’s two best players—Ed Warner at City College and Sherman White at LIU—were black.\nNew York’s love for college hoops peaked during 1949–50, when St. John’s, LIU, and CCNY ranked among the top teams nationally and the City College Beavers achieved the singular feat of winning both the NIT and NCAA championships in successive weeks at the Garden. On the way to winning the NIT, the Beavers squared off against heavily favored Kentucky, the two-time defending national champions. The Beavers pummeled the Wildcats, 89–50, in front of 18,000—still the most lopsided defeat ever for a Kentucky team. CCNY defeated Bradley University, ranked Number One in the national polls, in the championship games of both tournaments.\nNew York college teams’ success made their coaches household names across the city and nationally. Foremost was Nat Holman, who began coaching at CCNY in 1919 while starring for the original professional Celtics team (not to be confused with the Boston Celtics, the current NBA franchise). Known as “Mr. Basketball,” Holman taught a disciplined style of motion and passing (with the ball rarely hitting the floor) that became known as the “city game.” In his first 32 years of coaching, Holman’s teams won 75 percent of their games and had only two losing seasons. He coached several all-star players during his decades at CCNY, including Red Holzman, who carried forward Holman’s methods as Knicks coach during the 1960s and 1970s. Holman also played a key role in developing basketball in Israel, following the creation of the Jewish state in 1948.\nLong Island University coach Clair Bee was Holman’s closest New York competitor as architect of winning teams. From 1931 to 1951, Bee’s teams captured two NIT championships, won 90 percent of their games, and ran off winning streaks of 43 games in 1935–36 and 36 games in 1938–39. Bee took public stands on behalf of racial and ethnic participation in college sports and recruited blacks from city high schools to play on his teams. In 1936, his LIU squad voted to boycott tryouts for the U.S. Olympic team to protest Nazi Germany’s hosting of the international games in Berlin. Bee was well known in national circles as a visionary strategist, authoring widely read coaching manuals and books for young adults and directing a popular summer camp in the Catskills. One of the first coaches to study the film of opponents, he invented variations on the zone defense and devised the three-second rule implemented in college basketball in 1936 to restrict the play of big men under the offensive basket. In the early 1950s, Bee created the 24-second clock that made professional basketball into the fast-paced, high-scoring game that we know today.\nGreat coaches also guided teams at NYU and St. John’s. Howard Cann, college player of the year for NYU in 1920, began coaching the Violets in 1923 and led his teams to the championship games of both the NCAA and the NIT. Joe Lapchick, another former Celtics star from the 1920s, was a popular coach for St. John’s from 1937 to 1947 and guided his teams to successive NIT championships in 1943 and 1944. Frank McGuire, Lapchick’s successor, coached St. John’s to the 1952 NCAA finals. Holman, Cann, Lapchick, McGuire, and Bee would be inducted into college basketball’s Hall of Fame. Few cities or regions have been home to such a concentration of coaching talent.\nLike all golden ages, this one would end. The quality and competitiveness of the city game attracted enthusiastic fans and skilled players—but also more dubious characters, whose avocations were as indigenous to the city as high-level basketball.\nIrish’s promotional savvy unwittingly transformed Madison Square Garden into a favored meeting place for gamblers, who gathered there to bet on basketball, hockey, boxing, and anything else amenable to wagering. Black-and-white photos from the period show well-dressed men and women packed tightly into the Garden, with layers of tobacco smoke wafting through the lights and into the rafters. During basketball games, the bookies assembled on the sidewalk along Eighth Avenue, beneath the Garden’s ornate marquee, or outside the popular Nedick’s restaurant, to take wagers from arriving fans. Once inside, the bookies placed themselves in the bleachers behind the baskets, where they could observe the action, study the coaches, and badger the players. It was no secret to anyone there—whether local politicians and sportswriters or coaches and players—that wagering was going on.\nIn the 1940s, the invention of the point spread facilitated large-scale betting on basketball. Gamblers could now establish an expected margin of victory by the favored team and then bet that the actual margin would either exceed or fall short of the “spread.” Bookmakers could adjust the “line” as game time approached to equalize the action on both sides of the bet. By the late 1940s, point spreads appeared in local newspapers, and sportswriters would cite them in their articles. Unlike most spectators, who rooted for their favorite team, gamblers didn’t care who won, so long as their bets covered the spread. This sometimes led to strange scenes in Madison Square Garden. Near the end of games in which the outcome was already clear, fans would get up and leave, but the gamblers, mindful of the spread, would remain, cheering or cursing, as the case might be.\nThe spread attracted more bookmakers, gamblers, and run-of-the mill hustlers into the business of betting on college basketball games, even as an expanding fan base flooded the enterprise with money. Spread-betting also provided an inducement for players to cooperate with gamblers seeking to fix games. Now players didn’t have to “dump” games—that is, deliberately lose—to accommodate gamblers but instead could shave points to ensure that their teams won by margins within the spreads. If a player’s team was favored to win by, say, ten points, he could miss shots, commit fouls, play lazy defense, or throw the ball away at opportune times so that it won by nine points or fewer. To players, shaving points could appear relatively innocent compared with dumping games. After all, the gamblers told them, the schools were making big money from the games—shouldn’t you get a cut, too?\nIn the early postwar years, bookmakers sometimes established relationships with college players at hotels in the Catskills. Back then, the hotels—including Borscht Belt resorts Grossinger’s, Kutscher’s, Klein’s Hillside Hotel, and the Tamarack Lodge—featured summer basketball teams and recruited top players, who earned their keep during the day as waiters and bellhops. Prominent coaches visited the hotels to offer clinics and scout players; some even worked as salaried employees, coaching and directing athletic programs for guests. It was common for guests to bet on the recreational games—and occasionally, some players helped fix the results.\nBy the late 1940s, gamblers, and even many spectators, began suspecting that games at Madison Square Garden were being fixed through payoffs to players, coaches, or referees. They had reason to think so. In March 1944, on the day before the University of Utah played Dartmouth for the NCAA championship in the Garden, a gambler had approached Utah’s coach in the team’s hotel to offer a bribe for throwing the game. The coach tossed the man out and reported the incident to police. The next year, six Brooklyn College players were expelled for accepting bribes to shave points. A few years later, Holman kicked a player off his team for doing business with gamblers. In 1949, New York’s district attorney charged four men with trying to bribe a George Washington University player.\nNational betting syndicates at times took New York teams “off the board,” believing that players were shaving points. The established bookies had little interest in fixing games: with point spreads, they could structure their bets so that the house always won. It was the small-time bookmakers who might gain an edge by seducing players to cooperate with an offer of a few hundred, or even a few thousand, dollars. Garden spectators, especially the “honest” gamblers who liked to bet on games but wouldn’t stoop to bribing players, could sense by the flow of the action or the frequency of missed shots or errant passes when players were on the take. On occasion in the late 1940s, frustrated spectators marched down to a team’s bench to accuse players of shaving points. After an obviously rigged game, gamblers would stand on their seats, cursing players or waving $20 bills at them as they walked off the court.\nBut none of this seemed to matter much to city coaches, players, and boosters—especially after CCNY’s 1950 double championship.\nIn January 1951, Manhattan College officials notified New York police that two former players had approached a current player—Junius Kellogg—to offer a $1,000 bribe for shaving points in a scheduled game against DePaul. Manhattan was a ten-point favorite, and the former players wanted Kellogg to ensure that the Jaspers won by a smaller margin. Detectives instructed Kellogg to go along with the scheme, to help seal the case. After the game, they arrested the two former players, who, under questioning, revealed connections that led police to gamblers bankrolling the operation, and from there, to players on other city teams who were taking bribes.\nIn the early morning of February 18, 1951, as the basketball season was winding down and metropolitan teams were looking ahead to postseason tournaments, New York police arrested three City College players at Penn Station as the team disembarked from a train. The next day, District Attorney Frank Hogan announced that three veteran players—Ed Warner, Al Roth, and Ed Roman—had admitted to shaving points in at least three games earlier that season at the Garden in return for payoffs. Hogan’s deputies also arrested Salvatore Sallozzo, a small-time Bronx gangster, whom they accused of funding the gambling operation, and Eddie Gard, a former Long Island University player who acted as Sallozzo’s intermediary.\nA few days later, the scandal spread to LIU, where Hogan charged three star players from Bee’s nationally ranked team with fixing games. Within days, Floyd Layne, CCNY’s acting captain and a player thought beyond reproach, was pulled out of class and arrested. Hogan soon tagged more players and former players from CCNY and LIU, including Irwin Dambrot, the Most Valuable Player for City College in the 1950 NCAA tournament, and Sherman White, LIU’s All American and national player of the year, regarded as a can’t-miss prospect for the pros. All told, eight players from LIU were charged, along with seven from City College, including every member of the starting five from the previous season’s championship squad. Two NYU players were charged, plus the former Manhattan College players who tried to recruit Kellogg.\nAmong the high-profile New York teams, only Columbia and St. John’s emerged untainted. Columbia played its home games on campus in Morningside Heights, rarely venturing downtown to the gamblers’ nest at the Garden; the Ivy League school was not then considered much of a basketball force, though the Lions were enjoying an unbeaten season when the scandal exploded. St. John’s, on the other hand, was a national power on the basketball landscape. District Attorney Hogan looked into and dismissed rumors of contacts between St. John’s players and gamblers, though some have suggested that Archbishop Spellman intervened to head off the investigation of players from a prominent Catholic institution.\nThe repercussions came quickly. Attendance fell off for scheduled double-headers at the Garden, as fans lost faith in the integrity of the games. The trustees of Long Island University canceled their team’s remaining games and shut down the basketball program (it would be revived six years later). City College also canceled its remaining games and permanently de-emphasized its basketball program. Within weeks, the NCAA voted to withdraw its 1952 tournament from Madison Square Garden and recommended that member institutions boycott the arena. Fearing the influence of gamblers, presidents of metropolitan-area colleges and universities withdrew their teams from Garden events. On March 15, 1952, a New York Times headline noted ncaa basketball tournament now topping nit in rating, a reversal that the paper attributed to the scandals.\nAthletic officials blamed the scandals on a corrupt city environment and pointed to the resort hotels as a secondary source. Many coaches and journalists across the country felt that the problem was isolated to New York City and the Garden. Adolph Rupp, the veteran coach at the University of Kentucky, declared that gamblers could not touch his players with a “ten-foot pole.”\nYet Rupp and others spoke too soon, for the betting scandal soon spread to America’s heartland. By the end of the year, 32 players from seven schools were charged with dumping games or shaving points between 1947 and 1950, including three players from Kentucky’s national championship teams of 1948 and 1949. As a result, the NCAA and the Southeastern Conference suspended Kentucky’s basketball program for the 1952–53 season. Unapologetic, Rupp remained as Kentucky’s coach until he retired in 1972.\nAs the disaster unfolded, sportswriters, editorialists, and educators lamented the decline in moral standards among American youth and the corruption of higher education by the presence of high-profile athletic programs on campus. The scandals were “symptoms of the collapse of moral and spiritual values which should stir to action parents and leaders in public affairs, schools, colleges, and churches,” the head of the Carnegie Foundation for the Advancement of Teaching declared. “The big fix” was the most sensational sports scandal since the Chicago White Sox threw the 1919 World Series to the Cincinnati Reds.\nThe scandal nearly destroyed big-time college basketball in New York. Promoters struggled to attract top teams to play in Gotham, and the NCAA tournament permanently surpassed the New York–centric NIT in importance. Among the city’s top basketball schools, only St. John’s survived as a national force. As the college game faded in New York, professional basketball began to take its place as Madison Square Garden’s top draw; fans who once cheered for City College or LIU transferred their loyalties to the Knicks. College basketball didn’t die in New York—it even staged a bit of a comeback in the 1980s, when the Big East conference began hosting tournaments at the new Madison Square Garden—but its golden-age luster was gone.\nThe scandal has been well documented: in books, including Charley Rosen’s The Scandals of ’51 and Stanley Cohen’s The Game They Played; in a revealing made-for-television film, City Dump: The Story of the 1951 CCNY Basketball Scandal; and in a multitude of newspaper, magazine, and journal articles. These and other accounts chronicle not only the specifics of the scandal but also the human costs for the players and coaches involved.\nTwo players embroiled in the scheme, Sherman White and Ed Warner, were singled out to receive jail sentences. Both were shut out of playing in the NBA. The other players involved were expelled from school, given suspended sentences, and placed on probation. They, too, would be banned for life from the NBA. Most struggled to rebuild their lives, while maintaining that their youthful transgressions had been blown out of proportion.\nThe coaches fared better. Holman, Bee, Rupp, and the others denied any knowledge of their players’ illicit activities, even when their teams lost games that they should have won or squandered large leads. Like everyone else, the coaches heard rumors and accusations about fixes and payoffs but maintained that they had never believed that their own players would be involved. The New York Board of Education dismissed Holman, charging him with “neglect of duty” for failure to supervise his players and to report evidence of wrongdoing. An independent panel exonerated him, though, allowing him to continue his career (he retired in 1960). In 1977, City College named its gymnasium in his honor. McGuire, whom some saw as fortunate to escape the scandal, decamped the next year from St. John’s to the University of North Carolina, where he won the 1957 NCAA championship with a starting five recruited entirely from New York City high schools. He then lost his job in 1961 in a dispute with the chancellor over accusations of recruiting violations and rumors (subsequently proved) of point-shaving by his players.\nClair Bee was the only key figure to achieve redemption, and he did so through a most unlikely path. The scandals effectively ended his career as a college coach and deeply damaged his reputation. When LIU suspended its basketball program in 1951, the school assigned him to a desk job in the financial office. At the trial of the accused players later that year, the presiding judge ripped Bee as an exploitative coach—his salary had tripled during the ten years preceding the scandal, while the athletes he recruited received little in the way of a college education. “All of the players entrusted to the care of LIU,” the judge said in comments published in the New York Times, “were openly exploited in behalf of Mr. Bee and the university.” Here the judge repeated a charge that many of Bee’s rivals had made: that LIU basketball was a “renegade” operation, with lax or nonexistent academic standards. Rumors swirled that some of Bee’s top stars over the years were “ringers”—students who would have failed the entrance exams at other city schools, or, in some cases, were not students at all.\nLike his colleagues, Bee tried to sustain his career, landing a job as head coach of the NBA’s Baltimore Bullets. He watched his hapless team lose three-quarters of its games between the 1952 and 1954 seasons, a record so bad that it led to the dissolution of the franchise. Bee then abandoned coaching and moved upstate to Cornwall-on-Hudson, taking a position as athletic director at the New York Military Academy. And he began churning out new installments of his Chip Hilton sports novels—23 in all, between 1948 and 1966 (a 24th came out posthumously in 2002). The series offered an inspiring, idealistic vision of sports, portraying athletic competition as an arena for heroism where young men formed friendships and competed in the face of obstacles that challenged their skill, honor, and courage.\nIn Bee’s fictionalized world, Chip Hilton and his friends never succumb to temptations to cheat or cut corners, and critics couldn’t easily reconcile the novels’ moral lessons with their author’s reputation as a win-at-all-costs coach. Murray Sperber, in his 1998 book Onward to Victory: The Crises That Shaped College Sports, portrayed Bee as a hypocrite for criticizing in his fiction many of the practices that he was accused of during his coaching career. In various installments, Chip exposes a gambling plot, discovers that several of his teammates are pros masquerading as amateurs, and rejects an athletic scholarship because “[g]etting a scholarship for playing is like getting paid.” The Chip Hilton books, taken as a whole, attacked commercialism in college athletics, the abuse of college scholarships and grants-in-aid, the intrusion of gamblers into college athletics, and creeping professionalism in amateur sports—all abuses rampant in college basketball during Bee’s long tenure as coach at LIU.\nBee’s novels sold enough into the 1960s to provide him with an income to supplement his administrative salary; they were read widely by sports-minded adolescents of that era. Few would have known of the author’s association with the basketball betting scandals or of the attacks on his integrity by educators, journalists, and public officials. In a late interview, Bee declared that the Chip Hilton series was the professional accomplishment of which he was most proud. Fittingly, when Bee was inducted into the Basketball Hall of Fame in 1968, he was recognized not as a coach but as a “contributor,” primarily based on his uplifting sports novels.\nThe scandals of 1951 are remembered today only as a footnote in New York City’s rich sports history. The coaches and most of the star players are gone. The old Garden was demolished in 1968 and replaced by an antiseptic modern structure at 33rd Street and Seventh Avenue. The genre of character-building sports fiction went out of fashion decades ago. A second point-shaving scandal in 1961, involving players and students from Columbia, St. John’s, New York University, and more than a dozen other colleges, demonstrated that few lessons were learned the first time around.\nMeanwhile, the commercialization and professionalization of big-time college sports, a source of much handwringing in 1951, has proceeded without interruption, spurred along by impressive television revenues, ticket sales, and merchandising. On the positive side, the vast financial stakes in college sports today may provide sponsors and participants with incentives to prevent the gambling scandals of 1951 and 1961. On the negative, as we have seen in the current scandal and others from the recent past, money and ambition continue to motivate other forms of cheating and corruption.\nCity College and LIU, along with NYU and Columbia, long ago abandoned ambitions for national basketball prominence. Their teams play to small crowds in campus gyms and are rarely noticed even by the local press. Basketball aficionados in New York cheer on the Knicks and other pro teams, or collegiate powers from elsewhere, such as Duke, Kentucky, North Carolina, or UCLA. Most of those fans would be surprised to learn that there was once a time in New York City when the college game was king, when the Garden hosted big games throughout the season—and when the City College Beavers and LIU Blackbirds stood atop the basketball world.\nTop Photo: Nat Holman, coach of City College’s underdog team, celebrates with his players after the school beat Bradley to capture the 1950 NCAA title. (AP photo)",
  "word_count": 4501,
  "scraped_at": "2026-02-14T12:45:06.467727"
}