{
  "article_id": "259f6266bd7b",
  "url": "https://toronto.citynews.ca/2024/03/29/what-to-stream-this-weekend-beyonce-steve-martin-j-hope-mike-birbiglia-bill-nighy-and-madu/",
  "title": "What to stream this weekend : Beyoncé , Steve Martin , J - Hope , Mike Birbiglia , Bill Nighy and  Madu  ",
  "date": "20240329T054500Z",
  "domain": "toronto.citynews.ca",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "What to stream this weekend: Beyoncé, Steve Martin, J-Hope, Mike Birbiglia, Bill Nighy and ‘Madu’\nPosted March 29, 2024 1:14 am.\nLast Updated March 29, 2024 1:26 am.\nBeyoncé’s country album and a documentary about a Nigerian boy who dreams of being a professional ballet dancer are some of the new television, movies, music and games headed to a device near you.\nAlso among the streaming offerings worth your time as selected by The Associated Press’ entertainment journalists: Bill Nighy plays an English soccer manager taking a team to the Homeless World Cup in “The Beautiful Game,” a two-part documentary about comedy master Steve Martin and Netflix offers “Testament: The Story of Moses,” just in time for Easter.\nNEW MOVIES TO STREAM\n— Bill Nighy leads a charming crowd-pleaser on Netflix, “The Beautiful Game,” in which he plays an English soccer (sorry, football) manager taking a team to the Homeless World Cup in Rome. Michael Ward co-stars as an especially talented player, Vinny, who reluctantly joins the team. New to housing insecurity, he feels above his teammates and the circus of the games at first. The story, written by Frank Cottrell-Boyce and directed by Thea Sharrock is loosely inspired by the real thing (Cottrell-Boyce worked with the Homeless World Cup Foundation to develop the characters) but at heart is very much a movie, tidy and feel-good in the vein of “Ted Lasso” – perhaps what “Next Goal Wins” wanted to be. ( Read AP’s review. )\n— Oscar-winning documentarian Morgan Neville dives into the life of a personal idol, Steve Martin, in “STEVE! (martin) a documentary in 2 pieces,” out on Apple TV+ on Friday. Neville (“Won’t You Be My Neighbor”) essentially created two different movies, one about Martin’s beginnings and one about the present. Martin has told his story many times, but the Neville movies offer unprecedented access to him reflecting on successes, failures and finding happiness. He assures viewers that they can be watched in any order. And yes, there will be banjos. ( Read AP’s review.)\n— This week is all about affirmation and inspiration in streaming movies, apparently, and Disney+ has its own submission with “Madu.” It’s about a 12-year-old Nigerian boy who leaves home to study ballet at a prestigious school in England for seven years. If this sounds vaguely familiar it’s likely because at age 11, Anthony Madu went viral online with a 44-second video of him dancing shoeless in the mud and rain in Lagos. It got the attention of the national media and the likes of Cynthia Erivo and Viola Davis and put him on the path you see in the film. “Madu” begins streaming on Friday.\nNEW MUSIC TO STREAM\n— This ain’t a country album, it’s a Beyoncé album. At least, that phrase was briefly projected onto the exterior of some of New York City’s most famous museums, the Guggenheim, Whitney, New Museum, and the Museum of Arts and Design, in the week leading up to her highly anticipated new album, “Act ll: Cowboy Carter.” The album was first announced last month, after a Verizon commercial starring Beyoncé aired during the Super Bowl ended with the superstar saying, “They ready, drop the new music.” A cryptic Instagram tease later, and Bey surprise release two singles, the country stomp “Texas Hold ’Em,” and the soulful slow burn “16 Carriages.” It’s not new territory for Beyoncé, as anyone who remembers the track “Daddy Lessons” from her 2016 studio album “Lemonade” will remember, but it has opened up new territory. A few weeks ago, the superstar singer became the first Black woman to top Billboard’s country music chart. The album is out now.\n— Also on Bey Day (or however the culture has decided to describe the unofficial holiday), Sheryl Crow will release “Evolution,” her 12th studio album and first in half a decade. After 2019’s “Threads” was released, Crow said she would not release another full-length. Time changes things, as any artist will let you know, and it’s a great thing. One listen of her cover of Peter Gabriel’s 1992 track “Digging in the Dirt,” recorded with Gabriel, guarantees it.\n— Bid farewell to Sum 41, the playful pop-punk band from Canada known for their raucous hits “In Too Deep” and “Fat Lip.” The band’s final album, “Heaven :x: Hell,” releases Friday. They’re going out with an explosion – their enthusiastic rock never missing a beat — but it is an end to an era, nonetheless. Was lead single “Landmines” written in 2023 or 2001? Who knows – palm-muted power chords hit just as hard now as they did then.\n— With members of the K-pop group BTS currently participating in South Korea’s mandatory military service, it’s hard not to miss them. But there is a balm: an Amazon Prime docuseries about member J-Hope titled “Hope on the Street.” The show follows J-Hope’s story — can’t miss viewing for the superfans in your life.\n— AP Music Writer Maria Sherman\nNEW SHOWS TO STREAM\n— This one’s for the comedy nerds. Peacock debuted “Good One: A Show About Jokes,” based on a popular Vulture podcast, on Tuesday. The documentary follows Mike Birbiglia, known for his personal comedy, as he mines his life for new material. “Good One” also features Seth Meyers, Hasan Minhaj and Atsuko Okatsuka.\n— In time for Easter Sunday, Netflix offers a new docudrama in the faith-based genre with “Testament: The Story of Moses.” It follows the Biblical story of Moses and his journey from Egyptian prince to being given the Ten Commandments by God. He also went from an outcast to a liberator. Charles Dance narrates and Avi Azulay plays Moses, and the three-parts also features interviews with religion experts. “Testament” premiered Wednesday.\n— BritBox offers the second season of the British prison drama “Time.” If you missed season one, it’s OK, because “Time” is an anthology series. Season two stars Jodie Whittaker of “Doctor Who” and “Broadchurch” along with Bella Ramsey from “The Last of Us.” Whittaker, Ramsey and Tamara Lawrence play three women who meet on their first day in prison. “Time” premiered Wednesday.\n— A new limited drama series on “Hulu” called “We Were the Lucky Ones” follows the members of the Kurc family, who get separated during World War II after the Nazi’s invaded Poland. It’s based on a book by Georgia Hunter who discovered her own Jewish ancestry and that her grandfather was actually a Holocaust survivor while writing a report for school. The series stars Logan Lerman as her grandfather Addy and Joey King as his sister. The family’s love, resilience and survival is one of hope and optimism. “We Were the Lucky Ones” debuted Thursday.\n— Prime Video introduced “The Baxters” on Thursday. The Christian-based series stars Roma Downey and Ted McGinley as John and Elizabeth Baxter, who have five adult children. The family’s faith is tested when one of the Baxter daughters learns her husband has had an affair. It’s based on a book series by Christian author Karen Kingsbury. Cassidy Gifford (daughter Frank Gifford and Kathy Lee Gifford) also plays one of the Baxter daughters.\n— Beloved for playing Gus Fring on “Breaking Bad” and “Better Call Saul,” Giancarlo Esposito executive produces and stars in his own series called “Parish” for AMC. Esposito plays Gracian “Gray” Parish, who is drawn back into the crime world after a family tragedy. “Parish” is a passion project for Esposito, who worked to get it developed for eight years. Skeet Ulrich co-stars and Bradley Whitford has a recurring role. “Parish” is based on a BBC One show called “The Driver” and debuts Sunday on AMC and AMC+.\n— Louise Harland stars in the Disney+ series “Renegade Nell” as Nellie Jackson, an 18th century swashbuckling cockney who outwits and survives robbers and barons, and even beats a murder charge. She’s assisted by a protective sprite played by “Ted Lasso’s” Nick Mohammed. The eight-episode drama premieres Friday.\nNEW VIDEO GAMES TO PLAY\n— “South Park” has been around for so long that Cartman, Stan, Kyle and Kenny should be old enough to have kids of their own. Fortunately, the boys are still stuck in elementary school purgatory, so they’re just the right age to go nuts for THQ Nordic’s South Park: Snow Day! The town has been shut down by a massive blizzard, so the gang is free to get outside and create all sorts of mayhem. Your character is the “New Kid,” and you can play solo or join forces with up to three friends in battles that go way beyond a neighborhood snowball fight. Break open the Cheesy Poofs now on PlayStation 5, Xbox X/S, Nintendo Switch and PC.\n— Annapurna Interactive’s Open Roads begins with teenager Tess Devine and her mother, Opal, discovering a stash of old letters that hint at dark secrets — and maybe a hidden treasure. So the two of them hit the road in their station wagon on a mission to visit some long neglected family properties. It might not be the best idea for a mother-daughter road trip, since Opal might revive some memories she’s spent years trying to forget. Open Roads comes from some of the creators of the much-admired 2013 mystery Gone Home, and features the voices of Keri Russell and Kaitlyn Dever. Start driving now on PlayStation 5, Xbox X/S, Nintendo Switch and PC.\n___\nCatch up on AP’s entertainment coverage here: https://apnews.com/entertainment.\nThe Associated Press",
  "word_count": 1572,
  "scraped_at": "2026-02-14T12:31:40.872796"
}