{
  "article_id": "25b04b9dad0b",
  "url": "https://mashable.com/article/what-to-binge-watch-on-a-long-flight",
  "title": "TV shows to watch ( and finish ) on a flight",
  "date": "20230728T124500Z",
  "domain": "mashable.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "75 TV shows you can binge from start to finish on a flight\nYou've booked your airfare, your bag is packed. Now, you've just got to decide what you're going to settle into during the flight.\nLong flights while travelling are the ultimate environment for binge-watching TV: meals and booze delivered right to your own personal little tray table, nowhere to be for hours but in your seat — and full concentration.\nSo, instead of wasting time flicking around the airline's entertainment catalogue, prepare in advance, and catch up on a show you've been meaning to spend quality time with. You've got hours, and you can finish the show before you land. Just check your flight length and pick one of these based on how much time you have — and be sure to leave a little buffer time to include taxi, take-off, landing, food, and bathroom breaks.\nYou May Also Like\nYou can either download from your chosen streaming service, rent, or buy. Just remember to make it all available offline before getting to the gate, lest you accidentally miss the last episode.\nOne show you will not see on this list? Yellowjackets. Great show. Not great for flying. Trust us.\nFlight time: Three hours\nWe Are Lady Parts\nWhat started as a Channel 4 comedy short has been made into one of the must-see shows around. Created by Nida Manzoor, We Are Lady Parts is a six-part series (with another season on the way) about the formation of an all-women Muslim punk band, and every moment rules. You’ll meet Saira (Sarah Kameela Impey), Ayesha (Juliette Motamed), Bisma (Faith Omole), and Momtaz (Lucie Shorthouse) as they recruit lead guitarist Amina (Spider-Man: Far From Home and Mogul Mowgli star Anjana Vasan). As Proma Khosla writes in her review for Mashable, \"Seeing five women of color lead a comedy less interested in gawking at their identifiers than exploring their inner lives feels truly revolutionary.\"* — Shannon Connellan, UK Editor\nHow long is it? Three hours, one season\nHow to watch: We Are Lady Parts is now streaming on Peacock in the U.S. and All4 in the UK.\nA Very English Scandal\nA fascinating dramatization of a trial that consumed British media cycles in the late '60s early '70s, when homosexuality was decriminalised in England but not legal. Russell T Davies' A Very English Scandal tells the story of Jeremy Thorpe, a liberal member of Parliament, and his secret former lover, Norman Josiffe, who publicly accused Thorpe of attempting to murder him. It's a compelling, surprising, and unexpectedly bubbly retelling of an abusive relationship and a government official's spectacular fall from grace. Hugh Grant is wonderful as the slimy MP, while Ben Whishaw is positively magnetic as a complex victim with a dramatic flair. — Kristina Grosspietsch, Freelance Writer\nHow long is it? 3 hours, one season\nHow to watch: A Very English Scandal is now streaming on Prime Video in the U.S. and BBC iPlayer in the UK.\nThe Chair\nThe Chair isn’t without its flaws, but you do get a lot for a little with this smart dramedy from creators Amanda Peet and Annie Julia Wyman. Set on the campus of the fictional Pembroke University, The Chair follows English department head Dr. Ji-Yoon Kim (Sandra Oh) as she grapples with a scandal involving her fellow professor and love interest (Jay Duplass). Choppy pacing and some muddled messaging around cancel culture make this an imperfect, yet worthy binge, clocking in at six episodes in just three hours.* —Alison Foreman\nHow long is it? Three hours, one season.\nHow to watch: The Chair is now streaming on Netflix.\nThe Pursuit of Love\nDirected by Emily Mortimer, BBC One's adaptation of Nancy Mitford's 1945 novel is an absolute riot for lovers of period dramas. Set between World Wars, The Pursuit of Love centres around the romantic whims of the audacious Linda Radlett (Lily James), as told by her close cousin Fanny Logan (Emily Beecham). But as Mashable’s Rachel Thompson points out in her review, Fleabag’s Andrew Scott steals the show as the beguiling Lord Merlin: \"Prepare for eccentric hijinks, heated conversations about communism, lots of brooding romantic energy, and many entertaining outbursts from Andrew Scott.\"* — S.C.\nHow long is it? Three hours, one season\nHow to watch: The Pursuit of Love is now streaming on Prime Video in the U.S. and BBC iPlayer in the UK.\nYasuke\nLeSean Thomas' miniseries follows the life and legend of its title character, a Black samurai who served daimyō Oda Nobunaga. Years after Nobunaga's death, Yasuke lives as Yassan, a boatsman who shuttles villagers along the water and speaks little of his past. But a young girl with awesome power undoes Yassan’s quiet life and alias, thrusting him back into a world of warriors, magic and more. The show blends together sci-fi, fantasy, and history as only anime can, with LaKeith Stanfield at the mic bringing Yasuke sublimely to life.* —Proma Khosla\nHow long is it? Three hours, one season\nHow to watch: Yasuke is now streaming on Netflix.\nFlight time: Four hours\nLoot\nMaya Rudolph leads this Apple TV+ comedy as billionaire Molly Novak, who enjoys her gigayacht but maybe not betrayal by her husband of 20 years. When she realises she has a charity foundation run by Sofia Salinas (Michaela Jaé Rodriguez), she starts on a fresh new journey with her assistant Nicholas (Joel Kim Booster), accountant Arthur (Nat Faxon) and cousin Howard (Ron Funches).* — S.C.\nHow long is it? 4.5 hours, one season\nHow to watch: Loot is now streaming on Apple TV+.\nExtraordinary\nYou might think you don’t have space in your queue for another superhero show, but believe us, Extraordinary is not like the others. In a world where everyone gets a super power at the age of 18, Jen is an outlier. She’s 25, and she’s completely ordinary. Her best friend can commune with the dead. Her stepsister is super strong. And her mother can control technology (which would be more helpful if she understood technology at all). But Jen never got her power, and she’s miserable about it. Written by Emma Moran, Extraordinary is a smart, hilarious, irreverent comedy about not fitting in and the struggle to “find yourself.” And also about a cat named Jizzlord. — K.G.\nHow long is it? Four hours, one season.\nHow to watch: Extraordinary is now streaming on Hulu in the U.S. and Disney+ in the UK.\nRap Sh!t\nCreated by Issa Rae, Rap Sh!t is a unique new comedy that seamlessly blends social media into its storytelling. Aida Osman is Shawna Clark, a bored, reserved Miami hotel clerk who dreams of being a rapper. KaMillion is Mia Knight, Shawna's bold and boisterous high school friend who pops back into her life right when she needs it most. After a night out and a heart to heart, the two end up freestyling a viral song together. They form a rap group and quickly learn that working together is going to be harder than just spitting a few bars. Rap Sh!t is a fresh, fun, high energy show, and one of the only series to accurately capture the outsized role social video plays in many of our lives. — K.G.\nHow long is it? Four hours, one season\nHow to watch: Rap Sh!t is now streaming on Max.\nJury Duty\nRonald Gladden is a regular guy reporting to jury duty. What he doesn't know is that everyone else in the room — the jurors, the judge, the lawyers, everyone — is an actor, including James Marsden as a smug, vapid, name-dropping version of himself. Jury Duty is both a comedy and a captivating social experiment. How does this normal dude react as the trial heats up and the people around him act stranger and stranger over the course of 17 very real days? What makes this elaborate hoax a success is that it never feels like the humor is found at Gladden's expense. In fact, after learning the truth about his \"candid camera\" experience, Gladden has publicly said he had a great time. So, feel no guilt about enjoying one of the most intricate pranks in TV history — it’s a hell of a watch! — K.G.\nHow long is it? Four hours, one season\nHow to watch: Jury Duty is now streaming on Amazon Prime.\nWellmania\nLiv Healy (Celeste Barber) is a New York-based Australian food writer who doggedly sticks to her mantra: Seize the day. To Liv, that means partying and living large every second that she can. But when she collapses after a fast-paced weekend back in Sydney, she's forced to evaluate her health — or risk losing her American green card and getting trapped in Australia with her family but without her career. Based on the hybrid memoir by Brigid Delaney (who co-created the series with Benjamin Law), Wellmania is a smart, funny, super charming exploration of grief, wellness, and what it means to be OK. A lovely, complex, hilarious watch. — K.G.\nHow long is it? Four hours, one season\nHow to watch: Wellmania is now streaming on Netflix.\nCollateral\nA routine investigation into the murder of a London pizza delivery man leads to the discovery of a massive conspiracy that puts everyone at risk. Carey Mulligan is fantastic as the dogged Detective Inspector Kip Glaspie, unwilling to accept this killing as a random act of violence. Thanks to an airtight script and a few top-notch English actors (Billie Piper and John Simms), Collateral is a breathless, addicting mystery as well as a thoughtful meditation on modern Britain.* — K.G.\nHow long is it? Four hours, one season\nHow to watch: Collateral is now streaming on Netflix.\nFlight time: Five hours\nStarstruck\nIt’s Notting Hill but not as you know it. Created by and starring New Zealand comedian Rose Matafeo and filmed in London, Starstruck leans into the mess of liking someone new, especially when one of you is a movie star. A light, smart, fun series over two seasons, Starstruck is a millennial rom-com about Jessie (Matafeo), a twenty-something working in London who has a one-night-stand with a famous movie star, Tom Kapoor (Nikesh Patel) on New Year’s Eve without knowing who he is. Delightfully awkward chaos, lurking paparazzi, and unsubtle friends ensue, but beyond that, this could be the start of something big.* — S.C.\nHow long is it? Five hours, two seasons\nHow to watch: Starstruck is now streaming on BBC iPlayer in the UK and Max in the U.S.\nWhen They See Us\nThe most culturally significant project Netflix released in 2019, Ava DuVernay's When They See Us revisits the case of the Central Park Five in excruciating detail. Examining the wrongful convictions of five Black and Latino men — Antron McCray, Kevin Richardson, Yusef Salaam, Raymond Santana, and Korey Wise — for rape in 1989 (for which they would be exonerated over a decade later), this poignant true-crime miniseries offers a heart-wrenching look at the ongoing flaws in our justice system. A powerful watch, When They See Us highlights the insidious biases that plague our society and the vulnerable people put at risk.* — A.F.\nHow long is it? Five hours, one season\nHow to watch: When They See Us is now streaming on Netflix.\nIt's A Sin\nFrom Queer as Folk creator Russell T. Davies, It’s A Sin is a deeply moving five-part series from Channel 4 and streaming on Max. Set in London in the ‘80s, the show hinges around five friends — Ritchie (Olly Alexander), Jill (Lydia West), Ash (Nathaniel Curtis), Roscoe (Omari Douglas),and Colin (Callum Scott Howells) — living together over a decade amid the AIDS epidemic as it happened in the UK. Davies has created a beautiful tribute to those who died during the epidemic, many of whose stories have been erased, and the show's strength comes from its brilliant cast bringing humanity, joy, and integrity to wonderful, real, unforgettable characters. — S.C.\nHow long is it? Five hours, one season\nHow to watch: It's a Sin is streaming on on All4 in the UK and Max in the U.S.\nOur Flag Means Death\nDo you love pirates? Do you love rom-coms? Then you're really going to love the excellent pirate rom-com Our Flag Means Death. Creator David Jenkins and executive producer Taika Waititi bring the Golden Age of Piracy to life with a healthy dose of comic irreverence, following the comedy of errors that is rich landowner Stede Bonnet's quest to be a pirate. Along the way, Stede (played by frequent Waititi collaborator Rhys Darby) crosses paths with legendary swashbuckler Blackbeard (Waititi), and their ensuing relationship is what really drives the show. Lauded for its killer ensemble cast and thoughtful portrayal of queer relationships, Our Flag Means Death is worth all the hype and more.* — Belen Edwards, Entertainment Reporter\nHow long is it? Five hours, one season\nHow to watch: Our Flag Means Death is now streaming on Max.\nThis Way Up\nAisling Bea’s sharply written comedy/drama about two sisters navigating life in London pulls at the heart strings while making us splutter with laughter. The tone is perfect, the performances (from Bea in the lead as Aine and Catastrophe’s Sharon Horgan as her sister Shona) are top notch, and the underlying themes are handled with subtlety and care. \"Just as the first season of This Way Up portrayed the reality of loneliness like nothing I'd ever seen before, the second continues its streak of capturing mental health issues with compassion and without relying on stereotypes and clichés,\" wrote Mashable’s Rachel Thompson. \"What's really wonderful with This Way Up is the way the show continues to portray the reality of living with mental health challenges without pathologising the character or presenting them as a great anomaly.\"* — Sam Haysom, Deputy UK Editor\nHow long is it? Five hours, two seasons\nHow to watch: This Way Up Season 2 is now streaming now on All4 in the UK and Hulu in the U.S.\nMoon Knight\nOscar Isaac stars in the dual role of Marc Spector and Steven Grant in this MCU series, and their respective metahuman forms: Moon Knight and Mr. Knight. Spector's powers are his reward for living in thrall to Khonshu, ancient Egyptian god of the moon. Grant's situation is...more complicated, and best left in the realm of spoilers. His suit is spiffy as hell, though. Propelled by terrific performances from Isaac, a great supporting cast that includes Ethan Hawke and May Calamawy, and refreshingly authentic representation for Arab and Jewish viewers alike, Moon Knight is the kind of Marvel adventure we'd like to see more of in the future.* — A.R.\nHow long is it? Five hours, one season\nHow to watch: Moon Knight is now streaming on Disney+.\nAlias Grace\nBased on celebrated author Margaret Atwood's novel of the same name, Alias Grace is an engrossing psychological mystery. A fictionalized telling of a real-life 1843 murder, the mini-series investigates the sanity and guilt of convicted murderess Grace Marks (Sarah Gadon), who has been imprisoned for 15 years but has no memory of the incident. Psychiatrist Dr. Simon evaluates Grace and becomes more connected to his subject the more he learns about her past.\nWritten by Sarah Polley (Women Talking) and directed by Mary Harron (American Psycho), this 2017 adaptation honors its source material with aplomb. The cast, which includes Anna Paquin, sparkles, and the tension is palpable. An addicting and eviscerating watch! * — K.G.\nHow long is it? Five hours, one season\nHow to watch: Alias Grace is now streaming on Netflix.\nThe Empress\nThe year is 1853, and Emperor Franz Joseph I of Austria needs a wife! The headstrong Elisabeth \"Sisi\" of Bavaria accompanies her demure sister Helene to meet Franz, as Helene has been groomed to wed the young monarch. Much to everyone's surprise, Franz is completely taken with Sisi's rebellious, self-assured, and unpredictable nature — but will the traditional empire fall for her as well?\nThe Empress is a sumptuous German period drama, full of ornate costumes, courtly maneuvering, and longing glances from opposite sides of a perfectly manicured garden. Don't let the subtitles hold you back: This addicting, swoon-worthy love story was the seventh most popular non-English series of 2022. * — K.G.\nHow long is it? Five hours, one season\nHow to watch: The Empress is now streaming on Netflix.\nFlight time: Six hours\nMs Marvel\nHave you met Kamala Khan (Iman Vellani) yet? Marvel's newest screen superhero, a Pakistani-American teen living in Jersey City, is the star of Ms. Marvel — and thanks, we absolutely love her. A huge Captain Marvel fan, Khan feels like an outsider at school (classic hero origin situation). Buuuut she gets superpowers, so GO GET 'EM. From writer Bisha K. Ali and directors Adil El Arbi, Bilall Fallah, Meera Menon, Sharmeen Obaid-Chinoy, this Disney+ plus series is one of the week's biggest shows.* — S.C.\nHow long is it? Six hours, one season\nHow to watch: Ms. Marvel is now streaming on Disney+.\nTransatlantic\nThe year is 1940. France has been invaded by Germany, and all-out war is imminent. But hope remains at the Hotel Splendide in Marseille, where a scrappy, ambitious org called the Emergency Rescue Committee is corralling all its resources, legal and… not-so-legal, to evacuate artists, writers, and thinkers wanted by the Nazi Party. Led by Varian Fry (Cory Michael Smith), Mary Jayne Gold (Gillian Jacobs), and Albert Hirschman (Lucas Englander), the ERC refuses to abandon their mission, even as the stakes grow ever higher for them and their charges.\nThis stylish and captivating drama is based on a remarkable true story. The Emergency Rescue Committee helped find safe passage for Hannah Arendt, Max Ernst, Marcel Duchamp, Marc Chagall, and countless other dissenters wanted for the audacity of their ideas. Created by Anna Winger (Unorthodox) and Daniel Hendler, and adapted from Julie Orringer's original historical novel The Flight Portfolio, Transatlantic is an affecting and scenic mini-series with a sensational international cast. * — K.G.\nHow long is it? Six hours, one season\nHow to watch: Transatlantic is now streaming on Netflix.\nShrinking\nFrom Ted Lasso creator Bill Lawrence and starring a charisma triumvirate of Jason Segel, Harrison Ford, and Jessica Williams, Shrinking is a thoughtful, optimistic meditation on compassion fatigue and the personal toll of caring for others. Segal is Jimmy, a psychotherapist offering help to his clients while himself grappling with overwhelming grief since the death of his wife. His fellow therapists, Ford and Williams, offer him guidance while themselves dealing with emotional stressors that impact their capacity to provide care. Clever, emotional, and deeply compelling, Shrinking is one of those rare pieces of TV that celebrates the wonders of being human by shining a light on both the joy and the pain of being alive. — K.G.\nHow long is it? Six hours, one season.\nHow to watch: Shrinking is now streaming on Apple TV+.\nFeel Good\nBuilding relationships, growing up, breaking free of emotional dependency, and managing addiction — Mae Martin makes all of it funny, sad, relatable, romantic, and beautiful in the semi-autobiographical comedy drama Feel Good. With Martin in the director/writer/actor chair, the show pushes Mae (Martin) and George’s ( Charlotte Ritchie) story along into various levels while exploring the complicated nature of empathy and handling inner pain. Mae digs into their past trauma and its impact on present relationships, George works on finding time for her own power while supporting Mae, and Mae's parents (the incredibly deadpan Lisa Kudrow and charming Adrian Lukis) try to meet them halfway.* — S.C.\nHow long it is? Six hours, two seasons\nHow to watch: Feel Good is now streaming on Netflix.\nI May Destroy You\nEnglish writer/actress/producer Michaela Coel first broke through with her cheeky, sex-centric comedy series Chewing Gum. With this addictive follow-up, her provocative humor oozes to darker corners, exploring the issues of social media influence, anti-Black racism, consent, and rape culture. In I May Destroy You, Coel stars as Arabella Essiedu, a twenty-something writer who relishes a wild night out on the town. But when one such night ends with a blackout, bloody forehead, and troubling flashbacks, Arabella turns to her friends, new lovers, and lots of dubious distractions to cope. Surrounded by a suitably superb cast, which includes Weruche Opia and Paapa Essiedu, Coel delivers an electrifying portrayal of a woman on the verge. Her critically heralded 12-part creation has won two BAFTAs, one for her lead performance, the other for Best Mini-Series, as well as a slew of Emmy nominations. * — K.P.\nHow long is it? Six hours, one season\nHow to watch: I May Destroy You is now streaming on Max.\nThe Dropout\nBy now you’ve certainly heard about Elizabeth Holmes, disgraced, turtleneck-wearing founder of the scam medtech company Theranos who was convicted of fraud in 2022. And just two months after her guilty verdict landed, a strange and excellent miniseries chronicling her rise and fall dropped on Hulu. Whoever scheduled The Dropout’s premiere date deserves a raise.\nAmanda Seyfried earned an Emmy for her deep-voiced, disquieting, and magnetic portrayal of Holmes. This mini-series is a wild ride that keeps your jaw firmly dropped to the ground the whole way through — but we can’t stress this enough, this is all based on a true (and truly bonkers) story. * — K.G.\nHow long is it? Six hours, one season\nHow to watch: The Dropout is now streaming on Hulu.\nPaper Girls\nEveryone loves a time travel show right now, from The Umbrella Academy to Loki to Dark and beyond. Same goes for shows set in the '80s — let's see: Stranger Things, GLOW, The Haunting of Bly Manor. Throw them together and you've got Paper Girls, a time-traveling mystery series that we're absolutely on board with.\nBased on the comics by Brian K. Vaughan and Cliff Chiang, the series follows newspaper deliverers KJ (Fina Strazza), Erin (Riley Lai Nelet), Mac (Sofia Rosinsky), and Tiffany (Camryn Jones). It's 1988 in Cleveland, Ohio, the day after Halloween, and the friends accidentally find themselves beamed forward to 2019 — where their adult selves are too (including Ali Wong as grown-up Erin). They've gotta save the world, of course, but they've got to outrun the militant faction of time-travellers known as the Old Watch, who have outlawed time travel.* — S.C.\nHow long is it? Six hours, one season\nHow to watch: Paper Girls is now streaming on Prime Video.\nObi-Wan Kenobi\nDisney+'s latest Star Wars foray, Obi-Wan Kenobi, which follows the titular hero (played by Ewan McGregor) on a quest to save Princess Leia (Vivien Lyra Blair) from the clutches of Inquisitor Reva (Moses Ingram) 10 years after the events of Episode III.* — S.H.\nHow long is it? Six hours, one season\nHow to watch: Obi-Wan Kenobi is now streaming on Disney+.\nInvincible\nRobert Kirkman may be best-known as the creator of The Walking Dead, but Amazon is poised to change that with Invincible. For people who have read the comic, the first season of this animated Prime Video adaptation is nothing short of a dream come true for the way it's nailing and even improving on the source.\nFor everyone else, Amazon's first season of Invincible is a standout example of a trope-obliterating superhero story that doesn't feel like any of the other trope-obliterating superhero stories that have jockeyed for attention in recent years. That's thanks to Invincible's potent mix of jaw-dropping surprises, violence that isn't just gratuitous, and a tender, beating heart.* - Adam Rosenberg\nHow long is it? Just over six hours, one season\nHow to watch: Invincible is now streaming on Amazon Prime Video.\nWandaVision\nThere is truly no reason that a sitcom-pastiche-grief-metaphor starring two tertiary Avengers should be a knockout hit and television masterclass, but Jac Shaeffer knew what she was doing with WandaVision. The genre-bending series brought us back to the MCU after more than a year-and-a-half without it, and immediately elevated storytelling possibilities for Marvel, Disney, and TV itself. Paul Bettany and Elisabeth Olsen jump admirably between comedy and drama, providing a TV comedy crash course as much as plumbing new depths for their superhero characters, especially how Wanda internalizes and unpacks her grief. Wanda may have grieved alone on screen, but audiences connected week after week with the show’s understanding of love, loss, and memory.\nKathryn Hahn gives not only an all-time MCU villain performance as Agatha Harkness, but a career best that spectacularly shows off her power (pun intended). Teyonah Parris, Randall Park, and Kat Dennings give us the crossover ensemble we didn’t know we needed (Avengers who?) and built hype for future Marvel movies. We might be back to regularly scheduled programming, but we’ll always have Westview.* — P.K.\nHow long is it? Six hours, one season\nHow to watch: WandaVision is now streaming on Disney+.\nSquid Game\nDo we really have to recap? Netflix's South Korean superhit Squid Game landed on the service in mid-September and exploded like none other, shattering the record for the most watched Netflix show of all time (the record has since been beaten by Arcane). Its dystopian premise, in which indebted civilians compete with each other in death-match versions of schoolyard games for money — is as dark as it comes, but Squid Game's candy-colored aesthetic makes the deadly proceedings substantially creepier. Squid Game is a whip-smart satire that calls out the loss of individual humanity in late stage capitalism, which for some weird reason resonated with millions of people all over the world.* — Alexis Nedd\nHow long is it? 6.5 hours, one season\nHow to watch: Squid Game is now streaming on Netflix.\nArcane\nWhether you're a big fan of League of Legends or have no idea who Jinx, Vi, and Jayce are, you're guaranteed to smash through Arcane. The show's gorgeous animation is the perfect vehicle for an excellent story about magic, betrayal, and family ties. Trust us: as soon as you enter the cities of Piltover and Zaun, you won't want to leave until you've finished all nine episodes.* — B.E.\nHow long is it? Six hours, one season.\nHow to watch: Arcane is now streaming on Netflix.\nLoki\nMarvel's most mischievous Asgardian got his own series in 2021, with Loki (Tom Hiddleston) charged as a time criminal following the events of Avengers: Endgame. The God of Mischief finds himself incarcerated within the sprawling halls of the mysterious Time Variance Authority, where he's under the watch of judge Ravonna Renslayer (Gugu Mbatha-Raw) and Hunter B-15 (Wunmi Mosaku). TVA agent Mobius (Owen Wilson) throws Loki a lifeline, requesting his help to catch a much bigger fish causing chaos across time. They'll encounter Sophia Di Martino, Jonathan Majors, and Richard E. Grant along the way, but we're not going to tell you how. — S.C.\nHow long is it? Six hours, one season\nHow to watch: Loki is now streaming on Disney+.\nFlight time: Seven hours\nQueen Charlotte: A Bridgerton Story\nQueen Charlotte: A Bridgerton Story, is a lavish, ebullient triumph, and further evidence that Shonda Rhimes just doesn't miss. Delving into the personal history of the tragic, impulsive, and steely queen we know and love from Bridgerton Seasons 1 and 2, we watch a young girl transform into a formidable monarch — and fall in love along the way. The costumes are sumptuous, the drama juicy, and the romance slow-burning. It checks all the boxes while still making space for a thread of sadness that lends gravitas and complexity to the entire Bridgerton world. An ambitious and beautiful show that fully earns its shining crown as Netflix's newest darling.* — K.G.\nHow long is it? Seven hours, one season\nHow to watch: Queen Charlotte is now streaming on Netflix.\nRussian Doll\nGotta get up, gotta get out, gotta get into in the superb eternal loop that is Netflix's Russian Doll. Orange Is the New Black's Natasha Lyonne leads this Groundhog Day-like series about a woman in New York City who lives the same day over and over. It's perfect for watching all in one go while you're high in the clouds in your own limbo. — S.C.\nHow long is it? 7.5 hours, two seasons\nHow to watch: Russian Doll is now streaming on Netflix.\nThe Diplomat\nOne of Netflix's biggest hits of 2023, The Diplomat is a gripping political thriller with a dysfunctional marriage at its core. Keri Russell is Kate Wyler, a career diplomat who is unexpectedly appointed as the new U.S. ambassador to England after a British warship is attacked. Her husband (a magnetic Rufus Sewell) is a former ambassador with a splashy track record and an inability to keep his fingers out of the political pie. With the stakes growing higher each episode, the Wylers attempt to maintain peace, both globally and in their marriage.\nThe Diplomat is a riveting, refined drama that manages to make international diplomacy thrilling. The performances here are particularly skilled, with its characters each conveying multiple layers of meaning in a single glance. There's a reason why it's been at the top of streaming charts for weeks — plus, a second season is already in the works.* — K.G.\nHow long is it? Seven hours, one season\nHow to watch: The Diplomat is now streaming on Netflix.\nDerry Girls\nLooking for a teen comedy to distract you? Line up Derry Girls, set in the '90s during the Troubles in Northern Ireland. You'll meet four teens — Erin, Orla, Clare, and Michelle — who get into all sorts of trouble together at school in Derry. Honestly, it's a series whose portrayal of Northern Irish women is a breath of fresh air — and it's got one hell of a soundtrack. — S.C.\nHow long is it? 7.5 hours, three seasons\nHow to watch: Derry Girls is now streaming on All 4 in the UK and Netflix in the U.S.\nSeverance\nApple TV+'s excellent drama Severance is \"an anti-capitalist fable with a Black Mirror twist.\" It imagines a world where workers can \"sever\" their work memories from their civilian memories, resulting in a bizarre, sterile office world that only exists when employees are physically in the office and \"regular\" people who have no idea what they do in their hours at work. Led by Adam Scott in a tremendous role, the Severance cast often plays double duty — portraying their work selves and their out-of-work selves as two entirely different characters.\nThe creeping mystery of what exactly their company does with their labor maintains suspense through the show's nine episodes, complete with twists no one can see coming and a cliffhanger ending that guarantees a thrilling second season.* — A.N.\nHow long is it? Seven hours, one season\nHow to watch: Severance is now streaming on Apple TV+.\nPachinko\nOne of the most ambitious new shows of 2022 is also among its most rewarding. Based on Min Jin Lee's best-selling novel, Pachinko spans not only decades but also generations, following a family line from an impoverished community in 1915 Korea to a prosperous Japan in 1989. The center of this moving saga is matriarch Kim Sunja, who grows from an intrepid child (Yu-na) to a pregnant, unwed teen (Kim Min-ha), to a grandmother (Academy Award-winning star of Minari, Youn Yuh-jung) too often patronized by her doting son (Soji Arai) and hotshot banker grandson Solomon (Jin Ha).\nCreated by Soo Hugh, this sensational drama series slides back and forth across its timeline, paralleling Sunja's journey with Solomon's. Though she was raised in poverty and he in prosperity, both face challenges of racism, weighty family expectations, and impossible loves. Incredibly, though Pachinko hits on many dark elements, it's resiliently hopeful, delivering on the promise of its exhilarating opening title sequence. If you're looking for a series to grab you, heart and soul, Pachinko is a safe bet for satisfaction.* — Kristy Puchko, Film Editor\nHow long is it? 7.5 hours, one season\nHow to watch: Pachinko is now streaming on Apple TV+.\nMare of Easttown\nHBO’s drama became a rare case of must-see viewing and appointment TV — a dying breed that the Home Box Office is one of the last networks to dominate. Where Disney’s Marvel shows were endlessly discussed yet easily spoiled, Mare’s Sunday primetime slot gave us much-needed structure as we dissected a murder investigation in Pennsylvnia. Kate Winslet and her Pennsylvania accent lead this cast which feels as real as any small town in middle America. Winslet gives Mare endless rough edges, cloaking the character’s pain in her gruff determination to solve the crime. Whether or not you saw that final twist coming, Mare sucked you in and kept you coming back.* — P.K.\nHow long is it? Just over seven hours, one season\nHow to watch: Mare of Easttown is now streaming on Max.\nFlight time: Eight hours\nHeartstopper\nFrom beloved webcomic to graphic novel to Netflix series, Heartstopper is a truly sweet teen romance that will steal your heart. English writer and illustrator Alice Oseman has extracted the characters of her Tapas/Webtoon/Tumblr hit 2016 webcomic and found real-life ambassadors for them in the screen adaptation directed by Euros Lyn. Heartstopper lies on the sugary sweet end of the teen dramedy series spectrum, worlds apart from Euphoria and Skins, younger but just as delightful as Sex Education, with a new gay love story akin to Love, Viktor. But it doesn’t shy away from a poignant examination of queer identity amid steadfast heteronormativity.* — S.C.\nHow long is it? Eight hours, two seasons\nHow to watch: Heartstopper is now streaming on Netflix.\nWednesday\nOne part mystery, one part supernatural show, and one part teen drama, Wednesday was an undeniable 2022 breakout hit. The internet was abuzz with star Jenna Ortega’s take on the classic Addams family character, and it’s no wonder — Wednesday is a delight!\nAfter getting kicked out of yet another high school, Wednesday is sent by her parents (Luis Guzmán and Catherine Zeta-Jones, having a ball as Gomez and Morticia Addams) to their old alma mater, Nevermore Academy. There, Wednesday meets werewolves, gorgons, and impossibly broody teens — and finds herself at the center of a complex murder mystery that threatens to engulf the school in scandal. It’s soapy, supernatural teen fun peppered with fantastic characters and plot twists to spare.* — K.G.\nHow long is it? Eight hours, one season\nHow to watch: Wednesday is now streaming on Netflix.\nMrs. Davis\nBetty Gilpin is Sister Simone, a modern-day nun living outside of Reno and one of the only people on the planet who doesn’t love Mrs. Davis, the omnipresent AI who controls most human decisions. Through an app and an earpiece, Mrs. Davis helps humans do good and make better choices. She's designed to help the world become a better place. And Sister Simone wants to see her destroyed.\nCreated by TV king Damon Lindelof (Lost, Watchmen, The Leftovers) and Tara Hernandez, Mrs. Davis — the show, not the AI — is a hilarious, unpredictable, genre-bending sci-fi adventure with a grounded emotional core. It’s impossible to pin down, and that’s part of what makes it so exciting. There's simply no other series like it! — K.G.\nHow long is it? Eight hours, one season\nHow to watch: Mrs. Davis is now streaming on Peacock.\nThe Sandman\nNeil Gaiman's The Sandman found itself with a 10-episode comic adaptation from showrunner Allan Heinberg, journeying through worlds, human and otherwise, primarily hinging around the exploits of Morpheus, the Dream King (Tom Sturridge). When Morpheus is captured by mortals and his sacred objects stolen, terrible things begin to happen both in our world and realms of fantasy.\nBut this just means we get to meet a whole range of weird and wonderful characters, from Kirby Howell-Baptiste as Death, Gwendoline Christie as Lucifer, Vivienne Acheampong as the librarian, Lucienne, Jenna Coleman as the kickass Johanna Constantine, Asim Chaudhry and Sanjeev Bhaskar as murder-bound brothers Cain and Abel, David Thewlis as the exceptionally creepy John Dee, and so many more.* — S.C.\nHow long is it? Eight hours, one season\nHow to watch: The Sandman is now streaming on Netflix.\nThe Night Agent\nGripping, labyrinthine, and at times disarmingly sweet, Netflix's spy action-thriller series The Night Agent is an immediate hit. Gabriel Basso is Peter Sutherland, an FBI agent who mans a phone in the basement of the White House that never rings — until the one night that it does. In helping the person on the other end, Peter suddenly finds himself in the middle of a massive conspiracy, unsure of who he can trust. Based on Michael Quirk's novel of the same name, The Night Agent feels like Netflix's 24. It's a fast-paced, breathless suspense show with a few somewhat implausible plot points that you'll soon forgive because of its excellent and exhilarating action sequences.* — K.G.\nHow long is it? Eight hours, one season\nHow to watch: The Night Agent is now streaming on Netflix.\nBroadchurch\nYep, it's a series that has more than one season, but for our purposes, Broadchurch Season 1 is all you'll need. Starring David Tennant, Olivia Colman, and Jodie Whittaker, this emotional British crime drama is one murder mystery you'll find genuinely hard to get over — and one that's intensified if you watch it all in one go. — S.C.\nHow long is it? Eight hours for the first season (that's all you'll need, unless you're a sucker for sadness)\nHow to watch: Broadchurch is now streaming on BritBox in the UK and on Prime Video in the U.S.\nLupin\nCésar-award-winning actor Omar Sy is absolutely magnetic in this fun and unpredictable French mystery series. Assane Diop is the son of a Senegalese immigrant who was accused of stealing his Parisian employer’s diamond necklace. All Assane has left of his dad is a shared love of Arsène Lupin, a classic French literary character who is both a gentleman and a thief. As an adult, Assane follows in Arsène Lupin’s fictional footsteps and becomes master thief, determined to use his skills to prove his father was innocent all those years ago.\nNo matter what language you speak, Lupin is a 10-out-of-10 show. It’s an energetic, poignant, gripping, and joyful watch, all wrapped into one.* — K.G.\nHow long is it? Eight and a half hours, two seasons\nHow to watch: Lupin is now streaming on Netflix.\nReservation Dogs\nSterlin Harjo and Taika Waititi’s comedy debuted with the confidence and charisma every show wishes it had. Reservation Dogs follows four Oklahoma teens on daily adventures, small and large — from loitering outside a local clinic to stealing a chip truck and delivering it to local criminals. The show is created almost entirely by Native talent behind and in front of the camera; young stars D'Pharaoh Woon-A-Tai, Devery Jacobs, Paulina Alexis, and Lane Factor never miss a beat. The friends and their world are so authentic and inviting that it's impossible not to get sucked in, to feel acutely for their victories, laughter, and heartache.\nSeason two sees the teens exploring what it means to grow up and facing a tragedy from their past that's been haunting them since season one. — P.K. & K.G.\nHow long is it? Eight hours, two seasons.\nHow to watch: Reservation Dogs is now streaming on FX via Hulu in the U.S. and on Disney+ in the UK.\nSharp Objects\nBased on Gone Girl author Gillian Flynn's debut novel, and brought to the small screen by Big Little Lies director Jean-Marc Vallée, HBO mini-series Sharp Objects is a must-watch subversion of the Dead Girl trope. A transfixing Amy Adams leads the charge as a reporter who investigates disturbing unsolved crimes back in her small hometown. — S.C.\nHow long is it? Eight hours, one season\nHow to watch: Sharp Objects is now streaming on Max.\nGirls 5eva\nEvery one-hit wonder deserves a second chance. In Peacock's Girls 5eva, a pop group from the turn of the century has the opportunity to revive its former glory — and maybe make it stick. When the band's comeback prompts a look back at their old catalogue, Dawn (Sara Bareilles) decides to write something new — \"an anthem for things that aren't perfect but are still great.\" Girls 5eva comes from creator Meredith Scardino, executive produced by Tina Fey, Jeff Richmond, and Robert Carlock. It stars Bareilles, Busy Phillips, Renée Elise Goldsberry, and Paula Pell.* — P.K.\nHow long is it? Eight hours, two seasons\nHow to watch: Girls 5eva is now streaming on Peacock in the U.S. and on Now TV in the UK.\nThe Night Of\nLike an extreme version of Dude Where's My Car?, eight-part HBO mini-series The Night Of stars a superb Riz Ahmed as Nasir Khan, a student imprisoned after waking up to a murder scene — with no recollection of what the hell happened the night before. You, along with John Turturro as Naz's lawyer, will piece together the case, while Naz makes a prison ally of Freddy, played by the inimitable Michael Kenneth Williams. — S.C.\nHow long is it? 8.4 hours, one season\nHow to watch: The Night Of is now streaming on Max in the U.S. and Now TV in the UK.\nFlight time: Nine hours\n1883\nThough it's technically a prequel, there's no need to watch Yellowstone to appreciate this sweeping Paramount+ original. 1883 is a massive undertaking, making headlines for its unprecedented budget ($10 million an episode!) and scale of production. Luckily, Paramount's big investment has paid off. 1883 is a scenic, moody drama about the Dutton family's journey west from Fort Worth to Oregon. Elsa Dutton (Isabel May) is our protagonist, narrating over the ruminative shots of the sun setting over endless plains, vibrating with hope for a trek the show warns us will only bring doom. Rattlesnakes, bandits, covered wagon accidents — 1883 depicts the brutal, stark reality of the real Oregon Trail.\nSam Elliott is perfectly cast as the hardened covered wagon boss — his mustache has never been more fitting — and LaMonica Garrett is magnetic in an exciting role that promises to undo decades of Black cowboy erasure. As Elsa's parents, Tim McGraw and Faith Hill's comfort on horseback and in Stetsons help them fit right in alongside the veteran cast. Making adequate space to address the complex nuances of the often-violent conflicts between settlers and Native Americans, 1883 is a modern, ruminative Western whose gorgeous landscape is just as important as its affecting human drama. — K.G.\nHow long is it? Nine hours, one season\nHow to watch: 1883 is now streaming on Paramount+.\nThe Last of Us\nBased on Naughty Dog's smash hit 2013 video game, The Last of Us plunges viewers into a world overtaken by a fungus that brainwashes people into essentially becoming mindless, flesh-munching zombies. In a post-apocalyptic landscape, creators Neil Druckmann and Craig Mazin unfurl stories of heartbreak and hope, love and grief, all spawned from the horror-rich source material. Pedro Pascal and Bella Ramsey star as hardened survivor Joel and his foul-mouthed teen cargo Ellie, who traverse a ruined America on a mission to potentially end the plague. That is, if they don't kill each other first. Spiked with gore, action, humor, and some of the most emotionally devastating moments of 2023 television, Season 1 of The Last of Us begs to be binged. But you may need some time to recover from all the tragic twists this one has in store.* — Kristy Puchko, Film Editor\nHow long is it? Nine hours, one season\nHow to watch: The Last of Us is now streaming on Max.\nStation Eleven\nWhether or not you have read Emily St. John Mandel's celebrated novel of the same name, this lavish adaptation proved must-see TV. Station Eleven creator/showrunner Patrick Somerville thoughtfully reimagined the setting and some stirring specifics of Mandel's dystopian drama, making for a story familiar yet surprising. In a world ravaged by plague, a scrappy theater troupe — called the Traveling Symphony — tours settlements to bring the pleasures of Shakespeare to the survivors. But how did humankind come to this place of ruin and revival? Weaving past and present in a ragged but riveting tapestry, this mini-series gave an almost alarmingly optimistic look at the apocalypse. Grounding the sensational storytelling is a critically heralded cast that includes Mackenzie Davis, Matilda Lawler, Himesh Patel, Gael García Bernal, and Danielle Deadwyler.* — K.P.\nHow long is it? Nine hours, one season\nHow to watch: Station Eleven is now streaming on Max.\nDead End: Paranormal Park\nNetflix's animated series Dead End: Paranormal Park, based on the graphic novel series DeadEndia, is the latest in a long line of cartoons, including Disney's The Owl House and Netflix's She-Ra and the Princesses of Power, to feature LGBTQ characters and relationships. The show follows trans teen Barney (voiced by Zach Barack), his talking pug Pugsley (voiced by Alex Brightman), and his friend Norma (voiced by Kody Kavitha) as they spend the summer working at a haunted house that is actually haunted. Between dealing with demons, exorcisms, and the underworld, Barney and Norma face what might be the scariest thing of all: first crushes and/or meeting your heroes.* — B.E.\nHow long is it? Nine hours, two seasons\nHow to watch: Dead End: Paranormal Park is now streaming on Netflix.\nWatchmen\nMuch like the 1986 comic it serves as a sequel to, HBO’s Watchmen turns a critical eye to the idea and function of masked heroes in our culture but goes beyond its source material to examine the dark realities of racism, conspiracies, and police violence in a world almost — but not quite — like our own. Anchored by a towering performance from Regina King as Angela Abar, A.K.A the masked cop Sister Night, Watchmen's every episode dazzles while maintaining the social integrity dozens of other shows can only dream of achieving.* — A.N.\nHow long is it? Nine hours, one season\nWhere to watch: Watchmen is now streaming on Max.\nThe Haunting of Hill House\nIf you don't mind yelping in fright in a silent plane every so often, open the front door on Netflix's The Haunting of Hill House. A genuinely frightening drama from creator Mike Flanagan, based on Shirley Jackson's 1959 novel, the series centres around the concept of family trauma and grief. But there are plenty of scares too, and a mystery that will get you all the way to your destination, about five siblings and their parents who live in a truly haunted house. Hill House will keep you on the edge of your plane seat until the last showdown. — S.C.\nHow long is it? 9.5 hours, one season\nHow to watch: The Haunting of Hill House is now streaming on Netflix.\nThe Haunting of Bly Manor\nOK, so you've seen The Haunting of Hill House? Check out Flanagan's follow-up gothic romance horror The Haunting of Bly Manor. Set in England in the '80s, the series follows Hill House alumni Victoria Pedretti as Dani, an American au pair hired to take care of two orphaned kids (Amelie Bea Smith and Benjamin Evan Ainsworth) at the grand, creepy Bly Manor in mysterious circumstances. They all live with the estate’s housekeeper Mrs. Grose (T'Nia Miller), chef Owen (Rahul Kohli), and groundskeeper Jamie (Amelia Eve). But the house holds a fair few secrets, and if you're into Charlotte Brontë or Henry James, you'll like this. — S.C.\nHow long is it? 9 hours, one season.\nHow to watch: The Haunting of Bly Manor is now streaming on Netflix.\nFlight time: 10 hours\nThe Bear\nCreated by Christopher Storer, this new FX series centers on fine dining chef Carmy Berzatto (Jeremy Allen White), who returns to his home city of Chicago after he loses a close family member. He's tasked with running the family sandwich shop, The Original Beef of Chicagoland, with sous chef Sydney (Ayo Edebiri) and manager Richie (Ebon Moss-Bachrach). It'll be a stressful, rewarding, and delicious journey. You’ll fall for these flawed characters just doing the best they can as quickly as you want to scarf down their delectable-looking sandwiches. The narrative shifts in season two but the winning formula stays the same, as the crew embarks on a new endeavor, but retains their same high-volume, high stress approach to tackling obstacles. Yes, chef! — S.C. & K.G.\nHow long is it? 10.5 hours, two seasons.\nHow to watch: The Bear is now streaming on Hulu in the U.S.\nAndor\nEasily the best Star Wars show yet, Andor won over fans with its in-depth exploration of the Star Wars universe — and by leaving the Jedi and Sith at the door. Here, we see everyday citizens trying to scrape together a life under the yoke of the Galactic Empire. Communities band together to protect one another, regular joes stand up to fascism at great personal risk, and the seeds of revolution spread to the farthest corners of the galaxy without force magic, just the power of ideas. Finally, a Star Wars for the little guy.\nFive years before the events of Rogue One, Cassian Andor (Diego Luna) is not a rebel. He’s a cynic and a thief, just trying to get by and find his long-lost sister. But when a chance encounter gone wrong puts Cassian in the crosshairs of Imperial Security, his options for escape are slim. Only a mysterious rebel contact (a magnetic Stellan Skarsgård) offers a solution. Andor is a rich, gripping drama from Tony Gilroy (the Bourne trilogy) that will astound you in its detail and gravitas. The cast is superb (Kyle Soller, Adria Arjona, Fiona Shaw, Andy Serkis, Alex Lawther, Ebon Moss-Bachrach, Forest Whitaker, and more), and the story is deeply moving. This is exceptional television, people. — K.G.\nHow long is it? 10 hours, one season\nHow to watch: Andor is now streaming on Disney+.\nPoker Face\nSometimes nothing hits better than a murder-of-the-week, and Rian Johnson’s Poker Face is an excellent send-up of the form. Natasha Lyonne is Charlie Cale, a former casino worker on the run from a corrupt boss, and a woman who happens to always know when people are lying or telling the truth. Do you think she solves mysteries while she’s working her way across the country, meeting a new, wacky cast of characters at each location? You bet your butt she does!\nUtilizing Columbo-style inverted detective stories (where the audience already knows the details of the crime), the joy of Poker Face comes from watching Lyonne work out how these dirty deeds were actually committed — which she does, with panache. — K.G.\nHow long is it? 10 hours, one season\nHow to watch: Poker Face is now streaming on Peacock.\nLovecraft Country\nThe Mashable review of Lovecraft Country described the first five episodes as “wild.” There was no way to know how wild the show was going to get. Lovecraft was ambitious and attempted to rewrite the white supremacist legacy of H.P. Lovecraft by using his concepts to examine the eldritch horrors of racism by anchoring tales of adventure, science fiction, and magic in Black American experiences. It was messy, perhaps not earning its ending but taking the audience on a ride so unpredictable Season 1 could almost be watched as an anthology. At its best, Lovecraft Country was brilliant and thought-provoking, and even its worst gave the audience enough material to tease out meanings and subtleties for themselves.* — A.N.\nHow long is it? 10 hours, one season\nHow to watch: Lovecraft Country is now streaming on Max.\nInventing Anna\nNew York wasn't ready for Anna Delvey, and neither are you. The German heiress posing as a socialite is the core of Netflix series Inventing Anna. Julia Garner stars as the real-life figure behind endless speculation and a whole lot of missing cash. Anna Chlumsky plays a reporter intent to learn Delvey's story. But she's met with more and more questions every time she gets close. The Shondaland series is based on Jessica Pressler's viral article on Delvey and her antics, and it paints a picture of someone obsessed with the high-society lifestyle, no matter what the cost.* — P.K.\nHow long is it? 10 hours, one season\nHow to watch: Inventing Anna is now streaming on Netflix.\nThe Man Who Fell to Earth\nThe Man Who Fell to Earth is a sequel to the 1976 film of the same name starring David Bowie, and it rules. It pays homage to its predecessor while spinning a smart, all-too-relevant story about an alien attempting to save his homeworld from total collapse. That alien is Faraday (Chiwetel Ejiofor), and his quest on Earth is to find scientist Justin Falls (Naomie Harris) and recruit her to his cause. Ejiofor and Harris are both brilliant, as is Bill Nighy, who takes on Bowie's role from the original film. If you're looking for smart, fascinating science fiction, this should be at the top of your list.* — B.E.\nHow to watch: The Man Who Fell to Earth is now streaming on Showtime.\nHow long is it? 10 hours, one season\nHacks\nHacks is many things: an incredible vehicle for Jean Smart; a provocative piece about the business of comedy; an odd-couple two-hander about work relationships that become all-consuming. The show, about a falling star older comedian (Smart) and the once-hot, now-blacklisted writer (Hannah Einbinder) that begins to work with her on her Las Vegas standup act, is snappy and smart, with plenty to say about women who never got their due. It could easily have turned into a screed against Gen Z or Boomers, but instead, Hacks (which was co-created by Lucia Aniello, Paul W. Downs, and Jen Statsky) is a thoughtful exploration of change and comedy, engaging to both those who know a lot about the inside of Hollywood as well as those who look on from afar. The show is engrossing and funny — a binge you'll be thinking about far after the surprising and stirring final moments.* — Erin Strecker, former Entertainment Editor\nHow long is it? 10.5 hours, two seasons\nHow to watch: Hacks is now streaming on Max.\nAll of Us Are Dead\nCombine zombie outbreak with teen drama and you've got All of Us Are Dead. Based on the webtoon by Joo Dong-geun, the South Korean series was written by Chun Sung-Il, directed by Lee Jae-kyoo and Kim Nam-su, with superb cinematography from Park Se-seung. The series takes place during a pretty damn intense zombie apocalypse that emerges from Hyosan High School, wherein students balance fighting off their former classmates with...their crushes. — S.C.\nHow long is it? 10.5 hours, one season\nHow to stream: All of Us Are Dead is now streaming on Netflix.\nFlight time: 11 hours\nThe Afterparty\nMany people have attempted modern twists on the classic detective whodunnit. Apple TV+'s The Afterparty is a series that got the genre absolutely right. Its all-star cast delivers nuanced and hilarious performances that slowly build up the mystery of who murdered a pop star after their high school reunion, all of which culminate in one of the most satisfying mystery finales in a long time. All that in just eight episodes? Don't waste your one (or two) shot(s) to hop on this bandwagon.\nThe second season features both fresh and familiar faces from season one grappling with yet another dead body at a major life event. With inspiration from new film genres and another smart, twisting mystery, The Afterparty season two proves that this show has legs, and that it’s here to stay. — A.N. & K.G.\nHow long: 11 hours, two seasons\nHow to watch: The After Party is now streaming on Apple TV+.\nOnly Murders in the Building\nSpend hours solving murders at the Arconia with our three podcasting heroes in Only Murders in the Building Season 1 and Season 2.\nMartin Short, Steve Martin, and Selena Gomez star as Mabel Mora, Charles-Haden Savage, and Oliver Putnam, three true crime podcast superfans and residents at a fancy Upper West Side apartment who become entangled in each other's lives after murder becomes afoot in the building. But there’s a bigger question afoot: why is everyone always wearing sweaters? — K.G.\nHow long is it? 11.5 hours, two seasons\nHow to watch: Only Murders in the Building is now streaming on Hulu.\nFlight time: 12 hours\nBig Little Lies\nAdapted from Liane Moriarty’s best-selling book, directed by Wild's Jean-Marc Vallée, and set in the sedate, well-to-do Californian beach town of Monterey, this captivating Golden Globe winner is impossible to close a window on. Big Little Lies features one of the biggest little casts on television: Nicole Kidman, Reese Witherspoon, Shailene Woodley, Laura Dern (raaaaage), and Zoe Kravitz, along with Alexander Skarsgard and Adam Scott. Then, in Season 2, Meryl Streep lands, and hoo boy. — S.C.\nHow long is it? 12.5 hours, two seasons\nHow to watch: Big Little Lies is now streaming on Max in the U.S. and Now TV in the UK.\nThe Outlaws\nWhen you combine the powerful forces of The Office co-creator Stephen Merchant and acting legend Christopher Walken, good things are bound to happen. Splicing silly comedy with elements of crime thriller, Merchant’s six-episode series sees seven mismatched strangers (Merchant and Walken alongside Rhianne Barreto, Gamba Cole, Darren Boyd, Clare Perkins and Eleanor Tomlinson) being brought together to complete their community service in Bristol, UK. The show is a little patchy in places but there are enough laughs to keep it ticking over and an entertaining storyline involving a bag of stolen money and some criminals desperate to get it back. — S.H.\nHow long is it? 12 hours, two seasons\nHow to watch: The Outlaws is available to stream now on BBC iPlayer in the UK and on Prime Video in the U.S.\nFlight time: 13+ hours\nAbbott Elementary\nYou know that kind of feel-good comedy that's not exactly escapist because it never lets you forget the troubles of the real world, but is radiantly heartwarming all the same? That's the kind of comedy Abbott Elementary offers, making it the top of its sitcom class.\nCreated by and starring Quinta Brunson, Abbott Elementary is an Office-like mockumentary that welcomes viewers behind the scenes (or into the teacher's lounge) of a predominantly Black public school in Philadelphia, where the educators are as hilariously flawed as they are lovable. Among the staff, there are newbie/idealists Janine (Brunson) and Jacob (Chris Perfetti), jaded substitute teacher Gregory (Tyler James Williams), no-nonsense veterans (Lisa Ann Walter and Sheryl Lee Ralph), and a self-obsessed diva/problem-making principal (Janelle James). Together, they face budget issues, soiled carpets, faulty electricity, and a slew of other unglamorous problems that are just everyday issues for teachers in America. But through it all, Brunson and her A+ ensemble bring humor and humanity that makes the real world feel bearable. If you're hungry for TV's version of comfort food, look no further.* — K.P.\nHow long is it? 13.5 hours, two seasons\nHow to watch: Abbott Elementary is now streaming on Hulu in the U.S. and on Disney+ in the UK.\nMiracle Workers\nThe best part about binge-watching Miracle Workers is that it’s an anthology series, so each season features the same actors but an entirely different story and set of characters. And even better, each season is sillier than the last. Based off of Simon Rich’s novel What in God's Name, the first iteration of Miracle Workers sees Daniel Radcliffe as Craig, a disillusioned angel working in the \"Wish-Granting Department\" who has given up on making any real changes on earth. That works just fine for God, an incompetent nihilist played by a truly perfect Steve Buscemi. But when an idealistic angel, Eliza (Geraldine Viswanathan), shakes up the status quo, Craig starts to believe that change might actually be possible.\nSeason two finds the crew, which includes Karan Soni, Jon Bass, and Lolly Adefope, in medieval England, where Radcliffe is now a whiny prince and Viswanathan, a shit-shoveler who dreams of more. In Season three, they're plopped in the American West, traversing the Oregon Trail in search of a better life. The fourth season, which is currently airing, riffs on all things Mad Max. Each Miracle Workers installment is hilarious, self-aware, and completely absurd, making it one of the most charming comedies on TV right now. —K.P.\nHow long is it? 15 hours, four seasons.\nHow to watch: Miracle Workers Seasons 1-3 are now streaming on Max.\nMiracle Workers Season 4 premieres July 10 on TBS, with new episodes every Monday.\nSweet Tooth\nEven though it takes place after a deadly virus has decimated the human population and caused the collapse of civilization (yikes), Sweet Tooth is more of a fairy tale told from the perspective of one of the other side effects of the apocalypse — a human-deer hybrid named Gus, whose father sheltered him from the worst of the world until shelter became untenable. Gus's journey through the world he barely knew existed is a beautiful coming-of-age story with a talented supporting cast and a flawless cute-to-concerning ratio.* —A.N.\nHow long is it it? 13 hours, two seasons\nHow to watch: Sweet Tooth is now streaming on Netflix.\nShadow and Bone\nShadow and Bone is the rare book-to-tv adaptation that took full advantage of the time between publishing and premiere and used it to improve the source materials in multiple directions. Leigh Bardugo's original novel was a smash hit, but Shadow and Bone the series makes the cast more diverse, adds a subplot starring characters from the companion series Six of Crows, and brings forth some of the book's messed-up romantic politics in a thoughtful and entertaining way.\nCasting Ben Barnes as the Darkling, long thought to be the ultimate fancast, is only the very, very good-looking cherry on top of a series that takes the thematic responsibilities of YA fantasy seriously while being a dang entertaining show.* —A.N.\nHow long is it? 14.6 hours, two seasons\nHow to watch: Shadow and Bone is now streaming on Netflix.\nTed Lasso\nYou'd better believe Ted Lasso is one of the most binge-worthy watches on this list. Each wholesome, hilarious, moving episode comes brimming with delightfulness (and Easter eggs) only to be brought back into line with Roy Kent's perfect swearing. Created by Jason Sudeikis, Bill Lawrence, Brendan Hunt, and Joe Kelly, the two-season series follows the titular Ted Lasso (Sudeikis), an American football coach who is brought in to coach English Premier League team AFC Richmond by the club's owner, Rebecca Welton (Hannah Waddingham). Only problem is, Lasso and his 2IC Coach Beard (Hunt) know little about this type of football at all. But this is simply where the show begins, and where it goes is worthy of a long flight. — S.C.\nHow long is it? 22 hours, three seasons\nHow to watch: Ted Lasso is now streaming on Apple TV+.\nDead to Me\nIf you're after an addictive, easy binge-watch during your flight, Dead to Me is your go-to. The dark comedy's first season follows Jen (Christina Applegate) who scrambles to solve her husband's hit-and-run murder. In the meantime, she befriends Judy (Linda Cardellini), who's dealing with her own loss. But there's a big secret afoot, all leading to the Season 1 finale, at which point you'll want to get up, stretch, and dive straight into Season 2. And then...Season 3!— S.C.\nHow long is it? About 16 hours, three seasons\nHow to watch: Dead to Me is now streaming on Netflix.\nTopics Streaming Watch Guides\nShannon Connellan is Mashable's UK Editor based in London, formerly Mashable's Australia Editor, but emotionally, she lives in the Creel House. A Tomatometer-approved critic, Shannon writes about entertainment, tech, social good, science, culture, and Australian horror.",
  "word_count": 10631,
  "scraped_at": "2026-02-14T14:22:54.821141"
}