{
  "article_id": "25cc362fa79d",
  "url": "https://business.scoop.co.nz/2025/09/13/spark-details-back-to-core-spk-30-strategy/",
  "title": "Business . Scoop » Spark details back - to - core SPK - 30 strategy",
  "date": "20250913T123000Z",
  "domain": "business.scoop.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Spark details back-to-core SPK-30 strategy\nArticle – Bill Bennett\nSpark sharpens SPK-30 strategy; 5G boosted by T tea; new API services with Aduna; Apple unveils slimmer iPhone Air; Oppo partners with All Whites and Ferns; Tuanz board update.\n- Spark provides more detail on SPK-30 strategy\n- Tū Ātea partnership boosts Spark 5G bandwidth\n- iPhone 17 launch includes slimmer handset\nFive-year plan puts network and customers first\nSpark fleshed out the return-to-core-connectivity strategy it outlined last month during its annual result announcement. The company told investors that its focus is now on delivering a better network and better customer experiences under the banner: “It’s better with Spark”. This doubles as a marketing message and a mission statement.\n“Our core connectivity business is our priority for capital allocation, and we will build on our competitive advantages by investing in network and customer experiences that set Spark apart.” — Spark chair Justine Smyth.\nAmong its plans to create a better network Spark says it will use AI to resolve network issues and improve regional resilience. It notes it has the only 5G standalone network in New Zealand and its 5G network now reaches half the population.\nFixed wireless broadband centre stage\nThere will be a renewed emphasis on selling fixed wireless broadband using 5G which delivers a faster and more consistent broadband experience than older 4G-based services.\nSpark says it will re-farm 3G spectrum and add further capacity thanks to the Tū Ātea partnership, see the next story.\nThese spectrum updates mean Spark can deliver what it calls “fibre-like” average speeds. The SPK-30 strategy also aims to work on selling bundles combining mobile and broadband. Other retailers have found bundles a proven way to make customers less likely to switch providers.\nSpark satellite service coming next year\nSpark plans to offer satellite-to-mobile services in the second half of the 2026 financial year — the first six months of 2026.\nIt hasn’t named a satellite partner. The most likely candidate is Starlink. We know One New Zealand’s exclusive deal with the SpaceX firm is for a limited time. Yet Spark’s timetable also coincides with the promised arrival of Amazon’s Project Kuiper satellite network which will focus more on wholesale arrangements.\nCustomer experience is a tougher nut to crack. Spark aims to improve satisfaction by developing its retail outlets and the nebulous-sounding “investing in digital journeys”.\nAI everywhere\nAI also has a role to play in customer service. Spark says the technology will empower all its channels: “To serve up the right offer, to the right customer, at the right time”.\nThe SPK-30 strategy is infused with mentions of AI. The company says it plans to use more AI in cloud, IT services and procurement.\nOver the next year Spark will add three new directors to its board. Chair Justine Smyth has confirmed she will stand for re-election at the upcoming AGM in November. She says she intends to stay in the role for up to 12 months to smooth the transition to a new chair.\nSpark picks up Aduna\nAs part of Spark’s return to basics, the company has become the first New Zealand partner API platform aggregator Aduna. The joint venture between 13 telecom operators and Ericsson has technology that will allow Spark to develop new “Network as a Service” offerings.\nThe first projects are sim swap detection and number verification APIs to help businesses reduce fraud and verify identities. Spark says the partnership will unlock new ways to earn revenue.\nTū Ātea partnership gives Spark 5G faster speeds, greater capacity\nSpark has signed an 18-year agreement with Tū Ātea to use 20MHz of 3.5GHz spectrum.\nIt means Spark will have 100MHz of C-band spectrum and a total of 350MHz. Renee Mateparae, the company’s network and operations director says that from October customers will see 5G speeds increase by as much as 25 percent. The additional spectrum also increases traffic capacity by up to 20 percent.\nShe says it will be used on the company’s 770 C-band 5G cell sites for both mobile and fixed wireless broadband.\nThe move aligns strongly with the carrier’s SPK-30 strategy mentioned earlier in this newsletter.\nMateparae says: “Over the past year, 5G mobile data usage has grown by 79 percent and our 5G network now reaches over half the population. Today’s announcement ensures we are well positioned to meet future demand.”\nSmall cell site roll-out\nAlong with the spectrum deal, Spark and Tū Ātea will roll out rural and regional small cell sites to improve coverage in hard-to-reach areas. This includes support for marae-based civil defence connectivity.\nTū Ātea’s small cells are satellite-enabled sites that are deployed when needed and provide automatic mobile coverage to communities in range in partnership with Spark. For example, during major sports or weather events when demand for mobile coverage is high.\nThe two will collaborate on creating new pathways for Māori to have careers in the telecommunications and digital sectors.\nAntony Royal, Tū Ātea’s chief executive says his organisation is committed to “unlocking the power of spectrum to grow Māori participation, drive innovation, and deliver benefits for all communities across Aotearoa.”\nTū Ātea built Aotearoa’s first private 5G network.\nApple launches slimmer iPhone 17, ditches AI hype\nApple has added a slimmer iPhone Air model to the 2025 iPhone line up. The new Air model has a high density battery and the company says it is more durable than previous models.\nIt uses the A19 Pro processor chip which Apple says has been tweaked for improved energy efficiency and performance to match the thinner battery. Prices start at $2150.\nApple also launched the iPhone 17 and iPhone 17 Pro. There is a new version of the company’s AirPods Pro wireless headphones and the latest Apple Watch includes a blood pressure monitor.\nInterestingly there was little mention of AI at this year’s iPhone launch. That contrasts with the 2024 iPhone launch when AI dominated proceedings.\nNew Zealand prices for the 256-gigabyte version of the iPhone 17 base model start at $1700. That’s a $100 more than last year’s iPhone 16 base model, but has double the 128 GB storage in the earlier phone. In effect, this means Apple has held iPhone prices largely steady for two years\niPhone users get another year of free emergency satellite coverage\nA note at the bottom of the online version of Apple’s iPhone press release says the company is extending free access to satellite features for an additional year for existing iPhone 14 and iPhone 15 users.\nThe free trial will be extended for iPhone 14 and iPhone 15 users who have activated their device in a country that supports Apple’s satellite features prior to 7pm NZST on 9 September, 2025.\nIn other news…\n- Google says the open web is in rapid decline — Ars Technica\n- What do data centres contribute to the economy? — RNZ\n- There’s a case for making the tech giants pay NZ tax — iStart\n- Dodgy but not necessarily illegal, another take on the tax tech giants are not paying here — Businessdesk (paywall)\nTuanz board moves\nTuanz’s board is largely unchanged following elections at the organisation’s AGM. The new face is Ventia GM of telecommunications Jo Crawford, formerly of Chorus.\nTristan Illich, Zoe Udy, Matthew Harrison and Sid Kumar were all re-elected to the board while Andrew Cushen, Paul Littlefair, Caitlin Metz, Garth Spencer Kari Jones and David Mathieson have another year to run on their current terms. Eden Robertson is the board intern.\nOppo official partner for All Whites and Football Ferns\nChinese mobile phone maker Oppo has signed as the official smartphone and smart device partner of the All Whites and the Ford Football Ferns.\nThe deal covers next year’s FIFA World Cup where the All Whites have already qualified. If the Ferns make it to the 2027 Women’s World Cup, that will also be covered.\nIt means Oppo’s brand will be on the All Whites training kit and will show up in stadiums at international matches. The players will get phones, smart watches and tablets.\nOppo has worked with the Wellington Phoenix for the last five years and is a supporting partner of the Dettol National League, the Delivereasy Chatham Cup and the Delivereasy Kate Sheppard Cup.\nFive years ago: Covid uncertainty hit Sky TV result\nSky Television lost $156.8 million in its 2020 financial year mainly because of a goodwill write down reflecting the uncertainty due to the pandemic.\nThis time last year: Apple extended its satellite service and Connexa extended its reach buying ATC’s New Zealand business.\nThe Download Weekly is supported by Chorus New Zealand.\nSpark details back-to-core SPK-30 strategy was first posted at billbennett.co.nz.\nContent Sourced from scoop.co.nz\nOriginal url",
  "word_count": 1452,
  "scraped_at": "2026-02-14T12:36:56.382910"
}