{
  "article_id": "261ff1b7f56c",
  "url": "https://www.examiner.com.au/story/8135649/title-defence-marches-on-for-state-champions/",
  "title": "Launceston United continue Women Super League title defence | The Examiner",
  "date": "20230326T121500Z",
  "domain": "examiner.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "An unchanged line-up made for an unchanged result and unchanged storyline as Launceston United continued their dominance of the Women's Super League.\nSubscribe now for unlimited access.\nor signup to continue reading\nTwo games in and two wins on the board is suggesting the transition from the dream team of Frank Compton and Lynden Prince - who were both among the crowd - to Nick Rawlinson has been pretty seamless for the reigning champions.\nKingborough presented plenty of problems in United's first home game of the season, but a resilient performance produced a goal in each half - the first bullied, the second belted - plus a hard-earned 2-0 win.\n\"That was a really tough game, especially in the first half,\" said a relieved Rawlinson who left no doubt about the day's buzzword.\n\"I was so pleased at half-time that they gutsed it out and stayed in the game. We were 1-0 up, we took the chance we had and played some really good soccer in the second half so really happy.\n\"At half-time I told them how well they'd done but I thought the wind was a big advantage and I think it showed that for both teams. I think we used it well. We had a spell there for the first 20 minutes of the second half where we kept the ball and got the (second) goal.\n\"Kingborough came back at us but we gutsed it out and I was really, really pleased.\n\"Sometimes it's about good football, other times it's just about gutsing it out and I think the girls showed a bit of both today which is fantastic.\"\nThis will not prove to be United's best display of the season, which was why Rawlinson was so pleased to bank the points.\n\"Kingborough were probably better in the first half but even though they were playing really well, our girls didn't give them an easy shot and that was a credit to them for doing that.\n\"And we're creating chances even when we don't have a lot of ball, like in the first half. When we got the ball, I think we were more likely to score than them.\"\nThe same line-up that had beaten Taroona 5-0 in the season-opener continued to look the business against one of their heavyweight opponents.\nWith new signing Issy Declerck forming a formidable partnership with Katie Hill in central defence, versatile captain Nichy Clark has switched to left-back in a disciplined back four which continues to see Laura Dickinson relish any chance to roam up the right flank.\nDeclerck's arrival has released Maddie Lohse into a role in the midfield where she looks comfortable alongside the equally hard-working Ava Farquhar and Madi Gilpin, who all looked hungrier than their Lions opponents.\nHowever, it was the front three who most impressed, with US import Courtney Marten and new signing Lucy Smith providing able support for last season's top scorer Dani Gunton.\nAll three were on the scoresheet at Taroona and Gunton took just 10 minutes to add to her hat-trick, forcing the ball home despite being heavily outnumbered in the box.\nSmith added the second a similar way through the second half, letting fly from outside the box to give Erika Mackintosh no chance.\nThe Lions' keeper made amends to deny Marten from close range as Gunton also hit the post but it was far from one-way traffic.\nHome keeper Jazlin Venn was also kept busy - most notably when Niki Moutsatsos stole in behind the defence - although most Lions chances were created by the dynamic Laura Davis.\nThree times the driving midfielder seemed destined to score only to be denied by Venn's heroics, an unorthodox but effective diving block by Clark and her own reluctance to pull the trigger after dancing through the entire defence.\nUnited rode their luck and were rewarded by being able to blood young subs Estelle Tomkinson, Molly Duigan and Kathleen Fuller late doors.\n************************\nOur journalists work hard to provide local, up-to-date news to the community. This is how you can continue to access our trusted content:\n- Bookmark www.examiner.com.au\n- Sign up for our breaking and regular headlines newsletters\n- Follow us on Twitter: @TheShawThing and @examineronline\n- Follow us on Instagram: @examineronline\n- Follow us on Google News: The Examiner",
  "word_count": 717,
  "scraped_at": "2026-02-14T12:13:38.653352"
}