{
  "article_id": "26364aaa49aa",
  "url": "https://www.thenationalnews.com/news/us/2025/09/24/southern-independence-opens-door-to-ties-with-israel-says-yemens-al-zubaidi/",
  "title": "Southern independence opens door to ties with Israel , says Yemen Al Zubaidi",
  "date": "20250924T210000Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Declaring an independent southern Yemeni state would pave the way for entering the Abraham Accords, the deputy chairman of Yemen's Presidential Council Aidarous Al Zubaidi told The National in an interview.\nThe president of the Southern Transitional Council said all the conditions were in place for statehood and added that secession would allow the south to make its own foreign policy decisions, including the option of joining the Abraham Accords.\n“Before the events in Gaza, we were advancing towards joining the Abraham Accords,” he said. “If Gaza and Palestine regain their rights, the Accords will be essential for stability in the region. When we have our southern state, we will make our own decisions and I believe we will be part of these accords.”\nIsrael has repeatedly attacked Yemen in air strikes on Houthi militants, notably in the rebel-held capital Sanaa and the port of Hodeidah. The Houthis regularly fire missiles at Israel, achieving a relatively rare hit on Wednesday when a drone fell in the city of Eilat.\nYemen's eight-member Presidential Council leads the anti-Houthi, internationally recognised government in exile in Aden. The secessionist Southern Transitional Council holds three of those eight seats.\nMr Al Zubaidi spoke to The National in New York as the UN General Assembly meets, with the Middle East high on the agenda. A group of aid workers called on leaders to take \"urgent and decisive action\" to address a humanitarian crisis in Yemen after years of conflict.\nMr Al Zubaidi stressed that southerners in Yemen see themselves as ready for independence. “The south is liberated and we are protecting our borders,” he said. “Politically and geopolitically, we are ready. We only need to announce independence and for others to recognise us”.\nHe argued that independence would not only isolate the Houthis in the north but also provide clarity for international partners.\n“As the situation becomes more complicated, we feel we could announce [independence] at any time. Southerners already control their land, the army and the police are there,” he explained.\nFrom 1967 until unification in 1990, the country was divided between North Yemen and the socialist People’s Democratic Republic of Yemen in the south. That history, he said, makes the idea of two Yemeni states again neither unusual nor impossible.\n“The main challenge is asking our partners to approve our right of self-determination and begin the transition phase,” he said. “We are hopeful that supporting countries will help liberate the north from the Houthis, and the south to gain its independence.”\nPeace process 'frozen'\nMr Al Zubaidi described the peace process as stalled. “The peace process has stopped and is frozen,\" he said. \"After the Houthis’ attacks, there is no real prospect. The attacks changed the whole calculus. We are in a state of neither war nor peace.\"\nHe welcomed decisions to designate the Houthis as a terrorist group, calling them weakened and isolated.\n“The Houthis tried to invest in their regional role by attacking Israel, but their attacks are weak and not impactful,” he said. \"They are now in a very weak position, and their actions have only added to the misery of the Yemeni people.\"\nMr Al Zubaidi acknowledged the economic hardship facing Yemen’s internationally recognised government. With oil making up 70 per cent of the state budget, revenue has been slashed since Houthi strikes on export facilities.\n“The Prime Minister and the government are trying their best but the situation is very difficult and very expensive,” he said. “We need serious efforts to restart exports again, so we can improve conditions for our people.”\nHe credited Saudi Arabia and the UAE with keeping the economy afloat. “They have provided a lot over the years, financially and in energy. Without their help, everything would have collapsed.\"\nOn security, he highlighted the challenges of Yemen’s southern coastline. “We are trying to maintain security with what we have, but the main challenge is confronting extremist cells,” he said. “The coast is very long, and there is migration and narcotics smuggling. Many countries are helping us but the plans to improve border security are very limited.”\nMr Al Zubaidi framed independence not just as a local aspiration but as part of a wider commitment to stability in the region. “We support the two-state solution – a Yemeni state in the north and in the south – and a Palestinian state alongside Israel,” he said. “Self-determination is a right. All people have the right to determine their future.”",
  "word_count": 742,
  "scraped_at": "2026-02-14T13:21:49.462764"
}