{
  "article_id": "26878355ff89",
  "url": "https://www.thefa.com/news/2024/aug/29/john-griffiths-newport-pagnell-town-women-fa-cup-preview-20242908",
  "title": "Newport Pagnell Town have  real belief  for FA Cup",
  "date": "20240829T153000Z",
  "domain": "thefa.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Newport Pagnell Town Women manager Neil Griffiths is confident his side are heading in the right direction as they prepare for Saturday's Adobe Women's FA Cup tie with local rivals New Bradwell St Peter Ladies.\nTown were promoted from the ninth tier of the women's football pyramid up to the sixth last summer, before Griffiths took charge in December and led them into mid-table of the East Midlands Regional Women's Football League Division One South after an impressive end to the 2023-24 campaign.\nNow he believes they can kick on, with success in the cup a major part of their ambitions.\nGriffiths said: \"We have real belief here. We recruited well throughout the summer, adding league winners at this level but also maintaining a really young group. We have first-team players with ages ranging from 17 to 41.\n\"I'm conscious about not making specific targets other than to keep improving but we want to be winning games consistently. We're optimistic.\n\"The FA Cup is really important. It still offers that prestige when you hear the name of the competition and it gives us the chance to create special memories because the games are big occasions. This one is even more so because the two teams know each other so well.\n\"We also can't get away from the fact that the support from the FA in prize money helps us no end.\"\nGriffiths prides his team on its culture, combining high standards with a welcoming atmosphere that gets the best out of everybody.\nHe said: \"We have a really professional environment. I'm also really lucky to have a great management team. I'm supported by Brad Churchill and my assistant is Lee Adams, who holds a UEFA B licence and a Masters in sports coaching. He has coaching experience at elite talent programmes within a number of professional football clubs and is a senior lecturer at University Campus Football Business (UCFB) at Wembley stadium.\n\"We provided additional support to keep the players fit over the summer, we video every game and analyse them, which the players are brilliant at engaging with. We go into real detail. We try not to be too reactionary from game to game but keep developing the way we play.\n\"But what I'm really proud of is how welcoming we are. I think every player we invited to talk to us over the summer ended up signing and that says a lot about the group. We create a real safe space for development.\"\nNewport Pagnell have their own specific claim to fame in the shape of England Women's captain Leah Williamson, who grew up in the area.\nA new community football pitch was recently unveiled by Williamson at the club after it was awarded a Lionesses Futures Fund grant and Griffiths describes the Lionesses skipper as a huge inspiration.\nHe said: \"She is so significant. On the day she came down it was really interesting seeing senior players just as excited as the younger ones. That tells you the impact she's had on every walk of life.\n\"You see now that girls of every age and demographic want to play football. At our own club we have multiple Under-15 teams, because so many young girls want to play.\n\"The pitch itself is a huge benefit to the club. It's top class. It allows us a stable training facility that we can maintain and we look after. There's a girls-only night and it means we don't have unsociable hours.\"\nGriffiths will hope Newport Pagnell Town's impressive progress is reflected in their efforts on Saturday.",
  "word_count": 595,
  "scraped_at": "2026-02-14T13:05:06.490585"
}