{
  "article_id": "2694f29cf858",
  "url": "https://www.irishfa.com/news/2026/january/lindsay-to-take-charge-of-northern-ireland-women-on-interim-basis",
  "title": "Lindsay to take charge of Northern Ireland Women on ... ",
  "date": "20260128T134500Z",
  "domain": "irishfa.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Kris Lindsay will manage the Northern Ireland senior women’s team in their opening two games in the European qualifiers for FIFA Women’s World Cup 2027, it was announced today.\nLindsay has been appointed to the role of manager on an interim basis while the Irish Football Association seeks a permanent successor to Tanya Oxtoby, who stepped down in November.\nNorthern Ireland are set to face Switzerland, Turkiye and Malta in stage one of the European qualifiers for FIFA Women’s World Cup 2027 in Brazil.\nLindsay will be in charge of the team for their League B Group 2 opener against group top seeds Switzerland away on Tuesday 3 March. And he will also be in the hotseat when Northern Ireland, who are second seeds in the group, take on third seeds Turkiye at home on Saturday 7 March.\nHe said: “Managing your country at any level is a privilege and I’m delighted to be given this chance.\n“I have followed the senior women’s team for some time. They have a fantastic leadership group and my role will simply be to add where I can.\n“These are two tough games to kick off our World Cup campaign and I’m looking forward to getting started.”\nAngela Platt, Director of Women’s Football at the Irish Football Association, said the interim arrangement with Lindsay would allow the recruitment process for a permanent manager to be conducted thoroughly.\nShe explained: “Following Tanya stepping aside, it was important that we took the appropriate time to reflect and fully assess what the next phase for the senior women’s team should look like. That included building on the strong foundations established during her tenure and the significant work ongoing across the wider association.\n“From the outset we were clear that appointing a senior international head coach is a significant and complex decision, and one that requires proper time and diligence. Our focus has been on clearly defining the needs, ambitions and long-term vision for the programme to ensure the next appointment is aligned with where we want the team to go, rather than being driven by short-term pressures.”\nShe said that to support that process the association engaged Football Careers, a leading recruitment agency with a strong global coaching database, prior to Christmas.\nPlatt continued: “That engagement allowed us to begin the search early, using both their expertise and our own knowledge of the women’s game to identify a strong and diverse pool of candidates.\n“Following the festive period the process formally resumed and we are in regular contact with the agency as they assess candidates against a detailed role profile, including how they would work with the current senior squad.\n“In parallel, and as part of our planning rather than a reaction to circumstances, we took the decision to appoint an interim manager. Given the natural timeframe involved in recruiting a role of this nature and profile, this ensures continuity, stability and clarity for players and staff, and allows preparation for upcoming FIFA Women’s World Cup qualifying fixtures to remain fully on track.”\nShe said Lindsay’s interim appointment will provide day-to-day leadership and focus for the squad “without in any way detracting from or diluting the permanent recruitment process”.\nAnd she added: “The interim arrangement allows the recruitment process to be conducted thoroughly and without compromise while ensuring the team’s competitive and performance needs are fully met in the short term.\n“Ultimately the successful permanent appointment must be the right fit both culturally and technically, and a robust process is in place to deliver that outcome and build on the progress already made.”\nCurrently the National Academy Manager with the Irish Football Association, Lindsay is an experienced coach who has previously managed Dungannon Swifts and been first team coach at both Cliftonville and Glenavon.\nApart from his spells with the three NIFL Premiership clubs he has also previously been an interim first team coach with the Northern Ireland senior women’s team - for friendlies against Scotland and Czechia in July 2023 - and he is currently the manager of Northern Ireland’s Under-16 men’s team.\nThe 41-year-old was a central defender in his playing days. He enjoyed successful trophy-laden spells with Linfield and Glenavon, and he also played for Portadown and Larne.",
  "word_count": 704,
  "scraped_at": "2026-02-14T12:38:35.091593"
}