{
  "article_id": "2699c62836fb",
  "url": "https://www.thepinknews.com/2023/02/18/leah-williamson-england-lionesses-onelove-armband-world-cup/",
  "title": "Will England wear OneLove armband at 2023 World Cup ? ",
  "date": "20230218T193000Z",
  "domain": "thepinknews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "England captain Leah Williamson says Lionesses want to wear OneLove armband at 2023 World Cup\nEngland captain Leah Williamson said the Lionesses want to wear the pro-LGBTQ+ OneLove armband at the women’s World Cup in July.\nThe Lionesses showed their support for the LGBTQ+ community multiple times, and Williamson wore a rainbow armband as the team triumphed at Euro 2022. The England women’s national team includes several out-and-proud queer players.\nHowever, England’s men’s team, along with teams from several other European nations, were not permitted to wear the OneLove armband at the recent World Cup in Qatar amid threats from FIFA of players getting yellow cards.\nWilliamson said the Lionesses are dead set on showing their support and continue to wear the armband, especially after their Euro 2022 victory.\n“The statement that was made at the Euros with every team participating was incredible, every picture we have with a trophy lift there’s a rainbow armband in there,” Williamson said during a news conference at the team’s opening match at the Arnold Clark Cup.\nShe continued: “It’s a great stage and a great time to promote the values we believe in so much, so I hope it’s the same [at the World Cup].\n“We’re never shy in saying what we stand for, we’re a squad that promotes inclusivity and equality. We obviously have a number of people that feel very strongly about it.”\nWilliamson expressed the Lionesses’ support for Czech Republic player Jakub Jankto, who this week came out publicly as gay, and said it was important to wear the OneLove armband to show “solidarity” with the football star.\nShe said it’s “not even a question” for the England women’s national team to show their support after seeing Jankto “step out and be as brave” as he can, changing his “whole life”.\n“So, for us to stand in solidarity with that is important to us but it’s something we’ve always done, it’s something we’ll continue to do,” she said.\n“We’re not just impacting football, we’re trying to have a positive impact on society too and that’s one of the ways we can do that.”\nWilliamson hoped the Lionesses would be able to wear the OneLove armband during the World Cup finals and wouldn’t face “last-minute” pressure from FIFA to take off the rainbow band.\nThe OneLove armbands were launched in 2020 as part of a campaign by footballers in the Netherlands. The campaign strongly opposes discrimination based on sexual orientation, gender, race, skin colour, culture, faith, nationality and all other forms of discrimination.\nIn November, England’s football governing body and its Welsh equivalent joined the Netherlands, Switzerland, Germany, Denmark and Belgium to confirm that threats of sporting sanctions from FIFA left them no choice but to abandon the OneLove armbands at the men’s World Cup.\nTheir joint statement said the national federations asked their captions “not to wear the armbands” at the World Cup games because of the “sporting sanctions including bookings”.\nThey added they were prepared to face fines for breaking kit regulations, but they couldn’t afford to have players receive yellow cards or be forced to leave the field.\nAmid FIFA’s many rules on team uniforms, the global football governing body prohibits the use of political statements on team kits.\nOne of its stipulations dictates that no item of playing kid, clothing or equipment “may be worn or used in any controlled area” if the global football body deems it “dangerous, offensive or indecent, includes political, religious, or personal slogans, statements, or images, or otherwise does not comply in full with the laws of the game”.",
  "word_count": 597,
  "scraped_at": "2026-02-14T13:03:21.365251"
}