{
  "article_id": "26b6d0102e60",
  "url": "https://nymag.com/intelligencer/article/how-did-marcel-malanga-tyler-thompson-join-a-coup-in-congo.html",
  "title": "How Did Marcel Malanga , Tyler Thompson Join a Coup in Congo ? ",
  "date": "20250711T094500Z",
  "domain": "nymag.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This article was featured in One Great Story, New York’s reading recommendation newsletter. Sign up here to get it nightly.\nMarcel Malanga was standing in the foyer of the Palais de la Nation, the home of the leader of the Democratic Republic of the Congo, with an assault rifle slung over his shoulder. It was just before dawn on May 19, 2024, and close by was his best friend from high school back in Utah, Tyler Thompson. Around them, 40 or so rebel soldiers in jungle fatigues were spread out across the palace grounds, fortifying their positions after shooting their way in. A few raised the flag of “New Zaire,” the rebranded version of the DRC they hoped to install in government if their efforts were successful; others burned the current flag. Malanga flipped the camera screen on his cell phone to selfie mode and hit “record.” “We are liberating these people,” he said, beads of sweat rolling down his face in the suffocating humidity. “DRC is free; we freed them.”\nNeither he nor Thompson seemed particularly suited to regime change. Malanga, 21 years old at the time, has soft brown eyes and a face pocked from acne. Back home in the Salt Lake City suburbs, he was known for his chaotic energy but lacked the hardened qualities of a true dog of war. One high-school friend described him to reporters as “rough around the edges but not enough to go and murder people.” Thompson was even less rebellion-ready. Handsome in a benign, midwestern kind of way with a toothy smile and droopy eyes, he had just celebrated his 21st birthday and had never been out of the U.S. before traveling to Africa. He was also an inveterate stoner, according to another friend. “If you didn’t have weed, you weren’t getting him out of the house,” they said.\nNevertheless, over the course of the previous year, the pair had fashioned themselves into two of the least likely soldiers of fortune in history. According to authorities, they attempted to organize weapon shipments from international arms dealers, helped build homemade bombs, and practiced their marksmanship at shooting ranges. Malanga even tried to recruit more friends to the cause, describing the mission as “Call of Duty stuff.” Their efforts would soon draw the attention of investigators on two continents and thrust them into the middle of high-stakes international diplomacy, while friends and family back home were left questioning everything they thought they knew about the pair of seemingly all-American boys.\nBut as the sun rose over Kinshasa, it appeared that their wildest ambitions might actually come true. The most important building in the Congo was under their control. Only one question remained: Whether or not the military would support them. If so, the dream of New Zaire would become reality; if not, they would be arrested or worse. In the distance, the rumble of vehicles grew louder. The security forces were approaching. Malanga was still recording his video selfie when bullets began to fly.\nUntil that morning last year, the closest either Malanga or Thompson had come to doing battle was as a member of the football team at Copper Hills High School in West Jordan, Utah, a fast-growing middle-class suburb of Salt Lake City. The team was middling at best, and when the losses piled up, the other students hardly took notice. Malanga, who was older by a year, was one of the squad’s star players, a running back who was as aggressive on the field as he was volatile off it. After one heavy loss, he punched his locker so hard he broke multiple fingers. Thompson played on the other side of the ball — free safety and special teams — but was no less dynamic. “He was a ball-out player,” said Rudy Cordova, a former teammate. “He could make hits, take hits.” It was, at least in part, this willingness to sacrifice their bodies that initially drew them together. During practice, they sometimes paired up specifically because they knew the other wouldn’t hold back. “They would call each other out so they could hit each other,” said Cordova. “They had that kind of relationship.”\nOff the field, they were a less obvious pairing. Thompson was almost preternaturally laid-back; one friend compared him to the sloth character in Disney’s Zootopia. His longtime girlfriend had broken off their relationship at least in part, friends told me, because Thompson was smoking too much weed. After graduation, he delivered DoorDash and helped out at his parents’ party-planning company while he tried to figure out next steps. Malanga, by contrast, seemed to know exactly what he wanted out of life: money.\nAfter graduating in 2020, Malanga spent a year playing football at Southern Virginia University, but when the thankless grind of Division III athletics proved too much, he returned to Utah ready to start anew as an entrepreneur. He posted pictures of diamonds for sale on his Instagram and promoted secondhand-auto sales through his company, Kooboyz LLC. The plan was to fold in multiple businesses and turn the company into “his own little empire,” said Luke Barbee, a former high-school teammate. Malanga wasn’t afraid to display his ambitions publicly. On social media, he posted photos of himself flashing cash while sitting on the hood of a Mercedes and using $20’s to spell out his nickname — “CEL,” as in Marcel — on his bed. His friends laughed off his behavior as typical Gen-Z flexing. “That money wasn’t even really his money,” Barbee said. “It just goes back into the business.” He told me that Malanga was “all bark and no bite.”\nStill, empire-building takes time, and in the interim, Malanga picked up work at a local construction-and-roofing business owned by Stephen Fullmer, the father of another teammate. During high school, Malanga had spent a lot of time with the Fullmers and seemed to find comfort in their father-son bond. It was the kind of relationship he had never experienced with his own dad, Christian, who had left when Marcel was still in preschool. The abandonment had cut deep. Friends from high school recalled him making disparaging comments whenever the topic of parents came up. “Part of him absolutely fucking hated his dad,” said one friend who asked not to be named. “He always kind of had that grudge.”\nThough they were estranged, another part of Marcel couldn’t help but see his father as an inspiration. A beefy, broad-shouldered man with a Duchenne smile, Christian was a natural salesman who was born in what was then Zaire in the early 1980s but was forced to flee the ethnic violence consuming the country at the time. After moving to Utah as part of a refugee-resettlement program, he graduated from high school, started a family, and opened what he claimed to be the first Black-owned car dealership in the state. In 2006, when Marcel was 4 years old, Christian returned to the Congo to join the military and pursue his business and political ambitions, leaving Marcel’s mother, Brittney Sawyer, to raise him on her own.\nAt the time, the DRC was mired in what the International Rescue Committee described as arguably “the world’s deadliest crisis since World War II.” An estimated 6 million Congolese had already died as a result of the country’s decadeslong civil wars, and corruption had become endemic to almost every aspect of daily life. Extrajudicial killings, disappearances, and rape were commonplace. Christian longed to bring about change. Inspired by the Founding Fathers, he fashioned himself a crusader for a corruption-free Congo and spent the next decade traveling the world and endearing himself to high-powered D.C. lobbyists, former ambassadors, and thousands of members of the Congolese diaspora. Eventually, he founded his own political party and declared himself president-in-exile. His vision for the future was a New Zaire modeled on the liberation politics of the American Revolution. The goal, he said, was “to rise from obscurity, defend the battlements of liberty and then, in triumph, hearten and sustain the cause of freedom everywhere.” For Marcel, who grew up hearing stories from family members about the Congo, his father’s politics seemed like an antidote to despair — and, perhaps, a worthy justification for his absence throughout Malanga’s life.\nBut there was a darker side to Christian, one that his son was either unaware of or chose to overlook: charges of aggravated assault, domestic violence, and failing to pay child support to Sawyer, who described him as having “anger issues.” Even the New Zaire movement, with all its soaring rhetoric, was driven at least in part by a personal vendetta. According to Christian, in 2011 he was arrested by Congolese security forces and tortured for ten days after reporting voter fraud to the country’s electoral commission. The episode left him with a limp and a passionate hatred for Joseph Kabila, then Congo’s president. “In my opinion, that made him go nuts for revenge,” said Cole Ducey, a mining entrepreneur who briefly worked with Christian in Mozambique. After his release and return to the U.S., Christian began speaking openly about overthrowing the Congolese government and was reportedly involved in at least one aborted coup attempt against Kabila in 2018 in which he narrowly evaded arrest. According to a Congolese official, Christian was already plotting another coup attempt soon after, recruiting co-conspirators from the diaspora in Britain and Canada. Over time, his movement became more radicalized, the official said, who described Christian as having “messianic ideals.”\nAround the time that he started working with the Fullmers, Marcel and his father reconnected. They hadn’t seen each other since Marcel was in his early teens, but like countless members of the Congolese diaspora before him, he was quickly taken in by Christian’s magnetism. When he visited his father in Eswatini (formerly Swaziland) and Mozambique, Marcel was treated to luxurious accommodations that included sprawling estates, private planes, and, according to friends, drugs. “His dad would just supply him with any drug he’d want,” said Barbee, who recalled the Snapchat messages that Marcel would send to his friends back home. “He’d have a personal chef, he’d have a maid, a limo driver. He’d have everything he needs at the push of a button, basically.” At one point, he even bragged that Christian had given him a gold mine of his own. Afterward, Marcel began referring to his father as “President Malanga” and telling his friends how wealthy and powerful he was. In fact, his praise was so effusive that at least one friend actually believed that his father was the president. “When you Googled his dad, it came up with a political figure in the DRC, and I said, Good enough, his story must match,” the friend told me.\nBetween 2021 and 2022, Marcel visited his father multiple times, encounters that appear to have instigated his conversion from estranged son to devotee and, soon after, to alleged conspirator. Whether he was won over by Christian’s charisma, wealth, or the looming trauma of his absence is anyone’s guess, but with each interaction, he was drawn closer into his father’s orbit. Upon returning home, Marcel dedicated himself fully to the cause of New Zaire — and, allegedly, to his father’s stated goal of overthrowing the Congolese government. “Honored to have you as my earthly father,” he wrote in the caption of an Instagram post featuring a childhood photo of him and Christian. “I can’t wait to change the world with you.”\nCompared to his trips to Eswatini and Mozambique, Marcel Malanga’s life in Utah seemed ordinary — up at five, head to the gym for an hour, then off to work building houses. On the weekends, he went camping, or dirt biking, or snowboarding in the Wasatch Mountains with his friends. Around the same time, he began quietly inviting them and former teammates to visit Africa with him. The details were vague: Barbee recalled being invited to “come chill in Africa for two weeks”; others were told it was a security job — “like Secret Service” — for Christian. Eventually, though, they each declined. They didn’t have passports or they had girlfriends or jobs keeping them at home. Malanga countered by allegedly upping the financial stakes. “If you want to make $50-100k message me (warriors only),” he posted to his Snapchat.\nIn the end, only Tyler Thompson agreed. He had started working alongside Malanga at the Fullmers’ business, and between long days laying roofing and nights hanging out, he and Malanga had become like brothers. As Malanga put it, they were used to “doing very hard things together.” One friend who ran into the pair a few weeks before they left told me they were open about traveling to Africa. “I remember they were talking about it,” the friend said. “But they didn’t mention anything about trying to overthrow a government.”\nAt the same time that Malanga was soliciting his friends, he was preparing for the coup, according to allegations laid out in court papers in the United States and the Congo. Malanga introduced at least one friend to Benjamin Zalman-Polun, a 37-year-old American who had met Christian a decade earlier at an international business conference in Washington, D.C., and fashioned himself into Christian’s “chief of staff,” though others familiar with their relationship described him as more of a gopher. He arrived in Utah to help with recruiting. “Cops are destroying markets, and women are being raped,” the friend recalled Zalman-Polun saying over a meal at a restaurant. Taking over the presidential palace wasn’t just exciting, he explained; it was the right thing to do.\nIn July 2023, Malanga allegedly reached out on Instagram to someone affiliated with the Ukrainian military to inquire about hornets, small combat-style drones that can be used to drop munitions from altitude. “I am looking to get ahold of these hornets as-well for my platoons,” Malanga wrote. “For my people are fighting a very similar war right now.” In the correspondence, he introduced himself as the “Chief of Staff of the Zaire Army.” It’s unclear whether the sobriquet was something Christian had bestowed on him or Malanga came up with himself, but what’s certain is that Malanga was by then a true believer. “I know the people want change,” he would later say, equating the members of the New Zaire movement to the rebels of the American and French Revolutions. “Those people get called heroes.”\nThompson’s motivations are still murky. He didn’t have a familial connection to the DRC and had never met Christian before arriving there months later. Instead, it appears that he was lured by the money. “I imagine he was asking people who would be more desperate,” Barbee said of Malanga’s solicitations. “Tyler was always looking to make a big bag.” According to multiple people, Malanga offered Thompson between $15,000 and $20,000 to act as a drone pilot during the attack. It wasn’t a life-changing number, but it might have felt that way to a then-20-year-old suffering from postgraduate malaise and still living with his parents. Later, some of Thompson’s friends would express surprise that, among all the offers Malanga made, he was the only one who said “yes.” He was too laid-back, they figured. But to others, especially those who remembered the pair squaring off at football practice, Thompson’s decision made sense. “I feel like it was a no-brainer,” said Cordova. “‘I’m out there with you,’ kind of like a blood-brother thing.”\nIn January 2024, Malanga’s mother kicked him out of the house and he briefly moved in with Thompson. She described the reason as a “private issue,” but from then on Malanga and Thompson continued their preparations largely in secret. They purchased firearms from a private seller and began practicing their marksmanship at shooting ranges. They also set about amassing a more significant arsenal. In March, Malanga flew to Los Angeles to purchase a DJI S1000 drone, an octocopter often used for professional cinematography, from a private dealer in Studio City. The drone had a payload capacity of around 15 pounds, which was important because a week later he purchased a flamethrower attachment to go with it. Billed by the manufacturer as “perfect for industrial, agricultural, and entertainment applications,” it was ostensibly to be used for clearing brush or hornet’s nests from a safe distance. But according to authorities, Malanga and Thompson intended to use it “to light people on fire.” Thompson also bought a smaller Mavic 2 drone that could be more easily piloted through urban environments as well as a release mechanism to drop a payload from the drone while in flight. “Behind me is something that I have been manifesting for an extremely long time, but I haven’t been able to afford it,” he said in a video featuring the drone. “But an opportunity to get access to one happened to fall into my lap.”\nA few weeks later, Malanga and Thompson visited Pete Moesser, an old friend of Christian’s who lived in a nearby suburb. It appears he had known about the coup plans since at least the previous fall when Christian messaged him to ask for assistance. “In the next month my team and I will be ready for change in DRC,” Christian wrote. “WHAT ARE YOU TALKING ABOUT? THE CONGO SPECIAL?” Moesser replied, in all caps. “Yes Pete the Congo special,” said Christian.\nMoesser allegedly helped Malanga and Thompson assemble the flamethrower drone, but it was his experience as a machinist that was most useful. Since communicating with Christian months earlier, he had been fabricating metal and plastic pipe bombs that could be dropped from drones using Thompson’s release mechanism. Moesser’s tests of the devices had apparently gone well; he already decided to add shrapnel to the plastic ones in order to increase their deadliness. Moesser agreed to ship the firing pins and pipes to Africa after Malanga had arrived there. All he and Thompson had to do was source the smokeless gunpowder needed to trigger the bombs when they hit the ground.\nOn April 10, Rebecca Higbee, Thompson’s mom, drove him and Malanga to the Salt Lake Airport where they stopped for a photo before departing. Squinting into the sun, Thompson gave the camera a thumbs up, Malanga a shaka; both are grinning with excitement. Thompson had told his parents that Christian was paying for his flights in exchange for help making aerial drone maps of some of Christian’s mining concessions. Thompson thought the gig might look good on his résumé. “I honestly thought it was going to be a great growing experience for him,” Higbee would later say. Carefully packaged among the pair’s luggage were two handguns and a commercial-grade flamethrower.\nAfter landing in Johannesburg, Malanga and Thompson spent two weeks visiting tourist sites in South Africa and Malanga’s extended family in Eswatini. It was, essentially, the trip that Thompson had described to his parents before leaving, albeit with training sessions at the shooting range and a trip to the local sporting-goods store to buy gunpowder thrown in. But when it came time to catch what should have been their return flight to Utah, the pair flew instead to Angola and paid a driver to bring them to the border with the DRC, where Christian was waiting to escort them to Kinshasa. In order to explain the change of plans, Thompson told his parents that he had come down with malaria and that Malanga’s father had agreed to extend the trip to make up for the time lost to illness. Apparently, they didn’t question his remarkable recovery or what exactly he planned on doing during his extended stay. They would later tell reporters that he never mentioned the DRC to them at all.\nThey, along with Zalman-Polun, settled in at Chez Momo 19, a nondescript guesthouse on the outskirts of Kinshasa. There, the foursome put the final touches on their assault on the Congolese government: where to land drones during the attack; how many security guards were stationed at the homes of their targets; how to find the president’s bedroom in the Palais de la Nation. On videos taken during nighttime reconnaissance outings, the group can be heard fantasizing about the chaos they are about to unleash: “Imagine that flamethrower coming right there,” one of them says as they drive past a group of security guards lingering outside the home of the country’s economic minister and a primary target of the coup. “We will come like this, then boom, we will start our operation,” says another as they case the home of the defense minister. When they were back at Chez Momo, Malanga and the others killed time trying on their gear and loading rounds of ammunition into AK-47 magazines.\nAround 1 a.m. the following morning, fantasy and reality collided. Christian had been working with a handful of co-conspirators, also members of the Congolese diaspora, to recruit militants to the cause, and the result was a bus’s worth of ragtag militia men and women from a single nearby village — some armed, others wearing flip-flops. It’s unclear how much they actually knew about what they were being asked to do. After Christian delivered an inspired speech about liberating the DRC from corruption, two of the villagers refused to take part and he violently assaulted them, allegedly stabbing one. In an effort to reassure the others, he claimed they had nothing to fear — America was backing the coup. The notion was reinforced by the appearance of Marcel and Thompson in their American-flag-emblazoned tactical gear.\nThings only got more shambolic from there. Sensing that something dangerous was underway, the bus driver who had delivered the militants to Kinshasa fled into the night, forcing Christian and one of his co-conspirators to hijack another bus from a nearby university. After loading his newfound militia onboard, Christian, who drove separately in a Toyota Highlander, led the group to a police post, where he stole multiple AK-47’s and assaulted a female officer. A few blocks later, he swerved across the road, blocking the path of a gray Land Rover driven by a random passerby. According to Thompson and others present in the Highlander, Christian rolled down his window and shot the man dead, instructing one of his captains to commandeer the vehicle. Supplied with fresh arms and transport, the convoy continued on to the defense minister’s home, only to discover that he was out for the night. They had more luck at the home of the economic minister, where they unleashed a hail of bullets, killing two guards and terrifying the minister’s wife and children, who were huddled inside. Thompson would later say that it was too dark that night to effectively fly the drones he had spent weeks learning to pilot. After security guards held off the incursion, Christian was forced to abandon the attack in favor of taking the Palais de la Nation, according to authorities.\nThey met little resistance at the front gates, and before long Christian was stalking the palace grounds shouting invectives against President Félix Tshisekedi as Zalman-Polun livestreamed the scene to Facebook. “We, the military, are tired,” Christian exclaimed into the camera. “We coming for you n- - - -!” But the triumphant moment didn’t last long. Moments after Marcel hit “record” on his own video selfie, someone off-camera cried out that they had been shot. Christian’s belief that the militants would be received as heroes turned out to be a dire miscalculation. According to Congolese prosecutors, around 5:15 a.m., DRC security services punctuated their arrival with a blast of heavy artillery that put an end to the 75-minute coup and Christian’s dream of a New Zaire. As troops overwhelmed the palace grounds, he could be heard desperately calling an unknown conspirator for reinforcements that never arrived. A short time later, he was shot dead. Photographs of his bullet-ridden body appeared on social media within hours.\nIn the confusion, Malanga, Thompson, and Zalman-Polun fled toward the banks of the Congo River, which lay just beyond the rear of the palace. On the opposite shore was the relative safety of Brazzaville, the capital city of the Republic of Congo, but the river’s surface masked fast-moving currents and crocodiles. Swimming across would be suicide. Instead, they crouched among the tall reeds and mud as the trigger-happy Congolese troops searching for them inched closer. According to a source who saw the clips after the fact, Malanga Snapchatted a friend back in Utah moments before he was captured. We fucked up, he said. Stuff’s going bad.\nFor the next three weeks, Malanga, Thompson, and Zalman-Polun were held incommunicado by military police while conspiracy theories about American involvement in the coup spread around the globe. Posters on X and TikTok accused them of being CIA or Mossad agents, a reasonable assumption under the circumstances. The U.S. had famously been involved in at least one covert coup in the country — the Cold War ousting and eventual murder of Patrice Lumumba, the Congo’s first elected prime minister — and had long been accused of meddling in the mineral-rich country’s affairs.\nTheir respective families could scarcely believe what they were hearing. Rebecca Higbee, Thompson’s mom, told a reporter that she found out about her son’s arrest that morning when Brittney Sawyer showed up on her doorstep. “I don’t know how to tell you this,” Higbee recalled her saying. “The boys were taken into custody. They’ve been beaten, and they’re being tortured.” Despite living under the same roof, Thompson’s mother would later say she had “no idea” of what he and Malanga were actually doing. Similar texts ping-ponged among friends and teammates, some of whom realized only then how close they had been to accepting Malanga’s offer and suffering the same fate. “The things I know about them as people and trying to imagine either of them doing this,” one told me. “Doesn’t make sense at all.”\nIn early June, the trio of Americans was seen alive and in public again for the first time when footage of them at a military tribunal aired on Congolese television. Their heads had been shaved. Alongside 48 militia members and employees at the Chez Momo guesthouse, they were charged with terrorism, murder, attempted assassination, and weapons offenses. These acts are punishable by death, the judge told them. Over the next three months, they made regular appearances at the open-air tribunal, which was held under a green tent in the courtyard of Kinshasa’s notorious Ndolo prison. During questioning, Thompson appeared shaken as a translator struggled to interpret the judge’s questions in English. His face was dotted with bruises and bumps, his answers punctuated by bouts of coughing. Both he and Malanga complained that they had been whipped and tortured by military police in the weeks after their arrest. In defense, all three Americans claimed that Christian had woken them up at gunpoint on the morning of the coup and told them to “do exactly as he said or we would be killed.” In contrast to their claims, however, were piles of evidence laid out on the ground before them — drones, military fatigues, automatic weapons. When asked how the court should account for the innocent lives that had been lost, Thompson was contrite. “That night is very sad,” he said. “And I wish I was not there to witness it.”\nMalanga seemed either unable to grasp the magnitude of the situation or to have already concluded that denial was useless. At various times throughout the proceedings, TV cameras caught him smiling, laughing, and making signs, presumably the letter M, with his fingers. When it was his turn to speak, he grew frustrated with the available translators and lied openly during questioning. When asked if he had ever fired a weapon, he said that he had only once at the age of 5. But even a cursory glance at Malanga’s social media showed that wasn’t true; a recent Instagram post taken at the shooting range was hashtagged “Train2K!ll.”\nOn September 13, the military tribunal found all three Americans and 34 of the other defendants guilty and sentenced them to death. (Fourteen defendants, which included the minibus driver and hotel staff, were found not guilty.) The question of why Christian believed he could overthrow the government of a country of more than 100 million people with only 40 or so combatants was never addressed, though rumors persist that he was promised support from someone within the Congolese government only to be abandoned at the decisive moment. “There may have been double-dealing on both sides,” said Dino Mahtani, a former U.N. officer who worked in the Congo for years and is familiar with the country’s high level of political gamesmanship. “Someone says, ‘We can stage a coup to send Tshisekedi a message … and then tells the president, ‘I’ve got wind of a coup and I can help you stop it.’” Malanga placed his father’s efforts in more spiritual terms. “He was very fascinated with David versus Goliath,” he said. Malanga’s attorney appealed the verdict, but in January of this year that appeal was denied.\nA few weeks later, the Rwandan-backed militia known as M23 invaded the eastern Congolese city of Goma, unleashing a torrent of bloodshed. According to U.N. estimates, upwards of 3,000 people were killed during the initial fighting and hundreds of thousands more were displaced. For Malanga, Thompson, and Zalman-Polun, the violence was a lifeline.\nIn the wake of M23’s advances, Tshisekedi reached out to the Trump administration with an offer similar to the deal the U.S. recently struck in Ukraine: exclusive access to the DRC’s coveted mineral deposits in exchange for security guarantees. Almost immediately, the trio appears to have figured into the negotiations. In an X post, Adam Boehler, the U.S. special envoy for hostages, questioned whether or not holding three Americans in prison disqualified the DRC from American support. “Perhaps it would be better if Rwanda won the war?” wrote Boehler. Soon after, their sentences were commuted from the death penalty to life imprisonment.\nBack in West Jordan, however, something unexpected was also developing. Subpoenas had started arriving in the mail of friends and former teammates requiring them to testify at the federal courthouse in Salt Lake City. At first, no one could quite figure why. “We heard nothing, radio silence, until probably a month ago,” one former teammate told me recently. “And we started getting hit with subpoenas and FBI agents were showing up at our houses and telling us we had to go to court and we’re like, ‘It’s been nothing for six months. What the hell’s going on? Why is this happening now?’”\nThe answer arrived in early April, when news broke that Malanga, Thompson, and Zalman-Polun were being “evacuated to the United States to serve their sentences,” according to Tshisekedi’s spokesperson. The move was widely regarded as a sign of good faith in the lead-up to talks regarding the minerals deal. But whatever relief their families may have felt at the trio’s repatriation was short-lived. Upon arriving in the U.S., the Department of Justice charged each of them, as well as Pete Moesser, the alleged bomb-maker, with a raft of crimes, including conspiracy to use weapons of mass destruction, bomb government facilities, and murder and kidnap persons in a foreign country. All four have since pleaded not guilty. Only Thompson’s attorney responded to a request for comment, stating that “Tyler has maintained his innocence since his arrest, throughout both the proceedings in the DRC and those pending here in the United States.” If convicted, they face spending the rest of their lives in prison.\nRecently, Malanga called me from the Weber County Correctional Facility in Utah, where he, Thompson, and Zalman-Polun are being held while awaiting trial. “I’m doing good,” he told me, when I asked how he was settling in. “Alive, healthy.” I noted an unexpected buoyancy in his voice, which I put down to the change in scenery. The facility is less than an hour’s drive from where he and Thompson grew up and a world away from the harsh conditions at Ndolo. Malanga was still trying to run Kooboyz LLC from behind bars, he told me, and he and Thompson, who see each other occasionally in lockup, are still close. “I consider him a brother,” Malanga said. “This hasn’t affected us at all.” (Thompson and Zalman-Polun did not respond to repeated requests for an interview.)\nBut the real reason Malanga called, he explained, was not to talk about himself but about the state of affairs in the DRC. “I shouldn’t be a headline because I’m American,” he told me. “There’s things that are bigger than myself, and hundreds of millions of people suffering is one of them.” He hoped that this article might bring attention to their plight. “We’re in the 21st century, and they’re torturing people still,” he said, noting his personal experience in the military prison. “There’s famine and there’s genocide over there.” He implored me to “enlighten the reader,” as he put it.\nIt was clear that despite the charges looming over him, Malanga’s allegiance to the cause of New Zaire hadn’t waned. Nor had his devotion to Christian. “I think of him as a great man,” he said. “He gave his life to fight for something. I don’t think most people in this world can say that.” When I asked how he would respond to those people who had written him off as a foolish 22-year-old acting in the thrall of his father, he was dismissive. “It’s bigger than me, it’s bigger than us — me, Tyler, Benjamin, my father, the individuals that are arrested over there,” he said, growing passionate. “It’s the story of my country and my people.” Like Marlow, the protagonist of Joseph Conrad’s Congo-set novel Heart of Darkness, who declares that he should be “loyal to the nightmare of my choice,” Malanga appears to have doubled down on the decisions that took him from the suburbs of Salt Lake City to the presidential palace in Kinshasa, even as those decisions transformed him from star athlete to alleged terrorist and mercenary. “They thought Isaac Newton was crazy for what he believed in, and they thought Galileo was insane for what he believed in, and they thought Elon Musk was crazy for what he believed in,” he said.\nToward the end of our conversation, I asked Malanga if he could remember the exact moment when he had decided to join his father in the Congo. Was there a particular conversation with Christian that had inspired him? At first, he declined to answer, ostensibly because of how his response might affect the upcoming case. But just before we were cut off by the jail’s collect-call service, he offered a simple reply: “I just went to go see my dad,” he told me. “To visit my father and to see where my blood comes from.”",
  "word_count": 5800,
  "scraped_at": "2026-02-14T13:01:52.915206"
}