{
  "article_id": "26bceda0d727",
  "url": "https://www.burntorangenation.com/2024/3/1/24088161/longhorns-daily-news-texas-steve-sarkisian-quinn-ewers-arch-manning-sec-2024-big-12-ncaa-tournament",
  "title": "Longhorns Daily News : Texa Steve Sarkisian : Team is  fortunate  to have QBs Quinn Ewers , Arch Manning",
  "date": "20240302T040000Z",
  "domain": "burntorangenation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Texas Longhorns head coach Steve Sarkisian recently broke down why the program is fortunate to have a quarterback roster including both Quinn Ewers and Arch Manning.\nLonghorns Daily News: Texas’ Steve Sarkisian: Team is ‘fortunate’ to have QBs Quinn Ewers, Arch Manning\nPlus: Texas women’s athletics is back at it this weekend\nThat’s according to Inside Texas.\nNotably, Ewers is the returning starter. Manning will be backup in 2024.\nSarkisian on Ewers: “I think for Quinn, having one more season of starting, getting his start number up into the thirties as a bona fide starter, being the leader of a team, continuing to mature, staying healthy, and things of that nature [will help.]”\nSarkisian on Manning: “For Arch, what a great opportunity as a back up now this year in his second season. ... Going to get some definite playing time, and we’re looking forward to him doing that, watching his maturation and growth.”\nSarkisian later added, “We’re fortunate. I’ve never been anywhere where we haven’t had quarterbacks. We’re fortunate to have those two guys right now as guys who can go out and lead our offense and lead our team.”\nWHAT THEY’RE SAYING ABOUT THE LONGHORNS\nAssociated Press: T’Vondre Sweat leads group of big-guy NFL prospects hoping to prove their worth\nAustin American-Statesman: NCAA close to adopting college football helmet communication: Report\nAustin American-Statesman: Golden: Texas baseball right to take cautious approach for Tanner Witt\n247Sports: Challenging stretch of games for No. 15 Texas continues with tough bouts at Minute Maid Park\n247Sports: 2024 Texas Position Inventory: Tight End\nInside Texas: Steve Sarkisian explains why his team is “fortunate” to have both Quinn Ewers and Arch Manning\nICYMI IN BURNT ORANGE NATION\nRECRUITING ROUNDUP\n247Sports: 247Sports No. 1 2026 prospect in QB Jared Curtis ready for spring visits\n247Sports: Top247 DL Ethan Utley locks in his commitment date\n247Sports: Hitchcock Top247 ATH Kelshaun Johnson locks in four official visits, previews spring trips to Texas\n247Sports: Inside the top six schools of Top247 2025 CB Cobey Sellers\nInside Texas: Update on 2025 four-star LB Elijah Barnes with Texas making his Top 10\nBIG 12 BREAKDOWN\nAustin American-Statesman: Big 12 women’s basketball power rankings: The fight for seeding begins\nAustin American-Statesman: As Texas preps for the postseason, Shaylee Gonzalez reunites with BYU\nAustin American-Statesman: Bohls: Freshman or no freshman, Texas’ Booker is Big 12’s top player\n247Sports: With March now here, Texas’ fight for its NCAA Tournament life turns to Oklahoma State in Austin on Saturday\nFrogs O’ War: Football: TCU running back Corey Wren enters transfer portal\nWide Right & Natty Lite: Men’s Basketball Preview: We’re talkin’ UCF\nBring On The Cats: Kansas State Football: Khalid Duke combine performance\nWHAT WE’RE READING\nSB Nation: NFL Draft Combine’s best quotes and stories so far from Caleb Williams, Rome Odunze, and more\nSB Nation: Patrick Mahomes’ 40 time at combine is still getting him roasted by the NFL\nSB Nation: Victor Wembanyama is leveling up at a terrifying rate for Spurs\nNEWS ACROSS LONGHORN NATION AND BEYOND\n- Texas women’s basketball takes on BYU tomorrow at 7pm Central.\n- Texas softball’s Longhorn Invitational performance is already off to a hot start.",
  "word_count": 529,
  "scraped_at": "2026-02-14T13:11:09.841039"
}