{
  "article_id": "26d1d4a49813",
  "url": "https://www.bbc.co.uk/sport/football/66607749",
  "title": "Mary Earps: Nike will sell 'limited quantities' of England World Cup goalkeeper shirts",
  "date": "2023-08-24T14:08:59.000Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_bbc",
  "body_text": "Mary Earps: Nike will sell 'limited quantities' of England World Cup goalkeeper shirts\n- Published\nEngland fans will be able to buy Mary Earps replica goalkeeper shirts after Nike said \"limited quantities\" would go on sale.\nThe sportswear brand has faced criticism in recent weeks, with Earps expressing dismay the jerseys would not be made commercially available.\nMore than 150,000 people signed a petition asking Nike to sell the tops.\nIn a statement, Nike said it had now \"secured limited quantities of goalkeeper jerseys to be sold\".\nEarps, who helped England reach Sunday's Women's World Cup final and won the Golden Glove award as the tournament's outstanding goalkeeper, made her criticism known last month.\nShe said it was \"hugely disappointing and very hurtful\" that fans would be able to buy outfield player shirts but not an England goalkeeper's kit.\nOn Thursday, Nike confirmed its U-turn and acknowledged it failed to respond quickly enough to public demand during the tournament.\nIt said: \"We've seen and share the unprecedented passion and interest in women's football this year and remain committed to playing our part by offering the best products and services to athletes and fans. We invested more in this year's World Cup than any other global tournament to date.\n\"Nike has secured limited quantities of goalkeeper jerseys for England, US, France, and the Netherlands to be sold through the federation websites over the coming days, and we are also in conversations with our other federation partners.\n\"We recognise that during the tournament we didn't serve those fans who wished to show their passion and support to the squad's goalkeepers. We are committed to retailing women's goalkeeping jerseys for major tournaments in the future.\"\nThe popular online petition was started on 21 July by 16-year-old football fan Emmy, who said she wanted to be able to \"respect\" the players who have changed the perspective of women's football.\nNike had said on Sunday it was \"working towards solutions for future tournaments\".\nEarps responded to that statement on Instagram by writing: \"Is this your version of an apology/taking accountability/a powerful statement of intent?\"\nEngland were beaten 1-0 by Spain in the final, but Earps saved a penalty, underlining her impressive display across the tournament.\nReplicas of Earps' adidas kit with Manchester United, her club in the Women's Super League, sold out last season.\nIt was reported that producing new women's goalkeeper kits for the public was not part of Nike's commercial strategy., external\nA replica of the men's England goalkeeper shirt is not available on the England Store but is available with other outlets.",
  "word_count": 430,
  "scraped_at": "2026-02-14T11:17:44.581980"
}