{
  "article_id": "27256c373604",
  "url": "https://mwnation.com/temwa-closes-in-on-golden-boot-in-us/",
  "title": "Temwa closes in on golden boot in US - Nation Online",
  "date": "20251013T070000Z",
  "domain": "mwnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Temwa closes in on golden boot in US\nUS-based Malawian women’s football star Temwa Chawinga is now within touching distance of retaining the Golden Boot Award after taking her tally to 15 goals in the National Women’s Soccer League (NWSL).\nThe prolific forward stepped off the bench to score the second goal for her side Kansas City Current when they beat Gotham FC 2-0 yesterday.\nShe now leads the race for top scorer award by two goals as her contender, Gotham FC’s Esther Gonzalez, remains on 13 goals with only two rounds of matches remaining in normal season.\nTemwa, who missed the previous match due to a knee injury, is five goals short of equaling the 20-goal record she set in her debut season last year.\nFollowing the win, KC Current have 62 points from 24 matches, 18 points above second-placed Washington Spirit.\nAccording to the club’s website kansascity.com, Bia Zaneratto opened the scoring in the 34th minute\nShe then turned provider in the 51st minute when she set up Chawinga six minutes into the second half.\nThe Scorchers forward sneaked her shot underneath Gotham goalkeeper Shelby Hogan, according to the report.\n“I played with Bia in China. She knows my runs [and] where to put the ball. I was coming from [off the] bench, so my job was to score a goal and I’m happy I scored,” Temwa was quoted as having said after the match.\nFollowing the triumph, KC Current became the first team in NWSL’s history to win 20 league matches in a season.\nKC Current coach Vlatko Andonovski hailed his charges for the feat, saying: “Lots of credit goes to the players.\n“They are the actors, they are the ones that get things done on the field. But there’s so much work that is done behind the scenes. There is a big group of of people that are working day in and day out.”",
  "word_count": 318,
  "scraped_at": "2026-02-14T12:13:17.750607"
}