{
  "article_id": "2755be2f4d38",
  "url": "https://fair.org/home/nyt-less-interested-than-ever-in-trans-perspectives-on-trans-issues/",
  "title": "NYT Less Interested Than Ever in Trans Perspectives on Trans Issues",
  "date": "20250714T221500Z",
  "domain": "fair.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In recent years, transgender Americans have seen an exponentially growing assault on their rights.\nIn the first half of 2025 alone, 942 anti-trans bills have been introduced throughout the country—more than were introduced in all of 2024—and since taking office, President Donald Trump has signed no fewer than 12 anti-trans executive orders.\nIt’s an attack that the New York Times editorial board called “Trump’s Shameful Campaign Against Transgender Americans” (2/9/25). The editorial explained that the attacks seek\nto exclude transgender people from nearly every aspect of American public life: denying them accurate identification documents such as passports, imposing a nationwide restriction on gender-affirming medical care for transgender youths, investigating schools with gender-neutral bathrooms, criminalizing teacher support for transgender students and commanding the Federal Bureau of Prisons to force the estimated 1,500 transgender women in custody to be housed with men.\nBut the irony of the Times‘ condemnation of transphobia was not lost on those familiar with the paper’s history of biased, sensationalistic coverage of trans issues. As transgender journalist and media critic Erin Reed (Erin in the Morning, 2/9/25) put it, “The New York Times does not get to erase its role in how we got here.”\nFollow-up study\nFor years, media journalists and critics, including here at FAIR, have called out the Times’ pattern of platforming transphobes before trans people, spreading dangerous misinformation and framing trans rights as up for debate (FAIR.org, 5/19/23, 8/30/23, 5/28/24).\nA 2023 FAIR study (5/11/23) found that in a year of front-page coverage of trans issues, rather than centering the growing assault on the trans community and its impact on that community, the Times largely focused on whether “trans people are receiving too many rights, and accessing too much medical care, too quickly.”\nFAIR conducted a follow-up study looking at the Times’ front-page stories between February 2024 and January 2025. This time we found slightly more coverage, but even fewer trans voices. Even while feigning concern, the paper of record remains largely uninterested in centering trans people and perspectives in coverage of trans issues, while failing to challenge misleading and transphobic right-wing narratives.\nGrowing frequency, changing subject matter\nFAIR found that the New York Times‘ front page featured stories about trans issues 13 times, with an additional 49 pieces that mentioned the word “transgender.” It’s a small increase from the 2023 study, which found nine trans-centered stories and 30 pieces that mentioned but did not center trans issues.\nIt’s still far less coverage than the paper’s national competitor, the Washington Post, gave trans issues in the 2023 study: 22 front-page stories and 54 front-page story mentions.\nFAIR also found a sharp drop in the Times’ use of trans sources, from 19% in the previous period to 11% (14 sources). Where in the last study, each of the nine front-page articles quoted at least one trans source, our new study found three of the Times‘ 13 pieces, or 23%, lacking any trans or nonbinary person’s perspective.\nOnce again, most of the Times‘ front-page stories about trans issues were not centered on trans people and the issues they face, but on trans people as a problem for cisgender people—whether athletes (“Volleyball Team in Grip of Fierce Debate on Transgender Rights”—11/29/24) or politicians (“Debating Role of Trans Rights in Harris’s Loss”— 11/21/24).\nIn the last study, six of the nine front-page articles questioned gender-affirming care or pitted trans rights against the rights of others (such as parents or cis women). A year later, those themes are still prominent (four articles), while the paper’s attention to trans issues in the political arena increased, from one article to eight. Yet despite the increased attention—which followed the escalating right-wing anti-trans campaign that took trans rights to the Supreme Court and the center of the 2024 presidential campaign—the paper’s framing still repeatedly adopts or fails to challenge right-wing narratives.\nThis year, FAIR counted sources that advanced misinformation about trans issues that went unchallenged in the story, such as those that claimed that gender-affirming care is ineffective, experimental or risky, or that used anti-trans talking points that the Times failed to present without critical context. Such sources generalized gender-affirming care as irreversible, exaggerated detransition rates, or claimed that trans women hold a wholesale advantage in women’s sports. Fourteen sources (11%) were in this category—equal to the number of trans people who appeared as sources.\nFAIR also found that nine sources (7%) had undisclosed anti-trans backgrounds—lending credence to these sources’ authority on trans issues by concealing their prior anti-trans advocacy or rhetoric. Of these sources, two were allowed to spread misinformation without challenge.\nThe front-page articles all fell into one of three broad themes: gender-affirming medical care and related court battles (five articles), non-court politics (five articles) and sports and culture (three articles).\nQuestioning ‘gender drugs’\nThe New York Times put five pieces covering gender-affirming care for minors on its front page: three covering related court battles in the US and two questioning its efficacy. These five pieces accounted for more than half of the cases of unchallenged misinformation (9)—painting gender-affirming care as risky, experimental and ineffective—and of obscured anti-trans backgrounds (5). Combined, these five pieces had only four trans sources.\nThe three pieces covering court battles focused largely on the legal technicalities of whether bans on care constitute sex discrimination, rather than how these bans would impact trans minors, adults and their families. They overwhelmingly quoted judges and lawyers, marginalizing the voices of trans people and their families, and leaving unchallenged the premises that care is “experimental” (12/4/24, 12/5/24) and poses “significant risks with unproven benefits” (12/4/24).\nTwo of the court-related articles followed the Supreme Court’s decision to uphold a ban on care for minors in Tennessee (12/4/24, 12/5/24); both quoted Chase B. Strangio, the trans ACLU lawyer representing the families in the case, in his oral arguments, but quoted no other trans people or advocates speaking to how these bans could impact trans people and their families. (The first also quoted a line from the families’ legal argument about parental rights.)\nBoth of the pieces questioning care for minors were written by Azeen Ghorayshi, a Times science reporter who has previously been criticized for misreporting the experiences of trans minors and their families, misrepresenting study findings, and promoting unsubstantiated claims that contributed in part to the closure of a St. Louis youth gender clinic. Ghorayshi’s two front-page pieces reveal continued misrepresentation and lack of trans perspectives.\nThe first was “Britain Limits Gender Drugs for Children” (4/10/24), which recapped the NHS-commissioned Cass Review, while also promoting misinformation pertaining to the safety and efficacy of gender-affirming care. (This article contained four pieces of unchallenged misinformation, the most of any in our study period, and only included one trans source.)\nThe article eagerly accepted the authority of “independent pediatrician” Dr. Hilary Cass in her finding that “for most young people, a medical pathway will not be the best way to manage their gender-related distress.” Not only did the piece fail to mention that this claim is disputed by the leading world health authorities and every major medical association in the US, it also omitted that Cass had no prior experience or expertise in working with trans patients, nor did most of her named contributors.\nThe only challenge Ghorayshi presented to the review, which is littered with serious methodological flaws, was unrelated to the quality of Cass’s research or her lack of credentials. Instead, she mentioned that transgender advocacy groups in Europe have condemned legislative changes informed by Cass’s findings, before quickly describing these changes as “notably different from the outright bans for adolescents passed in 22 US states.” (Ghorayshi didn’t note that Cass contributed to a similarly politically motivated report in Florida, which was used to justify the state’s ban on care.)\n‘Unpublished because of politics’\nThe second piece, “Doctor, Fearing Outrage, Slows a Gender Study” (10/24/24), and its web version, “US Study on Puberty Blockers Goes Unpublished Because of Politics, Doctor Says” (10/23/24), insinuate that researcher Dr. Johanna Olson-Kennedy might have withheld study data because it undermined her pro-gender-affirming care agenda.\nThough the print version reached nearly 1500 words, it only quoted three sources, none of which are trans: Olson-Kennedy, who has specialized in the treatment of trans children and adolescents for close to two decades, another researcher critical of her decision to delay publication, and Hilary Cass.\nThe piece’s central implication is that, because “puberty blockers did not lead to mental health improvements” in the unpublished study data, this undermines the case for gender-affirming care.\nBut puberty blockers are not prescribed to “improve” mental health—as described by an Erin in the Morning (10/23/24) factcheck, they’re intended to “prevent deleterious effects of puberty.” Puberty blockers give trans kids and their families time to weigh their options and avoid poor mental health outcomes—so the way to know whether puberty blockers are effective is to compare those with dysphoria who receive them with those that do not. Olson-Kennedy’s study does not have a control group; therefore, she is concerned that her longitudinal data, which show neither increase nor decrease on average in mental health, would be misused to suggest that puberty blockers are ineffective—which is exactly what Ghorayshi’s article does.\n“I do not want our work to be weaponized,” Olson-Kennedy is quoted in the article. And indeed, thanks to the New York Times, it has been: Senate Republicans soon launched an inquiry (12/5/24) into the study, heavily citing the Times article, and linking the release of study data to Britain’s restriction on gender-affirming care.\n‘Tapping into fears’\nFive articles were related to right-wing political attacks on trans rights, a noticeable increase from the previous study period (which ran one such article). But the increase does not reflect an improvement in coverage. Rather than looking at the impacts on trans people, the Times framed the issue primarily as a political football.\nFor instance, the paper published two front-page pieces on the role of trans rights in the presidential election: “Anti-Trans Ads Become Focus for the GOP” (10/9/24) and “Debating Role of Trans Rights in Harris’s Loss” (11/21/24). Each included just one trans source, and also included two guests who had their anti-trans perspectives obscured, along with two pieces of unchallenged misinformation about the biological advantages of trans girls in sports.\nThese pieces were much more interested in evaluating the political effectiveness of scapegoating as a campaign strategy than they were with the bigotry of the approach or the dangerous implications for the scapegoated minority in question.\nNational political correspondent Shane Goldmacher led with an explanation that Republican candidates are “tapping into fears about transgender women and girls in sports and about taxpayer-funded gender transitions in prisons.” That frames such “fears” as natural, pre-existing phenomena, rather than a political phenomenon that the GOP worked tirelessly to promote—and that the Times, with such coverage, is abetting.\nGoldmacher continued:\nMost of the Republican ads do not criticize the transgender community in general. Instead, they zero in on specific wedge cases, such as transgender women and girls in sports, transgender women’s sharing of locker rooms, the use of taxpayer funds for gender-affirming surgery for people in prison and access to transition services for minors, such as puberty blockers.\nYes, trans kids, adolescents and incarcerated people receiving gender-affirming healthcare make up a tiny proportion of the population, and transgender girls in athletics make up a negligible sum at the K-12 and collegiate levels; but how do attacks on trans people receiving healthcare and trans children participating in extracurricular activities not constitute an attack on the “transgender community in general”?\n‘Trans rights in Harris’s loss’\nIn the post-election piece by reporters Adam Nagourney and Nicholas Nehamas—whose web headline was “Harris Loss Has Democrats Fighting Over How to Talk About Transgender Rights”—the central question was again around political strategy: “Republicans clearly see a political opportunity,” they wrote, while for Democrats, “the question of how the party deals with transgender rights has emerged as a challenge for the years ahead.”\nIn this narrative, the protagonists are Democrats facing the “challenge” of trans rights; the much more consequential challenge—that of the existential attack by Republicans on trans people—is presented as an afterthought, wedged into two paragraphs at the very end of their lengthy piece: “Activists and others who work with transgender people, particularly transgender youths, say the political debate has resulted in a spike in reports of cyberbullying, online harassment and family tensions.” Nagourney and Nehamas followed this with a quote from Jaymes Black, CEO of the Trevor Project, about the “surge of calls to [the Trevor Project] crisis line.”\nThe paper also published two separate front-page articles covering transphobia at a Manhattan school board: “Spraying Vitriol, Parents in New York Clash Over What’s Taught” (4/5/24) and “A Culture-War Battle Roils a School Panel in Liberal Manhattan” (12/3/24).\nBoth pieces largely focused on arguments among parents, teachers and school officials, entirely omitting trans kids’ perspectives and including only one trans adult perspective (in the April 2024 piece). Both articles briefly quoted students expressing their concerns that enabling adult school board bullies to harass trans kids puts the “safety of the ‘most vulnerable students…at stake,’” but these students were afforded much less room to express their opinions than school board bullies themselves.\nScrutinizing trans advocates, not transphobes\nThe one politics piece that centered trans people, “Trans Activists Question Tack Amid Backlash” (11/27/24), incredibly made the case that trans activists are the ones who ought to be under scrutiny at this political moment. It quoted more trans people (3) and advocates (3) combined than any other front-page article, but managed to present them in a way that raised outcry among the trans community (Erin in the Morning, 11/26/24).\n“To get on the wrong side of transgender activists is often to endure their unsparing criticism,” the piece by Jeremy Peters began, and went on to describe criticisms and protests of public figures, including author J.K. Rowling, a notorious anti-trans activist, and Rep. Seth Moulton (D-Mass.), the most prominent Democrat to suggest retreating from trans rights after Democrats’ election losses. “Now, some activists say it is time to rethink and recalibrate their confrontational ways,” Peters wrote, “and are pushing back against the more all-or-nothing voices in their coalition.”\nPeters characterized Rowling—the billionaire author–turned–transphobic activist, who recently founded a “women’s fund” entirely dedicated to funding anti-trans court battles—as simply saying “that denying any relationship between sex and biology was ‘deeply misogynistic and regressive.’” He was less generous with transgender activists, whom he criticized as sounding “too judgmental,” “dogmatic and intolerant” and “unreasonable.” For what, exactly? Peters pointed to social media activists who “police language,” insist “that everyone declare whether they prefer to be referred to as he, she or other pronouns,” and “put pressure on liberal candidates for office to take positions that align with theirs.”\nPeters’ headline thesis (published on the web as “Transgender Activists Question the Movement’s Confrontational Approach”) hinged on exactly two trans sources. One of them, Rodrigo Heng-Lehtinen, then–executive director of Advocates for Transgender Equality, released a statement disputing the Times‘ account:\nYesterday, [the] New York Times ran an article in which I was quoted as saying, “We have to make it OK for someone to change their minds,” and “We cannot vilify them for not being on our side. No one wants to join that team.” Because my quotes were taken out of context, I’d like to clarify what I meant. Those statements were regarding how to persuade every day, undecided people in the public, not people who have already taken actions to oppose our equality.\nIn advising trans people to concede to bad faith arguments about how advocates are too aggressive in demanding respect, the Times prioritizes those harmed in fictitious hypotheticals over trans people harmed by transphobic narratives in real life. The piece at least includes one source who seems to understand this: Gillian Branstetter of the ACLU, who explained that such arguments attempting to “scapegoat” trans people are built upon a “fundamental unfairness.” They come, she said, from people who are not “interested in compromise and open debate.”\nFor the most part, however, the piece was much more concerned with the fundamental unfairness of making people “put pronouns in their email signature” than of limiting the rights of gender and sexual minorities.\nTrans women (who aren’t) in women’s sports\nThe two sports-focused articles continued the Times‘ pattern from last year of questioning the “fairness” of trans girls competing in girls’ sports; a third culture piece focused on religion.\n“Olympic Officials Try to Quell Fury Over Fairness” (8/3/24) included no transgender sources or anti-trans misinformation—or, for that matter, a single trans subject. Instead, the piece focused on the transvestigation of Olympic boxers Imane Khelif and Lin Yu-Ting, describing it as a “swirling controversy” that sparked a “fierce debate about biology, gender and fairness in women’s sports”—without connecting the overtly “political” speculation to a broader trend of rising transphobia.\nIt even obscured far-right, anti-LGBTQ Italian Prime Minister Giorgia Meloni’s role in promoting claims that the boxers might be intersex or trans—she’d said of Khelif, “Athletes who have male genetic characteristics should not be admitted to women’s competitions” (Fox News, 8/1/24). Her opinion was reduced to her statement that the boxing match “did not seem on equal footing.”\n“Volleyball Team in Grip of Fierce Debate on Transgender Rights” (11/29/24) described the “complicated mess” confronting the women’s team at San Jose State University, where, after a right-wing website outed a trans player, a co-captain and assistant coach sued the team for allowing her to play. The article didn’t attempt to combat the co-captain’s smears that the player is a “man” or her lawyer’s claim that college administrators “‘have willfully neglected their duty’ to keep sports safe and fair” by allowing trans women to play on women’s teams—though it did mention multiple times that she is not “‘the best or most dominant hitter’” on her team, nor does she “lead any statistical category in her conference.”\n(While research is limited on trans athletes’ biological advantages, analysis of existing literature comparing the physical capabilities of cis and trans women non-athletes finds that physical performance begins approaching that of cisgender women at at least two years of hormone-replacement treatments, and that there is a lack of evidence for a wholesale advantage for trans women athletes. Meanwhile, there are numerous benefits of allowing trans adolescents to play with their friends.)\nInstead, while reporting the assistant coach’s claim that “she hits and blocks like a dude,” the piece sought its middle ground in the recognition that the player was also being dehumanized. The impression that readers were left with was that her participation may be unfair (though, again, she doesn’t have any advantage over her teammates), but that nonetheless, “she’s being targeted” by a “mob mentality.”\nThis point of analysis is not unwelcome—but doesn’t address the false premise that including a trans player somehow undermines the fairness of the whole game.\nIt also reinforced the false notion that the inclusion of trans athletes is a pressing issue in women’s sports, calling it “one of the most explosive issues in American life,” when in fact transgender college athletes are a negligible statistic: In December 2024, President Charlie Baker of the National Collegiate Athletic Association testified to a senate panel that of over 500,000 total college athletes, he believes that fewer than 10 are trans.\nIt’s clear that in coverage of transphobic harassment campaigns, the Times has outrage to spare for the act of bullying itself: just not a critical analysis of the transphobia underpinning it.\nMeanwhile, “Some Christians Seek Truce in the Gender Wars” (5/18/24), by religion reporter Ruth Graham, focused on how some conservative Christian families are working to accept their trans children and offered perhaps the paper’s most nuanced front-page reporting on trans issues. It included three trans sources, one trans-allied advocate source and one allied family-member; it also quoted three transphobes and did not obfuscate their anti-trans positions.\nThe article included one piece of unchallenged misinformation, paraphrasing otherwise trans-sympathetic Colorado psychologist Julia Sadusky in her fears about “irreversible medical interventions” being administered to trans patients.\nSuch interventions are, in fact, exceedingly rare, and often deliberately mischaracterized—a small number of young teens are treated with hormone blockers, which are entirely reversible. Some older teens might undergo hormone treatments, which can cause more permanent changes, with the strict guidance of a medical team and parental consent. Vanishingly few trans minors receive surgical interventions.\nLacking analysis of transphobia\nNone of this is to say that the Times’ coverage hasn’t improved in some ways since 2023. This time around, FAIR found an absence of detransitioners, who in the previous study received disproportionate coverage that created a misleading picture of detransition rates.\nFAIR also found that perspectives of family members of trans people were included for very different reasons from the 2023 study. While family members in the 2023 study largely served to cast doubt on the efficacy of gender-affirming care and the reality of gender-diverse experience, this time around, family members acted as advocates for their trans relatives’ interests.\nHowever, for the most part, both quantitative and qualitative analysis finds that while the Times is aware of the outsized scrutiny that trans people received leading up to the 2024 election, the paper of record remains largely uninterested in critical coverage of transphobic scapegoating. Instead of affording trans people space to discuss how scapegoating is detrimental, especially to those most vulnerable (like trans children and their families), the Times seems much more concerned with civility and bothsidesism.\nNote: The study looked at articles from the New York Times‘ print edition, as archived on the Nexis news database. The dates cited are the print dates, though the links naturally go to the online edition, typically dated a day earlier and given a different headline.",
  "word_count": 3619,
  "scraped_at": "2026-02-14T12:12:45.130067"
}