{
  "article_id": "275e8ba5ce98",
  "url": "https://www.thedrinksbusiness.com/2024/08/arsenal-signs-chivas-regal/",
  "title": "Arsenal signs Chivas Regal",
  "date": "20240815T094500Z",
  "domain": "thedrinksbusiness.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Arsenal signs Chivas Regal\nWith transfer deadline day two weeks away, Arsenal has announced a multi-year partnership with Pernod Ricard-owned Scotch whisky brand Chivas Regal.\nArsenal fans may be calling for the North London club to sign a striker after just missing out on the Premier League trophy last season, but they may be sated by the signing of an Official Whisky Partner.\nChivas Regal will be supporting both the men’s and women’s football teams.\n“It’s a brand renowned for its cultural and community ties, and they share an always forward mindset that is so important to our club values and ambition,” claimed Arsenal chief commercial officer Juliet Slot.\nPartner Content\n“Our partnership with Arsenal goes beyond whisky and football; it’s about unlocking a new layer of football culture for fans, both here in the UK and across the globe – extending the experience of the beautiful game we all love far beyond the pitch,” said Chivas global marketing director Nick Blacknell. “The partnership will stay true to our history in culture and community and reinforce our commitment to bringing elevated luxury experiences to fans across the world.”\nAmong the features of the partnership is a new Chivas Regal bar within Dial Square at the Emirates Stadium, which will be serving Chivas Highballs.\nThe whisky brand has also collaborated with a number of local pubs frequented by Arsenal supporters. Chivas Regal will be giving away rounds of Chivas Highballs to fans ahead of Arsenal’s first Premier League fixture (against Wolves on Saturday 17 August), and the first Women’s Super League match (against Manchester City on Sunday 22 September).\nRelated news\nCarlsberg return could turn Liverpool football shirt into a classic\nRamón Bilbao becomes official partner of Spain's national football teams\nCamden Town Brewery kicks off partnership with Rugby Football Club",
  "word_count": 300,
  "scraped_at": "2026-02-14T13:15:58.163262"
}