{
  "article_id": "27735cf49af9",
  "url": "https://punchng.com/i-have-no-issues-with-gift-madugu/",
  "title": "Coach Madugu clarifies Gift Monday Super Falcons omission",
  "date": "20251027T030000Z",
  "domain": "punchng.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Nigeria women’s national team head coach, Justine Madugu, has dismissed speculation of a fallout with forward Gift Monday, clarifying that her omission from the Super Falcons’ latest squad was purely tactical and not disciplinary, PUNCH Sports Extra reports.\nThe coach was reacting to discussions surrounding the absence of Monday and Spain-based striker Edna Imade from the team’s roster for the 2026 Women’s Africa Cup of Nations qualifiers against the Benin Republic.\nMadugu made it clear that there was no personal disagreement between him and Monday, who currently plays for the Washington Spirit in the United States.\n“I have no issues at all with Gift,” he said in an interview with Nigeria Football.\n“She is very much part of my plans and will surely play her part in our quest for global success. But right now, there is strong competition for the forward position considering the form of players like Esther Okoronkwo, Chiwendu Ihezuo, and Joy Omewa, who have all been excellent.”\nMadugu praised Omewa’s consistency, highlighting her scoring record with Danish club Fortuna Hjørring as one of the factors behind his current selection choices.\n“Omewa has already scored in eight consecutive matches this season, including in the Champions League.\n“I have no plans to shortchange anyone. We must always select the best players available. Gift will definitely be given a look-in during the next camp, where we can assess her performance properly,” he said.\nMonday’s last involvement with the Super Falcons was in October 2024, when the Super Falcons faced Algeria in a two-legged friendly. She scored a goal in the 4-1 win over the Algerians in Lagos.\nShe has scored eight goals plus two assists for her club this season, propelling them to the NWSL playoffs, and recently fancied her chance of returning to the team after missing the 2024 AFCON.\n“Playing for the Super Falcons is a very big honour for me, and I am more than happy to wear the jersey. I am just doing what I can to get my act together and hope I get called up. I’m preparing for what is ahead of me,” she said after Sunday’s win.\nThe Super Falcons won the first leg of their WAFCON qualifier 2–0 against the Benin Republic in Lome last Friday and will play the return leg in Abeokuta on Tuesday.",
  "word_count": 385,
  "scraped_at": "2026-02-14T12:44:18.127808"
}