{
  "article_id": "277521fd2441",
  "url": "https://theprideoflondon.com/posts/chelsea-women-5-0-sunderland-3-positives-as-blues-cruise-into-conti-cup-semifinals-01hp2qfv8y4y",
  "title": "Chelsea Women 5 - 0 Sunderland : 3 positives as Blues cruise into Conti Cup semifinals",
  "date": "20240208T133000Z",
  "domain": "theprideoflondon.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "\"The Force\" was with everyone at Chelsea Football Club on Wednesday night. While Mauricio Pochettino's men shocked Aston Villa at Villa Park, Chelsea Women rolled past Championship club Sunderland AFC 5-0 to advance to the Conti Cup semifinals. Despite a valiant effort defensively by the side second in the Championship, a rotated Blues outfit overwhelmed the visitors who were missing two regular starters from its lineup.\nMelanie Reay's team was under constant pressure, holding the Blues scoreless for a good portion of an interrupted first 45 minutes. That was until Sjoeke Nusken netted two headers from almost the same spot on the pitch to gift the four-time defending English champions a two-goal lead heading back into the dressing room. Right out of the gate in the second half, a piece of individual brilliance by Aggie Beever-Jones essentially put the game to bed.\nABJ took on 18-year-old Grace Ede with the ball on a string, making one cut to the right and firing a rocket past Claudia Moan between the sticks. Fran Kirby put a bow on it, converting twice in the final seven minutes plus stoppage time, once with her head, the other, a tap-in with her right. Per Harry Edwards, those two finishes put Kirby at 115 goals for her CFCW career, eight of which have been headers.\nSAFC's attack was not as non-existent as one would assume in this contest. The club did pile up eight shots, three of which required the attention of the Swede in net for Chelsea. Sunderland's biggest chance came from a mistake playing out the back from Maren Mjelde. The chance was stymied as Nusken, from right back cleared the cross away from danger before the ex-Blue Jenna Dear was able to swing her boot through it.\nThe win marks the seventh successive campaign in which the Blues will compete in the final four of this competition. Hayes' crew will meet Manchester City, Aston Villa, or the winner of London City Lionesses vs. Arsenal for a chance to compete in the final at Molineux Stadium on March 31. The draw for the semifinals will take place on Friday during SportsDay on BBC News.\nAnother cup tournament rolls on this upcoming Sunday. Before that, let us dive into our positives from Wednesday in Norbiton.\n3 positives from the second match of four in southwest London this month for Chelsea Women\n3. Maika Hamano looked lively in her first start in Chelsea blue\nIn December, we got a glimpse of Maika Hamano in Chelsea blue. Yesterday at Kingsmeadow was the 19-year-old's first start for the west Londoners since coming over on January 13 of last year. Hamano showed off her technical on-ball skill and off-ball intelligence throughout the 90-minute match, nearly finding the back of the net on more than one occasion.\nHayes slotted No. 23 on the left wing, giving the 20-year-old Jessica Brown a run for her money as she attempted to keep up with Hamano's activity. The Japanese international nearly opened the scoring in the 24', failing to find that vital touch on a cross from Kirby. Within the first 10 minutes of the second half, Hamano outpaced SAFC's defense, forcing Moan into a close-range save. Look for her this weekend against Crystal Palace. Hopefully, that is another chance for No. 23 to net her first in blue. Though she has a lot to work on, that dynamism and energy on the ball within her game are undeniable.\n2. German Sjoeke Nusken showed out, demonstrating her versatility once again\n\"Sjoeke Twosken\" is very much alive. The trademark on that occasional nickname is pending. We'll only use it when she finishes off two chances. It's Kingsmeadow, so goals from the German is something we come to expect. All but one of her goals this season have been in southwest London. It was far more than those routine headers that were impressive by No. 8 last night.\nAs the graphic clearly explains below, Nusken covered almost every blade of grass. Interestingly, Hayes positioned the 23-year-old at right back, something we've not seen before. It continues the notion that there really isn't a spot on the pitch the Blues' manager doesn't believe Nusken can't play.\nI think if Hayes had the chance, No. 8 could play between the sticks if the club needed it. She simply finds a way to be impactful no matter the role. That run toward the back post to open the scoring was brilliant. Nusken starts at the near post for the corner, but when the ball finds her way to Kirby following a clearance, the German makes a curling run from the top of the box to the opposite post.\n1. Emma Hayes provided rest for nearly all of Chelsea's first-choice starters\nUnlike the away side which made four changes throughout the match, the west London outfit didn't make a single one. Hayes opted to make 11 alterations from the team that competed against Everton over the weekend, something we figured would occur due to the turnaround and opponent. Due to the depth of the team, you don't really lose that much quality in rotation. \"Super Fran\" is still controlling things in the No. 10 position.\nJess Carter, Erin Cuthbert, and Lauren James all had a chance to rest for an entire 90-minute match for the second time in a little more than a week. Whenever you can gift top players rest, especially within a season where the west London outfit is still in four competitions you have to take advantage. Niamh Charles, who has started in every league contest this season finally had a chance to breathe as an unused substitute.\nCrystal Palace travels to Kingsmeadow for an FA Cup encounter on Sunday afternoon. Click the link to lock down your seat inside the ground.",
  "word_count": 966,
  "scraped_at": "2026-02-14T12:41:15.842180"
}