{
  "article_id": "2783380ab981",
  "url": "https://theprideoflondon.com/2023/11/13/chelsea-women-real-madrid-preview/",
  "title": "Chelsea Women at Real Madrid , UWCL preview : road to Bilbao starts now",
  "date": "20231113T183000Z",
  "domain": "theprideoflondon.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Coming off a second consecutive victory away from London, Emma Hayes and Chelsea Women head out of the country for a clash in the Spanish capital. Alberto Toril’s Real Madrid awaits, a side that has lost only one contest across all competitions since the turn of the new campaign. Champions League away fixtures are always character tests. It’s time to see if this team can pass its first one of 2023/2024.\nLas Blancas, a member of the west Londoners’ last UEFA Women’s Champions League group qualified for the third straight group stage with a triumph over Valerenga. The trek to the Estadio Alfredo Di Stefano last December concluded in a draw that saw the away side come back from down a goal. A Misa Rodríguez own goal from a Guro Reiten penalty salvaged a point from a night that saw Sam Kerr put four of her five shots off target.\nThough Hayes has expressed the fact that there is no pressure on this final European campaign in blue, it would have to feel rewarding to finish at the pinnacle of European women’s football. She has felt what it was like for the Blues’ rivals to the north, but this would be different. The quest to Bilbao begins now. Kicking things off with three points could be crucial. The last time the west Londoners failed to do so, they sat in third place and out of the quarterfinal picture after six match weeks.\nGiven that this is an extremely short turnaround, Hayes will without question make some changes to the previous lineup. Sophie Ingle may be used for the experience factor while Ashley Lawrence could be rotated into the starting XI to give Eve Perisset a rest.\nOne thing to look out for is the dynamism of Real Madrid. It has several incredible one on one attacking players, shown in the fact that it leads all of Liga F in successful take-ons. The defense cannot drop its focus. Versatile Colombian attacker Linda Caicedo sits in the top-five in the Spanish top-flight in dribbles executed. Almost nobody has the pace of the 18-year-old. The Blues have to present her with physicality, and close her space down as quickly as possible.\nFor the remainder of the calendar year, one match per week is hard to come by. There are two weeks until another international break. This team can’t look too far ahead, and with Hayes still at the helm, we all know they won’t. The only defeat for the Spanish outfit came against a disciplined Levante side who took advantage of some questionable set-piece defending away from home. Set plays are always vital, especially when the club’s only home defeat this season came at the expense of them.\nThe club may be without Caroline Weir, but that does not mean it is short on talent. Madrid just annihilated Alejandra Bernabe and Real Sociedad 7-1 over the weekend. It was a good old fashion beatdown. Six different players found the back of the net. Three in the first half. Four in the second.\nNewcomers Signe Bruun and former Manchester City attacker Hayley Raso have made a seamless transition into Liga F. The two have combined for eight goals across league play. The midfield is not one you want to mess with either. Spanish World Cup star Teresa Abelleira usually sits in a double pivot with French international Sandie Toletti. The 2023 Women’s World Cup Best XI midfielder did not feature once against the Blues a year ago.\nNo matter what the past says between these two, this is a totally different looking team than what Chelsea saw twice toward the tail end of 2022.\nChelsea Women at Real Madrid projected starting XI\nGoalkeeper: Ann-Katrin Berger\nDefenders: Ashley Lawrence, Millie Bright, Jess Carter, Niamh Charles\nMidfielders: Jessie Fleming, Erin Cuthbert, Sophie Ingle\nForwards: Sam Kerr, Lauren James, Fran Kirby\nChelsea Women at Real Madrid match info\nDate: Wednesday, November 11\nTime: 20:00 GMT, 3:00 p.m. EST\nTV Broadcast: DAZN Women’s Football YouTube, TNT Sports 1",
  "word_count": 670,
  "scraped_at": "2026-02-14T12:56:57.404056"
}