{
  "article_id": "27c523ede652",
  "url": "https://www.popmatters.com/ted-lasso-wizard-of-oz",
  "title": "There Is No Place Like  Ted Lasso  ",
  "date": "20230613T183000Z",
  "domain": "popmatters.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Reflecting on the end of the season and series for the AFC Richmond Greyhounds and Ted Lasso, we come to understand that this three-season sports comedy arc is a story about emotional evolution. This is fitting. When we consider the era of the show’s creation, we can’t help but recognize that changing one’s mind, one’s opinion, and one’s course is, in American discourse, criticized soundly as “flip flopping” or “waffling” or being weak. As the show has reconceived masculinity, redefined leadership, and encouraged us to check our egos at the door, we might realize that evolution is among the noblest of goals. This realization is underscored by one of our last glimpses of Ted Lasso (Jason Sudeikis) in one of the final scenes in the final episode, “So Long, Farewell”. He’s reading Michael Pollan’s How to Change Your Mind on his flight home.\nThe series pilot, premiering in August of 2020, opens with Coach Lasso, fresh from the American midwest football field, on the English football pitch for the first time. When he learns that player Colin Hughes (Billy Harris) is from Wales, he asks how many countries are in England. When Assistant Coach Beard (Brendan Hunt) and kit man (at this point) Nate Shelley (Nick Mohammed) respond, “four countries are in this country,” Ted replies, “sounds kind of like America these days.”\nAt this moment, Ted seems to be alluding to the entrenchment of American political parties and people stuck in their egos and echo chambers. Perhaps the potential he declares he can smell in the locker room during that episode is redolent of the possibility of minding those gaps and communing with others. He believes his team can traverse perimeters and win all the games by doing so.\nWhen we say this show about football is not about football (just as Friday Night Lights was not about American high school football), we are saying that in each of Ted Lasso‘s characters, we follow their journeys across borders of various types. We witness growth, forgiveness, and abrupt about-faces that make the case for profound human change as a means of progression, a badge of strength, and a path to victory. Ultimately, in the finalé, Lasso is proud to know “the men [they] have all become.” Each personal evolution and ultimate development marks an epiphany and redemption, not unlike the denouement for The Wizard of Oz characters, which has an interesting parallel to Ted Lasso.\nThe narrative of this evolution in Ted Lasso is underlined in May 2023’s penultimate episode, “Mom City”, when juxtaposed with the pilot, which aired in August 2020. In “Mom City”, Ted strolls through the town of Richmond and everyone he encounters says hello, signaling he is no longer the “fish out of water” he was in the pilot. Moreover, the show’s central characters are now the byproducts of dynamic change, no longer the caricatures we met back then. Ted Lasso opened with the line, “We are not in Kansas anymore”, alluding to Dorothy’s line in The Wizard of Oz, that fish out of water feeling of not belonging. That sentiment became the show’s guiding principle, thematic focus, and narrative construct, and finally, the story to its natural end.\nPersonal evolution is foregrounded as Phil Dunster’s Jamie Tartt, AFC Richmond’s striker, comes home to Manchester, to the team he left, the home he grew up in, and the father he fled. Ted Lasso‘s / The Wizard of Oz‘s ditzy scarecrow with the straw-like “walnut mist” hair has gotten his brain, we see. Jamie appeared in the first season with a cap declaring him an Icon. He was a primadonna on the field and said, in classic Jamie fashion, “Coach, I’m Me. Why would I want to be anything else?” In a press conference in “Mom City”, he won’t accept recognition for Premier League Player of the Month. In the series’ final episode, “So Long, Farewell”, he selflessly gives away his chance to score the game-winning penalty kick instead of hogging the ball and the field and the points and the limelight.\nAs Ted Lasso concludes, it is revealed that Jamie is the complicated progeny of his mother’s extreme affection and his father’s cruel abuse. Part of Jamie’s growth is illustrated in his coming to terms with his father. Ted positions this forgiveness as a reframing of selfishness: “When you choose to do [forgive], you’re giving that to yourself.” In freeing himself from the hatred and freeing himself of his selfishness, Jamie is rewarded with stunning play in spite of an injury. He receives a standing ovation from the people of his hometown, who have come to respect him even as a member of their team’s greatest rival.\nIn these final episodes, Ted Lasso/The Wizard of Oz’s gruff tin man Brett Goldstein’s Roy Kent has found his heart. He can express his emotions now and say that he doesn’t want to be “just friends” with Juno Temple’s Keeley Jones, the team’s PR exec. We have witnessed his emotional growth, particularly in his tutelage in the ways of the heart by his niece Phoebe (Elodie Blomfield). Roy has evolved emotionally to the point of crying a the team screening of the classic American romantic comedy, You’ve Got Mail, the evening before their final match.\nLoner Roy now wants connection: the bromance with Jamie, the romantic comedy with Keeley Jones, and to be a Diamond Dog, the male leadership team of the Greyhound-sponsored organization whose locker room talk focuses on a range of relationship problems. In the Diamond Dog’s final meeting in Ted’s office, Roy says he wants “to be someone somehow better”. AFC Richmond Communication Manager Higgins (Jeremy Swift) admonishes him that perfection is impossible, and we must “always be moving toward better.” The point is not the winning but the striving.\nPerhaps, the bravest act is admitting when you are wrong. Nathan Shelley is Ted Lasso‘s stand-in for The Wizard of Oz’s cowardly lion. He earns his “badge of courage” by accepting responsibility for leaving the Richmond Club to join the “dark side” as manager of rivals West Ham United. The grass was not greener on the rival pitch, Nate learned through many unsavory interactions with the club’s owner, the villainous Rupert Manion, played by Anthony Head. Reflecting on the error of his ways, Nate tells his girlfriend Jade, “Things didn’t really end too well for me [at Richmond]. I think a lot was my fault, well… it was all my fault.”\nOne of the most moving scenes in these last episodes was the scene in which Coach Beard, initially resistant to allowing Shelley to return to AFC Richmond, appears at his doorstep to reveal the Beard/Ted backstory. The story is rife with Les Misérables allusions by endorsing the risk and reward of second chances. Ted offered Shelly a second chance after he stole a “loaf of meth” and then Ted’s car. Beard intones: “He forgave me and gave me a job and a life. I forgive. So to honor that, I forgive you and I offer you a job. The life part is up to you.” Nathan evolves to apologize and redeems himself with the Richmond Club in the final episode for the final match.\nIn The Wizard of Oz, as in Joseph Campbell’s journey monomyth, The Hero with a Thousand Faces, and Ted Lasso, the hero is destined to return home transformed. In the penultimate episode, “Mom City”, we see an uncharacteristically edgy and impatient Ted finally being honest with his mother, Dottie Lasso (Becky Ann Baker), about his rage and anger. Ultimately, he convinces her to admit that it is “Ok for things not to be ok,” after his father’s suicide. He also recognizes that he is not ok with being away from his son Henry, who lives in Kansas.\nFinally, Ted has freed himself from the repression that had bound him up and panicked. While the “Mom City” episode foregrounds mothers (Ted’s and Jamie’s) after many Dad moments throughout the arc for Ted, Jamie, Sam (Toheeb Jimoh), and Nathan, we return to fatherhood in the series’ last episode, “So Long, Farewell”, wherein Ted returns to America to the state of Kansas, just as Dorothy in the Wizard of Oz did because, well, “there’s no place like home.”\nWhile Ted Lasso has been celebrated for its feminist conception, feminist writer’s room, and setting the curve on the Bechdel test (used to measure the show’s progressive representation of women), the growth trajectory for the female characters may not be as steep or satisfying. At the series’ conclusion, Hannah Waddington’s Rebecca Welton no longer wants her philandering ex and rival, West Ham’s owner, Rupert Mannion. She no longer wants to destroy his beloved club as revenge following their scandalous divorce. Over the seasons, she becomes a great supporter of the team, and in one of their final encounters, we witness her outright rejecting Rupert’s advances. Rebecca tells Ted she no longer cares about winning as much as she cares about the team. She can now agree with what Man City football manager, Pep Guardiola, has said in his cameo (“Mom City”) and what Ted has long believed: the importance of football is helping the men on and off the pitch “be the best version of themselves that they can be.”\nAt the series’ end, Rebecca declares she is giving 49% of her ownership of the team to the fans and will focus on family. This means recognizing AFC Richmond as “her family” and rekindling her relationship with her new beau’s daughter. However, Rebecca’s path to growth seems to be something she desired all along. The little girl in the mirror that Rebecca confronted in scenes when she faced her fears is played by the same actor – Kiki May as Nora – who becomes her new adopted daughter. Thus, Rebecca comes to embrace her inner child, which may be more regressive than progressive.\nHowever, the character whose evolution is most unsatisfying is Keeley. While she began Ted Lasso as a trophy, an arm piece for Jamie, Roy, and then, Jack, it is implied that she is now a media mogul PR badass and on the rise, yet her business acumen is rarely exemplified. Additionally, others always seem to be ready to clean up the mess she’s made. Most recently, when the funding was pulled for her firm, Rebecca stepped in for the VCs financially. In the end, we are to understand that Keeley has decided to be independent in every way, which may come to fruition in creating an AFC Richmond Women’s Team. So perhaps her real growth will remain to be seen in a spinoff.\nThe journey home from Oz serves as an archetype for the hero’s journeys and evolutions in Ted Lasso‘s three-season arc. At the end of the series, the AFC Richmond Greyhounds won their match at home. However, they were second to Man City for the Premier League title. More important than the score and the ranking is “The Richmond Way” – prioritizing people over winning – and how the game was played.\nWorks Cited\nBerman, Judy. “Ted Lasso and TV’s Strange Quest to Build the Perfect Man“. Time. 19 July 2021.\nCampbell, Joseph. The Hero with a Thousand Faces. Third Edition. New World Library. July 2008.\nCheung, Kylie. “The Many Betrayals of ‘Ted Lasso’” Salon. 2 October 2021.\nGrunwald, Michael. “John Kerry’s Waffles”. Slate. 3 March 2004.\nHannah & Kels. “March 2021: Ted Lasso + Feminism, Actually”. Pop Culture Pen Pals. 12 April 2021.\nLee, Kendra Stanton. “The Ladies of Ted Lasso”. Medium. 19 October 2020.\nMahjouri, Shakiel. “‘Ted Lasso’ Actress Hannah Waddingham Praises ‘Staunch Male Feminists’ Behind The Show”. ET Canada. 15 July 2021.\nMalman, Carolyn. “The Strength of Ted Lasso”. Old Gold & Black. 24 April 2023.\nMcIver, Brian. “’Ted Lasso’ returns for a darker ‘Empire Strikes Back’ second season”. Yahoo! News. 23 July 2021.\nMelero, Shannon. “The Fantasy of a Locker Room Where Men Don’t Act Like Total Assholes”. Jezebel. 15 October 2020.\n“Mitt Romney’s Biggest Flip Flops”. Rolling Stone. 1 August 2012.\nSnow, Godric. “Ted Lasso: Less of a sports comedy, more of a motivating, heart warming TV series.” The Times of Snow 10 October 2021.\n“Supernatural Aid.” TVtropes.com.\nWhiting, Amanda. “Ted Lasso season three review: Fish-out-of-water sitcom has slyly evolved into something more compelling”. Independent. 15 March 2023.\nZack, Jessica. “Jason Sudeikis talks playing a character without an ego in his hit sports comedy ‘Ted Lasso’” Datebook. 21 July 2021.",
  "word_count": 2074,
  "scraped_at": "2026-02-14T13:24:31.932331"
}