{
  "article_id": "27d33b9468b2",
  "url": "https://www.thewestmorlandgazette.co.uk/news/24993212.georgia-stanway-bayern-munich-tribute-poppy-atkinson/",
  "title": "Manchester United and Bayern Munich tribute to Poppy Atkinson",
  "date": "20250309T140000Z",
  "domain": "thewestmorlandgazette.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "THE footballing idols of 10-year-old Poppy Atkinson from south Cumbria have paid tribute to the promising young player after her 'devastating' death on Wednesday.\nPoppy, who was hit by a car on the field at Kendal Rugby Club while taking part in football training, was 'determined' to play for Manchester United and named Bayern Munich and England player Georgia Stanway, from Barrow, as one of her sporting idols, according to a family tribute.\nGeorgia Stanway posted a picture on social media of her and her FC Bayern teammates holding up a shirt with '10', and 'Poppy' posted underneath.\nThe picture was captioned with the words 'For Poppy with love FC Bayern'.\nStanway, cited by Poppy's family as one of her footballing idols alongside fellow England star Ella Toone, and Argentinian legend Lionel Messi, reacted to the death of Poppy.\nOn Thursday, she posted: \"Devastating. I'd like to send my love and condolences to the family and all affected.\nREAD MORE: Family pay tribute to 'beautiful and determined’ 10-year-old girl\n\"The football world will always remember Poppy and mine and Ella Toone next game will be designated in Poppy's honour.\"\nMeanwhile, the players of her beloved Manchester United Women FC had Poppy in their thoughts as they made it through to the FA Cup semi-final with a 3-1 win over Sunderland.\nThe match ended fittingly, with one of Poppy's heroines, Ella Toone, netting the third Manchester United goal to seal the victory in the 91st minute.\nREAD MORE: Poppy Atkinson honoured at football fixtures across the UK\nAfter the game, Manchester United's players and staff made a moving tribute to Poppy, gathering round a team jersey with 'Poppy' and the number 7 emblazoned on the back, as fans cheered the poignant gesture.\nThe picture was posted on the team's Facebook page with the caption 'That one was for you, Poppy'.\nPoppy's family spoke of her love for the club in an earlier tribute, saying: \"Many who know her, and who know her determination to improve and win, had no doubt she would achieve her goal to one day play for Manchester United.\"\nThe tributes are the latest in an outpouring of grief for Poppy, as grassroots football clubs across the country marked the passing of the promising Kendal United Under-12s player with a minute's silence on Saturday.",
  "word_count": 386,
  "scraped_at": "2026-02-14T12:35:08.236572"
}