{
  "article_id": "27d57a6eabc1",
  "url": "https://www.prnewswire.com/news-releases/pepsico-extends-strategic-partnership-with-uefa-champions-league-for-another-three-years-during-a-pivotal-time-in-the-leagues-history-301856508.html",
  "title": "PEPSICO EXTENDS STRATEGIC PARTNERSHIP WITH UEFA CHAMPIONS LEAGUE FOR ANOTHER THREE YEARS DURING A PIVOTAL TIME IN THE LEAGUE HISTORY",
  "date": "20230621T113000Z",
  "domain": "prnewswire.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "PepsiCo will find new ways of engaging audiences to create unmatched fan experiences and driving impact on and off the pitch through 2027\nPURCHASE, N.Y., June 21, 2023 /PRNewswire/ -- PepsiCo, a proud partner of the UEFA Champions League (UCL) since 2015, today announced the extension of its strategic partnership for another three years, until June 2027, further strengthening its presence across the elite football landscape. PepsiCo is the first sponsor to renew the UCL collaboration and comes at a pivotal time as the competition format changes and the number of participating clubs increases, providing fans new ways to enjoy iconic PepsiCo brands including Pepsi MAX®, Lays® and Gatorade®.\nNow in the third cycle of its UCL partnership, PepsiCo will help expand the reach of the world's most-watched sports competition, drive next-gen fan engagement and look to accelerate its PepsiCo Positive (pep+) sustainability agenda of supporting people and the planet. Specifically, the extension will reinforce PepsiCo's commitment to drive societal and environmental impact with a $1 million investment dedicated to collaborative projects with the UEFA Foundation for Children as well as to initiatives focused on environmental sustainability, including joint efforts on the \"road to zero\" to significantly reduce single-use plastic.\nFueling the future of football with next gen fan engagement and experiences\nThe next era of the PepsiCo and UCL partnership will fuel a two-way dialogue between brands and fans and will generate cultural moments of global conversation. PepsiCo is committed to delivering unmatched experiences for fans and is striving to further expand the reach of UCL globally and doubling up activations in the U.S. – the fastest growing football market – and the Middle East:\nUCL Final Kick Off Show by Pepsi: Among the highlights of the renewed partnership is a joint commitment to scale the Kick Off Show by Pepsi, the must-see spectacle held moments before the UCL Final match each year. Since the Kick Off Show's inauguration in 2016, Pepsi MAX has brought live global musical artists to the world's most watched annual sporting event, evolving the Final into a truly global entertainment platform for music as well as football.\nDigital & Data Fan Engagement: With the commitment of accessing new audiences and finding more innovative ways of interacting with consumers, PepsiCo and UCL will utilize each other's database of fans to deliver bespoke experiences based on their unique preferences and behaviours across multiple digital touchpoints. This partnership with take digital and data engagement to the next level and continue to capture new growth channels.\nFuelling Teams: To provide support to competing teams, coaches and referees, Gatorade is committed to fuelling everyone forward with hydration products and equipment such as the iconic Gatorade squeezy bottles on all match sidelines. Gatorade will also provide extensive hydration and sports nutrition resources through the Gatorade Sports Science Institute (GSSI) to help players maximize their performance.\n\"PepsiCo has a storied history with the world's most beautiful game, and we're delighted to renew our partnership with the UEFA Champions League to expand the reach and impact of football worldwide,\" said Adam Warner, Head of Global Sports and Partnerships at PepsiCo. \"For the past eight years, our global markets have delivered best-in-class activations, harnessing the combined power of the UEFA Champions League and PepsiCo iconic food and beverage brands. With the extension of our sponsorship, we will continue leveraging our portfolio to drive positive change to people and planet on and off the pitch.\"\n\"We are delighted to continue partnering with PepsiCo and their iconic brands for the next three-year cycle. Together, we will continue improving the fan experience in innovative ways and positively impact communities through the power of football around the world,\" said UEFA marketing director Guy-Laurent Epstein.\nConnecting communities through the power of football\nBeyond a shared love of the game, PepsiCo and UEFA share a passion for leveraging the world's most popular sport to drive important societal action and have increasingly collaborated on various community and sustainability initiatives. PepsiCo is investing $1 million per season to jointed projects with the UEFA Foundation to further their programs:\nSparking joy with Lay's RePlay: Lay's RePlay is a global initiative created in partnership with the UEFA Foundation for Children, launched with the aim of giving deserving communities access to football pitches made from recycled Lay's potato chip bags. To date, Lay's RePlay has unveiled seven football pitches in South Africa, Brazil, the UK, the US, Italy, Egypt and Mexico with a potential monthly reach of 14,000 community members around the world. With a further four pitches in planning stages, Lay's RePlay global footprint is set to span 10 countries with 11 pitches around the world.\nTeam of Champions: With a $1 million commitment made over the past three years, PepsiCo has expanded its \"Team of Champions\" to improve access to football in underserved communities across the U.S. The investment has made an impact on and off the pitch, including helping teams with apparel and equipment costs, field access, mentoring, coaching and education and fan experiences.\nChampioning sustainability: At the 2023 UEFA Champions League Final and the 2023 UEFA Women's Champions League Final, PepsiCo and UEFA implemented innovative circular economy practices to minimize the impact of football on the environment and drive resource efficiencies. This included the adoption of returnable packaging solutions for both food and drinks at the 2023 UEFA Women's Champions League Final and the incorporation of recyclable and biodegradable fiber cups at the 2023 UEFA Champions League Final, where a pilot fan sampling using 48,000 reusable and smart cups was implemented. These initiatives will pave the way on the \"road to zero\" to significantly reduce single-use plastic, with the aim of expand this approach further within European football in the coming years.\n###\nAbout PepsiCo\nPepsiCo products are enjoyed by consumers more than one billion times a day in more than 200 countries and territories around the world. PepsiCo generated more than $86 billion in net revenue in 2022, driven by a complementary beverage and convenient foods portfolio that includes Lay's, Doritos, Cheetos, Gatorade, Pepsi-Cola, Mountain Dew, Quaker and SodaStream. PepsiCo's product portfolio includes a wide range of enjoyable foods and beverages, including many iconic brands that generate more than $1 billion each in estimated annual retail sales.\nGuiding PepsiCo is our vision to Be the Global Leader in Beverages and Convenient Foods by Winning with pep+ (PepsiCo Positive). pep+ is our strategic end-to-end transformation that puts sustainability and human capital at the center of how we will create value and growth by operating within planetary boundaries and inspiring positive change for planet and people. For more information, visit www.pepsico.com and follow on Twitter, Instagram, Facebook, and LinkedIn @PepsiCo.\nAbout UEFA\nUEFA – the Union of European Football Associations – is the governing body of European football. It is an association of associations and the umbrella organization for 55 national football associations across Europe. UEFA is a society entered in the register of companies under the Swiss civil code and Its headquarters are located in Nyon, Switzerland. The organs through which UEFA acts are the UEFA Congress, the UEFA Executive Committee, the UEFA President and the organs for the administration of justice. UEFA is responsible for organizing men's, women's, youth, amateur and futsal competitions including the UEFA Champions League, the UEFA Europa League, the UEFA Europa Conference League, the UEFA Women's Champions League, the UEFA European Championship and the UEFA Women's EURO. Visit UEFA.com for more information about the organization, its numerous activities, programs and campaigns, and follow UEFA on Facebook, Instagram, LinkedIn and Twitter.\n###\nSOURCE PepsiCo, Inc.",
  "word_count": 1259,
  "scraped_at": "2026-02-14T12:45:37.921230"
}