{
  "article_id": "27ddb1ecef33",
  "url": "https://www.dailyrecord.co.uk/news/politics/snp-government-should-listen-alex-31494688",
  "title": "The SNP Government should listen to Alex McLeish and help our football heroes",
  "date": "20231122T103000Z",
  "domain": "dailyrecord.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The SNP Government should listen to Alex McLeish and help our football heroes\nIn a piece for the Record, Labour MSP Michael Marra welcomed the Aberdeen and Scotland legend's backing for his campaign.\nAlex McLeish is a true legend of the Scottish game.\nBig Alex was one half of Scotland’s finest ever centre half duos – automatic picks in every Scotland fan’s all time fantasy 11.\nAlex’s leadership, along with that of club captain Willie Miller, helped guide Aberdeen to the European success against Real Madrid, alongside countless domestic trophies and titles.\nAutumn nights in Paris have quite enough to recommend them but as Scotland manager Alex gave us the best one ever - James McFadden smashing past the French goalie from almost 40 yards.\nREAD MORE: Alex McLeish opens up about dementia fears after research links disease to heading a footballThat night needed McFadden’s brilliance, but it was the leader in the dugout who made the performance.\nNow Alex is leading Scotland again. In the fight to have brain injuries in football recognised as the industrial injury they undoubtedly are, his is a vital voice.\nHis name and reputation among fans of all clubs lends urgency to the issue – Alex played with these players who are suffering, he played against them. Now, tragically, he is grieving with their families.\nThis issue is not going away. Every month we hear of another old pro struggling with dementia, Alzheimer’s, Parkinson’s and other neurodegenerative diseases.\nJust last month Bobby Charlton passed away after battling dementia for some years. Probably the Auld Enemy’s finest ever player and a true gentleman. My Dad has a photo of me as a kid in the early 80s, sat on Charlton’s knee in a caravan park social club in Northern England. As good a man as you could find and a tragic loss.\nBill Gates, long of Middlesbrough, passed away just a few weeks ago and our own great Gordon McQueen died earlier this year.\nAll struggled with brain injuries and neurodegenerative illnesses and, while we can’t pin any one case on their playing careers, we do know that those careers left them far more likely to develop brain injuries than the average person in the street.\nThe science is clear and indisputable. Former players are three times more likely than the general population to develop these diseases. A centre half – like Big Alex McLeish – is five times more likely.\nOur demands, supported by Alex, are straightforward. We want to see government classify brain injury in football as an industrial injury. Giving those ex-pros access to the benefits and care they need and have earned.\nWe want funding for further research into the practical and preventative support that is needed within the game at all levels.\nScottish politics\nWe also want a working group established to consider the issues around brain injury and dementia, including in the grassroots and women’s games.\nI am very grateful for the support of colleagues from across politics , including the SNP’s own Ian Blackford MP and Chris Stephens MP who have been doing great work on this issue in Westminster.\nThis week in Holyrood I will host a roundtable in Parliament where a number of ex-pros and colleagues from across the Trade Union movement will meet with MSPs to discuss this issue.\nThere isn’t time to delay. The science is clear and so is our responsibility to do right by those who have given us so much.\nMarra is a Labour MSP for North East Scotland.\nTo sign up to the Daily Record Politics newsletter, click here.",
  "word_count": 599,
  "scraped_at": "2026-02-14T13:27:50.771397"
}