{
  "article_id": "27df883f0c9e",
  "url": "https://www.gaeliclife.com/news/gaas-world-in-motion/",
  "title": "GAA WORLD IN MOTION - Gaelic Life",
  "date": "20240618T133000Z",
  "domain": "gaeliclife.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By Brendan McGilligan\nGAELIC games are for many on the island of Ireland an important cultural vehicle and a staple of life.\nWith Gaelic clubs being the pillars of many communities, men and women grow up engulfed by the sport from a young age.\nBut the sport has come to mean so much more for the Irish diaspora leaving in search of a more prosperous life through work or education.\nOne such club is St Brendan’s, a club that has come to be the bedrock for many generations of Irish living in Manchester including Andy Kane, a former player and coach at the club, since its foundation in 1959.\n“You don’t get this with any other sport. It is unique,” said Kane.\n“For the lads born in England, it is so important to them to be part of the culture their family has experienced.\n“That community element gives you a sense of belonging, especially having moved away from home. It is a great way to play Gaelic games, particularly when you probably think you may not ever play them again after leaving Ireland.”\nWhile Gaelic clubs offer a chance to continue playing the sport, it also offers social value for ex-pats.\nIndividuals may look to GAA clubs as a way to make friends from the moment they land abroad, and this was the case for Caoimhin Quinn, a teacher in Manchester playing for St Brendan’s.\n“It is massively important; I’d say without Gaelic football, I don’t actually think I’d be here in England,” admitted Quinn.\n“The community is so tight; when you go down, you know everybody. There is a family feel about it.\n“I enjoy the craic after training. The people make the sport and the club, which is why we keep coming back. We all get along, but it is the sport that has brought us together. So, it is vital for the Irish community here in England and Manchester.”\nBut as the world has globalised more, people have started to relocate to places less stereotypical of the Irish diaspora.\nAnd this has brought the GAA to areas you would not expect to find the sport, including Barcelona in Spain.\nBarcelona Gaels are growing every year due to the likes of Eoin Mac Cathmhaoil spreading the sport in the Catalan city.\nHe said: “I moved over here on the Erasmus scheme in 2018 and didn’t know a single person in the city, and this is similar for other players that have moved over for work, as a group of people or in relationships. It was a godsend to come together through the club.\n“We train twice a week, both men and ladies. It is great to see the numbers at training. And we have a few Catalan members playing for us as the team continues to thrive.\n“We have had our Calçotada celebrations, a traditional Catalan celebration, as we look to have our members and club share the traditions of Catalunya.”\nAnd this mix of Irish culture with the exploration of the culture the Irish population now call home seems to be a common trend through Gaelic clubs abroad, as Rome Hibernia organised St. Patrick’s Day celebrations in the Eternal City.\nStudent Una Casey believes Gaelic games have been able to thrive and grow in Europe and worldwide due to the competitions bringing international clubs together.\nShe said: “We compete in the central-eastern European Championship, playing against the likes of Vienna, Budapest, and Zurich. It is really competitive, but it is also interesting to go to these competitions to see how these teams are doing in comparison to ourselves.\n“But playing in the World Games back home in Derry was a surreal experience. Having my team here for so many years, it was unbelievable to have them in Derry. It was an incredible experience.\n“We have a lot of Italians in our team too, around half of them are. But we are finding more nationalities wanting to join our teams.\n“You are seeing those who may have studied or lived in Ireland wanting to join us when they move to Rome, but we also welcome everyone, no matter their experience. Gaelic football as a sport that is so welcoming.”\nWith more foreign nationals taking up the sport around the world, it demonstrates the interest the sport can have beyond the Irish population.\nIn the Middle East, there was recently a fixture at a Gaelic tournament for only non-Irish nationals.\nAnd for Kuwait Harps’ coach, Daragh Meredith, this was a blessing.\n“The community element is great. And there are a lot of people willing to learn a new sport.\n“Due to the joy and identity the sport has, there is no pressure in Kuwait as we only have five or six Irish players.\n“From our club, I did a thing where we put our national flags up, and there were 18 different nationalities. It is a diverse sport, not just a sport abroad for Irish people.\n“There is such scope for the GAA to expand tournaments around the world, and I can’t wait to see further global expansion. I’d love to see a potential world tournament in the future.”\nEvolving from a beacon of Irish culture on the sporting field with the foundation of the GAA in 1884, Gaelic games have grown vastly to incorporate all cultures and values.\nBut what remains is the key sense of belonging, welcome, and community – something that will help the game continue to grow on the world stage as the Irish and others continue to inform the globe about this magnificent sport and culture.\nReceive quality journalism wherever you are, on any device. Keep up to date from the comfort of your own home with a digital subscription.\nAny time | Any place | Anywhere",
  "word_count": 963,
  "scraped_at": "2026-02-14T12:52:17.140395"
}