{
  "article_id": "27e12f0001e8",
  "url": "https://www.afl.com.au/aflw/news/1263082/sarah-blacks-draft-late-mail-who-will-your-club-pick",
  "title": "Sarah Black AFLW Draft preview : Who will your club pick ? ",
  "date": "20241214T044500Z",
  "domain": "afl.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "THE TENTH Telstra AFLW Draft is shaping up to be the deepest and most even to date.\nA fully national draft for the first time has removed all restrictions on selecting players, and there appears to be relatively common consensus among clubs as to who sits in the top seven or eight spots.\n>>> WATCH THE 2024 TELSTRA AFLW DRAFT LIVE AND FREE ON AFL.COM.AU FROM 7PM AEDT MONDAY\nFrom there, another seven or so players sit in the mid-first round selection tier, and then, as one list manager put it, \"throw a blanket on picks 15 to 40\".\nThere'll be bids coming for Carlton's father-daughter Sophie McKay, as well as potentially five Gold Coast Academy players – led by Havana Harris – which will keep the Suns' brains trust on their toes.\nSpeaking of keeping people on their toes, Melbourne has enshrined its pick two with plenty of mystery, with lots of deliberately conflicting whispers about which West Australian – Zippy Fish or Molly O'Hehir – is set to be a Dee.\nIt's the sliding doors decision that is set to shape the draft.\nClubs must match bids with a pick within 18 selections, with no draft value index points in play in the women's competition, nor future or live pick swaps.\nWe've selected 20 players who we believe will be in the top rungs of Monday night's draft, but a lot will depend on club needs from pick 15 onwards.\nASH CENTRA\nPosition: Midfielder\nHeight: 176cm\nFrom: Victoria, Gippsland Power/Sale City\nA highly talented midfielder who has played across all three lines in her time at Gippsland. Centra is a former basketballer who finds plenty of time and space in the contest, with elite kicking skills and decision making. She can hit the scoreboard, and is tall and powerful enough to have an immediate impact next year.\nWhere could she go?\nCentra is hot favourite to go to Collingwood with the No.1 pick, having sat at the top of the rankings in the second half of the year.\nMOLLY O'HEHIR\nPosition: Defender/midfielder\nHeight: 179cm\nFrom: Western Australia, South Fremantle/South Coogee\nThe West Australian has shot to the top end of draft boards in recent weeks. Still with plenty of development left, her strong form and high ceiling has excited clubs. Plays as a tall, driving defender or even through the midfield, and captained the AFLW Academy in a match this year.\nWhere could she go?\nO'Hehir is in demand at the pointy end. Publicly, Melbourne is weighing up either O'Hehir or Fish at pick two, and clubs are tying themselves in knots trying to work out which way it'll go. There's no chance O'Hehir will slip beyond GWS at three.\nHAVANA HARRIS\nPosition: Ruck/forward/midfielder\nHeight: 182cm\nFrom: Queensland, Gold Coast Academy/Bond Uni/Burleigh\nA truly rare talent, it's not uncommon to see Harris meander to the centre circle and not be sure if she's about to take the ruck or line up as a midfielder. Has the strength and size to have an immediate impact at AFLW level, in a similar vein to Matilda Scholz, but is arguably quicker than the rising Port Adelaide star. Her pace and agility – in conjunction with her strength – sets her apart.\nWhere could she go?\nWhoever is appointed to Gold Coast's vacant coaching job is in for a treat. Expect the bid for Harris to come at picks two, three or four, with the Suns to match with 19.\nGRACE BELLONI\nPosition: Forward/midfielder\nHeight: 175cm\nFrom: Victoria, Eastern Ranges/Olinda Ferny Creek\nCame into this year as a strong lead-up forward, and finished her football season as a powerful inside midfielder. An athletic player who moves well, she worked hard over her off-season to develop her endurance and footy IQ. Pronounced \"BELL-an-ee\".\nWhere could she go?\nHas emerged as a serious bolter in the past few weeks, and was one of just 12 invited to the draft, indicating some legitimate top-end attention. Unfortunately for Belloni, her placement is set to be dictated by selections above her. GWS at three is an option if O'Hehir is no longer available, while Sydney (four), Carlton (five) and West Coast (six) will also be in the mix.\nINDIA RASHEED\nPosition: Forward/midfielder\nHeight: 173cm\nFrom: South Australia, Sturt/Glenunga\nThe daughter of Australian tennis coach Roger, Rasheed took out South Australia's MVP last year ahead of the likes of Shineah Goody, Lauren Young and Piper Window. A strong marking target in attack who knows where the goals are, she likes to get up and involved in the play.\nWhere could she go?\nSydney has been heavily linked to Rasheed at No.4, while West Coast (six) could also be in the mix. The Swans are eager to boost their scoring power, but the South Australian could slide if not in the red and white.\nZIPPY (Zipporah) FISH\nPosition: Defender/midfielder\nHeight: 160cm\nFrom: Western Australia, East Fremantle\nZippy by name, zippy by nature. The elusive Fish has been carving it up off half-back in Western Australia for years, and is finally eligible for the Draft. Lightning fast and very agile, she thrives on the run, and can burst a game open with ease.\nWhere could she go?\nMelbourne at pick No.2 is a serious option, but Fish is unlikely to land in New South Wales, with GWS and Sydney holding picks three and four. Won't slip past Carlton at pick No.5.\nPOPPY SCHOLZ\nPosition: Utility\nHeight: 179cm\nFrom: South Australia, Glenelg/Mitcham\nSister Matilda's sterling end to the year with Port Adelaide won't have done Scholz's chances any harm. A true utility, Scholz can play in attack, on the wing or (most commonly) as an intercept defender. Excellent overhead and a strong kick. Also a committed elite netballer, which may have a few clubs attaching an asterisk.\nWhere could she go?\nIt's looking like the top end for Scholz, but just where she ends up isn't clear. Sydney and Carlton have both been linked – the Blues delisted key back Gen Lawson-Tavan, who played 10 games this year. If Fish goes to the Blues at five, Scholz could slide to Geelong or Richmond at 9/10.\nLUCIA PAINTER\nPosition: Midfielder\nHeight: 174cm\nFrom: Victoria, Bendigo Pioneers/White Hills\nOne of the more powerful midfielders in this year's draft pool, she's just one centimetre shorter than Bri Davey, to provide a comparison point. Wins the hard ball and has a booming kick, covering the ground through length rather than run-and-carry. Has a very mature head on her shoulders.\nWhere could she go?\nHas been heavily linked to West Coast at pick No.6; the kid from the country needing to move regardless of where she's drafted. Could be an outside chance to go to the Swans at No.4, but appears behind some others there. There's even been a whisper of a wildcard selection at No.2.\nSIERRA GRIEVES\nPosition: Midfielder\nHeight: 163cm\nFrom: Victoria, Western Jets/Yarraville Seddon Eagles\nIn an absolutely stacked draft, it takes a highly impressive carnival to be named player of the national championships. Grieves is a tenacious, well-balanced midfielder. Stands marginally taller than Liv Purcell, and has a similar mix of inside contest work and speed away from the stoppage. Is hungry to improve.\nWhere could she go?\nIn any other draft, she'd be in the top three, but it's looking like Grieves could be an absolute steal. The Western Bulldogs love a local girl, but with a new list manager in charge, clubs have been struggling to get a read on what direction they'll go. The Bombers are keen on some speed at eight, while Geelong (nine) and Richmond (10) and the Bombers again at 11 are likely to pounce if available.\nSARA HOWLEY\nPosition: Midfielder\nHeight: 173cm\nFrom: Victoria, Geelong Falcons/Newtown & Chilwell\nHowley has been a consistent performer in the Coates Talent League for years now, winning the best and fairest in 2023 at 17. She glides across the field and is deceptively quick, covering ground with ease. While more lightly framed than her opponents, it doesn't faze her, bouncing off the contest and accelerating away.\nWhere could she go?\nConventional wisdom suggests the local girl going to the club up the road, Geelong, but there's a strong chance Essendon will pip the Cats to the post, given they have a selection prior.\nEMMA McDONALD\nPosition: Key forward\nHeight: 180cm\nFrom: Victoria, Oakleigh Chargers/Ashburton\nTop of the pure key forward power rankings this draft, McDonald is a safe and reliable prospect for anyone who picks her up. A noted goalkicker at under-18 level, her overhead and contested marking is her biggest strength, and she leads strongly for the footy.\nWhere could she go?\nMcDonald has a wide range of suitors, and has been floated as high as pick No.4 with Sydney, which is on the hunt for firepower. Has had links to Carlton, the Dogs, Essendon and Geelong, but no firm connections. More likely to go picks 4-10 than 11-20, but stranger things have happened.\nCHARLOTTE RIGGS\nPosition: Defender\nHeight: 182cm\nFrom: South Australia, Central District/Angle Vale\nOne of the top key backs going around this year. More of a shutdown player than state-mate Scholz, but Riggs can easily win her own footy and send it forward. Has strong hands overhead and reads the play well, with the ability to also line up in attack and pinch-hit in the ruck.\nWhere could she go?\nThere are a number of clubs in the hunt for a key defender, but with Carlton more likely to land Scholz, the Western Bulldogs at seven could be where Riggs lands. Geelong also an option with its second selection in the first round.\nELLI SYMONDS\nPosition: Utility\nHeight: 178cm\nFrom: Victoria, Dandenong Stingrays/Frankston\nSomewhat of an unknown quantity after the first half of the year decimated by an ankle injury, but her upside is enormous. Nominally a ruck/forward, clubs believe she has the potential to become a powerful inside midfielder, given her speed and agility. Her enthusiasm and pure vibes despite being sidelined during national academy games was noticeable.\nWhere could she go?\nAppears to sit in the 10-15 range, with both Hawthorn and Essendon having been tied to Symonds. One of those players who will suit a select number of clubs, meaning she has the potential to slide (but still get drafted) if others emerge for the Hawks and Bombers.\nLAVINIA COX\nPosition: Midfielder\nHeight: 172cm\nFrom: Victoria, Bendigo Pioneers/Eaglehawk\nThe true bolter of the draft. A talented basketballer who has a WNBL rookie contract with Bendigo in her back pocket, Cox had played only a season of junior footy when she was young, before she was scouted by the Pioneers at a school footy game. Jumped straight into their program in 2024, and has elite athleticism. Skilful, linking player.\nWhere could she go?\nWill best suit a team that doesn't need her to play straight away, and has received attention from the top handful of clubs. Hawthorn and Brisbane at 14/15 appear most keen, while Essendon at 11 is also a possibility.\nMIA SALISBURY\nPosition: Midfielder\nHeight: 169cm\nFrom: Queensland, Gold Coast Academy/Bond Uni\nA tenacious mid-sized inside midfielder who thrives in the stoppages, and is a strong clearance player. She uses the ball well, and makes good decisions both with and without the footy.\nWhere could she go?\nThere's a suspicion that Essendon will bid on Salisbury with pick No.8, in which case Gold Coast – which will have already used 19 on Harris – won't be able to match with 27. If the bid comes at the Bombers at 11, Gold Coast should have the picks to match.\nALEXIS GREGOR\nPosition: Key forward/defender\nHeight: 181cm\nFrom: Victoria, Bendigo Pioneers/Moama\nHas done the hard yards over the past few years, travelling from Echuca to Bendigo for her footy. Last year was a write-off with two bulging discs in her back, but has rebounded well, and built into her season. Strong overhead and in one-on-one marking contests.\nWhere could she go?\nA lot of clubs are keen on Gregor in the 10-20 mark, with Richmond, Fremantle and Geelong all being tied to the Pioneer, more so for her defensive potential than forward prowess.\nSIENNA TALLARITI\nPosition: Defender\nHeight: 169cm\nFrom: Victoria, Oakleigh Chargers/Whitehorse\nA proven big-game performer, with back-to-back best-on-ground medals in the Coates Talent League Grand Final. The intercept defender reads the play exceptionally well and has a high footy IQ, with safe and calm hands overhead. Has won rave reviews for her maturity and composure.\nWhere could she go?\nFalls into the wide range from 15-30, and is more likely to sit in the \"needs based\" category, meaning some clubs with strong defensive stocks will bypass. Whoever ends up with Tallariti will have a gem on their hands.\nGRACE MARTIN\nPosition: Small utility\nHeight: 163cm\nFrom: South Australia, Woodville-West Torrens/SMOSH West Lakes\nHas the ability to play across all three lines, meaning she's received plenty of love from clubs around the country. Can win the contested footy, and is clean under pressure. Knows how to find the ball and use it well.\nWhere could she go?\nMartin is in demand, which also ups her potential draft pick spot. Likely to be in the tail-end of the first round, with Melbourne at 20 a possibility, although she may have been snaffled up by then.\nCLAUDIA WRIGHT\nPosition: Utility\nHeight: 172cm\nFrom: Western Australia, Claremont/Subiaco\nMid-sized utility who can play across all three lines, athletic and competitive. Very quick and knows how to win the footy. While separate wrist and foot/ankle issues decimated her national academy and under-18 seasons, she did manage 13 games in the WAFLW.\nWhere could she go?\nHas been in the late first-rounder bracket, given her versatility. The fact her two injuries this year were collision-based – rather than soft-tissue or structural – works in her favour.\nSOPHIE MCKAY\nPosition: Midfielder/forward\nHeight: 167cm\nFrom: Victoria, Sandringham Dragons/Prahan\nA talented midfielder who can push forward, McKay is the daughter of Carlton premiership hero Andrew and sister of current Blue Abbie. She's powerful out of the contest, a strong mark, and has been developing her craft inside 50, proving to be a steady set shot. Plays above her height.\nWhere could she go?\nLocked into the Blues. Clubs are anticipating Carlton to take another player – possibly Fish or Scholz – at pick No.5, and matching a bid for McKay with pick 23.\nOTHERS IN THE MIX TO GO EARLY\nGeorgia Knight, Victoria/Eastern Ranges. Powerful mid-sized forward with a natural eye for goals.\nGeorgie Brisbane, Victoria/Eastern Ranges. Athletic key forward who can push up the ground. Captain of the Ranges.\nZoe Hargreaves, Victoria/Northern Knights. Mid/def with plenty of speed, and a natural footballer.\nGeorgia McKee, South Australia/Central Districts. Small forward with a soccer background, who's a natural around goals.\nMaggie Mahony, Victoria/Oakleigh Chargers. Hard-working inside midfielder who loves the contested ball, elite endurance.\nClaire Mahony, Victoria/GWV Rebels. Key fwd/def who's an excellent overhead mark.\nMillie Lang, Victoria/GWS Rebels. Very steady key defender, reads play well and is a strong intercept mark.\nTaya Chambers, Western Australia/East Fremantle. Lightning-fast rebound defender with a strong kick. Likely to sit across the late first-early second band.\nTara Harrington, Queensland/Gold Coast/Bond Uni. Tough clearance midfielder who is likely to end up at the Suns, barring an early bid that can't be matched.\nHeidi Talbot, Queensland/Gold Coast/Bond Uni. Smaller utility with elite speed and agility, run-and-carry player with strong defensive traits. From Cairns. Has received plenty of attention from rival clubs in recent weeks, and a bid is on the cards.\nSarah Poustie, Victoria/Oakleigh Chargers. Helmeted midfielder who set a Combine record for the 2km, running 7.02. Reliable, well-rounded, with a wide draft range.\nLily Paterson, Western Australia/Swan Districts. Relatively new to the game, but has improved out of sight. Endurance-based mid, cool and calm under pressure.\nZoe Besanko, Victoria/Dandenong Stingrays. Ruck/fwd and Stingrays skipper, good overhead and sharp footwork from her netball background.\nHolly Ridewood, Victoria/Northern Knights. Captain with plenty of plaudits for her maturity. Winger who covers the ground and reads the play well.\nPaige Scott, Essendon AFLW. The self-delisting wildcard of the draft, it remains to be seen if the other 17 clubs will allow the dynamic forward to slide to Richmond at 31, having been in negotiations to go to Punt Road in the trade period.\nThe Telstra AFLW Draft will be broadcast live on the AFL and AFLW websites and official apps from 7pm AEDT on Monday, December 16.",
  "word_count": 2747,
  "scraped_at": "2026-02-14T13:31:17.745499"
}