{
  "article_id": "27e29023dc3a",
  "url": "https://news.yahoo.com/acc-spring-meetings-money-divide-145356985.html",
  "title": "ACC spring meetings all about the money – and how to divide it to keep schools happy",
  "date": "20230515T153000Z",
  "domain": "news.yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "ACC spring meetings all about the money – and how to divide it to keep schools happy\nThe ACC’s annual spring meetings commence here on Monday, at an oceanfront resort hotel where the most basic of rooms goes for more than $1,100 per night (an ocean view will cost more than $1,250, and almost double for a suite with a fireplace). And some will have you believe that the conference faces some kind of revenue crisis.\nIrony aside, though, expect money to be at the forefront of the discussions here throughout the next few days. How to make more of it, for one. How best to distribute it, to appease certain members who might be growing more and more dissatisfied with the growing revenue disparity between the Big Ten and SEC (the two wealthiest conferences) and everyone else.\nAmid all the money talk, the ACC’s spring meetings, back at the Amelia Island Ritz-Carlton for the 27th consecutive year, might just take on the feel of a dysfunctional family reunion. It is difficult to be unhappy in paradise, though it has become clear that some members (we’re looking at you, Clemson and Florida State) will do their best to convey their mounting frustration.\nWith ACC meetings starting Monday afternoon, here’s a primer on the most significant topics:\nRevenue, revenue, revenue\nSensing a theme here yet? As the setting of these very meetings indicate, the ACC is hardly strapped for cash. Far from it. The league, to the contrary, keeps setting revenue records; it generated nearly $580 million in the fiscal year that ended in 2021 (and undoubtedly made more last year — those figures will be released soon).\nThe ACC doesn’t have a money problem. Its coaches and athletic directors are growing more and more wealthy. Its schools — despite what they might say — have little trouble building new facilities and providing athletes with the latest and greatest accouterments. The league’s problem, though, is that it’s no longer making Big Ten and SEC money.\nThose conferences, on the strength of their football television contracts, have separated themselves financially to such a degree that the so-called Power Five might as well be a Power Two. They both generate hundreds of millions of dollars more than any other league and the disparity is only going to grow as their TV deals mature.\nThe ACC, meanwhile, will remain locked into its contract with ESPN through 2036. At the time of its origin that contract — along with the league’s Grant of Rights agreement — was praised for bringing needed stability. Now it feels like an albatross, especially to schools that might be worth more than they’re receiving.\nThe revenue disparity with rival leagues hasn’t really hurt the ACC. Yet. But what happens when Big Ten and SEC schools are making $30 million more per year than their counterparts in the ACC? What happens when that figure only continues to rise? That’s where major college athletics is headed, and that’s why the ACC is feeling more and more financial pressure.\nBut what can the league do, really? Its contract with ESPN is set. And while the ACC Network offers some growth potential, it’s not like there’s a reserve of untapped revenue opportunities out there — not the kind, at least, that’d allow the ACC to generate anywhere close to what the Big Ten and SEC are making.\nThis, though, is part of why ACC Commissioner Jim Phillips gets paid the big bucks. He has been tasked by the league’s presidents and chancellors with finding a way. And one of those ways could be ...\nUnequal revenue sharing\nEvery iteration of the ACC’s spring meetings has its Main Character topic, the one that is guaranteed to take up a lot of time behind those heavy, fancy closed doors of the Ritz’s conference rooms. For years the Main Character topic was the prospect and eventual launch of the ACC Network (the conference once snuck in John Skipper, then the president of ESPN, through a labyrinth of service hallways). Last year, that topic was dumping football divisions.\nThis year, clearly, it’s the possibility of unequal revenue sharing. As Graham Neff, the Clemson athletic director, told The State recently: “That’ll be a big topic with a lot of prep work leading into it. I expect that we’ll take a lot of time on it.”\nIndeed. It’s clear that Clemson and Florida State, whose athletic director, Michael Alford, has also been outspoken about the ACC’s financial “struggles,” favor an unequal revenue sharing model. And why wouldn’t they? Both schools, even when they’re a bit down in football, command the largest TV ratings in that sport, relative to their ACC peers. In a college athletics world in which football TV money drives all, it’s fair to reason that Clemson and FSU are the ACC’s two most valuable commodities.\nThe question, though, is how exactly does the ACC divide revenue in a way that appeases Clemson and FSU, and other schools that drive revenue to the conference, while avoiding dissension (or worse) elsewhere among the membership? And also: How would the revenue be divided, anyway, and how exactly would a school’s value be decided?\nIs it all about TV ratings in football? To what degree does on-field performance matter? And what about basketball? The men’s game has more and more become a one-month sport, in terms of national interest, though the women’s game has emerged as a viable television commodity in recent years. With college sports money so clearly driven by football, how much would basketball matter in an unequal revenue sharing model, especially in a league with such a rich basketball history?\nAnd what about North Carolina? It’s unarguably one of the nation’s foremost college athletics brands, yet not one that has delivered all that much in football. And Miami? Still a powerful football brand, yes, despite consistently underachieving over the past 20 years.\nMore in Sports\nBarcelona fans tear into several players amid Atlético disaster\nThere are endless questions surrounding the prospect of divvying up the revenue pie in unequal pieces. It’s fair to wonder, too, how unequal the share would really be between those at the top and those at the bottom. It’s unlikely that membership would agree to a scenario that’d leave one school making, say, $10 or $15 or $20 million more than another school. That just doesn’t seem feasible.\nWhat’s more likely is that a “high performer,” however that’s determined or defined, would receive somewhere around $5 million extra. And would that really make that much of a difference?\nNIL and the transfer portal\nAround this time a year ago, the ACC’s coaches and athletic directors expressed much dismay and consternation over the free-for-all nature of name, image and likeness deals and the transfer portal. Familiar cliches reverberated throughout the hallways of the Ritz: The wild west! Chaos! Unmitigated free agency!\nThere was, too, an underlying plea: Save us, NCAA! Someone, anyone, come up with some rules!\nA year has gone by and has anything changed in regard to any of this?\nWell, no. Nothing has changed.\nAnd so over the next few days we can expect to hear the familiar grumbling surrounding NIL and the transfer portal, which, yes, really has created a system akin to free agency without any kind of rules or regulation.\nBut remember, too: This is the exact system the NCAA and its member schools created, through years (decades, really) of inaction, and through a refusal to adapt and embrace the reality that their long-held rules surrounding amateurism were never going to withstand legal challenges. And now the NCAA (and its members) are again begging Congress for help.\nAs it relates to the ACC, specifically, there’s concern about keeping up with rival leagues in an NIL-driven landscape. A lot of schools in the SEC and Big Ten have larger alumni bases and, in theory, are better positioned to fund things like NIL collectives. In a system that’s basically become free agency by another name, in-demand athletes (say, the star quarterback or point guard) stand to make more money at places backed by the most resources (or the greatest number of rich boosters).\nMore than most major conferences, the ACC has a vested interest in coming up with a solution to things like tampering and pay-for-play under the guise of NIL. So far, though, conference administrators and coaches have offered nothing more than complaints, while leadership throughout college athletics — from new president Charlie Baker on down — continues to beg for Congressional intervention.\nAll of which is to say we’re likely to be right back here next year, with the same familiar grumbling.\nWhat to do about basketball\nAmid all the other bigger topics here this week — from the Great Revenue Problem to the debate over how best to divide the money to the predictable complaining about the state of college athletics — is the question of what the ACC does about basketball. And particularly men’s basketball.\nWe can debate about whether the perception surrounding ACC basketball over the past couple of years has been justified — that the conference has been historically down — and we can debate about whether the NCAA tournament selection committee got it right but facts are facts. The ACC, 15 teams deep, has only sent five teams to the tournament in each of the past two seasons. It hasn’t had a No. 1 seed in the tournament since 2019 (when it had three) and only one ACC team (Duke, in 2022) has been better than a No. 4 seed in the past three tournaments.\nYes, Miami made the Final Four this year, and both Duke and UNC did the year before that. Yes, some of the angst surrounding ACC basketball might be a little overwrought, or based on early-season results that perhaps should carry less weight in February and March. But still. The ACC of the past couple years hasn’t been close to the league’s historical standard.\nPart of that is reflective of college basketball’s overall decline. The sport, itself, isn’t close to what it was during its 1980s and 90s heyday. Even so, the ACC should have little difficulty retaining its place atop the sport, relative to its peers, and the reality is that the conference has slipped in recent years and is in the midst of something like a post-2020 malaise.\nWhat is it? The coaching turnover certainly has to be part of it.\nRoy Williams, Mike Krzyzewski and now Jim Boeheim have all retired in consecutive years. Mike Brey, also a leader among his peers, is now also gone. There’s still plenty of coaching talent to go around, what with Tony Bennett and Jim Larranaga and Leonard Hamilton, and up-and-comers like Mike Young and Steve Forbes — not to mention Jon Scheyer and Hubert Davis — but you don’t lose three members of the Naismith Hall of Fame and not miss a beat.\nThe on-court talent, too, hasn’t quite been up to standard. And the depth, so long a given in the conference, has gone missing. Last year, the ACC hosted Dan Gavitt, the NCAA’s Senior Vice President of Basketball, at these very meetings. Gavitt provided some insight into why the league only earned five tournament bids, and those in attendance praised his appearance as informative.\nAnd then, two months ago, the ACC again earned only five bids. The conference has been in such a rush in recent years to enhance and emphasize football, and with good reason. That sport, clearly, is the one that most matters to the bottom line. The one that has most mattered to the ACC, though — the one responsible for its growth; the one that allowed it to become the richest conference in the country throughout the 80s and 90s and early 2000s — has floundered.",
  "word_count": 1972,
  "scraped_at": "2026-02-14T13:09:18.078470"
}