{
  "article_id": "27f7dabf0933",
  "url": "https://www.sactownmag.com/best-of-the-city-2023/",
  "title": "Best of the City 2023 - Sactown Magazine",
  "date": "20230825T030000Z",
  "domain": "sactownmag.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Best of the City 2023\nAiry French puffs, comforting cupcakes that taste just like Grandma’s, sports legends who go the extra mile, hot hotels that breathe fresh life into historic buildings, rockin’ speakers made from retro lunchboxes, and a whole bunch more. What’s old is new and what’s new is newsworthy in our annual list of the local people, places and things that have caught our eyes and captured our imagination this year.\nBest Mid-Century Modern Design For an Iconic Water Tower\nWhen Cal Expo’s soaring water tower was built in the 1960s, the task to design the art for the 152-foot-tall landmark structure fell to Barbara Stauffacher Solomon, a noted San Francisco designer known for her oversized “supergraphics.” (She’s best known for the modernist wall art and signage she created at Sea Ranch and, at 94, she has a large installation debuting at the San Francisco Museum of Modern Art on Sept. 16.) She says she took one look at the oval shape and knew it had to be a bull’s-eye symbol. This was the tower’s design from 1968-1990. Let’s bring this modernist marvel back!\nBest Ray of Hope\nIt was the chant heard around the NBA world over the past year. Wherever the Kings went and won, whether it was Brooklyn’s Barclays Center or Phoenix’s Footprint Center or LA’s Crypto.com Arena or, of course, the Golden 1 Center, there it was—a cacophonous chorus of “Light the Beam,” referring to the purple ray made up of six Nu-Salt Laser Space Cannons that shoot up from the top of our downtown arena after every victory. Each time the rallying cry reached our ears—which fortunately was often, thanks to an electric season that saw the Kings make the playoffs for the first time in 17 years—it made us, well, beam with hometown pride. —Elyssa Lee\nBest Little Apparel Line That’s in a League of Its Own\nThere’s no crying in baseball—or in impossibly adorable baseball ensembles. What go-getter girl wouldn’t love to step up to the bat (or onto the playground mat) wearing a retro-cool Rockford Peaches-inspired outfit by online children’s clothing maker Pistol & Arrow? With every single dress that owner Brittany Kleiss designs and crafts by hand out of her garage studio in Fair Oaks—be it one that evokes a big leaguer, a big-hearted Grinch, an intrepid Wilderness Explorer or a sweet s’more lover—she hits it out of the park. pistolarrow.com —E.L.\nBest Puffs That Go “Poof!”\nIt’s the subtlest of desserts. There are no eye-catching sprinkles or frosting. No hidden dollops of cream inside. Rather, there is only the sublime simplicity of Angela Harris’s exquisite composition of flour, sugar, cinnamon, nutmeg, eggs, milk and… butter. Lots of butter. When you bite into her French Puff muffin, it’s everything you hope for. It’s childhood, it’s comfort food, it’s your happy place. But like so many worthwhile things, it isn’t always easy to get your hands on. Not only do Harris (pictured above) and her husband Thomas—who launched Midtown Bakery in 2021—open the doors to their bite-sized shop on weekends only, there’s a better than even chance that the French Puffs will sell out in the morning. Don’t fret. Just get there early, and by the time the church bells ring at noon, you’ll already be in heaven. midtown-bakery.com —Rob Turner\nBest Frosty Adult Juice Pouch\nWhen it’s 100 degrees out, a cozy cabernet sounds as appealing as an overcoat, right? Which is why we love the Delta Freeze from Clarksburg’s Heringer Estates Family Vineyards & Winery. Akin to an adults-only Otter Pop, the wine slushy is a sangria-like red table wine and juice blend that goes down like a sophisticated summer daydream. It comes in a freezer-ready mylar squeeze pouch (think another childhood favorite, Capri Sun) that you can buy direct from the winery’s charming, rustic tasting room (a good excuse to sip on a slushy-machine-mastered cup under the shade of an old oak tree while you’re at it), or pick up at the local farmers’ market (like the ones in midtown Sacramento, Davis and Elk Grove), or better yet, get delivered by joining what is literally the region’s coolest wine club. deltafreezewineslushy.com —Hillary Louise Johnson\nBest Econo Eco Dish Soap\nWe love the idea of a zero-waste kitchen, so it was an easy decision to swipe right—with our natural fiber kitchen sponge—on Amber Raven’s Citrus Dish Soap Bar, a fragrant, honeybee-embossed, package-free cleaner that costs just $3 at midtown’s Nudge Eco Store. Amber Verdugo crafts them right here in her kitchen near Rancho Cordova too, so no sooty shipping footprint. We love the way it decorates our countertop while lathering up with as much suds as an episode of Days of Our Lives—for the same price as a standard plastic bottle of Dawn. Verdugo’s got a message for eco-industrial manufacturers: If your green cleaning products aren’t affordable, you’re chasing the wrong kind of green. nudgeecostore.com —H.L.J.\nBest Marathon Maker\nHometown phenom Sally Edwards has been medaling in life for 75 years, participating in over 250 races (the USA Triathlon Hall of Famer is pictured below at the 2007 Danskin Women’s Triathlon in Seattle), founding six companies (starting with Fleet Feet in 1976), and authoring 25 books on sports and fitness. Oh, and the decorated athlete—who counts winning the Western States 100-Mile Endurance Run among her long list of feats—just happens to have co-founded the California International Marathon. Since year one, the elite competition—which starts near Folsom Dam, ends at the State Capitol and marks its 40th anniversary this December—has ranked with top sister races in Boston and New York, further proving that whatever she decides to dip her agile toes into, Edwards definitely knows how to go the distance. —H.L.J.\nBest New Global Chocolate Emporium\nIn March, Ariel Wolansky, owner of Nevada City’s Choquiero Cacao Cafe, held the grand opening for his newest venture, downtown Sacramento’s Cafe Xocolatl, (pronounced sho-co-lottel). Dubbed a “chocolate tea & elixir communal cafe,” it offers 200 varieties of chocolates from 25 countries, including regional treats from Sacramento’s Luchador Coffee, Roseville’s Cru Chocolate, and Wolansky’s own Choquiero label. The majority of chocolate goodies—which range from bars to truffles and drinking chocolates—are vegan (indicated by green stickers on the shelves), and 100% of them are fair trade, environmentally grown and ethically sourced. There are also chocolate and tea ceremonies on-site that educate patrons about the history and health properties of their offerings, as well a kitchen that serves up savory vegetarian dishes and sweet plant-based desserts. So whether we’re in the mood for dairy-free Brazilian dark chocolate with candied cupuaçu fruit or a vegan breakfast empanada or raspberry cashew cheesecake, Cafe X marks the spot. thechocolatemarketplace.com —R.T.\nBest Four-Legged Sports Hero\nIf you hear 11,000 students chanting “Cori! Cori! Cori!” at an Aggies football game, that’s not the next Heisman Trophy winner they’re cheering on, but rather Cori the Rocket Dog, an active team member who suits up every fall to retrieve the kicker tee from the field after kickoffs. A black lab whose mom is UC Davis veterinary medicine professor Lisa Tell, Cori is a multi-sport legend who also serves as a bat girl for the school’s baseball team and halftime entertainment at basketball games. Cori will be ears up for the first home game of Davis’ new football season on Sept. 16 (check out her Instagram page @corirocketdog for other gameday announcements and pawdorable photos). Go Aggies—make that Waggies! —H.L.J.\nBest Place to Become a Cereal Killer\nRemember what Saturday mornings tasted like? At Cerealism, owner Laterica Reddix-Espinoza is serving up some sweet nostalgia in ways that would have made your 10-year-old brain explode with a sugar rush. This Instagram-worthy “cereal-themed dessert bar”—which opened in Old Sacramento last December—not only features all your favorite childhood cereals, but also blends them creatively for specialty bowls like the Cookie Monster (Oreo O’s and Cookie Crisp cereals, crumbled Oreo cookies and a Chips Ahoy cookie dunked in blue oat milk as a nod to the lovably gluttonous blue-hued namesake), or the Strawberry Shortcake (annotated above). Feeling creative yourself? Customize ingredients to invent your own candy-colored concoction. Either way, let yourself go cuckoo for Cocoa Puffs at Cerealism. You can go back to adulting tomorrow. cerealismcafe.com —Sean Timm\nBest New Murals That Celebrate a Sense of Place\nIn May, the annual Wide Open Walls mural festival once again graced our urban canvases with a multitude of magnificent new works of art (see pages 20-21 for example). But some of our favorite new non-festival murals include works that bring our region’s heritage to life. One is the deliciously buoyant piece that encircles Marie’s Donuts in Land Park, which debuted in March and was designed by Sacramento artist Karen Sue Chen (pictured). Another is the City of Trees mural at 15th and X streets, completed in April and created by the husband-and-wife duo of Buddy Norton and Shelby Lowe. And the latest work by local artists Shaun Burner and Franceska Gámez came alive in May outside the historic Woodland Opera House and honors the town’s deep cultural—and agricultural—roots. Civic pride never looked so good. —R.T.\nBest Acoustic Reuse of a Retro Lunchbox & More\nThe only place around town that you’re likely to spy a flock of Rare Bird Stereos in the wild is at the midtown farmers’ market, where Kaden Hill sells his quirky, one-of-a-kind bluetooth speakers. Hill sources unique antique containers from estate sales and flea markets, then refits them with rechargeable lithium batteries and stereo components up to high-fidelity standards. (Pro tip: If you see a speaker you like, snap it up. As the Rare Bird name indicates, once one is sold, it has flown the nest for good.) Picture a rust-patinated Orsi Olive Oil can dripping with Dean Martin’s “That’s Amore,” a well-loved Peanuts lunchbox playing “Joe Cool’s Blues,” or a vintage metal Johnson & Johnson first aid kit blasting the Beastie Boys, so you can always be ready to fight for your right to party. rarebirdstereos.com —H.L.J.\nBest Wish Upon a Star\nNot unlike the legend of Babe Ruth pointing toward the flagpole in center field at Wrigley Field and then improbably hitting a home run near that very spot in the 1932 World Series, chef Chris Barnum-Dann set an audacious goal—in 2010—of earning a Michelin star by the age of 40, and improbably achieved it. This past December, less than four months after he turned the big 4-0, his midtown restaurant Localis—which he owns with his wife Jessica Shelton-Dann—was awarded that coveted honor, becoming only the second Sacramento eatery to earn a Michelin star. Now that’s what we call a culinary home run. localissacramento.com —R.T.\nBest Space Odyssean Antarctica Doc\nThe Lake at the Bottom of the World has the avant-garde visual flair of a sci-fi masterpiece like 2001: A Space Odyssey—except that this adventure film directed by Sacramento State communications professor Kathy Kasic is 100% true. Her immersive documentary, which began streaming on platforms like Apple TV and Amazon Prime Video in February, chronicles the discovery of life more than 1,000 meters below the surface of Antarctica by a team of scientists hoping to unlock key climate findings. It’s an eloquent essay on the bravery and ingenuity of humankind and the shocking frailty of human life—as in, you don’t know loneliness until you’ve ridden out an Antarctic wind storm in a one-person tent. antarcticlakefilm.com —H.L.J.\nBest Guilt-Free Excuse for One More Round\n“Wanna grab a drink?” For the roughly one-third of U.S. adults who don’t consume alcohol, the answer is “No, thanks.” But The Teetotalist—an 18-plus nonalcoholic bar—now offers quaffable reasons to say “Hell yeah, and make it a double!” Married owners Amanda and Kathryn Altman Brincat aren’t just slinging Shirley Temples here. From the smoky, bourbon-y U-Hauler, which includes zero-proof Dromme Calm and alcohol-free orange bitters, to the summery When In Sac made with zero-proof gin, cucumber, lemon and elderflower syrup, the liquid lineup at this downtown pop-up (which hopes to open a permanent place this year) boasts thoughtfully conceived and crafted mocktails (alongside nonalcoholic wines and beers) that pack enough flavor and complexity to keep us soberly sipping all night long. @theteetotalistsac on Instagram —S.T.\nBest Hidden Spot for Lakeside Sunsets\nNothing stirs the soul quite like a sunset over water—and psst! you don’t have to drive to the coast to see an epic one: the remote Peninsula Campground—where you can watch the orange ball descend directly over Folsom Lake—is worth driving 10 miles down a winding dead-end road past the town of Cool to reach. Just about every terraced campsite boasts a waterfront view (there’s parking for day visitors too) primed for taking in the shimmering swaths of rose gold, warm swells of salmon pink, magenta sequins and blood orange shadows that dance across the brimming lake. Color us awestruck. —H.L.J.\nBest Place to Whet Your Bon Appétít\nSettle into a welcoming wicker chair in front of L’Apéro les Trois in downtown Winters and linger like a Parisian over its tasting flight of six cleverly contrived fruit and herb infusions—aka apéritifs—all based on wines from Berryessa Gap Vineyards. (L’Apéro is the brainchild of Berryessa Gap co-owner Corinne Martinez and winemaker Nicole Salengo, and James Beard Award-winning author Georgeanne Brennan, whose recipe book Aperitif won a Julia Child Cookbook Award.) These aren’t your grand-mère’s syrupy tipples. The Meyer lemon-infused sauvignon blanc is an aria in a glass with a haunting bitter finish, while the green-walnut-infused zinfandel, with tasting notes of tobacco and leather, is a deep, dusky love song for the ages. Together with a quartet of flight mates, they create one tasty symphony. laperolestrois.com —H.L.J.\nBest Downtown Devotee\nAt a time when others are turning away from downtown Sacramento, Ernesto Delgado is planting his feet and actually expanding his footprint on a long-ignored stretch of it. The civic-minded restaurateur is planning to open a new cevicheria called Octopus early next year within a stone’s throw of Cesar Chavez Plaza in the hopes of revitalizing that area, an effort that began years before the pandemic when he launched his Mexican eatery La Cosecha inside the historic park in 2017. With community leaders like Delgado—who also owns Tequila Museo Mayahuel at 12th and K, as well as Sal’s Tacos in West Sacramento and Mesa Mercado in Carmichael—raising their placemaking game, things could finally start to look up for downtown. —E.L.\nBest Seasonal Reasons to Take a Hike\nSpring, summer, fall or winter, we Sacramentans are climactically and geographically blessed with opportunities to hit the trails year-round. These four top our to-trek list in each season.\nSPRING\nSpring forward with a vigorous 5-mile loop hike at Stebbins Cold Canyon Reserve (pictured) near Winters, where the riotous wildflower superbloom in a wet year like this one proves that fire can be a force for renewal. The only indication that the hillsides overlooking Lake Berryessa burned in 2020 is the scattering of sculptural black trees poking out of a kaleidoscopic flowerscape worthy of Van Gogh’s paintbrush.\nSUMMER\nThe gently rolling 2.5-mile trek out to Spenceville Wildlife Area’s Fairy Falls in Nevada County dotted with shady oaks for occasional respite from the summer heat is just long enough to make us crave a soul-chilling, endorphin-spiking dunk in the gaspingly cold pool at the foot of a thundering, magnificent, three-tiered cascade. Talk about a mountain high. Pro tip: A breezy sun parasol beats a sweaty hat brim any day.\nFALL\nAh, sweater weather! When fall crisps the air, we like to shake out the mothballs with a hike among the changing gold and russet hues of the oaks and maples laced through the pine forests of the Empire Mine Osborne Loop in Grass Valley. Be sure to go through the visitors center to check out Maple Lane, a cathedral of autumnal colors. Oh, and wink, that might be hot spiked cider in our Yeti thermos, not water.\nWINTER\nA 4.5-mile-long scenic panorama of curving carved trail, jade-green river bends, dramatic outcroppings and luscious foliage, the Stevens Trail in Colfax used to be a gold mining toll road. Too long, steep and exposed for pleasant summer excursions, this path—which is on the National Register of Historic Places—shines in winter,when it harbors a delightful surprise at the end: shady groves of hibernating ladybugs. —H.L.J.\nBest Heart of a Baseball Champion\nAs the late Yankees great Yogi Berra once said, “It ain’t over till it’s over.” Happily, Dusty Baker found that out the hard-fought way last November when the Houston Astros leader finally earned his first World Series title as a manager, 30 long years after he was tapped to skipper the Giants in 1992 and 41 longer years after he won the championship in 1981 as a player for the Dodgers. In the ensuing champagne-soaked days, with Baker having at last grabbed the proverbial brass ring (or in this case, the 14k gold ring studded with 624 diamonds and 55 sapphires), the big question became whether or not the septuagenarian veteran would come back home to Granite Bay for good and start his much-deserved retirement. Well, it turned out that our hometown sports legend—who was lighting up the scoreboard even back in his Del Campo High School days—wasn’t ready to hang up his baseball cap just yet, and he signed a one-year contract to helm the Astros through the 2023 season. Let’s hope that the future Hall of Famer doubles the fun this fall and achieves postseason glory once more. Or to quote another Yogi Berra gem, that “it’s déjà vu all over again.” —E.L.\nBest Soft Spot for a Hard Situation\nWhen Karen Sanders and her daughter Hannah Howerton—owners of the Sacramento online gift shop Lionel’s Place—created its “Always Care” pillow in 2021, they couldn’t have foreseen the deeper meaning the pillow would take on in the wake of Russia’s invasion of Ukraine. Its compassionate message and yellow-and-blue color scheme (the colors of the Ukrainian flag) seemed to symbolize the plight of millions now in need of humanitarian aid. So, to honor the words on the pillowcase, Lionel’s Place—whose mission is “empowering kids to own their differences in a positive and intentional way”—now donates all profits from its sales to Voices of Children, a charity that provides psychological support to Ukraine’s youngest and most vulnerable. lionels.place —S.T.\nBest Peafowl Party\nSlow your roll as you pull your Sprinter van into Lake Solano Campground in Winters: The resident peacocks like to strut up and down the main loop road like it’s a runway at Paris Fashion Week, especially during their mating season, which stretches into August. If you’ve never seen one up close enough to feel the breeze when he snaps his tail feather fan, let’s just say it’s immediately clear why a flock of peacocks—the park is home to about 20 birds—is called an ostentation. Be prepared to share your campsite with these colorful cohabitants, as they may sleep in the trees above your head and awaken you with a morning floor show and mating-call concert. —H.L.J.\nBest Well-Heeled Toy Story\nWe may need to wait a little longer for Sacramento-born Lady Bird writer-director Greta Gerwig to fly back home and reach her goal of shooting three more films in the River City. But in the meantime, we have her sure-to-be summer blockbuster Barbie starring Margot Robbie, Ryan Gosling and America Ferrera (all pictured here with Gerwig, at far right, at CinemaCon in April), along with a Dreamhouse full of other A-listers. We can’t wait to be sitting pretty in pink at the movies come July 21, and when we do, there will be no rose-colored glasses required. After all, to paraphrase the hit Aqua song about the iconic tip-toed doll, “We’re Barbie girls and boys in a Barbie world. And life in plastic, it’s fantastic.” —E.L.\nBest Local Podcasts That Have the Ear of the Nation\nThere must be something in the water, because Sacramento has produced some of the most celebrated—and highly bingeable—podcasts in the country. Here are two that are making (sound) waves from coast to coast.\nEAR HUSTLE\nSacramento State photography professor Nigel Poor volunteered to also teach the art form to inmate students at San Quentin prison in 2011, but learned that they weren’t allowed to use cameras. So four years later, she and the inmates, including co-host Earlonne Woods (who is now free), created this superbly intimate and revealing podcast—which has been nominated for both a Peabody Award and Pulitzer Prize—to capture prison life in words, from the “cellie” relationship to how to keep spiders as pets.\nDISSECT\nCole Cuchna examines albums with a music theorist’s brawn and a super fan’s elan. A Spotify contract in 2018 let him quit his day job at Temple Coffee Roasters, and the Frank Ocean season—during which the podcaster dove deep into Channel Orange and Blonde—that same year landed Dissect on “best” lists in publications like Time and The New York Times. So it slays us that the Sac State grad still works out of the Crocker Village bedroom closet where he recorded the first episode in 2016. —H.L.J.\nBest Throwback Hotel Trend\nOver the past two years, three hotels have opened that are prime examples of adaptive reuse—architect-speak for preserving our architectural heritage by using some or most of the distinctive bones of historic structures to make something new. First was downtown’s The Exchange Sacramento in the 1914 California Fruit Building at 4th and J. Then the Hyatt Centric next to the Golden 1 Center rose skyward within the brick façade of the 1911 Georgian Revival-style edifice formerly known as the Hotel Marshall. And finally, this past February, a Hyatt House (pictured above) opened in the former home of the stately Eastern Star Hall—a 1928 Romanesque Revival brick structure across from Sutter’s Fort in midtown. Et voila! What once was old is gloriously new again. —R.T.\nBest Throwback Cupcakes\nHome sweet home. That’s what the Grandma’s Cupcakes at Freeport Bakery look and taste like. Which is exactly the point since, as the name suggests, these classic desserts are lovingly whisked, mixed and baked into nostalgia-inducing shape using a recipe handed down from co-owner Marlene Goetzeler’s grandmother Bertha, who would always bring over a box of her domed creations during her Sunday visits. With the treat’s comforting vanilla buttermilk base (the Land Park institution also makes a version with chocolate cake, but for us, it’s vanilla for the win), modest dollop of fudge frosting and charming constellation of multicolored sprinkles, Freeport’s honorific indulgence is love at first heart-tugging sight and heart-hugging bite. freeportbakery.com —E.L.",
  "word_count": 3749,
  "scraped_at": "2026-02-14T12:39:59.029670"
}