{
  "article_id": "27fe5c3d97b6",
  "url": "https://www.fourfourtwo.com/news/ea-fc-25-the-8-new-icons-coming-to-ultimate-team-including-buffon-bale-and-more",
  "title": "EA FC 25 : The eight new Icons coming to Ultimate Team including Buffon , Bale , and more",
  "date": "20240910T150000Z",
  "domain": "fourfourtwo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "EA FC 25: The eight new Icons coming to Ultimate Team including Buffon, Bale, and more\nThe eight new Icons coming to EA FC 25 including Gianluigi Buffon, Gareth Bale, and pioneers of women's football.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nThe new additions to EA FC's long list of legendary Icons have been revealed and EA FC 25 Ultimate Team will add some of the best footballers of all time.\nFrom arguably the best goalkeeper we've ever seen to trailblazers in the world of women's football, the eight new Icons in EA FC 25 will add to last year's huge roster of over 100 playable legends.\nWith just a few weeks until the official release of EA Sports FC 25 on September 27, here are all the new Icon player items coming to Ultimate Team.\nVIDEO EA FC 25 Upgrades: slip passes, dribbling, pass accuracy, professional fouls\nEA FC 25 Icons: 1. Gianluigi Buffon\nBuffon is as iconic a goalkeeper as they come, winning countless trophies with Juventus including 10 Serie A titles. His most famous achievement was winning the 2006 FIFA World Cup where Italy spoiled Zinedine Zidane's retirement party thanks to Buffon's heroics in a penalty shootout.\nWith 94 diving, 86 handling, 78 kicking, 93 reflexes, and 89 positioning, this 91-rated Icon will be one of the best goalkeepers in the early game. As of yet, EA hasn't revealed the Prime Icon versions of any of the players on this list, but it's fair to say Buffon will be even better when those come to packs later in the game's lifecycle.\n2. Gareth Bale\nGareth Bale as an Icon on FIFA makes us all feel old and the ex-Tottenham ace is likely to be one of the most expensive Icons this year. With 95 pace, 89 shooting, and 89 dribbling he'll dominate any left back on the pitch (Poor Maicon, one of EA FC 25's Hero cards).\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nBale had an illustrious career at Spurs before moving to Real Madrid and winning 3 league titles as well as 5 Champions League crowns. Internationally, he's known as a Welsh legend, primarily for leading his country to a semi-final in Euro 2016.\n3. Nadine Angerer\nNadine Angerer is the highest-rated new Icon in this year's game and deservedly so. Her legendary career with Turbine Potsdam and a 2007 Women's World Cup win as well as a Women's Euro title in 2013 makes her one of the most decorated women in all of football.\nWith 92 diving, 94 reflexes, and 92 positioning, she's going to be a brilliant keeper for any team and has a huge 92 overall thanks to being the only goalkeeper, male or female, to ever win FIFA World Player of the Year.\n4. Julie Foudy\nJulie Foudy won two Women's World Cups including the inaugural tournament in 1991. Throughout her career, she pushed the world of women's football to new heights paving the way for the success it would later have around the globe.\nIn EA FC 25, she's a 90-rated central midfielder with incredibly balanced stats, all but one over 80. With the Engine player trait, Foudy will be a perfect option for a 4-3-3 or any other 3-player midfield.\n5. Lilian Thuram\nLilian Thuram, France's incredible right-back won the 1998 World Cup. As an Icon in EA FC 25, he has stunning 88 pace alongside 90 defending and physical stats making for an absolute powerhouse in defence.\nExpect Thuram to be a very pricy card considering just how good his stats are for a right back. With EA IQ this year, you'll easily be able to move him further up the pitch and play a more attacking role in your team's tactics.\nHis sons Marcus Thuram and Khéphren Thuram are also in the game, so you'll be able to make a fantasy team with all three! Why not team up with your friends and have all Thurams in your Rush 5v5 team?\n6. Lotta Schelin\nThe winner of three Women's Champions League trophies with Lyon, Lotta Schelin was a prolific striker with blazing pace. In EA FC 25, she has 91 pace, 89 shooting, and 89 dribbling giving her the potential to be one of the best strikers in the game.\nSweden's all-time top scorer, she will pair up nicely in a two-striker formation with fellow Swede Alexander Isak allowing you to easily link her into an English Premier League-focused team.\n7. Aya Miyama\nWith 84 pace, 86 shooting, 88 passing, and 90 dribbling, Aya Miyama will fit perfectly into any team as a left-sided midfielder. She's most known for scoring in the 2011 Women's World Cup final and helping Japan lift the trophy, but more football fans will know her name when EA FC 25 launches later this month.\n8. Marinette Pichon\nMarinette Pichon joined Philadelphia Charge in 2002 in the 2nd ever season of the Women's United Soccer Association. While she didn't lift the trophy, she won Offensive Player of the Year and MVP thanks to 14 goals in 21 games.\nShe would go on to be France's first-ever goalscorer in the Women's World Cup and her 88-rated Icon card in this year's FC 25 has some pretty impressive stats. With 85 pace, 89 shooting, and 88 dribbling, Pichon will do a shift in any early-game team.\nWhen can we play EA FC 25?\nEA FC 25 launches on September 27 on PlayStation 5, PlayStation 4, Xbox One, Xbox Series S, Xbox Series X, Nintendo Switch, and PC. Opt for the Ultimate Edition to gain access on September 20.\nFourFourTwo will be going more in-depth with the additions to EA FC 25 in the lead-up to the game’s launch, so stay tuned for more FC 25 coverage this summer.\nMore EA FC 25 stories\nQuiz! Can you name the top 100 players in EA Sports FC 24?\n5 game-changing updates announced by EA Sports for the new EA FC 25\n5 of the biggest gameplay changes coming to EA FC 25 including EA IQ\nJohn-Anthony is most known for his tech journalism with words found in outlets such as iMore and TechRadar. He’s also a massive football fan who spends his time in perpetual hope of Scotland one day getting out of the group stage. Luckily he’s also half Italian so gets to enjoy some good old-fashioned Catenaccio whenever Scotland miss the mark.\nJohn-Anthony is a huge fan of football video games and has been playing ever since the late 90s. Whether it’s playing retro games like Pro Evolution Soccer or FIFA Street to Ultimate Team in EA FC, he’s always got a controller in his hands.",
  "word_count": 1222,
  "scraped_at": "2026-02-14T12:48:33.760064"
}