{
  "article_id": "280f2251f731",
  "url": "https://www.birminghammail.co.uk/news/uk-news/lionesss-mary-earps-issues-powerful-27575947",
  "title": "Lioness Mary Earps issues powerful 15 - word statement to Nike over kit feud",
  "date": "20230823T130000Z",
  "domain": "birminghammail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Lioness Mary Earps issues powerful 15-word statement to Nike over kit feud\nNike refused to sell a replica of Earps' shirt before the World Cup in Australia\nLionesses goalkeeper Mary Earps has hit back at Nike after they apologised for not manufacturing a replica of her shirt before the World Cup. This comes after the Lionesses lost 1 - 0 to Spain in the FIFA Women's World Cup final.\nDespite the loss, the Lionesses made history by becoming the first England team to make it to a World Cup final since England's victory in 1966. Earps managed to save a penalty during the final which gave England a chance, however it wasn't enough.\nSince then, Nike has sparked fury since it emerged that they weren't going to sell replica copies of the women's goalkeeper shirts. The decision was slammed by fans, pundits and Earps herself - who went on to personally approached Nike for an answer.\nREAD MORE: Oti Mabuse says 'just like that it's over' as fans rush to support her\nThe 30-year-old goalie still picked up the Golden Glove after keeping three clean sheets at the tournament, conceding just four times in seven matches. After Earps' heroics, Nike released a statement apologising and said they were working on \"solutions for future tournaments\".\nIt's safe to assume that this would mean Earps' shirt would become easier to buy while other national team goalkeepers also suffered the same issue at the tournament. Taking to Instagram, Earps responded to Nike's statement.\nOn Tuesday, she posted a photo on her story of the statement from Nike and wrote: \"@Nike is this your version of an apology/taking accountability/a powerful statement of intent?\"\nEarps also added another story with a link for a petition which is standing in support of female goalkeepers around the world. It has got over 90,000 signatures so far as they aim to reach the 150,000 target.\nA Nike spokesperson said over the weekend: \"Nike is committed to women's football and we're excited by the passion around this year's tournament and the incredible win by the Lionesses to make it into the final.\n\"We are proudly offering the best of Nike innovation and services to our federation partners and hundreds of athletes. We hear and understand the desire for a retail version of a goalkeeper jersey and we are working towards solutions for future tournaments, in partnership with Fifa and the federations.\n\"The fact that there's a conversation on this topic is testament to the continued passion and energy around the women's game and we believe that's encouraging.\"",
  "word_count": 428,
  "scraped_at": "2026-02-14T13:04:12.377581"
}