{
  "article_id": "281551ab2423",
  "url": "http://thepeninsulaqatar.com/article/22/01/2025/netflix-shares-soar-to-record-high-after-gaining-over-300-million-subscribers",
  "title": "Netflix shares soar to record high after gaining over 300 million subscribers",
  "date": "20250122T224500Z",
  "domain": "thepeninsulaqatar.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "CHAIRMAN: DR. KHALID BIN THANI AL THANI\nEDITOR-IN-CHIEF: PROF. KHALID MUBARAK AL-SHAFI\nThe company’s previous best was 15 million in the first quarter of 2020\nPublished: 22 Jan 2025 - 10:06 pm | Last Updated: 22 Jan 2025 - 10:09 pmIn this illustration photo taken on July 19, 2022 the Netflix logo is seen on a TV remote in Los Angeles. (Photo by Chris Delmas / AFP)\nNetflix Inc. shares soared to a record high on Wednesday after the streaming giant reported its biggest quarterly subscriber gain in history, buoyed by its first major live sporting events and the return of Squid Game.\nThe company added 18.9 million customers in the fourth quarter, according to a shareholder letter Tuesday. That was more than double what Wall Street expected and brought global subscribers at Netflix to more than 300 million. The company’s previous best was 15 million in the first quarter of 2020 - numbers driven by the onset of the coronavirus pandemic.\nThe stock soared as much as 15% as markets opened in New York, its biggest intraday gain since October 2023.\nThis is the final time Netflix will report quarterly subscriber numbers. The company’s stock has historically risen and fallen based on customer additions, but management is trying to get investors to prioritize financial metrics like sales and profit. The company reported revenue grew 16% to $10.2 billion for the quarter, the biggest gain since late 2021, and said sales will grow faster than predicted in 2025.\nNetflix will boost sales by increasing prices in its home market. The company is raising prices in the US, Canada, Portugal and Argentina, with the most popular US plan going to $17.99 a month, an increase of $2.50. Netflix is also increasing the cost of its cheaper advertising-supported plan.\nFor the year, the company projects revenue of as much as $44.5 billion, a gain of 14% from the year just ended, with an operating margin of 29%.\nShares of the streaming leader rose about 15% in premarket trading on Wednesday after closing at $869.68 in New York. That would mark the biggest gain since October 2023 if it holds when US exchanges open.\nNetflix will stop reporting subscriber figures following a surge in new customers from its crackdown on password sharing. Analysts and investors had expected the benefits from that effort to wear off by now, but Netflix just posted its single best year ever in terms of subscriber additions, netting 41 million new customers.\nThe company credited a mix of programming, including the hit movie Carry-On and the second season of Squid Game, its most popular series ever. The company said no program accounted for a majority of its additions.\nYet a boxing match between Jake Paul and Mike Tyson delivered a record number of sign-ups for one day, according to the research firm Antenna, dwarfing even Netflix’s first National Football League games. The second of those games featured a halftime performance by Beyoncé.\n\"Our newly established live programming slate has already delivered some must-watch moments,” the company wrote in its letter. \"Although our live programming will likely be a small percentage of our total view hours and content expense, we think the eventized nature will result in outsized value to both our members and our business.”\nLive programming is vital as Netflix builds out its advertising business. The company shows advertising during football and wrestling to all of its members - not just those on the less-expensive, advertising-supported tier.\nThe streaming giant got off to a slow start in advertising and has said it won’t produce material financial benefits until 2026. But it’s starting to make progress. The majority of new customers opt for advertising in the 12 markets where it is available, and the company said it would have enough scale to satisfy advertisers by the end of this year.\nManagement has eschewed buying the rights to most major sporting events, arguing they are too expensive. Yet it did license the rights to the FIFA Women’s World Cup and is seen as a potential partner for the Ultimate Fighting Championship.\n\"We’re constantly trying to broaden our programming,” co-Chief Executive Officer Ted Sarandos said during an interview with analysts after the results were announced. Netflix has had less success with video games, another new initiative.\nThis quarter, Netflix is forecasting revenue of $10.4 billion and earnings of $5.58 a share, both below the average of Wall Street estimates. Netflix has rebounded from a brief downtown a couple of years ago to post record growth while many of its peers in Hollywood have cut costs and struggled to grow.\n-\nStrong winds, blowing dust forecast from Sunday: Qatar Meteorology\n-\nMandarin Oriental, Doha celebrates dual five-star recognition at Forbes Travel Guide 2026 Star Awards\n-\nAl Attiyah, McInnes top times on Jordan Baja Prologue\n-\nHans Zimmer to perform live in Doha\n-\nDelegation from Joaan Bin Jassim Academy for Defence Studies visits QNA",
  "word_count": 823,
  "scraped_at": "2026-02-14T12:11:10.067556"
}