{
  "article_id": "2828a11d8cd0",
  "url": "https://capitalethiopia.com/2025/02/03/getting-to-know-chelseas-world-record-signing-naomi-girma/",
  "title": "Getting to know Chelsea world record signing Naomi Girma",
  "date": "20250203T150000Z",
  "domain": "capitalethiopia.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Naomi Girma is now the most expensive female footballer in the world.\nThe defender’s £900,000 move from San Diego Wave to Chelsea shattered the previous transfer record.\nBut who is the 24-year-old who was still playing college football just three years ago?\nBBC Sport takes a look at five interesting facts about the United States international.\nProud Ethiopian heritage\nNaomi Girma is the first player of Ethopian descent to represent the US women’s national team.\nShe was born and raised in San Jose, California, but her parents both emigrated to the US from East Africa in their twenties.\nHer father Girma Aweke was a refugee who fled the war there, while her mother Seble Demissie left Ethiopia to study in the US.\n“Ethiopian heritage, the culture, the food, the language, everything… the community has been such a big part of my upbringing,” Girma told BBC Sport.\n“We had a big community in San Jose. It’s always been such a big part of me. I’m very proud of where I come from, where my parents come from.”\nGirma, who speaks both English and Amharic, is proud to wear the famous Stars and Stripes shirt, while still remembering her heritage.\nShe has a passion for representation and wants to inspire the next generation.\n“A lot of times as a first-generation kid or as an immigrant kid, you don’t really see people in places you want to go, doing what you want to do, and it’s hard to dream for that,” Girma said.\n“For me, it’s really important to be clear [about] ‘this is where I’m from and this is who I am’ and for kids to see that is really important.\n“To be that example and to be that representation is really important to me.”\nStarted playing football because of her dad\nNaomi Girma inherited her love of football from her father.\nHe formed a grassroots club – Maleda Soccer – in San Jose, which is where his daughter first began playing.\n“It was just for the Ethiopian kids to get together, play soccer, hang out,” Girma said.\n“The parents would hang out on the side and it was very recreational. I always say it introduced me to the game with absolutely no pressure. It was just for fun.”\nNaomi Girma went on to play for Central Valley Crossfire, where her coach Bob Joyce encouraged her into the Olympic Development Program. She then earned a call-up to the United States Under-14s.\nFrom there she played for Pioneer High School and then Stanford University, but Naomi always credits where she started out.\n“I always felt like that first community was supporting me throughout and that always felt special to have them with me.”\nMental health advocate\nIt was at Stanford University that Naomi became best friends with goalkeeper Katie Meyer.\nThey played together for three seasons and won the NCAA national championship together in 2019.\nMeyer’s death by suicide in March 2022 led Naomi to begin campaigning for more mental health support in sport.\nThe defender, along with some of her US team-mates, has partnered with Common Goal to launch Create The Space – a movement which aims to make the football community a psychological safe environment for everyone.\n“Mental health is really important to me,” Naomi said. “I lost a friend to suicide, so that opened my eyes to the lack of resources and support that we have as athletes.\n“I really wanted to have a big movement in the soccer world at all levels and brainstorm to say ‘how can we make this better? What are actual things we can put into place to make change?’\n“It’s something that’s really important to me and something that I’ve worked really hard on.”\nInspired to ‘use voice’ by US legend Morgan\nNaomi has built a close relationship with USA legend Alex Morgan, who she played alongside at both club and international level before the 35-year-old retired in September.\nThe defender, who popped up at Morgan’s retirement media conference to ask the final question, describes the former striker as “the perfect example” of how to be a role model on and off the pitch.\n“How she’s used her platform and her voice for good – that’s something she didn’t have to do but she really took it upon herself,” Naomi told The Women’s Game., external\n“Using your voice for good and using that platform is something I’ve really taken from her.”\nNaomi says she is “really grateful I got to have a seat right next to” Morgan for club and country as it gave her an “understanding [of] how to operate at the highest level for so many years and [an] understanding [of] what it takes to do that”.\nAnd the appreciation is mutual.\n“I’ve never played with such a smart defender,” said Morgan., external “She doesn’t get herself in bad positions because of her positioning and footwork.\n“She times her tackles perfectly. She rarely has to go to ground as a defender which is very rare to see.”\nFrom rookie to star in two years\nNaomi’s rise to becoming one of the best defenders in the world has been meteoric.\nShe was rewarded for her impressive performances for her university team, the Stanford Cardinal, by becoming the first pick of the NWSL draft when selected by newly formed club San Diego Wave in 2022.\nShe then made her full international debut that year, and has quickly become integral to her national team, playing every minute at the 2024 Olympics as the United States won gold in Paris.\nHer performances on the pitch have already seen the accolades start to flood in. Here are a few of her achievements:\n- Named rookie of the year in her first season in the NWSL\n- Claimed the NWSL defender of the year award in 2022 and 2023\n- Named the USA’s female player of the year in 2023\n- Nominated for women’s player of the year at 2024 Fifa Best Awards and named in the Best Fifa women’s XI\n- Nominated for the 2024 BBC Women’s Footballer of the Year",
  "word_count": 1014,
  "scraped_at": "2026-02-14T13:19:48.028306"
}