{
  "article_id": "284a1b13c1e9",
  "url": "https://www.westernpeople.ie/your-community/local-notes-kilglass-enniscrone-utd-are-u12a-cup-champions-_arid-18491.html",
  "title": "Local Notes : Kilglass Enniscrone Utd are U12A cup champions . - Community",
  "date": "20240604T220000Z",
  "domain": "westernpeople.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It was an exciting night in Michael McGowan Park as a full house got to witness two brilliant teams go head to head in the cup final. Ballisodare Utd were the opposition for the Kilglass Enniscrone U12A team and what a game was served up by both sets of players.\nIt was end to end stuff for the full 60 minutes with both teams coming close but neither getting on the scoreboard. Extra time brought the same, chances at both ends but no goals. Onto the dreaded penalty shoot-out and thankfully this time it was the KEUFC boys who came out on top in the shoot-out lottery.\nThere was big celebrations all round as the U12 team received the cup and medals from Terry Hayes of the Sligo Leitrim Youth Soccer. Fair play to Ballisodare Utd who played brilliantly and with a bit of luck for them could have been heading back with the cup. The club extends thanks to Declan Basquel the referee who officiated a very tense game brilliantly.\nAnd just like that the season comes to an end. What a season it has been for these young lads. They finished joint top of the league winning nine out of ten games and only losing the league playoff on penalties. They bounced back from that tonight in style and got their just rewards for ten months of hard work and determination. Everyone at KEUFC is extremely proud of them.\nCongratulations to the Enniscrone Kilglass Community Games U13 boys indoor soccer team who were outstanding on Saturday, May 25, in the National Finals. They put in 2 heroic performances, beating Ulster 3-2 in the semi-final, and playing some incredible football against a strong Munster side in the final. With a score of 2-2 at full time, the match went to extra time and eventually finished up 4-2 to Munster. The lads did their area, county, and province proud. Well done to the team and management.\nThe annual lotto tickets for the 2024/25 season for the Eoghan Rua Ladies Football Club are now on sale. Tickets can be purchased online, can be arranged by messaging their Facebook page or by contacting any club member.\nTickets are €80 and include entry into all 52 weekly draws. Each week there are five €30 consolation prizes if the lotto is not won, with three €30 prizes designated to the annual ticket holders weekly. Each week the lotto prizes increases by €100. The jackpot at present is at it biggest ever - €15,100.\n100% sales of the annual tickets goes directly to Eoghan Rua Ladies only. As always your support is greatly appreciated and the club encourage all members near and far to support the main fundraiser for the 2024/25 season. By purchasing a ticket, you are supporting the club.\nThe Trocaire collection for Lent 2024 from Kilglass and Enniscrone churches amounted to €4414.27. This was a huge amount raised by a small parish and it will go to help the most vulnerable people in the world. This provides food, education, shelter, healthcare and much more for children and adults. You can still return your Trocaire box to your local church if you have not already done so.\nKilglass Enniscrone Utd FC are looking for 10 women 40years plus to play walking football (soccer) and represent Connacht in a tournament in Limerick on August 24. As the name suggests, no running, and the ball has to stay below head height. If interested contact the club or Karen on 085 1054009.\nAttention all parents, guardians, members – Kilglass Enniscrone Utd FC needs you. As they are preparing for the upcoming 2024/25 season they are looking for volunteers to step up and help them by coaching and helping with the teams.\nAs a club, they will offer each volunteer support and guidance. If you or a family member would be interested in getting involved, message the club directly. They are hoping current coaches will continue in their roles and they will do their very best to offer support to each team, and they look forward to a winning season.\nThe numbers drawn in the weekly lotto held on May 27, were 17, 29, 30 and 33. The consolation winners were Anthony and Barbara, Pat Gillespie, Feeney Family, Marie Kelly, Miriam and John Hannon. The jackpot in the latest draw which was held on Monday, June 3, was €15,200.\nKilglass Enniscrone Utd FC are delighted to host two summer camps this year. The first camp is a girls only summer camp from July 15 to 19. The club strives to promote soccer for girls. The second cam is mixed for boys and girls and will take place from August 5-8. Book early to avoid disappointment as no walk ins are allowed on the day. These camps are booked online only at https://bookings.faifootballcamps.ie/s/book-camp?CampID=a01Vg000003BaMf.\nWest Sligo Athletics Club are delighted and very excited that their 3k and 5k fun run series is back again this year. This is a fantastic opportunity for the community to get together and keep fit, families to run together and more importantly have fun. It will be a timed event but it is more about taking part, keeping fit and getting together. The next event will takes place on June 10, in Stokane at 7pm and the final event of the series will take place on June 17, in Castleconnor at 7pm. The cost is €10 per race and children are €5.\nCemetery Mass will be celebrated in St Patrick’s Cemetery, Kilglass/Enniscrone, on August Bank Holiday Weekend, Sunday, August 4, at 6pm; in Killanley Cemetery, Castleconnor on Saturday, June 15, at 8pm; in Roslea Cemetery, Easkey, on Friday, August 2, at 7pm and in Dromore West Churchill Cemetery on August 4, at 12 noon.\nThe numbers drawn in the Enniscrone combined football clubs blotto which was held on Sunday, May 26, were 24, 31 and 40. The €25 prizewinners were Martin McManus, Brendan Kelly, Rafal Wesolowski, and Angela and Sean Gaughan. The jackpot in the latest draw which was held on Sunday, June 2, in the Pilot Bar was €4600.\nKilglass Parish Community Centre in association with Sligo Sport and Recreation Partnership are continuing the Walking Wednesdays programme. It lasts about 45 mins and is followed by tea/coffee in the hub. The cost is €2 per week. For more information contact kilglasscommunitycouncil@gmail.com.\nIf you need a quiet place to work uninterrupted, Kilglass Hub is a brand new warm, peaceful facility, which is served by high-speed broadband. The first day is free and the following is the price list; day pass €15; 4 days per month €45; 8 days per month €70; 12 days per month €90; unlimited per month €130; dedicated workstation €180. There is a flexible base for corporate membership whenever a team need a quality workspace. Annual membership is €400 for a team, which includes 25 day passes to co-working hub and 10 hours use of a meeting room. Booking is essential by emailing kilglassdigitalhub@gmail.com.\nBuggy Buddies\nThe Buggy Buddies programme with Bernie Finley, in conjunction with Sligo Sport and Recreation Partnership, meet on Wednesday mornings at 9.45am for a walk at 10am. The cost is €2 per session and the group meet at the Enniscrone Family Resource Centre. There will be indoor activities in the centre if conditions are too wet. All are welcome to come and join for a walk, a cuppa and chat.\nThe Wavy Crafters are a group of ladies who meet every Thursday morning at 10.30am in The Courthouse, Easkey, to share their enjoyment and knowledge of all things crafty such as knitting, crochet and sewing. Call 086 3153851 for further details.\nA hot desk facility is now available at Unit 3, Castlepark House, Enniscrone, with daily or weekly rates. It is located in an ideal location, close to the Castlefield walkway and town centre. Contact Tony on 086 3098335 for further details.\nToilets in both the Hallow and at the Pier will remain open for the rest of the summer after Sligo County Council agreed a contract with a cleaning company to maintain them. Thanks has been extended to all the volunteers who helped over the winter months keeping the toilets open.\nTraining is back on Monday evenings at 8pm in Enniscrone Kilglass GAA pitch. Why not go along and try it out if you are over 25 years old. The Gaelic4Mothers&Others initiative sees women playing Ladies Gaelic Football in a fun, non-competitive and social environment. Any information required contact www.ladiesgaelic.ie.\n**************************.\nCongratulations to Rachel Jones, Castleconnor, who won a silver medal in the U16 Community Games one-wall handball finals, which was held on Sunday, May 26. Rachel had a very busy day, beating the champions from Westmeath, Cavan, two girls from Roscommon, one of which was Grace Corrigan 21-20 in the quarter-final. Rachel has never beaten Grace in any handball discipline to date, so that was a major achievement in itself. Rachel contested the final against the handballer from Dublin. She is eligible to contest this competition again next year, and she is hoping for gold.\nWell done to Adam O’Connor and Calvin Foody who also qualified for the Community Games finals, but the lads met stern opposition in their games.\nCongratulations to Ailish Quinn, Castleconnor, and Ballina Rugby Club, who was awarded the U18 Connaught Rugby Player of the Year last week.\nThe numbers drawn in the Castleconnor GAA weekly lotto which was held on Saturday, May 25, were 4, 23, 26 and 37. There was no jackpot winner. The lucky dip winner of €50 was Johnny Flynn. The jackpot for the latest draw which was held on June 1, was €21,800.",
  "word_count": 1608,
  "scraped_at": "2026-02-14T12:47:56.166678"
}