{
  "article_id": "284f49793fde",
  "url": "https://www.masslive.com/tv/2025/03/where-to-watch-ole-miss-vs-ucla-sweet-16-womens-march-madness-free-live-stream.html",
  "title": "Where to watch Ole Miss vs . UCLA Sweet 16 : Women March Madness free live stream",
  "date": "20250329T013000Z",
  "domain": "masslive.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The second Sweet 16 matchup in Regional 1 Spokane of the 2025 NCAA Women’s Basketball Tournament sees the 1 seed UCLA Bruins going against the 5 seed Ole Miss Rebels at Spokane Arena in Spokane, Wash. on Friday, March 28.\nThe game is scheduled to start at 10 p.m. EDT and will be broadcast on ESPN. Fans looking to watch this college basketball game can do so by using FuboTV, which offers a free trial and up to $30 off your first month, or DirecTV Stream, which also offers a free trial. SlingTV doesn’t offer a free trial but does have other promotional offers available. ESPN+ plans are currently at $11.99 a month or $16.99 a month if you bundle with Hulu and Disney+.\nThe Bruins had a pair of blowout wins in the first weekend of March Madness to get to this spot.\nOle Miss won big in the First Round, and then had a 69-63 matchup with Baylor in the Second Round.\nWho: 5 seed Ole Miss Rebels vs. 1 seed UCLA Bruins\nWhen: Friday, March 28 at 10 p.m. EDT\nWhere: Spokane Arena in Spokane, Wash.\nStream: FuboTV; Sling; DirecTV Stream; ESPN+\nBetting: Check out our MA sports betting guide, where you can learn basic terminology, definitions and how to read odds for those interested in learning how to bet in Massachusetts.\nWhat is FuboTV?\nFuboTV is an internet television service that offers more than 200 channels across sports and entertainment including Paramount+ with SHOWTIME. From the UEFA Champions League to the WNBA to international tournaments ranging across sports, there’s plenty of options available on FuboTV, which offers a free trial and up to $30 off the first month for new customers.\nWhat is DirecTV Stream?\nDirecTV Stream offers practically everything DirecTV provides, except for a remote and a streaming device to connect to your television. Sign up now and get three free months of premium channels including MAX, Paramount+ with SHOWTIME and Starz.\nWhat is SlingTV?\nSlingTV offers a variety of live programing ranging from news and sports and starting as low as $20 a month for your first month. Subscribers also get a month of DVR Plus free if they sign up now. Choose from a variety of sports packages without long-term contracts and with easy cancelation.\nWhat is ESPN+?\nESPN+ is a one-stop shop for content from almost every single sport. In addition to on-demand replays of games across all sports shown on the ESPN and Disney family of networks, there is also exclusive access to select college football games, NHL games, soccer matches, UFC programs and the entire 30 for 30 catalogue. Additionally, there is ESPN+ exclusive original programing like NFL Primetime, Dana White’s Contender Series and The Breakdown with Peyton and Belichick. You can stream ESPN+ on your phone, tablet, smart TV or gaming console for $11.99/month or bundle with Disney+ and Hulu for just $16.99 per month.\nRELATED CONTENT:\nMarch Maddening? Timing of transfer portal opening can be tough on coaches still in the tourney\nBy DOUG FEINBERG AP Basketball Writer\nBIRMINGHAM, Ala. (AP) — Coaches still playing in the NCAA Tournament are having to split their time between preparing their teams for the Sweet 16 and talking to potential transfers who have entered the portal.\nSuch is life in college basketball.\nDawn Staley is one of those coaches, and she said it’s a huge challenge.\n“I think the timing is all screwed up. It really plays on your ability to compartmentalize,” the South Carolina coach said Thursday. “If you aren’t — I mean, most coaches are, but if you are not really good at it, it can sidetrack you. But for us, the main thing, the main thing at this point is trying to win another national championship.”\nThe portal opened Tuesday and 595 women’s basketball players entered in the first 24 hours, according to the NCAA. That’s 2 1/2 times more than the 233 players that entered in the same time frame last year. There were 757 men’s basketball players in the portal in the opening 24 hours this year which also was more than double last season.\nThis is the first year that the portal opened up this week. Last year, it opened a day after the NCAA Tournament selection show.\nAs of Friday morning there were over 1,000 women’s basketball players in the portal. One name not in the portal yet, but entering soon is Florida State guard Ta’Niya Latson, who led all Division I players in scoring this season. Her representatives at Klutch Sports Group confirmed to The Associated Press that she was exploring her options to transfer. Latson’s decision was first reported by ESPN.\nThe portal has exploded over the last few years with NIL money becoming a major reason for players to transfer.\n“A lot of kids are leaving because of it, but at the same time, I feel like you have to follow your heart instead of the money,” said guard Te-Hina Paopao, who landed at South Carolina as a transfer last year from Oregon. “Just be able to have fun with the game and create those relationships that I’ve created, and just be able to fall in love with the game again, and continue to play the game that you love.”\nPaopao isn’t alone in her sentiments.\nSedona Prince, who transfered twice in her career starting at Texas before going to Oregon and now TCU, feels that players shouldn’t just be after getting the most NIL money.\n“I would say in this new era, I mean, right before (revenue) share and stuff, don’t go for the money,” Prince said. “It’s just going to fail. I know a lot of kids are trying to get paid, as they should. That’s how it should be. That’s how it always should have been. But be very smart.”\nMaryland forward Saylor Poffenbarger started her career at UConn before transferring to Arkansas and then the Terrapins. She knows all too well about how the transfer portal works.\n“When I went into the portal the second time, I had to pick the things that were important to me,” she said. “It’s kind of it’s crazy. It’s hectic. Everyone throwing numbers, everyone’s throwing this, everyone throwing that. You kind of just have to stay true to you and ... pick a school that aligns with your morals because at the end of the day, you’re you and the school’s not changing for you when you enter them.”\nWhile students enter the portal when their season is over, the current timing makes it difficult for the roughly 10% of programs still playing.\nOne problem is currently there’s no better time for the portal to open.\nThe Student Athletic Advisory Committee agreed to lessen the length that the portal was open from 45 days to 30, which allowed to change the timing to this year’s date. Some coaches wanted a close date no later than May 1 because of final exams and summer school enrollment so that players could be eligible at their new school.\nWith the 30-day window and May 1 deadline, the portal had to open before the Final Four ended.\nSo Staley and the other coaches in the Sweet 16 are having to multi-task even more than usual.\nIf players don’t understand that Staley may not have all the time to recruit them right now because the Gamecocks are trying to win a championship, then they might not be the right fit for the program.\nStaley said she was going to call a few players after finishing with her media obligations on Thursday.\n“You still have to do it. Yes, I’m going to call somebody when I leave here. A few people. Just because you got to let them know, ‘Hey, we’re thinking about you,‘” she said. “We got this run we’re trying to (finish) but you are a priority for us.”\nUCLA coach Cori Close has noticed another problem with the timing of the portal opening: Schools now are quicker to fire and hire coaches before the portal opens so they don’t get behind.\n“I think we have been rushing hires so that we could get people in place before the portal, which has distractions from their current teams,” she said. “I am going to be advocating in the offseason that we make another shift.\n“I don’t think it’s in the best interests of our game and the best interests of our kids and the best interests of our coaches to have that being a distraction in the most magnified time.”\n___\nAP Sports Writer Anne M. Peterson in Spokane contributed to this story.\nThe Associated Press contributed to this article\nMore sports, gear and tickets\n- Where to stream Rising Stars Challenge and HBCU Classic live today\n- Where to watch NBA Celebrity All-Star Game today free\n- How to buy tickets to NBA All-Star Weekend: Celebrity Game, Rising Stars Challenge, All-Star Saturday Night, NBA ASG\n- Where to watch USA women’s hockey game today free\n- 2026 Olympics: How to stream Canada men’s hockey game today live",
  "word_count": 1512,
  "scraped_at": "2026-02-14T12:49:14.281924"
}