{
  "article_id": "28517cf40eed",
  "url": "https://www.mirror.co.uk/tv/tv-news/inside-life-homes-under-hammer-33850851",
  "title": "Inside life of Homes Under The Hammer star Dion Dublin from music to family heartache",
  "date": "20241009T093000Z",
  "domain": "mirror.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Inside life of Homes Under The Hammer star Dion Dublin from music to family heartache\nDion Dublin is best known for his football career, which saw him star for the likes of Manchester United and Aston Villa, but he has become a familiar face on TV\nTV pundit and former football star Dion Dublin has been a well-known figure on our television screens. The 55-year-old made a mark during his prime as a leading striker for Aston Villa and Manchester United and even played for England.\nAfter hanging up his boots, Dublin transitioned seamlessly into working in TV and the media, becoming a staple on BBC Sport presenting shows such as Football Focus, Final Score, and Match of the Day. His move to daytime TV hosting Homes Under The Hammer in 2015 caught many off-guard, yet he quickly endeared himself to audiences alongside presenters Martin Roberts and Martel Maxwell.\nAway from his TV work, the ex-Celtic forward leads a quite life in Merseyside with his family and may be banging his musical Dube every now and then. But what else do we know about his life away from TV?\nEarly life and career of Dion Dublin\nBorn in Leicester, Dion is the youngest of the five Dublin siblings, with his parents coming to England from the West Indies as part of the Windrush generation. His late mum Rose worked as a district nurse while dad Eddie had the option to be a professional footballer.\nDion said: \"At one point, my dad had a choice whether to sign pro-forms for Fulham or go on tour. That was the choice. Go professional or go on tour as a bass player with Rod Stewart. It was a pretty amazing choice to have. He chose to go on tour with Rod Stewart. Music was closer to his heart.\n\"We all play music. I play percussion, my mum, when she was alive, played the mandolin and we've got Clem who plays lead guitar. Eddie plays drums, Ash, my eldest brother is a bass player and Carmen used to play the keyboards.\n\"I think if I'd taken up percussion earlier I might have gone for it... Percussion is my passion when it comes to music, and it's something that's come straight down from Mum and Dad.\"\nDion ultimately chose a career in football and joined Cambridge United where he later signed for Manchester United and established himself as one of the Premier League's best strikers at Coventry City and Aston Villa.\nHis career also included stints with Millwall, Leicester City, Celtic, and finally Norwich City. Dion earned four caps for England but missed out on the 1998 World Cup squad to Les Ferdinand.\nInside Dion Dublin's TV career post football retirement\nAfter hanging up his boots, Dion Dublin followed many of his former teammates into punditry, making appearances on Sky Sports and BBC. He covered domestic and Champions League football and later presented 606.\nDublin is a regular feature on Football Focus, Final Score, Match of the Day and provides co-commentary on many live FA Cup games. Beyond football, he reached the final of Celebrity MasterChef in 2021.\nAfter appearing on TV and radio as a football pundit, Dion shocked many when he joined BBC's Homes Under the Hammer. He joined the flagship show in 2015 in what was then seen a a very strange move for the former Premier League striker.\nHowever, he has established himself on the presenting line-up and become a fan favourite. He went viral on social media when a user compiled clips of him often pointing out the stairs that lead to the property's bedrooms.\nDion Dublin's quiet home life with family\nAway from the cameras, Dion enjoys a quiet family life with his wife Cheryl, whom he married in 2017, and their daughter Ruby Roseanne. The family of three loves to travel together, sharing snaps on Instagram of their adventures, from dining out to visiting an alpaca farm and cheering on the Women's World Cup.\nDion and his family relocated to Merseyside to be closer to Cheryl's family, who come from Wirral. He has spoken highly of his new life in the region, telling the Liverpool ECHO: \"We uprooted here just over a year ago. It's a lovely place, the people are great, normal and courteous. Nobody wants anything from you.\"\n\"There's obviously the odd picture or autograph, but that's just par for the course and nobody is ever rude. I've got a lot of time for it here and the city is brilliant. I've got no qualms with the place and I absolutely love it.\"\nDublin, who spent two years playing for Manchester United, confessed that things can get a bit tense when the team plays against Liverpool FC, which happens to be Cheryl's family's favourite. He quipped: \"They're all Reds so we watch Liverpool vs Man United in separate rooms.\"\nBeyond football, Dublin has also developed a fondness for the local cuisine in Merseyside. Speaking about his preferred foodie spot, he said: \"A place I go to a lot is the Seafood Shack. It's an outstanding place. The fish is insane there. \".\nHeartbreak over loss of \"amazing\" sister\nDion is incredibly close to his loved ones and devastatingly lost the 'heartbeat and backbone' of his family in July 2022.\nHe shared the news his \"amazing sister Carmen\" had sadly passed away by posting a photo of himself alongside his late sibling and his three brothers, Eddie, Clem and Ash, with the message: \"Yesterday we lost our amazing sister Carmen, the heartbeat and backbone to our family. Our hearts are truly broken, we will be lost without you.\"\nDion previously told the Mirror about the close bond he shares with his family and recalled treasured memories of their time together.\nDion Dublin's musical invention and love of music\nThe ex-Coventry City and Aston Villa star has turned his talents to music and unveiled an unique percussion instrument named 'The Dube'. This innovative creation boasts four playable sides, each emitting distinct sounds, and comes in a range of sizes including both acoustic and electro-acoustic models.\nDescribed as a hybrid between a Djembe and a Cajon, the striker-turned-musician told Vice about his invention: \"The Dube is a proper thing. A lot of people don't think it is because it looks like a wooden box which it is but it's turned into a very intimate, well made percussion drum with a very serious sound and serious contribution to percussion and drumming.\n\"People need to give it a go and find out. Once people realise, it'll start to break down the doors of distribution companies. I'll put my hand on my heart, I'll continue until I've made this a successful venture.\"\nThe Dube now has its own website and Dion regularly provides demonstrations and markets the instrument.",
  "word_count": 1135,
  "scraped_at": "2026-02-14T13:40:49.189661"
}