{
  "article_id": "2866f85f6fe6",
  "url": "https://www.bbc.com/sport/football/articles/crl922lyzj9o",
  "title": "Man Utd 0 - 3 Lyon : Humbled by Lyon - but key lessons learned",
  "date": "20251211T004500Z",
  "domain": "bbc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Man Utd humbled by Lyon - but key lessons learned\n- Published\nManchester United were given a demonstration of what it takes to be Europe's best on Wednesday night - but manager Marc Skinner hopes his side will learn from it.\nLyon, the record eight-time Women's Champions League winners, were far superior in their 3-0 win at Leigh Sports Village.\nNo shots on target, and a single touch in the opposition box in a difficult first half, it was a humbling night for United, who are competing in their first European main draw.\nBut Skinner, whose side had already secured a play-off spot for the knockout stage, said: \"I am proud of the players. There was a lot of learning. Every one of our biggest defeats, we will always come back better.\n\"These players are maxing. You don't want to lose a game but you have to learn from it. It feels horrible but you have to live within the performance parameters.\n\"We have already qualified. That was a goal of ours, it must be a goal of ours at Manchester United to go through.\"\n'The plan was to be physical'\nOn the night, there were several reasons why Lyon - who are joint top in the standings on 13 points with Barcelona and scored late twice through Melchie Dumornay - stood out.\n\"In the first-half we gave them too much respect. They've got a cheat code, [Dumornay] just presses a button and wraps it into the top corner,\" added Skinner.\nLyon's greater squad depth was obvious, Haiti international Dumornay was unstoppable and Skinner's selections didn't pay off.\nHe opted for physicality, leaving star players Ella Toone and Jess Park on the bench, as well as integral midfielder Julia Zigiotti.\nLyon's dominance was so evident at half-time that Skinner had to adapt sooner than he had hoped, bringing that trio on at 1-0.\nThey made a difference as United carried more threat and were able to control more possession - but Lyon's victory was confirmed when Dumornay netted her late goals with moments of individual brilliance.\nAsked why he left out some of United's best players from the starting XI, Skinner said: \"You can lose a game against Lyon on set-pieces and physicality so we had to have balance. We have four games in 10 days, so we had to be able to rotate.\n\"There has to be a plan ahead of all the games. The plan was to be physical and then always adapt it and change it in the second half.\n\"We probably didn't get enough pressure on them in moments in the first half. I adapted it at half-time and we got some more ball retention.\n\"But don't forget, we are playing a team that is expected to win the Champions League.\"\n'Where we finish is a bonus' - United's potential route\nSkinner's reminder of Lyon's ability cannot be ignored as they boasted a side including 2018 Ballon d'Or winner Ada Hegerberg and USA World Cup winner Lindsey Heaps.\nLegendary France centre-back Wendie Renard was an unused substitute and elite players such as Lily Yohannes, Kadidiatou Diani and Marie-Antoinette Katoto all came on in the second half.\nThat quality and the \"speed and physicality\" were the differences on the night, according to Skinner, but he also recognised the gap between United and Europe's elite.\n\"Theirs is the upper echelon of that,\" added Skinner. \"They pay for it. They have grown in experience and have built that team over a long period of time.\n\"The reality is you have to be at your game in every moment because if not, they can take their opportunities. They were the better team - but I would expect them to be.\n\"It's a juxtaposition because I don't want to lose games. But we also have to take a moment and go, we've already qualified, let's see where we go.\n\"All the things you see, I see. I also know what the fix is, but you can't do it in one moment, you have to build it. We are progressing.\"\nLyon boss Jonatan Giraldez described United's season as \"super positive\" and said the answer to progress is about building a mentality to be better than the day before.\nUnited's challenge will only get greater as they look to continue their journey in the Champions League.\nThey currently sit ninth in the 18-team league table and occupying an unseeded position for the play-offs.\nIf they can climb at least one place, they will be seeded and avoid stronger opposition.\nSkinner said that gives them more incentive to perform in their final league phase match against sixth-placed Juventus on 17 December - but just getting to this stage has been an achievement.\n\"When you go into the knockout stages, it is what it is. You have to play the best teams,\" he added.\n\"We go [to Juventus] with confidence to try to win the game and see what happens. Our objective was always to qualify and we have done that. Where we finish is a bonus.\"\nBen Haines, Ellen White and Jen Beattie are back for another season of the Women's Football Weekly podcast. New episodes drop every Tuesday on BBC Sounds, plus find interviews and extra content from the Women's Super League and beyond on the Women's Football Weekly feed",
  "word_count": 887,
  "scraped_at": "2026-02-14T12:44:09.255270"
}