{
  "article_id": "28678a78c9df",
  "url": "https://kaieteurnewsonline.com/2025/11/30/guyanas-franchise-director-withdraws-from-miss-universe-amidst-2025-pageant-controversy/",
  "title": "Guyana Franchise Director withdraws from Miss Universe amidst 2025 pageant controversy",
  "date": "20251130T073000Z",
  "domain": "kaieteurnewsonline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Latest update February 11th, 2026 12:35 AM\n- ‘Guyana still ranked among corrupt nations’ …flagged for intimidation of independent media, civil society\n- ‘Critic’s company blacklisted’ – Agriculture Minister\n- Cuba says airlines can no longer refuel on the island as U.S. blockade deepens energy crisis\n- Pensioner killed as boats collide in Pomeroon River\n- Five years on… Gas-to-Energy Project 68% complete\nNov 30, 2025 News\n(Kaieteur News) – Miss Universe 2025 has captured global attention not only for the excitement of crowning a new queen but also for the wave of controversies surrounding it. The 74th edition, held in Thailand, has sparked widespread conversation — from Anne Jakrajutatip’s resignation as director of JKN Group, to Miss Germany giving up her crown, to Nawat Itsaragrisil’s insult toward Miss Universe Mexico, and even the resignation of two judges.\nAmidst the drama, Guyana’s Universe National Director and Miss Universe Ghana Co-Director Teri Brown Walker announced her withdrawal from the pageant. In a statement released last weekend, Brown- Walker explained the reason for her decision.\nIn a strongly worded statement, the former pageant director noted that after an extraordinary journey, she was ready to announce her immediate withdrawal as National Director for Universe Guyana and Co-Director for the Universe Ghana franchise.\nShe said “Serving in those roles has been my deepest honor. I will forever cherish the pure and meaningful moments from my tenure, choosing to forgive those that were not. My guiding principle throughout this journey has remained: “A woman who stands for nothing will fall for anything.”\nMs. Brown-Walker noted that the difficult decision comes amid ongoing concerns about transparency in the selection process.\nShe continued “Rising and inconsistent franchise fees that burden smaller countries, and Challenges with organational management. What became truly untenable was when democracy and free will were replaced with threats, restrictions, and pressure to choose between the Miss Universe and Miss Cosmo systems-without regard for my financial and business commitments. This was both disheartening and unfair.”\nDespite these obstacles, the businesswoman said her commitment remained clear.\n“I chose to send a Cosmo delegate to Vietnam just as freely as I sent a delegate to Thailand for Miss Universe. My decisions were guided not by fear coercion, but by integrity and respect for the women [Miss Universe Ghana, Miss Universe Guyana and Miss Cosmo Guyana] who represent both brands, Pageantry shout be about opportunity, dignity, and empowerment not intimidation. My hope is that by standing firm, I can help preserve those values for the future. My love for pageantry and the values of the old Miss Universe organization -where every voice mattered will always remain in my heart. Even during my journey with kidney cancer.\nThe pageant director noted too that despite the controversy surrounding the Miss Universe franchise, she remains dedicated to this industry.\n“My decision to remain with the Miss Cosmo organization in 2026 is one I continue to reflect on deeply, It is important to me that this choice remains mine alone, made freely,” she said.\nMeanwhile, the pageant continues to reel from drama. In addition a number of title holders have renounced their positions citing the lack of transparency and allegations of corruption at the miss universe’s pageant’s organization. Here is a recap of some of the issues that surrounded this year’s competition.\nIn early June, Thai businesswoman Anne Jakrajutatip resigned from her position as president of JKN Global Group, the parent company of Miss Universe. Her departure took everyone by surprise, especially after Thailand’s Securities and Exchange Commission launched investigations into her and her sister, Pimuma Jakrajutatip.\nThe allegations involved false statements and failing to maintain proper accounting and financial records for 2023 and early 2024. As a result, Anne has made no public appearances during the Miss Universe 2025 pageant, coincidentally held in her home country.\nBefore the pageant began in early November, media access and some content creators were restricted from early activities leading up to the preliminary ceremony. Only on November 18 were they allowed to attend key events—without sharing any details beforehand. Officials noted that Miss Grand International Public Company Limited (MGI) is the official entity granting media credentials, emphasizing that Telemundo had no authority to accredit anyone for the event.\nAt the same time, controversy erupted when makeup artists sent by Raúl Rocha—president of the Miss Universe Organization and co-owner of the brand—were banned. The artists were left disoriented in Thailand, unsure how to proceed. Contestants could only receive help from makeup artists provided by the brand Chat.\n© IG: @nawat.tv\nWith Anne absent and Raúl Rocha in Mexico, Nawat Itsaragrisil was tasked with overseeing events during the concentration period, preparing everything for the final. Though he holds franchise rights in Thailand, he does not own Miss Universe. Nawat is also the director of Miss Universe Thailand and the founder of Miss Grand International (MGI).\nAttempting to bring MGI-style practices to Miss Universe, Nawat introduced a popularity contest in which ten contestants could win a special dinner with him. Under the name Top 10 Special Dinner & Talk Show with Queen Victoria and Mr. Nawat, he posted photos of more than 120 contestants on Miss Universe Thailand’s social platforms, asking the public to like and share. The ten contestants with the most engagement would win.\nWhen Miss Universe learned of this contest, the organization issued a statement distancing itself from the activity, declaring it inconsistent with the values upheld for over 70 years and forbidding its continuation. Nawat responded with a statement claiming the contest was part of their commercial agreement with Thailand.\nMiss Universe Fatima Bosch was at the center of one of the biggest Miss Universe controversies in recent memory. During the sash ceremony, tensions peaked when Nawat criticized some contestants for not promoting the dinner. He directly called out Fátima Bosch, Miss Universe Mexico, who said she needed approval from her national directors to avoid conflicts of interest. This angered Nawat, who called her a “dumb head.” Fátima defended herself, prompting Nawat to call security to remove her from the room.\nFátima left voluntarily. When some contestants attempted to follow her, Nawat threatened to remove them from the competition.\nRocha later sent a team to Thailand, including Mario Búcaro, the new CEO of Miss Universe Organization, and Ronald Day. Despite their arrival, Nawat hosted the presentation ceremony. Before the event started, Nawat held a press conference where he issued another apology through tears. Still, he never addressed Fátima directly. Shortly after his statement, traces of the controversial popularity contest disappeared from Miss Universe Thailand’s social pages. Later when Miss Mexico was crowned the new Miss Universe allegations surfaced that the entire issue might have been a set up.\nDuring the presentation ceremony, Nawat brought Emma Tiglao—Miss Grand International—to the stage. Observers highlighted his aggressive grip on her arm. Fans also disliked that MGI elements were being mixed into Miss Universe, arguing that the standards were different. Past accusations resurfaced, including claims by Rachel Gupta, Miss Grand International 2024, who resigned from the organization after alleging physical, psychological, and emotional abuse from Nawat’s circle.\nThis year’s Miss Universe competition has been met with late ticket sales amidst the controversies\nDue to the controversies, ticket sales for both the preliminary events and the final pageant, held at Impact Arena in Pak Kret, Thailand, on November 21, were significantly affected. Because of the time difference, the event will air on Thursday evening in the Americas via Telemundo.\nOnce contestants arrived in Thailand, Diana Fast, Miss Universe Germany, was noticeably absent. She chose to remove herself from the competition to stay home with her five-year-old son and spend time with her family. She said that, had she won, she would have spent a year traveling away from home.\nHer decision sparked mixed reactions: many supported her choice, while others said she should have made the decision sooner, allowing another contestant to represent Germany. The organization allowed her to keep her title without competing. To show her goodwill, Fast made donations to an animal shelter in Thailand.\nOsmel Sousa is one of Miss Universe’s largest figures. He resigned from his post earlier this year\nOsmel Sousa, known as the “Beauty Czar,” had worked with Miss Universe for over 50 years. But amid rumors of conflict, he announced his resignation at the start of the concentration. He denied disputes with the organization and said that he wanted to spend more time with loved ones.\nDuring the concentration, Inna Moll, Miss Universe Chile, sparked backlash after posting a video where she appeared to pretend to inhale white powder during a makeup session while Shakira’s “Addicted to You” played in the background.\nCritics said the video made light of drug use. Inna later apologized, claiming the idea came from a persistent makeup artist.\nHelena O’Connor, considered one of the competition’s frontrunners, withdrew from the event for personal reasons after feeling ill. Her organization confirmed she was recovering but unable to continue.\nKincső Dezsényi, Miss Universe Hungary, was hospitalized for severe food poisoning. Several contestants, including Miss Panama, Miss Honduras, and Miss Estonia, also reported similar symptoms and paused activities while recovering.\nAfter her closed-door interview, Brigitta Schaback criticized the invasive questions she was asked, saying they reminded her of a job interview where she was rejected for personal reasons. She later reaffirmed her belief that all women deserve equal opportunities and explained that her advocacy platform “Voice of Change” was born from that principle.\nWithin a day, controversies popped up again, with Harfouch resigning as a judge. He cited irregularities, specifically, a secret “improvised jury” that allegedly selected the Top 30 without consulting the eight official judges. He also denounced a conflict of interest involving judge James Irvin Healy and Miss Universe Paraguay, Yanina Gómez. Harfouch refused to participate further or to perform his music.\nFrench football coach Claude Makélélé also resigned without giving details, citing personal reasons.\nTwo new judges, Dr. Nok Chalida (Miss Thailand 1998) and musician Louie Heredia, were appointed.\nMiss Universe Jamaica, Gabrielle Henry, suffered a severe fall from the stage during the evening gown portion and was taken out on a stretcher. Rocha accompanied her to the hospital, confirming she had no broken bones but still required tests. Her participation in the final remains uncertain.\nMiss Universe Great Britain, Danielle Latimer, also tripped during her national costume performance but quickly recovered and continued.\nFátima Bosch revealed she stepped on glass in her hotel room, injuring her foot. She chose to postpone medical care until after the final.\nMiss Universe Persia 2025 exposes irregularities\nIn October, Sahar Biniaz withdrew from the pageant in solidarity with Golshan Barazesh, who was arrested during a trip to Iran. Days ago, Sahar revealed that someone within the organization told her she needed to generate significant financial gains for MUO to advance in the competition.\nThis marked her second time qualifying for Miss Universe; she previously won Miss Universe Canada 2012 but withdrew due to a hiking injury.\nSubscribe to get the latest posts sent to your email.\nYour children are starving, and you giving away their food to an already fat pussycat.\nFeb 11, 2026\nBy Clifton Ross Kaieteur Sports – Group C table-leaders, West Indies face their toughest challenge yet when they square off against an old nemesis in the English, when T20 World Cup action...Feb 11, 2026\n(Kaieteur News) – Any visit to a government office involves waiting. Not the heroic kind of waiting but the quieter, existential waiting where time stretches, your number never comes up, and you begin to suspect you may die clutching a file folder. Still, the waiting has its compensations. If...Feb 01, 2026\nBy Sir Ronald Sanders (Kaieteur News) – When the door to migration narrows, the long-standing mismatch between education and economic absorption is no longer abstract; a country’s true immigration policy becomes domestic — how many jobs it can create, and how quickly it can match people to...Feb 11, 2026\n(Kaieteur News) – I dug and searched long and hard. It took travels to Great Britain and a journey of some four hundred years back in time to locate a parliamentary Speaker to match what is going on here in 21st century democratic Guyana. Right here in Guyana and its modern version of...Freedom of speech is our core value at Kaieteur News. If the letter/e-mail you sent was not published, and you believe that its contents were not libellous, let us know, please contact us by phone or email.\nFeel free to send us your comments and/or criticisms.\nContact: 624-6456; 225-8452; 225-8458; 225-8463; 225-8465; 225-8473 or 225-8491.\nOr by Email: glennlall2000@gmail.com / kaieteurnews@yahoo.com",
  "word_count": 2100,
  "scraped_at": "2026-02-14T14:20:35.533065"
}