{
  "article_id": "2897bfc2e3ce",
  "url": "https://www.rnz.co.nz/international/pacific-news/507643/pacific-news-and-sports-in-brief-for-january-26",
  "title": "Pacific news and sports in brief for January 26",
  "date": "20240126T044500Z",
  "domain": "rnz.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "New Zealand/Pacific\nNew Zealand's health minister says he's shared his concerns about Pasifika being affected by measles to community health providers.\nDr Shane Reti said he's worried there will be an outbreak in Aotearoa this year, which could spread to Pacific nations.\nHe said he has spoken to Pasifika outreach organisation Fonua Ola about ramping up vaccination.\nDr Reti told Midday Report the government is not currently considering implementing border plans to stop the spread to Pacific countries.\nNew Zealand was blamed for the spread of the disease which caused the deaths of more than 80 people.\nPapua New Guinea - rebuild\nThe Southern Highlands provincial assembly in Papua New Guinea wants national government help to rebuild their main town, Mendi.\nThe Post-Courier reports the province's six national MPs for the first time are united for a common cause and that is to rebuilding the province for which they are seeking Port Moresby's help.\nGovernor William Powi said the \"province needs us. Although we come from different political parties, we have forged unity and we are united for the good of our province.\nThe Southern Highlands leader say they want to show PNG the true colours of Hela, Southern and Enga during the PNG games.\nThey say they are prepared to host the Games but need funding to get the infrastructure in place and fulfil a plan to spread the games to all districts.\nThe paper reports the PNG Sports Foundation saying the PNG Games will cost 150 million kina (US$61m) with an additional 50 million kina needed for accommodation.\nThe MPs say for Southern Highlands to host the Games they will need funding in full to get the necessary infrastructure in place.\nVanuatu - shortage\nThe people of Torres Islands are reportedly facing a serious shortage of medicine supplies.\nIt was reported the community relies on a single clinic in Lunhariki village on Loh Island.\nA resident who requested anonymity spoke to the Vanuatu Daily Post and said the clinic only had panadol and penicillin tablets left.\nThe people are asking the government, especially the Ministry of Health, to help.\nThe Vanuatu Daily Post contacted the Ministry of Health for comment.\nFiji - charged\nA Fijian police officer appeared in court on Monday charged with murder.\nFBC reported it is alleged the officer beat up a man in Suva earlier this month.\nHe has been advised that he has 21 days to file an alibi if he wishes to.\nThe magistrate refused bail due to the seriousness of the offense.\nThe matter has been transferred to the Suva High Court to be called again on 6 February.\nHockey - Fiji women's\nThe Fiji women's hockey 5s teams have missed out on a quarterfinal spot at the Hockey 5s World Cup in Oman.\nThey were held to a 4-all draw with Malaysia in their final group game.\nMalaysia came from behind twice to progress to the quarterfinals on superior goal difference.\nFiji bounced back to beat Zambia 6-3 in the playoff for the ninth to 16th, and will face Namibia in their next placing playoff for 9th to 12th.\nRugby - Perth 7s\nFiji and Samoa have named their teams for this weekend's Perth Sevens tournament, the first stop on the HSBC Sevens circuit.\nFiji men's coach Ben Gollings has named Waisea Nacuqu, Sevuloni Moceacagi and Josua Vakurinabili.\nManu Samoa coach Muliagatele Brian Lima has called in veteran playmaker Melani Matavao.\nFijiana women's coach Saiyasi Fuli has recalled three senior players for this weekend's tournament.\nFiji and Samoa are in the same pool in the men's competition, along with New Zealand and France, while the Fijiana are in Pool B with Brazil, Spain and France.\nThe tournament kicks off on Friday with finals scheduled for Sunday.\nWeightlifting - festival\nChampion Fijian weightlifter Raniela Rainobogi will lead a strong Fiji team to the Weightlifting Festival in Auckland next month.\nHe will also be attempting to qualify for the 2024 Olympic Games.\nFiji weightlifting head coach Henry Elder said they have a team of 13 lifters, including some new and exciting talents who will also compete in Auckland from February 20th to 25th.\nThe competition will also include the Oceania Championship for youth, junior and senior lifters, plus a Masters' Team competition.\nSoccer - Nations' Cup\nTonga Football has started preparations for the OFC Nations' Cup qualifying tournament.\nThey host Samoa and the Cook Islands in Veitongo in March, with the winner going through to the main tournamant.\nTonga Football started their squad preparation on Wednesday, calling on players who represented the Kingdom at the 2023 Pacific Games in Solomon Islands.\nSamoa and the Cook Islands finished ahead of Tonga at the Pacific Games.\nTonga finished 11th overall.\nNetball - Cook Islands\nNetball Cook Islands has confirmed that Nicol Tiaore has become the latest player to join the Singapore Super Netball League.\nCook Island News reports the young netball rep will leave for Singapore on 14 April.\nAssociation secretary Tekura Moeka'a said Singapore Netball is known for its high-profile competition.\nTiaore is one of six international players selected allocated to the six teams, injecting a global flair into the competition.\nVolleyball - Olympics qualification\nThe Vanuatu women's beach volleyball team will participate in 16 tournaments over the next four to five months, with qualification for the 2024 Olympic Games as their main focus.\nVanuatu Beach Volleyball said the team of Sherysyn Toko and Majabelle Lawac have a busy schedule travelling between Australia, New Zealand and China.\nToko and Lawac are in Australia to compete at the Queensland Championship, having won the Surfers Paradise tournament earlier this month.\nThe duo will also undergo a four day training camp in Australia under the Australian government's Pacific Aus Sports program.\nToko and Lawac are also scheduled to compete at two New Zealand tour events in mid-February.",
  "word_count": 971,
  "scraped_at": "2026-02-14T12:41:18.601176"
}