{
  "article_id": "28a556e83605",
  "url": "https://thenationonlineng.net/demehin-tips-super-falcons-to-reclaim-wafcon-title/",
  "title": "Demehin tips Super Falcons to reclaim WAFCON title - The Nation Newspaper",
  "date": "20241226T080000Z",
  "domain": "thenationonlineng.net",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sports\nDecember 26, 2024 by Tunde Liadi\nDemehin tips Super Falcons to reclaim WAFCON title\nSuper Falcons defender Tosin Demehin believes Nigeria has the right blend of players to reclaim the Women’s Africa Cup of Nations (WAFCON) holding next year in Morocco..\nThe last edition, also held in Morocco, saw the Super Falcons finishing fourth — their second worst-ever placement in the tournament’s history since they ended in the same position in 2012 in Equatorial Guinea, missing out on a medal.\nDemehin, who has become a key figure in Nigeria’s defence, highlighted the importance of the tournament to her personally and to the nation.\n“WAFCON is extremely important, not just to me but to the entire continent,” Demehin said. “I am eager to be part of the tournament and experience playing on that stage for the first time,” she told SportsBoom.\nAs the countdown to Africa’s most prestigious women’s football competition continues, the Galatasaray defender is focused on restoring Nigeria’s status as the continent’s most successful team.\n“My personal goal for WAFCON 2024 is for the team to have an outstanding tournament and to reclaim our glory,” she said. “We want to dominate African women’s football again, and I’m committed to helping us get there.”\nDemehin has adapted seamlessly to life at Galatasaray since joining the Turkish side from Reims last season, becoming a standout player for her club.\nRead Also: NFF holds match commissioners’ seminar in Asaba\nThe 21-year-old’s rise to prominence began at the 2022 U-20 Women’s World Cup in Colombia, where she shone despite Nigeria’s round-of-16 exit after a 2-0 loss to the Netherlands.\nHer performances earned her promotion to the Super Falcons, where she has cemented her place as a regular starter. She has since represented Nigeria at the Women’s World Cup and the Olympic Games.\nAs teams like Zambia, Morocco, and defending champions South Africa continue to rise in African women’s football, Demehin believes the Super Falcons can reaffirm their position at the summit.\nThe 15th edition of WAFCON will see Morocco host the tournament for the second consecutive time. Nigeria, with 11 WAFCON titles, will be aiming to reclaim the crown and reassert their dominance in Africa.",
  "word_count": 363,
  "scraped_at": "2026-02-14T12:33:59.856008"
}