{
  "article_id": "28ad418249ee",
  "url": "https://www.usatoday.com/story/graphics/2023/06/05/oklahoma-sooners-softball-college-world-series/70288157007/",
  "title": "Oklahoma Sooners softball is aiming for a three - peat NCAA title",
  "date": "20230605T210000Z",
  "domain": "usatoday.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Oklahoma softball heading into the Women's College World Series aiming for a three-peat\nThe Oklahoma Sooners, two-time defending national softball champions, are headed back to the Women's College World Series finals looking to achieve something only one other college team has done – three consecutive championship titles.\nThe Sooners are looking to match the UCLA Bruins, who won three straight titles between 1988 and 1990. A third title will be just one of the many remarkable feats for this 2023 team from Norman.\nThe 59-1 Sooners are riding a 51-game winning streak – a record that eclipsed the 47 straight wins set by the Arizona Wildcats from April 28, 1996, to March 22, 1997.\nUnder Patty Gasso, Sooner softball head coach, Oklahoma has won 11 straight Big 12 titles and has not lost a conference series since 2011.\nThe Sooners boast a deep 20-player roster, including six bench players who could likely start for any other college team in the country. It's tough to break into the Oklahoma starting lineup, where no player is hitting below .300 and four players are hitting above .400.\nOklahoma Sooners women's softball wins\nA three-peat would not only be impressive in the world of college softball. Should the Sooners claim a third consecutive NCAA title, they would join a list of other sports programs with distinguished national title runs. Other schools in modern NCAA history starting in 1970 with at least three consecutive titles:\nSource NCAA, Associated Press, FloSoftball",
  "word_count": 245,
  "scraped_at": "2026-02-14T13:48:12.131248"
}