{
  "article_id": "28c3095b9c23",
  "url": "https://sacobserver.com/2024/06/hbcus-could-be-left-out-in-the-cold-in-ncaa-profit-sharing/",
  "title": "HBCUs Could Be Left Out in the Cold in NCAA Profit - Sharing",
  "date": "20240604T084500Z",
  "domain": "sacobserver.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By Terrance Harris | Houston Defender | Word In Black\nThis post was originally published on Defender Network\n(WIB) – A seismic shift in the world of college athletics took place late last week when the NCAA Board of Governors decided to settle an old name, image, and likeness lawsuit for $2.8 billion, and the really big change was the decision to now share revenue with its Division I student-athletes.\nBoth announcements were huge for thousands of student-athletes who have been involved in a form of indentured servitude for decades. Student-athletes at Power Four schools and Notre Dame will now get to split $21 million annually beginning in the fall of 2025.\nBut the news may not be promising or lucrative for mid-major programs, FCS schools, and definitely not for Historically Black College athletic programs.\nJust when the HBCUs were beginning to understand the NIL and NCAA transfer portal phenomena, these latest decisions could push the haves and have-nots light years apart.\n“The college landscape is changing,” Prairie View athletic director Anton Goff said once the revenue-sharing model was announced last week. “You try to address one issue then two more pop up.”\n“I think we are all in the same spot of trying to figure out what it means to us because it just happened before the holiday weekend.”\nThis means major changes for most, if not all, HBCU athletic departments. The Power 4 conferences and Notre Dame will now divide $21 million of each school’s revenue among all student-athletes each year.\nThat isn’t realistic for lower Division I and FCS schools. It’s beyond possible for HBCU athletic programs like Prairie View and Texas Southern, which exhaust all revenue in expenses each year.\nSo what is left to share with the student-athletes?\n“You look at some of the mid-majors, FCS and HBCUs, right now we are like what does that really mean for us?” Goff said. “What does a revenue share look like? If you are talking about a revenue share, what revenue do we generate? We’ve got to look at all of those things.”\nRight now it doesn’t look good for HBCUs from a revenue or competitive standpoint. In the past, HBCUs have benefited from a kid like Travis Hunter at Jackson State shunning a major program like Florida State for the Tigers. There was also the chance to lure a student-athlete who was unhappy with his playing time at his SEC or Big 12 school with the promise of increased exposure and playing opportunities at an HBCU.\nBut which sounds better now: Getting on the field or sitting on the end of a bench and collecting a six-figure salary and a free education? Let’s also keep in mind that the NCAA also plans to end scholarship limits.\n“From an NIL perspective, a young man or young lady who is transferring from a Power 4 or a higher mid-major (program) then coming to the FCS, one of the first things they are asking about is what kind of NIL deal am I going to get?” Goff said. “These are things we are dealing with.\n“Then there is the class difference. Obviously, there has been talk of the Power 4 breaking away and doing their own thing and then everybody else does something.”\nThese new guidelines could also cause a class difference between FCS schools like Sam Houston State and Stephen F. Austin, which Prairie View and Texas Southern compete against for student-athletes. It could also change things within the SWAC where Florida A&M and Jackson State may have more revenue to throw around.\n“Is that going to hurt me competitively against my competitors in the conference, as well as in the area,” Goff said. “Obviously for us, we look at what all of the SWAC schools are doing but we also look at what all of the other FCS schools are doing in the state of Texas as well as Louisiana because we are recruiting against those individuals. Those are the decisions you have to make and analyze.\n“I think everybody is going to go back to their campuses, talk with their presidents, CFOs and figure out what it means for them individually.”\nBut right now, there seem to be far more questions than answers coming out. There is the macro question of do these changes mean HBCUs and FCS schools don’t come close to generating a surplus in revenue. And on a micro level, what will these changes mean for non-revenue sports and Title IX, which mandates that women’s college sports be on equal footing as the men even though most don’t come close to generating the same revenue as football and men’s basketball?\n“I’m in it every day and there is so much uncertainty,” Goff said. “I’ve been doing this for 29 years and I would say the last seven years has been a whirlwind because it is constantly changing. You look at the number of kids in the transfer portal, the NIL deals, the cost of attendance and now this, the revenue sharing.\n“You have some people being proponents of student-athletes being actual employees. You get to the point where you don’t know where this is going.”\nThis should make for interesting conversations next month when the SWAC leadership gets together for its annual conference meetings.",
  "word_count": 881,
  "scraped_at": "2026-02-14T13:12:31.170736"
}