{
  "article_id": "28c67b0cdf86",
  "url": "https://www.spokesman.com/stories/2024/jan/27/in-trumps-bitter-yearslong-brawl-with-roberta-kapl/",
  "title": "In Trump bitter , yearslong brawl with Roberta Kaplan , he keeps losing",
  "date": "20240128T051500Z",
  "domain": "spokesman.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In Trump’s bitter, yearslong brawl with Roberta Kaplan, he keeps losing\nThe meeting turned ugly fast.\nIn October 2022, Roberta Kaplan flew to Donald Trump’s estate, Mar-a-Lago, in Florida, to question him under oath in the defamation lawsuit that her client, writer E. Jean Carroll, had filed against him after she accused him of sexually assaulting her.\n“She’s not my type,” Trump said when he was asked if he raped Carroll in the mid-1990s in a dressing room at the Bergdorf Goodman department store in New York.\nThen he shrugged, looked at Kaplan and pointed at her.\n“You wouldn’t be a choice of mine either, to be honest with you,” he said, according to a transcript of the deposition. “I would not, under any circumstances, have any interest in you. I’m honest when I say it.”\nShe began another question, then paused and reminded him, “I’m an attorney.”\nThat early skirmish was part of a battle that began in 2019 when the lawsuit was filed; it culminated in a Manhattan courtroom Friday, when a jury of seven men and two women decided that Trump should pay Carroll $83.3 million for defaming her.\nIt was a clash of two New Yorkers, both of them formidable combatants and talkers, but in different ways and from different worlds.\nTrump, 77, has a libertine past, a salesman’s flair and an extraordinary instinct for insult. Kaplan, 57, an openly gay lawyer who married her wife in Toronto in 2005, is methodical and disciplined.\nBut they are both shrewd, competitive power players in their respective realms, and unusually deft at using the media. They rely on their own outsize confidence to achieve their aims, making their showdowns occasionally charged – and tinged with drama.\nKaplan has represented major corporations and won the groundbreaking 2013 Supreme Court case that granted same-sex married couples federal recognition for the first time. She has said that, as a lawyer, “I really am like a dog with a bone” – never letting go once her teeth are engaged.\nIn the five-hour deposition at Mar-a-Lago, Trump called her “a political operative,” “a disgrace.” When she asked him if he had been referring to Carroll when he said in June 2019 that people who make false accusations of rape should “pay dearly,” he said yes, smiling slightly.\n“And I think their attorneys, too,” Trump responded. “I think the attorneys like you are a big part of it, because you know it’s a phony case.”\nKaplan did not respond.\nIn the months that followed, Trump and Kaplan would hurl accusations at each other, mainly through court filings, public statements and media appearances. The trial, which began Jan. 16 in Manhattan, was a chance to see them both in a crowded federal courtroom.\nAnd it provided a preview of what this unusual year in politics and history will present to the American public. As a former president and current candidate in the 2024 election, Trump faces four criminal cases, many of them sprawling and unpredictable, which he is seizing as a stage for his attempted comeback.\nThat makes the attorneys, judges and prosecutors – people like Fani Willis, a Georgia district attorney; Jack Smith, a federal special counsel; and Tanya Chutkan, the judge overseeing the trial of his role in the Capitol attack – more than just figures in legal proceedings. Instead, Trump elevates them as opponents and tries to make them caricatures to mobilize his most fervent supporters.\nSo far, Kaplan is the only lawyer to have secured not one, but two verdicts against Trump.\n“This win is because of Robbie Kaplan and her dazzling team,” Carroll said in a statement late Friday.\nLast May, another jury awarded Carroll more than $5 million, finding that Trump had sexually abused her and then defamed her by calling her a liar.\nBefore representing Carroll, Kaplan was best known for representing Edith Windsor, the gay rights activist whose challenge of the Defense of Marriage Act was one of two landmark cases that led the Supreme Court to grant same-sex married couples federal recognition in 2013.\nBut most of Kaplan’s career has been focused on corporate law. She spent years representing clients such as the Minnesota Vikings football team, JPMorgan Chase & Co. and T-Mobile.\nA prominent voice in the #MeToo movement, Kaplan has also defended clients against accusations of sexual abuse.\nIn 2020, she represented Goldman Sachs Group when the company was sued over accusations that the bank’s general counsel had covered up sexual misconduct claims against its head of litigation.\nKaplan, a native of Cleveland, has said that she always knew she would be a lawyer: She was a born talker, sometimes to the exasperation of her family. She once recalled her grandmother telling her when she was young: “Robbie, you know I love you, but can you just be quiet for like three minutes?”\n“And I said something like, ‘No, Grandma, I can’t. I just can’t help myself. I love to talk,’ ” Kaplan said.\nTrump can’t help himself from talking, either. A son of a New York developer, he burnished his image as a playboy in the 1980s, making himself a fixture at night spots and in the tabloids. As a businessman, he exaggerated his real estate achievements, taking his mogul’s image national thanks to reality television. As president and a candidate, he belittled political opponents and demonized the media, to the delight of his followers. And when Carroll accused him of rape in 2019, he called her a liar trying to sell a book.\nAt the end of the deposition in 2022, Trump sought to diminish Kaplan, shrugging her off as a shill of the Democratic Party. He called her a friend of Andrew Cuomo’s, an apparent jab at her role in advising him when he was accused of sexual harassment during his tenure as New York governor. The entanglement prompted her to resign from Time’s Up, an organization founded to fight sexual abuse and promote gender equality.\n“I act appropriately with women,” Trump said confidently. “Let’s see how this all turns out.”\nBut during the trial, it appeared that Kaplan had upset Trump. He shook his head in court repeatedly and scoffed during her direct examination of Carroll. She watched placidly when the judge threatened to throw Trump out of the courtroom after one of her co-counsels, Shawn Crowley, complained that the former president was making derisive comments about Carroll within earshot of the jury.\nHe delivered tirades at a news conference during the trial. She never raised her voice in court but was quick to play clips of that news conference to the jury.\nOn Friday, during her closing argument, he had finally had enough.\nSeated a few feet away from Kaplan, he shifted in his chair when she said the hate that Carroll received was the inevitable result of Trump’s lies. He scoffed when Kaplan said that Trump’s lawyers had the nerve to suggest that Carroll should be grateful for the attention.\nAnd when Kaplan said that Trump acted like the rules and laws didn’t apply to him, Trump stood up and walked out of the courtroom.\nThe display of temper caused courtroom onlookers to stare in disbelief at the former president’s breach of decorum. The judge noted for the record that Trump had left.\nBut Kaplan continued her closing, focused solely on the jury and ignored the former president.\n“No matter what Donald Trump thinks, and no matter what Donald Trump says, the rules do apply to him,” she said.\nLess than seven hours later, after the verdict was read to a packed courtroom, Carroll grasped Kaplan’s hands and they nodded at the jurors. After the jurors left, the two women hugged each other tightly.\nTrump was not there. His motorcade had sped away well before the jury returned with its verdict.\nThis article originally appeared in The New York Times.",
  "word_count": 1312,
  "scraped_at": "2026-02-14T13:39:21.197313"
}