{
  "article_id": "28cfcc787c21",
  "url": "https://punchng.com/nigerian-stars-seeking-career-revival-upgrade-after-jan-transfer/",
  "title": "Nigerian stars seeking career revival , upgrade after Jan transfer",
  "date": "20250205T011500Z",
  "domain": "punchng.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "From the career-reviving moves to the step-ups, PUNCH Sports Extra’s ABIODUN ADEWALE spotlights Nigerian stars’ movement during the January transfer window\nRevivals\nKelechi Iheanacho – Sevilla to Middlesbrough\nBarely six months after joining Sevilla, Iheanacho has parted ways with the seven-time UEFA Europa League winners after struggling to find his footing in the Spanish topflight.\nNow at Championship side Middlesbrough, Senior Man, as he is fondly called is perhaps back to a relatively familiar terrain of English football, having helped Leicester gain promotion to the Premier League from the second division last season.\nAlthough he scored three goals in two cup games, the 28-year-old fired blanks in nine league matches and will hope to revive his career at the Riverside stadium.\nGift Orban – Lyon to Hoffenheim\nUncapped Nigerian forward Orban has already begun his revival in Germany after an unsettled time at French side Lyon. The 22-year-old finally got his wish and signed for German outfit TSG Hoffenheim in a €9m deal, penning a four-year contract with the Bundesliga club.\nHe has already hit the ground running with two goals in four games, both coming from the bench.\nDuring his one-year spell at Belgian club Gent, Orban scored 18 goals in 33 games, catching the attention of the Nigerian national team and bigger clubs like Lyon, and he might just be on the road to rediscovering that goal-scoring form in Germany.\nUmar Sadiq – Real Sociedad to Valencia\nEver since he suffered an injury after his move from Almeria to Sociedad in 2022, Sadiq hasn’t been able to live up to the bill of his signing in La Liga but he has now completed a loan move to another LaLiga club, Valencia with the hope of getting more playing time.\nThe 27-year-old enjoyed a productive spell with Almería, scoring 43 goals and providing 13 assists in 84 appearances before his move to Real Sociedad in 2022.\nHe has already made four appearances for Valencia across four games, scoring one goal. Hopefully, there would be more for the lanky striker.\nEmmanuel Dennis – Forest to Blackburn\nOut of the woods in the meantime, Dennis agreed on a loan deal to join Blackburn Rovers on transfer deadline day from Nottingham Forest. The 27-year-old has struggled for regular time at Forest as he is behind the likes of strikers Chris Wood and his compatriot Taiwo Awoniyi. The 27-year-old’s exclusion from Forest’s Premier League squad under Nuno Espirito Santo underlines his fall from grace since his £20m move from Watford. He spent part of last season on loan at Vicarage Road, scoring four goals in 17 Championship games before returning to Forest at the start of the 2024/25 season.\nHaving avoided the mutual termination of his contract in the summer, the striker will hope to maximise his loan deal to Blackburn to revive his career and perhaps secure a permanent move in the summer.\nChuba Akpom – Ajax to Lille\nAlthough yet to get a chance to represent Nigeria, Akpom, who again recently signified interest to play for the Super Eagles, has left Dutch giants Ajax to join Lille in the French Ligue 1 after experiencing a dip in form this season. Despite representing England at youth levels, he has switched his international allegiance back to Nigeria, hoping to earn his first senior cap with the Super Eagles.\nLille have the option to make the loan move permanent at the end of the season and the striker will also get the chance to play in the UEFA Champions League where the club are currently through to the round of 16. Hopefully, the 29-year-old would be on song in France, like he was with Middlesbrough in 2023.\nStep-ups\nFrancisca Ordega – CSKA Moscow to Al-Ittihad\nLast seen in the Super Falcons at the 2023 FIFA Women’s World Cup in Australia and New Zealand, if veteran forward Ordega can’t fight for a place again in the national team, perhaps it is time to make more money and she has now made a move to the Saudi Women’s League, teaming up with Falcons teammate Ashleigh Plumptre.\nThe 31-year-old forward recently left CSKA Moscow and has signed a two-year contract that will keep her at the club until the summer of 2027.\nDuring her time with CSKA Moscow, the dazzling winger scored 29 goals and registered 20 assists in 84 appearances.\nOrdega won the Russian Cup and Super Cup during her stint with the club.\nBruno Onyemaechi – Boavista to Olympiakos\nOnyemaechi must have attracted attention for the wrong reasons with an ill-fated Twitter post in 2024, but he has made arguably the most shocking and the least expected move by any Nigerian in the January transfer window. The Super Eagles left-back was not under the radar until he completed a high-profile switch to Greek giants Olympiakos from Portuguese side Boavista for €2.5m. His move was a no-brainer, moving from having struggled to escape relegation with Boavista to seeking titles in Greece and ultimately playing in top European club competitions.\nAkor Adams – Montpellier to Sevilla\nTo be fair to Adams, his time at Montpellier was hugely impacted by the club’s poor form and the French side didn’t hesitate to cash in on him as one of their biggest assets in January. The former U-20 international is now gearing up for a new chapter in his career after sealing a €5.5m transfer to Spanish side Sevilla from Montpellier.\nAdams made a remarkable impact in Ligue 1 after joining from Lillestrøm ahead of the 2023/24 season, scoring seven goals in his first 10 matches. However, injuries and Montpellier’s dip in form saw his goal return decline, managing just three goals in 15 games.\nHe made his Sevilla debut last Saturday as a late substitute in their goalless draw at Getafe.\nMichael Kayode – Fiorentina to Brentford\nBarely playing in Italy for Fiorentina, Italy youth international of Nigerian descent, Kayode secured a loan move to EPL side Brentford and made his EPL debut during their 2-0 defeat at home against Tottenham on Sunday, featuring for 15 minutes. The 20-year-old was born in Italy and has played for Italy at the youth level, winning the UEFA European U-19 Championship in 2023 but he is yet to get a senior team cap.\nBlessing Nkor – Gaziantep to Deportivo\nNew Super Falcons invitee Nkor has also seen her profile rise after joining Spanish women’s top division side Deportivo La Coruna. The former Sunshine Queens forward has already made her debut for the club as well. During her time in Turkey, she scored 12 goals in nine games for Gaziantep.\nChiamaka Okwuchukwu – Rivers Angels to San Diego Wave\nAmong the new generation of talented Nigerian female footballers, Chiamaka Okwuchukwu has taken the next big step in her career by joining National Women’s Soccer League side San Diego Wave for an undisclosed fee. The 19-year-old forward was a standout performer for Nigeria at the FIFA U-20 Women’s World Cup in 2024, where she scored twice.\nHer rapid rise continues, and she is already being touted as a key player for the next generation of the Super Falcons. She joins the likes of Asisat Oshoala, Uchenna Kanu and Michele Alozie as Nigerian stars in the USA’s top women’s league.",
  "word_count": 1205,
  "scraped_at": "2026-02-14T12:43:12.827754"
}