{
  "article_id": "28fe628344c8",
  "url": "https://www.fox26houston.com/news/trump-trial-live-updates-stormy-daniels-hush-money-case-may-9-2024",
  "title": "Stormy Daniels concludes testimony as judge denies defense 2nd request for mistrial in hush money case",
  "date": "20240509T234500Z",
  "domain": "fox26houston.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Stormy Daniels concludes testimony as judge denies defense's 2nd request for mistrial in hush money case\nNEW YORK - The judge in Donald Trump's hush money trial denied a second request from defense attorneys to declare a mistrial over porn actor Stormy Daniels' testimony, which concluded Thursday.\nAccording to the Associated Press, Judge Juan M. Merchan, echoing his denial Tuesday of the defense’s initial mistrial motion, said Trump’s lawyers had opportunities to object to questions that elicited what they said were damaging details about the alleged sexual encounter between the former president and Daniels.\nRELATED: Could Trump really go to jail? Does he expect to?\nFILE - Adult film actress Stormy Daniels (Stephanie Clifford) exits the United States District Court Southern District of New York for a hearing related to Michael Cohen, President Trumps longtime personal attorney and confidante, April 16, 2018, in\nDaniels spent about 7 1/2 hours on the stand over two days. The porn actor recounted, among other things, the alleged 2006 sexual encounter with the former president that she was eventually paid to keep quiet about during the 2016 presidential election.\nHere's a full recap from Thursday's testimony:\n5:10 p.m. ET: After court, Trump calls ruling ‘a disgrace’\nSpeaking briefly to reporters outside the courtroom, Donald Trump railed against Judge Merchan, who had just denied his lawyers’ requests to modify the gag order so he could respond to Stormy Daniels’ testimony, and to declare a mistrial based on what she said, the Associated Press reported.\n\"This judge, what he did, and what his ruling was, is a disgrace,\" Trump said.\n5:05 p.m. ET: Testimony concludes for the day\nMadeleine Westerhout’s testimony will continue on Friday. The judge is now sending the jury home so that he can attend to several issues the defense plans to raise, including renewing its motion for a mistrial following Stormy Daniels’ testimony.\n5:00 p.m. ET: Judge Merchan says the defense failed to raise objections during the testimony itself\nJudge Juan M. Merchan, echoing his denial Tuesday of the defense’s initial mistrial motion, said Trump’s lawyers had ample opportunities to object to questions that elicited what they say were damaging details about the alleged sexual encounter, the Associated Press reported.\n\"There were many times, not once or twice, but many times when Ms. Necheles could’ve objected but didn’t,\" the judge said.\nIn particular, the judge said, the defense should’ve objected to prosecutor Susan Hoffinger’s question about whether Trump used a condom, which led to Daniels’ response that he hadn’t.\n\"I agree. That should never have come out. That question should never have been asked and that answer should never have been given,\" Merchan said. \"For the life of me, I don’t know why Ms. Necheles didn’t object.\"\nMerchan also rebuffed the defense’s claim that Daniels’ testimony so differed from her previous accounts of the alleged events as to warrant a mistrial. \"I disagree with your narrative that there’s any new account here,\" the judge said.\n4:55 p.m. ET: Judge rejects request to modify the gag order so Donald Trump can respond to Stormy Daniels’ testimony\n\"My concern is not just with protecting Ms. Daniels or a witness who has already testified. My concern is with protecting the integrity of these proceedings as a whole,\" Judge Merchan said in denying the defenses’ request to change the order.\nAs the judge described Trump’s \"very threatening attacks\" on potential witnesses, the former president sat forward in his chair, hands clasped in front of him. Once the order was read, Trump leaned back, appearing to exhale.\n4:50 p.m. ET: Prosecution says claim Stormy Daniels changed her story is ‘extraordinarily untrue’\nProsecutor Joshua Steinglass countered said the claim that Daniels changed her story \"is extraordinarily untrue,\" though there may be details \"said in one forum and not another.\" And, he said, the defense lawyers’ claim that they couldn’t foresee what prosecutors would ask and what Daniels would answer \"is just nonsense.\"\nSteinglass said prosecutors have always contended that the details of the encounter — a two-hour conversation Daniels said she had with Trump in his hotel suite — corroborate her account that they had sex and, therefore, adds to Trump’s motivation to silence her, the Associated Press reported.\n\"If they want to offer testimony that the sex never happened, that’s their prerogative,\" Steinglass said.\nSteinglass argued the defense was trying to discredit Daniels’ allegations while precluding prosecutors from corroborating the details of the claim.\n\"They’re basically trying to have their cake and eat it too,\" he said.\n4:45 p.m. ET: Prosecutor says Stormy Daniels’ ‘messy details’ were relevant, others were held back to avoid embarrassing Donald Trump\nJoshua Steinglass argued that the \"messy details\" given by Daniels were \"Trump’s motive to silence this woman before she could tell her story.\"\n\"This is not irrelevant. Mr. Trump was aware of those details and the fact that the testimony is prejudicial and messy according to Mr. Blanche, that is why Mr. Trump tried so hard to prevent the American people from hearing about this,\" he said.\nHowever embarrassing Daniels’ testimony may have been to Trump, the prosecutor said it could’ve been worse.\nSteinglass said there were other \"salacious details\" that Daniels could have presented as corroborating evidence, which were deliberately omitted \"because we did not have the desire to embarrass the defendant.\"\nThe prosecutor offered to share those with the judge privately, saying he did not want to put them on the record.\n4:40 p.m. ET: Judge denies second request from Trump’s lawyers to declare a mistrial\nJudje Juan M. Merchan denied the defense’s renewed mistrial motion. He said after the initial mistrial motion, he reviewed his prior rulings governing Daniels’ testimony and the transcript from her first day of testimony on Tuesday. Merchan said he \"came away satisfied\" that no one had violated his guidelines.\nMerchan said Trump’s lawyers opened to door to detailed testimony about the alleged sexual encounter when they asserted in their opening statement that no sex had occurred, telling them: \"Your denial puts the jury in the position of choosing who they believe.\"\n\"The more specificity Ms. Daniels can provide about the encounter, the more the jury can weigh about whether the encounter did occur and if so, whether they choose to credit Ms. Daniels’ story,\" Merchan said.\n4:30 p.m. ET: Allowing Donald Trump to talk about Stormy Daniels would send a message to future witnesses, says prosecution\nProsecutor Christopher Conroy responded that the gag order shouldn’t be altered to allow comments about Daniels because those remarks could have a chilling effect on other witnesses — and said he’s spoken with one who was worried about the consequences of taking the stand.\nTrump, Conroy said, goes after \"anyone he deems worthy of his venom. He does it selfishly with no concern for the safety of the people he’s attacking.\"\nConroy said he’d had a conversation Wednesday night with a witness whose role was simply to authenticate some records and who was worried about the consequences of testifying.\n\"Modifying this gag order now would signal to future witnesses that they could be at risk,\" Conroy argued.\n4:15 p.m. ET: Trump’s lawyers ask judge to let him respond publicly to Stormy Daniels’ testimony in spite of gag order\nTrump lawyer Todd Blanche asked Merchan to alter the gag order so that Trump \"be allowed to respond publicly to what happened in court over the last day and a half\" with Daniels’ testimony.\nThe defense lawyer is concerned that Trump is being harmed by unchecked reporting on various claims she made about him on the witness stand, according to the Associated Press.\n\"He needs an opportunity to respond to the American people and the reasons for the gag order as it relates to Ms. Daniels is over. She’s no longer a witness,\" Blanche said.\nBlanche contends that \"this isn’t just the same story that has been going around for the last couple years. It’s much different.\"\n4:00 p.m. ET: Prosecutors no longer intend to call Karen McDougal as a witness, per Trump lawyer Todd Blanche\nTrump lawyer Todd Blanche says prosecutors no longer plan to call former Playboy model Karen McDougal as a witness.\n3:45 p.m. ET: Ex-secretary Madeleine Westerhout on why she was fired from the White House\nMadeleine Westerhout wiped tears from her eyes and asked for a moment as prosecutors turned to her exit from the White House. She said she was fired after divulging private details about the job during a dinner with reporters that she believed was \"off the record.\"\n\"I am very regretful of my youthful indiscretion,\" she said. Trump at the time said she was dismissed for saying things about his children.\nAs she spoke in court, Trump shook his head twice from the defense table.\nWesterhout went on to publish a book, \"Off the Record,\" about her time in the White House in order \"to share with the American people the man that I got to know,\" she testified.\n\"I don’t think he’s treated fairly and I wanted to tell that story\" she added.\n3:30 p.m. ET: Former secretary Madeleine Westerhout calls Trump and Melania’s marriage one of ‘mutual respect’\n\"I just found their relationship really special. He cares a lot about her opinion,\" the former aide said. \"He was my boss, but she was definitely the one in charge.\"\nShe recounted the two laughing when Melania Trump dropped by the Oval Office, checking in to see when he would be ready for dinner and Donald Trump sometimes asking Madeleine Westerhout to call his wife to let her know he’d be late, \"just like any other marriage.\"\nFrom Westerhout’s vantage point, nothing seemed to change after The Wall Street Journal published a 2018 story disclosing Stormy Daniels’ hush money deal.\nIn court, Trump looked on attentively as his former assistant gave this testimony.\n3:15 p.m. ET: Stacks of checks were FedExed to the White House for Trump to sign\nEarlier, Trump Organization executive assistant Rebecca Manochio testified about her practice of sending batches of unsigned checks to the White House via FedEx for Trump to sign from his personal account, the Associated Press reported.\nMadeleine Westerhout provided the White House perspective on that arrangement, recounting how Trump would receive packages about twice a month — some containing one check and others with a stack about a half-inch thick. The checks were often attached to invoices stating what the payment was for.\nAfter signing the checks, Westerhout said Trump would give them back to her and she’d sent them back to the Trump Organization using a prelabeled FedEx envelope.\nAt times, Westerhout said Trump would sometimes pull aside a check and ask for more information before signing. In those instances, she said she remembered Trump calling then-CFO \"Allen Weisselberg or someone else in the Trump Organization to ask for clarification.\"\nManochio had testified earlier that, to her knowledge, Trump didn’t speak to Weisselberg once he became president.\n3:00 p.m. ET: Jurors shown Trump’s contact list, including Bill O’Reilly, Serena Williams, Tom Brady and others\nJurors got a look at a redacted contact list that Donald Trump’s assistant at his company sent to Madeleine Westerhout, representing people he spoke to frequently or might want to.\nIt’s a who’s who of big names, including former Fox News host Bill O’Reilly, billionaire investor Nelson Peltz, tennis player Serena Williams, casino mogul Steve Wynn, football legends Tom Brady and Bill Belichick, and \"The Apprentice\" producer Mark Burnett.\nTheir contact details are redacted.\nCloser to home, the list included the names of some of Trump’s family members, as well as trial figures David Pecker, Michael Cohen and Allen Weisselberg.\nAnother name on the list, Fox News’ Jeanine Pirro, was in attendance at the trial earlier Thursday, watching Stormy Daniels’ testimony from an overflow room down the hall.\n2:50 p.m. ET: Trump expressed grammatical preferences for his tweets\nMadeleine Westerhout offered insight into the process of crafting Trump’s tweets while he was president. Other than Trump, she said, then-deputy chief of staff Dan Scavino was the only person authorized to post to Trump’s personal Twitter account, @realDonaldTrump.\nWesterhout said she was unaware of Scavino posting any tweets without Trump’s knowledge, testifying, \"It’s my recollection that the president did like to see the tweets that went out.\"\nWorkshopping Trump’s tweets sometimes involved Scavino dictating a draft to Westerhout, which she said she would type up and print for Trump, who would then make edits. The marked-up version would then be sent back to Scavino, and so on.\n\"My recollection was that there were certain words that he liked to capitalize. Words like country, and he liked to use exclamation points … It’s my understanding that he liked to use the Oxford comma.\" The Oxford — or serial — comma is situated just before the final item in a list.\nTrump used Twitter as a primary form of communication throughout his White House years: pushing policies, announcing major developments and attacking foes. He was suspended from Twitter, now known as X, after the Jan. 6, 2021, attack. He has since used his Truth Social platform as his primary posting vehicle despite being restored to the platform in November 2022 by new platform owner Elon Musk.\n2:40 p.m. ET: Madeleine Westerhout recounts time at the Republican National Committee\nBefore going to the White House, Madeleine Westerhout worked for the RNC. She was there when Trump’s infamous \"Access Hollywood\" tape was made public weeks before the 2016 election. She recalled the tape \"rattling RNC leadership\" and that \"there were conversations about how it would be possible to replace him as the candidate if it came to that.\"\n2:20 p.m. ET: Former Trump secretary Madeleine Westerhout takes the stand\nMadeleine Westerhout was the personal secretary to Trump from 2017 to 2019 and the former director of Oval Office Operations for the Trump White House from February to August 2019.\n2:10 p.m. ET: ‘Always get even': Tracy Menzies reads sections of Trump’s book\nProsecutor Becky Mangold is having Menzies read some sections of \"Think Big\" specifically attributed to Trump. They discuss how he values \"loyalty above everything else,\" punished a \"disloyal\" person by going \"out of my way to make her life miserable\" and espoused as a motto: \"Always get even. When somebody screws you, screw them back in spades.\"\n2:00 p.m. ET: Senior VP with HarperCollins Publishers takes the stand\nTracy Menzies is a senior vice president with HarperCollins Publishers. It published \"Think Big: Make It Happen in Business and Life,\" a 2007 book by Trump and entrepreneur Bill Zanker.\n1:45 p.m. ET: Trump bookkeeper Rebecca Manochio wraps testimony\nRebecca Manochio is finished after about four minutes of cross-examination by Trump lawyer Susan Necheles. Manochio was a junior bookkeeper at the Trump Organization during the time Trump was president and was responsible for sending unsigned checks for him to sign at the White House for his personal expenses.\nManochio confirmed previous testimony that Trump was the only person authorized to sign checks for his personal account and that he was not involved in signing any checks for his business because those assets had been put into a revocable trust while he was president. His son Donald Trump Jr. and then-Trump Organization CFO Allen Weisselberg had the authority to sign checks for the business.\nManochio testified that Trump and Weisselberg would speak at least once a day before Trump embarked on his run for president. After Trump started campaigning and was more frequently out of the office, the frequency of their contacts decreased, Manochio said. And, to her knowledge, she testified, Trump and Weisselberg didn’t speak at all after Trump became president.\n1:10 p.m. ET: Trump’s team will once again call for a mistrial\nBefore breaking for lunch, Trump lawyer Todd Blanche told Judge Juan M. Merchan that the defense plans to renew its call for a mistrial based on Daniels’ testimony, the Associated Press reported.\nBlanche also said they will seek to prevent former Playboy model Karen McDougal from testifying and that they will make further arguments pertaining to the gag order.\nMerchan said he would send the jury home at 4 p.m. and subsequently take up the defense’s arguments.\n12:50 p.m. ET: Trump bookkeeper takes the witness stand\nRebecca Manochio is a Trump Organization bookkeeper who was formerly an assistant to former chief financial officer Allen Weisselberg. She’s testifying about the nuts and bolts of check-paying procedures within the company.\n12:40 p.m. ET: Stormy Daniels leaves the witness stand\nStormy Daniels has completed her testimony, given over the course of two days in Trump’s criminal trial.\n12:30 p.m. ET: Going public with her allegation has negatively impacted her life, Stormy Daniels says\nAfter Trump lawyer Susan Necheles asked Daniels whether she’d fabricated her alleged sexual encounter with Trump, prosecutor Susan Hoffinger asked: \"Have you been telling lies about Mr. Trump or the truth about Mr. Trump?\"\n\"The truth,\" said Daniels, who also said that although she has made money since her story emerged, she also has had to spend a lot to hire security, move homes and take other precautions, and she still owes Trump hundreds of thousands of dollars in attorneys fees.\n\"On balance, has publicly telling the truth about Mr. Trump been a net positive or net negative in your life?\" Hoffinger asked.\n\"Negative,\" Daniels replied quietly.\n12:20 p.m. ET: Prosecutor highlights online threats against Stormy Daniels\nProsecutor Susan Hoffinger called attention to some of the threats and hateful comments that Stormy Daniels has received online from Trump supporters — a few of which prompted replies from her that were previously highlighted by the defense, according to the Associated Press.\nOne of the messages referred to her as an \"aging harlot,\" another as a \"degenerate prostitute,\" suggesting she would be followed in the street. \"These are tame, actually,\" Daniels said.\n12:10 p.m. ET: Stormy Daniels acknowledges she never spoke to Trump about the hush money payment\nStormy Daniels testified that she never spoke with Trump about the $130,000 hush money payment she received from Michael Cohen and had no knowledge of whether Trump was aware of or involved in the transaction, the Associated Press reported.\n\"You have no personal knowledge about his involvement in that transaction or what he did or didn’t do?\" Trump lawyer Susan Necheles asked.\n\"Not directly, no,\" Daniels responded.\nUpon further questioning, Daniels noted that she didn’t negotiate directly with Cohen, either, but that her lawyer at the time, Keith Davidson did.\nNecheles used the questions in the final moments of her cross-examination to underscore that Daniels had no knowledge of any of the allegations underlying Trump’s charges in the case, that he falsified his company’s records to hide the true nature of reimbursement payments to Cohen.\nDaniels said that she knew the charges involved business records, but when asked if she knew anything about Trump’s business records, she acknowledged: \"I know nothing about his business records. No. Why would I?\"\n11:35 a.m. ET: Stormy Daniels insisted that her story has not changed\nStormy Daniels testified earlier this week that while she wasn’t physically menaced, she felt a \"power imbalance\" as Trump, in his hotel bedroom, stood between her and the door and propositioned her.\nAs for whether she felt compelled to have sex with him, she reiterated Thursday that he didn’t drug her or physically threaten her. But, she said, \"My own insecurities, in that moment, kept me from saying no.\"\nTrump denies any sexual encounter happened.\nSeveral times, Necheles accused Daniels of altering the details of her story over time, saying at one point: \"Your story has completely changed.\"\nDaniels insisted it has not. \"You’re trying to make me say that it changed, but it hasn’t changed at all.\"\n11:30 a.m. ET: Susan Necheles hones in on Stormy Daniels’ career in pornography\nTrump’s defense attorney Susan Necheles is highlighting Daniels’ career in adult films to suggest that her story about being shocked and frightened by Trump’s alleged sexual advances is not believable, the Associated Press reported.\n\"You’ve acted and had sex in over 200 porn movies, right?\" asked Necheles. \"And there are naked men and women having sex, including yourself, in those movies?\"\nNecheles continued: \"But according to you, seeing a man sitting on a bed in a T-shirt and boxers was so upsetting that you got lightheaded, the blood left your hands and feet and you felt like you were going to faint.\"\nDaniels replied that the experience with Trump was different from porn for a number of reasons — including the fact that Trump was more than twice her age, larger than her and that she was not expecting to find him undressed when she emerged from the bathroom.\n\"I came out of a bathroom seeing an older man that I wasn’t expecting to be there,\" she said.\n11:25 a.m. ET: Stormy Daniels and Susan Necheles debate ‘In Touch Weekly’ interview\nTrump lawyer Susan Necheles contends Daniels’ 2011 interview with \"In Touch Weekly\" was a \"completely different story.\" Daniels responded that it was an \"abbreviated version\" of events and that the article was edited for length.\nThe 2011 interview was not published at the time, but was released in 2018. In it, Daniels said, \"When I came out, he was sitting on the bed and he was like, ‘Come here.’ And I was like, ‘Ugh, here we go.’ And we started kissing.’\"\n\"They left out a lot of stuff because they couldn’t fact-check it. I do remember them telling me that,\" Daniels testified.\n11:20 a.m. ET: Trump’s lawyer tries to poke holes in Stormy Daniels’ testimony\nSusan Necheles is trying to show that details from Stormy Daniels’ story of meeting Trump in 2006 have changed over time, pointing to a 2011 interview in which she said the two talked \"before, during and after\" dinner in his hotel room, though she testified earlier this week that they never got any food.\nDaniels rebuffed the idea that there was a discrepancy: saying that what she meant was that they talked during dinnertime but that she never said they actually got food, to her frustration, as she’s \"very food-motivated.\"\n\"I’ve maintained that in every interview — that we never actually ate,\" she said during an extended exchange on the dinner details, and explained: \"Having dinner, at least from where I’m from, doesn’t necessarily mean you have to put food in your mouth. You’re going to someone’s house for dinner, it’s dinnertime.\"\n\"The details of your story keep changing, right?\" Necheles asked at one point.\n\"No,\" Daniels said.\n11:15 a.m. ET: Stormy Daniels addresses potential paranormal experiences\nIn one of the trial’s odder moments, Daniels was pressed about her experience dealing with a ghost — which may have just been a marsupial.\nAsked by Trump lawyer Susan Necheles about her claim that she lived in a New Orleans home that was \"haunted and the spirits attacked you,\" Daniels launched into an explanation of her possible encounter.\n\"The house had some very unexplained activity. We brought in experts, people to measure the electromagnetic fields, religious experts, scientists,\" she said. \"A lot of the activity was completely debunked as a giant possum that was under the house.\"\nThe line of questioning appeared aimed at undermining Daniels’ credibility while giving Necheles a chance to highlight that Daniels is working on a paranormal investigation show called \"Spooky Babes.\"\n11:10 a.m. ET: Trump lawyer highlights Daniels’ Trump-connected merchandise\nSusan Necheles pressed Stormy Daniels on her social media marketing of merchandise tied to her public persona as a Trump antagonist.\nAsked about an \"in celebration of new indictments\" promotion from last year that offered a gift for new orders, Necheles asked whether the performer wasn’t using the circumstances to flog products.\n\"Not unlike Mr. Trump,\" Daniels calmly retorted.\nNecheles then suggested Daniels was \"bragging\" by offering a \"Stormy Saint of Indictments\" candle.\n\"No, I’m not bragging. I think it’s funny that a store made that for me to sell,\" Daniels said.\n11:00 a.m. ET: Stormy Daniels to defense lawyer: ‘You’re putting words in my mouth’\nSeveral times, Stormy Daniels has taken issue with Trump lawyer Susan Necheles’ questioning.\nAmid questioning over the financial arrangements for her documentary, Daniels accused Necheles of \"trying to trick me into saying something that’s not entirely true.\"\nAt another point, Daniels demanded the defense lawyer back up her claim about something she claimed Daniels had said regarding Trump’s arrest.\n\"Show me where I said I’d be instrumental in putting President Trump in jail,\" the witness said, steady and unflustered.\nAfter Necheles showed Daniels a social media post she’d made that did not reflect those precise words, Daniels replied: \"I don’t see the ‘instrumental’ or ‘jail.’ You’re putting words in my mouth.\"\n10:50 a.m. ET: Documentary payments\nStormy Daniels said she’s received $100,000 and is due another $25,000 for footage and other rights she provided to the makers of a documentary about her experiences that aired recently on the NBC streaming service Peacock.\nSome of that money was used to compensate camera operators who’d been filming her before the documentary’s producers got involved, she said. Daniels said she was not paid for any interviews she gave for the documentary.\n10:40 a.m. ET: Stormy Daniels addresses ’60 Minutes’ interview, strip club tour\nStormy Daniels underscored several times that she received no compensation for a \"60 Minutes\" interview she gave in 2018, relaying her alleged sexual encounter with Trump. But Necheles, the defense lawyer, contended that the publicity from the TV appearance led to other moneymaking opportunities, including a book deal and a strip club tour, the Associated Press reported.\nDaniels also denied any involvement in coming up with a slogan that was attached to her strip club appearances the same year: \"Make America Horny Again.\" She said a club came up with the moniker and it stuck.\n\"I never used that tagline,\" she testified. \"I hated it.\"\n10:30 a.m. ET: Defense lawyer goes through NDA with Stormy Daniels\nTrump attorney Susan Necheles ran through the finer points of the nondisclosure agreement that Stormy Daniels had with Michael Cohen, asking Daniels to confirm that she agreed to highlighted portions, according to the AP.\nDaniels responds in terse one-word answers, \"Yes,\" adding: \"I signed this only based on what my attorneys suggested.\"\nNecheles confronted Daniels with two statements she signed in early 2018 denying that she ever had any sexual involvement with Trump or received money to keep quiet. She said her then-lawyer, Keith Davidson, advised her to sign it, and that she was told that Cohen was pressing him to get her to do so.\nNecheles noted that by then, Trump wasn’t running for election — an apparent effort to buttress the defense’s argument that Trump’s desire to squelch what he says are false claims about his personal life wasn’t related to his political ambitions, but rather to protect his family and reputation.\n\"I wouldn’t know what he wanted to protect,\" Daniels said.\n10 a.m. ET: Defense accuses Stormy Daniels of trying to profit off story\nDefense attorney Susan Necheles resumed cross-examination of Stormy Daniels on Thursday by pressing her on why she decided to take money to keep silent about her alleged sexual encounter with Trump instead of holding a press conference, as Daniels has said she wanted to do.\n\"Why didn’t you do that?\" Necheles asked, according to the AP.\n\"Because we were running out of time,\" Daniels said.\nDid she mean, Necheles asked, that she was running out of time to use the claim to make money? \"To get the story out,\" Daniels countered.\nThe negotiations were happening in the final weeks of the 2016 presidential campaign.\nAs Daniels was negotiating her non-disclosure agreement with Michael Cohen, she testified, she was also speaking with other journalists, including an editor at Slate as a \"backup\" plan.\nWhile Daniels said she was most interested in getting her story out and ensuring her family’s safety, Necheles accused her of refusing to share the story with reporters because she wouldn’t be paid for it.\n\"The better alternative was for you to get money, right?\" Necheles said.\n\"The better alternative was to get my story protected with a paper trail so that my family didn’t get hurt,\" Daniels replied.\n9:30 a.m. ET: Trump arrives in court\nTrump has arrived in court in Manhattan and entered the courtroom with U.S. Sen. Rick Scott.\nScott filed into the first row of the courtroom gallery behind the defense table, joining Trump’s entourage, according to the AP.\nHe spoke with Trump lawyer and spokesperson Alina Habba before taking a seat. He’s sitting next to Trump Organization general counsel Alan Garten.\n9 a.m. ET: Trump leans into pageantry of vice presidential tryouts\nAs Trump remains stuck in the courtroom listening to salacious details of an extramarital sexual encounter he denies, another spectacle is playing out in the background as his vice presidential tryouts get underway.\nThe dynamic was on full display in Florida at a fundraiser at his Mar-a-Lago club that doubled as a VP audition.\n\"This weekend, we had 15 people. ... They’re all out there campaigning,\" Trump told Spectrum News 1 Wisconsin on Tuesday. \"It might actually be more effective this way because, you know, every one of them thinks they could be chosen, which I guess possibly is so.\"\nFor now, the presumptive GOP nominee is happy to revel in the attention as reporters parse his choices and prospective candidates jockey and attempt to woo him, the AP reports.\n8:15 a.m. ET: Where does Stormy Daniels fit into the hush money trial?\nThough she is the latest high-profile name to be called up for questioning, Daniels is key to the events and charges at the center of the criminal case against the former president.\nDaniels has said that in 2006, she and Trump had sex in his hotel suite during a Lake Tahoe celebrity golf outing where her studio was a sponsor. She testified Tuesday that the encounter was \"brief\" but left her \"shaking.\"\n\"I just wanted to leave,\" she testified.\nA decade later, she was paid $130,000 in the final weeks of the 2016 presidential race to keep quiet about the encounter. Trump denies having sex with Daniels.\nMichael Cohen, then Trump’s attorney, paid Daniels through a shell corporation he created, and the deal was finalized on Nov. 1, 2016, just a week before Election Day.\nProsecutors have said that payments from Trump reimbursing Cohen were falsely — and illegally — logged as legal fees to cover up their actual purpose. Trump’s lawyers contend the payments were legitimate legal expenses.\nTrump's hush money case\nThe indictment against Trump centers on payoffs allegedly made to two women, porn star Stormy Daniels and Playboy model Karen McDougal.\nTrump’s former lawyer and \"fixer,\" Michael Cohen, paid Daniels $130,000 and arranged for the publisher of the National Enquirer supermarket tabloid to pay McDougal $150,000.\nTrump's company, the Trump Organization, then reimbursed Cohen and paid him bonuses and extra payments – all of which, prosecutors say, were falsely logged as legal expenses in company records. Over several months, Cohen said the company paid him $420,000.\nPayments were also allegedly made to a Trump Tower doorman who claimed to have a story about a child he alleged Trump had out of wedlock.\nThe indictment, brought by Manhattan District Attorney Alvin Bragg, made Trump the first ex-president ever to face criminal charges.\nTrump has denied the accusations.\nWho are the jurors?\nAfter being forced to release a seated juror, the judge ordered the media not to report on where potential jurors have worked – even when stated in open court – and to be careful about revealing information about those who would sit in judgment of the former president. Here's what we can report.\nJuror 1 and foreperson: A man who lives in New York City and has no children. Loves the outdoors and gets his news from The New York Times, Daily Mail, Fox News and MSNBC.\nWhen asked by Trump defense attorney Todd Blanche if he was aware Trump is charged in other cases and jurisdictions, and how that affects him, the man said, \"I don’t have an opinion.\"\nJuror 2: A man who said he follows Trump’s former lawyer, Cohen, on \"X,\" formerly known as Twitter. He also revealed he follows other right-wing accounts including Trump’s former adviser, Kellyanne Conway.\nHe has said he would unfollow Cohen as he may be a witness in the trial.\nJuror 3: A middle-aged man who lives in Manhattan. He grew up in Oregon. He gets his news from The New York Times and Google.\nJuror 4: A man who lived in New York City for 15 years. He is originally from California. He is married with three children and a wife who is a teacher. He has served on a jury before – both on a grand jury and a jury in a criminal trial.\nThe juror said he gets his news from \"a smattering\" of sources and does not use social media.\nJuror 5: A young woman who is a New York native.\nShe gets most of her news from Google and Tiktok.\nJuror 6: A young woman who lives in Manhattan and likes to dance.\nJuror 7: A man who is married with two children.\nHe gets most of his news from The New York Times, The Wall Street Journal, the New York Post and The Washington Post. The man has said he is aware there are other lawsuits but said, \"I’m not sure that I know anyone’s character.\"\nJuror 8: No information has been released about this juror.\nJuror 9: A woman who lives in Manhattan. She is not married and has no children.\nShe has never served on a jury before and does not watch the news. However, she said she does have email subscriptions to CNN and The New York Times. She follows social media accounts and listens to podcasts. She also enjoys watching reality TV.\nJuror 10: A man who lives in Manhattan. He is not married and has no children. He does have a roommate who works in accounting. He rarely follows the news but he does listen to podcasts on behavioral psychology.\nJuror 11: No information has been released about this juror.\nJuror 12: No information has been released about this juror.\nHow long will the trial last?\nThe trial is expected to last anywhere from six to eight weeks. Trump is expected to attend court each day.\nHow can I watch the Trump trial?\nThe trial is not being televised. Instead, news reporters and producers will have the ability to sit inside the courtroom and deliver information to the public.\nHow many court cases is Trump involved in?\nAs of this report, Trump is currently involved in four criminal cases, which includes the hush money case.\nA second case out of Fulton County, Georgia, has charged Trump, as well as 18 others, with participating in a scheme to illegally attempt to overturn the former president’s loss to President Joe Biden in the 2020 presidential election.\nTrump is also involved in a third criminal case in Washington, D.C., which charged him with allegedly conspiring to overturn the results of the 2020 presidential election in the run-up to the Jan. 6, 2021, riot at the U.S. Capitol.\nAnd his fourth case involves classified documents that Trump illegally retained at his Mar-a-Lago estate after he left the White House.\nRELATED: A guide to Trump’s court cases\nThe Associated Press, FOX News, FOX 5 NY and Catherine Stoddard contributed to this report.",
  "word_count": 5909,
  "scraped_at": "2026-02-14T14:22:56.431278"
}