{
  "article_id": "2905e2ea73f9",
  "url": "https://awfulannouncing.com/netflix/nfl-christmas-day-variety-show-kay-adams-wyche.html",
  "title": "Netflix NFL debut will be one big football variety show",
  "date": "20241225T154500Z",
  "domain": "awfulannouncing.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "One of the great holiday traditions in the entertainment world is the Christmas variety show. This year Netflix is bringing it back.\nNot thanks to Sabrina Carpenter singing Last Christmas with Chappell Roan, but by putting together a one-of-a-kind broadcast for the NFL with a global audience in mind.\nIn just the last several months, Netflix has finally made its long-anticipated entry into the live sports universe. The O.G. global entertainment streaming platform will soon be the home of WWE Monday Night Raw and in a few years, the Women’s World Cup. But in the realm of live sports, there’s the NFL and then there’s everything else.\nSo when it came time for the NFL to make a bold play by stepping onto the NBA’s turf on Christmas Day, even if it came to re-configuring the entire schedule around an incredibly rare Wednesday doubleheader, it was equally as bold to partner with Netflix for the broadcasts.\nThe landmark NFL-Netflix deal for Christmas Day is a huge investment for both parties. For Netflix, it plants the flag as a major player in the live sports world. For the NFL, it means partnering with a global streaming giant that can continue its efforts to take over the world.\nWith being such an inflection point in both the NFL and Netflix’s trajectory, both parties have one goal in mind: To make it the biggest holiday celebration possible. What better way to do that than to have over 20 people for one big NFL variety show with everyone from Nate Bargatze to Beyoncé and the McCourty twins to the Eagles? (Not the band, Noah and Ian.)\nKay Adams has been synonymous with the NFL for years, first with NFL Network and Good Morning Football and now with FanDuel’s Up and Adams. On Christmas Day, she will anchor proceedings from Los Angeles aside from an All-Star lineup consisting of Drew Brees, Manti Te’o, Mina Kimes, and Robert Griffin III. And getting to work with so many new people across the football universe for the first time will make the showcase event all the more special.\n“It’ll sort of be like a holiday party,” Adams told Awful Announcing this week. “There’s a lot of common lines, familial things. J.J. Watt calling his brother’s game, the McCourty brothers will be stationed together in Pittsburgh, which I love. I couldn’t adore them more. Nate Burleson, we have a Good Morning Football connection. Then you come to LA where we’re anchoring, me and Mina Kimes have never got to work together. We’ve only been on camera together once and it was last week on Up and Adams on my show.”\nAdams is particularly excited to work with ESPN’s Kimes on air for the first time, who she spotlighted as the one person she was most looking forward to sharing the set with on Christmas Day.\n“I can’t wait to share a set with her on Christmas and take notes, learn, absorb through osmosis her genius,” she said.\nAdams is hopeful the excitement of getting to work with people across all of the league’s different platforms, in what amounts to the NFL version of The Avengers assembling from all corners of the televised football world, breaks through to fans at home.\n“It’s a holiday party where you kind of know Alice that works in accounting but you’ve never actually got to hang out with Alice, that’s what I hope it feels like,” she said. “We’re looking for cozy, warm vibes. And the global aspect of it is amazing, nearly 200 countries getting to take in the sport you and I are obsessed with.”\nLongtime NFL Network anchor and reporter Steve Wyche will be on the sidelines for the Houston Texans-Baltimore Ravens game with Jamie Erdahl. Even though both work for NFL Network, this will be the first time they share the airwaves for the same broadcast. The same goes for Noah Eagle and Greg Olsen, who Wyche covered in his time in the league.\n“For Netflix to come in and do it so huge and so big, it really is a chance to do something historic. And for me to have a little footprint in that, trust me that is not something I take for granted,” Wyche said.\n“Even though a lot of us work for different networks, we’re friends,” he added. “I’m friends with Mina Kimes, who I have the utmost admiration for, I think she’s one of the greatest things to happen to sports broadcasting. To even be included on a concert ticket so to speak with her and J.J. Watt and Nate Burleson and Kay Adams, the roster is so deep and it’s just so cool.”\nNoah’s dad Ian will call the first game between the Pittsburgh Steelers and Kansas City Chiefs alongside J.J. Watt and Nate Burleson where Melanie Collins and Stacey Dales will be on the sidelines. That’s also where Laura Rutledge and Devin and Jason McCourty will be with live coverage as well. And did we mention Nate Bargatze as a special guest and Bert Kreischer as a tailgate correspondent? And a Mariah Carey intro? And that live Beyoncé performance? The only thing missing is an impromptu duet with Chiefs fan Taylor Swift joining Beyoncé in Houston.\nOne of the reasons the NFL and Netflix are pulling out all the stops is that this broadcast goes beyond the traditional American holiday viewing experience on Christmas Day. The streamer’s global platform aligns with the NFL’s push into new markets around the world, as we saw earlier this year with the first game in Brazil joining games in England and Germany. That fact isn’t lost on the broadcast participants and why these games take on an increased significance.\n“I like being part of building things,” Adams remarked. “It’s not my first time working with Netflix, It is a very forward-thinking, big-thinking process. I could not adore it more. I’m a kid on Christmas morning on Wednesday when it comes to the ambition and the mentality of it. Let’s casually bring Beyoncé into the mix for halftime. You know what? Mariah Carey sounds like that’s what we should do. It feels right. As you can see, dropping that list of 22 people who are all equally involved in this collaborative effort to bring the best thing the NFL and Netflix can bring to Christmas.\n“There’s obviously a responsibility, but I would say more of a thrill, a thrill to connect people on Christmas to the game. I have family in Poland that gets to watch!”\nThe NFL is undoubtedly the top sports and entertainment property in the country as it dominates the most-watched events on television year in and year out. But as the league continues to expand globally, there may not be a ceiling to the league’s global aspirations. Even a game in Australia has been mentioned as a possibility. Now with one, unified global platform, the possibilities may be limitless for where the league can go in the years ahead.\n“The NFL is the most popular viewing experience for the American public,” Wyche said. “Now that the NFL has committed to its global expansion and now doing it on a Christmas Day in a full global context is significant. In broadcast terms, it’s very historic because we just don’t see things because of the varying time zones on a global scale. The fact Netflix came in and said, ‘Look we’re the big streaming arm that’s got all these global subscribers, let’s take a big swing at this.\n“I’ve done several games over in London. 15 years ago they were teaching the sport, now it’s part of what they do. The fans over there crave it. I think as the NFL tries to establish global footprints, it may not work every place like it does in London, I just don’t know. But the fact that they are trying this is something that’s going to bode well for them. The NFL has not missed on much. With this game as a prime example and Netflix being such a prominent vessel to deliver this, I think it’s going to be a smash success.”\nAfter a weekend where ESPN was criticized for focusing on the negative when it came to the College Football Playoff, getting dragged down into re-litigating resumes and bemoaning the teams involved, expect a very different vibe when it comes to Netflix’s coverage of the NFL on Christmas Day. This is going to be an all-day celebration of football with a holiday party atmosphere.\nOf course, if Beyoncé were performing at your Christmas party, it might brighten your holiday spirit too.",
  "word_count": 1435,
  "scraped_at": "2026-02-14T12:34:02.609559"
}