{
  "article_id": "290b33ad685c",
  "url": "https://www.espn.com/espn/story/_/id/44189743/nwsl-striker-barbra-banda-orlando-pride-need-another-star-2025",
  "title": "NWSL striker Barbra Banda - Orlando Pride  need another star  in 2025",
  "date": "20250310T130000Z",
  "domain": "espn.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "On the eve of the 2025 NWSL season, Orlando Pride striker Barbra Banda has outlined the reigning champions' determination to retain their crown, but has acknowledged that Seb Hines' team certainly aren't going to have things all their own way this term.\nLast season, the Pride clinched their first NWSL crown by defeating Washington Spirit in November's playoffs final, with Zambia striker Banda establishing herself as one of the league's star attractions, finishing the season as the second-highest goalscorer behind Temwa Chawinga.\nNot content to rest on her laurels, CAF's African Women's Footballer of the Year has outlined the Pride's ambition to become the first team since North Carolina Courage in 2019 to retain the championship.\n\"We need to put another star [on our jersey],\" Banda told ESPN's Ali Krieger. \"We only have one, so we need to put another.\n\"It's a new journey now, and we're planning on how to start. It was a long season, but it's been good to be back, to see everybody; my teammates and the technical staff.\n\"The team is shaping up so well, and we know it's not going to be easy, of course, to win back to back. We need to pull up our stockings because we know we need to take each and every game very seriously.\"\nAfter arriving four matches into Pride's successful title-winning season in a blockbuster $740k deal from Chinese Super League side Shanghai Shengli FC last year, Banda has now been able to benefit from a full pre-season with Hines' squad.\nBanda believes that the team's preparation before they kick off their campaign against Chicago Red Stars this weekend could help them go the distance again after last term's exploits.\n\"This preseason is going to determine how far we're going to go in the league when it starts,\" she added.\n\"Preseason has gone so well, and everybody is ready because we know what it takes and we know that it's not going to be easy for us, so we need to work hard.\n\"We expect tough games, you know they won't be easy, and we can't beat every team, [but] it's a matter of us being focused, working hard to continue where we ended off. We need to step up from there.\"\nDespite being thrust into an ongoing season in the City Beautiful, Banda demonstrated her class consistently during the last NWSL campaign, ending the year in the Team of the Year, and as one of the nominees for the 2024 MVP.\nIt was the 24-year-old who scored the winning goal in the championship decider against the Spirit at the CPKC Stadium in Kansas City, with the Pride having earlier won the NWSL Shield by finishing atop the league during the regular season.\n\"I knew what I was coming for,\" Banda continued. \"I knew that it's a tough league, with good teams, experienced players, good defenders, midfielders, strikers, but the most important thing that helped me was the team and the technical staff.\n\"The moment I came, the welcome I received made me feel at home. During the training sessions, the players would help me to mingle with them, that family thing. It's a team of family.\n\"We understand each other, we help each other, and that's why I was so quick in adapting to the kind of football they want me to play for the team. It was amazing.\"\nBanda scored 13 goals in 22 outings last season, behind only Malawi's Chawinga in the goalscoring charts, but with a full campaign behind her, is among the frontrunners for the 2025 Golden Boot.\n\"I love scoring, it's so special to score,\" she concluded, \"but it comes from the team, the teamwork matters, and these goals that come are from the team, it's not by myself.\n\"I'll get motivated and I'll keep pushing myself, I need more goals, so come 2025, we need to coordinate as a team to get more.\n\"Everybody can score, and we believe and trust in each and every one of our team.\"",
  "word_count": 669,
  "scraped_at": "2026-02-14T12:35:05.377802"
}