{
  "article_id": "29462c1fe542",
  "url": "https://www.ksl.com:443/article/51257963/did-culture-at-grantsville-high-and-the-community-hinder-sexual-abuse-reporting-from-students",
  "title": "Did culture at Grantsville High and the community hinder sexual abuse reporting from students ? ",
  "date": "20250317T074500Z",
  "domain": "ksl.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Estimated read time: 28-29 minutes\n- A KSL.com investigation reveals an \"ecosystem of enabling\" among many in the Grantsville High community amid a number of sex abuse allegations.\n- Some students who reported sexual assaults, and an officer investigating the crimes, were threatened, harassed and ostracized.\n- Some showed a pattern of rallying around accused abusers; some parents were forced to choose between reporting their child's sexual abuse and protecting them from community backlash.\nGRANTSVILLE — Grantsville High School has been the site of a number of sexual abuse investigations against teachers and coaches in just a handful of years.\nPatterns of community support for some of the accused abusers have spurred some victims who experienced sexual abuse at the hands of school staff to recently come forward despite the immense pressure they say they felt in the past to stay silent.\nKSL.com interviewed former students, district officials, current parents of students, victims of sexual abuse and investigators to understand the ripple effects of what might be going on in the Grantsville community.\nExtensive reporting, based on numerous interviews and public records requests, uncovered some patterns of abuse and enabling, including:\n- Some students who reported sexual assaults — and an officer investigating the crimes — were threatened, harassed and ostracized. Others were intimidated into silence, out of fear of retaliation by some in the community.\n- One investigation was spurred by the attempted suicide of an abused student, and another was shuttered by the suicide of a vice principal and former athletic director who had been accused of abuse.\n- Some Grantsville High staff, teachers, coaches and members of the community showed a pattern of rallying around accused abusers, while creating serious challenges for investigators.\n- Some parents were forced to choose between reporting their child's sexual abuse and protecting them from community backlash.\n\"It's what I would call the ecosystem of enabling, where others know about the misdeeds and inappropriate behavior of people in a position of authority — coaches, trainers, doctors — as I've written about,\" said University of Utah law professor Amos Guiora, who leads the Bystander Initiative focusing on the role of bystanders and enablers in sexual assaults.\n\"When (survivors) come forward, more often than not, they are — pick your poison — dismissed, mocked, victim-blamed, not legitimized.\"\nGuiroa, who assisted KSL.com in the investigation, has studied cases of sexual assault at USA Gymnastics, Michigan State University, Penn State University, Ohio State University and in the Catholic Church.\nIt's a pattern that \"all but ensures that the survivor-victim is abandoned on two different levels: abandoned when physically violated and then abandoned when they come forward,\" according to Guiora.\nA former Grantsville police officer, Sgt. Allred, was assigned to investigate the sexual assault case of football coach Curtis Ware in 2016. \"I've dealt with a lot in my career. I've been on task forces. I've been on special assignments. I've never gotten death threats or threats like I did\" on that case, he told KSL.com. \"There was a lot of weird stuff that went on in that high school.\"\nGenerations of teachers, coaches, parents and students flow through the school; those who graduate often return to teach or send their children. It's a community similar to many across the country. But that closeness has also been the source of pain for some seeking justice after being sexually abused by well-respected members of the community.\nCourt hearing divides a community\nIn January, educators, staff and coaches attended the sentencing hearing of former Grantsville teacher and coach Richard Craig Harrison, who admitted to sexually abusing a 14- to 15-year-old student during the 2017-18 school year.\n\"Crazy, crazy amounts of letters in support of (Harrison)\" were submitted to the court, a parent of students who attended Grantsville told KSL.com.\nCounty employees — some of them former teachers and coaches of the victim — also appeared to support Harrison by sitting on his side of the courtroom for the hearing. One parent told KSL.com that a current Grantsville High School student cried in the pews when she saw her teachers there, feeling they were not to be trusted if the need to report arose.\nTheir attendance was made public through Facebook posts by concerned students and parents. Close to 600 people signed a petition demanding those in attendance resign from the school in the name of student safety.\n\"These are not the kind of people we can trust to care and protect our children,\" former student Karma Newbold commented. \"Advocate for the past, present and future children of our schools. Start by forcing these staff members to resign.\"\nAn attendee who wished to remain anonymous messaged KSL defending staff, saying they were at court in support of Harrison's family — his mother and father still teach there. \"There were people there who sat behind the Harrisons to support them and then turned and visited with the victim's family for 15 minutes to support them, as well. This situation hurt people on both sides. And that's what everyone needs to hear and understand.\"\n\"When the girls and the young women walk into the courtroom and they see that people are sitting behind the defendants' table — from their perspective, that's a sign of support … that's a sign of abandonment,\" Guiora said. \"You can rationalize it by saying: 'Well the coach and I were actually really good friends, our kids play together.' I understand that. I mean small town, everybody knows everybody. That's great. But that's to miss the much larger picture of how it impacts those who are most in need of help.\"\nThat backlash has divided a community, as members reckon with the multiple instances of public support shown to coaches and teachers who have sexually abused students.\nHarrison, 36, was originally charged with object rape, a first-degree felony, and six counts of forcible sexual abuse, a second-degree felony. As part of a plea bargain, he pleaded guilty to one count of forcible sexual abuse, a second-degree felony, and two reduced counts of unlawful sexual activity with a minor, a third-degree felony. He was sentenced to a year in prison and began serving that sentence in January.\nPatterns of abuse\nSome teachers at the school pushed the boundaries between students and staff, according to former students. Many were sports coaches.\nKorryn Coates, a student from 2005 to 2009, played softball all four years, along with basketball and volleyball, and worked as the volleyball team manager her junior and senior years.\n\"It was very cool and 'in,' to be tight with the coaches,\" Coates recalled. As a 14-year-old at the time, she felt \"there was something there\" between her and geography teacher Shane Heath.\nHeath was also a coach at the school. According to Coates, \"We weren't working out while we were in the weight room. We were hanging out at his desk and he would get involved in gossip.\"\nCoates described relationships between coaches and athletes in the small town as \"familial,\" going to Heath's parent's house for a team dinner or watching their baby. \"It's a tight-knit community. They were always around. And when you're playing sports, you're with your coaches a lot.\"\nDuring her senior year, Coates worked doing bookkeeping for softball games at Deseret Peak. She was young for her grade, still only 16. Heath managed the grounds. \"Many, many nights, I would just go over there to hang out,\" she said. \"Just in the tower with him while he was doing his work.\"\nAfter she graduated, Coates continued to work and play at Deseret Peak. One summer night, she went with Heath to get Slurpees after a game. \"We went to 7-Eleven, we picked up a Slurpee and he took me back to his house and that was the first time we had sex,\" she said. \"I was still 17 years old at that time.\"\n\"I didn't look at it as something that he did to me, I looked at it as something we did together,\" Coates said. \"But now I'm a teacher. Now, I'm an adult. Now, I'm looking at 17-year-olds and I could never imagine making a decision like that.\"\nWhen Coates first saw the news about Harrison's arrest, she said \"it sounded like the same situation\" she had experienced. \"It was in the weight room, it was the coach, it was the health and PE teacher and he was grooming young girls and they were his 'best friend.' It sounded so familiar that I decided to report,\" she said.\nShe went to the police over a decade after graduating high school. Immediately after, on Sept. 27, 2022, Heath was interviewed by Tooele County sheriff's deputies, according to documents from a public records request.\nAn investigating Grantsville police sergeant wrote in an incident report that the interviewing officer said, \"Heath had been brought in for an interview and confessed to the allegations.\" Heath, who was vice principal of Clarke N. Johnson Junior High at the time, was placed on administrative leave the same day, according to school district spokesperson Brett Valdez.\nThe next morning, Heath was reported missing and found soon after by a hunter on Little Mountain Road up Miner's Canyon. The windows of Heath's truck were open despite ongoing rain, and the man was dead from an apparent self-inflicted gunshot wound, police reports say.\n\"I've seen the community completely support him — like nobody talked about why he died by suicide,\" Coates said. \"It was just this whole tragedy like 'gone too soon,' you know, and the whole town showed up for his funeral. They had a memorial basketball tournament for him.\"\nLaurien Elsholz was a sophomore when she had a long-term substitute teacher and football head coach Curtis Ware for language arts in 2015. \"He was one of the fun teachers,\" she said. \"It was a class that you would never sluff. You would never miss that class. You would always want to go to it, just because it was always fun. He was a fun teacher. He was awesome.\"\nElsholz and her twin sister Paige Elsholz became \"teacher's pets,\" she said. \"Halfway through the school year, we got really close to him.\"\n'A little too obsessive'\n\"What I found in the books and articles that I've written, in the cases where I've been an expert witness, the pattern is very similar,\" Guiora told KSL.com. \"The teacher, male or female, was generally widely liked, in some cases, admired.\"\nGuiora added, \"From a kid's perspective, there was a cool factor in hanging out ... with the teacher.\"\nWare asked the young girls to be football managers. \"I was never a sporty person,\" Paige Elsholz, now 25, told KSL.com, \"so why (Ware) started liking me and my sister and our friend so much, honestly, was kind of weird to me.\" The managers before then, she said, were always \"jocks.\"\nFor the twins, the new responsibilities came with more interaction. Ware texted them, and Laurien Elsholz said he was friends with her on Facebook. But over time, \"Ware became a little too obsessive with us,\" she said.\n\"Ware was always having us come into his office, which was in the back room,\" Paige Elsholz said. \"You would have staff, you'd have the principal walk by and not even blink an eye.\"\n\"We would just sit there and talk,\" according to Laurien Elsholz. \"We would stay late, so we'd miss the bus and he would drive us home.\"\nThis was not uncommon behavior, according to former students, who said a number of coaches/teachers had kids in their offices, their numbers in their phones or connections through social media apps. One of them was Harrison, former students said.\n\"It wasn't uncommon for (Harrison) to have phone numbers of different athletes, especially lots of the football guys,\" former student Oaklee Collings told KSL.com. \"But he had tons of girls' phone numbers, and he would reach out to them on different apps.\"\n\"It was always kind of like, hush-hush that Craig Harrison was texting you,\" she said. \"But it never really seemed to be about treatment. It was always just like he was chatting.\"\n'Severely groomed'\nDuring the 2015-16 school year, Chad Holmes told KSL.com his daughter, a cheerleader at the high school, said Harrison \"was telling them to wear certain clothes like really tight leggings or spandex-type shorts,\" offering good grades in return.\n\"He said the same thing to my daughter and then also my son's girlfriend,\" Holmes said. After class, \"he was telling girls that if they were sore or anything after weight class that they could stay behind and he would stretch them out.\"\nBoth girls told Holmes they saw Harrison \"grabbing these girls' legs and you know stretching them out and then getting his junk up in their private areas while he's doing it … very inappropriate,\" he said.\nHolmes said he confronted Harrison and then reported the behavior to the athletic director — Shane Heath. It was only after a different student came forward in 2022 that criminal charges were filed against Harrison.\nWhen arrested, Harrison was accused of sexually assaulting a student 10 different times in seven different locations around the school. Court documents say that after some incidents, Harrison would send a message asking the student if she was OK \"and would tell her to make sure she deleted her messages and not tell anyone.\"\nSome abuse was public. Harrison was accused of grabbing a student's rear \"as they were in the weight room with a bunch of students messing around.\" A witness told police she saw Ware touching a student inappropriately during a home game in the announcers booth, a police report says.\nPaige Elsholz remembers an escalating pattern of abuse working as a football manager for Ware. She would be ordered to meet him in the equipment shed with the doors closed before practice, where she would touch and kiss Ware, she said, with the same thing happening in the bathrooms during practices, or in the coach's office.\nAn arrest report, obtained through public records requests, says two girls \"disclosed the inappropriate touching on several occasions that occurred in Grantsville city that eventually led up to\" an incident at a football camp in Cedar City. After details of the abuse were reported, Ware was charged with forcible sodomy from the alleged Cedar City incident.\nCharging documents say Ware made girls take explicit photos for him, resulting in three counts of sexual exploitation of a minor. Tooele County Chief Deputy Attorney Gary Searle said after a court hearing that prosecutors were alleging Ware asked students to take photos on their phones and then show him the pictures in person to avoid a paper trail.\n\"They would dress as he asked them to dress, take the photos and then show him the pictures,\" Searle said.\nThe coach was also charged with four counts of forcible sexual abuse, second-degree felonies, and four counts of lewdness, a class B misdemeanor. He was 47 at the time.\nWare made a rule that if the girls cracked their knuckles in class, they had to take pieces of their clothing off in the equipment shed, according to a police victim interview obtained through public records request. He would bring them clothes, and have them change in front of him in the shed. Police found girls clothing in Ware's locker after he was arrested, evidence records show.\n\"It was really bad toward the end. It was just really bad,\" Paige Elsholz said. \"(Ware) would always threaten us with being football managers. He's like, 'If you guys ever told anybody, if you guys ever stop doing stuff with me, like, you guys will be fired and you'll be nothing.'\"\n\"He knew that we had never been anything in our lives and being a football manager was the coolest thing to us,\" she said. \"We were finally a part of something and we loved it, up until everything was happening.\"\nPaige Elsholz believes she was \"severely groomed.\" When she confronted Ware about their interactions being too noticeable, she said Ware lashed out publicly, screaming at the football managers on the football field. In a police interview, she said Ware \"used to be like a dad to me ... I wish it would have stayed like it was in the beginning where he was like my dad.\"\n\"People did see. You'd have to be very blind not to see how rude he was being to us. … There had been rumors going around that people would joke and say that we were Curtis' girlfriends. Students knew what was going on.\"\nOn Aug. 30, 2016, Paige Elsholz skipped school after being fired as a football manager, according to police reports, though the reason for the firing was unclear. That morning, Ware had sent a long text message to her, apologizing for \"(trying) to be your friend,\" the case file shows.\n\"I am your teacher and coach and that is who I need to be. From now on that is who I will be,\" he wrote.\nPaige Elsholz told KSL.com she tried to end her life by overdosing on pills following that text, and around 5 p.m. Ware \"drove straight to her house and found her inside the home incoherent,\" according to the police reports.\nAn on-duty officer, responding at Ware's behest, found Ware \"loading a juvenile female into his truck,\" when he was stopped to wait for an ambulance, a police report from Allred says.\nPaige Elsholz was rushed to the hospital for emergency treatment before receiving in-patient mental health treatment for about a week. The next day, Sept. 1, Laurien Elsholz and another ex-football manager named Mary reported the sexual abuse of Paige Elsholz to then-Principal Mark Ernst.\n\"He looked at us, and he just had this dead stare on his face and he slammed his hands on the desk and he was like, 'You guys realize that you guys making this (expletive) up will get him fired, and ruin his reputation. … You guys realize that he won't be the one going to jail. You will be. For lying,'\" Laurien Elsholz recalled.\nMary told KSL.com she remembers \"the hand slap on the desk when he told us if 'we're lying, we'll get in trouble,' … The whole time he just showed no emotion and barely said anything and stared at us while we were choking up.\"\nAllred, who had been investigating with the Grantsville Police Department, confirmed being told the account of events when interviewing the girls.\nA spokesperson for Tooele County School District told KSL.com in a statement: \"The account being shared does not accurately reflect the events of that day. Dr. Ernst said he did not slam his fist on a desk, nor did he suggest the students made up the accusations.\"\nErnst was principal at the high school from 2013 to 2017 before becoming an area director. He was hired as superintendent of the Tooele County School District in 2022.\nGuiora said what's important is how the students felt.\n\"With respect to when the girls would come forward, it's not important if they are 100%, and I say this respectfully, consistent in their articulation — how did this person exactly react like that? Or did this person react like that?\" Guiora said. \"Whether a person in a position of authority reacted this way or reacted that way is actually not really important. ... What is important is what they felt — minimized, degraded, delegitimized.\"\nLaurien Elsholz said she and Mary \"just went and sat in our car and I'm like … I can't believe what just happened. He doesn't believe us. … I regret this.\"\nDuring a press conference that day, Ernst — wearing a Grantsville football shirt — told reporters he notified the school resource officer, the school district and the police within an hour of the reports. Ware was arrested and put on leave pending an investigation.\n\"You don't want to believe it. I don't know if it's going to turn out to be true or false,\" he said at the conference. \"My initial reaction is, 'I don't want to believe that this happened with one of my teachers or to some of the students I supervise.' Being a principal it's a very personal thing. You look at them as your own kids. And it's heartbreaking to see this happen.\"\n\"We're a small community. In Grantsville, the school is the heart of that community,\" Ernst said. \"It has been difficult for us. It has been difficult on the administration, and difficult on our students.\"\nErnst said at the press conference that Ware was \"very well-respected\" in the community as a football coach. \"One person told me (Ware) is probably the best football mind in Tooele County,\" he said.\nFormer student Karma Newbold told KSL.com the school had a \"send off\" celebration after school for the football team headed to a rivalry game against Stansbury High School the day of the press conference. \"But in reality, everyone knew it was in support of Ware,\" she said.\n\"I knew that it was a very tight-knit community. I was shocked because Curtis Ware was not a good coach, like, his team wasn't winning,\" Allred said. Records show Grantsville won only one game their previous season and three out of 10 the year before.\nThe day of the reporting was the last day Laurien Elsholz and Mary went to school their junior year. Paige Elsholz also dropped out soon after.\n\"Rumors were spread around the school that (the accusers) were making stuff up. And everybody believed that because (Ware) was kind,\" Lexis Perry, a student at the school from 2013 to 2017, told KSL.com. \"That's not an excuse.\"\nWithin a year of the girls reporting Ware, two other football coaches across the district resigned or were dismissed due to allegations of impropriety. The then-head football coach at Tooele High resigned in January 2017 after being investigated for having \"inappropriate communication through the phone\" with another student, according to former district spokeswoman Marie Denson. At the time, she would not go into detail about what the inappropriate communication was. No criminal charges were filed.\nA Tooele High assistant football coach was fired months later, after being arrested for sexual solicitation.\n'Just say that you made it up'\nBefore the community showed up at the Harrison sentencing, they attended Ware's court proceedings.\nAt the first court hearing, football players, students, teachers and parents packed the courtroom in support of Ware. \"It was so horrible,\" Paige Elsholz recalled. \"There were people standing in the doorway and along the sides and the judge actually had to ask people to exit because there was too many people on his side.\"\nWare's defense attorney, Susanne Gustin, said, after the initial appearance, that Ware \"has a lot of support from football players, from staff, from people in the community. ... We could have had a lot more people here, but they wouldn't have fit in the courtroom ... they definitely back him. He's well-loved in this community and they definitely support him.\"\nAnother student who accused Ware of sexual abuse moved out of state to escape the vitriol, according to Allred. When she had to testify, she would throw up in the bathroom before the hearing — so nervous and scared to speak out publicly against the coach, he recalled. \"Those poor girls, they went through hell, man.\"\n\"When we investigated (Ware) for sexually abusing some of the students, I was blown away that the teachers and the principals and everyone at that school were the ones that were attacking us,\" Allred recalled.\nThe girls involved in the case say they were told \"horrible things\" in grocery stores, their houses were vandalized, they were told to kill themselves and they received death threats and social media posts begging them to admit to lying about their claims. They stopped going out in public.\n\"When I got out of the hospital, I went to my profile on Facebook and people were actually tagging to my profile,\" Paige Elsholz said. A coach at Grantsville posted publicly to her page, she said, writing that she will \"look like the better person for just coming out and saying that you made this up, people will admire you for, you know, having the courage to just say that you made it up and you're sorry for what you made up.\"\nAt one point, Allred said he had to go into Grantsville High School and tell Ernst, \"Look, if you and the staff don't stop, I will start arresting every single staff member that talks to any of my victims.\"\nHe added, \"I'd gotten so frustrated because the staff members were making phone calls, they were doing a lot of stuff that was essentially tampering with the witnesses, and I remember telling that to (Ernst).\"\nAllred said he also received threats and public backlash, despite his position as a police officer. He recalled being cornered in a grocery store at one point by a Grantsville teacher and yelled at. He said he began worrying that community members may show up at his house to harm his family. Even the mayor received death threats, according to the sergeant.\nThe public humiliation, Guiora said, is the result of \"the enabler, who, rather than supporting them, at the end of the day, is guilty of what I call institutional complicity and the complicity of silence. They cast their lots with the institution rather than protecting the individual.\"\nParents feared how their children would be treated\nDuring the investigation, there were multiple students suspected to have been abused by Ware, but \"parents refused to let the students talk to me,\" Allred said, \"because they saw what we were going through as a police department and how the two students that did come forward were ridiculed.\"\n\"I remember one conversation I had with a dad. I remember him telling me that it's the hardest thing in the world he's ever had to do to tell his daughter to not talk about what had happened between Curtis Ware and some of the other athletic teachers,\" Allred said. \"And he goes, 'I want justice so bad, but I know deep down inside that if my daughter talks about this, the damage that's going to be done to her by those around the school is going to be way worse than anything else.'\"\nAllred said he felt some school administrators \"didn't want me to dig too much. I felt like they tried to direct my investigation in certain ways. I had challenges in getting video footage and some video footage magically wouldn't work. Just the way things would work out was really bizarre to me, that's why I kind of got the impression that (Ernst) was trying to keep me from stuff.\"\n\"I felt very stonewalled throughout the investigation,\" Allred said. \"I just didn't have the support of anyone because I was an outsider, screaming.\"\nUltimately, Allred said Paige Elsholz approached him and said, \"I'm really, really sorry, but I'm 18, I'm getting married, I can't do this anymore.\"\n\"The twins were so burned out with the process and having to constantly testify and relive the situation that they ended up just asking the prosecutor to give him some type of deal,\" he said.\nWare pleaded guilty to one count of unlawful sexual contact with a 16- or 17-year-old, and two counts of attempted dealing in materials harmful to minors, class A misdemeanors. As part of the deal, prosecutors agreed to drop the forcible sodomy charge for the alleged Cedar City incident.\n\"Once he pled guilty, everyone just kind of acted like nothing happened and didn't want to apologize to us,\" Allred said. \"There were quite a few teachers that felt that he didn't do it and he was forced into pleading guilty.\"\nWare's jail sentence was suspended, and he was sentenced to five years of probation. During the litigation, however, Ware had created a fake social media profile and began messaging Paige Elsholz, she said, despite a no-contact order. According to Allred, Ware \"met up with (Paige Elsholz) in the mountains and had tried to convince her to change her story and not testify against him.\"\nAllred was able to link a makeup smudge and DNA on Ware's shirt to Paige Elsholz, according to court documents. Ware pleaded guilty to an additional charge of tampering with a witness, a class A misdemeanor, and ended up spending 499 days in jail.\nHarrison has an outstanding criminal case against him, as well, charged with two third-degree felony counts of tampering with a witness, in a separate wrongful detention case involving his ex-wife.\nSchool district response\nKSL.com was denied requests to interview Ernst or Grantsville High School Principal Kenna Aagard. Emails were sent to every elected school board member, but requests for interviews were denied and funneled back to the district spokesperson.\n\"The board does not deal with personnel matters dealing with staff,\" Tooele County School District spokesman Brett Valdez said. All attempts to reach teachers who were believed to have attended court hearings, or those whom victims said treated them well, were also unsuccessful and reported to the district.\nValdez eventually organized a meeting with Director of Human Resources Charles Hansen, Legal Director Terry Christensen and him.\nHansen told KSL.com there are significant challenges with transparency when it comes to the handling of any allegations against staff. Oftentimes, those who report have no way of knowing whether the district acted on complaints.\nThe directors said, due to student privacy and employment laws, there will always be an asymmetric flow of information, with community members posting on social media and news outlets reporting.\nPolicy states the district is not required to release \"records containing data on individuals the disclosure of which constitutes a clearly unwarranted invasion of personal privacy,\" but does need to release \"information relating to formal charges against the employee and disciplinary action unless such charges and action are not sustained or are shown to be groundless or except as the data is already classified as public.\"\nIn response to public records requests, the Tooele School District released records of a former chorus and Spanish teacher at Grantsville High who pleaded guilty to lewdness involving a child for an incident at a Salt Lake athletic club in 2013.\nThey also released select disciplinary records from a current teacher, who was put on probation in 2011 after taking the cellphone of a male student, giving it to a teacher's aide, and telling them to \"contact male contacts in the student's list of contacts and send a text message indicating that 'I have wanted to tell you this for a while ... you are sooooooo hot! I really think I am in love with you and hope you feel the same!!! ...' before sending female contacts texts saying, ''Rumor has it you may be pregnant,'\" according to a notice of probation.\n\"As the text replies came in, you kept it going by replying back, thus exacerbating the situation,\" the notice said. The district warned the teacher of the \"severely egregious nature of the allegations,\" which she admitted to and could be \"a terminable offense from the district as well as civil action against you from the student and his family.\"\nDisciplinary actions from 2023 and 2024 against that same current teacher were mentioned but not shared due to legal concerns.\nNo disciplinary records were found for Heath or other teachers requested. A disciplinary record relating to Kody Byrd, the school's head football coach since Ware was terminated, was found, but access to the document was denied on the grounds of privacy.\nKSL.com found no evidence, besides Holmes' testimony, that any district employee failed to escalate reports of sexual assault. Christensen, who was formerly the director of human resources, terminated Ware's employment just a week after the girls came forward, finding the events \"more likely than not\" despite Ware's \"denial of allegations.\"\nOn the handling of Harrison's case, Christensen continued to push for resolution on the district side until Harrison resigned in February 2022 \"for personal reasons.\"\nThe barriers to reporting, however, appeared to be high, with Allred, students and parents saying they feared backlash.\n\"There's a lot of other people who have been victims, not necessarily by teachers, but by other students who haven't come forward because of the way that other things had been handled,\" Perry said, adding that she was assaulted her senior year of high school by a student. She said she did not report it because of how she saw the community treat accusers.\nOver the last 18 months, Valdez says \"the district activities director has worked with coaches and club leaders to ensure unapproved apps are no longer being used. Several popular apps have been prohibited due to (the district's) inability to provide proper oversight.\"\nStudent involvement campaigns have been started to promote peer trust when it comes to reporting bullying and sexual abuse.\nRegarding the repeated appearance of staff at court proceedings, directors said the district can't tell staff what to do in their free time. Valdez, at the time of the Harrison sentencing, issued a statement saying school employees who showed up in court \"did not represent the school or district in any official capacity.\"\nStaff code of conduct, however, requires employees \"to comport themselves in a way that contributes to maintaining and fostering a positive, effective, nondisruptive, and safe learning environment for students,\" on and off campus, including \"avoiding behaviors that could reasonably lead to the appearance of impropriety.\"\n\"Policy's great,\" Guiora said, \"but if you don't hold people accountable, and if people don't see that the enabler is held accountable … if it's not consistently enforced, if the enforcement is not shared widely, nothing's going to happen.\"\nCoates started a peer support group for student survivors of sexual abuse at Grantsville High School on Facebook. Other support resources can be found here:\nSexual assault resources\nIf you have experienced sexual violence, you can access help and resources.\nSexual violence hotlines\n- Utah's 24-hour Sexual Violence Helpline: 801-736-4356\n- National Sexual Assault Hotline for free, confidential counseling: 1-800-656-4673\n- Pathways (Tooele Resources) 24 Hour Helpline: 435-231-3557\n- Report suspected child abuse to the Utah Division of Child and Family Services: 1-855-323-3237\n- Call your local police department or sheriff's department\n- Children's Justice Centers of Utah utahcjc.org\n- Utah Sexual Assault Coalition www.ucasa.org\n- Rape Recovery Center www.raperecovercenter.org\nLocal resources\nSuicide prevention resources\nIf you or someone you know is struggling with thoughts of suicide, call 988 to connect with the 988 Suicide and Crisis Lifeline.\nCrisis hotlines\n- Huntsman Mental Health Institute Crisis Line: 801-587-3000\n- SafeUT Crisis Line: 833-372-3388\n- 988 Suicide and Crisis LifeLine at 988\n- Trevor Project Hotline for LGBTQ teens: 1-866-488-7386\nOnline resources\n- NAMI Utah: namiut.org\n- SafeUT: safeut.org\n- Suicide and Crisis Lifeline: 988lifeline.org\n- American Foundation for Suicide Prevention, Utah chapter: afsp.org/chapter/utah",
  "word_count": 5818,
  "scraped_at": "2026-02-14T14:15:21.565716"
}