{
  "article_id": "29588fcbf934",
  "url": "https://www.the42.ie/manchester-united-15-6379589-May2024/",
  "title": "Manchester United have mastered the superficial for 10 years . Will it really be so easy to change ? ",
  "date": "20240515T091500Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "AFTER MANCHESTER UNITED’S final home game in the Premier League last season, Erik ten Hag delivered a short, impassioned message to the Old Trafford crowd ahead of the upcoming FA Cup final with Manchester City.\nConfidence was relatively high having won the League Cup earlier in the year before then finishing third in the table, albeit well adrift of the eventual champions and second placed Arsenal.\nStill, a rousing send off by the United manager felt appropriate given the nature of his first season in charge.\nThere was a sense of purpose but there isn’t even an illusion of that now.\nFor a club that has mastered the superficial over the last decade even they must now face the bare, harsh reality of the malaise.\nBut will it really be so easy to change?\nNewcastle, tonight’s opponents as the curtain falls on a campaign bereft of spirit at Old Trafford, finished fourth in that 2022/23 season and the mood in the red half of Manchester last May was of genuine belief that United could summon a performance capable of derailing City’s Treble challenge.\nThey couldn’t.\nAnd no one expects them to come anywhere near as close to laying a glove on City this time around either.\nWhile there will be no back-to-back Treble for Pep Guardiola’s men – Real Madrid made sure of that – last night’s 2-0 win over Tottenham Hotspur means a Double is within their grasp.\nFor United, meanwhile, any kind of European football next season is almost out of reach. They’re languishing in eighth but even that might not be as far as they fall.\nBack to back defeats away to Crystal Palace (4-0) and at home to Arsenal (1-0) means they have now lost two successive Premier League games on three occasions this term – their longest winning sequence is a four-fixture run in February.\nSo no one will expect Ten Hag to demand the microphone tonight to whip up a frenzy before heading to Wembley – via a final league game away to Brighton.\nSix points from their last two games could see them end up in sixth provided Newcastle or Chelsea don’t win one of their remaining fixtures.\nIn truth, United are looking down rather than up.\nThere will be no need for a lap of honour tonight – even if the likes of Raphael Varane may feel like they want one last goodbye that wasn’t delivered down the lens of a camera for social media.\nHis exit brings to a close a frustrating three-year spell that was ravaged by injury. It began with him parading in front of Old Trafford in a suit and could end the same way given a muscle strain has ruled him out for the last six weeks.\nHe won’t be maligned or missed, simply another drifter swept up in the all-consuming vaccum of mediocrity.\nOthers will also soon depart.\nAnthony Martial won’t have his contract renewed and he would have been due a testimonial had he earned another season. There is unlikely to be any kind of carefully crafted message released on social media from the 28-year-old Frenchman.\nHe barely spoke to the media after joining in 2015 and has not played since trudging off to the sound of some jeers in the 3-0 home defeat by Bournemouth on 9 December.\nUnited’s new football administration – spearheaded by INEOS chairman Jim Ratcliffe – won’t be making an undue fuss unless they feel it’s warranted.\nThe traditional end of season awards ceremony has been cancelled at short notice, a major slight on the women’s team given they won the club’s first FA Cup last weekend.\nRatcliffe has made his presence felt on the general workforce too, describing the untidiness of the IT department as “disgraceful” in one email before later informing staff that remote working was being scrapped and bluntly explaining what they could do about it.\n“If you don’t like it, please seek alternative employment,” The Guardian reported.\nSome fans will hope he will take a similar stance with several in an underperforming squad, but the reality is much different.\nYesterday brought reports of Bruno Fernandes’ desire to leave – Bayern Munich and Inter Milan cited as two interested parties – followed by counter claims that the 29-year-old was pivotal to the club’s plans.\nNot long after Varane’s announcement, news then emerged that Tosin Adarabioyo was being lined up on a free transfer once the 26-year-old’s contract with Fulham expires this summer.\nUnited fans have longed for the club to operate coherently, with signings made within a functioning structure rather than as a reaction to the latest crisis or outcry.\nThat desire for significant, lasting change rather than the adrenaline hit of a box-office deal now looks like it is going to be put to the test.\nEven with the overhaul of those making the decisions above the manager, we will soon find out if it really will be easy for United to start doing things differently.",
  "word_count": 830,
  "scraped_at": "2026-02-14T13:13:27.820734"
}