{
  "article_id": "295aa18c97f4",
  "url": "https://www.bostonglobe.com/2023/10/20/opinion/outtakes-newsletter-renee-graham-child-killed-for-being-muslim/",
  "title": "A child was reportedly killed for being Muslim . We should be horrified , but not surprised . ",
  "date": "20231020T073000Z",
  "domain": "bostonglobe.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This is an excerpt from Outtakes, a Globe Opinion newsletter from columnist Renée Graham.\nOne of the last things Wadea Al-Fayoume did before he died was run to hug the man accused of stabbing him 26 times, allegedly because he was Muslim.\nWadea, a 6-year-old who loved soccer and Legos, lived with his mother, Hanaan Shahin, in a suburban Chicago home owned by Joseph M. Czuba for about two years without incident. But according to authorities, after Hamas killed at least 1,400 Israeli citizens and soldiers during a surprise attack on Oct. 7 and took about 200 people hostage, Czuba spent many days listening to incendiary right-wing, anti-Muslim commentary about the massacre.\nAnd that’s when Czuba, 71, allegedly began to view the boy, whose birthday party he recently attended, and his mother as a threat because they were Palestinian Americans.\nOn Saturday, Czuba reportedly knocked on Shahin’s door and attacked her, stabbing her more than 12 times as he yelled, “You Muslims must die.” As Shahin ran into a bathroom to call 911, Czuba reportedly turned on Wadea. According to court documents, police found Wadea with multiple stab wounds and “what appeared to be a knife inserted” into his abdomen. Yousef Hannon, the boy’s uncle, said Wadea’s last words to his mother were, “Mom, I’m fine.”\nCzuba has been charged with first-degree murder, attempted first-degree murder, two counts of a hate crime, and aggravated battery with a deadly weapon. US Attorney General Merrick Garland said the Justice Department has opened a hate investigation into the attack.\nFEATURED VIDEO\nIn a statement, the Will County Sheriff’s Department said, “Detectives were able to determine that both victims in this brutal attack were targeted by the suspect due to them being Muslim and the ongoing Middle Eastern conflict involving Hamas and the Israelis.”\nWe should be horrified and heartbroken by what happened to Wadea and his mother. But we should not be surprised. This is the result when a group of people are reduced to monolithic stereotypes and categorized in language that dehumanizes them — “Animals.” “Monsters.” “Savages.”\nTo me, the most horrifying scene in the 1991 classic “The Silence of the Lambs” isn’t Hannibal Lecter chewing into a man’s face or a serial killer dressing in the flayed skins of women he has murdered. It’s when a senator repeatedly uses her missing daughter’s name, Catherine, as she speaks on television to the man who took the young woman and plans to kill her.\nAdvertisement\n“If he sees Catherine as a person and not just an object,” FBI agent Clarice Starling, played by Jodie Foster, observes, “it’s harder to tear her up.”\nA child oblivious to the politics of the Israel-Hamas war was reduced to an object, a symbol to be destroyed — reportedly by a man who once bought him gifts and treated him like a grandson.\n”We’re disgusted and horrified that a 6-year-old boy was murdered and his mother was severely injured in Plainfield, [Illinois], allegedly because they are Muslim,” the Anti-Defamation League posted Sunday on X, formerly known as Twitter. “We express our condolences to the Muslim community and categorically reject all anti-Muslim hate.”\nSince the Hamas attacks and Israel’s declaration of war, Jewish, Muslim, and Palestinian communities have been bracing for spikes in hate crimes — not that such disgusting acts weren’t already too common. There’s increased security at mosques and synagogues nationwide that will likely continue for the duration of what some expect will be a protracted war that has taken a devastating toll on civilians.\nThat includes Wadea, who now sits in our sorrows with Anne Frank, Emmett Till, George Stinney Jr., Trayvon Martin, and more children devoured by hate than any heart can bear. At Wadea’s funeral Monday, Ahmed Rehab, executive director the Chicago office of the Council on American-Islamic Relations, said, “This is a heavy day that we hoped would never come. As they say, the smallest coffins are the heaviest.”\nIn truth, it was a heavy day we knew would come — and may come again — so long as any group’s humanity and identity is degraded and poisonous words are forged into real weapons that kill innocents.\nAdvertisement\nRenée Graham is a Globe columnist. She can be reached at renee.graham@globe.com.",
  "word_count": 707,
  "scraped_at": "2026-02-14T12:17:06.984988"
}