{
  "article_id": "2977413bb2fc",
  "url": "https://pressgazette.co.uk/media_business/biggest-media-companies-uk-2025/",
  "title": "Biggest united kingdom media companies : New ranking for 2025",
  "date": "20250109T164500Z",
  "domain": "pressgazette.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Three in five of the UK’s largest media companies reported growing news and information revenue in their most recent full-year accounts, Press Gazette’s latest top 50 ranking shows.\nCollectively the top 50 reported turning over £1.1bn more in their most recent accounts than they had the prior year, representing a 3.3% increase. Those businesses earned approximately £35.8bn in media revenue in their most recent accounts and £34.6bn in the year before that, although comparisons are tricky because of changes in the way companies report their figures and in the way we compile the list.\nMost of those accounts are for the 2023 financial year, covering a period when inflation ran at nearly 10% and the UK economy grew by just 0.4%.\nOur ranking is based on the most recent full-year news, information and media revenue reported by each business. Because not all companies break out their different revenue streams the same way — or at all — the below should be treated as an approximate guide to news media revenue. Press Gazette’s ranking only includes companies with a substantial news media or information element which report their financial figures in the UK.\nIf you spot a company you think is missing, please email us at bron.maher@pressgazette.co.uk.\nThe largest single full-year revenue increase came at Lloyds List parent Informa, where turnover in 2023 rose £900m, or 39%, compared with 2022. Informa now ranks fourth in the top 50, having risen one spot from our last ranking.\nThe biggest revenue decline, meanwhile, came at the BBC — which despite turning over £300m less in 2023/24 than in 2022/23 retains its second-place spot in the ranking.\nThe largest UK media company by revenue remains Lexis Nexis parent RELX, which reported turnover of £9.2bn in its 2023 full-year results. ITV, too, remains in third place.\nBut below the top three there was shuffling, with Channel 4 (seventh place), DMGT (eighth) and Future (ninth) all rising one place. Sky dropped two, to sixth, and News UK dropped four places to tenth after parent company News Corp broke out previously unavailable information about its UK revenue. (That information indicates News UK would have been 11th in our last ranking.)\nThe biggest gainer in the ranking was polling company Yougov, which rose six spots to 19th while its revenue jumped year-on-year from £258.3m to £335.3m. The next biggest rise was at the Financial Times, which rose five places to 15th on the back of a 21.4% year-on-year revenue increase.\nDelinian, the former Euromoney Institutional Investor which was taken over by a private equity consortium in 2022, dropped seven spots. Ascential, which was 12th place in our last ranking, disappeared from the board altogether after fourth-ranked Informa announced last year it was buying the company.\nMergermarket Ltd appears in the list for the first time in position 36 with turnover of £84.2m in 2023. Its parent company Acuris Holdings Ltd previously appeared in 16th place on our last top-50 list with revenue of £390.2m but it no longer reports a UK turnover figure. Acuris is itself owned by US company ION Analytics.\nSome well-known media businesses do not appear on their list either because they did not report revenue in their most recent accounts or recorded too little. Our 50th-placed company, The Spectator, turned over £20.8m in 2023: in comparison, in their most recent accounts Metropolis reported revenue of £13.3m, Tortoise Media £6.2m and GB News £6.7m.\nThis ranking also does not cover social media companies. Global advertising income for Meta (£105bn in 2023) and Alphabet (£189bn) was significantly larger in 2023 than the cumulative revenue of the entire media top 50, £35.8bn.\nThis article was updated after publication to add Private Equity Investor publisher PEI Media, which with media revenue of £45.4m in its most recent accounts entered the ranking at 43rd place. Previously, Lord Ashcroft-owned Merit Group had ranked 50th.\nOther Press Gazette top 50 companies rankings:\n2022 ranking of the biggest media companies in the UK\n2021 ranking of the biggest media companies in the UK\n1. RELX\nTop news/information brands: Lexis Nexis, Science Direct, Estates Gazette (which is being sold to Mark Allen Group)\nTotal revenue: £9.2bn\nNews/information/media revenue: £9.2bn\nSource: Full-year results for 2023\nPrevious annual revenue: Total revenue: £8.6bn; News/information/media revenue: £8.6bn\nPrevious rank: 1 (unchanged)\nFormerly known as Reed Elsevier, RELX has transformed itself into a leading player in information and analytics with a well-known stable of legal and scientific brands. The company has weathered the pandemic well as demand for its data products has remained steady. Its events company, RX Exhibitions, was hit during Covid-19 but has since bounced back.\nIts publishing division, Reed Business Information, sold New Scientist in 2017 and Farmers Weekly to Mark Allen Group in 2020. Just before Christmas it announced the sale of Estates Gazette magazine to Mark Allen Group after previously saying it would close.\nThe company attributed its revenue growth in 2023 — the last full year available — to “strong growth in face-to-face activity”, which it said more than offset print decline. It said in its annual report that it intended to complete £1bn of share buybacks in 2024.\n2. BBC\nTop news/information brands: BBC News, BBC Studios, regional channels across the UK, various other big-name shows\nTotal revenue: £5.4bn\nNews/information/media revenue: £5.4bn\nSource: Full-year results to April 2024\nPrevious annual revenue: Total revenue: £5.7bn; News/information/media revenue: £5.7bn\nPrevious rank: 2 (unchanged)\nThe UK’s largest news provider saw revenue dip in 2023/24, which it attributed to “a year of high inflation, a tough commercial trading environment and the final year of the flat licence fee”. BBC director-general Tim Davie hopes to build up the corporation’s commercial arm, BBC Studios, as a hedge against dwindling licence fee income, although its 2023/24 income of £1.6bn was down on the £2.1bn returned the year before.\n3. ITV\nTop news/information brands: ITV, Good Morning Britain\nTotal revenus: £3.6bn\nNews/information/media revenue: £3.6bn\nSource: Full-year results for 2023\nPrevious annual revenue: Total revenue: £3.7bn; News/information/media revenue: £3.7bn\nPrevious rank: 3 (unchanged)\nCommercial broadcaster ITV saw revenue decline 3% in its most recent annual accounts, for 2023, while statutory operating profit dropped 54% to £238m. Approximately half of the revenue (£2.2bn) came from production arm ITV Studios while the broadcast and streaming arm contributed £2.1bn.\n2023 marked the first full year since the launch of streaming platform ITVX, which the business said had delivered “strong growth in viewing and digital revenue”.\n4. Informa\nTop news/information brands: Taylor and Francis, World of Concrete, Cannes Lions festival.\nTotal revenue: £3.2bn (£3.4bn if you include Ascential which is now part of Informa)\nNews/information/media revenue: £3.2bn\nSource: Full-year results for 2023\nPrevious annual revenue: Total revenue: £2.3bn; News/information/media revenue: £2.3bn\nPrevious rank: 5 (up one)\nInforma saw revenue up “significantly ahead of market guidance” in 2023, the most recent full year for which results are available. The group’s chief executive highlighted “strong growth” in India, the Middle East and Asia in its annual report, saying the regions were “emerging as a material geographic growth engine”.\nThis year the business has closed two B2B news brands covering TV, Digital TV Europe and Television Business International, and bought Cannes Lions owner Ascential. It expects its AI partnerships to bring in £58.2m in 2024.\nThe company also has a large events and digital services and academic knowledge business.\n5. Bauer Media Group\nTop news/information brands: Grazia, Empire, Absolute Radio brands\nTotal revenue: €2.2bn £1.8bn)\nNews/information/media revenue: €2.2bn (£1.8bn)\nSource: Bauer Media factsheet\nPrevious annual revenue: Unknown\nPrevious rank: 7 (up two)\nPrivate German media conglomerate Bauer Media is one of the biggest media companies in the world. Its UK operation publishes many household magazine names such as Closer, Grazia and Bella and also owns and operates radio stations. In the latest RAJAR results, Bauer Media Audio UK reported it had seen a record 23.5 million weekly reach across its stations.\nRevenue for Bauer UK is not in the public domain, so we have quoted the global figure. UK revenue, while significant, would be lower than this since the family-owned company also has large operations across Europe, Australia and the US.\n6. Sky\nTop news/information brands: Sky News, Sky Sports, Sky Atlantic\nTotal revenue: £10.2bn\nNews/information/media revenue: £1.7bn\nSource: Full-year accounts for 2023\nPrevious annual revenue: Total revenue: £10.2bn; News/information/media revenue: £1.8bn\nPrevious rank: 4 (down two)\nFormed as British Sky Broadcasting in the 1990s by Rupert Murdoch, Sky has become the UK’s largest pay-TV broadcaster and its free-to-air news channel, Sky News, was until recently the UK’s most-watched commercial channel. The company has struggled in recent years, however, reporting recently that its losses in 2023 doubled year-on-year to £224m. Parent company Comcast wrote off $8.6bn (£7.4bn), or a quarter of the company’s value, four years after winning a bidding war with Disney and Fox.\nThe business reported content revenue of £527m in 2023, down from £572m in 2022. Advertising revenue also fell from £1.3bn to £1.2bn, while “direct-to-consumer” (i.e. set-top box subscription) revenue was £8.5bn, up from £8.4bn the year before.\n7. Channel 4\nTop news/information brands: Channel 4 News, Film 4, E4\nTotal revenue: £1bn\nNews/information/media revenue: £1bn\nSource: Full-year results for 2023\nPrevious annual revenue: Total revenue: £1.1bn; News/information/media revenue: £1.1bn\nPrevious rank: 8 (up one)\nLike ITV, Channel 4 is known for its entertainment programming which includes a large portfolio of TV comedies and dramas. The channel is, however, well-regarded for its news and factual programming that includes the ITN-produced Channel 4 News and investigative series Dispatches. In 2023 it reported its largest ever full-year loss, of £52m, which it attributed in part to a 9% fall in UK advertising revenue.\n8. DMGT\nTop news/information brands: Daily Mail, Mail on Sunday, Mail Online, The i, Metro\nTotal revenue: £997m\nNews/information/media revenue: £997m\nSource: Full-year results to September 2023\nPrevious annual revenue: Total revenue: £974m; News/information/media revenue: £974m\nPrevious rank: 9 (up one)\nDMGT, founded in 1896, was taken private after being acquired by the founder’s great-grandson, Lord Rothermere, in 2022. The company owns consumer brands including the Daily Mail, Metro, The i Paper and New Scientist and has recently been touted as a potential buyer of Telegraph Media Group, although it has since bowed out of the process.\nUnlike many other large newspaper companies in the UK, DMGT also has a large B2B business and holds investments in a diverse range of other businesses. After building up its publishing portfolio through several acquisitions in recent years, the company slimmed down in 2021, disposing of its insurance risk and Education technology businesses.\nIn 2024 DMGT’s investment arm DMG Ventures bought stakes in CBD business Trip, cacao upcycling business Blue Stripe and publisher-friendly AI start-up Prorata.\n9. Future\nTop news/information brands: Tom’s Guide, Go Compare, Marie Claire, Homes and Gardens\nTotal revenue: £788.2m\nNews/information/media revenue: £788.2m\nSource: Full-year results to September 2024\nPrevious annual revenue: Total revenue: £825m; News/information/media revenue: £825m\nPrevious rank: 10 (up one)\nMagazine publisher Future has grown through a series of acquisitions and is one of the UK’s biggest specialist media companies.\nFuture’s titles include special interest brands such as Tom’s Guide, Tech Radar and Homes and Gardens. In 2021 the company bought the owner of the comparison website Go Compare, Goco and the publisher of The Week, Dennis.\nFuture closed several magazines across 2024, including Total Film, iMore, Anand Tech and Broadcasting + Cable. The year also saw company chief executive Jon Steinberg announce his departure after a year and a half at the helm, although at time of writing he remains in place. Despite its revenue decline, Future rises one place in our ranking because of a chance in the way we calculated News UK revenue.\n10. News UK\nTop news/information brands: The Sun, The Times, The Sunday Times, Talksport, Talkradio, TalkTV\nTotal revenue: $929m (£717m)\nNews/information/media revenue: $929m (£717m)\nSource: News Corp full-year results for the year ending 8 August 2024\nPrevious annual revenue: Total revenue: $933m (£727m); News/information/media revenue: $933m (£727m)\nPrevious rank: 6 (down four)\nPart of News Corp, one of the biggest media operations in the world, News UK has been one of the major forces in UK media for decades.\nIn its full-year results for the year to 8 August 2024 News Corp broke out its UK business revenue, revealing turnover equal to roughly £717m. In figures filed on UK business registry Companies House, meanwhile, The Sun reported pre-tax and operating losses of £65.9m and a 5% revenue decline in the year to July 2023. That was an improvement on the year before, when losses stood at £127.2m. Upmarket sister titles The Times and Sunday Times, meanwhile, saw revenue up 3% to £385.8m, but profit down 17% to £60.9m.\nPress Gazette used News Corp’s global media revenue figure on this ranking last year, accounting for News UK’s fall from sixth to tenth place in the top 50. Based on the information provided in the most recent News Corp accounts, News UK would have ranked 11th, rather than sixth, in Press Gazette’s last top 50 ranking.\nIn 2024 News UK pulled the plug on its short-lived broadcast news station TalkTV, although a spin-off programme fronted by Piers Morgan continues to grow on Youtube.\nThe business, which formerly published the News of the World, continues to deal with the legacy of the phone-hacking scandal: Prince Harry’s privacy trial against the publisher is due in court next year. Press Gazette has previously calculated that settling phone hacking cases has cumulatively cost News UK more than £1bn.\n11. Auto Trader Group\nTop news/information brands: Autotrader, Autotrader.com\nTotal revenue: £570.9m\nNews/information/media revenue: £570.9m\nSource: Full-year results to March 2024\nPrevious annual revenue: Total revenue: £500.2m; News/information/media revenue: £500.2m\nPrevious rank: 13 (up two)\nThe well-known car classifieds magazine was set up in the 1970s after its founder brought the idea over from the US. Since then, Auto Trader Group has transformed itself into a successful digital marketplace for the auto sector. The site also publishes car reviews and buying advice.\n12. Reach\nTop news/information brands: Daily Mirror, Daily Star, Manchester Evening News, Liverpool Echo\nTotal revenue: £568.6m\nNews/information/media revenue: £568.6m\nSource: Full-year results for 2023\nPrevious annual revenue: Total revenue: £601.4m; News/information/media revenue: £601.4m\nPrevious rank: 11 (down one)\nIn its most recent full-year results, for 2023, local publishing giant and Daily Mirror and Express parent Reach reported a 5% revenue decline that it attributed to falling platform referral traffic and lowering programmatic ad yields. The company responded with one of the largest series of layoffs in recent British media history, making upward of 700 journalists redundant.\nSince then Reach has reported a further revenue decline of 5.2% in the first half of 2024, although digital revenue grew by 6.7% in the second quarter — the first quarterly digital growth at the company since 2022.\nThe company announced a hiring round toward the end of 2024, aiming to end the year with more staff than it had at the conclusion of the 2023 redundancy process by adding audience writers and general assignment reporters.\n13. ZPG\nTop news/information brands: Zoopla, Money.co.uk, Uswitch\nTotal revenue: £451.5m\nNews/information/media revenue: £451.5m\nSource: Full-year results to December 2023 for parent Zephyr Midco 2 Limited\nPrevious annual revenue: Total revenue: £391m; News/information/media revenue: £391m\nPrevious rank: 17 (up four)\nZoopla owner ZPG is part real estate company and part online publisher. In 2009, Zoopla acquired the property website Thinkproperty.com from Guardian Media Group and the Property Finder website from News International (now News Corp). In 2018, ZPG was sold to US private equity firm Silverlake in a £2.2bn deal, netting £640m for ZPG’s largest investor, DMGT.\n14. Financial Times\nTop news/information brands: Financial Times, ft.com, Sifted.eu\nTotal revenue: £443.9m per UK accounts, £510m globally according to internal figures\nNews/information/media revenue: £443.9m per UK accounts, £510m globally according to internal figures\nSource: Full-year results for 2023 and internal figures shared with Press Gazette\nPrevious annual revenue: Total revenue: £422.5m per UK accounts, £458m according to internal figures; News/information/media revenue: £422.5m or £458m\nPrevious rank: 19 (up five)\nOwned by private Japanese company Nikkei, the FT’s UK-registered company Financial Times Ltd said it had exceeded £500m in global revenue for the first time in 2023 and brought in an operating profit of £30m. In April the FT became the first UK newsbrand to announce a licensing deal with ChatGPT creator OpenAI.\nThe UK accounts do not, however, show consolidated earnings for the global business as the FT says it generates a large proportion of its revenue overseas. Using its global revenue figure, the FT would rank 13th on this list.\n15. Global\nTop news/information brands: LBC, Capital, Heart, Classic FM\nTotal revenue: £858.2m\nNews/information/media revenue: £432.2m\nSource: Full-year results to March 2024\nPrevious annual revenue: Total revenue: £806.1m; News/information/media revenue: £426.1m\nPrevious rank: 15 (unchanged)\nA series of acquisitions over recent years have brought stations including Capital, Heart, LBC and Classic FM into Global’s portfolio, making it Europe’s largest commercial radio company. In 2022, the company brought on board two of the BBC’s biggest names in news, Emily Maitlis and Jon Sopel, in a reported big-money deal that has produced the successful podcast The News Agents.\n16. Moneysupermarket.com Group\nTop news/information brands: Moneysupermarket.com, Travel Supermarket, Money Saving Expert\nTotal revenue: £432.1m\nNews/information/media revenue: £379.8m\nSource: Full-year results for 2023\nPrevious annual revenue: Total revenue: £387.6m; News/information/media revenue: £330.6m\nPrevious rank: 21 (up five)\nHaving started life in the 1980s as a mortgage subscription business, the advent of the web caused the company to evolve into a personal loan and credit card price comparison site. In 2012, the company acquired financial journalist Martin Lewis’ consumer finance site, Moneysavingexpert.com.\nNote: News/information/media revenue exclude revenue from cashback.\n17. Economist Group\nTop news/information brands: The Economist, 1843, Economist Intelligence Unit\nTotal revenue: £367m\nNews/information/media revenue: £367m\nSource: Full-year results to March 2024\nPrevious annual revenue: Total revenue: £376.8m; News/information/media revenue: £376.8m\nPrevious rank: 18 (up one)\nCurrent affairs, politics and business magazine The Economist and its associated digital offerings are the Economist Group’s flagship products. In the year to March 2024 it reported total subscription growth of 3%, to 1.22 million, and a 13% growth in digital subscriptions specifically. Operating profit rose £5m year-on-year to £47.4m while revenue dipped somewhat from £376.8m in 2022/23 to £367m.\n18. Rightmove\nTop news/information brands: Rightmove.com\nTotal revenue: £364.3m\nNews/information/media revenue: £364.3m\nSource: Full-year results to December 2023\nPrevious annual revenue: Total revenue: £332.6m; News/information/media revenue: £332.6m\nPrevious rank: 20 (up two)\nThe company operates Rightmove.co.uk, the UK’s biggest online property portal. It generates income by listing estate agents on its website and charging for advertising.\n19. Yougov\nTop news/information brands: Yougov\nTotal revenue: £335.3m\nNews/information/media revenue: £335.3m\nSource: Full-year results to July 2024\nPrevious annual revenue: Total revenue: £258.3m; News/information/media revenue: £258.3m\nPrevious rank: 25 (up six)\nMarket research and opinion polling company Yougov is probably best known for its political polls in the run-up to elections. The consumer intelligence company, which was co-founded by former chancellor Nadhim Zahawi in 2000, also covers beats from animal rights to media and football.\n20. Global Data\nTop news/information brands: Proprietary data, news and events across a range of vertical industries including pharmaceuticals, technology and financial services.\nTotal revenue: £273.1m\nNews/information/media revenue: £273.1m\nSource: Full-year results for 2023\nPrevious annual revenue: Total revenue: £243.2m; News/information/media revenue: £243.2m\nPrevious rank: 24 (up four)\nGlobal Data sells proprietary data across a range of vertical industries including pharmaceuticals, technology and financial services. Its main business is selling access to its intelligence centre news and information products. Owner Mike Danson also separately owns The New Statesman and Progressive Media Investments, which publishes Press Gazette.\n21. Delinian (Euromoney Institutional Investor)\nTop news/information brands: Euromoney, Institutional Investor, Fastmarkets brands\nTotal revenue: £271.7m\nNews/information/media revenue: £271.7m\nSource: Full-year results to September 2023\nPrevious annual revenue: Total revenue: £425.1m; News/information/media revenue: £425.1m\nPrevious rank: 14 (down seven)\nB2B business and financial information publisher and events company Euromoney Institutional Investor was taken over for £1.7bn by a private equity consortium in 2022 and has since rebranded as Delinian. Until 2019, Euromoney was 49% owned by DMGT.\nIn September this year it sold real estate events platform IMN to Informa and commercial real estate platform Green Street to IJGlobal, according to A Media Operator.\n22. Telegraph Media Group\nTop news/information brands: The Daily Telegraph, The Sunday Telegraph, telegraph.co.uk\nTotal revenue: £268m\nNews/information/media revenue: £268m\nSource: Full-year results for 2023\nPrevious annual revenue: Total revenue: £254.2m; News/information/media revenue: £254.2m\nPrevious rank: 23 (up one)\nTelegraph Media Group reported a record loss of £245m in 2023 despite a 35% rise in operating profit — the result of “potential irregularities” identified as part of a historic review of the company’s transactions with other parts of its last proprietors’ business empire.\nThe company’s ownership remains up in the air after the Conservative government intervened to prevent Redbird IMI, an investment vehicle part-backed by an Emirati royal, from acquiring it. At time of writing Redbird is in exclusive talks to recoup its investment by selling TMG on to Dovid Efune, the proprietor of The New York Sun.\nLast March TMG, which publishes two of the UK’s best-known upmarket papers, the Daily Telegraph and the Sunday Telegraph, acquired the Chelsea Magazine company which publishes The English Home and The English Garden.\n23. Guardian Media Group\nTop news/information brands: The Guardian, The Observer, theguardian.com\nTotal revenue: £257.8m\nNews/information/media revenue: £257.8m\nSource: Full-year results to March 2024\nPrevious annual revenue: Total revenue: £264.4m; News/information/media revenue: £264.4m\nPrevious rank: 22 (down one)\nThe Guardian had a tumultuous 2024, enacting a round of voluntary redundancies in advance of an anticipated £39m budget shortfall. In the event GMG recorded a £36.5m cash outflow in its 2023/24 accounts.\nIn September GMG announced it was considering selling The Observer, the oldest Sunday newspaper in the world that it acquired in 1993, to audio-first news start-up Tortoise Media. The deal was agreed in December amid a historic strike by the staff of both newspapers in protest at the move.\nFounded in 1821 as the Manchester Guardian, over half of the Guardian’s recurring digital supporters are based outside the UK, and the brand has an especially strong presence in Australia, Europe and the US. The Guardian US earned nearly $2m in reader revenue over three days after its editor wrote an open letter pitching the title as a journalistic counterweight to the Trump campaign.\n24. Haymarket Media Group\nTop news/information brands: 70 brands including What Car?, Campaign, Asian Investor\nTotal revenue: £183.1m\nNews/information/media revenue: £183.1m\nSource: Full-year results to June 2023\nPrevious annual revenue: Total revenue: £165.9m; News/information/media revenue: £165.9m\nPrevious rank: 28 (up four)\nB2B publisher, data and events company Haymarket works in many verticals including healthcare, finance, automotive as well as content marketing. After a difficult 2020, the company’s finances bounced back in 2021 and in 2022 the company reported “its strongest year for more than a decade”. The company reported profit before tax of £9.7m in the year to June 2023, down from £11.2m the year before.\n25. Immediate Media Company\nTop news/information brands: Good Food magazine, Match of the Day magazine, Radio Times, Top Gear magazine, BBC Gardeners’ World magazine, Nutracheck\nTotal revenue: £182m\nNews/information/media revenue: £182m\nSource: Full-year results for 2023\nPrevious annual revenue: Total revenue: £176.6m; News/information/media revenue: £176.6m\nPrevious rank: 26 (up one)\nUltimately owned by German media giant Hubert Burda, Immediate is best known for its magazine and special interest brands. The company cut 12 magazines and up to 113 jobs in 2020 amid the Covid pandemic. Today it is dabbling in paid podcasts and boasts more digital subscriptions than print.\n26. Euromonitor International\nTop news/information brands: Passport, Via\nTotal revenue: £173.7m\nNews/information/media revenue: £173.7m\nSource: Full-year results to March 2024\nPrevious annual revenue: Total revenue: £168m; News/information/media revenue: £168m\nPrevious rank: 30 (up four)\nEuromonitor is one of the world’s best-known market research firms with a global presence. It operates the market research database Passport and e-commerce intelligence platform Via. Customers can purchase reports on industries and geographies of interest to them.\n27. STV Group\nTop news/information brands: STV Central, STV North, Ginger Productions\nTotal revenue: £168.4m\nNews/information/media revenue: £168.4m\nSource: Full-year results to December 2022\nPrevious annual revenue: Total revenue: £137.8m; News/information/media revenue: £137.8m\nPrevious rank: 32 (up four)\nSTV started as a broadcaster before also expanding into newspapers, advertising and radio. Today the Scottish media company provides TV broadcasts, video-on-demand and television production.\n28. Independent Television News (ITN)\nTop news/information brands: ITV News, Channel 4 News, Channel 5 News\nTotal revenue: £155.9m\nNews/information/media revenue: £155.9m\nSource: Full-year results for 2023\nPrevious annual revenue: Total revenue: £164.4m; News/information/media revenue: £164.4m\nPrevious rank: 29 (up one)\nITN makes news programmes for many of the UK’s major television networks and also operates ITN Productions, which creates content including films, documentaries, sports broadcasts and archive footage. The company also produces Channel 5’s morning debate and chat show Jeremy Vine. In 2022 ITN appointed its former news editor, Rachel Corp, as chief executive.\nIn 2024 ITN signed a deal with blockchain tech company Open Origins that it hopes to use to verify its archival footage as authentic amid the rise of synthetic AI-generated content.\n29. Newsquest\nTop news/information brands: Northern Echo, Lancashire Telegraph\nTotal revenue: £192m\nNews/information/media revenue: £192m\nSource: Press Gazette reporting of full-year results for 2023\nPrevious annual revenue: Total revenue: £202m; News/information/media revenue: £202m (includes full-year figure for Archant which was acquired in March 2022).\nPrevious rank: 31 (up two)\nNewsquest, owned by US publishing giant Gannett, is the second-biggest regional publisher in the UK after Reach. In 2022, Newsquest bought the country’s fourth biggest regional publisher Archant, bringing Archant titles such as the Eastern Daily Press, Norwich Evening News and Country Life into the Newsquest stable.\nThe company has rolled out paywalls across several of its sites, reporting in September that it had passed 100,000 paying digital subscribers. It reported earnings before interest, taxation, depreciation and amortisation of £41.3m, up 2.6% year-on-year if Archant is not included and 27.3% if it is.\n30. DC Thomson\nTop news/information brands: Press and Journal, Beano, Stylist, Dundee Courier\nTotal revenue: £134.5m\nNews/information/media revenue: £134.5m\nSource: Full-year results to March 2024\nPrevious annual revenue: Total revenue: £161.4m; News/information/media revenue: £161.4m\nPrevious rank: 27 (down three)\nDC Thomson publishes a number of Scottish newspapers and websites including Press and Journal, The Dundee Courier and The Sunday Post. It is also the publisher of the longstanding comic The Beano and owns the genealogy website Find My Past.\nDespite a slight rise in revenue in the year to March 2023, the company reported an after-tax loss of £161.2m caused by investment declines. In its following accounts, published this month, pre-tax profit rose to £93.8m, of which £92m was attributed to the company’s financial assets and £1.8m to the performance of the core businesses.\nNonetheless, owing in large part to the closures of products including Scottish radio station Pure Radio, several magazines and a holiday booking platform, overall revenue dropped nearly £27m year-on-year. Recurring trading revenue dropped less sharply, down 6% year-on-year.\n31. Claverley Group\nTop news/information brands: Business Reporter, Cosmetics Business, weekly magazines and lifestyle titles\nTotal revenue: £113.8m\nNews/information/media revenue: £113.8m\nSource: Full-year results for 2023\nPrevious annual revenue: Total revenue: £115.1m; News/information/media revenue: £115.1m\nPrevious rank: 34 (up three)\nIn September 2023 Claverley sold the Midland News Association to David Montgomery’s National World, but it retains a wider business that also covers digital media, business-to-business media and events management, which is reflected in the revenue figure given here.\n32. Hearst UK\nTop news/information brands: Good Housekeeping, Cosmopolitan, Men’s Health, Women’s Health, Elle, Esquire, Country Living\nTotal revenue: £111.9m\nNews/information/media revenue: £111.9m\nSource: Full-year results for 2023\nPrevious annual revenue: Total revenue: £121.6m; News/information/media revenue: £121.6m\nPrevious rank: 33 (up one)\nHearst UK’s parent company, the US-based National Magazine Company, reported a profit before tax of £686,000 in 2023 but a £460,000 loss after tax. The business attributed the hit to platform algorithm changes.\n33. Condé Nast Publications Limited\nTop news/information brands: British Vogue, British GQ, Wired UK, Tatler, The World of Interiors\nTotal revenue: £106.6m\nNews/information/media revenue: £106.6m\nSource: Full-year accounts for 2023\nPrevious annual revenue: Total revenue: £99.5m; News/information/media revenue: £99.5m\nPrevious rank: Not included\nMagazine publisher Condé Nast publishes several localised editions of its flagship US brands, including Vogue, GQ and Wired. Advertising and other services represented £93.5m in 2023 while newsstand sales and subscriptions accounted for the remaining £13.1m.\nThe UK subsidiary did approximately three-quarters of its business in the country, with the remaining turnover originating in other countries.\n34. PA Media Group\nTop news/information brands: PA Media, Alamy\nTotal revenue: £105.7m\nNews/information/media revenue: £105.7m\nSource: Full-year results for 2023\nPrevious annual revenue: Total revenue: £99.1m; News/information/media revenue: £99.1m\nPrevious rank: 35 (up one)\nUK national news agency PA Media is owned by national and regional newspaper publishers including DMGT, Reach and Informa. The 156-year-old business itself owns stock photo agency Alamy.\nPA has grown its revenue every year since 2016, with turnover increasing 6% year-on-year in 2023 while pre-tax profits rose 65% to £5.5m. 2024 saw the departure of group editor-in-chief Pete Clifton, who has been replaced by former Evening Standard managing editor Jack Lefley. The company’s NUJ chapel achieved statutory recognition in June.\n35. National World\nTop news/information brands: National World, The Scotsman, The Yorkshire Post and various city sites under the World brand\nTotal revenue: £88.4m\nNews/information/media revenue: £88.4m\nSource: Full-year results for 2023\nPrevious annual revenue: Total revenue: £84.1m; News/information/media revenue: £84.1m\nPrevious rank: 37 (up two)\nDavid Montgomery’s National World bought JPI, the UK’s third biggest regional publisher, in 2021 for £10.2m. The company has since launched several city websites under its own “World” brand and the national news website National World and made a series of acquisitions, including Midland News Association, the Rotherham Advertiser and Insider Media, Scoop Dragon and News Chain and Press Computer Systems.\nAt the end of 2024 marketing business and Irish local newspaper publisher Media Concierge made a non-binding proposal to take over National World which the company’s board has since accepted. The deal was pending approval by shareholders at time of writing.\nRevenue was up 5% in 2023, and it forecast more than £100m in revenue in 2024.\n36. Mergermarket Limited\nTop news/information brands: Mergermarket\nTotal revenues: £84.2m\nNews/information/media revenues: £84.2m\nSource: Full-year results for 2023\nPrevious annual revenue: Total revenues: £83.1m; News/information/media revenues: £83.1m\nPrevious rank: Not included\nB2B financial news and data brand Mergermarket specialises in information, software, analytics and news focused on financial products, compliance and mergers and acquisitions. It is a subsidiary of Acuris, which appeared on Press Gazette’s last ranking in 16th place with revenues of £390.2m but has stopped reporting revenue in the UK since being taken over by American firm ION Analytics.\nMerger Market was previously owned by the Financial Times Group, which sold the company to a private equity firm in 2013.\n37. Which?\nTop news/information brands: which.co.uk, various magazines such as Which? Tech, Which? Travel and Which? Money\nTotal revenue: £83.6m\nNews/information/media revenue: £83.6m\nSource: Which? Limited full-year results to June 2023\nPrevious annual revenue: Total revenue: £85.3m; News/information/media revenue: £85.3m\nPrevious rank: 36 (down one)\nConsumer champion Which? is owned by the charity and limited company The Consumers Association. Its consumer protection advocacy and information work is funded through profits from commercial operations such as selling magazine subscriptions. Its travel brand, Which? Travel, celebrated its 50th anniversary last year.\nNote: News/information/media revenue includes revenue for the company Which Ltd, that provides most of the content on which.co.uk.\n38. LBG Media\nTop news/information brands: Ladbible, Unilad, Sportbible\nTotal revenue: £67.5m\nNews/information/media revenue: £67.5m\nSource: Full-year results for 2023\nPrevious annual revenue: Total revenue: £62.8m; News/information/media revenue: £62.8m\nPrevious rank: 39 (up one)\nManchester-based digital media and youth content publisher LBG Media continued to grow in 2023. Turnover for the group, which was floated on the London Stock Exchange in December 2021, grew 7.5%, although profit before tax fell 18.9% to £5.9m. It acquired US-based women’s media brand Betches in 2023 for an initial cash consideration of $24m.\n39. Mark Allen Group\nTop news/information brands: HR, Print Week, The Optician, the British Journal of Nursing\nTotal revenue: £66.1m\nNews/information/media revenue: £66.1m\nSource: Full-year results to March 2023\nPrevious annual revenue: Total revenue: £60m; News/information/media revenue: £60m\nPrevious rank: 40 (up one)\nB2B publishing stalwart Mark Allen Group reported a “more challenging” year in 2022/3, with revenue growing 10% compared to a 37% growth the year before. It nonetheless turned a profit of £6.6m, down from £7m the year before.\nAt the end of 2019, MAG bought out the Farmers Weekly brand from Reed Business Information and continues to gradually grow its digital reach. The company expanded into Asia and financial services with the £6.5m purchase of Bonhill Group in 2023 and added travel and aviation-focused Sixth Continent Holdings this year for an undisclosed sum.\n40. Wilmington\nTop news/information brands: Compliance Week, Wilmington Healthcare\nTotal revenue: £123.5m\nNews/information/media revenue: £58.6m\nSource: Full-year results to June 2023\nPrevious annual revenue: Total revenue: £121m; News/information/media revenue: £59.6m\nPrevious rank: 41 (up one)\nWilmington provides information, data and training to companies and focuses on regulatory compliance. The company published the Health Service Journal, a news service that covers policy and management issues in NHS England, until this year when it sold the title to a private equity firm.\nNote: News/information/media revenue include revenue for the company’s information and data operations\n41. Independent Digital News and Media\nTop news/information brands: The Independent\nTotal revenue: £56.3m\nNews/information/media revenue: £56.3m\nSource: Results for 15 months to December 2023\nPrevious annual revenue: Total revenue: £46.3m; News/information/media revenue: £46.3m (previously a 12-month reporting period, so not a like for like comparison)\nPrevious rank: 42 (up one)\nSince going digital-only in 2016, the publisher of The Independent has reported profits and growing revenue each year. Like the Guardian, The Independent in recent years has been increasingly looking to international markets and has launched editions overseas and in other languages including Spanish, Arabic, Urdu and Persian. It claimed in November to have become the largest UK-born commercial publication in the US based on Comscore data.\nAlthough revenue in 2023 was the same as in 2022, The Independent said it saw strong increase in its operating profits, recording £3.5m over a 15-month reporting period. In 2024 The Independent took over Buzzfeed and Huffpost’s operations in the UK as part of a multi-year licensing deal.\n42. Ink Global (Travel Content Limited)\nTop news/information brands: Business Traveller, various in-flight magazines, airport TV network\nTotal revenue: £54.6m\nNews/information/media revenue: £54.6m\nSource: Results for year to December 2023\nPrevious annual revenue: Total revenue: £31.6m; News/information/media revenue: £31.6m\nPrevious rank: 38 (down four)\nBusiness slowed sharply during Covid-19 as the airline industry all but grounded to a halt. However, travel publisher Ink appears to have bounced back, telling Press Gazette it made $80m (£63m) annual turnover in 2022. The company, which in 2019 published 33 in-flight magazines for many of the world’s major airlines, is growing fast, having made a number of new investments. Since paring back its in-flight publishing business, the company has purchased Business Traveler USA and has expanded its airport TV network.\nThe UK business, Travel Content Limited, reported revenue of £54.6m in the year ending December 2022, the most recent year available — significantly up from £31.6m the year before, when Covid was still biting.\n43. PEI Media Limited\nTop news/information brands: Private Equity International, Venture Capital Journal\nTotal revenue: £65.8m\nNews/information/media revenue: £45.4m\nSource: Results for year to December 2023\nPrevious annual revenue: Total revenue: £50.8m; News/information/media revenue: £36m\nPrevious rank: Not included\nPEI Media, which publishes financial brands including Private Equity International, Infrastructure Investor and New Private Markets, earns the majority of its revenue from its publishing activities, with a further third or so of its turnover from conferences. It operates mainly in the UK and US, and in 2023 reported profit before tax of £23.8m, up from £8m the year before.\n44. Centaur Media\nTop news/information brands: The Lawyer, Marketing Week, Design Week\nTotal revenue: £37.3m\nNews/information/media revenue: £37.3m\nSource: Full-year results to December 2023\nPrevious annual revenue: Total revenue: £38.4m; News/information/media revenue: £38.4m\nPrevious rank: 43 (unchanged)\nB2B publishing and information house Centaur has simplified its portfolio in recent years and now consists of two divisions; Xeim, home to its marketing brands; and The Lawyer. In 2019, the company sold off a number of its finance brands, including Money Marketing to Metropolis Group and its engineering titles to the Mark Allen Group. The company said the return to in-person events, notably the Festival of Marketing and The Lawyer Awards, were big successes during the year.\n45. City Wire Financial Publications\nTop news/information brands: Wealth Manager, New Model Adviser, Funds Insider\nTotal revenue: £32.4m\nNews/information/media revenue: £32.4m\nSource: Full-year results to December 2023\nPrevious annual revenue: Total revenue: £32.4m; News/information/media revenue: £32.4m\nPrevious rank: 48 (up four)\nHeadquartered in London, City Wire is a global company that provides, news, analysis and data to professional investors. The company also hosts events. Its brands include Wealth Manager magazine and website and New Model Adviser, which targets independent financial planners and advisers.\n46. On the Market\nTop news/information brands: Onthemarket.com\nTotal revenue: £30.5m\nNews/information/media revenue: £30.5m\nSource: Full-year results to December 2023\nPrevious annual revenue: Total revenue: £34.2m; News/information/media revenue: £34.2m\nPrevious rank: 44 (down one)\nOn the Market was set up in 2015 by a consortium of estate agents including Knight Frank and Savills as a direct competitor to industry leaders, Rightmove and Zoopla.\nPreviously a publicly-listed business, On the Market was acquired in December 2023 by real estate information business Costar. It now files accounts in the UK as Onthemarket Limited.\n47. Time Out Group\nTop news/information brands: Time Out, Time Out Market\nTotal revenue: £103.1m\nNews/information/media revenue: £28.3m\nSource: Full-year results to June 2024\nPrevious annual revenue: Total revenue: £104.6m; News/information/media revenue: £26.4m\nPrevious rank: 49 (up three)\nTime Out started life in the 1960s with a London magazine and has since grown to become a global media and entertainment company, publishing websites, magazines and guidebooks, as well as hosting live events and marketplaces.\nIn 2022 Time Out ended its London print edition after 54 years to focus on a digital-first model, a transition that it says it has completed this year. The company cited this as enabling its media division to “increasingly tap into the higher-margin, growing digital advertising space”.\n48. Evening Standard Limited\nTop news/information brands: The London Standard, standard.co.uk\nTotal revenue: £26.8m\nNews/information/media revenue £26.8m\nSource: Full-year results to October 2023\nPrevious annual revenue: Total revenue: £31.6m; News/information/media revenue: £31.6m\nPrevious rank: 46 (down one)\nThe former Evening Standard was rebranded The London Standard in 2024 as part of a major change that saw it ditch its nearly 200-year-old daily print edition in favour of a weekly print proposition. The restructure, which saw the brand lay off around half of its 140 journalists, was prompted by seven years of continuous losses at the free newspaper. Editor Dylan Jones was one of several leading figures to quit the title shortly afterward after 18 months at the helm.\nThe Evening Standard became free to consumers in 2009 after being bought by Russian billionaire Evgeny Lebedev and his father, ending a 180-year history of paid circulation. Today the Evening Standard relies primarily on advertising for its revenue.\n49. Hello Ltd\nTop news/information brands: Hello\nTotal revenue: £26.4m\nNews/information/media revenue: £26.4m\nSource: Full-year results to December 2023\nPrevious annual revenue: Total revenue: £28.8m; News/information/media revenue: £28.8m\nPrevious rank: 45 (down three)\nThe UK version of the original Spanish magazine, Hola (the UK company is a subsidiary of its Spanish parent, Grupo Hola), Hello has long been a bastion for celebrity and royal news. Although Hello has a strong print audience, Ipsos iris data indicates the brand reaches 6.1 million people online a month.\n50. The Spectator\nTop news/information brands: The Spectator, spectator.co.uk, Spectator World\nTotal revenue: £20.8m\nNews/information/media revenue: £20.8m\nSource: Full-year results for 2022\nPrevious annual revenue: Total revenue: £20.3m; News/information/media revenue: £20.3m\nPrevious rank: 50 (up one)\nThis year political, culture and current affairs title The Spectator was acquired by GB News investor and hedge fund manager Paul Marshall, who replaced longtime editor Fraser Nelson with former Conservative government minister Michael Gove. Marshall pledged to fix what he called “underinvestment” in the magazine. The changes also saw the departure of Spectator chair Andrew Neil.\nThe magazine was previously edited by former prime minister Boris Johnson from 1999–2005. It also publishes Australian and US editions.\nEmail pged@pressgazette.co.uk to point out mistakes, provide story tips or send in a letter for publication on our \"Letters Page\" blog",
  "word_count": 6791,
  "scraped_at": "2026-02-14T12:11:15.547456"
}