{
  "article_id": "297eac6e158a",
  "url": "https://www.asiaone.com/singapore/fas-surprised-snoc-sec-gen-mark-chays-remarks-young-lions-attitude-sea-games",
  "title": "FAS surprised at SNOC sec - gen Mark Chay remarks on Young Lion attitude at SEA Games",
  "date": "20251227T034500Z",
  "domain": "asiaone.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "SINGAPORE – The Football Association of Singapore (FAS) has expressed surprise at Singapore National Olympic Council (SNOC) secretary-general Mark Chay’s comments on the Young Lions’ attitude at the SEA Games.\nDuring a post-Games review on Dec 20, he said that after the opening 3-1 defeat by Timor-Leste on Dec 6 in Bangkok, the players “just walked off the field, didn’t even acknowledge the crowd”.\nChay added: “I understand disappointment, but they need to really look at sportsmanship, really look at attitude and respect of the sport, as well as the people who went there to support them.”\nAt the FAS’ own Games review at its Jalan Besar Stadium headquarters on Dec 26, general secretary Badri Ghent said officials’ reaction was one of “shock and surprise” after coming across Chay’s comments.\nEmphasising that sportsmanship is a non-negotiable trait at FAS, Badri said he had a “constructive meeting” with Chay to address some of the points he brought up.\n“I was especially surprised because I was there at the game, and myself and some of the supporters can vouch for the fact that the players did so (acknowledge fans),” said Badri.\n“In my discussions with Mark, we’ve attributed it to a situation whereby he had vacated his seat post-match and he did not see the team acknowledging the fans.”\nChay had also said on Dec 20: “I think the key to actually making any change or any progress is acceptance and awareness of their problem. I haven’t heard anything from FAS or the athletes that there is a problem. I think that is a systemic problem.”\nBut Badri said he had also discussed with Chay about the “systemic” issue and both left the meeting “feeling positive”.\nHe added: “In my discussions with Mark, there seemed to be some underlying issues between FAS and SNOC, but a lot of it stemmed from administrative elements.\n“Mark and I were more interested in looking towards the future… he clarified some of his points, which I won’t go into too much detail, but we left the meeting feeling positive.\n“It was a very productive and constructive discussion. His comments came from a position of care and concern for Singapore football. We look forward to working really closely with the SNOC, moving forward.”\nBut Badri agreed with Chay’s assessment that the Young Lions had underperformed. Chay had said on Dec 20 that the team had been “outmuscled, outpaced, outlasted”.\nBadri said: “We will be the first to acknowledge that a lot of things can be done better and will be done better. There was a lot of alignment with Mark on this.”\nWhen contacted by The Straits Times, Chay said: “We had a good discussion and agree to move forward together.”\nAt the FAS review, Singapore Under-22s coach Firdaus Kassim also apologised, adding that he takes responsibility for the team’s “underwhelming” Games campaign. A 3-0 loss to Thailand five days after the Timor-Leste defeat confirmed their sixth consecutive exit in the Games’ group stage.\nDuring the review, Firdaus also provided statistics which showed the make-up of his squad and the disparity in international experience between his team and their regional counterparts.\nAccording to him, the overall selection pool for the Young Lions had a combined total of 3,562 minutes in both senior team and U-23 international games, while Timor-Leste’s squad had 9,639 minutes and Thailand’s squad boasted a tally of 12,772 minutes.\nIn another slide that showed the players’ total U-23 and international caps, Singapore was ranked lowest – with 124 – and Vietnam the highest with 379.\n“This is the very big gap we are trying to catch up on,” said Firdaus, who was appointed in June.\n“This is one of the reasons why in the last six months, we were very aggressive in trying to arrange high-quality matches for them internationally. So when we talk about the players going into a tournament, they look inexperienced, they struggle in certain moments of the game. I think it is mainly because of the inexperience of these players. The numbers are glaring.”\nPromising action, FAS vice-president Tan Li Yu said: “Getting the minutes, the exposure for these players is of utmost importance. It is something we will continue to review.”\nHe also hinted at the addition of “senior” players to the Young Lions as an immediate remedy for improving performances. The team have lost all five of their matches in the 2025-26 Singapore Premier League (SPL) so far.\nTan said: “One of the key things we took away... sometimes there are certain things where you need senior players to lead, mentor the (younger) players, guide them on various issues. This is something that we will be looking to address. Playing in the SPL with only U-22 players at this point of time, there is a certain gap.”\nBut he would not be drawn on the expectations for the next editions of the SEA Games, saying only that they are “very committed” to giving the players the “best possible platform in terms of development”.\nThe Lionesses, led by Karim Bencherifa, were also knocked out in the group stage after losing 2-0 to Thailand and 3-1 to Indonesia.\nFAS council member Yeong Sheau Shyan said she is hopeful for the future because of the improvements to the women’s programme, with some changes to be rolled out in the “next few months”.\nBencherifa was not at the press conference. Asked about the future of both coaches, Badri was non-committal, although Firdaus reaffirmed his commitment to the role.\nBadri said: “When it comes to major decisions, including coach performance, it’s something that we look at objectively and holistically. We will have further deliberations moving forward.”\nThis article was first published in The Straits Times. Permission required for reproduction.",
  "word_count": 956,
  "scraped_at": "2026-02-14T14:19:17.986845"
}