{
  "article_id": "298b4cffe184",
  "url": "https://www.broadcastnow.co.uk/production/neo-studios-to-document-x-leagues-inaugural-season/5180230.article",
  "title": "NEO Studios to document X League inaugural season | News",
  "date": "20230315T200000Z",
  "domain": "broadcastnow.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "First ever commercial women’s American football league begins in 2024\nNEO Studios will produce an all-access documentary series for the first every commercial women’s American football league’s inaugural season.\nKicking off in 2024 with eight teams, the X League will be a seven on seven full-contact tackle football competition, and plans to launch in the US first before expanding to other territories. By 2032, it aims to grow to include 32 US cities as well as federations in the UK, Germany, Australia, Canada and Mexico, with over 400 games played a year.\nThe docuseries will follow X League athletes on and off the pitch, as they balance their football careers with working full-time jobs, serving in the armed forces, raising children and more. Viewers will also see the inner workings of the league, including the challenges the front office must overcome to prove its viability and potential.\nThe series also features Sam Gordon, founder of the Utah Girls Tackle Football League, the US’ first-ever high-school-aged female tackle football program. Gordon is an X League managing partner and is executive producer on the docuseries. X League is also backed by NFL Hall of Famer Mike Ditka, who is a managing partner alongside Gordon.\nDitka said: “As a boy in Western Pennsylvania, my goal was always to play in the NFL. I was fortunate enough to fulfill that dream and achieve success, winning Super Bowls and being named to the NFL Hall of Fame. We at the X League want to provide girls across the country and around the world that same opportunity to live out their football dreams and play the game on a national stage.”\nMelanie Capacia Johnson, president of NEO Studios US, added: “In addition to bringing women’s tackle football to the masses, we hope this series will encourage other underrecognized female athletes to continue pursuing their dreams, especially those competing in traditionally male-dominated sports. The X League is rich with incredible stories, spanning the players, coaches, front office staff, team management and fans, and we’re looking forward to documenting the action-packed inaugural season.”\nGordon commented: “Women and girls are playing football at historically high numbers, but we still have a long way to go. We, alongside our partner NEO Studios, believe storytelling is a key part of growing the game, and this series has the power to inspire generations of female football players by spotlighting aspirational on-the-field heroes on a commercial stage.”\nNEO Studios is primarily female led, and global CEO Anouk Mertens recently told Broadcast Sport how she made it to the top despite sexism in a male-dominated industry, and is now aiming to provide opportunities to others.",
  "word_count": 441,
  "scraped_at": "2026-02-14T12:38:46.297670"
}