{
  "article_id": "298cf949a71f",
  "url": "https://www.westernpeople.ie/your-community/local-notes-martin-regan-is-kiltimagh-poker-champion-_arid-31433.html",
  "title": "Local Notes : Martin Regan is Kiltimagh Poker Champion . - Community",
  "date": "20240917T223000Z",
  "domain": "westernpeople.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Summer Poker League reached an exciting climax in Teach O’Hora on Tuesday night, September 10, when fourteen players contested the Grand Final for a prize pool of €2,080. After over six hours of play Martin Regan emerged victorious to claim the title of Kiltimagh Poker Champion and win the Jeremy Dee Memorial Cup for a second time. Long-time chip leader Derry O’Sullivan, was the runner-up, with Pat Boyle third and Michael Sheridan fourth. A new league begins in Teach O’Hora this week, on Wednesday night, September 18 and will continue with tournaments every Wednesday night at 8pm for fifteen weeks. Entry each night is €20 with an optional re-entry and late registration available for 90 minutes. €5 from every entry goes towards the league final prize pool with the rest paid out on the night. After fifteen weeks, the top twelve players qualify for the Grand Final to compete for an estimated prize pool of over €2,000. They will be joined by two more players from the play-off tournament which is open to all non-qualifiers. Meanwhile the date for the 2024 Culchie Poker Open has been announced and this prestigious tournament will be held in the Cill Aodain Court Hotel on Saturday, October 12, at 4pm. Entry is €100 and it will be a fully dealer tournament. Numbers are capped and pre booking a seat is essential.\nJust a few days after it was announced that key players, Ronan Malee and Niall Walshe had retired, comes news of another double retirement from Kiltimagh Knock United. James Costello and Paul Byrne, who have made up the KKU management team for the past three seasons, will not be continuing with the club’s A team next season.\nTwo of the highest respected coaches of the game in the county, James and Paul have contributed significantly to the club’s senior football success and growth since taking the reins of the A team, three years ago. They have built KKU’s position as an established Mayo Super League team.\nTheir contribution to football in Mayo in general is well respected. James was part of the Mayo intercountry management team, which got to the final of the Oscar Traynor Cup – the All-Ireland of inter-county soccer – last May. Paul has a long history of involvement at underage coaching in the county set-up also.\nAs James and Paul move on from this chapter in their careers, the club has expressed its great thanks to them, for their commitment and wishes them the best for the future.\nThe twin departure leaves the club without a manager as it stands, but the new league season doesn’t commence until late February, so the club has plenty of time to fill the vacancy.\nKiltimagh Knock United has been awarded funding of €50,000 under the Community Climate Action Fund. The funding will be used towards the installation of solar panels on the clubhouse, retrofitting the lights on the astro-turf pitch to LEDs, insulating the clubhouse building and installing a rainwater harvesting system. The award is part of a national fund of €27 million, announced last week provided to local authorities to partner with community groups, supporting initiatives like community gardens, solar energy, EV charging, and community composting. The fund was established in 2020 to provide support for projects, initiatives and research that contribute to the achievement of Ireland's climate and energy targets. The money comes from a number of sources including official flight emissions offset payments, and from the levy paid to the National Oil Reserves Agency in respect of disposals of petroleum products. In total, €609,000 was awarded across sixteen projects in Mayo.\nThe Kiltimagh Knock United U16 girls booked their place in the U16 Shield final with a 5-0 win over Castlebar Town. Leading 2-0 at half-time, KK started the second half as they did the first, with an early goal, and worked hard to the final whistle to secure a good win.\nNicola Campbell, Knock, was the winner of last week's Kiltimagh Knock United 50/50 jackpot. Nicola collects €304 in return for having played the weekly fundraiser.\nThree Kiltimagh Knock United players have been named on the U17 Premier Division Team of the Year by the Mayo Women's League. They are Áine Monaghan, Kate Byrne and Aoife Collins. Congratulations to all three girls. The awards will be presented at an event later in the season when all the women's league competitions conclude.\nOne of the biggest events in the social calendar, the Kiltimagh One Act Drama Festival, will be held on November 8, 9 and 10, in the Town Hall Theatre. Nine plays will be staged in total.\nOn Friday, November 8, at 8pm, Upstage Players, Claremorris, present ‘Invisible’ by Tim Oates and Robert Holden. Shannonside Drama Group, Clonlara, Co. Clare bring ‘A Matter of Life and Death’ by Michael Sullivan, and Lucan Drama will stage ‘Mary Mary’ by Bruce Adam.\nOn Saturday, November 9, at 8pm, Brideview Drama Group come all the way from Waterford with a play called ‘Save Me,’ by Mark O'Leary, and Butt Drama Circle from Donegal bring ‘A Matter of Rights,’ by Shaun Laverty. Saturday night also sees the local Clann Machua Drama Group, Kiltimagh, bring to the stage, ‘Baby Steps’ by Moira Mahony and Sarah Fahy.\nOn Sunday, November 10, at the earlier time of 5pm, Palace Players make the trip from Fermoy, Co Cork, with ‘Even Numbers,’ by Tony Domaille, The Wilde River Drama Group from Ballinrobe, bring ‘Aubade,’ by Mark Yeates, and the final play is brought to the stage by Ennis Players, Co Clare, with their production of ‘Dragonflies,’ by Liam McCarthy.\nThe festival adjudicator is Mr Declan Drohan. Declan Drohan M.A. H.Dip.Ad.Ed. currently lectures on the BA Hons. Programme in Performing Arts at Atlantic Technological University Sligo, and the multidisciplinary MA in Creative Practice. A graduate of the Gaiety School of Acting, he is the former course leader of the acting programme at TUD's prestigious Conservatory of Music and Drama, Rathmines, Dublin. In a thirty-year career, his work as a director has encompassed everything from radical reappraisals of classical texts. He has staged new writing and innovative community based projects integrating individuals with often profound disabilities, into large scale, mainstream theatre projects. He has served as Senior Youth Theatre Director at the Glens Centre, Manorhamilton for fourteen years. He is also a board member of the Glens Centre.\nTickets for the festival will be available soon.\nTommy Ryan was the winner of the recent Kiltimagh GAA 50/50 jackpot. Tommy won €580 in the draw which took place in Kitties.\nThe annual general meeting of Kiltimagh Women’s Group will be held in The Parish Centre on Monday, October 7, at 8pm.\nCreative Writing classes will be held in the Library commencing tonight, September 17. The facilitator is international poet and dramatist, Terry McDonagh. The classes commence at 7pm every Tuesday, for four weeks and all are welcome. Further details are available by contacting the library on 094 938 1786.\nKiltimagh Women’s Group have organised chair yoga sessions on Mondays in The Parish Centre. The sessions begin at 12.30pm and places are limited. Anyone interested is asked to call or text Monica on 086 101 1388.\nThe Book Club resumes in the library on Wednesday, September 18, at 7pm. All are welcome to attend. The current read is ‘Wild Houses’ by Colin Barrett. Born in Canada, Barrett spent his childhood in Knockmore. In a review of the book, The Guardian said: ‘This is a writer of glaringly obvious talent, operating at a seriously high level. In ‘Wild Houses’ we see for the first time Barrett’s evident abilities playing themselves out across the wider horizons of the novel form.’ The book made the longlist for the 2024 Booker Prize. The story is set around Ballina and tells the story of two outsiders striving to find themselves as their worlds collapse in chaos and violence.\nA breathwork class will be held in Louisville Physiotherapy Centre, for six Tuesday nights, starting tonight. The class runs from 8.30pm for an hour. Breathwork is beneficial for relaxation, stress reduction, sleep, focus, athletic performance and more. The cost of the course is €70 or €15 per session. Anyone attending is asked to bring their own yoga mat, cushion and blanket. Further information is available from Carmel on 087 697 2726.\n***************************\nMary and Mary T Brett are hosting a coffee evening in aid of Mayo Roscommon Hospice on Thursday, September 26, in Mayo Abbey Training Centre from 4 to 8pm. As you know Mayo Roscommon Hospice do great work for those in need of care and comforting support to their families. It is your support and donations that keep this vital service going.\nThe death took place after a short illness of Gerry Healy, Gortnara (formerly of Ballintleva, Mayo Abbey). Sympathy is extended to his wife Mary, sons Barry and Alan, his brother John (Claremorris) and his sister Mary (USA); the death has taken place of Tommy Joe Walsh, Ballyglass. Sympathy is extended to his wife, Joan, his son Bryan, daughter Aideen, grandson Cian, brother, Sean (Claremorris), sisters Rosaleen Halligan (Ballyglass), Josephine Walsh (Dublin), Bernie O’Connor (Cavan); the death took place of James Jeffers, Kilnagower, Claremorris (formerly of Townalough, facefield). Sympathy is extended to his sisters Agnes Mellett (Hollymount), Kathleen Hennessy (Thurles) and his nephews and nieces.\nMayo Gaels are having their annual clothes collection. The clubhouse will be open every Monday evening from 6.30 to 7.30pm until Monday, September 23. All donations will be greatly appreciated. Please note NO duvets, cushions or pillows.\nA 4km Fun Run/Walk will take place on Saturday, September 28, at 5.30pm. Entry fee is €10. All proceeds go to Mayo Gaels Bord na nÓg and the LGFA. Get your running shoes on and bring a friend.",
  "word_count": 1626,
  "scraped_at": "2026-02-14T12:42:04.217643"
}