{
  "article_id": "29b0edb3eb3b",
  "url": "https://www.sbs.com.au/news/podcast-episode/evening-news-bulletin-13-july-2024/xe04etnfq",
  "title": "Evening News Bulletin 13 July 2024",
  "date": "20240713T070000Z",
  "domain": "sbs.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\nTRANSCRIPT\n- The Prime Minister rejects criticism from the Russian embassy over espionage arrests\n- A man dies after boat capsizes near the Queensland border.\n- Australian Jess Hull sets a new world record.\nPrime Minister Anthony Albanese has told Russia to \"back off\" after its embassy accused Australia's security chiefs of fuelling \"anti-Russian paranoia\" over an alleged spy couple accused of trying to access classified defence information.\nTwo Russian-born Australians have been arrested over an alleged spying scheme targeting the Defence Department.\nThe Russian Embassy in Canberra has accused Australia's federal police and spy agency chiefs of fuelling anti-Russian paranoia.\nMr Albanese says Australian agencies are working with members of the Five Eyes intelligence alliance* to keep Australians safe.\n\"Russia can get the message: back off. Russia engages in espionage here and around the world. Russia has no credibility. The message to Russia is: how about you get out of Ukraine? And stop the illegal and immoral war that you're engaged in. And how about you try to stop interfering in domestic affairs of other sovereign nations?\"\nA man is dead and another has been rescued, after their boat capsized near the Queensland-New South Wales border.\nEmergency crews arrived at the mouth of the Tweed River earlier today and launched a multi-body rescue operation involving local and marine police, a rescue helicopter and lifesavers.\nOne man was rescued and taken to Tweed Heads Hospital as a precaution, the second man was unable to be revived.\nA spokesman for New South Wales Police says a report is being prepared for the coroner, but initial inquiries indicate neither man was wearing a lifejacket.\nThe head of the UN agency for Palestinian refugees, Philippe Lazzarini, has welcomed a joint statement of support signed by 118 member states.\nIsrael has accused UNRWA of turning a blind eye or collaborating with Hamas and other armed groups in Gaza, and of perpetuating the decades-old Palestinian refugee crisis - accusations the agency denies.\nUNRWA provides basic services to millions of Palestinian refugees from the 1948 war surrounding Israel’s creation and their descendants, who make up a majority of Gaza’s population.\nMr Lazzarini says the work agency is incredibly important - and can't be achieved without support.\n\"We have in Gaza more than 600,000 girls and boys living in the rubble, deeply traumatised and for whom our joint commitment should be to bring them back as soon as possible in an education environment if we do not want to sacrifice an entire generation and sow the seeds for more violence in the future.\"\nDonald Trump says he and President Joe Biden should take cognitive exams together, saying it would be for \"the good of the country\".\nHe made the remarks in a post on social media, suggested that cognitive tests should be compulsory for everyone vying for the White House.\nMeanwhile, Joe Biden has launched a vigorous defence of his candidacy, addressing an enthusiastic crowd in Detroit.\nHe declared unequivocally \"I am running\", after 19 members of his own party publicly called for him to drop out of the presidential race.\nIn the 36-minute engagement, Mr Biden for the first time laid out what his priorities would be in the first 100 days, if he was elected for a second term.\n\"We're at a stand up for women in America. We're gonna protect contraception. We're going to protect IVF. And we're going to we're going to restore Roe Wade is the law of the land.\"\nIn football, Matildas coach Tony Gustavsson says the team plans to use their friendly against Canada as the perfect warm-up for a gruelling Olympics group stage.\nAustralia face the reigning Olympic gold medallists in Marbella on Sunday morning.\nIt will serve as preparation for taking on Germany in Marseille on July 25 Zambia in Nice on July 28 then the United States in Marseille on July 31.\nGustavsson says the Canadians are tough defensively and pacy in attack - and the Matildas will be prepared for that.\n\"They haven't played a game in a long time - and we're playing against Olympic champions (in Canada) and we're a little bit heavy-legged because we trained hard. So it will be a challenge, but that replicates a little bit what it will be like further down the tournament as well, with heavy legs and playing in heat. So we just need to prepare. This game is all about preparing for the Olympics. It is not an isolated gane per se. It doesn't mean we're not going to try and win - but it's all about preparing for the Olympics.\"",
  "word_count": 779,
  "scraped_at": "2026-02-14T12:09:46.552511"
}