{
  "article_id": "29e904e90056",
  "url": "https://www.thepinknews.com/2023/02/20/jakub-jankto-hopes-his-coming-out-sets-postive-example/",
  "title": "Jakub Jankto : Players  afraid  to come out , gay footballer says",
  "date": "20230220T143000Z",
  "domain": "thepinknews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Jakub Jankto: Gay Czech footballer reveals other LGBTQ+ players are ‘afraid’ to come out\nCzech Republic international footballer Jakub Jankto has said he wants to be “positive inspiration” to other gay players who have yet to come out, following the positive response to his recent announcement.\nThe 27-year-old midfielder made global headlines after he announced his sexuality in a video posted on social media on Monday.\nJankto’s move makes him the only out gay international in the men’s game, and one of just a small number of well-known footballers to have come out while still playing.\nOn Thursday (16 February), in an interview with Czech radio station Radiožurnál, Jankto spoke about the “difficult decision” to reveal his sexuality, but said he is now “very happy”.\nHe added: “The most important thing for me is that now I can finally live the way I want. So I was relieved.”\nIn response to the viral video, Jankto said the reaction was incredible.\n“I expected it to be big, but I didn’t expect the biggest teams in the world, the biggest organisations to stand behind me.\n“That made it easier for me afterwards. I hope that these are not just words, but that it is the kind of support that others with a different orientation will be able to rely on.”\nJankto revealed that he wasn’t inspired to come out by anyone in particular, but noted that in women’s football the environment “is easier for society to grasp and more acceptable than in men’s football”.\nSeven members of England’s Euros-winning Lionesses are LGBTQ+.\nJankto added: “It’s probably not a coincidence that I came [out] first. The boys are simply afraid of it, they are afraid of the reaction of the public.\n“I hope to be a motivation for them, to give them a positive example.”\nJankto reflected on the fact he remains “one of the first footballers in the top leagues of Europe and the world” to have come out during his career, rather than after retiring.\n“I told myself that I don’t want to quit because of this and that I want to set a positive example for other people. That despite a different [sexual] orientation, you can normally continue working.”\nHe added that he gave the news to his parents and a friend abut 18 months ago.\n“Once you say it for the first time, it will slowly spread to other people. But there was still a barrier, so I decided to announce it publicly. In retrospect, I am very happy about it.”\nIn preparing to come out, Jankto spoke with his team, Sparta Prague, who he said supported him fully and had a “fantastic” reaction. He is on loan at the Czech club from Getafe, who play in Spain’s top league, La Liga. He has also played at the top level in Italy.\n“Sparta’s reaction was generally very positive and I thank them all very much. It really wasn’t easy for me.\n“We told ourselves that nothing was changing and that we would continue as normal. The players took it quite normally.”\n‘The tabloids will always talk you down’\nFor a while, he was in a relationship with model Marketa Ottomanska and has three-year-old son with her.\nWhen probed about media attention focusing on his private life and ex-partner, Jankto said: “The tabloids will always talk you down.”\nThomas Beattie, an English player who spent most of his career with teams in Canada and Singapore, and came out after being forced to retire, through injury, in 2020, told PinkNews: “[It’s] very significant having another male footballer come out, especially the level that Jakub is playing at”.\nJake Williamson, a gay footballer and Stonewall sports ambassador, described the event as huge, considering the global outlook for LGBTQ+ people.\nInterview translated from Czech.",
  "word_count": 631,
  "scraped_at": "2026-02-14T13:03:21.356225"
}