{
  "article_id": "29fafeae53e6",
  "url": "https://www.aol.com/news/dare-dream-lia-walti-message-000100033.html",
  "title": "  Dare to dream  – Lia Walti message to her younger self",
  "date": "20230308T020000Z",
  "domain": "aol.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "‘Dare to dream’ – Lia Walti’s message to her younger self\nLia Walti has won the Women’s Super League with Arsenal and is captain of Switzerland, having collected almost 100 senior international caps.\nThe 29-year-old was named in the PFA Team of the Year in 2018-19 after joining the Gunners from Turbine Potsdam just a year earlier and helped them to Continental Cup success against Chelsea on Sunday.\nHere, to mark International Women’s Day with the PA news agency, she has written a letter to her childhood self about how the world has changed for females.\nDear younger self,\nGeneration after generation, women were not allowed to do sports.\nThey were ridiculed, humiliated, and not accepted as athletes.\nWhen you were little, at football tournaments, your team always had a one-goal lead before even starting a game – because they had you as a girl in the team.\nAt some tournaments, your goals counted double – because you were a girl.\nThe only way for you to improve your skills was to play in boys’ teams – because for girls, there were close to no opportunities.\nIt was only in 1970 when women were first allowed to play football in Switzerland.\nHence, you wouldn’t probably believe me if I’d told you how my life looked like today – 50 years later.\nToday, my team and I have played in front of a 50,000 crowd in a Women’s Super League game.\nToday, we travel through Europe for Champions League games.\nToday, our friends and family can watch our games on television.\nToday, more people in Germany have watched the Women’s Euros final than the men’s World Cup final.\nToday, I am able to earn a living from my passion.\nToday, I don’t have to spend my savings to live in a life of football.\nToday, there are female idols.\nToday, playing football is a career for women as well as for men.\nToday, playing for big clubs is no longer a utopia – it has become reality.\nToday, I live the dream that you haven’t even dared to dream.\nToday, I dare to dream because dreams like that can come true.\nToday, we stand on the shoulders of those women who have dared to dream a long time ago.\nIt still isn’t perfect, there is more we need, new dreams we have.\nI dream about a world where everyone can do the sport that they like.\nA world where sports provide places of connection rather than exclusion and discrimination.\nA world where everyone has idols and feels represented.\nA world where our gender does not prevent anyone from doing what they like.\nTherefore, we must dare to keep on dreaming because we are not there, yet.\nLove, Lia.",
  "word_count": 457,
  "scraped_at": "2026-02-14T12:38:51.915068"
}