{
  "article_id": "2a44d8c6c45f",
  "url": "https://www.theguardian.com/football/2023/nov/22/football-daily-email-argentina-brazil",
  "title": "Lionel Messi , harder men and an historic night of woe for Brazil | Soccer",
  "date": "20231123T060000Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "THE MARACANÃ-WOE\nThere is a common mistake that is often committed when it comes to Argentina in that they are regularly referred to as Lionel Messi’s Argentina, a moniker that does disservice to the players who are really leading the team to new heights. On a night of aggression, fouls and police batons being swung with wild abandon at visiting supporters at the Maracanã, it was one of the true heroes, Nicolás Otamendi, who stepped up to inflict the very first home World Cup qualifying defeat on Brazil in their history.\nTo think that World Cups and Copa Américas are settled by forwards is naive. Goals win games but defences win championships, as any tea-time football email will tell you. Argentina have two of the hardest of hard men going at centre-back in the form of Otamendi and Cristian Romero, so to think Messi is more important than them is foolish. It took a pinpoint corner from Giovanni Lo Celso to find the former Manchester City man to settle the result in the 63rd minute. None of your dribbling and fancy skill that people seem so fond of.\nMessi is the spin doctor of the team, the man who manipulates like no one else, seeing methods that others cannot to secure the desired result, but sometimes an iron fist is required. He approached the away section when police entered before kick-off with batons swinging and blood pouring, as he attempted to calm a situation that would delay the match by half an hour as some supporters sought sanctuary on the pitch. “This team continues to make history,” Messi later chirped. “Great victory at the Maracanã although it will be marked by the repression of Argentina fans once again in Brazil. This madness can’t be tolerated, and it has to end now!!” Messi did the talking while Emi Martínez, a man who knows a thing or two about an iron fist, took action by trying to stop a police officer brandishing a baton in the melee. One assumes the police backed down once they saw Otamendi and Romero giving them the stare.\nOnce a significant victory was secured after a tense night in Rio de Janeiro, there was another surprise in the post-match press conference when Lionel Scaloni announced he was considering quitting the world champions. “It’s not goodbye or anything, but I need to think because the bar is very high and it’s complicated to keep going and it’s complicated to keep winning,” tooted the former West Ham defender. A managerial departure can often disrupt a successful side, but few in Argentina will be worried with Otamendi and Romero producing the goods … and Messi doing bits and bobs. You can bring your fouls, batons and dinner because by the time La Albiceleste are done with you, you will need it.\nLIVE ON BIG WEBSITE\nJoin Sarah Rendell from 8pm GMT for MBM updates from Eintracht Frankfurt 0-3 Barcelona in Women’s Big Cup.\nQUOTE OF THE DAY\n“Last year I was very quick to compare my big brother Dr Mahamudu Bawumia to Harry Maguire. Mr Speaker, I now apologise. Today Mr Maguire has turned the corner and is a transformational footballer. Maguire is now scoring goals for Manchester United. Mr Speaker, Harry Maguire is now a key player for Manchester United. As for our ‘Maguire’ he is now roaming at the [International Monetary Fund] with a cup in hand. As for our economic Maguire, he is able to get pensioners to leave their homes and come and parade in the streets” – Ghanaian MP Isaac Adongo offers an apology to Harry Maguire in parliament for comments made about his competence. In 2022, Adongo compared the player to the vice-president, claiming Maguire “became the biggest threat at the centre of the Manchester United defence”. But like all good politicians, he has now backtracked on at least part of his condemnation.\nFOOTBALL DAILY LETTERS\nSo, Manchester United players think their utter shambles this season is due to\nanything and anyone apart from themselvesoverworking in pre-season. It strikes me that an interesting thought experiment in the style of Schrödinger’s cat would be if you put a finite number of Manchester United players in a locked dressing room, how long it would take before just one of them achieved some degree of self-awareness and suggest that perhaps they are the problem? But then self-awareness isn’t their thing, although irony clearly is” – Noble Francis.\nRe: running up the score (Football Daily letters passim). Youth soccer here in the USA USA USA can be extremely one-sided. A common tactic I’ve observed coaches employing when they begin to run away with the result is to implement a pass restriction before shooting. I will hear the coach shouting something like ‘three passes before you can shoot’ or ‘we must have five passes before scoring’. As a parent on the sidelines, I wonder what is more insulting to the other team: running the score up or hearing the other coach shout those instructions? Losing heavily is one thing, but knowing that you are part of a game turned training session is another level of humiliation” – Stephen Jackson.\nI used to referee in the Catholic Youth League in Maryland, where the Mercy Rule applied. If a team took a seven-goal lead, they had to withdraw one player from the field. If their opponents reduced the lead, that player could come back on. I (and I alone) referred to it as the Sisters of Mercy Rule. Or, Law 18 – decreed by Mother Mary. Clear evidence the Football Gods exist” – Ian Plenderleith.\nIn the cubs’ league as a boy, we played a team which included Murdo MacLeod (future Scotland, Celtic and Dortmund star), plus two other future professionals (one being his brother). I was our keeper and, after being 21-0 down at half-time, managed to keep the full-time score to a mere 28-0. Not due to any sporting let-up from them. The trick? In the first half there was a fence two yards behind the goal. In the second there was 50 yards of red blaes (no nets of course). My slow walk to retrieve the ball was a masterclass in game management. Oh, and did I mention the match was only 30 minutes each half?” – Gavin Stewart.\nSend any letters to the.boss@theguardian.com. Today’s letter o’ the day winner is … Gavin Stewart, who lands a copy of Arsène Who? by Ryan Baldi. We’ve more to give away all week, so get typing.\n-\nThis is an extract from our daily football email … Football Daily. To get the full version, just visit this page and follow the instructions.",
  "word_count": 1112,
  "scraped_at": "2026-02-14T12:16:55.582641"
}