{
  "article_id": "2a4c40511c91",
  "url": "https://www.in.gr/2025/04/08/english-edition/dimitris-karydis-boy-wonder-became-mentor-champions/",
  "title": "Dimitris Karydis - The  Boy Wonder  Who a Became Mentor to Champions",
  "date": "20250408T080000Z",
  "domain": "in.gr",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The «Wunderkind» of Greek swimming has grown up. He’s 74 now, but the sport he loves has also grown hugely in stature under his stewardship of the aquatic sports section of his beloved Olympiacos.\nThe greatest figure in Greek swimming by a country mile, Dimitris Karydis reached such dizzying heights as both a swimmer and as a coach that he has left an indelible mark on the sport.\nHaving started his swimming career at Olympiacos in 1960, he served the great club for a lifetime, with some of the country’s greatest talents passing through his hands. Needless to say, Elli Rousaki was also a protegee of his.\nThe man who broke the national record in the 100m freestyle on six separate occasions (no other athlete has matched that), the first Greek to swim the distance in under a minute, he would bring his time down to 56.09 at the 1972 Balkan Games in Sofia, when he broke the record for the sixth time in his career.\nThe nine additional national records he set in his beloved butterfly (100 meters), with no fewer than 25 national records across every event, easily earns Karydis a place among the top 10 record holders of all time, despite his competing in an era when conditions were clearly more difficult, and the events far less numerous, than in the past. He also has 20 victories in the Greek championship, plus multiple distinctions in the Balkan and European Youth Games (European Champion) to his credit.\nHe started swimming in 1960 at Olympiacos, the club where he would spend a lifetime as an athlete, then a coach. It was always destined to be so, since his father, Kostas Karydis, was himself an executive at the Piraeus club, serving as its general secretary from 1956 to 1967. He was the third child born to Kostas and Eleni, following on from Antonis and Giorgos.\nFrom the Zappeion to Lučić, and from Gianniotis to Gemelos, a path characterized by persistence, love for the sport and a belief in Olympiacos\nHard times\n«Conditions were tough in the 1960s, since there was just the one swimming pool, near the Zappeion Hall in central Athens, which all the clubs used in the summer months. There was nowhere to swim in the winter! Things improved from 1962-1963, with the opening of the swimming pool at the School of Naval Cadets in Piraeus, where the athletes could swim during the winter, though only three times a week», Karydis said a few years ago, in an interview published in the Greek Swimming Federation magazine.\nKarydis swam freestyle and butterfly and excelled at the 100 meters in both. He retired in 1973 at the age of 22. But while he quit competitive swimming early, he also started coaching very young, at just 25. He would serve as head coach at Olympiacos until 1990. He would continue his coaching career at the Heraklion Swimming Club, in Egaleo and at Arionas Glyfada, returning to Olympiacos before moving on to Petroupoli, Panionios and the Paphos Athletic Club in Cyprus. Today, he enjoys life and keeps a watchful eye on swimming from afar. He has five children and has always remained loyal to Olympiacos.\n«Olympiacos’ all-powerful position today is down to the outsize devotion of various people in the past and to the current administration’s determination to support its aquatic sports in every way it can, and to keep the club at the very top. So, in the past there were a dozen incredibly dedicated people, while now it’s the board of directors that contributes the most to Olympiacos’ status as champion,» he says.\nIn 1972, he participated in the Olympic Games in Munich, while he also took part in two European Championships: in 1966 in Utrecht (27th in the 100m butterfly) and in 1970 in Barcelona. The World Championships only began in 1973, a year after he retired as a swimmer, hence his lack of participation.\nIn 1965, in Athens, he was the first Greek to swim the 100-meter freestyle in under a minute (58.8); it would be 12 whole years until another of his countrymen repeated the feat, when Kostas Koskinas of Olympiacos swam 55.88 in Sandanski in 1977, in what was the first Greek national record with electronic timing. Another 28 years would go by until Aris Grigoriadis of Aris Thessaloniki became the first Greek swimmer to break the 50» barrier, clocking 49.51 in the Athens Olympic Pool on March 6, 2005.\nThe newspapers of the time referred to Karydis as the «boy wonder» of Greek swimming, while they would later describe him as the «Nikos Galis of swimming», in the light of everything he had done for the sport.\nZappeion\n«My father’s brother had a cottage in Vrilissia, and my mother and I would go up there in the summers to visit them. And the bus would pass by the Panathenaic Stadium and Zappeion. A child still, I’d see the lights, people and life in there, and I’d ask my mother what went on in there. And she’d answer: ‘They swim in there’. And that’s how I started,» he revealed in an interview on andro.gr, in which he also spoke about the great Kostas Prekas—though it wasn’t in Zappeion he first saw him dive, but somewhere else.\n«I used to see him diving off the rocks in Piraeus. We were neighbors, too, we lived across the street from one another, near Pigada, in Aristotelous Street. And he and some other guys used to dive off the Terpsichori pier. They’d jump off… houses, too, if there were no rocks in the water. But it was the swimming pool that suddenly started to exert its pull on me in ’58-’59. And there was no information available back then, or anything. At some point, however, perhaps because of my father who was far more interested in the amateur sections—sports, athletics and swimming—and far less in football, Olympiacos decided to make a new start in water polo and swimming. And they brought in a Yugoslav coach, Milo Lučić, who they put in charge of both polo and swimming. So Lučić arrives and takes a look at all the swimmers, who are 14 or 15 plus years old. And he says, ‘Is there no baby? Any little kids, you guys?’ And my father says to him: ‘I have three. I’ll bring you two, the other one’s still too young’… ‘So how old is he’?» «Nine.» «I want him!» Lučić turns to him and says. «Bring them and the others, but I want kids like your little one.» He singled me out and put me in the teams».\nFor both polo and swimming\nBack then, everyone took part in the national championships: they’d swim first, then play polo, then… swim again. Everything going on at the same time… it was all a bit chaotic.\nBut that’s how we got started: we’d set out from Piraeus in a van from Aghios Konstantinos that Olympiacos would hire to take us to Athens.\nAnd a couple of years later, we’re joined by Kaiti Baxevaneli, by Teris Koutoumanis and Nikos Papadakis. And, come ‘64, there’s Koula Iliopoulou, too, and the next great crop of swimmers from ’65. Dina Spyropoulou had joined up by then, and some other youngsters. And Panathinaikos had Lombardos and Sotiriou, and the competition between us began to heat up,» Dimitris Karydis recalled in the interview.\nHe feels that if he hadn’t gone to America, he would have ascended to even greater heights, since he wouldn’t have stopped swimming so young. Still, the experience helped shape his character, and he came back a different man, and ready to start coaching.\n«At a certain point, I started to feel passionate about coaching, too. I had it inside me. Because I’d been b-b-lazy as an athlete, I came to see what I’d missed out on. How much more I could have done. Because what they taught me in America afterwards, in the physical education and coaching classes I took there, were things I’d done myself at seventeen. Autosuggestion, visualizing the race beforehand… I used to do both the night before I swam, without having a name for it: I’d sit and conjure up an image in my head of me swimming… and wiping the floor with Panathinaikos,» he said in the same interview with andro.gr.\nWith no fewer than 25 national records across every event, Karydis easily earned a place among the top 10Greek record holders of all time\nPassing on the baton: Gemelos\nNikos Gemelos was Karydis’ successor at Olympiacos. Born on May 19, 1968 in Piraeus’ Aghia Sofia district, he began his swimming career with Olympiacos in 1972. He stopped competing in 1987 and took over as assistant coach of his beloved team in 1992.\nHe began his coaching career in charge of the Olympiacos academies. He would later take over both the men’s and women’s teams, winning 25 Greek Open championships over the last 27 years. Of course, his name will be forever linked to the great Spyros Gianniotis, whom he brought to prominence. In all, Nikos Gemelos played a role in 51 of Olympiacos’ 65 championship wins as a swimmer, assistant coach and head coach!",
  "word_count": 1533,
  "scraped_at": "2026-02-14T12:53:48.219199"
}