{
  "article_id": "2a6a823fe84b",
  "url": "https://www.juneesoutherncross.com.au/story/8775481/kyah-simon-eyes-matildas-recall-with-sydney-return/?cs=6409",
  "title": "Kyah Simon eyes Matildas recall with Sydney return",
  "date": "20240926T060000Z",
  "domain": "juneesoutherncross.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Kyah Simon hopes a return to Sydney FC will allow her to get back to her goal-scoring best and return to the Matildas fold.\nSubscribe now for unlimited access.\nor signup to continue reading\nSimon has joined reigning champions Sydney for the upcoming A-League Women campaign, her third stint at the club, after spending last season at Central Coast.\nWith more than 100 Matildas caps, 2010 Asian Cup winner Simon, 33, has a glittering resume, playing at two Olympics and scoring at both the 2011 and 2015 Women's World Cup.\nBut she didn't play a minute of last year's Women's World Cup campaign after being contentiously selected off the back of an ACL tear - and hasn't been involved with the team since.\n\"Ultimately, the goal is to stay in the Matildas set-up for as long as I feel (until) the time is right to step away from that,\" Simon said.\n\"But for sure, that's a goal of mine, and I think I have confidence within my ability that if I can consistently play minutes, play 90 minutes, week in, week out, I give myself the best opportunity to be back in that set-up.\"\nSimon has a long-standing relationship with interim Matildas boss Tom Sermanni, who she won the 2010 Asian Cup under and described as the \"perfect\" interim coach.\n\"Hopefully I can get the opportunity to play underneath Tommy,\" she said.\n\"That's obviously my goal and aspiration for the next coming months.\n\"But we'll see how it pans out. Obviously being based in Australia and the first trip being abroad over in Europe just before the season starts - not sure if it'll be ideal for me leading into the season.\n\"So I'm on the fence whether it is the best thing for my preparation or whether we look to the window after that, which is in Australia.\"\nFootball Australia is hunting for Tony Gustavsson's permanent successor with Simon wanting a coach who could restore the Matildas to the world's top five.\n\"I'd like to see a coach with a really high football intelligence in terms of taking our team to the next level tactically,\" Simon said.\nFormer Julie Dolan Medallist Simon has won three ALW championships - two with Sydney, one with Melbourne City - and two premierships with the Sky Blues.\nSimon provides a fresh attacking option for the Sky Blues after Matildas winger Cortnee Vine departed in the off-season.\n\"Kyah is one of Australia's finest footballers, and bringing her back to Sydney FC is a huge boost for us,\" coach Ante Juric said.\nSydney start their campaign away to Central Coast on November 2.\nAustralian Associated Press",
  "word_count": 441,
  "scraped_at": "2026-02-14T12:33:03.420773"
}