{
  "article_id": "2a79a48be0e0",
  "url": "https://www.insidermonkey.com/blog/nexstar-media-group-inc-nasdaqnxst-q3-2023-earnings-call-transcript-1220358/",
  "title": "Nexstar Media Group , Inc . ( NASDAQ : NXST ) Q3 2023 Earnings Call Transcript",
  "date": "20231109T220000Z",
  "domain": "insidermonkey.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Nexstar Media Group, Inc. (NASDAQ:NXST) Q3 2023 Earnings Call Transcript November 8, 2023\nNexstar Media Group, Inc. misses on earnings expectations. Reported EPS is $0.7 EPS, expectations were $1.53.\nOperator: Good day and welcome to Nexstar Media Group’s Third Quarter 2023 Conference Call. Today’s call is being recorded. I will now turn the conference over to Joe Jaffoni, Investor Relations. Please go ahead, sir.\nJoe Jaffoni: Thank you, Shamali and good morning everyone. I’ll read the Safe Harbor language, and then we’ll get right into the call. All statements and comments made by management during this conference call other than statements of historical facts maybe deemed forward-looking statements for purposes of the Private Securities Litigation Reform Act of 1995. Nexstar cautions that these forward-looking statements are subject to risks and uncertainties that may cause actual results to differ materially from those reflected by the forward-looking statements made during the call. For additional details on these risks and uncertainties, please see Nexstar’s annual report on Form 10-K for the year ended December 31, 2022 as filed with the Securities and Exchange Commission and Nexstar’s subsequent public filings with the SEC.\nNexstar undertakes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. With that, it’s now my pleasure to turn the conference over to your host, Nexstar Chairman and CEO, Perry Sook. Perry, please go ahead.\nPerry Sook: Thank you, Joseph, and good morning, everyone. We appreciate you all joining us today to discuss Nexstar’s third quarter results. With me today on the call are Mike Biard, our President and Chief Operating Officer as well as Lee Ann Gliha, who is our CFO. Also here listening in and available for questions on what will be his final earnings call, Senior Advisor, Tom Carter. I’ll start with a summary of recent highlights and developments, followed by Mike’s operations review, and then Lee Ann’s financial review. Nextar third quarter financial results primarily reflect the year-over-year decline in cyclical political advertising as well as the net distribution revenue impact related to our successful negotiation with DIRECTV.\nIt was a tough negotiation for both sides, but ultimately, we reached an agreement and are pleased with and which was consistent with our internal expectations. The agreement and all other distribution and network partner agreements reached year-to-date as well as our 2022 renewals were all completed in a manner that was for us, “business as usual” and recognition of the value that Nexstar brings to its partners. We expect favorable terms of those agreements as well as other upcoming renewals to drive continued high-margin distribution revenue growth in the coming periods. As has always been the case during contested negotiations, whether ours or others, there is a lot of noise and a time misinformation that’s put out to the public by those seeking to take advantage themselves by talking their own book.\nAt Nexstar, we would like to deal in the realm of facts. That’s why we published a new investor deck on our website last month, and we hope you’ll have a chance to review it if you have not already. This data-driven report details the importance of broadcast television in the current and future TV ecosystem as well as Nexstar’s positioning as the largest company with consistently top-tier financial performance in the sector. Today, I am going to provide you some additional facts and perspectives from recent events. First, Nexstar’s consistent record of strong operating execution and free cash flow generation is predicated on the strength of our model and our disciplined approach towards managing the business for the long term. Now that includes distribution negotiations.\nAnd while the vast majority of our distribution renewals are negotiated without can fair or disruption of service, there are times when it does happen. Nexstar has always done and will continue to do what is necessary to bring us closer to achieving fair compensation for the tremendous value our stations bring to our distribution partners. Our continued success in these negotiations is no surprise to us, which obviously brings me to my second point. Broadcast Television is the undisputed leader in viewership with the most watched programming. Each of the big four broadcast networks generates viewership roughly 4x greater than ESPN. And on top of that, Nexstar’s own non-network content generates about half the viewership of our stations. According and adding to our leverage, Nexstar is the largest local broadcaster in the United States and the first, second or third largest affiliate group of the Big 4 networks, the CW and My Network TV.\nSo the most watched broadcast network content plus highly engaging local news and local content equals a must-have for distributors who need us to provide their customers with the content they spend the most time watching. Third, the broadcast distribution model is not going anywhere because we continue to command the widest reach. According to a TBB survey, that’s the Television Bureau of Advertising, broadcast television reaches 76% of the population on a daily basis versus 54% for cable-only and 36% for SVOD services. Where the only and best way to reach the biggest audience, something that sports organizations, most importantly, the NFL recognizes and require in their rights agreements. This creates a virtuous cycle where sports organizations looking to maximize their audience reach to grow revenues local engagement and franchise value, seek out broadcast as the preferred medium, which begets viewership, which begets distribution and on and on and on.\nThis is only amplified by the significant amount of time audiences spend with our local news and our other local content. The broadcast affiliate model benefits the networks by extending the reach of their content, including Major League sports to the widest possible audience enabling them to maximize advertising revenues and receive significant affiliation fees, which they cannot match on their own. Fourth, we believe that the Disney Charter dispute resolution supports our business model. In that agreement, the premium broadcast network content carried on ABC-owned television stations and the ESPN network got paid. The Disney+ DTC content got rebundled, which should help reduce MVPD attrition and derivative IM channels like ours. Finally, we’ve received a lot of questions about virtual MVPD rates being lower than net MVPD rates.\nWell, that’s been spun in kind of a negative way, and it’s not really consistent with how we view the world. If you look back at our conference call one year ago, we said that our virtual rates were about the same as our net MVPD rates. Then at the end of 2022, we renegotiated a number of our MVPD contracts and obviously increase our rates. So as a result of those successful negotiations, our net MVPD rates are now higher than our vMVPD rates. That’s not bad. That’s good. That’s progress. But all that’s missing all of that does miss the bigger picture that we have multiple agreements with the participants in the ecosystem related to different parts of our business and each agreement is on a different timetable. So you really can’t look at this topic in a vacuum without arriving potentially at some incorrect conclusions.\nSo I’ll just reiterate, we expect to grow our net distribution revenues as contracts come up for negotiation and renegotiation. Shifting gears for a moment to our economy. Our core television revenues continue to be impacted by a soft advertising market, lead by weakness in national. We’re seeing some improvement on this front as the third quarter rate of decline improved sequentially from second quarter, and we’re continuing to see improvement in the fourth quarter to date. We view this trend more or less as the typical impact that we would see in a cyclical economic environment rather than anything secular. We remain confident in our business model and our continued ability to generate significant free cash flow, and we’re putting our money where our mouth is by accelerating our repurchase activity to take advantage of our low stock price for the benefit of our long-term shareholders.\nIn the third quarter, we repurchased $199 million worth of our stock, almost half of which was executed during September. Year-to-date, we repurchased $514 million of stock. And since December 31, 2019, when we started our repurchase program, we have reduced the shares outstanding by over 25%. Subsequent to quarter end, we continue to be in the market pursuant to a 10b5-1 program, and we have over $700 million left on our current authorization to continue to execute on our repurchase strategy. Looking ahead, we remain bullish about Nexstar’s future and pleased with the progress we’re making on our organic growth initiatives. NewsNation now remains the fastest-growing cable news network in prime time and has established its position as a modified major news network.\nWe only expect to accelerate our audience growth from here. We have an exciting announcement coming up later this week, so please stay tuned. In addition, as you will hear more from Mike later, we have already begun making moves to leverage the unique and scarce resource of the CW broadcast network to increase our audience, reduce the overall cost of operation and drive towards profitability. Since we acquired the CW 1 year ago, we’ve secured rights for compelling sports programming with Live Golf, ACC football and basketball. And as you saw yesterday, WWE Next which is now announced as joining the CW network in the upcoming season. The NASCAR Infinity Series will also join in 2025, and we have related programming of inside the NFL, which airs currently on Tuesday nights.\nTogether with our excellent slate of scripted and unscripted entertainment content, we’re setting the stage for the CW to grow ratings, advertising and distribution. At a year positive ratings of ACC football on the CW have been very positive, attracting new advertisers to the network. In addition, the CW’s recent affiliation renewal cycle completed this past quarter, was an improvement over the prior cycle, and we’ve reduced the losses at the CW year-to-date by over $75 million from the prior owner’s performance. And of course, we continue to make progress on our APSC 3.0 development working with several potential business partners on developing a test case for Spectrum use. Finally, as we look for ways to grow revenues and leveraging our scale portfolio of television assets, we’ll be bringing the majority of our national sales efforts in-house beginning in January of 2024.\nWe believe there is no one better to sell our linear and digital ads to advertisers than us. And as we’ve discussed before, Nexstar has a unique portfolio. Together with our partner stations, we are by a wide margin, the largest local television broadcaster covering over two-third of the country including 8 of the top 10 markets as well as 17 of the top 25 DMAs. This scale provides us the ability to effectively offer advertisers near national reach, but also local activation in key selected markets with just our portfolio alone. Adding to that, our scaled national properties of the CW, NewsNation, Antenna TV and The Hill, we have critical mass to engage advertisers with our own go-to-market strategies and bespoke advertising package [indiscernible] excellent ROI for our clients.\nAs we discussed on the last call, measurement is a key piece of this strategy, and we’re working through the process to identify our next-generation measurement partner or partners, which can provide us the data we need to execute on our strategy. Over time, we believe we should be able to generate more revenue at a better margin than if we continue to outsource our national sales efforts. Nearer term, the remainder of ‘23 and ‘24 will benefit from the successful renegotiation of our distribution contracts during the year, and 2024 will add a significant benefit of being a political year which we expect to be particularly strong. Now I’m going to turn the call over to Mike, who joined us in mid-August. As we discussed on our last call, Mike is a seasoned broadcast television veteran, having most recently served as President of Operations and Distribution at Fox Corporation.\nHis experience overseeing FOX’s multi-platform content distribution strategy business affairs and affiliate relations for Fox Sports, Fox Entertainment and Fox News brings the perfect complement capabilities to support Nexstar’s growth objectives. So with all of that said, let me now turn the call over to Mike.\nMike Biard: Thanks Perry and good morning everyone. Given this is my first earnings call here, I thought it would be helpful to start with some brief comments on why I chose to join Nexstar. I have tremendous respect for what Perry and the Nexstar team, including Lee Ann and my inevitable predecessor, Tom Carter, have accomplished here. Over the course of my career, I’ve watched Nexstar’s scale to become a true media powerhouse with a record of exceptional financial performance and shareholder returns. Today, Nexstar’s mix of media assets provides both national reach and local activation at scale greater than anyone in the business. And while I was very happy at Fox and was not looking to leave the opportunity to come to Nexstar and participate in what the team has been building was something I could not pass up.\nWhat ultimately motivated me to join the company is the uniqueness of Nexstar’s business and positioning in the industry, which I believe give it the potential to achieve significant growth over the medium and long term, more so than any other player in the sector. And I’ve joined Nexstar in an exciting time. We are in the early stages of the company’s expansion into the network business and unlocking the meaningful upside potential of NewsNation and the CW. This aligns directly with my interests and what I can bring to the table, given my background in many years of executive experience at FOX. The move to convert WG in America, and as I know firsthand, the opportunity in cable news is material. The growth of NewsNation will be bolstered by the strong viewership of the news genre and capturing the audience comprised of the large Centrist majority of Americans who want fact-based journalism and do not feel well served by the existing polarized news options.\nAnd when Nexstar bought the CW, I immediately recognized and agreed with the wisdom of that strategy, vertical integration of Nexstar’s CW stations, weather CW affiliates, distribution, and advertising revenues. In the pivot of the CW from teen-focused dramas to compelling sports content and broad appeal programming will leverage the rare resource of a broadcast network to drive growth. We saw this early on at FOX and I can see it taking shape already at the CW. There are enormous opportunities in front of us as we approach these businesses with the same sort of disciplined investment and execution that has always characterized Nexstar. Indeed, Nexstar has a history of delivering healthy returns to its shareholders, made possible by the strong free cash flows that we consistently generate.\nPersonally, I have taken great pride in contributing to positive shareholder returns throughout my career. And I expect my tenure here will extend to that track record. Most importantly, Perry and I have done business with each other in a variety of contexts over the years and we share a common vision for Nexstar’s future. So I have hit the ground running. I am fired up about being here and working closely with my colleagues to support Nexstar’s next phase of growth. I’m also looking forward to engaging with the financial community and our shareholders in the coming quarters and years, starting with today’s earnings call. And with that, let’s turn to the operating review. Q3 revenue of $1.13 billion compared to $1.27 billion in the prior year quarter.\nThe net revenue comparison primarily was impacted by the year-over-year decline in cyclical political advertising and the temporary removal of stations from an MVPD related to contract negotiations, offset in part by the inclusion of the CW. On a pro forma basis, excluding political advertising revenue, the CW and comparable periods of time in 2022 that we and our partners were dark, net revenue would have increased by 2.3% year-over-year. For television advertising which includes both our station group and our national networks, but excludes any digital advertising revenue, declined 2.3% year-over-year. Excluding the CW, core advertising was down 6.8%, marking an improvement from the 2023 second quarter, which was down 8.4% due to a slight reduction in the rate of decline of national advertising.\nThis performance is consistent with the expectations we shared on our last earnings call. We continue to be impacted by our station presence in large markets, which tend to act more like the national advertising market. To illustrate this a bit better, if we were to exclude our networks in top 10 markets and include digital ad revenue as many of our peers do, our station core television advertising revenue for the quarter would have been flat. Notably, our large market stations are some of our best and most profitable stations in the portfolio with true local identities and brands entrenched in their communities, which is a significant achievement in the top DMAs. For example, WGN, an independent station in Chicago and KTLA, a CW affiliate in Los Angeles consistently have the number one rated morning news and number one or number two rated news throughout the day.\nIn addition, our strong presence primarily with CW affiliations in these larger markets makes us an ideal partner for professional sports organizations looking to expand their audience by leveraging the reach that only broadcast can deliver. For example, KTLA announced in September that it extended its successful deal with the LA Clippers tariff to air 15 games through the ‘24/25 season. In addition, the trends in these larger markets remain in our favor as the advertising market continues to recover. In Q4 2023, we are seeing further modest improvement to the rate of decline of our overall core television advertising versus what we saw in the third quarter due in part to the political displacement in Q4 of last year. Excluding the CW for comparison purposes, our top-performing categories in the quarter were auto and home repair manufacturing.\nWe are pleased to see automotive, our largest advertising category in terms of dollars spent maintain its growth trajectory for the fifth consecutive quarter, increasing 13% over Q3 2022. We are encouraged by the continued rebound of this category, and believe there is continued headroom given that overall automotive spending remains below 2019 levels and automobile inventory levels have rebounded. The category is most responsible for the core advertising revenue decline were radio/TV cable newspaper, gaming, sports betting, bank savings investments, drugstores medication and paid programming with about three quarters of categories declining in the quarter. Turning to political, Nexstar generated third quarter political advertising revenue of $19 million, reflecting the cyclical year-over-year decline in election year spending.\nAs Perry mentioned, we remain optimistic about our growth prospects for political advertising revenue in the 2024 election cycle with Vivik’s-Cmac projections for $11.6 billion of spend in 2024, including $5 billion expected to go toward local broadcasting. Given our extensive footprint covering over 80% of contested elections, we are extraordinarily well positioned to take share and dollars, both locally and nationally. In fact, recent commentary from leading super packs and election consultants reinforces our view that local broadcasters will continue to capture the largest share of political ad dollars in the 2024 cycle. Dan Konstan, the President of the Republican Congressional leadership Fund recently stated that, “when it comes to our advertising and advocacy, broadcast is the foundation of all our efforts.” On the Democratic side, Dave Heller, the President of political consulting firm, Main Street Communications, painted an equally positive picture with his analogy saying, “As a campaign, you’re going out to dinner, broadcast is stake the entree.\nStreaming and digital are asparagus, broccoli and a little solid and radio is the dessert.” Now Dave is clearly not a vegetarian, but you get his point. Moving on to our distribution. In the third quarter, we successfully completed distribution agreements with all of our partners up for renewal during the period. As Perry stated earlier, we are pleased with the outcomes of those negotiations. And while the disruption with DIRECTV extend 17 days into September, which we know was longer than the market was expecting, the long-term outcome more than justified that approach. Said another way, the ROI on the period we were dark based on where the deal was prior to going dark versus where we ended up was significant. On the network affiliation side, we successfully completed all affiliation agreement deals, including with FOX, CW and MyNetwork.\nNexstar’s third quarter distribution revenue of approximately $598 million decreased by $43 million or 6.7% versus prior year. Distribution revenue was primarily impacted by the aforementioned removal of stations on DIRECTV for 76 days in the quarter. The ongoing removal of partner stations from certain MVPDs related to continued negotiations and continued MVPD subscriber attrition, partially offset by the renewal of distribution agreements in 2022 and on improved terms and annual rate escalators, representing more than half of our subscriber base, growth in virtual MVPD revenue and the inclusion of the CW. Excluding the CW, our distribution revenue would have declined 8.6%. Further excluding from 2022, for comparison purposes, the periods where we and our partners were dark, distribution revenue would have been up 8.8%.\nSubscriber attrition was in the low single digits, positively impacted by the increase in carriage of our CW, MyNetwork TV and independent stations on YouTube TV and the addition of new CW affiliates in large markets. Looking forward, assuming the continued removal of our partner stations from two large MVPDs and no disruption in service for Nexstar stations in the quarter, we expect Q4 distribution revenues, excluding CW and to be up mid-teens and net distribution revenue for the quarter to be up high teens. Record third quarter digital revenue increased 15.1% to approximately $99 million. Revenue growth was driven by the inclusion of the CW and year-over-year increases in Nexstar’s local digital advertising revenue and agency services business which more than offset some weakness in our national digital advertising revenues and e-commerce.\nExcluding the CW, digital revenue increased 2.7%. Quickly touching on the CW, which as I said earlier is one of the exciting opportunities at the company. As we mentioned on the last call, our CW affiliated stations are the most profitable of our network relationships, both in terms of margin and in gross dollars. And we’re fortifying that performance for the long-term by investing in content that matters to the broadcast viewer, including live sports and acquiring more CW affiliations for Nexstar stations. There is strong demand from sports organizations for carriage on broadcast television to deliver the highest ratings and wise distribution to their fan bases while also providing promotion and engagement at the local level to drive attendance and ancillary revenue streams.\nThat demand for broadcast television has allowed us to enter into exclusive agreements with a number of major sports organizations including our just announced deal for WWE NXT in 2024; Live Golf, which will return in 2024; ACC Football and Basketball; and NASCAR, starting in 2025. All of which we expect to help drive viewership of the CW and the value proposition to our affiliates and distributors. And we’ve seen early returns on that strategy with our ACC partnership, where we successfully engaged over 15 new advertising partners for the first full season of ACC, including Verizon as the presenting sponsor and Subaru as the halftime sponsor. Our first ACC college football game Cincinnati versus pit, delivered 617,000 total viewers and was the most watched Saturday since the network began broadcasting on Saturdays in 2021.\nNotably, same night ratings for the ACC on the CW Beat NBC’s big Saturday football in the adults 18 to 49 demo by 3%. That is a remarkable achievement right out of the gate for a network that had never featured football or college sports of any kind. And looking forward, we released our ACC basketball schedule with men’s double headers on Saturdays and women’s games on Sunday afternoon beginning on December 2. This exciting schedule begins with 2023 Final 4 participant in Miami, hosting Noted aim, followed by Duke visiting Georgia Tech, with many more marquee games to come during the season. CW notched several other wins during the quarter while launching new fall programming, including inside the NFL, FitaSurvive, the Swarm, Sonova Kitch, Sullivan’s Crossing and Spencer Sisters, among others.\nIn addition, CW served as the exclusive home for the Mist USA patent, which attracted over 1 million viewers. As a result of our successes to date, we were able to complete in the quarter negotiations for CW affiliations on improved terms with Gray, Sinclair and Hearst, and we transferred CW affiliations from the Paramount owned stations that were previously affiliated with the CW and paid no affiliation fee. Additionally, we executed against the vertical strategy I mentioned at the outset of my remarks, by successfully transferring the CW affiliation to several Nexstar stations, benefiting both the network and our station group in San Francisco, Philadelphia, Tampa, Oklahoma City and billings with more to be announced in the coming weeks. In the third quarter, the CW generated $59 million of revenue and $58 million of adjusted EBITDA loss, excluding $1.5 million of onetime expenses comprised primarily of restructuring charges.\nThis loss improved sequentially from the $74 million losses in Q2. Year-to-date, we have reduced the CW losses by $75 million versus the predecessor company, and we remain on track to reduce losses again in 2024 toward breakeven in the next couple of years. And with that, it’s my pleasure to turn the call over to Lee Ann for the remainder of the financial review and update. Lee Ann?\nLee Ann Gliha: Thank you, Mike, and good morning, everyone. Mike gave you most of the details on the revenue side and on the CW, so I will provide a review of expenses, adjusted EBITDA and attributable free cash flow, along with some comments on our guidance given the impacts we saw this quarter. Together, third quarter direct operating and SG&A expenses, excluding depreciation and amortization, increased $47 million, primarily due to the inclusion of the CW. Increases in affiliation fees, increased compensation and healthcare costs, the expansion of local news as well as the expansion of our news programming at NewsNation and write-down of assets were offset in part by reduced variable costs related to lower revenue and promotion costs and even further offset in our adjusted EBITDA and free cash flow calculations by reduced programming costs at NewsNation related to reduced reliance on syndicated content.\nQ3 2023 total corporate expense was approximately $52 million, including non-cash compensation expense of $16 million compared to $52 million, including non-cash compensation expense of $17 million in the third quarter of 2022. Q3 2023 depreciation and amortization was $220 million versus $142 million in the prior year quarter due primarily to the acquisition of the CW. Please note that the CW’s programming costs, which are included in our definitions of adjusted EBITDA and free cash flow are accounted for in this line item as amortization of broadcast rights. For more information on this amount, please refer to the schedules in our earnings release. We received $8 million in Q3 distributions from equity investments related primarily to our 31% ownership in the TV Food Network, which represents a 27% decrease from the prior year quarter.\nOur Q3 distribution from TV Food Network is a tax-related distribution. The reduced amount reflects lower income at TV Food Network related primarily to lower advertising revenue. So putting it all together, on a consolidated basis, Third quarter adjusted EBITDA was $236 million, representing a 20.8% margin. Excluding the CW, third quarter adjusted EBITDA was $294 million, representing a 27.2% margin. Third quarter CapEx was $36 million and in line with our expectations compared to $37 million in the third quarter last year. Year-to-date, CapEx was $113 million versus $98 million last year, excluding a small amount of CapEx associated with repack. To date, we have received $10 million of insurance proceeds and tenant improvement funds versus none last year.\nOur CapEx is not net of insurance proceeds, but we reinvest those proceeds back into our physical plant. So net of insurance proceeds year-to-date CapEx was $103 million and includes about $10 million of carryover CapEx from last year. Third quarter net interest expense increased to $114 million from $89 million in the prior year quarter due to the impact of higher SOFR rates applicable to our floating rate debt. Cash interest expense was $112 million for the quarter, slightly higher than our expectations given an increasing yield curve. Third quarter operating cash taxes were $21 million. And putting that all together, consolidated third quarter attributable free cash flow was $100 million. And excluding the CW, third quarter free cash flow was $136 million, amounting to 46% of adjusted EBITDA.\nLooking ahead, we project corporate overhead, exclusive of stock comp and one-time costs to be approximately $35 million for the fourth quarter, and we expect corporate overhead around $138 million for the year, given new executive hires in recent contract renewals. Non-cash compensation is expected to be approximately $16 million for the fourth quarter and in the $60 million area for the full year, but will vary based on stock price and actual grants. For cash taxes, we use a 26.5% tax rate when calculating our estimated tax before one-time and other adjustments. The fourth quarter includes one income tax payment. Please note for calculating cash taxes excluding the CW, only about 65% of Nexstar’s book depreciation and amortization is deductible for tax purposes.\nWe are currently projecting CapEx of $46 million in the fourth quarter and $158 million for the full year, including the portion of carryover CapEx from last year I mentioned earlier. Approximately $12 million of CapEx is funded by insurance proceeds and TI improvements for the year and effectively reduces the $158 million figure to $146 million and $136 million, excluding the $10 million of carryover CapEx from last year, which was delayed due to supply chain issues, which have resolved this year. We expect Nexstar’s cash interest expense to approximate $114 million for the fourth quarter and $440 million for the full year, reflecting current forward curve and our expectations for debt repayment. As a result of the recent events and macro trends around advertising, subscriber attrition and interest rates effecting our business many of which are not in our control.\nWe are updating our 2023, 2024 average annual attributable free cash flow guidance to a range of $1.05 billion to $1.15 billion, with the high end of the range on top of consensus. This reflects our current view of 2024 prior to our formal budget process at the year-end, and we are only a few weeks away from 2023 being in the rearview mirror. Turning to the balance sheet. Nexstar’s outstanding debt at September 30, 2023, and was $6.9 billion, down slightly for the quarter as we made mandatory quarterly amortization payments of $31 million. Because we have designated the CW is unrestricted subsidiary, well, losses associated with the CW are not accounted for in our calculation of leverage for purposes of our credit agreements. As such, our net first lien covenant ratio for Nexstar, excluding CW at September 30, 2023, was 2.05x, which is well below our first lien and only covenant of 4.25x.\nOur total net leverage for Nexstar, excluding the CW at quarter end was 3.4x. As is typical and non-political years, we expect leverage, which we calculate on an LTM basis versus the 2-year average but not our quantum of debt to tick up this year, but to fall again in 2024 as EBITDA will grow with the return of political advertising. Our cash balance at quarter end was $150 million, including $59 million of cash related to the CW. Together with free cash flow generated in the quarter and cash on hand, we returned $246 million to shareholders, comprised of $47 million in dividends and the repurchase of $199 million of stock which, together with first and second quarter dividends and share repurchases totaled $659 million or 113% of our first 9 months attributable free cash flow as we pulled forward cash flow reserve for future period purchases to take advantage of purchasing stock at these low levels.\nAs we move forward, we will continue to strategically deploy our cash in a manner that is consistent with our commitment to creating the highest shareholder value.\n12/31/2020: And what’s even more interesting for you to consider is that our consolidated EBITDA the metric upon which we trade includes 100% of what we expect to be short-term losses of the CW, effectively capitalizing those losses into our valuation. If you look at the average of analysts that break out their expectations for the CW, the impact for the average of ‘23 and ‘24 of these losses at a 6.5x multiple is nearly $30 per share. Despite the confluence of headwinds in 2023, we continue to be bullish about the fundamentals of our business, the economic outlook and our ability to continue to generate substantial free cash flow for the foreseeable future. As Perry mentioned earlier, we plan to continue to execute on repurchases in a prudent manner as testimony to the value that we believe it will create for our long-term shareholders.\nBefore we open up the lines for questions, we wanted to turn the call over for a minute to Tom Carter for a few remarks on what is his last earnings call. Tom?\nTom Carter: Thanks Lee Ann, and good morning, everyone. This is my 57th and last earnings call with Nexstar. I’ll miss Nexstar and its great people and work environment. As I look back on what we’ve built and what is to come, I could not be more optimistic about the future of this business and the team we have put in place to take Nexstar to the next level. As you’ve gotten to know her over the last 2 plus years, you are in great hands with Lee Ann as CFO. As you may not know, but Lee Ann and I worked together at Bank of America prior to my joining Nexstar. So we have a long history together. And over time, she has been in the seat here, we have seen eye to eye on virtually every decision that we’ve made. And the transition to Mike Biard has been seamless.\nMike’s DNA is cut from the same cloth as Nexstar and his skill set will be instrumental in leading Nexstar as the scaled industry provider it is going forward. I have poured all I have into this company. And at the end of the day, I’m ready to retire and spend more time with my wife, family and friends and enjoy the parts of life outside of Nexstar that I had missed. Thank you to the investors and analysts and the team at Nexstar for an incredibly positive 14 year plus. And most of all, to my colleague and friend, Perry Sook for this life-changing opportunity. Thank you, and best of luck to you all. And with that, I’ll open it up for calls – open up the call for questions. Operator, can you go to our first question, please?\nSee also 10 Low Risk High Reward Stocks Set to Triple By 2027 and 30 Most Corrupt Countries in the World Heading into 2024.\nQ&A Session\nFollow Nexstar Media Group Inc. (NASDAQ:NXST)\nFollow Nexstar Media Group Inc. (NASDAQ:NXST)\nReceive real-time insider trading and news alerts\nOperator: [Operator Instructions] And our first question comes from the line of Dan Kurnos with Benchmark. Please proceed with your questions.\nDan Kurnos: Great. Thanks, good morning. And good to hear you on the call, Mike. Obviously, Tom, you will be missed as we said last time. I guess just maybe either for Mike or Perry, just on the deals that you guys have done, you listed them all, Mike, in your prepared remarks. Obviously, we saw the WWE NXT deal last night. I think I asked this question to a different degree last time, but how should we think about the combination, and you can take this in two parts of both incremental local deals as we continue to see those come online and we’ve gotten some diamond news recently as well that could sort of auger more positive news on that front as well as this kind of national network push. Like how do we think about that flowing through?\nAnd I know some of the deals don’t start until late ‘24 or ‘25. But just the monetization aspect of raising CPMs across the Board, expanding viewership. I guess, we’d like to get maybe a little bit of color on how impactful you expect those deals to be to the broader portfolio and then, frankly, just the impact to cash flow as you think about kind of the cadence of those deals coming online. Thanks.\nPerry Sook: Well, let me start, Dan, and then I’ll turn it over to Mike and Lee Ann to add color if that would be helpful. But obviously, when we when we conceive the acquisition of the CW in our mind’s eye, there were sports in our future. But really, if you look at the cadence of Live, NASCAR, WWE, ACC, these were opportunistic acquisitions of content for us. Each one of them has been modeled out to make money over the life of the agreement. And obviously, if it hadn’t, we wouldn’t have done the deal. But these are also deals that we think are value-creating in that as we go out to the affiliate base and subsequent renewal discussions, we’re providing the things that this distributors want and viewers want, which is obviously live sports, and it’s going to make up a good portion of our schedule.\nAnd we’ve also expanded our broadcast schedule to incorporate weekend afternoons now, which is a new daypart for the network to participate in and generate revenue and obviously, eyeballs. And we obviously love what sports does for the entertainment programming that airs that night following the broadcast. People tend to stay around and we’ve had some of our best improvements on night were sports was a lead-in to the entertainment slate. So again, we moved fast on these, and these came at us at a clip we had to be prepared to move very quickly, I think, to get these opportunities under the CW tent. And again, everyone has been modeled to make money and the way the rights fees, they increase over time. And so there’ll be a sliding scale on our way to profitability.\nBut we believe these are important assets and value-creating assets for the network. And for our local stations, I can tell you when we brought LIV Golf, the local stations hit that hard. I mean, and had great success this past summer and fall, monetizing that at the local level. It was, hey, we never had sports before. We now have sports. You want to participate, you want to play and local was able to approach advertisers to buy sports so they had never had the same opportunity on the CW before or at that station. So all good. I think that from a macro level, but let me turn it over to Mike, and he can potentially – and Lee Ann can go a little further into the weaves if you’d like.\nMike Biard: I think I’ll just add that the timing of the company investing in the CW at the national level and also increasing our CW affiliation at the local level is lining up perfectly with the trends that we’re seeing in the industry with rights holders seeking distribution on broadcast. I saw it last night in the news related to the Bally’s bankruptcy and the fact that the NBA has redone their deal through all the teams with Bally’s to carve out a 10-game package for broadcast. That was a telling little tidbit inside that deal. And what we’re seeing is it’s evidence of both at the national level, the deals being done and at the team level, the local deals being done. The search for reach that only broadcast can deliver is really ubiquitous and applies kind of at all levels right now.\nSo we’re finding ourselves at the CW really well positioned, both in terms of ownership of the network and also ownership of the stations at the local level and then with our affiliates being able to leverage that demand for broadcast at a perfect time.\nLee Ann Gliha: And I would just say, as Perry said, we’ve modeled all of this out to be consistent with what we’ve communicated previously. And life is never a straight line, but we’re working on it. And look forward to achieving what we said we could do.\nMike Biard: I’ll just add that if you want to change viewership habits, it’s a difficult thing to do in the current environment, and there is really nothing like sports to do that. And as I mentioned in my prepared remarks, our first game on the CW, a place where college football fans never had a place to go ever did remarkably well, particularly given the fact that we acquired those rights relatively close to the beginning of the season, we didn’t have an opportunity to really market it the way we would like to and certainly not the way we will going into next year. So to develop that kind of muscle memory, both at the network and station level but in the minds of viewers to go there and look for that. There is nothing like sports programming and particularly the kind that you’ve seen us announce with the WWE and with NASCAR, we will have 52 weeks of WWE, 33 weeks of NASCAR to create that kind of habit and just pattern for viewers to go to the CW to look for that kind of programming.\nWe couldn’t be more excited about it.\nDan Kurnos: Got it. Super helpful. Lee Ann, can I just ask quickly on the free cash guide. Just on – I think rate curve is probably about half of the delta at the high end, a little less than that. You mentioned some other things. Is there any incremental granularity you can give us just around any of the moving pieces on the remainder of the delta?\nLee Ann Gliha: Yes. I mean, look, Dan, there is a lot of moving pieces in this number. So I can’t get sort of too far down the lead because there is a lot of things. But if you think about it as advertising market, its rate of attrition, it’s the impact of being dark on us being dark and our partners being dark that’s part of the – all that kind of gets together and put in the mix to get to the – in addition to interest expense, obviously, which you pointed out, which gets us to the number on the new range.\nDan Kurnos: Got it. Alright, cool, fair enough. Thanks very much. Appreciate it, guys.\nPerry Sook: Thank you.\nOperator: Our next question comes from the line of Barton Crockett with Rosenblatt Securities. Please proceed with your question.\nBarton Crockett: Okay. Great. Thanks for taking the question. I wanted to, first, ask a little bit more clarity on the CW kind of outlook. So when you guys bought the CW, we’re talking to the cost really being the losses, which were put in the low nine figure or maybe around $100 million. Here, the first time months or free cash flow net is $159 million. It’s already in excess of that you’re talking to some more for next year, but you’re also talking to this being within kind of your previous communication. So I’m just wondering how those two things reconcile? Is it that maybe the initial losses are steeper, but the time to profit is faster and maybe the return on investment is this good or better? If you could give some more color on that that would be great.\nLee Ann Gliha: Yes. So, it sounds like you are on a train. I would say we said that the cumulative losses to the breakeven period of time we are going to be in the low-9 figures. We never said $100 million. That was never part of the guidance. I think that – we also provided some color in terms of our free cash flow guidance in the last period of time. I would say, obviously, since then, we have had an advertising market, especially on the national side that’s gone against us a bit. But we still are on track to continue to improve profitability. You saw what we have done year-to-date. We will improve that profitability next year and with the expectation that we are going to continue to get that benefit over time. The other thing I would mention is that, obviously, we only own 75% of this.",
  "word_count": 7569,
  "scraped_at": "2026-02-14T12:05:54.896948"
}