{
  "article_id": "2a9f60ab886d",
  "url": "https://musketfire.com/posts/patriots-invite-all-american-lacrosse-player-rookie-minicamp",
  "title": "Patriots invite All - American lacrosse player to try out in rookie minicamp",
  "date": "20230514T001500Z",
  "domain": "musketfire.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Patriots head coach Bill Belichick has always loved the game of lacrosse, quite possibly even more than football. His passion for lacrosse started in college at Wesleyan University, where he became the lacrosse team captain during his senior year in 1975.\nAll three of Belichick’s children were also college lacrosse players; Steven played at Rutgers, Brian played at Trinity, and Amanda played at Wesleyan like her father. It’s worth mentioning that Amanda is the head coach of the women’s lacrosse team at Holy Cross.\nLooking at Belichick’s coaching staff, he has three defensive coaches who were all former lacrosse players— his two sons, Steven and Brian, and Mike Pellegrino.\nPellegrino was a two-time All-American at John Hopkins and was a second-round pick in the 2015 Major League Lacrosse Draft by the New York Lizards. He played for the Boston Cannons as well before joining the Patriots.\nBelichick has always enjoyed seeing the possible conversion of a lacrosse player to the football field, as we saw Chris Hogan thrive playing for Belichick in New England, winning two Super Bowls with the Patriots.\nIn a recent report from Doug Kyed of A to Z Sports, the Patriots will have Dox Aitken try out during their rookie minicamp.\nAitken is a decorated All-American lacrosse player from the University of Virginia, becoming the best midfielder in school history and holding the all-time career point and goal record.\nIt’s worth mentioning that Aitken left the University of Virginia in 2020 to play football at Villanova as a wide receiver, but the season was canceled due to COVID-19, so Aitken returned to Virginia to play lacrosse.\nAitken is 6-foot-2, 210 pounds, and would likely be utilized as a Julian Edelman type of gadget player the Patriots have missed from their offense. If he makes it through minicamp, Aitken could be used on special teams as well, where Belichick probably sees him thriving in that role.\nNevertheless, Belichick has success when he adds a lacrosse player to his football team. It’ll be interesting to see how far Aitken can last this weekend in rookie minicamp and beyond.",
  "word_count": 350,
  "scraped_at": "2026-02-14T12:39:35.675348"
}