{
  "article_id": "2ab9753ecbad",
  "url": "https://www.abc.net.au/news/2025-08-14/the-inside-story-of-the-first-aflw-game-as-told-by-the-players/105628552",
  "title": "The inside story of the first AFLW game as told through the eyes of the players",
  "date": "20250813T214500Z",
  "domain": "abc.net.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The inside story of the first AFLW game as told through the eyes of the players\nOn February 3, 2017, the very first AFLW game was played between Collingwood and Carlton at Princes Park in Melbourne.\nTonight, the same sides will open the 10th season of the women's competition when they meet again on the same ground.\nThis is the story of that first night, as told by the players who were there.\nBrit Bonnici, Collingwood till present:\n\"The whole thing came around really quickly. We got told it [the competition] was happening in 2020, then we got told it's happening in 2017 (in 2016). And so everything just happened all at once, and then all of a sudden, it's game day.\n\"Our preseason didn't go for a long period of time. There was no real system or structure or any of that. It was very much bringing a group of girls together and then trying to get them to learn how to play together.\n\"And then all of a sudden, in a click of a finger, it was game day.\"\nJasmine Garner, then Collingwood, now North Melbourne captain: \"I played forward back then and we had a lot of good forwards at Collingwood. The forward line was kind of built around Mo (Moana Hope) and I remember just thinking, 'Am I going to get selected?'.\"\nDarcy Vescio, Carlton till present: \"I was still working upstairs [at Carlton as a graphic designer]. It was kind of a running joke that I was making graphics about the game and putting my face on things. … A few times people saw me clipping my own face to put on posters and I was like, 'Well, someone's got to do it'.\"\nJordyn Allen, then a fan, now Collingwood: \"As soon as we got the fixture, my dad and I and best mate Brooke, who was also in the talent pathway at the time, we pencilled in as many games as we could go to. The Carlton-Collingwood game was actually Nan's birthday that day. I remember having this real guilt, this confliction, do I stay for Nan's birthday? But Nan was like, 'No, no, go, go, go. You don't understand, this is history making'.\n\"I remember getting home from school [on game day] and looking at my watch being like let's go. I couldn't get off the bus quick enough. I had my stuff set out.\"\nVescio: \"The whole week building up, I felt like I was just running on fumes. So excited and kind of a bit scared at the same time because I just didn't know what was to come. Nobody knew whether people were going to show up.\n\"I remember my housemate Meg woke me up. It was game day and she was knocking on my door … she was like, 'Have you checked your phone?' And I was like, 'No'. And she was like, 'Check your phone, your Twitter has been hacked' … I thought it was so hilarious, and I was like, 'What are the odds?' Like someone from Collingwood who had done this to me. Like, 'you think that's going to throw me off my game?' Try again, try harder.\"\nBonnici: \"I didn’t really know what to think or expect leading into the game … I think I was so naive to what the moment actually was and what it meant because I was sort of just young.\"\nThe warm-up\nVescio: \"I remember our first warm-up, we went out and I was looking around and it was starting to get full. Not full full but I was like, 'there's quite a lot of people here'.\"\nGarner: \"It was like geez, it's a lot of people. You're running out and you couldn't really hear each other.\"\nGab Pound, Carlton till present: \"It was just amazing seeing just every seat pretty much filled. It was just like the atmosphere … you couldn't really explain it because it wasn't like a normal football atmosphere. It was just so many people in the community coming in and being like, this is history.\"\nBonnici:\"That was really crazy because before that moment, you'd play in front of your mum, your dad, your siblings, maybe they would come or a friend would maybe come, but that was all. Then all of a sudden we ran out and we're like, 'hang on, people are actually here'.\n\"We stood around in a circle before we put our guernseys on and I remember in that moment, having that real bubbling feeling that I get on game day. Then we ran out and it was like, 'where did all these extra people just come from?' Everyone had just filled the stadium.\"\nVescio: \"Before the final run out with the banner, we were in this tiny little dark tunnel underneath the stand that's now been knocked down … That's when Loz [captain Lauren Arnell] had said, 'I know you're going to be nervous and everything, but make sure when you get out there, you take it in and have a look around and take a moment to enjoy what's going on'.\n\"When we ran out, I looked around and I was like, 'Oh my gosh, there are so many people here'. I remember being like, there is just skin everywhere, there are so many people packed in, even the staircases in the grandstand were full.\"\nBonnici: \"When we did the national anthem, I remember looking around and it's a big game, so you get this feeling and I was just trying to be in the zone.\"\nAllen: \"We drove around for 40 minutes trying to find a car park … We came up through one of the stands and we're like 'there is literally not a seat anywhere' … We ended up behind the Collingwood coach's box, behind the bench, which was not by design, it was literally the only place that was free.\n\"We got there just as the ball was being thrown up … I just kind of remember looking at Brooke and being like 15 and I'd never teared up about anything in my life and here I am being in such a big moment.\"\nThe game ended up being a lockout.\nAt quarter-time, AFL chief Gillon McLachlan went outside the stadium to apologise to those who were locked out. He said the league wanted to let them in to stand in the aisles, but Victoria Police had advised it would not be safe.\n24,568 supporters managed to make it inside.\nThe game\nBonnici: \"One of my first kicks was on the boundary line and I remember getting so sidetracked by what was going on because I people were yelling over the fence and [I was] thinking they actually care.\"\nGarner: \"The first goal, the ball went up, first bounce, first contest, I remember it was a bit kamikaze. And then I think it was Hutchie [Meg Hutchins] who did a long kick in and I don't know if it was meant for me, but the ball was coming in and I was just going back [and] I actually ended up taking an easy chest mark.\n\"In the moment, I didn't think 'Oh, this could be the first goal ever kicked' it was just like 'I'll just go back and kick the goal' … Went back, quite an easy shot in the end, just went straight through and then all the girls got around me.\"\nBonnici: \"I remember Jazzy kicking the goal so clearly, you can remember where you were on the field.\n\"To me it was so cool because it was Jas and I'd played with her before through youth girls, through nationals, at Sharks … then to see people celebrating her like that … I looked up and there was just so much noise.\"\nGarner: \"We didn't kick another goal for the rest of the game. It was the Darcy Vescio Show after that.\"\nBonnici: \"The rest of the game was a bit of a blur. Except I remember there was a moment where Loz [Arnell] ran through me. She got me pretty good.\"\nAllen: \"[In the stands] it was kind of like when you commentate the game to your mates, every single tackle, every single kick, every single mark, everything was just awesome. We were just so stoked. I reckon we stood there like the whole game [behind] the Collingwood bench, so we could hear them chatting. We could hear Wayne [Siekman, inaugural Magpies coach] on the bench talking back and forth.\"\nCarlton defeated Collingwood 7.4 (46) to 1.5 (11).\nVescio had four goals.\nAfter the siren\nGarner: \"After the siren, it was weird. We're playing for four points but at the same time, it was a celebration of women's footy … You never like to lose. But that was really the first time and I was just like, 'Oh, let's just enjoy it', like, just the joy on so many people's faces, it was just the start of AFLW.\"\nVescio: \"You could feel that people were not just there to cheer for Carlton or Collingwood, it felt like there was an energy that will never be replicated, it was just beyond anything I'd ever felt before.\nLoading...\"It was just like the perfect night. I guess for us, especially having been able to win the game, and for me, being able to have played well in that game, I felt like it meant I could take everything in.\"\nBonnici: \"I remember doing the lap of honour at the end and sort of getting around people. And I've always been really competitive, so I just didn't want to do it. I was filthy that we were having to go around and high-five people after we lost. The competitor in me couldn't deal with that.\n\"Somebody gave me their child to take a photo with them … Now I understand they wanted this baby to know they were part of that moment.\"\nAllen: “We called mum and Nan on the way home and were like 'How cool was that?' Nan had had far too much to drink at home and was celebrating.\n\"She kind of gave me a bit of a history lesson. She's like, 'Times were so different when I was growing up that girls didn't play sport full stop and now girls are playing traditionally men's sports'.\"\nVescio: \"I remember we went back to Gab Pound's. She was having a house party and we just danced … I think I went to bed at like 5:30am or something like that.\n\"Because I could not sleep. I could not believe that that just happened. I had a press conference at like 10am the next morning. I remember just being like, 'Well, this is my life now … this is how I live'.\"\nAllen: \"We were kind of [already] looking ahead to the next game in the fixture. Like we were like 'OK, that was awesome. Can't wait to go to Casey fields [to watch Melbourne].\"\nBonnici: \"People always ask me, do you wish that you were younger so that you got to be a full-time footballer [from the start of your career] but to be 18 and be in that first game, that's something that no-one can ever take away from me.\n\"I reckon it's really easy to get caught up in where AFLW is going but … I wouldn't change for a second the fact that I got to be part of that first-ever game and now get to be a part of growing the league alongside it.\"",
  "word_count": 1924,
  "scraped_at": "2026-02-14T14:18:38.524633"
}