{
  "article_id": "2adca81974ff",
  "url": "https://themiamihurricane.com/2026/01/13/kyles-offensive-outburst-leads-hurricanes-to-89-73-victory-over-fsu/",
  "title": "Kyle offensive outburst leads Hurricanes to 89 - 73 victory over FSU",
  "date": "20260113T161500Z",
  "domain": "themiamihurricane.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "On the backs of graduate center Ra Shaya Kyle ‘s career high 30-point performance, Miami women’s basketball defeated rival Florida State 89-73 on Sunday afternoon.\nFamilies, Hurricanes Alumni, and students were all in attendance for the rivalry matchup. Not only were former players like Sheila Simpson (1998-02) and Maria Brown (2010-14) celebrated, but the game had high implications for the students as well.\nA raffle took place after the first media timeout of the fourth quarter for two students to win tickets to the College Football Playoff National Championship game on Jan. 19.\nThe players definitely felt the energy of the students as five Hurricanes including Kyle racked up a double-digit performance.\nFlorida State (5-12, 0-5 ACC) had the hot hand early, putting up five quick points led by junior guard Emma Risch. UNLV transfer Amarachi Kimpson answered back with a three-pointer.\nKimpson has been exceptional in ACC play this season, averaging 14.25 points per game in four ACC contests. She finished with 17 points on the night. Despite attempts to take the lead, the Seminoles held a 19-18 lead going into the second quarter.\nMiami flipped momentum early on in the second quarter as Kyle had two quick baskets. It was back and forth the entire quarter but UM took a 37-35 lead at the halftime break.\nSophomore guard Gal Raviv scored seven of her 13 points in the third quarter, firing on all cylinders. UM shot a stifling 61.1% from the field in the third and closed the quarter on 11-0 run.\nUp 66-56 going into the last 10 minutes of play, Miami played with assertive defense as they hold Florida State scoreless from beyond the arc. Four fourth quarter rebounds from Kyle led Miami to a 89-73 victory,\nMiami (11-6, 3-3 ACC) will hit the road for three games and will first travel to North Carolina to take on the Tar Heels on Thursday, Jan. 15 at 7 p.m.",
  "word_count": 322,
  "scraped_at": "2026-02-14T13:23:44.465239"
}