{
  "article_id": "2aea55e4ef49",
  "url": "https://www.finanznachrichten.de/nachrichten-2024-09/63380202-at-united-nations-saudi-arabia-calls-for-global-collaboration-to-tackle-land-degradation-at-cop16-riyadh-008.htm",
  "title": "At United Nations , Saudi Arabia Calls for Global Collaboration to Tackle Land Degradation at COP16 Riyadh",
  "date": "20240927T104500Z",
  "domain": "finanznachrichten.de",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "UNCCD COP16 in December aims to be turning point in the global fight against land degradation, desertification and drought\nNEW YORK, Sept. 27, 2024 /PRNewswire/ -- Saudi Arabia has called on the world's policymakers to urgently address land degradation, drought and desertification ahead of the 16th UN Convention to Combat Desertification (UNCCD) COP16 in Riyadh in December. Every second, an equivalent of four football fields of healthy land becomes degraded, totaling 100 million hectares every year.\nAt their \"Road to Riyadh\" event on the sidelines of the UN General Assembly, opened by Prince Faisal bin Farhan Al Saud, Minister of Foreign Affairs, Saudi Arabia urged delegates to prepare to take decisive action in December, outlining a roadmap for international action and engagement and unveiling the thematic program for the COP.\nIncoming COP16 President and Saudi Arabia Minister of Environment, Water, and Agriculture, Eng. Abdulrahman Abdulmohsen AlFadley, said, \"This is a pivotal moment for our planet. Land restoration is vital to securing a prosperous future for generations to come.\"\n\"It is crucial the international community unites to deliver ambitious and lasting solutions that curb land degradation, combat drought, and promote the sustainable use of natural resources,\" added Minister AlFadley. \"We must strengthen international cooperation to address the pressing environmental challenges facing our planet.\"\nMinister AlFadley also emphasized that Saudi Arabia's hosting of COP16 reflects its commitment to environmental preservation and restoration, both domestically and internationally, citing initiatives such as the Saudi Green Initiative, the Middle East Green Initiative, and the G20 Global Land Initiative.\nWhile land degradation trends vary across regions, UNCCD data warns that, if current patterns continue, the world will need to restore 1.5 billion hectares of degraded land by 2030 to meet the Land Degradation Neutrality targets outlined in the Sustainable Development Goals. In Riyadh, under the Kingdom of Saudi Arabia's Presidency of COP16, there will be a strong push for more concrete commitments to accelerate restoration efforts and meet this critical goal.\nSenior stakeholders from international organizations, government and civil society also addressed the growing need to increase ambition and address the global challenges caused by land degradation, including drought, food insecurity and forced migration, alongside the urgent need for multilateral action to them to tackle them.\nUNCCD Executive Secretary Ibrahim Thiaw said: \"Land degradation and drought affect nearly half the world's population, especially indigenous communities, smallholder farmers, women, and youth. COP16 in Riyadh will be a pivotal moment to accelerate large-scale land restoration and boost drought resilience, with multiple benefits for people, nature and climate. Our success depends on the ambition of all parties and our commitment to resetting our relationship with the land for future generations.\"\nAccording to the UNCCD, up to 40% of the world's land is already degraded, directly affecting an estimated 3.2 billion people. At the same time, droughts are occurring more frequently and with greater intensity - up 29% since 2000. An estimated 75% of people globally will be affected by drought by 2050.\nAbout COP16 Riyadh:\nThe conference will take place December 2-13, 2024 in Riyadh, Saudi Arabia and will be the first UNCCD COP to feature a Green Zone, providing a space for business and civil society to deliver lasting solutions to land degradation, desertification and drought. For more information, please visit UNCCDCOP16.org.\nJournalists are invited to apply for accreditation via the UNCCD's Online Registration System.\nPhoto: https://mma.prnewswire.com/media/2517545/COP16_Riyadh.jpg\nFor media enquiries, please contact: media@unccdcop16.org or press@unccd.int.\nView original content:https://www.prnewswire.co.uk/news-releases/at-united-nations-saudi-arabia-calls-for-global-collaboration-to-tackle-land-degradation-at-cop16-riyadh-302260958.html\nGleichzeitig vollzieht sich an der Wall Street ein lautloser Favoritenwechsel. Während viele auf Wachstum setzen, feiern Value-Titel mit verlässlichen Cashflows ihr Comeback: Telekommunikation, Industrie, Energie, Pharma – die „Cashmaschinen“ der Realwirtschaft verdrängen hoch bewertete Hoffnungsträger.\nIn unserem aktuellen Spezialreport stellen wir fünf Aktien vor, die genau in dieses neue Marktbild passen: solide, günstig bewertet und mit attraktiver Dividende. Werte, die nicht nur laufende Erträge liefern, sondern auch bei Marktkorrekturen Sicherheit bieten.\nJetzt den kostenlosen Report sichern – bevor der Value-Zug 2026 endgültig abfährt!\nDieses exklusive PDF ist nur für kurze Zeit gratis verfügbar.",
  "word_count": 663,
  "scraped_at": "2026-02-14T14:13:21.589330"
}