{
  "article_id": "2af320e7001e",
  "url": "https://metro.co.uk/2026/01/29/anthony-joshua-fights-back-tears-emotional-tribute-friends-killed-car-crash-26595819/",
  "title": "Anthony Joshua fights back tears in emotional tribute to friends killed in car crash",
  "date": "20260129T214500Z",
  "domain": "metro.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Anthony Joshua has spoken out in an emotional tribute to his friends Sina Ghami and Latif ‘Latz’ Ayodele, who were killed in a car crash he was involved in in December.\nThe former heavyweight champion was also a passenger in the car which crashed in Nigeria on December 29, hospitalised but escaping with minor injuries.\nGhami, who was Joshua’s strength and conditioning coach, and Ayodele, who was his personal trainer died at the scene on the Lagos-Ibadan expressway in Makun.\nJoshua has said very little since going through the horrific ordeal but has spoken out in a video posted on social media on Thursday evening.\nThe 36-year-old has thanked well-wishers for their support as he held back tears talking about his two close friends.\n‘This is the best way I could reach out to you worldwide who are showing so much love, care and support during that tragic, traumatic time where we lost Latz and Sina in Nigeria,’ said Joshua.\n‘The last time I spoke to you guys was in Miami [after fighting Jake Paul], we had so many plans to wrap up 2025 and we were on a mission. We went home, to see our families and everything go flipped on it’s head.\n‘God’s the best planner, we can plan to the best of our capabilities, but that was such an unforeseen circumstance that was out of all of our control. And not only did their parents, their uncles, their cousins, their friends and myself, lose two great men. We lost people that we dearly care about, have been major players in all of our lives, major, major players in all of our lives. It’s tough. It’s really tough.\n‘I’m not gonna sit here and show all of my emotions. I know in today’s day and age, it’s easy to microanalyse people, pass judgment, but I know what I felt, and I know what my duty is.\n‘They were my brothers, my friends, first and foremost. Then we became business partners, we became hustlers, we became generals, we became everything. We became housemates, who were living together…It’s a shame. It’s a shame.’\nJoshua said it is only since the accident that he has fully realised the position his two friends held in his life.\n‘One day my time will come and I’m not scared, it’s actually comforting to know I’ve got two brothers on the other side,’ he said.\n‘You know, I’ve lost people before, but I don’t think I’ve lost people like that, my left and my right. Throughout this journey that I’ve been on. I didn’t realise that I’m the big guy but I was walking with giants, that kept me protected, kept me shielded.’\nJoshua’s future, whether that involves a boxing ring or not, remains unclear, but he says he will be on a mission to help Ayodele and Ghami fulfil their own dreams.\n‘The mission must go on. I understand my duty,’ he said. ‘My goal is to continue to help the them achieve their goals, even though they may not be here in the physical. I will definitely be saying my prayers, and I’m going to help them fulfil their dreams for their families. It’s not only me, there’s a whole team of us, a whole brotherhood and sisterhood helping fulfil their legacy and dreams.\n‘I know in my corner of the world, I know what I’m going to be doing, and I know what we’re gonna do to continue their…I don’t wanna say legacy, it ain’t about legacy, it’s just doing what’s right. And I know I’m going to do what’s right for them, I know what I’ve got to do.\nWho were Anthony Joshua's friends Latif Ayodele and Sina Ghami?\nThroughout his time in boxing, Anthony Joshua has kept a close-knit circle of friends and associates around him, plenty of those working silently behind the scenes during his ascent to the summit of the sport.\nBoth Ghami and Ayodele were part of that group, considered good friends having worked closely with him for years.\nWho is Latif ‘Latz’ Ayodele?\n‘Latz’ is a long-time friend of Joshua’s and has been part of the AJ team going all the way back to his maiden world title victory over Charles Martin in 2016.\nAyodele was Joshua’s personal trainer and a dedicated Muslim having converted to Isam in 2012.\nHis Instagram feed is littered with images and videos of him alongside Joshua in the gym and relaxing away from it.\nJust hours before the crash, he shared a video on Instagram of him and Joshua smiling and laughing over a game of table tennis.\nLatif worked with a number of other prominent sports men and women with New Zealand rugby legend Sonny Bill Williams among those paying tribute.\nAccording to his Facebook profile, he attended St Joan of Arc Catholic School in Rickmansworth, a few miles from Joshua’s hometown of Watford.\nWho is Sina Ghami?\nGhami was Joshua’s strength and conditioning coach, a role he held for more than a decade.\nHe was also the co-founder of Evolve Gym in London. Their website states Ghami was a qualified sports and exercise rehabilitator who specialises in musculoskeletal injuries and corrective exercise.\nGhami was at Joshua’s side throughout his career, including his crowning moment against Wladimir Klitschko at Wembley Stadium in 2017.\nHis last Instagram story appeared to be a shot of Joshua’s motorcade through Lagos.\n‘I’m gonna do what’s right by their family. It’s about what’s important to me, and they’re very important players, very important team members, very important friends and two of my brothers.’\nHe finished by saying: ‘I don’t think I’ve mentioned the love and appreciation. It’s all acknowledged by me, by them, by their families. 100 per cent we acknowledge the 1000s, maybe going into millions around the world that showed so much love to them both. I still can’t get my head around it.\n‘I just want to say thank you. We heard you all, we saw the messages, the tweets, the social media, the YouTubes, the prayers, it’s all been acknowledged. So yeah, we know what we’re going to do. Mama Latz, Mama Sina, Pappa Latz, Pappa Sina, one love.’\nMORE: Tyson Fury confirms boxing comeback on Netflix against Russian beast who wrestles bears\nMORE: Tyson Fury could fight Russian beast who wrestles bears for fun in comeback bout\nMORE: Anthony Joshua issues emotional update after car crash killed his two friends",
  "word_count": 1071,
  "scraped_at": "2026-02-14T13:23:15.978805"
}