{
  "article_id": "2af70820dfab",
  "url": "https://www.burntorangenation.com/2023/8/8/23825055/longhorns-daily-news-texas-quinn-ewers-davey-obrien-award-watch-list-rickey-williams-big-12",
  "title": "Longhorns Daily News : Texa Quinn Ewers just made the Davey OBrien Award watch list",
  "date": "20230808T221500Z",
  "domain": "burntorangenation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Drake Maye. Bo Nix. Caleb Williams. Taulia Tagovailoa. The Texas Longhorns’ Quinn Ewers.\nLonghorns Daily News: Texas’ Quinn Ewers just made the Davey O’Brien Award watch list\nPlus: Ricky Williams earns legacy honor\nWhat do these names have in common?\nAmong many others, they all just made the Davey O’Brien Award watch list.\nWHAT THEY’RE SAYING ABOUT THE LONGHORNS\nAustin American-Statesman: Ethan Burke has edge in battle to start\n247Sports: Morning Brew: True freshmen who are turning heads in fall camp for the Longhorns\n247Sports: How less receptions could mean ‘more’ for Ja’Tavion Sanders and the Texas offense\nInside Texas: Anthony Hill has earned praise from his teammates, but what will his role be in 2023?\nInside Texas: Can Jalen Catalon solve Texas’ problems in 2023?\nInside Texas: Texas Longhorns team intel through five days of practice\nInside Texas: Texas Longhorns team intel through five days of practice\nInside Texas: Freshman receiver Johntay Cook continues to impress coaches and teammates\nICYMI IN BURNT ORANGE NATION\nRECRUITING ROUNDUP\n247Sports: Five-star edge rusher Colin Simmons to announce commitment on 247Sports\n247Sports: Top247 junior WR Daylan McCutcheon sees opportunity for development at Texas\n247Sports: Three-star defensive lineman TJ Lindsey down to final five schools\n247Sports: Close up look at top 10 un-committed Players in California\nInside Texas: The importance of Billy Glasscock, recruiting pioneer and Texas’ director of player personnel\nInside Texas: Who could be next out of Florida for the Texas Longhorns?\nBIG 12 BREAKDOWN\nOur Daily Bears: Baylor football receives votes in 2023 Preseason Coaches Poll\nFrogs O’ War: TCU football ranked No. 16 in 2023 Preseason Coaches Poll\nFrogs O’ War: 2023 TCU Football Opponent Preview: SMU Mustangs\nBring On The Cats: The Big 12 Expands: Making sense of the timeline\nWHAT WE’RE READING\nSB Nation: Kevin Brown’s suspension could undo all the positive vibes in Baltimore\nSB Nation: Meet Team USA’s FIBA Basketball World Cup roster, featuring one of its youngest groups ever\nNEWS ACROSS LONGHORN NATION AND BEYOND\n- To say the least.",
  "word_count": 335,
  "scraped_at": "2026-02-14T13:37:50.507737"
}