{
  "article_id": "2b2d262034f1",
  "url": "https://www.wfdd.org/story/updates-recovery-efforts-continue-after-helene",
  "title": "Updates : Recovery efforts continue after Helene",
  "date": "20241005T203000Z",
  "domain": "wfdd.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Updated 10/11 3:43 p.m.\nState health officials are offering drinking water safety tips to residents and restaurants impacted by Hurricane Helene.\nThe North Carolina Department of Health and Human Services is cautioning the more than 300,000 flood-impacted residents who rely on private wells for drinking water to have them disinfected and tested for bacteria. Until that happens, state officials say residents should only drink bottled or treated water.\nRestaurants without their usual sources of water can still reopen through an Emergency Operations Plan developed with their local health department. The plan may include operating modifications based on the amount of water available, like take-out only service or the addition of portable toilets.\nNCDHHS is also offering mental health resources to those recovering from the storm. Residents can call the national Disaster Distress Helpline for immediate crisis counseling. Walk-in mental health clinics are open in 24 counties impacted by Helene.\nUpdated 10/7 3:27 p.m.\nThe North Carolina State Board of Elections has unanimously passed an emergency resolution to make several voting changes in western North Carolina after Hurricane Helene devastated the region. The board is made up of both Democrats and Republicans. The resolution passed Monday includes changes such as allowing absentee ballots to be dropped off at Election Day polling places by 7:30 p.m. It also lets voters pick up absentee ballots in person until the day before the election. County election boards may also make changes to where early voting and Election Day polling places are located.\n- Associated Press\nUpdated 10/6 10:38 a.m.\nThe death toll from Hurricane Helene has inched up to 227 as the grim task of recovering bodies continues more than a week after the monster storm ravaged the U.S. Southeast. Helene came ashore Sept. 26 as a Category 4 hurricane and carved a wide swath of destruction as it moved northward from Florida. It destroyed homes, washed away roads and knocked out electricity and cellphone service for millions. The death toll could rise even higher. It is not clear how many people are unaccounted for or missing. Helene is the deadliest hurricane to hit the mainland U.S. since Katrina in 2005.\n- Associated Press\nUpdated 10/5 12:56 p.m.\nTown officials in Banner Elk are asking tourists and second-home owners not to come to town and asking people who live there to leave if they have somewhere else safe to go. “It's not safe for the visitors to come. It's not safe for all our locals. Every additional person in the area is a resource taken away from what we need to be focused on here,” says Lora Elder, a volunteer handling the town’s crisis communications.\nAlthough Banner Elk has a reputation as an affluent resort town, Elder says most folks who remain in town are service workers who lack the resources that many visitors have. “You have a town of people that are dependent upon being able to wait tables or work in ski shops or part of the landscaping teams and all these other matters that just aren't happening and won't for a while. Economically, this is going to be a huge hit, multiple layers of crisis.”\nUpdated 10/5 10:40 a.m.\nNorth Carolina General Assembly leaders say they’re prepared to approve initial disaster relief next week. House Speaker Tim Moore and Senate Leader Phil Berger said in a Friday news release that they're still working out the details of exactly what's needed for now to address the damage from Hurricane Helene. Lawmakers at an already-scheduled one-day session Wednesday are expected to advance a down payment on the state’s share of relief funds as well as legal changes to provide flexibility to agencies and displaced residents. State government coffers already include $5.5 billion in “rainy day” and disaster reserves.\nDemocratic presidential nominee Kamala Harris is heading to North Carolina as the state recovers from Hurricane Helene. She'll be in the state on Saturday, one day after a visit by Republican Donald Trump, who has been spreading false claims about the federal response to the disaster. Harris was in Georgia this week, where she helped distribute meals, toured damage and consoled families hard-hit by the storm. Trump has falsely claimed the Biden administration isn’t doing enough to help impacted people in Republican areas and harshly criticized the federal response.\n- Associated Press\nUpdated 10/4 4:40 p.m.\nNorth Carolina Emergency Management officials are cautioning the public about false Helene reports and misinformation being shared on social media. Hurricane Helene resulted in significant damage to the cellular network and communications systems. Misinformation online has led to false news reports and rumors about coordinated response efforts. Dangerous conditions continue in some areas and erroneous information could put people at risk.\nThe North Carolina State Emergency Response Team (NC SERT) has established a fact versus rumor response website to provide factual information in the wake of this disaster: www.ncdps.gov/helene-facts.\nAdditional reliable, up-to-date information about response, recovery and relief efforts can be found at www.ncdps.gov/helene.\nThe state department of public safety says people should get information about storm response and impacts from trusted sources like NC SERT, National Weather Service, and other federal, state, county and local government sites. Be aware that AI-generated images are being circulated on social media that depict made-up conditions on the ground.\nUpdated 10/4 4:31 p.m.\nLees-McRae College in Banner Elk announced it will resume classes online on Monday, Oct. 7 in light of damage caused by Hurricane Helene.\nIn a video posted on the college's Facebook page, President Herbert King said clean-up crews have been working to remove fallen trees and remediate buildings on campus. But that alone won’t be enough for students to safely return to school.\n“There is no local infrastructure to support you. There is still no water and sewer in the town of Banner Elk,\" King said. \"And until those items are repaired, we are uncertain when we'll return to some sort of a normal operation here at Lees-McRae.”\nKing said students will be invited to retrieve their belongings and take them home in the coming days as the college transitions to online learning.\nAvery County Schools announced that the district will remain closed until it is “safe to return.”\nOfficials say the goal is to reopen as soon as possible, though there is no set timeline yet. Administrators will provide staff, parents and students with a 72-hour notice of reopening to give everyone time to prepare.\nUpdated 10/4 3:08 p.m.\nAs temperatures in mountain areas are expected to drop in the coming week and many will be using secondary heating sources as a result of damage from Helene, the town of Boone has issued a public service announcement regarding safety and these items.\nUpdated 10/4 1:17 p.m.\nWFDD has created a text-only news page for those in low-service areas. It can be found here.\nUpdated 10/4 11:42 a.m.\nThe search for victims of Hurricane Helene is dragging into its second week. With at least 215 dead, lack of phone service and electricity continues to hinder efforts to contact the unaccounted for. That means search crews must trudge through the mountains to learn whether residents listed as missing are safe. Exhausted rescue crews and volunteers continue to work long days — navigating past washed-out roads, downed power lines and mudslides. Sheriff Quentin Miller of Buncombe County, North Carolina, has a message for those still waiting: “We’re coming to get you. We’re coming to pick up our people.”\n- Associated Press\nUpdated 10/3 2:37 p.m.\nThe state is implementing temporary changes to North Carolina Medicaid in order to help people impacted by Helene access necessary health care.\nThe changes will allow individuals to refill prescriptions early, receive medically necessary services, and be admitted to a nursing home more quickly, among other things.\nThe flexibility is in effect from September 26 through October 15. More information can be found here.\nUpdated 10/3 12:43 p.m.\nAccording to the Associated Press, Hurricane Helene's death toll reaches 200 after Georgia and North Carolina report more fatalities.\nUpdated 10/3 11:40 a.m.\nBlue Ridge Public Radio has created a text-only news updates page. This site loads faster for those in low-service areas. It can be found here.\nUpdated 10/3 11:08 a.m.\nHurricane Helene has left millions without electricity, water and phone service across the Southeast in the six days since making landfall. Now many people are relying on old-fashioned ways of communicating and coping. In one North Carolina town, local leaders are updating residents at meetings in the town square. Message boards list the names of the missing. Mules delivered medical supplies to mountaintop homes. The death toll has topped 180, and many people remain unaccounted for. President Joe Biden surveyed the devastation in the Carolinas from the air on Wednesday and plans to tour disaster areas in Georgia and Florida on Thursday.\n- Associated Press\nUpdated 10/2 5:28 p.m.\nAppalachian State University announced that classes will resume no earlier than Oct. 16.\nOfficials say the modality and locations will be determined based on conditions and infrastructure, with an update to be shared by Oct. 9.\nOn the Boone Campus, no residence halls are structurally compromised. Officials say they remain open and operational along with the central dining hall, campus markets, the student union, student health service and the student recreation center.\nIn partnership with the Red Cross, the Holmes Convocation Center on campus is providing food, water and beds to students and community members. Off-campus students, faculty and staff in need of shelter should call 1-800-RED-CROSS (733-2767).\nAt the Plemmons Student Union (3rd Floor, Room 324), the App State community is welcome to meet with representatives from Counseling & Psychological Services, Case Management, Emergency Management, Financial Aid, Off-Campus Student Services, the Student Legal Clinic and App State Disaster Relief Recovery Fund from 10 a.m. to 3 p.m.\nMore information about resources available at App State can be found here. Additionally, an App State Disaster Relief Recovery Fund has been established to assist students, faculty and staff. More information on that can be found here.\nUpdated 10/2 4:30 p.m.\nCorrectional institutions and treatment centers in western North Carolina are being evacuated due to a lack of power and water following Hurricane Helene.\nOn Monday, the North Carolina Department of Adult Correction relocated approximately 400 offenders from the Western Correctional Center for Women in Swannanoa and the Black Mountain Substance Abuse Treatment Center for Women.\nAn additional 800 men incarcerated at Avery-Mitchell Correctional Institution in Spruce Pine were evacuated on Tuesday.\nState officials say offenders were all relocated to several prisons across the state. The duration of those placements will depend on the time it takes to restore water and power.\nFamily and friends are asked not to call the prisons to check on their loved ones. Officials say relocated offenders will be able to make phone calls once they arrive at their new destinations.\nAdditionally, the state’s Offender Locator will be updated within 24 hours to indicate where individuals have been rehoused.\nUpdated 10/2 2:10 p.m.\nBuncombe County Manager Avril Pinder says 57 people have died in the county from Hurricane Helene.\nNotification of next-of-kin continues to be a challenge because of lack of communications in the region, Pinder said. She anticipates having more updates from Buncombe County Sheriff Quentin Miller at a 4 p.m. press briefing.\nYesterday, Watauga County officials confirmed two residents were killed by landslides after the storm.\n-Blue Ridge Public Radio\nUpdated 10/2 10:28 a.m.\nWatauga County Schools remain closed for this week, but several schools are operating as distribution sites for resources.\nWatauga High School is distributing water, food, cleaning supplies, toiletries, paper goods and other household items from 8 a.m. to 6 p.m. daily. Computers are also set up in the front office for residents in need of internet access to complete Federal Emergency Management Agency applications.\nWiFi is also available at Green Valley and Hardin Park Elementary Schools.\nHardin Park is also opening a child care site for students in grades K-6. It will be open from 9 a.m. to 4 p.m., serving breakfast, lunch and snacks. Officials say workers will do their best to provide a bag of non-perishable food for students to take home. Registration will begin on site on Wednesday.\nWatauga County schools are attempting to reach out to all families this week and conduct welfare checks. Families who haven’t heard from a school system employee by Wednesday are encouraged to reach out to the school site or district office at 828-264-7190.\nCatawba County Schools is closed for students on Wednesday, with an optional teacher work day due to power outages and blocked roads. Officials say their goal is to return to school when power outages decrease and it is safe to transport students. Extracurricular activities will be allowed, but families should check with their individual schools or coaches for updates.\nThe district is offering child care from 6 a.m. to 6 p.m. at six elementary school sites: Catawba, Mt. View, Oxford, Snow Creek, St. Stephens and Startown.\nWilkes County Schools announced that it will be operating on a 2-hour delay for students on Wednesday in order to ensure safer driving conditions. District officials say buses may not be able to travel roads that are closed or blocked. Parents are asked to contact their child’s school if they have bus-related concerns.\nUpdated 10/2 9:35 a.m.\nTwo North Carolina facilities that manufacture the high-purity quartz used for making semiconductors, solar panels and fiber optic cables have been shut down by Hurricane Helene. No reopening date is in sight. Sibelco and The Quartz Corp both shut down operations in the Appalachian town of Spruce Pine on Thursday. The town is home to mines that produce some of the world’s highest-quality quartz. Since the storm, both companies have issued statements saying that their top priorities are making sure their employees are safe. Sibelco says some employees are “unreachable due to ongoing power outages and communication challenges.”\n- Associated Press\nUpdated 10/1 6:48 p.m.\nWatauga County officials say two residents were killed by landslides after Helene swept through mountain communities. Numerous other injuries have been attributed to the storm or clean-up efforts.\nAt a press conference, County Director of Emergency Management Will Holt said they are working with volunteer organizations and state officials to set up distribution points for hot meals, water, and cell phone charging stations.\nHolt called uncoordinated donations “incredibly harmful.” He also characterized recovery as a “yearslong process.”\nWatauga County Schools are closed this week, though Watauga High School is operating as a water distribution center daily from 8 a.m. to 6 p.m. Hardin Park Elementary School will be providing childcare from 9 a.m. to 4 p.m. starting Wednesday. Read more here.\nBoone Mayor Tim Futrelle said the town would stay under a curfew for the foreseeable future from 11 p.m. to 7 a.m. He also said Boone’s water boil advisory has been lifted as issues at the water plant have been resolved.\nUpdated 10/1 5:39 p.m.\nRescuers are scouring the mountains of western North Carolina for anyone still unaccounted for since Hurricane Helene’s remnants caused catastrophic damage to the Southeast. The death toll Tuesday reached 159 people. Residents in the Blue Ridge Mountains of North Carolina have been lining up for water and food, hunting for cellular signals after the storm deluged the region. Emergency workers have been clearing roads, restoring power and reaching those still stranded. President Joe Biden plans to survey the area Wednesday. Forecasters say Kirk on Tuesday became a hurricane in the Atlantic and could strengthen into a Category 3 storm Thursday.\n- Associated Press\nUpdated 10/1 2:06 p.m.\nOfficials say students at the University of North Carolina system’s western campuses are safe and have access to food and water, but communication remains limited after Helene.\nClasses are suspended at Appalachian State, UNC Asheville and Western Carolina University. UNC system leaders say other campuses across the state have rushed to provide support to those campuses.\nAmong those contributions, NC State sent a team of student affairs professionals, counselors and facilities crews to UNC Asheville, while East Carolina University sent food trucks for staff and students. UNC Chapel Hill sent an environmental safety team to assess facilities concerns at Appalachian State.\nUNC system leaders say all UNC institutions will provide mental health support to students impacted by the storm.\nUpdated 10/1 1:10 p.m.\nState and federal officials say they are working to get more resources and help to western North Carolina due to Helene.\nIn a press conference Tuesday, Governor Roy Cooper said the devastation brought by Helene is beyond belief.\n\"Access to water is difficult for many people. More than 1,100 people are being housed in 29 shelters,\" he said. \"We're working together to open more major routes to push supplies forward while repairing roads, utilities and communications.\"\nCooper said he also spoke with President Biden to get approval to use U-S soldiers from Fort Liberty, and U-S Marines from Camp Lejeune to assist with getting resources to western North Carolina. Right now, there are 800 North Carolina National Guard members helping with relief efforts.\n-WUNC\nUpdated 10/1 1:00 p.m.\nState emergency officials are working to reopen roads in mountain communities devastated by Helene’s catastrophic flooding.\nAt a press conference Tuesday morning, North Carolina Transportation Secretary Joey Hopkins said 425 roadways remain closed, and 700 individual damage sites have been reported.\n“However, we're starting to see some progress on clearing, repairing and even opening roads.” he said. “Eastbound I-40 near Old Fort has now reopened, and we hope to reopen westbound I-40 in that same area today. I-26 is open throughout the state of North Carolina, and 421 is open to Boone and even past Boone toward the Tennessee line.”\nHopkins says residents should still avoid traveling into impacted regions unless they are assisting with recovery efforts – nonemergency trips are hindering first responders.\nUpdated 10/1 11:50 a.m.\nDesperate residents of the storm-battered mountains of western North Carolina lined up for water and food, hunted for cellphone signals and slogged buckets from creeks to flush toilets days after Hurricane Helene’s remnants deluged the region. Emergency workers toiled around the clock to clear roads, restore power and phone service, and reach people stranded by the storm, which killed at least 133 people across the Southeast, a toll expected to rise.\nBuncombe County manager says they've checked on the welfare of roughly 150 residents with ‘high needs’\n“We’ve been going door to door, making sure that we can put eyes on people and see if they’re safe,” Buncombe County Manager Avril Pinder said.\nPinder said she couldn’t specify a number of county residents who remain “unaccounted for” since the storm.\n“We know that there are places that are still hard to access,” Pinder said. “There’s still trees down or power lines down or water is still moving rather rapidly. So we’re being strategic in trying to get out to those neighbors now. We have helicopter support, and we’ve been trying to fly into areas that we cannot go by foot or by boat or by car.”\nHelene and other storms dumped a whopping 40 trillion gallons of rain on the South\nMore than 40 trillion gallons of rain drenched the Southeast United States in the last week from Hurricane Helene and a run-of-the-mill rainstorm that sloshed in ahead of it — an unheard of amount of water that has stunned experts.\nThat’s enough to fill the Dallas Cowboys’ stadium 51,000 times, or Lake Tahoe just once. If it was concentrated just on the state of North Carolina that much water would be 3.5 feet deep (more than 1 meter). It’s enough to fill more than 60 million Olympic-size swimming pools.\n“That’s an astronomical amount of precipitation,” said Ed Clark, head of the National Oceanic and Atmospheric Administration’s National Water Center in Tuscaloosa, Alabama. “I have not seen something in my 25 years of working at the weather service that is this geographically large of an extent and the sheer volume of water that fell from the sky.\"\nUpdated 10/1 11:09 a.m.\nThe Second Harvest Food Bank of Northwest North Carolina is mobilizing to provide relief following the devastation caused by Helene.\nRoads and power lines remain heavily damaged throughout the western part of the state. According to a news release, 10 of the 18 counties served by the food bank are in heavily affected areas.\nThe nonprofit is working alongside emergency management to dispatch drinking water, food and cleaning supplies to those in need. Products are also on the way to the organization’s warehouse to ensure a steady supply to address food insecurity throughout the region.\nPeople can donate supplies or sign-up to volunteer by visiting Second Harvest Food Bank’s website.\nUpdated 10/1 9:53 a.m.\nThe city of Greensboro is contributing to the emergency response in western North Carolina.\nAccording to a press release, Guilford Metro 9-1-1 initially served as the alternate route for 911 calls from Macon County on Friday, September 27. Since then, the department has received nearly 140 calls for the following western counties: Macon, Buncombe, Transylvania, Yancey, Avery, Graham, Burke, Henderson, Jackson, Haywood and McDowell.\nThe following phone numbers have been set up to report missing persons:\n- North Carolina callers: 211\n- Out-of-State callers: 888-892-1162\nThe Water Resources Department sent two six-person teams to address water and sewer services, including water main repair work in Asheville. Crews will remain in the field through Thursday and relief staff will be sent out on Wednesday.\nThe Greensboro Police Department deployed 36 officers on Sunday to assist the Asheville Police Department, and the Greensboro Fire Department deployed 26 people to provide water rescue, telecommunications, logistics, and GIS mapping and damage data collection.\nUpdated 9/30 5:41 p.m.\nThe death toll after Hurricane Helene left a trail of destruction across the U.S. Southeast has reached at least 128 across six states. According to NPR, 45 of those deaths are in Buncombe County. A crisis is unfolding in the mountains of western North Carolina, where water, food and other supplies are being airlifted into places cut off by mudslides and washed-out roads. Officials worry the death toll will rise as searchers reach isolated areas. Nearly three dozen people have died in the county that includes the tourism hub of Asheville. The city’s water system has been severely damaged. Forecasters are keeping a close eye on Tropical Storm Kirk, which is expected to become a powerful hurricane this week.\nUpdated 9/30 4:40 p.m.\nA curfew remains in place for Boone, Watauga County and the Town of Blowing Rock from 7 p.m. to 7 a.m. due to severely compromised roads and ongoing emergency operations related to Hurricane Helene.\nResidents are urged to avoid all unnecessary travel.\nAll debris in the area should be placed curbside and separated into the following categories: vegetative, construction, hazardous, large appliances and electronic materials.\nResidential trash pickup in Boone is not currently available, and the Watauga County Landfill is closed this week. Disaster relief organizations Baptist on Mission and Samaritan’s Purse are both offering cleanup assistance at this time.\nWatauga County residents are being encouraged to document their damages and take photos of any items they need to throw away. Homeowners and renters can apply for assistance through FEMA by going to Disaster Assistance Dot Gov or downloading the FEMA app.\nFor those without internet access, WiFi is available on Appalachian State University’s Boone campus at the top level of the College Street Parking Deck and the entire Blue Ridge Parking Deck.\nLocal officials also recently announced that the Pet Care Clinic of the High Country will board the dogs and cats of evacuees. Additionally, the Hunger and Health Coalition has insulin for those in need.\nUpdated 9/30 4:03 p.m.\nThe North Carolina Department of Transportation is asking people to avoid traveling through the western part of the state as recovery efforts continue after Tropical Storm Helene.\nAround 430 roads, including areas along Interstate 40 and dozens of highways in the foothills and mountains, remain closed. According to a news release, the recovery effort is expected to take months due to the serious damage.\nMost of the road closures are west of Interstate 77, and due to flooding, downed power lines or debris from rock slides. The state has marked I-40 impassable in multiple locations and Interstate 26 is closed at the Tennessee state line.\nNCDOT crews from lesser impacted areas of the state have been deployed to bring in fuel and remove debris.\nInterstates, U.S. and state highways will be prioritized in reopening with state-maintained secondary roads to follow. All roads in western North Carolina should be considered closed and non-emergency travel is currently prohibited.\n📸 - Southeastern Buncombe County; South of N.C. 9\nScenes like this are common across Western NC today as crews are spread out for #HeleneNC cleanup and recovery.\nAll roads in Western NC should be considered closed to all non-emergency travel. pic.twitter.com/lqgTgfr3Og\n— NCDOT (@NCDOT) September 30, 2024\nUpdated 9/30 3:31 p.m.\nWatauga County residents are experiencing power outages and catastrophic flooding due to Hurricane Helene.\nMany are in need of shelter, food, water and other resources. Residents are urged to avoid unnecessary travel (this map documents road closures in the area) but for those in need, click here for locations offering support during this time.\nUpdated 9/30 2:00 p.m.\nEmergency officials are still assessing the devastation wrought by Hurricane Helene in western North Carolina.\nCatastrophic flooding and widespread power, cell service, and internet outages have cut off much of the region from needed resources. State and local agencies are mobilizing to provide support to the area’s more than 1 million residents.\nSeveral Piedmont organizations are getting involved in relief efforts. Click here for a running list of ways to help.\nUpdated 9/30 12:47 p.m.\nThe Todd Volunteer Fire Department is offering water and internet access to residents in need following the catastrophic impacts of Hurricane Helene.\nAccording to a social media post, the department also has chargers for phones and car batteries. Visitors will be able to take a hot shower there as well.\nThe department is located on the border of Watauga and Ashe counties. It is accepting donations of baby care supplies, adult diapers, feminine care products and dog food.\nUpdated 9/29 6:34 p.m.\nAccording to the Associated Press, Buncombe County, which includes the mountain city of Asheville, is reporting 30 people killed due to the storm. This pushes the overall death toll to at least 84 people across several states.\nSupplies were being airlifted to the region around Asheville. Buncombe County Manager Avril Pinder pledged that she would have food and water into the city — which is known for its arts, culture and natural attractions — by Monday.\n“We hear you. We need food and we need water,” Pinder said on a Sunday call with reporters. “My staff has been making every request possible to the state for support and we’ve been working with every single organization that has reached out. What I promise you is that we are very close.”\nUpdated 9/29 3:44 p.m.\nEleven people in North Carolina have died so far due to the effects of Hurricane Helene. That’s according to Governor Roy Cooper. During a Sunday press conference, he said he expects that number to rise.\nCooper said mass feeding sites have been opened in the western North Carolina area as supplies are being airlifted into Asheville. A 20-bed state medical support center opened on Sunday in Caldwell County.\nHe added more than 100 people have been rescued so far by the North Carolina National Guard.\nCooper urged residents to avoid travel in western North Carolina.\n\"Please stay off western North Carolina roads so that emergency responders, utility crews and desperately needed supplies can get through,\" Cooper said. \"We don’t need people visiting western North Carolina viewing the damage.\"\nDuring a press call hosted by the Federal Emergency Management Agency on Sunday, a federal Department of Transportation official estimated there are about 300 secondary road closures in western North Carolina caused by Hurricane Helene. I-40 is closed in four areas and U.S. 64 remains closed as well.\nAn official with the National Oceanic and Atmospheric Administration said Busick Raws in Yancey County recorded 37 inches of rainfall. Boone received 20 inches.\nNo more heavy rainfall is expected in North Carolina over the next few days, and is expected to stop entirely by Tuesday.\nUpdated 9/29 12:24 p.m.\nThe town of Boone has shared a letter from Mayor Tim Futrelle and Watauga County Emergency Services recently sent out guidelines for citizens on protocol for debris removal.\nUpdated 9/28 7:08 p.m.\nAdverse Weather Condition 3 (Closure) in effect through 5pm Oct 4. Res halls, dining and campus medical facilities remain operational for on-campus students. If immediate danger, call 911. Students, faculty & staff needing shelter call 1-800-RED-CROSS https://t.co/sQ9fTLsUeA\n— Appalachian State (@appstate) September 28, 2024\nUpdated 9/28 6:37 p.m.\nFloodwaters pushed by remnants of Hurricane Helene have left North Carolina’s largest mountain city isolated by damaged roads and a lack of power and cellphone service. It was part of a swath of destruction across southern Appalachia that left an unknown number dead and worried relatives unable to reach loved ones. The storm spread misery across western North Carolina and eastern Tennessee, where on Friday authorities used helicopters to rescue dozens of people from the rooftop of a flooded hospital. In North Carolina alone, more than 400 roads remained closed on Saturday as floodwaters began to recede and reveal the extent of damage.\nUpdated 9/28 11:51 a.m.\nThe town of Boone was hit hard by the remnants of Tropical Storm Helene which dumped more than a foot of rain across much of the western part of the state. Soil that was already saturated gave way to falling trees across the region causing power outages in Boone that impacted nearly 80 percent of its residents. And the massive flooding that ensued turned major roads into fast-flowing rivers. Saturday’s scheduled football game between App State and Liberty has been canceled due to the storm’s aftermath.\nBoone Mayor Tim Futrelle says he’s thankful that there has been no loss of life there due to the storm, and he credits the close collaboration with local, state and national emergency officials for having saved lives. He says the water began receding late Friday afternoon enabling crews to better assess the extreme damage done by the storm.\n“Highway 105, Highway 321, those are two of our main arteries that are flooded out, and we're experiencing a lot of congestion and debris there from trees falling and water damage, landslide runoff. For example, we've got a whole shopping center — our Walmart shopping center — that whole area there has flooded out, and Walmart will probably be recuperating for a little while there unfortunately. Downtown was also hit hard. [I] never thought I'd see a river running down King Street, but unfortunately, that is exactly what we saw yesterday in the early part of the day. And just thinking a lot about our small business owners and our folks that are the backbone of our community that help keep us thriving. We're going to need a lot of help to support them as well to recover and rebuild.”\nUpdated 9/28 10:25 a.m.\nAs of this morning, over 400 roads remain closed in NC. All roads in Western NC should be considered closed.\nRemember: As crews work to clear and inspect roads and bridges, please give them room.\nGo to https://t.co/AGDVnBcrXk for the latest road information. pic.twitter.com/0XkeU3HErA\n— NCDOT (@NCDOT) September 28, 2024\nUpdated 9/27, 4:37 p.m.\nA tree fell and knocked over a large awning at a gas station in downtown Winston-Salem this morning.\nWinston-Salem police confirmed the incident occurred at the BP station at the corner of Broad and Fifth Streets. That’s a block from the Forsyth County Central Library. A delivery driver sustained a minor injury from being grazed by a tree limb during the incident.\nA photo of the damage was widely circulated as people monitored the impact of Tropical Storm Helene.\nUpdated 9/27, 2:45 p.m.\nOfficials in Rutherford County are watching Lake Lure Dam because water overtopped the entire length of the dam.\nThere is some erosion on one side of the dam caused by the overtopping, state Department of Environmental Quality spokesperson Kat Russell said Friday.\nTown officials are monitoring the erosion, she said.\nThe lake, which flows into the Broad River, was created nearly 100 years ago. The dam is listed as 480 feet (146 meters) long and about 120 feet (36.6 meters) high.\nThe dam is “doing what it’s supposed to do, but the water levels are just too high,” Russell said.\nDownstream communities have been made aware of the overtopping but have been told they would have several hours to alert residents to their own evacuations if needed, Russell said.\nIn the High Country, major waterways in the area are at flood-stage level.\nThe U.S. Geological Survey reports that the South Fork of the New River near Jefferson is at 15 feet, which is near major flood level. The Yadkin River at Elkin is at 24 feet, which is flood level there.\nWidespread flooding is reported throughout Boone and evacuations are taking place, police say.\nThe town is under a boil water advisory following a water main break that dropped the water pressure areawide, town officials say. Customers should boil water for any human use including drinking, making ice, washing dishes and food preparation.\nIn Buncombe County, roads were washed out preventing first responders from making it to some calls, Buncombe County Assistant Emergency Services Director Ryan Cole said.\nThat included a mudslide that involved four homes and left an undetermined number of people unaccounted for, Cole said.\n“This is the most significant natural disaster that anyone of us has ever seen in western North Carolina,” Cole said.\nForecasters were comparing it to the benchmark flood of 1916 which killed 80 people, damaged dozens of miles of railroad tracks and isolated Asheville and other mountain cities for days.\nSeveral rivers were above or near record crests and floodwaters were not expected to recede until at least Monday.\nIn Biltmore Village, just outside the famous Biltmore mansion, swiftly moving water from the overflowing Swannanoa River reached above the hoods of vehicles. It was a scene emergency officials expected in many other places as all the rain that fell has to flow downhill to the sea.\n“It’s terrible. I don’t know if I will ever see anything like this again,” said Spencer Tate Andrews who came down to the area to see the flooding. “Glad I got to see it but at the same time its terrible and its going to affect a lot of people and businesses.”\nUpdated 9/27, 1:30 p.m.\nGovernor Roy Cooper says Hurricane Helene caused the deaths of two North Carolina residents earlier today.\nAt a press conference this morning, the governor said one person died in a collision on a flooded roadway in Catawba County. Another was killed after a tree fell on a Charlotte home.\nCooper said more than 100 swift-water rescues had occurred as Helene's rains caused massive flooding Friday, particularly in the state's western section. He said flash floods are threatening lives and are creating numerous landslides.\n“The priority now is saving lives,” Cooper said, begging people to stay off the roads unless they were seeking higher ground. “With the rain that they already had been experiencing before Helene’s arrival, this is one of the worst storms in modern history for parts of western North Carolina,” Cooper said.\nThe storm has now been blamed for at least 18 deaths in Georgia, Florida, and the Carolinas.\nGeorgia Gov. Brian Kemp said Friday that at least 11 people in his state have been killed and dozens are still trapped in homes damaged by Helene.\nGov. Ron DeSantis confirmed two deaths in Florida. One person was hit by a falling sign in Tampa's Ybor City neighborhood and another was killed when a tree fell onto a home in Dixie County.\nSouth Carolina officials confirmed that two people were killed when trees fell on their homes in Anderson County, South Carolina.\nUpdated 9/27, 1:05 p.m.\nAppalachian State's home football game against Liberty in Boone scheduled for Saturday was canceled because of the impacts of severe weather on the area from Tropical Storm Helene, the school announced Friday.\nHeavy rains in the North Carolina mountains brought flooding to Boone and the town was placed under a state of emergency Thursday.\nThe nonconference game was scheduled for a 3:30 p.m. EDT kickoff and will not be rescheduled, the school said.\nApp State also canceled a home field hockey game against Bellarmine that was slated for Friday.\nUpdated 9/27, 1:03 p.m.\nThe National Weather Service has issued a flash flood warning for Ashe, Alleghany, Watauga, and Wilkes counties urging people in low-lying areas — including Appalachian State University — to seek higher ground.\nThe weather service describes the current situation as extremely dangerous and life-threatening.\nPeople should not travel unless moving to safer ground.\nWatauga Emergency Services is urging residents to be patient as many roads are impassable and power is offline in most areas. They say 9-1-1 in Watauga County should only be used for imminent threat to life situations. Delays are expected.\nAccording to U.S. Geological Survey data, the Yadkin River at Elkin is already at flood-stage level.\nUpdated 9/27, 1:02 p.m.\nThe North Carolina Department of Transportation says all roads in Western North Carolina are now closed.\n🚨 All roads in Western NC should be considered closed 🚨\nDo not travel unless an emergency or seeking higher ground\nDo not drive through standing water\nRespect barricades and road closures#TurnAroundDontDrown #Helene #ncwx pic.twitter.com/gjfrZJBPHm— NCDOT (@NCDOT) September 27, 2024\nUpdated 9/27, 12:48 p.m.\nIn a briefing Friday morning, Gov. Roy Cooper told residents of Western North Carolina not to travel.\nThe state has four FEMA search and rescue teams with a request for more support submitted.\nThe National Guard has deployed more than 380 members to help with emergency management.\nTeams from other states, including New York, Illinois, Indiana and Delaware, traveled to North Carolina to help with the effort.\nBlue Ridge Public Radio asked the Governor about the challenges of 911 calls in Western North Carolina that are not receiving responses.\n\"We know the people in Western North Carolina, some of them are facing great danger from the flooding at this point, and emergency responders can sometimes be prohibited from going into places because of the danger themselves,\" Cooper said.\nState Emergency Management Director Will Ray said there is degradation of cell service in Western North Carolina.\nSome 911 centers are beginning to initiate fallback plans to allow unaffected centers to receive calls from impacted areas, he said.\n-Copyright Blue Ridge Public Radio 2024\nUpdated 9/27, 12:42 p.m.\nA landslide has been reported in Asheville, prompting road closures.\nAll lanes of I-40 at Old Fort Mountain east of Ridgecrest are closed due to a landslide\n— Buncombe County Gov (@buncombeGov) September 27, 2024\nUpdated 9/27, 11:37 a.m.\nHigh winds and heavy rains are battering the North Carolina mountains including the High Country.\nDavid Long has lived in the Boone area for more than 60 years. He says the current conditions remind him of those from Hurricane Hugo 35 years ago — and are probably worse.\nHe says the creeks have already overflowed and the sustained winds are more than 20 miles per hour with gusts even higher.\n“It’s a combination of the torrential rain and the wind — it’s just a one-two punch that’s just really killing us,” says Long.\nLong says the storm has created a community of hunkered-down folks taking care of one another for now.\nThe ground in the Blowing Rock area was already soaked due to previous rains even before the storm moved in, creating risks for falling trees. The National Weather Service is also warning mountain residents about the increased risk of landslides. Two people died in a mudslide during severe weather in Watauga County in 2018.\nUpdated 9/27, 10:01 a.m.\nPower outages continue to sweep across western N.C. Currently just over 45% of Watauga County residents are without electricity. In Ashe County, 66% are without power, 54% in Caldwell County, and nearly 40% in Alleghany County.\nUpdated 9/27, 8:15 a.m.\nThe National Weather Service has issued a tornado watch until 6 p.m. Friday for Alamance, Davidson, Guilford and Forsyth counties. Other central N.C. counties under watch include Durham, Chatham and Orange counties.\nUpdated 9/27, 7:45 a.m.\nThe National Weather Service says Tropical Storm Helene is causing life-threatening flash flooding in North Carolina mountain counties.\nThe storm made landfall Thursday night in northwest Florida as a category 4 hurricane. It then made its way up through Georgia as a tropical storm with sustained winds of 70 miles per hour.\nIn North Carolina, more than 360,000 customers are without power, according to Ready NC.\nThe National Weather Service says people in the mountains can expect rain reaching an inch or two per hour. Many areas have already received up to 10 inches.\nSignificant life-threatening flooding is occurring, including homes and businesses. The weather service says the risk of dangerous landslides is increasing.\nThe North Carolina Department of Transportation warns that dangerous conditions exist on roadways, particularly west of Interstate 77. The agency urges drivers that have to be on the road to slow down and not drive through standing water or around barricades.\nUpdated 9/26, 9:15 p.m.\nThe National Weather Service (NWS) in Raleigh held a press conference late Thursday afternoon. NWS says the main hazards and impacts for central North Carolina will be from flash flooding, downed trees and power outages. They estimate the worst of the weather will move through central N.C. between sunrise Friday through about 2-3 p.m. Friday.\nThe rain band that is expected to move across the state, particularly during the morning hours Friday, may produce several tornadoes. An isolated tornado can’t be ruled out Thursday evening, but the main tornado threat will still be Friday morning.\nRiver flooding of moderate and higher potential should be mainly confined to main stem rivers west of the Yadkin River basin, with minor river flooding possible east of the Yadkin River basin.\nAccording to Ready NC, Iredell County has just over 3,700 power outages and Guilford County has nearly 3,000.\nFlood warnings are in effect for Alleghany and Wilkes counties until 8:45 p.m. Friday.\nUpdated 9/26, 2:30 p.m.\nLocal school districts in the Piedmont and High Country are closing as Hurricane Helene moves through North Carolina.\nWatauga County Schools announced plans to close Thursday and Friday due to flooding, road closures and additional predicted heavy rainfall. The district says the Friday closure will be made up later in the school year.\nIn the Triad, Winston-Salem/Forsyth County Schools and Guilford County Schools both announced they would be closed on Friday too. WS/FCS officials say that all extracurricular activities will be canceled as well in order for staff to assess facility conditions.\nSurry County and Davie County Schools opted to make Friday a remote learning day. Students should check online for assignments and other communications from their teachers.\nState officials say Helene could create treacherous travel conditions and power outages in the mountains and much of the Piedmont.\nUpdated 9/26, 2:00 p.m.\nWhile Hurricane Helene is expected to weaken as it moves inland after making landfall Thursday evening, forecasters say damaging winds are expected to extend to the southern Appalachian Mountains, where landslides are possible.\nThe National Weather Service posted lesser tropical storm warnings as far north as North Carolina and warned that much of the region could experience prolonged power outages and flooding.\nBased on the anticipated heavy rainfall, flooding, and strong winds, as well as the projected course of the storm over the next several days, closures began yesterday afternoon of large sections of the Blue Ridge Parkway. They extend from milepost 217 to 469.\nState officials are encouraging people to postpone unnecessary travel during the storm. You’ll find real-time road conditions at DriveNC.gov.\nUpdated 9/26, 9:30 a.m.\nThe National Weather Service is warning of significant impacts of Hurricane Helene on North Carolina mountain counties.\nThe hurricane is expected to make landfall over the Florida panhandle Thursday night then make its way north through Georgia and western North Carolina.\nA tropical storm warning has been issued for most of the mountain counties as far northeast as Yancey and Avery. The weather service says potentially catastrophic flash flooding and river flooding is expected later today and into Friday.\nWind gusts could reach more than 50 miles per hour, and combined with saturated soils will likely lead to numerous downed trees. As a result, power outages are possible. Weather conditions may also lead to brief isolated tornadoes.\nA flood watch is already in effect and extends to Ashe, Alleghany, Watauga and Wilkes counties.",
  "word_count": 7478,
  "scraped_at": "2026-02-14T13:31:46.286028"
}