{
  "article_id": "2b6a6e24449b",
  "url": "https://www.uefa.com/womensfinalissima/news/027f-17a9a9e8432b-62a6780368c3-1000--toone-we-can-t-wait/",
  "title": "England Ella Toone on Women Finalissima :  We cant wait for it  ",
  "date": "20230331T103000Z",
  "domain": "uefa.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "England's Ella Toone on Women's Finalissima: 'We can't wait for it'\nThursday, April 6, 2023\nArticle summary\n\"Every time we step out at Wembley, it's a massive honour for us,\" says the England forward as her side prepare to take on South American counterparts Brazil.\nArticle top media content\nArticle body\nEuropean champions England take on South American counterparts Brazil in the first-ever Women's Finalissima, and Ella Toone cannot wait to be back in a sold-out Wembley Stadium on Thursday 6 April.\nThe 23-year-old scored the opener in the 2-1 UEFA Women's EURO final win against Germany last summer, and as England prepare for another full house at Wembley, the Manchester United forward tells UEFA.com what it means to be back on the biggest stage.\nOn the Women's Finalissima\nEvery time we step out at Wembley, it's a massive honour for us. It's going to be an exciting game and we can't wait for it.\nWe want women's football to keep growing and a big part of that is the fans that we get at games. Obviously, [off] the back of the [UEFA Women's] EURO, you've seen crowds coming into WSL games which have been unbelievable. Every week they're growing in numbers and it's really nice that we've taken it from the international stage back to domestic football. For us, we just want to keep improving that and keep getting as many people as we can watching the women's game.\nOn Women's Finalissima opponents Brazil\nIt's going to be a big game. Every game England plays, everyone wants to beat us. That's just the target we've put on ourselves and we thrive off that. Every game, we know that we can't just go into it thinking that we're going to win because every country has unbelievable players and plays [a] different style of football that sometimes challenges us as a team.\n[Brazil forward Marta is] unbelievable, and for a lot of us, she's been an icon in women's football. Growing up, she was one of the players that you heard [about] and that you knew about. She's been an unbelievable player and she still is, so it'll be really exciting for us to step out on to the pitch with her.\nOn the Women's EURO final\nI look back on it quite a lot because it was probably the best day of my career so far. I like to look back [at] videos, look back [at] pictures, and just remember how I felt in that moment. It was the best day ever for me.\nWhen Chloe [Kelly put the winning goal] in the back of the net, what a feeling! The stadium erupted but we knew we had to focus for the last part of the game. And then, the final whistle went, and I felt every single emotion you could possibly think of. I screamed, I cried, I was so proud; honestly, just every emotion you could think of. It was just like: 'Wow, we've done it!' I don't think I'll ever feel like that ever again.\nOn this summer's World Cup\nThe main thing for us, as a team, is that we go out there, we play exciting football, we enjoy ourselves and we make the nation proud. Making the nation proud is what we did in the EURO, and we want to inspire the next generation of young girls to get involved in football. The World Cup will be massive for that and a massive part of our journey growing the women's game.",
  "word_count": 586,
  "scraped_at": "2026-02-14T12:24:52.067015"
}