{
  "article_id": "2b7023545f62",
  "url": "https://www.heraldscotland.com/news/23992808.spotlight-reason-behind-joey-bartons-sexist-rants/",
  "title": "Spotlight : The reason behind Joey Barton sexist rants",
  "date": "20231217T063000Z",
  "domain": "heraldscotland.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "When Joey Barton arrived at Rangers for a stint in Scottish football, there were suggestions of him being too big for the league.\nAn established star in the English top flight, he’d played for teams such as Manchester City and Newcastle and had just finished a season as the standout star for Burnley as they won promotion back to the Premier league.\nKnown as a skilful and competitive midfielder who been tried and tested against the best, his signing was seen as a coup and confirmation that the Scottish league could still attract top talent.\nChief among those bigging Barton up was Joey Barton. Never backward about being forward, the newly arrived ‘Gers man was quick to dismiss the other teams in the league and Scottish football in general.\nAmong those catching his eye was Celtic Captain Scott Brown, a man not known to shy out of a challenge.\nMatch-ups between the pair were highly anticipated – and here’s what Barton had to say: “People keep talking about Joey Barton and Scott Brown. He ain't in my league. He is nowhere the level I am as a player.”\nAnd he was entirely correct. Scott Brown wasn’t in Barton’s league – he was in one several echelons above it.\nScott Brown meets Joey Barton. Celtic would win this game 5-1\nBarton would depart Rangers having barely made a ripple in the Scottish game, playing just a handful of times, scoring no goals and making headlines mostly for the training ground bust-up which led to his contract being torn up early.\nScott Brown, a serial winner in his time at Celtic, kept on winning, leading his side to a league-and-both-cups treble the same year.\nScottish football has rarely given Barton a backward glance, except as a wry lesson about the pitfalls of hype.\nREAD MORE: When will the message on gender violence sink in?\nBut now the former footballer, whose career was littered with red cards, broken relationships with team-mates, assault charges and behavioural therapy sessions, is back in the news.\nAnd it’s not Scottish football he’s taking aim at, it’s the women’s game, and how it is reported.\nTwiddling his thumbs since his sacking from the manager’s job at Bristol Rovers, Barton’s opening salvo was that he’d had enough of women presenters in football shows.\nIt was the smallest thing which set him off – a 14-second segment ahead of Manchester City’s Champion’s League game with RB Leipzig, presented by a young woman vlogger.\nUnable to contain his ire, Barton took to social media to say: “I mean look at the nonsense. You give them a f***ing inch… Was going to use the hashtag #Getthemout but no doubt it will be taken out of context… \"\n\"You can't be there to fit this woke agenda.\"\n— Piers Morgan Uncensored (@PiersUncensored) December 7, 2023\nJoey Barton doubles down on his view that women shouldn't commentate on men's football on Piers Morgan Uncensored.@Joey7Barton | @piersmorgan | @TalkTV | #PMU pic.twitter.com/hvk9SJPvbz\nHe proceeded to post another message to highlight his view that women are not being given jobs in men's football on merit, adding: “Of course loads of ex-top players can’t get a gig because the TV Companies have quotas to fill and boxes to tick.\n“Their experience thrown on the landfill to accommodate the ‘Woke’. Only way they will change if it hits them in the pocket.\n“That only Happens When the men decide to switch off. Millions mute the TV’s and that’s for some of the Men.\n“TV must be going out the window if you get a double dose of XX on the comms team for your next big match.”\nAnd that was just the start of it. Soon the former footballer - who also declared he is retired from the ‘men’s game’ - was fighting with all comers online, not so much doubling down as quadrupling exponentially.\nWhether it’s been a long-held belief nurtured in secret, or an epiphany reached somehow after hearing one too many female voices, Barton was apoplectic and unapologetic.\nBeINSports presenter Carrie Brown tried to show him the impact his comments were having, saying: 'If I had my life again, I wouldn’t work so hard in being taken seriously in football.\n'It has sucked the joy out of the human I am. The way of dealing with him sums it up. Snide, sniggering teenagers who have no life skills. Bored.'\nDear Carrie,\n— Joey Barton (@Joey7Barton) December 11, 2023\nas much as I respect your opinion and I definitely appreciate the feedback.\nThe feeling is mutual. It’s a cesspool of corruption over in Men’s Football. Paedophiles in @FA academy’s and everything. I want no part of it as it stands.\nI’m out. Gone. Retired from… https://t.co/FkZp87Gujf\nBut this drew no sympathy from Barton, who criticised her for not just her job, but her looks as well.\nHe said: “Dear Carrie, as much as I respect your opinion and I definitely appreciate the feedback. The feeling is mutual. It’s a cesspool of corruption over in Men’s Football.\n‘You only have had to have played in the last 20 years to understand that. Look, I don’t expect you to. That’s not because of the big t*** and the dyed blonde hair and makeup.’\nNext in the firing line was Alex Scott, the decorated former England international and presenter of BBC Sport’s coverage of the Women’s Super League.\nIn an appearance on Piers Morgan Uncensored on TalkTV, Barton said “She hasn’t played in it [the men’s game],” said Barton. “One is 200 years old and one is about 40 years old… It’s the same rules but football is about a lot more than rules… The games are at two different speeds.”\nThis was all too much for Scott, who won 140 caps for England and has become one of the highest-profile stars in the women’s game.\nAlex Scott\nAfter presenting live coverage of the Women’s Super League clash between Arsenal and Chelsea on Sunday afternoon – which was played in front of a WSL-record crowd of 59,042 at the Emirates Stadium – She took the opportunity to slyly hit back at Barton’s comments and deliver a heartfelt message to women in football.\n\"Just before we say goodbye,\" said Scott, after Arsenal had prevailed 4-1. \"To all the women in football, in front of the camera or behind it, the players on the pitch, to everyone that attends games - keep being the role models that you continue to be.\n“To all those young girls that are told 'no you can't', football is a better place with us all in it. Goodbye.\"\nREAD MORE: Spotlight - poll predicts second coming of Donald Trump\nHer response drew plaudits across the media and beyond, but it’s clear Barton’s words have stung all those involved in women’s football, on the pitch and off it.\nIn dank corners of the internet where misogyny, inadequacy, incels and Andrew Tate jostle together in a toxic, fetid broth, there’s paradoxically fertile ground to be found if you’ve something bad to say about women, and sadly Barton’s comments will have found an audience.\nPerhaps that’s what he was looking for, as he’s soon to launch a new podcast talking about football. He’s invited Alex Scott to be the first guest.\nBut it’s more likely she’ll keep doing her talking on the pitch side.",
  "word_count": 1225,
  "scraped_at": "2026-02-14T12:22:11.750841"
}