{
  "article_id": "2b74204e64b4",
  "url": "https://www.sparksunderland.com/2023/03/03/safc-women-coaches-mel-reay-and-steph-libbey-visit-youngsters-for-brilliant-coaching-session/",
  "title": "SAFC Women coaches Mel Reay and Steph Libbey visit youngsters for … – Spark Sunderland",
  "date": "20230304T024500Z",
  "domain": "sparksunderland.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "SAFC Women coaches Mel Reay and Steph Libbey visit youngsters for “brilliant” coaching session\nWritten by Nathan Bell on 3rd March 2023\nSunderland Regional Talent Club’s U11 and U12s were treated on Monday night when SAFC Women coaches Mel Reay and Steph Libbey gave them a “brilliant” coaching session.\nhttps://twitter.com/SunderlandRTC/status/1630314778554953734?s=20\nOwing to the success of guest speakers and coaches across the board including the Foundation of Light Scholars getting to see Jamie Chandler’s expertise, the young girls were given the chance to learn from the best to give them every chance for the future.\nSteph Libbey told Spark: “We’ve been over and coached the Under-16s a couple of weeks ago too and we said that we know the importance of the pathway and how successful it’s been and that they see the clear progression to us which has always been there.\n“On a personal level, they get to know us and we get to know them really and see some of the talent that’s coming through earlier than we normally would.\n“We speak to the coaches about the players and get a feel for the environment.\n“We know that we’ve got a strong production line into England youth teams and also into the Championship and WSL and we just wanted to see it for ourselves.\n“The players were really enthusiastic. There was a great energy and some fantastic technicians to watch for the future.”\nAround 30 regional talent clubs were set up across the country as part of The FA’s plan to give girls between seven and 17 a pathway into professional women’s football, with the end goal to produce footballers talented enough to represent the Lionesses.\nSunderland RTC is among the best in the country with a tier one rating, putting them toe to toe with the likes of Manchester City and Liverpool. For more information on the programme, see their website linked.",
  "word_count": 314,
  "scraped_at": "2026-02-14T13:03:17.159289"
}