{
  "article_id": "2ba9a80ab948",
  "url": "https://www.the42.ie/wsl-irish-players-6179182-Sep2023/",
  "title": "13 Ireland internationals involved as the Women Super League returns",
  "date": "20230930T081500Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "THE FA WOMEN’S Super League [WSL] returns tomorrow, with 13 Republic of Ireland internationals involved.\nChelsea are the reigning champions, Emma Hayes’ side gearing up for a five in-a-row bid. Katie McCabe’s Arsenal, Aoife Mannion’s Manchester United and Manchester City have been their nearest challengers of late, with Aston Villa another coming side.\nMcCabe’s Gunners and Liverpool go head-to-head on opening day at the Emirates Stadium, but injured duo Niamh Fahey and Leanne Kiernan won’t feature for the Reds.\nThe 13 Irish players — the same amount as last year, but several of the Class of 2022/23 have moved on – are spread across six clubs: Arsenal (1), United (1), Liverpool (2), Bristol City (2), Everton (3) and West Ham (4).\nAll 13 are internationals, though Mannion, Kiernan, Megan Campbell, Jess Ziu and Jessie Stapleton missed out on this summer’s World Cup squad. That quintet, along with Fahey, were also absent for the recent Nations League double-header against Northern Ireland and Hungary due to injury.\nIt’s been a whirlwind few weeks, with the club season in full swing again. McCabe spoke about the women’s football calendar needing a rethink over the international break.\n“Something needs to be done,” she told the Irish media. “Hopefully Fifa and Uefa have a look at that and look to review it, players will get burnt out, whether it be now or in a few months time.\n“We don’t want that, we want the top players around Europe and the UK to be performing at the highest level, to be making fans happy, scoring goals, so hopefully that can be looked into for sure.”\nHere’s a look at the 13 Irish players gearing up for the 2023/24 season, and tomorrow’s list of fixtures:\nArsenal\nKatie McCabe\nIreland’s captain and most familiar face. The Ballon d’Or nominee and world-class left-sided star is a fan favourite at Arsenal, having been at the club since 2015. Committed her future with a new deal yesterday, massive boost for the North London outfit. Jonas Eidevall’s side will be targeting WSL glory after a busy transfer window and premature Champions League exit.\nBristol City\nMegan Connolly\nConnolly is one of several Irish internationals captaining their club. Joined the WSL newcomers during the summer after a successful spell at Brighton & Hove Albion and will make her impact felt immediately as skipper. A nailed on starter for Ireland, best utilised in a defensive midfield role and dangerous from set-pieces.\nChloe Mustaki\nA new contract was a show of faith from Bristol after injury hampered her first season at the club. Mustaki did start and finish their Championship-winning campaign brightly, and will work hard to establish herself as a first-choice defender in the top-flight. A squad player for Ireland in recent times.\nEverton\nCourtney Brosnan\nIreland’s number one had her Everton contract extended before the World Cup. Will again go head-to-head with England’s Emily Ramsey to be first-choice goalkeeper, but has well and truly proven her worth in recent times. A solid shot-stopper continually growing in confidence.\nMegan Campbell\nSwapped the red side of Liverpool for the blue by signing for the Toffees yesterday, important that she’s staying in the WSL. Generally deployed at centre-half or left-back, an excellent player when fully fit and firing but the 30-year-old has serious injury woes through the years. Her long-throw will be a huge weapon for Everton.\nHeather Payne\nPayne is back in the WSL, having previously had a short stint with Bristol City in 2018/19. She headed for Florida State University thereafter, where she excelled, but it will be interesting to see the electric, versatile star closer to home once more. From lone striker to right wing-back, Payne has been a key player for Ireland in recent years.\nLiverpool\nNiamh Fahey\nThe Liverpool captain will miss the start of the season after a recurring calf injury in pre-season. The 35-year-old centre-half shook it off to star for Ireland at the World Cup, but missed the recent Nations League double-header clashes. An incredible leader and solid defender, hugely influential for both club and country.\nLeanne Kiernan\nKiernan has been haunted by injury of late, an ankle setback keeping her out of action for the next few weeks. Her WSL return and World Cup dream was derailed by a poor challenge on the opening day of last season and she’s struggled to fully return since. A top talent when fit; lively striker and proven goalscorer.\nManchester United\nAoife Mannion\nAnother whose World Cup hopes were ended due to injury after an impressive start to life in the green jersey. After recovering from a knee setback, the teak-tough centre-half missed Ireland’s recent games with a quad tear. Rewarded with a contract extension during the summer, will hope to nail down her place in the United XI upon her return.\nWest Ham\nIzzy Atkinson\nWill hope for more regular minutes in her second season at West Ham. Ireland’s World Cup bolter, having gone from the standby list for the extended squad to the final 23 and two substitute appearances. Lively left-sided player with an eye for goal, now part of a strong Irish contingent at the Hammers.\nJessie Stapleton\nOne of Ireland’s most promising young talents, the 18-year-old is getting her first taste of professional football having made the move from Shelbourne during the summer. Missed Ireland’s recent games with a quad injury and was overlooked for the World Cup, but has a huge future. First called up to a senior home-based training session at just 13. Just as comfortable at centre-half as centre-midfield, and a huge aerial threat.\nMegan Walsh\nA mainstay in the Ireland goalkeeping department alongside Brosnan and Grace Moloney, Walsh joined from Brighton & Hove Albion during the summer. Will challenge Australia World Cup star and new club captain Mackenzie Arnold for the number one shirt, with USA native Katelin Talbert also in the running. Assured ‘keeper.\nJess Ziu\nOn the comeback trail from an ACL injury sustained early on last season. Had been making a real case for herself with Ireland and the Hammers but gut-wrenchingly missed World Cup qualification and all that followed. The midfielder/wing-back will hope to return like a brand new signing.\nSunday’s WSL fixtures\n- Aston Villa v Manchester United, Villa Park, 12.30pm – live on BBC2\n- Everton v Brighton & Hove Albion, Walton Hall Park, 1pm – live on FA Player\n- Bristol City v Leicester City, Ashton Gate, 2pm – live on FA Player\n- Arsenal v Liverpool, Emirates Stadium, 2pm – live on FA Player\n- West Ham v Manchester City, Chigwell Construction Stadium, 3pm – live on FA Player\n- Chelsea v Tottenham, Stamford Bridge, 5.30pm – live on Sky Sports.",
  "word_count": 1116,
  "scraped_at": "2026-02-14T12:22:02.426781"
}