{
  "article_id": "2bfc1fbbfd2e",
  "url": "https://weaintgotnohistory.sbnation.com/chelsea-fc-women/2023/3/11/23635332/chelsea-fcw-vs-manchester-united-wfc-fa-wsl-preview-how-to-watch",
  "title": "Preview : Chelsea FCW vs . Manchester United WFC , FA WSL ; Preview , how to watch , and 3 things",
  "date": "20230312T000000Z",
  "domain": "weaintgotnohistory.sbnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Chelsea’s excellent March adventure continues with a massive top of the table meeting with Manchester United. The Red Devils currently sit at the top by a point but having played one game more. Chelsea’s game in hand makes the meeting a must not lose more than a must win, but given that their next WSL opponent will be Manchester City, three points would provide a comfortable buffer against current top goalscorer Bunny Shaw.\nChelsea FCW vs. Manchester United WFC, FA WSL; Preview, how to watch, and 3 things\nMARCH’S MADNESS CONTINUES\nUnited head coach Marc Skinner arrived in Manchester in 2021 after a pretty horrible spell with Orlando Pride in the NWSL. Skinner had talented squads but he failed to adjust to the league’s style of play and became a bit of joke in the process. However, his United squad are ultra talented and he’s succeeded in getting them to play fluid football.\nWith England’s stars of the Euros, Mary Earps, Ella Toone and Alessia Russo, they’re scoring lots of goals and not conceding many. In fact, they’re joint top with Chelsea in goals for (38) and are tied with Arsenal in fewest goals against (8).\nThough Chelsea have a very good record against United since they joined the WSL in 2019-20, this will be the most dangerous United side we will have met.\nDate / Time: Sunday, March 12, 2023, 12.30 GMT; 8:30am EST; 6:00pm IST\nVenue: Kingsmeadow, Kingston Upon Thames, UK\nReferee: Cheryl Foster\nForecast: 55°F/13°C; Cloudy\nOn TV: BBC Two (UK); CBS Sports Network (US)\nStreaming: BBC iPlayer (UK); None (US); The FA Player (everywhere else)\nThree things\nKey figures out — While there’s good news for Pernille Harder in that she’s back in training, she’s still some weeks away from returning to match action. Fran Kirby is in a similar situation after a second injection in her knee, which will require a couple weeks for swelling to subside before she can be reassessed. Also, head coach Emma Hayes has picked up an illness and is questionable to be on the sidelines for the match.\nMelly’s return — The 3-1 midweek win versus Brighton was Melanie Leupolz’s first start since giving birth. Leupolz slotted in at the holding midfield position and had a solid game, completing 88% of her passes and winning 60% of her duels according to Fotmob. The return of the midfielder will be a major boost. While it’s likely still too early to expect Leupolz in every XI, her quality can undeniably help a midfield that has shown a recent tendency to lose control of games.\nReady or not — With Harder and Kirby continuing to be out, Emma Hayes has probably had to rely on summer signing Jelena Čanković a lot more than she’d planned. Čanković is a supremely talented player with the skill to be a special part of Chelsea’s attack, but in an ideal timeline she’d be allowed to settle in. Unfortunately injuries haven’t allowed that, so her performances have been up and down. She’s inspired impressive post-match compilations, but was also subbed off after 40 minutes in the Conti Cup Final. Chelsea will need the former if we are to regain control of the title race.",
  "word_count": 536,
  "scraped_at": "2026-02-14T12:21:21.151665"
}