{
  "article_id": "2c2b0d32255e",
  "url": "https://www.thecable.ng/nff-why-weve-been-unable-to-pay-players-officials-for-months",
  "title": "NFF : Why weve been unable to pay players , officials for months",
  "date": "20230531T233000Z",
  "domain": "thecable.ng",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Nigerian Football Federation (NFF) has admitted that it owes outstanding wages of several months to some players and officials across levels of the national teams.\nAdemola Olajire, the NFF’s communications director, spoke about the financial challenges bedevilling the federation in a chat with BBC.\nOver the past months, there have been reports of NFF delaying the payment of wages for some officials and players, with both Jose Peseiro, Super Eagles head coach, and Randy Waldrum, Super Falcons head coach, included.\nWaldrum is reportedly owed more than $100,000, including bonuses from last year’s Women’s Africa Cup of Nations (WAFCON). Ladan Bosso, head coach of the Flying Eagles, is said to have only received three months’ salary in the past 15 months.\nAdvertisement\nSpeaking on the matter, Olajire said the unpaid wages are “not something to be proud of”.\nHe added that the federation is “facing huge financial challenges”.\nOlajire said the new board of the federation has started planning ways to mitigate the problem.\nAdvertisement\n“The NFF has been facing huge financial challenges, and there is an ongoing effort to resolve all the issues relating to unpaid wages,” the NFF spokesperson said.\n“It is unfortunately not something to be proud of, and the new board of the federation is working hard to resolve the problems.”\nThe NFF has a history of unpaid wages to players and officials of the Nigerian national teams.\nDuring the 2022 WAFCON, Super Falcons boycotted a training session ahead of their third-place match in protest of unpaid match bonuses.\nAdvertisement\nSimilarly, Gernot Rohr, former Super Eagles head coach, had to report the NFF to FIFA before the federation was ordered to pay nearly $400,000 in outstanding wages due to the Franco-German.",
  "word_count": 285,
  "scraped_at": "2026-02-14T12:01:02.993671"
}