{
  "article_id": "2c5f27f68f82",
  "url": "https://metro.co.uk/2025/09/28/nunos-influence-can-help-west-ham-gain-a-point-everton-first-match-since-sacking-graham-potter-24281719/",
  "title": "Premier League odds : Nuno Espírito Santo can help stop the rot at West Ham and claim point at Everton | Football",
  "date": "20250928T141500Z",
  "domain": "metro.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Isn’t it ironic that West Ham have sacked Graham Potter and replaced him with the guy who was the manager of the only team the Irons have beaten in six matches this season?\nThe 3-0 victory away to Nottingham Forest at the end of August signalled the end of Nuno Espirito Santo at the City Ground and he departed during the international break, to be replaced by Ange Postecoglou.\nPotter couldn’t build on that victory with defeats following at home to Tottenham and Crystal Palace and the West Ham board decided it was time that they too had to act.\nIt was unfair on former Brighton and Chelsea boss Potter that they waited until Saturday morning to announce the decision as it looks as though he was hung out to dry by having to hold a press conference on Friday when he was ruthlessly grilled about his position and the memes circulating on social media mocking his predicament at the London Stadium.\nThe Hammers were already in talks with the former Wolves and Tottenham manager and he was swiftly announced as their new manager ahead of the Monday night trip to Everton who are, of course, managed by David Moyes who has had two spells in charge of the East End club.\nThe switch in direction was needed, though, with five defeats in those half-dozen matches in all competitions and Potter had the summer to shape a side which had won just five times in 19 after he replaced Julen Lopetegui in January.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nPerhaps the board should have encouraged Moyes to stay, after all he led them to their first trophy in 43 years when they beat Fiorentina in the Europa Conference League final and they then progressed nicely in the Europa League in the seasons either side of that, even finishing ninth in the Premier League before he was allowed to leave.\nMoyes has since worked reasonably well in his second stint with the Toffees, who are currently mid-table with seven points to their credit following wins against Brighton and Wolves and a draw at home to Aston Villa before a decent effort against Liverpool in the 2-1 defeat at Anfield.\nIt’s a difficult match to call as the Hammers have regularly folded under pressure after conceding goals and are susceptible at set-pieces while Everton have struggled to convert chances but under 2.5 goals is 10/11 with bet365 and Betfred and the honeymoon period with the new boss can enable the Irons to snatch a point at 29/10 with Sporting Index and SpreadEx. A 1-1 draw is 13/2 with the four firms previously mentioned.\nCricket World Cup odds\nIt has already been an incredible year with England’s women teams carrying the sporting flag with sensational triumphs in football’s Euros and Rugby World Cup and there is every chance the success enjoyed by the Lionesses and Red Roses can be emulated in the Women’s Cricket World Cup in India and Sri Lanka which starts this week.\nOn paper it looks a straight choice between defending champions Australia, who have won the tournament seven times, and England – who were last victorious in an epic final with India in 2017 – and have won it four times.\nMore Trending\nEngland are worth an each-way wager at 11/2 with bet365 after beating India by 152 runs in a warm-up match in Bengaluru and captain Nat Sciver-Brunt is 9/1 with bet365 to be top tournament run-scorer and 7/4 to be the top England batter with the same firm after her brilliant 122 in that victory.\nAmerican Football odds\nNFL equals No Fun League for the New York Jets and Miami Dolphins, who are both seeking to avoid an 0-4 start to the season when they meet in Florida in a Monday Night Football outing which could be a shocker.\nUnder 44.5 total points is evens with Ladbrokes and Coral while a home win is a tentative 7/10 with BetMGM. The same firm offer 17/10 on Jets wide receiver Garrett Wilson scoring a touchdown at any time and 39/20 on Jaylen Waddle replying for the Dolphins.\nMORE: Eddie Nketiah reveals Arsenal messages after firing Crystal Palace to Liverpool win\nMORE: Man Utd ‘nice boy’ told to toughen up and be more ‘arrogant’ after Brentford loss\nMORE: Gareth Southgate on Man Utd’s three-man shortlist to replace Ruben Amorim",
  "word_count": 777,
  "scraped_at": "2026-02-14T12:59:45.090986"
}