{
  "article_id": "2c5f55ecb868",
  "url": "https://www.winnipegfreepress.com/uncategorized/2024/03/23/how-james-madison-methodically-built-an-athletic-powerhouse-that-is-having-a-march-madness-moment",
  "title": "How James Madison methodically built an athletic powerhouse that is having a March Madness moment – Winnipeg Free Press",
  "date": "20240323T221500Z",
  "domain": "winnipegfreepress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "How James Madison methodically built an athletic powerhouse that is having a March Madness moment\nAdvertisement\nNEW YORK (AP) — James Madison's moment in the college sports spotlight has been years in the making. The Dukes' NCAA Tournament victory over Wisconsin was not so much a singular event, but the continuation of a string of successes that dates back almost a decade.\nRead this article for free:\nor\nAlready have an account? Log in here »\nTo continue reading, please subscribe:\nMonthly Digital Subscription\n$1 per week for 24 weeks*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $4.00 plus GST every four weeks. After 24 weeks, price increases to the regular rate of $19.95 plus GST every four weeks. Offer available to new and qualified returning subscribers only. Cancel any time.\nMonthly Digital Subscription\n$4.99/week*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $19.95 plus GST every four weeks. Cancel any time.\nTo continue reading, please subscribe:\nAdd Free Press access to your Brandon Sun subscription for only an additional\n$1 for the first 4 weeks*\n*Your next subscription payment will increase by $1.00 and you will be charged $16.99 plus GST for four weeks. After four weeks, your payment will increase to $23.99 plus GST every four weeks.\nNEW YORK (AP) — James Madison's moment in the college sports spotlight has been years in the making. The Dukes' NCAA Tournament victory over Wisconsin was not so much a singular event, but the continuation of a string of successes that dates back almost a decade.\nRead unlimited articles for free today:\nor\nAlready have an account? Log in here »\nHey there, time traveller!\nThis article was published 23/03/2024 (693 days ago), so information in it may no longer be current.\nNEW YORK (AP) — James Madison’s moment in the college sports spotlight has been years in the making. The Dukes’ NCAA Tournament victory over Wisconsin was not so much a singular event, but the continuation of a string of successes that dates back almost a decade.\nA school that 17 years ago drew criticism for cutting 10 sports from its athletic department is now reaping the rewards of a broad, methodical plan to lift James Madison from a regional school in Virginia’s Shenandoah Valley to a national brand.\n“We’ve always had a vision in mind,” JMU athletic director Jeff Bourne said Saturday. “Where do you want to end up? What is it that athletics can do to help foster this growth of the institution?”\nJames Madison’s wire-to-wire win against Wisconsin earned the 12th-seeded Dukes a second-round matchup Sunday against fourth-seeded Duke at Barclays Center in Brooklyn.\n“Once I came there I thought it could be a place where we could get to a higher level,” fourth-year coach Mark Byington said. “The arena was almost being completed and I saw the success that all the athletic programs have and I thought, it hasn’t been done in basketball but the blueprint’s there.”\nBourne said basketball had been in need of a facilities upgrade for years, but the administration didn’t sign off on a project until it was able to build something more like what a recruit would find in the Atlantic Coast Conference than a mid-major league.\nJMU’s Atlantic Bank Union Center opened in 2020 and cost about $140 million. The 8,900-seat arena also houses the men’s and women’s basketball offices, academic center, weight room and practice courts.\n“Anybody who has been to JMU knows our facilities are very elite,” senior Terrence Edwards Jr. said. “As soon as you walk in the building, you just want to commit. We have everything that every high-major school has.”\nMen’s basketball is just the latest program to contribute to JMU’s trophy case.\nIn 2016, James Madison won an NCAA football championship in Division I’s second tier, known as the Championship Subdivision. Two years later the women’s lacrosse team won a national title and in 2021 the softball team reached the Women’s College World Series.\nJMU’s profile has risen to new heights this school year, with an 11-win football season at the highest level of D-I that served as a lead-in to the best season in the history of the men’s basketball program.\nThe Sun Belt champion Dukes (32-2) enter their matchup with the Blue Devils tied with No. 1 UConn for the most victories in the country.\n“The reason you’ve seen since (2015) this astronomical ascent is that we did all the hard work before that,” Bourne said. “It took 10 or 15 years of infrastructure building and putting the right people in the right spots to eventually get to a point to where we could capitalize on it.”\nBourne is about a month away from retirement after 25 years leading JMU athletics. The school will also be looking for a new president to replace Jonathan Alger, who has been named the next president at American University.\nA public school, James Madison’s enrollment has about doubled to 23,000 since Bourne was hired in 1999. When Bourne arrived, assistant coaches were still teaching to supplement their salaries.\nJames Madison now has an athletic budget of about $68 million, $53 million of which comes from student fees. According to Sportico, that’s the largest sum for any public school by a wide margin.\nBourne said a lack of standardization in the way student fees are reported to the NCAA by athletic departments, along with Virginia laws that require a high level of accountability, make those numbers “a little deceiving.”\n“If you were to take JMU and boil it down in comparative vision with a lot of other schools, our total budget’s not that far away from them because we report everything. Everything,” he said.\nJames Madison was founded in 1908 as women’s college. Men were first enrolled in the 1940s. JMU’s women’s basketball program is one of the oldest in the country, founded in 1920, and it ranks fourth among NCAA programs in victories behind Tennessee, UConn and Stanford.\nUnder Bourne, James Madison eliminated 10 sports in 2006 (seven men’s and three women’s) as it struggled to comply with federal Title IX regulations that mandate equal opportunities in education. At the time, the head of the U.S. Olympic Committee criticized JMU, saying it was using Title IX compliance as an excuse to cut teams and costs.\nEven then, James Madison was trying to build with the long term in mind.\n“We designed the football stadium in 2003 and 2004 to be a 40,000-seat stadium that would eventually house an FBS program. But we were so far away from that,” Bourne said.\nIn 2013, James Madison first studied making the move up to the Bowl Subdivision of Division I, but finally did so in 2022, joining the Sun Belt.\nThe Dukes were so well-prepared for FBS, they broke the NCAA rule book, which requires a two-year transition period before a school can be eligible to compete for a conference championship and play in a postseason game.\nThe Dukes have gone 19-5 in their first two seasons and played in the Armed Forces Bowl last year, losing to Air Force.\n“We saw what they were doing in football and thought they definitely could compete and compete at a very high level and were well-positioned to do so in the long run,” Sun Belt Commissioner Keith Gill said. “But we also saw their investments.”\nThe plan appears to be paying off for James Madison.\n___\nAP March Madness bracket: https://apnews.com/hub/ncaa-mens-bracket and coverage: https://apnews.com/hub/march-madness",
  "word_count": 1282,
  "scraped_at": "2026-02-14T14:09:33.113403"
}