{
  "article_id": "2c8402b9f56e",
  "url": "https://www.ajc.com/education/suffering-in-silence-male-college-students-less-likely-to-seek-counseling/XK4SIKMMRZEQXBBOFHOW2V4QNA/",
  "title": "Suffering in silence : Male college students less likely to seek counseling",
  "date": "20231216T114500Z",
  "domain": "ajc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Suffering in silence: Male college students less likely to seek counseling\nWhen Vernon Allwood helped open Morehouse College’s counseling center 35 years ago, he had to convince students to talk about their problems.\n“Morehouse men didn’t need counseling,” he said wryly during a fall lecture at the historically Black men’s college in Atlanta.\nNow his son, Steven Allwood, is the director of counseling services. Though a growing number of Morehouse men are seeking support to treat depression, suicidal behaviors and other issues more severe than the homesickness and other struggles the elder Allwood typically saw, there’s a stigma that still persists.\n“Oftentimes, men are more reluctant to ask for help, and so they’ll sort of let a problem fester longer before they’ll seek help for it. It’s kind of like the last resort is to come to counseling,” Steven Allwood said.\nOnly 22.5% of male undergraduate students received psychological or mental health services over the course of a year, according to a spring 2023 American College Health Association survey of more than 55,000 respondents nationwide. That’s compared to 39.5% of female students and 63.3% of transgender and gender-nonconforming students.\nStatistics show the reluctance of some young men to seek help could be tragic. Nationally, 3.1% of male undergraduates surveyed indicated they had attempted suicide over a recent 12-month period, less than 5.6% of transgender students but more than 2.3% of women. Overall, men made up about 80% of the nation’s nearly 50,000 suicide deaths in 2022, most recently available data shows.\nCampus counseling centers across Georgia — from Georgia Tech to Kennesaw State and Emory universities — see far more women using their services. However, there aren’t many mental health services designed specifically for men on Georgia’s college campuses. Some schools are trying strategies — such as peer-mentoring programs and shorter-term, goal-focused coaching — that may resonate with male students hesitant to try traditional talk therapy.\nThe state and federal government in recent years have recognized mental health as an important issue on college campuses and committed more money for counselors and other resources. Gov. Brian Kemp allocated $6 million last year for more access to mental health resources and additional professional development opportunities for faculty for Georgia’s colleges and universities.\nChallenges, though, remain to providing care.\nMale students report lower rates of common mental health diagnoses such as anxiety and depression. But undergraduate men who have been diagnosed with a mental health condition were the group least likely to have sought help, the national survey showed. For example, 67% of college men with a depression diagnosis contacted a professional within the last year, compared to 78% of women.\nStudents and mental health providers said some men don’t pursue treatment because they perceive doing so as a sign of weakness or because they want to fix their own problems. Experts stress the importance of supporting the mental health of men while they’re young. Promoting healthy behaviors and intervening early when there are warning signs can prepare men to navigate life after college more successfully.\nThe idea is to engage men “where they are,” said James Raper, Emory University’s associate vice president for health, well-being, access and prevention.\n“That might mean getting a group of guys together and do some version of an activity that is around, let’s say mindfulness. It’s another way of getting at ... mental health, broadly defined, without it having to only look like … clinical services,” he said.\nAsking for help\nMen sometimes think they’re “being too dramatic” or their problems aren’t that big, said Vishrut Thaker, a 21-year-old senior studying neuroscience at Georgia State University.\n“Receiving mental health services (is) seen as way too much for them,” he said.\nThaker is the president and only man on the executive board of the Georgia State chapter of MannMukti, which spreads awareness of South Asian mental health issues.\nHe has made mental health advocacy a priority because a family member died by suicide. He’s also seen high school and college friends deal with issues that impact their ability to focus on school, family and personal relationships.\nMannMukti hosts wellness events, such as journaling, painting and guided meditation workshops. To set an inviting tone for men, the group has brought in male physicians as guest speakers and intentionally designed an event flyer for a November fashion show during a Diwali celebration that featured illustrations of both a woman and a man.\nThaker said he’s become more purposeful about reaching out to his guy friends. Every couple of weeks, he sends a text to their group chat and also messages friends individually to ask how they’re doing.\n“It’s up to us men to promote those wellness activities between our friend groups, and someone has to start it because if we don’t start it, then things will just continue, the stigma will continue and times will not change,” Thaker said.\nA student’s journey\nTaking a break from school proved to be the best option for one University of Georgia student dealing with mental health struggles.\nThe Atlanta Journal-Constitution agreed not to identify the 24-year-old, who said he’s concerned that a public discussion of his experience could jeopardize future employment opportunities. The AJC reached out to several campus counseling centers and student clubs to interview men. Some expressed apprehension about speaking to a reporter about their mental health.\nLast year, the UGA student withdrew from his first semester of law school and entered an in-patient treatment center to get help with depression, anxiety and substance use.\nThe decision to temporarily leave school was not easy, but he wasn’t keeping up with classes and was unable to get out of bed. When he spoke to school leaders, they helped him find treatment options and were candid about the required readmission steps once he was ready to return.\nHe’s now taking classes again and going to therapy.\nWhen he entered college, he didn’t immediately find a new therapist. Then, in the fall of 2020, many of his classes moved online amid the COVID-19 pandemic. Alone and feeling isolated, he resumed therapy and was diagnosed with an anxiety disorder, in addition to the depression he’d long dealt with.\n“You’re supposed to be self-sufficient and stoic and all those things. Having a diagnosis of any mental health disorder kind of rubs against that,” he said. “Even though I don’t agree with the idea, still in my mind there’s that small thought of, ‘Oh, this isn’t manly. This isn’t a very masculine thing to be, just to have any type of mental health struggle.’”\nPeer support and role models\nGetting more male college administrators to speak to students about mental health and campus resources could help destigmatize it for more men, he said.\nJust over 70% of college counseling directors are women, a number that’s steadily increased the last two decades, according to a 2022 survey from the Association for University and College Counseling Center Directors.\n“Most of the talk around mental health that comes from the school comes from women,” the UGA student said. “Having more men present the information could be helpful because then other men are able to look up and be like, ‘OK, that’s another guy. He’s dealing with this. It’s OK that I am too.’”\nThe counseling field has more work to do to meet the need for more Black male therapists and to train mental health providers in culturally competent practices so they understand the students they serve, said Derrick Brooms, executive director of the Black Men’s Research Institute at Morehouse.\n“Representation matters,” said Brooms, who wears rubber wristbands inscribed with the reminders “Black Lives Matter” and “Conscious, Competent and Committed.”\nOne promising strategy to combat stigma is to make star athletes the face of mental health campaigns. Seeing men with high social capital openly discuss their experiences may make a difference for other men on campus, said Lauren Beasley, a Georgia State University assistant professor who studies mental health and college athletics.\nUniversity of Georgia football coach Kirby Smart previously has discussed making space for players to get together in small groups to talk about their off-field lives during so-called “skull sessions.”\nFriends, roommates and classmates who speak about their mental health also can be a powerful tool.\nLuoluo Hong, Georgia Tech’s vice president for student engagement and well-being, is looking for more ways to match up younger students with upperclassmen so they realize others have shared similar challenges.\nGeorgia Tech, where two-thirds of students are male, is the only school within the University System of Georgia to enroll more men than women. Yet men comprised less than 45% of the one-on-one client visits at Georgia Tech’s mental health care center last year, according to Hong.\nWhile the school has hired more counselors in recent years, Hong believes a change in how students view success in a high-pressure, competitive academic culture is crucial. Prevention and outreach are key parts of a multi-year Georgia Tech plan to improve students’ well-being.\nCoaching and prevention\nEmory plans to hire well-being coaches by next fall.\nThat will benefit students who want to talk to someone but don’t have clinical needs, said Raper. For some men, working with a coach may feel like “less of a vulnerable experience” than going to counseling, he said.\nKhegan Meyers, president of Emory’s undergraduate student government association, said students needed help adjusting during the pandemic, and access to campus services has improved since then.\nMeyers, 21, a senior, said he appreciates efforts to prioritize prevention and mindfulness.\n“I think the conversation around mental health has definitely evolved, and I think we need to have more explicit conversation about men’s mental health,” he said.\nReaching men at Morehouse\nAt Morehouse, Steven Allwood is always looking for ways to reach men.\nDuring an October talk in which he and his father were guest lecturers, students wanted to know how to get help for someone in crisis and how to check on a friend when those conversations feel awkward.\nThey asked if they need insurance to visit the counseling center. (They don’t. Services are provided at no cost as part of their school fees.)\nIndividual counseling, drop-in workshops and weekly meditation sessions are part of Allwood’s approach. Group therapy is not.\nThe school discontinued group therapy because of low participation. Allwood said it’s difficult for men to open up in that setting, especially on a small campus where it’s hard to remain anonymous.\nFor some men, depression may show up as anger and irritability — like getting into a fight or mouthing off to a professor — because that’s more socially acceptable than to express sadness or vulnerability, he said.\n“We’re seeing a lot more students who have severe depression, really significant anxiety disorders. I see a lot more PTSD than I expected in our student body,” he said.\nHe wants men to understand the advantage of receiving care while in college, where they can access campus services.\n“Most people struggle with mental illness and don’t get diagnosed and treated if at all until later in life. And by then, marriages have ended, job opportunities have been squandered,” he said. “So if we can intervene during the college years, their kind of lifelong trajectory is going to be that much better.”\nOur reporting\nThe Atlanta Journal-Constitution is part of the Mental Health Parity Collaborative, a group of newsrooms that are covering stories on mental health care access and inequities in the U.S. The partners on this project include the Carter Center, the Center for Public Integrity, and newsrooms in select states across the country.\nSolutions\nHere’s what some Georgia colleges and universities are doing to connect more male students with mental health services.\nEmory University plans to hire coaches to provide short-term, goal-focused guidance outside the counseling center. It’s also developing an initiative to teach students mindfulness to reduce stress and anxiety.\nGeorgia Tech wants to hold residence hall workshops to teach students to manage their time and stress, plus other skills like how to make friends.\nKennesaw State University is training peer counselors, supervised by a licensed professional, to create safe spaces for fellow students to talk. The Marietta counseling center also has hosted a Dungeons & Dragons social anxiety support group that appealed largely to men.\nMorehouse College offers meditation sessions and drop-in mental health workshops.\nThe University of Georgia tailors mental health programs to fit male audiences, such as fraternities or men’s sports team.",
  "word_count": 2066,
  "scraped_at": "2026-02-14T12:05:29.641576"
}