{
  "article_id": "2cb1dca368d6",
  "url": "https://www.dungogchronicle.com.au/story/9143101/inside-lake-macquarie-city-councils-year-of-transition-in-2025/",
  "title": "Inside Lake Macquarie City Council year of transition in 2025 | Dungog Chronicle",
  "date": "20251230T234500Z",
  "domain": "dungogchronicle.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "History will likely frame Lake Macquarie City Council's 2025 as a year of transition.\nSubscribe now for unlimited access.\nor signup to continue reading\nA time when the successful long-serving CEO Morven Cameron was farewelled and first-term Labor mayor Adam Shultz doubled down the focus on the city's housing crisis.\nOn the political front, Cr Shultz presided over a predominantly congenial council.\nHowever, several victories for the Liberals and Independents as a voting bloc marked what could be the beginning of a new balance of power in 2026.\nThe coals of the November 27, 2024, council administration building arson attack were still smouldering metaphorically when staff and councillors recommenced their duties in early 2025.\nWithout their Speers Point headquarters, about 450 council employees worked from home initially before moving into the temporary office space at the former Ausgrid administration building at Wallsend in February.\nCouncil meetings were taken on the road at various venues such as the Windale Hub, Swansea Centre, Avondale University and Sugar Valley Library Museum.\nOver the summer, whispers had begun that one of Lake Macquarie's largest developments, the 30,000-capacity Cedar Mill amphitheatre at Morisset, had ground to a halt.\nIn March, the Newcastle Herald broke the news that Newcastle developer Winarch had told Lake Macquarie councillors it would be downscaling the $235 million development.\nWinarch's new plans included building a 10,000-seat indoor arena and a 5000-capacity outdoor space.\n\"Updated plans and a revised timeline will be submitted to council in April,\" a Winarch spokesperson said at the time.\nNine months later, the modified DA is yet to be submitted.\nAlso in March, the council's $52 million expansion of the Hunter Sports Centre at Glendale was opened, as was the upgraded $14 million Belmont Sports Complex.\nCr Shultz delivered on his major election promise in April by hosting the Lake Macquarie Housing Forum at Belmont 16s.\nAbout 100 people attended from state and local government, as well as developers, affordable housing providers, not-for-profit community organisations and industry experts.\n\"If we shoot for the stars and land in the trees and make a concerted collaborative effort to do our very best, then that's what it's all about,\" Cr Shultz said.\nSeveral planning changes were subsequently adopted following the forum, including the trial of tiny homes on unused council land, the adoption of a Housing Diversity Planning Proposal to encourage higher density, and incentives for developers who build in suburban in-fill areas.\nThe year's most controversial DA caused the first major fracture among councillors during the winter.\nCouncil staff had recommended that Damien Jensen's modified DA for his Toronto green waste recycling business, JET Group, be refused on environmental grounds.\nAfter two deferrals pending a site inspection and time to analyse additional information, seven Liberal and Independent councillors teamed up to vote against Labor's six to approve JET Group's DA.\n\"I should be happy and breathe a sigh of relief,\" Mr Jensen said after the drawn-out saga.\n\"But after years of red tape and the recent political games on display, I'm disillusioned and all out of trust.\"\nSoon after, West Ward Liberal councillor Jason Pauling brought forth a notice of motion to sing Advance Australia Fair before council meetings.\nAn amendment to sing both verses of the national anthem was eventually victorious 11-1, with Labor North Ward councillor Keara Conroy the only opposition.\n\"I think there are a number of residents who would prefer us to get on with the job of our responsibilities in serving our community, and that is the way we can continue our sense of local pride and national pride,\" Cr Conroy said.\nThe redevelopment of Myall Road in Garden Suburb was also hotly debated in June, with Independent North Ward councillor Colin Grigg pushing for the plan to be reexamined amid traffic safety concerns for the local soccer club and Hunter Bible Church.\nThe road is being redeveloped to cater for Landcom's 105-dwelling residential development. The land was controversially cleared in March after a 12-year community fight to preserve the bushland.\n\"It's a ridiculous situation and I don't want to see those people stuck with this ad infinitum,\" Cr Grigg said of the Myall Road plan. \"It's basically condemning them to doing U-turns.\"\nThe biggest bombshell of the year fell on the council in late August when CEO Morven Cameron resigned after eight years in the role and 19 years in the organisation.\nDuring her reign she was named Business Hunter's Business Leader of the Year in 2019, received a Minister's Award for Women in Local Government and led the council to the 2024 AR Bluett Memorial Award.\n\"I love this city and I have truly loved serving our community over the past 19 years,\" the Scottish-born Ms Cameron said.\n\"It has helped shape who I am today, and hopefully, I've done a little bit to help shape what it is, too.\"\nDeputy Tony Farrell has been acting CEO since and the council recently began advertising the position. A new CEO is expected to be appointed in the first half of 2026.\nIn September, the council endorsed Cr Shultz's plan to forge a strategic partnership with its southern neighbours, Central Coast Council, to advocate to state and federal government on projects of mutual benefit.\nThe council maintained its strong delivery rate, completing more than 90 per cent of planned actions for the fifth straight financial year.\nCr Shultz also described the council's financial position for 2024-25 as \"a strong result\" despite a $6.9 million deficit caused by the loss of $7.5 million in disposal assets from the administration fire and the $6.5 million reduction in advanced payment from the federal government's 2025-2026 Financial Assistance Grant.\nAs 2025 drew to a close, the council was rocked by several acts of vandalism.\nMore than $100,000 in damage was caused to the Hunter Sports Centre when two children aged 11 and 14 allegedly broke into the Glendale facility on December 12 and slashed gymnastics equipment, cut data cabling and sprayed fire-extinguishing foam throughout the building.\nIt came six days after 23 sandstone blocks, each weighing 1.1 tonnes, were stolen from the side of The Esplanade at Speers Point. The theft was estimated to cost $10,000.\nMeanwhile, the council's insurers' most recent cost estimate for the damage bill of the administration building fire skyrocketed to $43 million.\nCouncil staff are not expected to return to Speers Point until at least 2027.",
  "word_count": 1063,
  "scraped_at": "2026-02-14T12:21:13.666176"
}