{
  "article_id": "2cc82f157989",
  "url": "https://www.independent.ie/irish-news/elections-2024/galway-west-general-election-2024-updates-noel-grealish-takes-fifth-and-last-seat/a456914243.html",
  "title": "Galway West General Election 2024 updates : Noel Grealish takes fifth and last seat",
  "date": "20241202T093000Z",
  "domain": "independent.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Galway West General Election 2024 updates: Noel Grealish takes fifth and last seat\nMairéad Farrell (SF), Catherine Connolly (Ind), John Connolly (FF), Hildegarde Naughton (FG) and Noel Grealish (Ind) are electedSenator Seán Kyne has announced his retirement from politicsGráinne Seoige commented on running her first election campaign, on the ‘celebrity tag’ and on the criticism over the cancer care ad\nNo of seats: 5\nSeats filled: 5\nAnd that’s a wrap! The new Galway West TDs are: Mairéad Farrell (SF), Catherine Connolly (Ind), John Connolly (FF) and Hildegarde Naughton (FG) and Noel Grealish (Ind)\n3.20am – Count 16 results: Noel Grealish takes the last seat in Galway West!\nNoel Grealish 9,649\nNoel Thomas 8,749\n2.20am – Count 15 results: John Connolly's surplus votes have been redistributed but nobody reached the quota to be elected. Noel Grealish is now 659 votes ahead of Noel Thomas. Now, Hildegarde Naughton’s surplus votes will be redistributed. The next count is expected to be the last one for Galway West!\nNoel Grealish 9,081\nNoel Thomas 8,422\n2am – Many are now leaving the count centre and I am finishing today’s snacks. However, there is still one seat in Galway West to be filled and Irish Independent reporters like myself stay until the end, like heroes. We await for count 15.\nNoel Grealish 8,717\nNoel Thomas 8,134\n1.20am – Count 14 results: Cllr John Connolly and TD Hildegarde Naughton have been elected. John Connolly's surplus votes will be distributed for the last seat to be filled. Noel Grealish is currently 583 votes ahead of Noel Thomas.\nJohn Connolly 10,988\nNoel Grealish 8,717\nHildegarde Naughton 10,942\nNoel Thomas 8,134\n00.30am – We are still waiting for the results of count 14 here at Galway City's Lawn Tennis Club. In the meantime, Senator Seán Kyne has announced his retirement from politics following his elimination from the race.\n“I think I have been retired by the electors,” he told the media this evening.\nSenator Kyne explained he doesn’t want to put his family through another election campaign but, after 20 years in politics, he does not know what he is going to do next.\n11.30pm – Count 13 results: Seán Kyne has been eliminated and his votes will now be redistributed. It’s a tight race between Hildegarde Naughton and Noel Thomas.\nJohn Connolly 9,746\nNoel Grealish 8,222\nSeán Kyne 6,371\nHildegarde Naughton 7644\nNoel Thomas 7242\n10.10pm – Count 12 results: Nobody was elected or eliminated. Catherine Connolly surplus votes will now be redistributed.\nJohn Connolly 9,592\nNoel Grealish 8,148\nSeán Kyne 6,281\nHildegarde Naughton 7,474\nNoel Thomas 7,199\n8.45pm – Count 11 results: Sinn Féin Mairéad Farrell and independent Catherine Connolly have both been re-elected! They are the first two candidates to be elected at Galway West this weekend. Farrell’s surplus votes will now be redistributed.\nJohn Connolly 9484\nCatherine Connolly 10,578\nMairead Farrell 10,610\nNoel Grealish 8,079\nSeán Kyne 6,235\nHildegarde Naughton 7,395\nNoel Thomas 7,138\nRead more\n7pm – Count 10 results: Sinn Féin Mairéad Farrell and Fianna Fáil John Connolly are now neck and neck for the first seat of Galway West.\nJohn Connolly jumped to 9,291 votes after receiving 1,437 transfer votes from running partner Gráinne Seoige.\nEibhlín Seoighthe has been eliminated and her votes will now be redistributed.\nJohn Connolly 9291\nCatherine Connolly 8977\nMairead Farrell 9532\nNoel Grealish 7969\nSeán Kyne 6042\nHildegarde Naughton 7082\nEibhlín Seoighthe 3911\nNoel Thomas 7017\n6pm – As Galway West awaits for the count 10 to be announced, it is getting clearer and clearer who are at the end of their race.\nAmong them, Social Democrats candidate Eibhlín Seoighthe – who so far received 3,841 votes – said that, despite a boost of over 800 transfer votes from Labour candidate Helen Ogbu, she is aware she will not get a seat at the Dáil this time.\nMs Seoighthe told the Irish Independent she is feeling “good and proud” of this year’s result.\n\"I know I’m not going to take a seat but with a campaign that was only three weeks long I was actually really impressed with the outcome, really impressed with my team that have been supporting me through it and really grateful to the constituency that chose to give me so many votes, I am really blown away. So feeling good and proud.”\nAs many have already left the count centre, Ms Seoighthe explained why she decided to stay until the end.\n\"I take great pride on the work and I want to be here for the party, I want to be here for the supporters that are here, they deserve to see me still here and still standing.”\nShe added she intends to put her name forward once again at the next general election: “The plan is to keep on going and to keep on working away and see how we can grow and develop from here.”\n5.30pm – Count 9 results: Fianna Fáil’s Gráinne Seoige has been officially eliminated while Mairead Farrell is still far away from the quota. Social Democrats’ Eibhlín Seoighthe has received 886 transfer votes from Labour candidate Helen Ogbu.\nJohn Connolly 7854\nCatherine Connolly 8750\nMairead Farrell 9335\nNoel Grealish 7777\nSeán Kyne 5727\nHildegarde Naughton 6741\nGráinne Seoige 3162\nEibhlín Seoighthe 3841\nNoel Thomas 6736\n4.10pm – Count 8 results: Labour Party Helen Ogbu has been eliminated as we are still waiting for the first seat to be filled.\nJohn Connolly 7694\nCatherine Connolly 8150\nMairead Farrell 9093\nNoel Grealish 7702\nSeán Kyne 5600\nHildegarde Naughton 6473\nHelen Ogbu 2622\nGráinne Seoige 3082\nEibhlín Seoighthe 2955\nNoel Thomas 6673\n3.40pm – Mike Cubbard said he will keep working in politics as he is both proud of his campaign and disappointed he was eliminated. Cllr Cubbard was eliminated at the seventh count with 2,451 votes.\n“I’m disappointed overall, because I think I would have brought something to the table in Dublin for Galway. But Galway wants and needs a strong independent voice and we have that in Deputy Connolly and Deputy Grealish now.\n“Obviously I’m disappointed, I’m tired, I’ll reflect with my family and my supporters in the next couple of days. But I have a very small team, I have a team of five - six people, and to get over 2,400 votes, I’m quite proud of it.”\nCommenting on his campaign, Cllr Cubbard added: “The general election is quite different to the local election, where you can see the vast difference in big teams and big budgets that the big parties would have at the general election. You’re up against the big machine as a small independent.\n“It was a very short campaign, very different, I like to knock on doors and meet people, speak to people, we didn’t get to do that this time.\n“The weather was poor, the snow, the red warning. I was away for a couple of days as well, I had committed to take 45 kids from a football club in the city to Agadir, in Morocco. I wasn’t going to break a promise to the kids.\n“It wasn’t ideal but I’m proud of that campaign.”\nHe added about the future: “I’m very proud to be a councillor, I’m very proud I topped the poll back in June, I’m 39 years of age, I’m not going anywhere soon, I keep building.”\n2.45pm – Count 7 results: nobody is elected as Mairead Farrell is still far away from the quota of 10,047. Independent candidate Mike Cubbard has now been eliminated and his votes will be redistributed.\nJohn Connolly 7457\nCatherine Connolly 7554\nMike Cubbard 2451\nMairead Farrell 8654\nNoel Grealish 7265\nSeán Kyne 5522\nHildegarde Naughton 6353\nHelen Ogbu 2514\nGráinne Seoige 3016\nEibhlín Seoighthe 2885\nNoel Thomas 6463\n2pm – Briefly talking with the media, Ms Seoige said she is disappointed with the result, but happy she ran an “honest and spirited” campaign.\n“I’m really proud of the campaign that we ran, I’m really humbled by the amount people who took part in my campaign and wanted to be there for me. I’m really delighted with the friends I’ve made on the way because I met people and I got to know people that believed in me, and supported me and we actually had a lot of craic in this campaign, a lot of moments that I’m gonna treasure.\n“I’m disappointed it didn’t work out, but I’m very proud that I took the opportunity and made the journey. Nobody achieves anything in this life unless they leave their comfort zone, and I did that, and that’s something I’ll always bring with me. And you never know what’s gonna happen in the future.”\nDuring the campaign, Ms Seoige received criticism over an ad campaign on cancer care in Galway.\nIn response to that criticism, today Ms Seoige said the ad was “100pc factual” as she added: “I’m glad it started the conversation. I had people at the doors, nurses, saying thank you for saying that.”\nMs Seoige, who is well known as a TV personality, also commented on the tag “celebrity candidate”.\n“The celebrity thing is a tag you like to attach and it’s not a nice one, because it makes somebody else is without substance and I have plenty of substance.\n“I have been taking stuff like this as I’ve entered media in 1996, I’m well used to labels, it’s something that happens to women all over society and women in politics even more.”\n1.30pm – As we wait for count number seven, Fine Gael TD Hildegarde Naughton has arrived to the count centre for the first time this weekend.\nMinister Naughton so far received 6,065 votes and is currently neck and neck with Independent candidate Noel Thomas (6,437) and just ahead of second Fine Gale candidate Seán Kyne (5,402).\nTalking to the Irish Independent, Hildegarde Naughton said she is happy with the result so far.\nShe said: “Here in Galway West Fine Gael have done very well, I have increased my first preference vote and my percentage here of the vote of the last three elections. Myself and Seán Kyne performed very well, we were intending and hoping for two seats here in Galway West, we were the only party who could realistically achieve that, and we’re very happy with the Fine Gael vote when you look at our combined vote here in Galway West. It’s very good from that perspective.\nShe added she would have not changed anything in her running campaign.\n“I worked very hard personally over the last few years. I went out on my own record, I now Seán did too. We are two very experienced candidates here for Galway West, we have both been councillors, TDs, we sat at the cabinet table and my belief is that Galway needs strong voices like myself and Seán to represent the area.\n“Everybody does their best, you put out your best platform and we would be campaigned on our track record, we just have to sit and see now what the people of Galway West decide.”\nShe added transfer votes will be “critical” today both locally and nationally.\n“Nationally I think we are doing very well, there are still seats in contention across the country, we have a lot of new candidates who are performing really well. I canvassed up and down the country with many of them throughout the campaign, they are very experienced, they are resonating very well with their electorate, but we just have to wait and see now, transfers are going to be critical down to the last few seats in all constituencies.”\n1pm – Sixth count results have been announced. Nobody was elected. Pauline O'Reilly was eliminated and her votes will now be redistributed.\nJohn Connolly 7354\nCatherine Connolly 7170\nMike Cubbard 2419\nMairead Farrell 8582\nNoel Grealish 7228\nSeán Kyne 5402\nHildegarde Naughton 6065\nPauline O'Reilly 1918\nHelen Ogbu 2106\nGráinne Seoige 2962\nEibhlín Seoighthe 2518\nNoel Thomas 6437\n12pm – The fifth count has been announced just before lunchtime today. Nobody was elected, Padraig Lenihan was eliminated and his votes will not be redistributed.\nJohn Connolly 7230\nCatherine Connolly 7034\nMike Cubbard 2310\nMairead Farrell 8445\nNoel Grealish 6956\nSeán Kyne 5351\nPadraig Lenihan 1419\nHildegarde Naughton 6031\nPauline O'Reilly 1892\nHelen Ogbu 2079\nGráinne Seoige 2941\nEibhlín Seoighthe 2493\nNoel Thomas 6049\n10.50am – The fourth count has been announced. Once again, nobody was elected. Maisie McMaster has now been eliminated and her votes will be redistributed at the next count.\nJohn Connolly 7226\nCatherine Connolly 6860\nMike Cubbard 2291\nMairead Farrell 8232\nNoel Grealish 6951\nSeán Kyne 5349\nPadraig Lenihan 1407\nMaisie McMaster 926\nHildegarde Naughton 6025\nPauline O'Reilly 1843\nHelen Ogbu 1982\nGráinne Seoige 2937\nEibhlín Seoighthe 2177\nNoel Thomas 6033\n10.15am – The third count has been announced. AJ Cahill has been eliminated and his votes will now be redistributed.\nAJ Cahill 631\nJohn Connolly 7203\nCatherine Connolly 6770\nMike Cubbard 2250\nMairead Farrell 8195\nPatrick Feeney 52\nNoel Grealish 6905\nSeán Kyne 5338\nPadraig Lenihan 1303\nDoran McMahon 455\nMaisie McMaster 916\nHildegarde Naughton 6015\nPauline O'Reilly 1840\nHelen Ogbu 1977\nGráinne Seoige 2934\nEibhlín Seoighthe 2175\nNoel Thomas 5815\n9.40am – Less than an hour since kicking off, the second count has been announced: nobody was elected, Doran McMahon's votes will now be redistributed.\nAJ Cahill 475\nJohn Connolly 7195\nCatherine Connolly 6752\nMike Cubbard 2223\nMairead 8169\nNoel Grealish 6888\nSeán Kyne 5335\nPadraig Lenihan 1238\nDoran McMahon 455\nMaisie McMaster 907\nHildegarde Naughton 6014\nPauline O'Reilly 1839\nHelen Ogbu 1976\nGráinne Seoige 2932\nEibhlín Seoighthe 2174\nNoel Thomas 5703\n9am – The second count has begun at Galway City's Lawn Tennis Club. After the first count arrived late last night, now Patrick Feeney’s votes will be redistributed.\nI have more snacks as this is set to be a long day, the room is already filled with journalists and TD Catherine Connolly has already been spotted.\nSinn Féin Mairead Farrell topped the poll in Galway West last night with 8,164 votes and she is followed by John Connolly (7,192), Noel Grealish (6,887), Catherine Connolly (6,747), Hildegarde Naughton (6,011), Noel Thomas (5,700), and Seán Kyne (5,335).\nWhile Fianna Fáil celebrity candidate Gráinne Seoige’s hopes for her first Dáil seat have been axed at the first count.\n11.30pm – After about 14 hours since the opening of the boxes, the first count has finally been announced. The quota is 10,047 and as nobody was elected, Patrick Feeney’s votes will now be redistributed.\nThat’s it for tonight from the Galway's Lawn Tennis Club. The count will resume tomorrow morning at 9am.\nAJ Cahil 469\nJohn Connolly 7192\nCatherine Connolly 6747\nMike Cubbard 2219\nMairead Farrell 8164\nPatrick Feeney 52\nNoel Grealish 6887\nSeán Kyne 5335\nPadraig Lenihan 1233\nDoran McMahon 450\nMaisie McMaster 905\nHildegarde Naughton 6011\nPauline O'Reilly 1839\nHelen Ogbu 1973\nGráinne Seoige 2929\nEibhlín Seoighthe 2172\nNoel Thomas 5700\n10pm – I’m afraid there hasn’t been any update since the late afternoon as Galway West is still waiting for the first count to be announced.\n6.30pm – The first count is expected to be announced soon and I’m already halfway through my pack of biscuits.\nIn the meantime, Fianna Fáil John Connolly has arrived at the count centre.\nHe said: “Tallies are looking positive but it should be noted that they are just tallies and there are many twists and turns that may happen in a count like this with elimination and transfer of votes, but at the moment I’m in a reasonably positive position based on the tallies. I hope there would be a transfer coming from my running mate, that would assist to keep my ahead of those who come behind me.\n“I feel quite positive about it, I just hope it goes how it looks at the moment.”\n4pm – As we are waiting for the first count to be announced, independent TD Catherine Connolly said she is delighted with the tallies’ results. “I’m delighted about the feedback and the feedback on the doors, I don’t know which seat I’ll take but it looks positive and I’m delighted with that.\n\"I’ve always regarded as a privilege to be a TD in the Dáil. That sense of being a privilege has kept me going.\n“I don’t like politics, I’ve never liked it, but it’s a privilege and I think I have an obligation to speak out and put forward an alternative vision to the one put forward by the government for the last number of years.”\n2.10pm – The tallies have spoken!\n96pc of the boxes have been tallied and results show Sinn Féin Mairéad Farrell is leading at 13pc.\nShe is followed by Fianna Fáil John Connolly (12pc), independent Catherine Connolly (11pc), independent Noel Grealish (12pc), Fine Gael Hildegarde Naughton (10pc), Independent Ireland Noel Thomas (10pc) and Fine Gael Seán Kyne (9pc).\nThey are then followed by Fianna Fáil Gráinne Seoige (5pc), Social Democrats Eibhlín Seoighthe (4pc), independent Mike Cubbard (3pc), Labour Party Helen Ogbu (3pc), Green Party Pauline O’Reilly (3pc), Aontú Pádraig Lenihan (2pc), Irish Freedom Party Doran McMahon (1pc), People Before Profit-Solidarity Maisie McMaster (1pc), independent Patrick Feeney (0pc).\n12.35pm – Fine Gael Senator Seán Kyne has arrived at the Galway West count centre and told the Irish Independent he is happy with the results so far.\n\"We only have 66pc of the boxes tallied so far and there’s some more to come in and other parties might have the tally sheets. So we don’t know, but there’s definitely one Fine Gael seat.\nTalking about his campaign, he added: “I’m relatively happy, considering that I have a running mate in my own parish who did very well .\n“I was happy with the response, I was happy with the groundcover, the weather played against us in the end but it played against everyone so I’m quite happy.”\nIn the meantime, other familiar faces have been spotted at the count centre as Galway City and County councillors came to support their party’s candidates.\nAmong them, Fianna Fáil Galway City Councillor Alan Cheevers said he is cautiously optimistic: \"We’re happy with what the tallies are showing so far.\n“I think that what we’re seeing here and the trend that we’re seeing here today probably reflects on the exit polls so far. We’re hopeful for both our candidates, let’s see what happens at the end of the day.”\n12.25pm – 63pc of the boxes have bene opened and ‘tallied’.\nAccording to tallies, Fine Gael is now at 19pc followed by Fianna Fáil (17pc) and Sinn Féin (13pc).\nIn particular, Fianna Fáil's John Connolly is at 12pc, while Gráinne Seoige is still at 5pc; Seán Kyne is at 10pc and Hildegarde Naughton is at 9pc.\nIndependent candidates are still going strong with Catherine Connolly at 12pc and Noel Grealish at 10pc. Also, Independent Ireland’s Noel Thomas is currently at 11pc.\n11.35am – 34pc of the boxes have been opened in Galway West and tallies revealed independent candidates are still leading the way.\nCatherine Connolly is at 12pc and the four independent candidates together are now at 43pc.\nFine Gael is now at 20pc followed by Fianna Fáil (18pc) and Sinn Féin (12pc).\nFianna Fáil's John Connolly (13pc) is still ahead of Gráinne Seoige (5pc); while Senator Seán Kyne (11pc) is ahead of Hildegarde Naughton (9pc).\n11.15am – Social Democrats' Eibhlín Seoighthe is the first candidate through the Galway West count centre's doors today.\nTalking with the Irish Independent, she said: “It’s early, but it’s looking interesting, the transfers are looking interesting. They are a bit more scattered, usually they are a bit more predictable, but they seem to be a bit all over the place. It’s still up in the air for now.\nShe added she is proud of her team and the campaign they have run: “My team were absolutely amazing, we did the best that we could. If I had had more time or if I could divided myself into seven I would have tried to hit as many doors as possible, but the time just wasn’t there.\n“We did ourselves proud. It was a great first run at the general I’d say.”\n10.30am – We’re well underway here at Galway City's Lawn Tennis Club, where the boxes for Galway West were opened at 9am.\nSinn Féin, Fianna Fáil and Fine Gael are neck and neck in Galway West according to early tallies, but independent candidate Catherine Connolly is currently leading the way.\nTallies show independent candidate Catherine Connolly is leading with 801 votes, making the independent candidates the 45pc of the total so far.\nShe is followed by Sinn Féin (16pc), Fianna Fáil (15pc) and Fine Gael (15pc).\nAccording to tallies, Fianna Fáil candidate John Connolly has so far received 707 votes, while Gráinne Seoige has only received 140.\nIndependent candidate Patrick Feeney could be the first casualty of the day as he only received 6 votes so far.",
  "word_count": 3489,
  "scraped_at": "2026-02-14T13:17:43.298315"
}