{
  "article_id": "2cfb31eea01d",
  "url": "https://www.90min.com/posts/gareth-taylor-keen-to-see-fire-in-players-eyes-huge-chelsea-clash",
  "title": "Gareth Taylor keen to see  fire in the players eye during huge Chelsea clash",
  "date": "20230324T220000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Gareth Taylor keen to see 'fire in the players eyes' during huge Chelsea clash\nManchester City manager Gareth Taylor has challenged his players to play with the fire in their eyes that he's seen during the build-up to Sunday's huge WSL clash with Chelsea at the Academy Stadium.\nCity have bounced back from losing their first two games of the season to go unbeaten in their last 13 outings, winning 11 of those and drawing just two.\nThey sit third in the table, just two points behind leaders Chelsea and level with neighbourhood rivals Manchester United who are second on goal difference. Arsenal are fourth, three points behind with a game in hand.\nChelsea inflicted one of City's two defeats earlier in the season, cruising to a 2-0 win at Kingsmeadow, and Taylor admitted in his pre-match press conference duties that although a draw would not be the end of the world, he wants to see a hunger from his players to go out and get all three points by rising to the occasion.\n\"Maybe, maybe,\" he said when asked if Sunday's game is a must-win encounter. \"A draw's not a disaster, it can feel like that in this league given the make up of the league, not many games. A draw can cost you a league title sometimes so I think it's tight in that respect, but again we feel we have enough, particularly with what we've seen over recent weeks in terms of what we're able to do in the final third.\nREAD NEXT\n- How to watch every WSL Women's Football Weekend game on TV\n- Women's Football Weekend: What's at stake for every WSL club\n- Man City vs Chelsea - WSL preview: TV channel, live stream, team news & prediction\n\"For us, a game to look forward to on our patch. If someone had given us this after the first two games of the season, we'd have grabbed their hands off. What an opportunity for us, I want to see the fire in the players eyes that I'm seeing at the moment, I want to see the bit between our teeth ready to take on the challenge.\"\nTaylor elaborated by saying that City's sole objective is looking to win the WSL title, rather than sealing a top-three finish to guarantee Women's Champions League football next season - something they have missed out on during 2022/23.\n“No I don’t see how being conservative and not go for the title is going to allow you to secure Champions League,” he explained. “I think certainly it’ll be tight. Chelsea have a higher advantage in the points they can accumulate and the other three teams are exactly the same.\n“I think it’s just moving from game to game. I don’t that will be anyone’s method to be complacent in that respect. We need to win every game.\n“It’s as simple as that. What they do might be slightly different. For us, I don’t think anything will change in our mindset. You need little things to go your way. Like if we get some good energy in the team early on, you get some opportunities to open up Chelsea.\n“I think that’s where it stems from, then you need to maintain it. It’s the hardest thing in football, everybody wants to be on the front foot and be aggressive. That’s something we’ll certainly be looking at for the weekend.”",
  "word_count": 569,
  "scraped_at": "2026-02-14T12:21:18.414438"
}