{
  "article_id": "2d040dd7ae3b",
  "url": "https://www.euronews.com/business/2023/11/14/earning-big-and-fast-how-professional-athletes-deal-with-their-money",
  "title": "Earning big and fast : How professional athletes deal with their money",
  "date": "20231114T064500Z",
  "domain": "euronews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Professional athletes’ careers are often short, but the lucky ones earn millions, and fast. With their hard-earned wealth, many choose to enlist the help of professional advisors to avoid financial ruin that is sometimes just a poor investment away.\nJean-Charles Castelletto bought himself a branded belt with his first wage. Ten years later, the international Cameroonian football player’s earnings have multiplied by 30. To handle his money, he relies on a financial advisor specialised in professional athletes’ assets.\nCastelletto, 28, says he’s not the type “to go crazy”. He talks about his money openly, and discreetly.\n“Living in a football environment is very hard,” the father of three explained to AFP while sitting next to his wife Sabrina. “When you’re on your own, it’s complicated. I’ve had an asset management advisor for the past three years. I expected him to do a meticulous job, and everything was put in place progressively.”\nThe financial prospects that come with being a professional athlete aren’t always smooth. Careers are often short, chaotic, with disparate earnings, and can come to an abrupt halt at any moment. As such, relying on professional asset managers can prove useful.\nCastelletto is one of 120 customers at Elite Patrimoine, a French asset management firm created 15 years ago that takes on clients with a minimum annual salary of €300,000 - some earn over €15 million.\n“We’re not magicians,” said Frédéric Schatzle, the head of the firm, which has 13 employees. “Our job consists in amassing finance and property assets, so the athlete can begin their second professional career comfortably.”\n“We have to optimise under short periods of time, and we tell athletes ‘you do enjoy your life, but you save up. When you earn 100, instead of giving me 10, you give me 80, and you live with 20’,” Schatzle added.\nIn the company’s building in Toulouse, XXL shoes call to mind renowned NBA basketball players, such as Rudy Gobert ($38 million per year), or Evan Fournier ($19 million per year).\n‘Money magnets’\nElite Patrimoine also manages the finances of female basketball player Céline Dumerc. She’s got the highest record of 262 team selections, and is one of the few women on the athletes’ asset market in France.\n“When you begin in women’s basketball, you know there isn’t a lot of money to be made,” Dumerc told AFP. “Then, I signed a contract in Ekaterinbourg in Russia. In two years, I’ve earned more than both my parents in their whole life!”\nThe athlete’s assets’ market also has clients who are F1 drivers, in addition to players of handball, rugby, tennis and e-sports. The latter is rapidly expanding, with high prices and earnings that can reach $3 million a year, according to Elite Patrimoine advisor Laurent Mesnil.\nBut football remains the firm’s star player.\n“Today, for the highest earners in French football, we’re above 30 million annually, without mentioning PSG’s Kylian Mbappé or Saudi Arabia’s Karim Benzema”, said Schatzle, noting that there are about 5,000 professional athletes in France, all sports included.\nFrench newspaper L’Equipe said that 1,361 of them are footballers, citing a 2021 survey by professional footballers’ union UNFP.\nL’Equipe also launched a survey for the 2022/2023 period, which found that average monthly salaries in Ligue 1 (the French equivalent of England’s Premier League) range from €20,000 to €1 million at PSG.\nAsset management counselling has become a service that agents need to propose to attract athletes, according to Jean-François Brocard, Economic Sciences professor at a CDES, a sports economy university.\nHe said financial advice can sometimes lead to bad experiences, even fraud. “It’s becoming more frequent in football, especially with the impoverishment of athletes,” said Brocard. “When they come from low-income backgrounds, their families see them as ‘money makers’, and refuse to let financial advisors deal with their earnings. They try to deal with it themselves, and it can lead to catastrophes.”\n‘My father said…’\nBruno Bellone is one of the first professional athletes who made his financial struggles public in the 1980s. He was part of the French national team who won the Euro football championship in 1984.\nThe ex-athlete still remembers the weeks he spent living in his car after he lost everything, before one of his teammates, Jean Tigana, helped him. “Today, I don’t owe anything to anyone anymore, and that’s a beautiful thing,” he confided to AFP.\nA serious injury forced him to end his career prematurely in 1990, when he was just 28 years old. At the time, one of his father’s friends was dealing with his money.\n“My father said he was a good guy,” Bellone recalled. “He was a real estate developer who used my money to develop his own business. I divorced, lost my career… And that guy had only insured me for things happening outside the pitch. I lost everything. 12.5 million francs (€1.9 million).”\nSince that time, other football players have spoken up about similar issues, such as Ludovic Giuly or Yohan Mollo. International French football player Paul Pogba recently made headlines over his relatives’ financial blackmail.\nThere are many other examples of families mismanaging athletes’ earnings, such as German tennis player Steffi Graf’s father committing tax fraud with his daughter’s money, or Spanish tennis player Arantxa Sánchez’s high debt she claims is her family’s doing.\nTennis is not as lucrative a sport as one might think. The Roland Garros 2023 winner did win €2.3 million, but only a few earn such amounts.\n“Those who earn decent money today are the top-100 players. Those who earn money by playing tennis are par for the 200, 250 top players. In France, they’re only 15,” explained Morgan Menahem, an ex-agent and manager of a dozen players, including Jo-Wilfried Tsonga and Arnaud Clément.\n“A tennis player is like a company that has business all over the world, and whose foundations need to be solidified from the start of their career. Many players are not taking things seriously enough,” he added.\nAccording to Menahem, contrary to team sports, tennis players start their season with nothing. They pay for their own trips, coaches and health professionals, they don’t know where they will play or when, and they have no idea when the season will end for them. He also warns that “relatives that can be a big issue”.\nPlatini’s warning\nRetired star football player Michel Platini, 68, wants to warn younger generations.\n“When your name is Mbappé, Zidane, Platini, you always have people around, everybody loves you. People flatter you, and things are easy,” he said. “That’s the message I want people to hear: do not make your relatives’ fantasies a reality. They invest with your money, and that’s dangerous,” he explained.\nTeaching and explaining how to deal with money is important, according to Battiston et Violeau, an asset management firm in Bordeaux.\n“Athletes are competitors, and want goals. We start with tax, then insurance in case of injury, life insurance, investments, and real estate” explained Romain Battiston. The vast majority (85%) of his 120 clients are athletes.\n“There’s a real taboo surrounding money, especially in France. Asset management advisors are the one who can really tackle the issue. They’re the only professional who’ll remain in the athlete’s life once his career is over,” highlighted recently-retired athlete Cyriaque Rivieyran, a new Battiston et Violeau client.",
  "word_count": 1214,
  "scraped_at": "2026-02-14T13:28:04.056003"
}