{
  "article_id": "2d0882a9c1f3",
  "url": "https://www.theguardian.com/world/2023/jun/02/first-edition-dom-phillips-and-bruno-pereira-amazon",
  "title": "Friday briefing : A year after their murder , the vital work of Bruno Pereira and Dom Phillips carries on",
  "date": "20230602T064500Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Good morning. On 5 June 2022, Guardian contributor Dom Phillips and Indigenous expert Bruno Pereira were shot dead in a remote part of the Amazon in western Brazil. They were travelling along the Itaquai river after meeting with Indigenous activists who patrol the Javari valley to protect it from illegal fishing and mining gangs.\nDom and Bruno’s deaths were an incomprehensible loss for their family and friends – but also a signal of the violence that threatens those who highlight the dangers posed by extractive industries to the world’s most important carbon store. One year on, in collaboration with an international consortium, the Guardian is publishing the Bruno and Dom project: a four-day series that seeks to honour their work, and continue it. Today’s newsletter, with the Guardian’s global environment editor, Jonathan Watts, takes you through the first part of the series.\nOne other thing: I’m off from next week on paternity leave, in nervous anticipation of the arrival of what you might call a first addition. Esther Addley, the Guardian’s excellent senior news writer, will be with you alongside Nimo in my absence, and I know she’ll greatly enhance your mornings while I’m wrestling with nappies.\nSee you when I’m back, and here are the headlines.\nFive big stories\n-\nCovid inquiry | Ministers have launched an unprecedented high court attempt to avoid handing over Boris Johnson’s unredacted WhatsApps and diaries to the government-commissioned Covid inquiry. The Cabinet Office told the inquiry that there were “important issues of principle” over passing on information, with concerns that the inquiry could ask for Rishi Sunak’s messages.\n-\nUS debt ceiling | The Senate passed a bill to suspend the debt ceiling on Thursday night, sending the legislation to Joe Biden’s desk and averting a federal default that could have wreaked havoc on the US economy and global markets. The vote, by 63 to 36, came a day after the House passed the same bill.\n-\nUK news | A pleasure boat allegedly sailing near Bournemouth beach on Wednesday has reportedly been impounded by police after the deaths of two young people who got into difficulties in the sea. A man in his 40s who police said was “on the water at the time” was arrested on suspicion of manslaughter.\n-\nTelevision | Phillip Schofield has said he is “utterly broken” and feels “embarrassed and ashamed” about his affair with a younger male colleague, but denied grooming the man. In his first interview since leaving ITV’s This Morning, Schofield apologised to the man for bringing the “greatest misery into his totally innocent life”.\n-\nArtificial intelligence | A US military drone controlled by AI “killed” its simulated operator to prevent being stopped from achieving its mission during a test, it has emerged. No real person was harmed during the simulation, in which the AI attacked a control tower after the operator told it to abort its mission.\nIn depth: ‘They died in a war on nature, a fight to protect it against powerful forces’\nVery soon after the terrible news of Dom and Bruno’s disappearance, Jonathan Watts contacted Forbidden Stories, a Paris-based NGO whose mission is to ensure that “killing the journalist won’t kill the story”. The aim was to pick up the threads of their work and take news of the threat to the Amazon, and the Indigenous people who fight to protect it, to the widest audience possible.\n15 international news organisations and 50 journalists have joined the Guardian on the project. “There were dozens of video calls – they had so many squares on the grid that they looked like a chess board,” Jonathan said. “And within the Guardian, it took a year of work by editors in the UK and US to get it over the line.”\nInitial confessions by two local fishers, Amarildo da Costa de Oliveira and Jefferson da Silva Lima, said that they killed Dom and Bruno out of anger over Pereira’s “persecution” of fishers he accused of illegal poaching on indigenous lands. (They later made a “far-fetched” claim of self-defence.) A third fisher, Amarildo’s brother Oseney, is also in prison awaiting trial; federal police have alleged that a local mobster nicknamed Colombia, who is also behind bars, ordered the killings.\n“The project is about bringing more attention to the Amazon,” Jonathan said. “It’s about continuing to make sure that what Dom and Bruno were doing is recognised and amplified. And it’s about journalistic solidarity. Any environmental journalist who goes to these kinds of places, and talks to the environmental defenders who are threatened, knows that it could have been them.”\nAs the anniversary has approached, Jonathan has been going through his friend Dom’s notebooks, and a plan he left behind for a book, How To Save The Amazon: Ask The People Who Know. “It’s been very emotional to engage with Dom in that way,” Jonathan said. “He writes them in a way that has the feel of a diary. You can really hear his voice coming through.”\nPowerful as Dom’s voice was, he rigorously used it in the service of Indigenous experts like Bruno, and the communities who come under sustained threat from the destruction of the rainforest through illegal logging, mining, and drug trafficking. Jonathan notes that Indigenous people are overwhelmingly more likely to be murdered in the Amazon than anyone else.\n“Dom’s position was always that he shouldn’t be the story,” he said. Bruno took a similar view: quoted in a 2018 piece by Dom, he said: “It’s not about us. The indigenous are the heroes.”\nThe stories building on Dom and Bruno’s work are presented in that spirit. Here’s a guide to the first batch.\nHow the influence of organised crime has grown\nIn this piece, Jonathan explores the growing extent of organised crime groups’ influence in the Amazon, alongside the Guardian’s Latin America correspondent Tom Phillips. We hear from Alexandre Saraiva (above), a former senior federal police chief in the region, about the threat of “Columbianisation”. “The mafia goes wherever there’s money,” Saraiva said. “It doesn’t care if it’s environmental crime, people smuggling, cocaine.”\nFigures collated for the Guardian reveal that the murder rate in Amazonas, the state where Bruno and Dom were among 1,432 people killed last year, is 74% above the national average. About 40% of the profits from cocaine smuggling in Brazil now come through the Amazon – and yet the army and navy seized just 41 firearms last year.\nThe presence of the mafia is making an already difficult task even harder, Jonathan said. “They’re not just coming up against farmers with an old rifle any more – it’s heavily armed groups. It got much worse during the Bolsonaro era. It makes it really hard for the state to regain control.”\nSaraiva also paid tribute to Bruno Pereira: “In the Javari valley we have a convergence between drug trafficking, illegal fishing, illegal logging and mining. And in the middle of all this, there was a guy called Bruno.”\nThe Indigenous patrol groups carrying on Bruno and Dom’s work\nTom Phillips returned to the Javari valley to report on those who continue to defend the Amazon: the Indigenous people equipped with drones, GPS trackers and cameras who seek evidence of environmental crimes, including poaching and illegal fishing, gold mining, cattle ranching, and drug trafficking, within their territory. Bruno, who was not himself Indigenous but worked tirelessly in service of their cause, was a founder of one of these groups, and it was that project which Dom was reporting on when he died.\nIn the town of Atalaia do Norte, Tom saw dozens of men sign up to take part. The youngest among them, 18-year-old Clenildo Kulina (above), tells him: “What they did to Bruno and the journalist was so painful but we’re going to continue fighting our enemies until they can no longer bear it … if I have to die, it will be for our people.”\n“It would be only human nature for people to feel intimidated,” Jonathan said. “But it is remarkable how many of these groups just become even more committed.”\nThe piece also tells the story of Amarildo da Costa de Oliveira, one of those accused of the killings, who is remembered as having been a jungle guide on a mission in search of an Indigenous group in 2002 and a “very amiable, upbeat kid”, but later became a feared organiser of illegal fishing who was “consumed by greed” and “wanted to be the boss”.\n“He’s an exemplar of the bigger picture,” Jonathan said. “There are these huge divisions even within communities. Some will say – we don’t have a choice, let’s stop trying to hold back history, get real, and join with those offering us money. So you have to give strong incentives and support to traditional communities living sustainably. It doesn’t seem fair that they do so much for all of us who need the Amazon to survive, and don’t get the help they need.”\nDom’s wife Alessandra Sampaio on the search for justice\nIn a remarkable piece, Alessandra Sampaio (above) writes: “After Dom left us, I realised that, like many, I still knew so little about the subject and set about seeking more information.” Over the last year, she has been central to the work of commemorating his and Bruno’s legacy.\n“My world has expanded and I consider this a beautiful inheritance that Dom has left me,” she says. “I think of him always, with love and gratitude.” But she warns: “Justice is still far from being done … the deaths of Bruno and Dom have not yet provoked positive change.”\n“Alé [Alessandra] and Dom’s sister Sian have done a fantastic job in trying to push this work on,” Jonathan said. He remembered being at Alé and Dom’s wedding reception, and how obvious their love for each other was. “She’s suffered enormously, but she’s been so strong throughout. She is trying to take this horrendous thing that has happened and transform it into something that can be helpful for the Amazon, and especially for Indigenous people.”\nThe last images of Bruno and Dom\nIn October, activists from Univaja, the Indigenous association where Bruno worked, returned to the area where the two men’s bodies were taken after their death. They found the heartbreaking remnants of their presence: Dom’s UK press card, two spiral notebooks he had taken with him on the trip, and one of Bruno’s phones.\nThe notebooks had been underwater too long to be legible. But police were able to retrieve several images and videos from the handset, including pictures of the two friends (a selfie taken by Bruno is above) and footage of illegal mining dredges along the Javari valley’s Jaquirana river. Tom Phillips explains what the contents tell us here.\nAs well as its evidentiary value, the find stands as the last document of the work that Dom and Bruno believed was so important, and which the stories still to be published before Monday’s anniversary will seek to continue. “They died in a war on nature, a fight to protect it against powerful forces and dangerous criminal groups,” Jonathan said. “Bruno was on the frontline all the time.” And Dom was killed for undertaking the defining task of journalism: “He was a witness.”\nWhat else we’ve been reading\n-\nThe extraordinary story of Ben Roberts-Smith (above), the highly decorated Australian soldier who has lost a defamation case after a judge found newspapers had proved he murdered unarmed civilians in Afghanistan, is the subject of this excellent podcast presented by Ben Doherty. The whole series is here, and Ben also has a useful explainer about the case. Archie\n-\nDavid Smith’s interview with Minnesota’s attorney general, Keith Ellison, is a fascinating read. The two discuss the conviction of Derek Chauvin – the police officer who murdered George Floyd – his role in the prosecution, and the state of reform in the criminal justice system. Nimo\n-\nICYMI: For the Guardian long read, Samira Shackle has the story of how careful research into slavery at one Cambridge college became the subject of furious objection from some faculty – and a new front in the culture wars. Archie\n-\nIn surprise TV news, Kim Cattrall will reprise her role as Samantha Jones for the second season of Sex and the City sequel show, And Just Like That. In celebration, Katie Cunningham picks Samantha’s best moments. Nimo\n-\nThe remarkable global influence of Korean culture – known as hallyu, or Korean wave – is currently being commemorated in an exhibition at the V&A in London. In the LRB, Krys Lee explains how the rapid turnover of trends in Seoul – and an early investment in broadband – took “K-culture” worldwide. Archie\nSport\nCricket | A five-wicket haul for Stuart Broad (above) put England in a commanding position on the first day of their Test match against Ireland. England bowled Ireland out for 172 before racing to 152-1 before the close of play. Andy Bull noted the disparity in resources between the two sides, writing: “The revenue generated for the local economy by this one Test would run Irish cricket for a year.”\nFootball | Uefa is investigating claims the referee due to officiate the Champions League final next week was a keynote speaker at an event organised by a far-right politician. Szymon Marciniak, who also refereed the World Cup final, was part of the gathering in Poland organised by Sławomir Mentzen, who has espoused racist and homophobic views.\nTennis | Former US Open champion Emma Raducanu has split with her coach, Sebastian Sachs, as she recovers from recent surgery on her wrists and ankle. Sachs was Raducanu’s fifth coach in less than two years. The 20-year-old is currently sidelined and could miss most of the season after the surgery, which she said made it “unfeasible” for the partnership to continue.\nThe front pages\nMost of the Guardian’s front page on Friday is given over to the Bruno and Dom project. There is also news of the government’s attempts to avoid handing over Boris Johnson’s unredacted WhatsApp messages and diaries to the Covid inquiry, with the headline “Ministers launch court bid to defy Covid inquiry”.\nOther papers also run with that story. The Financial Times says “Government seeks legal block on Johnson messages for Covid inquiry”. The i characterises it as “Cabinet Office vs Covid inquiry: legal clash over secret WhatsApps”, while the Mail says “Ministers go to war with judge over Covid WhatsApps”. The Times leads simply with “Battle over Johnson messages”.\nElsewhere, the Telegraph reports on the death of two young people in Bournemouth with “Children die in seaside horror”. The Sun carries an interview with Phillip Schofield, under the headline “I’m broken and ashamed.. but NOT a groomer”. Finally the Mirror leads with an image of his former co-host and the headline “Holly: I’ve nothing to hide”.\nSomething for the weekend\nOur critics’ roundup of the best things to watch, read and listen to right now\nTV\nThe Gallows Pole (BBC iPlayer)\nBenjamin Myers’ 2017 novel told the true-life tale of the 18th-century gang of coin clippers who dominated Cragg Vale in West Yorkshire. Shane Meadows’s take on the tale keeps all the energy, density and fortitude of the book, but adds the missing humour (and women). A drama of rare quality in every sense, this is not to be missed. Lucy Mangan\nMusic\nFoo Fighters – But Here We Are\nThe band’s first album since drummer Taylor Hawkins’ death makes no bones about being a musical act of mourning, opening with Dave Grohl reeling from hearing of his best friend’s passing – “It came in a flash / It came out of nowhere / It happened so fast”. The overall effect is crowd-pleasing, but that somehow feels a more fitting memorial than a dark night of the soul. Alexis Petridis\nFilm\nReality\nTina Satter’s movie is an eerily gripping true-life drama concerning people who look like elaborately reanimated, hyperreal ghosts. An exercise in verbatim cinema, it is inspired by the case of Reality Winner, a 26-year-old US intelligence officer and translator who, in 2017, was arrested for leaking to the media a secret government document concerning apparent Russian interference in the 2016 presidential election, and is played superbly by Sydney Sweeney. Peter Bradshaw\nPodcast\nDeath on the Lot\nWidely available, episodes weekly\nThe scene from The Misfits where Montgomery Clift, Clark Gable and Marilyn Monroe are asleep in a car inspired master storyteller Adam McKay’s new podcast. Realising they all died shortly afterwards, he looks into why the lives of so many Hollywood stars were cut short in the 50s – when a new American dream was emerging and the studio system was collapsing. Hannah Verdier\nToday in Focus\nIs Manchester City’s dominance of English football fair?\nManchester City have added this season’s Premier League title to their collection of honours and are favourites to win the FA Cup and the Champions League. But are they playing fair? Jonathan Liew reports\nCartoon of the day | Ben Jennings\nThe Upside\nA bit of good news to remind you that the world’s not all bad\nSixty-year-old recordings of jazz artists John Coltrane and Eric Dolphy have been discovered in the New York Public Library, and will be released for the first time next month. The unheard audio dates back to Coltrane’s 1961 residency at New York’s Village Gate and has been in lost in the library for decades. The recordings have been compiled into an 80-minute-long album which is to be released on 14 July by Impulse Records.\nThe recordings aren’t just significant because of the music they hold; the performance took place just three years before Dolphy died aged 36, meaning the archive material is a special insight into his and Coltrane’s brief musical partnership. It is the only live recording of the group’s legendary Village Gate performances, and features the only known non-studio recording of the Coltrane classic Africa.\nSign up here for a weekly roundup of The Upside, sent to you every Sunday\nBored at work?\nAnd finally, the Guardian’s puzzles are here to keep you entertained throughout the day – with plenty more on the Guardian’s Puzzles app for iOS and Android. Until Monday.",
  "word_count": 3039,
  "scraped_at": "2026-02-14T12:00:59.801228"
}