{
  "article_id": "2d113305c3fc",
  "url": "https://www.mpnews.com.au/2025/11/24/jones-survives-season-from-hell/",
  "title": "Jones survives season from hell",
  "date": "20251124T061500Z",
  "domain": "mpnews.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "SOCCER\nDAVEY Jones has been to hell and back – on and off the football field.\nHe survived a vicious assault during an indoor soccer match in 2014 that left him in intensive care in the Alfred Hospital with a brain bleed and doubts that he could ever play again.\n“I scored and from the restart this guy ran over and started laying into me. “I couldn’t remember much about it but when I saw the CCTV footage it was completely unprovoked.”\nJones was born in Frankston and started as a junior with Frankston Strikers before switching to Frankston Pines’ under-12s. Pines didn’t have an under-16 side forcing Jones to switch to Baxter until an approach from Billy Armour enticed him to return to Strikers. “That was a fantastic move for me because I was forced to adjust to senior football.”\nHe was just 21 when attacked during that indoor game and later learned that his assailant had a criminal record. Jones had hopes of playing at a higher level but they ended when forced to stay away from any sport for almost 15 months.\nHe returned to Strikers and played in the reserves for a couple of seasons before moving to Seaford United. “I wasn’t 100 percent after my head injury and low on confidence. “I look back on that time now and can see I had an attitude problem. “I was lazy and didn’t commit to training all the time but the rule was you had to train twice to be considered for the seniors. “Then one of my close friends passed away and I just couldn’t keep playing.”\nEventually he pulled the boots back on with Mount Eliza’s Sunday team under Brandt Mulholland. It didn’t take long to realise that he needed a greater challenge so he joined Somerville in the pandemic-hit 2021 season. His next move was to Mount Martha for the 2023 season under Mark Larner. “We had a young team with some pacy players but we didn’t have a lot of stronger-bodied experienced players so I complemented the squad.”\nJones had a good relationship with then Pines head coach Alex Halikias and was only too willing to sign for the Monterey Reserve outfit for the 2025 season. He had no inkling that he’d signed up for the season from hell. Pines won one game in State 4 South and drew two ending up with a negative goal difference of 87. Only two other senior teams throughout State Leagues had worse results.\nFootball Victoria’s league restructure for next year sent Pines tumbling down two leagues to the new State 6 South-East.\n“We were tracking OK at the start of the year but we had a completely new side and no-one really knew each other,” Jones said.\n“The intensity of training though was good and I really enjoyed my time under Alex but when he stepped down it turned into a coaching merry-go-round. “We had some very good players but we were never given the chance to gel.\n“The constant rotation of coaches didn’t give us the chance to adapt to one particular style and the lack of consistency of names on the teamsheet each week certainly didn’t help.”\nThere were times throughout the season that Jones could have taken the easy way out and walked away. Other clubs offered an escape route which he ignored. “I was put in a leadership position at Pines and I took that pretty seriously.\n“I’m the type of person who will try and stick it out to the very end and I had to show my teammates that no matter what I’d still be coming to training and still front up for the games and try my absolute hardest no matter the result. “That leadership role was very important to me and helped me get through the season.”\nJones featured in Pines’ last pre-season game going into the 2025 season. When the final whistle blew at the end of the last round of league games Jones was the only player in a Pines strip who had played in that last pre-season game.\nNo doubt that’s indicative of the commitment new head coach Al Baldwin and assistants Chris Sanderson and Andy McCabe expect from the senior squad they are currently assembling.\nThey’ll be hoping Jones can commit to the cause for a second straight year.\nIn other news Football Victoria has released its State League men’s best and fairest lists and proving that age is no barrier two 37-year-olds dominated the voting in State 2 South-East.\nShane Tagliaferro of Berwick City won the league award and his former Mornington teammate Stevie Elliott now with Peninsula Strikers was runner-up.\nChelsea goal machine James Stinson won the State 4 South best and fairest four votes clear of Somerville Eagles captain Nick Simmons.\nMount Eliza’s Austin Mcewen won the State 5 South award with 15 points while Mount Martha’s Howie Anderson and Seaford United’s Zain Ahman were runners-up just a point behind.\nIn women’s State League Seaford United star Kalista Tzelios won her third straight league best and fairest.\nNot a bad effort considering Tzelios achieved the feat at State 4, State 3 and now State 2 levels.\nShe polled 18 votes, five clear of the runner-up.\nTzelios also was the league Golden Boot winner with 22 goals one more than Aspendale’s Lily Smith.\nIn women’s State 3 South Mount Martha’s Kaho Fushilani tied with Ana Botsioulis of Sandringham for best and fairest honours.\nIn women’s State 4 South Katja Schmidt of Somerville Eagles romped home in the best and fairest with 20 votes, seven clear of the runner-up.\nTeammate Paige Osorio was equal third.\nMeanwhile Baxter assistant coach George Hughes is touring the UK with a teenage squad representing Melbourne Football Stars, an academy run by former Aberdeen and South Melbourne winger George Campbell.\nThe first MFS annual tour was in 2008 and this year’s event involves matches against Aberdeen FC Academy, Hibs, Burnley and Wrexham as well as attending Europa League and English Premier League fixtures.\nFinally this week’s friendly fixtures feature Skye United, Chelsea and Langwarrin.\nSkye hosts Chelsea at Carrum Downs Recreation Reserve on Thursday 27 November at 7.30pm then travels to Reema Reserve on Saturday 29 November to play Hampton Park United at 1pm and 3pm.\nLast Saturday Skye beat Geelong 3-2 at Egan Lee Reserve with 12 triallists on show.\nJust three current senior players were in action – Jason Nowakowski, Emmanual Scarlett and Varmah Mgoneh.\nLangwarrin and Dandenong Thunder intend playing a friendly on Saturday 29 November but Lawton Park isn’t available due to council works.\nThe clubs were arranging an alternative venue as we went to press so check social media for updates.\nLast Saturday Langy lost 1-0 to a UK touring squad.\nThe local side was missing Tom Youngs, Lucas Portelli, Brad Blumenthal and Charlie Fry.\nLangy head coach Jamie Skelly gave game time to the rest of his squad along with triallists and some under-23s.\n“It was a good hit-out with some very positive moments,” Skelly said.\nFirst published in the Mornington News – 25 November 2025",
  "word_count": 1184,
  "scraped_at": "2026-02-14T12:20:47.176180"
}