{
  "article_id": "2d2e9ed75983",
  "url": "https://www.winnipegfreepress.com/canada/2025/12/15/year-in-review-a-look-at-events-in-april-2025",
  "title": "Year in review : A look at events in April 2025 – Winnipeg Free Press",
  "date": "20251215T091500Z",
  "domain": "winnipegfreepress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Year in review: A look at events in April 2025\nAdvertisement\nA look at news events in April 2025:\nRead this article for free:\nor\nAlready have an account? Log in here »\nTo continue reading, please subscribe:\nMonthly Digital Subscription\n$1 per week for 24 weeks*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $4.00 plus GST every four weeks. After 24 weeks, price increases to the regular rate of $19.95 plus GST every four weeks. Offer available to new and qualified returning subscribers only. Cancel any time.\nMonthly Digital Subscription\n$4.99/week*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $19.95 plus GST every four weeks. Cancel any time.\nTo continue reading, please subscribe:\nAdd Free Press access to your Brandon Sun subscription for only an additional\n$1 for the first 4 weeks*\n*Your next subscription payment will increase by $1.00 and you will be charged $16.99 plus GST for four weeks. After four weeks, your payment will increase to $23.99 plus GST every four weeks.\nA look at news events in April 2025:\nRead unlimited articles for free today:\nor\nAlready have an account? Log in here »\nA look at news events in April 2025:\n1 – Markham-Unionville Liberal candidate Paul Chiang left the federal election race following his comments that a political opponent should be turned over to Chinese officials in return for a bounty. The incumbent MP told a Chinese-language newspaper at a news conference three months ago that everyone at the event could claim a bounty on Don Valley North Conservative candidate Joe Tay if they turned him in. Tay is one of six activists targeted by Hong Kong police, which announced rewards of $1,000,000 in Hong Kong currency, which is about $180,000 Canadian, for information leading to their arrests. Meanwhile, the Conservatives dropped nominee Stefan Marquis in a Montreal riding based on some social media posts, and Windsor-area nominee Mark McKenzie was let go after podcast remarks he made in 2022 reportedly supporting “public hangings” and for Justin Trudeau to get the death penalty. Don Patel was axed from the race after engaging with a comment on social media that suggested that some people should be deported to India and dealt with by its prime minister. Lourence Singh is also out but no reason was given.\n1 – Canada’s consumer carbon price is no more. For the first time since the federal carbon levy was imposed in 2019 — consumers will pay $0 on their carbon emissions. The levy had most recently equated to 17.6 cents on each litre of gasoline and about $4 per gigajoule of natural gas burned for home heating. Prime Minister Mark Carney did away with the consumer carbon charge in one of his first actions when he took office last month. The drop should be reflected quickly at the gas pumps, though it may be offset by swings in crude prices.\n1 – The brooding and versatile Val Kilmer, who played fan favourite Iceman in “Top Gun,” donned the cape and cowl as Batman and portrayed Jim Morrison in “The Doors,” died at 65 of pneumonia. He had recovered after a 2014 throat cancer diagnosis that required two tracheotomies. He held a reputation that he was somewhat difficult to work with, a notion he begrudgingly agreed with later in life, but he always defended himself by emphasizing art over commerce.\n2 – New Jersey Democratic Senator Cory Booker held the U.S. Senate floor with a marathon speech that lasted a record 25 hours and five minutes – from Monday evening until Tuesday evening. He set the historic mark to show Democrats’ resistance to the many sweeping actions of President Donald Trump. Booker broke a record set 68 years ago by then-Senator Strom Thurmond to filibuster the advance of the Civil Rights Act in 1957. Booker invoked the late civil-rights leader and congressman John Lewis in his speech, arguing that changing history requires the public to get involved and “cause some good trouble.”\n2 – TSN president Stewart Johnston was named the new CFL commissioner. The league introduced the 54-year-old Toronto native as its 15th commissioner. Johnston joins the CFL after serving as head of The Sports Network since 2010. He succeeds Randy Ambrosie, who announced in October his intention to retire in 2025 once his successor was chosen.\n2 – A federal judge dismissed New York City Mayor Eric Adams’ corruption case. The court granted the Justice Department’s extraordinary request to set aside criminal charges so the mayor could aid U.S. President Donald Trump’s immigration crackdown. The order to dismiss the case “with prejudice” spares Adams from having to govern in a way that pleases Trump or potentially risk having the charges revived. Adams had pleaded not guilty to bribery and other charges.\n3 – The United States imposed 25-per-cent tariffs on all foreign automobile imports. Automaker Stellantis said it would temporarily pause production at an assembly plant in Windsor, Ont. for two weeks as it assesses the effects of the recently announced auto tariffs. The plant produces the Chrysler Pacifica, Chrysler Grand Caravan, and more. Stellantis said it’s also halting work at some of its Mexican assembly operations and this will affect several of its U.S. powertrain and stamping facilities. Operations are set to resume the week of April 21.\n3 – Prime Minister Mark Carney has announced a retaliatory 25-per-cent tariff on imports of American vehicles. Carney says this could generate $8 billion, which would be used to support companies and workers hurt by American auto tariffs that went into effect today. He made the announcement after speaking virtually with the country’s premiers about U.S. President Donald Trump’s latest tariffs.\n3 – “Freedom Convoy” organizers Tamara Lich and Chris Barber were greeted by supporters as they arrived at court to hear the verdict in their case. Lich and Barber were found guilty of mischief for their roles in the 2022 mass protest that paralyzed downtown Ottawa. They were key figures and organizers in the protest that saw hundreds of vehicles and thousands of people protesting the COVID-19 public health mandates that were implemented. Court will reconvene on April 16 to set a sentencing date.\n5 – Books on the Holocaust, histories of feminism, civil rights and racism were among the nearly 400 volumes removed from the U.S. Naval Academy’s library this week. The school was ordered by U.S. Defense Secretary Pete Hegseth’s office to get rid of books that promote diversity, equity and inclusion.\n5 – A Canadian researcher won a 2025 Breakthrough Prize in Life Sciences. Doctor Daniel Drucker discovered the GLP1 hormone used in diabetes and obesity medications – including Ozempic. The endocrinologist and clinician-scientist at the University of Toronto and research institute at Sinai Health, shares the $3-million prize with four colleagues from the United States and Denmark\n6 – A 31-year-old man was facing charges of mischief and uttering threats after an incident at Parliament Hill yesterday. Ottawa police said the man “gained unauthorized access” to the East Block in the afternoon and started making threats once inside. They say he surrendered peacefully after hours of negotiations, noting no one was injured in the incident. Police also said no weapons, explosives or other hazardous materials were discovered.\n6 – Alexander Ovechkin made history by breaking Wayne Gretzky’s NHL career goals record. The Washington Capitals’ captain wired home a shot in the second period against the New York Islanders for his 895th goal of his career. The 39-year-old Russian was mobbed by his teammates after he scored the goal erasing the record that stood for 31 years. Wayne Gretzky was in attendance in New York to watch Ovechkin surpass him.\n7 – Vladimir Guerrero Jr. signed a 14-year, US$500-million deal with the Toronto Blue Jays. It is the third-largest contract in Major League Baseball history.\n8 – The Keystone oil pipeline ruptured in North Dakota. The North Dakota Department of Environmental Quality said an employee working at the site heard a “mechanical bang” this morning before shutting down the pipeline within about two minutes. The cause of the rupture and the volume of crude oil spilled were not immediately clear. A company spokesperson says the spill has been confined to an agricultural field and no people or structures were affected. Canadian regulators say the Keystone pipeline transported an average of 624,000 barrels of crude oil per day in 2024, from Alberta’s oilsands into the United States.\n8 – A Vancouver-based aviation consortium said it’s celebrating the first piloted hydrogen-powered helicopter flight. Calling it a “milestone in sustainable aviation,” Canadian Advanced Air Mobility said Unither Bioelectronique completed the experimental flight at the airport in Bromont, Quebec, last month. In a news release, the federal not-for-profit says the test was completed under an experimental flight permit with 90 per cent of the helicopter’s energy came from hydrogen fuel cells.\n9 – Canada implemented its own retaliatory measures on vehicles imported from the U.S. But unlike the American duties, Canada will not tariff auto parts, or Mexican vehicles and components. Donald Trump’s latest round of tariffs went into full effect at midnight Eastern Time, with a flat rate on most countries and dozens of nations facing even higher import taxes.\n9 – Former Michigan congressman Pete Hoekstra was confirmed as the new United States ambassador to Canada. His U.S. Senate confirmation comes at a fraught time in U.S.-Canada relations thanks in part to U.S. tariffs. Trump has also repeatedly claimed Canada should become part of the United States. But Hoekstra told his confirmation hearing Canada is a sovereign country.\n9 – The latest recordings going into the U.S. Library of Congress include music from a popular video game and a single from a Canadian. The 25 recordings entering the archive this year were chosen for their importance in America’s recorded sound heritage. They include Celine Dion’s 1997 “My Heart Will Go On” from the film “Titanic.” The more unusual additions include the original music for the video game “Minecraft” as well as the reboot sound for Microsoft’s Windows 95 operating system.\n9 – U.S. President Donald Trump backed off on “reciprocal’ tariffs” for several nations, announcing a 90-day pause and lowering rates to 10 per cent, except for China. But he wasn’t offering any changes to the tariffs hitting Canada in his sudden trade-war flip-flop. Canada still faces fentanyl-related U.S. tariffs, as well as American levies on its imports of automobiles, steel and aluminum.\n10 – Canadian filmmaker Ted Kotcheff died at the age of 94 in Mexico while under sedation. The Toronto native’s career spanned about six decades with a wide variety of credits including the 1974 classic “The Apprenticeship of Duddy Kravitz” as well as “First Blood,” and “Weekend at Bernie’s.” More recently he was executive producer for hundreds of episodes of “Law and Order: Special Victims Unit.”\n11 – Health officials in Prince Edward Island identified two cases of measles, the province’s first confirmed infections of the disease since 2013. Officials said the adult patients are Island residents who were unvaccinated against the disease when they travelled together to another part of Canada where measles outbreaks are ongoing. They have since recovered.\n11 – A nurse practitioner at the Hospital for Sick Children won a Gairdner Award for her research helping children and teens manage pain. The Toronto-based Gairdner Foundation said Jennifer Stinson is the first nurse to receive one of the annual awards recognizing scientists around the world. Stinson said it is great to see recognition of the roles that nurses play in medical research. Her research focuses on developing digital tools – from apps to robots – that help kids with chronic pain.\n12 – A twin-engine plane crashed in upstate New York, killing all six people on board. The aircraft was carrying six members of a family of physicians and distinguished student-athletes on a trip to the Catskills for the Passover holiday when it went down in a muddy field in Copake. Among the victims was pilot and neuroscientist Dr. Michael Groff, and his daughter Karenna, a former MIT soccer player named the 2022 NCAA woman of the year.\n13 – U.S. President Donald Trump’s doctor said the oldest man to be elected is “fully fit” to serve as commander-in-chief. In a report released today, Trump’s doctor said his results showed the president had dropped 20 pounds since his last physical as president in 2020. Trump’s cholesterol levels have improved also while his blood pressure was 128 over 74, which is considered elevated.\n13 – Rory McIlroy won the Masters in a playoff to complete a career Grand Slam. McIlroy turned a major collapse into one of his grandest performances of all time, hitting a wedge into 4 feet for birdie in a sudden-death playoff with Justin Rose. He is the sixth player in golf history to claim the career Grand Slam — winning all of the major tournaments within a player’s career.\n13 – Ecuadorean voters re-elected President Daniel Noboa, a Conservative young millionaire with a divisive no-holds-barred crime-fighting record. Opponents have vowed to seek a recount over what’s been described as “grotesque” electoral fraud. Figures released by Ecuador’s National Electoral Council show Noboa received 55.8 per cent of the vote with more than 90 per cent of ballots counted. The win gives Noboa four years to fulfil the promises he first made in 2023, when he stunned voters by winning a snap election and a 16-month presidency.\n14 – A Hamilton-area politician will become the Ontario legislature’s first female Speaker. Donna Skelly has been a member of the legislature since 2018 and has already served as a deputy Speaker. She becomes the 43rd Speaker of Ontario, as longtime MPP Ted Arnott retires after nearly seven years as Speaker. Skelly was a longtime television reporter and news anchor in Hamilton, Ont., and has said she hopes to bring a more professional tone to question period.\n15 – Hungary passed a constitutional amendment to ban LGBTQ+ public events. Legal scholars and critics called the move another step toward authoritarianism by the country’s populist government. The amendment declares that children’s rights in Hungary to moral, physical and spiritual development supersede any right other than the right to life, including that to peacefully assemble. The country’s contentious “child protection” legislation prohibits the “depiction or promotion” of homosexuality to minors under the age of 18.\n16 – Canada’s first professional women’s soccer league officially launched. The Northern Super League’s first game featured the Vancouver Rise hosting the Calgary Wild at B.C. Place. Canadian soccer legend Christine Sinclair is part owner of the Rise.\n17 – A Winnipeg hospital became the first in the country to install a vending machine that offers HIV tests, naloxone kits and condoms for free. The machine at St. Boniface Hospital was made publicly available. The hospital’s ethics director said the machine will also have snacks and seasonal items like mittens in the winter and sunscreen in the summer. Products other than food will come in discreet packaging, in the hopes of reducing judgment and stigma.\n17 – A mass shooting at a Florida university killed two people and wounded at least six others. Police have identified the suspected shooter as the 20-year-old son of a sheriff’s deputy who got a hold of his parent’s weapon. The two deaths were not students at the university, but the shooting suspect was believed to be a student. The suspected shooter was among the people receiving medical attention. Tallahassee’s police chief said officers shot and wounded the shooter after he refused to comply with commands.\n17 – Luigi Mangione, the man accused of gunning down UnitedHealthcare CEO Brian Thompson outside a Manhattan hotel in December, was indicted in a New York court on four charges including a count eligible for the death penalty. A grand jury returned the indictment in Manhattan Federal Court. The charges include stalking, murder and a firearms count and it was not immediately clear when the 26-year-old Mangione will be arraigned. He faces separate federal and state murder charges for the killing.\n18 – Television’s “Dr. Oz” was sworn in as head of the agency responsible for Medicare and Medicaid in the United States. As head of the Centers for Medicare and Medicaid Services, the 64-year-old former heart surgeon and TV talk-show host will manage health insurance programs for roughly half the country. Dr. Mehmet Oz steps into the role as Congress debates cuts to Medicaid, which aids millions of poor and disabled people.\n19 – Russian President Vladimir Putin announced a temporary Easter ceasefire in Ukraine. The Kremlin said the truce is now in effect and will last until midnight following Easter Sunday. In another major development, Russia and Ukraine said they have each swapped hundreds of prisoners. It’s the largest exchange since the Russian full-scale invasion began more than three years ago.\n20 – Canada’s women had to settle for second place at the World Hockey Championships this year. The United States took the gold medal back from Canada with a 4-3 overtime win in the final. Tessa Janecke scored the overtime winner as the U.S. claimed its second world title in three years. The Americans have taken gold 11 times in the tournament’s history, but Canada still leads with 13 championships.\n21 – Pope Francis died at the age of 88 of a cerebral stroke that put him into a coma and led to irreversible heart failure. He was the first Jesuit and the first from the Southern Hemisphere to be elected to the papacy in 2013. The Argentine-born Jorge Mario Bergoglio charmed the world with his humble style and concern for the poor, but alienated conservatives with critiques of capitalism and climate change. Pope Francis last came to Canada in 2022 when he begged forgiveness from Indigenous people. He expressed deep shame and sorrow for past abuses committed by some members of the Roman Catholic Church. Francis, who suffered from chronic lung disease and had part of one lung removed as a young man, was admitted to Rome’s Gemelli hospital on Feb. 14 for a respiratory crisis that developed into double pneumonia. He spent 38 days there, the longest hospitalization of his 12-year papacy. The presiding prelate is Cardinal Joseph Farrell and he will remain in charge until a new pope is elected.\n21 – U.S. Defense Secretary Pete Hegseth reportedly created another Signal messaging chat that included his wife and brother where he shared similar details of a March military airstrike against Yemen’s Houthi militants that were sent in another chain with top Trump administration leaders. The New York Times reported the second chat, and a person familiar with the contents and those who received the messages confirmed it to The Associated Press. That person said the unclassified chat included 13 people. The White House late Sunday dismissed the report as a “non-story,” insisting that no classified information was shared.\n22 – A First Nation in western Manitoba made history by electing its first-ever female chief, and its youngest. It was earlier this month that 25-year-old Tréchelle Bunn was voted into the position of chief of Manitoba’s Birdtail Sioux Dakota Nation. Bunn is also believed to be one of the youngest sitting chiefs in Canada. The Dakota woman was raised in Canada and the U.S., where she played competitive hockey, and later graduated from the University of Manitoba with a degree in criminology and Indigenous studies and is now pursuing a law degree.\n22 – Five former members of Canada’s world junior hockey team pleaded not guilty in their sexual assault trial. Jury selection was underway in the packed London, Ont. courtroom where the players were all dressed in dark suits as they entered their pleas one by one. Dillon Dube, Carter Hart, Michael McLeod, Cal Foote and Alex Formenton were charged with sexual assault early last year in an incident that allegedly took place in June 2018 at a London hotel room. The charges relate to an incident that allegedly occurred as many of the team’s members were in London for a Hockey Canada gala celebrating their gold-medal win at that year’s world junior tournament. McLeod is facing an additional charge of being a party to the offence of sexual assault.\n23 – Air Canada was ordered to pay passengers more than $10 million in damages in a class-action lawsuit. The suit alleged they were charged higher amounts than the ticket price advertised. A justice with the Quebec Court of Appeal says Canada’s largest airline showed “ignorance” when it concluded it was exempt from a provision of the provincial Consumer Protection Act.\n24 – Russia attacked Kyiv with an hours-long barrage of missiles and drones, killing at least nine people and injuring more than 70. It was Russia’s deadliest assault on the Ukrainian capital since last July. It came just as peace efforts are coming to a head. Ukrainian President Volodymyr Zelenskyy said the attack is “one of the most outrageous” as he planned to cut short his official trip to South Africa and return home.\n24 – Authorities said a 30-year-old man was shot dead by police at Canada’s largest airport. Peel Regional Police Chief Nishan Duraiappah said officers were called to the Terminal 1 departures level this morning to resolve a dispute between a group of people who knew one another. Duraiappah said the man pulled a firearm, and three officers shot at the man, who was pronounced dead on the scene. He confirmed it was not an attack on the airport.\n24 – Two people accused of shooting and killing an Ontario Provincial Police officer more than two years ago were found guilty of first-degree murder. Randall McKenzie and Brandi Stewart-Sperry were each charged in the death of 28-year-old Constable Grzegorz Pierzchala. The officer was killed while responding to a report of a vehicle in a ditch near Brantford on Dec. 27, 2022. A jury at the trial in Cayuga handed down the verdict after deliberating for about six hours following a four-week trial.\n25 – Ontario’s Stewart Johnston was officially introduced as the Canadian Football League’s new commissioner. He succeeded Randy Ambrosie, who announced in October his intention to retire in 2025 once his successor was chosen. Johnston had served as president of sports broadcaster TSN since 2010. He told reporters yesterday that his first priority as commissioner will be to speak to league stakeholders and do a lot of listening.\n25 – An Ontario judge declared a mistrial in the sexual assault case of five former members of Canada’s world junior hockey team. The judge declared a mistrial just days into the proceedings without giving reasons for the decision. A new trial will now be held for Michael McLeod, Carter Hart, Alex Formenton, Dillon Dube and Cal Foote. They were charged in connection to an alleged incident that took place in a hotel room seven years ago. All of them have all pleaded not guilty to sexual assault.\n25 – Disgraced former U.S. Representative George Santos was sentenced to over seven years in prison. He sobbed as he heard his 87-month sentence in a New York courtroom. The New York Republican pleaded guilty last summer to federal wire fraud and aggravated identity theft. Santos admitted he deceived donors and stole the identities of nearly a dozen people to fund his congressional campaign. He served less than a year in Congress before being expelled in 2023 after his lies and fraud were uncovered.\n26 – The woman who accused Britain’s Prince Andrew in the Jeffrey Epstein sex trafficking scandal has died. A publicist has confirmed Virginia Giuffre died at a farm in Western Australia. Giuffre had been hospitalized after a serious accident last month. The 41-year-old became an advocate for sex trafficking survivors after emerging as a central figure in Epstein’s prolonged downfall.\n26 – Manitoba’s Progressive Conservatives got a new leader. Former cabinet minister and pro football player Obby Khan was chosen by party members over longtime party board member Wally Daudrich in a narrow race that came down to several decimal points. Khan promoted himself as a big-tent conservative who can grow the party’s support. The Progressive Conservatives have been rebuilding since losing the 2023 provincial election to the New Democrats.\n26 – Eleven people were dead and two dozen more are injured after a vehicle plowed through a Vancouver street festival being staged by the city’s Filipino community. Police say the victims range in age from five to 65. Video posted on social media showed victims and debris strewn across a long stretch of road lined with food trucks. Vancouver Police said 30-year-old Adam Kai-Ji Lo “drove into a crowd” at the street festival and that he was in custody and charged with eight counts of second-degree murder. Police were “confident” the incident was not an act of terrorism because the suspect has a history of mental health issues.\n27 – North Korea confirmed for the first time that it sent troops to Russia to support the country’s war against Ukraine. The country said the deployment was meant to help Russia regain its Kursk region that was seized by Ukrainian forces in a surprise attack last year. The North Korean announcement came two days after Russia said its troops have fully reclaimed the Kursk region, a claim Ukrainian officials have denied.\n27 – Basketball Hall of Famer Dick Barnett died at the age of 88. Barnett played on both New York Knicks championship teams in 1970 and 1973 and reached the Naismith Memorial Basketball Hall of Fame as both a player and member of his college teams. He was chosen for one NBA All-Star Game and was later inducted into the Hall of Fame as a player in 2024.\n27 – Former NBA player Stan Love, the brother of Beach Boys singer Mike Love and the father of Miami Heat player Kevin Love, died at the age of 76. Kevin Love announced his father’s death in an Instagram post, writing “I’m so proud to be your son,” and also that he hoped his dad was proud of him too. Stan Love was selected ninth overall by Baltimore in the 1971 NBA draft, and played four seasons with the Bullets and the Los Angeles Lakers, and also played 12 games for San Antonio in the American Basketball Association.\n28 – Yemen’s Houthi rebels said an alleged U.S. airstrike that hit a prison holding African migrants killed at least 68 people and wounded 47 others. The American military did not acknowledged conducting the strike in Yemen’s Saada governorate, a stronghold of the Houthis.\n28 – A Palestinian diplomat told the United Nations’ top court that Israel is killing and displacing civilians and targeting aid workers in Gaza in a “man-made catastrophe of unprecedented proportions.” Ambassador Ammar Hijazi was speaking at the opening of a week of hearings at the International Court of Justice in The Hague, Netherlands probing Israel’s legal obligations to facilitate aid in the occupied territories. Israel denies deliberately targeting civilians and aid staff.\n28 – Liberal Leader Mark Carney won his seat in his Ottawa riding of Nepean, and the federal Liberals won a minority government. Carney led the Liberals to a fourth mandate. The victory completed one of the biggest comebacks in Canadian history for the Liberals, who just three months ago, were at risk of losing party status in a snap election. But the emergence of Carney and the economic and sovereignty threats from Trump revitalized the party’s support at the expense of the NDP and Bloc Quebecois. Meanwhile, Conservative Leader Pierre Poilievre lost his seat in his Ottawa riding of Carleton. NDP Leader Jagmeet Singh resigned as leader of the party after he lost his seat in the B.C. riding of Burnaby Central. Bloc Quebecois Leader Yves-Francois Blanchet won his Quebec riding of Beloeil-Chambly. Green co-Leader Elizabeth May won her seat in the B.C. riding of Saanich-Gulf Islands, but the party’s other co-Leader Jonathan Pedneault did not win a seat in Montreal.\n29 – The White House said U.S. President Donald Trump was offering American automakers some relief on his 25-per-cent tariffs, after worries they could hurt factories. It’s a significant reversal, as automakers insist that the import taxes would hurt domestic production and increase purchase prices for consumers. A senior Commerce Department official said the administration will offer automakers that finish their vehicles domestically a 15 per cent rebate, offsetting the cost of the tariffs.\n30 – The Professional Women’s Hockey League announced its expansion into Seattle next season, creating an eight-team league. The news comes just a week after the PWHL said it will also have a new team in Vancouver. The original six clubs are in Toronto, Montreal, Ottawa, Boston, New York and St. Paul, Minnesota.\n30 – Green Party co-leader Jonathan Pedneault stepped down. Pedneault resigned effective immediately after he did not win a seat in Montreal. Liberal cabinet minister Rachel Bendayan won the riding of Outremont for the fourth time. The Greens secured only one seat in the federal election that saw Mark Carney lead the Liberals to a fourth mandate.",
  "word_count": 4883,
  "scraped_at": "2026-02-14T12:44:08.735267"
}