{
  "article_id": "2d7083bd765d",
  "url": "https://www.euronews.com/business/2024/03/12/manchester-united-reports-rising-profits-driven-by-champions-league-participation",
  "title": "Manchester United reports rising profits driven by Champions League participation",
  "date": "20240312T183000Z",
  "domain": "euronews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The club also announced the completion of a key minority investment by Sir Jim Ratcliffe.\nEnglish football club Manchester United announced their second quarter fiscal year 2024 on Tuesday, clocking in record revenues of £225.8 million (€263.8 million).\nThis was mainly on the back of ongoing robust Matchday turnout, with all teams seeing a record number of supporters in attendance. Benefits driven by UEFA Champions League participation also contributed to this figure.\nThe club saw operating profits of £27.5 million in the last quarter of 2023, as well as a net income of £20.4 million. Basic earnings per share was 12.49 pence.\n“We delivered strong revenues during the first half of the fiscal year and have reiterated our guidance for record revenues for the full fiscal year”, said Cliff Baty, the club's chief financial officer, in a press release.\n“This is an exciting time at Manchester United following the completion of Sir Jim Ratcliffe’s investment and we are all focused on working together with our new co-owners to drive the club forward and deliver success on the pitch,” he added.\nThe club also announced that the minority investment deal by Ratcliffe was now completed, which started with $300 million (€275 million), and then an additional $200 million on completion of the deal. This will give him a 27.7% stake in the club.\nOmar Berrada will also take over as CEO, from interim CEO Patrick Stewart, who took the mantle when Richard Arnold stepped down.\nComing to the fiscal year outlook, Manchester United stood by its earlier guidance of £635 million to £665 million, as well as its earlier adjusted EBITDA guidance of £125 million to £150 million.\nThings may be looking up for Manchester United\nInvestors and football fans alike are hopeful that the club will take a turn for the better with Ratcliffe’s investment and guidance.\nAlthough a minority stakeholder, he will have control over football operations for both the men's and women's teams. This includes overseeing things such as transfer policies and academies.\nHowever, the Glazer family, who began taking over the club in the early 2000s, will still have majority control.\nA large part of Ratcliffe’s investment will also be used to make some much-needed repairs and renovations at the Old Trafford stadium, such as fixing a leaking roof and tackling a mice infestation.\nThe club also revealed that they have come up with a task force for looking at development options for the stadium and surrounding area.\nA lifelong Manchester United fan, Ratcliffe said in a press release that “to become co-owner of Manchester United is a great honour and comes with great responsibility.\n“This marks the completion of the transaction, but just the beginning of our journey to take Manchester United back to the top of English, European and world football, with world-class facilities for our fans.\n“Work to achieve these objectives will accelerate from today.”",
  "word_count": 481,
  "scraped_at": "2026-02-14T12:47:19.799660"
}