{
  "article_id": "2d7198c9536e",
  "url": "https://www.rnz.co.nz/international/pacific-news/516116/pasifika-sipoti-wrap",
  "title": "Pasifika Sipoti wrap",
  "date": "20240506T054500Z",
  "domain": "rnz.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A round-up of results from the big sporting events that took place in the weekend, including Super Rugby, rugby sevens and soccer.\nMoana washed away in Te'ufaiva rain\nThe weather changed on Friday night in Nuku'alofa and all hopes of a Moana Pasifika win were virtually washed away on Saturday.\nThe Highlanders, with two of their own Tongans in their camp, scored a 28-17 win on a water-logged field, watched by close to 10,000 fans.\nBoth teams had expressed their concerns with the Nuku'alofa heat when they arrived in the Kingdom ahead of the first-ever Super Rugby Pacific encounter there.\nHowever, the rain came tumbling down on Friday night as the heavens opened up.\nParts of Nuku'alofa were flooded, even the areas outside the only international-standard rugby field on the main island of Tongatapu.\nWith Crown Prince Tupouto'a 'Ulukalala and his aunt Princess Salote Pilolevu Tuita in the stands, Moana Pasifika started well, hoping to gift their young fans a Fakame or Children's Sunday present.\nBut the Highlanders had other ideas of their own, with Tongan recruits Folau Fakatava and Saula Ma'u, showing a lot of grit and determination in their first international matches at home.\nTwo tries to fullback Jacob Ratumaivuki-Kneepkens helped the Highlanders overcome the wet conditions and a parochial crowd.\nThe visitors adapted better than their hosts, through the boot of first-five Cam Millar, who kicked three second-half penalties to edge his team clear.\nThe result marks the southerners' first back-to-back wins of the season, as they consolidate their position inside the top-eight playoff teams, leapfrogging Fijian Drua into seventh on the competition table.\nImmediately from kickoff, the game was held up several minutes, when Moana Pasifika halfback Jonathan Taumateine was injured trying to make an early tackle against his former Moana Pasifika mate in Timoci Tavatavanawai.\nMoana Pasifika claimed the first points when big Tongan number eight Lotu Inisi bulldozed his way through the defense before fellow Tongan and prop Abraham Pole charged over to score.\nBut from the Highlanders kickoff, replacement halfback Ere Enari could not gather the bounce cleanly and the visitors sent Ratumaitavuki-Kneepkens sliding across the tryline.\nAhead 19-17 at the break, the Highlanders added to their tally when Millar slotted a penalty between the posts.\nMoana Pasifika could not claim anymore points in the second half as the Hihlanders piled on theirs through Millar's boots.\n\"What a game, tough conditions,\" reflected Highlanders captain Billy Harmon. \"We stacked really good moments and that's where we've been struggling over the past couple of weeks.\n\"To be able to do that and grind out a win in these conditions was awesome. So great to be here in Tonga and their first Super game - awesome atmosphere, awesome country, the boys have loved it.\"\nMoana Pasifika captain Sione Havili Talitui told the media after they were disappointed they could not give their fans a win.\nBut he said it was exciting playing at home and they look forward to taking more games back there and to Samoa, where they had played last year.\n\"That was great and we enjoyed coming here. To play here and in front of our home fans was such an honour,\" he said.\n\"We apoligise that we were not able to get a win for our fans and families but we hope to be back again here.\"\nTalitui said the Highlanders used their opportunities well and won in the end.\nThe scorers: Highlanders 28 (Ratumaitavuki-Kneepkens 2, Garden-Bachop tries; Millar 2 conversions & penalty) defeated Moana Pasifika 17 (Pole, Havili tries; Havili 2 conversions & penalty).\nWrong calls cost Drua\nTwo critical calls cost the Fijian Drua their first away win in Canberra on Saturday as the Brumbies hung on to win 28-20.\nThat meant the Drua did not get any point at all from the game, although they held so much possession and rattled their hosts' scrums with devastating drives in the late parts of the first half and within the first 25 minutes of the second spell.\nCaptain Meli Derenalagi turned down a kickable penalty close to the posts in the second half as Drua were piling on the pressure against a retreating Brumbies pack.\nThat kick could have swung the momentum their way, he instead opting to go for the lineout which they could turn into points.\nMinutes later coach Mick Byrne made what many called the biggest blunder of the night when he called for top rake Tevita Ikanivere to be replaced as the Drua pack were bombarding their opponents time and time again.\nIkanivere reluctantly worked off as the coaching team ordered him to leave before the scrum packed down.\nIn went replacement Mesulame Diolokoto, who ran straight in for the scrum pack-down.\nThe Brumbies held their own and turned possession their way - the first after almost 15 scrum feeds that featured a fired up Ikanivere.\nIt turned the momentum the Brumbies way and the rest, as they say, is history.\nByrne did not own up to his fault in calling for that change but instead said it was a frustrating experience for him and the team.\n\"They played well, it was frustrating for the boys out there,\" he said.\n\"It was frustrating for me inside the box so they must've been frustrated out there too. We made some unforced errors in the first couple of minutes, giving away 14 easy points.\"\nHowever, captain Derenalagi owned up and said he had made some wrong calls.\n\"Credit to the boys for the performance,\" he said.\n\"We know we didn't start early while the Brumbies did.\n\"We tried to regroup and go back, but some decisions I made we went with, and the boys backed me with them, so I know this will be a learning curve for us.\"\nWhile the Brumbies took early control, with two quick tries in the opening minutes, Drua came back strongly and held their own for the rest of the first half.\nLen Ikitau and captain Allan Alaalatoa scored tries for the hosts and they led 14-0 early before Drua fly-half Isaiah Armstrong Ravula converted a penalty in the 34th minute of the game to bring them back into the game.\nBut the Brumbies bounced back, with Ikitau scoring his second try to extend their lead.\nTough lock forward Isoa Nasilasila then finished off a good Drua pack drive off a lineout and the teams took the break with Brumbies leading 21-10.\nWhile Drua halfback Peni Matawalu was denied a try after he dived over from a scrum win close to the line, his replacement Simione Kuruvoli finally scored from a similar move.\nHowever, the Brumbies responded again with Luke Reimer placing the ball over the line despite four desperate Drua tacklers hassling him.\nArmstrong-Ravula was only able to claim another three points as time rain out on the Drua, who could have claimed one bonus point if they ended the game with a seven point margin.\nVanuatu lose last match\nVanuatu women's cricket team lost by 70 runs to the United Arab Emirates in their final game at the ICC Women's T20 World Cup Qualifier in Abu Dhabi.\nThe islanders only managed to score 63 runs against UAE's 133 on Friday.\nVanuatu won the toss and decided to bowl.\nICC said UAE needed a win to stay alive in the semi-final race and captain Esha Oza led by example after being put in to bat first.\nOza began the innings emphatically, hitting two boundaries in the opening over. She continued to find the fence regularly, racing to 29 runs off just 20 balls within the Powerplay.\nHowever, her innings was cut short by Rachel Andrew, who also dismissed Khushi Sharma in the same over.\nTheertha Satish and Kavisha Egodage sought to rebuild, putting together a 31-run partnership but Vanessa Vira then struck to remove the latter, courtesy of a stunning one-hand catch from Andrew.\nVanuatu staged a strong comeback in the latter half of the innings, claiming wickets frequently. Nasimana Navaika played a pivotal role, taking three wickets in her final two overs to revive Vanuatu's chances in the game.\nTheertha top-scored for UAE with 44 as they set a target of 134 for Vanuatu.\nIn response, Vanuatu were rocked early by a brilliant spell by Samaira Dharnidharka, who claimed four early wickets to put UAE on top. Khushi added to the pressure with a wicket of her own, leaving Vanuatu reeling at 16 runs for the loss of five wickets within just 7 overs.\nWith boundaries becoming scarce, UAE continued to chip away at the wickets, with Heena Hotchandani and captain Oza getting in on the act.\nStruggling at 37/8, Vanuatu's Gillian Chilia and Vanessa Vira staged a resilient partnership, remaining unbeaten and adding 26 runs to the total without losing further wickets, as they closed their innings at 63/8 after 20 overs.\nUAE's comprehensive 70-run victory significantly boosted their net run rate from 0 to +0.976, and levelled them on points with the Netherlands.\nThe Dutch team holds a net run rate of +1.117 and must either win their upcoming match against Ireland or maintain their net run rate above UAE's to secure a spot in the semi-finals.\nCricket Vanuatu says regardless of the outcome, the tournament was a source of experience and lessons for future the team.\nVanuatu had won their first game against Zimbabwe.\nKaltak helps Mariners win AFC Cup\nVanuatu football star Brian Kaltak has helped the Central Coast Mariners make history with a 1-0 win over Al-Ahed to be crowned AFC Cup Champions in Oman.\nMark Jackson's side become just the second Australian team in history to lift a continental trophy, picking up their second trophy in less than a week, early on Monday morning (NZ Time).\nThe Mariners said Kaltak, who has won his second 'Coach's player of the year award' stood his ground in defense and thwarted many Al-Ahed attacks with partner Dan Hall.\n\"The Mariners saw out the clean sheet to seal a huge, historic win,\" the club's website said.\n\"Throughout the 90 minutes, Dan Hall and Brian Kaltak were both at their very best to block anything Al-Ahed forced into the box, no more so in added time when Erwin got a sight of goal but Kaltak threw his body in the way as he so often does.\"\nAlou Kuol wrote his name into Mariners legend with an 83rd minute winner, squeezing the ball through the legs of Mostafa Matar.\n\"A memorable AFC Cup run, our first ever time in this competition, that has seen us travel over 100,000km, 13 games, ends with a match and a trophy that will never be forgotten,\" Central Mariners said.\n\"The first ever Australian winners and the final ever winners of the AFC Cup.\"\nThe Mariners won the Premier Plate title in the Australian A League Premiership with a win over Adelaide last Tuesday.\nThey now return home to prepare for the Australian A League Premiership semi-finals where they will face Sydney in a home and away series, starting on Friday.\nFijiana claim best finish in Singapore\nThe Fijiana sevens team finished fourth at the weekend's Singapore 7s.\nThey were the best Pasifika team at the three-day, following the disappointing runs by both the Fijian and Samoan men's teams.\nFijiana lost 29-7 to France in the play-off for third and fourth.\nBut coach Saiyasi Fuli said he was happy with how the team performed, achieving their target to make the top eight after pool play.\nThey defeated Japan 12-10 in a tough quarterfinal clash before they went down 33-22 against eventual winners New Zealand in their semi-final clash.\nWith a chance to finish in the top three, the side took on France, who were beaten by Australia in their semi-final match.\nAdi Vani Buleki scored Fijiana's lone try.\nFiji and Samoa 7s men's teams fail\nThe Fijian and Samoan men did not make it past pool play at the Singapore Sevens.\nFiji men finished ninth, staging a comeback to beat Spain 21-12 in the play-off.\nThe win gave Fiji four points on the table and confirmed their place at the Spain Sevens in June.\nThe Fijians finished the normal league at fifth spot, two places lower than what they had claimed in the last four tournaments with ousted coach Ben Gollings.\nUnder new coach Osea Kolinisau the side failed to make it past the quarterfinals at the Hong Kong Sevens last month and for the first time failed to make the last eight in Singapore.\nMeanwhile, Samoa finished 11th after they defeated Canada in the play-off.\nBut that did not help the side from avoiding the promoting relegation series in Spain in a month's time.\nSamoa will have to fight for qualification again as a core team in the annual series.\nThey along with Spain, Canada and USA will face the top teams from the World Sevens Challenger Series.\nThat could include Kenya, Uruguay, Chile, Germany, who are currently the top four teams in that competition.\nNew Zealand and Argentina claim sevens league titles\nNew Zealand came out 31-21 victors against Australia on Sunday night in a straight shootout to be crowned SVNS League Winners 2024 and the first ever women's HSBC SVNS Singapore champions.\nIn a thrilling conclusion to the tightest women's series in history, it all came down to the very last game, contested by the two sides locked on 106 points each at the top of the standings.\nHowever, a depleted Australia could not reply to a ferocious Black Ferns Sevens performance, including a hat-trick from Michaela Blyde, their fourth successive tournament gold confirming their place at the top of the regular season standings.\nThe final tournament of the regular season also brought confirmation of the final standings.\nFrance outshone Fiji for the bronze medal in Singapore to confirm third in the standings, and Great Britain secured eighth spot to fight it out in the Grand Final in Madrid, with Brazil joining Japan, South Africa and Spain to compete in the promotion-relegation tournament.\nHistory was made on a dazzling day of high drama, emotion and all action international rugby sevens at Singapore National Stadium.\nArgentina's men claimed their first ever HSBC SVNS league winners title and New Zealand overcame arch rivals Argentina in an epic women's final to win both the Singapore and SVNS League titles.\nNew Zealand beat Ireland in the men's final to clinch their second consecutive Singapore title.\nArgentina had to dig deep and find a way to win 14-10 over South Africa in the fifth-place play-off, coming back from 10-0 down at the break to secure their first-ever HSBC SVNS series win.\nAs Argentina's celebrations began, it was the All Blacks Sevens who clinched the title in Singapore, defending their trophy from last year and taking their second consecutive gold after victory last time out in Hong Kong.\nThe race for the last Grand Final spot was eventually won by Great Britain after a 26-5 victory over Australia in the bronze medal match.\nUSA had held off a French fightback to win 19-17 in the seventh-place play-off, but Great Britain's win saw them clinch the eighth seeding and send the USA in to the promotion and relegation competition in Madrid.\nThe new look HSBC SVNS 2024 featured seven regular season events in Dubai, Cape Town, Perth, Vancouver, Los Angeles, Hong Kong and Singapore, where the League Winners were decided, before the inaugural Grand Final in Madrid on 31 May to 2 June when the HSBC SVNS 2024 champions will be crowned in the winner takes-all event featuring the top eight teams from the regular season.\nThe event in Madrid will also see the bottom four placed teams from HSBC SVNS 2024 compete with the top four teams from the World Rugby HSBC Sevens Challenger 2024 in a new high stakes promotion and relegation competition.\nAt the conclusion of the Singapore event the eight men's and women's teams who will contest the Grand Final are now confirmed.\nThe men's competition will involve Argentina, Ireland, New Zealand, Australia, France, Fiji, South Africa and Great Britain, while the USA, Spain, Samoa and Canada will contest the promotion and relegation competition.\nThe women's Grand Final teams are New Zealand, Australia, France, USA, Canada, Fiji, Ireland and Great Britain, as Japan, Brazil, South Africa and Spain head into the promotion and relegation competition.",
  "word_count": 2719,
  "scraped_at": "2026-02-14T12:41:50.919837"
}