{
  "article_id": "2d77d408bb3b",
  "url": "https://www.the42.ie/abbie-larkin-interview-6522143-Oct2024/",
  "title": "  I dont really let pressure get to me . It just about enjoying it  ",
  "date": "20241024T080000Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "ABBIE LARKIN HAS been in the spotlight from a young age.\nThe Ireland and Crystal Palace attacker is still only 19, but she has been around for quite some time now.\nLarkin made her senior international debut aged 16 in February 2022, having burst on the scene with Shelbourne, and became Ireland’s youngest major tournament player at last summer’s World Cup.\nIn all, she has won 18 senior caps, and experienced a whirlwind few years of club football from Shels to Shamrock Rovers, and Glasgow City to her new home at Crystal Palace.\nExpectation has followed the Dubliner throughout, but she keeps it at bay. Enjoyment is key.\n“To be honest, I don’t really let pressure get to me,” she tells The 42.\n“I’m just going to focus on me, I’ve got my family and friends to support me. It’s just about enjoying it, I don’t want to lose the enjoyment of it because if I do that then I’m not going to play my best football. You’ve just got to keep that enjoyment.”\nLarkin is speaking on a Zoom call from Tbilisi ahead of Ireland’s Euro 2025 play-off first leg against Georgia on Friday. She discusses the game and Ireland’s aims of reaching a first European Championships next summer, but it’s interesting to hear about her own career trajectory.\nShe left school before finishing her Leaving Cert, enrolled in an FAI/Education and Training Board Player Development course and lived the life of a professional footballer. After making a splash at the World Cup, her hopes of crossing the water materialised when she signed with Glasgow City. But following a fleeting spell in Scotland, she moved to Palace in January.\n“I think it all happened all in one go, but it has definitely all sunk in now. I am just keeping going with my football, enjoying every game that comes and enjoying my training with Crystal Palace and enjoying life, really.\n“Glasgow was definitely a challenge. First time moving away from home, I knew it was going to be tough. I was a bit of a home bird, that definitely played a part in it. You are always going to miss your family, but you know they are only a flight away, so they can always come over and visit.\n“Looking back on it now, it definitely helped me grow as a player and gave me a new perspective on how football is, not just in Ireland. It definitely helped me moving to Palace in growing and developing.”\nHaving her close friend, Izzy Atkinson, and another familiar face, Hayley Nolan, as team-mates helped ease the next transition to South London, and Larkin is relishing the experience to date.\nThe Irish trio helped Palace to Championship glory last season, and they are currently adjusting to life in the Women’s Super League, sitting ninth with four points from five games.\n“Obviously I went there to challenge myself and I think I’m definitely doing that,” she says. “I’m really happy I’m getting more minutes this season and looking for more to come.\n“Everyone knows about the WSL, the standards are really high, it’s way more intense. It’s definitely a big step from the Championship. Our first two games were rocky but it was our first taste of the WSL so you couldn’t really read much [into it]. I think we’re definitely finding our stride now.”\nLarkin is too, getting more game-time from the bench as she meets her pre-season goal of increased minutes, and settling into a rhythm.\nShe will hope for the same with Ireland, having been used sparingly by Eileen Gleeson of late. The Ringsend native made just one substitute appearance in the Euro 2025 group qualifiers, though featured more prominently in the early stages of Gleeson’s tenure.\nOpportunity may arise tomorrow and Tuesday, as Ireland look to clear the facile first play-off hurdle before a crunch showdown against Wales or Slovakia.\nLarkin scored her first — and only — senior international goal away to Georgia in a 9-0 hammering in June 2022. Perhaps a good omen.\n“A little header, it was,” she smiles. “I don’t really score with my head so that was definitely a memorable one. I mean it was amazing to score your first international goal. Honestly, I still think about it to this day… It’s a dream come true, isn’t it?”\nJust like it would be to reach the Euros in Switzerland next summer. What it would mean…\n“Thats all of our dreams. We will just have to work hard, hard work pays off. If we do what we’re here to do and get our jobs done we’ll definitely have a chance of making it.”\nAlbeit off-Broadway and against minnows, the journey continues apace. “We’re just going to focus on ourselves,” Larkin concludes. “We’ll play our best football and not take anything for granted. We will just treat this game like any other.”\n- Georgia v Ireland, Euro 2025 play-off first leg, Mikheil Meskhi II Stadium, KO 5pm Irish time, RTÉ 2.",
  "word_count": 835,
  "scraped_at": "2026-02-14T12:42:54.116222"
}