{
  "article_id": "2d7be286cdb7",
  "url": "https://www.myjoyonline.com/nora-hauptle-the-swiss-coach-reviving-ghanas-black-queens/",
  "title": "Nora Hauptle : The Swiss coach reviving Ghana Black Queens",
  "date": "20240326T191500Z",
  "domain": "myjoyonline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Audio By Carbonatix\nLike a Swiss chocolatier refining the finest cocoa beans from Ghana, Nora Hauptle is on a mission to cultivate the country's raw female talent and take the Black Queens back to the top of African football.\n\"I always tell them that I'm closing the circle because probably the cacao was exported to Switzerland, we add the milk and now I bring back the chocolate,\" the Swiss coach told BBC Sport Africa.\nGhana were once viewed as Nigeria's main challengers for dominance on the continent, qualifying for three Women's World Cups in a row between 1999 and 2007, but then endured a devastating fall from grace.\nThe Black Queens hosted the 2018 Women's Africa Cup of Nations but crashed out at the group stage and the team then failed to even qualify for the 2022 edition in Morocco.\nThey had only played one match in the entirety of 2022 when Hauptle joined late that year, initially as a technical advisor for the Under-20 team at the Women's U20 World Cup.\nShe then took charge of the senior team in January 2023 and transformed the side's fortunes, as the Black Queens won Hauptle's first nine games without conceding - scoring 31 goals in the process.\nIronically, her greatest achievement to date came with her first defeat, which was inflicted in the final round of qualifying for the 2024 Women's Nations Cup.\nHaving beaten Namibia 3-1 in the first leg in Accra, the Black Queens held out for a nervy 1-0 defeat in the return fixture - still enough to take them back to the tournament for the first time in six years, something that brought Hauptle to tears.\n\"I'm also human you know,\" she reflected on the aggregate win.\n\"It was a big pressure and you know you need to deliver. Of course it was a big release.\"\nOverseeing Ghana's return to the finals will be Hauptle's next challenge - but the 40-year-old has plenty of experience to draw on, having trodden a varied path since hanging up her own boots.\nBuilding 'the resilience to survive'\nHauptle had a distinguished career as a defender in Europe and represented Switzerland at international level before retiring in 2009, immediately moving into coaching.\nAfter initially working with youth teams in her homeland, she took her first step into senior management in 2020 with SC Sand in the German Frauen-Bundesliga where she was, at the time, the only female coach in the league.\nIt was there that she first came across African football when attempting to sign Zambia star Barbra Banda.\n\"She was already in China during the Covid season and their league was on hold,\" she said. \"So we put in an offer, but her salary was too high to get her on loan.\"\nHauptle left SC Sand in 2021 and, after a brief stint in Israel, joined a Ghana side, external at arguably their lowest ebb.\nThe state of the Black Queens did not daunt her, proving instead to be extra motivation when learning to adapt to a new environment.\n\"I knew when I jumped in there that I would have the resilience to survive [and] I would learn a lot about myself,\" she said.\n\"For me, the interest behind it maybe sounds ridiculous for others but I learned the most in this whole journey about myself.\"\nHauptle's experience is different from many others. Not only has she coached both in men's and women's football, she has also strayed into other sports.\nShe has an athletics coaching license, has worked in Olympic weightlifting and left football altogether in 2012 to work a personal fitness coach to tennis player Romina Oprandi, who had a career-high ranking of 32, for three years.\nWhile she is now settled in her current job, it took the Swiss trainer time to adapt to Ghanaian culture - to the point where Hauptle needed to be told by a staff member that her focus on details and information was doing more harm than good.\n\"She said 'Nora, how many car signs did you see when you drove into Prampram (a town just east of Accra)?',\" remembered Hauptle.\nWhen none came to mind the team manager continued: \"'You come in and you want to put 10 street signs and cognitively it's too much. You're overloading.' And I needed to reflect a bit and this is why I've learned more than anyone.\"\nSetting a semi-final target\nIt is at this year's Women's Nations Cup where Ghana and Hauptle will face their biggest test yet.\nSince they last played in the showpiece tournament in 2018 the landscape of women's football in Africa has seen a seismic shift. South Africa, Morocco and Zambia have all had excellent continental and World Cup campaigns in the past two years while Ghana were forced to watch from afar.\nThe prospect of breaking into that group does not daunt Hauptle.\n\"We want to come back to the top four of Africa,\" she said, referencing the semi-finals. \"Maybe even win a trophy.\"\nHauptle was given a taste of that challenge last month in Zambia when her tenure as Ghana's head coach hit its first major stumbling block in qualifiers for this year's Olympics in Paris.\nThe Black Queens were winning 3-2 against the hosts in Ndola (and level 3-3 on aggregate) and were seconds away from taking the game into extra-time when Copper Queens captain Banda - the same player Hauptle hoped to sign for Sand - scored a 96th-minute free-kick to end the Olympic dream.\nGhana will get another chance to reclaim their seat at Africa's top table in the next few months, even if they do not yet know exactly when.\nThe Confederation of African Football is continuing to negotiate with world governing body Fifa to find a spot for the Women's Nations Cup in the increasingly busy calendar, with the Olympics in July and August complicating matters.\nWhenever the tournament does kick off in Morocco, the fact that Ghana are hoping to compete for the top prize says a lot about how far they have come under Hauptle.\nLike Swiss chocolate made from Ghanaian cocoa, the taste of victory would be sweet.\nLatest Stories\n-\n‘I wanted to be an architect but ended up as a nurse’ – Diana Hamilton reveals\n33 minutes -\nFrom wards to worship: Diana Hamilton reveals how nursing school shaped her destiny\n50 minutes -\nMahama demands binding deadlines for African reparations\n1 hour -\nThis is not the time to settle political scores – Bawumia to government\n3 hours -\n5 definitive Valentine’s Day gifts to win your lover’s heart in Ghana\n3 hours -\n37% of SHS students exposed to drugs – Opare-Addo\n3 hours -\nNLC secures court injunction against striking tertiary unions\n4 hours -\nWaiting in the Ring: life inside Bukom’s halted boxing scene\n4 hours -\nRed Notice cancellation: OSP official fires back at Ofori-Atta’s lawyers\n4 hours -\nOfori-Atta saga: Red Notice ends after arrest – OSP official clarifies\n5 hours -\nAAG raises alarm over billboard demolitions, calls for presidential intervention\n5 hours -\nHealth Minister to chair probe into ‘No Bed Syndrome’ death; promises system overhaul\n6 hours -\nPrime Insight to tackle ‘galamsey tax’ debate, cocoa reforms and Ayawaso East fallout this Saturday\n6 hours -\nCocoa crisis, galamsey complicity and election credibility to dominate this Saturday’s Newsfile\n7 hours -\nINTERPOL deletes Red Notice for Ofori-Atta as extradition process continues — OSP confirms\n7 hours",
  "word_count": 1247,
  "scraped_at": "2026-02-14T12:31:51.415680"
}