{
  "article_id": "2db11322e27a",
  "url": "https://www.the42.ie/canada-bev-priestman-drone-scandal-6540886-Nov2024/",
  "title": "Canada coach Bev Priestman wont return after drone scandal",
  "date": "20241113T030000Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "CANADIAN WOMEN’S NATIONAL team football coach Bev Priestman and two assistants suspended by Fifa over a drone scandal at the Paris Olympics will not be returning, Canada Soccer announced Tuesday.\nA report released Tuesday by Canada Soccer detailed findings of an investigation into the using of drones to illegally film New Zealand practices at the Paris Olympics.\nThe report found Priestman and assistant coach Jasmine Mander “directed, approved and condoned the actions taken by” assistant coach Joey Lombardi to fly a drone over closed New Zealand practices ahead of Canada’s first match, a 2-1 victory over New Zealand.\nThe three Canadian coaches were sent home and banned for a year by Fifa, and a Canada Soccer statement Tuesday said the trio had effectively been fired.\n“The three individuals currently suspended by Fifa will not be returning,” Canada Soccer said. “The search for a new head coach for the women’s national team will commence shortly.”\nDrone footage was not viewed by players on the Canadian women’s squad, according to the report on the independent external investigation conducted by Sonia Regenbogen, a Toronto attorney.\nThe probe also found no evidence any surveillance was undertaken at the 2021 Tokyo Olympics, where the Canadian women captured a gold medal.\nPotential violations of Canada Soccer’s ethics and conduct code by former Canadian men’s head coach John Herdman were identified and are being examined to see if a greater investigation is warranted.\nThe report found no substantiation of alleged drone use by the men’s team to film a rival’s practice at Copa America.\nCanada Soccer chief executive officer Kevin Blue and president Peter Augruso were unaware of drone surveillance and did not condone such actions, according to the report.\nThe report said some staff and assistant coaches were uncomfortable with spying on opponents but did not feel they could challenge a head coach.\nCanada Soccer’s board of directors is contractually mandating reporting unethical behaviour and ethics training for coaches and staff members and creating an independent audit and compliance committee as a result of the report.\n“The findings of the independent investigator reveal that the drone incident in Paris was a symptom of a past pattern of an unacceptable culture and insufficient oversight within the national teams,” Blue said.\n“This is no longer part of our operations. In fact, the investigation findings strengthen our resolve to continue implementing changes that are needed to improve Canada Soccer, in all respects, and to do so with urgency.\n“We are working to change Canada Soccer into a federation that Canadians trust and are proud of, and one that is not defined by unfortunate actions of the past.”\nIn a joint statement, Blue and Augruso said they are taking disciplinary steps that will be private but reinforce expected conduct with consideration for “specific facts and power dynamics of each situation” — calling it a time of reflection and a turning point.\nPreistman led Canada to a 2-1 victory over Ireland at the 2023 World Cup, but they failed to make it out of the group stages as Australia and Nigeria prevailed.\nBlue admitted Canada may have used a drone to spy on Ireland ahead of that Perth meeting while speaking to The 42 at the Olympics.",
  "word_count": 536,
  "scraped_at": "2026-02-14T12:10:21.597530"
}