{
  "article_id": "2dd13b5b1d45",
  "url": "https://www.theguardian.com/world/2024/apr/09/tuesday-briefing-what-to-expect-from-the-next-phase-of-the-post-office-inquiry",
  "title": "Tuesday briefing : What to expect from the next phase of the Post Office inquiry",
  "date": "20240409T090000Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Good morning.\nIt is, in the words of the prime minister, “one of the greatest miscarriages of justice in our nation’s history”. The Post Office Horizon scandal led to 236 innocent subpostmasters being sent to prison, and more than 4,000 others suffering – whether it be losing jobs, bankruptcy, family breakdowns or homelessness. At least four of those accused have since killed themselves.\nStarting today – 25 years after the first post office operators were convicted for theft, fraud and false accounting that we now know was caused not by them but by the Post Office’s faulty IT system – the former subpostmasters’ stories will be heard at the public inquiry into the scandal.\nAt 10am today Alan Bates – the real life hero of the ITV drama Mr Bates vs the Post Office, in which he is played by Toby Jones – will take the stand at Aldwych House, in central London, and tell the inquiry his story. Then, in the coming weeks and month’s the Post Office’s bosses, including former chief executive Paula Vennells, will be called to give evidence under oath about what they really knew about the faulty Horizon IT system – and, crucially, when.\nFor today’s newsletter, my colleague Jane Croft, who has been covering the scandal since 2018, provides a primer of what to expect. That’s after the headlines, but spoiler alert: expect the sudden onset of “amnesia” to continue, with many ex-bosses saying: “I do not recall.”\nFive big stories\n-\nIsrael-Gaza | David Cameron will set out the UK’s reasoning for continuing to export arms to Israel on Tuesday as ministers face ongoing pressure to disclose the official legal advice on the trade. On Monday evening, the foreign secretary\nheld talks with Donald Trump in Florida amid a push to shore up support for Ukraine. -\nCarers | Ministers are facing calls to abandon the “cruel and nonsensical” fines levied on tens of thousands of unpaid carers for unwittingly breaching earnings rules by just a few pounds a week. The Centre for Social Justice (CSJ), a centre-right thinktank, said the government should accept that it was to blame for allowing overpayments to run up to huge sums.\n-\nFossil fuels | The world’s biggest economies have continued to finance the expansion of fossil fuels in poor countries to the tune of billions of dollars, despite their commitments on the climate. Canada, Japan and South Korea were the biggest sources of such finance in the three years studied, according to campaigning groups Oil Change International (OCI) and Friends of the Earth US.\n-\nHome Office | Families in Gaza have won a legal case against the Home Office after a judge found it had reached “irrational and unreasonable” conclusions to justify its refusal to consider the families’ reunion applications. Two challenges were brought against the government department after it refused to decide on reunion applications from families in Gaza without biometric data.\n-\nPolitics | Downing Street has urged MPs to be cautious when responding to unsolicited messages, after the “spear-phishing” attack that targeted more than a dozen MPs, staff and journalists working in Westminster. On Tuesday evening it was reported that William Wragg, the Conservative MP who divulged colleagues’ personal phone numbers as part of the scandal, had stepped down from two Commons roles.\nIn depth: ‘Their lives have been ruined. You can’t compensate for lost time’\nIt’s a scandal that has been ruining lives across the country for decades, but it only really hit the wider public consciousness when the ITV drama came out over the Christmas holidays. “Suddenly, the Post Office scandal was leading the news bulletins,” Jane says. “And politicians were falling over themselves to talk about how awful it was.”\nLess than a week after the final episode of the drama, Rishi Sunak announced legislation for a new law to “swiftly exonerate and compensate” all the victims. “People who worked hard to serve their communities had their lives and their reputations destroyed through absolutely no fault of their own. The victims must get justice and compensation,” he said on 10 January.\nThe inquiry, chaired by retired high court judge Sir Wyn Williams, has been trying to get to the truth since it launched on 29 September 2020. It is phases five and six, covering “redress”, “oversight” and “whistleblowing”, that begin today.\nWhat has the inquiry heard so far?\n“The impact this scandal has had on thousands of people’s lives has been truly devastating,” Jane says. “These are ordinary people, without money and connections that have been caught up in this real David and Goliath battle.”\nIn personal impact statements to the inquiry, the victims have spoken about losing everything. “It’s not just their money,” Jane says. “It’s their liberty, their partners, their families, their homes. Some spoke about their children being bullied at school, being shunned by their local community, and being referred to as ‘the postmaster who stole old people’s pensions’.”\nJo Hamilton, who ran a post office in a village shop in South Warnborough, Hampshire and was played by Monica Dolan in the TV series, pleaded guilty to false accounting. She had to pay back a supposedly missing £36,000, though the grandmother-of-three did avoid jail. But the trauma continued. One day, while making Easter bonnets at her granddaughter’s school, the headteacher told her she would have to leave the premises as she could not be alone with the children because of her conviction.\n“Jo, and the other subpostmasters, have had or will get compensation,” Jane says. “But their lives have been absolutely ruined. You can’t compensate for lost time, you can’t buy back time.”\nWhat do the post office operators want the inquiry to find out now?\n“They want justice and for the truth to come out,” Jane says. “It feels like the Post Office knew the Horizon IT system wasn’t working properly, but they continued to prosecute these innocent people anyway.”\nThe subpostmasters want to know what Post Office bosses, executives from Fujitsu (the Japanese company that developed the IT software), and government ministers knew about the faulty Horizon system. The judge in a high court case in 2019 concluded that “bugs, errors and defects” meant there was a “material risk” Horizon was to blame for the money missing from post office operators’ accounts.\nPaula Vennells – who was chief executive of the Post Office between 2012 and 2019, for which she earned about £5m – is likely to be asked why she decided to spend millions prosecuting the post office operators when the company was aware of the Horizon problems.\nWho knew what about Horizon – and when?\nWhether the Horizon system could be used to remotely access post office operators’ accounts is key to the scandal, and alleged cover-up.\nIn 2015 the Post Office told a House of Commons inquiry: “There is no functionality in Horizon for either a branch, Post Office or Fujitsu to edit, manipulate or remove transaction data once it has been recorded in a branch’s accounts.” This was untrue, a high court judge ruled in a landmark court case four years later.\nIn fact, staff at Fujitsu were capable of remotely accessing branch accounts, and had “unrestricted and unaudited” access to those systems, the inquiry heard.\nA recording from 2013, unearthed by Channel 4 News, shows Susan Crichton, the Post Office’s head lawyer, confirm that Vennells had been briefed about a “covert operations team” that could remotely access the Horizon system and adjust branches’ accounts. The recordings suggest Vennells was aware of claims that remote access to branch accounts was possible two years before prosecutions were halted against post office operators.\nIn 2015 Vennells told the Commons business select committee that “we have no evidence” of miscarriages of justice.\nVennells, an ordained Anglican priest, refused to comment when Channel 4 News tracked her down at her parish church over the weekend. In a statement released by her lawyers, she said: “I am truly sorry for the devastation caused to the sub-postmasters and their families, whose lives were torn apart by being wrongly accused and wrongly prosecuted as a result of the Horizon system.\n“I now intend to continue to focus on assisting the inquiry and will not make any further public comment until it has concluded.”\nVennells, who has handed back a CBE awarded to her for “services to the Post Office and to charity”, will give evidence, live-streamed here, for three days from Wednesday 22 May.\nIs the public inquiry enough, or should the police be called in?\nNadhim Zahawi, the former chancellor who was one of the MPs questioning Vennells in 2015, has called for a “thorough police investigation”.\n“I don’t think it’s good enough that we keep falling back on ‘let the inquiry do its work’ – this is much more serious,” he said. “There needs to be an investigation into corporate manslaughter and individuals at the Post Office.”\nKevin Hollinrake, the Post Office minister, on Monday told a group of 50 post office operators who reconvened at the village hall in Fenny Compton (where they founded the Justice for Subpostmasters Alliance campaign group in 2009) that those responsible “should go to jail”.\n“People should be prosecuted,” he said. “That’s my view. And I think you and other people I’ve spoken to certainly feel that people within the Post Office and possibly further afield should go to jail.”\nWhat else we’ve been reading\n-\nHow much coffee is too much? According to the latest Well Actually column, anything more than four shots might be pushing it – although it’s surprisingly good for your liver. Toby Moses, head of newsletters\n-\nThis fact stopped me in my tracks: more than 200 Indian elephants have been killed in collisions with trains in the past 10 years. Amrit Dhillon reports on schemes to install AI-enabled surveillance systems to alert train drivers of elephants near the lines, and to build banana tree-lined flyovers to help the animals cross more safely. Rupert\n-\nMany a parent was excited by the promise of some free childcare for two-year-olds – but as Rhiannon Lucy Cosslett found, the rollout is going about as smoothly as you’d expect from the current government. Toby\n-\nDrinking and festivals had always gone hand in hand for the Guardian’s Laura Snapes (and, quite frankly, most people). So how hard would it be to attempt to go to one sober? “I can’t say that the delight in having succeeded is necessarily as good as going on Glastonbury’s ferris wheel razzed at 5am, but it is pretty great. And you’ll remember it.” Rupert\n-\nRachel Dixon offers up 30 ways to get more vorfreude into your life. I shan’t spoil what that means – and instead will allow you the anticipatory joy of waiting for the webpage to load. Toby\nSport\nFootball | Everton have been dragged closer to a first relegation in 73 years after being deducted two points for breaching Premier League profitability and sustainability rules (PSR) up to 2023. An independent commission imposed the sanction with immediate effect after the financially troubled club admitted breaching PSR by £16.6m for the three-year period ending June 2023.\nCricket | Harry Brook lit up a rain-soaked round of Championship matches with an audacious unbeaten 100 in 69 balls for Yorkshire against Leicestershire. Essex top the Division One table after beating Nottinghamshire by 254 runs, while Sussex nearly forced victory at Hove, reducing Northamptonshire to 170 for nine.\nFootball | Euro 2022-winning captain Leah Williamson, who missed the World Cup with an ACL injury, is set to make her first England start in almost a year. Williamson will start against the Republic of Ireland on Tuesday night in England’s second Euro 2025 qualifier. The Arsenal defender last played for England in a 2-0 friendly loss to Australia last April.\nThe front pages\nThe Guardian leads with “Starmer told to resurrect Sure Start to help poorest”. The Times reports “Labour set to close non-dom loopholes”, while the Financial Times says “Labour tightens screw on non-doms in plan to fund key election pledges”. The Mirror puts it simply as “We’ll punish tax dodgers”.\nElsewhere, the Mail reports “Record surge in £150,000 council fat-cats”. The Telegraph quotes an NHS report as saying “‘Children must not be rushed to transition’”. Finally, the Sun carries a picture of boxer Ricky Hatton and Coronation Street star Claire Sweeney, with the headline “Ricky and Claire hit it off”.\nToday in Focus\nThe devil walking on Earth\nAnnie Kelly reports on the story of Sosa Henkoma, who was exploited by drug gangs as a child and now mentors young people at risk of gang violence.\nCartoon of the day | Ben Jennings\nThe Upside\nA bit of good news to remind you that the world’s not all bad\nWhat began life as a Facebook group in 2016 where women sold food and products, has grown into a series of burgeoning Mexico City markets – and become a crucial voice in a country still beset with issues of gender inequality and femicide.\nThe Mercaditas Feministas – or feminist markets – can be found at locations across the Mexican capital, run by an estimated 600 women and offering not only goods such as jewellery, crafts and clothes but “knowledge and services tailored to individual needs, from menstrual healthcare to psychological assistance or legal services”, says human rights advocate Mar Cruz.\nFor the likes of Laura López, who trades in soft toys and handmade jewellery, the mercaditas are more than simply an income, but an essential community in a country where women spend two-thirds of time on domestic chores or childcare duties, and more than 3,000 women are murdered each year. “The political act of putting ourselves on the streets makes me feel I am not alone,” López says. “On the streets, we are all one.”\nSign up here for a weekly roundup of The Upside, sent to you every Sunday\nBored at work?\nAnd finally, the Guardian’s puzzles are here to keep you entertained throughout the day. Until tomorrow.",
  "word_count": 2338,
  "scraped_at": "2026-02-14T13:01:30.703586"
}