{
  "article_id": "2df89feca913",
  "url": "https://www.nytimes.com/athletic/6826588/2025/11/21/paramount-champions-league-rights-tnt/",
  "title": "Paramount game - changing Champions League deal : What does it mean for fans ? What happens to TNT ? ",
  "date": "20251121T201500Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Motivation to become a Paramount+ subscriber in the UK used to be focused on Pierce Brosnan’s dubious Irish accent in MobLand and Kevin Costner’s interminable battles to stay alive on Yellowstone’s Dutton Ranch.\nBig names and big dramas but from the summer of 2027, there will be a different attraction to what was previously considered a modest platform.\nAdvertisement\nParamount+ was confirmed as the new home of Champions League coverage in the UK, ending UEFA’s long partnership with TNT Sports.\nWinning the auction for UK rights between 2027 and 2031 is a signal of intent from the US streamer that few saw coming. The Athletic examines the key questions in a significant shift to the sports-rights market.\nWhat has happened?\nThis was UEFA’s big opportunity for revenue growth, an “intensely competitive tender process” of TV rights for its club competitions across the five main European markets; France, Germany, Spain, Italy and the UK.\nPackages spanning four seasons were offered to the highest bidder this week and there was a surprise newcomer striking two huge deals. Paramount+ landed the main Champions League rights in both the UK and Germany, introducing itself to a new audience of sports fans in Europe.\nAmazon Prime retained a market share with its first picks on a Tuesday in the UK and Wednesday in Italy and Germany, but TNT Sports — so long the lead broadcast partner for UEFA in the UK — missed out entirely. Sky Sports, which has not featured European football in its offerings since 2015, will take over coverage of both the Europa League and Europa Conference League from 2027-28. The BBC, meanwhile, retained its Champions League highlights package.\nThe result across the five big territories was an uplift of more than 20 per cent, with the annual value of those combined deals rising from approximately €2billion (£1.76bn, $2.3bn) a year to almost €2.5bn (£2.2bn, $2.88bn). The previous deal covering the UK, worth almost £1bn over a three-year period, has also seen a significant rise.\n“This demand underscores the outstanding appeal and strength of the UEFA men’s club competitions and the new league format,” said a statement from UC3, the new working partnership between UEFA and European Football Clubs (EFC).\nAdvertisement\nWhy is Paramount moving for sports rights? Has it purchased any others?\n“It’s very simple,” says Paolo Pescatore, a media and telecoms analyst with over 30 years of experience. “Sports and particularly live sports, is the last genre that really drives people to tune in and drives value, which is people buying subscriptions.”\nAnd this is Paramount’s opening play in Europe. In the same year that has seen Disney+ become the home for the Women’s Champions League across the continent, Paramount is the latest streaming platform to have invested into football. And this is more of a splash than dipping toes in the water.\nParamount’s latest rights acquisitions come three months after a gigantic seven-year deal was agreed with UFC. That outlay was worth $7.7billion and will see Paramount+ stream all of its fights in the U.S..\nThe Champions League deals for the UK and Germany are dwarfed by the UFC agreement but both serve the same purpose of driving up subscriptions in a world where Paramount has opted to aggressively challenge rival platforms, including Netflix and Disney.\nIt is not without risk.\n“A return on this investment is very uncertain in Europe,” says Francois Godard, senior media and telecoms analyst of Enders Analysis. “They are trying to beef up Paramount+ but is this enough to make a difference? TNT was never profitable. They are close to break-even now but not profitable after 12 or 13 years, even with the Premier League and the initial backing of BT. It will be challenging.”\nDoes Paramount have all of the Champions League rights?\nNo, but this expands its reach.\nParamount has developed a long association with the Champions League in the US through the CBS commercial network and in 2022, struck a six-year deal beginning with the 2024-25 season ahead of competition from Amazon. The Athletic previously reported that to be worth $1.5bn, $250m per season, and also includes rights to the Europa League and Europa Conference League.\nAdvertisement\nParamount’s successful bid for the UK rights over a four-year period is another significant step, as was a move into the German market to usurp DAZN as Champions League rights holders. DAZN will retain rights for the Europa League and Conference League in Germany but, as with TNT Sports, it was a bruising defeat.\nParamount also explored the opportunity to pick up rights packages in the other main European territories but was eventually unsuccessful. Canal+ held firm in France, along with Telefonica in Spain and Sky in Italy.\nParamount owns the Champions League rights in the U.S. Has it been successful there?\nA partnership that began in 2020 has been of clear value to Paramount. Coverage on CBS has been fronted by presenter Kate Abdo alongside pundits Jamie Carragher, Thierry Henry and Micah Richards, creating viral moments that have travelled far beyond its U.S. audience.\nCBS says its Champions League coverage during the 2023-24 season generated more than 3.5 billion video views across social media, with output coming from its Champions League Today and The Golazo Show.\nAnd there has been tangible value, too. Even in a market where football is not considered the greatest draw, Paramount has said the Champions League has been a “top five” driver of subscriptions through much of its partnership with UEFA.\nParamount has known success in the U.S. with the Champions League, enough to convince it to now try its hand in European markets.\nWill this mean having to take on another subscription? How much will it cost?\n“It’s a disaster for fans,” says Pescatore.\nAlmost a year after Amazon’s exit from the Premier League market meant only two subscriptions were needed for UK supporters to watch the English top flight, another provider will arrive in 2027-28 to increase costs.\nAny viewer wishing to see all available action in the Premier League and Champions League will, in theory, need a subscription to Sky Sports, TNT Sports and Paramount+. Amazon Prime’s retention of a first pick in each matchday round ensures that four packages will be required if every last kick is to be watched.\nAdvertisement\nParamount+ monthly subscriptions currently cost between £4.99 and £10.99 in the UK but that will inevitably rise to cover the cost of buying Champions League rights. TNT Sports, meanwhile, will be forced into reducing prices, currently £30.99 a month, if it is to stand any hope of keeping customers in the post-Champions League era. The only guarantee for the 2027-28 season is that viewers will need to broaden horizons once more.\n“This has thrown a spanner in the works,” adds Pescatore. “Users are going to have to sign up to another unknown entity, go through all the process and there’s no linear channel for it right now. It’s a nightmare for fans and if illegal streaming wasn’t a problem before, and it definitely was, it will only proliferate now.”\nWhat will happen to TNT Sports? And could Paramount end up owning it anyway?\nTNT attempted to put on a brave face once word it had lost out began to leak on Thursday evening. “Ultimately we remained committed to the approach that made financial sense for our business, and our customers,” a company spokesperson said in a statement.\nMake no mistake, though, this has hurt TNT.\nInitially as BT Sport before its rebrand to TNT Sport in the summer of 2023, this is a broadcaster that has aligned itself with UEFA competitions. It made itself known as the home of Champions League coverage in the UK, leveraging that USP to build up a sizeable subscriber base. Within two years, though, even rights to the Europa League and Europa Conference League will have been lost, handed on to Sky Sports, its long-standing rival in the UK market.\nTNT will remain a place to watch 52 Premier League games each season until 2028-29, as well as the FA Cup to the same point, but it is unlikely to be enough. The asset has been hugely devalued this week. Significant rights held in other sports such as cricket, including England’s current Ashes tour of Australia, will not cut it.\nBut, and this is a big but, there could yet be a twist.\nParamount Skydance, the media conglomerate, is currently in talks to buy Warner Bros. Discovery (WBD), TNT’s parent company. That could see two Hollywood studios, Paramount and Warner come together, as well as a host of channels including CBS, CNN and HBO.\nAdvertisement\nA deal is not guaranteed amid rival interest from Comcast and Netflix but Paramount, led by David Ellison, son of the world’s second-richest man Larry Ellison and ally of Donald Trump, are considered favourites.\n“TNT is in a black hole of uncertainty because who will buy Warner?” asks Godard. “If Warner is bought then a new owner will have to do something with TNT. Will they keep it? Will they sell it? TNT as a broadcaster only has one pack of Premier League games and that’s not viable. There are many layers of uncertainty.”\nWill UEFA — and by extension the clubs — be happy with this outcome?\nThere is little doubt that this is a victory for UC3, the body that formally united UEFA and European Football Clubs (EFC) to manage commercial rights around European club competitions.\nJoining forces with Relevent Football Partners — an entity working under the Relevent umbrella held by U.S. billionaire Stephen Ross — it has secured more than a 20 per cent increase in broadcast revenues from Europe’s big five markets at the first time working together. UEFA had previously worked with TEAM marketing for 35 years, until the two split in February of this year.\nA new working partnership between UC3 and Relevent had explored the potential to bring in one global partner for Champions League rights but it was decided the time was right to retain traditional broadcast partners, like Canal+ in France and Telefonica in Spain, alongside an introduction to newcomers to the European market, like Paramount.\n“Relevent were clever enough to bring the threat of a global streamer buying one pack, building this as a threat to existing broadcasters, putting pressure on them and, in the end, getting more money,” explains Godard. “It looks like a success in a market that has been depressed for almost 10 years.”\nWinning this season’s Champions League could be worth as much as £145million to one club but that figure will be higher still when the 2027-28 season begins. The last 48 hours, and Paramount’s increased involvement, have seen to that.",
  "word_count": 1784,
  "scraped_at": "2026-02-14T12:50:56.470043"
}