{
  "article_id": "2dfe876d1957",
  "url": "https://www.collingwoodfc.com.au/news/1928771/collingwood-announces-aflw-list-changes",
  "title": "Collingwood announces AFLW list changes",
  "date": "20251112T074500Z",
  "domain": "collingwoodfc.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Collingwood Football Club thanks Muireann Atkinson, Mikayla Hyde, Selena Karlson, Nell Morris-Dalton and Charlotte Taylor for their contributions to the Club, after informing them they will not be offered contracts for 2026.\nHailing from Monaghan in Ireland, Atkinson joined the Pies as a rookie in 2023 following a stint as a train-on player with Sydney’s AFLW team. Atkinson made her AFLW debut against the Swans in the season opener last year and since featured in all but six games in her Collingwood career.\nAfter spending four seasons with the Western Bulldogs, Morris-Dalton crossed to the Pies in 2023 and made an immediate impact, kicking eight majors in her 10 appearances. Sidelined for the 2024 season due to a back injury, the forward featured in eight games in 2025.\nHyde became a Pie during the 2023 trade period after four seasons and 29 games for the Fremantle Dockers. The 22-year-old donned the black and white for the first time in the final match of the side’s 2024 campaign and has since featured in all but two games in 2025.\nKarlson joined the Magpies in 2023 through the side's VFLW team after spending two years with St Kilda and a year with the Western Bulldogs. Karlson has played nine games in the black and white at the top level.\nTaylor was selected with pick 30 in the 2022 AFLW National Draft but was unfortunately sidelined for majority of the past two seasons due to a foot injury. Taylor returned to the field in the final game of the 2025 home and away season against Brisbane.\nCollingwood Executive General Manager of Women’s Football Jess Burger thanked the group for their time in the black and white.\n“On behalf of the Club, we want to acknowledge the impact these five women have made throughout their time within our program,” Burger said.\n“For Muireann and Mik, moving away from home is a significant challenge, and we are extremely proud of how they have embraced the opportunity and grown as individuals.\n“This season has highlighted the resilience of Selena, Nell and Charlotte as they all faced and overcame adversity to return to the field this season.\n“We appreciate each individual's contributions to the program and the roles they have played within our four walls.\n“We recognise this stage of the season is always challenging, and we sincerely wish each of them the best in their next endeavours.”",
  "word_count": 402,
  "scraped_at": "2026-02-14T13:33:07.830229"
}