{
  "article_id": "2e1be9e9c165",
  "url": "https://www.thecourier.com.au/story/8710245/ballarat-city-dominates-caroline-spring-george-cross-with-6-1-win/",
  "title": "Ballarat City dominates Caroline Spring George Cross with 6 - 1 win | The Courier",
  "date": "20240729T061500Z",
  "domain": "thecourier.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "STATE LEAGUE 1\nBallarat City 6 d Caroline Springs George Cross 1\nSubscribe now for unlimited access.\nor signup to continue reading\nA hat-trick from Tayte Fraser has the was the perfect antidote for the cold as she led Ballarat City's State League women to a massive 6-1 win on Sunday afternoon.\nFraser was everywhere as she and her teammates put together their most complete game of the season, scoring three times in each half to secure the full points.\nFraser's hat-trick as well as goals to Amy Whiting, Mabel Blake and Eve Righetti capped off the perfect day for the home side.\nWith Avondale the runaway leader of the competition, the rest of the league is tightly bunched and while City remains in sixth position on the table, it finds itself just four points adrift of the third placed team.\nJust four match remain in the season as City looks to make every post a winner. Should it get the result against fourth-placed Craigieburn City on the road, it could make a late charge for a top three finish on the table and potential promotion.\nSTATE LEAGUE 1\nBallarat City 2 drew Brimbank Stallions 2\nAfter three weeks without a result, Ballarat City has finally got back into the State League 1 competition with a thrilling 2-2 result against the second-placed Brimbank Stallions on Saturday afternoon.\nGoals to playing-coach Michael Trigger and Zac Francis either side of half time were enough for Ballarat City to grab a much-needed point and remain inside the top six teams.\nIt's been a tough month for Ballarat City with three successive home losses, but they would be pleased to have found their rhythm against one of the best sides in the competition.\nWith five games to play, City sits seven points behind the top two sides but would see themselves as a big chance of getting a win next weekend at home against Upfield. Upfield is eighth on the ladder with 20 points, but did produce an impressive performance at the weekend with a 2-2 draw against top side Whittlesea United.\nSTATE LEAGUE 3\nSebastopol Vikings 4 d Bundoora United 2\nA month of frustrating draws has finally come to an end for the Sebastopol Vikings who have picked up a valuable three points with a victory over Bundoora United.\nAgainst a team ranked one spot above them on the ladder, the Vikings dominated from the outset to record a 4-2 win.\nThe Vikings took the lead in the first half, going in at the break leading 1-0 before the floodgates opened in the second half as Kane Peldys, with two goals, and goals each to Laurance Tombe and Daniel Tinker slammed the door shut on any chance of a Bundoora United making a comeback.\nWhile the Vikings remain in sixth position on the ladder, they now move to within three points of United, but now have a better goal difference.\nNext weekend the Vikings will be looking to continue their winnings ways when they play host to Brunswick Zebras. The Zebras sit second last on the table with just 13 points on the season.\nBallarat SC had a bye in State League 5 and is scheduled to play eighth-ranked Wyndham in the next round.\nBDSA\nVikings and Ballarat North United have reaffirmed their finals credentials with big Friday night wins in the Ballarat District Soccer Association.\nBoth sides scored 4-0 wins, with Vikings too polished for Victoria Park while Ballarat North United was untroubled in a 4-0 win over Ballarat.\nThe other winner of the weekend was Daylesford and Hepburn United who won a tight battle against Maryborough 2-1 while no scores were available from the Creswick versus Bacchus Marsh games\nIn the women's division, Vikings scored a 2-0 upset win over Ballarat, inflicting Ballarat's first loss of the season, while Forest Rangers and Ballarat North United also had convincing wins.\nNeed more sport from The Courier? Check out our WhatsApp channel for stories as they go online, and download our app for breaking news alerts - and daily puzzles",
  "word_count": 678,
  "scraped_at": "2026-02-14T12:18:04.160301"
}