{
  "article_id": "2e3d21035e20",
  "url": "https://www.dw.com/en/uk-election-keir-starmers-labour-set-for-landslide-victory/live-69554777",
  "title": "UK election : Keir Starmer Labour set for landslide victory – DW – 07 / 05 / 2024",
  "date": "20240704T223000Z",
  "domain": "dw.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "UK election: Keir Starmer's Labour wins landslide victory\nPublished July 4, 2024last updated July 5, 2024Starmer is set to become the next Prime Minister of the United Kingdom with his Labour Party securing an absolute majority. For Rishi Sunak's Conservatives, the defeat is historic. Follow DW for more.\nWhat you need to know\n- With almost all seats counted, the center-left Labour Party has gained at least 410 seats\n- Labour leader Sir Keir Starmer set to become next UK Prime Minister\n- Current Prime Minister Rishi Sunak's Conservative Party predicted to win just 118 seats\n- The centrist Liberal Democrats are set to make huge gains\n- Nigel Farage's anti-immigration Reform UK wins four seats\nThis blog has now closed.\nFormer PM Truss loses her seat\nFormer British Prime Minister Liz Truss, a Conservative MP who had represented the constituency of Norfolk South West in eastern England, has lost her seat in Parliament.\nTruss was the UK's shortest-serving prime minister with only 49 days in office. She was replaced by outgoing Prime Minister Rishi Sunak, who has governed for nearly two years.\nThe Conservatives have been in power since 2010 under five different prime ministers and are set to lose government to Labour after suffering a landslide defeat in the UK's general election.\nUK's Labour wins at least 410 seats, 34% of vote\nThe Labour Party has won at least 410 seats as of 0809 UTC with most seats counted in the UK's general election, giving it an absolute majority and making it by far the largest force in parliament. It has won around 33.9% of the vote, according to a provisional count by the BBC public broadcaster.\nThe Conservative Party, which has governed for the past 14 years, had its number of seats drop to 118, giving it a distant second place. The party garnered around 23.7% of the vote.\nThe Liberal Democrats surged to 71 seats and 14.3% of the vote, taking third place from the secessionist Scottish National Party (SNP). The SNP dropped down to 4 seats after Labour overtook it as the largest party in Scotland.\nNigel Farage's right-wing populist Reform UK entered Westminster for the first time with 8 seats and 12.2% of the vote.\nThe center-left Welsh nationalist Plaid Cymru held all 4 of its seats. The Greens also won 4 seats with around 6.8% of the vote.\nWorld leaders congratulate Starmer on landslide win\nWorld leaders congratulated Keir Starmer after his Labour party achieved a landslide result in UK's general election.\n\"Congratulations (Sir Keir) on a comprehensive victory in the UK election,\" Irish Prime Minister Simon Harris said in a post on X, formerly Tiwtter.\n\"I look forward to working with you as close neighbours and friends,\" the Taoiseach, as Ireland's prime minister is known, said.\n\"The relationship between Ireland and the UK is deep and consequential. I look forward to it going from strength to strength.\"\nAustralian Prime Minister Anthony Albanese told reporters that he looks forward to working with Starmer's government.\n\"We have a strong relationship between our two countries, but in Sir Keir Starmer and Angela Rayner and so many others who I am very familiar with in the British Labour Party, I look forward very much to working with them. They have very similar views to us on a range of issues,\" he said.\n\"I'm sure we'll work closely on AUKUS, where we worked very closely as well with the former government.\"\nCanada's head of government, Justin Trudeau, congratulated Starmer on the \"historic\" victory.\n\"Congratulations, @Keir_Starmer, on a historic U.K. election victory. Lots of work ahead to build a more progressive, fair future for people on both sides of the Atlantic. Let's get to it, my friend,\" he said.\nNew Zealand Prime Minister Christopher Luxon congratulated Starmer and thanked outgoing Prime Minister Rishi Sunak.\n\"Congratulations @Keir_Starmer on your election victory. New Zealand and the UK are great friends and can do so much more together. I look forward to working on every opportunity together as prime ministers. Thank you @RishiSunak for your service to your nation and friendship to New Zealand,\" he said.\nStarmer's Labour wins absolute majority\nLabour leader Keir Starmer pledged a \"national renewal\" after has party achieved a landslide victory in the UK's general election.\nWith more than half of seats counted, Labour has gained at least 326. The threshold for a working majority in the House of Commons is 320.\nOutgoing Prime Minister Rishi Sunak's Conservatives have seen their seat share drop down to 131.\n\"Our task is nothing less than renewing the ideas that hold this country together: national renewal,\" Starmer sad.\n\"A mandate like this comes with a great responsibility,\" he said.\n\"We did it,\" he said at a victory party in London. \"Change begins now.\"\nHope is \"shining once again on a country with the opportunity after 14 years to get its future back,\" he said.\n\"The fight for trust is the battle that defines our age,\" he said. \"It is why we've campaigned so hard on demonstrating we are fit for public service.\"\n\"We have to return politics to public service. Show that\npolitics can be a force for good.\"\nRishi Sunak concedes defeat, calls Keir Starmer to congratulate the incoming PM\nBritish Prime Minister Rishi Sunak has conceded defeat and apologized for a poor election result.\nAlthough Sunak retained his seat of Richmond in Yorkshire, his speech following that declaration in his constituency had a somber tone, as he said: \"The British people have delivered a sobering verdict tonight, there is much to learn and I take responsibility for the loss. To the many good, hard-working Conservative candidates who lost tonight, despite their tireless efforts, their local records and delivery, and their dedication to their communities. I am sorry.\"\nHe added that he had called Labour leader Keir Starmer to congratulate him.\n\"On this difficult night, I'd like to express my gratitude to the people of the Richmond and Northallerton constituency for your continued support.\"\nJeremy Corbyn retains seat as an independent\nJeremy Corbyn, the former Labour leader who was expelled from the party amid an antisemitism scandal, has won his seat as an independent.\nCorbyn has represented Islington North for 40 years and won the seat comfortably, albeit for the first time without the Labour affiliation.\n\"This result is to me a resounding message from the people of Islington that they want something different, they want something better,\" Corbyn said.\nNigel Farage elected to UK parliament on eighth attempt\nReform UK's Nigel Farage was finally elected to the UK Parliament on his eighth attempt.\nAlthough he had previously served in the European Parliament, the Brexit campaigner had not previously been elected at a national election.\n\"My plan is to build a mass national movement over the course of the next few years,\" Farage said in his victory speech.\nStarmer says UK voters 'are ready for change'\nLabour leader Keir Starmer said voters \"have spoken and are ready for change\" after an election landslide put him on course to become the next British prime minister.\n\"The change begins right here, because this is your democracy, your community and your future. You have voted. It is now time for us to deliver,\" Starmer said after he was re-elected to his seat in north London.\nScottish National Party expected to hemorrhage seats to Labour\nThe Scottish National Party is forecast to suffer its worst election result in more than a decade, which could hurt its ambitions for an independent Scotland.\nAccording to exit polls, the SNP is on track to win 10 seats, down from the 43 it held going into the election.\nSuch a result would see the SNP overtaken by Labour as the largest party in Scotland.\nFormer SNP leader Nicola Sturgeon said the exit poll was \"at the grimmer end of the expectations\" for the party.\n\"This is seismic for Labour,\" she said. \"There's no getting away from that, it's a massive achievement for Keir Starmer.\"\nThe SNP dominated in Scotland at the last three UK elections, peaking in 2015 when it won 56 seats out of 59.\nReform UK wins first parliamentary seat of 2024 election\nNigel Farage's Reform UK party won its first parliamentary seat in the election with Lee Anderson — who was a Conservative in 2019 — retaining his seat.\nAnderson has won the Ashfield seat while calling the constituency the \"capital of common sense\" in his victory speech.\n\"I want my country back and Ashfield can play their part in that,\" he added.\nFarage says Reform have provoked a 'revolt against establishment'\nNigel Farage claimed to have prompted a \"revolt against the establishment\" after exit polls indicated his Reform UK party may have secured the fourth highest number of seats in the House of Commons.\nReform UK, which is a rebrand of the Brexit Party, was predicted to have secured 13 seats.\n\"This, folks, is huge,\" Farage said in a social media video posted early Friday.\nMillions of votes seem to have switched from Conservatives to Reform, leaving the Tories facing possibly the worst result in a generation or more.\nReform UK predicted to win 'politically seismic' 13 seats\nJust six years after coming into existence as the Brexit Party, the anti-immigration Reform UK party is predicted to become the fourth largest force in parliament with up to 13 seats.\nThe exit poll, where voters are asked who they voted for as they leave the polling station, suggests that millions of people had cast votes for the new party and its leader Nigel Farage.\n\"This is the beginning of a movement,\" Reform's co-deputy leader David Bull told Sky News in the UK, claiming that \"there'll be a new voice in parliament\" and that Reform are \"the true voice of opposition,\" having \"destroyed\" the Conservative Party.\nIt was pointed out to Bull that the Conservatives are still predicted to win ten times as many seats as Reform but the first declared result of the evening did see Reform beat the Tories into third place in the northeastern constituency of Sunderland South.\nWith Reform predicted to win 13 seats, it seems likely that party leader Farage could win in the southeastern constituency of Clacton and finally become a member of parliament at the eighth attempt.\nBen Habib, Reform’s other co-deputy leader, said: “This is politically seismic. This is the beginning of the fight back for the nation state of the United Kingdom.\"\nFirst result of the night called as Labour wins in Houghton and Sunderland South\nIn the race to be the first seat called, the Labour Party's Bridget Phillipson, the shadow education secretary, has secured Houghton and Sunderland South.\nThe result is not a surprise, with it being a hold for the Labour Party.\nReform UK came second.\nLabour Party leader Starmer: 'Thank you'\nLabour Party leader Sir Keir Starmer has issued his first reaction since the exit poll, writing on X (formerly Twitter).\n\"To everyone who has campaigned for Labour in this election, to everyone who voted for us and put their trust in our changed Labour Party – thank you,\" he posted.\nDeputy Labour Party leader Angela Reyner, who would likely become deputy UK Prime Minister, is warning that, while the exit poll is \"very encouraging,\" there is \"nothing to celebrate just yet.\"\nNevertheless, she has praised Starmer for changing the image of the Labour Party and thanked voters for putting their trust in them again after the party's disastrous performance in 2019.\n\"Keir has done a tremendous job in revitalizing the party,\" she told Sky News in the UK.\n\"After 14 years of chaos and decline under the Tories, people want change. Thank you to those who have voted Labour. If the exit poll is correct, it's an honor to have them put their trust in us. We understand the weight on our shoulders, and we want to restore people's trust in politics.\"\n'Difficult moment' for Conservatives, admits minister\nThe UK's incumbent Work and Pensions Secretary (or employment minister), Mel Stride, told BBC Radio 4: \"This is a very difficult moment for the Conservative Party.\"\nHe added that he is \"very sorry\" that the exit poll is projecting that a number of his colleagues will lose their seats.\nOne of them could potentially include the current Chancellor (finance minister) Jeremy Hunt. With the local exit poll in Hunt's constituency projecting only a 19% chance of him winning, Hunt could become for the first Chancellor in modern British history to lose his seat.",
  "word_count": 2081,
  "scraped_at": "2026-02-14T13:01:39.666523"
}