{
  "article_id": "2e40821a03f9",
  "url": "https://www.chicagotribune.com/2025/05/21/bill-belichick-was-always-in-control-then-he-fell-for-jordon-hudson/",
  "title": "Bill Belichick was always in control . Then he fell for 24 - year - old Jordon Hudson . ",
  "date": "20250521T213000Z",
  "domain": "chicagotribune.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "When Bill Belichick appeared on ABC’s “Good Morning America” last week to promote his new book, “The Art of Winning,” the most revealing moment of the interview had nothing to do with his storied NFL coaching career or his new job leading the University of North Carolina at Chapel Hill’s football program.\nIn fact, it was not about Belichick or his book at all. It was about the 73-year-old football coach’s 24-year-old girlfriend.\n“A lot has been made about your relationship with Jordon Hudson,” said the host, Michael Strahan, himself a former NFL star. “It’s been getting a lot of attention.”\nThen he paused to note: “She isn’t here this morning.”\nIn the five months since the University of North Carolina announced it had hired Belichick as its new head football coach, giving him a five-year contract that could be worth more than $50 million, Hudson has been there, standing not behind her man, but more often next to him — if not in front.\nShe was at the UNC news conference announcing Belichick’s hire, at the Super Bowl in New Orleans, at the sidelines of UNC football offseason events and courtside at a UNC basketball game.\nMost notably, she was on set at a “CBS Sunday Morning” interview of Belichick, informing the reporter in a moment captured on camera that he would not be answering a question about how the two had met.\nBelichick shows up for her too. When Hudson competed this month in the Miss Maine USA pageant in a dimly lit Holiday Inn ballroom, Belichick was there, keeping his eye fixed on her every evening-gown-and-bikinied strut.\nWhen she was announced as the second runner-up, a disappointing showing after having been first runner-up last year, she blew kisses at the audience and placed her hands over her heart, not unlike Taylor Swift might at the end of an Eras Tour concert.\nHer boyfriend did not clap — that is not The Belichick Way — but he took her hand after the competition and whisked her away in a Mercedes.\nBelichick should be the most famous person in their relationship. But right now he is a side player in a spectacle that is built on the public’s fascination with young women who date much older, wealthier men and a provocative Instagram account in which Hudson has asserted herself as a partner in full to one of the most successful leaders in the world of professional sports.\nHudson has taken control of the management of his personal brand and used her new status to her own audacious advantage. She has torpedoed an HBO series and attempted to trademark Belichick’s famous catchphrases. On social media, she has posted a steady stream of photos highlighting their romance.\nShe has hobnobbed with celebrities, promoted political causes and somehow amassed a real estate portfolio worth more than $8 million — all to the bewilderment of the coach’s fans and those close to him, many of whom consider her a distraction or worse.\nAnd Hudson has told at least one person that she and Belichick are engaged to be married.\nAt a moment when the world is contending with issues of worrisome consequence, the romantic saga of a famously grumpy NFL coach and a recent college cheerleader is catnip for much of the public and, let’s be honest, reporters too.\nCertainly, many people have questions. Is she only after his money? Is everyone just jealous that a man who happens to be a grandfather has an attractive, young girlfriend? Has Belichick strategically put her on the front line of his own ambition? Or is it, as podcaster Megyn Kelly suggested, “elder abuse”?\nIt is unclear what Hudson’s family thinks. But her father, who is 49, sat next to her boyfriend at the pageant.\nBelichick has built a career based on principles of discipline and ignoring media hype, so the current drama has particularly roiled the worlds of professional and collegiate athletics. Just as Belichick is trying to restart his career after a bitter breakup with the NFL’s New England Patriots, social media scrollers, football fans and the press are focused on how exactly he became so smitten that he has staked his reputation on a woman 49 years his junior.\n“I think it’s ironic that a man who really controlled everything — and I mean everything — now is being controlled by some other person,” said Upton Bell, a former general manager of the Patriots.\n“You can’t just point at the woman here and say, ‘She is being controlling,’” he added. “That only happens if you let yourself be controlled.”\n‘Permissibility of Non-Conformity’\nThe day before Super Bowl LIX in New Orleans in February, dozens of celebrities lined up to walk the red carpet at the annual party hosted by Fanatics, the sports merchandise and trading card company. There was Gayle King, Pete Davidson, Kevin Costner, Martha Stewart and Eli Manning.\nBelichick arrived with his date, Hudson. Dressed in a Carolina T-shirt, he was asked to pose for the phalanx of photographers but declined.\nHudson, however, was game. “I will!” she said, according to a person who attended the party. She stood before the flashbulbs, wearing a long Patriots hoodie as a minidress, paired with knee-high white boots.\nNeither Hudson nor Belichick agreed to be interviewed for this story, and spokespersons for the Patriots, the NFL, and UNC’s athletic department declined to comment.\nBut on social media, Hudson has been less restrained.\nSince she hard-launched their romance on Instagram last year, she has continued to show off their relationship, regardless of the tsunami of public mockery and criticism it has generated.\n“I will not be cyber-bullied into submission,” she wrote online, after posting a photograph of herself dressed like a mermaid with Belichick as a fisherman reeling her in. “I will continue to stand for love, authenticity and permissibility of nonconformity. They can burn me at the stake, but they cannot burn out my light!!”\nShe has been equally persistent in availing herself of professional opportunities created by Belichick’s career — and in making herself a character on the Chapel Hill stage. In January, she posted a photo meant to invoke UNC’s greatest athlete, basketball luminary Michael Jordan, and seemingly inviting Nike to reach out to her for a brand partnership. She appears in a Carolina sweatshirt, with a caption that reads: “Air JordOn 1 coming Fall of 2025. Consider this a formal pitch.”\nOn LinkedIn, she lists her job titles as chief operating officer of Belichick Productions and chief executive officer of Trouble Cub Enterprises. As a producer, she is not off to a strong start.\nThis winter, producers at NFL Films decided that a new season of its sports docuseries, “Hard Knocks,” would focus on Belichick’s efforts to build the UNC football program before the 2025 season. HBO agreed to air it.\nBut days before they were set to announce the series, Hudson demanded she be granted content approval and partial ownership of the show, according to a person familiar with the deal who spoke on the condition of anonymity because they were not authorized by producers to speak to a reporter.\nNFL Films pulled the plug.\nThe producers later learned that Hudson was also in negotiations with another production company, EverWonder, to make a similar series, according to the person familiar with the situation. Ian Orefice, CEO of EverWonder, declined to comment.\nBy spring, Hudson was focused on applying for a slew of trademarks for phrases associated with Belichick’s leadership of the Patriots, including “No Days Off,” and “Do Your Job” — presumably to parlay them into content and merchandising opportunities.\nTrouble is, the Patriots have held the trademarks on these phrases for years. So Hudson took a page from Swift, who rerecorded some of her albums as “(Taylor’s Version)” after her original recordings were sold without her involvement or financial participation.\nHudson applied for trademarks on “No Days Off (Bill’s Version),” and “Do Your Job (Bill’s Version),” among several others.\nHudson’s role in Belichick’s affairs truly exploded into public view last month, when CBS News aired its interview with Belichick. “We’re not talking about this,” she interjected sternly when reporter Tony Dokoupil asked him how the romance began.\nIt was a public relations debacle that continues to reverberate.\nAs the press circled, a podcaster, Pablo Torre, reported that UNC would “ban” Hudson from its football facilities.\nThe university denied this. “While Jordon Hudson is not an employee at the University or Carolina Athletics, she is welcome to the Carolina Football facilities,” the school said in a statement. “Jordon will continue to manage all activities related to Coach Belichick’s personal brand outside of his responsibilities for Carolina Football and the University.”\nBelichick defends Hudson’s involvement. “She’s been terrific through the whole process, and she’s been very helpful to me,” he said in his ABC interview. “She does the business things that don’t relate to North Carolina that come up in my life so I can concentrate on football.”\nBut her assertive tactics are ruffling feathers in Chapel Hill.\nSoon after the university announced to great hoopla that it had hired Belichick, some local T-shirt companies and large athletic wear labels began to sell merchandise with the catchphrase “Chapel Bill.”\nWithin days, at least one local business leader received an email from Hudson warning that “Chapel Bill” was intellectual property, according to a person familiar with the correspondence. Months later, Hudson applied for trademarks on “Chapel Bill” and “Chapel Bill (Bill’s Version).”\nJordon’s version\nHancock, Maine, is a fishing community along a highway that has a small market, a post office and a few roadside seafood shacks.\nIt is where Hudson spent her early days, as her parents tried to keep their mussel and seaweed harvesting company going.\nBy the time Hudson was in high school, the family business had faltered and they moved to Provincetown, Massachusetts. Her freshman year — a year after Belichick won his fourth Super Bowl as head coach — she made the varsity cheerleading team, according to the Nauset Regional High School yearbook. In her senior year, according to an Instagram post, she was simultaneously enrolled in a cosmetology degree program at New England Hair Academy.\nBy the end of her first semester of college at Bridgewater State University, where she studied philosophy and criminal justice, she had earned her cosmetology degree. “I have BIG plans for this upcoming year,” she wrote on Instagram.\nHudson was in college during the COVID-19 pandemic, but by February 2021 she was traveling, and making friends as she did.\nThat month, she and Belichick have said, they met on a JetBlue flight to West Palm Beach, Florida — she calls Feb. 11 their “meetiversary” — and he signed one of her college philosophy books, “Deductive Logic.” Belichick wrote an inscription: “Jordon, Thanks for giving me a course on logic! Safe travels!” His signature included an accounting of his Super Bowl victories with the Patriots: “Bill Belichick SB 36, 38, 39, 49, 51, 53.”\nHudson has not shared publicly when or how her romantic relationship with Belichick began in earnest. But by summer 2023, she was spending time in Foxborough, Massachusetts, where the Patriots are headquartered.\nWhen she attended training camp practices, she often wore red pants at the request of Belichick, so that he might more easily spot her in the crowd, according to a person who knows Belichick and who spoke on the condition of anonymity because Belichick had not given him permission to speak to reporters.\nThat fall, when the Patriots played at Gillette Stadium and stayed at a nearby hotel the night before home games — as mandated by team policy — Hudson frequently joined Belichick there, according to the person who knows Belichick.\nThe team’s record that season was a dismal four wins and 13 losses. Belichick left the team at the season’s end.\nBy last fall, Hudson and Belichick began to emerge as a public couple on social media.\nOn CBS, Belichick said that though there is an official Instagram account in his name, he does not pay much attention to social media. But whoever does oversee his Instagram page added a comment to Hudson’s mermaid-fisherman photo: “My biggest catch!!!”\nA Fisherman’s Daughter\nSince Belichick landed his job with UNC, Hudson has emerged as something of a first lady.\nShe has attended a UNC basketball game, posing courtside wearing a large sweatshirt and white go-go boots. As the football offseason’s activities have geared up, she has walked the stadium sidelines in a long snakeskin-like coat and high heels, huddling at moments with Belichick.\nHudson shared pictures and a video of Belichick lying on his back on a beach in Jupiter, Florida, propelling her into the air, her belly on his feet. The video went viral among sports fans. Ryan McFee, an artist in New Bedford, Massachusetts, was so amused by it that he painted the scene, adding a sign on the beach that reads, “The Patriot Way.”\nHe shared an image of the painting on Instagram and tagged Hudson. She then contacted him and purchased the piece, McFee said. (He said she asked him to change the sign to “The Belichick Way,” which he did.)\nHe named the painting, made with acrylic and spray paint, “Mona Lisa Vito,” a reference to the character from “My Cousin Vinny,” which Hudson told him was the first movie she and Belichick watched together.\nOn Instagram, she implies that their successes are entwined. On their four-year “meetiversary,” Hudson posted an image of Belichick’s hand on her bare skin, with some of his Super Bowl rings visible. Her hand is placed over his, and she is wearing two rings of her own.\nOne commemorates the National Cheerleaders Association championship she won as part of the Bridgewater State University team in 2021. The other is a shiny bauble — what appears to be a pink diamond set next to a white diamond — on her ring finger.\nHudson has been using her new position to lobby for the policies and politicians she favors — primarily issues related to the fishing industry. “As the daughter of displaced fishermen, I care to use my voice to protect the fleeting tradition and heritage of Maine fishing families,” she wrote on Instagram.\n“I speak for the fishermen for the fishermen have no voice,” she wrote in a post.\nAs part of her efforts, Hudson met with Sen. Susan Collins, R-Maine, at her office in Washington, D.C., the senator’s spokesperson said.\nHudson is also dabbling in global politics. When Zoran Milanović was reelected president of Croatia, Hudson posted photos of her and Belichick meeting with him and his aides in Zagreb, Croatia. (Belichick is of Croatian descent and was given an award for representing Croatia in America.)\n“The People of Croatia have given you their sacred vote,” Hudson wrote on Instagram. “We are looking forward to connecting with you again in the quinquennium, Mr. President.”\nMilanović did not respond to a request for comment.\nHudson celebrates those who celebrate her beau, and she disses those who dis him.\nWhen she attended Super Bowl festivities with Belichick, she was photographed ambling around New Orleans wearing an Atlanta Falcons Super Bowl LI shirt. That was the Super Bowl in which the Falcons — who last year declined to hire Belichick — lost to the Patriots in a come-from-behind thriller. As she no doubt anticipated, photographs of her in the shirt made their way around the internet.\nHudson also has fans. “We have a new it-girl on campus,” intoned the narrator of a breathless video created by Hellyeah UNC, an Instagram account that covers the school’s sports culture. “You may know her boyfriend as our new football coach. But Jordon Hudson is the real star moving to Chapel Hill.”\nWhile she is a source of buzz and fascination on the internet, most of those who know her do not want to talk about her — at least not publicly.\nBridgewater State students partying at “Senior Night” at Emma’s Pub and Pizza near campus scurried away when approached by a reporter.\n“We are not allowed to talk about her,” said one member of the cheer squad before walking swiftly to the other side of the bar.\nOne person who had no problem invoking her was the Bridgewater State commencement speaker, telecom billionaire Robert Hale Jr.\nAt the university’s graduation ceremony Friday, held at Gillette Stadium where the Patriots play, he noted with self-deprecation that the students might have hoped for a more esteemed speaker — perhaps a member of the Kraft family, which owns the team, or the current head coach, Mike Vrabel. Or, Hale said, “the old, old, old one, Belichick” who has “very, very, very strong ties with very, very recent alumni.” This got a big laugh.\nHudson attended college through May 2023 but did not earn a degree, according to the university’s spokesperson. Still, she remains a student of philosophy, the very topic that engrossed Belichick on that fateful JetBlue flight four years ago.\n“‘What constitutes love?’ or ‘what makes someone worthy of loving?’” she pondered in a social media post on Valentine’s Day. “With such a limited character count, I cannot dissect nor comprehensively answer these questions, but I will exclaim a few basic concepts.”\nThey included these: “We do not need to justify ‘why’ we love a particular person,” “Love does not discriminate against sex, skin-color, religion, age or ability,” and “Love is not as deep as one’s pockets.”\nThis article originally appeared in The New York Times",
  "word_count": 2922,
  "scraped_at": "2026-02-14T14:16:56.674321"
}