{
  "article_id": "2e5d6b9ce1bb",
  "url": "https://www.hindustantimes.com/india-news/meghalaya-govt-working-to-double-state-s-gdp-make-it-usd-10-billion-economy-governor-101737879842478.html",
  "title": "Meghalaya govt working to double state GDP , make it USD 10 billion economy : Governor",
  "date": "20250126T123000Z",
  "domain": "hindustantimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Meghalaya govt working to double state's GDP, make it USD 10 billion economy: Governor\nMeghalaya govt working to double state's GDP, make it USD 10 billion economy: Governor\nShillong, Meghalaya Governor Chandrashekhar H Vijayashankar on Sunday said his government is working to double the state's GDP and make it a USD 10 billion economy by 2028.\nAddressing the Republic Day function at the Polo Grounds here, Vijayashankar said the state's GDP increased from ₹23,235 crore to ₹53,057 crore in nine years identifying roads, housing, water supply, power, tourism, and IT as key drivers of the growth.\n\"The vision of our government is to make Meghalaya a 10 billion US dollar economy by 2028, by doubling our state's GDP. We are poised towards achieving this goal,\" the governor said.\nHe said, \"Strategies are being developed across sectors, and investments are being mobilised. The GDP of our state increased from ₹23,235 crore in FY15 to ₹53,057 crore in FY24. Key areas like roads, housing, water supply, power, tourism, and IT are driving growth.\"\nOn connectivity, he said the state has built more than 2,500 km of roads under PMGSY in the past five years alone while in the past two years, the state government has sanctioned road works covering 568 km criss-crossing the state connecting north to south and east to west areas of the state.\nThe governor also said that the Centre has recently approved mega projects for improving the road sector with an investment of ₹2,500 crore based on the state's good performance in the road sector.\nOn urban development, Viajayashankar said his government is \"committed\" to making urban spaces more sustainable and dynamic. In line with this, foundation has been laid for the New Secretariat in Mawdiangdiang, Skills Hub, Unity Mall, New Shillong Water Supply Scheme and Sports Infrastructure.\nHe said the Shillong Integrated Command and Control Centre, deploying 328 cameras, will facilitate the coordination of urban service delivery and traffic management.\nAccording to the governor, the state government is also mobilising private investments to promote growth and provide employment to our youth under the Meghalaya State Investment Promotion and Facilitation Act 2024 and the State Industrial Policy where 90 per cent of non-managerial jobs generated in new industries are reserved for local people.\nHe said land banks are being created in full compliance with the provisions of the Meghalaya Transfer of Land Act, 1971 and the laws and rules of the three autonomous district councils to promote growth, without any compromise on the rights of our people.\nThe governor said the state has constructed 1.18 lakh houses under the housing for all scheme till date, out of which 82,995 rural houses were constructed in the last two years alone while 3,097 of the 4,554 sanctioned houses have been completed in urban areas.\nHe also highlighted how the state with fewer than 4,500 functional tap connections in 2019 now boasts of providing clean drinking water under the Jal Jeevan Mission to over 5.29 lakh households.\nThe governor said there is no scheduled load shedding in the state in view of the various measures undertaken by MeECL to improve the power sector in the last five years.\n\"We expect no load shedding in 2025 as well. The government has been able to reduce the aggregated technical and commercial losses from 32 per cent to 16 per cent,\" he said.\nOn tourism, the governor said substantial investments in improving the tourism infrastructure are underway at key tourist locations - work on the Shillong Peak Ropeway Project has been initiated, redevelopment of two projects for MICE infrastructure at Mawkhanu and Umiam lake are under process while around 600 homestays have come up in the state under the Meghalaya Tourism Homestay Scheme.\nHe said the state has been promoting the indigenous products which are ingrained in the identity of the local communities and four more products of Meghalaya received the GI Tag - Meghalaya Garo Textile , Lyrnai Pottery, Meghalaya Chubitchi, and Lakadong Turmeric in 2024.\n\"This certification is a testament to the uniqueness of our local products and the richness of our cultural heritage. The government is also facilitating a GI application for Ryndia that is produced from Ri-Bhoi District and will further boost the production and value of Ryndia,\" he said.\nThe governor said the Meghalaya Early Childhood Development Mission which focuses on the holistic development of children and pregnant/nursing mothers, emphasising motor skills, cognitive growth, health, nutrition, and early education is making significant strides in reducing maternal deaths by over 53 per cent and infant deaths by 40 per cent in the last five years.\n\"Our institutional deliveries have significantly improved due to intervention under the Chief Minister Safe Motherhood Scheme, wherein over 3 lakh pregnant women benefitted from improved transportation, diagnostics and delivery services,\" he said.\n\"To ensure the best possible opportunities for our youth, fostering excellence in sports is central to our youth agenda. Football is deeply rooted in the culture of Meghalaya. To further promote the sport, the government plans to launch Mission Football 2.0, aiming to train athletes, build 100 grassroots infrastructure, and support the development of clubs and academies, creating more than 3,000 direct and indirect jobs through football events,\" he said.\nThis article was generated from an automated news agency feed without modifications to text.",
  "word_count": 881,
  "scraped_at": "2026-02-14T13:20:01.929403"
}