{
  "article_id": "2e5edebddba8",
  "url": "https://www.dmcityview.com/feature-1/2025/02/05/best-of-des-moines-3/",
  "title": "Best of Des Moines",
  "date": "20250205T141500Z",
  "domain": "dmcityview.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Best of Des Moines\n2/5/2025Nearly 14,500 CITYVIEW readers voted these businesses, people, destinations and more as the 2025 Best Of Des Moines.\nThere is a comforting feeling when you walk into a business and are greeted by the iconic black and white Best of Des Moines certificate. Whether it be the winner or one of the runners up, you know you’re about to receive the best food, drink, service or experience inside those doors.\nWith 271 categories and thousands of votes tallied, the Best of Des Moines poll results are in. The readers of CITYVIEW have made their voices heard. Through their collaborative effort, they have determined the best places to eat, drink, shop or visit — not to mention to get your teeth cleaned, your mind sharp, your roof fixed and so much more. The results can be found right here in these pages.\nThe people and businesses chosen as the best are spread throughout the Des Moines metro and are all worth a visit. From the winners to the runners-up, CITYVIEW congratulates you all.\nEATS\nBest New Local Restaurant\nOak Park\nLocated along Ingersoll Avenue, one of Des Moines’ fanciest restaurants can now add, according to the CITYVIEW Best of Des Moines poll, the label Best New Local Restaurant to its growing list of accolades. The chef’s team at Oak Park combines skills developed in New York and Chicago to give metro diners an experience like no other while using crops plucked from its adjacent garden. 3901 Ingersoll Ave., Des Moines, 515-620-2185; www.oakparkdsm.com.\nRunners-up: HiFi Brew Lounge; Zavy Kitchen\nBest-Kept Secret on the Local Restaurant Scene\nSimon’s\nThis makes Simon’s ninth year in a row as the Best-Kept Secret on the Local Restaurant Scene as voted by CITYVIEW readers. That does make you question the secret of it all, but there is no question about Simon’s quality of food, customer service and ability to get customers inside the doors time and time again.\n5800 Franklin Ave., Des Moines, 515-255-3725;\nwww.simonsdsm.com.\nRunners-up: The Pelican Post Bar & Grille; Gastro Grub & Pub\nBest Local Restaurant… Period\nSimon’s\nNine in a row as the Best-Kept Secret and now three in a row as the Best Local Restaurant… Period. Simon’s continues to be a staple in the Des Moines food scene since opening in 1994. Tasty menu items range from apps to entrees, with mushroom crostini, pasta galore, steak deBurgo and more. Don’t forget to pair it all with a bottle of wine from their selection. 5800 Franklin Ave., Des Moines, 515-255-3725; www.simonsdsm.com.\nRunners-up: Gastro Grub & Pub; The Big Steer\nBest Local Fine Dining\nOak Park\nNew on the block and on the mind of CITYVIEW readers, Oak Park, in its first year, wins Best Local Fine Dining, and for good reason. Menu items include an A5 Japanese wagyu steak, pan roasted Rohan duck, decadent desserts such as an eggnog crème brûlée and a delicious selection of wines to pair with any meal of your choosing. 3901 Ingersoll Ave., Des Moines, 515-620-2185; www.oakparkdsm.com.\nRunners-up: Harbinger; Simon’s\nBest Valley Junction Restaurant\nCooper’s on 5th\nFour years on the bounce for Cooper’s on 5th. There is stiff competition in the restaurant scene in Historic Valley Junction, and, according to CITYVIEW readers, Cooper’s continues to be the Best in the district. Sip on an award-winning cocktail while dining on a blackberry jalapeno chicken sandwich or a french onion filet. 227 Fifth St., West Des Moines, 515-255-9895; www.cooperson5th.com.\nRunners-up: Bix & Co.; St. Kilda Collective\nBest West Glen Restaurant\nBanana Leaf\nSelf-labeled as “a modern interpretation of Asian flavors we know the foodies of central Iowa will love,” Banana Leaf has won over the tastebuds of Best of Des Moines voters who say it is the Best West Glenn Restaurant. The restaurant features Thai, Japanese and Chinese dishes that don’t disappoint. Civic Parkway No. 140, West Des Moines, 515-440-0854; www.bananaleafasian.com.\nRunners-up: El Fogon; Irina’s Steak & Seafood\nBest East Village Restaurant\nLucca\nCITYVIEW readers have once again voted for Lucca as the Best East Village Restaurant. Stop by for lunch with excellent sandwich, salad and pasta choices, or enjoy the upscale Italian restaurant’s four-course prix fixe dinner menu. Lucca recently celebrated 20 years in business and continues to offer a welcoming atmosphere to enjoy a Best of Des Moines quality meal. 420 E. Locust St., Des Moines, 515-243-1115; www.luccadsm.com.\nRunners-up: Alba; The Iowa Taproom\nBest Prairie Trail Restaurant\nDistrict 36 Wine Bar & Grille\nWe added this category six years ago and, each year, District 36 has captured the award, annually earning the votes of Prairie Trail diners. Tasteful menu items include area favorites like peppercorn steak deBurgo, blackened salmon sandwich, smoked chicken and jalapeño pasta, salads with house-made dressings and more. 1375 S.W. Vintage Parkway, Ankeny, 515-261-2502;\nwww.district36winebar.com.\nRunners-Up: 30hop; Flavory Bistro\nBest Ingersoll Area Restaurant\nEatery A\nEatery A is Best Ingersoll Area Restaurant once again with its Spanish, Moroccan, Egyptian and Italian tastes throughout its menu. Wood-fired pizza options, Spanish octopus, lamb sliders and chicken shawarma skewers shine at this Ingersoll restaurant that has kept people coming back since 2014. 2932 Ingersoll Ave., Des Moines, 515-282-8085; www.eateryadsm.com.\nRunners-up: Sakari Sushi Lounge; Lachele’s Fine Foods\nBest Beaverdale Area Restaurant\nChristopher’s\nFor more than 50 years, Christopher’s has been serving local residents — and those who know the drive is worth it — excellent Italian American food, earning the establishment another Best of Des Moines award. Whether you’re ordering from the main menu or a special, it’s safe to say an enjoyable meal is on the way. 2816 Beaver Ave., Des Moines, 515-274-3694; www.christophersdsm.com.\nRunners-up: The Dam Pub; Basic Bird\nBest Drake Area Restaurant\nDrake Diner\nSince 1987, the “upscale retro diner” has been family owned and operated. The landmark Drake neighborhood restaurant returns as one of the best places to find homemade comfort food and all-day breakfast. Flavorful omelets, specials like chicken fried steak and eggs or a plate of huevos rancheros are just a few flavorful menu items. 1111 25th St., Des Moines, 515-277-1111;\nwww.drakediner.com.\nRunners-up: Lucky Horse Beer & Burgers; Dough Co. Pizza\nBest Local American Food\nLachele’s Fine Foods\nLachele’s has certainly made its mark on the Des Moines food scene since opening during the COVID-19 pandemic. When your food is good enough to win Best Local American Food and, spoiler alert, Best Local Burger, twice in a row, we think they might be on to something. Their signature smash burger and rotating specials are becoming CITYVIEW readers’ favorites. 2716 Ingersoll Ave., Des Moines, 515-330-6876;\nwww.lacheles.com.\nRunners-up: Gastro Grub & Pub; Drake Diner\nBest Local Vegetarian/Vegan Food\nGastro Grub & Pub\nGastro Grub & Pub made runner-up for Best Local Fine Dining, Best Kept Secret and Best Local American Food, and now cracks the winners list when it comes to Best Local Vegetarian/Vegan Food. Check out the vegan burger or veggie street tacos with house-made corn tortillas, and you will see why it won this award. 1378 E. Hickman Road, Waukee, 515-300-2460; www.gastrogrubpub.com.\nRunners-up: Lucky Lotus; A Dong Restaurant\nBest Local Gluten-Free Food\nDestination Grille\nHealthy menu inclusivity is a priority at Destination Grille, made clear by its extensive list of gluten-friendly options. Check out the menu online or in person to see the lengthy number of options for your gluten-free friends or family. Some of them may surprise you. 2491 E. First St., Grimes, 515-355-1153; www.destinationgrille.com.\nRunners-up: Gastro Grub & Pub; Bar Nico\nBest Local Italian Food\nCosi Cucina Italian Grill\nA runner up last year in this category, Cosi Cucina has been awarded Best Local Italian Food by CITYVIEW readers this go-around. Being in a city like Des Moines with a plethora of flavorful Italian choices, Cosi Cucina stood out, due in part to several pasta options with their house-made sauce, wood-fired pizzas from house-made dough, premium mozzarella and a delightful list of toppings. 1975 N.W. 86th St., Clive, 515-278-8148; www.cosicucina.com.\nRunners-up: Tumea & Sons Restaurant; Noah’s Ark Ristorante\nBest Local Mexican Food\nFiesta Mexican Restaurant\nFiesta Mexican Restaurant has several metro locations including West Des Moines, Pleasant Hill and Adel, all serving up fine Mexican cuisine day in and out. Give their pozole, a tender slow-cooked pork simmered in a rich and flavorful red chile broth, a try, and wash it down with one of their delicious margaritas, like the Festive Fuego with cinnamon and apple. Multiple locations; www.fiestaiowa.com.\nRunners-up: Monterrey Mexican Restaurant; Old West Mexican Restaurant\nBest Local Thai Food\nThai Flavors\nThai Flavors wins the Best Local Thai Food category again in the Best of Des Moines poll, likely for their authentic flavors. They name those flavors by the four Ss: spicy, sweet, sour and salty. Those tastes are evident in dishes such as dynamite wings, tom kha kai, papaya salad, plenty of stir fry options and more. Multiple locations;\nwww.thaiflavorsiowa.com.\nRunners-Up: Cool Basil; Eat Thai, Thai Eatery\nBest Local Chinese Food\nTsing Tsao\nSince opening in 2008, Tsing Tsao has opened several locations, all serving delicious Chinese staples. Enjoy classics such as garlic chicken, hunan beef and sweet and sour pork, and make sure to get an order of egg rolls or crab rangoons, all for an affordable price. Multiple locations; www.tsingtsao.com.\nRunners-up: Shanghai Chinese Restaurant; Lucky Bamboo\nBest Local Japanese Food\nSakari Sushi Lounge\nAnother Ingersoll Avenue mainstay, Sakari Sushi Lounge features a wide array of sushi options from raw fish to cooked. The bar has plenty of beers on tap with local and national favorites and plenty of cocktails to boot. Also, Sakari’s website is consistently updated with specials on food and drink to keep your wallet just as full as you are after a visit. 2605 Ingersoll Ave., Des Moines, 515-288-3381; www.sakarisushilounge.com.\nRunners-up: Wasabi; Akebono 515\nBest Local Mediterranean Food\nFresh Mediterranean Express\nOnce again, CITYVIEW readers have voted Waukee’s Fresh Mediterranean Express as their go to for the fresh and delicious flavors that Mediterranean food has to offer. Try their rice bowls, salads, pita sandwiches, platters or kabobs to feel like you’ve been transported to the Mediterranean coast. 15 N.E. Carefree Lane, Waukee, 515-987-6870; www.orderfreshmed.com.\nRunners-up: The Green Olive; OPA! Italian & Greek\nBest Local Seafood\nWaterfront Seafood Market\nWaterfront continues to dominate this Best of Des Moines category. Metro area diners have been frequenting this restaurant since it opened in 1984. A big reason why is Waterfront flies in fresh product from fishermen and brokers — never processors or wholesalers. Its Ankeny and West Des Moines locations are worth a visit according to CITYVIEW readers. Multiple locations; www.waterfrontseafoodmarket.com.\nRunners-up: Splash Seafood Bar & Grill; Laughing Crab\nBest Local Sushi\nSakari Sushi Lounge\nCITYVIEW readers’ choice for Best Local Japanese food, Sakari Sushi Lounge, is also the choice for Best Local Sushi. Try one of their rolls. From nigiri to sashimi and house maki, to a classic Philly, California or shrimp tempura, the variety of flavors are sure to please. It will take plenty of visits to hit everything on the sushi menu, so don’t wait, and grab a plate soon. 2605 Ingersoll Ave., Des Moines, 515-288-3381; www.sakarisushilounge.com.\nRunners-up: Wasabi; Akebono 515\nBest Local Steakhouse\nThe Big Steer\nThe Big Steer uses naturally aged, certified angus beef for all their cuts, which has helped land them at the top of the Best Local Steakhouse category two years in a row. The steaks are the highlight, but don’t shy away from other staples like prime rib or fried chicken for an all-around satisfying experience. 1715 Adventureland Drive, Altoona, 515-967-6933; www.thebigsteerrestaurant.com/home.\nRunners-up: Iowa Beef Steakhouse; 801 Chophouse\nBest Local Brunch/Breakfast\nEarly Bird Brunch\nMake it three years in a row for Early Bird Brunch as CITYVIEW readers’ choice for Best Local Brunch/Breakfast spot. Early Bird Brunch has creative twists for its breakfast dishes including breakfast sandwiches like the Wonderful Day, with sausage, candied bacon and smoked gouda, or the churro waffle, which is a waffle dressed up as a churro. Hard to beat. Multiple locations; www.earlybirdbrunch.com.\nRunners-up: HomeGrown; Waveland Cafe\nBest Local Delicatessen\nManhattan Deli\nOne of Des Moines’ oldest and longest-running delicatessens also happens to be its best for another year running. Manhattan Deli has sides, salads, homemade soups and desserts to pair with their delicious list of hot and cold original sandwiches, with a different special each day besides Sunday. Grab a bite and see what all the hype is about. 3705 Ingersoll Ave., Des Moines, 515-274-1208; www.hansensmanhattandeli.com.\nRunners-up: Palmer’s Deli; Maccabee’s Kosher Deli\nBest Local Burger\nLachele’s Fine Foods\nLachele’s has earned the most readers’ votes in this category each year since it opened in 2021. Its signature smashburgers have a crispy outside while still being juicy on the inside. Pair it with a unique style of french fry that stays crispy, and it’s no wonder why the Ingersoll darling is soon to expand into Highland Park. 2716 Ingersoll Ave., Des Moines, 515-330-6876; www.lacheles.com.\nRunners-up: B-Bop’s; Zombie Burger + Drink Lab\nBest Local Pizza\nPepp’s Pizzeria\nThe new kid on the block is also the best, according to the Best of Des Moines poll. Pepp’s Pizzeria opened in March of this year and quickly captured the taste buds of pizza aficionados. Pepp’s used to only make 200 pizzas a day, but no longer limits the amount, much to the delight of CITYVIEW readers. Order online, dine in, or by phone. 4640 86th St., Urbandale, 515-675-0564; www.peppspizzeria.com.\n*This has been updated to reflect Pepp’s new location and policies.\nRunners-up: Dough Co. Pizza; The Tavern\nBest Local Bakery\nLa Mie\nCITYVIEW readers continue to vote for, and enjoy, the fluffy, crispy and airy loafs provided by La Mie. While their baked goods are the best according to the voters, don’t skip out on their soups, omelets, pizzas, sandwiches and more. 841 42nd St., Des Moines, 515-255-1625; www.lamiebakery.com.\nRunners-up: ChaCha’s Hiland Bakery; Nash’s Confections\nBest Local Cupcake Shop\nCrème\nThe cupcakes at Crème were a runner up last year but take the cake this time. Crème offers gluten free and vegan cupcakes in addition to the traditional selection, all just as delicious as the last. Stop in to see what is fresh from the oven and grab some cake, milk bread, cookies, or even a cocktail while you’re at it. 543 28th St., Des Moines, 515-288-1050; www.cremecupcake.com.\nRunners-up: Molly’s Cupcakes; ChaCha’s Hiland Bakery\nBest Local BBQ\nSmokey D’s BBQ\nSmokey D’s has been voted the Best Local BBQ for seven years in a row now. “As connoisseurs of flavor, we take pride in crafting the finest barbecue that transcends the ordinary and defines the extraordinary,” says Smokey D’s. The best BBQ CITYVIEW readers say Des Moines has to offer has won national awards and was featured on Food Network’s Diners, Drive-ins and Dives. 5055 N.W. Second Ave., Des Moines, 515-243-2747;\nwww.smokeydsbbq.com.\nRunners-up: Whatcha Smokin’ BBQ & Brew; Kue’d Smokehouse\nBest Local French Fries\nB-Bop’s\nB-Bop’s classic cut french fries are once again the best according to CITYVIEW readers. The local chain keeps its fries crispy and pairs them perfectly with their runner-up Best Local Burger. Ask for a side of ranch or one of their milkshakes, and dip those award-winning fries in either for an affordable meal. Multiple locations; www.b-bops.com.\nRunners-up: 2nd Ave Sandwich; Francie’s Bar & Grill\nBest Local Chicken Wings\nThe Chicken Coop Sports Bar & Grill\nChicken wings make the perfect appetizer or gameday meal. They are great to snack on by yourself or, better yet, with friends. In the Des Moines metro, no one makes them better than The Chicken Coop Sports Bar & Grill, say CITYVIEW readers. Try the honey BBQ for something sweet or the tropical heat jalapeño garlic for some spice. Multiple locations; www.chickencoopurbandale.com.\nRunners-up: Gerri’s Bar & Grill; Sakari Sushi Lounge\nBest Local Nachos\nUniversity Library Cafe\nNachos serve many purposes. They are great to eat solo or shared with friends and perfect for a study time snack or a gameday meal. University Library Café’s nachos have once again been chosen the Best Local Nachos for any of those options. Try their freshly fried flour tortillas topped with pinto beans, shredded cheddar cheese, Monterey cheese sauce, salsa, mild banana pepper rings, pico de gallo, sour cream, and your choice of meat, including cheeseburger, chicken, roast beef, bacon or corned beef. 3506 University Ave., Des Moines, 515-255-0433; https://thelibrarydm.com.\nRunners-up: The Pelican Post Bar & Grille; Smokey D’s BBQ\nBest Local Tacos\nTasty Tacos\nThe hold that Tasty Tacos has over CITYVIEW readers and taco enjoyers appears to be unbreakable. The local Mexican fast-food chain wins this category again thanks to its pillowy flour taco shells filled with either steak, beef, chicken — or beans for you veggie lovers, topped with lettuce and cheese. The homemade hot sauce adds an extra flavorful kick to any of those options. Multiple locations; www.tastytacos.com.\nRunners-up: Tacos La Familia; Faustinos Taqueria\nBest Local Tenderloin\nSmitty’s Tenderloins\nSmitty “sez” “eat a tenderloin,” and that’s exactly what metro residents have been doing since the locally owned restaurant opened in 1952. Smitty’s tenderloins are fried and thin, wonderfully crispy and go great with a milkshake. If you’re looking to mix up the traditional tenderloin experience, the establishment also offers a taco and chili cheese option. 1401 Army Post Road, Des Moines, 515-287-4742; www.smittystenderloin.com.\nRunners-up: The Pelican Post Bar & Grille; Kelly’s Little Nipper\nBest Local Bar Food\nFrancie’s Bar & Grill\nCITYVIEW readers have chosen Francie’s Bar & Grill as the Best Local Bar Food once again. The locally owned and operated southside watering hole has been open since 1987, and filling diners’ bellies ever since with great bar food like their all-American burger, Philly chicken sandwich, spicy hot wings and more. No bar food would be complete without a solid beer to wash it down, and Francie’s has plenty of selections to quench that thirst. 2100 Wakonda View Drive, Des Moines, 515-285-5207; www.franciesbarandgrill.com.\nRunners-up: The Pelican Post Bar & Grille; G. Migs 5th Street Pub\nBest Local Coffee/Coffeehouse\nSmokey Row Coffee Co.\nThe iconic neon sign outside of Smokey Row’s original Des Moines location shows you exactly where the Best Local Coffee/Coffeehouse resides. Smokey Row has expanded over the years to other metro locations, serving up eye-opening, day-starting coffees, lattes, cappuccinos, espressos and more. Multiple locations; www.smokeyrow.com.\nRunners-up: Nothern Vessel; The Slow Down Coffee Co.\nBest Local Wine Selection at a Restaurant\nCooper’s Hawk Winery & Restaurant\nA quick look at Cooper’s Hawk wine selection shows an extensive list of sparkling, rosé, red, white, internationals, sangria and more. The selection is large and tasty. CITYVIEW readers recognize the excellence and voted the establishment the Best Local Wine Selection at a Restaurant. Become a member of the wine club and discover a new wine every month. The Wine O’clock Happy Hour runs from 3-5:30 p.m. Monday through Friday. 12801 University Ave., Clive, 515-513-3330; www.chwinery.com/locations/clive-ia\nRunners-up: Oak Park; Louie’s Wine Dive\nBest Local Hangover Food\nWaveland Cafe\nWaveland Cafe has been serving the metro since 1984. A solid breakfast seems to be many people’s go-to for a hangover cure, and Waveland’s classic breakfast and lunch menu more than delivers, earning CITYVIEW readers’ nod as the Best Local Hangover Food. 4708 University Ave., Des Moines, 515-279-434; www.wavelandcafedsm.com.\nRunners-up: Early Bird Brunch; Mullets\nBest Local First Date Spot\nSakari Sushi Lounge\nAccording to CITYVIEW readers, the best place for Local Japanese Food and Local Sushi is Sakari Sushi Lounge. But that’s not all. It’s also readers’ choice for Best First Date Spot. Order a couple sushi rolls to share with your date and some Sake or custom cocktails from the full bar to break the ice. 2605 Ingersoll Ave., Des Moines, 515-288-3381; www.sakarisushilounge.com.\nRunners-up: Gastro Grub & Pub; Simon’s\nBest Local Restaurant Patio\nThe Pelican Post Bar & Grille\nNot just a place for food and drink, this bar and grill has CITYVIEW readers’ Favorite Restaurant Patio. Nice weather is a hot commodity in Iowa, so when the time comes to enjoy a meal or beverage outside, you enjoy the best. The patio at The Pelican Post has a bar, space for live music and plenty of seating to enjoy a Gallon of Nachos or Blue Lagoon cocktail. 265 50th St., West Des Moines, 515-214-1873; www.thepelicanpostdsm.com.\nRunners-up: Destination Grille; Big Grove Brewery & Taproom\nBest Local Place to Get a Donut\nDonut Hut\nDonut Hut was a runner up in 2024 but takes the top spot in 2025 when it comes to readers’ choice for Best Place to Get a Donut. Their donut-making process can be seen on their website, and we challenge you not to grab your car keys and head over for a dozen delights after watching. From the classics to red velvet, blueberry or even a turnover, a selection from Donut Hut will make you the office or family favorite. 4941 Douglas Ave., Des Moines, 515-331-4205; www.thedonuthutdsm.com\nRunner-up: Hurts Donut Co.; ChuChu Donuts\nBest Local Caterer\nCyd’s Catering\nChef Cyd Koehn offers “extraordinary food. Unforgettable experiences.” Our readers agree once again that Cyd’s Catering is the Best Local Caterer. Use her service for anything from a meal with a loved one to a formal event. 5405 N.W. 78th Court, Johnston, 515-208-2091; www.cateringbycyd.com.\nRunners-up: Destination Grille; Taste! To Go Catering & Events\nBest Local Vietnamese Food\nA Dong Restaurant\nCITYVIEW readers’ Best Local Vietnamese Food once again, A Dong has been serving customers excellent Vietnamese fare since 1989 in the downtown area. With tasteful and authentic soup options, pho that is to die for, and gourmet rice bowls, A Dong doesn’t disappoint.\n1511 High St., Des Moines, 515-284-5632;\nwww.adongrestaurant.com.\nRunners-up: Zavy Kitchen; Pho 515\nBest Local Food Truck\nCharlotte’s Kitchen\nCharlotte’s Kitchen delivers its delightful chicken sandwiches directly to your wedding, office party or event. Book the CITYVIEW readers’ choice for Best Food Truck and try their grilled or fried original chicken sandwich, Nashville, Thai, Barbecue or Crab Rangoon iterations. Appetizers include fried Brussels sprouts, cheese curds and loaded tots. 6150 Merle Hay Road, Johnston, 515-859-6257; www.charlotteskitchendsm.com/food-truck/.\nRunners-up: 2nd Avenue Sandwich; Peggy-O’s Food Truck\nBest Local Chocolate/Candy Store\nChocolatarie Stam\nSatisfy your sweet tooth or pick up a treat for a loved one at CITYVIEW reader’ choice for Best Local Chocolate/Candy Story. Popular items include a Luxe Box packed with chocolatey goodness; Bonboniéres, a box of four or six Stam bonbons; or a simple Stam milk chocolate bar with smooth notes of roasted cocoa bean. Multiple locations; www.stamchocolate.com.\nRunners-up: Chocolate Storybook; Rocky Mountain Chocolate Factory\nBest Local Korean Food\nDZÔ Korean BBQ\nTwo years in business on Ingersoll Avenue and two years of being Des Moines’ Best Local Korean Food, DZÔ Korean BBQ table-top grill has a large selection of meats such as la kalbi, beef bulgogi, filet mignon and sides to build an excellent meal. Don’t forget to order a cocktail from the fully stocked bar to bring your dining experience to another level. 2611 Ingersoll Ave., Des Moines, 515-216-1472; www.dzokoreanbbq.com.\nRunners-up: Basic Bird; What Dak Korean Fried Chicken\nBest Server\nZoey Osteen, Gastro Grub & Pub\nZoey Osteen was a runner up last year and took her serving skills to whole other level this year to capture CITYVIEW’s Best of Des Moines honors as Best Server. A talented server can make a good meal a great one. It might help when you’re serving Gastro’s Best Local Vegetarian/Vegan Food. 1378 E Hickman Road, Waukee, 515-300-2460; www.gastrogrubpub.com.\nRunners-up: Carla Diaz, Early Bird Brunch; Denise Sullivan, Iowa Beef Steakhouse\nBest Local Ice Cream or Gelato Shop\nBlack Cat Ice Cream\nThree years in a row for Black Cat Ice Cream as CITYVIEW readers’ choice for Best Local Ice Cream or Gelato Shop. The store name comes from the owners’ black cat, Boo Bear. There’s no bad luck found here, however, only delicious ice cream. Black Cat is constantly introducing new and exciting flavors to its freezers and their customers. 2511 Cottage Grove Ave., Des Moines, 515-689-7466; www.blackcaticecream.com.\nRunners-up: Home Sweet Cone Ice Cream; Waukee Ice Cream Shoppe\nBest Local Boba Shop\nOcha Bubble Tea & Dessert Cafe\nThis is the second year of the Best Local Boba Shop award, and the category winner is again Ocha Bubble Tea & Dessert Cafe. Ocha says some of their customers’ favorites are their hokkaido milk tea with honey boba, the Lady in Pink (nom yen) and matcha milk tea. Multiple locations, 515-255-3979; www.ochabubbletea.com.\nRunners-up: Zenko Tea; Pho Real Kitchen and Bar\nSHOPPING\nBest Local Store (Overall)\nBing’s\nBada Bing’s bada boom. According to Bing’s, they sell things that make people happy. It certainly made CITYVIEW readers happy enough to vote Bing’s the Best Local Store (Overall). The Valley Junction shop has books, toys, art and more to get someone a fun birthday, Christmas, or just-because gift. 213 Fifth St., West Des Moines, 515-279-3141; www.bingsdsm.com.\nRunners-up: Mint Piercing Studio; Enchantasys\nBest Local Men’s Clothing Store\nMr. B\nFor the ninth year in a row, Mr. B has been voted the Best Local Men’s Clothing Store by CITYVIEW readers. The store helps men get ready for almost any occasion, with suits for weddings and important meetings, business casual garb or denim for when you want to dress down but still look good. 1995 N.W. 86th St., Clive, 515-276-8589; www.mrbclothing.com.\nRunners-up: Fontanelle Supply Co.; Many Hands Thrift Market\nBest Local Women’s Clothing Store\nPop & Nod\nPop & Nod has a little bit of anything you might be looking for on a shopping trip. They have clothing for every season from dresses and rompers to sweaters and knitted items, as well as stationery and home essentials. Drop in to the Roosevelt Shops and be sure to visit CITYVIEW readers’ choice for Best Local Women’s Clothing Store. 833 42nd St, Des Moines; www.popandnod.com.\nRunners-up: Von Maur; Harlow + James\nBest Local Thrift Shop\nMany Hands Thrift Market\nThrifting continues to be one of the favorite types of shopping for those looking to enhance their wardrobe without jaw-dropping prices. And when it comes to the Best Local Thrift Store, CITYVIEW readers say Many Hands is it, with locations in Clive, Grimes, Merle Hay and Indianola. Its stores having recycled more than 2 million items over time. Multiple locations;\nwww.manyhandsthrift.com.\nRunners-up: St. Vincent de Paul of Des Moines; Goodwill of Central Iowa\nBest Ankeny Store\nMint Piercing Studio\nMint Piercing Studio’s ability to blend high quality jewelry with great service makes its Ankeny location the Best Ankeny Store, according to CITYVIEW readers. If there’s a piercing you want, it’s likely they can accommodate you, from the ears to noses, eyebrows, belly buttons and more. Appointments are required for all visits. Multiple locations, Text only, 515-992-9194; www.mintpiercing.com.\nRunners-up: Real Deals; Tanique\nBest Local Frame Shop\nTandem Brick Gallery\nA tale as old as time is Tandem Brick Gallery’s hold over the Best Local Frame Shop category. CITYVIEW readers continue to vote for the long-time metro framing company. They can help you frame art, articles, awards, family photos and almost anything else worthy of hanging on your wall. 2722 Ingersoll Ave., Des Moines, 515-282-1031; www.tandembrickgallery.com.\nRunner-up: Dot’s Gallery & Frame Shop; The Great Frame Up\nBest Local Bridal Shop\nKalon Bridal Studio\nA bride’s wedding day is destined to be one to remember. Kalon Bridal Studio gives brides-to-be a reason to say yes to the dress with styles like Alena Leena, Vagabond, Alyssa Kristin and more. Book an appointment and get the chance to see what you might wear on your special day at the Best Local Bridal Shop, according to CITYVIEW readers. 413 Euclid Ave., Suite 102, Des Moines, 515-220-2085; www.kalonbridalstudio.com.\nRunner-up: Schaffer’s Bridal; Bridal Boutique\nBest Local Tuxedo Shop\nSkeffington’s Formal Wear\nIf you are in search of a tuxedo for your wedding, business event or audition for a Bond movie, Skeffington’s Formal Wear is CITYVIEW readers’ choice for Best Local Tuxedo Shop. The store’s website displays the vast variety available. Browse it to see the varying styles and colors of tuxedos that Skeffington’s has to offer for rent or purchase. Multiple locations; www.skeffingtons.com.\nRunners-up: Schaffer’s Bridal; Mr. B\nBest Local Children’s Store\nJanes – Family Shop\nJanes – Family Shop, CITYVIEW readers’ choice for Best Local Children’s Store, is owned by the mother-daughter combo of Sarah and Jennifer. The duo has kids covered when it comes to clothing and finding a new favorite toy. It has parents covered with supplies they need to take care of the baby, like swaddles and burp cloths. 350 E. Locust St., Suite 102, Des Moines; www.janesdsm.com.\nRunners-up: The Little Book; ROBIN•riley\nBest New Local Store\nKalon Bridal Studio\nKalon Bridal Studio was the Best of Des Moines poll’s top vote-getter for Best New Local Store. It also won Best Local Bridal Shop. Co-owners Annie and Paiton say they became friends while working together in corporate America, which eventually led to the opening of the store. It looks like the shared business venture is panning out so far. 413 Euclid Ave., Suite 102, Des Moines, 515-220-2085; www.kalonbridalstudio.com.\nRunners-up: Pop & Nod; The Little Book\nBest Local Record Store\nJay’s CD & Hobby\nJay’s has plenty of things to offer inside of its stores on the southside, West Des Moines and Merle Hay, but when it comes to the record selection, the shop is the Best according to CITYVIEW readers. Stop in to find your new favorite record or a blast from the past. Multiple locations; www.jaystoysandgames.com.\nRunners-up: Zzz Records; Marv’s Record Shop\nBest Local New or Used Book Store\nReading in Public Bookstore + Cafe\nReading in Public Bookstore + Cafe offers classic coffee and tea favorites while also serving shop staples like the Inkblot or Hive Mind. Peruse the extensive book selection while you sip, and find your next favorite read in the Best of Des Moines Poll’s Best Local New or Used Book Store. 315 Fifth St., Suite 100, West Des Moines, 515-864-9089; www.readinginpublic.com.\nRunners-up: Half Price Books; Beaverdale Books\nBest Local Car Dealership (Domestic)\nStivers Ford Lincoln\nWhether CITYVIEW readers were looking for a new or used domestic car in 2024, they say Stivers Ford Lincoln was the Best Local Car Dealership (Domestic). Since 1980, the automotive dealership has provided metro and Iowa residents with an extensive selection of Fords and Lincolns. 1450 E. Highway 6, Waukee, 1-800-747-2744; www.stivers-waukee-ford.com.\nRunners-up: Willis Automotive; Bob Brown Automotive\nBest Local Car Dealership (Foreign)\nWillis Automotive\nWhen in search of a new foreign vehicle, Willis Automotive’s selection of Infinitis, Jaguars, Land Rovers, Minis and Volvos make it the Best Local Car Dealership (Foreign), CITYVIEW readers say. Schedule regular maintenance and service when that check engine lights comes on, or bring your car to the Auto Spa to freshen up the driving experience. 2121 N.W. 100th St., Des Moines, 515-253-9600; www.willisauto.com.\nRunners-up: BMW of Des Moines; Ramsey Subaru\nBest Local Motorcycle Shop\nBig Barn Harley-Davidson\nDue to adverse weather, central Iowan motorcycle enthusiasts only get a few full months out of the year to get the most of the two-wheeled transporters. At Big Barn Harley-Davidson, you can get rentals, shop online, get some new riding gear, or just tour the show room of what CITYVIEW readers say is the Best Local Motorcycle Shop. 81 N.W. 49th Place, Des Moines, 515-265-4444; www.bigbarnhd.net.\nRunners-up: Mean Machine Cycles; Struthers Bros.\nBest Local Bicycle Shop\nBike World\nCentral Iowa is brimming with bike trails ready to be pedaled upon. There are races and rides held throughout the year and several groups to help you find a community of riders. But, before all that, you need a bike, and CITYVIEW readers say Bike World is the Best Local Bicycle Shop once again. Multiple locations; www.bikeworldiowa.com.\nRunners-up: Kyle’s Bikes; Ichi Bike\nBest Local Liquor Store\nWall to Wall Wine & Spirits\nIt’s no secret that plenty of Iowans like themselves an alcoholic beverage from time to time. Whether it be for watching sports, a tailgate, backyard barbecue, wedding or any other celebration, someone has to provide the drinks. Wall to Wall Wine & Spirits does that the best according to CITYVIEW voters, who declared it the Best Local Liquor Store. 375 S. Jordan Creek Parkway, West Des Moines, 515-341-9900; www.walltowallwine.com/pages/west-des-moines-location.\nRunners-up; Ingersoll Wine & Spirits; Central City Liquors\nBest Local Wine Store\nWall to Wall Wine & Spirits\nWall to Wall Wine and Spirits captures both of the alcohol-related store categories in the Best of Des Moines awards with the addition of Best Local Wine Store. You might get lost browsing their selection of wines. Whatever your tastes, there’s a wall-to-wall selection waiting to choose from. 375 S. Jordan Creek Parkway, West Des Moines, 515-341-9900; www.walltowallwine.com/pages/west-des-moines-location.\nRunners-up: WineStyles; Ingersoll Wine & Spirits\nBest Local Grocery Store\nFareway\nThat’s three years in a row now for Fareway as central Iowa’s Best Local Grocery Store, according to CITYVIEW readers. The first Fareway opened in 1938 in Boone. Since then, the company has expanded across Iowa and into several neighboring states with more than 140 stores. And, with more than 12,000 employees, Fareway is one of the top 10 employers in Iowa. Multiple locations; www.fareway.com.\nRunners-up: Hy-Vee; Gateway Market\nBest Local Jewelry Store\nJosephs Jewelers\nAt Josephs, you can have prized possessions, from rings to watches and more, cleaned, checked or repaired. With a selection of bracelets, earrings, necklaces and rings, Josephs is the ideal location when gift shopping for a loved one, or if you’re looking to treat yourself. When it comes to jewelry shopping, CITYVIEW readers say Josephs is the Best Local Jewelry Store. 5425 Mills Civic Parkway, West Des Moines, 515-440-2991; www.josephsjewelers.com.\nRunners-up: Prysm Jewelry & Piercing; Mint Piercing Studio\nBest Local Antique Store\nBrass Armadillo Antique Mall\nIt’s easy to get lost inside of the Brass Armadillo Antique Mall. With aisle after aisle filled with trinkets, memorabilia, furniture, clothing and almost anything else antique you can think of, CITYVIEW readers say it is the Best Local Antique Store. Wares from more than 450 antique dealers can be found at the north side store. With such a wide-ranging selection, customers will be hard pressed to walk out of the doors without making a purchase. 701 N.E. 50th Ave., Des Moines, 515-282-0082; www.brassarmadillo.com/desmoines.\nRunners-up: The Picker Knows; Raccoon Forks Trading Company\nBest Local Art Gallery\nMoberg Gallery\nOwned by artist TJ Moberg, the Best Local Art Gallery in Best of Des Moines voting hosts exhibits throughout the year with updates on its website. Online, you can look through the history of exhibits and artists that have been shown at Moberg. 2411 Grand Ave., Des Moines, 515-279-9191; www.moberggallery.com.\nRunners-up: Liz Lidgett Gallery and Design; Olson-Larsen Galleries\nBest Local Hardware Store\nWaukee Hardware & Rent-It Center\nCITYVIEW readers have chosen Waukee Hardware & Rent-It Center as their choice for Best Local Hardware Store. From toolboxes to extension cords to saws, drills, hammers and more, get started on your DIY project with a trip to Waukee Hardware. 380 Sixth St., Waukee; 515-987-4574; www.doitbest.com.\nRunners-up: Miller’s Hardware; O’Donnell Ace Hardware\nBest Shopping District\nValley Junction\nValley Junction makes for a great one-day, one-stop, shopping trip experience in its uniquely historic setting — a few of the reasons CITYVIEW readers chose it as Best Shopping District. Stores include CITYVIEW readers’ choice for Best Local Store (overall), Bing’s, as well as a variety of other options. And, the district features plenty of restaurants for a chance to set the bags down and refuel. Fifth Street in West Des Moines, 515-222-3642; www.valleyjunction.com.\nRunners-up: East Village; Jordan Creek\nBest Local Flower Shop\nBoesen the Florist\nTom Boesen is the third generation of Boesens to run the flower shop, serving your bouquet, wedding floral, wreath needs and more. With more than a century in business, this Des Moines metro floral shop has been around longer than almost every area resident. Their arrangements are colorful and well-designed to meet most any occasions needs, which likely earned it CITYVIEW readers’ votes. Multiple locations; www.boesen.com.\nRunners-up: Wildflower; Bellflower Florist & Gifts\nBest Local Gift Shop\nBing’s\nBing’s has been voted by CITYVIEW voters as the Best Local Gift Shop for the seventh year in a row. Located in the poll’s winner of Best Shopping District, the Valley Junction store is becoming a stalwart in the area and doesn’t appear to be going anywhere any time soon. 213 Fifth St., West Des Moines, 515-279-3141; www.bingsdsm.com.\nRunners-up: Tandem Brick Gallery; give.\nBest Local Place to Purchase a Musical Instrument\nRieman Music\nEstablished in 1953, Rieman Music, chosen by CITYVIEW readers as the Best Local Place to Purchase a Musical Instrument, has been serving metro residents and Best of Des Moines voters’ musical needs with excellent service, a wide range of instruments, equipment and accessories. If you’re looking to hone your craft or learn a new instrument, Rieman also offers music lessons. Multiple locations; www.riemanmusic.com.\nRunners-up: Uptempo Music; Becker Fine Stringed Instruments\nBest Local Computer Repair Shop\nLittle Dog Tech\nYou would be hard pressed to find someone who enjoys dealing with a tech issue. A laptop that won’t start, a computer that won’t connect to the internet, whatever it may be, these issues can be a pain. Fortunately, Little Dog Tech has excellent service and repair capabilities that keep them fresh in the mind of CITYVIEW readers time and time again when voting for Best Local Computer Repair Shop. 5946 Ashworth Road, West Des Moines, 515-422-1995; www.littledogtech.com.\nRunners-up: Mobile Spot; Schrock Innovations\nBest Local Phone Repair Shop\nCPR Cell Phone Repair\nCell phones dominate the way we communicate, work and socialize in today’s society. You can pay your bills, set up appointments and, in some cases, do your job, all on your phone. With that much importance in our day-to-day lives, it’s crucial to know who can fix any issues at the drop of a hat. CPR Cell Phone Repair is CITYVIEW readers’ choice for Best Local Phone Repair Shop. Multiple locations; www.cellphonerepair.com/west-des-moines-ia.\nRunners-up: Mobile Spot; uBreakiFix\nBest Local Pawn Shop\nSolar Loan and Sales\nSolar Loan and Sales is Des Moines’ oldest pawn shop, and, for another year, it is considered the Best Local Pawn Shop by CITYVIEW readers. Owner Steve Kouri says he has more than 20 years of experience in buying and selling jewelry, instruments, antiques, collectables and almost anything else that could make its way into his shop. 3311 Ingersoll Ave., Des Moines, 888-244-7084; www.solarpawn.com.\nRunners-up: The Pawn Store; EZPAWN\nBest Local Convenience Store\nCasey’s\nCasey’s is a Midwest staple. For many, it’s their favorite place for pizza. For others, it’s their favorite place to fill their gas tanks. For CITYVIEW readers, it’s their choice for the Best Local Convenience Store. With almost 2,900 stores across 20 states, the store that got its start in Boone is becoming a national favorite as well. Multiple locations; www.caseys.com.\nRunners-up: Kum & Go; Kwik Star\nBest Local Place to Buy Cigars/Tobacco\nDavid’s Fine Tobaccos\nDavid’s Fine Tobaccos has a state-of-the-art ventilation system, relaxing chairs to lounge in and gives you the option to bring in your own beer or wine while smoking one of their selections of imported, hand-made, fresh cigars. Cigars make a great gift to mark a special occasion, and CITYVIEW readers says David’s is the Best Local Place to Buy Cigars/Tobacco. 9759 University Ave., Clive, 515-278-8701; www.davidsfinetobaccos.com.\nRunners-up: Leaf Brothers Cigars; Iowa Cigar Company\nBest Local E-Cigarette Shop\nCIV Plus\nVapes and CBD products continue to increase in demand, as do stores that supply them. When CITYVIEW readers are looking to get a new vape, juice to reuse them, or a CBD product, they says CIV Plus is the Best Local E-Cigarette Shop. “Whether you’re experienced with our product selection or not, our knowledgeable employees will help you find the product that best fits your lifestyle,” they say. Multiple locations; www.civplus.com.\nRunners-up: Greenleaf Tobacco & Vape; Almost Paradise\nBest Valley Junction Store\nBing’s\nBing’s makes several appearances in the winning column of Best of Des Moines. Want a prescription style shot glass? They’ve got it. A Bob Ross ornament? You bet. Unicorn chopsticks? I hope you’re hungry. It’s all at Bing’s, CITYVIEW readers’ choice for Best Valley Junction Store. 213 Fifth St., West Des Moines, 515-279-3141; www.bingsdsm.com.\nRunners-up: Reading in Public Bookstore + Cafe; Hinge\nBest West Glen Store\nMint Piercing Studio\nFor another year running, Mint Piercing Studio claims the Best Of Des Moines award for Best West Glen Store. Mint Piercing Studio is a safe, clean and welcoming environment to get a beautiful piece of jewelry to perfectly express yourself. 5525 Mills Civic Parkway, No. 125, West Des Moines, text only, 515-333-8223; www.mintpiercing.com.\nRunners-up: Josephs Jewelers; WineStyles\nBest East Village Store\nRAYGUN\nThis East Village staple consistently comes up with catchy, snarky slogans to jump on what’s trending in pop culture, especially if it involves Des Moines, Iowa or the Midwest at large. Shirts, greeting cards, towels and more, themed and inspired by the Hawkeye state, are available at the Best East Village Store, according to CITYVIEW readers. 505 E. Grand Ave., Des Moines, 515-288-1323; www.raygunsite.com.\nRunners-up: AllSpice Culinarium; Raccoon Forks Trading Company\nBest Beaverdale Area Store\nBeaverdale Books\nSince 2006, Beaverdale Books has been operating in its namesake neighborhood, and has served customers well. The Best Beaverdale Area Store, according to CITYVIEW readers, features an Iowa Author section with more than 500 authors from the state represented. Besides great books, the business also offers events, book clubs and writers groups, all in one place. 2629 Beaver Ave., Des Moines, 515-279-5400; www.beaverdalebooks.com.\nRunners-up: Back Country; Beaverdale Confections\nBest Drake Area Store\nAncient Ways\n“An eclectic shop for exploring ancient mysteries.” Color us intrigued. Inside the walls of Ancient Ways, the Best of Des Moines poll’s Best Drake Area Store, are items for bathing, candles, stones, herbs, teas, oils and much more. See if any of their products can help you discover something about yourself or the universe. 2420 University Ave., Des Moines, 515-280-3375; www.ancientwaysdm.com.\nRunners-up: Groovy Goods Daydreams; Huckleberry Home\nBest Ingersoll Area Store\nTandem Brick Gallery\nFor the eighth year in a row, CITYVIEW readers’vote for Best Ingersoll Area Store goes to Tandem Brick Gallery. While their framing skills also earned the gallery the Best Local Frame Store title as well, you can also purchase candles, cards, mugs, hats and more. 2722 Ingersoll Ave., Des Moines, 515-282-1031;\nwww.tandembrickgallery.com.\nRunners-up: Renovation Jungle; Zzz Records\nBest Local Furniture Store\nHomemakers\nCITYVIEW readers interested in furnishing their new apartment, home or office, or looking to upgrade on a piece of existing furniture, say Homemakers is the Best Local Furniture Store when looking for somewhere to sit, lay, lounge or rest. Homemakers also boasts several Iowa-only delivery options to make the process go smoothly. 10215 Douglas Ave., Urbandale, 515-276-2772;\nwww.homemakers.com.\nRunners-up: Huckleberry Home; Redekers\nBest Local Home Decor Store\nHuckleberry Home\nThis locally owned and operated smaller scale store has been voted Best Local Home Decor Store by CITYVIEW readers. Inside, you will find a collection of décor, local art, houseplants, accessories and more, from a century old to brand new. 1141 42nd St., Des Moines; www.facebook.com/HuckleberryHome515/.\nRunners-up: Homemakers; Real Deals – Ankeny\nBest Jordan Creek Area Store\nVon Maur\nVon Maur is one of Iowa’s oldest running businesses. The Von Maur family opened its first store in Davenport in the late 1800s and has expanded to 16 states since then. Von Maur offers everything for women, men, juniors and kids from sneakers to skin care to home décor and so much more and is this year’s Best Jordan Creek Area Store, say CITYVIEW readers. Jordan Creek Town Center, 101 Jordan Creek Parkway, No. 6000, West Des Moines, 515-223-1311; www.vonmaur.com.\nRunners-up: Christopher’s Fine Jewelry; Scheels\nBest Local Appliance Store\nNebraska Furniture Mart\nIowan’s like to make fun of Nebraska for many, justified reasons. Their corn, driving through it on the way to Colordo. One thing CITYVIEW readers won’t knock them for? Their furniture. Nebraska Furniture Mart has — of course, great furniture, but also, a selection of appliances and home workout equipment and machines. 15500 Hickman Road, Clive, 515-727-6500; www.nfm.com/des-moines-store\nRunners-up: Warners’ Stellian; Metro Appliance\nBest Local Shoe Store\nBrown’s Shoe Fit Co.\nIf the shoe fits, and Brown’s Shoe Fit Co. fits into the winners spot of this category once again. At Brown’s, patrons have been able to find all things footwear for men and women for more than 100 years. Multiple locations; www.brownsshoefitcompany.com.\nRunners-up: Fit To Be Tied Shoes; Fleet Feet\nBest Local Pool and Spa Store\nCentral Iowa Pools & Spa\nYou will be hard pressed to find a better way to spend a hot Des Moines summer day than with a dip in the pool. At Central Iowa Pool & Spa, CITYVIEW readers’ choice for Best Local Pool and Spa Store, you can get an above, semi, or full in-the-ground pool, with several spa options available as well. 5360 N.E. 14th St., Unit F, Des Moines, 515-263-6900; www.soakandswim.com.\nRunners-up: Valley Pool & Hot Tubs Inc.; Hot Spring Spas of Iowa\nBest Local Greenhouse\nGoode Greenhouses\nGoode Greenhouses has been firmly planted in its location since 1905. Take your garden or flowerbed to an entirely different level after browsing their plant catalogue. Bright colors, beautiful smells, and a staff to help point you in the right direction can be found in CITYVIEW readers’ choice for Best Local Greenhouse. 1050 N.E. 50th Ave., Des Moines, 515-262-6504; www.goodegreenhouses.com.\nRunners-up: Canoyer Garden Center; Piney Ridge Greenhouses\nBest Local Skate Shop\nSubsect Skateshop\nSkateboarding has been growing in Des Moines thanks in part to the Lauridsen Skatepark, the largest in the world of its kind. Those skaters need supplies, and Subsect Skateshop has them. From shoes and clothes to trunks and boards, start rolling at Subsect, The Best Local Skate Shop according to CITYVIEW readers. 309 E Walnut St., Des Moines, 515-276-4365; www.subsect-skateshop.myshopify.com.\nRunners-up: Unkl Ruckus’s Smoking Emporium & Skate Shop; The Dark Slide\nNIGHTLIFE\nBest Whiskey\nPrairie Fire — Iowa Distilling Company\nMake it seven years in a row for Prairie Fire, made by Iowa Distilling Company, as CITYVIEW readers’ vote for Best Whiskey. Prairie Fire has a delectable flavor that goes great with apple cider or even to sip on its own. Check out Iowa Distilling’s website for a list of recipes to find out the best ways to enjoy this award-winning spirit. 4349 Cumming Ave., Cumming, 515-981-4216; www.iowadistilling.com.\nRunners-up: Revelton Distilling Company; Templeton Rye\nBest Vodka\nZone Vodka — Iowa Distilling Company\nIowans love their corn, so it makes sense that Zone Vodka, made with corn, was chosen as this year’s Best Vodka. Iowa Distilling Company says, “We purify every batch with cutting-edge ozone technology to give it the perfect smooth, lingering finish.” As with Prairie Fire, check the recipes tab online to get the best out of this drink. 4349 Cumming Ave., Cumming, 515-981-4216; www.iowadistilling.com.\nRunner-up: Tito’s Handmade Vodka; Iowa State 1858 — Iowa Distilling Company\nBest Rum\nSteel Drum Rum – Iowa Distilling Company\nIt’s a clean sweep for Iowa Distilling Company when it comes to the Best of Des Moines liquors — Best Whiskey, Best Vodka and Best Rum. Made from pure Caribbean molasses and sourced from Caribbean sugar cane, Steel Drum Rum makes a great choice for an at-home rum and Coke, or, just like the IDC favorites, there’s recipes on their website that help you craft a tasty cocktail. 4349 Cumming Ave., Cumming, 515-981-4216; www.iowadistilling.com.\nRunners-up: RUMCOQUI; Bacardi\nBest Local Craft Beer\nConfluence Brewing Company\nThe draft list at Confluence Brewing Company is as long as it is tasty. The brewery has something for every beer drinker and has the Best Local Craft Beer, as CITYVIEW readers attest: light, hoppy, sour, malty, dark and barrel aged. Depending on when you visit the brewery just south of downtown Des Moines, you might find yourself enjoying trivia night or spending a relaxing evening on one of the best patios in the city. 1235 Thomas Beck Road, Des Moines, 515-285-9005; www.confluencebrewing.com.\nRunners-up: Barn Town Brewing; Exile Brewing Company\nBest New Local Bar\nHiFi Brew Lounge\nAlso a runner up for Best New Local Restaurant, HiFi Brew Lounge is off to a great start as CITYVIEW readers vote it the Best New Local Bar. HiFi has a modern interior that welcomes any, a menu with flavorful options, but. most importantly for this category, great drinks. House cocktails range from the strawberry flavored “I’m So Julia,” to the “My Way” Old Fashioned. 103 S. 11th St., West Des Moines, 515-415-1085; www.hifibrewlounge.com.\nRunners-up: Ta’Chido Cantina; The Lamp\nBest Local Patio Bar\nThe Pelican Post Bar & Grille\nWith several runner up awards, this is the Pelican Post’s second Best of Des Moines Award this year, both for the business’ spectacular patio, which has been named Best Local Restaurant Patio and Best Local Patio Bar by CITYVIEW readers. The food and drink options make for a great way to spend the afternoon or night drinking and dining while enjoying the fresh air. 265 50th St., West Des Moines, 515-214-1873; www.thepelicanpostdsm.com.\nRunners-up: Big Grove Brewery & Taproom; Gastro Grub & Pub\nBest Local Irish Pub\nSully’s Irish Pub\nSully’s opened in 1977, making it Des Moines’ oldest Irish bar as well as the Best Local Irish Pub in Best of Des Moines voting. They continue to serve the metro with drink specials such $3 Fireballs and $3 Guinness pints — not to mention offering a dog-friendly patio. It’s hard to imagine a better a place to sip on a cold one or enjoy a patty melt with your furry friend by your side. 860 First St., West Des Moines, 515-255-9970; www.sullysdesmoines.com.\nRunners-up: Magee’s Irish Pub & Eatery; Cooney’s Tavern\nBest Local Dive Bar\nCarl’s Place\nThis Sherman Hill staple is once again CITYVIEW readers’ choice for Best Local Dive Bar. Dive bars are a great place to go when you’re not interested in the clubs, dancing or fanciness of it all. Sit down, order a drink, play a round of pool. No frills, just a good time. 1620 Woodland Ave., Des Moines, 515-243-9727; www.carlsplacedsm.com.\nRunners-up: Toads Tavern; Greenwood Lounge\nBest Local Fancy-Pants Bar\nWinchester Public House\nNestled in Valley Junction, the Winchester makes a great place to visit when searching for a fancy cocktail in an elevated atmosphere. A wide range of whiskeys are at your selection including plenty of signature cocktails that are dressed to the nines, but taste like tens at this Best Local Fancy-Pants Bar in Best of Des Moines voting. 224 Fifth St., West Des Moines, 515-499-4002; www.winchester.pub.\nRunners-up: The Cork 50131; Hello, Marjorie\nBest Local Sports Bar\nThe Station on Ingersoll\nFootball, basketball, wrestling. It doesn’t matter. Central Iowans enjoy watching sports almost as much as they enjoy a good bar. Combine the best of both worlds — take in the sports memorabilia on the walls and TVs galore to keep track of the action, all while enjoying a meal and a beverage at CITYVIEW readers’ choice for Best Local Sports Bar. 3124 Ingersoll Ave., Des Moines, 515-381-0052; www.thestationdsm.com.\nRunners-up: Johnny’s Hall of Fame; Bix & Co.\nBest Local Bar (Overall)\nIowa Distilling Company\nWhen you sweep the awards for best liquors as Iowa Distilling Company has, you’ve probably got yourself a pretty good bar. According to CITYVIEW readers, it’s the Best Local Bar (Overall). The business’ calendar is chock full of great events with trivia, live music, bingo and more. 4349 Cumming Ave., Cumming, 515-981-4216;\nwww.iowadistilling.com.\nRunners-up: Johnny’s Hall of Fame; Toads Tavern\nBest Ankeny Bar\nYankee Clipper\nThe Yankee Clipper located in Uptown Ankeny has been voted Best Ankeny Bar by CITYVIEW readers once again. The Clipper Burger, a fried, breaded beef patty with pepperjack cheese, is a favorite. They say they’re locally famous for their White Russian and made-from-scratch Bloody Marys. 312 S.W. Maple St., No. 2915, Ankeny, 515-964-9484; www.yankeeclipperbar.com.\nRunners-up: Jakes Pub; Whiskey River\nBest Drake Area Bar\nUniversity Library Cafe\nBack again as CITYVIEW readers’ choice for the Best Drake Area Bar and Best Local Nachos, the University Library Cafe is a stalwart in the Drake neighborhood. University Library Cafe serves area residents and nearby college students with homemade twists on bar food like their Library Poutine, a Havarti Vegetable Melt or a Bookworm Burger. 3506 University Ave., Des Moines, 515-255-0433; www.thelibrarydm.com.\nRunners-up: Lucky Horse Beer & Burgers; Peggy’s Tavern\nBest Beaverdale Area Bar\nThe Dam Pub\nThe Dam Pub is damn good — and the Best Beaverdale Area Bar according to Best of Des Moines voters. At this establishment, you can find a menu full of great food and cocktails, a rooftop patio for the sunnier months and a fun 1980s- and 1990s- atmosphere on the inside. 2710 Beaver Ave., Des Moines, 515-279-4449; www.dampubdsm.com.\nRunners-up: Beaver Tap; GoodSons\nBest Downtown Bar\nThe Stuffed Olive\nThe Stuffed Olive got a makeover and new location during 2024, and it appears to have paid off, as CITYVIEW readers have chosen it as the Best Downtown Bar. Moving just a short walk down the road to its current location, The Stuffed Olive still serves more than 100 styles of martinis, from the classics to concoctions like the S’mores martini. 216 Court Ave., Suite 100, Des Moines, 515-243-4456; www.stuffedolivedsm.com.\nRunners-up: Johnny’s Hall of Fame; Hello, Marjorie\nBest West Side Bar\nShotgun Betty’s\nShotgun Betty’s takes the top spot as Best West Side Bar, according to CITYVIEW readers. The kickass country bar has cold beer, live music and great vibes. They say, “We crack cold ones and shoot whiskey. and we turn the country up loud!” If that’s your thing, a night at Shotgun Betty’s is sure to be memorable. 5535 Mills Civic Parkway, Suite 100, West Des Moines, 515-309-0744; www.facebook.com/shotgunbettys.\nRunners-up: The Pelican Post Bar & Grille; Winchester Public House\nBest East Village Bar\nErnie’s Boondock\nIt’s hard to pin down a description of Ernie’s Boondock, but this year it can claim the title of the best. A spacious patio and a divey inside with old school seating, a bison head hung on the wall in the back, and anything from pro wrestling highlights to skateboarding clips playing on the TVs behind the bar make this Best East Village Bar, as determined by CITYVIEW readers. From the Coffee Drink to the Egg Bomb to the Daytona Corona, Ernie’s keeps you on your toes and coming back for more. 440 E. Grand Ave., Des Moines.\nRunners-up: AJ’s on East Court; The Blazing Saddle\nBest East Bar\nToads Tavern\nToads Tavern has happy hour from 11 a.m. to 6 p.m. during the week and all day on weekends. That’s a lot of happy hours and even more happy customers. The Best East Bar, as chosen by CITYVIEW readers, is ideal for a cold one while you watch the game or play a round of pool or darts. 3002 State Ave., Des Moines, 515-264-8623; www.facebook.com/toadstavern.\nRunners-up: Kelly’s Little Nipper; Cheap Seats Sports Bar\nBest South Bar\nAngry Goldfish Pub & Eatery\nThe goldfish might be angry, but the customers and Best of Des Moines voters at this Best South Bar sure aren’t. The Angry Goldfish has been making waves on the southside with an excellent selection of classic bar food, great cocktails and a fun atmosphere. Their website is consistently updated with a list of specials for the upcoming week from their brunch to their dinners. 2301 S.W. Ninth St., Des Moines, 515-288-2358; www.angrygoldfishdsm.com.\nRunners-up: Francie’s Bar & Grill; Kung Fu Tap & Taco\nBest Local Winery\nJasper Winery\nJasper Winery is nearing a decade of dominance as the Best Local Winery, winning this category for the ninth year running. Jasper’s sangria is a favorite, and they’ve even started to make their own cider. Add in their summer concert series to match the tastes to the vibes, and it’a easy to see why CITYVIEW readers continue to drink their wine and attend their events. 2400 George Flagg Parkway, Des Moines, 515-282-9463; www.jasperwinery.com.\nRunners-up: Covered Bridges Winery; Summerset Winery\nBest Local Brewery\nConfluence Brewing Company\nMaking the Best Local Craft Beer could be a reason why Confluence Brewing Company was also voted as the Best Local Brewery. Their craft beer options offer something up for most any enjoyer of the hoppy beverage, making them easy to enjoy at their brick-and-mortar location or at home on the couch. 1235 Thomas Beck Road, Des Moines, 515-285-9005; www.confluencebrewing.com.\nRunners-up: Lua Brewing; Big Grove Brewery & Taproom\nBest Local Moscow Mule\nThe Copper Cup\nMoscow mules are becoming a favorite drink of many and are included on most every bar cocktail list. The Copper Cup, with a double-digit number of recipes, crafts the Best Local Moscow Mule once again. 207 Fourth St., Des Moines, 515-554-2606; www.thecoppercupdm.com.\nRunners-up: Gastro Grub & Pub; Iowa Distilling Company\nBest Local Bloody Mary\nMullets\nMullets has a couple different options for their award-winning Bloody Mary. Get the Loaded Bloody, which includes spice pickle spear, olive, celery, bacon, shrimp and pepperjack cheese; their Famous Bloody Mary, made with a secret recipe; or the new Bloody Mary Flight, which comes with a Traditional Bloody, Cucumber Lime Bloody Bacon Vodka and Jalapeño Vodka Bloody. Multiple locations; www.mulletsdm.com.\nRunners-up: Early Bird Brunch; Jethro’s BBQ\nBest Local Bar to Play Games\nUp-Down\nUp-Down, CITYVIEW readers’ choice for Best Local Bar to Play Games, has more than 60 classic arcade games at its East Village location. Order a slice of delicious pizza and a beverage. Downstairs is where customers find the majority of the games. If the classics, like Asteroids, Joust or Burger Time, aren’t your thing, try your hand at Skee ball or pinball. With a cocktail list named and crafted after famous video game characters, all these elements make for one great bar. 500 E. Locust St., Des Moines, 515-243-4322; www.updownarcadebar.com/des-moines.\nRunners-up: Ricochet; Smash Park\nBest Local Place To See Beautiful People\nCoachlight Clinic & Spa\nThere’s plenty of beauty around this wonderful city. CITYVIEW readers say Coachlight Clinic & Spa is the Best Local Place To See Beautiful People. Perhaps that is because Coachlight offers dermaplaning, hydrafacials, body care scrubs and much more. 6420 Coachlight Drive, Suite 200, West Des Moines, 515-221-9999; www.dsmcoachlight.com.\nRunners-up: Gastro Grub & Pub; Nova MedSpa\nBest Local Happy Hour\nEatery A\nWho doesn’t enjoy a good happy hour? How about CITYVIEW readers’ choice for Best Local Happy Hour? That title once again belongs to Eatery A. From 2-6 p.m. is happy hour at the Mediterranean-inspired restaurant, serving up wine, beer, cocktails and flavorful food.\n2932 Ingersoll Ave., Des Moines, 515-282-8085;\nwww.eateryadsm.com.\nRunners-up: Iowa Distilling Company; Toads Tavern\nBest Local Bartender\nJake Weller, Shotgun Betty’s\nA bartender can be many things. A good listener, a friend, a source of wisdom, or simply a great mixologist. But, only one can be the Best Local Bartender, and this year, it’s Jake Weller, serving drinks at the Best West Side Bar, Shotgun Betty’s. 5535 Mills Civic Parkway, Suite 100, West Des Moines, 515-309-0744; www.facebook.com/shotgunbettys.\nRunners-up: Zoey Osteen, Gastro Grub and Pub; Kodi Dursky, Iowa Distilling Company\nBest Local Martini Menu\nThe Stuffed Olive\nFor another year, The Stuffed Olive has been voted as having the Best Local Martini Menu by CITYVIEW readers. Martinis are a classic beverage. Whether its shaken, stirred, dirty or clean, the drink dates back to the 1800s, and no one does them better in the metro than The Stuffed Olive. 216 Court Ave., Suite 100, Des Moines, 515-243-4456; www.stuffedolivedsm.com.\nRunners-up: The Lift; The Big Steer\nBest Local Margarita\nCoa Cantina\nA margarita is often the sign of a goodtime. The often fruity, sometimes spicy, always tasty drink transports the tastebuds to places of sunshine and sandy beaches. We might not quite have that here in Iowa, especially not year-round, but if you want a taste, order one of Coa Cantina’s Best Local Margaritas, as voted by CITYVIEW readers. 425 E. Grand Ave., Des Moines, 515-280-3097; www.coacantinadsm.com.\nRunners-up: Mi Mexico; Fiesta Mexican Restaurant\nBest Local Dance Club\nThe Garden\nThe Garden is an LGBT+ owned and operated business in the heart of the East Village’s nightlife district. The bar, with one of Des Moines’ best rooftop patios, hosts drag events and welcomes all for a drink, a show and, clearly, a dance, as it has been named Best Local Dance Club by CITYVIEW readers. 525 E. Grand Ave., Des Moines; www.grdn.com.\nRunners-up: Miss Kitty’s; Denny Arthurs\nBest Local Drag Queen\nDomita Sanchez\nDomita Sanchez has been entertaining crowds in Des Moines drag shows and events for more than 10 years and continues to become a mainstay in the Midwest drag scene. Sanchez has performed at local bars like The Blazing Saddle, Noce and more, and is the Best Local Drag Queen in the Best of Des Moines poll. www.solo.to/domitasanchez.\nRunners-up: Tyona Diamond; Nikki Love\nBest Local Place to Karaoke\nAJ’s on East Court\n“Be your inner rock star tonight!” invites AJ’s on East Court. That is exactly what a night of karaoke can do. Grab yourself a couple drinks to gain the courage, if you need it, request that favorite song you like to belt out in the car or in the shower and let loose at the Best Local Place to Karaoke, according to CITYVIEW readers. They won’t judge, and neither will we. 419 E. Court Ave., Des Moines, 515-282-1888; www.ajsbar.com.\nRunners-up: Doc’s Lounge; Lynn’s on Merle Hay\nBest Local Place for a Bachelor/Bachelorette Party\nYour Private Bar\nThis mobile bartending service has been in business since 2013 and serves more than 350 events a year. CITYVIEW readers who have held, planned or attended a bachelor or bachelorette party with Your Private Bar agree they are the Best Local Place for a Bachelor / Bachelorette Party. 1701 25th St., West Des Moines, 515-599-1205; www.yourprivatebar.com.\nRunners-up: AJ’s on East Court; The Stuffed Olive\nBest Local Trivia Night\nDoc’s Lounge\nTrivia night at Doc’s is on Tuesdays from 7-9 p.m. While their trivia night can now claim the title of Best Local Trivia Night thanks to CITYVIEW readers, they also host bingo, karaoke and holiday-themed events. Bring your A game and your smartest friends to this Johnston area bar. 8805 Chambery Blvd., Johnston, 515-278-7090; www.docsinjohnstoniowa.com.\nRunners-up: The Hall; Lynn’s on Merle Hay\nBest Local Distillery\nIowa Distilling Company\nThis is the last time you will see Iowa Distilling Company on this year’s Best Of Des Moines awards. CITYVIEW readers chose the business for Best Local Distillery to add to its Best Whiskey, Best Rum, Best Vodka, Best Local Bar and runner up awards in several other categories. 4349 Cumming Ave., Cumming, 515-981-4216; www.iowadistilling.com.\nRunners-up: Revelton Distilling Company; Foundry Distilling Company\nBest Local LGBTQ Hangout\nThe Blazing Saddle\nSince 1983. there’s always been a double and never a cover at The Blazing Saddle. Yes, the drinks are strong, but the good times are even stronger. This mainstay in the East Village and Des Moines’ oldest gay bar wins the Best Local LGBTQ Hangout title again in Best of Des Moines voting. Catch a drag show by one of their “gurls,” or just have a good time. 416 E. Fifth St., Des Moines, 515-246-1299; www.theblazingsaddle.com.\nRunners-up: The Garden; Nightingale Cocktail\nBest Whiskey Menu\nWinchester Public House\n“A cozy prohibition style pub with a signature line of cocktails while focusing on a modern twist on the classics.” Thank goodness prohibition is no more, and we have whiskey bars like this one, voted to have the Best Whiskey Menu by CITYVIEW readers, to fill our glasses. 224 Fifth St., West Des Moines, 515-499-4002; www.winchester.pub.\nRunners-up: Gastro Grub & Pub; Alleged Lee’s\nBest Local Rooftop Bar\n300 Craft & Rooftop\nRooftop bars make for a great night out on the town. Step outside at 300 Craft & Rooftop, see the iconic Des Moines skyline, and you’ll see why they put rooftop in the name — and why CITYVIEW readers chose it the Best Local Rooftop Bar. 300 has a 360-degree bar on its patio to get customers served quickly. There’s also enough space to host live music. If the Iowa Cubs are playing on a Friday night, 300 has a great view of the fireworks. 300 W. Martin Luther King Jr. Parkway, Des Moines, 515-288-3414; www.300craftandrooftop.com.\nRunners-up: The Republic on Grand; The Dam Pub\nBest Local Dog-Friendly Bar\nPaws & Pints\nDogs love a day out of the house just as much as their owners do. At Paws & Pints, once again voted Best Local Dog-Friendly Bar, puppies, dogs, hounds and mutts have the chance to socialize with their furry brethren in 20,000 square feet of indoor and outdoor space. 6218 Willowmere Drive, Des Moines, 515-969-2275; www.pawsandpintsdsm.com.\nRunners-up: The Pelican Post Bar & Grille; Gastro Grub & Pub\nBest Local Mobile Bar Service\nYour Private Bar\nYour Private Bar can help bring the party to you. Whether it be a work event or celebration of your choosing, their decade of serving experience and drink delivery system will make your life easier. A ripples machine, champagne and bar carts, and selfie stands will make your night one you won’t forget thanks to the Best Local Mobile Bar Service, according to CITYVIEW readers. 1701 25th St., West Des Moines, 515-599-1205;\nwww.yourprivatebar.com.\nRunners-up: Top It Off Liquid Catering; Apres Bar Co.\nBest Speakeasy\nChicago Speakeasy\nFor more than 42 years, Chicago Speakeasy has offered food, fun and booze. There’s no need for a secret password or codeword to gain entrance. Prime rib and hand-cut steaks, speakeasy classics like the Manhattan and several martinis are sure to satisfy. Their menus have plenty of mafia-themed puns to add a chuckle to your dining and drinking experience at the Best of Des Moines’ Best Speakeasy. 1520 Euclid Ave., Des Moines, 515-243-3141; www.chicagospeakeasyrestaurant.com.\nRunners-up: In Confidence; Good News, Darling\nCULTURE & RECREATION\nBest Local Place to Play Golf\nWaveland Golf Course\nA day of golf is relaxing for some, frustrating for others. The sport is a tough one to master, but it only takes one pure iron shot to keep you coming back for more. Experience that feeling at one of the country’s best golf courses. With more than 40,000 rounds played a year, it’s no wonder CITYVIEW readers chose Waveland Golf Course as the Best Local Place to Play Golf. 4908 University Ave., Des Moines, 515-248-6302; www.golfwaveland.com.\nRunners-up: Topgolf; Jester Park Golf Course\nBest Local Community to Live In\nWaukee\nWaukee is one of the fastest growing cities in the country. Its many family-friendly events, such as its Fourth of July Celebration, Arts Festival, WinterFest, FamilyFest and more, help make Waukee the Best Local Community to Live In, according to CITYVIEW readers. The city continues to attract new businesses and residents and build more parks and schools while also providing quiet neighborhoods. www.waukee.org.\nRunners-up: Beaverdale; West Des Moines\nBest Local Place to Worship\nLutheran Church of Hope\nLutheran Church of Hope, with branches in West Des Moines, Ankeny, Des Moines, Grimes, Waukee, Ames and more, is the Best Local Place to Worship, according to Best of Des Moines poll results. If you weren’t able to catch the most recent service, Hope uploads the service online. Main location at 925 Jordan Creek Parkway, West Des Moines, 515-222-1520; www.hopewdm.org.\nRunners-up: Valley Church; Walnut Creek Church\nBest Local Nonprofit\nAnimal Rescue League of Iowa\nThe Animal Rescue League of Iowa, CITYVIEW readers’ choice for Best Local Nonprofit, has touched many lives during its time of service. It’s likely you, or someone you know, has adopted a pet from them. They also offer behavior training, spay/neutering, intervene in animal cruelty cases and much more. It’s also easy to get involved with the ARL by volunteering, fostering or donating. 5452 N.E. 22nd St., Des Moines, 515-262-9503; www.arl-iowa.org.\nRunners-up: ChildServe; St. Vincent de Paul of Des Moines\nBest Local School District\nWaukee Community School District\nThe Best Local Community to Live In has also been voted as having the Best Local School District. The Waukee Community School District is growing as rapidly as the town. The district has 19 modern, well-maintained facilities. www.waukeeschools.org.\nRunners-up: Des Moines Public Schools; Johnston Community School District\nBest Local Party/Event Transportation\nYour Private Bar\nYour Private Bar also provides guest transportation alongside their mobile bar, rented bar, party rentals, gift packages and personalized products. 1701 25th St., West Des Moines, 515-599-1205; www.yourprivatebar.com.\nRunners-up: Majestic Limo & Coach; Royal Rides\nBest Local Place to Hold a Corporate Event/Party\nYour Private Bar\nAt Your Private Bar, voted Best Local Place to Hold a Corporate Event/Party, one can include bar service, a cash bar, open bar, or a hosted bar with a custom drink menu. The business also offers catering and entertainment upon request. 1701 25th St., West Des Moines, 515-599-1205; www.yourprivatebar.com.\nRunners-up: Animal Rescue League of Iowa; Destination Grille\nBest Local Place for a Wedding Reception\nWillow on Grand\nThe modern, cottage-inspired Willow on Grand uses peaks, large beams and natural light to create a wedding reception space fit for every bride and groom to celebrate their day — which may be why CITYVIEW readers voted it the Best Local Place for a Wedding Reception. The Grand Room is 5,000 square feet and there is an outdoor courtyard and onsite parking. And, it is only seven minutes away from downtown Des Moines. 6011 Grand Ave., Des Moines, 515-452-6403 www.willowongrand.com.\nRunners-up: Toast; Curate\nBest Local Place to Gamble\nPrairie Meadows Casino, Racetrack & Hotel\nPrairie Meadows is one of only two nonprofit casinos in the country, and it is also the Best Local Place to Gamble, say CITYVIEW readers. An eventful day, or night, can be spent enjoying table games, slots or sportsbook betting. And don’t forget to try your hand at betting on the races. 1 Prairie Meadows Drive, Altoona, 515-967-1000; www.prairiemeadows.com.\nRunners-up: Meskwaki Bingo Casino & Hotel; Wild Rose Casino & Hotel\nBest Local Musician\nJordan Beem\nJordan Beem is a country and rock acoustic singer/songwriter out of Altoona. He’s amassed more than 8,000 followers on Facebook and routinely appears at local music venues. In 2024, Beem won the 2024 IMA Country Music Artist of the Year award. He was also chosen Best Local Musician by CITYVIEW voters. www.jordanbeemmusic.com\nRunners-up: Damon Dotson; Andrew Hoyt\nBest Local Band\n5 Below\nFor those of you missing the iconic 1990s to 2000s rock and grunge style music, miss no more. You can find that sound right here in Des Moines courtesy of 5 Below, Best Local Band in CITYVIEWS Best of Des Moines poll. Check the band’s Facebook page for show dates at venues like Confluence Brewing, Mickey’s Irish Pub, Hawk Heaven and more. www.facebook.com/5BelowRocks.\nRunners-up: The Nadas; The Sheet\nBest Local Place to Go for a Comedy Show\nFunny Bone Comedy Club\nFunny Bone comedy clubs can be found across the country, and, lucky for us, one of them is in Des Moines. Major players in the comedy scene make their way to this CITYVIEW readers’ choice for Best Local Place to Go for a Comedy Show to deliver jokes and bits that make you laugh so hard you cry. Just don’t try to retell those jokes at your office water cooler the next day. 560 S. Prairie View Drive, Suite 100, West Des Moines, 515-270-2100; www.desmoines.funnybone.com.\nRunners-up: Teehee’s Comedy Club; Hoyt Sherman Place\nBest Local Artist\nAlia Hendricks\nAlia Hendricks specializes in neo-traditional large and colorful tattoos. You can book her at Lucky Gal in Waukee. Some of her works include anime characters, mystical beings and animals in her eye-popping style that has earned her the title of Best Local Artist from CITYVIEW readers. www.facebook.com/aliaashley.hendricks.\nRunners-up: Maddy Fusco; Jill Wells\nBest Local Live Music Venue\nWooly’s\nFor 14 straight years, Wooly’s has dominated the category Best Local Live Music Venue. Famous acts have made their way on stage, and plenty of local acts as well. The venue hosts a wide range of sounds and genres to fit most every music fan’s tastes. Visit Wooly’s website to see if your favorite artist is coming to town. 504 E. Locust St., Des Moines, 515-244-0550; www.firstfleetconcerts.com/first-fleet-venues/woolys.\nRunners-up: Vibrant Music Hall; xBk Live\nBest Local Theatrical Venue\nDes Moines Playhouse\nThere is a rich history behind the Des Moines Playhouse. The Best Local Theatrical Venue, as voted by CITYVIEW readers, was founded in 1919. Mainly through volunteer help and community performers, the Playhouse’s musicals, comedies and dramas keep theater enjoyers coming back time and time again. 831 42nd St., Des Moines, 515-277-6261; www.dmplayhouse.com.\nRunners-up: Des Moines Civic Center; Hoyt Sherman Place\nBest Local Place to Catch a Flick\nThe Palms Theatres & IMAX\nThe feeling of stepping into a packed movie theater lobby when the latest blockbuster has hit the screen is impossible to replicate with a streaming service. Popcorn popping, larger-than-life soda and your favorite treat ready to be consumed in front of an even larger-than-life screen. For CITYVIEW readers, The Palms Theatre & IMAX gives them that special feeling and earns The Palms the title of Best Local Place to Catch a Flick. 200 N.E. Westgate Drive, Waukee, 515-444-5006; www.fridleytheatres.com.\nRunners-up: Flix Brewhouse; The Fleur Cinema & Cafe\nBest Local Museum\nDes Moines Art Center\nThe three connected buildings that make up the Des Moines Art Center were crafted by famous architects Eliel Saarinen, I. M. Pei, and Richard Meier. The museum’s origins can be traced back to 1916, and it was the first museum to open after World War II ended. The galleries inside inspire many, and, best of all, it’s free to visit this Best Local Museum in Best of Des Moines voting. 4700 Grand Ave., Des Moines, 515-277-4405; www.desmoinesartcenter.org.\nRunners-up: State Historical Museum of Iowa; Science Center of Iowa\nBest Local Place to Have a Kid’s Birthday Party\nAnimal Rescue League of Iowa\nThe ARL of Iowa offers animal-themed games, crafts, a tour of the shelter and the chance for your child and partygoers to name the shelter’s next pets, making it CITYVIEW readers’ choice for Best Local Place to Have a Kid’s Birthday Party. Check the ARL website for booking and party details, including an itinerary to give your little one a purr-fect birthday. 5452 N.E. 22nd St., Des Moines, 515-262-9503; www.arl-iowa.org.\nRunners-up: Let’s Slumber It; JouJou\nBest Local Place to Take Your Kids\nBlank Park Zoo\nWith 49 acres of land — 22 specifically developed into animal exhibits and facilities — 104 different animal species and 1,484 specimens, the Blank Park Zoo wins the award for Best Local Place to Take Your Kids for another year running in the eyes of CITYVIEW readers. 7401 S.W. Ninth St., Des Moines, 515-285-4722; www.blankparkzoo.com.\nRunners-up: JouJou; Greater Des Moines Botanical Garden\nBest Local Place to Take Visitors\nGreater Des Moines Botanical Garden\nThere are many reasons to take a visiting friend or family member to the Greater Des Moines Botanical Garden, voted the Best Local Place to Take Visitors by CITYVIEW readers. Enjoy events such as the stunning displays of Dome after Dark on scheduled evenings and Botanical Blues with live music to accompany the flora sights around you. If you just want to stroll through the climate-controlled dome, you can do that, too. 909 Robert D. Ray Drive, Des Moines, 515-323-6290;\nwww.dmbotanicalgarden.com.\nRunners-up: Pappajohn Sculpture Park; Des Moines Downtown Farmers Market\nBest Local Annual Event\nIowa State Fair\nWe would need more than a paragraph to cover even a few of the things to do during the week and a half of the Iowa State Fair, voted Best Local Annual Event. New fair food pops up every year, the Midway lets you try your hand at classic fair games, and the grandstand pulls in world-famous performers — not to mention the countless free entertainment options spread throughout the grounds. The theme for 2025? Fair Sweet Fair. Iowa State Fairgrounds, near East 30th and East University Avenue in Des Moines. 515-262-3111;\nwww.iowastatefair.org.\nRunners-up: ARL Raise Your Paw Auction; Des Moines Arts Festival\nBest Local Sports Team\nIowa Cubs\nThe Iowa Cubs, the Best Local Sports Team according to CITYVIEW readers, are the longest running affiliated AAA team with its pro franchise, the Chicago Cubs. Future and present MLB talent often appear on Sec Taylor Field, and the Iowa Cubs enhance the viewing experience with creative, fun promotions and Friday night fireworks. One Line Drive, Des Moines, 515-243-6111; www.milb.com/iowa.\nRunners-up: Iowa Wild; Drake Bulldogs\nBest Local Place to Go Swimming\nValley View Aquatic Center\nThose months out of the year when the Midwest weather is behaving, central Iowa families take advantage. With three pools, diving boards, drop slides, water slides and a 600-foot lazy river, the Valley View Aquatic Center has all the attributes to earn CITYVIEW readers’ vote for Best Local Place to Go Swimming. 255 81st St., West Des Moines, 515-273-0705; www.wdm.iowa.gov/Home/Components/FacilityDirectory/FacilityDirectory/3/1433.\nRunners-up: Clive Aquatic Center; Cascade Falls Aquatic Center\nBest Local Place to Bowl\nSpare Time Entertainment\nThe crack of the pins, the disappointment of a gutter ball and the clink of a glass poured full from a pitcher are some of the sights and sounds provided by a bowling alley. At Spare Time Entertainment, there’s more to do than just roll the rock, but they do that the best, garnering the business the title of Best Local Place to Bowl from CITYVIEW readers. 340 Jordan Creek Parkway, West Des Moines, 515-414-2824; www.sparetimeentertainment.com/desmoines.\nRunners-up: Val Lanes; Air Lanes Bowling\nBest Local Indoor Sporting Event\nIowa Wild\nThe Iowa Wild was recently awarded the Marketing Campaign of the Year award in the American Hockey League. Their promotions, giveaways and fan engagement are some of the best in the country — not to mention the nonstop exciting action offered by a hockey game. CITYVIEW readers attest, an Iowa Wild game is the Best Local Indoor Sporting Event of the metro. Games played at Wells Fargo Arena, 515-564-8700; www.iowawild.com.\nRunners-up: Des Moines Buccaneers; Drake Bulldogs Basketball\nBest Local Outdoor Sporting Event\nIowa Cubs\nOnce again, CITYVIEW readers’ vote for Best Local Sports Team is their choice for Best Local Outdoor Sporting Event. The chance to catch a foul ball, T-shirt or hot dog is just as exciting as the play on the field for Iowa Cubs fans. Principal Park is routinely touted as one of the nicest AAA stadiums in the country. Lucky us. 1 Line Drive, Des Moines, 515-243-6111; www.iowacubs.com.\nRunners-up: Discmania Challenge; Drake Relays\nBest Local Farmers Market\nDes Moines Downtown Farmers’ Market\nWith some of the best farmland in the entire world right here in Iowa, it makes sense that Des Moines would have such a fantastic Farmers Market and that it would earn the title Best Local Farmers Market from CITYVIEW readers. Vendors set up for the Des Moines Downtown Farmers Market from May until the end of October, providing patrons with great food, wares, art and much more. 300 Court Ave., Des Moines, 515-286-4950; www.dsmpartnership.com/desmoinesfarmersmarket.\nRunners-up: Valley Junction Farmers Market; Uptown Ankeny Farmers Market\nBest Local Camping Spot\nJester Park\nA camping trip is perfect for those outdoorsy folks who want to get away from the city for a day or three. Lucky for them, Jester Park Campgrounds, the Best Local Camping Spot, as chosen by CITYVIEW readers, is a short drive from anywhere in the metro. Available are 148 campsites along the lakeshore and across the wooded hills overlooking Saylorville Lake, with 80 electric sites, 62 non-electric sites, and 1,661 acres of land to explore. 12130 N.W. 128th St., Granger, 515-323-5338; www.polkcountyiowa.gov/conservation/parks-trails/jester-park.\nRunners-up: Cutty’s Des Moines Camping Ground; Cherry Glen Campground\nBest Local Place to Have an Adult Birthday Party\nYour Private Bar\nBirthday parties shouldn’t stop when you reach adulthood. And for Your Private Bar, they certainly don’t. Being able to say you made it another year around the sun is a great built-in excuse to celebrate, and CITYVIEW readers think the Best Local Place to Have an Adult Birthday Party is Your Private Bar. 1701 25th St., West Des Moines, 515-599-1205; www.yourprivatebar.com.\nRunners-up: AJ’s on East Court; Smash Park\nBest Local Wedding Venue\nGreater Des Moines Botanical Garden\nThe Best Local Place to Bring Visitors is also voted as the Best Local Wedding Venue by CITYVIEW readers. The Botanical Garden has indoor and outdoor wedding options, with backdrops like no other, no matter the season. 909 Robert D. Ray Drive, Des Moines, 515-323-6290; www.dmbotanicalgarden.com.\nRunners-up: Magnolia Farms; Curate\nBest Local Event Decor/Rental Company\nBella Flora Event Design\nBella Flora Event Design says, “The creative and professional talent at Bella is passionate and diverse, and this continues to inspire us to create beauty in various environments.” CITYVIEW readers agree, voting the company Best Local Event Décor/Rental Company. 3100 Justin Drive, Urbandale, 515-554-6964; www.bellafloraeventdesign.com.\nRunners-up: The Wedding Trailer; Let’s Slumber It\nBest Local Special Events Venue (non-wedding)\nYour Private Bar\nWe’ve started to lose track of how many awards Your Private Bar racked up this year. You can add Best Local Special Events Venue (non-wedding) to the list. 1701 25th St., West Des Moines, 515-599-1205; www.yourprivatebar.com.\nRunners-up: Greater Des Moines Botanical Center; Destination Grille\nBest Local Spot to Pop the Question\nGreater Des Moines Botanical Center\nNamed the Best Local Wedding Venue as well as the Best Local Spot to Pop the Question, the Greater Des Moines Botanical Center provides what CITYVIEW readers say is a great spot for the proposal and the ceremony, assuming the answer is “yes.” 909 Robert D. Ray Drive, Des Moines, 515-323-6290; www.dmbotanicalgarden.com.\nRunners-up: AJ’s on East Court; Pappajohn Sculpture Park\nBest Local Landmark\nIowa State Capitol\nThe site for the most important political actions in Iowa is also the metro area’s Best Local Landmark, and for good reason. The capitol building is one of the most stunning in the country. Inside, the library is one of a kind in its beauty and the rotunda is breathtaking. 1007 E. Grand Ave., Des Moines, 515-281-5591; www.legis.iowa.gov/resources/tourCapitol.\nRunners-up: Pappajohn Sculpture Park; The Traveler’s Sign\nHEALTH & BEAUTY\nBest Local Pharmacy\nMedicap Pharmacy\nMedicap Pharmacies, voted Best Local Pharmacy by CITYVIEW readers, can be found throughout the metro, serving thousands of residents’ needs for medications, vaccines, vitamins, medical equipment and more. Multiple locations; www.mymedicappharmacy.com.\nRunners-up: Hy-Vee; Walgreens\nBest Local Place to get LASIK Eye Surgery\nWolfe Eye Clinic\nAccording to GoLASIK, more than 30 million people have benefited from LASIK eye surgery since it was FDA approved. The popular procedure has benefits for individuals who are near and far sighted. Wolfe Eye Clinic does it the Best according to CITYVIEW readers. Multiple locations; www.wolfeeyeclinic.com.\nRunners-up: Des Moines Eye Surgeons; Associated Ophthalmologists\nBest Local Place to Kickbox\nFarrell’s eXtreme Bodyshaping\nLearn some self-defense or just work up a sweat with kickboxing. The activity is a massive calorie burner sure to shed some pounds, all at Farrell’s eXtreme Bodyshaping, voted the Best Local Place to Kickbox. Multiple metro locations; www.extremebodyshaping.com.\nRunners-up: Krave Gym; Brickhouse Fitness\nBest Local Martial Arts Studio\nBlack Eagle Martial Arts\nFamily-friendly Black Eagle Martial Arts is the martial arts school of Grandmaster Son, Young-Gul. Learn and practice taekwondo, hapkido and kuhapdo at CITYVIEW readers’ choice for Best Local Martial Arts Studio. 5905 Ashworth Road, West Des Moines, 515-226-1960; www.blackeaglemartialarts.us.\nRunners-up: Triumph Martial Arts; Bishops Elite Martial Arts Academy\nBest Local Group Fitness\nFarrell’s eXtreme Bodyshaping\nIf you’re looking for a different kind of fitness, look no further than Farrell’s. Fitness, nutrition, accountability and results are the main tenets for these body shapers. Their 10-week high intensity interval training can help you reach your lofty fitness goals. Don’t go it alone. Join others at the Best Local Group Fitness, as voted on by CITYVIEW readers. Multiple metro locations; www.extremebodyshaping.com.\nRunners-up: The Sandlot; Rooted Yoga + Fitness\nBest Local Running Event\nEMC DAM to DSM\nThe tradition continues on May 31, 2025, when the 46th DAM to DSM marathon, the Best Local Running Event, according to CITYVIEW readers, is held. It will start at the Saylorville Dam and bring those brave enough to take stride into downtown Des Moines. Those who finish will have cold beer waiting for them. www.damtodsm.com.\nRunners-up: Des Moines Marathon; Drake Relays\nBest Local Personal Trainer\nAshley Wilson, Iron Chapel Barbell\nA good personal trainer can put you on a fitness journey you’ll never want to stop. With the myriad of diets and exercises going viral every other day, it’s hard to know what the best course of action is, making a personal trainer hard to beat. Ashley Wilson at Iron Chapel Barbell is the Best Local Personal Trainer, according to CITYVIEW voters. 812 S.W. Cherry St., Suite 102, Ankeny, 641-275-5987; www.ironchapelbb.com.\nRunners-up: Anthony Wilson, Iron Chapel Barbell; Justin Shepherd, MOJO’s GYM\nBest Local Orthodontist\nStork Orthodontics\nSet up either you or your child — or both — with a straight set of teeth and beautiful smile with the CITYVIEW’s Best of Des Moines’ Best Local Orthodontist at Stork Orthodontics. A healthy, bright smile can make all the difference in one’s life. Stork Orthodontics wins this category once again. 4090 Westown Parkway, Suite 101, West Des Moines, 515-608-8722; www.storkorthodontics.com.\nRunners-up: Johnson Orthodontics; Ankeny Orthodontics\nBest Local Place to Work Out\nIron Chapel Barbell\nIron Chapel Barbell wins the Best Local Place to Work Out category once again. It could be thanks to two of their trainers, Ashley Wilson, who won Best Local Personal Trainer, and Anthony Wilson, who was a runner up, co-founders and co-owners of the gym. 812 S.W. Cherry St., Suite 102, Ankeny, 641-275-5987; www.ironchapelbb.com.\nRunners-up: Farrell’s eXtreme Bodyshaping; MOJO’S GYM\nBest Local Yoga Studio\nPower Life Yoga Barre Fitness\nYoga is one of the most relaxing forms of exercise. It can give you a great stretch, help you learn breathing techniques and put your mind at ease — all while getting a great workout. Power Life Yoga Barre Fitness tops the votes to be named Best Local Yoga Studio. Check their website for classes and training to get you started. Multiple locations; www.powerlife.com.\nRunners-up: Rooted Yoga + Fitness; Yoga & Co.\nBest Local Maternity Care or Birthing Center\nUnityPoint Iowa Methodist Medical Center\nBecoming a parent is one of the most memorable times in one’s life. UnityPoint Iowa Methodist Medical Center was voted the Best Local Maternity Care or Birthing Center by CITYVIEW readers. 1200 Pleasant St., Des Moines, 515-241-6212; www.unitypoint.org/locations/unitypoint-health—iowa-methodist-medical-center.\nRunners-up: MercyOne Des Moines Maternity & Infants’ Care; Broadlawns Medical Center\nBest Local Place To Get Your Eyelashes Done\nDollhouse Lash and Brow\nExtensions, laminations, lifts, tinting, staining and more are options customers have at this year’s Best Local Place To Get Your Eyelashes Done, Dollhouse Lash and Brow. 2105 Ingersoll Ave., Suite 103, Des Moines, 515-441-3861; www.dollhousedsm.com.\nRunners-up: Coachlight Clinic & Spa; Nova MedSpa\nBest Local Place to Get a Massage\nEast Village Spa\nAt East Village Spa, they say, “Every. Body. Welcome.” A trip to the spa during a day of shopping in the East Village can enhance your afternoon. Or, take the whole day and let yourself be pampered by a range of the services offered at CITYVIEW readers’ choice for Best Local Place to Get a Massage. 601 E. Locust St., Suite 202, Des Moines, 515-309-2904; www.evdayspa.com.\nRunners-up: Massages by Andrea; Veda Grey Wellness\nBest Local Place to Get Your Nails Done\n4 Seasons Nails & Spa\nTreat your fingers and toes to some sprucing up. With manicure and pedicure options available, including plenty of nail enhancement services to make your hands pop, 4 Seasons Nails & Spa is the CITYVIEW voters’ choice for this category. Multiple locations; www.4seasonnailsandspa.com.\nRunners-up: East Village Spa; Premier Nail Bar\nBest Local Herbal/Nutritional Supplement Store\nCampbell’s Nutrition\nCampbell’s Nutrition started in 1937 as a local juicer and lunch counter. Now, the family-owned business is committed to promoting the health and well-being of its customers. When it comes to Herbal/Nutritional Supplement Store, CITYVIEW readers say it’s the best. Locations in Des Moines and Urbandale; www.campbellsnutrition.com.\nRunners-up: Fit Pharm Nutrition; Elevate Nutrition\nBest Local Tattoo Studio\nLucky Gal Tattoo and Piercing\nA wide range of art styles can be found in the world of tattooing. Cybersigilism, American traditional, realism — the list goes on and on. Lucky Gal has tattoo shops throughout the metro area, and it’s likely one of their artists can give you the tattoo you’re in search of, after all, Lucky Gal is CITYVIEW readers’ choice for Best Local Tattoo Studio. Careful though, tattoo fever is real, and a good one will have you coming back for more before you know it. Locations in Ankeny, Clive, Waukee and Des Moines southside; www.luckygaltattoo.com.\nRunners-up: Pink Elephant Tattoo & Piercing Studio; Empire Tattoo\nBest Local Body Piercing Shop\nPrysm Jewelry & Piercing\nSince 2011, Prysm Jewelry & Piercing has crafted some of its own jewelry. You can even design your own pieces, customized to your style and features. They say anything is possible, and CITYVIEW readers say they are the Best Local Body Piercing Shop. Appointment required. 13101 University Ave., Suite 2, Clive, 515-868-4653; www.prysmpiercing.com.\nRunners-up: Mint Piercing Studio; Lucky Gal Tattoo and Piercing\nBest Local Place for Cosmetic Surgery\nDes Moines Plastic Surgery\nWhen it comes to cosmetic surgery, the best place to go, according to CITYVIEW readers, is Des Moines Plastic Surgery. Plastic surgery is more than your Hollywood facelifts. While that is an option, many other procedures allow you to improve your self-esteem or enhance a feature. Fun fact, Des Moines Plastic Surgery was the first fully accredited surgical center in Des Moines. 6420 Coachlight Drive, Suite 100, West Des Moines, 515-221-9999; www.dsmplasticsurgery.com.\nRunners-up: Koch & Carlisle Plastic Surgery & Spa; The Iowa Clinic\nBest Local Permanent Makeup Salon\nPinpoint Permanent Cosmetics\nWith treatment options for brows, eyes and lips, Pinpoint Permanent Cosmetics has made a permanent impression on CITYVIEW readers, who voted it Best Local Permanent Makeup Salone. Their services are a way to enhance one’s natural beauty. 2635 Berkshire Parkway, No. 100, Clive, 515-823-8579;\nwww.pinpointpermanentcosmetics.com.\nRunners-up: Nova MedSpa; Layochè Beauty\nBest Local Tanning Salon\nTanique\nFounded in 2013, Tanique was a runner up for Best Local Tanning Salon in 2024 but takes the top spot in 2025. Getting that perfect tan can be hard in the harsh winters of the Midwest, but Tanique can help you achieve the look you want, all year round. Multiple locations; www.tanique.com.\nRunners-up: Bronze515; Sun Tan City\nBest Local Waxing Salon\nMetroWaxx\nFor nine years in a row, MetroWaxx has won the award for Best Local Waxing Salon in Best of Des Moines polling. Their services range “from backs to butts to legs and brows.” Get rid of those pesky hairs and have your skin feeling smooth as silk. Locations in Des Moines, Ankeny and Johnston; www.metrowaxx.com.\nRunners-up: Beaudee by Brandee; vIVid Life Spa\nBest Local Place for Non-Surgical Cosmetic Treatment\nCoachlight Clinic & Spa\nBack-to-back wins for Coachlight Clinic & Spa as Best Local Place for Non-Surgical Cosmetic Treatment. Procedures include injectables, laser treatments and more to make you feel and look your best. Locations in Des Moines and Ankeny; www.dsmcoachlight.com.\nRunners-up: Skin By Knight; Nova MedSpa\nBest Local Spa\nCoachlight Clinic & Spa\nA spa day makes for the perfect reset, a way to pamper yourself, a great gift, and even a fun way to spend time with friends or a date. Get a scrub, a facial, a soak, a mani or a pedi and feel rejuvenated — especially if it’s at The Best Local Spa, according to CITYVIEW readers. Locations in Des Moines and Ankeny; www.dsmcoachlight.com.\nRunners-up: East Village Spa; ReNew You Spa and Suites\nBest Local Holistic Health Center\nThrive Family Chiropractic\nA painful back can put a wrench in any plans you have. It can be a pain standing, bending over, getting up, you name it. At Thrive, the goal is to “help the local Urbandale community reach that maximum potential through a holistic, non-invasive and whole-body approach to health and wellness by providing the best, most advanced chiropractic care available.” Best Local Holisitc Health Center is certainly correct according to votes of CITYVIEW readers. 3935 N.W. Urbandale Drive, Urbandale, 515-635-1161; www.thrivefamilydsm.com.\nRunners-up: Vero Health Center; Nova MedSpa\nBest Local Hair Salon\nHair by Ashley Haack\nA runner up last year, Best Local Hair Salon this year. Reviews for Ashley Haack’s hair service include quotes like “Awesome and super knowledgeable” and “Ashley is a true testament to all things hair.” Book an appointment and get started on a new hairstyle journey. 2615 86th St., Urbandale, 515-371-8391; www.facebook.com/hairbyashleyhaack.\nRunners-up: Ethereal Beauty Lounge; Salon Vici\nBest Local Health Food Store\nCampbell’s Nutrition\nAnother year for Campbell’s Nutrition being named CITYVIEW readers’ choice for both Best Local Herbal/Nutritional Supplement Store and Best Local Health Food Store. Find 100% organic produce in their aisles. Locations in Des Moines and Urbandale; www.campbellsnutrition.com.\nRunners-up: Gateway Market; Fresh Fit Meals\nBest Local Family Planning Services\nPlanned Parenthood\nPlanned Parenthood offers many services from health care options to education and more. This winner of Best Local Family Planning Services in the Best of Des Moines poll offers expert sexual and reproductive health care in a safe and welcoming environment. Locations in Des Moines, Urbandale and Ames; www.plannedparenthood.org.\nRunners-up: AGAPE; InnerVisions HealthCare\nBest Local Chiropractor\nThrive Family Chiropractic\nAlso winner of Best Local Holistic Health Center, Thrive Family Chiropractic wins the award for Best Local Chiropractor according to Best of Des Moines voters. 3935 N.W. Urbandale Drive, Urbandale, 515-635-1161; www.thrivefamilydsm.com.\nRunners-up: True Roots Chiropractic; Vero Health Center\nBest Local Doctor’s Clinic\nThe Iowa Clinic\nMost people dread a trip to the doctor’s office. But not CITYVIEW readers who go to The Iowa Clinic, which they voted Best Local Doctor’s Clinic, for their medical needs. Multiple locations; www.iowaclinic.com.\nRunners-up: UnityPoint Clinic Family Medicine; MercyOne Family Medicine\nBest Local Eye Clinic\nWolfe Eye Clinic\nCITYVIEW readers’ choice for Best Local Eye Clinic, Wolfe Eye Clinic, has been providing care for patients since 1919, specializing in cataracts, cornea disease, glaucoma, LASIK eye surgery, oculofacial plastics, pediatric eye care and retina disease. Their eye surgeons are fellowship-trained for their specific fields of study. Multiple locations; www.wolfeeyeclinic.com.\nRunners-up: Des Moines Eye Surgeons; Elite Eye Care\nBest Local Hearing Center\nMerit Hearing\nWe heard the readers loud and clear on this one. Merit Hearing is the Best Local Hearing Center according to Best Of Des Moines voters. Its team of audiologists and support staff will get your ears functioning to the best of their ability. Multiple locations; www.merithearing.com.\nRunners-up: The Iowa Clinic; Iowa Ear Center\nBest Local Hospital\nUnityPoint Health Iowa Methodist Medical Center\nFor seven years in a row, UnityPoint Health Iowa Methodist Medical Center has captured the Best Local Hospital category in Best of Des Moines polling. Each year, UnityPoint serves just shy of 8 million patients, performs nearly 100,000 surgeries and delivers more than 20,000 babies. 1200 Pleasant St., Des Moines, 515-241-6212; www.unitypoint.org/desmoines/iowa-methodist-medical-center.aspx.\nRunners-up: MercyOne Medical Center; Broadlawns Medical Center\nBest Local Physical Therapy Clinic\nCore Physical Therapy\nWhen going through physical therapy for whatever reason, whether it be recovering from an injury or surgery, the road can be difficult. The professionals of Core Physical Therapy, Best Local Physical Therapy Clinic according to CITYVIEW readers, target the pain and use their expert skills to get you back to 100% Locations in West Des Moines and Adel; www.coreptiowa.com.\nRunners-up: Integrated Physical Therapy & Sports Medicine; Rock Valley Physical Therapy\nBest Local Dentist Office\nFleur Dentistry\nAdd another tally to Fleur Dentistry as CITYVIEW reader’s choice for the Best Local Dentist Office. Since 2017, Best of Des Moines voters have chosen this practice when they need to get a cavity filled, tooth cleaned or just a regular ol’ checkup. 4551 Fleur Drive, Des Moines, 515-287-2493; www.fleurdentistry.com.\nRunners-up: Furrow Family Dentistry; Grove and Platt Dental Associates\nBest Local Pediatric Clinic\nWaggoner Pediatrics\nWaggoner Pediatrics has dominated the Best Local Pediatric Clinic category for the better part of a decade now, making this their 11th time as CITYVIEW readers’ top vote-getter. Waggoner Pediatrics has been in business for 25 years serving children’s health care needs in an expert fashion. 2555 Berkshire Parkway, Suite A, Clive, 515-987-0051; www.waggonerpediatrics.org.\nRunners-up: Des Moines Pediatrics; The Iowa Clinic\nBest Local Dermatology Clinic\nDermatology P.C.\nMetro residents’ skin gets exposed to all of the elements. From high heat to polar vortex cold, droughts or snow and rainfall. It’s important to take care of that skin. Dermatology P.C. has been recognized as a Center of Excellence in Dermatology. And CITYVIEW readers agree, voting it the Best Local Dermatology Clinic. Multiple locations; www.dermatologypc.com.\nRunners-up: Greater Des Moines Dermatology; Ducharme Dermatology\nBest Place for Laser Hair Removal\nCoachlight Clinic & Spa\nAdd another award to Coachlight Clinic & Spa’s haul in 2025. When you’re not interested in the pain of wax or the dangers of a shave, Coachlight is the Best Place for Laser Hair Removal according to Best Of Des Moines voters. 6420 Coachlight Drive, Suite 200, West Des Moines, 515-221-9999; www.dsmcoachlight.com.\nRunners-up: Milan Laser Hair Removal; Nova MedSpa\nBest Local Orthopedic Clinic\nDMOS Orthopaedic Centers\nSince 1955, DMOS has provided the metro area with a wide range of services aimed to support patients with musculoskeletal conditions. Their advanced technology helps patients get the best care possible. DMOS wins the Best Local Orthopedic Clinic category once again in Best of Des Moines polling. Locations in Des Moines, West Des Moines and Ankeny; www.dmos.com.\nRunners-up: Iowa Ortho; Capital Orthopaedics & Sports Medicine\nBest Local Mental Health Clinic\nMagnolia Connection\nMental health is just as important as your physical health. Magnolia Connection, CITYVIEW readers’ choice for Best Local Mental Health Clinic, offers psychological testing, medication management and therapy for those looking for mental health services. 1300 Turnberry Drive, Suite 4, Norwalk, 515-994-8255;\nwww.magnoliaconnection.com.\nRunners-up: Ellie Mental Health of Des Moines; Optimae LifeServices\nBest Local CBD Store\nYour CBD Store\nYour CBD Store has a wide range of products to help the mind, assist with sleep, bring your mood up or relax your body, which may be why CITYVIEW readers voted it the Best Local CBD Store. Locations in Ankeny, Valley Junction, Des Moines, Waukee and Ames;\nwww.getsunmed.com.\nRunners-up: CBD American Shaman; Fit Pharm Nutrition\nBest Local Allergy or Immunology Clinic\nIowa Allergy, Asthma & Immunology\nHaving your day derailed by a bout with allergies can be frustrating. Sniffles, itchy eyes, bumps or coughs can overtake you. Iowa Allergy, Asthma & Immunology, voted Best Local Allergy or Immunology Clinic by CITYVIEW readers, can help quell those ailments. Locations in West Des Moines and Ankeny; www.iowaallergyclinic.com.\nRunners-up: Pediatric and Adult Allergy; The Iowa Clinic\nBest Local Home Health Provider\nOptimae LifeServices\nOptimae LifeServices has been voted the Best Local Home Health Provider by CITYVIEW readers. The Iowa-based, employee-owned company has been in business since 1987. Their motto is “At your side. On your side.”\n513 E. Sixth St., Des Moines, 515-283-1230;\nwww.optimaelifeservices.com.\nRunners-up: UnityPoint at Home; Comfort Caring Home Care\nBEST OF THE REST\nBest Elected Official\nGovernor Kim Reynolds\nIt’s the seventh year in a row for Governor Kim Reynolds to be voted the Best Elected Official by Best of Des Moines voters. Iowa State Capitol, 1007 E. Grand Ave., Des Moines, 515-281-5211; www.governor.iowa.gov.\nRunners-up: State Auditor Rob Sand; Des Moines Mayor Connie Boesen\nBest Local Home Painter\nPeterson Painting\nNothing brightens up a room or a house than a fresh coat of paint. Peterson Painting offers interior, exterior and commercial painting. When it comes to doing the job well, CITYVIEW readers say Peterson Painting is the Best Local Home Painter. 2110 63rd St., Windsor Heights, 515-274-1883; www.petersonpainting.net.\nRunners-up: Harmony Painting; GLS Painting\nBest State University in Iowa\nIowa State University\nIs that a tornado siren we hear? For another year running, Iowa State University has been voted the Best State University in Iowa by Best Of Des Moines voters. The school has excellent engineering, agriculture and veterinarian programs, just to a name a few. Choose your adventure. Ames, 515-294-4111; www.iastate.edu.\nRunners-up: University of Iowa; University of Northern Iowa\nBest Private College or Private University in Iowa\nDrake University\nDrake University continues to impress people with high-quality athletic programs while maintaining one of the best journalism schools in the nation among its academic offerings. CITYVIEW readers have once again voted Drake University the Best Private College or Private University in Iowa. 2507 University Ave., Des Moines, 1-800-44-DRAKE; www.drake.edu.\nRunners-up: Simpson College; Grand View University\nBest Community College in Iowa\nDes Moines Area Community College\nDMACC has several campuses providing students a great alternative to a state or private university. DMACC offers more than 220 programs, certificates and transfer degrees. CITYVIEW readers’ choice for Best Community College in Iowa has campuses in Ankeny, Boone, Carroll, Newton, Des Moines and West Des Moines with additional learning centers around the metro; www.dmacc.edu.\nRunners-up: Kirkwood Community College; Iowa Central Community College\nBest Local Doggy Daycare/Boarding\nPaws & Pints\nPaws & Pints has ample space and activities available for dogs. The Best of Des Moines poll’s Best Local Doggy Daycare/Boarding will even have its Paws Pickup service come get your dog for its doggy daycare or grooming appointment. 6218 Willowmere Drive, Des Moines, 515-969-2275; www.pawsandpintsdsm.com.\nRunners-up: Downtown Doggy Daycare; 4 Paws Unleashed\nBest Local Employer\nScottish Rite Park\n“Simply elegant senior living,” says Scottish Rite Park. With an art gallery, fitness center, movie theater, pool, spa and so much, this senior living center is not only a great place to live, but, according to CITYVIEW readers, a great place to work, earning it the Best Local Employer title. 2909 Woodland Ave., Des Moines, 515-274-4614;\nwww.scottishritepark.com.\nRunners-up: Principal Financial Group; Optimae LifeServices\nBest Local Home Improvement Company\nRight Roofing & Siding\nWho do you call if your home or business need an overhaul? Fear not, because Right Roofing & Siding will make your exterior shine. Check out their work on their website and see why CITYVIEW readers voted the business the Best Local Home Improvement Company. 3250 99th St., Urbandale, 515-305-3113; www.rightroofing.com.\nRunners-up: Van Woert Construction; Andrew’s Roofing Company\nBest Local Dog Groomer\nStylin’ Paws\nEven our furry family members deserve to be pampered. Keep your dog looking spiffy with a grooming at Stylin’ Paws, Best Local Groomer according to CITYVIEW readers. Locations in Clive and Urbandale; www.stylinpawssalon.com.\nRunners-up: Bark Shop; Clipper-Doodle-Do\nBest Local Moving Company\nTWO MEN AND A TRUCK\nYou’ve likely seen their white trucks somewhere around the Des Moines metro at one point or another. And it appears enough of you have even used their moving services, with TWO MEN AND A TRUCK being voted Best Local Moving Company by CITYVIEW readers. 2601 104th St., Suite 400, Urbandale, 515-216-3654; www.facebook.com/TwoMenAndATruckDesMoines.\nRunners-up: Adamantine Spine Moving; The Affordable Movers\nBest Local Credit Union\nVeridian Credit Union\nVeridian Credit Union has been voted Best Local Credit Union every year since CITYVIEW added the category to the Best of Des Moines poll. Veridian Credit Union started in 1934 as the John Deere Employees Credit Union and has become a staple financial institution in the metro. Multiple locations; www.veridiancu.org.\nRunners-up: Community Choice Credit Union; GreenState Credit Union\nBest Local Bank\nWest Bank\nWest Bank was founded the same year as the city of West Des Moines — 1893. Since then, it has built a trust with customers and earned the nod from Best of Des Moines voters who chose it as Best Local Bank. Multiple locations; www.westbankstrong.com.\nRunners-up: Bankers Trust; Compass Mortgage, a Fortress Bank Company\nBest Local Internet Provider\nMetronet\nMetronet has plenty of options to get you set up with internet service. Routers typically come included as well as free installation in many of their plans. They pride themselves on their customer service, which likely led to CITYVIEW readers voting the company Best Local Internet Provider. 1311 Buckeye Ave., Suite A, Ames. 855-595-1006; www.metronet.com.\nRunners-up: Mediacom; Google Fiber\nBest Local Auto Shop\nShade Tree Auto\nOwner Clint Dudley started Shade Tree Auto in a small garage. Since then, the do-it-all auto shop has expanded to several locations across the metro, all with just as good of service as the last, garnering it CITYVIEW readers’ choice for Best Local Auto Shop. Multiple locations; www.shadetreeauto.biz.\nRunners-up: FinishLine Auto Works; Mobile Super Service\nBest TV Station for News\nKCCI 8\nKCCI 8 wins Best TV Station for News again for its comprehensive TV news coverage. Best of Des Moines voters turn to station when looking for up-to-the-minute updates on what’s happening in the metro, Iowa and nation. www.kcci.com.\nRunners-up: WHO 13; WOI 5\nBest TV Station for Sports\nWHO 13\nRVTV and SoundOFF are massive favorites for sports fans in the Des Moines area looking for local sports coverage. The sports team at WHO 13 shares the highlights, stories and, whether you agree with them or not, the opinions, earning it the Best TV Station for Sports title in Best of Des Moines polling. www.who13.com.\nRunners-up: KCCI 8; KDSM FOX 17\nBest TV Station for Weather\nKCCI 8\nLiving in an area where the weather can go from rain to shine, clear skies to blizzard conditions in the blink of an eye, it’s important to know when and what kind of weather is headed our way. CITYVIEW readers look to KCCI 8, the Best TV Station for Weather, for the forecast. www.kcci.com.\nRunners-up: WHO 13; WOI 5\nBest Local TV Anchor\nErin Kiernan, WHO 13\nErin Kiernan has been with the WHO 13 news team since 2005 and has racked up the awards ever since for her reporting. Kiernan is a Drake University graduate and, according to Best Of Des Moines voters, the Best Local TV Anchor. www.who13.com.\nRunners-up: Stacey Horst, KCCI 8; Andy Fales, WHO 13\nBest Local Sports Commentator or Columnist\nKeith Murphy, WHO 13\nKeith Murphy takes the Best Local Sports Commentator of Columnist title once again for his undeniable ability to cover local sports with a talent worthy of the national scene. His work in local sports television will be a benchmark for future commentators and columnists for years to come. www.who13.com.\nRunners-up: Scott Reister, KCCI 8; Shannon Ehrhardt, KCCI 8\nBest Meteorologist\nEd Wilson, WHO 13\nEd Wilson has covered many major storms that have come through Iowa during his tenure as WHO 13’s meteorologist. Tornados, blizzards, massive rainfall and flooding, he’s seen it all as CITYVIEW readers’ choice for Best Meteorologist. Don’t worry, Wilson covers and delivers the good weather news as well. www.who13.com.\nRunners-up: Jason Sydejko, KCCI 8; Jeriann Ritter, WHO 13\nBest Radio Voice that Turns You On\nTina Manbeck. KFMG 98.9 FM\nTina Manbeck is the host of The Celtic Music Show every Sunday night from 8-10 p.m. She likes to prep for her show with traditional foods like bangers and mash or maybe even a pint of Belhaven Kilted Pilsner. Whatever works best to deliver her radio show. And, when it comes to Best Radio Voice that Turns You on, she has it, say CITYVIEW readers. www.kfmg.org/staff/tina-manbeck.\nRunners-up: Heather Lee, LAZER 103.3; Marty Enslow, KFMG 98.9 FM\nBest Radio Station\nKFMG 98.9 FM\nKFMG 98.9 wins the award for Best Radio Station again. Whether you’re looking to jam out during your morning or evening commute, pass the time in the garage or want to hear some great radio content from anyone of their varying programs, they consistently keep CITYVIEW readers entertained. www.kfmg.org.\nRunners-up: Life 107.1; WHO 1040 AM\nBest Radio Personality\nMarty Enslow, KFMG 98.9 FM\nAlso home to the Best Radio Voice that Turns You On, the Best Radio Station, FMFG 98.9, also features the Best Radio Personality, Marty Enslow, host of the Radio Mardi Archives. Enslow brings tunes from 1966-76 to the radio and into your ears. www.kfmg.org/staff/marty-enslow\nRunners-up: Danger, NASH FM 97.3; Simon Conway, WHO 1040 AM\nBest Local Real Estate Agent\nTim Scheib, Scheib Real Estate Team\nThe housing market is a tricky one. When you can’t keep track of when it’s a good time to buy or sell, the Best Local Real Estate Agent, Tim Scheib of Scheib Real Estate Team, can help. www.scheibrealestate.com.\nRunners-up: Tina Johnson, Tina Stevie & Co.; Jason Rude, Rude Realty Team\nBest Local Automotive Salesperson\nHeidi Brickman, Stew Hansen Dodge Ram Chrysler Jeep\nHeidi Brickman was a runner up in the Best Local Automotive Salesperson category last year but wins it this year. For some people, cars are just meant to take you from A to B. Others have more questions about a potential vehicle purchase than you can count. Either way you shake it, Best Of Des Moines voters chose Brickman as the best in her business. www.stewhansens.com.\nRunners-up: Mark Hermosillo, Karl Chevrolet; PJ Caffrey, Toyota of Des Moines\nBest Local Photographer\nChris Pose\nA quick glance at his website will reveal why Chris Pose was on the mind of CITYVIEW readers when they voted for Best Local Photographer. His work photographing local swimming events, among many others, is second to none. www.cposephoto.pixieset.com.\nRunners-up: Pic Your House; Belma Photography\nBest Local Insurance Agent\nAnnaMarie Morrow of Merkle Retirement Planning\nAnnaMarie Morrow, Best Insurance Agent in Best of Des Moines polling, is the in-house director of Medicare at Merkle Retirement Planning. Morrow does it all, from coordinating initial enrollment to helping with decisions during annual open enrollment, all while building lifelong relationships with her customers. www.merkleretirementplanning.com.\nRunners-up: Cody Crumes of Crumes Insurance; Aaron Peterson, AKP Health Insurance\nBest Local Financial Planner\nLoren Merkle, Merkle Retirement Planning\nGet yourself set up right for your golden years with CITYVIEW readers’ choice for Best Local Financial Planner Loren Merkle. Merkle Retirement Planning will connect, strategize and plan your financial future so you are set to live in comfort when it’s time to clock out for the last time. 1860 S.E. Princeton Drive, Grimes, 515-278-1006;\nwww.merkleretirementplanning.com.\nRunners-up: Jeff Lohmeier, Edward Jones; Justin Bjerke, Edward Jones\nBest Local Mortgage Company\nMidwest Family Lending\nApplying for a mortgage can be stressful, even for the most financially sound. Take that stress out of your hands and put it into the ones who, according to Midwest Family Lending, have all the answers. CITYVIEW readers have voted for Midwest Family Lending as the Best Local Mortgage Company for another year. 2753 99th St., Urbandale, 515-252-7107; www.midwestfamilylending.com.\nRunners-up: Compass Mortgage, a Fortress Bank; Key Mortgage Group\nBest Local Vet Clinic\nAshworth Road Animal Hospital\nPut your pets’ medical needs in the hands of CITYVIEW readers’ choice for 2025’s Best Local Vet Clinic, Ashworth Road Animal Hospital. The team there is led by Dr. Jessica Merk, Dr. Sara Niemand, Dr. Samantha Frahm and Dr. Katherine Wiedmann, four knowledgeable veterinarians with more than 44 years of collective experience in their field. 5902 Ashworth Road, West Des Moines, 515-225-1807; www.ashworthpet.com.\nRunners-up: Value Vet; Starch Pet Hospital\nBest Local Home Builder\nClaman Custom Homes\nClaman Custom Homes has a five-step process for stress-free building: meet, plan, design, build, finish. Seems pretty straight forward. The company’s website has galleries for you to view their Best Local Home Builder skills. Polk City, 515-290-7840;\nwww.clamancustomhomes.com.\nRunners-up: KRM Development; Truview Homes\nBest Local Landscaper\nPremier Landscape\nImprove the curb appeal of your home or make the backyard a place you’ll never want to leave with a landscaping project from Premier Landscape. The business earns CITYVIEW readers’ choice as Best Local Landscaper for another year thanks to their dirt movin’, pavement layin’, wall buildin’ skills. West Des Moines, 515-321-5101; www.facebook.com/PremierLandscapeLLC.\nRunners-up: Ted Lare Design Build; Solid Rock Landscaping\nBest Local Chamber of Commerce\nUrbandale Chamber of Commerce\nChambers of commerce are an effective tool for communities to bring in new businesses and bolster existing ones. The Urbandale Chamber of Commerce, voted Best Local Chamber of Commerce in Best of Des Moines polling, helps businesses of all sizes have a voice. 2830 100th St., Suite 110, Urbandale, 515-331-6855; www.uniquelyurbandale.com.\nRunners-up: West Des Moines Chamber of Commerce; Ankeny Area Chamber of Commerce\nBest Local Customer Service (overall)\nMerkle Retirement Planning\nHome to the Best Local Insurance Agent and Best Local Financial Planner, Merkle Retirement Planning has also been voted as having the Best Local Customer Service (overall) by Best Of Des Moines voters. 1860 S.E. Princeton Drive, Grimes, 515-278-1006;\nwww.merkleretirementplanning.com.\nRunners-up: Prysm Jewelry and Piercing; Buenzow Insurance Group\nBest Local Law Firm\nBaer Law Office\nBaer Law Office’s win this year makes it a decade straight as being voted the Best Local Law Firm by CITYVIEW readers. Baer Law Office takes care of its clients. 838 Fifth Ave., Des Moines, 515-279-2000; www.baerlawoffice.com.\nRunners-up: Wasker, Dorr, Wimmer & Marcouiller, P.C.; Rieper Law P.C.\nBest Local Daycare\nGeneration Next Child Development Center and Preschool\nGeneration Next Child Development Center and Preschool has won Best Local Daycare since 2015. They say, “As children grow, we want them to become confident with their ability to function in a group setting and to be a productive member of that group.” Locations in Johnston, Urbandale, Ankeny, West Des Moines and Bondurant; www.generationnextia.com.\nRunners-up: Cadence Academy Preschool; Mundo Pequeño Childcare\nBest Local Marketing Agency\nTwoTone Creative\nTwoTone Creative helps businesses with marketing, websites and branding. The Best Local Marketing Agency, according to CITYVIEW readers, also helps with search engine optimization, graphic design, social media and so much more. 4800 Mills Civic Parkway, West Des Moines, 515-864-6657; www.twotonecreative.com.\nRunners-up: Creative DSM; Flynn Wright\nBest Local Apartment Complex\nTempo East Village Living\nTempo East Village Living is a brand-new apartment complex in the ever-evolving area. They say the building and its apartments were designed with luxury, sustainability and community in mind. All that, and the East Village’s lively culture right outside your door makes this the Best Local Apartment Complex in Best of Des Moines voting. 317 E. Sixth St., Des Moines, 515-335-6484; www.tempoeastvillage.com.\nRunners-up: The Parker at Seventh; City Square Lofts\nBest Local HVAC Company\nBell Brothers Heating and Air Conditioning, Inc.\nBell Brothers Heating and Air Conditioning, Inc., has been getting the job done since 1955. Services of the Best Local HVAC Company, as determined in voting by CITYVIEW readers, range from, of course, heating and air conditioning, to plumbing services and HVAC accessories. 2822 Sixth Ave., Des Moines, 515-318-5856;\nwww.bellbrothers.com.\nRunners-up: Schaal Plumbing, Heating and Cooling; Golden Rule Plumbing, Heating, Cooling & Electrical\nBest Local Senior Living Community\nScottish Rite Park\nAlso voted the Best Local Employer, it looks like Scottish Rite Park gets its right. With plenty of activities for its residents and employees who enjoy working there, it makes for happy community. And, according to CITYVIEW readers, their votes make it the Best Local Senior Living Community. 2909 Woodland Ave., Des Moines, 515-274-4614; www.scottishritepark.com.\nRunners-up: Copper Shores Village; Wesley on Grand\nBest Local Place for Tax Preparation\nAnn M. Hartz, CPA and Associates\nNo one likes doing taxes — except for CITYVIEW readers’ choice for Best Local Place for Tax Preparation, Ann M. Hartz, CPA & Associates. Let them take the stress off your shoulders during tax season. 7109 Hickman Road, Urbandale, 515-259-7779;\nwww.cpadesmoines.com.\nRunners-up: Expedition Wealth Management; Vivid Tax & Wealth Advisors\nBest Local Bathroom Facility\nPrysm Jewelry & Piercing\nA bathroom stop away from your home can be a dice roll when it comes to the experience you will have. But CITYVIEW readers say no need to roll the dice with the Best Local Bathroom Facility at Prysm Jewelry & Piercing. Check it out when getting your next piercing. 13101 University Ave., Suite 2, Clive, 515-868-4653; www.prysmpiercing.com.\nRunners-up: Shade Tree Auto; Bike World\nBest Local Hotel\nHotel Fort Des Moines\n“A grand time capsule reimagined.” If only walls could talk, there must be countless stories at iconic Hotel Fort Des Moines. Names like Elvis, Johnny Cash and John F. Kennedy are just a few who have spent a night in the metro’s Best Local Hotel, according to the Best of Des Moines poll. 1000 Walnut St., Des Moines, 515-528-7733; www.hotelfortdesmoines.com.\nRunners-up: Surety Hotel; Des Lux Hotel\nBest Local Plumber\nH & H Plumbing\nH & H Plumbing wins Best Local Plumber, as voted on by CITYVIEW readers, once again. From the sink to the sump pump, H&H Plumbing has your needs covered. 32411 170th St., Granger, 515-277-5755;\nwww.handhplumbing.net.\nRunners-up: AM PM Plumbing; Bell Brothers Heating and Air Conditioning, Inc.\nBest Local Electric Company\nB&L Electric\nB&L Electric provides residential and commercial electric services. For those of you with an electric vehicle, the Best Local Electric Company in Best of Des Moines polling, is authorized to install numerous charging stations for many of the top models. 10861 Douglas Ave., #B, Urbandale, 515-212-3277; www.bandlelectriciowa.com.\nRunners-up: Webster Electric; Arc Electric\nBest Local Flooring Company\nRoyal Flooring\nIt’s as easy as 1-2-3 with Royal Flooring. Select a time, pre-select a product — from hardwood, tile, carpet or vinyl — and receive an estimate from Best of Des Moines voters’ choice for Best Local Flooring Company. 11801 Hickman Road, Urbandale, 515-957-9738; www.shoproyalflooring.com.\nRunners-up: Louie’s Floor Covering; The Flooring Guys\nBest Local Roofing Company\nAndrew’s Roofing Company\nThis locally owned and family operated roofing business has 17 years of experience putting roofs over customers’ heads. Andrew’s Roofing Company, named Best Local Roofing Company by CITYVIEW readers, does residential roofing, solar, rubber, inspections and more. 1544 Second Ave., Des Moines, 515-664-7968;\nwww.andrewsroofingdm.com.\nRunners-up: Right Roofing & Siding; Walter Roofing\nBest Local Contractor\nVan Woert Construction\n“Whatever it takes, we make it happen,” says Van Woert Construction, selected Best Local Contractor by CITYVIEW readers. Full remodels to regular updates, tile installation and much more are all possible with Van Woert Construction. Des Moines, 515-344-3338;\nwww.danavanwoert.com.\nRunners-up: Right Roofing & Siding; Amazed Construction Services\nBest Local Interior Designer\nDana Van Woert Interiors\nDana Van Woert Interiors is new on the scene but is already impressing. Van Woert Construction and Dana Van Woert Design, voted Best Local Designer in the Best of Des Moines poll, are separate entities but harmonize their design and construction skills to bring new life to the spaces they work on. Des Moines, 515-344-3338; www.danavanwoert.com.\nRunners-up: Lynsy Anderson, Royal Flooring; ALT Design Studio\nBest Local Pest Control Company\nPro-Staff Termite & Pest Control\nKeep those pesky bugs out of sight and out of mind when using Pro-Staff Termite & Pest Control. This company wins Best Local Pest Control Company once again thanks to the votes of CITYVIEW readers. 3601 Douglas Ave., Des Moines, 515-279-7378; www.desmoinespestservice.com.\nRunners-up: Diam Pest Control; Preferred Pest Control\nBest Local Cleaning Company\nThe Queen of Clean\nIt’s seven years in a row for The Queen of Clean to be chosen as Best Local Cleaning Company by CITYVIEW readers. Get your home or office to a level of clean that would earn a queen’s stamp of approval. 4949 Pleasant St., Suite 101, West Des Moines, 515-528-8723;\nwww.thequeenofcleania.com.\nRunners-up: Two Mops and a Bucket;\nElite Cleaning of Des Moines\nBest Local Preschool\nGeneration Next Child Development Center and Preschool\nGeneration Next Child Development Center and Preschool wins both the Best Local Daycare and Best Local Preschool categories in Best of Des Moines polling. Generation Next has a curriculum dedicated to getting little ones on the right foot, right away. Multiple locations; www.generationnextia.com.\nRunners-up: Montessori Children’s House; Shepherd’s Flock Early Learning Center\nBest Local Swim School\nNatavi Swim School\nNatavi Swim School wins again. Iowa is chock full of public swimming pools, a handful of waterparks and no shortage of lakes, rivers and ponds to enjoy. A trip to CITYVIEW readers’ choice for Best Local Swim School will help make sure you or your kids do more than just dip a toe in. 275 S.W. Brookside Drive, Grimes, 515-300-3282; www.nataviswim.com.\nRunners-up: Foss Swim School; Goldfish Swim School\nBest Local Home Inspection Company\nResidential Recon Home Inspections\nRyan Nady, Residential Recon Home Inspections, is a certified professional inspector. Make sure your potential new home is up to snuff before you buy. CITYVIEW readers’ choice for Best Local Home Inspection Company will make sure you find a home’s shortcomings before it’s yours. Clive, 515-971-3120; www.residentialreconinspection.com.\nRunners-up: Keystone Home Inspections; Vigilant Home Inspections, LLC\nBest Local Foundation Repair Company\nMidwest Foundation Repair\nThe bedrock of your home is just as important as that new addition, updated kitchen or refurbished bathroom. Midwest Foundation Repair, voted Best Local Foundation Repair Company by CITYVIEW readers, has helped Iowans with their homes since opening in 1995. 9850 Douglas Ave., Suite 100, Urbandale, 515-992-7046; www.midwestfr.com.\nRunners-up: BAM! Basements & Masons; Foundation Recovery Systems\nBest Local Sign Company\nLashier Graphics & Signs\nIt’s likely you’ve seen the work of Lashier Graphics & Signs without even knowing it. The work by this Best of Des Moines poll’s Best Local Sign Company, has been seen at the Iowa State Fair, local high schools, on company trailers and businesses. 1601 S.E. Gateway Drive, Suite 130, Grimes, 515-518-6100; www.lashier.com.\nRunners-up: Signarama; Iowa Sign Company\nBest Local Place to Get “Gas”\nKwik Star\nKwik Star and Kwik Trip are both owned by the same business, but separated by the states they operate in. Kwik Star has its roots in Iowa, and those roots are growing. Best Of Des Moines voters deemed Kwik Star the Best Local Place to Get “Gas.” Multiple locations; www.kwiktrip.com.\nRunners-up: Casey’s; Costco ♦",
  "word_count": 20040,
  "scraped_at": "2026-02-14T12:43:14.386674"
}