{
  "article_id": "2e64ec203aab",
  "url": "https://www.sbs.com.au/news/podcast-episode/nationals-set-to-name-their-own-frontbench-after-coalition-split-midday-news-bulletin-22-may-2025/3zm2t30pi",
  "title": "Nationals set to name their own frontbench after coalition split | Midday News Bulletin 22 May 2025",
  "date": "20250522T043000Z",
  "domain": "sbs.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\nTRANSCRIPT\nThe Nationals are preparing to unveil a new frontbench, after declaring an end to their Coalition partnership with the Liberals.\nThe party is preparing to divide up key portfolios for its MPs and Senators, with many preparing to take on two or even three roles - across portfolios including Treasury, foreign affairs, home affairs and immigration.\nNationals leader David Littleproud told SBS, it would be a mistake to underestimate what the party can achieve.\n\"We shouldn't be pigeon-holed as just the country cousins. We're a little broader than that. And we're a lot smarter than what people give us credit for. And I think you will see that there will be a lot of ideas and policies; and argument and debate that we will add value to. That Australians - I think - will look up and with admiration at the end.\"\n+++\nVanuatu's Prime Minister, Jotham Napat, says he has had a productive meeting with Australia's Foreign Minister on concluding a new bilateral agreement.\nHe says the deal is still be finalised, but will cover a number of areas.\n\"The Vanuatu - Australia partnership agreement framework for development co-operation through this framework - Vanuatu and Australia will jointly address critical priorities, including the economic and infrastructure, climate adaptation and resilience building. And we are hoping will sign this agreement, this coming September.\"\nMs Wong says Australia wants to further deepen ties between the countries.\n\"We all know that this is an uncertain world. The Prime Minister and I spoke about this. We've seen a lot of change. Well, I would say to the leaders of the Vanuatu, to the Prime Minister and his cabinet, to the chiefs and to the people. That we are steadfast partner. You can count on us.\"\n+++\nNew South Wales Premier, Chris Minns, says more resourcing is being made available for flood-hit communities on the state's mid north coast.\nAround 2,500 personnel are on the ground, including State Emergency Service, police, ambulance, fire and rescue, surf lifesavers and marine rescue.\nMore than 48,000 people are currently isolated due to the floodwaters.\nMr Minns says all options are being considered to help those affected.\n\"It is very difficult to get supplies into some of these isolated communities. This storm front hit in the last 48 hours - and I'm very conscious that we don't want to overpromise things that can't be delivered, particularly if these communities are knocked out. Their roads are knocked out - and they're isolated. The immediate priority is obviously rescue. And I'm confident with the amount of heavy trucks and helicopters we've got on site, we can manage it where it is up to at the moment.\"\n+++\nIsrael's military says that it has fired near a diplomatic delegation, which it says deviated from an approved route in the occupied West Bank.\nVideo footage shows a number of diplomats giving media interviews when the sound of gunfire is hear.\nThe delegation included ambassadors and diplomats from 31 countries, including Italy, Canada, Egypt, Jordan and the UK\nIsrael's military says it regrets the inconvenience caused and that diplomats would be contacted to receive the results of its internal investigation into the incident.\nThe European Union's foreign policy chief Kaja Kallas what happened is intolerable.\n\"Yes I heard about the incident in Jenin today where Israel Defence Forces shot warning shots, but still shots, at a group of diplomats approaching the refugee camp. We definitely call on Israel to investigate this incident and also hold those accountable, who are responsible for this, and any threats on diplomats' lives are unacceptable. So, as Israel is also a signatory to Vienna Convention.\"\n+++\nIndian author Banu Mushtaq and translator Deepa Bhasthi have won the International Booker Prize for fiction for a collection of 12 short stories, entitled Heart Lamp.\nThe work was written over more than 30 years and chronicles the everyday lives and struggles of women in southern India.\nIt is the first time the award has been given to a collection of short stories.\nBhasthi is the first Indian translator - and ninth female translator - to win the prize since it took on its current form in 2016.\nMs Mushtaq says it is an incredible honour to showcase the richness of the Indian language of Kannada.\n\"It calls to the Kannada language a river of honey, a rain of milk, and compares it to sweet ambrosia (something extremely pleasing to taste or smell). Kannada is one of the oldest languages on Earth, and I'm ecstatic that this will hopefully lead to a greater interest in reading and writing and translating more and from into the, from the language, and by extension, from and into the magical languages we have in South Asia.\"\n+++\nIn football, Ange Postecoglou says his side's victory in the Europa League final is reward for those who have kept the faith during a difficult season.\nThe Australian coach has made history with his side, Tottenham Hotspur, defeating Manchester United, one goal to nil in the final in the Spanish city of Bilbao.\nIt's the club's first trophy in 17 years, and winning the Europa League automatically qualifies Tottenham for the top competition, the European Champions League, next season, despite their severe struggles in the English Premier League that have put Postecoglou's job under threat.\nPostecoglou reflecting upon his triumph in uniquely Australian fashion.\n\"To quote my favourite Australian Prime Minister, Paul Keating... he said after an unlikely victory: this is one for the true believers. And this is certainly one for the true believers! And that means an unbelievable group of players who never wavered, who never lost faith in me, and what we were doing.\"\nManchester United dominated the game, but Brennan Johnson scored the game's only goal with Tottenham's only shot on target.",
  "word_count": 982,
  "scraped_at": "2026-02-14T12:50:29.443923"
}