{
  "article_id": "2e74c85e8d77",
  "url": "https://metro.co.uk/2023/12/07/luis-rubiales-forcefully-kissed-lucy-bronze-womens-world-cup-19940505/",
  "title": "Luis Rubiales  forcefully kissed  Lucy Bronze at Women World Cup | Football",
  "date": "20231207T140000Z",
  "domain": "metro.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Disgraced former Spanish FA chief Luis Rubiales has been accused of ‘forcefully kissing’ Lucy Bronze and acting inappropriately towards another England star.\nRubiales was forced to resign after Spain beat England in the Women’s World Cup final in August after he kissed Spanish player Jenni Hermoso without her consent during the winners’ ceremony.\nIt has now been claimed that he targeted the Lionesses too – with Football Association chair Debbie Hewitt levelling further accusations of inappropriate behaviour against Rubiales.\nHewitt’s remarks came as FIFA published their findings into their case against Rubiales with the FA chair saying the Spaniard made two England players ‘deeply uncomfortable’.\nHewitt says Rubiales ‘cupped and stroked the face of the English player Laura Coombs’ before he ‘seemingly forcefully kissed Lucy Bronze on her face’.\nRubiales then ‘became more boisterous’ as the Spanish players stepped up to receive their medals, according to the report.\n‘He was tactile with almost all of them, kissing most on the cheek, and giving some multiple kisses in quick succession and holding them very tightly,’ the report continued.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘He rubbed some on their back, tapped one on her bottom, grabbed some by their arm, lifted several off their feet, and one was hoisted twice. In most cases, [the Respondent] initiated the hugs and physical contact.\n‘The hugs were reciprocated but the kisses weren’t. It appeared that some players moved their heads to avoid the kissing. The President of The FA felt deeply uncomfortable and embarrassed.’\nRubiales argues that he touched the face of Coombs because she had been injured in the final and required stitches – but she did not play in the match.\nHis response stated: ‘It is astonishing to read the amount of prejudice that Ms. Hewitt showed against [the Respondent] which took her, without knowing what he was saying in response, to decide that he was being aggressive.\n‘Without providing any evidence. The Respondent feels the need to point out that Ms. Hewitt, hugged several players even after clearly noticing that they were extending their hands to receive a handshake, which applying the same logic she used, could be understood as a forceful non consensual physical contact, or even when greeting the referees, it can be seen Ms. Hewitt touching all of them in their arms, while (the Respondent] limited his interaction to a plain handshake. The hypocrisy is blatant.\n‘The Respondent reads the words of the President of The FA with absolute dismay.\n‘The way she presents a gentle gesture of comfort to all the rivals in the final of the WWC, suggesting that [the Respondent] is some sort of creep is absolutely disgusting.\n‘Also, she either purposely or negligently decides to obviate some of crucial facts, first Ms. Coombs was injured during the final, had to receive stitches and was wearing a bandage in her head, reason why [the Respondent] tried to comfort her, and second Ms Bronze not only plays in Spain, but she was also a super champions in Spain just few months before in which celebration Mr Rubiales obviously participated.\n‘This conduct was not denounced when on June 18, 2023, he hugged Mr Luka Modric after the final, precisely for the same reasons he hugged Ms Bronze.\n‘In relation to the Kiss, Ms Hewitt blatantly lies or at least, speaks from ignorance. The evidence presented in this procedure, but also before Spanish courts and reported by the media, confirm that there was an exchanged during which [the Respondent] asked and [the Player] consented.\n‘The last paragraphs of her statement are straight forward incomprehensible. First she gives her opinion about the incident in the stands, which she did not witness, or knew about, until reported by the media.\n‘Second she misquotes [the Respondent], and proceeds to give her opinion about what happened one week after the final, which, as far as [the Respondent is] concerned, Ms Hewitt is in no position in this procedure to do, and then moves to affirm that [the Respondent] blamed the Player.\nMore Trending\n‘At no point did [the Respondent] blame the Player, all the explanations of [the Respondent] have been consistent since the very first day, and at no point has he blamed the Player.’\nRubiales initially refused to quit and attempted to continue in his role as Spanish FA president but in the face of mounting pressure and strikes from Spain’s World Cup-winning players, he eventually resigned on September 10.\nThe 46-year-old has since been banned from ‘all football-related activities’ for three years by FIFA.\nMORE: Aitana Bonmati says Spain want to 'stick to football' after World Cup kiss scandal\nMORE: Luis Rubiales ordered not to go within 200 metres of Jenni Hermoso",
  "word_count": 830,
  "scraped_at": "2026-02-14T12:05:39.788253"
}