{
  "article_id": "2e8b452a7b2c",
  "url": "https://www.express.co.uk/news/politics/2052617/keir-starmer-desperate-trade-deal-donald-trump",
  "title": "Keir Starmer has sold Britain out with new US trade deal",
  "date": "20250508T190000Z",
  "domain": "express.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Keir Starmer has sold Britain out with new US trade deal: 'We've been scammed!'\nThe Prime Minister was bounced into announcing a trade deal with the United States.\nPuffed up Keir Starmer bragged about securing a great trade deal with Donald Trump but it was the second time he sold Britain out in a week.\nThe Prime Minister was not even in the room when the agreement was finalised and was forced into last minute concessions over the phone while he was at a football match.\nHe was clearly bounced into making the announcement as it was Peter Mandelson, our ambassador to the US, stood by The Donald in the Oval Office rather than the Prime Minister.\nNo 10 would never have wanted to put out such significant news on the 80th anniversary of VE Day.\nOne of the key tactics used by scam artists is to put time pressure on their victims and make them believe they must act immediately.\nStarmer was asked if the deal he had struck meant Britain would be better off than it was six months ago.\nHe would only say the country will be better off than it was a day ago.\nDonald Trump makes trade announcement between US and UK\nThe Americans were pretty clear it was a win for them, with Commerce Secretary Howard Lutnick producing a chart that shows that the US has tripled its tariffs on Britain while the UK has more than halved its tariffs on them.\nInstead of a rate of 3.4% we now pay 10%. Imports to the UK did average 5.1% but they will be pushed down to 1.8%.\nThe deal puts us in a better position than we were at the start of the week but it is a bit like the school bully stealing your dinner money and throwing you 50p out of pity.\nGiven Trump changes his mind on tariffs on a whim, he might have altered them again anyway if it benefitted the American economy when the pressures of protectionism hit.\nStarmer did secure some crucially important concessions for the British car industry, which was facing obliteration under Trump’s war on world trade.\nBut he failed to secure any promises on the film industry, which also faces wipe out if the President goes ahead with his plan to impose huge levies on films produced outside the United States.\nAnd British farmers, those men and women already pushed to the brink by Starmer’s hated inheritance tax now face another hammer blow after the Prime Minister signed off “unprecedented access” to the UK market for American agriculture.\nStarmer said he had managed to “achieve something that many people tried to achieve for many years”.\nDon't miss: 'Donald Trump 'loves' UK trade deal - and that should terrify Keir Starmer'\nDon't miss: Sky News halted for breaking Donald Trump announcement - great news for Starmer\nDon't miss: Donald Trump launched last minute bid to change UK-US Trade deal\nThat should have been a bit of a clue. If others have found it so difficult to reach an agreement, it is because there is a good reason.\nIf it looks too good to be true, it probably is.\nMore than 70 years ago, JFK warned: “We cannot negotiate with people who say what's mine is mine and what's yours is negotiable.\"\nThe words still ring true.\nAt a hastily arranged press conference, the Prime Minister repeatedly talked about how proud he was, how he had “stayed in the room” to negotiate.\nHe had not indulged in “slamming doors” but had instead shown “patience” and “serious pragmatism”.\nWho cares? The process is irrelevant. How proud he is of himself is irrelevant.\nDid Trump show pragmatism? Absolutely not.\nHe smelt weakness and went in for the kill.\nThere is a great irony in Starmer, one of the biggest obstacles to Britain securing a quick and clean exit from the European Union after the Brexit vote, boasting about a deal with the US that is only possible because we voted to go our own way.\nBut the 17 million Leavers did not turnout so the country could be sold cheaply at the first opportunity.\nLikewise with the Indian trade deal Starmer was crowing about just a couple of days earlier.\nAfter pushing struggling British firms to the brink with punishing national insurance hikes for employers, Indian workers have been told their contributions will be waived.\nAgain, the real impact of the deal came from the other side, not the UK government, which failed to mention in its press release anything about the national insurance agreement, knowing it was likely to infuriate voters.\nAs Conservative leader Kemi Badenoch put it, the UK has been “shafted”.\n“When Labour negotiates, Britain loses,” she wrote on X.\n“We cut our tariffs — America tripled theirs.\n“Keir Starmer called this ‘historic.’ It’s not historic, we’ve just been shafted!”",
  "word_count": 814,
  "scraped_at": "2026-02-14T14:17:02.303243"
}