{
  "article_id": "2e9224267b26",
  "url": "https://www.si.com/college/kansas/basketball/kansas-jayhawks-at-west-virginia-mountaineers-predictions-another-rock-fight",
  "title": "Kansas Jayhawks at West Virginia Mountaineers Predictions : Another Rock Fight",
  "date": "20230107T144500Z",
  "domain": "si.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Kansas Jayhawks at West Virginia Mountaineers Predictions: Another Rock Fight\nIn this story:\nThe Kansas Jayhawks are 2-0 in conference play yet again under Bill Self, but neither of those wins were easy. And it doesn't get any easier as they head on the road to face a Top 20 Kenpom team in the West Virginia Mountaineers that are 0-2 and facing a game that feels like a must win. Bob Huggins is known for teams that play a physical style, especially in the post. Can KJ Adams continue his hot streak and help the Jayhawks get another early road win? Or will the overall strength of the conference start to reel Kansas back in?\nDo you disagree with our assessment? Make sure you read them all and then hop over to the Discord or on Twitter to share your own thoughts.\nKyle Davis\nCheck out our West Virginia Preview for Kyle's full breakdown and prediction.\nDerek Noll\nThe beginning of the conference slate hasn’t been kind to West Virginia, but the Mountaineers are finally playing a home game this Saturday. The problem is that they are playing the Kansas Jayhawks, and although KU has had some difficulty playing in Morgantown in the past, I’m not betting against this Jayhawk team right now. They’re clicking pretty well right now and I’m looking to see a big game from freshman Gradey Dick who has been defended well so far in conference play. Bill Self will have some designed plays for the sharpshooter and that’ll be the difference in this one.\nKansas 77, West Virginia 65.\nLucas Murphy\nThe Jayhawks head to Morgantown to take on the West Virginia Mountaineers. This always seems to be a tough road game but it is the Big 12 and every game is going to be a challenge. KJ Adams continues to shine but this game I am keeping my eye on Bobby Pettiford. Pettiford has been stepping up and I expect him to continue to gain more minutes. Jalen Wilson continues to play well and I expect him to have a quality game. The player I look to have a rebound is Kevin McCullar. That was a hostile environment for the Red Raider transfer and with that game behind him I expect we see the usual McCullar.\nKansas 87, West Virginia 81.\nBrendan Dzwierzynski\nObviously, the old narrative that surrounds KU games in Morgantown will rear its ugly head Saturday afternoon, but I’m not entirely worried about that. West Virginia is good, but my biggest concern is whether or not Kansas can play a full game. It didn’t against Oklahoma State and the late near-meltdown in Lubbock wasn’t exactly a fun watch. WVU is better than both those teams, so for KU to win it needs to avoid those prolonged lapses. I think it will, and I think the Jayhawks get to 3-0 in the Big 12.\nKansas 80, West Virginia 73.\nAndy Mitts\nOn paper, this is a game that falls for Kansas in pretty much every category. West Virginia plays a very physical brand of basketball that leads to them sending teams to the line and committing a bunch of fouls, but they don't seem to affect a lot of shots defensively. The one area that they excel defensively is in forcing turnovers, and that up-tempo style will serve the Jayhawks well in this matchup.\nBut this is the Big 12, and Kansas is going to lose one at some point. Games in Morgantown are always very weird, which means that there is a good chance that Kansas either loses this one outright or they completely blow West Virginia out of the water. I told myself I wasn't going to repeat my Kansas football prediction season and only pick against them once, because that just isn't realistic. I'll be in Allen Fieldhouse covering the women's Top 25 matchup against Baylor during the second half of this one, so I'm fully expecting to check the score at halftime and be shocked one way or another. But no matter how much I keep trying to talk myself into picking against Kansas here because of some weird feeling, I just can't seem to do it. Give me KJ Adams exploding for 24 points, and Kansas wins a tight one at the buzzer.\nKansas 79, West Virginia 78.\nJoin the discussion! Come talk about this or any of our articles on the Blue Wing Rising Discord Server.\nFollow Blue Wings Rising on Twitter.\nListen to the official podcast of Blue Wings Rising: The Rock Chalk Podcast.\nAndy Mitts is an alumnus of the University of Kansas, graduating in 2007. He previously covered the Jayhawks at Rock Chalk Talk and is now the editor-in-chief at Blue Wing Rising. He hosts the Kansas-themed Rock Chalk Podcast, and is VP of Membership of the Ten 12 Podcast Network. Follow him on Twitter @AndyMitts12.\nFollow AndyMitts12",
  "word_count": 815,
  "scraped_at": "2026-02-14T13:35:12.302334"
}