{
  "article_id": "2e9fdb77ff59",
  "url": "https://theathletic.com/4874837/2023/09/18/pauw-caldwell-republic-of-ireland-world-cup/",
  "title": "Republic of Ireland Women World Cup qualification was  in spite of  Vera Pauw , says Caldwell",
  "date": "20230918T201500Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Republic of Ireland defender Diane Caldwell has said the national team qualified for the Women’s World Cup “in spite of” Vera Pauw being the team’s manager.\nThe Football Association of Ireland (FAI) decided against renewing Pauw’s contract, which expired on September 1, after an internal review into all aspects of the World Cup campaign.\nAdvertisement\nIreland’s women reached a major tournament for the first time in their history but were knocked out after the group stage.\n“From my position as a pretty experienced player, I don’t think it was up to the standard expected at the international level,” said Caldwell, 35, when asked about Pauw’s approach to analysing and preparing for games. “And I think the results and performances that we got were in spite of Vera being our coach.”\nChief executive Jonathan Hill confirmed last week that talks about a new deal for Pauw had been placed on hold in July following The Athletic’s investigation into the head coach’s conduct during her time in charge of National Women’s Soccer League (NWSL) team Houston Dash in 2018.\nPauw denied all the allegations in The Athletic’s report, which included that she “created a culture of fear” and would comment on her players’ weight and appearance. She argued the Dash players were “not used to women being direct” and the claims were “evidence” of a “gender bias” against female coaches.\nAfter Ireland opted not to renew her contract, Pauw accused FAI executives of “interfering” in football affairs and said its review was “pre-determined”.\nGO DEEPER\n'Abusive and belittling' or a 'woman being direct'? Vera Pauw and a 'culture of fear' at the Houston Dash\n“I do not leave with any regrets, and my overriding emotions today are of happiness and pride to have played a part in the wonderful journey of this team over the last four years,” Pauw added in a statement.\nEileen Gleeson has been placed as interim head coach for the upcoming Nations League games against Northern Ireland and Hungary.\nAsked if professionalism had been lacking during Pauw’s time in charge, Caldwell said: “There were many areas that could have been better… Our preparation for games could have been better. Physical preparation, opponent analysis, match tactics, in-game match tactics, systems of play.\n“We approached her many times about professionalising many aspects but it was hard to get change and she obviously made myself part of the leadership group that she created along with other players so she gave us that position to use our voice and to try to talk on behalf of the team. We tried to do that as a group the best we could but obviously at the end of the day she’s the coach and she controls everything. We could only say and try to change so much.\n“I think a group of players that were destined for success came together at the right time.”\nAdvertisement\nCaldwell, who plays for FC Zurich, said that she and team-mate Katie McCabe spoke to former FAI high performance director Ruud Dokter after the qualifying campaign for Euro 2022 to reflect “certain aspects” they thought needed to be improved and changed.\n“But ultimately that fell on deaf ears and she (Pauw) got a contract extension,” Caldwell added. “I’m very happy that there’s change. It gives us all a new lease of life and there’s a new beginning.\n“People not in the know will find it hard to understand and see it from our point of view. Knowledge is your wealth and if you don’t know these things it is wrong to speak out and give your opinion on things you maybe don’t have a full understanding of.”\nGO DEEPER\nPauw gone. Silence from the Republic of Ireland's women. What now?\nMcCabe tweeted a zipped mouth emoji following Ireland’s final World Cup match against Nigeria, after Pauw had said the Arsenal midfielder called for a substitution.\n“Why would we change?” said Pauw after the 0-0 draw. “If Katie McCabe says that she wants a change that doesn’t mean… She’s not the coach, eh?”\nMcCabe said: “There have been a few unfair headlines I would say. This thing about Katie versus Vera. It’s not a thing. As I said, we have spoken and she wished us well. I’ll always be grateful for what Vera has given Irish football as well as all my team-mates. We’re in a mindset now where we need to move on, we need to give this closure and have full focus on the Nations League.\n“You are obviously well aware of the review the FAI had done post-tournament. That’s never the decision of the players to make. The FAI conducted a review and spoke to everybody, and felt they wanted to go in a different direction from a football point of view. We need to respect that decision, we don’t make those decisions as players, as much as the player power narrative has been turned around, that’s not the case.\nAdvertisement\n“We understand how people can interpret that, the public can, but we’re footballers at the end of the day. We want to talk about football, we don’t want to be talking about all of this nitty-gritty going on in the media. We want to focus on training and playing games for our country, that’s what’s most important for us.”\n(Photo: Justin Setterfield/Getty Images)",
  "word_count": 887,
  "scraped_at": "2026-02-14T12:04:15.509968"
}