{
  "article_id": "2eaac94cd597",
  "url": "https://www.fwweekly.com/2024/03/06/frog-female-faction/",
  "title": "Frog Female Faction",
  "date": "20240307T010000Z",
  "domain": "fwweekly.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Last year, around this time, everyone agreed that women’s collegiate sports were having a moment. The faceoff between Angel Reese and Caitlin Clark in the women’s basketball national championship generated unprecedented widespread attention for a sport that had largely been back-page news fodder. Turns out, it wasn’t a moment.\nThe zeitgeist has grown and expanded as the star power of women’s collegiate athletes is not dissipating anytime soon. Clark, the runner-up in that title game, just last week broke the all-time scoring record for college ballers, irrelevant of gender. Clark’s draw has also sold out nearly every game in which she’s hit the floor this season — including a record 55,000-plus fans at a tilt held at Iowa’s football stadium — as well as inking a Gatorade deal. Clark and Reese, along with LSU gymnast Livvy Dunne, occupy three of the Top 10 spots for NIL valuation among all college athletes.\nTCU women’s basketball has raked in the attention this season as well but in an unexpected way. After a raucous beginning under first-year Head Coach Mark Campbell, the Lady Frogs dribbled through a program record 14 consecutive opponents and landed an AP ranking before going cold against 6th-ranked Baylor for their first loss of the season. That skid continued for four games until the Frogs were so depleted from injuries, they had to forfeit two games against ranked conference opponents. The bench, or lack thereof, was so thin that the team held open tryouts from the general student body.\nOf the 40 who tried out, four made the team, including TCU volleyballer Sarah Sylvester. The Frogs didn’t even have enough healthy players to run full 5-on-5 practice, but the scrappy squad snatched victory on their home court against UCF in an emotional return after every national press outlet showcased their struggles.\nCampbell’s Frogs have improved following a bumpy start to conference play, winning four of their final five tips, though they’ve yet to outshoot a ranked opponent this season. The lady dribblers will try to avenge a close early-season loss to Oklahoma State in the conference tournament this week in Kansas City but are very unlikely to receive a tournament bid despite more than doubling their win total from last year. Nineteen first-season wins is the best mark by a rookie head coach in program history, and the Frogs are likely to appear as a high seed in the women’s NIT.\nIf anyone recalls, the men’s program experienced a similar resurgence when Coach Jamie Dixon arrived in the Fort, and it’s safe to assume the women will continue to elevate their standard and fare better than they have in a season plagued by debilitating injuries.\nThe most decorated female athletes on campus, and arguably TCU’s most competitive overall program, are the shooters on the rifle team. NCAA rifle is a co-ed sport, though TCU stables an all-female team. Their national championships will fire off Friday and Saturday on the campus of West Virginia, this season’s host team. The purple rifle team is helmed by 20th-year Head Coach Karen Monez, who boasts an accolade sheet so long, it rivals my personal list of life regrets. Monez is a multiple-time world champion in many categories herself and has led her Frog markswomen to three national championships and five runner-ups and has hosted the national championships at TCU twice. The Frogs have fired their way to the penultimate podium spot in three consecutive seasons after their last national championship in 2019. (The 2020 season was canceled because of COVID.)\nThose three losses in the final shoot have come by a combined 24 points, which may seem like a lot in some sports, but an average score by a team in one of these duals is more than 4,700 points, meaning the margins have been incredibly small. Appropriately, the Frogs are ranked second heading into the championships behind host-team West Virginia and will be eager to punch the bullseye, which is this prestigious program’s expectation.\nAnother group of Frog females to follow this spring are the sandy strikers of beach volleyball, a young but wunderkind program started in 2015 that has been making national noise the last two seasons. Head Coach Hector Gutierrez was named coach of the year last season after his second-ranked Frogs reached the national semifinals, losing a tight 2-3 match against USC, who would best their crosstown rivals UCLA in the finals to capture the national championship. The Beach Frogs have already logged two ranked wins this season, against Washington and LSU, respectively, and their only blemish was a 2-3 loss against second-ranked Stanford in Palo Alto.\nBeach volleyball operates similarly to a collegiate dual tennis match, in which five pairs play simultaneous matches and the first to three matches claims overall victory. TCU will host four opponents across Friday and Saturday if any of you want to lie out on campus and watch one of the best teams in the nation leave their opponents quite literally pounding sand.\nRead about how women restaurateurs keep on keepin’ on in the struggling food industry in Eats & Drinks.",
  "word_count": 848,
  "scraped_at": "2026-02-14T14:10:14.714176"
}