{
  "article_id": "2eaecab6e469",
  "url": "https://www.rte.ie/entertainment/2025/0228/1498932-whats-on-top-10-tv-and-streaming-tips-for-friday/",
  "title": "What on ? Top 10 TV and streaming tips for Friday",
  "date": "20250228T204500Z",
  "domain": "rte.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Taoiseach Micheál Martin and movie stars Jessica Lange and Ed Harris are guests on The Late Late Show, Claudia Winkleman guest hosts The Graham Norton Show, there's the Loch Ness monster, Jurgen Klopp, Selena Gomez, Josh Hartnett, and Shels v Rovers . . .\nPick of the Day\nThe Late Late Show, 9.35pm, RTÉ One\nStreaming on RTÉ Player\nAs he prepares to visit Washington, Taoiseach Micheál Martin (below) will be in studio to discuss why he is meeting Donald Trump, the turbulent start to the new Dáil and his plans to tackle the housing crisis.\nStars of the stage and screen Jessica Lange and Ed Harris will also be in studio. They are in Ireland for the world premiere of Long Day's Journey Into Night at the Dublin International Film Festival.\nThey'll speak about their time shooting the film in Wicklow, their connections with Ireland and their careers in Hollywood and on Broadway.\nFormer EastEnders star Danny Dyer (below) will be also be appearing on the show ahead of his new movie Marching Powder.\nHe will be chatting about life since Albert Square, capturing hearts as Freddie Jones in Rivals, and why he's decided to run a caravan park this summer with his daughter Dani.\nSarah Corbett Lynch will be on the show to talk about her memoir A Time for Truth about her father Jason Corbett, who was killed in North Carolina by Sarah's stepmother Molly Martens and Molly’s father Tom Martens.\nAnd Donegal country music and blues singer Muireann Bradley will perform Delia.\nNew or Returning Shows\nLoch Ness: They Created a Monster, 9.00pm, BBC Two\nThe story behind the legend, revealing how the search for the Loch Ness monster has attracted people from across the world for decades.\nRumours and sightings of a dinosaur-like creature had persisted at Loch Ness (above) for even longer, with the 1970s being the peak decade of monster hunting.\nOver the years, detecting methods changed. First it was all about sightings, then photographs and eventually sonar and underwater cameras.\nNew to Stream\nDoubters to Believers: Liverpool FC - Klopp's Era, Prime Video\nThe four-part documentary series tells the story of how German manager Jurgen Klopp brought belief and success back to England’s Liverpool FC.\nThe series includes interviews with key club figures such as Virgil van Dijk, Trent Alexander-Arnold, Alisson Becker, Pep Lijnders, Andy Robertson, Curtis Jones, Harvey Elliott and Jayden Danns.\nFurther contribution include former players such as Jamie Carragher and Adam Lallana, as well as key figures who have followed Jurgen Klopp’s careers such as respected German author and journalist Raphael Honigstein.\nFight or Flight, Sky Cinema Premiere & NOW\nJosh Hartnett stars in this action-thriller which has been described as John Wick meets Die Hard - on a plane!\nA mercenary takes on the task of eliminating a high value target on a plane flight, but when an onslaught of rival assassins descends upon them both, he realises they have to team up in order to survive.\nWizards Beyond Waverly Place, Disney+\nThis family entertainment follows an adult Justin Russo, who has chosen to lead a normal, mortal life with his family, Giada, Roman and Milo.\nWhen Justin’s sister Alex brings Billie to his home seeking help, Justin realizes he must dust off his magical skills to mentor the wizard-in-training while also juggling his everyday responsibilities - and safeguarding the future of the Wizard World.\nThe cast includes David Henrie, Janice LeAnn Brown, Alkaio Thiele, Max Matenko, Taylor Cora, Mimi Gianopulos, Selena Gomez.\nSquad 36, Netflix\nHere’s a French drama is set in Paris in the present day.\nAntoine Cerda, a senior police officer with the prestigious Investigation and Intervention Brigade is transferred to the Anti-Crime Brigade after being sanctioned by the General Inspectorate of the French National Police.\nHe then turns his back on his former comrades and unit, led by the charismatic Sami Belkaïm. Thirteen months later, two officers from his old squad have been killed in less than 24 hours.\nWhen a third goes missing in mysterious circumstances, Antoine Cerda decides to carry out his own investigation. His inquiries will reveal an intense police rivalry and take him on a terrible downward spiral.\nAitana: Metamorphosis, Netflix\nThis Spanish documentary series stars the international singer and star Aitana, which will provide exclusive and unprecedented access to her daily life.\nThe documentary series will invite Aitana's fans to get to know her as they have never seen her before, enjoying her greatest hits.\nShe’s also navigating complicated bumps in a process of personal and professional growth and maturity as she continues to establish herself as one of the biggest stars of Spanish music.\nDon’t Miss\nThe Graham Norton Show, 10.40pm, BBC One\nNo Graham Norton tonight – but the show goes on!\nClaudia Winkleman (below) steps in as guest host, while Graham takes a break.\nHollywood star Chris Pratt talks about his new sci-fi comedy drama The Electric State, comedian Rob Beckett discusses the return of his titular panel game Smart TV and actress Saoirse-Monica Jackson talks about the new BBC drama series, This City Is Ours.\nPlus, Toby Jones - of Mr Bates vs The Post Office fame - discusses his role as Richard Burton's inspirational teacher in Mr Burton and Rachel Chinouriri performs her single All I Ever Asked.\nDeath in Paradise, 9.00pm, BBC One\n14 seasons in, they keep coming up with new places to find dead bodies in this long-running whodunit.\nThis week Mervin begrudgingly embraces island life and agrees to attend a local women's football game.\nInevitably, half-time brings a bloody discovery when the star player is found in the locker rooms with a fatal bullet wound.\nThe investigators are left perplexed as the only way to access the changing rooms is via the pitch - and no one in the crowd saw anything, so the killer somehow slipped through the net.\nAs Mervin feels the pressure from Selwyn over a murder that took place right under their noses, Naomi is at a crossroads when someone from her past turns up.\nSport\nLive League of Ireland, 7.30pm, Virgin Media Two\nIt’s a biggie - the traditional Ringsend derby - as Shelbourne host Shamrock Rovers (KO 7.45pm) in a Premier Division match at Tolka Park.\nShelbourne were crowned champions last season for the first time since 2006, ending Rovers' run of four successive league titles with a late winner in Derry on the last day of the 2024 campaign.\nDamien Duff’s Reds have started the defence of their title with two wins while Stephen Bradley’s Hoops lost to bitter rivals Bohemians and had last Sunday’s home game against Cork City postponed.\nWhat that means is Shels could open up a nine-point lead over Rovers with a win tonight.\nAlso tonight: Rugbaí Beo (7.20pm, TG4) with coverage of the United Rugby Championship match from Virgin Media Park between Munster and Edinburgh (KO 7.35pm).",
  "word_count": 1149,
  "scraped_at": "2026-02-14T12:49:37.399652"
}