{
  "article_id": "2eb17d8d0d39",
  "url": "https://www.bendigoadvertiser.com.au/story/8146380/scorpions-sting-league-one-rival-colts-fire-in-womens-opener/",
  "title": "Enthralling start to CV League One season | Bendigo Advertiser",
  "date": "20230403T104500Z",
  "domain": "bendigoadvertiser.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Shepparton South oozed class, Shepparton United showed it's a title contender, while Epsom turned heads in an enthralling opening round of CV League One Men action.\nSubscribe now for unlimited access.\nor signup to continue reading\nShepparton South's and Shepparton United's wins over Tatura and Eaglehawk respectively weren't unexpected, Epsom's 3-0 victory over Spring Gully did surprise many local soccer fans.\nEpsom conceded eight goals in two losses to Spring Gully last year and didn't keep a clean sheet once against any of the top six teams.\nSaturday evening's 3-0 victory over the Reds showed the Scorpions' pre-season form in the Australia Cup was no fluke.\n\"I felt we had the upper hand in all areas,'' Epsom coach Peter Raeburn said.\n\"We were first to the ball and we used the ball a lot better. We took our chances and got some score on the board for a change.\n\"We probably could have scored a couple more.\"\nThe Scorpions won the game with three goals in the first half.\nRecruit Ma Kor Hser Thay scored on debut in the eighth minute, while Josh Dwyer and Mitch Langenbacher also found the back of the net.\n\"The thing that impressed me the most was the way we defended,'' Raeburn said\n\"We got the staggers a bit late in the game, but we held them out which was important considering we gave up some late goals in games last year.\n\"It was a good way to start the season and it gives us something to build on.\"\nThe highly-anticipated grand final rematch between Tatura and Shepparton South was a cracking contest.\nTatura denied Shepparton South the championship-premiership double last year thanks to a stunning penalty shootout win in the grand final.\nThis time around Shepparton South didn't let its advantage slip.\nSouth took the lead in the eighth minute via Justin Cirillo before Brent Barassi doubled the lead in the 29th minute.\nA Thomas Leech penalty just before half-time gave Tatura some momentum going into the second half.\nHowever, that momentum was well and truly quashed six minutes into the second-half when new playing coach Thomas Corso was shown his second yellow card of the match.\nHis send-off reduced the Ibises to 10 men and South pounced by adding its third goal through William Keenan.\n\"(Pre-season) we sat down and had a chat about whether we wanted to be one season wonders or if we wanted to show what we're truly about,'' Shepparton South coach Rob Harmeston said.\n\"(In the lead-up) we didn't mention the grand final result once, it was all about maintaining our standard.\n\"As much as I didn't mention it, I'm sure there were people in the changeroom that had a score to settle.\"\nHarmeston said he was surprised with how well his side played.\n\"I was impressed that we did that because I wasn't expecting it,'' he said.\n\"I thought going in we were a bit underdone and only in third gear, but we played quite well.\n\"We didn't take our chances and, potentially, we could have scored a couple more and we gave away a sloppy penalty.\n\"Overall, it was a pleasing performance.\"\nThe pre-season hype around Shepparton United proved to be correct.\nUnited rallied from 1-0 down at half-time to defeat FC Eaglehawk 4-1.\nJesse Matthews opened the scoring for the Borough in the 18th minute, but the second-half was a different story.\nUnited striker Thomas Raditsas made it 1-1 three minutes into the second half.\nUnited saw off some Eaglehawk attacking thrusts and then broke the game open with a blistering 15-minute surge.\nToby Azhar scored a brace in the space of three minutes and former GV Suns player Ryan Brooks put the game to bed with his first goal of the season.\nStrathdale gave Strathfieldsaye Colts United a reminder that life in CV League One won't be easy.\nColts looked solid in their pre-season play-off wins to earn a berth in CV League One, but the Blues had too much class for them in Saturday's 5-0 result at Beischer Park.\nAlex Medway's 30th minute goal separated the teams in a competitive first-half, but the second half was one-way traffic.\nBlues' big man Ethan Hunter scored three times midway through the second-half and Medway made it five for the Blues just before the final whistle.\nTo rub salt into Colts' wounds, Giordan Longano was shown his second yellow card of the game in the 82nd minute.\nCV LEAGUE ONE WOMEN\nReigning premiers Strathfieldsaye Colts United started their title defence in fine style on Saturday.\nColts defeated Strathdale 4-0 on the back of two goals from 16-year-old Zoe Cail.\n\"Even though we played in the Nike Cup, I thought we were a bit rusty,'' Colts' coach Phil Berry said.\n\"Unfortunately, the ground conditions weren't ideal because the grass hadn't been cut.\n\"We were forced to take the aerial route which is not our game style.\n\"It was good to get away with a win first game. Zoe (Cail) played really well up front and the whole team chipped in and played their role.\"\nMaddie Ridsdale and Rebecca Berry also scored for Colts.\n\"Strathdale looked good and showed more attacking flair than last year,'' Berry said of the Blues.\n\"Unfortunately, their keeper (Kelsie Rowlands) went down with a knee injury with about two minutes to go and the game was cut short.\"\nThree goals in eight minutes midway through the first half was the catalyst for Shepparton United's 4-1 win over FC Eaglehawk.\nOlivia Loverso, Lilli Wilson and Maria Villani scored first-half goals for United.\nThe home made it 4-0 in the 76th minute through Olivia Saron before Jess Dover scored a consolation goal for the Borough.\nTatura made a statement in its return to League One Women play.\nThe Ibises put six goals past Shepparton South in an impressive 6-0 win.\nA brace from Colette Suter was the highlight for Tatura, while Nicola Minicozzi, Schenell Dcosta, Cayla Ruijters and an own goal rounded out the scoring.\nThe CV League season has a break over Easter and resumes on the weekend of April 15-16.\nThe highlight of CV League One Women round two will be Spring Gully's first game of the season against Shepparton United.\nIn the other two matches, FC Eaglehawk hosts Strathfieldsaye Colts United and Tatura is at home to Strathdale.\nLEAGUE ONE MEN\nStrathdale 5 (E. Hunter 3, A. Medway 2) d Strathfieldsaye Colts United 0.\nShepparton United 4 (T. Azhar 2, T. Raditsas, R. Brooks) d Eaglehawk 1 (J. Matthews).\nSpring Gully 0 lt Epsom 3 (M. Thay, J. Dwyer, M. Langenbacher).\nTatura 1 (T. Leech) lt Shepparton South 3 (J. Cirillo, W. Keenan, B. Barassi).\nLEAGUE ONE WOMEN\nStrathdale 0 lt Strathfieldsaye Colts United 4 (Z. Cail 2, M. Ridsdale, R. Berry).\nTatura 6 (C. Suter 2, S. Dcosta, S. Stojanovski, N. Minicozzi, C. Ruijters) d Shepparton South 0.\nShepparton United 4 (O. Loverso, L. Wilson, M. Villani, O. Saron) d FC Eaglehawk 1 (J. Dover).\nLEAGUE TWO MEN\nShepparton 5 d Golden City Rams 0.\nShepparton Jaguars 0 lt La Trobe University Black 3 (on forfeit).\nBorder Raiders 2 (S. Wanesiofa 2) lt Swan Hill 3 (F. Amran, G. Johansen, S. Gunasekaran).\nDeniliquin Wanderers 2 (B. Maunganidze, K. Ozmen) lt La Trobe University Red 7 (S. Bish 3, B. Drechsler 2, D. Bish, L. Yates).\nLEAGUE TWO WOMEN\nBorder Raiders 6 d Castlemaine 0.\nKyneton 5 (S. Hooppell 3, L. Campbell, E. Minter) d Swan Hill 0.\nYOUTH\nStrathdale 2 (R. Fleming, A. Shanahan) lt Castlemaine 3 (X. Abicare, R. Christie, F. Van tiggelen).\nSpring Gully 2 (A. Grist 2) d Epsom 1 (L. Hromenko).\nTatura 1 (R. Reedy) d Shepparton South 0.\nShepparton United v Kyneton N/A.\nLEAGUE ONE RESERVES\nStrathdale 5 (S. Christmas 2, J. Suter, A. Merkel, M. Gallagher) d Strathfieldsaye Colts United 1 (P. Hinton).\nSpring Gully 2 (J. Woods, N. Kheradyar) d Epsom 1 (J. Rengthlang).\nShepparton United v FC Eaglehawk N/A.\nTatura 1 (B. Corso) d Shepparton South 0.\nOur journalists work hard to provide local, up-to-date news to the community. This is how you can access our trusted content:\n- Download our app on iOS and Android\n- Bookmark bendigoadvertiser.com.au\n- Make sure you are signed up for our breaking and regular headlines newsletters\n- Follow us on Twitter @BgoAddy\n- Follow us on Instagram @bendigoadvertiser\n- Join us on Facebook\n- Follow us on Google News",
  "word_count": 1402,
  "scraped_at": "2026-02-14T12:15:12.144997"
}