{
  "article_id": "2ed1886dc6ed",
  "url": "https://www.sunlive.co.nz/news/360934-ko-beats-carrington-to-claim-supreme-award.html",
  "title": "SunLive - Ko beats Carrington to claim supreme award - The Bay News First",
  "date": "20250219T001500Z",
  "domain": "sunlive.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Dame Lydia Ko has added another accolade to her stellar 2024 efforts, taking out the top honour at the 62nd annual Halberg Awards.\nHaving already claimed an Olympic gold medal in Paris, won the Women’s British Open, become the youngest woman to be named in golf’s hall of fame and made a Dame Companion of the New Zealand Order of Merit, the 27-year-old has now taken out Sportswoman of the Year, and the Supreme Halberg Award with it.\nThe Kiwi golfer also won the LPGA’s Tournament of Champions, and the Kroger Queen City Championship, as part of a golden 12-month period on the professional circuit.\nKo’s victory sees her named as the winner of the Supreme Halberg for the second time after she first lifted the honour in 2013, and Sportswoman of the Year for a fourth time, and the first since 2015.\nThose two wins came at the expense of Dame Lisa Carrington, who also enjoyed an incredible 2024 which yielded three further gold medals to extend her status as New Zealand’s most decorated Olympian.\nAs well as Carrington, Ko claimed the Sportswoman prize ahead of fellow Paris gold medallist Ellesse Andrews, silver medallist Emma Twigg, women’s tennis doubles world No 2 Erin Routliffe, and White Ferns all-rounder Amelia Kerr, who was named as the ICC’s T20 cricketer and best women’s player for the year.\nHowever, Carrington didn’t leave empty-handed. As part of her efforts in the women’s K4 500, she took out the honour for team of the year, along with Alicia Hoskin, Olivia Brett and Tara Vaughan.\nCarrington’s coach, Gordon Walker, also added another Coach of the Year honour to his collection – marking the sixth time he’s won the award.\nElsewhere, high jumper Hamish Kerr has been named as the Sportsman of the Year for his Paris gold medal, ahead of fellow Olympians Finn Butcher and Hayden Wilde, champion jockey James McDonald, and All Whites captain Chris Wood.\nAnna Grimaldi added to her 2024 haul, which included gold and bronze Paralympics medals, with the Para Athlete of the Year award, her first time winning the award since her breakthrough campaign in Rio de Janeiro in 2016.\nFresh from sealing his reported multimillion-dollar transfer to English Premier League side Nottingham Forest, All Whites defender Tyler Bindon was also named as the Halberg Emerging Talent of the Year, after the 20-year-old successfully switched his allegiance from the US to New Zealand.\n62nd Halberg Award winners:\n- Supreme Halberg Award: Dame Lydia Ko (golf)\n- Sportswoman of the Year: Dame Lydia Ko (golf)\n- Sportsman of the Year: Hamish Kerr (athletics – high jump)\n- Para Athlete of the Year: Anna Grimaldi (Para athletics)\n- Team of the Year: Women’s K4 Sprint Kayak Crew (canoe racing)\n- Coach of the Year: Gordon Walker (canoe racing)\n- Emerging Talent: Tyler Bindon (football)\n- Sport New Zealand Leadership Award: Marcus Daniell (tennis)\n- Sir Murray Halberg Legacy Award in partnership with CityFitness : Michael Hynard\nRecap of the entire evening:\nAward category finalists:\nSupreme Award winner - Dame Lydia Ko\nSportswoman of the Year:\nEllesse Andrews (cycling-track), Dame Lisa Carrington (canoe racing), Amelia Kerr (cricket), Lydia Ko (golf), Erin Routliffe (tennis), Emma Twigg (rowing) Winner - Dame Lydia Ko\nSportsman of the Year:\nFinn Butcher (canoe slalom), Hamish Kerr (athletics-field), James McDonald (horse racing), Hayden Wilde (triathlon), Chris Wood (football) Winner - Hamish Kerr\nPara Athlete/Para Team of the Year:\nDanielle Aitchison (Para athletics), Anna Grimaldi (Para athletics), Anna Taylor (Para cycling), Nicole Murray (Para cycling), William Stedman (Para athletics) Winner - Anna Grimaldi\nTeam of the Year:\nBlack Ferns (rugby-sevens), Lucy Spoors and Brooke Francis (rowing), Emirates Team New Zealand (sailing),White Ferns (cricket), Women’s K2 Sprint Kayak (canoe racing), Women’s K4 Sprint Kayak (canoe racing) Winner - Women's K4 500\nCoach of the Year\nJon Andrews (cycling-track), Aaron Osborne (canoe slalom), James Sandilands (athletics), Cory Sweeney (rugby-sevens), Gordon Walker (canoe racing) Winner - Gordon Walker\nEmerging Talent\nTyler Bindon (football), Cormac Buchanan (motorcycling-road), Luke Harrold (snow sports), Ethan Olivier (athletics), Levi Townley (motorcycling-motocross), Erice Van Leuven (cycling-mountain bike) Winner - Tyler Bindon\nLatest\nOldest\nPinned\n18 February, 09:29 pm\nFull wrap of tonight's awards\nCongrats to Dame Lydia, and all the award winners.\nDame Lydia Ko beats Dame Lisa Carrington to claim Supreme Halberg Award\nThe 27-year-old added another honour to her golden 2024 run.\n18 February, 09:29 pm\nThat's all folks\nThat concludes tonight's ceremony.\nThank you for joining us, and a huge congratulations to the award winners, and the finalists.\n18 February, 09:27 pm\nJeff Latch accepts award\nDame Lydia is currently out of New Zealand, so Golf NZ chief executive Jeff Latch accepts it on her behalf.\n\"We see first hand that Lydia has on young golfers in New Zealand, the inspiration she provides to young girls to take the sport up.\n\"It's not just in New Zealand, she's a presence in the world of women's golf.\"\n18 February, 09:24 pm\nAnd the winner is...\nDame Lydia Ko!\nOf course it is! Another honour for Dame Lydia!\n18 February, 09:21 pm\nHere we go\nThis is it the Supreme Award.\nThe winners of tonight's earlier awards make up the finalists.\nDan Carter and Richie McCaw will present it.\n18 February, 09:19 pm\nFinn Butcher speaks\nFinn brings his dad on stage to collect the award with him.\n\"Mum wasn't too keen on coming up. They gave me every opportunity a young kid could ever dream of.\n\"Having mum and dad in Paris, and my sister Meg, was incredibly special. These are the closest people to me.\n\"I wouldn't be kayaking without them, that's for sure.\"\n18 February, 09:16 pm\nAnd the winner is...\nThe fans have had their say, and it's Finn Butcher!\n18 February, 09:15 pm\nThis could go any way. The fans vote very differently to the Halberg judges.\n18 February, 09:12 pm\nFavourite sporting moment\nHere we go! The award decided by the fans.\nAnother reminder of the finalists:\n1. Anna Grimaldi (para athletics) – Overcame the heartbreak of missing a long jump medal to claim New Zealand’s only gold at the Paris Paralympics, winning the 200m T47.\n2. Black Caps (cricket) – Became the first team in history to sweep a three-match test series away to India.\n3. Brooke Francis and Lucy Spoors (rowing) – In an emotional post-race moment, they embraced their children after earning Olympic gold in the women’s double sculls.\n4. Ellesse Andrews – Celebrated winning the Olympic keirin with father and coach Jon: “Most of the time your parents are on the other side of the fence, so to have one trackside on this side of the fence with me is very special”.\n5. Finn Butcher (canoe slalom) – Paid tribute to his father, multisporter Dale, after winning gold in the event’s Olympic debut.\n6. Hamish Kerr (athletics) – Memorably celebrated after clearing the winning jump in a dramatic Olympic high jump final, running through the infield amid ongoing events.\n7. Hayden Wilde (triathlon) – Marked his Olympic silver medal with a powerful display of sportsmanship, embracing rival Alex Yee in a quiet moment of camaraderie.\n8. Dame Lydia Ko (golf) – Won a career-defining gold in Paris, completing her historic Olympic medal collection.\n9. Silver Ferns (netball) – Clinched the 2024 Constellation Cup with a third straight comprehensive win over Australia in Perth.\n10. White Ferns (cricket) – Defeated South Africa in the Women’s T20 World Cup final in Dubai, clinching New Zealand’s first T20 World Cup.\n18 February, 09:07 pm\nAnna Grimaldi's speech",
  "word_count": 1256,
  "scraped_at": "2026-02-14T13:19:26.456961"
}