{
  "article_id": "2ee5f251c83f",
  "url": "https://www.americanpress.com/2024/03/20/southland-expanding-next-fall/",
  "title": "Southland expanding next fall - American Press",
  "date": "20240321T033000Z",
  "domain": "americanpress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Southland expanding next fall\nPublished 10:14 pm Wednesday, March 20, 2024\nSALT LAKE CITY – While the Western Athletic Conference may have won the early battle, it is looking more and more like the Southland Conference is winning the war.\nAccording to several reports, including one by the American Press’ on Wednesday,\nThe University of Texas-Rio Grande Valley will be joining the league.\nPete Thamel reported the story first on X that UTRGV officials have informed the WAC that they will be leaving their league for the 2024-25 season to join the Southland.\nNot long ago the SLC appeared to be on its last legs after four schools left for the WAC and another for the A-SUN.\nMcNeese State and Incarnate Word were both talking of leaving soon after, all but putting an end to the Southland. That has all changed since Chris Grant has taken over the role as Commissioner.\nGrant said he is expecting a big announcement next week while not saying much. He did tip his hand a bit.\n“When this happens it will prove that we have been doing the right things all along,” Grant said.\nAccording to several sources, an official announcement could come as early as Tuesday.\nBack during Football Media Day last July Grant stated, “While I’m here the Southland will always go for two.”\nHe may not have been talking about teams but rather being aggressive, but now it looks like the league would like to add more soon rather than later. It is a far cry from not too long ago.\nFor one football season, the league played with just six teams, forcing programs to play each other twice in 2021. That was a short-term answer.\nLamar returned to the Southland the following season and Grant has been actively trying to sway others into the league. UTRGV will be the third team to join or rejoin the SLC under Grant’s watch, joining Lamar and Texas A&M-Commerce.\nRio Grande Valley officials have not fully commented on a pending move but did release a state.\n“As you know this is a dynamic time in college athletics with exciting opportunities for our university. We are always evaluating ways we can enhance the competitive experience for our student-athletes and improve their overall well-being,” the Texas Rio Grande Valley athletics department wrote.\nUTRGV, which finished last in the WAC in both men’s and women’s basketball, is starting a football program in 2025. The move would give the Southland 11 schools with nine football teams once Rio Grande is up and running.\n“This would be huge for us,” said McNeese Athletic Director Heath Schroyer. “For us to get a sitting Division I program in our geographical footprint would be a game changer. Kudos to Chris if this happens.”\nGrant has said he is still looking for the right schools to add to his conference. Speculation has been that Stephen F. Austin could rejoin the league once a new athletic director and president are in place.",
  "word_count": 498,
  "scraped_at": "2026-02-14T14:09:35.660471"
}