{
  "article_id": "2ee778250c92",
  "url": "https://mycountry955.com/ixp/1004/p/experienced-cowboys-ready-to-embrace-expectations/",
  "title": "Experienced Cowboys Ready to Embrace Expectations",
  "date": "20230930T233000Z",
  "domain": "mycountry955.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Experienced Cowboys Ready to Embrace Expectations\n* University of Wyoming press release\nLARAMIE -- There was zero questioning the University of Wyoming men’s swimming and diving team’s talent last year. The Cowboys had the horses to compete with anyone in the Western Athletic Conference.\nMaturity was something Wyoming lacked in 2022-23. The Cowboys were gifted athletically but had a difficult time handling the expectations.\n“In terms of our culture, there was a little bit of a lack of maturity, and some of that is definitely on the coaches and some of it is on the leadership,” head coach Dave Denniston said. “This year, I would say there’s great leadership, and there’s full buy-in. They understand growing as people and as young men is as much a priority as swimming fast.”\nThe Cowboys capped last season with a fourth-place finish at the WAC Championships. A number of student-athletes enjoyed lifetime-best times, however, that didn’t always translate on the scoreboard, as the entire conference had a phenomenal meet.\nDenniston doesn’t see the conference getting any slower, but he’s confident in his team’s ability to rise to the occasion.\n“It’s getting tougher and tougher and faster and faster,” Denniston said. “Overall, what’s nice about the WAC Conference, is it’s a group of teams that are very close competitive wise. Everyone is in a position to be able to get that top spot including us.”\nTen of the 15 Cowboys that earned All-WAC honors a season ago return in 2023-24. That list is headlined by Quinn Cynor and Gavin Smith. Cynor won three such awards, one of which was a title in the 200-yard butterfly, while Smith also logged three All-WAC swims, including a program record 47:02 in the 200-yard butterfly.\nCharlie Clark and Caleb Ozenne also recorded three All-WAC performances apiece. Quinn Teller and Collin Davis each reeled in a pair of All-WAC awards. Reilly Gilbert, Harry Tjaden, Luke Walker and John Wargin round out the returnees that were recognized for All-WAC swims last season.\nThe Cowboys open their 2023-24 slate Friday. Both the men’s and women’s teams host its annual Brown and Gold Meet on Friday at 4 p.m. at Corbett Pool before the Brown, Gold & Old Meet on Saturday at 9 a.m.\nUniversity of Wyoming’s Top 50 Football Players\nGallery Credit: 7220Sports.com\n- University of Wyoming’s Top 50 Football Players",
  "word_count": 390,
  "scraped_at": "2026-02-14T13:48:50.070953"
}