{
  "article_id": "2ee88d80cc06",
  "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/women-go-public-on-how-29979776",
  "title": "Brave women go public on how Mohammed Al Fayed sexually assaulted them",
  "date": "20240921T084500Z",
  "domain": "manchestereveningnews.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Brave women go public on how Mohammed Al Fayed sexually assaulted them\n'He just flipped, it was a sustained assault'\nThe revelations that former Harrods owner Mohammed Al Fayed was a sex predator who attacked countless women has shocked the world. Now a brave woman has told how Al Fayed tried to rape her after flying her to Paris, France, in a private jet.\nLindsay Mason, now 55, was 20 when she was recruited by Harrods while working for Sotheby's auction house. After subjecting her to an invasive medical examination, Al Fayed began grooming the then personal assistant, giving her cash and touching her hair and face, she said.\nLindsay had already been targeted by Al Fayed in his Park Lane home when he flew her to Paris with three high-profile TV stars in 1989. She said: \"He attempted to rape me, he was very forceful. He just flipped, it was a sustained assault.\"\nREAD MORE: 'My life in Tenerife turned into a nightmare. Now I'm suing Spain'\nLindsay said she was brought back to Harrods and locked in the offices, unable to speak to colleagues. She said: “I was scared for my life.”\nGemma, 42, who worked as one of Al Fayed’s personal assistants from 2007-09, said he raped her at Villa Windsor in Paris’s Bois de Boulogne, reports The Mirror. She also told of being taken for lunch on his yacht in Monaco with a trio of A-list celebrities. Gemma said: “He threw a lobster at me because I hadn’t spoken.\"\nKatherine, 51, who was an executive assistant in 2005, said Al Fayed ripped all the buttons from her shirt. She said: “I was really humiliated. It happened every day for about a week.”\nThe women made the decision to waive their right to anonymity in order to shine a light on the issue and give others the strength to come forward. Gemma said: “It’s really validating to have all these other women here. For so many years we kept it secret for fear of people not believing us.”\nFive women alleged they had been raped by Mr Al Fayed, who died last year at the age of 94, with a number of others alleging sexual misconduct.\nA press conference which set out the claims made against the late Harrods’ owner heard there was a “systematic failure of corporate responsibility”. Barrister Dean Armstrong KC told reporters: “And that systematic failure is on the shoulders of Harrods.”\nThe legal team also represents women who were employed by the Paris Ritz and investigations were ongoing into “all entities that he had involvement in”, including Fulham Football Club.\nIn a statement, Fulham said the club is “deeply troubled and concerned” about the case and were “in the process of establishing whether anyone at the club is or has been affected”.\nMr Al Fayed had previously been accused of sexually assaulting and groping multiple women, but a previous police investigation did not lead to any charges. Harrods previously said it was “utterly appalled” by the allegations of abuse and said it had set up a page on its website inviting former employees to come forward if they have allegations.",
  "word_count": 527,
  "scraped_at": "2026-02-14T14:13:39.869326"
}