{
  "article_id": "2f3560ffd1ce",
  "url": "https://www.sounderatheart.com/2025/12/ambition-versus-the-boredom-of-trophies/",
  "title": "Ambition versus the boredom of trophies",
  "date": "20251225T013000Z",
  "domain": "sounderatheart.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Austin recently jettisoned an average DP at a loss. They'll now have an open DP slot and the freedom to spend more money to take a loss in the future. They've also acquired two other players (Jayden Nelson and Joseph Rosales) using allocation money in trade. It's a lot of activity for a club that had their second-best season ever, finishing 6th in the West and 2nd in the Open Cup. Their fans should expect more. Their modus operandi is routine overhauls as they flail about hoping to catch fire, almost as much by luck as by an intentional system of incremental improvements that show a multiple window approach to transfers. Of Austin's 15 most used players in 2024, only seven are expected back in 2026. Five of those are over 30.\nLA Galaxy, a year after being in salary cap hell, are spending gobs of GAM and budget space rebuilding their defense. Jakob Glesnes and Justin Haak are strong additions. They are getting a potential MVP back. And yes, the house cleaning after the Cup did net them allocation. It's just they're having to use that fast to get back to their top form. Their post-MLS Cup is Back performance has been poor, decent, bad, great, horrible. There's not much evidence they know how to rebuild and the organization has a lot of practice since the Robbie Keane era ended. Seven of their top 16 in the Cup season are back. They've done a decent job of staying young, with only three of those over 30, though one is a starting CB who is now competing with two younger additions for playing time.\nIn just three windows a mediocre and a once-perennial favorite have completely reinvented their rosters. Both clubs are considered ambitious. They flip big slots constantly. They host All-Star Games. They get attention.\nThe very boring Seattle Sounders are bringing back 11 of 15 from their 2024 roster that was 7th overall, but 7 points behind 2nd in the West Galaxy. Only four of those players are over 30 in 2026. The DPs (and not-quite DPs) are mostly stable. One aged out, another earned the step up.\n2025 was a slightly down year – 10th overall, but ahead of the ambitious sides. It also netted another trophy, a performance on the global stage and a playoff performance that is a loss without losing a game.\nThere aren't major changes coming to the roster. The team is nearly running it back, replacing Danny Leyva and João Paulo with Hassani Dotson. There's likely a switch at starting keeper, but they're passing it over to an internal hire, a now veteran.\nBoring rather than ambitious.\nHighest number of wins 2009 to present. Best playoff performances 2009 to present. MLS Cups. Concacaf. Leagues Cup. A Shield. Open Cups. You're Sounders fans. You get it. The team is good to great (except that weird 2022).\nIt's boring, too.\nBig signings are rare. Sure there's the biggest at the time internal free agency signing who went on to be a top 5 central attacking midfielder in the past several years. There's the U22 signing who had one of the best U22 seasons in history that was swapped away for an underperforming DP who wanted away from his home club. Big(ish?) money for a Young DP went to a frequently injured dude who absolutely shines when he plays. And then there's the other former DP they convinced to take a pay cut to play here who promptly went out for the season.\nThe consistency of the roster is boring. The offseasons are boring. Summer transfer windows are even more boring.\nAnd yet the ambitious keep trying to keep up. Outside of LAFC and Inter Miami there are not teams that are consistently good while adding \"Breaking News\" level talent.\nThe boredom of planning several transfer windows ahead is 90% of the discourse in the Sounder at Heart Discord and in comments on the blog.\nWhether Waibel or Lagerwey or Hanauer, the Sounders roster flows forward like a mighty river. Its path may change, infrequently. The direction is consistent and intentional. Sudden lurches are unnecessary because the reasons for bringing in Player A in winter Y are still true in winter Y+2.\nWhen ambition rankings were a thing the Sounders were consistently mid-table. When the season ended the Sounders were consistently near the top with a trophy in reach, because the ambition that guides the soccer minds in Seattle is to raise banners in the rafters, not to get attention on SportsCenter or Sky Sports.\nHere's a salute to boring transfer windows that help me spend a cold night with 70,000 friends at Lumen celebrating awesome soccer.\nSounder at Heart gift guide\nCatching up on Sounder at Heart\nHere's what you missed on the site this week.\nSounders\nKey MLS offseason dates to watch\nNext match: Sunday, February 22, 2026 v. the Colorado Rapids | 6 p.m. PT | Apple TV/FS1\n- Paul Rothrock close to re-signing with Sounders\n- Sounders announce two more signings (Anchor, Sailor)\n- What kind of player is Hassani Dotson?\n- Realio’s Ratings: Seattle Sounders vs. 2025, #14-#11\n- Sounders select two Ballard FC players in MLS SuperDraft\nThis newsletter was made possible through the support of Full Pull Wines, a boutique wines reseller that has been sponsoring us since 2011.\nReign\nSchedule to come.\nDefiance and other local men's clubs\nSchedule to come.\nLooking back at the news\nEverything else you need to know\n- The World Cup is about places and people. In Seattle, it should be about Pride (The Guardian)\n- NWSL slammed for 'embarrassing' new high-impact player rule (ProSoccerWire)\n- Sources: Current to hire Armas as new head coach (ESPN)\n- Multi-club ownership is spreading in women’s football – but is it good news? (The Guardian)\n- The World’s Most Valuable Women’s Sports Teams 2025 (Forbes)\n- Inside the NWSL's first combine: Can the league create a more robust pathway for American talent development? (CBS Sports)\n- FIFA confirms dates for Women's Club World Cup in January 2028 (New York Times)\n- Politics latest: Roman Abramovich should 'pay up' £2.5bn from Chelsea FC sale or face court action, Starmer says (Sky News)\n- IFFHS MEN’S WORLD BEST YOUTH (U20) PLAYER 2025 (IFFHS) Obed at 10th globally!",
  "word_count": 1050,
  "scraped_at": "2026-02-14T12:37:13.000716"
}