{
  "article_id": "2fbc0066dd2d",
  "url": "https://kansaspublicradio.org/2023-11-03/headlines-for-friday-november-3-2023",
  "title": "Headlines for Friday , November 3 , 2023",
  "date": "20231103T160000Z",
  "domain": "kansaspublicradio.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Kansas Supreme Court Hears Arguments in Challenge to Voting Restriction Laws\nWICHITA, Kan. (KNS) – Kansas Supreme Court justices are considering whether to overturn voting restrictions put in place after the 2020 election. The Kansas News Service reports that the justices heard arguments in the case Friday. One of the laws requires Kansas election workers to verify signatures on advance ballots. Another restricts the number of advance ballots a person can deliver. The League of Women Voters and other groups say the mandates impede on voters’ fundamental rights.\nAttorney Elisabeth Frost said the restrictions don’t make elections more secure, but only make it harder for people to vote.\nKansas Attorney General Kris Kobach argued on behalf of the state, saying the laws boost security and prevent so-called ballot harvesting.\n==========\nWeeks After \"Security Incident,\" Kansas Electronic Court Records System Remains Offline\nTOPEKA, Kan. (KMBC) — The online court document system used by the Kansas judicial branch remains offline, weeks after the state supreme court announced there had been a \"security incident.\" Furthermore, there doesn't appear to be any timetable for a return to normal service. KMBC TV reports that a representative for the Kansas court system told a legislative committee that when online service is restored, it will come in phases.\nCase files, marriage licenses, background checks and multiple other online document systems have all been affected, forcing courts to move to rely on hard copies of paper, faxes or emailed records. Parts of the state’s court computer system went down in mid-October, except for Johnson County, which runs on a separate online system.\n==========\nKansas Receiving Nearly $25 Million to Support High Plains Aquifer\nTOPEKA, Kan. (KPR) — The Kansas Department of Agriculture is receiving nearly $25 million from the U.S. Department of Agriculture to support water conservation and groundwater management in the High Plains Aquifer. Governor Laura Kelly announced the grant Friday. She said the funding will help producers implement better conservation practices. Those conservation efforts include irrigation water management, cover crops and reduced tillage.\nThe High Plains Aquifer is the largest groundwater source in Kansas and plays an important economic role as farmers rely on it for irrigation. The High Plains Aquifer lies underneath western and south-central Kansas. The goal of the effort is to reduce water use by 10% in each of the state's five Groundwater Management Districts.\n==========\nWorlds of Fun Merges with Six Flags\nKANSAS CITY, Mo. (KCTV) – Cedar Fair, the company that owns the Kansas City area theme park, Worlds of Fun, has announced a merger with Six Flags. KCTV reports that the merger means the company will operate 42 amusement parks and 9 resort properties across 17 states, as well as in Canada and Mexico. The merger was approved Thursday by the Boards of Directors for both Six Flags and Cedar Fair. Worlds of Fun opened near Kansas City in 1973. An adjacent water park, Oceans of Fun, opened in 1982. Both parks were sold to Cedar Fair in 1995 for $40 million.\n==========\nShawnee City Manager Placed on Leave After Circulation of “Sexting” Video\nSHAWNEE, Kan. (Kansas City Star) —The Shawnee City Council has placed its city manager on administrative leave following a sexting scandal that was revealed Wednesday. Some city employees received emails including a video showing City Manager Doug Gerber performing a sex act. Those emails arrived a month ago. The Kansas City Star reports that Gerber, who was hired as city manager in March, did not personally send the video to employees. It was emailed to some staff on September 29 by an anonymous third party. After meeting in closed session for two-and-a-half hours Wednesday, the council voted unanimously to place Gerber on paid leave for an unspecific amount of time. The council will meet again on Monday to appoint an interim city manager. Shawnee voters will choose a mayor and three city council members Tuesday.\n==========\nKansas No Longer in \"Exceptional\" Drought\nWICHITA, Kan. (KWCH/KPR) — For the first time since March 2022, no part of Kansas is considered in \"exceptional\" drought conditions. Some parts of the state received 4 to 7 inches of rain last week. While 84% of the state remains in some level of drought, much of it ranges from moderate to severe. KWCH TV reports that some parts of southeast Kansas, including Elk, Chautauqua, Wilson and Montgomery counties, remain in severe drought. At least two communities in southeast Kansas - Caney and Sedan - face an ongoing water crisis.\nClick here to check the drought status of all the Kansas counties.\n(-Related-)\nCaney Valley District Announces Shortened School Week Due to Drought\nUNDATED (KNS) – A southeast Kansas school district is now closed on Mondays to save water, as drought continues to affect portions of Kansas. The Kansas News Service reports that the town of Caney near the Oklahoma border is desperate to save the little water it has, so students will stay home on Mondays.\nWhen kids are in school, most of them must now use outdoor trailer toilets so that less water gets used for flushing. Across Kansas, much of the state continues to experience drought, even if it’s not as bad as it was a year ago. Portions of 23 counties are still facing extreme drought, including parts of southeast Kansas and central Kansas.\nKansas Water Office Announces Drought Mitigation Funds\nTOPEKA, Kan. (WIBW) — Kansas will receive millions of dollars to fund projects addressing drought-related issues. The Kansas Water Office announced that $85 million will go to water projects over the next five years through the launch of the Technical Assistance Fund Grants and Water Projects Fund Grants programs. Both provide funds for up-front technical aid and on-the-ground actions needed to address water quantity and quality issues statewide. WIBW-TV reports that the grants were made possible through a bipartisan bill from the 2023 legislative session that increased funds for the State Water Plan Fund and established the two programs. Those eligible to apply for the funds include municipalities with an approved water conservation plan and special districts related to water organized under state law.\n==========\nU.S. Census: Kansas and Missouri See Small Increase in New Residents\nKANSAS CITY, Mo. (KC Star) — The populations of Kansas and Missouri have remained largely steady. However, the Kansas City Star reports that the populations of both states increased slightly last year. According to the U.S. Census Bureau, Missouri saw an estimated 163,000 people move to the state, while Kansas gained around 94,000 new residents. Both states saw more people move in than move out. The new data comes from the Census Bureau’s American Community Survey.\n==========\nKansas Day Care Worker Caught on Video Hitting Children Sentenced to 10 Years in Prison\nOLATHE, Kan. (AP) — A former suburban Kansas City day care worker who was caught on surveillance video kicking, hitting and shaking children was sentenced Friday to 10 years in prison. Rachel Beth Schrader was arrested in 2021 after coworkers noticed that an infant was injured and contacted police. In a police interview, Schrader acknowledged “losing her patience” that day, but said it was the only time, according to the affidavit.\nBut the investigators who watched the surveillance video were able to document her abusing or seriously neglecting children more than 170 times in less than a month at the day care where she worked in the city of Westwood. The affidavit describes her kicking a child square in the chest in one instance, causing him to fall backward and smack his head.\nSchrader pleaded guilty in March to four counts of child abuse.\n==========\nRural Areas in Kansas Need More Health Care Services for the Elderly\nTOPEKA, Kan. (KNS) – Advocates for older Kansans say rural areas need more health care services to help elderly people stay in their homes. A Kansas Health Institute conference Thursday focused on ways to improve health care services in rural areas. Suggested initiatives include expanding broadband access and using online tele-health services to help provide care in people’s homes. Jan Kimbrell is a resident of rural Council Grove and a member of the Kansas Silver Haired Legislature. She says many older people need to travel great distances to access health care and she says state agencies serving older Kansans often don’t work together or share information. “There’s a lot of red tape to cut through, and sometimes we don’t have time to cut through all that red tape.” Kimbrell says state officials need to break down barriers to better provide comprehensive care to aging rural Kansans.\n==========\nCosts for New KU Football Stadium Renovations Expected to Increase by $113 Million\nLAWRENCE, Kan. (LJW) — Costs to renovate the University of Kansas football stadium and add a conference center to its north bowl are likely to be more than $100 million greater than what KU leaders expected just a year ago. The Lawrence Journal-World reports that members of the Kansas Board of Regents were told that KU now expects its first phase of renovations at KU's Memorial Stadium to cost $448 million. That's up from a $335 million project maximum that the Regents approved late last year.\nThe stadium renovation is a piece of a bigger project that aims to convert the area around the stadium at 11th and Mississippi streets into a new gateway district for the university. KU leaders envision the area being a hub for conferences and conventions, while also housing restaurants, retail and other uses that would appeal to visitors, residents or KU students and staff. KU officials say work is expected to be completed by August 2025.\n==========\nKDOT: Labor Shortage Will Mean Longer Times for Highway Snow Removal\nTOPEKA, Kan. (KNS) — The Kansas Department of Transportation says it will take longer to clear highways of snow and ice this winter because the agency is short on staff. The department says it's 25% short of its snowplow driver goal. That means agency managers and supervisors with proper licenses are going to be recruited to help keep Kansas roadways clear. The department is trying to hire temporary staff to meet the need. Kansans can apply for these jobs on the department’s website. The agency did say there is enough salt and sand stockpiled to maintain roads when ice and snow fall. KDOT also pre-treats roads before snow to keep them as drivable as possible.\n==========\nKansas Lawmakers Look to Other States for Solutions to Child Care Shortage\nTOPEKA, Kan. (KNS) — Kansas lawmakers are looking to other states to find ways to reduce the state’s child care shortage. Lawmakers heard from a Colorado agency about what that state has done to address shortages. Some solutions include reduced tuition for some child care courses or a statewide universal preschool system. Kansas Republicans tried and failed to pass looser child care regulations earlier this year to ease the shortage. Republican Senator Renee Erickson says there are several key challenges. “We know the issue, and it comes back in my mind to accessibility and affordability,\" she said. State legislators passed a bill earlier this year that would have increased the number of kids cared for by each adult, but the governor vetoed it over safety concerns. Lawmakers return to Topeka in January and will consider child care legislation.\n==========\nKansas Bird Names Could Soon Be Changing\nTOPEKA, Kan. (KSNT) – Attention bird watchers: the names of many birds in Kansas and across the nation could soon be changing. The American Ornithological Society (AOS) says it will be changing the names of numerous birds in the U.S. and Canada next year due to “exclusionary and harmful” connections to the past. This month, the Society released an article detailing why these changes are being made. The organization said it’s working to address past wrongs to engage more people in the appreciation and protection of birds. Part of this process involves renaming all birds under the AOS's jurisdiction which are named after people. This will impact around 70-80 birds in the U.S. and Canada.\nKSNT reports that moving forward, even more birds may have their names changed. This is not the first time the AOS has made a change to a bird’s English name. In 2020, the AOS renamed McCown’s Longspur, a bird found in western Kansas, to the Thick-billed Longspur. This was due to the bird being named after amateur naturalist John P. McCown’s military service associated with the Confederate Army during the U.S. Civil War.\nThe AOS said it plans to establish a new committee dedicated to the assignment of all English common names for species that fall under the organization’s jurisdiction. The name-changing will begin next year. Members of the public will be encouraged to participated in this process. The scientific names of the bird species will not be impacted by the changes being made to their English names.\n==========\nDaylight Saving Time Ends This Weekend\nLAWRENCE, Kan. (KPR) – This weekend marks the end of Daylight Saving Time. Beginning at 2 am Sunday, November 5, clocks will fall back one hour. AAA Kansas spokesman Shawn Steward says the end of Daylight Saving Time will bring shorter days and longer nights. The travel and insurance company says the time change can also disturb sleep patterns and create drowsy driving conditions. AAA Kansas reminds motorists to prepare for sun glare during their Monday morning commutes and for reduced visibility on the road during their suddenly darker Monday evening commute.\n==========\nATF Offers Reward for Information About KCK Gun Store Heist\nKANSAS CITY, Kan. (KSHB) — The federal Bureau of Alcohol, Tobacco and Firearms is offering a $5,000 reward for information that leads to the arrest of a thief who used a stolen vehicle to smash his way into a gun store and steal firearms. KSHB TV reports that the break-in happened October 24 at Frontier Justice, a firearms retailer in Kansas City, Kansas. The business is a federally licensed firearms dealer and operates under the authority of the ATF. The bureau says the thief used a stolen, black Kia Soul to ram through the front doors and, investigators say, the same thief tried to break into the Bass Pro Shop store in KCK on the same night, but failed to get inside. The stolen Kia Soul was later found. Anyone with information about this theft should contact ATF at 800-ATF-GUNS (800-283-4867). All tips are kept confidential.\n==========\nKansas Pediatricians: Pregnant Women Should Get RSV Shot\nWICHITA, Kan. (KNS/KMUW) - Kansas doctors say it’s particularly important for pregnant women to get vaccinated against the illness RSV amid a national shortage of shots for infants. RSV is most dangerous to kids and older adults. Getting vaccinated during pregnancy transfers protection to babies before they’re born. Dr. Gretchen Homan is president of the Kansas chapter of the American Academy of Pediatrics. She says most babies who get RSV don’t need hospitalization, but it’s still hard for parents to care for them. “They can be sick for weeks at a time with terrible congestion, needing suctioning from their noses and having difficulty coordinating their ability to drink,\" she said. \"But parents are doing this at home and it takes a ton of effort.” Pediatricians celebrated the release of RSV immunizations this year, but high demand and high costs are complicating the rollout. The shortage is not impacting shots for pregnant women and adults 60 and older.\n==========\nChiefs to Face Dolphins in Germany on Sunday Morning\nKANSAS CITY, Mo. (KNS) –In one of the biggest NFL match-ups of the year, the Kansas City Chiefs and the Miami Dolphins will square off in Frankfurt, Germany on Sunday. It will be the Chiefs’ first chance to play Miami since wide receiver Tyreek Hill was traded to the Dolphins last season. While no one’s been able to fill that gap entirely for the Chiefs, second-year receiver Skyy Moore says he’s trying to be that guy for the Chiefs. “There’s more that I can get with my opportunities. I’m looking to build on that the rest of the season.” Moore said. Meanwhile, Tyreek Hill was named the AFC Offensive Player of the Month. Kansas City and Miami head into the game with 6-and-2 records. Kickoff is at 8:30 on Sunday morning.\n==========\nSporting in Game Two of Play-Off Series\nKANSAS CITY, Kan. (KNS) –The second game in a best-of-3 playoff series between Sporting Kansas City and St. Louis City takes place Sunday afternoon at Children’s Mercy Park. After winning in St. Louis last Sunday, Sporting can clinch the series with a victory this weekend. Remi Walter, whose goal put Sporting ahead in Game One says they can’t get comfortable against the Western Conference’s No. 1 seed. “We have to keep pushing because we will be in our stadium in front of our fans and we have to do the job at home,” Walter said. Sporting won its regular-season home match against St. Louis City in September. Sunday’s match starts at 4 p.m.\n==========\nBig 12 Action Features Bedlam, K-State at Texas and KU at Iowa State\nUNDATED (AP) — The Big 12 enters November with five teams tied for the conference lead. That group will be cut by at least two Saturday after games matching co-leaders. Tenth-ranked Oklahoma plays at Oklahoma State in the last scheduled Bedlam series game. The SEC-bound Sooners are coming off a loss at Kansas while the Cowboys have a four-game winning streak. In the other matchup of co-leaders, No. 25 Kansas State is at seventh-ranked Texas. The defending Big 12 champion Wildcats have outscored their opponents 82-3 the last two weeks. Iowa State, the other team that is 4-1 in conference play, hosts Kansas.\nGAME OF THE WEEK\nNo. 10 Oklahoma (7-1, 4-1 Big 12, No. 9 CFP) at Oklahoma State (6-2, 4-1). The last scheduled Bedlam series game could be for much more than long-lasting bragging rights since the rivals go into the final month of the regular season as part of a five-way tie for the conference lead. The Sooners, who are going next season to the Southeastern Conference, are coming off a loss last week at Kansas. Oklahoma State has a four-game winning streak.\nBEST MATCHUP\nNo. 25 Kansas State (6-2, 4-1) at No. 7 Texas (7-1, 4-1, No. 7 CFP) in another matchup of teams that are part of that five-way tie atop the Big 12 standings. The defending Big 12 champion Wildcats are coming off a 41-0 win over Houston a week after beating TCU 41-3 in a rematch of last year's title game. K-State is second in the Big 12 averaging 37.4 points per game, and Texas is fourth at 34.5 points a game. They are also the top two scoring defenses: Kansas State has allowed 127 points (15.9 per game), just ahead of Texas at 128 (16.0 ppg). Texas has won six in a row in the series.\nINSIDE THE NUMBERS\nIowa State (5-3, 4-1), the fifth team tied atop the Big 12 standings, hosts Kansas on Saturday. The Cyclones will be trying to get to 5-1 in conference play for the second time in four seasons after never doing that before. Kansas safety Kenny Logan Jr. had 10 tackles in the win over Oklahoma. That pushed his career total to 346, the most for an active FBS safety and one short of LeRoy Irvin's school record for a defensive back set from 1976-79.\n(-Related-)\nNo. 22 Jayhawks Head to Iowa State Looking for Consecutive Big 12 Wins\n(UNDATED) — No. 22 Kansas goes for back-to-back Big 12 wins on Saturday night when it visits Iowa State. The Jayhawks are coming off a 38-33 victory over then-No. 6 Oklahoma. A win over the Cyclones would give Kansas consecutive conference wins for the first time since 2008. Iowa State is in a five-way tie for first place in the Big 12 after being picked to finish 10th in the preseason media poll. KU coach Lance Leipold has provided no clarity on his quarterback situation. Jason Bean has started the past four games in place of the injured Jalon Daniels. Kansas just knocked off its highest-ranked opponent in 15 years, became bowl-eligible a second straight year for only the second time in program history and is in a fifth AP Top 25 over two seasons after not appearing in the rankings since 2009.\nThe Jayhawks would add another item to third-year coach Lance Leipold's resume if they beat Iowa State on the road Saturday night. It would mark the first time they've won consecutive Big 12 games since 2008. \"We need to play better after some of these big wins,\" Leipold said. \"We have an opportunity where you have to go on the road, play a first-place team. A lot of things are in front of us down the stretch here. Are we just satisfied with bowl eligibility or do we want to be a team that continues to take steps?\"\nKU QUARTERBACK\nLeipold provided no clarity to KU's quarterback situation earlier this week. Jason Bean has started the past four games and six of the eight in place of Jalon Daniels, who has had a back injury. Leipold said Daniels, who dressed for the Oklahoma game but didn't play, would be the starter if he's healthy.\nJAYHAWKS' 1-2 PUNCH\nKansas' Devin Neal and Daniel Hishaw are the top running back tandem in the Power Five with a combined 1,259 yards. Neal has 786 yards and seven touchdowns on 115 attempts and Hishaw has 488 yards and eight touchdowns on 80 carries.\nAMES IS NO BREEZE\nKansas hasn't won in Ames since 2008 or beaten the Cyclones in consecutive years since winning five in a row from 2005-09. The Jayhawks are 22-26-3 all-time in Ames.\n==========\nThis summary of area news is curated by KPR news staffers, including J. Schafer, Laura Lorson, Tom Parkinson and Kaye McIntyre. Our headlines are generally posted by 10 am weekdays and updated throughout the day. These ad-free headlines are made possible by KPR members. Become one today. And follow KPR News on Twitter.",
  "word_count": 3668,
  "scraped_at": "2026-02-14T12:06:15.768928"
}