{
  "article_id": "2fc347c27369",
  "url": "https://www.greatlakesadvocate.com.au/story/8758891/gold-seeks-redemption-in-womens-a-grade-grand-final/?cs=447",
  "title": "Gold seeks redemption in women A - grade grand final | Great Lakes Advocate",
  "date": "20240912T060000Z",
  "domain": "greatlakesadvocate.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "TUNCURRY-Forster Gold has a point to prove in tomorrow night's (Friday, September 13) Football Mid North Coast Southern League women's A-grade grand final against arch-rivals, Cundletown Jets at Tuncurry.\nSubscribe now for unlimited access.\nor signup to continue reading\nGold dominated the competition proper, finishing with an unbeaten record while scoring a whopping 97 goals.\nThey only conceded three.\nHowever, the Jets scored an upset 1-0 win in the major semi to earn yet another grand final berth.\nThe Jets are also the defending champions after beating Gold in last season's decider.\nThese two sides have been the benchmark in the women's competition for the best part of a decade.\nSo, Gold will be seeking redemption in the grand final.\nThey're a very professional and clinical side.\n- uncurry-Forster official, Pete Ragno.\n\"They're a very professional and clinical side,'' Tuncurry-Forster official, Pete Ragno said of the Gold team.\nGold bounced back to form when beating Pacific Palms in the final last Friday night to set up yet another showdown against the Jets.\nCaptain, Meaghan Lambert has been a mainstay for Gold for a number of seasons.\nThe vice captain, Alira Knight, is rated among the best players in the competition.\nGoal keeper, Kath Baker is another stalwart who has been in outstanding form this season.\nStriker, Sarah Goldsmith has been a dynamic regular goal scorer while Drucilla Morris is skilful and controls the midfield.\nThe A-grade grand final will kick-off at 8pm.\nGrand finals of the other grades will also be played at Tuncurry on Saturday.\nThe men's game will feature defending champions Wingham up against Taree.",
  "word_count": 267,
  "scraped_at": "2026-02-14T12:48:26.085873"
}