{
  "article_id": "2fd6b39d30a0",
  "url": "https://lapostexaminer.com/taking-note-of-a-few-things-the-enough-is-enough-already-edition/2024/05/23",
  "title": "Taking Note of a Few Things : The Enough is Enough Already Edition - Los Angeles Post - Examiner",
  "date": "20240524T034500Z",
  "domain": "lapostexaminer.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Taking Note of a Few Things: The Enough is Enough Already Edition\nJesus H Jones, we have gone poll crazy and there is more than just politics involved.\nAs far as politics go, we are at a point where we allow polls to determine how we vote rather than how we vote determining the polls. We have polls for entirely too many groups which, in my opinion, just adds to the divide in this nation. Polls should reflect a cross section of likely voters. Who really cares what left handed gingers who identify as mermaids think?\nThe average American voter is an idiot who does not understand that most presidential elections come down to six or seven swing states. Those are really the only polls that matter. California will go for Biden. Texas will go for Trump. It is pointless including them in polling. Arizona, Michigan, and Pennsylvania mean more to both Biden and Trump than the states they know they have already won.\n(INSERT)\nPolls prove one thing; we can collect all sorts of data and at the end of the day most of it means nothing. Anyone who ever sat through a teacher staff meeting can tell you this: Information that is useless is no different than ignorance except that ignorance brings bliss. Whatever information Republicans find about Hunter Biden is not going to change my mind any more than an evangelical will vote for Biden if he sees devil horns popping out of Trump’s head.\nThe sporting world is also off the rails. Who’s up? Who’s down? Who’s on the hot seat? Who is a smart bet? Who is unpredictable? Whatever happened to just wondering Who’s on First?\nAnalytics are for people who do not know how to look at humans and see people. They see numbers and nothing else. They determine how those numbers affect their profit margins and nothing else. If you need an education on this, watch the film Moneyball. It is not a sports movie nearly as much as it is a film about how our culture has changed and sees things. If “Greed is Good” sums up the 80’s. Moneyball sums up our present.\nFirst, we had the debate over the top ranked team in the nation for college football. Then came polls over who are the top ranked teams in each conference. Next came the ranking of the top quarterbacks in each conference. Finally, came the ranking of who had the best transfer portal rankings. All of this before any college has played a single football game. Give it a rest.\nIn case you were not aware, long ago, education switched from looking at students as kids and seeing them strictly as a test score. “How many one’s can be moved up to twos” How many three’s can become fours? Who should we expel before testing so he/she does not show up on our results? Which transfers are going to help our scores? Mostly, how do we skew the numbers so the public really believes their kid attends a Distinguished School and is an amazing student? Shit flows downhill and in education it means fooling the public at any cost.\nI once saw two administrators in the Hemet Unified School District brag and joke to the people at the table I sat at about how they deleted negative comments about the school’s leadership from an official review. The public, even the school board, only knows what a school wants it to know.\nThe system really is rigged if you rely on it. Counselors used to implore the importance of good grades in school so the low freshmen sweat hogs I was assigned could think they could go to college. Did they mention debt? Did they mention the advantages of trade school? Did they consider they were speaking to students who failed all of their middle school classes and just so happened to have a teacher who spoke the truth to them? College or a life of poverty was the message being sent to them.\nWhen information is used only to tell people what you want them to know, it is no different than when the Roman Catholic Church used to only tell illiterate serfs what they wanted them to know. Do not let them know the truth because what happens if they act on it?\nSo, Las Vegas is in bed with the NFL, NBA, and MLB. It behooves Vegas to provide the public with just enough information to get them to place certain bets that will only place money in the pockets of casino owners and in return, the owners of professional franchises. Data, analytics, and partial information is used to rob you blind and you keep falling for it.\nAnyone who can’t be bothered to read the holy book of their religion of choice and instead relies on their church to provide them with guidance is handing their thinking over to their church’s leadership. The same is true with any sports nut who relies on the data released from Vegas bookmakers for you to use when it comes to making a bet. The same is also true for any employee who blindly believes their management is providing them with all the facts and information they need to do their jobs. You only know what you choose to invest your time in mastering. That requires asking questions others might be uncomfortable answering.\nIt’s why whenever you enter into any business transaction, you are flooded with more information than you can read and asked to sign off. The people calling the shots, a doctor’s office, insurance company, bank, or financial advisor knows you are more likely to just sign the documents and remain ignorant while you are robbed blind.\nI am hoping Mike Tyson beats the crap out of Jerk Paul. It would be a foregone conclusion if Mike could put the bong away and let his lungs take in oxygen for a change.\nThe winner of the fight is set to take on the winner between AOC and MTG.\nI have no issue with the guy who attacked Paul Pelosi with a hammer being sentenced to 30 years in prison. My problem is if my next door neighbor does the same to me or vice versa, the courts will go much lighter with their punishments.\nI need to purchase a chop saw in order to make frames for all my paintings which are now close to 50. The problem is, I need to build a new and large shed/workshop for such an undertaking which means I will just end up filling it with more crap I really don’t need.\nBefore the end of the month, I should have new flooring installed in my home and with it, the end of the smell of dog piss in the stained carpets. If not, I will have to live with Mentholyptus in my nostrils. The smell was there when I arrived, but Laverne and Shirley added way more than their share. Once it is gone, I will only have myself to blame if it returns.\nToday is day two of temperatures in the low 90’s. The forecast calls for another week of this weather. Normally, this is not a big deal. However, since the past year had me living on the coast where I rarely saw it over 80°f, I am feeling it. The other thing that gets to me is the peak heat doesn’t hit until around 4 or 5 in the afternoon. When I lived in Hemet, the summer lows might have been in the mid 70’s but 30 minutes after sunrise the temperature increased 20 degrees.\nAm I the only person who sees the humor in Donald Trump, after word of his affair with Stormy Daniels was about to break, relied on a man named Pecker for help?\nIsraeli Prime Minister Netanyahu knows that as long as he insists his war won’t stop until all of Hamas is gone allows him to continue his slaughter of all Palestinians. Hamas is viewed as a cancer, the region is better off learning how to keep it in remission because even if he kills the entire cancer, we all know there are many others that will take its place.\nI do not put it past Netanyahu to have held off on “finding” three missing, now dead, hostages. The discovery, in my opinion, was timed to sway President Biden from stopping arms shipments to Israel and nothing else.\nIf I have learned anything from observing politics, there are no coincidences, just nicely timed events for political gain.\nVoters and leaders from red states have been known to threaten seceding from the union if Trump loses in the fall because the government is rigged. I laugh when they make their threats just as I do when celebrities threaten to leave the country if Trump wins.\nCalifornia is the state that might want to consider leaving. In the 2017/18 fiscal year, we received a little over $105 billion in federal money. It seems like a lot, but that same year we paid over $375 billion in federal taxes. We receive less than one-third back from Uncle Sam than what we pay out.\nOur state pays 12.9% of all the nation’s federal taxes but receives a pittance if it were considered an investment. At the same time, our state makes up 14.1% of the nation’s economy while 11% of the total population resides inside its borders. We produce one-third of all the nation’s vegetables, two-thirds of its fruit, and are needed for shipping, energy production, and much more. The result is, our state has the fifth highest economy in the world and are close to passing up the next two nations ahead of us.\nAdd all of that up, plus all of our military and technology industries and our leaving will hurt more than any red state could imagine. However, it is our open minded way of thinking and willingness to share the fruits of our labor that serves as a perfect example of everything the GOP opposes. The left of California is right in how it approaches life, while the right states are pretty much all wrong.\nI slept through the recent Northern Lights shows and now that more are predicted, I am betting I will miss them as well. Seeing the Northern Lights was one of the more common things I saw on profile bucket lists when I belonged to dating sites. I wonder how many of those women will remove that from their profiles now? Actually, upon further thought, I don’t care how many do.\nWhy are we outraged when an NFL player most of us have never heard of speaks before graduates at a Catholic college most of us had no idea existed and then says something that reflects his conservative views? Left leaning football fans might be shocked at how conservative some in football are just as right leaning fans might be shocked at those who are liberal. Coaches only care if a guy can play. Asking football players their views on social issues is going to elicit a response like Jack Nicholson gave to Tom Cruise when questioned about the truth. I am not sure most fans can handle it.\nTonight is a big night for me. I will be sleeping at a sleep clinic with monitors and cameras checking me to see what I already know. I fall asleep fast, I sleep through earthquakes, tsunamis, and home invasions, and I wake up feeling good. Of course, that was nowhere near the case when I had Laverne and Shirley. Fortunately, they have a new home and I am back to sleeping eight hours a night.\nIf I am diagnosed with sleep apnea, good luck getting me to wear a mask at night. I don’t wear my hearing aids and have not had my eyes checked in two years. I’m happy I remember to brush my teeth and put on clean underwear every day.\nI asked my primary doctor why I needed the test and he said, “I just want to be sure you do not have any sleep issues.” I pressed him more when he said, “Anyone at your age who lives alone needs to be tested.” How long before he insists I wear a life alert around my neck? If I fall and can’t get back up, it just means it is time for me to take a nap.\nJim is a life long resident of California and retired school teacher with 30 years in public education. Jim earned his BA in History from CSU Chico in 1981 and his MA in Education from Azusa Pacific University in 1994. He is also the author of Teaching The Teacher: Lessons Learned From Teaching. Jim considers himself an equal opportunity pain in the ass to any political party, group, or individual who looks to profit off of hypocrisy. When he is not pointing out the conflicting words and actions of our leaders, the NFL commissioner, or humans in general, he can be found riding his bike for hours on end while pondering his next article. Jim recently moved to Camarillo, CA after being convinced to join the witness protection program.",
  "word_count": 2208,
  "scraped_at": "2026-02-14T13:13:09.030189"
}