{
  "article_id": "2fe2b1f4e5a1",
  "url": "https://www.gaeliclife.com/features/st-mikes-approaching-another-milestone/",
  "title": "St Mike approaching another milestone",
  "date": "20241220T221500Z",
  "domain": "gaeliclife.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The St Michael’s club in Toronto will be 60 years old next year. Armagh man Mickey Hamill was one of the founders back in 1965 and there is a strong Ulster core steering the club forward into a landmark year. We take a look…\nTHE Irish immigrants took a look around and realised Toronto needed a GAA club. It was 1965, with Mike Bellew and Mike Reilly taking the lead, it wasn’t long until they had a meeting convened at Club Canadiana and the club was born. Eddie Flynn was elected as their first President.\nHis brothers Tommy and Seamus were among those involved at the beginning.\nMickey Hamill of Armagh was one of the first to sign up and was a significant figure in those early years.\nTommy O’Neill, Eddie Fleming, Louis Connolly, Gene Smith and Paddy Callan were also among the founding members.\nThere was early progress. The footballers won the Expo Cup in 1967 with the hurling team securing the league and championship the following season before retaining it.\nIt was all pointing up. By 1975, they were North American Senior Hurling Championship winners with a famous victory over Chicago side Harry Boland’s in the final.\nUnder the leadership of figures like Emmett O’Kane, Ena O’Brien – the club’s first female President – and the O’Brien brothers, the club continued to dominate.\nThe 1980s brought silverware in both football and hurling. With the multiple titles, it brought confidence.\nThe turn of the millennium brought fresh excitement and the club was about to double up.\nLate in 2001, via an idea floated in a pub, Lisa McCart suggested starting a ladies’ team. After quickly recruiting her cousin Michelle Coyle, the idea began to gain traction.\nBy the 2002 AGM, the proposal was approved. Mark Burns was appointed as the team’s first manager.\nA bumper turnout at their first training session, at York University, included both Canadian and Irish newcomers to the sport.\nThe Montreal tournament that season marked the beginning of a new chapter for the club. While results didn’t go in their favour, it was a weekend that forged lifelong friendships. The tone for success was set.\nAn historic first championship was secured in 2009 with a tough battle against Ottawa in the final.\nThey retained their title before regaining it in 2012, setting down a marker as one of the top ladies’ teams in Toronto.\nOver the years, the team has travelled to various cities, including Montreal, Ottawa, Boston, and San Francisco, to compete at the highest level.\nThe ladies have become an integral part of the club, with players like Sinead McElvanna, Kerrie Burns, Meghan Deeney, Erin Loughnane and Tressa McMaster.\nManagers like Cormac O’Muiri and Mark Burns have shaped the team into the force it is today.\nOn the pitch is one aspect. A strong sense of community has been pivotal too.\nThere are 76 players on the current club register that includes over 100 social members.\nPlayers moving across from Ireland make up 90 per cent of the membership. The number of Canadians continues to rise with some hailing from Mexico. It has helped develop the range of cultures in the club.\nSt Mike’s have Ulster members from Cavan, Monthan Tyrone and Derry.\nCavan’s Katie Reel is the current club secretary, with Gareth Treanor of Monaghan as treasurer. Tyrone man Sean Muldoon is the vice-chairperson.\nThe player representatives are Caoimhe Hurl (Tyrone) and Pauric McMullan (Derry).\nThere is also a Tyrone theme to the ladies’ management with manager Ultan Blee and coach Justin Hughes.\nIt doesn’t end there. Paddy Devlin, Conor Gribben (both Derry) and Jack Donnelly of Tyrone are also involved on the current committee. Their Ulster involvement is something they are very proud of.\nSt Mike’s have two football teams, one for men and one for women, but hope to get their hurling team back on the road.\nThe ladies will be aiming to go one better than last two seasons that brought two narrow final defeats.\nFor the men, St Mike’s are one of five evenly matched teams in Toronto, leaving every game feeling like a derby.\nGoing into their 60th season, St Mike’s can boast the title of Toronto’s blue-chip club.\nA seven-in-a-row run at the turn of the noughties has helped them amass 22 senior men’s titles. They’ve added eight ladies’ championship successes.\nIn recent years they not just placed a focus on success but they’ve emphasised the need to build the best social scene in Toronto in a bid to shorten the winter.\nThere has been the diversity of group boxing, indoor football and running clubs as alternatives to keep the bodies ticking over in the off-season.\nThere is an annual BBQ, awards night and a ski trip. The wheels are in place to get trips to other cities, including New York, with challenge games factored in.\nThere are plans to tap into their history, honouring those who got the club off the group.\nA retro commemorative jersey is another idea, a Hall of Fame award and rediscovering hurling.\nSince 1965, there has been progress, but not always in a straight line.\nRestrictive immigration laws made it harder to recruit players and therefore field competitive teams.\nLike many GAA clubs away from Irish shores, St Mike’s dug deep to engage with the communities, by the playing of games or social events.\nFinancial sustainability was another obstacle, especially with the travel and acquiring facilities.\nCovid-19 was another hurdle. The pause button was paused on all club activities. They embraced the virtual meetings, events and workouts. Coupled with the resilience, the club made it through.\nDespite these challenges, St. Mike’s has remained a resilient and community-driven club.\nThe club’s ability to overcome obstacles, particularly through the difficulties of the pandemic, has been a testament to the strength and determination of its members, both past and present.\nWhen the World Games came around in 2023, St Mike’s were well represented.\nErin Loughnane, Clodagh Keane, Jackie Haliday and Melissa Abou-Eid were involved from the ladies’ side of the club with Ultan Blee and Justin Hughes part of the management.\nFor the men, Michael Keane, Sean Reilly, Tom McCole, Taidgh Burton, Matt Fornari, Shane Gallagher and manager Paul Loughnane were on board.\nIt was a significant spread of members representing the club on the world stage.\nThe men of 1965 laid solid foundations. St Mike’s is now a vibrant club, ticking many of the same boxes Gaels are used to back home.\nFor anyone moving to Toronto, the doors open and their arms are open and welcoming.\nA common theme for the Irish overseas is how they rediscover a sporting career that fizzled out back home.\nSettling in abroad brings its own challenges. That’s why a GAA club is such a help. It’s a social network and an extended family.\nThose in the club have walked in the same shoes when they touched down in Canada.\nOn the practical side, there is help with anything from visa applications to a LinkedIn network to help employment connections. All on top of trying to win games and have the craic at training.\nThere are lifelong friendships, whether you’re a county star, an All-Star or a player who hasn’t kicked a ball or swung a hurl in 20 years.\nIt’s the same as when Mike Bellew and Mike Reilly put their heads together in 1965.\nThe new Toronto needed a GAA club and it’s gone from strength to strength.\nReceive quality journalism wherever you are, on any device. Keep up to date from the comfort of your own home with a digital subscription.\nAny time | Any place | Anywhere",
  "word_count": 1275,
  "scraped_at": "2026-02-14T12:48:45.645735"
}