{
  "article_id": "2feac22d5ef2",
  "url": "https://www.claytodayonline.com/stories/calendar-august-24th,81644",
  "title": "Calendar | Clay Today",
  "date": "20230824T184500Z",
  "domain": "claytodayonline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Posted 8/24/23\nEXPERIMENTING WITH WATERCOLORS: will be on Aug. 24 at 6 p.m. at the Keystone Heights Library, 175 Oriole St. The meeting is free and open to the public.\nLAKE REGION KIWANIS: will meet on Aug. 24 at 7:30 a.m. at the Montgomery Center, 88 SE 75th St. in Starke.\nLAKE REGION PROSPERITY PARTNERS COUNCIL: will host a meeting on Aug. 24 at 6 p.m. with guest speaker County Council Chair Betsy Condon. The meeting will be at the Keystone Beach Pavilion, 565 S. Lawrence Blvd. in Keystone Heights. To register, visit www.claychamber.com.\nThis item is available in full to subscribers.\nTo continue reading, you will need to either log in to your subscriber account, below, or purchase a new subscription.\nPosted\nEXPERIMENTING WITH WATERCOLORS: will be on Aug. 24 at 6 p.m. at the Keystone Heights Library, 175 Oriole St. The meeting is free and open to the public.\nLAKE REGION KIWANIS: will meet on Aug. 24 at 7:30 a.m. at the Montgomery Center, 88 SE 75th St. in Starke.\nLAKE REGION PROSPERITY PARTNERS COUNCIL: will host a meeting on Aug. 24 at 6 p.m. with guest speaker County Council Chair Betsy Condon. The meeting will be at the Keystone Beach Pavilion, 565 S. Lawrence Blvd. in Keystone Heights. To register, visit www.claychamber.com.\nWORKING MAN’S BASS TOURNAMENT: will be on Aug. 24 at 4:30 p.m. at Whitey’s Fish Camp, 2032 County Road 220 on Fleming Island. Guaranteed $500 prize to the winning two-person team. Call Daniel Green at (904) 449-9691 for more information.\nCLAY COUNTY BOARD OF ADJUSTMENT will meet on Aug. 24 at 6 p.m. at the BCC Meeting Room, fourth floor, at Administration Building, 477 Houston St. in Green Cove Springs.\nCONVERSATIONS AND CRAFTS: PRESSED FLOWERS VOTIVES: will be on Aug. 25 at 10 a.m. at the Keystone Heights Library, 175 Oriole St. The meeting is free and open to the public.\nFRIENDS OF THE GREEN COVE SPRINGS LIBRARY: will meet on Aug. 25 at 10:30 a.m. at The Club, 3616 Magnolia Point Blvd. Tell the security guard at the gate that you’re attending the library meeting.\nMIND-BODY YOGA: will be on Aug. 25 at 9 a.m. at the Fleming Island Library, 1895 Town Center Blvd. The session is free and open to the public.\nCONVERSATIONAL ENGLISH: FOR SPEAKERS OF OTHER LANGUAGES: will be on Aug. 25 at 3 p.m. at the Orange Park Library, 2054 Plainfield Ave. The meeting is free and open to the public.\nJASON ALDEAN’S HIGHWAY DESPERADO TOUR: will be at the VyStar Veterans Memorial Arena, 300 A. Philip Randolph Blvd. in Jacksonville on Aug. 25 at 7:30 p.m. Special guests include Mitchell Tenpenny, Corey Kent and Dee Jay Silver. Tickets, which start at $128, are available at ticketmaster.com.\nMATISYAHU PLUS G. LOVE AND SPECIAL SAUCE: with special guest, Cydeways will play on Aug. 25 at 6:30 p.m. at the Saint Augustine Amphitheatre, 1340C A1A South. Tickets, which start at $48.50, are available at ticketmaster.com.\nRIVER CITY DULCIMERS AND FRIENDS IN CONCERT: will play on Aug. 26 at 1 p.m. at the Orange Park Library, 2054 Plainfield Ave. The concert is free and open to the public.\nTOUCH-A-TRUCK: will be on Aug. 26 from 9-11 a.m. for quiet time and 11 a.m.-2 p.m. with lights and sounds at the Clay County Fairgrounds, 2497 State Road 16 in Green Cove Springs. The event includes indoor and outdoor activities provided by local organizations, county services, and vehicles of all sizes.\n$UICIDEBOY$’S GREG DAY: tour will be at the VyStar Veterans Memorial Arena, 300 A. Philip Randolph Blvd. in Jacksonville on Aug. 27 at 6:30 p.m. Special guests include Ghostmane, City Morgue, Sematary and Ramirez. Tickets, which start at $60, are available at axs.com.\nHISTORY OF MIKE ROESS GOLD HEAD BRANCH STATE PARK: will be presented by the Clay County Historical Society on Aug. 28 at 7 p.m. at Old County Courthouse, 915 Walnut St. in Green Cove Springs. Guest speakers will be Ryan Worthington and Barbara Bradley.\nUF/IFAS EXTENSION GARDENING ADVICE SERIES: will focus on attracting bees, butterflies and birds on Aug. 28 from 11:30 a.m.-12:30 p.m. at the Extension Office, 2463 State Road 16 in Green Cove Springs. For more information, call (904) 284-6355 or email whhobbs@ufl.edu.\nFAMILY SEARCH: will be on Aug. 28 6 p.m. at the Fleming Island Library, 1895 Town Center Blvd. To register, visit Library.ClayCountyGov.com. The meeting is free and open to the public.\nJOURNEY THROUGH THE DECADES WITH CRESCENDO AMELIA: will play on Aug. 29 at 6:30 p.m. at the Fleming Island Library, 1895 Town Center Blvd. The concert is free and open to the public.\nCLAY COUNTY SCHOOL BOARD: will conduct a workshop on Aug. 29 at 9 a.m. in the Multi-Purpose Center at H.C. Long Building, 23 Green St. in Green Cove Springs.\nCARD MAKING WITH THE CRICUT: will be on Aug. 30 at 5:30 p.m. at the Orange Park Library, 2054 Plainfield Ave. Register at Library.ClayCountyGov.com. The meeting is free and open to the public.\nGHOST: RE-IMPERATOUR USA: featuring Amon Amarth will be at Daily’s Place Amphitheater, 1 Daily’s Place in Jacksonville adjacent to EverBank Stadium on Aug. 30 at 7:30 p.m. For tickets, which start at $31, are available at ticketmaster.com.\nLAKE REGION KIWANIS: will meet on Aug. 31 at 7:30 a.m. at the Montgomery Center, 88 SE 75th St. in Starke.\nWORKING MAN’S BASS TOURNAMENT: will be on Aug. 31 at 4:30 p.m. at Whitey’s Fish Camp, 2032 County Road 220 on Fleming Island. Guaranteed $500 prize to the winning two-person team. Call Daniel Green at (904) 449-9691 for more information.\nMIND-BODY YOGA: will be on Sept. 1 at 9 a.m. at the Fleming Island Library, 1895 Town Center Blvd. The session is free and open to the public.\nFOOD TRUCK FRIDAY: will be on Sept. 1 from 5-9:30 p.m. at Spring Park in Green Cove Springs. There will be several food trucks and live music by Duval County Line. Bring your own chair and cooler to the free event.\nSLIGHTLY STOOPID: will bring their Summertime 2023 tour with Sublime with Rome, Atmosphere and The Movement to Daily’s Place Amphitheater, 1 Daily’s Place in Jacksonville adjacent to EverBank Stadium on Sept. 1 at 7:30 p.m. For tickets, which start at $39, are available at ticketmaster.com.\nMARKET AND MUSIC AT THE COVE PLAZA: will be on Sept. 2 from 10 a.m.-4 p.m. at 1415 S. Orange Ave. in Green Cove Springs. Fresh produce, food trucks, home décor, music, jewelry and hourly giveaway will be offered. For more information, email showcaseevents17@gmail.com.\nHOT WHEELS MONSTER TRUCKS: will be at the VyStar Veterans Memorial Arena, 300 A. Philip Randolph Blvd. in Jacksonville on Sept. 2-3. Times are 12:30 p.m. and 7:30 p.m. on Sept. 2 and 2:30 p.m. on Sept. 3. Tickets, which start at $20, are available at ticketmaster.com.\nCLAY COUNTY PLANNING COMMISSION: will meet on Sept. 5 at 5 p.m. at the BCC Meeting Room, fourth floor, at Administration Building, 477 Houston St. in Green Cove Springs.\nLAKE REGION KIWANIS: will meet on Sept. 7 at 7:30 a.m. at the Montgomery Center, 88 SE 75th St. in Starke.\nCLAY COUNTY HISTORIC PRESERVATION BOARD: will meet on Sept. 7 at 5:30 p.m. at the BCC Meeting Room, fourth floor, at Administration Building, 477 Houston St. in Green Cove Springs.\nCLAY COUNTY SCHOOL BOARD: will meet on Sept. 7 at 6 p.m. in the Teacher Training Center at Fleming Island High, 2233 Village Square Pkwy.\nHOYT B. COTNEY STADIUM: will celebrate the grand re-opening of its football stadium at Orange Park High on Sept. 8. After being forced to play on the road for most of its games in 2022, the Raiders will have a newly rebuilt stadium. In coordination with the Clay County District Schools, the Clay Chamber of Commerce will host a Business Tailgate Party at the stadium parking lot from 4-6 p.m., followed by Florida Blue Health Council’s Healthy walk at 5 p.m. The school and county officials will conduct the ceremonial ribbon-cutting at 5:45 p.m. inside the stadium, which will require a $5 game ticket to attend. The night will conclude with Orange Park hosting Clay High at 7 p.m.\nMIDDLEBURG GARDEN CLUB: will host its Anthesis Social on Sept. 8 from 9:30-11 a.m. at the Watson Realty Building, 2239 Blanding Blvd. Light refreshments, a raffle, educational demonstrations and resources, gardening tips, plant trades, sales, and civic projects will be featured. For more information, call (904) 343-8235 or email gardenclubofmiddleburg@hotmail.com.\nMIND-BODY YOGA: will be on Sept. 8 at 9 a.m. at the Fleming Island Library, 1895 Town Center Blvd. The session is free and open to the public.\nJORGE MASVIDAL’S GAMEBRED BAREKNUCKLE MMA: will be at the VyStar Veterans Memorial Arena, 300 A. Philip Randolph Blvd. in Jacksonville on Sept. 8 at 6 p.m. Tickets, which start at $50, are available at ticketmaster.com.\nZACH WILLIAMS: with special guest Consumed by Fire will play on Sept. 8 at 7:30 p.m. at the Saint Augustine Amphitheatre, 1340C A1A South. Tickets, which start at $54, are available at ticketmaster.com.\nYO LA TENGO: will play a free event on Sept. 9 at 7 p.m. at the Saint Augustine Amphitheatre, 1340C A1A South.\nKEYSTONE HEIGHTS CITY COUNCIL: will meet on Sept. 11 at 6 p.m. at City Hall, 555 S. Lawrence Blvd.\nCLAY COUNTY BOARD OF COMMISSIONERS: will meet on Sept. 12 at 4 p.m. at the BCC Meeting Room, fourth floor, at Administration Building, 477 Houston St. in Green Cove Springs.\n3 DOORS DOWN: will bring its Away From the Sun Anniversary Tour with special guest Candlebox to Daily’s Place Amphitheater, 1 Daily’s Place in Jacksonville adjacent to EverBank Stadium on Sept. 13 at 7:30 p.m. For tickets, which start at $29, are available at ticketmaster.com.\nLAKE ASBURY/PENNEY FARMS ADVISORY COMMITTEE: will meet on Sept. 14 at 6 p.m. at the BCC Meeting Room, fourth floor, at Administration Building, 477 Houston St. in Green Cove Springs.\nLAKE REGION KIWANIS: will meet on Sept. 14 at 7:30 a.m. at the Montgomery Center, 88 SE 75th St. in Starke.\nAARON TIPPIN, COLIN RAYE AND SAMMY KERSHAW: will bring their Roots and Boots Tour to the Thrasher-Horne Center, 283 College Dr. in Orange Park, on Sept. 15 at 7:30 p.m. Tickets start at $39 and are available at thcenter.org.\nMIND-BODY YOGA: will be on Sept. 15 at 9 a.m. at the Fleming Island Library, 1895 Town Center Blvd. The session is free and open to the public.\nTHOMAS RHETT’S HOMETOWN TOUR: will be at the VyStar Veterans Memorial Arena, 300 A. Philip Randolph Blvd. in Jacksonville on Sept. 15 at 7:30 p.m. Special guests include Cole Swindell and Nate Smith. Tickets, which start at $40.50, are available at axs.com.\nJACKSONVILLE SYMPHONY: will perform two Community Concerts on Sept. 15 and 16 at 7:30 p.m. in Jacoby Symphony Hall, 300 Water St., Jacksonville. The shows will preview the season’s musical offerings. The concerts are free, and to claim tickets, visit JaxSymphony.org.\nHICKORY TRAIL NATURE HIKE: will be on Sept. 16 at 9:30 a.m. at Camp Chowenwaw, 1517 Ball Road in Green Cove Springs. Event is free. Bring bug spray, bottled water and closed-toe shoes. You can register at forms.office.com/g/rnPhXtPeBG.\nLIL BABY’S IT’S ONLY US TOUR: will be at the VyStar Veterans Memorial Arena, 300 A. Philip Randolph Blvd. in Jacksonville on Sept. 16 at 7 p.m. Special guests include Glorilla, Rylo Rodriguez, Gloss Up and Hunxho. Tickets, which start at $56.50, are available at axs.com.\nKEYSTONE HEIGHTS HERITAGE COMMISSION: will meet on Sept. 19 at 10 a.m. at City Hall, 555 S. Lawrence Blvd.\nLAKE REGION KIWANIS: will meet on Sept. 21 at 6 p.m. Clyde’s Cozy Corner Café, 195 S. Lawrence Blvd. in Keystone Heights.\nFLORIDA REP. BOBBY PAYNE: will hold office hours on Sept. 21 from 9 a.m.-noon at Keystone Heights City Hall, 555 S. Lawrence Blvd. For more information, call Tammy Still at (352) 732-1244 or email her at tammy.still@myfloridahouse.gov.\nBRETT YOUNG: with special guests Jake Scott and Griffen Palmer will play on Sept. 21 at 7 p.m. at the Saint Augustine Amphitheatre, 1340C A1A South. Tickets, which start at $39, are available at ticketmaster.com.\nMIND-BODY YOGA: will be on Sept. 22 at 9 a.m. at the Fleming Island Library, 1895 Town Center Blvd. The session is free and open to the public.\nNE-YO: CHAMPAGNE AND ROSES TOUR: will be on Sept. 22 with special guest Robin Thicke and Mario at Daily’s Place Amphitheater, 1 Daily’s Place in Jacksonville adjacent to EverBank Stadium on Sept. 13 at 7:30 p.m. For tickets, which start at $49.95, are available at ticketmaster.com.\nPLAIN WHITE T’S: will play on Sept. 23 at 8 p.m. at the Thrasher-Horne Center, 283 College Dr. in Orange Park. Tickets, which start at 39, are available at thcenter.org.\nWU-TANG AND NAS: NY STATE OF MIND TOUR: will be on Sept. 23 with special guest De La Soul at 8 p.m. at Daily’s Place Amphitheater, 1 Daily’s Place in Jacksonville adjacent to EverBank Stadium on Sept. 13 at 7:30 p.m. For tickets, which start at $49.95, are available at ticketmaster.com.\nYONDER MOUNTAIN STRING BAND, RAILROAD EARTH, KELLER AND KEELS: will play at the St. Augustine Amphitheatre, 1340C A1A South at 6 p.m. on Sept. 23. This event is sold out.\nUF/IFAS EXTENSION GARDENING ADVICE SERIES: will focus on how to properly dispose of yard debris and protect Florida’s waters on Sept. 25 from 11:30 a.m.-12:30 p.m. at the Extension Office, 2463 State Road 16 in Green Cove Springs. For more information, call (904) 284-6355 or email whhobbs@ufl.edu.\nTHOMAS RHETT: HOMETEAM TOUR 23: will be on Sept. 25 at 7:30 p.m. at the VyStar Veterans Memorial Arena, 300 A. Philip Randolph Blvd., Jacksonville. Tickets are available at ticketmaster.com.\nCLAY COUNTY SCHOOL BOARD: will conduct a workshop Sept. 26 at 9 a.m. in the Multi-Purpose Center at H.C. Long Building, 23 Green St. in Green Cove Springs.\nCLAY COUNTY BOARD OF COMMISSIONERS: will meet on Sept. 26 at 4 p.m. at the BCC Meeting Room, fourth floor, at Administration Building, 477 Houston St. in Green Cove Springs.\nCLAY COUNTY BOARD OF ADJUSTMENT will meet on Sept. 28 at 6 p.m. at the BCC Meeting Room, fourth floor, at Administration Building, 477 Houston St. in Green Cove Springs.\nLAKE REGION KIWANIS: will meet on Sept. 28 at 7:30 a.m. at the Montgomery Center, 88 SE 75th St. in Starke.\nMIND-BODY YOGA: will be on Sept. 29 at 9 a.m. at the Fleming Island Library, 1895 Town Center Blvd. The session is free and open to the public.\nCARIN LEON’S COLMILLO DE LECHE TOUR: will be at the VyStar Veterans Memorial Arena, 300 A. Philip Randolph Blvd. in Jacksonville on Sept. 29 at 8 p.m. Tickets, which start at $75, are available at axs.com.\nJUNIOR WOMEN’S CLUB OF KEYSTONE HEIGHTS: will host its second annual Almost Fall Festival on Sept. 30 from 9 a.m.-2 p.m. at the Keystone Heights Woman’s Club, 6747 Women’s Club Drive. There will be more than 60 vendors.\nKEYSTONE HEIGHTS CITY COUNCIL: will meet on Oct. 2 at 6 p.m. at City Hall, 555 S. Lawrence Blvd.\nNATIONAL NIGHT OUT: is on Oct. 3 from 5-9 p.m. The Clay County Sheriff’s Office will have deputies on hand to share information to promote community partnerships and neighborhood camaraderie.\nCLAY COUNTY PLANNING COMMISSION: will meet on Oct. 3 at 5 p.m. at the BCC Meeting Room, fourth floor, at Administration Building, 477 Houston St. in Green Cove Springs.\nDUSTIN LYNCH: THE 2023 FURYK FOUNDATION CONCERT: will be on Oct. 3 at 7 p.m. at Daily’s Place Amphitheater, 1 Daily’s Place in Jacksonville adjacent to EverBank Stadium on Sept. 13 at 7:30 p.m. For tickets, which start at $29.95, are available at ticketmaster.com.\nALICE COOPER: will play Oct. 4 at the St. Augustine Amphitheatre, 1340C A1A South at 8 p.m. Tickets, which start at $44.50, are available at the venue’s box office or at ticketmaster.com.\nLYNYRD SKYNYRD: will play Oct. 5 with The Curt Towne Band at the St. Augustine Amphitheatre, 1340C A1A South at 7:30 p.m. Tickets, which start at $65, are available at the venue’s box office or at ticketmaster.com.\nCLAY CHAMBER AWARDS GALA: will be on Oct. 5 at 5:30 p.m. at The Hilltop Club, 2023 Wells Road in Orange Park. To buy tickets, visit claychamber.com.\nCLAY COUNTY HISTORIC PRESERVATION BOARD: will meet on Oct. 5 at 5:30 p.m. at the BCC Meeting Room, fourth floor, at Administration Building, 477 Houston St. in Green Cove Springs.\nLAKE REGION KIWANIS: will meet on Oct. 5 at 7:30 a.m. at the Montgomery Center, 88 SE 75th St. in Starke.\nLYNYRD SKYNYRD: will play Oct. 6 with The Curt Towne Band at the St. Augustine Amphitheatre, 1340C A1A South at 7:30 p.m. Tickets, which start at $65, are available at the venue’s box office or at ticketmaster.com.\nMIDDLEBURG GARDEN CLUB: will host its monthly meeting on Oct. 6 from 9:30-11 a.m. at the Watson Realty Building, 2239 Blanding Blvd. Light refreshments, a raffle, educational demonstrations and resources, gardening tips, plant trades, sales, and civic projects will be featured. For more information, call (904) 343-8235 or email gardenclubofmiddleburg@hotmail.com.\nFOOD TRUCK FRIDAY: will be on Oct. 6 from 5-9:30 p.m. at Spring Park in Green Cove Springs. There will be several food trucks and live music by Fat Cactus. Bring your own chair and cooler to the free event.\nMARKET AND MUSIC AT THE COVE PLAZA: will be on Oct. 7 from 10 a.m.-4 p.m. at 1415 S. Orange Ave. in Green Cove Springs. Fresh produce, food trucks, home décor, music, jewelry and hourly giveaway will be offered. For more information, email showcaseevents17@gmail.com.\nJON PARDI: MR. SATURDAY NIGHT WORLD TOUR: will be on Oct. 7 at 7 p.m. with special guests Midland, Ella Langley and DJ Highmax at Daily’s Place Amphitheater, 1 Daily’s Place in Jacksonville adjacent to EverBank Stadium on Sept. 13 at 7:30 p.m. For tickets, which start at $29.75, are available at ticketmaster.com.\nKIRK FRANKLIN’S THE REUNION TOUR: will be at the VyStar Veterans Memorial Arena, 300 A. Philip Randolph Blvd. in Jacksonville on Oct. 8 at 8 p.m. Special guests include New Breed, The Family and God’s Property. Tickets, which start at $32, are available at ticketmaster.com.\nNOAH KAHAN’S THE STICK SEASON TOUR: will be at the VyStar Veterans Memorial Arena, 300 A. Philip Randolph Blvd. in Jacksonville on Oct. 9 at 8 p.m. Special guest includes Samia. Tickets, which start at $92, are available at ticketmaster.\nCLAY COUNTY BOARD OF COMMISSIONERS: will meet on Oct. 10 at 4 p.m. at the BCC Meeting Room, fourth floor, at Administration Building, 477 Houston St. in Green Cove Springs.\nLAKE ASBURY/PENNEY FARMS ADVISORY COMMITTEE: will meet on Oct. 11 at 6 p.m. at the BCC Meeting Room, fourth floor, at Administration Building, 477 Houston St. in Green Cove Springs.\nLAKE REGION KIWANIS: will meet on Oct. 12 at 7:30 a.m. at the Montgomery Center, 88 SE 75th St. in Starke.\nJELLY ROLL’S BACKROAD BAPTISM TOUR: will be at the VyStar Veterans Memorial Arena, 300 A. Philip Randolph Blvd. in Jacksonville on Oct. 13 at 7:30 p.m. Special guests include Chase Rice and Struggle Jennings. Tickets, which start at $91, are available at ticketmaster.com.\nST. LUKE CATHOLIC CHURCH: will host its Food Giveaway on Oct. 14 from 9 a.m.-noon at 1606 Blanding Blvd. in Middleburg. For more information, visit stlukesparish.org or ccbjax.org.\nBERT KREISHER’S TOPS OFF WORLD TOUR: will be at the VyStar Veterans Memorial Arena, 300 A. Philip Randolph Blvd. in Jacksonville on Oct. 14 at 7 p.m. Tickets, which start at $36.75, are available at bertbertbert.com and ticketmaster.com.\nLAKE REGION KIWANIS: will meet on Oct. 19 at 6 p.m. Clyde’s Cozy Corner Café, 195 S. Lawrence Blvd. in Keystone Heights.\nFLORIDA REP. BOBBY PAYNE: will hold office hours on Oct. 19 from 9 a.m.-noon at Keystone Heights City Hall, 555 S. Lawrence Blvd. For more information, call Tammy Still at (352) 732-1244 or email her at tammy.still@myfloridahouse.gov.\nLONESTAR: will perform on Oct. 20 at 7:30 p.m. at the Thrasher-Horne Center, 283 College Dr. in Orange Park. Tickets, which start at $29, are available at thcenter.org.\nGABRIEL IGLESIAS’S DON’T WORRY, BE FLUFFY TOUR: will be at the VyStar Veterans Memorial Arena, 300 A. Philip Randolph Blvd. in Jacksonville on Oct. 20 at 8 p.m. Tickets, which start at $59.50, are available at ticketmaster.com.\nBUDDY GUY’S DAMN RIGHT FAREWELL: with special guest Christone “Kingfish” Ingram will play on Oct. 20 at 7:30 p.m. at the Saint Augustine Amphitheatre, 1340C A1A South. Tickets, which start at $44, are available at ticketmaster.com.\nROTARY CLUB OUTDOOR ADVENTURE VENDOR SHOW: will be on Oct. 21 from 9 a.m.-5 p.m. at the Clay County Shrine Club, 2471 Russell Road in Green Cove Springs. Call Sandra at (904) 923-9884 or Susan at (904) 631-2156 to reserve a vendor space.\nWETLANDS NATURE HIKE: will be on Oct. 21 at 9:30 a.m. at Camp Chowenwaw, 1517 Ball Road in Green Cove Springs. The event is free. Bring bug spray, bottled water and closed-toe shoes. You can register at forms.office.com/g/ZSr2DZbBrz.\nBETHUNE-COOKMAN VS. SOUTHERN: college football game will be on Oct. 21 at EverBank Stadium, 1 EverBank Stadium Blvd., in Jacksonville. Tickets, which start at $25, are available at ticketmaster.com.\nUF/IFAS EXTENSION GARDENING ADVICE SERIES: will focus on caring for gardening tools and winter on Oct. 23 from 11:30 a.m.-12:30 p.m. at the Extension Office, 2463 State Road 16 in Green Cove Springs. For more information, call (904) 284-6355 or email whhobbs@ufl.edu.\nCLAY COUNTY BOARD OF COMMISSIONERS: will meet on Oct. 24 at 4 p.m. at the BCC Meeting Room, fourth floor, at Administration Building, 477 Houston St. in Green Cove Springs.\nBILLY OCEAN: will be at the Thrasher-Horne Center, 283 College Dr. in Orange Park, on Oct. 25 at 7:30 p.m. Tickets, which start at $39, are available at thcenter.org.\nLAKE REGION KIWANIS: will meet on Oct. 26 at 7:30 a.m. at the Montgomery Center, 88 SE 75th St. in Starke.\nCLAY COUNTY BOARD OF ADJUSTMENT will meet on Oct. 26 at 6 p.m. at the BCC Meeting Room, fourth floor, at Administration Building, 477 Houston St. in Green Cove Springs.\nSAMMY HAGAR AND THE CIRCLE: with George Thorogood and the Destroyers and Damon Fowler will play on Oct. 26 at 6:30 p.m. at the Saint Augustine Amphitheatre, 1340C A1A South. Tickets, which start at $49, are available at ticketmaster.com.\nBOO ON THE BOULEVARD: will be all day on Oct. 28 in Keystone Heights. The event includes trick-or-treating along Lawrence Boulevard, food trucks, games and a movie at Keystone Beach.\nCLAY COUNTY HISTORIC PRESERVATION BOARD: will meet on Nov. 2 at 5:30 p.m. at the BCC Meeting Room, fourth floor, at Administration Building, 477 Houston St. in Green Cove Springs.\nLAKE REGION KIWANIS: will meet on Nov. 2 at 7:30 a.m. at the Montgomery Center, 88 SE 75th St. in Starke.\nFOOD TRUCK FRIDAY: will be on Nov. 3 from 5-9:30 p.m. at Spring Park in Green Cove Springs. There will be several food trucks and live music. Bring your chair and cooler to the free event.\nWARRANT: will play on Nov. 3 at 7:30 p.m. at the Thrasher-Horne Center, 283 College Dr. in Orange Park. Tickets start at $39 and are available at thcenter.org.\nMARKET AND MUSIC AT THE COVE PLAZA: will be on Nov. 4 from 10 a.m.-4 p.m. at 1415 S. Orange Ave. in Green Cove Springs. Fresh produce, food trucks, home décor, music, jewelry and hourly giveaway will be offered. For more information, email showcaseevents17@gmail.com.\nFANTASIA WITH SPECIAL GUEST JOE: will be at the VyStar Veterans Memorial Arena, 300 A. Philip Randolph Blvd. in Jacksonville on Nov. 4 at 8 p.m. Tickets, which start at $59, are available at ticketmaster.com.\nKEYSTONE HEIGHTS CITY COUNCIL: will meet on Nov. 6 at 6 p.m. at City Hall, 555 S. Lawrence Blvd.\nMUNCHIE MONDAYS: will be on Nov. 6 at Keystone Beach, 556 S. Lawrence Blvd., from 11 a.m.-2 p.m.\nCLAY COUNTY PLANNING COMMISSION: will meet on Nov. 7 at 5 p.m. at the BCC Meeting Room, fourth floor, at Administration Building, 477 Houston St. in Green Cove Springs.\nLAKE ASBURY/PENNEY FARMS ADVISORY COMMITTEE: will meet on Nov. 9 at 6 p.m. at the BCC Meeting Room, fourth floor, at Administration Building, 477 Houston St. in Green Cove Springs.\nLAKE REGION KIWANIS: will meet on Nov. 9 at 7:30 a.m. at the Montgomery Center, 88 SE 75th St. in Starke.\nCLAY COUNTY BOARD OF COMMISSIONERS: will meet on Nov. 14 at 4 p.m. at the BCC Meeting Room, fourth floor, at Administration Building, 477 Houston St. in Green Cove Springs.\nLAKE REGION KIWANIS: will meet on Nov. 16 at 6 p.m. Clyde’s Cozy Corner Café, 195 S. Lawrence Blvd. in Keystone Heights.\nFLORIDA REP. BOBBY PAYNE: will hold office hours on Nov. 16 from 9 a.m.-noon at Keystone Heights City Hall, 555 S. Lawrence Blvd. For more information, call Tammy Still at (352) 732-1244 or email her at tammy.still@myfloridahouse.gov.\nMIDDLEBURG GARDEN CLUB: will host its monthly meeting on Nov. 17 from 9:30-11 a.m. at the Watson Realty Building, 2239 Blanding Blvd. Light refreshments, a raffle, educational demonstrations and resources, gardening tips, plant trades, sales, and civic projects will be featured. For more information, call (904) 343-8235 or email gardenclubofmiddleburg@hotmail.com.\nHISTORY HIKE: will be on Nov. 18 at 9:30 a.m. at Camp Chowenwaw, 1517 Ball Road in Green Cove Springs. Event is free. Bring bug spray, bottled water and closed-toe shoes. You can register at forms.office.com/g/VJHtakSRir.\nLAKE REGION KIWANIS: will meet on Nov. 23 at 7:30 a.m. at the Montgomery Center, 88 SE 75th St. in Starke.\nUF/IFAS EXTENSION GARDENING ADVICE SERIES: will focus on caring for fruit trees on Nov. 27 from 11:30 a.m.-12:30 p.m. at the Extension Office, 2463 State Road 16 in Green Cove Springs. For more information, call (904) 284-6355 or email whhobbs@ufl.edu.\nCLAY COUNTY BOARD OF COMMISSIONERS: will meet on Nov. 28 at 4 p.m. at the BCC Meeting Room, fourth floor, at Administration Building, 477 Houston St. in Green Cove Springs.\nEMPTY BOWLS: will be on Nov. 30 to benefit Lake Area Ministries’ food pantry that feeds 700 people a month. Each ticket can be redeemed for a bowl of soup, bread and water, and you get to keep the bowl. For more information, call Tanya C. Dennis at (352) 473-2846.\nLAKE REGION KIWANIS: will meet on Nov. 30 at 7:30 a.m. at the Montgomery Center, 88 SE 75th St. in Starke.\nMIDDLEBURG GARDEN CLUB: will host its monthly meeting on Dec. 1 from 9:30-11 a.m. at the Watson Realty Building, 2239 Blanding Blvd. Light refreshments, a raffle, educational demonstrations and resources, gardening tips, plant trades, sales, and civic projects will be featured. For more information, call (904) 343-8235 or email gardenclubofmiddleburg@hotmail.com.\nKEYSTONE HEIGHTS CITY COUNCIL: will meet on Dec. 4 at 6 p.m. at City Hall, 555 S. Lawrence Blvd.\nCLAY COUNTY PLANNING COMMISSION: will meet on Dec. 5 at 5 p.m. at the BCC Meeting Room, fourth floor, at Administration Building, 477 Houston St. in Green Cove Springs.\nLAKE REGION KIWANIS: will meet on Dec. 7 at 7:30 a.m. at the Montgomery Center, 88 SE 75th St. in Starke.\nCLAY COUNTY BOARD OF COMMISSIONERS: will meet on Dec. 12 at 4 p.m. at the BCC Meeting Room, fourth floor, at Administration Building, 477 Houston St. in Green Cove Springs.\nLAKE ASBURY/PENNEY FARMS ADVISORY COMMITTEE: will meet on Oct. 13 at 6 p.m. at the BCC Meeting Room, fourth floor, at Administration Building, 477 Houston St. in Green Cove Springs.\nLAKE REGION KIWANIS: will meet on Dec. 14 at 7:30 a.m. at the Montgomery Center, 88 SE 75th St. in Starke.\nHICKORY TRAIL NATURE HIKE: will be on Dec. 16 at 9:30 a.m. at Camp Chowenwaw, 1517 Ball Road in Green Cove Springs. Event is free. Bring bug spray, bottled water and closed-toe shoes. You can register at forms.office.com/g/kNhQ5s5hJd.\nUF/IFAS EXTENSION GARDENING ADVICE SERIES: will focus on caring for plants before and after freezes on Dec. 18 from 11:30 a.m.-12:30 p.m. at the Extension Office, 2463 State Road 16 in Green Cove Springs. For more information, call (904) 284-6355 or email whhobbs@ufl.edu.\nFLORIDA REP. BOBBY PAYNE: will hold office hours on Dec. 21 from 9 a.m.-noon at Keystone Heights City Hall, 555 S. Lawrence Blvd. For more information, call Tammy Still at (352) 732-1244 or email her at tammy.still@myfloridahouse.gov.\nLAKE REGION KIWANIS: will meet on Dec. 21 at 6 p.m. Clyde’s Cozy Corner Café, 195 S. Lawrence Blvd. in Keystone Heights.\nGREATEST PIANO MEN: featuring Pete Peterkin, Bill Connors, David K. Maiocco and Donnie Kehr will play at the Thrasher-Horne Center, 283 College Dr. in Orange Park, on Jan. 12 at 7:30 p.m. Tickets start at $29 and are available at thcenter.org.\nMIDDLEBURG GARDEN CLUB: will host its monthly meeting on Jan. 12 from 9:30-11 a.m. at the Watson Realty Building, 2239 Blanding Blvd. Light refreshments, a raffle, educational demonstrations and resources, gardening tips, plant trades, sales, and civic projects will be featured. For more information, call (904) 343-8235 or email gardenclubofmiddleburg@hotmail.com.\nMIDDLEBURG GARDEN CLUB: will host its monthly meeting on Feb. 2 from 9:30-11 a.m. at the Watson Realty Building, 2239 Blanding Blvd. Light refreshments, a raffle, educational demonstrations and resources, gardening tips, plant trades, sales, and civic projects will be featured. For more information, call (904) 343-8235 or email gardenclubofmiddleburg@hotmail.com.\nMIDDLEBURG GARDEN CLUB: will host its monthly meeting on March 1 from 9:30-11 a.m. at the Watson Realty Building, 2239 Blanding Blvd. Light refreshments, a raffle, educational demonstrations and resources, gardening tips, plant trades, sales, and civic projects will be featured. For more information, call (904) 343-8235 or email gardenclubofmiddleburg@hotmail.com.\nMIDDLEBURG GARDEN CLUB: will host its monthly meeting on April 5 from 9:30-a11 a.m. at the Watson Realty Building, 2239 Blanding Blvd. Light refreshments, a raffle, educational demonstrations and resources, gardening tips, plant trades, sales, and civic projects will be featured. For more information, call (904) 343-8235 or email gardenclubofmiddleburg@hotmail.com.\nLUKE COMBS’ GROWIN’ UP AND GETTIN’ OLD TOUR: will be at EverBank Stadium, 1 EverBank Stadium Dr. in Jacksonville on May 3. Special guests include Cody Jinks, Charles Wesley Godwin, Hailey Whitters and The Wilder Blue. Tickets are available at axs.com.\nMIDDLEBURG GARDEN CLUB: will host its monthly meeting on May 3 from 9:30-11 a.m. at the Watson Realty Building, 2239 Blanding Blvd. Light refreshments, a raffle, educational demonstrations and resources, gardening tips, plant trades, sales, and civic projects will be featured. For more information, call (904) 343-8235 or email gardenclubofmiddleburg@hotmail.com.\nLUKE COMBS’ GROWIN’ UP AND GETTIN’ OLD TOUR: will be at EverBank Stadium, 1 EverBank Stadium Dr. in Jacksonville on May 4. Special guests are Jordan Davis, Drew Parker and Colby Acuff. Tickets are available at axs.com.",
  "word_count": 5106,
  "scraped_at": "2026-02-14T13:37:45.071872"
}