{
  "article_id": "2ff829b3dc00",
  "url": "https://www.manchestereveningnews.co.uk/news/showbiz-news/gemma-atkinson-asked-are-allowed-29205780",
  "title": "Gemma Atkinson asked  are they allowed  as she distracts with same thing amid sweet son update after honest admission",
  "date": "20240520T153000Z",
  "domain": "manchestereveningnews.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Gemma Atkinson asked 'are they allowed' as she distracts with same thing amid sweet son update after honest admission\nThe Hits Radio host was cheekily questioned as she was seen taking her daughter to her first football game\nGemma Atkinson was cheekily questioned as she was seen taking her daughter to her first football game. The match may not have ended in Manchester United Women's favour but the Hits Radio host and Mia, four, appeared to have a great time at Old Trafford.\nThe mother and daughter duo headed to the stadium on Saturday (May 18) where the Reds were defeated 6-0 by Chelsea. Ahead of the game, Bury-born Gemma and Mia were all smiles as they posed pitchside for a couple of snaps to document the special occasion.\nSharing the photos with her two million followers, the 39-year-old mum-of-two said: \"We’re ready! @manutdwomen Let’s Go!\" And while the game didn't go the Manchester team's way, the pair did appear to have a good time with Gemma later sharing how Mia was still 'happy to see some goals and other people happy' on the day.\nREAD MORE: Joe Swash reveals Stacey Solomon's flaw as he 'replaces her' after being issued demand by fans\nJoin our WhatsApp Top Stories and Breaking News group by clicking this link\nAnd while Gemma and Mia's trip sparked a flurry of sweet comments, it was Gemma's incredibly toned arms that quickly gained a lot of attention.\n@getmomstrong quipped: \"Dude, were you allowed to bring those guns in there!?\" @nicobobinus1 replied: \"I have arm envy!\" @jsred40 commented: \"Your arms and shoulders look AMAZING!\" @hdonaldx wrote: \"Wow those arms so jel.\" @suziecaffrey added: \"Look at that arm though.\"\nMeanwhile, Gemma also opened up to her fans and followers after she was quizzed on her nighttime routine and asked for advice about how she managed with both her children. After sharing an honest and kind post with a fellow new mother, the star shared the difference between when she second child, Thiago, was born to now.\nSharing a selfie of herself and her son, who was born in July, taken last year, the former Hollyoaks and Emmerdale star said: \"For reference, I remember those 'can you die from now sleep?' days well. When he was weeks old.\"\nShe then shared a video of herself and 10-month-old Thiago, known as Tio for short, after he'd just woken up in his own room and said: \"You get through it tho! We crack on because they need us,\" before adding a red love heart.\nIt comes after Gemma was praised by fans for sharing the 'reality' of her own C-section recovery. The Hits Radio host has made no secret of the good and the bad when it comes to welcoming children into the world. Gemma and her dancer beau Gorka Marquez welcomed their first child. daughter Mia, back in 2019. But it was a dramatic birth which left her needing an emergency cesarean when Mia's heart rate dropped after every contraction.\nHours after Mia's arrival, attention quickly turned to the new mum as she began to haemorrhage with Strictly Come Dancing star Gorka previously speaking about the horror of seeing his fiance covering bed sheets in blood. Gemma later praised the 'incredible' NHS staff at the Royal Bolton Hospital who saved her after the ordeal-filled childbirth.\nAnd last year, the couple excitedly welcomed their second child, son Thiago, into the world and while Gemma was hoping for a Vaginal birth after caesarean section [VBAC], she ended up having to have a second C-section and while it wasn't planned, it was a much more relaxing experience compared to the first and saw Gemma reunited with the same surgeon who delivered Mia.\nNow, in a recent post, Gemma shared the reality of her post-partum recovery and shared two different pictures showing her scars shortly after becoming a second-time mum and more recently as she holidayed in Tenerife with Gorka and their two children.\n\"The reality of my 2nd C section. 3 days postpartum to now,\" the 39-year-old started the caption of her post. \"The amount of messages I get from new mums asking is it normal for them to be sore & swollen after a section is unbelievable. A C section is a BIG operation. It’s essentially birth & abdominal surgery. They cut through 7 layers to get your baby out and in my opinion there unfortunately isn’t enough information about the after care.\n\"I was bruised, swollen & tender for a while with both mine, and I didn’t even contemplate exercising until around 15 weeks PP. It just isn’t worth it. I know some women who are so upset at having to have a section they can’t even look at their scar. When my bandages first came off I was shocked at the mess my tummy was in. It hurt when I coughed, sneezed, had a poo and when I held Mia & Thiago. I couldn’t even open the fridge without being in pain.\"\nShe later rounded off the post by adding: \"I’m at a place where I see my scar and smile because from it I have two beautiful healthy children. It’s my permanent reminder marked on me forever. I'm so grateful to the staff at Bolton hospital for delivering my babies the way they did.\"",
  "word_count": 885,
  "scraped_at": "2026-02-14T12:57:29.731041"
}