{
  "article_id": "2ffa792b3d90",
  "url": "https://www.anglocelt.ie/2025/09/14/leannes-living-in-the-moment/",
  "title": "Leanne living in the moment",
  "date": "20250914T163000Z",
  "domain": "anglocelt.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Leanne's living in the moment\nThere is a bit of upheaval in Leanne Kiernan’s life at the minute. Quite literally, kitchen cabinets are waiting to be installed in her new apartment, boxes have to be packed and unpacked. She is moving away from the noisy docks to a more dapper neighbourhood with a quaint park and quirky cafés. Simultaneous with her moving-in date, the dust should have settled in her workplace as well, after the whirlwind introduction of Gareth Taylor as head coach four weeks ago.\nNot a lot of time to restructure a football team, let alone a Women’s Super League outfit with high ambitions for the new season. For some, the 4-1 loss against local rival Everton in their first match is proof of their tenuous ambitions. It was definitely proof that the team needs to adapt faster to the changes. Striker Kiernan wants to play a part in this new formation.\n“Obviously it's all very new right now. With the new coaching staff, new style and everything coming in,” she admits. But: “I’m really confident that they will get the best out of me.”\nA few days in Cork as pre-season preparation gave the Bailieborough native the chance to refuel on Irish homeground while briefly touching base with family. At 26, Leanne Kiernan speaks with the perspective that hardship can bring. Her career has already been shaped by long injury layoffs and personal tragedy, most painfully the death of her brother Paddy in 2013. Those experiences have forged a philosophy she returns to often: Live in the moment, appreciate what’s in front of you, and never take anything for granted.\nKiernan knows too well how fragile a footballer’s career can be. Injury kept her sidelined for 18 months, a stretch that was as demanding mentally as it was physically. “The hardest thing about the rehab is the really long hours. You’re up at 6am and could still be in the gym at 4, 5 in the afternoon.” Lonely is not necessarily a word that springs to mind describing the glamour of professional footballers, but Leanne was painfully aware of the \"bubble” she and her teammates live in, far away from family to fall back on – especially when injury took her out of this closeknit group of athletes.\nYet, those hours taught her resilience and gave her a new understanding of the game. Watching from the outside sharpened her tactical awareness and sense of maturity. “I learned a lot about the game from watching the game. My analysis and my sense of the game. I've seen a lot more football and a lot more understandings of formations.”\nIt also made her determined to savour the feeling of being fit, healthy, and able to play again.\nThe importance of family runs through everything she says. Her parents, farmers in Cavan, have been constant supporters, travelling to matches and offering grounding advice. She laughs about her mum flying over just because she missed her, or her dad knowing when to tell her to stop overthinking training and just trust herself. “My dad's a very, very positive guy. He rang me the other day and goes 'you are living your best life Leanne, you don't even realise! You need to enjoy this because we're out here grafting while you're living your dream!'”\nThat support system, she acknowledges, has been vital: “I wouldn’t be here without them.” Even small moments, like spotting her parents in the same seats at Anfield, gives her strength and a sense of calm. She appreciates every moment of it.\nPaddy’s memory is also ever-present. She carries him with her, even marking her boots with his birthday as a quiet tribute. Scoring goals and being able to give her family moments of joy after their loss, she says, is one of her greatest motivations. In her words, he has become a guide for her journey - an unseen presence in both the good and hard times. \"It's really nice when you score and you look up and your mom and dad are smiling.”\nHome, she explains, is always her family in Cavan, but “I feel like Liverpool is a home away from home. The Scousers are very much like us,” she laughs. She has bonded with teammates and even former teammates are “friends for life.” For her, it is people who make a home, whether that’s family on the farm or teammates in the dressing room.\nDay to day, she focuses on “living your best life”, which for her doesn’t mean glamour or distraction, but instead being calm, content, and present. Looking ahead, Kiernan has personal goals - scoring for Liverpool, competing for trophies, and hopefully returning to the Irish squad. She balances ambition with acceptance of football’s unpredictability and upheaval.\nFor now, though, she’s embracing the present: fit, happy, and part of a strong Liverpool squad.",
  "word_count": 810,
  "scraped_at": "2026-02-14T13:44:25.953934"
}