{
  "article_id": "3000002997f6",
  "url": "https://www.cornellsun.com/article/2025/05/nfl-marketing-agent-rachel-booth-22-describes-her-front-row-seat-to-eagles-linebacker-jalyx-hunt-s-23-career",
  "title": "NFL Marketing Agent Rachel Booth  22 Describes Her  Front Row Seat  to Eagles Linebacker Jalyx Hunt  23 Career",
  "date": "20250506T081500Z",
  "domain": "cornellsun.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The chaos of the Eagles decisively beating the Chiefs to secure the 2025 Super Bowl win was on full display at Allegiant Stadium. Green and white confetti rained down on linebacker Jalyx Hunt ’23 as he celebrated his team being crowned the football champions of the National Football League.\nBut even in the pandemonium in New Orleans, Hunt made his way to the sideline to call his close friend and marketing agent — someone who has had a “front row seat in his journey.” He rang up Rachel Booth ’22.\n“Rachel,” Hunt said into the phone. “I just won the Super Bowl!”\nBooth immediately cheered, celebrating over the phone with him.\nTheir journey together started years prior, at Cornell. On Schoellkopf Field, Booth held a camera, trying to make small adjustments and capture the right angles while Hunt ran drills. She was brainstorming through ideas on how to piece together a highlight reel for an athlete feature for the Big Red Sports Network.\n“‘One day you will be a member of my team,’” Booth recalled Hunt saying.\nFive years later, under the blinding lights of the biggest football event in the world, the two fully realized their dreams.\nFrom Schoellkopf to the Superbowl\nBooth studied sociology in the College of Arts of Sciences with an interest in the effects of representation on sports media, specifically female athlete representation in athletics. As a two-time captain of the women’s polo team, Booth said she spent a lot of time at the team’s practices and games.\nHowever, when the COVID-19 pandemic hit, Booth had more time to think about her passions and started to explore her interest in multimedia content creation.\nShe sent a direct message to the Cornell Sports Instagram page, asking to meet the person who ran it. Then Director of Creative Services Eldon Lindsay answered her message, and the two met for lunch.\n“We got lunch together, and he offered me a job,” Booth said. “He helped me learn how to make sports content, which l developed a passion for.”\nIn August 2020, Booth started working with the Big Red Sports Network, where she said she got “unparalleled access” to athletes, like then football safety Hunt, the subject of an athlete feature video on Instagram.\n“[Creating videos] was how I met [Hunt],” Booth said. “He had an interest in video content as well, and he helped me by giving me thoughtful suggestions on how to shoot plays. We have switched back and forth in different phases of our career to support each other, and he really helped me improve my filming and media skills to where they are today.”\nBooth said that at the time of her initial shoot with Hunt, he was not even a starter for the football team. But he promised her that one day, he would become a professional football player, and she would be a member of his team.\n“I remember receiving that with a little bit of a laugh, but he believes so much in himself that it is so contagious and you can’t help but believe in him and yourself too,” Booth said.\nBooth continued working with Hunt, as she created the walk-out video for the 2020 football team. They strategized together on concepts to base the video on, which “was the first time they worked closely together,” helping her realize how much they clicked.\nRepresenting Athletes With Empathy\nAfter graduating from Cornell in 2022, Booth attended the University of Virginia’s McIntire School of Commerce, where she completed an accelerated master’s program studying commerce, marketing and management. She also used her last year of National Collegiate Athletic Association eligibility to join the UVA women’s polo team.\nShe said she uses her background in content creation and the business skills she learned at UVA to market herself, combined with her understanding of the athletic experience as a former D1 polo team member.\n“With my past experience as an athlete, I understand the long days, being tired and having a lot of things on your plate — … all that pressure,” Booth said. “I’ve experienced all those components to some degree, so I can empathize with it.”\nBooth also works at UVA to offer athletes “marketing, content creation and branding expertise” through a name, image and likeness collective named Cav Futures.\n“My main job at this point is consulting with the NIL collective at UVA, which gave me hands-on experience finding business sponsorships, managing athletes, coordinating schedules and helping their social media strategy, which all are skills I use today when I manage my own professional clients,” Booth said.\nIn addition to her work at UVA, she works with professional clients, including Hunt, Miami Dolphins wide receiver Malik Washington and Olympic equestrian athlete Will Coleman.\nSpeaking to girls and women aspiring for a career in sports, Booth said, “There is space for you here,” Booth said. “The game is growing, and sports need the perspective of women.”\nA Professional Career and Community Initiatives\nOn April 26, 2024, Hunt was selected by the Philadelphia Eagles as the 94th overall pick of the NFL Draft in the third round. Hunt called Booth ahead of time to let her know he was about to be drafted, and she watched his name get called live on television.\n“It was hard to hear him at first but I remember making out him saying, ‘I am about to get drafted,’” Booth said. “So it was special to tune in on TV and watch his name get called.”\nToday, Booth handles a number of tasks for Hunt, including running his Instagram, X and TikTok profiles; arranging events; and managing his day-to-day calendar.\n“It’s been such a blessing having a first row seat in his life,” Booth said. “To watch him realize his dreams has been so rewarding.”\nOn Feb. 9, Hunt sacked Kansas City Chiefs quarterback Patrick Mahomes at the Super Bowl, where the Eagles took the title.\n“[That game] felt like pulling a curtain back for the whole world to see the Jalyx that I know,” Booth said.\nBooth said her goal is to remain “future minded” with Hunt as they prepare for the next NFL season. She said she wants to continue to represent Hunt “as authentically as possible” and continue their community involvement.\nHunt’s bow-and-arrow celebration after sacking Mahomes cost him a $5,690 fine from the NFL. Following an offer to cover the fine from It's Always Sunny in Philadelphia star Rob McElhenney, Hunt instead capitalized on the attention to raise over $24,000 for a fundraiser to bring Philadelphia high school students on college trips organized by celebrity barber Kenny Duncan’s organization Barbers Who Care.\nBooth and Hunt have worked with other organizations as well, including supporting Philadelphia schools such as the Little Flower Catholic High School for Girls women’s basketball team and visiting the University High School in Orlando, which he is an alumnus of.\nBooth thinks they have “just started ingraining themselves” into the sports world.\n“Not everyone else around him believed he would make it to the level he is at now, so seeing him prove everyone wrong was amazing,” Booth said.\nZeinab Faraj is a member of the class of 2028 in the College of Arts and Sciences. She is a features editor on the 143rd Editorial Board and was the assistant sports editor of the 143rd Editorial Board. You can reach her at zfaraj@cornellsun.com.",
  "word_count": 1230,
  "scraped_at": "2026-02-14T12:43:30.635063"
}