{
  "article_id": "3014782a1f2d",
  "url": "https://www.espn.com/soccer/united-states-usaw/story/4854795/slow-starting-uswnt-blitz-new-zealand-lynn-williams-scores-on-return",
  "title": "Slow - starting USWNT blitz New Zealand as Lynn Williams scores on return",
  "date": "20230118T094500Z",
  "domain": "espn.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The United States women's national team opened 2023 with a 4-0 win over New Zealand on Wednesday in Wellington.\nMallory Swanson (nee Pugh) scored the opening goal seven minutes after halftime, bringing life to a U.S. attack that looked mostly absent in the opening 45 minutes. Swanson added a second goal nine minutes later, and Alex Morgan and Lynn Williams also got on the scoreboard.\n- Stream on ESPN+: LaLiga, Carabao Cup, FA Cup, more (U.S.)\nThe teams will meet again on Saturday in Auckland as the Americans use the trip to prepare on and off the field for this summer's Women's World Cup. The U.S. will play the entire group stage of the World Cup in New Zealand and at the two venues being used this week, giving the two-time defending champions a dry run of what their tournament life will look like.\nJUMP TO: Best/worst performers | Highlights and notable moments | Postmatch quotes | Key stats | Upcoming fixtures\nRapid reaction\n1. The U.S. still needs to put its collective foot on the gas\nUrgency, urgency, urgency. Little has changed in the pattern of collective U.S. form: the Americans are best when playing at a faster pace. A major piece of success in recent years has been high press that forced opponents to turn the ball over in dangerous positions.\nWednesday's first half was a dud from the U.S., who tried to methodically break down New Zealand's compact 4-4-2 by playing central. The result was a lot of center backs Becky Sauerbrunn and Naomi Girma playing between each other, followed by unforced turnovers in the middle of the park. The saving grace for the U.S. is that New Zealand, missing several starting players due to the games taking place outside of FIFA windows, offered nothing going forward.\nSuperior fitness and four substitutions to start the second half was part of the reason the floodgates opened. But the general urgency from the Americans was markedly different. Swanson and Trinity Rodman attacked space on their respective flanks. Emily Fox and Sofia Huerta pushed higher from their fullback positions.\nThe U.S. decided to take the game to New Zealand. Why it took 45 minutes to do so remains a point for improvement.\n2. The No. 6 position remains an enigma\nThe Julie Ertz-sized hole remains in place for the United States. Wednesday brought a different attempt at a solution. Taylor Kornieck made her first start for the U.S., playing in the No. 6 role that Andi Sullivan mostly occupied in 2022.\nKornieck plays higher up the field for San Diego Wave FC, so the move was a gamble to some degree. U.S. head coach Vlatko Andonovski told the HBO Max broadcast during pregame that Kornieck offered \"an opportunity for us to try something different\" and experiment with unpredictable movements.\nThe latter did not really happen. Lindsey Horan often dropped deep to create a double-pivot and get on the ball, but the Kornieck-Horan combination found little room to play out in the first half, often getting pulled wide in attempts to find space. Kornieck was replaced by Sullivan at the start of the second half, when the match changed significantly.\nWhether Kornieck is an answer in the role or not, her very presence as a starter there on Wednesday suggests that Andonovski is yet to settle on an answer in the position. Sam Coffey is another, less experienced option, as well.\n3. Lynn Williams is back at just the right time\nLynn Williams is back on the field after nearly a year away due to a hamstring injury, entering Wednesday's match in the 67th minute. Williams last played for the U.S. in February 2022 and did not play at all during the National Women's Soccer League regular season. She was traded from the Kansas City Current to NJ/NY Gotham FC last week, on draft day.\nA healthy Williams offers the best defensive presence of any forward in the U.S. pool. She changes the way the team defends from its highest point and allows for a higher, more relentless press. Williams returns at just the right time for a U.S. team in need of that spark.\nOn Wednesday, she marked her return with a goal, too -- and an impressive one. Seven minutes after checking into the match, Williams adjusted her body mid-air to get her head on Rodman's cross and generate enough power to comfortably beat New Zealand goalkeeper Erin Nayler.\nThe goal was an exclamation mark on Williams' long-awaited return. Even in a crowded forward pool, Williams offers two-way play that Andonovski will need at the World Cup.\nBest and worst performers\nBEST: Rose Lavelle -- Once again, Lavelle remains the one (healthy) U.S. player capable of breaking lines against defensively disciplined opponents. On the dribble or making a delayed run, Lavelle is the catalyst of this team. That backheel assist? Come on.\nBEST: Mallory Swanson -- A quiet first half gave way to a quick brace in the second half. For club or country, Swanson running at defenders in isolation is a recipe for success.\nBEST: Margaret Purce -- A dull first half from the Americans was highlighted by Purce's desire to attack defenders 1-v-1. It was an encouraging return for the winger who was dropped from the roster in October and November.\nWORST: Ashleigh Ward -- Caught out of position on a few occasions and exposed 1-v-1, particularly in the second half.\nWORST: Gabi Rennie -- Even as the hosts defended well in the first half, they had no outlet going forward.\nWORST: Grace Neville -- The U.S. found its most joy by isolating Neville on her flank.\nHighlights and notable moments\nIn the first half, the U.S. dominated possession, but mostly in areas that didn't pose a threat to the New Zealand defense.\nMorgan, Swanson & Purce combined to complete 19 passes in the first half.\n— Paul Carr (@PaulCarr) January 18, 2023\nSix teammates completed at least 27 each. Sauerbrunn & Girma had 58 each. pic.twitter.com/3UGbLx22fm\nSwanson scored the first two goals of the game in quick succession.\n✌️ for @MalPugh\n— U.S. Women's National Soccer Team (@USWNT) January 18, 2023\n📺 @HBOMax pic.twitter.com/qrsRNDJFoA\nAfter the match: What the players/managers said\nUSWNT's Lavelle: \"We had to find the ball a little more in between their seams, and give it a little in the more in the middle for them to collapse and then find our wingers. Tough first half for us, obviously some things to clean up, but a really good response.\"\nUSWNT's Williams: \"It feels amazing, but I give it to my teammates - they've been there with me through the whole way and supporting me and being like, 'You've got this, Lynn.' So it feels incredible.\"\nKey stats\n- Swanson scored her fourth brace for the U.S. national team\n- Morgan scored her 120th international goal\n- This was the biggest ever home crowd for a Ford Football Ferns game with 12,508 fans in attendance\nUp next\nUnited States: The U.S. face New Zealand in a friendly again on Jan. 20, before playing in their first match of the SheBelieves Cup against Canada on Feb. 16.\nNew Zealand: After their friendly against the U.S., New Zealand face Portugal in a friendly on Feb. 17.",
  "word_count": 1210,
  "scraped_at": "2026-02-14T12:14:24.018995"
}