{
  "article_id": "3017cef08b44",
  "url": "http://en.people.cn/n3/2025/0304/c90000-20284200.html",
  "title": "Chinese duo among 2025 Laureus Awards nominees - People Daily Online",
  "date": "20250304T060000Z",
  "domain": "en.people.cn",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Chinese duo among 2025 Laureus Awards nominees\nPARIS, March 3 (Xinhua) -- Chinese para-athletes Jiang Yuyan and Qu Zimo have been nominated for the Laureus World Sportsperson of the Year with a Disability Award as the nominees for the 2025 Laureus World Sports Awards were officially announced on Monday.\nThis year marks the 25th anniversary of the Laureus Awards. Given that the selection period aligns with an Olympic year, many of the nominees are athletes who excelled at Paris 2024.\nIn the Sportsman of the Year category, French swimmer Leon Marchand and Swedish pole vaulter Armand Duplantis are strong contenders after their dominant performances at the Olympics. Other nominees include Spanish tennis star Carlos Alcaraz, four-time Formula 1 world champion Max Verstappen, and Tour de France winner Tadej Pogacar.\nThe Sportswoman of the Year category is equally competitive. American gymnastics legend Simone Biles is the favorite after her comeback at the Paris Olympics saw her win three golds and one silver medal. Spain's football star Aitana Bonmati, the reigning Ballon d'Or winner, is also nominated. Other contenders include Kenya's middle-distance runner Faith Kipyegon, 400m hurdles world record-holder Sydney McLaughlin-Levrone, and tennis world No.1 Aryna Sabalenka.\nChinese athletes have made a breakthrough in the Sportsperson of the Year with a Disability category. Jiang Yuyan won an impressive seven gold medals in swimming at the Paris Paralympics, making her one of the Games' most decorated athletes. Meanwhile, Qu Zimo dominated para-badminton, securing both World Championship and Paralympic titles.\nIn the Team of the Year category, Spanish football enjoyed remarkable success, with Real Madrid's men, Barcelona's women, and Spain's men's national team all earning nominations. Additionally, NBA champion Boston Celtics, F1 constructors' champion McLaren, and the U.S. men's basketball team are also among the nominees.\nThe Breakthrough of the Year Award features three athletes who made history at the Paris Olympics. Julien Alfred won Saint Lucia's first-ever Olympic gold in the women's 100m, while Letsile Tebogo secured Botswana's first Olympic gold in the men's 200m. In swimming, 17-year-old Canadian sensation Summer McIntosh claimed three golds and one silver. They will compete for the award alongside Spain's teenage football prodigy Lamine Yamal, French basketball star Victor Wembanyama, and Bundesliga champion Bayer Leverkusen, which ended Bayern Munich's 11-year dominance with an unbeaten season.\nThe 2025 Laureus World Sports Awards ceremony will take place on April 21 in Madrid, where the final winners will be announced.\nPhotos\n- Beautiful scenery of rapeseed flowers and traditional earthen buildings draws crowds to Hua'an, SE China's Fujian\n- Science and technology give boost to agriculture in Wangjiang, E China's Anhui\n- Chinese white dolphins return to estuary in SE China's Fujian for seven consecutive years\n- Technology empowers spring wheat management in Xi'an, NW China's Shaanxi\nRelated Stories\n- OCA announces six candidates for Athletes Committee at Harbin 2025\n- China's sprinter Su Bingtian to retire after 2025 National Games\n- China's major sports titles in numbers in 2024\n- Yearender: Chinese culture resonates through sports\n- Single bamboo drifing team from Guangxi shines at the 12th National Traditional Games of Ethnic Minorities of China\nCopyright © 2025 People's Daily Online. All Rights Reserved.",
  "word_count": 525,
  "scraped_at": "2026-02-14T12:53:08.992580"
}