{
  "article_id": "305c65629b35",
  "url": "https://www.nytimes.com/athletic/6497808/2025/07/17/sweden-peter-gerhardsson-england-euro-2025/",
  "title": "Peter Gerhardsson is Euro 2025 most eccentric manager . Can he extend Sweden stay by beating England ? ",
  "date": "20250717T054500Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Some football managers read everything that is written about them. Some managers couldn’t care less what is written about them. And Peter Gerhardsson, somewhat unusually, is both.\nOn the one hand, the Sweden women’s manager has become famous for being impossible to annoy during his eight-year run with the team. When his decisions are criticised by journalists, it has been noted that he doesn’t bear grudges.\nAdvertisement\nBut it’s not because he doesn’t care about the press. Far from it. Gerhardsson has got into a habit of wiring his mother money throughout tournaments so she can buy all the Swedish newspapers back home every day. “When I arrive home, I get to read what has been written,” he said at World Cup 2023, where his side finished third after defeating the U.S. women’s national team in the round of 16. “Then she has it ready, and then I get the scrapbook. But it really costs money, I can tell you…”\nThat isn’t simply a reflection of the high cost of living back home in Sweden — granted, nothing compared to Euro 2025 hosts Switzerland — but also a consequence of his side always making the final stages of tournaments. Sweden have been beaten semi-finalists at the 2019 World Cup, Euro 2022 and the 2023 World Cup, and they finished runners-up at the delayed 2021 Olympics.\nOn Thursday, he will look to lead the team to yet another semi-final, taking on England in the Euro 2025 quarter-final after sweeping their group.\nThroughout those tournaments, Gerhardsson, who will leave the job after this tournament, has become renowned as something of an eccentric. In press conferences, he uses quaint Swedish expressions which don’t quite translate, or just about finds the right English expression but acts out what he’s saying, saying his players pressed like bees and providing the buzz noises.\nIn training this week, he interrupted his players’ game of keepie-uppies as they reached their target number by running into the circle to head the ball clear. At the last World Cup, he went viral by strolling out of a press conference and straight into a cleaners’ cupboard, rather than the exit door.\nHe referenced that incident this week after Sweden’s 4-1 win over Germany, when his own press conference was over, and player of the match Johanna Rytting Kaneryd was in place beside him. There was a moment of silence while Gerhardsson remained in his chair, having been told he could leave. “But what if I go the wrong way?” he asked, prompting Rytting Kaneryd to giggle.\nAdvertisement\nLast week, he was asked about the mood in the camp, and he said the only sign of anger was from himself when he couldn’t get his laser pen to work in the team’s tactical briefing. Later, when his assistant Magnus Wikman was asked whether he had noticed that Gerhardsson pronounced his surname strangely, he looked nonplussed. “Sometimes he calls me Martin,” he replied.\nView this post on Instagram\nIf this seems like an ‘embarrassing dad’ act, that says something about Gerhardsson’s fatherly relationship with his players. Age 65, he is the oldest manager in this competition; his own daughter is the same age as defender Linda Sembrant, who is 38 and about to retire from international duty. Perhaps that’s given him an understanding of how to communicate with his players, who praise him for being sympathetic and caring.\nAfter all, communication is perhaps the most important quality for a football manager, and this is Gerhardsson’s first job in women’s football. He is unusual in that he was a successful coach in the men’s game who made the switch. He had become almost synonymous with top-flight Swedish team BK Hacken during a seven-year stint in charge of the Gothenburg club, before leaving in 2016 — not because he was sacked, but because the club wanted him to commit to a long-term contract and he wasn’t convinced he wanted to stay so long.\nGerhardsson went out on a high by winning the Swedish Cup in 2016 (no other manager at Euro 2025 has won a senior trophy in men’s football).\nA year later, it was announced he would replace Pia Sundhage, Sweden’s most legendary female footballer and arguably the most revered coach in the women’s game at that time. His decision to take the job was almost unprecedented; such a prominent manager in the men’s game taking a job in women’s football. But it says something about Gerhardsson’s willingness to leave his comfort zone, and also about the standing of the women’s game in Sweden before its recent explosion in other parts of Europe.\nAdvertisement\nHis players demonstrate both a respect and a fondness for a manager who has always attempted to empower them, rather than dictate to them. This has meant, for example, him getting the best from someone like Kosovare Asllani, once considered a nuisance to some, but now the national side’s captain.\n“Peter has meant an incredible amount to me personally and my career,” Asllani once said of Gerharsson. “The role he gave me immediately after he took over gave me an incredible amount of responsibility, and he placed me in the position I love to play, the attacking midfield role. He wants us to make our own decisions and be brave.”\nBut Gerhardsson has a serious side. The players say he has an on/off switch; he suddenly flicks from relaxed mode to game mode. He can accept mistakes, but he can’t accept players not following instructions. In that respect, he shares a similarity with his counterpart on Thursday in Zurich, England manager Sarina Wiegman.\nThis is no coincidence.\nGerhardsson has always been an admirer of the Dutch model of football. He became obsessed with total football when watching the World Cup 1974 final as a 15-year-old, to the extent that he decided to take a coaching course in Rotterdam rather than in Sweden.\nWhen preparing to take charge of the Sweden national side after Euro 2017, he spent the tournament travelling around the Netherlands watching matches as Wiegman’s side won the competition on home soil. “Seeing that final was amazing,” he said, as reported by the Telegraph. “That football was very close to our ideal.” Wiegman’s Netherlands defeated his Sweden in the semi-final of World Cup 2019, and then her England did the same at Euro 2022.\nUnder Gerhardsson, Sweden play an attractive brand of technical football, with their best displays coming at the 2021 Olympics, when they scored some lovely goals after flowing team moves. They’ve been defined by their pressing in advanced positions, with Asllani and Stina Blackstenius always praised for shutting off passing angles and helping Sweden win the ball high up the pitch. At the same time, there’s still a familiar disciplined, rugged side to Swedish play, as England midfielder Georgia Stanway alluded to when asked about their qualities. “They’re tough, they’re physical, they’re more direct,” she said.\nAdvertisement\nEngland’s 4-0 win over Sweden in the semi-final in Sheffield three years ago was a slightly freak result. Sweden started the game much stronger, before Beth Mead opened the scoring against the run of play. In the aftermath of that defeat, Gerhardsson expressed a couple of regrets: that he couldn’t find a role for Lina Hurtig, and that Sweden didn’t have England’s individual quality to go past opponents.\nNow, Hurtig has her role. After her 12 appearances for Arsenal last season were all from the bench, she’s now conditioned to a role as a game-changing, goalscoring No 10. She scored after coming on as a substitute against both Poland and Germany in the group stage.\nIn terms of individual quality, Sweden have right-winger Rytting Kaneryd; in the group stage, only Germany’s Klara Buhl dribbled past more opponents. The game will probably be decided by both sides’ use of width, another key tenet of the Total Football approach both Gerhardsson and Wiegman love.\nGerhardsson takes pride in how self-sufficient his players are; how they’re able to reorganise tactics themselves because of their tactical intelligence. A good example was the World Cup group game against Italy two years ago.\nSweden were being outplayed in the opening stages, but during a brief injury stoppage, the players huddled together in the centre of the pitch, changed approach and ended up winning 5-0. Perhaps Gerhardsson’s legacy as a coach will be encouraging a number of the current squad to become coaches themselves.\nThat would keep up a fine tradition of Swedish coaches in the women’s game. There were more Swedish coaches than of any other nationality at World Cup 2023. Aside from Gerhardsson, Sundhage was in charge of Brazil, and Gerhardsson’s imminent replacement Tony Gustavsson coached hosts Australia. The same is true at Euro 2025: Sundhage is now with hosts Switzerland, while Andree Jeglertz coached Denmark (and Belgium coach Elisabet Gunnarsdottir is Icelandic by birth, but also a Swedish citizen, having coached Kristianstads for 14 years).\nOf course, memories of Gerhardsson will be significantly enhanced if he finally manages to take Sweden to a tournament victory this summer. But there’s a genuine sense that his performance as manager transcends the difference between winning and losing, which has — at the Olympics — come down to a mere penalty shootout.\nRegardless of what happens for the rest of Euro 2025, the articles on the final page of Gerhardsson’s scrapbook will celebrate a hugely memorable eight-year reign.\n(Top photo: Eddie Keogh/Getty Images)",
  "word_count": 1567,
  "scraped_at": "2026-02-14T13:01:51.834185"
}