{
  "article_id": "305c491f2bee",
  "url": "https://www.winnipegfreepress.com/uncategorized/2026/01/01/morgans-last-second-3-pointer-lifts-no-11-kentucky-over-no-5-lsu-80-78",
  "title": "Morgan last - second 3 - pointer lifts No . 11 Kentucky over No . 5 LSU 80 - 78 as Kiffin looks on – Winnipeg Free Press",
  "date": "20260102T044500Z",
  "domain": "winnipegfreepress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Morgan’s last-second 3-pointer lifts No. 11 Kentucky over No. 5 LSU 80-78 as Kiffin looks on\nAdvertisement\nBATON ROUGE, La. (AP) — Tonie Morgan hit a 3-pointer with 0.5 seconds left to lift No. 11 Kentucky to an 80-78 win over No. 5 and previously unbeaten LSU on Thursday night.\nRead this article for free:\nor\nAlready have an account? Log in here »\nTo continue reading, please subscribe:\nMonthly Digital Subscription\n$1 per week for 24 weeks*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $4.00 plus GST every four weeks. After 24 weeks, price increases to the regular rate of $19.95 plus GST every four weeks. Offer available to new and qualified returning subscribers only. Cancel any time.\nMonthly Digital Subscription\n$4.99/week*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $19.95 plus GST every four weeks. Cancel any time.\nTo continue reading, please subscribe:\nAdd Free Press access to your Brandon Sun subscription for only an additional\n$1 for the first 4 weeks*\n*Your next subscription payment will increase by $1.00 and you will be charged $16.99 plus GST for four weeks. After four weeks, your payment will increase to $23.99 plus GST every four weeks.\nBATON ROUGE, La. (AP) — Tonie Morgan hit a 3-pointer with 0.5 seconds left to lift No. 11 Kentucky to an 80-78 win over No. 5 and previously unbeaten LSU on Thursday night.\nRead unlimited articles for free today:\nor\nAlready have an account? Log in here »\nBATON ROUGE, La. (AP) — Tonie Morgan hit a 3-pointer with 0.5 seconds left to lift No. 11 Kentucky to an 80-78 win over No. 5 and previously unbeaten LSU on Thursday night.\nIt was a stunning loss before a crowd of 11,485 that included new LSU football coach Lane Kiffin, who walked hand-in-hand with Tigers’ coach Kim Mulkey onto the floor before the game.\nMorgan, a Georgia Tech transfer, led the Wildcats (14-1, 1-0 Southeastern Conference) with 24 points and 12 rebounds. Asia Boone had 18 points, including five 3-pointers; Teonni Key added 17 points and 16 rebounds; and Clara Strack had 15 points.\nMikaylah Williams had 26 points to lead the Tigers (14-1, 0-1). Flau’jae Johnson had 15 points while Jada Richard and Amiya Joiner had 14 apiece.\nMorgan’s clutch basket came after Williams hit three free throws for a 78-77 lead with 18.5 seconds left.\nUK’s front line height — Strack and Key are both 6-foot-5 — gave LSU a challenge it hadn’t faced this season.\nAlmost half of LSU’s nation-leading 108 points per game have come from second-chance (26.3 points per game) and fast-break (27.5) points.\nBut because LSU lost the rebound battle 45-29 for just the second time this season and could only force a season-low 10 turnovers, the Tigers had just four second-chance points and 13 fast-break points.\nWilliams scored 10 of LSU’s first 14 points as the Tigers roared to a 12-point lead in the first four minutes.\nBoone’s third 3-pointer of the first half gave Kentucky its largest lead at 30-25 with 7:39 left in the second quarter. The Tigers responded with a 9-0 run for a 34-30 advantage with 4:57 left, heading toward a 41-41 halftime tie.\nEntering the fourth quarter with a 65-60 lead, LSU never led by more than seven points.\nUp next\nKentucky: At home vs. Missouri on Sunday.\nLSU: At No. 11 Vanderbilt on Sunday.\n___\nGet poll alerts and updates on the AP Top 25 throughout the season. Sign up here. AP women’s college basketball: https://apnews.com/hub/ap-top-25-womens-college-basketball-poll and https://apnews.com/hub/womens-college-basketball",
  "word_count": 626,
  "scraped_at": "2026-02-14T13:24:16.907537"
}