{
  "article_id": "30612880d3ac",
  "url": "https://www.lubbockonline.com/story/entertainment/local/2023/05/18/lubbock-entertainment-the-edge-presents-american-buffalo-cactus-theater-hosting-corbin/70231132007/",
  "title": "Lubbock entertainment lineup Cactus shows , Dance Gallery  Portrait  ",
  "date": "20230518T190000Z",
  "domain": "lubbockonline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Lubbock entertainment lineup features Cactus shows, Dance Gallery, more\nThe Edge presents 'American Buffalo'\nThe Edge Theatre, 4228 Boston Ave., presents \"American Buffalo,\" directed by James Bush, Ph.D., at 7:30 p.m. on Friday and Saturdays, May 26-27, with 2:30 p.m. matinees on Sundays May 21 and 28.\nDon Dubrow (played by Sean Allen Jones), the owner of a junk shop where the action takes place, decides to steal a customer’s coin collection when he feels that he has been bested in a transaction including a valuable Buffalo nickel.\nHe enlists the help of a young junkie named Bobby (played by Nathaniel Connor Goins) but is later convinced by a manipulative friend that Bobby is incompetent. Unable to trust either, Don invites Walter Cole “Teach” (played by Demetrius “Mechie” Scherpereel) to join them.\nBobby becomes a scapegoat as the burglary plot unravels and tensions build into suspicion, anger, and violence.\nThis production is for mature audiences only.\nTickets are $17 for adults and $15 for seniors and students (plus taxes and fees). For more information or to purchase tickets, visit https://edgetheatrelubbock.org/\n'Long Island Medium' comes to Holly Hall\nTheresa Caputo brings Live! the Experience to the Helen Devitt Jones Theater of Buddy Holly H all at 3 p.m. Sunday, May 21.\nFor more than a decade Caputo, star of the hit TLC show \"The Long Island Medium\", has provided messages of peace and comfort to over a million people worldwide. Through sharing her gift of communicating with those who have passed on, Caputo delivers healing messages directly to audience members, comforting them with the revelation that our deceased loved ones are still with us– just in a different way.\nReserved seat tickets range from $44.75 to $99.75 (plus taxes and fees) depending on seating. There are also VIP packages and add-ons available for an additional charge.\nFor more information or to purchase tickets, visit www.buddyhollyhall.com/\nFundraising event benefits Cactus Theater marquee upgrade\nAn Evening with Barry Corbin is set for 7:30 p.m. Saturday, May 27, at the Cactus Theater. This is a fundraising event for a marquee upgrade at the theater.\nCorbin has appeared in hundreds of movies and TV shows over the past 40 years. Legions of fans remember him early on in \"Lonesome Dove\" and \"Northern Exposure\". And his career is still going strong with roles most recently in \"The Ranch\", \"Yellowstone\" and \"Tulsa Kings\".\nBefore he made his first on-screen appearance in \"Urban Cowboy\", Corbin had already acted in theater for more than 20 years. He started off performing on stages in Lubbock, where he grew up.\nFor this special event, the loveable Lubbock icon has put together a presentation that is a celebration of his personal and professional life. The event is highly interactive with Corbin taking questions from the audience.\nAt the conclusion of the show, he’ll take photos with audience members and sign autographs.\nReserved seat tickets are: first four rows (rows A-D), $100; next four rows (rows E-H), $75; next four rows (rows J-M), $50; balcony seats, $35; and balcony box seats (includes concessions), $200. For more information or to purchase tickets, visit cactustheater.com\nAlamo hosting 'On the Town' brunch\nNew York, New York's a wonderful town.Join Alamo Drafthouse Lubbock for an \"On the Town\" brunch at 11 a.m. on Sunday, May 28.\nThree sailors – Gabey (Gene Kelly), Chip (Frank Sinatra) and Ozzie (Jules Munshin) – are let loose in New York City on a 24-hour leave. On a subway, Gabey sees a poster of \"Miss Turnstiles of the Month\" – a woman named Ivy Smith, and the trio spends the day looking for her. Along the way they run into a cab driver, Hilde, who is wild for Chip, and a gorgeous anthropologist named Claire.\nA special brunch menu will be available for this screening as well as the Alamo's regular full menu.\nTickets for the movie are $10 and available online in advance at drafthouse.com/lubbock\nSparta to rock Jake's\nSparta, an El Paso band featuring Jim Ward, will be heading on tour to celebrate the 20th anniversary of their critically acclaimed, debut album \"Wiretap Scars\".\nThe group is scheduled to play at 6 p.m. June 1 at Jake's Sports Cafe, 5025 50th St. For more information on tickets, visit Jake's Sports Cafe on Facebook.\nRamsey to perform live at Cactus\nLegendary songwriter Willis Alan Ramsey will be live at the Cactus Theater at 7:30 p.m. Friday, June 2.\nThe Texas singer-songwriter is in the middle of a little tour, which seems inexplicable. He released one self-titled record in 1972, and has been mostly silent since: no more albums, few performances, few new writing credits. But that one album, released on CD a few years ago, continues its slow-burning life, with its motley instrumentation, its folkish, post-honky-tonk Southern mood and its enclosed cosmos of small-time characters.\nTickets for this show are $27.50 for the first four rows, A-D; $25 for remaining floor rows (E-M) and standard balcony; and $50 for balcony box seats, which include concessions.\nFor more information or to purchase tickets, visit cactustheater.com\nMilitary tribute at Cactus benefits Honor Flight\nSounds of West Texas presents a Tribute to Our Military at 7 p.m. Saturday, June 3, at the Cactus Theater. The concert will benefit the South Plains Honor Flight.\nSome of Lubbock's finest musicians will be doing a great mix of music and some fantastic patriotic songs to honor our military in the way in which they truly deserve. Along with your purchase of a show ticket, a donation bucket and a silent auction.\nFeatured performers will be: emcee Billy Don Hampton, Larry Allen, Steve Burrus, Jimmy Henderson, Brenda Hopkins, Mike Huffman, Donnetta Lippe, Katherine McLamore Lowrance, Donnie Martin, The McCreights, Kallie Rogers, Rustic Road, Betty Smith, Baxter Vaughan, Mark Wallney, Steve Williams and Erin Wolffe.\nThe doors will open at 6:15 p.m., and some door prizes will be given away at 6:50 p.m. Tickets are $20 for all floor and standard balcony seats; while the limited eight box seats in the balcony are $40, which includes concessions.\nTickets are available online at www.cactustheater.com, or by calling the box office at (806) 762-3233 or going by during new business hours, Tuesday-Friday from 3-5:30 p.m. Or, you can purchase tickets at the door on the evening of the show.\nDance Gallery School presents 'Portrait'\nThe Dance Gallery School of Dance Arts will host its 42nd Anniversary with a Major Production, “Portrait\", at 5:30 p.m. on Saturday, June 3, and at 2:30 p.m. Sunday, June 4, in the Helen Devitt Jones Theater of Buddy Holly Hall.\n“Portrait” is a celebration of the arts and the artists who create them. The dancers will explore a gallery of fine arts from Degas’ ballerinas to Van Gogh’s Starry Night, portray fashion icons like Audrey Hepburn and Marilyn Monroe, and honor spiritual leaders like Mother Theresa.\nAudiences will be enchanted by the art of Cinderella and the magic of fairytales and captivated by the art of literary greats such as F. Scott Fitzgerald and Bram Stoker. Enjoy the music of the Beatles, Elvis, David Bowie and more as the dancers pay tribute to some of music’s greatest artists.\nDancers consist of preschool through high school aged students performing pieces in the styles of tap, ballet, jazz, contemporary, pointe and hip hop.\nReserved seat tickets for this production range from $16 to $33 (plus taxes and fees), depending on seating. For more information or to purchase tickets, visithttps://www.buddyhollyhall.com/\nAlamo hosts special 'Cheerleader' brunch\nCelebrate Pride month with a special menu brunch screening of \"But I'm a Cheerleader\" at 11 a.m. Saturday, June 3, at Alamo Drafthouse.\nMegan (Natasha Lyonne) considers herself a typical American girl. She excels in school and cheerleading and she has a handsome football-playing boyfriend, even though she isn't that crazy about him. So she's stunned when her parents decide she's gay and send her to True Directions, a boot camp meant to alter her sexual orientation.\nA special brunch menu will be available for this screening as well as Alamo's regular full menu.\nTickets are $10 each and available online in advance at drafthouse.com/lubbock\nTinseltown to show 'Raiders' on big screen\nCinemark Tinseltown Lubbock and XD, 2535 82nd St., is hosting a special big screen showing of \"Raiders of the Lost Ark\" at 4 and 7 p.m. June 4 and 7 p.m. June 7.\nIndy (Harrison Ford) and his feisty ex-flame Marion Ravenwood (Karen Allen) dodge booby-traps, fight Nazis and stare down snakes in their incredible worldwide quest for the mystical Ark of the Covenant.\nTickets for this special event are $12.45 and available in advance online at www.fathomevents.com.\nCinemark presents 'The God Man'\nCinemark Movies 16 and XD 5721 58th St., will host a special screening of \"The God Man\" at 7 p.m. on June 6.\nIn \"The God Man\", filmmaker Darren Wilson turns his focus on the most famous person in history, Jesus Christ. Led by a series of dreams, chance encounters, and impossible timing, Wilson follows a spiritual rabbit trail that eventually leads to a remarkable conclusion about the nature and character of Jesus.\nFrom the wilds of Alaska, to the slums of Rio, to the tropical beauty of the Caribbean, this sweeping film chases a Jesus who is not bound by rituals and religious dogma, but who is real, alive, and active in the world today. He is not church. He is not religion. He is not hypocrisy. He is Jesus, and he is far better than you can ever imagine.\n\"The God Man\" is the final chapter in Wilson’s 15-year, six-film saga that includes \"Finger of God\", \"Furious Love\", \"Father of Lights\", \"Holy Ghost\", and \"Holy Ghost Reborn\".\nTickets for this special screening are $12.45 and available online in advance at https://www.fathomevents.com/\nAlamo screening 'Purple Rain'\nAlamo Drafthouse Lubbock is hosting a special screening of 1980s Prince film \"Purple Rain\" at 7:30 p.m. Tuesday, June 6.\n\"Purple Rain\" is the semi-autobiographical tale of The Kid, a Minneapolis musician navigating the club scene while dealing with a romantic rival and a difficult family life.\nA massive hit upon release, it's a showcase for the Purple One’s otherworldly musical, visual, and sartorial stylings, and introduced the world to the glory of \"When Doves Cry,\" \"Let's Go Crazy,\" and of course, \"Purple Rain.\"\nAs the man himself once sang, “U better live now.” Words 2 live by.\nTickets for this special screening are $7 and available in advance online at drafthouse.com/lubbock\nMoonlight Musicals hosting season kickoff event\nMoonlight Musicals is hosting a 2023 season opener celebration dubbed \"Hello Moonlight\" on Wednesday, June 7, at the Moonlight Musicals Amphitheater, 413 E. Broadway. There will be a 6 p.m. dinner al fresco followed by an 8 p.m. private performance.\nThere are different ticket levels including:\nIrene Molloy: $50 per person. Includes a special preview of \"Hello Dolly!\" Bring your own picnic dinner and chairs of your choice.\nDolly Levi: $150 per person. Includes individual seating for the el fresco dinner. Bring a seating of your choice for the performance.\nHorance Vandergelder: $2,000 per table. Includes four tickets for the 2023 season. As a table of 8, enjoy all the benefits including two bottles of complimentary wine and a private after-part on stage. It also features preferred seating for dinner and chairs for the performance will be provided.\nFor more information or to purchase tickets, visit https://moonlightmusicals.com/shows/\nAlamo Film Club screens 'Pink Flamingos'\nStill filthy, 50 years later, Alamo Drafthouse Film Club presents \"Pink Flamingos\" at 7:30 p.m. Wednesday, June 7.\nJohn Waters' \"Pink Flamingos\" follows megalomaniacal matriarch Babs Johnson (Divine) and her twisted family of miscreants as they vie for the title of \"the filthiest people alive\" with the Marbles (David Lochary and Mink Stole).\nIt's a colorful, raunchy, tasteless tour of tacky interiors, gaudy fashion, and the private lives of people so outrageously bad that you can't help but love them.\nAlamo Drafthouse Film Club is a reflection a continuing commitment to sharing the independent, classic and international films we love with audiences everywhere.\nTickets for this special screening are $10 and available for purchase in advance online at drafthouse.com/lubbock\nMoonlight Musicals opens season with 'Hello Dolly'\nMoonlight Musicals Lubbock kicks off its summer 2023 season with \"Hello Dolly\" at 8 p.m. on June 8-10, 15-17, and 22-24, at the Moonlight Musicals Amphitheater, 413 E Broadway.\nSay “Hello!” to a great summer with \"Hello Dolly.\" This musical adaptation of Thornton Wilder’s hit play \"The Matchmaker\" bursts with humor, romance, energetic dance and some of the greatest songs in musical theatre history.\nThe romantic and comic exploits of Dolly Gallagher-Levi, turn-of-the-century matchmaker and “woman who arranges things,” are certain to thrill and entertain audiences again and again.\nTickets for the show are $25, which include Select-A-Seat fees. For more information or to purchase tickets, visit https://moonlightmusicals.com/shows/\nCarole King tribute coming to Cactus\nTapestry: The Carole King Songbook featuring Suzanne O Davis is scheduled for 7:30 p.m. Thursday, June 8, at the Cactus Theater.\nThis show recreates the sound and vibe of a 1970s Carole King concert experience following her legendary album, \"Tapestry\".\nFans will be transported back to the iconic image of her multiple-Grammy-winning album of 1971.\nThe concert performance will also bring to life many hits from the Broadway musical smash, \"Beautiful\".\nTickets for this show are $35 for first six floor rows; $32.50 for remaining floor rows; $30 for standard balcony; and $65 for balcony box seats, which include concessions.\nFor more information or to purchase tickets, visit cactustheater.com\nSistine Chapel: The Exhibition coming to Amarillo\nThe internationally acclaimed Michelangelo’s Sistine Chapel: The Exhibition is coming to Amarillo on June 9 and runs through July 23. It will be the inaugural exhibit at the newly renovated Sunset Center in Amarillo, now called Arts in the Sunset.\nThis globally successful exhibit has been all around the world from Shanghai to Chicago, Phoenix, Berlin, Vienna and more. Tickets are on sale today and can be purchased online at artsinthesunset.org.\nMichelangelo’s Sistine Chapel: The Exhibition is a collection of the artist’s renowned ceiling frescoes from the Vatican’s Sistine Chapel, reproduced in a format allowing viewers to be faceto-face with the masterpieces. Through artfully displayed reproductions, this innovative presentation brings the audience just a few feet away from world-renowned pieces like The Creation of Adam and The Last Judgment.\nArts in the Sunset is located at 3701 Plains Blvd. The exhibit will be open Tuesday through Saturday from 11 a.m. until 7:30 p.m., with the last entry at 6 p.m. On Sundays, the exhibit will be open from 1-5:30 p.m., with the last entry at 4 p.m. The exhibit is wheelchair accessible. Viewing time is estimated between 60 and 90 minutes. Tickets rangefrom $19 to $26.50, based on age and time of day.\nProceeds from the exhibit will benefit the Downtown Women’s Center (DWC), Catholic Charities of the Texas Panhandle (CCTXP), the Amarillo Art Institute and the Amarillo Cultural District of the Texas Commission on the Arts.\nMadagascar Live coming to Holly Hall\nGet ready to move it, move it! Join Alex, Marty, Melman and Gloria as they escape New York Central Park Zoo and onto the stage in a live musical spectacular. Madagascar the Musical Live is scheduled for 7 p.m. Friday, June 9, in the Helen Devitt Jones Theater of Buddy Holly Hall.\nBased on the Dreamworks® movie, Madagascar The Musical Live! will have audiences of all-ages cheering and dancing as the crack-a-lackin’ friends find themselves on an unexpected journey to the madcap world of King Julien’s Madagascar.\nFeaturing new songs written for the stage, a bevy of dancing menageries and even some puppets, Madagascar The Musical Live! is an out-of-this zoo fun experience of friendship and more.\nTickets for this production range from $34 to $100 (plus taxes and fees) depending on seating. For more information or to purchase tickets, visit https://www.buddyhollyhall.com/\nBollywood star coming to Holly Hall\nMika Singh, a famous Indian singer, composer, music director, and movie artist of Bollywood fame, is coming to West Texas for the first time at 7 p.m. Sunday, June 11, at Buddy Holly Hall.\nSingh is one of the most popular singers in India, with many hit songs and compositions.\nHe has enthralled audiences worldwide with full-house live performances. Accompanied by his orchestra team and chorus singers, audiences will enjoy an electrifying, colorful, multi-cultural show, with popular songs and dance tunes. Talented Lubbock dance artists will perform along with Singh, singing and dancing with his band.\nReserved seat tickets range from $59 to $249 (plus taxes and fees) depending on seating and VIP features.\nFor more information or to purchase tickets, visit https://www.buddyhollyhall.com/\n'Hairspray' marks 35th anniversary\nCinemark Movies 16 and XD, 5721 58th St., presents Fathom's Big Screen Classics showing of \"Hairspray\" for its 35th anniversary. The movie will be shown at 4 and 7 p.m. June 11 and at 7 p.m. June 14.\n\"Hairspray\": It's Baltimore, 1962, and a rebellious teenager with the biggest bouffant on the block attempts to win the coveted \"Miss Auto Show\" crown as she fights against racial discrimination in this film created and directed by John Waters and featuring Divine in his/her last role.\nTickets for this special anniversary screening are $12.45 and available online in advance at www.fathomevents.com\nCactus features 80s rock tribute\nCaldwell Entertainment presents A tribute to Motley Crue, AC/DC, and Metallica at 7:30 p.m. Friday, June 9, at the Cactus Theater.\nThese heavy metal legends rocked the nations with their chart-topping hits “Kickstart My Heart,” “Thunderstruck” and “Master of Puppets!’ Come take a ride through space and time with this incredible salute to these metal legends.\nThe Caldwell Collective band and singers will blow you away with their tribute to these iconic bands.\nTickets are $25 for all floor and standard balcony seating; and $50 for balcony box seats, which includes concessions.\nFor more information or to purchase tickets, visit cactustheater.com\nSeger touring tribute comes to Cactus\nCactus Theater brings to the stage Seger System, the ultimate Bob Seger touring tribute at 7:30 p.m. Saturday, June 10.\nHighly experienced musicians with over 75 years of combined touring and studio careers formed the Seger System tribute band to honor the music of Rock and Roll Hall of Fame inductee Bob Seger and his Silver Bullet Band.\nSeger System has re-created the sound, look, and feel of the legendary rocker who gave us songs like “Old Time Rock And Roll”, “Night Moves”, “Against The Wind”, “Turn The Page”, “Mainstreet”, “Fire Down Below”, and many other chart-topping hits.\nTickets for this show are $27.50 for the first six rows, A-F; $25 for rows G-M; $22.50 for standard balcony seats; and $50 for balcony box seats, which includes concessions.\nFor more information or to purchase tickets, visit cactustheater.com\nAlamo hosts 'Dirty Dancing' movie party\nChampagne Cinema presents a \"Dirty Dancing\" movie party at 6 p.m. Sunday, June 11, at Alamo Drafthouse Lubbock.\nWhen \"Dirty Dancing\" came out in 1987, it changed lives. Baby and Johnny showed the world the power of dance, the power of love, and most importantly, the power of a shirtless and swingin' Patrick Swayze.\nThis film set the standard not only for dance movies but for romance in general – and more than 30 years later, we still dream of nailing that lift. And here at Alamo Drafthouse, there's no better place to celebrate Baby and Johnny, where you're encouraged to quote, sing, and dance along at this Movie Party screening. You'll also receive themed props, like your own \"Staff Quarters\" keychain, watermelon beach balls, and pink glow necklaces.\nTickets for this special movie party are $15.15 and available in advance online at drafthouse.com/lubbock/\nValli rescheduled for June 16\nThe original Jersey boy himself, Frankie Valli is coming to Buddy Holly Hall at 7 p.m. Friday, June, 16, for a rescheduled date from January. Tickets for the January performance will be honored.\nValli's career with the Four Seasons, as well as his solo success, have spawned countless hit singles. With unforgettable tunes like “Sherry,” “Walk Like A Man,” “Big Girls Don’t Cry,” “Rag Doll,” “December ‘63 – Oh What A Night,” “Can’t Take My Eyes Off of You,” and of course, “Grease.”\nHis songs have been omnipresent in other iconic movies such as \"The Deer Hunter\", \"Dirty Dancing\", \"Mrs. Doubtfire\", \"Conspiracy Theory\" and \"The Wanderers\".\nValli and the Four Seasons have sold more than 100 million records worldwide. They continue to tour throughout the U.S. and abroad to packed houses receiving nightly standing ovations from thrilled fans of multiple generations.\nReserved seat tickets for this show range from $54 to $175 (plus taxes and fees) depending on seating and VIP features.\nFor more information or to purchase tickets, visit https://www.buddyhollyhall.com/\nDad Jokes Comedy rings in Father's Day weekend\nJust in time for Father's Day, take dad to the Dad Jokes Comedy Show at the Cactus Theater at 7:30 p.m. Friday, June 16. The comedy show features Daryl Felsberg, Aaron Aryanpur and Brandon Davidson.\nFelsberg (XM Comedy, NBC’s Last Comic Standing), Aryanpur (Comedy Central, iTunes) and Davidson (XM Comedy, Keenan Thompson Presents) will keep you in stitches when they share their stories and jokes of fatherhood and life as they kick off Father’s Day Weekend.\nTickets for this show are $27.50 for rows A-C; $25 for rows D-M; $20 for standard balcony; and $50 for balcony box seats, which include concessions.\nFor more information or to purchase tickets, visit cactustheater.com\nHot Club of Cowtown brings Western Swing to Cactus\nHot Club of Cowtown celebrates 25 years of Western Swing at 7:30 p.m. Saturday, June 17, at the Cactus Theater.\nAward-winning Austin, Texas-based Hot Club of Cowtown may be the world’s most globe-trotting, effervescent string trio, who’s joyful sound blends the traditional Western swing of the 1940s American southwest with European hot jazz influences of the same era.\nThe Hot Club of Cowtown writes its own original songs and reinterprets everything from hoedowns to American songbook standards in its own, original style. The band is guitarist Whit Smith, fiddler Elana James, and upright bassist Zack Sapunor.\nReserved seat tickets are $27..50 for rows A-F; $25 for rows G-M; $25 for standard balcony; and $50 for balcony box seats, which include concessions.\nFor more information or to purchase tickets, visit cactustheater.com\nTucker to perform at Buddy Holly Hall\nWest Texas native Tanya Tucker is set to perform at 8 p.m. Friday, June 23, at Buddy Holly Hall.\nBorn in Seminole, Tucker had her first country hit, the classic “Delta Dawn,” at the age of 13 in 1972. Since that beginning, she has become one of the most admired and influential artists in country music history, amassing 23 Top 40 albums and a stellar string of 56 Top 40 singles, ten of which reached the No. 1 spot on the Billboard country charts.\nTucker's songs include some of country music’s biggest hits such as “Soon,” “Two Sparrows in a Hurricane,” “It’s a Little Too Late,” “Trouble,” “Texas (When I Die),” “If It Don’t Come Easy” and “Strong Enough To Bend.”\nReserved seat tickets for this show range from $39 to $129 (plus taxes and fees), depending on seating, and are available online at https://www.buddyhollyhall.com/\nTucker is donating $1 per ticket to support Farm Aid and its work to cultivate a vibrant, just and resilient family farm-centered system of agriculture in America.\nLTC presents 'Liberty Valance'\nDawmi Entertainment and Lubbock Theater Company present \"The Man Who Shot Liberty Valance\" at 7:30 p.m. Friday and Saturday, June 30 and July 1, and at 2:30 p.m. on Sunday, July 2, at Buddy Holly Hall.\n\"The Man Who Shot Liberty Valance\" is a classic story of good versus evil, law versus the gun, one man versus Liberty Valance. A tale of love, hope and revenge set against the vicious backdrop of a lawless society in the American West.\nReserved seat tickets range from $25 to $40 (plus taxes & fees), depending on seating. There is a special offer of $5 off for students and seniors (60 and older), with proof of valid ID.\nFor more information or to purchase tickets, visit https://www.buddyhollyhall.com/\nRanching Heritage Center to host inaugural Ranch Verse\nJoin cowboy songster Andy Hedges and special guests, Boots O’Neal, Randy Rieman, Dave Stamey, Red Steagall, and Andy Wilkinson, for a day of Western storytelling, song and poetry at the inaugural Ranch Verse on Saturday, Aug. 5.\n\"Ranch Verse will feature a variety of programming that will include working cowboy stories, cowboy poetry, western music, and discussions of ranch culture,” host Andy Hedges shared.\nDaytime events will be free to the public and take place from 10:30 a.m. to 4:30 p.m. at the National Ranching Heritage Center (NRHC) in Lubbock. A special welcome performance of cowboy poetry, range ballads, and storytelling by Red Steagall, Andy Wilkinson, Randy Rieman, and Dave Stamey will kick off the day from 10:30 to 11:30 a.m.\nFrom 1 to 2 p.m., visitors will have the opportunity to hear a live, onstage interview with Four Sixes Ranch cowboy and Ranching Heritage Association Working Cowboy Award recipient Boots O’Neal for broadcast on the Cowboy Crossroads podcast with Andy Hedges.\nRandy Reiman will take the stage from 2:15 to 3:15 p.m. to present the illustrated letters of cowboy artist Charles M. Russell through slides, commentary, and the spoken word.\nDaytime events will conclude with a discussion from 3:30 to 4:30 p.m. featuring Red Steagall, Andy Hedges and Dave Stamey on the poetry, music, and art emerging out of Western culture.\nAn evening performance will follow from 7:30 to 10 p.m. at the historic Cactus Theater with cowboy songster Andy Hedges, western songwriter Dave Stamey, and the legendary Red Steagall. Tickets for the evening performance start at $25 and are on sale on the Cactus Theater website.\nTo learn more about Ranch Verse, visit bit.ly/ranchverse. For questions, contact (806) 742-0498.",
  "word_count": 4300,
  "scraped_at": "2026-02-14T13:35:45.258740"
}