{
  "article_id": "3063667253b1",
  "url": "https://epgn.com/2025/02/05/celebrating-20-years-of-family-portraits/",
  "title": "Celebrating 20 years of Family Portraits - Philadelphia Gay News",
  "date": "20250205T214500Z",
  "domain": "epgn.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In 2005, the price of eggs was $1.13 per dozen, gas was $1.82 a gallon, Hurricane Katrina made landfall along the U.S. Gulf Coast, causing severe damage, killing over a thousand people, and George W. Bush was inaugurated for a second term as President of the United States (who thought we would want him back?). The first ever YouTube video, titled Me at the zoo, was uploaded to the World Wide Web. At nearby Six Flags Great Adventure, Kingda Ka opened, becoming the world’s tallest and fastest roller coaster at the time. Andrew Stimpson, a 25-year-old Scottish man, is reported as the first person proven to have been “cured” of HIV. The word sexting was listed for the first time in Merriam-Webster’s Collegiate Dictionary. Martha Stewart is released from a federal prison near Alderson, West Virginia, after serving five months for lying about her sale of ImClone stock.\nFor the LGBTQ+ community, there were more state anti-discrimination bills that established or strengthened statewide protections passed in 2005 than in any other year.\nCalifornia became the first state ever to pass a bill to extend the freedom to marry to same-sex couples this year. Unfortunately, Republican Gov. Arnold Schwarzenegger vetoed this important legislation. Another historic milestone occurred in Connecticut as well, where the instituted civil unions to provide state-level rights and responsibilities to long-term, committed same-sex couples.\nThe American Psychiatric Association votes at its annual convention to support government-recognized marriages between same-sex partners.\nIn Canada, Bill C-38 receives Royal Assent, legalizing same-sex marriage nationwide. “The Simpsons” became the first cartoon program to devote an entire episode to the topic of same-sex marriage.\nAnd this week in 2005, the first Family Portrait was printed.\nOver the years, I’ve written a few retrospectives, sharing my thoughts and some background on how the column came about. This week, I simply want to highlight a few of the people I’ve profiled — many of them community leaders, others who had gone unnoticed or unheralded. Some are no longer with us, and I had the privilege of interviewing them, and sometimes serving as the last forum to record their history.\nThis is just a cursory glance at some of the people I’ve spoken to. I hope some of these names stir memories for you or spark curiosity to learn more about them.\nThe very first column featured filmmaker and editor (and friend) Brian Gannon. That first year also included Marcie Turney, the powerhouse restaurateur who, along with her wife, Val Safran (interviewed in 2010), helped revitalize the Gayborhood. At the time, she had just begun building her empire with their first restaurant, Lolita.\nIn April 2005, I interviewed Angela Gardner, a pioneer in the trans community and a founding member of Renaissance. That July, I spoke with Darren Chadwick, an employee at TLA Video — remember them? August brought Donald Carter, the inspiration for this column, and in October, I met event manager and marketing consultant Noel Zayas. We became friends from that initial interview and remain so today. Zayas and I have an ongoing joke because approximately three out of five people he recommended for interviews after him turned out to be either not gay or still closeted. I’ve officially revoked his gaydar card.\nNovember featured Irene Benedetti, LGBTQ+ liaison to City Council member Frank DiCicco. Throughout her life, Benedetti worked on a variety of issues, including domestic-partner benefits for city workers, police reform, securing land for the John C. Anderson Apartments, crime-victim advocacy, and LGBTQ+ civil rights. Franny Price called her “the ‘aunt’ of the Philly LGBTQ+ community.”\nI wrapped up that first year with the funny and outrageous DJ K-Tell and Carolyn Thompson, the executive director of Mountain Meadows, one of only two camps in the U.S. at the time that provided a safe haven for youth from LGBTQ+ families. I had the pleasure of meeting many of the camp’s kids and speaking with them about their experiences growing up with queer parents. Many of them participated in “Rainbow Sprinkles,” a CD I released featuring children’s songs for kids with alternative families or LGBTQ+ relatives. One song from the CD, “Uncle Mike,” was, from what I’m told, the first trans-friendly children’s song. It was later turned into an animated video that screened at film festivals worldwide. A highlight for me was being invited to a press conference with Alan Cumming in Spain, where both of our films were screening.\nIn 2006, I interviewed the late Ray Duval. It’s one of the interviews that made me the proudest of what I do. Ray was an usher and house manager at the then-Prince Theater. He was one of those often unsung people that we see all the time, lovely and kind. He was so tickled and honored to have his story in print that he had a copy of the column bronzed and hung prominently in his home.\nAfter Duval, I interviewed Charita Powell, owner of Amazulu Collections at Reading Terminal Market. A reader was so inspired by Powell’s story that she went to the terminal to meet her in person. They are now happily married, and I was invited to the wedding. You never know what will come out of one of these columns!\nIn March, I was “In Bed With Butch” with Butch Cordova, and talked fashion with Tony Sparacino, the fashion guru who was also responsible for helping change the 13th Street corridor. A tireless advocate for the LGBTQ+ community, we lost Tony about a year after our interview, far too soon. At the end of 2006, I spoke to the lovely Andrea Lamour (Harrington), Miss Black Gay World 2006 and Miss Twelfth Air Command. For those who don’t know, Ms. Lamour has a beautiful voice and was kind enough to perform for The Women’s Film Festival for me two years ago. The end of the year wrapped with two sweet souls that we’ve also lost: bartender extraordinaire Frankie Morelli and pianist Ghosha. Whenever Frankie would see me, he’d shout out loud, no matter who was around us, “What are you!?! What are you!?! Say it with me! You’re a lesbian!” And he’d grab my hands and make me shout it out loud. 2006 also had me laughing out loud with drag performer, Wang Newton.\nI could fill up pages with all the wonderful people I’ve had the pleasure of meeting, but for times sake, I’ll try to skip through the years a bit. In 2007, I interviewed harpist Mary Groce, who is now my neighbor at the John C. Anderson Apartments; Rachelle Lee Smith of the Penn Jersey She Devils Roller Derby Team; and Michael Spritzler, a straight police officer who served as the liaison to the LGBTQ+ community. When I asked him what the most surprising thing he had learned about the LGBTQ+ community was, he replied — to our shame — that it was the animosity of LGB folks toward the trans community. Hopefully, we’ve grown since then as our trans family is under attack from this administration.\nI also chatted with Ed Hermance, one of the original owners of Giovanni’s Room, DJ Kathy Gibson, who is still spinning around town and each year at SisterSpace, Tom Wilson Weinberg who has a show currently running, and radio personality Debra D’Alessandro (who was also at SisterSpace last year).That year, I also interviewed a dentist, a dog groomer and a gym teacher.\nAnother one gone too soon was DJ Reenie Kane. In 2008, I happened to ask Kane if she collected anything and she told me that she loved pencils. After the column was published, she became inundated with people bringing pencils of all kinds to the clubs where she was DJing. And as Macy’s closes down, I think of the late Desiree Hines, the trans activist and organ player who taught me about the special shoes worn by the professional organists and the history of how the organ fit into the movie business.\nIn 2010, queer icon Gloria Casarez shared stories about her grandfather with me, her obsession with Wonder Woman and our mutual love of Dolly Parton.\nSadly, one of the people I interviewed in 2010 lost their job when their employer found out that they identified as part of the LGBTQ+ community, a reminder that we’re still not safe in Pennsylvania.\nOn the other side of the spectrum, I got a letter from the members of a college track team in 2011. The letter began, “I want to tell you a little about my coach” and went on to describe the team’s incredible mentor, coach Jose Rodriguez. They told me that it was cool to have an openly gay coach, who they could talk to about anything. The majority of the team was straight but appreciated his frank talk and concern for all. On a side note, a year after I did the interview with Rodriguez, he invited me to the campus to interview Chaz Bono who was their guest speaker for National Coming Out Day. I love how one good thing leads to another with what I do.\nAnother one of those instances was meeting with Tenika Watson. I did Watson’s profile to talk about her life prior to the release of her book, “My Life is No Accident.” Watson was in the car during the accident that left singer Teddy Pendergrass paralyzed, but her story goes far beyond that moment. When the filmmakers of the award-winning film on Pendergrass’s life wanted to interview Watson, they contacted me. She agreed to be interviewed as long as I could be present. It ended up being a positive interaction and I’m still in touch with Watson and the filmmakers after all these years.\nAt the end of 2014, I had the honor of interviewing Sarah McBride. At the time, McBride was just starting her journey into politics and now she is the nation’s highest-ranking openly transgender elected official and the first openly transgender member of the United States Congress. This is why I never delete anyone’s phone number, tee hee. Later that month, I did an interview with the fabulous Beekman Boys, Brent Ridge and Josh Kilmer-Purcell, from a bed at the Philadelphia Home Show. The lifestyle experts and “The Amazing Race” winners were as down-to-earth and lovely as you would want. That year, I also had the chance to talk to movie icon Pam Grier — the longest interview I’ve ever done, which had to be split into two separate Portraits — and the beautiful and kind Cory Wade Hindorff, a contestant on “America’s Next Top Model.”\nMore recently, I interviewed Jill Sobule, the original “I Kissed a Girl” singer. I was invited to see her show and brought along SisterSpace Executive Director Jo-Ann McIntyre, who in turn, booked Sobule as a headliner at SisterSpace the next summer. And I got to be Sobule’s roommate at the event!\nOver the years, I’ve learned from so many of the people I’ve interviewed. I learned all about the art of restoring classic paintings from Aella Diamantopoulos at the Pennsylvania Academy of Fine Arts. I’ve learned about the joys and pains of cooking from Chef Joy Parham (contestant on “Kitchen Nightmares” with Gordon Ramsay). Joys and pains, see what I did there?\nI’ve interviewed heads of large organizations like David DeVan of Opera Philadelphia and leaders like Klayton Fennell of Comcast. I’ve interviewed the UPS driver in the Gayborhood and a vet who does euthanasia house calls. I believe everyone has a story to tell.\nI’ve had fun with identical twins Gary and Ettore Mastroddi, who graced us with their style and generosity as owners of Ettore Salon for many years. Twin firefighters Jen and Marion Leary and even a triplet. I’m a little fascinated with them.\nOn occasion, I get to interview people more in the spotlight like our local queer icons Jade Starling, Sharon Katz, Miguel Martinez-Valle, Cory O’Niell Walker (aka the incredible Cookie Diorio), filmmaker Barbara Hammer, singer Clay Aiken, actor and playwright James Ijames, cartoonist Alison Bechdel, R&B singer Deborah Cox, actor Scott Evans, Indigo Girl Amy Ray and several of the “Queer Eye” bunch, most recently Jonathan Van Ness.\nOne of my favorite celeb interviewees was with dance music diva Crystal Waters. After her interview, I was invited to her performance at a Human Rights Campaign fundraiser. Before the show, I sent her a copy of the paper with her column and asked if I could come back after the show to say hello. Someone from her management told me to wait after the show and they would see. She wowed the crowd despite some technical issues and after the performance, I waited by the side, and waited and waited… until they started putting up the chairs. As I was about to leave, someone ran out and asked, “Are you Suzi?” I confirmed it and they escorted me to a room on the side of the hotel ballroom where she’d just performed. She apologized profusely and invited me to join her and her backup dancers. The hotel had set up the table with food and drinks. As she was during the interview, Waters was wonderfully candid and vulnerable. She was upset about the technical difficulties and thought she’d let people down. I assured her that we all loved it and that despite any small challenges, she brought it. We sat there drinking and chatting until about 3 a.m. talking about all manners of things. I hear she’s got a new album dropping next month so I hope she comes back to Philly to launch it!\nI’ve been able to enjoy so many things through this column. I went to my first Gay Rodeo to interview Ernie Bowers. Tawana Grayson invited me to see full-contact women’s football, and Larry Felzer invited me to my first Gay Night at the Phillies. The incomparable Henri David gave me a standing invitation to his fabulous Halloween Balls, and I’ve been able to witness the genius of dancer/choreographers Brian Sanders and Gunnar Montana and many of the PA Ballet corporations. I even got to watch “The Nutcracker” from the wings of the stage. It’s been an amazing journey these first 20 years.\nAmong the people I’ve interviewed are pole dancers, antique dealers, therapists, sky divers, scuba divers, marine biologists, barbers, reverends, pastors and priests. Archivists, architects, activists, artists, filmmakers, poets and photographers. Welders, writers, accountants, a rock climber, comedians, a veterinarian, flight attendants, firefighters, skaters, scientists, watchmakers, environmentalists, mechanics, mind readers, gorilla keepers and crime scene cleaners to name just a few of the over 1,000 folks I’ve profiled so far.\nSpecial thanks to people like Steve McMann, Zach Wilcha and Perry Monastero who have pulled out their figurative phone books when I’ve called desperately asking, “I’m trying to get hold of (fill in the blank), do you have a contact number?” Those fellas know everyone! Add AJ Hikes to that list. PR Guy extraordinaire Kory Aversa is another go-to person who has invited me over the years to experience new restaurants and meet restaurateurs, actors, vendors, etc. And thanks to Ram Krishnan who has always lent a hand to me and so many other members of the community. Some of those gone but not forgotten: Les Haverson, Tara Lessard, Dante Austin, Jeff Guaracino and Michael Hinson.\nI hope you’ve enjoyed this little jaunt down memory lane. Let’s do it again in 10 years!",
  "word_count": 2563,
  "scraped_at": "2026-02-14T14:16:02.981902"
}