{
  "article_id": "3064958c4d8f",
  "url": "https://www.buckys5thquarter.com/2023/11/30/23983490/ask-your-wisconsin-badgers-related-questions-luke-fickell-transfer-portal-braelon-allen-greg-gard",
  "title": "Badgers mailbag : What the latest with the transfer portal ? ",
  "date": "20231201T043000Z",
  "domain": "buckys5thquarter.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "We are back with the Wisconsin Badgers “Ask Me Anything” sessions with a ton of Badger-related questions floating at the moment.\nAMA: Ask your Badgers-related questions\nThere’s a ton going on the Badgers world across the board.\nThe Badgers football team is officially in offseason mode after finishing 7-5 with a win over the Minnesota Golden Gophers. Now, it’s time for transfer portal, bowl game, and recruiting questions over the next several weeks.\nMeanwhile, the Badgers basketball team is on a hot streak with three consecutive wins, but now faces No. 3 Marquette on Saturday in the first of a tough three-game road stretch. I spoke with guards Connor Essegian and Chucky Hepburn, as well as head coach Greg Gard on Thursday, and that content will be up on Friday.\nThe Badgers volleyball team is set to take on Jackson State in the first round of the NCAA Tournament on Thursday at 7:30 P.M. at the UW Field House.\nWhile the women’s hockey team is off on a bye week, the men’s hockey team will look to rebound from a 1-1 weekend against Alaska Anchorage with a series against Ohio State on Friday and Saturday.\nNonetheless, it’s a busy time in the Badgers world, which means there’s got to be questions!\nEvery single week, I’m looking to do an AMA session, where everyone can ask whatever questions they have about the Badgers in the comments, and I’ll answer each and every one over the next 24 hours.\nDrop your Badgers-related questions in the comments down below!",
  "word_count": 256,
  "scraped_at": "2026-02-14T13:10:35.274137"
}