{
  "article_id": "3073523b432d",
  "url": "https://thequietus.com/articles/32716-andrew-eldritch-sisters-of-mercy-interview-2009",
  "title": "The Quietus | Features | A Quietus Interview | Lop Off The Retro Heads : An Archive Interview With Andrew Eldritch",
  "date": "20230316T174500Z",
  "domain": "thequietus.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Andrew Eldritch in 2009. Photo via Wikimedia Commons\nIn April 2009 I flew to Budapest to interview the Sisters Of Mercy, the group’s founder and singer Andrew Eldritch having agreed to give me his first interview in ages – 12 years, in fact, according to Ben Christo, the Sisters guitarist who had put in my request to his boss.\nThe Sisters Of Mercy were playing a gig on a boat that night and, after watching the band – the line-up then being Eldritch, Christo, guitarist Chris Catalyst and laptop maestro Si Denbigh – I went backstage with them and got quite pissed. I later wrote, “Your correspondent is at a bar in Budapest with the members of a certain rock band, clustered around a group of shot glasses, waiting for the barman to apply a lighter to some lethally inflammable booze. ‘Don’t drop your glass,’ warns the barman. It’s a trial by fire (literally), which we’d better pass if we’re to impress the man who has agreed to give us his first interview since 1997. Whatever is in those shot glasses burns like rocket fuel – and as we’re fully intoxicated after too many post-gig sherries, we knock ours over. A sheet of blue fire instantly envelops the table: people dive for cover. In the background, chuckling malevolently into his drink, stands Andrew Eldritch, a shaven-headed cove who doesn’t say much at this point, letting his troops do most of the talking for him.”\nA bit of a laddish intro, really, but what the hell, it was a fun night. I was half expecting Eldritch to be a bit scary, as the profile would suggest, and while he wasn’t exactly chummy he was quite happy to have a quick chat, the actual interview being scheduled for the following morning. I remember asking him about a line in the song ‘Marian (Version)’ that had always bugged me and him giving me a thought-out answer, which I appreciated.\nThe next morning I met Eldritch in the lobby of the hotel where we were staying and, as the rest of the band were still asleep, it was just me and him for an hour or so. The interview took a while to warm up: he was a bit tired and evasive, perhaps remembering why he’d refused all interview requests for the last 12 years, but after we’d had coffee and he’d smoked a load of cigarettes the conversation picked up steam.\nAt this point we were about a year away from the 2010 general election, and it looked as if David Cameron was going to replace Gordon Brown as prime minister. Eldritch was annoyed about that, which made for some lively discussion. What follows is our two-hour conversation…\nLife in the Sisters Of Mercy looks pretty good from the outside. Is it?\nAndrew Eldritch: Yes, but if you’d asked me that two months ago when the tour started, I might have been a bit more enthusiastic. This is the tail end. You’re never gonna be as enthusiastic in the 95th minute as you were at the kickoff. You’re thinking, ‘Surely – surely! – the ref’s going to blow the whistle any moment’… but luckily we’re winning, so it’s not like we’re looking for the 96th minute. But I like being in the band. I’m not quite sure what my other options are.\nHave you ever wondered what else you’d be doing if you weren’t doing this?\nAE: In the early days I did, because there was obviously no prospect of me doing this for 25 years. I was probably headed for the BBC or the Foreign Office. I wasn’t very good at Chinese but I did have a linguistic bent, and I think I could have fitted in quite well with the effete gentlemen of the Foreign Office. Now of course, they’re effete men and women, but back then I think we ran the Empire on testosterone. A very effete kind of testosterone.\nEldritch, circa 1984. Photo by Barry Plummer\nIt seemed that your impasse with Warner was never going to end at one stage. When was it finally resolved?\nAE: The mid 90s, I can’t remember exactly when, off the top of my head. We certainly haven’t had any record company involvement – apart from just grief – since 1991, which is quite a long time now.\nHow did it finally get resolved?\nAE: If I didn’t get to make another record ever again, it really wasn’t going to bother me that much. We’ve been free of obligations and ties for some time now and we don’t need to make records.\nIs the SSV album ever coming out?\nAE: I wrote to them and said, ‘Do you actually intend putting that out?’ and they wouldn’t say. It’s out there, isn’t it?\nYou were bootlegged enormously. Did that bother you?\nAE: Warner did try to get us to sign up to one of their ‘Prince is being bootlegged so we must do something about it!’ campaigns, so I said, ‘Well, that’s all well and good. How about, now that you’ve waited years and years for the bootleggers to make shitloads of money, why don’t you take them to the cleaners and, once you’ve paid your costs, you can divvy it up between your artists that have been bootlegged?’ And they said, ‘Oh no, that’s not the way it works at all’. I’m not a great believer in conspiracy theories, but you have to wonder at the reasoning behind that scenario, don’t you?\nIs the band a wholly independent entity nowadays?\nAE: No, we still need agents occasionally, we need lawyers and accountants – so, apart from the record company, there is still the usual paraphernalia. We still need to get on with the trucking companies that the people who hire us like, and stuff.\nYou’re effectively the CEO of a corporation. Is the business stuff a pain?\nAE: It’s like being a football team. You have to wear boots. You’re not in the game to wear boots, but if you didn’t wear boots you’d be playing the game pretty badly.\nTouring without a drum kit must make things a lot simpler.\nAE: It’s certainly easier touring without a drummer. The laptop has one version of the Doktor; the other version is pretty much the size of a drum kit, but a lot heavier – but it does come without an idiot. When we’re not doing the laptop scenario, we use the computer and the actual hardware samplers.\nA lot of Sisters fans would like to hear some new music.\nAE: We keep playing it. I’ve started putting the lyrics on the net so that people aren’t just guessing when they sing along at gigs – and they do sing along at gigs.\nWill you ever record another album?\nAE: I don’t know that I really feel the need. We do kind of record stuff once in a while, but I’m not going to lock the lads in the studio for nine months, only to give everything away at the end of it. For two reasons: one probably does have to give everything away these days, and one would probably have to pay the guitar players – and there’s a bit of a dilemma there, isn’t there? I could just sit there for 18 months and play it all myself, but I’d rather not do that.\nYou don’t feel the need to give the fans something tangible?\nAE: No. I honestly don’t feel it as a need. I see it as something that would be quite nice to do, everything else permitting, and really there’s nothing standing in the way of it, except just getting round to it. And I quite like recording. But I really don’t feel it needs releasing. A lot of people find it difficult to understand, but I really don’t feel the need. I can’t tell you what’s missing there. I used to eat chocolate: I don’t do that anymore either! It ceased to be a need. I can see where it might help; I think promoters get more worked up about it than the fans, especially when you’re trying to sell the band as a going concern. Because some of them have got retro heads. They’re keen to know when the next album is coming out, and I can understand that more than I can from anybody else. In fact, I like to help by lopping off their retro heads. I can see where that might help, but then if you give them a new album they say, ‘Er… video?’ and then the whole circus begins again. Chris did something great for YouTube a while back for his other band, which was very, very funny. That’s probably going to have more impact for us than being on MTV.\nThe Sisters Of Mercy, circa 2006. Photo via Wikimedia Commons\nYou said in 1997 that it was impossible to connect with Thatcher’s children. Has anything changed in the interim?\nAE: I try not to sleep with them… was that the question? Not everybody is Thatcher’s children, but an awful lot of them are, and I make no attempt to make contact with them, frankly. I’m always rather astonished when I think I’ve spotted one in a crowd. You can usually spot them because they make their presence felt by being really boorish. At certain gigs – because we play a lot of countries, one after the other – we do a pretty good cross-section and you’re gonna get a few boorish people and I put them down as Thatcher’s children even if they happen to be Polish.\nAre we talking about thugs, or people who just don’t appreciate the music?\nAE: Well, I of course think they’re one and the same. The kind of people who feel the need to do bird whistles when you’re doing a quiet passage between every single beat, just to get themselves on YouTube. The kind of people who need to start shouting nonsense in a language that they know you don’t understand, three-quarters of an hour before you go on stage. The people that behave like their team’s just been either promoted or relegated – the minute the doors open.\nIsn’t all this just a sign of enthusiasm?\nAE: No, I think they’re just pleased to be the loudest idiot in the crowd. And they just happen to find themselves in a crowd that I don’t think they belong in. You can’t please everybody: there are people who come to the gig to hear the quiet songs, and some just to hear the loud songs. They make their feelings known in a different way now: I’ve been doing this long enough to know the difference. I have problems with people who only turn up so they can camera-phone the whole thing. I wouldn’t pay money for a ticket just to do that.\nIs it frustrating to be an educated man in an industry full of shallow people?\nAE: It’s a job. The reason I got pissed off with the record company was because they ceased to exploit me competently. Not because they ceased to exploit me! And I have my shallow moments…\nAre you still an anarcho-syndicalist?\nAE: I would be if I thought it was possible to get there from here. I think we’ll have to wait for a generation shift – to put 500 decent people on a spacecraft and let them breed for umpteen generations and then get them to colonise somewhere that doesn’t look like West Leeds. I’m all too aware of what Thatcher’s children look like and how they behave, because I live in Precinct 13, pretty much, and it’s a permanent Assault. That mixed with Night Of The Living Dead… except brains really aren’t what they’re after, I can tell you that.\nYou have property in the Mediterranean and in Leeds. Why do you continue to spend time in the UK, which as a country seems contradictory to many things you’ve said?\nAE: The power doesn’t go off every time it rains. The Mediterranean lifestyle is all very well, but it can be very hard to get anything done.\nAny thoughts on the state of British politics under Blair and Brown?\nAE: Well, I don’t buy reconstituted policies of any kind. The Lib Dems obviously couldn’t run a piss-up in a brewery, although on paper at least their last manifesto was much more in line with what I would go for, being Old Labour. I’m not looking forward to seeing Cameron as Prime Minister. The Tories are the same bunch of spivs that they were last time and they’re going to carry on exactly where they left off.\nDoes everyday life make an impact on you?\nAE: I’m a bit of a hermit but I’m not so rich that I live in a different world. The world is still pissing on my lawn and parking its tanks on it.\nWhat’s good about the modern world?\nAE: I do like the internet. I can’t imagine how we managed before it. That and Photoshop. Weeks and weeks messing around with Letraset,and sending things back to the typesetters 10 times before they got it right. Talking of which, I heard they re-released the albums a few years ago and they spelled the title of Vision Thing wrong on the spine. I would never have let that pass. I was told that there’s a version of ‘Neverland’ on there that never existed until they started fucking with the masters, which really annoys me. It was made up of outtakes and other bits and pieces.\nEldritch, circa 1984. Photo by Barry Plummer\nDid you approve the liner notes for those reissues?\nAE: I haven’t even seen the liner notes, so that’s a big no.\nI always wondered how factually accurate they were. Have you ever seen the Sisters’ Wikipedia entry?\nAE: Anyone who relies on Wikipedia is an idiot.\nWere you ever tempted to buy the masters from the record company and own them yourself?\nAE: They won’t even license them to anybody. They said, ‘So Capitol want your catalogue. That’s all well and good, but if we do that, everybody will want them!’ which says a lot about record companies. You can’t put out those records because everybody would leave.\nThe theory goes that bands still need record companies to market and distribute their stuff.\nAE: You do if you want to market and distribute your stuff with other people’s money. It’s nice to have, as long as you still get some money at the end of it. Putting out records these days seems for most people to be about getting famous, in which case yeah, why not? But if you actually want to make a living out of it, and have more than the shirt on your back in 10 years’ time, then it might be worth thinking about other ways. Yes, you need to make a name for yourself, and we’re lucky to already have a name, and we’ve been able to maintain it without too much trouble – but other people need to make a name for themselves in other ways, and obviously if they’re not inherently novel or fantastic they’re going to have their work cut out for them. I don’t know how record deals work these days, but if I was offered someone else’s money – and particularly if you didn’t have to pay it back – then what’s not to like? I guess… and if you can cut a deal that will release you in five years or something, what’s the downside?\nWhat was Patricia Morrison’s role on Floodland? No-one has really ever been sure.\nAE: I had expected her to be more involved than it turned out she was. Let’s leave it at that.\nYou interviewed David Bowie for Rolling Stone, didn’t you?\nAE: Yes – badly. The problem was, and I said this to Rolling Stone even before they sent me, that I just didn’t get the record, and the only thing that I was really gonna be able to ask him was – why? It was the Outside album.\nNonetheless, being offered the chance to interview Bowie must have been exciting.\nAE: Not really. I was much more interested by interviewing Leonard Cohen, which I also did for them. That really was fun because that man is just effortlessly better than you are at everything. Everything.\nWas he an influence?\nAE: Only in as much as he’s great. I hear more echoes of his phrasing in the current stuff than in the old stuff, funnily enough. There’s a very new song which we haven’t played yet, but I banged the words up on the website the other day, and there’s something about the way it scans that reminds me a lot more of Leonard Cohen than previous stuff. But I think all these people crop up – the Neil Youngness… there’s always been an awful lot of Steve Harley in there. A massive amount. The abuse of grammar, particularly.\nWas ‘I Was Wrong’ based on anybody in particular?\nAE: It’s that bittersweet bar ennui. No, it’s not a conversation about anybody in particular.\nDo you have fond memories of the tour you did with Public Enemy?\nAE: Yes, that was fun. Difficult though. The American part of the record company was very obstructive, and the city of Detroit wouldn’t let us play anywhere within the city limits – they said, ‘We see White people and Black people, and that’s a recipe for trouble.’ We were like, ‘Hold on, I think you’ve got this the wrong way round’. But they weren’t having it. Despite all the similar things that have happened in America since then, I think you still have to be brave to do something like that. The radio stations wouldn’t be behind it now, everything’s been demographic’ed and fractionalised. Everything’s gone little itty-bitty. I know people who only listen to happy hardcore.\nThere were two British music journalists, now both rather famous, who pissed you off in the 80s. What exactly did they do?\nAE: I can’t remember what they wrote, but they wouldn’t have mentioned me more than in passing – but between them they were quite influential in setting the agenda that reigned at those papers.\nDo you read the music press nowadays?\nAE: It’s been maybe 15, 20 years since I read a music magazine. Sorry. I read it on the net when I’m travelling. After doing this job for a few years, you don’t feed off music so much – because it’s like work. I do buy magazines about films.\nAre you still inspired to write new songs?\nAE: Yes, but I’ve written a lot of rubbish in the last year or so. There were a couple of things distracting me that were making me write rubbish, which I didn’t want to be writing about anyway. I think I’ve started to come out of the other side of that, though; the last few things I’ve written have been OK.\nHave you demoed the new songs?\nAE: That implies that there is some stage beyond that, which we’re not actually bothered about addressing. For ages now, pretty much half the live set is unreleased stuff, and generally it’s different unreleased stuff to last year’s unreleased stuff. All the unreleased songs get rotated in the live set. I don’t feel usurped by camera-phone footage, because it’s not the quality that we’d be releasing anyway, so it’s not treading on our toes. In fact we’ve been releasing the lyrics so they know what we’re singing.\nBut people still like to have the artefact in their hands.\nAE: Yeah I know, you keep driving towards some kind of release as the pinnacle of achievement and the proof of existence – and we just don’t really buy that. For us, that would be icing and it might help to convince promoter X to put on a gig, but it’s not gonna make any difference to promoters A, B and C. We’ve been selling pretty much the same amount of tickets since we stopped making records. Whatever the paradigm is, we do seem to be defeating it. I think it’s probably up to you to figure out how and why that is. The way we look at it is that a release would be nice as long as it didn’t break the bank, and it’s probably not going to make any money. It could lose us a lot, depending on how you make it. Right now, nothing is particularly broke, so we’re not actually looking to fix it.\nDoes this band have a lifespan?\nAE: I originally thought about five years, but that’s nearly 30 years ago. I probably have an inset date which is probably marching faster towards me than it is to the other guys, but I suspect the technology’s available to get round that.\nDoes touring lose its appeal after so many years?\nAE: You can have gastroenteritis three times in a month and it will beat the hell out of you – and it has beaten the hell out of me. I’m still pretty tired from it.\nDo you ever get nervous before shows?\nAE: Terrified. For no good reason. It’s because I’m not really an extrovert.\nDo you play the parts as they were recorded, or do you bring your own interpretation?\nAE: I get to pull rank when I want to, obviously, because I wrote half the songs – and that’s the rank that’s involved. And there are some parts that I arranged where I’m a stickler for having this way or that way, and other times I’m keener than anyone else to freshen it up and kick it about. They’re better at remembering the songs than me… although I can remember other people’s songs better.\nTalking of reworkings, the version of ‘Temple Of Love’ with Ofra Haza was amazing.\nAE: She did one take and we had to peel ourselves off the ceiling… and she did another, and we had to peel ourselves off the ceiling again. And so it went on. Awesome.\nIs there too much information in today’s age?\nAE: I live very quietly – as reclusively as I can – so I don’t get stalked. But if I did get stalked, I’m in a position where frankly I could move countries tomorrow. I have a worldview that enables me to do that. I moved to the Netherlands in two days once; I had a business meeting in London and was told, you’ve got to move somewhere and you’ve got till Tuesday. On Tuesday I had a flat in Amsterdam. Getting stalked is very annoying.\nIt’s happened, then?\nAE: Well, we used to have an office in London and everyone knew where it was, so it got annoying.\nYou’ve always been portrayed as a kind of dark lord of gloom. Was that just the media playing games, or did you encourage it?\nAE: I always tried to discourage it, but people hear what they expect to hear a lot of the time. I can be pretty moody and I’m not generally the most talkative person.\nDo you still support Manchester United?\nAE: Nope. I gave that up when they actually won something after 24 years of grief.\nDo you go to the footie often?\nAE: I haven’t been for about a week… I went to see Barcelona play Lyon. 5-2, after 4-1 at half time! Top match. Normally I will be standing in the terrace at St. Pauli, smoking heavily and singing loudly.\nDoes having two guitarists of a younger generation than you give the band extra energy?\nAE: Well, apart from the fact that they’re both completely addicted to text messaging… I don’t really notice that there is much of a generation difference. I think the only thing that would bother them about the generation gap is that I tend to march around the dressing-room without any clothes on.\nWe have a way of doing things at the venue which is pretty well-honed and combat-ready and professional. They’re up to speed. There’s a certain cycle of promoter interest: if you play Budapest today, you can’t come back next month: it needs to be at least nine months before he or she will say ‘Hmm, maybe’ and a year before they’ll say ‘Yes’. They know us well enough to know that we’re a reasonable bet. We tend to play America one year and Europe the next. Traditionally there has tended to be more respect for rock with a capital R over there: if you play a lick a certain way, you’ll get a nod, whereas in Europe it might be a certain lyrical twist that gets them going. Most of the in-depth analysis of the lyrics tends to take place on this side of the Channel: there’s more respect for intellectualism generally.\nAre you an intellectual band?\nAE: Well, compared to almost every other band, obviously – but that doesn’t make us Wittgenstein.\nYou called yourself a humanist once.\nAE: Well, with the name of the band, and given the proclivities of a certain section of the crowd, we often find ourselves co-opted into something that we’re not very comfortable with, namely a kind of generic, wishy-washy spiritualness, whatever they call it. I’ve got a dictionary with a whole chunk ripped out around the letter G. Every band gets misunderstood, I’m precious enough to be narked about it. Some of the words are rubbish, but some are very good, and I sweat blood over them. I’d rather people just listened to it than went out and form a very bad religion on the back of it. I’m not precious about it when I’m writing it, but I’m precious about it when I’ve written it. Not that I can’t change it here and there and sort of fuck with it. I don’t like being a poster boy for something I wholeheartedly disagree with – and frankly, for something that we did for one week back in the day when we were wearing this load of cack and we got co-opted into. On the other hand, it was probably responsible for a great deal of financial independence – and thanks, people, for that – but on the other hand it is a bit of an albatross. By and large we’re in a good place.\nDo you get much drinking done after the gig?\nAE: Enough. Generally we have three days on, one day off, but we try to have a day off once a month.\nEldritch circa 1984. Photo by Barry Plummer\nDo you get recognised in the street?\nAE: Yes, sometimes. I was dressed up like Lawrence of Arabia with the full headgear on and you could only see my eyes – and somebody walks up, pulls my leg and says, ‘Hello Andrew!’ How on earth?\nDo you go online to see what fans are saying about you?\nAE: I get the best and worst of it forwarded to me, but I think the most soul-destroying thing would be wallowing in it yourself. If Jesus ever came back, can you imagine him having to listen to all the stuff that has been done in his name?\nDid you shave your head because you were balding?\nAE: I shaved my head because I wanted to do it before I started balding. I could feel it coming on. It is low maintenance. Sometimes when I’m shaving I feel it and I’m still quite surprised. I think some of the fans got a bit upset about it, but they’re over it now. That’s why we’re not on Facebook: we’re perfectly capable of running a website, thank you very much, and we don’t cherish that mock-interaction. We don’t feed that feedback loop of noise. We’re not at pains to explain ourselves. I’m surprised by how little I’ve changed, when you think how much I should have changed in all that time.\nHow good a musician are you?\nAE: I’m a reasonably competent bass player and a reasonably incompetent guitar player. I was an awful drummer.\nAre you going to write an autobiography?\nAE: No. I can’t remember half of it. I don’t have the same sense of time as everyone else does. I’m not Dirk Bogarde or Spike Milligan or any of these people who have written beautiful memoirs.\nBut you must have some stories to tell?\nAE: The problem with stories is that they involve other people, and then you just get people into trouble. I can’t count the number of times I’ve been badmouthed in other people’s books for no good reason.\nWayne Hussey said he’d consider working with you again.\nAE: I don’t see the point in those kinds of reunion scenarios. They never seem to amount to anything more than one last payday.\nThank you for the interview.\nAE: Thank you for a painless experience.\nSome of this material was published in Classic Rock magazine in 2009",
  "word_count": 4840,
  "scraped_at": "2026-02-14T12:51:47.771941"
}