{
  "article_id": "308787730a68",
  "url": "https://www.rnz.co.nz/news/sport/502048/milestone-match-for-phoenix-favourite",
  "title": "Milestone match for Phoenix favourite",
  "date": "20231109T061500Z",
  "domain": "rnz.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Wellington Phoenix wing Kosta Barbarouses will bring up 300 A-League games against a familiar opposition on Friday.\nBarbarouses will mark the milestone against his former club the Melbourne Victory where he spent five seasons.\nThe 33-year-old said there would be no animosity among his old teammates.\n\"I've got really fond memories at Melbourne, I was at the club for five years and it was a very successful five years. It's funny how the stars have aligned to have it there and at a great stadium like AMI park and I got a lot of friends of family who will be there too so just good timing, I guess.\"\nBarbarouses said he believed he had plenty of football left in his career.\n\"It's not something you really target, you just try to give yourself the best chance to have a long career and I think I've done that and I'm pretty happy with the achievement I think more so it'll be something to look back at and be proud of but I'm still going and still have goals to achieve.\"\nThe Phoenix were unbeaten after three games while Melbourne shared the same record of two wins and a draw.\nMidfielder Bozhidar Kraev credited small details behind the scenes for his side's strong start to the season.\nKraev said he felt he had more freedom to express himself on and off the pitch.\n\"Really positive the first three games. I don't think it's only one particular reason but we have good communication between us and everybody is positive which plays a big role at the moment.\"\nHe said despite a strong start, the side was not looking ahead.\n\"It has to be like step by step. Game after game and not focused that much on May or April. Just week after week, month after month, slowly and when we get closer to the playoffs, then it's time to make reviews and analyse everything.\"\nMeanwhile, the Phoenix women play their first match at their new home ground this weekend, Jerry Collins Stadium.\nThe side had also had an impressive start to the season, picking up two wins and a loss and sit third on the table ahead of Sunday's match against Western United.\nPhoenix forward Emma Main said a more intimate ground will benefit the players.\n\"Being a bit of a smaller venue, it'll be awesome to really get the crowd going, we'll be able to they'll be closer to us and we'll be able to hear them more so the atmosphere will just be hopefully a bit more roaring.\"\nDefender Hailey Davidson concurred.\n\"One the main reasons we want to play there is to bring the community together and I think playing in a smaller stadium that packs up a little bit more would be super great energy for everyone.\"\nDavidson said she had high expectations of the club after making the move from the United States.\nShe said she anticipated strong competition following the success of the Football World Cup both in Aotearoa and across the Tasman.\nDavidson also lauded the style implemented by coach Paul Temple.\n\"It's very possession oriented and I think it works for everyone so I love it. It's super fun and it's fun to watch as I think as well, it gets better every week.\"\nMain said competition within the squad was fierce and no-one was taking their position for granted.\n\"It's been awesome to start the three games but I think the key is not to get complacent. There are a lot of great players, especially forwards and the team so there's always competition we're always fighting for our spots at training.\"\nMain said her side was full of confidence heading into Sunday's clash with Western United in Porirua.\n\"We have had a really good start to the season and heading into the Western United game, we're pretty confident that we're starting to really gel together and get the style of football that we want to, but there's lots to work on.\"",
  "word_count": 667,
  "scraped_at": "2026-02-14T12:40:41.109195"
}