{
  "article_id": "30afaaaabe0b",
  "url": "https://www.paradisepost.com/2024/04/28/the-cardinal-rule/",
  "title": "The Cardinal rule | Chico Sports Hall of Fame",
  "date": "20240428T140000Z",
  "domain": "paradisepost.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "CORNING — It was “Friday Night Lights” years before anyone had heard of the book or movie.\nBut instead of Odessa, Texas, the lights of the high school football world were shining most brightly on the small town of Corning.\nCorning owned the high school football world in the 1980s, building a legacy that no school in the state had accomplished before. Under the direction of coach Gary Burton, the Cardinals won an unprecedented seven consecutive North Section AAA championships — a record eventually topped only by De La Salle, the football-factory private school in Concord.\nDuring that streak (1982-88), Corning went 73-11 against a schedule that featured far more big schools than patsies. One example: The Cardinals faced Pleasant Valley six times in the 1980s and lost just once. Some of those games weren’t close; Corning won the 1983 meeting 45-6.\nJ Howell, a history teacher at Pleasant Valley who played on the 1982-83 Cardinal teams, looks back on those years with a sense of amazement.\n“It’s almost like a different world,” Howell said. “When I tell people my senior year we (Corning) beat Pleasant Valley 45-6, they look at me like I’m lying or crazy.”\nIf that seems implausible today, well, it is — which makes that era all the more remarkable.\nBut here’s the capper as we begin the Gary Burton story: Football wasn’t necessarily his most successful sport as a coach. His track and field program dominated the Westside League for most of a 30-year run that began shortly after he first came to Corning in 1961, and helped launch the careers of some of the biggest names in north state sports history.\nBurton’s three decades of coaching excellence — along with his status as a Chico State Sports Hall of Famer in both football and track — made him an easy choice for the Chico Sports Hall of Fame Class of 2024. He’ll be honored at the Enterprise-Record’s 49th annual Chico Sports Hall of Fame and Senior Athletes Banquet at the Elks Lodge on May 21.\nThe tradition\nTo fully understand what Burton’s legacy means in Corning, it’s first important to know Corning and its people. The city had enjoyed a good amount of football success since the 1955 arrival of coach Tag McFadden, who won 129 games in 22 seasons. It was a working-class-community that produced more than its share of small-statured tough guys; Corning never had the biggest team, but seldom faced a team that played with more emotion or intensity.\nMcFadden retired at the end of the 1976 season. Burton, who had coached the junior varsity team since 1962, had a tough act to follow, but — over the next 15 years — he left an act that was impossible to follow.\nHe modestly deflects most of the credit to Corning itself.\n“So much of what went on in the community made the program, and I had no control of it,” he said. “We had a guy named Dick Collins who ran the Daily Observer. The front page was the sports page. We had so much publicity, the community and kids could not know anything but Corning High School sports.\n“It was just a matter of being in the right place at the right time.”\nLessons from Chico State\nLong before Burton came to Corning, he was soaking up a lot of knowledge in another “right place” — Chico State. The athletic department at the time was filled with some of the biggest names in Chico sports history, including George Maderos (Burton’s football coach as a senior) and Art Acker. Both were inducted into the Chico Sports Hall of Fame in 1973.\n“Probably the guy who had the most influence on me was Art Acker,” Burton said. “He said ‘The thing you’ve got to do with kids is you’ve got to be honest with them. No matter how much you discipline them, as long as it’s fair and honest, they’ll accept it. But when you start going down that gray area, look out.”\nAs anyone who ever played for Burton could attest, there wasn’t much “gray area” in his coaching style.\n“I remember how difficult our practices were. Our practices were harder than the games,” Howell said. “I remember him talking a lot about playing for your school, your community, and something bigger than yourself. There was a lot of pride. He knew how to get the most out of his players.”\nDiscipline comes to Corning\nBurton, who grew up in Vacaville and attended East Contra Costa College (now Diablo Valley) before transferring to Chico State, was coerced into coming to Corning by E.L. “Bud” Gott, a newly hired principal who had been Burton’s high school football coach and physical education teacher at Vacaville.\n“I was all set to teach at Orland. I’d signed the contract,” Burton recalled. “About three weeks later Bud called and said ‘I’m going to Corning, do you want to go?’ I said no.”\nBut Gott persisted and Burton became a Cardinal along with Don Lewis, another educator from Vacaville. Together, that trio made some immediate and long-lasting changes, putting discipline at the top of the list.\n“There is no question that Bud, Don and Gary changed the culture at Corning High School and very much for the good,” said Don Minto, Burton’s longtime assistant coach. “Corning was the number one school to go to. When student teachers and substitutes would come, they would say ‘this is utopia’ because of the discipline and how it was run. What those three established created that utopia.”\nGetting things on track\nIt was anything but a sports utopia upon Burton’s arrival as a physical education teacher in 1961. He said the basketball team had a 47-game losing streak, and only “six or seven kids” were out for the track team.\nWhile Burton’s junior varsity football team had more than its share of success, going 91-40-7 with eight WSL titles, his track teams were taking Corning athletics to new levels.\nBeginning with their first WSL track title in 1967, the Cardinals won the league track title 16 times in a 25-year span, according to Kevin Askeland, a longtime north state sportswriter and educator. The Cardinals also won the Division 2 section title three years in a row from 1980-82.\nBurton credits much of that success to one of many lessons he learned from Gott: “At Vacaville, we had a lot of kids out. We’ll get ’em by the force of numbers.”\nBut those who competed for him said it was much more than a numbers game.\nStover, and the shot\nProbably the most famous Corning High alumni of them all is Jeff Stover, who played eight seasons on the defensive line for the San Francisco 49ers in the 1980s and won a pair of Super Bowl rings. Before making that roster in 1982 as an undrafted rookie who had never played college football, Stover was among the top shot putters in the nation. He said Burton deserves a lot of the credit.\n“He was somebody you really wanted to compete for, and do better, and prove what you can do,” Stover said. “He was a really good technician who helped me learn about the shot and the technique for throwing the shot.”\nStover put that technique to use by throwing the shot 66-10 1/4 as a high school senior in 1976 — the second-best mark in the nation — and went on to a decorated track career at the University of Oregon, where he ended up with a personal best of 68-4 1/2. He was third in the NCAA finals in 1979 and qualified for the Olympic trials in 1980, only to have that dream dashed by U.S. President Jimmy Carter’s decision to boycott the Moscow Olympics.\nNonetheless, for a man who eventually had Bill Walsh as a head coach, Stover has no shortage of praise for Burton.\n“He pushed me,” Stover said, “and he brought out the best in me.”\nCarrying the torch\nWhile Burton has had dozens of athletes go on to play in college and/or become coaches, it’s fitting that one of his proteges went on to build a resume that probably eclipses even his own.\nGary Towne, a member of the Corning High Class of 1985, took over Chico State’s cross country program in 1997 and quickly established it as one of the top in the country. Through 26 seasons of coaching both the men’s and women’s teams, he has been named California Collegiate Athletic Association Coach of the Year 36 times, guiding the men to 21 consecutive conference championships and the women to 17.\nHe says none of it may have happened without Burton’s influence.\n“I might not be doing what I’m doing right now if not for Gary Burton,” Towne said. “I was a scrawny little 98-pound freshman and getting positive feedback from him — like ‘you can do this’ — was really influential and made me feel better about myself. He brought out the best in me.\n“Those were great days, with a really special vibe. The pride that we had as students and athletes at Corning High School, I just carried that to Shasta and Chico State. It all started at Corning.”\nA grip on success\nCorning’s track team was on a roll in the early 1980s while the football team, which won the WSL in both 1980 and 1981, was still trying to find its stride in terms of postseason success. That’s right around the time Burton approached Minto with an idea.\n“Gary said ‘You have a wrestling background. Why don’t you take these linemen in the offseason and keep them in shape?” Minto recalled. And with that, the Corning wrestling program was born — a program that basically paralleled the success of the football and track programs for much of the decade.\nWith the wrestling team keeping linemen in top shape all year, Corning began its historic football run in 1982. The Cardinals went 10-2 that year, beating a tough Gridley team 17-6 for their first Northern Section title — a title no one could have seen coming just two years earlier.\n“Two years ago this senior class went 0-10 as a junior varsity team,” Burton said after that game. “I just said ‘thanks a million’ to those seniors for an outstanding effort.”\nAt the time, it was considered to be the biggest victory in the program’s history. The following September, though, the Cardinals faced a new challenge in what some people still remember as the most eagerly anticipated game of them all.\nA one-sided rivalry\nCorning and Red Bluff high schools sit barely 20 miles apart. Both schools had a long history of football success, but for some reason hadn’t played each other since 1952. So when the first “Tehama County Shootout” was scheduled for September 1983, it was the talk of the community.\nEven though Red Bluff had three times Corning’s enrollment, and was the defending 4A large schools section champion, Burton had a good feeling about it. “I thought we could get to them if the game ever took place,” he recalled.\nHe probably had no idea just how badly the Cardinals would “get to them” through the years.\nCorning, an underdog against that larger Spartan team, won the first meeting 16-8. The next year, the Cardinals won 8-7. The next three seasons the scores were 31-12, 20-0 and 37-0. At one point during that stretch, when asked about the rivalry, Red Bluff coach Bill Jacobs said “How can it be a ‘shootout’ when they’ve got all the weapons?”\nBurton faced Red Bluff nine times as a coach. The Cardinals won them all.\nThe long run\nFrom there, the championships kept coming. Corning went 11-1 and 9-3 and won section titles again in 1983-84, then posted a perfect 12-0 record in 1985, a season that saw Burton earn Cal Hi Sports Coach of the Year honors. Three years later, another 12-0 season finished the seven-year streak. Burton coached three more seasons, going a combined 23-11 and adding another pair of WSL titles before calling it a career.\nWith a final record of 126-43-2, and 10 WSL championships in addition to the seven section titles, it’s understandable that Burton has a hard time picking any game or team as a favorite. But he did say one opponent definitely left its mark.\n“For about five or six years in a row, Denny Helms at Paradise, he coached football a lot like we did — ‘tighten up your chin strap and go after it,’” Burton recalled. “Every year when we played Paradise, win or lose, you were more concerned with ‘how many players did I lose?’”\nHe also remembered a Corning team that didn’t win it all: his first varsity team in 1977. “Skill-wise I think that’s the best football team I ever coached,” Burton recalled. That team went 9-2 but fell just short in the section championship game against Anderson, losing 10-7 on a late field goal.\nUltimately, those tough losses were few and far between. Corning didn’t lose another section title game until Gridley finally snapped the streak in 1989.\n‘Spokes in the wheel’\nThirty-three years after his last game as coach, Burton didn’t hesitate when asked what made the era so successful.\n“This whole program — it isn’t me. It’s Bud Gott. It’s Don Lewis. These are the guys who made everything happen,” Burton said.\n“We incorporated a lot of things. We incorporated the track around the football program, incorporated the wrestling, got all the linemen to wrestle every year and kept it going. There were a lot of spokes in that wheel.\n“If I was there by myself it would have never happened.”\nBut happen it did, and those lights in Corning never shined brighter.",
  "word_count": 2297,
  "scraped_at": "2026-02-14T12:41:54.205395"
}