{
  "article_id": "30c2f787003d",
  "url": "https://metro.co.uk/2023/08/26/spain-womens-coaching-staff-resign-amid-luis-rubiales-scandal-but-manager-stays-on-19401020/",
  "title": "Spain Women coaching staff resign amid Luis Rubiales scandal but manager stays on | Football",
  "date": "20230826T171500Z",
  "domain": "metro.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The entire coaching staff for the Spanish Women’s football team – except manager Jorge Vilda – have resigned in protest against Luis Rubiales.\nRubiales, the president of the Spanish Football Federation, has refused to resign from his position after he kissed player Jenni Hermoso on the lips without consent during Spain’s World Cup celebrations.\nIn a defiant press conference on Friday, he instead claimed that he is the victim of ‘social murder’ and ‘false feminism’ following his conduct during the final last Sunday.\nThe 46-year-old has now been suspended by FIFA and ordered to refrain from contacting Hermoso.\nVilda and his coaching staff were in attendance at the aforementioned press conference, with the manager notably one of many to stand up and applaud Rublias when he said five times that he would not resign.\nBut there were reports that his coaching staff were unhappy at being forced to attend and now all 11 members of Vilda’s team have announced they have resigned from their post.\n‘As a result of the events that occurred after the final of the Women’s Soccer World Cup, part of the Women’s Soccer Team wants to make its position public,’ their statement read.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘The undersigned express their firmest and most emphatic condemnation of the conduct shown by the president of the Spanish Football Federation, Luis Manuel Rubiales Béjar, with the player of the National Women’s Soccer Team, Jennifer Hermoso.\n‘After the Extraordinary General Assembly of the Royal Spanish Football Federation, which took place on August 25, 2023, in which the president of the RFEF did not present his resignation and in which he offered a story that does not reflect in any way any of the feelings of the aforementioned player, who has expressly stated that she felt “victim of aggression”, this part of the Technical Staff supports the player Jennifer Hermoso, endorsing the version offered by her.\n‘Adding the inconvenience of having to necessarily attend the aforementioned assembly on August 25, in which, in addition, there was a particularly hurtful event for this coaching staff, since several of the female members of the coaching staff were forced to wear in the front row, exposing their image and trying to make society and players understand.\n‘For all these reasons, the undersigned, in light of the unacceptable attitudes and statements made by the top leader of the RFEF, have made the decision to place their positions at the disposal of the RFEF.\n‘This part of the Technical Team shows its support for the statement published by the players of the Women’s National Soccer Team, in reference to said actions and statements made by the president of the RFEF, and more specifically to the public statements made by the player Jenni Hermoso.\n‘The undersigned want to end this statement by accepting the part of responsibility that falls to us regarding the restructuring and professionalisation of the Women’s Team, a task for which we have always worked with the greatest motivation and professionalism.’\nMore Trending\nThe letter has been signed by coaching staff members Javier Lerga, Eugenio Gonzalo, Blanca Romero, Carlos Sanchez, Ruben Jimenez, Sonia Bermudez, Javier Velazquez, Javier Egido, Ander Ruiz, Elena Fernandez and Montse Tome.\nOn Friday evening, 56 Spanish players, including the entirety of the World Cup winning side announced that they would not play for their country again until Rubiales was gone.\nTheir statement received widespread support, not least from England’s Lionesses who, in a joint-statement of their own said: ‘Abuse is abuse and we have all seen the truth.’\nMORE: Andreas Pereira goal sees Arsenal set unwanted Premier League record\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.",
  "word_count": 671,
  "scraped_at": "2026-02-14T12:16:04.874070"
}