{
  "article_id": "30c732ab5e0c",
  "url": "https://www.newsnow.co.uk/h/UK/Northern+Ireland/Larne",
  "title": "Larne News | Larne Latest News",
  "date": "20241104T220000Z",
  "domain": "newsnow.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "About our Larne news\nLatest news on Larne, Northern Ireland's key port town, covering ferry services, local council updates, community events, and developments in County Antrim.\nWith a population of approximately 19,000, Larne serves as one of Northern Ireland's principal seaports, handling over 1 million passengers and 750,000 freight units annually through its vital ferry routes to Scotland. The town, situated in Mid and East Antrim Borough Council area, plays a crucial role in Northern Ireland's maritime trade and serves as a significant gateway between Northern Ireland and Great Britain.\nRecent developments in Larne focus on port infrastructure improvements and the impact of post-Brexit trading arrangements on ferry operations and customs procedures. The port continues to adapt to new regulations while maintaining its position as a key trading hub. Local authorities are also advancing initiatives to revitalise the town centre and enhance tourism opportunities along the stunning Antrim Coast Road.\nBeyond its maritime significance, Larne maintains a strong community spirit through various local events and activities, including the annual Larne Festival of Light and regular performances at the Larne Market Yard. The town's sports scene thrives through Larne Football Club, which has seen significant investment and development in recent years, bringing renewed enthusiasm to local supporters.\nLarne's history dates back to medieval times, with the area's strategic importance recognised by Norman settlers who built Olderfleet Castle, whose ruins still stand at the harbour entrance. The town's modern development was shaped by its role as a port, particularly during the Industrial Revolution when it became a crucial link for Scottish immigrants and trade.\nOur NewsNow feed delivers essential updates on Larne's port operations, local government initiatives, community developments, and sporting achievements. From infrastructure projects to cultural events, our comprehensive coverage keeps residents and those interested in this important Northern Irish port town fully informed about all significant developments.",
  "word_count": 307,
  "scraped_at": "2026-02-14T12:10:30.788193"
}