{
  "article_id": "30cb11267ce2",
  "url": "https://metro.co.uk/2025/09/20/former-liverpool-womens-manager-matt-beard-dies-aged-47-24219458/",
  "title": "Former Liverpool Women manager Matt Beard dies aged 47",
  "date": "20250920T233000Z",
  "domain": "metro.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Former Liverpool Women’s manager Matt Beard has died aged 47.\nBeard won two consecutive Women’s Super League titles in 2013 and 2014 during his first spell with Liverpool.\nIn his second managerial stint with the club, Beard guided Liverpool to promotion from the Women’s Championship back to the WSL in 2022.\nBeard’s wife, Debbie, wrote on social media on Saturday evening: ‘It is with great sadness that our beautiful Matthew Beard has passed away tonight at 7.28pm.\n‘He is a loving husband, father, son, brother and uncle. He was the most amazing, caring man who was loved by anyone who had the pleasure to meet him.\n‘All of our family kindly ask for time to grieve in peace at his loss. We will love you forever, you absolute legend.’\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nBeard as sacked at the end of February after four years in his second spell with Liverpool. He joined Burnley in June but resigned his position just two months later.\nLiverpool said in a statement: ‘Liverpool Football Club is deeply shocked and saddened by the sudden passing of former LFC Women manager Matt Beard.\n‘The thoughts of everyone at the club are with Matt’s family and friends at this devastating time.\n‘Matt was not only an extremely committed and successful manager, he was also a person of real integrity and warmth, who will always be remembered with genuine fondness by everyone he worked with at the club.’\nBeard also had a three-year spell as manager of Chelsea Women’s.\n‘Matt was someone who helped shape Chelsea Women during his three years in charge between 2009 and 2012, laying much of the foundations prior to Emma Hayes’ arrival,’ Chelsea’s tribute read.\n‘On the pitch, Matt was at the helm as we moved home to Staines Town’s Wheatsheaf Park, entered the new Women’s Super League and guided us to a first Women’s FA Cup final in 2012.\n‘But his impact was equally – if not more so – felt off the pitch by his players and everyone involved with Chelsea Women.\nMore Trending\n‘Players and staff alike speak of a man who wasn’t just your manager, he was your friend. He was a caring and loving person who always made time for people.’\nThe WSL said: “Everyone at WSL Football extends its deepest sympathies to the family, friends and loved ones of Matt Beard following news of his passing.\n‘Matt played an instrumental role in the growth of women’s football and will be missed by everyone associated with the game.’\nThe FA said: ‘We’re deeply saddened to learn of the passing of Matt Beard. Matt was a key figure in growing the women’s game and will be missed by all. Our thoughts go out to his family and friends during this difficult time.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Michael Owen says ‘incredible’ £34m Liverpool star is now worth over £100m\nMORE: Liverpool 2-1 Everton: Hugo Ekitike on target again as Reds seal derby victory\nMORE: Liverpool vs Everton: Predicted lineup today and confirmed team news",
  "word_count": 572,
  "scraped_at": "2026-02-14T12:43:38.820116"
}