{
  "article_id": "3115192a101e",
  "url": "https://www.wgbh.org/news/local/2025-09-05/gbh-daily-this-years-covid-boosters",
  "title": "2025 - 26 COVID booster shots now available in Massachusetts pharmacies",
  "date": "20250905T141500Z",
  "domain": "wgbh.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This is a web edition of GBH Daily, a weekday newsletter bringing you local stories you can trust so you can stay informed without feeling overwhelmed.\n⛅Clouds will clear, with highs in the 80s. Sunset is at 7:10 p.m.\nThe Trump administration filed a lawsuit against Boston yesterday (along with similar cases in Los Angeles, New York City, Denver and Rochester, New York) over the city’s policy of not allowing its police officers to collaborate with federal immigration agents unless they have a criminal warrant.\n“They explicitly enforce policies designed to undermine law enforcement and protect illegal aliens from justice,” Attorney General Pamela Bondi said in a statement.\nBoston Mayor Michelle Wu, who is named in the lawsuit alongside Police Commissioner Michael Cox, said “this administration is intent on attacking our community to advance their own authoritarian agenda” and that Boston will “vigorously defend our laws and the constitutional rights of cities.”\nSo what does the law say about local police officers cooperating with immigration agents? Boston University Law Prof. Sarah Sherman-Stokes told GBH’s Diane Adame that “Jurisdictions, cities, and municipalities have the constitutional right to limit their involvement in enforcing immigration law,” which is what Boston has done.\nSherman-Stokes said the lawsuit was another example of unconstitutional behavior on the part of the Trump administration.\n“Their desire is to cause chaos and force compliance under threat. And that seems to be exactly what they’re trying to do here, right? To coerce the city of Boston, to give up on the Trust Act,” she said.\nWe will keep following this lawsuit it develops.\nFour Things to Know\n1. A Clinton resident who came to the U.S. from Brazil at age 9 and has a valid immigration authorization under the Deferred Action for Childhood Arrivals (DACA) program was detained by federal immigration agents in May — and released three months later. A Department of Homeland Security official said he was detained because of previous arrests on charges of domestic assault and driving without a license.\nWagner Gomes Do Nascimento, 30, said it was hard being away from his twin daughters, who are 12 and have a rare genetic condition called Coffin-Lowry syndrome. “They have a lot of medical issues, which were only making it harder by having me detained, because everything their mom would have to do,” he told GBH News. “It was a very hard few months for all of us.”\n2. After a closed-door meeting with six survivors of Jeffrey Epstein’s abuse, Rep. Ayanna Pressley said she will keep pushing government officials to release additional files from the case and for the survivors to get a chance to publicly testify before Congress.\n“The public deserves that full transparency,” Pressley told GBH’s Arun Rath. “The survivors deserve to be heard. And we have to leverage every tool available to us.” You can hear her full account of the meeting here.\n3. A day after a federal judge in Boston ruled that the Trump administration was wrong to take away $2.6 billion in research funding to Harvard University, professors there told GBH News they were relieved Harvard did not strike a deal with the administration, as other universities did.\n“It affirms that the government cannot extort money from private institutions for political reasons,” Government professor Ryan Enos said. “That’s important to everybody, not just Harvard.”\n4. Filipa Patao, the first head coach of Boston Legacy FC, the city’s new National Women’s Soccer League team, said she understands the awesome responsibility of her new role.\n“I know the ambition is very, very high. And I know the responsibility to have a new project in my hands, in our hands. But I know that everybody here is capable to do this job,” Patao said at her first official press conference. She previously coached the Benfica football team in Portugal, which won five straight women’s league titles under her leadership.\nMass. moving to protect vaccine access as federal policy shifts\nPeople in Massachusetts looking for an updated COVID vaccine have been in a holding pattern this week: the CDC has approved a new shot targeting the LP.8.1 strain of the virus, but with some limitations on who is eligible to receive it. Just this week, people looking to their local pharmacies for an appointment were told none were available because of restrictions — state regulations didn’t allow pharmacists to administer these specific shots.\nBut yesterday that changed: the state’s Department of Public Health issued an order saying pharmacists can administer 2025-26 COVID booster shots to anyone ages 5 and up, with no other medical limitations. Parents or guardians of children under the age of 5 who want to vaccinate them should consult their pediatricians. Online vaccine portals at CVS and Walgreen’s should be open in the coming days.\n“No matter what happens with [Health and Human Services Secretary] Robert Kennedy and the federal government, we are going to make sure vaccines remain available in Massachusetts,” Gov. Maura Healey said in a statement. “We are working to ensure that all pharmacies make the vaccine available as soon as possible.”\nAlso: the state will require insurance companies here to cover the cost of COVID vaccines.\n“Vaccines are the greatest public health advance of our time,” said Dr. Robbie Goldstein, the state’s public health commissioner. “They prevent illness, they prevent suffering, they prevent death. To restrict access to vaccines is reckless. To play politics with vaccines is dangerous. And our state will not bend to the partisan decisions made in Washington that are putting our communities at risk.”\nRead Katie Lannan’s full story here.\nDig deeper:\n-Senators from both parties grilled RFK Jr. on vaccines and more\n-Boston doctor urges parents not to let COVID confusion derail routine childhood vaccines\n-Calling the shots: As vaccine rates decline, Mass. looks beyond feds to improve uptake\n-The state’s top public health official weighs in on turmoil at the CDC",
  "word_count": 980,
  "scraped_at": "2026-02-14T14:18:31.522334"
}