{
  "article_id": "31260e8212e7",
  "url": "https://www.nzherald.co.nz/the-listener/opinion/jane-clifton-octopus-prophets-to-robo-politicians-the-uks-absurd-election/S73ICP6SXZGS7N6NWFJYMZZTO4/",
  "title": "Jane Clifton : Octopus prophets to robo - politicians - the united kingdom absurd election",
  "date": "20240627T013000Z",
  "domain": "nzherald.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Opinion: It’s well known that politics and football can send people a bit bonkers, but in Britain and Europe, the symptoms are increasingly surreal.\nPsychic animals, cuddle power, a non-corporeal candidate and on-purpose daily pratfalls are among the features of elections and Euro football punditry.\nAmong the European Union’s newly elected MEPs is a Cypriot, whose crowning achievement is getting billionaire Elon Musk to succumb to a hug.\nThe ebullient Fidias Panayiotou, 24, has been elected seemingly on the strength of the 2.6 million YouTube followers of his serial celebrity cuddling. He has triumphed without a single manifesto pledge, saying he just thought he’d have a go.\nThere are arguably flimsier cases being put to the electorate. A Brighton candidate in Britain’s general election is a chatbot in a smart blazer called AI Steve, who vows his human generator will be his proxy in Westminster if his cyber self is elected.\nWhatever the pundits make of an online-only contender, weightier matters preoccupy a Scottish zoo’s troupe of lemurs – fluffy Madagascan primates – along with a German-resident tapir called Theo. They are part of the oracular menagerie recruited to pick results for Euro football games.\nWaterfowl, a gibbon, an otter and various cephalopods are also being consulted, in the hallowed Delphic tradition of German aquarium octopus Paul, who, until his 2010 death, correctly predicted eight Fifa World Cup results by selecting designated mussels from his tucker bowl.\nWhile the British election polls suggest the dogs in the street know Labour will supplant the Conservatives on July 4, there’s been a rash of candidate withdrawals for reasons so unexpectedly stupid as to portend tough competition in this year’s Darwin Awards.\nTory hopeful Adam Gregg was dropped after it emerged he’d once hosted regular raunchy nightclub events for children aged 13-17. Online coverage included girls in school uniform displaying lewd slogans on their chests during his formative entrepreneurial bashes. He apologised “if” this now seemed “inappropriate”.\nAmong Green candidates dropped after posting and endorsing antisemitic messages online, one – who had shared a comment about Zionists eating Palestinians’ flesh and drinking their blood – said, “Once I was made aware of connotations of anti-semitism in some of the posts I removed them immediately.”\nMore Green faces reddened at news that deputy leader Zack Polanski, a hypnotherapist, had once tutored clients in search of breast enlargement, saying they could increase their size with mind power alone.\nAt least Reform UK candidate Ian Gribbin remains unabashed. He wrote that women were spongers, because: “Men pay 80% of tax. Women take out 80% of expenditures.\n“Square that inequality first by depriving women of healthcare until their life expectancies are the same as men. Fair’s fair.”\nThe party said the remarks, from 2022, were dredged up via “offence archaeology” and had been “merely tongue-in-cheek”, as had his comments that Britain should have accepted Hitler’s offer of neutrality in World War II.\nLiberal Democrat leader Ed Davey is campaigning on water cleanliness, chiefly by dunking himself in rivers and streams. Barely a day passes without his Mr Bean-style tumbles from paddleboards, canoes and water-park rides, the theory being his goofy gameness will get him a daily photo spread.\nAlso impervious to embarrassment are former Labour MPs Keith Vaz and Claudia Webbe, standing again despite being respectively binned after a cocaine-and-prostitutes kerfuffle and 80 hours of community service for harassment.\nPutting the tin lid on it, perennial novelty candidate Count Binface is standing against Rishi Sunak in Richmond. Given the near inevitably of Sunak conceding defeat to Labour, the count’s perforated metal rubbish bin “head” will feature in much of the night’s historic footage. If he pulls off a cuddle, the EU could be his oyster.",
  "word_count": 618,
  "scraped_at": "2026-02-14T12:32:20.275747"
}