{
  "article_id": "315f247dfe9f",
  "url": "https://autzenzoo.com/a-pair-of-big-ten-titles-fly-home-with-the-oregon-ducks-from-indoor-championships-01jn6y52h1xa",
  "title": "A pair of Big Ten titles fly home with the Oregon Ducks from indoor championships",
  "date": "20250302T141500Z",
  "domain": "autzenzoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Oregon Ducks officially own the Big Ten, kind of. Securing the third and fourth conference titles of the athletic season, the Oregon men's and women's track and field team swept the Big Ten Indoor Championships.\nFrom Connor Burns in the 5000-meter foot race to Aaliyah McCormick in the 60-meter hurdles to Matthew Erickson in the 800-meter race, the Ducks had a strong showing and (at the very least) podiumed in almost every single event.\nThe Oregon women secure 131 points, defeating the second place Illinois team by 49 points, and the Oregon men secured 106 points to defeat the USC Trojans by 6.5 points.\nA few upsets held the Ducks back from a perfect showing, such as Jaida Ross, who competed in the 2024 Paris Olympics, was defeated by Nebraska's Axelina Johansson in the women's shot put and Jadyn Mays lost to USC's Dajaz Defrand in the 60-meter dash as well as the 200 meters.\nEarlier this season, Oregon secured the Big Ten titles in women's cross country and football, the first two conference championship victories the Ducks secured in their new homebase.\nNow, with the indoor titles in their back pocket and the outdoor season flying into focus, the Ducks look to repeat their sweep as they try to earn a couple of more conference titles.\nFirst, Oregon will head to Virginia Beach for the NCAA Indoor Championships on March 14 and 15 before the team kicks off its outdoor track and field season just a week later at the Oregon Preview on March 21.",
  "word_count": 257,
  "scraped_at": "2026-02-14T13:40:59.803342"
}