{
  "article_id": "31907991b49e",
  "url": "https://www.thepinknews.com/2023/04/04/lionesses-new-kit-blue-shorts-period/",
  "title": "New England women kit adds blue shorts over period concerns",
  "date": "20230404T160000Z",
  "domain": "thepinknews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "New England women’s football kit makes major change over players’ period concerns\nEngland’s Lionesses will wear blue shorts instead of white at the 2023 FIFA Women’s World Cup following player’s concerns over periods – and football fans are all for it.\nThe Lionesses will showcase their new kit, inspired by Wembley Stadium, for the first time during a friendly game against Brazil on 6 April. They will then wear the new designs at the Women’s World Cup, which is being held in Australia and New Zealand from 20 July until 20 August.\nFeaturing blue shorts with the traditional white shirt with three lions crests and blue detailing, the home kit is similar to the team’s former uniform, while the away kit is all blue.\nThe uniform colour change follows players, including Beth Mead and Georgia Stanway, flagging issues they faced wearing white shorts during the 2022 European Championships, according to Sky News.\nLast July, Beth Mead shared that some of the players had expressed their worries to kit manufacturer, Nike.\n“It is very nice to have an all-white kit but sometimes it’s not practical when it’s the time of the month,” she said at the time.\nThe Football Association (FA) tells PinkNews it recognises “the importance” of the needs of the women’s team, saying it wants “players to feel our continued support on this matter.”\nIt adds it will “keep this subject in consideration” in any future kit redesigns.\nFans celebrate ‘phenomenal’ new design\nEngland Women’s player Lauren James took to Twitter to share a preview of the new away kit.\nCaptioned “Honoured to wear the badge. Freshhh!! New kit same vibezz,” the post has been liked more than 16,000 times.\nQuote tweets of James’ post include a user stating “England Women’s have a much better kit than England Men’s”, while another stated “this is a proper kit”.\nMany other users took to compliment the updated uniform with many writing that they want to buy it.\nLionesses’ Twitter account posted the new uniforms on 3 April, with one follower commenting that the “away kit is class”.\nAnother England Women’s supporter reposted the tweet and captioned it: “They are both phenomenal kits.”\nCountless other football fans agreed that the new all-blue kit is “unreal”.\nFormer England footballer Sue Smith told Sky Sports it’s “great” that the players have been listened to.\nFollowing the announcement Smith said: ”It is something that players have spoken about previously and nothing has happened.\n“As a player you want to feel comfortable, and if you are comfortable you are playing well.”\nThe new kits have been designed to be sustainable, with the uniforms being composed of at least 80 per cent recycled material, according to England Football’s website.\nAhead of the women’s World Cup, the German Football Association (FA) has questioned if players will be permitted to wear the pro-LGBTQ+ OneLove armband. Currently no decision has been made.\nAt the men’s World Cup in 2022, held in Qatar, teams were banned from wearing the armband with threats of dissenting players being booked and risking missing a game later in the tournament.\nThis was due to the country’s lack of LGBTQ+ rights and extreme views on queer lives.\nPinkNews has contacted Nike and the FA for comment on the new kit.\nIt’s been confirmed that the new England Women’s kit will be available to buy from nike.com from 5 June.\nThis article contains affiliate links, PinkNews may earn revenue if you click through and purchase products through the links.",
  "word_count": 582,
  "scraped_at": "2026-02-14T13:36:08.677786"
}