{
  "article_id": "31b3a67510d1",
  "url": "https://www.thechampaignroom.com/2024/7/1/24096244/illini-2024-first-half-in-review-terrence-shannon-johnny-newton-rose-yeboah-brad-underwood-big-ten",
  "title": "Illinois Athletics 2024 : First Half Year - In - Review",
  "date": "20240701T060000Z",
  "domain": "thechampaignroom.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "We are already midway through 2024 and the first six months of this year have provided Fighting Illini fans with a plethora of history-making milestones, championship performances, and attention-grabbing storylines.\nIllinois Athletics 2024: First Half Year-In-Review\nHistory-making performances and attention-grabbing storylines.\nAllow me to get you caught up on what you may have missed. Buckle up.\nJan. 2: Men’s basketball restarts conference play in blowout fashion, smashing the Northwestern Wildcats 96-66.\nGrad transfer Marcus Domask paced the Illini with 32 points and six assists.\nJan. 3: Former Illinois DB Devon Witherspoon is elected to the Pro Bowl as a rookie.\nThe fifth overall pick in the 2023 NFL Draft, “Spoon” finished with 79 total tackles, three sacks, a fumble recovery and a pick-six for the Seattle Seahawks and was a finalist for Defensive Rookie of the Year.\nJan. 5: Ninth-ranked Illinois falls at Mackey Arena to No. 1 Purdue, 83-78. The Illini trailed by 15 at halftime and by as many as 21 in the second half before surging late.\nJan. 6: Graduate transfer Amber Simpson sets a school record in the weight throw (20.31 meters) in her Illini debut to begin the indoor track & field season.\nJan. 8: Terrence Shannon Jr. takes legal action against the University of Illinois in an effort to end his indefinite suspension. Shannon’s attorneys seek a temporary restraining order that would allow him to be immediately reinstated to the basketball team.\nJan. 11: No. 10 Illinois holds off the Michigan State Spartans, 71-68, at State Farm Center. Five Illini scored in double-figures, with Ty Rodgers chipping in a career-high 15 points.\nJan. 11: Football parts ways with defensive assistants Andy Buh & Antonio Fenelus.\nBuh had served as Illinois’ linebackers coach since 2021, while Fenelus was brought in as DBs coach ahead of the 2023 season as a replacement for Aaron Henry, who was promoted to Defensive Coordinator.\nThe Illini defense regressed mightily in 2023, allowing an average of 29.4 points and 378.3 yards per game.\nJan. 13: Junior Darja Sopova breaks the program record in triple jump at the Commodore Invitational in Nashville, Tenn. Sopova’s distance of 13.56m (44’6”) surpassed the previous record of 13.46m set back in 2003.\nJan. 14: Men’s basketball falls to the unranked Maryland Terrapins, 76-67, in Champaign.\nThe Fighting Illini shot a pitiful 9-for-40 (22.5%) in the second half, including 8-for-24 on layups. Illinois was also outscored a whopping 52-26 in the paint. Marcus Domask led the Illini with 26 points.\nJan. 14: After beginning Big Ten play 0-4, women’s basketball dominates Northwestern, 93-52, to earn its first league win of the season.\nJan. 16: Veteran linebacker Seth Coleman announces he’ll be returning for his sixth and final season. Coleman finished 2023 with 50 total tackles (37 solo), nine TFLs, and six sacks.\nJan. 18: Men’s basketball bounces back with a convincing 88-73 victory at Michigan. Wolverines head coach Juwan Howard falls to 0-7 against the Illini.\nJan. 19: Terrence Shannon Jr. is reinstated to the men’s basketball team. UI spokesperson Robin Kaler shared in a statement that TSJ had “been reinstated to full status as a University student-athlete and will be eligible for basketball practice and competition.”\nJan. 21: Terrence Shannon Jr. scores 16 points and records four assists in his return from suspension, as the Fighting Illini complete a season sweep of Rutgers with an 86-63 win at State Farm Center.\nJan. 22: Illini women’s track & field earns the program’s first-ever No. 1 national ranking in the United States Track & Field and Cross Country Coaches Association (USTFCCCA) poll.\nJan. 22: Four-star 2025 guard Jeremiah Fears commits to Illinois. The 6-foot-3 prospect played his freshman & sophomore seasons at Joliet West before transferring to Compass Prep in Arizona.\nJan. 23: Illini football hires David Gibbs as associate head coach and defensive backs coach. He was most recently co-defensive coordinator & secondary coach at UCF, which had the fewest passing yards allowed (196.7) in the Big 12 last season.\nJan. 23: Women’s basketball signee Berry Wallace is named a McDonald’s All-American. The 6-foot-1 forward and five-star recruit is Illinois’ first “burger girl” since 2014.\nJan. 24: No. 10 Illinois falls, 96-91, in overtime at Northwestern. In stark contrast to the teams’ first meeting, this game featured 15 ties and 18 lead changes. Northwestern’s Boo Buie finished with 29 points on 12-of-15 shooting.\nJan. 25: Women’s basketball squanders a double-digit halftime lead in a 67-59 loss to No. 12 Ohio State in Champaign. The Illini committed 21 turnovers and shot just 18-of-40 in the paint.\nJan. 26: Rose Yeboah breaks a 25-year-old program record in high jump to take first place at the Illini Challenge. Yeboah’s record-setting jump of 1.88m eclipsed the previous mark of 1.87m set back in 1999.\nJan. 27: Illinois guts out a 70-62 win over the rival Indiana Hoosiers at State Farm Center. Terrence Shannon Jr. shot just 2-for-10 from the field but hit two clutch free throws in the final seconds to ice the game.\nThe Illini’s perimeter defense held IU without a three-pointer, the first time Indiana had failed to make a three in a game since 2010.\nJan. 28: Men’s gymnastics knocks off the top-ranked Oklahoma Sooners in Champaign.\nJan. 31: Former Illini All-American Ayo Dosunmu completes the first 50/40/90 month in Chicago Bulls history.\nAyo shot 53% from the floor, made 46% of his 3-point attempts, and 91% of his free throws.\nJan. 31: Women’s basketball avenges a 36-point home loss to the Michigan Wolverines with a 77-64 victory in Ann Arbor. Makira Cook finished with 20 points on 8-for-12 shooting.\nFeb. 3: Amber Simpson again sets a program record in the weight throw at the Meyo Invitational in South Bend, Ind. The grad transfer broke her own school record with a mark of 22.01 meters.\nFeb. 4: Men’s hoops escapes with an 87-84 overtime win versus the Nebraska Cornhuskers at State Farm Center. The Orange & Blue shot a mere 9-of-34 (26.5%) from long range and coughed up a 10-point lead in the final three minutes.\nNebraska’s Keisei Tominaga led all scorers with 31 points but missed a three-quarter-court three which would have forced a second OT.\nFeb. 5: Purdue snaps a seven-game losing streak with a 77-72 win over the Illini in West Lafayette. Illinois overcame a 14-point deficit in the second half to force overtime.\nAdalia McKenzie (15 points, 17 rebounds) and Kendall Bostic (24 points, 15 rebounds) each recorded double-doubles for the Orange & Blue in a losing effort.\nFeb. 7: Bret Bielema loses his third assistant coach of the offseason, as OLB coach/pass rush coordinator Charlie Bullen returns to the NFL to join the New York Giants’ coaching staff.\nFeb. 8: Justin Stepp is hired as wide receivers coach. Stepp, most recently an assistant at South Carolina, replaces George McDonald, who accepted a position on Lane Kiffin’s staff at Ole Miss.\nFeb. 8: Six former Illini — Johnny Newton, Keith Randolph, Isaiah Adams, Isaiah Williams, Tip Reiman & Julian Pearl — accept invites to the NFL Combine.\nFeb. 10: Illinois is outscored 24-6 in the final four minutes as the Michigan State Spartans knock off the Illini, 88-80, at Breslin Center.\nTSJ led all scorers with 28 points — his most since returning from suspension.\nFeb. 11: Former Illini OL Nick Allegretti wins his third Super Bowl as a member of the Kansas City Chiefs.\nFeb. 13: Brad Underwood improves to 8-0 against Juwan Howard as the Fighting Illini blow out Michigan, 97-68. Terrence Shannon Jr. scored 31 points and Illinois collectively shot 58.1% from the field and 50% from downtown.\nFeb. 17: No. 14 Illinois wins at Maryland for the first time since 2011 — when the Terrapins were still members of the ACC. Shannon scored a team-high 27 points, while Marcus Domask chipped in a double-double (19 points, 12 rebounds) in the 85-80 victory.\nFeb. 19: Women’s basketball earns its signature win of the season, upsetting the 14th-ranked Indiana Hoosiers, 86-66, in Champaign.\nMakira Cook (pictured above) led the Illini with 22 points, and Illinois notched its first win in the series since 2012.\nFeb. 21: Terrence Shannon Jr. scores a career-best 35 points, but men’s hoops surrenders a double-digit lead in the final four minutes in a stunning 90-89 loss at Penn State.\nThe hosts outscored Illinois 8-0 in the final 40 seconds of the game, Penn State’s first Big Ten contest at historic Rec Hall since 1996.\nFeb. 23: Tyler Sudduth takes gold in the weight throw (22.77m) on the first day of the Big Ten Indoor Championships. The Richton Park, Ill., native became the school’s first Big Ten champ in the event since 2021.\nFeb. 24: Illinois records its 1,000th all-time Big Ten win in a 95-85 victory over the Iowa Hawkeyes at State Farm Center.\nAfter a sluggish start to the second half, Brad Underwood pulled the starting lineup and turned to his bench, most notably Niccolo Moretti (pictured below). The seldom-used Italian point guard saw the court for 17 minutes, scoring nine points — including the first two three-pointers of his college career.\nColeman Hawkins finished with a career-high 30 points (9-11 FG) and the Illini secured their fifth consecutive 20-win season for the first time since doing it eight straight times from 1999-2007.\nFeb. 24: Women’s track & field wins the Big Ten Indoor Championship for the first time since 2013. Illinois had not finished better than ninth in the previous 11 seasons. Darja Sopova won the triple jump, Bara Sajdokova took first place in high jump & Jessica McDowell won the 200m.\nAiden Ouimet finished atop the podium in the heptathlon (60m dash, long jump, shot put, high jump, 60m hurdles, pole vault, and 1000m run), the first Illinois man to become a Big Ten Champion in the event, setting a new program record with 6,120 points.\nFeb. 25: Caitlin Clark registers a triple-double (24 points, 15 rebounds, 10 assists) in No. 4 Iowa’s 101-85 win over Illinois. The Hawkeyes shot a blistering 17-for-37 (46%) from three-point range.\nFeb. 28: The Fighting Illini outlast the Minnesota Golden Gophers, 105-97, in Champaign.\nIn a wild game that saw six ties and 20 (!) lead changes, both squads shot 60% or better from the field, with the Gophers going 14-of-20 (70%) from beyond the arc — including 7-for-8 (87.5%) — in the second half.\nIllinois scored on a whopping 77% of its possessions after halftime.\nMar. 2: No. 13 Illinois stays alive in the Big Ten title race after a 91-83 win at Wisconsin.\nThe victory is Illinois’ fifth Quad 1 win of the season and the Illini’s fourth straight win against the Badgers in Madison.\nMar. 3: Men’s basketball signee Morez Johnson is named Player of the Year by the Chicago Sun-Times. The 6-foot-9 forward averaged nearly 20 PPG and 15 RPG for Thornton, leading them to a 29-5 record and the IHSA Super-Sectionals.\nMar. 3: Women’s basketball upsets the Nebraska Cornhuskers, 74-73, on Senior Night. The Fighting Illini held the Huskers without a field goal in the final 5+ minutes, while Illinois closed the game on a 6-0 run.\nMakira Cook led the way with 20 points — eclipsing 1,500 for her career — and chipped in six rebounds and five assists.\nMar. 5: Kendall Bostic & Makira Cook are voted Second Team All-Big Ten, while Genesis Bryant is named All-Big Ten Honorable Mention. Newcomer Gretchen Dolan was voted to the conference’s All-Freshman team.\nMar. 5: No. 3 Purdue defeats No. 12 Illinois, 77-71, to clinch the Big Ten regular season title. TSJ is held to a then-season-low 11 points in his final game at State Farm Center.\nMar. 7: No. 9 seed Illinois loses to 8-seed Maryland, 75-65, in the first round of the Women’s Big Ten Tournament. the Illini led 24-10 after the first quarter but shot just 16-of-51 (31.4%) the rest of the game.\nThe Terrapins improve to 17-0 all-time against Illinois. The Illini end the regular season a disappointing 14-15.\nMar. 9: Women’s track & field ties a program record with five All-Americans at the NCAA Indoor Championships in Boston.\nMar. 10: The Illini lead by as many as 21 in the first half en route to a 73-61 victory at Iowa. Illinois completes the regular season 23-8 (14-6 B1G) and earns the 2-seed at the Big Ten Tournament.\nMar. 10: Edmond Ruth (174 lbs.) becomes the Illini’s first Big Ten wrestling champion since Isaiah Martinez in 2018.\nMar. 10: Bret Bielema hires Clint Sintim as outside linebackers coach. Sintim comes to Illinois following a four-season stint at him alma mater, Virginia. Sintim played four seasons in the NFL, winning a Super Bowl ring with the New York Giants.\nMar. 11: Former Illini OL Nick Allegretti signs a three-year, $16 million free agent contract with the Washington Commanders. Former kicker Chase McLaughlin agrees to a three-year, $12.3 million contract with the Tampa Bay Buccaneers.\nMar. 12: Marcus Domask & Terrence Shannon Jr. are named First Team All-Big Ten. Coleman Hawkins is honored as a Third Team Selection.\nMar. 14: Petros Kyprianou is named Midwest Region Coach of the Year by the United States Track & Field and Cross Country Coaches Association (USTFCCCA).\nMar. 15: The 2nd-seeded Fighting Illini defeat 10-seed Ohio State, 77-74, in the quarterfinals of the B1G Tournament in Minneapolis.\nTerrence Shannon Jr. led the team with 28 points, but it was Dain Dainja (pictured) that sparked Illinois’ comeback victory. The redshirt junior — who grew up in Brooklyn Park, Minn., about 10 miles from Target Center — poured in 18 points in 20 minutes off the bench.\nMar. 16: TSJ scores a Big Ten Tournament-record 40 points as the Illini come from behind to defeat Nebraska, 98-87, to clinch a spot in the tournament final.\nTrailing by 11 at halftime, Illinois outscored the Cornhuskers in the second half, 58-36.\nMar. 17: Men’s basketball overcomes a double-digit deficit for the third consecutive day, edging the Wisconsin Badgers, 93-87, to claim the Big Ten Tournament title for the second time since 2021.\nShannon scored a whopping 102 points in Illinois’ three contests — the second-most in BTT history — and was named the tournament’s Most Outstanding Player.\nLater that night — like, 20 minutes later — the Fighting Illini received a 3-seed in the East Region of the NCAA Tournament, sharing a bracket with Big 12 Tournament champs Iowa State and reigning national champions UConn (more on that later).\nMar. 19: Terrence Shannon is named a Third Team All-American by the Associated Press.\nMar. 21: Women’s hoops defeats Missouri State, 74-69, in Champaign, in the first round of the inaugural Women’s Basketball Invitation Tournament (WBIT).\nMakira Cook poured in a season-best 27 points, and the Illini outscored the Bears 42-32 in the second half, holding them to 12-of-39 shooting.\nMar. 21: Illinois defeats 14-seed Morehead State, 85-69, in the first round of the men’s NCAA Tournament.\nMarcus Domask (pictured) turned in the sixth triple-double in program history — and just the tenth in NCAA Tournament history (12 points, 11 rebounds, 10 assists).\nTerrence Shannon Jr. added a game-high 28 points, setting the program’s new single-season scoring record with 669.\nMar. 22: Redshirt junior Edmond Ruth becomes the wrestling program’s fifth-ever All-American at 174 pounds. Ruth went 2-1 on the day to reach the 7th place match.\nMar. 23: Ruth finishes 7th at the NCAA Championships at 174 pounds. Ruth defeated Army’s Benjamin Pasiuk by major decision, concluding his season at 26-4.\nMar. 23: Men’s gymnastics earns the program’s first-ever Big Ten regular season championship with a win over No. 6 Penn State.\nThe Illini won four events on the day: Michael Fletcher and Connor McCool shared the floor title with a pair of 14.300s, Brandon Dang won pommel horse with a 14.750, Amari Sewell won vault with a 14.750 and Ryan Vanichtheeranont won high bar with a 14.000.\nMar. 23: Men’s basketball dominates Duquesne, 89-63, to advance to the program’s first Sweet Sixteen since 2005.\nTerrence Shannon Jr.’s postseason tear continued with 30 points versus the Dukes, his sixth consecutive game with more than 25.\nMar. 24: The Illini women advance to the quarterfinals of the WBIT, cruising past Stony Brook, 79-62, at State Farm Center.\nAdalia McKenzie led Illinois with 28 points (12/16 FG), and Kendall Bostic added another double-double to her season ledger (19 points, 17 rebounds), as the Orange & Blue clinched back-to-back .500 seasons for the first time since 2006-07 and 2007-08.\nMar. 28: Illinois defeats the Tulsa Golden Hurricane, 69-61, to advance to the WBIT Semifinals in Indianapolis. Makira Cook scored 17 points, surpassing 1,000 for her career at Illinois.\nMar. 28: The Fighting Illini hold off the 2-seed Iowa State Cyclones, 72-69, to reach the Elite Eight for the first time since, you guessed it, 2005.\nMar. 30: Men’s basketball season concludes with a lopsided 77-52 loss to the top-seeded Connecticut Huskies in the East Regional Final.\nThe turning point of the game came late in the first half with the game tied 23-23. UConn scored the final five points before heading into the locker room. That 5-0 run ultimately snowballed into an unfathomable 30-0 Huskies run which put the game out of reach.\nTerrence Shannon Jr. was held to just 8 points (2/12 FG), to end his record-breaking season with 736 points. Illinois finished with a 29-9 record, its most victories since the famed national runner-up squad won 37 games in 2004-05.\nApr. 1: Less than 48 hours after season’s end, Illinois center Dain Dainja enters the transfer portal. The 6-foot-9 junior played 71 games over two years in Champaign, averaging 6.1 points and 3.6 rebounds in 2023-24.\nApr. 1: Men’s basketball welcomes its first incoming transfer of the offseason, as former Mercer swingman Jake Davis commits to the Fighting Illini. The 6-foot-6 Indianapolis-area native averaged 9.0 PPG, 4.5 RPG, and shot nearly 39% (60-for-155) from three-point range as a freshman.\nApr. 1: The Illini advance to the WBIT Championship with an 81-58 blowout win over the Washington State Cougars at Hinkle Fieldhouse in Indianapolis.\nApr. 1: Former Illinois DB Vontae Davis is found dead at his home in Southwest Ranches, Florida. Davis, 35, played for the Illini from 2006-08 and was a three-time All-Big Ten selection as well as a 2008 All-American.\nDavis was a first-round pick of the Miami Dolphins in the 2009 NFL Draft and was twice named to the Pro Bowl while with the Indianapolis Colts.\nApr. 1: Defensive backs coach David Gibbs resigns, citing medical reasons. Gibbs was hired in January after the firing of Antonio Fenelus.\nApr. 3: Women’s gymnastics qualifies for the NCAA Regionals for the 20th consecutive season.\nApr. 3: The Illini take down Villanova, 71-57, to win the inaugural WBIT championship.\nIllinois outscored the Wildcats 42-25 after halftime. Makira Cook (pictured) took over in the second half, scoring 22 points on 7-of-11 shooting in the final 20 minutes. She was also named the tournament’s Most Outstanding Player.\nIt’s the first postseason championship of any kind for women’s basketball, and Shauna Green is the first Illini head coach in program history to finish above .500 in each of their first two seasons.\nApr. 4: On the heels of the program’s WBIT title, center Kendall Bostic announces she’ll return to Champaign for her final college season. The 6-foot-2 senior averaged a double-double (12.1 PPG, 10.9 RPG) this season for the Orange & Blue.\nApr. 9: Brad Underwood gets his second addition via the transfer portal in former Louisville forward Tre White. The 6-foot-7 swingman averaged 12.3 ppg for the Cardinals in 2023-24.\nApr. 9: Men’s basketball is ranked No. 6 in the final AP Poll of the season.\nApr. 12: 2024 signee Morez Johnson is named Illinois’ Mr. Basketball.\nThe 6-foot-9 forward is the top-ranked prep prospect in the state, and the third Illinois Mr. Basketball to commit to Brad Underwood (Mark Smith, Adam Miller).\nApr. 14: Arizona transfer Kylan Boswell commits to Illinois. Boswell, a Champaign-area native, the 6-foot-2 guard averaged 9.6 points and 3.6 assists last season for the Wildcats.\nApr. 15: Redshirt sophomore guard Sencire Harris enters the transfer portal.\nApr. 15: Former Illini pitcher Ken Holtzman passes away at age 78. The southpaw threw two no-hitters while with the Chicago Cubs and totaled 174 victories in 15 MLB seasons. Holtzman was also part of four World Series-winning teams as a member of the Oakland Athletics & New York Yankees.\nHoltzman was inducted into the Fighting Illini Athletics Hall of Fame in 2023.\nApr. 16: Forward Amani Hansberry also hits the transfer portal. The former four-star recruit showed promise as a freshman, averaging 2.4 points and 2.1 rebounds in 7.5 minutes per game this season.\nApr. 16: Men’s basketball assistant Chester Frazier leaves to join the coaching staff at West Virginia. Frazier was previously an assistant at Kansas State & Virginia Tech prior to returning to his alma mater in 2021.\nApr. 16: Notre Dame transfer Carey Booth commits to the Fighting Illini. The 6-foot-10 forward comes to Illinois with three seasons of eligibility remaining.\nApr. 17: Marcus Domask is named a First Team Academic All-American. The SIU-Carbondale transfer excelled on the court —scoring 603 points in his lone season in Champaign — and in the classroom, recording a 4.0 GPA while studying for his master’s degree in recreation, sports and tourism.\nApr. 18: Former Illini running back Dre Brown rejoins the program as Director of Player Personnel. The DeKalb native suited up for Illinois from 2015-2019 and spent the previous three seasons as Director of Recruiting for the Notre Dame Fighting Irish.\nApr. 20: Sophomore gymnast Tate Costa wins a national title on high bar at the NCAA Championships.\nApr. 20: Football’s annual spring game is held at Memorial Stadium. Donovan Leary led all Illini quarterbacks with 207 passing yards, redshirt sophomore Aidan Laughery amassed 11 carries for 70 yards, and little-known WR Alex Capka-Jones and had a team-best 95 receiving yards, including a TD catch.\nApr. 21: Orlando Antigua returns to Illinois as men’s basketball associate head coach.\nAntigua was an Illinois assistant on Brad Underwood’s staff from 2017-21 and was instrumental in recruiting players like Andres Feliz, Giorgi Bezhanishvili & Kofi Cockburn to Champaign.\nApr. 22: Junior Luke Goode is the latest Illini to enter the transfer portal. The 6-foot-7 forward shot 39% (61-of-157) on 3-pointers this past season and graduated from the University of Illinois in just three years.\nApr. 23: Coleman Hawkins declares for the 2024 NBA Draft. In his fourth and final season at Illinois the 6-foot-10 forward averaged 12.1 points, 6.1 rebounds and 2.7 assists on 45.1% shooting.\nApr. 25: Marcus Domask declares for the NBA Draft after being denied a sixth year of eligibility by the NCAA.\nApr. 26: Three former Illini — DT Johnny Newton, OL Isaiah Adams and TE Tip Reiman — are selected on Day Two of the NFL Draft.\nApr. 27: Wide receiver Casey Washington is selected by the Atlanta Falcons in the sixth round (No. 187 overall) of the NFL Draft.\nApr. 27: Women’s hoops lands its first transfer of the offseason, signing former Mississippi State guard Jasmine Brown-Hagger. The Chicago-area product was a four-star recruit in the class of 2023.\nApr. 28: Northwestern wins the Big Ten Men’s Golf Tournament, ending Illinois’ record-setting streak of eight consecutive conference titles. Mike Small’s team finished in second place, 15 strokes behind the Wildcats.\nApr. 29: Point guard Niccolo Moretti hits the transfer portal, leaving the Fighting Illini with just two remaining scholarship players from this season’s Elite Eight roster.\nApr. 30: Former Evansville forward Ben Humrichous commits to Illinois. The 6-foot-9 grad transfer averaged nearly 15 ppg and 42% from 3-point range last season for the Purple Aces.\nMay 4: Jackson Buchanan is named Big Ten Golfer of the Year, the fourth season in a row that an Illini has received the honor. The junior from Dacula, Ga., won two individual titles during the regular season and finished 2nd at the Big Ten Championships.\nMay 6: Croatian big man Tomislav Ivisic signs with Illinois hoops. The 7-foot-1 center played the previous three seasons for SC Derby in the Adriatic League First Division (ABA).\nIvisic’s twin brother, Zvonimir, spent last season at Kentucky under the tutelage of then-assistant coach Orlando Antigua before transferring to Arkansas.\nMay 7: Track & field’s Sophia Beckmon is named National Athlete of the Week following a record-setting performance at the Fighting Illini Tune-Up. Beckmon broke the program and Big Ten-record with a long jump of 6.86 meters (22’6 1/4”), which also cleared the Olympic standard of 6.85m.\nMay 10: A judge finds probable cause for Terrence Shannon Jr. to stand trial for felony rape and aggravated sexual battery. The trial date is scheduled from June 10 in Douglas County, Kansas.\nMay 11: Fighting Illini baseball sets a program record for home runs in a 10-4 loss to Iowa. Vytas Valincius’ three-run blast in the sixth inning gave Illinois 92 homers this season, breaking the previous record set in 1992.\nMay 12: Former Texas Longhorns DB Terrence Brooks commits to Illinois. Brooks was Honorable Mention All-Big 12 this past season, amassing 20 tackles, six pass breakups and three interceptions.\nMay 13: Bret Bielema hires Corey Parker as Illinois defensive backs coach. Parker had spent the previous two seasons with Toledo, where the Rockets’ DBs ranked top-10 nationally in pass efficiency defense.\nMay 15: Men’s golf advances to the NCAA Championships with an eight-stroke victory in the Stanford Regional. The Illini finished with a 54-hole cumulative score of -36. Freshman Max Herendeen finished with the best individual score in the regional at -13. #GolfSchool\nMay 17: Athletic Director Josh Whitman is named chair of the NCAA Division I Council.\nMay 18: Illinois baseball completes a sweep of Purdue with an 18-10 win, clinching the outright Big Ten championship.\nThe Fighting Illini finished the regular season 18-6 in conference play and earned the No. 1 seed in the Big Ten tournament.\nMay 21: Dan Hartleb is named Big Ten Manager of the Year. Illini baseball, picked outside of the top six in the preseason poll, won its first regular-season conference title since 2015.\nIn addition to Hartleb’s coaching honors, six Illini garnered All-Big Ten recognition:\nC/DH Camden Janik (first team), C/DH Jacob Schroeder (first team), 2B Brody Harding (second team), OF Ryan Moerman (second team), OF Cameron Chee-Aloy (third team), 1B Drake Westcott (third team)\nMay 22: The top-seeded Fighting Illini fall to 8-seed Penn State, 8-4, in the opening round of the Big Ten Tournament in Omaha, Neb.\nMay 23: A landmark agreement is struck in which the NCAA and its power conferences will be allowed to directly pay players for the first time.\nThe NCAA will pay more than $2.7 billion in damages over 10 years to past and current athletes, per ESPN. The report also states the parties agreed to a revenue-sharing plan allowing each school to share up to roughly $20 million per year with its student-athletes.\nThe agreement “will result in a reshaping of our traditional scholarship system ... We face many important decisions in the months ahead – decisions with far-reaching implications for our program and our student-athletes,” Illinois AD Josh Whitman said in a statement.\nMay 23: Illinois advances in the Big Ten Tournament with a 4-2, 10-inning victory over the Iowa Hawkeyes.\nAfter Coltin Quagliano’s 2-RBI single gave the Illini a 4-2 lead in the top of the 10th, Iowa loaded the bases with nobody out in the bottom half. Then the game turned on a controversial interference call against the Hawkeyes.\nUmpires confirmed the call with video replay, which resulted in a double play and took away an Iowa run. Closer Joe Glassey would strike out the next hitter to give Illinois its first BTT win since 2018.\nMay 24: Baseball is eliminated from the Big Ten Tournament with a 4-2 loss to the Michigan Wolverines. The top seed in the field, Illinois finished just 1-2 in the BTT.\nMay 24: Isabel Sy is named Honorable Mention All-American by the Women’s Golf Coaches Association (WGCA).\nSy had six consecutive top-four finishes this season, including back-to-back co-champion performances — the first Illini to achieve both since her head coach Renee Slone in the 1992-93 season.\nMay 25: Track & Field wraps up the NCAA West Region preliminaries with 16 athletes qualifying for the National meet, the program’s highest total since 2008.\nThe weekend was highlighted by Rose Yeboah finishing first in high jump (1.84m), Darja Sopova setting a program record in the triple jump (13.76m), and the 4x100m relay team of Asia Thomas, Sophia Beckmon, Tacoria Humphrey & Jessica McDowell qualifying with a school-record time (43.50 seconds).\nSix Illini men qualified for the national competition, the most individual nods in 38 years.\nMay 27: Baseball qualifies for the NCAA Tournament for the first time since 2019. The Orange & Blue earned a trip to the Lexington, Ky., regional, hosted by the No. 2 Kentucky Wildcats.\nMay 27: Men’s golf advances to match play at the NCAA Championships in Carlsbad, Calif. Mike Small’s team earned the top seed following a dominant performance in stroke play, in which the vanquished second-place Virginia by SIXTEEN shots.\nMay 28: Brad Underwood receives a commitment from Kasparas Jakucionis, one of the top international prospects in the 2025 draft class. A 6-foot-5 point guard from Lithuania, Jakucionis is projected as a future first-round pick.\nMay 29: Coleman Hawkins announces he is withdrawing his name from the upcoming NBA Draft and will instead enter the transfer portal.\nMay 31: Illinois opens the NCAA Tournament with a 4-1 win over the Indiana State Sycamores in the Lexington Regional. Jack Crowder twirled eight innings of one-run, three-hit ball to help advance the Illini to a matchup with host Kentucky.\nJun. 1: No. 2 Kentucky defeats Illinois, 6-1, in the winners’ bracket of the NCAA Tournament.\nJun. 2: Illini baseball is eliminated from the NCAA Tournament with a 13-2 loss to Indiana State. Ryan Moerman hit his team-best 19th home run for Illinois, which concluded its season at 35-21.\nJun. 3: Former Illini Kevin Hardy & Simeon Rice are included on the ballot for the 2025 College Football Hall of Fame.\nJun. 5: Former Illinois volleyball player Jordyn Poulter is named to Team USA for the 2024 Paris Olympics. Poulter was also member of Team USA’s gold medal-winning squad at the 2021 Olympic Games in Tokyo.\nJun. 8: Rose Yeboah wins the national title in high jump at the NCAA Championships. Yeboah broke the NCAA Championships record with a mark of 1.97 meters.\nJun. 8: Evan Correll wins gold at the NCAA Outdoor Championships in the inaugural 100m wheelchair race with a time of 14.33 seconds.\nCorrell was also the champion in the 100 and 800-meter races at the Drake Relays earlier this season.\nJun. 9: Future Illini Morez Johnson (2024) & Jeremiah Fears (2025) help Team USA win the FIBA Men’s U18 AmeriCup in Buenos Aires, Argentina. Team USA defeated the host nation, 110-70, in the gold medal game.\nJun. 13: Terrence Shannon Jr. is acquitted in his criminal trial. He had been suspended in late December and subsequently missed six games after being charged with rape and aggravated sexual battery following an alleged incident at a Lawrence, Kan., bar during the weekend of the Illinois-Kansas football game.\nJun. 13: Former UT-San Antonio & Ole Miss WR Zakhari Franklin commits to Illinois. One of the top remaining targets in the portal, Franklin played four seasons at UTSA — two under then-offensive coordinator Barrey Lunney Jr. — before transferring to Mississippi ahead of the 2023 season.\nFranklin is college football’s active leader in career receptions (266), receiving yards (3,386), and receiving TDs (38).\nJun. 13: Rose Yeboah is named Big Ten Field Athlete of the Year, the first Illini in program history.\nJun. 13: Women’s basketball announces a foreign tour of Italy & Greece later this summer. The Illini will compete in a series of exhibition games during the trek, which begins August 2.\nJun. 14: The Division of Intercollegiate Athletics announces eight members of the 2024 Illinois Athletics Hall of Fame class:\n- Darrick Brownlow (football)\n- Laura DeBruler Santos (volleyball)\n- Janelle Flaws (soccer)\n- Robert Holcombe (football)\n- Pete Velasco (fencing)\n- Nick Weatherspoon (men’s basketball)\n- Frank Williams (men’s basketball)\n- Gary Winckler (women’s track & field coach)\nHolcombe starred for the Illini from 1994-97 and is still Illinois’ all-time leading rusher with 4,105 yards. He went on to become a second-round pick in the 1998 NFL Draft and won Super Bowl XXXIV as a member of the St. Louis Rams.\nWilliams led the Fighting Illini to a Big Ten championship in 2001, was named First Team All-Big Ten in 2001 and 2002 & First Team All-American in 2001. He finished his career with 1,440 points and was a first-round pick in the 2002 NBA Draft.\nJun. 16: Max Herendeen (men’s golf) and Elizabeth Ndudi (track & field) are honored as Illinois Freshmen of the Year.\nJun. 17: Darja Sopova (track & field) and Marcus Domask are named Illinois Newcomers of the Year.\nJun. 18: Rose Yeboah & Terrence Shannon Jr. are named Dike Eddleman Athletes of the Year.\nYeboah captured a national title in the high jump with a school-record leap of 1.97m. She also automatically qualified for the 2024 Paris Olympic Games, where she will represent her home nation of Ghana.\nTSJ was named First Team All-Big Ten, Third Team All-America, set the program’s single-season scoring record (736 points), and led Illinois to its first Elite Eight appearance since 2005.\nJun. 20: AD Josh Whitman announces that Terrence Shannon Jr.’s jersey will be raised to the rafters at State Farm Center.\nWhile TSJ was not a consensus All-American while playing for Illinois, which is one of the prerequisites for the Honored Jersey program, many voters may have not voted for Shannon due to his ongoing charges and case at the time.\nJun. 20: Men’s tennis alum Rajeev Ram is chosen to represent Team USA at the 2024 Paris Olympics. Ram, a member of Illinois’ national title team in 2003, will be making his third Olympic appearance. He previously partnered with Venus Williams to win a silver in mixed doubles in 2016.\nJun. 23: Five-star wing Will Riley commits to Illinois. A projected 1st-round pick in the 2025 NBA Draft, the 6-foot-8 Canadian is expected to reclassify to the class of 2024.\nJun. 25: The University of Illinois announces 102 student-athletes are receiving Distinguished Scholar honors.\nAccording to FightingIllini.com, Distinguished Scholar Award recipients must have earned Academic All-Big Ten recognition in the previous academic year, must have been enrolled full time at the institution for the entire previous academic year & earned a minimum GPA of 3.70 during the previous academic year.\nJun. 26: Terrence Shannon Jr. is selected by the Minnesota Timberwolves with the 27th pick in the first round of the NBA Draft. TSJ was the first Illini drafted in the first round since Meyers Leonard (2012).\nJun. 27: Former Illini Marcus Domask (Chicago Bulls) & Quincy Guerrier (Toronto Raptors) sign Exhibit-10 contracts following the NBA Draft.\nSimilar to a two-way contract, a player is assigned to the franchise’s G-League affiliate and receives a bonus if that player remains on the roster. Unlike a two-way contract, an Exhibit 10 is a non-guaranteed one-year deal for the league minimum, and the NBA team can waive that player without incurring a salary cap hit or decide to convert the contract into a two-way deal if the club chooses to retain the player.\nDomask was named First Team All-Big Ten during his lone season in Champaign. The Southern Illinois transfer averaged 15.9 points 5.0 rebounds and 3.9 assists in 2023-24.\nGuerrier spent his final season at Illinois after playing his first two years at Syracuse, followed by two seasons at Oregon. The 6-foot-8 forward started all 38 games for the Fighting Illini, averaging 9.6 ppg while shooting 47.6% from the floor (37.4% 3-point).\nJun. 30: And finally, maybe the most important news of all — this is the last day of the 14-team Big Ten Conference, as the contingent of USC, UCLA, Oregon & Washington officially joins the league as of July 1.\nDo you have a favorite Illini sports moment of the first half of the year? Post in the comments below. I-L-L!\nMost Popular\n- How to Watch Illinois vs. Indiana: Game Time, TV Channel, Online Streaming and Odds\n- ‘I want to help Coach Bielema win’: Illinois introduces new DC Bobby Hauck\n- Illinois’ Kaden Feagin to change positions, become tight end\n- Terrence Shannon Jr. lights it up in G League tune-up\n- Don’t drink the poison: Why Illinois must trade fatigue for focus",
  "word_count": 6131,
  "scraped_at": "2026-02-14T12:09:51.972415"
}