{
  "article_id": "31b4fe06182e",
  "url": "https://www.the42.ie/fai-jonathan-hill-and-marc-canham-6168971-Sep2023/",
  "title": "Pauw exit and Kenny future - The FAI respond",
  "date": "20230914T223000Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "THE CONTROVERSIES AND disappointments of the last couple of weeks in Irish football built a head of steam to one pretty hectic afternoon at FAI headquarters in west Dublin yesterday.\nChief executive Jonathan Hill and director of football Marc Canham were front and centre to get their message across, and answer questions.\nThere was lots to get through.\nTopics ranged from the fallout to the Women’s World Cup and the decision not to offer manager Vera Pauw a new contract following a review that was led by Canham.\nThe former Irish boss described the outcome of that review, which Hill revealed had input from 31 different interviewees, as “pre-determined”.\nPauw also insisted that she had requested that the decision over her contract would be made before the Ireland squad went to Australia.\nHill and Canham would have their say on this matter, and more.\nThe future of Stephen Kenny in the men’s job was touched on yesterday and expanded on further by the two men, while the player development pathway which Canham has been focused on for the majority of his time with the FAI was also discussed.\nThis was the first time he had spoken to the media to outline his vision and ideas in the 12 months since his appointment.\nTo provide as much context as possible on an afternoon when questions came from all corners of the room and were scatter gun in approach to cover as much ground as possible, we have opted to provide a transcript of the key points made – only edited for brevity – by Hill and Canham.\nThey are, after all, two of the people at the forefront of driving the FAI’s plans and ambitions for the future.\n…\nQuestion: Vera Pauw claims she received a text suggesting she’d be offered a new contract in June?\nJonathan Hill: I told Vera we were, and she knew this, we were discussing and hoping to send an initial offer in relation a contract renewal. On June 12th we became aware of the issues in relation to the Athletic and as I said in my introduction, there were a number of things in that period which was a really intense period. I did sit down with Vera and talk those through. We talked around the issues in relation to The Athletic and where we’d got to on that. I told her, as I said before, that we felt in the best interest of her and the team, and everyone preparing for the World Cup, that we’d park those conversations until after the World Cup.\nQuestion: Did she say at that point that if you were not prepared to offer her a contract she’d be ok with that? Was your decision on a new contract dependent on the performance at the World Cup?\nHill: No, they weren’t. We were committed to a full review of the tournament and the campaign in the run-up to the tournament as well which we’d present to the board.\nQuestion: Marc, what qualified you to do such a review, have you ever done a review of a campaign like that?\nMarc Canham: In terms of my own background, the role is grassroots and international. I’ve been a player in all those stages, I’ve been a coach at all those stages, been a coach educator at very level of the game and also been a leader in a role like I am now in terms of all those different stages. I understand what a high-performing environment looks like and I have a clear vision of what that looks like moving forward.\nI have great experience of working in my time in the English FA. My last 10 years has been working at the Premier League, the biggest football competition in the world, working with the best coaches across senior and academy level, working with the best players literally in the world. I spent a lot of time understanding what a high performing environment looks like, so going into the review I had good frame of reference in terms of what best practice looks like and what a high-performing environment looks like across sporting elements and environmental. I think that’s clear.\nQuestion: Was there any feedback given to Vera Pauw about her training methods?\nCanham: Obviously I have a view on what that looks like in terms of my observations. It wasn’t until we got to the review we spoke to lots of stakeholders in that, we spoke to players, staff and also executives and in my role. So it was an overview of everything that came out of that. I started to form my view and as we go into the World Cup and go into the review process it started to become clear that there was a difference in opinion in the ways and methods that we wanted to take forward in the future. To be fair to Vera she’s always been absolutely clear in the methods she chooses to do around sports science, conditioning, training and coaching.\nThrough the review process and through several conversations with Vera at the start of the process, she was the first person we spoke to, and then throughout with the feedback we got from different people. Then in our session again at the end where we went through feedback from the review with Vera it was clear that methods that she has learned a lot about and become an expert in weren’t aligned with how I believe we need to take forward with all of our international teams.\nQuestion: The next manager needs to align with that?\nCanham: In short, yes, and not just me, as well as the association in terms of what that looks like. I’ve been brought in into the role to create a vision for the mid to long term of Irish football. Clearly the focus of any head coach is to look at the next game and the next campaign and support the wider, bigger picture of Irish football, I’m absolutely clear on that. My job, in my role, is to always be thinking 10 years ahead and look at the long term. So this decision that we’ve made, which isn’t unusual in football for a coach to not get a renewal of a contract, is based on a medium to long-term vision as well and not just about things that came out of the review in this. It’s part of the last year of work, of observation and speaking to people and having a clear view and how we want to create consistency and alignment across all of our international teams.\nQuestion: Would players have refused to play if Vera Pauw stayed on?\nCanham: Obviously it would just be speculation if I tried to answer that.\nQuestion: Vera Pauw said the assistant manager and media manager were approached first for review?\nCanham: So in Australia we communicated with Vera first on exactly what the process would look like and we said we would start the review process as soon as we got back to Dublin. So to be really clear, Vera was the first person we spoke to as part of that. We communicated with Vera throughout the process in terms of who we were speaking to etc, and gave her regular updates, and she was also the last person we spoke to in terms of presenting the feedback. Vera was start and finish throughout and was a big part of that review throughout the process.\nQuestion: Allegations in The Athletic first emerged in December, then re-emerged. Are you happy how the FAI conducted themselves in December compared to June/July? Not many discussions in December but becomes a bigger issue in June/July and engagement with players?\nHill: Just to be clear, I was staying in the same place as Vera and the players when the press event [before France game] happened. It was natural for me to be in and around and I saw players and spoke to players, in the same way I spoke to Vera on a regular basis over that period so that wasn’t unusual at all. In December, we weren’t in that similar scenario. We weren’t in camp.\n[FAI chairman] Roy [Barrett] in particular spoke to Vera in relation to the report that was published and we had a very clear view on the report and the review and the way it had been conducted. I said earlier in relation to all of the allegations, I think two pages of a 160-page document that were related to Vera were anonymised and unsubstantiated. I think Roy in particular felt the process that led to that report and the way in which Vera was interviewed etc, was very unfair on Vera. We took the view at that point that we were supportive of Vera, and we were. Completely supportive of Vera.\nQuestion: Her interaction with it was the big deal?\nHill: I think her interaction with it in relation to June and July was different in the sense, and I think it’s been well documented, Vera chose to engage with The Athletic and then chose to talk to it in the press conference.\nQuestion: You told her not to do it, is that correct?\nHill: I advised her not to do it. I would not say to Vera ‘don’t do something’. You know Vera. But I advised her not to do something and as it turned out, there were certain people who did feel it was a distraction.\nQuestion: There were claims players were instructed not to discuss her future during World Cup?\nHill: All players to a degree, and Vera, and people in this sporting sphere are briefed to a degree by the likes of Gareth [Maher] who works closely with the women’s team. I think the players just felt, genuinely, what was happening in relation to the review was the FAI’s decision. They knew Marc was running the review, they wanted to concentrate on the tournament and that’s exactly what they did.\nCanham: Just to reinforce, they weren’t briefed to not comment.\nQuestion: Where are we with Vera’s long term successor?\nCanham: We’ve started the process. We are seeking some external support to help with that process to make sure we look broadly and widely across the women’s market. We would love to make a permanent appointment within the UEFA Nations League window, we don’t know when that will be.\nQuestion: External support? Former players, managers involved? Or something completely external?\nCanham: We would take ownership and leadership of that process and seek expertise around that who are experts in that space to support our process.\n…\nThe nature of Pauw’s exit naturally dominated much of the discussion given this was the first time the FAI commented on events. In the meantime, men’s manager Stephen Kenny looks set to depart his role after a review is carried out into this latest unsuccessful European Championship qualifying campaign.\nWhile Hill insisted yesterday that he would remain in situ until after the campaign finishes, and also oversee the November friendly with New Zealand, he later accepted (as detailed below) that should the 11-person FAI board opt to end his tenure sooner at their board meeting on 26 September that could also be explored.\nQuestion: Stephen Kenny, between now and the end of the year – (a) potentially a lame duck manager and (b) is there any chain of events between now and the end of the year that could see him being offered a new contract?\nHill: To the first part, Stephen has a contract, an existing contract, and we are honouring that, and we are going through to the end of the November process. I think that is simple. Stephen is very committed and the players are very committed to doing the best they can in those matches, and we will then review it in November. So I can’t answer your second question until we get to that point in November and we review where we are at that point.\nQuestion: What conversations have been had with Stephen in the past few days?\nHill: Obviously I spoke to Stephen after the [Netherlands'] match and I have spoken to him in relation to what we were going to say [yesterday], so he was fully aware of that. He thanked me for making him aware of it. Marc spoke to him on a regular basis as well, so very simply this is our position, the board has supported that position and he will continue to prepare for the matches in October and November.\nQuestion: Does Stephen’s contract run to the end of Ireland’s involvement or end of Euros next summer?\nHill: It runs until the end of our involvement, active involvement, in the tournament. So in the qualification process. Mathematically we can still finish second. But it would need a lot of things to happen.\nQuestion: Is there a break out clause in Stephen contract?\nHill: As you know, I wouldn’t discuss the contract or details of any of our staff with the wider media and that’s for myself, Stephen and the board to reflect on.\nQuestion: What happens if there is an alternative view from the board this month about Stephen’s future?\nHill: It is the board’s opinion that matters so, yeah, if the board felt they wanted to take a different route then we would discuss that different route. That, actually, has defined the level and degree and quality of discussion that I think we have had at board level over the last two and a half years, that never happened before.\nThe simple answer, yes, the board will discuss this in September. I will give my report as chief executive, we will have a broader review and discussion on all of these issues. We will await to see as we always do in those meetings to see what comes out of it, but the opportunity is there for all of the board members to give their view.\n…\nOnce discussions relating to Pauw and Kenny came to an end it felt as if the remainder was any other business, yet issues of critical importance were still to come, including the level of debt and how it has been serviced; the player pathway plan being developed by Canham and how that will actually be funded; not to mention the status of the Euro 2028 bid in which Ireland look set to be co-hosts along with England, Scotland, Wales and Northern Ireland.\nQuestion: You’ve reduced debt from €63 million to €43m – that 20m, where did that come from? Was it the Covid fund from government?\nHill: We have been paying down the debt on a monthly basis and a sustainable basis since the memorandum of understanding was agreed with government, part of which was the agreement with UEFA in relation to our broader financial position with them in terms of our broadcasting and commercial rights. So, paying down the debt is happening on a monthly and systemic basis, and on a planned basis, and will continue to happen through to now, 2031, where we would hope to be debt-free.\n“We did have cash, which has come from within the business, which is a combination of increased sponsorship revenues, a laser-focus on managing costs and in relation to very carefully discussing with the board and the staff, where money would be invested. So there was a surplus and the board agreed to use some of that surplus to pay down and restructure the debt. That’s where we now find ourselves in a position where we are at €43m. But we are still in debt to the tune of €43m from that inherited position.\nQuestion: Is that surplus of money what the government gave for Covid?\nHill: As I say, it was all part of the overall revenues that were coming into football and was coming into lots of sports at the same time. Covid monies came in and were part of the revenue over that two and a half year period.\nQuestion: The Football Pathways Plan, has it been costed?\nCanham: We want to make sure we have better developed Irish players and make sure everyone has an opportunity to play football at any level of the game based on their motivation and capability. It is also about performance in terms of developing winning Ireland teams, our international teams but also our League of Ireland teams, to compete at the top level.\nIn direct response to your question, we are going through that process at the moment in terms of how we resource this, how we take investment to make sure we can deliver this. I think there are a couple of things to say, we will look holistically at how we fund this in terms of we have had positive conversations with government in terms of how we support that, using academies as an example.\nWe have also had positive conversations with Uefa and Fifa to support ongoing talent development projects moving forward to support a pipeline of talent and to develop Irish players for our system. We also have an opportunity to repurpose some of the investment we got from the association. As we move forward with the pathways plan we are going to have to make some tough decisions. There are some things we might have to stop, to turn something else on.\nQuestion: Are you financially certain you can do what you need to do?\nCanham: Yep.\nHill: The intention is very much to go down the route of a new player pathway plan which will coincide with a new pyramid structure for the game as well. We are a not for profit organisation and all the money we earn goes back into the game.\nSo we have €56 million which has a very detailed budgetary process which passes by all the various departments and ends up via the finance committee and then into the board where decisions are taken in relation to where we invest our monies. What I can safely say is we are committed to ensuring that player pathways and pyramid are such that we can develop the game in the right way in relation to Irish football.\nBut, as Marc says, if the number stays at €56m there will have to be decisions taken where one thing may go up and another may have to come down. That is just part of the nature of running a business. But to answer your question, we are committed to the concept of a new player pathway.\nCanham: There is another point to mention. We are trying to look long term on this, over 10 years and deliver things over two, three-year periods. We won’t be able to deliver everything straight away so we have to have a phased implementation of this.\nWhat is absolutely key to a successful delivery of this plan will be an implementation plan and how we do that both nationally and regionally. It is not going to happen overnight. And the final thing, not everything we do in Irish football means we have to have millions and millions of euro to change.\nHaving a clear philosophy of how we want to play, how we want to coach at grassroots level to League of Ireland to academies to international teams. Yes, of course that costs a level of money but having a really clear vision of what that looks like and educating the workforce does not cost millions and millions of Euro.\nQuestion: How much goes into academies that doesn’t come from UEFA?\nHill: It’s €10,000 per club, per annum [from FAI]. That compares with just shy of €1m that a League 2 club with an academy can get from the funding scenario they have [in England]. That’s the reality of where we are. Do I think it’s enough? Of course it’s not. Do I think we have to talk to central government about what’s available? Absolutely, I do.\nDespite that, our clubs and academies are producing some brilliant players. I know it’s frustrating for fans to see some of those players going to England, Italy or Holland, it is part of the economics of global football, in that you look to develop players. Sometimes those very good players will move on for an amount of money that can be recycled into club or economy Irish football. We need more money coming into a wider Irish football economy. That was the conversation we had with government in relation to wider funding, specific to facilities.\nQuestion: Michael Martin spoke about academies in 2021. Clubs have been told funds are coming. We’re in 2023. Have proposals been submitted to the government about academies, employment programmes?\nHill: There have been proposals that have gone into them specifically in relation to the women’s game. We are engaging with government now in relation to – on the back of the infrastructure vision – an academy vision going into be discussed with central government. That’s linking both the bricks and mortars of facilities, that we all know as necessary within the academy infrastructure as they are in relation to the stadia but also in relation to the people who would be within those buildings and are currently within those buildings, many of whom don’t get paid.\nCanham: We’re aware that’s not enough investment to do what we want. UEFA stuff helps us but we’re aware it’s difficult to do much with that. We need to find other ways to support clubs.\nHill: There are some brilliant and committed coaches within the existing system who have produced some really great players. The Under-21 side that’s just won their two matches, just look at those players. It’s almost despite the system, not because of it.\nIf we had the investment that I feel Irish football absolutely deserves, then just imagine what we could achieve. Maybe we’ll find the central or attacking midfielder you talked about in your article. Of course it’s difficult. Three years ago we didn’t know Evan Ferguson would come through as he has. We now have a world class striker available for hopefully the next 10 or 15 years. Who knows?\nWe have to keep going. It’s so much easier doing that if we found a way to invest into academies but at the same time we need to invest more in grassroots and international infrastructure. That’s why we spoke about having an international football centre.\nQuestion: Euro 2028, will Ireland qualify as co-hosts?\nHill: That’s a decision for UEFA. Depending on whether we’re successful with our bid, which we’ll know on 10 October, we will find out what the qualification process is. My guess would be for a tournament that may be hosted by five nations, all teams will be part of the qualification process. You’re asking my personal views and I think that’s important from a commercial perspective. For example, that England are part of qualification.\nThere are different ways of addressing it. I hope, and believe, that two teams will qualify automatically. It becomes part of the UEFA conversation as to how that works when all five teams go into the qualification process. I can’t go any further than that because it’s up to UEFA as to how that works.\nQuestion: If England and Scotland qualify, two other slots?\nHill: That could be a route UEFA look at.\nQuestion: How many games hosted in Ireland?\nHill: Six. Sorry, six in Dublin.\nAfter that 90-minute briefing Hill and Canham then splintered off to carry out various one-on-one interviews with journalists from television and radio, of which more newsworthy snippets will no doubt emerge.\nThis was a day when lots of talk was required. Now it is about action and delivering on their intent.\nHow often has that been said about those in charge of Irish football?",
  "word_count": 3976,
  "scraped_at": "2026-02-14T12:04:17.361133"
}