{
  "article_id": "31b4720783cb",
  "url": "https://www.theadvocate.com.au/story/9163425/racing-rodeo-car-shows-and-the-circus-what-will-your-weekend-include/",
  "title": "Racing , rodeo , car shows and the circus : what will your weekend include ? ",
  "date": "20260129T060000Z",
  "domain": "theadvocate.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "SUMMERFEST\nSubscribe now for unlimited access.\nor signup to continue reading\nJanuary 30\nSummerfest is a free community event that offers opportunities to connect with community, celebrate local talent, embrace cultural diversity, and strengthen our amazing Pataway/Burnie community.\nThere will be live music, kids activities, food, art and stalls and community showcases.\nThe event runs from 2pm to 7pm at the Wiseman Street Reserve, Shorewell Park, which is located next to Burnie Community House.\nQUEEN FOREVER\nJanuary 30\nIn 2026, Queen Forever celebrated 20 years of electrifying live performances with their Greatest Hits Tour - 20th anniversary.\nThis isn't just a tribute - it's a full-scale rock spectacle that captures the very essence of Queen.\nThe show at the Burnie Arts Centre begins at 7.30pm.\nTickets cost $75 or $70 for subscribers.\nTo book, visit: https://www.burniearts.net/Whats-On/2026/Queen-Forever\nSLIPSTREAM CIRCUS\nUntil January 31\nGet ready for circus fun with Slipstream Circus.\nFrom a hour hour play session to learning new skills like trapeze and tumbling.\nThe circus has everything for you at the Ulverstone Sports & Leisure Centre on Flora Street.\nPrices start at $20 per session and more information can be found here: https://slipstreamcircus.org.au/january-holidays-2026/.\nCHALLENGERS CAR SHOW AND SWAP MEET\nJanuary 31\nHeld at the Forth Football Ground, the Challengers Car Show and Swap Meet will have every rev head excited.\nParking for both show cars and spectators is inside the Forth Football ground precinct.\nShow cars must be on site prior to 11am, show starts at 9am, presentations at 2pm.\nGround will be open at 7am for the swap meet starting at 7am.\nDEVONPORT HARNESS CUP\nJANUARY 31\nThe Devonport Cup is heading to the Ladbrokes Racing Centre in Mowbray because of no track in the city and it's shaping up to be a cracker.\nWhether you're a die-hard punter or just looking for a great night out with the crew, we've got you covered.\nEntry is free.\nULVERSTONE TWILIGHT RODEO\nJanuary 31\nA prominent fixture on the Coast for more than 60 years, the Ulverstone Rodeo is back.\nRanked as one of the top five Rodeos in Australia and attracting crowds in excess of 3,500 people, the event is sure to take you for a ride.\nHeld at Batten Park, 267 South Road at West Ulverstone gates will open from 1pm.\nThe junior rodeo and local events will kick of from 3pm while the main events will begin at 4pm.\nAll proceeds from the 50/50 raffle will go to Volunteer Marine Rescue Ulverstone.\nThis years program will list eight main championship events including the ironman event of rodeo, steer wrestling, the thrilling, dangerous and edge of your seat Bull Ride, and the hotly contested ladies Barrel Race to name but a few.\nMore information can be found here https://www.facebook.com/events/1155102260025853.\nROUNDHILL CLASSIC\nFebruary 1\nThe Burnie Yacht Club is hosting the last interclub event of the year.\nThis is an opportunity for juniors and apprentices on the Coast to get together and shine on the water.\nJuniors are 16 years old and under. Apprentices four years or less sailing experience. There is also an Apprentice and Coach division if someone would like an experienced sailor with them.\n$5 per person. If you aren't a junior or apprentice come along anyway, as the club will still be having normal Sunday sailing.\nMore information can be found here: https://www.burnie.tas.gov.au/Community/Whats-On-Events/2026/Roundhill-Classic-Burnie-Yacht-Club\nJERSEY FOREVER\nFebruary 6\nJersey Forever reunites the original four stars of the record breaking mega hit musical Jersey Boys.\nIt's been 15 years since the premiere Sydney production and now for the very first time in over a decade the boys join forces again to bring you the very best of Frankie Valli and The Four Seasons in a concert experience.\nGet ready to relive the magic of the iconic sound of Bobby Fox, Stephen Mahy, Scott Johnson and Glaston Toft as the boys come together for Jersey Forever.\nThe show at the Burnie Arts Centre begins at 8pm.\nTickets are $86 for premium tickets or $76 for A reserve.\nTo book, visit: https://www.burniearts.net/Whats-On/2026/Jersey-Boys\nPRIDE FILM FEST BURNIE 2026\nFebruary 7\nThis inaugural tour launches on with a matinee screening at the Burnie Arts Centre and will kick off with guest speaker Rodney Croome and MC'd by Pussay Poppins, Barry Bothways and Gary Snow.\nPride Film Fest. is a program of 90 minutes of LGBTIQ+ short films from Australia, Canada, UK and USA, curated for this tour by Queer Screen and produced by Side Quest.\nMore information can be found here: https://www.burniearts.net/Whats-On/2026/Pride-Film-Fest-Burnie-2026.\nPARTY IN PADDOCK\nFebruary 5 - 8\nThe countdown is on for the biggest party in Tasmania.\nWith a star-studded lineup featuring the likes of The Temper Trap, Ocean Alley,The Veronicas and Peking Duk.\nAlong with the awesome sounds across six stages, this three day festival will offer a number of experiences including yoga, a run club, a vibestown march, skate ramp, doof stick pageant and artist interviews.\nHeld at Quercus Park, 415 Oaks Road at Carrick, tickets are still up for grabs.\nMore information and tickets can be found here: https://www.partyinthepaddockfestival.com.au/.\nFESTIVAL OF KING ISLAND\nFebruary 13 - 14\nThe Festival of King Island is not just a music festival: it is a shared experience between artists, audiences and place.\nReturning after a one-year hiatus, this year's Festival of King Island (FOKI) features a day and a half of unforgettable music, world class local food and drink, and activities including yoga sessions, golf, surfing, and coastal walks.\nThe festival kicks off at 5pm on Friday, February 13 at Currie Harbour.\nTickets and information can be found at: www.foki.com.au.\nPENGUIN LIONS CLUB GARAGE SALE\nFebruary 14\nThe Penguin Lions Club will use a garage sale to raise money for Queensland flood victims and Victorian bushfire victims.\nThe club said funds raised would go to the Australian Lions Foundation Disaster Fund and that items for sale would be clean, quality and reasonably priced.\nThe sale will be in Park Street, Penguin and will run from 8am until noon.\nWARATAH WOODCHOPPING CARNIVAL\nFebruary 14\nTasmania's best axemen and women will feature at Waratah on February 14.\nThere will be free camping onsite, food and coffee stalls, children's activities, historical machinery and car and bike displays, a market and licenced bar.\nThis is a cash only event.\nEntry is $2 per person.\nThe event runs from 9am to 5pm.\nBURNIE INTERNATIONAL TENNIS TOURNAMENT\nFebruary 22 to March 1\nThe Burnie International tennis event features both men and women's draws from February 22.\nA gold coin donation is all it will cost you to see some high class tennis on the Coast.",
  "word_count": 1098,
  "scraped_at": "2026-02-14T12:38:33.232903"
}