{
  "article_id": "31bde2213f5c",
  "url": "https://news.yahoo.com/want-finish-why-bryson-barnes-180000893.html",
  "title": "  I want to finish it out : Why Bryson Barnes will quarterback the Utes in Las Vegas Bowl",
  "date": "20231207T184500Z",
  "domain": "news.yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "‘I want to finish it out’: Why Bryson Barnes will quarterback the Utes in Las Vegas Bowl\nThis article was first published in the Ute Insiders newsletter. Sign up to receive the newsletter in your inbox each Wednesday night.\nIt’s a bit of an unique situation, but it’s one that will work to the benefit of both Bryson Barnes and the University of Utah.\nBarnes entered his name into the transfer portal on Monday, but will quarterback the Utes in the Las Vegas Bowl against Northwestern on Dec. 23.\n“He wants to finish the season and he’ll be our guy in the bowl game,” Utah coach Kyle Whittingham said.\nIt’s not every day, though, that you see a player go into the portal and play in a bowl game for the school he’s transferring from. That often doesn’t happen, either because the player wants to avoid injury or because the coach won’t allow it.\nBarnes has had schools reach out to him after he entered his name into the transfer portal, but he’s still practicing with Utah and focused on helping the Utes to their first bowl game win since 2017.\nFor Utah, there’s a clear benefit to letting Barnes play one more game, even as he decides where he’ll be playing next season: The junior-signal caller gives Utah the best chance to get a win over Northwestern.\nBacking up Barnes in Sin City will be Luke Bottari, who stepped up as quarterback in the Utes’ regular season finale win over Colorado, scoring two rushing touchdowns. Steve Smedley is the lone quarterback behind Bottari with the Utes wanting to preserve Brandon Rose’s medical redshirt. If the Utes were in a dire situation where they were down to QB3, former quarterback Ja’Quinden Jackson would likely take over.\nAfter fulfilling his childhood dream to play for Utah, Barnes has been nothing but loyal to the program, grinding his way through without a scholarship at times. It comes as no surprise that he signed on for one more game.\n“I mean, these are the guys you grind through it with. You go through hell with each other and leaving these guys, in my own opportunities personally, I just feel like that doesn’t sit right with me. I just want to finish it out. Finish what we started with the guys,” Barnes said.\nBarnes walked onto the team in 2020 and did not see action, but in 2021 and 2022, he won the backup quarterback job. He played in Utah’s first Rose Bowl appearance against Ohio State after Cam Rising got injured in the fourth quarter, throwing a 15-yard touchdown pass with under two minutes remaining to tie the 2022 Rose Bowl at 45-all.\nIn 2022, he threw for 175 yards and a touchdown in a pivotal road win over Washington State after Rising was scratched right before the game, and then played in the 2023 Rose Bowl after Rising was injured in that contest.\nMore in Sports\nBarcelona fans tear into several players amid Atlético disaster\nWhen Rising missed the entire 2023 season while rehabbing his knee, it was Barnes who stepped in, helping the Utes to an 8-4 regular-season record.\nAfter a win over Florida to open the season — Barnes threw a 70-yard touchdown pass to Money Parks on the first play from scrimmage for Utah — he was benched after a poor performance against Baylor, which led to Nate Johnson starting the next three games.\nBut Barnes kept his head down and kept working, regaining the starting job before the game against Cal.\nIt wasn’t all great — Barnes had his share of poor performances the rest of the season — but he did have some stellar games, like against USC, when he led a game-winning drive, including a 26-yard run to set up the deciding field goal from Cole Becker.\nHe played in 10 games in 2023, starting eight, and threw for 1,517 yards, 12 touchdowns and nine interceptions on a 59% completion rate.\nImportantly, Barnes proved that he could be a starting quarterback at a Division I program, whether that be a Power Five school or a Group of Five school.\nWith Rising coming back for 2024, Barnes felt like it was time to move on. He has two more seasons of eligibility remaining.\n“(With) Cam coming back, I’m going to go explore other opportunities. I definitely want to finish it out with my guys, these are the dudes I’ve been with since Day 1. Just because my decision (is) to leave, I’m not going to leave (them) hanging for a bowl game, I want to finish it out,” Barnes said.\nOne more game of film for potential suitors in the transfer portal, plus quarterbacking the team he’s given so much to one more time, made playing in the bowl game an easy decision for the Milford native.\n“He wants to finish what he started and he also wants to have a chance to be a starting quarterback, and with Cam coming back, barring injury, that would not happen here,” Whittingham said. “And so we wish him all the best. He gave a ton to this program, got his degree. He’s a guy that we wish nothing but the best for and have a lot of gratitude for what he gave to the program and we’re grateful that he’s playing one last game with us.”\nIn his conversation with Whittingham about transferring, Barnes brought up the idea of staying for the bowl game, and Whittingham agreed.\n“The conversation was there. It was kind of just like on mutual ground. They kind of expected me to play the game and I wanted to play as well,” Barnes said.\nFor one last time, on Dec. 23, Barnes will put on the Utah uniform and walk out onto the field with his teammates.\n“I’m just going to miss it all,” Barnes said.\n“I mean, I’m playing this game for my guys. At the end of the day, what I’m really going to remember is the relationships that I’ve built and the friendships that I’ve made that are going to last forever regardless. One day I might forget the football games, but the relationships, those are going to stay on forever.”\nIn case you missed it\nAfter Barnes, Johnson and Mack Howard entered into the transfer portal, here’s a look at the quarterback situation behind Rising for 2024.\nFrom the archives\nRelated\nExtra points\nUtah wide receiver Devaughn Vele declares for the NFL draft (Deseret News)\nUtah will face Northwestern in Las Vegas Bowl (Deseret News)\nUtah’s Sataoa Laumea will play in the Senior Bowl. What does that mean for his NFL draft chances? (Deseret News)\nUp next\nDec. 7 | 5 p.m. | Women’s basketball | Saint Joseph’s | @ Philadelphia, Pennsylvania\nDec. 8-9 | All day | Track and field | BYU December Invitational | @ Provo\nDec. 9 | 5 p.m. | Men’s basketball | BYU | @ Salt Lake City\nDec. 10 | 12 p.m. | Women’s basketball | vs. South Carolina | Hall of Fame Showcase | @ Uncasville, Connecticut\nTimes MST",
  "word_count": 1185,
  "scraped_at": "2026-02-14T13:10:28.175973"
}