{
  "article_id": "31ecbaceca6e",
  "url": "https://www.mauinews.com/wire/?category=5190&ID=370937",
  "title": "What are Gaelic games and how are they producing NFL hopefuls in kicking and punting ? | News , Sports , Jobs",
  "date": "20250924T174500Z",
  "domain": "mauinews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "What are Gaelic games and how are they producing NFL hopefuls in kicking and punting?\nBy KEN MAGUIRE AP Sports Writer\nIreland’s indigenous sports are called Gaelic games, and Gaelic football in particular features kicking skills that can transfer to American football via placekicking and punting.\nA growing number of Gaelic football players are giving American football a shot, either through college programs or the NFL’s international player pathway program.\nBefore the Pittsburgh Steelers face the Minnesota Vikings at Croke Park in the first regular-season NFL game in Ireland, here are some facts about Gaelic games and the players trying to reach the NFL:\nWhat are Gaelic games?\nGaelic football, hurling and camogie (women’s hurling) are the most popular. All three 15-a-side sports are played on a rectangular field with goals and goal posts rising above — like uprights in American football. In each sport, scoring in the goal is worth three points; through the uprights is one point. Gaelic football recently added a 2-point score for kicks from certain parts of the field.\nGaelic football is a bit like rugby — no pads and plenty of collisions. It differs in ball movement. Players can possess and advance the ball but must bounce or kick it to themselves at least once every four steps. They can kick or hand pass to teammates. You score primarily by kicking the ball into the net or through the uprights. Like in soccer, free kicks are awarded for fouls. The ball is slightly smaller than a soccer ball.\nHurling and camogie are described as a combination of lacrosse, field hockey and baseball. Helmets and face masks are worn. The ball is called a sliotar. The wooden stick is a hurley. The Gaelic Athletic Association says hurling is ” one of the oldest field games in the world … with the first literary reference dating back to 1272 BC.”\nThe Irish government offers ” 5 things Americans should know about Gaelic games.”\n“Our games are a way of life for a lot of people. They’re the quintessential expression of Irishness for lots of people and Croke Park is the epicenter of that relationship,” GAA head of communications Alan Milton said.\nGaelic games occasionally cross over into popular culture: Irish actor Paul Mescal has popularized GAA shorts.\nWhat is the Gaelic Athletic Association?\nThe GAA, founded in 1884 as part of a revival of Irish nationalism and culture while under British rule, oversees 1,600 local clubs across the island of Ireland and 500 more abroad promoting Gaelic football, hurling, handball and rounders. Camogie and women’s Gaelic football have their own organizations but there’s an initiative to fully integrate them into the GAA by 2027. The Camogie Association was founded in 1904 when women’s sports options were limited.\nWhat are the salaries for Gaelic players? Zero\nGaelic games are amateur sports, so players don’t get salaries. Many players have jobs or are university students. Club-level players move up to compete for their counties. The inter-county competitions culminate each summer in the All-Ireland finals, which capture the attention of the nation. Star players can land endorsement deals, but the Gaelic Players Association said typical inter-county athletes lose money each year due to out-of-pocket expenses. For comparison, Pittsburgh Steelers linebacker T.J. Watt’s average annual salary is $41 million.\nWho are the Gaelic players trying to make it in the NFL?\nSeveral Gaelic footballers are fighting for NFL spots as kickers. Jude McAtamney of Northern Ireland is on the New York Giants practice squad. The Rutgers alum was elevated to the active roster for one game last season and hit a 31-yard field goal in a 27-22 loss to the Washington Commanders.\nCharlie Smyth is on the New Orleans Saints practice squad. From County Down in Northern Ireland, Smyth kicked a 52-yard field goal in a preseason game. He came through the NFL’s international player pathway program, as did Mark McNamee. The Dubliner is on the practice squad of the Green Bay Packers, who already have Irish-born punter Daniel Whelan — he moved with his family to the U.S. as a teenager.\nThere’s a trend of Irish kickers and punters in college football, too. Kildare’s Sean O’Haire is a kicker for Maryland. Northern Ireland’s Adam-McCann Gibbs, who can kick and punt, has committed to Penn State for 2026. Galway native Andy Quinn, whose first love was rugby, is a kicker/punter for Boston College. David Shanahan punted for Georgia Tech. Tadhg Leader runs a program that identifies and trains the Irish hopefuls. Soccer and rugby — both popular in Ireland — also offer transferrable foot skills.\n“We are really at the tip of the iceberg here — there’s so much Gaelic football talent,” said Michael McQuaid, host of the Irish Steelers Podcast.\nJack Grealish says Gaelic football ‘toughened me up’\nEngland soccer star Jack Grealish, who is of Irish descent, played Gaelic football in his youth. He told the Sports Direct TikTok page that it “toughened me up.” Indeed, a key part of Grealish’s game in soccer is absorbing contact and winning fouls. Noel Gallagher confirmed to the Irish Times that he once played at Croke Park for a Manchester team. The Oasis star was back at the stadium this summer during the band’s reunion tour.\n___\nAP NFL: https://apnews.com/hub/nfl",
  "word_count": 879,
  "scraped_at": "2026-02-14T13:21:54.296878"
}