{
  "article_id": "31f3ae243ab5",
  "url": "https://www.srqmagazine.com/articles/2339/2026-35-Under-35",
  "title": "2026 35 Under 35 - Feature :: SRQ Magazine Article by Competition Produced by SRQ Magazine",
  "date": "20260131T084500Z",
  "domain": "srqmagazine.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "We are proud to celebrate this year’s 35 Under 35 Honorees, a group of driven young professionals who represent the next generation of leaders making a powerful impact across our community. Through their creativity, commitment and entrepreneurial spirit, they are helping shape a stronger, more connected region. Beyond their professional accomplishments, their influence inspires others to lead with purpose and possibility. PRODUCED BY SRQ MEDIA | COMPILED BY LAUREN SUTTER | Photography by Wyatt Kostygan\nFranchesca Angotti\nOwner & Graphic Designer, Angotti Design\nHow did you make your start in your profession?It all started when I was “the creative kid” in third or fourth grade. I began putting together my classmates’ poster board presentations for $10 each. At the time, I didn’t realize it was graphic design, but over the years I always gravitated toward visually organizing things.\nWhat aspect of your work do you find the most meaningful? Educating people, business owners and organizations about the power of a well-designed and intentional brand. Teaching these groups the importance of brand strategy, consistency and authenticity as it pertains to their brand, helping better position a business both internally and client facing. When you take the time to educate people, they better understand the importance of investing in themselves so their target audience will invest in them. That creates an unstoppable force for company culture and brand trust.\nWhat makes the Sarasota-Bradenton area such a great place for young professionals? This area is like an entrepreneurial playground for all ages, but especially professionals. The possibilities are endless and there is a strong growth mindset here. The power of connection is incredible because you meet so many people from all over. If you want to start a business, there are resources to help you. If you want to try a new career, there are many opportunities to learn and grow into it. Like anything else, you get out what you put in, and this area is worth the effort and time because it is a powerful, connective place.\nWhat is the most spontaneous thing you’ve ever done?I am known for booking international trips on a whim with very little time to plan. I love it!\nAmanda Baar\nCommunity Impact Coordinator,\nAdventure For All\nHow did you make your start in your profession? My path into nonprofit work wasn’t the one I originally planned. Five years ago, I was about to graduate with a degree in dental hygiene when I was unexpectedly diagnosed with a brain tumor. After brain surgery and months in the hospital, my perspective shifted dramatically. I knew I wanted a career that truly made a difference in people’s lives. That led me to become the operations manager at Rise and Nye’s, a coffee and ice cream shop creating meaningful job opportunities for individuals with exceptionalities. When the shop closed, I carried that same passion into my current role at Adventure For All, where I help run outdoor adventure programs for individuals with exceptionalities. What began as a detour from my original plan has become my calling.\nWhat aspect of your work do you find the most meaningful? The most meaningful part of my work is building spaces where individuals with exceptionalities can grow, belong and be celebrated for their strengths. This mission is also deeply personal for me—my youngest brother, Joey, was born with Down syndrome. Through my work, I’ve been able to witness the amazing things he is capable of, including riding 35 miles on his gravel bike, camping, hiking new trails and helping coach his peers. Watching him and others achieve milestones that society often assumes are out of reach is the greatest reward.\nShare with us a local topic or trend that you are concerned about. One local trend I’m concerned about is overdevelopment in the Sarasota–Bradenton area. While growth can bring opportunity, the rapid pace has put pressure on our natural spaces, farmland and waterways—the very things that make this community special. My extended family has farmed here for over 50 years and I’ve seen how unchecked growth has changed the land and impacted our way of life. At the same time, this growth has helped transform Sarasota into a vibrant place to live, with new opportunities, businesses and cultural experiences. The challenge is finding balance, embracing progress while protecting our natural beauty.\nWhat movie, show or cartoon character would you like to play in real life and why? I’ve always been a true-crime person, so this one’s easy, I’d choose Detective Olivia Benson from Law & Order. She’s strong, grounded and has this incredible way of showing compassion while still getting the job done.\nWhat’s your favorite board game or video game? I’m a classic Yahtzee girl!\nAlyssa Barnsley\nSenior Associate of Brand Strategy,\nGulf Coast Community Foundation\nWhat mistake in your career taught you the biggest lesson? It’s easy to want to finish a project as quickly as possible, but that doesn’t always push us to our fullest potential. I found myself making mistakes in routine tasks because I was so used to doing things a certain way that I wasn’t checking or challenging myself. I thought I could get it done and move on. When I stopped and questioned why I was still doing it that way, it opened new possibilities for approaching the work in a more exciting way. I want to keep growing and thinking creatively about every project. When we fall into routine, we limit our natural creativity and don’t give ourselves the time to breathe and imagine.\nShare with us a local topic or trend that you are concerned about. Working for a community foundation, I see and hear about the needs and challenges our community faces every day, from affordable housing and mental health resources to environmental concerns and dwindling support for local arts organizations. The common thread that concerns me most is a misunderstanding of each individual’s role. Too often, we talk about issues without getting to the root of the problem or how we can work together to solve them. Each area for growth in our community is interconnected. People may think an issue doesn’t affect them, so they ignore it or stop listening, without realizing it impacts them in some way. Everything in our community is part of a system that creates opportunities for change and I want to keep working to help people understand that each of them has a role to play.\nWhat is your favorite podcast or YouTube Channel? Every day, I listen to History Daily, a podcast that explores events that happened on that specific day in history.\nWhat are the top three items on your bucket list? Travel to Barnsley—a town in England (and yes also my last name), Go on an African safari, cage dive or free dive with sharks\nAadi Bhensdadia\nHigh School Student at Pine View School\nHow did you make your start in your field?I started inventing because I was a lefty. My first experience with engineering and research came in elementary school, when my fourth-grade science teacher, Mr. Maron, required all his students to participate in the school science fair. I spent days thinking about a problem I could solve until one morning, while reaching across the bathroom sink with my left hand to put my toothpaste on the shelf on the right side, I knocked my toothbrush into the sink. Any reasonable person would have kept their toothpaste on the left side, but I decided it would be better to overengineer a pneumatically actuated toothpaste squeezer. As my worldview broadened, so did the problems I wanted to solve. I have made bike safety systems, heart valves, organs-on-a-chip and more. And it all started because I wanted to squeeze toothpaste with my left hand.\nShare something you did this past year to balance your work and personal life. Something I love doing is cycling through the county on the Legacy Trail. Almost every day, I put down whatever I’m working on, regardless of how much is done, and hit the trail for about an hour. The simple act of going somewhere is something most people don’t really think about, but commuting through nature to a place—whether it’s crowded or completely deserted—gives you a new point of view. If I bike ten miles, I feel like I’m looking at my life and my work from ten miles away. Any time you change your physical location, you change your perspective allowing you to relax and come up with new ideas.\nWhat makes the Sarasota-Bradenton area such a great place for young professionals? For young professionals in biomedical engineering, the best part about being based in Sarasota is the ability to see the impact of your work. We’re known for having a large elderly population, and that population needs healthcare technologies that are advancing at a rapid pace through the work of biomedical scientists and engineers. Seeing the impact of what you do increases your innovative potential, and in my field, no place provides that motivation like SRQ.\nWhat is the most spontaneous thing you’ve ever done? When we were hiking a few years ago, my dad and I decided to jump into a frozen lake. We didn’t have a towel or a change of clothes, and needless to say, I would prefer to have some preparation beforehand next time.\nCoy Carter\nHuman Resources Director,\nHarborview Health Center Sarasota\nHow did you make your start in your profession? I started in my profession with a passion for helping others. Human Resources provided the perfect platform to do that by hiring, training and developing employees who are central to achieving our mission of providing the best clinical outcomes for our residents. After earning my degree in organizational leadership, I became deeply interested in company culture and how it shapes the rhythm and success of an organization.\nWhat aspect of your work do you find the most meaningful? The most meaningful part of my job is hosting Orientation. It marks a fresh start in each new hire’s journey and sets the tone for who we are as an organization. I enjoy laying the foundation and sharing our values, expectations and culture. What’s especially rewarding is seeing those same employees grow into leadership roles later on. It shows that the message shared on day one truly resonates and that our commitment to development and alignment is making a real impact.\nWhat is your guilty pleasure? My guilty pleasure is my love for wings. No matter what kind of day I’ve had, wings always hit the spot. My go-to place is Brewster’s — they have some of the best wings in the city of Sarasota.\nNicholas Cichielo\nAthletics Director, State College of Florida, Manatee-Sarasota\nWhat aspect of your work do you find the most meaningful? I love working with the athletes and students. There is no greater joy for me than serving as a mentor to them. They come to me as 17- and 18-year-old kids, and I get to help guide them on their journey to becoming productive members of society. I often say I won’t know how successful I am at my job until five to ten years from now, when my athletes have graduated, started careers, gotten married and had kids.\nWhat makes the Sarasota-Bradenton area such a great place for young professionals?This is a great area, especially for sports. There is so much to do and see. I’ve been involved in the Leadership Manatee program and Manatee Young Professionals, and I’ve never been in another county that so intentionally supports young professionals and their leadership development. It is truly remarkable.\nShare with us a local topic or trend that you are concerned about. I am concerned about the lack of affordable housing. This area has experienced tremendous growth and with that, housing prices have skyrocketed. A home that once sold for $250,000 is now in the $500,000–$600,000 range. Apartment rent ranges from $1,700 to $3,400 per month, while wages have not kept up with inflation. There are people in this county with good, full-time jobs who are struggling to afford their rent or mortgage. I want to help establish more cost-controlled housing in Manatee County.\nWhat is your formula for success? Be relentless, think outside of the box, push the envelope and go after what you want with everything you have.\nCheyanne Clark\nOwner, brsh Salon\nWhat aspect of your work do you find the most meaningful? The most meaningful part of my work is being able to make someone’s day, whether it’s through a haircut, recommending the right brush or providing a calm and inspiring space to be in. Helping people feel seen, heard and empowered through their hair and their experience is something I never take for granted. When someone comes into the salon feeling a certain way but leaves refreshed, inspired and rejuvenated, that is the absolute best.\nWhat mistake in your career taught you the biggest lesson?One of the biggest lessons I’ve learned is to never take people or opportunities for granted. I started in this industry at 16 and didn’t yet understand the level of compassion and grace required to truly make someone’s day. Over time, I learned that being a hairstylist means showing up for people, even when they may not be at their best. This growth in empathy hasn’t always been easy, but it has been incredibly rewarding. You never know what someone is going through when they sit in your chair. Listening, showing kindness and being present make the difference. One of the most meaningful lessons I’ve learned is the power of investing in people, emotionally and personally.\nShare something you did this past year to balance your work and personal life. When you’re building a brand and growing a business, it’s easy to get lost in the work and become stressed. Instead of focusing on how much I had to do, I started focusing on how blessed I am to get to do it. That small mindset shift, from this is a lot to this is a blessing, has changed how I approach my work and my personal life. When I talk to friends or family, I try to speak about my work with positivity and gratitude instead of stress. When I start to feel overwhelmed, my husband and I take short weekend trips to reset, which has been amazing for both of us and the business.\nJuliana Cristina\nDirector of Development + Marketing,\nSarasota Contemporary Dance and\nCEO of Wicked Cosmetics\nWhat aspect of your work do you find the most meaningful?The most meaningful part of my work is creating beauty and seeing how it reflects on both myself and others. I love how a single act of innovation, whether a performance, a story or a beauty product, can spark a ripple of inspiration that motivates people to express themselves and share it with their community. Blending creativity with purpose and witnessing how it moves and connects people is what keeps me passionate every day.\nShare with us a local topic or trend that you are concerned about. Over the past few years, water quality in our area has noticeably decreased, raising concerns about public health and the environment. Factors such as population growth, industrial runoff and inadequate infrastructure have contributed to contamination in local water sources. This decline affects not only drinking water but also aquatic life and overall ecosystem balance. Strengthening water management practices, improving treatment systems and promoting community awareness are essential steps toward restoring our local water quality\nWhat is your formula for success? My formula for success is rooted in discipline, consistency, gratitude and alignment. I show up for myself every day because discipline sets the standard and consistency turns small habits into big results. I stay grateful because gratitude keeps me grounded and focused on what matters most.\nWhat movie, show or cartoon character would you like to play in real life and why? I’d choose Lady Mary Crawley from Downton Abbey. She’s poised, confident, loyal, the perfect blend of elegance and strength. She carries herself with grace but never lets anyone underestimate her.\nWhat is your guilty pleasure? Charcuterie Boards and High Tea.\nSarah Denison Williams\nCommunity Education Manager,\nBig Waters Land Trust\nShare a recent achievement for which you are most proud. I’m most proud of launching the inaugural Bay Explorers Summer Experience, a free, all-inclusive environmental education program for teens hosted by Big Waters Land Trust. As the program’s designer and lead instructor, I guided it from idea to reality, writing and winning a competitive Bay Partners Grant from the Sarasota Bay Estuary Program, coordinating a robust network of environmental professionals and community organizations and ensuring every detail, from curriculum design to daily logistics, supported our goals of equity, access and deep engagement with nature. Over two weeks, we engaged 20 underserved teens in hands-on outdoor learning, many experiencing kayaking, snorkeling and birdwatching for the first time, while connecting them to local ecosystems, cultural history and environmental careers in Sarasota and Manatee Counties.\nWhat aspect of your work do you find the most meaningful? The most meaningful part of my work is watching people experience that moment of realization, when they see that nature isn’t something “out there,” separate from us, but something we’re all deeply a part of. I love seeing the shift when someone connects the dots between their everyday choices and the health of the land, water and wildlife around them, and understands that those things, in turn, shape their own well-being and quality of life.\nShare with us a local topic or trend that you are concerned about. I’m deeply concerned about the rapid loss of natural areas and farmland across our region. Unsustainable development threatens every aspect of our lives, from clean water and wildlife habitat to food security and public health, especially as we face the accelerating impacts of climate change. Once these lands are gone, they’re gone forever. Protecting open space isn’t just about conservation, it’s about ensuring a resilient, livable future for everyone in our community.\nWhat is the most spontaneous thing you’ve ever done? Right after college, I left everything familiar behind and moved to Jamaica to serve in the Peace Corps. It was a huge leap of faith, equal parts terrifying and transformative, and one of the best decisions I’ve ever made.\nWhat is your favorite podcast or YouTube Channel?Podcast: Ologies with Alie Ward\nWhat’s your favorite board game or video game?My favorite game is Magic: The Gathering. I love how complex and strategic it is, the way different cards and colors work together to create unique combinations. The artwork and design are incredible, and I especially enjoy building themed decks inspired by nature.\nJohna Desrosiers\nBusiness Development, Preferred SHORE\nReal Estate and President of Women’s Council of REALTORS Sarasota\nShare a recent achievement for which you are the most proud. One recent achievement I’m most proud of is being elected President-Elect of the Women’s Council of REALTORS Sarasota Network for 2025. This honor reflects the trust my peers have placed in me and my dedication to leadership, mentorship and community building within our industry. In this role, I have the opportunity to impact the real estate community through leadership development, education, networking and referrals, helping Realtors® grow their businesses and strengthen professional relationships. It also allows me to make a meaningful difference in our broader community by partnering with charities such as Solve Maternity Homes, Suncoast Charities for Children and Selah Freedom. Through this position, I help curate impactful events like Celebrity Bartending, the 31st Annual Fashion Show and Taste of Thunder.\nWhat makes the Sarasota-Bradenton area such a great place for young professionals? As a true Sarasota local born at Sarasota Memorial Hospital 31 years ago, I’ve experienced firsthand what makes this city so special. Growing up here meant being immersed in a vibrant culture of theater, music and the arts. From the Van Wezel Performing Arts Hall to the Sarasota Opera House, the ballet and countless galleries and community theaters, creativity and inspiration are everywhere. This artistic energy shapes the community and attracts people who value innovation and self expression. I’ve been part of Sarasota’s theater scene from a very young age, singing and performing to sold-out audiences at the Sarasota Opera House and The Players Theatre. One of my most memorable moments was sharing the Van Wezel stage with Kristin Chenoweth. These experiences deepened my connection to the community and its thriving arts culture.\nWhat is your favorite podcast or YouTube Channel? My favorite YouTube channel belongs to one of my favorite pastors, Stephanie Ike O.\nWhat is your guilty pleasure? My guilty pleasure is singing full Broadway ballads in my car like I’m headlining a show at the Met. It is free therapy, and the steering wheel has never judged me.\nLaura Dykstra\nCommunity Impact Specialist,\nCommunity Foundation of Sarasota County\nShare a recent achievement for which you are most proud. In my role at the Community Foundation of Sarasota County, I’m honored to contribute to the future success of students pursuing post-secondary opportunities. In September, I had the privilege of sharing the collaborative work and student impact our region’s funding partners have achieved through our local scholarship providers network on a national platform. I was proud to represent the Community Foundation and co-present with Kiarra Womack from the Selby Foundation to participants across the country. We also received incredibly positive feedback for our webinar with the National Scholarship Providers Association, Bridging Funding Partners to Elevate Scholarship Opportunities and Student Success.\nHow did you make your start in your profession? I remember running up and down the aisles of SPARCC’s Treasure Chest as a little girl, helping my grandmother and other volunteers sort donations in the back room and prepare care packages of essentials for the shelter’s newest arrivals. These experiences instilled in me a desire to serve my community from an early age and have been a guiding light throughout my career. It’s wonderful to now serve the community by supporting scholarships and grantmaking at an organization whose core mission is creating a community where everyone can thrive.\nWhat is the most spontaneous thing you’ve ever done? When I lived in the Hague, I once hopped into a car to travel to Poland with a new friend that I had just met the day before. She was from Wroclaw and had to go back to take care of a few things and invited me along to join her and her friends on the road trip. I could have found any number of reasons to say no, but something told me not to bother. That spontaneity led to not only a beautiful trip across three countries but a life-long friend and a reminder to always stay open to adventure.\nWhat movie, show or cartoon character would you like to play in real life and why? I could see myself as Merida from Brave. First off, I already have the hair. And, who wouldn’t want to gallop at full speed through the moody Scottish Highlands?\nWhat is your favorite podcast or YouTube Channel? @ourportuguesehomestead. Lea and Maarten are friends from my university days, so I love catching up with their videos, which detail their life with their two beautiful children on an old, abandoned olive grove in Portugal. It brings me such joy to see them live out their dreams.\nRenee Ferreira\nMarketing & Events Director, Big Cat Habitat\nHow did you make your start in your profession? With a degree in advertising and mass communications, I initially started by helping friends with small businesses come up with fresh marketing ideas. It allowed me to apply what I had learned in a hands-on, meaningful way. At the same time, I’ve always had a deep love for animals, so when the opportunity at Big Cat Habitat came along, the timing was perfect.\nWhat aspect of your work do you find the most meaningful? Knowing that I’m making a difference, not just in the lives of the animals we care for but also in the lives of the people they touch. There’s something incredibly powerful about the connection between humans and animals. Whether through education, conservation or simply giving someone a moment of joy during their visit, I see firsthand how these experiences inspire compassion, awareness and healing.\nShare with us a local topic or trend that you are concerned about. The rapid growth and development in Sarasota and the possibility of losing the unique character and charm I grew up loving. I was born and raised here and now I’m raising my own kids in the community. Over the years, I’ve seen tremendous change and while growth brings new opportunities, I hope we can find a way to preserve what makes Sarasota such an amazing place to live and raise a family. It’s important to maintain a balance between progress and the close-knit, welcoming community that defines this area.\nLordana Guillaume\nStudent Success Coach and PLANit\nSarasota Coordinator, Education Foundation of Sarasota County\nShare a recent achievement for which you are the most proud. I am most proud of the students I get to help every day. For some, that means one impactful conversation that changes their outlook. For others, it means walking alongside them through the college admissions process over one or two years. Teenagers and young adults are my favorite group to work with because they are full of potential and possibility. I see it as both my responsibility and my privilege to help them recognize that within themselves. Watching their eyes light up when they realize what’s possible gives me immense pride each day.\nWhat makes the Sarasota-Bradenton area such a great place for young professionals? As a transplant from Miami, my move to Sarasota-Bradenton four years ago brought what I like to call “reverse culture shock.” Transitioning from a large, fast-paced city to a smaller one was an adjustment, but one that surprised me in the best way. What makes this area so great for young professionals is its close-knit, collaborative community. There’s a wealth of opportunity in a relatively compact area and many of those opportunities come through organizations that work closely together. This interconnectedness allows for organic networking, especially for those who prefer collaboration over formal mixers and makes it easy to build skills and relationships in a natural, authentic way.\nShare with us a local topic or trend that you are concerned about. I am deeply passionate about educational access and equity, ensuring all students are equipped with the knowledge and tools to confidently pursue their postsecondary pathways. We live in a time of unprecedented opportunity and information, but that abundance can also be overwhelming. Many students struggle to discern what’s right for them amid conflicting advice and pressure. It’s critical that students and their families are provided with accurate, comprehensive guidance so they can make informed decisions about their futures.\nCaleb Jackson\nDirector of Strategic Partnerships,\nORE Development\nHow did you make your start in your profession?My career has had many starts and stops, however it truly began when Tom Bozzuto, Founder of the Bozzuto Group, became my mentor and eventually my first limited partner. His support gave confidence to many, allowing us to become a top 15 owner of apartments and student housing at Johns Hopkins University. The second start of my career came when I joined ORE Development, where my skill set, deal flow and relationships expanded exponentially.\nWhat aspect of your work do you find the most meaningful? Relationships. Having a team of partners you’re tackling opportunities and solving problems with makes every day enjoyable. The close relationships with our investors, who enable us to pursue opportunities, are extremely rewarding.\nWhat makes the Sarasota-Bradenton area such a great place for young professionals?\nWhat I love about Sarasota is that nearly everyone I’ve met here has a growth mindset. I didn’t find it hard to make friends, especially with the large entrepreneurial community. There’s also a robust fitness community where people are focused on bettering themselves spiritually, financially and physically.\nIf you could compete in an Olympic sport, which one would it be? When I lived in Jamaica, I trained with Olympic Track and Field athletes, if I could do it all over again, I would do tennis only.\nLoren Jean Baptiste\nEarly Childhood Coach Team Lead,\nChildren First, Inc.\nWhat aspect of your work do you find the most meaningful? Leaving the classroom was one of the hardest decisions I’ve made, but coaching allows me to influence quality and outcomes on a larger scale. I still get to witness those “lightbulb moments” when teachers master a new strategy or when a child’s progress reflects that growth. I also find deep meaning in creating professional development experiences that are creative, relevant and responsive to teachers’ needs. I see my role as a bridge between research and practice, translating what we know about high-quality early learning into tools and strategies that work in real classrooms.\nWhat is your formula for success? My formula for success is tapping into what you’re most passionate about and putting intentional effort behind it. To me, success is doing work that feels aligned with your purpose. When you pursue what fulfills you, you create a life without regret. It quiets doubt because you’re anchored in who you are and what you’re called to do.\nShare with us a local topic or trend that you are concerned about. The limited access to affordable, high-quality child care in Sarasota County. The cost of care has become prohibitively high, with infant care often exceeding $1,500 per month, while many providers are closing classrooms due to funding and staffing challenges. As an early childhood coach in Sarasota County, I see firsthand how this lack of access impacts both families and providers. Every week, I work with teachers and programs doing their best to meet children’s needs, yet many centers struggle to stay fully staffed or keep classrooms open, especially for infants and toddlers. Families often share that even when they find care, the cost can exceed their rent or mortgage, forcing some to leave the workforce or rely on unstable arrangements. These challenges ripple through our local economy, reducing workforce participation and placing additional strain on early learning programs already stretched thin.\nWhat movie, show or cartoon character would you like to play in real life and why? Khadijah James from Living Single! She’s a natural leader who builds community, uplifts the people around her, and leads with confidence and heart. Khadijah balances ambition with authenticity.\nCiara Johnson\nOwner & Speech-Language Pathologist,\nCiara Johnson Speech Therapy LLC\nHow did you make your start in your profession? I began my career working for a nonprofit in Jacksonville, where I was part of a grant-funded program that screened thousands of children in low-income areas for speech and language disorders. This experience gave me a strong foundation in early identification and intervention, as well as a deep appreciation for the importance of access and equity in care. I later moved to Sarasota and joined Johns Hopkins All Children’s Hospital, where I received valuable training in feeding disorders as well as language and literacy, further expanding my clinical expertise. After the birth of my daughter, I created my own private practice.\nWhat aspect of your work do you find the most meaningful? The most meaningful aspect of my work is coaching and empowering parents to support their children during everyday, naturally occurring routines. A single therapy session each week can only go so far, but when families feel confident and equipped to embed strategies into daily life, progress becomes continuous and lasting. Helping parents realize they are their child’s best advocate and most powerful teacher is truly priceless and seeing the difference it makes in a child’s growth brings me the greatest joy.\nWhat is your favorite podcast or YouTube Channel? I have a bit of a fascination with true crime, so my favorite podcast is Crime Junkie. I love how the hosts tell each story with empathy and attention to detail, and it’s my go-to when I am folding laundry.\nIf you could compete in an Olympic sport, which one would it be? It would be rowing. I rowed in middle and high school for the Sarasota Scullers Youth Rowing Program. I have always loved how peaceful the water feels and how rhythmic and meditative rowing can be.\nCourtney Johnson\nOwner, Physician Assistant Certified (PA-C),\nThe Mangrove Regenerative Health\nShare a recent achievement for which you are the most proud. I’m deeply proud of founding The Mangrove in January 2025 to address a critical gap in Sarasota’s healthcare landscape. There is a growing need for accessible, cutting-edge, patient-centered care to help patients look, feel and perform their best. I built the business from the ground up to deliver personalized, high-quality care focused on healing joints, enhancing athletic recovery, rejuvenating skin and restoring hair through preventative and regenerative treatments like PRP and PRF.\nWhat aspect of your work do you find the most meaningful? Empowering patients to feel, look and perform their best through regenerative medicine and using their own bodies to heal. Seeing tangible results by addressing root causes, rather than simply treating disease, and helping people realize their potential is profoundly rewarding. Witnessing the motivation and transformation of patients through personalized treatments for both systemic and focal health is truly inspiring.\nWhat makes the Sarasota-Bradenton area such a great place for young professionals? Personally, I’m drawn to the natural beauty and outdoor-oriented lifestyle. I thrive on a boat or beach day, hiking at one of our many nature preserves or paddleboarding through the mangroves. The job market is thriving with extensive entrepreneurial opportunities that give back to the community. It feels safe, it’s clean and it’s beautiful year-round. What’s not to love?\nZoe Kasper\nOwner of Crane Content Co.\nShare a recent achievement for which you are the most proud. Taking the leap to become a full-time business owner in July 2025. I started my business last summer as a creative outlet while working full time, never imagining it would grow so quickly. What began as a passion project has turned into a thriving agency serving clients across multiple industries and I couldn’t be more proud. Stepping away from the security of a salaried job to chase my dream has been equal parts terrifying and exhilarating, but it’s easily one of the most rewarding decisions I’ve ever made.\nWhat aspect of your work do you find the most meaningful?Helping small business owners bring their dreams to life. Many know they need to grow their online presence but aren’t sure where to start and I love being the person who helps make that happen. Seeing their excitement when new clients walk through the door because of their social media or when they start gaining real traction online truly fills my cup.\nWhat makes the Sarasota-Bradenton area such a great place for young professionals? This area doesn’t make you choose between career and life. You can build your business or grow in your industry and still be steps from nature, culture and community. Living in Lakewood Ranch and working throughout Sarasota, I get to experience the best of both worlds, the energy of a growing city and the warmth of a connected community. I love how this area is full of passionate small business owners who genuinely support one another. There’s so much room here to follow your passion, build something meaningful and truly thrive, both personally and professionally.\nWhat movie OR show character would you like to play in real life and why? If I could play any character in real life, I’d be Lorelai Gilmore. She’s quick-witted, warm, community-driven, and builds something meaningful from her own grit and creativity. She leads with heart, brings people together, and proves you can be ambitious without losing your personality or authenticity.\nChad Louk\nOwner, Prodigy Pest Solutions\nHow did you make your start in your profession? My scout master as a child owned a local pest control company and I was able to secure a job working with him right out of high school. I fell in love with helping people and taking care of client relations. After just three years in the industry, I took the leap and started my own.\nWhat aspect of your work do you find the most meaningful? My employees—hearing their success stories, like buying a house, taking their first vacation out of Florida, finding stability in their lives—that’s what keeps me going. I love knowing that what I’ve built has changed the lives of more than 100 people who took a chance on me to provide them with a job and a place to call home.\nWhat mistake in your career taught you the biggest lesson? Early on, I learned that missing an opportunity can make all the difference in becoming a successful entrepreneur. The biggest mistakes are often the ones you never realize you made by not taking a chance. Any opportunity offered should be pursued to its fullest.\nShare with us a local topic or trend that you are concerned about. Sarasota is great, but my concern is that we focus too much on new development and the coastal area, and not enough on our historic downtown or the older neighborhoods that built this city. We shouldn’t abandon our roots and more infrastructure and funding should be directed to these areas.\nMichael Manoogian\nOwner and Co-Founder, MM Interiors\nShare a recent achievement for which you are most proud. Starting my own interior design company and winning a National Aurora Award for design at just 22 years old.\nWhat is your formula for success? I’ve found that prioritizing the happiness and well-being of others above financial gain, recognition or status has a profound and tangible effect.\nWhat is your favorite podcast or YouTube Channel? Baby this is Keke Palmer is truly my favorite. She asks real, genuine, friend like questions. I’ve truly never seen notable celebrities be so relaxed in a space like that.\nWhat movie, show or cartoon character would you like to play in real life and why? Borat. He is extremely funny, super quick whitted, and sometimes even raunchy. What I find in common with him is not being offended easily, saying whatever I want, and just being authentic.\nShare the top three items on your bucket list. Visit Antarctica; I’m forever fascinated by it. I’d love to visit my home country of Armenia. I’m deeply rooted in my culture and it feels like a crime that I haven’t been there yet. To design and launch my own furniture line.\nCraig McGonigal\nDirector of Membership Engagement,\nThe Greater Sarasota Chamber of Commerce\nShare a recent achievement for which you are most proud. The Sarasota Chamber of Commerce being recognized by ACCE, the Association of Chamber of Commerce Executives, as a Top 3 Chamber in the United States and Canada for the second year in a row. This recognition reflects the importance of the work we’re doing in our community and honors our entire team for the dedication they bring day in and day out. In addition, the Sarasota Chamber was named Florida Chamber of the Year in 2024 by FACP, the Florida Association of Chamber Professionals, and recently became a 5-Star Accredited Chamber by the U.S. Chamber of Commerce, an honor held by fewer than 2 percent of chambers nationwide. Being a small part of that success brings a smile to my face, but sharing it with our entire team and knowing they played an even bigger role makes me especially proud.\nWhat mistake in your career taught you the biggest lesson? A mistake I made when I was younger was taking criticism too personally. If you have a good mentor, leader or boss and they are “criticizing” you, they aren’t putting you down or saying you’re doing a bad job. You have to shift your mindset and realize they are trying to help you improve. A good leader will push you and has likely been through experiences you may be facing for the first time. They want to see you succeed, not fail. It’s not criticism, it’s a growth opportunity.\nWhat is your formula for success? Showing up each and every day, no matter the circumstances. Having a routine and staying consistent with my schedule helps me stay focused during the week. I’m a morning person, so I love starting the day before the sun comes up and before most people are thinking about work. This allows me to catch up on anything I didn’t get to the day before and plan for the day ahead.\nWhat is your favorite podcast or YouTube Channel? I’m a huge sports fan, so I have anywhere between 8-10 different podcasts that I listen to throughout the week. My favorite would be Green Light with Chris Long, a former football player who spent 11 years in the NFL, 2 of them with my favorite team, the Philadelphia Eagles.\nIf you could compete in an Olympic sport, which one would it be? Now that golf is an Olympic sport, I’d love to participate in it, notice how I didn’t say compete. I’d get absolutely smoked out there, but it would be an incredible experience to play a new course and be side by side with the world’s best.\nAnna McLean-Joynson\nInternational Keynote Speaker & Consultant\nHow did you make your start in your profession? I’m incredibly grateful to be one of the few who can call their work their true passion. I fell in love with rowing at school and never imagined it would become not just my lifestyle, but my career. I loved being on the water, the early sunrises and always wanting to stay out longer. One day I asked myself, “What’s the furthest someone can row?” The answer, across an ocean, sparked a dream many said was impossible. From that moment on, I had a vision I couldn’t let go of. Turning that vision into reality meant launching a campaign and asking my brother to join me, which led to The Seablings. What followed were years of hard work, from sponsorships, branding and fundraising to intense physical and mental training. That simple question has now taken us across both the Atlantic and Pacific Oceans and earned three Guinness World Records along the way. The journey taught me that everything starts with a clear vision. Today, I’m grateful to have built a profession around that purpose, using my story through consulting and keynote speaking to help others define their vision, navigate challenges and pursue their own impossible goals.\nWhat makes the Sarasota-Bradenton area such a great place for young professionals? From a very young age, I’ve recognized that what makes our home so special is the multi-generational community we foster. I know nowhere else where so many generations naturally mix across ages, perspectives and experiences and because of this, our community is thriving. Over the years, I’ve built a wonderful network of genuine, accessible friends who want to see you succeed and open doors to help you grow. From established leaders and business owners who have built incredible legacies to community organizations such as Rotary and Sertoma, Sarasota is a place where older generations collaborate with young professionals eager to innovate and give back.\nWhat is the most spontaneous thing you’ve ever done? Whilst rowing at Clemson, our coach told us to “stay active” over the summer but gave us no set training plan. Having never cycled more than around a park, I bought a road bike and cycled the entire length of the United Kingdom, from Land’s End to John O’Groats (LeJog). I covered 913 miles over 12 days, carrying all of my kit and camping along the way. Turns out, whenever I get an idea in my head, there’s only one thing to do, give it a go.\nWhat movie, show or cartoon character would you like to play in real life and why? Moana! A girl with big dreams, a love for this world, and the courage to chase what is beyond the horizon. I’ve been known to sing her song “How Far I’ll Go” at karaoke a few times. It captures that spirit perfectly. Fearless, determined, and guided by vision, she reminds me that when you trust your inner voice and follow it, you will always find your way.\nSteven Moore\nReal Estate Professional\nMichael Saunders & Company\nShare a recent achievement for which you are the most proud. Being part of several condominium projects in Downtown Sarasota—it’s a proud moment to drive or walk past and see a building I was involved with from conception to completion. Last year, I was part of the development team behind the highest-sold property on Siesta Key, a milestone I’m proud to have been part of.\nShare with us a local topic or trend that you are concerned about. Attainable housing is one of Sarasota’s biggest challenges and one we must solve to keep great talent here. Too many people in key industries leave because housing affordability simply doesn’t exist. The only real way forward is through creative collaboration, developers, local government and employers working together to finance projects that truly work. Allowing greater density in strategic areas can also help create more attainable options. Right now, housing costs put a strain on essential sectors such as medical, hospitality, education and emergency services. Without a coordinated effort on the development side, it’s nearly impossible to make these projects pencil out, especially in and around our downtown core.\nIf you could ask someone any question, who would the person be and what would be your question? Jeff Bezos. “What was the one thing that made you go all in on Amazon?”\nWhat’s the most spontaneous thing you’ve ever done? A couple of years ago the football team I support in England had a huge game on a Saturday afternoon. I booked a flight Thursday night, worked Friday, headed to the airport and flew to England. Watched my team play on the Saturday with my mum, had dinner with family that evening and flew back to Sarasota on Sunday to be back at work Monday morning.\nJacqueline Nie\nMarketing and Communications Specialist,\nLake Erie College of Osteopathic Medicine\nHow did you make your start in your profession?I actually started out in broadcast journalism. After graduating from the University of Kentucky, I jumped right into being a news reporter. It was exciting and fast-paced and taught me how to think on my feet, build connections quickly and tell stories that mattered to people. Over time, I realized what I loved most wasn’t just reporting the news, it was the storytelling itself. I wanted to use those same skills to help organizations and communities connect with their audiences in a more intentional way, which led me into marketing and communications. Since then, I’ve had the opportunity to work across industries, but what excites me most now at LECOM is telling stories that not only highlight events and initiatives but also make a real impact for students, donors and the community.\nWhat aspect of your work do you find the most meaningful? The most meaningful part of my work is seeing how it directly impacts people. At LECOM, so much of what I do, whether it’s promoting the Student Scholarship Fund Gala or creating content around our community events, comes back to helping students pursue their education and future in healthcare. I get to be part of the bridge between donors, community members and students. When I watch a student meet someone who contributed to their scholarship, it makes all of the behind-the-scenes hours worth it. It’s not just about planning events or sending out campaigns. It’s about creating connections that open doors for future doctors and healthcare leaders.\nShare something you did this past year to balance your work and personal life. This past year, I made a conscious effort to set healthier boundaries around my time. Working in events and communications means there’s always something happening and it’s easy to let work spill into evenings and weekends. I realized I wasn’t giving myself the same level of attention I was giving my projects. To find more balance, I began prioritizing routines outside of work, taking long walks after working in the office, joining friends for group workouts and making space for family dinners without checking my phone. I also became more intentional about scheduling downtime after big events so I could recharge. These changes may seem small, but they’ve helped me show up at work with more energy and creativity.\nEthan Notestine\nVice President at Trinity Custom Homes\nWhat aspect of your work do you find the most meaningful? Being able to give people what they want and, at times, guide them toward something even better. Project owners want to build their dream home through an enjoyable process with a contractor who can streamline decisions and open new possibilities. Builders within my company want to learn, grow in their roles and understand what their future careers can hold. Tradespeople want their work to be efficient and rewarding. My wife wants her husband to provide a stable income and come home with a sense of fulfillment and joy. Ultimately, what’s most meaningful in my work is providing, through organization and forethought, a better present and future for as many people as I can.\nShare something you did this past year to balance your work and personal life. This past year, to bring more balance to my work and personal life, I took up photography and videography as a hobby, focusing on capturing my family’s life. That’s a fancy way of saying I bought a good camera to take better photos and make home movies of our goofy little family having fun. Since those moments can be fleeting, my wife and I wanted to be sure we captured more of them. Learning the skills to do so has been rewarding in itself.\nWhat makes the Sarasota-Bradenton area such a great place for young professionals? What makes the Sarasota area so great for young professionals is the new wave of young people in what has historically been a retirees’ town. I’ve personally seen an influx of young professionals who value family and authenticity moving to the area. This younger population will help foster a revival of art and architecture in Sarasota.\nWhat is your favorite podcast or YouTube Channel Maybe a little embarassing but my favorite YouTube channel is Kara and Nate.\nWhat movie character would you like to play in real life and why? Definitely Ferris Bueller.\nCaroline Odell\nMarketing Coordinator,\nFawley Bryant Architecture\nHow did you make your start in your profession? A writer and artist since elementary school, I built the ability to conjure a story from thin air whenever I wanted. In marketing, that’s the foundation of making your voice heard. Tug at the heartstrings here, sound smart there, say it in less than six words, keep it succinct. Before graduating college, I was already looking for jobs. I hadn’t held internships, instead devoting my free time to nonprofit leadership, which strengthened me in many ways but left me lacking corporate experience. I accepted a position close to home as an Admin and Accounting Coordinator at Fawley Bryant Architecture. It didn’t take long before I transitioned to the marketing side, stepping into a role with much to learn and a three-decade legacy to uphold. Over the past year, I’ve experienced tremendous personal and professional growth. A few years ago, I didn’t know the first thing about how municipalities contract with service providers. Now, I manage that process for a multi-million-dollar firm, from identifying bid opportunities to winning projects.\nWhat makes the Sarasota-Bradenton area such a great place for young professionals? The world needs more opportunities for human connection. I believe our local area has made a genuine effort to address disconnection and build natural, meaningful communities. I’m involved with the Sarasota Chamber Young Professionals Group and Manatee Chamber Young Professionals Group, active in my church and its ministries and part of several young adult social groups, including a book club, craft club and run club. The Sarasota-Bradenton area offers a rare balance of city, suburb and rural life. Within thirty minutes, you can be at the beach, in a cow pasture, at a traveling Broadway show or walking downtown. As the population continues to grow, many new arrivals are young professionals drawn by education, the arts, walkability, lifestyle and opportunity. They see potential for business growth, entrepreneurship and mentorship, but what truly attracts them is the promise of connection.\nWhat is your guilty pleasure?Setting an early alarm before I actually have to wake up, just so I can lay in bed for a little while and not feel pressed to get up immediately.\nWhat is your favorite podcast or YouTube Channel? I listen to YouTube videos while I craft and create. Lately, that’s been mainly Ted Talks, Unreported World, Business Insider and Ascension Presents.\nAlyssa Orme\nVice President and Senior Trust Officer,\nCaldwell Trust Company\nHow did you make your start in your profession? Coming out of college, I was a bright-eyed, ambitious graduate, ready to take on the world but unsure where to start. Through the recommendation of a dear friend and colleague, Debbie Smith, I began my journey in wealth and asset management. With her guidance, along with the support of many others, I discovered a passion for helping people with their estate planning and financial goals.\nShare something you did this past year to balance your work and personal life. This past year, I made one of the toughest decisions of my life by leaving the corporate banking and trust world that I knew inside and out and joining a family-owned trust company here in Sarasota. In the short time I’ve been with Caldwell Trust Company, I can confidently say this is where I belong. Caldwell truly advocates for work-life balance. If my dog is sick, I’m encouraged to take the time I need. If my dad has surgery, they step up and help manage my workload. If I want to volunteer with a local organization, they ask how they can support me.\nWhat’s the first job you’ve ever held? My first job was a server at Frisch’s Big Boy in Cold Spring, KY\nWhat makes the Sarasota-Bradenton area such a great place for young professionals?The Sarasota-Bradenton area is an attractive destination for young professionals thanks to a mix of career opportunities, a strong networking scene and a vibrant lifestyle that blends culture and outdoor recreation.\nWhat is your guilty pleasure? Late night, fresh out of the oven break-and-bake chocolate chip cookies.\nChristine Pelosi\nGeneral Manager, Gecko’s Hospitality Group\nHow did you make your start in your profession? From a young age, I’ve always loved creating experiences around food. As a kid, I played “restaurant” with my family and as I got older, I began planning and preparing real meals for them. Seeing people enjoy the meals I prepared sparked a passion that never left me. When it came time to choose where I would attend college and what to major in, my mom said, “You’ve been doing this your whole life, why not make a career out of it?” That led me to the University of New Hampshire, where I earned my bachelor’s degree in hospitality management from the Peter T. Paul School of Business and Economics.\nWhat aspect of your work do you find the most meaningful? I take great pride in developing and empowering my team, watching individuals grow in confidence, take on new responsibilities and achieve their goals. Leading a team toward shared success, from building strong morale and a positive workplace culture to achieving operational and financial goals, is incredibly fulfilling.\nIf you could compete in an Olympic sport, which one would it be? It would undoubtedly be downhill ski racing. Having grown up as a ski racer, I’ve always been drawn to the intensity of the sport. The combination of speed, precision and sheer mental focus makes it a discipline I deeply admire and would be thrilled to pursue at the highest level.\nErik Pendleton\nCo-founder and CEO of Rewired Technologies\nWhat aspect of your work do you find the most meaningful? The most meaningful part of my work is when a client who took a chance on us comes back a few months later and says, “You completely changed the game for us.” Hearing that their business is growing faster than ever and that they feel genuinely supported, not just serviced, makes it all worth it. At Rewired, we don’t just run ads, we build relationships. We do this because we believe small business owners, the ones grinding every day to support their families and teams, deserve the same level of strategy, technology and growth opportunity as the biggest brands in the world. Watching those partnerships evolve from cautious beginnings into genuine friendships and long-term success stories is what drives me.\nWhat mistake in your career taught you the biggest lesson? The biggest mistake I made early in my career was waiting for someone else to elevate me, for a mentor, a partner or an opportunity to “find” me. I eventually realized that growth doesn’t come from permission, it comes from ownership. The moment I decided to take the bull by the horns and create my own momentum, everything changed.\nWhat movie, show or cartoon character would you like to play in real life and why? Saul Goodman from the Breaking Bad universe — Jimmy McGill—is one of the most legendary sales guys ever. Sure, he often uses his powers for the wrong reasons, but by the end of his character arc, he finally chooses the right path. Jimmy is a reminder that socially powerful people can use their gifts for good or for harm. We should all choose good.\nWhat is the most spontaneous thing you’ve ever done? When I was 14, my dad and I made a last-minute trip to Canton, Ohio to watch Dan Marino get inducted into the Pro Football Hall of Fame. It was a life-changing experience and a memory I’ll always cherish with my old man.\nWhat’s the first job you’ve ever held? Bus boy at Dry Dock Waterfront Grill.\nShare the top three items on your bucket list. Hike the Appalachian Trail from start to finish. Find “The Beach” in Thailand (a real one). Attend a Miami Dolphins Super Bowl.\nIvan Richards\nSVP Commercial Banker, Truist\nShare a recent achievement for which you are the most proud. Personally, becoming a father for the first time has been one of the most grounding and transformative experiences of my life. It reshaped my sense of purpose, as suddenly every decision carries more meaning. It’s taught me patience, perspective and what it truly means to lead with empathy. Professionally, earning my title as Senior Vice President in Commercial Banking was an incredible milestone. It wasn’t about the title itself, but what it represented, a decade of building trust, driving results and helping businesses thrive.\nHow did you make your start in your profession? My journey began with relationships and curiosity. I started in retail, learning the fundamentals, helping families, solving problems and understanding leadership from the ground up while building strong relationships. Along the way, I met a mentor who saw potential in me and gave me my first leadership opportunity.\nShare with us a local topic or trend that you are concerned about. As living costs continue to increase and purchasing power weakens, I see how this quietly pressures families, business owners and nonprofits in our community. Local businesses are forced to manage rising input costs and shrinking margins while employees face higher living expenses without proportional wage growth. The result is a widening gap between economic optimism and financial reality. I believe it’s more important than ever for professionals, especially in finance, to lead conversations around fiscal sustainability, sound investment and long-term resilience.\nJustin Senior\nAttorney, Shumaker, Loop & Kendrick LLP\nHow did you make your start in your profession? I started as a Shumaker summer associate in 2016 and quickly realized I could do national-caliber work with a local-firm feel. From day one, I was exposed to hands-on, collaborative strategy, high-stakes litigation and real client interactions. Shumaker invested in me and my future and I’m grateful for mentors who trusted me with meaningful responsibility early on. Sarasota sealed the deal, offering a relaxed Gulf Coast pace while serving high-level clients, a growing arts and innovation scene and proximity to so many great destinations. At the end of that summer, Shumaker offered me a full-time position upon graduation from law school and I accepted. I’ve been here ever since, growing into a practice that handles complex and sophisticated matters and fast-moving injunction work, while staying rooted in the close-knit culture and community that first drew me in.\nShare something you did this past year to balance your work and personal life. It’s uncommon for me to take much time off, but this year was a welcome exception. I got married and had an incredible two-week honeymoon traveling across Italy. I also made a point to prioritize travel despite a busy year, taking multiple trips to visit family in Connecticut and California. Learning to balance work and life early matters, especially for young professionals, because the habits you build in your first five years often become your operating system for the next twenty. The result is better work product, steadier leadership and relationships, at home and with clients, that you can truly build on.\nWhat is your formula for success? Being process-oriented. Identifying what I need to do to achieve something and having the discipline to execute, while remembering that outcomes can be distractions. You can’t control outcomes, but you can control the processes that tend to create positive ones.\nTal Siddique\nCounty Commissioner,\nManatee County Government\nHow did you make your start in your profession? Prior to politics, I learned from my time in the tech industry that you have to tell a story with the data you have and not make assumptions about how people interpret it. Coming into politics, where data can often be sidelined in favor of agenda, it’s important to ground conclusions in facts. Doing so helps build legitimacy and gain consensus.\nWhat aspect of your work do you find the most meaningful? When people tell me during conversations that they feel their concerns are being heard. You wouldn’t believe how often I hear people say they’ve never heard from their local officials or had anyone canvass their doors.\nWhat is your formula for success? In business, politics and life, don’t let the “no’s” wear you down. I remember canvassing homes during the 2024 election cycle and being told to go away before I even had the chance to introduce myself. If I had stopped campaigning after my first, or even my one-hundredth, “no,” I wouldn’t be a commissioner today.\nWhat’s the first job you’ve ever held? As a teenager, and well into my college years, I used to spend my weekends selling used cars on Craigslist and eBay. I’d also help the auction record bids (and learn how to keep up with auctioneers) and help settle any disputes between bidders and auctioneers.\nNate Sweetman\nSports Marketing Manager,\nVisit Sarasota County\nShare a recent achievement for which you are the most proud. Earning my Sports Tourism Strategist designation through Sports ETA. Sports tourism is one of the fastest-growing and most dynamic sectors in the tourism industry and as someone who lives and breathes this field every day, I wanted to deepen my knowledge and elevate how I serve both our local community and visiting athletes. Between January and September 2025, I completed all 32 required credits toward the STS designation. Courses included Introduction to Sports Tourism, Sports Tourism Business Strategy, Event Management, Sports Sustainability and The PR/Media Landscape. Earning the designation of “Nate Sweetman, STS” represents not just a professional milestone, but a personal commitment to continuous growth and leadership within the industry.\nWhat aspect of your work do you find the most meaningful? Seeing an event’s vision come to life from start to finish. In sports tourism, no two events are the same. We support more than 80 annually and each one brings a new set of challenges, partnerships and opportunities to showcase our destination. Whether it’s coordinating promotional items, connecting organizers with local photographers or pitching stories to media outlets, I love being part of the full process that helps an event succeed. There’s a real sense of joy and purpose in knowing that my work directly contributes to the athlete experience, community engagement and economic growth in Sarasota County. Seeing that impact unfold firsthand reminds me why I’m so passionate about this industry.\nShare with us a local topic or trend that you are concerned about. The overall state of tourism in Florida and how legislative decisions can impact the industry. Tourism supports more than two million jobs statewide and saves Florida residents an average of $1,900 annually in taxes. Redirecting these funds could shift the tax burden to residents and potentially jeopardize the state’s income tax-free status. Issues like this surface often and serve as reminders of how important it is to stay engaged. Working in sports tourism, I’ve seen firsthand how this industry fuels jobs, supports small businesses and showcases what makes Florida special. That’s why I believe in closely monitoring state and local actions, advocating for our profession and educating decision-makers on the vital role tourism plays in sustaining Florida’s economy and community well-being.\nMichelle Thomas\nPartner & Board Certified Pediatric Dentist,\nPediatric Dental Specialists of Florida\nShare a recent achievement for which you are the most proud. Creating Pediatric Dental Specialists of Florida with my partner, Dr. Robbie Harrell. Our practice is unique in that it will serve the underserved children of our community who require dental treatment under general anesthesia due to their young age, extensive treatment needs, inability to cooperate, special health care needs or a combination of these factors. Previously, children in Sarasota County needing this level of care often had to travel hundreds of miles to receive it. We decided to start the practice when we were told there were more than 1,000 children requiring this treatment in Sarasota County each year. Bringing this specialized service to our community has come with challenges, but we have remained steadfast in our mission.\nWhat is your formula for success? At Pine View School, they taught us the power of “The Extra Degree.” Like water turning to steam, one extra degree of effort creates power and momentum that can make all the difference. At 211°F, water is hot, but it isn’t until it reaches 212°F that it transforms into steam, capable of generating electricity, launching aircraft off carriers and even sterilizing dental instruments. That extra degree of effort is often the single step that makes a huge difference. Beyond that, I’m a big believer in the saying, “nothing ventured, nothing gained.” It never hurts to ask and persistence paired with hard work is always key to success.\nIf you could compete in an Olympic sport, which one would it be? Sailing! I raced sailboats competitively from age 11 through college. In high school, I sailed with the Pine View Sailing Team at Nationals in 2006 and 2007 and went on to sail in regattas all over the country at the varsity level with the University of Florida Sailing Team, where I eventually became team captain. After graduating undergrad, I focused fully on dental school, but it’s been exciting to watch and cheer on many of the sailors I raced with and against at the Olympic level. While I certainly don’t plan to pursue an Olympic career myself, I do hope to get back into sailboat racing locally.\nMadeline Tympanick\nSenior Associate Director of Center\nfor Career Engagement & Opportunity,\nNew College of Florida\nWhat aspect of your work do you find the most meaningful? Collaboration. At the heart of everything I do is the opportunity to build connections that empower others, students, colleagues and community partners alike. I collaborate with students as they explore and define their career paths, helping them translate their experiences into purpose. I partner with faculty to integrate career development into the classroom, ensuring learning extends beyond the academic experience. I also consult with employers to design impactful recruitment pipelines and internship programs.\nShare with us a local topic or trend that you are concerned about. Retaining young, promising talent in the Sarasota-Bradenton region. I see firsthand the impact of connecting students with local internships and work-based learning opportunities. These experiences help students envision a future career here at home and increase the likelihood they’ll stay in the area after graduation, supporting local employers and contributing to the region’s economic vitality.\nWhat’s the first job you’ve ever held? As a teenager, I got my first taste of entrepreneurship through babysitting and selling handmade jewelry. What began as a small creative hobby quickly grew into something bigger. I started partnering with local shops, including the beloved Persnickity Cat, which proudly featured my pieces. Before long, I wasn’t just supplying the store, I was working there, opening and closing the shop and helping showcase the work of other local artists.\nWhat is your guilty pleasure? Right now, my guilty pleasures are Dancing with the Stars and The Secret Lives of Mormon Wives. Between the glitter, the plot twists, and all the over-the-top drama, I can’t help but be completely entertained. SRQ",
  "word_count": 11608,
  "scraped_at": "2026-02-14T12:38:27.981868"
}