{
  "article_id": "31fbd1142749",
  "url": "https://www.hogshaven.com/2024/1/20/24037775/daily-slop-20-jan-24-adam-peters-faces-roster-decisions-with-jamin-davis-jon-allen-tress-way",
  "title": "WFT News : Washington Commanders News Links",
  "date": "20240120T154500Z",
  "domain": "hogshaven.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Daily Slop - 20 Jan 24: Adam Peters faces tough roster decisions with veterans like Jamin Davis, Jon Allen & Tress Way\nA collection of articles, podcasts & tweets from around the web to keep you in touch with the Commanders, the NFC East and the NFL in general\nArticles\nWashington Post (paywall)\nTracking the Washington Commanders’ coaching search\nWho are the candidates? Who has interviewed? What are the next steps?\nJohnson to interview Friday\nBen Johnson, the Detroit Lions’ offensive coordinator, is scheduled\nto interview via Zoom on Friday, a person with knowledge of the team’s plans said. The Lions host the Tampa Bay Buccaneers in a divisional playoff game Sunday afternoon.\nOnly virtual interviews are allowed with head-coaching candidates before the conclusion of the divisional round of the playoffs. Candidates whose teams are not in the playoffs and or had a first-round bye were allowed to interview virtually before wild-card games begin. Those who did have first round games can begin to interview virtually three days after their wild-card game, but before the start of the divisional round.\nAs with the primary executive hiring process, teams must hold in-person interviews with at least two external candidates who are people of color or women.\nA head-coach candidate cannot agree to a contract with another team until his season has concluded.\nWeaver interviewed\nAnthony Weaver, the Baltimore Ravens’ assistant head coach and defensive line coach, had a virtual interview with the Commanders Thursday, a person with knowledge of the team’s plans said.\nMacdonald interviewed\nRavens defensive coordinator Mike Macdonald also interviewed last week, another person confirmed.\nHead-coaching interview requests\nJohnson: The 37-year-old helped revive the career of quarterback Jared Goff and turned the Lions’ offense into one of the more prolific in the NFL over the past two seasons. He takes an analytical approach and has 12 years of NFL coaching experience, including seven (2012 to 2018) with the Miami Dolphins.\nWeaver: Weaver was a second-round pick by the Ravens and spent seven years playing in the NFL. As a coach, he has bounced from the Jets to the Bills, Browns, Texans and Ravens over the past 12 seasons, coaching the defensive line.\nMacdonald: Macdonald has spent the past decade with a Harbaugh. He was with John for seven seasons in Baltimore, starting as a defensive intern and working his way up. Then he worked for Jim in 2020, serving as Michigan’s defensive coordinator. Then he went back to John. Over the past two seasons, Baltimore’s defense has ranked among the top five in total yards, rushing yards, scoring, opponent third-down conversion rate and defensive red-zone touchdown rate.\nAaron Glenn, Lions defensive coordinator: Glenn spent 15 seasons in the NFL as a cornerback, then dabbled in personnel before shifting to coaching. After seven seasons as a defensive backs coach in Cleveland and New Orleans, he was hired to his current role with the Lions in 2021.\nRaheem Morris, Los Angeles Rams defensive coordinator: The longtime defensive coach spent three years in Washington (2012 to 2014), leading its secondary. He was the head coach of the Buccaneers from 2009 to 2011 and was the interim coach of the Falcons in 2020. Morris won his first Super Bowl as a quality control coach on Jon Gruden’s Tampa Bay staff and his second as the Rams’ defensive coordinator.\nDan Quinn, Dallas Cowboys defensive coordinator: Quinn has 21 years of NFL coaching experience and a lengthy track record with elite defenses. He helped lead the Seattle Seahawks and their “Legion of Boom” secondary to back-to-back Super Bowls, then spent six years as head coach of the Falcons, taking them to the Super Bowl in his second season. Dallas’s defense had top-five finishes in total yards, passing yards and points under his tutelage last season.\nBobby Slowik, Houston Texans offensive coordinator: Slowik began his NFL coaching career with Washington as a video assistant and then spent three years as a defensive assistant, working closely with former pass rusher Ryan Kerrigan. Slowik switched to offense in 2021 as a passing game specialist on Kyle Shanahan’s staff in San Francisco. In Houston, he has turned one of the worst offenses in the league a year ago into the seventh-best passing attack in 2023 with rookie C.J. Stroud at quarterback.\nWashington Times (subscription)LOVERRO: Goal is everyone on same page, asking same question: What’s best for franchise?\nif Peters is as smart as he seems to be, the irony of his taking the general manager’s job for a football team that was a nightmare for Kyle Shanahan couldn’t have been lost on him.\nThis is another reason why Peters, the assistant general manager with the 49ers, where he spent seven years, was probably the best choice for Washington. Likely none of the other candidates that Harris’ star-studded search committee came up with knew better than Peters what this organization has been through for more than 20 years.\nI’m sure Harris’ search committee, given their success in finding the candidate who was on everyone’s list (ESPN reported Peters turned down general manager interviews with the Titans and Cardinals last year and both the Raiders and Chargers had requested interviews this year) will search the globe looking for the right coach.\nFormer NFL general manager Randy Mueller wrote in The Athletic that the Peters hiring was a “no-brainer” and Harris agreed.\n“It was a pretty easy decision from my point of view,” the owner said Tuesday. Yet Sports Illustrated reported that one of Harris’ search team consultants, former Vikings general manager Rick Spielman, was on the phone “from 7:30 a.m. to 11 p.m. checking every box on the five guys he’d identified.”\nThis Herculean phone effort sounds awfully familiar.\n“Over the next 3½ months, (Ted) Leonsis said he spoke to 78 people in professional sports and beyond, seeking to learn where he had erred and how he should reconstruct the Wizards into a modern sports organization.” That’s from a 2019 article in the Washington Post.\nThen Leonsis hired Tommy Sheppard in the room next door to be his general manager.\nYou see, I think Peters already knows who he wants to be his coach. I think he’s known it for a while in those daydreams when he envisioned himself as the top guy in a football operation.\nHopefully, owner, general manager and the coach-still-to-be-hired all end up on that same page. Because, again, every day, the question for all the decision-makers should be, “What’s the best thing for the franchise?”\nJamin Davis’ fifth-year option\nJamin Davis enters his fourth season in 2024. That means the Washington Commanders will need to decide on whether to exercise the team option for a fifth year by March. If they choose to do so, the linebacker will be owed somewhere in the neighborhood of $13 million in 2025.\nThis is far from guaranteed. If the Commanders do not exercise the option, he will play out the remainder of his contract in 2024. Barring a negotiated extension, Davis will become a free agent when the season is over.\nDavis’ case may be the most important example of what I mentioned earlier. Has the former first-round pick failed to develop because he was over-drafted, or because he has been poorly coached?\nTress Way’s future\nThis one hurts.\nTress Way has been the Washington Commanders’ most consistent player over the past decade. After Brandon Scherff fled town a few years ago for the Jacksonville Jaguars, the punter was the team’s only legitimate shot at getting someone into the Pro Bowl.\nThat’s generally the mark of a bad football team - when your punter is your best player. But that’s what we were left with.\nWay will be 34 years old at the start of next season. He is currently the third highest-paid punter in the league, making more than $3 million per season. I hate to say it, but he is no longer one of the three best punters in the league.\nHe was not especially good in 2023, finishing in the bottom half of the league in both yards-per-punt and net yards per punt. On the flip side, he was still pretty good at pinning opponents deep. He was such a good holder on kicks that long-snapper Camaron Cheeseman probably survived a few extra weeks due to Way’s excellence.\nHowever, there are at least 15 punters in the NFL all in their 20s who had arguably better seasons than Way. It may be time to find somebody new. But that is one of many items on Adam Peters’ to-do list during what’s sure to be a baptism of fire in his first offseason as Commanders general manager.\nPodcasts & videos\nThe Coaching Search Continues; Jon Allen | John Keim Report\nLocked on Commanders: Washington Commanders Head Coach Candidates Mike Macdonald and Bobby Slowik Face Off | Free Agents\nNFC East links\n[O]n the first day of the 2024 league year, Prescott’s cap number will skyrocket from $26.832 million in 2023 to $59.455 million. The Cowboys have no real choice but to extend his contract before then, in order to chop down the massive cap charge.\nWhen the Cowboys opted in early 2021 to avoid Dak playing under the franchise tag for a second year and then Kirk Cousins-ing his way to unrestricted free agency in early 2022, the Cowboys signed Dak to a four-year contract, $160 million contract that necessarily would force them to eventually sign him to another deal, ideally after 2022 (it didn’t happen, even though the Cowboys wanted it to) and at the latest before the $59.4 million cap charge kicks in on March 13.\nThe Cowboys can’t trade him. While he’s due to make only (only?) $34 million in 2024, a pre-June 1 trade would trigger a $61.9 million cap charge. Cutting him before June 1 would result in the same dead money number for 2024.\nBeyond the leverage that comes from the $59.4 million cap number for 2024 is that, given the structure and terms of the deal, the Cowboys can’t tag him in 2025. (Even if they could, the cap number would be 144 percent of his 2024 cap number — $85.5 million — since the Cowboys applied a second franchise tag before he signed his extension.) Thus, he’ll be an unrestricted free agent next March, without an extension.\nAnd even if they decide to deal with the $59.4 million cap number and let him become a free agent in March 2025, they’ll still have to deal with $36.46 million in dead money from the contract next year. That’s more than the $35 million Tom Brady left behind this year for the Buccaneers.\nSo, basically, the Cowboys are screwed. Dak knows it. He knew it three years ago, and he did what Jerry would have done. Why wouldn’t Dak do this year the same thing Jerry would do?\nNFL league links\nArticles\nNBC Washington\nExplaining the NFL’s playoff overtime rules for 2024\nThe new rules are aimed at leveling the playing field in high-stakes matchups\nWhen did the NFL change playoff overtime rules?\nThe Philadelphia Eagles and Indianapolis Colts proposed an updated set of playoff overtime rules for 2023, and that rule change was passed after a 29-3 vote by the NFL owners. This will be the second year with the new playoff overtime rules in place.\nWhat are the NFL’s playoff overtime rules?\nOK, here we go. The updated NFL playoff overtime rules are as follows:\n- There will still be a traditional coin toss, with the road team choosing either heads or tails. Whichever team wins the coin toss will have the option to kick off or receive the ball.\n- Both teams will have an opportunity to possess the ball.\n- If the score is tied after each team has possessed the ball, the next score wins and the game becomes sudden death.\n- If the team kicking off to start overtime scores a safety on the receiving team’s initial possession, the team that kicked off is declared the winner.\n- There are no coaches’ challenges in overtime. The only reviews will be initiated by the replay official.\n- Each team gets three timeouts for every two overtime periods (30 minutes total). So, if the game goes into triple overtime, timeouts will reset to three for each team.\nWhat happens if you tie in overtime in the NFL playoffs?\nWhile regular season games can end with an even score after a 10-minute overtime period, ties can not happen in the playoffs.\nPostseason overtime periods are 15 minutes. If the score is still tied after 15 minutes, the two teams start another 15-minute period until the result is decided. The second period is played like a regulation second quarter, where the team that had the ball at the end of the first period gets the ball at the same yard line to begin the second.\nWhat team wants the ball first with the new overtime rules?\nThis is where things could get tricky.\nIn previous years, the team that won the coin toss would almost certainly choose to receive the ball. If they could just score a touchdown, the game would immediately end and their defense wouldn’t even have to take the field. The team that won the coin toss was 10-2 in 12 overtime playoff games from 2010 to 2022, with seven of those 10 winners scoring on the first possession.\nThat could change now, especially if a team trusts their defense. The rules bring out plenty of hypothetical questions that coaches could now have to answer in real time:\n- Does the first team with possession ever settle for a field goal? Or do they go for it on every fourth down?\n- If the first team scores a touchdown, do they kick the extra point or go for two?\n- If the second team is down seven and scores a touchdown, would they tie the game or go for two and the win?\nWith there being no overtime playoff games last season, teams could be thrown into the fire and have to make those decisions for the first time this year.",
  "word_count": 2355,
  "scraped_at": "2026-02-14T12:41:22.772726"
}