{
  "article_id": "321d2dc74869",
  "url": "https://www.the42.ie/loi-attendances-6486267-Sep2024/",
  "title": "Uefa report 20 % increase in LOI attendances",
  "date": "20240912T184500Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "ATTENDANCES AT LEAGUE of Ireland matches have risen by 20%, according to Uefa’s annual landscape report.\nThe annual document is among Uefa’s signature pieces of research, and it takes a snapshot of the trends and realities of football across Europe.\nThis year’s report shows that crowds at LOI Premier Division games have risen by 20% on 2022 to an aggregate of 587,900. (For summer seasons such as the LOI’s, Uefa’s figures cover 1 January to 31 December 2023.)\nOnly the top tiers of Croatia, Estonia, Finland, Kazakhstan, Lithuania, Norway, Poland, and Romania showed a higher percentage increase in crowds than the LOI.\nThis aggregate attendance ranks the LOI 28th among 54 top-flight leagues across Europe. The average attendance was 3,300, which ranks the LOI 25th in Europe. The largest single league attendance figure last year was 8,000 people, which rated 36th in Europe. (This has been comfortably outstripped in 2024 following the opening of the fourth stand at Tallaght Stadium, which has hosted crowds of 10,000 people.)\nUefa’s research shows that few leagues are so reliant on local head coaches as the LOI: 94% of head coaches in 2023 played in the either the Premier Division or First Division, a higher figure than any other in Europe. It is also a league for young coaches: just 7% of last season’s bosses had at least five previous managerial stints elsewhere. This rated the LOI 52 of 54 leagues.\nThe relatively small influence is also evident in playing squads: 26% of total minutes were played by expatriate players, which ranks the LOI 44th on the European table. (Andorra’s league had the highest percentage – 80% – while the Premier League ranked fifth, with 64%.)\nThe report estimates the LOI Premier and First Divisions earned a net total of €600,000 in transfer fees last year, which places the leagues 30th across Europe.\nIn part recognition of the longer contracts now being handed to players, squad churn was relatively low, with an average of 3.4 inbound players per club. At 49th, this is among the lowest in Europe.\nOn a broader level, Uefa’s report found a 7% increase in attendances across Europe, with 229 million fans attending men’s and women’s games. The highest aggregate attendance was recorded in the Premier League, and in proof of England’s remarkable appetite for live football, the second-highest aggregate attendance across Europe was recorded in the Championship.\nElsewhere, Uefa found that transfer spending across Europe fell by 8% to €6,7 billion, which they attributed largely to the smaller funds spent by clubs in Saudi Arabia. 30% of this spend was committed by just 10 clubs, with Chelsea found to have the highest gross spend of the summer (€261 million.) Brighton were found to have had the highest net spend, at €183 million.\nThe average transfer fee for a player coming to the Premier League was reported at €15.6 million.\nThe summer 2024 transfer window saw a record 13% proportion of transfer investment directed at teenage players, and the trend in which clubs prioritised younger players is evident in the fact that 53% of all monies were spent on players under the age of 23.\nLooking at the 100 most expensive players of the window, the average age of these players was 23.7. One Irish player appeared among this top 100, believed to be Jake O’Brien’s transfer from Lyon to Everton.\nThe full report can be read here.",
  "word_count": 568,
  "scraped_at": "2026-02-14T13:14:50.051907"
}