{
  "article_id": "32356110c408",
  "url": "https://www.examiner.com.au/story/8546821/npl-tasmania-preview-for-launceston-city-united-and-riverside/",
  "title": "NPL Tasmania preview for Launceston City , United and Riverside | The Examiner",
  "date": "20240314T070000Z",
  "domain": "examiner.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Launceston City coach Daniel Syson isn't holding back about his team's not-so-secret weapon ahead of the NPL Tasmania kick-off.\nSubscribe now for unlimited access.\nor signup to continue reading\n\"He's probably the best centre-forward in the league for me,\" the experienced tactician said about new signing Thierry Swaby.\n\"Now that Roberto (Garrido) has departed, I don't see many as good as him. Maybe Noah Mies (at Kingborough), but I can't think of any other no.9s with his ability.\"\nThe Arsenal-supporting boss even drew a predictable comparison with a famous namesake.\n\"I know it's an obvious comparison given his name but he plays very like Thierry Henry. He loves that left-hand side, even as a centre-forward, and he has the same dribbling ability - he just glides past players without seeming to go through the gears.\n\"We played against Devonport and I've not seen a centre-forward give Kieran (Mulraney) and their backline so many problems. I know from conversations after the game, they were very impressed with him.\"\nThe 20-year-old 177-centimetre striker represented English Championship side Bristol City at under-18 and under-21 level and was playing non-league when Syson made contact with his agent.\n\"He was heading on tour to Perth and did extremely well so I was worried there would be a lot of mainland interest and his price would go up but I had great conversations with him and his father and, being English myself, I could relate with him.\n\"He's got all the ability. He holds the ball up really well and this being a younger league really suits him.\"\nJunior Akwasi Agyekum has also arrived from the Canadian Premier League and with new rules limiting sides to two imports, Mason Smith has headed the other way, returning home to play for NPSL side Michigan Rangers.\nSyson described the 21-year-old as a strong and versatile midfielder who will bring quality and physicality to a side also welcoming two more arrivals from across the Pacific.\nDaniel Latinovic is a tall, strong centre-half from Queensland who has been playing US college soccer.\n\"He is very technical on the ball and will be one of the best centre-backs in the league. He's only 21 so it's about settling in and finding his feet and I'm sure he will be really impressive.\"\nMeanwhile, Cameron Jeffery has arrived from the same US college. \"His football IQ is brilliant,\" Syson said. \"He understands things really quickly and has technical ability. He's a great passer of the ball, brings a lot of leadership and is another great addition.\"\nIn his second year at the helm at Prospect Park, Syson is keen to add physicality to help his side compete with the NPL big guns.\n\"Last year I felt we were one of the better footballing sides but we weren't physically strong enough.\n\"I'll say it now: I think Kingborough will win the league this year because they are a big, physical men's side.\"\nKeeper Lachie Clark and Syson's former Devonport teammate Joel Stone will continue to co-captain the side with midfield workhorse Jack Woodland heading a crop of youngsters transitioning into first-choice regulars.\nToby Simeoni, Stef Tantari, Toby Anderson, Noah Curtis and Alex Jacobs all left City during the off-season.\nFor the second season running, City and cross-town neighbours Riverside will kick-off the league with a Friday-night derby.\n\"It should be exciting,\" Syson added. \"I've seen a bit of Riverside. They have recruited heavily and will be better than last season. They beat us 1-0 in the Summer Cup and it should be a great start to the season. I can't wait to get underway.\"\nFriday night's match at Windsor Park kicks off at 8.15pm.\nLaunceston United, Clarence, South Hobart, Kingborough, Glenorchy and champions Devonport make up the eight-team league.\nCITY STATS\n- Home ground: Prospect Park\n- Coaches: Daniel Syson (NPL Tasmania), Alex Gaetani (NPL U21s), Dan Smith (NC), Michael Cheney and Stephen Pearce (NCW), Wayne Wager ( NC1)\n- Opening fixture: v Riverside Olympic (a), Friday 8.15pm\n- Last season: 6th (P21, W8, D 3, L10, GF26, GA34, GD-8)\n- Lakoseljak Cup: R2 d Launceston United 4-1; R3 lt Clarence 1-2\n- Co-captains: Lachie Clark and Joel Stone\n- Ins: Thierry Swaby (from England), Junior Akwasi Agyekum (from Canada), Daniel Latinovic, Cameron Jeffery (both from US)\n- Outs: Toby Simeoni (South Melbourne), Stef Tantari (MetroStars), Mason Smith (Michigan Rangers), Toby Anderson (Ulverstone), Noah Curtis (United), Alex Jacobs (to US), Will Fleming (Riverside), James Hawes\nWily veteran keen to mastermind turnaround\nTasmania's newest statewide men's team has turned to one of the state's most experienced coaches to mastermind a change of fortunes.\nHaving already coached Northern Rangers and Launceston City in NPL Tasmania, Lino Sciulli is completing a Northern hat-trick with Launceston United.\nThe Birch Avenue club is delighted to secure the proven partnership of Sciulli and his long-time no.2 Darren Cooke.\n\"We're lucky to get them as a pair and they have fitted in exactly as we expected,\" technical director Frank Compton said.\nA late confirmation for their maiden season in the league, United finished the 2023 season with just two draws, no wins and a -73 goal difference from their 21 matches, but are restarting with a full pre-season and fresh perspective.\n\"The time for excuses is over,\" Compton said. \"Lino and Darren have a clean slate and players have the opportunity to show they are worthy of the competition. They need to believe in themselves that they belong and prove some of the doubters wrong.\n\"We feel we are in the league on merit but understand that we've got to keep moving forward to justify that and hope this will be a big step forward for the club.\n\"Getting the feeling that we truly belong in the league will be the big test. The first few rounds of the season won't show too much and we certainly won't be hitting the panic button.\n\"We have two coaches we believe in who will help develop Tasmanian footballers.\"\nIn addition to 23-year-old Canadian defender Malik Smith, who has played National Collegiate Athletics Association division one in the US and with Western Suburbs in New Zealand, United have recruited versatile striker Ayouba Kanneh, also 23, who has NPL experience in both Western Australia and Victoria.\nThis leaves the club with an option of signing a second import during the season.\nThey have also lured highly-rated keeper Noah Curtis - winner of last season's Under-21 league golden glove award - across town from City.\nUNITED\n- Home ground: Birch Avenue\n- Coaches: Lino Sciulli (NPL Tasmania), Nick Rawlinson (Women's Super League), Richard Jones (NPL U21s), Andrew Smith (NC), Wayne Rice (NCW), Mark Egan (NC1)\n- Opening NPL fixture: v Glenorchy (h), Saturday 4.30pm\n- Last season: 8th (P21, W0, D2, L19, GF18, GA91, GD-73)\n- Lakoseljak Cup: R2 lt Launceston City 1-4\n- Captain: Connor Reading\n- Ins: Malik Smith (Western Suburbs), Noah Curtis (City), Ayouba Kanneh (from Melbourne)\n- Outs: Abdelkhalig Abdelrasoul (Riverside)\nCoach combs contacts book to find right numbers\nRiverside Olympic are hoping a healthy mix of old and new faces will bring a smile to the club's NPL Tasmania fortunes.\nIn addition to several mainland and overseas arrivals, the club has attracted several familiar figures from within Tasmania as it seeks to improve on a disappointing statewide record.\nCoach Helder Dos Santos Silva has combed through his extensive contacts book to land well-travelled Chilean goal machine Emanuel Ponce, Queensland midfielder James Trevis fresh from spells in the US and UK and versatile attacker James Pelletier who has played in NSW, UAE and England.\nComplementing these newcomers is the return of Olympic product Max Reissig from Devonport to be reunited with his brother Zac, two more brothers in Yasin and Nasim Mohammadi, plus Will Fleming and Arpan Rai (from City), Abdel Abdelrasoul (United) and keeper Indigo Sharp (South Hobart).\nDos Santos Silva said the arrivals have been gelling well with the existing squad which includes experienced stagers like Gedi Krusa and Dan Nash.\n\"They are all pushing each other,\" he said. \"The youngsters accept the feedback and want to improve which is important.\n\"We want a better season than the previous ones. Last season was bad in terms of points but better than the previous one so we always try and improve. I think the squad is good and working really hard to achieve something. Of course we want to win every single game but the reality is teams are very strong and they went to the market as well.\"\nIn his second season at Windsor Park, the Portugal-born former English pro said he learned plenty from a rollercoaster 2023 campaign.\n\"I have learned that Tasmania is tiny and everyone knows each other. Tasmania is more family-orientated. You don't see that in the big cities.\n\"We introduced four training sessions per week and every player bought into that to create a culture where the club is more important than the person. You cannot achieve everything in one year but we are on the road to that and if we can get some success on the pitch then players will come.\"\nDos Santos Silva has been watching statewide developments with considerable interest, not least from Friday's cross-town opponents.\n\"It's going to be an interesting league. United brought Lino (Sciulli) back and he is an old fox - a very intelligent coach.\n\"City are going to be very tough. (Daniel) Syson is a very clever coach who plays really good football.\n\"They have a lot of patterns playing from the back to invite pressure and clever players that can play between the lines so if we are not careful they can play through us.\n\"And he has clever players up top. Thierry (Swaby) is a very good striker. Syson chose the new players well.\"\nOLYMPIC\n- Home ground: Windsor Park\n- Coaches: Helder Dos Santos Silva (NPL Tasmania), Chris Rademacher (Women's Super League), Rob Murray (NPL U21s), Jared Colgrave (NC), Isaac Klug (NC1)\n- Opening NPL fixture: v Launceston City (h), Friday 8.15pm\n- Last season: 7th (P21, W4, D1, L16, GF21, GA79, GD-58)\n- Lakoseljak Cup: R2 d Barnstoneworth 6-1; R3 lt Hobart United 0-1\n- Captain: Dan Nash\n- Ins: Abdelkhalig Abdelrasoul (United), James Trevis (from Queensland), Will Fleming, Arpan Rai, Nasim Mohammadi (all City), Indigo Sharp (South Hobart), James Pelletier (Prospect United), Max Reissig, Yasin Mohammadi (both Devonport), Emanuel Ponce (from Chile),\n- Outs: Aaron Kidmas (Sporting Clube da Vista Alegre), Andre Chamusca (to Greece)",
  "word_count": 1744,
  "scraped_at": "2026-02-14T12:41:02.583341"
}