{
  "article_id": "3251786c8652",
  "url": "https://www.click2houston.com/news/local/2026/01/09/report-star-ole-miss-quarterbacks-college-future-in-jeopardy-after-ncaa-denies-sixth-year-of-eligibility/",
  "title": "REPORT : Star Ole Miss quarterback college future in jeopardy after NCAA denies sixth year of eligibility",
  "date": "20260109T204500Z",
  "domain": "click2houston.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "One of the biggest stars in college football may have played his final game Thursday night.\nOn Friday, ESPN’s Pete Thamel reported that the NCAA denied a request to grant Ole Miss quarterback Trinidad Chambliss a sixth season of eligibility.\nRecommended Videos\nNEWS: The NCAA has denied Trinidad Chambliss a sixth-year of eligibility, which would his college career. The decision comes after a verbal denial in December. Ole Miss can still appeal the decision. pic.twitter.com/V4rDSxERwq\n— Pete Thamel (@PeteThamel) January 9, 2026\nThe NCAA’s decision adds insult to injury, as Chambliss and the Rebels came up just short against the Miami Hurricanes in the Vrbo Fiesta Bowl, suffering a 31–27 loss that will undoubtedly be remembered as an instant classic.\nAdversity is nothing new for Chambliss.\nComing out of Grand Rapids, Michigan, he entered college as an unranked prospect with no Division I offers, according to his recruiting profile on 247Sports. He spent four seasons at local Division II program Ferris State, leading the Bulldogs to a national championship in his final year.\nAfter reaching the Division II mountaintop, Chambliss set his sights on higher-level college football, joining the SEC’s Ole Miss Rebels.\nHe began the 2025 season on the bench, backing up Austin Simmons. After Simmons suffered an injury in the Rebels’ third game, Chambliss entered and never looked back.\nChambliss started every remaining game, throwing for 3,660 yards, 21 touchdowns and just three interceptions.\nWhen then–Ole Miss head coach Lane Kiffin left the program before the College Football Playoff to accept the LSU job, Chambliss was forced to overcome yet another obstacle. He defied the odds, leading blowout wins over Tulane and an upset of SEC rival Georgia to push the underdog Rebels within two games of immortality.\nMORE ON LSU AND LANE: LSU football coach Kiffin attends Tigers’ women’s hoop game as Ole Miss beats Georgia at Sugar Bowl\nWith the fate of both teams hanging in the balance, Miami quarterback Carson Beck evaded pressure, scrambled left and waltzed into the end zone. With just 18 seconds remaining, Miami took a four-point lead.\nChambliss responded by leading the Rebels to midfield, setting up one final Hail Mary attempt. The pass reached the end zone with room to spare but ultimately fell incomplete — a reminder that even the most improbable underdog stories can be snuffed out.\nAs grounds crews swept the confetti and Miami hoisted the Fiesta Bowl trophy, the NCAA faced a looming decision: grant Chambliss another year or bring his college career to a close.\nThe NCAA ultimately chose the latter.\nDespite its less-than-stellar reputation, the NCAA was not entirely out of line in denying Chambliss another season. The participation of players far beyond the typical “college-age” window has been a point of contention for years, a debate further intensified by eligibility extensions granted during the COVID-19 pandemic.\nStill, Chambliss has only played one season at the Division I level. He did not spend years competing at the highest level before seeking an additional season. Instead, he worked his way up through the ranks — without relying on the transfer portal until his move to Ole Miss.\nAs it stands, the sport may have seen the final college football snap from an Ole Miss legend and one of the game’s all-time underdogs.\nOle Miss can still appeal the NCAA’s decision, Thamel confirmed.",
  "word_count": 557,
  "scraped_at": "2026-02-14T13:23:47.391232"
}