{
  "article_id": "326722c9d2ca",
  "url": "https://gcn.ie/23-queer-women-ireland-history/",
  "title": "23 trailblazing queer women who helped shape Irish history",
  "date": "20240308T151500Z",
  "domain": "gcn.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In the fight for equal rights and gender recognition, queer women have often been front and centre, fighting for bodily autonomy, the right to vote, supporting mental health in the LGBTQ+ community, fighting for marriage equality – the list goes on and this is by no means exhaustive.\nThere are hundreds if not thousands of queer women who have contributed to Irish history. Without their contributions and activism, Ireland would be a very different place. Here are a few of those women whose contributions deserve a place in the history books.\nSaint Brigid\nThe first on our list of game-changing queer women is none other than St Brigid of Kildare. Legend has it that a younger nun named Darlughdach was St Brigid’s “anam cara” or soul friend. The two women brought art, education and spirituality to early medieval Ireland. Some say that Brigid and Darlughdach are lesbian saints.\nKathleen Lynn\nDr Kathleen Lynn was a prominent figure in the Suffragette movement. Kathleen was a member of the executive committee of the Irish Women’s Suffragette and Local Government Association from 1903 until 1916.\nShe joined the Irish Citizen Army and was the chief medical officer during the 1916 Easter Rising. She described herself as “a Red Cross doctor and a belligerent” when she was arrested. She was imprisoned in Kilmainham Gaol with her comrades Countess Markievicz, Molony and Madeleine ffrench-Mullen.\nMadeline ffrench-Mullen\nMadeleine was a member of Inghinidhe na hÉireann and wrote for the newspaper Bean na hÉireann. Madeleine was a lieutenant in the Irish Citizen Army and in the 1916 Rising was stationed at the Garrison of Stephen’s Green/College of Surgeons with Countess Markievicz, Nellie Gilford and others.\nHer duties included overseeing the commandeering of vehicles, removing civilians from the area, guarding the entrances to the Green and tending to the wounded. She was first imprisoned in Kilmainham Gaol and then transferred to Mountjoy. She devoted her life’s work to trying to improve the living conditions of the impoverished. She co-founded St Ultan’s, the first children’s hospital in Dublin with her partner Dr Kathleen Lynn, working tirelessly in its day-to-day running.\nKate O’Brien\nMany of her books deal with issues of female agency and sexuality in ways that were new and radical at the time. Her 1936 novel, Mary Lavelle, was banned in Ireland and Spain, while The Land of Spices was banned in Ireland upon publication. Kate O’Brien’s determination to encourage a greater understanding of sexual diversity — several of her books include positive gay/lesbian characters — makes her a pioneer in queer literary representation.\nJackie McCarthy O’Brien\nJackie McCarthy O’Brien was a trailblazer in women’s sports. After an incredibly difficult childhood, by the age of 11 O’Brien was competing in the League of Ireland with athletes who were six years older than her.\nIn 1983, only six months after giving birth to her first child, Jackie played her debut against Northern Ireland. She went on to win 13 international soccer caps, earning herself a place on the Irish women’s rugby team.\nAs the first Person of Colour to play for the Republic of Ireland senior women’s football team, Jackie became a role model for women and girls in sport. In 2023, she was selected to be the Grand Marshal for Limerick Pride where she shared more about her life and sexuality.\nJoni Crone\nJoni Crone came out as a lesbian on the Late Late Show in 1980, two years before Declan Flynn was murdered in Fairview Park and 13 years before homosexuality was decriminalised in Ireland. She was there to talk about the need for law reform and to give insight into the horror stories she heard on the Lesbian Line.\nShe returned from London in the 1970s and began fighting for civil rights for LGBTQ+ people in Ireland. Her latest play Anna Livia Lesbia was written as a response to the erasure of the gay rights movement in Ireland in the ’70s and ’80s in the Marriage Referendum narrative.\nLydia Foy\nDr Lydia Foy is widely regarded as a pioneer for trans rights. In 1997, Foy began her legal fight for gender recognition, after the Registrar General refused to issue her with a new birth certificate recognising her true gender in 1993. She fought for two decades, and ultimately, the case forced the Government to introduce gender recognition legislation in 2015. She also won the prestigious Citizen’s Prize from the European Parliament in Brussels.\nKatherine Zappone\nKatherine Zappone and her wife Ann-Louise Gilligan campaigned fiercely for years for marriage equality, which ultimately led to the groundbreaking referendum. Zappone made headlines when she popped the question live on RTÉ to Ann-Louise, saying she was “feeling emotional from the top all the way down to my toes”.\nThe couple are also co-founders of An Cosán, an organisation in Tallaght that offers adult education, among other services, to women from disadvantaged areas.\nIn a historic first, Katherine Zappone became the first openly lesbian member of the Irish Cabinet in 2016 and lended her voice to the Repeal the 8th movement in 2018.\nAnn Louise Gilligan\nWife of Katherine Zappone, Ann Louise Gilligan fought tirelessly for marriage equality in Ireland. As previously mentioned, their court case against the state began a decade-long debate that resulted in the vote in 2015. She was an advocate of education and founded Ireland’s largest community education organisation.\nIn the words of Brian Finnegan, “She also was a woman who changed Ireland, who fought against injustice and won on all our behalf. Without Ann Louise’s tenacity, her fighting spirit and her fundamental desire for justice for all people, we would not be the country we are today.”\nShe sadly passed away on June 14, 2017, leaving behind an incredible legacy.\nNell McCafferty\nMcCafferty was a founding member of the Irish Women’s Liberation Movement. The queer author’s journalistic writing on women and women’s rights reflected her beliefs on the status of women in Irish society.\nIn 1971, she travelled to Belfast with other members of the Irish Women’s Liberation Movement in order to protest the prohibition of the importation and sale of contraceptives in the Republic of Ireland.\nMcCafferty received an honorary doctorate of literature from University College Cork on November 2, 2016, for “her unparalleled contribution to Irish public life over many decades and her powerful voice in movements that have had a transformative impact in Irish society, including the feminist movement, campaigns for civil rights and for the marginalised and victims of injustice.”\nGarry Hynes\nGarry Hynes is a co-founder of the Druid Theatre Company and was Artistic Director at the Abbey Theatre from 1991 to 1994.\nHynes directed the critically acclaimed DruidSynge, which has been described by Charles Isherwood of The New York Times as “the highlight not just of my theatre-going year but of my theatre-going life”.\nIn 1998, she won the Tony Award for Direction for The Beauty Queen of Leenane, the first woman to receive the award.\nOn June 15, 2006, she was awarded the Freedom of the City of Galway, its highest bestowed honour.\nGráinne Healy\nIn 2015, Gráinne took home The GALA Award for Volunteer of the Year, and for good reason! Longtime feminist and queer activist, former Chairwoman for Marriage Equality and Co-Director of the Yes Equality campaign, Gráinne Healy was instrumental in securing a Yes vote in May 2015. Along with progressing the LGBTQ+ movement, she has dedicated her life to campaigning for women’s rights in Ireland, including reproductive health rights, violence against women, prostitution and trafficking and anti-poverty issues.\nAilbhe Smyth\nFeminist and lesbian activist Ailbhe Smyth has been involved in radical politics in the country for over four decades and is known as one of the most influential Irish queer women.\nSmyth was a spokeswoman and convenor for the Coalition to Repeal the Eighth Amendment. Her list of accomplishments also includes being a founding member of Marriage Equality, convenor of Feminist Open Forum, an organiser for Action for Choice, a board member of Equality and Rights Alliance and the former Chair of the National LGBT Federation. Smyth received the ‘Lifetime Achievement’ award at the Galas 2015, Ireland’s LGBTQ+ Awards Ceremony.\nIn 2022, Ailbhe was a recipient of the Honorary Freedom of the City of Dublin. She was recognised by Dublin City Council and former Lord Mayor Alison Gilliland for her “work in the areas of human rights, social justice and academia”.\nKatie-George Dunlevy\nParalympic cyclist Katie-George has won an impressive collection of medals competing in tandem events for Ireland.\nDunlevy, who is visually impaired, was told that she may lose her vision entirely by the age of 30 due to a genetic, progressive eye condition. At the age of 42, Dunlevy continues to excel in cycling.\nKatie-George recently won the Time Trial at the para-cycling tandem 2023 UCI World Championships. She also won a gold medal at the Rio Paralympic Games in 2016 and the Tokyo 2020 Paralympic Games alongside her teammate, Eve McCrystal.\nUna Mullally\nUna Mullally is an award-winning journalist with the Irish Times, author and broadcaster. Covering areas including Irish and global politics, social justice issues, LGBTQ+ rights issues, feminism and technology, she also writes features and interviews. She co-founded the award-winning Irish Times Women’s Podcast and presents and produces television programmes. Her first book In The Name Of Love was a critically acclaimed oral history of the movement for Marriage Equality in Ireland, and she was the editor of Repeal the 8th, an anthology of writings about reproductive rights in Ireland.\nShe was named Journalist of the Year at the 2015 GALAS, was presented with the Praeses Elit Award from Trinity College Dublin in 2016, and the Foy-Zappone Award from University College Dublin in the same year. She co-founded the touring queer spoken word event Come Rhyme With Me and in 2016 was awarded a residency at Centre Culturel Irlandais in Paris where she worked on a long-form poetry project. She was also the chair of the LGBTI Youth Strategy.\nOrla Egan\nOrla Egan is known as one of the country’s most prominent lesbian trailblazers, particularly for her work in Cork. She has continuously highlighted the significance of the rebel county’s queer history by founding and exhibiting the Cork LGBT Archive.\nThe collection can be explored in multiple ways: through the physical archive housed in the Cork Public Museum, digitally through corklgbtarchive.com, and through more alternative means such as the ‘Queer Republic of Cork’ exhibition which travelled to Belfast and Berlin, a book published by the same name, a theatre piece called Leeside Lezzies, and more.\nEgan is the perfect person to spearhead this essential project, as not only is she passionate about history, but she also lived much of it. Having been involved in the queer Cork scene since the ’80s, she experienced life in the Quay Co-op, Loafers Bar, the Women’s Place and the Other Place, all the while becoming a crucial figure in achieving vital rights for the LGBTQ+ community.\nMost recently, she published a graphic memoir Dairy of an Activist in collaboration with Megan Luddy O’Leary which details her journey through peace and anti-nuclear protests, coming out, lesbian parties and becoming a parent.\nRuth McCarthy\nSince moving from Limerick to Belfast in 1991, Ruth has been one of the most influential queer women in the Northern Irish LGBTQ+ scene. She is the Founder and Director of the OutBurst, Queer Arts Festival, an annual celebration that continues to rise to higher heights each year.\nAdditionally, she opened Howl, Belfast’s first alternative queer night, and created Ireland’s first LGBTQ+ zine Muff Monsters on Prozac.\nSara R Phillips\nSara R Phillips has been devoted to the trans community for over 20 years and has been an active member of TENI since 2006. She served as Chair of the organisation from 2012 to 2022, and also founded and spearheads the Irish Trans Archive, among holding other impactful roles.\nPhillips, who appeared on the cover of GCN in 2015 to celebrate the passing of the Gender Recognition Bill, is a role model for many in the LGBTQ+ community and was recognised as such with an award at the 2020 GALAS.\nUpon receiving her award, she explained the importance of her work, saying, “Everything I do is for our trans community, everything I do is for the people who have gone before me but also those who are coming after me, because currently life as a trans person in Ireland still is not good enough. [There] is still a lot more to do.”\nRebecca Tallon de Havilland\nThought to be the first woman in Ireland to receive gender reassignment surgery, Rebecca Tallon de Havilland has long been a trailblazer for trans rights as well as HIV activism. Thirty years ago, she was outed on the front cover of an Irish newspaper, and although her journey has been tough, her resilience and bravery have led her to great successes.\nMost recently, she was the Grand Marshal of Dublin Pride in June 2022, as well as the Grand Marshal for the organisation’s section of the St Patrick’s Day Parade the same year. She is the founder of 56T Project Bootcamp, and has been the face of several campaigns including HIV Ireland’s GlowRED campaign for World AIDS Day 2022.\nShe is also thought to be one of the first Irish trans women to receive a female passport, and was a model for GCN’s LIVING exhibition in 2021, and a cover star for the magazine.\nIzzy Kamikaze\nNo list of influential queer Irish women in history would be complete without the inclusion of Izzy Kamikaze. A veteran LGBTQ+ Irish activist working tirelessly for the community across four decades, her voice has been prominent on countless significant occasions.\nAmongst other things, she was one of the key figures at the Second International Dyke March held in Dublin in 1998, describing it as “dyke power unleashed in the street”.\nIzzy has contributed powerful pieces to GCN, including a response to the tragic Sligo murders in 2022.\nNuala Ward\nNext on our list of history-making queer women is Nuala Ward. A tireless activist for LGBTQ+ rights, amongst her myriad incredible work for the community, she was the founder of Galway Pride and was fittingly honoured by leading the Galway Pride Parade as its Grand Marshal in 2019.\nNuala was also honoured by NUI Galway “in recognition of her dedication to human rights issues, in particular, LGBT+ issues, her work in advocacy, activism, awareness-raising and outgoing community service spanning over three decades.”\nRanae von Meding\nAn activist campaigning on behalf of LGBTQ+ parents in Ireland, Ranae von Meding has written many wonderful, informative and empowering articles for GCN, sharing with the community the struggles rainbow families face.\nShe is a founder of Equality for Children – a campaign for LGBTQ+ families in Ireland. The campaign shares how children of same-sex parents in Ireland are denied the right to have a legally recognised relationship with both of their parents.\nThanks to her work, legislation has been introduced in Ireland to recognise international surrogacy, but both Equality for Children and Ranae will not rest until LGBTQ+ families receive the rights they deserve.\nKatie McCabe\nAs captain of the Republic of Ireland women’s team, Katie McCabe led the team to the World Cup in 2023, where she scored a history-making wondergoal.\nLast year, McCabe became the first Irish woman in history to be nominated for the prestigious Ballon d’Or Féminin award. McCabe helped her Arsenal team win the League Cup, achieve a third-place finish in the Women’s Super League, and reach the semi-finals of the Champions League. She also earned a spot in the UEFA Team of the Season and won her club’s Player of the Season award as voted by the public.\nThe versatile and passionate queer footballer is an inspiration to young footballers across the country.\nThese are only some of the queer women who have changed history in Ireland, but this is by no means an exhaustive list. There are countless other trailblazers who deserve to be honoured, and we celebrate all of their achievements.\n© 2024 GCN (Gay Community News). All rights reserved.\nSupport GCN\nGCN is a free, vital resource for Ireland’s LGBTQ+ community since 1988.\nGCN is a trading name of National LGBT Federation CLG, a registered charity - Charity Number: 20034580.\nGCN relies on the generous support of the community and allies to sustain the crucial work that we do. Producing GCN is costly, and, in an industry which has been hugely impacted by rising costs, we need your support to help sustain and grow this vital resource.\nSupporting GCN for as little as €1.99 per month will help us continue our work as Ireland’s free, independent LGBTQ+ media.",
  "word_count": 2782,
  "scraped_at": "2026-02-14T12:47:22.984483"
}