{
  "article_id": "326c084a4b8b",
  "url": "https://www.the-star.co.ke/news/africa/2025-12-22-hosts-morocco-beat-stubborn-comoros-in-afcon-2025-opener",
  "title": "Hosts Morocco beat stubborn Comoros in Afcon 2025 opener",
  "date": "20251222T063000Z",
  "domain": "the-star.co.ke",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Africa Cup of Nations 2025 hosts Morocco began their campaign to win a second continental title with a somewhat nervy win over Comoros in the tournament opener in rainy Rabat.\nThe Atlas Lions spurned a glorious chance to take an 11th-minute lead after Iyad Mohamed brought down Brahim Diaz in the box but Comoros goalkeeper Yannick Pandor got his left knee to Soufiane Rahimi's penalty.\nThe Indian Ocean islanders sat back and frustrated their opponents until 10 minutes into the second half when Diaz was left unmarked near the penalty spot to sweep home Noussair Mazraoui's low ball across the box.\nThe Real Madrid man's strike was greeted by a loud roar by the majority of the 60,180 in attendance at the Prince Moulay Abdellah Stadium and the game then sparked into life as Comoros forward Rafiki Said was denied by the legs of Yassine Bounou and Mazraoui saw a fine effort palmed away by Pandor.\nSubstitute Ayoub El Kaabi netted a sensational overhead kick with a quarter of an hour remaining to make the game safe for the North Africans and ensure that Walid Regragui's side lived up to pre-match expectations by delivering victory.\nThey also did so without influential captain Achraf Hakimi, who was only fit for the bench after suffering an ankle injury playing for Paris St-Germain in a Champions League game in early November.\nThey also lost centre-back Romain Saiss to injury early in the game.\nThe three points meant Morocco extended their world record run of consecutive victories to 19 - but a more difficult test will come against Mali on Friday (20:00 GMT).\nMeanwhile, there are three games on Monday as the West Africans take on Zambia in the second match in Group A, while Egypt and South Africa start their campaigns in Group B.\nThere had been weeks of wrangles over release dates for players in the middle of the European club season - and then came the shock news on the eve of the finals that Afcon, traditionally a biennial tournament, will be held every four years from 2028.\nOnce Morocco's Crown Prince Moulay El Hassan had greeted the players on the pitch in teeming rain, posed for photos and taken a ceremonial kick-off, it was finally time for the action to take centre stage.\nMorocco have been the top-ranked African side since the 2022 Fifa World Cup, when they became the first side from the continent to reach the semi-finals, and their ambition on the pitch has been matched by vast investment in football stadiums and infrastructure – all backed by King Mohammed VI.\nThe country is enjoying its time in the limelight, having hosted the past two Women's Africa Cup of Nations finals - a tournament it is set to hold again in March next year.\nThe 2030 World Cup will be co-hosted by the kingdom but, for now, the pressure is on Regragui to deliver a first Afcon title since 1976, with the coach admitting that \"anything other than victory will be a failure\".\nMorocco have only returned to the last four at the finals once in the past 49 years – in 2004 when Regragui was part of the side pipped to the trophy by Tunisia.\nBigger tests will come for the Atlas Lions but their home fans will be relieved that their side navigated a potential upset at the hands of Stefano Cusin's Comoros.",
  "word_count": 567,
  "scraped_at": "2026-02-14T12:37:25.201479"
}