{
  "article_id": "328aea9acc05",
  "url": "https://wislawjournal.com/2023/03/19/kellys-deleted-blog-posts-reveal-his-personal-views-on-topics/",
  "title": "Kelly deleted blog posts reveal his personal views | Wisconsin Law Journal",
  "date": "20230320T131500Z",
  "domain": "wislawjournal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Skip to content\nKelly’s deleted blog posts reveal his personal views\nKelly’s deleted blog posts reveal his personal views\nLegal News\nCase Digests\nSteve Schuster, [email protected]//March 19, 2023//\nSteve Schuster, [email protected]//March 19, 2023//\nBy Steve Schuster and Ethan Duran\n[email protected] and [email protected]\nRead More Legal News\nThroughout the entire Wisconsin Supreme Court race, Milwaukee County Circuit Court Judge Janet Protasiewicz has made no secret of her personal views on issues that will likely go before the Wisconsin Supreme Court if she were to be elected. Her opponent, former Wisconsin Supreme Court Justice Daniel Kelly has declined to answer the same questions saying that he will apply the rule of law and deferred many questions back to the legislature.\nThe Milwaukee Journal Sentinel reported that Kelly had previously blogged about many of his personal beliefs, but then deleted all of the posts. The Wisconsin Law Journal recovered several of those blog deleted posts, which address a number of issues including women’s rights, Medicare, Social Security, abortion, same-sex marriage, gun control, and a free press.\nOn Nov. 6, 2012, the very same day President Barack Obama was reelected as president, Kelly dismissed the results of the election in a blog, ‘A present moral consensus.’\nWith a blatant disregard for what voters decided he called for a debate because he didn’t agree with public consensus. Then he went as far asking if Americans are “cranks” for not sharing his personal beliefs.\nKelly said, “Thus gay marriage, recreational drug use, and tax increases received the public’s straight-up endorsement … So, are we just cranks, or is there still room to debate these issues?”\nSpeaking of taxes, in one of Kelly’s deleted 2013 blog posts, he attacked the Internal Revenue Service (IRS) in response to a Paul Ryan campaign ad.\n“That’s why there are campaign ads showing Paul Ryan shoving Granny over the cliff in a wheelchair, but none showing the IRS agent raiding some poor Schmuck’s paycheck to give it to Archer Danels Midland,” Kelly wrote in the blog ‘Not so fast Riddler.’\nKelly blogged quite a bit about his dislike of federal government control and loss of liberty. Instead of advocating for the same-sex couple who couldn’t have a cake decorated in a bakery, it would appear that Kelly is more concerned about the loss of liberty for the Christian bakery shop owners who didn’t want to be compelled by the government to make the cake.\n“The correct question is not whether it is important to grant Christians an exception from having to bake a cake for a same-sex wedding. In terms of how we live together in society, you will always come out on the losing side of that inquiry,” Kelly said in the deleted blog post ‘How to nosily concede your liberty.’\nIn another blog post about Green Bay Packers legend Vince Lombardi, Kelly said, “Lombardi’s football is to the game, as work is to the economy.”\nKelly went on to say, “Wealth is what follows from the peculiar activity called work.”\nBut does that imply everyone who works becomes wealthy?\nKelly “needs a dose of reality,” a reader commented on a social media post where Kelly talks about his views on Medicare and Social Security.\n“I don’t think you can derive wealth-transfer programs from the protection of life, liberty, and property otherwise known as the pursuit of happiness,” Kelly wrote in the blog ‘Unmasked riddlers.’\nAs previously reported, Kelly also wrote that he thinks Social Security is just for those folks who “have chosen to retire without sufficient assets to support themselves.”\nOn the issue of guns and the Second Amendment, Kelly is critical of both sides.\n“Neither side is eager to engage the other on what this constitutional provision actually means,” Kelly wrote. “The Second Amendment is not … about hunting nor personal defense,” Kelly wrote noting that it’s really about having a well regulated militia.\nIn several of Kelly’s deleted blog posts he again attacked women’s rights, the entire Democratic party, and the news media.\nIn one post Kelly appears to have compared those who have abortions to the news media saying both have no values and destroys lives in a now deleted blog post titled ‘Do they know how do we know they know.’\n“They know abortion takes the life of an unborn child, and if they said otherwise they know they would be laughed out of the room. It is not knowledge or rationality they lack, but a correct ordering of values. And the media, what of them? How about a very specific example of knowingly fronting for a system that destroys lives?,” Kelly said.\nKelly then bashes the New York Times after winning a Pulitzer prize.\nKelly blogged quite a bit about our Founding Fathers quoting them and also attacked journalists. But was it not Jefferson who said, “Our liberty depends on freedom of press, and without that cannot be limited without being lost?”\nKelly continues labeling journalists and women as elitists.\n“If the cultural elite are so lacking in reason that they cannot connect the dots between what they do and what happens afterwards, they certainly aren’t capable of engaging in rational conversation,” Kelly said.\nThe Wisconsin Law Journal and The Daily Reporter have made multiple attempts to speak with Kelly over the past week via telephone and email communications. His campaign has not returned our calls, nor have they replied to our emails. However, in past comments, Kelly has made it clear that he would only apply the rule of law and does not let personal opinion influence his court decisions.\nCalling Democrats and women “the cultural elite,” Kelly said they are united in an agenda to take human lives.\n“… The Democratic Party, a major women’s organization, and a single-purpose special interest group to a policy deadly to children. The subject, you might guess, is abortion. The Democratic Party favors it, the National Organization of Women is adamantly supportive, and the National Abortion Rights Action league has single-minded purpose of keeping it legal,” Kelly wrote.\n“Each of these culturally-elite organizations has invested heavily in both dollars, and intellectual effort, in normalizing the practice of abortion, making it culturally acceptable. An abortion, of course, involves taking the life of a human being,” Kelly added.\nIn another now deleted blog post of Kelly’s ‘An irrational lack of fear’ Kelly talks about how Americans are losing their freedom under Democrats.\nA reader comment ironically points out that Kelly’s point of view on prohibiting same sex marriage, reducing Social Security, Medicare, and unemployment benefits, and his views on reproductive rights are also the loss of freedom for those who don’t share his personal views.\nAs previously reported by the Wisconsin Law journal, in response to the deleted posts, Protasiewicz said, “Dan Kelly shares extreme right-wing views that go against everything Wisconsinites believe in. We believe in common sense, treating each other with respect, and following the law.”\nAnother blog post Kelly wrote that “No one at Planned Parenthood or NARAL has ever seen a sonogram of a late-term unborn child.” The Wisconsin Law Journal reached out to Planned Parenthood on Sunday morning.\nStay tuned.\nClick here to read Kelly’s deleted blog posts.\n- Lazar launches six-figure ad buy in Court race\n- Waupun prison lieutenant pleads in inmate deaths\n- Congressional candidate tied to $44M settlement\n- ‘Get to Know’ Lazar at Marquette on Feb. 17\n- Milwaukee Bar Association’s Judges Night\n- Wisconsin Supreme Court weighs race-based college grants\n- Appeals court denies new trial for Kenosha teen killer\n- Milwaukee DA staffer resigns after leak in Brooks probe\n- Taylor launches first TV ad in court race\n- ACLU seeks court action over delayed prison nursery program\n- Milwaukee store owner pleads guilty to $1.6M SNAP fraud\n- After 2 years, Whitewater gets funding for immigrant liaison\n- Protective Custody-Expert Testimony\n- Corporate Governance-Willfulness Standard for Contempt\n- Fourth Amendment-Reasonable Suspicion Standard\n- Guardianship-Clear and Convincing Evidence Standard-Voting Rights\n- Three-Part Test for Associational Standing-Germane Purpose Requirement\n- Circumstantial Evidence\n- Sovereign Citizen Claims-Subject Matter Jurisdiction\n- Ineffective Assistance of Counsel-Direct Appeal\n- Scope of Default-Forfeiture, Waiver of the Defense\n- Totality of the Circumstances Test-Fourth Amendment\n- Antitrust Settlement-Judgment Sharing Agreement\n- Criminal Law-Evidence",
  "word_count": 1375,
  "scraped_at": "2026-02-14T13:07:32.304555"
}