{
  "article_id": "32aa477348a4",
  "url": "https://news.sky.com/story/england-forward-lauren-james-a-breakout-world-cup-star-stepping-out-of-brother-reeces-shadow-12931886",
  "title": "Lauren James : A breakout World Cup star stepping out of brother Reece shadow",
  "date": "20230801T191500Z",
  "domain": "news.sky.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Lauren James: A breakout World Cup star stepping out of brother Reece's shadow\nWith her scintillating goals and all-round attacking verve, Lauren James has helped England storm into the knockout stages.\nTuesday 1 August 2023 18:29, UK\nLauren James was the toast of the England team as she helped the Lionesses storm into the knockout stages of the Women's World Cup with a dominant 6-1 win over China in Adelaide.\nThe Chelsea forward scored two goals and set up another three as her side took top spot in Group D, securing a last-16 clash against Nigeria in Brisbane next Monday.\nThe sister of England and Chelsea defender Reece James, 23, also lit up last Friday's game against Denmark, celebrating her first start at the tournament with a stunning long-range goal.\nBut James, fast becoming one of the competition's breakout stars, has rarely been in the starting line-up for England games, due to the fierce competition for forward places in manager Sarina Wiegman's squad.\nSpeaking before the World Cup began, James said she doesn't want to be known as Reece's sister, insisting: \"I want to carve out (my own name) and be known as 'this is Lauren James'.\"\nThe 21-year-old, winner of the Young Player of the Year Award at the Women's Football Awards last season, is taking her chance in the absence of the injured Beth Mead.\nBut at times she has been criticised for inconsistency, with her performances in the second half of last season falling below the standards of the early part of the campaign.\nShe missed out on last year's European Championship success because of injury, but said it made her more determined to make an impact at the World Cup.\nRead more:\nHow China v England unfolded\nWho is Lauren James?\nLauren Elizabeth James was born in London in September 2001 to a father of Dominican and Grenadan descent and an English mother.\nShe and Reece, who used to play in the same teams at junior level, had a head start on their rivals, as father, Nigel James, is a UEFA-qualified coach.\nShe has played for Epsom Eagles, then the Chelsea youth set-up, before moving to Arsenal where she made her first-team debut aged just 16.\nA move to the newly-formed Manchester United women's side followed, as did an impressive 22 goals in 40 appearances between 2018 and 2021, including some in the Championship, the league below the Women's Super League (WSL).\nIn all, she has 38 goals from 109 senior appearances, mostly in the WSL.\nShe returned to Chelsea two years ago, where she now plays alongside fellow Lionesses Millie Bright, Jess Carter and Niamh Charles.\nJames made her senior England debut in a World Cup qualifier against Austria last September and scored her first international goal in February this year during a 4-0 win over South Korea.\nIn June, it was announced she had signed a new deal, keeping her at the Blues, where she won the WSL title earlier this year, until 2027 and she looks set to be talked about for many years to come.",
  "word_count": 513,
  "scraped_at": "2026-02-14T12:22:06.514516"
}