{
  "article_id": "32bceb0f3ce3",
  "url": "https://www.elevenwarriors.com/forum/ohio-state-athletics/2026/01/161352/mens-lacrosse-2026-season-preview",
  "title": "Men Lacrosse : 2026 Season Preview",
  "date": "20260127T191500Z",
  "domain": "elevenwarriors.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It’s time. Ohio State takes the field in less than a week for the opening game of a pivotal 2026 season. I couldn’t be more excited. And the stakes could not be any higher. We have entered an exhilarating period where the Buckeyes MUST meet expectations. And, if you’re a longtime fan, that means Final Four or bust. No pressure, folks,\nAs in the past, this preview is going to be broken down by position group. A rundown of last year’s results, returning personnel, and projected starters will be laid out for all to see. Any weaknesses will also be highlighted, no matter the source. I’m pretty optimistic about the potential for this year’s squad, though the constant churn of coaching and personnel could put a damper on results on the field. There’s a lot of material to work through. Let’s get started.\nAttack\nAlphabetically and athletically, the attack unit has come first for the Buckeyes. Year in, and year out, the Ohio State Buckeyes excel at generating points from the attackmen. There’s literally no other unit on the team that has been consistently excellent from year to year, in spite of it all. This season should absolutely be no different in that regard.\nLast year, Garrett Haas (29 goals, 17 assists) stirred the drmk while Alex Marinier (SO goals, 2 assists) shot the absolute lights out. On the lefty side of the field, Ryan Donnery (19 goals, 6 assists) had a decent year as well.\nThe attack, and indeed the offense, generally operates to get a heavy righty shooter going with a hands free shot. It’s been that way for a decade now, with Tre Leclaire, Colby Smith, Alex Marinier, and others all taking their turn to score goals in bunches. The biggest exception was Jackson Reid for a bit, as the lefty filled the goal from the crease and opposite side of the field. That was literally a one off, however. And, to be fair, a bit of flexibility from the staff to get scoring from the best options.\nThis year, the attack unit may be at its peak in the Nick Myers tenure. In addition to a 50-goal scorer from last year, and the primary dodger, Ohio State brings in its highest rated offensive recruit ever in Khalif Hocker. Further, Jackson Birtwistle joins the Buckeyes from Syracuse as a grad transfer. And oh yeah, so does Russell Melendez, who is taking a final year after transferring in from Johns Hopkins. Not to mention a couple of freshmen who come in after filling up the goal during their high school career. On paper, it would be very difficult to find a more accomplished and dangerous attack unit anywhere else in the country. Full stop, this group is loaded.\nMy only concern would be health. Khalif Hocker tore his ACL last April and is likely just now getting to full go. That’s to get recovered enough to enter the DI meat grinder. Russell Melendez has been injured constantly at Johns Hopkins the past 2 seasons. The injury bug has not been especially kind to the Buckeyes the past few season, either. With that said, when healthy, I believe this may be the best unit Ohio State has ever fielded from a talent and depth perspective. No caveats.\nProjected Opening Day Starters: Haas, Marinier, Birtwistle\nOffensive Midfield\nThe offensive midfield has been a problem for Ohio State pretty much for the past 10 years. Essentially the opposite of the attackmen. Rarely has Ohio State had one scary dodger, let alone multiple dodging threats to get the defense rotating. Last year, in aggregate, was one of the most successful units the Buckeyes have had in that timeframe. And even that wasn’t enough to get a tournament win. The middies played decently last season, but the staff kept trying (or had) to force Jack McKenna into a dodging role due to a lack of other great options, which never really took off against serious teams.\nGriffin Turner was the best at executing dodges to earn assists (18), but overall the unit was grossly average. This season, the unit will take a step back in terms of depth. There’s just not the same numbers there. On the other side, talent at the top end may be a little higher. Maybe. If there was development in the fall and over the winter. We’re going to see the new offensive coordinator earn his stripes this season if things go well.\nLiam White is Ohio State’s most productive returning midfielder, who genuinely improved each week to the point where he was one of the most reliable players out there by season’s end. Ending the year with 11 goals and 6 assists, White scored 10 of his 17 points in Big Ten play and the tournament fiasco against Notre Dame. As a true freshman, that’s a pretty outstanding record. Dillon Magee also returns, looking to hit a high mark in his roller coaster career. Magee needs to take another step or two this season to get back on track, but has shown potential in spots previously. After that, we’re looking at a whole bunch of transfers or freshman. Which means they’re all unknowns.\nOhio State grabbed grad transfers Brad Sharp and Logan Soelberg from Yale out of the portal, both of whom were decently productive in the Ivy League. The Big Ten, as we all know, is a whole different animal, so the Buckeyes will be hoping that one of the pair can make the adjustment to make an impact in 2026. After that, it is just all freshmen. Twins Kevin and Owen Magee join the Buckeyes, and their older brother, in the midfield. Of note for those interested in trivia, this will make 4 players on the Ohio State roster who played at least some of their career at the same Texas high school (Lovejoy). Not bad for a club program out west.\nJake Struck joins from Olentangy Liberty m Columbus, after the most accomplished high school athletic career of any Ohio State recruit in history. Across all programs. Struck won state championships in football, hockey, and lacrosse during his four years at Liberty. Obviously, with that kind of schedule, Struck is only just scratching the surface of his lacrosse potential. But the Big Ten is a heck of a crucible. If Struck can get to a point where he’s making an impact like Liam White last year, you have to feel like that’s an excellent freshman season.\nAs a caveat to this, where pickings look a might slim, I’Il also point out the high likelihood that 3 to 4 players currently listed as attackmen will almost certainly run out of the box. Jack Bichelmeyer, who is a gigantic (6’5”) shooter, seems likely to give the midfield some heft. Melendez almost certainly will take a run out from there, as will Fin Watson or Christian Hogan. Hogan may also be a dark horse candidate to win the lefty attackman job some time this season, after dominating for Culver Military Academy at that spot. Things are going to be fluid, as you might guess.\nProjected Opening Day Starters: White, Sharp, Melendez\nFaceoff\nThe weakest position group on the team. It’s not close. And one of the freshmen is going to need to step up, because the returners are well below standard. Jack Oldman routinely got beat up at the dot last season, especially against teams with a pulse. And Coleman Kraske was a total nonfactor. The new reinforcements are wildly different players, as well. Dylan Furshman is maybe one of the least known, highly productive, faceoff players in his recruiting class.\nAnd that’s almost entirely due to the fact that he is determined to be a two-sport athlete. Furshman walked on with the football team, and is going to play lacrosse in the spring. Is this sustainable? Probably not. But kudos to him for trying. The biggest difference for Furshman versus other players doing this (Jordan Faison), is that Furshman is a technical specialist whose whole role is limited within the team.\nHe doesn’t have to know the offense that well, he doesn’t have to play defense as a matter of course, he just has to win the faceoff and maintain possession. If Furshman can balance that, then things could actually improve mightily. If not, there’s trouble brewing. The other freshman, Matthew Mayfield, is a former DIII commit who was a solid high school faceoff man, but is in Columbus for depth at the moment.\nHelpful for him is the fact that he is a lacrosse only guy, so he’ll have had a jump start on development. Ohio State just needs one guy to get above 50%, even when it’s hard. If they can get that, things will be golden for a deep tournament run. If not, then the Buckeyes could be out early, or not even make the tournament.\nProjected Opening Day Starter: Jack Oldman\nDefensive Midfield\nOhio State has managed to cobble together a decent defensive midfield unit the past couple of years, largely due to developing a walk on defender turned absolute stud in Greg Langermeier. From afterthought to lockdown guy, Langermeier was a stalwart player last year. Not as athletically gifted as some, he still managed to make things difficult for offensive players all season long. With his departure, Blake Eiland is the most accomplished returner. I’m going to beat this deceased equine again, but Eiland really should be an offensive middie.\nHe does more dodging than most of Ohio State’s offensive were able to do. But he isn’t that, and Eiland will be counted on to lead a very young group of shorty defenders. Dominic Shaw is back again, after playing extensively in the second half of last season. Shaw is on the Eiland path, an athletic player who can lock up opponents decently well.\nA little more body control in his game, and Shaw could get to all-American. The Buckeyes have finally recruited specifically for the SSDM role, and bring in freshmen Caden Smith and Owen Lee to play defense in 2026. Additionally, former Ohio Bobcat football player Brady Sestili joins the ranks. He’s been out of lacrosse for a while, but with a 6’3” frame and plenty of physicality, I imagine the transition will go better than it did for some other former football players who tried to play DI offense. Those five will likely be your rotation, with the potential for another one or two freshmen middies getting kicked over to make up numbers.\nAt LSM, Ohio State loses Jonny Cool, but returns Griffin Liedel and Corey O’Connor. Losing Cool is a pretty big loss, to be blunt. He was an excellent LSM. The Buckeyes will hope their returners, as well as a freshman pole, will be able to keep things steady for the 2026 season. This unit has been up and down, mostly down, since 2017, though it has improved steadily since 2021 or so. Their performance in 2026 will go a long way to determining the outcome of the season, positive or negative. Here’s hoping it’s positive.\nDefense .\nThis will be the second shortest preview, as the unit is the most stable. All three starters return from last season. Bobby Van Buren is old, exceptional, and an all-American. Cullen Brown is the most disruptive player in the country m passing lanes. Kyle Foster is extremely solid. They’ ll be good individually, probably great. As a unit, they need to get better off-ball. Slides and staredowns have been killer in big games. Clean that up, and you’re talking lights out.\nYou'll have to wait until next year for any change, barring injury.\nLock Opening Day Starters: Van Buren, Brown, Foster.\nGoalie\nCaleb Fyock is your starter, an all-American, and probably the best shot stopper in DI lacrosse this season. The other areas of his game need work. Defense is designed around letting him stop outside shots. Will be a wall.\nLock Opening Day Starter: Caleb Fyock.\nOutlook\nThe Ohio State Buckeyes are at a crossroads. Literally and metaphorically. This season, almost certainly, will determine the future direction of the program for the long-term. The lack of a contract extension this late into the current head coach’s deal is telling. Last year, given the results prior to the national tournament, ended completely unacceptably. To be utterly dominated in the opening round that way, after winning the only Big Ten regular season and tournament championships in the history of the league, was completely embarrassing. I was euphoric over the way Ohio State responded to a massive beatdown in their opening game. But the end left a bitter taste in everyone’s mouth. The Buckeyes have brought in yet another offensive coordinator to try to get the team to be an elite scoring one.\nI think James Purpura is going to be a tremendous asset, but I don’t know if he will be able to perform a miracle in one offseason. I also don’t know that failure to win in the tournament this season is enough to buy the current staff another year. The Buckeyes haven’t won a national tournament game since 2017. It will be almost a decade since that magic run. To go nine years without a win, and only a pair of appearances, when DI only has 70 teams, is tough to justify. Especially given the resources that Ohio State pours into its sports. And the success of formerly backwater programs at the university like the women’s hockey program.\nThe 2026 schedule is not one that is all that forgiving come tournament selection time, if the Buckeyes underachieve even slightly. The three biggest out of conference games are Notre Dame, Georgetown, and Denver. Ohio State has to beat 2 of them, or its season is in serious peril. Last year was phenomenal, but going 4-1 in conference play two years in a row is going to be seriously challenging. A 3-2 record in the regular season, with a pair of wins over marquee opponents, is both reasonable and pretty good footing, depending on who else the Buckeyes beat. At that point, one Big Ten tournament win is a must, with two giving the Buckeyes breathing room.\nThe pieces on offense are there. The defense will be a little bit softer in midfield, though the close D and goaltender should mitigate that with yet another year of continuity. Faceoffs will be critical, as I’ve already mentioned multiple times. Fail there, and you’re looking at a complete reset of the staff. I don’t think that is hyperbolic, or unfair. Nine seasons is a long, long grace period for a coach who is the most successful in program history, but whose greatest accomplishment was getting a national title game and losing. Then watching a no-name conference rival, Penn State, progressively transform itself into a perennial Final Four contender, while another goes to the Final Four in the same period without your program even getting a single national tournament win (Rutgers). The Wolverines have more Big Ten Tournament championships (2) than Ohio State (1), despite far, far less time as a varsity program.\nBottomline, it is a truly win or go home scenario right now. The Buckeyes should beat everyone up until they play Georgetown. Offhand, I think the Buckeyes beat Georgetown and Denver. I don’t think that they'll be all that close, if Fyock is at his usual level. Notre Dame is going to be very, very tough. I don’t think they have as much on offense as last year. But they’re going to be tough as nails defensively. Generously, the Buckeyes probably lose that game.\nI think that the Big Ten still runs through College Park, and that Penn State is gearing up to be a tough team, also. The Terrapins are bringing in more 5-star talent, especially an attackman, and are always stellar defensively. Penn State has Kyle Lehman and Hunter Aquino back. Johns Hopkins is rebuilding, though is always pretty talented. They just upgraded at goalie with a freshman 5-star, also. Rutgers is an also-ran of late, while the Wolverines are always dangerous due to the rivalry.\nThat 3-2 conference record looks likely to me, based on paper results and the unknowns at FOGO. I could be eating crow by year’s end, or look like a total homer. But that feels nght, with what is going on with the current staff, the pieces still to fit together, and known flaws. I would say that Maryland is likely a loss, and the Buckeyes split the Penn State/TTUN pairing. At 10-3, Ohio State looks pretty good. If there’s a tournament win in there, I think Ohio State makes its second consecutive national tournament for the first time in two decades (03-04). And only the 2nd time ever.\nThe tournament will be fascinating, assuming Ohio State gets in. If the committee tries to screw Ohio State again, we could be looking at a quick out for the team. Assuming Maryland, Penn State, and Ohio State make it, I imagine the Buckeyes will draw a top-2 ACC school. Or Ivy.\nAny of those spell trouble, frankly. Especially if the faceoff spot remains poor.\nDour call but I have a hard time calling this a win. Buckeyes lose in the opening round for the 2nd consecutive year.\nFinal prediction:\nOhio State regular season record: 10-3. Ohio State Big Ten tournament record: 1-1. Ohio State national tournament record: 0-1.\nLeading scorer: Alex Marinier, 45 goals, 3 assists\nTeam MVP: Bobby Van Buren.\nI am hoping for better. But that’s how I see it.\nGo Bucks! Bring on the show!",
  "word_count": 2935,
  "scraped_at": "2026-02-14T13:23:16.875250"
}