{
  "article_id": "32c662473825",
  "url": "https://www.newcastleherald.com.au/story/8316301/love-love-loving-everything-about-the-beautiful-game/",
  "title": "Daniel Scott on why he loves everything about the World Cup | Newcastle Herald",
  "date": "20230821T223000Z",
  "domain": "newcastleherald.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "AS a staunch Lionesses fan, who attended Sunday night's final after miraculously snaffling tickets last week directly from the FIFA website, even I expected myself to wake up on Monday morning feeling sad, deflated and/or \"devo'ed\" as the local parlance calls it.\nSubscribe now for unlimited access.\nor signup to continue reading\nInstead, I am playing Always look on the bright side of life by Monty Python on loop, with a huge smile on my face.\nInstead, I am feeling immensely proud and excited to have been able to witness what I believe is the greatest women's sporting event of all time, staged in my now home country.\nInstead, I am proud to have witnessed England battle through four games live and deservedly lose in an epic final.\nI have been writing about women's football since the mid 1980s when I created my first play The Winter Dreamer in a dank, depressing and dangerous suburb of Manchester called Hulme.\nIt was about Babs, a female goalkeeper, pursuing the then impossible dream of becoming a professional footballer in England. At the end of the play she has to leave for Italy to achieve her ambition.\nThis World Cup has shown how far women's football has come since then. This has to be celebrated by anybody who loves the beautiful game and/or has a feminist chromosome in their body.\nI have two football playing teenage daughters and they were with me at the Lionesses' quarter final, semi final and in the Cup final on Sunday night.\nThey supported the Matildas in the semi and one of them half-seriously supported Spain last night. Fine by me, they were always going to go their own way.\nI love how we all got behind the Matildas and how colourful and passionate but mostly mature and fair all the crowds were.\nI love that Sam Kerr scored the goal of the tournament against England.\nI love that we nearly reached two million supporters inside the grounds for this tournament, something scarcely believable to somebody who, only in 2019, took his daughters to see Manchester United Women play their first English Super League game in front of just 3000 fans.\nI love that Spain won in spite of long running quarrels with their coach and that the scorer of the winning goal Olga Carmona celebrated her goal by honouring the memory of her friend's recently departed mum.\nI am glad that Spain won because later Sunday night Carmona found out that her dad had died on Friday.\nI love how Sunday night was a huge and excited atmosphere - one of the best I have been in and I have been to thousands of matches around the world - even though the Matildas were not there.\nI loved shaking hands with gleeful Spanish supporters, and hugging one or two, as I left the Olympic Stadium. I have a Spanish sister-in-law and niece.\nThis is truly the world game.\nHowever, to me, the enduring image of the entire World Cup, and I mean this in a wholly positive way, was when the England and Manchester United goalkeeper Mary Earps saved that penalty.\nClasping the ball hard to her chest, she stuck her broad tongue out of her mouth, and let out a huge \"f--- off\", apparently to the Spanish and the referee.\nHowever, to my mind it was also to all the people who doubted her (including me), to those who thought it was OK not to produce a replica of her goalkeeping kit so that young girls wanting to emulate her were prevented from doing so.\nIt was a celebratory \"f--- off\" of resilience and defiance.\nAnd this Women's World Cup has been exactly the same.\n\"Listen to us, see us thrive\" the incredibly talented players and female coaches of this competition seemed to say.\n\"Watch out you pampered overpaid male sports stars, this is how you do it, and we are coming for you!\"\nGoal of the tournament: Sam Kerr (Australia); Coach of the tournament: Sarina Wiegman (England); Player of the tournament: Olga Carmona (Spain)",
  "word_count": 679,
  "scraped_at": "2026-02-14T12:40:11.952219"
}