{
  "article_id": "32ee267d671c",
  "url": "https://www.irishmirror.ie/news/news-opinion/what-if-russia-invaded-ireland-34692138",
  "title": "  God help us if Russia decided to invade Ireland in the morning - we would be like lambs to the slaughter  - John Kierans",
  "date": "20250218T061500Z",
  "domain": "irishmirror.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "'God help us if Russia decided to invade Ireland in the morning - we would be like lambs to the slaughter'\nWe need to increase our number of troops from 7,500 to 30,000 as quickly as possible. A year-long national service for young people should be considered\nGod help us if Russia decides to invade Ireland in the morning. All it would take is an attack force of 20,000 troops and we would be like lambs to the slaughter.\nWe can shout all we like that this country is neutral - but mark my words, the butcher of Moscow Vladamir Putin would not give a damn.\nThe politicians of this country are asleep at the wheel when it comes to the Russian threat. The Left wear their Irish neutrality badge with great pride and honour and naively think no other country in the world would dare invade us. How stupid and ridiculous they are.\nLet me tell you a few home truths. It took this country 700 years to win our freedom from British rule and after 100 years of democracy, we are now in danger of jeopardising it all because we don't take our defence seriously.\nSecondly, never in the history of either the Soviet Union or Russia itself has Moscow had such an interest in this country. If you speak to any foreign diplomat in the know or international defence expert, they will tell you straight up that Russia has carried out more manoeuvres in Irish waters in the past few years than it did in decades.\nThey also have more spies - yes spies, I am not making this up - in Dublin than any other city in the world. Why is this? Ireland from a strategic point of view has become very important in global affairs.\nDublin is the tech capital of Europe and all the US multinationals have their headquarters here. This means their ongoing research and development is of huge consequences for the rest of the world and the defence industry.\nFrom an invasion point of view, Ireland is the backdoor entrance to the United Kingdom. It wasn't considered by the Nazis during World War 2 but is very much in play now.\nAll the internet cables for the world land on our west coast and pass through our country, so if you want to shut down the internet and the financial markets, you shut down Ireland.\nWe are also seen as a major food supplier and in the event of a nuclear war, a country like Ireland, if it avoids a nuke attack, could feed many countries and would be crucial to a nation like Russia.\nOur Government, of course, knows all this, but pays lip service to defence and is asleep at the wheel. It made a big song and dance over the weekend that an extra 2 billion will be spent beefing up our Defence Forces over the next few years when we should be spending that extra amount every single year.\nWe need to increase our number of troops from 7,500 to 30,000 as quickly as possible. A year-long national service for young people should be considered.\nRecruitment for the IRA - the Irish Republican Army - which is the name of our defence force in English, should be one of our top national priorities. We need new ships to patrol our seas and 20 fighter jets to patrol our skies. The politicians don't want to make an immediate defence investment and instead want to do it over several years.\nIf we look at what happened over the past few days, we saw President Trump and the United States betray Ukraine and betray Europe. He is prepared to give Putin whatever he wants to end the war with Kiev. Trump, at this moment in time, doesn't want Ukraine or Europe at the negotiating table.\nThe new pro-Putin strategy of the White House must be a wake up call for all of Europe and we now know we can no longer depend on America to help defend us against the Russian bear. We now need a new EU army to defend the bloc and to ensure Moscow does not try to invade any European Union territory. Forget neutrality, Ireland needs to be part of that European army.\nIt also means that every country in Europe will have to double its defence spend to between 3-5 per cent of GDP and not before time. A deal may well be struck with Ukraine and the war will stop, but how long will it take before Putin breaks the new treaty and makes another land grab in Europe?\nWe would all like peace with Russia. The Russian people are not the problem, it's Putin himself. He has been a dictator now for over two decades and his dream is to recreate the old Soviet Union, but it will never happen.\nEurope now knows it can not depend on America any more and has to stand on its own two feet. Perhaps Trump has done us a favour. Europe united with its own army will be a force to be reckoned with.\nIt now looks that the days of NATO under the leadership of the USA are very nearly over.\nSex for rent\nThe Government is looking at bringing in a new law to ban sex-for-rent. The move will criminalise sinister landlords who want to take advantage of vulnerable women and is long overdue.\nA recent report by Women's Aid found the problem was rampant right across the country.\nMusk-like approach to waste required in Ireland\nI would love it if someone would go through the budgets of all our Government Departments with a fine tooth comb just like Elon Musk and his team are doing in America.\nThe amount of waste Musk is discovering is incredible, including claims (that fact checkers were unable to verify) that people aged 150 years old are claiming social security, for instance.\nThe amount of taxpayers' money wasted in Ireland is infuriating and we as a country do not do enough checks to ensure we are getting value for money. I bet you the Civil Servants would do everything in their power to stop such an investigation happening.\nCongratulations\nCongratulations to my journalistic colleague, the former TV newsreader Alison Comyn, who has been appointed to the Seanad by Taoiseach Micheál Martin.\nShe did very well in the General Election in Louth, getting over 5,000 first-preference votes and just missing out on the fifth seat. She will be a great voice for my home town Drogheda in the Upper House.\nA fitting final Merseyside derby in Goodison\nWhat a fantastic Merseyside derby it was between Everton and Liverpool last week.\nEmotions were running high as it was the last derby match to be ever played at Everton's home ground Goodison Park before they move to their new stadium in the city's docks next season.\nThe match was all blood and guts and got the box-office finish it deserved when Everton got a cracking equaliser in the 99th minute of injury time with the last kick of the game.\nThe 2-2 draw was a fair result and Everton fully deserved their point. The atmosphere was just immense for the whole game.\nGovernment getting tough on International Protection Applicants\nThe Government at long last is taking a hard line on International Protection Applicants.\nIt turns out that 80 per cent of those who applied in the last year have no legal right to be here, and are economic migrants coming from safe countries where their lives are not in danger.\nThe state will now start using charter planes to deport illegal immigrants in the coming weeks and this will speed up the process.\nLeague of Ireland on the rise\nThe league of Ireland is really on the up, especially when you see over 30,000 people watching Bohs v Shamrock Rovers at the Aviva Stadium.\nThe Government now needs to give each of the Premier League clubs substantial grants to improve their grounds, just like they did for the GAA around the country.\nIf the standard of football stadiums gets better, the numbers attending will also increase. The LOI is no longer the problem child of the FAI.\nOvercrowding in Irish prisons\nThe overcrowding in Irish jails is seriously worrying. Every prison in the country is full to the brim and it will be years before a new jail will be built. It is not right for hundreds of prisoners to be left sleeping on mattresses.\nJoin the Irish Mirror’s breaking news service on WhatsApp. Click this link to receive breaking news and the latest headlines direct to your phone. We also treat our community members to special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. If you’re curious, you can read our Privacy Notice.",
  "word_count": 1487,
  "scraped_at": "2026-02-14T12:11:04.456785"
}