{
  "article_id": "331a4255bfad",
  "url": "https://www.cityam.com/wiegman-slams-player-coach-relationships-amid-leicester-city-investigation/",
  "title": "Wiegman slams player - coach relationships amid Leicester saga",
  "date": "20240326T173000Z",
  "domain": "cityam.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Wiegman slams player-coach relationships amid Leicester City investigation\nEngland manager Sarina Wiegman has weighed in on the player-coach relationship debate in women’s football, describing such associations as “very inappropriate”.\nThe Lionesses’ boss was asked to comment on the situation after Leicester City boss Willie Kirk was placed under investigation by his club after he was accused of indulging in a player-coach relationship.\n“I think player-coach relationships are very inappropriate,” said Wiegman, whose Lionesses side take on Sweden in a Euro 2025 qualifier on 5 April.\n“We should not accept that and it’s not healthy. That is basically what it is. In our environment, it’s a professional one. It’s all about performing and it should always be safe. Things can happen, but it’s inappropriate and we all should be very aware of that.”\nManagers on player-coach relationships\nThe subject has been a hot topic in the Women’s Super League with Chelsea boss Emma Hayes recently forced to apologise for suggesting player-player relationships were inappropriate despite some of her players being involved in relations.\n“Player-coach relationships are inappropriate,” Hayes said on player-coach relations.\n“We have to look at it in the context of where the game has come from. We’re in a professional era now where the expectation in place for players and coaches is such that all of our focus and attention has got to be on having the top standards.”\nManchester City manager Gareth Taylor said: “I think player-coach is inappropriate. We’ve seen it happen, but when a person holds a position of power it’s really not the right thing. For me, player and staff is not acceptable.”\nArsenal manager Jonas Eidevall said: “I think it’s very inappropriate for a number of reasons. It’s a clear no with relationships between player and manager.”\nEngland face Sweden, France and the Republic of Ireland in their Euro 2025 qualification group.\nThe competition will take place in Switzerland.",
  "word_count": 315,
  "scraped_at": "2026-02-14T12:57:11.761826"
}