{
  "article_id": "332c0c0d7859",
  "url": "https://www.marxist.com/spanish-school-students-struggle.htm",
  "title": "The Spanish school student struggles of 1986 - 87 and the role of the Marxists | Spain",
  "date": "20240712T183000Z",
  "domain": "marxist.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Spanish student strike of 1986/87 was an epoch-making movement, lasting three months, involving three million school and university students, with hundreds of thousands in demonstrations, which ended up in a victory against the Socialist Party government. This document, written at the time by Alan Woods, is a blow-by-blow account of the movement which draws out the main political points. Alan was in Spain for most of the struggle, involved in daily discussions with the leading Spanish Marxists which led the movement.\nThe movement took place nearly ten years after the revolutionary events of the struggle against the Franco dictatorship. The defeat of that movement, which was derailed by the leaders of the Spanish Socialist and Communist parties into the safe channels of a bourgeois democracy (crowned by the hated monarchy which Franco had restored and with impunity for the crimes of the dictatorship) had opened a period of ebb and demoralisation amongst the working class and youth activists of that generation.\nAll the official commentators, journalists, learned sociologists and such like, had determined that the generation of youth which followed that period was apathetic and uninterested in politics, they said it was the generation of pasotismo (“I don’t care”). There was certainly a deep mistrust of official politics, at a time when the PSOE (Socialist Party) had won an overwhelming majority in 1982, but then proceeded to carry out anti-working class policies. Having promised to never join NATO, then did a 180 degree somersault and advocated a “yes” vote in the 1986 referendum. Having promised to improve education and health care, it then proceeded to implement cuts. Having come to power on the promise of delivering for working class people, it then carried out a bloody assault on jobs in the so-called reconversión industrial (industrial restructuring), closing down state-owned enterprises and destroying whole communities. On top of this, it launched a dirty war against Basque nationalists, creating the GAL paramilitary death squads. No wonder young people were disgusted and thought “all politicians are the same”.\nThis was the setting for one of the biggest explosions of struggle Spain had seen for a long time. But it was not a given that the movement would acquire the proportions it did, nor that it would last for so long and even less that it would end up in a victory. Leadership was a key factor, and it was provided by the Marxist tendency.\nAt the time, Nuevo Claridad, as the organisation was known, named after the paper of the left wing of the Socialist Party in the 1930s, had just reached 1000 members, but many of those were old-timers from the struggle against the Franco dictatorship, who had become inactive and were really sympathisers rather than active militants. The organisation had a handful of youth and had organised student agitation around the NATO membership referendum at the end of 1985, particularly in Alava and Navarre. Out of that, the idea of a School Students Union (Sindicato de Estudiantes – SE) was born, but the union did not yet have a mass base. It counted on only a few points of support in Madrid, Catalonia, Malaga, Seville and the Basque Country.\nHowever, that small organisation took a bold initiative. After having analysed correctly the situation of pent-up anger which existed amongst the youth, and having seen the results of the initial call for a demonstration in Madrid at the end of 20 November 1986, it issued a call for a nation wide school strike on 4 December. That was a gamble. No one knew whether the call was going to have an impact and we certainly did not have the forces to organise it properly. However, the strike grew like wildfire and was the starting point for the whole movement. The conditions were ripe and all that was needed was a point of reference. In the student field, with very few or no organisational traditions, even a small organisation, in the right conditions, could have a mass impact.\nThe document explains the different aspects of the work involved in leading such a mass movement. From the question of self-defence against attacks by the fascists and the police, to how to deal with the media, how to give the movement a democratic and unified leadership in the face of sectarians and reformists, and the question of how to gain the sympathy of workers for the student movement. Alan Woods brings out many aspects from which general lessons can be learned.\nOne of the most important lessons is about the role of leadership. It is possible that a student movement would have taken place without the role played by the Marxist tendency, but it would probably have taken the form of a spontaneous explosion of anger, with different parts of the country coming out a different times, descending into riots and disorganised clashes with the police (as a result of the action of police provocateurs). It would have certainly not lasted for so long, not have had the same unified character and it would certainly not have ended up in a victory.\nThe role of a Marxist leadership, with clear ideas, an understanding of the lessons of past movements, the character of the state and the police, a firm orientation towards the workers’ movement and a sense of tactics and strategy was crucial.\nThe movement had a big impact on the working class in general. This was not by chance. The Marxists at the head of the Students’ Union had a deliberate policy of orienting the students towards the labour movement, both by making appeals to its leaders as well as trying to establish links from below.\nWe were fighting against a PSOE government which had been elected with the votes of millions of workers just four years earlier. Our approach was “this government was elected by workers but it is ruling for the bosses – we are the children of the working class and demand that the interests of the majority are put first”. This clearly connected with the mass of workers without whose sympathy and support the students would have been unable to win.\nOne incident illustrates the level of support there was. In Tarragona there was a student strike committee led by the SE which met daily, made up of representatives from about 40 different schools. When the question of going to the labour movement was posed, a student who was a delegate from one of the largest high schools in the city said that his dad was a shop steward at the local harbour. Through that we got an invite to address the mass workers’ assembly in which work was shared out amongst the workforce. So, a group of us, school students between 15 and 17, went down to the harbour at the crack of dawn to address a meeting of hundreds of dockers. It was a frightening experience! The workers listened to what we had to say and gave us a rapturous applause. A bucket collection was held in which we raised 100,000 pesetas (a lot of money at the time, perhaps €4000 today). In addition, the shop stewards committee then said they would match that amount and would raise the need for solidarity action at the national meeting of the Coordinadora, the national organisation of dockworkers. Finally the Coordinadora agreed a one hour work stoppage at all Spanish harbours in solidarity with the students.\nIn fact, in the end, one of the factors which pushed the Education Ministry into making substantial concessions was precisely the fear that the movement would spread to the working class.\nThe victory of the student movement had a massive impact on Spanish society in general. This was the first time that any movement had managed to defeat the PSOE government. This encouraged different sections of workers into struggle. Immediately after the students’ movement there was an insurrection in the working class town of Reinosa in Cantabria, in which the workers fighting to defend jobs in the local steel mill faced up to the brutal repression of the Civil Guards (a military police force), which used live ammunition, armoured vehicles and a helicopter.\nA year later, when the government introduced a so-called “youth employment scheme”, there was another massive movement of the students which then culminated in a 24-hour general strike called by the main trade unions on 14 December 1988, which brought the country to a stand-still. Undoubtedly, the example of the 1986/87 student movement served as an inspiration to that mighty strike which forced the government to back down.\nWe hope that this document will be useful in arming a new generation of revolutionary student activists by bringing out some of the main lessons of the Spanish student movement of 1986/87 and the way it was led by revolutionary Marxists.\n[We attach a glossary of abbrevations and organisations at the end of this article]\nIntroduction\nThe present document was written over a period of three months beginning in December 1986 and ending with the signing of the historic agreement between the Spanish School Students’ Union and the government of Felipe Gonzalez.\nIt constitutes a blow-by-blow account of the unprecedented movement of millions of Spanish youth which succeeded in defeating the combined might of the Spanish state, winning major concessions and effectively opened the floodgates for the massive wave of strikes and demonstrations which followed.\nIt is no longer possible to doubt the truth of the assertion that the mass movement of the youth, organised and led by the School Students' Union under a conscious Marxist leadership, served to detonate the movement of the Spanish working class. This much is admitted by every serious capitalist commentator, both in Spain and internationally.\nThus the American magazine Time, in its edition of 27 April 1987, analysing the strike which paralysed Spanish society up to and during Easter, made the following observation:\n“The first outbreaks erupted last January, when hundreds of thousands of high school and university students… launched a series of demonstrations against proposed educational reforms. The students demanded more government funding for higher education, lower tuition fees and the abolition of selective admissions. On at least a dozen occasions the marches degenerated into pitched battles with the police [??]. When the government finally granted most of the students' demands, the concessions set off a chain reaction: doctors, nurses, professors, farmers, shopkeepers, pharmacists, even motorcycle messengers launched stoppages. Says a government official: 'The student protest was the detonator for everything else. The students got what they wanted by taking to the streets. Now everyone comes out on strike for the smallest thing.'”\nLeaving aside the erroneous evaluation of the mass youth demonstrations, which never 'degenerated into violence' despite the myth assiduously cultivated by hostile bourgeois commentators, the general point about the significance of the movement is clearly made. Such quotes could be multiplied at will.\nThe role played by the mass movement of youth in providing a focal point for the accumulated discontent of millions of workers would be sufficient, in and of itself, to warrant careful analysis by Marxists. But it is equally clear that without the programme, policy, tactics and strategy pursued by the leadership of this movement it would never have had this effect, and, indeed, would have very quickly gone down to defeat. This second consideration is even more important from a Marxist point of view. It brings out the crucial role of the subjective factor in the class struggle, or to put it more clearly, the crucial role of leadership.\nEven such a blatantly anti-Marxist publication as the British New Statesman was compelled to pay grudging homage to the role of the Spanish Marxists in the organisation of a successful mass youth movement. In its edition of 24 April, we read the following:\n“Secondary students who caught the headlines at the beginning of the year have been very effectively organised by a ‘militant’ tendency which is grouped around a weekly called Nuevo Claridad. The burst of teenage political activity caught the government by surprise and was greeted with delight by the UGT which provided Nuevo Claridad and the Student Union with printing facilities, meeting rooms and funds.”\nThis belated recognition of the role of the Marxists in the international capitalist press – that same press which did its best to silence the news of the movement of three million Spanish youth while it was taking place is only a faint echo of the tremendous impact it had on the psychology of all classes in Spanish society and in particular on the working class who saw in practice how it was possible to take on and defeat the government, on the basis of united militant mass action.\nIn the months following the end of the schools strike, Spanish society has been shaken by wave after wave of strikes involving practically every section of the working class. The Spanish workers are rediscovering in action the great revolutionary traditions of the past. Yet the leaders of the main workers' organisations have turned out to be the main obstacle in the path of the workers' movement. Their complete lack of faith in the working class and total abandonment of any socialist perspective was summed up in the words of one of the leaders of the Catalan ‘Communist’ Party, the PSUC, who wrote in the pages of El Pais: “On the day after D-day [i.e. after a general strike – Ed] in all the workshops the question would be: ‘And now, what?’ And since we do not possess the answer, it would be preferable not to give rise to the question.”\nOnly the Spanish Marxists, the supporters of Nuevo Claridad, have consistently argued in favour of a 24-hour general strike, linked to the idea of a struggle to transform the unions and Socialist Party and a fight for real socialist policies, as the only alternative to the right-wing policies of the Gonzalez government.\nMarx once said that, for the mass of the working class, one real step forward in the struggle was worth a hundred correct programmes. By their leadership of three million youth, which led to a historic victory, the Spanish Marxists have proved the superiority of their ideas not in theory alone, but in practice also. In the course of the recent strike wave, many worker-activists commented that “we must do the same as the students.” What they mean by this is that they must adopt the programme, policy, methods and tactics of Marxism as the only way to achieve what they are fighting for. That is a conclusion that will inevitably be reached by the workers of all countries on the basis of their experiences in the period which lies ahead.\n1 June, 1987\nThe Spanish school student's struggle: part one\nThe recent movements in France and Spain provide yet another indication of the extremely unstable and volatile situation of European capitalism. They are an important symptom and a harbinger of even greater movements in the future involving not only the youth but the whole of the working class.\nAll tendencies, except the Marxists, discounted the possibility of major movements of this type, preferring to believe that there was a general turn to the right, ‘reaction’, the youth were supposed to be ‘apolitical’ and so on and so forth.\nYet it was inevitable that those processes of discontent, anger and frustration, silently accumulating within the deepest recesses of the masses, should suddenly burst forth. Herein lies the inevitability of sudden and sharp changes in the situation.\nIt was also predictable – and predicted – that the first layers to move would be the youth, and particularly the student youth, that layer most sensitive to the general moods within society. It is clear that the student movement in general does not have an independent significance. Yet historically it can act as a most sensitive barometer, whereby to measure the moods building up within the mass.\nThe significance of the French events is self-evident and will be analysed elsewhere.\nHowever, from a Marxist point of view, the movement in Spain was still more significant. The deliberate conspiracy of silence in the bourgeois press internationally was no accident. Because of its movement and scope the situation in Spain itself was front-page news.\nThis was the biggest movement in Spain for ten years, and the biggest movement of the school students in the history of Spain. Yet the British Guardian devoted more space to the Christmas lottery in Spain! This was typical of the foreign media in general.\nThe significance of the Spanish events was that the strike movement from the beginning was organised, planned and led by the Spanish Marxist Tendency, represented by the journal Nuevo Claridad and the youth organisation founded by comrades expelled from the Spanish Young Socialists (JJ.SS) ten years ago, Jovenes Por el Socialismo (Youth For Socialism).\nNor is it strictly correct to describe the Spanish movement as a ‘spinoff’ of events in France. Undoubtedly the French events had a big effect on the consciousness of the Spanish youth. But the strike call for 4 December was issued long before by the School Students' Union (SE), an organisation set up about a year ago by the supporters of Nuevo Claridad and JPS.\nFor three months, from September on, these comrades conducted mass agitation and propaganda in the schools all over Spain, but particularly in Madrid. This preliminary agitation was used as a means of gauging the mood of the youth. The results were a surprise even to the most optimistic comrades.\nLong before the explosion in France, the young Spanish comrades were reporting back that an explosive mood existed in the schools. On that basis they decided to issue a call for a general strike in the schools on 4 December.\nThe austerity programme of the Gonzalez government has led to vicious attacks on living standards, factory closures and cuts in real wages. Young people, as always, are among those worst affected.\nThe conditions in Spanish education are among the worst in Europe. Education was not free. Many schools charged for lessons. All textbooks and materials (from primary level on) had to be paid for and constituted a major drain on the budget of working-class families. At university level matriculation had to be paid. Only a negligible number of students got grants, and those were ridiculously low.\nIn a context of mass unemployment (22 percent officially) many working-class parents make big sacrifices to try to guarantee the best possible education for their children, in the vain hope of giving them a better start in life. Yet Spanish universities, even more than elsewhere, are dominated by the children of the rich. Therefore, the slogan of “the workers' children to the university” has had an important echo among workers, probably more so than in other European countries.\nThe immediate issue was the exclusion of several thousand school students, who had passed all the necessary exams, from university. A committee of non-admitted students was formed. The SE intervened, calling a demonstration in November in Madrid. The response to this demonstration, to which 5,000 turned up, convinced the comrades that the 4 December strike could get a big response, although nobody suspected what dimensions it would acquire.\nThe main demands at this stage were as follows: (1) Admission to university of all the non-admitted students to the faculty of their choice. (2) Suppression of the laws limiting access to the university, abolition of selectivity and quotas. (3) Immediate reduction in matriculation fees. (4) Maintenance of all entrance exams in September. (5) Progressive reform of the Education Statute: school councils to be composed in equal parts by teachers, parents and pupils. (6) Immediate withdrawal of the Ministry of Education circular regulating school and extracurricular activities. Immediate abolition of Paragraph 9.2 of the Circular, because of its repressive character, and its substitution by norms of conduct drawn up equally by teachers, parents and pupils, to regulate the democratic life of the centres of education. (7) Drastic increase in the amount of money dedicated to public education.\nThose demands generally reflected the main grievances of the students at that moment in time. They did not yet represent a fully worked-out political programme, but reflected the initial stage of awakening of the movement.\nNevertheless, even then they represented a fundamental attack on the government's austerity programme. In order to carry these out it would be necessary to reverse the cuts in education and would involve major increases in public spending.\nA couple of these points require some explanation. The Minister subsequently denied vehemently that he intended to abolish the September entrance exams. However, there is firm proof that such a plan existed, and was only averted by the strike on 4 and 17 December. This retreat on the part of the government was one of the first gains made by the movement.\nPoint (6) relates to the statute regulating discipline in the schools. This was drawn up in 1954 at the height of the Franco dictatorship and represents extremely reactionary and draconian regulations. As a result of the struggle over the past ten years this had been effectively turned into a dead letter. Yet now the ‘Socialist’ government proposed bringing it back into effect, thus bringing about a counterrevolution in the internal regime of the schools. As a result of the December strike, the government was compelled to retreat on this demand also.\nThe work of organising and preparing the strike was carried out by the SE. Nevertheless, in theory, other forces were involved. The strike was called in the name of three organisations: the Union, the committee of ‘non-admitted students’ and a ‘Coordinating Committee’ which was set up, in the first place, to coordinate the schools and universities. Because nobody doubted the leading role of the SE, the Marxists in practice dominated all three organisations at the outset. It is important to clarify this point, in view of subsequent events. A negotiating committee was elected composed of 15, again effectively controlled by the Marxists, but with a majority of unorganised school students, and with the presence of one sectarian (Lambertist) and one Communist Party (PCE) member.\nIn the period leading up to the strike, all the schools in Madrid were visited several times. The Union carried out systematic leafleting and distributed a printed poster calling for a strike and demonstration on the fourth.\nGiven the semi-Bonapartist nature of the laws in Spain, it is necessary to get police permission for a legal demonstration ten days in advance. It was important that the demonstration be legalised to encourage the widest layer of youth to attend and reduce the risk of police attacks.\nIt must be stressed most of these initiatives were taken by the leading youth comrades themselves. Most of the attention of the leading Marxists was focused elsewhere on the trade union elections and Basque regional elections which were taking place at the same time and which posed a series of difficult and complicated tactical problems. The bulk of the work of organising the strike was therefore left in the hands of the youth, who, it must be said, behaved in an exemplary fashion.\nOn the strength of the reaction of the youth in Madrid, it was becoming increasingly clear that there were big possibilities. Therefore the pressure was put on the provinces to follow suit.\nThe reaction of the comrades in the provinces was uneven. Some areas, like Catalonia (Barcelona, Tarragona) responded well, in the South, too, the work was put in (Seville, Cadiz, Malaga). However, other areas lagged behind. Some claimed that there was no mood among the youth. The Basque Country, which had originally led the way with school strikes of thousands called by the SE last year in Alava and Navarra, was preoccupied with the regional elections. Only at the eleventh hour was the strike call issued in Alava, a strong point for the Marxist Tendency.\nMeanwhile in Madrid, efforts to get support in the University were hampered by the poisonous scepticism and outright sabotage of the PCE and the sects. Partly their attitude was dictated by their hostility to the Marxist Tendency, but it was also the result of their complete lack of perspectives and blind empiricism. They believed that nothing would happen. “There is no mood.” “The time is not right.” In the moment of truth they were all caught with their pants down.\nThe comrades were confident of a good response on the fourth. They hoped that a few tens of thousands would turn up to the demonstration in Madrid. But they were completely staggered by the enormous turn-out, which was certainly more than 100,000.\nThe way that a relatively small group of Marxists handled such a massive number of people, which at times threatened to overwhelm the organisers, was impressive.\nThe number of stewards was wholly inadequate to control the situation. Furthermore, they were virtually unarmed. Yet had it not been for the small group of comrades a disaster would have occurred. Gangs of neo-nazi youth turned up to attack the demonstration with knives, clubs and bicycle chains. When the demonstrators pointed this out to the police, who just stood by as young girls were battered to the pavement, they replied: “That is your problem.” But when the youth fought back and drove the fascists away, the police immediately waded in with their batons, attacking not the fascists, but the students. This was a vital lesson to the youth on the nature of fascism and the bourgeois state. A price had to be paid for the lesson. A few demonstrators ended up in hospital. Had it not been for the active intervention of the stewards, things would have been a lot worse.\nIn Barcelona, as the demonstration was gathering with 8,000 already present, the police attacked viciously without warning, injuring a number of students and making six arrests.\nFrom all over Spain, news came flooding in of the tremendous response to the strike. The figures reproduced here are provisional and undoubtedly conservative. The Union's slender resources did not permit it to collect all the information even in those places where it had called the students out. However, it is evident that the impact of the strike call went far beyond those areas, and towns and villages came out where the Union had nothing. In many cases whole towns came out on the strength just of letters or phone calls to the schools, calling them out. Therefore, these figures have to be doubled or trebled to give an accurate idea of the numbers involved.\nIn the centre of Barcelona, at least 20,000 came out (21 schools confirmed) and 15,000 participated in the demonstration. However, there was also a big response in the industrial towns and villages of the ‘red belt’ around Barcelona, like Hospitalet, Bajo Llobregat, and so on.\nIn Zaragoza, the response was 100 percent, with 29 schools out and 50,000 on strike, and a demonstration of 15,000. Relatively this result was the most important of all. The Workers' Commissions immediately declared its support. The University, which was initially not going to participate, was quickly brought to a halt by picketing. The movement extended to all the outlying villages. Support came from three or four parents' associations. A delegation turned up to the demonstration of 25 sacked workers from the TUZSA company. When the latter tried to address the demonstrators they were attacked by the police, but were saved from arrest by the demonstrators.\nAt four o'clock in the afternoon, there was a meeting of 60 delegates from all the striking schools and colleges called by the SE. A communique was read out by the representatives of the Union and unanimously adopted. The work of recruiting into the Union began in earnest.\nIn Seville, at least eleven schools, 15,000 came out. 2,000 participated in the demonstration. But the main turnout was in the outlying villages, about which little information was available on the fifth, but where the response was almost certainly 100 percent. In Malaga, 10 schools were out with 15,000, and 5,000 on the demonstration.\nIn backward Galicia, in the North-Western corner of Spain, there was 100 percent response in Ferrol. This was one of the very few places where the strike leadership was not in the hands of the Union (although the latter participated) but in that of a Coordinating Committee which had been formed earlier. Seven schools were out, 12,000 students, with 3,000 on the demonstration.\nIn Vigo, nine schools with 10,000 students came out. But here the situation was complicated by the fact that a layer of the students were suspicious of the Union, and refused to hold a joint demonstration. Two demonstrations were held, of 1,000 and 500 respectively. These differences were later easily sorted out.\nIn the Basque Country, the strike call was hampered by reasons already explained. In Alava, the strike was called at very short notice. Yet the majority obeyed the call in Vitoria (4,000) and there was a gathering of 500 students, addressed by local leaders of the SE.\nThe most incredible situation arose in Navarra, where the Marxists, having initially pioneered the Union and led big strikes a year earlier, had misread the mood in the schools. To be fair, here we had the immensely complicating feature of the national question. The youth organisation of Herri Batasuna, Jarrai, in a typical ultra-left adventurist fashion, had tired out the youth with one general strike call after another. The comrades feared that yet another strike would have no response, and therefore limited themselves to making a public statement supporting the national strike, and expressing solidarity with its aims, but proposing only to call action at a later date. Nevertheless, the following day the strike was 100 percent solid in Navarra. Fortunately as a result of the excellent work done by the comrades in the previous twelve months they did not have to pay a heavy price for their mistake. Though the strike had not been formally called by the Union in Navarra, in every school the students identified themselves with the Union and publicly defended its demands. More than anything else, the situation in Navarra showed two things: (a) that a mood for struggle existed among the mass of school students, and (b) that an enormous authority had already been built up for the SE.\nAfter the fourth\nThe impact of the movement was immediate. In Madrid, the police had authorised the demonstration, but only to go as far as the Plaza de Espana, and not to the Ministry of Education, as originally requested by the organisers. But faced with a militant demonstration of 100,000 youth, the police decided that discretion was the better part of valour, and allowed it to proceed to the gates of the Ministry, where, to everyone's surprise, the negotiating commission (or part of it) was allowed in for discussion of the students' grievances.\nIn such a situation, it would have been an obvious error to refuse to negotiate. It was clear that the movement had caught the Ministry and the government completely off balance. The mood of the authorities, by all accounts, bordered on panic. It must be borne in mind that the movement had now erupted in France. The streets of Paris were the scenes of massive demonstrations and violent clashes. This clearly had an effect on the imagination both of the government and on the students of Spain. We have it on good authority that the higher echelons in Madrid were buzzing with rumours about the possibility of a new 1968 situation in Spain – i.e. the coming together of the student agitation with a massive explosion of the working class.\nIt is one of those ironies with which history is so rich that Maravall, the Minister of Education, had as a student, participated in the demonstration in Paris in 1968!\nThis was no idle talk or wishful thinking. Such a possibility was – and still is – rooted in the situation, although such a development will not necessarily take place as a result of the present situation.\nThe undercurrent of discontent within the working class in Spain can be gauged by the results of the recent trade union elections, whereby under Spanish law, all factory delegates (the equivalent of shop stewards) must be elected every four years. The socialist (pro-government) UGT suffered a series of shattering defeats in the strategically vital large-scale enterprises (telephones, railways, etc.). Of course, the leadership of the ‘Communist’ Workers' Commissions (CCOO) is every bit as reformist as the UGT. But this vote was correctly understood in the press internationally as a warning signal to the Gonzalez government that the workers' patience was reaching its end.\nThere is no doubt that this defeat has sparked off a crisis in the UGT. Nicolas Redondo, the general secretary of the UGT, alone this time made a speech which was recorded in the Spanish press to the effect that the French government had been forced to back down by the students' mobilisations, and this was something the Spanish labour movement had to take seriously into account. He also warned the government that the workers had already made sufficient sacrifices and that they would no longer be prepared to be made the whipping boys for the crisis of capitalism.\nThese elements, in and of themselves, illustrate the explosive contradictions which are maturing within Spanish society. All that is needed is a catalyst. And the Marxists understood that it was not theoretically ruled out that even a movement of the students could provide such a catalyst.\nEveryone was taken by surprise by the explosions of 4 December, from the bourgeois and the government, the press, the leaders of the PSOE and CP, down to the most insignificant sect. Only the Marxist Tendency had understood the process in advance, and was therefore able to play a leading role in preparing and guiding the movement.\nHere we have a striking illustration of Trotsky's definition of theory as the “superiority of foresight over astonishment”. Every other tendency from left to right was left with their mouths open. Such was the degree of stupefaction that they took a long time to react.\nBy contrast the Spanish Marxists were surprised only by the dimensions of the movement, which far exceeded the most optimistic prognosis. Nevertheless, they were able to react quickly to consolidate the initial success.\nThe question of slogans now assumed a burning importance. A Marxist tendency worthy of the name must possess, along with a firm grasp of theoretical fundamentals, sufficient intellectual flexibility to be able to veer and tack at a moment's notice in the terrain of tactics.\nInitially, the tactic had been to test the ground with a call for a 24-hour general strike in the schools on 4 December, and then, given the close proximity of the Christmas holidays to prepare for further actions in January.\nBut the class struggle cannot be made to order, or forced to proceed in a prearranged sequence, like an orchestra under the conductor's baton. It consists of living forces which acquire a law and a dynamic of their own.\nThe enormous success of the strike compelled the leadership to reconsider their slogans. Such was the mood and the pressure from below that to attempt to postpone further action until January was clearly out of the question. The only question was: what was the next step to take?\nOn Friday 5, the Union had called for mass meetings to assess the results of the action. In addition, preliminary negotiations with the Ministry indicated that they were already giving concessions (abandoning the Ministry's circular, retaining the September exams, etc.) although not on the central issues of admission of non-admitted students and extra funds for education.\nThe leadership had correctly decided to continue negotiating with the Ministry, and to attempt to get further concessions, although the feeling was that the fundamental demands would not be met. It was felt that it was better to exhaust the potential for negotiations, mainly to show that the Union was serious and ‘willing to talk’, to put the onus on the Ministry and the government for any breakdown in negotiations and subsequent renewal of ‘hostilities’.\nHowever they were also aware of the danger in such a tactic. Firstly, the Ministry would clearly try a delaying tactic, spinning out talks until the holiday period. They would use the time to prepare a campaign of ‘dirty tricks’ to undermine the Union, while probably giving some concessions. Most serious of all: how would the negotiations be interpreted by the youth? The Union could not be seen as putting the brakes on action. To be seen by the radicalised youth as mere ‘windbags’ or as excessively preoccupied with legalistic niceties would have been disastrous.\nIn fact, on the Friday, while most schools went back on the advice of the Union, other areas were still coming out. In Barcelona, a special position existed. As a result of police brutality and the arrest of six students, the Union in Barcelona called for the strike to continue. This call has heeded by the big majority. The national leadership warned that, unless all six were released, the Union would call for indefinite strike action as from the following Tuesday. In the event, the arrested comrades were swiftly released.\nAt this point a complicating factor must be explained. The weekend following the strike was a three-day national holiday, including the Monday. Classes would be resumed on Tuesday. That is why the Union's ultimatum was based on this day.\nIn addition to Barcelona, many areas, particularly outlying villages which had not participated in the strike simply because the strike call did not reach them, took action on their own initiative. This was the case, for example, in the industrial suburb of Leganes, a working class dormitory town of 160,000 inhabitants on the outskirts of Madrid, and also in Guadalajara. The feeling of the students was “why should we be left out of it?” However, in every case the youth concerned rang the Union to explain why they were out and asking for guidance.\nIn general, the Union enjoyed tremendous authority with broad layers of youth who recognised its role as the organiser and leader of the struggle.\nThere is, however, a big difference between this generation and the young people who fought against the Franco regime in the underground and during the revolutionary upheavals of 1975-77. That generation grew up under the dictatorship, was highly politicised, but had big illusions in the prospect of bourgeois democracy and looked to the leaders of the Socialist and above all the ‘Communist’ Party for leadership.\nAlmost all of that generation, especially among the students, has been lost in the last period. Lacking the necessary Marxist training and perspectives they became demoralised and disillusioned – disgusted by the shameless betrayals of the reformist and Stalinist leaders of the PSOE and PCE.\nThe new generation now coming into struggle for the first time is composed of fresh layers, with no political experience and with far fewer illusions in the old leaderships. Quite the contrary. As a result of the bitter experience of the recent past there is a profound, and not altogether unhealthy scepticism towards all political parties, programmes and ‘leaders’.\nThese characteristics at once open enormous possibilities and create certain difficulties for a revolutionary tendency. The main thing is the freshness of the new layers, free from Stalinist and reformist prejudices and open to the most revolutionary ideas. However, the suspicion of ‘organisation’ and the fear of bureaucratic manipulation together with a pronounced element of extreme ‘democratitis’ which inevitably characterises such a movement, are all factors which must be borne in mind. A Marxist leadership which was insufficiently sensitive on these questions would very quickly break its neck.\nThe Union leadership revealed an instinctive grasp of these elements in the position it took to the sporadic spontaneous strikes on the fifth and afterwards. The advice given to schools which came out without being summoned was as follows: “The Union has not called for strikes today. Our position is for mass meetings (assemblies) in the schools to discuss the position. However, if the students at your school have voted in a democratic assembly in favour of strike action, when you go ahead, the Union will back you.”\nThis response fitted in very well with the mood and ideas of the majority of students at this time.\nThe idea of a Union had struck a responsive note in a broad layer of the school students. Immediately after the fourth, the one telephone of the Union was permanently blocked by calls mainly from schools asking for advice and information, but also from parents and teachers, all expressing support and asking how they could help, offering money and so on. The Union was also besieged by the media, the role of which will be dealt with later on.\nThe comrades did a marvellous job, despite small resources. Always stretched to breaking point, they formed small flying pickets of two or three to visit the schools, starting with those on strike and those who had asked for a Union representative to go. In Leganes, which struck on Friday, the students improvised a demonstration of 1,000 outside the town hall. But they did not have much idea what to do, until two comrades turned up and addressed them to rapturous applause. This solid working class area – along with the majority of the ‘red belt’ dormitory towns on the outskirts of Madrid – proved to be an absolute bedrock for the Union. By contrast, in central Madrid, with the more mixed population and petit-bourgeois admixture in the schools, the comrades met with a more varied response, although always with a clear majority in favour of action.\nPlans for a new strike\nHaving gained the initiative, it was clearly imperative to maintain it at all costs.\nThe comrades had the advantage of the element of surprise. The lightning speed of the movement caught all the other groups off balance. This gave a certain margin of time to get organised.\nHowever, the human and material resources were woefully inadequate to deal with a movement of this size. Just one or two extra telephone lines would have been a huge advantage. As it was, it was virtually impossible to get through.\nFor reasons of security, which are far more necessary here than any other European country because of the existence of very active and virulent fascist groups, it was not advisable to make public the address of the Union HQ, a small flat, which, to make matters worse, was in an area with a significant fascist presence.\nFrom the outset, Union activists received threats from the fascists. These are not to be taken lightly. A few years ago a school student leader, a young girl, was kidnapped and murdered by fascists in Madrid. The question of security therefore assumed a key importance. However the impossibility of having a public office was a serious handicap, only partially alleviated later on by the loan of rooms by the UGT and CCOO.\nAs an immediate response to the events the leadership of the Marxist Tendency met in virtually permanent session on the weekend of the 6th and 7th, together with the leading youth comrades in the Union.\nThe fact that the Saturday-Monday period was a public holiday had its negative side: temporary interruption of the movement and a breathing space for the enemy. But it was essentially a godsend for the Marxists, as it allowed them precious time to mobilise their resources on a national scale and work out the correct strategy and tactics.\nIt was not entirely clear what the mood would be when the schools restarted on the following Tuesday. But it was felt most likely that the movement would continue with renewed vigour. The tactics of the negotiating commission were discussed in some detail. It was clear that the Ministry would attempt to stall and drag out negotiations, in the hope that the Christmas holidays would cut across the movement.\nA firm course had to be steered, avoiding the dangers of ultra-left adventurism, while not giving the slightest hint of indecision or lack of will to struggle.\nThe most serious danger was that the most militant sections of the youth would interpret the Union's stand as opportunism. There was a risk that the movement would simply erupt in a series of spontaneous strikes and demonstrations, leading to clashes with the police and attacks by the fascist groups in which the students, lacking the necessary leadership, organisation and defence, would be hammered.\nGiven the lack of a serious national organisation, from an abstract point of view the best thing would have been to call for a further general strike, involving all education, in January. However, such a position would have been hopelessly out of step with the real mood of the youth. This idea, which was the position of the Union prior to 5 December, had been rendered redundant in 24 hours.\nThe main thing, when dealing with any form of mass activity, is that the main slogans should be clear-cut and absolutely unambiguous, so that there could be no confusion about the real aims and intentions of the leadership.\nIt was therefore decided to go for another 24-hour general strike and demonstrations all over Spain at the earliest possible date. Given the semi-Bonapartist constitution of Spain, permission to hold a legal demonstration must be obtained from the civil governor at least ten days prior to the events. This meant that the earliest date possible was 17 December. The comrades therefore decided to try to go for that date.\nThere were also risks in this decision. Would the comrades in the provinces be able to get permission on time? (By this time it was Sunday afternoon.) More importantly, would the idea of another one-day strike and demonstration be seen as sufficient by the youth? Were we not tailending the movement?\nThe idea of launching an indefinite strike until Christmas was considered. The mood in the schools was electric. There was the possibility that even if the Union did not call an indefinite strike, the schools might come out spontaneously.\nHowever, after careful consideration, this was rejected. The main problem was that the Union itself had had no time to get organised. An indefinite strike would inevitably spill over onto the streets, on a local basis. The fascists would select the weakest areas and attack. Any demonstrations held would be illegal, and therefore the police would wade in. There would be many injuries, arrests and even the possibility of people getting killed. The movement could be broken, area by area.\nThe slogan of “All out on the 17th” did not mean merely a repetition of the previous day of action. Successful as it was, it was not 100 percent. Important areas such as the Basque country (except Alava), Valencia and Asturias had not participated. With very few exceptions, such as Seville for peculiar reasons, the university students had remained aloof. The aim was therefore to ensure a 100 percent response, and the shutdown of the whole educational system, including the universities.\nIn fact, other layers had already been drawn into the struggle. The night-school students, a section very close to the working class, came out in solidarity on the night of 4 December. Even the adult class of the pottery institute in Madrid (a very backward section) began a sit-in in support of their own demands.\nThe essential element in the tactic was: (a) to retain the initiative by giving a clear-cut goal to unite the struggle and push it forward, and (b) to raise the level by giving the movement a greater scope, while gradually broadening the demands and giving them a more political character, in line with the concrete experience of the youth in struggle.\nAs far as the second aspect was concerned, some new demands were included to the original platform, which in its expanded form, now became the official platform of the Union's negotiating committee.\nThe need for self-defence\nOn the 4 December demonstration in Madrid, the school students received an important lesson on the nature of the state, not from Lenin's State and Revolution, but from the batons of the police, and the knives and clubs of the fascist gangs, acting as the auxiliaries of the former.\nAs a means of putting pressure on the ‘Socialist’ local authority in Madrid, the Union demanded the resignation of the civil governor. Likewise in Barcelona. This demand proved to be effective, at least in Madrid, where there was a remarkable change of attitude on the part of the Civil Governor (a woman member of the PSOE) from the first demonstration to the second, where she went out of her way to collaborate, to the extent of publicly exonerating the Union from all responsibility for the disorders caused by provocateurs following the demonstration. Given the vulnerability of the Union to legal prosecution, this fact was extremely useful. These ladies and gentlemen are always so very sensitive when their careers and incomes are put on the line!\nAs for the fascists, their brutal assaults on the students in Madrid gave the Union all the ammunition it needed to expose the nature of these jackals and raise the demand for their expulsion from the schools.\nOddly enough, this met with some opposition and a certain amount of confusion among sections of the school students. For this generation, which has no first-hand experience of the Franco dictatorship, and has entered the realm of politics with a certain amount of naivety and confused ideas, ‘fascism’ is just another political tendency, which may be good or bad, but should be tolerated. The demagogic activity of certain fascist organisations (including the Falangist Youth!) which try to take advantage of the student movement to attack the PSOE government, fomenting strikes, attacking the police, and even demagogically echoing some of the slogans of the Marxists, only added to the confusion.\nBut the cold-blooded attacks of the Nazi thugs served as a focal point to the demand for the expulsion of fascists, which obviously cannot be carried out by the state, but only from below by a movement of the students themselves, backed by the workers' organisations. Its inclusion in the negotiating platform was intended for propaganda purposes more than anything else. As an amusing aside, during the negotiations when this point came up, the representative of the Ministry commented that, while he personally was in sympathy with the demand, “that is up to you.”\nThe intention of the Union was to carry out a systematic anti-fascist campaign in the schools. But this had to take second place to the organising of the strike. Nevertheless, in every school, a committee of four would now be established, which along with a secretary, treasurer and press officer would include one person responsible for security. The importance of this was fully revealed on 17 December.\nThe mood in the schools after 4 December was illustrated at a meeting of delegates convened on Saturday 6 by the Union in Madrid. When the question of negotiations was explained, voices were raised warning the negotiating committee not to be taken in: “Don't believe what they say. The only way we'll get our demands is by fighting.” Someone suggested occupying all the schools over the Christmas holidays. And when the role of the fascists was raised, one delegate proposed the setting up of special squads to go around killing nazis!\nOne thing was absolutely clear: never again were unarmed and undefended youth going to be sent out on the streets to face the knives and clubs of fascist bullies.\nThe other main demands added to the platform were for the maintenance and expansion of all night-school courses. It was important to represent the interests of a very working-class section of the students. And for “the right of every pupil to study in his or her own language, in the bilingual communities, and the right to study in any of the two languages.” This was intended to reflect the aspirations of the youth of the oppressed nationalities and was important to consolidate the movement in Catalonia, Galicia, Valencia and especially the Basque Country, where the existence of the national question proved to be an enormously complicating factor.\nTurn to the workers!\nFrom the beginning, the movement in the schools enjoyed considerable support with wide sections of the workers, beginning with the parents and teachers. The Union regarded it as important to link the movement with the workers' organisations, and also to the parents' and teachers' associations, several of which promised support and even money.\nA leaflet was produced, asking for solidarity from the workers' movement, designed to be taken into every factory, shop stewards' committee, trade union branch and APA. A special account was opened to receive donations, and collections were organised.\nOne of the most important weapons in the hands of the Union was access to the apparatus of the Marxist Tendency, the only tendency on the left in Spain to possess its own printing press.\nThe enormous personal sacrifice of the comrades in the print-shop, who worked all night to produce the extremely high quality propaganda, leaflets and posters for the 17th, Union membership cards, and even a special sticker, enabled the Union quickly to get out a flood of material which rapidly found its way into the schools.\nIn a few days, with limited resources, the Union was able to produce far more, and better quality, material than an organisation many times its size, leaving all its enemies gasping.\nEver since the 4th, the bourgeois papers in Spain had all been asking the same question: “who is behind all this?”\nOne paper knew the answer only too well, El Pais. The self proclaimed ‘liberal’, ‘independent’ daily, has now become the main mouthpiece of the Spanish bourgeois. It has, not surprisingly, excellent links with the right-wing leaders of the PSOE. It is therefore, extremely well informed about the activities of the Marxist Tendency whose public organ is the fortnightly Nuevo Claridad, most of whose supporters were expelled from the PSOE some years ago.\nEl Pais has always gone to extraordinary lengths to conceal and suppress all information about the views and activities of the Marxist Tendency, not only in Spain, but also of its co-thinkers in Britain. How is it possible, for instance, for a supposedly ‘liberal’ paper with its own correspondent in London to publish articles about the British Labour Party without once mentioning the Marxist Tendency? A difficult feat, but, then, nothing is impossible for El Pais, it seems.\nThis bourgeois rag played the most pernicious role in relation to the Union. From the outset its attitude was one of undisguised hostility. No effort was spared to play down the role of the Union, alleging first that this was a purely “spontaneous” affair, then later on, claiming it to be organised by mysterious “autonomous coordinating committees”, that nobody had ever heard of. Finally, when compelled to mention the SE, it claimed it was run by the Lambertist sect knowing full well that these elements were violently opposed to the Union in an effort to taint it with the sectarian tar-brush. It refused to print the Union's disclaimers – even in the form of a letter!\nSympathetic journalists (of which there are now quite a few) have made it clear to the Union that the precise nature of the movement and its leadership were known to the press. Yet El Pais – widely read in left-wing and progressive circles – stubbornly acted ‘dumb’. This was evidently no accident, but corresponds to a conscious conspiracy in which El Pais acted on behalf of, and in collusion with, the Ministry and the government, to undermine the influence of the Union and the Marxist Tendency which is the dominant force within it.\nIronically, the right-wing and conservative papers have been far more objective in their coverage. Evidently, as they are not read by many students and workers who might be influenced, this was not considered to be dangerous. The best coverage at first was in the conservative Catholic daily Ya, which gave generally accurate coverage of the Union's activities. This, however, was far from sufficient to undo the damage done by El Pais.\nHaving said that, El Pais's audience is mainly among university students and professional people (also advanced workers and union activists). Its direct effect among school students would be much less.\nTo tip the balance, and win the war on the propaganda front, the Union hastily improvised a small press department which, despite the chaotic conditions in which it worked, played an important role, issuing daily press circulars and calling press conferences almost as frequently. As a result, a lot of the Union's material did find its way into the press. Good use was made of regional papers and radio stations. A couple of times the comrades got good TV coverage. Eventually, particularly after 17 December, there was also widespread coverage in the national dailies, even in El Pais.\nThe sects' pernicious role\nImmediately on restarting school, on Tuesday 9 December, representatives of the Union began pressuring the Ministry for an immediate start to negotiations. As predicted the Ministry attempted to stall and only finally agreed to talk on Thursday.\nThe tactic of the Union's negotiating committee was to attempt to bring matters to a head as quickly as possible, and in the event of the main demands not being conceded, to walk out and issue the call for new action.\nThe Union had called for assemblies in all the schools on Friday to consider the Ministry's offer and vote on what action to take. Everyone was aware that the Union was preparing a national strike for the 17th.\nThe one remaining worry was that, by accepting the offer to talk on Thursday, the Union would be seen as going along with the Ministry's delaying tactics. It was therefore all the more necessary to continue to hammer home the idea of the 17 December strike and keep the students' eyes fixed on it.\nIn the event, the Ministry reiterated its willingness to make concessions – but not on the central issues. Negotiation finished late at night on the Thursday.\nBy Friday morning many schools in Madrid had already spontaneously voted for an indefinite strike. The actual numbers involved were not absolutely clear, but the general tendency was unmistakable. Was the Union getting out of step with the movement? Some doubts were expressed on the score and more than one comrade expressed the feeling that the Union should come out for an indefinite strike from Monday, at least in Madrid.\nAt very short notice, a general assembly of the Union in Madrid had been called for Saturday evening. This would be a good moment to test the mood of the youth.\nUnfortunately, before the assembly met, another hurdle had to be cleared.\nThe ultra-left sects, which ten years ago boasted tens of thousands of members – with a strong base among the students – have dwindled to a pathetic handful in Spain wrecked by their utter lack of perspectives, adventurist politics and organisational gangsterism. These creatures watched with open mouths while the movement, whose very existence they emphatically denied, swept past them.\nHaving played no role whatsoever in the movement up to 6 December (indeed they opposed it), they now attempted to scramble onto the bandwagon. As a means of doing this, and lacking a base among the school students, they cynically latched on to the coordinating committee, which formally had been one of the organisers of the strike, though in practice all the work was done by the Union.\nThe coordinating committee had formally elected the negotiating committee. At that stage there was no doubt that the Union had the majority. However, it had been agreed to reconvene the coordinating committee on the morning of Saturday 13 to hear the report-back of the negotiating committee.\nThis meeting was packed by the sects, who came with the sole intention of disrupting the proceedings, attacking the Union and above all, of recalling the negotiating committee. Seeing that this would be the case, a section of the comrades favoured cancelling the meeting. In fact, the march of events had rendered the coordinating committee obsolete. The Union now made all the running. However, the problem was that the new layers of the youth did not understand the role of the sects, not having had previous experience of them. Even members of the negotiating committee would not have understood the cancellation of this meeting, at this stage.\nThe more experienced Marxists initially favoured cancelling the meeting, but became convinced that it would probably be necessary to go through the experience, in order to convince the more inexperienced youth of the real state of affairs.\nIn the event, the Union and the Marxists won all the arguments. But that made little difference to the sects backed to the hilt by the ‘Euro’ CP, who were hellbent on a split in any case. The hysterical behaviour of this petit-bourgeois riffraff served to alienate all the good elements present, whose support for the Union was strengthened. The one sectarian on the negotiating committee resigned. They then rushed out a lying press statement, alleging that “the old negotiating committee resigned.” The significance of this cynical manoeuvre became all too clear later on.\nBy contrast, the assembly in the evening was a huge success. The UGT was approached, and helped the SE book a big hall. Despite atrocious weather, on a Saturday night in a place difficult to find, over 800 school students turned up. On a weekday, the number would have been several times larger.\nThe meeting was a lively one. The Union's chief spokesman explained our ideas. Then speaker after speaker rose to give brief reports from the provinces. The few sectarians present attempted to sow confusion and attack the Union and the Marxist Tendency, but this fell on deaf ears. The youth wanted to discuss the struggle!\nA section of those present, whose schools were already on strike, demanded the right to move a resolution calling for an indefinite strike. This was accepted. But after a brief and quite a tense debate, two thirds voted against an indefinite strike and in favour of concentrating forces on the 17th. After the vote, the platform made it perfectly clear that, while the position remained, any school on strike could count on the complete support of the Union. This debate revealed more than anything, the degree of maturity of these young people.\nHow to ‘coordinate’… a split!\nBy their activities, the sectarians and their ‘Communist’ allies revealed themselves as the conscious or unconscious stooges of the government. Completely uninterested in the success or otherwise of the strike, they were motivated exclusively by the desire to control the movement, and by a blind hatred of those who stood in their way – the Union and the Marxist Tendency. As always their fighting slogan was “Rule or ruin!”\nIn this dirty work, they were ably assisted by El Pais, which in its widely-read Sunday edition, carried on the front page a big picture of the 4 December demonstration, but featured with banner headlines the ‘news’ that the Madrid Coordinating Committee was to hold an important meeting in the University on the night of Tuesday 16 December. The purpose of this meeting was to elect a ‘representative’ leadership of the students' movement. Not a word about the Union's assembly on Saturday, or the fact that it had already elected a committee of 50 delegates representing the majority of schools in Madrid! It was later discovered (from a friendly TV journalist) that the press and TV had been instructed to stay away from the assembly.\nRealising what was afoot, the Union leadership quickly produced a leaflet, exposing the fraud of this meeting and calling on the university students to hold democratic elections, faculty by faculty, to set up a genuine committee to coordinate action on the 17th with the schools.\nIn the event, despite the massive free publicity in El Pais, only 300 people turned up to this meeting. Of these at least 100 were good youngsters, who had been confused by the publicity and mostly thought the meeting had been called by the Union! Leaving aside a certain number of confused and vacillating elements, and also the pro-Moscow CP supporters who later did a 180-degree turn from opposing the Union to supporting it (verbally at least), this leaves about 100-150. And this is all the sects and the CP could pull together in a city of 4 million inhabitants, after scraping the barrel and looking under every stone!\nNeedless to say not one of these ladies and gentlemen had been elected. They represented themselves alone. But what they lacked in numbers they made up for by hysteria and crude gangsterism. They tried to stop the representatives of the Union from speaking, then barracked and heckled. However, once again their tactics drove the healthy elements towards the Union. The leaflet, with its uncompromising tone, had a devastating effect. But they succeeded in finishing their disgraceful farce, electing a committee – and this was the central point – passed a resolution that they would be at the head of the demonstration the next day, and that “parallel stewarding” would be organised.\nIn a few other areas, too, ‘Coordinating Committees’ suddenly appeared. In an industrial suburb of Madrid, Getafe, propaganda appeared with the Union insignia, forged by the Moreno sect, which tried to cash in on the Union by cynically usurping the name. When a comrade from the Union turned up to their meeting, they tried to keep her out, till she raised a scandal and the youth demanded she be admitted. When the truth became known, the majority were indignant and agreed to join the genuine Union.\nThere is no doubt that those guilty of these splitting tactics were doing the dirty work of the government – dividing and disorientating the movement literally on the eve of the struggle. The behaviour of El Pais, those most conscious representatives of Spanish big business, showed what the score was. Having prominently featured the students’ movement on Sunday to advertise the meeting of the sects and CP, on the morning of 17 December, when all other papers carried news of the strike, El Pais was silent. Advertise the activities of the wreckers? By all means! Promote the cause of the strike? God forbid!\nThe national question also served to complicate the situation. In Valencia and Catalonia, the petit-bourgeois nationalists attempted to sabotage the strike, but were effectively countered. In the Basque Country, the strike and the Union ran into vitriolic opposition from the very first moment from the supporters of radical Basque nationalism, represented by Herri Batasuna (HB), and its youth organisation, Jarrai.\nFor the first time in 10 years, Herri Batasuna saw its influence among the Basque youth seriously challenged by an internationalist Marxist tendency. It reacted with a hysterical outburst, which was surprising in its violence, even by HB's standards.\nIn a desperate attempt to head off the movement, Jarrai called a general strike in the schools for Friday 14 December on the issue of the extradition of ETA members from France. To Jarrai's chagrin, the strike call was a flop.\nTheir subsequent hysteria can be explained by one thing alone: fear. They received a bloody nose precisely in an area where they had always reigned supreme! They lashed out in all directions. Through the pages of its daily, Egin, Herri Batasuna launched a campaign of vitriolic abuse and lies against the Union. The strike of 4 December was said (in a caption written in Basque) to have been organised by “Communists and Fascists”. The SE was described as a “police union” set up in cahoots with the Civil Governor (this language is enough to get people shot in the Basque country) and so on and so forth.\nAfter the failure of the 14 December adventure, Jarrai reluctantly was forced to call for a strike on 17 December. Undoubtedly there must have been internal contradictions and pressures in their own ranks and sympathisers. But, the issue of a strike call in no way supposed a lessening of their campaign of abuse against the Union. They insisted that “their” strike was a purely Basque affair and had nothing to do with the rest of Spain! But for all their threats and blustering, Herri Batasuna and Jarrai had, in effect, suffered a humiliating defeat on their own home ground – and they knew it!\nThe 17 December Strike\nThe strike on 17 December was an outstanding success. The response in the great majority of state schools was 100 percent. That was certainly the case in Madrid. In Barcelona too 100 percent came out – and that means 260,000 in one city alone. The red belt around Barcelona (and Madrid) was solid: 100 percent in Sabadell, Girona, Lleida, Tarragona, Reus, and many villages throughout Catalonia. In Tarragona, even the Labour University went on strike. The Union grew by leaps and bounds. In Tarragona, groups were formed in all the schools. Ten days earlier there had been none.\n50,000 demonstrated on the streets of Barcelona; 4,500 demonstrated in Tarragona – the biggest demo ever in the city. As a result of this movement, the Generalitat (Catalan regional parliament) agreed to open negotiations with the representatives of the students.\nIn Valencia, the whole province was solid. 50,000 demonstrated. Alicante was 100 percent, as was Murcia; not only Cartagena, but numerous villages: Mula, Fuente Alamo, Caravaca, etc.\nAll of Andalusia was out. Even the official TV admitted a response of “80-85 percent”. In Malaga, they took the precaution of springing exams on the schools. To no avail. Immediately after the exams, the students struck for the rest of the day.\nStrikes and demonstrations in Granada and Motril. 100 percent in Seville, with part of the University also out. 15,000 on the demonstration with the SE banner at its head. 100 percent too in all the outlying villages: Morón, Carmona, Alcala, etc. The Workers' Commissions and the Teachers' Federation of the UGT came out in support.\nAll Galicia was out: Ferrol, Vigo, Coruña. In Vigo, youngsters came from the villages to attend a demo of 1,500. Students in Ferrol went to the shipyards to ask for support and were given donations. Support was forthcoming from Workers' Commissions and two nationalist unions (INTG and CXTG) as well as the Ferrol Tenants' Association.\nThose areas which did not participate on 4 December now entered the struggle with full force: Asturias came out 100 percent, with a strike and demonstration in Gijon (organised by a coordinating committee where the sects had some influence) and Aviles, where the SE brought out 10,000 and organised a demonstration of 4,000 – a record for this important steel town. In the mining areas, schools in the Nalon coalfield experienced a total stoppage. In Santander the strike was total.\nSaragossa once again excelled itself, with a total strike and a demonstration led by the SE of 20,000. But what was even more significant was the fact admitted by the bourgeois press, that the strike was solid throughout Aragon (according to the TV, only one school was working in the entire province). Huesca, Teruel, Andorra, and many other villages joined in.\nIn the Basque Country, despite the sabotage of Herri Batasuna and Jarrai in the initial stages, the strike was total. In Vitoria (Alava) 3,000 demonstrated under the Union's banner – a blow to Jarrai. In Navarra, it was 100 percent not only in Pamplona, but in all the other towns: Tudela, Estella, Tafalla, with a demonstration in Pamplona of 5,000 and another of 1,000 in Tudela, another record for this small town. The Alava comrades called out the schools in Guipuzcoa on the strength of little more than a telephone call. The industrial village of Deva came out 100 percent.\nHowever, Herri Batasuna and Jarrai continued their campaign of vilification against the Union even during the course of the strike itself. The supporters of the SE in Vizcaya (capital: Bilbao) called a meeting in Baracaldo. There is no doubt that it would have been massively attended. So Jarrai called a demonstration at the same time in Bilbao. As a result only 50 turned up to the Union's meeting. So the comrades decided that the correct course of action was to participate in the demonstration in Bilbao.\nOnce again, the radical nationalist petit bourgeois and sectarians showed that they were not in the slightest interested in advancing the struggle, but only in grabbing control of the movement and eliminating all opposition by fair means or foul. Given the thuggish and provocative attitude of these elements, it took a lot of courage for the 50 or so supporters of the Union to turn up on the demo at all.\nIn the event, they were subjected to a barrage of abuse. The supporters of Jarrai and their Lambertist cronies used the loudhailer to shout hooligan slanders and lies about the so-called “pro-Spanish Union”, “paid by the police” and so on. The Lambertists tore up the Union banner and attempted to attack those carrying it. Finally, when the spokesman of the Union attempted to speak, they beat him up. However, the comrades did not allow themselves to be intimidated but went to the other end of the demo, succeeded in addressing the crowds, and got a good response from the youth.\nThe Madrid demonstration\nIn Madrid the organisers of the demonstration held a meeting the night before to organise the stewards. 200 youth turned up for a briefing. Tactics were worked out, and the stewards were issued with a Union armband and a hefty wooden stave, with a poster on top mainly for decorative purposes. Each steward was asked to bring a group from his or her school to provide a strong defence force.\nIn addition, it was decided to invite Nicolas Redondo and Marcelino Camacho – general secretaries of UGT and CCOO respectively – to march at the head of the demonstration. This had three purposes: firstly, as a means of furthering the Union's campaign to link up the school students to the workers' organisations, appealing for unity at the top and at the bottom. Secondly, as additional insurance against police aggression. Lastly, it might be possible to obtain extra, experienced stewards from either or both unions.\nEfforts were made to get workers from at least one striking factory to provide stewards. But because of the lack of time and the heavy pressure of work, this aspect did not bear fruit. The UGT offered to provide stewards. In the event, they came too late to be of any practical use. So the stewarding was entirely in the hands of youths of 14-18 years of age, organised by the Marxist Tendency.\nThese young stewards behaved magnificently. They came early in their hundreds, and occupied the strategic points around the place where the demo was due to start. The Union provided a couple of cars with powerful loudhailers, and had hired walkie-talkies, which were used by the stewards to patrol the edge of the demonstration and sound the alert if necessary.\nThe stewards then joined hands and formed an ‘iron ring’ surrounding the whole of the front part of the demonstration, with orders not to let anyone in or out. A couple of reporters made the mistake of putting this to the test and went away with bruised ribs.\nAs the hour to move off approached, and there were already tens of thousands present with banners from many schools, there suddenly appeared something like a human avalanche, as a vast number of youths appeared as if from nowhere. It is impossible to calculate how many were present, but the figure was anything from 100,000 to 150,000. The Union finally claimed 120,000, which is probably an underestimate.\nThe previous demonstration had been attacked by fascists. But it would have taken a brave fascist to attack this time. The total number of stewards was anything up to 1,000. The moment the alarm was sounded at any point in the demonstration, a host of whistles would be heard, and 200 youths, with staves raised in the air (without any decoration) would dash like greyhounds to the spot. Many of the students had come with their own, improvised means of self-defence, which made up quite a terrifying armoury. Some fascists did venture too close and, in Trotsky's celebrated phrase, were “acquainted with the pavement”. One was detected with a home-made nail bomb in his hand. He was caught, beaten to within an inch of his life, and ended the day in hospital. By contrast, not a single demonstrator was injured. The police kept a discreet distance.\nThe main problem came, not from the fascists, but from the sectarian riff-raff of the Coordinating Committee. Five minutes before the demonstration was due to move off, a hundred or so of these ladies and gentlemen succeeded in placing themselves in front of the first line of defence which preceded the demonstration.\nThis cynical manoeuvre placed the organisers in a serious dilemma. Undoubtedly, the Union had enough forces to get them out of the way. However, it would not have been a simple operation. They did not come alone, but had clearly recruited a whole group of lumpen elements, probably brought in from the most depressed areas on the basis of a promised ‘punch up’. These elements came with bags full of iron bars, powerful steel catapults and similar implements. The sectarians were hysterical and clearly looking for trouble.\nTo remove these people would undoubtedly have meant a serious street battle at the outset of the demonstration, with injured on both sides. But the most serious problem was the presence of 150,000 youths, in a compact mass. A bloody battle could have caused panic and chaos. This would certainly have been the excuse for the intervention of the police, who would have waded in to restore ‘order’. The demonstration would have been broken up before it started. In other words the sects behaved like typical police agent provocateurs. Indeed, it is highly probable that they had been infiltrated by fascists or police, or both, for the sole purpose of causing chaos.\nUnder the circumstances the organisers decided not to risk a confrontation but to denounce the provocative behaviour of the ‘Coordinating Committee’ after the demonstration.\nDespite a certain confusion introduced by these elements, the demonstration was an enormous success. The whole centre of Madrid in the vicinity of the Ministry of Education was brought to a total standstill by the enormous number of demonstrators.\nThe Coordinating Committee tried to outmanoeuvre the Union by sending an alleged ‘negotiating commission’ to see the Ministry. This only gave the Ministry an excuse to claim that there was a “problem of representation”, and that therefore, there would no longer be negotiations but only “exploratory talks”. In practice, however, the subsequent negotiations were carried out by the Union's negotiating commission.\nOnce again the Union's negotiating committee came out of the Ministry, and the Union declared the demonstration to be at an end.\nThe great majority of the students dispersed. However, the elements gathered around the Coordinating Committee stayed behind to continue their provocations, setting up barricades, and throwing stones and bottles at the police. Here too, it is practically certain that there were actual fascists involved. The police accordingly attacked, injuring several people, one of whom ended up in a coma. The next day, with the exception of Ya – which carried a front-page spread of the demonstration, with the headline: “Two million students against Maravall” (the Education Minister) – the rest of the press carried photos only of the clashes with the police which occurred after the demo had finished.\nAfter December 17th\nIn spite of the inevitable cross-currents and complicating features, the general strike had been a historic success. The figures above give only a very partial idea of the scope of the movement. Ya admitted to two million on strike. The actual figure was probably even higher, if we take into consideration the fact that in some areas other sections, such as the Universities, also came out.\nEven more significant than the big demonstrations in Madrid, Barcelona, Zaragoza, etc, was the fact that these movements affected even the smallest villages in the most backward provinces: Zamora, Avila, Cuenca, Toledo, Soria, Algeciras, were all drawn into struggle. Without exception these new areas looked to the Union for a lead. They will provide a tremendous reservoir of fresh layers of youth untainted by the cynicism of the reformists, Stalinists and sectarians.\nOn a more general plane, the movement has already had the effect of forcing the government into making concessions. The Minister went on television the day after the strike, promising a series of improvements: including a 25 percent increase in all student grants.\nIt had an effect on the political life of the country. The opposition demanded a parliamentary debate and the appearance of the Ministers responsible.\nIt had shaken all the political organisations, and had an effect on the unions. It was no accident that the UGT Federal Committee, after a discussion of four hours, finally decided to send a message of support and two of its members to march on the demonstration (Nicolas Redondo had a “prior engagement”) and Camacho turned up to represent the CCOO.\nThe manoeuvre of the Coordinating Committee posed a problem for Camacho, who started off marching with them but then had second thoughts and marched behind the banner of the Union. The UGT representatives stayed with the Union. On the other hand Gerado Iglesias, General Secretary of the ‘Euro’ CP stayed with the Coordinating Committee – as did Javier de Paz, the general secretary of the JJ.SS (Young Socialists!). When asked why he marched with the Coordinating Committee, composed of Stalinists and ultra-lefts, instead of the Union, he answered: “because there is a group behind the Union which we cannot support under any circumstances.”\nThat was the underlying fear of all of these people: The “group behind the Union” – the Spanish Marxist Tendency represented by Nuevo Claridad and its youth group, JPS (Youth for Socialism).\nThe movement succeeded in splitting the JJ.SS, or rather, the tiny rump which remains after the mass expulsions of the mid and late 1970s. Even before 4 December the JJ.SS bureaucracy sent out a circular to all members forbidding them to support either the Union or the strike. This had exactly the opposite effect. In Zaragoza, the attempt of the JJ.SS bureaucrats to forbid the JJ.SS to support the strike succeeded in pushing the best elements behind the Union and the Marxist Tendency. The same thing happened in the Basque Country. In Alava the JJ.SS were expelled for supporting the strike! In Valladolid, the general secretary of the JJ.SS has entered into contact with the Union, along with a group which had earlier left the JJ.SS as a result of its stand on NATO.\nThe effects of the strike also had a big impact in the Stalinist camp. The small ‘official’ Euro-Communist Party's youth section, against the advice of the Workers' Commissions and at least some of the more intelligent party leaders, opted in favour of the ‘Coordinating Committees’ and waged a vicious and hysterical campaign against the Union, just like the sects.\nBy so doing they effectively committed political suicide in the schools. In the past the Stalinists would undoubtedly have immediately entered the Union to take it over. But decades of reformist degeneration had meant that the present UJCE (Young Communists), overwhelmingly petit-bourgeois in composition and utterly ignorant of the ABCs of Marxism, was completely incapable of repeating the experience of the 1930s, when the Stalinists succeeded in hijacking the Young Socialists, with tragic consequences for the fate of the Spanish Revolution.\nThese petit-bourgeois ignoramuses, in the first place, had no understanding of the processes at work within society. They steadfastly denied all possibility of a mass movement of the youth before 4 December, and were therefore completely taken by surprise by events. Their whole cast of mind, which is virtually identical to that of the sectarian university cliques, meant that they failed to understand the significance of the Students Union, which because of its role in the struggle was universally seen as the ‘official’ organisation, and therefore remained outside its ranks.\nHowever, it is doubtful that they would have gotten very far even if they had entered. Given the crushing superiority of the ideas of the Marxist Tendency which was in the leadership of the Union, and the abysmal political level of the average UJCEer, they would have ended up losing people, instead of gaining them. Thus, there was some method in their sectarian madness.\nThis was shown by the experience of the pro-Moscow Stalinist youth organisation, which initially adopted an ambiguous vacillating attitude towards the Union. At first opposed, these elements changed their tune when they saw the Union getting support. After 17 December, they approached the SE leadership for discussion. What attitude should the Union take towards them?\nThe Marxists adopted, from the outset, a very careful attitude towards the different components of the ‘Coordinating Committee’. It was not at all clear from the outset what the balance of forces would be. That had to be determined in the course of the struggle itself.\nThe Marxists were ‘isolated’ in the leadership of the Student's Union. All the other political tendencies from the fascists to the ultra-left had united after 4 December and still more after 17 December, in a united hostile bloc against the Union.\nIt was true that the Union had succeeded in uniting behind its banner in action the overwhelming mass of the school students. Nevertheless, its structures were still weak, the organisation itself still being in the process of formation. In many provinces it did not exist. The universities were a particularly weak point.\nOn the face of it the other groups combined had more strength than the Marxists. There is little doubt that, if they had had the slightest idea of how to work, they could have been a serious complicating factor.\nThe question of how to approach these groups therefore occupied a central place in the discussions on tactics which occurred after 17 December. The hooligan splitting tactics of the Madrid Coordinating Committee ruled out the possibility of an open and honest collaboration. The sects played a particularly vicious role, their one overriding obsession was a hysterical opposition to the Marxists and the Union.\nThe ‘official’ UJCE and the JJ.SS blindly went along with the sectarian madness. However, as indicated, the pro-Moscow youth organisation, probably prodded by the adult party leaders who had more of a ‘feel’ for the movement, tried to distance themselves from the others and adopt an ‘intermediate’ position.\nThe policy of the Marxists was directed towards splitting the enemy camp, trying continually to draw away the Stalinists and, if possible, the JJ.SS, from the rest, in an attempt to isolate the sectarians, who represented nothing. In line with these tactics, the Union leaders immediately accepted the offer of the pro-Moscow Stalinist youth and entered into discussions. This was by no means a Machiavellian manoeuvre on the part of the Marxists. Had the other groups been prepared to enter into an honest collaboration, agreeing to unite forces for concrete actions and for building the Union (for example in the University, and in Catalonia), this would have been a big advantage for the unity of the movement which was a fundamental consideration. The political differences could have been dealt with by means of a healthy internal debate which would have benefited the entire membership. The Marxists were even prepared to discuss the possibility of making certain concessions on the organisational plane, to facilitate the participation of these comrades in the Union. However, all these plans came to nought as a result of the cynical manoeuvring of the ‘hardline’ Stalinists who proved to be little better than their ‘Euro’ counterparts in practice.\nDecember 20, 1986\nPart Two\nThe government clearly hoped that the movement in December would be merely a ‘flash in the pan’. Christmas holidays would have a demobilising effect and the ending of the student movement in France would also reduce the Spanish students' interest in strikes and demonstrations.\nThe analysis of the Marxist Tendency diametrically opposed this view. Contrary to the opinion of the Ministry, frequently echoed in the press, that the Spanish students' movement was mere “mimicry” of the events in France, the Marxists of Nuevo Claridad saw it as the expression of a deep-seated discontent among the youth of Spain.\nThis youth had been awakened to political life by the first strikes in December. The Christmas break would therefore merely be a truce after which hostilities would quickly break out once again.\nIt was clear, however, that the new stage in the struggle would be far more complicated than it had been up till now. The government would have time to prepare a counter-strategy. The Union's structures were as yet in only an incipient stage, with very limited human and material resources. On the other hand, all the political enemies of the Union, both on the ‘left’ and the right, would now swing into action, deepening the splits and causing confusion among the youth with potentially disastrous results.\nAttitude to the ‘Coordinating Committees’\nThe splitting activities of the Stalinists and sectarians, aided and abetted by the youth organisation of the PSOE, already caused some damage on 17 December. It was necessary to work out a strategy which would resolve this problem in January.\nIn general, there is no reason why the existence of coordinating committees should conflict with the activities of a union in the struggle. There could be a case, particularly where the Union organisation was still weak and did not take in the majority of the students, for setting up coordinating committees of representatives democratically elected in the schools for the purpose of organising the struggle. Such ‘rank-and-file’ bodies would not be an alternative to the permanent structure of the Union, but could play a useful role in the course of the struggle, dissolving themselves when it had finished. Something similar appeared to have occurred in France.\nIn point of fact, in many areas of Spain, coordinating committees sprang up which actually did represent genuine organs of the school students, particularly in those areas where the Union did not, as yet, exist. In several areas, the Union and ‘coordinating committee’ existed side by side and collaborated without any difficulty. In many rural areas, in particular, the local coordinating committees – set up in the course of action, although at first there was not one member of the Union – nevertheless immediately contacted the Union in Madrid and followed its directives and advice from the first to the last.\nThe problem arose not so much from the existence of coordinating committees but from the political bankruptcy of the sects who, as always, tried to counterpose the coordinating committees to the ‘official’ Union, attempting to gain control of the committees by fair means or foul and to use them, not for furthering the struggle, but to wage out and out war against the Union, splitting, sabotaging and boycotting the movement wherever they managed to get a foothold.\nIn every instance, it became clear that what these ladies and gentlemen were least concerned about were the interests of the school students. Two considerations were always uppermost in their minds: how to manoeuvre their own little group into positions of leadership and how to destroy the Union. Their role throughout the dispute, irrespective of their subjective intentions, was to act as strike-breakers and agents of the government.\nAfter 17 December, the leadership of the Marxist Tendency discussed what attitude to take towards the Madrid ‘Coordinating Committee’ which had played such a despicable role on the 17 December demonstration.\nThis group, entirely manipulated by student sects from the University with a minimal base in the schools and techs, had already announced a ‘Conference’ on 10 January, followed by a ‘National Conference of Coordinating Committees’ one week later. Since the start of term was on 8 January it was clear that these elements, caught with their pants down in December, were obsessed by only one idea: to call for action as early as possible in January in order to ‘steal a march’ on the Union.\nThis was bad news in more than one way. It was not in the best interests of the movement to go immediately into action practically on the first day of school. The Union would have preferred a certain delay in order to allow time for assemblies which could freely debate the issues at stake and decide what action to take, and also for the Union itself to get organised and prepare for effective action.\nThe same argument applied in relation to the holding of a conference, either in Madrid, or nationally. There could be no question of a democratic conference being held only two days after the start of term. This would leave no time for proper assemblies, or discussion, or election of delegates.\nThe possibility was raised of the Union sending people along to the meeting of the ‘Coordinating Committee’ to fight for a majority. But it was quickly realised that this would not be a democratic meeting of elected delegates, but merely a rigged meeting of the sects. There was no question of these hooligan elements allowing the Union to speak, let alone to win a majority. It was therefore decided not to attend the meeting, but to denounce these manoeuvres with a leaflet and to go for a genuinely representative meeting of the Union at a later date.\nIn the meantime, as the negotiations with the Ministry had produced no definite result, the Union leadership decided to make contingency plans for further action in the second half of January. It was felt that the action would have to be stepped up this time, not merely a repeat of the previous two occasions. This time the plan was for a week of action, with assemblies on Monday 19 January, and a four-day general strike in the schools from 20-23 January, culminating in mass demonstrations all over Spain on Friday 23. The date for a national meeting of the Union was fixed for Sunday 18 January. This calendar would allow sufficient time for the necessary discussion, debate and voting in the schools, thus ensuring another solid strike.\nThere was, however, a problem here. No-one could tell what exactly would be the situation in the schools after 8 January. It was not entirely ruled out that the calculation of the government might be proved correct. The need to ‘test the terrain’ at each stage before launching the slogan of action was another powerful reason for delaying the struggle and allowing time for discussion and debate within the movement. But what if the opposite was the case? What if the movement exploded immediately? This seemed to the leadership to be a far more likely scenario. And from this point of view, the danger would be that the Union might be seen as dragging its feet. The sects around the ‘Coordinating Committee’ might then be in a position to outflank the Union. Despite all doubts, the Union leadership decided that the best course of action was not to be stampeded, but to proceed as planned. This tactic was shown in practice to be correct.\n‘Indefinite general strike’\nThe fears of the Union about the activities of the ‘Coordinating Committee’ proved to be well founded. The ‘Conference’ on the 10th was completely unrepresentative, disorganised, disorderly and undemocratic. No vote was taken, but at the end the chairman bawled out above the general hubbub, and to everyone's astonishment, that the meeting had ‘decided’ to call an indefinite general strike.\nThis irresponsible tactic, rejected from the beginning by the Union, was shown in practice to be utterly bankrupt. Those schools which misguidedly followed this advice were rapidly emptied. The big majority of the students simply went home and watched TV for the rest of the dispute. By contrast, the Union tried to keep the youth in the schools, even during the strike, to hold them together in permanent assemblies to discuss tactics and strategy and plan for action. It was the difference between a passive strike, in which the majority acted as mere spectators watching from the sidelines as a minority of ‘activists’, liberally interspersed by hooligans and provocateurs, battled it out with the police, and an organised, disciplined and conscious mass movement which showed in practice how to take on and defeat the ruling class and the state.\nBy its actions, however, the Madrid ‘Coordinating Committee’ rapidly revealed its weakness. In an ill-disguised (and ill-advised) attempt at a show of strength, they called a demonstration on Saturday 17 January which only managed to attract 5,000 students. This feeble attempt had all the hallmarks of all subsequent demonstrations of these people: complete lack of organisation, absence of stewards and defence pickets, poor attendance and heavy infiltration of provocateurs, whose activities finally led to the demonstration being broken up by the police – something which they never succeeded in doing in any one of the demonstrations organised by the Union and not for lack of trying!\nSimilar tactics were in evidence in other parts of Spain. In Catalonia, the pro-Soviet CP managed to take over the ‘Coordinating Committee’ with ambitions to create its ‘own’ national body, independent of the Madrid mob. In Valencia, the ‘Coordinating Committee’ was run by the ‘Euros’ in an unholy alliance with Young Socialist bureaucrats, rightwing Catholics and even some members of the ultra-right. These Young ‘Communists’ refused to allow a representative of the Union from Madrid even to address the Committee! This is how the CP understands a ‘united front’: a body which embraces everybody – except the Marxists!\nComplications in the Basque Country\nMost serious of all, in the Basque country, Herri Batasuna and its youth organisation Jarrai, still smarting from the humiliating defeat inflicted on them in December, now stepped up their hooligan attacks on the Union and the Marxist Tendency. All the attempts of the Union in the Basque Country to get unity of action with the so-called ‘Coordinating Committee of Euskadi’ – in reality a front for HB and Jarrai – were rejected out of hand. The daily Egin and the magazine Punto y Hora intensified their lies and slander against the Union. Predictably, an atmosphere of confusion and disorientation was created in the schools. Many young people were afraid to join the Union for fear of being attacked by Jarrai supporters. Anyone suspected of being sympathetic to the Union would be followed through the streets, publicly insulted, their parents visited and warned, and so on.\nThese tactics undoubtedly caused serious difficulties for the Union in the Basque Country. But far from revealing strength they showed precisely the opposite – weakness and fear. For more than ten years the ‘abertzale’ (radical nationalist) groups have had a virtual monopoly of support among the Basque youth. The extreme opportunism of the leaders of the official workers’ parties led to a sharp reduction in their support, even in the working class circles, but especially among the youth. The PCE ceased to exist when the majority fused with a nationalist group (Euskadiko Ezkerra). The sects adopted a sycophantic attitude to ETA and Herri Batasuna, which only succeeded in reducing almost to zero what support they had had in the past. The only real alternative on the left was represented by the Marxist Tendency, which is known in the Basque Country as the Left Socialist Coordinating Committee and Ezkerra Marxista. However, the influence of these groups was confined to two provinces, Alava and Navarra, with little support in Vizcaya (capital Bilbao) and Guipuzcoa (capital San Sebastian).\nIn a sense the School Students' Union was born in the Basque Country, where it led a series of strikes in the schools in Alava and Navarra, involving thousands of students in the Winter of 1985-86. But its rapid emergence as a serious force after the strikes of December 4 and 17 caused a wave of panic in the petit-bourgeois radical nationalist circles.\nFor the first time the leadership of HB and its youth wing Jarrai felt seriously threatened. They could easily cope with opposition from the right: the bourgeois nationalists, reformists and ‘Euros’. But a serious revolutionary Marxist tendency, advocating internationalist and class politics, represented a deadly threat to their hegemony among the Basque youth.\nBehind the bluff and bluster of their hysterical attacks on the Union lay a mortal fear of the spread of genuine Marxist ideas among their traditional supporters. The initial success of the Union caused a panic reaction. But there were clearly deeper reasons behind this. In the pages of Egin there began to appear articles, written in a worried tone, complaining of the emergence of “dangerous pro-Spanish tendencies among the Basque youth”. “A layer of youth,” they moaned, “no longer showed due respect for the symbols of the [Basque] nation,” even describing the Basque flag (Ikurriña) as “that rag”.\nAs we have seen, the new generation of youth is, in general, far more critical and sceptical about politics than was the case ten years ago. This holds good for the Basque Country as much as the rest of the Spanish state. The generation which entered political life in the final years of the Franco dictatorship had a different outlook. Things seemed far easier then. All that was required was to overthrow Franco and all would be solved by the magic wand of ‘democracy’. Despite the enormous revolutionary potential of the working class, demonstrated time and time again in general strikes, demonstrations and confrontations with the police, there were deep seated illusions in bourgeois democracy carefully fostered by the reformist and Stalinist leaders of the PSOE and PCE. These parties and their unions had a crushing preponderance among the working class and youth. At the same time there were quite big sects, of all the colours of the rainbow: Maoists, anarchists and the usual 57 varieties of ‘Trotskyism’.\nWith the aid of the leaders of the PSOE and in the first phase especially, the CP, the Spanish capitalist class succeeded in maintaining itself in power, against all the odds.\nAs a result of this betrayal, the membership of the workers’ parties suffered a complete collapse. Even the unions which had grown rapidly in the first years of the ‘transition’ were reduced to derisory proportions. Probably only about 10 percent of the Spanish workers are now organised in unions. The situation is still worse with the youth organisations. Ten years ago the Young Socialists (JJ.SS) and Young Communists (UJC) were mass organisations. Now, decimated by expulsions, they have been reduced to next to nothing. The sects too have been virtually wiped out. Of the three Maoist organisations that once had tens of thousands of members, only one (ex-Maoist) sect remains, the ‘Communist Movement’ (M.C.), with an extremely precarious base, mainly among students. The so-called ‘Trotskyist’ sects have ceased to exist in all but name, while the anarchists, as Trotsky predicted before the war, have proved unable to regain their former strength and are just one more sect, and not even the biggest.\nThe one area where the youth had an apparently ‘left’ alternative in the latter part of the 1970s was the Basque Country. It should not be forgotten that in the first general election held after the death of Franco, PSOE got a majority in the Basque Country, for the first time in history. This showed that the Basque workers, who played an outstanding role in the struggle against Franco, were looking for a class solution to their problems. However, the rightward move of the PSOE leaders led quickly to a collapse of the Socialist vote, capitalised on by Herri Batasuna. Ultra-leftism, as Lenin explained, is the price the movement pays for opportunism. The Basque youth went over in droves to Herri Batasuna.\nHowever, after ten years of ‘armed struggle’ (i.e. individual terrorism) and adventurist strikes and demonstrations, the Basque workers and youth are empty-handed. The failure of ETA's terrorist tactics have caused a crisis within the ranks of the avetzales. The coldblooded murder of ‘Yoyes’, a young woman who decided to leave ETA and accept a ‘pardon’, apparently with the consent of the recently deceased leader of ETA(m) ‘Txomin’, caused a wave of revulsion in Basque society. For the first time HB supporters were harassed and insulted in the streets. This was only a couple of months before the outburst in the schools.\nThe new generation is not willing to follow any political line out of blind obedience. After years of betrayal, there is a strong current of scepticism towards all political parties. Yet the youth are not ‘apolitical’, as the movement has shown. They demand explanation, and argument. There is a far more serious and thoughtful mood among the youth than was the case ten years ago.\nThis is no accident. It reflects profound shifts taking place within capitalist society, linked to the economic crisis which leads society in general up a blind alley at all levels. The moods of discontent, frustration and anger accumulating in the masses, find their first confused expression in the movement of the students.\nTen years ago, the economic crisis had only just begun. Now it has reached frightening proportions with 30 million unemployed in the advanced capitalist countries alone. There is no way out for the youth. The easy slogans of the past when everything was so simple, have evaporated like water on a hot stove. Now things are not at all simple, but very complex. The old leaders, parties and programmes, the old facile slogans of ‘democracy’, ‘progress’, yes, and ‘nationalism’, have been weighed and found wanting. A new generation of youth which has no future wants clear ideas, explanations and perspectives. But only a Marxist tendency can provide these.\nThe supporters of Herri Batasuna and Jarrai are weakest of all on this ground. Experience has shown that wherever an assembly is held and the Basque youth are able to contrast the clear revolutionary ideas of Marxism with the moth-eaten demagogy and nationalist claptrap of HB, they accept the ideas of Marxism. This lesson has not gone unnoticed by the leaders of HB. It is not at all an accident that in their recent congress Jarrai for the first time formally went on record as supporting ‘Marxism’ and ‘proletarian internationalism’. The fact that, in practice, their ‘internationalism’ comes to an abrupt halt on the banks of the river Ebro is a detail! The main thing is that they feel themselves under the pressure of the Marxist Tendency. Their purely verbal concessions to Marxism and proletarian internationalism will undoubtedly rebound on them at a later date. The history of Basque nationalism, and ETA in particular, is riven with splits along class lines. In the next few years a path will open up which will lead the Marxist Tendency directly to the most militant and self-sacrificing layer of the Basque youth.\nIt is a fact that the rise and fall of the petit-bourgeois radical nationalist groups proceeds in inverse proportion to the rise and fall of the workers’ struggle. At the high point of the class struggle throughout the Spanish state, the petit-bourgeois nationalists did not make much inroads into the working class. Only with the collapse of the workers’ movement in the dark years of 1978-81 did the ‘abertzales’ have a grip on a section of the radicalised workers and the youth.\nNow the crisis of Spanish capitalism has begun to have a devastating effect on the Basque economy. At the height of the school students movement, a government spokesman announced the need for 30,000 redundancies in the coal and steel industries, specifically naming Altos Hornos de Vizcaya, the heart of the Basque steel industry in Bilbao, as being the first candidate for the chop.\nFor some years, the Basque workers enjoyed some of the highest living standards in Spain. Unemployment was virtually unknown. Now all that has changed. Entry into the EEC poses the threat of mass redundancies and closures in the Basque country. A new wave of strikes could easily develop with factory occupations on the order of the day. [This was written before the big strikes which affected the Basque Country, as well as the rest of Spain, immediately after the student movement.] The Basque working class will first of all seek class solutions to their problems. This, too, will further deepen the crisis in the camp of nationalism. Only on the basis of a series of defeats would the radical nationalists be able to recover support among the working class. The idea of ‘independence’, which has never had much support among the workers, could then begin to catch on, with a stepping up of terrorist activity and the danger of a Northern Ireland-type situation developing.\nThe subjective factor here plays a decisive role. The future of the Basque country will be determined by the speed with which the Marxist Tendency can win over the decisive layers of the Basque workers and youth and block the road for the poisonous influence of nationalism.\nIn December, the Marxist Tendency inflicted a defeat on HB. In January the latter struck back. Basing itself on the usual tactic of ‘Coordinating Committees’, the nationalists called for a demonstration in the first week of term. They were out of luck, however, as heavy snowstorms and atrocious conditions meant that only a handful of students turned out.\nThe Basque Marxists’ tactics were dictated by relative weakness. Whereas in Madrid they could directly challenge the ‘Coordinating Committee’, in the Basque Country they were compelled to apply the united front tactic, calling on the students to support their demonstrations and strikes. Predictably, the HB crowd refused all offers of joint action and stepped up their campaign of abuse.\nThis behaviour of the ‘abertzales’ did not serve to increase their support. Quite the opposite. The disgust felt by many Basque students at these hooligan tactics was shown by an event in San Sebastian, one of the strong points of radical nationalism. Under the influence of the Union, there was a demonstration of about 1,200 school students. About 50 HB supporters turned up with the banner of the ‘Coordinating Committee’ and placed themselves at the front. The students, who were not members of the Union, did not object. But when the ‘leaders’ began to chant slogans against the Union, like: “Sindicato, policía – la misma porquería” (“Union, police – the same trash”), the rest of the demonstration drowned them out by chanting: “The workers’ children to the university.” Upon arrival at the local office of the Ministry of Education, the HB crowd, as usual, began to throw bricks and bottles at the building. Realising that this would provoke a swift and violent police retaliation, 1,150 demonstrators instantly withdrew to stage a sitdown protest in the central boulevard. When it finally dawned on the ‘leaders’ that they had been left without a demonstration, they snatched up their banner and went scampering after their ‘followers’. The latter, however, were in no mood for fun and games, and gave them to understand that if they did not maintain a respectable distance, they would receive a painful lesson in manners from some of the more robust members of the demo. Whereupon, the ‘leaders’ were forced to sit on the opposite side of the road, proffering insults such as “traitors”, “Spaniards” and “Union supporters” against the demonstration!\nThis incident was highly significant and completely without precedent in the Basque Country. It shows how far support for the radical nationalists has begun to be eroded, even among the youth. This will open up serious possibilities for the Basque Marxists over a period. For the time being, however, the activities of these elements, who still have a powerful presence, represented a serious complicating factor, as the subsequent development of the struggle in the Basque Country showed.\n19-23 January\nThe early weeks of January were spent trying to organise a massive week-long movement on the 19th-23rd. The phone at the Union headquarters had not stopped ringing for weeks. Among the callers were many from the provinces. These were now summoned to Madrid to participate in the first national meeting of the SE on Sunday, 18 January. Representatives from 38 provinces reported on the situation in their areas and finally approved the plan of action advanced by the Union leadership. This consisted of the following: (1) assemblies in the schools on Monday, 19 January to discuss and vote on the plan of action, (2) a four-day general strike throughout Spain, commencing on Tuesday, 20 January, culminating in, (3) mass demonstrations all over Spain at midday on Friday, 23 January.\nThe national meeting went off without a hitch and the representatives speeded back to the provinces enthusiastically to organise the assemblies the following day. The same cannot be said of the ‘National Meeting’ of the ‘Coordinating Committee’ which ended in fisticuffs between the participants. This afforded amusement to the Union, but there was one element which was far from amusing. Having failed to muster more than 5,000 for their demonstration on Friday 16, these people now loudly proclaimed that they too would ‘convene’ a demonstration on Friday 23!\nThe possibility of a repeat performance of 17 December was not something the comrades could accept. But if these sectarian gangsters were to be prevented from usurping the head of the demonstration, this could lead to a bloody fracas, with disastrous consequences. The likelihood that they would call a separate demo on the 23rd was remote. It was clearly a cynical manoeuvre to take over the Union's demonstration. This was confirmed when they rang up, with all the cheek in the world, to ask for a meeting to “negotiate the head of the demonstration”. How to react? Was it permissible to make concessions in order to avoid trouble? The worst variant would be a violent clash. That must be avoided at all costs. Furthermore, the mood for unity was very strong among the youth. But they could not be allowed to hijack the demonstrations with impunity. It was decided to make them a reasonable offer. Of course they could participate in the demonstration, which was open to all except the fascists. We would even allow a couple of them to march at the front. But it must be under the Union banners, since the Union, not they, were the organisers.\nIt was felt that they might accept the offer, which would save a lot of bother. Should they refuse, there was another possibility – that of a split between the worst sectarian elements and those elements with at least some links to the mass organisations – i.e. the JJ.SS, ‘Euros’ and ‘pro-Soviet’ UJCs. It was in the Union's interest to split these away. This would facilitate its dealings, particularly with the Workers’ Commissions. The latter always insisted on ‘unity’ between the SE and the CC, often making this a condition for joint action. The hand of the PCE was obviously behind this. Their boys and girls were in the ‘Coordinating Committee’. How could they be left out? The Marxists were therefore very careful, as we have seen, to distinguish between the sects (MCE, Mandelites and Lambertists) and these other youth organisations to whom repeated approaches were made. If the leaders of these groups had had the faintest idea of tactics, we could have succeeded in splitting them away. But experience has shown that the petit-bourgeois degeneration of these organisations has gone so far, that they have forgotten whatever they might have understood in the past. In reality, they think and act no differently to the sects. They feel much more at home with the sects than with real Marxists. So they did not respond to the offers and, to the last, allowed the sectarian lunatics to make all the running. The latter, naturally, rejected our offer out of hand. One of the Mandelites sneered that if we did not agree to their pretensions “we had better look out”. The possibility of serious trouble now loomed large, and the demo was only a couple of days away.\nIn the event, the Marxists managed to completely outmanoeuvre the sectarians and avoid a clash, while maintaining effective control of the demonstration. A joint meeting was called by the Union, involving the CCOO, UGT, parents’ associations and the ‘Coordinating Committee’. The latter were shown up as sectarian gangsters. One of the CCOO officials present whispered to one of the comrades from the Union, after listening to a hysterical intervention by one of these elements: “How can one so young be such a son of a bitch?”\nIn the end, a ‘compromise’ agreement was arrived at whereby the demo would be preceded by a ‘unitary banner’, signed by no organisation, with a commonly agreed slogan: “Against the Government's Educational Policy” and carried by the representatives of the Union, the ‘Coordinating Committee’, CCOO, UGT and Parent's Associations. Immediately behind that would be the banner of the SE. Since the ‘unitary banner’ was carried by hand, almost nobody would see it, whereas the Union banner, raised on poles, would be seen by everybody. So, in practice, there was no doubt as to who was leading the demonstration. Everyone was happy except the sectarians whose chagrin knew no bounds once it dawned on them what had happened!\nThe mobilisations of that week were the biggest to date. Already on the Monday, many schools had ‘jumped the gun’ and gone on strike. By midweek the Ministry was forced to admit that the strike was general, with a participation of two and a half million.\nThe leaders of the Union made fresh approaches to the two main unions – CCOO and UGT – for joint action. Yet again the leaders stalled. While verbally supporting the Union, and also giving useful practical aid, both money and buildings, they studiously avoided any commitment to action.\nIt must be said that a four-day strike contained certain dangers. In particular, the possibility of uncoordinated sallies onto the streets and clashes with the fascists and police was always present. The tactic of the Union was to try to turn the school students towards the factories and the labour movement.\nThe key role was played by the strike committees. In every school, the Union pressed for the formation of such committees to give an organised expression to the movement. The nucleus of the strike committee was the Union ‘committee of four’ – one secretary, one treasurer, one person in charge of propaganda, and one for security. To this nucleus was added one elected representative for each class. Anyone could be elected, whether a Union member or not, provided they agreed to defend the Union’s demands and act under its discipline. Each strike committee would send one delegate to the Central Strike Committee, which was the body which really organised and coordinated the struggle.\nThe slogans of the Union, its plan of action, tactics and strategy were conveyed to the schools via this delegate meeting which met once or twice a week, according to the needs of the moment. The strike committee in the schools met every morning to work out a plan of action. There was a general tendency to go out on the streets and form human barricades across the road to cause traffic jams. This tactic, which occasionally led to conflict between demonstrators and ordinary workers, was discouraged by the Union, which instead advocated teams of students going to the factories in each area, to explain the case and appeal for support and cash.\nWherever this was done, the results were extremely encouraging. In Zaragoza, the local bus-workers of TUZCA allowed the school students to travel free during the strike. The dockers, who were involved in their own dispute, called a strike on 23 January, and voted to call mass meetings whenever requested, to allow the school students to speak and make collections. Whenever the youth turned out with collection boxes, outside factories or in market places, the money flowed in, expressing the potential support. In Tarragona, the comrades worked out a novel variant of the typical ‘roadblock’ tactic, which proved quite profitable. They simply went along the waiting line of cars with a collection box, and raised a lot of money.\nThe strike was solid. The public support was there to be seen. According to an opinion poll held after the week of action, 67 percent supported the school students and only 13 percent supported the government. And still, the leaders of the main workers’ unions resisted the call for solidarity action and a 24-hour general strike.\nWith every demonstration called by the Union, the comrades’ experience and ability grew. The organisation of the ‘servicio de orden’ (defence pickets) now proceeded like clockwork. As on 17 December, a delegate meeting of comrades responsible for security discussed the tactics to follow. Serious clashes with the fascists were not ruled out. They had announced a counter-demonstration, which, setting out from a different point, would end up at the door of the Ministry at precisely the same time as the Union’s demonstration. Despite the blatant nature of the provocation, the ‘Socialist’ civil governor gave legal permission for the fascists to proceed.\nOn the morning of 23 January, no fewer than 2,000 defence pickets formed an iron ring around the head of the demonstration, which numbered about 200,000. The demonstration proceeded with perfect order.\nThe fascists had now completely changed their tactics. No attempt was made to attack the demonstrators directly. The impressively disciplined defence pickets were enough to deter any would-be aggressor. But half an hour before the demonstration was due to arrive the fascist gangs were already at work, attacking the police outside the Ministry with bricks, steel catapults and Molotov cocktails. Cars were overturned and set on fire and the windows of banks and offices smashed. Yet the police stood by and did nothing.\nThere is no doubt that the police were out in more than enough strength to disperse the fascist provocateurs. Their arsenal included rifles, pistols, shotguns, rubber bullets, tear gas, smoke bombs, armoured buses, motorbikes, water-cannons and mounted police. But no order was issued to attack the fascists and provocateurs who were allowed to rampage with impunity.\nShortly before approaching the turning point of Cibeles, only a short distance from the Ministry, the stewards, informed of the situation, called a halt. A group of about 1,000 flying pickets, armed with clubs, were ordered ahead to clear the provocateurs out of the way and allow the demonstration to pass. But as soon as the pickets appeared on the scene, the police received the order to charge.\nIn the confusion which followed, armoured buses drove full-speed just in front of the demonstration with lights flashing and horns blaring. Frightened youngsters scattered in all directions, pursued by riot police who battered everyone who stood in their way. Yet despite being bombarded by water cannons, the pickets, with exemplary courage and discipline, stood their ground. The line held. The demonstration was saved. A group of police on motorbikes made the mistake of driving right into the crowd. Having failed to break the demonstration, they were thrown to the ground, kicked and punched, and forced to run for their lives, leaving their expensive bikes on the ground where they were swiftly reduced to scrap metal by the enraged youngsters.\nSomewhere at this point a young girl, 14 years of age, was shot in the pelvis by a police bullet. The police later claimed that they were surrounded by an angry crowd and protected themselves by “firing in the air”. But photos released by the press showed the falsity of these statements.\nThe news of the shooting caused a shock-wave of revulsion. Marcelino Camacho later confided in the leaders of the Union that, if the girl had died, the CCOO would have called a general strike. The truth is that, if she had died, there would have been a spontaneous movement of the workers, with or without a call from the leaders.\nThe events of the 23rd caused a wave of panic in government circles. Realising the dangerous situation that existed, the mass media, beginning with El Pais, did a 180-degree turn and began to put pressure on the government. The prestigious editor of El Pais, Juan Luis Cebrian, wrote a front-page editorial warning Felipe Gonzalez of the consequences of getting out of touch with the workers and the youth. In an unprecedented step, El Pais gave half a page of its Sunday edition, read by millions of people, to an Open Letter to the Education Minister, signed by Juan Ignacio Ramos, without changing a word (see appendix).\nIt was likewise unprecedented that four policemen involved in the shooting should be immediately suspended without pay, and that the reactionary Minister of the Interior, Jose Barrionuevo, should attempt to distance himself from the behaviour of the police on this demonstration.\nWhen the Union heard of the shooting, it immediately called for a further one-day strike in protest on Monday. It is interesting to note that many of the police themselves complained, through their Union, about the tactics used on the 23rd and the instructions given by their officers. At no point was any blame placed with the organisers of the demonstration. On the Monday, El Pais even revealed that the Civil Governor, Ana Tutor, had been warned by the Spanish equivalent of the Special Branch that “ultra-right groups” were planning to sabotage the demonstration, yet no measures were taken.\nWho were the provocateurs?\nA constant thread running through the dispute was the activities of ‘uncontrolled elements’ carrying out violent activities on the fringes of the demonstrations.\nThe reactionary role of these groups was clear. Their disorganising and provocative activities played into the hands of the police, the press and the government. But who were they? The question does not admit of a simple answer.\nIt is perfectly clear that there were organised fascist groups involved at every stage in these activities. It is not even ruled out that police agents were involved. Certainly, from first to last, the behaviour of the police in relation to these provocateurs looked very much like coordinated action to disrupt the demonstration and cause as much chaos and mayhem as possible. Curiously enough, as in Britain, many of these elements are organised around football clubs – in this case the supporters of Real Madrid (‘Ultra-Sur’) and Atletico – a mixture of lumpens and fascist or quasi-fascist types. These people are well known to the police. The press reported one case of a well-known ‘bovver-boy’ known as ‘El Cojo’ (‘The Cripple’) who appeared to millions of TV viewers calmly wrecking an underground station with one crutch while balancing precariously on the other. This individual (who could hardly be overlooked) was arrested, released, turned up again in Seville, arrested and released again, presumably to continue his career of tourism-cum-phone box smashing, unmolested by the police or TV camera crews!\nHowever, there were other elements involved. It is beyond dispute that the leaders of the ‘Coordinating Committee’ brought along lumpen thugs, presumably recruited from the most depressed areas, on the basis of a promised ‘punch-up’ on the demonstration of 17 December. But these elements proved to be uncontrollable, and subsequently tagged along with every demonstration, purely from the point of view of causing destruction and fighting with the police. On one demonstration in Barcelona, they smashed up a McDonald's restaurant and made off with the cash register!\nThis kind of thing was naturally seized upon by the press who gave very little coverage of the mass demonstrations of 100-200,000, but continually played up the element of vandalism and hooliganism.\nIt is true that, mixed up with these fascist and lumpen provocateurs, there were some good youth who were prepared to ‘have a go’ at any cost. As one comrade put it: “There are some youngsters who would sign up for a bombardment!” But these were a small minority. The great majority of the school students were opposed to the tactics, and made their views felt by chanting: “Somos estudiantes, no maleantes!” “We are students, not yobbos!”. On the last couple of demonstrations, as a graphic expression that they understood the nature of the provocation, school students would often stand, unarmed, between the police and their attackers, trying to stop the stone-throwing.\nAccording to press reports towards the end of the dispute, certain ultra-left sects were alleged to have been mixed up with the provocateurs. As the source of these reports was the Intelligence Services (‘Special Branch’, etc) they must be treated with caution. But it is not ruled out that the lunatic fringe of the ‘Coordinating Committee’ were involved to one degree or another. Certainly the insane tactic of calling unauthorised demonstrations outside the parliament and the Moncloa Palace were calculated to provoke violent clashes. There was a strong suspicion that what was intended was to cause the death of some unfortunate student so as somehow to repeat what happened in France. Naturally, the victim would not be one of the sectarians, who invariably were the first to take to their heels at the first glint of a policeman's helmet.\nAccording to these (unsubstantiated) press reports, the main group behind the Madrid 'Coordinating Committee’, the so-called ‘Communist Movement’ (MCE), had received funds from Libya and was now discussing going over to ‘armed struggle’, i.e. individual terrorism. There is no means of knowing if this is true, but, given their past record, this cannot be ruled out. As for the other groups named – the LCR (Mandelites) and POSI (Lambertists) – these are of merely anecdotal significance. Nevertheless, the fact that the Lambertists physically assaulted a comrade in Bilbao is an indication of the depths these people can stoop to. It is not impossible that they too would support such ‘revolutionary’ tactics as window-smashing, car-burning and attacks on the police – from a safe distance, of course!\nLeaving aside the dirty game of provocation played by the fascists, and the ultra-left antics of the sects, the violent outbursts of a layer of the Spanish youth is also part of an international phenomenon. It is somewhat akin to the mentality of the most dispossessed layers of the youth who participate in riots in Britain. It is an expression of the impasse of youth under capitalism, the feeling of rage, frustration and desperation which is becoming widespread, and which, given the lack of authority of the reformist leadership of the traditional workers’ organisations expresses itself in outbreaks of blind violence. Hatred of the police is another big factor in these outbursts. With a Marxist leadership, a large element of this lumpenised layer could be won to a genuine revolutionary perspective. But the activities of the ultra-left maniacs only serve to ‘educate’ the youth backwards.\nNew negotiations\nIn retrospect, the week of the 19th to 23rd, and especially the mass demonstrations of Friday 23, was a decisive turning point. The government and the ruling class undoubtedly took fright. The day after the demonstration, the centre of Madrid looked like a battleground. The picture in the newspapers looked like a scene out of a civil war. The shooting of a 14-year old girl shocked public opinion. To make matters worse, she was from an ordinary working-class family (her father is a house-painter) which had been affected by the poison oil scandal. Both her father and sister had been seriously ill. The former, while firmly defending his daughter's decision to go on the demonstration, commented bitterly: “They've poisoned one of my daughters and now they've nearly killed the other one.” The declaration of this ordinary worker, who refused to shake hands with the minister who went to visit his daughter in hospital, must have struck a responsive note with millions: “I am a worker,” he explained, “and as such, I am left-wing…” Valentin says he is illiterate. “When I was of school age,” he explained, “I had to work in order to eat, that is why I wanted my children to study; not to get into positions of power, but for their own sake, as people.”\nThe pressures upon the government were now becoming unbearable. On the following Monday the Education Minister, Jose Maria Maravall, for the first time offered to negotiate in person with the students. This was the first clear indication that the government’s nerve was cracking.\nHowever, the battle was far from over. It was clear that the government, ground between two millstones, was split. Pressure from the streets and factories was creating a dangerous situation. But pressure from the bankers, reflected through the right-wing Minister of the Economy, Solchaga, was aimed at resisting all attempts to give financial concessions which would spell the abandonment of the government’s austerity policies. Once the school students opened a breach in the dam, the workers’ wage demands would then pour through.\nThe initial offer, couched in terms which made it appear generous, fell far short of what the Union was asking for. Nevertheless, the enormous publicity given to the offer, and the fact that such concessions were quite unprecedented, caused widespread surprise in working class circles. Most people never expected the government to offer anything. Had the Union said “yes” to the first offer, it would undoubtedly have been seen as a victory by the great majority of workers. Indeed, the UGT leaders now began to apply pressure on the SE to accept this ‘reasonable’ offer.\nIt was not entirely ruled out that the Union might accept. While explicitly rejecting the abolition of selectivity, the government offered: (1) an increase in the number of school places for 1987-88, (2) an increase in grants for the same period, (3) university matriculation fees to be increased in line with the official rate of inflation, 5 percent, (4) modification of university entrance, and (5) improved participation of students m educational policy.\nTo reject this offer was a high-risk strategy. The struggle had now gone on for nearly two months. The splitting activity of the sects and CP was becoming an increasingly complicating factor. The government consciously played upon this fact. In Valencia, where the YCL and YS had virtual control of the ‘Coordinating Committee’, a separate deal was signed. An intransigent stance would also risk alienating the support of the majority of workers and parents, now increasingly worried not only by the loss of education for their children, but also by the violence, highlighted by the press.\nThe Ministry now adopted a new tactic designed to undermine the Union and highlight the divisions. Ever since December, the only people who systematically participated in negotiations with the Ministry were the members of the Union’s negotiating committee. Now the Ministry made it clear that “all the forces of the student movement” would be invited to the negotiations. They were fully aware that the only representative force in the student movement nationally was the SE. The ‘coordinating committees’ had no national structure and, whenever they attempted to form one, came to blows. To get round this, by sleight of hand, the Madrid ‘Coordinating Committee’ was invited. At the same time, the Ministry invited the CEAE (State Confederation of Student Associations), who turned out to be members of the Young Socialists representing nobody but themselves but with the merit of being completely at one with the Ministry!\nThe government’s tactic was quite clear: to use the negotiations to allay criticism that they were ‘unreasonable’, to demobilise the school students by spinning out the talks, and to highlight divisions among the students. At the end, having undermined the movement, they could then terminate negotiations and, if necessary, sign a deal with ‘their boys' in the CEAE.\nThe Union went into the negotiations determined to try to wrest more concessions from the government. At the same time, it was fully understood that the pressure of the bankers through the PSOE right wing would render this virtually impossible, that the only guarantee of success was the pressure of a mass movement of workers and students and that the prolongation of negotiations could be dangerous from the point of view of the morale of the students. Despite this, it was absolutely necessary to participate in negotiations taking full advantage of the publicity afforded to explain the Union’s case. To have refused to do this, particularly now that the Minister had agreed to participate in person, would have been ultra-left madness. Even the ‘Coordinating Committee’, after making some ‘revolutionary’ noises, finally crept in through the Ministry door and sat sulking in the corner.\nHaving shown that they knew how to fight, the Marxists now showed that they knew how to negotiate. While the CEAE had nothing to say (as is usually the case of ventriloquists’ dummies the world over), and the ‘Coordinating Committee’ limited themselves to repeating slogans and generalities, the Union’s negotiators had done their homework and hammered away with a barrage of facts, figures and arguments. This took the enemy aback. On more than one occasion, they were unable to answer the arguments of the Union. From the start to finish, it was a single combat between the Ministry and the SE. An amusing sideline was the plight of Jose Maria Maravall. This ‘left’ minister, in his youth, had participated in the student demonstrations in France in May 1968 – a painful point – of which the press was constantly reminding him. In one of the hundreds of cartoons which appeared, there was one of Maravall saying to Felipe Gonzalez: “But didn't we also demonstrate when we were students?” To which Gonzalez replies: “Yes, but we weren't in government at that time!” Maravall played no independent role in these discussions. He sat throughout, flanked on either side by the two ‘hardliners’ Rubalcaba and Barroso. At one point, Juan Ignacio Ramos, for the Union, had made a concrete offer and Maravall plucked up the courage to say that he thought this might be acceptable, but was swiftly restrained by Rubalcaba who came out with an abrupt “no”. And “no” it was. This kind of incident graphically highlighted both the divisions in the government – and who held the whip hand.\nAs in December, it was evident that participation in negotiations carried a risk that, if a serious offer was not made, the movement would explode, and the Union might find itself left behind by the youth. The ‘Coordinating Committee’ called a demonstration on the Tuesday, one day before negotiations were due to start, ostensibly to protest against police brutality on the 23rd. They had also threatened to boycott the negotiations (having shouted loudest of all that they demanded to negotiate directly with the Minister!). Only 4,000 turned up and, as could be predicted, they soon forgot about their ‘boycott’ of the negotiations.\nNevertheless, it was necessary to avoid becoming divorced from the rank-and-file and falling into the trap of ‘parliamentary cretinism’. The Union decided that the best defence was to keep the rank-and-file fully informed of the state of negotiations. The press had given ample publicity to the Ministry’s offer. It was necessary to counter this by giving a detailed breakdown of the Union’s demands, which was done by circulating a fully worked-out platform. The old general slogans were now insufficient. These were useful as rallying cries upon which to mobilise the mass of the youth, but after two months of struggle, it was necessary to have a perspective as to how it was all going to end. It was vital to give the ‘state of mind’ a concrete content, to concretise the aspirations of the movement in a list of demands and to decide which of these demands were fundamental to any agreement – to separate the essential from the non-essential – and, if need be, to prepare a fallback position in the event of the movement entering into decline.\nThis was far from easy. The positions of the Union and the Ministry were very far apart. The idea of ‘no selectivity’ and ‘no matriculation fees’ had been taken up and widely echoed on the demonstrations. Yet it was difficult to see how the first demand could be met in practice within the confines of the capitalist system. The idea that everyone, without exception, should be allowed access to university education, was an attractive one. But the practicalities of putting it into effect were another question. Spanish Universities suffer appalling overcrowding with classes of over 100 and ‘standing room only’. Either a whole series of new universities would be built, or the slogan ‘no selectivity’ would virtually mean that the students would be standing on each others’ heads! The government was not slow to seize upon what was clearly a weak point in the students’ case to ridicule the whole idea.\nIn answer, the Union demanded the building of new universities, one in the south of Madrid and one in Navarra. But it was clearly necessary to rethink the position in relation to this, and other demands.\nIt would be extremely naive to imagine that the mass of working class school students were fighting against ‘selectivity’ when the great majority of them had no thought of ever going to university. In point of fact, some of the youth were already complaining in December of the excessively university-orientated nature of the campaign. There are still not enough primary school places in Spain. Many schools’ buildings are in a shocking state of disrepair. In the course of the dispute itself, many pupils came out on strike because, in sub-zero temperatures in January, there was no heating in the classrooms. The Union made a point of including a whole series of demands relating to technical school students, night-school and apprentices, to broaden the base of the movement and give it a clear class content.\nThe Ministry argued demagogically that the demand for the abolition of matriculation fees was ‘reactionary’ because it would apply equally to the children of rich and poor families. On the other hand, they would be prepared to help working class children to go to universities by increasing grants.\nIn reality, the central slogan of the movement, “the workers’ children to the university”, could be given a concrete content by removing unnecessary obstacles placed in the way of university admittance, abolishing matriculation fees for children from working-class and lower middle-class families and achieving a decent level of grants, at least to cover books, transport and provide a subsidy to cover basic expenses. The Union’s negotiators therefore worked out a list of demands which would effectively do all these things.\nThe problem was that the Ministry, under the pressure of the right wing of the government, was not willing to find the extra money necessary to cover these and all the other demands advanced by the Union. This point was turned to good advantage in the propaganda of the Marxists who explained that the money was there – in the hands of the bankers and capitalists and also in the form of the monstrous burden of arms expenditure. The latter point, in particular, caught the imagination of the youth, and featured prominently in all future demonstrations – further proof of the increasingly politicised nature of the movement.\nThe workers’ mood\nThe fundamental problem was that to win the basic aims of the movement meant nothing less than a frontal challenge to the government’s economic policy. No other group had yet succeeded in forcing the government off course. Could the school students succeed?\nIn the heat of the struggle, with millions of young people becoming aware of the power of an organised mass movement, it was easy for activists in the schools to get carried away with an exaggerated idea of what could be achieved by the student movement on its own. To the sectarian hare-brains, with no understanding and no grasp of tactics and strategy, the problem was a very simple one. But a general whose understanding of warfare was limited to a single command: “Advance!”, would very quickly end up without an army. The Spanish Marxists understood the need to tell the students the truth at every stage of the movement – to use Trotsky's expression, not to be afraid to “say what is”.\nWithout the active support of the working class, the school students could not hope to beat the government behind which stood the might of the ruling class. Fine words and resolutions were not enough, what was needed was one clear example of united action of students and workers.\nNow after two months of bitter struggle, the effects of the movement were beginning to tell. The teachers began to learn from their pupils! A nation-wide teachers’ strike was threatened in both public and private education.\nMeanwhile, after years of simmering discontent, the South exploded. By the first week of February, there was a general strike of the agricultural labourers in Andalusia and Extremadura. This most downtrodden and oppressed section of the working class, which had voted Socialist almost to a man, was long-used to the nightmare of unemployment and poverty wages. But when the Socialist government in which they had placed their trust voted to cut the number of agricultural labourers entitled to receive unemployment benefit by about 100,000, their anger boiled over. Copying the tactics of the students, they organised roadblocks in Andalusia and especially in Extremadura. The ferment extended to every village, forcing the Union leaders to give a lead. Frightened, the government hastily backed off and gave assurances that only a “minor” alteration was planned. This was enough to satisfy the leaders of the UGT. But not the Workers’ Commissions who called for a ‘March on Madrid’.\nOn the parliamentary plane, the opposition were demanding that both Maravall and Barrionuevo (the Interior Minister) appear in person to answer for their actions.\nMeanwhile, trouble was looming on another front. The simmering discontent of the oppressed Arab minority of Melilla, the Spanish enclave on the coast of north Africa, burst forth in violent rioting. The immediate cause was the exiling to Morocco of the nationalist leader Mohamed Dudu and police brutality. On the night of Saturday 31 January, Spanish police burst into the Arab quarter, breaking into houses and beating up men, women and children. The resulting riots ended with four Arabs having gunshot wounds, one of whom, a worker, later died, and the arrest of 32 Arab community leaders.\nTo add fuel to the flames, rightwing Minister Solchaga publicly announced a “major contraction in employment” in industry, specifically mentioning shipbuilding, steel, chemicals, machine-tools, and, in the same breath promised to reduce by 1 percent the employers’ contributions to social security in the course of 1987, to be paid for by an increase in VAT!\nJust for good measure, some three months after elections for the autonomous Basque parliament, the umpteenth attempt to form a coalition government had broken down.\nIf there was any doubt that the government might come up with a reasonable offer, Solchaga’s provocative speech soon clarified the position. There could be no doubt. The right wing had triumphed all along the line. There was nothing for it but to prepare for action once more.\nFor the leaders of the ‘Coordinating Committee’, these tactical problems did not exist. Their attendance at the negotiating table was a mere formality, as they had really nothing to say. Trotsky once defined an ultra-left as an opportunist who is afraid of his own opportunism. That is why the most lunatic ultra-left can pass over to the most craven opportunism without blinking an eyelid. The ‘contribution’ of these elements to the negotiations was to call off their ‘indefinite general strike’ in Madrid two days before the meeting with the Minister! From a logical point of view this made considerable sense, as only a handful of schools had followed this wholly erroneous and damaging tactic. The Marxists had opposed this idea from the outset. But ‘timing is of the essence’ in politics. It was wrong to call an ‘indefinite general strike’ in the first place, but it was doubly wrong to call it off just at the moment when negotiations were due to begin. This undoubtedly helped to convince the Ministry that the movement was in decline and made them harden their position still more. Incidentally, the original ‘decision’ to call the strike had been taken undemocratically, without a vote. But the decision to call it off was called without even a meeting! A mere sentence casually tossed off at a press conference by the leading light of the MCE sect was sufficient. And these ladies and gentlemen have the effrontery to pose as ‘democrats’ in contrast to the SE!\nFrom ultra-leftism to opportunism and back again! Even while the negotiations were still continuing, the ‘Coordinating Committee’ announced new ‘mobilisations’. This whole episode really exposed the motives of these people. Completely uninterested in the cause of the school students, their one abiding obsession was how to ‘go one better’ than the Union.\nThe ‘Coordinating Committee’ called one demonstration on Tuesday 3 February outside the Cortes (the parliament) and another for Friday 6 February which they pompously styled the ‘March on the Moncloa Palace’ (the residence of Felipe Gonzalez). Despite repeated warnings that it was not permitted to hold demonstrations in either of these places, the organisers did not even attempt to contact the authorities to request authorisation. On the contrary, they made it perfectly plain in declarations to the press that it was a matter of indifference to them whether the demonstrations were legal or not. In the situation where a 14-year-old girl had been shot and seriously wounded, it is justified to question the motivation of elements prepared to call the youth out onto the streets under such circumstances. Could it be possible that somebody was hoping for a demonstrator to be killed in the hope that this would somehow lead to an explosion à la France? Perhaps such a theory does not correspond to the facts. Perhaps what was behind it was not so much a conscious strategy, but mere adventurist madness. Either way, these thoroughly irresponsible acts could have led to an absolute disaster – if they had been followed by the students. Fortunately that was not the case.\nUp to this point, the SE had adopted a flexible tactic in relation to the actions called by the ‘Coordinating Committees’. In general, the Union, while not calling for support, did not openly come out against, but limited itself to positively explaining its alternative, and then adding: “But if your school has voted democratically to support this action, go ahead.” This time, however, it was different. The provocative nature of these actions was too evident. The danger of a bloody catastrophe was implicit in the situation. For the first time, the Union made it absolutely clear that it was opposed to the demonstrations and urged the students to stay away.\nIn the event, ‘the mountain laboured and brought forth – a mouse.’ Only about 400 turned up outside the Cortes, mainly lumpens, who bombarded the police for hours with bottles, stones, Molotov cocktails, nuts and bolts. Needless to say, the press gave this futile skirmishing front-page coverage. The following day, a group of 500 students invaded the Barcelona Stock Exchange and there were sit-ins and other incidents in Sabadell, Cornella, Gava, Cerdanyola and Terrassa, in Catalonia.\nThe Union did not want to take responsibility for breaking off negotiations, or be accused of ‘not negotiating seriously’. But, after many hours of talks, it was clear to everyone that agreement was not in sight. In the words of an American president, the policy adopted by the Union was: “Talk softly, and carry a big stick.” By exhausting the avenue of negotiation, in the full glare of public attention, the SE demonstrated that the responsibility for the resumption of hostilities rested with the Ministry.\nThe leaders of the SE now drew up a careful balance sheet of the situation. The perspective which now faced them was by no means an easy one. Reports were coming in of a certain tiredness among the youth after such a long struggle. Of course, this mood was contradictory, with new layers coming into battle, and others dropping by the wayside. But the overall picture was frankly not encouraging. It was clear that unless the movement was reinforced by the workers, it was unlikely to shift the government from its position.\nThere were long and sometimes heated discussions as to the best course of action to take. Should we call for an immediate general strike of the students? Or concentrate forces in a new major offensive? The latter position was adopted, in the full knowledge that this would most likely be the last time they could pull it off. In view of the fact that a national teachers’ strike had been called for three days the following week, it was agreed that nothing would be lost by calling a week’s strike. However, the need was felt for a different kind of tactic, something new and impressive which would catch the imagination of the youth nationally. The idea of a ‘March on Madrid’ had been tentatively floated before. This was now adopted as the culminating action of the week. There were doubts. Such a venture was something of a leap in the dark. Spain is a big country, and to move a large number of youth hundreds of kilometres required funds the Union did not possess. Nevertheless, the idea had gripped the imagination of the comrades in the provinces. Collections were soon organised in factories, trade union branches, local town councils, even individual mayors gave money.\nOnce again the SE entered into contact with the unions. By this time however, the UGT had cooled off. They were “disappointed” the SE had not accepted such a “reasonable” offer, and so on and so forth. They did not want to break off relations, but neither were they prepared to lift a finger to support the new round of action.\nThe response of the CCOO was quite different. They had moved some way from their original position, clearly under pressure of the rank-and-file. One of the leaders of the Madrid CCOO said: “We now realise that the workers are very sensitive on this issue. That's understandable, because more or less everyone has got a son or a daughter who is at school.” Pressed on the question of joint action, the CCOO leaders, after lengthy discussion, came up at last with a concrete proposal for action which, while it fell a long way short of what the Union was asking for, nevertheless, in essence, represented a breakthrough. Basically, they offered two things: convergence in action of students, teachers and agricultural workers (on the grounds that the latter were already involved in action) and united demonstrations of workers and students, jointly called by the SE and CCOO all over Spain.\nNaturally, this offer had to be seized with both hands. But there were a number of seriously complicating factors. Firstly, the proposed joint demonstrations seemed to cut across the idea, already launched by the SE, of a ‘March on Madrid’. The reluctance of the CCOO leaders to call for strike action meant that the joint demonstrations would have to be called in the evening. Would the school students come to a demonstration at seven o’clock in the evening? Doubts were expressed about the organising capabilities of the CCOO leaders and their ability to mobilise a large number of workers. These doubts proved to be well-founded later on. Finally, there was a question mark concerning the motives of some of the CCOO leaders. The sincerity of Camacho’s support for a militant alliance with the SE was not in question. But other elements in the CCOO leadership, especially those linked to the Euro-communist PCE of Gerardo Iglesias, had been playing ducks and drakes all along, manoeuvring between the SE and the Madrid ‘Coordinating Committee’, with a clear leaning towards the latter. This was not unrelated to the fact that the YCL, a hopeless bunch of petit-bourgeois trendies, were heavily involved in the ‘Coordinating Committee’. Iglesias and the PCE leaders were also desperate to ‘get in on the act’. Would these elements not try to manoeuvre ‘their people’ into the limelight at the expense of the SE?\nDespite serious misgivings by some comrades, it was decided to accept the offer of the CCOO, but to maintain the ‘March on Madrid’ on Friday. To hold two demonstrations in Madrid in less than 48 hours was going to be a very severe test. But it at least enabled the SE to have a fall-back position, in case the Wednesday demonstration, for whatever reason, proved to be a failure. Everybody realised that this week would be the final and decisive round in the struggle, and the comrades were determined to go out ‘with a bang, not a whimper’.\nThe Union’s plan of action for the coming week was as follows: (1) a weeklong general strike to close down the entire education system, (2) joint demonstrations of students and workers, called by the CCOO and SE on Wednesday 11 February at 7pm, all over Spain, (3) a ‘March on Madrid’ in which thousands of students from the provinces would converge on the Ministry in a massive show of strength.\nAfter the dismal failure of the demo outside the Cortes, it was felt that the ‘Coordinating Committee’ would desist from the mad idea of an unauthorised march on the ‘Moncloa’. But there were clearly no limits to the lunacy of the sects, who issued press statements urging students to turn up on Friday morning, whether permission was granted or not. The press obliged, blatantly publishing detailed maps of the intended route of the illegal demonstration! Somebody was clearly interested in provoking a violent confrontation.\nThe results were predictable. The assembly point was occupied by a massive police force. The police were seething with anger at “being turned into targets for the amusement of some people”, and were thirsting for revenge. In the event, not more than a thousand turned up, and were immediately dispersed by the police, who subjected any young people they caught to merciless beatings. The violent images were played up by the media in a clearly orchestrated campaign to slander the students and undermine public support.\nIncredible as it might seem, the sectarian ignoramuses were elated by their actions. Evidently, a successful demonstration is judged by the number of cracked heads which results! At this point, the worst fears of the SE were borne out. Once again the ‘Coordinating Committee’ resorted to the manoeuvre of ‘convening’ a demonstration on the 11th. And the CCOO insisted on the ‘unitary’ character of the demonstration, arguing that the ‘Coordinating Committee’ should be invited to the preparatory meeting and hinting strongly that ‘political personalities’ should be present at the head of the demonstration. The hand of the CP was all too clearly in evidence! Indignant at these behind-the-scenes manoeuvres, the leaders of the Union let the CCOO know that it would not be a good idea for these ‘political personalities’ (i.e. Gerardo Iglesias) to appear at the head of the demonstration as this would not be understood or accepted by the majority of the youth. This was no lie. The feeling of suspicion towards political parties attempting to manipulate the movement ran very deep, to the extent that many school students even asked why Marcelino Camacho was allowed to lead their demonstration. When the role of the trade unions and the need to link up with the workers was explained, they readily accepted it. But the last-minute intervention of parliamentary prima donnas who had played no role in the struggle and were clearly out for their own ends would have caused a storm of indignation. Discretion being the better part of valour, the CCOO leaders immediately desisted.\nHowever, on the question of the ‘Coordinating Committee’, they were more persistent. At the joint meeting attended by the representatives of the SE, CCOO, parents’ associations and the ‘Coordinating Committee’ (the UGT had already backed out by this time), the sectarians, puffed up with their own imagined importance, imposed intolerable demands, in effect insisting that they, and not the Union, should precede the demonstration. The CCOO representative present took an ambiguous line on this question. When this was reported back to the leading comrades, such was the indignation aroused that the breaking off of negotiations with the CCOO was seriously contemplated. However, in the interests of maintaining joint action – however limited – with the workers’ organisations, it was agreed to put pressure on the CCOO leaders and parents’ associations to clarify their position on this question. A verbal tug-of-war ensued which at times looked as if it would lead to an open split. But in the end, the SE carried its point of view. At the eleventh hour, both the CCOO and the parents’ associations came down clearly in favour of the Union’s formula, which was identical to the previous demonstration on 23 January: a ‘unitary banner’ with an agreed slogan, immediately followed by the banner of the SE, held aloft. And to make the point abundantly clear, the sectarians were warned by both the CCOO and parents’ associations that they had better not try any stunts to override the decision of the majority.\nTo the very last moment, the reliability of the Union’s allies remained open to doubt. Only days before the action was due to start, the section of the CCOO representing the teachers in the state educational sector unexpectedly signed a deal with the Ministry of Education, which, despite being described as a “historic” victory by the CCOO leaders, in effect represented a climb-down before the battle had even commenced. Incredibly, the teachers’ representative told the press that “the Ministry of Education is passing through a very delicate situation, and it is not the intention of the trade unions to ‘pour oil on the flames’ and increase the conflictivity.” (El Pais, 5 February, 1987)\nThis was a serious blow. The Union’s call for a week-long strike was partly based on the calculation that the schools would be paralysed for three days by the teachers’ strike in any event. Now it would be necessary to redouble the effort to be sure of a solid response. But the feedback from the provinces was anything but encouraging. There was a general mood of tiredness. Many comrades were pessimistic about the prospects of another strike, particularly of a week’s duration. The wrecking tactics of Herri Batasuna in the Basque country had led to a very bad mood among the youth. In other provinces there was alarming news of local deals being signed, along the line of the Ministry’s initial offer. The Ministry was in permanent contact with the regional and local Education Boards and was clearly organising a campaign to promote local deals in order to split the movement up. Meanwhile the press, prodded by the government, did a 180-degree turn. Its coverage of the student movement virtually ceased, with one exception. The Union’s call for action was effectively silenced by the press and TV. But all the violent actions of the vandals, lumpens and provocateurs were continually played up. The lunatic activities of the ‘Coordinating Committee’ were exploited to the full by the vultures of the media.\nIn the Union’s one small office in Madrid, the phones never stopped ringing as the provinces were informed of the plan of action. To concretise things further, a national meeting of the Union was called for Sunday 8 February in Madrid. Representatives came from as far afield as Ceuta and Melilla, the two Spanish enclaves in North Africa, who flew to Madrid for the purpose. The mood of the meeting was solemn and serious. Several areas pointed to the difficulties they faced. But the proposals of the Union were unanimously accepted. One encouraging feature of the meeting was the presence, for the first time, of delegates from Valencia. At the instigation of a ‘Coordinating Committee’ dominated by the YCL and Young Socialists, a local deal had been signed which was nothing more than a sell-out to the government. When the school students realised what had happened, all hell broke out, with a spate of ‘unofficial’ strikes. The ‘Coordinating Committee’ was completely discredited, the best students sought out, and found, the Union.\nThe same experience was now occurring in many areas. Former supporters of the Coordinating Committees, whole schools, and with increasing frequency, whole Coordinating Committees in areas like Granada where the youth had initially held aloof from both the SE and the sectarians now swung behind the Union. This was no accident. In the course of two months of struggle, the Union had proven the superiority of its perspectives, programme, strategy and tactics. It had thus gained a colossal authority in the eyes of the youth, and particularly its most active layer. “These are the only serious people. These are the ones to turn to for advice. The others are a waste of time.”\nThis harsh but truthful judgement was commonly expressed by young people from all over Spain at this time. The adventurist tactics pursued in the week before did the sectarians enormous damage. Unfortunately, they also damaged the movement as a whole. Many parents, initially sympathetic to the dispute, now began to back away. This was particularly damaging for the ‘March on Madrid’, since the pressure of parents in the provinces to prevent students going to Madrid was particularly intense.\nOn the positive side, the Workers’ Commissions appeared to be taking concrete steps to organise the struggle, printing a poster and calling a press conference, attended by Camacho himself, with Juan Ignacio Ramos and the representatives of the other groups involved. At this press conference, the journalists pressed Camacho to say whether or not the CCOO would call a general strike the following week. The general secretary of the CCOO gave a cautious, noncommittal answer. The representative of the SE immediately replied that, in the Union's opinion, the conditions were ripe for a 24-hour general strike and that the leaders of the CCOO and UGT ought to call one. After the conference had finished, Camacho told Juan Ignacio in private that the Workers’ Commissions had now decided in favour of calling a general strike “in the spring” and could they count on the SE’s support? Juan Ignacio replied that, obviously, the Union would support such a call, but pointed out that the students had been in struggle for over two months and were virtually exhausted. If the Ministry made an acceptable offer, they would be obliged to accept it. This position made sense to the leaders of the CCOO, who replied, correctly, that a victory of the students would encourage the workers to press for their demands.\nThe very way of posing the question showed the limitations of even the best of these trade union leaders. The working class and the youth are not a tap, to be turned on and off at will. The class has a logic of its own. The idea that the youth could continue their struggle indefinitely, until the union leaders finally made up their minds to act was a sure recipe for defeat. The hesitations and vacillations of the union leaders indicated their complete lack of confidence in the working class. The events of the next seven days and after proved that the so-called realistic trade union leaders were wrong and the Marxists were a hundred times right in their estimation of the situation.\nThe fundamental problem of all the union leaders, even the best of them, is that they imagine it is possible to achieve their aims on the basis of the capitalist system. This false perspective prevents them from seeing the revolutionary potential and capacity to struggle of the working class. They do not understand that real reforms, insofar as they are still possible, are the by-product of the revolutionary struggle for the transformation of society. From a false perspective and policy flows a false strategy and tactics. From this, in turn, eventually comes organisational flabbiness, and ineptitude.\nThe inability of the CCOO leaders, with all their resources, to organise serious actions of the workers was a shocking revelation to the comrades. This was already revealed on Wednesday 4 February, when a large number of agricultural workers who had come to Madrid, staged a demonstration in the capital, which the CCOO were supposed to organise. The SE were asked to support this, and did so, but had no hand in its organisation. The result was extremely poor, with only a few thousand turning out.\nThe lack of a serious lead from the top, however, was amply made up by the magnificent movement of the workers from below. In the best traditions of the Spanish working class, the workers moved spontaneously all over Spain on the week of 9-13 February. At long last, the school students, by their example, had broken the log-jam. The result was a movement of such proportions as had not been seen for ten years in Spain.\nOn the Monday and Tuesday, the Asturian miners staged a 48-hour strike against the government’s ‘restructuring plan’ involving thousands of sackings. At the other end of Spain, in the far south, the copper miners of the giant Rio Tinto complex in Huelva, staged a four-day strike, for similar reasons, sending 15 coaches to demonstrate outside the Andalusian Regional Parliament in Seville. The miners in Teruel, on Spain’s eastern frontier, struck against the imposition of a third shift and repressive actions of the management. Like the students, they staged roadblocks to halt the movement of lorries carrying coal. The agricultural labourers dispute was still simmering. The dockers struck for 24 hours. There were strikes at the Renault carworks and also the giant Seat car factories in Pamplona and Barcelona where the car workers staged a joint demonstration with the school students led by the SE.\nOnly now did the CCOO leaders make public their call for a ‘stepping up’ of labour conflicts in the month of March and began to talk about a “mobilisation of a general character”. At the same time, the long-standing tension between Nicholas Redondo, general secretary of the Socialist UGT, and the right-wing industry minister, Carlos Solchaga, exploded into a violent confrontation in the press and even on television. The militant language of the leaders of the CCOO, and the refusal of the UGT to accept the government’s five percent wage ceiling, were clear indications of the unbearable pressure building up from below.\nBut the centre-stage was still clearly occupied by the students, who gave voice to all the accumulated rage, bitterness and frustration felt by millions of workers.\nNevertheless, after such a long time the movement was beginning to fray at the edge. Nationally, the schools’ strike got off to a somewhat patchy beginning. In Madrid, the strike was soon solid, but the majorities in many of the assemblies were small. In many areas it was hard going at first, but gradually the ‘snowball effect’, already noticed on previous occasions, began to operate. New layers were drawn into struggle, notably the private schools, which were also hit by the private sector teachers’ strike. In some areas, the university students also joined in. Areas such as Guadalajara, with no history of militancy, exploded on the scene with a force which showed the enormous reserves of energy present in the youth. By midweek, amazingly the participation of students reached the highwater mark of three million.\nUnder the direction of the Union, the school students were again sent out in groups to the factories, marketplaces and workers’ districts to ask for money and support. This was conducted on a more systematic basis than on previous occasions. Everywhere the youth met with a sympathetic response from the workers.\nThe time was ripe for drawing the two wings of the movement together in joint action. The united demonstrations of workers and students called for the evening of Wednesday 11 February, had been organised at only a few days’ notice. To make things worse, the weather was appalling, with heavy rain even in Madrid. As the moment of truth drew nearer so the uncertainty grew. Would this be the Union’s first failure? All eyes were fixed on Madrid, the real storm centre of the movement. More than one comrade went out that evening with a sense of impending disaster.\nYet once again the doubters were proven wrong. First small groups of students and workers, standing on street corners, then, suddenly, the customary ‘human avalanche’ of young people carrying banners, shouting and chanting. Within minutes, the streets were filled to bursting, with up to 150,000 people, mainly school students, but with a fair admixture of workers of all ages.\nEven at this late stage, the sects had to strike a discordant note, attempting by a manoeuvre to split the demo in two. To no avail. The overwhelming mood was one of euphoria and militancy. Old people became rejuvenated, forgetting their years, carried away by the buoyant optimism and revolutionary elan of the youth that surrounded them.\nThe defence pickets, now veterans of the struggle, operated like clockwork under the discipline of their tried and tested Marxist leadership. Perfect order was maintained all along. No attempt was made to attack the demo. Yet once again the provocateurs were up to their dirty game, and once again the police connived to allow them sufficient scope for action.\nThe organisers of the demonstration had asked the authorities to keep the police away, as their very presence constituted a provocation. The defence pickets would be sufficient to keep order. And indeed this was the case.\nBut the commitment of the organisers was to maintain a peaceful demonstration, not to take on the police’s role of protecting the entire centre of Madrid. Cynically, the police reacted by withdrawing completely from the centre. So that when 300 or so provocateurs turned up outside the Ministry building before the demonstration reached the scene, they had the field to themselves. When the demonstration arrived the defence pickets confronted the handful of hooligans, and soon had them under control. But as soon as the organisers declared the demonstration to be at an end, the vandals had a field day, smashing windows and telephone boxes and overturning cars. Yet the police failed to appear on the scene until 35 minutes after the start of the riot. It was perfectly clear that this, like all the other times, was a put-up job. The next day the entire press gave massive coverage to the actions of a tiny handful of hooligans, and published not a single photograph of the biggest demonstration of workers and students for years.\nHaving pulled off a spectacular success on Wednesday evening, there remained only 24 hours to organise something far more difficult – the ‘March on Madrid’. It looked an impossible task. The news from the provinces was not particularly encouraging. The scenes of violence in Madrid meant that the pressure of parents on their children to stay away was now intense. There had been very little time to organise coaches and trains and raise the necessary cash. And would the students of Madrid be prepared to turn out in big numbers twice in less than 48 hours? The following 24 hours were a nerve-wracking experience for the Union leadership.\nThere was one bright spot, however. At long last, the unprincipled manoeuvrers of the ‘Coordinating Committee’ had apparently decided not to ‘convene’ somebody else's demonstration! “Better alone than bad company,” as the Spanish proverb goes. This time, at least, there could be absolutely no question of who had organised and led the movement. Of all the occasions the sects had mobilised in the name of the ‘Coordinating Committee’ they never succeeded in getting more than 45,000. Each time the SE called a demonstration, there had never been less than 100,000. The ‘March on Madrid’ was entirely the responsibility of the SE. But would it come off? More than one comrade was filled with apprehension.\nFriday 13 February, dawned a bright and sunny day. It also proved to be an historic day in the history of the Spanish student movement. The people of Madrid turned on their radios first thing in the morning and found themselves listening to what sounded like a football match commentary. The most popular radio stations were reporting the arrival of numerous coaches from all over Spain. In between interludes of rock music, they were giving a blow-by-blow account of the demonstration from the first moment to the last.\nThis time, the organisers were taking no chances. The SE and CCOO had already publicly denounced the Civil Governor of Madrid for what had occurred on Wednesday night. It was made perfectly clear that, while the Union accepted full responsibility for defending the demonstration and maintaining its peaceful character, no responsibility could be accepted for any actions which might take place outside its ranks. A record number of defence pickets had been organised – anything up to 3,000 young people. The level of discipline and organisation had reached an almost military level. These young men and women, with four mass demonstrations under their belt, now felt like veterans. Their swiftly acquired skills in the art of street fighting were to be demonstrated once again in the events which followed.\nThe demonstration proved to be an outstanding success – the crowning glory of the whole conflict. The school students of Madrid turned up in force, the second time in less than 48 hours. But everyone felt that there was a qualitative change in the situation. For the first time, school students from all over Spain were marching together under the same banners and slogans. The main banners were of the School Student's Union but the banners of the Marxist Tendency, Youth for Socialism and Nuevo Claridad were much in evidence. As for the sectarian and Stalinist splitters, they were nowhere to be seen, having done everyone a favour by staying away from the demonstration.\nThe 200,000 youth, who filled the streets of Madrid to overflowing, presented an impressive and colourful spectacle. The red and gold striped Catalan flags flew alongside the red, white and green of Extremadura, the white and blue banner of Galicia, the red, white and green ‘Union Jack-style’ Ikurriña of the Basque country, and even the purple flag of Castille. And on all sides, the red banner of the working class and the emblem of the Union. The slogans were in Galician, Catalan, and other languages. But they all said the same thing, demanding in one fraternal voice a future for youth.\nAn unexpected event at the start of the demonstration showed the way in which this movement had profound repercussions in the consciousness of the masses. A ‘squadron’ of about 300 youths on motorbikes suddenly swung into sight and placed themselves at the head of the demonstration. These were the messenger boys, working class youths who work for a pittance for firms, in dangerous conditions, with no rights and no insurance. They had turned up, on their own initiative, to demonstrate their solidarity. They led the way for approximately half the demonstration, chanting: “The messenger boys are also workers!” For the first time in their lives, this most oppressed and downtrodden section of the class felt the power of organisation and unity in struggle.\nThe demonstration proceeded on its way, chanting slogans, but with the utmost order, until it came to a halt outside the Workers’ Commissions building near Cibeles, in the centre. Here a 3,000-strong delegate conference of shop stewards was taking place. The organisers of the demonstration had invited them to participate, and to this end, Juan Ignacio Ramos was sent in to address the conference.\nThe pro-Moscow Stalinist faction insisted that a representative of the ‘Coordinating Committee’ should be allowed to speak first, which he did to lukewarm applause. But when Juan Ignacio was announced by the chair, the whole conference stood up to give him a standing ovation. His speech was interrupted five times by applause, and when, at the end, he called on delegates to join the demonstration, the conference rose, almost to a man, and came out onto the streets, where they were greeted with rapturous applause and chants of: “Workers and students, unite and go forward!”\nThe demonstration was now approaching the traditional flash-point, the corner of Cibeles and Alcala where it had to swing left to get to the Ministry of Education. This time the police were out in force, theoretically to disperse provocateurs and ‘guarantee’ the right to peaceful demonstration. But the organisers put no faith in their ability or willingness to do so.\nNoone knew what to expect. The head of the march was preceded by no fewer than five lines of pickets, so that if one line was broken, it could fall back to the second. The ‘iron ring’ which surrounded most of the demonstration was under strict order to hold together at all costs and let noone in or out. Nevertheless, the atmosphere of tension was palpable as the demonstration approached this dangerous junction.\nSuddenly, a large group of armed provocateurs burst from a side-street and began to run towards the police lines, hurling bricks and bottles, and then running towards the demonstration, attempting to break through the lines of defence. These held firm. But the police now began to advance. The danger of a bloody street battle was only too obvious.\nThe situation was saved by the quick wits and amazing courage of a group of pickets, who dashed forward to place themselves bodily between the police and the provocateurs. It took a great deal of nerve to stand in line between the two groups, with a shower of bricks coming from the front, and armed riot police standing at the ready behind.\nWith great determination, the organisers went up to the police and ordered them to withdraw, which they did. The pickets then laid into the provocateurs, disarming some, ‘persuading’ others and driving the rest up the same side-street from which they had come, which they then sealed off, permitting the demonstration to proceed on its way. Had it not been for the bravery and swiftness of these young pickets, the outcome could have been tragic. Once again, there is no doubt that the police were operating in cahoots with the provocateurs to break up the demonstration. I overheard a grim-faced CCOO delegate remark: “What we need here is some machine guns.” He was not joking. Incidentally one or two of the provocateurs were seen to be carrying pistols. This strongly points in the direction of police agents, a suspicion held by the Union from the very beginning: However, despite all their efforts, they failed to break up a single one of the mass demonstrations called by the Union. As an anecdotal footnote, Egin, the pro-Herri Batasuna daily alleged that: “The defence pickets prevented thousands of students [?] who were chanting ‘police murderers’ from joining in the battle. [?] Outside the Ministry gates, in addition to metal barriers, there was a double cordon of members of the defence pickets who protected the building.”\nOur nationalistic friends commit the minor mistake here of confusing revolution with counter-revolution. Nevertheless, it is correct that the defence pickets, with exemplary discipline, stayed in their places for at least one hour after the organisers had called upon the demonstration to disperse. Their purpose, of course, was not to defend the Ministry building, but to defend the demonstrators against the risk of a possible last minute attack by fascists or police, a phenomenon all too common at this stage in the proceedings. As a result, not one demonstrator was injured, although the provocateurs returned to the scene once the pickets were withdrawn, and amused themselves for a while, smashing up the centre of town, which provided the press with the ‘news’ they had been desperately looking for ever since the demonstration began. The next day, the papers were full of photos of masked youths throwing stones, but not a single one of the biggest youth demonstration in the history of Spain.\nOnce again negotiations\nThe week of action had been a tremendous success. The involvement of the workers was beginning in earnest. The ‘March on Madrid’ had ended the week with a bang. If the Union got no further concessions, the struggle would nevertheless have been worthwhile. The school students could go back to class with their heads held high.\nBut there was no doubt in the minds of the leadership that the last round of ammunition had now been used up. To call for a continuation of the struggle would now entail a very high risk. The symptoms of tiredness were very clear. The movement in the provinces was sagging. Thanks to the sabotage of Herri Batasuna, the Basque school students were demoralised and unfit for further action. It was true that new areas such as Guadalajara, near Madrid, were being drawn into the struggle. They had organised a meeting of 2,000 which enthusiastically acclaimed Juan Ignacio and organised a train to come to Madrid. But that was not the general position. Even in Madrid, the cracks were beginning to show.\nThe Ministry was playing on the divisions in the student movement, and also on the increasing worry of the parents. The hired press was now full of alarmist stories about violence, vandalism and hooliganism, to the exclusion of all else. The spread of the conflict to the private sector, especially the church schools, marked a sudden end to the relatively sympathetic coverage of the Catholic daily Ya, which went so far as to change its educational correspondent. After giving a bit of coverage to the Union after the previous demonstration (as a warning to the government), El Pais now reverted to type. The Union's access to the media was reduced to virtually nil.\nThe Union was given a warning that, either it began to negotiate ‘seriously’, or “the [Socialist] Party would swing all its forces into action against it.” This threat was not taken very seriously, as all the ‘forces’ of the PSOE, at this moment in time, did not amount to much, outside the tens of thousands of councillors, mayors, bureaucrats, and the like. But the government’s hold on the media was a serious weapon. There was also worrying news from parents’ associations where PSOE members were preparing a backlash. Had the strike continued a week or two more, there would have been an organised ‘back to school’ movement, orchestrated by the media, with the prospect of clashes between pupils and parents, with disastrous results.\nThe Union leadership therefore had no choice but to issue an immediate call to all school students to return to class, regroup forces and await the result of further negotiations. This call was supported with virtual unanimity throughout the country. Some went back in sorrow, others with relief. But the Union's message was clear and uncompromising. “We came out together. We will go back together, and if necessary, we will come out together again. But at all costs, the unity, won in struggle, must be preserved.”\nThe return to the negotiating table was accomplished with misgivings. The right wing appeared to be rampant within the government. There was no indication of any major new concessions. Yet some way out of the impasse was now necessary. It was better to accept a partial victory than to go back, after two and a half months, empty handed.\nMeanwhile, the ‘Coordinating Committee’ was in a state of absolute crisis. After its adventurist antics a week earlier, the government decided to take a tough line. Using the extremely heterogeneous nature of this ‘movement’, they effectively manoeuvred to provoke a split.\nThe provocative actions of the sects provided them with an excellent excuse. The Ministry announced that they would refuse to negotiate with any member of the ‘Coordinating Committee’ who refused to renounce violence. Initially the lunatic fringe who controlled the Madrid ‘Coordinating Committee’ took this as a huge compliment to their ‘r-r-revolutionary’ tactics. They even tried to put pressure on the Union to refuse to participate in any negotiations of which they did not form part. The reply of the Union, while condemning police brutality and the splitting tactics of the Ministry, put the ball firmly back into the other court. The Union had opposed the adventurist demonstrations called by the sects, and had no intention of accepting any responsibility for them.\nThe sects were now in an impossible position. The first ‘national meeting’ of these groups, as will be recalled, ended in a punch-up. The second such meeting was a notable improvement on the first… chairs were now also brought into play! The Young Socialists evidently ‘pulled a fast one’, bussing in their supporters from the rest of Spain and electing a new ‘national’ negotiating committee. While their methods were suspect, formally they had a point. By what right did the Madrid ‘Coordinating Committee’ speak in the name of all the other such bodies in the rest of Spain? The logic was impeccable, the voting rather unfair. And the tables and chairs which flew round the room provided a marvellous ‘coordinated’ finale to the proceedings.\nThe following week saw a new lineup around the negotiating table. Three organisations were now present: the Union, whose credentials were no longer questioned by anyone; the Young Socialists under the title CEAE; and the Young Socialists under the title of the so-called ‘National Coordinating Committee’, whose representative, David Balsa, had to be accompanied to the Ministry by a group of heavies who turned out to be PSOE bodyguards! Not a bad idea, since his erstwhile ‘coordinating’ comrades staged a sit-in outside the Ministry doors which physically prevented him from entering for several hours, until he finally gained admittance – by the tradesman's entrance, leaving the sects out in the cold.\nAll this did not bode well for the outcome of the negotiations. The Ministry insisted on meeting all the ‘representatives’ of the students together, which meant that the Union would be in a minority, with the Ministry's yes-men on either side.\nNevertheless, the Union's representatives decided to take a tough line in the negotiations. Seizing on a sensitive spot, they warned the government that either they come across with a good offer, or Felipe Gonzalez, due to deliver his ‘state of the nation’ speech in a few days’ time, would be giving the most ‘interesting’ speech for many years! In a nervous tone, the Ministry's spokesmen assured the Union that “90 percent of your demands will be met.”\nSuch assurances were viewed with scepticism at the tops of the Union. The comrades were prepared, however, to give a good account of themselves, and ‘go down fighting’ if necessary. To this end, a list of new points was added to the negotiating platform, mainly with reference to apprenticeships, school democracy and technical school education.\nOn Tuesday 17 February, the details of the Ministry's new proposals were received at the Union’s headquarters. When the contents became known, the Union leaders had to rub their eyes in disbelief. The Ministry was proposing a package of measures involving the expenditure of an extra 40 billion pesetas in the Education Budget for the present academic year. For the first time in Spanish history, secondary education in all state schools was to be free. In addition, children from working-class and lower middle-class families would, for the first time, enjoy free university education. 67,840 new school places would be created, at a cost of 30 billion pesetas. Grants would be increased by 25 percent in 1987 and 40 percent in 1988. There would be a 30 percent increase in the money set aside for school’s running costs. In short, the government had done a complete about-turn and was now offering major concessions. The students had won!\nThere was jubilation in the headquarters of the Union when the news came through. But there were still a number of hurdles to clear. In the first place, nothing was settled until the Minister put his pen to paper. In the second place, there was a prior condition for the Union – not just to sign, but even to begin to negotiate. That was the demand for no victimisation of any student who had participated in the movement, either by expulsion, suspension, or loss of marks. All exams which had been suspended must be held. These demands were particularly important for the Union in the Basque Country, where a number of students had been sanctioned, or threatened with sanctions by reactionary headmasters. The problem was a difficult one, because, legally, the Madrid government did not control education in the Basque Country. It was in the hands of the Basque Autonomous Government, which was controlled by the bourgeois nationalist party, the PNV. To make matters worse, the political crisis in the Basque Country, meant that no government had been formed after the regional elections, so the entire administration was effectively paralysed.\nNevertheless, it was essential for the national Union to make a stand on this issue. The radical nationalists argued all along that this was a “Spanish strike” led by a “Spanish Union”, and had nothing to do with the Basque youth. The Union had to publicly demonstrate its solidarity with the oppressed nationalities. There was no question of signing a deal which would leave their Basque and Catalan brothers and sisters out in the cold. The negotiating team was therefore determined to make a principled stand on this issue. The Marxist Tendency in the Basque Country was engaged in a counter-offensive to answer all the lies and slanders of Herri Batasuna. A public gesture was needed to back them up.\nWhen the negotiations reopened on the Wednesday, therefore, Juan Ignacio immediately pre-empted the Minister by placing the issue of ‘no sanctions’ on the table. Brushing aside all legal niceties, the Union insisted that the Madrid government must intervene to ensure this point was respected by all the implicated parties. If the Ministry could liaise with the autonomous governments, as it had done, to coordinate a policy to defeat the strike, it could also put pressure on the others to fall back in line on a policy of ‘no sanctions’. After a brief discussion, this point was accepted. The Ministry agreed to send out a circular to all schools, advising them not to proceed with disciplinary actions, and to persuade the autonomous government to do the same.\nBut then came the big surprise. Having already published the terms of its ‘final offer’ in the press, the Minister now made a statement to the effect that he was not prepared to sign anything!\nThis remark fell like a bombshell. This was certainly not anticipated! Why on earth should the government refuse to sign its own agreement? The Minister, in effect, had summoned together a ‘negotiating committee’, to deliver what was intended to be an ultimatum: “Accept or else!” These declarations caused uproar. Juan Ignacio banged the table, shouted that the government had taken them for a ride, and accused the Minister of acting in bad faith. After a heated exchange, with the two ‘other parties’ looking on like frightened rabbits, the Union representatives demanded a recess and pulled the other two groups out by the ears into a side-room, where the riot act was read. The manoeuvre was blatantly obvious: to prevent the Union at all costs from getting the credit for having won the agreement, to stage a provocation which would lead to the Union breaking off negotiations, and thereafter to sign a deal with these two stooge organisations. The latter were put under heavy pressure; there was no question of going away without a deal being signed. Terrified of being exposed before the mass of the students, the other two groups fell into line. The students went back into the meeting with an outwardly united front. United, at least up to a point!\nLooking back on the whole affair now, it was all a kind of ‘comedy of errors’. From the declarations of Maravall the following day, it was quite clear that the government was convinced that the Union would refuse to sign. However crazy that looked to the other side, it had a logic of its own. Every time the Union had sat down to negotiate, and the government made what seemed to it a ‘reasonable’ offer, the result was a new general strike and new demonstrations. Why should this time be any different? In other words, the government made the fatal mistake of confusing a genuine Marxist revolutionary leadership with brainless ultra-leftism. They really believed that the Union was only ‘going through the motions’ of negotiating, as an excuse to organise general strikes. Yet, at each stage in the movement, the Marxists had striven to defend the students’ interests, first and foremost. Now that it was clear that the movement had reached its limits and that no more could be squeezed from the government, nobody was keener to reach a settlement than the Union. Yet nobody was more astonished than the Ministry at this fact! This was, of course, no accident. Negotiations are meaningless, unless backed up with the threat of mass action. So convincing was this threat on the lips of the Union negotiators, that it kept the government on tenterhooks till the very last moment. Time and again for two and a half months, the Union demonstrated in practice that its threats were no idle boasts. It won its authority in the eyes of all classes, not by speechifying, but in action. Now, the willingness of the Union to reach an agreement was met with perplexity by the Minister, who was quoted as saying: “What has astonished us has been the willingness of the Students' Union to negotiate. They seemed to be delighted to sign an agreement.” (Ya, 19 February, 1987)\nBut who would not be ‘delighted’ to sign a deal which represented a clear and unambiguous victory for the students, and an historic advance for the cause of public education in Spain?\nTo ensure the carrying out of all its clauses, three parity committees were established (this was also something without precedent); the first and most important – to oversee the implementation of the deal; the second to work out a general reform of the system of selectivity; and a third to work out a charter of rights for school students – to increase the democratic rights and participation of students in the running of their schools and colleges. On signing the agreement, Maravall attempted to put a brave face on it, claiming that there were “neither victors nor vanquished” and that these were points which the government had intended to implement all along! The more cynical asked themselves: why then, had the government waited two and a half months, with all hell let loose, before doing so?\nIf the Minister’s intention was to evoke a similarly diplomatic response from the Union, he was doomed to disappointment. Surrounded by journalists on the Ministry steps, Juan Ignacio Ramos exclaimed: “This is a historic victory, and the result of a long and exemplary struggle. We have won most of our demands, and now is the moment to consolidate our gains, go back and organise and prepare for the next round when we will win all the rest. The struggle will be a long one and will continue. But we have shown that we students are conscious people who know how to conduct a struggle in an organised manner. We have beaten the Ministry in the first round by a knockout. From now on, nothing will be the same in this country.”\nSubsequent events have shown these remarks to be prophetic. The victory of the school students had an electrifying effect on the consciousness of the workers, opening the floodgates to a sweeping wave of strikes.\nEven so, the Union leaders were at pains to stress the deal signed on 18 February was only a preliminary agreement. To the very end, they scrupulously respected the democratic norms of the movement. What was signed would have to be ratified by the rank-and-file at every level of the Union and in the assemblies of the schools over the following week\nA national delegate meeting of the Union was quickly summoned and unanimously voted for acceptance. And in mass meetings held in the schools, an overwhelming majority approved the actions of the negotiating commission.\nThe ‘Coordinating Committees’ rapidly disintegrated in a welter of mutual recrimination and whines about ‘betrayal’ which naturally fell on deaf ears. These pernicious elements, who played a ruinous role from start to finish, left the scene, not with a bang, but a whimper. They gained nothing and lost whatever credibility they might once have had amongst the school students. Both the YS and the YCL ended up in crisis – with splits, expulsions and resignations. One Socialist councillor in Leon resigned in protest at the government’s handling of the student dispute. That was only the tip of the iceberg of a general crisis affecting all organisations – all except one, that is – the SE and the Marxist Tendency, the only ones to emerge with credit from the dispute.\nSince the end of the conflict, the social and political landscape in Spain has been transformed. Every group of workers sought to emulate the school students, a fact which has been commented on by the government itself.\nThe miners’ strike, the events of Reinosa, the widespread call for a general strike, the growing split between the government and the UGT, are all indications that Spain has now entered into a new and turbulent period. To the Spanish Marxist Tendency and the School Students’ Union belongs the honour of having opened up this period, setting the tone, establishing the traditions and posing the great questions of our time, which the workers, once they are armed with the programme of genuine Marxism, are destined to answer.\nAppendix: “An Open Letter to Mr Maravall”\nBy Juan Ignacio Ramos\nFrom El Pais, 25 January, 1987\nMr Minister,\nBy this time I imagine that you have at your disposal all the relevant information concerning the mobilisations of the past week. I say “I imagine”, because I have not had the opportunity to speak to you in person, despite having attempted once again to open negotiations with the Ministry, of which you are the head, immediately after the demonstration of 200,000 which passed beneath the window of your office last Friday.\nI address myself to you through the medium of these pages, because ever since we began negotiations with the Ministry, one and a half months ago, at no time have you ever deigned to come down and speak to the negotiating commission. Probably you had more important things to do than to attend to the demands of two and a half million students.\nSerious situation\nBut, as you see, things have really turned serious now. You will recall that in France a student had to die before the Chirac Government attended to the demands of our French comrades.\nNow, the French Government is a right-wing government, but you are a socialist and a member of a government elected with the vote of 10 million workers and young people. It would therefore seem reasonable that we should expect something different from you.\nThe Students’ Union, which organised the demonstrations and struggles of the 4th and 17th of December of last year, and the 20th-23rd of January, has spared no effort to avoid violence and lend the struggle an organised and disciplined character. We have the defence pickets of 2,000 young people who guaranteed the peaceful character of our demonstration in Madrid. Nevertheless, despite all our efforts, a young girl, 14 years of age, was seriously wounded by the bullets of the police who, for highly obscure reasons, refused to dissolve the fascist provocateurs, yet charged brutally against the demonstration. Fortunately, at this moment of writing, it seems that our comrade’s life is not in danger.\nBut the responsibility for this tragedy must be placed at the door – on the one hand, of yourself, Mr Maravall, who, by your intransigence, have brought a conflict to this extreme – and, on the other hand, of the repressive policies in the field of public order identified with your colleague, Jose Barrionuevo, which are increasingly reminiscent of the bad old days of the Franco dictatorship. This is not a question of the suspension of three policemen, but of the general tendencies of a government which has lost all contact with the people in general, and the youth in particular.\nOne has the feeling that this government is suffering from an obsessive concern to satisfy the interests of a tiny privileged minority, the so-called powers that be, and cares not one jot for the opinions of the majority of workers and young people.\nWe have the scandalous fact that, after four years of Socialist government, the arms bill is still bigger than the budget for education and culture taken together, and that the profits of the banks have doubled from 102,500 million pesetas in 1982, to 203,328 million pesetas in 1985. On the other hand, we have the shameful declaration of a representative of a Socialist government who publicly advocates 30,000 sackings in Hunosa (state-owned coal industry in Asturias) and Altos Hornos de Vizcaya (Basque steel factory).\nYou will ask why young people have taken to the streets but you do not require a diploma in sociology to know the answer. The Socialist Party promised us the creation of 800,000 jobs. Yet now the level of unemployment has passed the three million mark, and of these half are young people between 16 and 25 years of age.\nThreatened with the humiliation of a life of enforced inactivity, a section of the youth have made a serious effort to improve their studies in order to have a better chance to find work. But with the restrictions and obstacles placed in the way of those who seek to enter university, the last gateway to hope has been slammed shut.\nAny society that condemns millions of young people to a life without hope, is sitting on a powderkeg.\nThe discontent of the youth is palpable. The only thing which the Students’ Union has done is to give this discontent an organised and conscious expression. Without the Union, the movement would have dissipated itself in a series of local strikes with neither perspectives nor coordination, and therefore, condemned to defeat, as has always happened in the past.\nSteam is a powerful thing, but it only serves a useful purpose when it is concentrated by means of a piston-box. The Union has made it possible for all the students throughout the country to strike together on the same day, at the same time, for the same demands.\nI am telling you all this, Mr Maravall, in case you happen to think that maybe, by means of delaying tactics, things might calm down, and the young people might get tired of fighting and go home again. This is not the same old spontaneous student ‘outburst’, as some have tried to maintain. This is something new. A movement led by a stable organisation, with clear ideas, ready to pursue the struggle to the very end, with the aim of conquering our just demands.\nMr Maravall, the present course of the government can only lead to disaster. There is still time to change course. But it is necessary that you and your comrades begin once and for all, to listen to the voice of the majority. Is it really necessary that some innocent young person should lose his or her life before you desist from your arrogant position and begin to defend the interests of the people who voted for you?\nGlossary\nAbertzales: Popular name for radical Basque nationalists.\nCCOO: Workers’ Commissions, a trade union federation led by Marcelino Camacho and dominated by the various split-offs from the Communist Party.\nCEAE: State Confederation of Student Associations, a ‘paper’ school students’ organisation led by JJ.SS.\nCortes: The Spanish parliament\nEgin: Basque daily paper which supports Herri Batasuna.\nETA: Basque nationalist terrorist group.\nHerri Batasuna: radical Basque nationalist party.\nJarrai: Herri Batasuna’s youth wing.\nJJ.SS: Young Socialists, the official PSOE youth section.\nJPS: Youth for Socialism, an organisation founded by Nuevo Claridad supporters who were expelled from the JJ.SS. Committed to eventually rebuilding JJ.SS as a mass socialist youth movement.\nMCE: Communist Movement, an ex-Maoist sect.\nNuevo Claridad: Marxist paper founded in 1976, some of whose supporters have been expelled from the JJ.SS, PSOE and UGT at various times since then.\nPCE: Spanish Communist Party, ‘Euro-Communists’ led by Gerardo Iglesias from which other Stalinist groupings have split.\nPopular Alliance, Young Generation: The youth group of the main bourgeois party.\nPSUC: Catalan Communist Party.\nPSOE: Spanish Socialist Workers’ Party, led by Felipe Gonzalez and in government since 1982, reelected in June 1986.\nSE: School Students’ Union founded by Nuevo Claridad supporters.\nUGT: General Workers’ Union, a trade union federation led by Nicolas Redondo and associated with the PSOE.\nUJC: Union of Young Communists, the PCE youth section.",
  "word_count": 34920,
  "scraped_at": "2026-02-14T12:09:48.753599"
}