{
  "article_id": "332eaf76fcfd",
  "url": "https://www.nytimes.com/athletic/6404831/2025/06/11/dazn-club-world-cup-billion/",
  "title": "DAZN will broadcast the Club World Cup around the world . What is the streamer big idea ? ",
  "date": "20250611T060000Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Athletic has live coverage of the 2025 FIFA Club World Cup.\nSix months before the planned start of the Club World Cup came word that FIFA had finally found the grease to make its new wheels turn. A global broadcast partner had been secured and in its hands was the billion dollars that could be repurposed as a prize pot to demand the attention of the 32 competing teams.\nAdvertisement\nFIFA called it a “landmark agreement”, the first of its kind. All 63 games in its expanded now-summer club competition would be made available free, with the body’s president Gianni Infantino calling it the “most widely accessible club football tournament ever”.\nThe partner selected to make it all happen, though, raised eyebrows.\nDAZN might consider itself the only global sports streaming platform, dubbed the ‘Netflix of Sport’, but it was not a headline name for FIFA to have picked. In the United States and the United Kingdom, where it was founded in 2015, DAZN remains best known for boxing’s big nights and pay-per-view events. In other parts of the world, including South America and Africa, it is unfamiliar to millions.\nAll that is set to change in what DAZN’s chief executive, Shay Segev, has predicted will be a “transformational” year for the company. New audiences can be targeted and untapped markets explored. Or so goes the justification in giving FIFA $1billion (£736m) to screen a tournament of unknowns that will be over 29 days after it begins this weekend.\n“We think it is good value for money,” DAZN’s chief executive of growth markets, Pete Oliver, tells The Athletic at the company’s headquarters in central London.”It’s hard to know how big the Club World Cup will be, but we can see from the data already that it’s not going to be small. It’ll be big, it’s just a question of how big.”\nDAZN, like FIFA, needs this new competition to work. It is among the biggest plays in its relatively short history as an ambitious broadcaster and a roll of the dice designed to increase its footprint around the globe. It is part broadcast deal, part promotional campaign.\n“We don’t see it as a risk, we see it as a very big opportunity,” adds Oliver. “We think it will reposition the company quite significantly worldwide.”\nAdvertisement\nFollow the Club World Cup on The Athletic this summer…\n- Club World Cup team guides, news and analysis\n- How will the tournament work?\n- Could it stretch Messi and other stars to breaking point?\nDAZN — it’s pronounced ‘da zone’, for the uninitiated — has been a company of curiosity within the media industry since the platform was formed in 2015 as a product of Perform Group.\nOwned and funded by Sir Len Blavatnik’s Access Industries Group, its plans have always been grand, to the point of eventually redesigning the sports broadcast landscape. DAZN does not hide its prediction that live sport will eventually come to viewers through dedicated digital platforms, following trends set by the music industry.\nIt is why DAZN regards itself primarily as a tech company but, within the industry that it wants to dramatically alter, plenty point to accumulated losses in chasing that vision.\nThe group’s most recent set of accounts, published in January, detailed funding commitments of $6.7billion from Blavatnik since DAZN’s inception. There was $1.4bn lost in 2023 alone.\nThe stark balance sheet deficits are a result of continued expansion in the costly world of football. As well as hoovering up domestic rights deals in major European territories, partnering with Serie A in Italy, Bundesliga in Germany and La Liga in Spain, DAZN had been the home of the women’s UEFA Champions League until the arrival of Disney+ into the marketplace last month. Rights costs in 2023 ($3.1billion) exceeded the company’s annual turnover, which had at least grown to $2.9bn.\nBlavatnik can wear the losses better than most. The Ukraine-born British-American businessman in control of DAZN had his wealth estimated to be $26.5billion by Forbes this year and is prepared to widen the company’s frontiers.\nThree days before Christmas — and a matter of weeks after FIFA announced the Club World Cup deal — DAZN announced it had agreed to buy Australia’s Foxtel Group from Rupert Murdoch’s News Corp for $2.2billion.\nIt was inward investment, though, that created greater headlines a month later.\nAdvertisement\nSURJ Sports Investment, controlled by Saudi Arabia’s Public Investment Fund (PIF), bought a minority stake, said to be in single digits in terms of percentage, in DAZN for a reported $1billion to strengthen relations between the two.\nRights for LIV Golf, football’s Saudi Pro League and the various sports under the Riyadh Season banner had already been bought by DAZN, but it was the timing of that $1billion investment, the same figure that would go to FIFA for the Club World Cup, that drew scepticism. A financial, mutually beneficial triangle can be drawn without any assistance between FIFA, Saudi Arabia — which was announced in December as host of the 2034 men’s World Cup — and DAZN.\n“The Club World Cup deal was done in December, Saudi investment came in February,” explains Oliver, who says negotiations with FIFA spanned between six and nine months. “At the same time, we also bought Foxtel in Australia for $2billion.\n“There were various things happening in the group. The Saudi investment was for plans in the MENA (Middle East and North Africa) region, and the Club World Cup was a separate decision reached last year.”\nIs the cynicism unfair? “I think it is,” he adds. “We’ve got a primary investor, Access Industries, which has funded the business with significantly more money than we’ve had from PIF. Multiple billions. We’ve had $1billion from PIF, but that’s to launch in Saudi.”\nFIFA, regardless, was grateful DAZN’s money came when it did. There had long been talk of Apple stepping up to become a streaming partner for the Club World Cup, but there was a reluctance within the industry to back a competition with neither heritage nor guarantees of engagement. Infantino went as far as calling a briefing with global TV executives last September in an attempt to drum up interest.\n“The money they’ve had to cough up for the Club World Cup is astonishing,” says Paolo Pescatore, a media and telecoms analyst with over 30 years of experience.\nAdvertisement\n“This is about DAZN putting a marker in the ground and saying, ‘We want the mantle of being the global streamer of sports, and we’re in a position to do it’. They’ll see this as the tournament where they can do it, but, equally, there’s a lot of hope in play here.”\nThis, too, is a first for FIFA. The men’s World Cup, the governing body’s greatest asset, continues to see rights sold region by region, but a club event lacking the prestige and history of the UEFA Champions League was instead bundled up and sold off as one.\n“There was nobody but DAZN, so they made a beautiful story of it with this $1billion to calm the clubs,” says Pierre Maes, a published author on the sale of sport TV rights. “It’s very convenient for FIFA. They sell to a broadcaster, who can broadcast the property in all of the countries but also, the broadcaster can act as an agency and sell the rights on to broadcasters.\n“DAZN solved a big headache for FIFA, but this property has a lot to prove. This feels to me like an opportunity for DAZN rather than a big strategic move.”\nDAZN has hedged its bets and opted against going it alone at the Club World Cup. Baked into the agreement with FIFA was the power to sublicense to regional markets, clawing back some of the initial investment. Deals have been struck with TNT in the U.S. and Channel 5 in the UK, ensuring a sizeable chunk of coverage will be shared with others. Channel 5, for example, will show the final and at least one semi-final among its broadcasts of the tournament.\nOliver says “hundreds of millions (of dollars)” have been recouped in that sublicensing process. “That brings in revenue but also helps promote the tournament,” he says.\nSluggish ticket sales in the U.S. would indicate promotion might be needed, but DAZN maintains that interest will not need to be manufactured. It sees the plot lines developing around Real Madrid, who will be led by new coach Xabi Alonso for the first time and include Trent Alexander-Arnold in their ranks, and the fiercely-supported clubs taking part, including Egypt’s Al Ahly and the Argentine pairing of River Plate and Boca Juniors.\n“We think the audiences for this will be very big — tens of millions, if not hundreds of millions,” says Oliver. “We think over 100 million people will watch the Club World Cup, and we believe we can drive a lot of ad revenue. You’ll see big sponsors and big advertisers on the feeds worldwide.”\nAdvertisement\nAll 63 games of the Club World Cup will be available through DAZN’s app, which is free to anyone who enters an email address and becomes a registered user. Paid subscribers (£24.99 a month in the UK, $19.99 in the U.S.) will see an uplift on their coverage, with improved picture and sound quality, while part of FIFA’s arrangement is the incorporation of the body’s in-house FIFA+ platform and all the content that it offers.\nA nagging question is DAZN’s ability to cope with a new scale of demand on its platform this summer.\nMajor problems were encountered during the screening of Serie A games in 2021 and 2022, with viewers seeing feeds buffer and cut out. That brought criticisms from the Italian government and apologies from DAZN, which has not been alone in finding streaming issues for the most in-demand events. Netflix’s broadcast of the Jake Paul versus Mike Tyson exhibition boxing match in November was overshadowed by technical problems during the 65million concurrent streams. DAZN, though, has confidence in its platform bearing the weight of its biggest numbers.\n“We’ve built a new version of our platform specifically for the Club World Cup for free customers, and we’ve simulated 300million people watching at the same time,” says Oliver.\n“We’ve made big investments in infrastructure to be ready for this. You never say never in the world of technology but we’re pretty confident. We’ve built the platform, but also we’re providing commentary in 17 different languages, because we’re doing it globally. It’s on a scale that no one else in sport has done before.”\nDAZN is nothing if not aspirational. In a company update from this January, Segev promised that DAZN was “only getting started” and that “ambitions are bigger than ever” in 2025. Forecast revenues have been set at $6billion for this year, doubling from 2023.\nThen there is the long-term target, said out loud, to reach a billion global users within the next decade — or, put another way, one in every eight people currently on the planet using DAZN on some level. Spotify, for some context, says it has close to 600million users.\nAdvertisement\nIt is the scale of DAZN’s plans, coupled with the heavy ongoing losses subsidised by Blavatnik, that is known to evoke the rolling of eyes.\n“In our business, we have a lot of people looking at DAZN and asking themselves, ‘What the f*** are they doing?’,” says Maes. “It’s impossible to lose so much money. In the meantime, they are growing into one of the biggest companies in the UK.\n“For the people who are trying to sell television rights, DAZN is an opportunity and a danger at the same time. It is an opportunity because in Europe today, it’s the only ambitious sports-rights buyer. It’s as simple as that. They’re the only ones left. But it’s a danger because these people have nearly $7billion of accumulated losses. Their future depends on the will of one man (Blavatnik) to put more money in.”\nDAZN is not afraid to admit that football has to be central to its long-term growth. Eighty per cent of the app’s viewing figures, it says, come from showing live matches.\nIt is why it will remain a domestic partner of Italy’s Serie A until at least 2029 and why it extended its arrangement with Germany’s Bundesliga until the same point. DAZN also struck a five-year deal as a local provider for La Liga matches in Spain in 2022. Less harmonious was the arrangement with France’s Ligue 1, severed inside a year, but other domestic partnerships can be found in Japan and Belgium.\nThose territories are where a substantial portion of DAZN’s 20 million paid-for subscribers can be found. The Premier League, except for the rights to televise its games in Spain and Portugal, has eluded it.\nAside from the proposed acquisition of BT Sport in 2022, which would later be sold to Warner Bros Discovery and rebadged as TNT Sport, there has been little prospect of televising Premier League matches in the UK and breaking Sky’s stranglehold. The fifth-tier National League is the only long-standing partner of DAZN in English football.\nAdvertisement\nThere are other key properties, including the NFL’s Game Pass app in countries outside the United States, and a raft of boxing shows following link-ups with key promoters Golden Boy, Matchroom and Queensberry. The greatest challenge, however, is attracting and retaining subscribers.\n“At the beginning of 2024, DAZN was talking about reaching break-even,” says Francois Godard, senior media analyst of Enders Analysis. “That was the message. And then, this winter, it changed. They kept the message that they are doing better, but the main message was expansion. It shifted from a focus on break-even to a message of expansion.\n“There was the deal in Australia and then the deal with the Saudis. That is probably allowing them to do the deal for the Club World Cup, which will allow them to gain prominence in many other markets where they had a lower profile, like the U.S. That was a big change in emphasis.”\nSo, how significant do the Club World Cup’s global rights become to a project of this scale?\n“To them, it’s a publicity operation to reach out to people who have never heard of them,” Godard adds. “They want to become a global platform, which is very tough in sports. The rights are almost always (sold) country by country. The Club World Cup will be free-to-air and it’s a one-off.\n“DAZN is a subscription service, so it needs subscribers all year round. But arguably there can be an overlap in terms of reach, and many platforms have a free tier where registration is required. Then it becomes easier to pitch a subscription to these customers.”\nThat is undeniably part of the long-term strategy. The data of sports fans this summer will have enormous value to DAZN, an intangible byproduct of the $1billion investment. Forging the first links with FIFA will also carry benefits should the Club World Cup broadcast model be successful enough to be scaled-up at an event such as the 2034 World Cup, which is being hosted by, let us not forget, Saudi Arabia.\nDAZN will hope this is the start of something bigger with FIFA, but the path is not clear of competition. Netflix has already secured global rights for the Women’s World Cup in both 2027 and 2031, and Disney’s poaching of the UEFA Women’s Champions League from DAZN next season illustrates the continued willingness of streaming giants to explore live sport.\nAdvertisement\nDAZN likes to stress it remains the only dedicated global sport platform, and for all the industry reservations, it does not deviate from a strategy that will quicken with this summer’s Club World Cup.\n“We’re pretty clear on where we’re going,” says Oliver. “If you take a step back, you can see music has moved to a digital model. The sport industry hasn’t got there yet.\n“We’re building a platform for that. We view that as a tech company, like YouTube or Spotify. We’re building a platform.\n“If you go forward 10 or 20 years, way more sport will be delivered through a single platform on a global platform. You can see the traditional model in decline. No one else is building a dedicated sports app. We think the end-game is that we become the global home of sport.”\nThe Club World Cup, for better or for worse, will go a long way to shaping DAZN’s future.\n(Top photos: Getty Images; design: Kelsea Petersen)",
  "word_count": 2751,
  "scraped_at": "2026-02-14T12:35:16.126201"
}