{
  "article_id": "3359ffab432e",
  "url": "https://www.nbcnews.com/politics/trump-administration/live-blog/trump-texas-mace-dooley-tariffs-israel-gaza-immigration-live-updates-rcna222677/rcrd85837",
  "title": "Epstein victims blast Justice Department over lack of transparency",
  "date": "20250805T060000Z",
  "domain": "nbcnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Texas Republicans lash out at Democrats who fled state amid redistricting fight\nGOP lawmakers in Texas voted to approve civil arrest warrants targeting the dozens of Democrats who left the state to deny Republicans the quorum needed to move forward.\nWhat to know today\n- TEXAS REDISTRICTING FIGHT: The Texas state House briefly reconvened this afternoon amid a nationally watched clash over the GOP majority’s plan to redraw the state’s congressional lines. Republican lawmakers voted to approve civil arrest warrants targeting the dozens of Democrats who fled the state, blocking Republicans from proceeding with their plan.\n- E.U. TARIFFS: The European Union announced it will delay tariffs on U.S. goods by six months while both sides implement their trade agreement. The tariffs President Donald Trump placed on imports from countries around the world take effect this week.\n- INDIA TARIFFS: Trump said on Truth Social this morning that he plans to increase tariffs on India because of its purchases of Russian oil.\n- S.C. GOVERNOR'S RACE: GOP Rep. Nancy Mace announced a long-expected bid for governor of South Carolina, entering a crowded primary field.\nCoverage of this live blog has ended. For the latest news, click here.\nSen. Elissa Slotkin says it's time for Democrats to play 'offense' against Trump\nSen. Elissa Slotkin, D-Mich., said at a town hall tonight that Democrats need to come up with an \"economic war plan\" to counter Trump's agenda and \"not just constantly play defense.\"\nThe event in Benton Harbor — Slotkin's only town hall of the August congressional recess — was held before a supportive crowd of seniors and largely focused on Medicaid and Affordable Care Act cuts, the economy and the future of the Democratic Party.\nSlotkin warned that she was likely to oppose a government funding bill in September unless the legislation restored health benefits cut under Trump’s sweeping domestic policy law known as the Big, Beautiful Bill.\nIn an interview after the town hall, Slotkin said she thinks Democratic leaders are too old and out of touch.\nVoters \"want to see a new generation of leadership,\" she said, citing Zohran Mamdani's campaign as the Democratic nominee in the New York mayor's race.\n\"They don’t see themselves in, in elected leadership,\" Slotkin said of young voters. \"And that’s why some of the youngest members of elected leadership get a ton of energy and enthusiasm around them, because it’s like, oh, that person understands my issues. You know that person doesn’t use a flip phone, that person is like up, understands technology and the changing economy.\"\nPam Bondi orders grand jury probe of Obama administration review of 2016 election\nAttorney General Pam Bondi has directed Justice Department prosecutors to launch a grand jury investigation of whether Obama administration officials committed federal crimes when they assessed Russia’s actions during the 2016 election, a senior Trump administration official said.\nThe move comes after National Intelligence Director Tulsi Gabbard claimed at a White House news conference last month that top Obama administration officials carried out a “treasonous conspiracy” against Trump. Gabbard said she was sending criminal referrals to the Justice Department.\nA former senior Justice Department official condemned the move as “a dangerous political stunt.” And a former senior national security official pointed out that multiple past reviews, including ones conducted by Republicans, found no such crimes.\n“There’s no logical, rational basis for this,” said the official, who asked not to be named.\nMarjorie Taylor Greene urges Trump to commute George Santos' sentence\nRep. Marjorie Taylor Greene, R-Ga., said on social media tonight that she had sent a letter to the Justice Department urging Trump to commute the sentence of disgraced former Rep. George Santos, R-N.Y.\n“I wholeheartedly believe in justice and the rule of the law, and I understand the gravity of such actions,” Greene wrote in a letter to the pardon attorney's office that she posted on X. “However, I believe a seven-year sentence for such campaign-related matters of an individual with no prior criminal record extends far beyond what is warranted.”\nAsked in a Newsmax interview last week about a pardon, Trump said that Santos had \"lied like hell\" and that he was \"100% for Trump.\" Trump said he had not been asked to pardon Santos.\nSantos reported to prison last month to begin serving a seven-year sentence after he pleaded guilty last year to charges of wire fraud, identity theft and money laundering that prosecutors said were part of a yearslong scheme.\nSantos was first elected to Congress in 2022, flipping a House seat, and was expelled in late 2023.\nNebraska Republican discusses firing of BLS chief at town hall\nRep. Mike Flood, R-Neb., tonight discussed Trump’s firing of the head of the Bureau of Labor Statistics just hours after the release of a jobs report that showed a slowdown in hiring.\nFlood said he did not know the situation well and that “there’s always two sides to every story,” while noting he might have made a different decision than Trump.\n“If all that person did was get the data out there, if all that, and I don’t know that’s the case, but if that’s all they did, I would not have fired her,” Flood said of now-former commissioner Erika McEntarfer.\nSome Republican senators reacted to McEntarfer's dismissal Friday by saying they would oppose Trump's actions if she had overseen the release of accurate figures. The White House is now searching for a replacement.\nWhite House searches for a new BLS chief with ‘credibility’ and ‘experience’\nWhite House officials began the week scrambling to find a permanent replacement after Trump fired Bureau of Labor Statistics Commissioner Erika McEntarfer on Friday, following a weaker-than-expected July jobs report and drastic downward revisions of employment for the prior two months.\nSteve Bannon, a senior White House adviser in Trump’s first term who is influential with the MAGA wing of the GOP, is pushing hard for E.J. Antoni, the chief economist at the conservative Heritage Foundation. Antoni, a contributor to the Project 2025 policy rubric, has been a longtime skeptic of BLS data. On Bannon’s podcast last week, Antoni called for McEntarfer to be fired shortly before Trump pulled the trigger.\nIn an interview with NBC News this afternoon, Antoni said he had not been contacted by anyone in the White House about the job. West Wing officials were “still running traps” on candidates for the Senate-confirmed position Monday, one White House aide said.\nThe White House did not return a request for comment on whether Antoni is under consideration.\nNebraska congressman asked about Epstein files at town hall\nRep. Mike Flood, R-Neb., said he is in favor of releasing the Epstein files after being asked at a town hall about covering up their release.\n“Let’s be very clear. At the next pro forma session of the Congress, you’ll find my name as a sponsor and a resolution from the House Rules Committee to release the Epstein files to protect the victims and not re-victimize them again,” Flood said.\nFlood added that he supports Rep. James Comer, R-Ky., the chair of the House Oversight Committee, issuing a subpoena to Epstein’s co-conspirator Ghislaine Maxwell to testify before Congress.\n“I support Jamie Comer, who is the House’s Oversight Committee chairman, subpoenaing Ms. Maxwell later this month to come testify in Washington. I am for the release of those records,” Flood added.\nComer last week postponed Maxwell’s deposition until at least October to let the Supreme Court decide next month whether it will review her case. The deposition had been scheduled for Aug. 11 at a federal prison, not on Capitol Hill.\nGOP Rep. Mike Flood booed at town hall in Nebraska\nAudience members attending a town hall for Republican Rep. Mike Flood in Lincoln, Nebraska, tonight began booing and jeering Flood shortly after the event started.\nFlood kicked off the town hall by talking about Trump’s “Big Beautiful Bill,” focusing on health care implications for Nebraskans. When he told the crowd there is a work requirement to receive health care, many attendees booed him.\nThe crowd also chanted “tax the rich,” which Flood addressed. He argued that a Democratic plan to raise taxes on the high-income households would hurt businesses and employment. His response did little to quell backlash from audience members.\nThe Nebraska Democratic Party encouraged people to attend tonight’s event with Flood, who is no stranger to contentious town halls. He was grilled in May over his support for the House version of the “Big Beautiful Bill.”\nTrump administration bars trans women athletes from ‘extraordinary ability’ visas\nThe Department of Homeland Security will update visa policies to prevent transgender women from traveling to the United States to participate in elite women’s sporting events.\nU.S. Citizenship and Immigration Services issued guidance today intended to bar trans women athletes from obtaining “extraordinary ability” visas to compete in female sports, the conservative news website The Daily Wire first reported. The guidance builds on an executive order Trump issued during the early weeks of his second presidency that was intended to bar trans women from competing in female sports.\nThe guidance doesn’t use the word “transgender” or refer to trans women; rather, it refers to “male athletes” who seek to compete in women’s sports.\nMatthew Tragesser, a spokesperson for USCIS, said in a statement that the agency is “closing the loophole for foreign male athletes whose only chance at winning elite sports is to change their gender identity and leverage their biological advantages against women.”\nIndia calls Trump's threat of new tariffs 'unjustified and unreasonable'\nIndia responded to Trump’s announcement that he intends to raise tariffs on the country for purchasing oil from Russia, calling his move “unjustified and unreasonable.”\nIndia’s External Affairs Ministry said in a statement that the United States and Europe have unjustly targeted the country for importing Russian oil, arguing that it did so only because traditional oil supplies were diverted to Europe after Russia’s 2022 invasion of Ukraine. The statement went on to blast Europe and the United States for continuing to trade with Russia.\n“In this background, the targeting of India is unjustified and unreasonable. Like any major economy, India will take all necessary measures to safeguard its national interests and economic security,” the statement read.\nEpstein victims blast Justice Department over lack of transparency\nTwo victims of Jeffrey Epstein, the late convicted sex offender, ripped the federal government for appearing to be more concerned with protecting the financier's wealthy friends instead of them.\nThe government is “asking to release these transcripts, exhibits, etc., of which the victims are not privy to while they have concluded that there is nothing more to see on the files they hold. Yet no one has seen them, but them. I am beside myself,” said one victim, who sent a letter to the federal judge weighing the Justice Department's request to unseal grand jury testimony in cases involving Epstein and his accomplice, Ghislaine Maxwell.\nThe victim, who was not named, said, “I am not sure the highest priority here is the victims, justice for the victims or combatting child exploitation, or at least I do not feel this way.”\n“If there was justice for the victims we would see some kind of accountability for the years they allowed this horrible human being, if you can call him that, to prey on underage and young girls,” the victim said.\nIn a separate filing, a second Epstein victim wrote in a letter to the court and the U.S. government: “I am not some pawn in your political warfare. ... Why not be completely transparent? Show us all the files with only the necessary redactions! Be done with it and allow me/us to heal.”\nThe person called for victims' attorneys to be allowed to review any redactions.\nThe victim also slammed the Justice Department's recent questioning of Maxwell, who's serving a 20-year prison sentence. The government, the victim wrote, \"did not and does not even care to know our truth. They would rather ask a convicted imprisoned sex trafficker/abuser for information.”\nThe Justice Department declined comment.\nTrump ordered the Justice Department to seek the release of \"pertinent\" transcripts after a joint Justice Department/FBI memo released last month said that there was no evidence to charge other people and that no further information about the case would be released. The finding was met with furious backlash from Trump supporters, who had been assured there would be transparency in the case.\nSome swing district Republicans object to Texas redistricting plan as Democrats threaten to retaliate\nSome Republicans representing competitive districts in blue states are speaking out against their party’s push to redraw congressional lines in Texas in an attempt give the GOP up to five more House seats.\nReps. Kevin Kiley, R-Calif., and Mike Lawler, R-N.Y., have called to impose nationwide limits on partisan gerrymandering, a rare move for Republicans in Washington who have thwarted proposed bans for years.\nDemocratic governors like California’s Gavin Newsom and New York’s Kathy Hochul threaten to retaliate against Texas by pursuing their own redistricting plans that could knock out GOP-held swing districts, like those Lawler and Kiley represent.\nTexas Gov. Greg Abbott orders arrest of Democrats who left the state to stall GOP redistricting plans\nGov. Greg Abbott said today that he ordered the state's Department of Public Safety to arrest Texas House Democrats who left the state to stall GOP redistricting plans.\n“Texas House Democrats abandoned their duty to Texans,” he said in a statement. He said he had directed state authorities to find, arrest and return the Democrats to the House chamber.\n\"This order will remain in effect until all missing Democrat House members are accounted for and brought to the Texas Capitol,\" he added.\nThe Texas House today voted to compel the sergeant-at-arms to “send for” the return of the lawmakers “under warrant of arrest, if necessary.”\nTexas House Democratic Caucus Chair Gene Wu previously said about 57 Democrats had left the state. They have sought to disrupt efforts to redraw Texas' congressional lines.\nTexas House convenes but doesn't have a quorum to vote on redistricting map\nThe Texas House gaveled in to begin debate on the new redistricting map but found it did not have the quorum required to continue legislative business.\nHouse Speaker Dustin Burrows admonished the Democrats who fled the state as having “abandoned their post and turned their backs on the constituents they swore to represent.\n“They’ve shirked their responsibilities under the direction and pressure of out-of-state politicians and activists who don’t know the first thing about what’s right for Texas,” he said. “Leaving the state does not stop this House from doing its work. It only delays it.\"\nThe remaining lawmakers went through the motions, under House rules, of voting to compel the sergeant-at-arms to “send for” the absent lawmakers “under warrant of arrest, if necessary.” And Burrows gave lawmakers who did attend today's session permission to leave until tomorrow’s session.\nTexas AG Ken Paxton says Democrats who fled the state should be 'arrested, punished, and face the full force of the law'\nTexas Attorney General Ken Paxton, a Republican, said in a statement this afternoon that state Democratic legislators who fled the state overnight to block a GOP redistricting plan should face legal consequences.\nPaxton, a U.S. Senate candidate, said the lawmakers \"fled the state in a cowardly desertion of their responsibilities as elected officials.\"\n\"These jet-setting runaways abandoned Texas, abdicated their duties in the House, and sacrificed their constituents for a publicity stunt,” he said.\nHe continued: “I am prepared to do everything in my power to hold them accountable because these liberal lawmakers are not above the law. It’s imperative that they be swiftly arrested, punished, and face the full force of the law for turning their backs on the people of Texas.”\nRon DeSantis in the shadows as Florida Republicans toast Trump's team\nBy the time Susie Wiles took the stage here at the state Republican Party’s biggest event of the year, it was clear who the star of the show was — and, equally as important, who was not.\nWiles, Trump’s longtime adviser and his current chief of staff, was at the event to receive the party’s “Statesman of the Year” award, its highest honor.\nRedistricting clash escalates in Texas after Democrats scatter\nThe Texas House is reconvening this afternoon amid a nationally watched clash over the GOP majority’s plan to redraw the state’s congressional lines, with dozens of Democrats fleeing the state to deprive Republicans of the ability to proceed with the plan.\nThe bulk of the 50-plus Democrats who left the state are in Illinois, where they’ve been welcomed by Democratic Gov. JB Pritzker. Others are in Boston and in Albany, New York, where Democratic Gov. Kathy Hochul is pushing for a change to state law to allow redistricting in response in future years. Back in Texas, Republican Gov. Greg Abbott is threatening to boot them from office or send law enforcement to force them to return to the state.\nWhile the Texas House plans to consider the GOP plan Monday this afternoon, it cannot do so without a quorum — the presence of two-thirds of all state representatives. The rule means that 51 of the state’s 62 Democratic House members can, by remaining out of state, prevent the Republican-led House from moving forward with the legislation.\nWitkoff to brief Trump on Gaza today, then travel to Russia\nSpecial envoy Steve Witkoff is expected to brief Trump later today on the findings of his trip last week to the Gaza Strip, a White House official said.\nHe’s then expected to travel from Washington to Moscow, according to two White House officials. His exact arrival time in Russia is unclear; one of the officials told us he will be there midweek.\nTrum’s current operative deadline for Russia to reach a ceasefire with Ukraine and avoid “secondary tariffs” and possible sanctions is Friday.\nDLCC pushes for Democrats to pursue midcycle redistricting\nThe Democratic Legislative Campaign Committee is calling on Democrats to use their state legislative power to pursue midcycle redistricting efforts.\nThe announcement, which focuses on trying to win state legislatures, marks a rise in the strategy in the broader party as Republicans in Texas push to redraw the state’s congressional map, which prompted some Democratic governors to pursue similar measures.\n\"As Republicans rig the maps in Texas, the DLCC is armed with our national strategy to win the larger redistricting battle,\" DLCC President Heather Williams said in a statement.\n\"Looking at the state-by-state math, it is crystal clear Democrats must prioritize building and securing more state legislative majorities across the map if we want to go toe-to-toe with the GOP on redistricting now and in 2030,\" she added.\nJobs data revisions are common. Here’s how the process works.\nTrump fired the commissioner of the Bureau of Labor Statistics, claiming that last week’s jobs report “was rigged” without providing any evidence.\nBut former Labor Statistics officials say the commissioner typically doesn’t have a role in preparing the monthly jobs report.\nTrump is adding gold to Oval Office ceiling\nIt’s not just the Rose Garden and the Lincoln bathroom: Trump is overseeing some upgrades to the Oval Office, too, including adding gold to the ceiling, a White House official said.\nTrump has steadily added more gold flourishes to the office, which is undergoing annual maintenance, the official said. Scaffolding and tape were visible through the door to the office Friday. The updates are expected to take a week or two at the most, the official added.\nSeparately, the Rose Garden patio project is nearly complete, and Trump using the hardscaped area for events in the coming days. The White House also recently announced plans for a massive new ballroom.\nRep. Ro Khanna leads letter pushing for U.S. to recognize Palestinian statehood\nRep. Ro Khanna, D-Calf., is leading a letter calling on Trump and Secretary of State Marco Rubio to recognize the Palestinian territories as an independent state.\nThe move comes after leaders in the United Kingdom, Canada and France said they would seek recognition of a Palestinian state. The letter has a number of co-signatories in the House, all Democrats.\n“It has long been acknowledged by much of the international community and previous U.S. administrations of both major political parties that a Palestinian state recognized as a full and equal member of the community of nations is necessary to fulfill the legitimate national rights of the Palestinian people and ensure the state of Israel’s survival as the democratic homeland of the Jewish people,” the letter reads.\nIn addition to Khanna, Reps. Greg Casar, Lloyd Dogget, Al Green and Veronica Escobar, all of Texas; Maxwell Frost, of Florida; Jared Huffman, of California; Pramila Jayapal, of Washington; James McGovern, of Massachusetts; Chellie Pingree, of Maine; Mark Pocan, of Wisconsin; Nydia Velázquez, of New York; and Bonnie Watson Coleman, of New Jersey, have signed the letter.\nDespite the lawmakers' calls, there is little chance the administration will be compelled to take the step of recognizing an independent Palestinian state.\nGOP congressman to introduce ban on mid-decade redistricting\nRep. Kevin Kiley, R-Calif., announced that he plans to introduce legislation that would prohibit mid-decade redistricting nationwide.\nIf passed, the bill would nix new maps adopted by states before the 2030 census, but it’s unlikely that the House GOP leadership would bring the measure to the floor for a vote.\nKiley's move comes as Texas Republicans are attempting to redraw legislative maps in a way that is expected to benefit the GOP. Some Democratic governors have threatened to try to do the same in their states if Texas Republicans are successful.\nIn a statement, Kiley criticized the possibility of a new redistricting push in California. He said his bill would \"also stop a damaging redistricting war from breaking out across the country.\"\nHakeem Jeffries calls Texas Gov. Abbott a 'cowardly, fake bully'\nHouse Minority Leader Hakeem Jeffries, D-N.Y., denounced Texas GOP Gov. Greg Abbott for threatening to remove Democratic state lawmakers from office after they fled Texas in order to block Republicans from proceeding with a new congressional redistricting map.\n\"The Texas governor is a cowardly, fake bully. He was ordered by Donald Trump to convene a special session of the legislature in order to gerrymander the Texas congressional map and try to rig the midterm elections,\" Jeffries said in an interview on MSNBC's \"Ana Cabrera Reports.\"\nJeffries said Democrats will respond “forcefully, aggressively and relentlessly” to the GOP effort to impose a new congressional map that could add as many as five Republican seats.\nThe minority leader said Republicans are trying to enact a map that would protect their hold on the majority in Congress by taking five seats currently held by Democrats, \"including several in majority-minority communities around Austin, Houston, and Dallas, breaks them apart and tries to put them into Republican hands.\"\n\"We’re only three seats short from taking back the House,\" Jeffries said about next year's midterm elections. \"That is a historically close number. That is what has House Republicans and Donald Trump scared to death of what is going to happen in the midterm election. That’s why we’re seeing this extraordinary action in Texas.\"\nAsked if Democrats would respond to Abbott's threat to charge or arrest the Democratic state legislators who fled Texas yesterday, Jeffries said that would be immediately challenged in court.\nIn a separate interview on CNN, Jeffries also said Abbott is \"out of his mind\" and said that the Republican governor is making \"idle threats.\"\nThe governor's office didn't immediately respond to a request for comment.\nTrump again says he will 'substantially' raise tariff on India because it's purchasing Russian oil\nTrump said in a post on Truth Social this morning that he plans to increase the tariff the U.S. imposes on Indian goods because of the country's purchase of Russian oil.\n\"India is not only buying massive amounts of Russian Oil, they are then, for much of the Oil purchased, selling it on the Open Market for big profits,\" Trump wrote.\n\"They don’t care how many people in Ukraine are being killed by the Russian War Machine,\" the president said. \"Because of this, I will be substantially raising the Tariff paid by India to the USA. Thank you for your attention to this matter!!!\"\nThe president had already announced last week that imports from India would face a 25% tariff. He had also said at the time that there would be an additional penalty on India for its reliance on Russian oil and military equipment, though he didn't specify the amount.\nTexas legislators might travel to other states, lawmaker suggests\nTexas lawmakers in New York did not share many details about where they would travel next or how long some planned to stay.\nTexas state Rep. Mihaela Plesa said \"not all of us\" plan to stay in New York, and noted that her colleagues were continuing to talk with other governors\n\"We’re continuing to bring coalitions into the fold, and educating people as to what’s happening and letting them know that the rules have changed,” she said.\nHochul then chimed in, advising the Texas lawmakers not to say where they were traveling next.\nAsked if the lawmakers would travel the country, not necessarily staying in New York, Plesa said, \"This is a war. We are building a coalition.\"\nAlongside Texas Democrats, Hochul says 'we are at war'\nHochul made multiple references to war during her press conference alongside Texas Democratic lawmakers, rhetoric apparently intended to emphasize the urgency of her response to the redistricting fight in Texas.\n\"Here in New York, we will not stand on the sidelines with the timid souls on the sidelines who don’t care, will not invest their heart and soul into this battle,\" Hochul said. \"This is a war. We are at war, and that’s why the gloves are off, and I say, bring it on.\"\nLater, the governor said that democracy was \"under siege.\"\n\"For centuries we’ve stood up and fought,\" she added. \"Blood has been shed. This is our moment in 2025 to stand up for all that we hold dear and not let it be destroyed by a bunch of renegades in a place called Texas.\"\nTexas state Rep. Mihaela Plesa also referred to \"war\" when asked about the lawmakers' travel plans.\n\"This is a war. We are building a coalition,\" she said without disclosing where they were heading next.\nHochul lays out timeline for redistricting in New York\nAsked for details about how New York Democrats would try to change the state's congressional district map, Gov. Kathy Hochul said \"the only way that we can change the timing on redistricting is to literally amend the New York state Constitution.\"\nThe first step would be for lawmakers to take a vote on such a measure this year or next, she said. The measure could potentially go on the ballot in 2027 and be enacted by the 2028 elections, she said.\nHochul said she was also looking at litigation strategies.\nNo plans for Trump to use federal agents to arrest Texas Democrats in redistricting clash, admin says\nAccording to an administration official, there are no plans to use federal agents to arrest Texas lawmakers who have left the state to escape the jurisdiction of state troopers.\n“Gov. Greg Abbott can handle his own state,” the official said. The White House has been unusually silent about the Texas redistricting drama since Trump was asked about it last month.\nOn July 15, Trump said he’d like to redraw lines in several states besides Texas.\n“There's about four of them,” he said. “I'll let you figure that one out, but we have about four of them.”\nPart of the reason for the relative silence on the issue lately is that Senate Democrats are now asking the Office of Special Counsel to investigate whether White House officials have violated the Hatch Act, which bars federal employees from engaging in political activity while on duty or on federal property.\nNBC News reported last month that Trump held a call with Texas House Republicans where he talked up Abbott’s redistricting plans for the state, according to a GOP source on the call.\nE.U. delays U.S. tariffs for 6 months as trade deal takes shape\nThe European Union said this morning that it would delay its planned tariffs on U.S. goods by six months as both sides implement their framework trade agreement.\nThe E.U.'s countermeasures were set to go into effect Thursday. The United States' 15% tariffs on European goods, meanwhile, are set to go into effect this week as part of the governments' agreement.\nTaken together, the 27-nation bloc is the United States' largest trade partner.\n\"This political agreement restores stability and predictability for citizens and businesses on both sides of the Atlantic,\" the European Commission’s spokesperson for trade said. \"It secures continued access for E.U. exports to the U.S. market, preserves deeply integrated transatlantic value chains, effectively safeguards millions of jobs, and provides the basis for continued strategic cooperation between the E.U. and U.S.\"\nNew York Gov. Kathy Hochul says she is looking to redraw legislative lines in response to Texas redistricting fight\nNew York Gov. Kathy Hochul said this morning that she is exploring options to redraw state congressional lines \"as soon as possible\" as Texas lawmakers fled their home state in an attempt to stop GOP redistricting efforts there.\n\"We're already working on a legislative process, reviewing our legal strategies and will do everything in our power to stop this brazen assault,\" she said.\nHochul said the GOP push in Texas \"will have implications not just in Texas, but for our entire nation and its future.\" She sat alongside Texas Democratic lawmakers, praising them for getting into \"good trouble.\"\nHochul painted Texas Republicans as \"flagrantly breaking the rules\" in order to hold onto power. She accused them of trying to \"eliminate fairness in the system\" to avoid losing in future elections.\n\"History will judge us on how we respond to this moment,\" Hochul said, adding moments later, \"this is a war.\"\n\"We are at war,\" she said.\nAmerican Eagle stock soars after Trump praises Sweeney ad\nShares of American Eagle jumped more than 12% this morning after Trump praised the apparel retailer's controversial ad featuring actress Sydney Sweeney.\nThe president called it \"the HOTTEST ad out there,\" according to a Truth Social post. \"Go get ‘em, Sidney,\" he wrote of the \"Euphoria\" and \"Anyone But You\" actress. He also took a swipe at Taylor Swift, who endorsed Kamala Harris in November, saying he \"can’t stand\" the billionaire superstar.\nThe \"Sydney Sweeney has great jeans\" ad campaign generated backlash for evoking the term \"great genes,\" which is associated with eugenics and white supremacy. American Eagle said the ad message \"is and always was about the jeans.\"\nTrump's post gave American Eagle's stock a reprieve from an otherwise poor stretch. It's down about 32% so far this year.\nGhislaine Maxwell quietly moved to low-security prison in Texas\nJeffrey Epstein’s convicted accomplice and former girlfriend, Ghislaine Maxwell, has been transferred to a minimum-security prison in Texas, a move that the family of late Epstein accuser Virginia Giuffre is objecting to as “preferential treatment.” It comes just days after Maxwell and her lawyer met with Trump’s deputy attorney general, Todd Blanche. The Bureau of Prisons has not specified why she was moved. NBC’s Hallie Jackson reports for \"TODAY.\"\nStocks set to rebound after Friday jobs turmoil\nU.S. stock markets are showing some life this morning after Friday's dramatic developments knocked them down a peg.\nFutures for the S&P 500, Nasdaq and Dow Industrials all pointed to a higher open. On Friday, stocks had their worst day since the spring after Trump released a new slate of global tariffs and fired the Bureau of Labor Statistics commissioner after monthly jobs data showed far weaker growth than previously thought.\nWall Street will also hear from a big slate of major companies this week, as Disney, McDonald's, YUM! Brands and others are set to report financial results and weigh in on the state of the consumer.\nHouse Speaker Mike Johnson and GOP lawmakers visit Israel\nHouse Speaker Mike Johnson, R-La., and several of his GOP colleagues are in Israel today and met with the country's defense minister, Israel Katz.\n“I thanked them for their unwavering support and moral clarity in standing with Israel against its enemies, and for their vital voices in the efforts to bring all the hostages home and defeat the murderous terrorist organization Hamas,” Katz said in a post to X sharing photographs from their meeting.\nJohnson had previously been scheduled to visit Israel and address the Knesset in June, but his trip was postponed after Israel launched airstrikes on Iran, prompting retaliatory strikes.\nNew wave of Trump tariffs to take effect this week\nAs Trump’s tariffs are set to begin Thursday, rising prices from all the tariffs could cost the average American family $2,400 in 2025, according to a new estimate from the Yale Budget Lab. Meanwhile, Trump is facing new questions after firing the head of the Bureau of Labor Statistics after a weaker-than-expected July jobs report that he says is “rigged.” NBC’s Kelly O’Donnell reports for \"TODAY.\"\nFirebrand GOP Rep. Nancy Mace launches bid for South Carolina governor\nRep. Nancy Mace, who has at times broken with her own GOP leaders and often courted controversy, launched a long-expected bid for governor of South Carolina today, shaking up a crowded primary race that already includes big names in the Palmetto State.\n“I didn’t come to join the club. I came to hold the line. They said stay quiet; I spoke up. They said sit down; I stood up. They said play nice; I fought back,” Mace will say in a speech in Charleston, where she made history 26 years ago as the first woman to graduate from the Citadel military college. “South Carolina is tired of politicians who smile for the cameras, lie to your face, then vanish when it’s time to lead. I’m not one of them.\nMembers of Congress to hold town halls tonight\nSeveral members of Congress will hold town halls tonight as lawmakers begin their August recess.\nRep. Mike Flood, R-Neb., is holding a town hall tonight in Lincoln, Nebraska; Rep. Troy Carter, D-La., is expected to speak at a church in Jefferson, Louisiana, and Sen. Elissa Slotkin, D-Mich., will hold a town hall in Benton Harbor, Michigan.\nMany members of Congress use the August recess period to promote their party messages and listen to constituents’ questions and concerns.\nEx-football coach Derek Dooley launches GOP Senate bid in Georgia\nFormer college football coach and attorney Derek Dooley launched his bid this morning for the Republican nomination for the U.S. Senate in Georgia, a prime pick-up opportunity for Republicans next year.\nGeorgia Republicans hope to win back the seat from Democratic Sen. Jon Ossoff, who is in his first term; it’s a major target for the party to maintain or expand its slim Senate majority. Democrats have overperformed in the traditionally red state in recent elections and hold both Senate seats. Joe Biden won the state in 2020 by less than half a percentage point, while Donald Trump won by just over 2 points in 2024.\nTexas Democrats decamp to Illinois to deny Republicans a quorum on redistricting\nA showdown over redistricting in Texas played out here yesterday as dozens of state Democrats took refuge roughly 1,000 miles away from home, saying they fled Texas to deny quorum to Republican efforts to add as many as five congressional seats to their map.\nIt culminated with Texas’ Republican governor threatening to expel the Democrats from the Texas state House and potentially extradite them, saying they may be “felons.”",
  "word_count": 5951,
  "scraped_at": "2026-02-14T14:18:49.645289"
}