{
  "article_id": "33622096f120",
  "url": "https://news.yahoo.com/2023-shebelieves-cup-breaking-down-203934828.html",
  "title": "2023 SheBelieves Cup : Breaking down the USWNT roster , Megan Rapinoe potential milestone , who playing … and who isnt",
  "date": "20230214T220000Z",
  "domain": "news.yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "2023 SheBelieves Cup: Breaking down the USWNT roster, Megan Rapinoe’s potential milestone, who’s playing … and who isn’t\nThe 2023 SheBelieves Cup marks the first games of the year on home soil for the No. 1-ranked U.S. Women’s National Team, who’ll host No. 6 Canada, No. 9 Brazil and No. 11 Japan for the tournament’s eighth edition. The four-team tournament will serve as a warm up for the 2023 FIFA Women’s World Cup, set for July 20-Aug. 20 in Australia and New Zealand, where the Americans will set their sights on a historic three-peat and fifth title overall.\nU.S. head coach Vlatko Andonovski revealed the 23-player roster on Feb. 1, headlined by a star trio of USWNT veterans in forwards Alex Morgan and Megan Rapinoe and defender Becky Sauerbrunn. Twenty-two of the players (all but Rapinoe) were with the U.S. team in January for its trip to New Zealand, where the American women recorded two wins in international friendlies vs. the Football Ferns. USA is looking for a fourth consecutive title at the 2023 SheBelieves Cup and its sixth title overall. The USWNT won the inaugural tournament in 2016 and repeated the feat in 2018. The U.S. women lifted the trophy again in 2020, kicking off a streak of three straight wins by the host team.\nUSWNT action kicks off Thursday, Feb. 16, with a matchup against Canada in Orlando, Fla., where Morgan will be recognized in a pregame ceremony honoring her historic 200th cap. The 33-year-old California native reached the milestone on Nov. 13 in a 2-1 comeback win over Germany in Harrison, N.J. Of note, Rapinoe also has a shot at joining the 200-cap club during the SheBelieves Cup. With 197 caps so far in her USWNT career, the 2019 World Cup Golden Boot winner could hit the milestone if she plays in all three of USA’s matches.\nWho’s not playing in the 2023 SheBelieves Cup?\nAmong the most notable omissions from the U.S. roster are reigning NWSL MVP Sophia Smith, 2020 U.S. Soccer Female Player of the Year Sam Mewis and two-time U.S. Soccer POY Julie Ertz (2017, 2019). In a press conference Feb. 1, Andonovski addressed the players’ status and gave a positive update on the foot injury that kept Smith from playing last month in New Zealand.\n“Sophia actually is looking good. She’s back on the field running,” he said. “And I think that if we rushed it a little bit, we could have got some minutes from her, but I didn’t feel like this was a situation where we rush to get her back. Our goal is not just to get her back but to stay back, and that’s why she’s not in this camp.”\nAdditionally, Andonovski confirmed that Mewis would not be available this summer, after she recently announced on social media that she had to undergo surgery on her knee for a second time. He also noted that “time is running out” for fellow midfielder Ertz, who gave birth to a son in August and has not indicated whether she plans to return to playing. She has not been under contract with a professional team since late 2021.\n“Julie Ertz is someone that obviously we see that she hasn’t committed to any team in the league so far,” he said. “And the time is running out pretty much for her as well, and she’s someone that we’re probably not going to be able to count on in the World Cup. So these are two big names that may be or will be absent from the World Cup and this is something that we have planned for, and that’s why we’ve tried different players in this position and we’re gonna continue to try in this camp until we solidify the players that we believe will give us the best chance to be successful.”\nDefender Tierna Davidson, a 2019 Women’s World Cup champion and 2020 Olympic bronze medalist, is not on the tournament roster, but she is in the final stages of recovery from an ACL injury and will participate in the first part of training camp in Orlando. Also in return-to-play protocol are Kelly O’Hara, Christen Press, and Tobin Heath, all of whom Andonovski said he expects to see back or eligible for selection for April’s camp.\nRELATED: How to watch, who’s playing, and top storylines to follow at the 2023 SheBelieves Cup\nWho’s playing for the U.S. in the 2023 SheBelieves Cup\nThe 23-player USWNT roster for the 2023 SheBelieves Cup by position (includes current club, caps/goals):\nGOALKEEPERS (3):\nAdrianna Franch (Kansas City Current; 10)\nCasey Murphy (North Carolina Courage; 12)\nAlyssa Naeher (Chicago Red Stars; 87)\nDEFENDERS (7):\nAlana Cook (OL Reign; 21/0)\nEmily Fox (North Carolina Courage; 24/0)\nCrystal Dunn (Portland Thorns FC; 128/24)\nNaomi Girma (San Diego Wave FC; 12/0)\nSofia Huerta (OL Reign; 27/0)\nBecky Sauerbrunn (Portland Thorns FC; 212/0)\nEmily Sonnett (OL Reign; 70/1)\nMIDFIELDERS (6):\nLindsey Horan (Olympique Lyon, France; 123/26)\nTaylor Kornieck (San Diego Wave FC; 9/2)\nRose Lavelle (OL Reign; 86/24)\nKristie Mewis (NJ/NY Gotham FC; 47/7)\nAshley Sanchez (Washington Spirit; 19/3)\nAndi Sullivan (Washington Spirit; 39/3)\nFORWARDS (7):\nAshley Hatch (Washington Spirit; 15/5)\nAlex Morgan (San Diego Wave FC; 201/120)\nMidge Purce (NJ/NY Gotham FC; 22/4)\nMegan Rapinoe (OL Reign; 197/63)\nTrinity Rodman (Washington Spirit; 12/2)\nMallory Swanson (Chicago Red Stars; 84/28)\nLynn Williams (NJ/NY Gotham FC; 49/15)\nWhat to watch for at the 2023 SheBelieves Cup\nWelcome to the club: Star forward Alex Morgan, who comes into the 2023 tournament with 201 matches played for the USWNT, will be honored before the opening match in Orlando for earning her historic 200th cap, which came against Germany in the final match of 2022 in Harrison, N.J.\nMilestone alert: Should Megan Rapinoe appear in all three matches for the U.S. at the 2023 event, she’ll become the 14th player in USWNT history to reach the 200-cap milestone.\nComing in hot: Twenty-two of the players were with the USWNT in January for its trip to New Zealand, which featured two wins in international friendlies against the World Cup co-host Football Ferns. Rapinoe, who has recovered from a recent ankle injury, is the only new addition to the roster from the group that played in New Zealand.\nTop scorers: Morgan is by far the leading scorer on the U.S. roster with 120 career goals, the fifth-most in U.S. history. Rapinoe has 63 career international goals, Mallory Swanson has 28, and Lindsey Horan has 26, while Crystal Dunn and Rose Lavelle each have 24.\nThe 100-cap club: Five players on the USWNT roster have 100 caps or more: Becky Sauerbrunn (212), Morgan (201), Rapinoe (197), Dunn (128) and Horan (123).\nNewbies up their numbers: Eleven U.S. players on the roster have 27 or fewer caps, but only one has single-digit caps: Taylor Kornieck (9).\nBeen there, done that: Sixteen players on the 2023 USWNT roster were on the winning team for the 2022 SheBelieves Cup: Casey Murphy, Alyssa Naeher, Alana Cook, Emily Fox, Sofia Huerta, Sauerbrunn, Emily Sonnett, Horan, Lavelle, Kristie Mewis, Ashley Sanchez, Andi Sullivan, Ashley Hatch, Midge Purce, Trinity Rodman and Lynn Williams.\nFlying the (NWSL) flag: Eight of the NWSL’s 12 clubs are represented on the roster, led by five players from OL Reign, four from the Washington Spirit and three players each from NY/NJ Gotham FC and San Diego Wave FC.\nHow to watch, fixtures for 2023 SheBelieves Cup\nMORE FROM ON HER TURF: Protect the dream: Paralympic champion Mallory Weggemann on her journey to motherhood\nMore Women's Sports News\n2023 WNBA season primer: All eyes on Aces, Liberty ‘super teams’... Las Vegas head coach Becky Hammon denies bullying former player after WNBA... 2023 NCAA DI women’s golf championships: How to watch, who’s...\n2023 SheBelieves Cup: Breaking down the USWNT roster, Megan Rapinoe’s potential milestone, who’s playing … and who isn’t originally appeared on NBCSports.com",
  "word_count": 1312,
  "scraped_at": "2026-02-14T13:01:57.101219"
}