{
  "article_id": "33698f5050c5",
  "url": "https://www.newstatesman.com/politics/2012/10/george-osborne-the-austerity-chancellor-review",
  "title": "George Osborne : the Austerity Chancellor – review",
  "date": "20241208T043000Z",
  "domain": "newstatesman.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "George Osborne: the Austerity Chancellor\nJanan Ganesh\nBiteback, 368pp, £20\nWho is this book for? Is it for the general reader interested in Westminster politics or Janan Ganesh’s friends in journalism and those aides and special advisers who work for George Osborne and David Cameron, the “creative young brains” the author praises so lavishly?\nSome background first. Ganesh is the recently appointed, Conservative-sympathising political columnist of the Financial Times, which has the most intelligent politics and economics coverage of any British newspaper. The FT, since the financial crisis and the Great Recession, has turned right: its leader columns support the coalition government’s deficit-reduction programme (even if its distinguished chief economics commentator, Martin Wolf, does not) and its chief leader writer is Jonathan Ford, an old Bullingdon Club friend of George Osborne. Philip Stephens, a respected Blairite commentator and sceptic of the government, is now far less prominent on the paper since the arrival of Ganesh, whose columns are well sourced and mostly worth seeking out. The trouble is that Ganesh is something of a miniaturist: he has mastered the column; long-form writing has proved a greater challenge altogether.\nIn his acknowledgements, he says that this is “very much a book by a Financial Times and former Economist journalist”. Whatever could he mean? Perhaps this is a new school: we are familiar with the Whig view of history if less so with the FT/Economist approach to biography. Evidently the young fellow is a pathfinder, clearing a way for all those who would follow him, and what a noble enterprise it is, for Osborne is indeed one of our most fascinating politicians and Ganesh is fascinated by and deeply admiring of the man he calls the “austerity Chancellor” – especially of Osborne the Tory tactician and strategic thinker.\nAn assiduous networker and power-seeker, Osborne, from the moment he entered Conservative Central Office as a young Oxford graduate, seemed to know what he wanted from a career in politics and how, ruthlessly, to go about getting it. He insinuated himself at the centre of the web of power within the party and made himself indispensable by applying his strategic intelligence and talent for the game.\nOsborne has an ability to read situations and people and respond and adapt accordingly; he knows who is, or could be, useful to him and who is not, and he learns from mistakes – his own, colleagues’ and opponents’, the party’s – quickly. He is, Ganesh says of his hero, “a psychological seer” and a “perspicacious analyst of people, including himself”. Later, he tells us that Osborne is “hyper-conscious of the political utility of ideas”. And how blessed he remains: “He has been a Pauline, a Bullingdon boy and a Bilderberg panjandrum, but he now belongs to the most truly privileged elite: those who are happy in their work.”\nLike David Cameron, who is five years older but who was also marked out as a coming man no sooner than he had entered the Conservative Research Department, Osborne, the eldest son of a multimillionaire baronet, was fasttracked to becoming a special adviser and someone whose services the sitting prime minister, John Major, called upon. “He possessed a searing ambition to be a person of consequence,” Ganesh reports.\nAfter this, Osborne made sure he was close to William Hague and Iain Duncan Smith throughout their troubled leaderships and went on painlessly to secure a safe parliamentary seat in Cheshire at the age of 30. After the 2005 general election defeat, Michael Howard, before stepping down as leader, promoted Osborne to the role of shadow chancellor. He was 33. He and Cameron were admirers of the way Tony Blair had seized the centre ground of British politics and remade his party through bold, rhetorical positioning and internal conflict. Together they would set about “modernising” the Conservative Party, as Blair had modernised Labour, and prepare it for government. But not in quite the way they hoped, as it turned out.\nFrom an early age, Osborne had a coherent and settled political outlook, combining fiscal conservatism with lifestyle liberalism (to this he later added a hawkish, neoconservative approach to foreign affairs). As a Londoner who grew up and was educated in the capital, he was relaxed about many of the issues that agitated more reactionary Tories: race, gay and women’s rights, sexual freedom, immigration. His metropolitan sophistication is an essential point of difference between him and his friend and confidant Cameron, the shire Tory and county set charmer.\nOsborne considers himself to be a member of the “guild” formed of those politicians whose approach to a life at Westminster is comparable to how a first-rate doctor or corporate lawyer would approach their chosen career: not as amateurs or dilettantes but as dedicated professionals. If you are inside the guild – as the Miliband brothers, Ed Balls, Andy Burnham and David Cameron are, or James Purnell was – you understand, Ganesh writes, that “politics is a trade with its own skills and codes that can only be learned on the job. It is not an amateur vocation for talented people from other fields…” One would have wished for more of this kind of insight.\nIf the general narrative of Osborne’s rise and embrace of austerity economics is covered well enough, the larger problems of the book are of style and tone. Ganesh writes with comical awe and reverence, for instance, about Rupert Harrison, Osborne’s 33-year-old adviser, who was “among the outstanding microeconomists of his generation”. Harrison has a “powerful mind”; his “ambition is cloaked by a magisterial personal style”; he has a “capacious hinterland”. It’s as if Ganesh were describing a latter day John Maynard Keynes, whose intellect Bertrand Russell once said “was the clearest and sharpest” of anyone he ever encountered.\nHe goes on, in pompous undergraduate style, helpfully to explain that “economics is not a pure science. It does not generate absolute metaphysical truths grounded on incontestable evidence… something Harrison, who initially studied physics at university before switching to philosophy, politics and economics, understands better than most.” However, amidst all the praise for Harrison, he neglects to inform us that he was head boy at Eton, not an insignificant oversight when you consider how toxic issues of class and high-born privilege are becoming for Cameron and Osborne and those with whom they choose to surround themselves.\nAmong other irritations, Ganesh has an alarming fondness for the ostentatious or redundant adverb: Britain has a “haughtily opaque state”; Norman Lamont was “elegantly caustic”; Archie Norman, the businessman and former Tory MP, is “sublimely able”; Andy Coulson, the disgraced former News of the World editor-turned-Tory spinner, is “sublimely able”; Alan Clark, the Conservative diarist and libertine, is “famously fleshly”; the civil servant Nicholas Macpherson is “languidly brilliant”; Boris Johnson is “chaotically charismatic”; the Institute for Fiscal Studies is “unimpeachably pukka”; City financiers on their way to work are the “impossibly multinational hordes scurrying from Bank or Moorgate… each morning”; Oliver Letwin is “almost uniquely unsuitedto practical politics”. Can something be “almost” unique?\nThere are over-many awkward sentences: “As Osborne flourished against Brown, his clout within the Tory firmament grew…” Can you have clout within a firmament? “Cable continued to radiate clout and sardonic sagacity…” Can you radiate clout and sardonic sagacity? Elsewhere, he describes Osborne and Gordon Brown as being “deceptively similar politicians”. What he wishes to say is that they share much in common, as the sentences that follow explain, but “deceptively similar” means the opposite of what is intended.\nThere are dismaying inaccuracies and misinterpretations. Alistair Darling’s 2008 interview in which he warned of the seriousness and extremity of the financial crisis was in the Guardian, not the Observer as Ganesh says. The classical Liberal David Laws’s reluctance to join the Conservatives surely had as much to do with his homosexuality and the party’s prejudices against it, something that Ganesh does not mention, as it did with his concern about “social mobility”. The “second summer of love” was in 1988 not 1989 as the author writes. Ganesh describes the early-to-mid Seventies as the period in which a “dour Arsenal side dominated English football and the charts were mired in a no man’s land between the fall of the Beatles and the explosion of punk”. It’s true that Arsenal won the League and FA Cup double in 1971, but they did not dominate English football through the Seventies; in fact, they did not win another title until 1989. As for the author’s musical “no man’s land”, it coincided with the emergence of David Bowie’s transformative Ziggy Stardust and Marc Bolan. That period was not nothing. The failure of Northern Rock in 2007 did not herald the “first run on a bank in over a century”: there were runs on the retail banks in 1914, as Robert Skidelsky has written.\nBecause the book is not a psychological portrait of Osborne and because it fails to convey any convincing sense of its subject’s inner life, it reads mostly as an exercise in nearly-history: a standard, often perfunctory recounting of recent political events, awkwardly written. Ganesh tells us what happened and sometimes how it happened but not how it felt as it was happening; he doesn’t capture what Hilary Mantel has called the “atmospheric pressure” of historical events. He doesn’t write from the inside out, as it were: he has no access to Osborne’s or his friends’ letters or emails and he never quotes from diaries or journals by or about Osborne. He can therefore provide only a partial and superficial portrait of the man he reveres as the austerity Chancellor.\nThe book suffers by way of comparison with Francis Elliott’s and James Hanning’s biography of David Cameron, which over its several editions has broadened and deepened to become a work of merit, at once measured in its judgements, calmly and precisely written and authoritative. Ganesh’s judgements are too often swooning and overheated.\nIt is too early to say whether Osborne will succeed as an austerity Chancellor. We have not had the much-touted “expansionary fiscal contraction” and the Darling recovery sadly became the Osborne slump when Britain double-dipped back into recession – together with Italy, one of only two countries in the G20 to do so. One respects Osborne’s conviction and his resolve, but the 2012 Budget, which unravelled so disastrously and the fallout from which continues to be reflected in dismal opinion poll ratings, damaged Osborne’s credibility as a tactician and sage. As a result, he is no longer considered to be a future Conservative leader.\nGanesh believes too readily in the myth of Osborne’s strategic “genius” and is too willing to forgive what to some is unforgivable – the way Osborne talked down the economy in the months after the 2010 general election, when he alarmed consumers and conspired to destroy business confidence by cynically comparing the debt crisis in Britain with what was unfolding in Greece, a country that was and is imprisoned in the eurozone, without the ability to devalue its currency or to use loose monetary policy to mitigate the effects of recession, as well as the way he has failed to be more fiscally activist and respond pragmatically to changed economic circumstances.\nAs for Ganesh, he is a political writer of considerable promise – one is instinctively reluctant to be too disparaging about a young man’s first book, were it not that he occupies such an elevated position and likes to pronounce grandly on the defining political subjects of our day – but he would be well advised to be more sceptical of those who have or are close to power, all those “creative young brains” who are no doubt the sources for his columns. And he ought to reread Orwell’s essay “Politics and the English Language”, with its warning about the dangers of “the inflated style”.",
  "word_count": 1967,
  "scraped_at": "2026-02-14T13:01:40.065829"
}