{
  "article_id": "336e052b13cc",
  "url": "https://www.the42.ie/linda-gorman-on-tina-jones-6489494-Sep2024/",
  "title": "The fight to rescue Ireland first - ever home hat - trick scorer from obscurity",
  "date": "20240921T083000Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "IN THE post-war period, six male international players have scored a hat-trick for Ireland.\nAnyone reading this article will likely have heard of Don Givens, David Kelly, John Aldridge, David Connolly, Robbie Keane and Callum Robinson.\nYet in women’s football, Ireland’s hat-trick heroes are less well known.\nThe year before Givens became the first men’s Irish player to score a hat-trick on the international stage since the war, Paula Gorham became the first-ever hat-trick scorer for the women’s team away to Wales in 1973.\nGorham is better known than most female players from that era. She played for Ireland’s first-ever women’s football team and the Dundalk native has been belatedly recognised for her achievements, gaining entry into the Football Association of Ireland’s Hall of Fame in 2021.\nHowever, the same cannot be said for Tina Jones, the first Irish women’s player to score a hat-trick on home soil against Northern Ireland in 1977.\nDespite the increase in interest in Irish women’s football over the past few years, both in a contemporary and historical sense, very few sports fans will have been aware of Jones’ footballing prowess.\nInternational fixtures in the 1970s tended to be sporadic, but Jones was a key player for this early incarnation of the Irish team.\nOne reason Jones remains in relative obscurity is that she passed away in 2018 and consequently missed the recent wave of interest in the history of the women’s game.\nAnother is that her football career was relatively short-lived. Yet those who saw her attest to a remarkable talent.\nLinda Gorman, herself a trailblazer who represented Ireland as a player for 12 years and went on to become the country’s first female manager, met Jones in 1976.\nTina lived on the south side but represented Cabra-based Avengers. Gorman assumes she must have come to training with a friend because that was invariably how new players were recruited back then.\nAvengers were the only Dublin side that played in the League of Ireland at the time and Gorman remembers being “bowled over” by Jones’ close control.\n“She certainly had an eye for scoring goals and important goals as well,” Gorman adds.\n“I would say she was fiercely independent in terms of, we were on best behaviour whereas she was a little bit wild.\n“And, she would get up to stuff, whereas we’d be very hesitant — not mad stuff, not bad stuff, but it’d be daring.”\nThe team mostly travelled to away games by train for Sunday games, paying for the expenses and travelling costs themselves.\nFormer teammates also remember a player whose juggling skills were “magic to watch” and who played football “as an escape”.\nIn the 1975 League of Ireland Kevin Gaynor Perpetual Cup final, Jones netted two of the four goals as Avengers beat a talented Limerick outfit.\nJones scored another memorable brace as her side defeated Cork Celtic in 1979 in Turner’s Cross during a semi-final win in the All-Ireland Cup.\n“She was an only child of a single mother, and she spent a lot of her time going back and forth to England,” Gorman recalls. “Her maternal grandmother lived in Crumlin because I went out there a couple of times and later on in years to see how things were going.\n“She moved around quite a bit in Dublin. She lived near Bachelors Walk [at one point]. You would see her up there, and her mom had an apartment up near Christchurch.\n“Tina [later] met up with Robbie, and she had two children. And that was more or less the end of her football career.”\nDespite only enjoying a brief international career, Jones made a considerable impact for Ireland.\nA 1985 matchday programme before a match with Denmark listed her as the national team’s all-time top scorer.\nRecently, Gorman has become determined to honour the memory of her late friend and attempt to preserve Jones’ legacy.\n“Nobody talks about the fact that she did score the first hat trick on home soil,” Gorman says.\n“We celebrate Paula Gorham having done it away in Wales, but nobody mentions Tina.”\nLast year, the FAI gave out over 200 commemorative caps to players who featured for the Ireland Women’s National Team as part of the 50th anniversary celebrations.\nGorman made great efforts to assist with this process.\nHowever, one of the biggest challenges for ex-internationals was being able to prove that they represented Ireland and were thereby eligible for a cap.\nMedia coverage of women’s football, particularly when Gorman and Jones came of age, was scarce.\n“I was adamant that I remembered Tina scoring a hat trick, but there was no media, nothing to say that she did or that she didn’t. So I spent two weeks, along with other players helping in the National Library, trawling through stuff.\n“I actually found a fantastic article that raved about Tina and that she scored the hat-trick. I came across a 1978 programme and a game against France in Tolka Park where we held them to a 0-0 draw — Tina was probably the only signature on the programme.”\nGorman continues: “We have very few photographs of Tina, but one of the most endearing ones, and it’s great to have it, because people just wouldn’t believe the way we trained, and where we trained was in the Polo Grounds in Phoenix Park, and Tina is there training, and you can see that the clothes are down for markers and no bibs. Nothing really. And that’s Tina’s international career.”\nSome records suggest Jones won five caps for Ireland but she undoubtedly had the ability and the potential to claim more and would have done so in a different era or if she benefitted from more favourable life circumstances.\n“Tina’s life later was very tough. I don’t really want to talk about her personal life, but it didn’t turn out the way we thought it would.\n“She broke up with the father of her children, and [there was] just probably a bit of a destructive pattern then.\n“There was no real mechanism when you had children to come back to play football.\n“She may not have had a stable family home. The rest of us would have had brothers and sisters, mothers and fathers that were constants in our lives.\n“We always had someone in to allow you to continue playing football. I don’t think she had that support.”\nGorman gradually lost touch with Jones after the latter stopped playing football.\nThe recent FAI ceremony and the announcement that preceded it gave the former star a reason to get in touch with other ex-players and track down people she had lost touch with long ago.\n“I started networking with every single player I knew all around the world. I spent weeks in the National Library looking at local newspapers,” she recalls.\n“The FAI did make allowances — because we just couldn’t prove that players played.\n“Let me give you an example. Two players came to me and the son of a past player who had died. He said: ‘Look, I know my mom played in this game, and these two said: ‘I played, I remember.’ And they were so specific. And lo and behold, I had photographs myself. I knew there was a game in Wales and we were playing [another] in Bohs’ ground.\n“I knew that game was there. I knew we played Scotland, there were a few things that I knew but couldn’t put definite dates and locations and whatever.\n“And I had programmes, and [women's football researcher] Helena Byrne got me in touch with the person in the Welsh FA who had similar information. And lo and behold, were able to join up together.\n“The guy in Wales had the same programme as me, the same photograph as me, I had the signatures of all the Welsh players, but not the Irish players, and he had the signatures of all the Irish players. Three of those players had signed the programme and were in the photograph. So that’s how we got three people across the line.”\nGorman was persistent in trying to find information on Jones in particular. She discovered her late friend had died in January 2018.\nThe undertakers at her funeral were mentioned on the website RIP.ie and she sent them an email asking for a family member’s contact details.\nSadly, Tina’s daughter Rachel had also passed away in 2013 but Gorman was able to get in touch with her son, Robert, and pass on news of the upcoming 50th anniversary commemoration.\n“We had a very long conversation. It was emotional for him and me. He had said to me that I was the first person he’d ever met or spoken to who knew Tina before she had children.\n“It was a matter of getting proof. And I had my proofs, and he had a couple of photographs that he sent to me.\n“Robert knew his mother played football, but never to the extent that she played or what she had achieved.”\nRobert didn’t make the FAI ceremony but last June, Gorman drove up to Banbridge, County Down to present him with his mother’s commemorative cap.\n“When I got out of the car and saw this person walking across the road, I knew that was Tina’s son.\n“He’s a smart and lovely guy — that’s the feeling that I got. And in a way, it was sort of like talking to Tina.”\nJones was one of many players that Gorman and others worked hard to rescue from obscurity and ensure their contribution to the Irish team was acknowledged with a commemorative cap.\n“We were absolutely relying on people’s personal collections and our memories and all that type of stuff,” she explains.\nBut the immense effort was undoubtedly worthwhile. For Gorman and other ex-players, reconnecting has proved to be an emotional experience.\n“I did an awful lot of reflection — when I was playing against anybody, you were the enemy. I didn’t see you, I didn’t talk to you, I didn’t socialise. I didn’t know you, you were the enemy. And that’s how it was.\n“But when this cap [news] came out, it was very easy to connect with everybody. And I’m talking about [people in] Australia, America, New Zealand, England, Scotland, Wales, France, all over\n“And it’s as if nothing ever happened. ‘You’re the enemy’ and all that, it didn’t really matter, because the common cause was to make sure everybody got a cap and for me, more importantly, they’re going down into history books.\n“Every single player in that room came and said to me: ‘This has been the best day of my football career.’ You wouldn’t believe the joy in that room. You just couldn’t measure it. I don’t think I got a drink of water while I was there, because of the amount of people that were coming up to me, so happy and excited and getting photographs with their friends. I mean, that carried over for weeks and weeks, all over our social media groups, everybody was talking about it.\n“The cap was a little bit of a bonus but what really makes it special is being acknowledged.”",
  "word_count": 1862,
  "scraped_at": "2026-02-14T12:33:12.464210"
}