{
  "article_id": "33a0b45e06cd",
  "url": "https://www.si.com/college/charlie-baker-on-nil-transfer-portal-window-and-eligibility-lawsuits",
  "title": "Charlie Baker on NIL , Transfer Portal Window and Eligibility Lawsuits",
  "date": "20260105T203000Z",
  "domain": "si.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Charlie Baker on NIL, Transfer Portal Window and Eligibility Lawsuits\nNASHVILLE — Charlie Baker is here for the FCS national championship, because of course he is.\nThe president of the NCAA is an avid fan of college sports—something that might sound like it comes with the job, but historically has not. Baker, a lanky lefthander who played basketball at Harvard, has been a far bigger presence at championship events across all three levels of the NCAA than any of his predecessors. He is the least likely of any NCAA presidents to spend his time cloistered in the headquarters in Indianapolis.\nBetween myriad functions in Music City leading up to the title game Monday night between Illinois State and Montana State, Baker sat down with Sports Illustrated for a wide-ranging interview on the many issues college sports is confronting—and his favorite NCAA sporting events to date.\nSports Illustrated: How many NCAA championship sporting events have you actually attended since you’ve been president? It’s a pretty big number, isn’t it?\nCharlie Baker: About every six weeks I meet with the [NCAA] managing directors and directors, I show up in a room and they just ask me whatever they want. One of the questions I got asked at the last one was—this was exactly how it was framed—“As the president who has attended more NCA sporting events than all other presidents combined, which one was your favorite?”\nI mean, I’ve only been here for two and a half years. They’re like, “Trust us.” I’m guessing it’s somewhere between 30 and 50.\nSI: It doesn’t seem to matter what level or even what sport, you’d like them all.\nBaker: Look, to me, the power of the whole thing is in the learning. The number of people watching on TV, the number of people in the stands, the whole thing is about what it means to be part of a team and everything that comes with it. That’s the part I like. And I’ll tell you something. My answer to that question when I get asked it: Division III football championship in Salem, Va., 38–37, an absolute barn burner between Cortland State and North Central [Illinois]. And they had both bullied everybody. They both won all their games by 50 points and they just ran the ball and just murdered people. They both thought they could do that to each other.\nSo it was 7–3 at halftime, because they couldn’t. And it was 10–7 with six minutes left in the third quarter. And my wife and I are looking at each other like, “Somebody’s going to put the ball in the air here at some point.” And then they started throwing it and they literally scored 60 points in the next 20 minutes. North Central scored to make it 38–37, coach was going for two. And then they tried to bully their way into the end zone and it didn’t work.\nSecond favorite, D-II men’s basketball, in Evansville last year, Nova Southeastern against Cal State-Dominguez Hills. That was an incredible game.\nThird, watching Caitlin Clark for the first time in Dallas in the [Final Four] semifinals. I’d never seen the show. And you had written earlier that year that Caitlin Clark was the most exciting college basketball player in America, full stop. And it was awesome. And then the next day, two days later, to watch an LSU team that literally, I don’t [think] hit 10 threes the entire season, just launch and everything was going in. It was like magic. And they scored a hundred points and they needed them because Iowa scored 81.\nThe women’s ice hockey championship, it’s always the same two teams. It’s always Ohio State against Wisconsin, and it’s always a one-goal game\nI like watching kids play. It’s like the best part of the job.\nI literally said at the end of the conversation, Were you in there for that? Which I said at the end of it that that’s the part that makes it possible to put up with all the bulls--- and the nonsense with the rest of the time. And I do get to meet kids at most of these things, which is good, because they totally restore my sense of faith on the whole thing.\nSI: So the bulls--- hadn’t beaten you down?\nBaker: I’ve always thought about that stuff in terms of where you are versus where you were. And I do think when I got here, the only people who weren’t allowed to talk to student-athletes about NIL were the schools, which I just thought was bizarre. And the only people who did talk to them were people who had a financial interest in having them transfer, period, which is why in the fall of 2023, six months after I got the job, we made the first NIL proposal that involved school-based NIL. So I’m glad that was the way we worked the settlement. I think that was important.\nThe [Power 4 conferences] had always said that they had issues with the way the NCAA handled enforcement. It’s now theirs. And there I think [head of the College Sports Commission] Bryan Seeley got a late start. He didn’t really ... I think he started around the 15th of June, which was two weeks after the settlement got signed and literally like eight months, nine months after everybody had already started playing the game. So he still got a lot of catching up to do.\nBut we also got rid of about 80 committees in Division I. And I remember the first time I sat down to have someone walk me through how the Division I decision-making process worked. I was like, “Jesus, I’m out of healthcare and government. I’ve been around the most complicated decision-making models you can find, and this one is way more complicated than that.” And [now] it’s much less complicated. The committees are smaller, so you can’t hide anymore on a committee. You can’t blame it on somebody else. There’s 20 people on them and you have a larger number of student-athletes on them. The dialogue gets a lot more interesting.\nAnd we did settle [House v. NCAA], which took the biggest financial, I think, risk and challenge for everybody off the table. But we still have a lot of stuff we got to figure out. We became part of a series of larger discussions in D.C. [with Congress] where it really wasn’t about the SCORE Act anymore. It’s about a whole bunch of other things that other people were interested in. And I think the eligibility piece will play itself out eventually in court. We’re winning three out of every four of those cases, which is good, but it still creates an enormous amount of discord and lack of clarity, which makes everybody nuts.\nI think there were about 1,450 waiver requests last year. Two-thirds of them got approved. So there’s like 400 and something that got denied. And of those that got denied, I think like 30 of them ended up within the courts. So more than 90% of the people who got a rejection in Division I on a waiver request said, “O.K., that’s the rule. Move on.”\nBut I hear from coaches and ADs who basically say the message is where you live, what court you end up in front of and what judge you get is deciding whether or not you get another year [of eligibility]. And that’s not fair. And I don’t have a good answer for that. And it will take a while for us to get to an answer on this because the courts move on a different wavelength than we do. I mean, it could be the end of 2026–27 before all the various routes that this thing can move through get heard.\nThis is one of the main reasons why the SCORE Act created momentum was because even people in Washington understood that you have to have some kind of framework around how long you can play, both from health and safety point of view, but also for the next generation of kids that are coming from behind. I mean, one of the judges who rejected one of these claims in Ohio literally said in his opinion that “to give you a seat means I’m taking a seat away from someone else who’s otherwise eligible. I’m not willing to do that.” We’re very committed to the idea that this needs to get resolved, but we can only go as fast as the courts will permit us to go.\nSI: From that standpoint, the midyear enrollees ...\nBaker: Had them forever. And there was a lot of misinformation out there about a number of the kids. And I actually thought Seth Davis, he kind of nailed it. But clearly, I think for a lot of coaches and ADs, it was just one more thing, and I am completely sympathetic to that.\nAnd I think it’s going to be important for everybody to take that [House v. NCAA] participation agreement seriously—it’s not dead. It’s still being discussed and reworked—if you’re going to have a system that incorporates real third-party revenue share and real school-based revenue share, at some point you got to get people to agree on some of the basic terms about what’s inside that and what’s not.\nSI: To that point, everybody says they want rules, but then they end up not wanting rules. How do you get everybody to coalesce around the idea of, “We’re actually going to try to create a uniform set of rules and maybe abide by them or at least have a meaningful enforcement of them?”\nBaker: Well, most people do. I mean, the number of folks who don’t play by the rules ... I mean, if you look at the transfer data or the waiver data itself, it’s 90%-plus of the people accepted the decision when it didn’t go the way they wanted it. I think one of the things that ... The mere fact that we got the settlement done, and admittedly that came with some outside pressure, I mean, that was an agreement around a set of rules.\nNo one wants Bryan Seeley and his team to succeed more than I do, but they have a way to go there. And the other thing I would say here is that group dynamic decision making is always more complicated than one individual authority or two. Most of the college presidents, most of the ADs and most of the coaches I talk to say they would like clarity on this stuff. We’re setting up a mechanism to create clarity, and it’s based in many cases on some of the key elements that people said were important to them that should be part of it. And now we’re just going to have to see if people can get there.\nSI: How do you feel like the efforts have gone to address the allegations of point shaving, game fixing and performance manipulation due to gambling? To identify it and then be penalized and hopefully correct?\nBaker: We were the only people talking about it when I started talking about it. I have the professional sports leagues talking about it, which I think is actually good, and my hope is that we can figure out some way to create a coalition around some of this stuff. And in a perfect world, we get some of these folks to make some decisions. I mean, the NBA did manage to get certain kinds of bets taken off at the professional level, which was great. That’s the place to start, but I think there’s a lot more that needs to be done there.\nMore from Sports Illustrated: How an Anonymous Gambling Cheat Ended Up at the Center of the NBA’s Betting Scandal\nSI: That’s where the gambling companies themselves have to step up a little, don’t they?\nBaker: Yes. And the other thing that’s going on here is, and I’ve been talking to Brian Sandoval about this. He was governor in Nevada and he’s now the president at University of Nevada, Reno, but he also worked for one of the gaming companies at one point in between, and he was the attorney general of Nevada, so he spent a lot of time with this issue before that. He’s very well versed on it, and he was the first person who brought up prediction markets to me, and pointed out that there’s a lot of games that are kind of off the grid. Again, that seems to be where the real traffic in some respects on this comes from. He said, “We’re going to have to figure out how to incorporate them into the larger conversation.”\nThere are many lawsuits out there now, AGs and others, and gaming companies, suing the prediction markets, basically making the argument that the federal [Commodity Futures Trading Commission] is no place to police the integrity of what we’re talking about here, because it’s a very different kind of transaction than the one that they are historically built to deal with, and that the jurisdiction here rests with the states in the absence of anything at the federal level. And I’ve talked to Sen. [Richard] Blumenthal about this a couple times, who’s particularly interested in it.\nThe feds, for a whole bunch of reasons that I am somewhat sympathetic to, are a little nervous about diving into this particular space, given that all the states have historically played in it. But the whole reason why certain people testified against the lawsuit that was filed originally in New Jersey on this was because they said it was ultimately going to be a bad thing for everybody else.\nSI: The transfer portal window was moved obviously to where it now opened Friday. Is it in a satisfactory place in the calendar from your opinion, or does it need to be moved again?\nBaker: The oversight committee did add five days for the kids that are playing in the [College Football Playoff]. The rationale for getting rid of the spring window and creating a window in January was the opportunity it would present to acclimate transfer kids to campus, school, spring practice and all the rest, and would force everybody to make one round of decisions instead of literally creating uncertainty that was going to last six months instead of three weeks. And I think logistically, that wasn’t a terrible idea. I think it was probably a better idea than what we had before. I’m sure the committee’s going to reevaluate, which is what they usually do, after we get past the CFP title game. I think there’s genuinely an interest in one window.\nThe big debate the last time was about whether the window should be in the spring or in January. And the people who wanted January, there were more of them than one in the spring. And the argument they made was the one I just made, which is not an unreasonable argument, but I get the fact that it does crash into the season and the academic calendar.\nThere’s another conversation to be had, which is when should the season start and all the rest. Like many others in the college football world, I want to leave Army-Navy alone. So it’s just a hard window.\nSI: [A spring portal window] would be so much better in terms of maintaining the integrity of the actual fall semester and the football season—from a coaching standpoint, from a player standpoint, the whole deal. The problem is, I’ve had people tell me that the kids are going to want to transfer anyway. They’re already going to make up their mind that they’re ready to go and then you’re just having them taking up space on your campus for five months when they’re already leaving.\nBaker (writing notes to himself on a piece of paper): I’ve got to think a little bit about that one.\nI’ll run into some kids over the course of the next few months. I’ll ask them about that and see what they say. I don’t know if we could ever do a survey on this. Try and talk to kids who go into the portal at some point after the fact and say, “You had to make your decision in here, would you have made a different one if you were making it three or four months later?” Once they go in, they really can’t go back.\nHere’s the thing I can’t answer, and I think it creates some of the challenge here. How much of that is about a decision that a young person wants to make and how much of that is a decision that they’ve got nudged into? And that really complicates it, I think, no matter when it is. I have talked to a lot of kids whose parents really put the arm on them, which is interesting to me.\nSI: A couple other things—does the SCORE Act still exist? Is there a different avenue? Where do you think things stand?\nBaker: In politics, you never say never because windows open, they close, they open, they close. For all kinds of reasons. I think we’re going to have a lot of work to do when they come back, especially if they don’t land the plane on the Jan. 30 [government funding deadline]. I mean, if we go back into another environment where they’re not in session for any extended period of time, I think it gets a lot harder.\nSI: How close did you think you were?\nBaker: I thought in August we had it for sure. But we got tied up in a lot of other stuff the second time. The first time, some of that was our own issues. We had unity and then we didn’t, and then we had to go get it back. And I thought a lot of the modifications they made to the bill to get certain people back on board were appropriate, and by then we were part of a much bigger set of trades.\nSI: My favorite topic, NCAA tournament expansion.\nBaker: You don’t like that, huh?\nSI: No, I don’t like that. We don’t need a bigger tournament. I don’t think adding teams helps the tournament at all. I think it would reward the 12th-, 13th- and 14th-place teams in power leagues far more than anybody else.\nBaker: One of the things that happens if we go this way, and the basketball committees are talking about this, is to basically try to move the start of the tournament up. So it’s not just a play-in round. There’s actually a whole bunch of games that start that week, and then transition into the field of 64 at the end. And I don’t think I agree that based on past precedent in terms of who the first four out and the bubble teams are, that it’s the 12th, 13th and 14th power-conference schools.\nI mean, part of the reason I was interested in the expansion in the first place was I was looking at teams like St. John’s and Marquette and Indiana State and Drake and Bradley and some of those that all got right on the edge and didn’t get in. I also think it’s a way to continue to award schools for spending money on basketball, which I think is always going to be important to us and to the NCAA.\nAnd I also think if we extend the size of the portfolio, it makes it easier for everybody to stay bought into an AQ process for all 32 conferences, because you’ve basically got ... At that point, you literally don’t have hardly anybody who’s out who can argue they’re part of the best 50 teams in the country or the best 60 teams. Part of my goal is to preserve that [automatic bids for all 32 conference champions].\nLike, when Robert Morris is behind Alabama, 68 to 67, and there’s only seven minutes left in the game, and people are really starting to burst into flames all over the place.\nSI: Do you have any insight into probability of expansion, and/or timeline?\nBaker: I knew we were rushing it the last time when we were trying to get it for [2025–26], but we’ve now been talking to these guys for over a year. Dan [Gavitt, vice president of men’s basketball] has continued to have conversations with our people and they get the fact that we need to sort of bring this in by the time this year’s tournament gets going.\nSI: Private equity. Do you foresee more of it in college sports and do you think it’s good, bad, indifferent?\nBaker: I said all along that I think people should be really careful about it, but at the same time, I think there is value and possibility as long as you talk about the stuff that’s most important right up front. Part of why the Utah thing feels a little different to me than some of the other conversations people have had is that they spend a lot of time on, “Well, what’s the point of this?” I don’t want to talk about how much money. What are we going to do here? Like, what problem that we’re trying to solve is going to be part of this? What opportunity do you, the third party, see as possible for you? That conversation, they know strategically a lot more about what they think they’re seeking to do together than some of the folks who have been in these conversations before.\nThe second thing is they got a commitment on time, right? It’s basically at least five, and I think it’s at least five to seven [years], I think is the way they set it up. Utah still controls the voting seats on the board, and I think they control the management group, too. So the way I look at it is there’s way more clarity here about upside, downside and expectations and purpose in that one that I’ve seen and some of the others people have talked about.\nSay you’ve got to build a new football stadium. You want to expand your suite capacity. You have a set of fields you want to either make over or develop. I mean, those kinds of targeted projects, I think there are third parties who’ve done this stuff a million times and can be incredibly helpful to people. They know the way people have been doing it in Sweden and Germany and Australia and stuff like that. And they’ll bring a hell of a lot of knowledge to those kinds of sort of particular programs that I think are hard to find elsewhere, and you’ll pay for that, but in the long run, if you structure the deal right, it’d probably be worth it to you.\nSI: One of the concerns is that [a private equity partner] comes and says, \"Well, why do you have a soccer team?\" The Olympic sports level.\nBaker: Let’s put it this way. Losing the House, Hubbard and Carter cases [against the NCAA] would have been a far bigger disaster for Olympic sports than signing the House injunction. I think the elimination of the scholarship limits has actually been good for both women and Olympic sports. I think the data will bear this out by the end of the year.\nWhen I joined the NCAA, the total number of student-athletes was 510,000, and now it’s 556,000 and most of that growth is in Division I. I think the schools that have always been some of the big brands in Olympic sports have all asserted to me and to others that they’re big brands for us for a reason and we’re going to continue to make them a big part of our portfolio.\nI can only go by the data that I see, and the data that I see says that the participation levels are at or above, and the scholarship stuff is at or above, and I’m not hearing from anybody that they’re taking a big walk back from where they’ve been in Olympic sports. Especially with the 2028 and ’34 Olympics, both being in the U.S.\nSo I kind of look through the sports and I don’t see one where I say to myself, “This thing seems to be on the [chopping] block.” I don’t see a lot of stuff in my field of vision at this point that says anything other than people are going to continue to spend money on those sports because they’re important to them in terms of their name, image and likeness.\nSI: Yeah, the university’s name, image and likeness.\nBaker: Absolutely.\nMore College Football from Sports Illustrated\nListen to SI’s college sports podcast, Others Receiving Votes, below or on Apple and Spotify. Watch the show on SI’s YouTube channel.\nPat Forde is a senior writer for Sports Illustrated who covers college football and college basketball as well as the Olympics and horse racing. He cohosts the College Football Enquirer podcast and is a football analyst on the Big Ten Network. He previously worked for Yahoo Sports, ESPN and The (Louisville) Courier-Journal. Forde has won 28 Associated Press Sports Editors writing contest awards, has been published three times in the Best American Sports Writing book series, and was nominated for the 1990 Pulitzer Prize. A past president of the U.S. Basketball Writers Association and member of the Football Writers Association of America, he lives in Louisville with his wife. They have three children, all of whom were collegiate swimmers.\nFollow ByPatForde",
  "word_count": 4278,
  "scraped_at": "2026-02-14T13:23:57.483596"
}