{
  "article_id": "33cc6d484000",
  "url": "https://news.yahoo.com/pretty-special-ben-zobrist-completes-112757162.html",
  "title": "  It pretty special : Ben Zobrist completes a dream with Peoria hall of fame induction",
  "date": "20230326T130000Z",
  "domain": "news.yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "'It's pretty special': Ben Zobrist completes a dream with Peoria hall of fame induction\nPEORIA — Ben Zobrist grew up equal parts Roy Hobbs, Rudy, Jimmy Chitwood and Rocky Balboa.\nBut on Saturday, the Eureka native and Chicago Cubs 2016 World Series MVP stood on the stage in the ballroom at the Peoria Civic Center, 500 spectators looking on, and became 100% Greater Peoria Sports Hall of Fame inductee and the local legend he always wanted to be.\nThe small-town kid who found his passion to play and the dream he wanted to chase from the time he was 5 years old on Eureka's sandlots came home to central Illinois to take his place in local sports lore.\nBaseball in Peoria: 7 Baseball Hall of Famers with ties to the Peoria area\n\"As a young kid I never expected to make it to professional in anything,\" Zobrist said before his induction ceremony. \"All I wanted to do was be a state-caliber player, that's all I could think about and dream. I didn't think professional sports was a thing (for me).\n\"Going to the state tournament was the best thing I could do, winning it for the community and finding a way to be a local legend.\n\"I went to Bradley basketball games growing up. Now I'm in this same building, coming here to be inducted into this Hall of Fame in my hometown area. It's all the culmination of being a local athlete.\"\nThe culmination of becoming a local legend, too, and Zobrist graciously stayed an hour after the ceremonies were over to sign autographs.\nZobrist was the headliner Saturday at the annual Greater Peoria Sports Hall of Fame induction and awards banquet.\nHall of Fame inductees included:\n• Priscilla Welch-DeLaere, a 12-letter star at Pekin High School who went on to play softball for Illinois State and become one of the best players in Missouri Valley Conference history, leading up to a four-year pro career.\n• Legendary Metamora football head coach Pat Ryan, who over 30 years at the helm took the Redbirds to seven state championship games, 24 playoff appearances and 19 conference titles.\n• Gene Jones, who in a 52-year cross country coaching career at Metamora produced 32 conference titles, 16 state meet appearances and headed a program that saw 18 boys and 12 girls earn All-State honors.\n• Ed McGraw, the East Peoria distance running coach who developed elite local runners like Tim Broe, Jenelle Deatherage and Jim Eicken and later helped found the Illinois Valley Striders Club and the annual Steamboat Classic.\nBackground:MLB's Ben Zobrist leads the Greater Peoria Sports Hall of Fame class for 2022\nZobrist was the final inductee, and he was true to who he is as a person and was as a player. The 2016 World Series MVP, who made a dream come true for a generation of Chicago Cubs fans, stood at the dais rocking World Series rings from the Cubs and Royals on his fingers as friends, former teammates, coaches and family gathered to watch him embrace his GPSHOF induction as another seminal moment in his life.\n\"Game 7, 10th inning, I do replay it in my head still,\" said Zobrist, who drove in the winning run against the Cleveland Indians in that moment to give the Chicago Cubs their first World Series title since 1908. \"I get asked about it a lot. Today I spoke to the Peoria Christian School baseball team, my buddy Jason Miller is the coach there and they had a practice and I went over and I joined them. They asked some questions and I told them about my experiences and we went back to the 10th inning in Game 7 in 2016.\n\"It's a memory, a feeling, that will be part of me forever, it doesn't go away.\"\n$50 and baseball hope\nZobrist said he had no college offers coming out of Eureka High School. He thought his athletic career was over.\nHe paid $50 to attend a baseball showcase in Brimfield and caught some eyes. Olivet Nazarene University invited him to play for its NAIA team. He starred. Dallas Baptist University, then a rising NCAA Division I power, soon came calling. He starred.\nThe MLB Draft followed, where he was a sixth-round pick by Houston in 2004. He went on to a 14-year big league career and became the model for the modern utility player, piling up starter-level games played while handling every position on the field but catcher.\n\"I was inspired as an amateur athlete by my coach at Eureka Middle School, Craig Gerdes, the most fun I ever had playing ball was in junior high for him,\" Zobrist said. \"I'm so grateful. Baseball, basketball or track he was my coach, and we were always competitive and I got used to winning there. In high school, I always had great athletes around me. We always felt we were one of the better teams around. That built this winning attitude in me, this belief that I was a winner.\n\"Olivet Nazarene went to NAIA World Series. By the time I got to pro ball, I was known as a winning player, and I believed I was a winning player. I was never satisfied, really motivated to be a leader and find a way. It's always been a part of me, all the way up to the big leagues.\"\nHe didn't get there alone\nZobrist had a long and interesting thank you list of people who inspired him.\nSome of them weren't real.\nHe cited Roy Hobbs, Rudy, Jimmy Chitwood and Rocky Balboa, all characters from blockbuster sports movies.\n\"When you grow up in idyllic central Illinois, there are a number of people who inspire you over time,\" Zobrist said. \"And some of them are very real and some of them are fictional but all of them were larger than life to me.\"\n'A legacy': How Shaun Livingston sees induction into Greater Peoria Sports Hall of Fame\nHe mentioned Ozzie Smith, George Brett, Hersey Hawkins, Aaron Zobrist, Jim Thome and his father, Tom Zobrist, among his A-list with the movie characters.\nHe said he was inspired by playing with his sister, Jessica, his childhood best friend, Jason Miller, and Joe Chally, James Chally, Mike Hasty, Luke Wiegand, Trent Leman, Chris and Brandon Martin and others.\nHe said his amateur athlete inspiration came from Eureka coach Gerdes, the 1993-94 Eureka High School boys basketball team, his high school coach Bob Gold, Elliot Johnson, Dan Heefner, Steve Foster, Mike Bard and more.\nHis inspiration as a professional athlete was drawn from Scott Pucino, Bobby Witt, Rusty Pendergrass, the Astros, Rays, Athletics, Royals and Cubs, Joe Maddon and endless teammates and competitors.\nHe thanked his children, Zion, Kruse and Blaise, his mom for her love and support and his dad for his coaching and guidance.\n\"I started playing little league at age 5 or 6,\" Zobrist said. \"But before that, it was Wiffle Ball in my backyard with my dad. There's so many things. I remember my dad coaching me early on, that was big in my development as an athlete.\"\nHe mentioned his grandfathers, too.\n\"My grandpa Alpha was a Cardinal fan and my grandpa Andy was a White Sox fan and neither saw me play for the Cubs,\" Zobrist joked. \"So I'm sure we'll have something to talk about right away when I get to heaven.\"\nWhen baseball was over\nZobrist is 41 now, with three kids and new challenges.\n\"After baseball, I definitely needed some physical outlet stuff,\" he said. \"I started snowboarding in the winter as soon as I retired. I do hiking and mountain biking. Not super competitive things.\n\"I went cold turkey for a couple years where I didn't really even watch sports, tried to decompress from all of the sports that I lived in for a long time. It was definitely a transition period.\"\nBut Zobrist says his inner drive is shifting back toward baseball. Not coaching or playing, but something else.\n\"I'm getting excited to do some things back in baseball,\" he said. \"I've been talking to the Cubs a little bit, talking to people I know in the baseball world to see what it is that I might want to do. It would be something that addresses player personnel and staff in regards to their health — mental, emotional, relational health — as they are playing the game. Something in that realm.\"\nA new venture for Zobrist\nZobrist says he's spending time with his kids, and with a non-profit organization he is building from its infancy. His charitable project is called Champion Forward.\n\"We're going to address youth competitors, their caretakers and coaches,\" Zobrist said. \"Try to address and help them with emotional, mental and relationship health as they play sports together.\n\"So we're kind of addressing the mental health epidemic among youth right now, burnout, isolation and performance pressure.\"\nFrom the archives:Ben Zobrist’s magical MVP World Series\nA message for central Illinois athletes\nBen Zobrist with a nice acceptance speech and then flashing his Greater Peoria Sports Hall of Fame hardware after his induction Saturday night in Civic Center ballroom pic.twitter.com/X66iQxlZly\n— Dave Eminian (@icetimecleve) March 26, 2023\nBen Zobrist stood in front of a Greater Peoria Sports Hall of Fame backdrop after his induction, World Series rings on his fingers, arms holding induction plaques while friends and family looked on.\n\"I was not all-state in high school,\" Zobrist said. \"I was all-area for Peoria. That was it. From there I somehow got an opportunity to play college baseball and become a pro.\n\"But my dream was always to be known as one of the better players in our area. So to be honored tonight and go into this Hall of Fame?\n\"It's pretty special.\"\nThe GPSHOF full induction and awards list\nThe GPSHOF took in the 2005-06 ICC women's basketball team, the 1983 Limestone football team, the 1996, 1997, 1999 and 2000 Metamora football teams.\nChuck Leonard, the former Metamora football scout, won the Neve Harms Meritorious Service Award.\nTri-County athletes and coaches of the year were awarded, with ICC volleyball star Kenna Wollard earning Female Athlete of the Year, Peoria High running back Malachi Washington named Male Athlete of the Year, Maribeth Dura earning Female Coach of the Year for leading Brimfield girls basketball to a state title, and Peoria Rivermen head coach Jean-Guy Trudel named Male Coach of the Year for bringing Peoria its first pro hockey championship in 22 years.\nFrom the huddle, sideline and bench\nHere's some excerpts of what some of the Hall of Fame inductees and award winners said Saturday:\n• Pat Ryan, retired Metamora football coach, on his induction into GPSHOF:\n\"My time as coach was a product of what can happen if you are surrounded by really good people. When you surround yourself with great people, it's a lot harder to fail. My brother, Curt, who was on all the journeys and in charge of the field … he'd cut the grass with scissors because there was one blade (taller than others). We'll get him some counseling because we're going to turf. Through all this, the rock, my wife Nancy, she lived it all … I'm so thankful.\"\nPat Ryan:Legendary Metamora coach takes a role with Illinois football\n• Maribeth Dura, Tri-County Female Coach of Year:\n\"I coached because I enjoyed it. I enjoyed watching the improvement I see in my players' skill set. I enjoy watching the growth in character and maturity and leadership in my players. That's the amazing part of coaching. Our state championship run was an amazing experience. My players were warriors. They welcomed playing the big schools during the season to get ready for the postseason. In the end, we got it done.\"\n• Jean-Guy Trudel, Tri-County Male Coach of Year, in a statement presented by his wife, Angie:\n\"As coaches, we all have the common goal of winning and developing young athletes, but for me coaching is a lot more than that. It's about teaching and molding young minds for the years of life after sports. I was so fortunate to have a group of players that brought us to a championship, and for that reason, we will be forever linked.\"\n• Malachi Washington, Peoria High running back and Tri-County Male Coach of the Year:\n\"To Peoria High coach (Tim) Thornton: Thank you for trusting me to tote that rock down the field. To my biggest fan, who taught me to have faith in all that I do, thank you for being the loudest in the crowd and showing up every time — I love you mom. I leave you with this from Vince Lombardi: 'The only place success comes before work is in the dictionary.' \"\nDave Eminian is the Journal Star sports columnist, and covers Bradley men's basketball, the Rivermen and Chiefs. He writes the Cleve In The Eve sports column for pjstar.com. He can be reached at 686-3206 or deminian@pjstar.com. Follow him on Twitter @icetimecleve.\nThis article originally appeared on Journal Star: Cubs hero Ben Zobrist inducted into Greater Peoria Sports Hall of Fame",
  "word_count": 2186,
  "scraped_at": "2026-02-14T12:38:45.359804"
}