{
  "article_id": "33dc703b778d",
  "url": "https://www.courant.com/2023/10/04/2030-world-cup-set-to-be-hosted-by-spain-portugal-morocco-with-3-south-american-countries-added-2/",
  "title": "2030 World Cup set to be hosted by Spain - Portugal - Morocco with 3 South American countries added",
  "date": "20231004T191500Z",
  "domain": "courant.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By GRAHAM DUNBAR (AP Sports Writer)\nGENEVA (AP) — The 2030 men’s soccer World Cup is set to feature games in six countries on three continents in a unique format that will allow the tournament to celebrate its 100th anniversary in Uruguay.\nFIFA reached an agreement Wednesday between soccer’s continental leaders to accept a bid spearheaded by co-hosts Spain, Portugal and Morocco as the only candidate for the hosting rights. The agreement also includes staging games in South American countries Argentina, Paraguay and Uruguay, which had earlier promoted a rival co-hosting bid.\nThose three countries will each host one match to start the tournament, which allows FIFA to stage the opening game in the Uruguayan capital of Montevideo, where the Centenario Stadium hosted the inaugural 1930 World Cup final.\nThe bid had started out as a joint venture between Spain and Portugal before expanding to include Morocco, in northern Africa, earlier this year.\nAll six host nations will get automatic entry to the 48-team tournament, FIFA said. It is the first time the World Cup will be played on more than one continent.\n“The centennial World Cup could not be far from South America, where everything began,” said Alejandro Dominguez, the president of South American soccer body CONMEBOL. “The 2030 World Cup will be played in three continents.”\nThe consensus reached by the continental soccer bodies also allowed FIFA to open bidding for the 2034 World Cup, with only member federations from Asia and Oceania eligible to bid for the hosting rights.\nSaudi Arabia immediately entered that contest and Australia is also interested after successfully co-hosting the Women’s World Cup this year with New Zealand. Either way, the 2034 tournament will almost certainly be played in November and December — like last year’s World Cup in Qatar, in the heart of the European club soccer season.\nAccelerating the choice of a 2034 host to the end of next year will be widely seen as a victory for Saudi Arabia and Crown Prince Mohammed bin Salman, who has built close ties to FIFA president Gianni Infantino in the past six years.\n“We want to celebrate our football culture and share our country with the world,” Yasser Al Misehal, the president of the Saudi soccer federation and a member of the FIFA Council, said in a government statement announcing its intention to bid.\nThe FIFA Council’s acceptance of a unified 2030 candidacy still needs formal approval next year at a meeting of the 211 member federations. That should be just a formality. The 2034 pick will be made at a separate congress, FIFA said.\n“In 2030, we will have a unique global footprint, three continents — Africa, Europe and South America — six countries — Argentina, Morocco, Paraguay, Portugal, Spain and Uruguay — welcoming and uniting the world while celebrating together the beautiful game, the centenary and the FIFA World Cup,” Infantino said in a statement.\nThe 48-team tournament scheduled for June-July 2030 is set to start in Uruguay, Argentina and Paraguay — which FIFA branded as “Centenary Celebration Matches” — before the action moves to the core host nations Spain, Portugal and Morocco.\nThe plan involves an unprecedented amount of travel across distances and time zones, including 13-hour flights from Buenos Aires to Madrid.\nIt was not popular with Football Supporters Europe, the fan group officially recognized by European soccer body UEFA.\n“FIFA continues its cycle of destruction against the greatest tournament on earth,” FSE said in a statement. “Horrendous for supporters, disregards the environment and rolls the red carpet out to a host for 2034 with an appalling human rights record.”\nSaudi Arabia and Australia both are members of the Asian Football Confederation yet the organization’s president, Bahraini royal Sheikh Salman bin Ebrahim Al Khalifa, stated a clear preference Wednesday.\n“The entire Asian football family will stand united in support of the Kingdom of Saudi Arabia’s momentous initiative,” Sheikh Salman said in an AFC statement, adding it was committed to working for its win. Australia was a losing candidate when Qatar won its hosting vote in 2010.\nThe South American co-host bid has been promoted since the 2018 World Cup in Russia and had included Chile, which was not mentioned Wednesday.\nUkraine was also dropped after it was added to the European bid a year ago at a news conference at UEFA headquarters in Switzerland. However, Ukraine had not been mentioned in official comments about the UEFA-backed bid this year.\nThe first 48-team men’s World Cup will be hosted in 2026 by the United States, Canada and Mexico.\nThe 2030 decision marks a victory for Morocco, which has invested heavily in infrastructure in its largest cities and was last week chosen to host the 2025 African Cup of Nations. The men’s national team helped push its case by reaching the World Cup semifinals in Qatar, eliminating Spain and Portugal in the previous rounds. It will be the second African nation to host the tournament after South Africa in 2010.\nIn a statement on Wednesday, Moroccan King Mohammed VI’s Royal Cabinet said the selection “recognized Morocco’s choice place in the ranks of great nations.”\nThe 2030 deal was clinched six weeks after the former president of Spain’s soccer federation became an international embarrassment for his behavior at the Women’s World Cup final.\nLuis Rubiales was was suspended by FIFA and eventually forced to resign after kissing a player on the lips during the awards ceremony in Sydney, Australia on Aug. 20, which drew attention away from the greatest achievement of Spain’s women’s soccer team. He is now under criminal investigation.\nSpain’s Prime Minister Pedro Sánchez had expressed public concern that Rubiales could derail the bid to host the men’s World Cup if he remained in office.\nSánchez said in Spanish on X, the social media platform formerly known as Twitter: “We will show the strength of our country as champions of the men’s and women’s world titles, and we will defend the values of equality, solidarity and fair play that should always be present in sports.”\nSpain previously hosted the 1982 World Cup, Argentina was the 1978 host and Uruguay had the inaugural 1930 tournament. Portugal, Morocco and Paraguay will be first-time hosts.\n___\nAssociated Press writers Mauricio Savarese in Sao Paulo, Brazil; Sam Metz in Rabat, Morocco; and Joseph Wilson in Barcelona, Spain contributed to this report.\n___\nAP soccer: https://apnews.com/hub/soccer",
  "word_count": 1061,
  "scraped_at": "2026-02-14T12:07:15.940329"
}