{
  "article_id": "33e0eedc20b7",
  "url": "https://patriotpost.us/digests/107189-mid-day-digest-2024-05-28",
  "title": "Mid - Day Digest",
  "date": "20240528T191500Z",
  "domain": "patriotpost.us",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Mid-Day Digest\nTHE FOUNDATION\n“Religion and Virtue are the only Foundations, not only of Republicanism and of all free Government, but of Social Felicity under all Governments and in all the Combinations of human Society.” —John Adams (1811)\nIN TODAY’S DIGEST\n- Democrats Still Cynically Use George Floyd\n- Executive News Summary\n- DEI Is Killing Medicine\n- What Trump’s Massive Bronx Rally Means\n- The End of College Athletics?\n- ‘Bad Therapy’: A Review\n- DAILY FEATURES: Videos, Best of Right Opinion, Short Cuts, Memes, and Cartoons.\nON THE WEB\n- Brent Ramsey: Navy Readiness and the Jones Act\n- Mike Rhinehart: ‘The Big 9’: The Questionable Renaming of Things\n- RNC: A Costly Memorial Day\nFEATURED ANALYSIS\nDemocrats Still Cynically Use George Floyd\nA criminal died of a drug overdose while resisting arrest, and he’s a permanent “hero” to the Left.\nNate Jackson\nOn May 25, 2020, a black thug named George Floyd died under the knee of now-former Minneapolis Police Officer Derek Chauvin. Though Floyd actually died of the lethal combination of fentanyl and meth in his system, exacerbated by being physically pinned to the ground after resisting arrest for another crime, Chauvin was convicted of murder for using the subduing technique police were often taught. The Black Lives Matter rioters didn’t wait for the truth, though — they just burned American cities, looted businesses, and killed dozens of people (mostly blacks) in the summer of chaos that followed.\nDemocrats pandered to the rioters from the get-go, even mistakenly donning slave-trader garb to somehow show solidarity. Minnesota, the epicenter of destruction and violence, proclaimed May 25 as the annual “George Floyd Remembrance Day.”\nDuring the 2020 pandemic, when the rest of us couldn’t gather for the funerals of loved ones, Floyd’s funeral was turned into a national spectacle and humiliation ritual for “guilty” whites. Leftmedia outlets like The Washington Post and NBC News treat us to annual “news” stories flogging the nation for failing to bring about racial justice.\nAlways subservient to the radical Left, Joe Biden is also still at it, issuing a statement on the fourth anniversary of Floyd’s death. His handlers also posted numerous tributes like this one on social media: “He changed the world. Now, let’s act in his memory.”\nBiden did not issue a statement about Laken Riley’s murder, however. Nor did his handlers say anything about her on social media. The only time Biden mentioned her at all was when cat-called into doing so in his State of the Union, and even then he mispronounced her name.\nFloyd’s death fits the Democrat Narrative™. Riley’s does not. Nonetheless, both Floyd’s and Riley’s deaths are an indictment of Democrats.\nThe party of slavery and Jim Crow has kept blacks trapped in poverty in Democrat-controlled cities and, in exchange for handouts, ensured they remain a loyal voting base. Democrat union-run schools fail to educate inner-city kids. Democrats subsidizing illegitimate childbirth in these cities has left generations of blacks growing up in fatherless homes, leading to drug abuse, gang activity, and shameful rates of violence and murder.\nAll Democrats offer in return is more handouts, more race-baiting, and no actual help.\nYet Democrats have thoroughly convinced blacks that “systemic racism” is keeping them down and that blacks will never succeed without Democrats.\nWho are the racists again?\nAs for Riley, she was killed by an illegal alien who was allowed to enter and released by players in a justice system unwilling to pursue justice.\nOn immigration policy, Biden and his fellow Democrats have done a 180 over the last 15-20 years. When illegal border crossings began surging during George W. Bush’s administration, Democrats demanded stronger enforcement, including deportation and a border wall.\nNow, they say such things are evidence of Republicans’ bigotry and racism. Biden has presided over an open border that roughly 10 million people have illegally crossed. Every one of them has committed a crime by virtue of crossing in the first place. Many more commit further crimes once here, and that’s if they’re not taking jobs, housing, and other resources from Americans — often blacks.\nDemocrats are building a coalition of black and brown voters who hold grudges against white voters, all while Biden had the gall to make his Inaugural Address about “unity.” The common thread is the Marxist theory of oppressor and oppressed. According to this line of thinking (critical race theory), whites hold power and are, therefore, the oppressors. Minorities have been subjected to systemic abuse and oppression and are, therefore, entitled to … well, whatever is faddish at the time. Think reparations. That’s the same reason Hamas is “justified” in attacking Israel. A black man dying under the knee of a white man is the perfect metaphor for the Marxists.\nWhile Democrats divide us based on race and Marxist theory, justice is turned on its head, we’re all poorer for it, and too many innocent people lose their lives. Maybe it’s time to do things differently.\nFollow Nate Jackson on X/Twitter.\nExecutive News Summary\nDouglas Andrews, Thomas Gallatin, & Jordan Candler\nCross-Examination\nShameless Joe still can’t resist making it about himself: Memorial Day, of all days, should cause politicians to tremble and to behave meekly and speak humbly. And yet self-aggrandizing Joe Biden just can’t help himself. “Our losses are not the same,” he said at Arlington National Cemetery yesterday as he once again introduced his deceased son Beau to an audience that didn’t want to hear it. “He didn’t perish on the battlefield. He was a cancer victim from a consequence of being in the army in Iraq for a year next to a burn pit.” On he droned: “As it is for so many of you, the pain of his loss is with me every day as it is with you. Still sharp. Still clear. But so is the pride I feel in this service as if I can still hear him saying, ‘It’s my duty, Dad. It’s my duty. That was the code of my son. Live by the creed. All of you live by the creed.” It was shameful, it was vainglorious, and it was vintage Joe Biden.\n“Squad” members botch Memorial Day: Radical leftist House members Ilhan Omar and Cori Bush deleted Memorial Day posts after exposing their ignorance of the purpose of the annual observance. In a post on X, Bush wrote: “This #MemorialDay & every day, we honor our veterans in St. Louis. We must invest in universal health care, affordable housing, comprehensive mental health services, and educational & economic opportunities for our veterans as we work to build a world free of war and violence.” Omar echoed her comrade, likewise posting a list of Democrat priorities. The two embarrassingly conflated Memorial Day with Veterans Day. Hint to Omar and Bush: The purpose for the day is found in its name, “Memorial,” which remembers and honors those U.S. service members who gave their lives defending our great nation so that we can be free. Meanwhile, fellow “Squad” member Rashida Tlaib used Memorial Day weekend to trash Israel over its war against Hamas. Speaking at a conference that reportedly has ties to U.S.-designated Foreign Terrorist Organizations, she celebrated the International Court of Justice ruling that “the Israeli government must stop its invasion of Rafah.” She added, “But President Biden says what is happening to us is not a genocide. Where’s your red line, President Biden?” Tlaib might want to also learn the definitions of both “memorial” and “genocide.”\nBiden tampers with a witness: The president paid a friendly, fatherly visit to Hallie Biden on Sunday night, no doubt to see how she’s been doing since the death of her husband, Beau, nearly nine years ago. Interestingly, Hallie is one of 12 witnesses who are scheduled to testify in June in the Delaware gun trial of Joe Biden’s other son, his younger son, his wastrel son, Hunter, who also happens to be Hallie’s former lover. As Fox News reports, an October 23, 2018, police report “indicated that Hallie, who was in a relationship with Hunter at the time, threw a gun owned by Hunter Biden in a dumpster behind a market near a school.” Biden’s handlers, though, say that the visit had nothing to do with witness tampering or getting a story straight or considering the consequences of her testimony upon the freedom of Joe Biden’s son. Instead, they tell us, the visit was all about the upcoming ninth anniversary of Beau’s death.\nClosing arguments begin today in Trump case: “We’ll see how it goes. This is a very dangerous day for America. It’s a very sad day.” So said Donald Trump on his way into the Manhattan courthouse where he’s spent most of the last six weeks in a stinker of a trial still searching for a crime. As former federal prosecutor Andrew McCarthy said on Fox News this morning, “The most extraordinary thing I’ve ever seen in watching or trying criminal cases for decades is, we’re on the precipice of having summations here, and we still don’t have definity about what the crime is. … It’s like they’re making up a crime as they’re going along.” So, the crime is mysterious, and the case is weak. The Wall Street Journal’s editorial board members are no admirers of Trump, but they, too, know a bad argument when they see one. “The question is whether Manhattan District Attorney Alvin Bragg presented the evidence necessary for a conviction,” they write, “and if we were in the jury room, we’d say no.” Constitutional law professor Jonathan Turley concurs. “I would currently put a hung jury as the most likely outcome of the three outcomes,” he said. On the other hand, the groupthink mentality of an overwhelmingly anti-Trump jury can’t be discounted.\nA quarter of Border Patrol quit under Biden: More than 4,000 Border Patrol agents, or an astounding 25%, have left the agency since Joe Biden took office. The reason is that under Biden, the Border Patrol is effectively doing exactly the opposite job the agency is tasked to do, which is to secure the border and keep out those who have no right to be here. As one senior Border Patrol officer observed, “The administration is so bad for morale. I’m not trying to be political. I’m just speaking facts. It’s become so political. Catch and release is demoralizing for agents.” Furthermore, agents have become fearful of doing the job they signed up for two decades ago, as the political climate has made it difficult for them to do the job without the threat of politically motivated repercussions. Exhibit A of this reality is the border agents who were falsely accused of whipping illegal aliens who were rushing the border. Demoralization may be the word that most fittingly describes the overall impact Biden’s presidency has had on the nation.\nTax revenue down in 18 states: According to the Pew Charitable Trusts’ Financial 50 project, the long-term trend for tax revenue in each state is telling when it comes to red states versus blue states. The latest report found that an increasing number of states, led by California, are on a negative tax revenue trend. The report explains that “the 15-year linear trend of tax collections leading up to each quarter, after adjusting for inflation and seasonality,” is down. Pew’s report finds that a total of 18 states are now on a negative tax revenue trajectory, which is an increase from four from the previous quarter. Meanwhile, the Republican-led states of Texas and Florida are among 32 states whose tax collections outperformed their long-term trend. Tellingly, these states also have some of the lowest taxes, as both Texas and Florida do not levy a state income tax. They have been more business-friendly than California and New York in recent years, resulting in business growth and, in turn, tax revenue growth.\n“All-electric” firetruck has diesel engines: A perfect object lesson in the inherent limitations of current electric vehicle technology comes courtesy of New Mexico Democrat Governor Michelle Grisham, who recently touted Bernalillo County after it was awarded a $500,000 grant from the state’s Environmental Department for replacing its 1991 fire engine with an “all-electric” fire engine. When introducing the new truck, the fire chief even boasted, “There’s no cancer coming out of the tailpipe.” However, there is one huge caveat to this “green” story: The $1.8 million Pierce Volterra fire engine still uses diesel-powered engines to run its water pumps and back up its battery-powered motor. In other words, this fire engine is not an EV but a hybrid. It is not actually “all-electric” because, as an emergency vehicle, it must be reliable to respond quickly to a fire. It can’t sit around for hours waiting for the batteries to recharge, nor can it arrive at an emergency fire and run its water pumps, draining the batteries it needs to return to the firehouse. Even more ridiculous is the tax money being wasted on it, all for literally nothing more than “climate change” virtue signaling. Bernalillo County could have purchased a new standard diesel-powered fire engine for $600,000, which would have saved the taxpayers over a million dollars. To add to the irony, the grant money the state used came from the EPA via the 2005 Diesel Emissions Reduction Act.\nIsraeli airstrike kills “dozens” of civilians in Rafah: According to local health officials, at least 45 people were killed in airstrikes in the southern Gaza city of Rafah yesterday, “including displaced people living in tents that were engulfed by fire,” according to the Associated Press. It’ll be interesting to see how that number, 45, stands up, given that “local health officials” in Gaza are propagandists for Hamas and are thus as reliable as a used car salesman. In a war zone where one side goes to great lengths to avoid civilian casualties even as the other side hides among civilians and within hospitals, the margin of error for Israeli military personnel is practically nonexistent, even when they respond to Hamas missile attacks on Jewish cities. As CBS News reports, “The airstrike came hours after Hamas claimed it fired a barrage of rockets from Gaza toward central Israel as rocket sirens rang for the first time in months in cities like Tel Aviv.” Prime Minister Benjamin Netanyahu called the strike “a tragic mistake,” but that will likely fall on deaf ears. Look for the pro-Hamas crowd to renew their calls for a ceasefire.\nHeadlines\nAnti-abortion activist Mark Houck sues DOJ over “retaliatory” arrest (Washington Examiner)\nPete Buttigieg blames increase in extreme turbulence on climate change (PJ Media) | Mayor Pete struggled against friendly media to answer why he’s only built “7 or 8” EV charging stations out of the 500,000 he promised (Not the Bee)\nIran amasses larger stockpiles of enriched uranium (Daily Wire) | Biden opposing UK and France’s plans to rebuke Iran’s nuclear advances (Mirror)\nWashington Post reveals it passed on Alito flag story in 2021 (Fox News)\nHome insurance was once a “must”; now more homeowners are going without (Washington Post)\nCalifornia has yet to provide 1,200 tiny homes for state’s homeless that were promised in March 2023 (Fox News)\nDenali National Park official demands construction crews stop flying American flags during bridge construction (PM)\nLibertarian Party chooses Chase Oliver as presidential nominee (The Hill)\nHumor: Libertarian Party nominates giant gay bong (Babylon Bee)\nFor the Executive Summary archive, click here.\nDEI Is Killing Medicine\nUCLA Medical School is failing thanks to the DEI contagion spreading through its admissions department.\nThomas Gallatin\nIf the doctor you see is a recent graduate of UCLA Medical School, you may want to find a new one.\nA recent deep-dive article from The Washington Free Beacon reports on how the woke contagion of “diversity, equity, and inclusion” is killing UCLA’s David Geffen School of Medicine.\nUCLA’s medical school is one of the best in the world. Its curriculum is so rigorous and demanding that last year, just 173 out of some 14,000 applicants were accepted. A 3.8 GPA in difficult college courses and testing at or above the 88th percentile on the Medical College Admissions Test are prerequisites for even being considered.\nThe point is that UCLA Medical is supposed to be for the best of the best. But then, in 2020, a new dean of admissions, Jennifer Lucero, came in, and the school’s famously high standards began to slip. Lucero brought with her the DEI contagion. Racial considerations in admissions, which are explicitly banned by California law and which the U.S. Supreme Court ruled to be unconstitutional last year, became the name of the game.\nWith Lucero, the applicant’s race supersedes GPA and MCAT score. As a result of prioritizing DEI over and against ability and talent, the school’s standards have fallen. As a former admissions staffer observed, UCLA is now a “failed medical school,” adding, “We want racial diversity so badly, we’re willing to cut corners to get it.”\nAnother admissions committee member noted, “I have students on their rotation who don’t know anything. People get in, and they struggle.”\nA UCLA faculty member echoed that sentiment, telling the Free Beacon, “I wouldn’t normally talk to a reporter. But there’s no way to stop this without embarrassing the medical school.”\nAnd the data appears to back up these claims, as UCLA Medical’s place in U.S. News & World Report’s ranking for medical research has slipped from sixth place in 2020, prior to Lucero taking over, to 18th place. Even more troublingly, the Free Beacon reports that “more than 50 percent of students failed standardized tests on emergency medicine, family medicine, internal medicine, and pediatrics.”\nTo put this in perspective, just 5% of medical students nationwide fail these tests on average. And, tellingly, UCLA Medical’s recent rise in student testing failure coincides with a precipitous drop in the number of Asian students attending the school.\nOne faculty member laments that students have never been so badly prepared. “I don’t know how some of these students are going to be junior doctors. Faculty are seeing a shocking decline in knowledge of medical students.”\nThose in the know say the fault lies with DEI. “All the normal criteria for getting into medical school only apply to people of certain races,” one admissions officer stated. “For other people, those criteria are completely disregarded.”\nDEI at UCLA Medical has elevated racial identity above all else. Attempting to artificially make things “fair” when it comes to race or gender or any other arbitrary identity dynamic does not produce genuine justice. The problem of racism in the past was predicated on exclusion. Today’s woke racism is predicated on including people based on their racial makeup, irrespective of their ability and talent or lack thereof.\nWhat makes a good doctor has nothing to do with one’s race; it has everything to do with knowledge, talent, and abilities. UCLA Medical has chosen to reject this reality not only to its own reputational detriment but also to the danger of others who may find themselves looking to doctors who lack the knowledge and skills for the job.\nWhat Trump’s Massive Bronx Rally Means\nLast Thursday’s Trump rally in the deep-blue majority-minority Bronx challenged the Democrats’ stranglehold on the black and brown vote.\nDouglas Andrews\nImages show a remarkable scene: a Republican candidate speaking for 90 minutes to a huge and enthusiastic crowd of black, brown, and white people in the deepest blue of Democrat strongholds this side of Washington, DC.\nThis was Donald Trump in the South Bronx on Thursday. This was the rich old white guy dropping into the lion’s den to continue remaking the Republican electorate in a way that would’ve been unthinkable just a few years ago.\nWhen Trump beat the worst presidential candidate in modern American history in 2016, he did so with less than 10% of the vote in the Bronx. When he “lost” the rigged 2020 vote, his share of the Bronx vote practically doubled to 16%, but that still left nearly 84% of the vote for Joe Biden. We don’t have an accurate read on how the poorest of New York City’s five boroughs will vote in November, but it seems safe to say that Trump’s numbers will once again increase, and perhaps by a lot.\nTrump has grown his support among black and brown voters by appealing to their class, not their race. Trump, as improbable as it would seem for a Manhattan real estate tycoon, has become the champion of regular folks, of working-class folks, while Scranton Joe Biden and his fellow Democrats have become the best friends of the elites. Indeed, as we wrote nearly four years ago, the two political parties have done a switcheroo, and Trump can fairly be called the blue-collar billionaire.\nNotice how, on a late Thursday afternoon a few weeks ago, the 77-year-old Trump left his lawfare trial in leftist Judge Juan Merchan’s New York City courthouse not to recuperate at a fancy Manhattan restaurant but to deliver pizzas to FDNY’s Engine Co. 8, Ladder Co. 2 in Midtown. Notice how he went to East Palestine in the sleet and rain soon after the disastrous train derailment there, while Joe Biden stayed shamefully away for a full year. Notice how Trump goes to Detroit to press the flesh with autoworkers and rail against the ungodly expensive EVs that Biden is forcing into the marketplace even though nobody wants them, while Biden does a brief and tightly scripted PR stunt.\nRegular folks are starting to notice.\nThey notice, too, what the dominant issue is in this election: illegal immigration. They notice how Trump has always been on the right side of this issue. Now think about which group of Americans are harmed most by it: blacks. That’s because blacks hold a disproportionate percentage of downscale and unskilled jobs, and those jobs are the ones whose wages are being undercut by illegal immigrants. People who care about their hourly wages are becoming increasingly aware of the impact that illegal immigration is having on those wages. And, as is always the case, people will vote their wallets and pocketbooks. When James Carville said, “It’s the economy, stupid,” he knew what he was talking about.\nFinally, notice from the video footage how happy and at ease Trump looks at these events. Contrast that with the anger and paranoia of Biden’s brief and scripted campaign appearances. From this observation alone, it’s easy to tell which side is winning. As The Federalist’s Mollie Hemingway writes:\nTrump, who has the benefit of having already had one very successful term as president, acknowledges the very real economic, social, and foreign policies the country faces. But unlike Biden, his optimistic campaign speeches show a man who seems to love the country, love its cities, love its people, and want the country to return to health.\nWhether Biden’s race-baiting rhetoric or Trump’s unbridled multi-ethnic optimism will win the day remains to be seen. The speech in South Bronx showed how successful the latter can be.\n“Build the wall! Build the wall!” That was the predominant cry, along with “We love Trump!” during last week’s Bronx rally — a rally that the marketing-savvy Trump team said drew as many as 25,000 but that law enforcement said was probably closer to 10,000. The number doesn’t much matter. What does matter is that this was a lot more folks than Alexandria Ocasio-Cortez and her fellow Democrats would’ve wanted to see, especially given AOC’s snarky observation that God is good if He brings bad weather to Trump campaign rallies.\nTo be sure, the majority-minority borough isn’t likely to go for Trump in November, but the movement his campaign has seen in New York — Biden won the state by 23 points in 2020 but leads by only nine points now — is telling. It’s been 40 years since a Republican won New York. That was when Ronald Reagan swept 49 of the 50 states against Walter Mondale.\n“These millions and millions of people that are coming into our country,” said Trump to a notably black and brown audience, “the biggest impact, and the biggest negative impact, is against our black population and our Hispanic population, who are losing their jobs, losing their housing, losing everything they can lose.” That economic message should scare the daylights out of Joe Biden and his fellow Democrats.\nPolls aren’t votes, of course, and neither are rallies. But as The Wall Street Journal’s James Freeman observed on Fox News on Friday, “What you’re seeing here, I think, is the modern version of Reagan Democrats.”\nAnd what you’re seeing here is a coalition of voters that spells big trouble for the Democrats.\nThe End of College Athletics?\nA trio of legal settlements will funnel more money to college athletes and less money to the athletic departments that fund their activities.\nMichael Swartz\nThe world of college athletics reached a settlement in three separate but related lawsuits against the NCAA last week.\nThe filings complained that athletes whom the public was tuning in to watch weren’t getting a cut of the billions in TV rights being paid by the networks. Now, not only will 14,000 current and former college athletes share a $2.8 billion settlement, but student-athletes will also be paid for their efforts by the university. This is in addition to the NIL (name, image, and likeness) payments that college athletes have received for the past three years. As Steve Berman, who serves as lead attorney for one of the plaintiffs, put it, “This landmark settlement will bring college sports into the 21st century, with college athletes finally able to receive a fair share of the billions of dollars of revenue that they generate for their schools.”\nOur Brian Mark Weber was prescient several years ago in calling for the “shady tactics” involved in college athletics to be brought out of the shadows. But there are still a number of issues with the settlement — the largest of which is the burden it will place on the smaller-market “mid-major” conferences, who will pay for the NCAA settlement with a reduction in the revenue sharing that helps to fund their athletic departments.\n“We believe over 95% of the damages are going to go to Power Five [i.e. major conference] football and basketball players,” said Big Sky Conference Commissioner Tom Wistrcill, whose teams play football in the lower-tier Football Championship Series that used to be known as Division 1-AA. “For non-A5 conferences to pay for that is disproportionate. We’re asking for a more proportionate structure because our student-athletes are not going to see the money.”\nIndeed, the deal seems to be stacked in favor of the biggest conferences. As The Wall Street Journal notes, “The settlement agreement calls for schools to pay athletes 22% of the average annual athletic department revenue among schools in the top conferences. According to people familiar with the matter, that figure is roughly $20 million per school.” That figure, if true, would likely force the bottom-feeders out of the system unless it is adjusted accordingly for schools with lesser revenue, like the Ball States of the world.\nThis writer goes back to the days when the Big 10 actually had 10 schools and the NCAA basketball tournament had just 32 teams. Back then, the influence of money in college athletics was enough to get a team to forfeit games or even be banished for a season like Southern Methodist University’s football program was for the 1987 campaign. College athletes were compensated with free education, while non-athletes had to rely on academic scholarships, grants, or student loans.\nSo this settlement prompts several questions: Will athletes who get paid now have to compensate the university for their abortive education if they turn pro before they graduate? After all, they’re not only drawing a salary from the school for playing a (presumably) revenue-producing sport like football or basketball but also getting a scholarship that the class nerd who couldn’t pass a football or shoot a basketball is paying for with his student loans. (That is, unless they can convince Joe Biden to “forgive” theirs, too.) Or will it just be another excuse for tuition and fees to go up, saddling our awkward friend with even more student loan debt?\nAnd what about those who participate in non-revenue sports? One of the main lawsuits was initiated by a collegiate swimmer — certainly a talented athlete, but not one who commands the attention of millions of eyeballs. The Journal also brings up the specter of Title IX. Aside from basketball sensation Caitlin Clark, how many female athletes actually bring in revenue? And where is the female equivalent to football, whose revenues often help fund all the other sports?\nPerhaps this will become a fair settlement for the small percentage of elite athletes who actually find their way to Power Five schools to perform on Saturdays. “The settlement, though undesirable in many respects and promising only temporary stability, is necessary to avoid what would be the bankruptcy of college athletics,” said Notre Dame President Rev. John Jenkins. Unfortunately, this writer suspects that stability will be very temporary and will lead a lot of fine colleges to dismantle their athletic programs due to the additional expense of paying their players.\nPerhaps those schools will remember why they exist in the first place — as places of education. Of course, if they dismantle their DEI departments along the way, so much the better.\n‘Bad Therapy’: A Review\nAbigail Shrier’s latest book explores what is wrong with our kids and what we can do to help.\nEmmy Griffin\nAbigail Shrier, investigative reporter and author, first rose to national attention for her first book, Irreversible Damage: The Transgender Craze Seducing Our Daughters, which was her investigative deep dive into the transgender craze affecting our girls. Her second book, Bad Therapy: Why the Kids Aren’t Growing Up, delivers analysis that hits just as hard and is a tremendous read. Shrier’s incisive wit and writing acumen draw the reader in. It’s a book every parent should read.\nIatrogenesis — or when medical help, in fact, causes harm— is the framework on which Shrier sets her thesis. That thesis is: Our kids aren’t growing up because they have been convinced they aren’t capable. And that is the result of bad therapy. Many of today’s parents have been convinced that having a diagnosis for their children’s unwanted behaviors is how those behaviors eventually get solved, or at least provides an out. The child, on the other hand, when given a label and diagnosis, believes that he or she is sick and, by extension, incapable of change. Labels have power, and therapists are more than happy to dole them out.\nKids today are categorized by their limitations and victimhood status that comes with a mental health diagnosis instead of by their merit or achievements. This, in turn, makes kids seek a more severe diagnosis and sinks them ever further into the morass of rumination and self-fulfilling prophesy of the labels they take on.\nTrauma has also become a far too overused and abused term in our everyday language. Trauma is far too often used as a crutch for kids to get out of hard things. Therapists are also quick to turn to trauma as a ready explanation for why a kid is displaying mental illness. As Shrier points out, kids are resilient, and if therapists and parents stopped encouraging them to navel-gaze at their own feelings (which are transient), they are more likely to overcome difficult circumstances. She has several examples that illustrate this point much more elegantly than this author can articulate.\nTherapy language has even infiltrated schools. Wannabe therapist teachers are quick to issue a diagnosis based on classroom behaviors. They promote a social and emotional learning curriculum that also leads kids down the feelings quest rabbit hole, encouraging a self-“reflection” that often lingers on anything negative that happened to a child. It weaponizes experiences and uses them as “teachable moments” for the rest of the class, all with the goal of teaching them empathy. It does the opposite. It creates mercenary monsters who will keep any amount of blackmail they can on their “friends” and peers in case they need to use it later.\nMany parents also allow their children to be too involved with screens. Personal screens like the iPad or a smartphone are a twofold evil. First, the very addictive nature of what’s on the screen lures kids away from actually living and being kids. They are all too happy to allow the sedative screen time to waste hours of their time. Second, screens distract kids from making meaningful social connections and mastering poor behaviors. Screens also harm their attention span, motor skills, and so much more. The infuriating aspect is that many parents continue to let their kids marinate in digital prisons that are doing them no good.\nThen there’s what’s on the screens. Social media influencers, peers, and tele-therapists are all conspiring to help your vulnerable child self-diagnose. These bad influences turn any normal behavior or interaction into a label that the child takes on as an identity.\nFinally, and most insidiously, bad therapy has usurped parental authority and power. Mothers and fathers are encouraged to “gentle parent” by childless academics who treat children like equals — i.e., their every feeling or whim should be worthy of consideration and deliberation. This actually has the effect of making children more unsure. Depriving a child of authoritative (not authoritarian) parents — ones who are in charge but still show them love — makes the child an ill-behaved tyrant.\nParents in our society also have the added disadvantage of living in a culture that blames them for any wrongdoing of their children. When a child misbehaved in public in the olden days, adults usually gave the child disapproving looks, and by the sheer weight of public disapproval, that child learned what was acceptable or not acceptable in public. Parents today are so scared of being the reason their child is messed up that they are quick to relinquish their authority to hack therapists.\nParents have been fed therapeutic language to parrot to their children, focusing on feelings. Then there’s the issue of parents sending their children to therapists at the drop of a hat. This sends the message to the child that his or her parents are incapable of fixing the tremendous mess that is their child. Frankly, for all but the most severe of mental health issues, parents can, by being in a relationship with their children, help them work through whatever feeling is troubling them. If parents are intentional, they will see a marked improvement in their child’s well-being.\nBad therapy has created a generation of kids who feel too broken, too risk-averse, and too self-focused. They aren’t growing up, aren’t forming real meaningful relationships, and aren’t ready for the unpredictability of life’s twists and turns. This needs to change.\nShrier’s book was empowering to read as a parent because she gives parents the tools to take back their authority from the “experts.” At the same time, it is also convicting. The very language that we use to talk to our children, the way that schools are a deep and abiding part of the iatrogenesis problem, and our desperate fear of failing as parents are very real issues. Bad Therapy will open your eyes to what has been taken from our kids and hopefully will encourage us all to let them be kids again — and in letting them be kids, help them be brave enough to become adults.\nVIDEOS\nThe Fallen Soldier — Others have made the ultimate sacrifice so that you could be free. Remember them — today and always.\nWoke ‘Squad’ Members Embarrassed After Ignorant Memorial Day Tweets — Ilhan Omar and Cori Bush posted and then deleted tweets on Memorial Day that called for providing support and services to America’s military veterans.\nNo, Inflation Wasn’t Caused by ‘Corporate Greed’ — Despite the propaganda, the Federal Reserve Bank of San Francisco has published research to show that corporate greed did not cause inflation.\nWill China’s EV Dominance Slow Down After 100% Tariffs? — Patrick Bet-David explains how this could be the beginning of a new Cold War between China and the United States.\nAMC Places Trigger Warning on ‘Goodfellas’ — Apparently, AMC was concerned the violent antics of Robert De Niro and Joe Pesci would offend those viewers who wish to include and tolerate Italian Americans.\nDisney Cancels Tinkerbell — Disney has now decided to discontinue meet-and-greets with Tinkerbell at Disney World after labeling the beloved Peter Pan character as “problematic.”\nBEST OF RIGHT OPINION\nFor more of today’s columns, visit Right Opinion.\nSHORT CUTS\nJordan Candler\nDumb & Dumber\n“This #MemorialDay & every day, we honor our veterans in St. Louis. We must invest in universal health care, affordable housing, comprehensive mental health services, and educational & economic opportunities for our veterans as we work to build a world free of war and violence.” —Congresswoman Cori Bush (D-MO)\n“On #MemorialDay, we honor the heroic men and women who served our country. We owe them more than our gratitude — they have more than earned access to quality mental health services, job opportunities, housing assistance, and the benefits they were promised.” —Congresswoman Ilhan Omar (D-MN)\nThe duo ultimately removed the posts, which conflated Memorial Day with Veterans Day.\nTone-Deaf\n“In America, we leave no veteran behind.” —Joe Biden (“Spoken just like a man who has never served our nation.” —Mark Alexander)\nBaghdad Bob\n“We’re talking about folks who are in [student] debt who are literally being crushed.” —White House Press Secretary Karine Jean-Pierre (“For the record, nobody is ‘literally being crushed’ by student debt, and because that debt is mostly held by higher-income individuals, they are not being figuratively crushed either.” —Mark Alexander)\nYellow Journalism\n“President Ebrahim Raisi’s mixed legacy in Iran.” —BBC (“Ebrahim Raisi’s nickname was the ‘Butcher of Tehran’ as a result of his mass murder and brutal torture of political dissidents.” —X/Twitter Community Note)\nPolitical Futures\n“The people who make up the political left are not necessarily motivated by a particular person. They are voting based on identity and ideology. You could run a dead man (in some ways, Biden is a dead man walking), and leftists would vote for the corpse. That’s why they are so committed to the ‘manufacturing approach’ to elections. It’s not winning hearts and minds. It’s simply having massive data on every last person who identifies in any way with the left and then churning out votes like a conveyor belt.” —Gary Bauer\n“If Biden loses, he’ll go down in history as the president who was so bad he made people nostalgic for Trump.” —Frank J. Fleming\n“I doubt he will even be running, frankly. I just can’t even imagine it.” —Donald Trump on Joe Biden\n“[Kamala] Harris may well be the only Democrat in Washington, D.C., less popular than Uncle Joe himself. The dimwitted cackler-in-chief is about as popular these days as venereal disease.” —Josh Hammer\nFor the Record\n“Democrats need to delegitimize the Supreme Court so they can eventually pack it with loyal leftists. Keep that in mind every time they attack Clarence Thomas over a vacation or Samuel Alito over a flag.” —Nate Jackson\nFollow Jordan Candler on X/Twitter.\nTODAY’S MEME\nFor more of today’s memes, visit the Memesters Union.\nTODAY’S CARTOON\nFor more of today’s cartoons, visit the Cartoons archive.\nPlease join us in prayer for our nation — that righteous leaders would rise and prevail and we would be united as Americans. Pray also for the protection of our Military Patriots, Veterans, First Responders, and their families. Please lift up your Patriot team and our mission to support and defend our Republic’s Founding Principle of Liberty, that the fires of freedom would be ignited in the hearts and minds of our countrymen.\nThank you for supporting our nation’s premier online journal of Liberty.\nSemper Vigilans Fortis Paratus et Fidelis",
  "word_count": 6668,
  "scraped_at": "2026-02-14T14:13:19.070594"
}