{
  "article_id": "33e003af7f2f",
  "url": "https://www.aljazeera.com/features/2023/12/30/taylor-swift-and-the-strange-power-of",
  "title": "Taylor Swift and the strange power of  Swiftonomic | Business and Economy",
  "date": "20231230T133000Z",
  "domain": "aljazeera.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Taylor Swift and the strange power of ‘Swiftonomics’\nHer Seattle concert caused a small earthquake and world leaders vie for her attention: what drives the Taylor Swift Effect?\nWhen Chris Galvin was searching for Taylor Swift tickets for his 13-year-old daughter, Lily, last summer, the best he could find was a pair for $2,000 plus a spot in a parking lot 10 minutes’ walk from the concert for nearly $500.\nThat was for the concert closest to their home – the Levi’s Stadium in Santa Clara, a Silicon Valley city located in the San Francisco Bay Area – where Swift performed at the end of July.\nGalvin hadn’t moved fast enough to find cheaper tickets. Before they had even become available to buy, the shows were so highly anticipated that the city announced in a news release that it would temporarily change its name to “Swiftie Clara”. Swift was even named Honorary Mayor during her visit.\nAfter reaching out to his social media networks and shelling out $500 including fees, Galvin was able to secure two last-minute tickets to an early August performance at SoFi Stadium in Inglewood, a city in Los Angeles County more than 560km (350 miles) from his home.\nGalvin surprised his daughter with the news that they were going to LA a few days before the event.\n“The road trip, standing in line for merchandise, and the overall experience turned out to be a lot of fun,” he says. “I’ll never forget sharing that experience with her. It was so cool to see her singing, dancing and just in awe for her first real concert.”\nNow a music tech executive, Galvin was a professional DJ in Southern California during the 1990s. Though Swift’s music isn’t similar to what he played at underground raves, he says the atmosphere at Swift’s SoFi Stadium show was reminiscent of the PLUR (peace, love, unity, respect) ethos of the old-school rave scene in Los Angeles.\n“The positive vibe was incredible,” Galvin says. “Random Swifties would simply walk up to Lily, strike up a conversation, and ask if she wanted to trade [friendship] bracelets.”\nHis daughter made some lasting relationships, and mothers of young fans gave him several rave-reminiscent friendship bracelets, with phrases like “Swiftie Dad” spelled out in beads.\nFriendship bracelets are a big thing among Swifties. Fans started trading friendship bracelets after she sang about them in You’re on Your Own, Kid on her 2022 album, Midnights: “Cause there were pages turned with the bridges burned / Everything you lose is a step you take / So make the friendship bracelets, take the moment and taste it / You’ve got no reason to be afraid.”\nSwift mania\nBut what is now known as the Taylor Swift Effect runs far beyond a craze for friendship bracelets. The six shows she performed at SoFi, where Galvin and his daughter went to watch her, generated an estimated $320m in tourism revenues, taxes and extra jobs for Los Angeles County, according to a special report by the Center for Jobs.\nThe “Swiftonomics” effect has caused countries to vie for her attention. When the initial list of tour dates was published in June 2023 with no mention of Canada, Canadian Members of Parliament filed a complaint with the Speaker of the House of Commons calling it a “snub”. Prime Minister Justin Trudeau hurriedly issued an invitation and, a month later, six dates for Toronto and three for Vancouver were added to the list of international tour dates for 2024.\nSwift has also received invitations from the president of Chile, the mayor of Budapest and the leader of an opposition party in Thailand. New Zealand’s finance minister, Grant Robertson, bowed out of the contest to attract Swift, saying he couldn’t afford to invest public money on a marketing campaign.\nIt’s little wonder that Swift was named Person of the Year for 2023 by Time Magazine.\nThe rise of Taylor Swift has been astronomical and is a story that resonates strongly with teenage admirers, though fans of all ages consider themselves to be “Swifties”. The 34-year-old was born in Pennsylvania and moved to Nashville, Tennessee, with aspirations for the country music scene at the age of 14. She released her debut album at 16 in 2006.\nThat first album was a hit on both the Top Country Albums (where it spent 24 weeks at number one) and on the Billboard 200, where it peaked at number five and hung out on the pop chart for 284 weeks – almost five and a half years. She remained more prominently in the country music world for several years until she released 1989, her first overtly pop album, in 2014.\nSomehow, fans seem to identify strongly with Swift’s well-documented struggles in love, using her songs to get through their own challenging experiences; others particularly admire her shift from country to mainstream pop music on her own terms. Young women say they grew up feeling inspired by a woman who set new standards for herself and others in business that has set a lasting impression of self-empowerment.\n“I find it cool and powerful that she can re-record all of her old albums and encourage her fans to listen,” says Lily Galvin. “It shows her strength and independence as a woman and artist. I also like how she serves as a role model for so many people. Plus, she creates great music and seems like a really nice person.”\nTaking back control\nIndeed, it is Swift’s business prowess, which includes the re-recording of her first six albums in order to take back control of the master recordings, which has made her an intergenerational inspiration for women both within and outside of the music industry.\nIn 2019, her former record label, Big Machine Records, owned the masters of the original albums and its owner sold them to a publishing company founded by Scooter Braun, a former music manager for Justin Bieber and Kanye West, whom Swift claimed bullied her on several occasions in her career. So, she re-recorded them all.\n“Like when Kim Kardashian orchestrated an illegally recorded snippet of a phone call to be leaked and then Scooter got his two clients together to bully me online about it,” she explained in a 2019 Tumblr post.\n“Or when his client, Kanye West, organised a revenge porn music video which strips my body naked. Now Scooter has stripped me of my life’s work, that I wasn’t given an opportunity to buy. Essentially, my musical legacy is about to lie in the hands of someone who tried to dismantle it.”\nIn the Tumblr missive, Swift told her fans that the new Taylor’s Version albums would be the “healthier option” to buy. She cautioned other artists to make sure they protect their personal rights before they sign any contracts that are not in their best interests – like her early recording deal, which didn’t give her ownership of her own catalogue.\n“Thankfully, I am now signed to a label that believes I should own anything I create,” she wrote. “And hopefully, young artists or kids with musical dreams will read this and learn about how to better protect themselves in a negotiation. You deserve to own the art you make.”\nAn economic phenomenon\nThe international leg of Taylor Swift’s The Eras Tour returns in February with a four-night run at the Tokyo Dome in Japan and, as of this writing, will conclude with three nights in Vancouver, British Columbia in early December 2024.\nPollstar estimates that the Eras Tour has already grossed more than $1bn after just 60 shows and 4.35 million tickets sold, breaking a record previously held by Elton John’s Farewell Yellow Brick Road Tour, which took place over 328 performances between 2018 and 2023 and generated $939m.\nThat’s an exponential difference in terms of the number of shows each artist needed to perform. Ticket sales from Swift’s 2024 performances are expected to gross another $1bn. Taylor Swift: The Eras Tour concert film cost $15m to produce and passed $250m in global sales in November to become the top-grossing concert film of all time, according to The Hollywood Reporter.\nAs the Eras Tour continues its schedule of concerts around the world in the new year, Swift is likely to continue to generate more money than the gross domestic product (GDP) of several countries.\nThe fascination surrounding this has not been confined to music industry commentators and the tabloids. The Washington Post used World Bank data to report that she made more than the annual economic output of 42 nations in 2022.\nThe Economist took it one step further and conducted an investigation of the 2023 tours by Swift and fellow global pop star and friend Beyoncé to see if they were spurring inflation (conclusion: they weren’t).\nIn fact, only sporting events tend to boost ancillary spending around major events, economists say. But of course, Swift’s got something to do with giving sports a boost, too – American football, at least. Her budding romantic relationship with Kansas City Chiefs tight end Travis Kelce has boosted televised views for the NFL in the US since she began attending games in September.\nAccording to Nielsen data, TV ratings for the October 1 Chiefs game against the New York Jets that aired on Sunday Night Football were the second-highest they’ve been all season at 27 million views, a figure bested only by last February’s Super Bowl. Viewing from women and girls aged from 12 to 35 shot up significantly, particularly in the 12-17 age group.\nIt seems that Swift’s fans are tuning into Chiefs games en masse with hopes of catching Swift watching from a skybox.\nPerfect timing\n“Taylor Swift has perfectly timed her concerts to a period where peak consumer spending and peak employment rates are really a substantial qualifier of our current economy. Six months from now, we likely aren’t going to see tours of this magnitude,” Frances Donald, Manulife Investment Management’s chief economist and a self-confessed Swiftie, told CBC in June 2023. She added that the enthusiasm people feel for being able to gather and celebrate in this way since the restrictions of the COVID-19 pandemic will run its course.\nFor corporations, politicians, governments and celebrities alike, touting a connection with Swift, however tenuous, has become a popular marketing and clout-generating tool in both social and traditional media.\n“Are you a Swiftie?” asked NASA in an Instagram post in October 2022. “We are too!” a rep for the US space agency continued, before describing an extreme rotating neutron star captured by its Neil Gehrels Swift Observatory telescope.\nSwift has yet to have a constellation named after her but, back on planet Earth, a Seattle concert set a new record for seismic activity when her dancing fans caused the equivalent of a magnitude 2.3 earthquake at the Lumen Field stadium, which holds 70,000 people.\nShe has even been cited in the naming of a new species. In findings published in April 2022 by ZooKeys, entomologist Derek Hennen identified a previously undocumented arthropod and called it Nannaria swiftae, with a vernacular name of the Swift twisted-claw millipede.\nHennen was reported saying Swift’s music had alleviated “some rough times” in his life, and that he played her music during a 17-state quest to find undiscovered millipedes. The chestnut brown and orange Nannaria swiftae, he wrote, was discovered among “mesic forests with hemlock, maple, oak, tulip tree, witch hazel, and pine” at Fall Creek Falls State Park in Tennessee and in three counties in the state. Hennen named it in recognition of Swift’s “talent as a songwriter and performer and in appreciation of the enjoyment her music has brought [to me]”.\nThough Swift’s full global economic (and seismic) impact may have yet to be accurately measured and explained, her vast cultural influence is easier to see, especially in the United States.\nA vinyl sensation\nAccording to Billboard, Swift’s Midnights was the number one album of 2022 in all formats in the United States. Her 10th studio album was one of every 25 of the more than 41 million vinyl records sold in the US that year, and it was not even released until the end of October.\nData from the Recording Industry Association of America (RIAA) shows that 41 million represents more vinyl albums sold than compact discs (CDs) for the first time since 1987, but still short of the 300-plus million vinyl records sold annually in the US in the late 1970s when they were at their most popular.\nIn the UK, vinyl sales rose by 11.7 percent to 5.9 million in 2023, according to British Phonographic Industry figures released at the end of December. Swift’s 1989 (Taylor’s Version) was the best-selling LP.\n“One of the biggest impacts we’ve seen as a result of Taylor’s vinyl releases is a growth in the number of young women who are really getting into vinyl collecting,” says Caren Kelleher, founder and president of Gold Rush Vinyl.\n“I’ve been blown away by how many young music fans are finding us on TikTok and will write to us and say they started collecting because of Taylor Swift. Choosing to spend your money on a new vinyl record – especially a limited edition one – sends the signal that you are not a casual fan: you’re a super fan. Artists of all popularity levels are seeing vinyl as a way to get creative in serving those fans.”\nA digital copy of Midnights costs $11.99 in the US iTunes store; fans can spend a few extra dollars to get other editions such as the 3am Edition or The Til Dawn Edition with some added rare tracks. By comparison, vinyl copies, which come in four different colour schemes, average $32.99 at the online record shops that may still stock a copy or two, while a set of all four currently retails for $178.99 on Amazon.\nBased in Austin, Texas, Kelleher’s independent vinyl record pressing plant has seen an overall boost that she can attribute, indirectly at least, to Swift.\n“With top artists like Taylor producing so much vinyl at large plants, we’re happy that more artists and labels are finding their way to Gold Rush Vinyl, especially those who otherwise press in Canada and Europe, where the bulk of Taylor’s vinyl is made. The increased cost of doing business abroad is also sending more business back to America, which benefits our team.”\n‘One of the most successful CEOs in the world’\nKelleher says she’s been a Swiftie since the release of the star’s second album – 2008’s Fearless. There was a time when she worried that she had outgrown Swift’s music, but then Folklore dropped in 2020. Both albums are considered successes relative to the year they were released, but look quite different in terms of physical sales.\nFearless received a rare Diamond certification from the Recording Industry Association of America (RIAA) for sales of more than 10 million in the US, with 11 weeks at number one on the Billboard 200 chart at a time when streaming numbers weren’t included. Folklore was certified 2x Platinum for selling more than two million copies and has been recognised in the Guinness Book of World Records for earning the most one-day streams of an album on Spotify (female), with 80.6m streams in 24 hours.\n“It only deepened my admiration for not only her songwriting skills, but her business acumen,” Kelleher says. “I’ve always found it refreshing that the business of Taylor Swift seems to come truly from what she wants to do, not what’s in the traditional music industry playbook. She’s one of the most successful CEOs in the world.”\nA field of study\nInterest in the cultural phenomenon of Taylor Swift has reached the hallowed halls of academia. Her lyrics, storytelling and societal influence are all growing fields of study at universities across the United States. Schools teaching Taylor Swift sessions include Harvard, Stanford and New York University, which presented her with an honorary doctorate in fine arts last year.\nIn the coming spring, the Haas School of Business at the University of California, Berkeley will begin offering a graduate, student-led course called Artistry and Entrepreneurship: Taylor’s Version.\nStudent-led courses on contemporary artists tend to fill up instantly and draw large waiting lists. For example, NBC reported that registration for the University of Florida’s upcoming spring course Musical Storytelling with Taylor Swift and Other Iconic Female Artists, which will look for parallels between her work and the discographies of artists like Aretha Franklin, Billie Holiday and Dolly Parton, filled up in 10 seconds.\nSwift also became the subject of academic conferences this year, joining the ranks of acts such as the Beatles, Elvis Presley and Tupac Shakur, who have all had full scholarly events dedicated to them.\nIn November, Indiana University’s Bloomington campus launched what purported to be the first international academic gathering to study the star, called Taylor Swift: The Conference Era. More than 1,000 people attended panels such as Taylor as an Anti-Hero, Tour Economy and Crowd Culture, and Feminism and Capitalism over two days. Similarly, an inaugural “Swiftposium” is planned at the University of Melbourne in February.\nIn Indiana, students, teachers and civilians alike mingled with scholars and culture theorists like Gina Arnold, an adjunct professor of rhetoric at the University of San Francisco, who was invited to be a keynote speaker after co-editing a 2021 issue of Contemporary Music Review dedicated to Swift.\n“Taylor Swift is a great subject for academics because her mere existence touches on so many disciplines,” Arnold explains. “Music, media studies, women’s studies, queer theory, business, economics, film, literature – you can approach her work from any of these angles and find something to say.\n“This is true of a lot of acts, actually, since to be a pop star these days requires that a person be adept at a multiplicity of topics like film, video, music, business and technology. But Taylor is the biggest and therefore easiest to study. And unlike, say, the Rolling Stones or U2 or other giant acts, she is actually of interest to college-aged students. Hence, academic interest.”\nA feminist in the eye of the beholder\nKelleher at Gold Rush Vinyl thinks that Swift is good at averting the pervasive pressure for businesswomen in the US to employ aggressiveness or other traditionally masculine traits to get ahead in work. In her view, this makes her a good feminist role model.\n“I appreciate that Taylor Swift’s brand of feminism is one in which being a smart, empowered and successful woman means you don’t have to have all sharp edges,” she says. “You can sing songs about heartache, hope, and friendship bracelets and still make it at the top.”\nBut Arnold, who has written books about music festivals, Nirvana and Liz Phair, and is a co-editor of the 2023 anthology The Life, Death, and Afterlife of the Record Store: A Global History, says she doesn’t “see Swift as a feminist, exactly”.\n“She is more like her idol, Dolly Parton, who if asked if she’s a feminist says, ‘No, I’d describe myself as a businesswoman’,” says Arnold. “I love how Dolly sees those things as very different – it says so much. And it is so incredibly difficult to make it as a businesswoman in America, at least at those heady levels, that it pretty much doubles as being a feminist.\n“I think Taylor is a feminist in that she is a role model for young women as far as what heights they can scale. It should be noted that if Taylor Swift is feminist, she is a very white one – not intersectional. But that’s valid.”\nKelleher notes that Swift’s take on storytelling helps her bond with her friends, who like to discuss the intricacies of her lyrics and music: “Particularly this year with the Eras Tour and the re-releases, Taylor’s music has strengthened my relationships with so many friends who also love her music – even if it’s just by giving us more reasons to text one another and share reactions to new songs.”\nJust as the US dates that Swift performed in 2023 did, her international concerts in the new year are expected to roll in another billion dollars and draw fans of all ages, with plenty of enthusiasm for and money to spend on trips and outings to see the entertainer. Fans think the experience is more than worthwhile.\n“Going to Taylor Swift’s concert was amazing!” says Lily Galvin, the California teen whose favourite songs are Betty from Folklore and Is It Over Now? from 1989 (Taylor’s Version).\n“She’s so amazing. The show was so well produced, the stage was so cool and huge, the other people in the audience were so fun, and I loved all of the dancers. The sound was amazing. I thought it was such a vibe when she played the piano. Low-key fire.\n“Also, I felt like you could just be yourself and be accepted for who you are, no matter what, because we all like Taylor Swift.”",
  "word_count": 3501,
  "scraped_at": "2026-02-14T14:08:02.647085"
}