{
  "article_id": "33f0aed90863",
  "url": "https://www.90min.com/features/4-things-we-learned-england-frustrating-defeat-germany",
  "title": "4 things we learned from England frustrating defeat to Germany",
  "date": "20241029T180000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "4 things we learned from England’s frustrating defeat to Germany\n- England suffered a 4-3 loss at the hands of Germany on Friday night\n- Georgia Stanway and Lucy Bronze were among the goals for the Lionesses\n- Sarina Wiegman’s side will face South Africa in another friendly on Tuesday\nThe first international break of the 2024/25 season is well underway, but things didn’t quite go to plan for England as they suffered a 4-3 loss at the hands of Germany on Friday night.\nIn a repeat of the Euro 2022 final, this time it was the visitors who delivered a hammer blow. Less than five minutes into the game, England were punished for some lacklustre passing and defending as Millie Bright conceded a penalty that was comfortably converted by Giulia Gwinn.\nThe Bayern Munich star then scored her second less than ten minutes later, and Klara Buhl added a third on the half-hour mark. Georgia Stanway scored twice before half-time to reduce the deficit, but Sara Dabritz converted Germany’s second penalty of the game to make it 4-2 with a little under 20 minutes left to play.\nLucy Bronze added a third for England in the dying stages, but it was a mere consolation as they failed to find the all-important equaliser. It was a disappointing night overall for the Lionesses, but there are plenty of learnings to take into the final few friendlies of the year, starting with South Africa on Tuesday night.\nHere are four key learnings from Friday night’s defeat against Germany.\nA defence in crisis\nUnder Sarina Wiegman, England have often been praised for their defensive resilience, and the formidable partnership of Leah Williamson and Bright was one of the driving forces behind their Euros triumph two years ago. However, the defending against Germany on Friday was a far cry from what we’ve come to expect from this team.\nThe best example of England’s woes was the build-up to the visitor’s second goal. Buhl was able to pick out Gwinn’s run with a fantastic cross-field pass, and the 25-year-old was in acres of space as the back line was so narrow. With all the time in the world, she was able to pick out the bottom corner and double Germany’s advantage.\nEngland gained some control in the second half, but still looked frantic at times. The scoreline could have been much worse if not for some haphazard finishing and last-ditch defending.\nRusso thriving away from Arsenal\nOne of the key questions heading into this camp was whether Alessia Russo would keep her place in the starting lineup. She hasn’t had a strong start to the season for Arsenal with little impact in front of goal.\nHowever, she was Wiegman’s favoured option to lead the line against Germany. While she didn’t get on the scoresheet, Russo, along with Lauren Hemp, was the focal point of the forward line, and she seemed to play with a renewed sense of confidence.\nStrikers are ultimately judged on the number of goals scored, but Wiegman will be delighted to know the upheaval at Arsenal hasn’t had a negative impact on Russo’s form for her country. If she gets the nod against South Africa on Tuesday night, the 25-year-old will hope to back up her overall play with goal contributions.\nHampton edges ahead in goalkeeper race\nAnother key selection issue was the goalkeeper. The battle for the no.1 shirt has ramped up over the summer as Hannah Hampton’s form for Chelsea forced her into the conversation alongside Mary Earps.\nFor some time, the former Manchester United shot stopper has been England’s undisputed starter. However, the scale is starting to shift, and Wiegman will have a big decision to make ahead of the Euros next summer.\nThe fact Hampton was trusted for the game against Germany suggests she may well be the favoured choice. Either way, Earps faces a significant battle on her hands if she’s to wrestle back the shirt, and that will start with keeping her place at Paris Saint-Germain.\nSquad rotation is needed\nWith three games left of the calendar year, time is running out ahead of the Euros next summer. While it is understandable Wiegman will want to stick with her most trusted players, it’s fair to say fresh faces are needed in some areas of the pitch.\nThe big challenge for the manager will be finding the right balance of youth and experience as the team gears up for another major tournament. England have plenty of talent within their ranks, and the way Russo and Ella Toone broke through at the last Euros should be the blueprint for what is needed next summer.\nWhether it’s Jess Park, Grace Clinton, Jess Naz or Aggie Beever-Jones, the talent is there. Every single one of those players is capable of making an impact, and potentially displacing one of the current starters.",
  "word_count": 811,
  "scraped_at": "2026-02-14T13:05:29.188362"
}