{
  "article_id": "3436dafc012a",
  "url": "https://www.thenationalnews.com/business/economy/2025/09/11/egypts-prime-minister-says-worst-has-passed-on-external-debt-as-inflation-hits-three-year-low/",
  "title": "Egypt Prime Minister says worst has passed on external debt as inflation hits three - year low",
  "date": "20250911T100000Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Egyptian Prime Minister Mostafa Madbouly reassured the public that “the worst has passed” with regard to the country’s record high external debts, while record inflation figures have also started to ease.\nConsumer prices fell last month, with the inflation level at 12 per cent, down from 13.9 per cent in July. The rate in August was the lowest since March 2022.\nMr Madbouly also highlighted the government’s efforts to bring down the debt-to-GDP ratio to 80 per cent next year, down from a peak of about 97 per cent during the 2023-2024 financial year. The ratio of external debts to gross domestic product fell to 85 per cent during the 2024-2025 fiscal year, he said.\nThe drop in Egypt's inflation last month came as declines in the prices of meat, poultry and fruits partially offset cost increases for several key goods, including vegetables, dairy products, eggs and household appliances.\nThe country's strengthening pound helped reduce costs in the import-reliant economy, according to Japanese bank MUFG in a report on Thursday.\n“The currency, which lost nearly 40 per cent in March 2024, has since rebounded to around 48 per dollar, its strongest in 14 months, supported by foreign inflows, tourism and exports,” it said.\nThe downwards trend in the country’s inflation rate since September 2023 – when it peaked at 38 per cent – has also prompted the Central Bank of Egypt to cut interest rates three times this year after maintaining a tight monetary policy to cool off the economy.\nThe latest cut was two weeks ago when the bank reduced its overnight lending rate by 200 basis points. The prior cut, in May, slashed rates by 100 basis points. This followed an April reduction of 200 basis points.\nA tight monetary policy was one of the International Monetary Fund’s conditions when it agreed to lend Egypt $8 billion over four years last year.\nThe country’s industrialists had been bemoaning the high interest rates because they limited borrowing from banks for operational costs.\nThis consequently resulted in a decrease in production output as many sectors including construction slowed significantly.\nHowever, Mr Madbouly said that the country recorded an increase in exports by about 20 per cent compared to the previous year, a change which he attributed to improving economic conditions.\nHe said that lower interest rates enable the repayment of debts because of lower service fees but that the decision to increase or decrease them was not in his government’s purview and was entirely up to the central bank’s monetary policy committee.\nWhile highlighting the drop in Egypt's annual urban consumer price inflation, some economists noted that this metric reflects price changes in urban areas only, which account for 44.4 per cent of Egyptian households, according to a Capmas report earlier this year. Rural inflation, which affects the remaining 55.6 per cent of households, is not captured in this figure and may show a different trend.\nLooking ahead, with inflation pressures easing and the central bank already cutting rates by 525 basis points this year, further monetary easing remains likely, though potential fuel price rises could temper such moves, MUFG said.\nHowever, Mr Madbouly has said that another hike in electricity prices was not in the government's plan for now.",
  "word_count": 540,
  "scraped_at": "2026-02-14T12:12:11.160018"
}