{
  "article_id": "34a079578f11",
  "url": "https://www.thenationalnews.com/news/mena/2025/11/01/israel-believes-hezbollah-is-rearming-says-us-envoy-tom-barrack/",
  "title": "Israel believes Hezbollah is rearming , says US envoy Tom Barrack",
  "date": "20251101T173000Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Israel has intelligence that Lebanon’s Hezbollah is rearming, US special envoy Tom Barrack told The National on Saturday, as the Israeli military rains down near-daily strikes in Lebanon despite a ceasefire reached last year.\nIsrael also maintains a presence at five points it deems strategic in the south of the country, in violation of the agreement. Its operations in southern and eastern Lebanon have recently intensified. This week, the Israeli army raided a southern Lebanese town and killed a man who was sleeping in the municipal building.\n“Israel's view is that Hezbollah is rearming. And that's why it's impossible when Lebanon is saying we want Israel to withdraw from the five points,\" said Mr Barrack, speaking to The National during the IISS Manama Dialogue in Bahrain. \"That's what the Lebanese have been asking for, to have a ceasefire and have Israel withdraw.\n“Israel's point of view is … that Hezbollah is actually rebuilding all the way along the Bekaa [Valley],” he added. “There's a disagreement between the Lebanese, the LAF [Lebanese Armed Forces] and Israel [on this point]. This is the problem.\"\nMr Barrack emphasised that the US is not providing its own intelligence but serving as an intermediary. “Who's right? We're not gleaning our own intelligence; we're just an interpreter,” he said. “The US has been trying to be an intermediary for Lebanon, because it will not talk [to Israel].”\nBeirut is under intense pressure from Washington to disarm Iran-backed Hezbollah and reassert state sovereignty using its army. Mr Barrack said earlier this month that Lebanon's slow progress could lead Israel to “act unilaterally” and launch yet another war on the country.\nHezbollah has repeatedly said it will not disarm while Israeli troops remain in Lebanon, warning that any disarmament would weaken the country’s defences. The group was severely weakened during its latest war with Israel. It has also voiced support for a greater role to be played by Lebanon's army in defending its borders.\nThe Lebanese government has reaffirmed its commitment to bringing all weapons under state control, while acknowledging the difficulties and sensitivities involved.\nPresident Joseph Aoun has said that Beirut is ready for indirect negotiations with Israel. Mr Barrack, however, stressed that direct talks between the two countries were necessary.\n“It's simple. Lebanon can do what it wants to do. The path is very clear that it needs to be to Jerusalem or Tel Aviv for a conversation along with Syria,\" Mr Barrack told a panel discussion at the conference. \"Syria is showing the way. Syria will get there first.\"\nHe added that Israel and Syria are “close” to reaching an agreement, without specifying the details. Israel's prime minister's office had previously said that negotiations were being held with Syria and the conclusions were contingent upon ensuring Israel's interests, which include the demilitarisation of southwestern Syria and safeguarding the well-being and security of the Druze in Syria.\nUnder US pressure, Syria is accelerating talks with Israel for a security pact that Damascus hopes will reverse Israel's recent seizures of its land but that would fall far short of a full peace treaty.\nMr Barrack also noted that Syria’s President Ahmad Al Shara will travel to Washington this month to sign a letter reaffirming Syria’s participation in the global coalition against ISIS, joining 88 other countries in the alliance. Syrian Foreign Minister Assad Al Shibani later confirmed the visit.\nIt would be Mr Al Shara's first trip to Washington. He visited New York in September to attend the UN General Assembly and met US President Donald Trump in Riyadh in May.\nEarlier at the Manama Dialogue on Saturday, Oman's Foreign Minister Badr Al Busaidi described Israel, rather than Iran, as the principal source of regional instability, and encouraged fellow Gulf countries to engage with Tehran rather than isolate it.\nIn a separate speech, Jordan’s Foreign Minister Ayman Safadi said that stability in Gaza will remain elusive as long as Israeli forces continue to occupy parts of the territory, stressing the need for a clear timeline for withdrawal.",
  "word_count": 670,
  "scraped_at": "2026-02-14T12:13:10.619774"
}