{
  "article_id": "34a7c8b2434a",
  "url": "https://www.cardchronicle.com/2024/10/3/24261127/thursday-afternoon-cardinal-news-and-notes-louisville-cardinals",
  "title": "Thursday afternoon Cardinal news and notes",
  "date": "20241003T213000Z",
  "domain": "cardchronicle.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "—Spread check: Louisville by 6.5.\nThursday afternoon Cardinal news and notes\nThe Kuppers didn’t bring back the win from South Bend but they made their presence known.\n—Today marks the start of a stretch where there will be at least one professional or college game every day for 55 straight days. Rejoice.\n—Matt McGavic has logged a 35-31 Louisville over SMU prediction.\n—Pro Football Focus named Stanquan Clark as its national Defensive Player of the Week.\n—Russ Smith’s Mr. and Mrs. Bourbon company has partnered with U of L.\nUofL Athletics is proud to partner with Mr. and Mrs. Bourbon and Russ Smith on the release of a limited-edition collector’s bottle, benefitting the Cardinal Impact Fund, a critical advancement effort within the athletic department. “Louisville Gold” will debut early November and is designed to celebrate the rich tradition of Louisville Basketball.\nOnly 1200 bottles of the bourbon will be available featuring the Louisville Cardinal Bird wearing an MMBC style top hat. The almost 7-year-old bourbon is wheated with a toasted finish. The mash bill is 64% corn, 24% wheat and 12% malt barley. All bottles will be hand numbered and some will feature Smith’s signature. The athletic department is coordinating other guest appearances and potential signings for the release in November. Bottles will retail for $199.99 and proceeds will go directly back to the Cardinal Impact Fund.\n“This release is personal for me! Louisville is home, and the University means a great deal to me. We are excited to give back, and happy to work with the athletic department and the Cardinal Impact Fund! This will raise money that directly impacts the programs and athletes where I got my start,” said Smith.\nThe exclusive collector’s bottle will launch exclusively in Liquor Barn stores across Kentucky at the beginning of November along with limited release is some hotels, bars and restaurants.\n—Louisville Report recaps how former Cards in the NFL fared in week four.\n—Saturday night at 7:30, Racing Louisville is playing a must-win match for its hopes of making the NWSL playoffs. Fans who attend the SMU game earlier in the day can show their ticket at Lynn Family Stadium and receive one free ticket to the Racing match.\n—EA Sports has updated the player ratings for its college football game. Here’s what they changed on Louisville’s roster.\n—Myisha’s not the one.\n—C.L. Brown thinks Louisville-SMU has all the makings of a shootout.\n—The Duke’s Mayo Bowl is Louisville’s most likely bowl destination according to the folks at BetKentucky.\n—The Athletic polled 50 people working in college football to determine what the best head coaching jobs in the sport are. Georgia topped the list.\n—The CJ has a list of things to know about Friday night’s Louisville Live event.\n—YaYa is a beast.\n—The latest From the Pink Seats podcast is here.\n—Louisville needs to get back to taking care of the ball if they want to avoid an upset loss on Saturday.\n—In addition to being named ACC Defensive Player of the Week for a third time, Louisville volleyball star Elena Scott has been named the AVCA National Player of the Week. She’s only the third libero ever to earn the honor.\n—All the more reason to show up for Louisville Live.\n—The CJ looks at the biggest local high school football games of this weekend.\n—Four-star Florida linebacker Kellen Wiley is set for an official visit this weekend to Louisville.\n—The U of L women’s soccer team will face a tall task at No. 3 North Carolina tonight.\n—The AP’s preview of Louisville-SMU is here.\nKEY MATCHUP\nSMU outgained FSU 458-285, including 204 yards rushing, and rank 55th nationally (419.4 per game) in total offense. The Mustangs are also 27th in rushing (205.6) thanks to Miami transfer Rashard Smith (509, seven TDs) but face a Louisville defense that allows just 94.8 on the ground (T-23rd) and stands 17th overall (271.5). Though the Cardinals allowed Notre Dame to convert three takeaways into 17 points on short fields, they stayed close by holding the Irish to one TD and 130 yards after halftime. They must keep SMU’s ground game in check and deny the balance that has served the Mustangs well the past two weeks.\nPLAYERS TO WATCH\nSMU quarterback Kevin Jennings is coming off a career-best 254-yard, three-touchdown passing performance against FSU for six total this season with one interception. He has completed 63% of his passes for 733 yards and rushed for 149 with one score. The sophomore completed 16 of 23 against the Seminoles.\n—The No. 1 ranked high school basketball player in the class of 2026 is all ready for his visit to Louisville this weekend.\n—No one in college football forces more turnovers or turns those turnovers into more points than SMU.\n—I don’t agree with Rothstein’s assessment that Louisville’s ceiling is “potential bubble team,” but that’s me.\n—One Foot Down’s latest podcast episode talks about the win over Louisville.\n—Big Red Louie looks at the weather forecast for Louisville-SMU.\n—Every member of the CJ’s sports staff thinks Louisville beats SMU.\n—Adam Burke of VSin likes Louisville to win and cover the 7.\nSMU Mustangs at Louisville Cardinals (-7, 56.5)\nSaturday, Noon ET (ESPN)\nThe ACC was one of the conferences I wrote up for our 2024 College Football Betting Guide. In that publication, I noted the issues that SMU has had with Power Four competition. Maybe they’ve thrown that monkey off of their backs with the wins over TCU and Florida State, but they were 0-3 last season and 0-2 in 2022, along with losses to Cincinnati, UCF, and BYU, who all joined the Big 12 for 2023.\nI’m not sure how good TCU is and I know that Florida State isn’t any good. I think Louisville is good. And the Cardinals got a big weapon back in Caullin Lacy, the South Alabama transfer who will play on Sundays at the next level. Lacy had five catches for 71 yards against Notre Dame and joined Ja’Corey Brooks, the Alabama transfer who has been QB Tyler Shough’s top target.\nI think this passing game got a lot more dangerous. Isaac Brown has 8.4 yards per carry and each of the top three backs for Louisville has been able to find a lot of openings. I don’t really know how good SMU’s defense is. Recently, they’ve just forced a lot of turnovers and capitalized on them.\nLouisville won the box score against Notre Dame, but turned it over on downs four times. A good offensive head coach like Jeff Brohm should be able to figure those things out. I fully expect a bounce back from Louisville here. This is also one of my biggest power ratings overlays of the week, as I have not bumped SMU much for the last two weeks and had Louisville pretty high coming into the season.\nEither it plays out or I make some big adjustments, but I do think Louisville is worthy of a look here as the best opponent SMU has played to this point by a good margin.\nPick: Louisville -7\n—Fox Sports’ data model is predicting a 30-29 SMU upset.\n—The 2026 field hockey national championship and the 2027 men’s NCAA tournament first and second rounds are both coming to Louisville.\n—And finally, the Mike Rutherford Show is back this afternoon from 3-6 on 1450/96.1. You can stream it here.",
  "word_count": 1233,
  "scraped_at": "2026-02-14T12:24:02.844511"
}