{
  "article_id": "34aaecbb5b47",
  "url": "https://www.phoenixnewtimes.com/news/highest-paid-nil-athletes-in-arizona-20228532",
  "title": "11 highest - paid NIL athletes in Arizona | Phoenix New Times",
  "date": "20240928T190000Z",
  "domain": "phoenixnewtimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Audio By Carbonatix\nSince a July 2021 U.S. Supreme Court ruling opened the floodgates for college athletes to make money off their name, image and likeness (NIL), young sports stars have cashed in at exceedingly impressive rates.\nWhether an athlete endorses a small local business or posts on social media as an influencer, tons of deals are struck every day on college campuses. What communities used to speculate was happening behind closed doors is now out in the open, with an athletic department’s supporters and partners effectively paying a player for their performance for their program.\nThe largest NIL deals tend to be for athletes in the most popular sports, such as football and basketball. But they aren’t the only ones cashing in. According to the NCAA’s NIL Assist data dashboard, the average college athlete nets just more than $20,000 in NIL earnings over a career.\nWhile more NIL deals go to men, especially college football players, many of the biggest individual deals have gone to female athletes, such as Louisiana State University gymnast Olivia Dunne and basketball star Flau’jae Johnson. Gilbert natives Haley and Hanna Cavinder left the East Valley for South Florida in 2021 to become some of NIL’s first breakout stars.\nBut Arizona’s schools have lagged behind. At both Arizona State University and the University of Arizona – both of which recently changed athletic directors and moved to the Big 12 Conference – NIL spending has been a point of contention. This summer, ASU football coach Kenny Dillingham said his program was far behind its competitors in the NIL race.\n“We’re still not even close to where we need to be, and that’s where I think the business owners have to come in, step up, and really pour into the guys,” Dillingham told the Phoenix Business Journal. “If we want to compete in the top four of the Big 12, we need to be at about $7 million to $7.5 million a year.”\nAccording to On3.com, only one Sun Devil earns enough NIL money to make the top 10 in the state. By contrast, the rival Wildcats are cleaning up in Tucson, with big deals for football players as well as men’s and women’s hoopers. At the same time, two major payouts to athletes in the Chandler Unified School District highlight NIL’s expansion into high school sports.\nHere’s who On3 says is slated to make the most in NIL money in Arizona this year:\n1. Noah Fifita, University of Arizona football: $1M\nThe Wildcats were able to recruit the three-star quarterback out of Southern California in 2021 before former head coach Jedd Fisch helped develop him into a likely first-round NFL draft pick. Fifita has deals with personal tech company JLab, video game brand EA Sports and more.\n2. Tetairoa McMillan, University of Arizona football: $890,000\n“T-Mac” put together one of the most impressive performances of the young college football season in Week 1 with 304 receiving yards and four touchdowns in a win over New Mexico. If he wasn’t on the national map before that, the game certainly catapulted him there. Recent deals with JLab and Raising Cane’s have McMillan valued at nearly $1 million.\n3. Caleb Love, University of Arizona men’s basketball: $795,000\nThe fifth-year senior transferred to Arizona in 2023 and led the Wildcats to the third round of the NCAA tournament. Like many transferring upperclassmen, Love earned significant income in the process. After starting his career at North Carolina, Love has NIL deals with several major brands, including Keurig and Ritz Crackers, as well as local men’s basketball collective Arizona Assist Club.\n4. Justin Flowe, University of Arizona football: $661,000\nOf all the athletes on this list, Flowe boasts by far the most followers with 691,000 on Instagram, where he has collaborated with brands such as Powerade in recent sponsored posts. The redshirt junior linebacker heads up the Wildcats’ defense and maintains a large audience off the field.\n5. Sam Leavitt, Arizona State University football: $590,000\nDeals with a local Ford dealership and sports bar chain Cold Beers and Cheeseburgers help the Sun Devil quarterback round out the top five. However, as illustrated by Dillingham’s frequent pleas for greater NIL investment in Tempe, Leavitt is the only ASU player who On3 estimates to have significant NIL value.\n6. Jonah Savaiinea, University of Arizona football: $471,000\nSavaiinea’s NIL income has been driven mainly by Friends of Wilbur & Wilma, the Arizona collective founded in February 2022 by longtime university boosters Cole Davis and Humberto Lopez. The longtime Tucson philanthropists bring national brands to the university through the collective.\n7. Koa Peat, Chandler Perry High School men’s basketball: $444,000\nPeat is one of the most hotly recruited young basketball stars in the nation, but his talent and following make him one of the more valuable NIL athletes already. Peat is being recruited by blue blood programs such as Duke University in addition to powerhouses such as Baylor University and the University of Houston. The University of Arizona is in the mix, too.\nWe coming ðŸ˜ˆðŸ»â¬‡ï¸ #btfd pic.twitter.com/nNXse5wCR3\n— Jada WilliamsðŸ’« (@cbgjada2) March 23, 2023\n8. Jada Williams, University of Arizona women’s basketball: $421,000\nWith more than a million combined followers on Instagram and TikTok, the Southern California native was one of the breakout NIL stars of 2023. Williams already is one of the most consistent NIL dealmakers in the country, striking pacts with Bumble, Nerf and Spalding in her first year in Tucson.\n9. Tacario Davis, University of Arizona football: $415,000\nAs a top defensive back for the promising Wildcats, Davis has more than 9,000 followers on Instagram, though his profile features only six posts.\nJACOB MANU. #BearDown pic.twitter.com/Pl80lOUVWv\n— Arizona Athletics (@AZATHLETICS) September 10, 2023\n10. Jacob Manu, University of Arizona football: $288,000\nThe Arizona linebacker is averaging nearly 10 tackles per game and has deals with EA Sports as well as sports drink company LMNT and Mad Rabbit Tattoo.\n11. Jake Hildebrand, Chandler Basha High School football: $232,000\nThe Basha offensive tackle won’t graduate until 2027 but the 6-foot-6, 285-pound athlete already has formal scholarship offers from 12 universities. The anticipation for his college career has him well on his way to NIL success when he gets to his next campus, if not sooner.",
  "word_count": 1041,
  "scraped_at": "2026-02-14T13:14:28.404505"
}