{
  "article_id": "34b39b9bb92c",
  "url": "https://littleapplepost.com/posts/2080fd57-9dc9-4642-a1c3-b922815ada9f",
  "title": "K - State Athletics Launches Summer Ticket On - Sale Beginning June 10",
  "date": "20250527T233000Z",
  "domain": "littleapplepost.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By Ryan Lackey\nAssociate Athletics Director for Communication\nMANHATTAN, Kan. – K-State Athletics is launching its Summer Ticket On-Sale, giving fans the opportunity to purchase or renew tickets across all six ticketed sports – football, men’s and women’s basketball, soccer, volleyball and baseball. The on-sale begins exclusively online at 5 p.m., on Tuesday, June 10.\nCLICK HERE to preview the full ticket menu.\nFOOTBALL TICKETS\nAhearn Fund members will have an exclusive week-long online-only pre-sale for single-game tickets. The general public can begin purchasing tickets online only beginning at 5 p.m., on Tuesday, June 17.\nPhone and in-person orders for football single-game tickets for both Ahearn Fund members and the general public will begin at 8:30 a.m., on Monday, June 23.\nFans are encouraged to act fast and purchase their tickets early. K-State Athletics utilizes dynamic pricing and single-game prices may change based on demand.\nK-State Athletics can only verify tickets and assist fans with issues on gameday with tickets that are purchased from the K-State Ticket Office or through SeatGeek.\nA limited number of football season tickets are still available for purchase online and over the phone at 1-800-221-CATS.\nSEASON TICKETS\nNew season tickets for men’s and women’s basketball, soccer and volleyball will go on sale online only beginning at 5 p.m., on Tuesday, June 10. Phone and in-person orders will begin at 8:30 a.m., on Wednesday, June 11.\nFans who had season tickets for the 2024-25 seasons have until Thursday, July 31 to renew their tickets.\nFans who renew or order by the July 1 incentive deadline can receive a discount off the processing fee, the opportunity to sign up for monthly payment plans and an exclusive season-long concessions discount card.\nNew season ticket purchasers for men’s and women’s basketball will be able to select reserved seats in any location currently available. Fans should order by the Thursday, July 31 priority deadline to participate in the seat upgrade process in August.\nAn Ahearn Fund contribution is required for all premium seating. For more information, visit www.ahearnfund.com/premiumseating or contact the Ahearn Fund at (888) 232.9074.\nMEN’S BASKETBALL\nFans have a variety of ticket prices and locations from which to choose from, with a Wildcat 4-Pack starting at less than $15 per game.\nWOMEN’S BASKETBALL\nGeneral admission season tickets start at $75 each for a Wildcat 4-Pack. Individual GA season tickets are available for $100 or just $75 for football and men’s Basketball season ticket holders.\nSOCCER SEASON TICKETS\nGeneral admission season tickets start at $40 with a Wildcat 4-Pack – less than $5 per match and a savings of $10 per season ticket. Individual GA season tickets are just $50.\nSeason ticket holders can take advantage of the Ticket Exchange Program, an opportunity to swap out unused tickets to bring more friends and family to a future match (while supplies last).\nVOLLEYBALL SEASON TICKETS\nGA season tickets start at $75 with a Wildcat 4-Pack – less than $6 per match and a savings of $25 per season ticket. Individual GA season tickets are available for $100.\nSeason ticket holders can take advantage of the Ticket Exchange Program, an opportunity to swap out unused tickets to bring more friends and family to a future match (while supplies last). Season ticket holders also receive early entry.\nBASEBALL DEPOSITS\nFans can place deposits for 2026 season tickets. Current season ticket holders should not place a 2026 season ticket deposit. Full season ticket details will be announced at a later date.",
  "word_count": 578,
  "scraped_at": "2026-02-14T13:42:11.423279"
}