{
  "article_id": "34d6a995ca96",
  "url": "https://y95country.com/ixp/1004/p/cowboys-will-face-south-dakota-state-at-sanford-pentagon/",
  "title": "Cowboys Will Face South Dakota State at Sanford Pentagon",
  "date": "20250509T014500Z",
  "domain": "y95country.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Cowboys Will Face South Dakota State at Sanford Pentagon\nSIOUX FALLS, S.D., – The Wyoming Cowboys will face off against the South Dakota State Jackrabbits in the Sanford Pentagon in Sioux Falls, S.D. on December 15. The on-sale date for tickets will be announced later.\nThis matchup brings together two head coaches who have been on the sidelines of Heritage Court – but in different capacities than when they will face off in December.\nCoach Sundance Wicks was an assistant at Northern State from 2016-18 and Coach Bryan Petersen was an assistant at SDSU the previous six seasons before being promoted to head coach earlier this year.\n“We’re excited to host this early season matchup between the new look Jackrabbits and a Wyoming program that is building a contender in the Mountain West Conference,” said Jesse Smith, vice president of operations for Sanford Sports. “This is a great chance to see two teams with a lot of talent who are looking to cap off their non-conference schedule with a quality win.”\nHead coach Sundance Wicks is entering his second season as head coach of the Cowboys. The Pokes welcome back two key contributors in Matija Belic and Abou Magassa along with a host of solid newcomers via high school and the transfer portal. The Pokes were a tough out in Wicks' first season with the Cowboys taking NCAA Tournament teams down to the wire in five games.\n“The Wicks family has a lot of relatives in eastern South Dakota. As you well know, I went to Northern State and, to bring some Cowboy and Wolves fans down to Sioux Falls will make for great memories,” said Wicks. “It will be a celebration of basketball, and we know the Jackrabbit fans will be out in full force. You can never go wrong going back and playing at the Pentagon. It is a great place to play and a premier spot in college basketball to play a neutral site game.”\nWyoming leads the all-time series 5-1. The teams last met at a multi-team event in El Paso on Dec. 20, 2023, with the Cowboys winning 78-65.\nPetersen leads a Jackrabbits team that is coming off a 20-12 season. SDSU returns nine players from its roster a season ago including starters Matthew Mors, Kalen Garry and Joe Sayler. South Dakota State is 11-9 all-time at the Sanford Pentagon. Last season the Jackrabbits defeated McNeese State 80-73 in the Field of 68 Opening Day Showcase.\n\"We're thrilled to be able to have another opportunity to play in the Sanford Pentagon this season. Sanford always does an incredible job hosting us and the Pentagon is known across the country as a great venue for college basketball,” Petersen said. “We will be matched up against a quality opponent in Wyoming. Sundance Wicks and his staff are heading into their second year in a tough Mountain West Conference, so we know they will be a challenging opponent in our non-conference. We look forward to the test and to be able to compete in front of Jackrabbit Nation!\"\nThis is the second NCAA Division I event at the Sanford Pentagon announced for the 2025-26 season. Nebraska will play North Dakota State in women’s basketball on Nov. 16.\nUniversity of Wyoming’s Top 50 Football Players\nGallery Credit: 7220Sports.com\n- University of Wyoming’s Top 50 Football Players",
  "word_count": 557,
  "scraped_at": "2026-02-14T13:20:50.148508"
}