{
  "article_id": "34ebca2927b5",
  "url": "https://www.lusakatimes.com/2025/08/11/zesco-united-triumph-over-power-dynamos-to-lift-2025-charity-shield/",
  "title": "Zambia : Zesco United Triumph Over Power Dynamos to Lift 2025 Charity Shield",
  "date": "20250811T213000Z",
  "domain": "lusakatimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Over 20,000 fans were present at the Levy Mwanawasa Stadium in Ndola as Zesco United clinched the first trophy of the new Zambian Premier League season with a 2-0 win over Copperbelt rivals Power Dynamos in the final of the 2025 Carling Black Label – Samuel ‘Zoom’ Ndhlovu Charity Shield.\nZesco youngsters David Simukonda and Pascal Phiri scored a goal each to enable their side climb to the winner’s podium to be crowned champions, making a colorful end to the expanded Charity Shield that had eight teams.\nNew Zesco coach Tenant Chilumba has saluted youngsters from the team’s academy that propelled his side to Charity Shield victory against Power.\nChilumba said it was good to see youngsters impact positively on Zesco and saluted the entire team for starting the season with a trophy.\n“It is a good welcome for me,” Chilumba told reporters before receiving the champion’s medal from guest of honour Gibson Muyaule, the Director of Sports at the Ministry of Sports.\nPower coach Oswald Mutapa regretted the loss to Zesco.\nGreen Buffaloes Women’s Team edged Super League champions Zesco Ndola Girls 3-2 in the Charity Shield women’s category.\n“We thank the sponsors of the Charity Shield, the Zambian Breweries through the Carling Black Label brand. This is the only cup and biggest cup competition the women are involved in. we pray that the sponsors continue supporting women’s football,” said Green Buffaloes Women’s Team coach Charles Haalubono.\nEarlier on Saturday, Konkola Blades beat Kansanshi Dynamos 1-0 while in the women’s game Konkola Queens edged National Assembly 4-3 on penalties after a goalless draw.\nThe K2,000,000 investment towards the Charity Shield by the main sponsor Zambian Breweries included a K750, 000 sponsorship package for the Zambia Premier League, and prize money for competing teams, sports kits, and a national campaign to encourage fan participation.",
  "word_count": 304,
  "scraped_at": "2026-02-14T12:43:50.105549"
}