{
  "article_id": "34f5b35c123f",
  "url": "https://townhall.com/columnists/struanstevenson/2025/12/21/ban-the-hangmans-regime-from-the-world-cup-n2668241",
  "title": "Ban the Hangman Regime From the World Cup",
  "date": "20251221T053000Z",
  "domain": "townhall.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "There are moments when the international community’s silence becomes complicity. Iran is approaching one of those moments now. In a grim theatre of state terror, the Tehran regime appears poised to hang a national sports champion, boxing hero Mohammad Javad Vafaei Sani, despite growing international outrage. If the world allows this execution to proceed, then it should at least have the honesty to admit that slogans about “sport transcending politics” are meaningless. A regime that uses the gallows as a political weapon has no place on the world’s sporting stage, least of all at the football World Cup.\nThe life of Mohammad Javad Vafaei Sani, a 30-year-old boxing champion and coach from Mashhad, is in imminent danger. On December 15, 2025, prison authorities informed him that the regime’s Supreme Court had rejected his request for a retrial. On the same day, officials chillingly told his mother by phone that his death sentence had been sent to the department responsible for implementing executions. In Iran’s penal lexicon, that bureaucratic phrase translates into one thing, the final countdown to a state-sanctioned killing.\nAlarm bells rang even louder when his mother was suddenly granted an in-person visit that very day, a grim hallmark of cases approaching the gallows. These moves followed a week of heightened pressure. On December 6, Vafaei was transferred to solitary confinement and all communications with Vakilabad Prison, the central prison in Mashhad, were cut. Anyone familiar with the regime’s methods understands what this means. The noose is being prepared.\nVafaei’s case exposes the Iranian judiciary for what it truly is, not an independent court system, but an obedient arm of the intelligence services. Arrested in January 2020 during nationwide protests, he was subjected to 65 days of physical and psychological torture aimed at forcing a confession of support for the People’s Mojahedin Organization of Iran (PMOI/MEK), the regime’s most feared democratic opposition movement.\nRecommended\nThe farce of “justice” that followed was so grotesque that even Iran’s own Supreme Court was twice compelled to overturn his death sentence, first in late 2022 and again in mid-2024. Yet here we are again. The sentence has been reimposed not because of evidence or law, but because the Ministry of Intelligence demanded it. Vafaei’s lawyer has openly acknowledged interference by unnamed “third parties,” a thinly veiled reference to security agencies dictating judicial outcomes. This is not justice, it is political murder dressed up as legal procedure.\nThe cruelty does not stop with the prisoner. It radiates outward to his family. Vafaei was denied medical leave and barred from attending the funeral of his father, Seyed Ali Vafaei, who died in November 2024 after months of anguish over his son’s fate. This deliberate infliction of suffering is a familiar tactic of the regime.\nThe projected execution of Mohammad Javad Vafaei Sani has sparked international condemnation from across the sporting world. Legendary tennis champion Martina Navratilova has publicly denounced the death sentence, warning that executing an athlete for political dissent sends a chilling message to every sportsman and woman worldwide. Olympic gold medalist Nancy Hogshead, British Olympian Sharron Davies, Olympic cyclist Inga Thompson, endurance athlete Carilyn Johnson, and American swimmer Riley Gaines have all joined a joint appeal urging Iranian authorities to halt the execution and calling on global institutions to act. Their message is clear, killing an athlete to silence dissent is an assault on the very values sport claims to represent.\nEven international sporting bodies have broken ranks. The World Boxing Council (WBC) has formally condemned the death sentence, stating that executing a boxer for political reasons violates human dignity and the fundamental principles of sport. When boxing’s own governing institutions feel compelled to speak, the claims that this is an “internal matter” collapse.\nVafaei’s case is part of a broader campaign of terror. At least 18 political prisoners currently face execution on fabricated charges of links to the PMOI. Among them is Vafaei’s cousin, Mehdi Vafaei. This escalation follows the execution earlier this year of PMOI members Mehdi Hassani and Behrouz Ehsani. Regime insiders now speak ominously of repeating the “successful experience” of 1988, when more than 30,000 political prisoners were massacred in a matter of months.\nThis machinery of repression has never confined itself to underground activists or anonymous detainees. It has reached deep into the heart of Iranian society, targeting figures whose names once united the nation and whose faces filled stadiums. The distinction between justice and terror is therefore not theoretical in Iran, it is written in blood.\nThis is all the more evident when one recalls that in 1984 the same regime executed Habib Khabiri, the beloved captain of Iran’s national football team who represented his country at the 1978 World Cup in Argentina, and during the 1988 massacre, hanged Forouzan Abadi, captain of Iran’s women’s national volleyball team. These were not criminals, but national sports icons whose only offense was refusing to submit to tyranny.\nAgainst this backdrop, welcoming Iran to the football World Cup is obscene. Sport does not exist in a moral vacuum. When apartheid South Africa was banned from international sport, it sent a powerful message that racism had consequences. Today, Iran’s rulers use executions to maintain power. Allowing them to bask in the prestige of global tournaments while tightening the hangman’s rope is moral bankruptcy. Condemnations and expressions of “concern” have achieved nothing. The Iranian Resistance has rightly called on the United Nations, the European Union, and democratic governments to take concrete action. That must include targeted sanctions against judicial and security officials responsible for death sentences, and it must include exclusion from international sporting events.\nIf Mohammad Javad Vafaei Sani is executed, his blood will stain not only the hands of his executioners, but also those of institutions that chose silence over principle. A regime that hangs its athletes should not be allowed to parade its flag on the world stage. Ban Iran from the World Cup and make it unmistakably clear that the age of appeasing the hangman is over.\nEditor’s Note: Do you enjoy Townhall’s conservative reporting that takes on the radical left and woke media? Support our work so that we can continue to bring you the truth.\nJoin Townhall VIP and use promo code MERRY74 to get 74% off your membership.",
  "word_count": 1043,
  "scraped_at": "2026-02-14T12:37:28.266354"
}