{
  "article_id": "34f843b881bb",
  "url": "https://www.insidermonkey.com/blog/vera-bradley-inc-nasdaqvra-q1-2024-earnings-call-transcript-1158414/",
  "title": "Vera Bradley , Inc . ( NASDAQ : VRA ) Q1 2024 Earnings Call Transcript",
  "date": "20230608T214500Z",
  "domain": "insidermonkey.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Vera Bradley, Inc. (NASDAQ:VRA) Q1 2024 Earnings Call Transcript June 7, 2023\nVera Bradley, Inc. beats earnings expectations. Reported EPS is $-0.19, expectations were $-0.2.\nOperator: Please standby. Good morning ladies and gentlemen. Thank you for standing by. Welcome to the Vera Bradley First Quarter Conference Call for Fiscal 2024. At this time, all participants are in a listen-only mode. Following the presentation, we will conduct a question-and-answer session. Instructions will be provided at that time for you to queue up for questions. As a reminder, today’s conference call is being recorded. I would now like to turn the call over to Mark Dely, Vera Bradley’s Chief Administrative Officer. Please go ahead.\nMark Dely: Good morning and welcome everyone. We’d like to thank you for joining us for today’s call. Some of the statements made during our prepared remarks and in response to your questions may constitute forward-looking statements made pursuant to and within the meaning of the Safe Harbor provisions of the Private Securities Litigation Reform Act of 1995, as amended. Such forward-looking statements are subject to both known and unknown risks and uncertainties that could cause actual results to differ materially from those that we expect. Please refer to today’s press release and the company’s most recent Form 10-K filed with the SEC for a discussion of known risks and uncertainties. Investors should not assume that the statements made during the call will remain operative at a later time. We undertake no obligation to update any information discussed on today’s call. I would now like to turn the call over to Vera Bradley’s CEO, Jackie Ardrey. Jackie?\nJacqueline Ardrey: Thank you, Mark. Good morning and thank you for joining us on today’s call. Today, I’m joined by both John Enwright, our departing CFO and Michael Schwindle, our newly appointed CFO. Before we begin, I want to express my sincere thanks to John for his nine years of service to Vera Bradley and his many contributions to our company and we wish him all the best in the future. And we welcome Michael Schwindle to our team who joined the company on May 8th. He is a retail industry veteran with over 30 years of experience, including more than 15 years in CFO roles, delivering strong results through profit improvement and by providing innovative solutions. For the three years prior to joining our company, he served as CFO for accessory and jewelry retailer Claire’s.\nPreviously he held CFO roles at specialty retailers Fleet Farm, Payless Shoe Source, Perry and David, and Musician’s Friend as well as other key financial roles at Home Depot and Limited Brands. You’ll hear from both John and Michael later in today’s call. Now let me turn to the quarter. We are very pleased that meaningful gross margin expansion and diligent expense control led to a significant year-over-year improvement in bottom line performance for the first quarter. On the revenue side, Vera Bradley factory stores experienced challenging traffic trends in March and April that led to weaker than expected performance for the quarter. This was partially offset however by several positive highlights in other areas of our business. First, we delivered our first positive quarterly revenue performance in five quarters at Pura Vida, primarily driven by non-comparable retail store sales.\nWe also saw improved year-over-year sales trends in both our Pura Vida wholesale and ecommerce channels. Second, we delivered strong Vera Bradley ecommerce performance and solid Vera Bradley full line store revenues. Vera Bradley indirect revenues declined as expected due to a non-recurring key account order that took place in last year’s first quarter, but the underlying business remains healthy. We are building a collaborative team with the mindset of generating long-term revenue increases, expanding gross margin, and ensuring strong financial discipline and cost control, which we expect will drive long-term profitable growth. The team is working hard and taking strategic proactive steps to steadily grow Pura Vida’s revenues and to reverse the trends in Vera Bradley’s factory channel through the expansion of successfully tested targeted marketing programs designed to drive traffic and average order size.\nAt Pura Vida, we have a solid organizational structure in place with newly promoted General Manager, Sujay Shah leading the team with heightened discipline and focus on day-to-day execution and driving business results. Sujay was Pura Vida’s former VP of Finance and is leading the team to return the ecommerce business to growth through utilization of the newly launched comprehensive customer data platform, diversification of the marketing program, improving site navigation, and focusing on customer retention. On the product front, our custom bracelet program and new friendship packs are a big focus and are working and we will continue to pursue high profile collaborations like Sanrio, Harper Charms and Crumbl Cookies that are always fan favorites.\nThe hard work on project restoration began in the first quarter, which is focused on four key pillars of the business for each brand, consumer, brand, product, and channel to drive the long term profitable growth we expect. To support project restoration and lay the foundation for our success, we made additional corporate changes and announced incremental cost reductions including the elimination of approximately 25 corporate positions as part of an overall plan to further right size the expense structure of the company. Of course, Michael Schwindel’s track record of driving profitable growth along with his passion for retail and operational excellence will be instrumental as the company executes project restoration. We also made several organizational changes in the marketing, ecommerce, product design, and product development areas that flattened and streamlined the organizational structure to improve execution, make faster decisions, and provide support for the four pillars of project restoration.\nThese most recent organizational changes and non-payroll expense reductions are expected to produce annualized savings of approximately $12 million on top of our fiscal 2023 cost reductions. Let me give you a bit more detail on project restorations four key pillars and some of the initiatives we currently have underway. At Vera Bradley for the consumer we will focus on restoring brand relevancy, targeting casual and feminine 35 to 54-year-old women who value both fashion and function. For the brand, we will strategically market our distinctive and unique position as a feminine fashionable brand that connects with consumers on a deep emotional level. For product, we will refocus on core categories and items we are best at by innovating and expanding within our core products like travel and back to campus.\nWe will elevate our colorful feminine heritage, keeping it distinctive but more trend relevant through updated print and design. We will also innovate into strategic adjacent lifestyle item introductions that make sense for our customers. As part of this, travel and travel accessories perform strongly across all channels in the first quarter and the travel category will continue to be a key focus of our go forward assortment. Additionally, our performance fabrics are trending well across all channels with a core customer being younger with a higher household income, this remains a big opportunity for us. Patterns will always be our signature, but coordinating solids continue to be a key opportunity for us as well. We will expand our solid collection this fall, including our foray back into a small collection of leather goods.\nFinally, product collaborations are still an important part of our brand expression. Our Winnie the Pooh capsule was a huge success. Our first Hello Kitty collaboration was just launched this month and our NFL collection will be launched in August, just in time for football season. And then finally for channel, we will accelerate our digital first focus and online presence, build a balanced footprint that more clearly differentiates full line from factory stores, and target and or strengthen relationships with strategically aligned wholesale partners. As part of this, our recent site rebranding and navigation changes have been successful in reducing bounce rate and driving conversion and sales. So turning to Pura Vida, for the consumer we will sharpen our focus on the carefree 18 to 24 year old girl who both those younger and older aspire to be.\nFor the brand, we will re-center our brand ethos on living life to the fullest with marketing authentically, sharing real moments, places and faces. Our Live Free campaign launched this month will accentuate travel, adventure, friendship, and freedom, and will create engagement and excitement in our customer base for the entire summer. For product, we will focus on delivering unique, fun, playful designs that are affordable and accessible with a dominant emphasis on bracelets and jewelry as well as other strategic adjacent categories. Some great examples of this are our new summer collection and our Harper Charms collection, which are both resonating with our customers. And then finally for channel, we will have a strong focus on restoring ecommerce growth, which I just talked about and growth of wholesale by pursuing larger, more strategic partnerships and expanding larger existing accounts and refining our existing store model.\nNow let me turn the call over to John to review the financial results. John.\nJohn Enwright: Thanks, Jackie and good morning. Let me go over a few highlights for the first quarter. The numbers I will discuss today are all non-GAAP and exclude the charges outlined in today’s release. For a complete detail of items excluded from the non-GAAP numbers as well as a reconciliation of GAAP to non-GAAP numbers, please reference today’s press release. Consolidated net revenues totaled 94.4 million compared to 98.5 million in the prior year first quarter. The consolidated net loss totaled 2.6 million or $0.09 per diluted share compared to 6 million or $0.18 per diluted share last year. Vera Bradley direct segment revenues totaled to 58.9 million, a 4.4% decrease from 61.6 million in the prior year. Comparable sales declined 3.3%, primarily due to weakness in the factory channel Jackie noted earlier.\nVera Bradley indirect segment revenues totaled 15.4 million, a 9.4% decrease from 17 million last year. Prior year revenues reflected a large one-time key account order that was not repeated this year. Pura Vida segment revenues totaled 20.1 million, a 1.2% increase over 19.8 million in the prior year first quarter, primarily driven by non-comparable retail store sales. First quarter gross margin totaled 51.7 million or 54.8% of net revenues compared to 52.5 million or 53.3% of net revenues in the prior year. The current year gross margin rate was favorably impacted by lower year-over-year inbound and outbound freight expense, and the sell through of previously reserved inventory partially offset by an increase in promotional activity. SG&A expenses totaled 55.6 million or 58.9% of net revenues compared to 59.4 million or 60.3% of net revenues in the prior year.\nCurrent year expenses were lower than the prior year, primarily due to cost reduction initiatives and the reduction in variable related expenses related to lower sales volumes. The company’s first quarter consolidated offering loss totaled 3.5 million or 3.7% of net revenues compared to 6.7 million or 6.8% of net revenues in the prior year. Now let’s turn to the balance sheet. Quarter end cash and cash equivalents totaled 25.3 million compared to 46.6 million at fiscal year-end with no borrowings on our 75 million credit facility at quarter end. Total quarter end inventory was 142.7 million compared to 161.8 million at the end of the first quarter last year. During the quarter, we purchased 128,100 shares at an average price of $5.71 per share for an aggregate amount of approximately $732,000.\n$27 million remains under the $50 million repurchase authorization that expires in December 2024. Now let me turn the call over to Michael to talk about the company’s fiscal 2024 outlook.\nMichael Schwindle: Thanks, John and good morning everyone. Based on the first quarter performance, as both Jackie and John have discussed as well as our initiatives underway and the macro environment trends and expectations, we are revising our guidance for this fiscal year. As a result, all of our forward looking guidance or as a reminder, rather, all of our forward looking guidance is on a non-GAAP basis. Fiscal 2024 our updated guidance is as follows. We expect total revenues of $490 million to $510 million. As a reminder revenues totaled 500 million in fiscal 2023, and we expect both Vera Bradley and Pura Vida revenues to be approximately flat on a year-over-year basis. We also expect gross margin rates of between 52.8% and 53.8%, which compares to 51.4% for last year.\nOur fiscal 2024 gross margin rate is expected to be favorably impacted by lower year-over-year freight expenses, cost reduction initiatives, and the sell through of previously reserved inventory, which will be partially offset by an increase in promotional activity. Our SG&A expenses are expected to be between 237 million and 247 million compared to 245.3 million last year. The expected year-over-year decline in SG&A expense is being driven by company-wide cost reduction initiatives partially offset by restoring incentive compensation to more normalized levels and incremental marketing investment intended to accelerate customer file growth. This results in anticipated consolidated operating income of 24 million to 28 million compared to 12.3 million last year and diluted EPS of $0.57 to $0.67 based on diluted weighted average shares outstanding of 30.7 million and an effective tax rate of approximately 28%.\nOur diluted EPS totaled $0.24 last year. We also expect net capital spending of approximately $5 million compared to $8.2 million last year, which reflects investments associated with new Vera Bradley factory stores, as well as technology and logistics enhancements. And as a result our free cash flow is anticipated to be between $35 million and $40 million compared to a cash usage of 21.7 million in fiscal 2023. So with that operator, we’d like to open up the call to questions.\nQ&A Session\nFollow Vera Bradley Inc. (NASDAQ:VRA)\nFollow Vera Bradley Inc. (NASDAQ:VRA)\nReceive real-time insider trading and news alerts\nOperator: [Operator Instructions]. And our first question today comes from Joe Gomes with Noble Capital.\nJoe Gomes: Good morning and thanks for taking my questions.\nMichael Schwindle: Hey Joe.\nJacqueline Ardrey: Good morning Joe.\nJohn Enwright: Good morning.\nJoe Gomes: So I wanted to start off, you talked about some lower traffic levels at Vera Bradley, I think in March and April. Maybe you could give us a little more color or detail as to what was behind that?\nJacqueline Ardrey: Sure, Joe. So, first I want to say that the traffic challenges were limited really to the factory channel and they were primarily in March. I think where we are seeing some other retailers report similar slowdowns and what we’ve done in the quarter is really look at some marketing programs to drive more traffic to those factory stores. And that’s part of the reinvestment that we’re going to make for the rest of the year as really we had some successful test results from some of those programs to help increase in targeted markets. And we’re going to continue to deploy those programs. So — but again, it was really just limited to the factory channel. Our, full line traffic was strong throughout the quarter.\nJohn Enwright: And Joe, all I would add on to that, and I think Jackie did a good job, is to say that to the point was March was really kind of the toughest month in the quarter and we saw it rebound a little. It’s still down in April, but we saw it rebound in April better than March, and then in May we’ve seen kind of that continued progression, so.\nJoe Gomes: Okay. And, I don’t know, maybe if you talked about this before or not, maybe you can give us a little bit size as to what that non-recurring account order last year was, just so we can kind of get a better idea of the year-over-year X that performance?\nJohn Enwright: Yeah, so indirect would’ve been down about 2%, excluding that one-time sale last year for the key account order. So it was a little bit over $1 million.\nJoe Gomes: Okay, great. And then one more if I may and I’ll pass it along, Michael, congrats on joining the team. You’ve been there now a little over a month, early days, kind of maybe give us your first impressions and what are you kind of laying out as what your initial short-term goals would be here? Thank you.\nMichael Schwindle: Oh hey, thank you, Joe. Appreciate the question. Hey, with my days and days of experience as Jackie and others have heard me say, so this is a tremendous brand. It’s got a great solid foundation here, great customer base, great brand recognition that gives a tremendous foundation from which to build upon. And so I — Jackie and I’ve talked a lot about that, I’m very excited about that. Obviously initially there’s a lot to learn here around all the different channels of the business as well as with the Pura Vida brand. And so, I’m a bit vertical on the learning curve as you might imagine, as I’m trying to digest and under understand all of that. In the meantime, I’ve already been engaged pretty deeply in a lot of the cost initiatives that Jackie referred to earlier, making sure that we’ve got good controls around that and making sure we have good visibility to delivering those initiatives as well as gathering additional understanding of the different areas of the business.\nI think one of the advantages I have been around lots of different retail organizations. I’ve had a lot of different operational experiences over my 35 years, and that makes it a little bit faster kind of running start for me to jump into different areas of operations and other things to kind of have a solid foundation at the onset and then look for the opportunities in the business.\nJoe Gomes: Great. Thanks for that. I look forward to working with you going into the future. Thanks for taking the questions again.\nMichael Schwindle: I do as well. Thank you.\nJacqueline Ardrey: Thanks, Joe.\nJohn Enwright: Thanks Joe.\nOperator: [Operator Instructions]. And our next question will come from Eric Beder with SCC Research.\nEric Beder: Good morning. Congratulations on the quarter.\nJohn Enwright: Thanks, Eric.\nJacqueline Ardrey: Thanks Eric.\nEric Beder: Okay. How should we be — I know that you have this new management team join, it’s a little bit tough in the near term to really change the product mix and flows. Obviously you’ve done a great job in controlling what you can control on the expense side. Now when should we be thinking that we’ll see like what you Jackie or team envision the stores to fully be, is that back half of this year or is that really into next year?\nJacqueline Ardrey: Yeah, that’s a great question, Eric and as you said, it’s tough to change a product trajectory quickly. But I think the team has done a great job of really getting in and dissecting what’s working and what’s not working, especially as it relates to our future customer target. So we have — one of the things we learned that I talked about today is just the balance of solids and prints in our assortment and looking at the fabrics that we currently offer, who they attract in terms of a customer level and a price point level. So you’ll definitely see some product mix changes at the back half of the year and then it will steadily increase as we get closer to the middle of next year.\nEric Beder: Okay, that makes sense. How should we be thinking about stores, I mean, obviously the Pura Vida store openings that happened last year helped, historically been closing full price stores, opening outlets, what should we be thinking about this year and I guess longer term?\nJacqueline Ardrey: Yeah, it’s another great question, Eric, and I have to say that we are deep in that work that’s part of the channel pillar of our project restoration for both brands. Our Pura Vida stores are working pretty well so it — but it is really about right now pausing to be sure that we can deliver the right strategic plan for the business. So that’s the only reason that we haven’t continued opening Pura Vida stores. But I think you’ll hear more from us by the end of the year about our plans for stores. But, it’s just really important that, again, right now we’re focusing on the health of the overall portfolio and making sure that we’re making the right strategic decisions for store openings for both brands.\nEric Beder: Sure. And last question for you, what should we be thinking about and how, in terms of inventory flows obviously Q1, you brought the inventories down significantly, is there opportunities to continue that throughout the rest of the year? Thank you.\nMichael Schwindle: Hey, Eric this is Michael, I’ll jump in on that and Jackie can add some more color. As you noted, we have seen some pretty good reductions on a year-over-year basis. It’s roughly flat with the end of the year. We do expect to continue to see a downward trajectory in our overall inventory through the end of the year or something in the probably down 10 ish, maybe a little bit more than 10 ish percent by the time we get to the end of the year.\nJacqueline Ardrey: And just a little color on that, we’ve been — the company has been engaged in an exercise around SKU reduction. It’s called the SOAR project and that has really contributed to kind of cutting off the tail of some of our unproductive inventory. And that’s really contributing to some of the declines that you’ve seen. We’re continuing that work and really I think you’ll see the continued evidence as Michael mentioned within the rest of the year of those reductions.\nEric Beder: Great. Good luck for the rest of the year. Thank you.\nJohn Enwright: Thanks, Eric.\nMichael Schwindle: Thank you Eric.\nOperator: Thank you. That does conclude the question-and-answer session and I’ll turn the conference back over to Jackie Ardrey for closing remarks.\nJacqueline Ardrey: Thank you. In closing, we’re committed to returning both of our brands to healthy top and bottom line growth and generating strong cash flow through project restoration, which I believe will deliver value to our shareholders over the long-term. This year by focusing on stabilizing sales, expanding gross margin, and controlling expenses, we believe we can at a minimum nearly double year-over-year operating income and more than double EPS. We have an exciting future ahead. Thank you for joining us today and we look forward to sharing our progress with you on our second quarter call on August 30th.\nOperator: Thank you. That does conclude today’s conference. We do thank you for your participation. Have an excellent day.\nFollow Vera Bradley Inc. (NASDAQ:VRA)\nFollow Vera Bradley Inc. (NASDAQ:VRA)\nReceive real-time insider trading and news alerts",
  "word_count": 3846,
  "scraped_at": "2026-02-14T13:47:20.583792"
}