{
  "article_id": "34fc86dcc8c4",
  "url": "https://www.bbc.co.uk/sport/football/66562418",
  "title": "England lose Women's World Cup final: Lionesses miss opportunity to cement legend status",
  "date": "2023-08-20T15:56:54.000Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_bbc",
  "body_text": "England lose Women's World Cup final: Lionesses miss opportunity to cement legend status\n- Published\nWhen the full-time whistle went in Sydney and the Lionesses fell to the floor, many in tears, it felt like their best opportunity to win a Women's World Cup had passed them by.\nOptimism had swept through England beforehand - they were European champions and had only lost once in 38 games under manager Sarina Wiegman, widely considered the best female coach in the world.\nThey had seen off serious injuries and a two-match suspension for Lauren James to make it to the final, overcoming obstacles, grinding out results and finding ways to win when they weren't at their best.\nThey just needed to do it once more.\nBut England's luck had run out, Wiegman's genius had been tested to the limits and they simply came up against a much better team on the day.\nSpain's talent was unquestionable even before they had kicked a ball. Their starting XI contained seven players who won Barcelona's second Women's Champions League crown in June.\nThey had Ballon d'Or holder Alexia Putellas on the bench having not quite returned to full fitness. But a dispute involving 15 players and the Spanish football federation meant some stars were missing in Australia.\nAs a result, England went into the final knowing it would be a tough match but full of confidence - they had seen off Spain in the quarter-finals en route to winning Euro 2022 after all.\nDefending champions the United States had been knocked out in the last 16 of the tournament, European giants Germany did not even make it through the group stages and Sweden had seen off Japan, who had impressed early on. This was surely the year England were going to go all the way?\nThey arrived again in Sydney where they had seen off Colombia and co-hosts Australia in the previous eight days. Wiegman even named the same starting XI and this time they had the majority of support in the 75,000 crowd.\nChants of \"En-ger-land\" and \"It's Coming Home\" could be heard within five minutes of kick-off after Lauren Hemp had bounced back up after a crunching tackle from Irene Parades and forced an early save from goalkeeper Cata Coll.\nHemp smashed an effort off the crossbar - things seemed to be going well.\nThen Spain turned up. They had survived England's intense start and quickly worked out where the spaces were in behind their press.\nOne-touch passing, neat flicks, a few nutmegs and intelligent movement saw Spain cause England so many problems that by half-time, with the Lionesses' trailing 1-0, it felt like a bit of a let-off.\nThis was Wiegman's moment to shine and she acted swiftly. On came James and Chloe Kelly for Alessia Russo and Rachel Daly as she switched formations from a defensive back three to the trusted 4-3-3 that has delivered so much success in her two-year tenure.\nIt was an improvement and England started to create opportunities. They were less vulnerable when their full-backs attacked but a handball from midfielder Kiera Walsh in the box gave Spain another opportunity.\nEngland had come from a goal down in Euro 2022 against Spain so when the ever-dependable goalkeeper Mary Earps superbly saved Jenni Hermoso's penalty, it felt like that could be the catalyst for a momentum shift.\nWiegman said afterwards she had been \"convinced\" England would score but something was missing this time, Spain looked comfortable and the Lionesses were rapidly running out of ideas.\nA final corner delivery - 14 minutes into stoppage time - was held by Spain goalkeeper Coll and the referee's full-time whistle followed. England defender Lucy Bronze immediately fell to the floor with her face buried in the grass of the six-yard area.\nBronze, who gave the ball away in the build-up to the goal, was the most desperate of all the English players to win. She has a trophy cabinet bursting with individual and club honours but this was the one she wanted the most - the biggest prize in football, the one that would cement her place in history... the World Cup.\nAt 31 years old she may never get a chance to win it again and she was a heartbroken figure as she walked past the trophy to collect a runners-up medal, before watching many of her Barcelona team-mates celebrate lifting it in front of her moments later.\nIt was an image that will live long in the memory.\nHowever, despite the result, the success of this particular Lionesses group will have a lasting impact on women's football in England.\nThey have broken records, created history, challenged societal views on women's sport, asked for more support from the UK government and inspired a nation.\nThey were the team that were supposed to go all the way and complete the fairytale. They were supposed to be the names joining those revered from the 1966 men's team - the only English footballers to have won a senior World Cup.\nThe ingredients were there - it was a golden generation of female players in England, they had the world's best manager and the odds were on their side.\nBut for all the joyous moments they have given supporters, this will always feel like a missed opportunity for a group of players who had given everything.",
  "word_count": 892,
  "scraped_at": "2026-02-14T11:17:45.376888"
}