{
  "article_id": "350be89aebed",
  "url": "https://www.mirror.co.uk/3am/celebrity-news/meet-england-euros-team-wives-33020450",
  "title": "Meet England Euros team - wives and family lives to off - pitch scandals",
  "date": "20240616T121500Z",
  "domain": "mirror.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Meet England Euros team - wives and family lives to off-pitch scandals\nAs Gareth Southgate's England squad prepare for their first game of the Euros 24 in Germany against Serbia, we take a look at the lives of the star players off the pitch, from their wives and girlfriends to their passions and scandals\nEngland fans will be desperately hoping it's coming home as Gareth Southgate's squad gear up for the first game of the Euros - but what are the players really like off the pitch?\nThe England squad, captained by Harry Kane, kick-start their tournament against Serbia, in Gelsenkirchen, Germany, where many of the team's wives and girlfriends, or WAGs, will be cheering them on from the stands.\nThe Three Lions are based at a swanky five star golf resort in east Germany, where they will be supported by their other halves, who include a Love Island star, a fitness instructor and possibly the daughter of a Hollywood actor.\nHere we take a look at at the players' glamorous lives away from football, lifting the lid on their family lives, what they love to do when they aren't kicking a ball around and some of the more shocking moments they'd rather forget.\nKyle Walker\nAge: 34\nClub: Manchester City, right-back\nWife: Annie Kilner\nKids: Six children\nHe may be known for his speed and strength on the pitch, but away from the game Kyle has had a fast-paced personal life too. He wed his childhood sweetheart Annie Kilner in early 2022 after a 12 year relationship but in December last year she was devastated to learn he had fathered a second child with Instagram influencer Lauryn Goodman. He shares sons Roman, 11, Riaan, seven, and Reign, five with Annie and she was heavily pregnant with their fourth child when she discovered his infidelity.\nHe fathered his first child with Lauryn, son Kairo, four, when he was on a break from then girlfriend Annie in 2019 - but she forgave him and they went on to marry. However In October 2022 Lauryn, who lives in a £2.5 million home on the Sussex coast paid for by Kyle, conceived again after he visited London for treatment on a groin strain. Their daughter KK was born last summer.\nIn January Annie booted him out of their £3.5 million mansion in Prestbury, Cheshire and he rented a penthouse apartment in nearby Manchester. Kyle, who admitted he had made \"idiot choices\" is now thought to be back in the family home and working on his marriage to Annie after the birth of their fourth son brought them back together.\nHis rocky marriage hasn't been the only scandal to hit the headlines. In 2013 he was pictured sucking on a balloon of laughing gas. He took full responsibility for his actions and released a statement which read: \"I have now been made aware of the health risks associated with the practice and accept that my actions were of poor judgement. I hope this will in no way influence or encourage others into putting their own health at risk.\"\nIn 2020 Manchester City started a disciplinary procedure after reports Kyle had invited two sex workers to his home during the Covid pandemic - therefore breaking national lockdown rules. Kyle issued an apology to his \"family, friends, football club, supporters and the public\" for his choices.\nIn March this year, it was reported that Kyle had allegedly exposed himself to two women in a Manchester bar after a 2-0 win against Newcastle. Cheshire police confirmed he wouldn't face criminal charges for indecent exposure after he voluntarily attended a police station for questioning.\nJordan Pickford\nAge: 30\nClub: Everton, goalkeeper\nWife: Megan Davison\nKids: Two children\nQuietly confident Jordan has been called down-to-earth despite his huge success. He was born in Sunderland and adores his close-knit family, who are often at his games. His grandad, who he has affectionately called 'knackers' since he was a young boy, revealed that he should actually be called Jordan Pigford, which is the family name, but Jordan's dad Lee changed his name by deed poll after he was cruelly dubbed 'piggy' at school.\nJordan started dating Megan Davison while at secondary school when he was 16 and she was 14. Their son Arlo was born in 2019 and they married in a low-key ceremony, due to the Covid pandemic, in 2020 - with Jordan wearing a baseball cap and ripped jeans.\nThey held a second \"magical\" ceremony in the Maldives in 2022 on an idyllic white sandy beach in front of 13 guests. Daughter Ostara Haze was born last year, with Instagram devotee Megan calling her their \"dinky dotty dream come true\". The family live in a five-bedroom mansion in Cheshire in an area known as the 'golden triangle', which is favoured by footballers.\nFormer teammate George Honeyman, who has called Jordan \"competitive and aggressive\" on the pitch, said he's a ball of energy outside the game too. \"He's the life and soul, no-one dislikes him,\" he said. \"Everyone says goalkeepers are mad, but he genuinely is, he's a nutter, in the nicest way. He loves his boxing, motocross, golf, he's just a full-on, fun guy to be around.\"\nTrent Alexander-Arnold\nAge: 25\nClub: Liverpool right-back / midfielder\nTrent is the nephew of former Reading and Millwall footballer John Alexander. His grandmother Doreen Carling was once in a relationship with legendary Manchester United manager Sir Alex Ferguson. He was introduced to Liverpool-based charity An Hour for Others, which helps underprivileged people in the local community with food, courses and upskilling, by his mum when he was in his teens and has supported it ever since - he is now a volunteer ambassador for the charity. He also plans to buy plots in Liverpool where new football pitches for the community can be built.\nDuring the pandemic in 2020, he teamed up with sportswear company Under Armour to support doctors, nurses and health care workers at the Royal Liverpool University Hospital to provide over 2,000 much needed products. Last year he set up and funded The After Academy, for football players that didn't make it past academy level. The initiative provides training and career opportunities both in and out of the game.\nTrent is a supporter of the Black Lives Matter movement and raised £27,000 auctioning off a special pair of boots he wore which featured the phrase. He is a keen chess player and credits the game with helping him to think \"two or three moves ahead of the opposition\" on the pitch.\nTrent likes to keep his personal life private but was recently spotted out with Hollywood actor Jude Law and Sadie Frost's model daughter Iris. The pair have just featured in a campaign for Guess Jeans where they certainly make a handsome couple. It's thought until recently he had been dating the similarly private Hannah Atkins since 2020, with the couple pictured on holiday together in Ibiza in 2022. In 2021 he was rumoured to be dating British pop star Dua Lipa but he denied the story, calling it the \"strangest gossip\". He lived with his parents in Liverpool, where he was born, until he bought a £2.6million mansion in Cheshire in 2019.\nDeclan Rice\nAge: 25\nClub: Arsenal, midfielder\nPartner: Lauren Fryer\nKids: One son\nDeclan was born in Kingston upon Thames, London but was eligible to play for Ireland because his grandparents were from Cork. In 2019 he apologised for pro-Irish Republican Army (IRA) comments he had made on social media in 2015, calling his posts \"naive\". His cousin Finley Munroe is a professional player for Aston Villa and he's close friends with Man United's Mason Mount.\nHe has been with his girlfriend Lauren Fryer since they were teenagers and they welcomed their first child together in 2022. To mark the occasion, Declan had two tattoos, one with son Jude's name and date of birth and the other, his star sign, Leo. The couple, who also share a Cockapoo called Raffa, are notoriously private but in April this year Lauren deleted all of her Instagram pictures and videos after she received cruel trolling over her appearance, with one cruelly claiming Declan had \"low standards\".\nJude Bellingham\nAge: 20\nClub: Real Madrid, midfielder\nPartner: Laura Celia Valk\nJude was born in Dudley, Birmingham to parents Denise and Mark. His dad was a sergeant in the West Midlands Police until 2022 and was also a top scorer in non league football. His younger brother Jobe plays for Sunderland, where their dad has recently relocated to to support his son.\nJude's reputation as one of the best players in the world and his ripped physique has helped him attract the attention of reality star Kim Kardashian, who recently featured him in a campaign for her shapewear range, SKIMS. In it, Jude is seen wearing nothing but a pair of grey boxer shorts and showing off his toned torso.\nJust a day after Jude's campaign was launched, his girlfriend, Dutch model Laura Celia Valk, appeared in her own project with lingerie brand Victoria's Secret. In a video she shared of herself, she can be seen in a Paris hotel wearing a pink corset top, matching pants and a white silk robe.\nThe couple originally planned to keep their relationship secret but Laura reportedly let slip about their romance while on a photoshoot. She has been visiting him from Amsterdam where she lives, at his home in Madrid. His mum presumably approves because she also lives there with Jude after she upped sticks from Birmingham to be with the star and keep him grounded.\nJude, who enjoys visiting local coffee shops and having meals with friends, recently revealed how close he is to his mum and why he wants her there with him: \"Without my mum, sometimes I'd get too low with the lows or too high with the highs and I stay pretty humble because I've got her around,\" he told the Daily Mail. \"It's also great to have her there because she's a great laugh as well. We get on so well and we're always doing stuff together.\"\nPhil Foden\nAge: 24\nClub: Manchester City, midfielder\nPartner: Rebecca Cooke\nKids: Two children, another on the way\nKeen fisherman Phil was born in Stockport, Manchester where it's thought he met long-term girlfriend Rebecca Cooke at a party when they were both teenagers. Rebecca gave birth to their first child, son Ronnie, in 2019 when she was 18. Their daughter True followed in 2021 and they are currently expecting their third child.\nAlthough she regularly supports Phil at games where she can be seen in the stands and hugging him after a match, Rebecca tends to stay out of the spotlight and the pair generally keep their private life off of social media.\nFamily man Phil likes to keep a stiff upper lip but has spoken in the past about how important his children are to him and recalled how his life altered when Ronnie came along: \"I was there for the birth. I walked out of the room, gave it a little tear and then went back in like nothing happened,\" he said. \"I'm not one for crying in front of people. I like to be on my own, but I was there in the room, watched it happen and it was a special moment. Your life changes.\" Despite loving spending time with his family at their £3 million mansion in Cheshire, he has confessed his career has meant he's missed some major milestones, including when son Ronnie started to walk.\nLast year Phil set up an Instagram account for Ronnie, which immediately went viral thanks to his cheeky personality and he now has 4 million followers, with fans giving him the nickname El Way, which means The Dude. The little lad is often at games with his dad and is recently reported to have signed a modelling contract.\nHarry Kane\nAge: 30\nClub: Bayern Munich, striker\nWife: Katie Goodland\nKids: Four children\nEngland captain Harry went to Larkswood Primary School in east London, which is where he met childhood sweetheart Katie Goodland. They went on to attend David Beckham's former school, Chingford Foundation School, together and dated for many years until they married in 2019.\nThey share four children together, daughter Ivy born in 2017, second daughter Vivienne born the following year, son Louis, who they welcomed in 2020 and second son Henry, who arrived last year. Harry has previously spoken about how lucky he feels to have found his wife at such a young age. \"If I was single now and meeting people, you'd never know if they were with you for the right reasons,\" he told the Evening Standard. \"'Is it the money? You'd never really know. So I'm lucky that I've got a childhood sweetheart.\"\nDespite Harry's successful and lucrative career, which Katie has described as a \"little crazy\", she was determined to have her own profession and went to university - she is now a fitness coach. When Harry moved from Tottenham Hotspur to Bayern Munich, Katie initially stayed at their £17 million family home in North London but last year relocated to Germany where they live in a £30m hilltop mansion in an area dubbed 'the Beverly Hills of Bavaria'. The incredible property is complete with a spa and sundeck with river views and a garden on the edge of a forest.\nIn April this year, three of their children had a miracle escape after being involved in a three-car crash in Germany. Harry, who always kisses his wedding ring finger after scoring a goal, had just landed in London when the crash happened. A local volunteer fire chief said everyone involved was \"very lucky\" not to have been seriously injured.\nIvan Toney\nAge: 28\nClub: Brentford, forward\nKids: Two children\nNorthampton-born Ivan is a cool customer on the pitch, where he calls himself \"the big dog\". Outside the game, he has almost 600k followers on Instagram where he loves to reveal how he enjoys his huge footballer's pay packet. He revels in fashion and is often seen shopping for designer labels, which he proudly models on his account, including Prada, Louis Vuitton and Gallery Dept. - an LA based label popular with rappers.\nIvan also posts snaps of himself on private jets and yachts enjoying the high life on his regular trips abroad to countries such as Dubai, the Caribbean and Marbella. But he's a family man too and often shares pictures of himself doting on his two young children - Ivan Jr, who was born in 2019 and who he shares with ex-girlfriend and businesswoman, Katie - and Ikari. He is thought to be single currently but keeps his personal relationships private.\nHe previously told the Sun how he would describe himself, saying: \"I'm confident, a winner, a joker and someone who will help anyone.\" This was proved when he set up the Ivan Toney St Vincent Volcano Relief Fund to help those affected by the La Soufriere eruption in 2021, near to where his grandparents were born.\nIvan returned to the football field in January this year following an eight month ban for betting offences. He pleaded guilty to 232 of the 262 charges brought by the FA for breaching its gambling laws between 2017 and 2021. He had his suspension almost halved after he was diagnosed with a gambling addiction that he needed help with. He bet 126 times on games in the same competitions he was playing in, 29 times on his team's games and 13 times on his own team to lose, but did not play in any of those games. The regulatory commission concluded that he was not a match-fixer and Brentford said it considered the matter closed and was doing all it could to support him and his family.\nWhile he was off, Ivan set about having his body covered in meaningful tattoos, with tributes to his mum, sisters and children, as well as one which reads, 'My life is my mess'. He told the Daily Mail it means he wants to \"own it and get on with it\".\nKieran Trippier\nAge: 33\nClub: Newcastle United, right-back\nWife: Charlotte Trippier\nKids: Three children\nBorn and raised in Manchester, Kieran now lives in a beautiful home in Tyneside, Newcastle with his wife Charlotte Trippier and their three children. The couple married in Cyprus in 2016, the same year their first child Jacob was born. In 2019 they welcomed daughter Esme Rose and in 2022 they welcomed a new baby, who has not yet been publicly named.\nWhen Kieran moved to Atletico from Spurs in 2019, Charlotte later revealed how difficult she found the move to Madrid and how lonely she felt with the language barrier, having no family and friends around her. She said she felt depressed and thought she may have to move back home. Family man Kieran put his wife first and supported her decision saying: \"It was a difficult choice as I was playing Champions League football for one of the biggest clubs in Europe, I got offered a new contract there; but family are more important than football to me, so family comes first.\"\nJarrod Bowen\nAge: 27\nClub: West Ham United, right winger or forward\nPartner: Dani Dyer\nKids: Two children\nJarrod was raised in Herefordshire, where his grandfather was a farmer. He would stay with his grandparents at weekends and help out on the farm and has said he \"would love to\" go back to it after his career in football. His dad Sam was a semi-professional footballer and won a trial with Harry Redknapp at West Ham but the move fell through after his club Merthyr Tydfil demanded too much money.\nOne of West Ham's biggest fans, Danny Dyer, was recently thrilled to learn Jarrod had made the Euros team, particularly as he's his son-in-law, in all but name. Danny's daughter, Love Island and reality TV star Dani, started dating Jarrod in 2021 and the couple welcomed twin girls Star and Summer in May last year.\nWhen former EastEnders actor Danny found out Jarrod's news, he told the Daily Mail: \"'I'm over the moon! That's great for my Dani as well, and Jarrod, because they didn't quite know what they were doing this summer, you know, having a holiday or not. That also means I'm going to the Euros!\"\nWhat do you think of Gareth Southgate's England squad? Let us know in the comments below.\nEngland fans who want to support their team but aren't keen on wearing traditional football shirts can still mark the tournament in style. M&S is the official tailor of the England squad for the Euros and has unveiled a new limited edition collection of men's separates perfect for work and play to mark the occasion.",
  "word_count": 3139,
  "scraped_at": "2026-02-14T12:47:42.115609"
}