{
  "article_id": "352f7906e3d8",
  "url": "https://www.brisbanetimes.com.au/culture/tv-and-radio/australia-in-its-sights-american-footy-s-us-1b-global-tv-play-20260204-p5nzc1.html",
  "title": "NFL has Australia in its sights : American footy US$1 billion global TV play",
  "date": "20260204T051500Z",
  "domain": "brisbanetimes.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Australia in its sights: American footy’s $US1b global TV play\nWhen champion punter Michael Dickson runs onto the field in next Monday’s Super Bowl LX clash between the Seattle Seahawks and the New England Patriots, there’s more riding on the shoulders of the 30-year-old Sydney-born sports star than the glory of victory in America’s tribal football war.\nDickson is the current poster boy for Australia in the NFL, which has outlined an ambitious global strategy to expand the American football code’s footprint and fandom. The league’s aim is to create a schedule of international fixtures that could be worth as much as $US1 billion ($1.4 billion) in their own streaming television rights deal.\nThough American football has always enjoyed a modest following in Australia, we have emerged as the NFL’s sixth-biggest non-US market, behind Mexico, Canada, Germany, the UK and Brazil. In Canada, for example, the teams like the Buffalo Bills and Seattle Seahawks command loyal local fan bases in Toronto and Vancouver, while Germany is the NFL’s biggest European market for streaming subscriptions and merchandise sales.\nIn Australia, hard numbers are more elusive, but in raw terms 2025’s Super Bowl LIX pulled a national audience of 892,000 viewers on Seven, with a “reach” – that is, a total pool of viewers who tuned in for any part of the telecast – of 2.6 million people. Estimates say Australia might be the home of as many as 5 million potential NFL fans.\n“Australians love sport; we are a sporting nation,” says Kylie Watson-Wheeler, senior vice-president and managing director of Disney, and head of ESPN Asia Pacific, which has aired the Super Bowl in Australia for 26 years. “When given the opportunity to be exposed to a different sport, we latch on, and we engage.”\nA critical piece of the NFL’s strategic jigsaw for 2026 is staging the code’s first-ever regular-season game scheduled to be played in Australia at the Melbourne Cricket Ground (MCG) in September, with the Los Angeles Rams designated as the “home” team.\nUnlike many international fixtures, that game will not be an exhibition match, but an in-competition, for-points clash.\n“I think that’s a terrific strategy,” Watson-Wheeler says. “The broadcast is incredibly important and key to getting scale of connection with audiences around the world, but sport in person is a pretty exciting premise. The opportunity to experience it in person does create the potential of much deeper fandom.”\nThe NFL operates a “global markets program” within the code, in which various of the 32 competing clubs are given “licences” for specific countries, and permitted to “build brand awareness and fandom ... through fan engagement, events, commercial opportunities and NFL Flag development” in those countries.\nThe four clubs licensed to “market” themselves in Australia are the Los Angeles Rams, Las Vegas Raiders, Philadelphia Eagles and Seattle Seahawks.\nThe NFL will not announce its full 2026 season plans until May, but they have confirmed matches will be held in Madrid, Paris, Rio de Janeiro, Munich, the planned Los Angeles Rams home game in Melbourne and three matches in London.\nA report in 2025 said the NFL’s international schedule could be spun off into its own rights deal, worth as much as US$1 billion on its own. The code’s current 11-year US deal, spread across Amazon, CBS, ESPN/ABC, FOX, and NBC, is worth around $US110 billion. (Those deals expire in 2029.) The NFL also finalised a deal this week for a $US3 billion, 10 per cent stake in ESPN.\nWatson-Wheeler, who is also president of the Western Bulldogs AFL club and on the board of Tennis Australia, describes the streaming push into live sports as “a natural evolution of the media landscape.\n“From a streamer perspective … sport brings in a dedicated, committed audience that all tune in regularly,” she says. “From the other side, streaming audiences are growing at a rapid rate. And sports want to be where the eyeballs are.\nIn Australia alone, that has seen Amazon push into cricket, basketball and NFL, Paramount+ into A-League soccer and Ultimate Fighting Championship (UFC), and Kayo into cricket, motorsport, netball, golf and the UFC. Stan owns English Premier League, the UEFA Champions League and the FA Cup, and with Nine, the owner of this masthead, rugby union and the four tennis Grand Slams. Seven and Nine carry AFL and NRL respectively, but Kayo also carries both.\nThe Broadcasting Services Act includes anti-siphoning provisions that require the Olympic and Commonwealth Games, the Melbourne Cup, the Australian Open, the Australian Grand Prix and certain cricket, rugby league, rugby union and AFL fixtures be carried on free-to-air TV.\nUS sport is not protected in that way, and, like American basketball, American football – or “gridiron” as it is sometimes called – has enjoyed rising popularity, particularly with younger, social media-engaged audiences. ESPN in Australia airs the “big four” US leagues: NFL, NBA (basketball), NHL (hockey) and MLB (baseball), as well as WNBA, Australian men’s (NBL) and women’s (WNBL) basketball.\nIt also helps that young Australians have Australian stars in the NFL to focus their energy on. Aussies currently playing in the NFL include Daniel Faalele (Baltimore Ravens), Mitch Wishnowsky (San Francisco 49ers), Tory Taylor (Chicago Bears), Jeremy Crawshaw (Denver Broncos), Cameron Johnston (Buffalo Bills), Jordan Mailata (Philadelphia Eagles), the first Australian to play on a winning Super Bowl team, and Dickson (Seattle Seahawks), the NFL’s highest-paid punter.\nThose Australians create “the opportunity for an authentic emotional connection with fans,” Watson-Wheeler says. “To see someone who speaks like you and sounds like you to be playing this massive game on the world stage, it’s pretty extraordinary. As Aussies, we’re proud of our fellow countrymen when they succeed.”\nSuper Bowl LX – the Seattle Seahawks v the New England Patriots – will be televised on ESPN via Disney+, Foxtel, Kayo and Fetch TV, and on the Seven Network, on Monday, February 9, from 10.30am AEDT. Follow all the action on our live blog.\nFind out the next TV, streaming series and movies to add to your must-sees. Get The Watchlist delivered every Thursday.\nMore:",
  "word_count": 1009,
  "scraped_at": "2026-02-14T12:13:23.758675"
}