{
  "article_id": "353aff02f147",
  "url": "https://northeasttoday.in/northeast/tfa-president-pranab-sarkar-counters-pradyots-remarks-highlights-aiff-chief-kalyan-chaubeys-key-initiatives-in-northeast/",
  "title": "TFA President Pranab Sarkar Counters Pradyot Remarks , Highlights AIFF Chief Kalyan Chaubey Key Initiatives in Northeast",
  "date": "20251125T170000Z",
  "domain": "northeasttoday.in",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Agartala, November 25, 2025: Responding to a recent social media post by TTAADC MDC Pradyot Kishore Debbarma questioning the leadership of All India Football Federation (AIFF) President Kalyan Chaubey, Tripura Football Association (TFA) President Pranab Sarkaron Tuesday in a press conference at Agartala defended Chaubey’s tenure and highlighted his contributions to football development across the Northeast.\nPradyot in a social media message had said that “time has come that Indian football has a representative from the Northeast to lead Indian football” and criticised Chaubey’s performance.\nReacting to this, Pranab Sarkar said that such criticism “overlooks the substantial work done under Kalyan Chaubey’s leadership.”\n“Let us acknowledge what Kalyan Chaubey has taken the initiative for — especially for football development in the Northeast,” Sarkar said, adding that no previous AIFF administration had invested so intensively in the region.\nSarkar emphasised that under Chaubey’s leadership, Tripura hosted major national tournaments for the first time, including: Men’s Senior National Santosh Trophy Group Stage (Group D, 2024–25); Women’s Senior National Rajmata Jijabai Trophy (Group G, 2024–25); and Santosh Trophy Group Stage again allotted for 2025–26.\n“This level of national exposure for Tripura football is unprecedented, and it happened only during Chaubey’s tenure,” Sarkar.\nChaubey has made multiple visits to Assam, including Kokrajhar and Bodoland, where development activities accelerated: Bodoland team played an exposure match outside Assam, securing a historic win in Odisha; Kokrajhar hosted two editions of the Durand Cup and Santosh Trophy matches; Guwahati successfully hosted the India vs Afghanistan FIFA World Cup Qualifier; and Football initiatives launched in Karbi Anglong with support from Assam FA and the State Government.\nFor the first time, Imphal hosted Senior Indian men’s international matches, facing Myanmar and Kyrgyz Republic in the Tri-Nation Cup.\nAn MoU for football development between the Govt. of Manipur and AIFF was also signed.\nNagaland has seen significant progress: Four visits by the AIFF President; Successful launch of FIFA Football for Schools; Approval for a new football stadium in Chümoukedima; Introduction of the Nagaland Pro League; Hosting of Dr. Talimeren Ao Girls’ Junior National Football Championship (Tier 2, 2025–26); and A National Championship named in honour of T. Ao.\nUnder Chaubey’s leadership, Arunachal hosted the Santosh Trophy Final Round, after which the state approved a ₹200-crore football stadium; Hosted the SAFF U-19 Championship, a historic first; Proposed high-altitude training centre in Tawang; and The Annual General Meeting of the current AIFF regime was also held in the state.\nMeghalaya hosted: FIFA International Friendly (India vs Maldives); AFC Asian Cup Qualifier (India vs Bangladesh); Women’s Tri-Nation (India, Nepal, IR Iran); Chaubey also met Chief Minister Conrad Sangma to discuss further development.\nIn Mizoram, Chaubey attended the Chintan Shivir on Northeast sports development.\nIn Sikkim, he chaired the first Executive Committee Meeting of the new AIFF regime. Sikkim Premier League and Sikkim Gold Cup continue to flourish.\nEnding his statement, Pranab Sarkar said, “Criticism must be based on facts. The Northeast has received unprecedented attention and opportunities under AIFF President Kalyan Chaubey. Instead of dismissing his efforts, we should recognise how much he has delivered for our region.”",
  "word_count": 514,
  "scraped_at": "2026-02-14T14:20:43.463507"
}