{
  "article_id": "3565bc896b35",
  "url": "https://www.themag.co.uk/2025/03/newcastle-1-sunderland-0-record-crowd-manager-sent-off-carabao-cup-presentation-newcastle-united-womens-team/",
  "title": "Newcastle 1 Sunderland 0 , record crowd , manager sent off , Carabao Cup presentation",
  "date": "20250323T194500Z",
  "domain": "themag.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Newcastle 1 Sunderland 0, record crowd, manager sent off, Carabao Cup presentation\nNot a bad day at St James’ Park on Sunday, as the final score read Newcastle 1 Sunderland 0.\nThe Newcastle United Women’s team victorious in the derby match.\nThey made it a derby double, with a 2-1 win on Wearside earlier in the season, Sunderland losing both games.\nDown on Wearside, that derby match earlier this season attracted a crowd of 15,387, what was then a new record for the second tier of women’s football in this country.\nWell, today’s St James’ Park attendance totally smashed that, with 38,502 to see Newcastle 1 Sunderland 0. Shania Hayles getting the winner in the 78th minute, only nine minutes after coming off the bench.\nThat 38,502 crowd figure also smashed a number of other attendance records, as before today the previous records had stood:\n24,092 – The previous attendance record for a Newcastle United Women’s team match for a league game.\n28,565 – The previous attendance record for any Newcastle United Women’s team match, this crowd in a cup game.\nTo add to the drama of today’s derby win, Newcastle United manager Becky Langley was red carded in the final stages of today’s victory.\nTo complete the action, half-time saw Newcastle United CEO Darren Eales and former NUFC Captain Bobby Moncur (the most recent United Captain to lift a trophy until a week ago…) present the Carabao Cup trophy to Sunday’s St James’ Park crowd.\nOfficial Newcastle United announcement – 19 March 2025:\n‘With ticket sales ticking over 26,000, Newcastle United Women are set to make history once again at St. James’ Park on Sunday by breaking the Barclays Women’s Championship attendance record.\nThe Lasses take on Sunderland Women, who currently hold the record – one which has repeatedly been smashed over the last four years.\nBack in October 2021, the Women’s Championship and Sheffield United Women were keen to announce their matchday attendance against Matt Beard’s Liverpool Women, with a push having been made to set a record.\nDespite losing at home, the Blades could boast a 4,100 crowd, a record at the time in the women’s second tier. But while this was impressive, for context, United attracted over 7,000 for their title-clinching game against Huddersfield Women last season.\nFor a second time in six months, Liverpool Women were involved in more history in April 2022, and while also clinching promotion to the Women’s Super League they played in front of 5,752 fans against Bristol City Women at Ashton Gate – the first time a Women’s Championship game had been watched by over 5,000 spectators.\nCurrent Newcastle players Rachel Furness and Charlotte Wardlaw were in that Liverpool squad and look certain to set another record on Sunday, albeit with at least 21,000 more fans cheering them on this time.\nThere was a boom in women’s football from the beginning of the 2022/23 campaign, largely down to the success of the England Lionesses, who won the Euros that summer.\nThat saw attendances boosted up and down the country, and the Women’s Championship made a major step forward by breaking the 10,000 milestone, once again thanks to Sheffield United Women.\nThe Blades didn’t just break that barrier, they smashed through it, recording an impressive 11,137 crowd in November 2022 – although the home side were once more on the wrong side of a defeat, losing 2-0 to London City Lionesses.\nThat record was not beaten for the entirety of the season, and it was only last October when a new attendance record was set.\nOf course, that came in the memorable Tyne-Wear derby earlier this term in which Beth Lumsden’s brace was enough to seal all three points for Newcastle United Women at the Stadium of Light against Sunderland Women.\nAs Sunderland looked to push for an attendance near 20,000, which would have almost doubled the previous record, they settled for 15,387, and a large number of those supporters were in black and white.\nSo, with less than five days until Sunday’s return fixture on Tyneside, there’ll be eyes both on the stands and the pitch as United prepare for another historic afternoon.\nNewcastle’s own record attendance in the league came against Bradford City Women in April 2022 when 24,092 Geordies were packed in to roar Becky Langley’s side on in what was their final home match of the 2022/23 campaign in tier four.\nWhile that’s a stunning total for any divisions – especially tier four – the Lasses attracted an even bigger crowd against Barnsley Women in the Women’s FA Cup in November 2022, a game which they fell behind.\nHowever, that record attendance of 28,565 were duly treated to some late drama with United’s top scorer at St. James’ Park, Georgie Gibson, and Sharna Wilkinson netting in the second half to send Langley’s side through.\nUnited are close to history this weekend, not just for the club but also for women’s football as a whole.\nAt the moment, only Arsenal Women, Chelsea Women, Tottenham Hotspur Women, Manchester United Women and Manchester City Women have set attendances over 30,000 in the Women’s Super League, so Sunday is a chance for Newcastle to put not just themselves, but the North East football scene back on the map.’\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 891,
  "scraped_at": "2026-02-14T13:05:48.604086"
}