{
  "article_id": "357184042d4e",
  "url": "https://www.wsls.com/news/local/2025/07/26/ice-hokie-head-coach-and-players-reflect-on-humble-beginnings-a-season-to-remember-and-look-towards-the-future/",
  "title": "Ice Hokie : Head coach and players reflect on humble beginnings , a season to remember , and look towards the future",
  "date": "20250726T160000Z",
  "domain": "wsls.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "BLACKSBURG, Va. – Blacksburg may be quiet for now, but it won’t be long before a little over 37,000 college students descend upon the small town nestled in the foothills of the Blue Ridge Mountains in late August for the beginning of classes this year. For many students and faculty, the beginning of the fall semester marks the start of something new, and the same could be said for 42-year-old Joey Mullen, a father of two and the head coach of Virginia Tech’s Club Ice Hockey Team.\nVirginia Tech, the student body, the alumni and Southwest Virginia have strong Hokie pride that runs deep. That same pride is directly intertwined with the school’s extensive collection of NCAA Division I sports programs: football, basketball, baseball and the list goes on.\nRecommended Videos\nJust ask any Virginia Tech fan to conjure up some sports images or memories in their head. What comes to mind? Maybe it’s Michael Vick bobbing and weaving through defenders on his way to the endzone, as he was known to do so many times in his stint with the school. Or maybe it’s Georgia Amoore and Liz Kitley leading the 31-5 women’s basketball team to a Final Four appearance against Angel Reese and powerhouse LSU. But how many of those fans would bring up ice hockey despite the club’s presence at the school for the past 41 years?\nAlthough not an NCAA Division I program, the club hockey team is the only collegiate men’s ice hockey team that represents the school. The team currently plays in the ACCHL (Atlantic Coast Collegiate Hockey League), which is a conference within Division II of the ACHA (American Collegiate Hockey Association). The ACHA is the governing body of non-NCAA hockey, which covers three distinct divisions, each of which has different conferences within those divisions.\nThe club was founded in 1984 by “a few transplanted New Englanders,” according to the team’s website. Since those humble beginnings, the club has been building a culture that all Hokie fans, hockey and non-hockey fans alike, can be proud of, culminating with a historic 24-4-1 season last year. It’s a testament to the coaching style of Mullen, who has been with the ACHA team for 15 years.\nMullen is no stranger to hockey. One of his uncles is three-time Stanley Cup Champion and Hockey Hall of Famer Joe Mullen; his dad also played pro hockey. Mullen is no stranger to Southwest Virginia either; the Roanoke native has been playing hockey in the area since he was two.\nMullen played junior hockey in the Northeast and at Radford before calling it a playing career. However, Mullen has always wanted to stay close to the game.\n“I didn’t go to college long. I just got into working and started coaching some youth hockey at like 19 [or] 20 years old, just helping out, trying to get back to hockey, and the opportunity at Radford came along. I’ve kind of enjoyed coaching just as much, if not more than like playing,” Mullen said.\nThe “opportunity at Radford” Mullen is referring to was a coaching gig for the school’s club hockey program - the same program he played for during his college years, despite not actually being a student at Radford.\n“It was the early years of, like, the ACHA, which is like our governing body. The rules weren’t very strict, so you could kinda dance around them a little bit. So that’s how I ended up at Radford. It was me and a couple of other guys who played there that didn’t go to Radford,” Mullen said.\nMullen coached at Radford for four years before making the jump to become an assistant coach at Virginia Tech after receiving a call from a friend about an opening at the program.\nMullen said that within his first year at Virginia Tech, the team ran into issues with head coaching, and with just two weeks left in the season, he took over head coaching responsibilities.\nSince taking the reins, Mullen has not looked back; his tenure includes impressive feats such as 200 wins, the most head coaching wins in program and ACCHL history, multiple regional appearances, one National Tournament berth, and a regular season championship in 2021. While these achievements may not be Mullen’s ultimate goal of winning a national championship, they show a much broader significance.\nThese achievements are building blocks that increase team visibility not only amongst recruits but fans as well. The ACHA, which had only 15 teams at its inception in 1991, now stands 460 strong, which is reflective of the growth of hockey on a national scale. Recent success from teams like the Washington Capitals and Carolina Hurricanes has also increased interest in the sport right here in our region, making it very easy for Mullen and the club to recruit impressive young talent on a consistent basis.\nSome of that aforementioned young talent includes rising sophomore defenseman JH Lages and rising junior winger Kam Khazai. Both Khazai and Lages are from McLean, Virginia, an area in the Northern part of the state just a stone’s throw away from Washington, D.C., which has seen a boom in youth hockey thanks in no small part to Alex Ovechkin and the rest of the Washington Capitals.\nAccording to a 2024-2025 USA Hockey membership poll by state, a total of 11,085 players ranging from 6 years old to 19 years old and over registered to play hockey in Virginia, almost a 6,000-player increase from a similar USA Hockey Report in 2003.\nKhazai is just one of many who were drawn into playing hockey by watching the likes of Ovechkin and Niklas Backstrom, a player who his dad would certainly like Khazai to emulate his game after, on their television screens. “I want to do that,” Khazai told his parents one day.\nKhazai’s parents obliged, and his dad took him to see a figure skating coach who taught Khazai how to skate, which turned into hockey eventually.\n“I think, with the Caps winning the Stanley Cup, the exposure in Northern Virginia for hockey’s gone way up. I started playing for a team called Caps Academy, and they didn’t even have like a Double-A team … I went to Triple-A for the Little Caps … now they have Caps Academy, which has grown, and they have so many teams. But yeah, it’s definitely growing and still growing,” Khazai said about his beginnings in hockey.\nKhazai continued to play youth hockey and work his way through the ranks at Caps Academy before landing on a team in Rockville, Maryland, where he honed his skills and continued to grow as a competitor.\n“I met with a coach … Rob. He had, like this summer team called D.C. Selects. That was like the true coaching experience that I got because at my Caps Academy thing, it was all like dads and dad coaches. But Rob actually played … like Rob went to like the Pittsburgh Penguins Development Camp, and so that was like the first true hardcore hockey that I experienced, and I made the team … But ever since then, it was competitive,” Khazai said.\nFor most up-and-coming players looking to play hockey at the collegiate level, the path isn’t always cut and dry, and it certainly isn’t guaranteed. Those who are looking to get scouted by colleges elect to play junior hockey. There are a multitude of junior leagues across North America, including the NCDC (National Collegiate Development Conference). The NCDC is a branch of the United States Premier Hockey League, a team in that league drafted Khazai. However, with the uncertainty regarding playing time and a desire to pursue academics, Khazai chose a different path, which landed him at Virginia Tech and into the lap of coach Mullen.\n22-year-old defenseman JH Lages’ entry into hockey isn’t much different from Khazai’s. Lages’ parents had season tickets to the San Jose Sharks’ inaugural season before eventually moving to the D.C. area.\n“When they moved to the D.C area, and I was born, I was skating…. they had me skating since I was like two or three years old. That was kind of the foundation of it… They weren’t gonna let me play hockey unless I was a good skater, because that’s a very important part of it. So once I was able to show them that I was a good skater, then I started playing when I was like five,” Lages said.\nLages continued his career bouncing around from location to location, club to club, school to school, including stops in New Jersey, Maryland and New England Prep for his junior and senior year of high school, experiences he thoroughly enjoyed.\n“I thought it was a blast. You learn, you meet so many new people, you learn different structures of the game, whether it’s in New Jersey or here, or it’s in Connecticut. You just try to take in the most that you can get…If I had to do it over, I would I would do the same exact thing.”\nUnlike Khazai, Lages decided to pursue the Junior hockey route. The offensive-minded defenseman spent two years, including one year in the OJHL (Ontario Junior Hockey League) in Canada. After two years in juniors, Lages had plenty of D-III offers, but he wasn’t interested in playing hockey at a small school far from home, compounded with uncertainties regarding playing time. After much contemplation, and a tour at Virginia Tech that sealed the deal, Lages decided to stick close to home and play club hockey in Blacksburg.\nLages’ first season with the club, Khazai’s second season and Mullen’s 15th proved to be a memorable one last year - a season Mullen is hoping to build on this fall.\nThe 2024 season started off strong in September despite the club dropping the home opener in Roanoke to N.C State.\nVirginia Tech plays at Lancerlot Sports Complex in Vinton, an arena which both players and coach Mullen have nothing but nice things to say about how accommodating the rink and staff are to the team.\n“We have our own locker room there, like, they’re awesome to us. We get all the good game time stuff like that, like we’re not playing home games at 11 o’clock at night,” Mullen said.\nHowever, the almost 50-minute drive from campus can take its toll on some of the players who also have to balance their responsibilities as students. The distance of the rink from campus can also be a deterrent for students and fans who might otherwise be interested in watching the team play. The situation is a far cry away from a school like Liberty University, whose club team plays at LaHayce Ice Center, an accessible on-campus ice rink that seats 4,000. However, the university is a bit of an outlier in the region, with schools like Radford and UVA playing at off-campus rinks just like Tech.\nAfter the season-opening loss, the Hokies were able to rattle off 13 straight wins, wins that Lages said were more of an “expectation” for the players in the club. Coach Mullen said the team played very clean hockey throughout the stretch.\n“We got to a point….where, instead of game by game, we were breaking it down period by period… We want to win every period, just to keep them motivated, because you can get a little complacent when you’re winning a lot. We didn’t want that to factor in, because we knew the second half of our schedule was gonna be really tough..” Mullen said.\nA loss to Penn State would ultimately cut the winning streak short in November after not seeing a loss the entire month of October; the loss was a tight one in overtime, which meant the club was still able to salvage a point. A point streak that would continue throughout the month of December as anticipation built throughout the locker room for Virginia Tech’s first outdoor game in history in January.\nVirginia Tech had been scheduled to play the University of North Carolina in Charlotte, North Carolina, on Saturday, January 4th, which by pure happenstance, coincided with the Hokie football team’s appearance against Minnesota in the Duke’s Mayo Bowl Friday, January 3rd, in the same city. The football team played in Bank of America Stadium, and the hockey team at Truist Field, where the Charlotte Knights, a minor league affiliate of the Chicago White Sox, play.\nIt was a game and weekend trip that Mullen, Lages and Khazai will not soon forget. It was also a game the club was to determined to win.\n“I give a lot of credit to the kids because we brought them back like three days after Christmas to practice for a whole week…and had a little practice. So we were prepped. We were ready,” Mullen said.\n“Prepped and ready” is an understatement; the Hokies came out swinging, scoring three goals in the first 10 minutes, taking a strong 4-0 lead at the end of the first period. It was a commanding lead they never surrendered, blanking UNC 6-0 on a picturesque, albeit cold, Saturday night in Charlotte.\nThe game and trip was a tremendous bonding experience for the club, some even attended the football team’s bowl game the night before. The trip also boosted fan recognition and team visibility on multiple fronts.\nLots of Hokie action in Charlotte! 🦃🏈🏒 Come on out to the Duke’s Mayo Bowl on Jan. 3, and don’t miss the Club Hockey team taking on UNC at Truist Field the next day, Jan. 4! pic.twitter.com/Aq4lKJuBi5\n— Brent Pry (@CoachPryVT) December 19, 2024\nPop Watson, quarterback for Virginia Tech, who played in the Duke’s Mayo Bowl Friday, was named as an honorary captain for the hockey game along with offensive lineman Brody Meadows.\nWatson and Meadows showing up for the hockey game Saturday speaks volumes to the camaraderie of Hokie athletics. Watson even ate a pregame meal with the team, a gesture that the club greatly appreciated. The game was also live-streamed on ESPN+ for those who were unable to make the trek to Charlotte.\nAfter the outdoor game, it was back to business as usual, the team finished the regular season with a 5-2 record in January. The team’s 24-4-1 finish, combined with a successful showing in the ACCHL playoffs, was enough to propel them to regionals in Evansville, Indiana, after barely missing regionals in the 2023-2024 season. It was the team’s first regionals appearance in five years.\n“We nearly missed out on it the last couple of years by like a spot or two, and that was kind of disappointing for those seniors that have kind of worked to get us back to where we’re at now. So it was super rewarding this year. For some of these guys to get a chance to get there. I wish we could have done more damage,” Mullen said.\nThe Hokies ultimately lost 3-2 in the first game of regionals, an early bird special, 11 a.m. game against the University of Ohio. Tech lost in heartbreaking fashion in double overtime. Lages, Khazai, and Mullen all shared the same sentiment: the team could have gone to nationals.\n“I mean, we all wanted to go to nationals…. A bunch of people were also burnt out. There’s a lot of hockey and it’s a lot of effort throughout the season,” Khazai said.\n“I thought we really had the team [to make nationals]. I mean losing 3-2, in double overtime, is tough...especially a game. I thought we played pretty well and could have won,” Mullen said.\n“There was a ton of upsets… it’s playoff hockey. It’s why it’s the best sport in the world, the seed just has no like implication on anything… It’s just it’s one hockey game. Doesn’t matter what seed you are. It doesn’t matter who was good in the regular season… Just who can be better in 60 minutes.. or in our case, you know 90, or 80…It was a close game, we, had some moments there where we thought we were gonna close the door in overtime, but you know that’s hockey for you. You win some. You lose some…” Lages said.\nA memorable season came to a brutal and abrupt close for the Virginia Tech hockey team, a season that had numerous personal highlights for both Khazai and Lages. Khazai finished the season with an astounding 26 goals and 41 assists, racking up 67 points in total playing on the top line. His efforts did not go unnoticed. He received the team’s unsung hero award. Khazai said that it is always great to be recognized by the team and staff.\nLages was also able to produce at a high level. The freshman defenseman took on the top defensive pairing role with ease; he was able to garner 12 goals and 24 assists for a total of 36 points. Lages also received the team’s Rookie of the Year award and was named the ACCHL’s Premiere Division Defenseman of the Year.\nThe historic year combined with a bolstered and consistent social media presence, which was carefully crafted by a student-run media team, was the exact recipe the club needed to boost fan recognition and team chemistry. Right now, the team’s socials have amassed a little over 7,000 followers across all major platforms (Instagram, Facebook, X).\nThe Virginia Tech Hockey Network, a student-run broadcast network, has also increased visibility for the team and provides insightful analysis, podcasts and even pre-game shows for wall-to-wall coverage of the team.\n“It was really cool to watch. And we’ve seen a lot of other teams like Liberty does a really high end product. N.C. State, it’s a high-end product like that.You kind of want to keep up with them and emulate what they got going on …. just to get our name out there and kind of show everybody what we’re about, what we do. It’s definitely helped…We reach kids from all over the country now,” Mullen said.\nAs summer turns to fall in just under 60 days the club and Mullen set their sights on the ultimate prize: 2026 Nationals in St. Louis. It’s a goal that both the players and Coach Mullen believe is attainable, in the sports world, that is called “buy in”. Everyone has to “buy in,” and with the culture that has been created at Virginia Tech, that is exactly what Coach Mullen and his staff have. But until then, Coach Mullen, Khazai and Lages have to take things one step at a time, and that first step is tryouts, next wil be the regular season and playoffs, followed by success in regionals, and then and only then will they be on their way to St. Louis.\nJust about a month away before 37,000 students return to campus, around 30 of those returning 37,000 will play club ice hockey this year and compete for the ultimate prize in the ACHA.\nFor more information on the club, click here.",
  "word_count": 3157,
  "scraped_at": "2026-02-14T12:43:59.191447"
}