{
  "article_id": "358f83a164a2",
  "url": "https://english.news.cn/20251015/a767552d65604a7a87f94aa5ce4320bd/c.html",
  "title": "Xinhua photos of the day - Xinhua",
  "date": "20251015T033000Z",
  "domain": "english.news.cn",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Tourists stand around the colossus of ancient Egyptian pharaoh Ramses II at the Grand Egyptian Museum in Giza, Egypt, Oct. 14, 2025. Egypt's Grand Egyptian Museum (GEM) is temporarily closed to the public from Oct. 15 to Nov. 3 in preparation for its official opening, scheduled for early November, according to an announcement published Monday on the museum's official website. (Xinhua/Ahmed Gomaa)\nAn aerial drone photo taken on Oct. 9, 2025 shows red-crowned cranes at a wetland of Naoli River national natural reserve in northeast China's Heilongjiang Province. Migratory birds are about to fly south in the migratory season in Heilongjiang Province. (Photo by Han Yang/Xinhua)\nPeople welcome released Palestinian prisoners at Nasser Medical Complex in the southern city of Khan Younis, Oct. 13, 2025. Hundreds of Palestinian prisoners released by Israel on Monday arrived in the Gaza Strip under a ceasefire and prisoner exchange deal reached between Israel and Hamas, with mediation by Egypt, Qatar, and the United States. (Photo by Rizek Abdeljawad/Xinhua)\nLiu Luyang (1st L), goalkeeper of Henan, makes a save during the U18 men's Group A football match between Guangdong and Henan at China's 15th National Games in Shenzhen, south China's Guangdong Province, Oct. 14, 2025. (Xinhua/Mao Siqian)\nThe International Monetary Fund (IMF) chief economist Pierre-Olivier Gourinchas (C) speaks at a press briefing on World Economic Outlook in Washington, D.C., the United States, Oct. 14, 2025. IMF on Tuesday raised its global economic growth for 2025 to 3.2 percent, 0.2 percentage point higher than the July forecast, the latest World Economic Outlook report said. (Xinhua/Li Rui)\nThis photo taken on Oct. 13, 2025 shows the \"Istanbul Bridge,\" the first vessel on the China-Europe Arctic container express route, arriving at Port of Felixstowe in Britain. After a 20-day voyage, the first vessel on the China-Europe Arctic container express route arrived Monday night at the Port of Felixstowe in east England. (Xinhua/Li Ying)\nChildren from a kindergarten pick up rice ears in a field in Deqing County of Huzhou City, east China's Zhejiang Province, Oct. 14, 2025. Theme events have been carried out across China to mark World Food Day that falls on Oct. 16 annually. (Photo by Ni Lifang/Xinhua)\nU.S. President Donald Trump (L) welcomes Argentine President Javier Milei at the White House in Washington, D.C, the United States, Oct. 14, 2025. (Xinhua/Hu Yousong)\nAn aerial drone photo taken on Oct. 4, 2025 shows cars ready for shipment and export at a port area in Nanjing, east China's Jiangsu Province. China's new energy vehicle (NEV) sector maintained strong momentum in production and sales in the first nine months of the year, according to industry data released Tuesday. (Photo by Yang Suping/Xinhua)\nA guest from Ethiopia tries Chinese embroidery during an exhibition showcasing China's progress in digital and intelligent empowerment for women and girls, in Beijing, capital of China, Oct. 14, 2025. The exhibition was opened on Tuesday as a side event of the Global Leaders' Meeting on Women. (Xinhua/Liang Xu)\nFrench Prime Minister Sebastien Lecornu leaves after the first weekly cabinet meeting of the new government at the Elysee Palace in Paris, France, Oct. 14, 2025. Sebastien Lecornu on Sunday evening unveiled the lineup of his new government, comprising a total of 34 ministers, according to the Presidency. (Xinhua/Gao Jing)\nModels present creations during the opening ceremony of an ethnic clothing festival held in Chuxiong, southwest China's Yunnan Province, Oct. 13, 2025. Creations with designing characteristics of intangible cultural heritage were presented at the event. (Xinhua/Peng Yikai)\nThis photo shows an intelligent digital pet displayed at the Combined Exhibition of Advanced Technologies (CEATEC) 2025 in Chiba Prefecture, Japan, Oct. 14, 2025. The CEATEC 2025 kicked off here on Tuesday. (Xinhua/Jia Haocheng)",
  "word_count": 614,
  "scraped_at": "2026-02-14T12:13:16.718784"
}