{
  "article_id": "35c7ad7c86f0",
  "url": "https://www.cardchronicle.com/2023/9/5/23859818/tuesday-afternoon-cardinal-news-and-notes-louisville-cardinals",
  "title": "Tuesday afternoon Cardinal news and notes",
  "date": "20230905T181500Z",
  "domain": "cardchronicle.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "—Spread check: No line.\nTuesday afternoon Cardinal news and notes\nHappy fourth birthday to our Virginia girl who is begging mom and dad to get her back to a game for the first time in a couple years.\n—Louisville kicker/punter Brock Travelstead has been named the ACC Specialist of the Week.\n—The Card are eager to show improvement in week two, but they certainly aren’t overlooking Murray State.\n—The Jeff Brohm radio show returns tonight from 7-8 at the Roosters in Fern Creek. You can listen to the show live on 970 WGTK or 93.9 The Ville.\n—It was quite the Labor Day weekend for Cardinal sports.\n—The 4-0 Louisville field hockey team is up to No. 5 in this week’s coaches poll. I’m not sure how Northwestern, a team Louisville defeated on their home field, is No. 3, but whatever.\n—ESPN’s Andrea Adelson has Louisville at No. 6 in her post-week 1 ACC power rankings.\n—It’s a monster night for the 13th-ranked Louisville men’s soccer team, which will host preseason No. 2 Kentucky at 8 p.m. The ACC Network will have the TV coverage.\n—The boys are fired up.\n—Brett McMurphy has Louisville at No. 25 on his week two AP poll ballot.\n—Just like everyone was talking about all offseason, Louisville caught an awful break by having to play Duke but not getting to play Clemson this fall. I thoroughly enjoyed all the Dabo Schadenfreude last night.\n—Cardinal Authority keeps tabs on how Louisville’s football commitments performed in their high school games last weekend.\n—Your 2-minute guide to Week 1 in the ACC.\n—U of L women’s basketball standout Sydney Taylor has been named to the USA 3x3 U23 Nations League Final Team.\n—The latest Cardinal Sports Zone podcast features Chris Redman and Ibn Green.\n—The second-ranked Louisville volleyball team will hit the road to face Dayton on Wednesday before Sunday’s nationally televised showdown against Penn State.\n—If you don’t want your own complaints thrown back in your face, you better not lose the game.\n—U of L women’s golf is in 5th place after two rounds at the Boilermaker Invitational.\n—The latest From the Pink Seats podcast recaps the win over Georgia Tech and looks ahead to Thursday night against Murray State.\n—Your Cardinal sports schedule for the rest of the week ahead:\nTuesday, September 5\nWomen’s Golf at Boilermaker Classic\nMen’s Soccer vs Kentucky - 8 pm ET (Dr. Mark & Cindy Lynn Stadium)\nThursday, September 7\nWomen’s Soccer at Indiana - 7 pm ET\nFootball vs Murray State - 7:30 pm ET (L&N Federal Credit Union Stadium)\nFriday, September 8\nField Hockey vs Ohio State - 6 pm ET (Trager Stadium)\nMen’s Soccer at Syracuse - 8 pm ET\nSaturday, September 9\nMen’s Golf at Valero Texas Collegiate\nSunday, September 10\nMen’s Golf at Valero Texas Collegiate\nField Hockey vs VCU - 12 pm ET (Trager Stadium)\nVolleyball vs Penn State - 1 pm ET (L&N Federal Credit Union)\nWomen’s Soccer vs Wyoming - 5:30 pm ET (Dr. Mark & Cindy Lynn Stadium)\n—C.L. Brown writes that in just one game, Jeff Brohm showed why he was the right hire for the U of L football program.\n—Brett McMurphy’s latest bowl projections have Louisville squaring off against Texas Tech in the Pop-Tarts Bow.\n—Brendan Marks of The Athletic says that in adding Stanford, Cal and SMU, the ACC sacrificed its basketball identity.\nBut the other issue — and the one that brings us back to the ACC adding Cal, Stanford, and SMU — is perhaps even graver. Because while the ACC does still have great teams, including at least one Final Four participant in three of the last four NCAA Tournaments, it also now consistently has the opposite: horrendous ones.\nThose are the teams sinking the conference and its reputation … and now, three more are on the way.\nUnder the current NET model for NCAA Tournament selection, nonconference success has been key; it’s what, roughly, determines a league’s national standing before conference play begins. The ACC has struggled in that respect the last two seasons, locking it into a difficult and self-defeating stranglehold. Basically, it goes like this: ACC teams lose in the nonconference slate, their NET rankings plummet… and then nonconference play ends, without any further opportunities to showcase themselves at the national level. By then, the league sort of is what it is, with limited mobility in terms of NET rankings — and therefore, quality wins under the quadrant system. Any team that played Louisville last season had nothing to gain in case of a win — the Cardinals were one of the four worst high-major teams in America, per KenPom — and everything to lose. Just ask Clemson, whose mid-February loss to Louisville might have been fatal to its NCAA Tournament résumé.\nIt’s a smothering cycle, one the league has been unable to avoid in recent years with its firmly-established group of cellar dwellers. And guess what? The additions of Cal, Stanford, and SMU are only going to exacerbate the problem threatening the soul of the ACC.\n—As far as potential further expansion goes, the ACC is not interested in adding Washington State or Oregon State.\n—USA Basketball advanced to the semifinals of the FIBA World Cup with a 100-63 smashing of Italy.\n—Murray State’s preview of Thursday night’s tilt at L&N Stadium is here.\n—And finally, the Mike Rutherford Show returns this afternoon from 3-6 on 1450AM/96.1 FM. I am excited to finally get to celebrate a week one victory on the air.",
  "word_count": 923,
  "scraped_at": "2026-02-14T13:37:34.824919"
}