{
  "article_id": "35c7bd661c43",
  "url": "https://theanalyst.com/na/2023/07/womens-world-cup-group-f-preview-france-brazil-jamaica-panama/",
  "title": "Women World Cup 2023 Group F Preview",
  "date": "20230712T161500Z",
  "domain": "theanalyst.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "France and Brazil headline Group F at the 2023 Women’s World Cup, with the two footballing powerhouses expected to coast through to the knockout stages. Jamaica and Panama will aim to have a say in that, with there certainly being the potential for a major shock or two.\nWith the big kick-off just around the corner, look ahead to the action with our Group F preview.\nFrance\nA Manager Making History\nNo one loves drama more than French footballers in the lead up to an international tournament, and this year has been no different. Long-term coach Corinne Diacre was sacked in March after several senior players said they would no longer play for the national team if she continued in charge. Enter Hervé Renard.\nRenard is not the first manager to have led teams at both a men’s and women’s World Cup – John Herdman did it with Canada in 2015 for the women and 2022 for the men – but he is certainly the first manager to go to two World Cups within twelve months.\nWith Renard having historically managed underdogs, it will be interesting to see how he approaches leading a French team who have long underperformed relative to their quality at international tournaments. When Saudi Arabia upset Argentina in the opening group game of the 2022 World Cup, they used a very high line to catch Argentina offside 10 times.\nFor a team as technically accomplished as France, there will be an expectation to have a lot more of the ball. Of the twelve teams to have played more than 10 games at a World Cup since 2011, France have had the highest average share of possession (57.4%).\nReturning to the Fold\nFor France, Eugénie Le Sommer will have the opportunity to overtake Gaëthane Thiney as France’s all-time World Cup appearance record holder. She ranked third in the D1 Arkema, the French top flight, in 2022-23 for expected goals (9.55) despite playing only 1,017 of a possible 1,980 minutes (51.4%), while her seven goals and five assists in the league represented her highest tally of goal contributions for Lyon since the 2018/19 season.\nLe Sommer was one of the players who had been ostracised by former manager Diacre, meaning she did not even go to Euro 2022. Her return to the squad comes at an opportune moment as their top scorer in qualification, Marie-Antoinette Katoto, has not recovered from an ACL injury in time to make the tournament.\nSuper Wendie Renard\nStanding at 6-foot-1, French captain Renard excels in both penalty areas. She was their top scorer at the 2019 World Cup with four goals, although the fact a centre-back scored more goals than anyone else was rather damning of Diacre’s management and how France performed. However, it’s clear opponents struggle to deal with her in the air and the three headers she scored in 2019 was the most for any player in the tournament.\nHer 39 aerials won was also the fifth most in the D1 Arkema last season, which is all the more impressive given how dominant Lyon are in the league and consequently how rarely they face attacks compared to other teams. However, she is not just a player who is going to look to defend the box. Her 154 progressive passes were the highest in the league and her passes into the final third (132) was the second most. She really is a special player.\nBrazil\nPreparing for Life After Marta\nAstonishingly, this is the first World Cup since 1991 that midfielder Formiga won’t appear at, while Marta has already announced this will be her last. The Brazilian legend has scored in every edition of the tournament she has played in, making her one of only three players in football to have scored at five different World Cups (alongside Christine Sinclair and Cristiano Ronaldo). She is the competition’s all-time top scorer with 17 goals in 20 appearances.\nBetter to Have Loved and Lost, Arsenal Fans\nThe news that Brazilian defender Rafaelle Souza was leaving Arsenal was a big blow, but Brazilians will be hoping she can continue her form from last season into the World Cup. Rafaelle showed what an all-round defender she can be in the WSL, but her ball-playing ability is what truly makes her stand out. A left-footed centre-back who can pass and carry the ball, she averaged 5.5 passes into the final third per 90 in the WSL. And of course, she brings that Brazilian flair too – her 12 successful take-ons was the highest for a centre-back in the league.\nShe will be captaining Brazil, having missed the 2019 World Cup with injury, but previously was part of a centre-back partnership at the 2015 edition that did not concede a single goal in the group stages.\nA New Generation Emerges\nBrazil may be the only South American team to have featured in every edition of the World Cup, but the 2007 finalists have not progressed past the quarter-finals since that tournament. They will be hoping this is the moment some of their younger generation take the reins and propel them to back to the top table in international women’s football.\nOne of those players who looks like she could make that difference is 23-year-old Kerolin. The North Carolina Courage forward can play across the frontline and has been on the radar of several European clubs this summer. Her 26 chance-creating carries this season is the fourth highest in the NWSL, while no player carries the ball more times per 90 (18).\nGeyse is another player who could be a serious threat. Having landed a summer move to Barcelona off the back of winning the Pichichi trophy for being top scorer in Liga F, she did not immediately settle in Catalonia. However, there is no doubt of her talents and she caused England a lot of problems during the Finalissima as a high-intensity presser off the ball. In that match, Brazil struggled to create opportunities, but Geyse’s movement stopped the England defence from getting comfortable, ultimately allowing them to equalise late on. Only Lucy Bronze (12) made more tackles in the attacking third for Barcelona than Geyse (11).\nShe also gets into very effective areas in the box, with her non-penalty xG per 90 in Liga F last season (0.16) being the second highest for Barcelona. Only Asisat Oshoala (10) had more touches in the penalty area per 90 than Geyse (nine), but when comparing their carry numbers, it is clear the variety that Geyse offers. Her progressive carries per 90 were 4.1 – fewer than Caroline Graham Hansen or Mariona Caldentey, but significantly higher than Oshoala (2.7), who was ostensibly playing a similar role in the same team. This summer could be where Geyse rediscovers the form that encouraged Barcelona to sign her in the first place.\nAn Opportunity for Revenge\nThis World Cup marks the first one with 32 teams, meaning the bigger teams are more spread out over groups than ever before. That makes France vs. Brazil, taking place on the second matchday in this group, one of the stand-out games of the first two weeks of the tournament. Not only is it one of two matches between ‘top ten’ teams in the group stage (the other is USA vs The Netherlands), it’s also a replay of the round-of-16 match from 2019.\nFrance came out on top that day, although they needed extra time to do so. Valérie Gauvin scored the opener before Thaisa equalised. In the end, it was Amandine Henry who scored the winner to ensure that France would make at least the quarter-finals at their home tournament. However, don’t expect this rematch to look similar: only six players from each of the sides’ current squads featured in it, and none of the goalscorers from that day will be at the 2023 tournament.\nJamaica\nBeware the Bunny\nJamaica are just another one of the teams at this World Cup who have been embroiled in off-field problems. Despite qualifying for their second World Cup, the Reggae Girlz have been forced to use crowdfunders to support their trip to Australia.\nIt was a chastening experience for Jamaica back in 2019, as they lost all three of their group games so comprehensively that an opposition player got a hat-trick in each one of them (Cristiane for Brazil, Sam Kerr for Australia, Cristiana Girelli for Italy). Bunny Shaw will be hoping she can return the favour as they face Brazil again.\nShaw had an incredible season this year for Manchester City as she stepped into the limelight following Ellen White’s retirement.\nShe finished with 20 goals and seven assists, just pipped to the golden boot by Rachel Daly. Her xG per 90 of 0.82 was the highest in the league and no player took more shots per 90 than her (5.8).\nShaw is not just a goalscorer, though – she also contributes significantly to build-up. Her six multi-goal involvements (the number of goal-ending sequences in which she was both involved in the build-up and scored the goal) in the WSL this year was the highest of any player. Her 41 carries was the third highest of any Manchester City player.\nThis ability to drop deeper might allow Shaw to dovetail well with Drew Spence. Spence is an aggressive front-foot midfielder who was previously capped for England. She likes to get into the box, with her per-90 average of 2.0 touches in the penalty area behind only Bethany England and Rosella Ayane for Tottenham, both of whom are forwards. Spence’s chance-creating actions per 90 (1.1) was the second highest for Spurs.\nThe biggest issue Jamaica could face is being unable to get Shaw on the ball. She only had 21 penalty-box touches at the 2019 World Cup. Using players like Spence either as a decoy runner or to help support her in attack will be crucial in helping unleash one of the world’s most in-form strikers.\nPanama\nNew Face on the Block\nPanama are one of the debutants at this year’s World Cup, having qualified through the inter-confederation playoffs by beating Papua New Guinea and Paraguay. Ranked 52nd in the world, they are one of the lowest-ranked teams at the tournament and will be hoping to become the first CONCACAF team since the USA to win a game at their debut World Cup.\nBased on qualification, Panama’s main strength will be their defence. They did not concede a single goal in the inter-confederation playoffs, making them the only team who qualified through that route to keep clean sheets all the way. However, a recent 7-0 loss to Spain in a friendly suggests that against better opposition they might not be quite so watertight.\nEnjoy this? Subscribe to our newsletter to receive five stories each Friday. It’s free. Also, follow us on Twitter.",
  "word_count": 1803,
  "scraped_at": "2026-02-14T13:27:32.921228"
}