{
  "article_id": "35ffd8bf14cf",
  "url": "https://www.hudsonriverblue.com/new-nycfc-coach-guesses-who-will-new-york-city-fc-hire-as-manager-2025/",
  "title": "Let try to guess the next NYCFC head coach",
  "date": "20241203T134500Z",
  "domain": "hudsonriverblue.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "As the dust settles on the dismissal of Nick Cushing, attention turns to figuring out who will replace him as head coach of New York City FC.\nThe eleventh season in club history will feature the sixth coach in club history, but the identity of that coach can only be guessed at in the wake of Cushing’s firing. Thus far there have been no candidates mentioned or rumored in connection with the NYCFC vacancy, though that could change once MLS Cup is won and the league’s offseason activity picks up.\nThere are currently five unfilled MLS coaching jobs, concentrated mainly in the Eastern Conference: New York City FC plus Atlanta United, Philadelphia Union, Toronto FC, and Vancouver Whitecaps FC. Who will fill that NYCFC vacancy? Thus far, there have been no rumors of a prospective new coach, but that doesn’t mean we can’t try to make semi-educated guesses.\nWhile we have no concrete rumor to build on, nor any inside knowledge as to the candidates currently under consideration, we do know what kinds of coaches the New York City sporting staff and their City Football Group bosses have tended to hire in the past.\nThe five previous NYCFC coaches were not all cut from the same cloth. Only one had coaching experience in this league, while others had not previously led a senior-level men’s team. Three had deep ties to City Football Group and its flagship club, Manchester City FC, while two coaches – including the only one to win MLS Cup – came from outside the CFG umbrella and adapted to life inside the multi-club setup.\nCushing was the first NYCFC assistant coach ever to be elevated to head coach, stepping into the role on an interim basis when Ronny Deila left midseason in 2022. Internal promotions didn’t happen before Cushing, so given their scarcity and that Cushing was removed from the role so the team could go in a new direction, it’s hard to imagine that long-serving NYCFC assistants Mehdi Ballouchy or Rob Vartughian, or anyone else from Cushing’s staff, would be asked to take the reins.\nBefore we get into hypothetical new NYCFC hires, note that this is just one person's list, a list based on vibes, tenuous connections, precedents, and plenty of guesswork.\nPast managerial hires have tended to be on the younger side, with an average age of 44 upon appointment across the five previous holders of the job, so the names on this list all are right around that age.\nOnly two of the five names below have previously coached in MLS, which might be optimistic given NYCFC's coaching history. Ten seasons in, the club has only employed one coach, Jason Kreis, with previous MLS coaching experience, and he lasted just one unsuccessful season at the helm.\nPerhaps more on brand for New York City FC coaches, two names below currently or recently coached within City Football Group. One was hired for a different coaching job elsewhere by NYCFC’s newest co-owner, and another is more of a wild card pick, but one who has local ties. Without further disclaimers or caveats, here then, are five totally plausible potential next New York City FC head coaches.\nThe Domè-Vieira-Cushing Hybrid\nName: Carlos Vicens\nAge: 41\nCurrent Role: Assistant manager, Manchester City FC\nHis Deal: A Pep Guardiola assistant since 2021 who won trophies before that while leading Manchester City's U18 team, but someone who has yet to be tested as a head coach.\nAs an assistant to Pep Guardiola, Vicens has been hailed as a \"secret weapon\" for his expertise in designing set pieces. He worked his way up to that role with years of work coaching in the lower tiers of his native Spain's soccer pyramid, and with years coaching in the Man City Academy. Vicens coached Premier League players like Cole Palmer, Liam Delap, James McAtee, and others during his time as both an assistant and head coach of the Man City U18s. Since joining Pep Guardiola's staff in 2021, he's been close to leaving once when, in 2022, Vicens agreed to become manager of Heracles Almelo in the Netherlands but backed out of taking the job following the club's relegation from the top-flight Eredivisie.\nWhat better way to then take that step into first-team management than by moving within the City Football Group family and coming to help develop the expensive young talent assembled in New York City? As a potential NYCFC coach he brings to mind three other past holders of the job: Domè Torrent, also from Spain and also a Pep Guardiola assistant at the time of his hiring; but also both Patrick Vieira and Nick Cushing, who each also spent time coaching at other Manchester City youth and women's teams prior to coming to New York City but lacked previous managerial experience upon assuming the NYCFC gig.\nThe Claure Connection\nName: Diego Alonso\nAge: 49\nMost Recent Role: Manager of Panathinaikos (fired October 29, 2024)\nHis Deal: First-ever coach of Inter Miami CF in 2020, but only lasted one turbulent season despite prior success with Pachuca and Monterrey in Liga MX. Since then it's been a string of rocky, brief stints coaching his native Uruguay's national team, Sevilla FC in Spain, and Panathinaikos in Greece.",
  "word_count": 875,
  "scraped_at": "2026-02-14T12:49:11.750867"
}