{
  "article_id": "35ffffebdc5b",
  "url": "https://deadline.com/2024/05/disney-upfront-2024-new-york-city-recap-1235916159/",
  "title": "Disney Upfront2024 : Here What Happened At North Javits Center",
  "date": "20240514T223000Z",
  "domain": "deadline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sheryl Lee Ralph and Lisa Ann Walter from Abbott Elementary got to call roll at the start of the Disney Upfront Tuesday, which allowed many of the stars from the studio’s movies and networks to sound off (in a video) before the presentation kicked off at the North Javits Center.\nAnd what’s an ABC upfront without the voice of Walt Disney? Yup, he was (heard) there, too. Here’s what else happened at the afternoon shindig:\n- Emma Stone, whose Oscar acceptance speech for Poor Things was replayed during the opening montage, kicked off the event to remind everyone that the studio was founded more than 100 years ago. Her primary job, though? She was there to introduce Disney CEO Bob Iger.\n- Iger returned to the upfront stage, sans tie with his white shirt, for the first time in 30 years. He promised that Jimmy Kimmel would come later to “tear everyone apart,” including himself. Pictures of Iger then flashed in the background from when he did the ABC upfront three decades ago. After an optimistic speech about the company (you can read it here), the camera panned to the three Disney co-chairs in the audience who hope to someday occupy his chair. Best of luck, kids!\n- A Family Guy clip features an animated Rita Ferro, the president of global advertising for Disney, as she talks up the Disney library. Now this is the way to do an upfront presentation; none of that awkward Teleprompter reading. She doesn’t get to stay as a cartoon for long, though; she appears in person at Javits in a bright yellow suit and gigantic gold\ndragonflybutterflyhandmade flower brooch from M&S Schmalberg to talk about Disney’s connective storytelling.\n- Ryan Reynolds — last seen on ABC in the comedy Two Guys, A Girl and a Pizza Place — gets a turn on the stage to joke about how everyone “primarily knows me for my work in marketing,” but he’s an actor, too! His touts his new family friendly show on NatGeo before bringing out Rob McElhenney so they can talk about the fourth season return of Welcome to Wrexham. McElhenney also reminds everyone that his show It’s Always Sunny in Philadelphia has been on FX for something like 57 years.\nRELATED: Marvel Teases Disney+ Release Dates For ‘Agatha All Along,’ ‘Daredevil: Born Again’ & ‘Ironheart’\n- Kaitlin Olson introduces her new ABC drama High Potential from ABC Signature. She plays a single mom with three kids and an exceptional mind, who helps solve an unsolvable crime when she rearranges some evidence during her shift as a cleaner for the police department. When they discover she has a knack for putting things in order because of her high intellectual potential, she is brought on as a consultant to work with a by-the-book seasoned detective Karadec (Daniel Sunjata), and together they form an unusual and unstoppable team.\n- Jim Gaffigan shares a few chestnuts about wanting to buy Iger a tie and how his “favorite ride at Disney is the tram back to the hotel” before talking about how Hulu will “disrupt the streaming world by diving head on into comedy special business.” He’ll have the first one on Nov. 22. “They aren’t doing it halfass, they are doing it full-ass,” Gaffigan said of Hulu’s foray into stand-up.\nRELATED: Jason Kelce Tells Disney Upfront Crowd How Glad He Is To Be Joining “Monday Night Freakin’ Football!”\n- Eagles quarterback Jalen Hurts and Abbott Elementary creator Quinta Brunson revealed that Jason Kelce will be an ESPN Monday Night Countdown commentator. Party boy comes on stage and picks up Brunson but only hugs Hurts. “As somebody who just finished a 13-year career, I know what it takes to be great,” he said. “Its Monday Night friggin’ Football! My brother and I grew up watching Monday Night Football … I know what’s going on in those guy’s heads.” Scott Van Pelt, Ryan Clark and Marcus Spears join Kelce on stage.\n- Ryan Seacrest talked up ABC’s live events like New Year’s Rockin’ Eve, the Oscars, and upcoming ESPY Awards on July 11. Serena Williams will host. He also shared some good news for Golden Bachelor fans: a Golden Bachelorette is coming featuring Joan Vassos, a former bachelorette on Golden Bachelor who left after week 3 due to a family emergency.\nRELATED: Bruce Springsteen Documentary ‘Road Diary’ Sets Premiere Date At Hulu, Disney+\n- Bruce Springsteen, via video, talks up his Hulu originals documentary in October and offers a first look.\n- ABC News anchor David Muir takes the stage to say “I’m not here to talk about the news, Stormy Daniels. You are welcome.” Instead, he’s there to introduce Robin Roberts, who is about to celebrate 20 years as co-anchor of Good Morning America.\n- ESPN’s Stephen A. Smith reminds everyone that he, too, has been at the company for 20 years. “I grew up at this company,” he said. “It’s at Disney that I learned it’s better to work at company with standards, then one that is looking for them.” Baller Chris Paul, who’s joining ESPN as a guest analyst, joins him on stage.\nRELATED: Disney Ad Chief Rita Ferro Makes Upfront Entrance In Animated ‘Family Guy’ Short, Hails Company’s Knack For “Transcending Generations And Igniting Pure Joy”\n- Nathan Fillion and The Acolyte‘s Kelnacca take the stage just so Fillion can say Disney programming varies from “Wookiees to Rookies.” Buh da-dum. The rest of the Acolyte cast come out to promote the series’ June 4 premiere on Disney+. It takes place 100 years before The Phantom Menace.\n- Ellen Pompeo is back at the upfront, this time to talk about … the Disney+ library which also streams reruns of Grey’s Anatomy that have amassed 1.7 billion streamed hours worldwide. Wow. She also talks up her new limited series Natalia (previously the untitled orphan project) for Hulu and teases a quick sneak peek.\nRELATED: Upfronts 2024: Where & When They’re Happening\n- Selena Gomez boasts her multiple projects at Disney, including a new take on her old Disney Channel show called Wizards Beyond Waverly Place, and of course her work on Only Murders in the Building, which returns Aug. 27. Steve Martin and Martin Short join her on stage to share a few bon mots like this: “Steve is whiter than a Michael Bublé concert in Utah on a pickle ball court.”\n- Marvel TV presents! Cast of the upcoming Agatha All Along do a spiel for their show that’ll bow Sept. 18 on Disney+. They also offer a first look trailer of Kathryn Hahn reprising her role of Agatha Harkness. Dominique Thorne and Anthony Ramos talk up Ironheart that’s coming next year. Charlie Cox and Vincent D’Onofrio follow to premiere footage from Daredevil: Born Again, which will bow on Disney+ in March 2025.\n- Sterling K. Brown and James Marsden preview their new Hulu show from Dan Fogelman called Paradise. Marsden plays a former U.S. president and Brown is his security man. Julianne Nicholson also stars.\nRELATED: Broadcast TV Cancellations In 2024-25: Photo Gallery\nWatch on Deadline\n- A 2-minute-plus trailer for the new season of The Bear! But it was only available for folks in the room. Sigh.\n- Desmond Howard, Vince Young and Adrian Peterson from ESPN drone on about men’s college basketball.\nRELATED: Renewed TV Series 2024: A Photo Gallery\n- NCAA women’s basketball stars take the stage with South Carolina Gamecocks’ head coach Dawn Staley to tell us that Disney+ is running three of Caitlin Clark’s games, yes!\n- Emma Roberts, Kim Kardashian, Michelle Williams and Angela Bassett wax poetic about their Disney shows (American Horror Story, 9-1-1, The Kardashians, and Dying for Sex).\n- The Jimmy Kimmel monologue! Transcript coming shortly….\nRELATED: 2024 Premiere Dates For New & Returning Series On Broadcast, Cable & Streaming",
  "word_count": 1303,
  "scraped_at": "2026-02-14T13:39:45.873688"
}