{
  "article_id": "36231b1b661e",
  "url": "https://www.thenationalnews.com/opinion/comment/2025/12/24/for-iran-2026-is-going-to-be-the-year-of-the-unknown/",
  "title": "For Iran , 2026 is going to be the year of the unknown",
  "date": "20251224T161500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Islamic Republic of Iran is no stranger to crises, but recent years have been exceptionally difficult for the country and its political masters.\nIn 2022-2023, it faced the most widespread protests in its four-decade history. The “Woman, Life, Freedom” movement challenged the establishment’s mandatory hijab policy, as millions of women continue to disregard it even today. Last year, it exchanged fire with two nuclear states, Pakistan and Israel. It also watched helplessly as Israel severely degraded the Axis of Resistance, its coalition of armed proxies across the Arab world. This year, it had a full-on war with Israel and the US that led to hundreds of Iranian civilians being killed.\nWith 2026 round the corner, the country faces something even more challenging: a year of the unknown.\nIran finds itself in limbo. For decades, Supreme Leader Ayatollah Ali Khamenei was firmly in control. Even though he remains at the top of the country’s leadership chain, much of his authority has been undermined as a consequence of Israel’s aggression. His long-held policy of avoiding both rapprochement and military confrontation with the West has unravelled. The fact that he hid in a bunker during the 12-day war with Israel and the US, even as many of his generals were killed, has not helped his image.\nThe race to succeed the 86-year-old leader is already under way, with various factions within the establishment competing with one another. These factions have very different social bases and are offering divergent futures for Iran. As all major decisions await Mr Khamenei’s passing, the country is akin to a ship without a captain.\nIran’s armed forces haven’t been idle, of course. They are rebuilding their missile capabilities. The recently appointed National Security Adviser, Ali Larijani, has travelled both regionally (Lebanon and Pakistan) and beyond (Russia and Belarus) in a bid to shore up Iran’s diplomatic relations in the event of a renewed military confrontation with Israel. A new Defence Council has also been established.\nYet there is a dangerous lack of direction from the top, which several experts expect Israel to exploit with another attack on the country. In fact, some of them predict such an attack to come soon. Apart from the obvious loss of lives and livelihoods this could cause, it is also terrible for Iran’s business and economic outlook. All of this, along with the existing international sanctions regime, have made the country chronically unstable.\nThis is the time when Iran’s leadership should be re-engaging with the US and its partners. But bold diplomacy hasn’t been forthcoming.\nThe decapitation of Iran’s Axis of Resistance has had a direct consequence on its influence across the Middle East. Beirut now openly challenges its hegemony inside Lebanon and Tehran-backed factions in Iraq underperformed in the recent parliamentary election. Meanwhile, UN sanctions that had been lifted in 2015 were re-imposed after Iran failed to assuage concerns expressed by key European powers regarding its controversial nuclear programme. Also this year, Australia expelled the Iranian ambassador citing Tehran’s alleged role in anti-Semitic attacks across the country.\nIn short, 2025 has been a year of gradual diplomatic isolation for Iran.\nMeanwhile, President Masoud Pezeshkian remains ineffectual. Elected last year on the back of promises to herald much-needed reforms in key areas, he has however failed to deliver. He made very limited inroads on internet freedom, with much of the world wide web still banned for ordinary Iranians. Infrastructure is crumbling, electricity cuts are a fact of life, and water bankruptcy is a very real threat for many.\nDespite his attempts to foster national unity, Mr Pezeshkian continues to be criticised and undermined by the establishment’s more conservative factions. Last spring, Parliament impeached and dismissed his star economy minister, Abdolnaser Hemmati. His popular vice president, Mohammad Javad Zarif, was forced to resign under pressure from the hardliners.\nNone of the indecisiveness or lack of direction has made Iran any less repressive, however. It continues to arrest foreign nationals. It has executed hundreds of people, many of them based on charges of espionage on Israel’s behalf. It has also put Nobel laureate Narges Mohammadi in jail, flogged singer Mehdi Yarrahi and harshly treated Mostafa Tajzadeh, a former minister and now leading political prisoner.\nOften the inverse image of its leaders, Iran’s civil society continues to shine in different ways. Iranian women have forced the establishment to go easy on mandatory hijab, and youth across the country are bringing much-needed joy and entertainment by organising concerts on an unprecedented scale.\nIran’s leading cultural and sporting figures are winning notable accolades, too.\nThe beloved national football team qualified for the Fifa World Cup. Hossein Molayemi and Shirin Sohani won the US Academy Award for Best Animated Short film. Jafar Panahi won the Palme d’Or at the Cannes Film Festival and is on the shortlist at next year’s Academy Awards (the Iranian government has responded by giving him another prison sentence in absentia). Mohammad Rasoulof, another dissident filmmaker, has also been nominated for the Academy Awards.\nLast but not least, after years of hard work by Iranian experts, the prehistoric sites of Khorramabad Valley in Lorestan province were added to the Unesco World Heritage List.\nAnd so, as the new year is upon us, a familiar dynamic could re-emerge. Even as Iran’s people strive for excellence across fields, they are likely to continue living under the prolonged shadow of war, sanctions, repression and rising instability.",
  "word_count": 900,
  "scraped_at": "2026-02-14T12:37:15.038314"
}