{
  "article_id": "362f22dbeee0",
  "url": "https://wtop.com/entertainment/2023/09/lynn-whitfield-reflects-on-career-from-eves-bayou-to-greenleaf-ahead-of-prince-georges-film-festival/",
  "title": "Lynn Whitfield reflects on career from  Eve Bayou  to  Greenleaf  ahead of Prince George Film Festival",
  "date": "20230926T181500Z",
  "domain": "wtop.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Hear our full chat on my podcast “Beyond the Fame with Jason Fraley.”\nThe Prince George’s Film Festival returns this week with the star power of a true Hollywood legend as Lynn Whitfield headlines a Q&A with journalist Harriet Cole at Sunday’s closing ceremony at MGM National Harbor.\nWhitfield joined WTOP to preview the event and reflect on her prolific career from “Eve’s Bayou” to “Greenleaf.”\n“I went to Howard University, so I’m connected that way,” Whitfield told WTOP. “My sister Sherri is working with the festival, but I don’t know how they decided that I would have the honor of being at the closing awards brunch and wanting to speak with me. I guess it just comes with the years of being here and doing the work, you know?”\nBorn in Baton Rouge, Louisiana in 1953, Whitfield grew up watching the icons of Hollywood’s Golden Age.\n“As a kid, I loved all of the glamour and the drama and I loved musicals,” Whitfield said. “Bette Davis, Marilyn Monroe, Audrey Hepburn were my favorites. When I was fortunate to see brown faces like mine on screen, I fell in love with Ruby Dee as an actress … My grandmother would sneak me into the den to watch the ‘Million Dollar Movie’ … One night I turned and said, ‘Grandmommy, I’m gonna be an actress just like that when I grow up.'”\nIndeed, she pursued acting as a career as a third-generation graduate of Howard University in D.C.\n“One of my grandfathers went to Howard University in 1916 and the other went in 1917 — and my father’s father was on the first Howard University football team,” Whitfield said. “My two grandfathers never met at Howard, they only met once my mother and father met at Howard [years later] … They met, they dated, they fell in love, they graduated, my dad went off to the service and when he came back they got married and so here I am.”\nDuring college, she joined the Black Repertory Company, marrying and divorcing its co-founder, Vantile Whitfield.\n“I was really burning the candle at both ends, you know?” Whitfield said. “At that time, the D.C. Black Repertory Company was just starting, so all of the classes and rehearsals were late at night. I wasn’t a part of everything, I was a fledgling member in the beginning, so I would do the workshops and things that went into the wee [hours] of the evening, then be up first thing in the morning to attend my classes at Howard, so yes, I did both.”\nHer breakthrough stage performance was with the legendary Alfre Woodard in the choreo-poem “for colored girls who have considered suicide / when the rainbow is enuf” (1977), which made playwright Ntozake Shange the second Black woman to reach Broadway after Lorraine Hansberry’s landmark play “A Raisin in the Sun” (1959).\n“It was not only teaching each other in the way of the work, but really building beautiful camaraderie and support systems because our friendship blossomed from doing it,” Whitfield said. “Also, Carol Maillard was in the company, who was one of the original founding members of Sweet Honey in the Rock … Just seeing [Alfre’s] focus and versatility as an actress because many people don’t know that Alfre is a wonderful comedic actress as well.”\nAfter making her screen debut in the NBC cop drama “Hill Street Blues” (1981), Whitfield found herself acting beside another rising legend in Denzel Washington for the CBS TV movie “The George McKenna Story” (1986).\n“It was amazing,” Whitfield said. “Doing ‘The George McKenna Story,’ I was so enamored because it was right at the budding of so many opportunities for Denzel. He was doing such wonderful work. At the time, he got the offer to play the activist Steven Biko, a South African activist against Apartheid [in ‘Cry Freedom’] … I was actually working with an actor that you could see that moment when the industry pivots and says, ‘You’re it.'”\nShe next joined Oprah Winfrey and Cicely Tyson in the ABC miniseries “The Women of Brewster Place” (1989).\n“Oprah had just done ‘The Color Purple’ with all the accolades,” Whitfield said. “The work that Oprah and I did together, it’s rare to see that kind of intimacy between females on screen. I was this woman who loses her child, loses everything, and Oprah just held her up, nurtured her and took care of her through such hard times … To have all of these Black women with different storylines, some controversial at the time … I felt so blessed to be there.”\nShe finally won an Emmy Award in the HBO movie “The Josephine Baker Story” (1991) across Louis Gossett Jr.\n“It was just the highest and most treasured moment of my career to get the role,” Whitfield said. “The audition process was six months long. To have the honor of being the vessel that carried the story of such a dynamic woman, the press poster and tagline was: ‘Before Marilyn, before Madonna, there was Josephine.’ Now we can add to that: ‘Before Marilyn, before Madonna, before Beyoncé, before Rihanna, before Taylor, there was Josephine.'”\nIt also won an Emmy for director Brian Gibson, who became her second husband in 1990. They divorced in 1992, but shared a daughter, Grace. Soon after, she played Jurnee Smollett’s mother Roz in Kasi Lemmons’ masterpiece “Eve’s Bayou” (1997), a wife tortured throughout the film by Samuel L. Jackson’s philandering husband.\n“It was very profound,” Whitfield said. “I had an aunt that very much reminded me of Roz, so it was giving honor to women from a different time from the 1950s who didn’t always protest … I remember saying to Kasi, ‘I just need a scene where I can really cuss him out and let him have it,’ and she said, ‘No, no, no, you can’t. Roz is not you. Trust me … There’s power in your silence and your stillness. You’ll thank me later’ … She was so right.”\nWhile “Eve’s Bayou” was a heavy drama, Whitfield also shined in comedies with Martin Lawrence in “A Thin Line Between Love and Hate” (1996), Danny Glover and Joe Pesci in “Gone Fishin’” (1997), Julia Roberts in “Stepmom” (1998), Chris Rock in “Head of State” (2003), Tyler Perry in “Madea’s Family Reunion” (2006) and the ensemble of Meg Ryan, Annette Bening, Eva Mendes, Cloris Leachman and Jada Pinkett Smith in “The Women” (2008).\n“The movies were comedies, but I happened to be the straight person to the comedian, but I still got laughs,” Whitfield said. “One of the things that my acting teacher David LeGrant told me that is so important is that there’s humor in reality. In playing it straight, there’s humor. There’s slapstick comedy where you gotta land the joke … but then there’s the comedic timing of people being honestly who they are and they’re just friggin’ funny.”\nMost recently, she won two NAACP Image Awards as Lady Mae Greenleaf across the great Keith David in the megachurch drama “Greenleaf” (2016-2020), which premiered on OWN and is now streaming on Netflix.\n“The best television husband that anyone can ever have,” Whitfield said. “It was lovely. In five years, we never had any tension, argument or creative disagreement. He was so easy to work with and this golden voice, like an icon in the world of voice-over, but just such a thespian. It was the easiest work working with him. I feel like it had that magic, and I’m not bragging, the beauty that Ruby Dee and Ossie Davis had together, just very classic equals.”\nToday, after all the iconic roles and accolades, she still thinks she can improve her craft.\n“As an artist, I’m still a work in progress, there’s still a lot of growth I can make,” Whitfield said. “I think now more than ever we need to turn to our art. There’s such beauty in storytelling and such growth for humanity in storytelling to what we do want to be or what we don’t want to be. We can use art to help change the world.”\nHear our full chat on my podcast “Beyond the Fame with Jason Fraley.”",
  "word_count": 1366,
  "scraped_at": "2026-02-14T13:36:50.728879"
}