{
  "article_id": "3658071e3c1c",
  "url": "https://cowboystatedaily.com/2025/01/18/montana-state-rodeo-team-will-be-in-trumps-inaugural-parade/",
  "title": "Montana State Rodeo Team Will Be In Trump Inaugural Parade",
  "date": "20250118T190000Z",
  "domain": "cowboystatedaily.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "UPDATE: After this story posted, it was announced that because of a forecast for extreme weather and cold for Monday, the inaugural plans in Washington, D.C., have been moved inside. That means the MSU rodeo team won't be participating in the parade as planned. \"On behalf of Coach Whitaker, our student athletes, Bobcat Athletics and Montana State University, I want to express our gratitude for the invitation to represent Montana and MSU in the Inaugural Parade,\" said MSU Director of Athletics Leon Costello. \"Go 'Cats!\"\nBOZEMAN, Montana — Amid the pomp and celebration Monday surrounding the second inauguration of President Donald Trump, there will be 36 student-athletes from Montana State University’s rodeo teams.\nMSU coaches scrambled to borrow six horses from a supporter in Maryland, then navigated Secret Service protocol before finalizing plans to fly out for Washington D.C. on Saturday.\n“It’s a huge opportunity, obviously,” MSU rodeo Head Coach Kyle Whitaker told Cowboy State Daily Thursday. “It's just a big surprise. We're focused more on what we do in the classroom and in the arena. But this is to me, this is just kind of a reward for hard work and the success of the program and the reputation of the program.”\nBoth the women’s and men’s MSU rodeo teams sit atop the Big Sky Conference heading into the spring season.\nThe invitation to D.C. came from U.S. Rep. Ryan Zinke (R-Montana), who placed the rodeo athletes in the inauguration spotlight. The rodeo athletes get a lot of attention in Bozeman during the football season when they ride out in front of the team at the start of home games.\nIn Washington, D.C., MSU Bobcat rodeo joins a curious mix of parade participants.\nAt 1 p.m. mountain time Monday, the Pass in Review parade, which is a military ceremony, will feature first responders from Pennsylvania and several marching bands. A group called Navajos 4 Trump will be featured, along with a Colorado company called Lunar Outpost, which specializes “in designing advanced mobility that enables a sustainable human presence in space.”\nAnd then there’s America’s Patriotic Tractor from West Des Moines, Iowa. It’s a restored 1957 Ford 860 tractor with a red, white and blue all-American paint job. Media reports from the 2024 campaign trail dubbed it the “Trump Tractor” because its owner Gary Leffler was a Trump Caucus captain in Iowa.\nAmerica’s Patriotic Tractor rolls in the parade procession between the Florida Firefighters Pipes and Drums from Boca Raton, and the Stewarts Creek High School Band from Smyrna, Tennessee\nThe MSU rodeo team will appear later, between a high school marching band from Texas and the U.S. Air Force’s Pipes & Drums of the Blue & Gold. Four to-be-determined rodeo athletes will ride horses, while the remaining two horses pull a wagon for MSU.\n“The team will be in their vests, so it'll be pretty easy to spot us,” MSU rodeo Assistant Coach Savanna Bolich told Cowboy State Daily.\nThe parade lineup will include 7,500 participants from 23 states representing, “Americans from all walks of life, including a variety of veterans groups,” according to the Trump Vance Inaugural Committee.\nSpecial Shoes\nIn addition to the MSU rodeo team, other participants will be on horseback, like the 1st Cavalry Division Horse Cavalry Detachment from Fort Cavazos, Texas.\nAs Bolich discovered, the team’s trip to D.C. includes dealing with specialized horseshoes for urban riding.\nIn Washington, D.C., those organizing the inaugural events are “really strict on the horses. Have to have Borium shoes on. So that's been kind of an ordeal,” said Bolich.\nBorium is added to steel horseshoes to enhance their performance, according to a 2006 post by the Pacific Coast Horseshoeing School. It is a hard-facing material that consists of tungsten carbide crystals embedded into the horseshoe using a welding technique called brazing.\nThe post noted, “Police or Park Service horses that spend a lot of time on asphalt need traction. The Rose Parade in Pasadena, California, has required that all horses have Borium on their shoes before they are allowed to participate in the parade.”\n“Not super common in rodeo horses,” said Bolich. “It’s just so there’s no slipping or anything like that.”\n“It's kind of like putting cleats on,” said MSU rodeo Head Coach Kyle Whitaker.\nBorium includes tungsten carbide crystals, which give the metal a textured surface that creates traction.\nFirst Time To D.C.\nAs Whitaker scrambled to tie up loose ends ahead of his team’s trip to Baltimore and Washington, D.C., boosters stepped in to pay for travel and lodging in Baltimore, said Whitaker.\nThe Nebraska native also said the trip to Washington, D.C., will be a first for him personally and for college rodeo teams.\n“I have never heard of a college rodeo team doing this before. To my knowledge, nobody's done it,” said Whitaker.\nAs for who will be following behind to pick up after the horses, “I think that the parade has a clean-up crew because there are a few different groups,” Bolich said.\nWhat is the Pass in Review Parade?\nThe Pass in Review parade tradition dates back to the first inauguration of George Washington in 1789, according to the Joint Congressional Committee on Inaugural Ceremonies. Following the formal inauguration ceremony, the parade serves as a symbolic review of the military and traditionally includes a festive mix of bands, citizen groups and floats.\nAs the MSU rodeo team prepares to join the illustrious line up, local fans and supporters are likely gearing up to celebrate the occasion. Two popular venues, Stacey's in Gallatin Gateway and the Rocking R in Bozeman — which helped fund the team’s trip — are the two mostly likely places to find a watch party for the parade.\n“I think it’s good publicity for the team,” Bolich said. “It’s good exposure for the team. This is kind of another one of those things that just has set this program apart. And it really shows how much support and backing that we have for the program, which is really cool.”\nLive coverage is available on NBC and Peacock. Pre-ceremony coverage will begin at 5 a.m. Mountain Time, providing viewers a comprehensive look at the day's events leading up to the inauguration and the parade.\nThe parade begins after the conclusion of the inaugural ceremonies and the luncheon at the United States Capitol, according to a press release from the U.S. Parks Service.\n“The newly sworn president and vice president will make their way to the East Front steps of the Capitol where they will review military troops before leading a procession of ceremonial military regiments, citizens’ groups, marching bands, and floats down Pennsylvania Avenue to the White House,” the committee states. “The president, vice president, their spouses and special guests will then watch the parade as it passes in front of the Presidential Reviewing Stand.”\nDavid Madison can be reached at david@cowboystatedaily.com.",
  "word_count": 1144,
  "scraped_at": "2026-02-14T14:16:21.184907"
}