{
  "article_id": "366641b32eb0",
  "url": "https://theathletic.com/4331929/2023/03/31/inter-services-cup-raf-army-navy/",
  "title": "Two days with the Royal Air Force football team as they compete for the Inter - Services Cup",
  "date": "20230331T050000Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This is not your average spring evening at Shrewsbury Town.\nWith light drizzle falling and daylight starting to ebb away, a helicopter suddenly hoves into view with a special delivery on board: the match ball.\nWelcome to Inter-Services football and the Constantinople Cup, the annual competition that has been fought over by the Royal Air Force, British Army and Royal Navy men’s teams for more than a century.\nAdvertisement\nTonight will see the 2023 winners decided via the final game in a round-robin tournament, as the RAF host the Army in a fixture that, The Athletic has been assured several times over the past 24 hours, can get a little tasty.\n“The Army lads call us ‘big-time bastards’ when the helicopter arrives with the ball,” says Corporal Tom Claisse, the RAF’s long-serving team captain and tonight’s guest of honour ahead of his military service coming to an end later this year. “We love how it winds them up!”\nClaisse is waiting to lead the two teams out. He can’t play due to a medical board last month deeming a problematic shoulder injury to be too much of a risk, so the captain’s armband will instead be worn by Mike Campbell.\nBut there’s no doubt where his loyalties lie. When asked if his duties as guest of honour will extend to a repeat of the 2018 FA Cup final, when Claisse, in full military regalia, carried the most famous trophy in English football up to the Royal Box at Wembley, he replies: “Forget that — I hope to be helping lift the cup after we win it.”\nThere are around 700 spectators inside Shrewsbury’s New Meadow as the Juno helicopter touches down precisely in the centre circle. Thousands more are watching on TV, via the streaming service that saw 35,000 tune in on YouTube and Facebook when the Navy drew 1-1 with the RAF at Fratton Park in the competition’s opening fixture.\nAdd in the serving personnel also watching on the Forces TV station, BFBS, at bases and camps around the globe and we are talking about a healthy-sized audience.\nWith last week’s clash against the Navy ending in an emphatic 3-0 win for the Army at Aldershot Town, the Air Force know only victory tonight will be enough to retain the trophy.\nThe 2023 women’s Inter-Services title has already been settled, the RAF beating the Army 4-1 earlier in the afternoon at Leek Town to lift the trophy. Now, the men are determined to repeat the RAF’s double success from last year.\nAdvertisement\n“It is a bit crazy in that we play a dozen or so times during a season but, really, everything revolves around these two Inter-Services games,” says Corporal Jake Gosling, a former Gibraltar international who played for Exeter City and Bristol Rovers before joining the Air Force. “They are basically two cup finals.”\nLilleshall Hall. Once home to the Football Association’s School of Excellence, whose alumni includes Michael Owen, Sol Campbell, Nick Barmby and Andy Cole.\nSuch a stellar roll-call helps lend this remote corner of Shropshire a grandeur only enhanced by the Grade II listed hall that sits at the centre of this sprawling 30,000-acre estate.\nEngland’s top footballers may be long gone, these days training at the custom-built St George’s Park in Burton. But Lilleshall, via the National Sports Centre, still hosts plenty of elite sportsmen and women, with the British Gymnastics governing body based here.\nThis week, the RAF men’s team are using the facilities as part of their preparations for the final Inter-Services match of 2023. The Athletic has been invited to join the squad, who are based at nearby RAF Shawbury.\n“The Constantinople Cup means a lot to all three services,” says Warrant Officer Andy Kuchta, the men’s team manager for the past three years after previously leading the Air Force’s women and development squads to Inter Services success.\n“It is about representing not only your service but also your country. The lads take it very, very seriously — as shown by how they have travelled this week from all over, including Cyprus, Germany, Scotland and Bournemouth.\n“Sport is an integral part of military life, and that goes for the Army and Navy as well as ourselves in the Air Force. I’d say we run things as well, if not better, than some professional clubs.”\nThat much becomes apparent as the squad start to arrive on this damp and drizzly Tuesday morning. There’s a couple of kit men, plus sports scientists and therapists on hand to help the players. There’s also a couple of support staff and a match analyst, who will later lead the afternoon video sessions outlining the game plan back at the base.\nAdvertisement\nEveryone here is volunteering for duty, with the players even paying their own airfares for a recent warm-weather training camp in Alicante, Spain.\n“No taxpayer money is spent on the football,” adds Kuchta. “Nothing at all from the MoD (Ministry of Defence) budget, with funding instead coming through sponsorship. We are lucky to have DXC, a technology company, as our main sponsor along with long-standing backers such as Hive Composites and Cool Water Direct.\n“The Air Force also comes first at all times, not the football. We sometimes lose a couple of players due to them being needed elsewhere in the world.”\nThe current crop are following in some famous footsteps. Stanley Matthews once played for the RAF, as did his Blackpool team-mate — and fellow 1953 Cup-final winner — Stan Mortensen. Bill Shankly is another to have served, while former Manchester City midfielder Lee Crooks was a more recent addition to the Air Force’s ranks of professional footballers.\nModern-day RAF football is very much run along club lines, with new arrivals even facing the same initiation test that has become a staple part of life in the Premier League and EFL.\n“We all had to sing a song in front of the rest of the lads on the recent trip to Spain,” explains Flight Lieutenant Aaron Eyett, once on the books of Boston United and among four newbies in the 2023 squad. “It was quite funny, as there were loads of old people in the same hotel. They all got involved, as I sang ‘Pina Colada’.”\n“I went for ‘Unwritten’ by Natasha Bedingfield,” adds Flying Officer Jordan Sowerby. “Quite brave for someone who can’t sing but I knew all the words, that’s why I chose it.”\nAs the rain grows stronger at Lilleshall, training is focused and clearly designed to make the players value possession. There’s still room for plenty of banter, mind, as we discover on stepping into the staff changing room before the session gets underway.\nAdvertisement\n“This is Lewis,” says manager Kuchta. “He’s Josh Brownhill’s brother. It’s all he talks about so I’ll save you time by telling you now!”\nWembley, May 19, 2018. FA Cup final day.\nThere are 52 minutes on the clock and Chelsea lead Manchester United 1-0 when Corporal Claisse’s big moment arrives. As captain of the RAF football team and recently voted Players’ Player of the Season as well as Player of the Season, he has been given the honour of carrying the most famous trophy in English football to mark the Air Force’s centenary.\nHaving had a run-through of his duties earlier in the day, there are no nerves when the FA official comes to fetch him from Club Wembley. His uniform has been hanging in the second dressing room reserved for the match officials since late morning.\nHere, he gets changed and then waits. With 10 minutes remaining and Chelsea still ahead through Eden Hazard’s penalty, Claisse is handed the Cup, complete with one blue ribbon and one red ribbon due to the match still being in the balance, and then led through the backstairs to a perch near the Royal Box.\nThe final whistle means what started with Claisse believing he was the victim of a practical joke — “I thought it was one of the lads so slammed the phone down,” he says about the call from the top brass to say he’d been selected — has suddenly become very serious.\n“This guy from the FA threw me a blue ribbon the moment the final was over,” he recalls. “As a Leeds fan, I’ll admit to enjoying taking the red ribbon off and tying this other one on!\n“Once that was done, we walked outside and I was right under the Royal Box. There were four minders/bouncers waiting for me. I needed them, as people were trying to touch the cup and there were cameras everywhere.\n“Next thing I know, Man United are coming towards me. I’m stood there, next to the window and holding the cup, as they went past literally three or four yards away.\nAdvertisement\n“I got some right dirty looks. Particularly from (Antonio) Valencia and Phil Jones. (Paul) Pogba was about eighth or ninth up. I don’t know why I did this but I just said, ‘All Leeds Aren’t We?’ to him. He wagged his finger.\n“Once they’d filed past, that was my cue to walk up the steps with the cup, slowly. I turned left, saw Wembley right in front of me and I’ll admit the nerves got me then.”\nHis duties complete, Claisse, a former Leeds junior who spent four years on the books of Bradford City before moving into non-League at 19, made his way down to the pitch.\n“Next thing I know Antonio Conte is putting his arm round me,” he adds. “Conte then says, ‘Thank you for the service you give this country — please come and join us on the podium’. The FA guy stepped in at that stage and said it wasn’t allowed.\n“But what a great gesture from Conte. I’ve never forgotten it. Nor the words he said about the service we all give. He even invited me to Chelsea’s party to celebrate winning the Cup. I was gutted when it didn’t work out for him at Spurs. Really nice bloke.”\nFor Claisse, that “service” mentioned by Conte has included a tour of Afghanistan in 2014 alongside Prince Harry, whose wedding to Meghan Markle four years later just happened to coincide with his starring role on Cup final day.\n“The original plan was for me to present the cup to Prince William but he was at Harry’s wedding,” adds Claisse, whose tour of Iraq in 2018 had to be cancelled due to the shoulder injury that has now brought an end to his RAF football career.\n“A few months later, though, Prince William flew into Brize Norton and came over to thank me for carrying the Cup. When you’re just a lad from south Leeds, you don’t expect anything like that to happen to you.”\nClaisse’s CV in Services football is a stellar one, featuring four Constantinople Cup triumphs. The 36-year-old also lifted the Kentish Cup, played between the UK Armed Forces and their counterparts from France and Holland, on three occasions.\nAdvertisement\nToday, though, it is Inter-Services football that is focusing the mind, even though, like his great friend Sergeant Lewis Brownhill — who, as well as having a brother who plays for Burnley, has also lifted the FA Vase at Wembley as a Thatcham Town player in 2018 — injury means his role now is helping the team prepare.\n“I’ve honestly never played in games faster than these,” says Claisse, who joined the RAF as an air and space operations specialist in 2011. “Lee Crooks was at Bradford City at the same time as me but then went into the RAF.\n“I remember him pulling the gaffer ahead of my first Inter-Services and saying it would be better for me to watch the first half from the bench. Crooksy’s own debut had been so fast, he’d admitted at half-time, ‘I don’t even know where I am’.\n“This is someone who had played in the Premier League with Manchester City and been with England camps. But that first game, he felt like a lost soul.”\n“It’s 1-1 but we’ve created 10 chances. Stay classy, stay patient, do what we have worked on and we win this game.”\nThe home dressing room at is silent, apart from team manager Kuchta. His side have just dominated the first half after going ahead inside the opening 10 minutes through energetic midfielder Eyett. But the Army are still level, Scott Hynd cancelling out that early opener by heading in from a free kick.\nConsidering how that afternoon’s team meeting had highlighted the Army’s threat at set pieces — including the warning, “Don’t be the one who gives me a heart attack by switching off” — Kuchta could be forgiven for being frustrated. But if he is, he’s not showing it.\nInstead, the focus is on what the Air Force have done right in those opening 45 minutes. Which, to be fair, is a lot with captain Campbell a huge threat up front alongside Air Specialist Joe Spalding, whose pace is causing serious problems for the Army back line.\nAdvertisement\nGosling, playing at the tip of the diamond, has also looked a class above proceedings with his vision and ability to find a team-mate even when under the most intense of pressure.\nPredictably, the former Gibraltar international is involved in what proves to be the winner midway through the second half. Having exchanged passes with Spalding at a short corner, Oxford-born Gosling, at one stage his adopted country’s record scorer after netting against Estonia and Poland, whips over a lovely cross for Sam Rawlings to head past Luke Cairney, Poole Town’s first-choice goalkeeper in National League South and comfortably the Army’s best player.\nIn an ironic turn of events considering their day jobs, the RAF then have to withstand an almighty aerial bombardment in the final stages. Kuchta is ready, bringing on three late substitutes to add height to a side whose pre-match briefing that afternoon included who should pick up who if there had to be a switch to a more defensive set-up.\nEventually, the final whistle blows. The Air Force bench erupts, as the players and staff race on to the field. A huddle forms among this band of brothers, who are soon bouncing up and down, chanting over and over again, “Championes, Championes, ole ole ole…”\nIn the morning, these players will return to their bases across the UK and further afield. The next football assignment isn’t until June, when they will take on their Dutch counterparts in the Netherlands.\nWho knows where the world will be by then, so tonight is for celebrating, as Claisse and Campbell lift the Constantinople Cup — so-called because the trophy was gifted by the United Services Club in the Turkish city now known as Istanbul — to the delight of their team-mates.\n“A real emotional rollercoaster,” says Kuchta when asked for his verdict on the night. “But what I really hope is this was a showcase not just of military football but also that we play the right way. Whether that is the Army, the Navy or the Air Force. And how much it means to us all.”\n(Top photo: The Athletic)",
  "word_count": 2528,
  "scraped_at": "2026-02-14T12:24:52.982894"
}