{
  "article_id": "36778680aa8d",
  "url": "https://www.guardian.co.tt/aboutus-6.11.0.aa3912d0d4",
  "title": "About Us - Trinidad Guardian",
  "date": "20250311T101500Z",
  "domain": "guardian.co.tt",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "ANSA McAl is the majority shareholder of publicly traded Guardian Media Limited (GML). Guardian Media runs a multimedia operation with presence in print, radio, television, electronic billboards and digital media, making it the most comprehensive media company in the Caribbean.\nMost of its operations are in Trinidad and Tobago, with the Guardian daily and Tobago Today weekly newspapers, CNC3 television, six radio stations, electronic billboards and an increasingly strong digital presence. More recently, Guardian Media also branched out to Guyana with the launch of Mix 90.1FM.\nIt has operational centres in Port-of-Spain, San Fernando and Scarborough (Tobago), providing state of the art facilities for in-house and commercial TV, radio and print production. It also has radio studios and production facilities in Georgetown, Guyana.\nGuardian Media was recently restructured to reflect the converging needs of today’s media operations and to make the most of digital media opportunities, moving away from platform-specific divisions to a more dynamic and flexible structure focused on content, sales and operations.\nTo be the solution provider of choice for information and entertainment, delivering global quality products to customers, sustainable returns and growth to our shareholders, in an environment which fosters employee development and growth, innovation, excellence and exemplary customer service.\nTo be the leading communications company in the region operating with global standards.\nThe Trinidad and Tobago Guardian is the longest running daily newspaper in the country, marking its centenary in 2017. The paper started life as the Trinidad Guardian on Sunday 2nd September 1917 by the newly formed Trinidad Publishing Company Limited.\nDespite the uncertainties caused by the First World War, the courage of its founders paid off, with the newspaper quickly becoming an integral part of life in Trinidad. The longevity and prominence of this newspaper over the years can be attributed to the commitment and passion of several generations of shareholders, directors and editors who have guided and nurtured the publication over its long history, and who remained steadfast in their commitment to preserving the notable attributes of the publication, namely accuracy, reliability, fairness, balance and responsible reporting.\nThe Guardian is also widely known as the best provider of financial and business news in the region, especially through its Business Guardian supplement, published weekly on Thursdays and Sundays.\nThe newspaper also publishes a number of regular and ad-hoc supplements with focus on Women, Children, Sports, Health, Jobs, Tourism, etc. It also provides regular SEA and CSEC exam practice tests for revision for primary and secondary school children in Trinidad and Tobago, playing a major role in helping pupils prepare for key tests and contribute to the country’s education.\nIn 2008 the Guardian modernised its production facilities by investing in state of the art equipment, which allows the company to bolster its production process, facilitate the highest quality standards of production output and deliver a variety of niche products to our readers and advertisers in a rapidly changing market. Its modern printing presses are also widely used by commercial clients, with third party newspapers, annual reports, promotional fliers, magazines and special supplements all catered for.\nUnlike markets elsewhere in the world, newspaper circulation in Trinidad is stable and key offers such as classifieds remain strong in the market. However, users are increasingly seeking news and information through digital platforms and the Guardian has market leading digital products with latest news and digital newspaper editions available through its website and apps. Together with CNC3 News’ website, the Guardian’s has one of the most successful news websites in Trinidad and Tobago, with high levels of daily visits by local and international online users, totalling over one million monthly visits.\nIn 2015, Guardian Media started a sister publication, Tobago Today – a weekly newspaper for the Tobago market. It brings the news that matters to Tobagonians in a market many times neglected by Trinidad-based media operations. The paper is produced alongside Tobago Hot Spots, a monthly publication aimed at the tourist industry on the island. In 2017, Tobago Today began to be distributed as part of the T&T Guardian so that both Trinidadians and Tobogonians were able to access it.\nCNC3 was initially launched as a cable-only news service in September 2005, as Cable News Channel 3, with its output consisting mainly of News and Current Affairs. In 2008, CNC3 obtained a free to air license, becoming one of the mainstream national broadcasters, operating on channels 12, 14 and 22. Potentially, it can reach all 400,000+ households in Trinidad and Tobago, with its signal extending into Grenada. Beyond its free to air presence, CNC3 is available on all T&T’s leading cable and satellite services and it is also streamed online.\nAs it broadened its appeal beyond News & Current Affairs, the station quickly became a prime time market leader, with a mix of local and foreign shows. With increased local access to foreign channels via cable or online, the station has been building its local content portfolio as a key market differentiation, bringing a mix of in-house and independent productions in several genres.\nRecent successful shows include satirical weekly The Rundown, the daily weekday talk show Sunny at Sundown and food strands including Cravings and Taste and a number of independent productions focusing on a variety of interests such as cars, business and religion.\nCNC3 has a strong commitment to T&T’s sports as the local exclusive broadcaster for major events such as cricket’s CPL and the FIFA World Cup. It also has partnerships and rights to broadcast other major events such as the Olympic games and local competitions like the Secondary School Football League, in line with its support for local talent.\nThe channel is also dominant on digital platforms and social media, through its own website (cnc3.co.tt), and a soon to be released dedicated app for iOS and Android to increase its already thriving presence on all major social media services.\nGuardian Media has the first and largest radio network in Trinidad and Tobago, with its beginnings dating back to 1925 when a British based company, Rediffusion, acquired rights to radio distribution in Trinidad. The company continued to expand its operations and, in 1946, it formally created the Trinidad Broadcasting Company, setting up its own full station in 1947, known as Radio Trinidad 730AM.\nTBC continued with its pioneering ethos by launching, in 1976, the country’s first FM station: 95.1FM - The Best Mix. Other stations followed: Radio Tempo 105FM, now Vibe CT 105FM, a leader in local music and sports coverage.\nIn 2017, 95.1FM was re-branded to 951 REMIX and retains a market leading position as an adult contemporary station.\nThe East Indian market has been catered for by TBC since 1995, with the launch of Sangeet 106.1FM followed by Aakash Vani 106.5FM, both highly successful with a mix of chutney and other East Indian music as well as talk and discussion programmes.\nIn 2011, TBC launched its sixth radio station, Slam 100.5FM. The progressive urban station has taken the market by storm, becoming a multimedia conversation point for a younger, urban demographic in Trinidad and Tobago.\nIn 2015, the network was revamped with the closure of its inspirational 730AM service and the opening of Sky 99.5FM, also catering for the Christian inspirational market. This was needed to reflect the fact that most people in Trinidad and Tobago now prefer to listen to radio on FM. Also in the same year, Guardian Media decided to take its decades of radio broadcast experience to Guyana, with the setting up of Mix 90.1FM, an adult contemporary music station broadcasting live from the capital Georgetown and serving all major cities in the country.\nGuardian Media’s network of stations is also available online on station websites and through mobile apps, helping cement its position as Trinidad and Tobago’s biggest and best radio network with over 200 thousand regular listeners on air and online.\nThe station brings the heritage and credibility of Radio 730AM the FM band, serving the gospel community and has a wide listenership both in Trinidad and Tobago with a mix of current affairs, gospel and inspirational programmes, music and talk.\nSangeet 106.1 FM is a leading radio station in the contemporary East Indian Market, catering for the 18 to 40 year-old demographic. The music is composed of local chutney, the latest and the most popular Bollywood songs and super remixes. Sangeet 106.1FM is synonymous with broadcasting all the hottest and happening Chutney Events held at nightclubs throughout the country, and is the Official Station for major Chutney Events.\nThe Vibe CT 105 FM – ‘The Nation’s Station’ resonates with the pulse of the demographic that is 30 and over. The premium Urban Adult station reflects the sound and events of the people. Calypso, Soca, Reggae and R&B all constitute the musical fare of the frequency, reflecting Trinidad and Tobago’s rich and diverse musical talent. Beyond music, the station is also the focal point for T&T’s other love: sports, and carries the slogan \"The Sports Leader\". It delivers lively and authoritative commentary of all major sporting events, especially cricket and football.\n951FM REMIX is the best music station in T&T serving a wide demographic, with music for the young and young at heart for listeners who enjoy a combination of top 40 mainstream hits & alternative, juxtaposed with some dance hits and EDM crossover appeal. The station brings an exciting mix of music and personalities on radio. Now with a new look, new line up and new sound. 951 Remix will turn your office day into an epic staff party! Play your music your way.\nSlam 100.5FM is the place to be for the young, urban, hip and trendy. It fuses the best elements of the Urban Culture, bringing an eclectic blend of Hip Hop, Dancehall, R&B, Pop, and Soca. We consistently engage our audience in interactive and progressive promotions and concepts, going beyond ordinary urban radio content. The station is also fully integrated with its social media platforms, in line with how its core audience consumes music and information in the digital world.\nThe most recent addition to Guardian Media’s radio network is in Guyana. Mix 90.1FM brings top 40 mainstream hits catering to young professionals ages 25 –35. The music offered to the Guyana’s discerning public is supported by decades of expertise in the sector. The station serves the areas of Georgetown, Linden, Berbice and beyond, broadcasting from modern facilities in the capital.\nLaunched in March 2015, The Big Board Company is the electronic billboard division of Guardian Media Limited. We own and operate some of the largest, high intensity LED screens in Trinidad. Offering the best picture quality in the market, we are positioned strategically in clutter free environments to ensure maximum visibility and returns to advertisers. With the ability to compliment any PR and marketing campaign, we provide the most comprehensive and powerful media mix for local, regional, and international advertisers with virtually all demographics catered for. The Big Board Company’s reach continues to grow as it moves to dominate the DOOH (Digital Out Of Home) industry as the leader in creative content advertising. Our current locations are:\nAnsa McAl is the majority shareholder of publicly traded Guardian Media Limited (GML). Guardian Media runs a multimedia operation with presence in print, radio, television, electronic billboards and digital media, making it the most comprehensive media company in the Caribbean.\nMost of its operations are in Trinidad and Tobago, with the Guardian daily and Tobago Today weekly newspapers, CNC3 television, six radio stations, electronic billboards and an increasingly strong digital presence. More recently, Guardian Media also branched out to Guyana with the launch of Mix 90.1FM.\nIt has operational centres in Port-of-Spain, San Fernando and Scarborough (Tobago), providing state of the art facilities for in-house and commercial TV, radio and print production. It also has radio studios and production facilities in Georgetown, Guyana.\nGuardian Media was recently restructured to reflect the converging needs of today’s media operations and to make the most of digital media opportunities, moving away from platform-specific divisions to a more dynamic and flexible structure focused on content, sales and operations.\nTo be the solution provider of choice for information and entertainment, delivering global quality products to customers, sustainable returns and growth to our shareholders, in an environment which fosters employee development and growth, innovation, excellence and exemplary customer service.\nTo be the leading communications company in the region operating with global standards.\nThe Trinidad and Tobago Guardian is the longest running daily newspaper in the country, marking its centenary in 2017. The paper started life as the Trinidad Guardian on Sunday 2nd September 1917 by the newly formed Trinidad Publishing Company Limited.\nDespite the uncertainties caused by the First World War, the courage of its founders paid off, with the newspaper quickly becoming an integral part of life in Trinidad. The longevity and prominence of this newspaper over the years can be attributed to the commitment and passion of several generations of shareholders, directors and editors who have guided and nurtured the publication over its long history, and who remained steadfast in their commitment to preserving the notable attributes of the publication, namely accuracy, reliability, fairness, balance and responsible reporting.\nThe Guardian is also widely known as the best provider of financial and business news in the region, especially through its Business Guardian supplement, published weekly on Thursdays and Sundays.\nThe newspaper also publishes a number of regular and ad-hoc supplements with focus on Women, Children, Sports, Health, Jobs, Tourism, etc. It also provides regular SEA and CSEC exam practice tests for revision for primary and secondary school children in Trinidad and Tobago, playing a major role in helping pupils prepare for key tests and contribute to the country’s education.\nIn 2008 the Guardian modernised its production facilities by investing in state of the art equipment, which allows the company to bolster its production process, facilitate the highest quality standards of production output and deliver a variety of niche products to our readers and advertisers in a rapidly changing market. Its modern printing presses are also widely used by commercial clients, with third party newspapers, annual reports, promotional fliers, magazines and special supplements all catered for.\nUnlike markets elsewhere in the world, newspaper circulation in Trinidad is stable and key offers such as classifieds remain strong in the market. However, users are increasingly seeking news and information through digital platforms and the Guardian has market leading digital products with latest news and digital newspaper editions available through its website and apps. Together with CNC3 News’ website, the Guardian’s has one of the most successful news websites in Trinidad and Tobago, with high levels of daily visits by local and international online users, totalling over one million monthly visits.\nIn 2015, Guardian Media started a sister publication, Tobago Today – a weekly newspaper for the Tobago market. It brings the news that matters to Tobagonians in a market many times neglected by Trinidad-based media operations. The paper is produced alongside Tobago Hot Spots, a monthly publication aimed at the tourist industry on the island. In 2017, Tobago Today began to be distributed as part of the T&T Guardian so that both Trinidadians and Tobogonians were able to access it.\nCNC3 was initially launched as a cable-only news service in September 2005, as Cable News Channel 3, with its output consisting mainly of News and Current Affairs. In 2008, CNC3 obtained a free to air license, becoming one of the mainstream national broadcasters, operating on channels 12, 14 and 22. Potentially, it can reach all 400,000+ households in Trinidad and Tobago, with its signal extending into Grenada. Beyond its free to air presence, CNC3 is available on all T&T’s leading cable and satellite services and it is also streamed online.\nAs it broadened its appeal beyond News & Current Affairs, the station quickly became a prime time market leader, with a mix of local and foreign shows. With increased local access to foreign channels via cable or online, the station has been building its local content portfolio as a key market differentiation, bringing a mix of in-house and independent productions in several genres.\nRecent successful shows include satirical weekly The Rundown, the daily weekday talk show Sunny at Sundown and food strands including Cravings and Taste and a number of independent productions focusing on a variety of interests such as cars, business and religion.\nCNC3 has a strong commitment to T&T’s sports as the local exclusive broadcaster for major events such as cricket’s CPL and the FIFA World Cup. It also has partnerships and rights to broadcast other major events such as the Olympic games and local competitions like the Secondary School Football League, in line with its support for local talent.\nThe channel is also dominant on digital platforms and social media, through its own website (cnc3.co.tt), and a soon to be released dedicated app for iOS and Android to increase its already thriving presence on all major social media services.\nGuardian Media has the first and largest radio network in Trinidad and Tobago, with its beginnings dating back to 1925 when a British based company, Rediffusion, acquired rights to radio distribution in Trinidad. The company continued to expand its operations and, in 1946, it formally created the Trinidad Broadcasting Company, setting up its own full station in 1947, known as Radio Trinidad 730AM.\nTBC continued with its pioneering ethos by launching, in 1976, the country’s first FM station: 95.1FM - The Best Mix. Other stations followed: Radio Tempo 105FM, now Vibe CT 105FM, a leader in local music and sports coverage.\nIn 2017, 95.1FM was re-branded to 951 REMIX and retains a market leading position as an adult contemporary station.\nThe East Indian market has been catered for by TBC since 1995, with the launch of Sangeet 106.1FM followed by Aakash Vani 106.5FM, both highly successful with a mix of chutney and other East Indian music as well as talk and discussion programmes.\nIn 2011, TBC launched its sixth radio station, Slam 100.5FM. The progressive urban station has taken the market by storm, becoming a multimedia conversation point for a younger, urban demographic in Trinidad and Tobago.\nIn 2015, the network was revamped with the closure of its inspirational 730AM service and the opening of Sky 99.5FM, also catering for the Christian inspirational market. This was needed to reflect the fact that most people in Trinidad and Tobago now prefer to listen to radio on FM. Also in the same year, Guardian Media decided to take its decades of radio broadcast experience to Guyana, with the setting up of Mix 90.1FM, an adult contemporary music station broadcasting live from the capital Georgetown and serving all major cities in the country.\nGuardian Media’s network of stations is also available online on station websites and through mobile apps, helping cement its position as Trinidad and Tobago’s biggest and best radio network with over 200 thousand regular listeners on air and online.\nThe station brings the heritage and credibility of Radio 730AM the FM band, serving the gospel community and has a wide listenership both in Trinidad and Tobago with a mix of current affairs, gospel and inspirational programmes, music and talk.\nAakash Vani 106.5 FM is a leading mature East Indian Radio Station delivering a unique and captive audience. It hosts market leading shows - The Morning Panchayat along with Ramayans and the right mix of music from the 80's 90's, and 2000 era. The station represents strong and positive family values that is pleasing to the listeners. Aakash Vani also delivers the most outdoor broadcast of Religious & community events.\nSangeet 106.1 FM is a leading radio station in the contemporary East Indian Market, catering for the 18 to 40 year-old demographic. The music is composed of local chutney, the latest and the most popular Bollywood songs and super remixes. Sangeet 106.1FM is synonymous with broadcasting all the hottest and happening Chutney Events held at nightclubs throughout the country, and is the Official Station for major Chutney Events.\nThe Vibe CT 105 FM – ‘The Nation’s Station’ resonates with the pulse of the demographic that is 30 and over. The premium Urban Adult station reflects the sound and events of the people. Calypso, Soca, Reggae and R&B all constitute the musical fare of the frequency, reflecting Trinidad and Tobago’s rich and diverse musical talent. Beyond music, the station is also the focal point for T&T’s other love: sports, and carries the slogan \"The Sports Leader\". It delivers lively and authoritative commentary of all major sporting events, especially cricket and football.\n951FM REMIX is the best music station in T&T serving a wide demographic, with music for the young and young at heart for listeners who enjoy a combination of top 40 mainstream hits & alternative, juxtaposed with some dance hits and EDM crossover appeal. The station brings an exciting mix of music and personalities on radio. Now with a new look, new line up and new sound. 951 Remix will turn your office day into an epic staff party! Play your music your way.\nSlam 100.5FM is the place to be for the young, urban, hip and trendy. It fuses the best elements of the Urban Culture, bringing an eclectic blend of Hip Hop, Dancehall, R&B, Pop, and Soca. We consistently engage our audience in interactive and progressive promotions and concepts, going beyond ordinary urban radio content. The station is also fully integrated with its social media platforms, in line with how its core audience consumes music and information in the digital world.\nThe most recent addition to Guardian Media’s radio network is in Guyana. Mix 90.1FM brings top 40 mainstream hits catering to young professionals ages 25 –35. The music offered to the Guyana’s discerning public is supported by decades of expertise in the sector. The station serves the areas of Georgetown, Linden, Berbice and beyond, broadcasting from modern facilities in the capital.\nOne of the most recent areas of activity added by Guardian Media are electronic billboards, which were launched in March 2015. They are the largest in Trinidad and Tobago, with the best picture quality in the market and positioned in strategic points to maximize returns to advertisers. The billboards, traded as The Big Board Company (TBBC), help Guardian Media provide the most comprehensive and powerful media mix for local and international advertisers with virtually all demographics catered for. TBBC reach continues to grow as it moves to dominate the DOOH (Digital Out OF Home) Advertising industry. Currently, the locations of TBBC’s electronic billboards are as follows:\n1. Guardian Building (North Face), St Vincent St., PoS\n2. Guardian Media Ltd Headquarters Chaguanas, South Bound\n3. TBC Transmitter Site Caroni, North Bound\n4. Champ Fleur West Bound PBR & EMR\n5. Champ Fleur East Bound PBR & EMR\n6. Roxy Roundabout St. James\n7. The UWI, CNR EMR and Tunnel Drive\n8. ANSA Coatings, Tumpuna Rd. Arima\n9. Lady Young Road, Morvant\n10. VMCOTT Beetham Highway, Westbound\n11. VMCOTT Beetham Highway, Eastbound\n12. ANSA Auto Chaguanas, North Bound\nGuardian Media is the premier provider of multimedia solutions and authoritative insight on news, politics, business, finance, sports, and current affairs. Our brand portfolio includes CNC3, Guardian, TBC Radio Network and The Big Board Company.\nSend us an e-mail here or call us at +1-(868)-225-4465 / +1-(868)-235-5668",
  "word_count": 3874,
  "scraped_at": "2026-02-14T12:35:04.049497"
}