{
  "article_id": "3691ebb7cf46",
  "url": "https://www.ok.co.uk/lifestyle/shelf-stacking-pizza-deliveries-england-30732009",
  "title": "Shelf stacking and pizza deliveries - England Lionesses before fame on the field",
  "date": "20230819T230000Z",
  "domain": "ok.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Shelf stacking and pizza deliveries - England Lionesses before fame on the field\nThey've won the hearts of the nation with their spectacular performances on the pitch, but OK! explores the day-to-day jobs that our champion girls juggled before a football landed at their feet\nIt's fair to say that the path to super stardom for female footballers isn't always a smooth one.\nYou need need a burning motivation and steely determination as well as a true passion for the game.\nMost women in the sport agree that a post-football career action plan is needed too in order to ensure a steady flow of income. But even before making it to the big time, our favourite Lionesses have always worked hard.\nFrom sweeping floors and delivering pizzas to factory work and fish frying, these women prove they have always been prepared to put the hard yards in to achieve their goals.\nMillie Bright\nMillie arrived to the sport later than most, but the 29 year old Chelsea defender has more than made her mark in the game. She has openly spoken about how she landed in football almost by accident, after considering an equestrian career.\nThe budding horse rider's family own a stable of horses in South Yorkshire so her days were spent helping tend to the animals with childhood plans to take her riding to a competitive level.\nThat changed though when at 16 she joined Sheffield United before moving over to Doncaster Rovers Belles, and then to Chelsea in 2015.\nFor insurance purposes, Millie can't pursue her love for horses anymore but has plans to jump back in the saddle when it's time to hang up her boots.\nLucy Bronze\nIt has been 10 years since Lucy set foot inside Morrisons as a worker and it's hard to believe how far she has come.\nRaising funds for a bus to the game, Lucy would pack bags in her local store and then work in Dominos as well as a bar while studying. The pizza branch in Headingly now affectionately calls the store 'Lucy's' in her honour after her Euros win last year.\nShe also studied sports science at Leeds Beckett University between 2010 and 2014.\nLucy told OK! that women outside the England squad will likely still work other jobs to top up their earnings.\nShe said: \"We don't make enough money to just put our feet up on the beach afterwards and retire.\n\"A lot of players in the WSL still work another job and a lot of players have given up as there's more money being a teacher. It's a lot of stress trying to manage being a footballer with a regular job. It is frustrating.\n\"It's not something we'll ever get used to. We're painted to be professional sports people and you play in leagues where the perception is that everyone is professional, but if everyone was professional the standard would go up.\"\nMary Earps\nTravelling to and from training and matches isn't cheap and for England goalkeeper, Mary Earps, juggling part-time jobs that didn't pay well were her only option.\nShe needed to raise money for petrol costs travelling from Nottingham to Doncaster Belles and worked in a cinema, held down two coaching jobs, worked hours in a toy shop shelf-stacking and even helped at her dad's company in telesales all the while studying for her A-levels.\nThe low paid work accumulated enough to help pay for her boots and travelling costs, but the savvy sports star knows all too well that brains count for everything.\nThe 31 year old still managed to find time to complete an Information Management and Business Studies degree at Loughborough University, posting proudly on her Instagram when she graduated.\nShe said at the time: \"Today I graduated from one of the top universities in the country, the university that I've always dreamed of attending, with a 2:1 degree in Business... and it's safe to say that the stress, sweat, tears and sleep deprivation were all worth it. Thank you for a challenging and unforgettable four years.\"\nBeth England\nBeth England might be busy now but she has always been a grafter after frying fish for a living while studying.\nThe England striker juggled her football career with education and numerous jobs including work in her local chippy, doing exhausting weekend night shifts, hours in her nearby bakery, factory work, waitressing at an Indian restaurant and working at M&S.\nThe clever 29 year old Tottenham Hotspur player, who played with her twin sister Laura at just 13 for Sheffield United, also miraculously found time to travel from Barnsley to London to complete a 12-week education pathway for legal studies.\nA true crime super fan, Beth won a scholarship to the private BPP University to study family law part-time thanks to her efforts at Doncaster Belles.\nJill Scott\nRetired now, Jill Scott is the second-most capped player in the Lionesses' incredible history and although she bowed out gracefully after last year's Euro smash after 16 years with the England squad, she hasn't forgotten her roots.\nShe owns a coffee shop with her fiancee Shelly Unitt, in Manchester, and even after the Euros win last year was back behind the counter and sweeping floors within days of lifting the trophy.\nCrowned Queen of the jungle on I'm a Celebrity, the 5ft 11 star from Sunderland was a keen runner and won the Under 13 Cross Country title, nearly shunning the world of football to pursue her running dream.\nLeah Williamson\nEngland captain Leah Williamson's family feared she would never walk when she was a toddler after being born with inward-pointing toes, with the possibility of a leg brace needed.\nGymnastics from the age of two four times a week for seven years, helped and it was her gymnastics coach who brought a football out at the end of training sessions which developed her love for the sport.\nChoosing the ball over back flips, she is now already prepping for life after football, and is studying a part-time course in accountancy.\nAware that she'll need another income when her boots are hung up, she hopes that future women coming through in the sport won't have to consider other post-football roles.\nShe told City AM in 2021: \"I'm under no illusions that I'm not going to be able to retire at the end of my career and be fine for the rest of my life. I will have to work again and maybe that's where I have come in [to the sport] just a little too early, in terms of hopefully one day these girls will earn enough that they are set for life.\n\"If a boy signs for an academy aged 16 he is generally set for life. It's a massive contrast in our game and I'm aware of that. It's ridiculous to think that once your career finishes you are going to be fine and set.\"\nAlthough a true Lioness, sadly, Leah hasn't been playing in the World Cup this year due to a ACL (anterior cruciate ligament) injury.\nEllen White\nRecord goal scorer Ellen White has come quite a way from her younger days of being banned from the league at just eight years old because she was a girl.\nIn her early twenties, the 34 year old former striker also worked a 9-5 job as the club's full-time Sports Development Officer, helping to organise projects and training to encourages others to take part in the sport.\nShe also juggled the gym and training in the evenings with studying Sports Science at Loughborough University and her job with attending matches.\nShe retired last year and gave birth to her baby daughter Maeve in April this year but will be cheering on her fellow Lionesses at the final.\nAs England make history and fly through to the World Cup final - get your England kit here!",
  "word_count": 1315,
  "scraped_at": "2026-02-14T12:40:16.997073"
}