{
  "article_id": "3695844e7696",
  "url": "https://freerepublic.com/tag/*/index?more=4319470",
  "title": "Latest Articles",
  "date": "20250528T064500Z",
  "domain": "freerepublic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Search:\nKeywords\nUsers\nTitles\nYahoo\nHome·\nSettings·\nBreaking ·\nFrontPage ·\nExtended ·\nEditorial ·\nActivism ·\nNews\nPrayer PrayerRequest SCOTUS ProLife BangList Aliens HomosexualAgenda GlobalWarming Corruption Taxes Congress Fraud MediaBias GovtAbuse Tyranny Obama Biden Elections POLLS Debates TRUMP TalkRadio FreeperBookClub HTMLSandbox FReeperEd FReepathon CopyrightList Copyright/DMCA Notice\nMonthly Donors · Dollar-a-Day Donors · 300 Club Donors\nor by or by mail to: Free Republic, LLC - PO Box 9771 - Fresno, CA 93794\n-\nRejecting US GHF - non-answer to \"why not as an intl. humanitarian aid org. back this structure if this is what the Govt. of Israel requires in order to feed 2M people?\"\nThose rejecting GHF humanitarian Aid backed by US/Israel. An empty long blah blah non-answer to a simple question. As if it was so \"humanely\" when UN handled it... (Ciaran Donnelly of IRC). Geee. I thought it's urgent and there is no time for tests or \"honor\" stuff. _____ PBS NewsHour, 5.27.25. Nick Schifrin: But, in some ways, if this is the structure that Israel is demanding, why not as an international humanitarian aid organization back this structure if this is what the government of Israel requires in order to feed two million people? Ciaran Donnelly: The starting point for our... -\nNew Presbyterian Church (USA) Report for 2024 Reveals Shocking Membership Statistics\nThe Presbyterian Church (USA) just revealed its membership numbers for 2024, and it is not pretty. The liberal denomination is showing a continued loss of membership, closure of churches, an increasingly aging population, and an inexorable decline into irrelevancy, with one of the only rising data points being the number of members who identify as “non-binary” or “genderqueer.” Since its formation, the PCUSA has denigrated to one massive pen for goats, run almost exclusively by faithless, didn’t-finish-well octogenarians and blue-haired lesbians, with barely a sheep to be found anywhere. Some of their greatest hits over the last three years include:... -\nAmerica Prayer Vigil - May 27, 2025\nJoin with fellow FREEPERS to pray for AMERICA: For those in Authority in Government, Family, Military, Business, Agri-Business; End to Sex Slavery; Healthcare, Education, Churches, and the Media. This is the confidence we have in approaching God: that if we ask anything according to His will, He hears us. (1 John 5:14) I urge, then, first of all, that requests, prayers, intercession and thanksgiving be made for everyone: for kings and all those in authority that we may live peaceful and quiet lives in all godliness and holiness. ~ 1 Timothy 2:1-2 Religion Forum Threads labeled [Prayer] are closed to... -\nblack woman claims that White people have nothing to be proud of\nshellshock @shellshockkk Theory about white people 1:27 PM · May 27, 2025 -\n‘Follow The Facts’: Activists Renew Calls For DOJ To Investigate Five Aborted Babies At DC Clinic\nConservative and pro-life groups are again asking the Department of Justice (DOJ) to investigate five fetuses found near a Washington, D.C. clinic in 2022 now that President Donald Trump is back in office. Nine organizations sent a letter Tuesday to U.S. Attorney Jeanine Ferris Pirro sounding the alarm about pro-life activists’ discovery of the bodies in containers from the Washington Surgi-Clinic. Some of the babies discovered were so large that they brought suspicion of illegal partial-birth or post-birth abortions, and the Biden administration only prosecuted those who protested at the clinic in 2020. “In 2022, pro-life activists in Washington, D.C.,... -\nMissouri Supreme Court Blocks Abortions, Babies Will be Protected for Now\nThe Missouri Supreme Court today issued a ruling that could reinstate the state’s abortion safety standards — previously blocked by a lower court—by requiring the case to be reevaluated under a stricter legal standard. The decision effectively blocked abortions in Misosuri, with no abortion businesses able to meet the basic standards, and babies will be protected for now. The Court’s decision ordered Judge Jerri Zhang of the 16th Circuit to vacate her earlier rulings from December 2024 and February 2025, which had allowed abortions to temporarily resume in the state following the passage of Amendment 3. The Missouri Supreme Court... -\nGovernor Kevin Stitt Signs Bill Making It Harder to Reverse Oklahoma Abortion Ban\nOklahoma Governor Kevin Stitt signed Senate Bill 1027 into law on Saturday, a measure that pro-life advocates say strengthens protections for the state’s pro-life abortion ban by reforming the initiative petition process. The bill, which caps the number of signatures that can be collected from each county for state ballot questions, aims to ensure broader representation across Oklahoma’s 77 counties, particularly amplifying rural voices. The legislation amends the requirements for state question petitions, setting a signature cap at 10% of voters in counties with populations over 400,000 and 4% in counties with fewer than 400,000 residents. Proponents argue this change... -\nTexas Republican lawmaker roasted for passing ‘Ten Commandments’ bill on the Sabbath in viral video\nA Texas Republican lawmaker, Candy Noble, has been roasted by one of her Democratic counterparts for passing what’s become known as the “Ten Commandments” bill on the Sabbath. Listen to this article 0:06 / 3:21 On Sunday (26 May), Senate Bill 10 – part of a push in Texas to increase the role of religion in schools – was moved forward, passing the house by 82-46, meaning that from September every public school classroom in Texas could be required to display the Ten Commandments. A viral video posted on TikTok, which has been viewed more than three million times and... -\nJake Tapper Says Liberal Podcaster Made Racism Jab After He Revealed Son Wants To Be a Cop: ‘This Is Why You ****ers Are Losing Elections’\nCNN anchor Jake Tapper argued the left’s reaction to him revealing his 15-year-old son wants to be a police officer is the exact reason they are losing elections. Tapper and his Original Sin co-author Alex Thompson joined Scott Galloway on The Prof G Pod on Thursday, and Tapper at one point recounted how a left-leaning podcaster made a racism jab about his son after Tapper revealed he wanted to go into law enforcement. “My son is now 15 years old, and he’s a gamer. He’s a football fan, starting linebacker on his varsity football team. The Democratic Party has no... -\nPastor Calls for Apology After Seattle Mayor Blames Christian Rally for Inspiring Violent Counter-Protest\nA pastor is demanding an apology from Seattle Democrat Mayor Bruce Harrell after Harrell blamed a Christian rally for a LGTBQ+ counter-protest that turned violent. Pro-life organization Mayday USA held a rally at Cal Anderson Park — the site of CHOP and many BLM protests — for its “DontMessWithOurKids” national tour, which hundreds attended to support biological reality, family, and religious freedom. Hundreds of Pro-LGBTQ+ counter-protesters crashed the rally and violence ensued. Twenty-three protesters were arrested, according to police. Several police officers were assaulted while trying to make arrests and control the chaos, and one officer was injured and taken... -\n5 arrested as group rallies at City Hall over Harrell's comments about chaotic protest\nA religious group is protesting outside Seattle City Hall on Tuesday following a weekend of unrest at Cal Anderson Park. At least four people have been arrested for assault at the First Amendment event outside of City Hall, according to the Seattle Police Department (SPD). KOMO News crews at the protest saw at least one other arrest, in addition to the four SPD reported. The \"Rattle in Seattle\" rally was scheduled to take place at Seattle City Hall at 5 p.m. A counter rally was also planned at the same location and began an hour earlier. -\nTrump pardons reality TV stars Todd and Julie Chrisley after lobbying campaign from daughter Savannah\nPresident Donald Trump pardoned reality television stars Todd and Julie Chrisley on Tuesday, calling their daugher Savannah and informing her of his decision. The Chrisleys, who starred in the television show Chrisley Knows Best and several spin-offs, were found guilty in 2022 of defrauding banks out of $30 million. Julie Chrisley is serving time in Kentucky, while Todd Chrisley is serving time in Florida. White House aide Margo Martin revealed the pardon by posting video of the president on the phone with Savannah, captioning the post: 'Trump Knows Best!' a play on the couple's breakout reality TV show title. While... -\nChristians Demand Apology After Dem Mayor Condemns Pro-Life Group’s Event — Which Antifa Mob Disrupted\nA group of Christians are demanding an apology from Democratic Seattle Mayor Bruce Harrell after he called their event — which far-left rioters had disrupted — an “extreme right-wing rally.” Evangelicals supporting Mayday USA plan to rally Tuesday outside Seattle’s City Hall following Mayor Bruce Harrell’s Saturday statement on that day’s altercation. Harrell called the group’s “Don’t Mess With Our Kids” event in Cal Anderson Park an “extreme right-wing rally,” and claimed in his statement that the event was held specifically to “provoke a reaction by promoting beliefs that are inherently opposed to our city’s values, in the heart of... -\nToxic femininity: Foreign-born Muslim women in Germany are far more violent than German men\nNew statistics out of Germany reveal that foreign-born women, but specifically foreign-born Muslim women, are far more violent than native German men. The Remix News staff, which reported on the story, quipped that the revelation “blows up a common myth that has been perpetuated by the left for years”—that men are so violent, a bear is preferable company. (Again, never mind the fact that men, to their own detriment, have been protecting their women for essentially all of human history.) Here are the numbers for 2024: Out of 100,000 people, German men were suspects in violent offenses in 272 cases.... -\nTrump Asks Supreme Court to Pause Biden Judge’s Order to Ground Plane Transporting Dangerous Aliens to South Sudan\nThe Trump DOJ on Tuesday asked the US Supreme Court to intervene in and pause a lower court’s order to ground a plane that transported several dangerous aliens to South Sudan. “The invasion of illegal aliens must end, and the conduct of our nation’s foreign policy cannot be directed by a single federal court judge,” US Attorney General Pam Bondi said. “DOJ has asked the Supreme Court to intervene to stop this insanity so that President Trump can continue to deport the worst of the worst illegal aliens,” Bondi said. US District Judge Brian Murphy, a Biden appointee on Monday... -\nTHE FREEPER CANTEEN - The American Culture Quiz: Country Classics/Patriotic Practices - Wednesday, May 28, 2025\n~ Freeper Canteen ~--Canteen Mission Statement--Showing support and boosting the morale of our military and our allies' military and family members of the above.Honoring those who have served before. Today We Want You To Take The.....American Culture Quiz: Country Classics/Patriotic PracticesHT--PROCON! Click HERE & scroll down to take the quiz! Have fun!Please remember that The Canteen is here to support and entertain our troops and veterans and their families, and is family friendly. -\nShoe, Dropped: Trump 'Pauses' Student Visas Across the Board\nUniversities and colleges across the country can thank Harvard for this latest development. If federal courts won't allow the Department of Homeland Security to deal directly with Harvard on compliance for the Student Education Visa Program (SEVP), the administration can simply make it more difficult for everyone instead. That seems to be the case today, although this may have accelerated a project that would have started soon anyway. After a federal court issued a stay that allows Harvard to continue enrolling foreign students, the Trump administration paused the entire program. Embassies and consulates have been ordered to stop conducting necessary... -\n[Catholic Caucus] Bishop Martin Crushes Charlotte Diocese Traditional Latin Mass Catholics\n[Catholic Caucus] Bishop Martin Crushes Charlotte Diocese Traditional Latin Mass CatholicsCharlotte, N.C. - Following upon the retired Bishop Peter Jugis’ initial implementation in 2023 of Pope Francis’s motu proprio that back-tracked on all of the previous Pope’s declarations of the pre-Conciliar Mass (and sacraments) having never been abrogated, Bishop Michael T. Martin slammed the door on traditional Catholics eliminating the Sunday Traditional Mass at the four parishes currently offering it. These included parishes in Greensboro, two in Charlotte, and Tryon.Coincidentally, The Remnant broke the initial story when the indult Latin Mass was first approved for Charlotte. (INSERT STORY LINK. I... -\nPolice Fatally Shoot Meth-Addled Florida Man Who Swam In Gator-Infested Lake, Sheriff Says\nTimothy Schultz, a 42-year-old Florida man, survived an apparent gator bite only to die Monday after attacking deputies with garden shears, authorities said. Polk County Sheriff’s Office (PCSO) Grady Judd alleged in a press conference that Schultz was high on meth during his swim in an alligator-infested lake and subsequent rampage with shears. While Schultz was swimming in the lake, one person tried to warn him about the gators and another threw a life vest at him, according to the sheriff. A gator then appeared to bite his right arm, Judd said. When Schultz emerged from the lake, he allegedly... -\nRick Derringer Dead at 77\nRick Derringer, the guitarist, songwriter and producer who wrote or contributed to a body of hits spanning decades, died on Monday at the age of 77. Derringer's caretaker, Tony Wilson, shared the news on Facebook, and Guitar Player later reported it. The guitarist's wife, Jenda Derringer, told TMZ he died \"peacefully\" in his sleep after being taken off life support following a medical episode. Born Richard Dean Zehringer on Aug. 5, 1947, in Celina, Ohio, and raised in the nearby Fort Recovery, Derringer began his burgeoning music career in earnest when he received his first guitar on his ninth birthday....\nBrowse by Forum\nGet Connected! Join Free Republic Today!\nAlready a Member? Log into your Free Republic account.\nBreaking News (News/Activism)\n- Dear FRiends, our FReepathon has fallen way behind. Please get your donations in as soon as you can. Thank you and God bless.\n- Sunday Morning Talk Show Thread 8 February 2026\n- The MAGA/America 1st Memorandum ~~ February 2026 Edition\n- Senate strikes deal to avert partial shutdown\n- US Border agents shoot two people in Portland, city officials say\n- Minnesota Gov Tim Walz to suspend re-election campaign amid Somali fraud scandal: report\n- One in custody after incident at Ohio home of JD Vance\n- Caracas, VenezuelaJanuary 3, 2026 6:30 AMUpdated: January 3, 2026 1:12 PMU.S. captures Venezuela's leader and his wife in a stunning operation and plans to prosecute them\n- President Trump says Maduro and his wife have been captured. A news conference will be held at 11 A.M\n- The MAGA/America 1st Memorandum ~~ January 2026 Edition\n- More ...\nFront Page News (News/Activism)\n- 'You exposed him to real danger': Father goes nuclear on school board after teachers sent his son to ICE protest\n- House passes SAVE America Act, sending Trump-backed election bill to the Senate\n- Trump set to gut US climate change policy and environmental regulations: White House official\n- Less than 14% of those arrested by ICE in Trump's 1st year back in office had violent criminal records, document shows\n- Lawler: ‘Not Realistic’ to Kick Out Over 25 Million Undocumented People\n- Fact Sheet: President Donald J. Trump Ensures Affordable Beef for the American Consumer\n- Democrats fear body cameras could be ICE’s new mass surveillance tool\n- Migrant, 70, who told girl, 12, to 'cover her head' before sexually assaulting her on way home from school is spared jail\n- Associated Press Complains That Winter Olympics Teams Are ‘Overwhelmingly White’\n- Appeals court sides with Trump admin with mass detention ruling\n- More ...",
  "word_count": 2589,
  "scraped_at": "2026-02-14T14:16:53.968118"
}