{
  "article_id": "36cbe8b8c467",
  "url": "https://www.webwire.com/ViewPressRel.asp?aId=346333",
  "title": "TNT Sports to Tip Off Inaugural BIG EAST Men & Women Basketball Regular Season Coverage Starting November 12",
  "date": "20251110T184500Z",
  "domain": "webwire.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "TNT Sports to Tip Off Inaugural BIG EAST Mens & Womens Basketball Regular Season Coverage Starting November 12\nWBB: #1 UConn Huskies to Host Loyola Chicago on Wednesday, November 12 at 7:30 p.m. on truTV & HBO Max\nCandace Parker, Renee Montgomery & Lauren Jbara will Lead TNT Sports Womens Basketball Studio Coverage This Season; JB Long, Christy Winters Scott & Autumn Johnson to Contribute Game Coverage\nMBB: Three Games on Friday & Saturday across truTV & HBO Max, Including TNT Sports Regular Season Debut of #5 St. Johns vs. William & Mary\nTNT Sports will tip off its robust slate of BIG EAST mens and womens basketball games this week as the defending womens NCAA champions #1 UConn Huskies led by Sarah Strong and Azzi Fudd look to continue their strong regular season start against the Loyola Chicago Ramblers on Wednesday, November 12 at 7:30 p.m. ET on truTV and HBO Max.\nTNT Sports College Basketball Pregame presented by Vanda Pharmaceuticals will start at 7 p.m., featuring Womens Basketball Hall of Fame Class of 2026 Inductee Candace Parker, two-time WNBA champion and 2009 NCAA champion Renee Montgomery, and versatile sportscaster Lauren Jbara, who collectively will lead TNT Sports womens basketball studio coverage this season.\nJB Long, who also contributes to TNT Sports Big 12 football coverage, will provide play-by-play for the game. He will be joined by basketball analyst Christy Winters-Scott and reporter Autumn Johnson.\nMore: TNT Sports Unveils Inaugural BIG EAST Womens College Basketball Schedule for 2025-26 Season\nLater, on Friday and Saturday, TNT Sports will start up its season-long BIG EAST mens basketball coverage with three games across truTV and HBO Max.\nThe DePaul Blue Demons will take on the Northwestern Wildcats at 8:30 p.m. on Friday, November 14 on truTV and HBO Max. Pregame coverage will begin at 8 p.m. with Bruce Pearl, Jalen Rose, Jamal Mashburn and host Adam Lefkoe. Spero Dedes and Greg Anthony will call the game, with reporting from Lauren Jbara.\nOn Saturday, November 15, the #5 St. Johns Red Storm and star forward Zuby Ejiofor will make their TNT Sports regular season debut as they host the William & Mary Tribe at 6 p.m. Brian Anderson, Grant Hill and Andy Katz will have the call from Carnesecca Arena in Queens, New York.\nLater at 8 p.m., the Villanova Wildcats will welcome the Duquesne Dukes to Finneran Pavilion for a primetime matchup. Brendan Glasheen, Jim Spanarkel and Jared Greenberg will be on the call for the game. Pregame coverage will begin at 5:30 p.m. with Pearl, Rose, Mashburn, and host Tim Doyle, who will contribute regularly to TNT Sports studio coverage this season.\nMore: TNT Sports Sets BIG EAST Mens College Basketball Schedule for Inaugural 2025-26 Season\nThis marks TNT Sports inaugural season of BIG EAST mens and womens college basketball coverage 72 games in all as well as Big 12 mens college basketball coverage. TNT Sports will also serve as the exclusive U.S. distribution partner for the 2025 GEICO Players Era Mens and Womens Championships during Thanksgiving week. The 2025-26 college basketball season will culminate with the 2026 NCAA Mens Basketball Tournament, jointly produced by TNT Sports and CBS Sports.\nBleacher Report will also showcase the most compelling storylines, key moments and top players 24/7 across its digital and social platforms, including House of Highlights, B/R W and B/R Hoops, its basketball-focused vertical. This will include behind-the-scenes content at Hall of Fame Series Las Vegas and Players Era, select BIG EAST and Big 12 games during the season, and other top non-conference events.\nAbout TNT Sports\nTNT Sports is a global leader in the delivery of premium sports content. The TNT Sports U.S. portfolio includes expansive, multi-platform partnerships with Major League Baseball, the NCAA Division I Mens Basketball Championship, National Hockey League, United States Soccer Federation, College Football Playoff games, BIG EAST, Big 12, NASCAR and Roland-Garros. TNT Sports also produces the iconic Inside the NBA studio show. Owned and operated platforms are highlighted by Bleacher Report, the #1 digital destination for young sports fans, along with House of Highlights, B/R W, Golf Digest, and a full suite of digital and social portfolio brands. Additionally, TNT Sports co-manages NCAA.com and NCAA March Madness Live. TNT Sports in Europe and the Republic of Ireland includes partnerships with the Premier League, Emirates FA Cup, UEFA, Premiership Rugby, MotoGP, British and World Superbikes, UFC, Australian Open and Roland-Garros, Grand Tour Cycling, the UCI Mountain Bike World Series, every major winter sports World Championship and World Cup event, and the Olympic Games 2026-2032.\n( Press Release Image: https://photos.webwire.com/prmedia/8/346333/346333-1.jpg )\nWebWireID346333\nThis news content was configured by WebWire editorial staff. Linking is permitted.\nNews Release Distribution and Press Release Distribution Services Provided by WebWire.",
  "word_count": 788,
  "scraped_at": "2026-02-14T14:21:21.325966"
}