{
  "article_id": "36d09c7c5a55",
  "url": "https://theathletic.com/5426892/2024/04/21/players-coming-out-of-retirement/",
  "title": "Kaka , Ronaldinho , Shearer , Xavi ? The players we would like to see come out of retirement",
  "date": "20240421T051500Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The news that Brazilian World Cup winner Romario, now aged 58, is coming out of retirement got The Athletic thinking about which other former players it would be exciting to see return to the game.\nWho could still dictate proceedings? Would certain players be able to adapt to modern football? Which club legends could still do a badly needed job for their old teams?\nAdvertisement\nHere, our writers pick the one individual they would most like to see come out of retirement today — some for emotive reasons, others practical and a few just out of pure interest to see how they would get on.\nRonaldinho\nAge: 44Nationality: Brazilian Position: Attacking midfielder\nCareer: 1998-2015\nRocking a plain white vest and with his hair scrunched up in a bun, Ronaldinho slalomed past a bunch of defenders before rolling the ball into the net. This was not the Camp Nou or the Maracana, but a dusty pitch in Paraguay in March 2020.\nThis was Ronaldinho taking part in a prison futsal tournament after he was detained by local authorities for holding a fake passport. The former Barcelona and Paris Saint-Germain player was 39 at the time but scored six goals as his side won the final 11-2.\nFour years later, it is still tantalising to imagine what the Brazilian could produce on a pitch if he emerged from retirement. Towards the end of his career, when he represented AC Milan before bouncing around different Brazilian clubs, he had lost a bit of speed yet could still produce moments of magic.\nImagine dropping him into a ball-dominant side like Manchester City, where Rodri could do all his dirty work, and watching him fizz passes around before rifling a free kick into the top corner.\nFor now, though, Ronaldinho is content spending his time decked out in Jordan apparel, wearing sunglasses and a Kangol cap while watching his former teams from VIP boxes. Effortlessly cool on the pitch and in retirement.\nJay Harris\nXabi Alonso\nAge: 42Nationality: SpanishPosition: Midfielder\nCareer: 1999-2017\nThe player I would like to see come out of retirement is one who many think could still be playing: Xabi Alonso. Long before he became one of Europe’s most-wanted young managers at Bayer Leverkusen, Alonso was a figure of supreme stability in midfield for Liverpool, Real Madrid, Bayern Munich and Spain.\nGO DEEPER\nXabi Alonso, the coach who said no to Liverpool and Bayern Munich\nThere were few more satisfying sights in football than one of his raking crossfield passes — and there were not many players whose name inspired as much confidence when you saw it in a starting line-up for your team.\nAdvertisement\nLiverpool fans still think back longingly to Alonso’s spell at Anfield from 2004 to 2009, and he later became a cult hero playing in front of the defence for Real Madrid. He left the Bernabeu on his own terms after helping Los Blancos to the previously elusive Decima (their 10th European Cup/Champions League title) in 2014 and retired at the very top with Bayern three years later.\nAnd who can forget that iconic social media post announcing he was hanging up his boots?\nLived it. Loved it.\nFarewell beautiful game. pic.twitter.com/1aSN7GGNzZ\n— Xabi Alonso (@XabiAlonso) March 9, 2017\nIt is no wonder Leverkusen left-back Alex Grimaldo told The Athletic earlier this year that “Xabi is still fit” and could “easily still be playing”.\nGO DEEPER\nAlex Grimaldo exclusive interview: 'I'd have loved to have a coach like Xabi Alonso at 20'\nThe 42-year-old looks virtually unchanged from his playing days and, if he ever gets bored of this management gig, his old sides could surely do with his understated leadership on the pitch.\nTomás Hill López-Menchero\nAlan Shearer\nAge: 53Nationality: English Position: Striker\nCareer: 1988-2006\nFor Newcastle United, it would be Alan Shearer. It is the obvious answer — but it would not be in an obvious role. Rather than at centre-forward, he would be at centre-back.\nThis is not only left field, it borders upon blasphemy from a Newcastle perspective but, to absolve myself of any sort of blame, this was my colleague George Caulkin’s suggestion. He just got his lackey to write it instead, so please direct any understandable anger towards him.\nAnyway, I realise that bringing back the Premier League’s record goalscorer, and the leading marksman in Newcastle’s history, in an alternative position sounds ludicrous, but here is the logic.\nAlexander Isak is an excellent centre-forward, he has 21 goals this season and, at the age of 24, he will be around for years to come. The Sweden international is the ideal striker for Eddie Howe’s 4-3-3 system and he is undoubtedly quicker around the pitch than the now 53-year-old Shearer.\nAdvertisement\nYet, despite the Newcastle legend’s knees and ankles severely hampering his mobility, he could definitely still do a job in the air. Newcastle are lacking centre-backs following the ACL injuries suffered by Sven Botman and Jamaal Lascelles, and Shearer was often the club’s best defender from set pieces in his playing days. He could also still chip in with a hatful of goals from corners and attacking free kicks.\nHe would need athletic players around him, but Shearer’s understanding of where strikers want to be and how they score goals really could help him thwart opposition centre-forwards.\nYou are still not convinced, are you? Well, I tried. Sorry Newcastle fans and sorry Alan. Just to reiterate, it was George’s idea though…\nChris Waugh\nXavi\nAge: 44Nationality: Spanish Position: Midfielder\nCareer: 1997-2019\nIf I could get one former player back in their boots it would be Xavi, who was one of the best midfielders in the world.\nBarcelona’s side in the late 2000s and early 2010s is the best team I have ever seen play, and Xavi was at the heart of it all. He is also the only retired member of that side’s sensational midfield, that also included Sergio Busquets and Andres Iniesta.\nHis vision and quality of passing were sublime and he also had an almost unique ability to scan the pitch and know where all the other 21 players were positioned.\nYet there is an even bigger reason why it would be great to see him playing for Barcelona right now and that is because the club’s existing midfield, managed by Xavi, could only really be fixed by Xavi the player.\nWho knows, his quickfire passing, calmness and control could be the ingredients that the team needs to progress further and get back to winning ways. Also, Lamine Yamal would benefit from his passing and those two linking up is something I would like to see.\nGO DEEPER\nLamine Yamal: Barcelona’s teenage superstar 'who can define an era'\nXavi’s understanding of the game means perhaps only Xavi the player can understand 100 per cent of what Xavi the manager wants.\nLaia Cervelló Herrero\nAdvertisement\nKelly Smith\nAge: 45Nationality: EnglishPosition: Striker\nCareer: 1994-2017\nOne of the greatest privileges as a soccer fan was getting to watch Kelly Smith play three (ish) seasons for the Boston Breakers.\nShe was fresh off of her breathtaking Arsenal years and at the age of 30 was still at the peak of her career. There was a period when she was at Boston where she could have dictated the game without even leaving the centre circle. This was due to her incredible vision and how she understood the rhythm of the game and the players around her.\nSadly, though, her career was plagued by injury — who knows how many goals and assists a fully healthy Smith might have racked up?\nSo, wanting to watch her play again has as much to do with sentiment as it is a desire for her particular brand of soccer: a pure, classic No 10 who mixes technicality with artistry.\nI don’t know how well she would keep up with the pace of the game now but then again, she might be the one dictating it in the first place.\nSteph Yang\nGunter Netzer\nAge: 79Nationality: GermanPosition: Attacking midfielder\nCareer: 1963-1977\nBear with me — let me explain.\nFirst of all, Netzer was more a character from a novella than a footballer. With his long hair, his sports cars and his haughty sense of self, he exuded a belief approaching total. He knew how good he was. If you disagreed, you were wrong.\nNetzer was rebellious and cool. Read about him now and you discover a character who sounds disdainful of anything in the game that is not about invention or beauty. Running without the ball? That was somebody else’s problem.\nAnd the story everyone knows. Of a Real Madrid-bound Netzer being left on the bench for the 1973 German Cup final, then announcing to coach Hennes Weisweiler that he was coming on in extra time, and duly scoring one of the finest goals in the competition’s history a few minutes later.\nAdvertisement\nSo, in the first instance: Netzer as the character — the spectacle. That is what I want to bring back. But the player, too. Have you seen him? Have you found the YouTube highlights and watched how he carries and pirouettes with the ball, how he plays with finesse and, at times, thrusting power?\nOr how, even in the 1970s, he was able to pass with such vision and accuracy, over distances that have been seldom seen since.\nIf so, how could you not want to see him on today’s pitches, with all the advantages of the modern era?\nSebastian Stafford-Bloor\nKaka\nAge: 41Nationality: Brazilian Position: Attacking midfielder\nCareer: 2000-2017\nWith my formative football-watching years being the mid to late 2000s, I got a taste for midfielders who could dribble. Aleksandr Hleb, Samir Nasri and Tomas Rosicky were week-in, week-out examples as an Arsenal fan, while Yoann Gourcuff and Wesley Sneijder were just a couple from the continent.\nThe one player who stands above all others in this regard, however, is Kaka. The elegance and speed he possessed when gliding through defences made it difficult to believe he was 6ft 1in (185cm).\nThe Champions League on ITV during his peak allowed millions in the UK to see just how much of a unicorn he was, particularly in that 2006-07 season when he guided AC Milan to European glory.\nHe could tear through half the length of the pitch, like he did against Celtic, while also having the technical ability and awareness to embarrass defenders as he did in both legs against Manchester United in the semi-finals of that season. He was not as explosive in his Real Madrid days, but he still showed that technical ability when fit.\nKaka may not be an exact fit for today’s high-pressing game, but is the type of player the game dearly misses. A midfielder who could move silkily with the ball under pressure, who also had a ridiculous goal threat off both feet — which he reminded people of recently when he was asked to ‘cut back’.\nArt de Roché\nLeighton Baines\nAge: 39Nationality: English Position: Left-back\nCareer: 2002-2020\nIf there is one thing Everton are crying out for — a takeover resolution, a successful points-deduction appeal and a simple injection of overtly needed cold, hard cash notwithstanding — it is a player with the following attributes: a calm head, an ability to lead by example, creative and intelligent in possession and also capable of chipping in with a goal or two, or three or four. Leighton Baines was all of those things and so much more.\nAdvertisement\nA joy to watch whether the ball was dead or alive — the naughtiest left-back in town was so consistent year in, year out, so graceful with the ball and so understated and selfless in how he went about his business — unless he was leathering a free-kick past Tim Krul at St James’ Park.\nAt one stage, Roberto Martinez tried to mould the 30-time England international into a central midfield player, Philipp Lahm-style. The environment in which the experiment was carried out — a middling, muddled Everton side that was battered and bruised during the 2014 Christmas period — was sub-optimal, to say the least. But an ill-fated spell in the middle of the park doesn’t take away from his legacy at left-back, a position in which he is one of the best to play in the Premier League without question.\nDespite all that, he still provided an assist for Kevin Mirallas away at Newcastle United in his brief stint as a deep-lying playmaker and if he was deployed in this position for a functioning team, you do start to wonder…\nOften a shining light during some of the darker days under David Moyes, most in the current squad couldn’t hold a candle to Baines, who remains at the club as a youth coach.\nHe is only older than Ashley Young — who has made 25 Premier League appearances for Everton this season — by seven months.\nNot an exact science that proves Baines is ripe to lace up his boots for one last dance but it adds to the fleeting thought that maybe, just maybe, he could be the man Everton look to and lean on again.\nRhodri Cannon\nSam Mewis\nAge: 31Nationality: AmericanPosition: Midfielder\nCareer: 2013-2023\nSam Mewis only announced her retirement from soccer earlier this year, before shifting into a media role covering the sport. But to me, the end of her career is one of the biggest what-ifs in USWNT history.\nAdvertisement\nWhile I would need to have the superpower of healing to bring Mewis back to the game — if I had it, she would be the first player I would recall.\nMewis could quarterback and bypass an entire defence with a single pass and was always a threat on set pieces. She also scored one of the best goals I’ve ever seen live: a complete rocket in a NWSL semi-final in Portland.\nGo field level on that @sammymewy 🚀#NCvCHI | #NWSL | #NWSLPlayoffs pic.twitter.com/QcMXHsmWUY\n— National Women’s Soccer League (@NWSL) September 19, 2018\nHer run of form from 2016 to 2020 for club and country, a period which includes the World Cup win in 2019, was truly absurd.\nThinking about what she would add to any NWSL team or this version of the USWNT — not just on the field but as a dedicated and thoughtful leader too — is almost a painful exercise of the imagination.\nMewis is destined for the National Soccer Hall of Fame, but I just wish that honour would have come a little later.\nMeg Linehan\n(Top photos: Getty Images)",
  "word_count": 2430,
  "scraped_at": "2026-02-14T12:52:36.416807"
}