{
  "article_id": "36e3e251248c",
  "url": "https://themiamihurricane.com/2025/10/16/miami-wsoc-aims-to-snap-conference-skid-against-cal/",
  "title": "Gorfin : How Miami WSOC can counteract California to end poor run of form",
  "date": "20251016T164500Z",
  "domain": "themiamihurricane.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Miami women’s soccer remain winless in the ACC following a disappointing 1-0 loss to Syracuse last Saturday. A lack of conviction in front of goal resulted in the Hurricanes failing to score from their 16 shots. Meanwhile, consecutive ball-playing mistakes from Miami resulted in Syracuse finding the net in the 77th minute, a goal which would ultimately decide this close affair.\nYet, the ‘Canes must look onwards and upwards to their next fixture as they face UC Berkeley (4-1-3) this Thursday at Cobb Stadium. Miami is no longer competing to establish itself as a competitive league side. Nevertheless, there would be some valuable consolation in achieving a result against a California side that has some real talent.\nThe Golden Bears possess a very strong spine of experienced seniors, namely goalkeeper No. 1 Teagan Wy, defensive midfielder No. 17 Alex Klos, and center forward No. 19 Lumi Kostmayer.\nWy has been ever-present in the US national system since U14 level and played every minute of the US’s 2024 U20 Women’s World Cup campaign, where they finished third. The same year, she was named to the all-ACC second team, only missing out on the first XI to Cal’s other goalkeeper, Karlie Lema. Furthermore, Wy is coming off consecutive strong performances against No. 1 Virginia and Virginia Tech, having made 15 saves across these two fixtures. As a result, Miami must improve upon their clinicality to find the back of the net versus California.\nKlos is the lynchpin of the Golden Bears’ setup. In her junior year, she played all 21 matches, and this season has only become more important. Cal channel all of its first phase build-up through Klos, who breaks the lines neatly as a single pivot. However, when Klos is pinned by an opposing midfielder, Cal start relying on long balls to progress up the pitch, resulting in 50/50s and second balls for the defending team to capitalize on.\nClemson executed this strategy relatively well against California, helping them to punch above their weight for a 2-2 draw against the Golden Bears. Miami could replicate this move by instructing its 10, Teegan Melenhorst, to mark Klos out-of-possession. While Melenhorst would still be a primary offensive outlet, having her adopt this role would not be too much of an ask, and would maintain her position high up the pitch for when Miami break.\nStanford transfer, Kostmayer, occupies a very transitional No. 9 role. Her hold-up-play and physicality helps give Cal an outlet up top, which in turn allows Kostmayer to play in her wingers, Elhom Khursand and Soleil Dimry, or play on her own. Her clinicality tops off these build-up qualities, as Kostmayer has found the net five times so far this season. Head coach Ken Masuhr and Miami could counteract this threat by having centre-half Emilie Simpson mark Kostmayer, with Sam Marella picking up flick-ons or loose touches from California’s No. 19.\nCalifornia’s numerous strengths illustrate that the best chance Miami have of scraping a result will be through counteracting and minimising the opposition’s qualities. This philosophy translates to the Hurricanes’ potential formation. California’s head coach, Neil McGuire, utilizes a 4-3-3 with a single pivot and two 8s. Miami deploying a 4-2-3-1 would positionally match California out-of-possession and help achieve the aim of limiting Klos.\nThis 4-2-3-1 would potentially look like:\nDefense – No. 0 Bredek, No. 14 Maxwell, No. 4 Marella, No. 2 Simpson, No. 25 Kaye\nMidfield – No. 13 Nicholson, No. 8 Alarcon, No. 12 Melenhorst\nAttack – No. 15 Serlenga, No. 22 Severns, #7 Hood\nCrosby Nicholson and Ciara Alarcon, who would make up this hypothetical double pivot, combined for seven shots from midfield last game, further demonstrating that Miami’s most prominent threat comes from the middle of the park.\nYet, by focusing on limiting California’s strengths, Miami can help raise their floor defensively, platforming themselves for potential success this Thursday at 7 p.m.",
  "word_count": 648,
  "scraped_at": "2026-02-14T12:21:02.388474"
}