{
  "article_id": "3704643bd89a",
  "url": "https://menafn.com/1109115003/United-Airlines-Achieves-Record-Fourth-Quarter-Profit-Well-Ahead-Of-Expectations-Reiterates-Path-To-Double-Digit-Pre-Tax-Margin",
  "title": "United Airlines Achieves Record Fourth Quarter Profit Well Ahead Of Expectations Reiterates Path To Double - Digit Pre - Tax Margin",
  "date": "20250122T000000Z",
  "domain": "menafn.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "United Airlines Achieves Record Fourth Quarter Profit Well Ahead Of Expectations Reiterates Path To Double-Digit Pre-Tax Margin\nUNITED AIRLINES HOLDINGS, INC.\n1 NON-GAAP FINANCIAL INFORMATION\nUAL evaluates its financial performance utilizing various accounting principles generally accepted in the United States of America (GAAP) and non-GAAP financial measures, including adjusted earnings before interest, taxes, depreciation and amortization (adjusted EBITDA), adjusted EBITDA margin, adjusted EBITDA excluding aircraft rent (adjusted EBITDAR), adjusted operating expenses, adjusted operating income (loss), adjusted operating margin, adjusted pre-tax income (loss), adjusted pre-tax margin, adjusted net income (loss), adjusted diluted earnings (loss) per share, CASM-ex, adjusted capital expenditures, adjusted total debt, adjusted net debt, net leverage, free cash flow, and free cash flow, net of financings, among others. The non-GAAP financial measures are provided as supplemental information to the financial measures presented in this press release that are calculated and presented in accordance with GAAP and are presented because management believes that they supplement or enhance management's, analysts' and investors' overall understanding of the company's underlying financial performance and trends and facilitate comparisons among current, past and future periods.\nBecause the non-GAAP financial measures are not calculated in accordance with GAAP, they should not be considered superior to and are not intended to be considered in isolation or as a substitute for the related GAAP financial measures presented in the press release and may not be the same as or comparable to similarly titled measures presented by other companies due to possible differences in method and in the items being adjusted. We encourage investors to review our financial statements and publicly-filed reports in their entirety and not to rely on any single financial measure.\nThe company does not provide a reconciliation of forward-looking measures where the company believes such a reconciliation would imply a degree of precision and certainty that could be confusing to investors and is unable to reasonably predict certain items contained in the GAAP measures without unreasonable efforts. This is due to the inherent difficulty of forecasting the timing or amount of various items that have not yet occurred and are out of the company's control or cannot be reasonably predicted. For the same reasons, the company is unable to address the probable significance of the unavailable information. Forward-looking non-GAAP financial measures provided without the most directly comparable GAAP financial measures may vary materially from the corresponding GAAP financial measures. See \"Cautionary Statement Regarding Forward-Looking Statements\" above. The information below provides an explanation of certain adjustments reflected in the non-GAAP financial measures and shows a reconciliation of non-GAAP financial measures reported in this press release to the most directly comparable GAAP financial measures. Within the financial tables presented, certain columns and rows may not add due to the use of rounded numbers. Percentages, ratios and earnings per share amounts presented are calculated from the underlying amounts.\nCASM: CASM is a common metric used in the airline industry to measure an airline's cost structure and efficiency. UAL reports CASM excluding special charges, third-party business expenses, fuel expense, and profit sharing. UAL believes that adjusting for special charges is useful to investors because those items are not indicative of UAL's ongoing performance. UAL also believes that excluding third-party business expenses, such as maintenance, flight academy, ground handling and catering services for third parties, provides more meaningful disclosure because these expenses are not directly related to UAL's core business. UAL also believes that excluding fuel expense from certain measures is useful to investors because it provides an additional measure of management's performance excluding the effects of a significant cost item over which management has limited influence. UAL excludes profit sharing because it believes that this exclusion allows investors to better understand and analyze UAL's operating cost performance and provides a more meaningful comparison of our core operating costs to the airline industry.\nAdjusted EBITDA and EBITDAR: UAL also reports EBITDA and EBITDAR excluding special charges, nonoperating unrealized (gains) losses on investments, net and nonoperating debt extinguishment and modification fees. UAL believes that adjusting for these items is useful to investors because they are not indicative of UAL's ongoing performance.\nAdjusted Capital Expenditures and Free Cash Flow: UAL believes that adjusting capital expenditures for assets acquired through the issuance of debt, finance leases and other financial liabilities is useful to investors in order to appropriately reflect the total amounts spent on capital expenditures. UAL also believes that adjusting net cash provided by (used in) operating activities for capital expenditures, net of flight equipment purchase deposit returns and adjusted capital expenditures is useful to allow investors to evaluate the company's ability to generate cash that is available for debt service or general corporate initiatives.\nAdjusted Total Debt and Adjusted Net Debt: Adjusted total debt is a non-GAAP financial measure that includes current and long-term debt, finance lease obligations and other financial liabilities, current and noncurrent operating lease obligations and noncurrent pension and postretirement obligations. Adjusted net debt is adjusted total debt minus cash, cash equivalents and short-term investments. UAL provides adjusted total debt and adjusted net debt because we believe these measures provide useful supplemental information for assessing the company's debt and debt-like obligation profile.\nNet Leverage: Net leverage is a non-GAAP financial measure that is equal to adjusted net debt divided by trailing twelve month adjusted EBITDAR. UAL provides net leverage because we believe it provides useful supplemental information for assessing the company's debt level.\nOperating and nonoperating special charges and unrealized (gains) losses on investments included the following:\nDuring 2024, in addition to gains and losses on sales of assets, other operating special charges included $66 million of non-recurring employee benefit-related charges as well as $32 million of accelerated depreciation on assets with shortened useful lives.\nDuring 2023, the company recorded $814 million of expense associated with the agreements with its employees represented by Air Line Pilots Association, International Association of Machinists and Aerospace Workers and other labor unions.\nDuring 2024, the company recorded $128 million of charges related to the prepayment in full of the outstanding principal balance of the term loan facility of the MileagePlus financing agreements in July 2024, the refinancing of its 2021 term loans in February 2024 and a partial prepayment of the 2024 term loan.\nEffective tax rate:\nThe company's effective tax rates were as follows:\nThe provision for income taxes is based on the estimated annual effective tax rate, which represents a blend of federal, state and foreign taxes and includes the impact of certain nondeductible items.\nSOURCE United Airlines\nWANT YOUR COMPANY'S NEWS FEATURED ON PRNEWSWIRE? 440k+Newsrooms &\nInfluencers 9k+\nDigital Media\nOutlets 270k+\nJournalists\nOpted In GET STARTED\nLegal Disclaimer:\nMENAFN provides the\ninformation “as is” without warranty of any kind. We do not accept\nany responsibility or liability for the accuracy, content, images,\nvideos, licenses, completeness, legality, or reliability of the information\ncontained in this article. If you have any complaints or copyright\nissues related to this article, kindly contact the provider above.",
  "word_count": 1154,
  "scraped_at": "2026-02-14T14:16:17.151170"
}