{
  "article_id": "3723ea5fdcc9",
  "url": "https://www.thenationalnews.com/news/mena/2025/09/18/israel-escalates-gaza-city-offensive-before-un-vote-on-ceasefire-resolution/",
  "title": "Israel hits Gaza city with air strikes and robot bombs before UN vote on ceasefire resolution",
  "date": "20250918T121500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Israel endured a day of setbacks in its Middle East wars on Thursday with four troops killed in Gaza, two Israeli military personnel stabbed to death near Jordan and a city hit by a Houthi drone.\nAs Israeli troops intensified their assault on Gaza city, killing at least two dozen more Palestinians, Hamas warned it would “not care about the lives” of Israeli hostages. “This criminal operation means that you will not get a single prisoner, neither dead nor alive,” said the group's armed wing.\nThe Israeli army said four troops were killed in what reports said was a roadside bomb attack in the south of Gaza. One cadet was injured.\nOfficial Palestinian media meanwhile said 20 victims were brought to Gaza city's Al Shifa hospital after being killed in Israeli attacks. It reported four deaths in Al Bureij refugee camp when Israeli aircraft bombed a house.\nInternet and phone lines were down across Gaza, in a sign that Israel's ground operations could escalate further. Israel this week began its main push to capture Gaza city after weeks of destructive bombing, saying on Thursday that troops were “expanding their operations” in the area.\nAs tensions flare, two Israelis were killed in an attack at an Israeli-run border crossing between the occupied West Bank and Jordan on Thursday, officials said. Israel said the attacker was a Jordanian aid lorry driver.\nIsrael's army called the Allenby Bridge incident a terrorist attack and said it had advised the government to block aid at the crossing in response. Jordan's Foreign Ministry condemned the attack, which it described as “harming the interests of the kingdom” and its ability to deliver aid.\nIsrael's police meanwhile reported a drone crash in the southern city of Eilat, after the army reported a “hostile aircraft infiltration”, apparently from Yemen. The country's Houthi rebels regularly fire missiles at Israel in solidarity with the Palestinian cause, but impacts are relatively rare.\nIsrael's advance in pursuit of Hamas operatives comes days before the UN General Assembly meets in New York, with France and Saudi Arabia leading a push to recognise Palestinian statehood – an idea the US and Israel reject.\nThe UN Security Council was on Thursday considering a new resolution calling for a ceasefire in Gaza, drawn up after the UN declared a famine. The US habitually vetoes such motions but other members have been increasingly vocal in their frustration over the suffering in Gaza.\nIsrael's attacks on neighbouring countries have triggered concern around the region. Lebanon's Prime Minister Nawaf Salam called for “maximum” pressure on Israel to stop its attacks after it announced new strikes on the country's south.\n“Lebanon calls on the international community, and particularly the countries that sponsored the ceasefire agreement, to exert maximum pressure on Israel to immediately halt its attacks,” Mr Salam said during a cabinet meeting.\nWafa reported more violence in Gaza on Thursday morning, saying Israeli troops destroyed residential buildings south and north of Gaza city, forcing people to flee. Israel is believed to have detonated booby-trapped robots to destroy Gaza city neighbourhoods.\nThe army operation has also disrupted internet services, Wafa quoted Gaza's telecoms authority as saying.\nThe World Health Organisation warned that hospitals in northern Gaza were on the “brink of collapse” as the escalating violence prevented it from delivering life-saving supplies. WHO chief Dr Tedros Adhanom Ghebreyesus demanded an “end to these inhumane conditions” in a post on X.\nIsrael says Gaza city is a major Hamas stronghold housing between 2,000 and 3,000 fighters, with the military operation aiming to neutralise the group's central command.\nBut it has widened its pursuit of the group far beyond Gaza, last week bombing a building in the Qatari capital where Hamas leaders were meeting, killing six.\nFor the first time since the Doha strike, one of the Hamas figures attacked appeared in public on Wednesday, taking part in a live interview broadcast by Qatari channel Al Jazeera.\nGhazi Hamad, a top official in Hamas, said the attack occurred “less than an hour after we began studying the proposal” for a ceasefire.\n“The rockets came down consecutively, without a pause, around 12 missiles in less than a minute,” he added.\nInternational pressure on Israel over its conduct in the Gaza war has been growing. On Wednesday a UN investigator who this week accused Israel of committing genocide said she sees parallels with the butchery in Rwanda in the 1990s.\nNavi Pillay, a South African former judge who headed the international tribunal for the Rwanda genocide, said she hopes one day Israeli leaders will be put behind bars.\n“I consider it not impossible that there will be arrests and trials” in the future, she told news agency AFP.\nHer Independent International Commission of Inquiry, which does not officially speak on behalf of the UN, issued a bombshell report on Tuesday concluding that “genocide is occurring in Gaza”, an accusation Israel vehemently denies.\nIt also accused Israeli Prime Minister Benjamin Netanyahu and other senior officials of incitement to the cause.\nIsrael categorically rejected the findings and slammed the report as “distorted and false”.\nEuropean countries have been increasingly critical of Israel's actions and a number have said they plan to recognise a Palestinian state this month, defying Israeli opposition.",
  "word_count": 873,
  "scraped_at": "2026-02-14T12:12:08.829904"
}