{
  "article_id": "372b87e05440",
  "url": "https://www.justarsenal.com/how-arsenal-women-can-beat-man-city-if-eidevall-makes-some-tough-decisions-on-starting-xi/376307",
  "title": "How Arsenal Women can beat Man City , if Eidevall makes some tough decisions on starting XI .. ",
  "date": "20240920T151500Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The mood is pretty low among Arsenal Women fans at the moment, after being narrowly defeated by BK Hacken in Sweden mid-week, in the 1st leg of the UWCL round 2 qualifiers. It all does feel a bit doom and gloomy, but hopefully the players aren’t feeling so down and can find a way to bounce back this weekend, as we get set to play our opening game of the Women’s Super League on Sunday. Arsenal’s opposition doesn’t get much easier as we look to face off against long-time WSL title rivals Manchester City Women.\nCity came up against some well-known opponents in Paris FC mid-week, and thrashed them 5-0 after a dominant performance from the blues saw them win in Paris, and go back to Manchester with a comfortable cushion for the second leg of the UWCL. Vivianne Miedema was among the names on the scoresheet, scoring on her debut with City, will no doubt be eager to put a few goals past her old teammates this weekend.\nWith momentum being such a big thing in football, we go into this game with a lot to do. City have had a great start to their season and had a very solid pre-season too. They’ve always been one of the teams to beat and last season showed how close they came to lifting the WSL trophy, and just how dangerous they can be City finished 2nd to Champions Chelsea on goal-difference only..\nWe played City three times last season, beating them in both WSL games, home and away, but came up short in the Women’s FA Cup, with City knocking us out of the competition in the round of 5.\nStina Blackstenius scored both goals in our 2-1 win at Academy Stadium in Manchester, and she scored the late winner in our 2-1 win at Meadow Park – seems to love to score against the Blues! Blackstenius is currently nursing an injury, but it does leave me to wonder if Jonas Eidevall will find a way to implement her into the squad.\nEidevall has a lot of quality in his squad and, although we’ve had somewhat of a good start to the season, he is going to have to try and figure out how all these players fit together. We want quality in depth, and we have that, but it does feel like we were playing with a lot more fluidity in pre-season, and at the start of UWCL qualifications, and I do wonder if that’s because of how we were set up.\nEidevall made some changes against BK Hacken and I’m not sure if they were the right changes to make, when we had a side who were playing well together and looked ready and fit. Even a change or two can disrupt the system and I think that’s why we didn’t look as solid against BK Hacken.\nWill Eidevall go back to what seemed to be working? I don’t know. That would mean having to miss out some pretty big names who have delivered when we’ve needed them to, but big decisions have to be made at big football clubs and we will have to wait and see.\nIs Beth Mead really at her best at the moment, after returning from injury? The same could be asked of Lotte Wubben-Moy, who missed all of pre-season through injury?\nWhat happened to Katie McCabe? She was caught napping, allowing BK Hacken to get that much coveted UWCL goal against us, wasn’t she?\nHow about Eidevall gives Daphne van Domselaar her debut, instead of playing Zinsberger?\nWhat’re your thoughts Gooners?\nDaisy Mae\nFollow JustArsenal’s Gooner Women on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 632,
  "scraped_at": "2026-02-14T12:22:53.066663"
}