{
  "article_id": "3742a7c76c43",
  "url": "https://www.boredpanda.com/luis-rubiales-kissing-player/?cexp_id=117999&cexp_var=12&_f=homepage_featured",
  "title": "Former Football Head Luis Rubiales Fined €10 , 000 For Non - Consensually Kissing Player Jenni Hermoso",
  "date": "20250221T141500Z",
  "domain": "boredpanda.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Jenni Hermoso Gets Justice After Ex-Coach Luis Rubiales Found Guilty Of Impermissibly Kissing Her\nThe battle for women’s equality is the oldest one in history as it has been going on for ages and women are still struggling. It’s quite horrifying to think that men in power can still easily maim one of the happiest days in a woman’s life and brush it off as a “spontaneous” thing.\nFormer coach and football player Luis Rubiales stirred up the whole nation when he impermissibly kissed Spanish forward Jenni Hermoso while celebrating Spain’s victory over England in 2023. However, after 550 days, justice was finally served as the Spanish High Court found him guilty and hit him with a fine of over €10,000!\nSpain had just won the FIFA Women’s 2023 World Cup against England when the team’s coach Luis Rubiales kissed Jenni Hermoso after the victory\nImage credits: IMAGO / Sports Press Photo\nFor those who are unaware, Jenni Hermoso is a Spanish football player who has played for some of the most legendary football clubs in Europe like Barcelona, Atletico Madrid, and Paris Saint Germain. Currently, she plays as a forward for the Liga MX Femenil club Tigres UANL and the Spanish national team.\nShe also holds the record for the most Pichichi trophies in women’s football history and is also the all-time top scorer for Spain with 57 goals. In the 2023 FIFA Women’s World Cup, she was awarded the Silver Ball, which acknowledged her as the second-best player of the cup. Sadly, it was this very World Cup that turned out to be quite dark for Jenni.\nThe incident sparked outrage, Rubiales was suspended by FIFA and Hermoso made a criminal complaint against him\nImage credits: ZUMAPRESS.com / Scanpix\nSpain earned a phenomenal victory over England in the World Cup and the whole team was jubilant with their glory. The team’s coach at the time was Luis Rubiales, former footballer and Royal Spanish Football Federation president and also one of UEFA’s vice presidents. When the players were being awarded the medals, he initially hugged Hermoso and then grabbed her face in his hands and kissed her.\nThis action sparked outrage throughout the Spanish nation and slowly all over the world as female players began opening up about what they have experienced in sports. Protests began in Spain, where the phrase “se acabo” (meaning: it’s over) echoed through the Spanish streets and many players spoke in support of Jenni while condemning Rubiales.\nImage credits: Jeffrey F Lin / Unsplash (not the actual photo)\nAfter 550 days, the Spanish High Court declared Rubiales guilty of impermissibly kissing Hermoso and fined him over €10,000\nFIFA suspended Rubiales and he was also made to resign as a coach as all the players of the team refused to play if he remained in charge. When the trials began, Rubiales told the court that he was absolutely sure that she gave him her permission and in that moment it was something completely spontaneous.\nOn the other hand, Hermoso, on her first day of trial, told the court, “I knew I was being kissed by my boss and that should not happen in any social or work environment. I think it was a moment that tainted one of the happiest days of my life.”\nRubiales refused to budge from his statement while he was also accused of trying to coerce her into admitting that it was a consensual act. However, the judge found him guilty, stating that, “This action of kissing a woman on the lips has a clear lustful connotation and is not the way people greet those with whom they are not in an emotional relationship.”\nImage credits: Mario Klassen / Unsplash (not the actual photo)\nThe Spanish High Court found him guilty and hit him with a fine of over €10,000, but he was cleared of the coercion charges. Rubiales mentioned that he was going to appeal against the verdict. After the verdict, Irene Paredes, the Spanish captain who stood in support of Hermoso, gave a statement: “What I find somehow striking and strange is that there is no conviction for coercion.”\nSpanish football journalist Guillem Balague commented, “Such a conviction seemed unimaginable until four or five years ago. For that, we must thank Jenni and her teammates, who got the biggest sporting moment of their careers stolen from them. Something good came out of that sad moment.”\nImage credits: Campaign Creators / Unsplash (not the actual photo)\nNetizens were divided by the turn of events that followed. While some backed the player for taking a stand against such a powerful man, others said that it was all pointless as these things were apparent in sports. What are your opinions about it? We would love to hear your thoughts in the comments!\nFolks online were divided after the verdict as some sided with Rubiales, others with Hermoso\nImage credits: www.facebook.com\nImage credits: www.facebook.com\nImage credits: www.facebook.com\nImage credits: www.facebook.com\nImage credits: www.facebook.com\nImage credits: www.facebook.com\nImage credits: www.facebook.com\nImage credits: www.facebook.com\nImage credits: www.facebook.com\nImage credits: www.facebook.com\nImage credits: www.facebook.com\nImage credits: www.facebook.com\nImage credits: www.facebook.com\nImage credits: www.facebook.com\nImage credits: www.facebook.com\nImage credits: www.facebook.com\nImage credits: www.facebook.com\nPeople react as if they know the whole story. I hope this closes the chapter and that they can both move on.\nPeople react as if they know the whole story. I hope this closes the chapter and that they can both move on.",
  "word_count": 910,
  "scraped_at": "2026-02-14T12:53:11.387590"
}