{
  "article_id": "37482c8c5900",
  "url": "https://www.90min.com/posts/why-man-utd-had-to-keep-alessia-russo-despite-world-record-arsenal-bids",
  "title": "Why Man Utd had to keep Alessia Russo despite world record Arsenal bids",
  "date": "20230201T101500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Why Man Utd had to keep Alessia Russo despite world record Arsenal bids\nManchester United’s hopes of finishing in the WSL top three this season and qualifying for the Champions League for the first time may have just hinged on Alessia Russo staying at the club.\nUnited, currently top of the WSL on goal difference ahead of Chelsea, were met with a world record offer for Russo from Arsenal the day before the transfer deadline.\nIt was rejected, but the Gunners came back on deadline day itself with an even bigger offer reaching a cool half million and far surpassing what Barcelona paid Manchester City for Keira Walsh.\nAdamant they wouldn’t sell, United stood their ground and ended the negotiations, backing up what manager Marc Skinner had previously said about Russo amid Lyon interest earlier in the season: “I can make sure that the fans know we’re definitely not a selling club.”\nPlenty questioned why. Russo is out of contract at the end of the season and could still leave as a free agent in the summer. Why, people asked, turn down a huge sum to potentially reinvest in the team when losing her for nothing is a possibility?\nIt is clear that United are backing themselves to succeed in the short-term that also then paves the way for more sustained longer-term success in the future.\nFrom Arsenal’s perspective, getting a striker through the door for the second half of the season was important enough to throw money at a Russo bid. They had previously been interested back in 2020, when she was coming out of the US college system and wound up choosing United.\nThe need was obvious. The Gunners have lost both Beth Mead and Vivianne Miedema to long-term injuries within the last two and a half months. Although neither was playing as a ‘number nine’ at the time they fell victim to the dreaded ACL, their loss has put a real strain on where goals might come from looking ahead. Arsenal could yet wait to potentially offer Russo a contract if her deal at United winds all the way down. But their need for reinforcement was immediate, as Jonas Eidevall had expressed throughout the window.\nEven with the possibility of free agency looming and no transfer fee coming in, United still stood to lose a lot more in both the short and long-term had they cashed in now.\nAfter a couple of near misses, getting into next season’s Champions League is crucial for United. It is the natural environment for a club of their size, but it will also raise the profile of the women’s setup, bring in substantially more revenue, open doors to potential new players and give an extra reason to persuade existing stars – the like of Russo, Ona Batlle and Mary Earps – to stay.\nSelling Russo to Arsenal, even for a world record fee, would have directly strengthened a major rival in that pursuit. Similarly, it would have severely weakened United in an area of the pitch they are not flush with depth in, doubling the blow – Russo has scored a team-high five WSL goals this season.\nTo let it happen would have been a poor look and serious question of the club’s ambition.\nThere was also the timing of the bid that had major implications. Had United accepted either of Arsenal’s offers for Russo, there was minimal opportunity to spend it – literal hours – and suitably replace a vitally important players with someone as good or better before the deadline. In that scenario, a panic buy or worse, securing no replacement at all, could have been disastrous.\nIt might have been different in a summer transfer window or at the very start of January because of the time to reinvest. But it didn’t happen that way and so is fairly irrelevant.\nIn similar circumstances in September, United could afford to sell Jackie Groenen when a late offer from Paris Saint-Germain came in. Groenen was not as important to the team as Russo is and operated in an area of the pitch with significantly more depth. The money, confirmed by FIFA recently as the fifth largest international transfer fee in women’s football in 2022, was too good to turn down for a player of her status. Although the late PSG offer was unexpected, it ‘matched what the club would take for Jackie but also it ends up being a good deal for all’, in Skinner’s words.\nClearly, United place far greater value on Russo. Arsenal, even at £500,000, didn’t reach it.\nFor Russo, having gambled on herself and rejected a new contract shortly before her value skyrocketed at Euro 2022, there is no rush to lock in her future. At 23, she is still in the early stages of her senior career and will have the opportunity to weigh up her options in summer, although United have remained in talks over a new contract.\nGetting into the Champions League will give United the strongest chance of keeping her with a fresh deal and if they are successful in making it to Europe, she will have played a huge part.\nFor more from Jamie Spencer, follow him on Twitter!",
  "word_count": 868,
  "scraped_at": "2026-02-14T12:21:31.804525"
}