{
  "article_id": "375c90e5a051",
  "url": "https://english.news.cn/20240529/b190cee5bb8940a2bece903c7ce8289f/c.html",
  "title": "Intl students in China realize their dreams in China  Village Super League - Xinhua",
  "date": "20240529T110000Z",
  "domain": "english.news.cn",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "GUIYANG, May 29 (Xinhua) -- On a hot night at the \"Village Super League\" (VSL) in Rongjiang County, southwest China's Guizhou Province, the high temperatures didn't dampen the enthusiasm of football fans.\nThe stands were packed, and eager fans surrounded the green field.\nOn Monday evening, international football superstar Kaka attended the VSL in Rongjiang County for the \"Chasing Dream\" Champions Charity Game 2024 and met with Rongjiang's \"Chasing Dream\" youth women's football team.\nArafa Alzabidi, an international student from Yemen studying at Guizhou University, marveled at the grand occasion of the VSL.\n\"This time, the atmosphere of the VSL is very good, and there are loads of people,\" he said. Arafa, who has represented his university in the VSL many times, is a long-time fan of Kaka. He and his friends traveled from Guiyang to Rongjiang by high-speed train to see his football idol in action.\nWhen Kaka appeared on the field, Arafa, like many other fans, was ecstatic. \"I never thought that one day I would see him with my own eyes at the VSL in Guizhou. In my heart, Kaka's skills are particularly excellent,\" he said.\nKaka's performance in the VSL arena drew significant attention. Fans who couldn't find seats in the stands sat on the ground in front of the big screen, their eyes fixed on every moment of the game. After scoring a goal, Kaka's celebratory gesture of pointing his hands to the sky elicited cheers of \"My youth is back\" from the crowd.\nBandese Christopher, a Ugandan student from Guizhou Normal University, was thrilled to attend the VSL for the first time. A lifelong fan of Kaka, Bandese has played football since he was four years old and has never missed a game featuring his idol. Inspired by Kaka, he continues to play football at 25.\n\"When I heard that Kaka was coming to Rongjiang, I decided to come immediately. Rongjiang is rich in local ethnic minority culture, and the football atmosphere is very strong here. Local people love football very much, just like in my country, so I feel very familiar with it,\" Bandese said. \"In Uganda, football is also a mass sport. Everyone can make friends through football, and it is very popular.\"\n\"Recently, the game of Guizhou's VSL has also been 'exported' to Africa. I saw videos of the African VSL, which is developing very fast,\" Bandese added. \"I wish more football stars would come to the VSL to play, and I hope the VSL continues to grow.\"\nMarco Segatto, an international student from Milan, Italy, arrived in Guizhou in March this year. He and his friends wore shirts printed with \"Guizhou's VSL\" and stood on the sidelines to watch the game, applauding and cheering for Kaka's every goal.\n\"Kaka used to play for AC Milan, which is close to my home. When I was a child, my classmates and I often wore his jerseys to watch games. I came to the 'Cunchao' today because of him,\" Marco said. As he analyzed the game with his friends, he used his mobile phone to capture the action on the field.\n\"Kaka performed very well in this game, attracting more attention to the development of Rongjiang's youth football training. I hope that more football stars like Kaka will join Rongjiang's VSL in the future, coming here to exchange ideas and enjoy the atmosphere of Chinese grassroots football,\" Arafa said. ■",
  "word_count": 567,
  "scraped_at": "2026-02-14T12:41:42.712111"
}