{
  "article_id": "376747460567",
  "url": "https://www.cornnation.com/2023/10/28/23934398/week-10-predictions-huskers-vs-boilermakers",
  "title": "Week 10 Predictions : Huskers vs . Boilermakers",
  "date": "20231028T171500Z",
  "domain": "cornnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Mike: It’s starting to look a lot like Big Ten football season...\nWeek 10 Predictions: Huskers vs. Boilermakers\nNate M: The hope is where you are scared to look.\nAndy: Should have a picture of cold, pristine Field Turf. It ain’t gawn snow. But it is gonna be mid-high 30’s and pretty windy. Darn fine day to run the damn ball and kick the tires on these new O-linemen.\nJackson: Seems like the season goes so fast, I can’t believe we’re already in week 9! Looking forward to some gritty tough winter football this weekend!!\nJarek: Well it seems like B1G football weather has arrived...just in time for Nebraska to keep the run game going.\nOregon (-6.5) at Utah\nNate M: We need hope. Or else we cannot endure.\nUtah wins by a touchdown.\nAndy: The smooth machine vs. the blunt instrument. Utah is without starting QB Cam Rising for the rest of the season and that’s a problem with Bo Nix under center for Oregon giving the Ducks a big plus in that area. Also, Oregon’s D is light years better than USC’s. The Utes always scrap and their crowd will be into it - but they probably wish it was a night game. Oregon 43 Utah 34\nJackson: As I attend the University of Oregon there’s no doubt in my mind Oregon wins this contest as well as the next 100. Sco Ducks. Bo for Heisman. Ducks by a million.\nGood guys: 34 Utes: 24\nJon: I would have thought Oregon would be favored by more. Utah is tough, but not nearly as explosive. Oregon 42 Utah 31\nMike: Utah is solid...but not Oregon level yet. Ducks 45, Utes 33\nJarek: Oregon will be in an absolute fight in this game, as this will probably be their toughest game. Yes I know they played Washington, but Utah is always a different breed. That said, I think Oregon squeaks by. Oregon 37 Utah 34\nMichigan State (+7.5) at Minnesota\nNate M: Hope is the ability to see the light despite all of the darkness.\nMinnesota gets another trophy for weirdo to sleep with.\nAndy: After their opening scrub games, the Spartans have basically been playing football like that Andy guy on Ellen goes through haunted houses this time of year: using women as human shields, yelling “STOP IT!!” at other teams and pressing face-up against walls with their asses stuck out. Even Minnesota can take that down. Minnesota 25 Sparty 17\nJackson: This will be yet another intriguing matchup for husker fans to keep an eye on. We should get a true comparison against a team we know their level. Minnesota has got a real good chance contenting for the west with a victory here with tiebreakers over Iowa and Nebraska. Minnesota 20 Michigan St 10\nMike: Sparty continues to spiral the drain... Goofers 24, Sparty 13\nJon: I can see a lot of Gopher fans calling for PJ Fleck’s head on a plate if Minnesota loses this game. I would be shocked if that happened, but the Gophers lost to Northwester. Still... Minnesota 27, Michigan State 17\nJarek: Minnesota shouldn’t have many issues here, but if Nebraska fans want that B1G West title Minny is going to need to start losing games soon. Unfortunately, that’s not this week. Minnesota 21 Michigan State 14\nMaryland (-14.5) at Northwestern\nNate M: Remember: hope is a good thing, maybe the best of things, and no good thing ever dies\nOne to watch. Northwestern covers.\nAndy: So far, my prediction that Maryland might be for real is starting to crash and burn after following an Ohio St loss (not unexpected and competitive) with an Illinois loss (ouch) which leans towards Maryland’s factory default setting of 1-2 wins over the 2nd half of the season. As for Northwestern, they’re scrappy. Or as The Dude spaketh - “Those creeps can roll, man.” Turtles 27 Naked Purge Mask Guys 22\nJackson: Both these teams come into this game as over and underrated in my eyes. The interesting matchup will be the Maryland offense against a top 45 northwestern defense. However, cats don’t have the offensive production to keep up with the turps. Gimmie Turps 28, Northwestern 13\nJon: Maryland fades. Northwestern is a scrappy, rock-fighting bunch of nerds. I’d take the faders. Maryland 24, Nerds 17\nMike: Maryland has had two weeks to chew on that hairball they coughed up against Illinois. So now they get to take those frustrations out on the nerds. It won’t be pretty. Turtles 35, NW 10\nJarek: Well Testudo laid an egg against the Illini and it definitely raised some eyebrows. The problem for Illinois is I don’t see them pulling off another upset. This one should be fairly straightforward. Maryland 31 Illinois 14\nOhio State (-14.5) at Wisconsin\nNate M: Keep a little fire burning; however small, however hidden\nOhio State takes it’s Michigan frustration out on Wisconsin and wins by 25.\nAndy: Ohio State is humming and the ugly Penn State win is not a black mark. It’s just Chapter 2 of Lou Holtzth having eat the latest in a lifetime of stupid comments. Wisconsin’s offense, on the other hand, has entered the Iowa/Nebraska/Minnesota zone. Inviting the Ohio State defense over for a play date will not be pretty. Bucknuts 31 Wiscy 10\nJon: I was impressed with what Ohio State did to Penn State. Maybe that’s wrong, because they do the same thing every year; crush other team’s hope into the ground just when it looks like they might challenge the Buckeyes. This one will be painful for the Badgers. Ohio State 48, Wisconsin 17\nMike: I think NBC was hoping for a better game that I think we’ll see. Bucknuts 38, Stinkin’ Bahdgers 13\nJackson: This could very well be a preview of the big ten championship game, and if that’s the case it won’t be close. The east is too good this year for the west teams to be remotely competitive. Ohio st 45 Wisco 14\nJarek: So no one is giving Wisconsin any hope against Ohio State?...Good, me neither. Ohio State 41 Wisconsin 17\nPurdue (+2.5) at Nebraska\nNate M: The question I have coming into the game is when will the injuries really start to rear their head? The losses on the offensive line really make me nervous is this game. Especially with how much Purdue blitzes.\nIf Nebraska wins, I think it’ll be 20-7 type of game. If they lose, I think it’ll be 10-3. I expect the defense to play well enough but I’m nervous that the injuries on offense really start to show up and it doesn’t go well.\nPurdue 10 - Nebraska 6.\nAndy: Predicting this game is basically writing a low scoring prediction on every card in the deck and throwing all the cards in the air. When Purdue has the ball, I don’t expect them to do much and a cold weather game will give the defense a little more stamina if the offense can’t always give them rest. I do not expect Purdue to score beyond 17.\nWhen we have the ball? Yeah, I’ll let you know after this and Michigan State.\nAnyway, time to pick a card off the floor and I’ll pick a positive one. People will still call for Haarberg’s head in favor of a guy who’s 5 weeks removed and pronounced 100% back from an injury which typically takes 6-8 weeks to heal. HH runs for his life some, has another dodgy passing day in the cold, and barrels in for a TD while Emmett Johnson adds his first as well. The defense performs heroically - again - and Alvano, who’s used to this shit, kicks a pair of FG’s and the ‘Skers escape 20-16.\nYep, I just picked us to win another one-score game. Time to burn some crap and chant at the sky like it means something. Black magic, y’all. Buh-leeze dat!\nJon: Purdue doesn’t have a very good secondary. Remember last year when Trey Palmer ran by so many defenses and Casey Thompson bombed the ball to him for many scores? Well, imagine that’s Haarberg to Coleman the rest of this season. Run play action, pull a guard, bomb the ball to Malachi. Why the hell not?\nNebraska 31, Purdue 17\nMike: This one is going to be a great test of what Matt Rhule is building. Bottom line to me is that Nebraska has to pull a performance like they gave against Illinois three weeks ago, and with all of the injuries Nebraska has, I’m not sure they have that in them. Factor in what should be some crappy weather, and this one should be really low scoring. And from my perspective...sad. Boilers 16, Huskers 13.\nJackson: For husker fans this season as we continue to pull a little win streak together find ourselves saying “This is the most important game of the year”. This week is no different. With Nebraska looking to get one step closer to a bowl and Purdue a must win if they’d like to go bowling both teams are gonna show up. In the end it will come down to Nebraskas ability to stop the run against 2 talented backs as well NU’s ability to expose a week Purdue secondary with a Malachi Coleman of sorts. This game will either end up in a low low scoring Purdue victory or a NU win by multiple scores. In the end I’ve got nebraska with a statement win at home in the cold 28-17 NU!\nJarek: Well considering Matt Rhule and Co are going to need to start holding student tryouts for anyone who can play on the offensive side of the ball soon, no one is going to say this is going to be pretty. But winning ugly is a beautiful art form, one that Nebraska is learning on the fly (or drudging along the ground). Nebraska wins ugly again. Nebraska 13 Purdue 10\nMost Popular\n- Nebraska’s Young Players Waiting in the Wings\n- Nebraska Baseball vs UConn - Live Discussion!\n- Nebraska Baseball Weekend Preview: MLB Desert Invitational\n- HUSKERS SOFTBALL Recap - It’s Tennessee & Pickens Again: #2 Tennessee 4 - #8 NEBRASKA 1\n- Five Heart Podcast: The Moos Fallout, Husker Hoops, and Breakfast Pizza",
  "word_count": 1716,
  "scraped_at": "2026-02-14T13:39:00.061177"
}