{
  "article_id": "3779b6b65e06",
  "url": "https://thepeoplesperson.com/2024/09/19/thats-the-pressure-man-united-boss-marc-skinner-reveals-main-obstacle-to-overcome-ahead-of-new-wsl-season-285635/",
  "title": "  That the pressure : Man United boss Marc Skinner reveals main obstacle to overcome ahead of new WSL season - Man United News And Transfer News",
  "date": "20240919T124500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Manchester United boss Marc Skinner has laid out the biggest challenge he is facing as the Reds prepare to get their WSL season underway this weekend.\nUnited endured a difficult 2023/24 campaign that saw them finish a disappointing fifth.\nHowever, there was light at the end of the tunnel for Skinner and his players as they won the Women’s FA Cup, courtesy of a 4-0 hammering of Tottenham Hotspur at Wembley.\nThe FA Cup winners endured a tumultuous summer, rocked by numerous high-profile exits including club captain Katie Zelem, goalkeeper Mary Earps and forward duo Lucia Garcia and Nikita Parris, just to mention a few names.\nSkinner also faced public concerns that United’s new owners – Sir Jim Ratcliffe and INEOS – were not fully committed to the women’s team. These concerns arose after the women’s team was relocated to temporary facilities at Carrington, as their building was reassigned to the men’s squad during renovations of the men’s facilities.\nSkinner of course denied this assertion as he insisted that the new hierarchy are determined to see his side succeed under the best possible conditions.\nAhead of the start of the new season, Skinner told Sky Sports that his main headache is striking a balance between managing his stars while trying to implement a desirable style of player that also guarantees results.\nThe 41-year-old remarked, “I want to produce football for a winning club, that’s the drive. Our fans don’t expect to be bored to death with the football. They want to see excitement, and a team that does not fear any opponent.”\n“I’ve got the unenviable task of trying to develop world-class players, while implementing a style that is beautiful to watch, while trying to win football matches in an unforgiving league. That’s the pressure.”\nReflecting on last season’s struggles, he said, “There was a moment where something had to change from last year.”\n“We had relative success the season before by finishing second but not won anything. Maybe we became a bit bloated with that, on reflection. Not purposefully, because I cannot fault anyone for effort, but we just lost our edge, we became a bit softer.”\n“Finishing fifth last season was a punch in the face.”\nHe expressed hope that this year will be better for United as they aim to achieve their goals. “If we can have a balance, that would be nice,” he said. “Hopefully it’s smoother this year. You can tell from my energy that I’m excited about this group of players. It feels different.”\nSkinner pointed out that there is a unity within the group, which feels different. He noted that every single player wants to be at the club and is willing to give everything for 2024/25 to be a smashing success.\nAnother change that took place in the summer was the appointment of a new leadership group. Maya Le Tissier was named captain while Ella Toone was handed the responsibilities of vice-captain.\nSkinner hailed the pair and backed them to hit the ground running.\n“We lost our captain [Zelem] in the summer, let’s address it. But we have to move forward, you can’t stand still in football. There is a big space where Mary [Earps] once was. But, again, we don’t want a short-term fix, it’s got to be the right fit.”\n“The leadership dynamic looks very different as a result. Zel was the best captain I’ve ever had. Her brain is incredible. But moving forward the visual leaders embody what we’re about.”\n“Ella Toone [vice-captain] is Miss Manchester United, she lives and breathes it. Then Maya Le Tissier [captain] is the type of player that puts everything on the line to win a game.”\n“They represent the movement of this team into a new era. I want effervescence and energy. I want us to be a true representation of the city and our fanbase. Both Ella and Maya will wear their hearts on their sleeve.”\nThe match between United and West Ham kicks off at 12:00 BST on Saturday at Old Trafford.",
  "word_count": 671,
  "scraped_at": "2026-02-14T12:33:17.381257"
}