{
  "article_id": "377d6918be4f",
  "url": "https://www.thetablet.co.uk/news/tributes-to-pope-francis-echo-around-the-world/",
  "title": "Tributes to Pope Francis echo around the world",
  "date": "20250428T230000Z",
  "domain": "thetablet.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A family of Syrian Kurds described the late Pope as “our angel” as they told how he “rescued” them from a refugee camp.\n“Pope Francis was a brave man who always sought peace and looked upon the whole world as equal, whether you were black or white. He didn’t care about your religion or what was written in your passport,” said Imán Nader after his death last week.\nThe 31-year-old mother said her family fled Iraq during the advance of ISIS and spent two years in a refugee camp in a muddy clearing in Cyprus. They had no access to clean water, little food, and lived in a field tent whose plastic roof barely kept out the rain.\n“I’ve always trusted and loved God and I prayed hard my life would change. God responded by sending Pope Francis who was our angel,” she said, reporting how on 3 December 2021, she met the Pope when he visited the Church of the Holy Cross in Cyprus.\nWhat changed the family’s fortune was a meeting with a Spanish journalist, sitting near them. Nader swapped telephone numbers with Silvina Perez, editor of the Spanish edition of L’Osservatore Romano. She later begged Perez to get them out of “this hell”, and Perez tried to get the family onto a list of people chosen to join humanitarian corridors organised by the Sant’Egidio Community. The complexities led her to call the Pope directly and he immediately began to mediate for the family and covered the costs of their journey to Rome.\n“When we were told we were leaving that horrible place I couldn’t believe it. It was a huge gift from Pope Francis,” said Nader at his funeral on Saturday. In March 2022, she and her family arrived in Rome where Nader and her husband work in catering, and have learned Italian. “Today, we are all weeping for the death of Pope Francis. No other religious leader I’ve seen was as good as him,” said Nader.\nShe was among many Muslims who commemorated Pope Francis. A message of condolence from Nahdlatul Ulama, the largest Islamic organisation in Indonesia with 40 million members, said: “Pope Francis was tireless in the work of the Catholic Church in protecting and defending humanity.” A message from the second largest Muslim association, Muhammadiyah, said: “We hope that the inspiration and steps taken by Pope Francis for humanity and peace will become a stimulus for large-scale world peace.”\n“Pope Francis has always been a vibrant voice of peace, brotherhood, and unity,” said Muslim and Christian leaders in Pakistan during a special prayer meeting organised on 22 April in the Archdiocese of Lahore.\nMuslim leaders remembered the Pope as an apostle of interreligious dialogue, notably through the Document on Human Fraternity for World Peace and Living Together – also known as the “Abu Dhabi Declaration” – which he signed on 4 February 4 2019 with the Grand Imam of Al-Azhar. That text remains “a powerful call to rediscover ourselves as brothers and sisters in order to promote justice and peace together, guaranteeing human rights and religious freedom,” said a statement from Pakistani religious leaders, “and represents a legacy that we will always carry in our hearts.”\nRemembering Pope Francis – the bridge builder with Islam\nPope Francis joins grand imam to sign declaration at Jakarta mosque\nChurches around the world engaged in public commemorations of Pope Francis last week. In French Polynesia, church bells “rang out in the night to announce the strongest hope in the mystery of the passage to eternal life, even in the heart of the Pacific Ocean” reported Fr Sandro Lafranconi SMA, describing the immediate response to the announcement of the Pope’s death.\nIn Sri Lanka, traditional signs of mourning for the Pope included the ringing of church bells and the flying of white flags at half-mast, while many drivers also placed small white flags on their vehicles. Catholics recalled Pope Francis’ 2015 visit to the island nation and his compassion and support for poor and marginalised communities, including his meetings with victims of Sri Lanka’s civil war.\nAt a memorial Mass in Myeongdong Cathedral, the Archbishop of Seoul Peter Chung Soon-taick OCD lit an incense burner for Pope Francis, as did many churches across South Korea.\nBurmese citizens of all faiths commemorated Pope Francis’ historic visit to Myanmar in 2017 and gave thanks for his messages of reconciliation. Buddhist monks described him as a “compassionate and kind-hearted man who loved all humanity without distinction”. In a refugee camp in Kayah State, in the Diocese of Loikaw – one of the areas caught in Myanmar’s civil war – Catholics gathered for a spontaneous prayer vigil according to the traditional local rite of the Karenni ethnic group to ask for God’s protection and blessings for Pope Francis.\nThe Bishops’ Conference of Myanmar prayed for the Pope during a Mass in Yangon Cathedral on 22 April, celebrated by Cardinal Charles Maung Bo and with numerous bishops, priests and religious, and attended by members of the diplomatic corps alongside Buddhist, Muslim, and Hindu religious leaders. Cardinal Bo called Pope Francis “a man of peace and humility”, and thanked him for his tireless efforts for peace in Myanmar and his calls for prayer and humanitarian aid for the country after its recent earthquake.\nIn Mongolia, a ritual table and a framed portrait of the Pope surrounded by candles and lilies was displayed during a Requiem Mass in the Cathedral of Saints Peter and Paul on 23 April led by Cardinal Giorgio Marengo, the apostolic prefect of Ulaanbaatar.\nIn a social media post, Prime Minister Luvsannamsrain Oyun-Erdene wrote: “We deeply mourn the loss of this noble man, who humbly described himself as a ‘Pilgrim of Hope’.” He said Francis was “a close friend to the Mongolian people and the first pope to undertake a state visit to our country”. Gandantegchinlen Monastery, Mongolia’s main Buddhist centre, offered “deepest condolences” on the death of Pope Francis, who they said had “dedicated his life to promoting unity, compassion and peace across humanity”.\nThe Laudato Si’ Movement held a global webinar on 25 April celebrating Pope Francis. Its executive director Lorna Gold thanked the more than 4,800 people who joined “to honour a leader who has touched so many hearts”.\n“Your participation helped us express something deeply personal and profoundly global: gratitude for a Pope who has awakened our ecological conscience and invited us to dream of a more just world,” she said.\nThe Filipino Catholic environmentalist Yeb Saño said: “Let’s continue to nurture the seed of Pope Francis, in our hearts and in our world. That is how we honour Pope Francis: by living the message of Laudato Si’ with renewed hope and action.”\nHow Pope Francis joined green theology with practical action on the world stage\nPope Francis’ perplexing legacy\nIn the US, other advocacy groups also expressed gratitude for the Francis pontificate. Supporters of gay rights and women’s ordination also voiced hope that the next pope would continue, and even accelerate, his work.\n“Pope Francis brought a refreshing and deeply pastoral presence to the papacy, emphasising mercy, dialogue, and accompaniment, and providing a renewed focus on the church’s mission to serve the most marginalised,” said the Women’s Ordination Conference.\n“His commitment to dialogue emboldened a deep discernment on the role of women within church structures. Francis made significant appointments of women to top positions at the Vatican in roles previously reserved for men. And during his pontificate, we witnessed women voting at the Vatican for the very first time. These cultural and practical shifts toward the inclusion of women cannot be understated.”\nMeli Barber, president of the gay Catholic group DignityUSA, said Pope Francis “raised awareness of LGBTQ+ issues in our church in truly unprecedented ways.” However, she said her group’s hopes for the synodal process had stalled: “Many of us had high hopes that some positive changes around LGBTQ+ teachings would come from the worldwide synod. That has not happened as of yet. We are waiting for the report from the working group charged with addressing controversial issues. But the discussion of LGBTQ+ issues is now part of the mainstream of our Church.”\nOther tributes came from actors recalling personal encounters with Francis. Whoopi Goldberg who met the Pope with a group of actors last summer, said: “He was the closest in a long time that seemed to remember that Christ’s love enveloped believer and [non] believer.”\nEva Longoria shared photographs of her meeting with the Pope on her Instagram account, writing: “Thank you for being an ally to many of us and speaking up for the marginalised. Your compassion, kindness and humility will always be remembered.”\nThe comedian Jimmy Fallon said: “It was an honour meeting Pope Francis last summer. I’m glad I made you laugh. Thank you for your encouraging words. Rest in peace.”\nJonathan Roumie, the Catholic actor who plays the role of Jesus in the television series The Chosen, described meeting Francis twice, saying this was “something for which I will ever be profoundly grateful”. He added: “His humility, his kindness and his gentleness were the marks of his pontificate for me – traits that I endeavour to embody in my own life, especially in my encounters with people.”\nIn Buenos Aires, players for Pope Francis’ football club San Lorenzo de Almagro wore patches depicting him on their shirts during their match against Rosario Central on the Saturday after his death. The team’s new 55,000-seater stadium will bear his name after the club Marcelo Moretti asked for the Pope’s permission ahead of its construction beginning this year. His fellow Argentinian Lionel Messi published a message, thanking Francis for “making the world a better place”.\nThe derby between Internazionale and AC Milan in the Coppa Italia on Wednesday began with a minute’s silence in memory of the late Pope. Saturday’s Scottish Premiership match between Dundee United and Celtic began with a minute’s silence for the Pope, and ended with a Celtic victory that secured them the Scottish title.\nFounded in 1840, The Tablet is the leading independent English-language Catholic weekly, celebrated for great writing, astute analysis, brilliant arts and books reviews and trustworthy reporting from correspondents in Britain, Ireland, Rome and across the world.\nIndependent, high-quality journalism is at the heart of what we do. The Tablet does not have deep pockets and we are not funded by rich donors. If you appreciate our work please consider supporting The Tablet’s Development Fund. It only takes a moment and you can cancel at any time.\n- Support with £5 per month\n- Support with £10 per month\n- Support with other amount.\nMOST READ ARTICLES\n-\n1\nSeamus Heaney – a ‘wide pre-reflective stare’\n-\n2\n‘The whole thing is relational’: Archbishop Moth embraces ‘leadership of service’\n-\n3\nCommission finds 50 child abuse cases in Polish diocese\n-\n4\nHonouring Catholic tradition and social teaching, this school is committed to academic excellence and the happiness of every child\n-\n5\nFollowing a grandmother’s footsteps through Albanian history\n-\n6\nChurch of England urges fresh commitment to ‘ending poverty in all its forms’\nFROM THE EDITOR'S DESK",
  "word_count": 1855,
  "scraped_at": "2026-02-14T12:11:44.078051"
}