{
  "article_id": "378263d9b346",
  "url": "https://www.brightonandhovenews.org/2025/01/29/brighton-and-hove-albion-beat-durham-in-womens-fa-cup/",
  "title": "Brighton and Hove Albion beat Durham in Women FA Cup – Brighton and Hove News",
  "date": "20250129T231500Z",
  "domain": "brightonandhovenews.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Brighton and Hove Albion 4 Durham 1\nThree goals in 15 minutes early in the first half helped Brighton and Hove Albion to their first win of 2025.\nThe Seagulls saw off Championship side Durham with some ease in the Women’s FA Cup having started the year with defeats against Liverpool, Arsenal and Manchester United.\nThe goals came from Bruna Vilamala, Michelle Agyemang, Guro Bergsvand and Nikita Parris, with Hannah Blake nabbing a consolation for the visitors.\nAlbion will now face Aston Villa in the fifth round after victory this evening (Wednesday 29 January) at the American Express Elite Football Performance Centre, in Lancing. The Broadfield Stadium, in Crawley, is waterlogged.\nHead coach Dario Vidosic made six changes to the side that lost 3-0 to Manchester United on Sunday (26 January).\nAnd six minutes into the match, Marisa Olislagers crossed, with Vilamala – on a season-long loan from Barcelona – timing her run perfectly to poke the ball in at the back post.\nIn the 19th minute, Sarah Wilson handled in the box – her outstretched arm blocking a cross from Pauline Bremer.\nAgyemang stepped up and made no mistake, thumping the ball into the top left corner. The Arsenal loan signing has now scored in all three domestic competitions for Albion this season.\nAlbion scored again just two minutes later as Bergsvand bagged the third. The Norwegian was alert when a shot from Olislagers was tipped on to the bar.\nIt looked like the ball was going out of play but, when it bounced back favourably, Bergsvand pounced and tapped the ball home.\nTwenty minutes from time, Durham went on the counter-attack down the left. Kaila Novak crossed. It was met acrobatically by the outstretched leg of Carly Johns – and the ball squirmed under Melina Loeck.\nAlbion continued to dominate possession and forced Tatiana Saunders to make a fingertip save from Parris who went one-on-one with the Durham keeper.\nAnd that was the last touch of Saunders’s career. She announced on Sunday that this would be her final game before retiring – and an injury meant she was replaced for the final 10 minutes.\nOn came Anna King and, five minutes into stoppage time, she conceded the final goal of the night, dropping Jorelyn Carabali’s ball into the box. Parris was there to fire it in.\nPerhaps the only downside tonight for the hosts was the withdrawal of Vilamala through injury with an hour played. Despite treatment, she couldn’t continue.\nNext up, Albion face Crystal Palace, in Crawley, in the WSL at 2pm on Sunday (2 February).\nThey are due to play Villa in the last 16 of the Cup at noon on Saturday 8 February at Walsall’s Poundland Bescot Stadium.",
  "word_count": 453,
  "scraped_at": "2026-02-14T12:53:32.088490"
}