{
  "article_id": "378ee03ba608",
  "url": "https://www.rnz.co.nz/international/pacific-news/563651/pasifika-sipoti-in-brief-for-10-june",
  "title": "Pasifika Sipoti in brief for 10 June",
  "date": "20250610T003000Z",
  "domain": "rnz.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Rugby\nThe Fijian Drua is expected to let go of 10 players at the end of the 2025 Super Rugby Pacific season.\nFBC reported chief executive Mark Evans will be making announcements of new signings and players being released at the end of this season, with some members of the Drua development squad expected to be promoted to full contracts.\nThe Drua have already signed World Sevens joint top try scorer and Fiji sevens representative Joji Nasova, and England-based Flying Fijians lock Temo Mayanavanua.\nNorth Harbour-based Moana Pasifika last weekend announced the release of 15 of their players ahead of the 2026 season.\nLeague\nThe PNG Hunters have dropped to eighth on the Queensland Rugby League's Hostplus Cup competition, following their 50-16 loss to the Dolphins in Port Moresby on Sunday.\nThe Hunters were sixth on the table before the game, but the loss means the Dolphins now move into sixth.\nThe Hunters have another home game on Sunday, hosting the Falcons, who are currently in seventh place.\nMeanwhile, two Ni-Vanuatu sisters were part of the Wigan Warriors team that claimed the Betfred Women's Challenge Cup title at Wembley on Sunday.\nVanuatu Rugby League said Shaniah and Tiana Power helped the Wigan Warrirors defeat St Helens 42-6.\nPacific Mini Games\nThe Northern Mariana Islands Pacific Mini Games team has received a timely boost as they prepare for the comp.\nGovernor Arnold Palacios has given US$50,000 to support the 162 athletes and officials, representing the self-governing commonwealth in association with the United States.\nAthletes will compete in athletics, 3x3 basketball, baseball, beach and indoor volleyball, swimming, softball, triathlon, va'a, weightlifting, and wrestling.\nThe 2025 Pacific Mini Games kicks off on 29 June.\nRugby\nFour players with Pasifika heritage have captained their respective Super Rugby Pacific teams to semifinal spots.\nThe Chiefs had lock-forward and All Black Tupou Va'ai, who is of Tongan heritage, leading them against the Blues.\nBlues captain Patrick Tuipulotu is of Samoan heritage, as is Brumbies skipper Allan Ala'alatoa.\nCrusaders captain David Havili is of Tongan heritage.\nThe Crusaders and Blues face off in the first semifinal on Friday, with the Chiefs hosting the Brumbies on Saturday.\nPacific Mini Games\nFiji Outrigger have named 22 paddlers to represent them at the Palau Mini Games later this month.\nThere are 11 male and 11 female paddlers.\nAmong the outrigger va'a paddlers is 15-year-old Iris Rae Bentley Fisher, who took up the sport two years ago.\nShe will make her debut for Fiji at the Palau Games.\nFootball\nPapua New Guinea will host the inaugural Melanesian Spearhead Group (MSG) women's Prime Minister's Cup football tournament in November.\nThe National reported the event was confirmed in Suva last Friday, following a meeting of the MSG sports committee.\nDates have been confirmed for 10 to 22 November.\nTeams will include PNG, Fiji, Solomon Islands, Vanuatu and New Caledonia.\nRugby\nFormer All Black, Shannon Frizell, has re-signed with the Toshiba Brave Lupus in Japan, pouring water on claims he was returning to New Zealand to chase another All Black spot.\nRugby Japan says the 31-year-old Tonga-born back-rower will remain with the club in the Japanese League One competition up until the end of 2026.\nThe former Highlanders loosie has made 35 appearances in Japan's top-flight, scoring 21 tries.\nHe made his last appearance for New Zealand at the 2023 World Cup final against South Africa.",
  "word_count": 562,
  "scraped_at": "2026-02-14T12:35:18.751575"
}