{
  "article_id": "37c0ab17e219",
  "url": "https://www.manchestereveningnews.co.uk/news/showbiz-news/gabby-logan-opens-up-constant-32035126",
  "title": "Gabby Logan opens up on  constant argument with rugby star husband Kenny Logan",
  "date": "20250711T073000Z",
  "domain": "manchestereveningnews.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Gabby Logan opens up on 'constant arguments' with rugby star husband Kenny Logan\nBBC presenter Gabby Logan has shared a fresh look into her life at home with Kenny Logan as she revealed that there are \"constant arguments\"\nTV presenter Gabby Logan has candidly spoken about her home life with ex-rugby player Kenny Logan, revealing: \"There's constant arguments.\"\nThe couple's chance encounter happened when Gabby was enjoying a night out with friends in a Chelsea bar, where she first met Kenny.\nGabby reminisced on the Table Manners with Jessie and Lennie Ware podcast about how Kenny mistakenly called her by the wrong name, confusing her with fellow presenter Gabby Roslin when recounting their first chat to his mates.\nSince tying the knot in 2001, Gabby and Kenny have built a family, welcoming twins Lois and Reuben in 2005.\nOn the Proper Tasty with Tom Kerridge and Chris Stark podcast, Gabby shared that their competitive streak often leads to arguments at home, particularly over mundane tasks like emptying the dishwasher.\nShe explained to Tom that these household tiffs are commonplace, saying: \"There's constant arguments about that, obviously.\"\nGabby also looked back at a family rounders match that went wrong due to their competitive nature, highlighting a mix-up with the number of balls used.\nRecalling a heated spat during the game, she said: \"I said third ball, and Kenny went, 'No, playing two balls, there's too many people to go.' And I absolutely lost it.\"\nShe continued: \"And my niece and nephew, who were about eight and nine at the time, were watching their aunty go, 'No, no, no, when did we change the rules?'\"\nProfessionally, Gabby has seen her career soar, recently being named as part of the new presenting lineup poised to take over from Gary Lineker on Match of the Day.\nDue to commence with the new football season in August, the trio—comprising Gabby, Mark Chapman, and Kelly Cates—will also front Match of the Day 2 and MOTD: Champions League.\nAdding to her impressive portfolio, Gabby remains a fixture on the BBC's sports presenting team and is soon set to appear on-screen as host for tonight’s (July 10) 2025 Women's European Championships showdown between Finland and Switzerland.",
  "word_count": 368,
  "scraped_at": "2026-02-14T12:58:49.084536"
}