{
  "article_id": "37f11b11b629",
  "url": "https://www.nytimes.com/athletic/6451210/2025/07/08/hannah-hampton-lionesses-england-earps/",
  "title": "The Hannah Hampton story : Meet the player tasked with replacing Lionesses icon Mary Earps",
  "date": "20250708T070000Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Aston Villa were doing a shooting drill and one by one, the outfield players failed to get a shot on goal.\n“Is there any point in me being here if we can’t even hit the target?” said goalkeeper Hannah Hampton. Some laughed, others thought: “I’ll show you!”\nHampton demanded more from her team-mates, albeit she could not stand conceding a goal in training. “She wanted the people in front of her to be better,” says former Villa and Scotland captain Rachel Corsie. “She would voice her frustration but nothing untoward. She just had that passion, relentlessness, ambition.\n“She had a charisma about her, something that made you notice her. She was unbelievably talented.”\nAdvertisement\nFighter pilot, brain surgeon, professional sportsperson. Those were just some of the professions doctors told Hampton’s parents she would not pursue.\nEngland’s No 1, filling the huge gloves of Mary Earps following her retirement, was born with a severe squint. By the age of five, she had undergone three operations at Birmingham Children’s Hospital, for whom she is now an ambassador. She only recalls the last one, waking up with her eyes briefly glued shut.\nThe 24-year-old has no depth perception and struggles to judge distances — pouring a glass of water from a jug can be problematic. You will notice it most when she gets tired, as her left eye starts wandering. But that has not stopped her. Having been told from a young age she can’t, Hampton has always set out to prove to people she can.\n“I’d heard an awful lot about Hannah, on and off the pitch,” Carla Ward, the Republic of Ireland head coach who managed Hampton at Aston Villa from 2021 to 2023, tells The Athletic.\nOn day one, they went for a walk. “Her dream was to play for Chelsea,” says Ward. “I said to her: ‘You give me everything and we’ll help you get there’.”\nOn day two, the first training session, Ward thought: “Wow, she’s got something.” Hampton was dextrous with her hands but even more impressive with her feet. England team-mate Beth Mead describes her technical ability as “different class”, while Ward says she is “technically one of the most gifted footballers I’ve worked with. I would have loved to have seen her outfield.”\nAt times, Hampton would join in with Villa’s outfield drills if needed. “That’s unheard of for goalkeepers and it’s a huge asset,” says Corsie. “She is better than anyone I’ve played with in terms of perceiving pressure, knowing how long you need to take a touch, play and have that calmness.\nAdvertisement\n“She can strike the ball (with her) right and left foot comfortably to the halfway line, flat driven trajectory. That’s remarkable. I can’t imagine you’d find many Women’s Super League (WSL) players even at the top clubs who can do that.”\nHer technical competence comes from playing as a striker for Villarreal’s boys’ academy. Her parents, Chris and Laura, moved to the city in eastern Spain with Hannah, aged five, and their eldest Ben, to teach in an international school.\nAfter five years in Spain, where she learnt the language and formed an indelible bond with her brother, Hampton returned to England and joined Stoke City’s academy — as an outfield player. But in her first game, against Liverpool, she stepped in to replace their goalkeeper, who had been injured in the warm-up. She impressed so much that, unaware it was her first time in goal, an England scout invited the 12-year-old to an under-15 national camp.\n“She was born to play football,” says Ward. “Her shot-stopping is ridiculous, her athleticism, reach and jump are outrageous. She’s got it all when it comes to being a goalkeeper.”\nAlthough effusive with praise for a player who has a “heart of gold”, Ward says Hampton has “had a lot of maturing to do”.\nIn March 2021, 90 minutes before Birmingham City — Hampton and Ward’s former club — hosted Everton in the WSL, the goalkeeper learned via email she had not made Team GB’s Olympic shortlist for the Tokyo Games that summer.\n“She was in pieces,” says Ward, who criticised the Football Association (FA) at the time for what she describes today as “outrageous timing”. Birmingham lost 4-0, with 20-year-old Hampton struggling to shake off the news. Two weeks later, she told The Athletic she was “more annoyed” at her performance than the email but what affected her most was “receiving so much hate through social media”.\nHampton kept a clean sheet on her England debut under Sarina Wiegman but did not play during Euro 2022, with Earps the undisputed No 1. A month later, however, Wiegman did not select Hampton, saying in a press conference that the goalkeeper “has some personal issues she has to solve”. Hampton was left out of Wiegman’s next four England squads until April 2023.\nAdvertisement\nHampton started Villa’s first two league games of the 2022-23 season but was absent because of an unspecified injury and not selected for the Chelsea match on October 30, even though she was declared fit earlier that week. Ward, her manager, said it was best for her to stay at home, though Hampton travelled and watched from the stands.\nThe next day, The Guardian reported Hampton had been dropped from England because of “behaviour and attitude at the team’s camps” and her return under Wiegman was unlikely. When announcing the November squad the following day, Wiegman cited the same reason as in September. “Nothing changed,” the England head coach said. “She still has to do something personal that I would really not like to comment on.”\nWiegman confirmed the door remained open for a World Cup return. That evening, Hampton said on social media she had been dealing with a medical issue and would undergo a minor procedure. When approached by The Athletic, Hampton’s representatives and the FA declined to comment on The Guardian’s report and Wiegman’s decision not to select Hampton.\nWard says it was Wiegman’s decision not to call up Hampton for that initial September squad and described the England manager’s handling of the situation as “excellent”.\n“There was a period that she probably needed to be away from football, learn how to deal with other aspects of life,” Ward tells The Athletic. “If you don’t deal with things very well, sometimes you can be criticised for (a lack of) maturity. There were a lot of things around that time where she needed time to reset. Was it the right decision? Yes. Was it handled well? Yes. But was it also ridiculously tough for Hannah? Yes.”\nHampton told Fozcast: The Ben Foster Podcast that at that time she wanted to quit football.\nCorsie was “sad” to read reports about Hampton’s attitude and did not think they were a “fair reflection”. From a captain’s perspective, she was “great”. “We had a good relationship,” she says. “She knew I trusted her. If you needed to say something, we could do it openly and I genuinely really enjoyed working with her. No issues whatsoever.”\nAdvertisement\n“A young player will be criticised for attitude at times,” Ward says. “You can have a bad day and that happens. Hannah just had some areas that she probably needed to continue to work on.\n“And she has done — that’s credit to her because lots of people at the time criticised her, internally, externally, around her, close people, far people. But she got her head down, worked hard and got her reward. Senior players need guidance. We were talking about a young player who really needed guidance. Every youngster has an attitude at some point.\n“She’s almost like your daughter — she needs your arm around her one minute but the next, she needs strongly telling what’s what. She needed somebody who was going to be honest and direct to help guide her. Myself and Emma (Hayes, the manager who took her to Chelsea) offered her that.”\nThe experience changed Hampton. “All the media at the time was not the important thing,” Hampton told ITV. “What was important was to look after myself. It changed me to almost not care what people think. Just go prove people wrong.”\nWhen Chelsea came calling in the summer of 2023 upon the expiry of her Villa contract, Hampton did not tour the training ground.\nOne call from Hayes and Hampton was sold. Chelsea had five goalkeepers, including their first-choice Germany international Ann-Katrin Berger and Sweden’s 2023 World Cup star Zecira Musovic, but Hampton was not loaned out. She was there to become Chelsea No 1.\nCorsie remembers Hampton was not even in the matchday squad the first time Villa faced Chelsea after she moved clubs. “I just want to play,” she told Corsie, who replied: “Keep working hard.”\nIn the documentary Emma: One Last Dance, Hayes approaches Hampton, who is not taking part in training. “You should be down there and helping her tomorrow,” Hayes tells the goalkeeper of the requirement to support whoever is playing. “That’s what good team-mates do.” After encouragement, eventually Hampton gets up. “I know I’m difficult at times,” she says before praising Hayes’ way of working.\nHampton’s chance came in December 2023 and she retained the No 1 spot, winning the league in her first season, then a domestic treble in her second, sharing the Golden Glove with Manchester United’s Phallon Tullis-Joyce.\nAdvertisement\n“People who may have a certain opinion of Hannah maybe wouldn’t have backed her to do that but she did,” says Corsie. “Similar to England, she has waited her time and worked hard.” Close with Chelsea’s Sjoeke Nusken and Mayra Ramirez, Hampton is a talented artist, pianist and linguist, and wants to learn phrases in every team-mate’s language — but she cannot sit still.\nOn days off, Hampton cycles laps of Richmond Park and before England camps or during the off-season, she trains at FSCR, an elite performance London-based gym for footballers.\nDirector Dan Bernardin has witnessed Hampton mature and her intense work ethic. On the pitch, Bernardin says they hone in on her first touch under pressure, her passing, “inside foot, laces, outside foot”, kicking and decision-making.\nIn the gym, they focus on her speed and power, especially single-leg work, crucial for diving. “She has not got the longest of limbs,” says Bernardin. “So everything has to come from raw power to cover greater distances.”\nBernardin credits Hampton’s outfield background for her strong positioning and physical edge over other goalkeepers. “She’s got this natural strength,” he says, describing her as a “hard worker, diligent and constantly pushing her weights”. If there’s an error in her training plan, she spots it.\nBernadin, who has built a trusting relationship with Hampton, says having a “third space”, away from club and country, is important for players to “vent and get things off their chest”.\n“She doesn’t get bogged down too often,” he says, citing her mantra: “It is what it is.” Even amid selection setbacks, she stayed focused. Bernardin has seen her angry, “which isn’t a bad thing”, he adds. He recalls Hampton not wanting to talk to anyone after the Champions League defeat against Barcelona in the 2024 semi-final second leg but after 20 minutes or so, she was smiling again. “She has really high standards but she can regroup quickly,” he says.\nAdvertisement\n“I’ve got to just go and live up to her legacy,” Hampton told the media in June after Earps’ retirement, describing her former team-mate as a “big personality” who has “glued” the squad together and will be much missed.\n“First of all we have to respect what her decision is,” said Hampton. “There has been quite a bit of scrutiny that she does not deserve with everything that she has achieved in the game and put women’s goalkeeping on the map for the younger generation.”\nAccording to a source briefed on the matter, their relationship has been respectful but there is no secret the pair are not best friends and there have been occasions when they have not seen eye to eye. Hampton sent her a text and congratulated her on a very successful international career. “That’s all I really can do,” said Hampton. “I’m not expecting anything back. She’s been an unbelievable player.”\nEarps said, via the Happy Place podcast, she felt “villainised” for her decision to step down from the national team. Hampton has received backlash too. “It’s hard when you see English fans not want you in goal,” she told ITV. “I’ve not done anything to make you hate me. Yes, your favourite player has retired, that’s not my decision. I haven’t put that in her mind. She has come to that decision herself. It just goes back to proving them wrong. You don’t want people to put you down or knock the smile off your face but believe me, I’m not going to let them.”\nEarps’ biggest strengths was her communication and Ward thinks commanding from the back is an area Hampton needs to keep refining.\nHampton, who has worked with the same psychologist since before Euro 2022, has played with the pressure of silverware at Chelsea but she told Foster’s podcast she had “so much more anxiety” before a game last season. She has said one of her biggest obstacles is “self-belief” and her worst habit is “overthinking”. One of her most nervous moments was not on the pitch, however, but before giving a speech at Buckingham Palace for the gold Duke of Edinburgh award.\nHampton’s distribution was, for the most part, on point in England’s 2-1 defeat by France on Saturday. She could not do anything about the two goals conceded but she had some nervy moments.\nAdvertisement\nWard and Corsie believe Hampton will be fine as England No 1. “She enjoys a bit of pressure,” says Corsie. “She’s ready to take that on.”\n“She’ll fly,” adds Ward. “She’ll thrive off it. You’ll see her step up. She has matured over the past few years more than I’ve seen in a lot of people. She needed to change that to keep on track for not only England’s No 1 but also world No 1. That’s somewhere I truly believe she can get to.”\n(Top photo: Daniela Porcelli/Getty Images)",
  "word_count": 2366,
  "scraped_at": "2026-02-14T12:44:04.987100"
}