{
  "article_id": "37f8f32e79ad",
  "url": "https://banglamirrornews.com/2025/05/25/arsenal-stun-barca-to-clinch-womens-champions-league-title/",
  "title": "Arsenal Stun Barca to clinch Women Champions League title",
  "date": "20250525T173000Z",
  "domain": "banglamirrornews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In a night of high drama in Lisbon, Arsenal pulled off a stunning upset to win their first-ever UEFA Women’s Champions League title, defeating tournament favourites Barcelona 1–0.\nThe Gunners made history as first English club to claim modern version of the coveted trophy, ending an 18-year European title drought and delivering heartbreak to Catalan giants.\nOnce seen as heavy underdogs, Arsenal Women etched their names into European football history with a sensational 1–0 victory over three-time champions Barcelona in UEFA Women’s Champions League final on Saturday night.\nPlayed in front of a packed crowd in Lisbon, the tightly contested match saw neither side break through in the first half. But it was Swedish forward Stina Blackstenius who emerged as hero in 74th minute, scoring the decisive goal that sealed a landmark win for North London club.\nThe victory not only marks Arsenal’s first Champions League title in modern era but also makes them the first English club to lift the trophy since the competition was rebranded.\nTheir last European triumph came back in 2007 when they won UEFA Women’s Cup; the predecessor to the current tournament.\nBarcelona entered the match as clear favourites, having dominated European football in recent years. Led by Ballon d’Or winners Aitana Bonmatí and Alexia Putellas, Catalan side were eyeing a fourth Champions League crown in five years and hoping to become only the second team after Lyon to win three in a row. Their path to the final included commanding wins over Wolfsburg and Chelsea.\nBut Arsenal had other plans. Despite a nervy start, they grew into the game with composed pressing and sharp counterattacks. Their pressing game disrupted Barcelona’s rhythm, while long balls down the left flank kept the Spanish side under constant pressure.\nArsenal had two golden chances early in second half, but Barcelona goalkeeper Cata Coll made brilliant saves to deny Frida Maanum and Blackstenius. However, Coll was finally beaten in the 74th minute when Blackstenius latched onto a loose ball and fired it home ; a goal that would ultimately decide the match.\nBarcelona’s best opportunity came when Claudia Pina’s strike rattled the crossbar shortly after halftime. But the Spanish champions struggled to find their usual fluidity and were unable to break down Arsenal’s resolute defense.\nThe win capped a fairytale run for Arsenal, who had seen head coach Jonas Eidevall resign mid-season. Assistant coach Rene Slegers took over and masterminded a remarkable European campaign, including comeback wins against Real Madrid and eight-time champions Lyon.\nAs the final whistle blew, Arsenal’s players sprinted toward their jubilant fans, celebrating a historic triumph that few had predicted.\n“We believed from the very start,” said striker Alessia Russo after the match. “We knew we had the talent — it was just about delivering on the pitch. Tonight, we did that.”\nBarcelona’s Bonmatí offered an emotional response, “We’re sorry to our fans who came all this way. We promise to come back stronger and try again.”\nFor Arsenal, it was a night to remember and a new chapter in European women’s football history.",
  "word_count": 509,
  "scraped_at": "2026-02-14T12:50:22.231316"
}