{
  "article_id": "37fb9db6829c",
  "url": "https://kvia.com/entertainment/2023/12/07/landmark-portrayals-of-lgbtq-characters-in-us-sitcom-history/",
  "title": "Landmark portrayals of LGBTQ+ characters in US sitcom history",
  "date": "20231207T214500Z",
  "domain": "kvia.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Landmark portrayals of LGBTQ+ characters in US sitcom history\nMichael Ochs Archives // Getty Images\nLandmark portrayals of LGBTQ+ characters in US sitcom history\n‘The Jeffersons’ stars Berlinda Tolbert, Sherman Hemsley, Isabel Sanford, Franklin Cover, Roxie Roker, and Marla Gibbs.\nFew things feel more quintessentially American than the sitcom. Its features can be recognized anywhere—the laugh track, the unchanging living room or kitchen set that becomes as familiar as one’s own. The traditions that grew out of sitcoms are almost as deeply ingrained: a whole family gathering around the television at a specific time every week, excited to watch a family that looked like theirs finding humor in the mundane.\nSitcoms have long reflected the cultural norms of the time to their viewers, as they were specifically designed to appeal to mass audiences. But occasionally, sitcoms subtly pushed against what was deemed socially acceptable, asking viewers to interrogate their beliefs and preconceptions. By including characters that did not conform to the ideal of a white, heterosexual, middle-class nuclear family, sitcoms started to reshape the very cultural norms they often reinforced.\nWhile sitcoms can be used as a historical record of the cultural values of their time, they also offer insight into what—and who—was not valued. For the first several decades of television history, LGBTQ+ characters did not generally appear. If they did, they were often portrayed as deviant or performative in stereotypical ways and were rarely developed into more than a walking trope. These depictions reinforced the stigma surrounding the LGBTQ+ community and did little to dispel prejudice. But as the gay liberation movement burst forward in the 1970s, catalyzed by events like Stonewall, LGBTQ+ representation on TV began to shift.\nSome showrunners made it their mission to push the envelope of what kinds of characters were seen as acceptable on TV, like the often-provocative Norman Lear, who died on Dec. 5, 2023 at the age of 101. Though not without his critics, Lear used his popular sitcoms, including “All in the Family” and “The Jeffersons,” to challenge both studios’ and audiences’ beliefs about race, gender, and sexuality, including some of the earliest representations of LGBTQ+ characters on TV. These portrayals often prompted nationwide conversations about the narratives that could and should be represented on the small screen.\nGLAAD, an organization that works to combat prejudicial depictions of the LGBTQ+ community in the media, has been tracking queer representation on television for decades. According to Raina Deerwater, GLAAD’s entertainment research and analysis manager, that’s because LGBTQ+ representation on television holds a specific kind of weight.\n“Television in America is very much a cultural institution,” Deerwater told Stacker. “You go to a living room, and nine times out of 10 there will be a TV. It’s a communal activity with your family. [TV] remains to be one of the major ways the LGBTQ+ community is seen in the media.”\nThrough the decades, sitcoms have shied away from and led the way on various social and cultural issues. From representations of the AIDS crisis in the ’80s to the legalization of same-gender marriage in 2015, queer characters being shown on television—and how they are depicted—has evolved to become more diverse and characteristic of the wide spectrum of LGBTQ+ identities.\nLGBTQ+ viewers seeing themselves reflected on the screen is powerful. “It’s important to know that there are other people in the world like you,” Deerwater said. “There’s something so special and validating about feeling isolated your whole life, feeling out of the norm, and then seeing that there is a world in which you are living and thriving and have a community.”\nBut seeing LGBTQ+ characters on TV is also vital for viewers outside of the community. Television can be a way for people not exposed to the LGBTQ+ community in real life to feel connected to a character. According to Deerwater, TV shows can also offer a starting point for conversations about LGBTQ+ people and issues.\nTo investigate the history of LGBTQ+ representation in American sitcoms, Stacker scoured news coverage, critical reviews, and historical documents. We also analyzed data from a decade of GLAAD’s “Where We Are on TV” reports—which keep tabs on how many LGBTQ+ characters appear on streaming services, primetime cable, and broadcast networks, among other insights—to track the recent rise in queer characters on TV.\nStacker\nLGBTQ+ representation on television has jumped dramatically over the last 10 years\nLine chart of total LGBTQ characters on TV from 2010 to 2022\nThere were nearly eight times more LGBTQ+ characters on television in 2021 than in 2010, according to GLAAD data. Despite the production challenges posed by the COVID-19 pandemic in 2020, the number of queer characters more than recovered the following year, surpassing 2019.\nThe jump in representation is even more significant when considering counts from the early days of GLAAD’s reporting. “There were 12 characters, period, in that first report,” Deerwater said. “It was obviously an immensely different landscape back then.”\nEven though 2021 was a record-breaking year regarding the number of queer characters on TV, Deerwater has observed a trend that isn’t so optimistic: shows featuring queer characters and storylines getting greenlit, only to be canceled after one or two seasons. In 2022 alone, queer-led shows including “First Kill,” “Saved by the Bell,” “Queer as Folk,” and “Tom Swift” were canceled after their first or second seasons. “A lot of really inclusive shows are getting canceled as a byproduct of different platforms not putting their weight behind the show, and not giving it a chance to get more views,” Deerwater explained.\nTadem Productions\n1971: A gay male character appears on ‘All in the Family,’ a first in sitcom history\nCarroll O’Connor and Philip Carey in an episode of ‘All in the Family’\nTwo years after Stonewall, the first gay male character to appear on a sitcom—and likely the first gay man many Americans saw represented on television—appeared in an episode of “All in the Family.” The show, created by Norman Lear, was about to explode in popularity, becoming the most-watched television program of its time. But the 1971 episode, “Judging Books by Covers,” came early in the first season.\nThe episode centers on the star of “All in the Family”—the inflammatory Archie Bunker, termed a “lovable bigot” by some critics—whose racist, sexist, and homophobic views were meant to bring attention to social issues through satire. A scene in the episode finds Archie at lunch with his friends and an acquaintance—a well-dressed, well-traveled man named Roger, who Archie openly demeans for appearing to be gay. Later in the episode, Archie goes to the bar and hangs out with his friend Steve, a muscular former football player and bachelor who is clearly set up to be Roger’s visual opposite.\nArchie demeans Roger to Steve and challenges Steve to an arm-wrestling match. By the end of the episode, however, the tables have fully turned on Archie—easily beating Archie in the arm wrestle, Steve tells Archie that he, in fact, is gay. When Archie reacts with disbelief and shock, Steve again slams Archie’s arm to the table and triumphantly exits, leaving Archie to adjust to his new reality: that the stereotype of the effeminate, flamboyant gay man is just that—a stereotype.\nDespite only being the show’s fifth episode, “All in the Family” was already making its mark on American culture. People on all sides of the cultural debate on homosexuality had opinions about the appearance of masculine, all-American, gay Steve on television—including President Nixon. Caught on secretly recorded tape, Nixon specifically called out the “All in the Family” episode, bitterly complaining that it was “glorifying homosexuality.”\nAfter the groundbreaking “All in the Family” episode, similar representations of gay men on sitcoms in the decade would follow. Programs like “The Mary Tyler Moore Show,” “Maude,” and “Cheers” all featured one-off episodes that dealt with the polarizing issue of homosexuality by introducing a character—usually a friend of a friend or a distant relative—who, by the end of the episode, is revealed to be gay. These characters were usually white, conventionally attractive men who passed for straight.\nThis type of representation had its advantages and some serious limitations: they allowed television shows to probe the topic of homosexuality cautiously while avoiding the messiness of needing to develop complex, recurring gay characters. These characters conveniently disappeared by the end of the episode, never to be seen—or further explored—again. At the same time, these appearances did the important work of disrupting audience expectations around homosexuality, demonstrating that gay men could not be reduced to a simplistic trope.\nAn exception to this rule was the recurring gay character Peter Panama on the 1972 sitcom “The Corner Bar.” But though Panama appeared several times throughout the series, rather than disappearing after a single episode, he broke barriers in name only—the president of the Gay Activists Alliance at the time, Rich Wandel, called the portrayal “the worst stereotype of a gay person I’ve ever seen.”\nEmbassy Television\n1977: A year of firsts on ‘Soap,’ ‘The Jeffersons,’ and ‘Sanford Arms’\n1977 was a big year for American culture. Fleetwood Mac released their hit album “Rumours,” Jimmy Carter was sworn in as president after the debacle of the Nixon years and the stumbles of the truncated Ford administration, and “Star Wars Episode IV: A New Hope” was screened in theaters across the country.\nBig cultural shifts were also taking place around LGBTQ+ issues. In 1977, Harvey Milk was voted onto the San Francisco Board of Supervisors, making him the first out gay man to hold elected office. Four years earlier, homosexuality was finally declassified as a mental illness and removed from the American Psychiatric Association’s Diagnostic and Statistical Manual. At the same time, only 43% of Americans believed gay or lesbian relations between consenting adults should be legal (compared with 83% in 2019), according to Gallup’s first poll on gay issues.\nChanging attitudes about gay rights began trickling into small-screen representation by the late ’70s. On “Soap,” a sitcom that parodied daytime soap operas with melodramatic stories and over-the-top characters, the first gay character to have a main role in a television series was introduced. Jodie Dallas, played by a young Billy Crystal, was a director of television commercials who dated a closeted football player at the start of the series but ended up having several relationships with women. However, he continued to identify as gay throughout the series. Although Jodie’s character does not hold up by today’s standards—particularly his short-lived desire to have sex reassignment surgery to marry his then-boyfriend legally—he nonetheless won audiences over with character development and depth that had never been afforded to gay characters on television before.\nOne of the first trans characters also appeared on a sitcom in 1977. “The Jeffersons,” a long-running, Lear-developed sitcom with a predominantly Black cast, featured an episode in which George, the patriarch of the Jefferson family, goes to meet his old Navy buddy Eddie, only to find that she has transitioned and goes by the name Edie. While George’s initial reaction to her transition is disgust and disbelief, they eventually reconcile when he accepts her. Although she only appears in one episode, Edie, depicted by Veronica Redd, is surprisingly sympathetic, considering the rampant transphobia of the time. She describes herself as happy and corrects George on her new name while telling him she’s always been a woman—“even in the Navy.”\nAnother gender-nonconforming character appeared on “All in the Family” in 1975. Beverly LaSalle was a recurring drag queen character played by out gay drag queen Lori Shannon. Though drag was rare on television at the time, depictions that did exist were often derogatory and presented gender-nonconforming characters as psychotic. In contrast, Beverly’s character got a more fleshed-out character arc and was portrayed as a human with dignity.\nWhen Beverly is murdered on the street by transphobic perpetrators, Archie and his family are devastated. While trans and gender-nonconforming characters being victims of hate crimes has a long history in television and film, often to the detriment of trans representation, Beverly’s sympathetic portrayal and the Bunker family’s reaction to her death were unique for the time. Beverly’s death shed light on the systemic violence and bigotry faced by gender-nonconforming people across the country.\nOne of the first Black gay characters on a sitcom also appeared in 1977, on an episode of “Sanford Arms,” a short-lived spinoff of Lear’s “All in the Family”-esque “Sanford and Son.” The character Travis appeared in only one episode and was portrayed as a civil rights lawyer engaged in the gay rights struggle. While he was not given any real character development, and in some ways, his gayness was treated as something comical, Travis’ portrayal also defied certain racial and sexuality-based stereotypes.\nTouchstone Television\n1986: The first lesbian character appears on a sitcom in ‘The Golden Girls’\nBetty White in an episode of ‘The Golden Girls’\nIn the second season of “The Golden Girls,” Dorothy’s old friend Jean visits in an episode called “Isn’t It Romantic?” Before she arrives, Dorothy describes her to her mother, Sophia, as a lesbian whose longtime partner recently passed away. She does not tell the rest of her friends, however, for fear that they won’t be accepting of her friend. Throughout the episode, Jean falls for Rose. Lois Nettleton, who played Jean, was nominated for an Emmy for her performance, and Terry Hughes won an Emmy for directing the episode.\nThis landmark portrayal of a lesbian character was important for more reasons than merely being one of the first of its kind on television. Jean’s character is remarkably well-developed for the time. She is comfortable with her sexuality and is uninterested in hiding it. When she develops feelings for Rose and confesses these feelings, Rose and the other friends treat her with respect, despite not reciprocating the feelings. She is never depicted as predatory or treated as a joke, avoiding common tropes that queer characters of the time frequently fell back on.\nThe timing of this episode and the type of representation it promoted were significant. Just one year before “Isn’t It Romantic?” aired, Hollywood golden boy Rock Hudson announced that he had AIDS and died shortly after. The AIDS crisis, which began in 1981, produced yet another stigma towards LGBTQ+ Americans and (often negatively) impacted how they were depicted on television and in other media. LGBTQ+ people were dealt another blow in 1986, when the Supreme Court ruled in Bowers v. Hardwick that the Constitution did not allow the right to engage in consensual homosexual sex acts. This decision upheld the legality of anti-sodomy laws that already existed in many states across the country, endangering many LGBTQ+ people and creating further stigma.\nBesides winning critical acclaim and introducing a destigmatized lesbian character, “Isn’t It Romantic?” became an enduring touchstone of lesbian humor, even spawning the endearing “Lebanese joke.” The wisecrack would carry on for decades, with Ellen DeGeneres referencing the quip in her coming-out appearance on “The Rosie O’Donnell Show” in 1996 and the “Glee” character Santana Lopez employing it over 10 years later.\nParamount Television\n1991: Sandra Bernhard plays one of the first recurring bisexual characters on television in ‘Roseanne’\nSandra Bernhard and Roseanne Barr in an episode of ‘Roseanne’\nBefore Roseanne Barr was known for her support for the conspiracy theory “QAnon” and for tweeting a racist attack on former President Barack Obama’s former adviser Valerie Jarrett, her sitcom “Roseanne” was famous for its groundbreaking portrayals of LGBTQ+ characters and topics, as well as its working-class perspective.\nIn the show’s fourth season, openly bisexual actress Sandra Bernhard played Nancy, a friend of Roseanne’s who came out as a lesbian on the show and later identified as bisexual. As one of the first recurring bisexual characters on television, Bernard’s Nancy broke barriers, dating several women and men throughout the series. Like the rest of the cast, Nancy was small-town and working-class, representing a departure from the urban gay stereotype.\n“Roseanne” offered other landmark moments of queer representation as well. Several years before “Will & Grace” paved the way for a gay lead character, “Roseanne” introduced the recurring gay character Leon. In 1995, Leon and his boyfriend, Scott, got married, marking the first same-gender wedding to be shown on television. And in one of the show’s most famous episodes, Nancy brings Roseanne to a gay bar, where one of the first kisses between two women on a sitcom caused so much controversy among network heads at ABC that the 1994 episode almost didn’t air.\nThat “Roseanne” episode and other earlier kisses between women on television were part of an emerging ’90s trend of “lesbian kiss episodes“: one-off episodes that, while groundbreaking in certain ways, ultimately functioned as stunts to draw more viewers from all political backgrounds.\nFotos International/Getty Images\n1994: Lesbian parents raise a child and get married for the first time in TV history on ‘Friends’\nJessica Hecht, Jane Sibbett, and David Schwimmer in an episode of ‘Friends’\nThe quintessentially ’90s sitcom “Friends” introduced the lesbian character Carol and her partner, Susan, early on in the show. The beginning of the series finds Ross recovering from his divorce from Carol, who had come out and left Ross for Susan. Soon after, Carol gives birth to her and Ross’ baby, Ben, whom she co-parents with Susan. Carol and Susan frequently appear throughout the series and eventually get married in the show’s second season.\nCarol and Susan’s arc on “Friends” broke barriers in queer television representation in several ways. For one, it was one of the first TV portrayals of same-gender parents raising a child. This was particularly groundbreaking considering, in 1994, only 28% of Americans believed gay and lesbian couples should be legally allowed to adopt children, according to Gallup. Carol and Susan’s wedding, which aired in 1996, was the first lesbian wedding to be shown on television.\nThough “Friends” was subversive for depicting queer parenthood and marriage at all, critics have noted in the decades since the show went off the air that these depictions—and the main characters’ attitudes toward queerness—leave a lot to be desired. Carol and Susan’s relationship, and Carol’s lesbian identity, are frequently played for laughs by the straight central cast. Homophobic stereotypes about lesbians are often at the heart of jokes and are frequently used to embarrass or emasculate Ross.\nCarol and Susan’s parenting is similarly positioned as humorous at both their’s and Ross’ expense, and peddles the idea that children not having a “strong male role model”—or having two moms—will cause them damage. At the same time, Susan and Carol are never shown kissing—not even at their wedding. Meanwhile, the show did go on to show a kiss between women: Rachel, a straight woman, and her old sorority sister, who later declares her love for Rachel in a moment widely dismissed by critics as a ratings stunt.\n1994 was also a landmark for TV representation of AIDS and HIV-positive people. Throughout the 1980s, television representations of people living with AIDS were limited. They were mostly confined to hospital dramas where HIV-positive patients were used as teachable moments or depicted as villains. In 1994, however, MTV’s “The Real World: San Francisco” televised an actual commitment ceremony between two HIV-positive men, Pedro Zamora and Sean Sasser. This was the first actual same-gender commitment ceremony to be aired on TV and the first between two men living with HIV. Zamora died later that same year, while Sasser passed in 2013.\nStacker\nGay male characters still account for most LGBTQ+ characters seen on TV\nMultiple line chart of LGBTQ characters on TV by group from 2010 to 2022\nLGBTQ+ characters of most sexual orientations and gender identities have seen an almost consistent increase in representation on television over the last decade. Apart from a dip in 2020 due to COVID-19-related shutdowns, the number of gay, lesbian, bisexual, and trans and nonbinary characters has seen an upward trend.\nSome groups have seen faster and greater growth than others, however. Gay male characters still dominate LGBTQ+ representation overall, while transgender and nonbinary characters lag. And some members of the LGBTQ+ community continue to be underrepresented or not represented at all, according to GLAAD’s Deerwater.\n“There’s still so many gaps that need to be filled,” she said. “Characters living with HIV, characters with disabilities, people with different body types, and queer Indigenous characters,” as well as queer ensemble casts and multi-season arcs, are all areas where Deerwater says networks and streamers need to push for more.\nTouchstone Television\n1997: Ellen comes out on her sitcom ‘Ellen’—and in real life\nLaura Dern and Ellen DeGeneres in an episode of ‘Ellen’\nIn 1997, Ellen DeGeneres made sitcom and television history when her character, Ellen Morgan, came out as a lesbian on her sitcom “Ellen,” making her one of the first main characters on a TV show to do so. Titled “The Puppy Episode” to keep the plot under wraps, the episode featured Ellen falling for another woman, played by Laura Dern, and eventually coming out to her—and an entire airport terminal—when she accidentally says, “I’m gay,” into a hot microphone at the gate.\nThe same week the episode aired, DeGeneres came out in real life in a Time magazine cover story and on Oprah Winfrey’s talk show (Oprah also made an appearance on “The Puppy Episode” as Ellen’s therapist). The joint coming-out moment became a national sensation: about 44 million viewers tuned into the sitcom episode, triple its regular viewership. Ellen, a mainstream celebrity with a girl-next-door reputation, shattered much of the public’s preconceptions about what a lesbian would look or act like.\nThere were consequences for DeGeneres’ subversive actions, however. Right-wing public figures like Jerry Falwell and Pat Robertson decried her identity, nicknaming her “Ellen Degenerate.” The “Ellen” production team received hate mail and bomb threats. The show was canceled the season after “The Puppy Episode” aired, following widespread backlash, and both DeGeneres and Dern were blacklisted from working for several years after.\nThe legacy of “The Puppy Episode” and DeGeneres’ publicly coming out far surpassed the backlash. A 2015 poll found that she influenced Americans’ views about LGBTQ+ rights more than any other public figure. DeGeneres won a Peabody Award for her performance in the episode and was awarded the Presidential Medal of Freedom by President Obama in 2016. And her role as an out gay lead on a sitcom would usher in a new era of queer representation on TV.\nNBC Inc.\n1998: The first gay male main character in sitcom history breaks into the mainstream with ‘Will & Grace’\nSean Hayes, Eric McCormack, and Debra Messing in an episode of ‘Will & Grace’\nThe impact of the popular sitcom “Will & Grace” on LGBTQ+ visibility in mainstream American culture has been well documented. In 2012, then-Vice President Joe Biden famously said he thought the show “probably did more to educate the American public than almost anything anybody’s ever done so far” while voicing his support for gay marriage on NBC’s “Meet the Press.” And in 2014, the Smithsonian National Museum of American History acquired props and scripts from the production of “Will & Grace” for its collection on LGBTQ+ history.\nThe show centered on two best friends living in New York City: Will, a gay lawyer, and Grace, a straight interior designer. Will’s friend Jack, another gay man, also features as a prominent character. The friends each find love throughout the series and start families of their own.\nWhile the show has been widely credited with endearing the American public to gay characters and shifting mindsets about LGBTQ+ people, many critics have noted the limitations of “Will & Grace.” For one, Will is a white, upper-class, attractive man who rarely discusses his sexuality and exists in a mostly straight world. His character was not representative of many members of the LGBTQ+ community and, to some, seemed specifically designed to be palatable and nonthreatening to straight audiences. Jack, on the other hand, was flamboyant and theater-obsessed. His stereotypical gayness served as the butt of jokes throughout the show, and he was often juxtaposed with Will for comedic effect.\nWhen “Will & Grace” was revived in 2017, many questioned whether the show still had a place on TV, considering how queer representation on TV had ballooned and diversified in the years since it originally aired. By 2017, more series than ever were showcasing an array of LGBTQ+ characters. While “Will & Grace” undoubtedly revolutionized LGBTQ+ representation in its time, its exclusive focus on the white, wealthy, cisgender, gay male experience has raised questions about its continued relevance.\nNetflix\n1999-present: LGBTQ+ representation on TV thrives—but not on sitcoms\nLaura Prepon, Dale Soules, and Taylor Schilling in an episode of ‘Orange Is the New Black’\nIn 1999, Entertainment Weekly declared the “death of the sitcom” amid the rise of sharper, less predictable dramedies and the diversification of TV formats, which coincided with the introduction of streaming services. While the sitcom did not disappear, the way Americans watched TV, and the kind of TV that became possible, fundamentally shifted during this time, drawing attention away from the traditional sitcom form.\n1999 was also the year that began what critics call “The Golden Age of Television.” Starting with “The Sopranos,” television became more cinematic, longer in form, and more serious in tone. Alongside these shifts, and on the heels of shows like “Will & Grace” and “Ellen,” LGBTQ+ characters began appearing more frequently and differently than ever before. “Queer as Folk” premiered in 2000, becoming the first TV show with a gay ensemble cast. In 2003—the same year that the Supreme Court case Lawrence v. Texas finally declared anti-sodomy laws unconstitutional—”Buffy the Vampire Slayer” aired TV’s first lesbian sex scene. “The L Word” premiered a year later, becoming the first television show with a lesbian ensemble cast.\nLGBTQ+ characters of color also started appearing on television—after decades of almost entirely white queer representation. “The Wire,” which debuted in 2002, featured what may be the first Black lesbian character on TV: Kima Greggs, a queer Black woman on the Baltimore police force. “The Wire” also introduced other complex queer Black characters, like Omar, a feared and respected openly gay stickup man, and Snoop, a butch lesbian involved in a formidable drug-dealing organization. In the years following “The Wire,” shows like “Orange Is the New Black,” “Glee,” “Transparent,” and “Pose” continued to expand the types of LGBTQ+ characters represented on TV.\nThese days, it’s not so much Norman Lear-style sitcoms that are spurring important cultural conversations about representation, bigotry, and inclusion. Instead, everything from dramas to adult animations offers new ways of looking at the world and expansive, diverse characters with stories to tell. There are still many “firsts” in queer representation to come, as well as seconds, thirds, and more.\nThe project of good representation, according to Deerwater, is to offer many stories, not just the “first.” She was reminded of an anecdote told by Lear, the king of sitcoms himself, about throwing pebbles into a lake. The water rises little by little as more pebbles get thrown in, but the only immediate change comes from small ripples produced when the stones hit the water.\n“I think that’s such a beautiful way of thinking about how television representation specifically can change the culture,” Deerwater said. “It can’t just be one pebble; it’s got to be many pebbles, and it might seem very slow, but the water will rise.”",
  "word_count": 4560,
  "scraped_at": "2026-02-14T12:05:38.956705"
}