{
  "article_id": "38073226de92",
  "url": "https://www.lankaweb.com/news/items/2025/08/13/gaza-conflict-sarvajana-balayas-response-i/",
  "title": "LankaWeb – Gaza conflict : Sarvajana Balaya response – I",
  "date": "20250814T123000Z",
  "domain": "lankaweb.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Gaza conflict: Sarvajana Balaya’s response – I\nPosted on August 13th, 2025\nby Rohana R. Wasala\nAccording to a news report carried in The Island of July 31, 2025, a group of senior representatives of the Sarvajana Balaya (SB) including its leader Dilith Jayaweera MP and Dr Channa Jayasumana had a meeting with Ihab Khalil, the Ambassador of the State of Palestine, two days earlier on Tuesday 29th. They called on the ambassador to communicate to him their condemnation of what they called the ‘Gaza genocide’ and to express ‘the deep and unwavering solidarity of the Sri Lankan people with the innocent civilians of Palestine, who continue to endure immense suffering and a prolonged and inhumane conflict’. The SB delegates expressed the party’s ‘grave concern over the humanitarian catastrophe in Gaza and the occupied Palestinian territories…. the deliberate targeting of civilian infrastructure……widespread displacement of families…systematic deprivation of basic necessities resulting in starvation…..which all constitute egregious violations of international law.’\nWhile condemning ‘these atrocities’, the SB called upon Israel to ‘immediately halt all military aggression, lift the illegal siege, and end the collective punishment of an entire population.’ It added: ‘The international community, especially a nation like Sri Lanka, cannot remain indifferent while innocent lives continue to be lost on a daily basis’.\nThe SB leader MP Dilith Jayaweera stated ‘We should leave all differences aside and unite to support Palestine against this genocide, while sending a strong message as a nation’. He further said that, ‘guided by the timeless principles of our civilizational values, the Sarvajana Balaya reaffirms its belief that it is the moral duty of all global leaders and nations to stand on the side of peace and humanity’. The SB’s appeal ended with the words: ‘At this critical juncture in world history, we call upon international institutions, human rights organisations, and all nations of conscience to act decisively and without delay.’\nWhat the SB’ers have done is a commendable thing, but subject to important reservations in my view. They have confirmed Sri Lanka’s existing and continuing friendship towards Palestine, while also expressing concern, on behalf of all Sri Lankans, about the avoidable human suffering that is being inflicted on innocent Palestinian civilians. SB’s appropriate appeal to the ‘international institutions, human rights organisations, and all nations of conscience to act decisively and without delay’ should have been supported by a stronger commitment to their own conscience, which is nothing if not ‘guided by the timeless principles of our civilizational values….’ (i.e., Buddhist moral and ethical values).\nMedia reports from Sri Lanka, especially independent social media reports, show that the majority of Sri Lankans, while helplessly watching on the suffering of the Palestinians with an overwhelming sense of human kindness, are equally concerned about the really genocidal hate directed at the innocent Israeli men, women and children. Why don’t the SB’ers recognise this? Was the shock and dismay they expressed during their meeting with the Palestinian ambassador concerning Palestinians a mere political act intended to win the hearts and minds of the local Muslim minority? Do they assume that the Jews, wherever they live, whether in Israel or elsewhere in the world, including the small number of Jews who live in Sri Lanka, and others who come as visitors, are not worth caring about? Do they believe that Sri Lanka’s foreign policy decisions regarding Muslim majority countries should not be otherwise than in accordance with the whims and fancies of some fundamentalists among the local Muslim community? By the same token, are SB’ers content with Indians interfering in Sri Lanka using the alleged Tamil minority issue as a false pretext?\nPrime Minister Narendra Modi of India is already mending fences with China; he is scheduled to attend the Shanghai Cooperation Organisation (SCO) summit due to be held from August 31 to September 1, 2025. President Donald Trump of America feels worried about this development, as Hindustan Times (July 8) revealed. What will be the plight of Sri Lanka when the current leaders of those countries who are kicking the island nation about like a football in the rough and tough game of geopolitics, go out of power in the course of time?\nThe last mentioned hazard is of particular relevance to the nearly 75% majority indigenous Sinhalese people of the country who are facing the same genocidal threat that the Jewish nation is facing in a different way. Incidentally, the global Jewish population is 15.7 million, according to Wikipedia, which is 0.2% of the global human population of 8 billion. These figures almost exactly match those for the global Sinhalese population, which is between 16-17 million. In Israel, Jews account for 73% of its nearly 10 million population, while in Sri Lanka, 75% of its nearly 22 million population comprise Sinhalese. There is a special unrevealed similarity between these two beseiged ancient peoples, except for one difference: the almost total diaspora status of the Jews across the globe after their ancient displacement from their original homeland of ‘the Land of Israel, also known as Palestine’;even today less than half of all the Jews live in modern Israel. In the case of the Sinhalese, though there is some global dispersion outside Sri Lanka (Ceylon/Sihale), their original homeland from time immemorial, almost the totality of the Sinhalese people still live there.\nDemographically, Jewish presence is much less marked than Muslim presence. Being a predominantly business community, Sri Lanka’s Muslims, in the past, used to lean more towards the rightist UNP at elections than towards the left of centre SLFP. It was under the latter party that Sri Lanka’s friendship with the Palestinians became more pronounced. Even a street in Ramallah in the State of Palestine was named after president Mahinda Rajapaksa of Sri Lanka in 2007 during his first term (2005-2010), which coincided with the beginning of the presidency of today’s incumbent Palestinian president Mahmoud Abbas, who was also sworn in the office, like Mahinda Rajapaksa, in 2005. Abbas is not a uniformly popular figure; his control over Palestine is tenuous. He can hardly deal with the Hamas militancy, which is a big stumbling block to resolving the Israeli Palestinian conflict. Sarvajana Balaya delegates should have done better homework before deciding to go on that peace mission.\nRelations between Sri Lanka and Palestine were repeatedly reaffirmed through mutual state visits and diplomatic exchanges between 2009 and 2014 (that is, during Rajapaksa’s second term). Having said that, it must be emphasized that this connection is not based exclusively on Sri Lanka’s current Muslim demography. Ceylon’s links with the Arabs in West Asia predates the birth of Islam in the seventh century CE. Jews also had as ancient a friendly presence in the land of the Sinhalese (Ceylon) as traders, according to the island’s historical records.\nActually, in modern times, Ceylonese (Sri Lankan) collaboration with Israel started more than a quarter century before Lankan diplomatic relations with Palestine began in 1975 with the opening up of an embassy by the Palestine Liberation Organisation (PLO) in Colombo. On the other hand, the State of Israel was founded on May 14, 1948 by the British as envisaged in the Balfour Declaration of 1917. This was just over two months after Sri Lanka gained its own independence from Britain on February 4. Whereas most of its neighbours refused to recognise or support Israel then, Sri Lanka under its first prime minister D.S. Senanayake did recognise the Jewish state and started buying weapons from it, including the River-Class navy frigate HMCyS Gajabahu, later named SLNS Gajabahu (Source: Wikipedia).\nSarvajana Balaya’s message of solidarity delivered to the Palestine ambassador on behalf of all Sri Lankans would have sounded more sincere if it had been less judgemental towards Israel. The SB representatives didn’t care or dare to make the faintest reference to Israel, let alone invoke, for humanity’s sake, the abhorrent memory of the horrendous genocidal raid by heavily armed Hamas terrorists on innocent Israeli civilians, still asleep, on that early morning of October 7, 2023. For the SB’s message of solidarity to be of any potential value for global peacemaking efforts in this conflict zone, its unequivocal denunciation of Israel should have been balanced by a similarly unambiguous condemnation of the horrific Hamas terrorism that provoked the massive Israeli military operations in Gaza that continue to this day.\nImportant caveat:\nI have the highest respect for the great Palestinian people, and recognize their sovereignty and independence. I fully empathise with them over their undeserved suffering. I equally well recognize and respect the great people of Israel, the only democratic nation in the region, and deeply empathise with them over the miseries inflicted on them by terrorists. As a senior Sri Lankan of cosmopolitan views, rooted in the Sinhalese Buddhist culture which has a natural resonance with cosmopolitanism, it is my sincere and fervent hope to see these two great nations (Israeli Jews and Palestinian Arabs) living peacefully side by side as gracious neighbours in the near future.",
  "word_count": 1489,
  "scraped_at": "2026-02-14T12:12:22.903392"
}