{
  "article_id": "380fa4fa5375",
  "url": "https://www.90min.com/posts/how-chelsea-made-vital-use-of-squad-depth-in-women-fa-cup-quarter-final-win",
  "title": "How Chelsea made vital use of squad depth in Women FA Cup quarter - final win",
  "date": "20230320T144500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "How Chelsea made vital use of squad depth in Women's FA Cup quarter-final win\nChelsea were able to successfully navigate the quarter-finals of the Women’s FA Cup on Sunday and also still rest a number of key players as a busy March continues.\nThe trip to Reading proved to be a relatively comfortable 3-1 victory that underlined the importance of squad depth for any club wanting to compete on multiple fronts.\nGoals from Jess Carter and Maren Mjelde, the latter from the penalty spot, arguably had the game wrapped up by half-time. Guro Reiten then added a third early in the second half. But while Reading had a first half goal disallowed because of an offside flag and did later pull one back through Sanne Troelsgaard, Chelsea were never truly in danger.\nThis was a fourth game for Chelsea since 5 March. With three more still to come this month and another right at the start of April, the Blues will have played eight times in 29 days across four different competitions by the time this particular run of fixtures comes to an end.\nMarch began with the disappointment of a Conti Cup final defeat to Arsenal, before back-to-back WSL wins over Brighton and Manchester United put Chelsea top of the league and firmly in the driving seat as far as the title race in concerned. Beating Reading means a place in the FA Cup semi-finals and the possibility of winning that competition three times in a row.\nNext up is a huge Champions League quarter-final clash with Lyon on Wednesday, followed by a crunch trip to Manchester City on Women’s Football Weekend and then the return of Lyon. A final WSL trip to Aston Villa to start April finishes things off before the international break.\nEmma Hayes already spoke about the importance of depth after seeing off Manchester United in last weekend’s narrow win at Kingsmeadow. With Lyon on the immediate horizon, she was able to leave Sam Kerr, Lauren James and Kadeisha Buchanan on the bench against Reading. Melanie Leupolz also only played the final 10 minutes, while Reiten was withdrawn after 65 minutes.\nHayes even managed to hand senior Chelsea debuts to Ashanti Akpan, Cerys Brown and Reanna Blades, with fellow youngster Aimee Claypole also building on her recent WSL debut.\n“It’s great we can get our youngsters on,” Hayes said to club media. “They’re in training with us as often as they can, and it makes games like this easier. They’re building trust with their team. It was the right opportunity today to utilise them considering the games we’ve got coming up.”",
  "word_count": 436,
  "scraped_at": "2026-02-14T12:21:19.223240"
}