{
  "article_id": "381e435d281c",
  "url": "https://metro.co.uk/2023/08/26/spanish-fa-accuse-jenni-hermoso-of-lying-over-kiss-at-womens-world-cup-final-19399351/",
  "title": "Spanish FA accuse Jenni Hermoso of lying over kiss at Women World Cup final",
  "date": "20230826T100000Z",
  "domain": "metro.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Spanish Football Federation has accused Jenni Hermoso of lying after she claimed that she did not consent to being kissed by Luis Rubiales after the Women’s World Cup final.\nRubiales was expected to resign as president of the Spanish Football Federation (RFEF) following his conduct during Spain’s victory over England in last Sunday’s final, but in a defiant press conference on Friday, the 46-year-old vowed that he will not step down from his role and instead claimed that he is the victim of ‘social murder’ and ‘false feminism’.\nIn her statement released after Rubiales’ press conference, Hermoso said: ‘I want to clarify, that at no time did I consent to the kiss.\n‘I don’t tolerate that my word is questioned, much less that words are invented that I haven’t said.’\nSpain’s players are refusing to represent their national team until Rubiales is removed from his role, while they have also received a message of support from the Lionesses.\nBut the Spanish FA have now released a statement which accuses Hermoso of encouraging contact from Rubiales during the World Cup medal ceremony and have included images which they believe shows ‘conclusive evidence’ that Rubiales ‘has not lied’.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nThe statement from the Spanish FA read: ‘The Royal Spanish Football Federation has learned of the statement made public by the Futpro union in relation to the intervention of the President of the RFEF, Mr. Luis Rubiales, on the occasion of the Extraordinary Assembly of the RFEF.\n‘In the union’s note, it is said to speak on behalf of Mrs. Jennifer Hermoso and some statements by the player are attributed to her that are in quotation marks, implying that they have been pronounced by her.\n‘The RFEF wishes to inform that the competent bodies of the RFEF that are processing the complaints filed with the Federation have tried to contact Ms. Jennifer Hermoso, having been unsuccessful at all times.\n‘The RFEF announces the presentation of as many legal actions as may correspond in defense of the honorability of the President of the RFEF, who has exposed in a clear and simple way how the events that are the cause of conflict and ridicule on the part of broad sectors of the society occurred. society against Mr. President.\n‘The note says (quotation marks attributed to Mrs. Jennifer Hermoso): “I want to clarify that, as seen in the images, at no time did I consent to the kiss he gave me and of course in no case did I seek to raise the president . I do not tolerate that my word is questioned, much less that words are invented that I have not said.\n‘In a rule of law, as the president has defended, opinions are countered with facts and evidence and lies are rebutted in court.\n‘The president of the RFEF has wanted to take this issue with the utmost respect for the players and the institutions and only when an unassumable red line has been crossed has he come out publicly to give his version of the facts.\n‘The President’s version of events is verified in the internal files that have been opened, and to date Mrs. Jennifer Hermoso has not responded to any of the requests made.\n‘The first demonstration that the facts exposed by Mr. President are absolutely true and that he is not lying, we are going to begin to provide them in this statement with accompanying images.\n‘Photo 1: Ms. Jennifer Hermoso, with her arms, grabs the RFEF President from behind, while Mr. President has his arms loose on the upper part of the player’s back. Therefore, no force could exert.\n‘You can see how Mr. President has the heels of his feet raised slightly.\n‘Photo 2: Ms. Jennifer Hermoso keeps her arms around Mr. President’s back. Mr. President keeps his arms on top of the player’s body.\n‘It is verified how Mr. President already has much higher heels.\n‘Photo 3: Ms. Jennifer Hermoso continues to keep her arms in the same position as the president’s body while the president must bring his arms closer to the player’s back as a result of having lifted him off the ground and to maintain balance.\n‘The inclination of the back of Mrs. Jennifer Hermoso that occurs when she is performing an action of force is indisputable.\n‘Mr. President’s feet are clearly and manifestly lifted off the ground as a result of the action of force carried out by the player.\n‘Photo 4: Mrs. Jennifer Hermoso continues to keep her arms in the same position as the president’s body while the president must continue to hold on to the players so as not to fall and it is evident that the arching of the player’s body corresponds to the lifting force of Mr. President you are performing.\n‘The feet of Mr. President are ostensibly raised off the ground as a result of the player’s action.\n‘The evidence is conclusive. Mr. President has not lied.\n‘The RFEF and Mr. President will demonstrate each of the lies that are spread either by someone on behalf of the player or, if applicable, by the player herself.\nMore Trending\n‘The RFEF and the President, given the seriousness of the content of the press release from the Futpro Union, will initiate the corresponding legal actions.\n‘The RFEF regrets that after such an extraordinary sporting success as the one that occurred in the Soccer World Championship, it cannot be celebrated as the situation and success deserves for completely non-sports reasons.\n‘In any case, and how can it be otherwise, the RFEF respects as it has respected at all times the decisions of the players who want to participate or not with the Spanish team in international matches, although it records that participation in the selection is an obligation of all the federated people if they are called for it.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.",
  "word_count": 1047,
  "scraped_at": "2026-02-14T13:04:06.924747"
}