{
  "article_id": "382150fe1001",
  "url": "https://pina.com.fj/2023/06/20/stage-set-for-future-stars-to-shine-at-ofc-u-19-womens-championship-2023/",
  "title": "Stage set for future stars to shine at OFC U - 19 Women Championship 2023",
  "date": "20230620T023000Z",
  "domain": "pina.com.fj",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Fiji will play host to the OFC U-19 Women’s Championship 2023, kicking off this week. Ten nations from across the region will compete across three groups (one of four teams, two of three) to be crowned champions.\nOff the back of a hugely successful inaugural OFC Women’s Champions League in Papua New Guinea, women’s football is again in the spotlight as the region’s brightest young talents meet for the first time since the 2019 championship.\nNew Zealand will be looking to defend the title they won in 2019, where a 5-2 victory over New Caledonia in the Cook Islands saw them clinch their 7th championship. Also on offer for the tournament winners is a qualification place in the 2024 FIFA U-20 Women’s World Cup.\nOFC U-19 Women’s Championship 2023 will be Fiji’s first time as hosts, with the championship returning following a Covid-enforced cancellation in 2021.\nMatches will be played at both Churchill Park in Lautoka and HFC Bank Stadium in Suva, with the latter hosting the tournament from the knockout onwards. Both stadiums offer world-class facilities, regularly hosting football and top-level rugby, with both venues playing host to Super Rugby franchise, Fijian Drua.\nWomen’s football in the country has continued to grow considerably in recent years, with the national side finishing runners-up in consecutive OFC Women’s Nations Cups, as well as three third-place campaigns in the Pacific Games.\nOn the domestic front, 2021 saw the establishment of the Digicel Women’s Super League, a six-team top-tier league with a senior division of 12 sides operating the level below.\nThe creation of the Super League and Labasa’s participation in the just completed OFC Women’s Champions League are positive signs as Fiji builds towards the goal of the women’s national side qualifying for a FIFA Women’s World Cup, having just missed out in 2018 and 2022.\nFiji narrowly failed to qualify for the knockout stages in the OFC U-19 Women’s Championship in 2019, finishing second in their group only on goal difference, and a strong showing in 2017 saw them finish second in the then round-robin competition format.\nThe History\n2019 was the last time this competition was held, with Cook Islands playing host as New Zealand took home the trophy for the 7th time.\nThe format of the competition itself has fluctuated in recent years, with 2019 being the first time since 2006 that a knockout phase was in operation. Both under the U-19 and U-20 age categories, a round-robin format has been the preferred tournament structure but this year sees a continuation of the group stage/knockout phase format.\nWhilst New Zealand have dominated the tournament, with a record seven victories, an impressive six unique nations have finished in the runners-up spot, with Papua New Guinea the only country to finish second on more than one occasion. The Kiwis victory over New Caledonia in 2019 was the narrowest winning margin the tournament has seen so far, as Oceania continues to produce more and more quality players across the Pacific.\nAn additional incentive – if needed – is the guaranteed qualification for the FIFA U-20 Women’s World Cup that awaits the winners!\nThe group stage and knockout format continues from 2019, with the ten nations divided between three groups – one of four and two of three – with group winners and runners-up qualifying for the next round, alongside the two best third-placed sides.\nHolders New Zealand face a tricky group stage assignment as they bid to retain their crown, drawn into Group B alongside hosts Fiji and Papua New Guinea. Whilst they will be confident of progressing to the next stage, the Kiwis will want to ensure topping the section in what should prove to be a fiercely contested pool.\nHosts Fiji will go into their campaign with confidence. They narrowly missed out on advancing past the group stage in 2019 – despite two wins from their three matches – but were tournament runners-up in 2017 and will be setting their sights on at least a knockout round appearance in front of their passionate home fans.\nAlongside Fiji and 2019 finalists New Caledonia, Papua New Guinea represent another potential challenger in this years’ tournament. The Lakatois have finished second on three occasions, though never when the competition has been contested with a knockout round format.\nNew Caledonia however will be strongly fancied, with a number of the squad having just tasted success with domestic side AS Academy Féminine at the OFC Women’s Champions League in Papua New Guinea.\nIn what promises to be an unprecedented year of excitement for women’s football in the Pacific with the 2023 FIFA Women’s World Cup being co-hosted by New Zealand and Australia, the OFC U-19 Women’s Championship 2023 comes at the perfect time to showcase the next generation of women’s footballing talent.\nSOURCE: OFC/PACNEWS",
  "word_count": 799,
  "scraped_at": "2026-02-14T12:39:20.317802"
}