{
  "article_id": "3826f1af980b",
  "url": "https://www.americanbanker.com/news/legacy-of-jackie-robinsons-freedom-bank-lives-on-today",
  "title": "Legacy of Jackie Robinson Freedom Bank lives on today",
  "date": "20230209T181500Z",
  "domain": "americanbanker.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Toward the end of his life, Jackie Robinson faced a decision about whether to share \"the behind-the-scenes story\" of Freedom National Bank in his autobiography, he wrote.\nIn the book published the year of Robinson's untimely death in 1972 from a heart attack at 53 years old and written with a frequent collaborator, Martin Luther King Jr. speechwriter Alfred Duckett, the retired baseball legend said that there were \"two schools of thought\" among his family, friends and business associates on divulging how the pioneering bank \"narrowly averted a major crisis.\" Robinson ultimately decided that a frank recounting of Freedom Bank's challenges, alongside its triumphs, was too important to be left out of the chronicle of his life.\n\"As it is probably quite obvious, the telling of this episode in my personal and business life is painful to relate,\" he said. \"I suppose I take the chance of being misunderstood for telling it. I have told it because I feel there are lessons to be learned from it by many people — Black and white.\"\nFreedom National Bank\nBut the legacy of Robinson and other Black entrepreneurs who have fought against America's\nRobinson's goals for the Freedom Bank inspire many current financial professionals starting their own firms and removing barriers to wealth and rewarding careers in the industry.\n\"He's a testament to the multifaceted life that many of us can live,\" said Andre Jean-Pierre of\n\"It makes me so proud,\" said Anna N'Jie-Konte of\nBlack-owned banks and the wealth gap\nThe number of Black-owned banks in America shrunk by more than 50% in the past two decades, even as Native American, Hispanic and Asian American minority depository institutions have added to their ranks over that span,\nThe\nDisparities that motivated people like Robinson and Joseph Davis, the co-founder of the Harlem-based savings and loan association that became today's\nBlack Americans have less than 15% of the average household net worth of white families,\nOutright discriminatory practices in the financial industry continue to this day, a reminder of the legacy of redlining and other residential segregation so closely linked to the wealth gap. Last month, under\nMinority depository institutions and a similar category of banks called\n\"Expanding access to capital for Black banks and other financial institutions targeting underserved neighborhoods, particularly during a crisis, can help spur home and business lending to Black families and bring much-needed economic development to communities of color,\" wrote the report's author, Michael Neal. \"Public policies that support CDFIs would increase mortgage and small business loans to many Black communities and other historically underserved areas on a larger scale.\"\n\"We are approaching our 75th anniversary, which is very exciting for us,\" CEO Michael Pugh said in an interview. \"As a minority depository institution, being around for 75 years and especially a Black-owned, Black-managed financial institution, we've seen over the years a precipitous decline in those institutions primarily because of lack of capital. Customers that have historically supported the financial institutions were largely attracted to the much larger financial institutions because of their technology, access in terms of number of locations, et cetera.\"\nJackie the businessman\nFreedom Bank\nRobinson's autobiography \"I Never Had it Made,\" reveals the complicated history of his political efforts and relationships with icons such as King, Malcolm X and Paul Robeson. It also shows how his experience in baseball informed his knowledge of the power of money.\n\"Money is America's God, and business people can dig Black power if it coincides with green power,\" Robinson wrote in the preface.\nHe recalled the influx of fans and ticket sales at Ebbets Field and around Major League Baseball after he debuted with the Brooklyn Dodgers in 1947.\nThe title of Robinson's autobiography reflected \"the one irrefutable fact of my life\" as \"a Black man in a white world,\" he said at the end. He wrote that he had become \"bitterly disillusioned\" with America amid the Vietnam War, rising drug addiction that had\nDespite his skepticism and many health problems near the end of his life, Robinson spent much of his final decade at the bank between writing syndicated columns, counseling Rockefeller and speeches such as his\nRobinson wrote that a \"most impressive\" quote by Malcolm X summed up why he wanted his own business enterprises.\n\"Referring to some college students who were fighting to be served in Jim Crow restaurants, Malcolm said he wanted not only the cup of coffee but also the cup and saucer, the counter, the store and the land on which the restaurant stood,\" he said. \"I believed Blacks ought to become producers, manufacturers, developers and creators of businesses, providers of jobs.\"\nPrior to helping launch Freedom Bank, Robinson had broken another major barrier by becoming the first Black officer-level executive at a major American corporation as the vice president of personnel with\nHis other business ventures included real estate investments, a life insurance firm, a construction company and, his son David\nHis father's businesses were \"his continuation of a role of trying to achieve social development for the African-American community, and for America as a nation,\" David Robinson told Forbes. \"There's really no separation between his objectives in baseball and his objectives in his further life, in politics and business.\"\nNew York's Jackie Robinson Museum\nFreedom Bank \"provided financing and other support for African Americans who [were] discriminated against by mainstream banks,\" according to a timeline of Robinson's life. However, some\nThe bank was \"probably one of his major post-baseball achievements,\" Rachel Robinson said in an interview video that runs in the business section of the museum.\n\"It meant a lot to Jack to be able to bring that kind of economic development tool into Harlem, because people could get mortgages, small businesses could begin to get loans,\" she said. \"And there were just so many ramifications of that, that he agonized over that bank. Oh, did he agonize over it. Anything that he thought was going wrong worried him because it was important for them to succeed in that.\"\nRobinson and other members of the organizing committee appointed Carver Chairman William R. Hudgins to be the first president of Freedom Bank. Roughly a year after its founding with a capitalization of $1.5 million, Freedom Bank reached a valuation of $9 million and had issued $300,000 in loans to small businesses, according to Robinson's autobiography. In 1966, Freedom National opened a second branch in Brooklyn's Bedford-Stuyvesant neighborhood.\nIn the chapter of the autobiography devoted to Freedom Bank, Robinson recalled that Hudgins worked so hard in the role that the bank's directors \"feared he was seriously jeopardizing his health with the energy and industry which he applied.\"\n\"The growth of Freedom also did much to ease the problem New York City blacks have had for years in getting mortgage credit,\" Robinson wrote. \"As Carver President Joe Davis once said, 'Where there is a lack of mortgage credit, there is no money to improve the ghetto, no money to get out of the ghetto.'\"\nAt the time of its closing in 1990, the bank represented the fourth-largest Black-owned bank in the country with $101.9 million in assets, the Knight-Ridder News Service\n\"Since its founding in 1964, Freedom has served as the financial backbone of the Harlem community at a time when few other institutions showed much interest in doing business there,\" longtime Harlem resident and then-Mayor David Dinkins told the outlet.\nRobinson's autobiography contains a quote about the bank from Clarence Funnyé, the chairman of the Congress of Racial Equality (CORE) in Harlem.\n\"Before Freedom National, you went into the white bank with the distinct impression you went with what you had in your hand, begging the powers that be, and generally you were turned down,\" he said. \"With Freedom, the community looks less like a colony, less of an area for exploitation.\"\nInvesting in the area today\nThe financial landscape of Harlem looks much different these days, with the Magic Johnson Theater sitting close to the former site of Freedom Bank and giants like JPMorgan Chase and\nOn the national level, protests after the murder of George Floyd in 2020 prompted\nGreenwood, a digital banking service for Black and Latino customers that was co-founded by the rapper Killer Mike and named after Tulsa's Black Wall Street,\nJPMorgan has\nI believed Blacks ought to become producers, manufacturers, developers and creators of businesses, providers of jobs.\nChase opens spaces in such branches in Harlem and cities like Chicago, Houston and Miami for skills and training classes led by area organizations and other educational programming. It has at least 10 other branch locations in Harlem, where Chase has had a presence for decades.\nJPMorgan has held free educational seminars in several cities on \"how to build wealth, particularly among women of color,\" according to Simmons, who said that the meetings \"are not about working with JPMorgan\" but rather helping to educate investors.\n\"Access to capital and access to resources is extremely critical to the work that we do from a wealth management perspective,\" Simmons said. \"If you think about the wealth management business, many people are not aware of their opportunity to actually start investing.\"\nJean-Pierre, a financial advisor who's a former college football star, lives in Harlem near 125th Street.\nBesides\n\"My vision for the future is to bring on minority advisors who are kind of thrown by the wayside by the traditional wirehouses,\" said Jean-Pierre, who is Haitian American. \"All of my staff will be CFPs in the future because I remember when I wanted someone to invest in me and no one would. I'm going to invest in them and feed that fire, so that they can become the best that they can be.\"\nLike Jean-Pierre, N'Jie-Konte started her career with a large firm before launching her own RIA. She has a couple of current clients who live in Harlem after living in the area herself by 135th Street, another one of the neighborhood's historic thoroughfares, for two years.\nUnlike some large wealth management firms, N'Jie-Konte has no minimum client account size because she \"felt really called to serve a different demographic\" than the high net worth customers earlier in her career. N'Jie-Konte, who is Puerto Rican and Gambian American, said that half of her clients are single women and the other half are either same-sex couples or husbands and wives in which the \"men are nonexistent or in the background.\"\nShe expressed admiration for advisors who utilize technology, group coaching, podcasts or other methods of boosting financial education beyond their client bases.\n\"They're looking at different business models, and they're figuring out a way to help people in different avenues and meet people where they are,\" N'Jie-Konte said.\nCarver Bank is carrying out its own expansion plans through its collaborations. Under a strategic partnership with Wells Fargo and JPMorgan, its customers can use some 70,000 ATMs without fees. Through a commercial lending program in concert with a New Jersey-based regional institution, Valley National Bank, Carver can provide larger business loans that might otherwise be outside its capacity.\nFor a microloan program aimed at female and minority entrepreneurs who \"may have thin credit or no credit,\" Carver worked with a tech company on a tool that assesses their creditworthiness through alternative criteria such as rent or phone payments, Pugh said.\nIn an interview in the bank's headquarters above the hubbub of the Metro-North Railroad and East 125th street, Pugh spoke reverently about the legacies of Carver legends like Davis and Hudgins. After starting with as little as $250,000, Carver had issued about $30 million in mortgages to 3,000 households by 1962, according to Pugh.\n\"What they tried to accomplish — in fact did accomplish — was something that was groundbreaking,\" he said. \"They understood the important part of what we're talking about, which is equity and wealth generation really starts through ownership in something that appreciates. And when we think historically about how that has happened within our nation, we know it's through homeownership and small businesses.\"\nFreedom Bank's fate\nWith those goals on the mind of Robinson and Freedom Bank's other founders, the bank had opened its doors after a \"long and sometimes stormy period of organization,\"\nFreedom Bank also faced some distrust in Harlem, after the example of a foray by John D. Rockefeller Jr. into the area in the late 1920s with the Dunbar National Bank, according to law professor Mehrsa Baradaran's book, \"\nRobinson and Hudgins took charge of Freedom Bank, where the president and the board would eventually come into conflict. Meanwhile, Robinson found himself stuck between the paternalism of the white banking community and the pressure of aiding long-ignored customers.\nHe had \"served in a segregated military, single-handedly integrated Major League Baseball, and was a civil rights activist within the GOP, and he believed his most challenging struggle was running a Black bank,\" Baradaran wrote. \"Because Harlem saw Freedom as 'our bank,' Harlem did not treat it like any other business. This conflict was as old as Black banking, but Robinson was very troubled by his position.\"\nProblems with the bank's loans plagued it most of all. A few years after the launch of Freedom Bank, Robinson wrote that he \"began to get worried about the large amounts of money we were writing off in bad loans\" and grew concerned that the bank had shown a \"tendency to favor friends on the basis that one can trust one's friends in business — an utterly risky philosophy.\"\nThe bank turned into \"a major preoccupation\" that kept Robinson up nights and instigated \"a very serious health crisis\" involving constricted breathing and pains in his legs. He and Hudgins disagreed about the extent of the troubles with the bank's loan portfolio, which was the episode that Robinson said was painful to discuss. Hudgins \"was respected by many in the community,\" and no one could say \"in fairness\" that he had done anything illegal or dishonest, he wrote.\nIn the end, Robinson and other members of the board removed Hudgins as president but retained him as vice chairman. The bank replaced him with Bob Boyd, an athlete-turned-entrepreneur who Robinson wrote had \"tightened up procedures throughout the bank.\"\nTwo years after Robinson's death, though, the bank would bring in a new president after Boyd's resignation. Freedom Bank tapped a 38-year-old vice president in Chase's corporate banking department named Hughlyn F. Fierce, who\n\"The combination of people with finance backgrounds, coupled with our present board with backgrounds in real estate and local business ventures, will help us develop the kind of sound financial policy that will benefit the Greater New York area in general and Harlem and Bed-Stuy in particular,\" Fierce told the newspaper.\nFreedom Bank was turning \"a small profit\" by the early 1980s after receiving a backstop in the form of an investment of $3.7 million from a group of \"major banks,\"\nOver 11% of loans were either in default or far behind in payment at a time of national recession when parts of the city had yet to climb fully out of a long economic slump. Sharnia \"Tab\" Buford, the bank's president from 1979 to 1987, explained the difficulties.\n\"I tried to balance loans with the community — often time-consuming loans that weren't really that profitable — with loans to major corporations,\" he told the Times. \"In the minority community, most often we didn't have certified financial statements and other means of checking creditworthiness, so we did a great deal of lending with our hearts, which is risky.\"\nThe bank sustained losses of $4.7 million in the prior two years, on its way to another expected decline of $2 million in 1990, according to\n\"My concern isn't about my money,\" a New York Telephone employee in queue named Lisa Johnson told Knight-Ridder. \"It's about my community. You close down this bank, you're taking out the only bank that keeps its money in the community.\"\nAn effort the following year\nIn his autobiography, Robinson wrote that some of his closest family, friends and business associates had warned him against sharing the full inside story of his time with the bank.\n\"Today, since we have successfully weathered the storm, some people think that it will do damage to public confidence in us to talk about the danger we confronted and overcame,\" he wrote. \"I have given a great deal of thought to that point of view because I love the bank and what it has achieved and would not want to hurt it. But I think there are vital lessons to be learned by telling frankly what happened to us and why. I think that my own ego or that of any other individual is not as important as the need for maturity and stability in Black business.\"",
  "word_count": 2787,
  "scraped_at": "2026-02-14T12:39:15.846119"
}