{
  "article_id": "384398c69df1",
  "url": "https://theathletic.com/4891708/2023/09/24/lucy-bronze-england-bonuses-2/",
  "title": "Lucy Bronze on England bonuses resolution :  We want to help other countries set the standard  ",
  "date": "20230924T080000Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "England defender Lucy Bronze has expressed her relief at a deal on bonuses and back pay being struck with the Football Association (FA) after months of negotiations.\nBronze is part of the senior leadership team who have been leading discussions for over a year, with the squad publicly announcing before this summer’s World Cup that they were stopping talks until after that tournament and revealing frustration that they had not been able to reach an agreement.\nAdvertisement\nThe Lionesses wanted to be paid a performance bonus on top of a payment from the association mandated by FIFA, which captain Millie Bright announced had been agreed on Thursday.\nConversations are ongoing over a new commercial agreement, which will dictate how England players’ sponsorship agreements intersect with their international commitments, among other issues.\nSpeaking after England’s 2-1 win over Scotland in Sunderland, Bronze explained the team’s motivations behind seeking the deal.\n“We’re happy to have been able to draw a line on the bonuses and previous stuff and move forward with the FA and the PFA, making sure that we were challenging women’s football,” she said.\n“We want to set the standard on and off the pitch to help other countries be able to set the standard. I think it’s something that the USA have been doing for many years, and now England are a team that are able to lead the way as well.”\nBronze scored the opening goal of the match, which was England’s first-ever fixture in the new Women’s Nations League (WNL). Lauren Hemp’s header gave England a 2-0 lead, before Caroline Hanson’s goal just before half-time ensured Sarina Wiegman’s side would have to fight hard for victory.\nEngland held out to win 2-1.\nThey play the Netherlands in Utrecht on Tuesday in their second fixture. Performances in the competition will dictate qualification for both the 2025 European Championships and the 2024 Olympics.\n(Photo: Lewis Storey/Getty Images)",
  "word_count": 318,
  "scraped_at": "2026-02-14T13:03:48.693761"
}