{
  "article_id": "386340dfecd7",
  "url": "https://www.easternriverinachronicle.com.au/story/8641061/barcelona-beat-lyon-to-end-ellie-carpenter-triple-dream/?cs=6364",
  "title": "Barcelona beat Lyon to end Ellie Carpenter triple dream",
  "date": "20240525T200000Z",
  "domain": "easternriverinachronicle.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Ellie Carpenter's dreams of winning a third Women's Champions League title - but this time while actually on the pitch - has been scuppered by Barcelona, who beat her Lyon side 2-0 in the final in Bilbao.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe Australian international fullback Carpenter had been an unused sub in the 2019-20 final, and tore the ACL in her left knee after just 12 minutes when the French giants Lyon beat Barcelona in 2022.\nBut having reflected on desperately wanting to play a full part in another triumph for European women's football's most successful club, the 24-year-old Matilda was left frustrated, unable to make it \"third time lucky\" as Barca won their third title in four years on Saturday.\nCarpenter did get her wish to play the full 90 minutes but it was a trying night at the back for Lyon, who were probed constantly by a side inspired by their Ballon d'Or winner Aitana Bonmati.\nBonmati, the best player in Spain's World Cup triumph in Australia, was again instrumental in the win, scoring superbly in the second half.\nAnd her predecessor as the world's No.1 player Alexia Putellas added the second deep into stoppage time, allowing Barca to celebrate after losing their two previous finals against the eight-time winners.\nThe Catalan club had never won in four previous matches against Lyon, which remains the most successful club in the women's game with eight European trophies.\nIn front of a record crowd of 50,827 for the final, Barcelona became the third club with three Women's Champions League titles, behind Lyon's haul and the four won by Eintracht Frankfurt.\nThe victory also just cemented how the Spanish club, in a fourth straight final, have taken over from Barcelona as the dominant club in the women's game\nIn their 11th final in 15 seasons, the French side were undone by the brilliance of player of the match Bonmati, who powered through for the key opening goal in the 63rd minute, firing past Lyon keeper Endler with a shot that deflected off Lyon defender Vanessa Gilles' leg.\nPutellas, who like Carpenter has bounced back from a ruptured ACL, got a rousing reception when she came on in the third minute of stoppage time, and the cheers got even louder as she scored within three minutes for Barca's perfect finale.\nAustralian Associated Press",
  "word_count": 397,
  "scraped_at": "2026-02-14T12:52:22.825177"
}