{
  "article_id": "3867693ceec0",
  "url": "https://www.somersetlive.co.uk/news/somerset-news/wellington-wildcats-girls-team-celebrates-9665449",
  "title": "Wellington Wildcats girl team celebrates new season with Bloor Homes sponsorship",
  "date": "20241026T113000Z",
  "domain": "somersetlive.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Wellington Wildcats girls’ team celebrates new season with Bloor Homes sponsorship\nBloor Homes backs youth sports, equipping Wildcats U13s with new kits for 2024 season\nThe Wellington Wildcats U13s girls’ team is purring with excitement in their brand-new kits this season thanks to Bloor Homes.\nThe developer is currently building new three and four bedroom homes at The Meadows in Cullompton.\nA local Bloor Homes site manager, Jason Lockyer, who also coaches the Wildcats as his daughter plays for them, asked the developer for support.\nFormed in 1892, Wellington AFC runs more than thirty teams across the areas of adult men’s and women’s football as well as youth teams for boys and girls which gives players the opportunity to play football from the ages of seven to eighteen and beyond.\nJason Lockyer, site manager at Bloor Homes Exeter, is a coach at Wellington AFC and father to one of the players on the Wellington Wildcats U13 girls team. He described the importance of sponsorship for local community teams, saying: “The donation from Bloor Homes means the girls can play in brand new kits and feel the support of the company as they take on the 2024/25 season. It’s brilliant to see the growth of women’s football all over the country, and we’re eager to keep up the momentum at Wellington FC ahead of the Women’s Euros in 2025, and encourage as many girls as we can to feel confident to join the sport and play in their local team.”\nSteph Ubl, sales manager at Bloor Homes Exeter, said: “We love any opportunity to support the local organisations that improve the lives of those living in and around the communities of our developments, especially when their work empowers young people. Through our sponsorship of the Wellington Wildcats U13s girls’ team, Bloor Homes is eager to support the growth of women’s football and contribute to the momentum from the England Lionesses achievements in the past few years. Good luck to the girls in the Wellington Wildcats U13s team this season, we’re all behind you.”\nThe Meadows in Cullompton is located on Blackthorn Way off Willand Road, 12 miles from the town of Wellington, and is open daily for visits and showhome tours from 10am-5pm.",
  "word_count": 372,
  "scraped_at": "2026-02-14T13:05:30.255844"
}