{
  "article_id": "38984e07035d",
  "url": "https://thenationonlineng.net/simply-the-best/",
  "title": "Simply the best - The Nation Newspaper",
  "date": "20231217T063000Z",
  "domain": "thenationonlineng.net",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Editorial\nDecember 17, 2023 by Our Reporter\nSimply the best\n- Osimhen, Asisat, Chiamaka and Super Falcons wins upend our tribal and religious covens\nThe 2023 Confederation of African Football (CAF) awards in Marakeesh, Morocco, brought with it the much needed elixir for Nigerians, as only the beautiful game of football can. In that moment when the awards were given, Nigerians characteristically were united in their joy and the silent and loud applauses were seemingly heard in the orthodox and social media globally and on the streets of Nigerian cities and villages.\nVictor Osimhen (MFR), the Nigerian golden boy of Serie A club, Napoli, and one of the best strikers in the world was crowned the African Footballer of the Year, an award coming after 25 years of Kanu Nwankwo’s win in 1999 when Victor was barely one year old.\nAsisat Lamina Oshoala (MON), Nigeria’s ‘Agba Baller’ won her historic sixth title as African Female Footballer of the Year. Super Falcons goalkeeper, Chiamaka Nnadozie, won the Best Female Goalkeeper in Africa while the Super Falcons won the Best Female National Team in Africa.\nFor a country that seems to have been divided by the antics of politicians in the 2023 general elections that saw some politicians sounding the ethnic and religious gongs, the victory of these three football players appears like a balm on the wounds inflicted by divisive politics.\nThe national jubilation that followed these highly coveted continental awards, both within and outside the country, points to the value of sports in national unity and integration. It didn’t matter that Osimhen is from Edo State, Oshoala from Lagos State and Nnadozie from Imo State. They are all Nigerians doing their best in the game of football and every Nigerian is happy at their success without attaching any ethnic tags to them. They are simply Nigerians doing the country proud on the continental and global football stages.\nHowever, while we congratulate the trio for their achievements and awards, we must recall that they all started their football careers in the country. Osimhen started off with the Lagos-based Ultimate Strikers Academy before being selected for the 2015 FIFA U-17 World Cup. His sterling performance during the tournament attracted the management of VFL Wolfsburg where he started his professional career before moving to Belgium, France and to his present club, Napoli in Italy.\nOshoala has unarguably become the most successful African female footballer. She honed her skills in two Nigerian clubs, Rivers Angels and FC Robo. She then moved to Arsenal in 2015, from where she went to Liverpool, and later the Chinese Club, Dalian. In all these clubs, she showed class and commitment, with trophies to show. She presently plays for FC Barcelona in Spain. She has a string of firsts in her career, becoming the first African to score in a UEFA Women’s Champion’s League Final. Asisat has had a sterling career that has seen her global, continental and national recognitions, with a variety of awards.\nNnadozie also started her career with the Rivers Angels in 2016. She then moved to France and was outstanding in the last FIFA Women’s World Cup co-hosted by New Zealand and Australia. She has been recognised for her excellent goal-keeping that has earned her global recognitions.\nOsimhen is today Nigeria’s most talked- about player even though he plays outside the continent. He is one of the most successful footballers in Europe, helping Napoli win the league they last won 33 years ago. He has come a very long and successful way since winning the Golden Boot in the 2015 FIFA U-17 World Cup. He is presently the African with the highest ranking in the Ballon D’Or awards at the eighth position.\nRead Also: Chelsea unperturbed by Osimhen’s new Napoli contract\nThese global recognitions of Nigerians in football should be very instructive to the governments at all levels. Sports and entertainment are the best unifiers in the country. In these two sectors, the best progress; so excellence is rewarded without nepotism unlike in politics and education. Success in sports is purely on merit.\nThe fact that these young Nigerians started off in Nigeria and are now plying their trade in Europe must spur some introspection. Nigeria has the human resources, why are these talents being lost to other countries and clubs? Why can’t Nigeria put her money where her mouth is? Why is sports not having enough investment in infrastructure to nurture and retain the best? Where are the school sports where talents were hitherto discovered?\nWe are worried that entertainment and sports that are unarguably the two most lucrative and multi-trillion dollar sectors are not getting the attention they deserve in a country with a youth population that is in dire need of such vibrant sectors for the provision of jobs and the much needed revenue in local and foreign currencies.\nThe lethargy in sports investments also affects the entertainment sector where many young Nigerians have taken the world by storm through Afrobeats and other genres. The infrastructure/management in the country is so poor these young people are almost booked around the globe throughout the year and the bulk of their earnings and taxes benefit other countries.\nNigeria must realise that football is now a trillion-dollar business and more positive actions are needed to upgrade the game through real strategic engagements with global players. Saudi Arabia and Morocco are two countries that have taken advantage of the game and its many socio-economic benefits by investing hugely in, and growing it.\nIndeed, Saudi Arabia has through their great performance at the last Qatar World Cup attracted great players like Cristiano Ronaldo whose presence in the kingdom has pulled other football big weights to the country. Morocco has been reported to have invested in the game in the last 10 years and they are now reaping the benefits.\nTheir performance at the last World Cup was therefore not a surprise to industry players. Moroccan football has prospered in recent years, with the men’s national team reaching the semi-finals of the FIFA World Cup Qatar 2022, the women’s national team reaching the round of 16 at this year’s FIFA Women’s World Cup, the U-17s also reaching the last 16 at the recent FIFA U-17 World Cup. They recently won the rights to co-host the FIFA World Cup 2030 alongside Spain and Portugal. Morocco is ranked 13th on the global FIFA ranking. Nigeria is now ranked 42nd, an obvious retrogression from a fifth ranking in 1994.\nGovernments celebrating and planning grand receptions for Nigerians succeeding in Europe where countries invest in the game should begin to make way for better planning and investment to keep the youth in the country and make the game more profitable with a League that will attract other countries’ players too. They should equally make it easier for private investors to run clubs more profitably. Nigeria will be better with a more vibrant sports ministry that is ready for the future.",
  "word_count": 1158,
  "scraped_at": "2026-02-14T12:40:26.210608"
}