{
  "article_id": "38a002bf78b6",
  "url": "https://www.mercurynews.com/2023/09/27/bay-fc-announces-inaugural-head-coach-mountain-views-albertin-montoya-one-of-the-best-coaches-in-the-country/",
  "title": "Bay FC announces head coach , Mountain View Albertin Montoya",
  "date": "20230927T144500Z",
  "domain": "mercurynews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Twenty-five years after suffering a career-altering injury in his first game for the San Jose Clash, Albertin Montoya is now seen as one of the budding stars in the soccer coaching world.\nAnd on Wednesday morning, Montoya got his dream job: head coach of Bay FC, the new expansion team in the National Women’s Soccer League (NWSL) that will begin play in the 2024 season at PayPal Park.\n“It makes perfect sense for me,” Montoya told the Bay Area News Group this week. “I love this game, it’s all I’ve done all my life since I was 6 years old. It started here in the Bay Area… It’s one of the best places in the world for football. On the women’s side we have some of the best players ever to come out of Northern California. I have the opportunity to develop players and teach the game the way I love to play it.”\nMontoya promised local fans that they’ll get an exciting, fast-paced and attacking-minded brand of football out of his squad.\n“This is the only way I know how to play, whether it’s right or wrong,” he said. “So why not?”\nBay FC general manager Lucy Rushton, the former D.C. United GM who once became the second woman ever to lead an MLS front office, said she put together a long and exhausting search while looking for the team’s first head coach, but all the fingers kept pointing toward Montoya.\n“I’ve been going to a lot of NWSL games and I cannot walk anywhere with Albertin without getting stopped,” she said. “It’s the most frustrating thing ever. Wherever I go – I go to KC, I go to Washington, Orlando, wherever, they’ll ask me, ‘Albertin lives in the Bay Area; do you know him?’\n“This guy is going to sell the stadium out.”\nMontoya’s journey was a tumultuous one. He arrived in Miami after his family escaped from Cuba in 1980, when he was just 5 years old. His family eventually settled in Mountain View, where his great grandfather had escaped to years earlier.\nUnder his family’s guidance, Albertin became a quick study on the pitch and eventually went on to star for the United States team that advanced to the quarterfinals in the U-17 World Cup in Italy.\nHe played for four years at Santa Clara before he was drafted by the Clash, now known as the Earthquakes, with the fourth overall pick in the 1997 MLS Draft.\nGetting seriously hurt in his first game forced him to change career paths, though.\n“My injury lasted three years,” he said. “I thought I’d go back and play. In the meantime, I started helping a local club, Mountain View Los Altos soccer club. I grew up playing there. My dad was coaching there. My dad asked me to help a U-10 team. I was thinking I would go back to MLS, but my injury was complicated. Three years later I needed another surgery.”\nAfter retiring from his playing career he began coaching regularly at MVLA, now considered one of the top youth clubs in California. He took over a team of 8- and 9-year-old girls that he’d coach for the next 10 years.\nOne girl on that team was Margueritte Aozasa, who would later star at Santa Clara and coach at Stanford. Last year, she took over the UCLA women’s soccer program and led them to a national championship, becoming the first-ever woman of color and first-ever rookie coach to capture the title.\nAozasa remembers falling in love with the game because of Montoya.\n“We had the best time ever,” said Aozasa, who is leading a Bruins team currently ranked No. 5 in the nation. “He would play against us all the time. We’d play 11-on-1. And sadly, he’d always win. And he’d just joke with us but also hold us accountable. We didn’t want to do anything wrong by him. I think it’s because we were truly enjoying ourselves. And he would be funny and joking and then OK, now it’s time to be serious. He coached us through that really well. We could go from crying with laughter to business with the snap of his fingers.”\nMontoya coached her at MLVA through high school. His wife, Erin, also coached her.\nAt Aozasa’s high school graduation, the Montoyas were sitting in the front row with tears in their eyes.\n“We grew up together,” Aozasa said. “We watched him grow up alongside us.”\nMontoya has also been the co-head coach of the California Storm as part of the Women’s Premier Soccer League from 1999 to ‘06. He was the head coach of FC Gold Pride as part of Women’s Professional Soccer in 2009 and ‘10. And he was the head coach of the United States Women’s National Team U-17 club that won a CONCACAF title in 2012.\nMost recently, the 48-year-old was the interim head coach for the NWSL’s Washington Spirit last year.\nHe said he still loves coaching the little ones, often going straight from a training session with professionals to coaching a team of 9-year-olds.\n“You touch kids’ lives, that’s what’s so special,” he said. “You can have such a huge impact on their lives and it changes them if it’s done the right way. It can be done at every level. Even the pros still want to learn.”\nMontoya hopes to find players with a high soccer IQ for Bay FC’s inaugural season.\nAozasa said she can’t wait to get to a game at PayPal Park.\n“He brings so much life and energy and enjoyment to the game,” she said. “That’s what it’s all about.\n“Even though I‘m more the mentee than the mentor, I’m so proud of him and excited for him. He’s such a talent. And truly has a gift for coaching. I believe he deserved this, and he deserves to be recognized as one of the best coaches in the country, if not in the world.”",
  "word_count": 993,
  "scraped_at": "2026-02-14T13:25:50.219481"
}