{
  "article_id": "38cefc6ac14b",
  "url": "https://kaieteurnewsonline.com/2025/12/08/gff-womens-division-one-league-gdf-secure-the-inaugural-crown/",
  "title": "GFF Women Division One League … GDF secure the inaugural crown",
  "date": "20251208T081500Z",
  "domain": "kaieteurnewsonline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Latest update February 14th, 2026 12:35 AM\n- Stabroek News shuts down after four decades\n- House approves $1.5 trillion National Budget\n- Guyanese protest ‘anti-poor’ budget, flag multimillion allocation to “dormant” Commission of Information\n- Trump says he will visit Venezuela after ‘very good’ relationship with interim president\n- 4 nabbed for armed robbery of Herstelling businesswoman\nDec 08, 2025 Sports\nKaieteur Sports – An absolute screamer off the boots of Sandra Johnson made all the difference between the Guyana Defence Force (GDF) Women’s Football Club and the Guyana Police Force (GPF) FC in what was the Women’s Division One League decider at the Guyana Football Federation’s (GFF) National Training Center (NTC) at Providence, East Bank Demerara (EBD).\nTied on perfect 24 points from 8 games played, it all boiled down to the final clash under the Friday night lights which would ultimately decide the winner of the tournament’s league phase.\nFor Police, it was a must- win encounter, given their inferior goal- difference to the soldiers; even a draw would not suffice. On the other hand, all the soldiers needed was a draw but when left up to their star winger, Sandra Johnson, who just came off of a start with the Lady Jags in their CONCACAF W Qualifiers clash against Nicaragua; nothing but a win would do for the ladies in green.\nFrom the first whistle, GDF’s Women controlled the majority of possession. A few early shots found a spot on target but nothing could penetrate the laser focus of Police’s keeper Dekola Chester.\nThat is, until the 15th minute.\nA lapse in Police’s advances saw Glendy Lewis winning possession of the ball. Now on the charge with limited bodies behind, the pass to Johnson was as smooth as butter. The striker took a few moments to settle, before deciding on the left-footed shot that sailed perfectly into the top right corner of the goal and out of Chester’s grasp for what would become the game-winning strike.\nSeveral notable changes came for police after the half-time interval and though they were able to keep GDF’s relentless attack at bay and even created a few chances of their own. It was not enough to find the game-levelling strike to keep them in contention for the title.\nAs such, GDF will be crowned as champions of the Competition’s League phase with the playoff (knockout) aspect to come soon.\nMeanwhile, also on Friday night Western Tigers FC ended their league campaign on a winning note, drubbing Monedderlust FC 5-0.\nIt was a tough first half for both sides as the Berbice- based outfit were kept on their toes while the West Ruimveldt- based side just couldn’t seem to make their chances stick. As such, the encounter remained a stalemate at the half- time interval.\nSoon after the game resumed, Marissa Frank took matter into her own hands; her right- footed shot into the corresponding corner from just inside the penalty area, finally separated the two teams in the 37th.\nFrank would go on to complete her hattrick in the 42nd and 45th minutes while Ciara Glasgow added her name to the scoresheet in the 40th and 53rd minutes for their massive win.\nThough the curtains have come down on the Women’s Division One League phase, the knockout competition is billed to kick off on Wednesday, December 10 at the same venue.\nSubscribe to get the latest posts sent to your email.\nYour children are starving, and you giving away their food to an already fat pussycat.\nFeb 14, 2026\n(Reuters) – Australia were dealt an early blow in their quest to reach the Super Eight stage of the Twenty20 World Cup after the depleted former champions crashed to a 23-run defeat by Zimbabwe...Feb 14, 2026\n(Kaieteur News) – Georgetown has always possessed the air of a place living on memory. Not history in the grand sense, not the kind that builds monuments and sustains civic pride, but memory that is faded, selective, and slightly resentful. The old wooden houses, leaning like tired men; the...Feb 01, 2026\nBy Sir Ronald Sanders (Kaieteur News) – When the door to migration narrows, the long-standing mismatch between education and economic absorption is no longer abstract; a country’s true immigration policy becomes domestic — how many jobs it can create, and how quickly it can match people to...Feb 14, 2026\n(Kaieteur News) – Members of Parliament from both the PPP Govt side and the opposition aisles have a challenge on their hands. Mr. Speaker, or Mr. Master Executioner. If government MPs choose Mr. Executioner, they giveaway the game -the Speaker delivers for their benefit. When the...Freedom of speech is our core value at Kaieteur News. If the letter/e-mail you sent was not published, and you believe that its contents were not libellous, let us know, please contact us by phone or email.\nFeel free to send us your comments and/or criticisms.\nContact: 624-6456; 225-8452; 225-8458; 225-8463; 225-8465; 225-8473 or 225-8491.\nOr by Email: glennlall2000@gmail.com / kaieteurnews@yahoo.com",
  "word_count": 831,
  "scraped_at": "2026-02-14T12:50:46.943758"
}