{
  "article_id": "38f167d5cc1b",
  "url": "https://www.arsenal.com/news/david-raya-wins-best-goalkeeper-award",
  "title": "David Raya wins Best Goalkeeper award",
  "date": "20250227T214500Z",
  "domain": "arsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "David Raya has been named the Best Goalkeeper at the 2025 London Football Awards.\nCelebrating the very best of London football, the awards ceremony was held at Wembley Stadium on Thursday night.\nSince last year’s awards, our shot-stopper made the headlines with two penalty saves in a Champions League round of 16 win over Porto, kept six consecutive clean sheets in the Premier League, and won the division’s Golden Glove at the end of the 2023/24 season.\nThat saw him included in the PFA Premier League Team of the Year, and his fine form has continued this season with a number of stunning saves, including August’s Premier League Save of the Month for a one-handed stop against Ollie Watkins.\nFor the London Football Award, David was up against Dean Henderson (Crystal Palace), Hannah Hampton (Chelsea Women), Josh Keeley (Leyton Orient) and Mark Flekken (Brentford).\nWe had a number of nominees up for other awards as well, starting with Gabriel, who was in contention for Premier League Player of the Year, and Mikel Arteta, who was nominated for Manager of the Year.\nAlessia Russo and Frida Maanum were both nominated for the Barclays Women’s Super League Player of the Year award.\nAmong the nominees for Men’s Young Player of the Year were Ethan Nwaneri and Myles Lewis-Skelly, while Michelle Agyemang was included on the list for the Women’s Young Player of the Year prize.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 260,
  "scraped_at": "2026-02-14T12:49:39.183471"
}