{
  "article_id": "3907b2d70d40",
  "url": "https://www.bbc.co.uk/sport/football/66530873",
  "title": "Sarina Wiegman: FA says any approaches would be '100% rejected'",
  "date": "2023-08-17T13:04:14.000Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_bbc",
  "body_text": "Any approaches for England manager Sarina Wiegman would be \"100% rejected\", says Football Association chief executive Mark Bullingham.\nWiegman, appointed in 2021, has led England to the Women's World Cup final a year after they won Euro 2022.\nShe is the first coach to take two countries to a World Cup final, having led the Netherlands there in 2019.\n\"It is not about money. We are very happy with her and feel she is happy,\" Bullingham said.\nUSA manager Vlatko Andonovski resigned on Thursday following their last-16 exit from the World Cup, with Wiegman listed as a potential candidate to replace him.\n\"We've seen lots of rumours, and she is a special talent - we know that. From our side, she's contracted through until 2025,\" said Bullingham.\n\"She's doing a great job. We're obviously huge supporters of her and hopefully she feels the same way. She's someone we'd like to have with us for a very long time.\"\nEngland meet Spain in the final at Stadium Australia in Sydney on Sunday at 11:00 BST, a match which will be shown live on the BBC.\nAsked whether there had been discussions with Wiegman over a new contract, Bullingham said: \"We've always said we'd get to it after a tournament. We had good conversations after the Euros.\n\"There will be an appropriate time to do it. We've got a bit of time. She'll want to have a decent holiday after this.\"\nProgress made on plans for Wiegman statue\nFA women's technical director Kay Cossington said Wiegman and assistant coach Arjan Veurink have had \"a fantastic impact\" and have \"embraced the England DNA across all of our teams\".\nPlans to build a statue of Wiegman outside Wembley Stadium have been looked at by the FA and Brent Council since England's European triumph.\n\"We've made progress on that and it would be right to have something to commemorate that success outside Wembley. It's more the whole team,\" said Bullingham.\n\"You have to go through various permissions - we've gone through that. The next stage is working on the design.\"\nBullingham went on to say Wiegman \"could do anything she wants in football\" when pressed if she could potentially take over from men's boss Gareth Southgate.\n\"Firstly, I think it's a bit disrespectful to the Lionesses to project it as a step up,\" said Bullingham.\n\"People always say it is 'the best man for the job'. Why does it have to be a man? Our answer is always 'it's the best person for the job'.\"\n'There's a discussion to be had about player bonuses'\nBefore flying to Australia, England players said they were frustrated with the FA over its stance on performance-related bonuses.\nThe Lionesses, who are not set to receive bonuses, halted discussions during the tournament but are set to renew them after returning from Australia.\n\"We're sorting it after the tournament,\" said Bullingham. \"They had a very strong case before the World Cup and a very strong case after, but the reality is there's a discussion to be had.\"\nAsked why those discussions were not resolved, he told BBC sports editor Dan Roan: \"Fifa were relatively late in announcing the prize money for the tournament and the bonuses always come off that.\n\"That meant we didn't get the chance to finalise the agreement with the players before we came out here. They then asked to park it until after the tournament, so that's what we've done.\n\"It hasn't affected anything. We've got a brilliant morale in the camp, got a brilliant relationship and the two most important things are we're all aligned in winning the tournament and in growing the women's game.\"\nSunday's World Cup-winning team will be awarded £3,357,000 in prize money by Fifa, with the runners-up receiving £2,359,000.\nThe champions' players will each pocket £211,277 and the runners-up £152,600 each.\nBullingham said the \"commercial disparity is still huge\" between men's and women's players but the FA is \"committed to investing ahead of revenue\" to try to bridge the gap.\n'Wiegman well paid in market she operates'\nThere have also been questions asked as to why Wiegman's salary is not on parity with men's boss Southgate despite her recent success.\n\"I understand the question. If you look at the disparity in the market and the income coming in, that's why you've got a difference,\" said Bullingham.\n\"We don't talk about people's remuneration but I would say that Sarina is, within the market she operates, well paid. If you look at the comparison in the men's game, it's a different market.\n\"I really want those markets to merge over time but we're not there yet. That is the long-term objective and where we have got to get.\"\nMeanwhile, England goalkeeper Mary Earps said it was \"hurtful\" that fans cannot buy a replica of her shirt.\nAsked if the FA had discussed the issue with kit manufacturers Nike, Bullingham said: \"It's not something we're going to get into now. But it will be something that is addressed quite soon after the tournament.\n\"Mary spoke passionately about it and we want to grow goalkeeping - it's building role models. It's something we're getting to but it's not anything we're going to announce now.\"\nThe Lionesses are set to leave Australia on Monday and there could be plans to celebrate in London on Tuesday or Wednesday should they beat Spain.\nEngland's Euro 2022 captain Leah Williamson, who missed the World Cup through injury, is set to be in Sydney to watch the final, but Prime Minister Rishi Sunak and FA president Prince William will not be present.\nLucy Frazer, Secretary of State for Culture, Media and Sport, and Foreign Secretary James Cleverly will attend.",
  "word_count": 948,
  "scraped_at": "2026-02-14T11:17:37.191261"
}