{
  "article_id": "3919255360ea",
  "url": "https://theathletic.com/live-blogs/chelsea-manchester-united-live-score-updates-result-womens-fa-cup-final/fG44BdF533KU/",
  "title": "Chelsea vs Manchester United live updates",
  "date": "20230514T093000Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "How Sam Kerr goal won Chelsea the Women’s FA Cup with victory over Manchester United\nSummary\nChelsea beat Manchester United 1-0 on Sunday to lift their third consecutive Women’s FA Cup, with Sam Kerr’s second-half goal proving the difference in a closely-fought affair.\nUnited started the game brightly, which was played at Wembley Stadium in front of a world-record attendance for a domestic women’s game.\nMarc Skinner’s side had a goal disallowed for offside after less than 30 seconds and had a strong appeal for a penalty turned down later in the half. But VAR —which was being used for the first time in an English women’s domestic club game — judged the foul to have occurred just outside the area.\nThe introduction of Pernille Harder in the 57th minute changed the match for Chelsea, as she assisted Kerr for the game’s winning goal.\nSigning off\nIt was a day the record crowd will remember for a long time. Sam Kerr's goal was the difference between two evenly-matched teams.\nViews from the stands: Ramu & Cydney\nRamu (Manchester United fan): For a team playing their first cup final against serial winners like Chelsea, although we are disappointed, we are immensly proud of the team and excited for everything moving forwards.\nCydney (Chelsea fan): There isn't much to say except the better team won at the end of the day, in the first half we were poor but whatever Emma Hayes said worked. Up the blues!\nHayes' half-time fire-up\nChelsea manager Emma Hayes praised how her side fought back into the game.\n\"You can't underestimate the game accumulation, we looked so tired in the first half. We had to kick each other at half time,\" she said.\n\"We know how to stay in a game and even if we weren't at our best we have to work out how to change it.\n\"We had to possess the ball better and then find the quality in the final third.\n\"It's a coach's nightmare. We don't do the kick-off properly and then the first, second and third phases were all off.\"\n(All photos by Getty Images)\nIt has not been raining...\n... well hasn't been raining water at least.\n(All photos by Getty Images)\nHeroes to a generation\nThe moment Chelsea lifted the trophy on the pitch...\n... forgive the rogue cameraman.\n(All photos by Getty Images)\nReflections from runner-up's manager\nManchester United manager Marc Skinner spoke to BBC One after the game.\n\"We switch off in one moment, there's space to Sam [Kerr] to run in to which we haven't given her all game,\" said Skinner.\n\"I'm proud of the girls today, they are hungry. Their position is what we want to take. We are a young, hungry team. I need to find the pieces to make sure we challenge all the time.\n\"Chelsea have done hardly anything in the game, but they are winners for a reason, they find that tiny little gap.\n\"I want to thank all the fans, they have been magnificent.\n\"We won't dwell on this, it fuels us... this will be us in future.\"\nMoments to remember\nChelsea lift the trophy again on the presentation on the pitch, champagne is flying everywhere, fantastic scenes.\nYour 2023 WFA Cup winners\nRepeat offenders. They've played here more than Stamford Bridge. Three consecutive WFA Cups.\n(All photos by Getty Images)\nUnited post-game huddle\nMarc Skinner addressing his runners-up after the game.\n(All photos by Getty Images)\nThe Champions lift the trophy\nMillie Bright and Magdalena Eriksson share the honour of lifting the trophy as the Chelsea fans in attendance celebrate.\nKerr's goal... and the flip!\nA moment those Chelsea fans in attendance will never forget.\nOn their way to glory\nChelsea's players are walking up the famous steps to go and receive their winners medals.\nWords from the game changer\nPernille Harder's introduction changed the game for Chelsea, providing the assist for Sam Kerr's goal.\n\"It's amazing to win titles. A full Wembley is amazing,\" said Harder.\n\"Of course, it's sad when you are out for so long [with an injury] but you come back with motivation and hunger.\n\"It's amazing to come back for this game and be involved in a win.\n\"Chelsea means a lot to me. I've had so many great memories here.\"\nRunners-up\nThe Manchester United players are receiving their runners-up medals from Prince William.\nThis is what it means\n(All photos by Getty Images)\nSam Kerr reflects on the game\nMatch winner Sam Kerr provided her thoughts after the game, speaking to the BBC:\n\"We didn't have our best game but we just push through and that's the sign of a great team,\" said the Australian striker.\n\"I'd be lying if I said it was all me. It was about the team.\"\nWhen given the player of the match award, Kerr said she felt others had played better than her but will \"take it on behalf of the team.\"\nView from the stands: Gavin\nAfter a brilliant start to the game, it's a hard one to take for the United fans and players, but there is plenty of positives to take.\n\"I'm proud of United, they were exceptionally good in the first half, I think in the latter stages of the second half they become lagged and tired and gaps started to appear,\" said Gavin.\n\"Chelsea are a machine and they just started to grow in confidence, United came on strong in injury time but it was just too much.\"\nMy player of the match\nSam Kerr was awarded the official player of the match award and whilst she was excellent, Pernille Harder is the match winner.\nThe Denmark international changed the game, threatening twice as a potential goalscorer and assister, before Kerr tucked her chance away to win the game.\nFT: Chelsea 1-0 Manchester United\nFT: Chelsea 1-0 Manchester United\nChelsea hang on! Sam Kerr is the match winner!\nChelsea become the third team to secure three consecutive WFA Cup's in the competitions history.",
  "word_count": 1000,
  "scraped_at": "2026-02-14T12:21:52.050307"
}