{
  "article_id": "39385b7a44b1",
  "url": "https://freerepublic.com/tag/*/index?more=4340083",
  "title": "Latest Articles",
  "date": "20250913T003000Z",
  "domain": "freerepublic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Search:\nKeywords\nUsers\nTitles\nYahoo\nHome·\nSettings·\nBreaking ·\nFrontPage ·\nExtended ·\nEditorial ·\nActivism ·\nNews\nPrayer PrayerRequest SCOTUS ProLife BangList Aliens HomosexualAgenda GlobalWarming Corruption Taxes Congress Fraud MediaBias GovtAbuse Tyranny Obama Biden Elections POLLS Debates TRUMP TalkRadio FreeperBookClub HTMLSandbox FReeperEd FReepathon CopyrightList Copyright/DMCA Notice\nMonthly Donors · Dollar-a-Day Donors · 300 Club Donors\nor by or by mail to: Free Republic, LLC - PO Box 9771 - Fresno, CA 93794\n-\nOutcry over FEMA employee's 'revolting' comments about Charlie Kirk\nA Federal Emergency Management Agency (FEMA) employee has been placed on administrative leave after making controversial comments about Charlie Kirk. Gavin Sylvia, a data analyst with FEMA since November 2024, posted on Instagram: 'Half mast for the literal racist homophobe misogynist?? [Be ******* for real].' The post questioned President Donald Trump's order to have American flags flown at half-staff following Kirk's assassination on Wednesday in Utah. A FEMA spokesperson told the Daily Mail: 'This employee's words are revolting and unconscionable. He was immediately placed on administrative leave. 'Celebrating the death of a fellow American is appalling, unacceptable and sickening.' Sylvia... -\nSuspect's high school classmate says Robinson was the only 'leftist' in a family of 'very hard' Republicans\nIn a phone interview on Friday, someone who said they were friends with Robinson in high school, who wanted to remain anonymous, said that the suspect was “pretty left on everything” and was “the only member of his family that was really leftist”. “The rest of his family was very hard Republican,” the friend said. Around sophomore year, the friend said, Robinson became more extreme in his political views and would “always just be ranting and arguing about them”. The friend said that they played video games together a lot in high school and noted that the bullet engraving with... -\nX: Leftists Make Figurine Mocking Charlie Kirk's Death\nEric Daugherty @EricLDaugh It’s America versus demons. -\nSkip navigationSearchCreateAvatar imageCharlie Kirk's Assassin Caught! He Wrote Italian \"Bella Ciao\" on his Ammo...\n16 and a half minute video by Italian historian YouTuber Metatron commenting on Charlie Kirk assassin writing \"Bella Ciao\" on one of the bullet casings. -\nDemocrats seek uniting agenda to counter image problem\nThe numbers show Democrats have an image problem, amid record-low approval ratings and a growing voter registration gap. To reverse that trend, some Democrats are working to build a message they say can win over more Americans. Democrats suffered heavy losses in the 2024 elections, both nationally and in battleground states. Last year more new voters registered Republican than Democrat for the first time since 2018, according to data from business intelligence firm L2. “Democrats have to reestablish trust with voters and win a whole bunch of folks back,” said Rep. Greg Landsman, D-Ohio. Landsman hopes to lead the charge... -\nWhy Moonbats Believe Charlie Kirk Deserved to Die\nLet’s go to Seattle to hear directly from a moonbat why leftists believe Charlie Kirk deserved to die: (video on link, try not to barf) There you have it. Charlie Kirk deserved to die because he was a “Nazi” — i.e., someone who expressed views in opposition to leftism. That they apply this term to a guy like Kirk confirms that when used by liberals it has no other meaning. If you are reading this, you are probably a “Nazi” to. This means they would like to kill you also. If given the opportunity, they might. -\nConway Scenic Railroad, North Conway, NH\nRailroad Scenic trip -\nMore Moonbats Celebrating Charlie Kirk’s Assassination\nThe next time you are tempted to try reasoning with a moonbat, remember this: (video on link) An evil ideology that devalues human life unsurprisingly attracts people who are evil. That we are surrounded by vicious kooks who believe we deserve to die makes the Second Amendment more indispensable than ever. -\nClemson Professor Celebrates Charlie Kirk's Death Online\nA Clemson University professor appears to have wiped his social media accounts after posting and sharing messages that mocked the assassination of conservative activist Charlie Kirk. Melvin Earl Villaver Jr., an assistant professor of audio technology and global black studies in Clemson’s Department of Interdisciplinary Studies, appears to have reposted and commented on multiple X posts ridiculing Kirk after his murder at Utah Valley University on Sept. 10. Screenshots shared by Clemson College Republicans show an account apparently belonging to Villaver, “Melvin Earl, Ph.D.,” reposting a message that read, “no one mourns the wicked.” Another repost mocked Kirk’s views on... -\nMet Police to put 1,600 officers on streets as London braces for violence ahead of Tommy Robinson protest\nThe Metropolitan Police has called in hundreds of reinforcement officers from across the UK and is seeking to reassure Muslim Londoners ahead of Tommy Robinson’s “Unite the Kingdom” protest. Thousands of people are expected at the far-right activist’s “free speech” rally on Saturday, while Stand Up To Racism UK has organised a counter-demonstration expected to attract a similar number. The Met will also deal with policing several football matches, including derbies between West Ham and Tottenham and Brentford and Chelsea, while Arsenal, Crystal Palace and Fulham all play fixtures at home. More than 1,600 officers will be deployed as part... -\nRepublican revolt over Utah governor after explosive Charlie Kirk feud revealed\nUtah Governor Spencer Cox basked in praise for his 'unity' plea at Friday's FBI press conference — but the man whose alleged assassin he was discussing once wanted him expelled from the Republican Party. Cox dominated the podium detailing Charlie Kirk's murder just three years after the TPUSA founder branded him a 'weak moderate' who 'should be expelled from the Republican party.' The 2022 social media blast came after Cox vetoed a bill banning biological males from women's sports — a move that infuriated Kirk and conservative activists. Now friends of the slain activist find it 'ironic' that the same... -\nWhy Gov. Cox called social media ‘a cancer on our society right now’\nKey Points:Gov. Spencer Cox called social media “a cancer on our society,” urging people to disconnect. Cox said videos of violent incidents like the murder of Charlie Kirk are harmful for viewers. A UK survey found 70% of teenagers have encountered real-life violence online. Announcing that a suspect in the Charlie Kirk murder is in custody Friday morning, Utah Gov. Spencer Cox spoke earnestly about what he called “moral clarity,” “internet fury” and the need to disconnect from social media and devices and to connect instead with one another. He called social media “a cancer on our society right now,”... -\nSomething Dark is Happening At The Russian-Baltic Border\nThis is an excellent 32 minute history lesson on the conflict between the Baltic Countries, Lithuania, Latvia, and Estonia vs Russia. It's the best summary that I have found. -\nDespicable Charlie Kirk Coverage Proves It's Time To Shut MSNBC Down | Bobby Burack\nFriday morning, MSNBC’s corporate leadership issued a rare mea culpa over its coverage of Charlie Kirk’s assassination. In a staff memo, Comcast CEO Brian Roberts, President Mike Cavanagh, and Versant CEO Mark Lazarus apologized for the coverage and for remarks made by former senior political analyst Matthew Dowd, calling them \"unacceptable and insensitive.\" Dowd had been fired earlier this week after suggesting Kirk’s \"awful words\" had brought about his own murder — comments made just minutes after the death of the 31-year-old was announced. The letter opened with solemn language: The tragic loss of Charlie Kirk, a 31-year-old father, husband,... -\nA bionic arm, chicken coops and the wrong men: The wild 44-hour search that almost turned Kash Patel into a laughingstock\nA bionic arm, a chicken coop and three botched arrests. As Kash Patel's reputation as FBI chief hung in the balance following the assassination of Charlie Kirk, the alleged assassin's father turned him. Donald Trump on Friday announced that the suspect was finally in custody - 44 hours after the fatal shot that killed Kirk at Utah Valley University on Wednesday. A bionic arm, chicken coops and the wrong men: The wild 44-hour search that almost turned Kash Patel into a laughingstock The Assassination of Charlie Kirk: Listen to the latest on the Daily Mail podcast By JOE HUTCHISON, US... -\nAstronomy Picture of the Day - Lunar Eclipse in Two Hemispheres\nExplanation: September's total lunar eclipse is tracked across night skies from both the northern and southern hemispheres of planet Earth in these two dramatic timelapse series. In the northern hemisphere sequence (top panel) the Moon’s trail arcs from the upper left to the lower right. It passes below bright planet Saturn, seen under mostly clear skies from the international campus of Zhejiang University in China at about 30 degrees north latitude. In contrast, the southern hemisphere view from Lake Griffin, Canberra, Australia at 35 degrees south latitude, records the Moon’s trail from the upper right to the lower left. Multiple... -\nTyler Robinson was raised Mormon — and allegedly killed Charlie Kirk moments after influencer praised the church\nCharlie Kirk’s alleged assassin Tyler Robinson was raised a devout Mormon — yet fired his fatal shot at Kirk just moments after the conservative influencer had glowingly praised the Church of Latter-day Saints. “I love how Mormons send missionaries around the world, I love how polite they are. … Half my team is Mormon,” Kirk, 31, said to huge cheers from the crowd at Utah Valley University moments before he was allegedly killed by the 22-year-old trade-school student. “Mormons are great people. Let me just say, I’m an evangelical Christian, but I’m not one of those guys that hates on... -\nFired Lefties Film Their Crash Outs After Mocking Charlie Kirk (language)\nVideo -\nWesley Hunt: You will NOT gaslight your way out of this. NOT this time. The Democrat Party must finally look in the mirror\n\"You will NOT gaslight your way out of this. NOT this time. The Democrat Party must finally look in the mirror, condemn the political violence they’ve unleashed, and apologize for poisoning an entire generation into believing conservatives are “fascist threats” to democracy. Tyler Robinson got on that roof, took aim, and assassinated Charlie Kirk, because their propaganda worked.\" - Wesley Hunt View the video montage at the link: -\nLas Vegas casinos ditch live dealers for electronic games amid ongoing tourism decline\nLas Vegas tourism continues to decline as fresh numbers reveal that fewer visitors are traveling to Sin City. The Las Vegas Convention and Visitors Authority (LVCVA) recently released its numbers for July visitors, noting a 12% drop from last year. There were 3,089,300 visitors this July compared to over 3.5 million last year, while occupancy on the Strip dropped 7% from 86.5% last year. The tourism decline has been attributed to a combination of factors, including the impact of tariffs, the seasonal summer slowdown, and a surge in online gaming. Most recently, the Golden Gate Hotel & Casino announced it...\nBrowse by Forum\nGet Connected! Join Free Republic Today!\nAlready a Member? Log into your Free Republic account.\nBreaking News (News/Activism)\n- Dear FRiends, our FReepathon has fallen way behind. Please get your donations in as soon as you can. Thank you and God bless.\n- Sunday Morning Talk Show Thread 8 February 2026\n- The MAGA/America 1st Memorandum ~~ February 2026 Edition\n- Senate strikes deal to avert partial shutdown\n- US Border agents shoot two people in Portland, city officials say\n- Minnesota Gov Tim Walz to suspend re-election campaign amid Somali fraud scandal: report\n- One in custody after incident at Ohio home of JD Vance\n- Caracas, VenezuelaJanuary 3, 2026 6:30 AMUpdated: January 3, 2026 1:12 PMU.S. captures Venezuela's leader and his wife in a stunning operation and plans to prosecute them\n- President Trump says Maduro and his wife have been captured. A news conference will be held at 11 A.M\n- The MAGA/America 1st Memorandum ~~ January 2026 Edition\n- More ...\nFront Page News (News/Activism)\n- 'You exposed him to real danger': Father goes nuclear on school board after teachers sent his son to ICE protest\n- House passes SAVE America Act, sending Trump-backed election bill to the Senate\n- Trump set to gut US climate change policy and environmental regulations: White House official\n- Less than 14% of those arrested by ICE in Trump's 1st year back in office had violent criminal records, document shows\n- Lawler: ‘Not Realistic’ to Kick Out Over 25 Million Undocumented People\n- Fact Sheet: President Donald J. Trump Ensures Affordable Beef for the American Consumer\n- Democrats fear body cameras could be ICE’s new mass surveillance tool\n- Migrant, 70, who told girl, 12, to 'cover her head' before sexually assaulting her on way home from school is spared jail\n- Associated Press Complains That Winter Olympics Teams Are ‘Overwhelmingly White’\n- Appeals court sides with Trump admin with mass detention ruling\n- More ...",
  "word_count": 2145,
  "scraped_at": "2026-02-14T14:17:57.959310"
}