{
  "article_id": "393b78785fa8",
  "url": "https://www.90min.com/barcelona-confirm-lucy-bronze-departure",
  "title": "Barcelona confirm Lucy Bronze departure",
  "date": "20240627T113000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Barcelona confirm Lucy Bronze departure\n- Lucy Bronze will leave Barcelona upon the expiry of her contract this month\n- The England international made the move to Spain in 2022\n- Bronze won seven titles in her two years at the club\nBarcelona have confirmed defender Lucy Bronze will depart the club upon the expiry of her contract at the end of the month.\nBronze, 32, joined the Catalan giants ahead of the 2022/23 season and enjoyed a successful, trophy-filled two years at the club. She won two league titles, two Champions League winners medals, one Queen's Cup and two Spanish Super Cups.\nThe defender played 70 times for Barcelona across the two years and scored five goals in that time. In her first campaign, she made 32 appearances, which increased to 38 last term.\nIn a statement, Barcelona confirmed Bronze will not be renewing the contract she signed upon her arrival two years ago.\n90min understands Barcelona had to factor in the finances involved in renewing Bronze's contract. The veteran right-back was one of the highest earners in the squad and any new deal could have impacted their ability to pull off other deals this summer.\nThere is growing interest in Bronze from the NWSL, where Kansas City Current hold the right-back's discovery rights, but Paris Saint-Germain are also known admirers.\nSpeaking to FourFourTwo in the early stages of last season, Bronze addressed her future and didn’t rule out a return to England.\n\"Never say never,\" she said.\n\"I’m someone who is open to opportunities – my career has shown that. I like different challenges in different places. Although my family live back in England, I have my home wherever I am in the world and I do absolutely love playing for Barcelona.\n\"I don't know what the future holds – whether I stay here, return to England one day or join another club in another country and try to achieve the same sort of success. I’m always looking to challenge myself.\"\nBronze initially joined Barcelona from WSL side Manchester City in the aftermath of England’s Euro 2022 triumph.\nPreviously, Bronze has also represented European giants Lyon, where she won three Champions League titles, taking her career total in the competition to five. The defender had two separate spells at City, while she also spent a brief period of time at both Everton and Liverpool.",
  "word_count": 396,
  "scraped_at": "2026-02-14T12:32:17.767354"
}