{
  "article_id": "393e3cc36111",
  "url": "https://www.ocregister.com/2025/05/10/angel-citys-savy-king-remains-stable-and-will-undergo-further-evaluation-according-to-nwsl-statement/",
  "title": "Angel City Savy King  remains stable  and will undergo  further evaluation  according to NWSL statement",
  "date": "20250510T201500Z",
  "domain": "ocregister.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The National Women Soccer League said in the statement Saturday that Angel City Football Club defender Savy King “currently remains stable and will be undergoing further evaluation.”\nKing, 20, suffered a “medical event” in the second half of Friday’s Angel City Football Club’s 2-0 win over the Utah Royals. Medical staff immediately rushed onto the field and started treatment and would eventually get King on a stretcher and carted off.\nIn the postgame press conference, Angel City first assistant coach Eleri Earnshaw said that King was responsive and her family was with her.\nNWSL added in its statement that “league protocols were followed from both a medical and game operations perspective,” and, “We are grateful to the Angel City medical staff as well as to local paramedics who handled this difficult situation seamlessly.”\nUtah coach Jimmy Coenraets questioned in his postgame conference, whether the game should have continued.\nThe event took place in the 74th minute and the game ended with a 12-minute stoppage time.\n“In those moments, I’m not sure if we should have continued the game,” he said. “Emotionally, not only them (Angel City), but also our players are just scared. I think that’s not the right position or right situation to be in, but in the end, we played on. So, that’s a decision other people are making, which is fine, but I think it was a really tough moment.”\nThe 2025 Competition Rules state the decision to continue the game is on the league office. “NWSL recognizes that emergencies may arise which make the start or progression of a Game inadvisable or dangerous for participants and spectators. Certain event categories automatically trigger the League Office into an evaluation of whether delay or postponement is necessary.” The one item that seemingly would have applied to this situation is point No. 3: “serious incident, injury or fatality to a player, coach, official, team representative or spectator or other medical concern.”\nWashington Spirit forward Trinity Rodman said in an Instagram post that “in no world should that game have continued …”\nKing, who attended Agoura High, was drafted by Bay FC out of North Carolina after her freshman year in the 2024 NWSL Draft. She was acquired by Angel City in a trade during the offseason and signed a two-year contract extension.",
  "word_count": 383,
  "scraped_at": "2026-02-14T14:17:01.230539"
}