{
  "article_id": "398d656428ff",
  "url": "https://carnegieendowment.org:443/research/2023/01/european-democracy-support-annual-review-2022",
  "title": "European Democracy Support Annual Review 2022",
  "date": "20240711T221500Z",
  "domain": "carnegieendowment.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It’s dangerous to dismiss Washington’s shambolic diplomacy out of hand.\nEric Ciaramella\nPaper\nIn a year dominated by the rhetoric of defending democracy, EU democracy support policies were adjusted in important ways to align with the new geopolitical context. However, the union also seemed to treat commitments in this area as second-order priorities compared to security.\nBy Richard Youngs, Elena Ventura, Ken Godfrey, Erin Jones, Zselyke Csaky, Kinga Brudzińska, Evelyn Mantoiu, Ricardo Farinha, Carolin Johnson, Ellen Leafstedt\nPublished on Jan 30, 2023\nThe need to defend democratic values from violent attack was the dominant theme of 2022. Russia’s invasion of Ukraine in February made democracy’s defense a priority of the highest geopolitical as well as normative order. It propelled commitments to protect democracy to the top of the agenda for Europe, internally as well as in foreign and security policy. European powers responded and a common line gained currency that the war had pulled them through a watershed conversion in their strategic outlook. However, in a year dominated by the imperative of defending democracy, European policies specifically aimed at supporting democracy evolved in only understated fashion. While these policies were adjusted in important ways to the new context, Europe shifted gear much less in this area than in others.\nIn 2021, the European Democracy Hub published the first annual review of European democracy support.1 This second review aims to provide an empirical overview of European democracy support policies in 2022. The review covers policies, strategies, and initiatives at the level of the European Union (EU) as well as those of its member states and of non-EU European countries active in democracy support (Norway, Switzerland, and the United Kingdom). It presents information on European efforts to defend and strengthen democracy around the world while highlighting their shortcomings. The aim is to inform debates about policies geared toward upholding democracy internationally.\nRussia’s invasion of Ukraine dominated European policy debates in 2022 in many ways. This review examines the democracy-related consequences of the invasion and of the geopolitical changes it unleashed. Western leaders framed the invasion as a threat not only to Ukraine but also to democratic norms and the rules-based order more widely, and as such it galvanized EU institutions and European governments into new commitments to defend democracy. However, these commitments were far from being the main policy responses; for all the rhetoric about a new struggle to defend democratic values, many elements of European democracy policy were second-order priorities. And, in some ways, the security aspects of the strategic landscape diluted European democracy commitments.\nThe invasion did not alter all aspects of European democracy policy, which in many countries was shaped by domestic political developments. In a year of notable protests and other forms of civic activism around the world, the EU and some member states improved the ways in which they engage with local actors in support of political reform. The EU began to roll out many new programs in its democracy toolbox. Though low-profile, this began to add more tactical sophistication to EU policies. Yet the degree of European support for democratic openings remained modest and, in some places, negligible. And, while much attention was on the global consequences of the war in Ukraine, the EU’s democracy activities moved up a gear to a greater extent internally than externally.\nThis review offers a summary of the main changes to the context conditioning European democracy policies before outlining their evolution at the EU and national levels during the year. It then looks at the war in Ukraine and the democracy-related aspects of the European response to it. The review then delves into more specific aspects of democracy support that were pursued, such as democracy funding, the use of sanctions and conditionality, and democracy considerations in conflict interventions.\nIn line with the previous review, we frame democracy support in a broad sense. The concept lacks a firm definition and this review reflects an elastic understanding of it. Broadly, the analysis considers quantitative and qualitative aspects of European strategies relevant to strengthening democratic practices, norms, and institutions. Democracy support in this sense includes the use of funding for democracy projects, decisions over sanctions, the use of political conditionality, and the incorporation of democracy factors into conflict-related policies. The review looks not only at examples of such democracy support but also instances where democratic considerations were absent from EU policy. Democracy support is understood here as including EU and European action around the world, including within Europe, but not the actions of governments in their country’s domestic affairs.\nSeveral considerations defined the overarching context in which European democracy support policies were formulated in 2022.\nThe trajectory of democratic quality across the world remained broadly negative. European democracy support had to contend with what is now more than a decade-long global trend of weakening democratic norms. At the beginning of 2022, all democracy indices indicated that the world’s democratic recession was continuing.2 In this context, the EU and national governments faced the challenge of countering democratic backsliding and authoritarian influence, and they framed many policies accordingly in defensive fashion. At the start of the year, the policy narratives showed an incipient interest in cooperation among democracies to strengthen support for democracy and to combat authoritarianism.\nRussia’s invasion of Ukraine in February 2022 reshaped the context for democracy support. The geopolitical background against which the EU operates changed profoundly. The war provided a fillip but also a complication for democracy strategies. The invasion was framed as a direct threat to Ukraine’s fledgling democracy and as an attack on the idea of democracy itself. As such, it became a symbol of the global ideological struggle and galvanized democracies in general, and Europe in particular, to band together. Yet it also added strains to democracy across Eastern Europe, inside the EU, and globally. Russia’s flouting of international law and norms threatened to encourage other autocratic regimes into similar aggression. Overall, the interconnectedness of democracy support and geopolitics deepened appreciably in 2022.\nThe COVID-19 pandemic’s weight in shaping the international context receded in 2022 but it continued to have democracy-related impacts. While many governments lifted pandemic restrictions on political freedoms, many others hung on to at least some of their enhanced powers. China’s government continued to implement draconian restrictions and lockdowns under its Zero COVID policy until protests forced it to reconsider late in the year.3 The economic fallout from the pandemic was severe in many regions, and especially in emerging markets, with income losses exacerbating inequalities and economic fragilities.4 Thus the pandemic reopened debates across the world about the role of the state, social resilience, and the need for new economic policies. Even if other crises came to eclipse the pandemic, it still shaped the context for European democracy strategies.\nIntertwined with the war in Ukraine and the slow recovery from the economic impact of the COVID-19 pandemic, Europe’s cost-of-living crisis also dominated the year. With the war pushing up energy prices and Russian supplies set to phase out, Europeans increasingly felt the impact of the new geopolitical context. European governments focused on how to mitigate the impact of rising oil and gas prices as the cost-of-living crisis became one of the most pressing issues. This undermined the stability of many governments and put them under strong pressure to restructure energy markets and the external dimensions of energy security. It also drove adjustments in several areas of EU external policy. In this unsettled economic context, there was high demand for external policies to deliver tangible domestic outcomes rapidly, which, more than in previous years, had consequences for democracy support.\nThe year saw a rapid increase in food prices and severe disruption of food supplies. The war in Ukraine compounded the disruptions to supply chains that COVID-19 had caused. Russia’s blockade on Ukraine, stopping the latter’s exports of grains, hurt Africa, the Middle East, and other developing regions. The United Nations (UN) brokered a deal to restart shipments, but the war made its mark on trade flows. While Europe focused mainly on domestic cost-of-living issues, a growing debt crisis plagued many other parts of the globe, leaving Lebanon, Sri Lanka, Suriname, Zambia, and Zimbabwe in default and other countries at risk. According to the United Nations Development Programme, there were fifty-four developing countries with severe issues in managing debt, amid fears of a global recession.5 The resulting instability was particularly detrimental to young democracies and threatened to set back democratic progress.\nThe year saw a wave of protests around the world. In Iran, the death of twenty-two-year-old Mahsa Amini in police custody after being arrested for violating the hijab law ignited large protests. Their demands centered on the morality police’s abuses, the country’s strict morality laws, and the lack of freedoms for women. Pakistan was also rife with protest around a no-confidence motion against former prime minister Imran Khan and economic problems. The lifting of price caps on liquefied petroleum gas in Kazakhstan sparked mass unrest and a harsh crackdown by the state. Termed “Bloody January,” the unrest reflected people’s outrage with corruption, economic inequality and stagnation, as well as with the intolerance of dissent in the country.6 Mass protests in Sri Lanka removed then president Gotabaya Rajapaksa from office. The country’s population protested frequently throughout the year and the demonstrations were often put down with excessive force. The new president, Ranil Wickremesinghe, also violently suppressed peaceful dissent. Finally, toward the end of the year, protests took place across China against harsh COVID-19 lockdown restrictions. In a notable change, protesters used pro-democracy slogans rather than focusing only on specific policy or corruption concerns.\nWithin the EU, the debate about internal reform deepened. In May 2022, the Conference on the Future of Europe concluded. Its plenary issued an ambitious set of recommendations for the reform of EU policies and institutions. Some of these recommendations focused on the EU’s democratic credentials, and the European Commission began a new citizen panel on food waste in December. However, member states could not reach a consensus on the adoption of the treaty changes required to implement more far-reaching reforms. Friction emerged between member states and the European Commission and the European Parliament, with the latter two pressing for treaty changes. A group of thirteen governments issued a letter rejecting any “unconsidered and premature attempt to launch a process towards treaty change.”7 In her State of the Union speech, Commission President Ursula von der Leyen called for a European Convention to pass democratic reforms.8\nSeveral elections deepened concerns over the state of European democracy. Parliamentary elections in Hungary gave a new mandate to Prime Minister Viktor Orbán’s government, which continues to erode democracy. In Sweden, a new coalition of right-wing parties propped up by the far-right Sweden Democrats came to power. In Italy, Giorgia Meloni became the country’s first far-right prime minister since the Second World War. In Bulgaria, Boyko Borissov returned to power a year after being ousted as prime minister following mass anti-corruption protests. The United Kingdom experienced a year of unprecedented political turmoil that left its reputation for democratic quality in tatters; after two prime ministers were ejected by the governing Conservative Party, Rishi Sunak took office faced with the challenge of restoring well-functioning democratic decisionmaking.\nThe war in Ukraine heightened the significance of transatlantic relations and the midterm congressional elections in the United States provided a potentially encouraging message for cooperation with Europe on democracy support. While the increasingly far-right Republican Party gained control of the House of Representatives, the expectation that it would sweep the board proved wrong. The optimistic reading of the midterms is that the American people rebuked the Republican Party for its drift away from democracy and universal rights, even if the country remains deeply polarized. The elections augured well, in the short term at least, for U.S. commitments to democracy support and for the U.S. administration’s desire and capacity to collaborate with Europe on this agenda, particularly with regard to support for Ukraine.\nThe EU and some national governments agreed and developed new democracy strategies during the year, in many cases as a result of Russia’s invasion of Ukraine, which had a profound effect on European narratives about democracy. The war prompted European governments to increase their commitments to democracy externally and internally. This new geopolitical context combined with other factors and with ongoing improvements to several democracy-related strategies of wider relevance.\nEuropean leaders framed the war in Ukraine as part of an ideological struggle between democracy and autocracy worldwide.9 They emphasized the urgency of defending Ukraine’s incipient democracy alongside its sovereignty. Their message was that the country’s fight is one for global democracy. Most European leaders talked of the battle between democracy and autocracy as a sharper dividing line in international politics.\nIn her State of the Union speech, von der Leyen said: “this is a war . . . on our values and a war on our future. This is about autocracy against democracy.”10 She placed an unprecedented emphasis on democracy, mentioning it twenty-one times compared to only five times in her 2021 speech. Notably, she announced a Defence of Democracy package geared toward limiting foreign influence and fighting disinformation. However, not all rhetoric was quite as clear-cut. High Representative for Foreign Affairs and Security Policy Josep Borrell reiterated the need to support democracy but also said that the EU is “too much Kantian, not enough Hobbesian”—a phrase that seemed to point in the opposite direction.11\nThe European members of the North Atlantic Treaty Organization (NATO) signed off on the alliance’s new Strategic Concept that identifies “advancing authoritarianism” as a key threat. The concept promises increased NATO support to nonmembers in resisting autocratic challenges.12 It also takes a much tougher stance on Russia, and, for the first time, identifies the need to respond to China’s ambitions and policies as a strategic priority. Compared to previous versions, NATO’s new concept places striking emphasis on defending democratic values. In a similar vein, the EU’s new Strategic Compass states that “the EU needs to take a more active stance to protect its values” and that security policy must now be framed around a “competition of governance systems.”13\nThe EU moved further ahead in implementing its Action Plan on Human Rights and Democracy 2020–2024, which serves as a general framework for democracy support.14 The focus in 2021 was on preparatory stages: programming consultations for Civil Society Roadmaps, thematic and country Multiannual Indicative Programs, and drawing up Human Rights and Democracy Country Strategies. In 2022, the focus was more operational. The EU adopted a Multiannual Action Plan for the thematic program on human rights and democracy for 2022–2024 that outlines fifteen actions, each accompanied by an implementation plan.15 Many of these initiatives, such as Team Europe Democracy (TED) and Youth in Politics and Public Affairs, began activities. TED launched its work program and pilot country strategies with fourteen member states: Belgium, Croatia, the Czech Republic, Denmark, Finland, France, Germany, Ireland, Luxembourg, the Netherlands, Poland, Slovakia, Spain, and Sweden.16\nThe EU also moved to deepen ties with democracies around the world. Member states pushed for the completion of EU trade talks with the likes of Australia, Chile, India, and New Zealand, and framed this as part of a “defending democracy” agenda and a search for alternative trade links to those with Russia and, to a lesser extent, China. EU leaders made a dramatically increased number of trips to Africa, Asia, and Latin America with a notable focus on building partnerships based on democratic values in the context of the war in Ukraine.\nA proxy indicator for the strength of democracy commitments can be found in the mentions of democratic values in EU statements and communications. Table 1 shows how frequently key high-level EU officials stressed the importance of democracy support.\nThe European Parliament sought a higher profile in strengthening parliamentary diplomacy through the work of the Democracy Support and Election Coordination Group. It opened new parliamentary exchanges with African, Western Balkans, and Eastern Partnership states. The “Qatargate” corruption scandal that came to light at the end of the year damaged the parliament’s image,17 which could have a detrimental spillover effect on its work in external democracy support.\nIn 2022, the EU sent Election Observation Missions (EOMs), a central instrument of its democracy support efforts, to Colombia, Kenya, Kosovo, Lebanon, Lesotho, São Tomé e Príncipe, and Timor-Leste (see map 1). Seven members of the European Parliament participated in the OSCE’s observation mission to the parliamentary and presidential elections in Serbia.18 The EU also deployed Election Follow-up Missions to Madagascar, Malawi, Mozambique, Nigeria, Senegal, and Zimbabwe. Apart from a brief dip due to the pandemic, the EU has increased the number of Follow-up Missions since the 2010s, which reflects a growing emphasis on the implementation of EOMs’ recommendations. The EU and member states agreed to use recommendations from past EOMs to advance best practices and lessons learned.\nThe EU continued its regular human rights dialogues and consultations with thirty-six partners: Algeria, Argentina, Armenia, the Association of Southeast Asian Nations (ASEAN), Australia, Bahrain, Bangladesh, Brazil, Canada, Chile, Colombia, Georgia, India, Kuwait, Kyrgyzstan, Laos, Mexico, Moldova, Mongolia, New Zealand, Norway, Oman, Pakistan, the Palestinian Authority, the Philippines, Qatar, Saudi Arabia, South Africa, Sri Lanka, Tajikistan, Taiwan, Turkmenistan, the United Arab Emirates, the United States, Uzbekistan, and Vietnam. Other political dialogues also covered human rights issues, such as the ones with Malawi and the Seychelles. Most notably, China agreed to reengage in a human rights dialogue.19 Additionally, the EU and Bangladesh had their first political dialogue, which covered issues related to democracy, fundamental freedoms, and the rule of law.20 EU priorities in United Nations human rights fora included Afghanistan, Belarus, China, Ethiopia, Myanmar, Syria, and Turkey, in addition to the war in Ukraine.21\nThe EU introduced several new regional strategies, most of which mentioned democracy but without prominence. The Strategy for Cooperation in the Indo-Pacific envisions strengthened cooperation on seven priorities, which do not include democracy-related issues but rather focus on security and economic growth.22 The French presidency of the Council of the EU and the high representative for foreign affairs and security policy also co-organized a Ministerial Forum for Cooperation in the Indo-Pacific, during which the EU and thirty countries from the region highlighted their shared ambition to “reaffirm commitment to a rules-based international order, democratic values and principles.”23 However, the forum planned no concrete actions in the field of human rights and democracy. In another notable development for partnership with the region, the EU and ASEAN celebrated forty-five years of relations and launched the ASEAN-EU Blue Book 2022.24 The Blue Book does not feature democracy-related issues among its seven policy priorities, however. More concrete actions were outlined following the Fourth EU-ASEAN Policy Dialogue on human rights, which envisioned, among other initiatives, a strengthening of the ASEAN Intergovernmental Commission on Human Rights.25\nThe European Commission’s DG NEAR (Directorate-General for Neighbourhood and Enlargement Negotiations) published Renewed Partnership with the Southern Neighbourhood—A New Agenda for the Mediterranean, which contains a commitment to action on democracy support in the region, although with economic, energy, and security challenges as the clear priorities.26 The Council of the EU approved conclusions on a strategic partnership with the Gulf region.27 While these two documents explicitly aim to enhance cooperation on human rights, they contain no mention of democracy. The EU also opened a new delegation in Qatar to increase people-to-people contacts; at its inauguration, Council President Charles Michel celebrated Qatar’s many advances in various fields such as security and energy. There was, however, no mention of Qatar’s human rights abuses nor a call for a better human rights situation in the country.28 These omissions were all the more evident against the backdrop of the football World Cup being held in Qatar in November and December and the Qatargate corruption scandal.\nThe EU-African Union Summit in February saw few concrete policy developments on democracy.29 Human rights language was watered down and kept out of the summit declaration, despite the recent wave of military coups in Africa. At the margins of the summit, Commissioner for International Partnerships Jutta Urpilainen launched the first Europe-Africa week, which included a dedicated track aimed at fostering participatory and transparent governance.30 In November, the European Commission and the African Union Commission issued a statement taking stock of progress from the summit and agreed more commitment was needed in response to a rising number of anti-constitutional changes of government in Africa.31 The EU proposed a cooperation agreement between African countries and Frontex, the EU border and coast guard that was often denounced in 2022 for its lack of transparency and for neglecting human rights violations. This was a step likely to damage democracy support efforts in Africa by strengthening the focus on “Fortress Europe” security cooperation.32\nDespite the democracy narratives surrounding the war in Ukraine, the second U.S.-led Summit for Democracy was pushed back from 2022 to 2023. It will be co-hosted on March 29–30, 2023, by Costa Rica, the Netherlands, South Korea, the United States, and Zambia. At the first summit in December 2021, European countries made commitments to strengthen democracy domestically and internationally, but there was no open reporting on implementation of these during 2022. Only a few commitments could be verified, the majority of which are yet to be implemented. Key ones include increased funding for media freedom initiatives and support for civil society and human rights defenders. Overall, however, European commitments under, and new funds for, the summit process were more modest than those of the United States.33\nSeveral EU member states worked as part of “democracy cohorts” to help advance cooperation on certain themes in the run-up to the 2023 summit.34 The European Commission took the lead role in the youth political and civic engagement cohort, together with Ghana, Nepal, and other partner organizations. Ireland and the commission lead the deliberative democracy and citizens’ assemblies cohort. Sweden and Romania were active in the gender equality cohort. Latvia joined like-minded stakeholders in hosting the disinformation cohort. Estonia and the United Kingdom led the technology for democracy cohort. Lithuania joined the cohort on resisting authoritarian pressure. Spain is planning to organize a cohort on the inclusion of vulnerable groups. The Czech Republic and Norway were active in a civic space cohort. The Netherlands was involved in the press freedom cohort, and it is set to lead a regional cluster for Europe.\nMany European countries made democracy support a central aim of their foreign policy, including as a result of internal political developments.\nGermany’s change in government in December 2021 had some positive implications for democracy support policies. The new foreign minister, Annalena Baerbock, from the Greens, was particularly vocal in placing support of democracy and human rights at the center of the country’s external relations, especially through the prism of a promised feminist foreign policy. She convened a conference on strengthening democracy that brought together African and G7 government and civil society representatives, and she urged democracies to “join forces” in the face of new threats.35 After Russia’s invasion of Ukraine, Chancellor Olaf Scholz announced a major shift in foreign and security policy.36 So far this has focused narrowly on security with the government developing Germany’s first national security strategy since the Second World War.37 Though the “right to freedom” and democracy are envisaged as one of the three pillars of the security strategy, the main focus is on a more traditional securitization of foreign policy.\nIn the Czech Republic, the new government led by Prime Minister Petr Fiala pushed the country in a direction more supportive of democracy and human rights protection than in previous years.38 Its Program Statement published in January 2022 lists support for democracy, human rights, and civil society as a top priority. The government approved a draft law for a human rights sanctions regime and promised to strengthen relations with Taiwan and other democratic partners in the Indo-Pacific region.39 The Czech presidency of the Council of the EU in the second half of 2022 also had democracy support as a priority.\nIn France, President Emmanuel Macron promised during his reelection campaign to move into a new era of relations with Africa based on less support for friendly dictatorships.40 Nonetheless, his new government still lacked a democracy strategy and its overall approach to Africa remained focused on counterterrorism in the Sahel region. This is striking given the number of coups there and the controversies related to the French government providing intelligence cooperation and authorizing the sale of spyware to the Egyptian regime.\nThe United Kingdom’s political turmoil distracted the government from a clear and consistent focus on democracy support. In early 2022, then foreign secretary Liz Truss affirmed the country’s “need to fight for the rule of law, freedom and democracy.”41 She talked about the need to defend democracy globally when she took office as prime minister, but the chaos of her short tenure prevented progress on this. In his first foreign policy speech, her successor, Rishi Sunak promised the United Kingdom would do more to defend democracy and liberal values “by actions not just words.” Speaking of the need for “robust pragmatism,” he acknowledged the challenge posed by China and condemned its crackdown on peaceful protests, human rights abuses in Xinjiang, and curtailing of freedom in Hong Kong.42\nDespite its political turmoil, the United Kingdom continued to implement its 2021 Integrated Review of Security, Defence, Development and Foreign Policy, which outlines the government’s strategy up to 2025.43 The government appointed a new geopolitics director in the Foreign, Commonwealth and Development Office, with a remit of pushing back against authoritarian influence.44 In May, the United Kingdom also adopted a new international development strategy. While this does not include democracy as one of its four priorities, it states that “by supporting the principles of freedom, democracy and self-determination,” the country will address the root causes of “instability, conflict, and human suffering.”45 The strategy promises support for democracy, mainly as an adjunct to a tighter focus on economic development.46\nDenmark’s new Foreign and Security Policy Strategy 2022 contains a strong commitment to democracy, which is one of the priority areas. It emphasizes the need to combat authoritarian influences and to support democracy and human rights defenders, committing Denmark to becoming an “active voice for democracy.”47 Denmark also introduced new operational guidelines to increase the focus on democracy on the ground through in-country funding and diplomacy.48 Norway’s new government elected in September 2021 made democracy support a more explicit priority, with a particular emphasis on gender equality, local democracy, and respect for minorities.49 Finland upgraded democracy support within its development policy.50\nThe change in government in Sweden raised doubts over whether the country would continue to be the EU’s leading advocate for democracy policy, given the new one’s reliance on support from a far-right party. The new government revoked its predecessor’s feminist foreign policy. While officials said that there would be continuity at an operational level, the government did not formally prioritize democracy issues but rather strategic concerns such as the economic and energy crises. Its promise to restrict asylum provisions is likely to undermine Sweden’s image as a human rights champion abroad. The government did, however, adopt a tougher stance on China by condemning its latest rhetoric toward Taiwan.51\nThe new far-right-led government in Italy did not make new commitments or changes in democracy support. While Prime Minister Giorgia Meloni took a firm stance against Russia, the Brothers of Italy party’s positions on immigrants, minorities, and LGBTQ people sat uneasily with the country’s international human rights commitments. By the end of the year, it was still unclear how the change in government might impact external democracy support measures, which in Italy are often decided and carried out not by the higher political leadership but by lower administrative branches.\nSlovenia elected in November its first female president. Although the position is mainly ceremonial, Nataša Pirc Musar orchestrated her campaign around her commitment to the rule of law and, once elected, reaffirmed her pledge to promote fundamental rights and democracy.52 Malta announced a new foreign policy strategy that stresses “support for political, economic and religious freedoms, liberal democracy, the rule of law, racial and gender equality and mutual respect.”53 Luxembourg moved to implement its Agenda 2030 foreign policy strategy, which foregrounds a commitment to democracy, and it sponsored an OECD Global Forum on Reinstating and Rebuilding Trust in Democracy.54\nPortugal adopted a new Cooperation Strategy 2030 that highlights the defense of civic space, promoting participatory democracy, and upholding human rights. Belgium completed its two-year mandate in the UN Security Council where it pushed for more direct involvement from civil society organizations and human rights defenders. The government published a new policy note listing its foreign policy priorities that promises more support for consolidating democracy in fragile contexts, such as the Great Lakes region.55\nIn addition to its external commitments, the EU developed new initiatives related to democracy in Europe. This internal agenda was the more dynamic area of policy development in 2022.\nRegarding citizens participation, the EU Work Program 2022 promised a new push for European democracy based on following up the Conference on the Future of Europe, the European citizens’ initiative, a new European Media Freedom Act, and a toughened 2022 Rule of Law Report.56 EU leaders also promised a Defence Democracy Package, which is due to be published in 2023.57\nIn May, the report on the final outcome of the Conference on the Future of Europe was presented, which included several democracy-related proposals.58 The European Commission adopted a communication setting out follow-up measures,59 and organized a feedback event in December. This communication also included promises to hold more citizen panels, mainly under the Better Regulation framework, and to have a citizens’ report as part of the impact assessment for new legislation. Panels made up of young people will constitute a “youth test.” In her State of the Union speech, von der Leyen said that citizen panels are to become “a regular feature of our democratic life.”60 Three of these are due to take place on specific legislative proposals; after some internal debate, this route of ad hoc policy panels was preferred to creating one permanent citizen assembly. However, by the end of the year no other far-reaching democracy measures had been agreed, with debate focusing more on arguments for and against treaty change.\nIn July, the European Commission published the Rule of Law Report 2022, which contained country-specific recommendations.61 The report places a new and considerable emphasis on media freedom and the safeguarding of democratic norms online. It points to decreases in the degree of judicial independence in a majority of member states. It notes risks to media freedom and pluralism in all member states, and it finds Bulgaria, Greece, Hungary, Malta, Poland, Romania, and Slovenia to be high-risk countries. While the production of country-specific recommendations is an important step forward, these are vague and there is no structure to ensure their implementation.\nSpain faced growing scrutiny over its four-year failure to renew the mandate of its General Judicial Council and, consequently, to fill vacant positions on its Supreme Court and other courts. Commissioners for Justice Didier Reynders and for Values and Transparency Věra Jourová engaged more critically on this blockage, the latter describing it as “four years of institutional abnormality.”62\nIn March, the Council of the EU reached an agreement on a recast regulation governing European political parties and political foundations.63 This aims to enhance the transparency of European political parties and to counter foreign interference. In the same month, the European Parliament adopted a report on “Foreign interference in all democratic processes in the European Union.”64 Following the alleged misuse of Pegasus surveillance spyware against journalists, politicians, activists, and lawyers, the parliament established a committee of inquiry to investigate the use of Pegasus and other surveillance spyware, which is scheduled to submit its final report in early 2023.65 The committee held hearings on the use of spyware in Cyprus, Greece, Hungary, Poland, and Spain.\nIn 2022, media freedom and the fight against disinformation were given a prominent place in EU internal reforms. A new European Media Freedom Act promises safeguards against political interference in editorial decisions and against surveillance, although not binding rules on transparency in ownership.66 The European Commission pushed Greece hard on interference in the media sector and in response the country’s government loosened some of its proposed new powers over journalists. The commission presented legislation to protect journalists from strategic lawsuits against public participation.67 This includes a package obliging governments to take action against the increasing use of abusive lawsuits against journalists and media outlets. In June, the Council of the EU approved conclusions on the protection and safety of journalists and media professionals, which calls on the commission to increase funding for independent and investigative journalism.68\nThe Digital Markets Act was adopted in October.69 This obliges “gatekeeper” service providers to comply with more rigorous obligations regarding online content monitoring. In November, the Digital Services Act entered into force, with the aim of establishing a level playing field for businesses and creating a safer digital space where the fundamental rights of users are protected.70 In June, the EU issued a new anti-disinformation Code of Practice, which gained an increased number of signatories.71 The Council of the EU adopted conclusions on foreign information manipulation and interference that promise tighter international norms on disinformation and stronger capacities to resist it.72 Debate continued over whether this suite of new measures was far-reaching enough to improve digital democracy significantly.\nWithin the framework of the EU–U.S. Trade and Technology Council, the European Commission coordinated with the U.S. government on human rights and democracy principles on social media.73 The EU and the United States also issued a joint declaration on the future of the internet,74 which underlined a shared commitment to upholding human rights online and across the digital ecosystem, and a statement on protecting human rights defenders online.75 The European Data Protection Supervisor pushed for stricter rules for online political advertising, including a full ban on microtargeting for political purposes, and the commission hopes to have new rules on this issue in place by spring 2023, one year ahead of the 2024 European Parliament elections.76 In November, member states, the parliament, and the commission agreed a European declaration on digital rights and principles for the digital decade, which aims to promote and protect fundamental rights, the rule of law, and democracy in digital transformations.77\nThe most immediate and specific democracy-related challenges in 2022 arose around the war in Ukraine. While European leaders framed the war in terms of defending democratic values, most elements of EU policy were not focused on democracy support as such. In some ways, democracy and democracy support intertwined with Western efforts to buttress Ukraine and to isolate Russia. Yet, when it came to policy decisions, other priorities were of higher strategic importance, at least in the initial stages of the conflict. EU reactions to the war contained some democracy support elements but this focus was limited.\nThe EU incrementally ratcheted up its sanctions against Russia throughout 2022. While each successive tightening prompted discord among member states, agreements were ultimately reached to cut off links and exchanges with Russia progressively. After regular upgrades, by the end of the year the punitive measures adopted by the EU, Norway, Switzerland, and the United Kingdom included sanctions on hundreds of prominent individuals, trade bans on many sectors of the Russian economy and several media outlets, the exclusion of several banks from the Swift international payments system, the removal of Russia’s most favored nation status, the phasing out of oil imports, and more restrictive visa rules for Russians.78 More measures were adopted in response to Russia’s formal annexation of four Ukrainian territories.\nDespite the unprecedented severity of these restrictive measures, Ukraine became increasingly frustrated that the EU refused to entertain full-spectrum sanctions. By the end of the year, the sanctions still did not include a gas embargo or complete travel ban on Russians, did not cover nuclear fuel, and gave an exception to Hungary and Slovakia for oil imports.\nThe sanctions were not strictly related to democracy but to Ukraine’s territorial integrity and international law. Still, European governments did frame them as a pushback against Russia’s authoritarian expansionism and there was in practice some overlap between war-related measures and efforts to defend and strengthen democratic norms.\nThe largest part of European financial contributions to Ukraine was for military support as the priority was to help its forces fight the war. By the end of 2022, the EU had provided €3.1 billion in military aid through the European Peace Facility, a first use of this instrument for armaments.79 Cyprus, Hungary, and Malta were the only EU countries not to provide any weapons to Ukraine, while Austria and Ireland provided only nonlethal equipment in line with their policy of neutrality. As of November 20, of all European states, the United Kingdom offered the most and widest range of advanced offensive weaponry, with its military support at over £4 billion. U.S. military aid of €28 billion far exceeded European efforts.80\nThe long-running EU Advisory Mission to Ukraine was tasked with dealing with refugees and investigating crimes committed by Russian troops.81 A handful of states offered training to Ukrainian troops, with the United Kingdom’s program by far the largest. Only toward the end of the year did the EU agree to begin a training mission for Ukrainian forces, after extended debate delayed this over several months. The newly established EU Military Assistance Mission in support of Ukraine will provide training only outside Ukraine.82 Perhaps the most notable impact of the war was to push EU governments to increase their own defense budgets and capabilities. Nearly all member states promised to increase defense spending to 2 percent of gross domestic product.83 There was no equivalent hike or promise in relation to democracy funds.\nThe EU offered Ukraine a €9 billion aid package in May and later in the year promised the country a further €18 billion in 2023.84 Of the €9 billion package, €6 billion was disbursed by the end of the year, and the Ukrainian government complained about delays to this aid’s delivery. The United States’ nonmilitary aid was greater than that from European states. The EU set up a Ukraine Reconstruction Platform to coordinate aid efforts.85 Understandably, the short-term focus was on emergency relief, covering the government’s day-to-day budget expenses and physical reconstruction. Still, the European Commission promised to “reallocate funds from EU programs to support civil society organizations, human rights defenders, journalists, and pro-democracy activists,” that democracy would become a more prominent part of reconstruction aid over the medium term, and that the €18 billion package in 2023 would come with democratic conditions attached.86 The United Kingdom set up a Partnership Fund for a Resilient Ukraine of around €20 billion.87 Norway disbursed €221 million to Ukraine and its neighboring countries.88 Switzerland also increased its aid to Ukraine, focused on delivering around €100 million in humanitarian aid in the country and the neighboring region.89\nRussia’s invasion of Ukraine catalyzed talks on the EU’s enlargement in its eastern neighborhood. In June, the EU granted candidate status to Moldova and Ukraine.90 Both countries had to carry out key reforms before negotiations were opened, especially on judicial independence, corruption, oligarchs, and media freedom.91 Despite the war, there were many efforts in Ukraine to start moving toward sectoral alignment and to prepare the economy for accession commitments. With negotiations not actually opening in 2022, civil society organizations in the two countries cautioned that an accession perspective was not a substitute for active democracy support and that accession needed to advance faster in order to provide a good incentive for democratic reforms.\nThe EU gave Moldova’s reformist government more assistance—especially for justice reform, cybersecurity, and managing refugees and other impacts of the war. The EU focused on building the state’s capacity to carry out pre-accession reforms and addressing Moldova’s economic and security vulnerabilities. With the government struggling to retain support domestically, the EU insisted it had learnt the lesson not to tie its support too tightly to one particular pro-EU government but to focus more on institutional capacities instead. France, Germany, and Romania led a Moldova Support Platform to boost support and over a dozen European foreign ministers visited the country during the year.92 Romania granted Moldova an additional package of nonrefundable financial assistance worth €10 million.93\nIn a case of tough conditionality, EU leaders refused to give Georgia candidate status. The country is most advanced in the implementation of a Deep and Comprehensive Free Trade Area but was deemed to be suffering significant democratic backsliding. The EU laid out a detailed list of reforms that Georgia must implement to receive candidate status and announced it would not revisit its decision until the end of 2023. The Georgian government created nine working groups covering the EU’s conditions and introduced some reforms, for instance, to the electoral code. Civil society groups and some political parties participated in these but the main opposition party did not. While the conditions were detailed, the EU took a slightly more hands-off approach in 2022 after its very involved mediation in 2021 seemed to backfire and draw its officials into Georgia’s highly personalized political rivalries. The EU did not grant Georgia any of its “umbrella funds” allocation in 2022.\nIn general, member states were divided on accession for Georgia, Moldova, and Ukraine: some pushed for flexibility toward the three countries on geopolitical grounds while others insisted on more stringent pre-accession democracy conditions.\nThe EU launched accession talks with Albania and North Macedonia in July and granted candidate status to Bosnia and Herzegovina in December, the latter decision despite political turmoil following elections and a general lack of progress on political reforms in Bosnia as a whole.94 In general, a softening of democratic conditionality was evident in dealings with the Western Balkan countries, with the objective of locking the region into the EU’s orbit more firmly. There was a striking increase in the number of high-level visits to the region by Council President Charles Michel and other senior figures from EU institutions and member states. A range of new European sectoral cooperation began in the Western Balkans under a revival of the Berlin Process.\nThe France-initiated European Political Community gathered forty-four leaders in October and was framed as being about defending democracy in support of Ukraine.95 In practice, this first summit did not discuss democracy support as such, and several nondemocracies were included. It focused largely on defense capacities, the energy crisis, food security, and coordinating pressure on Russia, but did not include anything new in concrete terms for Ukraine. The participating countries kept the new initiative as a venue for informal strategic deliberation rather than for formal convergence on certain policies or integration measures. This inaugural meeting was not of tangible operational relevance to democracy support even though the European Political Community was billed as a new alliance of all European democracies.\nAny focus on democracy was eclipsed by the energy crisis, which followed the invasion of Ukraine. European governments channeled huge amounts of money into domestic energy and cost-of-living packages that ran into the hundreds of billions of euros while member-state support for democracy continued to amount to tens of millions. A key priority was the search for alternative gas supplies to replace Russian ones. The year saw a procession of member-state and EU leaders visiting, among others, Algeria, Azerbaijan, Egypt, and the Gulf states. New agreements were signed with some of the world’s most repressive regimes. The EU and Azerbaijan agreed on a Strategic Partnership in the Field of Energy to double gas supplies.96 The exploitation of gas resources in the Eastern Mediterranean involved a new accord with Egypt and Israel.97 Germany agreed on a contract with Qatar for the supply of liquefied natural gas.98 Italy’s new partnership with Algeria made it the country’s largest gas purchaser. Italy also signed new deals to boost natural gas imports from Angola and the state energy company Eni agreed to increase gas production in the Republic of Congo.99 Energy was also a factor behind redoubled EU efforts to cooperate with Iran, until these ran aground due to the protests later in the year.100 At the UN COP27 climate change conference in November, the EU signed a raft of accords for hydrogen supplies with authoritarian regimes.101\nEuropean internal and external democracy aid increased to a modest degree. Such funding also extended to new kinds of partners and was deployed in new tactical ways. Yet, its scale remained relatively limited, especially when compared to the much larger amounts of money forthcoming during the year for security and energy policies.\nThe Neighbourhood, Development and International Cooperation Instrument (NDICI) – Global Europe budget for external action has a budget of €79.9 billion under the Multiannual Financial Framework (MFF) for 2021–2027.102 This was an increase of €1 billion from the previous MFF. Initial projections for total external spending in 2022 amounted to approximately €12.7 billion. For geographic programming there was a target of at least 15 percent to be spent on human rights, democracy, and good governance.\nThe Global Europe Human Rights and Democracy program launched in December 2021 began funding activities, with an allocation of €1.5 billion for the period up to 2027.103 Notably, the funding rules allow civil society actions to be supported without the consent of partner countries’ governments. The instrument can support activities in any country outside the EU and at the global level. It has five overarching, somewhat imprecise, priorities:\n- protecting and empowering individuals (€704 million);\n- building resilient, inclusive, and democratic societies (€463 million);\n- promoting a global system for human rights and democracy (€144 million);\n- safeguarding fundamental freedoms and harnessing digital technologies (€195 million); and\n- delivering by working together (€6.6 million).\nThe EU began to roll out its new flagship Global Gateway funding in 2022.104 It claimed this would advance a “human rights-based approach” to infrastructure projects. European Commission funds and European Investment Bank loans of €27.3 billion were allocated for Global Gateway investments.105 More than two-thirds of this amount was for investments in enlargement and neighborhood countries. The rest was allocated for partner countries in Africa, Asia, the Caribbean, Latin America, and the Pacific. Commission President Ursula von der Leyen referred to the democracy-related dimension of the Global Gateway as “a new way of promoting our democratic values at all corners of the world,” and she claimed that it would improve civic, digital, and labor rights, while China’s Belt and Road Initiative hinders these.106 The EU did not spell out, however, how nonpolitical investment in infrastructure, including in authoritarian countries, will support democracy in practice. More generally, concerns grew that inflation risked dramatically reducing the value and leverage of all these various sources of external funding.107\nSome member states expanded their external democracy programs, but the picture relating to their funding remained opaque. As noted in our review last year, few European governments have clearly structured democracy funding arrangements, and this deficiency was just as stark in 2022. Almost none was able to specify how much it had to spend on democracy in its external funds during the year. Governments are able to measure their democracy spending only ex post, through OECD data that takes two years to be compiled. As we stressed last year, this disorganization and lack of clarity sets democracy aid apart from other areas of external action, like easily quantifiable defense, climate, migration, or health-emergency spending. There were no efforts to address this in 2022. European donors insist that democracy aid is difficult to define, yet the United States pre-allocates precise and identifiable amounts for democracy.\nAs a result, only a partial picture of European democracy funding can be drawn, comprising the key trends and examples below:\nFrance announced an increase of €860 million in its development assistance, but it did not stipulate how much of this would be for democracy support.108 It launched the Innovation Foundation for Democracy, with a budget of €50 million, to promote democracy among youth and to “revitalize democracy in Africa.”109\nGermany’s Federal Ministry for Economic Cooperation and Development (BMZ) had a budget of €12.35 billion in 2022.110 Germany does not pre-allocate a specific amount for democracy; it works back from how much is spent related to democracy within country programs after these have been completed for the year.\nDenmark’s development cooperation budget was €2.34 billion in 2022.111 By December, more than €266 million had been disbursed to programs classified as “Government and Civil Society – General.”112 Finland’s proposed development cooperation budget for 2022 amounted to €1.34 billion, with €88 million earmarked to support civil society organizations and €3 million for the democracy organizations Demo Finland and the Rule of Law Center. Finland made Moldova, Syria, and Ukraine eligible for development aid and provided a €70 million top-up to its aid budget for Ukraine.113\nBelgium’s development agency, Enabel, carried out democracy support projects that accounted for approximately 15 percent of the country’s development aid in fragile countries (around €45 million). While Luxembourg continued to spend the UN-recommended 0.7 percent of gross national income on official development assistance (ODA), only 5 percent of this (€24 million) went to democracy support.\nSpain’s government presented a law on Cooperation for Sustainable Development and Global Solidarity, with a commitment to spend 0.7 percent of gross national income on ODA by 2030.114 In 2022, its development aid increased by almost €400 million but it was unclear how much of this would go to democracy support.\nItaly allocated for 2022–2024 a €2.5 million fund for initiatives and projects in the area of electoral assistance to third countries and countering electoral interference, a minor increase from the €2.4 million allocated in 2019–2021.\nCentral and Eastern European states generally increased their democracy funding and were better at quantifying democracy support, but the scale of this was extremely modest. Poland enhanced its financial allocation for the Solidarity Fund PL, a state-funded entity whose activities are dedicated to democracy support, from €5.6 million in 2021 to €7.5 million in 2022.115 Romania increased its international cooperation budget with approximately one-third (a modest €152,000) allocated to democracy support.\nThe Czech Republic approved an increase in funding for the Transformation Cooperation Program of the Ministry of Foreign Affairs, which supports activities oriented around building democratic institutions, protecting human rights, and supporting civil society and good governance.116 In 2022, approximately €2.66 million was allocated for these purposes, an amount set to increase to €4.37 million in 2025.\nLatvia’s development cooperation budget rose from €500,000 in 2021 to a still limited €1.3 million in 2022. Nearly half of the cooperation projects were dedicated to fostering democracy, good governance, the rule of law, and civil society participation in third countries. Lithuania and Estonia promised increased funds for democracy respectively under their Strategic Directions for Development Cooperation 2022–2025117 and Development Cooperation and Humanitarian Aid Program for 2022–2025.118 Their priority target area remains the Eastern Partnership states.\nOutside the EU, Norway’s aid budget for 2022 was €4 billion, an 8 percent increase from 2021, with increases for democracy.119 Switzerland boosted its overall funding for a variety of projects focused on human rights, democracy and the rule of law, governance, and gender.120\nThe United Kingdom’s ODA remained at 0.5 percent of gross national income, maintaining the controversial reduction from 0.7 percent announced in 2021. The government cited the economic crisis as reason to place some areas of external funding on pause. In November, it announced that it does not expect a return to 0.7 percent before 2027.121 The new development minister, Andrew Mitchell, has pushed for an increase to the aid budget. The amount of money available for external projects was constrained by the fact that more than €4.5 billion meant for development aid in 2022 was spent domestically to support increasing numbers of asylum seekers and refugees.122 Although the government did not set out in advance how much it would spend on democracy during the year, some work on democracy was negatively affected by the above.\nMany interesting democracy projects and initiatives were carried out in different regions under the different EU and national funding streams. Below is a selection of examples:\nThe EU Neighbours South program launched EU Jeel Connect: Connect, Act, Lead—a network of young people across the southern neighborhood, led by eight “focal points” from Algeria, Egypt, Jordan, Lebanon, Libya, Morocco, Palestine, and Tunisia.123 The EU also provided new funding for local-level participative democracy in Algeria. In the Gulf region, it implemented two new programs on women’s leadership and youth engagement, which was seen as an oblique way to address political issues.\nIn Latin America, the EU created a new set of initiatives to fund human rights defenders in Colombia and launched a new call for proposals in support of civil society, human rights, and democracy with a budget of €6.1 million to finance projects in Argentina.124\nIn the Western Balkans, the European Commission developed a more flexible approach to funding that allowed recipient states to have more say in selecting priorities, in an effort to move beyond the impasse in acquis alignment in many cases. Many governments in the region chose to prioritize cooperation on judicial prosecution processes.\nThe European Commission began a new 2022–2027 initiative titled EU Support to Democratic Governance in Nigeria Phase II, worth €39 million.125 This is the successor to a program that also targeted electoral processes but had a significantly lower budget (€26.5 million). Informed by the findings of earlier Election Observation Missions, this initiative aims to promote transparent, inclusive, and credible electoral processes in the country ahead of the 2023 general elections.\nSome of the EU funds allocated for Belarusian civil society in 2021 were spent in 2022, with most going to dissidents in exile or to emergency grants to ensure the personal safety of activists, although it was possible to provide some small funds to support groups in the country. The shift in the EU’s focus and efforts to the war in Ukraine presented a challenge for the democratic movement in Belarus, however. Denmark, Germany, and the United Kingdom launched an initiative to document serious human rights violations in Belarus.126 Austria provided €50,000 to a training program for Belarusian civil society.\nSweden adopted seven regional and thematic strategies for 2022–2026 with democracy among their key objectives. The strategy with the most funds (approximately €255 million) was for Asia.127 Sweden also provided more support to civil society organizations and human rights defenders in Syria.128\nDemocracy funding by the Baltic states was closely related to the war in Ukraine. Lithuania launched a Frontline Democracies coalition to strengthen the resistance of democratic societies. It also continued to provide a safe haven for Belarusian opposition leader Sviatlana Tsikhanouskaya. Estonia’s priority was to strengthen democracy and empower local governments in Eastern Partnership countries.129 Latvia funded new projects on countering disinformation in Moldova; on inclusive human rights education in Georgia, Moldova, and Ukraine; and on capacity building for judicial reform in Ukraine.130\nMedia freedom was one issue that received increasing attention. Austria organized a conference on the safety of journalists.131 Denmark expanded the scope of its Tech for Democracy Initiative, which has a budget of €28 million over a period of four years.132 It also completed the two-year pilot period for the project Claim Your Space, which provides emergency funding to civil society actors under threat.133 Switzerland announced €2.6 million in support to the International Fund for Public Interest Media.134 France pledged €15 million to this fund over the next three years.\nThe Netherlands enhanced its efforts to support independent Russian-speaking media, including by assisting the networks of exiled human rights defenders; for example, by facilitating their registration in the country. The government also allocated €2.5 million to the Tech Protect program and €15 million to fund investigative journalists. Slovakia pledged to double its foreign aid assistance for independent media and investigative journalism. Germany launched the €3.5 million Hannah Arendt Initiative to support journalists and media from conflict areas abroad or in exile.\nPromoting women’s empowerment was another growing priority. Demo Finland provided training to more than 360 women politicians in seven provinces in Sri Lanka.135 Spain’s Masar Program carried out new projects on gender and women’s leadership in the Arab world.136 Belgium supported gender equality through a €3.4 million project on women’s leadership and entrepreneurship.\nThere was also a stronger emphasis on anti-corruption. Croatia and the United Kingdom funded an anti-corruption conference that brought together the ministers of justice from the Western Balkans.137 Italy earmarked €2 million for initiatives and projects countering corruption in Africa and Latin America for the period 2022–2024.\nAfter a late start in 2021, the EU’s €1.55 billion Citizens, Equality, Rights and Values (CERV) program moved into its implementation phase. This was the main funding program for internal EU democracy support, although its funds were not all related to or necessarily helpful for democracy. The CERV budget for 2021–2027 is split into the following categories:\n- Union values: €690 million\n- Equality, rights, and gender equality: €470 million\n- Citizen engagement and participation: €395 million\nCERV had an annual budget of just over €200 million for 2022, split across four action areas:138\n- Protect and promote Union values: €91 million\n- Promote equality and rights: €40 million\n- Promote citizens’ engagement and participation in democratic life: €40 million\n- Prevent gender-based violence and promote child rights: €29 million\nUnder CERV, the European Commission for the first time made funds (€51 million) available to intermediaries for re-granting and capacity building in the civil society sector, as well as an additional €2 million for organizations engaged in strategic litigation and training related to the EU Charter of Fundamental Rights. Still, concerns remain about CERV’s relative lack of flexibility and high administrative burden, which could limit its effectiveness.139\nThe European Parliament raised CERV’s budget for 2023. This will bring an additional €2 million to the strand for tackling gender-based violence and €1.5 million to the strand for citizens’ engagement and participation, the latter with the aim of ensuring effective follow-up to the Conference on the Future of Europe. The grantees were primarily nongovernmental organizations from Eastern and Southern Europe.\nThe European Commission increased its commitment to strengthening the media sector through the media-focused arm of the Creative Europe Programme, which had a budget of €226 million for 2022.140 The motivations for bolstering media support included the impact of COVID-19 on media actors, the threats to the pluralistic media environment, and the need to adapt to new business models.\nIn April, the EU allocated increased funds to support cross-border journalism.141 In September, the European Commission opened four calls with a budget of around €6.5 million aimed at supporting media freedom and media pluralism.142 Additionally, seven projects are being implemented to foster media pluralism and to assist media self-regulation bodies. The commission launched the European Newsroom project, with a budget of €1.76 million, to host correspondents of eighteen press agencies under the coordination of the Deutsche Presse-Agentur and to carry out independent reporting on EU affairs.143 The EU signed a grant worth €2.2 million with the radio network Euranet Plus to support the coverage of EU affairs via radio. In November, the commissions launched a €10 million call for journalism partnerships, an increase of €3 million from previous years. For the first time, part of this fund will be provided to organizations working on sectors that are of special relevance for democracy, such as investigative journalism. Overall, €14.6 million were made available to support multimedia actors in Europe through the 2022 Financing Decision on Multimedia Actions, a program managed by the Directorate-General for Communications Networks, Content and Technology.144\nThe European Digital Media Observatory, an independent platform dedicated to combating disinformation, announced plans to extend hubs to all EU countries and Norway.145 The Digital Europe Programme will support this expansion, set to be operational in 2023, with €8 million.146 Italy, where the leading consortium is based, provided the project’s initial funding of €11 million through the Connecting Europe Facility of the EU.147\nIn 2022, the Horizon program managed by the Directorate-General for Research and Innovation made approximately €81 million available for research in the sphere of democracy. This was the second year it focused on supporting such research.\nThe EEA and Norway Grants, which support good governance and civil society among other issues, continued to flow to fourteen EU target countries.148 Under a 2019–2022 funding cycle for active citizen programs, a new call opened with budgets of €780,000 for Romania, €170,000 for Lithuania, and €76,287 for Slovakia. Additionally, a new call for proposals worth €329,860 was opened to support civil society and strengthen its role in promoting democratic participation in Estonia. The grant scheme remained suspended in Hungary.\nAlthough many of its leaders talked of it becoming a harder-edged power in the wake of the Ukraine invasion, the EU did not increase its use of sanctions or conditionality specifically in relation to democracy support.\nThe EU did not make any significant use of its Global Human Rights Sanctions Regime in 2022. Three rounds of sanctions were imposed under the regime’s remit in 2021, the latest in December 2021 targeting Russian individuals. After what was widely seen as an active first year, the regime seemed to lose prominence in 2022. No further sanctions were imposed within this framework, with the packages adopted against Russia and other countries falling under country regimes. In part this was because capacities were directed at Russia, drawing away the considerable resources needed to gather evidence under the global regime.\nThe future of the human rights sanctions regime remains uncertain and the subject of much debate. If no more sanctions are adopted under the regime before its upcoming review in 2023, it runs the risk of becoming dormant. Additionally, many diplomats felt that the listings made in 2021 reflected foreign policy interests rather than objective human rights criteria. Diplomats were also concerned about listings being susceptible to legal challenge, which had a chilling effect in 2022.\nThe EU’s sanctions regime still does not include a corruption criterion, as is the case in the Canadian, Australian, UK, and U.S. regimes. In her State of the Union speech, President Ursula Von der Leyen announced that the European Commission will propose including corruption in the human rights sanction regime in 2023.149 Informal negotiations are ongoing on this, but the high representative for foreign affairs and security policy is yet to provide a negotiation mandate to the Council of the EU.\nIn September, the European Commission issued a proposal to prohibit the entry of products made using forced labor into EU markets.150 This will not enter into force for two years, though. Meanwhile the commission’s Proposal for a Directive on Corporate Sustainability Due Diligence is still moving through the institutions. It would open the way for punitive measures to be imposed on private companies implicated in human rights abuses, although it would only fully apply to a small number of large companies and the scale of fines is not specified.151 The EU institutions made slow progress toward adopting an anti-coercion instrument, which would be used against nondemocratic regimes for trade purposes but not democracy-related ones. Last, the commission is advancing a proposal to criminalize violations of EU restrictive measures with the aim of preventing the circumvention of EU sanctions.152\nWhile it did not use the global sanctions regime, the EU did invoke country-specific sanctions regimes. It extended financial restrictions on entities in Belarus and added new individuals in the country to its sanctions list because of their support for Russia’s invasion of Ukraine.153 Citing intensifying human rights violations, the EU extended existing sanctions on Myanmar, adding more individuals and including entities from the energy sector.154 The United Kingdom also extended restrictive measures on individuals in the country for undermining democracy and the rule of law.155 The EU similarly added individuals to its sanctions regimes covering the Democratic Republic of the Congo, Nicaragua, North Korea, and Syria. In 2022, there was more coordination between the EU and Canada, the United Kingdom, and the United States on such measures than in previous years.\nIn February, the EU threatened to withhold funds and to sanction the Bosnian government in an effort to prevent the ethnically divided country’s breakup. The Council of the EU extended the framework for restrictive measures on Bosnian individuals until March 31, 2024, not imposing tougher sanctions but keeping the possibility open.156 In contrast, the United Kingdom imposed sanctions on the Bosnian Serb separatist leader Milorad Dodik and another Bosnian-Serb politician for their alleged attempts to break up the country. These measures, combined with the EU’s threat of sanctions, did bring the country’s parties together to sign a renewed commitment to the EU reform path.\nThe EU imposed sanctions on thirty-seven individuals and seven entities in Iran—including Minister of Interior Ahmad Vahidi, members of the morality police, and the country’s information officer—for their role in the violent suppression of antigovernment protests. As a result, 126 individuals and eleven entities are currently subject to EU restrictive measures concerning Iran. The protests took precedence over the EU’s efforts to get the nuclear deal with the country back on track. Still, the EU moved to offer funding to Iran under a new Multi-annual Indicative Programme for 2021–2027 with a focus on economic and trade issues.157 Germany responded more assertively to the protests, taking action beyond the EU-imposed sanctions, especially with regard to visa rules.158 The Netherlands sponsored a UN Human Rights Council Resolution establishing an independent mechanism aimed at collecting and preserving evidence of alleged human rights violations related to the protests.\nIn September 2021, the European Commission published a proposal for changes to Generalized System of Preferences (GSP) conditionality, which should come into force in 2023.159 The proposal tightens conditionality by requiring adherence to an expanded list of conventions and standards: instruments dealing with the rights of people with disabilities and children’s rights, two labor rights conventions, one governance convention on transnational organized crime, and the Paris Agreement on Climate Change.160 The proposal also aims to ease the removal of preferences to further reduce the number of countries eligible. Debates over such trade conditionality sharpened in July after the European Ombudsman issued a decision highly critical of EU trade policy for undermining human rights.161\nIn light of shrinking civil society space and the worsening human rights situation in Turkey, the EU has significantly cut its financial support to the country’s government since 2018 and redirected these funds to civil society organizations. In 2022, the amount going to civil society increased to around €26 million under the EU Civil Society Facility, with another €4 million allocated from the Global Democracy and Human Rights thematic program. While some financial support to the government remains, this now is only available to foster reforms related to energy, the environment, food security, and labor rights.\nDue to the negative democratic trends in the Middle East and North Africa, for the second year in a row no country there received money from an incentive-based umbrella fund through which the EU sets aside an additional 5 percent funding to the country that makes the most progress in democracy and human rights.\nThe EU opened new accession chapters with Serbia in exchange for the country’s agreement to hold a referendum on judicial reform but it withheld €600 million in aid pending broad political changes. In August, the EU pressured and mediated a settlement in a dispute between Serbia and Kosovo over identity documents that involved the use of potential negative conditionality as leverage.162\nThe EU did not take any action in some notable cases where democracy regressed or autocracy and rights abuses worsened. What is more, not only did it not impose sanctions or reduce aid and other forms of cooperation with governments moving in an authoritarian direction, it often increased funds to them. The cases below illustrate this trend in 2022.\nThe EU’s Comprehensive Agreement on Investment with China has remained frozen since 2021, but the EU did not sanction any more Chinese individuals or entities (by comparison, four individuals and one entity were listed in 2021).163 The EU did not boycott the Winter Olympics in China, and Beijing agreed to reengage with a human rights dialogue. While the EU increasingly criticized China, especially for its ongoing human rights abuses against the Uyghur minority, it did not take further action even as UN evidence of these abuses mounted. Nor did the EU adopt concrete measures in reaction to China quashing Hong Kong’s formal autonomy in 2022. The United Kingdom and a handful of EU member states were critical of renewed attacks on civic activists but did not impose punitive measures.\nEuropean support for Taiwan increased somewhat, framed as support for a democracy under China’s threat. Several EU member states and the United Kingdom criticized China’s belligerent reaction after the visit to Taiwan by the speaker of the U.S. House of Representatives, Nancy Pelosi, and they suggested they may also arrange similar visits. After the Chinese Communist Party included opposition to Taiwanese independence in its constitution, a delegation from the German Bundestag’s Human Rights Committee traveled to Taiwan.164 Germany’s Chancellor Olaf Scholz nevertheless visited Beijing shortly after in November to discuss commercial and strategic cooperation.\nLithuania was the most vocal European country on the Taiwan issue, opening a trade office in Taipei in November and endorsing Pelosi’s visit. In response, China imposed sanctions on Lithuania’s deputy minister of transport and communications after she visited Taiwan. Estonia and Latvia left the 16+1 initiative, a Beijing-backed forum aimed at boosting relations with Eastern European countries.165 Germany, Lithuania, and the United Kingdom supported Taiwan’s bid to participate in the World Health Organization.\nThe EU did not adopt sanctions against Azerbaijan after it launched new attacks on Armenia’s territory; in fact, it prioritized rapprochement with the country. The EU led a new process of mediation between Armenia and Azerbaijan, and its focus on remaining equidistant between them eclipsed concerns about democracy. The EU did not openly support partially democratic Armenia and did not take up the framing put forward by the country’s prime minister, Nikol Pashinyan, to describe the conflict as one between democracy and autocracy, as in Ukraine. The EU was not able to get significant funds to Azerbaijani civil society as the government tightened its restrictions. Despite these developments, the EU still sought to sign a new strategic partnership agreement with Azerbaijan that it started negotiating in 2015 and offered a new draft text.\nIn October, the EU decided on a two-month civilian border mission that ostensibly offered Armenia some degree of protection, alleviating the intensity of Azerbaijani attacks. Yet it was the United States’ more muscular diplomacy that eventually reined back Azerbaijan. Holding the upper hand, Azerbaijan ensured that the EU mission was relatively limited and weak. Armenia felt that the EU mediation was heading in a direction favorable to Azerbaijan, and its civil society lamented that the EU had become a peace promoter at the cost of democracy promotion. Armenia’s democracy organizations were strongly critical of EU pressure on the country to sign a peace deal that favored Azerbaijan’s authoritarian regime.\nThe EU refrained from adopting punitive measures against Israel. In May, the journalist Shireen Abu Akleh was killed while covering a military raid on the Jenin refugee camp, with the bullet found to have been fired from the approximate position of an Israeli military vehicle.166 During the funeral procession, Israeli riot police assaulted a group of mourners. High Representative Josep Borrell issued a statement condemning the disproportionate use of force by the authorities.167 The EU institutions and member states issued statements condemning the shrinking of civic space and violations of human rights in Israel as well as new illegal settlement plans. Despite all this rhetoric, the EU took no concrete action in response to any of these events, but rather sought to reestablish itself as an actor in peace talks and to continue cooperation with Israel. An EU-Israel Association Council was held for the first time since 2013.168 The EU prioritized strategic considerations, such as energy coordination, over democracy-related issues.169 The United Kingdom also initiated talks for a new trade deal with Israel.170\nEven though the Occupied Palestinian Territories suffered further democratic backsliding in 2022, the EU increased financial support there. It provided €2.6 million to farmers in the Gaza Strip in support of a program of the Palestinian Authority.171 For several months, the EU withheld €200 million of aid on the grounds that some school textbooks contained anti-Semitic messages but there was no similar conditionality related to growing authoritarianism. After pressure in the form of a joint letter from fifteen member states, the European Commission moved to release the funding.172 In June, it resumed funding to two Palestinian human rights organizations that had been suspended for over a year pending an investigation into their alleged ties to terrorism.\nIn sharp contrast to the rhetoric on Ukrainian self-determination, France, Germany, and Spain withdrew their support for democratic self-determination for the Western Saharan population in favor of the ever-more authoritarian regime in Morocco, a change welcomed by the EU institutions.173 This sits uneasily alongside previous European Court of Justice rulings against the EU for failing to uphold the Sahrawi people’s right to self-determination. France, Germany, and Spain now base their policies on Morocco’s autonomy plan for the region, which deprives Western Sahara of democratic self-government, with the king granted the authority to select the region’s leader. Spain also continued to further its cooperation with Morocco by signing a new accord for joint maritime patrols to control migration.\nIn Egypt, the trend of autocratization under President Abdel Fattah el-Sisi continued, including the arbitrary detention of activists and the curtailment of freedom of speech. Nonetheless, the EU released a first €240 million tranche from Egypt’s aid program as well as €100 million in immediate relief for food security.174 In Jordan, there was further centralization of power in the hands of the monarch, yet the EU allocated the country €364 million under its new aid program. In the case of Lebanon, the EU extended but did not use the 2021 framework it set up to allow the imposition of sanctions. This was despite the EU Election Observation Mission finding widespread vote buying and clientelism in the parliamentary elections and recommending electoral reform.175\nThe EU continued to provide significant funds to Tunisia’s government despite President Kais Saied dissolving the parliament, seizing control of the election commission, sacking over fifty judges, and pushing through a referendum on a new highly authoritarian constitution.176 The day before the dissolution, Neighbourhood and Enlargement Commissioner Olivér Várhelyi visited the country and confirmed a support package of €200 million for the southern neighborhood, including for Tunisia.177 In October, the country received a second installment of €300 million under a COVID-19 aid package, and Borrell stressed the EU’s commitment to providing financial support through the rapid disbursement of €40 million and new macro-financial assistance.178 The EU started implementing a €7 million package, mainly on LGBTQ rights, under the 2021–2024 Action Plan on Democracy and Human Rights. It did not deploy an Observation Mission for the December parliamentary elections.\nThe EU maintained funding for Ethiopia’s government under its aid program that began in 2019. The 2021 elections were held in the majority of the country’s territory, but citizens in the Tigray region were deprived of the right to vote. Despite the regime’s controversial actions in the Tigray conflict and the ongoing democratic backsliding, most EU-funded projects still envision engagement with government bodies and public authorities, including on democratic governance issues. Some projects focused more on civil society and aimed at fostering inclusive dialogue to deal with the conflict. The European Commission approved €82 million in support for health and education in conflict-affected areas to be delivered directly to nongovernmental organizations. Borrell expressed disappointment over the EU’s failure to adopt targeted sanctions against Ethiopia and said that the EU’s response to the civil war was “one of [his] biggest frustrations.”179 A peace deal signed in late December opened the way for more EU support.180\nThe EU as well as France, Germany, Norway, and the United Kingdom called for immediate progress toward a civilian transitional government in Sudan that actively engages civil society. They insisted that they would not support a government appointed unilaterally by the country’s military leadership. The European Parliament’s Committee on Foreign Affairs visited Khartoum and reiterated the EU’s commitment to a democratic transition in the country. The EU also issued a statement welcoming the lifting of the state of emergency and the release of detainees.181 Nonetheless, stability in the country was hindered by the government’s repeated use of excessive force against peaceful protesters. Borrell issued a statement strongly condemning the authorities’ violence against peaceful demonstrators, but the EU did not impose sanctions or cut cooperation.\nA major crisis occurred in Sri Lanka after protesters drove the sitting president out of power. The parliament chose as his replacement an equally unpopular figure who introduced a curfew and declared a state of emergency. Borrell issued a declaration stressing the importance of the right to freedom of peaceful assembly and calling on the government to work in full compliance with its GSP commitments.182 Nonetheless, the EU did not make compliance with human rights and fundamental freedoms an explicit prerequisite for financial assistance and preferential trading status. It neither cut funds nor imposed sanctions.\nThe EU finalized a Partnership and Cooperation Agreement with Thailand, where a military junta remains in control.183 It did not remove GSP-plus trade preferences from the Philippines, despite the European Parliament strongly pushing for this.\nIn Uzbekistan, the regime used force against peaceful demonstrators, killing or detaining hundreds. Nonetheless, the EU put in place GSP-plus trade preferences, completed negotiations for a new Enhanced Partnership and Cooperation Agreement, and released food security aid. Borrell traveled to Uzbekistan in November to launch cooperation on connectivity, while Macron invited President Shavkat Mirziyoyev to Paris in a diplomatic effort to pry the country away from Russia.\nThe EU sent an Election Observation Mission to Venezuela at the end of 2021. While the mission was seen as a success and the opposition took part in the elections for the first time since 2017, in 2022 the window of cooperation between the EU and the regime closed again. The EU continued to push Venezuela to adopt recommendations from the mission. In June, opposition leader Juan Guaidó said he had been attacked by members of the ruling party. The EU issued a statement asking for a prompt investigation to bring the perpetrators to justice.184 However, no concrete EU action followed. Toward the end of the year, the focus was back on talks between the government and opposition, with Macron inviting the two sides to Paris and Norway resuming its mediation role.\nThe cases detailed above are only a few examples of note during 2022. There were other situations in which the EU did not impose measures as governments cracked down on democratic protests, as in Cuba, Iraq, and Kazakhstan. In other cases, the EU removed sanctions on Burundian officials and Zimbabwean individuals, debated a possible dilution of sanctions against the Syrian regime, and inserted a humanitarian exemption into its sanction regime in Afghanistan.\nMost beneficiaries of European Bank for Reconstruction and Development loans were nondemocratic regimes. Large recipients included Egypt, Turkey, and Uzbekistan. In particular, the rise of Turkey as the top beneficiary occurred in parallel with the country’s deepening authoritarianism. This is despite the bank’s mandate to only carry out programs in recipient countries committed to and applying democratic principles.\nThe decisions by several European countries to sign deals to offshore asylum seekers in nondemocratic countries remained highly controversial. In April, Denmark held talks with Rwanda on the transfer of asylum seekers, even though it had previously expressed concerns over human rights violations in the country. Similarly, the United Kingdom signed a deal with Rwanda to send asylum seekers there. These arrangements contradict European human rights exhortations.\nEuropean governments increased arms sales to authoritarian regimes in 2022 and did not attach notably stronger restrictions on such transfers. Civil society watchdogs pointed out that increases in arms sales by France and Germany to Egypt implicate the two EU members legally in rights abuses in the country. The top ten destinations for arms exports by EU countries included Algeria, Egypt, Qatar, Saudi Arabia, and the United Arab Emirates.185\nWith regard to EU member states, 2022 saw some moves toward democracy-related conditionality being applied against Hungary and Poland. The European Commission adopted a tougher approach as it sought ways to hold back funding to these two countries in response to their governments’ continued flouting of rule of law norms. Still, these steps failed to result in tangible improvements on the ground in either, and the disconnect between legal and political considerations opened the measures to widespread criticism.\nThe most notable changes came in the case of Hungary. In September, the European Commission triggered the new rule of law conditionality mechanism186 for the first time and recommended the suspension of €7.5 billion of aid, about one-third of cohesion funds for the country.187 This suspension would exclude government-controlled public interest trusts from EU funding schemes. As part of the conditionality mechanism, Hungary’s government committed to implementing seventeen corrective measures, including the establishment of an independent Integrity Authority to investigate corruption in public procurement. In December, member states backed the suspension, voting to hold back €6.35 billion, slightly less than the commission proposed.\nSeparate from the rule of law conditionality mechanism, the EU institutions also held back money from the Recovery and Resilience Facility (RRF) to Hungary and Poland. The European Commission approved Hungary’s RRF plan but linked disbursal to the reaching of twenty-seven milestones. In November, the government introduced very modest judicial reforms with the aim of unblocking €5.8 billion in grants from the RRF.188 In December, the member states approved Hungary’s recovery plan, which opened the way for RRF funds to be released in 2023.\nThe EU gave Poland’s RRF plan a green light following significant debate and disagreement between commissioners. The European Commission set milestones for the government to reform the judiciary, including scrapping the Disciplinary Chamber that, according to the European Court of Human Rights, “could not be considered a court” and replacing it with a new, independent institution. While the milestones were relatively modest, the government fell short of fulfilling even these. A newly created judicial body, the Chamber of Professional Responsibility, remained under the government’s political control and further reform seemed unlikely with elections due in 2023.\nAs set out in a 2020 strategy, the European Commission started assessing member states’ compliance with the Charter of Fundamental Rights when disbursing funds.189 This was the first time the commission used this long available conditionality tool. As a result, the commission froze cohesion funds to Poland and Hungary, in November and December, respectively.190 The freeze amounted to virtually all of each country’s cohesion funds for 2022–2027, a much larger amount than RRF funding. While it was unclear at year’s end how long the freeze would last, the commission’s resort to this tool was a significant change in strategy.\nIn a first, in September, the European Parliament adopted a report declaring Hungary as a “hybrid regime of electoral autocracy.”191 In June, three MEPs prepared a motion of no confidence against the European Commission, arguing it had failed to fulfill its role as guardian of the treaties by green-lighting Poland’s recovery plan, but the motion was not put to a vote as it did not reach the 10 percent threshold of signatories. The parliamentarians also said they “deplore[d] the inability of the Council to make meaningful progress to counter democratic backsliding,” given the gridlock over the Article 7 process against Hungary and Poland.192 The parliament’s criticism was complemented by a civic initiative that took the Council of the EU to court over approving Poland’s recovery plan.\nOn the legal front, the European Commission referred Hungary to the European Court of Justice in two separate cases: over the anti-LGBTQ legislation adopted in 2021193 and the stripping of the Klubradio radio station of its frequency in the same year.194 The European Court of Human Rights also ruled in three cases that a “systemic dysfunction” persisted regarding Poland’s judicial appointments.195 Close to one hundred applications relating to Poland were pending on the court’s docket in 2022, which portends an exponential rise in decisions against the government.\nSome member states formulated tougher positions against Hungary, in particular. Germany adopted a more assertive stance. When Orbán visited Berlin, he was neither received with military honors nor granted a press conference with Scholz, signifying a downgrade compared to other official visits. Germany’s three governing parties vowed to adopt a tougher line on Hungary than the previous government did, urging Scholz to scrutinize rule of law reforms in the country more critically.\nIn sum, at the end of the year, the situation was fluid. RRF funds and nearly all cohesion funds had in practice been withheld from Hungary and Poland. Still, it was unclear how long these suspensions would last, how much funding they would cover, or how much of a punitive approach member states would support in 2023.\nOur 2021 Annual Review noted an incremental dilution of the democracy-building aspects of EU security missions. This trend continued in 2022. The EU did not undertake any military or security mission whose primary aims were framed overtly in terms of protecting or supporting democracy. The invasion of Ukraine pushed EU institutions and European governments into emphasizing their determination to become harder-edged security actors, and much of the foreign policy debate during the year was about Europe’s military capabilities and geopolitical strength. Despite or perhaps because of this, 2022 was not a year of high-profile EU security interventions.\nThe EU made a number of formal commitments that hinted at improved security actions. The new Strategic Compass promised the creation of an EU rapid deployment capacity of up to 5,000 soldiers.196 Ongoing internal talks considered the adoption of operational guidelines for the Common Security and Defence Policy (CSDP) that would deepen cooperation with civil society and bottom-up approaches to conflict interventions.\nThe EU repeated during the year standard commitments to working on the rule of law and human rights within CSDP missions. The European Union Capacity Building Mission in Niger focused more on access to justice, for example. Most civilian CSDP missions conduct some activities on the rule of law and embrace a human-rights-based approach to training. However, the EU continued to narrow the focus of CSDP missions and democracy support generally does not feature in their mandates. Under the new NDICI Global Europe budget, the EU launched a €900 million aid program on peace, stability, and conflict prevention,197 which promised to prioritize mediation support, counterterrorism, and climate-related elements of conflict resolution, but did not include democracy as a priority.\nThe year saw a retraction of prominent CSDP missions. Despite the increases in defense spending across Europe in 2022, the EU did not deploy any of its battle groups.\nAlthough the Sahel suffered its highest number of annual conflict-related deaths yet, the EU closed down or suspended its operations in Mali and the Central African Republic. Instead of engaging directly, the EU created a €600 million assistance measure under the European Peace Facility to support African-led peace-support operations.198 The year was dominated by talks of France’s retreat from the region and the growing role there of Russian political support and mercenaries.\nThe EU’s objectives on democracy and human rights in the Sahel remained but it became more difficult to work with armed forces in the region on human rights issues. There was a growing recognition that, against the backdrop of many coups in the region, the EU would need to reevaluate its involvement with security support. For example, the work of security missions was generally limited to trying to influence how security forces policed the increasing number of antigovernment protests with less violent means.\nIn Mali, the EU imposed sanctions on just five individuals involved in the coup that interrupted the promised democratic transition. As violence intensified, the military tightened its hold on power and anti-France sentiment became widespread. European powers withdrew troops, leaving the lead to a force from the Economic Community of West African States (ECOWAS). The junta expelled Danish troops and the French ambassador. France withdrew its troops, winding down its counterinsurgency Operation Barkhane, and it canceled around €60 million of its €100 million annual aid allocation for Mali. The EU mission stopped army training, although it continued to provide some support to the government and defense ministry.199 The Czech Republic, whose army held command of the suspended EU training mission, moved to end its participation by the end of the year. Germany was the only European country in the top-ten troop contributors to the UN MINUSMA mission as of June 2022, but it also halted troop deployments to Mali, maintaining only 140 soldiers in the northern town of Gao and announcing it would remove all troops by 2024. The United Kingdom announced the withdrawal of around 300 troops from the UN force.200\nThe EU worked through its security mission to maintain some support for civil society as the political context worsened, using funds previously set aside for elections that were called off. For the small amount of rights-based funding the EU had available for development cooperation in Mali, the priorities were women’s rights, gender-based violence, women’s empowerment, and women’s participation in elections.201 Some projects on social rights and inclusion and on independent media were supported too. In general, the EU sanctions did not prevent low-level operational security cooperation from continuing with a regime that was increasingly authoritarian.\nIn the Central African Republic, the EU suspended training under its civilian mission as the regime turned to Russia’s Wagner Group for security cooperation. The EU extended its civilian and military missions in the country but training activities ceased and there was a narrower focus on providing strategic advice for counterterrorism.\nIn Niger, the EU extended its civilian mission until September 2024 with a budget allocation of €72 million and an accompanying package of direct budget support to the nondemocratic regime for security and migration control.202 At the end of the year, the EU agreed a new military training mission to be deployed in 2023.\nIn Burkina Faso, a coup ousted the democratically elected government in January 2022. France’s support for the new military junta was the subject of much criticism from the country’s civil society, which called for ending military cooperation.203 A second coup in September removed this junta and its supporters attacked French targets. In October, coup leader Captain Ibrahim Traoré was sworn in as interim president. The European Parliament adopted a resolution condemning both coups and calling for a return to constitutional order.204 However, the EU did not take concrete measures and supported ECOWAS to lead a dialogue with the junta.205\nThere have been talks regarding the possibility of launching three new military missions in West Africa: in Burkina Faso, Niger, and a Gulf of Guinea state still to be determined.206 There are no signs that these missions would give any greater prominence to democracy building than those that have been recently closed or suspended.\nIn South Sudan, the EU allocated €85.3 million in financial aid in response to food insecurity, violence, and floods. New aid to support the Real Comprehensive Peace Agreement looks unlikely, although a new initiative devoting more funds to local civic actors got underway.207 In a statement condemning human rights abuses in the country, the EU said peace and security were necessary conditions for aid and cooperation.208\nIn Mozambique, the EU increased its financial support to the local armed forces. Italy, Lithuania, and Sweden joined the military training mission in the country.209 The mission remained focused on basic security and did not include any democracy elements. While much European Peace Facility assistance is implemented at the level of civil society, in Mozambique in 2022 it was coordinated by IdD Portugal Defence, a company owned by Portugal’s Ministry of National Defence and Ministry of Finance.\nIn Libya, the elections scheduled for the end of 2021 were canceled and are yet to take place. The 2021 peace accords collapsed, leaving the country again with two rival governments. There was still no common European line on issues related to political leadership, reforms, and power sharing, preventing effective democracy support to the country. France recognized the UN-backed Tripoli government but tacitly supported the eastern-based government, while Germany, Italy, and the United Kingdom remained more supportive of the Tripoli government. In general, European countries did not push for quick elections. The situation was further complicated by the presence of mercenaries from Russia’s Wagner Group in the east of the country,210 which the EU was not willing to confront. The EU planned new economic aid but did not carry out any direct conflict intervention.\nIn Iraq, the EU extended its advisory CSDP mission on security sector reform until 2024.211 The mission advises officials of the Office of the National Security Adviser, the Ministry of Interior, and other authorities in charge of civilian-related aspects of security-sector reform. The EU allocated an additional €3.8 million to the United Nations Investigative Team to Promote Accountability for Crimes Committed by Da’esh/ISIL. This initiative supports the digitization and archiving of evidence related to human rights violations committed by the self-proclaimed Islamic State in Iraq. In November, the Italian and EU ambassadors to Iraq participated in the MERI Forum in Baghdad and highlighted their support for putting democracy support measures in the country at the top of the agenda alongside security and stabilization.\nIn Afghanistan, some European states tried to rebuild a focus on women’s rights and mediation. Norway hosted talks in Oslo with representatives of the Taliban and Afghan civil society, and engaged on the issues of female education and women’s participation in the newly established Taliban government. Germany adopted an Action Plan for Afghanistan to support relief measures for the civilian population.212 The EU supported the Afghan Women Leaders Forum, a meeting of more than sixty such figures to discuss the role of women in the country.213\nThe challenge of having any kind of positive influence in Afghanistan was a sobering reminder of past failures in conflict intervention. The worsening conflict dynamics in many countries fed the caution in EU security interventions in 2022, to the detriment of a focus on democracy support.\nThe year was dominated by Russia’s invasion of Ukraine, which had a far-reaching impact. It acted as a catalyst for significant developments in European defense, diplomatic, energy, climate, trade, and economic policies. Its impact on democracy support too was strong, but it was not a game changer.\nA paradox marked this year’s democracy policy developments. On the one hand, the war in Ukraine drove a dramatic strengthening of EU leaders’ rhetorical commitments to defending democracy. The democracy narrative was more ubiquitous and high-profile than in previous years. On the other hand, it pushed the EU’s immediate policy priorities away from democracy issues and toward more directly security-related concerns. Narratives surrounding much foreign and security policy centered on an intensified battle for democracy but most policy had little to do with democracy support. As governments spent hundreds of billions of euros in energy subsidies, their commitments to democracy was equivalent to a tiny percentage of this, counted more in tens of millions, despite so much talk about the urgent need to defend democracy against Russian aggression and growing global autocracy.\nThis was a year in which EU leaders seemed drawn to speaking a new language of power. This was especially true of High Representative for Foreign Affairs and Security Policy Josep Borrell, apparently the main architect of a desired new foreign policy identity. But EU leaders did not spell out whether this meant more or less democracy support, and flitted confusingly between two positions on this question. They insisted one moment that the EU had to accept a world that would not conform to liberal or democratic norms, but in the next moment insisted that the EU was more active than ever on democratic rights.214 The war in Ukraine appeared to generate more of an EU strategic split personality in this regard.\nThe war also shifted the balance of influence within the EU. It gave Central and Eastern European states more voice, while Germany’s prevarications toward Ukraine undermined some of its leadership credibility. In the context of this review, the notable aspect of this shift was the duality it produced with regard democracy policy. Many Central and Eastern European states positioned themselves more firmly as champions of democracy support within EU foreign policy. They were the most adamant in framing the war as being about the defense of democratic values. Yet, some of them, such as Poland, were also the target of upgraded EU measures against democratic backsliding.\nThe change in the EU’s position on enlargement was the most concrete change during the year, with potential spillover to democracy support. If the EU’s rhetoric ran ahead of its actions in many areas of policy, here the change was remarkable. In only a few months, the war led the EU to reverse a decade-long refusal to contemplate accession for Eastern Partnership states and to advance the candidacies of the Western Balkans ones. This also meant a different and tighter focus on democracy in these states, deepening the need for the EU to foster democratic reforms there and giving it a wider range of instruments to do so. Still, familiar doubts remained among some member states about the speed and reach of enlargement as well as the role of democracy support within accession preparations. The risk is that the new, incipient momentum behind enlargement will not last beyond 2022 and will fail to fulfill its promise when it comes to upgrading democracy support.\nNot all democracy-related policy developments were driven by the war in Ukraine. The EU’s various new international funding instruments began to operate in 2022 as they moved forward with multiannual programs that had been in the pipeline. While it is too early for an in-depth evaluation of this funding, it seems that the EU adopted interesting and creative new approaches to democracy aid in many countries. The EU continued on its long-term aid trajectory toward more decentralized projects and support for newer types of democratic activism. The Team Europe Democracy initiative began to encourage collective planning by member states. Such developments are relatively low profile yet they represent areas of concrete operational improvement.\nWhile presenting itself as an increasingly hard-edged foreign policy actor in the wake of the invasion of Ukraine, the EU did not move toward more assertive or punitive approaches in democracy support. It still preferred relatively tepid, dialogue-based cooperation, even with authoritarian and autocratizing governments. After its first operational year in 2021, the EU’s global human rights sanctions regime was not used in 2022. There were tactical and geopolitical reasons behind this caution; at least in part, it had to do with the EU’s desire to build new alliances with nondemocratic regimes to buttress its strategic options in the fraught, post-invasion political context.\nThe EU adopted an unprecedented range of sanctions and increased willingness to use restrictive measures but generally it did not employ these to support democracy or in response to democratic deterioration. There was a deepening debate over the EU’s preference for measures targeting individuals rather than systemic political features. Some policymakers argued that there was still too much political reasoning leading to particular individuals from only certain countries being sanctioned. By contrast, others argued that the increasing focus on sanctioning a relatively small number of individuals was giving this part of the EU toolbox a depoliticized flavor. By the end of the year, it was harder than before to pin down the role of sanctions and conditionality in European democracy support.\nThere was a wider range of democracy-related policy developments within the EU than in its external action. The emerging focus on the defense of European democracy was stronger than that on promoting democracy externally. The EU was especially busy in introducing new legislation relating to different aspects of democracy within member states. While the European Commission and many member states remained hesitant and uncertain over how to deal with anti-democratic developments in Hungary and Poland, these countries’ governments began to pay a price for their challenge to democratic norms. Even if the EU did not impose major direct democratic sanctions, the holding back of funds to both countries represented a degree of political conditionality.\nThe EU gave a higher priority to coordination with other democracies in 2022 but it is not yet clear whether this will result in significant gains for democracy support. The EU and the United Kingdom reached out to non-Western democracies and doubled down on key areas of cooperation with the United States. Such emerging coordination was usually more about security as opposed to democracy but it did move the global aspects of democracy support modestly forward.\nNon-EU members Norway, Switzerland, and the United Kingdom continued to be relatively large funders of democracy projects. The United Kingdom was especially engaged in framing the war in Ukraine as a democracy issue, but its internal politics raised unsettling questions about the wider direction of its foreign policy and about its own democracy.\nThere is a general feeling that all other policy developments faded in significance relative to the war in Ukraine, and that Europe’s commitment to democracy will ultimately hinge more on how the conflict evolves than on the fine print of democracy funding initiatives and the like. But this argument should not be taken too far: in many parts of the world, democracy’s fate was clearly not directly dependent on the war in Ukraine and more on domestic factors. Ultimately, it will be well after 2022 that a final judgment is possible as to whether European governments did enough to buttress democratic norms as these were directly attacked by an expansionist autocracy.\nThese trends frame the challenges that will be of particular importance during 2023. First, harder trade-offs between democracy and other priorities will reveal the relative prioritization of democracy within and outside Europe. Internally, this will be most apparent with regard to Hungary: either EU member states will engage in horse-trading with the country’s government to the detriment of democracy or they will stand firm with a red line that leads to full confrontation. Externally, the priority attached to energy security is likely to deepen in 2023, which could further undercut any emphasis on democracy. The inevitable trade-offs in this regard required by member states will test the EU’s level of commitment to democratic governance and human rights.\nSecond, the Summit for Democracy set for March 2023 will be a crucial test for international democratic coordination. The first summit in 2021 provided a platform for the international conversation on democracy but its impact was underwhelming. The second summit in 2023 will be a chance to follow up on commitments and to deepen democratic coordination. If this second meeting is the end of the road for the summit process, it will deal a significant blow to international efforts to upgrade cooperation in democracy support. A commitment to a permanent process and further summits would give a strong indication that there is appetite to continue pushing for improvements to global democratic governance.\nThird, 2023 is likely to see even more of a push from European capitals for coordination on foreign policy due to the war in Ukraine. This will be evident in military terms within NATO and in other areas such as sanctions. In democracy support, the key test will be in relation to the Team Europe Democracy initiative. The year will be crucial for determining whether this initiative leads to greater operational coordination in support of democracy or whether member states step back from investing it with tangible capacity.\nFourth, the transformative power of EU membership will be tested in 2023. Signs of a reboot for the political power of enlargement were clear in 2022. At the same time, the new European Political Community forum may provide an avenue for differentiated degrees of cooperation across Europe. The ability of the EU to support democracy through enlargement will come to the fore in relations with the Western Balkans countries as well as with Georgia, Moldova, and Ukraine. Many scenarios are possible, but the political dynamics in these states will shape the relevance of EU accession to democracy support.\nFinally, the dire economic outlook for 2023 suggests that many governments around the world will face much citizen dissatisfaction. A rise in protest intensity is likely. Sometimes protests will dissipate but some will lead to pro-democracy changes in government. Democracy supporters will be hoping for the appropriate speed and conviction in European responses to such democratic openings: whether the EU is prepared to react to these will be another crucial test in 2023.\nRichard Youngs is a senior fellow at Carnegie Europe and professor at the University of Warwick.\nElena Ventura is a program assistant at Carnegie Europe.\nKen Godfrey is executive director of the European Partnership for Democracy.\nErin Jones is a research analyst at Carnegie Europe.\nZselyke Csaky is a policy leader fellow at the School of Transnational Governance at the European University Institute.\nKinga Brudzińska is a research associate at the Institute for the Danube Region and Central Europe.\nEvelyn Mantoiu is a research and data officer at the European Partnership for Democracy.\nRicardo Farinha is a program manager at Carnegie Europe.\nCarolin Johnson is a policy and research coordinator at the European Partnership for Democracy.\nEllen Leafstedt is a research and evidence officer at the European Partnership for Democracy.\nThe authors thank Julia Leininger for comments on and input to the text.\nThis article is part of the European Democracy Hub initiative run by Carnegie Europe and the European Partnership for Democracy.\nThis document was produced with the financial assistance of the European Union. The views expressed herein are the sole responsibility of the authors and can in no way be taken to reflect the official opinion of the European Union.\n1 Richard Youngs, Ken Godfrey, et al, “European Democracy Support Annual Review 2021,” Carnegie Europe, January 24, 2022, https://carnegieeurope.eu/2022/01/24/european-democracy-support-annual-review-2021-pub-86233.\n2 Vanessa A. Boese, et al., “Autocratization Changing Nature? Democracy Report 2022,” Varieties of Democracy Institute (V-Dem), March 2022, https://v-dem.net/media/publications/dr_2022.pdf; “Democracy Index 2021: The China Challenge,” Economist Intelligence Unit, 2022, https://www.eiu.com/n/campaigns/democracy-index-2021/?utm_source=economist&utm_medium=daily_chart&utm_campaign=democracy-index-2021.\n3 Alexandra Stevenson, “China Is Sticking to Its ‘Zero Covid’ Policy,” New York Times, October 16, 2022, https://www.nytimes.com/2022/10/16/world/asia/china-is-sticking-to-its-zero-covid-policy.html.\n4 World Bank, “Chapter 1. The Economic Impacts of the COVID-19 Crisis,” in World Development Report 2022, (Washington, DC: World Bank, 2022), 3-6, https://www.worldbank.org/en/publication/wdr2022/brief/chapter-1-introduction-the-economic-impacts-of-the-covid-19-crisis.\n5 Lars Jensen, “Avoiding ‘Too Little Too Late’ on International Debt Relief,” United Nations Development Programme, October 11, 2022, https://www.undp.org/publications/dfs-avoiding-too-little-too-late-international-debt-relief.\n6 “Kazakhstan’s Bloody Turbulence Will Affect All of Central Asia,” Economist, January 13, 2022, https://www.economist.com/briefing/2022/01/13/kazakhstans-bloody-turbulence-will-affect-all-of-central-asia.\n7 “Non-paper by Bulgaria, Croatia, the Czech Republic, Denmark, Estonia, Finland, Latvia, Lithuania, Malta, Poland, Romania, Slovenia, and Sweden on the Outcome of and Follow-Up to the Conference on the Future of Europe,” May 9, 2022, https://www.europa-nu.nl/9353000/1/j4nvih7l3kb91rw_j9vvj9idsj04xr6/vlstn1p5intb/f=/non_paper.pdf.\n8 Commission President Ursula von der Leyen, State of the Union speech, September 2022, https://ec.europa.eu/commission/presscorner/detail/ov/speech_22_5493.\n9 Richard Youngs, “Autocracy Versus Democracy After the Ukraine Invasion: Mapping a Middle Way,” Carnegie Europe, July 20, 2022, https://carnegieeurope.eu/2022/07/20/autocracy-versus-democracy-after-ukraine-invasion-mapping-middle-way-pub-87525.\n10 Von der Leyen, State of the Union speech, September 2022.\n11 European External Action Service, “EU Ambassadors Annual Conference 2022: Opening speech by High Representative Josep Borrell,” speech, October 10, 2022, https://www.eeas.europa.eu/eeas/eu-ambassadors-annual-conference-2022-opening-speech-high-representative-josep-borrell_en.\n12 North Atlantic Treaty Organization, “Strategic Compass,” June 29, 2022, https://www.nato.int/strategic-concept/.\n13 Council of the European Union, “A Strategic Compass for Security and Defence,” March 21, 2022, https://data.consilium.europa.eu/doc/document/ST-7371-2022-INIT/en/pdf.\n14 European Commission and High Representative of the European Union for Foreign Affairs and Security Policy, “EU Action Plan on Human Rights and Democracy 2020- 2024,” March 25, 2020, https://www.eeas.europa.eu/sites/default/files/eu_action_plan_on_human_rights_and_democracy_2020-2024.pdf.\n15 European Commission, “Thematic Programme on Human Rights and Democracy Multi-Annual Indicative Programming 2021-2027,” January 2022, https://international-partnerships.ec.europa.eu/system/files/2022-01/mip-2021-c2021-9620-human-rights-democracy-annex_en.pdf.\n16 European Commission, “Annex 7: Action Document for the Team Europe Democracy Initiative,” Multiannual Action Plan 2022-2024 for the Thematic Programme on Human Rights and Democracy, July 25, 2022, https://international-partnerships.ec.europa.eu/policies/peace-and-governance/democracy_en.\n17 James Randerson and Dato Parulava, “Qatargate: How the Key Players Are Connected,” Politico Europe, December 15, 2022, https://www.politico.eu/article/qatargate-how-the-key-players-are-connected/.\n18 European Parliament, “Parliamentary and Presidential elections in Serbia,” Statement by Thijs Reuten, April 3, 2022, https://www.europarl.europa.eu/cmsdata/249223/2022-04-04_SERBIA_Final-Statement-EP.pdf.\n19 European Council, “Remarks by President Charles Michel following the meeting with Chinese President Xi Jinping,” statement, December 1, 2022, https://www.consilium.europa.eu/en/press/press-releases/2022/12/01/remarks-by-president-charles-michel-following-his-visit-to-china/.\n20 European External Action Service, “Bangladesh: First Political Dialogue with EU takes place,” press release, November 24, 2022, https://www.eeas.europa.eu/eeas/bangladesh-first-political-dialogue-eu-takes-place_en.\n21 Council of the European Union, “Human rights: EU adopts conclusions on EU priorities in United Nations human rights fora in 2022,” press release, January 24, 2022, https://www.consilium.europa.eu/en/press/press-releases/2022/01/24/human-rights-eu-adopts-conclusions-on-eu-priorities-in-united-nations-human-rights-fora-in-2022/#:~:text=The%20conclusions%20reaffirm%20the%20EU's,cornerstone%20of%20its%20external%20action.\n22 European External Action Service, “EU Strategy for Cooperation in the Indo-Pacific,” February 21, 2022, https://www.eeas.europa.eu/eeas/eu-strategy-cooperation-indo-pacific_en.\n23 European External Action Service, “Ministerial Forum for Cooperation in the Indo-Pacific,” press release, February 22, 2022, https://www.eeas.europa.eu/eeas/ministerial-forum-cooperation-indo-pacific_en.\n24 European External Action Service, “EU-ASEAN Blue Book 2022,” press release, May 24, 2022, https://www.eeas.europa.eu/delegations/association-southeast-asian-nations-asean/eu-asean-blue-book-2022_en?s=47.\n25 European External Action Service, “The EU and ASEAN hold their 4th Policy Dialogue on Human Rights,” press release, October 26, 2022, https://www.eeas.europa.eu/eeas/eu-and-asean-hold-their-4th-policy-dialogue-human-rights_en.\n26 European Commission, “Renewed partnership with the Southern Neighbourhood - A new Agenda for the Mediterranean,” general publication, July 7, 2022, https://neighbourhood-enlargement.ec.europa.eu/renewed-partnership-southern-neighbourhood-new-agenda-mediterranean_en.\n27 Council of the European Union, “Council approves conclusions on a strategic partnership with the Gulf,” press release, June 20, 2022, https://www.consilium.europa.eu/en/press/press-releases/2022/06/20/council-approves-conclusions-on-a-strategic-partnership-with-the-gulf/.\n28 European Council, “Remarks by President Charles Michel during his visit to Doha, Qatar,” press release, September 7, 2022, https://www.consilium.europa.eu/en/press/press-releases/2022/09/07/remarks-by-president-charles-michel-during-his-visit-to-doha-qatar/.\n29 European Council & Council of the European Union, “European Union - African Union summit, 17-18 February 2022,” international summit, February 17-18, 2022, https://www.consilium.europa.eu/en/meetings/international-summit/2022/02/17-18/.\n30 European Commission, “Commissioner Urpilainen's opening remarks at the first session of the Africa-Europe Week’s Youth Day,” press release, February 14, 2022, https://ec.europa.eu/commission/commissioners/2019-2024/urpilainen/announcements/commissioner-urpilainens-opening-remarks-first-session-africa-europe-weeks-youth-day_en.\n31 European Commission, “9 months after Summit: European Union and African Union Commissions take stock of the implementation of the February Summit commitments,” press release, November 28, 2022, https://ec.europa.eu/commission/presscorner/detail/en/IP_22_7247.\n32 David McNair, “Why the EU-AU Summit Could be a Turning Point—Even if the Headlines Disappoint,” Carnegie Endowment for International Peace, February 15, 2022, https://carnegieendowment.org/2022/02/15/why-eu-au-summit-could-be-turning-point-even-if-headlines-disappoint-pub-86448.\n33 “Summit for Democracy Commitment Dashboard,” News and Resources Portal for the Summit of Democracy, International IDEA, May 10, 2022, https://summitfordemocracyresources.eu/commitment-dashboard/.\n34 “Democracy Cohorts.” Summit for Democracy, February 2, 2022, https://summit4democracy.org/democracy-cohorts/.\n35 German Federal Foreign Office, Opening Speech by Foreign Minister Baerbock at the Conference “Strengthening Democracy – Towards Resilient Institutions and Societies in the G7 and Africa,” speech, September 9, 2022, https://www.auswaertiges-amt.de/en/newsroom/news/-/2554452.\n36 German Federal Foreign Office, “Reden zur Zeitenwende,” speech, February 27, 2022, https://www.bundesregierung.de/resource/blob/975292/2131062/78d39dda6647d7f835bbe76713d30c31/bundeskanzler-olaf-scholz-reden-zur-zeitenwende-download-bpa-data.pdf?download=1.\n37 German Federal Foreign Office, “Towards the National Security Strategy - the Process,” July 26, 2022, https://www.auswaertiges-amt.de/en/aussenpolitik/themen/nationale-sicherheitsstrategie.\n38 “Program Statement of the Government of the Czech Republic,” January 7, 2022, https://www.vlada.cz/cz/programove-prohlaseni-vlady-193547/#zahranicni_politika.\n39 Aneta Zachová, “Czech government to push through own Magnitsky Act,” Euractiv, January 13, 2022, https://www.euractiv.com/section/politics/short_news/czech-government-to-push-through-own-magnitsky-act/.\n40 Corentin Cohen, “Will France’s Africa Policy Hold Up?,” Carnegie Endowment for International Peace, June 2, 2022, https://carnegieendowment.org/2022/06/02/will-france-s-africa-policy-hold-up-pub-87228.\n41 Foreign, Commonwealth and Development Office for the United Kingdom and The Rt Hon Elizabeth Truss MP, “We Must Stand Together for Freedom and Democracy: Article by Liz Truss,” November 14, 2022, https://www.gov.uk/government/speeches/we-must-stand-together-for-freedom-and-democracy.\n42 Prime Minister’s Office for the United Kingdom, “PM speech to the Lord Mayor's Banquet,” speech, November 28, 2022, https://www.gov.uk/government/speeches/pm-speech-to-the-lord-mayors-banquet-28-november-2022.\n43 Cabinet Office for the United Kingdom, “Global Britain in a Competitive Age, The Integrated Review of Security, Defence, Development and Foreign Policy,” policy paper, March 16, 2021, https://www.gov.uk/government/publications/global-britain-in-a-competitive-age-the-integrated-review-of-security-defence-development-and-foreign-policy.\n44 Foreign, Commonwealth & Development Office for the United Kingdom and The Rt Hon Elizabeth Truss MP, “The Return of Geopolitics: Foreign Secretary's Mansion House Speech at the Lord Mayor’s 2022 Easter Banquet,” speech, April 27, 2022, https://www.gov.uk/government/speeches/foreign-secretarys-mansion-house-speech-at-the-lord-mayors-easter-banquet-the-return-of-geopolitics#full-publication-update-history.\n45 Foreign, Commonwealth and Development Office for the United Kingdom, “The UK Government’s Strategy for International Development,” May 16, 2022, https://www.gov.uk/government/publications/uk-governments-strategy-for-international-development/the-uk-governments-strategy-for-international-development.\n46 Foreign, Commonwealth and Development Office for the United Kingdom, “The UK Government’s Strategy for International Development,” May 16, 2022, https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1075328/uk-governments-strategy-international-development.pdf.\n47 Ministry of Foreign Affairs of Denmark, “Foreign and Security Policy Strategy 2022,” January 2022, https://um.dk/en/foreign-policy/foreign-and-security-policy-strategy-2022.\n48 Ministry of Foreign Affairs of Denmark, “How to Notes for Implementation of the Danish Strategy for Development Cooperation,” n.d., https://amg.um.dk/policies-and-strategies/how-to-notes-for-implementation-of-the-danish-strategy-for-development-cooperation.\n49 Ministry of Foreign Affairs for Norway, “The Government’s Political Platform: A Government for Ordinary People,” October 15, 2021, https://www.regjeringen.no/en/dokumenter/government_platform/id2877512/.\n50 Ministry for Foreign Affairs of Finland, “Finland’s Development Policy,” n.d., https://um.fi/goals-and-principles-of-finland-s-development-policy.\n51 Prime Minister’s Office for Sweden,” Statement of Government Policy,” speech, October 18, 2022, https://www.government.se/speeches/2022/10/statement-of-government-policy/.\n52 Katja Lihtenvalner, “Slovenia Elects First Female President,” Reuters, November 13, 2022, https://www.reuters.com/world/europe/slovenias-election-may-produce-first-woman-president-2022-11-13/.\n53 Ministry for Foreign and European Affairs for Malta, “Malta’s Foreign Policy Strategy,” February 9, 2022, https://foreign.gov.mt/en/Government/Documents/Ministry%20for%20Foreign%20Affairs%20-%20Foreign%20Policy%20Strategy.pdf.\n54 Ministère de l'Environnement, du Climat et du Développement durable / Direction de la coopération au développement et de l'action humanitaire pour Luxembour, “Rapport de mise en oeuvre de l'Agenda 2030 par le Luxembourg,” September 22, 2022, https://gouvernement.lu/fr/actualites/toutes_actualites/communiques/2022/09-septembre/22-agenda-2030.html.\n55 Chambre des représentants de Belgique, “Note de Politique Générale,” October 28, 2022, https://lahbib.belgium.be/sites/default/files/articles/Note%20de%20Politique%20G%C3%A9n%C3%A9rale%20-%20Beleidsnota%202022-2033.pdf.\n56 European Commission, “Commission Work Programme 2022,” October 19, 2021, https://eur-lex.europa.eu/resource.html?uri=cellar%3A9fb5131e-30e9-11ec-bd8e-01aa75ed71a1.0001.02/DOC_1&format=PDF.\n57 European Commission, “Commission Work Programme 2023,” October 18, 2022, https://eur-lex.europa.eu/resource.html?uri=cellar%3A413d324d-4fc3-11ed-92ed-01aa75ed71a1.0001.02/DOC_1&format=PDF.\n58 Co-Chairs of the Conference Executive Board, “Report on the Final Outcome of the Conference on the Future of Europe,” May, 2022, https://www.europarl.europa.eu/resources/library/media/20220509RES29121/20220509RES29121.pdf.\n59 European Commission, “Commission Sets Out First Analysis of the Proposals Stemming From the Conference on the Future of Europe,” press release, June 17, 2022, https://ec.europa.eu/commission/presscorner/detail/en/IP_22_3750.\n60 Von der Leyen, State of the Union speech, September 2022.\n61 European Commission, “2022 Rule of Law Report,” July 13, 2022, https://ec.europa.eu/info/publications/2022-rule-law-report-communication-and-country-chapters_en.\n62 Věra Jourová, “Letter to Mr. Carlos Lesmes Serrano,” September 9, 2022, https://media.euobserver.com/8f97546de93aa6ae9dcf3b16ad4f6b69.pdf.\n63 Council of the European Union, “Council of the EU Takes Steps Towards More Transparent Funding of European Political Parties,” press release, March 22, 2022, https://www.consilium.europa.eu/en/press/press-releases/2022/03/22/the-council-of-the-eu-moves-towards-more-transparent-funding-of-european-political-parties/.\n64 European Parliament, “Setting Up a Special Committee on Foreign Interference in All Democratic Processes in the European Union, Including Disinformation,” decision, March 10, 2022, https://www.europarl.europa.eu/doceo/document/TA-9-2022-0070_EN.pdf.\n65 European Parliament, “EP inquiry Committee for Pegasus and Other Spyware Launched,” press release, April 19, 2022, https://www.europarl.europa.eu/news/en/press-room/20220412IPR27112/ep-inquiry-committee-for-pegasus-and-other-spyware-launched.\n66 European Commission, “European Media Freedom Act - Proposal for a Regulation and Recommendation,” September 16, 2022, https://digital-strategy.ec.europa.eu/en/library/european-media-freedom-act-proposal-regulation-and-recommendation.\n67 European Commission, “Speech by Vice-President Jourová on Abusive Lawsuits Against Journalists and Human Rights Defenders ‘SLAPPs’,” speech, April 27, 2022, https://ec.europa.eu/commission/presscorner/detail/en/SPEECH_22_2706.\n68 European Commission, “Council Pushes for Further Actions to Protect Journalists and Media Professionals,” press release, June 21, 2022, https://www.consilium.europa.eu/en/press/press-releases/2022/06/21/council-pushes-for-further-actions-to-protect-journalists-and-media-professionals/.\n69 European Parliament and Council of the European Union, “Regulation (EU) 2022/1925 of the European Parliament and of the Council of 14 September 2022 on Contestable and Fair Markets in the Digital Sector and Amending Directives (EU) 2019/1937 and (EU) 2020/1828 (Digital Markets Act) (Text with EEA relevance),” October 12, 2022, https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=uriserv%3AOJ.L_.2022.265.01.0001.01.ENG&toc=OJ%3AL%3A2022%3A265%3ATOC.\n70 Council of the European Union, “Digital Services Act: Council and European Parliament Provisional Agreement for Making the Internet a Safer Space for European Citizens,” press release, April 23, 2022, https://www.consilium.europa.eu/en/press/press-releases/2022/04/23/digital-services-act-council-and-european-parliament-reach-deal-on-a-safer-online-space/.\n71 European Commission, “Fighting Propaganda War With Democratic Methods – New Anti-Disinformation Code,” June 16, 2022, https://ec.europa.eu/commission/presscorner/detail/en/AC_22_3791.\n72 Council of the European Union, “Council Conclusions on Foreign Information Manipulation and Interference (FIMI),” July 18, 2022, https://data.consilium.europa.eu/doc/document/ST-11429-2022-INIT/en/pdf.\n73 European Commission, “EU-US Launch Trade and Technology Council to Lead Values-Based Global Digital Transformation,” press release, June 15, 2021, https://ec.europa.eu/commission/presscorner/detail/en/ip_21_2990.\n74 European Commission, “Declaration for the Future of Internet,” publication, April 28, 2022, https://digital-strategy.ec.europa.eu/en/library/declaration-future-internet.\n75 European External Action Service, “US/EU: Joint Statement on Protecting Human Rights Defenders Online,” press release, December 3, 2022, https://www.eeas.europa.eu/eeas/useu-joint-statement-protecting-human-rights-defenders-online_en.\n76 Molly Killeen, “France proposes clarifications and additions in new rulebook for political ads,” Euractiv, June 7, 2022, https://www.euractiv.com/section/digital/news/france-proposes-clarifications-and-additions-in-new-rulebook-for-political-ads/.\n77 European Commission, “Commission Puts Forward Declaration on Digital Rights and Principles for Everyone in the EU,” press release, January 26, 2022, https://ec.europa.eu/commission/presscorner/detail/en/IP_22_452.\n78 “EU Restrictive Measures Against Russia Over Ukraine (since 2014),” Consilium, November 28, 2022. https://www.consilium.europa.eu/en/policies/sanctions/restrictive-measures-against-russia-over-ukraine/.\n79 Council of the European Union, “Ukraine: Council Agrees on Further Support Under the European Peace Facility,” press release, October 17, 2022, https://www.consilium.europa.eu/en/press/press-releases/2022/10/17/ukraine-council-agrees-on-further-support-under-the-european-peace-facility/.\n80 “Ukraine Support Tracker - A Database of Military, Financial and Humanitarian Aid to Ukraine,” Kiel Institute, n.d., https://www.ifw-kiel.de/topics/war-against-ukraine/ukraine-support-tracker/.\n81 European External Action Service, “Ukraine: the EU Advisory Mission Returns to Ukraine,” press release, May 18, 2022, https://www.eeas.europa.eu/eeas/ukraine-eu-advisory-mission-returns-ukraine_en.\n82 Council of the European Union, “Ukraine: EU Sets Up a Military Assistance Mission to Further Support the Ukrainian Armed Forces,” press release, October 17, 2022, https://www.consilium.europa.eu/en/press/press-releases/2022/10/17/ukraine-eu-sets-up-a-military-assistance-mission-to-further-support-the-ukrainian-armed-forces/.\n83 David Hutt, “How European Countries Stand on 2% of GDP Defence Spending,” euronews, July 22, 2022, https://www.euronews.com/my-europe/2022/07/20/how-european-countries-stand-on-2-of-gdp-defence-spending.\n84 European Commission, “Commission Proposes Stable and Predictable Support Package for Ukraine for 2023 of Up to €18 billion,” press release, November 9, 2022, https://ec.europa.eu/commission/presscorner/detail/en/ip_22_6699.\n85 European Commission, “Keynote speech by President von der Leyen at the Opening Ceremony of the Ukraine Recovery Conference,” speech, July 4, 2022, https://ec.europa.eu/commission/presscorner/detail/en/SPEECH_22_4302.\n86 European Commission, “Joint Statement by President von der Leyen and President Biden,” press release, March 24, 2022, https://neighbourhood-enlargement.ec.europa.eu/news/joint-statement-president-von-der-leyen-and-president-biden-2022-03-24_bg.\n87 Foreign, Commonwealth & Development Office for the United Kingdom, “Foreign Secretary Announces Critical Practical Support for Ukraine as Winter Sets In,” press release, November 25, 2022, https://www.gov.uk/government/news/foreign-secretary-announces-critical-practical-support-for-ukraine-as-winter-sets-in.\n88 Ministry of Foreign Affairs for Norway, “Norwegian Support to Ukraine and Neighbouring Countries,” November 29, 2022, https://www.regjeringen.no/en/topics/foreign-affairs/humanitarian-efforts/neighbour_support/id2908141/.\n89 “Swiss to Send CHF100 Million in Aid to Help Ukraine Get Through Winter,” swissinfo, November 2, 2022, https://www.swissinfo.ch/eng/politics/swiss-to-send-chf100-million-in-aid-to-help-ukraine-get-through-winter/48025666#:~:text=Switzerland%20will%20give%20CHF100%20million,aid%20due%20to%20the%20war.\n90 European Council, “European Council Conclusions on Ukraine, the Membership Applications of Ukraine, the Republic of Moldova and Georgia, Western Balkans and External Relations, 23 June 2022,” June 23, 2022, https://www.consilium.europa.eu/en/press/press-releases/2022/06/23/european-council-conclusions-on-ukraine-the-membership-applications-of-ukraine-the-republic-of-moldova-and-georgia-western-balkans-and-external-relations-23-june-2022/.\n91 European Commission, “Opinion on Ukraine’s Application for Membership of the European Union,” June 16, 2022, https://neighbourhood-enlargement.ec.europa.eu/opinion-ukraines-application-membership-european-union_en; European Commission, “Opinion on Moldova’s application for membership of the European Union,” June 16, 2022, https://neighbourhood-enlargement.ec.europa.eu/opinion-moldovas-application-membership-european-union_en.\n92 Minister for Europe and Foreign Affairs for France, “Moldova – Third Ministerial Conference of the Moldova Support Platform,” November 21, 2022, https://www.diplomatie.gouv.fr/en/country-files/moldova/events-4506/article/moldova-third-ministerial-conference-of-the-moldova-support-platform-21-nov.\n93 Minister of Foreign Affairs for Romania, “The Minister of Foreign Affairs Bogdan Aurescu Will Host in Bucharest the Second Edition of the Ministerial Conference of the Support Platform for the Republic of Moldova,” press release, July 7, 2022, https://www.mae.ro/node/59187.\n94 European Commission, “2022 Enlargement Package: European Commission Assesses Reforms in the Western Balkans and Türkiye and Recommends Candidate Status for Bosnia and Herzegovina,” press release, October 12, 2022, https://ec.europa.eu/commission/presscorner/detail/en/IP_22_6082.\n95 European Council and Council of the European Union, “Meeting of the European Political Community,” international summit, October 6, 2022, https://www.consilium.europa.eu/en/meetings/international-summit/2022/10/06/.\n96 European Commission, “EU and Azerbaijan Enhance Bilateral Relations, Including Energy Cooperation,” press release, July 18, 2022, https://ec.europa.eu/commission/presscorner/detail/en/IP_22_4550.\n97 Sarantis Michalopoulos, “Ukraine War Revives EastMed Gas Pipe Talks but EU Insists on Feasibility,” Euractiv, April 5, 2022, https://www.euractiv.com/section/energy/news/ukraine-war-revives-eastmed-gas-pipe-talks-but-eu-insists-on-feasibility/.\n98 Patrick Wintour, “Germany Agrees Gas Deal With Qatar to Help End Dependency on Russia,” Guardian, March 20, 2022, https://www.theguardian.com/world/2022/mar/20/germany-gas-deal-qatar-end-energy-dependency-on-russia.\n99 Chiara Albanese and Alberto Brambilla, “Italy Signs Gas Deals in Angola, Congo to Cut Russia Ties,” Bloomberg, April 20, 2022, https://www.bloomberg.com/news/articles/2022-04-20/italy-snaps-up-angolan-gas-after-deals-for-north-african-supply?leadSource=uverify%20wall.\n100 Delegation of the European Union to Ukraine, “Energy Policy Is at the Centre of EU Foreign Policy,” press release, May 23, 2022, https://www.eeas.europa.eu/delegations/ukraine/energy-policy-centre-eu-foreign-policy_en?s=232.\n101 European Commission, “COP27: EU and Egypt Step Up Cooperation on the Clean Energy Transition,” press release, November 16, 2022, https://ec.europa.eu/commission/presscorner/detail/en/ip_22_6925.\n102 European Commission, “Global Europe: Neighbourhood, Development and International Cooperation Instrument,” n.d., https://ec.europa.eu/info/funding-tenders/find-funding/eu-funding-programmes/global-europe-neighbourhood-development-and-international-cooperation-instrument_en.\n103 European Commission, “Strengthening Human Rights and Democracy in the World: EU Launches a €1.5 Billion Plan to Promote Universal Values,” press release, December 9, 2021, https://ec.europa.eu/commission/presscorner/detail/en/IP_21_6695.\n104 European Commission, “Global Gateway,” n.d., https://ec.europa.eu/info/strategy/priorities-2019-2024/stronger-europe-world/global-gateway_en.\n105 “EIB and European Commission, Sign New Agreement to Guarantee US$28.8 Billion for Global Gateway Investments,” Donor Tracker, May 10, 2022. https://donortracker.org/policy-updates/eib-and-european-commission-sign-new-agrreement-guarantee-us288-billion-global.\n106 European Commission, “Keynote Address by President von der Leyen at the 10th Annual Athens Democracy Forum,” speech, September 29, 2022, https://ec.europa.eu/commission/presscorner/detail/e%20n/speech_22_5885.\n107 European Parliament, “Pushed to Its Limits, the EU’s Long-Term Budget Urgently Needs to Be Revised,” press release, November 17, 2022, https://www.europarl.europa.eu/news/en/press-room/20221114IPR53913/pushed-to-its-limits-the-eu-s-long-term-budget-urgently-needs-to-be-revised.\n108 Minister for Europe and Foreign Affairs for France, “Speech by Catherine Colonna, Minister for Europe and Foreign Affairs, at the Conference of Ambassadors,” speech, September 2, 2022, https://www.diplomatie.gouv.fr/en/the-ministry-and-its-network/news/article/speech-by-catherine-colonna-minister-for-europe-and-foreign-affairs-at-the.\n109 “South Africa Hosts New Forum to Promote Democracy on the Continent,” Africanews, October 10, 2022, https://www.africanews.com/2022/10/07/south-africa-hosts-new-forum-to-promote-democracy-on-the-continent//.\n110 German Federal Ministry of Economic Cooperation and Development, “Zahlen und Fakten der deutschen Entwicklungszusammenarbeit,” n.d., https://www.bmz.de/de/ministerium/zahlen-fakten.\n111 Ministry of Foreign Affairs of Denmark, “The Government’s Priorities for Danish Development Cooperation 2022,” (Copenhagen: Ministry of Foreign Affairs of Denmark, 2021), 3, https://um.dk/en/danida/strategies-and-priorities/government-priorities-danish-development-assistance.\n112 Ministry of Foreign Affairs of Denmark, “Government and Civil Society – General,” https://openaid.um.dk/sector/151/2021?appBasePath=sectors&activeTab=Purpose.\n113 Ministry for Foreign Affairs of Finland, “Finland’s Development Policy,” n.d., https://um.fi/goals-and-principles-of-finland-s-development-policy.\n114 Council of Ministers of the Government of Spain, “Government of Spain Presents the Future Law on Cooperation for Sustainable Development and Global Solidarity,” January 11, 2022, https://www.lamoncloa.gob.es/lang/en/gobierno/councilministers/Paginas/2022/20220111_council.aspx.\n115 Solidarity Fund PL, https://solidarityfund.pl/.\n116 Ministry of Foreign Affairs for the Czech Republic, “Plan of Foreign Development Cooperation for the Year 2023,” June 14, 2022, https://www.mzv.cz/jnp/cz/zahranicni_vztahy/rozvojova_spoluprace/koncepce_publikace/rocni_plany/plan_zahranicni_rozvojove_spoluprace_na_1.htm.\n117 Ministry of Foreign Affairs for Lithuania, “Strategic Directions for Development Cooperation 2022-2025,” December 27, 2021, https://www.urm.lt/uploads/default/documents/STRATEGIC%20DIRECTIONS%20FOR%20DEVELOPMENT%20COOPERATION%202022%E2%80%932025.pdf.\n118 Ministry of Foreign Affairs for Estonia, “Development Cooperation and Humanitarian Aid,” n.d., https://www.vm.ee/valismajandus-arengukoostoo/arengukoostoo-ja-humanitaarabi.\n119 Ministry of Foreign Affairs for Norway, “A Green Aid Budget With a Focus on Solidarity,” November 8, 2022, https://www.regjeringen.no/en/aktuelt/solidarity_budget/id2882955/.\n120 Swiss Federal Department of Foreign Affairs, “Project.,” n.d., https://www.eda.admin.ch/deza/en/home.html.\n121 Philip Loft and Philip Brien, “The 0.7% Aid Target,” research briefing, November 29, 2022, https://commonslibrary.parliament.uk/research-briefings/sn03714/.\n122 Philip Loft, Philip Brien, CJ McKinney, “The UK Aid Budget and Support for Refugees in the UK in 2022,” research briefing, Wednesday 9, 2022, https://commonslibrary.parliament.uk/research-briefings/cbp-9663/.\n123 EU Neighbors South, “Launch of EU JEEL CONNECT Network: Connect, Act & Lead,” January 20, 2022, https://south.euneighbours.eu/news/launch-eu-jeel-connect-network-connect-act-lead/.\n124 European External Action Service, “Argentina: European Union Launches Support for Civil Society,” October 28, 2022, https://www.eeas.europa.eu/eeas/argentina-european-union-launches-support-civil-society_en.\n125 European External Action Service, “European Union to Launch a Fresh €39 Million Programme in Support of Democratic Governance in Nigeria,” September 9, 2022, https://www.eeas.europa.eu/delegations/nigeria/european-union-launch-fresh-%E2%82%AC39-million-programme-support-democratic-governance_en.\n126 German Federal Foreign Office, “Second Anniversary of the Fraudulent Presidential Elections in Belarus on 9 August 2020,” August 9, 2022, https://www.auswaertiges-amt.de/en/aussenpolitik/laenderinformationen/belarus-node/-/2546340.\n127 Ministry for Foreign Affairs for Sweden, “Strategy for Sweden’s Regional Development Cooperation With Asia and the Pacific Region in 2022–2026,” May 17, 2022, https://www.government.se/country-and-regional-strategies/2022/05/strategy-for-swedens-regional-development-cooperation-with-asia-and-the-pacific-region-in-20222026/.\n128 Ministry for Foreign Affairs for Sweden, “Sweden’s Regional Strategy for the Syria Crisis 2016–2020,” December 17, 2020, https://www.regjeringen.no/en/aktuelt/solidarity_budget/id2882955/.\n129 OECD, “Estonia,” in Development Co-operation Profiles, OECD Publishing, n.d., https://doi.org/10.1787/6a0551b5-en.\n130 Ministry of Foreign Affairs for Latvia, “The Foreign Ministry Awards Grants to Development Cooperation Projects in 2022-2023,” July 1, 2022, https://www.mfa.gov.lv/en/article/foreign-ministry-awards-grants-development-cooperation-projects-2022-2023.\n131 Ministry of European and International Affairs, “Safety of Journalists: Protecting Media to Protect Democracy High-level Conference,” November 4, 2022, https://www.bmeia.gv.at/en/european-foreign-policy/human-rights/priorities-of-austrian-human-rights-policy/safety-of-journalists/safety-of-journalists-protecting-media-to-protect-democracy-high-level-conference-vienna-3-4-november-2022/.\n132 Ministry of Foreign Affairs for Denmark, “Tech for Democracy,” n.d., https://techfordemocracy.dk/.\n133 Globalt Fokus, “Claim Your Space,” https://globaltfokus.dk/da/puljer/claim-your-space.\n134 Ministry of Foreign Affairs for Estonia, “Pledging Event on Taking Commitments to Defend Media Freedom,” February 10, 2022, https://www.youtube.com/watch?v=8F8RCFeQu58.\n135 Demo Finland, “Women Are Making Their Voice Heard in Sri Lankan Local Politics,” May 13, 2022, https://demofinland.org/en/women-are-making-their-voice-heard-in-sri-lankan-local-politics/.\n136 “Masar Programme Presentation,” FIIAPP, https://www.fiiapp.org/en/noticias/presentacion-del-programa-masar/.\n137 Global Initiative against Transnational Organized Crime, “Anti-corruption Conference Focuses on Enhancing Prevention and Dialogue,” May 27, 2022, https://globalinitiative.net/analysis/anti-corruption-conference-sibenik-croatia/.\n138 European Commission, “Commission Implementing Decision on the Financing of the Citizens, Equality, Rights and Values Programme and the Adoption of the Multiannual Work Programme for 2021-2022,” May 19, 2022, https://ec.europa.eu/info/sites/default/files/1_en_annexe_acte_autonome_part1_v8.pdf.\n139 European Civic Forum and Civic Space Watch, “Toward Vibrant European Civic and Democratic Space,” May, 2022, https://civicspacewatch.eu/wp-content/uploads/2022/05/European-civil-society-strategy-report-2022_European-Civic-Forum.pdf.\n140 European Commission, “Creative Europe MEDIA Programme,” n.d., https://digital-strategy.ec.europa.eu/en/policies/creative-europe-media.\n141 European Commission, “EU Supports Cross-Border Journalism With €8 million,” press release, April 6, 2022, https://ec.europa.eu/commission/presscorner/detail/en/IP_22_2297.\n142 European Commission, “Media Sector Calls — EU support to Media Freedom and Pluralism,” n.d., https://digital-strategy.ec.europa.eu/en/policies/funding-media-freedom.\n143 European Commission, “Speech of Vice-President Jourová for the Opening on the European Newsroom Project,” press release, September 6, 2022, https://ec.europa.eu/commission/presscorner/detail/en/SPEECH_22_5372.\n144 European Commission, “2022 Financing Decision on Multimedia Actions,” publication, March 29, 2022, https://digital-strategy.ec.europa.eu/en/library/2022-financing-decision-multimedia-actions.\n145 European Commission, “EU Anti-disinformation Hubs Now Extend to All EU Countries,” press release, December 1, 2022, https://digital-strategy.ec.europa.eu/en/news/eu-anti-disinformation-hubs-now-extend-all-eu-countries.\n146 EDMO, “The EDMO Network Expands to All EU Member States Through Six New Hubs,” December 1, 2022, https://edmo.eu/2022/12/01/the-edmo-network-expands-to-all-eu-member-states-through-six-new-hubs/.\n147 U.S. Department of State, “ITALY – Summit for Democracy – Written Statement,” https://www.state.gov/wp-content/uploads/2022/02/ITALY-Activities-Report-508-Accessible.pdf.\n148 “Currently Available Funding.,” EEA Grants, n.d., https://eeagrants.org/currently-available-funding.\n149 Von der Leyen, State of the Union speech, September 2022.\n150 European Commission, “Commission Moves to Ban Products Made With Forced Labour on the EU Market,” press release, September 14, 2022, https://ec.europa.eu/commission/presscorner/detail/en/ip_22_5415.\n151 European Commission, “Proposal for a Directive of the European Parliament and of the Council on Corporate Sustainability Due Diligence and amending Directive,” February 23, 2022, https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX%3A52022PC0071.\n152 European Commission, “Ukraine: Commission Proposes to Criminalise the Violation of EU Sanctions,” press release, December 2, 2022, https://ec.europa.eu/commission/presscorner/detail/en/ip_22_7371.\n153 European Commission, “Ukraine: EU Agrees to Extend the Scope of Sanctions on Russia and Belarus,” press release, March 9, 2022, https://ec.europa.eu/commission/presscorner/detail/en/ip_22_1649.\n154 Council of the European Union, “Myanmar/Burma: EU Imposes Restrictive Measures on 22 Individuals and 4 Entities in Fourth Round of Sanctions,” press release, February 21, 2022, https://www.consilium.europa.eu/en/press/press-releases/2022/02/21/myanmar-burma-eu-imposes-restrictive-measures-on-22-individuals-and-4-entities-in-fourth-round-of-sanctions.\n155 Foreign, Commonwealth & Development Office for the United Kingdom, “UK Announces New Sanctions Against Myanmar Ahead of 1-year Anniversary of Coup,” press release, January 31, 2022, https://www.gov.uk/government/news/uk-announces-new-sanctions-against-myanmar-ahead-of-one-year-anniversary-of-coup.\n156 Council of the European Union, “Bosnia and Herzegovina: Council Extends Sanctions Regime Until 31 March 2024,” press release, March 18, 2022, https://www.consilium.europa.eu/en/press/press-releases/2022/03/18/bosnia-and-herzegovina-council-extends-sanctions-regime-until-31-march-2024/.\n157 European Commission, “Multi-annual Indicative Programme 2021-2027,” n.d., https://international-partnerships.ec.europa.eu/system/files/2022-01/mip-2021-c2021-9094-iran-annex_en.pdf.\n158 German Federal Foreign Office, “Foreign Minister Annalena Baerbock on the Situation in Iran,” press release, October 10, 2022, https://www.auswaertiges-amt.de/en/newsroom/news/-/2560416.\n159 European Commission, “Proposal for a Regulation of the European Parliament and of the Council on Applying a Generalised Scheme of Tariff Preferences and Repealing Regulation (EU) No 978/2012 of the European Parliament and of the Council,” September 22, 2021, https://trade.ec.europa.eu/doclib/docs/2021/september/tradoc_159803.pdf.\n160 European Parliament, “The Commission Proposal on Reforming the Generalised Scheme of Tariff Preferences: Analysis of Human Rights Incentives and Conditionalities,” January 2022, https://www.europarl.europa.eu/RegData/etudes/IDAN/2022/653661/EXPO_IDA(2022)653661_EN.pdf.\n161 European Ombudsman, “Closing Note on the Strategic Initiative Concerning How the European Commission Ensures Respect for Human Rights in the Context of International Trade Agreements,” July 15, 2022, https://www.ombudsman.europa.eu/en/doc/correspondence/en/158519?utm_source=POLITICO.\n162 European External Action Service, “Serbia-Kosovo: Remarks by the High Representative Josep Borrell following the deal reached,” press release, August 27, 2022, https://www.eeas.europa.eu/eeas/serbia-kosovo-remarks-high-representative-josep-borrell-following-deal-reached_en.\n163 EU Sanctions Map, last updated December 31, 2022, www.sanctions map.eu.\n164 German Federal Parliament, “Human Rights Committee travels to Taiwan and Japan,” press release, October 21, 2022, https://www.bundestag.de/presse/pressemitteilungen/2022/pm-221021.\n165 Stuart Lau, “Down to 14 + 1: Estonia and Latvia Quit China’s Club in Eastern Europe,” Politico, August 11, 2022, https://www.politico.eu/article/down-to-14-1-estonia-and-latvia-quit-chinas-club-in-eastern-europe/.\n166 Raja Abdulrahim, Patrick Kingsley, Christiaan Triebert and Hiba Yazbek, “The Killing of Shireen Abu Akleh: Tracing a Bullet to an Israeli Convoy,” New York Times, June 20, 2022, https://www.nytimes.com/2022/06/20/world/middleeast/palestian-journalist-killing-shireen.html.\n167 European External Action Service, Israel/Palestine: Statement by the High Representative on the police action at the funeral of Shireen Abu Akleh, press release, May 13, 2022, https://www.eeas.europa.eu/eeas/israelpalestine-statement-high-representative-police-action-funeral-shireen-abu-akleh_en.\n168 Council of the European Union, “EU-Israel Association Council,” October 3, 2022, https://www.consilium.europa.eu/en/meetings/international-ministerial-meetings/2022/10/03/.\n169 Council of the European Union, “Relations with Israel - European Union's position for the Association Council’s 12th meeting,” note, October 3, 2022, https://www.consilium.europa.eu/media/59337/st13103-en22.pdf.\n170 Department for International Trade, “UK Takes First Steps Towards New Trade Deal With Israel,” press release, February 1, 2022, https://www.gov.uk/government/news/uk-takes-first-steps-towards-new-trade-deal-with-israel.\n171 European External Action Service, “The European Union Provides €2.6 Million to Farmers in Gaza,” press release, August 11, 2022, https://www.eeas.europa.eu/delegations/palestine-occupied-palestinian-territory-west-bank-and-gaza-strip/european-union-17_en.\n172 “Joint Letter From the Foreign Ministers of Ireland, Belgium, Cyprus, Estonia, Finland, France, Greece, Latvia, Lithuania, Luxembourg, Malta, Poland, Portugal, Spain and Sweden,” April 8, 2022, https://www.politico.eu/wp-content/uploads/2022/04/11/LETTER-PALESTINIAN-1-1.pdf.\n173 “EU welcomes Spain's shift on Western Sahara, backs UN efforts,” Reuters, March, 22, 2022, https://www.reuters.com/world/eu-backs-spains-shift-western-saharan-autonomy-2022-03-21/.\n174 European Commission, “Statement by President von der Leyen with Egyptian President El-Sisi,” June 15, 2022, https://ec.europa.eu/commission/presscorner/detail/en/STATEMENT_22_3713.\n175 European Union Election Observation Mission in Lebanon, “Final Report,” May 15, 2022, https://www.eeas.europa.eu/sites/default/files/documents/EU%20EOM%20Lebanon%202022%20Final%20report%20English_0.pdf.\n176 Sebastian Usher and Leo Sands, “Tunisia Referendum: President Saied Celebrates Expected Referendum Win,” BBC, July 26, 2022, https://www.bbc.com/news/world-africa-62289550.\n177 European Commission, “Commissioner Várhelyi Travels to Tunisia,” March 28, 2022, https://neighbourhood-enlargement.ec.europa.eu/news/commissioner-varhelyi-travels-tunisia-2022-03-28_en.\n178 European External Action Service, “Tunisia: Speech on Behalf of High Representative/Vice-President Josep Borrell at the EP Debate on the Political Situation,” speech, October 19, 2022, https://www.eeas.europa.eu/eeas/tunisia-speech-behalf-high-representativevice-president-josep-borrell-ep-debate-political_en.\n179 Benjamin Fox, “Failure on Ethiopia Sanctions ‘My Biggest Frustration’ This Year, Says EU’s Top Diplomat,” Euractiv, December 14, 2021, https://www.euractiv.com/section/africa/news/failure-on-ethiopia-sanctions-my-biggest-frustration-says-eus-top-diplomat/.\n180 Council of the European Union, “Ethiopia: Statement by the High Representative on Behalf of the EU,” press release, December 22, 2022, https://www.consilium.europa.eu/en/press/press-releases/2022/12/22/ethiopia-statement-by-the-high-representative-on-behalf-of-the-eu/.\n181 European External Action Service, “Sudan: Statement by the Spokesperson on the Lifting of the State of Emergency,” press release, May 30, 2022, https://www.eeas.europa.eu/eeas/sudan-statement-spokesperson-lifting-state-emergency_en.\n182 Council of the European Union, “Sri Lanka: Declaration by the High Representative on Behalf of the European Union on recent developments,” press release, July 22, 2022, https://www.consilium.europa.eu/en/press/press-releases/2022/07/22/sri-lanka-declaration-by-the-high-representative-on-behalf-of-the-european-union-on-recent-developments/.\n183 European External Action Service, “The European Union and Thailand initial Partnership and Cooperation Agreement,” press release, September 2, 2022, https://www.eeas.europa.eu/eeas/european-union-and-thailand-initial-partnership-and-cooperation-agreement_en.\n184 European External Action Service, “Venezuela: Statement of the Spokesperson on the Attacks Against Juan Guaidó,” press release, June 15, 2022, https://www.eeas.europa.eu/eeas/venezuela-statement-spokesperson-attacks-against-juan-guaid%C3%B3_en.\n185 Ana Curic, “Arms Exports: A Business Without an EU Policy,” Investigate Europe, April 1, 2022, https://www.investigate-europe.eu/en/2022/arms-exports-a-business-without-an-eu-policy/.\n186 European Commission, “EU Budget: Commission Proposes Measures to the Council Under the Conditionality Regulation,” press release, September 18, 2022, https://ec.europa.eu/commission/presscorner/detail/en/IP_22_5623.\n187 European Commission, “Remarks by Commissioner Hahn at the College Read-out on the Protection of the EU Budget in Hungary,” press release, September 18, 2022, https://ec.europa.eu/commission/presscorner/detail/en/SPEECH_22_5583.\n188 Paola Tamma, “Hungary Vows to Overhaul Its Judiciary, Hoping to Unlock EU Funds,” Politico, November 7, 2022, https://www.politico.eu/article/hungary-overhaul-judiciary-unlock-eu-funds/.\n189 European Commission, “Strategy to Strengthen the Application of the Charter of Fundamental Rights in the EU,” December 2, 2020, https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX%3A52020DC0711&qid=1608047356199.\n190 Sam Fleming, Henry Foy, and Raphael Minder, “Warsaw Seeks to Convince Brussels of Judicial Reforms as It Tries to Unlock Billions of Euros in Economic Assistance,” Financial Times, October 16, 2022, https://www.ft.com/content/e9c718ba-cccd-4b6d-8b22-d3481623a3d1.\n191 European Parliament, “MEPs: Hungary Can No Longer Be Considered a Full Democracy,” press release, September 15, 2022, https://www.europarl.europa.eu/news/en/press-room/20220909IPR40137/meps-hungary-can-no-longer-be-considered-a-full-democracy.\n192 Ibid.\n193 European Commission, “Commission Refers HUNGARY to the Court of Justice of the EU Over Violation of LGBTIQ Rights,” press release, July 15, 2022, https://ec.europa.eu/commission/presscorner/detail/en/ip_22_2689.\n194 European Commission, “Media Freedom: The Commission Refers HUNGARY to the Court of Justice of the European Union for Failure to Comply with EU Electronic Communications Rules,” press release, July 15, 2022, https://ec.europa.eu/commission/presscorner/detail/en/IP_22_2688.\n195 European Court of Human Rights, “Judgment Advance Pharma SP. z o.o v. Poland - Systemic Dysfunction in Judicial Appointments Procedure in Poland,” press release, February 3, 2022, https://hudoc.echr.coe.int/eng-pres.\n196 Council of the European Union, “A Strategic Compass for Security and Defence,” March 21, 2022, https://data.consilium.europa.eu/doc/document/ST-7371-2022-INIT/en/pdf.\n197 European Commission, “Peace and Security in the World: EU Launches New Programme to Support Peace, Stability and Conflict Prevention,” December 22, 2021, https://fpi.ec.europa.eu/peace-and-security-world-eu-launches-new-programme-support-peace-stability-and-conflict-prevention-2021-12-22_en.\n198 Council of the European Union, “European Peace Facility: €600 Million for Support to the African Union,” press release, April 21, 2022, https://www.consilium.europa.eu/en/press/press-releases/2022/04/21/european-peace-facility-600-million-for-support-to-the-african-union/.\n199 “EU Ends Part of Mali Training Mission, Fearing Russian Interference, Borrell Says,” Reuters, April 12, 2022, https://www.reuters.com/world/eu-ends-part-mali-training-mission-fearing-russian-interference-borrell-says-2022-04-11/.\n200 “Britain to Withdraw Troops From Mali Peacekeeping Force,” Reuters, November 14, 2022, https://www.reuters.com/world/uk/britain-withdraw-troops-mali-peacekeeping-force-2022-11-14/.\n201 European Commission, “International Partnership - Mali,” n.d., https://international-partnerships.ec.europa.eu/countries/mali_en.\n202 Council of the European Union, “EUCAP Sahel Niger: Mission Extended Until 30 September 2024 With an Adjusted Mandate,” September 9, 2022, https://www.consilium.europa.eu/en/press/press-releases/2022/09/09.\n203 Africanews with AFP, “Burkina Faso Civil Groups Protest Against French Military Cooperation,” Africanews, March 28, 2022, https://www.africanews.com/2022/03/28/burkina-faso-civil-groups-protest-against-french-military-cooperation//.\n204 “Burkina Faso: MEPs Demand Immediate Return to Constitutional Order,” European Sting, October 21, 2022, https://europeansting.com/2022/10/21/burkina-faso-meps-demand-immediate-return-to-constitutional-order/.\n205 Jutta Urpilainen, “Burkina Faso: Remarks on Behalf of High Representative/Vice-President Josep Borrell at the EP Debate Following the Coup de Force,” press release, October 4, 2022, https://www.eeas.europa.eu/eeas/burkina-faso-remarks-behalf-high-representativevice-president-josep-borrell-ep-debate_en.\n206 Andrew Rettman, “New EU Military Missions in West Africa to Counter Russia,” EUObserver, May 29, 2022, https://euobserver.com/world/155068.\n207 European Commission, “Multiannual Indicative Programme for the Republic of South Sudan: 2021-2027,” https://international-partnerships.ec.europa.eu/system/files/2022-01/mip-2021-c2021-9381-south-sudan-annex_en.pdf.\n208 EEAS, “South Sudan: Statement by the Spokesperson on the Latest Developments,” press release, September 22, 2022, https://www.eeas.europa.eu/eeas/south-sudan-statement-spokesperson-latest-developments_en?s=121.\n209 “Mozambique: More Countries Join Training Mission Against Terrorism,” press release, May 30, 2022, https://allafrica.com/stories/202205310107.html.\n210 Samer Al-Atrush and Laura Pitel, “Russia Reduces Number of Syrian and Wagner Troops in Libya,” Financial Times, April 28, 2022, https://www.ft.com/content/88ab3d20-8a10-4ae2-a4c5-122acd6a8067.\n211 Council of the EU, “Iraq: Council Extends Advisory Mission on Security Sector Reform Until 2024,” press release, April 13, 2022, https://www.consilium.europa.eu/en/press/press-releases/2022/04/13/iraq-council-extends-advisory-mission-on-security-sector-reform-until-2024/.\n212 German Federal Foreign Office, “Six Months of the Action Plan for Afghanistan,” June 23, 2022, https://www.auswaertiges-amt.de/en/aussenpolitik/laenderinformationen/afghanistan-node/action-plan-afg/2538690.\n213 European External Action Service, “Announcement on the Launch of the Afghan Women Leaders Forum,” press release, March 10, 2022, https://www.eeas.europa.eu/eeas/announcement-launch-afghan-women-leaders-forum_en.\n214 Alberto Alemanno, Adam Mouyal, “‘The Borrell Doctrine,’ A Conversation With the HRVP,” Groupe d’études géopolitiques, October 2022, https://geopolitique.eu/en/2022/10/31/a-conversation-with-josep-borrell/.\nMiddle EastAsiaRussiaEuropeNorth AmericaEastern EuropeNorth AfricaEgyptEast AsiaWestern EuropeIranForeign PolicyEUDemocracy\nCarnegie does not take institutional positions on public policy issues; the views represented herein are those of the author(s) and do not necessarily reflect the views of Carnegie, its staff, or its trustees.\n- What If Trump Gets His Russia-Ukraine Deal?Commentary\nIt’s dangerous to dismiss Washington’s shambolic diplomacy out of hand.\nEric Ciaramella\n- Taking the Pulse: Can the EU Attract Foreign Investment and Reduce Dependencies?Commentary\nEU member states clash over how to boost the union’s competitiveness: Some want to favor European industries in public procurement, while others worry this could deter foreign investment. So, can the EU simultaneously attract global capital and reduce dependencies?\nRym Momtaz, ed.\n- What Can the EU Do About Trump 2.0?Article\nEurope’s policy of subservience to the Trump administration has failed. For Washington to take the EU seriously, its leaders now need to combine engagement with robust pushback.\nStefan Lehne\n- To Survive, the EU Must SplitCommentary\nLeaning into a multispeed Europe that includes the UK is the way Europeans don’t get relegated to suffering what they must, while the mighty United States and China do what they want.\nRym Momtaz\n- U.S. Peace Mediation in the Middle East: Lessons for the Gaza Peace PlanPaper\nAs Gaza peace negotiations take center stage, Washington should use the tools that have proven the most effective over the past decades of Middle East mediation.\nAmr Hamzawy, Sarah Yerkes, Kathryn Selfe",
  "word_count": 22281,
  "scraped_at": "2026-02-14T13:44:12.081195"
}