{
  "article_id": "39953c90e0a4",
  "url": "https://thedailycougar.com/2025/09/25/its-a-business-trip-houston-vs-oregon-state-preview/",
  "title": "  It a business trip : Houston vs . Oregon State preview",
  "date": "20250925T193000Z",
  "domain": "thedailycougar.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A 1,800-mile trip, a 55-year gap and an undefeated record on the line, Houston football heads to Oregon State with momentum and motivation.\nHouston football is set to face off against the Oregon State Beavers this Friday, and coach Willie Fritz has his team focused on taking care of business.\nHouston’s game against Oregon State will mark the fourth-largest distance traveled for a regular-season game in program history, and the two teams will match up for the first time in 55 years.\n“When we get there, it’s a business trip,” Fritz said. “We want to enjoy each other’s company, but it’s a business trip without question.”\nFritz’s winning culture\nFritz is a winner and has been since he started coaching football. From his early days at Blinn to defeating a top-ranked USC team in the Cotton Bowl at Tulane, Fritz knows how to rebuild a program to reach its highest potential.\nHouston had a 4-8 record in 2023 and decided to switch direction by hiring Fritz as the head coach for the foreseeable future.\nWith year two already underway, the nation has taken notice of what he has done with Houston’s football program.\nThe newly hired women’s basketball coach Matthew Mitchell also appreciates what Fritz and men’s basketball coach Kelvin Sampson have done in their time with Houston and how they have turned their respective programs around.\nSome words he used to describe the two coaches are: “Inspirational, instructional and motivating.”\n“It gives you some confidence that if you do the right things, you can make it happen,” Mitchell said. “Tremendous, to be around those two great coaches.”\nIn just a year, the Cougars have gone from a team struggling in conference play to now being favored in every game they have had this season.\nHouston is a 13.5-point favorite against the Beavers and has an 81.3% chance to win, according to the ESPN Matchup Predictor.\nThe Cougars will need to stick to the motto that Fritz has preached all year long. “Coogs don’t beat the Coogs.”\nBeing heavily favored in this game, Houston will have to demonstrate its true character and culture, treating this matchup just like any other to achieve success.\n“We are going to have to play extremely well,” Fritz said. “We are working on getting better every single day, and every single week.”\nHistory vs. Oregon State\nHouston football leads the Oregon State Beavers all-time with a 2-1 edge in their brief matchup history.\nThe two teams first faced off in 1960 in Portland, Ore., and the Beavers won the game 29-20.\nHouston and Oregon State went on to rematch the next season at Rice Stadium, and the Cougars got their revenge in a 23-12 victory.\nTheir final matchup took place in the 1970 season, and Houston once again took advantage of playing in Texas, winning a nail-biter 19-16.\nThe Cougars have been able to take advantage in the games where they were the home team. On Friday, Houston will look to bounce back from their lone loss to the Beavers in 1960 in Corvallis and start the season 4-0.\nOregon State Overview\nThe Beavers have had a rough start to the 2025 season and are still searching for their first win of the season.\nOregon State is 0-4, with losses to California, Fresno State, No. 12 Texas Tech and No. 6 Oregon.\nTrent Bay\nThe Beavers are led by head coach Trent Bay, who was promoted in 2023. Before, Bay was the program’s defensive coordinator and fielded one of the top defensive teams in the conference.\nThe second-year head coach has a great deal of respect for Houston and what they’ve accomplished this season.\n“They are another talented team,” Bay said in his weekly press conference. “Houston is explosive offensively. The defense throws a lot at you. It’ll be another great challenge for us.”\nMaalik Murphy\nJunior quarterback Malik Murphy orchestrates the offense for the Beavers. The third-year quarterback formerly played for the University of Texas and Duke.\nLast year with the Blue Devils, Murphy had a breakout season, passing for almost 3,000 yards and 26 touchdowns.\nThe arm talent is there for the veteran quarterback. The only question at times is the accuracy.\nLast year, he threw 12 interceptions and already has five this season, which continues to be a major issue.\nWith Murphy only accounting for six touchdowns on the season, the Beavers will need help in other areas to compete against the Cougars.\nAnthony Hankerson\nSenior running back Anthony Hankerson is the primary back in the Beavers’ offense.\nHe has had 65 carries for 228 yards and two touchdowns this season. Hankerson also has more carries than the rest of the team combined.\nWhile this season hasn’t been the best of his career, he showed what he was capable of last year.\nHankerson rushed 232 times for 1,082 yards and 15 touchdowns last season, and he is still searching for the breakout game to get him back on track.\nWide receivers\nOregon State’s wide receiver room is led by senior Trent Walker and sophomore Taz Reddicks.\nWalker has 23 receptions for 302 yards and is the primary target in this offense.\nReddicks follows with 17 receptions for 240 yards and is still searching for his first touchdown of the season.\nOregon State likes to use Murphy’s elite arm to test the field vertically to open up the running game as well.\nDefense\nThe Beavers’ defense has allowed 39 points per game and allowed 156 total points to opponents this season.\nWith a Houston team coming to town with an offense averaging almost 33 points per game, that is not a good recipe for success for Oregon State.\nThe Beavers also have allowed 797 yards on the ground this season on 4.9 yards per rush attempt.\nHouston relies heavily on their run game with senior running back Dean Connors, so the Beavers will have to take charge in the trenches to slow down the Cougars’ run game.\nOregon State hasn’t been able to generate a pass rush, and opposing quarterbacks have been very comfortable in the pocket.\nSo far this season, the defense has only three sacks and has one of the lowest pressure rates in the conference.\nOverall, the Beavers’ defense has not been what they used to be in previous years, and they have to find some answers before facing the Cougars on Friday.\nTravel\nThe Cougars will play their first actual road game against Oregon State, with their only other road game this season being Rice, which is just three miles from campus.\nIn preparation for away games, the Cougars have stayed in a hotel every night before a game, allowing them to maintain a consistent routine every weekend.\nThe distance between the two airports is approximately 1,809 miles, which is around a four-hour flight.\nThe Cougars will fly into Eugene, Ore., where they will stay, then take a bus about an hour north to the stadium.\nUp next\nThe Cougars look to continue their undefeated season against Oregon State on Friday, Sep. 26, at 9:30 p.m. at Reser Stadium in Corvallis, Ore.\nWith momentum and experience on their side, the Cougars are in a prime position to keep the win streak alive if they treat this game like a business trip, just as Fritz mentioned.\nsports@thedailycougar.com",
  "word_count": 1217,
  "scraped_at": "2026-02-14T14:17:49.057430"
}