{
  "article_id": "39a6d83dab23",
  "url": "https://www.wltx.com/article/news/nation-world/victims-identified-alabama-birthday-party-shooting/507-d0889c65-4893-425a-ad83-8ce42d43945a",
  "title": "First victims identified after fatal Alabama birthday shooting",
  "date": "20230418T033000Z",
  "domain": "wltx.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "DALEVILLE, Ala. — Shaunkivia Nicole Smith was so exhilarated at the prospect of graduating from Dadeville High School that she often reminded a neighbor of the exact hour it was supposed to happen.\n“KeKe,” as she was known, had already shared selfies taken in her cap and gown, writing “almost out.”\nIt was not to be.\nAt 17, Smith was among four young people shot and killed at a Sweet 16 birthday party on Saturday in the small Alabama town of Dadeville, about an hour's drive northeast of Montgomery.\nClassmates returned to school Monday without her or fellow senior Philstavious “Phil” Dowdell, 18, of Camp Hill, a star football player who was also fatally shot in the melee that injured 32 in addition to those slain. It happened at the Mahogany Masterpiece dance studio off Dadeville's courthouse square. The school, with 485 students in grades 6-12, is central to life in the community of 3,200, where “Home of the Tigers” is painted on the water tower and local businesses sport signs proclaiming “This is Tiger Country.” Investigators called again Monday for any members of the public with information about the shooting to come forward. They said there was no evidence of a high-powered rifle being used in the killings, but shell casings found at the dance studio were consistent with those used in handguns.\nThe weekend was marked by a series of high-profile shootings in the U.S. One left two people dead and four wounded Saturday in Louisville, Kentucky; another resulted in four men being shot — one fatally — in Los Angeles; and a third left two women wounded at Lincoln University in southeastern Pennsylvania. Nancy Morgan, a neighbor of Smith’s who recalled her focus on graduation, said her granddaughter was a friend of the teenager's and attended the fatal party. “Thank the Lord she made it out,” Morgan said.\n“I feel so for the kids… they need to be loved,” she said. “They need our hugs and support.”\nDadeville locals were quick to say that violence was uncharacteristic of their community, but gun deaths are more common in Alabama than in most places. The state had the fifth highest rate of gun deaths nationwide in 2020, according to the U.S. Centers for Disease Control and Prevention.\nIt wasn't clear if all 32 people injured in Dadeville were shot or if some suffered other injuries. Heidi Smith, a spokesperson for Lake Martin Community Hospital, said 15 people with gunshot wounds were seen there. More were taken to other facilities, five with critical injuries, Smith said.\nIt was still unclear Monday who started the shooting or why, although one witness said multiple people were firing. Also unclear was whether investigators had made any arrests.\nIn addition to Smith and Dowdell, Tallapoosa County Coroner Mike Knox said the dead included 2022 Opelika High School graduate Marsiah Emmanuel “Siah” Collins, 19, an aspiring singer whose father said he planned to start college this fall; and 2022 Dadeville High graduate Corbin Dahmontrey Holston, 23, another former athlete at the school.\nMuch of the early public attention focused on Dowdell, who played wide receiver on the Dadeville High football team in a state where football rules Friday nights and Saturdays in the fall. The Tigers went undefeated in last year's regular season before losing in the playoffs. Dowdell was committed to play college ball at Jacksonville State University east of Birmingham.\nThe shooting happened at his sister Alexis' birthday party.\nAmy Jackson, an older cousin of Smith's who said she was more of an aunt to the teenager, recalled her “million-dollar\" smile.\n“She would light the room up when she walked in. She was that type,\" Jackson said. She described her as a talented athlete who ran track and played multiple team sports until a knee injury sidelined her. Then she jumped in to serve as a team manager.\nSmith's last act before leaving for the party Saturday was to get her little sister ready for bed.\n\"That was her nature. She was a caretaker,” Jackson said.\nKeenan Cooper, the DJ at the party, told WBMA-TV the event was stopped briefly when attendees heard someone had a gun. He said people with guns were asked to leave, but no one did.\nThe shooting sparked what Mayor Frank Goodman said was a “chaotic” scene at the town’s small hospital, where emergency workers, relatives and friends swarmed on Saturday. Smith said six people were treated locally and released, but others were transferred to larger hospitals in Birmingham, Montgomery and Opelika, Alabama, as well as to Columbus, Georgia.\nCopyright 2025 Associated Press. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.",
  "word_count": 778,
  "scraped_at": "2026-02-14T13:25:22.782832"
}