{
  "article_id": "39e528da1e59",
  "url": "https://www.bbc.com/news/articles/c981n34e2qmo",
  "title": "Futsal player Ella Brennan  proud  to play in Lionesses squad",
  "date": "20241007T143000Z",
  "domain": "bbc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Futsal player 'proud' to play in Lionesses squad\nA futsal player who only took up the sport two years ago has said it is \"incredible\" to have been selected to play for England.\nElla Brennan, who is 18 and from Derby, is part of the first ever England Futsal Lionesses squad.\nShe and her teammates are due to compete in a qualifying tournament in Moldova, where they will be hoping to win a place in the first FIFA Women’s Futsal World Cup.\nIt is also the first time England have entered a female futsal team into a tournament recognised by UEFA.\n'Believe in yourself'\n\"I'm so proud, I wouldn't have been able to do it without my family's support,\" said Ms Brennan.\n“The women’s game – both football and futsal – has developed massively over the last few years.\n\"If there is anyone out there who is thinking of taking up futsal, I’d say just go for it. Believe in yourself and your ability.\"\nMs Brennan started playing football when she was seven and plays club football for Stoke City.\nShe started playing futsal on the side two years ago when she joined Derby Futsal Club, who play their home games at the University of Derby.\nFutsal is similar to football but is played with a smaller and harder ball, which does not bounce as much.\nMs Brennan said she was \"awful\" when she initially went for an open trial.\n\"I literally couldn't control the ball at all,\" she said.\nHowever, she persisted and now loves it.\n“Futsal complements the way I play football semi-professionally and I’d encourage more females to take up the sport,\" she said.\n'Incredibly proud'\nMs Brennan is currently studying sport at the University of Derby, and said Derby Futsall Club had played a key role in helping her gain a sports scholarship there.\nJordan Butler, performance sports manager at the university, said: “We are incredibly proud of Ella and are looking forward to following her journey with the England Futsal Lionesses.”\nShe and the rest of the 14-strong squad will play Finland, Slovenia and hosts Moldova between 16 and 19 October, for a place in the Futsal World Cup in 2025.\nFollow BBC Derby on Facebook, on X, or on Instagram. Send your story ideas to eastmidsnews@bbc.co.uk or via WhatsApp on 0808 100 2210.",
  "word_count": 389,
  "scraped_at": "2026-02-14T13:05:31.596118"
}