{
  "article_id": "39f74e324b05",
  "url": "https://evanstonroundtable.com/2023/08/01/former-attorney-general-lynch-to-review-nu-athletics/",
  "title": "Former Attorney General Lynch to review NU athletics",
  "date": "20230802T023000Z",
  "domain": "evanstonroundtable.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Editor’s note: This story has been updated with new details from a lawsuit filed Wednesday by former Northwestern football player Ramon Diaz.\nNorthwestern University announced Tuesday its hiring of former U.S. Attorney General Loretta Lynch to conduct an outside review of both the accountability mechanisms that exist within the school’s athletic department and the broader culture of the university’s athletic programs as a whole.\nPresident Michael Schill previously promised faculty and staff an independent investigation after student-athletes brought forward explosive allegations of sexualized hazing within the football program, physical abuse and sexism perpetrated by the former baseball coach, and a hazing incident on the volleyball team.\n“Hazing has absolutely no place at Northwestern. Period,” Schill said in a university press release published Tuesday morning. “I am determined that with the help of Attorney General Lynch, we will become a leader in combating the practice of hazing in intercollegiate athletics and a model for other universities.\n“We will provide all of our students with the resources and support they need and do whatever is necessary to protect their safety and ensure that our athletics program remains one we can all be proud of.”\nAfter her term from 2015 to 2017 as attorney general, Lynch re-entered private practice in 2019 with law firm Paul, Weiss, Rifkind, Wharton & Garrison. Since then, she has completed internal investigations into allegations of sexual harassment and workplace misconduct at several companies and two universities: Syracuse and North Carolina State.\nThe results of Lynch’s athletic department review will be made public, which will help the community “be better informed and guided,” said Derrick Gragg, NU’s vice president for athletics & recreation.\nSo far, Northwestern has refused to publicly release the original investigation, conducted by attorney Maggie Hickey, into hazing allegations made by a football player in November 2022. The university published a two-page executive summary of Hickey’s report on July 7, when head football coach Pat Fitzgerald was suspended for two weeks without pay.\nThe next day, the university student newspaper The Daily Northwestern published disturbing and graphic details of sexualized hazing rituals alleged by a former football player and whistleblower. Two days later, Schill reversed course and fired Fitzgerald.\n“Northwestern’s Board of Trustees fully supports President Schill’s decision to conduct this critical review and to engage Ms. Lynch to lead it,” said Peter Barris, chair of the board of trustees. “The board will cooperate fully with Ms. Lynch and her team and facilitate her work as needed.”\nAside from Lynch’s review, the university is also instituting a locker room monitor for the football team and mandatory in-person anti-hazing training for all teams and coaches. The first session of that training is for the football team and will be held this Thursday, Aug. 3, according to Tuesday’s news release.\nLawsuits\nThree more football players — Warren Miles Long, Ramon Diaz and an anonymous player (John Doe) — filed lawsuits against the university and its leadership this week. Long and John Doe are alleging “negligence, willful and wanton disregard for player safety and well-being and violation of Illinois’ Gender Violence Act,” according to a statement from Chicago personal injury law firm Levin & Perconti.\nAs of Wednesday afternoon, 10 former NU student-athletes – nine football players and one volleyball player represented by two separate legal teams – have filed lawsuits against the school. Four football players — Lloyd Yates, Simba Short, Diaz and Long — have put their names on their suits.\nThose filings detail frequent incidents where freshmen players allegedly were held down and dry humped by upperclassmen without their consent – a practice called “running.” One suit alleges a player was “run” while being held upside down and submerged into an ice bath, and he allegedly struggled to breathe after being pulled out.\nMultiple lawsuits claim that assistant football coach Matt MacPherson, who is still employed by Northwestern, witnessed hazing during the team’s annual training camp trips to Kenosha, Wisconsin.\nDiaz, who played from 2005 to 2008, said at a Wednesday press conference with his attorneys, Patrick Salvi and Parker Stinar, that he experienced racial discrimination during his time on the team. In one particular incident, he said other players shaved “05/05” into the back of his head while the rest of the team watched, standing for Cinco de Mayo and apparently mocking his Mexican heritage.\nHe said he attempted suicide in 2007 by overdosing on painkillers.\n“My experience playing football at Northwestern University haunts me to this day. I never will forget the mistreatment that I experienced for those four years,” Diaz said Wednesday.\nShort and Long also say they were each called an “eater and shitter” by other players and coaches during seasons when they were sidelined with injuries. The lawsuits say this is because their contributions to the team only consisted of taking up food and toilet space.\n“Long was elected by teammates to be part of the team leadership council. He approached coach Fitzgerald with complaints and concerns both involving football and personal matters during his time as a player,” a Monday press release from Levin & Perconti said. “He alleges Fitzgerald told him to blow it off and not make a big deal out of it. Fitzgerald’s response to Long’s concerns created a hostility and environment that deterred him from coming forward about additional issues like hazing, which was so entrenched and normalized in the Wildcat culture while he was a player.”\nIn a statement reacting to Lynch’s hiring on Tuesday, Levin & Perconti, along with co-counsel Ben Crump, said the move “raises more questions than answers” and called for the release of Hickey’s full original investigation into hazing, which Salvi and Stinar are also demanding.\n“We have to wonder if this is nothing more than an effort to counteract negative press,” Crump and Steve Levin said in their statement.\nGragg’s employment\nLast week, in an interview with The Daily Northwestern, Schill said “no conversation” about Gragg’s continued employment as athletic director is occurring and that he’s “supporting” Gragg moving forward.\nA day later, the Chicago Tribune unearthed a 2015 book written by Gragg called 40 Days of Direction: Life Lessons from the Talented Ten, in which he provided life advice for young men playing sports in college. In one chapter titled “Remember, She is Someone’s Daughter,” he commented on student-athletes accused of rape or sexual assault, saying “I’m sure that they would do anything to change the circumstances and would not be anywhere close to the young ladies involved. But unfortunately, life doesn’t happen like that.”\nIn another chapter, titled “Women, Our Greatest Distraction,” Gragg wrote that relationships with women “can be more than challenging,” and that “I do not think that I am overstating things or exaggerating when I say that a female is often a man’s greatest distraction.”\nAccording to reporting on former baseball coach Jim Foster published by Chicago sports radio station 670 The Score, Gragg allegedly “pawned off” Foster’s hiring to two boosters. When Foster was the head coach at the University of Rhode Island, a player died following a strength and conditioning workout in 2011, which resulted in a nearly $1.5 million wrongful death lawsuit.\nAfter an internal investigation into complaints about Foster’s behavior at Northwestern, a review for which no players were interviewed, Gragg decided to retain Foster as the head coach. Allegations against Foster included overt racism and sexism, including one incident where Foster allegedly barred a female manager from working on the field during practices because he feared players would be distracted by her.\nFoster also allegedly forced a player to run for more than two hours as a punishment — a workout similar to the one where the University of Rhode Island player died.\nAppearing at Big Ten Media Days for the conference’s football teams last week, Gragg told Big Ten Network that “no athletic director gets all of their hirings correct. I own that decision, and then I own the process after that,” where Foster was hired, investigated, retained in February and eventually “relieved of his duties” in July.\nA Northwestern spokesperson did not respond to questions from the RoundTable asking if the university is looking into Gragg’s previous actions as athletic director and his comments about women in the 2015 book.\nRyan Field\nAmid the burgeoning athletics scandal within the university, Northwestern officials now say they fully intend to forge ahead with the City of Evanston’s planned development and rezoning process to rebuild the Ryan Field stadium.\nGragg told ESPN reporter Adam Rittenberg last week that “we have a serious intent to make sure that that project moves forward” and “so does the [Ryan] family,” whose $480 million gift to Northwestern is providing the majority of funds for the $800 million stadium.\nThe first official hearing and vote on the stadium development itself and the university’s rezoning application to host concerts at the facility is tentatively scheduled for the city’s Land Use Commission on Wednesday, Aug. 23. There, the nine representatives on the commission will have an opportunity to hear comments from the public, ask Northwestern officials and the stadium architects about their proposals, and then discuss the project among themselves.\nOnce the commission votes, the rebuild and proposed zoning amendments will head to the Planning and Development Committee and then the full City Council for a final vote.\nSome groups, including more than 260 faculty members who signed a letter to university leadership last month and the Northwestern Accountability Alliance, are asking the university to pause the stadium plan until it successfully addresses issues in the athletic department. Others, like the Field of Opportunities organization, Evanston Own It, the local NAACP chapter and President Schill, have said the stadium and the scandal are not connected, and that the project needs to move forward because of the economic impact it could have on the city.\n“Northwestern plans to take part in the Aug. 23 Land Use Commission meeting,” Jon Yates, NU vice president for global marketing and communications, told the RoundTable this week.",
  "word_count": 1664,
  "scraped_at": "2026-02-14T13:26:43.983632"
}