{
  "article_id": "3a32b2caab42",
  "url": "https://www.dailymail.co.uk/news/article-12401223/Britain-come-standstill-Lionesses-waltz-past-Matildas-Millions-tune-Englands-women-bid-place-World-Cup-Final-against-hosts-Australia-Wednesday.html",
  "title": "Britain to come to a standstill to see if Lionesses can waltz past the Matildas ! Millions will tune in for England women as they bid for a place in the World Cup Final against hosts Australia on Wednesday",
  "date": "20230813T000000Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Britain to come to a standstill to see if Lionesses can waltz past the Matildas! Millions will tune in for England’s women as they bid for a place in the World Cup Final against hosts Australia on Wednesday\n- England roared to victory yesterday in a tough 2-1 match against Colombia\n- At 11am on Wednesday, they will take on Australia on their own turf in Sydney\nAt 11am on Wednesday, the nation will grind to a halt as England’s Lionesses play one of the biggest games of their lives against World Cup hosts Australia.\nEngland roared to victory yesterday in a tough 2-1 match against Colombia in their quarter-final, cheered on from afar by the Prince and Princess of Wales and David Beckham.\nAnd the prize awaiting them this week, if they can beat the hosts on their own turf in Sydney, is the big one? A place in the World Cup final against Sweden or Spain.\nMillions are expected to tune in on BBC One to cheer on the Lionesses as they aim to replicate last year’s historic success at the Euros. The time difference has meant that games are generally being screened early in the morning, but the mid-morning slot means pubs are anticipating big crowds. The 87,000 Aussies living in the UK are also expected to be out in force.\nGET IN THERE: Alessia Russo celebrates her winning goal\nAUSSIES RULE: Sam Kerr, left, celebrates the win over France yesterday\nWith the Matildas ranked No 10 in the world compared to England’s No 4, the Lionesses are favourites on paper to win the clash – although the home crowd at Stadium Australia will be doing their best to disrupt that expectation.\n‘We know if we play at our best, we are unstoppable,’ said England striker Lauren Hemp, who scored the first goal against Colombia.\nDespite numerous England fans in the stands waving banners with the words ‘It’s coming home’ emblazoned across them, it was a shaky start for the Lionesses.\nThe Coffee Girls from Colombia took a 1-0 lead after England goalkeeper ‘Magic’ Mary Earps was beaten by a lob from Leicy Santos shortly before half-time.\nHemp’s equaliser came seven minutes later in injury time at the end of the first half, when Colombia goalkeeper Catalina Perez fumbled the ball in the six-yard area.\nBut the team eventually came out on top after Alessia Russo scored the winner.\nAfter pouncing on a through ball from Georgia Stanway that ricocheted off a Colombia defender and into her path, Russo shot into the bottom corner of the goal, leaving keeper Perez no chance.\nAs Arsenal striker Russo, who had scored only once in the team’s four tournament matches ahead of yesterday’s quarter-final, said after the game: ‘This team always finds a way.’\nCoach Sarina Wiegman acknowledged that the Colombians were tricky, describing the game afterwards as a ‘very tough challenge’.\nShe said the second half was ‘hard’ against such a difficult team, but continued: ‘I am so proud of the team . . . if we had [been better] we could have finished up the game a little earlier.’\nAfter the victory, England players – including superstar striker Chloe Kelly and midfielder Alex Greenwood – could be seen consoling some of the devastated young Colombians and swapping shirts with them.\nBut the ecstatic team went on to celebrate on the pitch as pundit and former player Ian Wright, a champion of women’s football, embraced a joyful Hemp.\nHe later kissed her as the celebrations went into full swing.\nHe wasn’t the only celebrity to speak of their pride at the Lionesses’ win. The Prince and Princess of Wales, both big sports fans, took to Twitter to congratulate the team for their epic win, writing from their official account: ‘Bring on the semi-finals! A hard-fought win, well done @Lionesses.’\nWE CAN DO THIS: England’s Alessia Russo is swamped by jubilant teammates after scoring the winning goal in the 63rd minute yesterday\nWINNING FORMULA: A fan in the stands holds up a homemade sign\nHUGE HUG: England's Lauren Hemp is embraced by pundit Ian Wright after the Women's World Cup quarterfinal soccer match\nSOLACE: Linda Caicedo of Colombia is consoled by Alex Greenwood of England after the match\nEngland coach Sarina Wiegman celebrates the team's 2-1 victory against Colombia\nBeckham, who watched the match in the early hours of the morning while spending the summer in Miami, took to Instagram to tell of his joy.\nHe also posted a clapping hands emoji for Russo, who has become a close friend. Labour leader Sir Keir Starmer also joined in the celebratory party, writing on social media: ‘Great team effort from the @Lionesses. Resilient performance. All eyes on the semi-final now . . . It’s coming home.’\nThe Lionesses may take hope from the fact that Australia’s journey to the semi-final has been rather more stressful.\nTheir quarter-final match against France was still locked at nil-all after extra time. The Matildas eventually won a heart-stopping penalty shootout 7-6.\nOne person who will be desperately hoping that England beat Australia in the semi-final is Lauren James, who was sent off in the game against Nigeria last week for stamping on a rival player.\nShe was banned for two games, which means that she will be eligible to play against Sweden or Spain if England reach the final.\nMost watched News videos\n- Extraordinary moment mass brawl breaks out between Brits on flight\n- Finance expert's TV interview interrupted by adorable granddaughter\n- Moment driver veers to target e-bike riders before killing teen\n- Moment Swiss bar fire owners collapse after being confronted\n- Chilling police interview of ISIS fanatic plotting UK attack\n- Astonishing moment a street is swallowed by a sinkhole\n- Israeli hostage reveals how she survived being tortured\n- Deepak Chopra confronted over his relationship to Epstein\n- Food vlogger dies after 'eating toxic devil crab'\n- Spy cam shows woman on her knees next to Jeffrey Epstein\n- New video shows man with backpack similar to Guthrie kidnapper\n- Toddler opens car door in traffic and sends biker flying",
  "word_count": 1020,
  "scraped_at": "2026-02-14T13:26:23.101608"
}