{
  "article_id": "3a323aa41d19",
  "url": "https://www.powderbulksolids.com/career-development/mccormick-announces-2024-unsung-hero-scholarship-winners",
  "title": "McCormick Announces 2024 Unsung Hero Scholarship Winners",
  "date": "20240515T153000Z",
  "domain": "powderbulksolids.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "McCormick Announces 2024 Unsung Hero Scholarship Winners\nThe Unsung Heroes program originated in 1940.\nMcCormick & Co. has named Alivia White from Patapsco High School and Akintomiwa David Are from Owings Mills High School as the 91st and 92nd recipients of its Charles Perry McCormick scholarships, worth $40,000 over four years.\nThe in-person event held yesterday evening at the M&T Bank Exchange, located in downtown Baltimore's France-Merrick Performing Arts Center recognized White and Are from nearly 99 student-athletes honored as Unsung Heroes for their commitment to unselfish team play.\nDuring the ceremony, keynote speaker Kyle Hamilton, Safety for NFL's Baltimore Ravens, engaged in an on-stage question-and-answer conversation with student-athletes in attendance. Hamilton spoke about how he was once an Unsung Hero as well. In high school, he recounted being under six feet, which was undersized for his position in football and led him to contemplate quitting the team. Later, after growing several inches, he was offered a football scholarship to play at the University of Notre Dame, which led him back to the game he loved.\nAlivia White, a member of the women's basketball team at Patapsco High School, worked hard to lead the team in rebounds and assists, which she knew would affect her team's overall success, despite always being told that she was an undersized Center. When a fellow student and member of the school's lacrosse team was being bullied, White took her fellow student under her wing and looked out for her on and off the field, a sport she wasn't involved in. She is the true definition of an Unsung Hero.\nAkintomiwa David Are, a member of the men's football team at Owings Mills High School, regularly volunteers to tutor freshmen students to help ensure their eligibility and good grades, despite adapting to a new country just a few years back. He also spent an entire offseason practicing at the Center position, which he preferred, but selflessly volunteered to switch positions at the beginning of the season when a transfer proved to be a better fit, all to do what was in the team's best interest. He is an Unsung Hero who exemplifies unselfish play.\nFour additional students were recognized with additional scholarships at this year's Unsung Heroes event: Jadah Reid from Western High School and Bernard Bolden IV from Lansdowne High School were awarded $7,500 scholarships, while Brooke Frederick from Mount de Sales Academy and Maurice Ghee from Loyola Blakefield High School both received $5,000 scholarships.\nHere is the full list of this year's McCormick Unsung Heroes nominees.\nThe Unsung Heroes program recognizes student-athletes and honors those who substantially contribute to the success of their school without receiving acclaim. Originally established in 1940 by former McCormick & Co. Chairman Charles P. McCormick Sr., the program is reflective of McCormick & Co.'s core belief in the Power of People.",
  "word_count": 473,
  "scraped_at": "2026-02-14T13:13:33.691754"
}