{
  "article_id": "3a562902d259",
  "url": "https://www.azcentral.com/story/news/politics/2023/04/15/religion-workplace-sabbath-supreme-court/11548832002/",
  "title": "Working weekends : Supreme Court weighs religious requests for time off",
  "date": "20230415T101500Z",
  "domain": "azcentral.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "'Wolf in sheep's clothing'? How a USPS worker's fight over Sunday shifts could change your workplace.\nThe justices will hear arguments Tuesday in what one observer described as the \"most wide-reaching religious liberty case in roughly half a century.\"\nWASHINGTON – Gerald Groff wanted to spend his Sundays at church. His employer, the U.S. Postal Service, wanted him delivering packages.\nThat simple dispute between an employee and his managers sparked one of the most significant religious cases to reach the Supreme Court in years – with the potential to shift the balance of power between employees and employers over weekend schedules, dress codes and how workers conduct themselves around colleagues.\nThe appeal raises a basic question with potentially sweeping consequences: How far must large employers go to accommodate the religious needs of their workers? For Groff, an Evangelical Christian who told his boss in 2017 that he wouldn’t cover Sunday shifts because of his faith, the answer became a personal and painful one.\n\"I lived under a cloud of thinking any day I could report to work…and then be told that I was terminated,\" said Groff, a 45-year-old Pennsylvanian who resigned from the Postal Service in 2019. \"Two years of just pretty much every day was tough.\"\nFor nearly five decades, similar disputes have been guided by a 1977 Supreme Court decision that allows employers to deny religious requests if they present more than a trivial cost. That standard, Groff's attorneys say, means companies could decline to alter schedules to account for a sabbath or allow an employee's religious dress in too many circumstances.\nIn practice, the government argues, the standard is often read by courts to require employers to accommodate such requests.\nGroff is asking the Supreme Court to toss that standard. But his critics fear what the court's conservative majority might come up with as a replacement. And they're concerned that new standard could lead to workplace discrimination.\n\"There’s a huge can of worms that this opens up,\" said Rachel Laser, president of Americans United for Separation of Church and State. \"Letting people shift the cost of exercising their religion onto their co-workers in a way that harms their co-workers is the opposite of equality.\"\nThe court will hear arguments in Groff v. DeJoy on Tuesday.\nHow Amazon packages delivered a sweeping religious dispute\nGroff started at the Postal Service after years of missionary work in Africa and Asia. He wanted a career that would allow him to keep his sabbath, and since mail isn’t delivered on Sundays, the job seemed to be a safe bet. Everything changed when the USPS signed a contract with Amazon in 2013 to deliver packages on weekends.\nHis supervisors initially exempted Groff from working Sundays as long as he covered other shifts. But their attempts to find volunteers for those days didn’t always work, and by 2018, Groff had missed 24 Sunday shifts. Disciplinary measures began mounting.\nGroff said he didn’t hear grumbling from colleagues.\n\"If they had to work a Sunday for me, I could remind them that I may have worked Thanksgiving for them,\" said Groff, who is represented by First Liberty Institute, a group that has brought several successful religious claims to the nation's highest court.\nStill, at least one industry group and several unions opposing Groff worry about the fallout if more employees become entitled to time off for religious holidays and sabbaths. A new standard, some fear, could make a mess of seniority systems that have been negotiated to deal with shifts few want to work.\n\"Most pilots would prefer not to fly a trans-continental redeye on Christmas Eve,\" Airlines for America, a trade group, told the court in a brief last month. Seniority systems, the group said, ensure that \"pilots are assigned to all the flights that need to be flown.\"\nGroff's case could affect more than a company’s scheduling, experts say. A win for Groff, for instance, might help a teacher who, based on religious beliefs, declines to use transgender pronouns in the classroom. It could give a boost to pharmacists who decline to fill birth control prescriptions based on religion.\n\"This case is a wolf in sheep's clothing,\" Laser said.\nJames Phillips, a law professor at Chapman University, said the case has the potential to be the \"most wide-reaching religious liberty case in roughly half a century.\" But Phillips pushed back on the notion that a win for Groff would dramatically increase the number or types of claims.\nResetting the standard\nGroff has at least two things working in his favor at the Supreme Court.\nThe first is that the standard the justices set in the 1977 decision is the kind of court-created policy widely disfavored today. Federal law requires employers to honor an employee's religious request as long as it doesn’t represent a \"undue hardship\" on their business. The Supreme Court defined that term in 1977 as anything having more than a \"de minimis,\" or trivial cost, for the business.\nBut that definition isn't in the law, a point even some of Groff's critics acknowledge.\nGroff’s argument, meanwhile, is likely to resonate with the Supreme Court's conservative majority, which has handed religious interests a steady series of recent wins.\nLast year, the court sided with a high school football coach who wanted to pray on the 50-yard line after games. In 2021, it allowed a Catholic foster care agency to turn away same-sex couples as prospective parents. In 2019, the court ruled that a Latin cross on government land outside Washington, D.C., did not have to be moved or altered in the name of church-state separation.\nFor religious groups, the Groff case is the latest opportunity to right what they see as a decades-old wrong.\n\"The employer has to show that it's going to hurt in some way\" to honor an employee's religious request, said Mark Rienzi, president of Becket, which has represented religious clients at the Supreme Court. \"It's not enough to just say, 'I'd rather not.'\"",
  "word_count": 995,
  "scraped_at": "2026-02-14T13:36:04.619247"
}