{
  "article_id": "3a81b17d84c0",
  "url": "https://keyt.com/news/2024/07/30/san-diego-wave-president-sues-former-employee-for-defamation-for-alleging-abusive-behavior/",
  "title": "San Diego Wave president sues former employee for defamation for alleging abusive behavior",
  "date": "20240731T004500Z",
  "domain": "keyt.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "San Diego Wave president sues former employee for defamation for alleging abusive behavior\nSAN DIEGO (AP) — San Diego Wave President Jill Ellis sued former team employee Brittany Alvarado for defamation following allegations of a poor work environment.\nAlvarado, a former video and creative manager, posted on X and Instagram on July 3 that “the treatment we endured under club President Jill Ellis has been nothing short of life-altering and devastating to our mental health.”\nAlvarado accused Ellis of a “narcissistic personal agenda, fostering an environment where abusive behaviors among her subordinates are allowed to flourish.” She called on the National Women’s Soccer League to remove Ellis from the team and the league.\nEllis issued a statement the next day calling the allegations “false” and “personally damaging.”\nIn a lawsuit filed Monday in California Superior Court in San Diego, Ellis claimed defamation and intentional interference with contractual relations.\n“As a direct and proximate result of the publication of the false and defamatory statements, plaintiff has suffered general and special economic and emotional injury, damage, loss and harm, damage to reputation, anxiety, embarrassment, humiliation, shame and severe emotional distress,” the suit said.\nEllis asked for an injunction against Alvarado preventing her from publishing defamatory statements against her.\n“Our client, a courageous former employee, has stepped forward to exercise her First Amendment rights, shining a light on the pervasive gender discrimination and emotional abuse within the organization,” Alvarado’s attorney, Casey Hultin, said in a statement. “Her voice, echoing the experiences of many, calls for immediate and substantial change to protect both staff and athletes from further harm. This is not just a plea for justice; it’s a demand for a safe, respectful, and equitable environment for all.”\nThe suit says Alvarado was hired on March 20, 2023. It says she filed a complaint with the league on Feb. 5 this year and the NWSL finished its investigation on April 26, finding no violations of law or league policy. The suit says Alvarado resigned on June 7.\nEllis, 57, coached the U.S. women’s national team from 2014-19. She led the team to World Cup titles in 2015 and ’19, earning Best FIFA Women’s Coach for both years.\n___\nAP soccer: https://apnews.com/hub/soccer",
  "word_count": 368,
  "scraped_at": "2026-02-14T12:18:03.027068"
}