{
  "article_id": "3ac81d59fbd8",
  "url": "https://www.brandonsun.com/entertainment/2025/01/16/from-doing-laundry-at-arsenal-to-becoming-canada-coach-casey-stoney-paid-her-dues",
  "title": "From doing laundry at Arsenal to becoming Canada coach , Casey Stoney paid her dues – Brandon Sun",
  "date": "20250116T220000Z",
  "domain": "brandonsun.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "From doing laundry at Arsenal to becoming Canada coach, Casey Stoney paid her dues\nAdvertisement\nFrom doing the laundry at Arsenal to having to use her vacation days to play for England at the 2007 World Cup while coaching at the David Beckham Academy, Casey Stoney has paid her dues.\nRead this article for free:\nor\nAlready have an account? Log in here »\nWe need your support!\nLocal journalism needs your support!\nAs we navigate through unprecedented times, our journalists are working harder than ever to bring you the latest local updates to keep you safe and informed.\nNow, more than ever, we need your support.\nStarting at $15.99 plus taxes every four weeks you can access your Brandon Sun online and full access to all content as it appears on our website.\nSubscribe Nowor call circulation directly at (204) 727-0527.\nYour pledge helps to ensure we provide the news that matters most to your community!\nTo continue reading, please subscribe:\nAdd Brandon Sun access to your Free Press subscription for only an additional\n$1 for the first 4 weeks*\n*Your next subscription payment will increase by $1.00 and you will be charged $20.00 plus GST for four weeks. After four weeks, your payment will increase to $24.00 plus GST every four weeks.\nFrom doing the laundry at Arsenal to having to use her vacation days to play for England at the 2007 World Cup while coaching at the David Beckham Academy, Casey Stoney has paid her dues.\nRead unlimited articles for free today:\nor\nAlready have an account? Log in here »\nHey there, time traveller!\nThis article was published 16/01/2025 (394 days ago), so information in it may no longer be current.\nFrom doing the laundry at Arsenal to having to use her vacation days to play for England at the 2007 World Cup while coaching at the David Beckham Academy, Casey Stoney has paid her dues.\nBut along the way, the new coach of the sixth-ranked Canadian women’s soccer team found her purpose.\n“I think we all have a responsibility to the game,” the 42-year-old former England captain said in an interview. “I’ve got two little girls and a little boy and I’ve always said when I was playing I wanted to leave the shirt in a better place than when I took it. And now I’m coaching I want to leave the game in a better place and all I’ve ever wanted is my little girls to have the same opportunity as my little boy.”\nIt’s a sentiment long espoused by former Canada captain Christine Sinclair. “I just hope to leave the game in a better place,” she said on the eve of her retirement from the international game in December 2023.\nAfter helping build cultures as the inaugural coach of both the Manchester United women and the NWSL’s San Diego Wave, Casey inherits a Canadian team that has forged a welcoming culture of its own over the years with the likes of Sinclair, Karina LeBlanc, Diana Matheson, Sophie Schmidt, Desiree Scott and others leading the way.\n“One of the real reasons I was really interested in the job was how much I had heard about the positive culture — the humility of the people, the hard work,” said Stoney, who coached Canadian No. 1 goalkeeper Kailen Sheridan at San Diego.\nAware of what the Canadian players went through last year in the wake of the Olympic drone-spying scandal that cost Bev Priestman her job as coach, Stoney says she will support that culture “and just try and give the players trust back a little bit and move forward.”\nStoney herself has come a long way.\nAfter her parents divorced when she was six, Stoney and her brother lived with their mother, who had three jobs to make ends meet.\nStoney threw herself into football and was good at it. When the family moved to London, she played for a boys’ team and was named the players’ player of the season.\nIn 1994, at age 12, she joined Chelsea. She had to pay to play there, three pounds (now $5.30) on a training night and five pounds ($8.80) on match day.\nIn 1999, she moved to Arsenal where she worked part-time in the laundry “washing the men’s kit” to help pay the bills while playing soccer.\n“I was part of a generation where we didn’t earn any money out of the game. So you always had to have a job,” she said.\n“But I’m really pleased I went through that era,” she added. “Because I think I’ve got the work ethic I’ve got now because I had to get up at 4:30 in the morning and train before I did a full day’s work or do a full day’s work and then go training. So for me, coming into management, it’s hard work, it’s a hard job. But it’s nothing I haven’t been doing for so many years.”\nStoney reckons she has coached for the last 25 years including the under-10 and under-12- sides when she was a teenager at Arsenal.\n“I’ve earned my stripes, as they say,” she said.\nA defender, Stoney went on to play for Chelsea, Lincoln, Arsenal again and Liverpool. On the international front, she won 130 caps for England before retiring in 2018 and joining the staff of then-England women’s manager Phil Neville.\nThere was good and bad along the way.\nAt the 2005 UEFA Women’s Championship, she sat on the bench and considered retiring.\nWhile playing for Charlton Ladies, she won the FA Cup and the Premier League Cup only to see the team fold in 2007 in a cost-cutting move after the men’s team were relegated from the Premier League.\nAt Chelsea, defender John Terry paid for the women’s tracksuits after the club would only provide “hand-me-downs from one of the academy teams.”\nShe kept at soccer but thought long and hard about the need for a steady income. Two days before the 2009 Euros final against Germany, she got a call to say she had been accepted as a firefighter.\nBut her father urged her to keep playing, pointing out work could wait but football couldn’t. And a cousin, who was a firefighter, warned her that getting time off to play might depend on just how much her station manager liked women’s football.\nSo she kept playing.\nStoney learned she had lost the English captaincy when she heard it on TV. As a result, as a coach, she has canvassed her players on exactly how they like to learn about whether they are in the starting lineup for games.\nStoney is not about to ask her players to do something she wouldn’t do herself. At Manchester United, as part of a team-building exercise with her players to face their fears, she had someone bring in “huge snakes, giant-sized cockroaches and tarantulas.”\n“I’m really not a fan of spiders at all,” she said. “So showing vulnerability in front of my players and holding a tarantula was terrifying, but at the same time they got to see a human side of me and I got to see a human side of them.”\nShe has faced other difficulties as a manager, not of her own making.\nShe quit Manchester United in 2021 after leading the team to promotion to the top tier in the first year and then consecutive fourth-place finishes. But she had had enough of a lack of proper training facilities and broken promises.\nAnd she was fired by San Diego last June while attending a funeral in England. That meant the immediate cancellation of her work visa, uprooting her family. Stoney and partner Megan Harris, a former Lincoln teammate, have 10-year-old twins (a boy and a girl) and a seven-year-old son.\n“It effectively made us homeless overnight as a family, stuck in the U.K. without a home,” she said. “Once you’ve been through that to be honest, I think you can pretty much face everything.”\nThe experience, while horrible, did not extinguish her desire to coach.\n“What it has done is make sure that I am in an organization that’s led with people with principles and values … I feel very strongly that I’m in the position I should be in right now.\n“And everything happens for a reason.”\nWorking as consultant for another team allowed Stoney to regain her U.S. visa and the family returned to their San Diego home four months later. Stoney plans to keep the family there for the time being, so the kids can continue in school with their friends.\nThis report by The Canadian Press was first published Jan. 16, 2025",
  "word_count": 1440,
  "scraped_at": "2026-02-14T12:11:13.998850"
}