{
  "article_id": "3af48231bbeb",
  "url": "https://www.denverpost.com/2026/02/04/avalanche-heated-rivalry-pride-kelly/",
  "title": "Avalanche Pride Night turns into  Heated Rivalry  celebration",
  "date": "20260205T010000Z",
  "domain": "denverpost.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Mary Myers is a huge football fan and loves the Denver Broncos.\nAs she put it though, being a women and a fan in male-dominated sports is not always welcoming. Myers and one of her best friends, Andrea Slora, are not big hockey fans. But like many other people, they are very much fans of “Heated Rivalry,” the Canadian television show that streamed on HBOMax in the United States and has become a pop culture phenomenon.\nMyers, who is bisexual, read the “Game Changers” series of books by Canadian author Rachel Reid, on which the show is based, and then was tuned in when the show premiered on Thanksgiving. She recommended it to Slora, who is queer, and both “have been consumed by it.” So much so that Myers was at Ball Arena on Monday night, wearing a sweatshirt featuring the two main characters, Shane Hollander and Ilya Rozanov, with Slora, sporting a Boston Raiders shirt with No. 81 and Rozanov on the back.\nShow’s popularity drives ticket sales\nThey weren’t alone. It was Pride Night for the Colorado Avalanche, and on the concourses, it was also a celebration of the show that has brought hockey to a whole new audience. Just in the span of a five-minute interview, six people came up to Myers and Slora to compliment them on the shirts they were wearing.\n“One of my close coworkers is a huge Avs fan and she’s also queer,” Slora said. “So I was like, ‘OK, I have a spot here.’ Also, just seeing how into it she is, like she will watch the games when we’re at work and get so into it.”\nThe Avalanche has had a Pride Night on the promotional schedule for nearly a decade, and the organization was one of the first sports teams to participate in the Denver Pride Parade. The team did not incorporate specific “Heated Rivalry” themes into its plans for Monday evening, but it was easily its most successful Pride Night.\nSales on the Pride Night ticket packages were up 47% from last year, which was previously the best-selling night. A portion of the proceeds will go to You Can Play, a campaign that promotes inclusion and hopes to eradicate homophobia in sports.\nThere were some allusions to the show — the phrase “Heated Rivalry” was on the scoreboard before the game with the Avalanche and Detroit Red Wings logos, and “All The Things She Said,” which has become synonymous with the show, also played in the arena shortly before puck drop.\nThere’s also little question that the popularity of the show and the books helped drive the record sales.\n“Heated Rivalry has been a conversation topic in the office,” Avs marketing director Megan Boyle said. “It’s pretty cool to see how many people that have never even watched hockey or cared too much about hockey have started to take interest in hockey and the Avalanche.\n“I think it just shows that community and a sense of belonging is really important. That’s one of the biggest reasons why we continue to do Pride Night is to be part of our community.”\nSupport from Avs players\nTwo Avalanche players, Parker Kelly and Scott Wedgewood, wore Pride tape on their sticks for warmups Monday night.\nIt was a choice that isn’t lost on many fans. The NHL’s relationship with the LGBTQ+ community has earned plenty of criticism in recent years. Teams wore Pride jerseys for warmups and players used the rainbow-colored tape for several years. Then, during the 2022-23 season, a handful of players refused to wear them, citing their religious beliefs.\nThe league made a blanket decision to forbid teams from wearing any specialty jerseys — Pride, Military Appreciation, Hockey Fights Cancer, etc. — as a reaction to protect players from future derision. Since then, fewer players have worn the tape on their sticks.\n“There were some people in my life that I wanted to support,” Kelly said. “It’s a small gesture, but maybe if there was someone in the stands that felt a little more welcome or maybe lightened their spirit a little bit — just wanted to make sure everyone knows we’re on the same team and I’m supporting some friends and family.”\nMany NHL players have spoken about the show and its potential impact on the sport, but few have admitted to watching it. Kelly watched all six episodes after his wife recommended it.\n“It’s a good storyline,” Kelly said. “I’m sure there are athletes out there who haven’t come out yet and it’s probably a bit scary. The show is definitely popping off with the rating and everything, but yeah, it just kind of gives you a perspective into what could possibly be going on with an athlete that you don’t even know could be going through that.”\n‘This is how she got us to go to a game’\nSyndey Ivey, the owner of The Spicy Librarian, a romance bookshop in RiNo, said her store did not carry Reid’s books before the show premiered on HBO Max.\nNow? There was a “Heated Rivalry”-themed advertisement outside the store on Monday afternoon, and a huge display featuring all of Reid’s “Game Changers” series and several other hockey romance books just a few steps past the front door.\nShe is struggling to keep the books in stock. The demand for them is “constant … like, every day.” Ivey is also not really into hockey or sports in general.\n“One of my best friends, she loves hockey and has been trying to get us to go to an Avs game forever,” Ivey said. “This is how she got us to go to a game.\n“This is queer romance, but it is truly queer joy. We don’t get to see that in a lot of queer stories. Some have happy endings, but it usually comes with severe trauma and tragedy to begin with. They go through their trials and stuff like that, but this is queer joy from start to finish and everybody gets to celebrate that.”\nBen Rieter’s husband, Andrew, read the “Game Changers” series in 2022. He bought tickets to an Avs game as a birthday present for Ben, and now they are partial season-ticket holders.\nThey were at Ball Arena on Monday night sporting Hollander and Rozanov jerseys, amazed by the number of people who were also decked out in “Heated Rivalry”-themed gear.\n“It’s like everyone is finding your secret,” Reiter said, as fans of the books before the show existed. “We ordered these jerseys on TikTok. We did custom-order Avs jerseys with their last names, but they didn’t come in time for today.”\nThe show was originally developed by Crave in Canada. Its creator, Jacob Tierney, is also the co-creator of “Letterkenney” and “Shoresy,” two shows that include hockey and have more of a niche audience in the United States. “Heated Rivalry” has reached exponentially new levels of popularity, leading to hard questions and debate about the NHL’s relationship with the queer community.\n“I think part of our culture is that community is very important to us,” Boyle said. “We don’t want to just do the bare minimum. We are always looking for ways to grow and make more of an impact where we can.”\nKinsey Brown and Breagh Kristen were both sporting a custom-made version of the “Canada fleece” that Hollander wears during the 2014 Winter Olympics in Sochi, Russia, in the show at Ball Arena on Monday night. Canada’s Prime Minister, Mark Carney, wore the fleece jacket while taking pictures with Hudson Williams, the actor who portrays Hollander, last week.\nWilliams and Connor Storrie, who portrays Rozanov, were also Olympic torch bearers last week. Storrie is going to host the first episode of “Saturday Night Live” after the 2026 Winter Olympics in Milan conclude.\n“It has definitely gotten more attention for the sport, but the bigger issue is it’s still a conservative sport and there’s not a lot of inclusion,” Kristen said. “I feel like the more eyes you have on something, the more difference we can make and I think that’s super important.”\nBrown had a friend recommend the books, and once the show was released, it “has consumed my every thought since.” She and Kristen were at Pride Night because they wanted to support the community and expected to see other fans of Heated Rivalry and the “Game Changers” books as well.\nThey were excited for the celebration, but both are also longtime Avalanche fans and the large number of Red Wings fans in attendance added an interesting wrinkle.\nIt became a heated rivalry kind of night, both on the ice and in the stands.\n“(Expletive) Detroit,” Kristen said. “And you can quote me on that.”\nWant more Avalanche news? Sign up for the Avalanche Insider to get all our NHL analysis.",
  "word_count": 1468,
  "scraped_at": "2026-02-14T14:21:46.144793"
}