{
  "article_id": "3b1049b58fdf",
  "url": "https://www.adgully.com/publicis-conseil-named-1-agency-apple-1-brand-in-warc-creative-100-157187.html",
  "title": "Publicis Conseil Named # 1 Agency , Apple # 1 Brand in WARC Creative 100",
  "date": "20250311T051500Z",
  "domain": "adgully.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "|\nThe WARC Creative 100, the ultimate independent global benchmark of the world’s most awarded campaigns and companies for creativity, is now released.\nCompiled by WARC Creative, helping companies deliver creative marketing that works, the annual Creative 100 Ranking brings together the results of the most important global and regional creative awards of 2024. The shows tracked are determined in consultation with the WARC Rankings Advisory Board and by a yearly global panel survey.\nAnna Hamill, Senior Editor, WARC Creative, said: “The WARC Creative 100 are annual worldwide league tables of the most creatively awarded campaigns and companies. They are a global benchmark for the industry to reflect on and a showcase to be inspired by the best of the best work produced, who’s leading the industry, and how creativity is a driver of differentiation and change.”\nThree themes stand out from this year’s Creative 100:\n- The use of sport to connect: Of the top ten campaigns, five focused on sport, including campaigns for Orange, Coors Light and Xbox. Sports can be a very powerful way of increasing both brand awareness and brand participation through large audience events, especially in a fragmented media market where mass reach is more difficult.\n- Solving inclusivity issues: The use of emotive stories and proactive problem-solving by brands including Mastercard, Renault and Michelob ULTRA, underlines a compelling direction for DEI, beyond simply representation in advertising.\n- The power of online community: Meeting people in their own online spaces with calls to action indicates the power of specific communities for brands including the NHS, DoorDash and Calvin Klein.\n#1 Campaign for creativity: ‘WoMen’s Football’ by Marcel Paris for Orange\nThe most creatively celebrated campaign of 2024 was ‘WoMen’s Football’ by Marcel Paris for French multinational telecommunications company, Orange. The campaign used video effects in an innovative and striking way to show that women’s football is just as exciting as men’s football. The ad was viewed over 15 million times and was shared on social media by the French Minister of Sports and World-Cup-winning athletes.\nPascal Nessim, CEO, Gaëtan Du Peloux, CEO and Chief Creative Officer, and Youri Guerassimov, CEO and Chief Creative Officer, of Marcel Paris, said: “Having a campaign ranked No. 1 in 2024 by WARC is something you can never truly prepare for, even as competitors, we've always secretly dreamed of it. And when you realize your campaign has just won the World Cup of advertising, one thought comes to mind: Damn, we did it!\n“Then, you reflect on everything it took to get here: the energy, the passion, the laughter, the late nights, the blood, the sweat, the tears, and the setbacks. But most of all, the unwavering commitment to crafting every piece of work to the highest standard.”\nIn second place is ‘Coors Lights Out’ by Rethink Toronto for beer brand Coors Light featuring baseball superstar Shohei Ohtani who broke a stadium sign during play whilst an ad was being screened for the brand. In third, ‘Michael CeraVe’ by Ogilvy New York for skincare brand CeraVe, developed a humour-led campaign ahead of Super Bowl LVIII, earning nine billion views before the game’s actual airing.\n#1 Agency for creativity: Publicis Conseil, Paris\n#1 Independent Agency for creativity: Rethink, Toronto\nOver the last three years, Publicis Conseil, Paris, has gradually increased their ranking, from 25th to 4th, and to 1st place this year. Their work with Renault, Orange, and Solar Impulse Foundation helped to steer them to the top position this year.\nMarco Venturelli, Global Chief Creative Officer/CEO Leo and Chief Creative Officer, Publicis Conseil, said: “After being named Agency of the Year at Cannes Lions in June, we are proud to be the #1 agency in the WARC Creative 100 as we approach our 100th anniversary. This is a testament to our creative ambition with legacy clients and our commitment to progressive work. Congrats to all our talents and clients!”\nLe Pub, Milan, rises to second place, up from fourth last year. VML New York is in third, after climbing 19 places from 22nd in 2024.\nRethink Toronto takes the top spot of the independent agencies, and is ranked fifth overall, with three campaigns in the top 100.\nMike Dubrick, Partner, Chief Creative Officer, Rethink Toronto, said: “We’re thrilled for the agency, its people, and our amazing partners and our clients. We tell each and every one of them that our goal is to unlock the best work of their careers. So, it’s amazing to be able to validate that by sitting atop the WARC report for the second year in a row. This list is a culmination of the best, and hardest to win shows out there - so to be able to lead this list with so many other amazing agencies is something we are grateful for and something we don’t take lightly.”\n#1 Network for creativity: Ogilvy\n#1 Independent network for creativity: Serviceplan\nOgilvy was the most awarded network for the fifth year in a row, with six offices from around the world contributing to its ranking: Ogilvy London, New York, Mumbai and Toronto and DAVID Madrid and Bogota. The network has 12 of the top 100 campaigns this year.\nLiz Taylor, Global Chief Creative Officer, Ogilvy, said: “Five years, half a decade, on top of the Creative 100. What a powerful testament to the extraordinary talent we have around the world. And to our brave clients who believe in creativity as a force multiplier for their businesses - its power to disrupt, to connect, and propel their brands to new heights.”\nVML moves up to claim second position with five agencies in the top 50. Publicis Worldwide moves up from seventh to third place, also with five agencies ranked.\nServiceplan tops the independent networks category and its Munich agency claims seventh position overall.\nAlex Schill, Global Chief Creative Officer & Partner, Serviceplan Group, said: “Being ranked the #1 independent network in the WARC Creative 100 is a testament to ÜberCreativity. This achievement proves that innovation thrives in collaboration and independence—where there’s freedom to explore, and challenge boundaries. We are beyond proud to be among the industry’s most creative forces, and this recognition only fuels our commitment to create ideas that truly make an impact.”\n#1 Holding Company for creativity: WPP\nWPP has maintained its position at the top of the holding company ranking for a third consecutive year with three networks in the top 50: Ogilvy and VML ranked first and second respectively, and AKQA in 11th.\nRob Reilly, Global Chief Creative Officer, WPP, says: “Topping the WARC Creative 100 for the third year running is a testament to the relentless creativity and dedication of our teams worldwide. Seeing Ogilvy named Network of the Year again, with VML securing the second spot, is a powerful demonstration of our creative strength. Thank you to our incredibly talented agency teams and, most importantly, to our brave clients who trust us to bring their visions to life. We couldn't do it without them. It's humbling and inspiring.”\n#1 Brand for creativity: Apple\nApple has gradually climbed the rankings over the last few years, going from 18th in 2022 to first place this year. Apple campaigns from across the world featured in many of the major award shows. Two of its campaigns, ‘Fuzzy Feelings’ and ‘Shot on iPhone - Little Garlic’ are ranked in the top 100.\nTor Myhren, VP Marketing Communications, Apple, said: “It’s an honor to be at the top of the WARC Creative 100 because Apple is a company that has always believed in the power of creativity. We put the product at the center of our marketing and try to tell compelling stories around it.”\nHeineken is in second place, up from fifth, and Heinz is in third. Renault, Mastercard, and Netflix have significantly improved their brand position versus last year. Coca-Cola, absent since 2022 enters the top 10 brands for the first time.\n#1 Advertiser for creativity: Anheuser-Busch InBev\nFor the fourth year running, AB InBev tops the advertiser ranking. The alcoholic drinks brand owner has three multi-awarded campaigns for creativity in the top 100, and four brands - Michelob ULTRA, Cerveza Poker, Corona, Stella Artois - in the top 50 ranking.\nMarcel Marcondes, Chief Marketing Officer, AB InBev, said: “It’s an honor for AB InBev to again be ranked the #1 Advertiser in the WARC Creative 100. This recognition reflects how we use creativity to solve business and consumer problems to drive growth. Our purpose as a company is to create a future with more cheers so we will continue using creativity as a way to connect our brands to moments of celebration around the world.”\nUnilever retains its second place for the third consecutive year running with two brands - Dove and Magnum - ranked in the top 50. Kraft Heinz Company is third. Last in the rankings in 2021, The Coca-Cola Company has entered again this year in eighth, and Renault and Microsoft have moved into the top ten.\n#1 Country for creativity: USA\nThe USA retains its first place as the most awarded country for creativity – a rank it has held since 2006 (when the Creative 100 was the Gunn Report). 30 of the top 100 campaigns are from the USA, up from 21 campaigns last year.\nThe UK climbs back up to second place with France coming in third. Argentina has consistently improved over the last few years, rising from 18th in 2021 to seventh this year.\nThe top ten most highly ranked campaigns and companies in the WARC Rankings Creative 100 2025 are:\n|",
  "word_count": 1595,
  "scraped_at": "2026-02-14T12:35:04.153438"
}