{
  "article_id": "3b2f6b625f4d",
  "url": "https://www.the42.ie/theyre-great-guys-damien-duff-backs-shelbournes-turkish-takeover-6089916-Jun2023/",
  "title": "  It the biggest job in the world and nothing has changed  ",
  "date": "20230610T133000Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "DAMIEN DUFF says that Friday’s major announcement of businessman Acun Ilicali becoming the club’s majority shareholder simply makes Shelbourne FC all the more exciting than it already is.\nTurkish businessman Ilicali, who becomes the club’s new chairman, is set to bring major investment to the Drumcondra club across the board from the men’s and women’s teams through to the club’s academy and facilities.\nIlicali, who also wholly owns English Championship club Hull City, says his ambition is to make Shelbourne Ireland’s most successful football club.\n“I believe we are doing a press conference in a week or two, so we’ll speak more then,” said manager Duff when asked about the takeover following Friday night’s 1-1 draw with Sligo Rovers at Tolka Park.\n“I always say this when I’m trying to sign players anyway that I absolutely believe that Shelbourne and Tolka Park has been a great place to be for the past 18 months.\n“This takeover just makes it more exciting. It’s very simple for me.”\nDuff has spoken to and been impressed by Ilicali and Tan Kesler, Hull City vice chairman.\n“I met him a while back and the chief executive (vice-chairman), Tan, as well. They’re great guys with high ambitions for the club.”\nAnd Duff insists his role won’t change given the expected synergy with Hull City.\n“No, they’ve been amazing, they’ve been great guys to speak to,” said Duff who confirmed that the new owners had already agreed a contract extension for a player.\n“I think it was officially signed off on early this week. I went to them, an existing player here, a big player for us, needed to get him tied down, and it’s done, it will be announced on Monday.\n“It’s a great signing, a great signal for times ahead. The player? You don’t need to know yet.”\nAnd with new signings to come in next month’s transfer window?\n“I hope so, that’s what we did last year,“ said Duff.\n“I always call them ‘a Matty Smith signing’. Matty Smith lifted the whole club last year.\n“I’m looking to get Matty Smiths in the building, plural. So here, I think every team is looking to do that and nothing has changed.”\nAnd while the Ireland legend welcomes the investment he stressed it won’t alter his outlook, expectations or ambitions for the club.\n“I glanced over the media stuff (on Friday) but with Sligo here I had no real interest in reading it.\n“I know Europe will be mentioned, but I’ve been talking about Europe.\n“People will say there’s pressure on Damien Duff but nobody can put more pressure on me than I do myself already.\n“For me, it’s the biggest job in the world and nothing has changed.”",
  "word_count": 454,
  "scraped_at": "2026-02-14T13:08:28.435016"
}