{
  "article_id": "3b3e8522352f",
  "url": "https://www.hollywoodreporter.com/movies/movie-features/what-went-wrong-9-11-documentary-we-go-higher-1235914651/",
  "title": "What Went Wrong With The 9 / 11 Documentary  We Go Higher ? ",
  "date": "20240607T161500Z",
  "domain": "hollywoodreporter.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The 9/11 Documentary You’ll Never See\n'We Go Higher' was supposed to give a much-needed voice to the children of 9/11 victims. Now, its high-profile producer is dealing with claims of financial fraud and emotional manipulation, and the much-anticipated film will likely never come out. What went wrong?\nThe person sitting on a bed and being interviewed for a documentary is clearly in distress, tears welling.\n“Can we take a break for a second?” Delaney Colaio, 18, asks the co-directors of We Go Higher, a documentary about the life experiences of “9/11 Kids,” people with parents murdered in the 2001 terrorist attacks.\nSomeone offers water, but no break is given to Colaio. The directors, the award-winning Sara Hirsh Bordo and her frequent collaborator Michael Campo, resume firing questions about self-harm, Colaio’s relationship with his mother, and about his father, killed when Colaio was a toddler. During the two-hour-plus session, filmed in August 2017, and the three-hour session the night before, Bordo and Campo also grill Colaio on why he doesn’t want to see the terrorists face the death penalty. Amid all this, Colaio, brown eyes bleary and pained, puts his face in his hands and says he’s had enough, that he’s already shared things he’s never shared with anyone.\n“Why do you think you’re suffering so much?” Campo asks. “Do you think you deserve this, everything that’s happened to you?”\nAfter more back-and-forth, Colaio moans, “I don’t want to have this conversation.”\n“But I do,” Campo replies. “And we’re on my time now.”\n“I’m very drained,” Colaio tries a few minutes later. “I don’t want to have this conversation.”\n“But this is not a draining conversation …” Campo heads the teen off again.\nLater, outside in a park after filming a scene with Brian Cosgrove, whose father also died in the Twin Towers, Colaio has a panic attack. The camera keeps rolling, catching his body slumped on a sidewalk with Bordo, lips pursed, holding his prone head on her lap. Colaio was filmed on an emergency room gurney, blinking eyes darting back and forth as a nurse examined him.\nIn a phone interview more than six years later, Colaio says he hates seeing himself that way, so vulnerable and hurt, and that he did not know he was being filmed by Bordo in the hospital until he saw a cut of the documentary. “I felt like I was going to die,” he says. “I had no idea what was going on.”\nA lot was.\nWe Go Higher received massive attention from the moment preproduction was announced in 2017, with The New York Times, USA Today and CBS News running splashy pieces. It would, the marketing promised, be produced by Bordo and co-directed by Colaio.\nFor clarity, it is useful to know that from childhood through most of the filming, Colaio used female pronouns, and that his last name is legally Colaio-Coppola, but he goes by Colaio. Since 2020, Colaio has publicly identified as male. This article refers to Colaio as he and him, other than when quoting a source.\nOf Colaio’s apparent resilience in initiating the project, People gushed in 2017, “The terrorists’ attempt to destroy her family’s spirit only made her stronger.” The New York Times noted the documentary was expected to premiere in 2018 and that filmmakers would interview “every single 9/11 kid that wants to be filmed.” An interview archive would be created for historians.\nWith such promise, more than $900,000 was raised from 9/11 families and other supporters, according to an audit prepared in 2020 at Colaio’s request.\nSeven years after it was announced, no film has been released.\nThis isn’t just another story about a production gone bad, money misspent. Besides being a tragically untold tale about the worst terrorist attack on U.S. soil, the ill-fated We Go Higher raises troubling questions about the documentary industry itself. In addition to spawning a lawsuit that alleged Bordo and her companies misappropriated production funds, and angry former producers mystified by what they say was Bordo’s luxury travel and oddly timed purchases, there are disturbing accounts of how the traumatized were treated in front of and behind the camera.\nAs documentaries have grown from a cottage industry of mostly low-budget curios to being a core entertainment product with hits like Quiet on Set, Where Is Wendy Williams?, and Britney vs Spears, there have been intensifying questions not only about journalistic standards but also about how the people in the films are handled. If Hollywood now has regularized the hiring of intimacy coordinators to protect paid actors in scripted productions, some are asking if it’s time to provide psychological support and safety measures for people exposing their real-life traumas — who are rarely paid for their participation. Margie Ratliff, who was 20 in 2002 when she was filmed for The Staircase, a wrenching documentary about her father’s trial on charges of killing his wife, and who now wishes she could be edited out, is starting the nonprofit Documentary Participants Empowerment Alliance. “We want to make sure to have lawyers and mental health facilitators available when participants need on-site help,” says Ratliff — who was paid nothing for The Staircase or the 2022 HBO scripted spinoff of the same name — “or help with a contract to know what they’re signing and also resources for filmmakers.”\nWhat makes We Go Higher an especially illustrative case is the 2020 audit. It allows a rare look at what can happen inside even well-intentioned documentaries. While some films come from news organizations with known standards, such as CNN and The New York Times, others are homespun. In this case, business and personal boundaries appear to have become hopelessly jumbled. In a phone interview with Bordo that was conducted with both her publicist and her lawyer on the line, the filmmaker says there was nothing substandard with We Go Higher’s financial management or mental health sensitivities. She referred to it as “a creative miscarriage,” and notes she nevertheless finished a version of the film as promised. She acknowledges that much had not gone to plan, blaming Colaio for a sudden change of heart about the direction of the project that left her “stunned” and led to its failure to sell. She says the production took a brutal toll on her well-being.\n“I’ve had this conversation with other female doc filmmakers,” Bordo says. “You start with an idea, and our movies aren’t funded. We hustle to have them made. We hustle for years. We put in our health. We put in what our bodies can handle. I was diagnosed with a new autoimmune condition and a new breast tumor and new ovarian cysts once I shelved the film.” She also mentioned suffering from “active Epstein-Barr,” a virus that can cause recurring flu-like symptoms.\nCampo, the co-director who along with Bordo was asking Colaio questions prior to the panic attack, did not reply to numerous requests for comment. His LinkedIn page places him in Tampa, Florida, and describes his current job as a digital content production specialist at AAA-The Auto Club Group.\nThe fate of the project has been a subject of frustrated discussion among a Facebook group of 9/11 families.\n“We (the kids) don’t trust many people,” a member posted in 2022, “and we shared our hearts only to be let down.”\nAnother member asked of the film, “What is going on? Has it been abandoned? ANYONE? Some professionalism and common courtesy would be nice. These kids deserve an answer.’”\nJournalism, it is often said, is at its root about comforting the afflicted and afflicting the comfortable. So, to those who deserve an answer about We Go Higher, here it is, told via interviews with those involved in the production, access to unreleased footage, court documents, tax returns and social media history. As with so much about 9/11, there is rarely a true version of events that can be reduced to a neat turn of phrase. The terrorists, in fact, did break many spirits in ways large and small. This story is partly about the afflicted hurting the afflicted, but it’s also about a fractured dream that might yet become whole.\n***\nThe creative partnership between Bordo and Colaio started when Colaio was in high school at a Florida soccer academy.\nDuring a school break in New York at the age of 15, Colaio says, he was sexually assaulted by a friend of a friend. Uncomfortable after that at the academy, where boys vastly outnumbered girls, Colaio reached out to Alexis Jones, a former contestant on Survivor who had an anti-sex-abuse lecture program directed at male athletes called ProtectHer. Colaio raised money to help cover Jones’ $6,000 fee to speak at the school, Colaio says.\nIn December 2016, Jones asked Colaio, then 18, to come to Austin, Texas, to tell the story of his assault in a ProtectHer film she and Bordo were making, Colaio says. Bordo is best known for directing the 2015 documentary A Brave Heart: The Lizzie Velasquez Story, about an inspiring woman with a disfiguring medical condition who copes with bullying. (Campo is credited as a writer and associate producer.) According to Bordo’s biography on IMDb, she held various marketing positions in entertainment before that, including at Paramount and MGM Studios.\nHer Austin-based production company, Women Rising, was founded in 2013, its website states, “with the mission of creating content and experiences to empower women and girls.”\nThe finished ProtectHer film features a lecture Jones gives to a packed room of male athletes at the University of Texas, interspersed with testimonials from professionals including former USC star Matt Leinart and disgraced NFL player Ray Rice, who endorse a message of men’s personal responsibility.\nNinety seconds in, the film cuts from former basketball star — and Jones’ husband — Brad Buckman saying, “Girls don’t feel safe on campus,” to a silent few seconds of Colaio looking downcast. Later, after a montage of campus sex assaults at Baylor and Stanford, and a newscaster intoning, “Two former Vanderbilt football players accused of sexually assaulting a female student in a dorm room when she was drunk and unconscious,” Colaio appears again. He is a stereotypical picture of innocence and vulnerability, long dark blond hair parted neatly, lips glossed and brows accentuating eyes that loom large in close-up.\nBordo and Jones’ film fails to include anything in Colaio’s four minutes and 22 seconds of excruciating, tearfully spoken detail about the violence and emotional damage of the alleged rape to indicate that, according to Colaio, the alleged attacker was not a college or professional athlete, the assault did not happen in a dorm room or on or near a college campus, Colaio was not unconscious, and Colaio was not the victim of any infamous case mentioned.\nSuch an appearance should be handled carefully and appropriately, says Melissa Cooper, a veteran documentary producer. Using Colaio as a generic stand-in for young women raped by athletes “is exploitation,” Cooper notes. “It’s playing on emotions, and it’s not relevant. It’s actually false information.”\nJones did not reply to numerous requests for comment. Although Bordo initially answered some questions for this article, she declined, through a spokesperson, to comment on the way Colaio was used in ProtectHer or on other issues raised here when offered an opportunity before publication.\nStandard appearance releases signed by documentary participants strip away all control over how their footage is edited and where it can appear, forever. In a recent phone interview, Colaio recalls, “I was under the impression that it was going to be used for college curriculums.”\nIn fact, ProtectHer, with cinematography by Campo, premiered at the 2020 South by Southwest festival and is available for streaming on Amazon.\nDuring the emotional days of the ProtectHer shoot, Colaio, who was staying in Bordo’s apartment, confided in the director that his father, who had been an executive at the investment firm Cantor Fitzgerald, had died on 9/11 and that he had recently been told that he had a financial trust with money from the 9/11 Victims Compensation Fund and life insurance.\n“I said to Sara I wanted to make a documentary about kids who lost parents in 9/11 because I felt like our stories weren’t told yet,” Colaio says. “I really looked up to Sara as a filmmaker, and I asked her advice. She was super supportive and came on board right away. She was like, ‘I’ll direct this with you and have my production company produce it, and we’ll raise funds.’ It was zero to a hundred really fast.”\nBordo agrees she felt an affinity with Colaio “as a sexual assault survivor.” (Bordo says she “was assaulted as an 8-year-old girl and then again at 28.”)\n“Delaney and I met having had a similar past. When Delaney approached me after I had interviewed him for the doc, he told me that it was really the first time that he had felt so seen and heard and that the community of sexual assault survivors wasn’t the only community of trauma that he was a member of, and that he was also a 9/11 kid.”\nWithin a few months, Colaio and his mother, June Coppola, signed an agreement to loan Bordo’s production company $40,000 a month for four months to start on a 9/11 kids film. Colaio was to be paid back, the agreement states, “from first funds raised and available for the production of the film.” It is rare for the subject of a documentary to fund it — conflicts over creative control are one pitfall — and especially unusual for an 18-year-old newcomer.\nAccording to a civil fraud lawsuit filed July 13, 2023, in U.S. District Court for the Western District of Texas, Austin Division, by Colaio against Bordo and her various business entities, Bordo eventually arranged for Colaio to loan the production $276,000.\nFilming began on July 5, 2017. Panavision donated rental cameras, Bordo says, and the first shoot was at Colaio’s home — north of New York City.\nSix weeks in, on Aug. 19, came the panic attack. Shortly after, on Sept. 11, 2017, at ground zero, during the official commemoration of the 16th anniversary, Colaio was filmed taking a turn reading from the names of the victims, including his father and two uncles. Later that same day, Colaio helped conduct interviews with other 9/11 kids. As a filming location, the World Trade Center had donated an open floor of an office tower with a view of the two memorial pools dug into the subterranean footprints of the fallen towers.\nThe process was more fraught for Colaio, who was filmed over years, than for the 70 other “kids,” most of whom were on set for just a day.\nFor many of those who lost parents, the interviews were cathartic. “I still grieve,” a young woman said during her interview there. “But I recognize that that’s OK, that grief is part of me, love is part of me. It’s all part of me.”\nMany 9/11 families say that while they are often treated with sympathy, they have also been unfairly painted as greedy over the years because of generous payments from compensation funds. The film seemed a rare chance to tell a more complex tale. Brian Cosgrove, now 35, was a seventh grader in 2001. A well-known recorded telephone call to 911 emergency services by his father Michael, who was trapped in one of the towers, lucidly begging for help and expressing love for his children, ends with his chilling cry of “Oh God!” as the building collapses. In Brian’s emotionally raw We Go Higher interview, he shared his frustration that unlike “normal people” who lose a loved one, he is never allowed closure. “I am just this piece of sympathy. Everyone comes out of the woodwork and decides to text me or call me or to show me love only on 9 /11.” The worst day of his life, Cosgrove says, is a meme. “They turned ground zero into a tourist attraction. I can’t go down there and grieve and have a minute where my father was murdered because I have a family from Denmark taking selfies in front of my dad’s name.”\nOn Sept. 11, 2001, Colaio was 3. “I was getting ready for ballet class that morning and out of nowhere my mom was hysterically, hysterically crying,” he says.\nColaio’s father, Mark, and two uncles worked on the 104th floor of the South Tower. A hijacked plane traveling 540 miles an hour hit floors 77 to 85 at 9:03 a.m., 17 minutes after another hit the North Tower. Very few people on the upper floors made it out. Some, trapped by flames and smoke, waited for help that never arrived, and others fled down a single surviving stairwell. Those inside and still alive 56 minutes after impact were pulverized when the skyscraper collapsed in a cascade that sent a massive cloud of choking dust through lower Manhattan — an unforgettable spectacle of mass death, including 403 emergency responders, that was broadcast live worldwide.\nThe night after filming on Sept. 13, 2017, Colaio texted Bordo that he was feeling suicidal and did not want to sit for his own interview overlooking the memorial the next day.\n“I’m sorry about everything … but i think being up there today was the closest I’ve ever felt to my dad, but it also made me realize and visualize what it must’ve been like for him … And I just want to be with him … I want to be with him now,” Colaio messaged, according to screenshots Colaio shared of the exchange.\nBordo replied by text, even though, according to Colaio, both were staying in separate bedrooms in the same short-term rental, “Honey please please don’t scare me like that. It’s not fair to you or to anyone who cares for you.”\nColaio: “I’m sorry I don’t want to feel this anymore.”\nBordo: “My best friend had a miscarriage last night. Life is so hard. But it is about standing. I believe in you. If you care for me at all, and for our friendship, you will find the support you need. I don’t have the heart today with my friend’s news to worry about you giving up your life …”\nOver the next two years of sporadic filming, Colaio was frequently coached through video fundraising appeals. The audit lists donors from 2017 who gave a total of $215,802. Part of that may be from an Indiegogo campaign for the film in 2017 that raised $62,805 alone from 299 backers. Many of those were family and friends of 9/11 victims, Colaio says.\nMoney was also flowing out. According to the audit, more than $37,000 was spent on public relations and marketing for the never-released film, including $8,000 to veteran entertainment publicist Orna Pickens. She told me in a brief phone interview that all of her work was done in 2017, when articles associating Bordo with the high-profile project appeared in The New York Times, People and other outlets. Pickens said she does not understand why I would write now about a project that seemed to start so sweetly but has not been released. “I feel terrible for Sara,” Pickens says. “She put so much time and effort into this.”\nIn spring 2018, the production was back in New York, where Colaio was to speak at an anti-gun-violence event called March for Our Lives. Victims of mass shootings and other traumas have expressed frustration with those who express “thoughts and prayers” to victims but don’t deliver on promises of change. At the march, Bordo and Colaio met Kelly Rogers, 17, who had recently moved to the city from a small town in North Carolina and was managing programming for the march. Later, Bordo would call the speech Colaio’s “hero moment,” and use it to pivot the film’s narrative from the traumas of 9/11 toward more current mass casualty events, Rogers says in a phone interview from Minnesota, where she is now an undergraduate in Urban Studies. Bordo asked the teen if she was interested in helping on a project in California involving Michelle Obama, the United State of Women Summit, for which Bordo’s Women Rising was handling the livestream. Thrilled to be drawn into production work, Rogers accepted pay of about $500 total for the whole trip, she says.\nLike a lot of young people who dream big, Rogers was eager to be in the business of movies. “I literally would have worked myself to death,” she says. “I would have done really anything to keep this because everything was real. I really did go work on that conference with Michelle Obama. We were taking calls with Paramount and Sony on these different projects.”\nSoon, Rogers was hired on We Go Higher. She was told her title would be associate producer and was paid about $300 per 60- to 80-hour work week, she says. When an experienced line producer was fired, Bordo asked Rogers to handle those duties, without a raise, Rogers says. Normally a line producer is the business manager of a project, a complex role that requires overseeing the budget and logistics, including contracts, paperwork and locations. “I definitely didn’t know how to run a budget,” says Rogers, who is credited on the project’s IMDb page as line producer. “I didn’t even know what that meant.”\nRogers and Colaio say that Bordo commonly addressed them as “Dear Heart” and “Angel.” Rogers says that Bordo began referring to herself as “a 9/11 kid by proxy.”\n“She was 100 percent a mother figure to me,” Colaio says. “She would call me her daughter. It was very much like that.”\nAsked if she referred to Colaio as her “daughter,” Bordo answers indirectly, reciting the health issues and financial losses she’s suffered as a result of shelving the film.\nOnly a few months into her employment, Rogers experienced a family tragedy of her own when her 16-year-old brother, Julian, a star lacrosse player, died by suicide. The boy’s memorial web page suggested that, “In lieu of flowers, the family requests donations be made in Julian’s honor to” Bordo’s production company, “Women Rising Productions, a not for profit where Julian’s sister Kelly is inspired.” The audit shows $4,115.00 of “in honor of Julian Rogers” donations directed toward We Go Higher.\n***\nShortly after the funeral, Rogers moved to Austin, to an apartment Bordo owned, Rogers says. At first, Bordo was driving an old SUV, Rogers says.\n“She starts one day talking about buying a Porsche, custom,” Rogers says. “She said that it was a present to herself. But it was confusing to me because she was also at the same time telling us that she was broke because of the film.”\nPublic records show that at one point Bordo drove a 2019 Porsche Cayenne, a model with a base price of $65,700. Bordo confirms that she did buy a car, but would not say the brand. Bordo says she sold it to raise funds for We Go Higher. “I had a car for 18 years and then I decided that I deserved a new car,” Bordo said. “And I broke my own rules. I was so focused on finishing the film. I was so focused on interviewing every kid that raised their hand. I was so focused on not disappointing Delaney or Delaney’s beautiful family, her mom June, her grandfather Victor, who I called Papa, that I compromised myself, my health, my intuition, just trying to be the good little director, the good little filmmaker, like, ‘OK, I have this amount of money. Let me just sell my car and then we can use that.’”\nTasked with booking Bordo’s travel, Rogers says she also did not understand how the boss could complain about money but insist on flying first or business class between Austin and New York.\nAlthough documentaries are big business, many of those who make them still proudly adhere to a bare bones ethos, the idea that if you become too fancy you will lose touch with your audience — or will lose favor with funders. Alexandra Pelosi, who has directed 16 documentaries for HBO, including 2022’s Pelosi in the House, about her politician mother, Nancy, says, “I’ve worked at HBO for 22 years and I’ve never been in business class. I’m in coach. Documentary filmmakers sit in coach. Period.”\nThe finances of We Go Higher were certainly not being handled according to industry standards, notes Jonathan Black, a veteran film finance expert who performed the audit in 2020 when Colaio had become frustrated at unanswered questions about how the donated money had been spent, and why his loans had not been paid back. Black, who has worked on about 50 film productions over 25 years, says that to sell a film, producers need to show buyers solid accounting and signed releases. But under Bordo’s management of We Go Higher, “there was nothing there to back up anything,” Black says.\nHe tried to make sense of the documents he was sent and was able to produce a 279-page audit. It shows that $120,000 was budgeted to pay Bordo as a producer. Among numerous charges to the production budget without clear receipts are $21,671 in hotel and $32,291 in airfare transactions the auditor labeled “questionable.” During a November 2018 California trip, there were charges to Kaya Sushi, Belcampo Meats, Hotel Wilshire and Santa Monica’s luxury Shutters on the Beach hotel, when, the audit notes, “All CA Charges happened when nothing was being done for the film in CA at the time. No Paperwork, No Receipt & No Info.”\nOf more than $600 spent on Aug. 31, 2017, at Alamo Drafthouse in Bordo’s home city and billed to the production, the auditor noted, “Why are there charges to a movie theater in Austin? No Paperwork, No Receipt & No Info.”\nAsked in an interview about a $182.00 charge on the audit for a handbag, Bordo defended it saying, “Out of pages and pages and pages and pages and pages and pages and pages and pages and pages of accounting that we shared, there was one day when I bought something personally with the Amex because I was on foot and it’s all I had, and it was a little purse because I didn’t have one with me.” Bordo estimates that more than $1 million was spent on We Go Higher and said she and her production company combined lost even more than the $276,000 that Colaio loaned and was not repaid.\n***\nRogers, the young producer, had additional concerns about how Bordo was spending money. In October 2018, Rogers says, Bordo booked travel on a company credit card for a We Go Higher meeting in London with someone affected by the Manchester concert bombing. When the meeting was canceled, Bordo asked Rogers about changing the ticket so that she could fly to Thira, the main city on the Greek island Santorini. Bordo did not specify a date for the new destination, but did explain her reasoning for viewing the reuse of her ticket as a business matter, Rogers says.\n“She decided to use hers for a ‘hiatus’ that she justified over the phone by saying she was really stressed with work,” Rogers says. Text messages between Rogers and Bordo and notes Rogers made at the time back up this account. The messages show an exchange in which Rogers assures her boss she understands instructions about being “upgraded to first class” on British Airways but mentions problems finding a ticket to Thira.\nBordo messages, “They had flights to Thira on certain days.”\nOn Bordo’s Instagram account, there are photos of her and her mother in Santorini posted in April and May of 2019 from what she captioned a “self-rescue trip” around her birthday. She captioned another one, “Six months ago after receiving yet another diagnosis, I pre-paid for a healing journey abroad. I pre-paid because I knew my ego around being enough would jump in and make an excuse to sabotage myself from actually taking the time away.”\nDoing the math, six months before April was when Rogers and Bordo were messaging about booking travel to Greece. Bordo declined to answer questions about the Santorini trip.\nSome of the stress requiring a Mediterranean vacation might also have come from Bordo’s decision by mid-2018 to change the focus of the project. Colaio was, at Bordo’s suggestion, meeting on camera with survivors of school shootings and other traumas. “She said that because the project is expanding, it is costing more,” Colaio recalls.\nColaio, around 20 years old at this time, said he was trying to go along with what Bordo asked, trusting that the focus of the film would remain the lived experiences of those who’d lost parents in 9/11. Whenever he did question Bordo’s decisions, he says, “Her whole eyes would change. It felt like they would darken. Her whole energy. I was like, ‘Whoa, I don’t want to do that again.’ It scared me.”\nColaio tried to go along. “She was my first mentor that brought me into the film world,” he says. “Because of that, I thought, ‘I guess I’m wrong, I better shut up.’”\nBordo would turn things around and blame Colaio for not fundraising enough, once writing that “It hurts my heart that you would not help when asked,” Colaio recalls. “And then I sent a whole thing back being like, ‘I care.’”\nBordo renamed the film Loss and Found, which is the current name on IMDb. One associate producer, an older 9/11 kid, saw what was happening and quit.\n“Once these other communities got involved in the film project, it was no longer We Go Higher about the 9/11 kids,” says the associate producer, who requested anonymity. “She totally renamed it. She sent us footage. It was a powerful story in that we met all these people who had survived a traumatic event, but it was not about the 9/11 kids, what initially that I went out to people and asked for funds for and asked my friends to be vulnerable for and do these interviews.”\nFeelings between the creators were fraying. On one shoot, Colaio said he could not eat the lunch they’d bought him and left to get his own meal. After he left, Bordo griped about Colaio being entitled and getting mad about things that don’t matter, Rogers says. “Sara said, ‘I can’t take it. It’s just because she’s rich,’” Rogers recalls. Another time in Austin, Bordo warned Rogers that if she became friends with Colaio, it “would never be equal,” Rogers recalls. “Because he is the youngest independently wealthy person she knew and that fundamentally impacts the way he interacts with others.”\nAt the end of 2018, Rogers, disheartened, left the project, taking work back home in New Bern, North Carolina, as a cashier at a Chik-fil-A.\nBordo and an editor, Wenjing Zhang, were working in Austin on a cut of the film in late 2019 and early 2020. In a phone interview, Zhang, referring to Colaio as “they,” says Colaio has no reason to complain about the film because he was consulted during the edit. “Everybody was in the loop,” Zhang says. “They were supportive of the cuts. They flew down a couple of times to do additional interviews and fundraising events.”\nColaio says Bordo forbade him from attending meetings with streaming services and other potential buyers: “She said I couldn’t come. It would make them feel too guilty if I was in the room. I said ‘OK.’ I let her do it.”\nZhang and Bordo say Colaio’s support evaporated when Loss and Found was not accepted into the 2020 Tribeca Film Festival, held in the former shadows of the Twin Towers.\n“Delaney took it very personally,” Zhang says. “Delaney was in Austin. We had dinner together with Sara and Brian [Cosgrove]. Delaney was very upset. Understandably, it was a very personal film for them, and I sympathize, but also it doesn’t mean the movie’s a failure, and that it can’t go anywhere.”\nZhang defends Bordo and Loss and Found, saying that with unscripted productions you never know what you have until the editing begins. “We had to make a story in post, as most documentaries do,” she says. “We felt quite proud of what we came up with.”\nWhat is it about? “How people deal with grief and loss in different ways,” the editor answers.\nFor Colaio, the Tribeca rejection gave him a new perspective on what had become a film of around 90 minutes focused on one generation of trauma delivering comfort to a younger one. “I thought the film is crap,” he says. “None of the money went into this. It looks like a college project. And why were we still fundraising? It was not reflective of the work we put in.” Colaio thought back to comments Bordo had made. “At many points she said our story is too sad and no one would buy it,” he says. “We needed to make it lighthearted.” Colaio says he asked what happened to the 400 hours of 9/11 kids pouring out their hearts and telling their stories. “In the cut she presented, it scratches the surface,” he says. “9/11 is naturally a sad topic, and to put a spin on it to make it a joyful experience is a lie. The event is gruesome and cruel.” Colaio says he was feeling more and more that he’d been manipulated into making something that fulfilled Bordo’s dream, not his.\nBordo counters that the theme she thought she’d worked out with Colaio’s approval was “turning pain into purpose.”\nBordo says she was stunned. “In 2020, over a month, we went from celebrating the film we made with a group of kids into me learning that Delaney had a change of heart and wanted to pull the film,” she says. The film was supposed to be “about giving the kids as a whole a chance to be heard,” Bordo says. “And what we were now facing was the decision of one of the kids, granted the co-director, granted the lead subject of the film.”\nIn an October 2020 email to an outside investor, which I obtained, Bordo tried to explain why there might be no money coming back. “Delaney has slowly and silently been building a resentment and blame pointed in my direction,” Bordo wrote, noting that there had been an “X factor” in Colaio’s life. “Delaney has come out in the last year, finding her voice, her new voice, and finding her way with it. She is not the same girl I met four years ago. In any way other than name.” In the email, Bordo complained about her own trouble sleeping and that her friends were worried.\nThe lawsuit interprets this email as Bordo blaming Colaio’s “sexuality” for his dislike of the film. “In the email,” the lawsuit states, “Bordo goes on to imply that Colaio coming out as queer in some way influenced their perception of the project, when in fact, it was the quality of the film that was the central point of Colaio’s concern.”\nBordo strenuously denies any bias: “It had zero to do with anything at all related to Delaney’s brave transition and his new life.” Bordo says that if Colaio had not lost faith, there would have been a happy ending. “No one had to lose money at all,” Bordo notes, adding that the film would have sold and all investors would have been repaid if not for COVID-19 interrupting the film market and Colaio deciding he did not like the version that had been produced. There was interest from a small film festival, and someone sought to license the footage.\nIn the fall of 2020, Bordo tried to decide whether it was worth fighting Colaio for control but that October sent him an email, in which she said in part: “I’ve talked to several filmmakers and investors in the last couple of weeks trying to get advice on what to do if their subjects and or collaborators have had a change of heart. … I just can’t wrap my heart around the consistent recommendations to distribute within legal boundaries.”\nBordo says she offered to turn all of the footage over to Colaio right then to make whatever film he wanted from it. Colaio says there were strings, including Bordo asking for payment. Bordo denies asking for payment.\nColaio had been 18 when he first met Bordo and was around 21 at this time, still learning a lot fast.\n“I spent three years pouring myself into this, and for it to one day be gone was a lot,” he says. “From October through August 2020-2021, I barely left the house. I was so embarrassed. All my family knew. My friends.”\nEventually, he dove into professional therapy and found a job at a bar in Manhattan’s West Village. “Light started coming in when I started finding my footing in the queer community,” he says. “I found joy again. I worked at Cubbyhole and I got a community of great friends and I had fun that year. I stopped thinking about the documentary.”\nBut by the summer of 2023, he was ready to face it again. The lawsuit, filed in July 2023, alleged fraud and misconduct. It asked for a proper accounting of Colaio’s $276,000, alleged that Bordo and her companies absconded with “over $500,000, or approximately 60% of all funds raised through Bordo’s ‘non-profit’ entity,” and charged that required rights releases from cast and crew were never obtained.\n***\nIt can be tempting to blame the mess on a documentary filmmaker who was desperate to make a big project, win more awards and fulfill her self-defined purpose. You could say she saw resources and grasped at them and then took advantage of ambitious young people to make her dream of helming another important doc come true, squandering charity money, changing the point of the film, and perhaps manipulating and hurting fragile people.\nAnother way of looking at it could be that there are no rules in place to control overzealous doc-makers in a brutal marketplace. There is no doubt Bordo gave the project her full effort. This may have been the best film she was able to make given all the dynamics, including a central figure who was a teenager still coming into his own identity.\nIn the fall of 2023, Colaio told me that if he got all of the footage and the proper releases, “The only thing I hope is to give the 9/11 kids what I promised them from the beginning, to share their stories and to share my truth.”\nThis February, the lawsuit was settled confidentially. “We can confirm, however, that Delaney Colaio-Coppola owns and controls the exclusive, worldwide full rights to any and all footage and any and all work product related to the documentary film project,” his lawyer Sheila Tendy says. In documents confirming the transfer of rights to Colaio, there is no mention of Bordo paying back any money.\nAfter the settlement, Bordo sent a statement calling this story an attempt “to disparage me and my colleagues’ well-intended work. I recognize the origin of these painful, false, and accusatory statements from healing the depths of my own trauma. I simply wish healing to Delaney, release of the 9/11 kids stories, which continue to lay in his hands, and peace for all involved.”\nMonths earlier, Bordo had told me what she’d been pondering. “I did so much reflection on if I had done anything to make any of the film subjects, Delaney or the others, feel anything except seen and heard, then I need to figure out why. A counselor, a guide of mine, helped me understand the reflection and self observation that I’m likely on the autism spectrum.”\nColaio, now 25, declined to comment after the lawsuit was settled, but he has teamed with Kelly Peck, a former producer on Netflix’s creative studio team, and Rebecca Bertuch, a writer on HBO’s Winning Time: The Rise of the Lakers Dynasty, on a new documentary using some of the existing footage.\n“All people deserve dignity, respect and honesty when telling their story,” Peck says. “I think we need to look critically as a society and as an industry at what we expect and often demand from people who have suffered and survived.”\nThe tentative title of the new doc is Thoughts and Prayers.\nThis story first appeared in the June 5 issue of The Hollywood Reporter magazine. Click here to subscribe.",
  "word_count": 6749,
  "scraped_at": "2026-02-14T13:12:23.688670"
}