{
  "article_id": "3b4720b39f3e",
  "url": "https://www.the42.ie/ruesha-littlejohn-5997157-Feb2023/",
  "title": "Advice for new Ireland recruits , Ukraine blow to Hampden history , and YouTube fun",
  "date": "20230218T090000Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "“THAT’S INTERNATIONAL football for you,” Ruesha Littlejohn deadpans.\nThe Republic of Ireland star has been around the block at this stage, the addition of Aoife Mannion and Marissa Sheva to the set-up as World Cup preparations ramp up not exactly fazing her.\n“At the end of the day it’s competition and if people are strengthening the team, that’s it. Vera [Pauw, manager] is in charge and that’s the way it is, really.\n“Everyone has welcomed everyone with open arms. Obviously there are going to be questions here and there, but it’s up to the girls to come in and prove that they want to play for Ireland and they are going to give everything to be here.”\nNow in direct competition with Sheva, in particular, Littlejohn was once in their shoes.\nBorn in Glasgow, she previously represented Scotland at underage level. Irish-eligible through her maternal grandparents, she made her senior debut for the Girls In Green in 2012.\nThe Aston Villa midfielder jokes about an old jersey-burning tradition after switching allegiances, but cuts to the serious business as she offers advice to Mannion and Sheva.\n“Just dedicate yourself to Ireland. That’s where your loyalties lie now, and I think everyone in the squad respects that and appreciates that. Obviously for myself, everyone knows I was born in Glasgow and that’s where I grew up and I spent my holidays at my nan’s house but I care for Ireland because I’d been to Ireland so often and I spent all my childhood summers, Christmas, Halloween, whatever it was there.\n“So that’s why I chose to play for Ireland, but you’ve got to care for the country. I think there are a lot of people now who would play international football just to play international football but I think if you come into a team environment you’ve got to show you care, buy into the culture, learn about the history and I think everyone that plays for Ireland in the team will respect you. It’s as simple as that really.”\nEngland youth international Mannion spoke this week about apprehension of how she may be perceived. While in a different era for women’s football, there was none of that for Littlejohn. It was a “no-brainer,” she recalls, former Arsenal team-mates Emma Byrne, Niamh Fahey, Ciara Grant and Yvonne Treacy ultimately setting the wheels in motion.\n68 caps later, Littlejohn is within touching distance of the World Cup dream, preparations ramping up with a 10-day training camp in Marbella and an international friendly against China PR on Wednesday.\nInjury robbed her of a few more appearances in the business end of the qualifying campaign, including the historic play-off win over Scotland in October.\nThe 32-year-old broke her foot against Finland a few weeks beforehand, while a torn calf and other niggles delayed her comeback. It’s good to be back, she beams, ready to pull on the green jersey once more after being forced to watch from the stands in Hampden Park.\n“It was very stressful, I must admit. You’re obviously watching it as a fan, but then you’ve got all those other emotions attached to it of knowing all the girls and you want to be down on the side of the pitch with them. I was sitting in the stand with my family but then I had to leave and go to the back of the stadium and stand in a wee stairwell and watch it from there. It was absolutely nerve-racking. It was so emotional, so intense.”\nSlowly but surely, it’s all sinking in. “We’re actually going to the World Cup,” as a few of the players were saying to one another on a coffee run this week. Littlejohn reins herself back in after that anecdote, stressing there’s a way to go yet.\n“Obviously you are not there until you are there, your seat on the plane won’t be finalised until June or July, so we are a while away. But it’s amazing what an achievement it is. How long it has taken us to get here, it’s been years, a long process.”\nA first major tournament after years of near misses, the most notable of such the gut-wrenching Euro 2022 qualification shortcoming.\nTypically open and honest, Littlejohn previously spoke about the team feeling like failures after they, in her own words, “blew it” against Ukraine.\nShe might not admit it herself, but securing World Cup qualification this time around felt like a case of last chance saloon for a cohort of players. Perhaps all of this came together as motivation?\n“I don’t think at the time you’re thinking ‘This is my last chance’. But the Ukraine thing, we were so close. I feel looking back you have to go through that, fail that hard, feel that failure.\n“That Ukraine game, we all speak about it now, how we couldn’t control our nerves, our emotions. I tried to go for a nap and I was absolutely buzzing, my eyes were glued opened and it was, ‘Right, I won’t be going for a nap’ It was just pure nerves. I feel we had to go through that to be able to come through the other side.”\nAway from the Irish scene, the World Cup is always in the “back of your mind”.\nThere’s a real buzz at Villa, she enthuses, amidst the mid-season arrivals of Jordan Nobbs and Lucy Staniforth and a competitive Women’s Super League [WSL] campaign.\nLittlejohn is building up to full fitness after making her first WSL appearance of the season against Manchester City in January.\nAside from football, she’s been kept busy by a budding vlogging career, her YouTube channel gaining 9.73k subscribers since launching three months ago.\n“It’s been good,” she grins. “It’s fun and I’m enjoying it.\n“You play football and you look to do what’s next and I think it’s important to be open to other opportunities. My sister (journalist Shebahn Aherne), funnily enough, said to me why don’t you give it a go.\n“There is not many females doing it, males whatever, but YouTube is a big platform and there are a lot of opportunities there and I just thought in the lead-up to the World Cup, it could be fun to let fans and that have a bit of insight. I will keep pushing it and see where it takes me, it can maybe help to grow the game.”\nLittlejohn will keep pushing on the pitch, too, game-time the big goal in this camp as she looks to stake a claim for Australia.\n“I’ll be happy to get whatever I’m given,” she concludes, some minutes banked in an uncapped, behind closed doors game against Germany yesterday. “It’s just nice to get back into the swing of it. We’ll test ourselves and get back up to speed at international level.”",
  "word_count": 1135,
  "scraped_at": "2026-02-14T12:39:01.005048"
}