{
  "article_id": "3b657be01953",
  "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-famous-faces-who-28364077",
  "title": "North East famous faces who have received a gong in New Year Honours list 2024",
  "date": "20231230T030000Z",
  "domain": "chroniclelive.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "North East famous faces who have received a gong in New Year's Honours list 2024\nMany local people have been honoured this year, including three North East public figures\nThree local public figures have earned a place on the 2024 New Year's Honours list in recognitition their achievements and service thoughout their career.\nTheir names appear alongside stars of sport, stage and screen, including England goalkeeper Mary Earps, Glastonbury founder Michael Eavis and Game of Thrones actor Emilia Clarke. And one is having their knighthood upgraded more than 20 years after receiving the honour.\nThe New Year's Honours list recognises the achievements of people from different backrounds across the country, from celebrities to volunteers and charity workers. Many local people have been honoured this year, including David Wallace, who joined Seaham Lifeboat Station in 1973 where he served as a volunteer crew member, mechanic and coxswain.\n- Read more: The celebrities recognised in the New Year's Honours list 2024\n- Keep up to date with all the latest news in and around Newcastle with our free newsletter\nAs well as Gwyneth Kathleen McKenzie, from Riding Mill, Northumberland, who has volunteered as a leader in the Scout Association for 50 years. And Michelle Southern, from Blyth, who founded Street Paws, a charity that provides free accessible vet care and support services to homeless people and their pets across the UK.\nAnd there's a number of local figures from the North East who have also made the list. Director and producer Sir Ridley Scott, who is originally from South Shields, is made a Knight Grand Cross, upgrading his previous knighthood which he was awarded in 2003. His works include Gladiator, Alien and Napoleon.\nMeanwhile, Jeff Stelling, who presented Gillette Soccer Saturday for Sky Sports until earlier this year, is made a Member of the Order of the British Empire (MBE). The 68-year-old, from Hartlepool, also presented Channel 4's Countdown during his career.\nCharlie Mackesy, the Northumberland-born author and illustrator who created The Boy, The Mole, The Fox and The Horse has also been awarded an OBE for services to art and literature.\nBishop Auckland-born Dr Fiona Hill, a former presidential advisor to George W. Bush, Barack Obama and Donald Trump, is made a Companion of St Michael and St George (CMG) for services to international relations. She served on the US National Intelligence Council from 2006 to 2009 and was a member of the US National Security Council from 2017 to 2019. She now works as a Chancellor for the University of Durham.\nOther celebrities to be honoured this year include Game of Thrones star Emilia Clarke has been made a Member of the Order of the British Empire (MBE) alongside her mother Jenny as co-founders of SameYou, a brain injury recovery charity they established after she survived two brain haemorrhages.\nIn sport, England captain Millie Bright has been made an OBE, while her fellow Lionesses Mary Earps and Lauren Hemp have been made MBEs for services to football after they finished runners-up to Spain in the women's World Cup.\nAnd author Jilly Cooper who becomes a dame, and Sir Justin Welby, the Archbishop of Canterbury, who is made a Knight Grand Cross of the Royal Victorian Order (RVO) for his personal service to the Crown during the coronation at Westminster Abbey in May.\nPrime Minister Rishi Sunak said: \"The New Year's Honours List recognises the exceptional achievements of people across the country and those who have shown the highest commitment to selflessness and compassion. To all honourees, you are the pride of this country and an inspiration to us all.\"",
  "word_count": 599,
  "scraped_at": "2026-02-14T12:30:28.290268"
}