{
  "article_id": "3b92618b797c",
  "url": "https://www.yahoo.com/entertainment/tv/articles/berlinale-series-market-ken-burns-132828947.html",
  "title": "Berlinale Series Market : Ken Burn  American Revolution , Titles From Ruben Östlund and Alonso Ruizpalacios Score Selection",
  "date": "20260115T141500Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Berlinale Series Market: Ken Burns’ ‘American Revolution,’ Titles From Ruben Östlund and Alonso Ruizpalacios Score Selection\nBerlinale Series Market Selects will welcome 17 scripted shows and three docu-series this year, including Ken Burns’ latest offering “The American Revolution,” co-directed with Sarah Botstein and David Schmidt.\nOther potential highlights include Globo’s “Emergency 53,” starring Fernanda Montenegro, who scored a best actress Oscar nomination for “Central Station.”\nMore from Variety\nAmid the BSM’s Co-Pro Series projects, to be presented on stage at the Berlin Series Market, one of its biggest traditions, “A Phone Rings in the Middle of the Night” marks the first fiction series from Plattform Producktion, the Swedish production outfit co-headed by Cannes Palme d’Or winning director Ruben Östlund (“The Square,” “Traingle of Sadness”).\nIn a sign of a new growth phase, the Berlinale Series Market is also launching two new initiatives this year: the Studio Babelsberg Production Excellence Award, awarded to an outstanding series in Berlinale Series Market Selects, and Series Match, Germany & Ibero-America, organized with Spain’s Iberseries & Platino Industria market. Latter aims to connect Ibero-American and German production companies.\nDetailing the events that grew into a struggle engaging more than two dozen nations, “The American Revolution” is narrated by Peter Coyote and includes the first-person voices of nearly 200 individual historic figures, read by – among many other starry names – Josh Brolin, Claire Danes, Morgan Freeman, Paul Giamatti, Tom Hanks, Ethan Hawke, Samuel L. Jackson, Michael Keaton, Edward Norton and Meryl Streep.\nIt has already been sold to France and Germany (Arte), and Australia (SBS).\n“We are delighted that ‘The American Revolution’ has been selected for the Berlinale Series Market. This recognition reflects the series’ universal relevance, bringing to life a story that continues to resonate across cultures and generations. It is an honor to share this deeply human exploration of one of history’s defining moments on an international stage,” said Joe Barrett, Vice President of Global Sales at PBS Distribution.\n“As we approach the 250th anniversary of the Declaration of Independence, ‘The American Revolution’ offers a cinematic journey into the founding of a nation, voiced by an extraordinary cast who bring first-hand historical accounts to life,” he added. “The series combines meticulous scholarship, immersive storytelling, and visual artistry to present history with immediacy, depth and resonance for viewers around the world.”\nMore in Entertainment\nWhoopi Goldberg struggles to sit at “The View” table during painful discussion: 'I'm out'\n“In Pursuit of the True Shaman” and Canada’s “The Struggle for Mother Water” will round up the Docuseries section.\n“‘In Pursuit of the True Shaman’ is a journey into a vanishing world where ancient knowledge continues to resist modern oblivion – while, amidst the endless steppes, a Turkish director wanders in search of his own shaman, tracing ancient rituals. This journey also unfolds as a feature-length documentary, allowing the same search to breathe in a different cinematic rhythm, at a time when humanity is urgently seeking new ways to understand itself,” said creator Talha Berkay Baş.\nApart from two Canadian shows, this year’s edition marks another strong showing for Germany, Chile and especially Spain, with five titles. One, “La Frontera” shows a captain of the Spanish Civil Guard uncovering an ETA terrorist attack in Paris. His partner is a French police officer. “In a desperate race against time, they confront shifting loyalties, criminal networks and impossible moral choices that blur the lines between duty and betrayal,” a description runs.\nBeyond that Spanish production-distribution giants The Mediapro Studio and Movistar Plus+ both have two titles at this year’s Berlinale Series Market.\nOne, “A 100-Million Reward,” – created and directed by Nacho G. Velilla, and sold by Movistar Plus+ Internacional – will see three mechanics kidnap a soccer star in order to finally get out of debt.\nMovistar Plus+ is also behind espionage thriller “The Center.” Fast-paced, fulsomely budgeted and ranging from Strasbourg to El Salvador, it is created by rising Spanish scripted star David Moreno whose “The Immortal” played Canneseries. It lifts the lid on the hidden world of Spain’s National Intelligence Center (CNI) as it races to unmask a traitor and counter a Russia-led conspiracy. It has been renewed for a second season.\nOther unlikely protagonists will prove that “All Heroes Are Bastards” – in this new German show, a hapless trio suddenly gains superpowers.\n“We wanted to take the superhero genre and use it to tell a story about our people, our pain and the real power structures. Straight from our neighborhood, for audiences everywhere,” creators Esra and Patrick Phul told Variety.\nReinvent Yellow brings Denmark’s “The Pushover” and “Conviction”. In the first, following a woman’s drowning, investigator Morten Stark tries to expose a suspect. Meanwhile, journalist Nora Sand uncovers multiple past fraud cases against him as well.\n“Based on Lone Theils’ novel, ‘The Pushover’ is fantastic because it delivers classic, gripping Nordic noir with a dark, realistic atmosphere,” said Helene Aurø, CSO of sales, marketing & acquisition at Reinvent Yellow.\n“The story feels authentic and grounded, driven by human flaws, moral ambiguity, and quiet tension rather than flashy twists. It keeps you hooked until the very end, with an unpredictable conclusion you simply can’t guess in advance.”\nAccording to Aurø, “Convictions” – where a woman needs to deal with a shocking tragedy – is a “compelling psychological thriller where you can truly relate to the protagonist’s worst nightmare unfolding: Her partner and child disappear with no explanation, dragging her into a tense, emotional search that keeps you on the edge of your seat.”\nShe added: “The show carries a noir-like tension as moral lines blur, personal stakes rise and every clue deepens the mystery rather than resolving it.”\nMysteries and crime stories show no sign of slowing down also beyond “Convictions,” with the likes of “Cold Haven” and “Komar” from Bosnia and Herzegovina also about to celebrate their Berlin premieres in Berlinale Market Selects.\nA slice of Icelandic Noir from Glassriver (“Black Sands”) and Portugal’s SPi, “Cold Haven” probes the immigration experience and the conflict between career ambition and family ties and a deep-felt sense of guilt.\nIn “Komar,” its protagonist looks for answers – this time about her boyfriend, who vanishes alongside his fellow travellers.\nChile’s “Hidden Island” has a detective looking for clues following the disappearance of an archaeologist in search for the mythical place. “It’s inspired by a legend, which talks about the human being, and its connection with the universe. With Chilean DNA for global audiences,” assured showrunner Pablo Díaz del Río.\nMore investigations will come courtesy of Switzerland’s “The Palm Line,” where a journalist needs to take a closer look at the biggest art theft of the 20th century – and find out who murdered her father. The series was presented at the BSM’s Co-Pro Series, now returns completed in BSM Selects.\nTrue Colours’ Managing Director Elliot Gustin-Hollman noted: “The Berlinale Series Market has long been a benchmark for exceptional series, and we’re proud to be part of its selection. We’re confident that buyers will recognize the distinctive quality and international potential of ‘The Palm Line,’ just as we did from the very first scripts.”\nFemale characters to remember will dominate in “The Marquise,” focusing on pioeneering feminist Leonor de Almeida Portugal. Best known as the Marquise of Alorna, the 18th-century poet proved unbound by social conventions. The series has screened in Portugal on broadcaster RTP and Netflix.\nPandora Da Cunha Telles, its creator and producer, noted: “Inspired by true events, but sprinkled with lots of pop music, this series is a deep dive into a colorful world, filled with masks, books, fandangos, watercolors, and piles of macarons. It’s a story about a fierce writer ahead of her time, told in a youthful tone.”\nZuzana Kirchnerová-directed “Monyová” will also delve into the life of a writer: Simona Monyová who became a household name in the Czech Republic. Kirchnerová recently directed Cannes premiere “Caravan.”\n“It was a privilege to bring to the screen such a powerful and emotionally charged female story. I believe the series has strong international potential and the ability to resonate with audiences beyond cultural boundaries, while offering strength and reassurance to those who may recognize their own experiences within it,” she noted.\n“For me, in-depth preparation with the actors was essential, particularly with Tereza Ramba in the role of Simona. She committed to the character with remarkable courage and sensitivity, immersing herself completely in the role and giving everything she had.”\nAccording to Kirchnerová, in the early 2000s Monyová was one of the most widely read female authors in the Czech Republic.\n“Writing popular romantic fiction, she captivated women across generations, even as literary critics often dismissed her work. She lived in a luxury home, owned high-end sports cars, and appeared to embody personal success.” But while her work felt “bold and liberating,” she endured years of psychological and later physical abuse by her husband.\n“When she finally attempted to leave the marriage and filed for divorce, her husband murdered her. Her death shocked the nation and received extensive media coverage. In its aftermath, public discussion of domestic violence in the Czech Republic intensified, leading to greater awareness and a significant increase in reported cases.”\n“K-1,” created by Khadija Alami, will follow a group of highly skilled members as they “occasionally collaborate with Interpol agents and counter-terrorism teams.” “Alongside the high-stakes action of their professional lives, the team members also confront personal struggles – dealing with loss, anger, and feelings of abandonment – which ultimately shape them into deeply human and empathetic characters,” Variety found out.\n“Phoenix,” sold by Mediawan, will also flirt with socio-political issues, showing a group that decides to fight against climate change in a rather unorthodox way: they kidnap children of those who are in power.\n“It’s a bold pan‑European eco‑thriller that combines high‑stakes suspense with urgent contemporary relevance. Conceived as a true Franco‑German co‑production, it features a standout young cast from across Europe and delivers a gripping, premium series with strong international appeal. I’m delighted to present it in Berlin,” admitted Maze Pictures’ CEO Philipp Kreuzer.\n“Raza Brava” also hails from Chile, a country with a bullish trio of series selected for the Berlinale this year, including Isabel Allende adaptation “The House of the Spirits,” from Andrés Wood, announced Wednesday in Berlin Special.\nCreated and directed by Hernán Caffiero, whose “The Suspended Mourning” scooped an International Emmy Award, “Raza Brava” follows a boy from a working-class neighborhood in Santiago de Chile who rises to lead the hardcore fan group of Colo-Colo, one of the most popular soccer teams in Latin America. Erik Barmack’s L.A.-based Wild Sheep Content produces with Chile’s DeCulto, Caffiero’s label, and Atómica, Wild Sheep and Atoómica also being behind Chilean Netflix hit “Cromosoma 21.”\n“‘Raza Brava’ is a story that, although set against the backdrop of football, speaks to who we are as a society: our loyalties, contradictions, and dreams. It is a tale born in Chile, yet it resonates anywhere that sport and popular identity become a mirror of life itself,” Caffiero told Variety.\nStarring Fernanda Montenegro, Oscar-nominated for Walter Salles’ “Oscar-winning “I’m Still Here,””Central Station” and Valentina Herszage, another star of Salles’ “I’m Still Here,” “Emergency 53,” reunites Brazil’s Globo, top independent Conspiraçao and Cláudio Torres, another International Emmy Award winner (“The Invisible Woman”) and Andrucha Waddington (“House of Sands”), all behind ER drama “Under Pressure,” one of Globo’s most succesful series in recent times.\n“So Far, So Good” equally yokes two Latin American powerhouses, Oficina Burman and Cimarrón, both parts of The Mediapro Studio. Created by Daniel Burman – who “Yosi, the Regretful Spy” was commonly regarded as the best series at Berlin in 2022, it sees a cartoonist who, to put it bluntly, finds everyday life a tad overwhelming. But then a hernia “sparks a comedic journey to discover what truly weighs him down.”\n“Middle age doesn’t bring certainty, only more weight: aging parents who depend on us, children who never leave home and expect guidance, while we’re completely lost. ‘So Far, So Good’ emerges in this context,” shared Burman.\nThe series is “the story of Ariel, a newly minted fifty‑year‑old navigating this stage with sharp humor and humanity. A story that aims to connect not only with audiences going through the same thing, but also with older generations and with younger ones, who still have no idea what awaits them,” he adds.\nCo-Pro Series Projects\nThe Berlinale Series Market Co-Pro pitching session is one of its biggest traditions. This year’s selection packs big names and higher-profile international production companies.\nWritten and directed by Mikel Cee Karlsson, editor on Ruben Östlund’s “Triangle of Sadness” and a partner at Plattform Production, also behind Östlund’s first Palme d’Or, 2017’s “The Square,” Plattform’s first fiction series play “A Phone Rings in the Middle of the Night” weighs in as a revenge driven psycho-thriller.\nBased on true events that unfolded in a small Swedish town between 1970 and 2014, “It’s about a man who late in life makes the decision to get back on his childhood bullies so that he finally can move on and hopefully live a normal life,” Erik Hemmendorff, Östlund’s long-time producer, has told Variety. “It’s about how the past still haunt the present and the thin line between victim and perpetrator,” he added.\n“Hedgehogs in the Haze” is the latest work from Bosnia’sDanis Tanović,, an Oscar winner for “No Man’s Land”. It follows three best friends whose lives, caught in toxic relationships and financial struggles, are turned upside down when they discover a small box with controversial contents.\n“Mugre Rosa” is set to be adapted by Alonso Ruizpalacios, known for “La Cocina,” “Andor,” and “Narcos: Mexico.” It adapts Uruguayan Fernanda Trías’ celebrated 2020 novel of the same title, hailed by the New York Times as one of the best Spanish-language novels of 2020. Set in a port city, it turns on a woman who confronts a mysterious plague as her emotional world falls apart.\nElsewhere, the BSM’s Co-Pro Series pitches, a fixture on the TV circuit, will unveil new projects from burgeoning movers and shakers on Europe’s TV scene, such as Switzerland’s Contrast Film, behind “Davos 1917,” and Spain’s Funicular Films, a key producer on Canneseries winner “This Is Not Sweden.”\nWritten by “Tschugger” scribes Christian Wehrlin and Pascal Glatz and Mariama Djité (“Unsere kleine Botschaft”), mini-series “Gold” lifts the lid on the gold trade, driven by Swiss gold trader Anna’s investigations into its dealings. She becomes entangled in a dangerous web of illegal trade, exploitation, corruption and guilt.\nFunicular Films’ “Robbery, Beating and Death” (“Atraco, paliza y muerte”) marks the latest from writer-directors Marcel Borras and Nao Albet, also distinguished Catalan playwrights. It turns on two inseparable friends, played by Borras and Albet, commissioned to write a series about a bank robbery. Their ambition for recognition drives them to unforeseen consequences.\n“Framed as a playful, almost absurd guide to pulling off the greatest heist in the world, ‘Robbery, Beating and Death’ uses comedy to explore universal themes: friendship, family, loyalty, work, art, capitalism, and the contradictions of our industry,” said Funicular producer Marta Baldó. “Like science fiction or dystopia, its meta layer lets us talk about the present human condition with political and philosophical bite.”\nAnother Co-Pro Series project, “The Granddaughter” unites Munich’s Trimafilm, behind Berlin sales hit “3o Days of Lust,” and Ingo Fliess at If… Productions, which produced Ilker Catak’s Oscar-nominated “The Teacher’s Lounge.” “The Granddaughter” marks Catak’s new series. “At its heart is a man who, after his wife’s death, sets out to find her granddaughter – whose existence he was unaware of – and is confronted with a worldview shaped by radical convictions,” Berlinale Series Market announced Thursday.\n“In My Secret Life,” from Icelandic production company Sagafilm, siblings uncover hidden secrets in the life of their comatose father. Sagafilm is one of Iceland’s most prolific film-TV production houses, acquired by “The Walking Dead” and “Invincible” makers Skybound Entertainment, and producer of “Night Shift” and “The Minister.”\nAt Co-Pro Series with “Jomanda,” Lemming Film’s credits including Yorgos Lanthimos’ Cannes award-winner “The Lobster,” while it is now a minority co-producer on Kleber Mendonça Filho’s two-time Golden Globe winner “The Secret Agent.” The series chronicles the meteoric rise and tragic fall of a self-proclaimed miracle healer in the dazzling 1990s.\nPresented at Göteborg’s TV Drama Vision and Karlovy Vary’s Pop Up Incubator, “Angelmaker,” also at Co-Pro, is written by Cristina Groșan for Bucharest-based Tangaj Production. It is inspired by a true story of the Angel Makers of Nagyrév, women from a small town in Romania who poisoned their mensfolk over 1911-29. The number of deaths are estimated between 50 and 300.\n“Mugre Rosa” adapts Uruguayan Fernanda Trías’ celebrated 2020 novel of the same title, hailed by the New York Times as one of the best Spanish-language novels of 2020. Set in a port city, it turns on a woman who confronts a mysterious plague as her emotional world falls apart.\nFrom Tanweer Productions, the Athens-based producer on the lyrical Leonard Cohen true-life love story “So Long, Marianne,” Co-Pro Series project “Antiparos” is sourced from last year’s Series Mania.\nA “darkly comedic mystery,” creator Alexandros Tsilifonis has said, it turns on a verge-of-burn-out detective who returns for rest to his home island of Antiparos. “This contemporary series peels back the layers of an idyllic destination to reveal an unexpected underworld – where intrigue, absurdity, and sharp storytelling collide,” Tsilifonis told Variety.\nBerlinale Series Market Initiatives, Trends\nThis year, Berlinale Market Selects has partnered up with Studio Babelsberg, introducing the Studio Babelsberg Production Excellence Award set to honor one outstanding scripted series from the lineup, “recognizing exceptional producing that combines creative vision, excellence in realization, and an innovative producing approach with international potential,” the BSM announced Thursday.\nConnecting companies working on series projects in the early stages of development, Series Match, Germany & Ibero-America has selected five companies from Brazil, Uruguay, Chile, and Spain: Boutique Filmes, Movioca, Alterna Media, Villano, and Funicular Films. These companies will meet with German counterparts Zeitsprung, UFA, SKP Entertainment, Studio Zentral and Beta Film. More details will be announced shortly.\nAnswering Variety’s questions about the lineup, Jana Daedelow, coordinator at Berlinale Series Market noted that “in times of political turmoil and economic uncertainty, we are seeing a growing number of stories that elevate crime beyond its conventional boundaries, infusing it with a sense of political purpose.”\nShe added: “These narratives place acts of rebellion at their centre, reflecting a broader cultural moment. While this subgenre may occupy a grey area, it is unmistakably present and increasingly marketable, resonating with diverse audiences in today’s zeitgeist. Series such as ‘Phoenix,’ ‘The Palm Line’ and ‘A 100-Million Reward’ exemplify this trend.”\nMedical dramas are experiencing a strong resurgence. “Over the past few years, we have observed them at the market increasingly blended with other genres, particularly crime and thriller. Our selected series ‘Emergency 53’ stands out as a compelling example of this hybrid approach.”\nWhile artistic quality is an important consideration, she admitted, “originality alone is not always sufficient in a market context.”\n“The main criterion at the market is strong market potential. Our focus is on selecting series that can resonate with a wide range of audiences,” said Daedelow. “Whether deeply rooted in a specific local context or built around a familiar atmosphere, each project must demonstrate a strong sense of universality, allowing it to travel across territories. This is a guideline that we’ve worked with for years.”\nTanja Meissner, director of Berlinale Pro, argued that “for both the public facing sections of the Berlinale and the market, serialized storytelling is a core part of the ecosystem.”\n“The creative language of good series sits naturally alongside cinema, and Berlin offers a space where creators who work across these forms can connect and cross-pollinate ideas,” she observed.\n“From a market perspective, the line between traditional feature film and episodic storytelling has become increasingly blurred. Many writers, directors and producers move easily between the two, and much of today’s artistic ambition, narrative risk-taking and audience engagement now happens within limited or episodic series.”\nFor many industry stakeholders, series have become key part of their business, underlined Meissner.\n“Seen this way, including series within the European Film Market and also within the Official Selection of the Berlinale isn’t just logical: it’s essential.”\nBerlinale Series Market Selects Titles\n“A 100-Million Reward” (“Por Cien Millones”)\nSpain\nCreator and director: Nacho G. Velilla\nMain Cast: Raúl Arévalo, Vito Saenz, Gabriel Guevara\nProduction Company: Movistar Plus+ in collaboration with Felicitas Media\nBroadcaster: Movistar Plus+\nWorld Sales: Movistar Plus+ Internacional\nIn 1981, three mechanics from Zaragoza, Alfonso, Jorge, and Gabi, drowned in debt and unemployed, kidnap league top scorer Enrique Castro “Quini”, FC Barcelona’s striker, and demand a great reward for his release.\n“All Heroes Are Bastards”\nGermany\nCreators and director: Esra & Patrick Phul\nMain Cast: Kebir Sargin, David Mayonga, Funda Bostanlik\nProduction Company: Picture Me Rollin, Bildundtonfabrik, ARD Degeto Film\nBroadcaster: ARD Degeto Film\nWorld Sales: Global Constellation\nThree unlikely heroes uncover an artifact that gives them superpowers. They must decide: Will they use their powers for personal gain, or become the last hope of their oppressed community by standing up against a corrupt regime.\n“The Center” (“El Centro”)\nSpain\nCreator: David Moreno\nDirector: David Ulloa\nMain Cast: Juan Diego Botto, Elena Martín Gimeno, Israel Elejalde\nProduction Company: Movistar Plus+ with Fonte Films\nBroadcaster: Movistar Plus+\nWorld Sales: Movistar Plus+ Internacional\nA murder exposes an international Russian intelligence operation and forces the Centro Nacional de Inteligencia team into a race against time to dismantle it while they hunt for a traitor within their ranks.\n“Cold Haven”\nIceland, Portugal\nCreator: Filipa Poppe, Joana Andrade, Sveinbjörn I. Baldvinsson\nDirector: Arnór Pálmi Arnarson\nMain Cast: Catarina Rebelo, Kristín Þóra Haraldsdóttir, Maria João Bastos\nProduction Company: Glassriver (Iceland), SPi (Portugal)\nBroadcaster: Síminn (Iceland), RTP (Portugal)\nWorld Sales: About Premium Content – APC\nA young Portuguese woman is murdered in a small Icelandic coastal town, shaking the community. An Icelandic detective, returning to her hometown, is sent to solve the case, but must also confront her own past.\n“Convictions” (“Emprises”)\nCanada\nCreator: François Pagé\nDirector: Yannick Savard\nMain Cast: Marilyn Castonguay, Éric Bruneau\nProduction Company: Duo Production\nBroadcaster: Radio-Canada/ICI Tou. Tv\nWorld Sales: Reinvent Yellow Sales\nRaphaëlle Bayard’s world is turned upside down when her partner and their son both suddenly disappear without any apparent reason. What follows is a gripping search to find them, to understand what truly happened.\n“Emergency 53” (“Emergência 53”)\nBrazil\nCreators: Cláudio Torres, Márcio Maranhão and Andrucha Waddington\nDirector: Andrucha Waddington and Cláudio Torres\nMain Cast: Valentina Herszage, Fernanda Montenegro\nProduction Company: Conspiração Filmes\nBroadcaster: Globoplay\nThe dramas of the doctors, nurses, and drivers of a special mobile emergency service unit. Unit 53 is made up of brilliant professionals who have, in some way, been cast aside by the system and live to prevent others from dying.\n“La Frontera”\nSpain\nCreator: David Zurdo, Luis Marías\nDirector: María Pulido, Yolanda Centeno\nMain Cast: Javier Rey, Itsaso Arana, Vicent Pérez\nProduction Company: RTVE & PAR\nBroadcaster: RTVE\nWorld Sales: RTVE\nIn 1987, a captain of the Spanish Civil Guard uncovers an imminent ETA terrorist attack in Paris. When the Spanish government refuses to intervene, he takes matters into his own hands, partnering with a French police officer.\n“Hidden Island” (“Isla Oculta”)\nChile\nCreator: Pablo Díaz del Río\nDirector: Rodrigo Susarte\nScreenwriter: Felipe Carmona, Julio Rojas, Juan Dartizio\nMain Cast: Daniela Ramírez, Ana Valeria Becerril, Raúl Méndez, Nestor Cantillana\nProduction Company: Río Estudios, co-produced by Filmo VFX Estudios Broadcaster: Chilevisión3\nWorld Sales: TBC\nIn southern Patagonia a relentless detective investigates the disappearance of a Mexican archaeologist in search for the mythical Friendship Island, where other disappearances and extraterrestrial activity have been reported.\n“K-1”\nMorocco\nCreator: Khadija Alami\nDirector: Tala Hadid and Hamish Said\nMain Cast: Rachid El Ouali and Faty El Jouhari\nProduction Company: KFilms\nBroadcaster: 2m\nAn elite police unit formed by assembling the top officers from various divisions of the National Bureau of Judicial Police. Tasked with tackling major criminal activity, the team travels across Morocco, from the south to the north, as they hunt down powerful figures in organized crime.\n“Komar”\nBosnia and Herzegovina\nCreator: Timur Makarević\nDirector: Timur Makarević, Vedran Rupiić, Unia Gunjak\nMain Cast: Lejla Hakalovic, Pia Vrdoljak, Igor Skvarica\nProduction Company: BH Telecom, Executive Production: SCCA/ PRO.BA\nBroadcaster: BH Telecom\nWorld Sales: Beta Film\nWhen a bus with Mersiha’s boyfriend Miki on board vanishes without a trace in the Komar mountains, she starts looking for him. As the bus travelers wake up in a forest not knowing what happened, the mystery only deepens.\n“The Marquise” (“Leonor, Marquesa de Alorna”)\nPortugal, Spain\nCreator: Pandora da Cunha Telles\nDirector: Tiago Alvarez Marques\nMain Cast: Sara Matos, Cristóvão Campos, Soraia Chaves\nProduction Company: Ukbar Filmes in coproduction with Tornasol Media\nBroadcaster: RTP\nIn 18th-century Europe, a fearless poet defies kings and conventions. Torn between love, art, and revolution, she rewrites what it means to be a woman.\n“Monyová”\nCzech Republic\nCreator: TV Nova, s.r.o.\nDirector: Zuzana Kirchnerová\nMain Cast: Tereza Ramba, Igor Orozovič, Kryštof Hádek\nProduction Company: Film & Roll\nBroadcaster: Oneplay\nShe wrote about love. She lived in hell. In the 1990s, Simona Monyová achieved one of the most fairy-tale career rises – from an ordinary apartment building to the top of the charts and magazine covers. Giving rise to speculation about how much of her writing was inspired by her personal life.\n“The Palm Line” (“La Linea Della Palma”)\nSwitzerland\nCreator: Maria Roselli, Mattia Lento and Thomas Ritter\nDirector: Fulvio Bernasconi\nMain Cast: Gaia Messerklinger, Alberto Malanchino, Luca Filippi\nProduction Company: hugofilm features\nBroadcaster: RSI / ARTE\nWorld Sales: True Colours\nThe troubled journalist Anna investigates the greatest art theft of the 20th century to find out who killed her father. She sees her world turned upside down, as she understands her family’s entanglement into a criminal network. Her quest conjures the wrath of the mafia upon those she loves.\n“Phoenix”\nFrance, Germany\nCreators: Matthieu Bernard, Louis Aubert\nDirector: Franck Brett\nMain Cast: Léo Legrand, Marie Colomb, Will Attenborough\nProduction Companies: Les Films du Cygne, Storia Television, Maze Pictures,\nAuvergne-Rhône-Alpes Cinéma, Sequel Prod\nBroadcasters: France Télévisions, ZDF, New8 Partners\nWorld Sales: Mediawan\nJune 2025. Faced with the inaction of those in power against climate change, Mathias, his sister Éloïse and their friends form the Phoenix group. Their bold plan: to kidnap the children of Europe’s biggest polluters to force their parents, leaders of oil, chemical, and financial corporations, to take real ecological action.\n“The Pushover” (“De Troskyldige”)\nDenmark\nCreator: Arne Berggren, Kristine Berggren\nDirector: Magnus Berggren\nMain Cast: Marie Sandø, Morten Hauch-Fausbøll, Sigurd Holmen le Dous\nProduction Company: Shuuto Arctic AS\nBroadcaster: Altibox, DR, TV 4\nWorld Sales: Reinvent Yellow Sales\nIn an upscale neighborhood, a woman is found drowned in a pool. Suspicion falls on her boyfriend, Tom, a notorious con artist and Tinder-swindler. When he unexpectedly turns himself in, he admits to fraud, but insists her death was an accident.\n“Raza Brava”\nChile\nCreator and director: Hernán Caffiero\nMain Cast: Gabriel Muñoz, David Gaete, and Karla Melo\nProduction Company: DeCulto\nCo-Producer Companies: Wild Sheep Content, Atómica Group\nWorld Sales: The Mediapro Studio Distribution\nIn Chile’s football underworld, Barti, a boy from a poor neighborhood, rises inside Colo-Colo’s violent fan group Garra Blanca after its leader’s death. Power and crime spark betrayal, forcing him to choose loyalty or survival.\n“So Far, So Good” (“El Resto Bien”)\nUruguay, Argentina\nCreator: Daniel Burman\nDirector: Daniel Burman, Daniel Hendler\nMain Cast: Benjamín Vicuña, Rita Cortese, Violeta Urtizberea\nProduction Company: Cimarron, Oficina Burman\nBroadcaster: Flow\nWorld Sales: The Mediapro Studio Distribution\nAriel, a successful cartoonist in his fifties, feels trapped by family and social demands. A hernia sparks a comedic journey to discover what truly weighs him down. Will he regain his freedom – or be crushed by his own life?\nDOCU-SERIES\n“The American Revolution”\nUSA\nDirector: Ken Burns, Sarah Botstein, David Schmidt\nMain Cast: Meryl Streep, Tom Hanks, Morgan Freeman, Samuel L. Jackson, Edward Norton, Ethan Hawke, Laura Linney.\nProduction Company: Florentine Films\nBroadcaster: PBS Distribution\nWorld Sales: PBS\nThirteen American colonies unite in rebellion, win an eight-year war to secure their independence, and establish a new form of government that would inspire democratic movements at home and around the globe.\n“In Pursuit of the True Shaman” (“Gerçek Şamanın İzinde”)\nTurkey, Germany\nCreator and director: Talha Berkay Baş\nMain Cast: Amélie Schenk, Holger Kalweit, Atarsaikhan Luvsandorjiin\nProduction Company: TBB Film, Freunde Des Altai\nWhile the modern world looks for quick escapes from its pain, a filmmaker spends three years in the wilds of Mongolia, living among shamans to discover the true shaman: a living bridge between the visible and invisible worlds.\n“The Struggle for Mother Water”\nCanada\nCreator: Michael Zelniker\nDirector: Michael Zelniker\nProduction Company: Filmoption Productions\nWorld Sales: Filmoption International\nThe series documents the existential struggle confronting over two billion people globally as they seek to secure access to potable water. Understanding that water is life, women worldwide are leading the fight, doing all that they can, so their families can access clean, safe water.\nSelected Projects for Co-Pro Series 2026\n(in alphabetical order of production company):\nGold (creators: Christian Wehrlin, Pascal Glatz; writers: Mariama Djité, Jessica Hagan; director: tba), Contrast Film, Switzerland\nRobbery, Beating and Death (writers/directors: Marcel Borràs, Nao Albet), Funicular Films, Spain\nThe Granddaughter (writers: Annika Pinske, Jacob Hauptmann; director: İlker Çatak), if… Productions, Germany & Trimafilm, Germany\nJomanda! (writer: Thomas van der Ree; director: Joram Lürsen), Lemming Film, Netherlands & Lemming Film Belgium\nMugre Rosa (writer: Gerardo Gatica; writers/co-creators: Manuel Alcalá, Javier Peñalosa; director: Alonso Ruizpalacios), Panorama, Mexico\nA Phone Rings in the Middle of the Night (writer/director: Mikel Cee Karlsson), Plattform Produktion, Sweden\nHedgehogs in the Haze (creators/writers: Džana Pinjo, Ermin Bravo; director: Danis Tanović, Nermin Hamzagić), Realstage, Bosnia and Herzegovina\nIn My Secret Life (creator/writer: Jóhann Ævar Grímsson; director: Hafsteinn Gunnar Sigurðsson), Sagafilm, Iceland\nAngelmaker (creator/writer/director: Cristina Groșan), Tangaj Production, Romania\nAntiparos (creator/writer: George O’Neill-Zafeiropoulos; writer/director: Alexandros Tsilifonis), Tanweer Productions, Greece & Ginger Film Flanders, Belgium & Volteo Media, UK\nBest of Variety\nSign up for Variety's Newsletter. For the latest news, follow us on Facebook, Twitter, and Instagram.",
  "word_count": 5029,
  "scraped_at": "2026-02-14T12:53:52.302233"
}