{
  "article_id": "3bbc5a7bc685",
  "url": "https://theathletic.com/5359583/2024/03/22/men-women-managing-players/",
  "title": "What are the differences between managing male and female footballers ? ",
  "date": "20240322T061500Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "When Tottenham Hotspur Women’s head coach, Robert Vilahamn, was in charge of men’s teams in his native Sweden, he was loud. “I was shouting, pushing,” he tells The Athletic. “You would hear me for 90 minutes, especially out of possession.”\nHe applied the same style when he moved to women’s team Hacken in the Swedish city of Gothenburg. But after they lost a few games, the players, especially those whose positions were close to the touchline, approached him to say they found his yelling “stressful”. Vilahamn took note. “It was necessary,” he says. “I thought, ‘Why don’t they do what I’m telling them to do?’. If I raise my voice with my wife, she doesn’t listen to what I say. That’s probably how those players feel.”\nAdvertisement\nVilahamn is conscious of being a tall man shouting at women with a deep voice and the potential “threat” vibe that may give off. He does not believe you can get the best out of players with such behaviour. The 41-year-old has since adopted a quieter, calmer approach and does not speak as much during games.\n“I’m trying to find ways to reach them without shouting,” he says. “That’s a clear thing I’ve developed during my journey with women’s football.”\nIt is just one subtle difference Vilahamn has found between managing men’s and women’s teams.\nThe Athletic has spoken to 11 managers for this article (not all of them get quoted directly, but rather some conversations were used to help understand the issues), exploring the issues involved in managing men’s and women’s teams. The caveat, of course, is that overlap between the two exists. In addition, most managers who have worked in both environments have only managed at under-21 men’s level rather than first teams.\nSome feel there are no differences and this should be a conversation about how to manage individuals rather than gender being central to the conversation. The same managers, however, have noticed nuances and tendencies which lean towards one environment or the other. One is not good and the other bad, sometimes they are just different and an awareness of that difference can be helpful.\nThe biggest and most common difference cited was that men’s players want to be told ‘what’ to do, while women’s players want to know ‘why’ they are doing a certain exercise. Managers describe women’s players as tending to be more “curious”, “inquisitive” and likely to ask more questions. Having that dialogue enables a “huge buy-in”, according to Manchester City Women’s manager Gareth Taylor, but some managers have said women’s players can tend to overthink.\nAdvertisement\nLydia Bedford, former manager and assistant manager with Leicester City Women and Arsenal Women respectively and now head coach of Brentford Under-18s on the men’s side, believes her current team are less likely to challenge the ‘why’ and overall ask fewer questions.\n“They will go out and execute it and be able to take that on board,” she says. “They pick up drills quicker in that sense. They listen and put what you ask on the pitch more naturally.”\nLeif Smerud is a clinical psychologist and former player who, at various times over the past 10 years, has been interim head coach for both Norway’s men’s and women’s senior teams, as well as the head coach of the under-21 men’s team. His experience is that the reason female players tend to want to know the ‘why’ is because they want to know what is the right thing to do before embarking on a task.\n“Male coaches stepping into women’s football for the first time will have a steep learning curve on some of these issues,” he says.\nUnderstanding the rationale can create structure, says Smerud, who has coached Norwegian stars such as Erling Haaland, Martin Odegaard, Ada Hegerberg and Guro Reiten. But he has found women players are less likely to take risks and make their own decisions, whereas male players will do that more naturally.“Women players play by the map but not the situation,” he says. “If you have players sitting back and waiting for the right thing to do, it’s too slow for top sports.”\nVilahamn is trying to cultivate an environment at Tottenham in which there is no right and wrong and where initiative and freedom are encouraged.\n“You should be brave enough to dare to do,” he says, citing 20-year-old England international Grace Clinton, who is at Spurs on loan from Manchester United, as an example. “I want her to feel she can make choices and perhaps she should have taken another choice, but that’s not right or wrong, it’s decision-making.”\nAdvertisement\nAs a consequence of wanting to do the right thing, Smerud has found women more often seek the manager’s feedback to gauge what they, the perceived holder of the correct answer, think about them. By deferring to the manager’s opinion like this, Smerud has found his female players have been more hesitant to give their thoughts and instead look to do what they think is considered to be the right thing.\n“If I put a male player on the bench or out of the squad, they will think the coach is the idiot,” he says. “But female players are more likely to think they themselves are doing something wrong.” Smerud has found women will be more introspective and ask: ‘What did I do wrong?’.\n“There is less accountability for the men and more accountability for the women and it can go too far,” he says.\nBedford has noticed similar trends.\n“I’ve found boys to be more confident of their own ability,” she says. “They really believe they have the skills to make it. In contrast, some of the senior women who are at the top level are self-critical, will find the negative before even thinking about what they have done well, and take things more personally.\n“Boys are more likely to be critical of other people. When you ask them to reflect on what they need to improve on, they find that a lot more difficult.”\nSmerud has been in that young male environment where a lot is at stake.\n“They come in with big eyes, the dream to be a Premier League player or play for the national team and they are so eager,” he says. “It’s just full of hormones, money, agents and parents who have all these ambitions.”\nHis focus with the Norway Under-21s men’s side was to put the team first while respecting individual ambitions.\nTalk of money and agents raises an important issue.\nThe men’s and women’s games are at different points of development and an understanding of women’s players’ lives is vital, from research into their health to maternity provisions and from player transfers to the effect on mortgages.\nAdvertisement\nChelsea Women’s manager Emma Hayes thinks it is critical to have women in leadership positions around her team because they may empathise with players “just by virtue of being a woman”.\n“Most importantly, it’s about having knowledge around women,” Hayes says. “There is no point having a single knowledgeable person. It has to be a cultural thing.” Hayes ensures all her staff members are educated on women’s specific performance needs — the effects of the menstrual cycle being one example.\n“Whoever’s working in a women’s team, you must always fundamentally ask the question, ‘Women are not small men so are we doing what we do because it’s always been done that way or are we doing it because they did it on the men’s side?’. We have to constantly challenge the notion.”\nWest Ham Women’s manager Rehanne Skinner also highlights the “whole lifestyle difference”. She talks of “the finances attached to it, the things that allow players to focus on performance, the resources”.\nSkinner names player transfers as just one example. “It’s not something they’re able to do just on a whim,” she says. “It has a massive impact on something as straightforward as how many months you’ve paid rent on your property before you have to go and move. Those are very real factors in the women’s game that are less of an issue from a financial standpoint across the men’s game.”\nThis context is perhaps why Manchester City’s Taylor, among others, has been “blown away with the level of application from female players” who “absolutely give everything to being as successful as they possibly can be”. By contrast, the male academy players he has worked with “get a little bit of success and think they’ve made it”.\n“With the girls, there is a lot of humility,” Taylor says. “They’re constantly striving to improve.”\nAdvertisement\nOne of the biggest stereotypes around the difference between the genders is that women are more emotional than men.\n“I don’t mind saying this because I’m a female, but females are emotional, aren’t we?” says Aston Villa Women’s manager Carla Ward, who believes there are “huge differences” between the two environments. “Sometimes we need an arm around our shoulder, some days we need a kick up the backside. We need to be understood — we’re complex compared to males.”\nIt was the biggest change for Spanish side Athletic Bilbao Women’s manager David Aznar, having previously worked in male youth football. “I honestly believe coaching in women’s football requires more sensitivity to the players,” he tells The Athletic. “Women are more emotional than men and this was the main adaptation I experienced.”\nVilahamn is of a similar opinion: “It’s more black and white in men’s football, not too much emotion. The group dynamic with the women’s team, there are even more emotions, more relations, they are actually hanging out. In men’s football, they don’t go too deep into their relations.”\nBedford — who at her first game of the season as Brentford Under-18s coach was asked by an official where their manager was, to which she replied: “You’re looking at her” — believes “you can be more direct with the boys” and suspects that is because they have grown accustomed to a more assertive management style.\n“They don’t take it personally,” she says. “And between each other, if one of them tells the other it’s not good enough, they can have a go at each other, kick each other and then it’s forgotten. With women, if you were really to pull someone up on something, it is often harboured over a period of time.”\nSmerud believes there is a variation in sensitivity but maintains men have just as much emotion as women. “We just don’t know it,” he says. “There is less of a tradition of showing and knowing emotions. They don’t necessarily know how to communicate it very well. It’s a different way of dealing with emotions.\nAdvertisement\n“There is so much power in getting the emotional climate right, which means we need to accept emotions, but we cannot be controlled by them. That’s a huge part of how I manage. One thing is to find the height of the back four in defence. Another is to find the height of the emotional temperature in each player and the team. It’s two sides of the same coin. You work with the players, the football and humans.”\nThe word “human” is one Mikey Harris, who moved from Brighton & Hove Albion men’s academy to take interim charge of their women’s team last month, constantly refers back to. “You’re dealing with human beings,” he says.\nHarris, known as Mindful Mike because of his love of meditation, emphasises the importance of self-awareness and emotional intelligence in both the men’s and women’s games. “Be curious,” he says. “Find out about them, show them you care, try to help them, (and) challenge them at the right times, once you’ve built that rapport.”\nOne of Hayes’ key points is also managing individuals, irrespective of gender.\n“I’d need to know more about your personality profiles, how you react to stress or in a crisis to be able to get the best out of you,” she says. “I’ve got many males on my staff that can be a lot easier to manage than some of the women, and vice versa. It’s not always a gendered conversation, you need good emotional intelligence and communication skills to be a good manager. They are as important as your tactical and technical application.”\nA key part of Harris’ management style is creating a psychologically safe environment. “I want staff and players to come into that as their authentic selves,” he says. “When you’re pretending to be someone, or you feel like you have to be a certain way because the environment dictates that, that’s really exhausting.”\nSmerud believes women’s teams are generally more risk-averse and therefore there is perhaps a greater need to create an even safer environment. “To be clear and firm creates safety,” he says. “If it’s unclear, that’s not safe. You need to establish a firmness around how we behave and values.”\nAdvertisement\nThis is reminiscent of England Women manager Sarina Wiegman’s style. She provided clarity for the players, much to their liking, when first appointed in September 2021.\nClarity is one thing, caring is another, according to Smerud.\n“It’s also to tell each player, ‘I’m here to get to know you and help you’,” he says. “The first thing I tell every player I work with is, ‘I need you to be the best version of yourself and the team-player version. Be who you are, do what you think is right. It’s my job to adjust. If I want you to change something I’ll tell you, but the strength of a team is people being different and you need to be you’. That creates initiative. That is vital.”\nOne way Vilahamn could get a sense check from his men’s teams was by being in the dressing room. “You are directly getting feedback at half-time or after a game because you could be in and around the players,” he says. “You can be involved and listen to their frustration, which is useful as a coach because I can use that information.”\nHowever, a male coach cannot be in a female dressing room, or vice versa, when players are getting changed. The same applies in youth football, for safeguarding reasons. Managers who are a different gender to their team tend to go in a couple of minutes before the game and at half-time, then conduct their post-match talk out on the pitch.\n“I can’t really get the feeling about what they’re discussing,” says Vilahamn. “How nervous are they before the game? What do they talk about? The only time I get their emotions is half-time, which I like because I want to hear their thoughts. You become separated from the team more than in men’s football.”\nAt the beginning of his time working in the women’s game, Vilahamn found this tricky, but gradually he cultivated an environment in which he trusted his leaders in the team and female staff members. Bedford and Harris, however, do not find any difference and use the same windows of time to interact with the players whether they are working in the Women’s Super League or with male academy teams.\nAdvertisement\n“I wouldn’t spend my time in the changing room,” says Harris, while Bedford, from her experience, knows that the people most likely to pick up on subtle behaviours among players are physios and sports scientists. “As long as you trust those people to share what’s appropriate,” she says.\n“Players should have a safe space which is theirs. I don’t need to see or hear what emotions they choose to have in those moments. I’ve never felt like I can’t do my job properly as a result of being a female needing to go into a male changing room.”\nAll the managers we spoke to referenced “common sense” in terms of knowing when to go into the dressing room. They established a routine via clear communication between staff and players: a knock on the door, a member of staff of the same gender as the players checks everyone is dressed, double checks are made, then the manager goes in.\nAnd what about the football? Well, the majority said there were more similarities between the two games on the pitch than off it. Vilahamn and Bedford noted the physiological variations of strength and speed, while Smerud said he adopted the same playing models.\nWhat is clear is that none of this discussion has been on the curriculum for these managers’ coaching courses, but many said it would have helped.\nHayes found there were just “token gestures” to the women’s game without understanding the application of how you may manage men or women differently and wants more courses to be focused on “managing human beings, not managing the business or how to put the ball in the back of the net”.\n“I don’t think any coaching course really teaches you to manage players, how you interact with someone, whether they’re male or female,” adds Bedford.\nThe similarities and differences across men’s and women’s football should be embraced and the increasing cross-pollination between men’s and women’s football managers provides an opportunity to learn from one another.\nAdvertisement\n“Many of the things I’ve experienced as helpful and important in working with the women are now very good in the more modern men’s game,” says Smerud. “That’s a huge difference between the old men’s dressing room and the new one.”\nWhen managing men’s and women’s teams, Smerud always uses his knowledge of these general adaptations as starting points. “It’s balancing,” he says. “I adapt going in, but then it’s about reading (the situation). As a coach and leader, be aware of the different tendencies and use it in a good way.”\nGO DEEPER\n'Player relationships in a team can work - just talk about it and be open'\n(Top photos: Getty Images; design: Eamonn Dalton)",
  "word_count": 2964,
  "scraped_at": "2026-02-14T12:57:11.327152"
}