{
  "article_id": "3bd8c519c3d8",
  "url": "https://packagingeurope.com/features/the-story-behind-pepsicos-innovative-packaging-projects-at-the-2023-champions-league-finals/9916.article",
  "title": "The story behind PepsiCo innovative packaging projects at the 2023 Champions League finals | Article",
  "date": "20230612T103000Z",
  "domain": "packagingeurope.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "For this year’s UEFA Champions League finals, PepsiCo unveiled two innovative packaging projects. At the Women’s final, a returnable system was trialled, while at the Men’s final, recyclable and biodegradable fibre cups were used across the stadium, festival, and fan meeting points.\nWhat goes into planning initiatives like this, and how do they fit into PepsiCo’s wider sustainability strategy? We had a conversation with Archana Jagannathan, Chief Sustainability Officer Europe at PepsiCo, and Mark Kirkham, PepsiCo’s Chief Marketing Officer, to find out.\nTo start things off, could you give us an overview of the returnable packaging system that was in force at the women’s Champions League final?\nMark Kirkham: This year’s Women’s 2023 UCL Final in Eindhoven marked the first UEFA final where returnable packaging solutions were used for both food and drinks. All PepsiCo beverages were delivered to PSV Stadium in 0.5l 100% rPET bottles and poured into reusable eco-cups that will remain at the stadium for use at future events.\nThese rPET bottles will be recycled, while approximately 52,000 0.40L transparent returnable cups were used. Fans in the stadium were charged 1 Euro for each reusable item and received the money back by tapping their payment card to the payment terminal once returned.\nSimilarly, to the returnable cups, Doritos Nachos were served in returnable trays throughout the stadium as a pilot initiative to test operations and reduce the number of single-use packages.\nWe’re looking forward to analysing and learning from the results of these innovative pilots once we receive the final data.\nHow does returnable and reusable packaging fit into UEFA’s overall ‘zero waste to landfill’ strategy?\nArchana Jagannathan: We are honoured to be a UEFA partner since 2015 and work collaboratively with them on our common goals to better people and our planet through community and sustainability efforts. In 2022, we worked closely with UEFA to implement circular economy practices at the 2022 UEFA Champions League final and are excited to work alongside with them again this year with even more effort.\nThe Zero Waste to Landfill efforts are tied into UEFA Circular Economy Guidelines, as part of a wider sustainability strategy to meet specific targets by 2030. The guidelines help national associations, leagues, clubs, partners/ sponsors, event organizers and other football stakeholders start the journey towards the aspirational target of zero plastic waste and food waste – within UEFA, across UEFA events and collaboratively across European football – by 2030.\nIn 2024, UEFA will pilot a new initiative, ‘Zero Waste to Landfill,’ at the UEFA Champions League final in London. The overall goal is for this to be regularly implemented from 2026, with zero waste to landfill becoming a requirement included in the selection of the hosting stadium, and across all UEFA events over the following years.\nThe data collected at both the Men’s UCL Final at Istanbul’s Atatürk Olympic Stadium, and the Women’s UCL Final at PSV Stadium in Eindhoven, will be analysed in order to pave the way to greater adoption and ensure the zero waste to landfill objective for 2026 is permanently achieved. The data will also be used to define a baseline for improvement actions that will form the basis of UEFA’s Guidelines for Circular Economy in food and beverage in football matches.\nWhile both PepsiCo and UEFA are passionate about making positive changes, we recognize that we need the support and action from fans to really move the needle. We’re working together to educate consumers and encourage more sustainable behaviour during the tournaments while creating an unforgettable fan experience.\nThis ongoing work between PepsiCo and UEFA is an important step in UEFA’s mission to inspire, activate and accelerate collection action to protect the environment within the context of European football. All data collected from such piloting programs is invaluable and enables both brands to tackle the issue surrounding plastic and food waste, and ultimately, aid eventual steps to achieving zero waste to landfill.\nLet’s focus on the men’s Champions League final now. First off, could you give a brief summary of the packaging strategy that will be employed there?\nMK: All beverages under the PepsiCo trademark will be delivered to UCL stadiums and surrounding events in 100% rPET bottles and poured into recyclable and biodegradable fiber cups to be used across the stadium, festival and fan meeting points.\nIstanbul’s Atatürk Olympic Stadium will also be provided with 220 recycling bins to collect the cups and crisps bags, along with any other plastic and paper material, that will then be diligently sorted out post-event.\nCrisp bags will be disposed in recycling bins, with empty bags being sorted post-event, leveraging existing waste management streams. To make recycling easy and convenient for fans as they enjoy the full UCL Final experience, recycling bins will be available across the Champions Festival and fan meeting points.\nOutside of the stadium at the Champions Festival, PepsiCo is partnering with an innovative start-up, TURN, at its sampling stands where we’ll use TURN bins and 48,000 TURN reusable cups. TURN bins will carry QR codes enabling a reuse and reward mechanic for attendees to use via apps and mobile devices. Everyone who recycles a cup within these bins will be rewarded with a smartphone wallpaper and will have the chance to win UCL Final tickets through a daily draw. It’s a win, win for everyone.\nAcross all efforts, our goal is to make things as easy and convenient as possible for fans so they can make sustainable choices without thinking too much about it.\nCould you tell us more about the fiber cups that will be used – why were they selected over alternative materials?\nAJ: Recyclable and biodegradable fiber cups are to be used across the stadium, festival and fan meeting points in Istanbul. Simply, fiber cups are more easily recyclable than traditional paper cups which often contain a plastic layer. Fiber cups are fully recyclable and are fully biodegradable. When taking into consideration the stadium environment and local recycling infrastructure and processes, we determined fiber cups were a great option.\nHow does the process actually work from start to finish, at each step of the journey?\nAJ: For Istanbul, the first part of the journey is the delivery of all our beverages under the PepsiCo trademark to UCL stadiums and surrounding events in 100% rPET bottles. These beverages will then be poured into recyclable and biodegradable fiber cups to be used across the stadium experience, Champions Festival and two fan aggregation points.\nAlong with this, Istanbul’s Atatürk Olympic Stadium will be provided with 220 recycling bins to collect the cups and crisps bags, along with any other plastic and paper material, that will then be diligently sorted out post-event. Bins are also going to be available across the Champions Festival and Fan meeting points in Istanbul.\nWhilst at the Champions Festival in Istanbul, PepsiCo is partnering with an innovative start-up, TURN, for sampling PepsiCo products, where TURN bins and TURN cups will be available. TURN bins will carry QR codes enabling a reuse and reward mechanic for attendees to use via apps and mobile devices. Everyone who disposes a cup within our bin will be rewarded with a smartphone wallpaper and there will also be a daily draw to reward fans with UCL Final tickets.\nFor Eindhoven, the beginning of the journey also starts with the arrival of all PepsiCo beverages to the stadium in 0.5 100% rPET bottles. From there, the beverages will be poured into the reusable eco-cups that will get to remain at the stadium for future events. The reusable Doritos Trays will also remain at stadium for future use.\nIf you liked this article, you might also enjoy:\nMcKinsey on whether or not on-pack sustainability claims affect consumer spending\nA deep dive into the most important packaging sustainability trends and solutions",
  "word_count": 1298,
  "scraped_at": "2026-02-14T12:45:57.023238"
}