{
  "article_id": "3c372f1627d5",
  "url": "https://news.yahoo.com/did-utah-defense-perform-season-214500527.html",
  "title": "How did Utah defense perform this season ? ",
  "date": "20231228T234500Z",
  "domain": "news.yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "How did Utah’s defense perform this season?\nThis article was first published in the Ute Insiders newsletter. Sign up to receive the newsletter in your inbox each Wednesday night.\nEditor’s note: This is the second article in a series wrapping up Utah football’s 2023 season.\nFor all of the offensive woes this season for the Utes, Utah’s defense won it — and kept it in — games when the other side of the ball was faltering.\nUtah allowed just 19.3 points per game this season, ranking No. 21 in the NCAA. Against some of the best quarterbacks in college football, the Utes allowed 224.4 passing yards per game (65th in the country) and only 82.8 rushing yards per game (fourth in the country).\nOnly four opponents — USC, Oregon, Washington and Arizona — scored more than 21 points against Utah, providing a lifeline for a floundering offense that averaged just 23.1 points per game (96th in the nation).\nRelated\nHere’s a look at how each position group on the Utes’ defense performed in 2023.\nDefensive line\nUtah delivered 36 sacks this season, down from 41 a year ago and 42 in 2021, but still a solid number, ranking No. 17 in the nation. In addition to the 36 sacks, Utah forced 130 quarterback hurries in 2023.\nThe defensive front was excellent against the run all season long, holding seven opponents under 100 yards rushing, including three opponents — Florida, UCLA and Colorado – under 40 yards on the ground.\nLeading the way for this group was defensive end Jonah Elliss, who earned consensus All-American status and finished first in the nation in sacks per game (1.2) for a total of 12 sacks over his 10-game season.\nMore in Sports\nBarcelona fans tear into several players amid Atlético disaster\nBYU transfer defensive end Logan Fano was probably the second-best player along the defensive line this season, with 14 tackles (four for loss), 3.5 sacks, two forced fumbles and a fumble recovery. Fano’s season was cut short after he tore his ACL five games into the season against Oregon State, but he figures to be a key piece on the defense line going forward.\nVan Fillinger and Connor O’Toole were other key pieces at defensive end, while redshirt freshman Keanu Tanuvasa started every game and Junior Tafuna started the majority of games at at defensive tackle.\nThere were a couple of games where Utah’s defensive pass rush was neutralized, like against Oregon, but overall, it performed well this season.\nPosition MVP: Jonah Elliss. The consensus All-American had one of the best seasons in school history by a Utah defensive linemen, totaling 12 sacks, 37 tackles (16 for loss), a forced fumble and three pass deflections.\nLinebackers\nUtah is usually solid at linebacker and this season was no different.\nLander Barton made the sophomore leap, starting Utah’s first seven games before suffering a season-ending injury during the win at USC. Barton had 34 tackles, a forced fumbles and two interceptions (including a pick-six).\nKarene Reid and Stanford transfer Levani Damuni both had good seasons, with Damuni taking on an increased role after Barton’s injury.\nReid was one of the defense’s leaders, totaling 67 tackles (two for loss), a pick-six, five pass deflections while providing solid coverage. Damuni led the team in tackles with 87 (2.5 for loss) and 0.5 sacks and really came into his own in the second half of the season.\nIn a two-linebacker scheme most of the time, Utah had three starting-caliber players. All three will be returning to the school next season.\nPosition MVP: Karene Reid. Provided a steady presence at linebacker all season long while having the lowest missed tackle percentage (5.6%) on the entire team.\nCornerbacks\nIf there was an area of weakness on Utah’s 2023 defense, it would be pass defense. Part of it was that Utah went up against some great quarterbacks this season — Heisman Trophy finalists Bo Nix (Oregon) and Michael Penix Jr. (Washington), USC’s Caleb Williams and Arizona’s Noah Fifita.\nBut there were also times this season where cornerbacks were out of position and had coverage lapses, leading to the 224.4 passing yards per game.\nZemaiah Vaughn, who was attracting some NFL interest this season, led the group this season as the Utes replaced NFL-bound cornerback Clark Phillips III by committee. Vaughn had 53 tackles (five for loss), 0.5 sacks, an interception and six pass breakups this season while being Utah’s best cover cornerback.\nThe most veteran of the group, JaTravis Broughton, struggled this season, earning a 45.7 defensive grade from Pro Football Focus — the lowest on the team and one of the lowest nationally among cornerbacks this season. Ole Miss transfer cornerback Miles Battle saw a big role this year, shoring up the position and playing 456 snaps this season while totaling 32 tackles, an interception and three pass breakups.\nTao Johnson started at nickel back the whole season, playing at safety in some packages, and turned in a good performance in his redshirt freshman season with 33 tackles (1.5 for loss) and five pass breakups. True freshman Smith Snowden also played 104 snaps at nickel back and could potentially take over the position if Johnson moves to safety next season.\nPosition MVP: Zemaiah Vaughn. Could be consistently counted on at cornerback, playing the second-most snaps on the team, 616, just behind Reid at 677.\nSafeties\nUtah will need to replace its two starters at the position next season, as Cole Bishop and Sione Vaki both declared for the NFL draft.\nBoth players gave the Utes’ defense a boost and were named All Americans — Bishop on the College Football Network Second Team and Phil Steele Honorable Mention and Vaki on the Sports Illustrated Second Team, Sporting News Second Team and Phil Steele Third Team.\nBishop finished the season with 60 tackles (6.5 for loss), three sacks, two interceptions, five pass deflections, a forced fumble and two fumble recoveries, while Vaki had 51 tackles, 8.5 tackles for loss, two sacks, an interception and three pass deflections.\nThe two continued Utah’s trend of good safety play and are in a position to play at the next level.\nPosition MVP: Sione Vaki. In addition to being a key part of Utah’s backend, he also played offense this season, totaling 317 yards and two touchdowns on 42 rushes, plus 203 yards and three touchdowns on 11 receptions. Through it all, he never slipped on defense despite an increase in workload.\nIn case you missed it\nUtah running back Ja’Quinden Jackson has entered the transfer portal, according to multiple reports.\nThe quarterback-turned-running-back gutted through an ankle injury this season, starting 12 games. He carried the ball 161 times in 2023, gaining 797 yards and scoring four touchdowns.\nFrom the archives\nRelated\nExtra points\nWhat Blake Anderson said about playing Utah next season (Deseret News)\n3 things we learned about Utah women’s basketball during nonconference play (Deseret News)\n3 things we learned about Utah basketball during nonconference play (Deseret News)\nUp next\nDec. 29 | 6:30 p.m. | Men’s basketball | vs. Washington State | @ Salt Lake City\nDec. 30 | 1 p.m. | Women’s basketball | at Colorado | @ Boulder, Colorado\nDec. 31 | 4 p.m. | Men’s basketball | vs. Washington | @ Salt Lake City\nJan. 2 | All day | Skiing | 10K Classic Westminster Invitational | @ Midway, Utah",
  "word_count": 1231,
  "scraped_at": "2026-02-14T13:10:08.329597"
}