{
  "article_id": "3c38f2406c11",
  "url": "https://morristowngreen.com/2026/02/05/alice-lloyd-beloved-matriarch-of-the-grand-cafe-family-dies-at-84/",
  "title": "Alice Lloyd , beloved matriarch of Morristown Grand Café family , dies at 84",
  "date": "20260206T013000Z",
  "domain": "morristowngreen.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The song that followed Alice and Desmond Lloyd through a lifetime together first played when they were young and newly smitten, sitting in a Dublin movie theater watching Blue Hawaii.\nElvis Presley’s Can’t Help Falling in Love stayed with them for more than six decades.\n“That song really sums up a lot about who they were,” said their daughter, Allison Lloyd Porter. “They really, really loved each other… they were just soulmates.”\nAlice T. Lloyd died at home on Tuesday, surrounded by family, after a long battle with cancer. She was 84. Her husband of more than 61 years — with whom she built Morristown’s iconic Grand Café — died only weeks ago, in December, at 85.\nA wake for Alice Lloyd will be held this Sunday, Feb. 8, 2026, from 1 pm to 4 p.m. at the Loyola Jesuit Center, 161 James St., Morristown. A funeral Mass is set for Monday, Feb. 9, at 10 a.m. at the Church of the Assumption, 91 Maple Ave., Morristown. Burial will follow at Holy Rood Cemetery, 61 Whippany Road, Morris Township.\nBorn on Halloween 1941, in Dublin, Ireland, Alice was raised in a family of 11 children; she was especially close to her twin brother, Val. She attended Lakelands Convent and later The Holy Faith Convent. From an early age, she was known for her striking looks — often compared to Elizabeth Taylor — and her warm spirit.\nShe worked upstairs in her family’s business, Duffy’s Ladies & Gents Hairdressers, alongside her sisters in the women’s salon, while her father and brothers ran the barbershop below.\nIn April 1963, Alice immigrated to the United States with Desmond, the love of her life. They settled in Madison, welcomed by family, and began building what would become an American success story. Alice worked as a bank teller at the Morristown Trust Company while Desmond rose through the ranks at Rod’s Steakhouse, a launching pad for numerous Irish immigrants.\nMarried in the summer of 1964, the Lloyds forged a partnership that produced four children and an extended family of loyal dining customers. In 1976, Alice and Desmond became U.S. citizens together — a moment they treasured.\n“We were in heaven,” Alice recounted recently to Morristown Green. “We couldn’t believe we were American citizens.”\n“She was the wind beneath his wings,” said Allison, who now runs the Grand Café. “Was it always perfect? Absolutely not…but they stuck together.”\n‘THE BEST GIFT-GIVER’\nThe couple opened the Grand Café in 1981. Inspired by the great dining rooms of luxury ocean liners where Desmond had served, the French restaurant would become a Morristown institution, earning acclaim from Zagat, The New York Times, and others.\nAlice balanced raising their children with a steady role in the business, helping shape the restaurant’s atmosphere of warmth and quiet elegance.\nEmployees stayed for decades. Customers returned for generations. The room felt refined but never pretentious — a reflection of the values Alice and Desmond shared.\nAlways fashionably dressed and ready with an Irish welcome at the door, Alice had a knack for making Friday and Saturday nights feel like “an occasion” for Grand Café guests, recounted her son, Desmond Lloyd Jr.\n“She was able to strike up conversations with anyone and everyone, particularly when customers were waiting too long for a table,” he said. “Mom had a way of defusing that and turning it into conversations that ended up being relationships with people that lasted forever.”\n“She was a great chatterbox — she could talk about anything,” said longtime friend and Dublin native Mary Cullen.\nTopics included sports. Alice’s brother Bob Duffy was a World Cup soccer player, though Cullen remembers Alice as partial to American football and especially, the Masters golf tournament.\nOne thing Alice seldom discussed was her 15-year battle with breast cancer.\n“She always had a smile on her face,” said Collette Mongey, another Dubliner, whose late husband Jim founded Morristown’s Dublin Pub. “It didn’t matter how bad she felt. She would ask you how you were feeling….she was beautiful inside and out.”\nAlice’s oncologist considered her among his most remarkable patients.\nDespite multiple medical issues, she always showed up “looking impeccable, as if she and Desi were going out to a nightclub for a show… She came into my office with a smile, despite what was going on or how she was feeling,” Dr. Ken Adler, now retired, posted on Alice’s obituary.\nBy all accounts, Alice possessed a keen Irish wit, loved a good laugh, and was good company, whether enjoying a ladies afternoon at the slot machines or acting as confidante and counselor to her hairdressers.\nTo her seven grandchildren, she was “Gammy,” the one they secretly hoped would be their “Secret Santa” at Christmas.\n“She was always the best gift-giver,” Allison said.\n‘RAISING SOME EYEBROWS’\nAlice also was deeply faithful. She and Desmond were founding parishioners of St. Thomas More Parish in Morris Township and shared a devotion to the Carmelite nuns at Convent Station.\nHer Halloween birthday earned Alice the affectionate nickname of “the Irish Witch” — “like Glinda of the Wizard of Oz, a really nice witch,” her daughter said. One of Allison’s fondest childhood memories is of her mother driving her across New Jersey, New York, and Pennsylvania to Feiseanna — Irish dance competitions.\nAlice loved to dance herself. Long before Morristown knew the Lloyds, dance played a role in bringing Alice and Desmond together.\nThey met in Dublin while Desmond was working as a waiter. Alice came from a comparatively comfortable Sandymount upbringing; Desmond was raised in Crumlin, a tougher part of the city.\n“They caught eyes and flirted a bit,” Desmond Jr. recounted. “My mom’s with the well-to-do crowd and their flirting raised some eyebrows.”\nWhen Desmond asked Alice to dance one night after work, her friends were surprised — but she said yes. Her family initially scrutinized the young man from Crumlin.\n“They really checked him out,” Alice later said. “But then they really got to like him. One reason was he didn’t drink or smoke. He was very straitlaced.”\nTheir first date was a movie — Blue Hawaii. And there was no turning back. Some things, Elvis sang, are meant to be.\nAlice is predeceased by her husband, Desmond V. Lloyd, and many of her siblings. She is survived by her children: Allison Lloyd Porter and her husband, Michael Porter; William Lloyd; Desmond Lloyd Jr. and his wife, Jeanne; and Michael Lloyd; as well as seven grandchildren and extended family in Ireland.\nMorristown has a long history of people stepping forward in pivotal moments.\nWhen you chip in to Morristown Green, you’re helping your neighbors stay informed, strengthening our civic backbone, and carrying on the spirit that’s defined this town since its earliest days.\nRally for local news.",
  "word_count": 1128,
  "scraped_at": "2026-02-14T12:38:17.387246"
}