{
  "article_id": "3c464e04a488",
  "url": "https://www.thedailybeast.com/russian-boxing-boss-triples-down-on-olympic-gender-drama",
  "title": "Russian Boxing Boss Triples Down on Olympic Gender Drama",
  "date": "20240803T051500Z",
  "domain": "thedailybeast.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Umar Kremlev, the president of the International Boxing Association, continued his gender war against Algerian Olympic boxer Imane Khelif on Friday, going so far as to promise to award Italian Olympic boxer Angelina Carini the money she lost by forfeiting her match with Khelif.\nThe situation has seen conservatives across the world express outrage ever since after Carini tapped out of her match with Khelif after only 46 seconds, exclaiming, “It’s not fair.”\n“I couldn’t look at her tears,” Kremlev said in the statement, referring to images of Carini bawling following her forfeiture. “I am not indifferent to such situations, and I can assure that we will protect each boxer. I do not understand why they kill women’s boxing. Only eligible athletes should compete in the ring for the sake of safety.”\nKhelif, 25, has always competed as a woman, including at the 2020 Tokyo Olympics. In March, she told Unicef that as a 16-year-old that “she managed to excel in football in her rural village in Tiaret in western Algeria, despite football not being seen as a game fit for girls.” According to Unicef, “Ironically it was her ability to dodge the boys’ punches that got her into boxing.” The International Olympics Committee also refers to her as female, despite Kremlev’s accusations.\nKremlev has led the charge against Khelif after he issued a statement in 2023, banning her and her Taiwanese opponent, Lin Yu‑ting, from competing in a boxing competition because he claims they failed a DNA test.\n“According to the results of the tests, it was proved that they (Khelif and Lin) have XY chromosomes. Such athletes were excluded from competition,” Kremlev said in the statement.\nProminent people such as J.K. Rowling, Elon Musk and Logan Paul have all publicly backed Kremlev’s theory about Khelif’s gender.\nDespite Carini apologizing for saying it was “not up to me to judge” if Khelif was a woman or not on Friday, Kremlev insisted on paying Carini for forfeiting.\n“I’m sorry for my opponent, too… If the IOC (International Olympic Committee) said she can fight, I respect that decision,” Carini said in her apology.\nUzbek Olympic boxer Sitora Turdibekova also lost her match against Lin from “Chinese Taipei” on Friday. Turdibekova also left her match crying. Turdibekova will also receive compensation, according to the statement.\nThe statement explained that Carini and Turdibekova would receive $10,000 from the IBA.\nThe IOC backed Khelif and Lin in a statement on X and took shots at Kremlev on Thursday, writing, “these two athletes and were the victims of a sudden and arbitrary decision by the IBA. Towards the end of the IBA World Championships in 2023, they were suddenly disqualified without any due process.”\nKremlev and the IOC have been in a legal battle after the IOC dropped the IBA as the governing body over boxing at the Olympics in June 2023.\nThe IOC cited the IBA’s relationship with Russian state energy company Gazprom, allegations the IBA was rigging matches, a lack of financial transparency and compliance issues with the Olympic charter, according to a 24-page report commissioned by the IOC from May 2023.\n“We highly value the sport of boxing. We have an extremely serious problem with IBA because of their governance,” IOC president Thomas Bach told members during a June meeting, according to the Associated Press.\nThe IBA called the decision a “tremendous error,” and is currently duking it out with the IOC in the Switzerland-based Court of Arbitration for Sport, according to Insidethegames.",
  "word_count": 581,
  "scraped_at": "2026-02-14T12:09:30.090467"
}