{
  "article_id": "3c4a681c2f36",
  "url": "https://www.the42.ie/ireland-hungary-9-6888495-Nov2025/",
  "title": "Ireland end 2025 with behind - closed - doors friendly after week of work , fun and sun",
  "date": "20251129T100000Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "THE GATES WILL be shut at Marbella Football Center this afternoon, as Ireland close out 2025 with a low-key international friendly.\nCarla Ward’s side bookend a training camp in Spain’s Costa Del Sol with this behind-closed-doors game against Hungary.\nPreparation for March’s World Cup qualifiers against France, Netherlands and Poland has been the focus since the squad arrived on Monday, with a capped, official game an added bonus.\n“It gives us a chance to look at things, try something different, and also not give that 1% to the opposition that we’re gonna be facing who play a similar way to Hungary,” Ward explains.\n“It’s really important that we can try new things and adapt the system, without eyes on it.”\nWhile not open to the public — in person or on TV — the media will get a look, with an FAI stream due to be circulated ahead of the 12.30pm [11.30am Irish time] kick-off.\nIreland and Hungary meet for the 10th time at women’s senior level: Ireland won 4-0 and 1-0 in the inaugural Nations League two years ago, and are ranked 20 places higher in the Fifa world rankings.\nWith the full squad fit and available, Ward will shuffle her pack, teasing “six or seven changes” from last month’s Nations League playoff success against Belgium.\nSophie Whitehouse will make her debut in goal, having bided her time since joining the squad ahead of the World Cup and recently impressing at Charlton Athletic, while Abbie Larkin is set to start after her goalscoring heroics from the bench in Leuven.\nFringe players will be given chances, different formations and combinations may be tested. This could be a good opportunity to cap Kelly Brady following her superb debut season in the Women’s Premier Division, and to ease Tara O’Hanlon back to international action after her injury woes.\nRuesha Littlejohn has been in sharp focus this week: the Crystal Palace midfielder is facing an extended ban from club action after a red-card offence on Sunday. She appeared to grab Leicester City’s Hannah Cain around the neck before slamming her to the ground in Palace’s 3-0 League Cup win.\nDuring yesterday’s pre-match press conference on Zoom, Littlejohn shared her “regret”, while Ward blasted the social media abuse the 93-cap international has been subjected to since the incident.\nThe manager has no concerns about playing Littlejohn today: “Ruesha is in the right headspace and is very clear of where we’re at. She’s made a mistake, people make mistakes but life doesn’t stop. She’s a professional and will continue to be one.”\nWith the disciplinary process underway, Littlejohn submitted her response to the English FA before Thursday’s deadline: she accepts the red card and three-game ban, but plans to contest it if extended.\nShe hasn’t reached out to Cain personally — “I thought about it but then felt let’s go down the right channels with everything” — though is “happy that she was fit and healthy” to report for international duty with Wales.\nCain — who scored a penalty in last December’s Euro 2025 playoff heartbreaker — featured in their 1-1 draw with South Korea last night, with the Welsh among several other international sides based in and around Marbella/Malaga this week.\nNorway, Brazil and Denmark have also been mixing training, matches, fun and sun in the region, and using the same complex as Ireland.\nGeneral reports — and social media dispatches — from the setup have been positive, with crucial work done on and off the pitch across the few days. The 42 previously outlined what the training camp would look like.\nWard said yesterday it was “really important” and “massive from a togetherness and culture piece” while Littlejohn reflected on a “great week together in the sunshine”.\nAway from the football, there have been coffee adventures, sea swims and games of Padel.\n(Katie McCabe and Chloe Mustaki claim they took the bragging rights in the latter, if you’re interested.)\nOnwards now to the main event, although it is eerily low-key before the return to Broadway for a blockbuster 2026.",
  "word_count": 676,
  "scraped_at": "2026-02-14T12:13:00.606012"
}