{
  "article_id": "3c55aeeee0f6",
  "url": "https://allafrica.com/stories/202510070412.html",
  "title": "Zimbabwe : Zifa Insists Sheasham Still Part of Football Family",
  "date": "20251007T154500Z",
  "domain": "allafrica.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Zimbabwe Football Association issued a statement yesterday evening, insisting that Gweru Division One side Sheasham are still part of the soccer family.\nOn Saturday evening, soon after their 3-2 loss to Midlands State University in a match they described the officiating as diabolic and fitting into the puzzle that the championship was being chiselled for another side, Sheasham announced their pullout from the Central Region League and their women's from the Zimbabwe Premier Women's Soccer League.\n\"The Zimbabwe Football Association (Zifa) acknowledges receipt of correspondence regarding the reported withdrawal of Sheasham Football Club from the Central Region Soccer League (CRSL). Following a review of the matter, the Association advises that Sheasham Football Club remains a member of the Central Region Soccer League until the issue has been amicably resolved through the proper processes. Zifa further reminds all regional affiliates that any grievances or disputes arising within their jurisdictions should be addressed through the established legal and procedural frameworks of their respective leagues,\" wrote the Zifa media office.\nZifa said after all regional mechanisms have been fully exhausted, should matters be escalated to the national executive.\nKeep up with the latest headlines on WhatsApp | LinkedIn\nMeanwhile, yesterday morning, Sheasham held a Press conference at which they alleged that they were elbowed out of the Central Region League.\nClub chairperson, Reginald Chidawanyika, charged at an allegedly corrupt administration that issued a statement at 0900 hours announcing acceptance of the team's withdrawal.\nAfter the letter was released, questions were raised as to whether the board had made a decision of the office.\nThe board has not yet met to discuss that with Patrick Hill the regional boss yet to respond to a set of questions sent to him on on-goings in his League.\nThere are also allegations adding fuel to the fire that one team recently fielded secondary school boys in suspected connivance with match officials who chose to ignore the absence of licences to deliver the desired result.\n\"A systematic corrupt administration,\" is how Chidawanyika described the Central Region League.\nSheasham were in a thrilling title race for promotion into the Premier Soccer League, together with Kwekwe side Hardrock, being the two main protagonists in the race.\nHardrock leapfrogged Sheasham into pole position on Saturday after a 1-0 win at home against Blanket Mine while Sheasham suffered a controversial 3-2 loss to MSU, which saw Sheasham having two goals disallowed, including what appeared to be their equaliser right at the death.\nAddressing the media in Gweru, Chidawanyika said the manner in which they lost the match was the final straw that pushed them out of football.\nThe respected Gweru lawyer noted that the way in which things have been unfolding, including poor officiating and other irregularities, gives them reason to believe that there is no fair play and the competition is fixed.\n\"Our decision to pull out of the league was made after our win against Chapungu on 1 October, where our president, Mr Clever Mandaza phoned me to say this is a waste of time and resources, let us withdraw,\" Chidawanyika said.\n\"I then convinced him to play as we engage Zifa but after the MSU match we collectively agreed that we can't continue.\n\"As you saw, the region has already wished us well, we wrote to them on Saturday and they responded on Sunday in such a prompt manner. I thought they were supposed to have an executive meeting to ratify the decision, so whether this was an executive decision to accept our withdrawal or an individual, we don't know.\"\nChidawanyika chronicled how as a club they tried to engage Zifa over several irregularities about how the league was run and match officiating dating back to as far as match day eight.\nAt the centre of the Gweru side's grievances is how other teams in the title race, in particular, Hardrock have allegedly been trying to influence the outcomes of Sheasham matches while the league administrators have turned a blind eye to complaints made by Sheasham.\n\"During our match against Grain Tigers at Baghdad Stadium, we saw an official from Hardrock, entering into the referees' changing room and we went over there to ascertain what they were doing and found out that they were the ones responsible for paying match officials for the home side and they gave them US$700 way above the stipulated fees.\n\"I questioned why they were paying above the standard fees for referees to the match commissioner but we never got any plausible explanation. After the match, we submitted our complaint to the Zifa office in Harare because we had been directed to deal with them on issues to do with match officials, \" he revealed.\nSheasham at the press conference assured players and coaches that they would be paid up to the end of their contracts.\nZimbabwe is coming from a bad image era and the new executive led by Nqobile Magwizi is trying hard to fix local football.",
  "word_count": 826,
  "scraped_at": "2026-02-14T12:21:02.151755"
}