{
  "article_id": "3c5b7bb09a7b",
  "url": "https://www.offalyexpress.ie/news/gaa/1924388/relegation-play-off-and-cappincur-loss-were-big-turning-points-for-tullamore-declan-hogan.html",
  "title": "Relegation play off and Cappincur loss were big turning points for Tullamore – Declan Hogan",
  "date": "20251021T210000Z",
  "domain": "offalyexpress.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Declan Hogan leading Tullamore out\nNOW preparing for their sixth Senior Football Championship final in a row, aiming for three in a row and their fourth in that time span, it is very much a golden era for Tullamore – it is certainly the best that anyone alive has seen and is arguably their best ever.\nA remarkably consistent force of nature with the capacity to control games, Tullamore have replaced Rhode as Offaly's dominant force. The presence of some of the best footballers in Offaly is an obvious help but Tullamore are masters at winning all sorts of games, playing to their ability and performing on the big day.\nDeclan Hogan has been one of the stars in their defence and is now aiming for his fifth senior football medal in Sunday's final renewal with Ferbane – he has won in 2013, 2021, 2023 and 2024.\nJust before they reached the 2020 final where they lost to Rhode, Tullamore were in a difficult place. Like Ferbane in 2015, they flirted with relegation in 2019, having to work hard to beat Gracefield in the play off to decide who went back.\nWith respect to Cappincur, they hit a sort of rock bottom a year later when they were beaten by their neighbours in the first round of the championship, 0-12 to 1-8 – that was a fantastic result for Cappincur, a small rural club, a fraction of Tullamore's size. They recovered to make the county final, winning one a year later and sparking this great era but for Hogan and others, those Gracefield and Cappincur games remain fresh in their memory.\nHe grimaced as he was reminded about the enjoyment that Cappincur got out of that 2020 win, saying: “ It was a back to the drawing board moment for us but in hindsight now it was better to get that defeat at the start of the year rather than maybe in the quarter final or semi final. I think everyone went back to the drawing board really after that in the dressing room. To be honest, now that you mention it, it was nearly, it seems like a turning point.”\nHogan added: “If you told me back in 2016, 2017 that I'd contest six county finals in six years I would have been in disbelief really. I nearly would have laughed because it just seemed so far away and that Rhode team were in a really good place still at the time and Ferbane were coming on and it just wasn't happening. It was not from a lack of trying or anything like that. There was good effort being put in but we got to a semi-final in 2018 and to be honest I thought there was green shoots there.\n“Things didn't go well in 2019. I think we actually had a relegation final against Gracefield which is hard to believe now. Six years ago, hard to believe. A decent Gracefield team as well and we had to be on top of the game to win that. But there was good players on those teams. When Niall (Stack) and his team came in, we put the shoulder to the wheel. There were good leaders there in the dressing room I always felt.\n“Obviously there was a couple of guys that came in that were top players as well. I think through the hard work from the boys with the management team and players putting the shoulder to the wheel and ticking all the right boxes we made strides and it's amazing what can happen. When you put the shoulder to the wheel over a long number of years, or a short number of years, you can get yourself into a county final. Anytime you get to a final, you have a chance. That's been our aim really since 2020, get yourself to a final basically and see what happens.”\nThe Cappincur game was the next one after the relegation win over Gracefield and the hangover from having to go through that was still there.\n“That was still in us. We were off the back of 2019, there was still maybe a bit of scar tissue there. At the end of the day we were in the relegation final. Winning games consistently was an issue and in 2020 we got a bit of a run together. We played Ferbane in a penalty shootout, won that. We got to a county final then, Rhode won it but we knew even after that that we weren't too bad. We were probably better than we thought we were previously so we knew if we ticked a few boxes in 2021 we wouldn't be too far off. We've kind of kicked on since I suppose.”\nA long time Offaly defender, a painful achilles tendon injury has restricted Hogan's performances and ability to train in recent years. He spent more time than he would have wished on physio tables – able to get through games okay but in severe discomfort the following day, hobbling around the place.\nThis year he had enough as he attempted to go with Offaly for another year and decided to deal with it for once and all. He had the option of an invasive operation in Ireland but got advice elsewhere and travelled to England for a procedure that has proven to be a great success.\nDeclan Hogan on\nHis intercounty future\nHe wasn't on the Offaly panel this year and at 33 years of age, his county race could very well be run but Hogan has not retired yet and will take any phone call from Declan Kelly or Mickey Harte in the coming weeks with a positive response.\nHe smiled: “I wouldn't say I'm finished just yet. I haven't really thought about it to be honest. I'm playing away with Tullamore. My first aim was to go back to Tullamore. I wouldn't say I've fully drawn a line in the sand or anything like that. I really enjoyed my time with Offaly, my God, some of the best memories I had were in the Offaly jersey. And I said to myself, look, I'll see how the surgery goes, see how the club campaign goes, and look, I definitely won't be closing the door anyway, put it that way. And if the door does manage to, well, if it opens, it opens, but if it shuts, it shuts, and that's life, you know.\n“I'm not naive enough to think I can go on forever or anything like that. Look, I'll put it this way, some of the best memories I've ever had have been in an Offaly jersey and it's a massive, massive draw for a lot of guys and you know, when you see the Offaly jersey hanging on the wall, you want to put it on. It's as simple as that. Look, I'll see, there's a lot of things that probably have to happen between now and then.”\nHis achilles tendon injury\nHe talked about his injury.\n“I'll try and make a long story short. Look, it's no secret I've been carrying an Achilles tendon injury for the last 4-5 years really. I don't consider myself too unlucky with it because I was still able to train, still able to play but it required a lot of hours in the gym and at home just doing a lot of maintenance and rehab and that kind of thing. To be honest, it just kind of came to a head. I was doing a small bit of training with Offaly at the start of the year, this year, and I just knew it wasn't going to be 100% to get me through another club, or another full county campaign and a club campaign. So I went abroad to get best in class expertise, someone to look at it. They were very optimistic, very positive and I got a surgery there.\n“What I was offered in Ireland was a very invasive surgery. I got in contact with a guy in London, he's an Achilles tendon expert and basically offered me a less invasive version. He said I was a perfect candidate for it. When he told me I could be back for the club season, I said, you know, I'll be happy enough with that. Yeah, I was very lucky, met some top people over there and got surgery over there on the 14th of March and four months later I was basically back doing a bit of running and look, with all of these things, there's ups and downs, especially if anyone who goes under the knife knows, there's ups and downs, there's positives, negatives to all of these injuries, journeys of whatever you want to call them.\n“We were coming up towards the Bracknagh match and I had been doing a bit of training, not a whole pile, but I was back on my feet. It was a tiny bit sore in one area that was kind of not really associated with where I got the surgery. It was during the summer holidays so I was lucky enough, I got a flight over to England on I think it was a Tuesday and I met the guy that gave me the surgery and I was going over thinking just you know it doesn't feel 100%. And I was going over there fearing the worst and I was kind of thinking on the plane over, you know, even if I could get back for a semi or even a couple of minutes in a final, if we get there, it would be great. And I'd kind of written off the group campaign, but I went over there and he completely put my mind at ease and he told me it was only a small issue that needed fixing and just implemented the changes to my rehab basically. And I would say five, six days later, I came on against Bracknagh. And two weeks later, then I played a few more minutes against Shamrocks. Two weeks later, then I played the full game against Clonbullogue. And then I got a few proper weeks training between the end of the group and the semi-final.\n“I could really put the shoulder to the wheel then. Because again, with all of these sort of surgeries, there's a time where you have to really put yourself through a bit of the pain barrier to see what you can do, what you can't do. The body's responding really, really well. The boys were slagging me in there, I was only saying to them it's nice to wake up after a training session and a match and not be in severe pain. I'm feeling great, thank God, and definitely over the worst, but it was tough going there, more so definitely after matches. I could play away, no problem, once you got the blood flowing and the adrenaline was up, but definitely the aftermath was tough and I just had to address it and I'm very glad I did now.”\nIs it a regret that you didn't sort it out earlier?\n“With the split season, with the inter-county trend, there's no good time to get surgery unfortunately. It's very hard to find a gap there where you can, even if you were looking at getting surgery in November or December, you're possibly missing a pre-season then for potentially playing with Offaly, or even if you get one then, I suppose I got it in March and ended up missing a lot of the club league campaign. I suppose I wanted to get the surgery as quickly as I could once I knew I needed it. They offered me a date on the 14th of March and I snapped their hand off to be honest. I wasn't going to be waiting for another date because even two or three weeks with rehab and training and whatnot you can get a lot done in two or three weeks. So I snapped their hand off and once they gave me a date I was happy enough to go with it.”\nHis friendship with Tullamore manager Paul McConway\nThis year Hogan is in strange territory to an extent. One of his great friends, and a man he has shared Offaly and Tullamore dressing rooms with for so long, Paul McConway is now the Tullamore manager. The duo have regularly met for coffee over the years, have golfed together and asked has the appointment changed their relationship, he admitted:\n“Definitely when we played we probably met up a bit more. Paul's probably a bit busier now between family and management. It's a full-time role, club management, it's as simple as that. Look, we chat every now and then. We probably chat more at training now, to be honest. Just a few over and backs with regards to just how the team is going and maybe what we need to do ahead of the next match, etc. Paul was an unbelievable teammate, first and foremost. Unbelievable guy to be in beside there. You knew when you were playing in the full back line, you'd look beside, you'd see Paul McConway, you knew you were safe.\n“I learned an incredible amount from Paul. A man that captained Offaly and put in a few incredible performances with Tullamore and Offaly over the years. You can't but admire the man. I think it's fair to say as well that Paul was basically a manager on the pitch for us for so many years and it's no surprise to anyone that he's made the transition into management and he's kind of made a seamless transition really; he's perfectly comfortable in the role and yeah look it's one of those things where you're so appreciative for what happened when he was playing with Tullamore, to have him there beside you as a young guy growing up, an unbelievable role model. I definitely picked so many bits from his game over the years and tried to bring them into my own game.”\nHogan agreed that it can't be easy for a new manager to call out players he played with but stressed:\n“You're going to have to make those hard calls. Ultimately, when you decide, you divide, as they say. That's just the way it goes but look he's perfectly comfortable in that role as I said and he has a top class management team to bounce ideas off there when needs be and he's unbelievably experienced, he's played under some top class managers as well and no doubt he's picked up some some bits from them and you know even over the last couple of years under Niall Stack, you pick up bits and bobs here and there and he has his own style as well. Paul is his own man and he's perfectly comfortable in his own skin and as I said there he's made a seamless transition into management.”\nHe smiled when it was suggested that Paul McConway would have been very much his own man as a player and was well able to separate himself from the wider group mentality. Describing management as a “natural calling” for McConway, Hogan concurred:\n“Paul is his own man and I think it would be foolish to be still too-pally with guys that are still playing. You'd have to make that call and distance yourself from lads at the same time. You know, within reason, we can still come up here and have chats every now and then about whatever's coming up, the Ferbane match coming up or whether it's a semi-final or whatever matches are next on the list I suppose. He made that conscious call when he became manager of Tullamore and more power to him.”\nSix years younger than McConway, Hogan did not rule anything out when asked if he would be following the same path in five years time. A stint as a Tullamore senior hurling selector this year has certainly ignited interest.\n“I don't know about that. Look, I was a selector there with the Tullamore hurlers this year, so I was kind of in with Shane Hand and he was sort of mentoring me for want a better term. That was a great experience. I've been doing the strength and conditioning with the boys now for the last three years. I did two years with Eddie Finnerty just as the strength and conditioning coach, but Shane wanted me to come in as a sort of selector this year. But no, I must say I really enjoyed it because I was injured for a lot of the league campaign and it was a way to get out of the house and get some fresh air and while my mobility was limited, I was in a boot there for a while, so it was nice to get up and just to chat lads. It's one thing I miss, I miss the old hurling scene because I played dual there for a couple of years and just between Offaly and what not and carrying a couple of knocks and niggles I could never really commit fully to a dual club season with Tullamore and I haven't done in a while but yeah it was great to get back involved with the hurling scene and great to learn from a guy like Shane.”\nI presume it's more pleasurable to play football under the new rules?\n“Oh yeah, I think so. There's a bit more excitement, even you can hear it. I think the public have voted with their feet. Attendances are up and there's a lot more excitement there in games. Even our game there against Rhode. Football has probably become a bit more direct, especially at club level. From the games I'm watching, there's a lot more contests. There's a lot more ball being launched in that you have to be ready for it. Obviously a lot more kick outs are going long as well. Look I think people want contests. The public want contests. They want the one v one battles and they're definitely back. Definitely more enjoyable I think.\n“With the old game it became an element, especially at county level, maybe less so at club level, but county level every game was like a game of chess really. People were just getting bored with it. It's not rightly or wrongly, people were getting bored with it. Look, it's definitely opened up things and I think in general the players overall are really enjoying it.”\nIn the last few years, Tullamore were probably quite systematic in their approach, you're probably playing with a lot more flair now. I'm sure you would have been aware of the critics of Tullamore's football, both inside and outside the town. Did that hurt you or was the answer - show me the medals?\n“Well, look, there's an element of that to it. But no, again, from watching other teams in other counties, the top teams, I'm talking county level and club level, there was a lot of teams in that position. There was a lot of teams that were implementing the same style.We actually found a lot of teams sat deep against us. And when teams sit deep, sometimes you've no choice but to keep possession and probe and look for an opening. There was an element of that to it. Look, I suppose there's a reason the rules were changed. It was to make teams come out and probably play a bit more. I think our lads are enjoying the new rules. I wouldn't say they complained about the old rules, but we're definitely enjoying the new rules as of now.”\nPeople had a theory that the new rules would bring Tullamore back into the pack, that you wouldn't be able to adapt, but it suited Tullamore. The people who were really studying Tullamore knew that while the likes of Mike Fox and Dan Fox and a couple like that have really come out of the skin under the new rules?\n“Yeah, but I know from marking those guys in training, they're top, top players. Like every team, there's a couple of guys there that maybe get the limelight every now and then, but I know how good those guys are. If you're marking a Mike or a Dan or a Peter (Fox) or a Harry Plunkett or someone of that ilk in training, you are going to get a tough time. I suppose we know the talent that's within the group and those guys are top, top players. I thought they worked fairly well in the old rules, so needless to say, I think the new rules have opened things up. I know from running around after Mike Fox over the last couple of years, it's that simple.\n“They're not the only ones. I think there's a couple of other lads that have benefited just from the more space, being around. We're lucky, we've a good mobile team. I think we're racking up good scores. At the end of the day, you don't probably win championships without decent forwards. Maybe that's one thing that's been mentioned over the last couple of years that Tullamore don't have forwards but at the end of the day I don't think you can really win anything without a couple of guys who can kick scores. I think we have them aplenty. We have a good spread of scorers to be honest.”\nI've been saying that for years, even if you don't have what people might term a marquee forward, which is debatable because you probably do, but sometimes you look at a score sheet and there's 10 players after scoring. That's something a lot of teams can't do?\n“Yeah, that's it. I think we've shown over the last couple of years that we work quite well as a team. That's the guys that start and that's the guys that come in as well. It's very much a team game and that's been obvious for the last couple of years. It's not just about 15 that play. Again, going back to the last couple of years, in any sport I suppose at the top level, you're going to need a couple of guys coming in off the bench finishing the game for you and thankfully we've had a few. We had it there with Diarmuid Egan and Mickey Brazil there at the weekend. They're great guys to bring in off the bench. They'll be looking for starting roles no doubt over the next 10 days or so. It's nice to have that competition in the panel and it keeps everyone sharp as well, mentally and physically.”\nHow important was it for Tullamore to win that intermediate last weekend to get your second team up to Senior B?\n“Oh look, massive, massive. We've been falling at that semi-final hurdle now for the last couple of years. Raheen played well against us in the semi-final last year out in Clara and we felt it was probably one that we left behind. I think the boys were quietly pleased to get one over Raheen in the semi this year. The intermediates have been unbelievable, even in training there. We can go toe-to-toe with them, whether we're doing a small set of games or drills or whether it's a 15-on-15 game, there's some top players there. They put in a good first half performance against Croghan and deservedly got over the line. I'd say there was a couple of lads there that were disappointed with the second half performance but sometimes that can happen in finals. Once you lift the cup I don't think anyone cares a whole pile but fantastic that they'll be playing Senior B next year.”\nGoing back to the new rules briefly, there's a high penalty for a three man breach. Does it put extra pressure on you as defenders? Do you have one man that sits back and calls it?\n“It's something you'd be chatting about. I've no doubt every team are having the same sort of conversations. When you're in full backline you'll definitely keep an eye out for guys around the half way line just to make sure that things are in check there.\n“It's difficult, it's really really difficult to be honest. I feel for the officials to be honest because with everything that's going on between arcs and kick outs and two points and stuff going on off the ball it's very difficult to get a proper look at all of these things that are happening. It definitely is something you have to look out for because the punishment is so severe. But that's where your training comes back to. Even in your training games now, which have obviously been adapted to the new rules, you'll be practising, making sure lads aren't breaching the half way line.”\nObviously this Sunday you're going for 30, which would be the same as Rhode, you're going for the first three in a row since 1926, it's not something you'd ever need to talk about in a dressing room, but as one of the elder statesmen on the team, would you be conscious of what those type of things mean to the town and the club?\n“I suppose you're conscious that at the start of the year, you know how many supporters there are in the town. You want to do your very best for them but that's in training and that's on match day. So you always have them in mind and you're always talking to guys whether it's in the barbers or the shops or the pubs. They're the supporters and they're the guys that you're doing all the work for. They're the guys you're doing all the training for. When you're going out on the field, be it O'Connor Park or be it O'Brien Park, you're thinking of all of those people because you know they're going to be behind you on match day.\n“Last year I think it was maybe a monkey off the back in terms of doing the two in a row. That was absolutely massive for the group and I think winning the game in Leinster as well was absolutely huge. So that was definitely big, although maybe guys might not like to admit it, it was a bit of a weight off the shoulders I think. And you could almost sense that I think after the Ferbane game last year.\n“Genuinely, people don't even really talk about it in the dressing room, the preparation for every game is more or less the same. You look at the opposition and you look at their strengths, their weaknesses and, no doubt, Ferbane will be doing the exact same for us in 10 days' time. They'll be looking at where they can punish us and they'll be trying to highlight their strengths as well. So, that's just, that's the way the game has gone now. You prepare properly for every single team and we'll be doing the exact same for Ferbane in 10 days' time.”\nSEE NEXT: Offaly women celebrate as Athlone Town complete league and cup double\nObviously you can't see any end to it at the moment but every golden era does end for every club?\n“Of course, everything comes to an end. We've been telling the boys in the dressing room after the match at the weekend, you have to enjoy it. This is the best two weeks of the year to enjoy the build-up to county final day. Remember, not everyone gets to play in a county final. There are guys, their careers go by and they're good footballers, they'll never ever play in a county final so you have to cherish it and relish it and know that it's a special occasion but at the same time you have to be able to park it.\n“The ball is going to be thrown in, there's a goal at either end and there's going to be a winner on the day. Unless there's a replay obviously, someone's going to lift the cup. So you have to put the shoulder to the wheel. And while it's important to enjoy the build up, you have to tune out from a lot of stuff too and you have to really focus on your preparation.”\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nSubscribe or register today to discover more from DonegalLive.ie\nBuy the e-paper of the Donegal Democrat, Donegal People's Press, Donegal Post and Inish Times here for instant access to Donegal's premier news titles.\nKeep up with the latest news from Donegal with our daily newsletter featuring the most important stories of the day delivered to your inbox every evening at 5pm.",
  "word_count": 4846,
  "scraped_at": "2026-02-14T13:33:20.901225"
}