{
  "article_id": "3c82dc3e99e4",
  "url": "https://www.birminghammail.co.uk/news/showbiz-tv/sky-tv-customers-urged-check-29289008",
  "title": "All Sky TV customers urged to check box now after getting  upgrade  ",
  "date": "20240604T081500Z",
  "domain": "birminghammail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "All Sky TV customers urged to check box now after getting 'upgrade'\nThe DAZN app - used by boxing fans around the world - now features on Sky Q, Sky Glass and Sky Stream in the UK and Republic of Ireland.\nSky subscribers have been given a free boost - with the launch of yet another exciting app. The DAZN app - used by boxing fans around the world - now features on Sky Q, Sky Glass and Sky Stream in the UK and Republic of Ireland.\nShay Segev, DAZN Group CEO, said: “This is excellent news for both DAZN and Sky customers. It makes it even easier to access the DAZN app in the UK and Ireland. We are the global home of boxing – more than 150 fights across 2024 alone – and combat sports, and women’s football as well as the Saudi Pro League, Ironman and much more.\n“DAZN’s distribution strategy is to be as accessible to as many sports fans as possible, and Sky’s great technology through Sky Q, Sky Glass and Sky Stream, will help us get into more homes across the UK and Ireland, so even more people can discover the sports entertainment universe we are creating.”\nREAD MORE New work from home rules in UK and employers can take staff to tribunal\nThe app is already pre-installed on Sky devices in Italy. This deal also builds on existing strong relationships with key partners in European markets, whose devices already account for 18 per cent of viewership on German and Italian Living Room devices.\nAs well as boxing, the app offers MMA matchups, the UEFA Women’s Champions League, Ironman, Saudi Pro League and a host of other high-octane sports content. In addition, a host of other sports entertainment services will be available, including betting and gaming, e-commerce, interactive and social media.\nOnce subscribed, DAZN’s app will be available across multiple devices, including mobile, tablet, smart TVs and PCs. Sky customers are able to sign up to DAZN’s service on Sky Q, Sky Glass and Sky Stream, giving access to a huge range of sports content through a range of flexible and accessible price plans - including DAZN’s ever-expanding portfolio of free live and VOD content.",
  "word_count": 371,
  "scraped_at": "2026-02-14T12:47:57.553895"
}