{
  "article_id": "3c8d98c4a4aa",
  "url": "https://wtug.com/ixp/532/p/west-alabama-thursday-briefing-53/",
  "title": "West Alabama Thursday Briefing",
  "date": "20240530T144500Z",
  "domain": "wtug.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "West Alabama Thursday Briefing\nGood morning, it is Thursday May 30, 2024.\nAlabama and UCLA may have to battle more than each other when they are scheduled to play the first game in the 2024 Women's College Softball World Series at Oklahoma City. First pitch is scheduled for 11:00am but the forecast calls for a 40% chance of showers and thunderstorms beginning around 10:00am.\nThere could be delays due to lightning, but the day is not expected to be a washout. The Tide and Bruins should be able to get the game in.\nUCLA is favored in today's game as they are the PAC-12 Champions and are on a 13-game winning streak. The Bruins can score runs in big numbers as they have a .395 batting average, best in the tournament. So, Alabama's top-notch pitching will need to be at their best.\nPitching for the Bruins is stellar also so the Tide bats will need to find a way to consistently get the ball out of the infield.\n-----------\nThe West Alabama Forecast:\nThe multi-billion-dollar tourism business is critical for Tuscaloosa/Northport and the entire state. That is why Gov. Ivey is bringing the 2024 Governor’s Conference on Tourism to the Bryant Conference Center from July 27 thru the 30th. The event will bring some 250 tourism and hospitality industry leaders to town for training, networking and building on previous successes.\nAn employee of The Arc of Walker County is being investigated for financial exploitation. ARC CEO Joanna Brand tells ABC3340 she is disheartened by the investigation but will not let it deter the ARC from its mission providing advocacy and services for persons with intellectual and developmental disabilities and their families.\nArrest warrants are out for former Crimson Tide Football star Isaiah Buggs. He is charged with misdemeanor animal cruelty for leaving two dogs without food and water for days at a house he has abandoned in Tuscaloosa. Buggs is currently on the Kansas City Chief’s practice team.\nTPD continues to search for 75-year-old Moses Lee Jackson who is missing. Jackson is described as 5 feet, 9 inches tall and weighing 150 pounds. He was last seen wearing a red hoodie, khaki pants and a red ball cap. He could be in the McKenzie Court area.\nHurricane Season begins at midnight tomorrow night and ABC3340 Meteorologist James Spann reminds us it is not a short season, \"The hurricane season runs from June 1st through the end of November with August and September being the peak months.\"\nNOAA has issued a significantly above normal hurricane outlook. Currently there are no pre-season tropical issues.\nSeveral callers have reported hearing shots fired in the Holt Community and seeing a law enforcement presence. No other details have been released by authorities at this time.\nTopping Sports News:\nThe trees of Toomer's Corner in Auburn are filled with toilet tissue this morning. They were rolled by Tiger fans celebrating Auburn's first ever Men's Golf National Championship.\nAlabama's Men's team has won two national titles while the women have garnered one NCAA championship.\nThe Alabama Softball Team is coming off an exciting NCAA Knoxville Regional Upset win to send them to the Women's Softball College World Series this weekend. Play begins at 11:00 this morning against PAC-12 powerhouse UCLA. The Bruins were 35-5 this season and have one of the top offenses in the nation.\nBama's pitching will have to continue to be stellar to shutdown UCLA. The Crimson Tide bullpen has allowed just six earned runs over 48.0 postseason innings pitched, good for a 0.88 staff ERA.\nThis is the Tide's 15th all-time time appearance in the College World Series.\nFrom UA Athletics: The National Fastpitch Coaches Association announced its 2024 Division I All-America teams Wednesday prior to the start of the Women's College World Series, with Alabama graduate pitcher Kayla Beaver earning an at-large spot on the NFCA Second Team All-America list.\nThe award is the first of Beaver's career, a graduate transfer this season for the Crimson Tide after playing the past four years at Central Arkansas. She is a two-time NFCA All-Region honoree, winning this season with Alabama and in 2023 with the Bears. This year with the Tide, she is 18-9 with a 1.58 ERA, striking out 178 batters over 186.1 innings pitched.\nHave a tremendous Thursday and ROLL TIDE!",
  "word_count": 719,
  "scraped_at": "2026-02-14T13:12:41.089010"
}