{
  "article_id": "3c9129a7d161",
  "url": "https://www.chattanoogan.com/2024/3/1/483218/Best-of-Grizzard---Cheerleaders.aspx",
  "title": "Best of Grizzard - Cheerleaders - Chattanoogan . com",
  "date": "20240301T153000Z",
  "domain": "chattanoogan.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Latest Headlines\n- Latest Hamilton County Arrest Report\n- Notre Dame, Boyd Buchanan Claim D-II District Titles\n- Mocs Softball Chattanooga Challenge Openers\n- McCallie Leading Baylor In D-II State Wrestling\n- Lee Lady Flames Softball Drop Two Games At North Greenville\n- CSAS's Anthony Named One Of Top Drawer Soccer’s 10 Best…\n- UTC Men's Tennis Drop 4-3 Loss To Visiting Kennesaw State\n- Delta State Scored In the Top Of The 10th To Win 4-3…\n- Lookout Mountain, Ga. To Offer Longevity Bonuses For…\n- UTC Men Entertain Western Carolina On Saturday\n- Friday, March 1, 2024\n- Jerry Summers\nDuring one of his most incendiary articles that allegedly incurred during his career as a columnist, Lewis Grizzard (LG, 1947-1994) fired the first salvo (shot) in a War of Words when he stated that cheerleaders at athletic competitions “were not necessary.”\nIn one of his earliest publications “Won’t You Come Home Billy Bob Bailey” (1980- Peachtree Publishers) LG addressed the large amount of negative mail that he received from the column.\nExamples of such responses:\n“Last football season, I wrote a column in which I implied cheerleaders are a waste of everybody’s time. I received a great deal of mail about the column:\n‘You are a jerk!’- Pipsie McQueen, Farrah Fawcett High, Kilgore, TX\n‘Go blow your nose!’- Precious Sweeney, University of Arkansas at Stuttgart\n‘May Tony Dorsett run over your face.’- Phyllis G. Brown, Kentucky.”\nAlthough the articles were written prior to 1980 cheerleading has become more exciting and serious and on some situations have provided simulated s_ _ _ _ _ _ movements that were formerly available at the non-existing Riverview Art Theater or Classic Cat on Main Street.\n(Two local high school cheerleading squads in this decade got criticized for their bumping and grinding routines at a football game.)\nAlthough the abbreviated outfits donned by beautiful, shapely, and smiling cowgirls are greatly appreciated and may enhance television ratings, the skimpy garb did not distract the Green Bay Packers who soundly out bumped the Dallas Cowboys on January 17, 2024 (and almost cost their head coach his job.)\nThe balance of LG’s charming commentary on the subject follows:\n“I frankly didn't realize people felt that strongly about cheerleaders, so I attempted to enter this season with an open mind.\nSay something nice about cheerleaders for a change, I reminded myself. OK. They don't perspire as much as the players.\nBut that is as far as I can go. This season, I have attended both professional and college games, and I would be untruthful if I said my stance on cheerleaders has changed.\nIt has not. They are still a waste of time.\nOne, cheerleaders don't really lead cheers, because most of the people who go to football games are either too involved in beating the point spread or too bombed to pay attention to them.\nTwo, cheerleaders usually have silly names. Like \"Pipsie\" and \"Precious.\"\nThree, cheerleaders, especially at professional games, do little more than wiggle their navels for a couple of hours.\nFour, most cheers are stupid:\nWiggle your navel left!\nWiggle your navel right!\nWiggle your navel up and down!\nAnd fight! Fight! Fight!\nPressed, I suppose I can abide a cheerleader or two at college games because sis-boom-bah is part of the appeal of the collegiate game, and there needs to be somebody around who remembers the words to the alma mater.\nBut I would like to put all professional cheerleaders on a permanent taxi squad. Autumn Sunday afternoons have become one big pompom shaking in the face of America. There are exceptions to everything, of course; but, basically, when you have seen one shaking pompom, you have seen them all.\nI blame the Dallas Cowboys for this. There was a time when professional football teams wouldn't even think of allowing a group of women to stand around in their underpants on the sidelines and bump and grind for four quarters.\nBut later came National Football League expansion, and a team was placed in Dallas, where the men spend a lot of time out on the range with their cattle.\nSpend enough time out on the range with your cattle, and football won't be enough to occupy your mind totally on the weekends either, Tex.\nThat's how the Dallas Cowboys Cheerleaders came to be. Watch the game, watch the girls, too, and get along, little dogie.\nSoon, practically every team in the league had its cheerleaders, with the notable exception of the Pittsburgh Steelers, who said, \"We're here to play football. Get them broads off the sidelines.\" The Steelers, incidentally, are Super Bowl champions.\nBefore the letters start to pour in again, let me offer my assurance that this column was not written from a sexist point of view.\nI don't like boy cheerleaders, either. Sometimes, you see boy cheerleaders at college games. What bothers me is, what will boy cheerleaders tell their sons when they ask, \"What did you do in the Big Game, daddy?\"\nAnd they will be forced to answer, \"I jumped around like an idiot and screamed my fool head off.\"\n(A retired straight male lady lifter from a prominent SEC Big Orange gridiron cheering squad was quoted as saying that “the athletic moves often provided a spectacular view of the field.”)\nPS: It is up to the subjective interpretation of the reviewers/readers as to whether the bumpers and grinders during the halftime performance at Super Bowl LVIII out twisted (nice term) the Chiefettes or Ninerettes on the sidelines.\n* * *\nYou can reach Jerry Summers at jsummers@summersfirm.com\n- Breaking News\n- 2/14/2026\n- Prep Sports\n- 2/13/2026\n- Sports\n- 2/13/2026\n- Prep Sports\n- 2/13/2026\n- Sports\n- 2/13/2026\n- Prep Sports\n- 2/13/2026\n- 2/12/2026\nThe Grammy Award-winning Turtle Island Quartet will perform Tuesday, Feb. 24 at the University of Tennessee at Chattanooga Fine Arts Center’s Roland Hayes Concert Hall as part of the UTC Live! ... more\n- 2/12/2026\nThe Ringgold Playhouse will open its 2026 Season on Valentine’s Day with the hilarious, romantic comedy \"Boeing Boeing,\" as the company christens a new theatre home in historic downtown. The ... more\n- 2/11/2026\nLee University’s School of Music will welcome pianist Chongxiao Liu and his student, Yuwei Liu, from the Wuhan Conservatory of Music for a guest recital on Wednesday, Feb. 25, at 7:30 p.m. in ... more\n- Copyright © 2026 Chattanoogan.com",
  "word_count": 1069,
  "scraped_at": "2026-02-14T12:47:32.153011"
}