{
  "article_id": "3cb9e9a62289",
  "url": "https://www.krvs.org/louisiana-news/2025-03-20/lsu-walking-double-double-aneesah-morrow-is-closing-out-her-prolific-career-in-march-madness",
  "title": "LSU  walking double - double  Aneesah Morrow is closing out her prolific career in March Madness",
  "date": "20250320T224500Z",
  "domain": "krvs.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "BATON ROUGE, La. (AP) — When Aneesah Morrow, LSU's prolific forward, is around her family, she'll sometimes be teased about her prodigious appetite.\n“She can probably outeat my sons,” Morrow's mother, Nafeesah, said with a laugh this week as she also recalled telling LSU's basketball staff, “you won't have a problem with this kid, I promise you — unless you don't feed her.”\nIt's a fitting metaphor for the hunger with which Morrow — a “walking double-double,” as Tigers coach Kim Mulkey calls her — approaches basketball.\nAlthough the 6-foot-1 Morrow doesn't possess the typical size of a dominant post player, she enters her final NCAA Tournament having led the nation with 13.6 rebounds per game and 27 double-doubles.\nHer career numbers also are notable.\nShe's one of two players in NCAA history (along with former Oklahoma player Courtney Paris) with more than 100 career double-doubles. Her 1,665 career rebounds rank No. 4 in NCAA Division I history.\nJust eight Division I players have ever amassed 2,500 career points and 1,500 career rebounds. Morrow is one of them.\n“There’s nobody that outworks ’Neese. She’s a great leader, a great person,” LSU guard Mikaylah Williams said. “She’s got a really good head on her shoulders. And it’s about everything but her. She’s willing to put all of our needs before her. She’s willing to do whatever the team needs.”\nWilliams also describes Morrow as a person “you go to when you want somebody to tell you the truth and you want somebody to push you.”\nMorrow said that if she were more focused on her impending professional career in the WNBA, she might have been better served playing on the wing — also known as the “three” spot on the court — instead of in the paint.\nBut with rebounding extraordinaire Angel Reese having left LSU for the WNBA last spring, Morrow noted, “my team doesn’t need me to play the three right now.”\n“I need to be as fierce and dominant on the boards as I possibly can be,” Morrow added. “We need that post presence.”\nLSU has gotten that from Morrow — and scoring to boot. She has averaged 18.5 points a game (along with 2.6 steals and 0.6 blocks). She's been named one of 10 semifinalists for Naismith Player of the Year and second-team AP All-America.\nOne area where Morrow arguably has not realized her potential is in the Name, Image and Likeness (NIL) arena. While she welcomes endorsements and has social media accounts, she isn't “really into getting all those followers or doing all that content.\"\n“I just don’t want my life to revolve around social media,” Morrow said. \"I want to be able to get off my phone.\"\nMorrow “doesn’t need the social media platforms to let everybody know she’s a really good basketball player,\" Williams says. “That’s just her keeping her priorities straight. She plays basketball first and whatever comes after that comes.”\nMorrow might not be the most visible women's basketball player during March Madness, which for LSU (28-5) begins Saturday night against San Diego State (25-9).\nOther players — such as LSU guard Flau’Jae Johnson — will appear in national television advertising campaigns more frequently than Morrow will.\n“Do I get the attention I deserve? I don’t really care if I do or not because the numbers don’t lie,” Morrow said. \"It’s not based on opinions. It’s not based on any outside noise. It’s based on what I’ve done.”\nMorrow credits much of her success to her parents. They met at Nebraska, where her mother, who then went by the name Nafeesah Brown, played basketball. Her father, Ed, played football for the Cornhuskers.\nNafeesah, who also is 6-1, averaged 20.2 points and 10.1 rebounds during her senior year of 1993-94. The Chicago native has since been inducted into Nebraska's athletic Hall of Fame and went on to a career as a high school coach and athletic director.\nMorrow said her mother pushed her to “cross-train” by playing multiple sports — namely volleyball, which helped her time jumps to high-point the ball at the net, whether blocking or uncorking vicious spikes.\nHer parents also cultivated her work ethic.\n“When you’re younger, you kind of get mad at your parents for waking you up at six in the morning to go run on the track ... or be on the sidewalk in front of the porch, dribbling,” Morrow recalled. “But it was a way of keeping us active, staying away from our phones. I feel like that’s something that really helped.”\nMorrow began her college career at DePaul, an easy place for family to attend games during her two seasons there. But her parents supported her decision to transfer in 2023.\n“Me and her dad went to college away from home and we thought that was some of the best opportunities for growing up and being an adult,” Nafeesah Morrow said. “I wanted her to have that experience.”\nWith offers from several powerhouse programs, Morrow chose to play for Mulkey, a Hall of Famer who coached three Baylor teams and one LSU squad to national titles.\n“Her personality is a quiet, confident, hard worker — just fights for everything she gets,\" Mulkey said. “She’ll go down in the history of my coaching as one of the all-time greats.”\nWhile there's no shortage of good food in Louisiana, Morrow said she has worked with a nutritionist this season to get lighter and faster. She says she's cut out soft drinks during the season and curtailed her intake of chips and chocolate.\nMorrow was sidelined by a lower left leg injury during the SEC tournament, but expects to play at full tilt in the NCAA Tournament, which she believes LSU can win.\n“If you work this hard throughout the season and you have the talent and ability to win, why not?” Morrow said. “Why not us? We’ve pushed through a lot. We’ve worked through a lot. We’ve had each other’s back. ... When you show that on the floor, it can be scary. And that’s what we need to display in March Madness.”\n___\nGet poll alerts and updates on the AP Top 25 throughout the season. Sign up here. AP women’s college basketball: https://apnews.com/hub/ap-top-25-womens-college-basketball-poll and https://apnews.com/hub/womens-college-basketball",
  "word_count": 1040,
  "scraped_at": "2026-02-14T13:18:38.489702"
}