{
  "article_id": "3cd58863adf7",
  "url": "https://www.usmagazine.com/entertainment/news/ole-miss-player-slams-former-coach-lane-kiffin-after-sugar-bowl-win/",
  "title": "Ole Miss Player Slams Former Coach Lane Kiffin After Sugar Bowl Win",
  "date": "20260104T033000Z",
  "domain": "usmagazine.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Lane Kiffin is gone from Ole Miss — but he’s certainly not forgotten.\nThe former Rebels head coach ruffled some feathers with his abrupt exit from the team — leaving in November to coach at LSU despite his former team securing a spot in the College Football Playoff after one of the best seasons in program history — and some players seemingly still don’t appreciate that controversial decision.\nAfter the Rebels’ 39-34 upset victory over the Georgia Bulldogs in the College Football Playoff quarterfinal at the Sugar Bowl on Thursday, January 1, Ole Miss defensive tackle Zxavian Harris told ESPN that Kiffin was trying to “steal our shine.”\n“That’s all he’s trying to do,” Harris said. “That’s all he’s been trying to do is steal our shine.”\nHarris continued, calling his former head coach a “troll” and saying his exit felt like “a slap in the face.”\n“Like a slap and the backhand,” Harris said. “He was trying to be a troll. We’re going to troll him. We got something for him.”\nWith the victory in the Sugar Bowl, Ole Miss will next face the University of Miami in the semifinals on Thursday, January 8.\nKiffin accepted the head coaching job at LSU after six seasons at Ole Miss. According to Kiffin, he requested to coach the Rebels throughout the College Football Playoff, but the school denied his request.\nOle Miss is now led by Pete Golding, who was named permanent head coach shortly after Kiffin’s departure.\nWhile Ole Miss was taking the field against Georgia in the Sugar Bowl, Kiffin was seen holding hands with LSU women’s basketball head coach Kim Mulkey at their game in Baton Rouge.\n“He was very gracious to come over here,” Mulkey told reporters. “They have the [transfer] portal opening tomorrow. So I know he’s probably working. For him to come and let the LSU fans acknowledge him was very nice, and I appreciated him coming and walking out on the floor with me.”\nKiffin was reportedly considering attending the Sugar Bowl to support his former team alongside Louisiana Gov. Jeff Landry, but did not make it to the Caesars Superdome for the game.\nHe did, however, take to social media to congratulate his former team after the victory.\n“What a great finish!!! So much fun!!” Kiffin posted via X alongside photos of him and his family celebrating the win. “Only two more to go @OleMissFB.”\nAlong with the win, he may have also been celebrating a larger paycheck.\nKiffin earned a $500,000 bonus (paid for by LSU) after Ole Miss beat Georgia in the quarterfinals. As part of Kiffin’s exit from the university, LSU agreed to cover his full bonus structure from his Ole Miss contract.\nIf Ole Miss beats Miami in the semifinals, Kiffin will earn another $750,000, with a $1 million bonus waiting for him if the Rebels win the College Football National Championship.\nThe winner of the game between Ole Miss and Miami will face the winner of the January 9 game between the University of Indiana and the University of Oregon on January 19.",
  "word_count": 515,
  "scraped_at": "2026-02-14T13:24:07.554048"
}