{
  "article_id": "3cdbc8be694a",
  "url": "https://www.afl.com.au/aflw/news/1190792/melbourne-demons-aflw-star-tayla-harris-to-miss-match-sim-after-olympics-trip",
  "title": "Melbourne Demons AFLW star Tayla Harris to miss match sim after Olympics trip",
  "date": "20240808T090000Z",
  "domain": "afl.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "TAYLA Harris won't feature in Melbourne's match simulation against Carlton on Friday night after a trip to the Olympic Games in Paris, but the Demons star is expected to play in next week's practice game against Port Adelaide.\nHarris had been allowed to travel to the Games during the club's pre-season and meet with Olympic athletes. She returned to Australia on Thursday.\nThe spearhead – who is set to line up in defence this year after the departures of Libby Birch, Maddi Gay and Charlotte Wilson – has also been battling a shoulder injury suffered at pre-season camp.\nThe club is hopeful that Harris, who has a history of shoulder concerns, will feature against the Power in next week's practice match having progressed through her rehab at a faster rate than expected.\n\"Tayla was presented with an incredible opportunity to go to Paris for the Olympics,\" head of women's football Jessie Mulholland said.\n\"This idea was brought to the club several months ago, and we recognised it as a perfect learning experience for Tayla and a chance to bring valuable insight back to the club.\n\"In Paris, Tayla will be engaging with some of the world's greatest female athletes, and upon her return she will share her experiences and learning with the team, providing us with a unique perspective on achieving high performance in various fields.\"\nVeteran Paxy Paxman has been ruled out of the hitout against Carlton with a minor foot injury, with the hope she will be fit to play against the Power next week.\nDefender Gab Colvin, father-daughter signing Jemma Rigoni and recruit Lily Johnson are also sidelined, with Blaithin Mackin still returning from Ireland after her Gaelic football season with Armagh, where they reached the semi-finals.\n\"Gab sustained a calf strain a few weeks ago and is at the backend of her rehab but won't be available this week,\" AFLW high performance manager Sam Batterton said.\n\"Jemma has a groin injury that she's managed through the pre-season. We'll look to build her up over the next few weeks towards a return to play.\n\"Lily has an Achilles injury and is right at the end of this, she's doing really well and is back running. She’ll look to reintegrate with the main group soon.\"\nMelbourne faces Carlton at Ikon Park at 5pm on Friday, with free entry for fans.",
  "word_count": 392,
  "scraped_at": "2026-02-14T13:30:53.670990"
}