{
  "article_id": "3ce947791a8f",
  "url": "https://www.hudsonriverblue.com/put-it-on-frame-glenn-crooks-in-conversation-with-emma-hayes-uswnt-mls-fifa-world-cup/",
  "title": "  Put It on Frame  Excerpt : Glenn Crooks in conversation with Emma Hayes",
  "date": "20251209T203000Z",
  "domain": "hudsonriverblue.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The interview below with United States women's national team head coach Emma Hayes is an excerpt from Put It on Frame: Stories and Strategies from Top Soccer Coaches and Experts, by New York City FC radio announcer (and sometimes Hudson River Blue contributor) Glenn Crooks.\nThe book features 39 interviews with coaches, players, and strategists, including Mikey Varas (head coach of San Diego FC), Bob Bradley (former head coach of USMNT, LAFC , and countless others), and Juan Carlos Amóros (head coach of Gotham FC). Put it on Frame is the first in a three-part series from Crooks — Volume Two will come out just before the 2026 FIFA World Cup, and will include conversations with people who have played, coached or covered the tournament the past.\nPut it on Frame is available on Amazon.com.\nCoaching With Purpose: An interview with Emma Hayes\nI first met Emma Hayes on the recruiting trail. I was at Rutgers and she was at Iona College. This was the mid-2000s. She had also reached out to me about a couple of players on my club team at PDA. Emma understood the game in a bright, concise way.\nWe reconnected while she was on the sideline for a Gotham FC game in 2024. Not long\nthereafter, after a remarkable run at Chelsea, she accepted the position of USWNT coach, and just two months after starting the rebuild, Emma won a Gold Medal at the Paris Olympics–simply amazing! I had a wonderful conversation with her a short time later. Emma is a prodigious coach, mentor, leader, and educator.\nInterview recorded on January 7, 2025\nGlenn Crooks: Emma, is it accurate that you studied with the intent to work in intelligence, like MI6 (England’s foreign intelligence agency)?\nEmma Hayes: Yes. My football career had ended due to injury, and I was angry and pissed off with the world. I studied predominantly politics post-1945. I developed a love of European politics during that period. Then I realized I was really interested in anything from the state of the Kurdish nation to the Basque terrorist situation with ETA in Spain. I was fascinated by what creates division. And then I became really interested in how we solve it. What does that look like?\nGC: How did that experience influence your coaching?\nEH: Developing the art of diplomacy and negotiation skills has definitely helped me in my job now. I’m not always conscious of it, but sometimes when I sit back, I think: Wow, how much of the sociological and political underpinnings have influenced my coaching? And I’d say, yeah—absolutely.\nGC: What is one of the things that irks you about the women’s game that you might incorporate into this?\nEH: You mean coach education? Everything’s through a male lens. Absolutely everything.\nGC: So when you go to visit the Premier League clubs, are you visiting the women’s teams or the men’s teams?\nEH: The men’s teams. But there, I will go to talk about coaching and managing and leadership. You can only really do that with another manager, and I’ve built enough relationships in England to be able to do that. But I’ll also do the same in the US too. My plans are to go across the NFL this year. I really want to develop a better understanding of the dynamics between multiple head coaches, cocoaches, and the different coordinators. I want to spend more time in the NFL to really get underneath how best to do that.\nFormula One — I love to learn from Formula One.\nGC: One of the things I noted in your book is that you said you need positive discomfort to\nget the most out of yourself and your staff. Could you share an example of what you mean\nby that?\nEH: We’re all creatures of habit, and we love comfort. That’s not to say there aren’t opportunities to thrive in comfort, because when we feel safe, we can often be at our best. But having led many teams, and in particular Chelsea, a team of perennial winners, keeping the marker moving every year wasn’t easy.\nSometimes players would come in and you could already sense they thought, this is kind of easy; maybe we’ll cruise a little bit. So the best way I can describe it is that you have to learn how to “pull the rug” from under people’s feet at the right moment.\nDisclaimer: HRB is an Amazon Associate, and earns a commission from qualifying purchases.",
  "word_count": 747,
  "scraped_at": "2026-02-14T13:33:04.182913"
}