{
  "article_id": "3cf342137e78",
  "url": "https://www.bristolpost.co.uk/news/bristol-news/worst-criminals-across-bristol-area-9325912",
  "title": "The worst criminals from across Bristol area jailed so far in 2024",
  "date": "20240608T043000Z",
  "domain": "bristolpost.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The worst criminals from across Bristol area jailed so far in 2024\nMany criminals featured will be behind bars for some time\nCriminals jailed so far in 2024 for serious offences in Bristol include sexual predators, murderers and drunk drivers. Reporting forms an important part of the UK's open justice system, that justice can be seen to be done.\nSome of the key benefits of open justice include ensuring public confidence and respect in democracy and the administration of justice. It also acts to deter people from committing crimes and thereby the details of those crimes becoming public knowledge.\nHere are the criminals whose cases we reported on, who were jailed at Bristol's courts in 2024 for crimes that shocked the city. Read more about why we publish defendants' names and addresses here. Ages and addresses were correct at the time of sentencing.\nREAD MORE - Ex-boxer beat much-loved family man to death\nREAD MORE - Yate man ordered to pay over £5,000 over abandoned vehicles\nKillers stabbed Mikey Roynon at house party\nThree teenagers have been jailed after they killed a beloved teenager from Kingswood at a house party. Musician and student Mikey Roynon was stabbed in the back of the neck with a zombie knife by Shane Cunningham in Eastfield Avenue in Weston, Bath on June 10, 2023 and died at the scene.\nCunningham was found guilty of murder while his two co-accused friends Cartel Bushnell, aged 16 and from Dorset and Leo Knight, aged 16 and from Wiltshire, were found guilty of manslaughter at Bristol Crown Court.\nMr Justice Saini lifted the reporting restrictions on the three boys during their sentencing at the same court on Friday, May 3. The three boys had travelled to the Bath party from Wiltshire.\nTwo admitted to bringing knives with them but the third denied it, but CCTV footage showed what detectives believe was a large knife down his trousers, casting doubt on his account.\nCunningham previously claimed he was acting in self-defence when he stabbed Mikey after claiming Mikey had swung a knife towards his friends in the garden of the property. Mikey bled heavily from and collapsed on the driveway of the venue.\nPolice, paramedics and doctors quickly arrived at the scene of the incident but could not save Mikey’s life. His injury was so serious that even immediate surgery would have not saved Mikey’s life.\nThe defendants meanwhile left the scene and later disposed of their weapons, and two were recovered by the police.\nAccountant killed his wife during psychotic episode\nAn accountant who killed his wife during a psychotic episode was detained in hospital indefinitely. Darryl Bowen, 43, pleaded guilty to the manslaughter of Alison Bowen, 41, at their home in Kingswood, South Gloucestershire, on November 20 last year.\nBristol Crown Court heard Bowen, who has since been diagnosed with paranoid schizophrenia, was experiencing an acute episode of psychosis at the time. Judge Julian Lambert, sentencing Bowen on Thursday afternoon, detained him in hospital indefinitely under sections 37 and 41 of the Mental Health Act.\nHe described Mrs Bowen, a mother-of-four, as a \"wonderful daughter, beloved sister and a kind and devoted wife\" who was \"loving and nurturing\" to her children. The judge told the defendant: \"She had friends across the world and was a beacon of hope and probity to many. She was simply an inspirational human being.\"\nBristol murderer who killed friend storms off as judge delivers life sentence\nA murderer who killed his friend stormed off a video link as he was told he would serve a life sentence. Lee Llewellyn, 51, stabbed 32-year-old Martin Hefferman in the heart, inflicting fatal wounds at a house in Honeysuckle Close, Bradley Stoke during the early hours of November 18, 2023.\nThe force was so great that the blade of the steak knife broke off and was embedded in Mr Hefferman's heart and liver. Two women, who were at the property with the men, did not witness the fatal stabbing but reported hearing an argument between them downstairs.\nThey discovered Mr Hefferman critically injured and bleeding on the landing and called police at around 3.20am. Despite the efforts of emergency services, Martin Hefferman died at the property after 4am.\nDespite confessing to officers he had \"stabbed the guy\" and \"I didn't mean to do it but he attacked me”, Llewellyn later denied he murdered Mr Hefferman and claimed that he had accidentally impaled himself on the knife. Llewellyn was found guilty of murder after a nine-day trial at Bristol Crown Court this week.\nMan obsessed with guns jailed for life for planning revenge mass shooting\nA man who built his own arsenal of weapons and explosives and drew up a hit-list of targets for a killing spree across North Somerset has been jailed for life.\nJudge Martin Picton said Reed Wischhusen should not be eligible for parole for at least 12 years, adding that he was a danger to society. The judge also praised police officers who shot him at his home in the village of Wick St Lawrence, saying they showed ‘selfless bravery’ and saved his life after administering first aid.\nThe 32-year-old had a target list of ten people, including people he was at school with, former teachers, police officers, two schools and the police headquarters, and had planned out in detail what would have been an attempt to commit mass murder from Weston-super-Mare and Worle to Portishead.\nBristol Crown Court heard Wischhusen's collection of guns and explosives was only discovered after he ordered blank ammunition online. Officers went to his home in Wick St Lawrence, and he ran upstairs to the bathroom of his home, tried to shoot himself in the head, and then ran downstairs pointing a gun at police officers, who shot him.\n'Dangerous and manipulative' child rapist jailed for 21 years\nThree victims of a 'dangerous and manipulative' man found guilty of sexual assault and rape have spoken out after their abuser was jailed. Grant Wedlake, 32 and of no fixed address, was sentenced at Bristol Crown Court on Friday, March 1 after being found guilty of 12 offences, including rape, rape of a child under 13 and sexual assault.\nWedlake's offences, which dated back to 2005, had a long-term impact on his victims and left them feeling shame and anger. In a statement read out in court, one said: “I lived with the secret of what Grant had done to me. Grant had made me feel that no one would believe me. Now that Grant has been found guilty, whilst I feel relieved in a way, the feelings of shame, guilt and anger are still there and I don’t think I will ever get rid of them.\n“I am so angry that Grant has done this to me. He not only ruined my childhood, he has basically ruined my entire life. I will never forgive Grant for what he did to me.\"\nWedlake was sentenced to 21 years in prison for sex offences committed against women, girls and boys. Read more here.\nMan killed football manager with one punch in pub car park\nA man from Pilning has been jailed for killing a football manager with a single punch outside a pub in South Gloucestershire. George Baylis hit Scott Hendy outside a pub on Redwick Road, Pilning, around 12.10am on Saturday, March 2.\nMr Hendy, aged 46, fell and suffered a severe head injury. He was rushed to hospital where he tragically passed away the next day.\nDuring his police interview, Baylis confessed to punching Mr Hendy. Following the news of his death, numerous heartfelt tributes were paid to Mr Hendy, a resident of Severn Beach. His funeral was attended by an estimated 700 people.\nHis mother, Jennifer Hendy, said there's \"not a day that goes by where we don't think about Scott\".\nIn her victim impact statement, his mother described him as an \"amazing son\". She said: \"He was the kindest, loveliest character and all-round amazing son. His personality was infectious and was always one for being the joker.\n\"His sense of humour was legendary, and his loss will be felt from all over Bristol such was the reach of his infectious personality.\"\nBaylis, of Redwick Road, pleaded guilty to manslaughter and was handed a sentence of four years and six months at Bristol Crown Court. He was ordered to serve at least half of his sentence.\nA “dangerous” paedophile gathered thousands of indecent images of children and facilitated sharing the “disturbing” material in chat rooms. Christopher Cefyn James, received a knock on his door from police on June 10, 2020 after the National Crime Agency became concerned he was sharing illegal photos.\nJames, aged 34, initially denied any illegal activity online in front of his family, but slipped outside and told an officer: “I am involved. I don't know why I do it. I am not interested in the children.”\nWhat officers uncovered on James’ phones, laptops and other electronic devices were hundreds of indecent images ranging from Category A to Category C, multiple online searches surrounding child pornography and various online conversations.\nJames also ran online chat groups where he asked others to share their indecent images. His seized devices uncovered a “significant number of images”, including 940 Category A images, a “big number” of Category B images and 2,403 Category C images. Officers also uncovered numerous conversations where found where he discussed sexual abuse, trading images and sharing his “extreme sexual interests”.\nJames was jailed for four years, including one-year extended licence, placed on the sex offenders register for life and was imposed an indefinite sexual harm prevention order.\nPolice find kilos of cocaine in drug ring\nAusten Barnes-Sargeant, Carlie Bridges, Kyle Joyner and Paul O’Shea were jailed earlier this year after police uncovered a large drugs operation. Avon and Somerset Police seized large amounts of cocaine and cash over a six-month period last year. They also found cannabis, drug paraphernalia and weapons during a number of searches.\nThe conspiracy first started to unravel when officers pulled over Barnes-Sargeant, 31, after he was spotted driving erratically in Filton in March 2023. After failing a roadside drugs test, he was found to be in possession of around £3,000 in cash as well as cocaine and cannabis. It was the beginning of the end.\nA further search of his home found more class A and class B drugs, a further £4,000 in cash and a stun gun. During an investigation, officers found text messages from Barnes-Sargeant which proved his involvement in supplying cocaine.\nA warrant was carried out at the home of Bridges, 35, in Fitzroy Street, South Bristol, on May 26, 2023. As well as a cannabis plant, officers found around £70,000 worth of cocaine in a wheelie bin outside the property.\nThere was also a knife, drugs paraphernalia and a tissue which was forensically linked to Joyner. Bridges’ phone showed she was involved in supplying cannabis for over a 12-month period from March 2022.\nManipulative Bristol rapist jailed for hideous crimes against five girls\nA 'manipulative and controlling man who threatened his victims' from Bristol is now behind bars for 18 years after targeting five girls aged under 18. Curtis Otley, 20 and of Showering Road, Stockwood, was sentenced to 18 years in prison at Bristol Crown Court yesterday (January 10) after being found guilty of 12 offences by a jury.\nThey included rape, attempted rape and sexual activity with a child. The crimes were committed between 2020 and 2023.\nAvon and Somerset Police have praised the bravery of his victims. They said his awful crimes have had a long-term effect on them, with one saying Otley has \"taken away a huge part\" of her life.\nDangerous man who raped teenager\nJulian Abrahams, of Craydon Road, in Bristol, sexually assaulted two girls in the 1990s. The 55-year-old was sentenced at Bristol Crown Court on Thursday, March 14 after being found guilty of one count of rape and three counts of indecent assault against two victims.\nThe trial heard how he sexually abused the two girls, who were aged 15 and 16 at the time. Abrahams denied the charges and therefore forced his two brave victims to give evidence.\nAbraham's horrific crimes were first reported in 2020 by the woman who had been raped as a child. She said she still wakes up with anxiety every morning and told police she wanted to protect other children from being violated by the paedophile Abrahams.\nHe was sentenced to 12 years in prison. Read the full story here.\nBeloved Bristol dad killed when drugged-up dangerous driver hit him\nA drug driver who had taken cannabis and cocaine killed a young father in Bristol when his car crossed a cycle lane and mounted the kerb to strike him. Lewis Charles Payne was travelling at 51mph on the 30mph road at the moment before the collision – and his vehicle was only stopped when it crashed into a lamppost.\nMembers of the public rushed to help and called the emergency services following the crash on Airport Road on July 10, 2022. But Zac Betty was killed when the car driven by Payne hit him.\nZac, 24, had a young son and his family said they were \"absolutely heartbroken\" following the fatal collision. Now Payne, 32, has been sentenced to seven years and six months in jail and has been banned from driving for eight years and nine months.\nDrunk driver crashed head-on with another car\nDrink-driver Samuel Staynings was nearly twice the legal limit when he crashed head-on with another car having failed to change lanes. The dual-carriageway had merged and Staynings had just overtaken another vehicle at high speed.\nThe crash seriously injured three people - Chris Owen, Jennie Owen and their young son. Chris, 50, suffered fractures to his neck, leg, knee and wrist while Jennie, 55, suffered fractures to her wrist, hand and feet. Their son sustained abdominal injuries as well as a fractured vertebra.\nStaynings, aged 31 of Church Road, Bristol, was jailed for three years following the collision which happened on Brunel Way in November 2022. He has also been banned from driving for seven-and-a-half years.\nFootage from the scene of the crash showed the damage caused to both vehicles involved. Debris can also be seen scattered across the road. You can view the footage here.\nBristol dealer jailed for drug offences and breaching Criminal Behaviour Order\nA Bristol man, who breached a Criminal Behaviour Order (CBO), has been jailed after being found with Class A drugs. Junior Angus, from Argyle Road, in St Paul's, was handed a sentence of three years and eight months at Bristol Crown Court on Friday, April 26.\nAfter receiving information, officers were led to his address, where they discovered heroin, cocaine, cash and several mobile phones. Angus was later charged with intent to supply both heroin and crack cocaine, possession of cocaine and three breaches of a five-year CBO, which was issued in August 2020 following an affray conviction.\nThe CBO was secured by the Project ADDER team, funded by the Home Office to combat drug-related crime and deaths in Bristol. The court heard that Angus violated his CBO by associating with prohibited individuals and possessing unregistered mobile phones.\nThe 32-year-old pleaded guilty to all six charges and received a three-year sentence for the drug offences and an additional eight-month term for the CBO breaches.\nTinder swindler targeted Bristol women looking for love as he stole thousands of pounds\nA repeat romance fraudster who stole thousands of pounds from a dozen women across the country has been jailed yet again. Sebastian Timmis, 32, convinced his many victims to send him money after winning their trust in 2022, all while he was on prison licence for similar offences committed during the previous year.\nWhile sentencing Timmis at Taunton Crown Court on Thursday, January 11, Judge Paul Cook described the defendant as \"cynical and manipulative,\" adding that Timmis \"emotionally and seriously betrayed\" his victims. Timmis, from Marksbury, admitted 12 counts of fraud by false representation, targeting women from Bristol, Bath, Swindon, Nottingham, Warwickshire, Hertfordshire, Hampshire and Sussex.\nHe committed the offences between January and July 2022, using online dating sites and apps to earn his victims' trust, before making up seemingly urgent scenarios to gain his victim's sympathy and steal money from them. Timmis stole more than £30,000 in total from these women.",
  "word_count": 2731,
  "scraped_at": "2026-02-14T13:30:27.639702"
}