{
  "article_id": "3d044130e3ce",
  "url": "https://www.easternriverinachronicle.com.au/story/9058541/van-egmond-joins-15th-club-in-globetrotting-career/",
  "title": "Van Egmond joins 15th club in globetrotting career",
  "date": "20250904T163000Z",
  "domain": "easternriverinachronicle.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Globetrotting Matildas star Emily van Egmond is to start another Women's Super League adventure in England after being snapped up by Leicester City on transfer deadline day.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe second-most capped Australian international has joined the Foxes from another Midlands club Birmingham, who she almost helped win promotion to English women's soccer's top league last season only for them to be pipped by London City Lionesses.\nMidfielder Van Egmond has signed a two-year deal, with Leicester holding the option of an additional year.\n\"I'll bring my experience to the club and hopefully help the team win games,\" said the 32-year-old, as she prepared to join her 15th club in a distinguished career that's featured her winning 163 caps for Australia.\nOver 17 years, van Egmond has played her football in five countries, from Australia - where she's had six spells at her hometown club Newcastle - to Denmark, USA, Germany and England, where she also became a firm favourite at another WSL side, West Ham in 2020 and 2021.\n\"I've been involved in the game for a number of years now and I'm excited to see what we can do together,\" van Egmond said.\n\"I am really excited to be here and can't wait to get started. I'll bring my experience to the club and hopefully help the team win games.\n\"I want to show my mentality and show what it takes to win games in this league.\"\nLeicester will be hoping van Egmond can give them a boost after they struggled last season, finishing 10th of the 12 teams in the WSL.\nThey later also swooped to make three other, rather more youthful signings on deadline day.\nArsenal teenage defender Cecily Wellesley-Smith, 18, who signed her first professional contract in June, has joined on a season-long loan.\nEngland youth international Olivia McLoughlin has also been snapped up from Scottish Premiership side Rangers. The 20-year-old, who can play in midfield and defence, has signed a three-year deal.\nLate in the window, the club also confirmed the arrival of Morocco international Rosella Ayane, who joins on a one-year deal on a free transfer following her departure from Tottenham in June.\nAustralian Associated Press",
  "word_count": 371,
  "scraped_at": "2026-02-14T13:22:20.787728"
}