{
  "article_id": "3d24d4031f92",
  "url": "https://freerepublic.com/tag/*/index?more=4364080",
  "title": "Latest Articles",
  "date": "20260126T223000Z",
  "domain": "freerepublic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Search:\nKeywords\nUsers\nTitles\nYahoo\nHome·\nSettings·\nBreaking ·\nFrontPage ·\nExtended ·\nEditorial ·\nActivism ·\nNews\nPrayer PrayerRequest SCOTUS ProLife BangList Aliens HomosexualAgenda GlobalWarming Corruption Taxes Congress Fraud MediaBias GovtAbuse Tyranny Obama Biden Elections POLLS Debates TRUMP TalkRadio FreeperBookClub HTMLSandbox FReeperEd FReepathon CopyrightList Copyright/DMCA Notice\nMonthly Donors · Dollar-a-Day Donors · 300 Club Donors\nor by or by mail to: Free Republic, LLC - PO Box 9771 - Fresno, CA 93794\n-\nA Domestic Insurgency Has Erupted – President Trump Sending Tom Homan to Minneapolis\nThe violence in Minneapolis erupted when the scale of financial fraud was discovered. The administration of President Trump has begun to highlight this non-pretending reality. On the surface it seems like ICE enforcement is the issue; however, in reality Governor Tim Walz and Mayor Jacob Frey have been leading a criminal syndicate, with the entire region engaged in money laundering and financial fraud. State political leadership are involved. The local Minneapolis police are involved; the Minneapolis municipal leaders are involved; a large and dedicated segment of the migrant population is involved; corrupt judges and officers of the courts are involved;... -\nAmericans Are Strapping Passports to Their Heads Over Fears of ICE (LOL)\nAmericans are sharing videos on social media with their passports strapped to their heads in response to growing concerns over Immigration and Customs Enforcement (ICE) operations. In viral videos, social media creators have said they are wearing the documents this way to ensure they have proof of American citizenship before they are asked for it, with one TikTok creator saying in a video: \"You cannot be too careful, you gotta move with purpose now.\" A Department of Homeland Security (DHS) spokesperson said in an email shared with Newsweek: \"REAL IDs are not immigration documents—they make identification harder to forge, thwarting... -\nDanish Rule Over Greenland Has Its Dark Side [semi-satire]\nThe notion that Greenland's population likes being governed by Denmark may not be correct. Native Greenlander Amarok Petersen was 27 years old when she learned that the reason she cannot have children. Danish doctors had implanted an IUD birth control device in her body it when she was 13 as part of a population control program for thousands of native Greenlandic girls and women. \"I will never have children,\" Petersen complained. \"That choice was taken from me.\" Prime Minister of Denmark Mette Frederiksen, impatiently pointed out, \"we have already officially apologized for the decades of forced sterilization of indigenous women... -\nJust How Easy Is It To Rip Off The Federal Gov’t?\nSome of us are old enough to remember Matthew Lesko, the lanky, fast-talking late-night TV pitchman who promised people free government money to those who bought his books. There are, Lesko said in one of his countless ads decades ago, “15,000 programs you can use to get a better job, get an education, or start your own business. Those who know about the programs are the ones who get the money!” Lesko was right about how easy it is to get taxpayer money. What Lesko didn’t say is that it’s easy to do even when it violates the law —... -\nRepublican Chris Madel exits Minnesota governor's race, calls federal \"retribution\" on state unconstitutional\nRepublican Chris Madel is ending his campaign for governor of Minnesota, saying that he cannot support the national members of his party and their \"retribution on the citizens of our state.\" Madel said he supported the original stated purpose of Operation Metro Surge — to detain the \"worst of the worst\" migrants who are in the country illegally — but said the operation has \"expanded far beyond its stated focus on true public safety threats.\" His decision comes two days after a Border Patrol agent shot and killed Alex Pretti, a 37-year-old U.S. citizen and ICU nurse. It was the... -\nVIDEO: Did Cam Higby's Signal Chat Infiltration EXPOSE MN Lt. Governor as Ringleader?\nVIDEOIs the Lt. Governor of Minnesota, the hijab wearing Peggy Flanagan, one of the ringleaders of the insurrection in Minneapolis? Signal Chat information released by Cam Higby indicates that Flanagan might be one of the signal administrators in the organized effort to impede ICE in their work. Hopefully an investigation into this matter will resolve whether or not she is guilty of insurrectionist activities. Keep in mind that Flanagan is currently a candidate for U.S. Senator from the Somali flag state of Minnesota. -\nPrivate Jet That Crashed in Maine Was Registered to Anti-ICE Lawyers Spending Millions to Elect Democrats in Texas\nThe private jet that crashed during takeoff from Bangor International Airport in Maine on Sunday evening is registered to prominent anti-ICE lawyers who were spending tens of millions of dollars to elect Democrats in the upcoming Texas primaries. The crash resulted in seven fatalities and one serious injury. The jet was registered to Arnold & Itkin Trial Lawyers, known for its aggressive litigation and leftist political activism, including substantial financial support for Democrat causes, particularly those opposing strict immigration enforcement and Republican policies in Texas. The victims’ names have not been released at this time, but early reports indicate that... -\nScarborough: 'Many People' Describe Pretti Death As 'Execution-Style Shooting'\nOn today's Morning Joe, Joe Scarborough, speaking of the shooting death of anti-ICE protester Alex Pretti, Scarborough said: \"Many people were describing [it] as an execution-style shooting.\"Joe, if you want to accuse ICE of the execution-style shooting of Alex Pretti, have the decency and guts to say so yourself, instead of putting it in the mouths of \"many people.\" The bare minimum that journalistic integrity required was to name names of some of those \"many people.\" But you failed to clear even that low bar. Shame on you. Get the rest of the story and view the video here. -\nGunmen open fire at soccer field in central Mexico, killing 11 and wounding 12\nMEXICO CITY (AP) — Gunmen opened fire at a soccer field in central Mexico on Sunday, killing at least 11 people and wounding 12, authorities said. Salamanca Mayor Cesar Prieto said in a statement posted to social platforms that the gunmen arrived at the end of a soccer match. Ten people died at the scene and one died later at a hospital. The mayor said a woman and a minor were among the wounded. Prieto said the attack was part of a “crime wave” in the city and appealed to President Claudia Sheinbaum for help to control the violence. The... -\nStarmer would be a fool to follow Carney in embracing Beijing\nSir Keir Starmer recently tried to take credit for his role in Donald Trump’s partial climbdown on tariffs relating to Greenland. Whether he played any meaningful part is debatable. What is beyond doubt, however, is that Donald Trump will happily reach for the tariff weapon again whenever it suits him. Even against long-standing allies, and especially against those he believes are acting against US interests. Just look at Canada and the increasingly heated rivalry between Trump and the country’s prime minister, Mark Carney. The president last week threatened eye-watering tariffs of 100pc on all goods and services entering the US.... -\nNBA Union Says ‘Players Can No Longer Be Silent,’ Calls for ‘Solidarity’ with Those ‘Risking Their Lives to Demand Justice’\nThe National Basketball Players’ Association (NBPA) is siding with the anti-ICE protesters in Minneapolis, saying their players “can no longer remain silent,” accusing the efforts by law enforcement to apprehend illegal and violent criminals of sowing “division.” The statement comes one day after the league postponed the scheduled Saturday matchup of the Minnesota Timberwolves and Golden State Warriors after a shooting involving federal agents and an armed protester. The player’s association’s characterization of Minneapolis as a city “at the forefront of the fight against injustices” seems to be a reference to the 2020 death of George Floyd. This incident set... -\nDangerous Incaution: Snow Leopard Pounces on Selfie-Seeking Skier\nA female skier was mauled by a snow leopard after getting too close to try to take a photo, with a chilling video capturing her being led away with blood pouring from her face.The footage shows the victim lying prone in the snow wearing a purple ski suit after the animal mauled her on Friday evening in Fuyun County at the northern Chinese border with Mongolia.She is then seen being taken away from the scene with blood pouring from her face. -\nStrong Buyers Market In Housing! 47.1% More Sellers Than Buyers\nIts some kind of wonderful … for home buyers. Home sellers outnumbered buyers by 47.1% in December 2025, the largest gap since Redfin data began in 2013. The percentage jumped by +7.1 points from November, the biggest monthly increase since September 2022. The number of active homebuyers fell -5.9% MoM to 1.34 million, the lowest level on record. Meanwhile, home sellers declined -1.1% MoM to 1.97 million, the lowest since February 2025. By comparison, in November 2021, there were 36.5% fewer sellers than buyers. This all comes as elevated housing costs and economic uncertainty continue to push buyers to the... -\n[Catholic Caucus] New Vienna archbishop’s consecration Mass features women in key roles, altered rituals\n[Catholic Caucus] New Vienna archbishop’s consecration Mass features women in key roles, altered ritualsThe heavily altered liturgical rite visually emphasized a concept of ecclesial authority as emerging from the gathered community rather than the Church’s established hierarchy. Josef Grünwidl was ordained Archbishop of Vienna on Saturday in a ceremony at St. Stephen’s Cathedral. The rite included notable deviations from the liturgical texts, with an emphasis on layperson involvement, including women-led roles in the ceremony.On January 24, Josef Grünwidl was consecrated archbishop during a solemn Mass in Vienna, Austria, after having been appointed by Pope Leo XIV as successor to Cardinal... -\nPeter Schiff on Tucker\n@TuckerCarlson Gold has so dramatically outperformed the S&P this century that you’d think CNBC would be recommending it to investors. But they’re not. Peter Schiff explains why. (0:00) Why Schiff Decided to Start Buying Gold (10:45) You're Being Lied to About Inflation (23:39) How the Government Secretly Rigs the Economy (25:25) The Unemployment Rate Is Much Higher Than You Think (27:27) What Was the Result of the Big Beautiful Bill? (30:10) Is the Housing Bubble About to Pop? (36:20) The Real Reason College Got So Expensive (40:30) The Real Reason Healthcare Got So Expensive (43:50) Crypto vs. Gold (58:11) Will... -\nHoly Contradiction Batman! CNN Claims Trump Agenda ‘Could Work’ but Will Hurt Americans\nReading CNN’s ridiculous hot takes on the Trump economy is enough to knock a few points off your intelligence quotient. Its TDS-afflicted reporters consistently behave as if writing in contradiction just to sour public opinion doesn’t affect the credibility of their arguments. CNN Business Senior Writer Allison Morrow didn’t even try to hide the inconsistency in her January 23 anti-Trump screed headlined, “Trump’s ‘run it hot’ economic strategy could work — but it’ll cost Americans dearly.” Did you catch that? If Trump’s economic plans work out as intended, how will it hurt Americans? Wouldn’t that outcome be the antithesis of... -\nGold at $5,000 is not a rally. It’s a verdict.\nGold crossing $5,000 an ounce is not a technical breakout, a speculative frenzy, or a “risk-on trade.” It is a judgment. Silver pushing past $100 last week only reinforces the point. These prices are not expressions of optimism about growth or productivity. They are expressions of doubt: about currencies, about governments, and about the institutions charged with preserving economic stability. What makes this moment different is not simply the level of prices, but the speed and unanimity with which investors have arrived at them. Gold did not grind higher over a decade of slow erosion in confidence. It vaulted. Silver... -\nMette Frederiksen and Her Denmark First Immigration Agenda\nThe international attention given to the Denmark Controversy (not the subject of this article) is an opportunity to look at Danish immigration policies. Denmark has some of the toughest immigration policies in the Western world — arguably the best, with the exception of the Visegrad countries, which don’t have much immigration to begin with. Consider this: Mette Frederiksen, current prime minister of Denmark, is not a right-winger, but a member of the center-left Social Democrat party (Socialdemokratiet) . Nevertheless, her party was elected in 2019 on a platform which included stricter immigration policies. In January of 2021, Prime Minister Frederiksen... -\nSenate Democrat calls for investigation into TikTok deal\nSen. Ed Markey (D-Mass.) called for an investigation Friday into a deal that saw TikTok’s American business spun off into a separate entity in order to allow the app to continue operating in the U.S. The deal was finalized Thursday, with TikTok announcing it had officially established the new U.S. venture. “After over a year of Donald Trump illegally extending the TikTok deadline, this TikTok deal raises many more questions than answers,” Markey said in a statement. “Despite my repeated requests for information, the White House has provided virtually no details about this agreement, including whether TikTok’s algorithm is truly... -\nLatest Trump Truth Social post re:Minnesota\nBrowse by Forum\nGet Connected! Join Free Republic Today!\nAlready a Member? Log into your Free Republic account.\nBreaking News (News/Activism)\n- Dear FRiends, our FReepathon has fallen way behind. Please get your donations in as soon as you can. Thank you and God bless.\n- Sunday Morning Talk Show Thread 8 February 2026\n- The MAGA/America 1st Memorandum ~~ February 2026 Edition\n- Senate strikes deal to avert partial shutdown\n- US Border agents shoot two people in Portland, city officials say\n- Minnesota Gov Tim Walz to suspend re-election campaign amid Somali fraud scandal: report\n- One in custody after incident at Ohio home of JD Vance\n- Caracas, VenezuelaJanuary 3, 2026 6:30 AMUpdated: January 3, 2026 1:12 PMU.S. captures Venezuela's leader and his wife in a stunning operation and plans to prosecute them\n- President Trump says Maduro and his wife have been captured. A news conference will be held at 11 A.M\n- The MAGA/America 1st Memorandum ~~ January 2026 Edition\n- More ...\nFront Page News (News/Activism)\n- 'You exposed him to real danger': Father goes nuclear on school board after teachers sent his son to ICE protest\n- House passes SAVE America Act, sending Trump-backed election bill to the Senate\n- Trump set to gut US climate change policy and environmental regulations: White House official\n- Less than 14% of those arrested by ICE in Trump's 1st year back in office had violent criminal records, document shows\n- Lawler: ‘Not Realistic’ to Kick Out Over 25 Million Undocumented People\n- Fact Sheet: President Donald J. Trump Ensures Affordable Beef for the American Consumer\n- Democrats fear body cameras could be ICE’s new mass surveillance tool\n- Migrant, 70, who told girl, 12, to 'cover her head' before sexually assaulting her on way home from school is spared jail\n- Associated Press Complains That Winter Olympics Teams Are ‘Overwhelmingly White’\n- Appeals court sides with Trump admin with mass detention ruling\n- More ...",
  "word_count": 2509,
  "scraped_at": "2026-02-14T12:21:08.567113"
}