{
  "article_id": "3d2fa87bce55",
  "url": "https://www.theargus.co.uk/news/25658354.city-potential-fifa-womens-world-cup-2035-host/",
  "title": "City is a potential FIFA Women World Cup 2035 host",
  "date": "20251129T073000Z",
  "domain": "theargus.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The UK have formally submitted a bid to stage the FIFA Women's World Cup in 2035 and I am delighted and incredibly proud that Brighton & Hove was included as a potential host city.\nAs a football fan, the prospect of seeing the very best players in the women’s game play here in Sussex again is fantastic. The UEFA Women's EURO 2022 tournament was an amazing experience – and not just because of the unprecedented success of the Lionesses.\nHosting three games here in Brighton & Hove – including the nail-biting quarter final between England and Spain, decided by Georgia Stanway’s stunning winning goal – attracted thousands of people, boosting the local economy and showcasing our city on a global stage.\nMore than that, though, it showed young girls in Sussex what can be achieved by women in sport, introduced them to new heroes and role models and told them loud and clear that football is a sport for them.\nThis matters – and is part of the reason we were so keen to be included in the UK’s bid for the FIFA Women’s World Cup in 2035.\nNationally, 1 in 3 girls drops out of sport during their teenage years and here in Brighton & Hove a 2023 survey found only 15% of secondary-school-age girls said they had done one hour of physical activity every day for the past 7 days, compared with 27% of boys. In primary schools, 22% of girls did so, compared with 34% of boys.\nNational research tells us that throughout the UK, girls are far less likely to play sport than boys, with 11- to 18-year-olds each missing out on 1.4 hours a week, the equivalent of 52 football matches a year.\nThose figures can translate to long lasting health inequalities.\nHowever, the good news is that where girls see positive role models and women playing sport, it encourages and empowers them to do the same.\nThe same research which highlighted the worrying inequalities in participation also found more than half (55%) of girls said watching professional athletes inspired them to play. Two-thirds (65%) of 11 to 18-year-olds agreed that watching diverse athletes showed that sport was for everyone.\nThose figures are a cause for optimism, and an opportunity Brighton & Hove City Council is keen to grasp.\nWe’re determined to build on this city’s reputation as a champion of women’s sport – be it at international, national or grassroots levels – because this genuinely matters.\nOur healthy lifestyles team works with schools and local groups to encourage active participation among women and girls, and we will continue to do so. Professional clubs like Brighton & Hove Albion have long been vocal champions of the women’s game, while grassroots clubs and schools across the city are providing girls with a first taste of playing the sport and, hopefully, developing a lifelong love of the game.\nThe UK bid is built on a powerful vision of All Together – a rallying cry for women's football and sport more broadly. It represents a full commitment to delivering the most inclusive, inspiring and globally connected FIFA Women's World Cup ever and comes with a clear message – that there is a place for everyone in women’s football.\nThose are values that align with the values I know this city holds dear. Those of inclusivity and empowerment.\nHosting another international tournament would also provide a welcome economic boost for Brighton & Hove and our amazing hospitality and tourism sector.\nHosting the UEFA Women's EURO 2022 matches generated £8 million for the city, the highest gross value-added yield of any host city.\nThis was due in no small part to how enthusiastically local businesses embraced the opportunity – something I know they will do again if we are chosen as a host city for 2035.\nWe saw that enthusiasm in evidence during the recent Women’s Rugby World Cup, where more than 60,000 fans attended 2 games in the city and many more visiting our city centre fanzone. Hotels were full, the city bustling and the entire hospitality sector contributed to what was not only a wonderful weekend and an amazing atmosphere, but an event which once again saw Brighton & Hove excel on a global stage.\nBrighton & Hove was celebrated across the world as a natural home for women’s sport, while young girls were inspired to go along to local clubs and begin their own journeys in sport.\nLegacy is an oft-quoted phrase, but we have already seen the amazing impact the UEFA Women's EURO 2022 and this year’s Women’s Rugby World Cup have had locally. Welcoming the FIFA Women’s World Cup in 2035 would undoubtedly maintain that momentum.\nIf the UK is successful in its bid to host the tournament, it will be FIFA who decides which host cities are selected. We’d love Brighton & Hove to be one of them.\nThat decision will be made next year. For now, we are confident we have set out a compelling case and remain focused on showing we’re ready to play our part in what could be a truly historic event – possibly the biggest single-sport event in UK history.\nEither way, this council’s commitment to celebrating women’s sport, encouraging more women and girls to be active, and championing our local heroes will remain.\nBut a tournament with inclusivity, diversity and global connection at its heart? That sounds perfect for Brighton & Hove.\nCllr Bella Sankey is leader of Brighton & Hove City Council.",
  "word_count": 915,
  "scraped_at": "2026-02-14T13:06:48.289488"
}