{
  "article_id": "3d3135fad86a",
  "url": "https://www.teamtalk.com/news/euro-transfer-gossip-tottenham-target-classy-bundesliga-defender-which-could-lead-two-exits-newcastle-want-16-goal-napoli-midfielder",
  "title": "Euro Paper Talk : Tottenham target classy Bundesliga defender in move which could spell end for duo ; Newcastle want 16 - goal Napoli midfielder",
  "date": "20230317T130000Z",
  "domain": "teamtalk.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Euro Paper Talk: Tottenham target classy Bundesliga defender in move which could spell end for duo; Newcastle want 16-goal Napoli midfielder\nTottenham are in the mix to sign a Bundesliga wing-back with a hugely impressive assists record, while Friday’s Euro Paper Talk claims Newcastle are weighing up a summer swoop for a 16-goal Napoli midfielder.\nSPURS TARGET ASSIST MACHINE SOSA\nTottenham are reportedly interested in a summer move for Stuttgart left-back Borna Sosa, in what could be bad news for both Ivan Perisic and Ryan Sessegnon.\nThe Croatia international has been one of the most productive wing-backs in the Bundesliga over the last few seasons, registering an impressive 32 assists in 101 appearances for the German side.\nBut Sport Bild reports that the 25-year-old has been ‘on the verge’ of quitting Stuttgart several times, with only small details stopping his exit.\nHowever, it’s now reported that Sosa wants out and Bild states that Spurs are very much in the running for his signature.\nDaniel Levy and co. are not the only club keen on striking a deal though, with Real Sociedad and Sevilla also keen.\nThese links also suggest a complete transformation for the left wing-back role in north London.\nVeteran Croatian Perisic is Antonio Conte’s first choice for the role, with the often-injured Sessegnon very much viewed as a back up. More recently Ben Davies has been switched back to that role with greater success.\nAll change at left wing-back\nHowever, with Destiny Udogie arriving in the summer after his year on loan at Udinese, that could leave Perisic and Sessegnon out in the cold and Sosa battling Udogie for a spot in the side.\nMuch will also depend on Conte’s long-term future, given that a new man in charge may favour a back four.\nWing-backs in Conte’s system are hugely influential, although the Italian has not had the same success he had at Chelsea playing the same formation.\nMauricio Pochettino’s preference prior to being sacked in 2019 was largely to play with a back four. So unless Sosa is confident playing as an orthodox left-back then the deal could be a complete non-starter, if Conte walks away.\nNEWCASTLE CHASING NAPOLI STAND OUT\nNewcastle could look at striking a deal for 16-goal Napoli midfielder Piotr Zielinski this summer. (Gianluca Di Marzio)\nBarcelona have prepared €100m in order to capture two players that head coach Xavi is keen on adding to his squad this summer. The players in question are Juan Foyth of Villarreal and Athletico Paranaense’s Vitor Roque. (AS)\nSergio Ramos is set to sign new terms at Paris Saint-Germain that will keep him at the club for another season. (AS)\nTottenham target Nicolo Zaniolo’s release clause at Galatasaray will continue decreasing every year until 2025. (Calciomercato)\nLionel Messi’s financial demands have changed since winning the World Cup, which has caused contract discussions with PSG to stall. (Marca)\nMORE EURO TRANSFER GOSSIP\nJuventus are not trying to end the contract of injury-troubled midfielder Paul Pogba, chief football officer Francesco Calvo has revealed. (ESPN)\nNewcastle are in the picture to sign Galatasaray centre-back Victor Nelsson this summer. (Sabah)\nReal Madrid are considering a move for Romelu Lukaku, who is set to return to Chelsea at the end of his season-long loan spell at Italian side Inter Milan. (Various)\nInter Milan will have to battle it out with Nottingham Forest and Everton to sign Udinese’s Rodrigo Becao in the summer. (Mondo Udinese)\nPSV want to keep striker Wolves striker Fabio Silva beyond the end of the season, having tried a longer deal in the first place. (Sport Witness)\nArsenal legend Thierry Henry has rejected the chance to become head coach of the France women’s team. (Le Figaro)",
  "word_count": 616,
  "scraped_at": "2026-02-14T12:51:46.752718"
}