{
  "article_id": "3d585be3409d",
  "url": "https://economictimes.indiatimes.com/news/international/us/heres-how-olga-carmonas-goal-sealed-spains-1-0-victory-against-england-in-womens-world-cup-final-watch/articleshow/102877486.cms",
  "title": "Olga Carmona : Here how Olga Carmona goal sealed Spain 1 - 0 victory against England in Women World Cup Final | Watch",
  "date": "20230820T133000Z",
  "domain": "economictimes.indiatimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Thrilling Victory Sealed by Olga Carmona\nThe pivotal moment of the game came when Olga Carmona netted a crucial goal, setting Spain apart from England. The match, pulsating with excitement, saw Spain create numerous promising opportunities, ultimately cementing their thrilling 1-0 win against their determined opponents.\nSpain's Historic FIFA Women's World Cup Win\nSpain secured an electrifying 1-0 triumph against England in the final of the FIFA Women's World Cup 2023. The epic battle took place at the Accor Stadium in Sydney. Spanish captain Olga Carmona's first-half goal proved to be the decider, propelling her team to their maiden Women's World Cup title.\nDespite England's valiant efforts, including a near-miss by Lauren Hemp in the first half, Spain's resolute performance clinched the coveted victory.\nCaptain Olga Carmona's Heroic Goal\nCaptain Olga Carmona etched her name in history as the leader who drove Spain to a 1-0 victory against England in the FIFA Women's World Cup final in Sydney. Carmona's powerful strike in the 29th minute propelled her team to the title.\nSpain win the women's World Cup for the first time in their history. 🏆\n— $ (@samirsynthesis) August 20, 2023\nOlga Carmona's goal⚽ was the thing that separated the two sides.#FIFAWWC #FIFAWomensWorldCup2023 pic.twitter.com/9vhJqvASbV\nThe second goal remained elusive as England goalkeeper Mary Earps thwarted Jennifer Hermoso's penalty in the second half. Spain's remarkable performance defied England's dominance and led them to their first-ever Women's World Cup victory, while England's quest for the title continues.\nRecord-Breaking Attendance and TV Viewership\nStadium Australia in Sydney buzzed with thousands of fans hours before kick-off, creating a festival atmosphere complete with drummers and stilt walkers. As the event unfolded, it marked the first appearance of both England and Spain in a Women's World Cup final.Australia's semi-final clash with England earlier in the week witnessed a record average viewership of 7.13 million, a testament to the sport's growing popularity.\nSigns of Progress Amid Challenges\nWhile England and Spain scripted a historic finale, the journey of women's soccer has been fraught with challenges. Both nations have been navigating gender-related disparities in the sport.\nEngland's women's team gained official recognition only in 1970, a stark contrast to the rich history of the men's team. The Lionesses' success in securing the European championship last year started to shift the narrative.\nSimilarly, the Spanish team encountered internal turmoil, including a locker room dispute with coach Jorge Vilda and the Spanish football federation. This discord led to the absence of some of their key players during the tournament.\nInvestment and Grassroots Challenges\nWhile the Women's World Cup brought women's soccer to the global stage, challenges remain at the grassroots level. Matildas striker Sam Kerr highlighted the need for increased resources in development and grassroots initiatives. She emphasized the necessity of funding across various aspects of the sport to ensure its growth and progress.\nFAQs\nWhere was the final Women's World Cup 2023?A record-setting 2023 Women's World Cup unfolded at Sydney's iconic Stadium Australia, where a historic clash between England and Spain transpired, both vying to etch their names as champions for the very first time. Ultimately, Spain emerged triumphant with a 1-0 victory, sealing their remarkable journey to glory.\nWhat was World Cup final score?\nIn a resounding triumph, Spain clinched the World Cup title by overcoming England with a score of 1-0. The defining moment came when Spanish Captain Olga Carmona executed a brilliant move, surging into the England penalty area and unleashing a powerful low shot into the bottom corner of the net.\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.)\nDownload The Economic Times News App to get Daily International News Updates.\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.)\nDownload The Economic Times News App to get Daily International News Updates.",
  "word_count": 652,
  "scraped_at": "2026-02-14T12:05:14.244117"
}