{
  "article_id": "3d6eee73c642",
  "url": "https://www.maitlandmercury.com.au/story/9031945/knights-captain-backs-magic-round-return-to-newcastle/",
  "title": "Knights captain backs Magic Round return to Newcastle | The Maitland Mercury",
  "date": "20250803T234500Z",
  "domain": "maitlandmercury.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Home-grown Knights captain Yasmin Clydsdale reckons Newcastle deserves to host Magic Round again next year.\nSubscribe now for unlimited access.\nor signup to continue reading\nAnd, NRL chief executive Andrew Abdo has not ruled out returning the NRLW's showpiece event to McDonald Jones Stadium in 2026.\nAbdo declared the inaugural women's Magic Round a success, despite the horrendous weather conditions faced by fans and players over two days.\nMagic Round started in what Brisbane superstar Tamika Upton described as \"horrific\" conditions - two games on Saturday were halted due to lightning and all three matches on day one were contested in torrential rain.\nThe heavens opened again for Sunday's triple-header but the final match of the weekend - St George against Parramatta - was played with the sun out and ponchos away.\nStill, 11,391 fans turned out at McDonald Jones Stadium across the two days - 5298 on Saturday and 6093 on Sunday. Some had travelled from far and wide.\nOne family from Armidale brought their four rugby league-mad daughters to Newcastle for the weekend to see what they could be.\nAnother young girl in the crowd held up a sign declaring her family had travelled eight hours from Cobar for the occasion, which put the world's best players on show in one place across six games.\nAnd, after leading the Knights to an 18-0 victory over winless Canberra on Sunday, Clydsdale declared the Novocastrian faithful deserved another Magic Round.\n\"It was very wet and cold, but I absolutely love Magic Round,\" Clydsdale said.\n\"It was so cool to see all the teams in Newcastle. I loved that part of it ... Newcastle are the most resilient supporters and always show up for women's rugby league, not just the Newcastle Knights but women's rugby league in general.\n\"We broke records for State of Origin last year and, again, that was torrential rain. If we did have great weather, I know the crowd would have been a lot bigger. But, even with the weather, we still had so many people turn up for us.\"\nMagic Round followed a string of big women's sporting events in the city this year, including hosting the Matildas, State of Origin and the Wallaroos.\nThe city is sure to be in line to host women's Rugby League World Cup matches in October next year and Abdo was not opposed to bringing Magic Round back to the Hunter.\n\"It's been a big tradition in the men's game and to have our own women's Magic Round is pretty special,\" Abdo told Channel Nine in Newcastle on Sunday.\n\"[It's been] challenging conditions. I don't think the people at home realise just the skill of the players. The quality of football that has been played yesterday and today, given how wet and how windy it is, and the dedication of the fans in the top tiers of the stands, trying to find a place to stay dry ...\n\"We definitely want to move it around at some point, but we have great support from the NSW government, so it will be in NSW for the next three years.\n\"We haven't locked in a location for next season ... there are lots of great options, but we definitely want to come back here and allow fans here to see it in better weather, better conditions.\"\nThere were a number of firsts during Magic Round.\nThe opening game - between Canterbury and Gold Coast - ended 14-14 after golden point for the NRLW's first draw.\nAfter that match, Bulldogs captain Tayla Preston told media there was a period in the game where the rain was so heavy \"none of us could see the ball or the players\".\nFor the first time since the inception of NRLW in 2018, a game remained scoreless at half-time.\nThat was between the Knights and Canberra. In an even first half, both teams completed most of their sets but made mistakes at crucial attacking moments in wet and slippery conditions.\nBoth protected their try line like there was no tomorrow.\nBut, led by prodigious halfback Jesse Southwell, the hosts blew their opponents away in the second half.\nThe Knights No.7, just 20 but already playing well beyond her years, showed her intentions early after the break by taking on the line early in a set.\nMoments later, in the 38th minute, Southwell put Shanice Parker in a gap and the Knights centre, with only Canberra fullback Elise Simpson to beat, offloaded to winger Sheridan Gallagher to score on the right.\nGallagher had earlier been put on report for a high shot on Simpson.\nSouthwell assisted Newcastle's second try in the 46th minute, wrong-footing the Raiders on their try line to split the defence for prop Tiana Davison to score.\nThe Knights had total control in the second half, completing 16 of 18 sets and at one point forcing Canberra to defend five sets in a row.\nThe Raiders, by comparison, completed just four of 13 sets after the break.\nKnights hooker Olivia Higgins iced the win when she darted out of dummy-half to score from close range in the 62nd minute.\nSouthwell converted all three tries to extend her record run of consecutive successful conversions to 23.\n\"We're really proud of Jesse,\" Knights coach Ben Jeffries said post-match.\n\"She's kicking really well at the moment, and her decision-making and just her patience. To try to teach a young player to have patience in that pivotal position is tough, but she's owning it and we're really proud of her and she's going really well at the moment.\"\nThe win, the Knights fourth in a round, elevated them to eight points and kept them in a two-way tussle for second spot with Brisbane, who were 28-14 winners over Cronulla on Saturday.\nSydney Roosters stayed unbeaten leaders on 10 points with a 34-4 victory over Wests Tigers on Saturday. In other games on Sunday, New Zealand beat North Queensland 12-6 and Parramatta came from behind to beat St George 12-10.\nNewcastle are back at McDonald Jones Stadium next Saturday (3.15pm) against the Tigers.",
  "word_count": 1013,
  "scraped_at": "2026-02-14T12:12:25.444801"
}