{
  "article_id": "3d766bddc13d",
  "url": "https://www.smh.com.au/national/nsw/wave-goodbye-to-nimbys-and-developers-make-suburbia-more-liveable-20230309-p5cquo.html",
  "title": "Wave goodbye to NIMBYs and developers : make suburbia more liveable",
  "date": "20230310T073000Z",
  "domain": "smh.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This was published 2 years ago\nWave goodbye to NIMBYs and developers: make suburbia more liveable\nSuburbia can be saved by infill housing, not developer greed (“To save suburbia, we’ll need to destroy much of it”, March 10). However, the NSW Department of Planning misses the point. While big developers can continue to clear fringe bushlands to put up new housing at enormous windfall profits, we have no chance of doing the sensible infill housing thing suggested by Tone Wheeler. Both major parties are responsible for this problem, so the election is the chance for a clean sweep and a new approach by crossbench power. Caroline Atkinson, St Ives\nMissing from Wheeler’s excellent piece is the fact the Victorian and Queensland governments have acted urgently to address and accelerate affordable housing supply by having or having plans to introduce legislation to allow small rooming houses (aka co-living in NSW) without needing planning approval, so long as they fit in with the scale of the neighbourhood. This includes low density residential zones.\nNSW, on the other hand, has been frightened off allowing co-living in similar circumstances by a report exclusively prepared by local councils terrified to step on their NIMBY electors toes. Lucas Kallinosis, Vaucluse\nThe president of the Australian Architecture Association’s duplex genie has already jumped out of its bottle in my suburb, even in its foreshore areas. However, with three and four storeys including so-called basement garages at street level or even higher, they are not “modest in scale and size”.\nWith small backyards, many with pools, little room is left for trees. And at more than $2 million they are not exactly affordable for the average family. Anne Wagstaff, Oatley\nTo Wheeler’s observations, I would add the need to change expectations about car parking space per dwelling. To allow houses to be internally configured to provide, say, three households, it will generally be unviable if parking spaces are required for each dwelling.\nOur lower density suburban areas generally have good on-street car parking which allows parking to be pooled so that people who don’t own a car don’t pay for a private space. This approach should be coupled with improved bus services, which will become more viable with the increased numbers of households. The time has come to adopt this approach to reducing Sydney’s car dependency. Matthew Bartinel, Engadine\nIt’s easy to spot a development site where the developer is raising finance before commencing construction. These are the properties littered with rubbish, paper, overgrown, containing noxious and environment weeds. These developers are being disrespectful to nearby residents, the community, and local bushland in their failure in maintain their properties. Development approvals need to be subject to a condition that the property or properties be maintained prior to construction with failure resulting in the approval being dissolved. Brian McDonald, Willoughby\nInfrastructure always seems to lag behind the relentless housing spread. As a regular lap swimmer I’m fortunate that the crowding at my local pool is only temporary due to North Sydney pool’s refurbishment (“Sydney sprawl has fewer spots to do Australian crawl”, March 10). Families subjected to western Sydney heatwaves need respite and with drownings increasing it is vital more pools are built to enable lessons. Sally Spurr, Lane Cove\nSo many pools in NSW in the western suburbs and country towns have been closed permanently over the last 20 years. Promises were often made that these pools would be reopened at a different and more suitable site. The promised Parramatta pool is a good example where there are still no plans for its replacement. As the cost of building and maintaining pools is often prohibitive for councils, perhaps the NSW government should step in and subsidise this important community asset. And if they had indoor facilities they would become popular year round. It might help save many lives after 90 beach and river drownings in NSW this summer period. Helen Simpson, Curl Curl\nDangerous depths in defence debate\nNo surprise the Chinese state media didn’t like the Red Alert series (“Chinese media criticises series reporting”, March 10). If China does attack Taiwan in the near future then Australia needs to be careful not to be dragged into the conflict. Recent events in Ukraine have proven that America and the world are reluctant to engage in another war with an alleged superpower. Why would Taiwan be different to Ukraine? Further, what good are submarines in 30 years if the threat from China is within three years (“Broader scope: Plan for second sub fleet”, March 10)? We need to rethink our priorities and defence spending. Warwick Spencer, West Pymble\nSome will agree that the purchase of nuclear-powered submarines will give Australia entry into the group of powerful nations (“Time Australians stopped thinking of their nation as a middle power”, March 10). Others may see the deal as a symptom of a middle power suffering delusions of grandeur. Norm Neill, Darlinghurst\nOur prime minister declares firmly that Australian sovereignty will be maintained in the new defence arrangements. Will someone ask him to state clearly that should the US go to war with China Australia will not necessarily follow but could remain neutral. If this is not the case we do not have sovereignty. Cavan Hogue, Haymarket\nNow that we have given equal time to those that would have us invest more in the war machine, it might be useful to apply logic to the issue. First, we are already a nuclear target thanks to our US ties. Second, no amount of additional weaponry will make us safe. Third, the US has proven itself to be an unreliable “saviour” when things go pear-shaped. The only conclusion is to reduce military expenditure and redouble our infrastructure and diplomatic endeavours. Case closed. John Richards, Turramurra\nThe most disturbing aspect of the Red Alert series is the assumption that we must be automatically and actively involved in any conflict with our single most important trading partner if, for whatever reason, the US decides to go to war with China over its relationship with Taiwan. Not suggesting that Taiwanese independence is not important, but is it important enough for Australians to die for? Col Nicholson, Hawks Nest\nI’m dismayed by the negative reaction to the Red Alert series (Letters, March 10). History and current events in Ukraine show us that, sometimes, to have peace, you must be prepared to go to war. To think otherwise is unrealistic. If we are not prepared to repeat the self-sacrifice of the Ukrainians, we don’t deserve to have a country. Boris Feigin, Narwee\nPitch perfect\nYour writer’s caveat, “At the time of writing the fourth Test match in Ahmedabad was still going” (“Patient Khawaja again shows mental strength on benign Ahmedabad pitch”, March 10), suggests he had doubts about the Test extending beyond the first day. However, at day’s end the scoreboard said it all: Australia 1st innings 4 for 255. Thanks, Australia’s XI, especially unbeaten century maker Usman Khawaja, for providing doubting Thomases with something serious to think about. Col Shephard, Yamba\nUsman Khawaja has once again demonstrated how wrong others were about him. In fact, from watching Khawaja bat, you wonder how anyone could possibly favour David Warner over him. I watched them bat together in the last Sydney Test and it was like comparing chalk and cheese. Ian McKenzie, Mount Annan\nWith the Matildas playing at home in a World Cup for the very first time, 2023 would be a great year for your cricket-obsessed correspondent (Letters, March 10) to convert to a sport in which matches don’t take a whole working week to resolve, and those who tend the playing surface just sow it, grow it and mow it rather than decide who wins. Steve Cornelius, Brookvale\nSuper-sized dose of blindness to disadvantaged exposed\nWaleed Aly reveals a common theme of blind bias to the disadvantaged and minorities in our community, not just those on welfare (“Bipartisan cruelty afflicts jobless”, March 10). The viciously unfair robo-debt fiasco has engendered less approbation and media coverage than a proposed modest increase in tax of the super rich’s super funds. Then there are the homeless, the mentally ill, the Indigenous populations, off-shore refugees, sexually diverse, the disabled and over 50 per cent of the population, women. These groups through social invisibility, institutional disenfranchisement and innate political guilelessness have for years been collateral damage to the mainstream agenda. Only now, some are finding their voice and receiving statutory support but the cultural and social bias remains. We still have a long way to go particularly for those without political power or representation. Rowan Godwin, Rozelle\nAly’s article raises the question: how could a well-educated, prosperous, democratic country like Australia allow this to happen to its citizens? Part of the answer is the deliberate dehumanisation of the victims. In the case of robo-debt, where recipients were forced to go online, managers were no longer hearing of anguished reports from frontline staff, but rather were seeing up-ticks in trends of complaints. Organisations should recognise that online “customer experiences”, so favoured for efficiency reasons, carry the risk of hidden consequences. Peter Hill, East Ballina\nAly nails the robo-debt scandal as a moral and legal crime perpetrated on victims who are without effective remedy. As he says, there is no “live ear” to hear their story or to investigate the abuse. This is an instance of a much more common affliction. How often have your readers sought to speak to a bank, a utility or a corporation to be met with a bot that understands nothing or a message stating “We know that your time is valuable but due to exceptionally high demand we are unable to attend to your inquiry”. Corporations can routinely increase profits at their customers’ expense without effective pushback. Which political party has the courage to bring on legislation that will make duty of care to customers and due diligence stick? Michael Pusey, Waverley\nImagine a robo-debt scheme to reign in tax avoiders especially targeting those people in the higher echelons of wealth and power. It wouldn’t last five minutes. Josephine Piper, Miranda\nAt all costs?\nAnother incidence of racist vilification, this time of Latrell Mitchell, at a football match (“Does Mitchell abuse prove progress over 30 years is only skin deep?”, smh.com.au, March 10). Apparently there are people who think their team winning is the most important thing in the world and will do anything to make it happen. Remember the disgraceful vilification of Adam Goodes all those years ago? It might be a step too far to take these incidents as an indication of the intelligence of the average football fan, but one wonders what sort of world these people live in. Ian Adair, Hunters Hill\nBanning a fan from attending live rugby league games for life is a rather soft tackle penalty. After all, he can likely watch the game on TV. Sporting codes must insist on legislated financial and other penalties to get rid of this disgusting habit. Graham Russell, Clovelly\nBroken model\nThe Sydney University 40/40/20 model is broken and doesn’t take into consideration the unpaid work academics do, let alone inflation (“Sydney Uni a ‘ghost town’ as 1000 staff go on strike”, March 10). Academics are doing too much pro gratis administrative work on top of the 40/40/20 load they already have, distracting them from their research. Angela Powell, Killara\nServe customers, not time\nLow-risk prisoners avoiding jail terms in exchange for working a 40-hour week and being productive members of society is a wonderful idea (“Jobs suggested as alternative to jail”, March 10). It would benefit businesses suffering from a shortage of workers and make huge savings in the budget.\nJust imagine the additional tax revenue and budgetary benefits that would accrue from treating refugees and asylum seekers with the same amount of dignity. They, too, can be productive, pay tax and contribute to society. Instead, many on bridging visas are afforded fewer rights than convicted criminals.\nIn economic parlance, a humane approach to both low-risk prisoners and refugees would have a positive “trickle-down effect”. Judith Reynolds, Leura\nWater shemozzle\nMaking coal miners in Sydney’s drinking water catchments pay for water draining into their mines is a good step, but first they have to estimate the amount they are taking in these uncontrolled leaks (“Coal mines to pay for removing water”, March 10). And of course there is no talk of the virtually impossible task of fixing the cracks that caused the leaks in the first place. A better solution would be to prohibit mining under drinking water catchments in the first place. Martin Cousins, Lindfield\nFox shocks\nThe outing of the Murdoch-owned Fox News via incontrovertible evidence that the company did not believe Trump’s claims of election fraud, but at the same time supported them in their coverage due to a cynical attempt to keep their viewers on side, fills me with outrage and the most delicious sense of schadenfreude (“‘I hate him passionately’: Murdoch’s top Fox News host secretly loathed Donald Trump”, March 10). Jillian MacDonald, Leura\nTraining days\nYears ago, NSW treasurer Michael Costa signed away the passenger services between Gulgong and Rylstone (via Mudgee). In a recent survey, 95.5 per cent of respondents supported the reinstatement of a passenger rail service to and from Sydney, 94.95 per cent reported they would use the train if available to travel either regularly or occasionally to and from Sydney. Do politicians take notice of such overwhelming support within the community? No. Why? It’s in the bush – so, forget it! Paul Griffiths, Mudgee\nA load of rubbish\nIn 1961, when I was teaching in a primary school, I was told the male teachers were paid more because they organised the bin collection (Letters, March 10). Marie Grady, Frenchs Forest\nIn the 1950s, the reasoning for men being paid more was because they were married and had a wife and soon children to support, and that single women would soon marry and leave the workforce. That some women and indeed men would never marry was never addressed, yet the argument was employed to oppose the introduction of equal pay in 1969. That now after more than 50 years this issue is yet to be fully addressed is unacceptable. Rodney Crute, Hunters Hill\nAt my first workplace after leaving school, the men in the office were allowed to smoke at their desks. Women who smoked had to gather in the ladies’ toilets during morning and afternoon tea breaks. No one ever complained. Dee Wyatt, Old Junee\nMy grandfather, born in 1880, took me in short pants to the Newcastle Show a few times in the late 1940s. During the war years, Australian women performed a lot of the heavy work which would normally have been done by men. But with the return to the workforce of those men who served, questions of equal pay and other rights of working women arose. On one of the show days, there was a small demonstration outside the entrance to the showground by women who felt they had a point to make. In the ensuing discussion, my grandfather told me that there were three or four days every month when women couldn’t work as hard as men. End of discussion. John Hinde, Millers Point\nHigh achiever\nI like to call him “airborne Albo” – just for fun (“Why Dutton should fear a trippy PM”, March 10). Rosemary O’Brien, Ashfield\nPostscript\nThere was only one subject letter writers wanted to discuss this week: the Red Alert series. The articles, which were published over three days, revealed that Australia faces the threat of war with China within three years, but the country is unprepared for conflict, according to a panel of national security experts.\nThe reaction was overwhelming; hundreds of emails flooded the letters inbox. Some suggested we prepare bunkers, stock pantries with tinned food; others were moved to tears at the thought of conscription for our young. There was a call for an alternative to conflict, a plan-B which involved negotiation, communication, and even some old-fashioned love and respect. Many were angry, reminding us of the horror of Ukraine, but a few were grateful for the discussion. “How is there such hatred for merely speaking the truth about the likelihood of Australia becoming involved in a US-led war against the PRC?” wrote Ian Lewis of Kentucky. “The experts are not advocating war, merely trying to get the Australian public to confront a real possibility. Ignoring the very real risks prepared for us by the late ‘government’ will not make those risks go away.”\nMany wrote that we should “decouple from the dangerous sycophantic alliance” with the US and be encouraged by the work being done by the foreign affairs minister to repair relations with China.\nCatherine Knoles of Allambie Heights summarised the majority’s feelings: “Let’s talk about how to make and maintain peace, not how to prepare for its opposite.” Thank you for taking part in this important conversation. Pat Stringa, letters editor\n- To submit a letter to The Sydney Morning Herald, email letters@smh.com.au. Click here for tips on how to submit letters.\nThe Opinion newsletter is a weekly wrap of views that will challenge, champion and inform. Sign up here.",
  "word_count": 2873,
  "scraped_at": "2026-02-14T11:59:28.675188"
}