{
  "article_id": "3dd794f01130",
  "url": "https://www.wapt.com/article/rubiales-trial-world-cup-kiss/63652056",
  "title": "Ex - Spain soccer official Rubiales goes on trial for World Cup kiss",
  "date": "20250203T150000Z",
  "domain": "wapt.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Former Spain soccer official Rubiales goes on trial for unsolicited kiss of player at World Cup\nThe former president of the Spanish soccer federation goes on trial Monday accused of sexual assault for kissing forward Jenni Hermoso after Spain’s victory at the Women’s World Cup final in 2023.\nVideo above: Soccer star Jennifer Hermoso testifies at Rubiales' trial in Spain\nThe kiss, which Hermoso said was without her consent, marred the celebrations of the women’s team’s achievement. It sparked widespread outrage in society beyond football, and ignited one of the most embarrassing scandals in the history of Spanish soccer.\nLuis Rubiales also grabbed his crotch in a lewd victory gesture while standing near Spain’s Queen Letizia and Princess Sofia amid celebrations of Spain’s victory over England in Australia. He has denied any wrongdoing, but was forced to resign and was banned by FIFA. Rubiales had said he was the victim of a “witch hunt” by “false feminists.” He said the kiss was consensual.\nWhat Rubiales faces\nThe 47-year-old Rubiales is accused of sexual assault and of trying to coerce Hermoso to publicly support him. A judge ruled that Rubiales’ kiss was “unconsented and carried out unilaterally and in a surprising fashion.” Rubiales could face a fine or a prison sentence of one to four years if found guilty, according to court officials. A new law eliminated the difference between “sexual harassment” and “sexual assault,” sanctioning any unconsented sexual act. Prosecutors, Hermoso and Spain's players' association want a prison sentence of two and a half years for Rubiales, plus a payment of 50,000 euros ($51,800) for damages, and for him to be banned from working as a sports official. Hermoso is also asking for a court order banning Rubiales from being near her.\nOthers on trial\nThe judge also ruled that along with Rubiales, former Spain women's national team coach Jorge Vilda, former sports director of Spain’s men’s team Albert Luque, and the federation's former head of marketing, Rubén Rivera, should be tried for allegedly pressuring Hermoso to defend Rubiales, something she refused to do. They all also deny wrongdoing. According to the judge, there was sufficient evidence that Rubiales unsuccessfully pressured Hermoso to appear in a video he produced and published while public outrage over his actions mounted. The judge said there was also reason to believe Vilda likewise pressured Hermoso’s brother. Luque and marketing head Rivera were also involved in the alleged attempt to coerce her to support her disgraced boss, according to the judge. Prosecutors, Hermoso and Spain’s players’ association want a prison sentence of one and a half years for the three defendants.\nTimetable and witnesses\nThe trial begins on Monday and is expected to last at least 10 days. Hermoso is set to testify on the first day. Among the nearly 20 witnesses who are also expected to testify are Spain’s men’s national team coach Luis de la Fuente and some of Hermoso’s teammates in the women’s national team, including former world player of the year Alexia Putellas. Rubiales is obligated to attend only the first and the last day, according to the court. The four defendants are expected to speak toward the end of the trial next week. Rubiales' daughters are also set to testify at some point.\nScandal aftermath\nHermoso and her teammates refused to play as long as Rubiales was in charge and returned to the team only weeks later when the government mediated an agreement with the federation interim president to overhaul its protocols and give more support to its women’s side. That included the elimination of the term “women’s” from the official team name. FIFA banned Rubiales for three years until after the men’s 2026 World Cup. His ban will expire before the next women’s tournament in 2027. Spain’s sports authority also ruled him unfit to hold a post in sports management for three years.\nRubiales' other trouble\nDuring his time as president of Spanish soccer's governing body, Rubiales overhauled the format of the Spanish Super Cup in 2020, creating a four-team mini tournament and moved the competition to Saudi Arabia as part of a deal that was reportedly worth 40 million euros (then $42 million) per tournament to the federation. Prosecutors opened a probe of that deal in 2022 following leaked audio between Rubiales and then-Barcelona player Gerard Piqué regarding millions of dollars in commissions. Piqué’s sports entertainment company Kosmos was involved in the deal with the federation and Saudi Arabia. They denied wrongdoing.",
  "word_count": 744,
  "scraped_at": "2026-02-14T12:53:17.492127"
}