{
  "article_id": "3dda77f971d6",
  "url": "https://www.eastbaytimes.com/2024/03/17/bay-fc-how-to-watch-projected-starting-lineup-and-key-dates-in-inaugural-season/",
  "title": "NWSL Bay FC : How to watch games and the projected starting lineup",
  "date": "20240317T141500Z",
  "domain": "eastbaytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Bay FC kicks off its inaugural season Sunday at 4:30 p.m. PT against Angel City FC in Los Angeles.\nHere’s what you need to know about the expansion team’s first-ever game in the National Women’s Soccer League:\nHow to watch: NBC Sports Bay Area, NWSL-plus.\nSunday’s game will be one of 10 Bay FC matches this season that will be broadcast live on NBC Sports Bay Area and NBC Sports California. Nine matches can be streamed on NWSL-plus, the league’s free streaming service. And 12 matches will be available on ION, which can be accessed through a variety of different providers, including YouTubeTV, Fubo and Freevee, among others. ESPN, CBS Sports and Amazon Prime Video will also broadcast occasional games throughout the year.\nOpponent: Angel City FC made its NWSL debut in 2022 and struggled out of the gate, finishing in eighth place without a postseason appearance. But the club bounced back with a run to the quarterfinals last year. And while averaging almost 20,000 fans per game, the atmosphere should feel like a party in Los Angeles.\nBay FC’s expected lineup:\nGoalkeeper: Lysianne Proulx\nThe 24-year-old was part of Canada’s roster at the 2023 World Cup and has previously played professionally in Australia and Portugal. She’s expected to take over the starting job from Melissa Lowder, who suffered a season-ending knee injury last week.\nDefenders: Savy King (left back), Emily Menges (center back), Kayla Sharples (center back) and Caprice Dydasco (right back)\nKeep an eye on King, a high school track star who might be the fastest player on the field. The No. 2 overall pick in the NWSL draft in January, the 19-year-old rarely gets beat on the ball and is more than capable of going forward to create scoring chances on the left side. Menges, Sharples and Dydasco provide a veteran presence on the back line.\nMidfielders: Alex Loera, Deyna Castellanos and Joelle Anderson\nLoera, 24, is seen as one of the game’s brightest up-and-comers from the defensive midfield position and will be relied on to begin attacking transitions from the team’s defensive third. Castellanos is one to watch, as the 24-year-old Venezuelan international is a dynamic scoring threat with experience at Manchester City and Atletico Madrid.\nAttackers: Tess Boade, Asisat Oshoala, Scarlett Camberos\nBoade, 24, could get a chance to prove herself until Racheal Kundananji is ready to return from a knee injury in the coming weeks. Until then, Bay FC should count on two-time Ballon d’Or Award finalist Oshoala, a goal-scoring machine for Barcelona during the last five years, to cause havoc on opposing defenders as the central striker. Camberos, 23, is still looking to make her mark in the NWSL.\nManager: Albertin Montoya\nMontoya, 49, was the manager of the last rendition of women’s professional soccer in the Bay Area, the FC Gold Pride. He won a title with the Pride in 2010, the second and final season of the team’s existence before it folded. He’s a former professional player who is known for his ability to develop young players and for his time as a club director at Mountain View Los Altos. He wants to play a controlled game in which every possession starts by playing calmly out of the back and methodically picking apart the opponent with creative attacking players.\nGeneral manager: Lucy Rushton\nRushton, 38, was a pioneering woman in English football during the beginning of her career, when she worked her way up as an analyst at Reading FC, helping the club earn a promotion to the English Premier League. She later went on to help Atlanta United enjoy a successful expansion in Major League Soccer before she became the second woman ever to be an MLS general manager when she was named GM of DC United in 2021. Rushton said she built this roster with an eye for good human beings who fit the style of play Montoya intends to orchestrate.\nKey dates in the first half:\nSaturday, March 30, 7 p.m. vs. Houston Dash: Expect a sellout crowd for Bay FC’s home opener at PayPal Park.\nSaturday, April 20, 4:30 p.m. at Kansas City Current: Bay FC will play in CPKC Stadium, which opened Saturday as the world’s first women’s professional sports stadium. Bay FC is hoping to build its own stadium at some point in the future.\nWednesday, May 1, 7 p.m. vs. Portland Thorns FC: Bay FC will face off against the three-time NWSL champions.\nFriday, May 24, 7 p.m. vs. NJ/NY Gotham FC: The reigning champs come to town.\nSunday, June 16, 7 p.m. vs. Utah Royals FC: Fellow expansion side Utah had the first pick in the draft and selected Ally Sentnor, a rising star for the United States Women’s Youth National Team who could have a breakout season in the NWSL. It’s also Pride Night at PayPal Park.\nThere will be a mandated league break from July 8-14, then another break from July 15 to August 18 for the Summer Olympics in Paris.\nFor more, check out the season preview here.",
  "word_count": 838,
  "scraped_at": "2026-02-14T12:47:09.849082"
}