{
  "article_id": "3dec625dbad5",
  "url": "https://punchng.com/ogbonna-announces-besiktas-exit/",
  "title": "Ogbonna Announces Beşiktaş Exit",
  "date": "20250613T013000Z",
  "domain": "punchng.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Super Falcons defender Glory Ogbonna has officially confirmed her departure from Turkish side Beşiktaş JK after three seasons at the club, PUNCH Sports Extra reports.\nThe 25-year-old announced her exit in an emotional statement posted on her official Facebook page on Thursday, thanking the club for its support and hospitality throughout her stay.\nOgbonna expressed deep appreciation for the unity and love she experienced at Beşiktaş, stating that the club made her feel at home during her time there.\nShe also extended her gratitude to her teammates, coaching staff, board members, and the fans for standing by her through highs and lows.\n“I just want to use this medium to appreciate this wonderful club for how they made me feel at home during my three years’ stay with them,” Ogbonna wrote.\n“I want to thank my teammates, technical team, board members and the fans for their support both in good and in bad times. You all always make sure that love leads. Thank you all, and I wish the club a wonderful season from now onwards. One love, Beşiktaş.”\nOgbonna joined Beşiktaş on February 3 2023 and quickly established herself as a versatile and dependable presence in the squad. Though her primary position is left-back, she proved adaptable throughout her tenure, featuring across the backline and in defensive midfield when required.\nBefore her move to Turkey, Ogbonna played for Edo Queens in the Nigeria Women’s Football League Premiership and was a standout performer at the 2018 WAFU Women’s Cup.\nFormer Super Falcons head coach Thomas Dennerby singled her out as one of the most impressive players of the tournament, a performance that earned her a place in Nigeria’s squad for the 2018 Africa Women’s Cup of Nations.\nHer rise continued with consistent national team call-ups, including a spot in the 23-player squad for the 2023 FIFA Women’s World Cup in Australia and New Zealand, where she featured in the thrilling group stage match against Australia, helping the Super Falcons to a memorable 3–2 victory.",
  "word_count": 334,
  "scraped_at": "2026-02-14T12:35:11.132214"
}