{
  "article_id": "3e0ff02397a1",
  "url": "https://www.express.co.uk/news/royal/1915406/prince-william-euros-2024-japanese-state-banquet",
  "title": "Prince William mind may have been elsewhere during banquet | Royal | News",
  "date": "20240626T110000Z",
  "domain": "express.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Prince William's mind may have been elsewhere during last night's state banquet\nPrince William must have had a tough time on Tuesday evening not being able to watch his beloved England play Slovenia as he was tied up with a major royal engagement.\nPrince William meets England team ahead of Euros\nMany senior members of the Royal Family were required to be present at the Japanese State Banquet at Buckingham Palace on Tuesday evening, including Prince William.\nHe joined King Charles and Queen Camilla in welcoming Emperor Naruhito and Empress Masako to the UK, however, at the same time the England men's team were playing Slovenia in their final group stage match of Euro 2024.\nWhile William always puts his official duties first, he was no doubt considering what was happening on the pitch in Germany, even though Gareth Southgate's team finished with a disappointing 0-0 draw.\nEarlier this month the Prince of Wales travelled to St George's Park in Burton-upon-Trent, the home of English football, to wish the team and their manager luck.\nThe men's team have never lifted a Euro trophy, however, the Lionesses are the current title holders having won the women's tournament in 2022.\nOur community members are treated to special offers, promotions, and adverts from us and our partners. You can check out at any time. Read our Privacy Policy\nWilliam is President of the Football Association and also supports Midlands team Aston Villa, recently taking his eldest son Prince George to see the Villans play Lille OSC in the Europa Conference League.\nWilliam explained his love of Aston Villa to the BBC in 2015: \"A long time ago at school I got into football big time. I was looking around for clubs. All my friends at school were either Man United fans or Chelsea fans and I didn’t want to follow the run-of-the-mill teams.\n\"I wanted to have a team that was more mid-table that could give me more emotional rollercoaster moments.\n\"Aston Villa's always had a great history. I have got friends of mine who support Aston Villa and one of the first FA Cup games I went to was Bolton v Aston Villa back in 2000. Sadly, Villa went on to lose to Chelsea.\nDON'T MISS: Meghan in 'impossible situation' as major obstacle puts her 'in jeopardy'\nDON'T MISS: Meghan and Harry privacy 'contradiction' over potential Australia visit slammed\nDON'T MISS: Meghan's surprising new American Riviera product could be big money spinner\n\"It was fantastic, I sat with all the fans with my red beanie on, and I was sat with all the Brummie fans and had a great time. It was the atmosphere, the camaraderie and I really felt that there was something I could connect with.\"\nDuring his time at St George's Park William also had some advice for the England team from his children, although they may want to consider whether to listen to Prince Louis.\nThe Prince sweetly told the players: \"I was on the school run this morning and I asked [the kids] 'What should I say to the England team today?'\n\"The best bit of advice I got was to eat twice the amount you normally would eat. So I now have visions of all of you running around with massive tummies with stitches on the pitch. So I think maybe take my youngest’s advice with a pinch of salt, particularly around the physio.\"\nDespite only winning one match in the tournament so far, England finished top of their group and will now progress to the knockout stages of Euro 2024.\nTheir next game will be played on Sunday, June 30 at 5pm, although it remains to be seen which team they will be up against depending on how the other groups finish.",
  "word_count": 627,
  "scraped_at": "2026-02-14T12:57:26.612802"
}