{
  "article_id": "3e354531d36e",
  "url": "https://ghanaiantimes.com.gh/its-not-over-for-black-princesses-coach-charles-sampson/",
  "title": "It not over for Black Princesses coach Charles Sampson",
  "date": "20260210T084500Z",
  "domain": "ghanaiantimes.com.gh",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It’s not over for Black Princesses — coach Charles Sampson\nThe Head Coach of the national female U-20 team, the Black Princesses, Charles Sampson, says he was among the plethora of football fans that left the Accra Sports Stadium in a sombre mood following the team’s failure to record a good result in their qualifier against South Africa on Sunday.\n“Knowing the quality of the South African team, our preparation focused on keeping a clean sheet in the first leg and find a way to win. The aim is to make the second leg quite comfortable for the girls,” he said.\nThis was his reaction after the Black Princesses were held to a pulsating 2-2 drawn encounter by the Basetsana of South Africa in the first leg of the FIFA U-20 Women’s World Cup qualifiers.\nIn front of an encouraging crowd, the Black Princesses on two occasions took the lead through Agnes Yeboah and Linda Owusu Ansah, but on all occasions surrendered the lead.\nThat leaves the Black Princesses with a daunting task ahead of the return fixture on Saturday as they aim to navigate through to the next stage of qualifiers.\nBut speaking after the game, Coach Charles Sampson pointed out that the challenge ahead was enormous, but the Black Princesses have what it takes to scale that hurdle.\n“Considering the performance of the South Africans, the second leg looks quite tough. They pushed so hard and got the result. We can employ the same tactics and also get rewarded. The game is still open; chances are even for the two sides. Such open games even bring out the best in the teams and I’m hoping that this time, we’ll take our chances,” Charles Sampson stated.\n“I’m absolutely disappointed with the result. We wanted to keep a clean sheet against the South Africans but they proved their mettle,” he added.\nIn another development, the senior female side, Black Queens, will face a packed and competitive schedule at the upcoming Pink Ladies Cup Tournament as the team steps up preparations for the Women’s Africa Cup of Nations (WAFCON).\nThe tournament, which runs from February 28 to March 6, 2026, will see Ghana come up against Hong Kong, Russia and Tanzania in a series of high-intensity fixtures.\nAccording to an FA statement, Ghana will open the campaign on February 28 with a clash against Hong Kong, followed by clashes against Russia on March 3 and Tanzania on March 6.\nThe Pink Ladies Cup offers the Black Queens a valuable opportunity to fine-tune preparations ahead of the WAFCON. With three matches in eight days, the tournament promises to be a crucial phase in Ghana’s build-up as the Black Queens aim to return to continental action sharper, stronger and more competitive.\nBY ANDREW NORTEY\nFollow Ghanaian Times WhatsApp Channel today. https://whatsapp.com/channel/0029VbAjG7g3gvWajUAEX12Q\nTrusted News. Real Stories. Anytime, Anywhere.\nJoin our WhatsApp Channel now! https://whatsapp.com/channel/0029VbAjG7g3gvWajUAEX12Q",
  "word_count": 480,
  "scraped_at": "2026-02-14T12:38:04.208205"
}