{
  "article_id": "3e3c5f8d9e18",
  "url": "https://www.france24.com/en/live-news/20230227-messi-beats-mbappe-to-fifa-best-prize-putellas-claims-women-s-award",
  "title": "Messi beats Mbappe to FIFA Best prize , Putellas claims women award",
  "date": "20230228T000000Z",
  "domain": "france24.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Messi beats Mbappe to FIFA Best prize, Putellas claims women's award\nParis (AFP) – Lionel Messi won The Best FIFA men's player prize for 2022 on Monday on the back of his World Cup triumph with Argentina and Spain's Alexia Putellas retained the women's award at a ceremony in Paris.\nIssued on:\nMessi beat his Paris Saint-Germain teammate, and World Cup final rival, Kylian Mbappe to the men's gong with Ballon d'Or winner Karim Benzema the other contender to claim the prize.\nIt is the second time that Messi has won the honour inaugurated by FIFA in 2016 after football's world governing body split from Ballon d'Or organisers France Football.\nThe award, which is voted for by national team coaches and captains, journalists and also fans, recognises a year in which the former Barcelona star crowned his glorious career by leading Argentina to victory at the World Cup.\nMessi scored twice in an epic final in Doha as Argentina beat France on penalties despite Mbappe netting a hat-trick for Les Bleus in a remarkable 3-3 draw.\nThe 35-year-old, a seven-time Ballon d'Or winner, succeeds Robert Lewandowski on the FIFA honours list, while Putellas retained the women's prize despite spending the second half of last year out injured.\nThe 29-year-old beat England's European Championship-winning striker Beth Mead and United States star Alex Morgan to add the FIFA crown to the Ballon d'Or, which she has also won two years running.\nPutellas is currently recovering from a serious knee injury suffered last July which saw her miss the Euro in England with Spain.\nPrior to that she had scored 11 goals on Barcelona's run to the Champions League final, which they lost to Lyon.\n© 2023 AFP",
  "word_count": 285,
  "scraped_at": "2026-02-14T12:52:08.911874"
}