{
  "article_id": "3e6e9009c8a7",
  "url": "https://theprideoflondon.com/posts/chelsea-women-at-everton-fa-cup-preview-predicted-xi-01hrdcst1ktc",
  "title": "Chelsea Women at Everton , FA Cup preview , predicted XI",
  "date": "20240309T220000Z",
  "domain": "theprideoflondon.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Only one club has ever lifted the illustrious FA Cup four campaigns running. That was Arsenal between 2005-2009. Chelsea Women has the opportunity to become the second with just two triumphs left before its ticket to Wembley Stadium can be punched. The journey continues on Sunday afternoon in northern England.\nThe Blues edged Championship side Crystal Palace by a goal thanks to Mayra Ramirez to reach this spot in the competition. Their quarterfinal opponent blasted FA Women's National League North outfit Nottingham Forest 7-1 away from Walton Hall Park. Seven different players on the Liverpool club converted a chance against Forest.\nFor the second time since the turn of the new year, the three-time defending FA Cup champions Chelsea Women encounter Everton Football Club. Similar to the last fixture, the preparation for the west Londoners is limited. Brian Sorensen's crew recently gave Manchester City a run for its money away from home, falling short by a goal despite amassing two of the top-three highest post-shot expected goal chances on the afternoon.\nEmma Hayes is not taking this club lightly by any means.\n\"I like the way they play football. They build up really, really well, they are intricate between both the boxes and I’m sure Brian (Sorensen) would agree with that.\"\nShe continued, \"They are a team that have caused us problems before. It’s difficult to get a press on them because they keep the ball really, really well in their shape – generally a three-back system. They stick to that and I like watching them play.\"\nIn Sorensen's second campaign at the helm, the story has been the lack of cutting edge in the final third. The Toffees have found the back of the net from open play in the Women's Super League just five times so far, three fewer than any other club in the English top flight. That is five goals from nearly an expected goals of nine from open play.\nThe attack from Liverpool was essentially non-existent in west London in early February, not forcing Hannah Hampton into making a single save. With that being said, the away side rightfully felt hard done by the last result. It had to do with, you guessed Emily Heaslip gifting two penalties to the home side. Other than that, the outfit in blue and gray defended resolutely. Sorensen has most often deployed a back three with 25-year-old captain Megan Finnigan at the heart of it. Finnigan was out last weekend due to illness, but according to the Toffees' manager, she is \"fine\" and available for selection on Sunday.\n\"We'd love to (play spoiler), that's for sure,\" the Danish manager said regarding Chelsea's trophy hunt in Hayes' final few months. \"That is what we are planning, that's what we are aiming to do...We've been closing and we've been building to get a result and hopefully, on Sunday we can utilize that despite extremely harsh circumstances.\"\nEven with the injury list growing by the minute, Hayes will at least get ex-Everton Nathalie Björn back after she was cup-tied against Man City. Expect her back alongside Jess Carter in the center of defense while Hampton will likely be given a rest for the Swede Zecira Musovic.\nPer Hayes, some players who were on the bench in the Conti Cup will see the pitch this weekend vs. the Merseysiders. The club is smartly prioritizing health, and recovery as the season kicks into full high gear this month. Could this be the match where Catarina Macario makes her full debut? Possibly, but it's unlikely she'll be thrown out for an entire 90 minutes just yet.\nThe last defeat the Blues had at this stage of the FA Cup was in fact to Everton at Goodison Park. An early Erin Cuthbert goal wasn't enough as the Toffees came from behind to eliminate the 2018 FA Cup winners. Willie Kirk's Toffees made it all the way to the final that year, losing to City in extra time by three goals to one.\nThe FA Cup is something Hayes and this club no doubt value. With the triumph on Sunday, Chelsea will move into the semifinal hat for the fourth campaign running. Manchester United and Leicester City have already earned a place in the last four after two muti-goal road victories on Saturday evening.\nChelsea Women at Everton predicted starting XI\nGoalkeeper: Zecira Musovic\nDefenders: Jess Carter, Eve Perisset, Niamh Charles, Nathalie Björn\nMidfielders: Erin Cuthbert, Sophie Ingle, Fran Kirby\nForwards: Lauren James, Johanna Rytting Kaneryd, Aggie Beever-Jones\nChelsea Women at Everton match info\nDate: Sunday, March 10\nTime: 13:00 GMT, 9:00 a.m. EST\nTV Broadcast: BBC Red Button, The FA Player\nOnly top-flight sides remain in the FA Cup with the semifinal draw set for Tuesday morning on BBC Radio 5 Live Breakfast at approximately 8:20 GMT.",
  "word_count": 801,
  "scraped_at": "2026-02-14T12:41:05.012226"
}