{
  "article_id": "3e7aa8921c9f",
  "url": "https://www.theargus.co.uk/news/national/24597374.fresh-sex-assault-claim-mohamed-al-fayed-investigation/",
  "title": "Fresh sex assault claim against Mohamed Al Fayed after investigation",
  "date": "20240919T230000Z",
  "domain": "theargus.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A new sex assault claim has been made against Mohamed Al Fayed after an investigation into the former Harrods owner was published.\nThe woman believes police nearly arrested him over her allegations just days before he died in August 2023, she told the BBC.\nMore than 20 female former employees have spoken to the broadcaster as part of a special investigation, coming forward with allegations of assault and physical violence at properties in London and Paris.\nFive women alleged they had been raped by Mr Al Fayed, who died last year at the age of 94.\nAt a press conference on Friday, a legal team involved in the investigation is expected to share more details about a claim against the luxury department store for allegedly failing to provide a safe system of work for its employees.\nAfter the publication of the investigation on Thursday, a woman who the BBC is calling Melanie came forward to say she had been subjected to a “sickening” sexual assault by the Egyptian billionaire.\nThe woman worked at Harrods prior to 2010, and met Mr Al Fayed at work meetings on two occasions, before being summoned to his apartment, it was reported.\nMelanie, who described the businessman as a “sleazebag” and “slimy”, said: “He sat down next to me… He had asked that I return a couple of weeks later to stay at the apartments the night before the Harrods sale.\n“And he would not really let me leave until I agreed to that.\n“As I stood to leave, that’s when he put his hands on my breast and said some pretty disgusting things. And I was in complete shock. I just turned around and walked out.”\nMelanie decided to go to the police in 2023, and said she was later told Scotland Yard planned to arrest Mr Al Fayed that year.\nBut he was too unwell to be questioned, and died in August 2023, the BBC reported.\nFollowing the new allegation, Harrods’ current owners said they stood by a statement issued on Thursday which said they were “utterly appalled” by the allegations of abuse.\nThe department store has also set up a page on its website inviting former employees to come forward if they have allegations.\nMr Al Fayed was born in the Egyptian city of Alexandria and came to London in the 1960s and set about building a business empire.\nHe took control of Harrods in 1985 and later expanded his business interests to include the Paris Ritz and Fulham Football Club.\nThe tycoon was rarely out of the newspapers, with his most public attack on the House of Windsor and the Establishment over the death of his son and heir Dodi alongside Diana, Princess of Wales in the world’s most famous car crash.\nMr Al Fayed had previously been accused of sexually assaulting and groping multiple women, but a 2015 police investigation did not lead to any charges.",
  "word_count": 486,
  "scraped_at": "2026-02-14T14:14:45.326887"
}