{
  "article_id": "3e88d2bb76c9",
  "url": "https://www.ruthfullyyours.com/2024/11/25/theodore-dalrymple-britains-long-hot-summer-mass-immigration-and-an-alienated-working-class-are-a-combustible-mix-as-the-nations-recent-riots-showed/",
  "title": "Theodore Dalrymple Britain Long , Hot Summer Mass immigration and an alienated working class are a combustible mix , as the nation recent riots showed . ",
  "date": "20241125T093000Z",
  "domain": "ruthfullyyours.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Theodore Dalrymple Britain’s Long, Hot Summer Mass immigration and an alienated working class are a combustible mix, as the nation’s recent riots showed.\nhttps://www.city-journal.org/article/britains-long-hot-summer\nThe outbreak of anti-immigrant mob violence in England this summer, in which rioters went as far as to set fire to buildings with immigrants in them—for example, an attack on a Holiday Inn near Rotherham that housed 220 such immigrants, in the course of which a masked attacker entered the building and made a gesture indicating that the residents might have their throats cut—did not surprise me. It broke out after the stabbing to death of three small children, and the injury of ten more, at a dance lesson in Southport, a seaside town north of Liverpool, by the son of Rwandan refugees.\nAnyone with eyes to see, ears to hear, or the slightest imagination to exercise should have detected the undercurrent of violence long present in much of English life, a kind of magma waiting to break volcanically through the crust of normal day-to-day existence. But none are so blind as those who will not consider the evidence, because it points to a reality too painful to contemplate: the murders in Southport were the perfect pretext for the expression of semi-organized brutishness, some of the rioters with extensive criminal histories. And understandably, if hypocritically, it appalled those who had long denied that any problem could arise from two deep-seated social maladies: the coarseness of English popular culture; and years of mass immigration and the increasing formation of ghettos.\nEven in times of social peace, few sounds are as terrifying to me as that of young English people enjoying themselves in a certain kind of pub. More than one such pub is located near where I live. A kind of deep-throated male baying emanates from them, punctuated by female screams, whether of laughter and amusement or of fear and distress, it is not always easy to tell. Once, in Manchester, I was woken in my hotel at about 1:30 am by what I took to be normal drunken English revelers noisily heading home. The next morning, I discovered, upon stepping out of the hotel, a police cordon around the place below my window, where a young man had been kicked into a coma (whether he ultimately died, I don’t know). The sound of these Englishmen enjoying themselves and that of committing joint murder were basically the same.\nViolence can erupt at any time in these establishments. A wrong word, an eye caught by a glance at the wrong moment, and punches will be thrown, glasses smashed, even knives drawn; as the colloquial expression goes, “it kicks off,” the “it” being a brawl. In my small market town, so quiet by day, a six-foot-wide bouncer stands outside one of the pubs at night, both preventively and curatively: no socialization seems to occur there without the threat, possibility, and even likelihood of violence.\nThe sheer ugliness of the revelers almost defies description. It is not just a physical ugliness, of the kind that some are unfortunate to be born with; it is an ugliness of soul, a wished-for, voluntary ugliness, as if in revenge for something. The men’s faces are bone and bristle, their jaws clenched, their expressions coarse, easily evoking anger and hatred, about as subtle as emojis. Their clothes are ugly, their manners are ugly, their tastes are ugly. It is not just that they are unrefined; they hate refinement as if it were an enemy, and they sense that it is a reproach to them. The women, too, are coarse. It is almost as if they have done everything possible to make themselves inelegant. They do not seem to laugh; they screech, in the apparent belief that the louder they are, the more they are enjoying themselves, or will be taken to be enjoying themselves. “Evil, be thou my good,” said Satan on his expulsion from heaven. “Ugliness, be thou my beauty,” say a proportion, not necessarily insignificant, of the English population.\nThis will be obvious to all visitors to our shores who do not confine themselves to the beauty spots and tourist traps but venture into the towns and cities, where most of the population lives, and spend, say, a week there. (A writer for the New York Times once came to investigate whether I exaggerated, and it took him precisely ten minutes in the center of an English city on a Saturday night to convince him that I did not.) But if the truth of this is evident, so is its widespread denial on the part of the intellectual class. Anyone daring to draw attention to the degradation of much of English popular culture is accused of the worst class prejudice, considered a form of blaming the victim as well as of snobbery. Such people are not as they have been depicted, the argument goes, and, in any case, even if they are, it is not their fault. Anyway, from what Archimedean cultural point can one criticize a culture or subculture? Who is to say what is better or worse, higher or lower, more desirable or less?\nNor is this all: for a long time, the idea has held sway that our society is totally unjust, that it has been responsible only for cruelties and miseries, and not for any achievements, and that the only way that the unjustly fortunate can atone for their success, and make amends, is by imitating those on the social scale lower than themselves, which they have proceeded to do. Downward cultural (though not economic) aspiration becomes a signal of political virtue, a proof that one sympathizes with the insulted and injured. This shows up in any number of small ways, from the publicly acknowledged musical tastes of the political class to the prevalence of the word “fuck” and its cognates in the everyday speech of people of high social class.\nI was once what I like to call the vulgarity correspondent of a British newspaper that, to put it mildly, faced in more than one direction when it came to vulgarity. On one page would appear a thunderous denunciation of vulgarity (sometimes by me) and, on the page opposite, a pure example of what had just been denounced. The newspaper would have me report on places where young British people were gathering and expected to behave badly, which was practically everywhere they gathered. I was sent to Ibiza (one of the Balearic Islands), where I saw scenes of the young British holidaymakers that would make Sodom and Gomorrah seem like a Japanese tea ceremony. What was perhaps most disturbing was their prideful nature; seeing that I had a press photographer with me, they begged to have their photograph taken in the most obscene postures possible, so that millions would see them thus. Drunk, vomiting, fornicating in the street—this was not unself-conscious misbehavior by people who knew no better but an almost ideologically inspired revolt against civilized conduct.\nThe partiers were not of high social class, but they could hardly claim to be paupers, either. Even more significant in this regard was a football match I was sent to observe in Rome, in which England played Italy in a supposedly friendly exhibition. Ten thousand supporters of the England team traveled to the Eternal City, and there disported themselves as we had come to expect of such supporters. By definition, almost, they could not have been poor, as someone on the dole is unlikely to pay to travel to Rome and stay overnight, just to watch a football match that he or she could have watched on television. Indeed, the crowd seemed composed of middle-class people, presumably with decent jobs—yet they behaved crudely, shouting obscenities in unison.\nAt the airport on the way back, I stood behind a woman, about 30, who spoke when she dealt with the person behind the counter in the unmistakable tones of the upper middle class. I saw her again on the bus from the terminal to the aircraft on the apron. She had reunited with her fellow supporters, and her language and manner had changed: she now swore and adopted a lower-class accent; she wanted to appear as if she were a British hooligan.\nI could give many other instances of the same phenomenon. One sticks in my mind. Some years back, I read the Times obituary of the pop singer Ian Dury. He was, in some ways, an estimable man, witty and highly intelligent. He overcame disability by polio to become a performer, and only a clever and educated person could have written and sung the following lyrics:\nIn the deserts of Sudan\nAnd the gardens of Japan\nFrom Milan to Yucatán\nEvery woman, every manHit me with your rhythm stick\nHit me! Hit me!\nJe t’adore, ich liebe dich.\nHit me! Hit me! Hit me!\nOne sentence in the obituary, however, stood out. Dury, it said, rebelled against what he deemed the false gentility of the school he attended, the Royal Grammar School, High Wycombe (founded in 1562), and adopted instead what he considered the more authentic tones of South London. The implication: only what is of lower social class is authentic; and presumably, what is of the lowest is most authentic of all.\nBefore the recent election, Britain’s new prime minister, Keir Starmer, said that he would not raise taxes for what he called “working people.” Asked what he meant by “working people,” he said that they were people who worked, had no savings, and depended on public services. All others, presumably, apart from the unemployed, were not working people but exploiting people. This is cultural authenticity in the economic sphere—a dismal philosophy indeed.\nWhen I have looked at people who wore ugliness almost as a uniform, I have often thought that, if ever an evil genius arose to organize them politically, they could and would do untold evil: they were excellent fodder for fascism, not of the metaphorical kind so beloved of liberal commentary but of the real boot-in-the-face, beating-up-people-in-the-street kind. If they thought they had a political cause, there is little that they would stop at—unless they were stopped.\nThe social (or antisocial) media have partly dispensed with the need of a leader, at least to start the kind of jacquerie seen recently in England. The supposed cause was the murder of the children and the injury to the others, following an online rumor that the culprit was an asylum-seeking Muslim. This turned out to be wrong: the culprit was the son, born in Britain, of Rwandan refugees, respectable and strongly churchgoing people. For what it is worth, as soon as I saw the court drawing of the accused, I thought that he was mad, either from intrinsic illness or from drug consumption, or from both: he had the kind of wild, unkempt hair that people who neglect themselves in a state of madness often have.\nIf I am right, the courts will come under intense public pressure not to follow the law and deal with him in medical fashion, as they normally would, so great has been the emotion evoked by the case. For psychiatric disposal, as it is called, would raise the possibility, the intolerable specter, of a cure, in which event, he would have to be released from custody. Further public unrest might follow.\nThe falseness of the rumor was widely publicized; less publicized was its plausibility. Only seven years had passed since Salman Abedi and his brother Hashem, sons of Libyan asylum-seeking parents, both Muslim extremists, planted a bomb that killed 22 people in the Manchester Arena and injured up to 1,000 more. Salman Abedi was in contact with, and allegedly influenced by, Abdalraouf Abdallah, also the son of Libyan asylum-seekers, a terrorist held in a British prison for helping young British Muslims join ISIS in Syria. Manchester is only 50 miles away from Southport. Soon after the riots, a knife-wielding Syrian refugee killed three people at a festival in Germany, and a synagogue in the south of France was set on fire, probably in the hope of causing many deaths.\nOther examples of tension brought about by large-scale immigration, both legal and illegal, abound. Rotherham, one of the towns worst affected by the riots, was the location of the organized sexual abuse, over the course of more than two decades, of 1,400 young white women (and some others) by men of Pakistani descent, legally British, which the authorities, including the police, knew about but ignored, from a mixture of fear of stirring racial hatred and the purest cowardice. (See “Of a Scale Unknown,” Winter 2023.) I stayed a few weeks in Rotherham around a decade and a half ago, when the abuse was still rampant. The city was used as a dumping ground for asylum-seekers, mainly Kurdish—in the official hope, I suspected, that life in that city was so dismal that the migrants would soon apply to go home. Not one was an asylum-seeker in the literal sense, for none could have arrived in Britain directly from where he (and they were invariably men) was in danger but must have passed through at least one safe country beforehand. They were illegal immigrants—in practice, impossible to remove from the country; once granted residence, as eventually they would probably be, they would apply for family reunification, bringing over relatives. I would eat during my stay in a Kurdish café, above which was a pool hall, where they could while away their time; another place of recreation was the municipal central library, where they would use the computers to access as near to pornography as the library servers would allow.\nRotherham was not the only town with a sexual abuse scandal. Another, 15 miles from where I live, was said to have had the worst of them, proportionately, of any in England; social services deliberately ignored cases—again, for fear of appearing racist. (No one raised the question of why so many young girls and women proved so vulnerable to exploitation. That, too, is a question best avoided, from the liberal point of view.)\nIt is hardly surprising that discontent and resentment have simmered among many in the country, a sense of impotence to do anything about a situation that no one ever wanted: a widespread feeling, whether justified or not, that a social experiment has been performed on them at the behest, or for the benefit, of a nameless elite.\nIt is in the nature of jacqueries that they should die down, and that has happened here—whereupon those opposed to them took to the streets with slogans such as “Refugees welcome” and even “Open borders.” The smugness of the slogans and the people promoting them was obvious. They allowed no question—how many refugees were welcome, how and based on what criteria they should be selected among millions of possible applicants, and who was to pay for them—to interfere with their self-satisfaction. In a context of rising rents and worsening homelessness, declining per-capita GDP, mass worklessness, and immigration into the country of the equivalent of nearly 1 percent of the population (greater, when emigration is taken into account), such self-satisfaction is sure to stoke the resentment of those who suffer most from the effects of mass immigration. Nothing is quite like the moral complacency of the prosperous for infuriating those with precarious livelihoods.\nOf course, the thugs attacking mosques and burning police cars are not really defending a national tradition or culture. Of the glories of their own national culture, they are probably as ignorant as a newborn babe, and much in their current way of life is unattractive, even reprehensible. But every time someone beatifically holds aloft a banner welcoming more “refugees,” whose burden others are to bear, he provides fuel to a part of the population that could become authentically and literally fascist.\nOne of the riots’ ironies (if they were merely an episode and not the shape of things to come) was that liberal intellectuals rediscovered the social value of punishment, which they had previously denied, both on pragmatic and philosophical grounds. Punishment did not work, they had long argued: it neither deterred nor reformed. Besides, it was unjust, merely cruel and vengeful, for wrongdoers were the victims of their circumstances. What they needed was a moral form of physical therapy, or rehabilitation.\nNothing like this was heard during the riots. What was needed in response to them, the liberals maintained, was severe and rapidly administered punishment (with which I wholeheartedly agree). If rioters could count on a few years’ prison time, there would be fewer of them in years to come, no matter their feelings of resentment. There was no talk of rehabilitation. No psychologist was consulted as to how the rioters should learn to reorder their thoughts so that they became good citizens or to manage their anger so that they did not act on it. No one, as far as I noticed, suggested that rioters were the victims of their circumstances, and therefore the true victims of their own behavior.\nBut neither did anyone explain why the principle or principles of punishment should not apply to the kind of people—burglars, robbers, and violent criminals—upon whom so much liberal, anti-punitive theorizing had been expended during the long period when Britain went from being a low- to a high-crime society. On the contrary, while (again, rightly) the state will imprison the rioters, it will release other criminals from prison to make way for them. The general tenor of criminal-justice policy of the new Labour government is that of the now deeply entrenched liberal penology.\nThroughout the riots and their aftermath, the epigraph of the late Richard Pipes’s history of the Russian Revolution recurred to me often: “The paralytics in the government are struggling feebly, indecisively, as if unwillingly, with the epileptics of the revolution.” This was originally said by Ivan Shcheglovitov, the czarist minister of justice, in 1915. No historical analogy is exact, but what one might say of contemporary Britain is that the self-righteous paralytics of the status quo have struggled, so far successfully, with the epileptics of the class of brutes, while the majority of the population looks on, impotent.\nComments are closed.",
  "word_count": 3032,
  "scraped_at": "2026-02-14T12:10:15.583820"
}