{
  "article_id": "3e8ac5327c7e",
  "url": "https://www.bbc.com/news/articles/cx2p7r89z5vo",
  "title": "ACL - hit Essex female footballer plea for more support",
  "date": "20251203T074500Z",
  "domain": "bbc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "ACL-hit female footballer's plea for more support\nA footballer is crowdfunding for career-saving surgery after she became one of the latest female players to suffer an anterior cruciate ligament (ACL) rupture.\nLucy Connolly-Brame, 20, suffered the knee injury \"everyone fears\" playing for Hashtag United, an Essex-based side, in the FA Women's National League South.\nShe is now calling for more financial support for female footballers who play outside the professional leagues, amid concern about the number of ACL injuries.\n\"Something has to be put in place, if it's insurance, health care - some sort of way to help us,\" said Connolly-Brame, who has also played for Lewes in East Sussex.\nThe ACL is a band of tissue in the knee joint. It helps the knee move and stay stable and allows short, sharp turns and pivots.\nConnolly-Brame felt a sharp pain during an FA Cup match with Oxford United in October.\n\"I was running and felt a pop in my knee, and it sounded like a water bottle crunching.\n\"I fell to the ground and I just knew. I said to my captain 'it is my ACL'.\n\"It's one of the worst injuries.\n\"Every single player fears it, but I never thought it would happen to me. When I got over the pain, it set in that I would be out for the season.\"\nConnolly-Brame, originally from Haverhill, Suffolk, was devastated when she was told her ACL had ruptured. There was also damage to other knee ligaments.\n'Who has £12k in their pocket?'\nFaced with an NHS wait of up to a year followed by months of recovery, the defender - desperate to get back on the pitch - felt she had to go private.\n\"The NHS wait was too long, so I found out the price for the surgery. Realistically, I can't afford it: £12,000. Who has that in their back pocket?\"\nCrowdfunding meant Connolly-Brame, \"amazed\" by the support, raised more than £9,000 with help from Hashtag United.\nThe club was set up as an exhibition team in 2016, but it later moved into league football. The women's first team play their home matches at Canvey Island.\nShe got another £2,000 from England and Chelsea star Reece James.\n\"I randomly saw that Reece James donated a lot of money, which gave me a big boost. I was shocked when I saw he had messaged. I feel so blessed,\" she said.\nThe Professional Footballers' Association (PFA) represents players in fully professional leagues: the Premier League and English Football League for men, and the Women's Super League (WSL) and WSL2 for women.\nBut that leaves third-tier female players without support. Connolly-Brame and her teammates want change.\n\"We're one step away from pro, just below WSL2.\"\nOther female Hashtag United players have suffered ACL injuries.\nEmma Samways crowdfunded private surgery.\nShe said: \"The stages are so hard. The injury, receiving the diagnosis, finding a consultant. The recovery physically, and then mentally too. It's such a long journey.\n\"I do fear doing it again, but I've taken precautions now with private health care. It's something that I'd like clubs in the women's game to have.\n\"I've tried to advise all the girls now about finding private medical care before you can step onto a football pitch.\"\nEngland youth physiotherapist Jimmy Reynolds, who used to be with Ipswich Town, said it was a growing problem in the women's game.\n\"Ninety percent of the ACLs I see are female, and the numbers are growing. It's a big issue.\"\nHe said differences between female and male anatomy, including the angle between the hip and knee, may contribute.\n\"The game is growing exponentially, as is competition, game time and load.\n\"Surfaces are different. These are all factors,\" he said.\nHashtag United founder Spencer Carmichael-Brown said sporting bodies needed to do more to protect players at tier 3 level.\nHe expressed frustration at the growing number of ACL injuries.\n\"We are the third tier of women's football, and are often compared to the men's third tier. But we don't have their sort of money. All teams operate at a significant loss.\n\"The reality of our football club is, if we were self-funding ACL injuries like this, our club would soon not exist.\nIn a statement, an FA spokesperson said: \"Player welfare is of paramount importance, and we introduced enhanced criteria for all tier 3 and 4 clubs in the FA Women's National League in 2023.\n\"We remain committed to advancing research, policy, and medical education... we are very sorry to hear about the injury to Lucy, and we wish her a full and speedy recovery.\"\nThe PFA has been approached for comment.\nFollow East of England news on X, Instagram and Facebook: BBC Beds, Herts & Bucks, BBC Cambridgeshire, BBC Essex, BBC Norfolk, BBC Northamptonshire or BBC Suffolk.",
  "word_count": 800,
  "scraped_at": "2026-02-14T12:59:04.804062"
}