{
  "article_id": "3e90aadd07af",
  "url": "https://www.poynter.org/reporting-editing/2023/donald-trump-kayleigh-mcenany-poll-numbers-desantis/",
  "title": "Now look who Trump is going after",
  "date": "20230601T140000Z",
  "domain": "poynter.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "She was one of the most inept and irresponsible White House press secretaries in recent history, but Kayleigh McEnany was also something else that you absolutely cannot deny: She was fiercely loyal to her boss Donald Trump.\nWho cares?\nThat seems to be Trump’s thinking.\nIt didn’t take much for Trump to turn on McEnany, who is now a host on Fox News. Apparently, Trump didn’t like some poll numbers that McEnany referred to during a segment on Fox News and that set him off.\nOn his Truth Social, Trump posted, “Kayleigh ‘Milktoast’ McEnany just gave out the wrong poll numbers on Fox News. I am 34 points up on DeSanctimonious, not 25 up. While 25 is great, it’s not 34. She knew the number was corrected upwards by the group that did the poll. The RINOS & Globalists can have her. FoxNews should only use REAL Stars!!!”\nA couple of things. First off, Trump misspelled his nickname for McEnany. It’s “milquetoast” not “milktoast.” And, secondly, apparently McEnany was not suggesting that Florida Gov. Ron DeSantis is, at the moment, threatening Trump. But it didn’t matter. Trump went after someone who was always, and literally, the first to defend him.\nFox News chief political analyst Brit Hume tweeted, “Imagine being so immature as to attack your former press secretary, who was nothing if not loyal, for allegedly misquoting a poll number.”\nI actually thought Hume put that pretty well: She was nothing if not loyal to Trump.\nHmm, the Trump-Fox News relationship is getting interesting. Trump doesn’t want to burn Fox News too much, but he seemingly can’t help himself. And Fox News needs Trump because many of its viewers are Trump fans.\nThe love-hate relationship is a codependent one.\nInteresting sidenote\nOn Wednesday, Vanity Fair’s Charlotte Klein wrote a story about how a recent New York Times profile of now-jailed Theranos fraudster Elizabeth Holmes led to some pushback in the Times newsroom and is causing some drama. I actually wrote about that Times’ story and found it to be a revealing profile. The argument against it is that it might have come off as a little too sympathetic to a person who did the awful things Holmes did — awful enough that she just started an 11-year prison sentence.\nThere’s an interesting common thread through all this. The Times recently hired John Carreyrou, who was the reporter who broke the story exposing Holmes and what was going on at Theranos. He was at The Wall Street Journal at the time and even went on to write a book about it.\nKlein reported that the Times held off announcing the hiring of Carreyrou until the author of the Holmes’ piece, Amy Chozick, could interview Holmes. (Chozik is a former Times staffer who is now a writer-at-large.) The fear was Holmes could be spooked by such news. Klein also reported that Carreyrou read the Chozik story on Holmes before it was published and did not like it. Klein also reported that Times executive editor Joe Kahn did like it.\nThe editor of the Holmes’ story — business editor Ellen Pollock — defended the story in an all-hands meeting at the Times on Tuesday.\nAfter her Vanity Fair story, Klein tweeted about it and then dropped this nugget: “Side note: also at Tuesday’s meeting, biz editor Ellen Pollock said she is no longer actively looking for a new media columnist.”\nWow. That’s a stunner. The Times has been without a “Media Equation” columnist since the beginning of 2022 when Ben Smith left to co-found the news site Semafor.\nThere have been rumors of various names being considered for the job — The Washington Post’s Sarah Ellison, Puck’s Dylan Byers and former Times and CNN media reporter Brian Stelter — but nothing has happened. And based on Klein’s tweet, nothing is happening for the time being.\nSo, if you’re keeping score at home, the Times hasn’t replaced Smith and The Washington Post hasn’t replaced Margaret Sullivan, meaning neither has a media columnist. They have plenty of media reporters, but not a media columnist.\nSullivan tweeted, “The media-columnist role, a frequent annoyance to top editors (almost as much as an ombudsman/public editor) also has gone the way of the dodo at the Washington Post. (I left last August).”\nLet’s talk about objectivity … some more\nThe smart media story of the day goes to my Poynter colleague Kelly McBride: “Stop arguing about objectivity and start serving your audience.”\nIf you’re a follower of the media, you might have noticed that there have been a string of essays/columns/think pieces of late regarding the idea of objectivity in the media.\nFormer Washington Post editor Marty Baron wrote a piece for the Post in March with this headline: “We want objective judges and doctors. Why not journalists too?”\nThen Pulitzer Prize-winning journalist and former Post staffer Wesley Lowery wrote something for the Columbia Journalism Review: “A Test of the News. Objectivity, democracy, and the American mosaic.”\nThen New York Times publisher and chairman A.G. Sulzberger wrote a 12,000-word essay for CJR about objectivity: “Journalism’s Essential Value.”\nAll three separately and together caused quite the buzz in the media world.\nSo McBride tackled it by writing, “I teach ethical decision-making to professional journalists and consult with newsrooms on their standards. I think about this stuff all the time, but I was having a hard time describing to non-journalists exactly what the controversy is and why it matters.”\nTo help, she called on three people with journalism ties who are really smart about this stuff:\nLongtime press critic and now professor Tom Rosenstiel. Keith Woods, who has focused on diversity efforts in journalism, first at Poynter and now at NPR. And Candice Fortman, who left a local public radio station in Detroit to join a news startup, Outlier, also in Detroit.\nMcBride moderates the discussion with this fundamental question: What is this debate really about?\nIt’s a thorough and informative conversation that is definitely worth your time, so take a few moments to read it.\nCBS News’ solid hire\nHere’s a good move by CBS News. It has hired Lisa Ling as a contributor.\nLing has a long career in journalism, most recently as host and executive producer of “This is Life with Lisa Ling” on CNN — a show she did for eight years.\nIn a statement, Neeraj Khemlani, president and co-head of CBS News and CBS Television Stations, said, “Lisa delivers some of the most authentic, human and revealing interviews because of how she embeds with communities and the people she covers. It gives her and us a chance to communicate the pulse of the country and the world in a more experiential way.”\nLing said, “I can’t think of a better home for my style of reporting than CBS News, given its tradition of exceptional news gathering and thoughtful storytelling.”\nLing will start her new job this summer and will be based out of Los Angeles.\nA powerful story\nTwo years ago, CBS News producer Adam Zeelens was violently attacked by two strangers on Fifth Avenue in New York City. He suffered a deep and long gash to the side of his face. For the first time since the attack, Zeelens publicly told his story in this essay for “CBS Mornings.”\nHe details the attack and his long road to recovery — physically, mentally and emotionally — and said, “Once, I was knocked down. But today, I stand tall.”\nThe piece was the last in a series for Mental Health Awareness Month.\nAn equally powerful story\nI also wanted to direct you to this brutally honest and inspiring story from Ellen E. Clarke, assistant managing editor at the Tampa Bay Times: “I was diagnosed with colorectal cancer at 43. Let’s get uncomfortable.”\nClarke chronicles her difficult fight through writing that is heartfelt, funny, vulnerable and, most of all, blunt.\nA big deal\nWe’re now hearing about the enormous contract that Pat McAfee signed with ESPN. New York Post sports media columnist Andrew Marchand reports McAfee’s deal with ESPN is for five years and around $85 million. McAfee walked away midway through his deal with FanDuel, which was reported to be $120 million for four years.\nMcAfee is bringing his popular YouTube show/podcast to ESPN, where he also will continue to work on the college football pregame show, “College GameDay.” And for the amount of money he will be paid, don’t be surprised to see him show up on other ESPN shows.\nThe optics of signing McAfee to such a megadeal are not great as ESPN (and parent company Disney) are going through several rounds of massive layoffs. But at the same time, I don’t know that you can blame ESPN for continuing to do business — and that means attracting major talent to its airways. You can’t do that without paying big bucks. Ultimately, the real impact is how ESPN employees reconcile it all.\nMarchand wrote that in a written private exchange on Twitter, McAfee “expressed genuine regret with the recent ESPN layoffs.” Marchand wrote, “The production deal he has inked with ESPN really doesn’t have anything to do with the 7,000 Disney jobs Iger ordered cut.”\nMedia tidbits\n- Notable media move. Imtiaz Patel, the CEO of The Baltimore Banner, will step down this summer to join Gannett in a senior leadership role. The Baltimore Banner’s Liz Bowie has more. This is a curious move and deserves some more attention in the days/weeks ahead.\n- Gideon Lichfield is out after two years as editor-in-chief at Wired. The New York Times’ Katie Robertson has the note Lichfield sent to staff.\n- Scott Detrow has been named weekend host of NPR’s “All Things Considered” as well as co-host of the daily podcast, “Consider This.” Detrow has served as White House correspondent for NPR since 2020 and co-hosts “The NPR Politics Podcast.”\n- The New York Times’ Brett Anderson and Julia Moskin with “James Beard Foundation, Whose Awards Honor Chefs, Is Now Investigating Them.”\n- By the way, the Times’ James Beard Foundation story is another example of how the news outlet has changed its bylines/datelines to provide more context to its story. In the online version of this story, writers Brett Anderson and Julia Moskin were named with the following under their bylines: “In more than 25 years as a food reporter, Brett Anderson has reported extensively on workplace abuse in the restaurant industry. Julia Moskin, who reports on sexual harassment and workplace abuse in the restaurant and wine worlds, has covered the James Beard Foundation for nearly two decades.”\n- Brooke Brower, who had been managing editor of CNN Politics, has been named the new executive producer of ABC’s “This Week With George Stephanopoulos.” Brower succeeds Dax Tejera, who died unexpectedly late last year at the age of 37 from, the official report said, “asphyxia due to obstruction of airway by food bolus complicating acute alcohol intoxication.” Before CNN, Brower worked at MSNBC.\n- Luciana Lopez, most recently the deputy managing editor of politics and elections of USA Today, is joining CNN Business as managing editor. She follows David Goldman, who was promoted to executive editor of CNN Business last fall. During her career, Lopez has worked at MSNBC, Reuters and The Oregonian.\n- Here’s a good scoop from the New York Post’s Ryan Glasspiegel: “Shannon Sharpe leaving FS1’s ‘Undisputed.’”\n- Ebony’s DeAnna Taylor talks with ESPN “SportsCenter” anchor Elle Duncan, who says, “What I would love to see in the future, is not just Black men and women on camera, but more behind the camera. There’s not a lot of us in control rooms, directing, producing or even in PR. The next wave is really cultivating a crop of new talent off-air, so we are represented truly in every single space. That’s where the real bosses are.”\n- The Miami Heat’s Game 7 victory against the Boston Celtics on Memorial Day on TNT drew 11.9 million viewers. That made it the most-watched NBA Eastern Conference final game ever and the third-most-watched NBA game of all time on TNT. For the entire NBA playoffs, TNT averaged 4.7 million viewers. That’s a 14% jump over last year and the most-watched postseason on TNT in five years.\nHot type\n- Absolutely sensational work from The New York Times’ visual investigations team with Christiaan Triebert, Blacki Migliozzi, Alexander Cardia, Muyi Xiao and David Bott: “Fake Signals and American Insurance: How a Dark Fleet Moves Russian Oil.”\n- Another really good Times piece, this one a little more light: Alex Marshall with “Was Queen’s ‘Bohemian Rhapsody’ Originally ‘Mongolian Rhapsody’?”\n- Be sure to watch the latest episode of PBS’s “Frontline”: “After Uvalde. Guns, Grief & Texas Politics.”\n- The NBA Finals start tonight on ABC with the Denver Nuggets hosting the Miami Heat. Here’s a smart and innovative piece about Denver’s star from Washington Post sportswriter Ben Golliver and graphics reporter Artur Galocha: “The sublime brilliance of Nikola Jokic.”\nMore resources for journalists\n- Bring Poynter to Your Newsroom, Classroom or Workplace.\n- How to Improve Your Coverage of LGBTQ+ Communities (Webinar) — Start anytime.\n- Sign up for Beat Academy (Now-Oct. 19) (Webinar series) — You’ll get tips, sources, inspiration and ideas to cover emerging newsroom beats. Enroll now.\n- Executive Leadership Summit (Oct.) (Seminar) — Apply by Aug. 14.\nHave feedback or a tip? Email Poynter senior media writer Tom Jones at tjones@poynter.org.\nThe Poynter Report is our daily media newsletter. To have it delivered to your inbox Monday-Friday, sign up here.",
  "word_count": 2254,
  "scraped_at": "2026-02-14T13:48:25.200347"
}