{
  "article_id": "3e9ee5b90a40",
  "url": "https://www.ealingtimes.co.uk/news/24453632.england-success-will-inspire-next-generation-believes-hurst/",
  "title": "Hurst believes England success will inspire next generation",
  "date": "20240715T194500Z",
  "domain": "ealingtimes.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sir Geoff Hurst believes England’s continued success at international level will inspire the next generation and boost the grassroots game across the country.\nThe last surviving member of the England 1966 World Cup winning squad was speaking this morning at a special National Lottery event and football session at Young’s FC, a junior football club in Wembley, just hours after England’s narrow defeat to Spain in their second consecutive European Championship final.\nThe 82-year-old, who famously scored a hat trick in the 1966 final, met coaches and young players from the grassroots community club who were among millions across the country who watched last night’s game where a late Mikel Oyarzabal goal saw Spain take a record fourth European Championship.\nHurst said: “This is a phenomenal time for English football with the recent success of the Lionesses and England’s men making it to the final yesterday and coming so close.\n“Although it wasn’t quite the result we were all hoping for last night, we can still be very proud of how well our men’s and women’s international teams are performing – and this is still an incredible moment in time for the grassroots game.”\nSir Geoff Hurst believes England’s continued success at international level will inspire the next generation and boost the grassroots game across the country.\n“We’ve seen the impact that funding has at clubs like here at Youngs FC where, thanks to National Lottery players, over £400m of National Lottery funding has gone into grassroots football over the last 22 years. This has given more girls and boys the opportunities to play the game and help community clubs across the country.”\nHurst was joined at the event by former Lioness Anita Asante and Sport England’s Executive Director Phil Smith.\nYoung’s FC were set up in 2016 and have grown to 18 boys and girls’ teams and over 200 players thanks in part to support from the National Lottery, who have invested over £47m into the grassroots game since 2021, when England also reached a European Championship final.\nFormer Lioness, Anita Asante, added: “Football in this country is in fantastic shape with our men’s teams reaching back-to-back Euros finals and of course the Lionesses winning the Euros at Wembley in 2022 and appearing in last year’s World Cup Final.\n“We’ve witnessed a huge surge of interest in the women and girls’ game as a result, but those opportunities for girls and boys to play and follow in their heroes' footsteps can only be realised thanks to the investment in the grassroots game by The National Lottery.”\nSport England Executive Director, Phil Smith said: “The best way we can ensure future success of both our men’s and women’s teams is by continuing to invest in grassroots football and facilities.\n“Most if not all of those England players would have started out at a grassroots club or facility and that’s because of the money that the National Lottery invests.\n“That funding has a massive impact at all levels of the game and importantly keeps the nation playing and fit and healthy.”",
  "word_count": 510,
  "scraped_at": "2026-02-14T13:05:04.998347"
}