{
  "article_id": "3e9fd294f2c6",
  "url": "https://www.macleayargus.com.au/story/8920818/south-west-rocks-netball-unveils-its-new-uniform-design/",
  "title": "South West Rocks netball unveils its new uniform design | The Macleay Argus",
  "date": "20250328T064500Z",
  "domain": "macleayargus.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "NEW UNIFORMS\nSubscribe now for unlimited access.\nor signup to continue reading\nSouth West Rocks Netball Club will be making an impression for more than just their on-court skills when the season commences on April 5.\nThe club has updated their players' uniform, adopting a design that is not only visually stunning, but also incorporates elements of local indigenous culture.\nThe new design is the work of local indigenous artist - and netball dad - Stephen McLeod, who worked with the club and uniform supplier, JR Sportswear to develop the finished product.\nThe club says that the new uniforms appropriately reflected and respected the local community as well as the traditional owners of the land, the Dunghutti people.\n\"We've gone with the uniform refresh as are really committed to fostering a supportive and inclusive netball club,\" club president Gill Cotter said.\nFurther aiding the implementation of the new playing strip, the uniforms are being supplied without additional cost thanks to the generosity of local businesses sponsoring the initiative.\nThe design\nThe design incorporates a number of different motifs, such as the feet that symbolise both the personal and collective journey of the individual and team.\nThe shells represent the coastal people of South West Rocks, while the arches (\"U\" shapes) honour the women and girls of South West Rocks Netball Club, reflecting their strength and unity.\nThe sea creatures featured are found in the region's coastal waters, representing Dunghutti country.\nNetball in the region\nAs with the rest of Australia, netball remains the number one participation sport for girls in the Macleay area.\nWhile it remains in that position, which it has held for many years, it has also seen an incremental rise in female participation in sports traditionally associated with men and boys.\nFootball (soccer), AFL, rugby league - and league tag - have all grown in popularity among girls and young women.\nWhile it is far from losing its place at the top, netball is seeking to retain players and keep the sport in its position within the cultural landscape.\n\"Netball champions leadership and personal growth, teamwork, it's a true team sport - no one person can dominate in a game and you really have to work with your teammates,\" Mrs Cotter said.\n\"We aim for it to be fun and to build friendships.\"\nSeason starts Saturday, April 5. For more information contact the Macleay Netball Association via their website: macleaynetball.com.au or facebook page",
  "word_count": 406,
  "scraped_at": "2026-02-14T12:49:15.095885"
}