{
  "article_id": "3ebcb4b1369e",
  "url": "https://www.yardbarker.com/nfl/articles/the_best_teams_of_the_2020s/s1__40683586",
  "title": "The best teams of the 2020s",
  "date": "20240803T061500Z",
  "domain": "yardbarker.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "- Home\n- Quizzes\n- My Quiz Activity\n- Newsletters\n- MY FAVORITES\n- Add Sports/Teams\n- SPORTS\n-\nNFL\n- NFL Home\n- Arizona Cardinals\n- Atlanta Falcons\n- Baltimore Ravens\n- Buffalo Bills\n- Carolina Panthers\n- Chicago Bears\n- Cincinnati Bengals\n- Cleveland Browns\n- Dallas Cowboys\n- Denver Broncos\n- Detroit Lions\n- Green Bay Packers\n- Houston Texans\n- Indianapolis Colts\n- Jacksonville Jaguars\n- Kansas City Chiefs\n- Las Vegas Raiders\n- Los Angeles Chargers\n- Los Angeles Rams\n- Miami Dolphins\n- Minnesota Vikings\n- New England Patriots\n- New Orleans Saints\n- New York Jets\n- New York Giants\n- Philadelphia Eagles\n- Pittsburgh Steelers\n- San Francisco 49ers\n- Seattle Seahawks\n- Tampa Bay Buccaneers\n- Tennessee Titans\n- Washington Commanders\n-\nMLB\n- MLB Home\n- Athletics\n- Arizona Diamondbacks\n- Atlanta Braves\n- Baltimore Orioles\n- Boston Red Sox\n- Chicago White Sox\n- Chicago Cubs\n- Cincinnati Reds\n- Cleveland Guardians\n- Colorado Rockies\n- Detroit Tigers\n- Houston Astros\n- Kansas City Royals\n- Los Angeles Angels\n- Los Angeles Dodgers\n- Miami Marlins\n- Milwaukee Brewers\n- Minnesota Twins\n- New York Yankees\n- New York Mets\n- Philadelphia Phillies\n- Pittsburgh Pirates\n- San Diego Padres\n- San Francisco Giants\n- Seattle Mariners\n- St. Louis Cardinals\n- Tampa Bay Rays\n- Texas Rangers\n- Toronto Blue Jays\n- Washington Nationals\n-\nNBA\n- NBA Home\n- Atlanta Hawks\n- Boston Celtics\n- Brooklyn Nets\n- Charlotte Hornets\n- Chicago Bulls\n- Cleveland Cavaliers\n- Dallas Mavericks\n- Denver Nuggets\n- Detroit Pistons\n- Golden State Warriors\n- Houston Rockets\n- Indiana Pacers\n- Los Angeles Clippers\n- Los Angeles Lakers\n- Memphis Grizzlies\n- Miami Heat\n- Milwaukee Bucks\n- Minnesota Timberwolves\n- New Orleans Pelicans\n- New York Knicks\n- Oklahoma City Thunder\n- Orlando Magic\n- Philadelphia 76ers\n- Phoenix Suns\n- Portland Trail Blazers\n- Sacramento Kings\n- San Antonio Spurs\n- Toronto Raptors\n- Utah Jazz\n- Washington Wizards\n-\nNHL\n- NHL Home\n- Anaheim Ducks\n- Boston Bruins\n- Buffalo Sabres\n- Calgary Flames\n- Carolina Hurricanes\n- Chicago Blackhawks\n- Colorado Avalanche\n- Columbus Blue Jackets\n- Dallas Stars\n- Detroit Red Wings\n- Edmonton Oilers\n- Florida Panthers\n- Los Angeles Kings\n- Minnesota Wild\n- Montreal Canadiens\n- Nashville Predators\n- New Jersey Devils\n- New York Islanders\n- New York Rangers\n- Ottawa Senators\n- Philadelphia Flyers\n- Pittsburgh Penguins\n- San Jose Sharks\n- Seattle Kraken\n- St. Louis Blues\n- Tampa Bay Lightning\n- Toronto Maple Leafs\n- Utah Mammoth\n- Vancouver Canucks\n- Vegas Golden Knights\n- Washington Capitals\n- Winnipeg Jets\n- NCAAF\n- NCAAM\n- Olympics\n- Boxing\n- Entertainment\n- Lifestyle\n- Golf\n- MMA\n- Soccer\n- Tennis\n- Wrestling\n- Sports Betting\n- More Sports\n- RESOURCES\n- My Account\n- YB on Facebook\n- YB on Twitter\n- YB on Flipboard\n- Contact Us\n- Privacy Policy\n- Terms of Service\nx\nThe 2020s got off to a strange start, to say the least, but even when the rules that governed sporting events were strange thanks to COVID, great teams were still rising to the top and making themselves known. This decade has already seen the start of some mini-dynasties, particularly in the NFL and men's college basketball. Let's take a look at the best teams of the 2020s - so far.\n1 of 25\nJonathan Dyer-USA TODAY Sports\nPause for a moment and consider the following reality: Tom Brady and the Patriots don’t beat Patrick Mahomes in the 2018 AFC Championship Game. The Chiefs go on to win their first Super Bowl of the Reid/Mahomes era. Then consider Brady and the Bucs don’t successfully thwart Mahomes in the Super Bowl two years later. Mahomes would have five Super Bowls before age 30. The possibilities would be terrifying. Of course, both of those things actually happened, and Brady’s run with Tampa was supremely impressive. The Bucs were languishing at 7-5 until a late bye week, then didn’t lose again, with Brady playing his best football right through the Super Bowl. It was a stunning, outstanding career capstone for the best to ever do it.\n2 of 25\nDouglas DeFelice-USA TODAY Sports\nYou can criticize this choice if you wish; the Lightning only played 56 regular-season games in a year shortened by the lingering effects of COVID-19, but there’s something special about any team that wins back-to-back titles, even if the first one was in a bubble. Tampa Bay became just the second team of the salary cap era to go back-to-back, joining the 2016 and 2017 Pittsburgh Penguins in the process. The Bolts were quite dominant in the playoffs, too, only being pushed to an elimination game one time, by the Islanders in the Eastern Conference Finals. They also perfectly used long-term injured reserve to get Nikita Kucherov back for the postseason. Know what I call that? Smart roster management, that’s what.\n3 of 25\nJeff Hanisch-USA TODAY Sports\nMaybe it was the fact that the series didn’t have the usual Q rating of big coastal markets, or maybe it was the fact that it was the first NBA Finals played after the bubble tournament, but the 2020-21 season feels a little forgotten, at least to me. It shouldn’t be, of course, because it was the crowning moment for Giannis Antetokounmpo, and cemented his rise to the very top of the NBA heap. Milwaukee finished third in the Eastern Conference, but got on a big roll in the playoffs, sweeping Miami, battling through Brooklyn in seven games, then dismissing the Atlanta Hawks in six before doing the same to the Suns in the NBA Finals. Antetokounmpo didn’t three-peat as league MVP, but he did take home Finals MVP honors.\n4 of 25\nPaul Rutherford-USA TODAY Sports\nYou think about the Stephen Curry Warriors, you think about offense. The 2021 team won a title in a different way, however. Golden State had the best defensive rating in the league, while coming at 17th in offensive rating. The Warriors started fast, then stumbled a bit during the second half before righting themselves heading into the playoffs. Curry was his usual brilliant self, and Jordan Poole was a playoff revelation. Once Steve Kerr’s team got going, no one stood in their way, as they never faced a Game 7 on their way to the fourth title of his tenure, and the first since 2017.\n5 of 25\nKirby Lee-USA TODAY Sports\nAaron Donald is, at worst, a top-5 defensive player of all time. In your author’s humble opinion, he’s top-1. So it would have been a shame had he retired without a Super Bowl title on his resume. Thankfully, the 2021 Rams got it done, in large part thanks to Donald’s greatness, plus the brilliance of Matthew Stafford. Los Angeles’ blockbuster quarterback swap with the Lions paid dividends immediately. Stafford thrived in Sean McVay’s offense, throwing 41 touchdowns and leading the Rams to playoff wins over Arizona, Tampa Bay and San Francisco, before authoring a Super Bowl-winning drive in the final two minutes. Donald, naturally, sealed the win by blowing up Cincinnati’s last-gasp fourth-down play, just before they got into field goal range.\n6 of 25\nJay Biggerstaff-USA TODAY Sports\nMost of the teams you’re reading about here got to the very top of the mountain and won it all. To be included without doing so means doing something pretty special and pretty difficult along the way. Beating the Chiefs in their house for the right to go to the Super Bowl qualifies. Cincinnati arrived in a big way in Joe Burrow’s second season; he and Ja’Marr Chase were a lethal combination, and Tee Higgins might have been the league’s best secondary threat. The Bengals’ real secret weapon was Lou Anarumo, who became something of a Mahomes stopper in the playoffs, holding Kansas City to three points in the second half on the way to Cincy rallying from a 21-3 deficit to a 27-24 win. The Bengals came up just short against the Rams, but there’s no doubt that the 2021 team was special.\n7 of 25\nJoshua L. Jones / USA TODAY NETWORK\nThere’s something special about finally getting over the hump against a perpetual tormentor. That was the story of the 2021 Georgia Bulldogs, who existed for several years in Alabama’s shadow before finally breaking free and notching one of the more cathartic College Football Playoff titles in recent memory. After their dominant 12-0 start to the season was ruined by a 41-24 shellacking at the hands of the Crimson Tide in the SEC Championship Game, Kirby Smart’s team got another shot in the CFP Championship Game. They didn’t miss, blowing open a close game with 20 unanswered fourth-quarter points, punctuated by Kelee Ringo’s 79-yard pick-six.\n8 of 25\nGeoff Burke-USA TODAY Sports\nYou can’t really be considered one of the best players of your generation without a championship, and up until 2021, that sentiment hovered over Nathan MacKinnon’s career with the Avalanche. He was firmly in the shadow of Cole Harbour, Nova Scotia’s other NHL superstar, one Sidney Crosby. MacKinnon changed the narrative and the Avalanche rolled to a dominant title campaign, rolling up 119 points in the regular season, then losing just four games total in the playoffs, and never facing an elimination game. MacKinnon had plenty of help from Mikko Rantanen, Nazem Kadri and Cale Makar along the way, with Makar taking home the Conn Smythe. The Avs weren’t able to repeat, but their 2021 season was just about as dominant as it gets.\n9 of 25\nBrett Davis-USA TODAY Sports\nIt feels like it should be borderline illegal to have as much talent on one team as the Braves had in 2021. Ronald Acuna Jr., Ozzie Albies, Austin Riley, Dansby Swanson, and Freddie Freeman in the field, with Charlie Morton and Max Fried anchoring a pitching staff that gave way to an elite bullpen. The Braves were finding themselves during the season, going just 88-73, but once they got to the playoffs they got on a major roll, drubbing the 95-win Brewers, 106-win Dodgers, and 95-win Astros on the way to a World Series crown. At no point in the postseason did the Braves face elimination, and as crazy as it sounds, the 2022 and 2023 teams, which won 101 and 104 games respectively before playoff flameouts, might have been even better.\n10 of 25\nMatt Krohn-USA TODAY Sports\nPart of the reason that Geno Auriemma no longer has a stranglehold on women’s college basketball is because Dawn Staley has built a juggernaut in Columbia. The Gamecocks broke through for their first title under Staley in 2016, and after that, they’ve been a fixture at the top of the women’s game. The 2021 edition lost just two games: a one-point thriller to Missouri in December and a shocking loss to Kentucky in the SEC Tournament. They proceeded to obliterate the competition in the NCAA Tournament, winning all but one game – a 69-61 victory over North Carolina in the Sweet 16 – by double digits. Aliyah Boston was the engine that drove the 2021 squad, which featured six future WNBA players.\n11 of 25\nJoshua L. Jones / USA TODAY NETWORK\nIf the 2021 Georgia Bulldogs represented a challenger finally besting Nick Saban – and Kirby Smart became just the second former Saban assistant to beat him when the Bulldogs triumphed in the national championship game – then the 2022 team that repeated as champs represented the former challenger becoming the bully. Georgia destroyed Oregon to open the season, then survived a few odd close games with Kent State and Missouri, then went right back to dominating, particularly with defense. The Bulldogs’ only true near loss was in the CFP semifinal, when C.J. Stroud and Ohio State took them to the brink, and were a missed field goal away from winning. How did Georgia respond? By beating TCU 65-7 in the national championship, of course.\n12 of 25\nRon Chenoy-USA TODAY Sports\nThe 2022 Nuggets were about one man above all else, and that man was Nikola Jokic. The Serbian center staked his claim as the NBA’s clear-cut best player, averaging 24.5 points, 11.8 rebounds and 9.8 assists for the season, only to miss out on an MVP three-peat (that would have turned into a four-peat) when he finished second in the voting to Joel Embiid. No matter. Jokic went for 30, 13.5 and 9.5 per game in the playoffs, and the Nuggets destroyed the competition, particularly the Lakers, who they buried in four games in the Western Conference Finals. Jamal Murray and Michael Porter Jr. were also major contributors, and Aaron Gordon provided plenty of help as well, but this team and its great run was all about its center, an offensive force like few the sport has ever seen.\n13 of 25\nMichael Chow/The Republic / USA TODAY NETWORK\nPlenty of teams win a title and immediately have dynastic expectations placed upon them, only to never make it back to the promised land. Patrick Mahomes and the Chiefs made sure they wouldn’t be a one-and-done Super Bowl champion in 2022. Mahomes led a predictably dynamic offense that finished tops in the league at 29.2 points per game, then survived a tough test from the Jaguars in the divisional round, before getting revenge on Joe Burrow and the Bengals in the AFC Championship Game. A classic with Philadelphia in the Super Bowl followed, and as usual, Mahomes proved himself unbeatable in a shootout, despite Jalen Hurts’ best efforts.\n14 of 25\nBill Streicher-USA TODAY Sports\nThe 2022 Eagles should hardly hang their heads in shame for coming up short in the Super Bowl against Kansas City. For much of the year, Philadelphia looked like the NFL’s most complete team, top to bottom, and the truth of the matter is that they probably were. They knocked Brock Purdy out of the NFC Championship Game and went on to rout the 49ers, 31-7, after routing the Giants 38-7 in the previous round. Jalen Hurts finished second in the MVP voting, and though his lost fumble in the Super Bowl turned into a touchdown for the Chiefs, he threw for over 300 yards and ran for three touchdowns in the game. Had Philly played anyone else, or had a controversial late call gone their way, they would have been Super Bowl champions.\n15 of 25\nTroy Taormina-USA TODAY Sports\nDan Hurley sure has built something special in Storrs, hasn’t he? Hurley’s Huskies announced themselves – loudly – with a dominant run through the 2022 NCAA Tournament. They went 25-8 in regular season and conference tournament play, finishing fourth in the Big East, and losing a nailbiter to Marquette in the Big East Tournament semifinals. Connecticut went into the NCAA Tournament as a four seed, but with plenty of sharp observers looking at them as a serious title contender. The sharps were right. No Huskies opponent stayed within single digits; their closest margin of victory was 13 points over Miami in the national semifinals. They rolled over San Diego State for the title, featured balanced scoring led by Adama Sanogo and Jordan Hawkins, and were exceptionally well-coached. In fact, they looked like a team with a real chance to repeat…\n16 of 25\nKirby Lee-USA TODAY Sports\nCall it the 2001 Seattle Mariners Award, if you’d like. I have to give the 2022 Dodgers their props, even though they crashed and burned in the Division Series against rival San Diego. Baseball has the flukiest, most random postseason in all of sports. There are plenty of purists who tell you that sure, the World Series champion deserves their flowers, but often isn’t the actual best team. They say that the regular season is the real test of who is best. Frankly, they have a point. The 111-51 Dodgers were, by just about any measure, the best team in baseball. They had a +334 run differential, a Pythagorean record, which is based on run differential, of 116-46. The lineup was stacked, featuring Mookie Betts, Freddie Freeman, Will Smith and more, and the pitching was loaded, led by Julio Urias, Clayton Kershaw and Tyler Anderson. They didn’t win it all, but there wasn’t a better team in baseball in 2022.\n17 of 25\nDavid Butler II-USA TODAY Sports\nWhat would Dan Hurley and Connecticut do for an encore after their dominant tournament run in 2022, one that saw them with a target on their backs in 2023, with their two leading scorers having departed? Go out and be even better. Five Huskies averaged double figures for the season, led by Tristen Newton’s 15.1 points per game, and UConn went 37-3, didn’t lose a game at home all year, won the Big East regular season title, the Big East Tournament title, then destroyed all comers in the NCAA Tournament, with their closest win an 86-72 victory over Alabama in the national semifinals. The 2023 Huskies were one of the deepest, most talented, most dominant teams in years. And they just might make it three in a row.\n18 of 25\nJunfu Han / USA TODAY NETWORK\nWhen you beat Alabama in the national semifinals, choke out rival Penn State on their field, handle Ohio State in a battle of the nation’s second and third-ranked teams, then destroy Washington to win the College Football Playoff, you’re a legendary team. Jim Harbaugh’s 2023 Michigan squad did it old school, too, burying opponents with overwhelming physicality and a punishing ground game on offense, and nasty, hard-hitting defense. There were few frills, and even fewer opponents who stood a real chance. The Wolverines led the league in scoring defense, allowing just 10.4 points per game, and rolled up 35.9 themselves. Blake Corum, J.J. McCarthy and Roman Wilson were the engines of the offense, and the defense had too many high-end talents to name. Harbaugh might have left for the NFL, but he gave fans in Ann Arbor one hell of a parting gift.\n19 of 25\nPool Photo-USA TODAY Sports\nOkay, I admit it. I’m a Boston sports hater. Always have been, always will be. But it’s not like I can’t acknowledge greatness when I see it. And make no mistake, the 2023 Boston Celtics were truly great. The 64-18 regular-season record? That was pretty great. The complete domination in the playoffs, losing just three games and sweeping the Pacers in the Eastern Conference Finals? Also great. Boston featured three 20-point scorers: Jayson Tatum, Jaylen Brown and Kristaps Porzingis, got great contributions from Derrick White and Jrue Holiday, and had a talented bench cast that came up big whenever they were needed. Joe Mazzulla was a target of Celtics fans’ frustrations after Boston lost to Miami in the 2022 Eastern Conference Finals, but he and the Celtics silenced the doubters with one of the more dominant seasons in recent NBA history.\n20 of 25\nMark J. Rebilas-USA TODAY Sports\nNo NFL team had won back-to-back Super Bowls since the 2003-2004 New England Patriots – until Patrick Mahomes and the 2023 Chiefs accomplished the feat. Kansas City had a target on their backs all season, and for the first time in the Mahomes era, had to go on the road in the AFC playoffs. Kansas City vanquished the Bills in Buffalo and the Ravens in Baltimore, after holding serve at home against Tyreek Hill and the Dolphins. The defense carried Kansas City for much of the year, and again in the AFC Championship Game, but when the lights got their brightest, Mahomes and Travis Kelce were unstoppable, never more than on a do-or-die overtime drive to win the title, one that felt inevitable even though the Chiefs had to stare down a fourth-and-the-season conversion.\n21 of 25\nKyle Terada-USA TODAY Sports\nMuch like the 2022 Eagles, the 2023 49ers probably deserved a little better than they got. San Francisco was loaded up and down the lineup, with Brock Purdy coolly executing Kyle Shanahan’s offense to near perfection, Christian McCaffrey making opposing defenders look silly, and Brandon Aiyuk, Deebo Samuel and George Kittle running circles around opposing secondaries. Nick Bosa paced a defense that was as ferocious as ever for nearly the entire year. Had San Francisco not drawn the Chiefs in the Super Bowl, they’d probably have won it. Then again, Niners fans probably felt the same way in 2019. Still, for much of the year this was an outstanding, at times invincible team, one that merely ran into the NFL’s Big Bad at the wrong time.\n22 of 25\nLon Horwedel-USA TODAY Sports\nGoing to be honest, here. I have a major soft spot for the Lions. I’m a big Dan Campbell fan, I love the story of someone else’s discarded quarterback coming to Detroit, in so many years a discarded afterthought of the NFL landscape, and turning things around. I love that Lions fans got to be happy again, and I love that Detroit is both physical and creative offensively, and opportunistic defensively, even if admittedly vulnerable on that side. The Lions went into the belly of the beast against the 49ers, and but for a very fortunate helmet catch by Brandon Aiyuk, probably would have walked out winners. And they were the kind of group just crazy enough to have beaten the Chiefs, had they merely gotten the chance in the Super Bowl. They fell two wins short of immortality, but this was a great, and very fun football team.\n23 of 25\nWendell Cruz-USA TODAY Sports\nThe 2022 Las Vegas Aces? They were pretty good. Went 26-10. Won the WNBA Championship. The 2023 Las Vegas Aces? They were a different animal altogether. Becky Hammon’s team went back-to-back, and did it in style, going 34-6 on the season, the most wins by any team in a single season, and lost just one game in the playoffs, totaling an 8-1 mark on the way to a successful title defense. A’ja Wilson was phenomenal, averaging 22.8 points and 9.5 rebounds per game, to go along with 2.2 blocks. Wilson narrowly missed winning her third league MVP Award, but she did rack up her second-straight Defensive Player of the Year Award. The Aces also got big seasons from Kelsey Plum, Jackie Young, and Chelsea Gray and were the top-scoring team and second-best defensive team in the league. Pretty good, eh?\n24 of 25\nSam Navarro-USA TODAY Sports\nOne imagines Gary Bettman swooning as one of his Sun Belt franchises won the Stanley Cup. Okay, maybe not, but he was probably still pretty happy that the Panthers hoisted the most famous trophy in sports this year. Florida deserved it, too. They were the deeper, better team than Edmonton, even though they tried to give the title to the Oilers with an all-time collapse, one narrowly averted with a taut Game 7 win. Paul Maurice’s team won the battle of Florida in the first round over Tampa Bay, then ground out a pair of series wins over the Bruins and Rangers before meeting the Oilers in what became a classic. They were balanced, with four players topping 70 points, and Game 7 hero Sam Reinhart tallying 57 goals. Sergei Bobrovsky game them just enough in net, and a team that had been knocking on the door for a few years finally broke it down.\n25 of 25\nKen Blaze-USA TODAY Sports\nDawn Staley’s 2023 Gamecocks were her crowning achievement. How can you do better than 38-0? Simple. You can’t. Never beaten and rarely challenged, South Carolina was a force to be reckoned with all season. Only Indiana truly gave them a game in the NCAA Tournament, but Kamilla Cardoso and company were just too much, like they were all year. She averaged 14.4 points and 9.7 rebounds per game and MiLaysia Fulwiley and Te-Hina Paopao both checked in as double-figure scorers throughout the season. South Carolina’s real strength was its balance, however. Nine players averaged at least 6 points per game, and Staley was able to wear opposing teams out by constantly keeping her team fresh. Most of South Carolina’s roster is returning, so it stands to reason that the epicenter of women’s college hoops will remain in Columbia for the foreseeable future.\nChris Mueller\nChris Mueller has been plying his trade as a sports radio host - or hot-take artist, if you prefer - since 2008. He's called 93. 7 The Fan in Pittsburgh home since its inception in 2010, and currently co-hosts the award-winning (no, really) PM Team from 2-6 p\nMore must-reads:\n- President Trump pardons five former NFL players\n- NFL draws criticism for eliminating team report cards\n- The 'Super Bowl winning coaches' quiz\n+\nGet the latest news and rumors, customized to your favorite sports and teams. Emailed daily. Always free!\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\nMY ACCOUNT\nSUBSCRIBE\nADVERTISE\nJOBS\nFAQ\nPRIVACY POLICY COOKIE POLICY CONTACT US\nABOUT YARDBARKER TERMS OF SERVICE\nPRIVACY POLICY COOKIE POLICY CONTACT US\nABOUT YARDBARKER TERMS OF SERVICE\nCopyright 2026 YB Media, LLC. All rights reserved.\nBy using this site, you agree to our Terms of Service and Privacy Policy.\nThis site is for entertainment purposes only.\nThere is no gambling offered on this site.\nGambling Problem? Call 1-800-Gambler.\nBy using this site, you agree to our Terms of Service and Privacy Policy.\nThis site is for entertainment purposes only.\nThere is no gambling offered on this site.\nGambling Problem? Call 1-800-Gambler.",
  "word_count": 4269,
  "scraped_at": "2026-02-14T12:42:18.082842"
}