{
  "article_id": "3ed97d288458",
  "url": "https://bleacherreport.com/articles/10102025-uefa-fifas-bans-on-european-super-league-deemed-unlawful-after-eu-court-ruling",
  "title": "UEFA , FIFA Bans on European Super League Deemed Unlawful After EU Court Ruling",
  "date": "20231221T214500Z",
  "domain": "bleacherreport.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Featured Video\nHarper's Rising Stars Game-Winner 🔥\nUEFA, FIFA's Bans on European Super League Deemed Unlawful After EU Court Ruling\nEuropean clubs aiming to join a breakaway Super League received some good news on Thursday thanks to a landmark court ruling.\nThe European Court of Justice deemed that UEFA and FIFA's bans on the formation of a Super League are \"unlawful\" and that the organizations are \"abusing a dominant position\" in their control of the sport in Europe by threatening to sanction clubs that want to join the breakaway league, according to Alex Kirkland and Rodrigo Faez of ESPN.\n\"There is no framework for the FIFA and UEFA rules ensuring that they are transparent, objective, non-discriminatory and proportionate,\" the court said.\n\"Similarly, the rules giving FIFA and UEFA exclusive control over the commercial exploitation of the rights related to those competitions are such as to restrict competition, given their importance for the media, consumers and television viewers in the European Union.\"\nThe Super League saga began in April 2021 when 12 teams, including the likes of Arsenal, Liverpool, Manchester City, Barcelona, Real Madrid, AC Milan and Juventus, had signed up for the breakaway competition, which aimed to replace the UEFA Champions League.\nDue to widespread backlash from fans, European leagues, UEFA and FIFA, plans for the Super League collapsed within a few days as multiple clubs withdrew from the competition.\nThe Super League, backed by A22 Sports, then filed a lawsuit seeking protection from potential UEFA sanctions.\nWith Thursday's ruling, UEFA and FIFA cannot block a Super League from being formed, though the court also stated that the decision \"does not mean that a competition such as the Super League project must necessarily be approved.\"\nFollowing Thursday's ruling, the Super League revealed an updated proposal for a three-league, 64 club men's competition and a two-league, 32 club women's competition that would replace the UEFA Champions League.\nThe men's competition would feature two leagues consisting of 16 teams each—known as the \"Star League\" and \"Gold League\"—and a third league referred to as the \"Blue League\" with 32 teams. Promotion and relegation would exist between the leagues and teams would be added to the third league based on domestic league performance.\nCompetition would consist of a minimum of 14 matches per year with an eight-club knockout stage determining the winner of each league.\n\"We'll keep working with clubs, leagues and other parties, without the fear of punishment, to create the best European football competitions,\" A22 chief executive Bernd Reichart said. \"We reaffirm our commitment to national leagues and the pyramid structure of football. For the first time since 1955, European competitions could be managed by the participating clubs themselves.\"\nSince the ruling and subsequent proposal, multiple clubs have already rejected the format, including Manchester United, Bayern Munich and Atletico Madrid.",
  "word_count": 468,
  "scraped_at": "2026-02-14T12:46:25.974187"
}