{
  "article_id": "3edfc5850f13",
  "url": "https://news.yahoo.com/raiders-coach-gm-president-black-230833531.html",
  "title": "Raider coach , GM and president are Black -- a first for the NFL . They embrace the responsibility",
  "date": "20231212T233000Z",
  "domain": "news.yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Raiders' coach, GM and president are Black -- a first for the NFL. They embrace the responsibility\nHENDERSON, Nev. (AP) — When Las Vegas Raiders owner Mark Davis fired coach Josh McDaniels and general manager Dave Ziegler on Halloween night, he also made history by naming Antonio Pierce as the interim coach and Champ Kelly as the acting GM.\nThose actions made the Raiders the first NFL team in which Black people occupied the three key leadership positions below owner — coach, GM and president. Team president Sandra Douglass Morgan is one of the few women in authority in the league.\n“I don’t take it lightly,” Pierce said. “There are not many people from my background, grew up from where I grew up (Compton, California), to be in front of this stage, to have this kind of responsibility.”\nPierce said he grew up a Raiders fan and pointed out the organization — whether it was based in Las Vegas, Oakland or Los Angeles — has a history of being a trailblazer. Kelly and Douglass Morgan noted that Hall of Fame owner Al Davis — Mark Davis' father — set the standard going back to 1989 when Art Shell became the NFL's first Black head coach in the Super Bowl era.\nTom Flores, who is Mexican American, became the first minority head coach to win a Super Bowl when he guided the Raiders to the championship in the 1980 season and then won a second one three years later. He was inducted into the Pro Football Hall of Fame two years ago.\nAs far as the ultimate on-field leadership position, Kelly noted the Raiders became the first to draft a Black quarterback in the first round when they selected Eldridge Dickey in 1968.\n“The Raiders have long been a leader in diversity in professional sports, and the NFL would not be what it is today without Al Davis,\" Kelly said in a statement to The Associated Press. “Therefore, it is no surprise that the Raiders under Mark Davis are the first franchise with a Black head coach, president and general manager. Personally, I couldn’t be prouder to be a part of this leadership group.”\nThe Raiders also were the first team to appoint a woman as president when Amy Trask was hired in 1997. Douglass Morgan was hired in July 2022, making her the first Black woman to hold that position in the NFL.\n“I think there's additional responsibility (as a woman) any time you are not what the common person looks like who fills that role,” Douglass Morgan told The AP in an interview. “So I think there's definitely a responsibility making sure you're not the last. That's the goal, to not be the last whether it's being a woman of color or a woman itself. It's a challenge, but I have to focus on what the job is, and that's to be the best president of the Raiders.”\nPierce and Kelly have similar mandates.\nPierce has to figure out a way to get the Raiders (5-8) out of a three-game losing streak, beginning with Thursday night's home game against the Los Angeles Chargers. Even if he gets the team moving in the right direction, he is far from guaranteed of getting the job on a full-time basis once Davis opens up the coaching search.\nKelly is in a similar spot, trying to show now he is the one who should be fully in charge of making the roster playoff worthy.\nMore in Sports\nBarcelona fans tear into several players amid Atlético disaster\nThose decisions will come soon enough.\nAs for now, Las Vegas star wide receiver Davante Adams said the current makeup of those leadership positions should be noted, but the fact it is a story also is something that needs to be rectified.\n“Hopefully, we get to a point where we don’t even need to acknowledge it — not here but just in the world,” Adams said. “It’d be cool to just have a Black president and it just be the president, it’s just a normal thing, that’s the ultimate goal.”\nIn the meantime, Adams said, the Raiders' leadership should serve as an inspiration to young people who otherwise wouldn't have such role models to try to emulate.\nPierce made a similar point.\n“I do look at myself as somebody who can be a leader and an example for the other children wherever they may be in the world that, listen, you could do it,” Pierce said. \"If I did it, I know you could do it. Guarantee that. So, hopefully, they believe in a dream like I did and work their (butts) off to get there.”\n___\nAP NFL: https://apnews.com/hub/nfl",
  "word_count": 783,
  "scraped_at": "2026-02-14T12:40:28.448595"
}