{
  "article_id": "3efa80639ea5",
  "url": "https://www.newcastleherald.com.au/story/8301758/this-is-their-chance-mature-magic-eye-premiership-championship/?cs=305",
  "title": "Broadmeadow Magic out to seal NPLW NNSW premiership in round 20 | Newcastle Herald",
  "date": "20230809T071500Z",
  "domain": "newcastleherald.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Coach Jake Curley believes a more experienced Broadmeadow can seal the NPLW Northern NSW premiership then push on for an elusive grand final appearance.\nSubscribe now for unlimited access.\nor signup to continue reading\nMagic hold a five-point lead at the top of the competition standings and finishing first looks fait accompli with either a win against fourth-placed Charlestown in the league's penultimate round at Magic Park on Friday night or when they play winless Warners Bay in round 21.\nBroadmeadow finished top in a COVID-shortened season that had no finals in 2021. They were a narrow second in 2020 and 2022 but exited the final series in straight sets.\nBut, a bit like the Matildas' steely sights on World Cup glory, Magic seem determined to change their fortunes this campaign.\nThey haven't lost a game since round 12 and prevailed in back-to-back must-win exchanges with premiership rivals Newcastle Olympic then Maitland in their past two outings.\n\"The last games we've played have been pretty high-pressure games and they've done the job,\" Curley said.\n\"They've got a bit more experience now, because when we first came together everyone was pretty young. But we've had four years and we've only finished first or second, so for us it's just about maintaining what we've been doing, and the pressure games have been good for us this year because it helps us with the finals.\n\"They're a bit older, a bit more experienced and we've got experienced players in there that can calm the situation down as well ... everything is looking pretty good.\"\nMagic look set to experience a turnover of players after this season due to various reasons.\n\"The girls know that this is the moment because people are leaving ... so this is their chance,\" he said.\n** The Magic-Azzurri clash has been moved from Saturday afternoon to Friday night, kicking off at 8.15pm, to avoid a clash with the Matildas' World Cup quarter-final showdown with France.\n** Coach Neil Owens predicts it is only a matter of time before the floodgates open after Olympic could not buy a goal despite plenty of chances before closing out the inaugural NNSW Women's League Cup final in a penalty shoot-out on Sunday night.\nOlympic, who have already secured another NPLW finals appearance, hit the woodwork more than once and missed a couple of point-blank opportunities from close range before beating Maitland 0-0 (5-4) at Lisle Carr Oval.\n\"That's been us all year, and sooner or later you'd think the tide would change,\" Owens said.\n\"But, from my side, it felt like a pretty dominant performance.\"\n** NNSW Football general manager football operations Liam Bentley felt the introduction of the League Cup, contested by the eight NPLW clubs, was a success.\n\"All new competitions take time to settle in to clubs' programs and fit into their plans, but we had more girls and women playing more competitive football and, ultimately, we had two of the best teams in the league engaged in a high-quality Cup final that delivered the extra time and penalty drama that only knockout football can deliver,\" Bentley said.\n\"Whilst we'll consult with clubs as we do every year on exactly where our competitions sit, we see the addition of Cup football for senior women and youth girls as an important part in both the development of players and the showcasing of our game.\"\n** Maitland coach Keelan Hamilton was expecting to \"have to manage some bodies\" as they eye their first NPLW finals series.\nGoalkeeper Imogene Tomasone (back) did not play the League Cup final and fullback Maddy Howard was forced from the field with an ankle injury.\nBoth appear doubtful for their round-20 clash with Mid Coast on Sunday.",
  "word_count": 621,
  "scraped_at": "2026-02-14T13:26:29.643589"
}