{
  "article_id": "3f43229a190b",
  "url": "https://www.macombdaily.com/2023/11/16/body-found-in-oscoda-county-believed-to-be-warren-man/",
  "title": "Body found in Oscoda County believed to be Warren man",
  "date": "20231116T234500Z",
  "domain": "macombdaily.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Warren police believe a body that was discovered in Iosco County on Monday is James Wilkins, who disappeared from his Warren apartment on June 8.\nDonald Renfroe, 27-year-old Wilkins’ roommate, was arrested in August and charged with first-degree murder, tampering with evidence, concealing the death of an individual and a felony firearm offense. Renfroe’s friend, Darius Glenn, was also arrested at that time and charged with tampering with evidence and accessory after the fact to a felony.\nWarren Police Commissioner William Dwyer said his office expects to receive confirmation regarding the identity of the body on Thursday.\nMichigan State Police, the Oscoda Township police and fire departments, and U.S. Parks Service officers assisted Warren police with the search for the body. With the assistance of an MSP cadaver dog, Wilkins’ body was recovered along with other evidence.\n“Our investigators were able to obtain credible and reliable information that ultimately led us to Oscoda Township where Wilkins’ body was located,” said Dwyer. “We are awaiting the results of the autopsy which will provide us with other key information and confirmation of Wilkins’ identity.\n“Detectives have already been in contact with Wilkins’ next of kin regarding this major development.”\nIn June, after Wilkins’ disappearance, Renfroe fled to Ohio where he was arrested on unrelated charges and extradited back to Michigan. Bond was posted as the missing persons investigation continued.\nDetectives continued to analyze evidence in the case and executed several additional search warrants to gather evidence regarding the events before, during, and after Wilkins was last observed by family members. Detectives also located and seized several handguns belonging to Renfroe and forensic evidence was obtained and analyzed that yielded key information to investigators.\nShortly after Wilkins’ disappearance in June, Crime Stoppers of Michigan held a press conference with his family asking for anyone with information about the disappearance of the young father and football coach to come forward.\nDwyer said foul play was suspected from the onset of the investigation. Police found a recently patched bullet hole and suspected blood inside the apartment shared by Wilkins and Renfroe. Detectives obtained additional evidence which showed that, on the date of Wilkins’ disappearance, Renfoe rented cleaning equipment and purchased additional cleaning supplies from a local hardware store. The investigation also revealed that Renfoe contacted and worked together with a male friend, Glenn, to clean out Wilkins’ apartment and likely dispose of his body.\n“Our investigators never stopped working this case from the beginning as our goal was to locate Wilkins’ body so that his family could have some closure,” Dwyer said “I want to commend the efforts of the men and women of the Warren Police Department along with our other law enforcement partners who worked on this case. Our thoughts and prayers are with the victim’s family and friends.”\nUPDATE (9:25 p.m.): A previous version of this story stated the body was found in Oscoda County. The body was found in Oscoda Township, which is in Iosco County.",
  "word_count": 495,
  "scraped_at": "2026-02-14T14:09:21.561173"
}