{
  "article_id": "3f8a3664ffd1",
  "url": "https://cartilagefreecaptain.sbnation.com/2024/6/27/24186062/the-hoddle-of-coffee-tottenham-hotspur-news-and-links-for-thursday-june-27",
  "title": "The Hoddle of Coffee : Tottenham Hotspur news and links for Thursday , June 27",
  "date": "20240627T070000Z",
  "domain": "cartilagefreecaptain.sbnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "good morning!\nThe Hoddle of Coffee: Tottenham Hotspur news and links for Thursday, June 27\nWhere are they now: Alex Morgan\nWelcome to another edition of “Where are they now?” where your hoddler-in-chief takes a look at Tottenham players past, and where they are now.\nToday - Alex Morgan.\n———\nThis might be one of the more timely editions to come out of this series. New USWNT manager dropped Alex Morgan from the women’s olympics squad (which kinda spoils the whole “where are they now” bit, I know).\nI don’t think Morgan haddest the biggest on-the-pitch contributions during her tenure at Spurs, but I felt she made a huge impact off it.\nFirst, her transfer in 2020 was huge for the club. She was a major star at the time. I’d go so far as to say it was a higher-profile signing than bringing Gareth Bale back to the men’s squad.\nThis blog covered one of the big changes made during Morgan’s brief tenure, which was bringing the women’s squad to train at Hotspur Way.\nMorgan was a huge, huge star at the time (still is). She was probably at or near the peak of her popularity in women’s football, and leveraged that to get the women’s squad to train at better training grounds.\nMorgan’s loan at Spurs was brief and, unfortunately, marred by injruey. She scored two goals in four appearances. In December 2020 she returned to the US to be closer to her family.\nWhere is Alex Morgan now?\nWell, she won’t be going to Paris.\n“Today, I’m disappointed about not having the opportunity to represent our country on the Olympic stage. This will always be a tournament that is close to my heart and I take immense pride any time I put on the crest,” she posted on X.\nMorgan was left off the US Women’s National Team squad for this year’s summer olympics by new manager Emma Hayes. A cruel reminder of the sporting cycle and how no woman or man can beat time.\nIt would be a sad end to an illustrious international career that resulted in 123 goals in 224 appearances.\nShe was part of the 2015 and 2019 World Cup winning teams, and won the gold medal in 2012 (among many other international and club awards).\nFitzie’s track of the day: So Tired, by Bobby Timmons\nAnd now for your links:\nWhat Tottenham players can expect from Nick Montgomery in training\nWhen The Guardian said Alex Morgan is the Tottenham signing that is ‘bigger than the club’\nGeorgia stun Portugal to close our Euros group stage play",
  "word_count": 434,
  "scraped_at": "2026-02-14T12:32:17.631379"
}