{
  "article_id": "3fb06ae5106a",
  "url": "https://www.rte.ie/brainstorm/2025/0813/1528223-everton-hill-dickinson-stadium-liverpool-city-unesco-world-heritage-site/",
  "title": "Why Everton FC new home means a lost legacy for Liverpool city",
  "date": "20250813T134500Z",
  "domain": "rte.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Analysis: One of the major impacts of Everton's new Hill Dickinson Stadium is the loss of Liverpool city's UNESCO World Heritage listing\nSoccer never sleeps. Since Liverpool FC lifted their record-equalling title in May, there has been a Club World Cup, UEFA Nations League Finals, a Women's European Championship, not to mention the League of Ireland and the relentless hum of transfer speculation. However, the impending return of the Premier League with a major new addition. At an estimated cost of over €925 million, Everton's new Hill Dickinson Stadium at Bramley-Moore Dock is set to become a major icon of the game and the city of Liverpool.\nWe need your consent to load this rte-player contentWe use rte-player to manage extra content that can set cookies on your device and collect data about your activity. Please review their details and accept them to load the content.Manage Preferences\nFrom RTÉ Radio 1's Liveline, Everton superfan Andy Ring and former Everton player Mark Ward discuss being fans of the Toffees\nWhile fans will, of course, be sorry to leave the historic Goodison Park after 133 years, the move has been broadly met with popular support. The positive sentiment has been supported by the confirmation that Goodison Park will now be the permanent home for Everton Women, becoming the largest dedicated women's football stadium in England.\nDespite the first goal scored in the new stadium was by a Liverpool FC fan, ongoing concerns about parking and dire warnings of flooding due to rising sea levels, the successful test events, replete with obligatory blue toffee topped doughnuts have contributed to general optimism about the new stadium.\nThis is an opportune moment to rewind four years to one of the major impacts to the development. Since 1978 the World Heritage Committee has met annually to add new sites to its UNESCO World Heritage list. This year's meeting in Paris brought the current total to 1,248 and new sites include the Palaces of King Ludwig II of Bavaria, the Bijagós Archipelago in Guinea-Bissau and Mount Kumgang in North Korea.\nAs one of the world’s major trading centres in the 18th and 19th centuries, the city centre and docklands of Liverpool have been on the list since 2004 for its maritime and mercantile history and its central role in the mass movement of slaves and emigrants during the British Empire. However, Liverpool was struck from the list in 2021, becoming only the third site, following the Arabian Oryx Sanctuary in Oman (2007) and the Elbe Valley in Dresden in Germany (2009), to be delisted.\nDespite the Liverpool mayor’s response at the time that the decision was \"incomprehensible\", there had been many warnings. In 2006, commenting on the new Liverpool Museum to be built on the docks (a design it commended), UNESCO urged the UK \"to put in place strategic plans for future development that set out clear strategies for the overall townscape and for the skyline and river front\".\nFrom Everton FC, a historic day at Hill Dickinson Stadium\nFollowing concerns in 2012 about the proposed multi-billion residential, commercial and office Peel Group development of Liverpool Waters, Liverpool was then placed on the List of World Heritage in Danger. This was a call to urgent action about the development the city and how its heritage would be preserved.\nThe 2021 approval of the new Everton FC stadium was the final straw for UNESCO and the city's certificate was rescinded. The new stadium, which filled in the dock, is the very antithesis of heritage led regeneration. Despite appearances, UNESCO aren't necessarily against redevelopment of sites per se. In 2021, they decided that the docklands are no longer the site of outstanding universal heritage value it was in 2004. A building of this scale and type within the core site is particularly egregious and detrimental to the named heritage qualities for which Liverpool was first inscribed on the list. After all, sports stadiums are a dubious source of urban regeneration.\nDelisting is rare and the Committee normally does not seek to anger countries (Oman, for example, requested delisting). UNESCO’s reluctance to take this decision was evident in the fact that it eventually was decided by a secret ballot, requiring a two-thirds majority. That Liverpool was not able to secure forbearance from UNESCO was mistakenly viewed at the time as a diplomatic and lobbying failure of the Brexit era. Most committee members were non-European and both the city of Bath and the Slate Landscape of Northwest Wales were added in 2021.\nFrom PBS Newshour, a look at some of 2025's new UESCO World Heritage list\nIt is worth remembering that UNESCO cannot reverse local planning decisions. Listing, like other cultural awards, is about recognition. It doesn't bring immediate change, rather how recognition is leveraged is what matters. Cities, however, should not be caught between a false dilemma of heritage and regeneration and no parties in this episode, including UNESCO, are blameless. A more flexible approach and greater dialogue could perhaps have seen the decision deferred or site boundaries amended.\nUNESCO's decision ought to serve as a warning to other sites such as Vienna, already on the 'in danger’ list for similar reasons, and counties like Ireland who have recently declared a goal to increase their number of World Heritage Sites. It also is a lesson that this process is insufficient and too rigid for balancing heritage preservation and urban regeneration.\nWe need your consent to load this rte-player contentWe use rte-player to manage extra content that can set cookies on your device and collect data about your activity. Please review their details and accept them to load the content.Manage Preferences\nFrom RTÉ News, Ireland's only Moravian village receives UNESCO World Heritage status\nAs Everton fans saying goodbye to Goodison at that emotional final home game in May know, letting go is difficult. The unsatisfactory loss of status for Liverpool should be taken as an opportunity for the UK and UNESCO to develop a new chapter. Encouragingly, in 2024 the UK belatedly adopted the 2003 convention on intangible culture and added two more sites: Flow Country in Scotland and the Gracehill Moravian Settlement in Co Antrim in 2024.\nAs Everton look forward to a new future with increased capacity, greater revenue and possibly some trophies to match their rivals, it is worth reflecting on what Liverpool has lost and the challenge to cities when it comes to preserving their heritage and building for the future. Until that happens, all that remains is the dubious record that their new stadium has already given the city.\nIn football, it is well known that Juventus were stripped of the 2004-2005 Italian League title and had their records scrubbed. In contrast, Liverpool's name will remain on UNESCO’s list, but with a line struck through it as a reminder of what the French philosopher Jacques Derrida called sous rature (under erasure). In other words, Liverpool’s place on the heritage list remains necessary but inadequate.\nFollow RTÉ Brainstorm on WhatsApp and Instagram for more stories and updates\nThe views expressed here are those of the author and do not represent or reflect the views of RTÉ",
  "word_count": 1189,
  "scraped_at": "2026-02-14T13:22:58.706740"
}