{
  "article_id": "3fbaa60a2d54",
  "url": "https://www.ok.co.uk/lifestyle/inside-lioness-chloe-kellys-ibiza-30788281",
  "title": "Inside Lioness Chloe Kelly Ibiza getaway with boyfriend Scott after World Cup",
  "date": "20230825T160000Z",
  "domain": "ok.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Inside Lioness Chloe Kelly's Ibiza getaway with boyfriend Scott after World Cup\nAlmost one week on since England's heartbreaking defeat at the World Cup, Chloe Kelly has proven she still has every reason to smile as she jetted off to Ibiza with her boyfriend\nThe England Lionesses may not have won this year’s World Cup, but the players certainly captured the hearts of the nation as they made history by making it to their first Women’s World Cup final ever.\nAfter narrowly missing out on the coveted trophy to Spain, it’s safe to say that the players were in need of a little R&R after battling their way through 7 nail biting games, not to mention training constantly in between matches to make sure they were in peak condition to take on their rivals.\nNow, almost one week on since England’s heartbreaking defeat, Chloe Kelly is making the most of a well earned rest as she and her boyfriend Scott soak up the sunshine in Ibiza.\nThe 25 year old forward, who plays for Manchester City in addition to the England national team, took to her Instagram stories on Friday (25 August) to share a glimpse of her dreamy getaway to her 705k followers.\nIn one of three snaps shared by the talented player, a stunning blue ocean was clearly visible next to a clear sky and of course, plenty of sunshine to compliment the view as Chloe and her boyfriend visited the scenic coastline before heading to the Ocean Beach Club.\nIn a second snap, the happy couple could then be seen posing together in the paradisal weather, with Chloe in particular showing off her keen eye for sartorial flail as she modelled a tartan checked bikini top complete with white flared beach trousers.\nCompleting the look, Chloe then opted for a pair of black sandals while an oversized pair of sunglasses helped to offer some eye protection from the UV rays overhead.\nScott himself also looked equally stylish, as he sported a white Moncler t-shirt, blue shorts and a pair of chic but comfy white trainers.\nHe also elected to complete his outfit with a pair of sunglasses, and of course a trendy watch.\nLater during the trip, Chloe also shared a closer look at her outfit, which revealed her bikini to be the Women's Natural Bikini With Triangle Bra from fashion house Burberry.\nRetailing for around £369, the stylish garment was worlds away from Chloe’s usual football kit, but looked sensational for her well earned holiday away from her much loved game.\nAlthough the star has yet to update fans on what else she and Scott intend to do while in Ibiza, there's certainly no shortage of options at the Ocean Beach Club where the pair are staying, as it is renowned for its festive poolside parties, live DJs & aerial performances.\nThe hot spot is also the perfect place for anyone hoping to catch a glimpse of the stars, with several famous faces having attended over the years including Olly Murs, Maya Jama and Leigh-Ann Pinnock.",
  "word_count": 510,
  "scraped_at": "2026-02-14T13:04:08.882350"
}