{
  "article_id": "3fd206f53957",
  "url": "https://hotspotatl.com/5071106/ole-miss-player-suing-lane-kiffin-for-allegedly-kicking-him-off-the-team-while-struggling-with-mental-health/",
  "title": "Ole Miss Player Suing Lane Kiffin For Kicking Him Off The Team While Struggling With Mental Health",
  "date": "20230919T000000Z",
  "domain": "hotspotatl.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Ole Miss Player Suing Lane Kiffin For Kicking Him Off The Team While Struggling With Mental Health\nOle Miss Player Suing Lane Kiffin For Allegedly Kicking Him Off The Team While Struggling With Mental Health\nLane Kiffin’s football coaching prowess has taken him from some of the top college programs to the NFL and back.\nBut his tenure at Ole Miss has now been marred with a bit of controversy.\nDeSanto Rollins claims Kiffin kicked him off the team when he was having a mental health crisis.\nThe defensive tackle is suing the school and Kiffin for racial and sexual discrimination and negligence and is seeking $10 million in compensatory damages and $30 million in punitive damages.\nThrough the lawsuit, the Baton Rouge native claims he wasn’t supported through his mental health issues the way white people and women were supported at the Mississippi sports powerhouse.\nHowever, the school is clapping back at Rollins’ claims, saying that he’s actually still on the team and has the same opportunities to seek out school-sponsored mental health facilities as everyone else.\nIf you take a look at the roster, Rollins is, in fact, still listed as an active member of the team and notes that he signed on as a freshman in 2020 but didn’t play because he was redshirted.\n“We have not received a lawsuit,” the school said Friday through spokesman Kyle Campbell. “DeSanto was never removed from the football team and remains on scholarship. In addition, he continues to have the opportunity to receive all of the resources and advantages that are afforded a student-athlete at the university.”\nBefore the controversy, Rollins’ time at Ole Miss hadn’t been easy. His on-field performance was marred by injuries, including a concussion and an injury to his right Achilles tendon in July of 2022. Then he reaggravated an old LCL injury in his left knee that was detrimental to his mental health.\nThe lawsuit claims Rollins “suffered severe depression, anxiety, frustration, embarrassment, humiliation, a loss of sleep and loss of appetite” from his Achilles injury.\nKiffin also reportedly told Rollins to enter the transfer portal, but he refused, so he was moved to the O-Line and stuck on the scout team in February.\nRollins also claims to have an audio recording of Kiffin chiding him and kicking him off the team on March 21, telling him that mental health issues don’t excuse his behavior, which included blowing off meetings.\n“When you were told again and again the head coach needs to see you, wasn’t to make you practice, wasn’t to play a position you don’t (expletive) want to, OK? It was to talk to you and explain to you in the real world, OK? So I don’t give a (expletive) what your mom say, OK, or what you think in the real (expletive) world, you show up to work, and then you say, ‘Hey, I have mental issues, I can’t do anything for two weeks, but if you change my position I won’t have mental issues.,’” the lawsuit claims Kiffin said in the audio tape.\nOle Miss Player Suing Lane Kiffin For Allegedly Kicking Him Off The Team While Struggling With Mental Health was originally published on cassiuslife.com",
  "word_count": 534,
  "scraped_at": "2026-02-14T13:09:24.039473"
}