{
  "article_id": "3febaf1d89d9",
  "url": "https://rivercountry.newschannelnebraska.com/story/49741433/brian-buschini-named-campbell-trophy-semifinalist",
  "title": "Brian Buschini Named Campbell Trophy Semifinalist",
  "date": "20230928T011500Z",
  "domain": "rivercountry.newschannelnebraska.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Brian Buschini Named Campbell Trophy Semifinalist\nUniversity of Nebraska punter Brian Buschini was named a semifinalist for the 2023 William V. Campbell Trophy®, college football’s premier scholar-athlete award, Wednesday morning.\nUniversity of Nebraska punter Brian Buschini was named a semifinalist for the 2023 William V. Campbell Trophy®, college football’s premier scholar-athlete award, Wednesday morning.\nThe award recognizes an individual as the absolute best in the country for his combined academic success, football performance and exemplary leadership, and the candidates also comprise the pool of nominees for the 2023 National Football Foundation National Scholar-Athlete Awards Presented by Fidelity Investments.\nBuschini is looking to become the Huskers' third Campbell Trophy Award winner, joining Rob Zatechka (1994) and Kyle Vanden Bosch (2000).\nBuschini has excelled in the classroom, earning his bachelor's degree in criminology and criminal justice from Nebraska in December of 2022 and is currently pursuing his master's degree in construction engineering and management. Buschini, who began his career at Montana, has been on the Nebraska Scholar-Athlete Honor Roll in each of his three semesters at Nebraska.\nHe has started all 16 games since transferring to Nebraska after the 2021 season. Last season, he averaged 44.0 yards per punt on 68 attempts, an average which ranked 25th nationally, as he placed 14 punts inside the opponent’s 20-yard line. This season, he is averaging 42.7 yards per punt and has placed nine of his 19 punts inside the 20-yard line. He was the FCS Punter of the Year and a first-team All-American at Montana in 2021 when he averaged 46.0 yards per punt, including 28 covering at least 50 yards and 30 of his 69 punts downed inside the opponent 20-yard line.\nEach nominee must be a senior or graduate student in their final year of eligibility, have a GPA of at least 3.2 on a 4.0 scale, have outstanding football ability as a first team player or significant contributor and have demonstrated strong leadership and citizenship. He was one of 201 players across all levels of college football to be recognized as a semifinalist.\nThe National Football Foundation will announce 12-15 finalists on Oct. 25, and each finalist will receive an $18,000 postgraduate scholarship as a member of the 2023 NFF National Scholar-Athlete Class Presented by Fidelity Investments. One of the finalists will be named the winner of the 34th Campbell Trophy® during the 65th NFF Annual Awards Dinner Presented by Las Vegas on Dec. 5 and have his postgraduate scholarship increased to $25,000.\n13TH ANNUAL HUSKER HEROES WELCOMES OVER 600 TO MEMORIAL STADIUM\nThe Nebraska Athletics annual Husker Heroes Outreach Event is a true testament to the power of community collaboration. Sponsored by the Athletic Department and a coalition of organizations dedicated to individuals with special needs, including the Networking for Everyone with Special Needs, the Arc of Lincoln, Autism Center of Nebraska, Autism Family Network, Autism Society of Nebraska, Down Syndrome Advocates in Action Nebraska, Down Syndrome Association for Families, Josh the Otter, Nebraska Spina Bifida, and United Cerebral Palsy of Nebraska. This event represented a united front in supporting those who need it most.\nOn Sunday September 17th, over 600 individuals with special needs and their guests, coming from various corners of the state, took the field at Memorial Stadium to partake in this extraordinary day of unity. The event provided a unique platform for these individuals to interact with over 80 first-year and transfer Husker student-athletes, who acted as mentors, companions, and friends throughout the day.\nThe day was filled with a range of sport-related activities carefully crafted to accommodate the diverse interests and abilities of the participants, and featured some additional enjoyment with a face painting station and a dance activity. Regardless of physical or cognitive challenges, everyone was encouraged to engage in games, fostering an environment where their abilities were celebrated, and differences were embraced.\nThe Husker Heroes Outreach Event not only showcased the resilience and capabilities of individuals with disabilities but also underscored the importance of inclusion and community support. For Husker student-athletes, it was an opportunity to learn from the unyielding spirit of the special needs community, reminding them that sports extend far beyond the field.\nAt the conclusion of the event those in attendance left with cherished memories and newfound friendships. The Husker Heroes Outreach Event once again proved that through unity and understanding, we can create a world where everyone, regardless of their abilities, has a place to belong. In a time when division seems to dominate headlines, this event was a heartwarming reminder that compassion, acceptance, and the spirit of togetherness can make an enduring impact on our communities. Go Big Red!\n“Being a freshman on campus everything happens very quickly, it was great to slow down and enjoy some time with an amazing group at the Husker Heroes event.”\n- Tucker Timmerman (Baseball)\n“This gathering showed the true power of the Husker community! I am glad I was able to be a part of such a beautiful event!”\n- Samantha Bland (Softball)\nHUSKERS HEAD TO GANS CREEK CLASSIC\nNebraska cross country continues its season at the Gans Creek Classic in Columbia, Mo. on Friday, Sept. 29. The Mizzou-hosted event is set to begin at 9 a.m. (CT) for the men’s 8K and at 9:45 a.m. (CT) for the women’s 6K.\nThe meet, set to run on the Gans Creek Cross Country Course, features 24 Division I schools.\nLast Time Out\nAt the Greeno/Dirksen Invite on Sept. 16, Berlyn Schutz secured her second-straight meet title with a 17:10.66 at the Mahoney Golf Course in Lincoln. Schutz was honored as the Big Ten Women’s Cross Country Athlete of the Week on Sept. 20 after the home meet win. The freshman from Lincoln powered the Husker women to a runner-up team finish with 62 points on the morning. Brynna McQuillen finished eight seconds behind Schutz to pitch in a second-place finish with a 17:18.37. Taya Skelton covered the course in 17:43.75, earning a spot in the top ten. Cami Merickel placed 22nd (18:10.82) and Jacqueline Abanses (18:19.03) took 27th, rounding out the Huskers in the top 30.\nThe Husker men took fifth with 128 team points, led by Trevor Acton placing 19th with a time of 25:19.63. Eric Carothers and Jerry Jorgenson provided back-to-back finishes in the top 25, with Carothers clocking a 25:26.49 (24th) and Jorgenson running a 25:29.09 (25th). Colby Erdkamp crossed the line at 25:42.26 to place 28th and Joe Volkmer finished 33rd with a 25:58.56.\nMeet Information\nHost: Mizzou\nDate: Friday, Sept. 29\nParticipating Teams: Baylor, Bradley, Colorado, Creighton, Idaho State, Illinois, Kansas, Kansas State, Lindenwood, Lipscomb, Marquette, Mississippi State, Murray State, Omaha, Nebraska, North Florida, Northern Iowa, SEMO, SIU, Texas Tech, UC San Diego, UMKC, Western Illinois, Wichita State\nCourse Map: Men's and Women's Course Map\nStarting Times: Men – 9 a.m. | Women – 9:45 a.m.\nTiming & Results: Live Results\nHUSKERS KICK OFF FALL SEASON IN TEXAS\nNebraska women’s tennis begins its fall season in Waco, Texas, at the Baylor H-E-B Invite, Sept. 29 through Oct. 1. Graduate Maja Pietrowicz, senior Anfisa Danilchenko, juniors Lucy Loy, Jillian Roa and Ana Zamburek, and freshman Maria Taranova will represent the Huskers.\nNU will compete without seniors Isa Adrover Gallego and Raphëalle Lacasse due to the pair competing at ITA All-American in Cary, N.C., starting Monday, Oct. 2\nThe Huskers begin the 2023-24 season coming off a 16-10 record last season. NU hopes to continue a successful run under new leadership with head coach German Delmagro and assistant coach Maddie Kobelt.\nNU returns Adrover Gallego, Danilchenko, Lacasse, Loy, Roa and Zamburek, and have added Pietrowicz and Taranova to round out the 2023-24 squad.\nThe Baylor H-E-B Invite features seven schools alongside Nebraska: Texas, Illinois, Missouri, Tennessee, SMU, Baylor and Denver. On Friday, Saturday and Sunday, play begins at 9 a.m. (CT) with doubles competition, and singles will begin at 10 a.m. (CT).\nKeep an eye out on Nebraska Women’s Tennis social channels to receive updates on Baylor H-E-B Invite.\nBaylor H-E-B Invite Tournament Schedule (Hurd Tennis Center, Waco, Texas):\nBÁCSKAY SET FOR WORLD GYMNASTICS CHAMPIONSHIPS\nRising sophomore Csenge Bácskay is set to compete at the 2023 Artistic Gymnastics World Championships in Antwerp, Belgium. The event will run from Sept. 30 to Oct. 8, and will be held at the Sportpaleis.\nBácskay and Team Hungary will compete against Germany and Finland in Subdivision 8 on Oct. 2, at 10:45 a.m. (CT). This marks Bácskay's second world championships as she competed with Team Hungary last year in Liverpool.\nThe top eight team scores will advance to the team finals set for Wednesday, Oct. 4, at 12:30 p.m. (CT).\nThe top eight scores from each event will advance to the apparatus finals. Vault and uneven bars finals will take place on Saturday, Oct. 7 at 7 a.m. (CT), and the beam and floor finals will take place on Sunday, Oct. 8 at 7 a.m. (CT).\nThe championships are a qualifying event for the 2024 Paris Olympics. Teams and individuals will compete for qualifying scores.\nFans can watch the team, individual and apparatus finals on Peacock. Live results can be found here.\nThe full schedule for women’s events can be found below. Additional information about the event can be accessed at the event website.\nSunday, Oct. 1 – 9:00 a.m.-1:50 p.m. CT – Women’s Qualifications Day 1\n- 9:00 a.m. CT – Subdivision 1 (ITA, NED)\n- 10:45 a.m. CT – Subdivision 2 (TPE, USA)\n- 12:30 p.m. CT – Subdivision 3 (GBR, KOR, RSA)\nMonday, Oct. 2 – 3:00 a.m.-3:35 p.m. CT – Women’s Qualifications Day 2\n- 3:00 a.m. CT – Subdivision 4 (ESP, BEL, ROU)\n- 4:30 a.m. CT – Subdivision 5 (MEX, SWE)\n- 6:00 a.m. CT – Subdivision 6 (AUS, BRA)\n- 9:15 a.m. CT – Subdivision 7 (AUT, CAN)\n- 10:45 a.m. CT – Subdivision 8 (GER, HUN, FIN)\n- 12:45 p.m. CT – Subdivision 9 (JPN, CZE, ARG)\n- 2:15 p.m. CT – Subdivision 10 (FRA, CHN)\nWednesday, Oct. 4 – 12:30-3:05 p.m. CT – Women’s Team Final\nThursday, Oct. 6 – 12:30-3:00 p.m. CT – Women’s All-Around Final\nSaturday, Oct. 7 – 7:00-11:00 a.m. CT – Apparatus Finals Day 1 (MFX, WVT, MPH, WUB, MSR)\nSunday, Oct. 8 – 7:00-11:00 a.m. CT – Apparatus Finals Day 2 (MVT, WBB, MPB, WFX, MHB)",
  "word_count": 1717,
  "scraped_at": "2026-02-14T13:09:20.940659"
}