{
  "article_id": "3fef57f8ca2f",
  "url": "https://www.philstar.com/opinion/2025/03/27/2431309/when-girls-rise-we-all-rise-shared-vision-gender-equality",
  "title": "When girls rise , we all rise : A shared vision for gender equality",
  "date": "20250326T164500Z",
  "domain": "philstar.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "When girls rise, we all rise: A shared vision for gender equality\nDear friends,\nHappy Women’s Month!\nThis year’s International Women’s Day theme – “For ALL women and girls: Rights. Equality. Empowerment” – is a powerful reminder that true progress only happens when no one is left behind. At the heart of this vision is empowering the next generation of young women and girls – because when women lead, they don’t just change their own lives, they transform their families, communities and the world around them.\nFor Australia, gender equality means ensuring equal rights, responsibilities and opportunities for all people. It’s about enabling everyone – regardless of gender – to live safely, with dignity and respect and to reach their full potential.\nGender equality isn’t just a moral imperative – it’s a vital national interest and a necessary foundation for peace, security and prosperity. It’s a core component of our foreign policy. In fact, 80 percent of all Australia’s development investments globally must promote gender equality effectively – a target that drives us to ensure women and girls are part of every solution.\nHere in the Philippines, we are proud to work alongside government and civil society partners to ensure women and girls – in all their diversity – are safe and have equitable access to opportunities and leadership roles.\nOne story that continues to inspire me is that of Ronalyn Lagata. Ronalyn is a remarkable young woman whom I met through the Fairplay for All Foundation in Payatas, Quezon City – an initiative Australia proudly supports to empower Filipino children through sport.\nOne of 11 children, Ronalyn grew up helping her family to make ends meet. At age 13, she joined football training at Fairplay. She fell in love with the sport and trained relentlessly, balancing her studies along the way.\nBy 2014, Ronalyn represented the Philippines in the Street Child World Cup in Rio de Janeiro. She later led the Philippine Team in Russia (2018) and Qatar (2022). She also earned a degree in Fitness and Sports Management as a varsity scholar.\nToday, Ronalyn manages the Fairplay sports center, mentoring 257 young footballers – nearly half of them girls.\nRonalyn’s story is proof that investing in girls doesn’t just change their lives – it transforms entire communities. Girls who are empowered become role models, mentors and changemakers – breaking barriers for those who follow.\nThis is why Australia remains steadfast in advancing gender equality in the Philippines.\nThrough our P1.5-billion Social Protection, Inclusion and Gender Equality program, Australia is partnering with the Philippine government to strengthen social protection systems, improve gender budgeting and combat gender-based violence and adolescent pregnancy.\nWe are also supporting indigenous women artisans in South Cotabato – helping over 40 T’boli women preserve their traditional T’nalak weaving, improve their craft and connect to markets. This ensures their cultural heritage thrives alongside economic opportunity.\nMeanwhile, our Australia Awards scholarship program is paving the way for a more diverse generation of leaders. Of our current 397 postgraduate scholars, 52 percent are women, with representation from non-binary individuals, persons with disabilities and Indigenous communities.\nBeyond the academic sphere, we’re nurturing this network of talented alumni through mentorship, professional development and leadership training – building a strong pipeline of Filipino women leaders across sectors.\nThese efforts demonstrate a powerful truth: when we create deliberate opportunities for girls and women, we don’t just challenge outdated gender norms – we rewrite them.\nFor our communities and countries to truly thrive, we need everyone’s contributions – regardless of gender.\nAt the Australian Department of Foreign Affairs and Trade, we’ve set ambitious leadership targets: 40 percent men, 40 percent women and 20 percent for all genders. Today, I’m proud to share that women now hold 49 percent of ambassador roles and 50 percent of senior leadership roles – a reflection of our commitment to creating space at the top for women’s voices.\nAs a female ambassador representing Australia, I am living proof of what women and girls can achieve when supported by champions of all genders. I would not be here today without the mentors who guided me – and most importantly, my parents, who raised me to believe that no dream was too big.\nThat belief is a gift I now carry forward – to inspire the next generation of girls to dream boldly, lead fearlessly and reshape the world around them.\nBecause when women and girls rise, we all rise.\n* * *\nHK Yu is the Australian Ambassador to the Philippines. Follow her on X (formerly Twitter) @AusAmbPH.\n- Latest\n- Trending",
  "word_count": 762,
  "scraped_at": "2026-02-14T12:34:39.527070"
}