{
  "article_id": "4013a9ec960b",
  "url": "https://www.esquire.com/uk/culture/a43957830/wembley-at-100-history/",
  "title": "The Story of Wembley Stadium , 100 Years Later",
  "date": "20230522T121500Z",
  "domain": "esquire.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "When she was a kid, Ellen White played Wembley. This is how you play Wembley when you’re a kid, and you’ve never actually been to Wembley: someone goes in goal and everyone else tries to score past them, and the last person to score goes out. It gets frantic. Shins are kicked. Mud cakes your knees, car-park gravel bloodies your palms. Glory beckons.\nWhen there was no one else around, and no ball to play with, Ellen White belted whatever was to hand — cans, bottles — into goals made of sweatshirts, rocks, shoes. As soon as she got home for dinner, she would beg her parents to let her go back out. She wanted to play Wembley again, because playing Wembley was everything.\nA decade or so later, and a shade under 30 miles away from her home in Aylesbury, Buckinghamshire, White ran onto the field at Wembley — the stadium, rather than the state of mind — as a professional footballer for the first time. She came on in the 84th minute of Team GB’s win over Brazil in the 2012 Olympics in front of 70,000 fans. She went on to play at Wembley for England, Notts County, Birmingham City and Manchester City.\nWhat to Read Next\nFor White, the experience of stepping out onto the Wembley pitch each time she has done it is hard to put into words. “You can feel it going through from your toes right to your head, and it’s just a…” She pauses, trying to find it. “It’s an indescribable feeling.”\nWembley is the ultimate for pop stars, too. Take That sold out eight nights at Wembley in 2011, and to Gary Barlow the stadium is “the business”. His bandmate Howard Donald remembers looking around at the 90,000 empty seats during a soundcheck and wondering, “How the hell we were going to fill this massive place?”\nBarlow could feel the weight of “an awesome, historic” venue, which demands certain moves and catchphrases. “Just saying those words: ‘Good evening Wembley!’ Wow — I can’t believe I’ve had the chance to say that,” he tells Esquire.\nThe Wembley run was, Donald says, “probably the peak, in my eyes”.\nThat peak can be a difficult thing to come down from. Soon after playing three nights at Wembley in 2009, Noel Gallagher realised Oasis had found the end of the road. “We sold out all the great gigs in the world,” he told Esquire in 2015. “Hollywood Bowl, Madison Square Garden, Wembley fucking Stadium.”\nThere was nowhere left to go after Wembley fucking Stadium. “We’ve done it all,” he thought. “We’re only going to go round in circles now.” Two months later, Oasis split up.\nWembley stadium celebrates its centenary this year. The largest stadium in the UK, with a seated capacity of 90,000, it stands in a large, otherwise unremarkable northwest London suburb, amid a landscape of light- industrial sites — lock-ups, car parks, timber yards — and terraced houses, low-rise shop fronts and high-rise flats.\nIn the English imagination, though, Wembley shares a postcode with Camelot and Avalon. It’s a concrete and glass enormo-bowl in a part of London that is a bit of a pain to get to and rarely gets much love, and it’s also a two-syllable incantation (sometimes three, as in “Wem-ber-lee”), which summons up half-memories of times when sport and music pulled the world towards it.\nBut there was a time when the word Wembley meant nothing. In the middle of the 19th century, it was a thickly wooded hill in the Middlesex countryside, home to barely 200 people. There were broad, open pastures and an orchard. Wild herons stood in its streams.\nThe London and North Western Railway carved past it to the west, but otherwise it was still the hamlet it always had been. Wembley was, a local clergyman wrote in a history of his parish, “practically unknown” and “possessed no individuality”.\nThe London and North Western Railway’s owner, Sir Edward Watkin, had spent his life looking for legacies to leave. In the 1880s he had proposed a Manchester-to-Paris rail route, but it had failed — some feared the French would invade through a Channel tunnel. Instead, he started to plan an amusement park near Wembley Park station on his Metropolitan line, the train route that had been the first of the London Underground routes and now extended into Hertfordshire and Buckinghamshire. It was to be named Wembley Park, and at its centre would be some great wonder of the age, to pull in day-trippers and pleasure-seekers.\nThe design chosen by Watkin’s jury was an eight-legged monster of latticed steelwork. At 360 metres high it would be the tallest structure in the world, stuffed with restaurants, theatres, ballrooms, winter gardens, a sanatorium, Turkish baths, a 90-room hotel and an astronomical observatory. If it were built today, it would be taller than the Shard.\nBut Watkin’s Folly, as it became known, never got that far. Though construction started in 1891, by 1899 the foundations had cracked, the steel was starting to sink, and when Watkin died in 1901, all that remained of his vision was a 40-metre stump, lying rusting and unloved. In 1907, even that relic was blown up with dynamite, leaving four deep craters on Wembley Hill.\nThe site stayed that way until after the Great War. Though the British Empire ruled over 458 million people by 1922, its leaders were anxious. Edward, the Prince of Wales, later Edward VIII (still later the plain old Duke of Windsor), pushed for a great exhibition to boost international trade, and to convince his colonial subjects — and the world at large — of the Empire’s grandeur and power.\n“And another feature of this great exhibition, which I know will appeal to all Britishers,” Edward said in a speech, “will be a great national sports ground.”\nWembley — close to London, well connected, but still undeveloped — was chosen as the site. By April 1923, Wembley Hill was gone. Three thousand trees had been cleared, and 150,000 tons of clay dug out and removed. Over 300 working days, a gigantic stadium rose in the hill’s place. Open terraces surrounded a pitch turfed with grass from a local golf course, and inside the walls was everything that would be needed when the population of a small city turned up on a matchday: a tea room, a gym, wireless stations, offices, a post office and a banqueting hall for 1,000 people. The Empire Stadium was made of 25,000 tons of concrete, 1,500 tons of steel and half a million rivets. More than 125,000 people could stand inside its banked, cream-white bowl. Two giant towers stood sentinel at its entrance, part colonial fortress and part picture-book castle.\nSure, Titus of Rome had built the Colosseum, a pamphlet by builders Robert McAlpine said. But “it probably did not enter his imperial mind that one day a stadium almost three times as large, and infinitely more enduring, would be constructed in less than a tithe of the time by a nation whose people he and his forbears thought it scarcely worthwhile to conquer”.\nThe opening of the Empire Stadium was set for 28 April 1923, when it would host the FA Cup final between Bolton Wanderers and West Ham United. The excitement of the new stadium drew people in droves. Kick-off was at 3pm; by 1pm the ground was at capacity. Still people kept coming. The gates shut at 1.45pm, but fans clambered over the top of the turnstiles, pushed through barriers, shinned up drainpipes and tore down woodwork. Estimates vary of how many people got in; up to 250,000 is likely.\nInside the ground it was pandemonium. Some people offered attendants money to help them escape. A 12-year-old recalled being “caught by the irresistible surge of the crowd and, breathless and bewildered, [we] found ourselves pressed against the concrete surround of the playing area”.\nThe game became known as the White Horse Final, in honour of a story that circulated afterwards of a kind police horse called Billy who gently nudged fans from the pitch. It’s incredible that nobody died, but that Cup final imprinted Wembley in the national imagination.\n“Already it had a legend, within 24 hours of opening its gates for the first time,” says Nige Tassell, author of Field of Dreams, a recent history of the stadium. “Everyone knew of Wembley suddenly; it wasn’t just this anonymous place.”\nA year later, in 1924, the British Empire Exhibition opened. Dozens of exhibition halls and pavilions were spread across the 216-acre Wembley Park site in a rough triangle bounded by two railway lines and the River Brent. Walk the gently sloping kilometre up from Wembley Park station toward the stadium, and you’d pass the giant halls of engineering and of industry showcasing British ingenuity, then bandstands and a boating lake. You’d have spotted the winding gear of a model coal mine, before coming to the Canadian and Australian pavilions right in front of the stadium’s towers.\nOf the 58 territories in the empire, 56 took part, and to add to the vibe of each nation’s exhibition hall the British designers tried to approximate the look of traditional architecture in concrete. Nigeria, Sierra Leone and modern-day Ghana’s pavilion was a rough tribute to West African walled cities, with beadworkers and metalworkers showing visitors their craft.\nIn the Australian hall, there was a 16-foot clump of scoured wool. In the Palace of Beauty, 20 women posed as historical celebs — Helen of Troy; Mary, Queen of Scots; Nell Gwyn; Madame de Pompadour — behind thick glass for six hours a day. In its pavilion, Canada contributed a life-size statue of the Prince of Wales and his horse sculpted entirely from butter, kept in a refrigerated case.\nIt was not all benign. The sketchy approximations of colonial cultures were peopled with colonial subjects who had little privacy and little say in where they went or what they could wear, and were gawped at by white Europeans. London’s Union of Students of African Descent complained that West Africans had been brought to the exhibition “to be ridiculed”.\nThough it had 27 million visitors over two years, the exhibition closed in 1925 having lost millions of pounds. The buildings alone cost £12 million then — around £574 million today — and the large number of staff needed to run the world’s biggest-ever exhibition took a chunk out of the takings too.\nThe buildings were snapped up for just £300,000 by a breezy, charming, blue-eyed Lancastrian called James White. People were optimistic about the site’s future at first, but by 1925 one newspaper was calling the Empire Stadium “a vast white elephant, a rotting sepulchre of hopes and the grave of fortunes”. There was no plan for how to make it turn a profit, or even what to do with the exhibition buildings after the party was over. The wrecking ball loomed.\nIt only survived because of a former bootmaker, tax official and RAF pilot named Arthur Elvin. He had been a near-penniless veteran at the start of the exhibition, when the Ex-Officers Association got him a job there, running a tobacconists’ kiosk. The whole Wembley Park complex was due to be pulled down once it was over, and White contracted him to clear the site. Elvin spotted an opportunity.\nWith money saved from his tobacco business he bought up a building at a time, breaking it up and selling its parts for a profit, and moving on to the next one. The stadium itself went into liquidation, and Elvin persuaded White to sell it to him for £122,500.\nWhite, though, had promised too much to too many people. Debts, contracts and obligations piled up, and he found himself staring at financial disaster. White killed himself in 1927, leaving a note for the coroner: “Go easy with me, old man. I am dead from prussic acid. No need to cut any deeper. Jimmy.”\nAt 28 years old, Elvin became the sole owner of the Empire Stadium. He immediately saw that occasionally using it as a football stadium was not going to pay the bills. “You’d have one domestic match and, at that moment, England weren’t playing other teams beyond the home nations,” says Tassell. “So you might have had three, possibly four matches, tops, every year. And you can’t survive on that.”\nElvin moved quickly. He introduced greyhound racing and speedway motorbike racing at Wembley. In fact, pretty much anything that might turn a profit was considered — even a mid-June ski-jumping competition, complete with real snow and a jump made of extremely rickety-looking scaffolding. Newsreels show competitors who’d travelled from across Europe flying across a bright north-London sky. The skier wearing a number 13 launches himself, overbalances, and skids face-first off the end of the snow bank and onto the hay-covered pitch. There is light applause from the terraces.\nAll the information above I learn in February, when I sign up for a tour of Wembley. It is, the website promises, “an unforgettable experience for all the family”.\nThere are about 30 of us, mostly half-term families with pre-teen kids in tow, and a couple of dads with a couple of primary-school lads. Most are Brits, though there’s a family from Croatia and one from Italy, plus a couple of international students.\nOur guide is a stats guy. He rattles through a few (the height of the arch, the number of seats, the number of toilets), warns us about wandering off, then repeats the same stats in a slightly different order. Your Wembley tour guide will say “iconic” a lot, in between telling you not to wander off. He is very concerned about people wandering off.\nHe leads us into a walk-through exhibition commemorating all those off-plan events at Wembley, next to three green screens via which you’re spliced into big Wembley occasions. A tourist with a cross-body bag and cream Yeezys is herded along. He’s already been pitch-side on the first screen, and stood on stage in front of 90,000 adoring fans in the second.\n“Right, now you’ve won the FA Cup,” says the photographer.\nThe tourist looks blankly into the camera, as if he’s being shot for a driving licence. The guy on the camera mimes celebrations at him, waving his arms and cheering. The tourist nods, then stays completely still.\n“You’ve won the FA Cup,” the snapper says again. The tourist opens his mouth fractionally.\n“Great,” says the photographer.\nWe’re led to a section of seats in the stadium proper, just below the ring of corporate boxes, for some more stats. In the vast bowl you shout and you hear your voice bounce back down from behind, past your head and down to the pitch.\nThen it’s on to some of the areas that only insiders usually see: the mixed zone where the media collars players after games, which has the same wire-wool carpet as your office building, probably, and the press conference room with banked seats. (We are reminded not to jump on the desk as goalkeeper Mary Earps did while invading Sarina Wiegman’s conference after the Euros final.) The all-white dressing rooms are extremely impressive in the way that a Bond villain’s lair is extremely impressive, or at least in the way a Bond villain’s very expensive private dentist would be.\nWe head out into the players’ tunnel where a bust of Sir Alf Ramsey, England’s World Cup-winning manager, stares toward the pitch with the expression of a man investigating the source of a smell in his fridge. Ahead of him are two sets of double doors through which we can see the pitch, and a barrier stopping any tourists wandering onto the turf. This corridor, which smells a lot like recently disinfected, hard-wearing plastic flooring, is the most sacred part of the most special place in English football. Beyond the doors of the most sacred part of the most special place in English football, a French exchange student films his friend doing a dab.\n“What teams will we be?” asks our guide.\n“Man City,” says a boy.\n“Newcastle,” says another.\n“Right, everyone choose who you’re playing for,” says the guide. Everyone mills around, deciding which sportswashing project they would most like to represent. We’ve already been warned that pratting about and going on the grass of the pitch itself comes with a fine.\nAnd then we’re out pitchside on the astroturf that managers and coaching staff direct their teams from, and snark is hard to summon.\nOn a matchday the Wembley pitch is an impossible, hallucinogenic green. It’s so green it looks as if it’s vibrating slightly, wobbling your eyes in their sockets. But even today, a murky winter morning, it is startling.\nYour brain starts superimposing Big Wembley Moments on the empty grass and a crowd in the stands. Chloe Kelly whirls her shirt over her head. Luke Shaw catches it clean. Harry Kane leads a chorus of “Sweet Caroline”. Bukayo Saka stands alone on the penalty spot. Beyoncé rips into “Formation”. Sarina Wiegman crosses her arms and thinks. A few metres away, Steve McLaren fiddles with an umbrella.\nOn the other side of the pitch, I can see where I sat the first time I came here, for the 2009 Championship play-off final. We set off from the north-west at 5am, Burnley scarves fluttering from the windows of my dad’s Volvo estate. When day broke it was hot and still and sticky. We beat Sheffield United 1-0. I screamed. Dad cried.\nThere are older ghosts here, too. Under the old stadium’s towers, Henry Cooper sits Cassius Clay (later Muhammad Ali) down with a left hook. Ferenc Puskás and his Hungarian teammates whirl past bewildered Englishmen. Gazza flips the ball over Colin Hendry. The Ultimate Warrior whacks “Macho Man” Randy Savage with a chair at the 1992 WWF SummerSlam.\nYou can’t help it. It’s magnificent.\nThere are two big Wembley moments that, until recently, have loomed larger than the others.\nOn the morning of 30 July 1966, Bobby Charlton went shopping on Hendon high street. Nobody noticed him. On the coach ride to Wembley, where Charlton and his team-mates on the England football team would play West Germany in the World Cup final, there were only a few fans around to wave them off outside the hotel. As they drove past the local fire station, firefighters saluted them in full dress uniform.\nThe dressing room was quiet before the match. As they came out of the tunnel, though, the England players’ senses were flooded. “As you hit the open air you heard this roar that drove every thought out of your mind,” George Cohen, England’s right-back, recalled later. “There was colour and movement all over the place.”\nYou know the rest: the Russian linesman; Nobby dancing; Bobby Moore lifted shoulder-high. They thought it was all over; it was then.\nThe crossbar that Geoff Hurst hit while scoring the second of his three goals is now a holy relic at Wembley, hanging above the entrance to another small museum in the new Wembley, this time about the old stadium. It looks weirdly like a mammoth tusk, lozenge-shaped rather than cylindrical, white paint flaking to show aged wood underneath.\nSomething shifted that day. Football and pop culture and Britain alchemised into a pulsating thing for the first time. The late commentator John Motson remembered being able to walk up to Wembley and buy a ticket on the gate for England’s first game of the tournament. By the time of the final, everybody wanted to be part of it. More than 32 million people in the UK watched on TV as Moore lifted the Jules Rimet trophy, with the twin towers in every shot. By the time the bus took the team to their celebration dinner in Kensington, crowds were clogging the roads, waving Union flags.\nThe team celebrated in the West End, at the Playboy Club. It was, Charlton reflected later, “maybe not my natural habitat”. But, after 1966, it was the natural habitat of the footballer. That summer allowed players access to a level of stardom for which they’d previously been too grubby and working class.\nAs the Beatles had done for pop music, the 1966 World Cup winners extinguished any lingering snootiness about football by sheer force of their achievements. (A 19-year-old, moptopped George Best had been crowned “O Quinto Beatle” by the Portuguese press earlier that year.) Bobby Moore and his wife Tina became a celebrity couple, close enough to Sean Connery to let him babysit their daughter Roberta when they holidayed together. In 1966, skiffle singer Lonnie Donegan’s banjo-powered, gorblimey ode to the tournament mascot, “World Cup Willie”, did not chart. In 1970, the England squad’s song “Back Home” became the first single by a football team, and hit number one.\nFootball went pop. At the same time, pop came to football. Wembley hosted Status Quo and Yes at an Oxfam rally in 1969, but the first proper Wembley gig was The London Rock and Roll Show in 1972. First-generation rockers — Little Richard, Chuck Berry, Jerry Lee Lewis — played to teddy boys in drape jackets and creepers.\nEverything looked slightly cobbled together, but the principle was proven. By the mid-1970s, Wembley had started to be seen as the peak of any rock star’s ambitions even if, as concert promoter Harvey Goldsmith recalls, it was mainly for the sake of convenience.\n“Look, at the time, it was the only stadium in London,” Goldsmith explains. Getting a huge payday for a few shows in a single stadium, rather than schlepping around smaller venues for months, was appealing, and the residents of Chelsea, Tottenham and Highbury, the London neighbourhoods where other large stadiums were located, wouldn’t allow it. “There was only Wembley Arena or Wembley Stadium,” says Goldsmith. “That was it.”\nHorse shows and military tattoos were replaced by Bruce Springsteen, Bob Dylan and the Stones, and the Texan stuntman Evel Knievel attempting to leap 13 London buses and breaking his pelvis. In 1955, American televangelist Billy Graham addressed a freezing crowd at Wembley wearing a long mac with his breath rising in front of his face, looking as if he could have been talking at any village parish of a Sunday. When Pope John Paul II said mass to 80,000 people at Wembley in 1982, he turned on the old razzle-dazzle: he was driven around in his Popemobile, while TV audiences saw the towers flanking a giant crucifix.\nLive Aid, though, dwarfed them all. The concert’s aim was to raise a million pounds for famine relief in Ethiopia. It made £140 million. Two billion people saw Wembley on TV as a seething, sunburned mass of joy. Goldsmith, the show’s promoter, ended Live Aid on stage, Bono and Paul McCartney to his left and George Michael to his right. Wembley became, he says now, “the top of the mountain”.\nBands had played there before Live Aid, but in the years since then Wembley has become the first choice for any megastar — Beyoncé, Madonna, the Spice Girls, Taylor Swift — who wants an official seal on their hugeness. “It had that big name anyway, but Live Aid really just announced: ‘we’re on the map now’,” says the stadium’s current director, Liam Boylan.\nAfter Live Aid, everyone knew what playing Wembley meant. “It was a big deal everywhere, particularly in America,” says Goldsmith.\nAt Live Aid the whole world came to Wembley, where an exciting, communal, emotional Britain looked forwards. After half a century, the stadium had finally fulfilled the purpose it was built for.\nThe Prince of Wales shifted in his seat. Charles had expected to be in first class on the plane to Hong Kong, but found himself and his staff upstairs in club class. He thought, wistfully, of the politicians in first class. “Such is the end of Empire,” he sighed to his journal, later published (without his permission) in the Mail on Sunday.\nIt was late 1997. Almost every piece of the Empire which the 1924 exhibition that Charles’ great Uncle, Edward, had sought to bind together had rebelled, defected, partitioned or claimed independence. In 1945, 700 million people outside the UK were ruled by Britain. By 1965 it was just five million, and more than half of them lived in Hong Kong.\nNow, Edward’s eternal concrete colosseum was crumbling too.\nIt had been coming. Alistair Coleman, a columnist for the Arsenal fanzine The Gooner and a regular visitor to Wembley with the club during the 80s and 90s, was accustomed to the bad facilities at away grounds. Wembley, however, “was thoroughly grim”.\n“If you were standing — later sitting — at the tunnel end, the first thing you encountered as you climbed the steps up to the turnstiles was a grassy bank literally covered in dog shit.” Coleman surmised it was where the greyhounds were kept between races. “Nobody seemed to clear it up, ever.”\nThe toilets had been inadequate when the stadium was built. Eighty years later, they were horrific. There were 360 toilets at the old stadium — roughly one for every 216 fans in an 82,000-capacity crowd.\nWhen unable or unwilling to find a toilet, fans simply pissed against the walls of the concourses. Coleman saw it a lot. “I always assumed The Great Wembley River of Piss was a permanent feature.”\nThere was nothing to do once you got off the Tube in Wembley, so most people turned up as close to kick-off as possible. “It was always pretty nasty inside that concourse, and it wasn’t really safe,” says Angus Campbell, who visited the original stadium as a fan, and would later, as an architect at Foster + Partners, work on the version that would replace it.\nThe noise was still good and the atmosphere still intense. But a new millennium demanded a stadium that didn’t stink of urine. Wembley needn’t even be in Wembley. Why, asked The Observer, should it be in \"an inconsequential, unpleasant, inaccessible part of London”?\nThe end, when it came in 2000, was pathetic. The towers’ flags were soaked in sheets of October rain. In the final match played there, the England men’s team lost to Germany in the frantic, fevered way England’s men lose when things really unravel. Manager Kevin Keegan resigned in the toilets.\nIn 2002, the bulldozers moved in. Objects and fittings from the stadium that had been close to greatness were stripped out and auctioned. A large ashtray from the royal box went for £550. A subs’ bench from a dug-out: £350. Clothes hooks from the dressing room: £240.\nThe towers were the biggest keepsake of all. Halton Borough Council offered to pay £3 million to move them to Widnes in Cheshire. The Guardian reported that a Nepalese businessman intended to buy them and ship them to his home country, where they would form a new scenic entrance to the Annapurna mountains.\nFoster + Partners, the firm founded by the legendary British architect Norman Foster (later Lord Foster), which had won the contract to design the new stadium, tried to find a way of hanging onto the towers, perhaps lifting them up and rolling them into a new position somewhere on Olympic Way. In the end it was impossible, both practically and aesthetically.\n“They looked quite grand,” Campbell says, “but actually they were 300 millimetres of reinforced concrete.” In front of a gigantic, sleek new stadium, they would look slightly silly. Searching for something new to rival the towers, the first design for the new Wembley had four huge masts suspending the roof above the stands. Foster + Partners revealed it to the press, and immediately regretted it. “Norman came back afterwards and he’s going, ‘I just don’t like it,’” Campbell remembers.\nInstead, they came up with an angled arch reaching 134 metres above the pitch. The hollow towers of a pretend fortress replaced by a gigantic metal rainbow.\nYou can still find the last atoms of old Wembley if you look for them, though few people do. The base of one of the two towers’ flagpoles is now marooned on a grassy ridge in nearby Brent River Park, where the thrum of lorries in second gear drifts across the park from the North Circular.\nIf the old stadium represented something of its imperial time, the new, £798-million stadium was slower to capture the popular imagination. In fact, until it was finished in 2007, seven years after the original stadium was shuttered, it regularly looked as if it would be a Millennium Dome-style fiasco. It may have solved some of the problems of its earlier incarnation — it moved people around more swiftly, wiped down easily, and has sensible, hard-wearing, wire-wool carpets. It had 2,618 toilets. But it was, initially, hard to love.\nAnother problem: it isn’t the only gig-ready stadium in London anymore — Beyoncé, for instance, will play Tottenham Hotspur this summer. Boylan, the stadium director, wants to break the 100,000-attendance barrier as a badge of pride. “Scheduling is the difficulty,” he says. “How do you expand your windows? How do you make [the summer gig season] bigger?”\nThis summer, Wembley will host 24 non-football events: Harry Styles, Blur and the Weeknd are up. “We can now finish the third week in July,” says Boylan. “In the past, gigs had to stop in late June. So you’re opening two, maybe three more weekends to concert promoters. And can you fit in two, maybe three shows in those weekends.”\nGiven Tottenham Hotspur have teamed up with Formula 1 to build an indoor-karting track underneath one of their stadium’s stands, other upgrades might be needed soon. Minigolf, maybe, or perhaps a water park.\nWembley was a building site for seven years after its squelchy farewell, and as much as touring the England men’s team around the country was fun, the lack of that national crucible weighed heavily.\nIt’s hard to recall a great gathering of the people in that weird void. Live 8, the 2005 Live Aid redux in Hyde Park, was about as close as we got, and even that was riding Wembley’s legend. Now, 16 years after the new stadium opened, Campbell says, “it’s getting its own moments”.\nEllen White knew she was going to retire after the European Championship final at Wembley, but she’d kept it quiet. “I didn’t want all sad eyes on me, watching, adding more pressure,” she says. She had a header saved. Other chances came and went. She was substituted just before the hour.\n“I was just an absolute nervous wreck the whole time after coming off,” she remembers. England went one up thanks to Ella Toone’s lob; Germany equalised and took the game to extra time. White laughs. “Classic England.”\nWith 11 minutes to go, Chloe Kelly bundled in a second goal. At just after 7.30pm, the final whistle blew. Fifty-six years since Geoff Hurst and the linesman and the people on the pitch, England were champions again. White bolted onto the pitch towards Kelly, and ended up bundled over in a scrum. “And then, yeah, I just…” It’s a bit of a blur. “I honestly didn’t know which emotion to feel. It was a thousand emotions in one. It was just mental. I think it was just mainly disbelief, really, that we’d achieved it.”\nWith that win, the new Wembley has something electrifying and real and good burned into its walls. Big things had happened in the new stadium already, but this was the first so purely joyous that it spilled beyond the bowl and across the whole country.\nWhen White played there for the first time, the pitch felt huge. The more she played on it, the smaller it felt.\n“We’re getting used to it a little bit more, but you just…” White tries to find the words again. “You can’t get used to it. Because it’s Wembley.” ○",
  "word_count": 5316,
  "scraped_at": "2026-02-14T12:55:13.022610"
}