{
  "article_id": "402e11ad6581",
  "url": "https://www.leitrimobserver.ie/news/mohill/1824852/go-for-it-leitrim-and-ireland-star-urges-as-she-graduates-with-her-medical-degree.html",
  "title": "  Go for it ! Leitrim and Ireland star urges as she graduates with her medical degree",
  "date": "20250613T101500Z",
  "domain": "leitrimobserver.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Dearbhaile Beirne from Mohill graduates from UL. Pic. Alan Place\nStar football player with Peamount United in Dublin and Leitrim GAA, Dearbhaile Beirne from Mohill, Co Leitrim, has spoken of how she was able to excel in sport while studying medicine during her time at UL.\nDearbhaile, who has represented the Republic of Ireland’s Women’s National Football team at youth and senior level, joined over 700 students being conferred this week as part of the University’s June ceremonies, graduating with a Bachelor of Medicine, Bachelor of Surgery degree from UL’s Faculty of Education and Health Sciences.\nDearbhaile might be a familiar face to many through her appearance on Ireland’s Fittest Family TV show in 2017, which she won with her dad and two brothers.\nIn 2018, she earned her first senior cap with the Republic of Ireland women’s national team in a 4-0 friendly defeat against Poland.\nDespite her success in sport, a career in medicine was always something Dearbhaile wanted to pursue. Speaking ahead of her graduation, the new UL graduate said: “My mum’s career as a nurse introduced me to the medical world from a young age, and I always knew I wanted to pursue a career working in healthcare and helping others.”\nREAD MORE: Leitrim family given an estimate of €150,000 for water connection to home, meeting told\nFollowing an undergraduate degree in Biomedical, Health and Life Sciences at UCD, Dearbhaile chose to continue her education at UL through the Bachelor of Medicine, Bachelor of Surgery Graduate Entry Medical Programme.\n“The first-class facilities for both study and sport, and knowing that I could study and train alongside like-minded people, drew me to UL.\n“The structure of the course really appealed to me in that the pre-clinical years are completed through problem-based learning. This allows you to take control of your own learning and gives you independence as a graduate entry student.”\nDearbhaile was awarded a UL Sports Scholarship, a programme designed to support top athletes in excelling in their sport while also pursuing their studies.\n“The scholarship provided me with a solid support circle of both staff and fellow athletes. It also provided financial support, which was much appreciated, along with access to the gym, pool and recovery rooms which were very important. It included on-campus accommodation during my pre-clinical years, which reduced travel time for me, and allowed me to focus on my studies and training.”\nHaving played high-level sports all her life, planning ahead and making timetables was the secret to balancing her involvement in sport and academic studies.\n“I incorporated my training into my schedule at all times as it provided a much needed outlet,” she explained.\n“I always found that managers and coaches in UL were very approachable and understanding of the demands of studying medicine and accommodated my needs,” she added.\nOne of Dearbhaile’s most memorable experiences during her time in UL was winning the O’Connor Cup, a Ladies’ Football intervarsity competition, in 2022.\n“It is something that had eluded me for the four years of my undergraduate degree in UCD, so to win it was special. I got to play alongside some of the top players in the country.”\nOn juggling being a dual-code player as well as being a medical student, Dearbhaile said:\n“I would not have been able to go back to college and study for another four years without having such a supportive family and group of friends.\n“I’m motivated by the drive to always better myself and improve no matter what I’m doing. Whether it’s a match or an exam, I always look towards the next one and try to identify areas where I can improve in my performance.”\nLooking ahead, Dearbhaile will be starting her medical internship in Dublin in July. “I’m unsure yet what branch of medicine I will specialise in, but confident that sport will continue to play an important part in my life no matter what I do.”\nDearbhaile is signed with Peamount United in Dublin for the current season, with whom she has won three Women’s National League titles and has played in the Champions League qualifiers three times. She is also still playing Gaelic football with the Leitrim Ladies senior team.\nReflecting on her time at UL, what advice would Dearbhaile give students considering undertaking graduate studies in medicine? “Go for it! Four years seems like a long time to commit to studying when you have already completed a degree, but it absolutely flew by for me. I think an important part of that was because I was studying in UL and I enjoyed it and the environment so much.”\nREAD MORE: IPAS relocation row as family in Leitrim fights to let child finish school term\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nSubscribe or register today to discover more from DonegalLive.ie\nBuy the e-paper of the Donegal Democrat, Donegal People's Press, Donegal Post and Inish Times here for instant access to Donegal's premier news titles.\nKeep up with the latest news from Donegal with our daily newsletter featuring the most important stories of the day delivered to your inbox every evening at 5pm.",
  "word_count": 901,
  "scraped_at": "2026-02-14T12:35:09.428959"
}