{
  "article_id": "4031025a4da6",
  "url": "https://www.dailymail.co.uk/news/article-11850223/Match-Day-2-reduced-Gary-Lineker-row-deepens.html",
  "title": "Match of the Day 2 will be  much reduced  as Gary Lineker row deepens",
  "date": "20230312T113000Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Staying silent for once! Gary Lineker refuses to comment as he breaks cover for first time since Match of the Day aired without him - as BBC chaos continues with coverage of WSL game disrupted and MOTD2 set to go ahead with no presenter or pundits\n- The former England footballer was seen taking his dog for a walk on London\n- The normally outspoken presenter said 'I can't say anything' to reporters\nGary Lineker has broken cover for the first time since Match of the Day aired without him, as the BBC's sports schedule continues in chaos, with MOTD2 set to be 'much reduced' tonight after being hit by pundit and presenter walkouts.\nThe TV presenter was in a less talkative mood than usual this morning, announcing 'I can't say anything' to questions from reporters when he left his home in Barnes, south-west London, to walk his dog this morning.\nHe was asked 'do you still want to work for the BBC?', 'have you spoken to Tim Davie overnight?', 'have you had discussions with BT or Sky?' and 'is this the end of your presenting career?', but provided no response.\nHe was dressed in blue jeans, a blue zipped jumper and walking boots, and left for a nearby park, as the row over comments he made about the Government's anti-illegal immigration bill, continues to swirl.\nHis appearance comes after he was take off presenting duties for last night's MOTD, with the show being severely curtailed to 20 minutes, with no analysis or commentary as pundits and play-by-play announcers refused to appear in solidarity with him.\nGary Lineker was seen leaving his house in south west London this morning for the first time after Match of the Day aired without him\nLineker announced 'I can't say anything' to the gaggle of reporters and photographers who had gathered outside his house\nThe Beeb's director-general, Tim Davie, has apologised for the disruption to the schedules, but has stood firm amid calls for him to resign from some within the organisation.\nAnd with Lineker's eldest son saying his father would never back down or apologise for his beliefs, the row looks set to drag on for a second day and potentially even longer.\nSports fans looking to watch football coverage on the licence payer-funded channel today will see their plans hit, according to the corporation's sports editor Dan Roan.\nHe tweeted: 'At this stage BBC expecting the planned WSL match between Chelsea and Manchester United this afternoon to be on BBC2, but with no pre-match presentation. Expecting MOTD2 to follow similar much-reduced format to MOTD last night.'\nThe Women's Super League match was broadcast as scheduled on BBC1, but there was no pre-match or half-time coverage, and the commentary was taken from the WSL's world feed rather than using the Beeb's in-house audio team.\nAnd tonight's MOTD2 is also set to be hit, with host Mark Chapman and pundit Jermaine Defoe both refusing to take par.\nDefoe tweeted: 'It's always such a privilege to work with BBC MOTD. But tomorrow I have taken the decision to stand down from my punditry duties.'\nCommentators for the show have also walked out, with veteran mic-man Guy Mowbray tweeting: 'As yesterday, there will be no \"normal\" MOTD(2) programme tonight. The scheduled commentary team are in full agreement with our BBC Sport colleagues. We hope that a resolution can be found ASAP.'\nHowever, there was no such disruption during the channel's coverage of the Six Nations, with Gabby Logan anchoring today's match between Scotland and Ireland as scheduled.\nBefore match commentary from its two scheduled Premier League games this afternoon started on Radio 5 Live, commentator Alistair Bruce-Ball said: 'I want to reiterate what we said ahead of our football coverage yesterday.\n'I know you'll all appreciate this is a difficult time for BBC Sport and for all those who work in the department, and we hope it all gets resolved as soon as possible.\n'It's been a very difficult decision to make personally, I can assure you it's not been taken lightly, but I'm a BBC staff member, I'm a radio commentator for this station and, just like yesterday, we are here to provide our football service to you, our audience.'\nLineker was forced off air this weekend over a tweet in which he compared the government's latest stance on migrants to the language used in 1930s Germany.\nThe latest policy, which would see desperate people who cross on small boats banned from applying to reach the UK for life, has been widely condemned by human rights groups, with claims it could breach international law.\nThe BBC has strict impartiality rules for employees and freelance staff, including on social media, which new Director General Tim Davie is understood to have clamped down on.\nBut Lineker's two-year contract was signed before Davie came to the helm, leaving the corporation unable to force him to comply with tougher standards, the Independent reports.\nThe BBC took Gary Lineker (pictured) off air after he criticised the Government's small boats policy last week\nMark Chapman (pictured), who presents MOTD2 is reported to have refused to take part in tonight's show\nPro-refugee supporters gather outside the BBC Sport studios in Salford's Media City in protest at Lineker's suspension\nLineker, pictured here with his son, celebrates a disallowed Chelsea goal as he watches his team Leicester City yesterday\nWhen asked whether he would resign over the chaos, Davie apologised for disruption but refused to step down.\nIt comes after it was revealed BBC staff are fuming at how slowly the broadcaster is responding to the crisis, with its flagship sports show in tatters last night.\nOne BBC journalist said: 'This is Armageddon - essentially an entire division of the BBC has gone on strike.'\nSporting heavyweights have already walked away from football programming across the BBC, but it is now reported that other sports staff members could follow suit.\nFormer BBC executive Peter Salmon, who was previously controller of BBC One and director of sport, told Sunday with Laura Kuenssberg the situation was 'complex' and Lineker is a 'major figure'.\nHe added: 'Twenty-five years in Match Of The Day - he's more than just a TV presenter, he's a national figure.\n'He's got views, he's got passions, he's been involved in looking after Ukrainian refugees. It may be that Gary's outgrown the job and the role in the BBC.\n'Twenty-five years in, before that Des Lynam, Gary took over, he's been brilliant. Sometimes there's a point at which you cross the line.'\nReflecting on the disruption to the BBC's sports schedule, he added: 'It's a mess, isn't it?\n'They must be wishing they could reel back 72 hours and start all over again. It's Oscars day but there's no awards for how this has been managed.\n'I think they've got to take action pretty quickly. It doesn't help the chairman of the BBC himself is slacked to one side in this process and there's a bit of an issue.\n'Tim Davie is isolated in some ways, he needs to come home and grip this now. We need him back running the ship.'\nThis morning Chancellor Jeremy Hunt said 'people's confidence' should be restored in knowing the BBC has no 'political agenda' when he was asked about the Gary Lineker row.\nHe told Sky News' Sophy Ridge on Sunday programme: 'I don't agree with his comments and I personally think that he was wrong to say what he said, but I don't think it's for me to decide how that issue is resolved.'\n'If you believe in BBC independence, then it's not for the chancellor or any other government minister to say how these issues are resolved.'\nFormer Tory chancellor George Osborne backed Gary Lineker, criticising the rhetoric around asylum policy by some in his party.\n'Personally I think some of the language used on immigration by some Conservatives - not all - is not acceptable,' he told Channel 4's The Andrew Neil Show.\n'I have a lot of sympathy for Tim Davie, the director-general, who's trying to maintain impartiality for the BBC in a partisan age. But it's all ended up in a bit of a mess.'\nIt appears Gabby Logan (pictured during the BBC's Six Nations coverage in February) and her Six Nations coverage team may scupper the BBC's coverage of the tournament with yet more walkouts\nThere are already doubts about whether coverage of the WSL crunch match between Chelsea and Manchester United will go ahead. Pictured: Alessia Russo and Mary Earps of Manchester United Women's team\nAsked whether the corporation's leadership is too close to the party of Government, Mr Hunt said it was not for him 'to make those judgments'.\nAhead of last night's MOTD starting, a continuity announcer said: 'Now on BBC One, we're sorry that we're unable to show our normal Match Of The Day including commentary tonight. But here now is the best action from today's Premier League matches.'\nMatch Of The Day lasted just 20 minutes following a day of chaos for the BBC as big-name stars walked out in protest alongside host Gary Lineker, leaving the broadcaster having to cancel most of its football coverage.\nIt was rebranded as 'Premier League Highlights' during its broadcast on Saturday evening.\nAfter the shortened version of the usually two-to-three-hour-long programme, the BBC aired Sully, a film about the Hudson River plane crash.\nThe BBC's Director-General refused to resign over the chaos caused after Gary Lineker was axed from Match Of The Day and said the football host is 'the best' and he wants him 'back on air'.\nTim Davie apologised for the scheduling mayhem but said the corporation was 'working very hard to resolve this situation' and he would 'absolutely not' resign.\nDavie told the BBC's Nomia Iqbal: 'I'm sorry audiences have been affected and they haven't got the programming'\nMatch of the Day lasted just 20 minutes last night with no Gary Lineker, no commentary and no pundits\nDavie told the BBC: 'Gary Lineker is a superb broadcaster. He's the best in the business. He's an outstanding, brilliant broadcaster and success for me is that Gary gets back on air.'\nAsked whether he should resign, Davie said: 'Absolutely not. I think my job is to serve licence fee payers and deliver a BBC that is really focused on world class, impartial, landmark output.'\nHe added: 'I'm sorry audiences have been affected and they haven't got the programming.\n'As a keen sports fan I know to miss programming is a real blow and I'm sorry about that. We are working very hard to resolve this situation and make sure we get output on air.\n'Everyone wants to calmly resolve the situation. Gary Lineker's the best in the business - that's not for debate.'\nMr Davie also said that he does not feel this is about 'left or right' politics, but about the corporation's ability to balance free speech and impartiality, adding: 'We're fierce champions of democratic debate, free speech, but with that comes the need to create an impartial organisation.'\nHe was backed by former director-general Mark Thompson, who said he 'absolutely hopes' Davie will survive the ongoing row and that Lineker had 'on the face of it' committed a 'technical breach' of the BBC's social media rules.\nThese state those working for the BBC outside of its news and factual departments still have an 'additional responsibility' given their profile.\nHe added: 'I think we have also got our old friend the grey area here. In other words, no-one thinks this is the same as you or Huw Edwards doing it. This is not like a news presenter basically tearing up the impartiality principles inside the news machine.'\nPressed on whether BBC chairman Richard Sharp, who has faced growing calls to resign over the cronyism row caused by him helping Boris Johnson secure an £800,000 loan facility, should temporarily step aside until the issue is resolved, Mr Thompson said: 'Gary Lineker is an active broadcaster for the BBC. Richard Sharp is part of the governing body which doesn't take decisions in real time about actual editorial matters.'\nHe said 'the most sensible thing again is just calm down, ignore the papers and let the person who is doing the inquiry complete their inquiry' instead of making decisions 'on the fly'.\nAsked whether he thought Lineker would be back on air tonight, he replied: 'I hope so.'\nLeicester fan Gary Lineker was at the King Power Stadium to watch his boyhood club host Chelsea. He cheered after Chelsea's goal was disallowed following a VAR review\nThe former England star was pictured taking selfies with fans after being taken off air by BBC bosses\nLineker took photos with two kids prior to Leicester's match against Chelsea at the King Power\nLeicester City fans held up signs in support of Lineker in the stands before the match at the King Power Stadium\nBut on Saturday Lineker's son George said while his father may return to the flagship football programme, he would not apologise.\nSpeaking to the Mirror, George, 31, said although his father had been 'hurt' by some of the reaction to his 'Nazi' jibe tweet against the government's asylum policy, he 'wouldn't back down'.\nHe told the Mirror: 'Will he go back to Match of the Day? I think so - he loves Match of the Day. But he won't ever back down on his word.'\nHe added: 'Dad is a good human and I'm proud of him for standing by his word.\n'That's why he was pulled off the show - because he wouldn't apologise.'\nGeorge said his father would always speak for people without a voice and that refugee welfare was important to him.\nToday he tweeted: 'Proud of the old man after a busy few days.\n'The reaction of the public has been overwhelming. Thanks for the support.'\nFormer England footballer John Barnes has hit out at the corporation, saying it wants to 'pick and choose' when its presenters can be impartial.\nSpeaking to Sky's Sophy Ridge on Sunday, Mr Barnes said: 'I don't know when the BBC has ever been impartial but BBC reporting on the World Cup was anything but impartial.\n'So, it seems that they want to pick and choose when they want to be partial, criticising others or criticising other countries or other political parties or other religions seems to be okay.\n'But, of course, if you then criticise what goes on in this country, then it seems that they will then come up with the impartiality rule.'\nFormer England footballer John Barnes (pictured) has hit out at the corporation, saying it wants to 'pick and choose' when its presenters can be impartial\nSwansea City fans also held up a sign in support of the Match of the Day presenter during the Championship side's clash with Middlesbrough\nOn Saturday, Football Focus and Final Score were hurriedly replaced by old episodes of Bargain Hunt and The Repair Shop after hosts Alex Scott, Kelly Somers, and Jason Mohammad all refused to take to the airwaves in solidarity with the former England star.\nFootball Focus host Alex Scott Tweeted that broadcasting the show 'just doesn't feel right.'\nShe wrote: 'I made a decision last night that even though I love doing football focus and we have had an incredible week winning an SJA award that it just doesn't feel right going ahead with the show today. Hopefully I will be back in the chair next week...'\nBBC Radio 5 Live's schedule was also hit after football presenter Mark Chapman pulled out of broadcasting alongside Colin Murray, and pundit Dion Dublin, forcing the replacement of 5 Live Sport and Fighting Talk with old podcast episodes.\nJermain Defoe, who was due to appear on Match of the Day 2 today, also tweeted: 'It's always such a privilege to work with BBC MOTD. But tomorrow I have taken the decision to stand down from my punditry duties. @GaryLineker.'\nIn a statement, a BBC spokesperson said: 'The BBC will only be able to bring limited sport programming this weekend and our schedules will be updated to reflect that.\n'We are sorry for these changes which we recognise will be disappointing for BBC sport fans.\n'We are working hard to resolve the situation and hope to do so soon.'\nTo add to the turmoil, Ian Wright – who refused to appear on TV on Saturday – said: 'If the BBC get rid of Gary Lineker, I'm out, I'm gone.'\nIt came as a YouGov snap poll revealed a majority (53 per cent) of the British public think the BBC was wrong to suspend Gary Lineker from Match of the Day following his comments on social media about the government's asylum policy.\nThe data finds that just over a quarter (27 per cent) think the broadcaster was right to suspend him and a fifth (20 per cent) don't know.\nLabour (75 per cent) and Liberal Democrat (73 per cent) voters are most likely to think the BBC made the wrong decision compared to just over a third (36 per cent) of Conservatives.\nIn comparison, half (51 per cent) of Tory voters believe the broadcaster made the right decision along with 10 per cent of Labour voters and 14 per cent of Liberal Democrats.\nLineker was spotted in the director's box as he watched Leicester fall to a 3-1 defeat to Chelsea at the King Power Stadium\nSeeing red: Leicester City's Wout Faes was shown a red card by referee Andre Marriner during the defeat\nInstead of presenting MOTD, Lineker watched Leicester lose 3-1 to Chelsea on Saturday and was pictured taking photos with fans before the game.\nThe beloved MOTD host has been backed by his fellow presenters and sports stars.\nSpeaking after his side's 1-0 loss to Bournemouth, Liverpool manager Jurgen Klopp said: 'I'm not native but I cannot see why you would ask someone to step back for saying that.\n'Everybody wants to be so concerned about doing things in the right manner, saying the right stuff.\n'If you don't do that then you create a s***storm, it is a really difficult world to live in.\n'If I understand it right, it is a message, an opinion about human rights and that should be possible to say.'\nLineker's England teammate at two world cups John Barnes accused the BBC of 'playing into' the government's hands by making the story about their chaotic actions rather than the controversial immigration bill.\nWriting in The Mirror, he said: 'The Tories are quite happy for this distraction.\n'Gary is a football legend to so many. Most people are supporting him because he's right.'\nA leaked email sent to BBC staff has also surfaced on social media showing the Director of Sport Barbara Slater apologising to her team for the continuous chaos which has unravelled at the broadcaster this afternoon.\nShe thanked staff for their hard work and professionalism despite many boycotting their responsibilities this afternoon in solidarity with Lineker.\nSlater said that the BBC 'understood how unsettling this is for all of you'.\nThe BBC has reportedly told staff there will be a series of meetings on Monday so they can 'have their say' about the fiasco.\nWith no need to prepare for MOTD tonight, Lineker was free to head to the King Power Stadium this afternoon for the 3pm match between Leicester and Chelsea\nJon Holmes (right), agent of Gary Lineker arrives at the stadium prior to the Premier League match between Leicester City and Chelsea at the King Power Stadium this afternoon\nGary Lineker was seen outside his London home this morning after fellow presenters and walked out of today's BBC's football coverage in a show of solidarity\nConfusion over what the BBC's impartiality guidelines actually mean are thought to have been partly to blame for the chaos that has ensued since Lineker made his 'Nazi' jibe.\nBBC neutrality has come under recent scrutiny over revelations that its chairman, Richard Sharp - a Conservative Party donor - helped arrange a loan for then Prime Minister Boris Johnson in 2021, weeks before Sharp was appointed to the BBC post on the government's recommendation.\nFormer BBC Director General Greg Dyke said the network 'undermined its own credibility' by appearing to bow to government pressure.\nKeir Starmer, leader of the main opposition Labour Party, said the BBC was 'caving in' to political pressure from Conservative lawmakers.\n'They got this one badly wrong and now they're very, very exposed,' he said.\nMOTD2 host Mark Chapman pulled out of Radio 5 Live Sport, while Alex Scott boycotted Football Focus\nFormer Tottenham Hotspur player Jermain Defoe said he would not appear on Match Of The Day 2 on Sunday evening\nDirector of Sport Barbara Slater apologised to her team for the chaos across the BBC this weekend\nFighting Talk presenter Colin Murray said he will not appear on Radio 5Live today\nKelly Somers Tweeted that she will not be appearing on the BBC on Saturday\nFinal Score presenter Jason Mohammad said he has informed the BBC that he will not be presenting on BBC One on Saturday\nBut the BBC's issue may extend beyond their own employees, with Jurgen Klopp leading a managers and players boycott of the broadcaster this weekend.\nThe Premier League agreed to let players and managers from the 12 clubs playing on Saturday avoid giving interviews to the programme.\nA PFA spokesperson said on the decision: 'We have been informed that players involved in today's games will not be asked to participate in interviews with Match of the Day.\n'The PFA have been speaking to members who wanted to take a collective position and to be able to show their support for those who have chosen not to be part of tonight's programme.\n'During those conversations we made clear that, as their union, we would support all members who might face consequences for choosing not to complete their broadcast commitments.\n'This is a common sense decision that ensures players won't now be put in that position.'\nMost watched News videos\n- Extraordinary moment mass brawl breaks out between Brits on flight\n- Finance expert's TV interview interrupted by adorable granddaughter\n- Moment driver veers to target e-bike riders before killing teen\n- Moment Swiss bar fire owners collapse after being confronted\n- Astonishing moment a street is swallowed by a sinkhole\n- Chilling police interview of ISIS fanatic plotting UK attack\n- Food vlogger dies after 'eating toxic devil crab'\n- Spy cam shows woman on her knees next to Jeffrey Epstein\n- Deepak Chopra confronted over his relationship to Epstein\n- Toddler opens car door in traffic and sends biker flying\n- New video shows man with backpack similar to Guthrie kidnapper\n- Israeli hostage reveals how she survived being tortured",
  "word_count": 3799,
  "scraped_at": "2026-02-14T12:21:27.244920"
}