{
  "article_id": "40a1429b703d",
  "url": "https://eurweb.com/2023/super-bowl-lvii-heres-why-eagles-vs-chiefs-will-be-a-historic-occasion-watch/",
  "title": "Super Bowl LVII : Why Eagles vs . Chiefs Will be A Historic Occasion",
  "date": "20230211T213000Z",
  "domain": "eurweb.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "*(CNN) — The countdown to this year’s Super Bowl between the Kansas City Chiefs and the Philadelphia Eagles is underway — and aside from it being the biggest sporting event in the United States, it will also be a championship of firsts.\nBlack players — and coaches — will make history\nSunday’s game will be one for the record books, as it will be the first in Super Bowl history to feature two Black starting quarterbacks, with Patrick Mahomes and Jalen Hurts facing off to lead their teams to glory.\nBlack quarterbacks have featured and won the Super Bowl in the past but never have they started for each squad in the same game.\nMahomes became the third Black quarterback to win the Super Bowl in 2020. He could now become the first Black quarterback in NFL history to win multiple Super Bowls. Meanwhile, Eagles quarterback Hurts could become the fourth Black quarterback to win the Lombardi Trophy if Philadelphia gets the better of the Chiefs on Sunday.\n“It’s special,” Mahomes said ahead of the game. “I’ve learned more and more about the history of the Black quarterback since I’ve been in this league,” the 27-year-old told reporters.\nMORE NEWS ON EURWEB: The Super Bowl Celebration is ‘Soulful’ This Year & Features Patti LaBelle, Israel Houghton, NFL Players Choir & More!\n“The guys that came before me and Jalen set the stage for this, and now I’m just glad we can set the stage for kids that are coming up now.\nMahomes added: “It’ll be a great game against two great teams and against another great quarterback. I’m excited to go out there and do what we can against a great team.”\n“I think it’s history,” Hurts said. “I think it’s something that’s worthy of being noted and it is history. It’s come a long way. I think it’s only been seven African-American quarterbacks to play in the Super Bowl, so to be the first for something is pretty cool. I know it will be a good one.”\nhttps://youtu.be/cGfBlT9xuJM\nThis is a sentiment shared by Doug Williams, the first Black quarterback to start and win the Super Bowl in 1988.\n“I had tears of joy in my eye because I had an opportunity to witness this,” Williams told TMZ. “Sit there, and just look at it, and say to myself, ‘Man, we got two Black quarterbacks playing in the Super Bowl,'” he said, adding that he had similar feelings when Obama won the 2008 Presidential Election.\nMeanwhile, Eagles assistant coach Autumn Lockwood will be the first Black woman to coach in a Super Bowl, and the fourth woman to do so.\n“This is hugely important for a lot of people, especially Black people and women who were still not represented fully in the coaching ranks in the management ranks of the NFL,” NFL Network’s Chief National Reporter Steve Wyche told CNN Sport.\nA tale of two brothers\nThis year, in a rivalry so poignant it could be fiction, brothers Travis and Jason Kelce will face each other when the Chiefs and the Eagles meet at State Farm Stadium in Glendale, Arizona, on February 12. It is the first time in NFL history that two brothers play against each other in a Super Bowl.\nBoth Chiefs tight end Travis and Eagles center Jason have had remarkably similar careers so far — both attended Cleveland Heights High School and the University of Cincinnati, both have only played for just one team, and both have already won the Super Bowl — Travis with the Chiefs in 2019 and Jason with the Eagles in 2017.\nThe outcome of this game will surely give one brother major bragging rights.\nHowever, the siblings won’t actually take to the field at the same time as they both play on offense — Jason is an All-Pro center and Travis is an All-Pro tight end — but it’s still sure to be fiercely competitive.\n“It’s kind of great to see, these guys facing off, they’re clearly very tight. They do a podcast together, they went to the same university to play before getting to the NFL,” Wyche explained.\n“You know, their teams will be squaring up against each other, they won’t be going head to head, but to some degree, this is like Venus and Serena Williams playing against each other,” he added.\nWyche added that this game is bound to be special for the brothers, and especially for Jason Kelce, who is contemplating retirement.\n“This might be his last game he ever plays, because of his age, he’s contemplating retirement before, to play against his brother in the ultimate game going in has to feel special.\n“The tough part is when all is said and done, one of them is going to be very heartbroken. While the other one is going to be very ecstatic.\n“A month from now, they’ll be telling jokes about everything else. But in the immediate aftermath, there’s going to be a mixed bag of emotions,” he added.\nThe mother of all games\nJason and Travis’ encounter won’t just put the men in the firsts category — their mom, Donna will officially become the first mother to have two sons play against each other in the Super Bowl, according to the Pro Football Hall of Fame.\n“They’ve already got the first win under their belts, so this is just going to be pure joy. We’re going to really enjoy this, have a great time,” she told the Today Show.\n“Obviously, there’s going to be somebody that’s going to go home heartbroken. They won’t have the bragging rights at the Thanksgiving table, but this is going to be an awesome event and I’m really looking forward to it.”\nOf course, another Super Bowl win would be nice for Jason — but if it were to happen, it might not be the best thing to happen to him this month.\nHis wife, Kylie, is pregnant — and will be 38 weeks pregnant at the game, he said on his podcast, adding that her doctor will be traveling with her to the game, just in case.\nPregnancy is considered full-term at 39 weeks, according to the National Institute of Child Health and Human Development.\n“If she has the baby in the stadium, it’s officially scripted,” he said in conversation with his brother on his New Heights podcast.\nHowever, having a baby on the day of the Super Bowl would not be a first. Last year, while celebrating winning the Lombardi trophy on the field, Los Angeles Rams’ wide receiver Van Jefferson found out his wife was in labor.\n“I was just overcome with so much joy, from just winning the Super Bowl to finding out my wife was going to have our son,” he told CNN at the time, adding that his wife attended as much of the game as possible until leaving “until she couldn’t anymore.”\nAsides from these firsts, Wyche added that this weekend’s game is sure to be a spectacle.\n“The Philadelphia Eagles spent this offseason gathering all of these really good players through trade and free agency. Whereas the Chiefs, they got rid of a couple of their best players in Tyrann Mathieu and Tyreek Hill and replaced them with young players who got their team back to a Super Bowl. It’s just going to be such a fantastic game.”\nThe-CNN-Wire\n™ & © 2023 Cable News Network, Inc., a Warner Bros. Discovery Company. All rights reserved.",
  "word_count": 1244,
  "scraped_at": "2026-02-14T13:34:07.122078"
}