{
  "article_id": "40cd1c118ce3",
  "url": "https://www.bangkokpost.com/opinion/opinion/3151588/sea-games-pose-new-test-for-govt",
  "title": "Bangkok Post - SEA Games pose new test for govt",
  "date": "20251207T023000Z",
  "domain": "bangkokpost.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "All eyes are turning to the 33rd Southeast Asian Games, which officially kick off this Tuesday. Regrettably, the focus is not on the love of the game or our national athletes.\nAs the clock ticks down, complaints of mismanagement and glitches have multiplied online and captured media attention.\nThe grievances span a wide range of issues. Design enthusiasts have criticised organisers for altering the previously approved SEA Games logo. Netizens have pointed to the inconsistent appearance of banners -- in Nakhon Pathom, the faces of politicians appear on them. Event organisers and suppliers complain of last-minute contractual changes, while sub-contractors say they have not been paid.\nVoices of discontent have also emerged from the stadiums. Sports reporters covering matches have complained about the lack of shuttle buses to take them from the central news centre to the venues.\nOrganisers made an embarrassing mistake by placing national flags incorrectly. At the Laos–Vietnam football match on Dec 3, a loudspeaker malfunction forced players to sing their national anthems, while uneven lighting at the venue drew complaints from staff and fans alike.\nThe complaints and criticism have grown so loud and negative that on Friday the Sports Authority of Thailand (SAT) issued an unprecedented warning: it may file defamation charges against those accused of making false allegations about the event. SAT, long experienced in hosting major sports competitions, has never before resorted to such measures.\nThe big question is: what went wrong? SAT governor Gongsak Yodmanee has blamed budget shortages. He told a press conference that Thailand received just over two billion baht -- far lower than the three billion baht Cambodia reportedly spent on the 32nd Games.\nWith flooding in the South forcing matches in Songkhla to be relocated to Bangkok and Pattaya, he admitted the budget strain will worsen. He also said frequent government changes had disrupted preparations.\nSuch shortcomings in preparation are unacceptable. Thailand has an excellent track record in hosting far larger sporting events, such as the Asian Games and major international competitions.\nThailand has hosted the Asian Games four times -- more than China and South Korea, which have held three editions each. In fact, on two occasions Thailand stepped in after other appointed hosts withdrew, demonstrating the country's management capacity and resources. For the 1998 Asian Games, Thailand received widespread praise from visiting teams, while local spectators lauded both the opening and closing ceremonies.\nThis year, SAT, which is also organising the SEA Games, won praise for its hosting of the FIVB Volleyball Women's World Championship in August.\nThe 33rd SEA Games are a test of the Anutin administration's managerial capability.\nLast week, Prime Minister Anutin Charnvirakul appointed Agriculture Minister Capt Thamanat Prompow to oversee the SEA Games. This raises questions about whether he is the right man for the job -- and whether he can devote sufficient attention, given his concurrent responsibility for national flood management. Tourism and Sports Minister Atthakorn Sirilatthayakorn, a close ally of Capt Thamanat, has been criticised for lacking experience.\nCapt Thamanat has asked the public to reserve judgment and wait for Tuesday's opening ceremony. But a larger question remains: what -- and who -- will be held accountable if the Games fail to meet expectations?\nBeyond the complaints, there are reports involving Tourism Minister Atthakorn concerning contractual cancellations with a concessionaire. These accusations must be clarified to determine what actually transpired. Once the Games conclude later this month, lawmakers in parliament must investigate any irregularities. Without scrutiny, political interference in major sporting events will only grow.\nHigh-profile regional competitions like the SEA Games require professional, experienced management -- possible only with policy continuity and adequate government support. Political meddling, by contrast, breeds confusion and mismanagement. One can only hope the Anutin administration can still salvage the country's reputation and deliver a 33rd SEA Games that Thais can be proud of.",
  "word_count": 639,
  "scraped_at": "2026-02-14T14:20:22.784906"
}