{
  "article_id": "4129eef06f0b",
  "url": "https://www.joe.co.uk/news/fans-call-for-england-to-hire-sarina-wiegman-to-replace-gareth-southgate-448458",
  "title": "Fans call for England to hire Sarina Wiegman to replace Gareth Southgate",
  "date": "20240716T190000Z",
  "domain": "joe.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "News\nShare\n16th July 2024\n03:00pm BST\nFans are calling for Sarina Wiegman to replace Gareth Southgate as the next manager of England Men’s National team.\nGareth Southgate resigned earlier today after back-to-back defeat in Euros finals.\nA shortlist has emerged with the likes of Graham Potter and Eddie Howe favourites to take over from the 53-year-old.\nSeveral surprising names have also made the list including former Chelsea boss Thomas Tuchel who helped the London side lift the Champions League trophy in 2021.\nJurgen Klopp and Pep Guardiola have also made the list whilst former Spurs manager Mauricio Pochettino has privately expressed his interest in becoming the next England boss.\nHowever, one name has been brought up by several fans and quickly started trending on X, Lionesses boss Sarina Wiegman.\nThe Dutch manager led England Women to European glory in 2022 and reached the World Cup final with them last year which they lost to Spain.\nBefore that, she won the Euros with the Netherlands and took them to a World Cup final.\nOne X user said: “Two-time European Champion and two-time World Cup finalist Sarina Wiegman is most qualified to replace Southgate and I won’t be told otherwise!”\nOne user retorted: “The level of football in both tournaments was akin to an under 15 boys tournament.”\nBut plenty agreed with original poster saying: “Sarina Wiegman should replace him, proven record.”\nAnother said: “There are three managers who have coached an England national team to success at tournament football. Perhaps the FA should appoint one from Steve Cooper, Lee Carsley or Sarina Wiegman.”\nThere are three managers who have coached an England national team to success at tournament football. Perhaps the FA should appoint one from Steve Cooper, Lee Carsley or Sarina Wiegman.\n— Robbietintin (@Robbietintin) July 16, 2024\nIf Sarina Wiegman was to take the job, she would become the first female manager in the men’s game. One fan pointed out what a good look that would be for the FA.\n“What a statement the FA could make by appointing Sarina Wiegman as the next England manager?! Media-savvy, technically aware and already a major winner with the Lionesses. Not sure any others on the short list are as qualified?”\nOne fan was not happy that that decision would leave the Lionesses searching for a new manager though, saying: “Stop trying to steal the women’s England manager Sarina Wiegman and her coaches.”\nThe Lionesses are in action tonight against Sweden and a point will see them qualify to defend their European title next year.\nExplore more on these topics:",
  "word_count": 429,
  "scraped_at": "2026-02-14T13:05:15.568739"
}