{
  "article_id": "412ca913642c",
  "url": "https://www.dw.com/en/world-cup-fallout-where-did-germany-go-wrong/a-66446712",
  "title": "World Cup fallout : Where did Germany go wrong ? – DW – 08 / 05 / 2023",
  "date": "20230805T080000Z",
  "domain": "dw.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "World Cup fallout: Where did Germany go wrong?\nAugust 6, 2023Germany's exit from the World Cup has been labeled a \"disaster\" after high hopes of winning the tournament. The team now has a brutal road ahead of them to find answers.\nIt was supposed to be so easy. Just take care of Morocco, fight it out with Colombia, and finish the job against Korea. Then hurry into the knockouts ready for the real business.\nIt was a group that looked straightforward on paper; Germany had bigger fish to fry.\nHowever, as the whistle finally sounded at Lang Park in Brisbane, following 16 minutes of stoppage time, Germany's World Cup dream was prematurely over. A first-ever group-stage exit in the tournament. A historic failure.\nGermany expected an easy ride. They may not have let on as much, largely keeping to the media-trained script of one game at a time, but they had declared clear ambitions to win this tournament.\nGermany's talent, funding and history entitled them to such ambitions, yet it also left them with an air of entitlement.\nThey reportedly hadn't even initially drawn up travel plans for finishing second in their group and had pushed for FIFA to secure their base camp near Sydney for the entire tournament. Only after the loss to Colombia did they draw up a contingency plan, when a potential quarterfinal in Brisbane (instead of Sydney) became likely.\nGerman FA president Bernd Neuendorf hadn't even bothered to come watch the group stage; he was due to arrive in Australia just before the round of 16 started.\nThose plans already suggest a certain haughtiness from the DFB and it also appeared to spread throughout the entire camp.\nArrogance crept into the camp\nThe players are a likeable bunch. They're down-to-earth, humble, socially aware, conscientious and thoughtful. Martina Voss-Tecklenburg, too, is a bubbly personality; patient with the media, loyal to her players and armed with a sharp sense of humour.\nYet there can be no question that arrogance preceded their group stage preparation. They were ranked second in the world, they were European finalists, they were born for this moment, apparently destined for success.\nWhen asked about the atmosphere, the preparation, the training intensity, everyone pulled the company line. Everything was rosy, the performances would flow.\nInstead, after a 6-0 drubbing of Morocco had papered over existing cracks, they were dismantled by Colombia 2-1 and left toothless in a 1-1 draw with South Korea.\nThis wasn't the script they had promised, but it was the one they ultimately deserved.\nTactical flaws and square pegs\nThat the players underperformed is glaringly obvious. Too many weren't at their best, with only Popp, Svenja Huth and Merle Frohms truly putting in consistent performances.\nThe midfield struggled to exert the dominance they desired, there was a disconnect with the attacking line, and the defense fell apart bit by bit.\n\"As players we have to question ourselves first,\" captain Alex Popp said the day after the elimination.\n\"We have to critically question whether we've done everything. In the end, we're the players who are on the pitch and who should decide everything.\"\nTactics have to be questioned, however, and much has been made of Martina Voss-Tecklenburg's tendency to play attacking players as fullbacks. She only took one natural fullback, Felicitas Rauch, to Australia after injuries to Giulia Gwinn and Caroline Simon.\nWhen Rauch went down injured, Germany's defense was left with attacking midfielder Chantal Hagal on the left and forward Svenja Huth on the right.\nThe imbalance was stark against Korea, which coach Colin Bell, a former fullback himself, targeted.\n\"They haven't got the schooling of fullbacks, so it was right to target those areas,\" he said. \"They're very good players, but they're not fullbacks.\"\nThe disjointed system wouldn't have held its own against the best in the world, and in the end didn't even pass muster against lowly opposition.\nBasics go out the window\nDFB sporting director Joti Chatzialexiou said Germany simply didn't do the basics right, pointing out duels, one-on-ones and decision-making under pressure.\n\"We simply didn't show enough in the tournament to be successful,\" he said.\nGermany wanted to dominate midfield, they wanted to play attractive football and create chances through neat passing exchanges. Instead they proved one-dimensional in their reliance on Popp's physical and aerial presence up front.\nUltimately, however, they struggled to deal with the pressure and were incapable of responding to unexpected tactics from their opponents.\nThey didn't envisage that Colombia would dare press so aggressively. They looked surprised when a Korean side with nothing to lose also took them on from the very first minute.\nIn the last eight years, Germany have won just one game (a 5-1 victory over Serbia in 2021) after going behind.\n\"It's a question of psychology,\" Voss-Tecklenburg said in response to DW's question about the unwanted record.\n\"Can players stick to a game concept, remain calm, stay precise? We have a big difference there. There are players who don't let anything drive them crazy and we also have players who aren't that far yet.\"\nThe squad had eight Wolfsburg players who competed in a Champions League final in May. There should have been enough experience to manage setbacks.\nComplacency bred from success\nDuring the training camp and the tournament, players and coach kept insisting that they were focused on their own game.\nWhen DW asked Popp if she knew how Morocco played about five days out from the opening fixture, she admitted opponent analysis was something done only two days prior.\nIt could be a tactic not to overload the players with information. But in the end, Germany didn't transfer their gameplan effectively onto the field and were also caught by surprise against their opponents.\nThe German FA have come out in full support of Voss-Tecklenburg. She's contracted until 2025, handed a new deal just three months out from the World Cup, and it appears she wants the responsibility to find answers to a disastrous month.\n\"I have never run away when life becomes difficult,\" she said. \"So I'm still determined to take the next steps in German women's football together with everyone.\"\nThe fallout is yet to truly start, after a few days back in Germany, the inquest will begin. Chatzialexiou admitted women's football may have \"rested on our laurels\" due to past success.\n\"We will discuss everything self-critically and then see how we can go about the future,\" he said.\nMissed opportunity to cash in\nThe euphoria from the Euros last year is gone, Germany have missed a huge chance to build on the popularity bubble that blew up after that stunning run to the final.\nPopp was in no mood to contemplate whether that bubble has now burst.\n\"I haven't really thought about it,\" Popp admitted. \"I hope people will continue to support us, that they have seen what we are capable of. You saw it last year. The development was so beautiful and immense and extremely important for the sport and I hope it stays that way.\"\nBeauty has given way to uncertainty. Germany's players looked lost as that final whistle sounded the end to their World Cup campaign. They were so confident, so assured, so determined.\nThey thought they had all the answers, but came unstuck on the biggest stage. They thought they had the goods in the bank for success, but found insufficient funds.\nEdited by: Michael Da Silva",
  "word_count": 1235,
  "scraped_at": "2026-02-14T13:43:59.741443"
}