{
  "article_id": "4134cd71eee4",
  "url": "https://www.themag.co.uk/2025/03/saudi-arabia-pif-renew-commitment-to-newcastle-united-five-year-plan-on-and-off-pitch/",
  "title": "Saudi Arabia PIF renew commitment to Newcastle United - Five year plan on and off pitch",
  "date": "20250312T151500Z",
  "domain": "themag.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Saudi Arabia PIF renew commitment to Newcastle United – Five year plan on and off pitch\nAn interesting media exclusive on Wednesday, stating that the Saudi Arabia PIF have renewed their commitment to Newcastle United and are willing to do everything they can to make the club successful, on and off the pitch.\nLate February saw Saudi Arabia PIF Governor Yasir Al Rumayyan and others fly into Newcastle to take in the win over Nottingham Forest.\nMore importantly, they were here to discuss the short and long-term future of the club, in terms of progressing things.\nAs well as budgets for this summer’s transfer window and beyond, top of the agenda was the stadium.\nSenior NUFC staff had been tasked by the Newcastle United owners to make feasibility studies on the possibilities of a brand new stadium, as well as alternatively a redeveloped St James’ Park.\nAs widely reported following these meetings at a Northumberland hotel, the senior staff recommending a brand new stadium to the owners. A planned capacity of just short of 70,000 and which would cost around £1.5billion.\nNo public announcement by the club as yet but it would be astonishing if the Newcastle United owners didn’t go with the brand new stadium option. Especially as the planned site would overlap slightly on the current SJP, starting where the Leazes end currently is, the part towards the Milburn stand, then going diagonally over what is currently the clubs multi storey car park and then taking in a small part of Leazes Park.\nToday’s exclusive from The Telegraph (see below) says that there will be a renewed push from the Saudi Arabia PIF/Newcastle United owners with a five year plan to make massive progress on and off the pitch.\nTo close the gap on the pitch and especially in financial terms off it, to help allow the team/club to compete on a more level footing.\nThe Telegraph report – 12 March 2025:\n‘Newcastle United are ready to launch ‘Project 2030’ as they move into the second phase of the club’s quest for growth under Saudi Arabia’s Public Investment Fund.\nAfter last month’s board meeting, led by chairman Yasir Al-Rumayyan, there will be a renewed push over the next five years to establish Newcastle as a powerful force in English and European football, with insiders labelling it ‘Project 2030’.\nRather than suggest PIF’s interest in Newcastle is waning, Al-Rumayyan insisted it remains committed to turning the club into one of the leading football operations and has challenged all department heads to deliver a plan to get there.\nSources have told Telegraph Sport the chairman was full of enthusiasm for the project and believes a five-year timescale is a realistic one to turn them into a club who compete for silverware every season, regularly play in the Champions League and eventually compete for the Premier League title. The ambition also extends to the women’s team with the aim to achieve promotion to the WSL.\nThe 2030 date is a loose deadline and is not cast in stone, but the intention is to continue to close the revenue gap on the traditional “Big Six” and strive to build a squad who are competitive in the latter stages of every competition they play in.\nHaving freed themselves of their constraints related to profit and sustainability rules (PSR) over the last 12 months with some difficult player sales, Newcastle are in a position to not only strengthen their squad, but also keep hold of their big-name players like in-demand striker Alexander Isak.\nSporting director Paul Mitchell is yet to sign a marquee player after replacing Dan Ashworth in July last year, as he has had to deal with the club’s PSR issue first. That meant moving on the likes of Miguel Almiron and Lloyd Kelly in January to give them more flexibility to spend in the next transfer window.\nBut an ambitious summer is being discussed which will see Newcastle strengthen their squad in every department.\nIn turn, Al-Rumayyan has also praised the job done by manager Eddie Howe and has once again reaffirmed that they see the 47-year-old as a long-term appointment and the man to help build the team into a trophy-winning side.’\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 716,
  "scraped_at": "2026-02-14T12:49:26.337206"
}