{
  "article_id": "4195a2f71ec7",
  "url": "https://www.bandt.com.au/no-pads-no-helmets-no-clue-is-the-nrls-vegas-gamble-really-paying-off/",
  "title": "No Pads , No Helmets , No Clue : Is the NRL Vegas Gamble Really Paying Off ? ",
  "date": "20250303T051500Z",
  "domain": "bandt.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Rugby league’s bold bid to captivate American sports fans delivered another spectacle in Las Vegas yesterday, as a blockbuster day of action at Allegiant Stadium saw the Canberra Raiders and Penrith Panthers kickstart the 2025 NRL season with emphatic victories.\nWith 45,209 spectators in attendance—up significantly from last year’s 31,927—the event showcased the speed, skill, and physicality of rugby league to a growing international audience.\nThe Raiders made a statement in the opening match, overpowering the New Zealand Warriors 30-8, with Seb Kris and Xavier Savage both scoring doubles. A clinical Penrith Panthers outfit then edged out the Cronulla Sharks 28-22 in a thrilling contest, sealed by a late Daine Laurie try to mark coach Ivan Cleary’s 55th birthday in style.\nThe expanded schedule also saw the English Super League debut in Vegas, with Wigan Warriors storming to a 38-24 win over Warrington Wolves. Meanwhile, the Australian Jillaroos delivered a ruthless 90-4 demolition of England in the women’s international, with Tarryn Aiken orchestrating a dominant attacking display.\nDespite the strong attendance figures, enthusiasm appeared to wane by the final game, with many spectators departing before the Panthers and Sharks took the field for what was billed as the main event. Still, the overwhelming reaction from American fans suggests rugby league might just be making inroads—however small—in a market long dominated by traditional US sports.\nWith NRL powerbrokers already eyeing an extended stay in Vegas beyond their current 2028 agreement, the league’s gamble in America is beginning to pay off. But as they look to entrench the sport in the hearts and minds of a new audience, the real challenge is just beginning.\nWhy Vegas and is it working?\nFor Australian Rugby League Commission chairman Peter V’landys, the vision is clear: establish rugby league as a global sport and secure a long-term foothold in the US. And financially, the numbers are stacking up. According to V’landys, the event has already generated a $100 million economic boost for Las Vegas, with nearly 17,000 Australians, 8,000 New Zealanders and 10,000 English fans making the trip.\nIn response, discussions are already underway to extend the NRL’s presence in the city beyond its current five-year deal, with Vegas officials reportedly keen to lock in the festival of footy for at least a decade.\nStill, for all the momentum, rugby league faces an uphill battle in America. The sport is competing against the entrenched dominance of the NFL, NBA, MLB and NHL, as well as the rising influence of soccer thanks to Lionel Messi’s impact on Major League Soccer. Attempts to gain traction with major US sporting figures have largely fallen flat—highlighting how little sway rugby league executives have on the global stage.\nYet, there are encouraging signs. NRL 360’s Phil Rothfield reported that ticket sales came from all 50 US states, with a reported 30,000 seats purchased by Americans—either curious locals or expats. But are these slightly disjointed figures this enough to justify the investment?\nDomestically, the Vegas venture offers the NRL a marketing coup, launching the season on its own terms, free from the immediate shadow of the AFL. Unlike past failed expansion efforts—such as rugby league’s struggles outside NSW and Queensland or the AFL’s ongoing battle to gain traction in Sydney’s west—this is about carving out a spectacle and growing interest in our game, rather than setting up a permanent US presence.\nFor now, V’landys is pushing forward, confident that by 2028, rugby league will have cemented itself in the American sporting landscape. But whether the Vegas gamble turns into a long-term jackpot or simply a flashy, short-lived novelty remains to be seen.\nWhile thousands of Aussie fans turned Las Vegas into a sea of NRL jerseys, the real test for the league’s American expansion was how US sports fans would react to rugby league’s high-impact spectacle.\nB&T was on the ground at Allegiant Stadium talking to US spectators to unpack why they had made the trip and what they thought of all the action.\nHowever difficult it may have been to find the some 30,000 Americans who had reportedly purchased tickets in the sea of travellers, if the reactions inside Allegiant Stadium were anything to go by, the NRL was certainly making a serious impression.\nWhile most fans were thrilled by the excitement of the day, one prominent theme did seem to be a fundamental misunderstanding of the difference between Rugby Union and Rugby League, with most Americans we spoke to seemingly not realising that the sport they were watching was a completely different game.\n“They put a call out at work and we’ve been to the Sevens a bit… so being locals we took advantage,” one fan told B&T.\nAlbeit uncertain of what sport was being played, the same fans son had enjoyed the action so much that he had asked his school’s Football Coach if Rugby League was an option for school sport, with the answer being a resounding yes—the US could soon being offering up one of its own to the game.\nElsewhere fans reported having close ties to Rugby League supporters from friends and family, and Aussie expats the hype was building and even if they may not have fully understood what was happening, everyone seemed to be having a great time.\nThe Aussie presence in Vegas was impossible to miss, with thousands of traveling fans decked out in team gear. “You feel so far from home, but then you see all these Aussies and Kiwis in rugby league jerseys, and it’s like, ‘Oh, we’re all here!’” Fox Sports commentator, Yvonne Sampson told B&T.\nDespite this a number of Aussie fans reported feeling ill-informed on game day with rosy closures blocking entrances, a limited information surrounding transport. One group of fans, each of whom were reliant on a walking stick for mobility, told B&T they were disappointed by the “horrendous” organisation and lack of information. With limited mobility and no option for stadium transport to take them over the the bridge (a 15 -minute walk) back to Mandalay Bay casino where most transport was leaving from, the fans were forced to make their way through a sea of fans to the rideshare pick up area where they had to work out how to use Uber for the first time to make it back to their hotels.\nOthers were outraged by the clear bag rules that mean only a roughly iPhone sized bag could enter the event, unless it was completely see through. The enormous lines for the bag cloaking rooms led many fans to fill their pockets with their belongings and throw bags into surrounding bins. “I don’t care enough about a $20 wallet” one fan joked with B&T as they through their belongings into the bins.\nBringing the Game to New Fans—And Bringing Aussies into the Action\nCommentating on the NRL in Las Vegas was always going to be a balancing act: keeping Aussie fans engaged while also introducing the game to a brand-new audience in the U.S. For Fox Sport commentators Andrew Voss and Yvonne Sampson, the approach was clear—let the game do the talking and make the experience as immersive as possible for all viewers.\n“We’re really mindful that people, especially new fans, switching on across America… we don’t want to make rugby league more complicated than it needs to be,” Sampson explained. “At its essence, the game is pretty simple, and it has a lot of similarities to the NFL. So I think we keep it very simple”.\nFor Voss, capturing the raw energy of the game was just as important as explaining it. “If there’s a potential new viewer in America who knows nothing about rugby league, I personally think—don’t complicate the situation by explaining every little play. Just let them appreciate the big hits, the runs, the skill… no helmets, no pads”.\nBack home, it was all about making sure Australian fans felt like they were part of the Vegas spectacle. “Our main duty is making sure the atmosphere transfers through the TV screen,” Voss said. “I do hope that we achieve that… everyone inside Allegiant Stadium will have a story to tell for the rest of their life about how good it was, because the stadium is a rock star- our job is to make sure that translates back home”.\nUltimately, the goal was to make the event feel monumental for everyone—whether watching from a packed stadium, a Sydney pub, or their own lounge room. “We have a duty to present the game in the most entertaining and best light we possibly can,” Voss said. “Because this isn’t just another game—it’s a spectacle”.\nRatings: Australia and US\nWhile in-person attendances saw the stadium with a number of empty seats, its ratings performance here left a bit to be desired, too.\nWhile the timing was unfavourable, the afternoon matches performed pretty poorly. Seems the evening slots are the way forwards.\nRatings in the US will follow.\nThe NRL’s bold push into Las Vegas has undoubtedly made an impact, drawing record crowds, generating economic benefits, and sparking curiosity among American sports fans. With attendance figures rising, there’s clear evidence of growing interest. However, challenges remain.\nYet, for Peter V’landys and the NRL, the Vegas experiment is about playing the long game. The league has succeeded in creating a spectacle, capturing the attention of international audiences, and launching its season on its own terms. But whether this annual event can evolve beyond a novelty and truly establish rugby league in America remains to be seen.\nAs the NRL eyes an extended partnership with Las Vegas beyond 2028, the real test will be converting fleeting curiosity into sustained fandom- while locking down that organisation to be sure that Aussie fans don’t become disillusioned and stop attending the event all together. For now, the gamble continues—but the jackpot is still up for grabs.",
  "word_count": 1637,
  "scraped_at": "2026-02-14T12:43:04.837632"
}