{
  "article_id": "419564e48bdf",
  "url": "https://www.nytimes.com/athletic/6497505/2025/07/20/wales-poland-euro-2025-debutants/",
  "title": "How Wales and Poland can turn this year Euros debut into a reoccurring affair",
  "date": "20250720T124500Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Athletic has live coverage of England vs. Italy semifinal at the 2025 UEFA Women’s Euros.\nWales and Poland had two things in common at Euro 2025. It was their first major tournament — and a reality check.\nThe two nations left with a combined three points (all from Poland’s 3-2 win against Denmark), five goals scored, and 20 conceded.\nHow their first crack at the competition played out is not unusual.\nAdvertisement\nSix nations had made their debut across the 2017 and 2022 editions of the European Championship — five of them did not get past the group stage. Austria were the exception when they reached the semi-finals eight years ago.\n“We’ve found out just how big that level is and how big that jump is,” Wales’ record goalscorer Jess Fishlock told UK broadcaster ITV after a 6-1 defeat to England confirmed their elimination. “(We’ve got to) just keep moving forward and get into another major tournament and do better.”\nThat is easier said than done.\nScotland, who debuted in that 2017 tournament, and Northern Ireland, who followed suit in 2022, failed to qualify for the next Euros. Portugal also made their bow in 2017 and only got to the next finals five years later as replacements for Russia, who were suspended by UEFA following the invasion of Ukraine.\nSo, how do teams evolve from debutants into consistent qualifiers?\nThere is often a gulf between these first-timers’ domestic football environments and those of their competitors. Nine of Spain’s starting XI for their final group match against Italy play in Liga F. In contrast, none of the 23 players in the Welsh squad play at home in the Adran Premier, which is still a semi-professional competition.\nOnly four players from Poland’s domestic top flight made their Euros squad.\n“There’s a talent drain in Wales, where a lot of players end up getting pushed over the border (to clubs in England) to seek more professional environments,” says Sian Cousins, league development manager at the Football Association of Wales (FAW).\n“My players have to be playing,” Wales head coach Rhian Wilkinson said after that loss to England. “I had five players out of contract (at club level) here. It’s mind-blowing. Esther Morgan (a defender) starts all of our games and doesn’t have a club (her contract at Sheffield United having just expired). It drives me wild.”\nThe lack of suitable domestic clubs cannot help, but Cousins, whose role is to develop the profile of Wales’ domestic leagues, estimates professionalisation is a way off for Adran Premier clubs: “There are a lot of clubs really striving to become more professional. Questions have always been asked of whether the four big clubs (Wrexham, Cardiff City, Swansea City and The New Saints) look to make that turn and become professional, full-time clubs.\nAdvertisement\n“It’s definitely an opportunity. They have the kind of club structures to do that. (But) we’re probably a good eight to 10 years off even considering it.”\nWales is not in a position to provide the domestic football that its senior internationals need.\n“We’ve acknowledged realistically all of our better players are going to go play (for English teams) in the Women’s Super League,” Cousins says. “Our long-term goal would absolutely be to have some of our Adran League players featuring in the (national team) squad. Our medium-term goal is nurturing the youth talent coming through and allowing our Adran clubs to play a bigger role in supporting youth development.”\nScotland have spent years trying to rejoin Europe’s leading pack. They made their Euros and World Cup debuts in 2017 and 2019 respectively, but have missed out on qualification for the past three major tournaments.\nExperienced internationals such as Kim Little, Jen Beattie, and most recently Rachel Corsie have retired from the team since that 2019 World Cup. A new generation is emerging, with the likes of Hibernian forward Kathleen McGovern (23 years old) and Manchester United and Liverpool midfielders Emma Watson (19) and Kirsty Maclean (20) all breaking into the Scotland team.\nThe 10-team Scottish Women’s Premier League is not fully professional, but some of its clubs — including Rangers, Celtic, Hibernian and Glasgow City — have players on full-time contracts. The league has become more challenging, with three different champions in the past three seasons.\n“There’s high competition and rivalries now appearing — that in itself creates a great environment for player development, especially for young players,” says Michael McArdle, head of women’s elite football for the Scottish FA.\nPart of McArdle’s role is building a youth pathway that can better feed the national team for the 2027 World Cup in Brazil and the next Euros in 2029, the host country for which is still to be confirmed.\nAdvertisement\n“(Sustained qualification) comes back to having a strong pathway and strong youth development,” McArdle tells The Athletic. “Primarily, it’s cycles of talent that can achieve qualification. We’re not hoping for the next. It’s our job to provide the next group of talent and keep that going. The key is having a robust, evolving youth system that’s focused on creating talent for a sustainable future.”\nScotland now have an under-23 side, put in place to bridge the gap between youth and senior football. Starting from October’s international window, they will participate in an invitational competition with group matches against their counterparts from Sweden, Italy, Belgium and the Netherlands. It is the first time the team will participate in an organised competition.\nCeltic defender Emma Lawton and Hibernian forward McGovern are among those to have progressed from the under-23s to make their senior debuts.\n“The key challenge, in both men’s and women’s football, is the transitional period and that gap between youth to senior,” McArdle says.\nThis fluidity from youth to senior level is a focus for Wales, too.\n“More competitive football for youth players coming through in the girls’ game is an area where we’ve probably never really created that best environment for them to achieve their full potential,” says Cousins.\nThe girls’ pathway in Wales is being overhauled from 2025-26. There will be 11 new girls’ academies introduced across the country, increasing regular training and levels of match experience.\n“We are really controlling the environments that are created so that they are elite,” Cousins says. “We want them to be competitive. We want them to be a step up, pushing the players to achieve further.”\nThe National Academy system will begin at under-13 level and gradually introduce higher age groups until there is a complete pathway to the Under-19 Adran Development League.\nAdvertisement\n“It was all disconnected,” Cousins says. “Domestic, grassroots, and international were all just running their own things, whereas we’ve really tried to align it so there’s clarity and consistency through the pathway. Giving younger players an opportunity to come through has been massive over the last couple of international windows, so that we can see the talent coming through when the likes of Jess Fishlock (38) and Sophie Ingle (33) do end up retiring.”\nThe FAW have been playing catch-up with the women’s team, having not formally recognised them until 1993. The team were even withdrawn from Euro 2005 qualification due to budget cuts.\nThere has been huge progress since: the Welsh men’s and women’s senior national teams receive equal pay as of 2023, as well as sharing training facilities.\nThe Polish Football Association’s ‘Time For Us’ women’s football strategy set the target of qualifying for Euro 2025 and the 2027 World Cup. They have declared their interest in staging those 2029 Euros, which would mean automatic qualification as hosts.\nFishlock summed it up perfectly at the end of Wales’ campaign last week.\n“This is the beginning of a journey for us,” said the veteran of 164 caps and 48 international goals. “We have to work together now, as a group but (also) as an association, to keep investing and keep building to make sure that this isn’t just a one-off.”\n(Top photo: Natalia Padilla and Poland celebrate their win over Denmark; Alexander Hassenstein/Getty Images)",
  "word_count": 1337,
  "scraped_at": "2026-02-14T12:43:59.482640"
}