{
  "article_id": "419e683a1a98",
  "url": "https://www.orissapost.com/g-o-a-t-india-tour-jay-shah-gifts-t20-world-cup-tickets-signed-jersey-and-bat-to-lionel-messi/",
  "title": "G . O . A . T . India Tour : Jay Shah gifts T20 World Cup tickets , signed jersey and bat to Lionel Messi",
  "date": "20251217T160000Z",
  "domain": "orissapost.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "New Delhi: Argentina football legend Lionel Messi was presented with India vs USA Men’s T20 World Cup 2026 tickets by ICC chairman Jay Shah on the last leg of the GOAT India Tour, at the Arun Jaitley Stadium. Delhi chief minister Rekha Gupta also attended the event along with DDCA president Rohan Jaitley. Messi was also gifted with a framed cricket bat and a Team India jersey, along with Rodrigo de Paul and Luis Suarez.\nFormer Indian goalkeeper Aditi Chauhan, who represented West Ham United in the Women’s Premier League, gifted a signed t-shirt to all three guests.\nAcknowledging the crowd present at the Arun Jaitley Stadium cheering his name, Messi said, “Thank you for all the affection you have shown us here in India over these days. Truly, it was a unique experience for us to be able to share this. Although it was intense and very short, it was wonderful to receive all this love, which I already knew was there, but experiencing it firsthand was incredible. Everything you did for us over these days was astonishing, pure madness. So thank you all for the love, and we will surely return someday, perhaps to play a match or on some other occasion, but we will definitely visit again. Thank you very much, thank you,” said Messi.\nMessi was scheduled to land in the national capital earlier this morning, but his charter flight was held up due to foggy conditions here. He straightaway proceeded to the Leela Palace Hotel, where he had a meet-and-greet session for around an hour with a select group of people.\nMessi’s GOAT Tour got off to a rough start as the organisers were unable to manage the Salt Lake Stadium crowd. When the football legend visited the city with Luis Suarez and Rodrigo de Paul, thousands of fans flocked to see him. However, the venue’s bad management transformed their enthusiasm into frustration.\nAfter arriving in the capital of Telangana, Messi took part in a number of photo ops, including playing a ball with kids and mingling with an official.\nThe Argentine star made a brief appearance on the stadium’s big screen and on broadcast visuals during a match between two clubs at Uppal Stadium while staying inside a VIP box and waving at the camera.\nIANS",
  "word_count": 382,
  "scraped_at": "2026-02-14T12:37:44.969141"
}