{
  "article_id": "41adc50e7521",
  "url": "https://www.cardchronicle.com/2023/3/9/23632535/thursday-afternoon-cardinal-news-and-notes-louisville-cardinals",
  "title": "Thursday afternoon Cardinal news and notes",
  "date": "20230309T190000Z",
  "domain": "cardchronicle.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "—Top Louisville target Trentyn Flowers will announce his college decision at 5:30 p.m. on March 17. The Cards are widely believed to be the leader for talented 2024 (for the time being) small forward.\nThursday afternoon Cardinal news and notes\nShriners Classic champions. Get the banner up, Josh.\nGetting Flowers and Dennis Evans in the first two weeks after the end of the season, would be a very nice start to an offseason that Kenny Payne needs to win big.\n—The Louisville baseball team hosts Dayton for a three-game series starting tomorrow at 3 p.m. Here’s a preview.\n—Gotta get this reworked.\n—After 47 years, Jim Boeheim is out at Syracuse.\n—John Feinstein of The Washington Post says Syracuse owed Boeheim the right to choose his own ending.\n—Troy Nunes is an Absolute Magician says Boeheim meant everything to Syracuse.\n—This from Mark Titus on Boeheim from back in 2017 is also worth your time.\n—Overshadowing Boeheim’s news was Jeff Greer announcing that he is also stepping away from college basketball.\nThere was a moment during my walk through Freedom Hall with Denny Crum a few years ago — and I know I tell this story a lot. We’d been in the famous old arena for a while, and Denny needed to get to dinner before a Louisville game at the Yum Center. We walked toward the stairs that led to the parking lot, and Denny stopped right in the middle of the floor. The surface was just concrete — no basketball court or hoops set up. He turned around and pointed to a very specific spot and said, Right there is where Milt Wagner sat on his official visit.\nWhen I’m old and gray and my son Theodore has kids of his own and whatever this world becomes is moving faster than I can keep up with, I hope I can proudly point to the places I explored with Hall of Famers like Denny, the arenas and the gyms where I hunched over my laptop, the parking lots where I pulled over to type stories on my phone. I can say I did those things out of deep love for college basketball and the people who make it so special. And I can say I did those things to the very best of my ability.\nI’ll continue with my podcast. But you won’t be seeing my byline anymore. And I’m at peace with that. Finally.\nThanks so much for reading. See you around, Louisville.\nHe may be my arch-nemesis, but I’ll certainly miss reading his words.\n—Today only, Homefield Apparel is offering up free hoops stickers when you spend $100. You can also save 15% off your first purchase by using the promo code “GOCARDS” at checkout.\n—State of Louisville looks closer at the Cardinal baseball team’s recent dominant five-game stretch.\n—247 Sports has Jamari Thrash (52), Caleb Banks (82) and Marquis Groves-Killebrew (92) all ranked in its list of the 150 best transfers in college football for next season.\n—Ten years later and the season is already over.\n—The Los Angeles Times dives deeply into the story of how the lead investigator for the FBI’s “blockbuster” investigation into college basketball gambled away taxpayer money at the casino and ultimately lost his job.\n—Rece Davis says Rick Pitino and John Calipari are the only two people on the planet built for the Kentucky job.\n—Cal lost to Washington State in the first round of the Pac-12 tournament and finished the season with a 3-29 record. Can you even imagine?\n—Jack Payton has been named the MVP of last weekend’s Shriners Classic. The Cards naturally dominated the All-Tournament Team.\n—Mark Adams is out at Texas Tech.\n—The Athletic’s Seth Davis predicts that Rick Pitino will be the head coach at Georgetown next season.\n—Tim Sullivan expands on Josh Heird’s comments to him about Kenny Payne and the future of Cardinal basketball:\nI think the vision of what Kenny is trying to accomplish gives me the most reassurances. I understand a vision only takes you so far and you’ve got to execute it. But this isn’t a relationship where the AD talks to the head coach at the end of the season. I talked to Kenny earlier today. I talked to Kenny last night. Kenny and I talk about things constantly. I bet we’re on the phone three or four nights a week. Sometimes it’s just checking in. Other times we’re talking about the program, talking about things he thinks he needs. I think we have an extremely open relationship that allows for really good dialogue.\nThe end of this season is about getting better and how do we do that collectively? I think everybody in that program, and I’ll include the AD in that conversation, we need to take a hard look in the mirror and say how do we make sure this program gets a lot better than it was this year? We talk about all the things that transpired, everything in the past, but that’s the past. We’ve got to be laser-focused on the future and getting this program back to where we expect it to be and where our fans expect it to be.\n—Bracketologists currently have the Louisville women’s basketball team projected as anywhere from a 4 to a 7 seed.\n—After the worst season in the history of the program, Jody Demling looks ahead to what’s next for Louisville men’s basketball.\n—And finally, the Rutherford Show is back this afternoon from 3-6 on 1450 and 96.1 The Big X. You can stream it here.",
  "word_count": 929,
  "scraped_at": "2026-02-14T13:33:52.987654"
}