{
  "article_id": "41b6c4acc6c7",
  "url": "https://metro.co.uk/2025/03/11/gary-neville-blown-away-spectacular-new-man-united-stadium-pictures-22704389/",
  "title": "Gary Neville blown away by  spectacular  new Man United stadium pictures",
  "date": "20250311T084500Z",
  "domain": "metro.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Manchester United’s ambitious new 100,000-seater stadium project for a new Old Trafford has been given the seal of approval by Gary Neville.\nEver since his minority purchase was ratified in February 2024, British billionaire Sir Jim Ratcliffe has been open about wanting a new, state-of-the-art ground for the club.\nAnd United have now announced on Tuesday their new plans with architects Foster + Partners for a new-build on the land surrounding Old Trafford\nAlongside the stadium, it is hoped the project will add an extra £7.3billion to the local economy as well as creating 92,000 job opportunities and building more than 17,000 new home.\nA task force, chaired by Lord Sebastian Coe, has driven the project so far, with Neville also part of the team assembled by Ineos to aid the decision-making process\nAnd the former United full-back, a keen property developer himself, is more than happy with how the initial project seems to be shaping up.\nSpeaking about the stadium on The Overlap, Neville said: ‘I sat on the last taskforce committee meeting on Friday and I had a glimpse of what is coming and it looks absolutely spectacular.’\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nSpeaking on the eve of the release of the new stadium plans, Ratcliffe said: ‘It’s definitely deliverable but I think it needs to be set in context again.\n‘If you take the view that it’s the greatest football club in the world, then if it’s going to build a new stadium it should be a new stadium that’s befitting the greatest club in the world.\n‘And also a stadium that befits the greatest league in the world because the Premier League is the greatest league in the world.\n‘And at the moment, if you look at the Premier League, we’ve got some great stadiums, but we don’t have a Bernabeu, do we? And we don’t have the new Nou Camp. We don’t have that in the Premier League, although it’s the greatest league in the world.\nMore Trending\n‘And also, if you look at the north of England, the north of England has won 10 Champions League finals and London has won two, so there’s quite a few reasons there to have the world’s most iconic football stadium in the north of England at the world’s greatest club.’\nSir Alex Ferguson, meanwhile, was also impressed with the ambitious next step taken by the club.\n‘Manchester United should always strive for the best in everything it does, on and off the pitch, and that includes the stadium we play in,’ United’s legendary manager said.\n‘Old Trafford holds so many special memories for me personally, but we must be brave and seize this opportunity to build a new home, fit for the future, where new history can be made.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: New Man United stadium architect Norman Foster’s six most iconic buildings\nMORE: Norman Foster speaks out on controversial new Manchester United stadium design\nMORE: What we know about Man Utd’s new stadium including when it will be built and total cost",
  "word_count": 574,
  "scraped_at": "2026-02-14T12:49:27.290940"
}