{
  "article_id": "41e4e6e02996",
  "url": "https://deadline.com/2024/12/box-office-moana-2-wicked-thanksgiving-1236189131/",
  "title": "Box Office :  Moana 2  Heads For Record $215M+ Thanksgiving Weekend",
  "date": "20241201T183000Z",
  "domain": "deadline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "MONDAY AM: Everything is higher: Disney’s Moana 2 is settling its 5-day at $225.2M, while Universal’s Wicked is coming in at $118.2M, and Paramount’s Gladiator II at $44.3M.\n3-day for Moana 2 is $139.7M after a $34.7M Sunday, -31% from Saturday. For a project that was originally destined to be on Disney+, and was flipped to theatrical, that’s pretty amazing. The mind wonders how much cash Disney could have raked in had they put Hocus Pocus 2 into theaters at the time of its premiere instead of the service.\n“Where the hell did that $175M projection come from?” exclaimed one non-Disney rival executive this morning, “I would get fired if I forecast that!”. While rivals saw a clear path to $200M before Black Friday for Moana 2, Disney didn’t want to over project and be in a situation where grosses were getting walked back. It’s not a matter of being careful: Too often on the Wednesday before Thanksgiving, everyone sees numbers a certain way, and then Black Friday and Saturday come along and can change your fate by 180 degrees. The weekend before, estimates were too high for Wicked at $120M on Friday before settling at a $112.5M. The running total for Wicked, which is the highest grossing movie stateside based on a Broadway musical, is $263.1M after a $20.1M Sunday, -31% from Saturday’s $29.1M. Second weekend on the Jon M. Chu directed movie is $81.1M, -28%.\nWatch on Deadline\nMoana 2 shined this past weekend from walk-up business given its 100-minute runtime. Comscore/Screen Engine’s PostTrak shows that a massive 60% of moviegoers bought their tickets on the same day they went to see the movie.\nNext weekend is an interesting one, typically a downer weekend whereby all grosses can drop as much as -44% to -50% off the 3-day Black Friday weekend. The record first weekend of December goes to 2018 which saw all movies tally $119.7M per Box Office Mojo. That was -44% from the previous Black Friday 3-day frame of $216.4M. Comscore reported yesterday AM a total marketplace 3-day of $271M and a 5-day of $420M. Those figures are obviously higher from what we’re seeing this AM.\nThere is actually a wide release that’s daring to open this coming weekend and that’s Briarcliff Entertainment’s Frank Grillo horror movie, Werewolves.\nSUNDAY AM: Football, Christmas shopping, nor Turkey could divert attention away from cinemas this past weekend as Disney’s Moana 2 came in with the best overall 5-day and Thanksgiving record (opening and holdover) ever with $221M. By the way, the first Moana back in 2016 ended its domestic run at $248.7M, meaning in the next few days, the sequel will surpass that figure.\nWhat’s clear as a bell post Covid, there is no floor to what a movie will open to evident in Fall Guy, Joker Folie a Deux, etc, but when a movie connects –there is no limit to it. We saw that across three titles this weekend including Wicked ($117.5M) and Gladiator II ($44M).\nAnother thing to be celebrated: Remember when Disney under CEO Bob Chapek went through that phase that they were going to designate movies to Disney+, and not flip titles to theatrical. Well, God darn it, look what happens when you transform a piece of content originally intended for streaming to theatrical. You make out like a bandit. Moana 2 was previously conceived as a Disney+ series before CEO Bob Iger announced back in February the title was going to be a Thanksgiving tentpole.\nAs we told, it’s a 5-day Thanksgiving all-time record for the entire marketplace, Comscore reporting $420M.\nOn a 3-day basis, with $135.5M, Moana 2 counts the best ever opening for a Walt Disney Animation title surpassing Frozen 2‘s $130.3M opening. As we told you all weekend long, that Friday-Sunday is the second-best opening ever for Dwyane Johnson after Furious 7‘s $147.1M. All in, the global start was $386.3M, which is the second-best worldwide debut YTD after Deadpool & Wolverine ($444.7M). On a sheer global opening basis ($135.5M+$165.3M=$300.8M), Moana 2 ranks after Super Mario Bros Movie ($377.2M) and Frozen 2‘s $358.2M.\n“‘Moana 2’ has far surpassed our high expectations this weekend and is a testament to the phenomenon that ‘Moana’ has become,” said Disney Entertainment Co-Chairman Alan Bergman in a statement. “We’re fortunate to have an incredibly talented and hard-working creative team at Disney Animation who brought this new adventure to life, alongside our wonderful stars Auli’i and Dwayne and great new music. This is a moment to celebrate, and we’re thankful to all the moviegoers and fans who’ve helped make this a record-breaking debut.”\nBeamed ComScore Senior Media Analyst Paul Dergarabedian, “The planets aligned perfectly for movie theatres over this Thanksgiving holiday with a combination of films perfectly programmed to deliver massive box office revenue that was supercharged by the Glicked marketing hook that drew attention to the big screen and then followed brilliantly by Moana 2 This will now be the blueprint for how a rising box office tide can indeed raise all ships by virtue of having three high profile blockbusters in the mix at once all pulling in the same direction to great effect.”\nEntTelligence reports 46M turkeys were eaten over the holiday while 30M people saw the top three movies. Moana 2 pulled in 17.4M admissions, Wicked 8.7M people while Gladiator II counted $3.3M over the Wednesday-Sunday stretch.\nDisney says 86% went to see Moana 2 in 2D while 14% went to watch in 3D. PLF 2Ds did 13% of the business while Imax 2D counted 3%.\nFinal demos were 65% women, 35% male. Age breakdown was 25% under 12, 20% between 35-44, 16% 25-34, 15% 13-17, 12% 18-24, 9% 45-54 and 4% over 55.\nImax executives were just jumping into big piles of cash over the weekend as the large format programmed all three tentpoles: Moana 2, Wicked and Gladiator II, all three pulling in $24M. At the end of the day with a weekend like this — the PLF screens are undersupplied. The industry needs more if they want to keep pulling moviegoers out of the house. The Imax holiday weekend haul is 55% higher than the No. 2 IMAX global Thanksgiving weekend, and the third highest global November weekend ever for IMAX. $15.8M of the global weekend comes from North America, where IMAX delivered record Domestic Thanksgiving box office. Moana 2 made $6.2M stateside from matinees showtimes. Wicked did $5.1M from a limited schedule, up 20% from last weekend’s performance. The musical counts $14.5M to-date from IMAX screens worldwide. Gladiator II made $4.5M stateside taking its global run to $29.1M in the large format.\n1. Moana 2 (Dis) 4200 theaters, Wed $57.5M Thu $28M Fri $54.5M Sat $50.5M Sun $30.5M 3-day $135.5M 5-day $221M/Wk 1\n2.Wicked (Uni) 3,888 theaters, Wed $20.4M Thu $17M Fri $32M Sat $29.4M Sun $18.6M 3-day $80M (-29%), 5-day $117.5M/Total $262.4M/Wk 2\n3.Gladiator 2 (Par) 3,580 theaters, Wed $6.6M Thu $6.7M Fri $12.4M Sat $11.7M Sun $6.6M 3-day $30.7M (-44%), 5-day $44M, Total $111.2M/Wk 2\n4. Red One (AMZ MGM) 3432 (-600) theaters, Wed $2.8M Thu $3M Fri $4.8M Sat $4.8M Sun $3.1M 3-day $12.896M (-2%), 5-day $18.7M, Total $76M/Wk 3\nGlobal running total on the Johnson-Chris Evans Christmas action movie is now $148.7M.\n5. Best Christmas Pageant Ever (LG) 1,779 (-500) theaters, Wed $840K Thu $740K Fri $1.35M Sat $1.15M Sun $770K 3-day $3.27M (+2%) 5-day $4.85M Total $32M/Wk 4\n6. Bonhoeffer…(Angel) 1,800 (-100) theaters, Wed $500K Thu $540K Fri $918K Sat $825K Sun $660K 3-day $2.4M (-60%) 5-day $3.44M Total $9.7M/Wk 2\n7. Venom: The Last Dance (Sony) 1,716 theaters, Wed $500K Thu $486K Fri $815K Sat $905K Sun $480 K 3-day $2.2M (-45%) 5-day $3.1M Total $137.8M/Wk 6\n8. Heretic (A24) 660 (-962) theaters, Wed $278K Thu $292K Fri $338K Sat $359K Sun $258K 3-day $956K (-55%) 5-day $1.5M Total $26.8M/Wk 4\n9. The Wild Robot (Uni) 935 theaters Wed $180K Thu $180K Fri $260K Sat $250K Sun $160K 3-day $670K (-68%) 5-day $1M Total $142.4M/Wk 10\n10.) A Real Pain (SL) 505 theaters Wed $115K Thu $120K Fri $236K Sat $253K Sun 3-day $665K (-38%) 5-day $900K Total $6.1M/Wk 5\nSATURDAY AM: Another day, another day of box office records being broken. The richest Black Friday ever at the box office with an estimated $108M had Disney’s Moana 2 also turning in a record Black Friday haul of $54.5M. Disney is now taking their five-day estimate for Moana 2 up to $215M-$220M, which is where rivals saw it all along. However, Disney played wise: Rather than project over their skis, they kept it conservative. Thanksgiving projections always turn on their axis both on Black Friday and Saturday, either up or down, from wherever forecasts were on Wednesday. Three-day is $140M now, which is the second best debut for Dwayne Johnson after Furious 7‘s $147.1M.\nAt $215M-$220M, not only is that a Thanksgiving five-day record for any title, opening or holdover, but it’s also the biggest five-day opening of all time, squashing Illumination/Universal’s Super Mario Bros Movie ($204.6M).\nThose assuming that Moana 2 would cut into Wicked‘s business due to the latter’s two hour-40 minute runtime, well, you are wrong. So, wrong, wrong, wrong. At $118M over five days, the Universal feature take of the Broadway musical is posting the third best five-day haul for a movie over Thanksgiving, behind Moana 2 and Frozen 2 ($125M). In addition with $32M yesterday, Wicked owns the third best Black Friday box office for any title, behind Moana 2 and Frozen 2 ($34.1M). Popular, indeed. Tattoo it on your body, studio executives: Musicals aren’t dead.\nParamount’s Gladiator 2 remains on track for a $45M five-day, for a $112.2M running total by EOD Sunday. Black Friday business shot up 85% from Thanksgiving’s $6.7M with $12.4M on the Denzel Washington and Paul Mescal movie. With a running global take of $278M+, the sequel is already Washington’s highest grossing movie of all time, besting American Gangster‘s $270M. Give it another week, and Gladiator II will be Washington’s highest grossing movie in the U.S., ahead of American Gangster‘s $130M.\nBy the way, all of this activity spells for a 5-day Thanksgiving marketplace of $422M — by far an all-time record, ahead of 2018’s Thanksgiving stretch, which grossed $315.6M.\n1. Moana 2 (Dis) 4200 theaters, Wed $57.5M Thu $28M Fri $54.5M 3-day $140M 5-day $215M-$220M/Wk 1\n2.Wicked (Uni) 3,888 theaters, Wed $20.4M Thu $16.9M Fri $32M 3-day $80.6M (-28%), 5-day $118M/Total $262.6M/Wk 2\n3.Gladiator 2 (Par) 3,580 theaters, Wed $6.6M Thu $6.7M Fri $12.4M 3-day $31.7M (-42%), 5-day $45M, Total $112.2M/Wk 2\n4. Red One (AMZ MGM) 3432 (-600) theaters, Wed $2.8M Thu $3M Fri $4.8M 3-day $13.2M (+0%), 5-day $19M, Total $76.3M/Wk 3\n5. Best Christmas Pageant Ever (LG) 1,779 (-500) theaters, Wed $840K Thu $740K Fri $1.35M 3-day $3.5M (+2%) 5-day $5M Total $32.2M/Wk 4\n6. Bonhoeffer…(Angel) 1,800 (-100) theaters, Wed $500K Thu $540K Fri $910K 3-day $2.3M (-54%) 5-day $3.3M Total $9.5M/Wk 2\n7. Venom: The Last Dance (Sony) 1,716 theaters, Wed $500K Thu $486K Fri $810K 3-day $2.1M (-45%) 5-day $3M Total $137.7M/Wk 6\n8. Heretic (A24) 660 (-962) theaters, Wed $278K Thu $292K Fri $338K 3-day $999K (-55%) 5-day $1.45M Total $27M/Wk 4\n9. The Wild Robot (Uni) 935 theaters Wed $180K Thu $180K Fri $250K 3-day $660K (-69%) 5-day $990K Total $142.4M/Wk 10\n10.) A Real Pain (SL) 505 theaters Wed $115K Thu $120K Fri $236K 3-day $622K (-37%) 5-day $848K Total $6.1M/Wk 5\nFRIDAY UPDATE: Disney’s Moana 2 grossed a massive $28M on Thanksgiving Day, which is the most any movie has ever made on the foodie holiday; the sequel towering over previous champ Frozen 2 ($14.9M).\nMoana 2 isn’t soaking up all the water: Universal’s Wicked scored the second-best Thanksgiving Day take ever for a movie at $16.9M. Uni has upped its forecast for the movie to $105.6M over 5-days, which will ultimately be the 4th highest 5-day haul ever for a movie over Thanksgiving after Moana 2, Frozen 2 ($125M) and Hunger Games: Catching Fire ($109.9M). That’s nothing to complain about.\nDisney is maintaining their $175M+ forecast over 5-days for the film, even though others see this sequel well past $200M. Today’s business will determine how much to the heavens this Dwyane Johnson-Auli’i Cravalho movie goes. On a 3-day basis, Moana 2 is expected to be Johnson’s second highest opening of all-time, behind Furious 7‘s $147.1M. As we already reported, Johnson is a box office anomaly: He’s the only Hollywood star to open two No. 1 films in the same month, the other being Amazon MGM Studio’s Red One. Two-day take on Moana 2 stands at $85.5M, while global is just under $110M. Among all Thursdays, Moana 2 is the 8th biggest.\nTalk about diverse: Moana 2 pulled in 36% Hispanic and Latino, 27% Black, 18% Caucasian and 11% Asian American on Comscore/Screen Engine’s PostTrak. 4 1/2 stars, 89% positive with a 64% definite recommend, with kids under 12 at 92% and 73% must see right away. Mostly female at 71% with 42% women under 25, 29% women over 25, 16% men over 25, and 13% men under 25. Men and women over 25 gave the movie a 100% score.\nMoana 2‘s PLF business which includes some Imax (which Paramount’s Gladiator II owns), is contributing 20% of the business with 3D fueling 14% of the pic’s long weekend. The movie directed by David G. Derrick, Jr, Jason Hand and Dana Ledoux Miller, is playing big everywhere, but noticeably in the South Central and West. AMC Disney Springs reps the sequel’s best gross so far in the nation with $273K.\nParamount’s Gladiator 2 has been pulling in consistent weekdays, yesterday taking in $6.7M, +2% over Wednesday. The 5-day forecast on the Ridley Scott directed movie is now $45M. Running total will be $112.8M after 10-days. The first movie in 2000 ended its stateside run at $187.7M.\nJohnson on the live-action side is doing a great job competing with himself as Amazon MGM Studios’ Christmas action title Red One is looking at $21.4M over 5-days after a $3M Thanksgiving day, +8% over Wednesday. That Chris Evans co-star pic will stand at $78.8M by EOD Sunday.\nBusiness for all films eased yesterday due to Thanksgiving by an estimated -36% (or $59M), but it’s all shooting back up today on Black Friday which is expected to hit a $100M+ record for all titles on the shopping day, technically becoming the second-highest grossing day at the domestic B.O. YTD.\n1. Moana 2 (Dis) 4200 theaters, Wed $57.5M Thu $28M 3-day $116M 5-day $175M/Wk 1\n2.Wicked (Uni) 3,888 theaters, Wed $20.4M Thu $16.9M 3-day $68.2M (-39%), 5-day $105.6M/Total $250.5M/Wk 2\n3.Gladiator 2 (Par) 3,580 theaters, Wed $6.6M Thu $6.7M 3-day $31.7M (-42%), 5-day $45M, Total $112.2M/Wk 2\n4. Red One (AMZ MGM) 3344 theaters, Wed $2.8M Thu $3M 3-day $15.6M (+18%), 5-day $21.4M, Total $78.8M/Wk 3\n5. Best Christmas Pageant Ever (LG) 1,777 theaters, Wed $840K Thu $740K 3-day $4M (+18%) 5-day $5.5M Total $32.6M/Wk 4\n6. Bonhoeffer…(Angel) 1,900 theaters, Wed $500K Thu $540K 3-day $2.5M (-50%) 5-day $3.5M Total $9.7M/Wk 2\n7. Venom: The Last Dance (Sony) 1,716 theaters, Wed $500K Thu $486K 3-day $2.4M (-37%) 5-day $3.3M Total $138M/Wk 6\n8. Heretic (A24) 1622 theaters, Wed $278K Thu $292K 3-day $1.3M (-38%) 5-day $1.9M Total $27M/Wk 4\n9. The Wild Robot (Uni) 935 theaters Wed $180K Thu $180K 3-day $740K (-65%) 5-day $1.1M Total $142.5M/Wk 10\n10.) A Real Pain (SL) 505 theaters Wed $115K Thu $120K 3-day $687K (-37%) 5-day $929K Total $6.2M/Wk 5\nNotables:\nQueer (A24) 7 theaters, Wed $74K Thu $27K 3-day $145K 5-day $250K/Wk 1\nThe seven locations of NYC’s AMC Lincoln Square, Angelika, Alamo Brooklyn, and LA’s AMC Grove, AMC Burbank, Vista LA and AMC Century City are putting up a theater average on the three day of $20K.\nTHANKSGIVING UPDATE: It turns out Moana, singing witches and gladiators can co-exist together and won’t devour each other. All boats rose in the first day of the Thanksgiving stretch as Disney’s opening day of Moana 2, Universal’s Wicked and Paramount’s Gladiator II led all titles to a $92.2M Wednesday, which was easily the second highest grossing moviegoing day of 2024 after Friday, July 26, when Disney/Marvel Studios’ Deadpool & Wolverine drove all titles to a $118.3M gross. Read further down, tomorrow, Black Friday, is bound to push yesterday’s harvest to third best daily tally of the year.\nMoana 2 came in with $57.5M yesterday, including $13.8M Tuesday previews, which made it the best day ever for a Walt Disney Animation title, and the third best opening for an animated movie after Incredibles 2 ($71.2M) and Inside Out 2 ($63.5M). Disney continues to see a 5-day $175M+ five-day Thanksgiving record, not only for an opening title, but theatrical release during the holiday period. 3-day is at $116M. The swing factor is tomorrow, Black Friday in regards to how massive, or how short Moana 2 goes. No one is expecting her to fall into the ocean — rivals see this Disney animated sequel sailing past $200M+ by Sunday. Moana 2 gets an A- CinemaScore, which is the same as Frozen 2. Disney’s most watched movie on Disney+, the original Moana, got an A.\nWicked saw its highest weekday gross yesterday so far, and the fourth highest day in its run with a fantastic $20.4M. Doesn’t seem like anyone minds the 2 hour and 40 minute running time, and there is a vibrant confidence from sources about the pic’s legs. This puts the Ariana Grande and Cynthia Erivo movie toward a second weekend of $63.3M (-44%) and a 5-day of $97.1M. Don’t be surprised if it hits $100M. Running total by Sunday makes it the highest grossing movie based on a Broadway show at $242M. How high does this Jon M. Chu directed musical feature go? The highest grossing musicals of all-time at the domestic box office belong to Warner Bros’ Barbie ($636.2M), The Lion King ($543.6M), and Disney’s live-action take of Beauty and the Beast ($504.4M).\nGladiator II ain’t no chump with a $6.6M Wednesday, second weekend of $28M, -49%, and a 5-day of $40M for a running total by Sunday $107.2M.\nAlso opening in select NYC and LA theaters was Luca Guadagnino’s Daniel Craig movie, Queer, taking in $74K yesterday at seven locations for what’s looking like an estimated $268K 3-day and $390K 5-day. The movie, which is based on William S. Burroughs’ novel is set in 1950s Mexico, and follows an American ex-pat who leads a solitary life amidst a small American community. He falls for a much younger man, and they go on quite the trip. Pic is 78% certified fresh with critics on Rotten Tomatoes. The Oscar nominated Guadagnino saw his biggest opening at the box office with the Zendaya tennis romantic drama, Challengers, back in the spring with $15M.\nAs many supp today, moviegoing is expected to be off -44% today to around $51M before soaring to what is expected to be a record $100M+ Black Friday. Not only do people shop, but they go to the movies, too. The best Black Friday was in 2013 according to Comscore when all pics grossed $85M, led by Lionsgate’s The Hunger Games: Catching Fire.\nWednesday and weekend estimates:\n- Moana 2 (Dis) 4200 theaters, Wed $57.5M 3-day $116M 5-day $175M/Wk 1\n2.Wicked (Uni) 3,888 theaters, Wed $20.4M, 3-day $63.3M (-44%), 5-day $97.1M/Total $242M/Wk 2\n3.Gladiator 2 (Par) 3,580 theaters, Wed $6.6M 3-day $28M (-49%), 5-day $40M, Total $107.2M/Wk 2\n- Red One (AMZ MGM) 3344 theaters, Wed $2.8M 3-day $12.4M (-6%), 5-day $18M, Total $75.3M/Wk 3\n- Best Christmas Pageant Ever (LG) 1,777 theaters, Wed $840K 3-day $4M (+18%) 5-day $5.5M Total $32.6M/Wk 4\n- Venom: The Last Dance (Sony) 1,716 theaters, Wed $500K 3-day $2.4M (-37%) 5-day $3.3M Total $138M/Wk 6\n- Bonhoeffer…(Angel) 1,900 theaters, Wed $500K 3-day $2.1M (-58%) 5-day $3.1M Total $9.3M/Wk 2\n- Heretic (A24) 1622 theaters, Wed $278K 3-day $1.3M (-38%) 5-day $1.8M Total $27M/Wk 4\n- The Wild Robot (Uni) 935 theaters Wed $180K 3-day $550K (-74%) 5-day $840K Total $142.3M/Wk 10\n10.) A Real Pain (SL) 505 theaters Wed $115K 3-day $1.109M (-50%) 5-day $548K (-49%) Total $5.9M/Wk 5\nWEDNESDAY UPDATE: The worst thing a studio can do on a massive weekend like this is over-project. And if there’s one thing about Thanksgiving forecasts, they always get over-projected.\nRight now, Disney’s Moana 2 is putting up an estimated $54M first day, inclusive of Tuesday’s Walt Disney Animation preview record of $13.8M. This will coast the Dwayne Johnson-Auli’i Cravalho sequel to at least $170M at 4,200 theaters, easily a Thanksgiving 5-day record opening, unseating Disney’s own Frozen ($93.9M), as well as a movie with the biggest haul over the holiday stretch, topping Frozen 2 ($125M). The 3-day for Moana 2 is somewhere around $90M-$100M+.\nLet’s just keep a tab on this: The best opening for Johnson at the domestic box office is Furious 7 at $147.1M in 2015.\nThis is Disney’s fourth blockbuster north of $100M+ domestic under the Alan Bergman team after Kingdom of the Planet of the Apes; Inside Out 2, the highest-grossing movie of the year; and Deadpool & Wolverine, the top-grossing R-rated movie of all time.\nRELATED: The Highest-Grossing Animated Films Of All Time At The Box Office: Photo Gallery\nNow, some rivals easily see $200M+ over the Wednesday-Sunday period, and if Moana 2 crosses that threshold, the sequel would squash pervious 5-day opening recordholder The Super Mario Bros. Movie ($204.6M) like a turtle. Keep in mind the first day here for Moana 2 bests the first day of that Illumination/Nintendo title at $31.7M — but that pic didn’t have any previews. Black out Moana 2‘s previews, and the surfer girl is at $40.2M currently.\nWe’re not done yet…\nWicked by Sunday will stand at $236.9M, arguably the best ever stateside for a movie based on a Broadway musical, burying Grease ($190M). The 5-day on Wicked is estimated at $92M. Today is $18.5M, the pic’s highest weekday so far, +11% over Tuesday, which will plow into a $61M second weekend, -46% at 3,888 theaters. The production cost for both parts of Wicked is $320M before P&A.\nRELATED: ‘Wicked – Part One’: All The Box Office Records Broken\nParamount’s Gladiator 2 at 3,580 sites is posting another $6.7M today, for a second weekend of $27.3M, -50% and 5-day of $39.4M and a running total of $106.6M for the $250M feature production.\nSome are getting their double dose of The Rock this weekend, also heading to Amazon MGM Studios’ Christmas actioner Red One, which is eyeing a $3M Wednesday, $13M third weekend, -1%, $19M 5-day and running total of $76.3M.\nLionsgate’s fourth weekend of The Best Christmas Pageant Ever at 1,832 locations is seeing $950K today, $3.9M over three days (+14%), 5-day $5.7M and running total of $32.8M.\nRemember, the biggest Thanksgiving five-day Wednesday-Sunday frame for all titles belongs to 2018, when Ralph Breaks the Internet opened to No. 1, that period amassing $315.6M per Comscore. It’s looking like we could easily eclipse that benchmark.\nRELATED: The Movies That Have Made More Than $1 Billion At The Box Office: Photo Gallery\nMust Read Stories\n68 Comments\n-\nDelfra\nI have to admit that i was wrong about Wicked, it did indeed hit $80m this weekend. That was a very impressive second weekend. Not too many films have $80m weekends and all the ones that have turned out to be massive box office hits.\n-\nGale\n“On a sheer global opening basis ($135.5M+$165.3M=$300.8M), Moana 2 ranks after Super Mario Bros Movie ($377.2M) and Frozen 2‘s $358.2M.”\nSuper Mario also had a 5 day opening weekend on that $377.2, so it’s bellow Moana 2.\n-\njlinn\nWhy are you comparing it to Super Mario Bros. 5 day opening? That wasn’t during Thanksgiving, and it isn’t the 5 day record for an animated movie. A quick look and it appears Incredibles 2 has the biggest first 5 day gross of an animated movie at $233.4M. Compare apples to apples at least.\n-\nGene\n5 day opening = opened on a Wednesday.\nFirst five days = friday-tuesday grosses.\nMario’s opened on a Wed, and it was easter weekend, when kids were out of school. It’s comparable to a thanksgiving weekend opener.\nIncredibles 2 had a GREAT opening, but it opened on a friday.\n-\n-\nLovable\nWho cares about oversea numbers where the studios only get 40% even 20% in China? Wicket is a huge success no matter what haters keep trolling it’s not.\n-\nAnonymous\nEvery penny counts to Hollywood.\n-\nAnonymous\nIt’s like why does Hollywood even bother releasing their films abroad?\n-\n-\nAnonymous\nMoana 2 is destroying Wicked overseas tho… Wicked seems to be a thing only in US and UK I suppose\n-\nA\nWicked has yes to premiere internationally in a lot of territories\nIt will come out in a fee days in China and hasn’t opened 8n a lot of other places\nThe American premiere was pushed up by a week or 2 likely to avoid sharing an opening weekend with Moana\nIt’s way too early to actually tell how it is doing internationally since those numbers aren’t for all major movie going countries\nMaking it an American hit is God for press to push other countries to watch it\n-\nAnonymous\nEven Gladiator II will make more than Wicked overseas. It’s a flop and Part II will go straight to DVD.\n-\nBill\nGoing straight to DVD? Haha…Your absurd comments obviously show that you’re a troll. Wicked is a high success. Cannot deny the facts even you’re dying hating it so much. Go get a life.\n-\nAnonymous\nWicked is a lot of things, and it’s pretty good, but a success it is not.\n-\nDelfra\nIn America it’s certainly looking like a big success. But overseas is looking like a different story so far.\n-\n-\n-\n-",
  "word_count": 4318,
  "scraped_at": "2026-02-14T13:40:05.320233"
}