{
  "article_id": "41ec60305aba",
  "url": "https://www.arsenal.com/news/yankey-anelkas-boots-and-pretending-be-ray",
  "title": "Yankey on Anelka boots and pretending to be Ray",
  "date": "20250915T123000Z",
  "domain": "arsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Rachel Yankey enjoyed a glittering career at Arsenal, winning eight league titles, nine FA Cups, seven League Cups and, of course, a Champions League title.\nYankey broke into the first team in 1996 as a precocious teenage winger with an elite left foot. However, her path into the Arsenal first team was far from gilded.\n“When I went to sign, I met a guy called Tony Milton where the ball courts were at Highbury and I was told I would probably play for the fourth team,” Yankey remembers. “I definitely wasn’t the golden girl coming through! But then I played for the reserves a couple of times and then got on the bench for the first team. It all worked out well!”\nLike many female players of her generation, Yankey had obstacles to overcome to forge a career in football. Her love affair with the game started in her local park in north London.\n“I used to go with my older brother and two boys who lived across the road from me. We played in the street and at the park at the bottom of our road.”\nRachel says playing in the park, often in games of up to 20-a-side, gave her an excellent competitive grounding. “It was all different ages, people with their older brothers. People would look after you, but they wouldn’t go soft on you. If you weren’t producing, they’d tell you! They would either kick you or not pass to you, I learned through that, you had to survive.”\nHowever, progressing into more structured games required Rachel to disguise the fact that she was a girl. “The boys I played with wanted to join a team and a dad from their school created one because there wasn’t really a team in our area. It was a boys’ team, but my friend Lawrence just said, “Let’s just say you’re a boy and we’ll call you Ray.” Ray spells out Rachel’s initials.\nYankey joined a team called Miriam until her gender was discovered and she was told she could no longer play for them. Nearby Mill Hill United had a girls’ team who agreed to take her on.\nShe recalls playing in tournaments against the likes of Arsenal, Chelsea and Barnet. But manager Vic Akers spotted her in less auspicious circumstances – while refereeing a game involving Yankey’s school in Camden.\nRachel, who became only the second female player to pass 100 England caps, quickly became a key player for Arsenal. As an 18-year-old, she scored one and laid on a goal for Marieanne Spacey in a breathless 3-2 FA Cup final win over Croydon.\nBut like all players at that time, Yankey had a full-time job on top of her playing career, which, by coincidence, happened to be at Arsenal. “I applied to be a trainee with Arsenal in the Community after I finished school,” she explains. “With Freddie Hudson and Alan Sefton, I went into their programme and it just happened to be at the same time that I signed for Arsenal as a player. They were totally separate.”\nManager Vic Akers had helped to start Arsenal Ladies as an arm of Arsenal in the Community in 1987. Akers balanced managing Arsenal Ladies with being the kit man for the men’s team, and Yankey benefited from Akers’ dual role.\n“Vic gave me a pair of Nicolas Anelka’s boots and I wore them for a season,” she recalls. “His shoe size was way bigger than mine so I needed a couple of pairs of socks.”\nYankey’s crowning achievement with the Gunners came as a key member of the 2006/07 quadruple-winning side that became the first British team to win the competition, a feat matched by the current Arsenal team last season.\nRachel says she saw parallels between the 1-0 final win against Barcelona in May and the 2007 team’s triumph over the much-fancied Swedish side Umea 18 years earlier.\n“I watched this year’s final at home with my kids. In the days before the game a few of us went and had lunch with the team and I remember them being really calm. It didn’t seem like there were any nerves. When we played Umea in 2007 we really felt we were massive underdogs; that nobody gave us a chance.\n“Looking at this year’s final from the outside I felt it was the same scenario: that Arsenal were massive underdogs and everyone was talking about Barcelona, like how when we played everyone was talking about Umea. But I didn’t get the vibe from this year’s team that they felt they were the underdogs.”\nWhile Arsenal were viewed as outsiders for the 2007 and 2025 finals, some of the circumstances were different 18 years ago, not least because the final Rachel played in was across two legs, with Arsenal eking out a 1-0 first leg win in Sweden thanks to a late goal from Alex Scott.\n“When we played the away leg in Sweden, pre-game there was a car parked in the middle of the pitch as a promotion for Volkswagen. We got in that car and we were so chilled. There were no nerves, and that’s how I felt about the team this year. The second leg at Boreham Wood was very different because we had something to lose. In the first leg we had nothing to lose.”\nWatching the final in Lisbon from home, Yankey couldn’t help but feel the spirit of 2007.\n“Obviously there were times when backs were to the wall and there was a lot of defending but everyone was doing their job and that made me see our team from 2007 again. I texted Kaz [Carney], who was working on the game and I just said, ‘We’re gonna win this.” Carney also played for that quadruple winning team.\n“We had to play a different way against Umea and it was a different Arsenal this time too. This team played a different way against Barcelona – they matched them and knew tactically what they were trying to achieve.”\nThe 2007 team’s heroics has earned them a panel on the side of the Emirates Stadium, alongside the men’s Invincible team of 2003/04. Yankey features prominently on that panel, and she also features prominently on the “Future Brilliance” panel that celebrates graduates from the Arsenal Academy. Rachel admits she is still processing that her image is projected onto the side of the stadium – twice.\n“It’s weird. I’m still getting my head around that the Emirates is the stadium for Arsenal Football Club, not just the men’s team. The fact that our pictures are up there, and now they’ve put the women’s trophies around the perimeter of the stadium – there’s a sense of belonging for me at the Emirates and that’s how it’s going to be for these players.\n“From there you can build a fanbase and educate people about the history and what it’s taken to get there. Arsenal have shown a lot of bravery and I think that’s something we should be really proud of, as Arsenal fans and fans of women’s football.”\nOur first opponents of the WSL season, London City Lionesses, are also at the frontier of a new era for women’s football. Backed by their ambitious owner Michele Kang, they have signed a host of international players, including former Gunner Danielle van de Donk.\nYankey can see parallels between London City and Fulham, for whom she played between 2004 and 2004 as Fulham became the first English women’s team to go fully professional. Sadly, the Fulham project didn’t last.\n“Back then the FA said they were going to launch a professional women’s league and I’m not sure why that didn’t happen,” Yankey remembers.\n“Fulham may have continued if that had happened. Fulham proved it could take a group of players from different backgrounds and experiences and that women could come together and get better as professionals and work as a team.”\nYankey hopes that London City’s independent model can encourage further investment into women’s football.\n“London City Lionesses are going in with a different model without backing from a men’s club and that is brave. It would be good if they can consistently play in the WSL and compete because it shows other investors that it can be done and that it can succeed as a business model.”\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 1416,
  "scraped_at": "2026-02-14T12:23:25.842348"
}