{
  "article_id": "41ee3984ea77",
  "url": "https://www.dailymail.co.uk/news/article-14422405/JD-Vance-donald-trump-elon-musk.html",
  "title": "Insiders reveal how JD Vance is emerging as Trump most trusted  deputy  despite rise of Elon Musk",
  "date": "20250223T141500Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Insiders reveal how JD Vance is emerging as Trump's most trusted 'deputy' despite rise of Elon Musk\nVice President JD Vance has already emerged as an important figure in support of President Donald Trump during his first month in office - a stark change from modern vice presidents.\nTypically vice presidents are surprised after first taking office as they are traditionally sidelined by the president's men in the West Wing.\nBut Vance was called to duty right away, as Trump sent him to the Munich Security Summit to outline the administration's foreign policy vision.\nVance is unique in that Trump selected him as a working partner in the White House, rather than a carefully strategized consensus candidate.\nThat was by design from the beginning Trump officials and Republicans in Washington, D.C., tell DailyMail.com.\n'The president and vice president are aligned on policy and have a great personal relationship - that combination has created a lot of trust between them,' a White House official told DailyMail.com.\nIt's demonstrably different from the way former President Joe Biden's team frequently sidelined former Vice President Kamala Harris.\nJamal Simmons, a former chief of staff for Harris warned Vance after the inauguration to expect a rude awakening after taking office.\n'It’s commonly believed that the vice president functions as sort of a deputy president, the second most powerful person in the government,' he wrote. 'That’s not typically how it works.'\nUnited States Vice-President JD Vance addresses the Munich Security Conference\nFrom right, U.S. Special Envoy Keith Kellogg, United States Vice-President JD Vance and United States Secretary of State Marco Rubio meet with Ukraine's President Volodymyr Zelensky\nWelcome to MAGAland: The brand new politics podcast bringing you the latest news and gossip from Trump insiders. New episodes every Monday, Wednesday and Friday.\nSimmons warned Vance that he would be beholden to the White House chief of staff, recalling that Harris was controlled by chief of staff Ron Klein who was 'firmly in charge' when Biden was president.\nWhile previous vice presidents have struggled to take the lead for the president and his agenda, Vance appeared immediately comfortable with his role.\n'There's a new sheriff in town under Donald Trump's leadership,' Vance declared to European leaders in Munich.\nThroughout his visit with European leaders, Vance made it clear he was comfortable acting as the deputy.\nThe vice president also voiced appreciation for Trump's support.\n'This is partially President Trump’s management style,' Vance told the Wall Street Journal in an interview. 'He does not feel like he needs to keep a tight leash on every single American official. He encourages people to speak their minds.'\nVance also led negotiations for the administration with Ukraine president Volodymyr Zelensky.\nWhile a modern American vice president traditionally get's top-down direction from West Wing staff, Vance explained that he frequently speaks with Trump directly to make sure they are operating in tandem.\n'President Trump speaks for himself, and of course, I’m the vice president of the United States, I also speak for the president,' he said. 'We talk about what I’m going to say, and we make sure that our messages are aligned.'\nVance's freedom outside traditional messaging controls has made him a more confident messenger, but it also carries some risks.\nWhen the Wall Street Journal reported that Vance had threatened further economic sanctions and 'military action' in Russia if Putin did not agree to a peace deal with Ukraine, he moved quickly to clarify his remarks and accused the paper of 'twisting his words.'\nTrump also backed Vance when he voiced support for re-hiring DOGE staffer Marko Elez after he was forced out for his connection to racially charged posts on social media.\n'I obviously disagree with some of Elez’s posts, but I don’t think stupid social media activity should ruin a kid’s life,' Vance wrote. 'We shouldn’t reward journalists who try to destroy people. Ever.'\nThe vice president acted as the tip of the spear, sending an aggressive message from the administration that 'cancel culture' was over in the Trump administration.\nWhen a Fox News reporter questioned the president about Vance's statement, Trump appeared nonchalant.\nU.S. President-elect Donald Trump, Tesla CEO Elon Musk and Vice President-elect JD Vance attend the 125th Army-Navy football game\n'Well I don't know about the particular thing but if the vice president said that...' he began, turning to Vance and added, 'Did you say that?'\nWhen Vance affirmed that that he did, Trump replied quickly, 'I'm with the vice president.'\nThat was a unique moment, as previous presidents and White House operators would typically rely on anonymous aides speaking to the press to swat down a vice president for getting ahead of the president.\nVance's relationship with Trump remains solid, but political insiders are already buzzing about the emergence of 'first buddy' Elon Musk, who spends increasingly more time with the president.\nElon Musk and President Donald Trump are interviewed by Sean Hannity\nAfter Trump and Musk spoke to the press about DOGE, Democrats immediately pointed out that Musk's relationship appeared to be outshining the vice president.\n'I was watching clips of Trump & Elon in the Oval Office and thought this is weird, but uhhh even more odd is that he clearly has a partner in crime… it just doesn’t seem to be the flunky he ran with,' said Rep. Jasmine Crockett of Texas on X, who questioned Vance's whereabouts.\nOf course, Vance was in Europe at the moment, but it prompted additional speculation about Musk's public-facing role and omnipresent messaging on X.\nTrump and Musk also did a joint interview with Fox News host Sean Hannity who commented that the pair appeared inseparable.\n'I feel like I'm interviewing two brothers here,' he said.\nMusk frequently professes his 'love' for the president, but reassured Hannity he was only providing Trump with 'tech support.'\nCNN analysts joked that Vance should be 'day drinking' as it looked as if Musk was taking over his job.\nThe administration, however, dismissed the idea as media gossip.\n'This is a transparently stupid attempt by irrelevant talking heads to create a controversy where there is none,' an administration official told DailyMail.com.\nThere is zero indication that Vance is disturbed by Musk's proximity to the president, Republican insiders tell DailyMail.com citing the vice president's support for Musk and his efforts with DOGE.\nVance even downplayed Musk's role in foreign policy after he endorsed the right-wing political party in Germany on X.\nUS President Donald Trump (R) and billionaire Elon Musk (L) arrive back to the White House on Marine One\nBillionaire Elon Musk (2-L) arrives back to the White House on Marine One in Washington, DC,\n'If American democracy can survive 10 years of Greta Thunberg’s scolding, you guys can survive a few months of Elon Musk,' he joked in his speech.\nVance also clarified to the Wall Street Journal that as the vice president, he represented Trump's views on foreign policy, not Musk.\n'[N]o one should assume that Elon Musk, and he’s a dear friend, that he speaks for the president of the United States on all matters of foreign policy,' he explained to the Wall Street Journal, adding, 'that’s just not how any of this works.'\nThe modern conception of the diminished office of Vice President has entertained Americans for decades.\nHBO's show 'Veep' portrayed Julia Louis-Dreyfus as Vice President Selina Meyer repeatedly trying and failing to even reach the president of the United States as she grappled with a sense of irrelevance.\nThe comical nature of the position is that the choice of the president's running mate is frequently based on one's political identity to help the campaign earn more support.\nVice President Joe Biden was chosen to enhance President Obama's credentials in foreign policy and increase his appeal with blue collar Americans in states like Pennsylvania. After taking office, comedians mocked Biden's gaffe-prone remarks as Obama aides cringed every time he veered off of his prepared messaging.\nThe Biden campaign settled on Vice President Kamala Harris partially to help inspire black women to come to the polls support his ticket. When Biden staffers sent Harris out, they grew increasingly alarmed at her public 'word salads' and botched interviews.\nVice President JD Vance arrives for a reception at Palais de l'Elysee in Paris\nUS Vice President JD Vance walks to a meeting with Senate Republicans in the US Capitol in Washington, DC,\nTrump picked Vice President Mike Pence during his first campaign for president to help reassure skeptical evangelical voters. Pence was notable for working his way into every room with the president as he could, praising Trump at every occasion.\nBut the Trump-Vance trust still appears conditional after the president declined to endorse Vance as his heir-apparent during an interview with Fox News host Bret Baier.\nWhen Baier asked if he considered Vance as the presumptive 2028 nominee, Trump replied, 'No.'\n'But he's very capable,' Trump continued. 'I mean, I don't think that it, you know, I think you have a lot of very capable people. So far, I think he's doing a fantastic job.'\nVance critics seized the interview clip as evidence that the president was already souring on the vice president.\nBut Republicans familiar with Trump told DailyMail.com it was entirely normal for Trump to ignore the question, as the president is obsessed with timing.\nHe was not about to make news about 2028 when his administration was just getting started, they explained, pointing to the president's full comments.\n'It’s too early, we’re just starting,' Trump said.",
  "word_count": 1583,
  "scraped_at": "2026-02-14T14:15:42.477289"
}