{
  "article_id": "41fd224600cd",
  "url": "https://www.theatlantic.com/magazine/2026/03/democratic-party-elections-future/685759/",
  "title": "Do the Democrats Have a Plan ? - The Atlantic",
  "date": "20260211T154500Z",
  "domain": "theatlantic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Democrats Aren’t Built for This\nThey say they want to save democracy. First they’ll need to get out of their own way.\nKen Martin has one of those resting dread faces, as if he’s bracing for someone to dump a bucket of rocks on his head. His nervous eyes make him look chronically unsettled—which is probably appropriate for someone trying to run the Democratic National Committee these days.\n“The political equivalent of being a fire hydrant” is how Martin describes his job, and then helpfully explains the image to anyone not grasping it: “You get pissed on by everyone.” This is a favorite line and recurring theme: the put-upon chairman, always being hassled by his easily triggered constituencies.\nThe first time he said this to me, the week before Thanksgiving, the triggered included Martin’s own employees. He had been dealing with a staff revolt following his November 12 announcement that the DNC would be ending its generous work-from-home guidelines. Everyone would be expected to return to headquarters full-time, Martin told his staff, starting in February.\nThis did not go over well. Thumbs-down emoji filled the Zoom screen. Employees pelted Martin with questions. He told me that he sympathized, but observed that most major public- and private-sector organizations had long since compelled their employees to return to their offices.\n“If it’s unbearable and it’s a quality-of-life thing for you, I’m happy to help you find another job,” Martin said he told his staff. The complaints persisted.\n“Shocking” and “callous,” the DNC’s employee union said of the chairman’s directive in a statement to The New York Times.\nThe squabble underscored how the Democrats can’t help but keep playing to a stubborn stereotype—a soft and pampered bunch, unwilling to make the gritty sacrifices (such as getting dressed) necessary to prevail in their “existential” campaign to save democracy.\n“The Democrats treat their fucking people like kindergartners,” Sarah Longwell, a former Republican consultant who quit the party over Donald Trump, told me. Longwell can get exasperated by her new allies on the left. When I mentioned the DNC’s in-person-work kerfuffle, it set her off.\n“Republicans are over here being straight-up mercenaries,” Longwell said. “Democrats give everybody Fridays off and talk about work-life balance.” She apologized for yelling into the phone. Democrats “are not built for when the fascists come,” she concluded.\nMartin has invited similar doubts about himself. A former head of the Minnesota Democratic-Farmer-Labor Party, he won an election in February 2025 for the privilege of leading the divided, despondent, and destitute committee. He barely survived the summer after Politico received a leaked audiotape of a May 15 meeting in which an anguished Martin can be heard describing the toll of his job to DNC officers: “The other night I said to myself for the first time, I don’t know if I want to do this anymore.”\nBut things were looking up. Martin and I were sipping Diet Cokes at the National Democratic Club, next to the DNC headquarters, on the south side of Capitol Hill. The place was bustling, even festive, for a late Monday afternoon. Assorted House members, Hill staffers, Democratic donors, and lobbyist types clustered around tables of drinks and hors d’oeuvres. Representative Gwen Moore of Wisconsin stopped by to say hello to Martin. Others waved as they passed our table, and a few congratulated him. It had been a while since he’d been congratulated for anything.\nDespite Martin’s rough start in the job, the party’s spirits had brightened considerably after November 4, when Democrats scored double-digit wins in the Virginia and New Jersey governor’s races. Although both candidates—former House members Abigail Spanberger in Virginia and Mikie Sherrill in New Jersey—had been favored to win, their impressive margins, along with other overperformances by Democrats across the country, were viewed as hopeful signs for the 2026 midterms.\nA veteran party apparatchik, Martin arrived in Washington just as Trump was returning to the White House. Even more than during his first go-round, Trump has enjoyed near-unanimous complicity from supine Republican majorities in Congress, as well as meek resistance from a dazed opposition. Martin, 52, is the harried face of this meek resistance.\nI had been checking in with him periodically since the summer as part of my attempt to assess how the Democrats had managed to so thoroughly marginalize themselves. No matter how eager they were to resist Trump, they kept living up to their worst image as an overly sensitive, out-of-touch, and terminally online band of myopic and overindulged factions.\nMartin himself has a knack for reinforcing these caricatures. Just as I was starting this project, he presided over the DNC’s summer meeting in Minneapolis to begin the urgent work of rebuilding the Democratic coalition and making the party palatable to American voters again. Soon after calling the assembly of more than 400 party officials to order, Martin relinquished his mic to a representative of the Saginaw Ojibwe Nation for the DNC’s “land acknowledgment” ritual. Switching between English and her tribal language, the Indigenous woman affirmed that Minneapolis had been stolen from its native Dakota Oyate Tribe (“the original stewards of the lands and waters”).\nThe interlude took only a minute or two but received outsize attention—and ridicule—as an example of how Democrats remain overly concerned with performative pandering to various small identity groups. “It is difficult to imagine more than a handful of people looking out over the current hellscape of U.S. policy and thinking to themselves: You know what we need to be sure to address today? The Dakota War of 1862,” Andrew Egger wrote in The Bulwark.\n“What is Ken Martin doing?” the Democrats’ crank emeritus, James Carville, wondered aloud on his Politics War Room podcast. It is not the DNC’s job to right the well-documented wrongs of American history, Carville said. “It doesn’t exist to make people feel good. It exists—get this through your head—to win elections.”\nI asked Martin if gestures like land acknowledgments were worth the trouble. He bristled. “I’ve always felt that it’s important to be an inclusive party,” he told me. This suggested that the land acknowledgments would continue.\n“We’re not going to abandon who we are,” Martin said. “People can call it ‘woke’ as much as they want.” He disputed the notion that he was focused on anything other than winning in 2026.\n“It’s all gas, no brakes,” Martin insisted. And imperative that “we do the work between now and November.”\nAlthough it seems that many people at the DNC would prefer to “do the work” from home.\nThe DNC’s mini-mutiny over the return-to-office mandate ruined the brief elation of the off-year victories. Candidates running for office rely on massive numbers of volunteers, Virginia’s now-Governor Spanberger told me. They work their day jobs and then offer up their spare time because they believe in the cause. So it is not a good look for paid party staff to be talking publicly “about how hard it is to go into an office to get paid to do things that campaign workers do in their volunteer time,” Spanberger said.\nBut perhaps the deeper issue is that Democrats have historically focused too much on keeping their many constituent groups as happy as possible, sometimes at the expense of their principal goal: triumphing in elections so they can implement their policies. “First and foremost, Democrats need to get much more ruthless about winning,” Senator Elissa Slotkin of Michigan told me. This, she said, is not always compatible with the “weird consensus-based leadership” that their leaders tend toward.\nAs Trump has rampaged Caligula-like through his second term—draping federal buildings with massive likenesses of himself and renaming them in his honor; razing an entire wing of the White House; deploying masked agents to snatch brown-skinned people from sidewalks; running roughshod over constitutional norms, NATO, Minneapolis, and Venezuela alike—rank-and-file Democrats have shown a clear preference for Team Ruthless. Unleash the alpha dogs, they keep saying—the more rabid, the better.\n“They want to win so fucking bad,” said Longwell, who has convened hundreds of focus groups across the political spectrum. Democratic leaders and political strategists need to understand that anything that does not lead to winning elections is extraneous, she said. “If you watch the DNC, you still see the pronouns on the name tags and the land acknowledgment at the start, and the voters are like, Get that stuff out of here.”\nMy assignment was to pick through the Democrats’ post-2024 debris. I wanted to see if this once-confident multiracial coalition of working-class men and women could somehow get itself together in time for the midterms. Could the Democrats make themselves a viable alternative to the bumbling but dangerous autocrats on the other side? Are they capable of regaining some measure of power, despite themselves?\nI traveled around the country and interviewed about four dozen Democratic candidates, elected officials, party leaders, operatives, and voters I met at rallies, town halls, and other gatherings. What I encountered was a political party on a search: for a winning message; for a fresh identity; for new leaders; for the elusive white knight, whatever that might look like. In the past, saviors have occasionally materialized, but rarely how a broken party imagined them. No one saw Barack Obama coming, sweeping in to define a winning coalition of Democrats in 2008. Nor, for that matter, did anyone envisage Donald Trump doing the same for Republicans eight years later. Fortunes can turn fast.\nBut Democrats have remained stuck in their funk for an unusually long stretch. For much of 2025, their doldrums felt much worse than the typical rough patch that parties endure after bad election defeats. They were staggered, self-pitying, and seemingly traumatized by the denouement of the Joe Biden years. They have wallowed and feuded.\nThey have also analyzed themselves to death. If sheer tonnage of voter case studies and white papers could rescue a party, Democrats would be set for years. My inbox overflowed with the latest theories on how Democrats had lost their way and what was needed to revive them. Dueling autopsies were produced by various advocacy groups.\n“How Democrats Lost the White House,” from RootsAction, blamed party leaders. “The Working Class Project,” from American Bridge 21st Century, determined that the party’s traditional coalition of blue-collar voters has come to “perceive Democrats to be woke, weak, and out-of-touch, too focused on social issues.” “Deciding to Win,” a data-based dissection published by WelcomePAC, argued that as Democrats have moved left on issues such as crime and immigration, self-identified moderates and conservatives have abandoned the party. For good measure, the centrist group Third Way produced “Was It Something I Said?,” a guide to help Democrats avoid speaking “like the extreme, divisive, elitist, and obfuscatory enforcers of wokeness.” It included a handy compendium of 45 words and phrases (dialoguing, microaggression, stakeholders, LGBTQIA+) that the party should not use, because they create “a wall between us and everyday people.”\nOf all the autopsy porn I luxuriated in, the most compelling was “How the Democrats Lost America: Making Sense of the 2024 Election and the Future of American Politics,” by Scott Ferson, a longtime Democratic campaign strategist. The exhaustive report—which will be published as a book in April—is based on more than 1,000 interviews that Ferson and his team conducted during the Trump and Biden years.\nFerson argues that in recent decades the Democratic Party has developed an “elitist problem” that has caused it to lose its connection to many Americans. The migration of low-income, non-college-educated voters to the GOP has accelerated: Scores of Black and Latino Americans joined Trump’s coalition in 2024. Recent research suggests a significant shift in how voters perceive the parties; more people now believe that Republicans best represent the interests of the poor and working class, while Democrats are coming to be viewed as the party of rich elites. (Ken Martin has called this reversal “a damning indictment” of the Democrats “that’s got to change.”) Recent presidential-election trends illustrate this turnabout. In 2012, Mitt Romney carried voters earning more than $100,000 a year by 10 percentage points; in 2024, Kamala Harris won them by four points. In 2012, Obama won voters making less than $50,000 a year by 22 points; in 2024, Trump won those voters by two points.\nIn his report, Ferson describes conversations he had with people in the districts in and around Canton, Ohio, which have been decimated by plant closures and job losses. “I think the Democrats’ message to people in Canton, Ohio, is You should move,” Ferson told me, adding that many Canton residents think Democrats feel superior to them and their hometown. His research also confirmed how effective conservative media have been in reducing Democrats to caricatures. “By the time we knock on their door in Pennsylvania,” Ferson said, quoting a line from the Democratic media consultant Joe Trippi, “we’re a pedophile space alien who created AI to take their job away.”\nShortly after Martin became chair, he announced that the DNC would be producing its own report on the lessons of 2024. He purposely called it an “after-action review” and not an autopsy, to emphasize that the party is “not dead.” That was reassuring.\nWhatever they’re called, the various post-2024 analyses all posed the same unavoidable questions: How had the party lost the working-class voters who were once the backbone of its coalition? Would Democrats be better served by running more moderate candidates to court persuadable swing voters? Or by running more firebrand, populist types, who are better at creating excitement?\nThe off-year results of 2025 offered something for everyone. “Your task is going to be not to impose litmus tests,” Obama told a room of giddy Democrats during a live Pod Save America podcast a couple of days after the victories. “We had Abigail Spanberger win, and we had Zohran Mamdani win, and they are all part of a vision for the future.” But Spanberger and Mamdani, who won the New York City mayor’s race, were well situated culturally and ideologically for the very different electorates they were running in. It is hard to imagine the Democratic Socialist Mamdani winning a statewide race in Virginia.\nIn October, Democrats nominated Aftyn Behn, a Tennessee state representative and former progressive activist, in a special election for a U.S. House seat in a heavily Republican district in the Nashville area. Behn, who once described herself as a “radical” and campaigned with the very progressive Representative Alexandria Ocasio-Cortez of New York, was portrayed by her opponent as extreme. She wound up losing by nearly nine points to the Republican Matt Van Epps. Though Democrats celebrated this as another overperformance (Trump had carried the district by 22 points in 2024), a more moderate candidate, one not nicknamed “AOC of Tennessee,” likely would have done better. “The problem is that the left just is unalterably dedicated to this proposition that if you are more radical, you will turn out more voters,” Matt Bennett, of Third Way, told Politico. “And it keeps being disproven over and over and over.”\nBut parties are stuck with whomever their voters decide to nominate. “We have to stop acting like we’re casting parts in a play,” Spanberger told me. “Like, Oh, this person should run in Virginia, or this person feels like a good Texas Democrat.” Candidates are going to run regardless of whether some political operative or professional opinion-haver thinks they’re sabotaging the party’s chances. And primary voters tend to vote for the candidate they personally prefer, regardless of whether that candidate has the best chance of winning a general election.\nConsider the scenario playing out in Texas, where Representative Jasmine Crockett, an unrestrained liberal media magnet, is running for the Senate seat held by the Republican John Cornyn. Crockett’s gift for profane insult comedy aimed at Republicans has made her a celebrated sound-bite warrior on the left. But it is not clear that she would have a better chance of winning in red Texas than State Representative James Talarico, a 36-year-old former seminarian and aspiring minister, whose viral speeches have raised his profile, as well as a stunning amount of cash. Talarico’s faith and his relative political moderation could make him more palatable to Texans than Crockett in a general election. In January, an Emerson College poll had Talarico performing slightly better against Cornyn than Crockett in a general-election matchup.\nBut what if the main divide among Democrats today is not, as so many assume, progressive versus moderate? Slotkin told me that “Is it Mamdani or is it Spanberger? ” is “kind of an outdated approach.” The more consequential split, she said, is between leaders willing “to fight and go on offense” and those content to wait Trump out.\nSince Trump’s reelection, Democratic voters have shown a strong preference for the former. They’ve also made it clear that they think their current leaders have been soft and timid. Seventy-one percent of Democrats and 78 percent of all Americans believe that the party has been ineffective in standing up to Trump, according to a June CBS News/YouGov survey. And 62 percent of Democrats say the party needs new leadership, a Reuters/Ipsos poll found, also in June.\nIf Democratic voters perceive a candidate to be principled and unrelenting, they have been more than willing to look beyond acres of red flags. Graham Platner, a gravelly voiced oyster farmer who is running for Senate in Maine to supplant the Republican forever-incumbent, Susan Collins, offers a case in point: Platner, a political neophyte at 41, spent much of his adult life in the combat thickets of Iraq and Afghanistan before pivoting to mollusks. His campaign started off like gangbusters in August, attracting huge crowds and millions in donations. Reporters flowed to Sullivan, Maine, for an audience with the burly oysterman (just as soon as they were done with the Jesus-loving Democrat in Texas).\n“My plan is to just bribe reporters with oysters,” Platner told me as he shucked a few fleshy ones from a cage he’d pulled in. It was a windy morning in early September, and we were out on the white-capped waters of Sullivan Harbor, near Acadia National Park. “Working-class populist” is how Platner described himself. “I’m a small-business owner. And I also own an immense amount of firearms.”\nIf this was a casting call, Platner nailed it: flannel shirts, weathered caps, a pro wrestler’s voice. “I’m a fucking oyster farmer from Sullivan, for God’s sake,” he told me at one point, which might as well go on a bumper sticker.\nPlatner seemed a far more compelling character than Maine’s 78-year-old governor, Janet Mills, the candidate preferred by the party establishment. To his excited supporters, Platner might just be the Democrats’ perfect populist insurgent for Maine.\nWell, maybe not perfect. Okay, not at all perfect.\nLike shellfish, political newcomers only stay fresh for so long before they start to smell. Old Reddit posts can surface. Such as the one where the candidate remarked that some white rural Americans were stupid and racist. Or the ones that were homophobic or misogynistic. Or the anti-police one. Platner, who called his Reddit comments “indefensible,” attributed the “dark feelings” reflected in them to his time in the infantry. Chairman Martin called the old posts “hurtful” but not “disqualifying.”\nNext came a swell of questions about the large tattoo that Platner had on his chest, a skull and crossbones widely recognized to be a Nazi death’s-head. He claimed that he had been ignorant of the insignia’s Third Reich associations, and that he had gotten the ink done in Croatia following a drunken night out with his Marine pals in 2007. When the tattoo became a campaign issue, he hastily got it covered over.\nIt would be nice if Democrats could find a working-class-hero candidate who was not sullied by, say, a Nazi tattoo. But Platner’s early support has proved durable. His supporters blame the surfacing of his old comments on a smear campaign engineered by the establishment and the party’s rich patrons, who are scared of an unfiltered populist outsider who owes them nothing.\n“I think he’s running a really good campaign,” Senator Bernie Sanders told me. “It saddens me very much that instead of engaging in a real debate about the future of America, we have some people in the Democratic leadership trying to destroy him.” Sanders said he believes that Platner “stands an excellent chance to be the next senator from Maine.”\nAs he navigated the choppy waters in his boat, Platner splashed from topic to topic. He talked about the finer points of oyster farming, his love of soccer and of Maine’s native osprey, how therapy had saved him after his return from combat, and various other things.\n“I do love gays,” he said at one point. (Good to know!) “Somebody asked me where do I stand on LGBTQIA+,” Platner added.\n“What does IA+ stand for?” I asked him.\n“That’s actually a good question.”\nPlatner said that in an earlier speech, he’d just said “LGBTQ.” After thinking for a moment, he posited that the Q, I, and A stand for “queer, intersex, and androgynous.”\n“But what’s the plus?” I asked.\n“Everything else,” he said.\nPlatner’s broader argument is that although his campaign is focused on the “material conditions that people are living in”—hospital closures, housing shortages, affordability—he is not willing to compromise on social issues at the expense of vulnerable populations. “I don’t think there is any value, both morally but also politically, in selling people out,” Platner said.\nHis aide interjected with a correction: In fact, the A in LGBTQIA+ stands for “asexual,” not “androgynous.” The candidate regretted the error.\n“It’s asexual, sorry,” Platner said. “It’s asexual.”\nThough the Democrats may have been buoyed by November’s elections, it is hard to overstate how far the party had fallen.\nAt the start of August, the DNC had $13.9 million cash on hand, compared with $84.3 million for the Republican National Committee. A New York Times analysis found that from 2020 to 2024, Democrats lagged Republicans in new-voter registrations in all 30 states that track registrations by party. Polls kept drawing a bleak picture of the party’s popularity. Over the summer, Gallup measured the party’s approval rating at 34 percent, its lowest point since Gallup began tracking partisan approval ratings, in 1992; a Wall Street Journal poll had the Democrats at 33 percent approval; a CNN poll put their approval rating at a wretched 28 percent.\nRepresentative Jason Crow of Colorado, who co-leads the Democrats’ candidate-recruiting efforts for the House, told me Democrats need to project confidence in their policy positions: “People respond to confidence, and they respond to strength.” But because Trump and the Republicans have been so effective in slapping extreme liberal caricatures on their opponents, Democrats are gun-shy. “We can’t be apologetic for our own positions, and second-guessing ourselves, and being weak and timid about it,” Crow said.\n“I’ve never seen the party so unsure of itself, and so kind of lacking its own footing,” Colin Allred, the former NFL player and representative from Texas who lost the 2024 Senate race to Ted Cruz, told me. Allred, who is running for a Dallas-area House seat, described the state of the Democratic Party’s brand as “terrible.”\n“We are living through hell right now, let’s be honest,” Mallory McMorrow, a Democratic candidate for U.S. Senate in Michigan, told me. But McMorrow, a 39-year-old state senator and former bartender, sounded oddly buoyant, perhaps because she sees the 2026 midterm campaigns as a chance to clear out the old bones of the party establishment. The party “has not been prepared for this moment,” McMorrow said. “It is inexcusable to go on national television and say things like ‘Well, Democrats aren’t in charge right now, so we can’t do anything.’ Why would anybody vote for you?”\nAnd yet, despite the Democrats’ abysmal approval ratings—and their repeated, self-parodying demonstrations of why they might deserve them—voters have shown a consistent preference for them in recent months. Since Trump took office, Democrats have flipped 25 state legislative seats that had been held by Republicans, while Republicans have flipped zero seats held by Democrats. For all their dysfunction and malaise, Democrats have this key dynamic going for them: The party in power tends to overreach, mess up, and then take most of the blame when voters get cranky. This is a far more reliable blueprint for a party’s resurrection than anything drawn up at a think tank.\nTrue to form, voters have overwhelmingly blamed Republicans for what they see as a gloomy state of national affairs. Americans broadly disapprove of how Trump has handled the economy, immigration, and the cost of living—the three issues most responsible for putting him back in the White House. The Republican policy agenda has proved disastrously unpopular: A November Gallup poll put Trump’s approval rating at 36 percent, a low for his second term, and at just 25 percent among independents.\nBut none of this should be confused with a national wave of love for the opposition party. On the contrary, Democrats in Congress scored a particularly dismal 18 percent approval rating in a Quinnipiac University poll released in mid-December, a record low.\nYet the DNC apparently prefers to tune this out. The day after the Quinnipiac poll was published, Martin announced that the committee’s deep-dive review of the 2024 debacle would not be released after all. In other words, while the Democratic brand continued to flatline, the autopsy itself was declared dead in the cradle—this despite DNC officials having conducted more than 300 interviews and Martin having previously called the autopsy a crucial exercise.\nI’d spoken with several Democratic politicians and operatives who hoped that the memorandum, which would benefit from the DNC’s resources and access to party officials, could be an important addition to the canon of wonkery. It could help determine, for instance, which candidate profiles would work best in certain districts and states, how much blame Joe Biden deserved for 2024, and what, if anything, Kamala Harris could have done differently. But what the DNC essentially declared at the end of 2025 was Never mind. Releasing the DNC report, Martin suggests, would distract from the party’s work. Martin also seemed intent on cramming as many buzz phrases (and banned words) as possible into his official statement about the decision to scuttle the project: “In our conversations with stakeholders from across the Democratic ecosystem, we are aligned on what’s important, and that’s learning from the past and winning the future.” He continued, “Here’s our North Star: does this help us win? If the answer is no, it’s a distraction from the core mission.”\nHere is Martin’s north star, based on his first year at the DNC: proceed with extreme caution and commit no microaggressions.\nMartin’s decision to bury the DNC’s findings invited suspicion and derision. Simon Bazelon, the lead author on the “Deciding to Win” project, told The New York Times that the aborted autopsy is sadly consistent with the Democratic leadership’s general penchant for complacency, risk aversion, and avoidance.\n“It’s reflective of a broader problem within the party,” Bazelon said. “We are scared of ever making anybody in our coalition upset.”\n“Democrats are pussies.”\nSenator Ruben Gallego of Arizona was on the phone, and I was telling him what I kept hearing about his party. Gallego, a former Marine and an Iraq War veteran, did not disagree. This was no surprise, because he has cultivated a reputation for bluntness, and the media have held him up as the Democrats’ ambassador to the regular-bro types who supported Trump by large margins.\nDuring his winning Senate campaign in 2024, Gallego held events in boxing gyms and touted the appeal of a “big-ass truck” (apparently his attempt to buck the perception that Democrats drive only puny-ass Priuses and Jettas). Gallego is confident that none of the pejoratives affixed to Democrats—weak, feckless, timid—applies to him.\n“I just called the president an idiot on national TV, so I’m not exactly the person to talk about it,” he told me.\nGallego, who is 46, prevailed in his Senate race despite a rough performance by Democrats nationally. Latino men supported him by 30 points, despite Trump carrying about half that group across the country. Everyone was asking who the Trump-Gallego voters in Arizona were, Gallego said. “A lot of them were just men who said, ‘Ruben Gallego is a fighter.’ ”\nOr, not a pussy.\nI intentionally used that word because I’d heard so many others use it to describe Democrats, typically while conveying how impotent their elected leaders have been in standing up to Trump’s serial abuses. “Yes, exactly, I totally agree,” Gallego said. But he was hesitant to be quoted using that word specifically, and he asked to go off the record.\nBack on the record, Gallego told me he’d won in Arizona because those Trump-Gallego voters said, “Ruben is not a wussy like these other Democrats.” One could see why a politician would not want to utter pussy on the record, given its crass anatomical connotation (Gallego wussed out). These are sensitive times, after all, even for big-ass-truck-loving fight-fans.\nBeing a Democrat can be exhausting sometimes. So many considerations, so many shifting sensitivities and cancelable offenses.\nTrump’s steamrolling of anything, including the Constitution, that might impede his authoritarian project has made the limpness of the Democratic opposition more conspicuous.\n“What we’ve allowed to become normalized is completely deviant,” California Governor Gavin Newsom told me in the fall. “This is code red.” Newsom said that although he longs for the “When they go low, we go high shit,” this is no time for the usual political bromides and tactics. Democrats need to go beyond writing a concerned “op-ed that lands in The New York Times,” he added, which “we can retweet—to the 12 of us—and say how proud we are about our prose.”\nNewsom said the Democrats need to get out of their own heads and enclaves and start acting with a desperation commensurate with the moment. If the Democratic Party remains weak, “we will get rolled,” Newsom said. “Weakness is the toxicity of our brand.”\nAmong nationally known Democrats, it is Newsom’s political standing that may have risen the most amid the dark Trumpian doings of 2025. The governor’s willingness to mock the president through aggressive social-media parody elevated him to de facto resistance leader. Given voter impatience with wimpy party leaders, a righteous showdown with Trump is not a bad situation for an ambitious Democrat to be in. Newsom was also willing, at great risk to himself politically, to counter GOP efforts to gerrymander red-state House districts. He blew up California’s nonpartisan redistricting laws and led a successful ballot initiative to redraw the state congressional map to favor the Democrats.\nAs I spoke with Newsom, I realized that pretty much everything he said was some variation of “Desperate times call for desperate measures.” Conversations with him on this topic tend to be a bacchanal of profanity and exasperation. “Wake the fuck up; wake the fuck up,” he kept saying. “This thing is being torn down.”\nNewsom’s aggressive trolling of Trump has helped combat the long-standing view of him as a slick opportunist and has won him new admirers. “When people see someone fighting, they get really, really excited, and when they see someone folding, they get really, really demoralized,” Beto O’Rourke, the former representative from Texas and onetime presidential candidate, told me. “Gavin Newsom, who frankly I just wasn’t necessarily a big fan of before, I’m a big fan of right now. That guy’s a fighter.”\nThere’s a need for fighters, O’Rourke said, because Trump is now a “cornered animal”—one that happens to be “the most powerful animal in the country, who controls the House, the Senate, the White House, the Supreme Court, the National Guard, and has a secretary of defense who is in concert with him on using American cities as the training grounds for the military. So this is some dark stuff.”\nI couldn’t help noticing that O’Rourke’s voice acquired a kind of dreamy cadence as he described the darkness. Nothing like a potential Armageddon for American democracy to get a graying former golden boy—he is now 53—excited. “It’s also this extraordinary moment,” O’Rourke continued, “where all of us who are alive today get this chance to save the country. We’re going to be tested in a way I don’t think you and I can even imagine.”\nOne recurring resentment among Democratic voters is the disconnect between the party’s red-alert anti-Trump rhetoric and the musty vehicles—Biden and Harris, as well as Hakeem Jeffries, Chuck Schumer, and the various other dust-gatherers—it keeps deploying to resist him. “People continue to say, ‘Oh my God, Trump is an authoritarian; the world’s going to end,’ all this stuff,” David Hogg, the 25-year-old gun-control activist and advocate for recruiting young progressive leaders, told me over the summer. Hogg, who had a brief and tumultuous stint as a DNC co–vice chair in early 2025, is contemptuous of the party’s lingering cohort of elder leaders.\n“It’s like, ‘Okay, look who your members of Congress are: Some of them literally cannot stand for a press conference,’ ” he said. “You cannot credibly tell the American people that democracy is in danger and the world is ending, and the people that you are putting up on the front lines of fighting back against that genuinely belong in a nursing home.”\nOn that note, I headed to a Bernie Sanders rally.\n“We are living in a moment that is unprecedented in the modern history of this country,” Sanders roared. The socialist senator from Vermont was speaking to a packed theater of about 3,000 people in Wheeling, West Virginia. “We have got to act in an unprecedented way in response.”\nSanders, who turned 84 in September, seems to have earned immunity from the party’s anti-gerontocratic agitators. When I saw him this past summer, he was making a stop on the Fighting Oligarchy tour, which has consistently drawn fiery hordes across the country. At times, he’s been joined by Democratic Socialists of America luminaries such as Mamdani and Ocasio-Cortez. The three of them filled a stadium in Queens for a raucous rally in October, which featured chants of “Tax the rich.” Two of the Senate candidates drawing the most enthusiasm from the left—Platner in Maine and Abdul El-Sayed in Michigan—are Sanders acolytes.\nThese days, the far left is attracting a lot of the party’s money, media attention, and crowds. But whether this energy on the left represents the Democrats’ path to restoration or to electoral doom depends on whom you ask (or which white paper you read). A remarkable 66 percent of Democrats say they have a positive view of socialism, compared with only 42 percent for capitalism, according to an August Gallup poll.\nSanders strolled onstage in Wheeling to protracted applause and chants of “Bernie!” “I was told that West Virginia was a conservative state,” Sanders said as he hunched over a small podium. It was certainly a Trump state: The president won 70 percent of the vote there in 2024, his second-biggest margin in the country, behind Wyoming.\nBut West Virginia is a proletarian locale that until not long ago was a Democratic stronghold. Bill Clinton carried it twice in the ’90s; in 1988, it was one of the 10 states that Massachusetts Governor Michael Dukakis won in his otherwise thumping defeat at the hands of the patrician George H. W. Bush.\n“We are losing working-class voters—the core of our coalition since the New Deal—to a corrupt billionaire with a gold toilet,” Dan Pfeiffer, a former top Obama adviser, wrote in his Message Box newsletter. A critical mass of working-class voters has deemed said gold-toilet user to be their kind of tough; they like that he professes to fight for them, and they don’t care that he fights dirty.\nA lot of working-class voters prefer Trump, Graham Platner told me, because they believe he intuitively understands that they feel screwed by the world, just as Trump—the billionaire president—himself does. But running against a “rigged deal” was once the main Democratic message. Sanders had been delivering it for decades before Trump came along; the Fighting Oligarchy speeches are essentially the same ones Sanders has been giving for five decades. What’s happening in America today, Sanders declared, with several million working-class people at risk of losing their health care, is an acceleration of what has gone on for half a century: Life gets better and better for the wealthiest Americans—and worse for everyone else.\n“You know what happens when people can’t go to a doctor when they need to?” Sanders asked the crowd.\n“They die!” the crowd responded.\nKeep hope alive this is not. But the audience was on its feet and in full frenzy as Sanders revved up his rhetorical bus and set his sights on … Kamala Harris. Why had she lost?\n“One of the reasons,” Sanders said, “is she had too many billionaires telling her not to speak up for the working class of this country.”\nThe line drew the loudest cheer of the evening.\nA big thing for Democratic politicians these days is to swear a lot, as if by appearing pissed off and profane, they will show how raw and real they are. Since February 2025, they have sworn more often than their Republican counterparts, according to a Washington Post analysis of social-media posts and public remarks. (The big wins, they just keep piling up for the Democrats.)\nOne detects in this penchant for profanity a whiff of overcompensation—an effort by Democrats to prove that they can talk working-class. Ken Martin says that the party needs to stop being so cautious. “The problem we have as Democrats is we throw a punch, and then we pull it back,” he told me. “We don’t want to get canceled by someone in our party.” I was eager to test this proposition, given that Martin is steeped in the cautious language of the Democratic big tent; God forbid he ever utter something hurtful or make someone feel (double God forbid ) unsafe or triggered.\nSo I asked Martin: What about Biden? Specifically, his fiasco of a presidential campaign. Didn’t he wait too long to bow out, and wasn’t it dumb for him to have run in the first place?\n“It’s an academic exercise,” Martin said, ducking the question. “Do you have a time machine?”\nI do not.\n“The point is,” Martin continued, “we don’t know for sure whether he should’ve or shouldn’t have, and we can’t change it.”\n“He was too old,” I said.\n“What I’m interested in are things that will inform the next election.”\nA few minutes later, Martin was back to talking tough about the importance of speaking freely and not caring about whom he antagonizes.\n“I don’t give a fuck who I offend,” Martin declared.\nExcept Biden, I noted.\n“Listen, that has nothing to do with offending him or not,” Martin said. He reiterated that he is not in his job for glory. “All you do is get pissed on all the time,” he reminded me.\nI was struck by how often Biden came up in my conversations with Democrats around the country. Specifically, people mentioned that his refusal to step away despite his obvious decline—and the refusal of Democratic leaders to acknowledge this decline until it was too obvious to ignore—was a betrayal that the party has yet to reckon with or recover from. “If their line was As long as the president’s not senile—I just have a higher bar than that,” James Talarico said.\n“When you tell people that the thing that they are seeing isn’t true,” Graham Platner said, “they’re going to stop fucking believing you. Because you’re obviously lying.”\nThe lie has become a proxy for distrust of Democratic leaders on issues across the board. It’s a big reason Democrats have lost significant ground with a constituency that was once solidly theirs—the youth vote. “When we told them the president is too old, they told us, ‘No, he’s not; look how strong he is,’ ” David Hogg told me.\nTo his supporters, Trump approximates what “strong” looks like and what a “man” looks like (and even what a “strongman” looks like). Despite his constant whining and incessant lies, Trump embodies for his base blunt honesty and brutish masculinity.\nLet’s pause for a second to appreciate the richness of the irony here: Nearly every elected Republican in Washington who is not named Trump has allowed himself or herself to be effectively neutered by him. Republican “leaders” might fashion themselves as a pack of alpha dogs, but in fact they have proved themselves to be a pack of panting poodles. “They love to call us cucks,” Ken Casey, the lead singer and bassist for the punk band the Dropkick Murphys, told The Atlantic this past summer. “Which I find ironic because there’s a good portion of MAGA that would probably step aside and let Donald Trump have their way with their significant other if he asked.”\nRuben Gallego said that “if I was bullied as much as these Republicans are by President Trump and his followers, I would be so ashamed to see my family.”\nThe gap between how Trump is perceived by some Republicans (strong and confident) and his actual persona (overwrought and histrionic) is large. “He has built this sort of whole infrastructure around assuaging an insecurity that he has,” Abdul El‑Sayed, the Senate candidate from Michigan, told me. “He is so fragile that he builds this simulacrum of strength.”\nI asked El‑Sayed what he meant by that. “It looks strong, and it’s enforced by other people thinking it’s strong,” he explained. “But if you actually got in a physical fight with Donald Trump, you’d kick his ass.”\nFor the record, El‑Sayed, who is 41, looks like he could kick most people’s asses, certainly mine. A former high-school wrestler and football player, he attended the University of Michigan, and then Oxford on a Rhodes Scholarship; he was later appointed executive director of Detroit’s health department. He ran for governor in 2018, losing in the Democratic primary to the eventual winner, Gretchen Whitmer.\nWe were sitting in a café not far from El‑Sayed’s home in Ann Arbor. Fresh from his Saturday-morning workout, beads of sweat on his forehead and massive arms bulging through a tight black T-shirt, he was sipping a weird energy concoction containing espresso and wheat germ or something. El‑Sayed speaks bluntly about the need for a more muscular Democratic Party that fights harder, shows less mercy, and refuses to cede “masculinity” to the cartoonish version modeled by a president who plans to host an Ultimate Fighting Championship bout next summer at the White House. “If they go low, we don’t go high,” El‑Sayed told the crowd at a rally with Sanders that day in Kalamazoo. “We take ’em to the mud and choke ’em out.”\nEl‑Sayed is one of the many Democratic candidates and officials I spoke with who readily acknowledged that their party has been actively, albeit inadvertently, repelling men. “Every time you heard the word masculinity in Democratic spaces, it was always preceded by a particular adjective—toxic,” he said. “And if you condemn a whole group of people as toxic, don’t expect them to be like, Yeah, I want to be part of that.”\n“When we say ‘The future is female,’ I get where that’s coming from,” Talarico told me. “But to a young guy, that kind of sounds like the future is not for them.”\nIt was the middle of October, and Talarico and I were talking in the lobby bar of a hotel in Arlington, Texas. Part of his political momentum has been grounded in novelty—Look, Democrats have found a guy they think can talk to Christians in Texas—but Talarico is legitimately talented. Even though he is in many ways more moderate than his primary opponent, Jasmine Crockett, if Talarico wins the nomination, Republicans will inevitably do what they’ve become so adept at: turn him into a one-dimensional embodiment of a radical Democrat and make the race a referendum on “woke” pronouns, DEI, and transgender issues.\nTalarico might be especially vulnerable to this because of a remark he made in 2021, during a legislative debate. “God is nonbinary,” Talarico said, in a video clip that resurfaced this past fall. (Josh Barro, a political commentator who left the Republican Party in 2016 and is now a centrist Democrat, promptly weighed in with a Substack essay titled “The First Step to Winning Back the Senate: Don’t Nominate Anyone Who Said ‘God Is Non-Binary.’ ”)\nWhen I mentioned to Talarico that statements such as “God is nonbinary” could present a problem for him, he said he thinks Republicans would have a much harder time turning his race into a referendum on divisive cultural issues in the way they did in 2024, because the dominant issues of 2026 will be the economy and the cost of living. “We’re always focused on what happened in the last election,” Talarico said. Especially, he noted, the stream of out-of-town reporters in their shiny new cowboy boots. Talarico said he can predict what the national press is going to ask: “It’s trans athletes, the ‘God is nonbinary’ thing.” (I felt seen. Or exposed.)\nFocusing on cultural issues would be akin to “fighting the last war,” Talarico concluded, perhaps wishfully. But Spanberger’s campaign in Virginia last year provided validation for this. More than half of Republican ad money in her race was spent on anti-trans themes. “The attack ads were trying to do some sort of othering, right?” Spanberger told me. “It worked with Harris, and so then they presumed it could work with me.”\nIt didn’t. Spanberger figured—correctly—that every ad Republicans ran “talking about a bathroom, or trying to vilify kids, was a moment that they weren’t talking about the economy.” A poll conducted in the final weeks of the campaign found that transgender issues in schools were the top concern for only 4 percent of voters.\nTalarico argued that Democrats should not curse the uncertainty they have endured, or treat this period as pointless. “There’s an opportunity here to redefine the Democratic Party,” he told me. “And you can’t do that if the brand is super set, or if there’s a strong leader at the top of the party.” This, he said, should excite anyone who wants to see the party grow and evolve. “The wilderness is where new ideas and new leaders and new movements come forth.”\nAs Talarico and I talked, a woman from the hotel front desk approached our table to warn us that a coyote had been spotted on the patio earlier. She showed us a picture of the creature on her phone, and we assured her that we would be careful.\nTalarico remarked that the nasty interloper would provide good color for my story, and then recalled the time that former Governor Rick Perry had encountered a coyote while running outside Austin—and shot it dead.\n“He jogs with a gun” was Talarico’s takeaway.\nYou never know what you’ll come across in the wilderness.\nAlthough quantifying morale and momentum is hard, by the end of 2025, the Democrats were enjoying an upturn in both. Their message felt more focused, and their resolve stronger, than it had in a long time. Those off-year election wins helped, and so did Trump’s ongoing obfuscation of the Jeffrey Epstein files, which gave Democrats a righteous fight to engage in.\nThe president helped by continually serving up gold-plated symbolism: He demolished the East Wing of the White House so he could build a $400 million ballroom, and threw a Great Gatsby–themed party at Mar-a-Lago in the midst of a protracted government-shutdown fight that jeopardized health-care subsidies and SNAP benefits for tens of millions of Americans.\nAt the same time, Trump’s National Guard deployments and immigration-enforcement offensives in Democratic-run cities became more aggressive—and more unpopular. Social media served up a daily video deluge of heavily armed agents randomly manhandling dark-skinned people. Opposition to these incursions catalyzed a more determined resistance than Democrats had shown before. Trump’s approval ratings on immigration, which had been his strongest issue, have tanked.\nIn early November, I traveled to Chicago, the first midwestern blue city Trump had targeted for his immigration crackdowns. J. B. Pritzker, the Illinois governor and a potential Democratic presidential candidate in 2028, found himself in an ongoing Chicago beef with federal authorities, trying to serve as resistance leader against Trump while keeping a volatile situation from exploding in America’s third-largest city.\nThe president had recently called for Pritzker to be jailed—a status symbol among high-profile Democratic governors who might run for president. (Pritzker and Gavin Newsom could wind up sharing both a jail cell and a debate stage.) I visited him on a sparkling fall day in Chicago. Or, as Trump called it, a “war zone” and “the most dangerous city in the world.”\nAt the time we spoke, Pritzker had been urging citizens to blow whistles when they saw federal agents in the area so potential targets could flee. (Really? I thought. Has it come to this? ) He was spending his days fielding insults from the president (the sturdy governor endured a lot of fat jokes) while suggesting that Trump himself was “suffering dementia.”\nA former venture capitalist and an heir to the Hyatt-hotels fortune, Pritzker kept spitting out dire admonitions. He predicted that the presence of Trump-controlled security forces in Chicago and other cities might foreshadow federal tampering with the 2026 elections. “I think that all the pieces of something nefarious seem to be occurring, and I’m just putting the pieces together,” Pritzker said. “I’m hopeful I’m wrong, but I don’t think we can assume that I’m wrong.”\nHe was disappointed that it had taken so long for a robust resistance to Trump to coalesce. “My complaint is not about regular folks,” Pritzker said. “What I’ve been frustrated by is people who hold leadership positions. And I’m not talking about elected Democrats only. I’m talking about CEOs of companies. I’m talking about boards of universities. I’m talking about people who have influence, who have the ability to stand up, but are afraid.”\nPritzker talks a lot about Nazis. He does not hesitate to compare Trump’s authoritarian gambits to the rise of the Third Reich. A descendant of Jewish refugees whose family fled Ukrainian pogroms, Pritzker was talking like this even before the Chicago raids. In February 2025, he gave a speech about how “it took 53 days for the Nazis to tear down a constitutional republic,” he told me. “Authoritarianism happens fast.”\nPritzker is a billionaire—not exactly a beloved species among Democrats these days. Other than Trump and his court-flatterers, billionaires are probably the most agreed-upon class of boogeyman that Democrats have. In his 2018 run for governor, Pritzker said, one challenge was “overcoming” that.\n“Overcoming being a billionaire?” I asked.\nThis seemed to irritate him. “In a Democratic primary,” he said, yes. He asked me to consider the challenges he’d surmounted in running for governor two years after Bernie Sanders had gotten half the vote in the Illinois Democratic primary with a “Billionaires are evil” message. Pritzker had weathered his billionaire status to defeat Republican Governor Bruce Rauner. If he ran for president in 2028, Pritzker said, he would have to face that “obstacle.”\nPritzker said he’s proud of the fact that many of Sanders’s 2016 supporters in Illinois have become strong supporters of his, despite his wealth. Like Newsom, Pritzker exemplifies how using competence and combativeness against Trump plays well with constituents—and can wipe out all kinds of political deficiencies.\nWhile in town, I stayed at the Hilton Chicago, a 1,544-room landmark, built in 1927, on South Michigan Avenue. The hotel overlooks Grant Park. The last time I’d been there was 2008, when I covered Obama’s Election Night rally, one of the most unforgettable experiences of my career. The wholesome pride in Chicago was palpable that night: hometown pride and American pride, as well as a strong sense—or illusion, it turned out—of national unity. The Ethiopian cabdriver who drove me to O’Hare the next morning kept bursting into tears because, he said, he never expected that the people of his adopted country would elect a Black president.\nObama’s ascendancy that night also represented a 21st-century high point for the Democratic Party. Hope, change, all of those things. (As well as the racial backlash, prominently abetted by Trump.) That was a long time ago, and feels longer. The arc of the moral universe is complicated.\nMy last stop on the tour was a café in Toledo, Ohio, about two weeks before Christmas. Former Democratic Senator Sherrod Brown was hosting a roundtable featuring seven Ohioans sharing stories about the financial pain that bloated health-care costs had inflicted on their families, compelling them to scale back their medical care.\nOne after another, the participants described, at times tearfully, how their struggles had been exacerbated by the Trump administration’s policies, especially the so-called big, beautiful bill that Republicans passed over the summer.\nThis was a classic Democratic campaign event, centered on the party’s most solid policy terrain—health care. It was also classic Sherrod Brown, a now-rare breed of working-class progressive who had managed to get himself elected three times to the Senate and seven times to the House, in a state that veered to the right during the Trump years. Brown, 73, finally saw his luck run out in 2024, when he lost his campaign for a fourth term to Bernie Moreno, a MAGA disciple.\nWhen he lost, he assumed that his political career was over. “I really was not going to do this again. My wife didn’t want me to do it again, and my kids didn’t want me to do it again,” he told me. But when Trump returned to office and started wreaking even more havoc than he had in his first term, Brown saw an opening. He is now running for a seat held by a Republican incumbent, Jon Husted. “I’m going to win this race because the state is so different,” he said.\n“Different from what?” I asked.\n“Different from what it was last year,” Brown said, when Trump 2.0 was more popular, the Democrats were a mess, and it looked like Brown’s brand of nuts-and-bolts liberal politics was cooked. Now Trump is so much less popular that the abiding Democratic disarray might not matter.\nI wanted to end this journey with Brown because he is not flashy or a media magnet or a handwringer or (bless the man) someone who gets hung up on white papers about why Democrats are adrift. He is simply seizing an opportunity the Republicans have handed him: Large majorities of voters are losing patience with Trump.\nLast year, James Carville was criticized in some circles for his argument that Democrats would be best served by staying out of the way, suppressing their penchant for self-harm, and simply waiting for Trump and the Republicans to self-immolate. Which is essentially what they’ve done. Carville’s theory was and remains controversial—his critics point to the lasting damage Trump has inflicted everywhere since his rapacious return to office while the Democrats have looked on haplessly. But as the 2026 midterms approach, Carville’s advice seems likely to be vindicated.\nEssentially: Do no harm, strive to remain at least in the ballpark of “normal,” and bank on one huge built-in advantage—opposition parties typically do well in midterms. Also, the past 10 years have shown repeatedly that Republicans vote far less reliably when Trump is not on the ballot. Finally, for all the blundering, there remain just two viable political parties in the United States, and the Democrats are still one of them, despite themselves. No party wants to “lose America,” as the white papers put it. But when the other side is destroying it, there are worse things to be than the alternative.\nThis article appears in the March 2026 print edition with the headline “Why Do Democrats Hate Winning?”",
  "word_count": 9326,
  "scraped_at": "2026-02-14T14:21:28.665411"
}