{
  "article_id": "4208782309e6",
  "url": "https://www.poynter.org/commentary/2025/karen-attiah-washington-post-firing-jamal-khashoggi/",
  "title": "Karen Attiah reflects on her controversial firing from The Washington Post and what comes next",
  "date": "20251008T120000Z",
  "domain": "poynter.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This is The Poynter Report, your daily guide to the news about news. Subscribe to get it in your inbox every weekday.\nIt was not all that long ago that Karen Attiah was making a worldwide impact by writing authoritative opinion pieces for The Washington Post, starting up the paper’s global opinions section, winning journalism awards, dining alongside powerful figures such as Post owner Jeff Bezos and having an influential voice not just in the U.S., but across the globe.\nToday? She’s left stunned, angry, confused and sad after having been suddenly fired by the Post in September following social media posts in the days after the shooting death of right-wing influencer Charlie Kirk.\nShe has since filed a grievance against the paper and started her own Substack — The Golden Hour — as she tries to figure out what happened and where she goes from here.\nThe 39-year-old who spent more than a decade at the Post joins me for the latest episode of “The Poynter Report Podcast,” which is out today.\nThe day we recorded the podcast was the seventh anniversary of the murder of Post columnist Jamal Khashoggi. Attiah brought Khashoggi onto the Post and served as his editor. She, along with the Post, gave him a voice.\nAttiah told me on the podcast, “Fast forward to today, and here I am fighting being silenced and fired by the very same newspaper that gave Jamal a platform in English and sort of paraded us both around as symbols of press freedom and what it looks like to stand up for journalists honestly.”\nAttiah added, “I’m still, I don’t think I’ve really processed this betrayal — whiplash, I suppose.”\nWe talk about how she got started at the Post and her career there. And, of course, we discuss in detail the social media posts that led to her firing, as well as details of how she was fired.\nHear in Attiah’s own words about how it all went down, what has happened since then, and how she is dealing with what she calls the “betrayal” from the Post.\nAside from watching on YouTube, you can also find the show on Apple, Spotify, and most places where you find podcasts.\nLeftover thoughts on the CBS-Weiss deal\nSo the Bari Weiss era has begun at CBS News. The former New York Times opinion writer who went off and started her own media organization (The Free Press) is now editor-in-chief of CBS News.\nAside from asking if someone who has never worked in TV news can help lead a network newsroom, the question really is: Can anyone save network news?\nWhile the journalism at places such as CBS, NBC and ABC remains high-quality, dwindling audiences continue to be an issue. Can anyone, including someone like Weiss, turn that ship around?\nAs far as Weiss specifically, Paramount chief Larry Ellison is hoping Weiss can attract the kind of folks who turn to The Free Press. And while Weiss should be commended for the audience she has drummed up at that publication — reportedly 170,000 paying subscribers, more than 1.5 million readers, and $15 million in annual subscription revenue — they don’t seem like the kind of numbers that are going to change the game at a news network.\nVariety’s Tatiana Siegel has a good story: “Inside Bari Weiss’ $150 Million Journey From Rejected ‘View’ Host to CBS News Editor-in-Chief: ‘She’s Just Gaming the System.”\nIn it, Siegel reminds us that Weiss wanted to join ABC’s “The View” as a replacement for conservative voice Meghan McCain back in 2021. She even sat in as a guest.\n“But,” Siegel wrote, “Weiss didn’t test well with audiences, who didn’t understand her centrist-right contrarian politics. In fact, her focus group scores were so low that she wasn’t invited back to guest host, according to insiders. Instead, Alyssa Farah Griffin, a former Trump White House director of strategic communications, landed the gig.”\nOf course, not getting that gig worked out well for Weiss. She now joins CBS News in a top leadership role, and her Free Press was bought by Paramount for $150 million.\nSiegel reports that Weiss wants to have some sort of on-air presence at CBS News, although not with “60 Minutes.”\nThere were some interesting quotes in Siegel’s story. One Hollywood executive told Siegel, “She plays to an audience of 200 people. It just happens to be that audience is made up of people like Jeff Bezos and Bill Ackman. The superrich (expletive) love her. She’s funny, she’s smart and she’s aligned with their politics.”\nOne colleague of Weiss’ at The Free Press said, “Any journalistic institution would be lucky to have her in charge.”\nBut another former colleague from The New York Times said, “She’s just gaming the system, with billionaires funding her career. She’s never worked in a newsroom traditionally in the way that she’s going to. It just feels like cheating.”\nTaking a stand against standup\nIn a strong editorial, The Washington Post blasted the comedians who have participated in the Riyadh Comedy Festival, which is being sponsored by the Saudi Arabian government. The list of performers included Bill Burr, Dave Chappelle, Kevin Hart, Aziz Ansari, Pete Davidson, Andrew Schulz, Jo Koy, Jessica Kirson, Jimmy Carr, Louis C.K., Sebastian Maniscalco, Tom Segura, Whitney Cummings, and many more. Several comedians, including Marc Maron and David Cross, have criticized the lineup for choosing to take gobs of money from a government with an awful human rights record.\nAnd now the Post editorial board is criticizing them, too. The board writes, “The event in the Saudi capital is supposed to be another example of how the kingdom has become more open and tolerant under its modernizing monarch, Crown Prince Mohammed bin Salman, known as MBS. Really, it’s just the latest in a string of attempts to divert attention from his country’s atrocious human rights record by hosting showy international events. It’s also a fresh reminder of how many people will pick a payday over principles.”\nThe board notes that the timing of this year’s festival (Sept. 25-Oct. 8) overlapped with the seventh anniversary of the murder of Washington Post columnist Jamal Khashoggi. U.S. intelligence believes the murder was ordered by MBS.\nBut many of the comedians defended their appearances. Chappelle said, “It’s easier to talk here than it is in America.”\nThe Post’s board wrote, “It’s distasteful enough to criticize America’s free-speech challenges while being lavishly paid by a regime that forces comedians to sign contracts pledging to avoid sensitive topics. It’s grotesquely hypocritical when exercising free expression, even satire, in Saudi Arabia can result in being not canceled but literally decapitated. While the comedians are yukking it up onstage, human rights groups report that dozens of Saudi journalists, dissidents, women’s rights activists and peaceful critics remain imprisoned on bogus charges.”\nMeanwhile, Mediaite’s Sean James has “Adam Carolla Slams Dave Chappelle, Bill Burr for Taking Saudi Money and Bashing America: ‘Don’t Be Preachy and Take the Cash.’”\nStepping back from the table\nAfter 25 years, Tom Sietsema is stepping down as food critic for The Washington Post.\nIn a farewell piece, Sietsema wrote, “During my run, I’ve endeavored to eat under the radar as much as possible — anonymously, the better to experience a restaurant like someone who isn’t a food critic. To do that, I declined having my picture taken even in some friends-and-family situations. Until now, my mug hasn’t appeared near my byline (just my headless torso). I’ll be glad to stop playing cat and mouse in public, where, as food critic Jonathan Gold once wrote, “I have become adept at pretending not to notice that a restaurant staff is pretending not to notice me noticing them noticing me.”\nSietsema estimates that he has written “1,200 full restaurant reviews, 50 dining guides, enough critic’s notebooks to fill a book or three, and thousands of reader Q&As.”\nIt’s a fun piece, especially if you enjoy reading about food. Sietsema adds, “Far from retiring, I’ve got plans to cook more, travel more and stay connected with fellow food enthusiasts.”\nBack on the air\nAfter a day of varying reports about whether or not he had been temporarily banned from ESPN, college football analyst Paul Finebaum was back on ESPN on Tuesday, making appearances on morning shows “Get Up” and “First Take.”\nOutkick’s Clay Travis claimed Monday that Finebaum was being kept off ESPN’s airways because of something that came up during an interview Finebaum did with Travis. In the interview, Finebaum said he had voted for President Donald Trump and he was considering running for the U.S. Senate in his home state of Alabama.\nFinebaum did appear the next day on ESPN and on the ESPN-owned SEC Network a few days after that. However, he did not make appearances on “First Take” and “SportsCenter” last week as many thought he would. That led to Travis’ claim that ESPN was banning him.\nAn ESPN senior spokesperson replied to Travis on social media, saying that Finebaum was never banned. Other reporting, including from Sports Business Journal’s Austin Karp, said Finebaum wasn’t banned and would be appearing on ESPN on Tuesday.\nIndeed, that is what happened.\nMedia tidbits\n- As NBC News and MSNBC make their split, here’s the latest happening at NBC News. It’s Variety’s Brian Steinberg with “Rebecca Blumenstein Expands NBC News Duties in Executive Reshuffle.”\n- The Washington Post’s Caitlin Gilbert, Richard Sima, Leslie Shapiro, Aaron Steckelberg and Clara Ence Morse with “How TikTok keeps its users scrolling for hours a day.”\n- Longtime Washington Post media critic Erik Wemple is now with The New York Times and writes, “Pentagon Relaxes Press Access Rules.” There’s a little more behind the headline here. Wemple writes, “Under the rules, journalists requiring credentials to the Pentagon will not need approval from the department before publishing articles with information not officially released. News organizations widely interpreted an earlier draft as requiring that approval, drawing their condemnation.” However, Wemple does add, “The draft does, however, outline rules under which journalists could be deemed ‘security risks’ and have their credentials revoked.”\n- Have you heard or seen the entertaining “I’ve Had It” podcast? The Guardian’s Rachel Leingang writes, “How two blond suburban moms gave Democrats an answer to the rightwing media ecosystem.”\n- For Nieman Lab, Alex Volonte with “Watchdog journalism’s future may lie in the work of independent reporters like Pablo Torre.”\n- A game show based on The New York Times’ Wordle word game is in the works, with Savannah Guthrie from NBC’s “Today” in line to host. It would be produced by Universal Television Alternative Studio and Jimmy Fallon’s Electric Hot Dog company. The Hollywood Reporter’s Rick Porter has more.\n- My Poynter colleague Jennifer Orsi with “Poynter launches AI Innovation Lab to house its growing AI portfolio.”\n- The Atlantic announced it is hiring Paul Beckett, former Washington bureau chief for The Wall Street Journal, as a senior editor. It has also hired writers Simon Shuster, Lily Meyer, Alex Reisner and Yvonne Wingett Sanchez.\n- Speaking of hires, The Wrap has hired veteran media journalist Michael Calderone as media editor. Calderone most recently was the editor at The Hive for Vanity Fair. And, before that, he was at Politico, where he wrote a superb media newsletter. Calderone wrote in a social media post that he will edit media coverage, but also report and write regularly.\n- And one more hire. Rachel Tashjian, most recently the fashion critic for The Washington Post, is joining CNN as a senior style reporter. Variety’s Brian Steinberg has more.\nHot type\n- Thanks to the Muck Rack newsletter, I was alerted to this beautiful essay in The Sun from Sy Safransky: “The Cat Who Woke Me Up.”\nMore resources for journalists\n- Interested in learning more about funding local news? Start here.\n- Amp up your editing skills, improve your work life and advance your career with Poynter’s ACES Certificates.\n- Gain the skills to spot AI risks like bias, misinformation and hallucinations before they harm your work. Enroll now.\n- Stop wasting hours on repetitive tasks — automate them instead. Learn how.\n- Get training to track federal climate policy rollbacks and their local impacts. Enroll now.\n- Deepen your coverage of incarcerated women and women with incarcerated family members and get the chance to apply for one of five $10,000 reporting grants. Enroll now.\n- Master the tools to connect Washington decisions to local stories — essential coverage as the 2026 elections approach. Enroll now.\nHave feedback or a tip? Email Poynter senior media writer Tom Jones at tjones@poynter.org.\nThe Poynter Report is your daily dive into the world of media, packed with the latest news and insights. Get it delivered to your inbox Monday through Friday by signing up here. And don’t forget to tune into our biweekly podcast for even more.",
  "word_count": 2144,
  "scraped_at": "2026-02-14T12:13:19.837555"
}