{
  "article_id": "42396fe58f68",
  "url": "https://www.90min.com/posts/kim-little-age-has-changed-preparation-routine-for-finals",
  "title": "Kim Little admits age has changed preparation routine for finals",
  "date": "20230303T134500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Kim Little admits age has changed preparation routine for finals\nArsenal star Kim Little has admitted she probably thinks more now about big games in terms of mental preparation than she did in her younger days, with the Gunners set to go head-to-head with Chelsea in this season’s Conti Cup final on Sunday.\nLittle was 18 when she played in her first two finals for Arsenal – the League Cup and FA Cup in 2009 – during her trophy-laden first spell at the club. The Scot has remained one of the most decorated players of her generation, collecting silverware in the United States and Australia, as well as winning the Conti Cup and WSL since returning to north London in 2017.\nThat WSL title in 2019 remains Arsenal’s most recent trophy success.\nNow 32, she has seen enormous changes in the women’s game over the years that have made how players prepare for games a totally different process.\n“When I first played there was very little analysis and much less stats,” Little explained. “The detail is much more heightened nowadays because games are watched more and there is much more input from various perspectives to try and win the match.”\nAs far as the preparing mentally for a game of great magnitude, Little admitted that her younger self usually just went with the flow.\n“When you’re younger, I suppose maybe I thought less and kind of went with it. As you get older you just have a bit more perspective on how you can influence [the game] in different ways and also influence other people.\nREAD NOW\n“How I approach it is maybe slightly different, but I think that’s natural – it comes with age and different moments in your career.”\nConsistency over a number of years is one of the qualities that makes Little an inspiration to other players, including Chelsea captain Magdalena Eriksson ahead of Sunday’s final.\n“I admire Kim Little so much,” the Blues skipper said.\n“I feel like she has been around for so long but she’s not even that old. She’s been at the top of her game since she was really young and that is the most impressive thing in football – people who can sustain an extremely high level for a long period of time.\n“I think we can all find moments of greatness and have peaks, but the ones who can sustain have really achieved something. Kim is definitely one of them. She is massive for Arsenal, always tough to play against and impossible to win the ball off. Consistent in everything she does.\n“It’s something that inspires me to do the same.”\nLISTEN NOW\nPledgeball's Katie Cross & Canaries Trust's Sarah Greaves join Shebahn Aherne to have football's climate conversation about the success of Green Football Weekend. If you can't see this embed, click here to listen to the podcast!\nFor more from Jamie Spencer, follow him on Twitter!",
  "word_count": 488,
  "scraped_at": "2026-02-14T12:21:25.658039"
}