{
  "article_id": "4244d63a95a6",
  "url": "https://www.fourfourtwo.com/news/barcelona-make-statement-that-arsenal-target-is-not-for-sale-report",
  "title": "Barcelona make statement that Arsenal target is not for sale : report",
  "date": "20240914T004500Z",
  "domain": "fourfourtwo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Barcelona make statement that Arsenal target is not for sale: report\nBarcelona are reportedly not willing to entertain Arsenal's offer for their star midfielder\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nThe transfer saga involving Barcelona Keira Walsh continues as Arsenal look to bring the midfielder back to the Women’s Super League. Barcelona have reportedly insisted the 27-year-old is not for sale and will not leave the club before Friday night’s transfer deadline.\nThe England international joined Barcelona in 2022 for a then world-record fee from Manchester City after excelling in the WSL. She has since won back-to-back Liga F and Champions League titles in Catalonia, further establishing herself as one of the best players in the world.\nWalsh has been linked with a move to Arsenal throughout the summer after it emerged that she wanted to return closer to home, despite her success in Spain. Chelsea were also rumoured to be interested, but it now seems almost certain she will remain with Barcelona.\nVIDEO How Lee Carsley Has ALREADY Fixed England\nThe Telegraph via football.london claims Barcelona are not willing to sell one of their star players, even though Walsh has less than a year remaining on her contract and has informed the club she will not be extending her stay.\nThat could mean Barcelona lose Walsh on a free transfer next year, rather than cashing in on interest this summer. The Liga F champions might have been tempted to sell had they bought a replacement, but such a deal has not materialised.\nWalsh will likely stay at Barcelona for another season, by the end of which she will almost certainly have plenty of keen suitors, particularly if she wins more silverware.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nThe former City player spoke positively of her time at Barcelona back in April. She said: \"It's a special team to be a part of and I think the way they see the game has really helped me improve. I play a lot faster and see things differently.\n\"The main thing for me is defensively I have improved. My intensity off the ball is a lot better. A lot of people don't expect that when you come to Spain so much because you have so much possession, but that was one area that me and [coach] Jonatan [Giraldez] spoke about to focus on.\n\"Spanish players understand the game so well. People can talk about the competitive level, but if Barça played in other leagues, I still think they win most of the games quite comfortably. That is my opinion from playing with these players, who are all so special.\"\nMore Arsenal stories\nArsenal to move for European superstar, in wake of Martin Odegaard injury: report\nBen White's England stance revealed, following latest omission\nArsenal star Martin Odegaard injury update issued ahead of North London derby\nCallum is a football writer who has had work published by the likes of BBC Sport, the Independent, BT Sport and the Blizzard, amongst various others. A lifelong Wrexham fan, he is hoping Ryan Reynolds can lead his hometown club to the promised land.",
  "word_count": 629,
  "scraped_at": "2026-02-14T12:23:00.024666"
}