{
  "article_id": "42638d0491d3",
  "url": "https://www.bbc.com/news/articles/cy4g8935ezvo",
  "title": "Women amputee football team get set for first ever World Cup",
  "date": "20241102T091500Z",
  "domain": "bbc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Amputee world cup a 'pinch-yourself moment'\nHarry Smith has been the head coach of England's women's amputee football team for just two months, but on Saturday, the squad fly out to Colombia to take part in the sport's first ever World Cup.\n\"It's all been a bit mad,\" the 28-year-old laughed, as he told the BBC about the team's whirlwind experience getting to the tournament.\nThe Worcester coach said: \"It's a pinch-yourself moment really. When I got into coaching it was a dream of mine to represent my country.\n\"It doesn't get much better than that.\"\nThe team, which train in Nantwich, will play their first match on Monday against Peru.\n\"I think everyone's just incredibly excited now. We're going to a World Cup, which we never thought we'd be going to,\" Mr Smith said.\nThe games consist of seven a side, with each half lasting 25 minutes.\nMr Smith said: \"The rules don't change that much, the end goal is to get the ball at the back of the net.\n\"It's the sport everyone loves, the beautiful game, just in another format.\"\nThe team includes 16-year-old Annabel Kiki from Cannock, who plays as a striker.\nSpeaking about playing in the World Cup, she told the BBC: \"It means so much to me and all the girls here because life can be hard for so many people and it's about what you do with it.\n\"All these girls have just looked forward. I mean, we're going to a World Cup. I never ever ever thought I'd say that in my life. But I'm so proud of these girls.\"\nThe team have had lots of attention since appearing on BBC Breakfast, making more people aware of the sport.\n\"The general reaction is people are amazed how physical and skilful the sport is,\" Mr Smith said.\n\"People think it's very slow and not skilful - then they see the sport and go wow, look how skilful it is, how amazing the players are, how strong they are.\"\nThe team features players from all walks of life, some of whom became amputees through cancer or accidents, while others were born with limb deficiencies.\n\"We have girls from all ventures of life and when they come together, you get a huge sense of relatability between the girls,\" the 28-year-old said.\n\"That person understands what they have gone through and there's a huge sense of togetherness from the group.\n\"You can really feel that family environment when you walk into the training room, the girls really do care about each other.\n\"The past is in the past and they just focus on where they are now and the amazing opportunities that lie ahead. They're an amazing group and we are a family.\"\nHowever, it wasn't a straightforward journey to get the Lionesses to the first ever women's amputee football World Cup.\nThe team needed to raise £50,000 to take part in the ground-breaking tournament in South America.\nThey were half-way to their target until they appeared on BBC Breakfast, with the team then hitting their target overnight.\nSupporters included former England and Chelsea captain, John Terry, who donated money and kit to the team, as well as inviting them down to Stamford Bridge, where he trained with them and took them to a women's game at the grounds in the evening.\n\"He was incredibly impressed with the skill level of the sport,\" Mr Smith said.\n\"John’s been incredible. He picked up the story and helped share it, and the support he has given the girls has been fantastic as well.\"\nWhile the coach is thrilled that the team reached their fundraising target, he wants the team to have financial stability so they do not need to fundraise for each tournament they play in.\n\"It's about investing in the sport and the charity through sponsorships and media deals,\" he said.\n\"For them to recognise us as a sport and see the importance of it.\"\nFollow BBC Hereford & Worcester on BBC Sounds, Facebook, X and Instagram.",
  "word_count": 670,
  "scraped_at": "2026-02-14T13:05:27.501825"
}