{
  "article_id": "426fbd9b1881",
  "url": "https://www.dailymail.co.uk/tvshowbiz/article-13041999/gladiators-fans-scripted-wardrobe-malfunction-cast-members-not-good-originals.html",
  "title": "Gladiators fans fume as  scripted  wardrobe malfunction causes tournament to grind to a halt while viewers insist super - strong cast members not as good as 90s originals",
  "date": "20240203T221500Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "- READ MORE: The Gladiators' most gruesome injuries\nGladiators viewers were left infuriated during Saturday's episode after two of the super-strength cast members lost their shoes within minutes of the tournament starting.\nThis week saw four new members of the public appear on the show in the hope of triumphing over the Gladiators.\nBut the competition ground to a halt when referee Mark Clattenburg blew his whistle to stop the game after Phantom lost his shoe.\nA little while later, another Gladiator lost a shoe as they chased a contender up The Wall.\nThe moments left viewers unimpressed, with many taking to social media as they called on show bosses to give the Gladiators shoes that don't slip off so easily, while others insisted such an incident would never have happened during the 90s original version of the programme.\nGladiators viewers were left infuriated during Saturday's episode after two of the super-strength cast members lost their shoes within minutes of the tournament starting\nBut the competition ground to a halt when referee Mark Clattenburg blew his whistle to stop the game after Phantom lost his shoe (left)\nViewers were missing the 90s original cast Jet [Diane Youdale] Flame [Kimbra Standish] and Phoenix [Sandy Young] with Wolf [Michael Van Wijk]\nReferee Mark told the audience at the Utilita Arena Sheffield: 'Because the Gladiator lost the shoe, we had to delay the match.'\nTaking to Twitter, one person wrote: 'Can we just get back to being a competitive show rather than this scripting s**t please. Sick of seeing the Gladiators allowing them to win on the wall pretending they can't grab them or pulling their shoes off.'\nWhile someone else shared: 'I don’t remember in the 90s so many shoes being pulled off on the wall.'\nAnother person wrote: 'Can we get some shoes that don't come off at the slightest amount of pull being applied please!'\n'Think we can all agree, the shoes come off far too easily,' posted someone else, while another person commented: 'So a loss of a shoe caused a delay. Interesting.'\nSomeone else joked: 'New drinking game. Take a drink every time someone loses a shoe on #Gladiators.'\n'What the actual heck... Shoe #2 lost today,' asked another viewer.\nWhile someone else shared: '\"Gladiator has lost a shoe.\" Jet and Wolf would NEVER have lost a shoe.'\nViewers urged show bosses to sort out the costumes\nSomeone else wrote: 'Diamond and Electro that was terrible, the female #Gladiators looked like they were both struggling and another shoe lost!'\nAnd someone else posted: 'The Gladiators are obviously not trying to get them off the wall. 2/10 must try harder.'\nWhile another person asked: 'Are the gladiators not as good as the originals or is my memory altered by nostalgia? They used to fly up that wall and catch the contestants.'\nThis is not the first time viewers have criticised the Gladiators since the reboot started last month.\nLast week, Viper broke the show's rules for a second time as he hit a contestant before the game started.\nMore than three decades since the show first launched, Gladiators returned to screens earlier this moth with a brand new group of superhuman-like athletes challenging members of the public to take them on.\nOne challenge in this week's instalment named Duel saw Viper take on contestant Ash as they attempted to knock each other off a podium.\nBut Viper lashed out before the whistle was blown to signal the start of the game, prompting the referee to disqualify him, leaving Viper very unimpressed and looking like he was going to attack the umpire.\nGladiators' Viper broke the show's rules for a second time during Saturday's episode as he hit a contestant before the game started\nViper lashed out before the start of the game, prompting the referee to disqualify him, leaving Viper very unimpressed and looking like he was going to attack the umpire\nHowever, many fans weren't convinced, with some say he should be removed from the show for breaking the rules while others insisted it was a 'scripted' performance, branding the programme 'pantomime'.\nOne person wrote on Twitter: 'Obsessed with viper being scripted to break the rules every other episode.'\nWhile someone else shared: 'Is this a bit too much pantomime now with viper and the blatant rule breech and the ref calling him out?'\n'#Gladiators said it before pantomime on the telly #viper #dual,' wrote someone else.\nThey should get rid of Viper completely, that twice he’s broken the rules now.\nWhile another show fan posted: 'Viper is really relishing playing a rule breaker.'\nSomeone else shared: 'You'd never see any of the \"real\" gladiators behave like a child #viper #Gladiators #gladiatorsuk.'\nAnd another audience member at home commented: 'They need to get rid of Viper. He’s been useless every event he’s done. He’s not even a good villain.'\nHowever, Viper wasn't the only Gladiator to break the rules during the episode - during the Gauntlet challenge Steel was disqualified for holding on to Ash and not letting him go.\nHowever, many fans weren't convinced, with some say he should be removed from the show for breaking the rules while others insisted it was a 'scripted' performance\nThe referee again blew the whistle and paused the game, telling Steel he was out.\nGladiators viewers hit out at cast member Viper during the reboot launch earlier this month as they compared him to 90s original Wolf.\nFans of the show, which now airs on BBC One, were quick to make comparisons to the original programme which ran from 1992 to 2000 on ITV.\nAfter watching him flex his bulging biceps and attempt to intimidate his competitor, many members of the audience were unable to stop themselves drawing comparisons between Viper and Wolf.\nBut it seems Viper's efforts left a lot to be desired, with many taking to social media to insist his performance was not a patch on Wolf.\nOne person wrote: 'So I guess Viper is the new Wolf on #Gladiators.'\nWhile someone else shared: 'Viper trying to be the new Wolf. No one will ever compare.'\n'I was enjoying #Gladiators until they just manufactured some excuse to make Viper the new Wolf. Way too contrived,' remarked someone else.\nGladiators viewers hit out at cast member Viper (pictured) the series launch as they compared him to 90s original Wolf\nAfter watching him flex his biceps and attempt to intimidate his competitor, many members of the audience were unable to stop themselves drawing comparisons between Viper and Wolf (Wolf pictured in 1995)\nFans of the show, which now airs on BBC One, were quick to make comparisons to the original programme which ran from 1992 to 2000 on ITV (front L-R: Gladiators host Bradley Walsh and Viper)\nIt seems Viper's efforts left a lot to be desired, with many taking to social media to insist his performance was not a patch on Wolf\n'#Viper a poor man's #Wolf trying to be the bad boy #Gladiators,' wrote someone else.\nIt comes after Gladiators legend Wolf gave his view of the reboot of the iconic show.\nBBC has revived the series with a whole new cast of Gladiators, but Wolf, real name Mike van Wijk, has claimed he contacted the broadcaster to offer his services and was snubbed.\nThe new series kicks off on January 13 with Bradley Walsh and his son Barney as hosts.\nThe original Gladiators, which aired on ITV, was cancelled in 2000 but Wolf has revealed he was keen to return to the show that made him famous.\nMike, 71, told GBNews: 'I really enjoyed doing it and to be perfectly honest with you, all joking aside, I could do it right now. I'm 71 years old. I'm 71 years old and fit. I'm strong. I've never stopped training.\nGladiators legend Wolf, real name Mike van Wijk (pictured), has given his view of the reboot of the iconic show, claiming he contacted the broadcaster to offer his services and was snubbed\nHe added: 'I wanted to take part in some shape or form in the new series, or even be a co-host, but when I contacted them, I got no reply.'\n'I think they basically wanted to get away from everything to do with the original show and just do it their own way, which is understandable.'\nDespite the snub, the star is enthusiastic about the reboot, adding: 'I think it's fantastic. I think it's going to be a lot harder for them this time around because of Netflix and Prime and there's a lot of competition. Whereas before we didn't have all that.'\n'I couldn't go anywhere. I couldn't even go to a shopping mall. I'd be mobbed. I never envisioned it was going to be that big. You just don't realise the power of television.'\nSpeaking to Andrew Pierce and Ellie Costello, he continued: 'Basically, it was a family show. Grandma could sit down with the children and their children and it was just the whole family show.\n'There weren't many family shows out at the time and it captured the market.'\nAsked whose idea it was for him to play the bad guy, he said: 'It was my idea but, because when they said to me your name is going to be Wolf - they chose the names, we had no say in that.\n'It was fantastic for me because the character was so strong. They kept me on the show for the whole eight years.'\nGladiators fans were left delighted on Christmas Day when the hotly-anticipated trailer for the reboot finally dropped.\nThe Gladiators, who consist of Olympians and bodybuilders, were dressed in matching metallic outfits which all bore their unique logo and nickname by which they will be known.\nIn the first look at the series, the formidable seventeen showcased their bulging muscles as they took on a number of challenges against civilians.\nGladiators fans were left delighted on Christmas Day when the hotly-anticipated trailer for the reboot finally dropped, with hosts Bradley Walsh and his son Barney starring as hosts\nOut with the old: The original cast in 1998 (Back row - left to right: Warrior, Raider, Hunter, Saracen, Trojan. Second row - left to right: Falcon, Rhino, Cobra, Nightshade, Wolf, Panther. Front row - left to right: Amazon, Vogue, Lightning, Jet, Zodiac)\nThe live audience were seen going completely wild as the Gladiators took on intense challenges including wrestling, scaling climbing walls and swinging through the air from suspended rings.\nThe fearsome group includes trained rugby players, accomplished swimmers, sprinters and powerlifters who will battle contenders at Sheffield Arena.\nContestants will face the unenviable task of facing the Gladiators in the ultimate test of speed and strength in a series of brand new games alongside some returning classics, among them fan-favourite The Eliminator.\nGladiators continues Saturday 10 February at 5.50pm on BBC One and BBC iPlayer.\nMost watched News videos\n- Extraordinary moment mass brawl breaks out between Brits on flight\n- Finance expert's TV interview interrupted by adorable granddaughter\n- Moment driver veers to target e-bike riders before killing teen\n- Moment Swiss bar fire owners collapse after being confronted\n- Astonishing moment a street is swallowed by a sinkhole\n- Chilling police interview of ISIS fanatic plotting UK attack\n- Food vlogger dies after 'eating toxic devil crab'\n- Spy cam shows woman on her knees next to Jeffrey Epstein\n- Deepak Chopra confronted over his relationship to Epstein\n- Toddler opens car door in traffic and sends biker flying\n- New video shows man with backpack similar to Guthrie kidnapper\n- Israeli hostage reveals how she survived being tortured",
  "word_count": 1942,
  "scraped_at": "2026-02-14T13:11:59.163150"
}