{
  "article_id": "427017ab23b5",
  "url": "https://www.sbs.com.au/news/podcast-episode/widespread-misconduct-anz-hit-with-major-fine-midday-news-bulletin-15-september-2025/gcu6gutyg",
  "title": "  widespread misconduct  ANZ hit with major fine | Midday News Bulletin 15 September 2025",
  "date": "20250915T030000Z",
  "domain": "sbs.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Key Points\n- ASIC asks Federal court to fine ANZ $240 million\n- New climate risks revealed as government considers 2035 emissions target\n- Stellar return for Sam Kerr, scoring 100th goal for Chelsea\nListen to Australian and world news, and follow trending topics with SBS News Podcasts.\nANZ bank has admitted to engaging in unconscionable conduct in services it provided to the Australian government, according to the Australian Securities and Investment Commission.\nASIC says ANZ incorrectly reported bond trading data, overstating volumes by tens of billions of dollars, and engaged in widespread misconduct impacting nearly 65,000 customers.\nThe misconduct included failing to respond to customer hardship notices, making false and misleading statements about its savings interest rates, and failing to pay the promised rate.\nASIC also says ANZ failed to refund fees charged to thousands of dead customers and neglected to respond to loved ones trying to deal with deceased estates within time limits.\nThe regulator will ask the Federal Court to impose penalties of $240 million.\nAddressing the media, ASIC Chair Joe Longo said the penalty was justified as it should be a deterrent for such behaviour.\n\"Time and time again, ANZ has betrayed the trust of Australia. The issues we have found in the bank's departments are a combination of widespread misconduct, repeated failures and an unacceptable disregard for the trust customers put in the banks.\"\n---\nNewly released climate research shows that coastal hazards driven by climate change could put three million people at risk by 2090, if Australia warms by 3 degrees.\nThe National Climate Risk Assessment has been released today, as the government prepares to announce its carbon emissions' reduction target for 2035.\nThe report warns extreme weather in the future will be different from the past, and history won’t be a good guide of what to expect.\nMinister for Climate Change and Energy Chris Bowen says the report shows how the cost of inaction will always outweigh the cost of action.\n\"There isn't an Australian community that isn't impacted by climate change going forward, and there isn't an Australian individual for whom those impacts won't be real and material. So, at a time when the political debate is is focused on the costs of action, both real and imagined, this report is a reminder, if we needed one ever, that the cost of inaction will always outweigh the cost of action.\"\n---\nNew South Wales Liberal leader, Mark Speakman, says he will continue to give the top job 'his best' as speculation grows over whether his colleagues could mount a leadership challenge.\nIt comes as Labor picks up another seat in parliament, winning the Kiama byelection over the weekend.\nThe seat of Kiama was previously held by former M-P, Gareth Ward, who was convicted of sexual offences.\nMr Speakman told ABC this created a drag on the Liberal vote, saying the disappointing result is not a reflection on the strength of his position.\n\"Not at all. Not at all. I'm the best person for the job. I've got the experience I think I've got the principles, and I think the practical application to take the party to the next election.\"\n---\nPresident Donald Trump says the U-S may be willing to strengthen sanctions on Russia, if European countries pursue stronger measures.\nIt comes as Russian authorities claim the most recent attack from Ukraine involved 361 drones and started a fire at a major oil refinery.\nTensions have been rising in Europe for the past week, after Russian drone incursions in Poland and Romania - both NATO countries.\nMr Trump says 19 packages of E-U sanctions on Russia - most recently targeting the oil price cap - are not enough to shift the dial.\n\"Well, they're not doing the job. NATO has to get together. Europe has to get together and do look, Europe is they're my friends, but they're buying oil from Russia. So we can't be expected to be the only ones that are, you know, full full bore Europe is buying oil from Russia. I don't want them to buy oil, and the sanctions that are putting that they're putting on are not tough enough, and I'm willing to do sanctions, but they're going to have to toughen up their sanctions commensurate with what I'm doing.\"\n---\nMatildas superstar Sam Kerr has made a stunning goalscoring return after a 20-month injury absence, netting her hundredth goal for her English club side Chelsea.\nAfter being kept on the bench for the opening fixture of the Women's Super League against Manchester City, Kerr was finally unleashed as a late substitute in Sunday's 3-1 victory at Aston Villa.\nThe 32-year-old hasn't played for the Blues since January 2024 because of a chronic A-C-L injury, but immediately made her presence felt at Villa Park by netting the third goal.\nKerr reacted to her milestone goal in a video posted by Chelsea.\n\"Oh, my God, it's massive. When I signed for Chelsea, I never, ever thought I would score a hundred goals, and to do it for such a massive club like Chelsea - and a club that I love so dearly - it's an amazing achievement and something I'm really proud of. I mean, I don't really reflect too much on my goals, but to score a hundred for Chelsea is something that I'll keep with me forever.\"",
  "word_count": 893,
  "scraped_at": "2026-02-14T12:43:41.265804"
}