{
  "article_id": "4279d6661be8",
  "url": "https://www.broadcastnow.co.uk/broadcasting/google-pixel-kicks-off-fa-deal-with-england-bts-series/5183475.article",
  "title": "Google Pixel kicks off FA deal with England BTS series",
  "date": "20230626T103000Z",
  "domain": "broadcastnow.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Chelsea’s Lauren James will work with the company’s campaign\nGoogle Pixel is launching its mobile phone and earbud partnership with the FA with a behind-the-scenes content series.\nPitchside, Presented By Pixel, will include long-form storytelling taking fans behind-the-scenes with both the men’s and women’s England teams, as well as feature fan-led stories showcasing England match days.\nPixel will also work with the FA on increasing visibility for women’s football through creating women’s football content. It is also partnering with Chelsea and England’s Lauren James, who will front Google’s Football On Pixel campaign throughout the summer and beyond.\nFan experiences at Wembley will also be targeted by Google, including the use of “AI-powered technology”, according to the company. This will begin with new ways to access information about the tournament - from match schedules to athlete highlights and more - through Search.\nGoogle Cloud has already been an FA partner since 2019.\nEileen Mannion, vice president of marketing at Google UK, said: “Football is more than just a sport in the UK, it’s deeply rooted in our heritage. It’s not only part of our vibrant and diverse culture; it brings people together, generating excitement and building strong communities. We are proud to be partnering with the Football Association (The FA) to help fans create memories together. Phones are such an integral part of the modern sports experience, and we’re thrilled to work with The FA to get fans closer to the action of our incredible men’s and women’s teams more than ever before.”\nFA commercial director Navin Singh added: “We’re delighted to welcome Google Pixel on board as our official mobile phone and earbuds partner. We’re passionate about connecting our supporters with our England teams, and this partnership will bring fans and players closer together through content delivered by leading technology. We thank Google Pixel for their support.”",
  "word_count": 307,
  "scraped_at": "2026-02-14T12:54:42.257648"
}