{
  "article_id": "428b7ee0dd1e",
  "url": "https://www.independent.co.uk/arts-entertainment/tv/features/gary-lineker-match-of-the-day-b2645432.html",
  "title": "Match of the Day and BBC will miss Gary Lineker urbane presence – the feeling is not mutual",
  "date": "20241112T164500Z",
  "domain": "independent.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Match of the Day and BBC will miss Gary Lineker’s urbane presence – the feeling is not mutual\nGary Lineker is leaving ‘MOTD’ at the end of this season, after a glittering 25-year tenure as the host of the BBC’s flagship football show. Nick Hilton looks back at the pundit’s highs and lows, from predatory striker to top broadcaster and media mogul\n- Bookmark\n- CommentsGo to comments\nWhen Des Lynam hung up his moustache and walked away from the Match of the Day presenting gig in 1999, BBC bosses were faced with a conundrum. Lynam was popular with viewers and a sporting polymath but had jumped ship for ITV after they doubled his pay. Who could fill his boots on such a shoestring budget?\nThe answer was Gary Lineker. Described by the BBC, at the time, as having a “relaxed style”, Lineker was already familiar to viewers thanks not only to a stellar on-pitch career, but various presenting jobs across the corporation. He had appeared on Radio 5 Live and Grandstand, as well as a stint as a captain on They Think It’s All Over, a comedy panel show. And as the lights came up on the 1999/2000 Premier League season, he found himself in one of the biggest jobs in football media, presiding over the flagship highlights package of a season that featured 23 goals from his future sofa-mate, Alan Shearer. It was the start of a glittering 25-year tenure in the role – which the BBC has confirmed will conclude next May – that would turn him from a predatory striker to one of the nation’s top broadcasters, and then into a powerful, and often controversial, media mogul.\nLineker was born in 1960 in Leicester – a city famous in the Sixties for the creatives, like Joe Orton and Graham Chapman, who had run away from it – and there was little in his childhood to point to future footballing stardom. As a teenager he captained the Leicestershire Schools cricket team – yes, cricket – for five years, believing he’d have “more chance afterwards in cricket than football”.\n“I wasn’t a great lover of school,” he wrote in 2010. “If I’d known how difficult it was to be a footballer, I’d have worked harder at school. I did OK, but my mind was elsewhere.” Elsewhere soon became a reality: Lineker joined the ranks at Leicester City in 1976, beginning a love affair with the club that would, eventually, see him sat in boxer shorts on primetime television (more on that to follow). Standing at 5ft 10in with jug-ears and a slender build, Lineker was a very modern striker, a fox in the box. His first seasons as a professional footballer saw him cement his reputation as a natural in front of goal, steering the club to promotion to the First Division in 1983. The next season, he was the second top scorer in the highest echelon of English football and secured a big money move to the league’s defending champions, Everton in 1985.\nWherever he went, Lineker scored goals. In 1986, he moved to Barcelona off the back of an exceptional World Cup where he scored a famous hat-trick against Poland and ended with the Golden Boot. Three prolific seasons in La Liga were followed by a return to England, joining Tottenham Hotspur. Throughout this period, he continued to score for fun with the Three Lions. His four goals at Italia ’90 helped propel England to semi-final misery (Lineker is also fondly remembered for accidentally relieving his bowels during a group stage draw with the Republic of Ireland). Over the course of the eight years Lineker spent as part of the England set-up, he scored 48 goals, leaving him just behind Bobby Charlton as the country’s all-time leading goal scorer. He now sits in fourth place.\nThat list puts him behind players like Harry Kane and Wayne Rooney, but unlike those men who would become his meaningless statistical rivals, Lineker was cultivating a considered media presence throughout his playing career. By the time he moved to Japanese club Nagoya Grampus Eight in 1992, he was widely admired for his intelligence on and off the field. “It’s more like chess than football against Gary,” Danish defender Kent Nielsen once said. But the growing stardom came with downsides: after Lineker missed a penalty against Brazil in 1992, England coach Graham Taylor remarked that “when somebody’s almost a national institution, it’s almost as if you can’t touch them”. It was, in many ways, the beginning of the end of Lineker’s playing days.\nAh, well – Lineker was already looking to his post-retirement career. In 1990 he appeared on Desert Island Discs, one of the few active footballers to appear on the show. “He is one of the best ambassadors of our national game,” host Sue Lawley said, rather fawningly. Simply Red, Dire Straits, U2 – even “Candle in the Wind” by Elton John – Lineker’s choices were the sort of everyman playlist that politicians waste thousands of pounds focus grouping. “I enjoy media work,” he told Lawley when pressed on his plans for the future. “It goes back to the journalistic idea: if you can’t do it then that’s perhaps the next thing.” In 1994, he signed a deal with crisp manufacturer Walkers, which would go on to become one of the most synonymous brand partnerships in British advertising history, and, from 1995, he was a regular across the BBC. In the early 1990s, he reached new audiences by fronting the BBC’s golf coverage from The Open and the Masters. “It’s been a bit like my football,” he mused, when asked about his increasing ubiquity. “I’ve made my runs into space at the right time.”\nNow, looking back at a quarter century at the rudder of Match of the Day, you can easily see why Lineker has been such an effective steward for the programme. He has an easy, self-effacing charm, preferring to encourage the strong opinions of his panel – which has, over the years, featured tough nuts like Alan Hansen and Martin Keown – rather than offer his own. His “banter” (a prized commodity within the footballing ecosphere) with Ian Wright and Alan Shearer evolved the programme into a more digestible light entertainment show, even while the sport itself was becoming ever more megabucks and data driven.\n“Any good?” he quipped on his first appearance on the show, “have I got the job?” Under his charge, Match of the Day would bear witness to the changing footballing climate, from the rivalry of Alex Ferguson’s Manchester United and Arsene Wenger’s Arsenal, to the rise of petro-state superpower Manchester City. When the Covid-19 pandemic disrupted the 2020/21 season, Lineker scrambled to fill the schedule, launching a spin-off podcast and, in June 2020, anchoring coverage of the first Premier League clash to be broadcast live on the BBC, Bournemouth vs Crystal Palace. But perhaps no moment from his term is as iconic as when his beloved Leicester City won the title in 2016, and Lineker made good on a Twitter promise to present the show in just his underwear, allowing a generation of mums to ogle this half-dressed, svelte Paul Hollywood.\nWatch Apple TV+ free for 7 day\nNew subscribers only. £9.99/mo. after free trial. Plan auto-renews until cancelled.\nADVERTISEMENT. If you sign up to this service we will earn commission. This revenue helps to fund journalism across The Independent.\nWatch Apple TV+ free for 7 day\nNew subscribers only. £9.99/mo. after free trial. Plan auto-renews until cancelled.\nADVERTISEMENT. If you sign up to this service we will earn commission. This revenue helps to fund journalism across The Independent.\nBBC bosses were good-humoured about this social media boast, but Lineker’s relationship with the corporation was changing. His clean-cut image – cemented by a playing career in which he never received so much as a single yellow card – had evaporated after an expensive divorce from his first wife Michelle, which was followed, in 2009, by a whirlwind, and short-lived, marriage to Danielle Bux, a glamour model 18 years his junior. In 2017 he was named in the Paradise Papers disclosures about tax avoidance schemes, a revelation that rankled as he was widely reported to be the BBC’s highest paid contractor. Year after year, as the BBC made its mandated pay disclosures, Lineker topped the charts with a consistency that Arab sovereign wealth funds could only dream of. In the 2023/24 release, Lineker was revealed to be earning around £1.35m per year.\nDespite never actually being an employee of the BBC (a fact that was relevant to his successful tax appeal against HMRC in 2023), Lineker was the face of much of its sports coverage. But away from the studio he was unleashing his own, deeply political, voice. He tweeted on a range of subjects: Trump (“it ain’t funny”), Farage (“a dick!”), and Piers Morgan (“your ability to continually tweet from deep inside Trump’s bowels is rather impressive”). In 2016 he publicly endorsed Remain in the Brexit debate, and would go on, in 2018, to support the People’s Vote campaign to relitigate the result of that referendum.\nBut perhaps nothing he wrote during this period was as influential as his tweet on 19 June 2017, when he asked a question challenging the establishment. “Anyone else feel politically homeless?” he called to his followers. “Everything seems far right or way left. Something sensibly centrist might appeal?” While this prompted speculation that he might chance a foray into politics – maybe even start his own party – the impact was simpler. It blew the whistle, kicking off the creation of a media brand that would embrace the pejorative “centrist dad” tag and run with it.\nPerhaps if the BBC had not been fighting fires on so many fronts – from the Huw Edwards scandal to the sacking of Lineker’s co-worker, Jermaine Jenas – the relationship would’ve ended sooner\nGoalhanger Films had been incorporated back in 2014 to provide Lineker with a production vehicle for specialist sports documentaries. In 2020 they launched their first show, the podcast The Rest is History, with popular historians Tom Holland and Dominic Sandbrook, which was followed in 2022 by The Rest is Politics, in which Lineker paired his old People’s Vote mucker Alastair Campbell with former Tory MP Rory Stewart. The show has been a stellar success, reputedly amassing 700,000 listens per episode (an unthinkable figure in this space) and selling out stadium venues like the Royal Albert Hall and London’s O2 arena.\nAs The Rest Is universe has grown – to now include The Rest is Entertainment and The Rest is Money – so too has Lineker’s friction with the Beeb. In 2023, he launched The Rest is Football, which he co-hosted with MOTD stablemates Micah Richards and Alan Shearer. The similarity to the Match of the Day: Top 10 podcast (hosted by the unlikely trio of Gary Lineker, Micah Richards and Alan Shearer) did not go unnoticed. Nor did his tweet, in March 2023, calling Suella Braverman’s small boats rhetoric “an immeasurably cruel policy directed at the most vulnerable people in language that is not dissimilar to that used by Germany in the Thirties”.\nAfter this tweet – and a short suspension that saw Lineker’s high-profile colleagues strike in support – the writing was on the wall. “Gary will abide by the editorial guidelines,” the BBC’s director general, Tim Davie, announced, as Lineker was shuffled back on air. But the relationship was tarred. Every political opinion that Lineker offered was pored over; almost all became fodder for tabloid hit pieces. Perhaps if the BBC had not been fighting fires on so many fronts – from the Huw Edwards scandal to the sacking of Lineker’s co-worker, Jermaine Jenas – the relationship would’ve ended sooner.\nAs it is, the chapter will close at the end of this season. The plan remains for Lineker to stay on for selected coverage, such as the FA Cup final and the 2026 World Cup in Donald Trump’s America, but he will cease to be that reassuring, weekly presence on BBC One. Lineker will be remembered, fondly, as a terrifically urbane ex-pro and someone who did wonders for the public image of footballers. But with so much unrealised potential in his fast-growing role as a media magnate, it is hard not to suspect that Match of the Day will miss Lineker far more than he will miss those late Saturdays, under the harsh glare of both the studio lights and national scrutiny.\nJoin our commenting forum\nJoin thought-provoking conversations, follow other Independent readers and see their replies\nComments",
  "word_count": 2104,
  "scraped_at": "2026-02-14T12:52:51.670868"
}