{
  "article_id": "428c21d54f23",
  "url": "https://menafn.com/1105551876/Scaloni-Ancelotti-Guardiola-On-FIFA-Coach-Award-Shortlist",
  "title": "Scaloni , Ancelotti , Guardiola On FIFA Coach Award Shortlist",
  "date": "20230209T200000Z",
  "domain": "menafn.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "(MENAFN- The Peninsula) AP\nZurich: Lionel Scaloni, Carlo Ancelotti and Pep Guardiola were shortlisted on Thursday for a 'best coach” award, while Walid Regragui didn't get enough votes despite leading Morocco on a stunning run to the World Cup semifinals.\nA worldwide selection panel of national team coaches and captains, plus selected media and fans voting online chose Scaloni of Argentina, Real Madrid's Ancelotti and Manchester City's Guardiola as finalists for FIFA's Best Men's Coach award for 2022.\nZurich: Argentina won the World Cup, Madrid won the UEFA Champions League and City captured the English Premier League title.\nRegragui was appointed in August less than three months before the World Cup started and led his team unbeaten through a group that included Belgium and Croatia. Morocco then eliminated Spain and Portugal before an injury-stricken team lost to defending champion France. During the run, Regragui had voiced concerns about a lack of respect for Arab coaches.\nNo coach from Africa or of an African team has ever been voted into a top-three shortlist since the first FIFA coaching award was made in 2010.\nRead Also world cup winner martinez in line for fifa best keeper award fifa rules panel to debate more stoppage time in games fifa establishes football agent working group\nOnly European and South American coaches have ever finished in the top-three places despite two-thirds of the voting panel members coming from outside the continents.\nScaloni is a likely favorite to get the award on Feb. 27 in Paris after World Cup-winning coaches Didier Deschamps and Joachim Löw also won the FIFA votes for 2018 and 2014, respectively.\nAfter winning the 2010 World Cup, Spain's then-coach Vicente del Bosque was just beaten in the FIFA-organized vote by José Mourinho, whose Inter Milan team had won the Champions League and Serie A.\nGuardiola won the FIFA coaching award for 2011 when he was with Barcelona. Ancelotti has never won; he was runner-up in 2014 to Löw for winning a Champions League in his first spell with Madrid.\nOn the women's coaching award shortlist Thursday, two-time winner Sarina Wiegman - who won the 2017 and 2020 votes for coaching her native Netherlands - seeks a third FIFA win for leading England to the European Championship title last year.\nAnother European champion, Sonia Bompastor, who guided Lyon to a sixth Women's Champions League title in seven years, is on the list that is completed by Pia Sundhage. She led Brazil to win the 2022 Copa América Femenina.\nSundhage won the FIFA award for 2012 as coach of the United States' Olympic champion team.\nFIFA is scheduled to announce the three-candidate shortlists Friday for the men's and women's Best Player award.",
  "word_count": 448,
  "scraped_at": "2026-02-14T13:01:55.969938"
}