{
  "article_id": "42928b908a51",
  "url": "https://www.90min.com/posts/why-premier-league-doesnt-use-semi-automated-offsides",
  "title": "Why the Premier League doesnt use semi - automated offsides",
  "date": "20231001T143000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Why the Premier League doesn't use semi-automated offsides\n- Luis Diaz had a goal wrongly disallowed for Liverpool against Tottenham after \"significant human error\"\n- Semi-automated offsides reduce the role of VAR in the decision-making process\n- The system has been used in the World Cup and Champions League\nThe former Premier League referees' chief Keith Hackett had little time for any criticism of match officials.\n\"It's a little bit like me advising Lionel Messi on how he can improve his performance and where he went wrong,\" Hackett argued, pointing to the tiny fraction of decisions that referees actually get wrong.\nYet, Messi has rarely made a blunder as egregious as incorrectly ruling a player offside despite the benefit of numerous video replays.\nLuis Diaz's disallowed goal for Liverpool against Tottenham Hotspur at the end of September was the most glaring - but hardly isolated - example of video assistant referees (VARs) failing to accurately make an offside decision. PGMOL blamed \"significant human error\".\nA semi-automated offside system is utilised across European football but was shunned by the Premier League ahead of the 2023/24 season. Here's everything you need to know about the technology that could have saved the Premier League's match officials from some justified criticism.\nWhat are semi-automated offsides?\n\"We expect that semi-automated offside technology can take us a step further,\" FIFA’s referee chair Pierluigi Collina said in July 2022. \"Sometimes, the process to check a possible offside takes too long, especially when the offside incident is very tight. This is where semi-automated offside technology comes in - to offer faster and more accurate decisions.\"\nA dozen cameras are dotted across the roof of stadiums collecting information from 29 data points on a player's body 50 times every second. A sensor in the middle of the ball, which produces 500 readings per second, detects precisely when contact has been made. This mountain of data is almost instantaneously parsed by AI-powered software.\nThe final decision still falls into the fallible hands of a human - this is where the \"semi\" comes into it. These officials will have to decide which players are actively interfering with play.\nThis still leaves plenty of scope for controversy. Earlier this season, Nathan Ake's goal for Manchester City against Fulham was allowed to stand even though an offside Manuel Akanji blocked Bernd Leno's view. Current referees chief Howard Webb later conceded that it was a \"clear\" error.\nWhy doesn't the Premier League use semi-automated offsides?\nThe decision to use semi-automated offsides didn't even make it onto the agenda of the Premier League's Annual General Meeting in mid-June. All clubs, as shareholders of the league, have a right to vote on various decisions and came to the conclusion that they didn't need to discuss the new tech in depth.\nThere were concerns among the league's executives that the system - which FIFA began trialling in November 2021 - would soon become outdated.\nIt was a surprising call given that the Premier League suffered multiple refereeing errors regarding offside decisions last season. Four additional VAR cameras were added to eliminate the blind spots that cropped up last term but the Premier League still come across as Luddites compared to the rest of Europe.\nWhich competitions do use semi-automated offsides?\nThe 2022 Club World Cup and that summer's UEFA Super Cup were among the first competitions to deploy the technology. But it wasn't until FC Copenhagen's Rasmus Falk strayed beyond the deepest Borussia Dortmund defender in last year's Champions League group stage that a major goal was ruled out semi-automatically.\nThe Champions League, Europe's premier club competition, have employed the advanced system - with ten cameras instead of 12 - since September 2022.\nPerhaps with the embarrassing memory of Arkadiusz Milik's wrongly disallowed goal for Juventus against Salernitana still fresh, Serie A were so keen to bring in semi-automated offsides that the league introduced the system midway through the 2022/23 campaign.\nThe most recent editions of both the men's and women's World Cup had AI on their side while La Liga were scheduled to use it at the start of the current campaign before delaying until next season.",
  "word_count": 691,
  "scraped_at": "2026-02-14T12:40:58.188925"
}