{
  "article_id": "4295c7c790e5",
  "url": "https://punchng.com/plumptre-joins-benzema-at-al-ittihad/",
  "title": "Plumptre joins Benzema at Al - Ittihad",
  "date": "20230914T003000Z",
  "domain": "punchng.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Super Falcons defender Ashleigh Plumptre has joined Saudi club Al-Ittihad on a free transfer, having left Leicester City.\nMen’s Saudi Pro League teams have spent eye-catching sums in the transfer window, with Al-Ittihad’s recent additions including Karim Benzema and N’Golo Kante.\nPlumptre, who played all four Nigeria matches at the 2023 Women’s World Cup, is one of the Saudi Women’s Premier League’s high-profile signings.\nThe versatile player departed Leicester City, where she spent the last three seasons, following the expiration of her contract at the King Power Stadium at the end of last season.\nPlumptre played a key role for Leicester last season as the club finished 10th on the log to escape relegation.\nThe Nigerian scored her only goal of the season in Leicester City Women’s 4-0 rout of Liverpool Ladies in their Barclays Women’s Super League game in May.\nShe continued her impressive form at the Women’s Cup for Nigeria and almost got on the score sheet against England in the round of 16 but saw her well-taken shot hit the woodwork.\nPlumptre’s impressive performance at the World Cup means it was only a matter of time before clubs came calling for her signature.\nOn Wednesday, the 25-year-old announced on social media that she had joined Al-Ittihad.\n“Grateful to have signed for Al-Ittihad. Excited to start this journey alongside some incredible human beings. My journey of stepping into more of myself continues. It’s more than football.”\nIn her first interview with the club, she said, “Football for me has always been about connecting with not only more of myself but with the people that I’m surrounded by, whether that’s my teammates, staff.\n“Throughout, everything I’ve done in my career so far has always been about representing something bigger than myself.\n“Joining Al-Ittihad I feel as if I’m going to have so many opportunities both on-and-off the pitch to be able to learn about football here.\n“I didn’t come here with any expectations, I came here being myself and I hope that I can learn and take so much from the environment as a football player, but more importantly as a human being and I’m already feeling that.\n“I’m just looking forward to getting the journey started with this team and seeing what we can achieve in every aspect.”",
  "word_count": 380,
  "scraped_at": "2026-02-14T12:39:53.708544"
}