{
  "article_id": "42d736b2adeb",
  "url": "https://www.twtd.co.uk/ipswich-town-news/36750/itfc-women-in-cup-action/onthisday",
  "title": "ITFC Women in Cup Action - Ipswich Town News",
  "date": "20240913T174500Z",
  "domain": "twtd.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Friday, 13th Sep 2019 15:31\nIpswich Town Women begin their defence of the Suffolk FA Women’s Cup when they take on AFC Sudbury Ladies at the Goldstar Ground, Felixstowe on Sunday afternoon (KO 2.30pm).\nMen’s team boss Paul Lambert watched the recent 4-1 derby victory over Norwich City and also the women's U21s’ 2-1 defeat to Liverpool at Playford Road in their opening fixture of the season on Wednesday, in which Maddie Biggs put the young Blues in front early on before the Reds hit back twice in the second half.\nLambert has been impressed with the women's coaches and the football their team is playing.\n“Paige [Shorten, first-team and U21s assistant manager] and Joe [Sheehan, first-team manager and U21s lead coach] have done a great job, really good girls there that play really comfortable football. We watched [their U21s] yesterday,” Lambert said.\n“I think it’s important the whole club is a community, whether it’s girls’ football, women’s football, men’s football, kids’ football, it’s important to get back into that.\n\"I think the way the club is going at the minute, everything is going really, really well.”\nThis Sunday we once again begin our defence of the @SuffolkFA Women’s Cup as we take on @afc_ladies\nKickoff at @Felixseasiders is at the slightly later time of 2:30pm.\nA reminder that Entry is FREE for @IpswichTown season ticket holders! #ITFC pic.twitter.com/3pQ7gMw2l5– Ipswich Town FC Women (@ITFCWomen) September 12, 2019\nPhotos: Ross Halls\nPlease report offensive, libellous or inappropriate posts by using the links provided.\n- Page:\n- 1\nBut I'm really looking forward to the game anyway!\n- Page:\n- 1\nYou need to login in order to post your comments",
  "word_count": 279,
  "scraped_at": "2026-02-14T12:09:03.828495"
}