{
  "article_id": "42f240c2f342",
  "url": "https://news.yahoo.com/iceland-volcano-live-experts-reveal-151916875.html",
  "title": "Iceland volcano - live : Experts reveal likely eruption site as thousands of new earthquakes recorded",
  "date": "20231118T163000Z",
  "domain": "news.yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Iceland volcano - live: Met Office warns magma ‘very close’ to surface as people ‘wait in suspense’\nMagma may have reached very high up in the earth’s crust, according to Iceland’s meteorological office which says people will have to “wait in suspense for the next few days” to see how events play out.\n“While there is still magma flow into the corridor, and while our data and models show that, that probability is imminent, and we really just have to wait in suspense for the next few days to see what happens,” Kristín Jónsdóttir, head of department at the Icelandic Meteorological Office, said.\nShe said the decreasing earthquake activity over the last 24 hours could be a sign that magma has reached very high up in the earth’s crust, adding that the scenario is not unlike what was seen prior to a previous eruption in 2021.\nThe Met Office said magmatic gas has been detected at a borehole in Svartsengi, signalling an imminent eruption of the Fagradalsfjall volcano over the coming days, with the town of Grindavik most at risk.\n“Hagafell is thought to be a prime location for an eruption,” the forecaster said.\nAn eruption is now feared by many experts to be a case of when, not if.\n“I do think an eruption will take place, but the big question is when that might happen,” Dr Margaret Hartley, of the University of Manchester, told Live Science.\nKey Points\nEruption could be like ‘can of fizzy drink’ exploding\nDefence walls built around power plant\nFears over flights in and out of Iceland\nEruption fears as magma spreads underground and cracks appear in roads\nWhere is Grindavik?\nIceland residents told they face months away from home\n04:00 , Alisha Rahaman Sarkar\nExperts have revealed the likely eruption site of a volcano in Iceland, as authorities warn evacuees they may not return home for months.\nMore in World\nThe Icelandic Meteorological Office (IMO) said magmatic gas has been detected at a borehole in Svartsengi, signalling an imminent eruption of the Fagradalsfjall volcano over the coming days.\n“Hagafell is thought to be a prime location for an eruption,” the forecaster said.\nThe likely eruption site is near the town of Grindavik, which was evacuated due to a string of earthquakes shaking residents and their homes.\nAthena Stavrou reports.\nIceland officials reveal where volcano will likely erupt\nNo country better prepared for volcanos than Iceland, says PM\n03:30 , Alisha Rahaman Sarkar\nNo other country was better prepared than Iceland for volcanic eruptions and other natural disasters, prime minister Katrin Jakobsdottir said.\nHer statement comes at a time when people are fearing the imminent eruption of the Fagradalsfjall volcano over the coming days, with the town of Grindavik most at risk.\n“We have long experience in dealing with volcanic eruptions,” the prime minister said.\n“We know that it’s not necessarily a sound decision to build for example defence mechanisms when you have such a great uncertainty where an eruption can come up.”\nShe continued: “Our main priority is really to embrace those people, ensure that they have adequate salaries and to find proper housing for them for the next weeks or months.”\n“We have proposed a bill for the parliament to ensure the salaries for the next three months. And we are working as fast as we can to ensure proper housing for those people.”\nFlights into Iceland\n03:13 , Alex Ross\nFlights to Keflavik Airport remain undisrupted despite the predicted location of a volcano eruption being close to the airport.\nHere are the flights from the UK until 3.10pm:\nArrival 10.30am - from London Luton, Wizz Air\nArrival 10.45am - from London Luton, EasyJet\nArrival 10.45am - from Birmingham, Jet2\nArrival 10.55am - from London Heathrow, British Airways\nArrival 11.25am - from London Gatwick, EasyJet\nArrival 11.30am - from Manchester, Jet2\nArrival 1.40pm - from Liverpool, Play\nArrival 2pm - from London Stansted, Play\nArrival 2.25pm - from Manchester, Icelandair\nArrival 3.10pm - from Glasgow, Icelandair\nBlue Lagoon still temporarily closed\n02:13 , Alex Ross\nIceland’s famous Blue Lagoon spa shut down after a series of earthquakes led guests to vacate the hotel.\nThe Blue Lagoon, a geothermal spa southwest of Reykjavík, will be closed until 30 November amid fears of an imminent volcanic eruption.\nIn an update on its website, the attraction said: “At this moment it is not possible to determine when or where an eruption might occur. The Icelandic Meteorological Office, Civil Protection, and a team of scientists from the University of Iceland are closely monitoring the situation and analysing the developments.”\nIt added: “Iceland is no stranger to volcanic activity, and there have been three eruptions on the Reykjanes Peninsula in the last two years. Icelandic authorities and local communities are well-prepared for such events, and Iceland has one of the world’s most effective volcanic preparedness measures. Iceland’s geoscientists possess vast experience in dealing with volcanic activities.”\nWill an eruption lead to disruption for aviation?\n01:13 , Alex Ross\nYes, and no - that’s according to Dr David Neave, senior lecturer at The University of Manchester.\nThe evacuated town of Grindavik is close to Keflavik international airport, and so there are understandably concerns it could lead to issues, especially with the memories of 2010 still in people’s minds.\nDr Neave said: “If there is an eruption on land, the Icelandic aviation authorities may be able to work around it as they have done during recent eruptions at Fagradalsfjall. The situation may be very different if the eruption occurs offshore and generates a lot of ash.\n“That said, we know a lot more about ash-aircraft interactions than we did in 2010, which will help to improve safety and minimise disruption.”\nBest-case scenario?\n00:16 , Alex Ross\nAccording to Dr Dave McGarvie, volcanologist, honorary researcher at University of Lancaster, the best-case scenario for Iceland, and all the residents and businesses evacuated, was for the volcano to not erupt.\nHe said: ““t is known from past eruptive episodes in Iceland (e.g. Krafla Fires, 1975-1984) that not all dikes breach the surface to form eruptions, and that only minority do so – perhaps one in every three of four.\n“The best-case scenario is that this happens to the 15 km long dike that has just formed, and that it simply cools and solidifies – and does not erupt.”\nShould you travel to Iceland\n23:03 , Alex Ross\nAs the likely eruption of the volcano in Iceland appears to be getting closer, people with flights booked to Iceland will be wondering if it safe to go.\nThe Foreign Office advice stops well short of advising against travel to Iceland, meaning holiday companies can continue to operate as normal.\nIt’s advice to travellers is: “The town of Grindavík was evacuated as a precaution. Some roads have been closed and visitors are advised to stay away from the area. Keflavik International Airport is operating as normal.\n“While there is no current eruption, it is increasingly possible that one could occur. You should monitor local media for updates and follow the authorities advice on travel to the area.”\nIs it safe to travel to Iceland? Your rights if you have a holiday booked\nIceland residents fleeing imminent volcanic eruption told they face months away from home\n22:00 , Holly Evans\nExperts have revealed the likely eruption site of a volcano in Iceland, as authorities warn evacuees they may not return home for months.\nIceland has seen more than 1,700 earthquakes in the last 24 hours, according to the country’s Met Office, with most of the activity north of Hagafell.\nThe forecaster said magmatic gas has been detected at a borehole in Svartsengi, signalling an imminent eruption of the Fagradalsfjall volcano over the coming days.\nRead the full story here\nIceland officials reveal where volcano will likely erupt\nGrindavik couple fear losing their home after evacuating: ‘It’s a pretty grim situation’\n20:30 , Holly Evans\nA man who evacuated from a town in Iceland after earthquakes put the region on alert for a volcanic eruption said he fears he might never see his home again.\nCaitlin McLean, from Scotland, was visiting her boyfriend, Gisli Gunnarsson, in Grindavik when they were forced to flee his home at midnight on Friday, packing only a few essential items, to stay with Mr Gunnarsson’s mother in Reykjavik.\nPolice evacuated Grindavik after seismic activity in the area moved south towards the town, with a corridor of magma, or semi-molten rock, now thought to be extending under the community, Iceland’s Meteorological Office said.\nToday, authorities warned residents that it may be months before they are allowed back into their homes.\nRead the full article here\nGrindavik couple fear losing home after evacuating: ‘It’s a pretty grim situation’\nIt may be long time before residents can move back, officials say\n19:18 , Holly Evans\nIt could be a long time before it is safe to move back into Grindavík due to damages to houses and pipes, Víðir Reynisson, director of the civil defense department, said yesterday.\n“This plus uncertainty about earthquakes means that Grindvíkings have to prepare to live elsewhere in the coming months,” Mr Reynisson said.\nA rescue worker told local news that at least about twenty houses in the town are badly damaged and need a lot of repairs.\nMore than 1,200 families in the town need to be given a shelter, Grindavík mayor Fannar Jónasson said, adding that “it will take days and weeks to resolve issues so that everyone can enjoy themselves.”\nWatch: Iceland roads cracked and evacuations ordered amid looming volcanic eruption\n16:42 , Andy Gregory\nVolcanic eruption could ‘bury’ evacuated town, says geologist\n15:32 , Andy Gregory\nIf there is a volcanic eruption, it could bury the town of Grindavik, an Icelandic geologist has said.\nAri Trausti Gudmundsson told CNN: “People are now waiting with anxiety [to see] what is going to happen to the town. If the eruption really occurs, it could spare the town to a large extent. It could also, the lava flow, simply bury the town.\nBarriers are being built to try and divert potential lava away from a nearby geothermal power plant and the Blue Lagoon. “Not barriers to prevent the lava, but barriers to redirect the lava – because you really cannot stop a lava flow.”\nAnalysis | Could an Icelandic volcano ground flights like in 2010?\n13:08 , Andy Gregory\nOur travel correspondent Simon Calder takes questions from readers on whether their upcoming flights could be in jeopardy:\nCould an Icelandic volcano ground flights like in 2010?\nBiggest volcanic eruptions in the last 10 years\n12:13 , Andy Gregory\nIceland is highly susceptible to natural disasters because it lies on the Mid-Atlantic Ridge – a divergent plate boundary where the North American Plate and the Eurasian Plate are moving away from each other, leading to volcanic eruptions and earthquakes.\nThree eruptions have taken place on the peninsula of Reykjanes near the Fagradalsfjall volcano in the last three years: in March 2021, August 2022 and July 2023.\nHowever, previous eruptions did not cause damage, having occurred in remote valleys.\nAs Iceland waits in trepidation for the looming volcanic eruption, my colleague Maryam Zakir-Hussain takes a look at some of the biggest volcanic eruptions in the last decade:\nBiggest volcanic eruptions in the last 10 years as Iceland town faces devastation\nHundreds of earthquakes recorded near Kysuvik since midnight\n10:25 , Andy Gregory\nA magnitude 3.7 earthquake was felt at Krysuvik just after 5:30am this morning, local media reports, marking the largest seismic event in the area since Friday morning.\nMore than 400 earthquakes have been recorded there since midnight, according to Iceland’s national broadcaster RUV, but the activity is thought to be a sign of tension in the crust releasing – rather than an indication the magma is moving at that location.\nVideo report: Iceland volcano eruption warning forces residents in Grindavik to evacuate\n09:07 , Andy Gregory\nResidents of a fishing town in south-western Iceland have left their homes after fears of a volcanic eruption caused civil defence authorities to declare a state of emergency in the region. Find out more in this video report:\nSeismic activity 'slightly less' than before midnight, officials say\n08:30 , Vishwam Sankaran\nWhile more than 300 earthquakes have been recorded since midnight, officials say this is still less activity than last night.\nThe biggest earthquake since midnight measured 2.8 in the mountainous region of Hagafell, north east of Grindavík, according to the Icelandic Met Office.\nMagma is likely moving closer to the surface as less seismic activity may be a sign of less resistance in the earth’s crust, Ríkey Júlíusdóttir, a geologist at the Met Office, said.\n“The magma is probably quite shallow, and maybe it doesn’t take much conflict for it to erupt,” seismologist Kristín Jónsdóttir said.\nIceland volcano eruption warning forces residents in Grindavik to evacuate\n08:00 , Vishwam Sankaran\nIceland volcano eruption warning forces residents in Grindavik to evacuate\nIt may be long time before residents can move back, officials say\n07:30 , Vishwam Sankaran\nIt could be a long time before it is safe to move back into Grindavík due to damages to houses and pipes, Víðir Reynisson, director of the civil defense department, said yesterday.\n“This plus uncertainty about earthquakes means that Grindvíkings have to prepare to live elsewhere in the coming months,” Mr Reynisson said.\nA rescue worker told local news that at least about twenty houses in the town are badly damaged and need a lot of repairs.\nMore than 1,200 families in the town need to be given a shelter, Grindavík mayor Fannar Jónasson said, adding that “it will take days and weeks to resolve issues so that everyone can enjoy themselves.”\nIs it safe to travel to Iceland? Your rights if you have a holiday booked\n07:00 , Holly Evans\nThe earth is at its most restless in Iceland right now. The Reykjanes peninsula, southwest of Reykjavik, is seething with seismic activity sparking hundreds of small earthquakes.\nThe town of Grindavík, just 10 miles south of Keflavik International Airport, has been evacuated as a precaution.\nYet flights are continuing to arrive and depart as normal. These are the key questions and answers on consumer rights.\nRead the full article here\nIs it safe to travel to Iceland? Your rights if you have a holiday booked\nCosts for housing measures will be significant, Iceland PM says\n06:30 , Vishwam Sankaran\nThe government’s costs for new housing for Grindvíking residents will be significant, says Iceland prime minister Katrín Jakobsdóttir.\nWith 600 housing requests still outstanding, the prime minister told local news that the government would first “work with what is available,” but also needs to consider building new housing.\n“There, we have also been looking at things that can possibly be done faster, such as modular houses that do meet all quality requirements, which could then be built relatively quickly to respond to this situation,” Ms Jakobsdóttir said.\n“The authorities have been in conversation with the financial companies about going further, as these are completely unique circumstances,” she added.\nBiggest volcanic eruptions in the last 10 years as Iceland town faces devastation\n06:00 , Holly Evans\nIceland’s town of Grindavik faces a catastrophic countdown to a volcanic eruption that could see its destruction, experts have warned.\nAlmost 4,000 people were evacuated from Grindavik over the weekend as authorities feared that molten rock would rise to the surface of the earth and potentially hit the coastal town and a geothermal power station.\nIt comes as the country has been shaken by more than 880 small earthquakes, prompting fears that the tremors could disrupt the Fagradalsfjall volcano on the Reykjanes peninsula in the southwest of the country.\nRead the full article here\nBiggest volcanic eruptions in the last 10 years as Iceland town faces devastation\n'Design for defence wall to protect Grindavík ready'\n05:30 , Vishwam Sankaran\nThe design for a wall to protect Grindavík from lava flow is ready and its construction can be started quickly should situation arise, Víðir Reynisson, the director of civil defense, said yesterday.\n“The position of a dike has been marked based on this scenario that lava would start to flow from this place, which is considered the most likely at the moment,” Mr Reynisson said.\n“No construction has been started, but we are waiting for a more detailed risk assessment and the probability that this could actually happen,” he added.\nThe director of civil dense said teams are prepared to “grab all the equipment that is there” and go into emergency operations to “slow down or divert the lava near Grindavík.”\nSequence of events similar to 2021 eruption, Met Office says\n05:00 , Vishwam Sankaran\nThe current sequence of events in Grindvíking is similar to the one that happened on the eve of the volcanic eruption in Geldingadálar in 2021, says Icelandic Meteorological Office head of department Kristín Jónsdóttir.\n“That’s when we saw a very large reduction in deformation and seismicity, and then there was an eruption,” she told local news.\n“The magma is probably quite shallow, and maybe it doesn’t take much conflict for it to erupt,” the seismologist said, adding that “we really just have to wait in suspense for the next few days to see what happens.”\nThere is still a “high probability of a volcanic eruption,” according to the Met Office.\nIceland volcano could erupt like a ‘can of fizzy drink’\n04:30 , Vishwam Sankaran\nA volcano close to erupting in Iceland could explode like a “can of fizzy drink,” an expert has said.\nIceland’s Met Office has said magmatic gas has been detected at a borehole in Svartsengi, signalling an imminent eruption of the Fagradalsfjall volcano over the coming days, with the town of Grindavik most at risk.\nThe small fishing town has already been evacuated following thousands of mini earthquakes across the Reykjanes peninsula, southwest Iceland, over the past week.\nRead the full story here\nIceland volcano could erupt like a ‘can of fizzy drink’\nMagma 'very close' to surface, Met Office says\n04:00 , Vishwam Sankaran\nThe magma intrusion continues to deepen and widen, indicating it has reached high up in the earth’s crust, according to Kristín Jónsdóttir, the head of the volcanic activity department at the Icelandic Met Office.\n“While model calculations still indicate that magma flows into the intrusion, it must be considered probable that an eruption will occur,” the seismologist said, according to local news.\nThe greatest widening is in an area west of Hagafell, which is the most likely place for an eruption, according to the Met Office.\nIceland volcano eruption warning forces residents in Grindavik to evacuate\n03:30 , Vishwam Sankaran\nIceland volcano eruption warning forces residents in Grindavik to evacuate\nCould an Icelandic volcano ground flights like in 2010?\n03:00 , Holly Evans\nAs I write, the Reykjanes peninsula, southwest of Reykjavik, is seething with seismic activity. Grindavik, a town of nearly 4,000 inhabitants, was evacuated on Saturday as experts assess the threat of a volcanic eruption. Iceland’s main international airport, Keflavik, is just 10 miles north of the town. Yet flights are operating normally, which some may find surprising.\nRead the full article from Simon Calder here\nCould an Icelandic volcano ground flights like in 2010?\nWhere is Grindavik?\n02:00 , Holly Evans\nGrindavik, a town of 3,400, sits on the Reykjanes Peninsula, about 50 kilometers (31 miles) southwest of the capital, Reykjavik and not far from Keflavik Airport, Iceland’s main facility for international flights.\nThe nearby Blue Lagoon geothermal resort, one of Iceland’s top tourist attractions, has been shut at least until the end of November because of the volcano danger. Grindavik residents are being allowed to return for five minutes each to rescue valuable possessions and pets.\nA volcanic system on the Reykjanes Peninsula has erupted three times since 2021, after being dormant for 800 years. Previous eruptions occurred in remote valleys without causing damage.\nIceland sits above a volcanic hot spot in the North Atlantic and averages an eruption every four to five years. The most disruptive in recent times was the 2010 eruption of the Eyjafjallajokull volcano, which spewed huge clouds of ash into the atmosphere and grounded flights across Europe for days because of fears ash could damage airplane engines.\n‘Significant likelihood’ eruption will occur somewhere along magma tunnel\n01:00 , Holly Evans\nPeople in southwest Iceland remained on edge Saturday, waiting to see whether a volcano rumbling under the Reykjanes Peninsula will erupt.\nCivil protection authorities said that even if it doesn’t, it’s likely to be months before it is safe for residents evacuated from the danger zone to go home. The fishing town of Grindavik was evacuated a week ago as magma - semi-molten rock - rumbled and snaked under the earth amid thousands of tremors.\nIt has left a jagged crack running through the community, thrusting the ground upward by 1 meter (3 feet) or more in places. The Icelandic Meteorological Office said there is a “significant likelihood” that an eruption will occur somewhere along the 15-kilometer (9-mile) magma tunnel, with the “prime location” an area north of Grindavik near the Hagafell mountain.\n‘It’s like a dystopian movie’: Iceland residents describe ‘apocalyptic’ scenes as they flee volcano threat\n00:01 , Athena Stavrou\nResidents from a small Icelandic town under threat from volcanic eruption have described ‘apocalyptic’ existence as they fear for their future.\nLast Friday, thousands of Grindavik residents were ordered to leave as the town was rocked by hundreds of earthquakes. The small fishing town is 34 miles from Reykjavík and is home to the famous tourist attraction the Blue Lagoon.\nMany have been unable to return to the ‘danger zone’ to collect their belongings, as earthquakes continue to strike the town.\nIceland residents describe ‘apocalyptic’ scenes as they flee volcano threat\nIceland’s famous Blue Lagoon to remain shut till 30 November\nSaturday 18 November 2023 23:00 , Athena Stavrou\nIceland’s famous Blue Lagoon spa will remain shut till 30 November amid fears of an imminent volcanic eruption.\nThe geothermal spa southwest of Reykjavik, which is one of the island’s most popular tourist destinations, was closed on 9 November following a series of earthquakes that hit the region.\n“Considering disruptions to our guests’ experience and the sustained pressure on our employees, these precautionary measures were taken to ensure safety and wellbeing for all,” it said in a statement.\n“The closure will remain in effect until 7am on November 30, at which point the situation will be reassessed,” it added.\nIceland faces ‘decades’ of instability, experts warn\nSaturday 18 November 2023 22:00 , Athena Stavrou\nIceland’s south-western peninsula could face decades of volcanic instability, the Icelandic Met Office warned.\n“We expect to see volcanic eruptions along the peninsula, not just repeatedly in the same location. This instability could last decades,” the Icelandic Met Office’s Matthew Roberts told the BBC on Thursday\nIt comes as almost 4,000 people were evacuated from Grindavik over the weekend as authorities feared that molten rock would rise to the surface of the earth.\nPictures: Iceland battered by wave of seismic activity\nSaturday 18 November 2023 21:00 , Athena Stavrou\nIceland earthquakes: Are flights still running amid fears of volcano eruption?\nSaturday 18 November 2023 20:00 , Athena Stavrou\nIceland has declared a state of emergency after hundreds of earthquakes struck the southwestern Reykjanes peninsula in the past 48 hours.\nDespite fears of an impending volcanic eruption, flights from the UK to Keflavik international airport 10 miles north of the eruption site are going ahead as usual.\nOn Sunday 12 November, all scheduled flights from Heathrow, Gatwick, Luton, Stansted and Manchester landed without incident.\nIceland earthquakes: Are flights still running amid fears over volcano eruption?\nCould an Icelandic volcano ground flights like in 2010?\nSaturday 18 November 2023 19:00 , Athena Stavrou\nSimon Calder answers your questions on aviation, the land of ice and fire, and birthday in Albania.\nCould an Icelandic volcano ground flights like in 2010?\nGrindavik couple fear losing their home after evacuating: ‘It’s a pretty grim situation’\nSaturday 18 November 2023 18:00 , Athena Stavrou\nA man who evacuated from a town in Iceland after earthquakes put the region on alert for a volcanic eruption said he fears he might never see his home again.\nCaitlin McLean, from Scotland, was visiting her boyfriend, Gisli Gunnarsson, in Grindavik when they were forced to flee his home at midnight on Friday, packing only a few essential items, to stay with Mr Gunnarsson’s mother in Reykjavik.\nPolice evacuated Grindavik after seismic activity in the area moved south towards the town, with a corridor of magma, or semi-molten rock, now thought to be extending under the community, Iceland’s Meteorological Office said.\nToday, authorities warned residents that it may be months before they are allowed back into their homes.\n1,700 earthquakes in last 24 hours\nSaturday 18 November 2023 17:04 , Athena Stavrou\nThere have been 1,700 earthquakes in Iceland in the last 24 hours, according to the Met Office.\n1,000 of them have been recorded since midnight and the largest earthquake in those 24 hours had a magnitude of 2.8 and occurred near Hagafell, 3.5 km NNE of Grindavík.\nSeismic activity remains “high and constant” and the Icelandic Met Office have named Hagafell as the likely site of an eruption - which is still a high likelihood of happening.\nRecap: Iceland volcano eruption warning forces residents to evacuate\nSaturday 18 November 2023 15:38 , Athena Stavrou\nResidents of a fishing town in south-western Iceland have left their homes after fears of a volcanic eruption caused civil defence authorities to declare a state of emergency in the region.\nPolice decided to evacuate Grindavik after recent seismic activity in the area moved south towards the town and monitoring indicated that a corridor of magma, or semi-molten rock, now extends under the community, Iceland’s meteorological office said.\nToday, authorities said it may be months before residents can return to their homes - even if an eruption doesn’t occur.\nIceland volcano eruption warning forces residents in Grindavik to evacuate\nVolcano expert says eruption won’t be as large as originally feared\nSaturday 18 November 2023 15:00 , Athena Stavrou\nWhile it is still highly likely that the volcano near Grindavik in Iceland will erupt, Volcano enthusiast Ragga Agustsdottir, said the eruption won’t be as large as originally feared.\n“Initially there was fear there might be a relatively large eruption but since then it’s been showing it may be a smaller event. Possibly even as small as the ones that we’ve seen over the past three years,” she told Sky News.\nShe added that the danger zone has been limited to the town of Grindavik - which was evacuated last Saturday - but the extent of the damage is not yet known.\n“Essentially the magma intrusion is beneath that particular town. We are wondering if the town will be damaged by lava but we will just have to wait and see,” she said.\nWatch: Aerial view of Grindavik\nSaturday 18 November 2023 14:00 , Athena Stavrou\nThe Icelandic town of Grindavik was evacuated one week ago following thousands of earthquakes and a volcanic eruption threat.\nNow, an aerial video shows huge cracks in the town as it’s devastated by natural disasters.\nSaturday 18 November 2023 13:28 , Athena Stavrou\nMore than 1200 families evacuated families need more permanent housing as the return to Grindavik seems unlikely.\nAt a Civil Defense briefing today, mayor of Grindavik Fannar Jónasson said that it will take “days and weeks” to resolve issues.\nHe said housing issues are the main concern as many families from the town need more permanent shelter.\n“I think the nation has done very well, considering the response and the aid we have received,” he said. “A lot has happened in this one week. I know that there is a lot of impatience and a call from the residents to go faster, but everyone is doing their best and it will take days and weeks to resolve issues.”\nEruption still likely as magma travels close to the surface\nSaturday 18 November 2023 13:23 , Athena Stavrou\nAn eruption is still considered to be likely as magma travels close to the surface, despite fewer earthquakes taking place.\nAt a Civil Defense briefing today the head of the volcanic activity department at the Icelandic Met Office said the situation is similar to what it has been in recent days.\nKristín Jónsdóttir noted that while the magma intrusion is still deepening and widening, it is doing so at a slower rate.\nShe said that a decrease in seismic activity indicates that magma has reached very high up in the earth’s crust and does not now need much for it to reach the surface.\nThe Icelandic Met Office official also reiterated that the most likely place for an eruption is the area west of Hagafell.\nGrindavik residents may not be able to return ‘for months'\nSaturday 18 November 2023 13:16 , Athena Stavrou\nResidents of the evacuated town of Grindavik have been warned that they may not be able to return to their homes for months.\nAt a Civil Defense briefing today, director Víðir Reynisson said there is significant damage to houses and pipes in the area.\nHe said: “This plus uncertainty about earthquakes means that residents have to prepare to live elsewhere in the coming months.”\nLocals have been permitted to briefly enter their homes this week to collect their valuables and pets.\nGround deformation continues\nSaturday 18 November 2023 12:06 , Athena Stavrou\nGround deformation and the movement of magma has continued near the anticipated site of eruption.\nThe Icelandic Met Office said GPS data showed 3-4cm of subsidence per day in and around the evacuated town of Grindavik.\nThey also said that ground deformation in the area has continued but at a decreasing rate.\nThe largest movements have occurred north of Grindavik, near Hagafell, which is where an eruption is most likely yo take place.\nResidents briefly return to Grindavik one week after it was first evacuated\nSaturday 18 November 2023 11:26 , Athena Stavrou\nSome residents of the evacuated town of Grindavik have been allowed to return home to collect valuables and tend to pets today.\nLocals have been allowed to enter the town in small numbers for a short amount of time every day since Monday, after the town was first evacuated on Saturday.\nThroughout the week, queues of cars were pictured on the road leading to the town, which has been ‘split in two’ by thousands of earthquakes in recent weeks.\nPictures: Town split in two after being hit by thousands of earthquakes\nSaturday 18 November 2023 10:43 , Athena Stavrou\nCivil Defence meeting to be held\nSaturday 18 November 2023 09:38 , Athena Stavrou\nIceland’s Civil Defence will hold an information session at 1pm today.\nThe meeting will be held at a rescue centre near the evacuated area and will give local residents the opportunity to ask questions.\nAttendees will include the prime minister of Iceland and Icelandic Met Office officials.\nNo eruption as of Saturday morning\nSaturday 18 November 2023 09:11 , Athena Stavrou\nNo eruption has taken place as of Saturday morning, but as earthquakes continue the chance of one is still likely.\nOver 340 earthquakes have been recorded in the area since midnight, according to a specialist in the Icelandic Meteorological Office.\nSeismic activity decreased around 9pm last night but has since returned to the same level it had been.\nTelecom companies coordinate to keep systems working\nSaturday 18 November 2023 08:00 , Vishwam Sankaran\nThe staff of telecom companies are working together with the Iceland national “emergency line” to keep communications systems working in order, according to local news.\nThey are also reportedly coordinating to upgrade the systems to ensure they can withstand the stress of increased seismic activity in the region.\n“All the telecommunications companies are cooperating. There is extremely good cooperation going on in all operations and it has been for the past week,” telecom company Mila’s technical director Daði Sigurðarson said.\nVolunteers race to rescue pets as eruption imminent in 'coming days'\nSaturday 18 November 2023 07:30 , Vishwam Sankaran\nVolunteers have rescued hundreds of animals from Grindavik over the week as Iceland’s meteorological department officials warn that volcanic eruption is imminent in the “coming days.”\nThe organisation noted that over the last week, it has rescued a number of animals from the quake-rattled town, including cats, hamsters, pigeons, sheep, frogs, hamsters, and shrimp.\n“The owners and people in Grindavík have been very involved in getting the animals out with excellent results,” Dýrfinna og Hundasveitin, an association that helps lost animals, posted on X.\n“The actions of the last few days have been characterized by a great struggle for the animals who do not have a voice and their owners,” it said.\nCould an Icelandic volcano ground flights like in 2010?\nSaturday 18 November 2023 07:00 , Matt Mathers\nSimon Calder answers your questions on aviation, the land of ice and fire, and birthday in Albania:\nCould an Icelandic volcano ground flights like in 2010?\nWhere is Grindavik?\nSaturday 18 November 2023 06:30 , Matt Mathers\nPinned post: Officials reveal most likely location for volcanic eruption\nSaturday 18 November 2023 03:40 , Athena Stavrou\nThe most likely site for volcanic eruption in Iceland is near the mountainous region of Hagafell, according to the Icelandic meteorological office.\nLatest models based on GPS data and satellite imagery suggest the largest magma intrusion movements are occurring north of Grindavík, near Hagafell, the Met Office said.\n“If magma manages to reach the surface, Hagafell is thought to be a prime location for an eruption,” it said, adding that seismicity related to the magma intrusion remains constant.\nAbout 2,000 mini quakes have been recorded in the last 24 hours the largest of which occurred near Hagefell and had a magnitude of 3.0.\nMost of the earthquake activity is still being recorded in an area north of Hagafel, the Met Office noted.\nPinned post: Thousands of quakes recorded in single day\nSaturday 18 November 2023 03:12 , Athena Stavrou\nOver 2,000 quakes have been recorded in Iceland with continued land deformation on Friday, according to the country’s meteorological office.\nThe most likely scenario, according to the Iceland Met Office volcanism head Kristín Jónsdóttir, is eruption beginning in the “next few days.”\nExperts say the eruption site is likely NE of Grindavík where ground deformation is happening more acutely, but it is still not entirely sure when and where it may happen, according to the Met Office.\nSignificant likelihood of a volcanic eruption in the coming days. Models show a 15-km long magma intrusion, located just northwest of Grindavík. A hazard area has been defined based on the location of the dike, as shown in the map. https://t.co/9vYBBjNcX9 pic.twitter.com/m6SyMVkmer\n— Veðurstofa Íslands / Icelandic Met Office (@Vedurstofan) November 11, 2023",
  "word_count": 5809,
  "scraped_at": "2026-02-14T13:10:43.325447"
}