{
  "article_id": "430e5869635d",
  "url": "https://newsday.co.tt/2025/01/26/ssfl-star-gosine-exits-tt-u17-squad-due-to-family-matter/",
  "title": "SSFL star Gosine exits TT U17 squad due to family matter - Trinidad and Tobago Newsday",
  "date": "20250127T064500Z",
  "domain": "newsday.co.tt",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "SSFL star Gosine exits TT U17 squad due to family matter\nTRINIDAD and Tobago's under-17's women's football team will be without the services of star forward Nikita Gosine for the 2025 Fifa Under-17 Women's World Cup qualifiers which begin on January 27, after the 15-year-old Pleasantville Secondary student pulled out of the 21-player squad after her initial selection.\nThe team's manager Ricarda Nelson and coach Ayana Russell both confirmed that Gosine had withdrawn from the squad. A day after TT submitted their team to Concacaf on the January 17 deadline, Nelson said said she received word from Gosine's mother, Natalie Des Vignes-Gosine, who said she was coming to the team's camp to get her daughters.\nNikita's sister Natalia was also a member of the training squad, but didn't make the final cut.\nNelson said the situation was described as a \"family emergency,\" with the TT management being left in a tough spot as they were unable to put forward a replacement for Nikita.\n\"We can't make a change unless there's an injury,\" Russell told Newsday.\nTT will begin their campaign when they face the US Virgin Islands (USVI) from 8 pm at the Ato Boldon Stadium in Couva. The match will be TT's first in group B of the Concacaf qualifiers, which also features Belize and Honduras, who will kickstart the group with their clash from 5 pm on January 27.\nThe TT team features attacker Orielle Martin and also features overseas-based players such as Zaira Aimey, Aniya Thompson, Orlando City Academy's Mia Lee Chong and flanker Sanni Wilson.\nRussell said she has a special group of players at her disposal and said they have grown leaps and bounds through the TTFA's High Performance programme in the last two-three years. She is eager to see them build on their runner-up effort from the Jewels of the Caribbean Under-20 Women's Invitational last month.\nRussell also said the players have a strong understanding of what the qualifiers mean to them and the country. And during a January 24 chat with the media, she alluded to varying obstacles in the team's preparations.\n\"For some time, there have been players at the national stage who believe that they're doing the national team a favour, and that's not the case,\" Russell said.\n\"They have had their challenges on and off the field, and we've had many challenges and distractions along the way. However, this team has given me more confidence in them to assure that it doesn't matter what distraction comes their way, they're focused and ready to meet the goal of qualifying for the World Cup.\"\nAfter round-robin play, each of the six group winners in the first round of the Concacaf qualifiers will move on to the next phase, along with the two-best second-placed teams. These teams will join the top-ranked quartet of Canada, Haiti, Mexico and the US in the final round.\nThe final round will consist three groups of four teams each, with the the group winners and the best second-placed team gaining qualification for the Under-17 World Cup in Morocco in from October 17-November 8.\nWithout giving much away, Russell said the team has clear objectives for each phase of the game, and implored the home supporters to join the team on their journey.\n\"When you give them an objective, they try to meet it...when you look at their insight and understanding of the game, the execution isn't there yet, but they're under-17s so that's expected.\"\nTT will round off group B play with matches against Belize and Honduras on January 29 and 31 respectively. All matches will be played in Couva.",
  "word_count": 602,
  "scraped_at": "2026-02-14T13:32:06.434630"
}