{
  "article_id": "4312b2e711eb",
  "url": "https://toronto.citynews.ca/2023/10/31/abuse-victims-say-gun-surrender-laws-save-lives-will-the-supreme-court-agree/",
  "title": "Abuse victims say gun surrender laws save lives . Will the Supreme Court agree ? ",
  "date": "20231031T131500Z",
  "domain": "toronto.citynews.ca",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Abuse victims say gun surrender laws save lives. Will the Supreme Court agree?\nPosted October 31, 2023 8:12 am.\nLast Updated October 31, 2023 12:12 pm.\nAs Janet Paulsen prepared to leave her husband, who had become increasingly volatile over their 15-year marriage, she slipped down to his gun safes one night while he slept to try to change the combination locks.\n“There were 74 firearms in my house,” said Paulsen, who was stunned by how many guns she found, but could not figure out how to change the codes. “When I went to get my protection order, I brought pictures of all of those firearms with me.”\nGeorgia, where she lives, is not among the 21 states with gun surrender laws that can force people to relinquish their weapons while they are deemed a risk to themselves or others. So Paulsen’s husband, whom she accused of threatening and erratic behavior, was only ordered to stay away from her and their 13-year-old twin boys until a court hearing.\nThat changed a few days later when she said he tried to track them through a phone locator app, a violation of the protection order that prompted a misdemeanor charge, two hours in jail and a court order to confiscate his guns.\nAs Paulsen and the boys rode out the week at a motel where they had taken refuge while he moved out, deputies removed more than 70 firearms from their home, a modern Craftsman nestled in a lakeside community about 30 miles northwest of Atlanta.\nPolice, though, left a handgun in a pickup truck parked in the driveway, unsure if the order covered Scott Bland’s vehicle, she said.\nFive days later, Bland ambushed Paulsen in the garage as she stopped home with groceries. He used the 9 mm semiautomatic pistol to shoot her six times, as she tried to flee, before killing himself.\n“It took me five years to get up the courage to divorce him, because I knew I would pay a price. And you know what happened when I did? He shot me,” said Paulsen, 53, a former property manager and endurance athlete who was left partially paralyzed in the 2015 shooting.\nHer medical care has since cost about $2.5 million, much of it borne by society at large through health insurance payments.\n“Every step of the way it seemed like his rights were more important … than mine and my children’s,” she said, her normally stoic voice breaking.\n__\nDifferent states, different protections\nIf Paulsen endured those threats in Seattle today, not only would her husband’s cache of weapons be moved to police storage, a judge would hold a hearing within days to grill him about his access to other firearms. Does anyone else in your family have a weapon? Do you have access to guns at work? What happened to the gun listed in your firearms purchase history?\nScores of people seek protection in King County each week from domestic violence, stalking, school threats or other concerning behavior. When guns are present — as they are in about half of the cases in which domestic violence petitions are granted — the threat of injury or death is exponentially higher, and an interagency team can initiate a gun surrender under state law.\nIt’s a less adversarial, non-criminal program that’s become a model for other counties. But the effort, and similar ones across the country, could be in jeopardy as the U.S. Supreme Court considers next month whether people can be forced to relinquish their weapons before a conviction.\nA federal appeals court, in a Texas case, deemed the practice unconstitutional. The Supreme Court has agreed to review the issue on Nov. 7 — but no one knows if it’s to overturn the Fifth Circuit ruling or double down on it.\nThe Supreme Court seems to have a growing interest in gun rights cases. The conservative 6-3 majority voted last year to overturn New York’s longstanding restrictions on concealed weapons. That has led lower courts, sometimes begrudgingly, to overturn more than a dozen state and local gun safety measures. Domestic violence advocates worry that so-called “red flag” laws, which keep guns away from people in crisis, may be next.\nMeanwhile, some state courts are loosening firearm bans for other reasons. Gun surrender orders are on hold in at least five counties in Washington after a state appeals court said they violated a man’s Fourth Amendment right protecting individuals from improper search and seizures and Fifth Amendment right not to incriminate himself.\nThat worries advocates who point to new data that show gun seizures could reduce the nation’s 2,500 or more annual domestic violence deaths — more than half of which involve guns — by 10% or more. The most dangerous time for victims is when they try to leave a relationship, long before their abuser would be convicted of anything.\n“It’s very troubling,” said Karla Carlisle, managing partner of the Northwest Justice Project, who represents domestic violence victims and has asked the Washington Supreme Court to uphold the state law. “I keep waiting for the worst to happen, which is for somebody to lose their life.”\n__\n‘Do his gun rights supersede the rights of others?’\nOne of Carlisle’s clients has moved three hours across the state with her children to try to avoid that fate.\n“Isabelle,” who asked that her real name not be published to protect her and her family, obtained a domestic violence protection order in a rural Washington county in May, but the judge refused to order her estranged husband to surrender his estimated 40 weapons. Her spouse was instead told not to “possess” them. But with no enforcement, Isabelle has no guarantees.\nCarlisle is using the case — and its inherent contradiction — to try to challenge the Washington appeals court ruling.\n“You have victims just pulling up stakes, because they don’t want to be in that situation,” said Jordan Ferguson, a retired Spokane police sergeant now with the Spokane Regional Domestic Violence Coalition.\nIn hours of interviews this summer, Isabelle described a 20-year cycle of toxic behavior that echoed classic patterns of abuse: “Lovebombing,” at first. Isolation, before long. “Baby-trapping,” after they had three kids in two years. Gaslighting, as she grew afraid. Stalking, when she tried to hold down a postal route.\n“You really do fall in love with a lie, and hope becomes an addiction, that that person (you first met) is coming back,” she said. “But he made me like a servant.”\nThe fraught behavior intensified after her truck driver husband suffered a head injury on the job in 2016, she said. They had started collecting weapons around 2008, when the country’s economic downturn led them to lose their home and business and consider becoming licensed firearms dealers. That never happened, but they nonetheless amassed AK-47s, handguns, rifles and thousands of dollars worth of gun parts.\nAs his temperament devolved, she said, her husband would brandish a gun in the bedroom during the overnight hours, sometimes scaring her, sometimes threatening her, sometimes vowing to take out the entire family.\nAlthough she didn’t know it then, the presence of a gun made it five times more likely that Isabelle would die by her husband’s hands, according to Everytown for Gun Safety’s analysis of available data. She just prayed he would spare their young boys.\nShe decided she’d had enough early this year, when he spiraled over her decision to attend the funeral of a sister in Texas she hadn’t seen in a decade. She returned home a week later and told him she wanted a divorce. He pleaded to work it out.\nThen, in March, her husband pointed a loaded gun at his head and said, “We should all go together,” before choosing instead to toss the gun on the bed and choke her, according to her case file. The judge granted the order, but — at odds with state law — did not order a one-year firearms surrender.\n“Are his rights to (gun) possession more important than the rights of his wife and children to be safe? Or, not even his wife and children, but people around him?” Isabelle asked. “Do his gun rights supersede the rights of others?”\n__\nWho else is at risk?\nNationwide, more than 20% of the people killed in domestic violence shootings are someone other than the intended victim: children, other relatives, bystanders, police and, of course, perpetrators of a murder-suicide.\nPolice have long known that domestic calls are dangerous situations for their officers. And research conducted in recent years — in the wake of the nation’s troubling epidemic of mass shootings — makes clear that family violence can be a crucial harbinger of public harm.\nOnly a small fraction of abusers go on to commit mass shootings. However, more than half of the perpetrators of mass shootings have a history of family or gender violence, including the school shooter at Sandy Hook Elementary, who killed his mother that morning, and the gunman in Uvalde, who sent sexually violent threats to women in his video gaming community. But the greatest risk in mass shootings involving four or more fatalities is not to a worried public, but to gun owners and their families.\n“It was a fluke that I came home alone that night. He was waiting on myself, my two boys and my dad,” said Paulsen, who had been at her sons’ football practice. “This really could have been a much bigger tragedy.”\nApril Ross, a former Fulton County prosecutor who now directs the Georgia Commission on Family Violence, said police officers trying to keep families safe in her state have it tough.\n“They just want it to be clear, one way or the other: Can we go in and take the guns or not? But, in Georgia right now, it depends on where you live,” Ross said. “So each circuit, and each sheriff, is its own little fiefdom and they set the rules in that county, because there’s no state law.”\nIn 2014, Ross herself was shot and paralyzed by her estranged husband, who also shot a male friend in her car before killing himself. She had not sought a protection order because, as a prosecutor, she did not think she had enough evidence until it was too late.\nNow a quadriplegic, Ross believes the state’s failure to remove guns when granting a protection order harms not only victims, but the perpetrators themselves.\n“What’s lost in the argument is the value of human life,” Ross said. “Both of those men are dead and otherwise might not be, and there was value in their lives as well.”\n—\nIntervening, one gun at a time\nIn Seattle, judges juggle a dizzying array of protection order cases each day, switching their attention from petitioners and respondents on video to those appearing in person in the courtroom. The goal is to intervene before a tragedy by taking guns out of the equation.\nCollectively, the hearings offer a sobering peek into the lives of the untold number of Americans who worry about the guns in their own homes.\n— A judge speaks to a nervous 30-something woman who appears on video from her car. She’s been granted a temporary domestic violence protection order, and her ex- has surrendered an AK-47, but not the SIG Sauer pistol listed in his purchase history. The man doesn’t show up for the hearing, so the judge sets a new hearing date three weeks later. In the meantime, the woman worries that he may still have the deadly weapon.\n— A young father with a felony record says he doesn’t have the assault weapon claimed by an ex-girlfriend, complaining that police who searched his small apartment, including the baby’s room, “wouldn’t miss a gun like an AK-47.” (The judge believes him.)\n— A slightly built teen insists he doesn’t know the name of the friend who handed him the Glock-like pistol he’s seen showing off in a cellphone photo taken at the friend’s home. A teen girl had reported it. “I really can’t say because I don’t want him to get in trouble,” says the teenager, sitting by his mother and speaking with a mix of bravado and fear. (He’s found not credible, and told to track down the friend’s name and address by the next hearing.)\n— One of the most troubling cases involves a veteran whose wife is worried for her safety. He had served only a brief stint in the military three decades ago but tells people he is a Special Forces operative. He was arrested for allegedly trying to lure two children from a Costco by warning them about an “emergency situation” nearby. On a separate visit, he said something similar to a woman with an infant in the parking lot. And he had walked into a Bellevue apartment building to visit a cancer-stricken friend with an AR-15 slung over his shoulder. The man’s wife says he regularly takes out his weapons while he’s drinking to clean them. Yet, the judge — after conceding the open carry at the apartment building was legal, and with the Costco kidnapping charges dismissed — denies the prosecutor’s request for an Extreme Risk Protection Order. The man will keep his weapons.\n__\n‘We’ve got to start somewhere.’\nBoth Ross and Paulsen have urged the Georgia Legislature to adopt statewide red flag laws to protect vulnerable victims like themselves. With Republicans in power there — and U.S. Rep. Andrew Clyde, a Georgia gun store owner, handing out AR-15 lapel pins to fellow members of Congress — they know the challenge is steep.\n“Even as a gunshot victim, I am not someone who says that Second Amendment rights are not important,” Ross said.\nYet she believes the American “obsession, the fascination with gun culture” needs to be examined and the data on guns and domestic violence believed.\n“The reality is that this problem was not born overnight, and it’s not going to be solved overnight. But we’ve got to start somewhere,” said Ross. “States need to start passing consistent laws and enforcing those laws.”\nPaulsen sometimes keeps a small pistol in the basket of her walker.\n“I actually own a firearm now,” she said. “So I am not about willy-nilly taking guns away from people. But if you’re threatening to kill someone, yeah, you need to surrender that firearm.”\nIsabelle took half of the family gun collection when she fled, a point of contention in their ongoing divorce. She said it was the only asset they had. She sleeps every night with a gun under her pillow.\n“I will not leave without my pistol, even if I’m just taking my kids to school, because I am so afraid he will try to catch me off guard,” she said.\nLast year, in a rare moment of bipartisanship, Congress enacted the first meaningful slate of gun safety measures it had been able to pass in decades, a $13 billion package that includes funding and incentives for more states to adopt red flag laws. And last month, President Joe Biden announced plans to create an Office of Gun Violence Prevention.\nBut the Supreme Court could soon upend those plans as it shapes the Second Amendment landscape in a nation with more than 400 million guns in private hands.\n“In some ways, I think that the promise of the red flag laws is that … they’re designed to work in a nation awash in guns,” said Nick Suplina, senior vice president for law and policy at Everytown for Gun Safety, even if he thinks “it would be better to have a system where we were stopping things on the front end.”\nApril Zeoli, a University of Michigan researcher who studies gun injury prevention, said laws that remove guns during a period of conflict can offer victims a safe window of time to leave. “Do we want to sort of sit back and just watch this (violence) continue to happen? Or do we want to embrace a tool that will allow, in some instances, courts and people to intervene?” Zeoli said.\nShe acknowledged that the research in her field is just getting started after a 20-year period when it was thwarted — under pressure from the gun industry — by Congress.\nThat’s starting to change amid public outrage over mass shootings including the 2018 massacre at Marjory Stoneman Douglas High School in Parkland, Florida. But there is much more she wants to know about gun violence at home.\n“You would think anybody would be able to find out how many restraining orders there are in the United States in a given year, right? But we can’t,” Zeoli said. “In my own state, Michigan, how many restraining orders are there with firearm restrictions? I don’t know. … Nobody can tell me.”\nIn San Diego, City Attorney Mara Elliott compared removing someone’s guns during a time of crisis to taking keys away from a drunk driver, a public health practice the country has come to endorse.\n“It would be nice if we could get people to realize that this does not have to be a partisan issue,” said Ferguson, the former Spokane police officer. “It’s a safety issue.”\n__\nThe threats escalate quickly\nPaulsen, who grew up near Chicago and moved to Georgia for college, met her husband through work. Their marriage began happily, and he was the primary caretaker after they had the twins. He helped coach the boys’ baseball teams as they grew up.\nBut over the years, he became increasingly unstable. He would stop on the way home with the boys to drink in a nearby cemetery. He got thrown out of a local restaurant. He twice threatened suicide. And he once shot at someone who tried to steal a four-wheeler from their garage — with the same weapon he would later use to shoot Paulsen and take his life.\n“It escalated very rapidly when I told him I wanted a divorce,” Paulsen said. “He was sexually abusive, he was emotionally abusive, he was unstable. But there had not been any prior (physical) violence. That’s another thing people don’t understand.”\n“You don’t have to be black-and-blue to be in a domestic violence situation,” she said.\nThe night before she was gunned down, Paulsen was honored for her volunteer work with the Acworth baseball community. (Both sons, Hunter and Fisher, are now college pitchers.) The next morning, still fearing her husband’s wrath, she went to court for a concealed carry permit.\n“It came in the mail 10 days later, when I was in a coma fighting for my life,” Paulsen said. “So that’s not the answer, you know?”\n___\nThe Associated Press receives support from several private foundations to enhance its explanatory coverage of elections and democracy. See more about the AP’s democracy initiative here. The AP is responsible for all content.\nMaryclaire Dale, The Associated Press",
  "word_count": 3146,
  "scraped_at": "2026-02-14T13:28:24.271119"
}