{
  "article_id": "4325d54b5bf8",
  "url": "https://www.bristolpost.co.uk/news/celebs-tv/disney-users-face-1000-fine-10230408",
  "title": "Disney+ users face £1 , 000 fine if they fail to follow one rule",
  "date": "20250602T093000Z",
  "domain": "bristolpost.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Disney+ users face £1,000 fine if they fail to follow one rule\nThe streaming platform has secured live football rights\nDisney+ users could face a fine of up £1,000 if they fail to follow one important role ahead of the UEFA Women's Champions League.\nThe streaming platform has the broadcasting rights for the competition over the next five years, which they announced last month, but football fans will need to check one thing before they start watching.\nThe news means that from October, fans will be able to watch every match live with their Disney+ subscription, however you'll need a TV licence.\nThis is because even though the game is not being watched on a TV channel such as the BBC, a licence is still needed to watch live television.\nThose who are caught watching live television without a licence could consequently be slapped with a £1,000 fine.\nWhilst you previously did not need a TV licence to use streaming platforms, which typically provide on-demand shows, the introduction of live shows on these streaming services mean a licence can be required.\nA similar warning was given to Netflix users last year when WWE broadcast livestreams on the platform.\nSpeaking to The Sun last year, ahead of Netflix's Jake Paul vs Mike Tyson live fight, a rep said: \"A TV Licence is needed to watch live content on streaming services, watch or record a TV programme on any channel and when using BBC iPlayer.\n\"Further information is available on the TV Licensing website or via the customer services team, who can help with any queries.\"\nIn April, the TV licence fee rose alongside inflation, now costing £174.50 per year. Last year, around 500,000 households cancelled their TV licence, with the number of paying households falling to 23.9 million.\nWith the BBC's charter up for renewal in 2027, sources previously told The Express that the Prime Minister is considering making streaming service users pay for a licence fee to use platforms such as Netflix and Disney+.\nMP Sir Chris Bryant has supported a licence fee, saying it is needed to support a \"massive production budget\" for domestic productions.\nIn January he appeared before the Culture, Media and Sport Committee for their British film and high-end television inquiry, he said: \"I do want the streamers to come here.\nTom Cruise has made massive investments in the UK.\"\nHowever he also highlighted the importance of supporting local talent, saying: \"But I also want us to have a system where a British production company is commissioned by others to make something that where the Intellectual Property (IP), or some of the IP, remains with the production company. I kind of want a bit of both.\"",
  "word_count": 450,
  "scraped_at": "2026-02-14T12:50:03.678636"
}