{
  "article_id": "43526cd2f8d5",
  "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/41-people-who-make-liverpool-28322692",
  "title": "41 people who make Liverpool a better place",
  "date": "20231224T141500Z",
  "domain": "liverpoolecho.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "41 people who make Liverpool a better place\nThese people make us proud to be from Merseyside\nLiverpool is home to many inspiring individuals who excel in their respective fields. From farmers, charity workers, and farmers to authors, café owners and sports stars numerous people deserve recognition.\nThey embody everything great about our city and should be celebrated.\nWe have decided to highlight all these remarkable individuals who we believe you should know about. This list is not in any particular order because we believe all these incredible people are equally important.\nTry Liverpool Echo Premium for 99p with no ads, fun puzzles and brilliant new features\nChantelle Welsh\nMum-of-three Chantelle Welsh runs Channy's Youth and Community Club in Dovecot. She started the club during the pandemic as a way to keep children busy and to organise activities.\nEarlier this year, Chantelle told the ECHO: “I started running a youth club in my garden during Covid - we had six people in and it was socially distanced. It then progressed and we’re now in Dovecot Primary.\n“I’ve got three boys myself and I just wanted to do something for the kids in the area. They’re boss little kids, they just needed some help to stay on the right path.\n\"We’ve lost so many youth clubs over the years and I wanted to bring one back - I don’t want to see kids go down the wrong path.”\nChantelle is also involved with her neighbourhood's environment group Make Dovecot Clean Again, which works to collect rubbish and improve how the area looks.\nOlly Harrison\nOlly Harrison, a farmer from Tarbock, is well-known in the region for his remarkable charity work. He is the brain behind Liverpool's Christmas Tractor Convoy, which has become a new annual tradition that sees hundreds of people come out to raise money for charity.\nWhile the convoy has been the highlight of the holiday season in recent years, Olly's charity work dates back almost a decade. In 2016, he planted 75,000 sunflower seeds in place of his usual crops, inspired by a trip to Ukraine.\nOnce the sunflowers bloomed, he decided to sell them for £1 each, with all proceeds going to the Liverpool Sunflowers Cancer Care Centre.\nVicky Prendergast\nAt the start of this year, the ECHO reported how 34-year-old Vicky Prendergast was walking to her local shops in West Derby when she was approached by a man outside Panda Chinese. The man asked for a cone of chips after saying he had not eaten for two days.\nThe man, known as Dave, told Vicky he lost his wife and son in a car crash last year and he lost his job as a lorry driver, which he had for 30 years. After hearing his story, Vicky - with the help of people across Liverpool - helped to transform Dave's life.\nPeople across the city came together to help bring Dave food, household items and clothing.\nDave Kelly\nDave Kelly, from Anfield, suddenly lost his sight over a period of two weeks when he was in his early 30s. He had been previously told at the age of 17 that he would eventually lose his sight.\nAfter a difficult time coming to terms with his sight loss, he founded the charity Daisy UK three years later. The organisation is known as the \"can-do charity that does\" and supports young and vulnerable people who have experienced hate crime.\nDaisy UK has won numerous awards and encourages people to participate in sports and music, while also assisting with their employment options. The \"daisy chain\" provides support and helps people reach their full potential.\nNathan Hornby\nJodie Laithy, from Page Moss, left out a bowl of Halloween sweets for trick-or-treaters on October 31 last year. But when she looked back at her camera later that evening, she spotted \"the cutest thing ever\" as two lads, including 13-year-old Nathan Hornby, came to the door.\nThe boys approached the door wearing ski masks and rang Jodie's doorbell. After waiting for a few seconds, one of the boys noticed an empty sweet bowl on a chair near the front door.\nThe boy was captured picking up the bowl and saying \"somebody has taken them [the sweets]\" before putting it back down. He then immediately opens his plastic New Look bag full of sweets and starts placing some of his own into the empty bowl.\nThe boys turn to the Ring doorbell camera and wave before saying \"Happy Halloween\".\nSonia Bassey MBE\nSonia Bassey MBE is chair of Liverpool Charity and Voluntary Services (LCVS). Sonia has previously served as the Director of Public Sector Transformation for Cheshire and Warrington.\nIn this role, she led transformation initiatives across the sub-region, with a focus on addressing the needs of people affected by multiple disadvantages. She is currently pursuing a PhD at the Open University, researching Black Leadership in Communities.\nSonia also holds the position of Chair at Mandela8 and Africa Oye, two major black-led charities based in Liverpool. Recently, she founded the L8 Matters Community Land Trust.\nFranny Briggs\nDad-of-four Franny, from, Kirkby, has raised around £50,000 since 2020.\nIn July, he told the ECHO: \"When lockdown started, I started doing competitions on my Facebook. It started with a couple of entries and then we had 1000s of entries a week. It was to keep the kids occupied during lockdown.\"\nThat then quickly turned into a routine of Franny running around the streets dressed as cartoon characters, shaving his head, waxing his body - and fundraising to cheer up those most affected by the coronavirus pandemic.\nFranny added: “I went round Kirkby dressed as Baby Shark, I climbed Mount Snowdon dressed as Super Mario, I walked from Kirkby to Central Station. It was all to raise money.\n“We were out every day in the pandemic. It started like that and it’s just carried on. We just wanted to put a smile on children’s faces.\"\nFranny is also involved in organising the 'Kirkby Christmas Crusade' - which sees thousands of selection boxes handed out to children in the town, as a decorated truck parades the streets.\nMichelle Langan\nMichelle Langan is the founder of The Paper Cup Coffee shop, which is a warm and welcoming café that is built on the principles of charity, generosity, and community spirit.\nThis coffee shop, situated in Queen Square, offers a range of hot beverages and homemade cakes. Originally, Paper Cup Coffee was established by a team of volunteers who had been providing food, drinks, and clothing to people on the streets of Liverpool for seven years.\nThey later decided to broaden their scope and create a coffee shop. At the café, customers are encouraged to \"pay it forward\" when purchasing their morning cappuccino.\nThis means that homeless customers can eat and drink for free.\nJames Anderson\nJames Anderson is the founder of DEPHER (Disabled and Elderly Heating Emergency Repairs), a charity established to assist people in maintaining their boilers and heating systems.\nIn addition to that, the charity has accomplished much more in the face of rising fuel and food costs, including restocking empty fridges and cupboards, settling bills and bailiffs, and even purchasing nappies.\nLast year, James, who hails from Norris Green, assisted Irene, a woman from Huyton, after discovering that her gas supply had been turned off. Irene had only one small electric heater to heat her entire home, resulting in a lack of central heating and hot water.\nNatalie Denny\nNatalie Denny first became a volunteer for Barnardo's at the age of 16. She went on to university before joining Liverpool City Council’s youth engagement team.\nToday, she works as a writer, activist, EDI consultant and as the Director of Skywriters, a creative writing initiative that supports communities to build self-confidence and personal development through writing, while combating social isolation.\nNatalie is also the founder and chair of The Period Project Merseyside, a charity campaigning to end period poverty and provides menstrual products to anyone in need.\nColin Dolan\nColin Dolan from Mossley Hill, runs Liverpool Football Therapy. People from all walks of life attend its weekly sessions at the Goals sports complexes in Netherton and Speke and are encouraged to talk through their problems and make strong friendships.\nColin came up with the idea after his own experiences. Speaking to the ECHO, he previously said: “I'm bipolar. I’ve struggled with my mental health since my late teens. At times, because of my bipolar, I’ve had serious episodes of depression. This has led to suicidal thoughts, sometimes for long periods.\"\nColin decided to join a mental health programme at Everton's charity, which combined playing football on the pitch with mental health support. He believes this has made a huge difference to his well being.\nColin followed this up by setting up his own version in Liverpool Football Therapy, taking the lessons learnt from Everton with him. He said: “It’s specifically aimed at helping adults who are struggling with mental well-being, whether they’re diagnosed or not.\n“We help them improve that by using football as the typing that brings them together. We don't take it too seriously, it’s all a bit of fun.\"\nDaniel Meenag\nDaniel Meenag sprinted out of his house to save his neighbours who were trapped in a burning building after an explosion at a house on Holt Road in Tranmere on December 2.\nDaniel was in his house across the road when he heard the explosion. Despite the raging fire emanating from the property, he jumped into action.\nSpeaking to the ECHO, Daniel said: “I rushed out. I managed to get the people out downstairs and put the fire out but I couldn’t do the upstairs and caught fire myself. Then the whole house went up in flames.”\nDaniel said he was desperately trying to put the fire out by stamping on the flames and patting them down with other items in the house but was unsuccessful. He was left with some burn and scorch marks, which were treated by the ambulance crew when they arrived on Holt Road.\nAshley Jones and Teri-Ann Carnall\nAshley Jones and Teri-Ann Carnall run the L24 Foodbank in Speke. The two started their work with the foodbank in December 2022.\nAshley previously told the ECHO: \"It was cold one evening and I'd been sorting the cupboard for Christmas. I had a few tins of soups and stuff, and I was going to the shop, so I said, 'You know what, I'll leave a few in the bus stop, see if anyone needs them'. I left them and I went back a couple of hours later and they'd gone.\"\nSince then they've continued filling and distributing parcels of tinned food, fresh fruit and vegetables, and rice and pasta. Parcels, dropped at bus stops or directly to people in need, may also include toiletries and clothes.\nAshley told the ECHO: \"We wanted to help as many people as possible. The foodbank has grown so much, we now have help from Morrisons in Speke and we now support many local people - we help out with local dance groups, with the elderly, all sorts - and we’re also encouraging local children to read.\"\nHoneysuckle FC\nHoneysuckle FC supports bereaved men who have been affected by baby loss. The football team play their games every two weeks at the Leisure United Jeffrey Humble centre in Aintree.\nThe all-male group, as well as playing matches between themselves, hold ‘changing room chats’ beforehand where they can speak openly about their bereavement.\nThe idea for a football team originated from feedback from the Honeysuckle Bereavement Service at the Liverpool Women's Hospital. Many of the men using the service felt they needed a male-only space to discuss their experiences, and suggested football as a way of supporting each other.\nAfrah Qassim\nAfrah Qassim is the founder of Savera UK, a charity established in 2010 that is dedicated to ending ‘honour’-based abuse (HBA) and other harmful practices, including forced marriage, female genital mutilation (FGM), breast ironing, conversion therapy and virginity testing.\nIt campaigns to eliminate these practices and provides life-saving services and a national helpline for those at risk, regardless of age, culture, ethnicity, sexuality, or gender.\nAs well as raising awareness, it supports individuals to help them make their own choices, find their ‘savera’, which means 'new beginning' in Hindi, and to have the right to be who they want to be. Through its campaigning, Savera UK has made a huge contribution to protecting some of society's most vulnerable and marginalised individuals.\nTim Tierney\nThe Florrie Guitar Group, set up seven years ago by Tim Tierney, has been encouraging players of all standards to come together once a week at the historic building in the Dingle.\nAveraging around 70 members a week, the group plays a wide range of songs from the Beatles to Motown. Tim told the ECHO: “We get so many people from teenagers to pensioners.\n\"Some can play like Joe Satriani and other people are just starting out, it is very much for everybody. Everyone feels a part of something here which people want. With the group, they feel like it is there, and it is. I just facilitate a room.”\nPreviously the group leader has spoken of the guitar not being the “main point” of the sessions. Tim said some people come and don’t even take their guitar out of the case.\nTim added: “It is so important to the people who come here. There is a social side to it and some just want to sing along to the songs. I think it is important that people are building friendships and combating social isolation. Everyone gets something different from it.”\nMei Xia Li\nMei Xia Li was awarded an MBE in recognition of her for services to the community in the New Year’s honours list of 2013.\nMrs Li – who helped to establish the Pagoda Chinese Community Centre in Liverpool with her late husband – was recognised for services to the Chinese community and community cohesion.\nShe moved to Liverpool in 1983 and her work at the community centre was recognised for reaching out to the community and providing the opportunity to connect with a vast array of Chinese crafts and customs.\nJim Scragg and friends\nA group of friends on a lads holiday got a round of free pints after being dubbed 'heroes' for finding a stranded American walker who broke her ankle. Jim Scragg, 50, from Mossley Hill, was on a weekend break in Dingle, South Ireland, over the bank holiday weekend with his four friends Jon, Chris, Phil and Ani.\nOn Saturday, April 29, the group decided to walk up Mount Brandon in County Kerry, but overheard people talking about a missing woman. They ended up finding an elderly American man named John who was visiting Ireland with his wife, Mary from Minnesota, who was lost.\nThe men decided to split up and cover as much ground as they could to help find Mary, who could not move due to her injury. After an hour and a half Jon, 51, from Aigburth and Chris, 50, from Manchester, found Mary and informed the Coastguard of her location using the what3words app.\nJim said: \"We were booked to go to a pub at 7pm that night so my mate called to say we would be late and said why. When we got there we were kindly rewarded with a round of Guinness by the lady running the pub for free. Word spread really quickly and two of the lads were dubbed 'the Mount Brandon heroes', it was really bizarre.\"\nJohn Paul Dumbell\nA kind-hearted ECHO reader made an amazing gesture for a young Liverpool fan left heartbroken after being scammed.\nIn October, six-year-old Gabriel Gaete, and his family were sold fake tickets to his first-ever Liverpool game, leaving the youngster \"in tears\". Gabriel, who had travelled with his family from Chile to Merseyside for a family funeral, had always wanted to watch Liverpool at their home ground.\nWhile attempting to secure tickets for the Liverpool vs Toulouse clash, Gabriel's grandmother, Margaret Bazley was conned out of £400 for the tickets. After the ECHO shared their experience, many readers got in touch to voice their anger and sympathy for Gabriel - but one man went a step further.\nJohn Paul Dumbell, who runs a building company in Prescot - and had two corporate tickets for a game against Nottingham Forest, contacted Margaret and offered to let Gabriel and his dad use them for free. John's tickets gave Gabriel and his dad access to the Premier Club lounge for a meal and drinks before the match.\nThey had excellent seats in the Kenny Dalglish Stand, where they watched their heroes win 3-0.\nTerry McElhinney\nTerry McElhinney from Huyton, runs his self-titled Kick Boxing Club. Several years ago, Terry’s family was helped by a scheme that saw them receive Christmas presents and food vouchers from a charitable fundraiser.\nSpeaking to the ECHO, Terry revealed he became keen to return the favour. He began a sponsored kickathon a few years ago with his wife. This saw the couple put themselves through a series of rigorous exercises to raise money for food and presents to be delivered to families in the area over Christmas.\nHe said: “Me and my wife just started doing it a few years ago. We could only do a few things. Last year we helped 20 families by raising £6,300.”\nGee Walker\nGee Walker is the public face of the Anthony Walker Foundation - a charity set up to promote racial harmony through education, sport and the arts.\nThe foundation was set up in 2006 - a year after her A-level student son and aspiring lawyer Anthony was murdered with an ice axe in an unprovoked racist attack in a Huyton park.\nGee received an honorary Doctor of Laws from the University of Liverpool in 2012 which she dedicated to Anthony who would have graduated that year.\nChantelle Lunt\nChantelle Lunt is an activist, writer, public speaker, entrepreneur and founder of the Merseyside Black Lives Matter Alliance.\nChantelle from Halewood, also has a professional background in public service including her work in policing and children's social care.\nShe also chairs Merseyside Alliance for Racial Equality, a non-profit organisation aimed to promote racial equality and is passionate about inspiring women to make a change in spaces where inequality still exists.\nHeidi Kenworthy\nMoving On With Life & Learning (MOWLL) was founded in 1998 by Heidi Kenworthy. Initially, it was called the Day Centre IT Network and was located in the Victoria Building at the University of Liverpool.\nThe organisation's primary goal was to assist adults with learning disabilities in learning how to use computers. Heidi was invited by a group called Widening Participation to help deliver a 20-week programme.\nOver time, MOWLL has extended its services to support adults of all ages struggling with acquired brain injuries and dementia. The organization has helped over 70 people in Liverpool who face exclusion in various areas of society.\nMOWLL is involved in various projects, including fitness groups, drama classes, educational campaigns, and volunteering opportunities.\nDebbie Rogers\nDebbie Rogers is the CEO and founder of Sean's Place in Bootle, providing mental health support. Sean’s Place was established after Debbie lost her brother Sean, 34, in 2019 after a long battle with mental health.\nSean's Place provides practical proactive mental health support to men in Sefton who are experiencing poor mental health and isolation.\nBernie Buxton MBE\nHundreds of disadvantaged children in Merseyside are treated to a memorable day out each year, thanks to the actions of a Liverpool cabbie.\nBernie Buxton MBE from Stockbridge Village, has been coordinating trips for some of the region's most vulnerable young people for the past 38 years. He set up the Liverpool Taxi Drivers Children in Care Outing Fund in 1985, which is estimated to have helped more than 10,000 children since its foundation.\nBernie told the ECHO: \"It all started in 1985 when there was another organisation that used to take blind children on a day out, and I started thinking about underprivileged children too. It snowballed into children in care and disadvantaged families. On the trip to Southport, the kids get all the sweets, crisps, lemonade and ice cream they want.\nThey get all the fun of the fair and get £10 pocket money at the end of the day. They get a nice meal while they’re there, so they’re well looked after. At the fair, they get a wristband that allows them to jump on anything that they want to without queuing. These days last in their memories for years.\"\nIn addition to arranging an annual trip to Southport, Bernie also helps to mount a number of events throughout the year for the children to enjoy and is incredibly proud of the lasting impact his work has had on those who have been helped by the Outing Fund.\nMichelle Charters\nMichelle Charters is CEO of The Kuumba Imani Millennium Centre - a charity and community hub conceived and developed by Liverpool Black sisters - an organisation set up to tackle inequalities faced by women from Liverpool 8.\nThe group offers support, advice and guidance to women living in Toxteth as well as after-school projects, getting involved in national campaigns and taking part in national protests.\nA trustee at National Museums Liverpool, Michelle was involved in the International Slavery Museum’s Journey to Justice exhibition talking about activism in the city and the importance of ‘people power’ in the fight for social and political change.\nAnn Coffey\nAnn founded the Sunshine Breast Cancer Support Group 11 years ago, after she was diagnosed with breast cancer herself.\nShe works as a volunteer at Liverpool University Hospitals to assist people affected by cancer. Ann organises activities and trips away for the support group, as well as raising funds to ensure the service is available for anyone who needs it.\nAnn said: “I had to be pragmatic when I got diagnosed and knew I needed to listen to the doctors, they are the professionals. I got support from Sunshine and soon took it over and ran it using my organisational skills as a headteacher.\n“The support group is all about enjoying ourselves. Life doesn’t stop because you get cancer. It’s important to get to know others who are going through the same thing because everyone understands the feelings you go through as a cancer patient.\n“I’m so privileged to be in this position to be able to give back. It’s heart-warming to see how well the group is working and having others around the country reach out and ask how they can create something of their own in their own cities”.\nBarry Marsden\nBarry Marsden from Speke turned his life around after struggling with drug addiction and mental health issues, by launching his well-being classes.\nAfter reaching breaking point in 2019, Barry decided to turn things around for good, seeking support for his mental health, taking up exercise and beginning to help others to give himself a new purpose.\nHis organisation Mindset Matters was launched in 2021, two years after his journey to recovery began, running a series of exercise classes, meditation sessions and outdoor activities across gyms and community centres in South Liverpool.\nBarry said the organisation aims to intervene in the lives of vulnerable people to help improve their mental health and to stop them from spiralling into a life of crime.\nJane Davis\nJane is a university lecturer with an English PhD who founded a literary charity that has helped thousands of people all over the country. Jane left school at 16 with just two GCSEs before returning to education as a young mother.\nShe found refuge in books, eventually gaining a PhD from the University of Liverpool, where she went on to teach English. She pioneered the launch of The Reader in Liverpool in 2001 to promote shared reading and improves the well-being of and reduce social isolation in UK communities.\nJane set up the first Get Into Reading group for a group of young single mums at a library in Birkenhead.\nLucy Wareing\nAlongside her acting career, Lucy Wareing, 20, offers care home entertainment such as a Mary Poppins act, music, and wartime sets. Speaking to the ECHO, Lucy said: “I didn’t expect this to take off as much as it has, and it brings me so much joy being able to perform for the elderly and put a smile on their faces.\n\"My favourite song to sing for the care homes is ‘Tie a Yellow Ribbon round the Ole’ Oak Tree’ by Tony Orlando and Dawn, and the residents always love it just as much as I do.\"\nJubeda Khatun\nJubeda Khatun is the co-founder of BlackFest. BlackFest is a homegrown festival which celebrates Black artists in theatre, music, film, visual arts, spoken word and poetry.\nFormed in 2018, the organisation is dedicated to bridging the gap between ethnic minorities and the institutions they represent. Its mission is to break the status quo and aims to “educate, empower and improve equality in the arts”.\nSpeedo Mick\nIn May, Speedo Mick completed his final challenge after raising £1,000,000 for charities.\nMichael Cullen, from Dovecot, has spent the last seven years trekking across the country wearing only swimming trunks to raise awareness and money for causes close to his heart.\nThe Evertonian reached his target of six figures in May and is now providing grants to grassroots charities that support mental health, disadvantaged young people and the homeless. His most recent challenge saw him walk a thousand miles from John O'Groat's in Scotland to Land's End in Cornwall in four months.\nMaggie O’Carroll\nMaggie O’Carroll is CEO and co-founder of The Women’s Organisation - a charity and social enterprise originally set up to campaign and advocate on issues affecting women’s lives.\nSince then it has gone on to help thousands of women, been involved in the creation of thousands of new jobs and businesses and grown into one of the country’s biggest women’s economic development social enterprises.\nClaire Rigby\nLast Christmas, Claire Rigby, the owner of Momo's café in St. Helens, came to the aid of an elderly man who was starving because his oven blew up. Claire stumbled upon the man in distress on the street, complaining that he hadn't eaten.\nShe took the man inside while she went to the store to shop for food for him. Later on, she posted about her good deed on Momo's Facebook page.\nFollowing her post, locals of St. Helens got together and collected food, an oven, and a toaster for the man, so that he would never have to go hungry again.\nMargaret Aspinall\nMargaret used to be the chair of the Hillsborough Family Support Group. Her son James was one of the 97 individuals who lost their lives in the Hillsborough disaster on April 15, 1989. He was just 18 years old at the time of the incident.\nThe Premier League partnered with Margaret Aspinall in November to raise awareness about the emotional pain and trauma caused by abuse and tragedy. An educational lesson has been created and made available to over 18,000 primary schools and 60,000 teachers in England and Wales. The lesson aims to teach children about the devastating impact of such abuse.\nThe Vivienne\nLiverpool’s The Vivienne has quite the resume under her belt.\nThe drag queen was the first-ever winner of RuPaul’s Drag Race UK and has appeared on the likes of Celebrity Hunted, This is Going to Hurt, Ant and Dec’s Saturday Night Takeaway, Emmerdale, Dancing on Ice and The Weakest Link.\nThis year, The Vivienne urged fans to “keep using their voice” after she was attacked in a branch of McDonald’s. Liverpool Magistrates' Court ruled the attack was motivated \"by hostility towards a perceived sexuality\" during a hearing on Friday, December 1.\nFollowing the attack in June, The Vivienne said: “I thought he wasn’t going to get away with it, it is time we all use our voices and make an example of these idiots.\n“We are living in a horrible world at the minute but as a community, we get through these things. We got through the AIDS epidemic, we have got through Stone Wall, we’ve got through every single thing that has been thrown at us as an amazing community so thank you. Keep using your voice.”\nDenise Fergus\nDenise Fergus is patron of the James Bulger Memorial Trust - the charity she set up on March 16, 2011 to mark what should have been her son’s 21st birthday.\nIn a crime that shocked the world, James, two, was abducted from Bootle’s Strand shopping centre and murdered by 10-year-old schoolboys Robert Thompson and Jon Venables.\nKnown as For James, Denise’s charity raises money to support bereaved children, young crime, hatred or bullying victims and to reward young people who make a positive contribution to society. Denise hopes the charity will provide a positive, lasting memory of James.\nJoe Farrag\nJoe Farrag is an artist and social activist who was heavily involved in the regeneration of Turner Prize-winning Granby Four Streets in Toxteth. Lifelong Evertonian Mr Farrag formerly ran an art gallery on Falkner Street and is a veteran community activist and development worker.\nHe is involved with the Black Merchant Seamen Memorial Campaign and was instrumental in lobbying to have a memorial installed in Falkner Square.\nClaire Dove\nClaire Dove OBE has spent decades helping women to start their own businesses - and is a national leader in her field. She opened Blackburne House in 1983 as a centre for women's education and training. Since then it has helped thousands of women get qualifications and start their own businesses.\nIt's become one of Britain's biggest social enterprises and Claire is a passionate advocate for the power of charities to transform their communities and help disadvantaged people.\nAs VCSE Representative, Claire acts as an intermediary between the Government and the voluntary and social enterprise sectors to champion the Social Value Act and an improvement in commissioning practices.\nMolly McCann\nMolly McCann has promised to carry on \"changing kid's lives\" in her city of Liverpool - a place the UFC star holds so close to heart.\nThe proud Merseysider, and anti-gun campaigner, spoke to the ECHO in 2022 about the initiative Weapons Down, Gloves Up; a scheme that helps provide young people with a chance in life when maybe they thought all was lost. McCann does everything she can to \"give kids a chance\" besides training for her UFC fights.\nMcCann, along with former boxing world champion Tony Bellew, have been taking in young people aged 16 to 24 and giving them the chance to be employed full-time.",
  "word_count": 5129,
  "scraped_at": "2026-02-14T12:40:22.599831"
}