{
  "article_id": "43704be19156",
  "url": "https://theprideoflondon.com/posts/chelsea-women-at-gotham-fc-pre-season-preview-predicted-xi-01j5bbawtnv8",
  "title": "Chelsea Women at Gotham FC : Pre - season preview , predicted XI",
  "date": "20240817T211500Z",
  "domain": "theprideoflondon.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "For the first time in nearly three months, Chelsea FC Women are back. Tell your friends. The five-time defending Women's Super League champions kick off this USA preseason tour in the Garden State against NJ/NY Gotham FC of the National Women's Soccer League. It's quite the test for Sonia Bompastor, the newly named head coach, still aiming to integrate her style of play while still getting to know the players and her new surroundings.\nGotham FC, the defending NWSL champions, is led by the former Tottenham Hotspur coach Juan Carlos Amorós. We'll have a chance to see three former Blues, Jess Carter, Crystal Dunn and Ann-Katrin Berger, who are unquestionably among the East Coast outfit's first choice XI.\nThis is the second NWSL club Chelsea has played across the last three years. The other being Portland Thorns FC in the 2022 Women's International Champions Cup.\nThe Bats, as they are known by NWSL fans, are 16 games in their 26-game 2024 regular season. On 31 points, Gotham is positioned in fourth position on the NWSL table, three points behind the Washington Spirit who make up third place.\nGotham is a perfect challenge for Chelsea to see where it is at more than a month before the WSL season\nDefensively solidity has been its identity this campaign behind Berger between the sticks and the USWNT center back duo of Emily Sonnett and Tierna Davidson. Now add in Carter. Describing it as lock down doesn't even do it justice. Even before adding Carter, GFC has conceded 13 goals 1,440 minutes — the second best clip in the NWSL behind the league leading Orlando Pride. It's basically a super team.\nYou can say that with even more conviction now following the addition of Portuguese forward Jéssica Silva through 2024 from SL Benfica Women via free transfer on August 16.\nGotham's attack is headlined by the the NWSL's all-time leading scorer Lynn Williams, the former Duke Blue Devil Ella Stevens, USWNT midfielder Rose Lavelle and ex-Liverpool striker Katie Stengel. Remember her? I think we all do. She was the one who scored two penalties against Chelsea in the 2022/23 season opener at Prenton Park to help the Reds shock the football world.\n\"I can’t wait to get to the first game.\" Bompastor said. \"Gotham are in season, so it will be a hard one for us because we are just starting pre-season.\"\nMost recently, the 2023 NWSL champs punched its ticket to the first-ever NWSL x Liga MX Femenil Summer Cup Final in October with a win over Angel City FC on August 6.\nPreseason is not when you make concrete conclusions. We'll be eyeing which experiments work and what kind of connections lead to the most success ahead of meaningful action. It'll be interesting to see what kind of role not only the newcomers will have but also the players returning from loan like Wieke Kaptein.\n\"It’s about bringing the good team spirit in that game, getting minutes into the players legs and trying to see our game model.\"\nChelsea Women predicted XI at NJ/NY Gotham FC\nGoalkeeper: Zecira Musovic\nDefenders: Millie Bright (C), Nathalie Björn, Niamh Charles, Lucy Bronze\nMidfielders: Wieke Kaptein, Erin Cuthbert, Lauren James\nForwards: Maika Hamano, Aggie Beever-Jones, Mayra Ramírez\nChelsea Women at NJ/NY Gotham FC match info\nDate: Monday, August 19\nTime/Venue: 7 p.m. EST, 12 a.m. BST / Red Bull Arena\nHow to watch: DAZN, CFC Website/App (UK, Ireland)",
  "word_count": 572,
  "scraped_at": "2026-02-14T12:57:43.218831"
}