{
  "article_id": "439c78d901e8",
  "url": "https://www.nytimes.com/athletic/5500872/2024/05/18/var-spain-germany-italy-mls-nwsl/",
  "title": "As the Premier League prepares for VAR vote , what is the view elsewhere ? ",
  "date": "20240518T050000Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The video assistant referee system (VAR) is facing a reckoning in the Premier League.\nAs The Athletic revealed on Wednesday, Premier League clubs will hold a vote at their annual general meeting in June on a proposal — put forward by Wolverhampton Wanderers — calling to abolish VAR. A decision will require a two-thirds (14-6) majority to pass.\nAdvertisement\nThe Premier League would be the first major league to reverse course on VAR and get rid of the system after implementing it. But are there any other countries that have reached their limit with VAR? Could any other leagues get rid of it soon, or is the Premier League an outlier?\nHere, The Athletic’s experts explain how VAR is viewed in their country or continent — and what might happen going forward.\nSpain\nThe Athletic’s exclusive that Premier League clubs would vote on scrapping VAR from next season did make headlines in Spain: it was Marca’s cover story on Thursday morning.\n#LaPortada 🗞️ Inglaterra votará si mantiene o no el VAR pic.twitter.com/vD4kIXVOfP\n— MARCA (@marca) May 15, 2024\nAnd there has been plenty of criticism of VAR and its application throughout Spanish football this season.\nBarcelona coach Xavi regularly complained about decisions going against his team, claiming videos from Real Madrid’s TV station pressuring officials “adulterated” the competition, and bemoaning the lack of goal-line technology after the Clasico in April.\nMadrid president Florentino Perez has also often publicly criticised the standard of Spanish refereeing, while implicitly saying that he believed decisions unfairly went against his team, including during VAR revisions.\nYet, instead of calling for VAR itself to be binned, the different stakeholders are more worried about seeking to work it to their advantage. The consensus view in Spain among a variety of sources — who asked to remain anonymous to protect relationships — was that there would be no such big change and that it’s not even being talked about when they were consulted after The Athletic’s story on Wolves’ proposal.\nThe debate — as it so often is in Spanish football — is still over control of the power and resources. After VAR was introduced in 2018-19, it was seen as a source of extra revenue for the Spanish federation, then led by Luis Rubiales. La Liga president Javier Tebas has regularly called for control of refereeing to be taken away from the RFEF.\n“La Liga would like an independent refereeing body, like in English football, where it’s very well organised,” Tebas told The Athletic in 2023. “If the federation doesn’t agree, the government will have to be involved. It’ll be a long-term battle.”\nAdvertisement\nIn December, La Liga and the federation agreed for audio conversations between the VAR and on-pitch referees to be made public afterwards — this did not make any team happier but did provide more ‘content’ to fuel debate in the media and on social media.\nMore such tweaks could be put in place for 2024-25, but nobody is seriously expecting VAR to end in Spain any time soon.\nDermot Corrigan\nItaly\nCarlo Tavecchio, the late former president of the Italian Football Federation, was more notorious for his racist gaffes than trailblazing VAR in 2017. Trialling and bringing it online as an early adopter was his way of showing Italy to be at the cutting edge. The same has happened with semi-automated offside, which has been in effect in Serie A since the World Cup in Qatar ended.\nRefereeing is more scrutinised in Italy than in other countries on account of scandals in the past, so for cultural reasons it was initially welcomed. Conspiracy theories haven’t stopped, though, and the level of dissatisfaction is equivocal with the Premier League — even though there is far greater transparency.\nThis season, for instance, Serie A’s principal domestic broadcaster DAZN launched a show called Open Var, in which every Monday the referee designator Gianluca Rocchi or one of his underlings goes through all the contentious decisions of the weekend with the relevant audio from each incident.\nStill, the exasperation at the state of officiating has led to calls for Rocchi to quit, but that’s where it has ended.\nA motion to get rid of VAR has not been tabled at the Serie A assembly. Instead, they have discussed allowing teams to challenge decisions and the prospect of going live to the VAR room to listen to the decision-making process as it happens.\nJames Horncastle\nFrance\nThere is less of a focus on the video assistant referee system in France and more of an issue with the standard of refereeing.\nAdvertisement\nThis is not to say there have not been controversies. There have been public questions from several clubs about decisions, while there have been issues with the application of VAR.\nBut this is seen as less of a structural problem with VAR and more about officiating — and this is facing a lot of scrutiny.\nAntony Gautier, the French FA’s technical director for refereeing, was subject to a statement from 17 of 18 Ligue 1 clubs in March demanding his removal because “dialogue and trust are definitively broken”. They blame the people at the top for standards dropping more than anything.\nFrench clubs also want more of a say in officiating.\nThe issue is generally about interpretation, which goes back to the question marks over refereeing standards.\nReferees are now authorised to explain their decisions to the media after matches, on the rare but necessary occasions when that would be useful.\nPeter Rutzler\nGermany\nVAR is not popular in Germany. Whether it makes people genuinely angry is another matter — at the very least, it is a way down the list of irritations.\nAt any one time, there is a lot going on. This season alone, supporters across the country have protested the proposed DFL investor deal, the standard of policing and the functionality of the German FA, the DFB.\nThat is without mentioning long-term ideological issues, such as the existence of RB Leipzig. Or the local ones, like Borussia Monchengladbach’s ultras and their desire to return to paper ticketing.\nVAR does not work well in the Bundesliga. It’s arguably worse than it is in England; supporters complain, rightly, about a lack of transparency in stadiums and on television. For a league so happy to sell itself on supporter culture, it seems remarkably indifferent to how VAR’s clunky mechanics affect that fan experience. The VAR review screen that appears during games is, with its many shades of grey, almost hysterically bland.\nAdvertisement\nThe bigger issue is the time taken to reach decisions in Cologne. Semi-farcical at times, it leads to long periods of standing around, with nobody quite sure of how to behave. Or, how the rules are being applied and to what.\nBack in December 2023, 11Freunde — probably the country’s most thoughtful football magazine — had had enough. VAR was denounced as a ‘half-baked experiment’ and as being in need of ‘fundamental reform’.\n“Stoppt den VAR!”\nThe headline did not need translating.\nThe upcoming Premier League vote has certainly caused some interest. Reacting to the news, Kicker, the country’s biggest football magazine, queried whether English football is about to undergo a “revolution” before listing the litany of issues which have blighted the season, including the calamitous “good process, lads” moment during the Tottenham Hotspur versus Liverpool game in September.\nSebastian Stafford-Bloor\nMLS\nIn 2017, following a successful trial period, and approval from the IFAB, MLS became one of the first domestic leagues in the world to adopt VAR.\nHoward Webb led the task of implementing the process into the league, having infamously been the refereeing in the 2010 World Cup final when Nigel De Jong avoided a red card despite booting Xabi Alonso in the chest. Webb later admitted he would have given a red had he been able to use VAR. We all have our regrets in life.\nComparatively, Webb and his colleagues will take far greater pride in the VAR process they’ve established in MLS — one that’s arguably the smoothest and most understandable in the sport today. Referees don’t dawdle about as they try to avoid a run to the monitor, and the league recently added a step where referees announce the post-review decision over the stadium speakers.\nThere are still some limitations at play: MLS doesn’t enjoy the full suite of camera angles that are in the Premier League, and the league still hasn’t implemented the goal-line technology which predated VAR in most competitions.\nAdvertisement\nStill, MLS and its fans likely have a rosier outlook on VAR than most of the world thanks to a streamlined process.\nJeff Rueter\nNWSL\nNWSL has, thus far, been a mixed bag when it comes to VAR.\nThe introduction and use of VAR was seen as an equality issue as well as one of game fairness; it wasn’t just a flat case of “what gets implemented in the men’s game should be available in the women’s game as well”, but a referendum on the investment into equipment and personnel. VAR requires a certain number of cameras with high enough video quality as well as its own referee crew.\nBoth of these things have long been issues in NWSL associated with a lack of investment or care from various stakeholders — whether that was broadcasters, PRO, or even the league itself.\nThe actual implementation of VAR has caused the usual issues, including ever-increasing stoppage times. In early April, NWSL had a slate of excessively long wait times for VAR rulings, including one 13-minute stoppage during Washington Spirit versus Utah Royals.\nAgain, this exposed issues with the quality of camera coverage and the level of referee experience — not just with the referee but also with those assigned to review. However, it’s clear that there has been feedback about streamlining the VAR process because the average wait time has improved.\nSteph Yang\nSouth America\nWith the obvious caveat that there is never going to be anything approaching a consensus view across an entire continent, it’s reasonable to state that the main gripe with VAR in South America concerns its application rather than its existence.\nControversy over refereeing decisions — fuelled by rampant partisanship — is endemic to the South American scene. For as long as anyone can remember, officials have been painted as incompetent, corrupt, or both — and have sometimes merited those labels. Throw in the near-constant threat of violence from fans and even players, and it can be a horrible place to be a ref. So when VAR first came onto the scene, it struck many as a welcome salve.\nAdvertisement\nThere are things to be positive about. Despite public criticism from Lionel Messi, the first South American tournament with VAR — the 2019 Copa America — was a relative success. CONMEBOL, the continent’s football federation, has placed a premium on transparency and accountability, admitting to errors when they occur. Major VAR decisions made in the Copa Libertadores and in World Cup qualifiers are posted on the CONMEBOL YouTube page, with a narrator explaining the process. This is to be applauded.\nWhat often rankles is the way VAR is used, particularly in domestic competitions, where standards are less exacting.\nIn Brazil, for instance, there have been complaints over a lack of conviction in the video booth, with on-field referees being called over to the touchline too often and with no clear guidance about what they may have got wrong. Delays are often comically long, too: it’s not uncommon for a game to stop for seven or eight minutes while officials debate passages of play.\nAgainst that backdrop, the use of VAR in major European competitions is seen as something to aspire to. South Americans admire the comparative speed of decision-making and the fact that — in most cases, at least — only clear mistakes result in an on-field review.\nThere is, at present, no major movement to abolish VAR in South America. It will, though, be interesting to see how things develop in the weeks ahead. The Premier League, in particular, is held up as the gold standard of what modern football should look like. So if VAR is ditched here, it may well prompt a rethink in some quarters.\nJack Lang\nFIFA’s view\nWolverhampton Wanderers have not featured that highly on FIFA’s agenda since England captain Billy Wright & co took on the world’s best teams in a series of “floodlight friendlies” in the 1950s.\nAdvertisement\nBut Wolves have certainly grabbed FIFA’s attention this week with their attempt to get the Premier League to ditch VAR.\nAs luck would have it, Wolves timed their red card to replays while FIFA was holding its annual congress in Bangkok, and it certainly gave the hundreds of delegates who flocked to the Thai capital something to talk about in between buffet lunches, meetings and “legends” matches.\nIt would be a stretch, though, to say that Wolves’ idea has concerned FIFA — confused would be a better word, as the consensus on Planet FIFA is “what’s wrong with VAR?”\nWhile Sepp Blatter-era FIFA was famously opposed to bringing too much technology into football, Gianni Infantino-era FIFA loves it and has been an enthusiastic supporter of VAR since 2016.\nThe most critical view on VAR you will hear from a blazer at one of these events is that VAR needs to get better, not in the bin.\nWhen Arsene Wenger, FIFA’s chief of global football development, got his turn during congress to talk about what he has been up to recently, he gave a very upbeat presentation about a VAR-lite system that the governing body hopes will be affordable enough for every league and competition around the globe to join the video-replay age.\nMatt Slater\n(Top photo: Getty Images)",
  "word_count": 2290,
  "scraped_at": "2026-02-14T12:52:28.291338"
}