{
  "article_id": "43a2c2dadfef",
  "url": "https://dailypioneer.com/news/sam-coffey-joins-city-to-bolster-wsl-title-bid",
  "title": "US Midfielder Sam Coffey Joins Manchester City Women on 3 . 5 - Year Deal",
  "date": "20260116T053000Z",
  "domain": "dailypioneer.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sam Coffey joins City to bolster WSL title bid\nUnited States midfielder Sam Coffey joined Manchester City from the Portland Thorns on Wednesday, signing a 3 1/2-year contract.The transfer fee was reportedly worth more than $800,000.\nCoffey, who won Olympic gold and the SheBelieves Cup with the US National team, was described by City as one of the best players in the world. “Sam is playing at the top of her game, and I think her decision to come here shows the incredible progress we’ve made as a club and the ambitions we have moving forward,” City director of football Therese Sjogran said.\nCoffey has appeared in 42 games for the United States, with four goals and five assists. She was left off the roster for the team’s annual January camp, leading to speculation that she was on the move.\nCity hopes the 27-year-old Coffey will help lead the club to the Women’s Super League title this season, with Andree Jeglertz’s team currently top of the standings. Its only league title came back in 2016. Chelsea has dominated the division over the past 11 years.\n“It’s a club with so much history, so much success, so much influence in the city,” Coffey said about City. “It’s also a place that just has proven its investment in women’s soccer and being a part of this movement that is going on.”\nCoffey was signed by the Thorns in National Women’s Soccer League in 2022 after playing at Penn State and won a league title with the Portland club that season. She played in 90 matches for the Thorns, scoring five goals.\n“Sam’s reputation as one of the world’s best speaks for itself, and we’re delighted she’s chosen to come here ahead of other potential suitors,” Sjogran said. “We believe she has all the qualities needed to thrive at City and, more broadly, the WSL, and we’re excited to see how she can elevate our already superb squad of players.”\nCoffey is the latest national team player to head to Europe, joining defender Naomi Girma and forward Alyssa Thompson, who both went to Chelsea. The exodus has called attention to the NWSL’s salary cap, and whether it hampers teams from attracting and retaining elite talent.",
  "word_count": 372,
  "scraped_at": "2026-02-14T13:23:31.255472"
}