{
  "article_id": "43a87c3e3e65",
  "url": "https://www.90min.com/women-s-champions-league-matchday-5-predictions-2024-25",
  "title": "Women Champions League matchday 5 predictions",
  "date": "20241210T144500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Women's Champions League matchday 5 predictions\n- Gameweek five of the UWCL kicks off on Wednesday\n- Chelsea, Arsenal and Manchester City are all in action\n- 90min have predicted the results of each game\nThe group stage of the 2024/25 UEFA Women’s Champions League has reached the latter stages as just two games remain before the knockout rounds get underway.\nChelsea, Lyon, Bayern Munich and Manchester City are among those already qualified, but the likes of Arsenal, Real Madrid and Barcelona can also book their place with wins this week. Gameweek six will then conclude the group stage before Christmas.\nBarcelona are the current holders of the trophy after they beat Lyon 2-0 in the final earlier this year. Two-time winners Wolfsburg are at risk of being knocked out as they currently sit third in their group on goal difference, while Italian side Roma will be hopeful of reaching the latter stages of the competition for just the second time in their history.\nWith that being said, 90min have predicted the results of matchday five of the UWCL…\nGalatasaray vs Lyon\nGalatasaray are yet to pick up any points in group A with four defeats in their four games so far. Lyon, on the other hand, are top with 12 points from a possible 12.\nIt’s difficult to see anything other than a Lyon victory. The French side won the previous meeting between these two teams 3-0, so a similar result will likely occur again.\nPrediction: Galatasaray 0-4 Lyon\nWolfsburg vs Roma\nThe other group A fixture sees Wolfsburg take on Roma, and this one is a lot tougher to call. They both sit on six points after four games with two wins and two defeats each.\nRoma won the last meeting between the two teams 1-0, but this is an absolute must-win for Wolfsburg if they’re to have any hope of reaching the knockout stages. They take on Lyon in the final gameweek, which couldn’t get much tougher.\nPrediction: Wolfsburg 2-1 Roma\nChelsea vs FC Twente\nChelsea have a 100 percent record in the Champions League so far this season and look unstoppable. Last time out against FC Twente, they secured a 3-1 victory away from home to cement their place at the top of the group.\nThe Dutch side have won just one of their games so far in the group, so picking anything up away from home against Sonia Bompastor’s side is a tall order. Chelsea’s winning run will surely continue on Wednesday night.\nPrediction: Chelsea 4-0 FC Twente\nCeltic vs Real Madrid\nAlso in group B, Real Madrid travel to face Celtic at the SuperSeal Stadium. The Scottish side are bottom of the standings without a win and have conceded 11 goals across their group stage campaign so far.\nLos Blancos, on the other hand, are second in the standings and just three points behind leaders Chelsea. They will be confident of securing a win to put their qualification for the knockout rounds beyond doubt.\nPrediction: Celtic 0-4 Real Madrid\nBayern Munich vs Juventus\nThursday’s clash is a must-win for Juventus if they’re to have any hope of qualifying for the latter stages of the competition. The Italian side have won just one of their four games so far and need two wins from their final two matches, as well as Arsenal to lose both of their remaining games.\nBayern, though, have dropped points in just one of their matches so far and will be a tough test for Juventus. For that reason, it’s difficult to see Max Canzi’s side getting the result they desperately need.\nPrediction: Bayern Munich 2-0 Juventus\nValerenga vs Arsenal\nLast time out against Valerenga, Arsenal secured a comfortable 4-1 win over the Norwegian side at the Emirates Stadium. While Valerenga have previously taken points off Bayern in the group stage, Renee Slegers’ side will likely secure another win.\nThe Gunners’ qualification for the knockout stages is almost confirmed, but can be put beyond any doubt with a win on Thursday night.\nPrediction: Valerenga 1-5 Arsenal\nHammarby vs Barcelona\nBarcelona may not be top of group D, but they are favourites to qualify alongside Manchester City and are favourites heading into Thursday’s clash with Hammarby. Last time these two sides met, the current European champions secured a staggering 9-0 victory.\nIt’s difficult to see anything other than a similar result this week, as Hammarby have conceded 13 goals across their group stage campaign so far. Next week’s meeting with City will be the priority for Barcelona as they look to secure top spot, but they will have more than enough to see off Hammarby.\nPrediction: Hammarby 0-5 Barcelona\nMan City vs St. Polten\nThe final game of matchweek five sees Manchester City host Austrian side St. Polten at the Joie Stadium. Gareth Taylor’s side didn’t necessarily secure a comfortable win last time these two teams met, as it took a late winner from Mary Fowler to secure a 3-2 victory.\nHowever, City should have more than enough to get over the line a second time. Although, the City boss will be conscious of a difficult WSL game against Everton over the weekend, followed by their final UWCL group stage game against Barcelona next week.",
  "word_count": 873,
  "scraped_at": "2026-02-14T12:23:00.677723"
}