{
  "article_id": "43b13133dca1",
  "url": "https://www.amren.com/news/2023/03/the-sudden-dominance-of-the-diversity-industrial-complex/",
  "title": "The Sudden Dominance of the Diversity Industrial Complex",
  "date": "20230309T184500Z",
  "domain": "amren.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Sudden Dominance of the Diversity Industrial Complex\nThomas Hackett, RealClearInvestigations, February 14, 2023\nLittle more than a decade ago, DEI was just another arcane acronym, a clustering of three ideas, each to be weighed and evaluated against other societal values. The terms diversity, equity, and inclusion weren’t yet being used in the singular, as one all-inclusive, non-negotiable moral imperative. Nor had they coalesced into a bureaucratic juggernaut running roughshod over every aspect of national life.\nThey are now.\nSeemingly in unison, and with almost no debate, nearly every major American institution – including federal, state, and local governments, universities and public schools, hospitals, insurance, media and technology companies and major retail brands – has agreed that the DEI infrastructure is essential to the nation’s proper functioning. From Amazon to Walmart, most major corporations have created and staffed DEI offices within their human resources bureaucracy. So have sanitation departments, police departments, physics departments, and the departments of agriculture, commerce, defense, education and energy. Organizations that once argued against DEI now feel compelled to institute DEI training and hire DEI officers. So have organizations that are already richly diverse, such as the National Basketball Association and the National Football League.\nMany of these offices in turn work with a sprawling network of DEI consulting firms, training outfits, trade organizations and accrediting associations that support their efforts.\n“Five years ago, if you said ‘DEI,’ people would’ve thought you were talking about the Digital Education Initiative,” Robert Sellers, University of Michigan’s first chief diversity officer, said in 2020. “Five years ago, if you said DEI was a core value of this institution, you would have an argument.”\nDiversity, equity and inclusion is an intentionally vague term used to describe sanctioned favoritism in the name of social justice. Its Wikipedia entry indicates a lack of agreement on the definition, while Merriam-Webster.com and the Associated Press online style guide have no entry (the AP offers guidance on related terms).\nYet however defined, it’s clear DEI is now much more than an academic craze or corporate affectation.\n{snip}\nIt’s difficult to know how large the DEI Industrial Complex has become. The Bureau of Labor Statistics hasn’t assessed its size. Two decades ago, MIT professor Thomas Kochan estimated that diversity was already an $8 billion-a-year industry. Yet along with the addition of equity, inclusion, and like terms, the industry has surely grown an order of magnitude larger. Six years ago, McKinsey and Company estimated that American companies were spending $8 billion a year on diversity training alone. DEI hiring and training have only accelerated in the years since.\n“In the scope and rapidity of institutional embrace,” writes Marti Gurri, a former CIA analyst who studies media and politics, “nothing like it has transpired since the conversion of Constantine.”\nYet in our time, no Roman Emperor has demanded a complete cultural transformation. No law was passed mandating DEI enactment. No federal court ruling has required its implementation. There was no clarion call on the order of President Dwight D. Eisenhower’s “military industrial complex” warning. No genuine public crisis matched the scale of the response.\nThe sources of this transformation are both deep and fairly recent. On one level, they can be traced back to the egalitarian movements that have long shaped American history – from the nation’s founding, through the Civil War and Reconstruction to the battles for women’s suffrage, the civil rights movement, and same-sex marriage. In other ways, the rapid transformation can seem no more explicable than an eccentric fashion trend, like men of the late 18th century wearing periwigs. However, a few pivot points of recent history bent its arc in DEI’s direction.\nThe push for affirmative action is the most obvious influence, a program first conceived during the Reconstruction era but then abandoned for nearly a century. Although triumphs for social justice, the Civil Rights Act and Voting Rights acts of the late 1950s and 1960s didn’t stop discrimination; the country would need to take more affirmative steps toward assisting minority groups and achieving more equitable outcomes, proponents argued. A controversial policy from the start (with the Supreme Court expected to curb its use in college admissions this term), affirmative action was further complicated by immigration reforms that allowed for more non-European immigrants, setting off a seismic demographic shift that continues to reverberate.\nThe diversity movement of the early 1990s was in part an attempt to capitalize on the new multicultural reality. Stressing individual and institutional benefits rather than moral failings, early corporate diversity training programs hewed to traditional values of equality and meritocracy. Creating a diverse workplace, R. Roosevelt Thomas wrote in the Harvard Business Review, in 1990, “should always be a question of pure competence and character unmuddled by birth.”\nAnd in many ways it appears to have worked. Just look at the tech industry, where immigrants from East and South Asia have flourished. Nigerian immigrants are perhaps the most successful group in America, with nearly two-thirds holding college degrees. Doors have opened wide to the once-closeted LGBT community.\nBut in other ways, the recent explosion of DEI initiatives reflects shortcomings of earlier efforts, as suggested by the headline of 2016 article in the Harvard Business Review, “Why Diversity Fails.” Even as high-achieving first- and second-generation immigrants have thrived in certain industries, particularly STEM fields, people of color remain scarce in senior institutional positions. There is also the deeper issue of what many in the post-George Floyd era have taken to calling systemic or structural racism, citing major disparities for black Americans in education, healthcare, homeownership, arrests, incarceration, and household wealth.\nMore recently, a spate of widely publicized police killings of unarmed African Americans has galvanized a growing belief, especially among progressives and especially since Donald Trump’s election, that America is an irredeemably racist nation. In 2020, in the wake of the Floyd murder and in advance of a fraught election, a moral panic set in. Having increased their ranks, social justice entrepreneurs and bureaucrats were poised to implement an ideological agenda and compound their institutional power.\nAlthough no hard numbers exist on the exact size of the industry, the “DEIfication” of America” is clear. From Rochester, New York, to San Diego, Calif., cash-strapped municipalities have found the funds to staff DEI offices. Startups and small companies that once relied on their own employees to promote an inclusive culture now feel compelled to hire diversity consultants and sensitivity trainers to set them straight. The field is so vast it has born a sub-field: recruiting agencies for DEI consultants. So-called “authenticity readers” tell publishing companies what are acceptable depictions of marginalized groups and who is entitled to tell their stories. Master’s degree and certificate programs in DEI leadership at schools like Cornell, Georgetown, and Yale offer new and lucrative bureaucratic careers.\nAt Ohio State University, for example, the average DEI staff salary is $78,000, according to public information gathered by economist Mark J. Perry of the American Enterprise Institute – about $103,000 with fringe benefits. Not to be outdone by its Big Ten conference rival, the University of Michigan pays its diversity officers $94,000 on average – about $124,000 with benefits. Until he retired from the position last summer, Michigan’s chief diversity officer, Robert Sellers, was paid over $431,000 a year. His wife, Tabbye Chavous, now has the job, at the vice provost rank and a salary of $380,000.\nFor smaller organizations that cannot afford a full-time equity officer, there are other options for shoring up social justice bona fides – namely, working with any of the hundreds of DEI consulting agencies that have risen like mushrooms after a night’s rain, most of them led by “BIPOC” millennials. With some firms, the social justice goals are unmistakable. The Racial Equity Institute is “committed to the work of anti-racist transformation” and challenging “patterns of power” on behalf of big-name clients like the Harvard Business School, Ben & Jerry’s, and the American Civil Liberties Union. With others, the appeal has less to do with social change than exploring marketing opportunities and creating a “”with-it” company culture, where progressive politics complement the office foosball tables and kombucha on tap.\n“Diversity wins!” declares the management consultancy McKinsey & Company. Certainly diversity officers have been winning, although opposition is building in Florida and elsewhere, where the wider woke agenda that includes DEI has advanced. Even minimally trained practitioners are in high demand, and signs of their influence abound.\nWells Fargo offers cheaper loans to companies that meet racial and gender quotas. Private equity and venture capital firms like BlackRock and KKR declare their commitment to racial “equity.” Bank of America tells its employees they are implicated in a white supremacist system. Lockheed Martin asks its executives to “deconstruct their white male privilege.” Major tech companies like Google publicly chart the “Black+ and Latinx+” people they’ve hired, and assure the public that Artificial Intelligence will prioritize the DEI political agenda. ChapGPT, an AI model that can generate remarkably cogent writing, is been designed with a liberal bias, summarily rejecting requests that don’t conform to the algorithm’s notions of “positivity, equality and inclusivity.” Disney instructs employees to question colorblind beliefs espoused by the Rev. Martin Luther King Jr. and others. Fire departments are told to lower their physical fitness requirements for women. Similarly, universities are dropping standardized tests to yield more admissions of certain minorities (typically not Asians). And the Academy of Motion Picture Arts and Sciences, hoping to award more “films of color,” inspects Oscar-nominated films for cast and crew diversity. (Netflix has been a notable exception, last May laying off dozens of employees working on such issues. Under Elon Musk, Twitter is also flouting woke orthodoxies.)\nIn education, college students are required to take DEI-prescribed courses. Community college employees in California are evaluated on their DEI competencies. Loyalty oaths to the DEI dogma are demanded of professors. Applicants to tenure-track positions, including those in math and physics, are rejected out of hand if their mandatory DEI statements are found wanting. Increasingly, DEI administrators are involved in hiring, promotion, and course content decisions.\n“Academic departments are always thinking, ‘We need to run this by Diversity,’” says Glenn Ricketts, public affairs officer for the National Association of Scholars.\n{snip}",
  "word_count": 1699,
  "scraped_at": "2026-02-14T13:45:43.778350"
}