{
  "article_id": "43b5875d1225",
  "url": "https://www.nbcnews.com/news/us-news/supreme-court-rules-trumps-troops-deployment-illinois-latest-epstein-f-rcna250778",
  "title": "Supreme Court rules against Trump troops deployment in Illinois and the latest Epstein file release : Morning Rundown",
  "date": "20251224T140000Z",
  "domain": "nbcnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Supreme Court rules against the Trump administration over National Guard deployment in Illinois. The latest Epstein files release includes several references to the president. And, where the redistricting battle will go next year.\n📅 The Morning Rundown will be off for the Christmas holiday. We'll be back in your inbox on Friday.\nHere's what to know today.\nSupreme Court rejects Trump's bid to deploy National Guard in Illinois\nThe Supreme Court rejected the Trump administration's plan to deploy National Guard troops in Illinois amid strenuous objections from local officials.\nThis is Morning Rundown, a weekday newsletter to start your day. Sign up here to get it in your inbox.\nThe court in an unsigned order turned away an emergency request made by the administration, which said the troops are needed to protect federal agents involved in immigration enforcement in the Chicago area.\nAlthough the decision is a preliminary one involving only Chicago, it will likely bolster similar challenges made to National Guard deployments in other cities, with the opinion setting significant new limits on the president’s ability to do so.\nThe decision marked a rare defeat for President Donald Trump at the Supreme Court, which has a 6-3 conservative majority, after the administration secured a series of high-profile wins this year.\nThe court rejected the administration's view that the situation on the ground is so chaotic that it justifies invoking a federal law that allows the president to call National Guard troops into federal service in extreme situations.\nThe decision saw the court’s six conservative justices split, with three in the majority and three in dissent. The court's three liberals were in the majority. The dissenters were Justices Samuel Alito, Clarence Thomas and Neil Gorsuch.\nMore politics news:\n- Former Sen. Ben Sasse, R-Neb., announced he has been diagnosed with \"metastasized, stage-four pancreatic cancer,\" saying the diagnosis is \"a death sentence.\"\n- Rep. Harriet Hageman, a Republican, is running for Senate in Wyoming next year, seeking to replace retiring GOP Sen. Cynthia Lummis, who announced she would not run for re-election.\nDOJ releases 3rd batch of Jeffrey Epstein files\nThe Justice Department released a large trove of records related to Jeffrey Epstein, including allegations about the late financier's ties to Trump.\nThe release, by far the Justice Department’s largest in its effort to comply with the Epstein Files Transparency Act, revealed a lot of previously unknown information, along with claims about Trump that the department said are \"unfounded and false.\"\nOne of the newly released emails claimed that flight logs show Trump flew on Epstein's plane at least eight times in the 1990s, including once with an unnamed 20-year-old woman.\nAndrew Mountbatten-Windsor, formerly Prince Andrew, appears to have sent an email to Ghislaine Maxwell asking if she could set him up with “some new inappropriate friends,” according to documents.\nThe national redistricting fight will expand in 2026\nThe 2026 midterm elections are approaching, but for some states, their congressional boundary lines are far from settled.\nAfter six states enacted new congressional maps this year, a handful of others could join the mid-decade redistricting fight next year that could help determine which party controls the House. The redrawing of district lines typically happens at the start of each decade after new census results.\nTrump started an unusually frenzied midcycle redistricting battle when he called on Republican-controlled states across the country to draw new maps to shore up the GOP's narrow House majority. Texas, Missouri, and North Carolina all enacted new maps, which in total could net Republicans as many as seven seats. But Republicans were not able to build as robust of an advantage as they initially hoped. California Democrats responded with a map, approved by voters last month, that could allow the party to gain up to five seats and effectively cancel out Texas' effort.\nExperts who backed 'shaken baby' science reverse their stance\nThousands of caregivers have been arrested since the early 1980s based on the medical belief that young children hospitalized with three symptoms — brain swelling, bleeding in the brain and bleeding at the back of the eyes — must have been forcefully and deliberately shaken. Many doctors and pediatric associations remain steadfast in the view that those symptoms help prove that a child has suffered what is now often called \"abusive head trauma.\"\nBut a growing number of medical and forensic experts say the diagnosis is too definitive, particularly in the absence of other signs of abuse. Accidental falls from changing tables can similarly jostle the brain. Clotting disorders and other illnesses can also cause brain bleeding. While some babies are undoubtedly shaken by overwhelmed caregivers, which can cause life-threatening brain damage, some scientists say it isn't enough to look only at three symptoms before they draw conclusions.\nIn a major victory for shaken baby syndrome skeptics, New Jersey's Supreme Court recently agreed, affirming a lower court ruling that likened the diagnosis to unreliable \"junk science\" and barring expert testimony about it from two upcoming trials. The 6-1 ruling, closely watched by accused caregivers and their attorneys nationwide, could shift how courts weigh shaken baby evidence.\nRead All About It\n- British comedian and actor Russell Brand was charged with one count each of rape and sexual assault after two new women came forward.\n- Melodee Buzzard's mother was arrested and accused in the death of her 9-year-old daughter after the girl's body was found in a rural area of Utah more than two months after she disappeared in California.\n- A man was killed with an arrow in an apparently random attack on a New Jersey sidewalk — as newly released video of the deadly strike stuns the community.\n- The National Women's Soccer League announced it was introducing a rule to allow teams to circumvent the league's salary cap, despite the players' union having rejected the proposal.\n- After having two Christmas games last season, the NFL will have three games tomorrow. Combined with a whopping five NBA matchups, the sports slate is a gift of its own.\nStaff Pick: Life changing rulings\nDozens of federal judges have found themselves at the center of a political maelstrom as they have ruled against President Donald Trump or spoken up in defense of the judiciary. With Trump administration officials vilifying judges who rule against the government, a wave of violent threats and harassment has often followed.\nAs a result of the various threats and intimidation, judges have had to adapt their daily lives.\nSenior Supreme Court reporter Lawrence Hurley interviewed six sitting judges, as well as former judges and others familiar with the current threat landscape to find out what types of threats the judges are facing. — Christian Orozco, newsletter and platforms editor\nNBC Select: Online Shopping, Simplified\nDozens of parents share how they survive the holidays. Plus, some of the best point-and-shoot cameras and expert advice about what makes them worthwhile.\nSign up to The Selection newsletter for hands-on product reviews, expert shopping tips and a look at the best deals and sales each week.\nThanks for reading today's Morning Rundown. Today's newsletter was curated for you by Christian Orozco. If you're a fan, please send a link to your family and friends. They can sign up here.",
  "word_count": 1205,
  "scraped_at": "2026-02-14T12:20:36.713399"
}