{
  "article_id": "44113c659441",
  "url": "https://theprideoflondon.com/how-to-watch-chelsea-women-at-manchester-city-live-women-s-champions-league-stream-tv-team-news-prediction",
  "title": "How to watch Chelsea Women at Manchester City live : Women Champions League stream , TV , team news , prediction",
  "date": "20250319T144500Z",
  "domain": "theprideoflondon.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Chelsea Women are riding high on their Subway League Cup Final victory just a few days ago but the job is not yet done! The Blues take on Manchester City Women in the first leg of the Women’s Champions League this week as they face a bitter rival yet again.\nThis match is the second of four straight matches between the two giants of women’s football and each one is like a final on its own. This week’s matchup is at Academy Stadium, home of Manchester City Women and they will be looking to make up for their defeat on Saturday in the League Cup.\nIn that matchup, City were largely the better side as the first Chelsea goal came against the run of play and the second as the result of an own goal by the City defender. They were incisive and attacked Chelsea relentless but couldn’t break through Hannah Hampton and the Blues defense.\nCity will be hoping for a different result in front of their home fans but Chelsea have the upper hand and will be hoping to end the tie in the first leg so they can focus on City in the WSL this weekend.\nHow to watch Manchester City vs Chelsea live, stream link and start time\n- Kick off time: 4pm ET Tuesday (March 19, 2025)\n- Venue: Academy Stadium, Manchester\n- Watch: DAZN, TNT Sports 1 (UK)\nManchester City team news:\nIn a huge blow to Manchester City both Bunny Shaw and Aoba Fuijino will miss the first leg and could be out for the next two matches as well. The pair combined for City’s equalizer on Saturday and they are significant players in the Sky Blue attack. This is great news for Chelsea and should help them jump out to an early lead in the tie.\nChelsea team news:\nChelsea added Sam Kerr to the Champions League squad so there is a chance that she can feature in the second leg but she did not travel with the team. The same can be said of Guro Reiten, Naomi Girma, and Maelys Mpome. Keira Walsh is set to make her return from a brief injury layoff and should slot back into the starting lineup against City.\nManchester City vs Chelsea prediction:\nLast time out the Blues faced a dogged City team that was inspired by their interim manager to play some fierce competitive football. The pitch was in terrible shape and that combined with City’s intensity made for a sloppy game that didn’t favor Chelsea. This time around, the City intensity should be the same but with a cleaner pitch that should allow Chelsea’s explosive attack to take advantage.",
  "word_count": 446,
  "scraped_at": "2026-02-14T12:49:20.547572"
}