{
  "article_id": "441f7866a15b",
  "url": "https://wzozfm.com/ixp/499/p/matt-levine-rumble-ponies-announce/",
  "title": "Binghamton Rumble Ponies Welcome New Play - by - Play Announcer",
  "date": "20260210T003000Z",
  "domain": "wzozfm.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Meet The New Voice Of The Rumble Ponies This Season\nTownsquare Media Binghamton was sad to hear of the departure of Jacob Wilkins as the main play-by-play announcer for the Binghamton Rumble Ponies after six years, but happy that he is moving on to another exciting adventure.\nBinghamton Rumble Ponies games, both home and away, are heard each season on WNBF radio, and we eagerly awaited who will replace Jacob. To our delight, today, February 9, 2026, the Rumble Ponies and Mets organization made their choice public.\nRead More: Free Fishing Days Return To New York State In 2026\nCongratulations go to Matt Levine, who has been elevated to the team’s lead play-by-play broadcaster and Director of Broadcasting and Media Relations. Over the past three years, Matt served as the Rumble Ponies' Broadcasting and Media Relations Assistant.\nAccording to the announcement, Matt will also steer the team’s media relations efforts and contribute to social media and content creation.\n“I am thrilled to step into the lead role and continue my career in Binghamton. I am excited to keep building relationships in the Southern Tier community, the New York Mets organization, and beyond. It is an honor to share these stories. I look forward to continuing to have a front row seat to the development of players, as they come through Binghamton on their path to Major League Baseball.- Matt Levine\nWhen not in the Rumble Ponies broadcast booth, Matt is the television play-by-play voice of the Stony Brook University women’s basketball team and a sideline reporter for Stony Brook football broadcasts. He also contributes as a play-by-play broadcaster at St. John’s University and Long Island University.\nBefore Matt came to the Rumble Ponies organization, he spent four seasons with the Maryland Baseball Network, including two years as the Director of Broadcasting and Media Relations for the student-run flagship station of the Terrapins. Matt also spent the summer of 2021 broadcasting for the Falmouth Commodores in the prestigious Cape Cod Baseball League.\nThe Rumble Ponies are pleased to welcome Matt back to Rumbletown as the Director of Broadcasting and Media Relations. Matt has demonstrated the commitment to delivering a great broadcasting experience to those who listen both locally and afar to foster Rumble Ponies team pride. We look forward to his continued work with the players and coaching staff to share their unique stories and help make all of them household names on their journey to Queens. - Eddie Saunders, Rumble Ponies Director of Marketing\nBaseball season is just around the corner, and the Binghamton Rumble Ponies will kick off the season as the defending Eastern League Champions on April 3 at Delta Dental Stadium against the New Hampshire Fisher Cats.\nThe home opener at Mirabito Stadium is set for April 7th, hosting the New York Yankees AA affiliate, Somerset Patriots. For more information on the 2026 season, visit the Binghamton Rumble Ponies website.\nLOOK: These '90s Red Carpet Photos Are the Ultimate Throwback\nGallery Credit: Stephen Lenz\nLOOK: Relive the ’90s in These Iconic Photos\nGallery Credit: Stephen Lenz",
  "word_count": 509,
  "scraped_at": "2026-02-14T12:51:07.760871"
}