{
  "article_id": "442b77a8af88",
  "url": "https://www.dailycamera.com/2023/12/18/rooney-cu-buffs-3-extra-points-dec-18-2023/",
  "title": "Rooney : CU Buffs 3 extra points ( Dec . 18 , 2023 ) ",
  "date": "20231219T021500Z",
  "domain": "dailycamera.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "BuffZone writer Pat Rooney discusses three topics surrounding CU Buffs athletics as more football reinforcements arrive via the transfer portal and Pac-12 play inches closer in basketball.\nSigning day formality\nWednesday is national signing day. Who knew?\nI’m exaggerating of course, at least just a little, but the continued additions to the Colorado football program underscore exactly how much the offseason game has changed. Signing day once was a sort of mid-winter extravaganza for college football fans. Now it’s an afterthought.\nNot that Buffs fans don’t have anything to be excited about, as getting five-star offensive lineman Jordan Seaton to put his signature on a national letter of intent undoubtedly will be a recruiting coup for CU. Yet for a team in the Buffs’ situation — with a top-flight quarterback going into his final season of eligibility, plus his father/coach who few expect will still be in Boulder by the time Seaton is wrapping up his collegiate career — worrying about stockpiling future depth with prep recruits is far less important than finding the right pieces in the transfer portal.\nMonday brought another intriguing piece, as CU received a commitment from former Houston starting defensive tackle Chidozie Nwankwo.\nKJ’s hot start\nColorado forward Tristan da Silva has been touted as a potential player of the year candidate in the Pac-12. Yet some of his top competition might come from teammate KJ Simpson.\nThe Buffs’ junior point guard has done it all through CU’s 8-2 start. Among the to-do items for Simpson going into year two as the starter at the point was to become a more efficient scorer. He has done just that with only one sub-.500 shooting performance. Simpson needed to become a more dependable 3-point shooter and boasts a .459 mark from long range. Simpson has recorded more than two turnovers just once in 10 games and sports a lofty 3.14 assists-to-turnover rate. With nine steals in the past two games, Simpson also has his sights set on a spot on the Pac-12 all-defensive team.\nSome of those numbers are all but certain to dip when the Buffs are more consistently challenged in Pac-12 play. But the early stages of the season have showcased a focused Simpson playing with a purpose. Simpson has never made excuses for his dramatic drop-off last season (.354 on 3-pointers in the first 15 games; .154 in the final 14), but his ankle was never the same after turning it late in a 25-point game at California on New Year’s Eve, and he later tried to play through the constant fatigue of an illness that eventually was diagnosed as mono (Simpson missed the final five games of the season). Simpson still has to put together a full season, but so far he has shown dramatic improvement in the areas needed out of him the most.\nLooking ahead\nAssuming the men’s and women’s basketball teams take care of business at home on Thursday against Utah Tech and Northern Colorado, respectively, fans can start looking forward to what should be electric conference openers going into the final season in the Pac-12.\nBarring a disaster against Utah Tech, the men’s team will go into the conference opener on Dec. 29 against Washington on the cusp of the top 25 (or in it, depending how the week goes nationally) and boasting a top-40 mark in the NET. By virtue of the Huskies’ win against Gonzaga on Dec. 9, the opener gives the Buffs an immediate opportunity to stake their claim in the pecking order behind league favorite Arizona.\nSame with the eighth-ranked women. Head coach JR Payne’s club opens Pac-12 play on Dec. 30 against No. 11 Utah in an early matchup of league heavyweights. In an extremely rugged and demanding Pac-12 — the conference owns five of the top 11 spots in the latest Associated Press top 25, plus Washington at No. 23 — holding serve at home will be critical to any potential run at a conference championship.",
  "word_count": 663,
  "scraped_at": "2026-02-14T13:10:14.592010"
}