{
  "article_id": "444249fad753",
  "url": "http://www.bignewsnetwork.com/news/278199275/ask-the-old-guy-full-speed-ahead",
  "title": "Ask The Old Guy : Full speed ahead",
  "date": "20250502T213000Z",
  "domain": "bignewsnetwork.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Ask The Old Guy: Full speed ahead\nDarin Gantt\nCHARLOTTE The Panthers are still in the phase of the offseason program where they're mostly just running and lifting weights.\nBut things are different this week, and you can feel it.\nFor one, the dust has cleared from the draft, and the outline of what this year's team is going to look like is in place. There are still moves to make, a lot of guys to sign, and a few guys to cut, but you can see a 90-man roster through the fog now.\nIt was an abstract concept prior to last weekend when they added wide receiverTetairoa McMillanand pass-rushersNic ScourtonandPrincely Umanmielenin the first three rounds. Now, you are getting a clearer sense of what it will be.\nIt'll become increasingly more real as they get on the field next weekend for rookie minicamp and then gather for increasingly more football-y days of the offseason program and OTAs throughout the summer.\nBut you can see the emphasis on freshening up the defense, adding bigger and younger and more qualified players. You can see an exciting new offensive playmaker. And when you add that to the base they laid with the second half of last season and the stability that comes with a second year in a program, the reasons for optimism are real.\nI'm sure some people will skip ahead a few steps, but most of the pieces are in place for the season, and it's fair for fans to feel excited.\n------------------------------------------------------\nDo you think this is the year that the Panthers make the playoffs?Charlie, Tacoma, WA\nMaybe not that excited. Remember when I said some people are going to want to skip a step? That was all the way two paragraphs ago.\nTwo years ago, the Panthers won two games. Last year, they won five. If they could add three wins again and get to eight, it would mark significant progress toward the goal of building something sustainable.\nBut eight doesn't necessarily qualify you for the playoffs unless you live in the, ... checks notes, ... NFC South. Hey, wait a minute.\nThe Buccaneers are the current standard in the division, with five straight playoff appearances. They're also enjoying the stability that comes with having the same quarterback, coach, and GM for more than one season at a time. And they also added an exciting offensive playmaker of their own in wide receiver Emeka Egbuka. So, there's clearly a target to aim at.\nBut this division is always messy, even when it's good (and frankly, that's part of its charm), so everyone has a chance until they don't.\nThe Panthers are getting better, and the getting better is happening in a logical sequence. That's a lot. I'm not going to say a playoff berth can't happen; I'm just saying it's not a catastrophe if it doesn't, as long as there's progress.\nI love your enthusiasm, Charlie, and I would never hide your light under a bushel. So I'll go ahead and make you this week's Friend Of The Mailbag, and get the appropriate honorarium on the way to you soon, and then you will already be a winner, untethered from expectations that are beyond your control.\n------------------------------------------------------\nHi Darin! This line of thought might seem to come directly from a stolen Ben McAdoo crystal ball, but let me know if you think I'm wrong in thinking it's just common sense. Most predictions have the Panthers jumping two or maybe three wins from last season. At first, though, it seems OK, as the defensive additions justify that jump along with continuity of coaching (other teams might improve also).\nBut there's one missing thing in that prediction: the improvement inBryce Young's play; and when he's the QB it certainly affects greatly the team performance. They went 4-6 when he returned (the equivalent of 7 wins in 17?). Even considering the games after the bye - when I think Bryce really got to his new level (Jake Delhomme also told that on Jordan and Jake) - they went 2-5 including two close losses against the Super Bowl teams and an OT loss against the Bucs. So my thinking is if the Panthers improve by 2-3 wins, most probably they'll finish with nine or 10 wins this season, especially as teams still see them as a bottom of the league material. (Also, I'd think for 2026, the improvement in wins might be smaller as the feeling around the league will shift about them, but for 2026, I'd really need the crystal ball). Thanks!Fernando, So Paulo, Brazil\nI bow to Fernando's Buddha spirit. He has learned the lessons of reasonable expectations well. And that the crystal ball remains in Ben McAdoo's other pants.\nThat part about the rest of the league improving also is one we tend to forget about sometimes. As the noted Eastern philosopher John Fox liked to say, \"The other team practices too.\" The Bucs were good and added a young receiver who could take over for some of their older ones soon. The Falcons needed pass-rushers, plural, and found them. The Saints acquired probably the last draft pick ever born in the 1990s, a quarterback who is already off his parents' health insurance. All of those things are helpful. This time of year, everyone looks better because no one's lost yet.\nBut it is reasonable to think Young can continue to improve. After all, he's still just 23 younger than the Falcons' second-year starter and two years younger than the quarterback the Saints just drafted.\nAdding a receiver like McMillan, with his pterodactyl wingspan and hands softer than a Bojangles biscuit, will make any quarterback better. And the defense doesn't have to make a 2002-level jump (31st to second in the league in one year), it just has to get better than it was to see a significant boost in results.\nAnd Young's a big part of that. He's at his best when he's moving the ball around to multiple targets, and the addition of a red zone threat ought to help them put points on the board. He's also more comfortable, which is the natural extension of having some success.\n------------------------------------------------------\nI'm really excited about the moves we made in the draftno doubt we've added talent on both sides of the ball. My question is about a pick from a couple of years ago:DJ Johnson. We traded up to take him in the third round, a move many thought was a reach both in terms of value and draft capital. He played multiple positions in college but was drafted as an EDGE (I know you're not a fan of the term, but it's in the vernacular now) into a sparse room that definitely needed some influx of talent. So far, though, he hasn't shown much as a pass rusher. However, he has held his own against the run and made some solid plays there in the backfield while setting the edge.\nWith our edge room now more crowdedespecially with the additions of veterans and rookies like Scourton and Umanmielendo you think there's a chance the team will consider moving DJJ to a more traditional linebacker role? I know he's bounced around positionally (especially at Oregon), and that kind of transition carries risk, but it might be the best shot at salvaging a high Day 2 pick we spent a lot to acquire. Looking forward to hearing your thoughts!Tyler, Charlotte\nNow that the draft is over, I'm declaring a moratorium on the word \"edge\" for at least 10 months. And I'm fining Tyler for his excessive capitalization. It's just football, gang. Everything doesn't have to have capital letters (other than Friend Of The Mailbag, of course, that's a prestigious title, like Pope or Jedi Master).\nUsually, position switches are kind of a last resort, and I'm not sure we're there yet with Johnson (or that making him an inside linebacker is a natural fit).\nHe's good against the run and has gotten better since he's been here. That's something.\nBut he does highlight one of the main storylines of this offseason. This roster is more competitive than it was in January, and that's a good thing. Roster spots are going to have to be earned this year, rather than bestowed.\nWhen you add a good free agent likePatrick Jones II(7.0 sacks last year) along with a couple of second-day picks, that makes it more difficult for everybody at that position to keep a spot. So, it will be interesting to see how that one shakes out.\nFor Johnson, in particular, that makes it harder. For the roster as a whole, that's a good thing, though.\n------------------------------------------------------\nI am so excited after FA and our draft picks, as well as UDFA's we picked up. I was thinking we would make playoffs this year, probably as a wildcard and 2026 as contenders. However I feel like Dan and Dave got us out to a fast rebuild start, grabbing some good players throughout last two years. Players are actually wanting to play for us again. My question is in two parts. We have a rather large WR room with our original players, drafting TMac andJimmy Horn Jr., and signingHunter Renfrowas well as our UDFAs. So, how many do you think we put on the team this year? Some may end up on practice squad possibly while others may lose spots all together. I feel like a few original players will have to really step up to make the roster. I believe TMac,Adam Thielen,Jalen Coker,Xavier Legette, Renfrow, and possibly Muhammad III could make the team with Horn Jr on special teams. What is your take?\nLast question: do you feel we stepped up and made the necessary changes to be able to compete for a position in the playoffs? Where do you feel we still have weaknesses? Thank you for your time you give to Carolina Panthers fans.Cheryl, Fuquay Varina, NC\nWe do it for the people, Cheryl, thanks. And this dovetails nicely with Tyler's question above, because this spot also became a lot more competitive last weekend.\nThe room is large, big enough for all of them to fit in at once. Generally, teams keep six players at that position. Roster counts can be fluid, so nothing is ever in stone, but that's a normal amount to carry on the 53 without going way short in other places.\nAnd it's fair to assume that McMillan, Legette, and Thielen are accounting for half of those spots.\nSo Coker, veteranDavid Moore,Dan Chisena(whose speed could make him a needed special teams part), Renfrow coming back from a year out of football, and sixth-rounder Horn have to fight for jobs. There will also be competition from the reported undrafted receivers, including Muhsin Muhammad III (those deals aren't finalized until they get here next week and can often change between the time of agreement and signature).\nThat's as deep as that group has been in years, and they're in the position of potentially letting guys go who either played key roles in the past or were just drafted. That's a positive for the health of the roster. Guys who are picked on the third day only have guaranteed spots on rosters that are less than ideal. The competition is the point.\nSpecial teams will be a big factor in this as well, beyond the return jobs. Horn Jr. has electrifying open-field speed and could be a punt return weapon. Fellow rookieTrevor Etiennecould make a role for himself on kickoff returns. Chisena is really good in coverage, and in a world beyond special teams staples like Sam Franklin, there's a need for those guys too.\nAs far as the playoffs? Getting closer. The roster is incomplete and still thin at certain spots on defense (particularly in the secondary). But again, the whole is getting better because they have created more competition.\n------------------------------------------------------\nWhew! It's been a hectic few weeks leading up to the draft and the busy UDFA signing period. We appreciate the informative and insightful articles from you and Kassidy, as well as all the photos. The excitement for the coming summer and the season is, dare I say, palpable. Seems Dan Morgan and his entire staff executed at a high level for this draft. Most of the national sports pundits agreed with mostly top grades given to the Pathers draft class. There was one exception. An acclaimed draft guru, who shall remain nameless, who is employed by \"The Network\" gave the Panthers a middling grade of C+. Perhaps that was because the team drafted someone other than who he had mocked several times to the Panthers at pick No. 8. This is why I don't put too much stock in mock drafts. The only pick that matters is the one read onstage by Roger Goodell. Overall though, it looks like we came away with some nice prospects, ones that will give the team more than a puncher's chance to do well in 2025. Dan Morgan and company potentially filled needs on both sides of the ball, as well as tugging on the heart strings a bit with the after draft signing of \"Moose III\". All in all, I'm a happy Panthers fan today.Chuck, West Jefferson, NC\nI wish I got graded in college the same way draft grades are calculated. Hmm, this looks like a good kid. Eagle Scout, with excellent test scores, and solid grades in high school. I'll give him an A. That system works until the prospect in question actually has to perform. Or in my case from college, learns about beer and women (mostly beer).\nDraft grades make for a good piece of content in the spring, I guess, but they're all heat and no light.\nThey are are basically calculated in two ways whether the team in question filled their needs as perceived by the grader, and whether they drafted players the grader had good projections on. For instance, I love Brooks' Sandwich House up on Brevard. So, if there was a hamburger draft, and the Vikings drafted Brooks' Sandwich House in the first round, I would probably give them an A. Except open-air hamburger places without indoor dining rooms where you stand under a shade tree around a common picnic table don't fit as well in 8 feet of snow in Minnesota as they do in the sunny South, so it might not work as well there.\nBesides, the draft industrial complex is incentivized to create reaction and engagement, so if you give everybody the only honest grade right now (Incomplete), you won't go viral or whatever.\nHere's what I'll say about this draft class. It followed a logical progression. They added young talent to a roster that needs it. They didn't fill every need because you can't, but they're also not at the place in the building where you ignore high-end talent for positional fit.\nWe'll see how it all comes together.\n------------------------------------------------------\nWhazzup DG, the OG from Hickoreee... I like the pick of TMac, even though I was hoping for Tyler Warren. Thankfully, the brass doesn't ask my opinion because I was pulling for Blaine Gabbert over Cam Newton. I can admit when I'm wrong.\nWhen new players come in, whether it be free agents or rookies, is there a player orientation where the history of the team, and specifically the origin of the \"Keep Pounding\" mantra, is explained and how deep the meaning is to the fanbase? Seems like it would be, but some players also think Sir Purr is a bear, so I'm not assuming anything at this point.Chris, Greensboro, NC\nI'm still trying to decide what to call the first-round pick. We've had the chance to speak one-on-one, and I think I probably stammered out that nickname because everyone else was saying it, but I may be too old to go that route with someone I'm not that familiar with yet. I'm leaning toward using his given name, especially after meeting his delightful mother, Shawny, who shot down the attempted nickname \"Tet\" for the best reason ever \"because I named him Tetairoa.\" (It's not just the Charlotte media; the PA announcer at Servite High School tried that once, too, and she set him straight as well. More on that later.)\nAlso, never say the name Blaine Gabbert around here again. Go forth and sin no more. You are loved, you are forgiven, so be at peace.\nAnd yes, there is absolutely an intentional effort to teach new players here the legacy, traditions, and history including Sam Mills and his famous words.\nIt hurts a little to realize that McMillan was still 0 years old when the former Panthers linebacker and assistant coach gave the legendary speech that became the mantra for the entire organization (and Scourton was about a year from being born). So, new guys are not going to walk in with that kind of familiarity. Twenty years is forever in a cultural context, so they have to be taught.\nWe definitely have documents and media here for guys to help catch them up. And I've got 20 good minutes of Sam material at the ready, as soon as anyone pulls my string. Thank you for coming to my TED Talk.\nPart of any tradition is hearing it from the elders. That's why guys likeJJ JansenandTaylor Motonare important to an organization beyond their play on the field. Mills was gone before Jansen arrived, but the veteran long snapper played for coaches and with players who were there the day Mills said those words, so the legend was passed to him, and now he can pass it to others, as he did during training camp when Mills was inducted into the Hall of Fame.\nEven if you don't know about Mills or his impact, you can't miss it if you're in this building for long. The words are everywhere. On the wall on the way to the practice field, so you walk past it every day. In a mural outside Dan Morgan's office, so when you come in to sign a contract, you can't miss it. Morgan played for Mills and was shaped by him through countless hours of film study with his position coach and nights at the bowling alley with his friend. So that message won't fade as long as he's here.\nBut that lesson, about never giving up regardless the situation, about doing everything you can selflessly for the man next to you, is also not just about any individual person. It's literally woven into the fabric of the organization (and into the necks of their jerseys), and if the new guys don't realize it yet, they will grow to know it and hopefully carry it on.\nNew players have a lot to process in a little time, so getting them caught up will take a minute. But if they're around here long enough, it will become part of them. That's the power of a good story. And that one is one of the best.\n------------------------------------------------------\nHello Darin! I hope you are well. Who is the kicker? Will Eddy Pieiro join the team again? IsMatthew Wrightstill on the roster? Also, do you have any classic Panthers or DG motivational stories that could push me through studying and taking several AP exams over the next few weeks? School is mostly just preparing for exams right now, and with all this free time I have, I kind of need one at the moment. Thanks!Zach, Charlotte\nWould it be too on the nose to use the up arrow emoji and just refer Young Zach to the above answer?\nActually, I'm not worried about Zach at all. He's a good kid, with a strong work ethic and a curious mind and a heart for other people. He'll be just fine.\nWhether it's football or AP exams, if you start there and do the right things the same way every day, things generally take care of themselves. Process is more important than results, and one leads directly to the other.\nKind of like their kicker position. Wright is still here, yes. And if you look at his career stats (87.3 percent field goals, 7-of-11 from 50+), they're comparable to what Pieiro walked in the door with here three years ago (86.1 percent, 3-of-6 from 50+). Eddy is still available but the team appears to have moved on for now. There will be other kickers here, and they'll compete for that job, fitting with the theme of the organization at the moment, and the best man will win. It's not a settled position, but that guy will have the benefit of a veteran snapper in Jansen and a holder inSam Martinto work with, so he'll be in good hands.\nNow you, back to work, or as we usually say around here GET BACK TO CLASS, ZACH.\n------------------------------------------------------\nWe shored up some areas in the draft, but I think we still need another veteran safety to challenge our two young guys and add depth to the position. We also need another linebacker to help out if we have injuries. I thinkChristian Rozeboomis a good backup who can fill in, but I think we need another one to upgrade our depth.Bob, Aurora, CO\nWell, you can't do everything at once, and as we've talked about all offseason, this was never a one-year fix.\nI would imagine another safety will arrive at some point in the reasonably near future. They had Julian Blackmon and Marcus Williams in for visits back in March, and they're both still available, as are a number of other qualified vets.\nIf they had to line up and play today, you'd likely be startingTre'von MoehrigandLathan Ransom, and while they have some similarities, they could easily play together. But that position is still under construction.\nThe inside linebacker question is interesting, and Rozeboom is at the very least seems to be an upgrade over the depth they had in 2024. He started 11 games for the Rams last year, his most significant work on defense, and played well (135 tackles). He gives a solid third option along withJosey JewellandTrevin Wallace, who is recovering from offseason shoulder surgery.\nBut these things are never quite finished products, and those two positions, as much as any, figure to get attention throughout the next couple of months.\n------------------------------------------------------\nHey Darin! It's been a minute, busy offseason for me, much like for Dan Morgan and Co. (what a draft!). That being said, I've been having trouble locating info on UDFAs this year compared to years past. Saw we signed Moose's son who actually attended Myers Park HS while I was teaching there for a few years prior to COVID (along with some kid named Drake Maye and some McCown guy coaching on the staff). Cool stuff, would love to see more about those signings!John, Matthews, NC\nYou will, John, as soon as those contracts get signed next week. That market is one of the least understood, highest-pressure times of the football calendar. Some people refer to it as the \"boiler room\" because of the frenetic pace with which it is executed. Basically, everyone who didn't get drafted becomes an immediate free agent, and 45 minutes later, they've all agreed to contracts. It's high-pressure, and moves fast. And, I've seen deals agreed to get sideways, and guys not show up for reasons ranging from \"decided to retire instead\" to \"unable to acquire work visa\" in the case of an international prospect.\nBut yeah, there will be a lot of interest in that one guy. We actually talked to the elder Moose in question recently. Stay tuned for more around next week's minicamp.\n------------------------------------------------------\nI read your posts here and watched your videos during draft week. Now that that draft is over, one position that was not addressed in the UDFA signings was long snapper. I know we have JJ, but he will eventually retire, and we do not have a replacement on the roster. The former long snapper for Alabama, Kneeland Hibbett, was signed by Miami. If he becomes available, would the Panthers consider signing him?Thomas, Florence, AL\nA guy named Thomas? From Alabama? Discussing potentially replacing JJ Jansen?\nToo soon, man. Too soon.\n------------------------------------------------------ Hey Darin, it's Dan from Salisbury in England.I wrote you back around October time last year to touch upon an awesome, albeit unlikely encounter with a couple of fellow Panthers fans, Joey and his Dad in Vegas last year. This 'tail', pun intended, isn't football-heavy, but I thought I'd share nonetheless. So, my partner and I were planning on getting a puppy. However, we reached a sticking point. Basically, I wanted a Labrador, and she wanted a Cocker Spaniel. Like any good gentleman I ultimately relented, giving the green light on a Spaniel, on one condition; I get naming rights.\nI toyed with a few ideas, but when push came to shove, there was only one possible option, and in an ode to my favorite Panther of all time, we are now the proud owner of a 10-week-old four-legged companion called Kuechly. She's a little girl so I do have to refrain from bellowing out \"LUUUKKKEEEEEE!\" in the park but yeah, Kuechly the Cocker Spaniel, another addition to this year's stellar draft class. Keep Pounding!Dan, Salisbury, England\nAJ Klein is going to be minding his own business, walking through a park in Salisbury, England one day, and people are going to start yelling \"LUUUUUUUUUKKKE,\" and he's just going to start muttering.\nI love everything about this, from your story about finding things in common with fellow travelers in Las Vegas to your adorable new dog (almost as adorable as you thinking you ever really had any say in this transaction).\nI am also curious about dogs (or other animals) named after Panthers legends. I don't want my close personal friend Sir Purr taking offense, but bring 'em on.\n------------------------------------------------------\nAnd on that note, let's go lightning round, brought to you by the patron saint of the lightning round Jeff from Fuquay-Varina, to close it out this week.\nAfter the dismal pick of McMillan, how do we turn the lemons left to us into lemonade?Michael, Winston Salem, NC\nI'd say you don't need any more since you're already so sour. Let's see rookie minicamp unfold before we declare anyone a bust. Is that too much to ask?\nWhy don't the Panthers hire Julius Peppers as the head coach? I think he would be exactly what we need to succeed!!! GO PANTHERS KEEP POUNDING!!!Maria, Charlotte\nLemon. Peppers. I could go for some wings right about now.\nJulius would be wonderful in that role, except for one thing. He doesn't want to coach. Coaching is hard, and takes a lot of time. Being Julius Peppers is a full-time job, and he's great at it.\nHow many wins do you think Carolina could get? And you think Bryce and McMillian would have 500 yards or more this season?Branson, Stanfield, NC\nI'm going with more, and more.\nHow isJonathon Brooksdoing with his rehab?Joseph, Loves Park, IL\nHe's in there grinding every day, and making the best out of the bad hand he was dealt.\nNo question, just trade up get the guy from Boston College.Michael, High Point, NC\nYou mean Luke Kuechly? Great idea, love it.\nAs a Panthers fan that's moved to Florida and refuses to spend $400 on Sunday Ticket, I love listening to the radio broadcasts of the game on the Panthers site. Is it going to be the same crew going forward again next season? Getting to listen to Luke, Jordan, and Jake's takes as former players is super entertaining (especially when you can hear the field general come out of Luke when he sees something go wrong on defense; hopefully less of that this year!) Thanks, Darin!James, Sarasota, FL\nHaving traded up to get Luke, we might as well use him.\nYes, I am reliably informed that our radio crew is coming back intact, which is good news because they do an amazing job.\nAsk the Old Guy Submissions",
  "word_count": 4680,
  "scraped_at": "2026-02-14T12:43:29.596385"
}