{
  "article_id": "444433ed6252",
  "url": "https://www.indystar.com/story/news/local/indianapolis/2022/06/27/indystars-317-project-stories-all-indianapolis-neighborhoods/7704062001/",
  "title": "IndyStar 317 Project : Stories of all of Indianapoli neighborhoods",
  "date": "20230408T091500Z",
  "domain": "indystar.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "IndyStar's 317 Project: Here are all our stories so far\nIn October 2021, we embarked on IndyStar's 317 Project. Since then, reporters and photographers have been traveling to Indianapolis’ more than 200 neighborhoods. We are embracing who we are and how we live together. It’s our story, Indianapolis, one small everyday moment at a time. The 317 Project tells stories of life in Indianapolis’ vibrant neighborhoods — 317 words at a time.\nThis article was last updated on Sept. 25, 2023.\nLyn House in Windsor Park builds community through low-cost tutoring for Indy kids\nLYN House in the Windsor Park neighborhood of east of downtown reminds Hoosiers to \"love your neighbor.\"\nDecked out with an alphabet rug, shelves of educational games and a kitchen for making cookies, LYN House offers low-cost one-on-one tutoring to families in Indy.\nAfrican market bringing new tastes and connections to west side neighborhood\nKolawole Taofeek has been fielding questions for weeks. From folks at the barber shop next door. From people at the corner gas station. From daycare workers at the church down the street.\nThey all want to know when his store will open its doors.\nOld fire station in Keystone-Monon will show Black firefighters' beginnings in Indy\nIndianapolis firefighter Corey Floyd grew up in the Keystone-Monon neighborhood and served at the firehouses nearby.\nNow he’s back, ready to serve his community in a broader way, giving new life to a shuttered firehouse as a Black firefighter museum.\n“Joining the department was one of the best things that ever happened to me,” said Floyd, a battalion chief in the Indianapolis Fire Department and president of the Indianapolis Black Firefighter Association.\nThis Perry Township elementary school has a special relationship with a local church\nAt this year's back-to-school night at Mary Bryan Elementary School, the parking lot was so packed it was hard to even find a spot.\nThe yearly event, put on thanks to a partnership between the school and the nearby Southport Presbyterian Church, features food, games, a DJ and a chance for students to meet their teacher.\nWord of mouth and fresh bread draws the hungry to this Avalon Hills bakery\nWord of mouth and the scent of freshly baked bread draws the hungry to Sourdough Heaven in the Avalon Hills neighborhood of Indianapolis. This bakery isn't your traditional brick-and-mortar operation. It's a brick-and-mortar house peeking out from behind well-manicured shrubbery, blanketed by the leafy shade of two tall sycamore trees near Skiles Nature Park.\nA home-based artisan bakery suits Andy Anderson just fine.\nA giant rocking chair makes this New Bethel home 'heaven on the front porch'\nOnce, a pair of women drove up Steve and Louise Deckard’s driveway to inquire if their house was a gift shop. Although some might say it “looks like a Cracker Barrel,” Louise joked, this place she’s lived in for almost 40 years is a treasure to her.\nShe didn’t always feel this way. Louise swore that when she and Steve first moved into their house in 1984, it was an “nasty-looking little dump.” But the Deckards wanted to stay in New Bethel, where Steve’s family roots were already planted.\nNorthside comic book store proves some things are immortal\nThe Greeks have Zeus. The Romans, Jupiter.\nWe have Superman.\n“Superheroes,” Tim Reynolds said, “are Americans’ mythology.” They’re legends passed down from one generation of loyal followers to the next. Except tales of American heroes aren’t inscribed in ancient scrolls; our gods reside in glossy panels of comic book pages.\nComic Carnival is a regional myth itself.\nH.A. Waterman building, now housing The Auto Center, has storied history in Five Points\nEntering The Auto Center in the Five Points neighborhood, your eyes may be drawn to a colorful rooster greeting you on your way in the door. Although fun to look at, the bird is not the only thing unique about this business.\nA shop for auto repairs for vehicles of all makes and models, The Auto Center resides in a storied establishment.\nIn this corner of Bates-Hendricks, stray cats find their homes\nThe orange tabby that ruled South New Jersey Street went by many names: Garfield, Fat Gus, Toby. To Gretchen Szostak, he was Otis, the leader of a trio of cats called the OGs.\nOtis slinked up the porch looking for food and attention. At Szostak’s house, where four giant dogs bound up to the door, he found both. On Szostak’s porch sat an elaborate two-story wooden house, with five openings leading to beds of straw and blankets for stray cats and an occasional raccoon to lay on.\nAt Lynhurst Baptist's Wednesday night meals, 'All Are Welcome!'\nThere could be many reasons cars line up in the parking lot at Lynhurst Baptist Church on Wednesday nights for a free meal. Maybe the driver is exhausted and needing a break. Maybe they don't want to do the dishes. Maybe they can't afford food.\nRegardless, Ben Wakefield, senior pastor, said if there's food in stock, they won't go empty-handed. As the blue font on the church's website says, \"All Are Welcome!\"\n2 Amigos Mexican grocery keeps it in the family\nConchas caught the boy’s eye, and he didn’t want just one.\nThe shelves at Tienda Mexicana 2 Amigos held everything from Mexican chips and candies to prayer candles, but alas, not the sweet breads in bulk. The boy wanted a box, so his mother tracked down Joaquin Zarza.\nZarza, an owner and manager at 2 Amigos, tried his best – a stroll up and down the aisles, a trip to the back – with no luck. He sent the boy and his mother on their way with apologies and well wishes: a small gesture that, to Zarza, makes a big difference.\nTucked in a Carson Heights garage are Harleys and riders driven by purpose\nA handful of shiny Harley-Davidson Road Kings sit tucked inside an unmarked green and white garage off Shelby Street beneath a U.S. flag swaying in the breeze.\nIn place of the iconic Harley emblem is another winged logo labeled “Indianapolis Funeral Escort Service.”\nGary Harriman, 71, starts his morning tending to the bikes, which roar in and out of the garage multiple times a day. He owns and operates the business with his wife Michelle.\nHidden in Eastwood strip mall, a secret passage to Bruce Lee's teachings\nThe room is square and unassuming, tucked into an Eastwood strip mall off Binford Boulevard with little visible signage.\nPunching bags and equipment pile up on one half, as students stand in front of an opposite mirrored wall. A squadron of ceiling fans tries, in vain, to battle mid-June humidity.\nUFR Martial Arts instructor Ulises F. Rodriguez — barefoot, a black gi over his slight frame, with cloudy white hair — gestures for a younger, much larger student to attack him.\nEagledale in Indianapolis has a bar where everybody knows your name\nSometimes you wanna go where everybody knows your name.\n\"You know that show, Cheers?\" 70-year-old Linda Louise Foster asked through a pair of apple-shaped rose-colored glasses. \"This is like Cheers.\"\nShe nursed a Coors Light at the west-side Fat Cat Bar with the familiar lunch crowd on a recent Monday, and the bartender, Sierra Gill, knew her next drink would be vodka and soda with grenadine, plus a side of hangover-preventing pickle juice.\nHerron-Morton couple has created a 'carbon sink' brimming with trees, flowers\nOn about an acre in Herron-Morton Place, the Mausts operate what Rod calls a carbon sink. Surrounding their six-bedroom 1898 home are carpets of grass that wind around flowers, garden beds and trees. Definitely trees.\nCherry, persimmon, pawpaw, peach ... and Rod Maust and Martha Yoder Maust can keep listing more.\nThey're \"actually sucking carbon dioxide out of the air in a small way,\" Rod said.\nA tornado’s devastation united this Camby Santa Claus to do good with other St. Nicks\nWhen an EF4 tornado tore through southern Indiana in 2012, extreme winds and flying debris destroyed homes and wreaked havoc across the area.\nFamilies lost everything. In Henryville, schools bore the brunt of the damage among hundreds of buildings.\nAmong those impacted, children were the ones robbed of some innocence as the storm crushed towns. They needed a pick-me-up.\nChristmas came in late March to those who needed it most. Toys, stuffed animals and games. Eight trailers of playthings to be exact.\nFrom Cumberland? This lady might know more about your family than you do\nWhat’s to know about Cumberland?\nJoni Curtis is the woman to ask.\nShe knows stuff about the town — the only one in Indiana to straddle two counties; Marion and Hancock – that’s not in the books.\nLiterature has it plotted in 1831. Curtis thinks the town was in place before then.\n“There’s a man buried in the cemetery in 1790. So he had to have been here before 1831,” she said.\nFrog Holler works to keep identity against commercial development\nNestled into a crook of the White River, the Frog Holler neighborhood is an oddity of sorts.\nThe name doesn't show up on any map, but the North Perry area neighborhood on the southwest side was misnamed Frog Hollow for decades.\nPlain houses with chipping paint are hemmed in with chain-link fencing and rest on foundations next to more modern residences with crisply painted accents and well-kept lawns.\nHolliday Park is a beautiful, philanthropic-based metaphor for Indianapolis\nHolliday Park is 94 acres of perfection along the White River, between Meridian and Spring Mill, near 64th Street. Did you know? Me neither, not until Cap and I moved last month to the northside and looked for a park for our daily nature walks.\nWe found 3.5 miles of winding trails and a community of fellow walkers – hello again, Sid and Kathy – and a metaphor for Indianapolis: An overlooked gem that tells a story of failure and success, built with philanthropy, love and hard work.\nHolliday Park isn’t just in Indianapolis. It is Indianapolis.\nThe Grand Hall in Chapel Hill neighborhood celebrates big community moments\nA neon sign framed with plump red roses welcomed guests to Kim’s Sweet 16.\nBlack fabric draped across metal beams created curtains over a runway at the Grand Hall in the Chapel Hill neighborhood. Tall centerpieces on tables featured the same roses and dangling crystal-like gems.\nEmma Reyna’s daughter requested red and black decorations for the party, matching her red ball gown with delicate black lace details.\nHer mom delivered.\nIn Saint Vincent neighborhood, five decades of helping poor, elderly people\nColleen Yeadon spends every other Sunday serving lunch at Little Sisters of the Poor St. Augustine Home, a retirement facility serving some of the city's poorest elderly residents.\nIt’s one of the many things she and more than 130 other women do as members of the St. Augustine Home Guild, a volunteer group founded in 1967 to support the home. Members do day-to-day tasks, such as folding laundry, preparing food, making the residents’ bed, and changing bedsheets every week. They host happy hours (not the alcoholic kind), ice cream socials and bingo.\nThe love story behind these unique houses in Lockerbie Square\nThe houses catch the eye immediately when strolling through Lockerbie Square. Two cottages, bright blue and muted mauve, sit side by side.\nBut the houses' defining accessory is a tunnel connecting the two dwellings like hands clasped and connected. It's a unique feature even in a neighborhood full of historic homes.\nHelen Small, who currently lives in one of the homes, said the story goes back decades.\nIn Martindale-Brightwood, an alternative to a junkyard awaits car lovers\nTheir hands are caked in grime as they wrench at the car. Their toolbox sits nearby. They’ve spent hours at the yard, but for regulars at the Pull-A-Part in Martindale-Brightwood, the end result is worth it.\nEvery day, customers take their pick of car parts among the sea of automobiles — however obscure. The only catch: They need to remove the pieces themselves. Two dollars is all one needs to get into the yard. For those who find what they want, they’ll pay a reasonable price versus what they’d pay for a new part.\nPrindell Young said that’s part of the appeal. But mostly, he enjoys the do-it-yourself spirit.\nTha Corn Man fires up Mexican street corn in Fall Creek Place food truck\nShrouded in charcoal smoke in a Dollar General lot, Timmy Campbell is trying to start his generator.\nThe Houston native is, to his loyal customers in Fall Creek Place, just Tha Corn Man. “Hey Corn Man!” they’d call out. His food truck’s front plate reads: Corny. He calls his 10-year-old daughter “the Corn Cob Kid.”\nThe love for elotes sprung from his Texas childhood, when Mexican street corn was abundant at food trucks. Then came the Gary of his teens, when Campbell would wake up to the corn man’s bell ringing down the street.\nHe'd fish in the Amazon if he could, but this Crossfield pond has something more unique\nThe pond is still, and green. The grass around it has been tamed by mowers. It's guarded by tract homes on one side and a 2-way road on the other. No towering forests, or White River-like currents.\nBut the fishing is decent, and that’s enough. Soon, when the weather warms, the young fishers of Crossfield will bike out here with their poles and toss lines into the water.\n“It’s run by the kids around here,” Matthew Danz, 19, says, as he watches his bobber – a dot asleep on the surface. Waiting for it to talk to him.\nIndy's Irish Ink, where art meets pain therapy\nHannah McKenry has a good feeling about turning 27. It's a year for change.\n\"It's a pandemic thing — I completely lost my mid-20s. It feels like I jumped from my early to my late,\" she said. \"And I feel really ready to change my life.\"\nShe decided to mark that milestone with a tattoo, specifically a birthday cake featured on an album by American dream pop duo Beach House.\nAs it works out, her tattoo artist and friend, Kay Robertson, was free at Irish Ink Tattoo and Piercing in the Perry Meridian neighborhood of Indianapolis' south side. Even as other tattoo shops opened and closed, the tattoo parlor on Meridian Street stuck around.\nSkate park in Stout Field fills niche in city's skateboarding community\nTucked inside an unassuming warehouse in Stout Field, you'll find the city's only indoor skate park.\nQ Skatepark, 1727 Stout Field East Drive, provides a weatherproof haven for first-time skateboarders and experienced riders alike. The cavernous space with its graffitied walls has even hosted skateboarding icon Tony Hawk and rapper Lil Wayne.\nBryan and Shane Apolskis opened the park in 2016. The same warehouse also serves as headquarters for their event management business, Sequence, which puts on the city's St. Patrick's Day parade.\nNora restaurant offers slice of Burmese history, and cuisine\nStep into Htaw Metta on a busy weekend afternoon and you might hear five different languages in the cozy Nora restaurant; patrons chatter in Burmese, Karen, Thai, or English and in the kitchen, Mon, another Burmese language.\nThe language mélange reflects both the eatery’s cuisine ‒ a mix of sushi, Thai, and Burmese offerings ‒ and the owner’s life story.\nBorn in then-Burma, now Myanmar, near the Thai border, Htira Rammahtaw belongs to the Mon people, one of Myanmor’s many ethnic groups. As a young man he moved to Thailand but his people were subject to persecution there.\nWanamaker Feed & Seed owner has front row view of 'Small Town, USA'\nAt Wanamaker Feed & Seed, Jim Trimble has sold customer service for 45 years.\nDown the street from the neighborhood church and across from the local fish fry spot, Trimble’s customers visit for more than just hardware, pet supplies or poultry feed.\n“We don't sell anything you can’t get at some other store,” Trimble said. “We don't have the market cornered on anything, so we try to know what we are selling and pass the knowledge along.”\nIn Crispus Attucks Museum, Black voices share Black History loud and clear\nYou couldn't hear much inside Crispus Attucks Museum. Not on a late Tuesday afternoon, even as boisterous students attending Crispus Attucks High School filtered out of yellow buses under cold and cloudy skies.\nThe museum, 1140 Dr. Martin Luther King Jr. St., shares a common wall with the school's gymnasium. But for the sharp squeak of tennis shoes, the occasional tweet of a coach's whistle and faint shouts from boys playing basketball, all was peaceful and quiet.\nBuddhist temple and sculpture garden call Indianapolis east side community home\nIt's tucked away so that most passersby wouldn't even know it's there. But on South Franklin Road in Indianapolis' Raymond Park neighborhood, hidden behind a house, is a Buddhist temple and sculpture garden.\nThe Phap An Temple made the eastside community home a few years ago. When they bought the football-field-sized lot, it was overgrown and full of brush, said Deborah Nguyen, a Temple member. But members worked to clear it out and turn it into something special.\nLantern Hills church combines outreach and nature to serve its community\nA church located on about 3.3 acres of mostly woodsy land in Lantern Hills is an oasis of hope and help for its congregation and east-side neighbors.\nThe Church of the Nativity-Episcopal goes beyond traditional worship to be a community resource. On the second Saturday of each month, for instance, volunteers distribute free pet food to families in need ― a ministry started during the pandemic. And when unexpected life events arise, members step up to cook and deliver hot meals.\n'Little winks from the universe' have shaped this bar in Twin Aire\nFinding used furniture in one’s preferred color palette might seem trifling. But not to Nicole Oesch ― not if you know the history of Kismetic, a bar and brewery she and husband Ryan own in Twin Aire.\nKismetic opened for business in April 2022. The name is a portmanteau of Kismet, or fate, and kinetic, the energy of movement. Destiny and motion. Signs of it are everywhere... if you know where to look.\nA beloved southside newspaper serves its community\nAbout 60,000 readers in Perry and Decatur townships turn to the Southsider Voice when they want to learn what their neighbors have accomplished, how the high school baseball team fared, where to find a good plumber or who just died.\nWho better, then, to deliver the news than editors and writers with years — and years — of experience. The Southsider Voice likely has the hardest working staff of 70 and 80-somethings in the business.\n“I pinch myself every day to be 78 and still active,” said Editor Al Stilley. “It’s rewarding when readers say picking up the paper is like meeting an old friend.”\nA blue star flag in Pheasant Run displays a proud father's patriotism\nYou can see the creases on the blue star flag that hangs above Dewain Divelbliss’s home in the Pheasant Run neighborhood on the southside.\nThat’s because Divelbliss, 58, doesn’t go too long without replacing the flag once it starts getting worn down, out of respect for his daughter who is currently deployed in Kosovo.\nIt was hard, he said, dropping her off at basic training camp.\n“You know, when you’re a father, you always swore that you would protect your kids,” Divelbliss said. “But I realized when driving home that day, and when she raised her hand and took her oath, she was now going to protect me.”\nThe landscape in Drexel Gardens has changed. For one resident, a comforting constant remains\n“I just like roosters,” smiled Debra Hancock in a poultry-themed purple hoodie. They've been a familiar presence to her since childhood.\nWhen little, she traveled every summer to her grandmother’s house in Arkansas. There chickens roamed freely, and her family pitched in helping to prepare them for mealtimes. Debra’s responsibility was to pluck feathers, a job she hated, but the trips were fun.\nA lifelong resident of Drexel Gardens, Hancock has witnessed her neighborhood undergo dramatic changes. There to witness them are a constant and comforting assortment of chicken figurines she keeps in her yard, including a 6-foot-tall rooster statue her granddaughter calls, \"the chicken.\"\nIn this Meridian Hills kindergarten classroom, children learn how to communicate and express their feelings\nChildren at the Meridian Hills Cooperative Nursery School & Kindergarten learn strategies to deal with their feelings, impulse control and communication which helps them in a classroom setting. This could mean they become better at talking through their emotions, sharing their toys and communicating with others when they play.\nWhen a student lay on the floor asks if it's lunchtime yet, a teacher stated what time lunch would be, recognized that they were hungry, and redirected them to a different activity.\n\"It's important to honor those feelings,\" teacher Linda Foley said. \"Help children explain what they are feeling and experiencing and most importantly listen to their emotions.\"\nHow this thrift concept went from a storage unit to a storefront\nFrom 90s NBA Champion jerseys to patched jeans, the Naptown Thrift shop off 54th Street and Keystone Ave. has unique vintage clothing from all over Indiana.\nWhen you walk in, you’re greeted with rows of clothes hanging from the ceiling. Posters of various artists, clothing brands and movies cover almost every inch of wall space. The place may look small, but it is packed tight front to back with vintage clothes.\nVintage posters and signs cover the walls of Naptown Thrift. The concept was started in 2015 by Aaron Marshall and his parents out of a small storage unit. Marshall and his parents had been collecting vintage pieces from Indiana throughout his childhood, at garage sales, thrift stores and flea markets.\nBoys & Girls Club worker shares passion for shoe design with kids\nMalcolm Goggans started going to the Keenan-Stahl Boys & Girls Club when he was 10. It was a place where he learned how to open up and process his emotions.\nNow, 11 years later, he works there, though he doesn’t see it as work.\n“I don’t really feel like I have to be a certain way,” he said. “I can always just be myself and just be goofy.”\nUnlikely trio, joined by a love for antiques, run Tim & Company's\nTim & Company’s Another Fine Mess is a store of little (and some very large) treasures in the near eastside.\nWhen you enter the store from 10th street, your eyes might catch on the chairs hanging from the ceiling, or the boxfuls of antique doorknobs. Or perhaps, when you walk further in, you might marvel at the room full of doors, the shelf of neon letters or the stack of windows in the basement.\nThe antique store was opened 12 years ago by Tim Harmon, 70, and his wife, Julie Crow. Though Julie has since retired, she sold her share of the store to Karla Folker, 32, and Katie Kelly, 27. The couple hopes the store will remain open.\nSoccer pub relishes World Cup fever\nInsignia from various soccer teams dot the walls of Chatham Tap, a pub in the city’s Chatham Arch neighborhood, with no less than seven screens to give a clear line-of-sight to games – the perfect place to catch a World Cup game.\n“We opened in September 2007,” owner Daniel Jones said. “Really from the start, soccer was something I wanted to show.”\nIn 2014 and 2015, Indianapolis blocked Mass. Ave off so the soccer pub could show U.S. men’s and women’s World Cup games on a giant screen. Those summer block parties haven't happened since those years and this fall's cool temperatures aren't conducive to outdoor revelry.\nSide by side, 2 Lawrence businesses bring joy through music\nIn the corner of a Lawrence strip mall, music is almost always playing.\nInside Power P Bounce & Co, the energy is electric one Thursday, as the fast-tempo tunes from a bounce class rattled the parking lot.\nBouncing, or Kangoo Jumps, is a cardio workout where special footwear allows for less joint stress and more strength building.\nArthur's Music Store rich with history, connects people with music\nLinda Osborne is a historian of sorts. While not in title, when she talks to her customers at Arthur’s Music Store in Fountain Square she comes armed with years of historic knowledge — whether about the store or the various instruments they sell.\nKnowledge about the clientele who’ve visited for generations since the Shelby Street store was opened by her father, Amos Arthur, in 1952. And knowledge about instruments from the country’s past she still holds dear.\nAmy England, Osborne’s daughter, helps run the store and can explain both the history of instruments and the science behind how things like aged wood in a guitar changes its sound.\nFrom donating breast tissue to donating breast milk, why one mom continues to give back\nAs a mom, Avril Pitt knows what only a mother can.\nThat among all the problems, pain and peril across the globe, the sound of an infant’s empty stomach – especially if it’s your baby – rings the loudest.\nShe walked out of IU North Hospital in June 2018 with her firstborn son and, a few bags of donor milk from the Milk Bank. Pitt didn’t need it but said the hospital gave it to her as a backup. Just in case.\nShe teaches kids to love nature by letting them play outside at Fort Harrison\nTeaching kindergartners is about play. At least, that's what Jerri Roberts, 68, thinks and part of why she finds it so delightful.\nAnd one of her favorite places to bring her students — typically ages 5 to 6 — is Fort Harrison State Park. Unlike older kids, her students are always enthusiastic about everything, she said. \"The kids,” as she calls them, will jump in the water, run along the trail and even pick up (nonvenomous) snakes.\n“I want them to love nature. And if it means playing, if it means climbing on logs, whatever. I mean, just get them out here,” she said.\nHe's been through 'the struggle,' now he's a business owner helping others\nMonty Ramadan is a philanthropist, owner of the retail store Hang Time Indy, and a man who, despite his successes, knows “the struggle.”\nForty-five years ago, Ramadan was born in the Palestinian territory West Bank. A place where his childhood memories of fertile olive trees over mountain slopes have been replaced by images of poverty and violence.\nIn 1987, he fled the area with his family to escape conflict and settled in Chicago’s south side.\nMeet Indianapolis' Old School Players, a golf club for the young at heart\nIf you want to be a member of the Old School Players, club president John Durant says there’s a few things you ought to know.\nFor starters, Old School Players aren’t a bunch of guys out there “running with the young ladies,” Durant explains.\nIn fact, the Old School Players aren’t doing much running at all. It’s a senior golf club, governed by standard bi-laws and an interesting set of unwritten rules.\nYoung love flourishes on the banks of the White River\nSarabi Carranza and Chris David might've passed each other at prom.\nThey probably wouldn't've crossed paths in the hallways of Ben Davis High School, where David, 19, attended and 17-year-old Carranza is a senior, because they had different schedules.\nBut Carranza had another date. David went alone. They didn’t know each other then.\nFolding clothes in Grace Tuxedo with all things culinary on her mind\nJulia Montgomery finds a few moments every day to conjure a recipe, learn wine pairings and perfect the yeast roll.\nIt took a long time to discover that working in restaurants might be what she was meant to do all along. She aims to open her own restaurant and wants to run the show.\n“I always tried to find what I really wanted to do,” Montgomery said in a Grace Tuxedo laundromat.\nViolet's daily walks bring joy to her neighbors\nViolet Bayne anxiously eyed the door of her house, desperate to get out for her morning walk.\nShe hates to be late.\nViolet keeps a strict schedule. Every day at 10 a.m., she’ll meander to her neighbor’s house, where she’ll eat a meal and spend the day napping — on the sunny porch or inside the cozy home.\nIn a Brookside Park field, a young man shadow boxes\nArtemio Guerrero stands solitary in the field of Brookside Park on the east side. He’s dancing through punches without halting.\nAnd every jab, he lets out breath ― a result of his exertions.\n\"Hmrph,\" he grunts repeatedly.\nHow one barista uses sticky notes as ice breakers\nJohn Vazquez is an artist with an unconventional canvas.\nHis purpose, though, is quite ordinary:\n“To listen and talk and try to connect with someone,” Vazquez said.\nLocal craftsman builds, sells wagons to customers around the country\nIn 2000, a friend asked if Tony Boyle could build a horse-drawn wagon. Although he had never built one before, Boyle had experience with a similar product.\n“I worked at a parade float company,” Boyle said. “So, to me, it was just like a miniature parade float.”\nSince then, Boyle has made more than six dozen wagons.\nShe plays football against boys twice her size, she's not afraid\nIf you meet Danila Breaziel, prepare to be surprised.\n“I’m one of those kids,” Danila says, “I’m going to do something that you’d never expect.”\nThat is, of course, unless you expect to meet a 15-year-old girl who plays varsity linebacker, or, a girl who calls herself an “old-head” and has the wisdom to match.\nBradley's Lemonade is a sweet summer treat\nBradley Paulson loves lemons.\nIf you couldn’t tell from his lemon hat, lemon-patterned tablecloth or lemon-themed Squishmallows, his lemonade stand is a dead giveaway.\nSet up in front of his sister Alexis’ apartment — on a busy street in the Christian Park neighborhood — Bradley’s Lemonade stand beckons passersby to enjoy a refreshing beverage. He’s been selling every summer since he was a kid.\nPainting by Indianapolis artist brightens busy portion of airport concourse\nImagine a background of a series of brushstrokes, blocks of pink, blue, tan, purple, white and yellow with small swoops of white arching over parts of the scene.\nPainted on top of the colorful setting are figures with triangle-shaped bodies and perfectly circular black faces with no facial features. Each one of them has a distinct accessory – a hairstyle, piece of jewelry or color of their garment.\nAlso on the mural are multiple electrical outlets – because the mural surrounds the blocked-off area of what once was a Starbucks in Indianapolis International Airport.\nFormer army paratroopers find connection over weekly lunches\nOn any given Wednesday, you’ll find a group gathered at Skyline Chili.\nEvery week, members of Tillman E. Beikes-Indianapolis All-Airborne Chapter of the 82nd Airborne Division Association get together for lunch. They're all former paratroopers, of many eras.\n“They've got all of our orders memorized,” Ken Stiles said.\nFour cellos, three daughters, one mom and their special bond\nSometimes, a parent’s wishes and a child’s wants collide.\nSarah Clayton, mother of three, wants her daughters to learn to play cello.\nNot just because she grew up playing music, or because her husband did too, but because she’s hoping her daughters “learn to work through something hard.”\nFrom graphic design to tire shop, taking risks helped him find his livelihood\nAt American Eagle — not the clothing store — Mahmoud Baidas helps out two customers needing new tires and rims. They’d just dropped by because a friend had recommended this tire shop in the Venerable Flackville neighborhood.\n“This shop is like a neighborhood shop,” Baidas said.\nHe’s a manager and partner at the business, which sells tires, old and new, and offers some mechanic services. He wasn't supposed to be here, not for this long, anyway.\nIndy urban farmer left college to grow food, improve his community\nShortly after 9 a.m. on a Thursday, Kevin Goheen was clipping ripe tomatoes from the vine in the high tunnel greenhouse at the farm for Growing Places Indy, an organization that improves community wellness through urban agriculture and food education.\nDivided into a few areas around the lot for Arsenal Tech High School, this farm has two greenhouses, 12 chickens in a chicken coop and about 26 different plants rooting into 18 raised beds and rows and rows of healthy topsoil.\nBarbershop Talks series aims to spark open dialogue with city's youth\nIt wasn’t the start he planned.\nA pothole flattened his tire making him late.\nIt wasn’t the stage he wanted.\nPaintings of elephants, hearts and cupcakes on one wall. Red, pink and powder blue drapes dangled down another.\nAt this pool, a lifeguard watches for danger, while pool-goers make memories\nAs the temperatures steadily climbed on a Friday in July, Irvington residents spread out across Ellenberger Park's pool.\nSome embraced the sun and laid out while a few women snagged the shade under the sole awning. Many kids took to the water, floating, swimming and splashing.\nThe pool had been open for two hours when Lily Foerster approached the first lifeguard stand. She was starting the rotation, shifting the guards through each of the four chairs stationed around the pool.\nCelebrating the gift of American citizenship, finally, this Fourth of July\nMyoline Zimanche’s baby kept her busy on Friday morning.\nMinutes before her citizenship naturalization ceremony, she chased after her wandering toddler at the Benjamin Harrison Presidential Site. As the Judge began the roll call, Zimanche picked up a fallen pacifier, kindly pointed out by a nearby compatriot.\nAfter reciting the oath — and multiple toddler escape attempts, seat shifts and smiles from adoring strangers — Zimanche calmly cradled her daughter while listening to “America the Beautiful.”\nCelebrating their 'queen' at 90 as her memories fade\nWhatever Esther Williams believes is what she knows.\nThat’s what her neurologist told her family when she started to forget. They were finding things in the wrong places. Faces became a strain to recognize.\nIn 2017, Esther had a stroke. Her mind started to change and she was diagnosed with vascular dementia. Her daughters, Jerri McReynolds and Ellen Cavanaugh, manage her life.\nShe used to sell hair products door-to-door. Now she owns a diamond store.\nBefore selling fine diamonds under the sparkle of a chandelier, Joann Carter endured life’s bumps.\nShe grew up in the “projects” of Cincinnati, Ohio. Survived a teenage pregnancy. Relied on welfare. Lived in low-income housing.\n“I came from nothing,” Carter, 63, said.\nOne of Crown Hill's hidden treasures lies just beyond its gates\nIt's stayed hidden just beyond the gates of Crown Hill Cemetery for over a century, easily overlooked amid the expanse of graves. It cries out only on occasion, the sound of a soul nearing its final rest.\nThe treasure is closed to the public, cloistered in a tower atop flights of rickety stairs in a shadowy, dusty attic. Though shuttered windows acquiesce flashes of light onto its surface, it's virtually invisible from the outside.\nBut when the bell tolls, it's impossible to ignore.\nSights and sounds from the White River, a waterway for the people\nSunshine glimmers on the water’s surface. Like blue-green brushstrokes on a canvas, small ripples capture twinkles of light, one gently folding over into the next.\nAs the world around it comes to life, the river dances.\nAbove, an eagle lurks not far from its nest. A pair of Blue Herons fly low to the water. Red sliders and painted turtles slide off downed trees, dropping like pebbles.\nHe opened his Speedway home to strangers. This Indy 500, they mourned and honored him.\nIn the shadow of the Pagoda outside the Indianapolis Motor Speedway, when the race was gritty and Reagan was in the White House, rain fell on the world's racing capital.\nIt was 1986, and the rain fell so hard that it postponed the Indianapolis 500 a week. In town from Iowa with nowhere to go, John Houser waited for a tow in his RV.\nBy a stroke of luck, he was parked in front of a 1950s classic ranch on Auburn Street, where Ron Rumble was sitting on the porch.\nThere's a secret in the Motor Speedway Museum's basement. They're letting people in on it.\nIt’s not much to see at first.\nShadows line the garage-like room. It’s an eerie feeling after riding a fairly compact elevator to the bottom floor of the Indianapolis Motor Speedway Museum.\nWhen the fluorescents come on, any eye would be magnetized to the beloved, fiery red 1964 Ferrari 250LM parked behind a crisp, silver 1954 Mercedes-Benz W196 with that famous three-point emblem adorned on the hood.\n'Indy Anna' follows in her mother's footsteps to help fans reach the Indy 500 stands\nAnna Allen's favorite month of the year is the one in which she works the hardest.\nIt's the month she gets excited for when she sees the multicolor flags hoisted around the track. The one that makes her two-minute drive home much longer. It's the time of the year that shakes her office — literally.\nIt's all for the day she always hopes will be 70 degrees and sunny.\nRock 'n' roll, beer and pancakes at Charlie Brown's during Indy 500\nA mile south of the entrance to the racing capital of the world is Charlie Brown's Pancake & Steakhouse.\nA place where the waiters call you “hun” and the guy seated next to you knows what the guy walking in will order before he sits down.\nA place where rock 'n' roll reverberates from the speakers, pancake batter sizzles on the grill and motorsports paraphernalia covers every wall from floor to ceiling.\nThis father-son duo watches the 'pageantry' of Indy 500 as fans and 'yellow shirts'\nDecades ago, before he was entrusted with protecting thousands of people at the Indianapolis Motor Speedway, Dan Hagist was a typical east-side teenager looking for a good time.\n“When we were in high school, any chance we could get, we'd go out there,” Dan Hagist said.\nHis favorite story is about a rambunctious stunt caught on camera. When a high school friend went to watch an Indy 500 movie with his father, the opening scenes showed a rowdy crowd at the track’s first turn. They were throwing someone up in a blanket toss.\n10-year-old girl champions her first 13-hour fast celebrating Ramadan\nShe was nervous the night before.\nBut by the touch of her mother’s hand, she woke up the next morning at 4:45 excited.\nIt was the second Friday of Ramadan: the day 10-year-old Sareena Kheiri would complete her first full day of fasting.\nA mural garden, cultivated by neighbors, sprouted up in Broad Ripple\nDeborah Jacobs planted seeds to start a mural garden.\nInspired by massive murals in San Francisco or Chicago, Jacobs set to spread color and fun. Over nearly three years, it’s grown.\nBlooms and greenery popped up almost overnight along a white, gravel road in Broad Ripple. Nearly every house plays host to a mural.\nIndy's hidden oasis rumored to have inspired a Humphrey Bogart film\nEight miles northeast of downtown is Brendonwood, a hidden oasis considered by some as Indianapolis’ best-kept secret.\nRain or shine, Brendonwood veteran groundskeepers Michael Copeland and Andrew Hast are there to maintain it.\nPlowing, paving, mowing and trimming, they tend to the common grounds – roughly 90 of Brendonwood’s 350 acres – which includes roads, ditches, ravines, a tennis court, swimming pool and nine-hole golf course.\nShe's in charge. This teen is a boss at Ritter's Frozen Custard and in life\nAt Ritter’s Frozen Custard in mid-March, in the middle of the day, 18-year-old Sanai Mavindidze is whipping up sundaes, smoothies and Italian ice slushies for customers.\nShe's at the helm, surrounded by heaps of sweetness. Everything you’d need to fall deep into a full-fledged sugar coma. Hot fudge. Caramel. Whipped Cream. Oreos. And of course, their signature frozen custard.\nGood enough that people will pay double to get it delivered through DoorDash.\nTeen's life moves fast. How roller skating is helping him slow down\nTerrence Hackett II shows off a pirouette-style move and falls on the hardwood floor at Skateland Roller Skating.\n“We all fall,” he says nonchalantly, getting back up.\nHe used to be nervous about looking silly when trying new moves. But today, he’s fearless.\nLife lessons in 3 moves for 6th grade girls volleyball players\nA ball hits the floor, followed by fists raised and someone screaming, “no!”\nTen girls, ages 11-12, pause in frustration. And fear. The possibility of punishment awaits.\nTeam Indiana Thundercats head volleyball coach, Rebecca Murray, gives them two options: 20 tuck jumps (an upward bound, both knees to the chest), or redemption, another attempt at the practice drill under the condition that if the ball touches the floor again, before the 30-second timer stops, they’ll have 30 tuck jumps.\nHe went from sitting in the back of a cop car to now driving one just like it\nDaniel Higgs likes his 2010 Ford Crown Victoria, a retired Indiana State Police car he purchased in May 2020 — a month after being released from prison for armed robbery.\nIt looks identical to a cop car: a spotlight near the driver’s sideview mirror; clear strobes in front; red and amber lights in the back; but, no blue lights anywhere, “because that’s illegal,” he said. The siren on it would be, too, if it wasn’t disconnected.\nBehind the steering wheel, Higgs surveys the Indianapolis streets, looking to save people like his former self — those experiencing homelessness or addiction, those accused of crimes — humbly aware of the times he sat unwillingly in the back.\nCentral Library cafe serves 'community and coffee over capitalism'\nWarm light shines through windows at the downtown Central Library creating a glow around the Double Cupped cafe.\nFor some, the baristas are angels or at least bring a little bit of joy on an otherwise bleak day.\nAt the counter, a library worker, a gaggle of giggling high school students and a woman carrying everything she owns in a large, white trash bag wait their turn.\nIn business and in life, they found ways to 'create something out of nothing'\nDaniel Figueroa sits, head down with tremendous focus on resizing a ring at D&L Jewelry & Repair. A magnifying optivisor helps his eyes inspect the granular detail work. A ring mandrel and hammer allow him to chip away at the silver metal band.\nToo gentle and the metal won’t move. Too strong and the ring will be ruined.\nAcross the hall, Laura Gutierrez stands behind a display counter, answering calls and greeting customers.\nDancers come to slay, gain confidence in Saucy Stiletto class\nDim the lights. Raise the music. Roll the body. Get loose.\nTime to strut.\nPlatforms, knee-high boots, booties and daunting stilettos sashay across a scuffed floor. The controlled movements reflect in the DanceWorks Indy studio mirror, just south of Lockerbie Square.\nThe 'lavish' Black country club where Sammy Davis Jr. once partied\nAt Christ Church Apostolic on Grandview Drive, with one hand in his pocket, Pastor Sora Walker Jr. vacuumed the floors before heading to bible study.\nFor over 50 years he’s been coming here, but it wasn’t always to worship God.\nEstablished in 1969, this was the grounds for Scenicview Country Club, a Black-owned country club – and premier destination for Indianapolis’ Black middle class – described by the Indianapolis Recorder as “lavish” and “luxurious.”\nMusic fills her days — and the Lord fills her music\nWeekdays she plays to teach her students. Sundays she plays for the Lord. Thursdays Alice Lee-Hopkins plays for herself.\nThat’s when she sits and lets her fingers dance across 88 keys. The tunes always resonate from her piano of more than 50 years, a gift from her musical parents.\n“Music fills up my day,” Alice said, a lifelong musician.\nOne man, one year, 5,000 pounds of trash cleanup along Eagle Creek Park\nAn hour after sunrise, one cold winter morning, Michael Brunette dragged a 40-gallon trash bag, half full, along the edges of Eagle Creek Reservoir.\nHe’s been coming here to hike, fish and canoe for 50 years.\nOn this day however, armed with green gloves, Muck Boots and a trash picker, he voluntarily removed litter, like he has been doing almost weekly since 2013; the year he retired and, the year when he witnessed so much litter in some areas “you could hardly walk” without stepping on trash, he said.\nHe survived a near-fatal accident, now he’s the king of his care center\nNicholas Behymer, the king at Autumn Leaves of Eastgate, is a man of few words, usually just two.\nAsk him if he likes the Colts, he’ll say, “It’s fun.”\nRap music? “Oh yea.”\nBeech Grove pizza shop is a place of liberation for LGBTQ community\nThere’s a pizza shop in Beech Grove where Sam Cooke plays on the kitchen radio, while above the door, a taped photo of shirtless David Hasselhoff watches over.\nDaisy Gomez, a cook there, preps pizza prior to opening.\nShe has cotton-candy pink hair, powder blue eyes, two gauged ears and a nose ring. She’s in a heterosexual relationship but identifies as bisexual.\nHe's lasted in the bowling industry over 40 years, despite decades of decline\nInside of All Star Bowl, south of 10th Street, east of North Shortridge Road, a familiar sequence of sounds unravels: the distinctive thud of a three-holed urethane ball dropped to the floor, the boom before pins fall.\nMark Shoch, the bowling alley’s manager, has been listening to it for 52 years, ever since he grabbed his first bowling ball at the age of 6.\n“I remember sitting down and rolling it two-handed,” Shoch said.\nFirst she saved her mother's life. Now she's out to save her community\nWhen Tiwuana Harris left Indianapolis and moved to Alabama in 1993, she never imagined coming back.\nShe had grown accustomed to year-round southern sunshine and didn’t want to return to cold, grey winters in Indiana.\nBut in 2005, after divorcing her husband, “The Lord said come back to Indianapolis.”\nThis Indianapolis man can't say no to helping. But he also doesn't want to.\nScott Splichal has trouble saying no.\nHe offers up that fact like it’s some sort of deficiency. But the ear-to-ear smile on his face as he explains his inability to turn down an opportunity to help shows his hand.\n“I really believe in giving back because I've been so blessed,” he said. “Volunteerism is what keeps things going in the city of Indianapolis.”\nHer daughter's autism diagnosis led this mom on a mission to help families\nJust west of the railroad tracks cutting through West 71st Street, smiling children ran inside a building constructed in the 1800s.\nLess than a year and a half ago it was vacant. Now, it’s the home of Autism Companion Services, run by Founder Jane Hornett.\nShe first “stumbled” into the location in July 2020.\nAt this tiny book share, the literature comes and goes but the love remains\nWhen the residents of East Avalon Hills pass by the intersection of Hampstead Lane and Kingman Drive, they might not see the Little Free Library.\nThere are over 100,000 book-sharing boxes across the world. Though small and easy to miss, this one — named the Wayne Wright Memorial Library — is all but invisible to Jennifer Wright.\nShe built it on her yard with her father in spring 2020 and named it after her husband, Wayne Wright, who died on May 19, 2018, the day after their five-year wedding anniversary.\nThey met in 1964. 57 years later they biked in their 50th state together\nFrom the dining room table, where bright yellow chrysanthemums absorb sunlight coming in over Indian Lake, Thomas Crouch sat looking at a family portrait from 1983, “the year it all began.”\nNot the year they first met on a blind date as students at IU in 1964; nor the time they got married eight months later, 57 years ago.\nNo, in 1983, Thomas and his wife, Marjorie Crouch, took a cross-country bike trip from Oregon to Delaware with their 11-year-old son and 15-year-old daughter – a memory protected by the picture frame Thomas held in his hands.\nThe artist hoping to turn motorsports history into fine art\nOn the east side of South Franklin Road, a paved driveway leads past a field of grazing horses up to a barn.\nMost mornings, Gary Dausch walks a few miles for exercise, has breakfast and heads inside.\nHe positions himself in front of a canvas, grabs his tools and begins to “lose track of time,” painting life-like images of motorsports’ cars and drivers in excruciating detail.\nCentury-old Slovenian social club struggles to survive\nIn Haughville, less than two miles from IUPUI, there's an old, red brick building with \"Slovenian National Home\" etched into stone above the front door.\nIt is the headquarters of the Slovenian National Home Association, a private social club established in 1918.\nPast the rusty chain-link fence and broken window, there’s a private entrance where three men gathered inside: Phil Lambert, president; Rok Cerne, vice president; and Charley Turk, treasurer.\nWhen this Hoosier died, he left behind thousands of items up for auction\nA few miles east of Interstate 74, between the cornfields, a maroon 1946 Chevrolet Stylemaster gathers dust in a garage on the south side of East Thompson Road.\nBeth Wheeler, 52, is the car’s owner. She lives in the home adjacent to the garage, directly across the street from the house where she grew up.\nThere, on the other side of East Thompson Road, lies two 1964 Ford Thunderbirds, dozens of doorknobs, hundreds of caulking tubes, thousands of tools and a barn so filled with “stuff” you can’t walk more than two feet into it.\nThe love story behind Smokin' Barrel Barbeque\nEast on Brookville Road, smells of burning oak and hickory spilled from two large barbecue pits nearby.\nBeyond the clouds of smoke carrying the aroma, on the north side of the road lies Smokin’ Barrel Barbeque.\nMike McFarland, the pitmaster, chopped up brisket inside. Cassandra McFarland, his wife, called out the ticket orders.\nAn Indianapolis ice cream shop on the far east side where dreams come true\nBehind the counter at Delicias Monarca, a traditional Mexican ice cream shop on the far east side of Indianapolis, Emilia Gonzales serves homemade ice cream with a smile.\nShe is the shop's proud, unofficial owner, something she could have only dreamed of 20 years ago.\nIn 1999, Gonzales boarded a bus in Michoacán, Mexico, with her mother and headed toward the border.\nThat old bus at 59th and Michigan will move in hyperspeed soon\nThe old school bus has been parked at 59th and Michigan for about three months, but Jeff Piper feels like it's been frozen in place for years.\nHis dream is turning the bus into a mobile grocery store, staffing it with fellow disabled veterans and serving Indianapolis residents getting SNAP benefits in neighborhoods that need it most.\nBut that dream stalled when he lost his wife, Barbara, in 2018.\nThe nonprofit encouraging Indy's youth to face their fears through adventures\nLocated between the large industrial and commercial complexes spread across Pike 100 is the nonprofit Camptown.\nInside, there are over 2,000 square feet of open-play area, 1,200 square feet of indoor bouldering space and four full-time staff members, including executive director Brent Freeman.\nFor 30 years, Camptown has been “leading youth to a better path” – their slogan – which can be interpreted figuratively as well as literally.\nTippy the Chihuahua disappeared 3 months ago. His owner won't give up.\nIt was an hour past midnight on a cold evening in late October. Whistling, and yelling gently, Eric Worthington drove through his neighborhood on South Arlington Avenue.\nHe was looking for his pet Chihuahua, Tippy, like he does most nights since he’s gone missing in July.\nWorthington recalls Tippy with tears in his eyes. Tippy’s absence reminds him of the loss of his 17-year-old daughter, who died in a car accident in 2009, something he still deals with “every day.”\nThe small, unmarked cemetery causing chills and confusion to residents nearby\nA small, unmarked cemetery rests under a 160-year-old oak tree on the south side of West Mills Road, where molding tombstones bear the names of lost loved ones.\nTo many residents living across the street, its existence remains a mystery.\nJared Hewitt, who occasionally gets the “chills” when he drives by, thinks it might be a historical landmark.\nThis west side flower garden brings 'too much' joy to its owner\nFor Edubiges Esquivel, the changing autumn leaves are a sad reminder.\nThe flower garden in her yard will soon be gone. No more roses. No more marigolds.\nFalling sunflower petals send the monarch butterflies that stop by south to Mexico, where she first learned to garden from her father, a farmer, many years ago.\nHe put $15,000 of his savings into a new business, then the pandemic hit\nTommy Dotson walked into the building on the corner of West Berwyn Street and Holt Road in 2009, looking for a job to cut hair.\nHe walked out with rejection and a “dream.\"\nNow, a sign reading T.E.D’Z Barbershop hangs over the entry of that building. It belongs to Dotson.",
  "word_count": 8928,
  "scraped_at": "2026-02-14T13:00:09.971573"
}