{
  "article_id": "444b2d6e070d",
  "url": "https://www.the42.ie/athlone-town-fai-cup-6227600-Nov2023/",
  "title": "How Athlone Town secured FAI Cup glory - and shook up the domestic game for 2024",
  "date": "20231120T180000Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "LAURIE RYAN HAD to Google Ciarán Kilduff when he was appointed Athlone Town women’s manager in June.\n“I wouldn’t have been the biggest League of Ireland fan before I started playing,” the Clare dual star laughed during the week. “Now that you’re in it, you’re immersed in it. But when you’re outside and you don’t follow soccer, you wouldn’t have a clue.”\nHailing from a strong Gaelic football background, the mid-season turnover of management came as a shock to the Athlone captain.\nKilduff took the reins after the surprise departure of Tommy Hewitt, the Athlone postman who had delivered prompt success following their addition to the Women’s National League in 2020.\nTheir rise has been a fairytale story, of sorts. The rural underdog, from rags to riches.\nBelief, hunger, passion. All that good stuff.\nThey finished seventh overall in the league in ’20 and ’21, but recorded a superb second-place finish in 2022 — reducing the points deficit to champions Shelbourne from 42 to just two across 12 months.\nThe Town contested their first-ever Women’s FAI Cup final in ’22, falling to a 2-0 defeat to Shels.\nThey atoned for that defeat yesterday, winning 4-3 on penalties after a thrilling 2-2 draw, with Ryan lifting the team’s first FAI Cup — and second major trophy after their President’s Cup win in February.\n“It’s been brilliant,” the captain told The 42 of Kilduff’s tenure amidst the celebrations at Tallaght Stadium.\n“When he came in, it was not an easy place to come. We all had great faith in Tommy so that was a hard changeover and he knew that. He didn’t try to step on anyone’s toes, he was so respectful to everyone. He really made an effort to get to know us all, that probably is the smallest thing in the world but it made the biggest difference.\n“Even with me, he came in when I was in an All-Ireland final with Clare, he had to trust in me that I wasn’t lying when I said that I always go to training and I don’t usually miss it!\nKilduff, who is also manager of the Maynooth University women’s football team, spoke about targetting the FAI Cup from his arrival. Athlone were seventh in the league at the time after a disappointing start, so they focused their minds on cup success.\nThey faced an uphill battle, but ground out penalty shootout victories over All-Island Cup champions Galway United and eventual league winners Peamount United, before booking their final ticket with a convincing win at Sligo Rovers.\nThey turned their fortunes around in the league, too, climbing to fifth after six wins, one draw — 4-4 with Shamrock Rovers last week from 4-1 down — and one defeat.\n“Obviously we fell off in the league and we just felt it wasn’t reflective of us as a group,” Ryan recalls. “We had to sit down and reassess when Ciarán came in and think what could we do.\n“Our goal was to beat everyone we played. The only team that had beaten us was Shelbourne so we felt like we would get another crack at them in the cup. Once we went on a bit of a run, the belief started to creep in and we realised maybe the first half of the season wasn’t as much of a write off as we thought. We were very close in a lot of those matches, it’s just the way it goes.\n“It was great to get Ciarán in. He said it himself when he came here, that he just wanted to beat everyone. He’s done that now. Everyone he’s played, he’s beaten, so I think that’s really special for him as well.”\nUS-born duo Madie Gibson and Jeni Rossman echoed Ryan’s words about “breath of fresh air” Kilduff bringing the group together and helping them back on track. “Ciarán came in and believed in all of us, and really raised the level,” the latter noted.\nThe Kildare native’s recruitment was key. He acquired Ken Kiernan as his assistant coach from Shels, with goalkeeper Katie Keane and American duo Rossman and Lauren Karabin among the mid-season arrivals as the team rebuilt without big 2022 names like Emily Corbet (now Wexford Youths), Jessica Hennessy and Scarlett Herron (both Shamrock Rovers).\nNot only did the club back Kilduff accordingly, the lengthy break due to the World Cup allowed him to find his feet, implement his structures and systems, and run a mini pre-season.\nHaving had opportunities to work in the men’s game, he followed his grá in the women’s. He spent hours researching the players before taking the job, arrived with no loyalties and built his XI and bench however best he saw fit.\nThe 35-year-old knows all about the importance of super subs, with Gillian Keenan just that for the Midlanders yesterday. She started the 2022 final, as did the provider for her 116th-minute equaliser, Muireann Devaney, but their impact was a masterstroke from Kilduff.\nRyan even told Keenan she thought she’d score in the dressing room beforehand.\nThe rest, as they say is history. Gibson may have missed the first penalty, but Golden Boot winner Dana Scheriff, Player of the Match Chloe Singleton, Kayleigh Shine and Rossman were all spot on, as goalkeeper Amanda McQuillan and Alex Kavanagh both missed for Shelbourne.\n“It can only go up from here,” Keenan beamed afterwards. “It puts Athlone on the map, it lets everyone know we’re a threat in this league and that’s all that we wanted to do.”\nThat was the general message from the players.\nThey have truly shaken up the domestic game for 2024; breaking away from the recent top three in Peamount, Shels and Wexford Youths, with Shamrock Rovers and Galway also in the mix. Hewitt has since taken charge of Sligo Rovers, so that should be interesting too.\n“We’ll celebrate this one for a while and we’ll talk about next year after that,” Ryan said. “The club have ambitions to go further, and this is just a stepping stone for it.”\n“We enjoyed being the underdogs,” the electric Singleton said.\n“I think people get sick of seeing the same club lift the same trophies every year. We wanted an upset and that’s what we got this year. We’re just delighted, and I’m sure other people are delighted to see it. What an upset and what a feeling.\n“League is the next step. The league didn’t go our way this year but I think we really turned it around in the second half of the season but the next step forward is competing for that league trophy. We saw Peamount lifting it and what a feeling that must be for them, especially with all the backlash and what went on this season. That’s what we’re striving for next year.”\n“In terms of league standard, I hope it just lifts everything,” the Athlone native, who returned to her home club after a five-year stint at Galway, added.\n“I hope the FAI realise this and put more funding into our league. We’ve got so much talent in this league and we’re bringing talent in as well. Grassroots, you’ve seen young players coming on, the talent is growing. The FAI and sponsors need to realise that and pump money into our league.”\nThe last words go to Rossman and Gibson, both bursting with belief and confidence amidst champagne showers on the Tallaght pitch.\n“There’s no doubt we can win the league next year,” Rossman concluded. “We have a great team, we’ve so many young players coming up. I think people kind of took us lightly in the second half (of the season) but we mean business.”\n“We have the substance to win it,” Gibson assured. “It goes to show we can play with the top teams in the league and where we are on the table doesn’t define us as a team.\n“We’re just as good as Shels, Peamount and Shamrock Rovers.”",
  "word_count": 1324,
  "scraped_at": "2026-02-14T12:40:38.158219"
}