{
  "article_id": "444cd807b706",
  "url": "https://inews.co.uk/inews-lifestyle/gladiators-fire-competing-olympics-strictly-muscly-back-4220222",
  "title": "Gladiator Fire on competing at three Olympics , Strictly and her muscly back",
  "date": "20260207T110000Z",
  "domain": "inews.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Having become the first woman to compete for Britain at both the Summer and Winter Olympics – sprinting at Beijing in 2008 and as part of the bobsleigh team at Pyeongchang 2018 and Beijing 2022 – Montell Douglas will be involved in her fourth Games this month in yet another role, this time with a mic as the BBC’s roving reporter in Cortina.\n“It’s surreal, but an absolute dream,” she says. “I love winter sport, and having had the experience of being at the Games, I really have an insight into what [the athletes] are going through.”\nThe path from Britain’s sprinting ranks to its bobsleigh team was not easy when she transitioned into winter sports 10 years ago – even though she knew male athletes who had done the same.\n“There were people like Toby Olubi, Joel Fearon, and I was close with like Tremayne Gilling. They’re athletes, black athletes, that I knew from sprinting,” she says. But when she started competing, a lack of racial diversity became clear.\n“I just went into the sport and thought: ‘Cool, let’s go.’ And suddenly I was just like: ‘This sport does not have a lot of different people in there.’\n“There are some athletes of different cultures in other nations [in winter sport], but it is very much a minority. The comments sometimes were quite… now we would say micro-aggressive. They were just a bit ignorant. Most of the time it was not deliberate.”\nCompeting in bobsleigh for Britain does not come with much funding attached – which meant Douglas and her teammates had to drive themselves huge distances across Europe to World Cup events with their sled in the back.\n“We drove a Luton van around Europe, and when we were crossing Eastern European borders, there weren’t many people that look like me, so maybe to them, it looked suspicious. I don’t know, but we got stopped a lot when I was driving and we didn’t get stopped when Mica, my teammate, was driving. Mica is a Geordie, blonde-haired, blue-eyed.”\nDouglas generously shrugs it off as “different cultures that aren’t used to seeing people like me”, but it must have been an unpleasant undercurrent to what is already a brutal sport.\nAnd the Alpine landscape is not, she freely admits, her preferred climate. “I’m south London-born, like my mum and dad. There are no mountains there.\n“And we’re not from cold places, in terms of ethnicity. Jamaica is very hot. In terms of bloodline, it is from Caribbean cultures. It doesn’t just disappear because I come from south London. I don’t like the cold. I feel it.”\nThere was no danger of such concerns when Douglas made her Olympic debut in 2008, in the heat and humidity of a Chinese summer.\nHer memories of running in Beijing, though, are bittersweet, after she failed to get the baton into Emily Freeman’s hand during the 4x100m relay final.\nHad she done so, Great Britain would almost certainly have got a medal. The overwhelming favourites Jamaica – with all three 100m medallists in their quartet – also failed to finish and winners Russia were disqualifed for doping, so the Brits may well have ended up with gold. Even 18 years later, it still haunts her.\n“I was in the shower a couple of days ago thinking about it,” she says. “It was very difficult for many years after, knowing the titles, the financial [benefits], the brands and the deals that we would have had.\n“There are so many knock-on effects. It even had an impact on us going into 2012 in terms of our funding.\n“But it is a ‘shoulda, coulda, woulda’ kind of situation. I have made peace with those things. And the others made peace with it, because we were able to use it and turn things around positively in our lives afterwards.”\nDouglas’s resilience, she says, comes from her father, a football-mad PE teacher who instilled a “never give up” attitude in her – although he still wishes she had plumped for football at 16 rather than athletics or bobsleigh.\n“I came back from the Olympic Games at 36, I just made history, and my Dad was still convinced that I could play for the women’s England football team,” she says.\n“He did not care one bit about bobsleigh! He was like: ‘I think you could still do it.’ I’m like: ‘Dad, I love you but that is wild. I don’t have any ligaments left in my ankle!’”\nDouglas was indeed a talented footballer, helped by coaching from her father, many of whose friends worked with academy teams at Chelsea or her beloved Arsenal. If she had come along 10 years later, she might well have been a professional footballer.\n“There’s been women’s football and club teams for years, including when I was around, but the pathway to that was very different than it is now.”\nIf she wasn’t playing football when growing up, Douglas would be out at hockey, swimming, ice skating, skateboarding or quadbiking. Anything that wasn’t getting bored in the house. “Because being inside was the worst thing you could do in the 90s.”\nHer sporting endeavours came with the full support of her parents: her mother, who had played netball in her younger years, even stepped in to coach her primary school after they lost their first match 17-0. Sport was almost her entire identity – but she got away with it because her parents never had to worry about the academics of their top-set, self-confessed bookworm daughter.\n“Mum was always pushing me to have a really high work ethic,” Douglas says, and it worked. “I just love to learn. I’m a bit of a nerd. So because I loved to learn, they just were like: ‘Well, go and do it, you can do what you want afterwards.’”\nEven at 40, Douglas says she is still obsessed with knowledge. University “wasn’t a thing” in her family, but she now has three degrees to her name: a BSc in sports science, a graduate diploma in psychology and a masters in sports directorship.\nShe has an impressive showbiz resumé too. After being cast in the Gladiators reboot as Fire, she was then announced in the 22nd series of Strictly Come Dancing, alongside Pete Wicks, Tasha Ghouri and eventual winner Chris McCausland.\n“I’m not a dancer at all,” she insists, even after making it all the way to Week 11 of the competition with her partner, Johannes Radebe.\nBut her real victory was making peace with her own body. “I’ve got quite a muscly back. I was really conscious of it, because Strictly is all about aesthetics and how it looks and being delicate.\n“It’s very difficult, when you have muscle, to show up the delicate. They are almost polar opposite.\n“It was a journey, to embrace muscles, to embrace physical shapes, my legs, my size 10 feet, to embrace all those things in a very public space, week in, week out.\n“It was definitely character-building. And I had the amazing support of Johannes to help me go through that, and the team that really did nurture me through. I just wouldn’t have been able to get through without him.”\nActually, her 6ft 2in height in heels and “6ft 4in arm length” enabled her partner to choreograph in a totally different way, taking advantage of her athleticism and reach.\nYour next read\nThey did their Couple’s Choice dance to a track by Afro-house artist Master KG, dressed in outfits that celebrated their respective heritage: they received three 10s, missing out on a perfect score of 40 by just one point.\n“We were both having the best time ever,” she says. “And we got to dance as ourselves together, in our strong physique, and powerful as we are, to make it look the way that we want it to look. That was our Glitterball.”\nLive coverage of the Winter Olympics continues on BBC Two from 9am today",
  "word_count": 1327,
  "scraped_at": "2026-02-14T12:38:13.967144"
}