{
  "article_id": "447fbe0c8163",
  "url": "https://www.the42.ie/fai-coaches-6818259-Sep2025/",
  "title": "Leaving FAI proving the best career move for our talented coaches",
  "date": "20250917T080000Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "EVEN FOR AN organisation as adept at finding crises as the FAI, they have lately been prolific.\nAmid this catalogue of distraction and dysfunction, it’s easy to wonder what it is, exactly, that so propels the FAI’s bullets into their own two feet. Whatever the explanation, it is not down to the quality of the people who have worked there.\nLook at the landing spot of talent lately for your evidence.\nKeith Andrews stepping from Ireland assistant to Premier League head coach is the most obvious, and yet none of the great football minds among the FAI’s decision-makers appeared to suggest he should replace Stephen Kenny. They instead committed us all to an epic sweep of the globe for Kenny’s successor. (Andrews, in fairness, may not have been minded to take the job, given his loyalty to Kenny.)\nAndrews is one of many highly-regarded coaches not to find a success commensurate with their talent while working with the Irish senior team. The more time passes, the more responsibility the players bear for these awful years in the wilderness.\nKenny’s St Patrick’s Athletic team have not been as consistent as they should be but they nonetheless pushed two giants of Turkish football to the pin of their collar in successive European campaigns.\nAndrews was not the only highly-rated coach with whom Kenny worked.\nRuaidhrí Higgins was hired as an analyst and quickly left to become a manager, first of Derry City and now of Coleraine. His successor, Stephen Rice, has been hired as set-piece coach at Brentford, a role to which English football is affording more prominence than ever before.\nDamien Duff left to write an astonishing fairytale with Shelbourne, while Anthony Barry is so highly-regarded in England that the FA are marketing him and Thomas Tuchel as a coaching duo. John Eustace wasn’t around the Irish set-up for long but is now an established manager at Championship level.\nAmong the current senior set-up is Paddy McCarthy, who is highly valued at Crystal Palace. His was recently a textbook instance of someone being let down by those around him, with his much-heralded press conference proclaiming that the Irish team were “on the cusp of something special” made to look ridiculous by full-time in Armenia.\nHe wasn’t in a position to go out on the pitch to back up his words, however. But regardless of what happens with Heimir Hallgrimsson’s position and the rest of this World Cup campaign, McCarthy need not worry about his future career prospects. Read the above list and you’ll realise that nobody suffers too badly for a relative lack of success in Irish football.\nThere are several other, lower-profile talents who have been lost to the FAI, too. Liam McCartan did analysis for the U21 team, and is now the lead analyst for the Danish side Midtjylland. High performance coach Rob Sweeney has recently left to become the head coach of Brentford’s youth sides.\nThe same theme has been evident off the pitch. There has been a constant churn among senior staff, and the Association are currently advertising for a finance director, a legal director, and a head of women and girl’s football.\nDan McCormack has left to become chief financial officer at Leinster Rugby, though swapping the FAI finances for Leinster’s must be the accountancy equivalence of being released from purgatory.\nHannah Dingley, meanwhile, arrived from England with an impressive reputation but achieved nothing, publishing an action plan that she instantly admitted could not be funded. She is now the head of girls’ academy at little-known football operation Manchester City.\nThere are many, many other highly capable and committed staff still at the FAI, across all departments. To pluck just one example, our sources in the business and sports sponsorship world say their commercial director, Sean Kavanagh, is among the best in his field in the country. Irish football just remains a regrettably hard sell to many people.\nAnd while the FAI’s coach education system is respected, it has failed to play its part in creating the kind of domestic industry where these many coaches can actually work.\nThis is a dispiriting fact of the FAI’s polycrisis. In spite of the hiring of many brilliant people, results on and off the pitch simply won’t improve.\nThe FAI in this respect is a relic of old Ireland. Where other sports organisations here are empowering and satisfying their most talented people, the FAI are more like every Irish government up until the 1990s, and a few since. Get out of here.\nThis of course suited the benighted men in charge of the country at the time, whose political survival was founded on the need to export a sufficient quota of young people who might otherwise stay and effect major change. As the historian JJ Lee contentiously wrote of this ruling class, “few people anywhere in the world have been so prepared to scatter their children around the world in order to preserve their own living standards.”\nAlas, the sheer mediocrity of the FAI’s living standard abides, because many of its best people have gone elsewhere for fulfilment while the best of those who have stayed behind toil in the shadows cast by the Association’s many self-generated controversies.\nIf this column has a long-term hope for Irish football, it is that it will be defined by its best people. We are not there yet.",
  "word_count": 895,
  "scraped_at": "2026-02-14T12:36:53.222810"
}