{
  "article_id": "4497e52d06c6",
  "url": "https://speedwaymedia.com/2023/05/23/no-10-smithfield-ford-racing-aric-almirola-charlotte-coca-cola-600-advance/",
  "title": "No . 10 Smithfield Ford Racing : Aric Almirola Charlotte Coca - Cola 600 Advance",
  "date": "20230523T203000Z",
  "domain": "speedwaymedia.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "ARIC ALMIROLA\nCharlotte Coca-Cola 600 Advance\nNo. 10 Smithfield Ford Mustang for Stewart-Haas Racing\nEvent Overview\n● Event: Coca-Cola 600 (Round 14 of 36)\n● Time/Date: 6 p.m. ET on Sunday, May 28\n● Location: Charlotte (N.C.) Motor Speedway\n● Layout: 1.5-mile oval\n● Laps/Miles: 400 laps/600 miles\n● Stage Lengths: Stage 1: 100 laps / Stage 2: 100 laps / Stage 3: 100 laps / Final Stage: 100 laps\n● TV/Radio: FOX / PRN / SiriusXM NASCAR Radio\nNotes of Interest\n● 600 Miles of Remembrance: The Memorial Day weekend’s Coca-Cola 600 at Charlotte (N.C.) Motor Speedway is one of the most patriotic events in sports, honoring fallen soldiers who paid the ultimate sacrifice for their country. This weekend, Stewart-Haas Racing (SHR), Smithfield Foods, and Aric Almirola will honor LCPL Daniel M. McVicker of the United States Marine Corps. In 2003, just months after turning 18, McVicker enlisted in the USMC after his heartfelt call to serve following the 9/11 terrorist attacks on the United States. McVicker was initially stationed at the Marine Air Station in Cherry Point, North Carolina. After his third attempt to volunteer for deployment to Iraq, he was assigned to the Combat Service Support Detachment 21, 2nd Expeditionary Force. On Oct. 6, 2005, McVicker lost his life while driving security detail during “Operation River Gate” near Al-Qaim, Iraq, when his Humvee struck an improvised explosive device (IED). McVicker had a passion for life and found enjoyment in every activity he chose to participate in. He was a Boy Scout, and played flag football, soccer, baseball, basketball, high school football, and wrestled. Unfortunately, after suffering a foot injury late in his freshman year of high school, he was no longer involved in sports. His love then turned to music. He participated in high school musicals and became a member of a select group named “Young and Alive!” He was also voted by his peers to become one of the school’s mascots. McVicker’s ultimate goal was to become a chef. At home and on base, he entertained everyone with the wildest concoctions of delicious meals – most of them involving ranch dressing and chili powder. His family and friends remember his smile and contagious laugh complemented by an infectious personality. No matter what the situation, he always raised the spirits of those around him and brought a smile to people’s faces. His mother Carrie and sister Mollie will be in attendance at Charlotte this weekend to see Almirola pilot the No. 10 Smithfield Ford Mustang with “Danny’s” name across the windshield.\n● On Tuesday, May 16, Charlotte Motor Speedway hosted Almirola for its final Mission 600 visit of the season, a day with Marines from the 2D LAR (Light Armor Reconnaissance) Battalion at North Carolina’s Camp Lejeune. Mission 600 is a campaign that pairs NASCAR drivers with military bases designed to educate the NASCAR community about the day-to-day lives of the men and women who serve in the U.S. Armed Forces and to build meaningful connections between the worlds of motorsports and the military. Almirola, along with Charlotte Motor Speedway Executive Vice President and General Manager Greg Walter, flew in an MV-22 Osprey, participated in a tire-changing demonstration, learned about a variety of weapons systems, and fired an M242 Bushmaster from an LAV (Light Armored Vehicle). Almirola also served lunch to dozens of Marines, courtesy of Smithfield. Click here for imagery of the event.\n● Almirola will be just as busy on the track as he will be off of it this week. Wednesday at 6 p.m. ET, Almirola will appear on FS1’s “NASCAR Race Hub.” Friday, Almirola will be the guest analyst in the booth for the ARCA Menards Series race at Charlotte, live on FS1 at 6 p.m. ET. Saturday, he’ll join Ricky Stenhouse Jr., and Brad Keselowski in the FOX studio for the all-driver NASCAR Xfinity Series race broadcast.\n● History at Charlotte Motor Speedway: In 17 starts, Almirola has one top-10 finish and has led four laps. Almirola also has eight NASCAR Xfinity Series starts with one top-five and three top-10 finishes.\n● Driver Points: Almirola arrives at Charlotte 26th in the driver standings, 208 points out of first.\n● Almirola’s career: In 437 career NASCAR Cup Series starts, Almirola has three wins, 28 top-five finishes, 92 top-10s, four poles, and has led 1,018 laps.\n● Smithfield has been a sponsor of Almirola’s for the entirety of his fulltime NASCAR Cup Series career – making it one of the longest-lasting partnerships in NASCAR. Smithfield is an American food company with agricultural roots and a global reach. Its 63,000 team members are dedicated to producing “Good food. Responsibly.®” Smithfield is one of the world’s leading vertically integrated protein companies. The company has pioneered sustainability standards for more than two decades, including its industry-leading commitments to become carbon negative in U.S. company-owned operations and reduce GHG emissions 30 percent across its entire U.S. value chain by 2030. Smithfield believes in the power of protein to end food insecurity and has donated hundreds of millions of food servings to local communities.\n● Beyond the 10 YouTube Series:In 2023, Almirola is continuing to share his life beyond the No. 10 Ford with season five of his award-winning YouTube series. Fans and media can subscribe on YouTube to see Almirola’s personality on and off the track. Episodes have already featured life as a dad, a husband and an athlete, and the show gives fans a unique perspective on what goes on in the life of a professional NASCAR driver. Fans can also follow Almirola’s social media channels: @Aric_Almirola on Twitter and Instagram, and @AricAlmirola on Facebook.\nAric Almirola, Driver of the No. 10 Smithfield Ford Mustang for Stewart-Haas Racing:\nYou visited Camp Lejeune last week for a day in the life with Marines of the 2nd Light Armored Recon Battalion. How cool was that?\n“It makes me feel blessed to get the opportunity to come and engage with all of the people who are fighting for our freedom. From the moment we got in an Osprey and flew to the base, to get to do a simulated pit stop on an LAV (Light Armored Vehicle), and just seeing the team aspect of things really gives me a lot of enjoyment and makes you feel like you are a part of something bigger than yourself. It’s so easy to get caught up in our daily lives and in the business of work and life and we sometimes forget that these men and women are battling each and every day so that we can enjoy these freedoms with our family and friends. My dad was in the Air Force and I was born at Eglin Air Force base, so I know firsthand what these families have sacrificed. Without these men and women, we don’t get to race. We get to live without fear because of the brave members of our military who put their lives on the line for us. Words can’t describe how thankful I am for our troops and I hope that our visit to Camp Lejeune made them feel appreciated and let them know that we value their efforts. That’s what the Memorial Day weekend race is all about, remembering and honoring those who fought to keep this country free.”\nWhy is the Coke 600 such a crown jewel race?\n“It’s a hundred miles longer than any other race we run, which provides a challenge in and of itself. On top of that, there is an extra stage, which gives us the opportunity to earn more points. The cars have less grip when the sun is out and they tend to slip and slide a lot more. As the sun goes down, the track gets more grip and we start going faster. That’s one of the very unique things about this race. What you have from a drivability and balance standpoint from the racecar at the beginning of the race is not what you have at the end. You’re trying to figure out what it takes to get your car to win at the end and you have to be good at all facets because there are a lot of points to be made.”\nAlthough the finishes with the intermediate package have not been indicative of your speed, do you feel you are headed in the right direction to have a successful race at Charlotte?\n“I do. I think we found some speed with this package at Kansas and Darlington, where we were a top-10 car all day. We struggled at Dover and really missed the balance, but I think we bounced back really well at Kansas and Darlington. We’ve had years where we headed to Charlotte with a lower level of confidence because of where we thought our package was compared to the rest of the field, but this year is different. We have to qualify well, for starters. Stage points are huge at Charlotte and we need to accumulate as many as possible.”\nNo. 10 Smithfield Ford Team Roster\nPrimary Team Members\nDriver: Aric Almirola\nHometown: Tampa, Florida\nCrew Chief: Drew Blickensderfer\nHometown: Decatur, Illinois\nCar Chief: Jerry Cook\nHometown: Toledo, Ohio\nEngineer: Davin Restivo\nHometown: Asheboro, North Carolina\nEngineer: James Kimbrough\nHometown: Pensacola, Florida\nSpotter: Joel Edmonds\nHometown: Dobson, North Carolina\nOver-The-Wall Members\nFront Tire Changer: Ryan Mulder\nHometown: Sioux Center, Iowa\nRear Tire Changer: Trevor White\nHometown: Arlington, Texas\nTire Carrier: Tyler Bullard\nHometown: King, North Carolina\nJack Man: Sean Cotton\nHometown: Mooresville, North Carolina\nFuel Man: James “Ace” Keener\nHometown: Fortuna, California\nRoad Crew Members\nMechanic: Chris Trickett\nHometown: Grafton, West Virginia\nMechanic: Jacob Cooksey\nHometown: Westbrookville, New York\nEngine Tuner: Matt Moeller\nHometown: Monroe, New York\nTire Specialist: Russel Simpson\nHometown: Medford, New York\nTransporter Co-Driver: Steven Casper\nHometown: Salisbury, North Carolina\nTransporter Co-Driver: Matt Murphy\nHometown: Augusta, Georgia",
  "word_count": 1638,
  "scraped_at": "2026-02-14T13:24:49.579609"
}