{
  "article_id": "449a44a9ab2a",
  "url": "https://mwnation.com/temwa-out-of-angola-match/",
  "title": "Temwa out of Angola match - Nation Online",
  "date": "20251021T050000Z",
  "domain": "mwnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Temwa out of Angola match\nThe Scorchers have been dealt a blow ahead of Thursday’s 2026 Women’s Africa Cup of Nations (Wafcon) final qualification round first leg against Angola after US-based forward Temwa Chawinga ruled herself out due to a groin injury.\nAccording to The New York Times, Temwa wheeled off the pitch with a right leg injury during a Women’s National Soccer League (NWSL) match between her club Kansas City (KC) Current and Houston Dash, which the latter won 1-0.\nThe publication said the 27-year-old striker lay down on the pitch away from the action in the 25th minute and appeared to grip her upper leg, an expression of distress written on her face.\nShe was eventually taken to the locker room in a wheelchair.\nIn an interview yesterday, the 2024 NWSL Most Valuable Player said: “I will have an appointment with the team doctors later today to determine the extent of the injury.\n“But I can’t make it for Thursday’s match because I can hardly run.”\nKC Current coach Vlatko Andonovski was also quoted by The New Yoek Times as having said that they were yet to establish the extent of the injury.\n“We don’t have an exact update on her. She has gone for MRI [magnetic reasoning imaging] now as we speak. Once we get the results, we’ll know a little bit more,” he said.\nIn an interview yesterday, her manager Theana Msolomba said she was yet to get “the official position of Temwa’s condition”.\nShe also said Temwa’s France-based sister Tabitha, who is the Scorchers captain, was expected to arrive in Angola’s capital Luanda, yesterday.\nFootball Association of Malawi competitions and communications director Gomezgani Zakazaka confirmed Temwa’s unavailability for Thursday’s match.\n“She won’t make it,” he said.\nIn a separate interview, Scorchers coach Lovemore Fazili described the development as a “huge setback”.\n“Obviously, it is worrying because she is one of our key players. I have been trying to get hold of her, but I couldn’t get through.\n“Nevertheless, we have plan B in place.”\nThe Scocrchers are scheduled to depart for Angola today.\nMeanwhile, Temwa has become KC Current’s first-ever bobblehead.\nA bobblehead is a figurine often made as a caricature of a famous person, including athletes and artists.\nThe club announced through its Facebook Page on Friday that the first 5 000 fans on Fan Appreciation Day on November 2 will receive an exclusive Temwa bobblehead presented by H&R Block.\nA post by the club, read: “Small in stature, but big in heart.”\nThe most expensive one ever sold was a 1961 New York Yankees Bobblehead which was bought at $5 750 (about K105 million).",
  "word_count": 441,
  "scraped_at": "2026-02-14T13:33:25.661703"
}