{
  "article_id": "44b4377aa35e",
  "url": "https://www.ncaa.com/news/gymnastics-women/article/2023-01-30/closer-look-fisk-gymnastics-and-what-makes-it-different",
  "title": "A closer look at Fisk gymnastics and what makes it different",
  "date": "20230130T210000Z",
  "domain": "ncaa.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Forty-one years. That's how long it took after the first NCAA gymnastics championship in 1982 for an HBCU (Historically Black College or University) to have a gymnastics program of its own. Fisk University is that program and is almost a month into its historic, groundbreaking season as the first-ever HBCU gymnastics program.\nAs Fisk continues its inaugural year on the mat, the Bulldogs are standing out.\nYou may not have heard of Fisk, a small, private HBCU located in Nashville with an enrollment of just over 1,000 students, but Fisk is one of the top-ranked HBCUs nationwide. In other sports beyond gymnastics, Fisk competes at the NAIA level against schools similar in size.\nYet, while Fisk's small number of students may have it flying under the radar, its gymnastics program is bringing huge attention to its school. In the first year of Fisk representing as the face of HBCU gymnastics, the Bulldogs have already earned recognition from national audiences. If you hadn't heard of Fisk before 2023, the gymnastics program is quickly gaining notoriety for itself and the school.\nCatch the Fisk University Gymnastics team on the Jennifer Hudson Show today at 2 PM on CW. The gymnasts sit down with the two-time grammy award winner and discuss being part of the first HBCU gymnastics team and how a video of the first practice amassed over 1 million views! pic.twitter.com/BWQIf6Nrv0\n— Fisk University (@Fisk1866) September 19, 2022\nBut why now? Why was 2023 the right time for Fisk to transform collegiate gymnastics? I posed that question to prized recruit-turned-star gymnast Morgan Price, a freshman at Fisk. She's more focused on the impact she and her teammates can make on college gymnastics.\n\"To be honest, I don't have the answer,\" Price said. \"I'm just blessed that God paved the way for me to graduate (high school) early and to start off this program with my teammates. It's amazing that now HBCU gymnastics is starting and it's starting to grow very quickly.\"\nRELATED: Fisk, the first gymnastics team from an HBCU, wants to 'compete with the big dogs'\nThe freshman phenom\nPrice, a five-star recruit, was committed to SEC power Arkansas before flipping to Fisk last year.\n\"When I committed, some people were confused as to why I did join this program. But deep down in my heart, I knew the reasons why and how important it was to go to Fisk,\" she said.\nFast forward to the 2023 season, and Price has quickly lived up to her elite billing as a freshman. She earned a 9.9 in her first collegiate meet and has consistently been one of the highest-scoring Bulldogs this year.\nHistory = made ✅\n— Fisk University (@Fisk1866) January 7, 2023\nFisk University is the 1st HBCU program to compete at the @ncaa level!#fiskgymnastics #fiskuniversity #super16 #hbcu #explore #morganprice pic.twitter.com/z9zJVuIrTC\nPrice's success on the mat has made her one of the faces of Fisk athletics and HBCU gymnastics. With that comes pressure.\n\"People have high standards of me and my team,\" Price said. \"That pressure comes from trying to make sure that we live up to their standards and that we just do as good as the world wants us to be.\"\nWhile Price may rightfully draw headlines as a star freshman, she's not alone on the mat. Everyone at Fisk is new to the program, even the half-a-dozen transfers brought on in its first year.\nBeyond the transfers, you'll find a freshman-laden team, differing from the upperclassmen-heavy rosters found across much of collegiate gymnastics. A youthful roster has thrust Price and other freshmen into leadership roles early in their careers.\n\"We kind of just all have to step up and play that upperclassman role so that we can hold the whole team accountable,\" Price said. \"It's good energy... it's kind of like we're all just learning how to do college gymnastics all together.\"\nGYMNASTICS 101: A guide for football, basketball and other sports fan\nThe benefits of a familiar face\nThe gymnasts themselves aren't the only ones at Fisk that are young. Head coach Corrinne Tarver is a rookie, too.\nTarver previously was the assistant gymnastics coach at Penn. Before that, she was at Georgia and the first Black gymnast to win an NCAA all-around title in 1989, winning her second of two NCAA team titles at Georgia (1987 and 1989). She also was named a U.S. National Team member during the 1985-1986 season.\nAs a decorated Black gymnast, Tarver is used to firsts. Now, she's undergoing another as a first-time head coach, developing as the head honcho while Fisk's gymnastics program develops simultaneously.\n\"I've never had an African American coach, so just to know that she was also a big-time college gymnast as well really helps and motivates me,\" Price said. \"I know she went through the same struggles that I as a college gymnast now go through. She really cares about her athletes.\"\nIn addition to having a Black coach, Fisk's inaugural gymnastics team is composed entirely of women of color. That's rare. The 15 women of color on the Bulldogs rival the total number found on the top-five teams in the women's gymnastics rankings as of Jan. 23 combined.\nFor Fisk gymnasts, there's value in having a team full of people who look like them. It's part of what has made the historical first season so special.\n\"Growing up in the sport of gymnastics, I've never been on a team where there's even like more than five girls of color on the team,\" Price said. \"I have like 14 other girls who look like me who can help me with my hair, help me with my style and just different small little things like that. It really helps, even just in life outside of gymnastics.\"\nAs an HBCU and as a gymnastics team full of women of color, especially Black women, Fisk and its gymnasts know that they are competing for and representing more than just themselves.\nThe Bulldogs are carrying the torch for future Black gymnasts proudly in their inaugural season.\n\"What we're doing now shows the younger African American girls growing up, especially in the sport of gymnastics, that they can be like me and my teammates one day,\" Price said. \"The fact that we're paving a way for the younger African American girls is really honoring for me and my teammates. If they really dream it, put their mind to it and keep working hard, they will be making history like us one day.\nThe impact of Fisk has led to overwhelming support across the country, only a month in to the inaugural year. A TikTok of the first Fisk gymnastics practice from Zyia Coleman got over a million views with thousands of supportive comments. Fisk is quickly becoming a fan-favorite team, and now other HBCUs like Talladega College have started start a gymnastics program of its own.\n\"We are so honored that we have so many fans. It's just super exciting that so many people are encouraging us and supporting us,\" Price said.\nFisk University Gymnastics Team honored tonight prior to Tennessee Collegiate Classic pic.twitter.com/19vLzKwtxl\n— HBCU Premier Sports & More (@HBCUSports1) January 21, 2023\nOn the mat\nFor all of what's made Fisk gymnastics special in its inaugural season, none of it matters if the Bulldogs don't go out and compete on the mat. And Fisk isn't ducking any competition.\nThe Bulldogs opened the season in the Super 16 meet that featured defending national champion Oklahoma and other top-ranked teams. While Fisk didn't compete in the same session as the defending champions, the Bulldogs finished with 188 points in their session in the program's first-ever meet. Since then, Fisk has competed against other top-20 teams Michigan, Denver, Ohio State and Georgia.\n\"I feel like going against the big schools pushes us to do our best,\" Price said. \"Since we are the underdogs, it's kinda like we have to show up and show out. The better we do, the more people will notice us and start to say that, \"they're gonna be up in that top-10, top-15 programs, hopefully by either the end of this season or next season.\"\nThe Super 16 invitational was a huge success!\n— Fisk University Gymnastics (@FiskUGymnastics) January 9, 2023\nHere are some highlights in case you missed it.🐶 pic.twitter.com/d92IdMdqJw\nThe signs of improvement are showing week-to-week with Fisk, who've scored a season-high 190 points in each of its last two meets entering the final meet of January.\n\"I've learned to stay confident in what you train because if you train well, then most likely, nine times outta 10, you're gonna compete well. As a team, we learned to be humble, but also be confident as well,\" Price said.\nThrough it all, the goal remains the same for Price.\n\"I wanna get a 10 on every event this year, hopefully, or at least one event. I just wanna get a 10 and then also make it to nationals and win at least one event,\" Price said. \"As a team, I would like to stay healthy, stay positive and break that 194 score.\"\nA little recap from our Friday Night Heights meet at The Tennessee Collegiate Classic.\n— Fisk University Gymnastics (@FiskUGymnastics) January 23, 2023\nCatch us UP in Muncie, IN this Sunday at Ball State University! Meet starts at 1pm. See you there ✨ pic.twitter.com/FtqMbPQZHC",
  "word_count": 1559,
  "scraped_at": "2026-02-14T14:22:43.060211"
}