{
  "article_id": "44ecf896eac5",
  "url": "https://www.reviewonline.com/news/local-news/2024/05/mayor-thanks-responders-who-helped-city-explosion-victims/",
  "title": "Mayor thanks responders who helped city , explosion victims | News , Sports , Jobs",
  "date": "20240530T093000Z",
  "domain": "reviewonline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Mayor thanks responders who helped city, explosion victims\nYOUNGSTOWN — Mayor Jamael Tito Brown sent out his condolences to the family of the 27-year-old Chase Bank employee who died in Tuesday’s Realty Tower explosion and thanked members of the community and “all of the men and women of the safety services — police, fire, EMTs from all over.”\nThe mayor said if anyone “had a visual of the scene yesterday, you didn’t just see Youngstown. You saw Boardman. You saw county sheriffs here, helping and not going away, but going into the building.”\nHe also thanked the federal government for its help, including the FBI and U.S. Bureau of Alcohol, Tobacco, Firearms and Explosives, and calls were made to the city by Gov. Mike DeWine and the two U.S. senators, and state and federal investigators came to the scene “to make sure we give them the best shot at finding out what happened with this.”\nThe mayor said his heart goes out to the family, friends and coworkers of, Akil Drake, 27, who died in the explosion.\n“It’ s a tough part when you have to tell a mother that her son got up yesterday to work and did not come home,” he said.\nParents always tell their children to “Do your best. Get a job, and he was doing that. And we want to give our sympathy for that,” the mayor said. To Drake’s co-workers, “who are still fighting for their life, trying to recover, we are sending out our prayers to you.”\nAKIL DRAKE\nDrake, who was an employee at the Chase Bank branch on the first floor of the Realty Tower, was one of two missing persons that Youngstown fire Chief Barry Finley discussed Tuesday evening during a press conference on the steps of the Mahoning County Courthouse. Brown said Drake was found in the basement early Wednesday morning.\nThe Youngstown Police Department detective division was called to assist with the investigation of the explosion, and detectives determined that Drake was at work Tuesday. A Youngstown police news release states Drake “was observed inside the building right before the blast.”\nThe release adds that the other person Chief Finley described as missing is now “accounted for.”\nFinley said at Wednesday’s press conference that the woman went to the hospital in Boardman after the explosion but registered under a different name. He said that is the reason she was unaccounted for, but she is accounted for now.\nThe police department press release also extended the police department’s condolences to Drake’s family.\nThe Penn Hills School District, which is near Pittsburgh and is where Drake went to high school, said in a statement, “Akil was a 2015 Penn Hills graduate and a student athlete who excelled on the football field. The Penn Hills School District extends its deepest sympathies to Akil’s family as well as the other individuals impacted by this tragic explosion. Akil will be missed by us all.”\nSURVIVORS\nAs for the survivors of the explosion, one woman remains in critical condition on a ventilator in surgical intensive care at St. Elizabeth Youngstown Hospital, but the six others who were transported to the hospital appear to be doing well enough to be released soon, Finley said during Wednesday’s press conference.\n“I didn’t hear anything too over-and-above. You’ve got some injuries, but the lady in surgical intensive, she’s” in the worst condition, Finley said. He would not speculate whether she will pull through. He said all seven individuals who survived were still in the emergency room of area hospitals as of Wednesday morning.\n“I believe some will be discharged today because it wasn’t that bad. Others probably a few days,” Finley said.\nBrown said while there are still some health issues the survivors will have to overcome, it’s not just physical. “Then we can talk about the mental part as we go along.”\nThe city has reached out to the county mental health and recovery board to see if they can assist Chase Bank with whatever “support and services we can. I can’t imagine what is going through their minds right now, what they are feeling.\n“We’re just going to continue to wrap our arms around that staff of the bank, those residents, (who say) where do I stay within the next week to 10 days and longer for the Realty Tower.”\n“The Mahoning County Mental Health and Recovery Board will offer emergency counseling services to help individuals cope with the emotional aftermath of this incident through Compass Family and Community Services.”\nIt asked those in need to call 330-782-5664OK-EDR for assistance. Services will be available 8 a.m. through 4 p.m. with walk-ins at 535 Marmion Avenue in the city.\nCAUSE OF EXPLOSION\nBrown and Finley wouldn’t comment on the cause of the blast and said the Ohio State Fire Marshal’s Office is the lead investigator.\n“We’re not talking about any type of cause yet,” Brown said. “The State Fire Marshal is going to give us that. We are taking their direction from this.”\nWhen asked if there was any indication of “negligence” in terms of who is responsible for the gas line at the building, Brown said, “There is not going to be anything said from us to push or point a finger at anywhere until we know for sure. Today I am going to tell you the facts until we know for sure.”\nFinley also said, despite remarks that have been made, it still is not certain whether the explosion was caused by a gas leak.\nFinley said the Ohio Occupational Safety and Health Administration is also assisting with the matter.\n“Something of this magnitude, everybody is coming out.” he said, adding this explosion may be the biggest disaster he has overseen as chief.\n“At the end of the day, until we find out what is going on in today’s world, we have to expect the worst, so every agency that should have been here was to ensure that we still are safe as a city and as a country,” he said.\nBUILDING OWNER\nThe owner of the building, YO Properties 47 LLC, issued a statement on the explosion, saying the company “is shocked and deeply saddened by the loss of life and injuries resulting from the explosion that occurred.\n“Their heartfelt sympathy and condolences are extended to the family of the young man who lost his life. YO Properties 47, LLC, in cooperation with the relevant governmental agencies, is investigating how and why this explosion happened.”\nGAS COMPANY\nEnbridge, the new name for the natural gas distribution company Dominion Energy Ohio, issued a statement Wednesday afternoon about the explosion.\n“Our hearts go out to the injured and the families of those who have been impacted, especially to the Drake family who lost a loved one,” the statement says.\n“The National Transportation Safety Board will be taking the lead in this investigation, and Enbridge Gas Ohio likely will be asked to assist as a party to the investigation. Federal regulations prohibit us from commenting on the investigation.”\nThe statement thanked the city of Youngstown and its administration “and all first responders for their quick action and leadership in responding to this event. Our primary concern will continue to be the safety and well-being of everyone involved.”\nDominion Energy Ohio was sold to Enbridge Inc., becoming Enbridge Gas Ohio, in March according to the Dominion Energy Ohio website. Several workers with Enbridge on their uniforms and vehicles were working in the area of the explosion Wednesday afternoon.\nRESPONSE\nFinley said about 40 to 50 law enforcement officers were at the scene of the explosion at the height of the incident and about 35 firefighters from Youngstown and Boardman, which included a ladder truck to assist Youngstown if there was any need to carry out rescues from any high rise.\nJon Racco, president of the Youngstown Professional Firefighters Local 312 issued a statement Wednesday calling the Realty Tower explosion “one of the most chaotic and dangerous scenes imaginable.”\nHe stated that within four minutes of the initial dispatch, arriving firefighters were performing rescues, saving lives and rendering aid to those in need.\n“Local 312 could not be more proud of our members and the bravery they showed in those times of despair,” he stated.\nHe added, “Our hearts and prayers are with all those affected, especially those who lost their loved one. Local 312 would also like to thank those area first responders who rushed to the scene to assist us in this tragedy.”\nROAD CLOSINGS\nChuck Shasho, Youngstown deputy director of public works, said some roads near the Realty Tower remain closed. They are Market Street at Wick Avenue and the entire Central Square area just to the west of the Realty Tower, Federal Street from Phelps Street to Champion Street to Walnut Street.\nHe said Commerce, Walnut and Boardman streets remain open for people to navigate around the road closures. He said that “as things progress” in the evaluation of the Realty Tower, more effective barricades will be installed.\n“But keep in mind that we do not at this point have 100% certainty of the stability of the building itself, as well as the general hazards of an area where there is loose debris that can fall,” Shasho said.\nHe mentioned that Youngstown Cityscape has a planting day planned this weekend, and it is still going forward “in some fashion.” It will not take place in the restricted areas, but “I think the city needs that right now … and get the city beautified.”\nWhen Shasho was asked whether there were workers in underground vaults in the area of East Federal Street near the Realty Tower as part of the road project being carried out there, he said the city has a company working in that area to inspect the roadway project.\n“They confirmed with me that there was no active construction going on at the time in that block and in front of the building,” Shasho said.\nThe county Emergency Management Agency “cleared all county government buildings” to reopen Wednesday for regular hours of operation. “We are committed to maintaining essential services and ensuring the safety of our community,” it adds.\nerunyan@vindy.com",
  "word_count": 1697,
  "scraped_at": "2026-02-14T14:13:20.569263"
}