{
  "article_id": "44f0ddd0f2e5",
  "url": "https://www.express.co.uk/news/world/2061103/holiday-destination-dubbed-new-dubai",
  "title": "The holiday destination dubbed  new Dubai  with direct united kingdom flights | World | News",
  "date": "20250601T104500Z",
  "domain": "express.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The beautiful country dubbed the 'new Dubai' with UK flights and crystal clear waters\nSaudi Arabia could be a new holiday hotspot, and here's everything you need to know about visiting there.\nWith the number of visitors doubling in two years, Saudi Arabia is a newly emerging hub for tourism. It has a unique culture and seamless blend of old and new. However, it is only in the last few years that tourism has really begun taking off under Crown Prince Mohammed bin Salman, who aimed to diversify the economy and steer its wealth away from purely oil revenue.\nIt appears to be working, with 30 million visitors in 2024 (compared to 16.4 million in 2022). Its position in the world's spotlight is growing fast, with Formula 1 holding races in Jeddah since 2021 and major boxing fights taking place in the country, such as high-profile showdowns between Tyson Fury and Oleksandr Usyk.\nVirgin Atlantic recently launched flights from Heathrow, which take 6-7 hours and cost £508.\nBut what is it really like? Are the rules as strict as you have heard?\nIt is perfectly safe for women to visit, although covering up is advisable. It is generally recommended to try and ‘fit in’ with the locals, and although head coverings are no longer compulsory, women are expected to cover their shoulders, arms and legs and not wear tight clothing.\nModesty is also recommended for men, with shorts above the knee deemed unacceptable.\nHowever, it is still advised to wear clothes that keep you cool, as temperatures can reach 50C in the summer.\nIt is possible to visit as an LGBT traveller. despite the country's laws. The national travel authority says that: ‘Everyone is welcome to visit Saudi Arabia, and we ask that they follow and respect our culture and traditions and laws, as you would when visiting any other country in the world’.\nOne thing that the government entirely forbids is the consumption of alcohol. Unlike nearby Muslim countries such as the UAE which has exceptions, Saudi is pretty firm on this policy.\nDespite reports that they would lift this ban with restricted use in the run-up to hosting the 2034 FIFA World Cup, a Saudi official has denied this.\nHowever, on the side of food, Saudi Arabia offers an abundance of delicious cuisine that many can enjoy. Try the country’s smoky baba ghanoush, hummus, falafel and shawarmas.\nIf you want to further immerse yourself in the culture, why not visit a mosque? However, you must cover up and some only permit the entry of Muslims.\nThe locals are all very friendly and willing to teach you about their culture, welcoming you to their country.",
  "word_count": 446,
  "scraped_at": "2026-02-14T12:36:05.224508"
}