{
  "article_id": "450df0a442bb",
  "url": "https://www.winnipegfreepress.com/world/2023/06/16/ap-news-in-brief-at-1204-a-m-edt-194",
  "title": "AP News in Brief at 12 : 04 a . m . EDT – Winnipeg Free Press",
  "date": "20230617T043000Z",
  "domain": "winnipegfreepress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "AP News in Brief at 11:09 p.m. EDT\nAdvertisement\nBlinken arrives in Beijing on high-stakes mission to cool soaring US-China tensions\nRead this article for free:\nor\nAlready have an account? Log in here »\nTo continue reading, please subscribe:\nMonthly Digital Subscription\n$1 per week for 24 weeks*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $4.00 plus GST every four weeks. After 24 weeks, price increases to the regular rate of $19.95 plus GST every four weeks. Offer available to new and qualified returning subscribers only. Cancel any time.\nMonthly Digital Subscription\n$4.99/week*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $19.95 plus GST every four weeks. Cancel any time.\nTo continue reading, please subscribe:\nAdd Free Press access to your Brandon Sun subscription for only an additional\n$1 for the first 4 weeks*\n*Your next subscription payment will increase by $1.00 and you will be charged $16.99 plus GST for four weeks. After four weeks, your payment will increase to $23.99 plus GST every four weeks.\nBlinken arrives in Beijing on high-stakes mission to cool soaring US-China tensions\nRead unlimited articles for free today:\nor\nAlready have an account? Log in here »\nHey there, time traveller!\nThis article was published 16/06/2023 (974 days ago), so information in it may no longer be current.\nBlinken arrives in Beijing on high-stakes mission to cool soaring US-China tensions\nBEIJING (AP) — U.S. Secretary of State Antony Blinken arrived in Beijing early Sunday on a high-stakes diplomatic mission to try to cool exploding U.S.-China tensions that have set many around the world on edge.\nBlinken was to begin two days of talks with senior Chinese officials in the afternoon. He is the highest-level American official to visit China since President Joe Biden took office and the first secretary of state to make the trip in five years.\nThe trip comes after he postponed plans to visit in February after the shootdown of a Chinese surveillance balloon over the U.S.\nYet prospects for any significant breakthrough on the most vexing issues facing the planet’s two largest economies are slim, as already ties have grown increasingly fraught in recent years. Animosity and recriminations have steadily escalated over a series of disagreements that have implications for global security and stability.\nBlinken plans to meet with Chinese Foreign Minister Qin Gang on Sunday, top diplomat Wang Yi, and possibly President Xi Jinping on Monday, according to U.S. officials.\n___\nGovernment shutdown warnings rise as Republicans seek deeper cuts in budget battle\nWASHINGTON (AP) — Speaker Kevin McCarthy’s bid to appease Republican hard-liners and get the House moving again after a recent party rebellion on the floor has some Democrats warning of a difficult road ahead when it comes to passing legislation that will keep the government running.\nRepublicans teed up votes this past week on guns and on censuring one of former President Donald Trump’s most prominent critics, Rep. Adam Schiff, D-Calif. Those votes helped get the House moving again, though the latter effort failed, with Schiff helped by some 20 Republicans.\nThe most consequential move of the week, however, was an announcement from GOP leadership that arrived with little fanfare. Republicans said they plan to pursue appropriations bills, which fund government programs and agencies, with less spending than the top-line numbers they agreed to in a deal with the White House last month. That compromise avoided what would have been an unprecedented federal default.\nMcCarthy argued that the numbers he negotiated with the White House amount to a cap and “you can always do less.” GOP Rep. Kay Granger of Texas, who leads the House Appropriations Committee, followed with a statement that said she would seek to limit nondefense spending at 2022 budget levels, saying the debt agreement “set a top-line spending cap -– a ceiling, not a floor.”\nThe announcements delighted Republicans who had criticized McCarthy, R-Calif., and opposed the debt ceiling legislation because they felt that agreement allowed too much spending. But it drew immediate pushback from Democrats who say an attempt to circumvent the debt ceiling agreement’s top-line numbers effectively guarantees a standoff with the Senate and White House and possibly even a damaging government stoppage when funding expires this fall.\n___\nSupermajorities in state capitols push controversial policies to the edge\nJEFFERSON CITY, Mo. (AP) — Lawmakers in state capitols this year have been flexing their superpowers.\nIn North Carolina, a new supermajority of Republicans enacted abortion restrictions. In Vermont, a new supermajority of Democrats imposed a climate-sensitive home heating law. And in Montana, a GOP supermajority booted a transgender lawmaker from the House floor.\nIn each case, the views of their political opponents ultimately were irrelevant.\nBy at least one measure, political power is at its highest mark in decades. That’s because Republicans or Democrats hold majorities so large in 28 states that they could override gubernatorial vetoes without any help from the minority party.\n“Supermajorities give one party a lot of power to do what they want to do,” said Steven Rogers, a political scientist at Saint Louis University who focuses on elections and state legislatures.\n___\nEviction filings are 50% higher than they were pre-pandemic in some cities as rents rise\nATLANTA (AP) — Entering court using a walker, a doctor’s note clutched in his hand, 70-year-old Dana Williams, who suffers serious heart problems, hypertension and asthma, pleaded to delay eviction from his two-bedroom apartment in Atlanta.\nAlthough sympathetic, the judge said state law required him to evict Williams and his 25-year-old daughter De’mai Williams in April because they owed $8,348 in unpaid rent and fees on their $940-a-month apartment.\nThey have been living in limbo ever since.\nThey moved into a dilapidated Atlanta hotel room with water dripping through the bathroom ceiling, broken furniture and no refrigerator or microwave. But at $275-a-week, it was all they could afford on Williams’ $900 monthly social security check and the $800 his daughter gets biweekly from a state agency as her father’s caretaker.\n“I really don’t want to be here by the time his birthday comes” in August, De’mai Williams said. “For his health, it’s just not right.”\n___\nNikki Haley’s husband begins Africa deployment as she campaigns for 2024 GOP nomination\nCHARLESTON, S.C. (AP) — Nikki Haley’s husband deployed Saturday for a yearlong stint in Africa with the South Carolina Army National Guard, a mission that will encompass most of the remainder of her campaign for the 2024 Republican presidential nomination.\n“He’s always been my rock,” she said after a deployment ceremony for about 200 soldiers at The Citadel, a military college in Charleston. “We have both lived a life of service, and so when he goes off to deploy, my support is completely with him. If I happen to be running for president, his support is completely with me. … We will continue to stay in touch as best we can.”\nMaj. Michael Haley is being deployed as a staff officer with the 218th Maneuver Enhancement Brigade, which the National Guard says is providing support in the Horn of Africa.\nThe United Nations, where Nikki Haley served as Donald Trump’s ambassador for two years, says that region is facing the worst drought in 40 years, with more than 43.3 million people in need of assistance in Somalia, Ethiopia and Kenya, and more than half of those lacking access to sufficient food.\nLast month, a high-level U.N. conference raised less than $1 billion of the more than $5 billion organizers were hoping for to help more than 30 million people in the Horn of Africa cope with the climate crisis and mass displacement after years of conflict.\n___\nPutin meets with African leaders in Russia to discuss Ukraine peace plan, but no visible progress\nKYIV, Ukraine (AP) — Russian President Vladimir Putin on Saturday met with a group of leaders of African countries who traveled to Russia on a self-styled “peace mission” the day after they went to Ukraine, but the meeting ended with no visible progress.\nThe seven African leaders — the presidents of Comoros, Senegal, South Africa and Zambia, as well as Egypt’s prime minister and top envoys from the Republic of Congo and Uganda — visited Ukraine on Friday to try to help end the nearly 16-month-old war.\nThe African leaders then traveled to St. Petersburg on Saturday to meet with Putin who was attending Russia’s showpiece international economic forum.\nDetails about the delegation’s proposals were thin.\nForeign Minister Sergey Lavrov said after the three-hour meeting that the Africans’ peace plan consisted of 10 elements, but “was not formulated on paper.”\n___\nWest Virginia basketball coach Bob Huggins resigns hours after drunken driving arrest\nWest Virginia basketball coach Bob Huggins has resigned a day after his arrest on suspicion of drunken driving in the latest incident in a Hall of Fame career that imploded quickly.\nThe university announced the resignation Saturday night. It came a month after the university suspended him for three games for using an anti-gay slur while also denigrating Catholics during a radio interview.\nThe 69-year-old Huggins leaves as the third-winningest coach all-time in Division I with 935 career victories, behind only Mike Krzyzewski of Duke (1,202) and Jim Boeheim of Syracuse (998), both of whom are retired. Unlike the others, Huggins had no national titles, taking Cincinnati to the Final Four in 1992 and West Virginia in 2010.\nHuggins had 16-year stints each with the Bearcats and Mountaineers. Both ended in the aftermath of arrests for drinking and driving.\nHuggins was charged with driving under the influence on Friday night after his SUV had stopped in the middle of traffic in Pittsburgh with a shredded tire. According to a criminal complaint, a breath test determined Huggins’ blood alcohol content was 0.21%, more than twice the legal limit.\n___\nCollapsed stretch of Interstate 95 in Philadelphia to reopen within 2 weeks, governor says\nPHILADELPHIA (AP) — The collapsed stretch of Interstate 95 in Philadelphia will reopen within two weeks, Pennsylvania’s governor said Saturday, after joining President Joe Biden on a helicopter tour over the critical segment of the highway closed to East Coast traffic since last weekend.\n“We are getting it done here in Philly,” Gov. Josh Shapiro said at a briefing at Philadelphia International Airport after the flyover that included members of Congress and the city’s mayor.\nBiden outlined the substantial initial federal commitment and longer term support for a permanent fix for the vital roadway. “I know how important this stretch of highway is” to Philadelphia and the Northeast Corridor, he said. “Over 150,000 vehicles travel on it every day, including 14,000 trucks. … It’s critical to our economy and it’s critical to our quality of life.’’\nShapiro, offering a timeline that would be welcome news to commuters and long-haul truckers alike, said with Biden at his side: “I can state with confidence that we will have I-95 reopened within the next two weeks. We are going to get traffic moving again thanks to the extraordinary work that is going on here.”\nHe said “folks here in Philly have a real renewed sense of civic pride through this project” and that “there’s something special happening in our community” with people coming together.\n___\nMicrosoft says early June disruptions to Outlook, cloud platform, were cyberattacks\nBOSTON (AP) — In early June, sporadic but serious service disruptions plagued Microsoft’s flagship office suite — including the Outlook email and OneDrive file-sharing apps — and cloud computing platform. A shadowy hacktivist group claimed responsibility, saying it flooded the sites with junk traffic in distributed denial-of-service attacks.\nInitially reticent to name the cause, Microsoft has now disclosed that DDoS attacks by the murky upstart were indeed to blame.\nBut the software giant has offered few details — and did not immediately comment on how many customers were affected and whether the impact was global. A spokeswoman confirmed that the group that calls itself Anonymous Sudan was behind the attacks. It claimed responsibility on its Telegram social media channel at the time. Some security researchers believe the group to be Russian.\nMicrosoft’s explanation in a blog post Friday evening followed a request by The Associated Press two days earlier. Slim on details, the post said the attacks “temporarily impacted availability” of some services. It said the attackers were focused on “disruption and publicity” and likely used rented cloud infrastructure and virtual private networks to bombard Microsoft servers from so-called botnets of zombie computers around the globe.\nMicrosoft said there was no evidence any customer data was accessed or compromised.\n___\nSecurity tight for Vegas Golden Knights victory parade, amid echoes of deadly 2017 shooting\nLAS VEGAS (AP) — Tens of thousands of Vegas Golden Knights fans, maybe more, were expected at the heart of the Las Vegas Strip on Saturday for a Stanley Cup victory parade and a rally to mark the team’s first-ever NHL championship.\nFor the team that played its first game as an expansion franchise in October 2017 and for tourists in hotel rooms with windows overlooking the parade route in 2023, the event bore echoes of the deadliest mass shooting in modern U.S. history five years ago. Guests in high-rises with views of the strip were awakened by security guards asking to check around windows for guns or other weapons.\nLas Vegas police said they prepared for upwards of 100,000 people to cram street-level viewing areas along Las Vegas Boulevard for a celebration that planners compared with annual New Year’s Eve fireworks shows that in past years have drawn estimates of 400,000 people. Unlike a winter midnight, evening temperatures on Saturday were expected to be in the 90s.\nHotel security guards searching rooms evoked the October 2017 shooting, when a lone gunman rained bullets from 32nd floor windows of the Mandalay Bay hotel into a crowd of 20,000 people at an outdoor country music festival across the street. Fifty-eight people died that night and two died later of their injuries. Authorities said more than 850 people were injured. The gunman killed himself before police reached him. His motive for the attack was never firmly established.\nPlayers who dubbed themselves the Golden Misfits after being drafted from other NHL teams embraced survivors, first responders and volunteers and the team has over the years become a key part of “Vegas Strong” events aimed at healing community trauma.",
  "word_count": 2422,
  "scraped_at": "2026-02-14T12:00:28.462710"
}