{
  "article_id": "451b1f8b7576",
  "url": "https://www.leinsterexpress.ie/news/your-community/1946358/laois-community-voluntary-award-unsung-hero-nominee-profiles-2025.html",
  "title": "Laois Community & Voluntary Award Unsung Hero nominee profiles 2025",
  "date": "20251119T004500Z",
  "domain": "leinsterexpress.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Entertainment at the Community and Voluntary Awards 2023.\nThe Laois Unsung Hero accolade for a significant contribution made by an individual to life in their own local community and beyond will be presented at the culmination of the Laois Community and Voluntary Awards.\nThere are 22 nominations in the Unsung Hero category, with the winner announced at the gala event at the Midlands Park Hotel in Portlaoise, hosted by Laois County Council on Friday, November 21 2025.\nAll the nominees are people who selflessly and quietly give of their time and dedication, expecting nothing in return except the reward of improving their communities.\nPeople First Credit Union, Laois Partnership, Laois Sports Partnership, Laois Volunteer Centre support the awards. The Leinster Express / Laois Live is the media partner.\nThe following is the shortlist and nomination profiles for Unsung Hero 2025\nREAD ALSO: Laois volunteer heroes to be recognised at annual awards\nLouise Foster\nLouise Foster has been a driving force behind basketball in the Midlands and across Ireland. As the founder and Head Coach of Kestrels Basketball Club since 2007, she has coached every age group annually, nurturing generations of players with passion and dedication. Her weekends are spent travelling nationwide to coach and referee, reflecting her tireless commitment to the sport.\nBeyond the court, Louise served nearly 20 years as Fixture Secretary on the Midlands Area Basketball Board, ensuring the smooth running of regional competitions. Her leadership and organisational skills have been vital to the sport’s development.\nA former Irish international player, Louise’s elite experience inspires young athletes. She has mentored and scouted players who’ve gone on to represent Ireland and play professionally abroad. Her long-term vision is evident in the success of teams she’s developed from youth to senior level.\nLouise’s impact extends beyond sport - she builds community. Many of her former players now give back as referees, coaches, and officials, creating a culture of volunteerism. Her legacy is one of integrity, leadership, and service. Louise Foster is a true unsung hero whose influence will be felt for generations.\nSandra Trofimova\nSandra has been a tireless advocate for migrants in the Midlands since 2013, offering voluntary support to individuals from Syria, Pakistan, India, Ukraine, Africa, the Baltic region, and beyond. She helps newcomers navigate health services, provides language translation, and fosters integration through community events and cultural exchange. Her work builds bridges between communities and promotes inclusion.\nSandra leads two Ukrainian associations—Midlands Ukrainian Association and Ukrainian Laois Support Association—organising cultural programs and social events. Recently, she founded the Laois Baltic Association to support integration and encourage active lifestyles. Her leadership has created safe, welcoming spaces for migrants to connect and thrive.\nHer humanitarian efforts extend internationally. Sandra has coordinated charitable campaigns sending supplies and gifts to orphanages in Moldova and Latvia and provided aid to those affected by the crisis in Ukraine. Her compassion and dedication have made a tangible impact on vulnerable lives.\nKnown throughout Portlaoise and Laois as a kind and generous figure, Sandra inspires others to get involved. Her work raises awareness of migrant challenges and fosters empathy and solidarity. Through her unwavering commitment, Sandra has strengthened the social fabric of the Midlands, making her a true pillar of the community.\nRuth Delaney\nRuth is the heart of Mountrath Health & Fitness Academy, where she manages the Community Gym and serves as its lead coach. Since taking on the role just before the pandemic, Ruth has shown unwavering dedication, keeping members connected and active through challenging times. Her energy, humour, and compassion create a welcoming space for all—from Mum and Baby classes to Senior Movers and 1-1 sessions for adults with special needs.\nRuth’s approach is deeply personal. She tailors sessions to individual needs, empowering clients and fostering confidence. Her work with a young non-verbal man and wheelchair users highlights her intuitive coaching and belief in every person’s potential. She encourages social connection, often organising tea gatherings, birthday celebrations, and post-exercise chats.\nBeyond the gym, Ruth builds community spirit. She’s led inclusive events like Bike Week, linking local groups and schools, and supports charities and initiatives across Laois. Her creativity shines in events like office pool tournaments and Christmas parties that bring people together.\nDespite personal health challenges, Ruth continues to uplift others. Her infectious enthusiasm, tireless work ethic, and genuine care make her a true unsung hero—transforming lives, strengthening community bonds, and inspiring all who meet her.\nTom & Kathleen Flynn\nTom and Kathleen Flynn are pillars of the Durrow community, dedicating decades to volunteering, environmental stewardship, and social inclusion. Kathleen’s leadership in Durrow Tidy Towns has driven sustainability projects aligned with the UN Sustainable Development Goals, including wildlife surveys and ecological education. Her passion extends globally, volunteering in Africa with the Niall Mellon Township Trust, and locally, through roles with the ICA, Irish Guide Dogs, and fundraising for causes like the Irish Kidney Association and RNLI.\nTom’s infectious humour and tireless spirit have made him a beloved figure. A retired firefighter, he continues to serve through the Community Council, St. Vincent de Paul, and befriending initiatives. His dedication to youth sport spans generations, coaching soccer and hurling at local and county levels. He’s a regular volunteer at events like the Durrow Scarecrow Festival and “Durrow Goes to Hollywood,” always lifting spirits.\nTogether, they’ve fostered cultural exchange, supported isolated individuals, and built lasting community bonds. Their kindness, humility, and unwavering commitment have touched countless lives. Whether hosting international visitors or celebrating local heritage, Tom and Kathleen embody the true spirit of volunteerism. They are the heart and soul of Durrow; unsung heroes whose impact deserves recognition.\nJoe Quigley\nJoe has been the backbone of the Timahoe Community Hall Committee since its founding in the 1980s. As the only original member still serving, his dedication spans nearly four decades. Joe has gone far beyond the role of a typical committee member, acting as caretaker, secretary, organiser, and problem-solver. He manages bookings, oversees maintenance, handles finances, applies for grants, and keeps meticulous records that preserve the hall’s history for future generations.\nHis commitment includes countless unseen tasks: arranging gas deliveries, recording electricity readings, emptying the septic tank, and ensuring the hall runs smoothly. Joe’s reliability and quiet leadership have made the hall a welcoming space for all, from local groups and schools to parish events and family gatherings. His compassion and good humour shine through, whether he’s helping during celebrations or supporting others in times of need.\nBeyond the hall, Joe has served as a firefighter, supported farming families through Macra and the IFA, volunteered with the parish, and contributed to youth sport and local fundraisers. He’s even lifted spirits with his accordion playing. Joe embodies true community spirit giving selflessly, consistently, and without seeking recognition. His legacy is woven into the fabric of Timahoe, who give his all for his community.\nPadraic Dolan\nPadraic Dolan is the Head Coach of Laois Marlins Swim Club and an ICU Nurse Manager at Portlaoise hospital, embodying leadership, compassion, and service in every aspect of his life. Under his guidance, Laois Marlins has become a thriving, inclusive club serving swimmers of all ages and abilities, including children with additional needs and visual impairments. Padraic’s quiet dedication fosters not just athletic excellence, but confidence, teamwork, and community pride.\nIn June 2025, Padraic’s heroism saved the life of 14-year-old Logan, a club swimmer who suffered sudden cardiac arrest during a training camp in Barcelona. With no working defibrillator and paramedics delayed, Padraic performed CPR for 12 minutes, defying the odds and ensuring Logan’s survival without neurological damage. His calm, skilful response reflected the same values he instils in others - resilience, care, and selflessness.\nPadraic gives countless voluntary hours to coaching, mentoring, organising events, and supporting swimmers and families. His impact reaches far beyond the pool. He is trusted, respected, and deeply valued by the Laois community. Padraic’s contribution is not defined by one heroic act, but by years of quiet service and leadership. He is a true unsung hero whose influence will be felt for generations.\nMary Cuddy\nMary Cuddy is the heartbeat of Camross and a Local Hero. Mary dedicates herself to an extraordinary range of community roles with energy, humour, and unwavering commitment. She is Treasurer of the Camross Community Association, managing finances and facility operations, and a key figure in Camross Community Alert, monitoring phone lines and social media 24/7. Mary also edits the Camross Parish newsletter and produces a monthly local edition, keeping the community informed and connected.\nHer talents extend to music as the keyboardist and musical director for the Cosy Café Choir, recently leading a successful fundraiser. She’s a founding member of the Wednesday Club, tackling social isolation through coffee mornings and lunch gatherings. Mary is also an EMT with the Roscrea Red Cross, training weekly and qualified to drive the ambulance.\nMary’s impact is felt across generations balancing family, work, and volunteering with grace and humour. She’s a straight talker, a problem solver, and a source of strength for many. Her contributions span church, health, social care, and the arts, making her irreplaceable. As one nominator said, “There must be eight days in her week.” Mary Cuddy truly embodies the spirit of community.\nGer Browne\nGer Brown is a passionate and dedicated soccer coach whose impact on inclusive sport in Laois is truly exceptional. For over a decade, Ger has volunteered with Portlaoise AFC, beginning with coaching children with intellectual disabilities. His commitment deepened five years ago when he embraced visually impaired soccer, creating Ireland’s largest VI youth team. Players travel from across the country, Donegal, Cork, Dublin, and Waterford to train with Ger, a testament to his reputation and skill.\nGer is now a head coach with the national blind soccer team and played a key role in installing Ireland’s first blind soccer boards in Portlaoise, making Laois a leader in accessible sport. His coaching has helped teens reach national squads and empowered children to play alongside classmates using bell balls, transforming isolation into inclusion.\nGer also supports camps for children with autism and Down syndrome and works with Laois Sports Partnership and the FAI as a tutor across disability programmes. His approach is deeply personal, he sees the player first, not the disability. Ger’s knowledge, compassion, and vision have made him a hero to many. He leads with heart, inspires with action, and exemplifies what it means to be a volunteer, coach, and community champion.\nSarah Graham\nSarah Graham is a core volunteer at Teac Tom in Stradbally, where she plays a vital role in supporting individuals and families affected by suicide and mental health challenges. As the first point of contact for many in crisis, Sarah offers compassion, calm, and immediate support, often saving lives through her quick response and unwavering presence. Her ability to listen, guide, and connect people with appropriate counselling services makes her an irreplaceable part of the outreach team.\nSarah co-facilitates the Family Support Group twice a month, providing a safe, healing space for those bereaved by suicide. Her warmth and lived experience help families navigate grief, isolation, and everyday challenges. These sessions not only offer emotional relief but also serve as a powerful form of suicide prevention.\nBeyond direct support, Sarah contributes to awareness campaigns and fundraising efforts, ensuring Teac Tom remains accessible to all. Her dedication helps maintain free, no-wait services at a time when public mental health resources are stretched thin.\nSarah’s work transforms tragedy into hope, offering strength and connection to those who need it most. Her selfless service, bravery, and compassion make her a true Unsung Hero—impacting lives across Laois and beyond.\nPatrick Blake\nPatrick has been a dedicated volunteer in Clonaslee since the age of 10, beginning his journey with the Tidy Towns committee. Six years ago, he stepped into the role of secretary at a remarkably young age and has excelled ever since. Every Tuesday and Thursday evening, Patrick is out maintaining the beauty of Clonaslee, and his pride in the village is truly inspiring. His commitment helped Clonaslee increase its Tidy Towns score by 13 points and win the Pride of Place award from Tullamore Credit Union.\nPatrick’s community involvement goes far beyond Tidy Towns. He is a choir member, Eucharistic and bereavement minister, reader at Mass, and a valued member of the Parish Council and Clonaslee CCDA. He also assists Fr. O’Reilly and is known for his kindness, warm smile, and ability to connect with people of all ages.\nHe delivers Meals on Wheels, helps with the local lotto every Monday, and is especially thoughtful toward the elderly. Patrick’s dedication, reliability, and generosity make him a true asset to Clonaslee. He is a credit to his family and community, and his selfless service across so many areas makes him a truly deserving candidate for the Unsung Hero Award.\nRoisin Lawlor\nRoisin has made a remarkable and lasting impact in her role as ESF Officer in Laois, championing adult literacy, inclusion, and accessibility. She has led and supported numerous community initiatives aimed at empowering those most in need, particularly individuals who are often overlooked. A standout example is her leadership of the “Sport Through Literacy” programme for neurodiverse adults, which exceeded expectations by engaging over 25 participants. This initiative successfully blended physical activity with literacy, numeracy, and well-being.\nRoisin has also played a key role in health literacy programmes and works closely with local organisations including LOETB, Traveller Action groups, and Youth Services. Her collaborative, humble approach ensures that projects are community-driven and inclusive. She consistently uplifts her team and partners, never seeking personal recognition.\nHer dedication has earned her praise from colleagues and national organisations such as SOLAS and NALA. Roisin’s work strengthens community ties, fosters confidence, and creates lasting opportunities for learning and inclusion. Her tireless efforts and quiet leadership embody the spirit of an unsung hero, making her a deserving nominee for the Unsung Hero Award. Her legacy is one of compassion, collaboration, and meaningful change across Laois and beyond.\nGerry Furlong\nGerry Furlong exemplifies the true spirit of an unsung hero, quietly transforming lives and communities through selfless service. A tireless volunteer with Tidy Towns, Gerry is often seen picking up litter and involving his grandchildren, turning a personal commitment into a family tradition that inspires others. His dedication extends far beyond environmental efforts. Through PATH, he helps deliver food to those experiencing homelessness in Dublin and supports struggling families in Laois. With Alone, Gerry provides companionship to isolated individuals, offering warmth and dignity through simple, meaningful conversations.\nWhat sets Gerry apart is his instinctive kindness. Upon noticing an elderly man struggling with shopping, Gerry offered help that evolved into ongoing support, organising household essentials and even installing flooring himself. He never seeks recognition, yet his impact is profound and far-reaching. Gerry’s actions reflect a deep compassion and unwavering commitment to others, often responding to need without being asked. His humility, generosity, and community spirit shine through in everything he does.\nGerry Furlong doesn’t just volunteer. He uplifts, connects, and cares. His quiet contributions have made a lasting difference, and he is truly a deserving nominee for Unsung Hero.\nLouise McCormack\nLouise has been a driving force behind O’Dempsey’s GAA Club, serving in key roles including Secretary, Treasurer, and most recently Chairperson (2020–2024). Under her leadership, the club experienced transformative growth where membership rose from 300 to over 500, and major developments were achieved, including floodlights, a Ball Wall, and a revived members bar. She secured €128,000 in Sports Capital funding for pitch upgrades and a club gym, and launched the Healthy Club Initiative, introducing inclusive programmes like cardiac screening, fitness classes, and social events for older members.\nNow serving as Adult Football Administrator, Louise manages everything from fixtures and registrations to insurance and matchday logistics, often single-handedly. Her idea to provide meals for visiting teams has become a hallmark of hospitality. Beyond the club, she volunteers with Portarlington Meals on Wheels and recently helped raise €1,200 through a local match.\nLouise made history as the club’s first female Chairperson, inspiring women and championing inclusivity. Her leadership style is hands-on, compassionate, and deeply rooted in community values. Whether rallying volunteers or quietly encouraging a player, Louise’s impact is felt everywhere. Tireless, humble, and visionary, she truly embodies the spirit of an Unsung Hero.\nLindsay Martin-Fenlon\nLindsay Martin-Fenlon is making a profound impact by helping to normalise brain disease, particularly dementia, through her innovative children’s book Melting Moments. With over 65,000 diagnosed cases in Ireland and many more undiagnosed, Lindsay’s work addresses a growing need for compassionate, accessible resources. Her beautifully illustrated story follows two penguin characters, Toddles and Waddles, as they navigate memory loss with love and understanding, offering children a gentle way to explore dementia and its emotional effects.\nA physiotherapist and mother of five, Lindsay was inspired by her work in a nursing home and her own children to create a resource that fosters connection across generations. Her dedication led to a nationwide initiative to distribute Melting Moments in English and Irish to every primary school in Ireland, with library partnerships ensuring continued access. The book reached the Irish Times Best Seller List and is being translated into multiple languages, with Lindsay offering the template freely to other countries.\nAll proceeds go to Dementia Ireland, and Lindsay continues to raise awareness through community events. Her work exemplifies the power of grassroots action, combining creativity, compassion, and advocacy to support families and reduce stigma. Lindsay is a true Unsung Hero, bringing light and understanding to a challenging topic.\nTrudi Lalor\nTrudi Lalor is a passionate advocate for Laois, whose tireless efforts have brought renewed energy and pride to the county. She has led the restoration of Bloom HQ in Mountrath, working with her former classmates to create meaningful spaces, including a dedicated music room in memory of Rachel McCarthy. Their work earned the National Heritage Award in 2024. Trudi’s deep connection to her hometown is evident in her frequent visits and constant engagement with the local community.\nIn 2025, Trudi spearheaded the Laois Homecoming Weekend, a hugely successful event that reconnected people with their roots. Many activities were free, supported by local sponsorship, and her vision has the potential to expand to other towns like Emo, Portarlington, and Mountmellick. Trudi’s ability to rally support and inspire action is unmatched.\nA celebrated country music singer, Trudi has represented Laois on the world stage while remaining deeply committed to her community. She and her husband Billy promote Irish country music through festivals and dance weekends, both locally and internationally. Her humble beginnings and unwavering dedication make her a true ambassador for Laois. Trudi’s leadership, creativity, and generosity embody the spirit of an Unsung Hero, inspiring others to dream big and give back.\nRoss Doyle\nRoss is the driving force behind Castletown Tidy Towns, serving as Chairperson and dedicating countless hours to improving the village. Known as the “invisible man” of the community, Ross quietly leads by example, planting and painting flower boxes annually, maintaining equipment, and ensuring the village is clean and welcoming. He’s responsible for putting up the Christmas lights and the church crib, often with the help of Magda, and is always ready to lend a hand at a moment’s notice.\nRoss played a key role in building the Sli Sibheal walk, a major community project, and regularly maintains the river walkway and bridge walls. He organises family fun days, bringing together local groups and creating joyful, inclusive events focused on community rather than profit. His BBQ skills and hands-on setup make these days memorable for all.\nRoss also supports grant applications, helps the De La Salle Brothers, and even builds fairy trails to delight local children. His energy, positivity, and commitment to Castletown are unmatched. Whether it’s cutting grass, rallying volunteers, or coordinating events, Ross does it all with humility and heart. He is a true Unsung Hero whose work has shaped Castletown into a vibrant, welcoming place for residents and visitors alike.\nPhilip McLoughlin\nPhilip has had a role on the executive committee of Arles Kilcruise GFC since 2004 and continues to be part of our development committee to this day. He has acted as treasurer, chairman and secretary over the years. Throughout this time, he has always had the best interests of the club at heart and was always willing to step in to help when required. A carpenter by trade, Philip has always used his physical skills to enhance the club grounds and carry out repairs where necessary. This year alone, he has helped complete all the carpentry work required for the upgrades to the club gym area, sourced and installed new backstop nets and poles following storm damage in January, assisted with the installation of walking track lights, coordinated the preparation of our driveway for long awaited tarmac, helped clear the parking area of debris, replaced fascia and guttering on the clubhouse, organised the clipping and clean-up of hedging on the grounds, ordered oil for the heating, looked after collection of bins, looked after the 1st aid and cleaning supplies, cut the grass on a weekly basis, lined pitches for matches and put out/gathered flags, sold tickets for the Calf Splat Fundraiser, collected money for the club by parking cars at the Stradbally Steam Rally and the National Ploughing Championships Often if one passes the pitch, they will spot Philip's white van and he might be 'just giving the dressing room a sweep' or 'cleaning up the toilets for a match'. While all his own children have moved through the ranks and on to adult football and beyond, Philip will often be seen at a juvenile match keeping an eye out for the talent for the future.\nQuiet by nature, Philip doesn't like being the centre of attention but is most certainly the centre of the club. Without his constant commitment, the club grounds would not be in the showcase condition that it is in. In addition to this, he is the epitome of what a club man should be...one will be just as likely to see Philip at an u7s game as an Intermediate Final. He will know all the kids coming through the ranks long after his own have grown to adulthood. He will sell tickets, promote our fundraisers, park cars at the Ploughing, have the banter in O Kelly's Bar in Ballickmoyler, enjoy the odd players stag party or\nwedding up the country and enjoy the company of the club and community members. We are very grateful to him for all he does and would like to nominate him for this Unsung Hero Aware to recognise his contribution to the club and the community.\nWhen you look at the facilities we have in our small rural club, Philip has contributed to every part of it. He was instrumental when we acquired the land for our current pitch in and put in trojan work get the field ready before its opening in 2004. Since then, Philip has been a constant and if there is a job to be done, Philip is the most trusted individual in the club to oversee and complete the job.\nOver the years, we have improved our facilities, and Philip has spearheaded nearly every project, from erecting floodlights, painting goalposts, putting up our perimeter fencing around the pitch, completing all carpentry tasks and liaising with other tradesmen. While many clubs are fortunate to have a large group of volunteers or community scheme workers to manage the facilities, we have one Philip who takes on the to-do-list of the club and always gets the job done, on time and completed to perfection.\nOver the years, in addition to his involvement in our club, Philip has also been active in other aspects of the community from the Board of Management of the local primary school to the local development committee. He even built a beautiful new crib for the church last Christmas! In the last year alone, his work, from erecting new lights on the walking track to finishing the joinery in our clubhouse gym, has helped us cast our net to invite more people from the wider community to use our facilities,\nbe it walking with a friend or participating in a Pilates or circuit class. It is a joy to see everyone from the age of 4 to 80+ making use out of our facilities.\nPhilip is also a beacon of positivity to have around the place. Be it a training session, a fundraiser or match, people are drawn to Philip for a chat and a laugh.\nAs a community, we are indebted to Philip. While everyone always sings his praises, we feel that he would be worthy and gracious recipient of the Unsung Hero Award.\nKevin McCann\nKevin is the driving force behind the monthly arts exhibition held in the Chapel at Bloom HQ in Mountrath. These exhibitions have become a vibrant platform for local and regional artists to display their work, connect with the community, and celebrate creativity in all its forms. Each month, Kevin curates a fresh and diverse collection of artworks ranging from painting and photography to sculpture and mixed media, ensuring that there is always something new and inspiring for visitors to\nexperience.\nBeyond the exhibitions themselves, Kevin’s efforts have helped foster a sense of community, creativity, and cultural pride in Mountrath. He consistently supports emerging artists, provides them with opportunities to share their work, and brings people together through a shared appreciation of the arts. His work is done entirely on a voluntary basis and with genuine passion for both the arts and his community. Through his efforts the community has been exposed to many forms of art within their own community. Kevin's commitment to enriching the cultural life of Laois is truly commendable. We believe he would be a very worthy and deserving recipient of this award.\nWhen Mountrath Community Forum began renovations in the old Brigidine Convent we had many ideas of how to use the various spaces and the various events we wished to host. One of these was regular art exhibitions. This could not have been achieved without Kevin and the artists group. They initially used the space for meetings with a studio area for their own painting. However, when the old chapel was renovated, the idea was mooted to hold regular exhibitions beginning with their own work. Kevin believed that this could be expanded and took on the task of organising exhibitions of other artists work, thus exposing the local community to various artforms. Through his efforts artists also had a space to showcase their art. Mountrath really did not have a history of art shows and most of the community were not aware of the many talented people within the local community. They now look forward to monthly exhibitions and the many and various mediums that constitutes art.\nKevin has been the driving force, identifying artists and organising the space on a practical level. Mountrath Community Forum are pleased to nominate Kevin firstly for exposing us and the community to wonderful art and secondly for enhancing the old chapel usage in such a delightful way.\nEimear Matthews\nEimear has coached countless children and adults in swimming in Laois over many years. She coaches 4 swim sessions a week for Trilogy, all year around, between Portlaoise, Portarlington, Castletown, Maganey and Ballinakill. She travels all over the county to facilitate members. She is also a very accomplished swimmer and triathlete in her own right, and she provides wonderful mentorship to all our members, who look up to her for her valuable experience. She inspires us all in the club.\nEimear's calm, gentle nature makes her an excellent teacher and a wonderful mentor. She goes above and beyond with all her students, of all abilities. She has never let us down, and is reliable, punctual, patient and polite always. Our new members programme each year is designed to teach absolute beginner adults in all 3 triathlon disciplines. The feedback from the new members on Eimear's coaching is always wonderful. She is a terrific asset to our club and to our county and she deserves to\nbe nominated in recognition of her wonderful, selfless service.\nEimear has provided hundreds if not thousands of people across Laois with the vital life-skill of confidence in the water and encouraged their ability and belief in themselves. Eimear's easy and approachable friendly nature always calms the nervous swimmer or nervous beginner. She will get into\nthe open water alongside her students and coach and encourage them from her kayak. She will always make her students feel safe and secure, understanding that some may be understandably nervous starting out. Eimear coaches in both swimming pools and in open water all over the county, and she always teaches at the pace the student is ready for. Her empathy and kindness mean that she always gets the best out of everyone. Her contribution to sport and fitness in Laois is immeasurable.\nEimear always encourages her students, she believes in everyone and in their ability to learn to swim and to improve their swimming. She is passionate about the sport and its benefits, both physical and mental, and she inspires everyone who is lucky enough to be coached by her. Swimming is often seen as a barrier to some from getting involved in triathlon. Eimear breaks down that barrier, and without her the sport of triathlon in Laois would not be as strong as it is today.\nJames Kilbride\nJames has been contributing to our local community for over the past 35 years. He spearheaded our local 10K in 1992 and on the 14th of September 2025 he achieved the running of the 32nd 10K event. This event has put Luggacurren on the map with athletics clubs around the country. He is chairperson of the Luggacurren Development /Tidy Towns. Since 2000 he has organised a voluntary team to mow and care for our old medieval church and graveyard in Clopook. Fortnightly during the growing season James has a text reminder out and gathers the troops in a jovial and encouraging way.\nHe is chairperson of Clopook Graveyard Group. From a young age, James has always had an interest in athletics. He has served as an official in St. Abban's athletics club for over thirty years, fundraising and as a marshal for all major events. Most recently he helped with their FIT4LIFE Summer League.\nJames is actively involved in helping to keep the community safe and is chairperson of our Parish Text Alert which also includes a Senior Alert Scheme (SAS) for older members of our community.\nJames is a keen badminton player. He has given great service over many years to his Athy RFC Badminton Club and is known widely throughout Leinster through this sport.\nJames has been selfless in his contribution to our local community for over 35 years. His first involvement was with a parish youth club. To this day, people in their forties will talk fondly of James and the outlet the club gave them as teenagers in a rural area, well before mobile phones! His voluntary work grew over the years and has extended way past our parish to St Abban's Athletics Club and to his Athy RFC Badminton Club. Our Luggacurren Development/Tidy Towns has been enriched\nover many years by James' work and participation. Going back to early years the first step was to help improve our community building once a NS and to care for public spaces in the village. This is ongoing and James remains committed giving willingly of his time and efforts. Our annual 10K which was his brainchild started in 1992. This annual event has put our little village on the map and brought so much joy to participants. Running the 32nd event this September is testament to James' commitment and dedication. While James has built a good team around the organising of the 10K his knowledge of\nathletics means he takes ultimate responsibility for the finer details. In athletic competitions every second counts! James has great respect for the competitors and works very hard to run the event in a professional way while providing a warm welcome and a good team to ensure all runs smoothly. MORE BELOW PHOTO\nPat Kavangh accepts the Unsung Hero Award in 2023. Pic: Michael Scully\nJames' involvement in Clopook graveyard since 2000 has also enriched our community. He has given freely of his time to organise a voluntary group to care for the graveyard. Having an active voluntary group resulted in the graveyard being selected as one of 3 in Laois to benefit From a Just Transition & Pollination EU funded programme 2020-2023. This has brought an increased interest in the heritage of the graveyard and medieval ruins of the church on the site. During heritage week a very successful heritage event was held in the graveyard. One could say James' efforts to keep a voluntary group\ntogether has culminated in these happenings.\nThe community hall has been improved over the years and the public spaces in the village developed and cared for. The voluntary work James has put in helped to make these improvements and he continues to do so. All these improvements have benefited the community. Being chairperson of an organisation is not the most sought-after job but a necessary one. James is chairperson of the Luggacurren Development/Tidy Towns, Ballyadams Parish Text Alert and Clopook Graveyard Group. Giving of his time to these organisations contributes greatly to the good of the community. James is an outgoing person who can bring people along. His jovial demeanour makes people feel good and that has a positive effect in recruiting volunteers. The banter and craic are usually good. James involves others for the good of the community. His ability to engage with young adults and draw them into volunteering is testament to his genuine good nature and the respect he has earned in his community. Giving as he does to St Abban's Athletics means broadening his positive contribution to a much wider community. James is known far and wide for his good deeds. His affable personality allows him to be a good fundraiser for community events. He is a very good supporter and ticket buyer. He is also a great man to approach local representatives to plead the case of the community be that road conditions, streetlights or the need for Community Employment Scheme rules age changes in order to get much needed maintenance workers into our rural villages.\nTim Browne\nTim Browne has been involved with Clonad GAA Club for the past thirty-five years. He has coached and managed teams and has mentored many young players to keep them active in hurling. More recently he has been Treasurer of the club for fifteen years and, while managing all finances, also heads up any fundraising initiatives in the club. Alongside this contribution, Tim and his business Browne's Animal Feeds continuously sponsor the adult team in the club without asking for any public acknowledgement or appreciation. His business has also employed seven Clonad players on a part- or full-time basis. Alongside this official contribution, Tim reaches out to any players, and the local community has quietly supported many players and neighbours through injury, ill health and other difficulties. Someone recently said to us that every club should have a Tim Browne.\nTim Browne gives his time generously and is often seen as a force to be reckoned with in the club. He is kind and approachable and is actively working for all in Clonad Club and its members. He has greatly contributed to the continuity of the club physically and financially and has done so equally during successful times and during less successful times. As a club, we want to acknowledge Tim's contribution which has spanned over three decades. Tim has always stayed involved and loyal to the club, even at a time when he had no family members involved.\nHis role as Treasurer in the club is all consuming and he has ensured that Clonad GAA has survived and prospered and is in a very healthy financial situation. While helping daily with the club, Tim also calls to elderly members and neighbours, to whom he delivers coal, lunches, and newspapers. Along with supporting Clonad GAA, he generously supports other causes including Portlaoise Action for the Homeless, among others. Tim became involved in the Clonad Juvenile Club over thirty years ago and trained teams to reach and win underage titles. He has remained actively involved with adults’ teams since finishing with the juvenile structure but, recently he has brought his young grandchildren out to play with Clonad and has embarked on the cycle again with a third generation of Brownes involved with Clonad. In his shop, Brownes Animal Feeds, eight Clonad players have been given part time or full-time work and have received excellent training in business, while also being very well looked after for their work. All these players have remained loyal to Tim and often credit him with giving them the confidence and skills to undertake greater challenges in the workplace.\nCarmel Farrell\nIn 2015, Carmel and those volunteering with her at Electric Picnic were asked by Festival Republic to man the Lost and Found at the picnic so that the Gardaí could put their personnel to work in other areas. The Lost and Found has extended from the three days of the picnic to mid-October and it consists of a fantastic group of volunteers who have mostly been volunteering with Carmel since day 1. At the present time, Carmel recruits, schedules timetables for and manages over 100 volunteers each year. Carmel's volunteering role begins each year in early March when she gets the email from Festival Republic, and she finishes when Lost and Found winds up in mid-October. This volunteering to date has benefitted the RC Parish Church, Stradbally Union of Parishes, St Vincent de Paul, Teach Tom, Stradbally Tidy Towns & Lights, the Steam Museum where we base the Lost & Found retrieval and sorting, and Fealacaun. To date, the funding given by Festival Republic to the charities totals about €120,000, and we are the link between local charities, organisations and Festival Republic. Carmel emphasises that Fintan has been with her in all the above and without his support, help and patience, she couldn’t have given the amount of time needed to complete her “job”.\nCarmel Farrell's contribution to the little town of Stradbally has been steadfast and valuable over the decades. Carmel was secretary of the Stradbally Development Committee when the first “open” meeting was held in St Joseph’s Hall - 2004 - with the proposal that the Electric Picnic music festival be held in Stradbally. Carmel was Secretary of the Electric Picnic Residents Committee for several years, between 2008 to 2012, and she was Chairperson from 2012-2015. Carmel started volunteering as Volunteer Co-ordinator in 2013 when the picnic celebrated 10 years, and we distributed “cake” to the picnic goers (punters). The following year, she was asked to organise volunteers to provide information to the punters. Throughout all this time, Carmel has worked hard on the Church Avenue Residents Association. Not only this but in her working role as admin to Glen Bradshaw, Carmel has facilitated the use of the Malt House heritage building for events, meetings, launches and community celebrations right here in the heart of the little town. Carmel is professional and insightful in all her tasks - ask anyone in the parish and they will tell you the very same.\nCarmel has said that the volunteer work is done because it is good to be involved. Some members of community like to be involved in something that is such a talking point in Stradbally, without going to the partyzones of the Picnic. The team of volunteers who come together under Carmel's stewardship have many and varied backgrounds. Some don't socialise too much but love the camaraderie and the satisfaction of a job well done and a lifeline, medication, house or car keys, phone, wallet, identification or camera restored to their owners. They know that they are representing their homeplace well. One volunteer Alice will be 80 in Nov, and Alice is volunteering since 2015. Every year before Carmel commits, she asks the volunteers if they would like to participate again, and she says, \"the response is always so good, I plod along for another year as I don’t want to let my volunteers down either.\"\nThe 2024 award was won by PJ Phelan.\nThe Leinster Express / Laois Live will have extensive coverage in print in our November 25 edition and on the night of the wards on November 21.\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nSubscribe or register today to discover more from DonegalLive.ie\nBuy the e-paper of the Donegal Democrat, Donegal People's Press, Donegal Post and Inish Times here for instant access to Donegal's premier news titles.\nKeep up with the latest news from Donegal with our daily newsletter featuring the most important stories of the day delivered to your inbox every evening at 5pm.",
  "word_count": 6887,
  "scraped_at": "2026-02-14T13:33:08.505145"
}