{
  "article_id": "452876090764",
  "url": "https://www.fourfourtwo.com/news/when-is-sam-kerr-returning-from-injury-chelsea",
  "title": "When is Sam Kerr returning from injury ? ",
  "date": "20241127T210000Z",
  "domain": "fourfourtwo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "When is Sam Kerr returning from injury?\nSam Kerr is Australia's record goalscorer but is currently out of action with a long-term knee injury.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nFor just over four years Sam Kerr has led the line for Chelsea - helping the Blues to an unprecedented era of success in the process.\nKerr, 31, has 58 goals in just 75 WSL games for Chelsea helping them win the league title in every season she has played for the club.\nEven in a squad with as much quality as Chelsea’s, Kerr’s absence is still keenly felt as she remains on the sidelines with an ACL injury. So when might we see her back on the pitch?\nSam Kerr’s injury and when she could return to playing\nKerr ruptured her anterior cruciate ligament at a warm weather training camp during the 2023-24 winter break, becoming the latest name to have suffered the injury in the women’s game – an ongoing problem widely described as an epidemic.\nChelsea confirmed the injury on January 7, 2024 - and that she would miss the remainder of that season. The Blues still managed to win the WSL in spite of their star players' absence, with Kerr was spotted in the team celebrations on the final day of the season.\nDespite the injury her future at Stamford Bridge is assured, Kerr putting pen to paper on a new two-year contract in June.\nMost players to have suffered an ACL take between nine and 14 months to fully recover – although this is dependent on the age and injury history of the individual.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nChelsea manager Sonia Bompastor gave an update to fans in early December about the Matildas captain.\n\"We are looking to have her back with us in February, March, not before that,\" Bompastor said of the Australian striker.\n\"She didn't start yet to train, even being modified with the group, so she's still on her individual process rehab and I think it will take at least two or three more months for her to be fit enough to be with the squad.\"\nKerr was also included in the travelling Chelsea squad who went to Portugal on a warm weather camp in January.\n2024 did give Kerr plenty of good news off the pitch – her and partner Kristie Mewis, of the USWNT and West Ham, having announced they are expecting their first child together.\nJack has worked as a sports reporter full-time since 2021. He previously worked as the Chief Women’s Football Writer at the Mirror, covering the England Women’s national team and the Women’s Super League. Jack has reported on a number of major sporting events in recent years including the 2023 FIFA Women’s World Cup on the ground in Australia. When not writing on football, he can often be spotted playing the game somewhere in west London.",
  "word_count": 595,
  "scraped_at": "2026-02-14T13:31:19.249113"
}