{
  "article_id": "453093371e52",
  "url": "https://www.courant.com/2025/05/01/dom-amore-how-the-transfer-portal-brought-uconn-athletics-twice-the-talent/",
  "title": "How the transfer portal brought UConn talent times two",
  "date": "20250501T101500Z",
  "domain": "courant.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sione Moa had been telling Kaitlyn Richins that when he decided to pop the question, he would take her by surprise. She insisted she knew him too well for that.\nMoa concocted a story about his father getting an award at a ski resort and they’d have to get dressed for it, then kept sending mixed signals. Maybe they didn’t have to go. Maybe he wouldn’t get dressed. Richins was a little confused, and suspected something was up. Then on a snowy evening in Utah last January, he produced the ring.\n“It was super sweet,” Richins said. “He was so nervous that day. He’ll say he wasn’t. It was just a super, super perfect day.”\nDom Amore: Scottie Scheffler, still No. 1, ready to run it back at Travelers\nWhat wasn’t perfect was the mountainous 128 miles that had been separating them. They met as freshmen student-athletes at Utah State, but Moa had transferred to BYU to play linebacker for the football team while Richins stayed in Logan, Utah, and became an All-American center back in women’s soccer.\n“I was actually done with soccer,” she said. “I had another year but I decided to be done so I could be closer to him at BYU and we could take the next step in our relationship.”\nThe NCAA transfer portal isn’t generally considered the tunnel of love; in fact, it had separated the Moa and Richins. But now it has led them together on this coolest of adventures. With one year of football left, Moa put his name in the portal and immediately heard from UConn.\n“For me, it wasn’t about a certain school or certain location,” Moa said. “I was just looking for my best situation and I really liked what (the UConn coaches) had for me. And Kaitlyn was coming off an incredible season, All-American, Mountain West Defensive Player of the Year, so it wasn’t too hard to find a spot where she could play. Any school would take her.”\nRichins reached out to UConn’s women’s soccer program, and next thing they knew, they were flying to Connecticut, 2,200 miles distant and 4,000 feet lower in altitude from where they’d spent their entire lives. They had dinner together with the football coaches on April 21, and Richins toured the women’s soccer facilities the next day.\n“We just fell in love with the campus,” Richins said. “… Everyone was just so nice, so kind. It all happened so fast.”\nThis week, UConn turned this unusual recruiting double play. Coaches cannot comment until the paperwork is done, which should happen in the next few days, but both Moa and Richins announced their commitments. They’ve already posted photos in their new uniforms and plan to be on campus to stay by the end of May.\n“They were sending me some graphics and stats of linebackers who had played (for coordinator Matt Brock) at Mississippi and UConn,” said Moa, 6 feet 1 and 230 pounds. “This defense is really built for linebackers to make plays. That was already in my mind, then seeing how beautiful the campus is and how awesome the people were that I got to meet.”\nBoth teams are coming off great seasons. Moa was a freshman at Utah State, having just met his future wife, when Jim Mora took the Huskies out there for his first game in 2022. Last season, UConn was 9-4, beating North Carolina in the Fenway Bowl, the program enjoying success and relevance that had been missing for more than a decade. A former Husky receiver, Keelan Marion, played with Moa at BYU and gave him a good scouting report.\n“I didn’t know much about UConn history,” said Moa, who has played in 25 college games. “As soon as the coaches contacted me, I looked up last season, they were 9-4 and Coach Mora is the head coach, he’s big time. Obviously, basketball, men’s and women’s, is nationally known, but I think a lot of people have respect for UConn’s (football) program, they’re on the rise right now.”\nMeanwhile, coach Margaret Rodriguez led the UConn women’s soccer team (14-5-4) to the Big East championship and a victory over Rutgers in the first round of the NCAA Tournament before losing, 2-1, to Stanford in the Round of 32. Richins, named a third-team All-American by Top Drawer Soccer, joins striker Chioma Okafor, who had 13 goals and four assists, two-time third-team All-American by United Soccer Coaches.\n“I feel like the biggest thing I would want to add to the team is a good culture piece,” said Richins, who has three goals and four assists in 55 college games. “I hope to bring good energy to the team, an energy that can lift other up and I hope I can somewhat be a leader, because I am a fifth-year senior. I hope I can bring that experience and translate it.”\nMoa comes from a family of football players and a hotbed of the sport, Weber, Utah. His father, Ben, played tight end at Utah, his uncle, Carlos Nuno, played tight end for BYU, and his younger brother was a top recruit. Before starting college at Utah State, Sione served a full-time mission in Jamaica for the The Church of Jesus Christ of Latter-day Saints, so he is a year older than Richins.\n“Sione is a great teammate and wants to be there for his teammates,” Richins said. “Personally, he is the hardest worker I have ever met. He’s going into his last season learning a new defense, but the amount of time he takes watching film and studying the playbook, he is going to put so much time and effort in, he is going to be totally prepared.”\nMoa has been studying business management. He will enroll at UConn in general studies with an eye on graduating next December. Richins has her degree in sociology and is deciding which master’s program she’ll apply to at UConn. They’re planning a wedding for June 2026.\n“I’m really excited to experience something new with him,” Richins said. “We’ve never really been on the East Coast. We’re really excited to experience this new place and experience something else. It’s going to be awesome.”\nWho is the best athlete in the family?\n“I’ve got to say me, but Kaitlyn’s a great athlete, too,” said Moa, who just may want to give that answer a little more thought.\n“I would have to agree with him,” Richins said. “He’s the better athlete for sure.”\n… But Moa recovered rather nicely. “When we have kids,” he said. “I’m going say they have their mom’s genes when they’re doing well.”\nDom Amore’s Sunday Read: Meet Yale’s Jack Ohman, tops in ERA; UConn men probing Boston and more",
  "word_count": 1120,
  "scraped_at": "2026-02-14T13:21:03.498696"
}