{
  "article_id": "454af5208775",
  "url": "https://www.theguardian.com/world/2023/feb/22/first-edition-four-day-week",
  "title": "Wednesday briefing : The four - day week works – so how long until we all get one ? ",
  "date": "20230222T081500Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Good morning. Last June, First Edition reported on the launch of a four-day week pilot scheme in the UK. Nine months later, the results are in: the experiment has been hailed a resounding success.\nOf the 61 companies involved, 56 will continue with shorter hours, including 18 that have made the change permanent. Workers have said that their productivity has either stayed the same or increased and, crucially, they are happier and healthier. Campaigners have called the trial a “major breakthrough moment” as they prepare to push politicians to give workers a 32-hour week.\nFor today’s newsletter, I spoke to Guardian special correspondent Heather Stewart about whether we should all get ready for three-day weekends. That’s right after the headlines.\nFive big stories\n-\nTurkey | The death toll from the two latest earthquakes to hit Turkey and Syria on Monday has risen to eight people. Up to 300 others were injured in the latest instances of seismic activity, which came two weeks after two quakes caused devastation.\n-\nNHS | The Royal College of Nursing has said it will pause strike action in England as it enters ‘intensive’ pay talks with the government. The unexpected move has raised hopes that both sides will agree to a deal that will end their long-running pay dispute.\n-\nEducation | Black people wrongly labelled “educationally subnormal” as children have launched a campaign demanding an apology and compensation from the UK government. The group, wrongly sent to special schools in the 1960s and 70s, say their experiences marred both their confidence and life chances.\n-\nRussia | In a speech for the one-year anniversary of his country’s invasion of Ukraine, Vladimir Putin said Russia would halt its participation in the last major remaining nuclear arms control treaty with the US.\n-\nUS news | The Biden administration has unveiled a Trump-style immigration proposal that could prohibit tens of thousands of migrants arriving at the US-Mexico border from claiming asylum, in an attempt to deter unauthorised crossings.\nIn depth: ‘It seems a long way off, but none of it ought to be impossible’\nThe four-day week is no longer a lefty pipe dream, but rather a viable way of working for thousands of people in the UK and around the world. The rapidly changing social and economic landscape has opened up many possibilities for the future of work, says Heather: “I think the pandemic has given employers a jolt in terms of what’s possible, and it’s also given workers a sense of their autonomy”. But this is not the end of the campaign – so what’s next for the four-day week?\nCould it become the norm?\nWhile the scheme was the largest of its kind in the UK to date, it still represented a relatively small section of the workforce. Unsurprisingly, it also worked best with smaller, more agile companies.\nWorkers in many sectors are still grappling with zero-hour contracts, poor pay and poor working conditions. For them, a four-day week seems out of the question until these issues are addressed. “When I was interviewing Amazon workers who were involved in the strike [in January], they were saying, you can only really make ends meet if you do at least 40 hours a week, but a lot of people were working up to 60 hours a week because the pay is so terrible,” says Heather. “In industries where there is so little bargaining power, [a four-day week] would be a very big leap.”\nAnd for public-facing organisations like the NHS or schools, the problems are further complicated by a recruitment crisis that has left the workers who are still there overworked and burnt out. These issues, however, are not insurmountable, says Heather. “It seems a long way off in these parts of the workforce, but none of it ought to be impossible. A five-day week seemed unthinkable before it first came in.”\nThere is also an argument to be made that a four-day week could help alleviate some of the recruitment issues that many companies and organisations are facing, by offering further flexibility to a workforce that has an increasingly high number of economically inactive people who have been forced out of the labour market. A shorter work week, with the same pay, could be a more feasible option for people paying for childcare, those with long-term health conditions, or people heading towards retirement.\nHow do we get there?\nThere are two main routes to making a four-day week an option for workers in the UK. “You could legislate for it to be mandatory for all workers, which would be on the most robust end, and say that this is the normal working week for everyone,” says Heather. “Or you could legislate so that a four-day week is one of the things that workers can request as a right, in the same way you have a right to request flexible working,” she adds.\nThe 4 Day Week Campaign will continue to encourage companies to implement the different working structures that they are advocating for, building on the momentum of the trial to make a shorter week a viable, mainstream option within the next decade.\nThe complications\nIn its intended form, a four-day-week is not the same as a compressed week – workers should ideally not be trying to cram five days’ worth of work into a shorter period of time. Instead their workload should also be cut by 20%, with no loss to pay. Joe Ryle, the director of the 4 Day Week Campaign, has stressed that compression “is not the answer to tackling burnout, stress and overwork”. However, for some of the companies in the trial, the transition was only possible by extending the working day to deal with the excess workload, while others had to accept that on occasion staff would need to do some work on their day off.\nFor other companies, the trial helped them recognise what they needed to improve: “One company realised there were departments where the trial wasn’t working that well because they weren’t that well-staffed in the first place, and so they just couldn’t do their work in four days,” Heather says. “Even when it’s working well overall, there are still adjustments and growing pains that need to be addressed.”\nWhat’s next for the campaign?\nUnfortunately for most of us, Thursday will not become the new Friday any time soon. But the 4 Day Week Campaign will continue to trying to make it a reality for as many people as possible. “I imagine they’ll keep trying to find high profile companies to show that this works in different sectors and at scale until it becomes a normal alternative working pattern,” Heather says.\nCampaigners will likely try to bring politicians on board to accelerate their efforts. However, the disparities that exist within the economy mean that the conversations about transforming the work week will probably still remain out of reach for many for some time to come.\nWhat else we’ve been reading\n-\nAlmost a year since the start of the war in Ukraine, Clea Skopeliti spoke to the Ukrainians who stayed and those who are returning to their homes about how their lives have changed. Nimo\n-\nArwa Madhawi calls the subversive “house hackers” of TikTok what they really are: the new generation of live-in landlords. Hannah J Davies, deputy editor, newsletters\n-\nZoe Williams hilariously chronicles her experience accidentally gatecrashing what she dubbed a “young people party” (under 30s), when she was on her way to an “old people party” (over 40s). Let’s say the host was not best pleased. Nimo\n-\n“Urdu has brought me so much, but I worry that it is closed off to my children”: Saima Mir writes warmly about not speaking her mother tongue with her own sons, and the guilt it brings. Hannah\n-\nRich Pelley spoke to the man who took the saying “if you want something done well, do it yourself” to a new level. Computer programmer Cassius John-Adams explains why he spent the last three years obsessively, single-handedly creating his dream 90s video game by mashing up Crazy Taxi and The Fifth Element. Nimo\nSport\nCricket | Nat Sciver-Brunt shone as Pakistan were crushed by England by 114 runs at the Women’s T20 World Cup in South Africa. Sciver-Brunt, the tournament’s leading run-scorer, hit an unbeaten 81 from 40 balls, leaving her team set to face either the hosts or New Zealand in the semi-finals.\nFootball | England coach Sarina Wiegman has admitted the lack of diversity in the women’s game is “not going to change overnight”. All 13 players to feature for the Lionesses in Monday’s under-23s’ 4-1 victory over Belgium were white.\nBasketball | Two years after using an antisemitic slur during a livestream, NBA center Meyers Leonard has signed a short-term contract with the Milwaukee Bucks. The 30-year-old, who said he knew the term he used was offensive but did not know its true meaning, has not played since 2021. He has been working with Jewish social groups since the incident.\nThe front pages\nThe Guardian leads this morning with “Nurses pause strike action to enter ‘intensive’ pay talks”. “Ring of hatred inside the Met” – that’s the Metro, about officers’ “‘sexist, racist’ WhatsApp posts”. The Financial Times has “Sunak weighs 5% public sector pay rise after £30bn Treasury windfall”; the Telegraph says something else, “Public sector to be offered 3.5pc raise”. The i says “Resign if you want to, Sunak tells ministers, as he calls Tory rebels’ bluff on Brexit deal” while the Times has “Putin signals the return of cold war nuclear tests”. “Your lust for land and power will fail” – Biden’s message to Putin, says the Daily Mail. “Nicola cops failed my sis, too” – that’s the Sun on another case involving Lancashire police. “Rationing of fruit and veg to last weeks” is the top story in the Daily Express. “It’s OK to be scared but we fight” – says the Daily Mirror’s “Ukraine: one year on” special front page.\nToday in Focus\nThe secret world of disinformation for hire\nHow an undercover investigation revealed a team of Israeli contractors who claim to have manipulated more than 30 elections around the world using hacking, sabotage and automated disinformation on social media.\nCartoon of the day | Martin Rowson\nThe Upside\nA bit of good news to remind you that the world’s not all bad\nWeighing up to 50kg and growing up to 1.5 metres in length, the giant armadillo is bigger than most large dogs, but with a low demographic density and shy night-time behaviour, until recently it was one of the least understood – and least recorded – animals in South America.\nConservationist Arnaud Desbiez set about learning more about the rare animal in 2009 and his findings have upended previous notions about its breeding, parenting and ecological importance. “This is a species that few people have ever seen, a species that can disappear without anybody noticing. Yet it plays a central role in the ecosystem,” Desbiez says.\nSign up here for a weekly roundup of The Upside, sent to you every Sunday\nBored at work?\nAnd finally, the Guardian’s crosswords are here to keep you entertained throughout the day – with plenty more on the Guardian’s Puzzles app for iOS and Android. Until tomorrow.\n-\nThis article was amended on 22 February 2023 to refer to the Royal College of Nursing, rather than “Nurses”",
  "word_count": 1907,
  "scraped_at": "2026-02-14T13:03:18.586078"
}