{
  "article_id": "455fca07fd29",
  "url": "https://theathletic.com/5157100/2024/01/01/david-de-gea-transfer-future-manchester-united/",
  "title": "Why David de Gea hasnt signed for a new club – and what he been doing instead",
  "date": "20240101T060000Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Seven months ago, David de Gea was awarded the Premier League’s Golden Glove award for keeping more clean sheets than any other goalkeeper throughout the 2022-23 season. But instead of being in the midst of a gruelling festive period, travelling up and down the country, one of the league’s best goalkeepers in recent years remains without a club after leaving Manchester United via the back door and amid a contract dispute at the end of June.\nAdvertisement\nHis time is now spent playing padel, staying fit, going out for dinners with his friends, running his esports team, and appearing at Manchester United Women’s matches. He earned a notable fortune at United, where he was on £375,000 a week from 2019 to 2023, so can’t be blamed for taking time to assess his options, especially after marrying his fiancée, Edurne, in the summer.\nThroughout the transfer window, De Gea received multiple offers and enquiries, ranging from teams at the top of leagues across Europe as well as those in the bottom half of the table. Nothing, however, could be agreed, and he is reluctant to drop down the league. There was talk of him joining Inter in Serie A, but there was little appeal in replacing Andre Onana, his successor at United.\nPart of De Gea’s seemingly relaxed approach to his future is that he has been enjoying being away from professional football. He made his Atletico Madrid debut in 2009 and spent 12 years under the microscope and intense pressure at United. On that front, this is the first time he has taken a step back and allowed himself a break.\nHis final game for United, the FA Cup final defeat against Manchester City, included a mistake on his part and was the straw that broke the camel’s back as far as Erik ten Hag was concerned, with the United manager wanting a goalkeeper with excellent distribution and the ability to play more of a sweeper role.\nThe 33-year-old has since been linked with a return to the Premier League via Newcastle United, a move to Saudi Arabia, multiple Spanish clubs and also retirement. His deliberate silence, turning down multiple interview requests out of respect for his former club, has added to the mystery about his next steps.\nFollowing Nick Pope’s shoulder injury — which required surgery — at the beginning of December, the possibility of signing De Gea was discussed at Newcastle. They are weighing up whether to go for a goalkeeper to fill the void for the next six months or to sign a younger one who could be their long-term No 1. It is the second dislocated shoulder Pope has suffered in his career, after a first when playing for Burnley in 2018, and Newcastle are assessing the prognosis.\nGO DEEPER\nHow do Newcastle navigate four months without Nick Pope?\nSources close to De Gea, speaking on the condition of anonymity to protect relationships, noted how the Spaniard had given serious consideration to retiring in the summer, and just after, as no enticing offers were forthcoming. It has not helped his case that he does not have an agent.\nAdvertisement\nAfter being released by United, having had his contract offer taken off the table and with Ten Hag pursuing Onana, he felt no sense of wanting to prove them wrong. He expected an offer from Saudi Arabia, who are spending heavily on big-name players to boost the Saudi Pro League, but no clubs were willing to eclipse the salary he earned at Old Trafford.\nDe Gea has kept himself fit, doing football-focused training three to four times a week, and is potentially fitter than he has been in recent years given the amount of sport he is playing. This means he will be ready to step in straight away at a club should he get a move.\nHis wife, who is a judge on TV show Spain’s Got Talent, will play a key role in where he decides to continue his career. The pair have a daughter, Yanay. At this stage, he is looking for quality of life for his family, which is why he would seek a significant salary if he was to join a Saudi Arabian club, as it is unlikely his family would join him in the Middle East. Edurne had been flying over to visit De Gea in between work.\nThe United States — he would want to be on the west coast — has not been written off as a possible destination, nor has playing for one of the best teams in Europe, although the latter is not thought to be a priority.\nDe Gea has remained in contact with former team-mates and colleagues at Old Trafford, with Bruno Fernandes posting a picture on social media with the goalkeeper, Raphael Varane, Tom Heaton and Victor Lindelof meeting in October, and the goalkeeper dined with friends at San Carlo in Hale earlier this month.\nView this post on Instagram\nFernandes invests in De Gea’s esports team, Rebels Gaming, and it has proven successful. The team — neither De Gea nor Fernandes play — are national champions in Valorant and Rainbow Six and are targeting international success. They are due to announce their 2024 schedule imminently and that has been a focus of his.\nAdvertisement\nHe returned to Madrid for Christmas on December 20, having spent the last month and a half in England. As De Gea was paid by a United Kingdom-based company, he had to spend a certain amount of time in England before being able to return to Spain permanently. The tax year in Spain runs from January 1 to December 31, so his move home also coincides with that.\nDe Gea has enjoyed being a non-footballer, making the most of his time away from the game, but there is an acceptance that, unless he announces his retirement, he needs to decide on his next steps. There will no doubt be potential suitors, but, ultimately, he has to want it.\nAdditional reporting by Laurie Whitwell.\nGO DEEPER\nThe cruel truth? De Gea was unfit for Ten Hag's purpose. He had to go\n(Top photo: De Gea watching Manchester United Women in October; by Matt McNulty via Getty Images)",
  "word_count": 1037,
  "scraped_at": "2026-02-14T13:30:02.660179"
}