{
  "article_id": "4564fdc1ff0a",
  "url": "https://www.the42.ie/martin-moloney-exeter-2642901-Jun2025/",
  "title": "  I loved putting on the Leinster jersey every single time  ",
  "date": "20250614T064500Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "MARTIN MOLONEY WILL be there in Croke Park this evening.\nHe’s an ex-Leinster player now, having just enjoyed a strong first season with Exeter in England, but Moloney will be willing on some of his best friends against the Bulls.\nThe 25-year-old was at the Aviva Stadium last weekend too, taking great joy as his former housemate, Jamie Osborne, had an outstanding game in the semi-final win over Glasgow. Thomas Clarkson, who Moloney came through the academy with, was another Leinster man who shone.\n“You have some of your best friends playing and you’re just hoping they go on to be man of the match,” says Moloney of the fairly new experience of being a Leinster fan.\nAfter that win over Glasgow, Moloney went back to Osborne, Brian Deeny and Sam Prendergast’s house to catch up with them. Clarkson and another five of their Leinster team-mates came over too. They did what they have always done – watched sport. The Bulls’ URC win over the Sharks was followed by the gripping Munster hurling final that went to penalties.\nThe evening reminded Moloney of the years he spent working his way through the Leinster academy onto a senior contract in 2022. He made 11 appearances for his native province before leaving last year.\nThere is no hint of bitterness on Moloney’s part that things didn’t progress further for him in Leinster. He’s genuinely delighted to see his mates getting ahead in blue and green jerseys, with others soon heading off to play in red ones in Australia.\nMoloney’s friends have also no doubt been thrilled to see the powerful, combative flanker making an impact outside of Leinster.\nSitting in a café in Dublin this week, the Athy man was excited to reflect on signing a new deal with Exeter to extend his time with the Premiership club into next season. He joined initially on a short trial last summer and quickly earned a one-year contract.\nMoloney set a target of playing 20 games. He made it 21 appearances in the last game of the season against Sale two weekends ago.\n“You learn the best lessons in the arena,” is how Moloney puts it as he sums up how beneficial this season has been for him.\nHe had a short spell on loan to Cornish Pirates in the Championship in December but fought his way into Exeter’s back row towards the end of the season, earning his new deal with the Premiership club.\nDirector of rugby Rob Baxter noted how Moloney “was playing his best rugby for us towards the end of the campaign where he really showed his value,” and highlighted that they expect him to get better and better next season.\nLife in Exeter has been good so far, even if Moloney’s partner, Tess, has been back in Dublin working “unbelievably hard” as a doctor in the Mater Hospital. Her support and the big effort to get over for his games has made it all possible. The pay-off has been some memorable weekends visiting beautiful parts of Devon and Cornwall.\nMoloney is excited about Exeter’s new signings for next season, including Wallabies centre Len Ikitau and South African hooker Joseph Dweba. The newcomers, along with the returning England wing Immanuel Feyi-Waboso, will add to a talented squad.\nThis season was difficult for Exeter. They finished second from bottom in the Premiership with four wins in 18 games. Moloney points out that they were involved in a fair few tight losses. No fewer than eight losing bonus points highlight how it was close to being a much happier season.\n“One thing about the Premiership is that the teams are so evenly matched,” said Moloney. “If you look at a set of five games in a weekend, they’re unbelievably hard to predict.\n“Within the league, there are lots of contrasting styles of play. The way Bristol play is very different to the way Sale play. So each week it’s kind of a fresh challenge, it’s a great league to play in.”\nHe wasn’t playing on the dark day when Exeter were hammered 79-17 by Gloucester, prompting club owner Tony Rowe to give the players a dressing down in the changing room afterwards.\nLong-serving coaches Rob Hunter and Ali Hepher left the club in the wake of that game, following defence coach Omar Mouneimne’s exit in October, but Moloney says the players just had to keep trucking on.\n“It was a horrible day for the club. Rob was a coach who had a big, positive impact on my game. And so I was obviously sad to see him go. It was tough for a lot of people, the same with Ali and Omar.\n“As a player, the only thing you can control is your next game and how you’re preparing for it and how as a team, you come together and prepare for the next game.”\nDespite the challenges for Exeter, Moloney has been able to develop his game.\nHe has always been a destructive defender. The Chiefs challenged him to bring more variety. So on top of his longstanding jackaling quality, Moloney has been working hard on reefing the ball in tackles, as well as making better decisions around the breakdown and not over-chasing turnovers. His set-piece skills have also improved.\nExeter’s DNA has always been about physicality. Moloney has never struggled in that regard. It’s his calling card. Anyone who has watched him play will have noted the relentlessness of his contact work. There is a slightly wild edge to Moloney’s work rate, something that Leinster loved about him.\nA calm, considered, articulate young man away from the pitch, Moloney brings an aggressive edge on it.\n“The physical part of the game is a part that I really enjoy,” he says. “I put a lot of preparation into it because I think that has a big impact on the players around you and also has a big impact on the result.\n“Obviously, tactical and technical stuff is very important, but in some of the big games, the most physical team wins.\n“Where do I get my edge from? Anywhere I can.”\nThere is a big technical element to his physicality. It’s not just about his mindset. Moloney is grateful to have trained and played alongside Will Connors, “one of the best chop tacklers in the world,” and Josh van der Flier, who had a big influence on him.\nIt’s no surprise that Moloney looked up to Seán O’Brien when he was coming through, all the more so because they’re both products of the Leinster Youths system.\nMoloney initially grew up in Carlow on a diet of hurling and football, but when he was 10, he moved with his family onto their beef farm a stone’s throw away from Athy RFC. Moloney went down to the Showgrounds and instantly loved rugby.\nHe played for Athy – also Joey Carbery and Jeremy Loughman’s home club – right through until joining the Leinster academy, proudly representing them in the Provincial Towns Cup before moving to Clontarf in the All-Ireland League.\nSo Moloney was ecstatic to watch Athy claim the Towns Cup in April, their first success in the competition since 1984.\n“There is a really special group of people there running the club who were in the club when I was there and they’re all still there,” says Moloney.\n“And even more people have come in since and they’ve managed to get a really good group of senior players together. They’re able to put out two women’s teams as well. They’re doing a fantastic job.”\nMoloney wouldn’t have a professional rugby career without Athy. His school, Knockbeg College, didn’t play rugby. He loved his days in Knockbeg, playing in a brilliant football team, a good hurling team, running cross-country, throwing shot put, and getting involved in any other sport on offer. Moloney’s campaign to start a rugby team was unsuccessful.\nSo his rugby was all in Athy RFC. Moloney is proud to have come from there, through the North Midlands team in the Shane Horgan Cup, the Leinster Clubs U18 team, and on into an Ireland U18s jersey.\nThe majority of Irish professional players come through rugby schools and though Moloney never felt in any way disadvantaged, he says contact time with a rugby ball was something he later had to account for.\n“The biggest thing is that lads in schools would play rugby at lunch every single day,” says Moloney. “I was playing hurling, football and basketball. The lads in schools have a rugby ball in their hands for every five minutes they have to spare.”\nThe Leinster Youths Selects programme was helpful for Moloney, with coaches like Noel McNamara bringing together groups of talented club players for sessions during the season.\nMcNamara was a massive influence on Moloney, coaching him for the Ireland U18s and U20s, as well as in the Leinster academy. He developed Moloney’s technical and tactical understanding, his ball-carrying, and pretty much everything else.\n“Noel has an unbelievable way… he’s so articulate in the way that he can explain the game,” says Moloney “It’s no surprise really that Bordeaux have probably the best attack in the world.”\nMoloney’s senior Leinster debut came in a Rainbow Cup game against Munster in 2021, with his first start the following year in the Pro14 against Edinburgh, the first of a run of appearances at the tail end of the 2021/22 season.\nBack row competition in Leinster is always fierce and Moloney had to be patient until what looked like a breakthrough performance against the Sharks in October 2022.\nHe was supposed to be the 24th man. Jack Conan was injured during the warm-up, so Moloney went onto the bench. Then Rhys Ruddock was concussed soon after kick-off. In came Moloney for a 78-minute shift alongside Johnny Sexton, Andrew Porter, Dan Sheehan, and Robbie Henshaw.\nLeinster won a thrilling URC game 54-34 and Moloney was superb. It looked like a turning point for him, but disaster struck a few weeks later when he ruptured his ACL. From such a high against the Sharks, Moloney had his “darkest day” in rugby as he was injured against Scarlets. He wouldn’t play again nearly a year and a half.\nMoloney responded stoically, helped by a call from van der Flier.\n“Josh rang me a few days after I got injured and said, ‘Look, it’s not going to be a straightforward journey, no long-term injury is, but you can make this the best period of your life and come back a much better player.’\n“That stuck with me for a few parts of the journey and some of the days that didn’t go well.”\nHaving undergone the initial surgery, Moloney moved in with his parents in Athy to begin his recovery. They set up a bed in the living room beside the TV for those immobile initial days. He was grateful for the support from his family and Tess.\nMoloney’s pathway back to fitness was difficult. He needed two further bouts of knee surgery and when he finally got back into Leinster training, he ruptured one of his biceps.\nIt was cruel but Moloney stuck at it, working hard to make himself physically stronger in the gym during that long period on the sidelines. He also improved his mental skills in sessions with Leinster’s Declan Darcy.\nThere was great pride in making his comeback for Leinster off the bench against the Stormers in South Africa in April 2024, a full 17 months after his knee injury.\n“You learn a lot about yourself in those periods and I do think it sticks with you,” says Moloney of nearly 500 days of injury rehab.\n“It does give you an extra layer of resilience.”\nThat game in Cape Town last year proved to be his last one for Leinster, but all has worked out well in Exeter so far.\nThe example of Tadhg Beirne shows how dogged, talented players like Moloney can take a different route to the top. Playing for Ireland remains his main overall goal in rugby and Moloney feels Exeter is a perfect place for him to improve his game.\nFor today, he’s back in the role of Leinster supporter. He was also at the Northampton semi-final in the Champions Cup and hopes this is a happier occasion.\n“I absolutely loved putting on the Leinster jersey every single time,” says Moloney.\n“I really want them to go on now and win the URC. I think they deserve to win and hopefully they get over the line this year.”",
  "word_count": 2091,
  "scraped_at": "2026-02-14T12:35:07.725012"
}