{
  "article_id": "45b045ad9220",
  "url": "https://www.uefa.com/insideuefa/news/0285-191233394924-957f568c1f0b-1000--legends-add-stardust-at-schools-event/",
  "title": "UEFA Grassroots Week : Legends sprinkle stardust on Cyprus Football in Schools event | Inside UEFA",
  "date": "20230927T101500Z",
  "domain": "uefa.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "UEFA Grassroots Week: Legends sprinkle stardust on Cyprus Football in Schools event\nTuesday, September 26, 2023\nArticle summary\nPresident Aleksander Čeferin was joined by four former stars in Limassol on Tuesday, as they celebrated UEFA Grassroots Week with local children.\nArticle top media content\nArticle body\nUEFA and the Cyprus Football Association (CFA) staged a very special event on Tuesday morning, offering more than 90 children the opportunity to test their skills against several footballing legends.\nThe Limassol event welcomed boys and girls aged 12-13 to the city's Alphamega Stadium, and was a celebration of UEFA's successful Football in Schools initiative, which offers children across Europe access to high-quality and enjoyable coaching.\nJoining the children on the pitch for a morning of fun matches and skill challenges were UEFA president Aleksander Čeferin and former stars including Croatian pair Zvonimir Boban and Aljoša Asanović, Germany's Nadine Kessler and Portugal's Luís Figo.\nThe event represented the flagship moment in UEFA Grassroots Week, which, aligned with the European Week of Sport, promotes a healthy, active lifestyle and places the spotlight on the millions of us across the continent who are involved in football for the love of the game and the countless benefits it brings us.\nUEFA president, Aleksander Čeferin:\n\"This Football in Schools event is always one of the nicest in the UEFA calendar. It's great that we can come here to Cyprus and make so many children happy, and you can see how excited they are to see these stars.\n\"I often emphasise that football isn't only about elite-level play. While top-tier football is great and generates revenue to support initiatives like this, it's crucial to recognise the significance of football's essential values. The same values children can embrace from an early age by participating in the beautiful game of football.\"\nCFA president, George Koumas:\n\"We are very proud to stage this event. We want to take football to every school in Cyprus, and as a federation have donated footballs to every school and opened coaching academies for teachers, so that they can transfer skills to the kids.\n\"We are a small country and we could not do this alone without the assistance from UEFA, who transfer the knowledge to the coaches in our administration. It's very important to us and a big thank you to UEFA, because without this we cannot make the step forwards.\"\nUEFA Football in Schools: four more years\nOn Monday, European football's governing body announced a renewal of the Football in Schools programme, committing €11m between 2024 and 2028 to getting more children playing in school.\nEarly exposure to the sport helps not just develop a love of the game but encourages a healthy, active lifestyle and teaches important motor skills, as well as developing life skills such as teamwork, respect and fair play.\nSince its launch in 2020, the programme has enjoyed incredible success across Europe, and by 2024 will have reached more than 2.8 million children in all 55 UEFA member national associations, with 64,000 teachers trained to deliver high-quality sessions.\nUEFA technical director and chief of football, Zvonimir Boban:\n\"We are all kids who love football, and this passion has to stay with you, so it was fantastic to see the children enjoying the game. It is crucial for the young ones to understand how much football can help them learn different skills, not only physical but psychological and social skills that help us understand and think about others. Playing football can really help to make them better people.\"\nUEFA managing director of women's football, Nadine Kessler:\n\"We had a fantastic time with the kids over there and you can really see what football means to them, but also the role that we have in providing more opportunities for boys and girls across Europe. It's an honour to be involved, and it's important to see the impact you have on children's lives, to spend time with them and see them having fun.\"\nCyprus' commitment to teaching teachers\nThe Cyprus FA (CFA), which earlier this year won the UEFA Grassroots Award for Best Participation Initiative, is aiming to educate one teacher in every elementary school across the country as part of its own commitment to getting 50,000 children aged 6-12 playing the game.\nThe support for teacher coaching is part of the new Memorandum of Understanding between the CFA and the country’s Ministry of Education, Youth and Sports.",
  "word_count": 734,
  "scraped_at": "2026-02-14T13:09:19.375933"
}