{
  "article_id": "45ba76adf97e",
  "url": "https://www.irishecho.com/2023/10/ogbene-gets-first-pl-goal",
  "title": "Ogbene gets first PL goal",
  "date": "20231026T191500Z",
  "domain": "irishecho.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Republic of Ireland striker Chiedozie Ogbene got his first-ever English Premier League goal on Saturday when he scored for Luton Town as they came from being 2-0 down to draw 2-2 away to Nottingham Forest. The Hatters were trailing 2-0 until the 83rd minute when Forest failed to deal with a routine free-kick and Ogbene fired home the loose ball. Adebayo got Luton’s equalizer two minutes into stoppage time.\nOgbene was born in Nigeria, but the family moved to Cork when he was 8 years old. He played Gaelic football for Nemo Rangers and later switched to soccer and played in the League of Ireland for Cork City and Limerick before moving to Brentford in January 2018. He joined League One club Rotherham in August 2019 and helped them win promotion to the Championship. In June of this year, the month after his 26th birthday, Chiedozie was newly-promoted Luton’s first big summer signing.\nMCNALLY ON TARGET\nIn the Championship Meath-born Luke McNally, who played for Drogheda and St Patrick’s Athletic in the League of Ireland, got Stoke City’s winner in their 2-1 home win over Sunderland. Shane Duffy scored for both teams as Norwich lost 3-2 at home to Leeds. Duffy’s near post header gave the Canaries the lead after 4 minutes, but then an own goal by the Irishman after 63 minutes allowed Leeds back in the game. Leeds manager Daniel Farke sensed his opportunity after Duffy’s own goal and sent on Patrick Bamford and Italian Wilfried Gnonto, showing off Leeds’s attacking riches and two late goals from Summerville won it for the visitors, who are now up to 3rd in the table. Will Smallbone was on target for Southampton, who won 2-1 away to Hull City, whose scorer was Liam Delap, son of former Irish striker Rory Delap. Leicester are top of the Championship table with 33 points, five clear of Ipswich Town, whose game on Friday was postponed due to bad weather.\nMCCABE SCORES\nFOR GUNNERS\nIn the English Women’s Super League Irish captain Katie McCabe scored both of Arsenal’s goals as they won 2-1 away to Bristol City. Everton’s Irish goalkeeper Courtney Brosnan had a busy Sunday afternoon as The Toffees lost 5-0 at home to Manchester United Women. After four series of games Manchester City and Chelsea are joint top with 10 points, Arsenal are in sixth place with 7 points.\nFor full sports coverage, check out the print-digital edition of this week's Irish Echo.",
  "word_count": 410,
  "scraped_at": "2026-02-14T12:40:50.403367"
}