{
  "article_id": "45c186ae8a0e",
  "url": "https://thestandard.org.nz/open-mike-22-06-2023/",
  "title": "Open mike 22 / 06 / 2023",
  "date": "20230621T203000Z",
  "domain": "thestandard.org.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Written By:\n- Date published:\n6:00 am, June 22nd, 2023 - 129 comments\nCategories: open mike -\nTags:\nOpen mike is your post.\nFor announcements, general discussion, whatever you choose.\nThe usual rules of good behaviour apply (see the Policy).\nStep up to the mike …\n- Comments are now closed\n-\nI wonder if misleading the cabinet office will make Wood liable for prosecution. What are the rules around that? Is it merely parliamentary protocol?\nThe Herald can reveal today Wood had 16 interactions with the Cabinet Office over his Auckland Airport shares, including one in March 2021 in which the Cabinet Office sent Wood a draft review of Ministers’ interests intended for then-Prime Minister Jacinda Ardern confirming the shares had been sold.\nNeither the Cabinet Office nor Wood could confirm whether the minister or his office ever responded to that email confirming the statement or correcting the record to say the shares had not in fact been sold.\nIt appears the Cabinet Office continued to think the shares had been.\nOn June 30, 2021, Wood’s office told the Cabinet Office his sharebroker had been instructed to sell the shares. The Cabinet Office appeared to believe the shares had been sold because days later, on July 5, 2021, the office sent Wood a letter relating to its annual review including a line which read, “Mr Wood has divested himself of shares in Auckland Airport”.\nThe elementary concept of checking whether the shares had or had not been sold seems never to have entered the (air)heads of either Wood or the officials.\n-\nWood really has set a new benchmark in shooting oneself in the foot..\nIn his case…in both feet…\nHard to see anyone topping that..\nAnd no other players in view…all his own handiwork..\n-\nIt's not a specified crime although Parliament can hold people in contempt of Parliament which presumably could include that sort of behaviour if it was egregious enough.\n-\nThanks Craig. Seems clear he did mislead the cabinet office – the evidence says so, but maybe inadvertently as a result of believing his sharebroker followed his instruction. What if Luxon asked in parliament this question: What evidence has Wood provided that he did actually issue that instruction?\nIf the result was none, can Wood be challenged to provide that evidence? If he then failed to do so, would the Speaker declare him in contempt of parliament?\n-\nThe cabinet manual is not legally enforceable although obviously the Governor-General can remove a minister on advice of the PM, but there are not really any other consequences in that area.\nThere are also no Parliamentary consequences although he might get voted out by the electorate or deselected by his party.\nA false or misleading pecuniary interests return is grounds for contempt of Parliament as is misleading Parliament (Jan Tinetti has been appearing in front of the Privileges Committee for misleading Parliament).\nHaving said all that, the maximum penalty for contempt of Parliament is a fine of $1,000. Vacancies can only occur as outlined by s55 of the Electoral Act 1993 and contempt isn't on that list.\n-\nExcellent. We await Luxie taking the initiative on the situation. He gets it – I saw a clip yesterday of him saying something that made me realise the opportunity had actually penetrated the concrete in his head. But follow-through action is required.\nI don't blame Wood for ignoring the pesky officials for all those 931 days, since there's no actual requirement to do what they wanted. However actually deceiving them is a different kettle of fish. The published evidence that he lied to them seems compelling enough to trigger accountability and punishment.\nIf Luxie fails to grab this golden opportunity to enforce it by asking the Speaker to do so, it will be a classic leadership failure on his part – he won't look like a viable PM. Maybe Seymour will grab it instead. Maybe Peters will go \"Huh, what? Somebody do something?\" then head back to sleep…\n-\n-\n-\n-\n-\nSomething to lighten the day .\nhttps://www.newsroom.co.nz/politics/an-ode-for-whiney-luxon.\nAnd on a hopeful note – link from yesterdays review (ht observer ) Mr Luxon's popularity continues to slide.\ntps://www.horizonpoll.co.nz/page/670/new-zealand\n-\nThat is a very useful poll..\nAnd I like that it is non-denominational/agnostic…in that it is commissioned by nobody…there is no paymaster..\n-\n-\nGordon Campbell examines the prospects in the campaign for Ilam: http://werewolf.co.nz/2023/06/gordon-campbell-on-top-and-the-bank-inquiry/\nTOP’s Teal Card is a Gold Card for under 30s. It offers fully funded public transport and healthcare for under 30s,plus a $5,000 mini-UBI boost for everyone.\nManji said to an Ilam electorate meeting last night: “Why would you want to tax wealth production?” Interesting.\nThe merit of a wealth tax seems to me to lie in the principle of taxing accumulated wealth rather than its production – but he's an economist. He could get lucky if National put out the word quietly to their Ilam supporters. If they feel the need.\n-\nWhy would you want to tax wealth production?” Interesting.\nIf he thinks high incomes are a marker of wealth production then he is confusing money with value. Value is created collectively but money is accumulated individually by having market power. Very high incomes (and very low ones) are therefore disproportionate.\n-\n100% AB\n-\nValue is a concept, not a \"thing\" which is created collectively or otherwise. Goods and services are things that are created, and the imputed value of these is reflected in monetary terms, otherwise we wouldn't be able to to tax them – tax has to be paid in cash.\nManji's question is a legitimate one – I don't think he is at all confused; however, I suspect The reason for taxing income is that the state, in order to pay for the services it provides, needs to divert a portion of the country's production to state use. Therefor the state chooses to tax income because income reflects the value of the country's productive activity, and that activity is paid for in cash. The main justification for wealth tax, it would seem, is that it reduces the burden being placed on income tax – a feature which is particularly beneficial for those least able to afford taxes. It also tends to reduce inequality, equality being considered a value in its own right.\n-\n-\nLike dunne..'flexible..to a fault'..pretty much nails it..\n-\n-\nSee how top world leaders do geopolitics:\n\"The reason why Xi Jinping got very upset in terms of when I shot that balloon down with two box cars full of spy equipment in it was he didn't know it was there,\" Biden said.\nA Chinese foreign ministry spokesperson said Biden's remarks were \"extremely absurd\" and \"irresponsible\".\nExpressing China's strong dissatisfaction, foreign ministry spokesperson Mao Ning said Biden's comments seriously violated facts, diplomatic protocol and China's political dignity.\n\"They're an open political provocation,\" she told a news conference.\nBut it's best for political provocations to be open rather than closed, so everyone can see what's happening. Biden pokes bear: bear gets affronted by that threat to its dignity. But notice that she didn't specify those facts that got seriously violated by Biden.\nShe knows the devil's in that detail, and therefore it must not be engaged with. Then there's the alarming fact of Biden personally shooting down Xi's balloon. Not nice.\nReaders may feel that the US president was lying about this. Trump may say so – vulnerable to any attempt by Biden to out-macho him. The media may do its research, and determine that a junior staffer actually pushed the button. Top democrats may nervously watch the proximity of Biden's hand to the nuclear red button.\n-\nMayor Brown is now proposing to sell the Port of Auckland.\nThis is what happens when the Labour/Green/City Vision councillors fail to vote together to overturn Mayor Brown's budget and sell the first major public asset:\nHe goes for more.\nWouldn't it be great if we had a Labour government or even a Labour Minister for Auckland that hadn't fatally compromised themselves on share ownership.\n-\nMike Lee is one of the few to have a proper ideological grasp of this, he dates back to the Bruce Jesson/Alliance era.\nThere were a few brave ones from South Auckland, and some abject failures like Labour’s Shane Henderson. As I said here, “if Brown doesn’t go down” on Airport shares the Councillors will have waved the white flag to a hostile Mayor and they may as well all go surfing or on gardening leave for the remainder of their terms.\n-\nI was surprised and saddened by Shane Henderson's vote – though, I am sure I read that he had consulted widely with his constituents who were largely in favour of selling the shares and he voted accordingly. I used to live in Shane's 'hood before retiring to the Waikato and met him on more than one occasion – he's a good bloke.\n-\n-\nWell if we had supported the Labour candidate for Mayor?\n\"If\" is a small but mighty word AD.\n-\nWe did. It didn't work.\n-\nVery late and without real conviction.\n-\nNot true and stop re-writing history.\nHe was winning until 4 weeks out when the right withdrew all its candidates except one, and corralled all votes against him.\n-\nSo no white-anting went on at all. no sir. Not one bit of it. Labour was a pure as snow…\n-\nJust bullshit. We were on the ground fundraising, delivering, putting up hoardings, going to his meetings. Any time you want to join in with the next one let us know, right?\n-\nNo, not for all the tea in China. Better party to support.\nYou see, my garage is full of signs and signage to go up when election starts. Some of the wood is from the local body elections when all but one of our candidates got in. Got fund raisers next week and had meetings tonight.\nSo if you need people, how about you offer some hope, direction and a way to stop corporate greed. Rather than what your offering.\nSheesh dude I put my money where my mouth is. I 'ant no keyboard warrior – hence why I like you. Even if I disagree with you.\n-\nThe same guy who lost for Labour is now 11 on the Greens list.\nGreen and Labour tend to buddy up in Auckland as City Vision (other than the cranky ones).\n-\nYeap know the deal in Auckland well. Works most of the time, but.\nYou might want to have a chat to some of those on the North Shore and Rodney about how it works though.\n-\n-\n-\n-\n-\nOk … why did the affirmation take the time it did?\n-\nIt's like you've never heard of a primary before.\nWe were on the ground fundraising, delivering, putting up hoardings, going to his meetings. Any time you want to join in with the next one let us know, right?\n-\n-\n-\n-\n-\n-\n-\nThis is a key quote from Prime Minister Hipkins at his media interview yesterday:\n“I still don’t understand how after all of this period of time, over two years with the Cabinet Office asking him to attend to these cases, we’re still in this position now in the last few weeks, even the fact that more information has come to light as the weeks have unfolded, is still something that I do not understand.”\n“There are people who have made mistakes in the past who have gone on to have great political careers and a future. What Michael chooses to do is a question for him.”\nBut then he said that Wood “clearly needed” to tidy up that part of his life that had caused his present predicament.\nHipkins appeared to suggest that this might be a challenge. “I think one of the things that Michael will need to reflect on, particularly as he thinks about what his own future is, is that he will need to have a better explanation than the one he’s produced so far,” he said.\nYou can read an awful lot into what is unsaid there.\nThanks to Richard Harman for being on to this pretty important exchange.\nhttps://www.politik.co.nz/did-wood-lie/ | Politik\n-\nMaybe the dude Gaurav Sharma had a few things correct?\n-\n-\nAre you talking about Sharma or Wood? Your comment would seem to fit both of them.\n-\n-\nHas Sharma done any of those things? Well not to my knowledge and I would be surprised if he had. However I have never claimed that he has.\nOn the other hand when Mr Wood says things like \"In some respects my de-prioritisation of my personal financial affairs has led to this situation.\" he really isn't taking responsibility is he?\nThen he says \"it is incumbent on Ministers to manage not just the reality, but also the perception of any conflicts. I have not managed this effectively, I take responsibility for it, and as such have submitted my resignation to the Prime Minister. I apologise to him and the public for this situation.\" appears to be a claim that he did nothing wrong in fact but he hasn't managed to persuade people of that. That certainly seems to be the only thing he is apologising for.\nMr Wood then says that \"At all times I have provided information about shares in the Trust to the Cabinet Office that I have believed was correct, but in this case my understanding was incorrect.\"\nI certainly get the impression from the PMs statement that this really isn't accurate. After all the PM said\n\"Despite repeated requests from the Cabinet Office and myself for Michael to manage his shareholdings, he has repeatedly failed to identify, disclose and appropriately manage conflicts of interest.\nWhen I stood Michael down as Transport Minister, I asked him if there was any other relevant information I should know about and he indicated there was not.\"\nIt certainly seems to be the case, given that Wood went from a rank of 7 in the caucus a few weeks ago to somewhere in the low 30's today that he has self destructed doesn't it?\nNewshub also seems to agree with the view that Wood doesn't really accept his full quota of blame.\n\"And in his statement following his resignation Wood still hadn’t quite clocked on to the fact that he was solely responsible for the mess he had found himself in, saying “in some respects my de-prioritisation of my personal financial affairs has led to this situation”.\nThere’s no “some” about it, Wood’s inability to sort out his conflicting shares is completely to blame.\nIt’s no longer fathomable that Wood is a victim of his own forgetfulness, not even Hipkins believes that anymore.\"\nhttps://www.newsroom.co.nz/even-in-resigning-wood-doesnt-accept-full-blame\n-\n-\nYour comment in full was\n\"Yup, he self-destructed his political career in a spectacular ball of bull dust and blamed everyone & anyone but himself.\"\nI would say that that is a pretty reasonable description of what is happening to Mr Wood, just as it is one about Dr Sharma. If you had put all the additional comments you are making into your original remark I might have been able to distinguish them but not just from this comment that I asked about.\n-\nAlwyn is absolutely right. You comment could refer to either.\n-\n-\n-\n-\n-\n-\n-\nIf you are member of the right wing elites then you can brazen this sort of thing out because the use of the law for political violence is, in this country, pretty much the preserve of the rich. Everyone knows what the law is is, to some extent, defined by what you can get away with and if you are rich and/or well connected to the right wing elites you can get away with a lot more. John Key got away unharmed from similar shares scandals simply because the corporate media had his back.\nBut the left cannot. It will be held to the highest standards. And Michael Wood should know that. He is among the more left wing in this government and his piushing of fair pay agreements painted a giant target on his back. He was never going to get any slack. There is no point whining about the hypocrisy, it is what it is. To me, his behaviour is inexplicably arrogant and/or stupid, and that combined with his wife voting in favour of the sale of airport shares makes me wonder about how clever the pair of them actually are when it comes to doing politics. As it is, both are now staring at a premature exit from politics.\n-\nHipkins is going to try to change the Cabinet reporting rules for all governments no matter what party … in one of the worst cases of horse bolted I've ever seen here:\n\"In Australia, the Code of Conduct for Ministers requires that they divest themselves of investments and other interests in any public or private company or business.\nThat is, other than public superannuation funds or publicly listed managed funds or trust arrangements where the Minister has no visibility or control of decision-making.\nAdopting this approach would be a significant change in the New Zealand position and requires further consultations, but it is my personal view it’s appropriate to take this step.\"\nhttps://www.scoop.co.nz/stories/PA2306/S00141/statement-on-michael-wood.htm\nSo, Sanctuary, with Wood now pretty likely to withdraw his name as an Epsom Labour candidate after this colossal own-goal, if you're in the Epsom electorate you could always put your name up for Labour 🙂\nAlso pretty hard to see Julie Fairey staying on as Councillor with her family trust essentially tanking her husband's career. So you could always prepare to stand in the Albert-Eden ward 🙂\n-\n\"with Wood now pretty likely to withdraw his name as an Epsom Labour candidate\".\nCan you elucidate on this? At the moment he is the MP for Mt Roskill isn't he?\nSurely he isn't going to march into the valley of death and try and beat Seymour in Epsom?\n-\nThanks for the correction.\n-\n-\nIf you open my closet it's a Halloween party in there, no chance I'll be running for any sort of public office!\n-\n-\nI'm pretty sure Julie Fairey abstained.\n-\nExactly.\nIneffectual when the critical budget vote mattered because she was compromised.\n-\nHow do you know that Ad?\nAnother left wing councilor voted for the sale of the shares.\nTwo other councilors had to correct information on shareholding in the week before the budget.Or just making things up again?\n-\nJulie Fairey, and her husband Michael Wood, are two of the key Trustees and beneficiaries in the Fairey Family Trust.\nShe was a commercial beneficiary of Auckland Airport shares at the time the budget vote occurred. That was why she couldn't vote: direct conflict.\nAlso this is the same reason her husband Michael Wood was fired.\nBoth chose to keep the Auckland Auckland shares for private gain rather protect the public interest in Auckland Airport.\nShe was also abstaining rather than give effect to City Vision manifesto policy that she stood on.\n-\n-\n-\n-\n-\nAll that was said came down to, Jacinda Ardern asked if the shares were sold, and Wood said they were. That was the beginning of his end.imo\nThe ferrets are out there again, so Labour have to be more honest than Key, as the black ops and media ghouls will collect scalps and gleefully display them.\n-\nIt's much, much deeper than that, as noted by the Prime Minister: it is in how both Wood and his wife Fairey have held and operated as beneficiaries of a Trust for a very long time. This point is cited by the PM yesterday in his release on the matter:\nhttps://www.scoop.co.nz/stories/PA2306/S00141/statement-on-michael-wood.htm\nAn investment trust like this would be tracking its holdings and the performance of those holdings every month, and as Trustees they had full visibility of it.\nIt's like he's never heard of a blind trust before.\n-\n-\nNobody, from what I have seen, has reported the value of Wood's Chorus, Spark and NAB holdings held in the trust that he is a beneficiary of.\nThey may be worth $30 in total. Does anybody out there know?\n-\nThe could be 5 cents and he'd still have to declare them.\nWe can have no tolerance for this shit, this is the crap that is destroying faith in democracies all around the world.\nHe's been an MP for 7 years, he's been a minister for 5 and a political nerd his entire life.\nHe misled cabinet and multiple prime ministers AND LIED TO THE PUBLIC last week (as well as the prime minister) when he said dozens of times there was nothing else to see here.\nAs far as I'm concerned, he should just resign from parliament and so should his wife from council (as her abstention made her compromised as Ad stated)\nThis is unacceptable.\nAnd a few months back we all wanted him to be the leader of Labour, thank goodness that didn't happen or we'd be looking at a 1990 style wipe out.\n-\n-\n-\nThanks for that, Ad.\n\"You can read an awful lot into what is unsaid there.\"\nTherein lie two problems. One, people will read into it what they are disposed to. Two, allowing that to happen is fraught politically as misinformation will abound.\n-\nIt would be a good idea to require that cabinet ministers have achieved a pass grade in metacognition 1.01 – it could be taught to them quite simply by reference to this source:\nhttps://en.wikipedia.org/wiki/Metacognition\nReaders with a yen for the deep Green view of life ought to focus on what the wikipedians have listed under the heading Components. Three triads!\nMetacognition is classified into three components:\n- Metacognitive knowledge\n- Metacognitive regulation\n- Metacognitive experiences\nThat's just the first of the three. The other two are\nthree different types of metacognitive awareness when considering metacognitive knowledge\nthree skills that are essential\nEveryone will clamour that it's totally unreasonable to expect Labour cabinet ministers to cerebrate at this level – but anyone is capable of self-improvement.\n-\ncan we just have a few that actually had a real physical job outside university and student assembly?\n-\nWell, Michael Wood had several years as a Union Organiser with FINSEC, and a couple of terms as a Local Government elected member. Both these things should have built a good foundation for work as an MP.\nYou have to be organised and people focused.\nYou have also to be aware that you have political opponents and are being watched.\n-\nAccording to Harry Day, the Royal Flying Corps First World War fighter ace, “rules are for the obeyance of fools, and the guidance of wise men.”\nWood should have heeded such advice and got his affairs in order in line with the Cabinet Manual.\nThere may be some exculpatory thing in the background of which we are not aware, but it's hard to think what.\n-\nUffindell is a forensic accountant, perhaps that's why he's there. To dig for dirt.\n-\nNo kidding?? I wouldn't trust that guy to find his arse if the principle of accountability came up behind him & bit it.\n-\n-\n-\nSabine,he should have worked in a chocolate shop?\n-\nThey have quite a few of those around Parliament. Even ignoring the union officials, there are soldiers, lawyers, accountants, farmers, businesspeople, teachers/principals, police officers, lecturers, public servants, managers, doctors, broadcasters…\n-\n-\nSay this in a Fred Dagg voice and it's hilarious:\n\"…“Yeah, we copped a bit of backlash originally when we put this into the kids’ section, at the time we didn’t realise it was going to go around the world as it did,” said Bailey…\"\n-\nThat is superb sanc.\nI think that the hunters are heroes, but then I catch feral cats on my property in traps, and shoot them while listening to the Bellbirds and Tui's singing.\n-\nAnd then you go and eat some other animal..?\nA chook..?..maybe..?\nRight ho..!..(said in fred dagg voice..)\nI think it is called cognitive dissonance..\n-\n90% of my meals are veggie, except when travelling when it is often trickier..\nBut what's your point?\nI'm saying that there are many more birds around my acre (4000m2) because the cats aren't around.\n-\nMy point is I tire of cats being portrayed as apex predators…by the apex predators…\nCats are doing what comes natural to them…humans kill for fun/pleasure..or to eat their victims..\nMy 'point' also is that you support a kids competition to kill the most cats..supporting mindless cruelty ..\nAnd you seem to celebrate/enjoy that cruelty/killing that you do..\nCats haven't destroyed all the species we have lost..humans have..\nLike I said..I think it is called cognitive dissonance..\n-\nA road is excellent predator control, every night.\nAim for them.\nGreat for the native hawks.\n-\nAnd every one of those cats is there because of a failure on the part of a human. A failure to look after the cat, a failure to get the cat speyed or neutered, and a failure to provide a safe home for the cat.\n-\nI should have mentioned I hate killing the cats…. but they are non-native and they slaughtering millions of native birds (and skinks etc) annually.\nThe alternative that a good friend of mine supports….catching them and neutering them and then either housing them with families or letting them free again just doesnt work.\nIn Oz they are moving towards rules that stipulate that cats are not allowed out of a house unless on a lead.\n-\nWA and NSW are the only states/territories without restrictions.\nhttps://www.wellington.vic.gov.au/community/cat-curfew\n-\n-\n-\n-\n-\nIf they have a bell and collar that says \"Tibbles\" I shoot them.\nBut seriously if they have neither of the above and look like the average NZ feral cat which all seem to have the same colouring (see the front picture on the link below), and are in my trap then they are hunting and killing native birds on my land so I shoot them.\nhttps://www.doc.govt.nz/nature/pests-and-threats/animal-pests/feral-cats/\nI don’t have many neighbours but talking to one a few weeks ago I warned him I shoot cats. He said he had two ginger cats-I said I would look out for those and let them go.\n-\nMy cats are both 18 chipped and collars and tags and bells.\nOtherwise take the fuckers out and while you're at it could you take out the rabbits on Mt Iron please.\n-\nThe moggies of Mt Iron are probably doing more harm to the Mt Iron rabbit population than the Mt Iron human population is capable. Likewise the ferrets, if you've got a decent population.\nAround me they had a huge purge on the ferrets and cats because TB, and the rabbits have gone from way too many, to fucking insane.\n-\nThis reply to both Ad and Graeme above….if you know anyone who lives in the houses on the slopes of Mt Iron ask them to put traps in their garden. (The friends I have who live up there have 2 cats and would never do this.)\nIt is only by a massive network of backyard trapping across NZ that we will make any impact on feral cats, ferrets, stoats, possums, hedgehogs, etc.\nDOC simply do not have the resources.\n-\n-\n-\n-\n-\n-\n-\nMaddening to see Radio New Zealand's headline – Luxon says Chris Hipkins is weak for not managing his team's culture. Given the PM has been in that role only after these Nash/Wood problems were occurring, perhaps RNZ could improve their accuracy.\nPerhaps they could pin Luxon down on his Tesla purchase/subsidy and demand a straight answer. What a hypocrite.\nGiven the ongoing share issues with Michael Wood, the PM has handled it all extremely well and explained his dilemma over the whole saga. He has certainly been hugely more open than Luxon was in downplaying Uffindell's bullying and nastiness.\n-\nBetter taxes for a better future\nNZ unions, social service organisations and advocacy services have just set up a balance to the oxymoronic Taxpayers Union.\n-\nLuxon showed his true colours. He is a bully, and is happy to personalise and blame. imo\nMeantime Chris Hipkins is devising a system to avoid a repeat.\n-\nYou could argue that the difference between Michael Wood and Kuriger and Uffendell is that they are not cabinet members.\nHowever, given Luxon's \"high moral stand\" it must be disheartening for both those members of the Natz party, and a few others too, to realise they will never make it into a Natz cabinet!\nLuxon has too high a moral position to ever consider them! /s\n-\nThe problem Hipkins has isn't that the rules wrong. The rules are just fine. His problem is that his some of his Cabinet Ministers considered themselves above such trivial things as obeying them.\nHe has to come up with a way of herding cats when the cats don't se why they should be obliged to follow the path that has been set. Well good luck mate.\n-\nAlwyn, explain Woodhouse, Uffindell and Kruriger's behaviour while you are busy.\n-\nThis Newsroom piece shows the extent of Kuriger’s nastiness .\nhttps://www.newsroom.co.nz/mps-emails-show-pattern-of-personal-attacks-on-ministry.\n-\nI bet he won't Patricia – I suggested some time ago that Alwyn comes in to spray and walk away. He got a bit tetchy about that comment, but that's how I react to his pretty much trolling.\n-\nFrom the link scotty provided Ms Kuriger would appear to be a most unpleasant person. She would seem, however, to have been removed from he Agriculture spokespersons role when the exchange was brought to Luxon's attention.\n\"She stepped down from the role after someone claiming to be an MPI employee notified National leader Christopher Luxon of the long history of correspondence.\"\nA little later she was apparently dropped from number 10 in the party rankings into the pool of under 20 ranking backbenchers. Luxon would appear to have been lied to by Kuriger and when he discovered it he dropped her way down the list to the point where she will be unlikely to get into Cabinet if she hangs around. That seems pretty similar to what Hipkins has done to date, although he still seems to be rather more accepting of Wood coming back than does Luxon about Kuriger.\nUffindell was the one who behaved like a ratbag when he was about 15 at Boarding School wasn't he? I'd say, given his apparently unblemished behaviour since then he deserves another chance.\nI know nothing about Woodhouse.\n-\nExcept that Uffendell terrorised a female flatmate when he was at university, presumably in his early 20s, to the extent that she climbed out a window and fled to a safe haven!\nWoodlouse is the scumbag that put Claire Curren's photo on a toilet seat, and boasted of doing so (at least showed a picture of himself admiring the said toilet seat)!\n-\nAlwyn… His homeless man in MIQ. Cost thousands looking for that lie. Then the bullying pictures of Clare Curran's photo(L) on a toilet seat lid. Receiving personal details of patients from Michelle Boag. Does that jog your memory?\n-\nI remember a university student, here in New Zealand, who ended up along with a bunch of other students being arrested for having raided a number of girls hostels, tossing the girls out of bed (carefully) and tipping their belongings on the floor. He later became a very, very senior Labour MP\nJust a capping prank of course was the way it was seen at the time.\nI'm not going to say when, where or who though. It was a pretty normal part of Capping celebrations at the time. Why name the person today? They have long got over it. It did happen though when he was young.\n-\n-\nUffindell was the one who behaved like a ratbag when he was about 15 at Boarding School wasn't he?\nWas he, alwyn, was he – or wasn't he? It's a tricky name – unblemished since a wooden performance at Boarding School, apparently.\nI know nothing about Woodhouse.\nWasn't he homeless? I googled 'Woodhouse' + 'homeless' and got a few 'hits' – seems like a good boy; must be tough being homeless during a pandemic. We need more with his sort of personal experience in our house of representatives.\n-\n-\n-\n-\n-\nDr Bryce, on how symmetry induces team herding in our democracy:\nLabour thinks National is corrupt and unethical, and vice versa. The fact that politicians appear to have an unwavering trust in themselves and their own side, means that they think the rules about corruption are actually there for their opponents rather than their own team.\nThere's something about the nature of the game that induces players to believe that the rules only apply to the other team. Imagine if team sports worked like that.\nHe runs the line that Wood was the victim of culture (the legendary kiwi complacency).\nHe simply didn’t take integrity rules meant to protect the New Zealand political system from corruption seriously. That’s rightly led to his downfall.\nI prefer the covert rebel theory. Rebels ignore rules. Wood would probably argue that the 931 days he maintained his rebellion displays the virtue of consistency. Fair point.\n-\nBryce Edwards favours National Fullstop.!! Get better sources Dennis.\n-\nI've never seen any evidence that he does, Patricia. Academics are generally known to be notoriously leftist in outlook. I'm aware that some commentators here routinely claim he's biased but that doesn't make it so. I suspect that his reluctance to toe the leftist academic line & be scrupulously non-partisan instead is what offends them.\n-\nBryce comes up with a hypothesis, then looks for all sources to support that. Original thinking is rather light on the ground. His summaries…. enough said.\n-\nYou haven't been reading Bryce Edwards closely enough if you haven't noticed he supports National (or at least The Right), Frank. Don't be fooled by the \"Democracy Project\" label.\nI have little respect for the man. For instance when quizzed on an RNZ programme over the recent electoral reform proposals he said the proposed 3.5% was too high and that it should be 1% to get a party into government. Hasn't he seen the coalition chaos in Israel because they have a low limit (actually 1.5% not 1%) for parties to get into parliament which means that many parties get in.\n-\nhe said the proposed 3.5% was too high and that it should be 1% to get a party into government\nFirstly, I suspect you may have meant parliament rather than government. Parties only get into government here if a leader can assure the GG that he has the numbers to rule. Usually that means he has secured a formal agreement with any minor parties he needs – like a contract.\nSecondly, any genuine Green believes in the principle of biodiversity, which produces the complexity of interactions in an ecosystem stabilising species survival. Going for a 1% threshold optimises the biodiversity of parliament as a social ecosystem. That's to his credit.\nThirdly, I agree the situation in Israel is sufficient cause to be cautious around this for the reason you mention (chaotic tendency). However I suspect Israel could be a special case & comparative analysis ought to therefore incorporate all countries using western-style democracies, to examine how each has operated so as to enable diverse representation.\n-\nSorry Dennis, yes I did mean parliament not government.\nI don't accept your argument re Israel as a special case. I think in NZ we could easily have 10 or more parties (some of them anti-vax nutters etc) vying to be part of \"coalitions of chaos\" if the threshold was 1%. I'd be happy to see it reduced from 5% to 4% or even 3.5% though.\n-\nI think I declared my preference for 3% onsite here years ago. To clarify re Israel, I vaguely recall checking out their parliamentary configuration a while back & noticing considerable biodiversity. I think that was relative to major parties not being as influential as here.\nSort of like a spectrum effect. If major parties subside below 30% they lose relativity leverage & coalition-forming becomes a multiplicity scenario rather than a partnership binary.\nPolitical stability then hinges on how robust the contractual design is in each case – whether events precipitate rats jumping the ship. If a minor party can be the tail wagging the dog (as with NZF) it will do that and hold the govt to ransom. A creative challenge to the lawyers designing the contracts. Ought to be possible to prevent minor party finagling though – humans have always done contingency planning.\n-\n-\n-\n-\nI suspect that his reluctance to toe the leftist academic line & be scrupulously non-partisan instead is what offends them.\nI'm not offended. Only amazed. Why would anyone take Bryce seriously? He has a track record of being hilariously wrong.\n2020 election? National have every chance, Todd Muller is the man! You might think that is bad satire, but it's not. It's Bryce Edwards … totally out of touch, detached from reality. That's why his commentary is dismissed.\n-\nYeah I've seen him get analyses wrong in the past & vaguely recall that was one such example. Doesn't mean right-wing bias to me though. Ivory tower syndrome has been well-known an awful long time. The disconnect from the real world is often hilarious. Perhaps he tries to compensate for this handicap by canvassing the opinion of folks he knows, such as family relations. That would explain the situation – via a randomised warping effect…\n-\n-\n-\n-\nWood was unable to rebel due to fatal over-application of hair gel.\nAnd plain old greed.\n-\nI read it as more a case of hubris..\nAnd yes….any man..over a certain age..who persists with pomades…\nShould be viewed with deep suspicion..\n-\n-\n-\na really good article by a senior clinical psychologist outlining why despite spending over a billion dollars on mental health, this govt has failed to improve outcomes.\n-\nThis is a smart move by the Greens. Get out in front of the tax issue. Often in the past both Labour and the Greens have been too passive, releasing their tax plans and then letting the opposition/media control the narrative (usually reduced to \"Tax? Boo!\").\nThe Greens' tax calculator is an effective rebuttal …\n-\n-\nIts great…I get $18 a week more and am not affected by the WT….well only 0.7% are.\n-\nFuck me , it rekons I'll be over $300 a week better off,!!!! !!!!!!!!\n-\nThe issue of course is that any government that institutes this will find that tax revenue will dry up overnight – the exodus of international businesses, successful local businesses, individuals with wealth etc. will be swift and devastating. Our economy will shrink drastically.\nJob losses will be massive, Government revenue from PAYE and company profits will plummet. There will be sweet FA in the coffers.\nHave the Greens factored that pesky little issue into their clever calculator?\n-\nSuch wailing and gnashing of teeth!\nIn The Myth of Millionaire Tax Flight, Young examines a trove of data on millionaires and billionaires—confidential tax returns, Forbes lists, and census records—and distills down surprising insights. While economic elites have the resources and capacity to flee high-tax places, their actual migration is surprisingly limited. For the rich, ongoing economic potential is tied to the place where they become successful—often where they are powerful insiders—and that success ultimately diminishes both the incentive and desire to migrate.\nThis important book debunks a powerful idea that has driven fiscal policy for years, and in doing so it clears the way for a new era. Millionaire taxes, Young argues, could give states the funds to pay for infrastructure, education, and other social programs to attract a group of people who are much more mobile—the younger generation.\nhttps://www.sup.org/books/title/?id=27987\n-\n-\nJust what is going to prevent the holder of the business, and I am assuming that it is a large one, from shifting to Australia?\n-\n-\nI said, although it may not be that clear that the holder of the business moved, not the whole business. This would just make it a foreign owned company. The comment about it being a large one is that you could have it run without the owner in NZ. It wouldn't work for a panel beating and painting firm for example.\n-\n-\nshifting to Australia\nSo let's introduce Australia's top income tax rate (45%) and property taxes to NZ.\nIf that's what business wants, give it to them. Everybody happy.\n-\n-\n-\n-\n-\n-\n-\n-\nI am used to seeing doom and gloom about achievement levels in our schools so an article in the Washington Post caught the eye. The final sentence is similar to what I see here.\n\"National test scores plunge, with still no sign of pandemic recovery\nNational test scores plummeted for 13-year-olds, according to new data that shows the single largest drop in math in 50 years and no signs of academic recovery following the disruptions of the pandemic.\nStudent scores plunged nine points in math and four points in reading on the National Assessment of Educational Progress (NAEP), often regarded as the nation’s report card. The release Wednesday reflected testing in fall 2022, comparing it to the same period in 2019, before the pandemic began.\n… The average math score is now the same as it was in 1990, while the average reading score is the same as it was in 2004.\nHardest hit were the lowest-performing students.\"\nhttps://www.washingtonpost.com/education/2023/06/21/national-student-test-scores-drop-naep/\n-\nI wonder whether the geophysics Institute relied a lot on adjunct lecturers from GNS. For example, Auckland University's Plant and Food postgraduate studies are mostly staffed with adjunct lecturers from the Plant&Food CRI in Mt Albert. The research expertise comes mainly from the CRI, not the university.\nTherefore disassembling geophysics courses at Vic would not involve significant staff redundancies for the university, but might put some staff positions at GNS on shaky ground.\nIn terms of NZ earthquake expertise, the greater critical mass will be at GNS.-\nSorry, misplaced comment, meant for HTII at the bottom.\n-\n-\n-\nRemember when everyone thought Wood could replace Ardern a few months back? Gosh we dodged a bullet with that not happening.\nWhat is going on with the Labour party caucus? Arrogance. It's arrogance.\nI blame Ardern for a lot of this, she allowed a culture of arrogant ministers playing fast and loose to take hold because she was very hands off, she didn't micromanage she trusted too much.\nshe ruled by consensus kindness and empathy and faith in her team, which sounds good, but doesn't work, she'd still be hear if that leadership style was effective in governing.\nyou need to be bit of a bastard, and put the fear of god into these careerists that you will throw any and all of them under a bus at the drop of a hat, like one Helen Clark, Labours only three term PM.\nPoor Hipkins. I actually feel sorry for him. He's probably wondering which of these bastards is lying to me and is going to be busted next. Luckily he's more of a Clark than an Ardern.\nEvery Labour and Green Mp and minister is on notice, get your houses and lives in order, yesterday!\nthe nats and act are spending their unprecedented election warchests on armies of sleuths going over labour/green mp's and activists lives with a fine tooth comb, and any conflicts or indiscretions will be found.\n-\nYep, the wheelie bin riflers and underwear sniffers are in full Dirty Politics mode at the moment!\nThe Natzos do seem to be way better at hiding the dosh–and being proud of it.\nFor 40 years the middle class and other aspirationals have been encouraged to buy into the dog eat dog monetarist scene–Shares! Venture Capital! Property! so it is understandable why some went there–but still not excusable for any political rep seeking credibility with working class people.\nMichael Wood–FPAs, huge pay rises and new contracting regime for bus drivers, rejuvenation of NZ run Coastal Shipping…his legacy will live on…what a shame.\n-\n\"Yep, the wheelie bin riflers and underwear sniffers are in full Dirty Politics mode at the moment!\"\nI take it you mean the people who staked out Luxon's home, watched for his wife to go out in her car, made a note of the number plate and then checked whether there had been any attempt to claim the rebate? They certainly sound like the people you are talking about.\n-\nI was under the impression that 'reporters' from Newshub did the background work on Luxon's wife's (or otherwise) Teslar.\nHardly a leftie news source.\n-\n-\n-\nArdern has no blame at all for Wood.\nWood and wife+Councillor Fairey have operated and been beneficiary of that trust for many years and this is all on them.\n-\nYes, it was her Trust from her family before they married. Put her through University.\n-\n-\n-\nValues in politics, 2023:\nIncompetence (Michael Wood) means you resign.\nCorruption (National) is just fine.\nSimple test … imagine the headlines if Michael Wood had accepted this donation and said \"nothing to see here\".\n-\nGeophysics is one of the subjects to go under the knife at Victoria Uni of Wellington (Latin, Italian and secondary teaching are others).\nI get their thinking; all the necessary research must be complete now after the Christchurch earthquakes, so no need for geophysics any more. Or rely on some overseas institution?\n- Comments are now closed",
  "word_count": 7669,
  "scraped_at": "2026-02-14T13:46:25.591026"
}