{
  "article_id": "45c9f5e611c8",
  "url": "https://thenationonlineng.net/bayelsa-starlets-dedicate-victory-to-gov-diri/",
  "title": "Bayelsa Starlets dedicate victory to Gov . Diri | The Nation Newspaper",
  "date": "20231005T000000Z",
  "domain": "thenationonlineng.net",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sports\nOctober 5, 2023 by Our Reporter\nBayelsa Starlets dedicate victory to Gov. Diri\nBayelsa Starlets have dedicated the 1-0 victory over Utility FC of Lagos in the opening match of SPOCS Scouting Tourney at Remo Township stadium, Ikenne, Ogun state to Governor Douye Diri.\nThe tension-soaked match which was watched by a capacity crowd saw the Starlets seizing control from the blast of the whistle.\nThe Starlets, operating from both wings, forced the Utility boys to play the better part of the match in their half but launched sporadic counter attacks.\nThe Ikenne fans were forced to shift their allegiance to the Starlets following their display of soccer artistry.\nThe Utility boys could not hold the goal hungry Prosperity boys as Benjamin Precious scored the curtain raiser and the only goal of the match for the Creek Boys.\nThe Utility FC had their goal keeper to thank as the match could have ended with a harvest of goals in favour of the Prosperity Boys as he made a couple of superlative saves to keep the scoreline close.\nRead Also: Bayelsa poll: Ijaw leaders drum support for Gov Diri\nIn another match played, Dream FA Bayelsa came from behind to record a 3-3 draw against Sportyn FC of Lagos.\nIn a post match interview, the Director General of the Club, Ono Akpe thanked Governor Douye Diri, his Deputy, Senator Lawrence Ewheujakpo and the state Commissioner for Sports, Daniel Igali as well the coaches for their unflinching support for the team.\nHe said the support the teams are getting is unprecedented in the sporting history of Bayelsa. He said that both teams were products of the last Governor’s Cup which ended in July 2023.\nAkpe who assured the Bayelsa government of successful outings in the various tournaments as no fewer than eight players from both teams have caught the attention of the international scouts and agents\n“The boys would do Bayelsa proud I have no doubt about in my mind and that has manifested today on the field of play. The boys are all dedicated, committed, excited and grateful for these opportunities the Governor has provided right from the Prosperity Cup till date,” Akpe added.\nSPOCS is one of the topmost sports management agencies in the world. The agencies have, in its record, the likes of Liverpool star player Mohammed Salah, AbdulRaman Baba of Chelsea, and Mohammed Elneny of Arsenal.\nNWFL holds AGM in Lagos\nThe Nigeria Women Football League (NWFL) will be hosting its Annual General Assembly (AGA) today, October 5th .\nThis significant event will take place at the BON Hotel, Ikeja Residence, 51 Sobo Arobiodu Street, GRA, Ikeja, Lagos.\nGoing into the Annual General Assembly, NWFL’s core strategy is firmly rooted in robust stakeholder engagement. The focus is on expanding the women’s football ecosystem, a holistic approach that encompasses state football associations, clubs, players, ex-players, NWFL ambassadors, coaches, fans, agents, corporate Nigeria, commercial partners, policymakers, and more.\nThis year’s AGA revolves around the theme of “Women’s Football Rising©.” Coincidentally, it also marks the unveiling of a new platform, Women’s Football Rising©, which embodies NWFL’s vision, grassroots women’s football commitment, and future aspirations.\nWomen’s Football Rising© serves as a monumental platform championing the multifaceted essence of women’s football. It’s a rallying point for empowerment, unity, and transformation of women’s football in Nigeria.\nUnder this platform, NWFL will launch exciting initiatives including the He4She© Campaign, Sisterhood© Campaign, and Football and The Girl Child© Initiative. These efforts will be powered by extensive stakeholder engagement, which lies at the heart of NWFL’s mission. The engagements will be primarily events-driven, and intended to expand the women’s football ecosystem.\nAs stated by Ms. Nkechi Obi, Chairman of NWFL, “Empowering strong clubs is the cornerstone of NWFL’s mission, as they are the driving force behind women’s football development, fostering talent, promoting inclusivity, and shaping the future of the game.”\nMs. Obi emphasized, “Investing in women’s football isn’t just a commitment; it’s a catalyst for transforming the entire landscape of the sport, driving inclusivity, equality, and unlocking the true potential of women football in Nigeria.”\nMs. Modupe Shabi, the COO of the league, noted that “NWFL stands as the cornerstone of opportunity for talented female players in Nigeria, offering a dedicated platform for them to flourish and chase their footballing dreams with passion and purpose.”\nNWFL is strategically leveraging FIFA’s women’s football development workplan to increase female participation in football, enhance clubs’ commercial value, optimize existing competitions, and build a culture of good footballer conduct and club governance.\nThe league’s ultimate goal is to deliver a strong women’s football league that is competitive and well governed, ensuring that women’s football in Nigeria continues to rise to new heights.",
  "word_count": 782,
  "scraped_at": "2026-02-14T12:57:09.833852"
}