{
  "article_id": "45cebd462507",
  "url": "https://www.theirishworld.com/katie-mccabe-has-ten-year-old-ireland-fan-to-thank-for-irish-flag-for-celebrations/",
  "title": "Katie McCabe has ten - year - old fan to thank for Irish flag",
  "date": "20230309T170000Z",
  "domain": "theirishworld.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By Damian Dolan\nRepublic of Ireland Women’s team captain Katie McCabe helped Arsenal end their four-year wait for silverware, as the Gunners beat Chelsea 3-1 in the Continental League Cup final on Sunday in front of more than 19,000 at Selhurst Park.\nAnd thanks to one young Gunners and Ireland fan from Kingsbury in north-west London, ten-year-old Ellie Murphy, the Arsenal and ROI star had an Irish tricolour flag for the celebrations.\nBut not just any tricolour, mind you, one sporting the words ‘We’ve Got McCabe – Ellie age 10’.\nA member of the Republic of Ireland Soccer Supporters Club (London branch) and a huge Arsenal supporter, Ellie takes the flag with her whenever she watches the Gunners in action.\nLast week, the Ireland skipper gave Ellie her Arsenal shirt following their 2-0 FA Cup defeat to Chelsea at Kingsmeadow.\nOn Sunday, Ellie was able to return the gesture and give McCabe her Ireland flag for the post-game revelries on the Selhurst Park pitch.\n“Ellie brings that flag to every game and Katie always acknowledges her,” said Ellie’s Mum, Niamh Murphy, who comes from Portlaoise, Co Laois, and is on the Arsenal Women’s Supporters Committee.\nEllie plays football for Brent and Watford Ladies’ Under 12s.\nFor McCabe, silverware last Sunday will add to the FA Cup, Continental League Cup and Barclays Super League trophies she’s already won with Arsenal since joining the club from Shelbourne in December 2015.\nMcCabe won the penalty for the Gunners’ second goal and played 57 minutes before being subbed, with Arsenal already 3-1 up.\nChelsea went into last Sunday’s final unbeaten in their past five meetings with Arsenal, and they took the lead as early as the second minute through their prolific Australia international striker Sam Kerr.\nKerr will line up against Ireland and McCabe in Sydney on 20 July when they open this summer’s Women’s World Cup.\nBut Arsenal battled back to lead by 3-1 at half-time, and could have added more in the second half as they ran out deserved winners.",
  "word_count": 338,
  "scraped_at": "2026-02-14T12:38:49.526272"
}