{
  "article_id": "45cf85e034a1",
  "url": "http://africa.chinadaily.com.cn/a/202512/19/WS6944ad2ca310d6866eb2f760.html",
  "title": "World Cup winner to get $50m from richer prize pool",
  "date": "20251220T024500Z",
  "domain": "africa.chinadaily.com.cn",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "World Cup winner to get $50m from richer prize pool\nBut less than half of Chelsea's payday at much less-hyped Club World Cup\nThe winner of the 2026 World Cup will receive $50 million from a $655 million prize pool, FIFA said on Wednesday in announcing record financial rewards for teams in a tournament with ticket prices that have sparked outcries.\nThe champion's figure is up from $42 million won by Argentina in 2022 and $38 million gained by France in 2018 but less than half of what Chelsea earned for winning the much less-hyped Club World Cup this year.\nThe total prize fund for the World Cup, staged in the United States, Canada and Mexico from June 11 to July 19, is up 48.9 percent from the $440 million for the 2022 tournament in Qatar.\nThe 2026 total will be nearly six times the $110 million in prize money for the 2023 Women's World Cup in Australia and New Zealand. FIFA president Gianni Infantino in 2023 set a target of equal prize money for men and women at their next World Cups — the next women's tournament is scheduled for 2027 in Brazil.\nThe Club World Cup, controversially expanded from seven teams to 32 and shoehorned into the soccer calendar last summer, had a total prize fund of $1 billion. Chelsea won the top prize of up to $125 million for a tournament that faced fierce resistance from players and leagues and drew sparse crowds for some matches.\nFIFA has a different distribution model for the national team and club tournaments, with the disparity in prize money reflecting factors such as clubs with higher wage costs than national teams.\nBeyond prize money, further funds are put toward development of soccer globally.\nInfantino said the World Cup will be \"groundbreaking in terms of its financial contribution to the global football community.\"\nIn Europe, the Champions League also has a much bigger top prize than the European Championship for national teams. The maximum winnings for last year's Euros were 28.5 million euros ($33.5 million). Real Madrid picked up around $154 million for winning the Champions League in the same year. Both competitions are run by European soccer's governing body UEFA.\nFIFA approved the prize money for the World Cup at a meeting of its council in Doha. In March it projected revenue for its current four-year cycle through 2026 at $13 billion, up from $7.5 billion for 2019-22.\nEach of the 48 national federations at the expanded 2026 World Cup will receive $1.5 million for preparation costs and $9 million for participating in the group stage, the same as for the 2022 tournament.\nTeams advancing to the new round of 32 get $11 million and those reaching the round of 16 receive $15 million. Nations reaching the quarterfinals are paid $19 million, the fourth-place team $27 million, the third-place team $29 million and the final loser $33 million.\nIncluding participation fees, FIFA will distribute $727 million to the 48 federations.\nEach federation decides what to pay its players. The French sports daily L'Equipe reported France players were in line for a bonus of $586,000 by their federation if they won the trophy in 2022. France was ultimately beaten by Argentina in the final.\nThe US Soccer Federation's 2022 collective bargaining agreements with the unions for its men's and women's national teams call for prize money for men in 2026 and women in 2027 to be pooled together, and 80 percent of the money to be distributed among the players.\nFIFA slashes price\nFIFA slashed the price of some World Cup tickets for teams' most loyal fans following a global backlash and some will get $60 seats for the final instead of being asked to pay $4,185.\nIt was a rare climbdown by the soccer body and its president Infantino after soaking up waves of criticism for World Cup strategies, including top-dollar prices and closer political alignment with US President Donald Trump.\nFIFA said Tuesday that $60 tickets will be made available for every game at the tournament in North America, going to the national federations whose teams are playing. Those federations decide how to distribute them to loyal fans who have attended previous games at home and on the road.\nThe number of $60 tickets for each game is likely to be from 400 to 750 per team, in what FIFA is now calling a \"Supporter Entry Tier\" price category. FIFA is using 16 host cities, including 11 NFL stadiums in the United States, plus two in Canada and three in Mexico.\nFIFA did not specify exactly why it so dramatically changed strategy, but said the lower prices are \"designed to further support traveling fans following their national teams across the tournament.\"\nHowever, the Football Supporters Europe group, which represents grassroots fan groups, said the limited price cut was \"an appeasement tactic due to the global negative backlash.\"\n\"This shows that FIFA's ticketing policy is not set in stone, was decided in a rush, and without proper consultation,\" the group said in a statement.\nThe World Cup in North America will be the first edition that features 48 teams — up from 32 — and is expected to earn FIFA at least $10 billion in revenue while being the most expensive ever for fans.\nDespite the outcry over prices, FIFA says it has already received more than 20 million ticket requests in its latest sales phase.\nAgencies\nMost Popular\n- Guangdong beats Macao 2-0 in first leg of soccer cup\n- Para teams set to leave mark on ice\n- US skier Johnson wins women's downhill as Vonn crashes at Milan-Cortina Games\n- Su Yiming clinches first medal at Milano-Cortina\n- Over 300 athletes from 35 countries and regions kick off Asian championships in Tianjin\n- Legacy of Beijing 2022 lives on as Milan welcomes Games",
  "word_count": 975,
  "scraped_at": "2026-02-14T12:37:30.449422"
}