{
  "article_id": "4635e29185b7",
  "url": "https://www.justarsenal.com/it-means-everything-to-win-and-celebrate-with-the-fans-says-russo-after-arsenal-womens-conti-cup-win/363521",
  "title": "  It means everything to win and celebrate with the fans  says Russo after Arsenal Women Conti Cup win",
  "date": "20240401T141500Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Arsenal Women, as many Gooners had hoped, defeated Chelsea in the Women’s Continental Cup final, on Sunday afternoon. Stina Blackstenius emerged as the hero, scoring a thrilling 116th-minute winner, to seal the Gunner’s victory. With this victory, our Arsenal Women have successfully retained the Continental League Cup.\nThe match was not without drama. Chelsea thought they had grabbed the lead in the 22nd minute with Mayra Ramirez, but VAR intervened, disallowing the goal due to a handball from Erin Cuthbert in the build-up. Frida Maanum, the Arsenal playmaker, collapsed towards the end of regular time, adding to the strain in an already tight match.\nDespite disappointing results this season, with the Champions League and FA Cup prematurely dashed, and lest we forget the WSL chances extinguished, Arsenal demonstrated tenacity in this critical match. Manager Jonas Eidevall, who was under fire for the team’s lack of consistency, ought to find solace in this massive win.\nArsenal not only won the League Cup but also displayed their capacity to perform under duress. The triumph served as a reminder of their potential, despite a lacklustre league campaign.\nAfter the game, Alessia Russo expressed her joy at winning the league cup, notably her first title in club football.\nA very excited Russo told the BBC, post match, that the Gunners had the opportunity to win a trophy, and that is exactly what they did, to continue Arsenal’s tradition of winning trophies.\n“It means everything to win and celebrate with the fans. This season has been pretty high and pretty low, but we had the chance to win some sort of trophy this year, and that’s what we did today. We know that winning trophies is part of this club’s DNA,” said Russo.\nThat said, this league cup win validates Eidevall and his team’s hard work and perseverance throughout the season. And, even if it’s the only silverware our Gunners win this season, it’s the Conti Cup and it’s going in Arsenal’s trophy cabinet again!\nGreat display from The Arsenal. What did you think of the game?\nCOYGW!\nDanni P\nFollow JustArsenal’s Gooner Women on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 376,
  "scraped_at": "2026-02-14T12:22:39.146458"
}