{
  "article_id": "46440933e4b2",
  "url": "https://www.espn.in/espn/story/_/id/46076992/heated-debate-rages-nigeria-treatment-former-super-eagles-players",
  "title": "Heated debate rages in Nigeria over treatment of former Super Eagles players",
  "date": "20250827T080000Z",
  "domain": "espn.in",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Former Auxerre and Inter Milan defender Taribo West has ignited fierce debate in Nigeria over how the country treats its sporting legends, following the burials of Super Eagles greats Peter Rufai and Christian Chukwu this month.\nAt the burial of Rufai in Lagos, Olympic gold medallist West accused the Nigeria Football Federation (NFF) and Lagos State of neglecting the former goalkeeper after his career ended.\nRufai, Nigeria's iconic goalkeeper at the 1994 and 1998 World Cups, was laid to rest in Lagos last weekend, while Chukwu, captain of the 1980 Africa Cup of Nations-winning team, was buried in Enugu.\nSpeaking at Rufai's funeral, an emotional West slammed authorities, claiming the family had to source for money to fund the burial from friends.\n\"For me it is disheartening that you have Lagos State, you have the Nigeria Football Federation and they dropped the buck on the family,\" said the former defender, now pastor.\n\"My mother passed on, I never shed tears. My father died in my hands, I never shed tears. But when Rufai passed, I had goose pimples and tears rolled down my cheeks. What kind of nation is this?\n\"With this kind of example they have shown in (Yisa) Shofoluwe, in Stephen Keshi, in Thompson Oliha, Rahsidi Yekini, I will never allow my son to put his feet for this country.\n\"Do we have a football federation? Or do we have a football association in this Lagos State? That this hero, this soldier, this football evangelist has to be treated this way and his family would be crying to solicit within our groups to ask for money?\"\nWest's comments drew support from Augustine Eguavoen, who also played with Rufai in Nigeria's famed Class of 94 Eagles and compared sports stars to soldiers. \"I don't think we have done enough,\" Eguavoen said at the funeral.\n\"I don't care what anybody is going to say about this. The difference between sportsmen and women and military people is the gun. We lay our lives down.\n\"This mark on my face was a stud from Ariel Ortega during the Confederation Cup. I could have been blinded. Aloy Agu lost his teeth. It was the same attitude when the late Keshi was buried. Let's not even talk about Uche Okafor, Oliha, Wilfred, Sofoluwe and all that. A lot of people have gone who have put their lives on the line to represent Nigeria.\n\"I think Peter Rufai is too big a name that the government, the people in charge won't just come and take over this burial.\"\nWest's outburst drew criticism. Former midfielder Etim Esin responded on his Instagram page: \"I know how you felt, but it was uncalled for. Where is our players union? Are you the president of our players union? Let the sleeping souls lie.\n\"If you want change, fight for it. Run for NFF president like George Weah became Liberia's president. Stop lamenting.\"\nFormer U-17 coach Fanny Amun, who also briefly coached the Super Eagles, echoed that view, insisting players were well rewarded during their careers.\n\"It was trade by barter,\" he said to Brila FM. \"They were performing, the federation and the government were taking care of them. So we don't need to be apportioning blame. Let us stop these issues that does not make any sense.\n\"They flew business class, got paid allowances, and were treated well. Playing for Nigeria was a privilege.\"\nEguavoen's comparison of athletes to soldiers drew a sharp rebuke from Olympic gold medallist Enefiok Udobong.\n\"It is insulting for Austin Eguavoen to compare playing in the Super Eagles or any sportsman with a soldier,\" the quartermiler posted on his Facebook page. \"One lives a life of luxury and privilege and the other lays down his life and privileges so that all can enjoy a life of privilege.\n\"The nation owes no sportsman any favour. On the contrary, we owe the country for the opportunity and platform they have given us to flourish our talents and to live a life envious to the majority.\n\"All we deserve from the country and its leaders is RESPECT and RECOGNITION for our hard work.\"\nFormer Nigeria international Waidi Akanni, who liaised with the Lagos State government to provide support for the family, told reporters that about N15 million naira (approx. 10,000 USD) was donated to the family to support the burial. However, Rufai's brother Bruce said the family received only ₦3 million from the NFF.\nThe NFF issued a statement saying it \"stood in solidarity\" with both families, providing financial support and sending representatives to each burial.\n\"The Nigeria Football Federation stood in solidarity with two of our legends as they were laid to rest,\" the statement read.\n\"In support of the burial rites of Christian Chukwu, the NFF provided financial assistance to his family, and was represented by Executive Committee Member Chief George Aluo, Barr Okey Obi and Mr Chikelue Iloenyosi.\n\"Similarly, at the funeral mass of Peter Rufai in Lagos, the NFF also offered financial support to his family. The delegation included Executive Committee member Alhaji Ganiyu Majekodunmi and Dr Ademola Olajire.\n\"We honour their service, celebrate their legacy, and extend our continued support to their families.\"",
  "word_count": 861,
  "scraped_at": "2026-02-14T13:22:53.517515"
}