{
  "article_id": "4650580ee409",
  "url": "https://www.devdiscourse.com/article/technology/2355178-fifa-reserves-at-usd-4bn-after-world-cup-more-to-come-in-2026",
  "title": "FIFA reserves at USD 4BN after World Cup ; more to come in 2026",
  "date": "20230215T064500Z",
  "domain": "devdiscourse.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FIFA reserves at USD 4BN after World Cup; more to come in 2026\nOperational costs of 638 million are foreseen for the 2026 hospitality program.The 2026 World Cup s expected to far exceed the tournament record attendance of nearly 3.6 million set at the United States-hosted 1994 edition, which included 52 games in a 24-team format.With 48 teams in North America in 2026, FIFA previously agreed an 80-game schedule but Infantino said in Qatar that decision will be reviewed.\n- Country:\n- Switzerland\nFIFA had reserves of almost USD 4 billion after a financially successful 2022 World Cup in Qatar, and booming hospitality and ticket sales at the 2026 tournament in North America are expected to add billions to the income of soccer's international governing body.\nFIFA detailed ''exceptionally robust'' finances in its 2022 annual report late Tuesday that saw the annual bonus of President Gianni Infantino rise by 620,000 Swiss francs (USD 673,000). His pre-tax base salary and bonus package totalled 3.6 million Swiss francs (USD 3.9 million) plus more FIFA-paid expenses and benefits.\nAt the World Cup in November, FIFA announced record revenue of almost USD 7.6 billion for the four-year commercial cycle through 2022 that is mostly earned by the men's World Cup.\nFIFA said its reserves stood at USD 3.97 billion at year's end compared with USD 1.6 billion through 2021.\n''FIFA's financial position remains exceptionally robust and sustainable with a substantial cash base and sufficient reserves,'' soccer's world body said in the report.\nThe USD 11 billion income conservatively forecast in December for the next four years is fuelled by using mostly NFL stadiums for an expanded 48-team World Cup in 2026 that will be co-hosted by the United States, Canada and Mexico. Using home stadiums of the Dallas Cowboys, Los Angeles Rams and the Super Bowl champion Kansas City Chiefs plus other NFL venues has driven FIFA's expected revenue of USD 3.1 billion in hospitality and ticket sales across the next four years.\nFIFA said it got a combined $929 million in Qatar from ticket sales for the 64 games and a hospitality program that was sold in 2011 — for a rights fee and profit share adding up to $243 million — to long-time World Cup partner MATCH.\n''Hospitality sales (will be) largely driven by the strategic model in operation, which has moved away from the rights fee model, under which FIFA's hospitality services were outsourced,'' FIFA said in the annual report. Operational costs of $638 million are foreseen for the 2026 hospitality program.\nThe 2026 World Cup s expected to far exceed the tournament record attendance of nearly 3.6 million set at the United States-hosted 1994 edition, which included 52 games in a 24-team format.\nWith 48 teams in North America in 2026, FIFA previously agreed an 80-game schedule but Infantino said in Qatar that decision will be reviewed. A format of 104 games is possible. FIFA also forecast big increases in broadcast rights and sponsorships sales through 2026.\nPointing to ''North American time zones offering favourable coverage across the globe … plus an expanded match schedule,'' FIFA forecast total broadcast revenue of USD 4.26 billion through 2026, rising by nearly USD 1 billion from the 2019-22 period. That new total is equal to one year of TV and sponsor money for Europe's Champions League.\nMarketing revenue is set to rise from USD 1.8 billion to almost USD 2.7 billion, though only a few deals such as Coca-Cola and Adidas currently extend beyond the Qatar tournament.\nFIFA said its USD 11 billion total revenue estimate did not include the Club World Cup that is set to re-launch in 2025 with a 32-team tournament. Infantino previously valued that event at USD 3 billion per edition.\nSpending is also set to rise sharply through 2026, with FIFA again conservatively budgeting for a USD 100 million profit over four years.\nFIFA's projected costs are USD 3.84 billion for the 2026 World Cup and USD 435 million on the Women's World Cup that starts in July in Australia and New Zealand.\nSpending on the 2026 men's event includes a total of USD 896 million on prize money for the 48 teams plus payments to clubs for releasing their players to national-team duty. Clubs worldwide received a total of USD 209 million from the 2022 World Cup, calculated at a daily rate per player.\nFIFA also will pay USD 2.25 billion in development funds across its 211 member federations — which get at least USD 2 million per year — the six continental confederations and regional soccer bodies.\nA further USD 660 million is available in a Football Development Fund to nurture the game ''in all its forms and at all levels,'' the report said.\nCommitting to spend tens of millions on communications such as websites and phone apps, FIFA said it had ''lived up to its role as the main source of information for football lovers everywhere.'' Spending of USD 367 million on governance and administration personnel is expected over the next four years. Some staff, in areas such as marketing and legal departments, are expected to work in North America rather than FIFA's home city Zurich.\nFIFA said its CEO-like secretary general Fatma Samoura got a salary and bonus package of 1.9 million Swiss francs (USD 2.06 million) last year, including a bonus that doubled to 600,000 Swiss francs (USD 650,000).\nWith so much cash at hand, FIFA makes short-term loans to Swiss public authorities through an online platform matching investors to borrowers. Those third-party loans amounted to USD 737 million on December 31, FIFA said.\n(This story has not been edited by Devdiscourse staff and is auto-generated from a syndicated feed.)\nALSO READ\nProgress on EU-Australia Free Trade Deal: What's Next?\nZimbabwe stun former champions Australia by 23 runs in a Group B T20 World Cup match in Colombo.\nAll-round Zimbabwe script 23-run upset win over injury-hit Australia\nScoreboard of T20 World Cup: Australia vs Zimbabwe\nZimbabwe stun former champions Australia by 23 runs in a Group B T20 World Cup match in Colombo.",
  "word_count": 1010,
  "scraped_at": "2026-02-14T12:00:03.501039"
}