{
  "article_id": "46524fcef349",
  "url": "https://newsday.co.tt/2024/06/18/pro-series-girls-win-republic-cup-champs-of-champs-title/",
  "title": "Pro Series girls win Republic Cup  Champs of Champ title - Trinidad and Tobago Newsday",
  "date": "20240619T044500Z",
  "domain": "newsday.co.tt",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Pro Series girls win Republic Cup 'Champs of Champs' title\nPRO Series’ under-20 girls’ football team were crowned the 2024 Republic Cup National Youth Football League Champions of Champions on June 15 after getting an exciting 2-1 win against Tobago Chicas in their encounter at the Republic Bank Sports Club in Barataria.\nThe Champions of Champions clash saw the winners of the Trinidad leg of the competition coming up against the team that won the Tobago zone. And although the Tobago Chicas team boasted of talents such as national players Talia Martin and J’Eleisha Alexander, the reigning Secondary Schools Football League (SSFL) girls’ Player of the Year, the Pro Series girls had enough in the tank to grab the national title.\nPro Series took the lead in the 22nd minute through a goal from Kanika Rodriguez, and they carried the slender 1-0 lead into the break.\nWith national bragging rights on the line, both teams came out firing in the second half and landed heavy blows. In the 48th minute, Alexander landed the first punch as the star striker got the Chicas’ lone goal in the contest to bring the game level at 1-1.\nThe Chicas players may have been pulled into a false sense of security after Alexander’s goal, as their defence was critically breached mere moments later. Pro Series striker Rashed Archer showed she could match Alexander’s ability at the other end, as she got the game-winner in the 50th minute to seal the title.\nArcher was among a host of teenage players who made their debut for coach Richard Hood’s women Soca Warriors squad in the Caribbean Queen’s invitational tournament in Curacao a couple of weeks ago. Back on home soil, Archer delivered the goods to take Pro Series to Republic Cup glory.\nPro Series’ triumph in the girls’ under-20 division now complements the boys’ under-16 title they won on June 2.",
  "word_count": 315,
  "scraped_at": "2026-02-14T12:47:42.031052"
}