{
  "article_id": "46532a6609fb",
  "url": "http://www.tnledger.com/Default.aspx?newsDate=9/27/2024",
  "title": "The Nashville Ledger",
  "date": "20240926T080000Z",
  "domain": "tnledger.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Flipping a Trump card into a ‘dream job’\nHow COVID, the internet and Nashville mentors helped Johnson hit it bigly\nComedy has always been a serious business for James Austin Johnson.\nNashville takes stage in landmark SNL season\nNow, for a Weekend Update forecast: Watch for those golden moments in tomorrow’s milestone 50th anniversary season premiere of “Saturday Night Live” at 10:30 p.m. CDT on NBC (WSMV Channel 4).\nAnother Nashville favorite, Bargatze on SNL50, CBS\nNate Bargatze, Old Hickory’s resident comedian, is returning as “Saturday Night Live” host on the Oct. 5 second episode of season 50, followed by a CBS variety special that will air in December.\nTrump’s ‘weave’: Pure genius or windy gibberish\nDonald Trump: “I do the weave. I’ll talk about, like, nine different things that they all come back brilliantly together. And it’s like friends of mine that are like English professors, they say: ‘It’s the most brilliant thing I’ve ever seen.’”\n39.9°F\nA Few Clouds\nWind: calm mph\nHumidity: 58%\nEVENTS\nLeads Exchange. Connect with fellow members while gaining exposure for your business at our monthly Member Connects. Member Connect is a facilitated, small-group networking opportunity allowing each attendee to talk about their business in an intentional way. Williamson, Inc. Power Room, 4031 Aspen Grove Dr., Suite 630. Parking 4000 Rush Street. Free to attend. Wednesday, 11:30 a.m.-1 p.m. InformationThe claws are retracted once your deal is closed\n“Clawback” isn’t a term most home sellers are concerned about or even familiar with. But it is a growing concern for some sellers who are worried the party purchasing their home could later be found guilty of fraud.\nAverage rate on a 30-year mortgage slips to 6.08%, lowest level in 2 years\nThe average rate on a 30-year mortgage in the U.S. slipped to its lowest level in two years this week, boosting home shoppers' purchasing power as they navigate a housing market with prices near all-time highs.\nThis disaster isn’t all Levis; there's plenty of blame to go around\nNumbers tell a big part of the story as to why the Tennessee Titans are struggling at the bottom of the NFL after three games.\nHello bye: Welcome respite comes after Miami\nThey say the bye week never comes at a bad time in the NFL.\nTitans at Dolphins: What to watch\nThe Titans head to Miami for their only prime-time appearance Monday night to face a beat-up Dolphins team that has nearly as many problems as Tennessee.\nDodson Parker welcomes new associate Nelson\nThe Nashville law firm of Dodson Parker Behm & Capparella, PC, has hired Maddin M. Nelson as an associate attorney. She joins the firm’s employment and litigation practice groups.\nVoter registration deadline Oct. 7\nThe advent of October brings crucial dates for the upcoming Nov. 5 federal, state and county elections.\nHow automakers are making recalls easier\nVehicle recalls are an important part of automotive safety. But they can also be quite a hassle for owners.\nBearing witness to bullish women of Wall Street\nYou can’t. Is that like a red flag to a bull or what? For someone to tell you that you can’t, when you know fully well that you can, is a guaranteed challenge, a sure sign that you’re going to march right up and do that thing.\nAmericans prioritizing happiness over career\nTwo-thirds of Americans would rather work a job they love with a lower-paying salary than work a job they hate with a higher-paying salary. Further, 72% say they would rather define success based on a “soft-life culture” – happiness, contentment and fulfillment – than a “hustle culture” focused on wealth, status and achievement.\nNo Titans QB controversy with Callahan insisting Will Levis will get time to develop\nNASHVILLE (AP) — Tennessee Titans coach Brian Callahan is doing his best to nip any talk of a quarterback controversy, saying he can't wait to see Will Levis continue to grow in his second NFL season.\nJudge's ruling clears way for North Carolina public high school athletes to profit from NIL\nRALEIGH, N.C. (AP) — A judge in North Carolina has cleared the way for the state's public-school athletes to profit off their fame in a court case involving a high school football player who has committed to play at Tennessee.\nHospitals mostly rebound after Helene knocked out power and flooded areas\nWhile hospitals and health care organizations in the Southeast largely stayed open and functioning during Hurricane Helene to provide essential care for their communities, they were not unscathed.\nHurricanes like Helene are deadly when they strike and keep killing for years to come\nHurricanes in the United States end up hundreds of times deadlier than the government calculates, contributing to more American deaths than car accidents or all the nation's wars, a new study said.\nHarris, Biden take in Helene's destruction in separate visits to Carolinas, Georgia\nAUGUSTA, Ga. (AP) — President Joe Biden flew over toppled trees, twisted metal and towering piles of debris in the normally tourist friendly downtown of Asheville, North Carolina, on Wednesday, as he took a tour by helicopter of Hurricane Helene 's path of destruction. At the same time, Vice President Kamala Harris was getting her own look at the storm's damage in Georgia.\nLong water and power outages from Helene test patience in the Carolinas, Georgia\nSWANNANOA, N.C. (AP) — Many residents of the Carolinas still lacked running water, cellphone service and electricity Wednesday as rescuers searched for people unaccounted for after Hurricane Helene caused catastrophic damage across the Southeast and killed at least 166 people.\nHelene's flooding swept away 11 workers at a Tennessee factory. Now the state is investigating\nNASHVILLE (AP) — Tennessee state authorities said Wednesday they are investigating the company behind a plastics factory where 11 workers were swept away by flooding from the remnants of Hurricane Helene.\nSearch crews with cadaver dogs wade through muck of communities 'wiped off the map' by Helene\nSWANNANOA, N.C. (AP) — Cadaver dogs and search crews trudged through knee-deep muck and debris in the mountains of western North Carolina on Tuesday looking for more victims of Hurricane Helene days after the storm carved a deadly and destructive path through the Southeast.\nProsecutors lay out new evidence in Trump election case, accuse him of having 'resorted to crimes'\nWASHINGTON (AP) — Donald Trump laid the groundwork to try to overturn the 2020 election even before he lost, knowingly pushed false claims of voter fraud and \"resorted to crimes\" in his failed bid to cling to power, according to a newly unsealed court filing from prosecutors that offers new evidence from the landmark criminal case against the former president.\nAnti-abortion leaders undeterred as Trump for the first time says he'd veto a federal abortion ban\nCHICAGO (AP) — Anti-abortion leaders said Wednesday that they're undeterred after Donald Trump said he would veto a federal abortion ban, the first time he has explicitly said so after previously refusing to answer questions on the subject.\nCybersecurity head says there's no chance a foreign adversary can change US election results\nWASHINGTON (AP) — Security for America's election systems has become so robust that Russia, Iran or any other foreign adversary will not be able to alter the outcome of this year's presidential race, the head of the nation's cybersecurity agency said Wednesday.\nHarris and Trump are tested by the Mideast, Helene and the port strike in the campaign's final weeks\nWASHINGTON (AP) — A trio of new trials — a devastating hurricane, expanding conflict in the Mideast and a dockworkers strike that threatens the U.S. economy — are looming over the final weeks of the presidential campaign and could help shape the public mood as voters decide between Democrat Kamala Harris and Republican Donald Trump.\nVance and Walz keep it civil in a policy-heavy discussion: VP debate takeaways\nWASHINGTON (AP) — Vice presidential hopefuls Tim Walz and JD Vance focused their criticism on the top of the ticket on Tuesday as they engaged in a policy-heavy discussion that may be the last debate of the 2024 presidential campaign.\n'The rules were you guys weren't going to fact-check\": False, misleading claims from VP debate\nFACT FOCUS: A look at false and misleading claims during the vice presidential debate\nSome of the most notable quotes from the JD Vance-Tim Walz vice presidential debate\nWASHINGTON (AP) — The first and only vice presidential debate between Ohio Senator JD Vance and Minnesota Governor Tim Walz featured an often orderly, policy-focused and even civil dialogue between the two men seeking to serve as the next president's second in command.\nTrump won't participate in interview for '60 Minutes' election special\nNEW YORK (AP) — CBS News said Tuesday that Republican presidential nominee Donald Trump has declined to participate in an interview with \"60 Minutes\" for its election special, which will go forward next Monday with Democratic opponent Kamala Harris alone.\nQuality ratings hit to key Medicare plan shakes Humana stock\nShares of Humana tumbled Wednesday after the health insurer said a Medicare Advantage quality rating drop will hurt future bonus payments the company receives.\nTesla posts first quarterly increase in deliveries, but shares slump with investors hoping for more\nLow interest financing, sweet lease deals, price cuts and free charging boosted Tesla's global deliveries in the third quarter, the first increase this year for the electric vehicle maker.\nCountries, businesses and trade officials urge EU to rethink deforestation regulation\nJAKARTA, Indonesia (AP) — A growing number of governments, international trade organizations and businesses are urging the European Union to reconsider a deforestation regulation set to take effect in December.\nSwine fever sweeps Italy's north, threatening production of prized prosciutto and livelihoods\nCORTELEONA E GENZONE, Italy (AP) — One of Giovanni Airoli's sows tested positive for African swine fever in late August. Within a week, all 6,200 sows, piglets and fattening pigs on his farm south of Milan were slaughtered under strict protocols to halt the disease threatening Italy's 20 billion euro prosciutto, cured sausage and pork industry.\nWall Street edges higher as financial markets steady themselves\nNEW YORK (AP) — U.S. stocks edged higher in a quiet Wednesday, and Treasury yields rose following an encouraging update on the job market's strength.\nChatGPT maker OpenAI raises $6.6 billion in fresh funding as it moves away from its nonprofit roots\nOpenAI said Wednesday it has raised $6.6 billion in venture capital investments as part of a broader shift by the ChatGPT maker away from its nonprofit roots.\nDockworkers join other unions in trying to fend off automation, or minimize the impact\nNEW YORK (AP) — The massive port workers' strike that has crippled all the major dockyards on the Eastern seaboard of the U.S. is highlighting a fear held by many workers: Eventually, we will all be replaced by machines.\nThe president could invoke a 1947 law to try to suspend the dockworkers' strike. Here's how\nWASHINGTON (AP) — Some manufacturers and retailers are urging President Joe Biden to invoke a 1947 law as a way to suspend a strike by 45,000 dockworkers that has shut down 36 U.S. ports from Maine to Texas.\nNike's quarterly sales and profits slump as it faces shoppers' sluggish demand for its products\nNEW YORK (AP) — Nike sales and profits slumped in its fiscal first quarter as the sportswear giant wrestles with shoppers' sluggish demand for new sneaker models and other products.\nUS bans new types of goods from China over allegations of forced labor\nWASHINGTON (AP) — The Department of Homeland Security announced Wednesday that it would ban the import of goods from a Chinese steel manufacturer and a Chinese maker of artificial sweetener, accusing both of being involved in the use of forced labor from China's far-west region of Xinjiang.\nCIA makes it easier for potential informants to share tips\nWASHINGTON (AP) — The CIA wants to make it easier — and safer — for people in Iran, China and North Korea to share information with America's premier spy agency.\nAfter pressing an Israel-Hezbollah cease-fire, the Biden administration shifts its message\nWASHINGTON (AP) — The Biden administration says there is a significant difference between Israeli actions that have expanded its war against the Iranian-backed militant groups Hamas and Hezbollah and Iran's retaliatory missile attack against Israel, which it condemned as escalatory.\nSpeaker Johnson lays out agenda for Republicans as they fight to hold House majority\nWASHINGTON (AP) — Speaker Mike Johnson laid out on Tuesday a policy agenda should Republicans take the majority next year that extends the tax cuts approved when Donald Trump was president, reduces the size of the federal workforce and gives parents more choice on where they can send their children to school.\nRepublicans are more likely than Democrats to see Israel as a US ally: AP-NORC poll\nWASHINGTON (AP) — After a year of war between Israel and Hamas, U.S. public opinion on the conflict remains polarized, a new survey by the Pearson Institute and The Associated Press-NORC Center for Public Affairs Research finds, with Democrats more likely to be critical of Israel, while Republicans remain more supportive.\nVanderbilt's Stassun included in 2024 MacArthur 'genius grant' fellows\nThe John D. and Catherine T. MacArthur Foundation announced Tuesday its 2024 class of fellows, often known as recipients of the \"genius grant.\"\nThis year's MacArthur 'genius' fellows include more writers, artists and storytellers\nNEW YORK (AP) — The 2024 class of the John D. and Catherine T. MacArthur Foundation fellows includes more writers, artists and storytellers than in years past, though the so-called \"genius grants\" list also includes multiple scientists.\nHelene and other storms dumped a whopping 40 trillion gallons of rain on the South\nMore than 40 trillion gallons of rain drenched the Southeast United States in the last week from Hurricane Helene and a run-of-the-mill rainstorm that sloshed in ahead of it — an unheard of amount of water that has stunned experts.\nHurricane Helene's death toll passes 150 as crews search for survivors\nSWANNANOA, N.C. (AP) — Cadaver dogs and search crews trudged through knee-deep muck and debris in the mountains of western North Carolina on Tuesday looking for victims of Hurricane Helene, days after the storm carved a deadly and destructive path through the Southeast.\nHarris will tour Helene devastation in Georgia, North Carolina as storm scrambles campaign schedule\nWASHINGTON (AP) — Vice President Kamala Harris will tour damage caused by Hurricane Helene in Georgia and North Carolina as the deadly storm roils the political calendar just over a month from Election Day.\nSupplies arrive by plane, mule to North Carolina as Helene death toll tops 100\nASHEVILLE, N.C. (AP) — Widespread devastation left behind by Hurricane Helene came to light Monday across the South, revealing a wasteland of splintered houses, crushed cargo containers and mud-covered highways in one of the worst storms in U.S. history. The death toll topped 130.\nJudge weighs jury instructions in trial of 3 former Memphis officers charged in Tyre Nichols' death\nMEMPHIS (AP) — A judge was considering arguments Tuesday related to instructions that will be given to jurors in the federal trial of three former Memphis police officers charged with violating Tyre Nichols' civil rights in a beating that proved fatal following a 2023 traffic stop.\nRudolph leads Titans to first win of season after Will Levis is injured\nMIAMI GARDENS, Fla. (AP) — Mason Rudolph was happy to help lead the Tennessee Titans to their first win of the season on Monday, even though he felt like he didn't have to do much.\nTitans quarterback Will Levis injures shoulder in the 1st quarter against the Dolphins\nMIAMI GARDENS, Fla. (AP) — Tennessee Titans quarterback Will Levis left Monday's 31-12 win over the Miami Dolphins in the first quarter with a shoulder injury.\nAttorney says 120 accusers allege sexual misconduct against Sean 'Diddy' Combs\nHOUSTON (AP) — An attorney said Tuesday he is representing 120 accusers who have come forward with sexual misconduct allegations against Sean \"Diddy\" Combs, the hip-hop mogul who is awaiting trial on sex trafficking charges.\nEx-Jaguars worker who stole $22M from team sues FanDuel, saying it preyed on his gambling addiction\nA former financial manager for the NFL's Jacksonville Jaguars who stole $22 million from the team is suing FanDuel for $250 million, saying the betting company preyed on his gambling addiction.\nNo one expects a judge's rollback of Georgia's abortion ban to be the last word\nSAVANNAH, Ga. (AP) — When a Georgia judge overturned the state's abortion ban this week, abortion rights advocates praised the ruling and opponents denounced it — all knowing the state's top court could put it on hold in coming days or weeks.\nKey swing state faces 'daunting' level of uncertainty after storm ravages multiple counties\nASHEVILLE, N.C. (AP) — North Carolina election officials say they will do everything in their power to ensure that voters in the crucial presidential swing state will be able to cast their ballots despite the devastation of Hurricane Helene and the destruction of basic infrastructure only about a month before the November election.\nWalz, Vance will meet in their first and possibly only vice presidential debate\nWASHINGTON (AP) — Tim Walz and JD Vance will meet for their first and possibly only vice presidential debate Tuesday, in what could be the last debate for both campaigns to argue their case before the election.\nTrump heads to Wisconsin's critical Democratic stronghold ahead of vice presidential debate\nWAUNAKEE, Wis. (AP) — Former President Donald Trump plans to spend the hours ahead of Tuesday night's vice-presidential debate campaigning in Wisconsin, stopping in a critical Democratic county that is crucial to Democrat Kamala Harris ' hopes for winning the key battleground state.\nTrial on new Georgia election certification rules set to begin\nATLANTA (AP) — A trial is set to get underway Tuesday on a lawsuit filed by Democrats challenging two new rules passed by the Georgia State Election Board that have to do with county certification of election results.\nDemocratic donors prop up far-right candidates including Wisconsin gun activist in Senate race\nWASHINGTON (AP) — David Steinglass, a wealthy donor, has supported scores of Democrats running for office and calls himself an activist for transgender rights.\nThe grace period for student loan payments is over. Here's what you need to know\nNEW YORK (AP) — The 12-month grace period for student loan borrowers ended on Sept. 30. The \"on-ramp\" period helped borrowers who are struggling to make payments avoid the risk of defaulting and hurting their credit score.\nSony's PlayStation Network suffers hourslong outage, irking videogamers\nLONDON (AP) — Sony's PlayStation Network went down for hours on Tuesday, frustrating gamers around the world who complained they weren't able to sign in to their accounts.\nUS job openings rise to 8 million as labor market remains sturdy\nWASHINGTON (AP) — U.S. job openings rose unexpectedly in August as the American labor market continued to show resilience.\nInflation in Europe falls below 2% and opens the way for faster rate cuts\nFRANKFURT, Germany (AP) — Inflation in the 20 countries that use the euro fell to 1.8% in September, below the European Central Bank's target of 2% for the first time in more than three years as falling energy prices give consumers relief from a burst of inflation that at one point reached into double digits.\nJapan's central bank survey underpins optimism about growth\nTOKYO (AP) — Business sentiment among Japan's large manufacturers stood unchanged in the latest quarter from the previous quarter, according to a closely watched survey called \"tankan\" released Tuesday.\nWall Street retreats from records and oil prices jump after Iran's missile attack on Israel\nNEW YORK (AP) — U.S. stocks retreated from their records Tuesday after Iran fired missiles into Israel, a sharp escalation of tensions in the Middle East that investors fear could lead to disruptions in the flow of oil.\nThe US could see shortages and higher retail prices if a dockworkers strike drags on\nNEW YORK (AP) — U.S. ports from Maine to Texas shut down Tuesday when the union representing about 45,000 dockworkers went on strike for the first time since 1977.\nPort strikes extend a new era of American labor activism\nThe U.S. dockworkers who went on strike early Tuesday are just the latest unionized group to back their demands for better contracts by walking off the job to illustrate their value to both the national economy, and their employers' bottom line.\nIran fires at least 180 missiles into Israel as regionwide conflict grows\nJERUSALEM (AP) — Iran launched at least 180 missiles into Israel on Tuesday, the latest in a series of escalating attacks in a yearslong conflict between Israel and Iran and its Arab allies that threatens to push the Middle East closer toward a regionwide war.\nSheinbaum sworn in as 1st female president of Mexico\nMEXICO CITY (AP) — Claudia Sheinbaum took the oath of office Tuesday as Mexico's first female president in more than 200 years of independence, promising to protect an expanded social safety net and other popular policies put in place by her predecessor, but facing pressing problems.\nJimmy Carter, his hometown of Plains celebrate the 39th president's 100th birthday\nPLAINS, Ga. (AP) — Longtime friends, family and fans of Jimmy Carter milled around his hometown of Plains to celebrate his 100th birthday on Tuesday, the first time an American president has lived a full century and the latest milestone in a life that took the Depression-era farmer's son to the White House and across the world as a Nobel Peace Prize-winning humanitarian and advocate for democracy.\nJimmy Carter at 100: A century of changes for a president, the US and the world since 1924\nAlready the longest-lived of the 45 men to serve as U.S. president, Jimmy Carter is about to reach the century mark.\nDolphins are keeping their starting QB for Monday night's matchup with Titans under wraps\nMIAMI GARDENS, Fla. (AP) — Mike McDaniel has an idea of who will start at quarterback for the Miami Dolphins against the Tennessee Titans on Monday night. For now, he's keeping it to himself.\nJosh Heupel's Vols have stingy D to complement that dazzling offense\nJosh Heupel made his coaching reputation as a guru running offenses so fast that defenders were left gasping for air, unable to substitute fresh players.\nAlabama overtakes Texas for No. 1, Tennessee rises to No. 4 after open date\nAlabama returned to No. 1 in The Associated Press college football poll for the first time in two years on Sunday following its dizzying victory over Georgia, making this 16 of 17 seasons the Crimson Tide has held the top spot at some point.\nBarbra Streisand, Dolly Parton, Martin Scorsese and more stars pay tribute to Kris Kristofferson\nNEW YORK (AP) — Reaction to the death of Kris Kristofferson. The singer-songwriter and actor died Saturday at his home in Hawaii surrounded by family at age 88.\nKris Kristofferson, singer-songwriter and actor, dies at 88\nLOS ANGELES (AP) — Kris Kristofferson, a Rhodes scholar with a deft writing style and rough charisma who became a country music superstar and an A-list Hollywood actor, has died.\nSupplies arrive by plane and mule to North Carolina as Helene death toll tops 100\nASHEVILLE, N.C. (AP) — Widespread devastation left behind by Hurricane Helene came into light Monday across the South, revealing a wasteland of splintered houses, crushed cargo containers and mud-covered highways in one of the worst storms in U.S. history. The death toll rose to 121.\nBiden says he hopes to visit Helene-impacted areas this week if it doesn't impact emergency response\nWASHINGTON (AP) — President Joe Biden says he will visit Hurricane Helene-impacted areas this week as long as it does not disrupt rescue and recovery operations.\n2 ex-officers did not testify at their trial in Tyre Nichols' death. 1 still could\nMEMPHIS (AP) — Lawyers for two former Memphis officers rested their cases Monday without calling them to testify in their own defense against charges that they violated Tyre Nichols' civil rights in a beating that proved fatal following a 2023 traffic stop.\nJudge strikes down Georgia ban on abortions, allowing them to resume beyond 6 weeks into pregnancy\nATLANTA (AP) — A Georgia judge on Monday struck down the state's abortion law, which took effect in 2022 and effectively prohibited abortions beyond about six weeks of pregnancy.\nEpic Games sues Google, Samsung over phone settings, accusing them of violating antitrust laws\nLOS ANGELES (AP) — Video game maker Epic Games sued Google and Samsung on Monday, accusing the tech companies of coordinating to block third-party competition in application distribution on Samsung devices.\nMan accused of attempting to assassinate Trump pleads not guilty to federal charges\nWEST PALM BEACH, Fla. (AP) — A man who authorities say spent 12 hours camped outside Donald Trump's golf course before Secret Service spotted him with a rifle pleaded not guilty on Monday to federal charges including attempted assassination.\nFBI agrees to $22M settlement for claims of sexual discrimination at training academy\nWASHINGTON (AP) — The FBI agreed Monday to pay more than $22 million to settle a class-action lawsuit alleging female recruits were singled out for dismissal in training and routinely harassed by instructors with sexually charged comments about their breast size, false allegations of infidelity and the need to take contraception \"to control their moods.\"\nTrump makes false claims about federal response as he campaigns in area ravaged by Hurricane Helene\nVALDOSTA, Ga. (AP) — Donald Trump repeatedly spread falsehoods Monday about the federal response to Hurricane Helene despite claiming not to be politicizing the disaster as he toured hard-hit areas in south Georgia.\nTrump slams US response to Helene, even as supporters urge cutbacks to federal disaster agencies\nWASHINGTON (AP) — Former President Donald Trump criticized the Biden administration's response to the widespread devastation caused by Hurricane Helene, even as his supporters call for cuts to federal agencies that warn of weather disasters and deliver relief to hard-hit communities.\nTrump suggests 'one rough hour' of policing will end theft\nCOLUMBIA, S.C. (AP) — Donald Trump has suggested that \"one rough hour\" of law enforcement action would tamp down retail theft, an echo of his longstanding support for more aggressive and potentially violent policing.\nHarris and Trump change their campaign plans after Hurricane Helene's destruction\nWASHINGTON (AP) — Hurricane Helene's deadly devastation has scrambled the presidential candidates' campaign plans, with Kamala Harris returning early from a campaign visit to Las Vegas to attend briefings and Donald Trump heading to Georgia to see the storm's impact.\nTrump escalates attacks on Harris' mental fitness, suggests she should be prosecuted\nERIE, Pa. (AP) — Republican presidential nominee Donald Trump escalated his personal attacks on his Democratic rival, Kamala Harris, on Sunday by repeating an insult that she was \"mentally impaired\" while also saying she should be \"impeached and prosecuted.\"\nHarris trolls Trump at Vegas rally and LA fundraiser, says her crowds are 'pretty big'\nLAS VEGAS (AP) — Vice President Kamala Harris poked at Donald Trump over crowd sizes, his refusal to debate again and his privileged background on Sunday as she hauled in campaign cash in California and held a raucous rally at the same Nevada venue where the Republican nominee had appeared just two weeks ago.\nTrump is pointing to new numbers on migrants with criminal pasts. Here's what they show\nWASHINGTON (AP) — Republicans are pointing to newly released immigration enforcement data to bolster their argument that the Biden administration is letting migrants who have committed serious crimes go free in the U.S. But the numbers have been misconstrued without key context.\nWhy Tuesday's vice presidential debate could matter more than history suggests\nWASHINGTON (AP) — Tim Walz and JD Vance might have the chance to reshape the political landscape Tuesday in their first and only debate.\nWhat to watch as JD Vance and Tim Walz meet for a vice presidential debate\nATLANTA (AP) — Republican JD Vance and Democrat Tim Walz will meet Tuesday in the lone vice presidential debate of the 2024 election, bringing together undercards who have spent two months going after each other and the opposing nominees who top the major-party tickets.\nVance criticized an infrastructure law as a candidate then embraced it as a senator\nWASHINGTON (AP) — As he campaigned for the Senate two years ago, JD Vance harshly criticized a bipartisan 2021 law to invest more than $1 trillion in America's crumbling infrastructure, calling it a \"huge mistake\" shaped by Democrats who want to spend big taxpayer dollars on \"really crazy stuff.\"\nNew rules regarding election certification in Georgia to get test in court\nATLANTA (AP) — A day before a trial is set to begin on a challenge to two new controversial rules concerning the certification of vote tallies in Georgia, Democrats on Monday said they filed a lawsuit targeting another new rule that requires the number of paper ballots to be counted by hand at polling places after the close of voting.\nAfter a chaotic Congress, lawmakers head home to ask voters: How about another term?\nWASHINGTON (AP) — Congress is off for the campaign season, as lawmakers from one of the most chaotic and unproductive legislative sessions in modern times try to persuade voters to keep them on the job.\nCarmaker Stellantis slashes forecasts as it faces industry slump and Chinese competition\nMILAN (AP) — Carmaker Stellantis, the world's fourth largest carmaker, slashed its earnings forecast on Monday, citing investments to turn around its U.S. operations amid a wider industry slump and increased Chinese competition.\nMany Verizon customers across the US hit by service outage\nNEW YORK (AP) — Some Verizon customers across the U.S. were hit by a service outage Monday.\nSatellite service DirecTV buys rival Dish as it fights the onslaught of streaming services\nDirecTV is buying Dish and Sling, a deal it has sought to complete for years, as the company seeks to better compete against streaming services that have become dominant.\nMissing a beat, streaming service Spotify is back after a temporary outage\nNEW YORK (AP) — The music streaming service Spotify was down temporarily on Sunday, leaving thousands of listeners without access to tunes and podcasts.\nOver 90,000 Georgia residents taking shelter after chemical fire as haze, smell spreads to Atlanta\nCONYERS, Ga. (AP) — A weekend fire that sent a massive plume of dark smoke into the Georgia sky has led to complaints about a strong chemical smell and haze several miles away across metro Atlanta, where some schools canceled outdoor activities and others closer to the fire remained stuck at home sheltering from the outdoor air.\nFed Chair Powell says the US economy is in 'solid shape' with gradual rate cuts coming\nWASHINGTON (AP) — Federal Reserve Chair Jerome Powell signaled Monday that more interest rate cuts are in the pipeline but suggested they would occur at a measured pace intended to support a still-healthy economy.\nWall Street sets more records to close a winning September and third quarter\nNEW YORK (AP) — Wall Street closed its latest winning month and quarter with more records on Monday. The drift higher for U.S. stocks followed a wild start to the week for financial markets in Asia, where Japanese stocks tumbled and Chinese indexes soared.\nUS port strike by 45,000 dockworkers is all but certain to begin at midnight\nNEW YORK (AP) — The union representing U.S. dockworkers has signaled that 45,000 of its members will walk off the job at midnight, kicking off a strike likely to shut down ports across the East and Gulf coasts.\nA dockworkers strike could shut down East and Gulf ports. Will it affect holiday shopping?\nNEW YORK (AP) — U.S. ports from Maine to Texas could shut down Tuesday if a union representing about 45,000 dockworkers carries through with a threatened strike.\nThe US is sending a few thousand more troops to the Middle East to boost security\nWASHINGTON (AP) — The U.S. is sending a \"few thousand\" troops to the Middle East to bolster security and to defend Israel if necessary, the Pentagon said Monday. The announcement follows word that Israel has already launched limited raids across the border into Lebanon.\nHere's a look at the US military presence in the Middle East\nWASHINGTON (AP) — The U.S. has increased its military presence in the Middle East by several thousand troops, sending an array of fighter jets and other aircraft to bolster the protection of U.S. forces and allies.\nBiden administration doubles down on tough asylum restrictions at border\nWASHINGTON (AP) — The Biden administration said Monday it is making asylum restrictions at the southern border even tougher, as it's increasingly eager to show voters uneasy over immigration that it is taking a hard stance on border security.\nMemphis man gets life sentence for killing rapper Young Dolph\nMEMPHIS (AP) — Justin Johnson was found guilty of murder in the death of rapper Young Dolph on Thursday after the jury heard testimony from a co-defendant that the killing was part of a feud between rival record labels.\nTennessee judge denies attempt for a new trial in Holly Bobo killing\nMEMPHIS (AP) — A judge has denied a petition for a new trial in the kidnapping and killing of a Tennessee nursing student, knocking down an attempt by a key witness to recant his testimony that helped lead to a man's conviction in 2017.\nFederal judge dismisses a challenge to Tennessee's school bathroom law\nNASHVILLE (AP) — A federal judge has dismissed a lawsuit challenging a Tennessee law that bans transgender students and staff from using school bathrooms or locker rooms that match their gender identities.\nPlaintiffs won't revive federal lawsuit over Tennessee's redistricting maps\nNASHVILLE (AP) — A group of Tennessee voting and civil rights advocates says it won't refile a federal lawsuit alleging the state's U.S. House map and boundaries for the state Senate amount to unconstitutional racial gerrymandering.\nSupreme Court refuses to order New York to include RFK Jr. on the presidential ballot\nWASHINGTON (AP) — The Supreme Court on Friday refused an emergency appeal from Robert F. Kennedy Jr.'s presidential campaign seeking to have his name added to New York's ballot.\nIranian operatives charged in the US with hacking Donald Trump's presidential campaign\nWASHINGTON (AP) — Three Iranian operatives have been charged with hacking Donald Trump's presidential campaig n as part of what the Justice Department says was a sweeping effort to undermine the former president and erode confidence in the U.S. electoral system.\nProsecutors file sealed brief detailing allegations against Trump in election interference case\nWASHINGTON (AP) — Special counsel Jack Smith on Thursday filed, under seal, a legal brief that prosecutors have said would contain sensitive and previously unseen evidence in the case charging former President Donald Trump with plotting to overturn the 2020 election he lost.\nJudge tosses lawsuit against Burchett over posts about man not involved in Chiefs' rally shooting\nKANSAS CITY, Kan. (AP) — A federal judge this week tossed a lawsuit against a Tennessee congressman who falsely accused a Kansas man of being involved in a deadly shooting at a rally celebrating the Kansas City Chiefs' Super Bowl victory this year.\nGoogle expert at antitrust trial says government underestimates competition for online ad dollars\nALEXANDRIA, Va. (AP) — Federal regulators who say Google holds an illegal monopoly over the technology that matches online advertisers to publishers are vastly underestimating the competition the tech giant faces, an expert hired by Google testified Thursday.\nHarris blasts proposals for Ukraine to cede territory to Russia during Zelenskyy meeting\nWASHINGTON (AP) — With American support for Ukraine at a partisan crossroads, Vice President Kamala Harris on Thursday slammed suggestions that Kyiv should cede territory for the sake of peace with Moscow as \"dangerous and unacceptable.\"\nHarris heads to the US-Mexico border to try to show that her record is more than Trump criticisms\nPHOENIX (AP) — Vice President Kamala Harris on Friday will make her first visit to the U.S.-Mexico border since becoming the Democratic presidential nominee to confront head-on one of her biggest vulnerabilities ahead of the November election.\nTrump favors huge new tariffs. What are they, and how do they work?\nWASHINGTON (AP) — Donald Trump has identified what he sees as an all-purpose fix for what ails America: Slap huge new tariffs on foreign goods entering the United States.\nJews and Catholics warn against Trump's latest loyalty test for religious voters\nFormer President Donald Trump recently reissued his loyalty test to religious Americans, declaring that he can best protect their freedoms while preemptively blaming members of certain faiths should he lose the presidential election in November.\nTrump and Zelenskyy meet in New York amid rising questions about US support for Ukraine\nNEW YORK (AP) — Ukrainian President Volodymyr Zelenskyy met face-to-face with Donald Trump on Friday with public tensions rising between the two over Ukraine's defense against Russia's invasion and in the midst of the U.S. presidential election.\nTrump launches a new business venture during his campaign: $100,000 watches\nHe's sold Bibles, sneakers, photo books and cryptocurrency during his third campaign for president. Now, Donald Trump is launching a new business venture: diamond-encrusted watches.\nSenate Democrats are making a late push in red-leaning states as they try to hold majority\nWASHINGTON (AP) — Democrats looking to preserve their Senate majority in the face of a difficult election cycle announced Thursday they were making a \"multi-million dollar investment\" in television advertising in Texas and Florida races with the chairman of the Democratic Senatorial Campaign Committee saying he's \"very confident there's going to be more coming.\"\nAbortion-rights groups are courting Latino voters in Arizona and Florida\nPHOENIX (AP) — When Lesley Chavez found out she was pregnant at age 16, she saw her daughter as a blessing from God and never considered an abortion, a view reinforced by her devout Christian mother. If she could have voted at the time, Chavez would have opposed expanding abortion access.\nRepublican-led group sues to block Georgia rule requiring hand count of ballots\nATLANTA (AP) — A Republican-led group is challenging Georgia's new requirement that poll workers count the total number of ballots by hand, saying it's another example of the State Election Board overstepping its legal authority.\nEx-'Apprentice' candidates dump nearly entire stake in owner of Trump's Truth Social platform\nA Florida firm owned by former contestants on \"The Apprentice\" has disposed of nearly all its 5.5% stake in Trump Media & Technology Group, which owns former president Donald Trump's Truth Social platform.\nSafety board says pedals pilots use to steer Boeing Max jets on runways can get stuck\nWASHINGTON (AP) — Safety investigators are making \"urgent\" recommendations to Boeing and the Federal Aviation Administration after determining pedals that pilots use to steer 737 Max jetliners on runways can become jammed because moisture can leak into a rudder assembly and freeze.\nFed's favored inflation gauge shows cooling price pressures, clearing way for more rate cuts\nWASHINGTON (AP) — The Federal Reserve's preferred inflation measure on Friday provided the latest sign that price pressures are easing, a trend that is expected to fuel further Fed interest rate cuts this year and next.\nRichmond Fed president urges caution on interest rate cuts because inflation isn't defeated\nWASHINGTON (AP) — The president of the Federal Reserve's Richmond branch says he supports reducing the central bank's key interest rate \"somewhat\" from its current level but isn't yet ready for the Fed to fully take its foot off the economy's brakes.\nDow sets a record as Wall Street drifts to the finish of another winning week\nNEW YORK (AP) — U.S. stocks closed another record-setting week with a muted performance Friday, as hope built on Wall Street that the U.S. economy can manage the rare feat of suppressing high inflation without causing a recession.\nFacing a possible strike at US ports, Biden administration urges operators to negotiate with unions\nWASHINGTON (AP) — Top Biden administration officials were meeting Friday with port operators ahead of a possible strike at East and Gulf coast ports, with a union contract expiring after Monday.\nBiden signs temporary funding bill that avoids a shutdown before the election\nWASHINGTON (AP) — President Joe Biden on Thursday signed a temporary government spending bill that keeps agencies operating into December, after Congress punted key spending decisions until after the November election.\nWinless Titans know they need to protect young QB Will Levis and quickly\nNASHVILLE (AP) — Left guard Peter Skoronski summed up the Tennessee Titans ' biggest motivation to protect quarterback Will Levis better quickly.\nFBI agent says 2 officers accepted accountability in fatal beating of Tyre Nichols\nMEMPHIS (AP) — An FBI agent who interviewed two former Memphis police officers on trial in the fatal beating of Tyre Nichols ' testified Thursday that they accepted accountability for participating.\nJury deliberation begins in the trial over Memphis rapper Young Dolph's killing\nMEMPHIS (AP) — Jurors in the trial over the killing of rapper Young Dolph began deliberating on Thursday after hearing testimony from a Memphis man that his death was part of a feud between rival record labels.\nBaltimore longshoremen sue owner and manager of ship that caused the Key Bridge collapse\nBALTIMORE (AP) — A group of Baltimore longshoremen have sued the owner and manager of the ship that caused the Francis Scott Key Bridge collapse, arguing the companies should compensate them for wages lost while the port was closed in the aftermath of the deadly disaster.\nVoting technology firm, conservative outlet reach settlement in 2020 election defamation case\nWILMINGTON, Del. (AP) — A settlement has been reached in a defamation lawsuit pitting an electronic voting machine manufacturer targeted by allies of former President Donald Trump against a conservative news outlet that aired accusations of vote manipulation in the 2020 election.\nAppeals court seems open to altering Trump's 'troubling' civil fraud penalty\nNEW YORK (AP) — Some judges in a New York appeals court appeared receptive Thursday to possibly reversing or reducing a civil fraud judgment that stands to cost Donald Trump nearly $500 million. One judge called the former president's penalty \"troubling\" and wondered if the state's policing of private business transactions amounted to \"deterrence\" or \"mission creep.\"\nGiuliani disbarred in DC after pushing Trump's false 2020 election claims\nWASHINGTON (AP) — Former New York City Mayor Rudy Giuliani was disbarred in Washington on Thursday, months after he lost his law license in New York for pursuing false claims that then-President Donald Trump made about his 2020 presidential election loss.\nJudges set to hear arguments in Donald Trump's appeal of civil fraud verdict\nNEW YORK (AP) — As Donald Trump hits the homestretch of his White House run, the former president's lawyers are heading to a New York appeals court in a bid to overturn a civil fraud judgment that could cost him nearly $500 million.\nA new mystery firm enters Trump's orbit, rekindling criticism of his presidential campaign spending\nWASHINGTON (AP) — Launchpad Strategies was incorporated less than a year ago and has since received $15 million from Donald Trump's election fundraising machine.\nTrump says Ukraine is 'demolished' and dismisses its defense against Russia's invasion\nFormer President Donald Trump described Ukraine in bleak and mournful terms Wednesday, referring to its people as \"dead\" and the country itself as \"demolished,\" and further raising questions about how much the former president would be willing if elected again to concede in a negotiation over the country's future.\nTrump warns he'll expel migrants under key Biden immigration programs\nWASHINGTON (AP) — Former President Donald Trump, who has made anti-immigration rhetoric a key part of his reelection campaign, warned Wednesday that he would kick out hundreds of thousands of immigrants who have entered the country under two key Biden administration programs if he's reelected.\nHarris makes scandal-plagued Republican the star of her campaign to win North Carolina\nCHARLOTTE, N.C. (AP) — There's an unlikely star in Kamala Harris ' push to win North Carolina: Mark Robinson.\nAmericans are more likely to see Harris' gender as a hurdle than they were for Clinton: AP-NORC poll\nWASHINGTON (AP) — Americans are more likely to believe that being a woman will hurt Kamala Harris ' chances in the November election, compared with eight years ago when Hillary Clinton was running. And they are more likely to believe that Donald Trump 's gender will help him.\nSouthwest Airlines says it will introduce assigned seats and premium perks in 2026\nDALLAS (AP) — Southwest Airlines executives on Thursday unveiled their vision for Southwest 2.0, an airline that for the first time will give passengers assigned seats, charge them extra for more legroom and offer red-eye flights but bags still will fly free.\nSophistication of AI-backed operation targeting senator points to future of deepfake schemes\nWASHINGTON (AP) — An advanced deepfake operation targeted Sen. Ben Cardin, the Democratic chair of the Senate Foreign Relations Committee, this month, according to the Office of Senate Security, the latest sign that nefarious actors are turning to artificial intelligence in efforts to dupe top political figures in the United States.\nThe US is mailing Americans COVID tests again. Here's how to get them\nWASHINGTON (AP) — Americans can once again order COVID-19 tests, without being charged, sent straight to their homes.\nOld newspaper boxes are being used to distribute the overdose reversal drug Narcan\nCHARLESTON, W.Va. (AP) — For decades, Jeff Card's family company was known for manufacturing the once ubiquitous tin boxes where people could buy newspapers on the street.\nUS economy grew at a solid 3% rate last quarter, government says in final estimate\nWASHINGTON (AP) — The American economy expanded at a healthy 3% annual pace from April through June, boosted by strong consumer spending and business investment, the government said Thursday, leaving its previous estimate unchanged.\nThe number of Americans filing for jobless aid falls to lowest level in 4 months\nThe number of Americans applying for unemployment benefits last week fell to the lowest level in four months.\nWall Street rises to another high, but a slide for oil keeps the gains in check\nNEW YORK (AP) — U.S. stocks rose to another all-time high, but a slide in oil prices kept the gains in check by weighing down energy companies.\nCryptocurrency exchange network accused of helping Russia hit with sanctions\nWASHINGTON (AP) — A network of people and virtual currency exchanges associated with harboring Russian cybercrime were hit with sanctions on Thursday, in a government-wide crackdown on cybercrime that could assist Russia ahead of President Joe Biden's meeting with Ukrainian President Volodymyr Zelenskyy.\nDiners are skipping restaurants and making more meals at home as inflation trend inverts\nNEW YORK (AP) — Eating in is in and eating out is out.\nChina redoubles first-aid for its economy with support for banks and workers\nChina is redoubling its first-aid for its economy, targeting banks, workers and poor families as the ruling Communist Party prepares to mark the 75th anniversary of the founding of the People's Republic.\nOpenAI Chief Technology Officer Mira Murati and 2 other execs are leaving the ChatGPT maker\nA high-ranking executive at OpenAI who served a few days as its interim CEO during a period of turmoil last year said she's leaving the artificial intelligence company.\nZelenskyy visits Washington as election year divide grows over Ukraine war\nWASHINGTON (AP) — Ukrainian President Volodymyr Zelenskyy huddled with U.S. leaders on Thursday to shore up American support for his country's fight against Russia as the war faces a partisan reckoning in this year's presidential election.\nHearing on Trump assassination attempts says Pennsylvania failure was with Secret Service\nWASHINGTON (AP) — Members of a bipartisan House panel investigating the Trump assassination attempts suggested during their first hearing Thursday that the failures that led to a gunman being able to open fire on former President Donald Trump in Pennsylvania were with the U.S. Secret Service, not local police.\nBiden wants to make active shooter drills in schools less traumatic for students\nWASHINGTON (AP) — President Joe Biden is expected to sign an executive order on Thursday that aims to help schools create active shooter drills that are less traumatic for students yet still effective. The order also seeks to restrict new technologies that make guns easier to fire and obtain.\nRussia's adaptability to US sanctions stymied their effectiveness, economists say\nWASHINGTON (AP) — Waves of sanctions imposed by the Biden administration after Russia's invasion of Ukraine haven't inflicted the devastating blow to Moscow's economy that some had expected. In a new report, two researchers are offering reasons why.\nDemocrats try to censure Rep. Clay Higgins for slandering Haitians in social media post\nWASHINGTON (AP) — House Democrats attempted Wednesday to quickly censure a Republican congressman who slandered Haitian immigrants in a post he made on social media, but GOP leadership stamped out the effort.",
  "word_count": 8138,
  "scraped_at": "2026-02-14T12:33:04.282511"
}