{
  "article_id": "4665117feec2",
  "url": "https://www.thenationalnews.com/news/mena/2025/11/03/pope-calls-for-sudan-ceasefire-amid-unacceptable-suffering/",
  "title": "Pope calls for Sudan ceasefire amid  unacceptable suffering  ",
  "date": "20251103T110000Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sudan's warring rival military forces have agreed in principle to a three-month humanitarian truce, with technical details now being discussed, US adviser for Africa Massad Boulos said on Monday.\nSpeaking to Sudanese and Egyptian reporters in Cairo, Mr Boulos said the Armed Forces and the paramilitary Rapid Support Forces have given their “initial and in principle” agreement to the proposed truce.\n“They have no objections … we are discussing its implementation – monitoring mechanisms, defining existing front lines as well as logistical and security” issues, said Mr Boulos.\nA US committee is in contact with the war's two sides to devise a way to swiftly distribute aid throughout the vast nation, Mr Boulos said.\nThe three-month humanitarian ceasefire is part of a peace proposal presented last month by the United States, Egypt, the UAE and Saudi Arabia. The ceasefire, according to the plan, is to be followed by a return to civilian rule in which the Muslim Brotherhood is kept out of power.\nThe Brotherhood, declared an illegal or terrorist group in several Arab nations, served as the ideological vehicle of nearly three decades of rule by former dictator Omar Al Bashir, who was removed from power in 2019 by a popular uprising.\nThe Sudan war, which is at the midway point of its third year, has killed tens of thousands, displaced about 14 million people and left 30 million – more than half the population – facing hunger, with pockets of famine emerging in several locations in the ethnically and religiously diverse nation in north-east Africa.\nThe fall of the city of El Fasher to the RSF last week after an 18-month siege gave the paramilitary full control of the Darfur region and deepened the de facto division of Sudan.\nThe prosecutor's office at the International Criminal Court said on Monday that alleged mass killings and other abuses in El Fasher could constitute war crimes. It voiced “profound alarm and deepest concern” over reports from El Fasher about the claims.\n“These atrocities are part of a broader pattern of violence that has afflicted the entire Darfur region since April 2023,” it said .\"Such acts, if substantiated, may constitute war crimes and crimes against humanity under the Rome Statute,” the founding text of the court in The Hague.\nBesides Darfur, the RSF also holds parts of Kordofan to the south-west, while the army controls the capital Khartoum as well as the northern, eastern and central regions of Sudan.\nBoth sides have governments of their own, with the RSF's based in Darfur and the army-backed administration in Port Sudan on the Red Sea.\n“Keeping Sudan united and ending the conflict is a priority, not only for Sudan, but also for the region, the entire world, including even the United States. Regional instability can have dangerous consequences,” said Mr Boulos.\nThe four nations that presented last month's a peace plan said the humanitarian truce should “lead immediately to a permanent ceasefire, then an inclusive and transparent transition process should be launched and concluded within nine months to meet the aspirations of the Sudanese people”.\nOnce allies, army chief Gen Abdel Fattah Al Burhan and RSF commander Gen Mohamed Dagalo, led a coup in 2021 that overthrew a civilian government and derailed the country's democratic transition. Relations between the two generals later soured, with both vying for control of Sudan. The tension boiled over into open warfare in April 2023.\nOn Sunday, Pope Leo XIV spoke about Sudan in an address at Saint Peter's Square in Vatican City. He said: “With great sorrow, I follow the tragic news coming from Sudan, particularly from the city of El Fasher in the afflicted northern Darfur region.”\nHe denounced “indiscriminate violence against women and children, attacks on unarmed civilians, and serious obstacles to humanitarian action” that have caused “unacceptable suffering to a population already exhausted by long months of conflict”.",
  "word_count": 644,
  "scraped_at": "2026-02-14T12:13:08.506630"
}