{
  "article_id": "467e85463e6a",
  "url": "https://www.90min.com/features/key-questions-facing-sarina-wiegman-england-euro-2025-hopes-hang-balance",
  "title": "The key questions facing Sarina Wiegman and England as Euro 2025 hopes hang in the balance",
  "date": "20240611T210000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The key questions facing Sarina Wiegman and England as Euro 2025 hopes hang in the balance\n- England sit third in their UEFA Women’s Euro 2025 qualifying group\n- They have just two remaining games against Sweden and the Republic of Ireland\n- Sarina Wiegman has plenty of questions to ponder ahead of the must-win matches in July\nEngland are part way through their UEFA Women’s Euro 2025 qualifying campaign and have just two group games left to contend against Sweden and the Republic of Ireland.\nDuring the April international break, they drew 1-1 with Sweden at Wembley before they narrowly beat the Republic of Ireland 2-0 in Dublin. In the first round of their summer fixtures, they contested a double-header against France, losing in the first match at St James’ Park, before they won the fixture in Saint-Etienne with a reverse of the 2-1 scoreline.\nAs things stand, the Lionesses sit third in their qualifying group, but only behind Sweden on goal difference. Should they win both of their final games in July, they will automatically qualify for next summer’s tournament in Switzerland, otherwise they will be required to contest two rounds of play-offs against teams in Leagues B and C.\nNext month’s games are absolutely crucial for Sarina Wiegman’s side if they’re to retain their European crown in 12 months time, so 90min has taken a look at the key questions facing the manager as their qualifying campaign enters its final stages.\nMidfield dilemma\nWhat happens when plan A doesn’t work?\nIt’s clear that Keira Walsh is the midfield fulcrum of this England team and so much of what they do comes through the Barcelona star. Her importance is so clear that opposition teams have seemingly worked out how to limit her impact and stifle England as a result.\nThe second game against France, particularly the first half, offered a glimmer of what England are capable of and hinted there is in fact a plan B. When France had more of the ball, England were able to press and win the ball back high, as opposed to recycling possession over and over with no way through.\nLauren James absence\nShould she be risked if not fully fit?\nOne of the big misses for England in their double-header against France was Chelsea star Lauren James. The 22-year-old was ruled out of the games in Newcastle and Saint-Etienne due to a foot injury sustained at the end of the season.\nDespite efforts to be ready after initially joining the training camp, Wiegman confirmed James hadn’t quite made it prior to the games. It is not yet known whether she will be fit for next month’s clashes against Sweden and the Republic of Ireland, but with so much riding on the games, having her available even as a substitute could prove to be the difference-maker.\nJames’ directness, power and technical ability offers something completely different to the rest of the squad. By occupying defenders, she opens up space for her teammates and she’s capable of producing a moment of magic when needed. With just two games left, it should be worth bringing her back into the squad even if she can’t start.\nStick or twist\nShould Alex Greenwood come back into the team?\nEngland’s defensive flaws were a major talking point after their defeat to France at the end of last month. While the Leah Williamson and Millie Bright partnership was formidable at the Euros in 2022, injuries have limited their involvement with the national team in recent times.\nGetting them back on the pitch together should have been a return to the tried and tested, but instead it presented more questions than answers. Alex Greenwood has arguably been one of England’s best defenders since the World Cup and, unlike her teammates, has been available more often than not.\nThe second performance against France in Saint-Etienne was far better and England just about got over the line, but concerns were still raised over the Lionesses’ defensive fragilities as the hosts pushed for an equaliser in the closing stages of the game.\nEngland have an array of options in that area of the pitch, with Jess Carter and Lotte Wubben-Moy also in the mix. England will also be hoping Nimah Charles is fit again in July after missing the games against France with a calf injury.\nBut, even so, England’s best defence is very much up for debate as things stand and it’s something they need to nail down sooner rather than later.\nThe lack of game changers\nWho is England’s strongest option off the bench?\nInjuries and the absence of a handful of players, including James, certainly limits what England are able to bring off the bench. Chloe Kelly has been the go-to option in recent times, along with Fran Kirby, but the Lionesses appear to be struggling to replicate the impact Ella Toone and Alessia Russo provided at the Euros in 2022.\nNow both are starters, Wiegman may need to start trusting her younger players in big moments and big games. The likes of Jess Park and Grace Clinton have been afforded opportunities in moderation, but both are yet to truly establish themselves as regular senior internationals and reliable options to change a game.\nIt cannot be understated how much Toone and Russo’s involvement off the bench contributed to England’s European triumph two years ago. True impact subs is something they need to rediscover if they’re to reach the finals next summer and enjoy similar success.\nRachel Daly replacement\nIs Aggie Beever-Jones ready to take mantle?\nIn keeping with England’s lack of impact off the bench, they arguably lost their greatest when Rachel Daly announced her retirement from international football in April. While she was fighting a losing battle with Russo for the number 9 shirt, Daly represented one of the only other striker options the Lionesses had.\nWhen things aren’t quite clicking for the Arsenal star, as things stand, England are lacking an outright replacement. Aggie Beever-Jones is currently the closest thing they have, but the 20-year-old is extremely inexperienced at international level.\nThere are players that can fill in, of course, but it’s fair to say England lack depth in that area of the pitch and risk becoming overly reliant on Russo’s fitness and form in what is such a crucial position.",
  "word_count": 1054,
  "scraped_at": "2026-02-14T12:52:17.693144"
}