{
  "article_id": "468b209023f7",
  "url": "https://www.buckys5thquarter.com/2025/2/14/24365866/wisconsin-badgers-state-of-the-program-worry-levels-part-1-luke-fickell-greg-gard-marisa-moseley",
  "title": "Wisconsin Badgers  State of the Program  Worry Levels , Part 1",
  "date": "20250215T011500Z",
  "domain": "buckys5thquarter.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Although this pursuit is admittedly highly subjective, I decided to come up with worry levels based on a 1-10 scale (with 1 being 100 percent chill and 10 being full panic mode) for a number of Wisconsin Badgers programs.\nWisconsin Badgers ‘State of the Program’ Worry Levels, Part I\nWhat is the state of the Badgers program currently?\nA couple of quick caveats: This is not solely based on this season, although a highly successful or unsuccessful current team will have disproportionate weight. Same with program controversy.\nWhat doesn’t matter? @BadgerStanMike00075975’s takes on Twitter/X. I simply wasn’t swayed by angry online fan overreaction, although your reactions are always welcome in the comments because reasonable minds can differ on these numbers.\nFootball: 5\nI’ll start right off with the one that most people are wondering about. Some will say that going 12-13 over Fickell’s first two seasons and having to replace an OC already deserves a higher panic grade, and a decent case can be made.\nBut two things cut against this: The size of the mess that Fickell inherited, and how much more difficult program building is in this weird Portal/NIL era with a relatively modest budget.\nWisconsin is expected to compete on a level playing field with a number of programs that massively outspend it and that gap has increased substantially over the last few years. This is not a free pass for Fick, as results will need to follow soon, but simply a reminder that winning football games at Wisconsin is harder now than it was even five years ago.\nAlso relevant: there are some tangible reasons for optimism in Madison this fall, even with a potentially historically difficult schedule in the offing. So, 5 seems like an appropriate, crossroads type of number.\nMen’s Basketball: 2\nAnyone reading this in late March of 2024 after the departures of AJ Storr and Chucky Hepburn would probably not believe it. But the fact that Greg Gard didn’t wallow in the tough times of March/April of last year and simply put his head down on the transfer recruiting trail to nab John Tonje (and others) while retaining most of the team’s core set the Badgers up for success this year.\nAlso of note is a more up-tempo stylistic change brought in by assistant coach Kirk Penney, which has made the Badgers a much tougher team to defend against (Wisconsin sits No. 10 in college hoops in offense and No. 11 overall in the KenPom rankings)\nAnd those who say Gard can’t develop talent need look no further than Nolan Winter, John Blackwell, Carter Gilmore, and Kamari McGee to arm them with a meaty rebuttal.\nYes, the No. 16 Badgers still have substantial work to do this season to fulfill their promise, and winning some games in March will be important, but the reality is, in mid-February, it is set up well for a meaningful run.\nAnd with a nice 2025 recruiting class lined up featuring composite four-star DePere Guard Zach Kinziger, the program appears on very solid ground.\nWomen’s Basketball: 9\nThis one pains me, as a decent finish to last season in the NIT coupled with a strong non-conference start to this one offered all kinds of good vibes for Marisa Moseley’s squad.\nBut this team, despite having an elite player in Serah Williams, has been dreadful in conference play, sitting now at 2-12 (11-14 overall).\nMost games have not been particularly close, and a mid-season controversy involving troubling allegations from former player Tessa Towers only makes things appear worse.\nLet’s see how the season finishes because the team deserves that much, but we definitely could be witnessing the end of Moseley’s tenure.\nWomen’s Hockey: 1\nThis was obviously the easiest grade of the bunch. What Mark Johnson has built at LaBahn arena is nothing short of a college hockey dynasty, and the team again sits No. 1 in the nation heading into the stretch run of its WCHA season after absolutely eviscerating the No. 3 Minnesota Gophers at home last week.\nNot only are there no cracks in the foundation of this program (three national titles and an absurd eight Frozen Fours over the last decade) but it appears to only be getting stronger, if that’s even possible, coming off of a natty in 2023 and runner-up in 2024.\nOne statistic underscores this team’s dominance this season: The top three scorers in NCAA Hockey are all Badgers (Casey O’Brien, Laila Edwards, and Kirsten Simms, with Caroline Harvey fifth and Lacey Eden ninth.) It’s just utter dominance. If there were a number lower than 1 on the worry scale, I’d use it.\nPart II is coming soon and will cover Men’s Hockey, Women’s and Men’s Soccer, Volleyball, and Wrestling.",
  "word_count": 789,
  "scraped_at": "2026-02-14T13:19:24.482015"
}