{
  "article_id": "46bdb5e7b484",
  "url": "https://www.ksnblocal4.com/2023/05/28/unks-ferguson-wins-3rd-800m-national-title-2nd-fastest-collegiate-time/",
  "title": "UNK Ferguson wins 3rd 800m national title in 2nd - fastest collegiate time",
  "date": "20230528T061500Z",
  "domain": "ksnblocal4.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "UNK’s Ferguson wins 3rd 800m national title in 2nd-fastest collegiate time\nPUEBLO, Colo. (Press Release) - Fremont redshirt junior Wes Ferguson won his third 800-meter national title with a strong backstretch and in a meet-record 1:45.46 Saturday night at the 2023 NCAA Division II Championships in Pueblo, Colo.\nThis was the third and final day of a meet held at the ThunderBowl by Colorado State-Pueblo. The Loper men finished with eight All-Americans; they had nine at last year’s outdoor championships and seven at this year’s NCAA indoor event. The haul this weekend was good for 16th place (21 points).\nFerguson squared off against CSU-Pueblo’s Reece Sharman-Newell in what was basically a two-man race from the start. Sharman-Newell recorded the third fastest time in D2 history in April 2022 (1:45.56) and he came out fast tonight to the tune of 50.00 seconds over the first 400 meters.\nHowever, Ferguson hung around and then dominated at the end, blowing by Sharman-Newell and finishing with the second-best time in college this year. The effort, surpassing his previous best of 1:46.95, is also the fastest time by an American collegian or pro this year. Angelo State’s Oussama El Bouchayby (Morocco) had a 1:45.31 back in March.\nSharman-Newell (1:47.21) held on for second place with Ferguson now third all-time in D2 history. Savieri Ngidhi of Abilene (Texas) Christian still holds the D2 record (1:45.24; April 1995) with El Bouchayby, a recent transfer to Alabama, second.\nLast year, the now seven-time All-American won the 800 indoor (1:50.05) and outdoor (1:50.61) titles. Ferguson moves past thrower Lance Pfeiffer (two) for most individual national tiles in a Loper career with current throws coach Dane Tobey having the most D2 AA honors (eight).\nFerguson’s night was done as he was anchor for the 4x4 relay team. The foursome, just the second All-American relay team in school-history, turned in a school-record 3:08,56 in the meet’s final event to finish fifth. This foursome -- Jack Drahota (Ravenna), Micah Swedberg (Wallace) and Conner Wells (St. Paul) -- set the previous Loper standard (3:09.19) at the Loper Twilight.\nAll nine teams were fairly close until the close of the third leg. Ferguson took over with UNK at the back of the pack but, not surprisingly, had a strong backstretch to help UNK leapfrog past several teams including MIAA rival and 2023 national champ Pittsburg State.\nNext, Kearney senior Brayden Sorensen is now the sixth four-time All-American in UNK history. He tied his career-best (7-1.75) in the high jump to come in fourth. He cleared 6-8.25, 6-10.25, 6-11.50 on his first attempts and then got past 7-0.50 on try three.\nAfter reaching 7-1.75 on his second jump, he missed twice at 7-3 before passing on his final attempt. That gave him one crack at 7-4.25. Not surprisingly, Pitt State’s Cordell Tinch won the national title by clearing 7-3 on his second jump. Central Missouri’s Evans Yamoah reached the same height on his third jump with Andrew Taylor of Wheeling (W.V.) coming in third as he went over the 7-1.75 bar on his first try.\nEarlier in the day, Kansas freshman southpaw Rylan Basart had a 209-0 effort in the javelin to place 11th and earn second-team All-American honors. He is the first AA jav thrower since Darren Grauerholz was eighth in both 1992 and 1993. Also a specialist on the Loper football team, Basart’s first two throws went 182-11 and 183-9.\nFinally, Kansas junior Jaida McEwen was 17th in the women’s jav (138-0) with David City sophomore Gabrielle Oborny 16th in the pole vault (12-1.50). McEwen, a two-time NCAA qualifier, had her best throw on her final attempt. Anna-Kay Clark of Harding, Ark. (142-6) came in 12th with Molly Olson of Azusa Pacific, Calif. (165-10) the champ.\nOborny went 12-1.50 on her first attempt and then went out at 12-7.50. Pitt State’s Kyla Davis finished first (13-9.25) with the last AA spot coming in at 12-7.50.\nCopyright 2023 KSNB. All rights reserved.",
  "word_count": 658,
  "scraped_at": "2026-02-14T13:09:05.330793"
}