{
  "article_id": "46cb67bd63a3",
  "url": "https://www.jamaicaobserver.com/2025/02/25/end-of-an-era-20250225-0331-122974/",
  "title": "END OF AN ERA - Jamaica Observer",
  "date": "20250225T071500Z",
  "domain": "jamaicaobserver.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "END OF AN ERA\nPerennial champs Barbican Women FC no longer in existence following years of financial uncertainty\nWhile there’s optimism around the start of the rebranded Jamaica Women’s Premier League scheduled to kick off this weekend, its most successful team Barbican FC, will not participate this season or in any future seasons, as the club has ceased operations.\nThe record 12-time champions have not participated in the league since 2016 when they claimed their ninth-straight hold on the title. Due to the financial state of the women’s league over the last eight years, Barbican opted not to enter.\nHowever, with the Professional Women’s Football Jamaica Limited (PWFJL) taking control of the league and several major corporate sponsors coming on board, it was felt that the perennial champions would make their long-awaited return.\nBut Barbican’s former Head Coach and Technical Director Charles “Charlie” Edwards told the Jamaica Observer that the club is virtually defunct.\n“It doesn’t exist anymore. The players had gone off to other clubs, some of them stepped away from the game and even some who went to other clubs have now given up the game because of age; it’s been six, seven years out of the game and they’ve moved on with their lives,” he said.\n“The truth is that it was sad because I really loved it and it was a good programme to mentor and direct the girls, but the truth of the matter is it became a burden for us. I’m not in a position to take anything out of my pocket for football anymore. I’m not sure if Barbican will think about putting a female football team forward again and I don’t think I’d be there to do that,” Edwards added.\nBarbican initially intended to make their comeback in 2024 but Edwards says the effects of the controversial Jamaica Football Federation election last year killed their revival plans.\n“We held onto hope of going back into the league and last year we made an attempt. We were getting sponsorship from a couple people but due to the election hiccups that were going on, a lot of people backed away from us and it kind of left a bad taste in my mouth,” he said. “For me to go back into the league, it has to be totally sponsored.\nBarbican won league titles from 2002 to 2004 and 2008 to 2016 and produced several players for Jamaica’s Reggae Girlz including Tashana Vincent, Alicia James, Jodi-Ann McGregor and Shantel Bailey.\nWhile proud of the achievements, Edwards says he has no regrets in walking away.\n“The girls did well, worked hard and reaped the just rewards. But at the end of the day, these things don’t pay the bills. Records and accomplishments don’t pay the bills,” he said.\n“When you do football in Jamaica, especially the women’s league, it takes a lot out of you financially and a lot of people don’t understand that. When COVID came around is when I realised how much financially I was drained and I made myself a promise that it wouldn’t happen again, so I had to step back and I’m on a new path to rebuild myself.”\nAlthough not ruling out a return to the women’s game in the future, Edwards says he’s keen to see how the new women’s league plays out.\n“What is important for me right now is seeing a new body like the men’s premier league that is going to orchestrate and run the women’s league, which I thought should have happened a long time ago. It’s good to see it happening now; there’s a lot of sponsorships and it augurs extremely well for the women’s programme,” he said.\n“Maybe at some point, it will entice me but at the moment, I haven’t seen the league off the ground as yet or how it will be organised so I’m pretty much sitting back and watching. I’d like to see some of the games and observe what’s going on and you never know what tomorrow may bring.”",
  "word_count": 671,
  "scraped_at": "2026-02-14T12:49:41.834315"
}