{
  "article_id": "46ce38958bbd",
  "url": "https://www.justarsenal.com/who-makes-your-strongest-arsenal-women-starting-xi-now-gooners-heres-mine/367759",
  "title": "Who makes your strongest Arsenal Women starting XI now , Gooners ? Here mine .. ",
  "date": "20240529T220000Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Arsenal Women had to settle for 3rd spot on the WSL table this season and managed to take the Women’s Continental League Cup back to North London, in a great cup run that saw us win the Conti Cup for the 7th time in our club’s history.\nWe had a good season and although sometimes it felt like we could, and should, have done better, we still walked away with silverware, and with what looks like a clear plan for the future. We’ve seen a lot of good football this season and probably should have finished higher in the table, but it does seem like we have the foundations to begin to build from here. Here’s who I think was our best starting XI this season.\nIn goal, of course, Manuela Zinsberger. I think she earned her new contract and had a surprisingly great season. At the start of the season, I began to worry that we needed someone better between the sticks, but she proved me wrong. She’s a big game player and without her this season, I think we wouldn’t have done as well as we have.\nFor our backline, Emily Fox, Leah Williamson, Lotte Wubben-Moy and Katie McCabe. Emily Fox joined in the January transfer window and has been unreal since the moment she signed. She slipped into the right back role perfectly and has been a huge asset. Williamson and Wubben-Moy have been great at centre back. Since Williamson returned from her ACL injury she’s looked back at her best and Leah and Lotte, when they have played together, have been extremely solid. Katie McCabe has been everywhere this season. Katie’s been extremely versatile and has stepped into any position she needed to. It’s a bit harsh to replace Steph Catley with McCabe but McCabe and Fox have just been too good not to pick.\nIn the midfield I’d say Victoria Pelova, Kyra Cooney-Cross and Frida Maanum. Cooney-Cross, I think, has been great when she has played this season. No Kyra hasn’t been the starter a lot but when she has played, she’s looked good, she always seems to have time on the ball and always looks composed. Pelova has been incredible, not only has she created chances and scored goals, but she’s been great at assisting, and is the perfect team player to have in the middle of the pitch. Frida Maanum has also had a great season and has been linking play up well between the attack and the defence.\nNow in attack I’d have to say Beth Mead, Stina Blackstenius and Caitlin Foord. It may feel a tad harsh on Russo but, for me, Blackstenius has had a better season up top. She’s been a proper team player, never complained about not starting and has always put in a huge shift whenever she’s on the pitch. I think it leaves head coach Jonas Eidevall with a lot of good options and a whole different type of striker to utilise. Mead has properly been our best player in 2024, since returning from her ACL she has been in top form, we really missed her when she was out, and it was just so great to see her back to her best in an Arsenal shirt, after what felt like forever without her. And finally, Caitlin Foord on the left wing, she’s been dynamic and fast and is a headache for any fullback to handle. Caitlin looks to have been in her best form this season and has pretty much cemented that left wing spot.\nWhat’s your strongest starting XI with our current squad, Gooners?\nDaisy Mae\nFollow JustArsenal’s Gooner Women on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 633,
  "scraped_at": "2026-02-14T13:12:42.593722"
}