{
  "article_id": "46e696d4274e",
  "url": "https://liverpooloffside.sbnation.com/liverpool-fc-women-news-results/76955/liverpool-fc-women-gareth-taylor-the-plan-was-to-try-to-get-pressure-to-the-ball-as-much-as-we-could-chelsea",
  "title": "Gareth Taylor :  The Plan Was To Try To Get Pressure To The Ball As Much As We Could  ",
  "date": "20251117T021500Z",
  "domain": "liverpooloffside.sbnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Liverpool Women have finally notched another point, this time against the champions Chelsea, but it may have come a little late. There were signs on Sunday that the work they’ve made in adjusting to Gareth Taylor’s new system is starting to pay off, as Chelsea are no easy team to beat, with a wealth of talent on their bench in addition to starting. Beata Olsson scored for the third time in three matches to bring the Reds level with Chelsea, a feat not done since Rachel Furness in 2020, and so things may be hesitantly looking up.\nGareth Taylor: “The Plan Was To Try To Get Pressure To The Ball As Much As We Could”\n“I felt the girls executed the plan really well. I felt they adapted well in the second period when Chelsea went to a back three,” Head coach Gareth Taylor said following the match.\n“They made numerous changes but at that point they kept everything the same. The plan was to try to get pressure to the ball as much as we could and try to identify a side of the pitch where we felt we could cause them problems with our pressing.\n“I was actually really disappointed with the first goal because it’s a moment we worked on so much in training. They executed it and we were half a yard off. But, to be honest, it was good character from the girls bouncing back to score. Bee [Olsson] did really well. I think apart from a chance for [Catarina] Macario, we limited them to very little. I felt if they were going to get anything at all it would be something from outside the box because we defended the box so, so well.”\nTaylor decided to make no substitutions on the day, as it appeared that this may be the starting XI he would stick with going forward. Chelsea made a big show of bringing on the likes of Lauren James and Lucy Bronze later in the match, but Liverpool were actually prepared and maintained the draw despite the firepower from the opponents.\n“It’s difficult in those moments. You’re always pulling with the idea of whether to make a change or not,” Taylor explained.\n“Sometimes it can give a bit of support but also players who are out there have been doing it for long enough. I think it’s another opportunity for those girls who played today to get fitter and that’s the real positive from it we can take. They really stuck to the task and worked so hard and got a reward of a point in the end.”\nUnfortunately the point was not enough to save Liverpool from dropping down to 12th and last place in the table, as West Ham beat Everton for their first win of the season. It was bound to happen, as both teams had held those bottom two positions since the season started, and it’s not a feel good place to be.\n“We’re at the bottom end of the table. We’re bottom of the table now but before the game we were at the bottom end. It’s a place we don’t want to be but that’s the reality,” the coach continued.\n“We know where we’re at and we know that we have to improve so many things on and off the pitch at the club. The girls are trying their best and really giving it absolutely everything. It’s not an issue.”\nPlaying a team like Chelsea did require everything from the women, all of their focus and graft to get that point, and there have been days when we’ve been lucky enough to beat them by the thinnest of margins. Taylor recognized that the women executed their plan maybe not perfectly but well enough to be rewarded.\n“I said previously that Chelsea have two teams that they could put out in the WSL and would probably be in the top three,” Taylor added.\n“I think what we’ve done today is pretty remarkable. Of course, on any given day you can also win that game and games can go your way, but we’ve had to work tremendously hard today to get something from the game. It’s nice the girls get a little bit of reward for that.”\nLiverpool Women next play Sheffield United at Bramall Lane on Saturday, November 22 at 6pm BST/1pm EST.",
  "word_count": 726,
  "scraped_at": "2026-02-14T12:44:13.218844"
}