{
  "article_id": "46f33de23e76",
  "url": "https://www.bbc.co.uk/sport/football/66534779",
  "title": "Women's World Cup 2023 predictions: Rachel Brown-Finnis predicts all the scores including Spain v England",
  "date": "2023-08-20T01:42:54.000Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_bbc",
  "body_text": "Women's World Cup 2023 predictions: Rachel Brown-Finnis predicts all the scores including Spain v England\n- Published\nThere will be a new name on the Fifa Women's World Cup trophy on Sunday - but will it be Spain or England tasting glory at Stadium Australia?\nBBC Sport football expert Rachel Brown-Finnis is predicting the outcome of all 64 matches at the tournament.\nShe predicted one of the semi-final winners, three of the four quarter-final winners, correctly guessed the outcome of all eight last-16 ties, and 27 of the 48 group games, giving her a success rate of 63% for the tournament.\nBefore the tournament, she chose eight of the 16 teams that progressed to the first knockout stage, including England, who she believes will win the World Cup.\nAET = After extra time\nSaturday, 19 August\nSweden 2-0 Australia\nI think Australia will win this match and finish third in the World Cup.\nSweden won't have the desire to finish third again after being there before. Like England proved when they reached the third-place play-off in both 2015 and 2019, the first time around, there is a real desire to win, but second time around, very much less so.\nAustralia will want to go out on a high and although Sweden have real attacking options and are good at set-pieces, Sam Kerr will want to make up for the chances she missed in the semi-final when she could - and should - have scored a hat-trick against England.\nShe's not been able to play much in this tournament and will want to do it for her country.\nBrown-Finnis' prediction: 2-3 to Australia AET\nSunday, 20 August\nSpain 1-0 England\nI have backed England from the start and I'm not going to change my mind now.\nSpain have got quality players and will have lots of possession but England also have world-class players. And they have the big-game experience, having beaten Spain on their way to winning Euro 2022.\nThe teams are at opposite ends of the spectrum when it comes to togetherness. The problems within the Spanish system and the debate over coach Jorge Vilda's methods are well documented, while England are closely knit and are enjoying themselves.\nI think this, together with Sarina Wiegman, are the extra percentage points that will get England over the line.\nAnd I'm confident it could be a similar scoreline to England's win in the semi-final. I think they will start with the same XI as they did in the semi-final but will bring Lauren James and Chloe Kelly off the bench, to play their part too in the final.\nBrown-Finnis' prediction: 1-3\nRachel Brown-Finnis was speaking to BBC Sport's Anna Thompson.\nA family home turns into a house of horrors: Watch the chilling crime thriller, Wolf, from the makers of Inside Man and Sherlock\nWill the faithfuls unmask the traitors?: 24 Aussies take on the ultimate game of trust and treachery",
  "word_count": 488,
  "scraped_at": "2026-02-14T11:17:46.310976"
}