{
  "article_id": "4703b00fb98c",
  "url": "https://www.marketing-interactive.com/fc-barcelona-pantone-join-forces-create-new-colour-equality",
  "title": "FC Barcelona and Pantone join forces to create | Marketing - Interactive",
  "date": "20230309T083000Z",
  "domain": "marketing-interactive.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FC Barcelona and Pantone join forces to create 'Lila Barça' colour for equality this IWD\nshare on\nFC Barcelona has joined forces with Pantone to create a new symbolic colour for equality which comes from the mixing of the clubs' original colours of blue and maroon and has the official name 'Lila Barça' whilst at the same time becoming part of the company's universal guide to colour.\nThis comes as the brand wishes to further its commitment to diversity, equality and inclusion as established in the club's statutes, and in light of International Women's Day on 8 March. The club wishes to set in motion various initiatives to highlight the importance of giving visibility to women in the world of sport.\n'Lila Barça' is the star of the video manifesto 'Equality is in our colours' which the club has created especially for the occasion and stars women's first team player Alexia Putellas. In the video a voiceover recounts the similarities between the team's development and recent success and the marriage of blue and maroon which have resulted in the new colour of equality.\nThe presence of 'Lila Barça' will also be at the forefront of the Club's initiatives which revolve around International Women's Day, both digitally and in person, in order to strengthen the blaugrana message in favour of equality for millions of people.\n'Lila Barça' will cover Spotify Camp Nou and the Estadi Johan Cruyff during the entire month of March, starting from the men's team game against Valencia and the women's game against Villarreal on 5 March. Club partners will also form part of the initiative to highlight women in football as Nike, Spotify, Bimbo, Cupra, Damm, Whitebit, Allianz, Konami, 1Xbet, Caixabank, Stanley, BMG, GLS and Scotiabank will integrate the new Pantone colour into their pitchside advertising during both games.\nFurthermore, this promotional initiative around International Women's Day goes much further with a variety of projects from various areas of the club aimed at different audiences. One of the main activities will be the participatory day dedicated exclusively to the club's female members which will also see institutional vice president Elena Fort involved. On 10 March, there will be an event that is expected to be full to capacity, female members will get together with 10 female club employees to share their experiences as key figures in a working environment historically associated with men.\nFC Barcelona has been striving towards promoting the role of women in the world of sport with their efforts focused on advancing equality and highlighting the role of women in the world of sport as well as their commitment to women's sport, in particular football, which dates back more than 50 years, according to the release.\nJoin Content 360 - Hong Kong: Stories For A New Era where over 150 content marketers come together to shape the future. Content 360 - Hong Kong is a must-attend conference that focuses on cutting-edge content trends, innovative creation techniques, strategies to customise your content for the newest marketing channels, and more. Don't miss out on this opportunity to elevate your content marketing game in Hong Kong! Tickets are on sale now, register today. https://conferences.marketing-interactive.com/content360-hk/\nRelated articles:\nKate Spade New York turns green with Pantone in latest brand collab\nHersheys' IWD campaign featuring transwoman leads to backlash\nAd agency Lion and Lion changes name for IWD\nshare on\nFree newsletter\nGet the daily lowdown on Asia's top marketing stories.\nWe break down the big and messy topics of the day so you're updated on the most important developments in Asia's marketing development – for free.\nsubscribe now open in new window",
  "word_count": 603,
  "scraped_at": "2026-02-14T12:51:50.988477"
}