{
  "article_id": "4718f835fa5a",
  "url": "https://www.nytimes.com/athletic/6889263/2025/12/22/bears-caleb-williams-ben-johnson-kevin-warren/",
  "title": "Climb aboard the Bear magic carpet ride , stadium headaches be damned : Pick Six",
  "date": "20251222T114500Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Caleb Williams’ walk-off 46-yard touchdown pass to DJ Moore deserved the highest praise from one of the NFL’s toughest graders.\nTom Brady met the moment.\n“Ten out of 10, A-plus throw!” Brady shouted on the Fox broadcast.\nThe Chicago Bears’ winning touchdown at Soldier Field was that perfect, down to the final improbable detail: Williams placing his hands, painted nails and all, into the warmers at his waist while watching his deepest pass in more than two months descend over (and through!) Green Bay Packers cornerback Keisean Nixon into Moore’s grasp.\nThe 22-16 overtime victory punctuated a remarkable week within an improbable season for one of the NFL’s founding franchises. The Bears, given a less than 5 percent shot at winning the NFC North entering Week 1, lead the division by 1 1/2 games with two to play. They clinched a playoff berth Sunday when Detroit lost at home to Pittsburgh.\n“The only reason I wouldn’t vote for Ben Johnson as president of the United States in the 2028 election is because I hope he is still coaching the Chicago Bears,” retired Bears offensive lineman Kyle Long declared.\nAdvertisement\nThe Pick Six column lays out what Bears fans should love about their team and why they shouldn’t let the latest awkward stadium update from team president Kevin Warren diminish their mood. The full Pick Six menu with 33 games remaining in this craziest of NFL seasons:\n• Don’t let Warren get you down\n• Jags expose Denver’s defense\n• NFL has it both ways on replay\n• Who worked trade-deadline magic\n• Steelers win! But DK Metcalf?\n• Two-minute drill: Stefanski’s fall\n1. The Bears are 11-4 and rolling. Let’s save the play-by-play announcing for the games, not for a tedious stadium process.\nLet’s cover the relevant ground after Chicago clinched a playoff berth for the first time since 2020.\n• Coach-QB love seems real: When the Bears made it back to their locker room following the win over Green Bay on Saturday night, Johnson handed out game balls to kicker Cairo Santos (made all three field goal tries despite rough conditions), receiver Jahdae Walker (scored the game-tying touchdown) and cornerback Josh Blackwell (recovered the onside kick).\nThen there was one more game ball to award. It went to Moore.\n“And Caleb, I love you,” Johnson said, turning toward the quarterback he inherited. “I love you, all right? But this one is not going to you.”\nThis team is special. pic.twitter.com/SGXkTAljwH\n— Chicago Bears (@ChicagoBears) December 21, 2025\nBoth men laughed. The team laughed. There was an ease among them that defied the narrative heading into this season, fueled by a 32-source Go Long piece that dropped three days before the opener, painting Williams as selfish, entitled and hard to coach.\n“I’ve got the best coach in the world, and we have the best coaching staff in the world,” Williams said after the game.\n• The coach is still the boss: Williams, uncoachable? The evidence suggests he might not have a choice in the matter.\nAdvertisement\nWilliams ran only eight under-center play-action snaps during his career at USC. The Bears have run 248 of them this season, second to the Rams (264), with Johnson’s former team, Detroit, third (245). That is up from 186 last season. Also up: the production on those plays, from -0.11 EPA per play last season (26th) to +0.16 this season (17th).\nThe winning touchdown pass required what a coach from another team called a “Tier 1 throw” by Williams, but the structure of the play — under center, hard play-action — was all Johnson.\n“If (Packers defensive coordinator) Jeff Hafley wanted one gift in his stocking from Santa, it would be to put the corner on DJ Moore in that position and drape his arm through his catching basket with the game on the line,” the coach said. “That is a Tier 1 throw! And Moore is a good player. But you can’t do any of that unless your head coach calls for it. They have to protect forever. The route takes forever. The post is deeper than Atlantis.”\nThis is not a case of the head coach molding his offense to make the quarterback’s job easier. It’s about trying to build something sustainable offensively. Whether this coach-QB relationship lasts for the long term doesn’t matter now. There’s time to figure that out.\nWilliams is still playing his own way in doses, creating out of structure and making spectacular off-schedule plays, like his risky but dazzling throw to Moore in the back of the end zone last week. His ability on the move can be the difference when it’s needed, like on his retreating touchdown pass to Walker in the clutch Saturday.\n“He can really move the ball in the hurry-up,” a coach from another team said. “Twice in three weeks, he drove the team all the way down the field by throws. He’s getting them lined up, getting the ball snapped, throwing the ball away when he needs to, executing the scramble drill for the explosives, throwing the dig when they play soft with the two-high safeties, all that stuff. Which looks better than a lot of people.”\nAdvertisement\nWilliams has reduced his sack rate from nearly 11 percent to less than 5 percent (68 sacks last season, 23 so far this season). His traditional stats are nearly identical, and his EPA per pass attempt is the same, but with fewer sacks and more explosive gains through the air, his EPA per pass play has soared from -0.05 (30th) to +0.06 (13th).\nWinning cures all: Even the Bears must know this magic carpet ride is fantastical. Per TruMedia, they are the 319th team since 2000 to trail in the final two minutes 10 or more times in a season but the only one to have a winning record in those games (6-4). They have four comebacks from 10 or more points behind, the Bears’ most in a season since at least 2000.\nIt’s amazing stuff, but as Kansas City’s year-over-year results in one-score games have demonstrated, regression is real. Winning from behind is not a sustainable formula. Enjoy it while it lasts.\n“They’ve got confidence, and that goes a long way toward winning,” an opposing coach said.\nAbout that stadium: Warren doesn’t hide from the spotlight. That’s Warren in the locker room after games, positioned directly across from the camera as Johnson addresses the team. That’s Warren on the team website, having in-house staff chronicle his 18-hour workday.\nUpon his 2023 hiring, Warren declared plans to position the Bears for their next 100 years. By spring 2024, he was advocating for the Chicago lakefront as the ideal location for a new stadium. That fall, he said the team hoped to break ground in 2025. Three months ago, just three days before Johnson’s first game as coach, Warren made news by saying the Arlington Heights site was the only suitable one in Cook County.\nThen, late last week, with the Bears gearing up for the Green Bay game, Warren preempted the regular programming again, suggesting the team might build a stadium in Indiana. Some in the league suspected the news was about to break elsewhere, and Warren simply wanted to get ahead of it.\nWhatever the case, football people tend to wince when they see the business side out front, the way Warren — who was part of the group that hired Johnson in January — tends to be.\nAdvertisement\n“The fans are so excited for Ben Johnson because they think he is going to be the next Dan Campbell, and Warren is sending out an email before the guy’s opening game,” an exec from another team said.\nThis exec also warned against painting Warren as all talk, no action on the stadium. The rival Vikings started scheming on a new stadium around the turn of the century, when more than a decade remained on their Metrodome lease. They didn’t break ground until 2013. Warren was with the Vikings from 2005 to ’19.\n“He was an integral part of the stadium team in Minnesota, and they arguably got the best stadium in the league,” the exec added. “Nobody goes back and looks at how long these things can take, which is forever. Now, you can’t keep stealing the spotlight, but it takes the same amount of time either way. You have to get in line.”\n2. Liam Coen’s postgame commentary was fun, but there are bigger takeaways from the Jaguars’ 34-20 victory. One is bad for Denver.\nThe Jaguars’ 34-20 victory at Denver brought into focus a few things about these teams heading toward the AFC playoffs:\n• Coen’s tone right for Jags: Coen might be perfect for the Jaguars right now.\nWhen the first-year coach clapped back at San Francisco 49ers defensive coordinator Robert Saleh for suggesting the Jaguars do a great job stealing signals (legally), Coen’s “keep my name out of your f—ing mouth” retort on the field after the game seemed over the top.\nBut for a franchise that has accomplished little recently and doesn’t get much attention even when it succeeds, having a coach with an edge can be a good thing.\nCoen pushed back Sunday after his Jaguars handled Sean Payton’s Broncos, days after Payton worked in a reference to Jacksonville as a “small-market” team.\n“A small-market team like us can come into a place like Mile High and get it done,” Coen said.\nAdvertisement\nThis wasn’t exactly Chuck Noll threatening Jerry Glanville 38 years ago this past week, but it was appropriate for the occasion.\nOTD in 1987….\nChuck Noll admonishes Jerry Glanville\nThis was after a game that featured a Steelers-Oilers brawl.\nFor more details, including how Earnest Jackson’s injury earlier that year was Noll’s motivation to confront Glanville, read my free article here:… pic.twitter.com/GfMMzxrLhw\n— Steel City Star (@steelcitystar) December 20, 2025\n“Historically, Denver plays really well at home, so the fact they were not able to close out and actually got punked at home, maybe that tells you they did not take Jacksonville seriously,” a coach from another team said.\nThe coach paused.\n“The reality is, well, who takes Jacksonville seriously?” the coach added.\nDenver might.\n• Dire for Denver: The Broncos have a top defense, right? Not lately. Denver ranks 29th in defensive EPA per play since Week 11. The Jaguars rank first.\nThe Broncos are riding a five-game streak of games with -3.0 defensive EPA or worse, their longest such streak within a season since 2002.\nDenver should have a good defensive game Thursday night at Kansas City, which had 133 yards and nine first downs against Tennessee while losing Gardner Minshew to injury in the Chiefs’ first game without Patrick Mahomes. But this version of the Broncos’ defense, which missed tackle after tackle against Jacksonville, could lead to a one-and-done postseason.\n• Jags have quality wins: Jacksonville has defeated six teams that currently have winning records, tied with the Rams for most in the league, just ahead of Seattle (five), Green Bay (four) and Houston (four). The six Jaguars wins: 26-10 over Carolina, 17-10 over Houston, 26-21 over San Francisco, 35-6 over the Chargers, 36-19 over Indy and 34-20 over Denver.\nAdvertisement\nLawrence’s year: With Lamar Jackson leaving Sunday night’s game with a back injury and his Ravens’ playoff hopes flagging anyway, the list of accomplished QBs on their way to the playoffs keeps getting thinner on the AFC side. Mahomes and Joe Burrow are already out. Josh Allen suffered an injury scare Sunday but returned and finished the Bills’ victory over the Browns.\n“The Bills look like they are teetering on the edge,” an exec who watched Buffalo on Sunday said.\nWhy not Lawrence? He has 12 touchdown passes without an interception over his past four games, the best four-game stretch of his career. He leads AFC quarterbacks in total touchdowns (14, including four against the Broncos), EPA per pass play (.345), passer rating (120.8), yards per attempt (8.7) and explosive pass rate (24.3 percent) over that span.\nPairing that production with a surging defense and a weakened AFC field gives the Jaguars a rare opportunity. The last time they were in a similar position, in 2017, they outplayed Brady’s New England Patriots for much of the AFC Championship Game, only to lose.\n“I think they are a byproduct of their defense, because you would never be able to take your quarterback out four times (in five weeks recently) in the fourth quarter if your defense was not able to close out games,” another coach said.\n3. Is the NFL having it both ways on officiating at the expense of equitable administration? Someone should ask the Rams.\nWe have sometimes lamented the prominence of former referees in broadcast booths, but Terry McAulay earned his stripes, and then some, during one of the most critical moments in Seattle’s 38-37 victory over the Rams.\n“I don’t think anybody in the crowd has any idea what’s going on right now,” Al Michaels said on the Amazon broadcast. “We probably wouldn’t either without Terry.”\nAdvertisement\nMichaels has been calling games since 1975, when Fran Tarkenton was MVP and the Seahawks had yet to play their first game. This was new for him.\nMcAulay, the best on-air NFL officiating analyst if it’s not Dean Blandino, alerted viewers that Sam Darnold’s incomplete pass on the tying 2-point try had traveled backward, and that Seattle might get the tying points after all because Darnold’s teammate, Zach Charbonnet, had picked up the loose ball, albeit casually, just inside the goal line.\n\"Is this the craziest 2-point conversion EVER?\"\nThe @Seahawks tie it up in a WILD way 😳\nLARvsSEA on Prime Video\nAlso streaming on @NFLPlus pic.twitter.com/KwNtEIWVQ7— NFL (@NFL) December 19, 2025\nThe replay reversal was correct, so for some, that’s all that matters. But are the best interests of the game advanced when a deep dive into the rulebook overturns a play that 1) Los Angeles defended exceptionally well and 2) no one besides a former referee might consider in dispute?\n“The problem is, the processes that are integral to the equity of the game are being bypassed when things are either clear and obvious or not,” an exec from another team said. “On the 2-point play, if you knew the rules and the replay official knew the rule, that was clear and obvious, and it would have happened quickly. But when the person responsible does not know the rules, you get, ‘Hey, wait a second, expert Terry McAulay on TV says we should be taking a look at this. Hold on.'”\nLong periods of time passed before the teams or the public knew what was happening Thursday night. Were the NFL’s replay officials in New York all over the play as McAulay was all over it? Had they alerted McAulay? Was it the other way around? To what degree are these referees-turned-analysts in communication with their buddies in the league office during games, and to what effect? Can fans and teams trust the process?\n“I’ve never seen anything like what happened on the 2-point conversion,” Rams coach Sean McVay said.\nOthers in the league privately say they think the NFL’s push for profits has created officiating brain drain. The best minds in officiating, including McAulay, can earn more money with less responsibility working for networks. If the league can leverage a McAulay for in-game advice without having to pay him, that’s a good deal — unless you’re a team seeking consistent administration.\nAdvertisement\nAre the games worked by McAulay officiated differently? Better? Fairer? More exactingly? Will a coach fighting for his job in an early Sunday slot get similar consideration when nine games are ongoing simultaneously and there’s no rules expert in the booth? Is the standard different then, when network officiating analysts might be working multiple games?\nThe Rams lost for many reasons Thursday night. Was the game’s prime-time placement high on the list?\nThursday night made it seem plausible.\nThe time was 10:55 p.m. ET when Darnold’s 2-point pass hit the ground.\nFifty-two seconds passed from Darnold’s apparent incompletion until Michaels asked McAulay what he had seen (McAulay raised the possibility that the pass had been backward).\nThirty-four more seconds passed before Michaels noted the play might be reviewed, despite both teams being lined up for the ensuing kickoff.\nFifteen more seconds passed before referee Brad Allen announced that the play was under review.\nThirty-seven more seconds passed before McAulay opined that the ruling should be overturned.\nTwenty-one more seconds elapsed before Allen announced the play had been reversed, and the game was now tied.\nThat’s 159 seconds — 2:29 — between play’s end and play’s reversal, with fans left to wonder how it all came to be.\nIf the NFL office is going to intervene in the final stages of a game so pivotal that it could determine the NFC’s No. 1 seed, on a play that did not on its face raise obvious concerns, with former officials possibly making a difference from the broadcast booth, the league should discuss the process openly in the interests of transparency.\nThat has not yet happened.\n4. Sauce Gardner and Quinnen Williams were the big-ticket trade additions this season. Have you seen Jakobi Meyers and Rashid Shaheed?\nNFL general managers aspire to take big in-season swings to put their contending teams over the top, now and/or for years to come. Adding Von Miller helped the Rams get over the top in 2021. For the 49ers, adding Christian McCaffrey brought years of high-end production and a Super Bowl appearance.\nAdvertisement\nGardner remains sidelined by injury for the faltering Indianapolis Colts. Williams’ Dallas Cowboys have been eliminated from playoff contention.\nBoth could still prosper for their teams in the long term, but right now, two under-the-radar receiver acquisitions are making their GMs look prescient. That’s appropriate because lower-priced acquisitions are driving the dramatic increase in in-season trade activity shown in the chart below.\nMeyers has fit so well with the Jaguars since they sent fourth- and sixth-round picks to Las Vegas to acquire him that they signed the pending free agent to a three-year, $60 million deal after only six weeks together.\nWith Meyers giving Lawrence a reliable target over the middle and Brian Thomas Jr. focusing more on the perimeter, Coen's passing game has been one of the league's most efficient since Week 10 (fifth in EPA per pass play, up from 27th before that).\nShaheed is a different type of contributor for Seattle, which runs its passing game through Jaxon Smith-Njigba, the NFL's leading receiver by yardage. Shaheed's 13 catches for 178 yards and no touchdowns since Seattle acquired him from New Orleans for fourth- and fifth-round picks tells a small part of the story.\nThursday's punt return touchdown in Seattle's overtime victory against the Rams was Shaheed's second return TD in three games, accounting for two of the Seahawks' six largest EPA gains on offense or special teams this season. Shaheed also had a 31-yard carry against the Rams that set up the tying touchdown.\nWhile Meyers provides the consistency Jacksonville craved, Shaheed has brought some of the home run potential Seattle was missing.\n5. The Steelers scored a huge victory at Detroit to boost their playoff chances. Will DK Metcalf be part of the final push?\nThe Steelers traded a second-round pick to Seattle for Metcalf and then signed the receiver to a five-year, $150 million contract in March.\nAdvertisement\nThese were curious decisions for Pittsburgh, which already had George Pickens on the roster but traded him partly over maturity concerns.\n\"Are we seeing the first signs of Pittsburgh panic?\" an exec from another team asked after the trade.\nDid the Steelers not know what they were getting with Metcalf? He regularly lost his cool in Seattle — from sideline outbursts and melees with teammates to 15-yard penalties (15 since entering the league in 2019) and ejections (two since 2021) — and was traded partly because of it.\nHere the Steelers are, with Aaron Rodgers possibly down to his final two games, wondering whether their $30 million-a-year receiver will be available for critical games against Cleveland and Baltimore, after Metcalf reached into the stands at Ford Field and yanked on the collar of a fan's shirt, then swung a fist at the fan's head.\nDK Metcalf appears to have an altercation with a Detroit fan pic.twitter.com/a478Zjg3tR\n— NFL on CBS 🏈 (@NFLonCBS) December 21, 2025\nMetcalf is one of 51 wide receivers with at least 40 receptions this season. He ranks 22nd among them in yards per game with 56.7, a fraction above his career low (47 is average among starting wide receivers this season). Pickens, meanwhile, has 88 catches for 1,342 yards and nine touchdowns for Dallas. He's averaging 89.5 yards per game, fourth-best in the league behind Puka Nacua, Smith-Njigba and Ja'Marr Chase.\nSeattle packaged the second-round pick (No. 52) acquired from Pittsburgh for Metcalf with a third-round pick (No. 83) to acquire the 35th pick from Tennessee. That pick became safety Nick Emmanwori, one of the most dynamic young defenders in the league. The Steelers have yet to use the compensation they received for Pickens: a 2026 third and 2027 fifth (they also sent Dallas a 2027 sixth).\n6. Two-minute drill: From 37-30 to 6-26 for Browns under Stefanski\nThe Browns played their 99th regular-season game under coach Kevin Stefanski on Sunday. The 23-20 defeat at home against Buffalo was not particularly discouraging as Browns defeats go. Cleveland played the previously 10-4 Bills close to the end.\nAdvertisement\nBut a loss is a loss, right? And Cleveland has accumulated too many of them. The Browns' falloff over the past two seasons is historic.\nStefanski is one of 21 first-time head coaches hired since 2000 to spend at least 99 games with his team. He ranked tied for 11th among them in win rate through 67 games (.552), which represents Stefanski's first four seasons on the job. The 37-30 record was respectable.\nCleveland's win rate has plummeted to .188 (6-26) across Stefanski's 68th through 99th games with the team. That is less than half the next-worst win rate in the 21-coach sample since 2000 (.391 by Marvin Lewis, who went 12-19 over that span with Cincinnati).\nWhen the story is written on Stefanski's tenure, the organization's ill-fated decision to acquire and pay Deshaun Watson in March 2022 will go down as the turning point, even though the Browns went 18-16 in their first two seasons after making that move.\nAcquiring Watson and keeping him in the lineup far longer than his performance merited surely worked against building a meritorious culture. The offense fell off a cliff beginning with Watson's first start in December 2022, after he served an 11-game suspension following allegations of sexual assault or misconduct from more than 20 women.\nIt continued plummeting with and without Watson in the lineup (he has started 19 of 55 possible games and remains sidelined by injury now). The free fall continues.\nIn fact, the Browns are riding the worst statistical three-season stretch on offense since at least 2000, per TruMedia. The five worst: the 2023-25 Browns (-566.9 EPA and counting), the 2010-12 Cardinals (-502 EPA), the 2018-25 Jets (-463.7), the 2009-11 Rams (-450 EPA) and the 2021-23 Jets (-445.8).\n• Power rankings update: The Jaguars have beaten the Chargers (35-6 in Week 11), Colts (36-19 in Week 14), Jets (48-20 in Week 15) and Broncos (34-20 in Week 16) by wider margins than anyone else has beaten those opponents this season.\nAdvertisement\nWhen we measure average point differentials for every team in that manner, then weigh recent outcomes more heavily than earlier ones, we get my opponent-adjusted, momentum-weighted team rankings.\nThe Rams, Seahawks, Jaguars, Texans and Patriots rank 1-2-3-4-5 through Sunday. The Bears, Eagles, Bills, Chargers and Colts round out the top 10.\nThe Lions, Broncos, Packers, 49ers, Ravens and Steelers are next.\n• Chiefs climbing in draft: Kansas City sits 11th in the draft order after Sunday, with a 52 percent shot at selecting in the top 10, per The Athletic’s model.\nDid the model watch the Chiefs play offense without Mahomes on Sunday? It wasn’t pretty. But as the chart below shows, Kansas City is riding a three-game stretch of subpar offense. Sunday was the worst of the season on a per-play basis and the third-worst in 237 total games with Andy Reid as coach. Carson Wentz (38-0 loss at Denver in 2024) and Alex Smith (19-12 loss at Houston in 2016) were in the lineup at quarterback for the two worst.\n• Lions’ fall: Before the season, eight NFL executives combined to project Detroit third in the NFC.\nOne outlier among them had the Lions finishing 11th, behind the Bears.\n“I refuse to believe they keep rolling after losing two starters on their offensive line and their two highest-paid assistant coaches,” the exec slotting Detroit 11th before the season said at the time.\nThe Lions sit eighth in the NFC after falling 29-24 at home to the Steelers, who set season highs with 481 total yards and 230 on the ground.\n• Packers never punted, but there’s an asterisk: NFL teams are 8-2 this season when they do not punt even once in a game. Green Bay accounted for both defeats, including Saturday against Chicago.\nThat sounds depressing from a Packers perspective, but Green Bay turned over the ball on downs three times in those games and lost the turnover battle both times.",
  "word_count": 4251,
  "scraped_at": "2026-02-14T12:44:06.760588"
}