{
  "article_id": "474838763a4a",
  "url": "https://www.sbs.com.au/news/podcast-episode/sbs-news-in-easy-english-2-june-2025/6855wljr3",
  "title": "SBS News In Easy English 2 June 2025",
  "date": "20250602T060000Z",
  "domain": "sbs.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\nTRANSCRIPT\nThe Australian government is being urged to consider using targeted sanctions against Israel over its actions in blocking aid in Gaza.\nLabor MP Ed Husic - and former Labor foreign ministers Gareth Evans and Bob Carr - have called for Australia to join the UK, France and Canada in signalling the use of targeted sanctions, if Israel fails to stop the renewed military offensive and lift all of the restrictions on aid.\nPrime Minister Anthony Albanese has so far rejected the calls, saying he is focused on \"peace and security for both Israelis and Palestinians\" rather than soundbites.\nMr Husic has also urged the federal government to consider backing Palestinian statehood at a UN conference on a two-state solution* to be held in New York later this month [[17-20 June]] .\nActivist Reem Borrows, from Palestine Australia Relief and Action, told SBS Arabic much stronger intervention is needed from the Australian government.\n+++\nThe Business Council of Australia has called on the federal government to have a focus on supporting innovation in its strategy to regulate A-I.\nIn a new report, the group warns against over-regulation, saying the country has vast land resources that could be used for data centres for AI.\nThe report says that Australians, more than people in many other countries, express nervousness about AI, and that could lead to over-regulation.\nThere are no specific laws or regulations that directly regulate AI in Australia.\nThe federal government is considering different reform options to mandate guardrails for AI systems deemed to be high risk, including introducing a new AI Act.\n+++\nIn the United States, multiple people have been injured in an attack in the city of Boulder in northern Colorado.\nWitnesses say a man threw bottles that apparently contained flammable liquid, which hit the ground and exploded in flames.\nA suspect is in custody and police are investigating what FBI officials immediately called a targeted terror attack.\nHowever, local authorities say it is too early to know the motive of the attack.\n+++\nThe Queensland government has launched a new tourism campaign ahead of the 2032 Olympic and Paralympic Games.\nA key focus of the plan achieving the goal to deliver 45 new ecotourism experiences by 2045, including new dark sky tourism experiences, light footprint accommodation and agritourism.\nPremier David Crisafulli says the plan would launch Queensland as a truly global tourist destination over the next 20 years, maximising the opportunity of the 2032 Games.\n+++\nExit polls released on the second round of Poland's presidential election shows the contest is too close to call.\nOfficial results are due later today.\nTwo exit polls shows the pro-European Warsaw mayor, Rafał Trzaskowski very marginally ahead of the historian and former amateur boxer Karol Nawrocki.\nMr Trzaskowski has claimed victory in front of cheering supporters in Warsaw.\nMr Nawrocki says it is too early to call the election result, but he believes he will win.\n+++\nIn football, Joe Montemurro will be the new coach of the Matildas.\nHe's signed a three year deal to be coach of the national side through the 2028 Los Angeles Olympics, a period which will also inlcude the 2026 Asian Cup on home soil, and the 2027 World Cup in Brazil.\nThe 55-year-old Aussie was most recently coach of French side Lyon.\nHe's previously coached English side Arsenal, Italian side Juventus, and A-League side Melbourne City to women's league titles.\nMontemurro's hiring ends the long search for a successor to Tony Gustavsson, who left after the Olympics last year.\nInterim coach Tom Sermanni will coach tonight's [[Mon 2 June]] game against Argentina in Canberra.\nMontemurro will take over after that, with his first game in charge being against Slovenia in Perth later this month.",
  "word_count": 636,
  "scraped_at": "2026-02-14T12:36:03.668516"
}