{
  "article_id": "4757933d930d",
  "url": "https://www.bbc.co.uk/sport/football/68322966",
  "title": "Women Super League : Man City take  big step  in title race",
  "date": "20240217T141500Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Manchester City have taken a \"big step\" in the Women's Super League title race, says manager Gareth Taylor.\nCity moved level on points with defending champions Chelsea at the top of the table with a 1-0 victory over their rivals at Kingsmeadow on Friday.\nThey are trying to win a first league title in eight years, with Chelsea scooping up four successive crowns under manager Emma Hayes.\n\"I'm really pleased, proud of the players,\" said Taylor.\n\"It's a big step for us. We have eight games to go, we're excited about the challenge and it's a big step, but that's all it is. It's three points and we move on to the next.\"\nIt was Taylor's first win at Kingsmeadow, a place which he admitted had \"frustrated\" him. And it came off the back of an ever-improving defensive record as City pick up a first victory here since 2016.\n\"We are really determined this season,\" he added. \"In the past, our performances have been quite good in certain games that we've lost or drawn but we've been a bit soft in those moments defensively. Now, there's a new-found determination in the team.\n\"We haven't hidden our ambitions about what we want to do. We go into every competition to win it. What Chelsea built here is what we're trying to achieve but it's really difficult.\"\n'Mentality shift' pushing City in title race\nTaylor was full of praise once again for 19-year-old goalkeeper Khiara Keating, who backed up last week's strong performance against Arsenal with several crucial interventions.\nKeating has played her role in City's defensive record, with this their third successive clean sheet in the WSL, while they have conceded just eight goals in 14 league games.\nThat could prove to be a crucial factor in their title challenge with the WSL's top scorer Khadija Shaw - who slotted in the winner - guaranteeing goals at the other end.\nFormer Manchester City striker Ellen White told BBC Two there has been \"a mentality shift\" at the club this season.\n\"They feel confident and believe they can come to Kingsmeadow and beat Chelsea,\" added White.\n\"I said I wanted to see more from them in the second half but what we saw was more of was game management.\"\nCity defender Alex Greenwood told BBC Sport before Friday's victory that \"not enough people were talking about\" her side in the title race but they have belief they can go all the way.\n\"I think we've always had what it takes,\" Greenwood said after the win.\n\"For us, it's about staying humble. We do what we do, and we stay focused. We should enjoy this, then we go again.\"\nChelsea defeat 'not the end of the world'\nChelsea boss Emma Hayes refused to be too downbeat after a rare defeat for her side.\n\"We've dropped points at home,\" she said. \"It's not the end of the world but we have to regroup with eight games left after the international break.\n\"You do lose football matches. We don't lose many, so yes of course it's disappointing, but you can't win every game.\"\nHer side remain top on goals scored and although she was \"disappointed\" by their reaction to conceding what she described as a \"poor goal\", there is clearly no panic from Hayes when it comes to the title race.\nShe says she has not taken any notice of the league table and hopes the return of injured duo Millie Bright and Catarina Macario will boost their run-in.\n\"It always has been [close]. I don't pay attention to [the table],\" added Hayes.\n\"I just focus on the performance. I just know we've dropped three points and an opportunity today.\n\"I don't think there's ever an easy defeat, let me be clear, but we all know it's a game of tight margins. We started the game really well, then we conceded a poor goal. I thought that affected us a little bit in the way we passed the ball.\n\"The disappointing thing from us was our final third play. I've never known these games to have a lot in them. The error falls in our way and they capitalised on that and defended well.\"\nChelsea captain Erin Cuthbert lost possession to gift City the opportunity to score the winner and accepted \"it is my mistake\".\n\"I will own that and know that when I come back off the international break, I will be raring to go,\" added the Scotland international.\n\"If there is one thing I will do is dust myself down and we will be ready.\"",
  "word_count": 762,
  "scraped_at": "2026-02-14T12:22:26.952633"
}