{
  "article_id": "47903a822d9f",
  "url": "https://www.comingsoon.net/guides/news/1292255-paramount-plus-schedule-june-5-11-new-tv-movies-being-added",
  "title": "Paramount Plus Schedule June 5 - 11 : New TV & Movies Being Added",
  "date": "20230602T210000Z",
  "domain": "comingsoon.net",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The 2023 UEFA Champions League final is the cherry on the top of the Paramount Plus schedule for June 5-11.\nOn Saturday, June 10, Manchester City and Inter Milan will clash in a much-anticipated soccer match that will conclude this year’s prestigious UEFA Champions League tournament in Istanbul, Turkey. Managed by Pep Guardiola, Manchester City is looking to capture its first Champions League after going close to winning it in a hard-fought match with Chelsea in 2021. While the Catalan-born football manager has won several trophies with Barcellona, it would be Guardiola’s first Champions League with Manchester City in case of victory. Inter Milan is the underdog going into the final, but the Italian team has already won the Champions League against all odds once with José Mourinho on the bench in 2010.\nFor all those who want to arrive prepared for the match, Paramount Plus has prepared a five-part original docuseries titled Destination: European Nights. The show features soccer journalist and CBS Sports analyst Guillem Balagué breaking down this year’s edition of the Champions League. The streamer will release four installments at once, while the fifth and final episode will premiere after the final on a yet-to-be-announced date.\nNext week’s schedule includes Warrior Women with Lupita Nyong’o. First released in 2019, the documentary focuses on the story of the Ahosi, an all-woman army. It stars Academy Award-winner actress Lupita Nyong’o as the narrator. Anna Cox directed and produced the project for Sandstone Global Productions.\nParamount Plus Schedule June 5-11 | New TV & Movie Additions\nMonday, June 5\n- Margaux\nTuesday, June 6\n- Destination European Nights premiere\nWednesday, June 7\n- Butterbean’s Cafe (Season 1)\n- MTV Movie & TV Awards\n- The Challenge (Seasons 37-38)\n- The Challenge: Untold History (Season 1)\n- Warrior Women with Lupita Nyong’o\nSaturday, June 10\n- UEFA Champions League Final – Manchester City vs. Inter Milan\nSunday, June 11\n- The 76th Annual Tony Awards\nCheck out more streaming release schedules below:",
  "word_count": 331,
  "scraped_at": "2026-02-14T12:54:47.043002"
}