{
  "article_id": "47b9ca19ff37",
  "url": "https://abc7.com/post/assessing-wnba-cba-negotiations-salaries-salary-cap/16367718/",
  "title": "Assessing WNBA CBA negotiations , from salaries to salary cap",
  "date": "20250509T170000Z",
  "domain": "abc7.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "ByKevin Pelton and Michael Voepel\nFriday, May 9, 2025\nThe most important action in the WNBA this season might take place off the court. The league and its players' association (WNBPA) have begun negotiations on a new collective bargaining agreement (CBA) -- the foundational document that defines the terms of the WNBA salary cap, roster sizes, eligibility and the length of the season, among other things -- after the WNBPA opted last October to terminate the current CBA at the conclusion of this season, two years before it was scheduled to end.\nThis CBA, agreed to in January 2020, set the table for the WNBA's rapid growth over the past five years, highlighted by the most-watched regular season ever on ESPN and arecord for merchandise sales. After the 2024 season, the league reached new broadcast deals that will bring in substantially more revenue.\nThe WNBA is also expanding for the first time in 17 years. The Golden State Valkyries join the league this season and two more teams (the Toronto Tempo and a Portland team that has yet to announce a name) will enter the league in 2026, with a 16th team on the horizon that will surely shatter the record for expansion fees shared by existing ownership.\nAgainst that backdrop, the WNBPA is ready for what president Nneka Ogwumike calls another \"transformative\" CBA.\n\"This league is transforming,\" Ogwumike told ESPN. \"As a players association, we want to evolve with it and have that be reflected in how players are taken care of and how our protections are not getting lapped by the evolution of this league.\"\nWNBPA executive director Terri Carmichael Jackson told ESPN she sees the CBA in similar terms.\n\"With the benefit of hindsight, when you read the earlier CBAs, one of the takeaways is that the players were forced to feel grateful just to have a league,\" she said. \"I believe we moved past that mindset in 2020. Our president, Nneka Ogwumike, and all of our player leadership are cognizant of the momentum we have and must seize.\n\"The stated goal for a 2026 CBA is transformational. Our hope is that the league and the teams are aiming for the same goal. In women's sports, it is particularly true that when the players win, everyone wins.\"\nESPN answers key questions about what both sides are seeking to achieve in the new CBA, what it might mean for the league, players and fans, and changes we want to see.\nKevin Pelton: The headline for any new CBA will undoubtedly be increased salaries for players. The last renegotiation boosted the maximum salaries for stars from $117,500 in 2019 to $215,000 in 2020, with the cap jumping by more than 30% from $996,100 per team to $1.3 million. Larger increases are likely this time thanks to improved WNBA revenue streams.\nOne team source said it's possible max salaries could reach $1 million, which would be an increase of approximately 300% from the current $249,244 supermax and would imply a salary cap in the range of $4 million to $5 million per team.\n\"No player has not talked about salary,\" Ogwumike said of her conversations with other players about the new CBA. \"But it's not just about the number. I think it's about the system, you know, creating a new structure around salary -- one that doesn't limit us the way it has in the past.\"\nSpecifically, players want to share in the gains of owners as the league grows. The current CBA featured 3% raises in the cap and max salaries -- as well as the minimums for players, locking them in to limited growth.\nThe past two CBAs have featured revenue-sharing targets with the potential to increase the cap that were not reached. The timing of the current CBA set those targets based on the pre-pandemic 2019 season and made revenue goals cumulative starting in 2020, when the league played its season in the so-called \"wubble\" at the IMG Academy in Florida without any ticket sales. As a result, even last year's boost in ticket sales didn't put players in position to achieve those targets.\n\"When we talk about salary and compensation, it's not just about the number,\" Ogwumike said. \"It's about revenue share and the salary structure. I think it's taken people a long time to understand that's how we've been thinking about it.\"\nPlayers will also seek to codify charter travel. When the WNBA first instituted private travel for all flights last May, it specifically said the change would apply through the 2025 season, setting it up as a negotiating point. Charter travel is a must for the players.\n\"It's here,\" Ogwumike said. \"I don't foresee a world where we can take this back. I see a world where we have to write it into the CBA. I think that's what the next step is now. It's been an amazing development in the last year, especially for health and safety, but we need to make sure that it's something that is foundational to our professional experience in the league.\"\nMichael Voepel: One thing that is a bit out of the ordinary is that two players on the WNBPA's executive committee -- the Minnesota Lynx's Napheesa Collier and New York Liberty's Breanna Stewart -- are also founders of Unrivaled. The 3-on-3 professional league, which played its inaugural season in January-March, does not see itself as a \"rival\" to the WNBA, but a stand-alone supplement to pro women's hoops in the United States.\nStill, is there concern about a conflict of interest for Collier and Stewart regarding what's best for their financial investment in Unrivaled and that league's players vs. the rest of the WNBA players? Jackson said she has not heard that to be the case from the WNBPA membership.\n\"In its inaugural year, Unrivaled secured a broadcast deal, attracted new sponsors and lucrative partnerships, invested in player resources, paid salaries that averaged $220K for a 10-week season, and almost broke even,\" Jackson said. \"Current players built Unrivaled, and while I am sure there are more than a few lessons learned, they showed us -- the union and the league -- a whole lot. What we've heard from our members is that Unrivaled sent a message, a strong message about the still untapped potential and resources in women's sports.\"\nVoepel: The owners won't speak publicly about specific things they are advocating for. But based on past CBA negotiations and discussions with sources familiar with the mindset of owners, we can speculate on where they might be drawing harder lines in negotiation.\nPrioritization -- the mandate that players show up on time for training camps and \"prioritize\" the WNBA above overseas commitments -- was a big issue in the last CBA. The players agreed to it to receive higher salaries in 2020. It seems unlikely the owners will back away from prioritization for this agreement.\nThere are some exceptions for prioritization -- including for younger players establishing themselves overseas and for those competing for national teams -- that could stay in place. But the owners say that the WNBA holding firm on prioritization brings more respect to the league, and that it has prompted some scheduling concessions from overseas leagues and FIBA events to not conflict with the WNBA season, when possible.\nThe owners probably also want to hold firm on the terms of the yearly draft, on maintaining a hard salary cap and on the core-player designation. These things allow teams to have as equal an opportunity as possible to secure and hold onto their players. The union's desire for the cap to soften could be a major source of contention.\nLeague revenue-sharing might be an area the owners are more open to amending so that the target required to trigger it for the players is attainable. As Kevin said, it's one thing to have revenue-sharing terms in the CBA, as has long been the case, and another thing to have those terms be realistically achievable.\nAnother area where the owners might be willing to make changes is how teams deal with injured players, for both short- and long-term periods, and how that affects the teams' ability to be competitive.\nIt's common to perceive ownership in any labor negotiations as the \"heavy,\" and WNBA fandom tends to side with the players they idolize. Realistically, there has to be give and take in all such negotiations, and WNBA ownership and player goals are probably not unreasonably far apart. But there will be some obstacles.\nPelton: The prioritization rule has been a flashpoint for players, who historically could make more money playing internationally than in the WNBA. The arrival of Unrivaled and Athletes Unlimited as opportunities to play professionally in the United States during the WNBA's offseason has changed the conversation to a degree, but prioritization remains a key issue for international players in particular.\n\"This is a record number of international players drafted in the first round,\" Ogwumike noted after three were selected last month, including No. 2 overall pick Dominique Malonga from France, matching the high-water mark from 1998 and 2000. \"They have a different upbringing when it comes to developing in basketball than a lot of the players that maybe choose to go to college or are local. I think closing that off, especially to younger players, it's stifling in a way that I think could actually hinder the talent that you see in the league.\"\nUltimately, the players want the WNBA to be a priority as well. They'd just prefer it happen by virtue of the league increasing salaries to a point that the league becomes the destination of choice for all of the world's best players, including those born outside the United States -- as we already see in the NBA.\n\"If there is a league that is paying you more, you would prioritize that league, you would think,\" Ogwumike said. \"I'm hoping we can lean more on the implementation of a new salary structure that can offer that as an opportunity for players as opposed to coming out, not giving them the investment that they deserve from a salary and compensation standpoint and then now having to try to decide where they want to play.\"\nPelton: WNBA rosters have been capped at 12 players since 2014. As the league grows, and particularly as the season extends to a record 44 games this season and perhaps beyond, we're overdue for more players per team. By contrast, NBA rosters consist of a maximum of 15 full contracts plus up to three more spots for players on two-way contracts that also split time in the G League.\nAlthough the WNBA maximum is 12 players, teams can also opt to roster 11, giving them more money to spend per spot while remaining under the league's hard salary cap. That puts them in jeopardy of falling to single digits because of injuries.\nOgwumike's Seattle team, for example, expects to start the season with 11 players. Katie Lou Samuelson's ACL injury during training camp means only 10 will be active. And the Storm have several players who could leave the team midseason to represent their countries in international competitions.\n\"I've played more years than I wanted to with only eight available players,\" Ogwumike said before Samuelson's injury. \"I don't think that's indicative of a pro league.\"\nWNBA commissioner Cathy Engelbert has argued to the players association that increasing roster spots isn't cost-effective for the league since more players don't create additional revenue in the same way as adding expansion teams to increase the number of WNBA jobs.\nThe CBA does provide hardship exceptions for teams to add extra players when they fall below 10 active, but even that can be complicated. In case of a last-minute illness, particularly common during the COVID-19 health & safety protocols in 2021 and 2022, players sometimes jumped on a flight and played the same day after being signed to a hardship contract.\nOgwumike says there's a better solution.\n\"I'm not saying go from 11 to 15,\" she said, \"but there was a time before I entered the league where 13 roster spots were available [most recently in 2008]. I find that incredibly reasonable, even if we incorporate perhaps an IR [injured reserve] component where you have players that are still within the system and you don't have a pool of players that are just kind of waiting to be called and jumping from team to team. I think that there's a more efficient way to do that with new language around roster size.\"\nVoepel: The rules for draft eligibility might need to be updated and simplified. The way it is now, along with college seniors, juniors who turn 22 in the year of the draft or are set to graduate within three months of the draft can declare. Meanwhile, international players who don't play in the United States college system are eligible if they turn 20 in the year of the draft.\nPerhaps the WNBA could consider having similar rules to MLB and college baseball, where players are draft-eligible after their junior season or when they turn 21, whichever comes first.\nThat way, women's basketball players would still be in school for at least three years, but there wouldn't be what seems like an arbitrary disparity between which juniors can leave early and which can't based simply on birthdate. With the advent of name, image and likeness (NIL) deals changing things so much financially for college players, many could opt to stay four seasons anyway.\n\"That's come up in conversations, especially after the NWSL has done away with a draft,\" Ogwumike said of the age-limit rules and the National Women's Soccer League. \"I don't foresee [ending the draft] in basketball. I think it would just be a little bit more complicated for us to do it that way. But it's been in conversation, exploring what the age limit can be.\n\"There are going to be a lot of different things that change the composition of our league. You see more international players. Even the footprint of our league -- we're expanding teams, we're adding games. There are going to be so many different variables that kind of contribute to what perhaps could be a change in age limit.\"\nPelton: The biggest difference in structure between the NBA and WNBA is the latter's hard salary cap, which is more comparable to the NFL among major American pro sports leagues.\nSince the early days of the NBA salary cap, introduced in its modern form in 1984-85 when the league was booming economically like the WNBA is now, a variety of exceptions have allowed teams to exceed the cap to re-sign their own players, make trades and add lower-priced free agents. Over the past three decades, the NBA has sought to reign in higher-spending teams with a luxury tax first introduced in the 1998-99 CBA and more recently limitations on the exceptions for teams paying substantial taxes.\nGoing from the WNBA's hard cap to the NBA's complex, at times Byzantine series of rules rewritten and expanded over decades isn't realistic and might not be desirable. The NBA's CBA is nearly twice as long as its WNBA counterpart (676 pages vs. 350 for the WNBA) and requires teams to find cap analysts who specialize in understanding the rules and how to take advantage of them.\nStill, as the role of general manager becomes specialized in the WNBA after long being held primarily by head coaches, front offices would like more room for creativity. Team and player options would be a relatively easy change to mirror NBA contracts. Currently, team options exist only as part of rookie contracts for draft picks and can't individually be negotiated.\nSome degree of ability to exceed the salary cap via trade would also facilitate midseason deals and turn the trade deadline into the kind of hype-building event it is in the NBA and other leagues. The three in-season deals in 2024 were the first time there were multiple during the same year since 2018.\n\"I feel like this is more of an argument for the teams than the players, at some point,\" Ogwumike said. \"It's amazing to see what some of these general managers are able to do with the limited number of roster [spots], with the hard cap and put championship-level teams together.\"\nPelton: Collier made headlines in March when she answered a question about a possible stoppage of play from Alicia Jay on the show \"We Need to Talk\" by saying it was \"something that we're talking about internally.\"\n\"We have to stand strong in what we believe in, too,\" Collier said. \"We have to stand up for what we feel is right and what we deserve. While we don't want that situation to happen, of course, I think we're prepared for any possibility right now.\"\nWithout specifically discussing the possibility of a lockout, Ogwumike echoed Collier's message about the importance of preparation, knowing the negotiations can take time.\n\"We're anticipating negotiations to be finished in time for us to start the 2026 season on time,\" Ogwumike said, \"but it doesn't mean that players aren't being more meticulous about spending and saving, understanding that we are in a negotiation. ... The situation we're in means planning ahead, planning for contingencies is something that we can't ignore, but it's not something we want or expect.\"\nThere's a precedent for CBA negotiations to result in a brief offseason lockout that doesn't affect games. In 2014, a deal was struck on Feb. 15, pushing back the start of free agency more than a month. The interesting part of this year's timing is that the WNBA must hold an expansion draft before the start of free agency. Last year's draft for the Valkyries was held on Dec. 7. That could serve as an incentive to get a deal done earlier than previous CBAs, which were all completed after New Year's Day.\nVoepel: Dating to the first CBA in 1999, there have been five in the WNBA. The only one that was close to down-to-the-wire was in 2003, when the agreement came on April 18, the draft was April 24 and the season started May 22. The league had threatened to potentially cancel the season if an agreement wasn't reached by April 18.\nCoquese Washington, the first WNBPA president, was instrumental in negotiations for the first two CBAs, which came during her WNBA playing career. Now head coach at Rutgers, Washington spoke with ESPN this week about her memories of the process in 1999 and 2003, which set the groundwork for all subsequent WNBA labor negotiations.\n\"I don't think we ever felt like the deal wouldn't happen or there would be a work stoppage, though we were prepared for it,\" Washington told ESPN regarding 2003. \"We felt like both sides did not want to disrupt the momentum of the first CBA and of the league.\n\"The first CBA was really about establishing the WNBA as a truly professional league that was going to stick around. The second agreement, the main sticking point was free agency, which was added that year.\"\nWashington and Val Ackerman, the first WNBA president (the title changed to commissioner with Engelbert), both worked on the first two CBAs. Washington says she thinks their familiarity was helpful, and that it's also a good thing for these negotiations that Engelbert, Jackson and Ogwumike -- all of whom were in the same positions for the current CBA -- have been through the process before.\nWashington is proud that each subsequent CBA has built on improvements made for players and the league in the previous agreement.\n\"We were able to add things like year-round health care and maternity leave early on,\" she said. \"Every CBA has expanded the sphere of what it means to be a professional women's basketball player in this country.\"br/]\nCopyright © 2026 ESPN Internet Ventures. All rights reserved.",
  "word_count": 3317,
  "scraped_at": "2026-02-14T12:19:50.756383"
}