{
  "article_id": "47c535421cb2",
  "url": "https://www.walesonline.co.uk/news/wales-news/full-story-four-days-welsh-28725117",
  "title": "The full story of the four days the Welsh Government dawdled ahead of the Wales Scotland Six Nations game in Cardiff",
  "date": "20240311T150000Z",
  "domain": "walesonline.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The full story of the four days the Welsh Government dawdled ahead of the Wales Scotland Six Nations game in Cardiff\nTwo major Stereophonics gigs also went ahead in Cardiff with thousands of fans less than 10 days before the UK went into lockdown\nCardiff's High Street and St Mary Street were packed with Scotland rugby fans in kilts and scarves enjoying beers from the pubs lining the street. It looked like a familiar scene from any Six Nations rugby weekend in the Welsh capital. Except there was one difference.\nThere was no game because the UK stood on the brink of a pandemic. Instead of a packed Principality Stadium rocking to the sounds of Mae Hen Wlad Fy Nhadau and Flower of Scotland, fans stayed in the pubs before catching their flight home.\nThe question many were asking at the time and are still asking four years later is why the Welsh Government had not stepped in to cancel the game in time to save the Scottish fans a trip, to avoid giving the then little understood Covid virus a chance to spread and to save the WRU from having to step in to make a decision most people were baffled had already been made.\nREAD MORE: Live updates as Vaughan Gething questioned at UK Covid-19 Inquiry in Wales\nREAD MORE: The most shocking revelations from the Covid Inquiry in Wales\nWe've pieced together everything we know about the Welsh Government's dithering in the days running up to that Saturday, March 14. Although the WRU cancelled its game, the Stereophonics band's gig that night in Cardiff's Motorpoint Arena did go ahead with 5,000 fans. And one followed the following night, Sunday the 15th, leading to heavy criticism.\nCovid-19 had officially been declared a pandemic on March 11. The World Health Organisation's director general said on that date: \"There are now more than 118,000 cases in 114 countries, and 4,291 people have lost their lives. Thousands more are fighting for their lives in hospitals. In the days and weeks ahead, we expect to see the number of cases, the number of deaths, and the number of affected countries climb even higher.\"\nThe following day, on Thursday, March 12, Welsh Labour cancelled its planned party conference in Llandudno with the party saying the Welsh Government needed to \"devote its full attention to responding to the coronavirus outbreak\". But it still said the Six Nations game, complete with 74,000 fans, should go ahead. That's something the Covid-19 inquiry has heard deputy minister Lee Waters said was \"\"odd signal to send\".\nOn Thursday March 13, Mr Gething and Dr Frank Atherton gave another press conference. In that Dr Atherton said \"another six cases\" had been identified on that day, taking the total cases to 25. He said that continuing rise was \"an expected trajectory\". \"We are expecting to see more cases in all nations of the UK and Wales is going to be exception. We do believe there is community transmission of the virus now,\" Dr Atherton said. \"We have to prepare for a significant number of cases here in Wales. We are expecting cases to start rising, probably in early April and there may be a peak in May and June.\"\nDr Atherton said it had been determined the UK was now in a \"delay phase\" rather than containment. He said the \"best precaution\" for people to keep themselves was to wash hands but that now the virus was circulating, the advice from March 13 would be that people in Wales and across the UK who have new symptoms of a cough or fever will be asked to self-isolate for seven days. \"If you're ill, the best thing to do is to self-isolate\". He said people needed to prepare, such as what do they need to have in place at home to follow the advice. \"It will involve personal sacrifice, it will involve people not going to work, not going to school.\"\nAlready, they were talking about \"moving\" the peak into the summer but were not in the \"mass testing\" phase that came in later weeks.\nMr Gething was asked in the press conference about the decision. He said there was evidence that cancelling mass events \"really makes a difference in either significantly delaying the peak of the outbreak or saving life\". He said: \"There isn't public health advice available to us that we have available to us as decision-making ministers that says it's the right thing to do for the public to cancel those events\".\nHe said the Scottish Government had said from the following week they wanted to stop large events, but that was because of the potential impact on emergency services who needed to be available for \"planning and preparing\" for the pandemic.\nHe said: \"That's something we're actively considering. We may make the same decision as well. For this weekend, even if the Six Nations game were taking place in Scotland from their governmental position they're talking about ending those large events or pausing them that isn't where they are. The game would still go ahead. It's really important that members of government around the UK and oppositions take a responsible approach and don't try to suggest there is public health advice to take a step when that advice just doesn't exist.\" For the latest politics news in Wales sign up to our newsletter here.\nAddressing calls from Plaid Cymru to cancel the game, Mr Gething said: \"There has to be a proper basis to make choices, it can't be headline grabbing hunches. There has to be a real evidence. We're looking at saving peoples lives.\"\nMr Gething said different governments could make different choices but \"we're having those conversations\". Dr Atherton told the press conference the disease was new, and \"the only way to acquire immunity, given there is no vaccine and is unlikely to be for a year, is to get the disease\".\nOn Friday morning the WRU said the game would go ahead as planned. But then, five hours later at 2.11pm, the Welsh Rugby Union tweeted a statement saying the game was off. Their statement read: \"The Welsh Rugby Union has maintained an open dialogue with, and continued to seek advice and direction from, the Welsh Government and other stakeholders, including the Six Nations, on this fast-moving issue.\n\"Whilst medical advice remains consistent, we have decided that it is in the best interests of supporters, players and staff to fall in line with recent measures taken across the UK and global sports industries. The WRU would like to thank all parties for their counsel on the subject and will make further announcements with respect to rescheduling the fixture in the coming days.\n\"Every effort has been made to stage this game and we appreciate that individuals will have been inconvenienced. Given the fluid and unprecedented nature of this issue a postponement became the only viable option.\" You can read the background to the WRUs decision here.\nThen WRU chief executive Martyn Phillips said in a retrospective interview a year later that the Welsh Government played a big part in the decision. Phillips recalls: \"The Welsh Government came out and said this is clearly escalating but we are not at a point where we think we need to postpone events, although that could happen in the weeks ahead. So the narrative had changed, but it hadn’t changed for the weekend.\n\"The government were happy for the game to go ahead and I think [health minister] Vaughan Gething said he was planning to be there. On the back of that, we had our board meeting at lunchtime on the Thursday.\n\"It was definitely one of those 51-49 decisions where we are sitting there and saying this is really, really marginal. But the Welsh Government were saying they were happy for the game to go ahead. So on what basis would we choose to go against that?\n\"There were different voices on the board, but on balance we decided to go ahead. So we came out of that meeting and ordered all the food for 75,000 people, plus all the drink and away we go. We then put out a statement saying we had decided to go ahead with the game.\"\nAlmost immediately the Premier League and the Football League announced they were suspending fixtures until April 3, along with the women’s Super League and Championship, England’s Test series in Sri Lanka was called off and in golf the Masters was postponed.\nThe first death from Covid was reported on March 15, when a 68-year-old Wrexham hospital patient died.",
  "word_count": 1432,
  "scraped_at": "2026-02-14T14:10:01.550895"
}