{
  "article_id": "47c8bfe5b3fb",
  "url": "https://www.jamaicaobserver.com/2025/11/30/the-impossible-task/",
  "title": "THE IMPOSSIBLE TASK - Jamaica Observer",
  "date": "20251130T063000Z",
  "domain": "jamaicaobserver.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "‘FORGED IN FIRE’\nSpeid chronicles career leading up to crucial crossroads in Jamaica’s World Cup qualifying tale\nRudolph Speid comes across as a man unfazed by the weight of pressure — a quality he credits to a lifetime of solving problems and embracing challenges.\nIt is for this reason, even now, with Jamaica facing an uncertain FIFA World Cup play-off assignment in March, that Speid, who was recently appointed interim head coach of the national men’s senior team — the Reggae Boyz — is tackling the task with a quiet certainty and calm confidence.\nHe has lived versions of this moment before. From decades of navigating high-stakes boardrooms in corporate Jamaica to the trenches of local and regional football fields, Speid admits he is energised by a good challenge.\nWith Jamaica on the brink of missing out on its best chance at a second World Cup appearance, Speid views the moment not with panic, but with purpose, as another complex puzzle waiting to be solved.\n“I think I was forged in fire,” Speid told the Sunday Observer as he looked back at years of high-pressure assignments, some praised, others criticised; nonetheless, moments he says have shaped the coach he has become.\n“I see this as me trying to solve a problem,” he said. “There is a big problem now, and when I look around me I think I am probably the best one suited to solve this problem.”\nThe Jamaican was catapulted into the role after the resignation of Briton Steve McClaren, who stepped down following Jamaica’s disappointing 0-0 draw with Curaçao at the National Stadium on November 18, a result which ended the team’s chance of automatic qualification.\nNow the Reggae Boyz face a treacherous last-chance route — New Caledonia on March 26, and with a win, DR Congo on March 31, both matches in Mexico — in a win-or-go-home date with destiny.\nFor Speid, the next four months will represent more than an audition of his coaching credentials. They represent a national duty, a lifetime’s build-up, and an opportunity to solve yet another seemingly impossible problem.\n“Most people only look at the football itself, but I don’t,” he said. “This means so much more to Jamaica. Financially we struggle. Everyone knows we have 11 national teams and only one makes money — not even the women’s senior team — and then we have a lot of teams and leagues that we need to develop, youth programmes that need attention. A lot of times we have to neglect those to pay for the senior teams to go on their journey. So, financially, not qualifying would be a disaster!”\nBut who truly is the man charged with redirecting Jamaica’s football future? What is it that drives him? How did we get to this point?\nSpeid’s journey began in Portland — a simpler time.\n“The sea was always there, lots of rivers, my family had a farm…there was always something to do,” he recalls.\nAt Titchfield High School, where he rose to deputy head boy, football was part of the rhythm of his upbringing.\nBut the moment that planted the coaching seed came not from a game, but a familiar voice.\nDonald Davis, the brother of Paul “Tegat” Davis, a man who had played alongside Pelé at the New York Cosmos, was the first coach to truly shape him. Davis demanded discipline, welcomed ideas, pushed players to think, traits Speid has employed in his own approach.\nHowever, coaching was not Speid’s plan ‘A’.\nAt 18, he joined the Jamaica Gleaner. Later, while working at Wisynco, a cousin involved in community outreach dragged him along to “help coach some youths” in Willodene, St Catherine.\n“They weren’t really youths, they were big men,” he laughs, but that was his start.\nFrom St Catherine to a return to the\nGleaner, then into Business House football and eventually Cavalier, Speid built a portfolio of success.\nHe led Cavalier from the Syd Bartlett League back to the Premier League. He collected over 60 titles across youth, senior, and Business House football. But he is adamant that those raw, early successes weren’t what shaped him. Failure did.\n“I thought I knew everything. But when Cavalier got relegated, I realised I didn’t know the game as well as I thought,” Speid shared.\nIt sparked a transformation. In 2018, he pursued coaching education relentlessly — Concacaf B, then the A Licence, becoming the first Caribbean coach to pass the examination. His coaching methodology evolved from instinct to science.\n“It really opened my eyes even more about how things are done, so it’s just something that I am very comfortable doing. Doing things that no one has done before, crossing a new frontier, whenever there is a problem, that is when I start working,” Speid added.\nHe insists, however, that his foundation lies in 30 years of corporate leadership. At 29 he was sitting in boardrooms with titans such as Oliver Clarke, Douglas Orane, John Issa, and Joseph Matalon. Impossible tasks became his speciality, once winding up an entire pension scheme in a year.\n“I don’t think anyone else in Jamaica has done that.”\nThat mindset now shapes his football philosophy.\nClose to success, closer to controversy, Speid’s decision to accept the job as interim head coach is the latest example of his willingness to step into volatile situations others might avoid.\nDespite an overwhelming 8-1-1 vote by the Jamaica Football Federation Board in favour of his ascension, the development has not arrived without complaint in some circles.\nAs chairperson of the JFF’s Technical Committee, Speid would have been integral in identifying and recommending McClaren and Heimir Hallgrímsson before him, coaches who both failed to live up to expectations.\nSo why should he now get the job?\n“We would have given the board, let’s say, four names, and the board would then choose one. Sometimes it’s not that the board doesn’t want to choose the best one — or the one people think is the best football-wise — but there could be a number of factors such as affordability.\n“The last two coaches that came, I thought it was a mixed bag, and we still have to give the coach some of the blame — we should take responsibility, the coach has to take responsibility, but the players also have to take responsibility. I don’t think I should take all the blame, everyone has to share it,” Speid pushed back.\n“I was never there to insist, I was always there to assist, and I assisted, but he [McClaren] had the last say in everything, so I couldn’t force,” Speid said in defence of his culpability given his former role as McClaren’s technical advisor.\nAs technical director and principal at Jamaica Premier League champion Cavalier, there is also a strong case to be made about the potential for a conflict of interest.\nSpeid did not mince his words, pointing out that since his time inside the JFF, there has been no influx of Cavalier players, adding that his consistent success comes from selecting the best, not favourites.\n“I have always said, just name one occasion that you know that I have used my post to benefit myself or my club and then we can have a conversation from there,” he said. “There has been none!\n“When I was named the advisor, they said we would have an influx of Cavalier players, it hasn’t happened. When I was named the chairman of the Technical Committee, they said it would happen, it hasn’t. So there is no evidence or indication that this would ever happen.\n“But this is just me talking; what about my actions? For somebody who has won 60 titles and 10 runners-up, do you really believe that this happened by me cherry-picking players? My record tells you that I pick the person who can do the job.”\nSpeid shared that he will be taking a leave of absence from his role on the JFF’s Technical Committee and at Cavalier once his tenure begins on December 15.\nOf note, the JFF’s Constitution is silent on the matter of being a coach while holding other roles within the federation, but there is a Conflict of Interest Policy that outlines procedures for recusal and separation of duties.\nWith more Jamaican coaches than ever achieving certification and greater access to education, Speid also believes that the time is right to return the reins to a coach from the soil.\n“Since 1998 we have tried a lot of different combinations,” he said. “People would say I picked this coach, but we have tried numerous coaches over the years and none has been able to do the job to take the team to the World Cup.\n“We have brought in coaches from overseas for U-17, U-20 — every single team you can think of — and since 2001 the only other coach who carried a male team to the World Cup was Wendell Downswell in 2001 with that U-17 team,” said Speid.\n“We have gone over the programme since 2018 and we have developed our local coaches to a higher level. We have a lot of A-licensed coaches, there are four of us doing the Pro Licence, so there was always a plan for Jamaican coaches at some stage to, again, get the opportunity to show what they are worth.”\nWith Jamaican football facing its biggest moment in almost three decades, Speid says that unity and commitment are the most important elements going forward and will form the identity of his programme heading into the play-offs.\n“Whatever is going to happen, Jamaica can be assured that there will be no compromise,” he said. “We will be uncompromising about the players that we put on the pitch and I expect the players to be uncompromising with any opponents that they play against.\n“I can assure that whatever debacle that used to happen, these players will come to the pitch giving 100 per cent. There will be no 90 or 85 per cent players — they will come out 100 per cent to give everything towards Jamaica’s effort.”\nDisappointment fresh in the minds of Jamaican supporters, expectations may not be at its highest, but for Jamaica’s new head coach, this is the perfect opportunity to fix a problem, one that his critics will say that he himself played a role in creating.",
  "word_count": 1724,
  "scraped_at": "2026-02-14T12:50:51.708414"
}