{
  "article_id": "47f94b6cd6fc",
  "url": "https://www.sailingscuttlebutt.com/page/3727/",
  "title": ">> Scuttlebutt Sailing News : Providing sailing news for sailors",
  "date": "20250609T220000Z",
  "domain": "sailingscuttlebutt.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Published on February 12th, 2026\nUS Sailing has revealed the 2025 Rolex Yachtsman and Yachtswoman of the Year Awards, with Paul Cayard and Laura Grondin recognized for the most outstanding performances in sailing by American athletes over the past year. A ... Read More →\nPublished on February 12th, 2026\nThe 2026 Women’s Winter Invitational Regatta (WWIR) returns on February 14-15 in San Diego, CA. As one of the earliest established women’s sailing challenges in the country, this invitation-only event celebrates competition, camaraderie, and the advancement ... Read More →\nPublished on February 12th, 2026\nDaniel Rugg, husband, father, grandfather, brother, Naval officer, and lifelong competitive sailor, died on February 6, 2026, at his home in Centreville, Maryland, after battling cancer for several years. He was 80. An adventurous soul with ... Read More →\nPublished on February 12th, 2026\nROCKWOOL Racing SailGP Team, one of 13 teams competing the SailGP global sports league, has been acquired by leading sports investor and American Magic Co-Founder, Doug DeVos. The transaction brings together leaders in global business and ... Read More →\nPublished on February 12th, 2026\nYachting World has been asking top sailors and marine industry gurus to choose the coolest and most innovative yachts of our times, and professional sailor Luke Parkinson nominated the Superfoiler. Here’s the report: “The Superfoiler was ... Read More →\nPublished on February 11th, 2026\nIf you think you’re overlooked, think of Whistler’s father. Providing “insight” since 1997, the Curmudgeon’s Observation has been a hallmark of the Scuttlebutt Newsletter which delivers a digest of major sailing news, commentary, opinions, features and ... Read More →\nPublished on February 11th, 2026\nLuke Lawrence, often seen at the top of professional events, has heritage in hard water racing too as the New York Times reports: It looked like a time warp on the frozen Navesink River in New ... Read More →\nPublished on February 11th, 2026\nDave Perry’s 100 Best Racing Rules Quizzes highlights specific aspects of the racing rules in a fun format designed to help you become more familiar with The Racing Rules of Sailing. Here is one of the ... Read More →\nPublished on February 11th, 2026\nAfter damage reduced the SailGP field to 10 teams in the opener, all 13 boats look to be back for the second event on Feb 14-15 in Auckland, New Zealand. Here are five things to watch ... Read More →\nPublished on February 11th, 2026\nClubs, classes and top sailors are increasingly turning to helmets. In the New Zealand publication YBQ, Kathy Young talks to the experts about what’s driving the shift, what they actually protect, and how to choose the ... Read More →",
  "word_count": 450,
  "scraped_at": "2026-02-14T12:11:21.042997"
}