{
  "article_id": "47fbd0c2e57d",
  "url": "https://www.canberratimes.com.au/story/8740078/canberra-united-signings-heyman-looks-set-to-leave-canberra-for-west-ham-united/?cs=14329",
  "title": "Canberra United signings : Heyman looks set to leave Canberra for West Ham United | The Canberra Times",
  "date": "20240831T034500Z",
  "domain": "canberratimes.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "- Fixtures: Scroll to the bottom of the page to see Canberra's 2024-25 season fixtures\n- Signed: Sally James, Coco Majstorovic, Georgia Ritchie, Hayley Taylor-Young, Ruby Nathan, Sofia Christopherson, Michelle Heyman, Elizabeth Anton, Mary Stanic-Floody, Aideen Keane, Jynaya Dos Santos, Tegan Bertolissio, Darcey Malone, Alex McKenzie, Bethany Gordon, Maja Markovski, Emma Robers, Madison Ayson.\n- Departed: Nikki Flannery (Melbourne Victory), Emma Ilijoski (Hearts Women - Scotland), Chloe Lincoln (Western United), Sasha Grove (Western United), Vesna Milivojevic (IFK Norrkoping), Deven Jackson (Newcastle).\nMadison Ayson has made a dash from the other side of the world to help bolster Canberra United's defence.\nSubscribe now for unlimited access.\nor signup to continue reading\nAnd even though she's only been in the country for a few day's, the 23-year-old is a chance of making her United debut on Saturday against the Central Coast Mariners.\nCanberra travelled to Gosford on Friday afternoon, with Ayson part of the squad that made the trip.\nShe'll be given until the 11th hour before deciding if she'll play.\nJagarinec's been trying to bring Ayson to Canberra for almost two months, but had to wait until her NWSL club Houston Dash's season ended.\nThat patience has finally paid off and she's on the verge of her A-League Women's debut.\nUnfortunately, personal reasons mean Jagarinec will not make the trip to Gosford, with his assistant coach Ahmed Ugool to take charge.\nIt will be Ugool's ALW coaching debut.\n\"We finally got her. We probably first spoke to her about 6-7 weeks ago and just lining up international contracts and NWSL contracts ... and finally made it all work and got her here this week,\" Jagarinec said.\n\"Definitely in the mix [to play Mariners]. She's fit - she's come off a season.\n\"She's available for this weekend. She looked good at training last night and this morning so she'll travel.\n\"Then depending on how she feels [Saturday] morning we'll make a decision if she'll be on the team list or not.\"\nThe centre back will slot into United's backline, alongside the likes of Elizabeth Anton and Alex McKenzie.\nJagarinec wanted to bolster Canberra's defence to reduce the number of goals they concede.\nIt's been a promising start for United, who sit fourth on the ALW league.\nThey take on the sixth-placed Mariners, who have drawn their past three games.\n\"Bolster it and calm it down a little bit too,\" Jagarinec said of Ayson's addition to his defence.\n\"I haven't made it a secret we want to try to not concede as many goals as we have last year.\n\"Hopefully that last addition to the squad helps us do that and we work on moving forward with the ball, and scoring more goals.\"\nUnited will be without their taliswoman Michelle Heyman, who's in camp with the Matildas for two weeks.\nHeyman didn't play in the 3-1 loss to Brazil on Thursday night, but could feature in the remaining game against Brazil or the following two against Chinese Taipei.\nNew Zealand international Ruby Nathan will come into the squad to cover for Heyman, but Jagarinec was yet to decide who would come into the starting 11.\n\"Ruby Nathan will come back into the squad and we'll make a decision [Friday] night about who will start the match,\" he said.\n\"She's a like-for-like player, probably just a few years younger and a little bit less experienced, but Ruby's got all the makings of being the next Heyman for sure.\"\nA-LEAGUE WOMEN ROUND FIVE\nSaturday: Canberra United v Central Coast Mariners at Gosford, 4pm.\nCanberra strikes gold to recruit a goal-scoring freak\nA two-time A-Leagues winner will join Canberra United this season as a goal-scoring partner to Michelle Heyman after Maja Markovski agreed to move her career to the capital.\nUnited finalised her deal on Tuesday more than a week after the former Melbourne Victory striker was first linked to a stint in Canberra.\nShe is the 16th player on the Canberra roster for the 2024-25 campaign, with fellow NPL Victorian star Emma Robers following the same path after signing a deal with United on Wednesday.\nUnited's signing spree has continued over the past week, adding Alex McKenzie and Bethany Gordon to coach Antoni Jagarinec's squad, which is about to start training.\nMarkovski won two A-League titles in the 2020-21 and 2021-22 seasons and scored 20 goals for Bulleen in the Victorian NPL this year.\nBut her role in the A-League has been more of a bits-and-pieces player during her stint with the Melbourne Victory. She decided to move to Canberra to make a name for herself and ease the pressure on goal-scoring guru Heyman.\n\"I am extremely excited about the opportunity to come to Canberra and play for United,\" Markovski said.\n\"I am looking forward to joining up with my new teammates and getting the opportunity to train with them and to enhance my game under Antoni and his coaching staff. I can't wait to get started.\"\nJagarinec added: \"Maja also has extensive A-League experience having shown her quality with Melbourne Victory.\n\"As with most of the signings we were looking at for this season, Maja fits the profile of being a young player who has played plenty of A-League matches and has the quality to succeed at this level.\"\nBut Canberra United has lost New Zealand international Deven Jackson, who has signed a one-year deal with Newcastle.\n'Streetwise nous': Canberra United sign Perth defender\nCanberra United has bolstered its defence with the signing of \"streetwise\" New Zealand international Elizabeth Anton.\nAnton's not only played 18 games for the Football Ferns, but she's also played 62 A-League Women games for the Perth Glory as well.\nShe's United's eighth signing, following in the wake of the retention of Matildas striker Michelle Heyman - despite the ALW's all-time leading goal-scorer almost joining England club West Ham in the off-season.\nCanberra coach Antoni Jagarinec's trying to end their three-year finals drought and rebuild the side following the loss of a raft of key players.\nVesna Milivojevic, Nikki Flannery, Chloe Lincoln and Emma Grove have all departed since the end of last season.\nIronically, Anton scored her first ALW goal against United - in a 1-all draw at Viking Park in January 2021.\n\"I am looking forward to working with her during the season,\" Jagarinec said. \"She brings a wealth of experience with her and will be a big addition to the squad.\"\nAnton made her New Zealand international debut in 2017.\nThe real story behind Heyman's 'wild' contracts and photo leaks\nLet's clear up a couple of Michelle Heyman facts first. Yes, she posed in a West Ham jersey.\nYes, she trained with the team, did the medical and was about to put pen to paper on a four-month deal to play in England in what has become the world's best competition.\nBut no, she didn't sign the contract and she was as shocked as anyone when promotional images of her in West Ham kit started circulating on the weekend.\nBecause for about the past two weeks, her deal with Canberra United had effectively been signed, sealed and delivered because \"deep down inside, Canberra has my heart\".\nHeyman stunned the soccer world when she committed to a one-year extension with Canberra United on Wednesday, spurning offers from overseas and domestic clubs trying to lure her away from the capital.\nThe greatest goal-scorer in A-League Women's history said the chance to stay in Canberra was too good to turn down despite being flattered, and almost moving abroad, but interest elsewhere.\nIn fact, Heyman was about to sign a short-term deal with West Ham and had informed Canberra of her intentions to start the season there, then return home for the second half of the A-League season.\nThat's where her move to England hit a hurdle. The length of the contract meant she would be outside the transfer window and without a contract anywhere from December to April if she signed with West Ham.\nCanberra United put Heyman's best interests at heart, and were so keen for her to get a taste of Women's Super League action that they asked the Australian Professional Leagues and Football Australia to make an exception for Heyman to make a move outside the transfer window.\nThe request was denied and Heyman's fate was sealed - luckily for Canberra that meant the 36-year-old staying in green for at least one more season.\n\"Canberra is home. Canberra is my love,\" Heyman said.\n\"I've given everything to this club and I want it to be successful. I want it to be here for 20 [more years], I want the next generation of kids to have a team in Canberra, I want to them to aspire to be professional athletes.\n\"I want them to live the dream that I've been living, and to do that is to be here at home. Give my all to Australian football and make it bigger.\n\"[Offers came] from everywhere, and it was wild to get so many emails from different clubs wanting me. It was a really nice feeling, but deep down inside Canberra has my heart. It just feels like home being here.\"\nHeyman is now the cornerstone of coach Antoni Jagarinec's squad, which is starting to take shape two months before the opening round of the season.\nIt was a huge relief to Jagarinec when Heyman committed. It gives him experience. It gives him a leader. It gives him a Matilda. It gives him a goal-scoring freak for his first season in charge.\nIt also eases concerns about the future of Canberra United (at least for this season), which lingered near the end of last season as Capital Football weighed up whether to continue running the team beyond the 2023-24 campaign.\nHeyman spoke of her, and her teammates', frustrations, but said all of those issues had been resolved and she was keen to move forward.\n\"If you asked me [if I would stay in Canberra] five months ago I would have been unsure just because of how shocked we all are about the future of this club,\" Heyman said.\n\"But to keep this club, I want this club to stay around. I don't want to see another A-League Women's team fold ... it would be heartbreaking.\"\nCapital Football chief executive Samantha Farrow was the first to notice the A-League Women's transfer window didn't line up with the proposed deal West Ham was offering Heyman.\n\"To get an opportunity in the top league in the world at my age was something I didn't think would happen,\" Heyman said.\n\"So I went to West Ham, I did the testing. I did it all, and w were very close to making it happen.\n\"...Playing games is more important, and to just play three months and then be unsure ... [would it] jeopardize me being in the national team, the rest of my career ... I'm not just a number to [Canberra United].\n\"I am family. I am grateful for the support Canberra United has had for me during this process.\"\nHeyman is viewed as a critical cog in Canberra's hopes of success on the field, and their plans to lift themselves out of the red off the field.\nHer signing will undoubtedly be a timely boost for the club's membership drives and as one of the only Matildas players in the A-League Women's, her playing will hopefully boost ticket sales as Canberra targets a record average crowd attendance this season.\nIt wasn't that long ago that fans, players and administrators feared for the future of the team. The ongoing delays for Canberra's bid for an A-League Men's licence impacted Capital Football's ability to plan beyond last season.\nIt prompted fans to raise $84,000 online to contribute to the team's operating costs, but it's unclear how that money what that money will be used for.\n\"Sam's done a wonderful job being able to reconnect Capital Football with Canberra United and get people supporting Capital Football as well,\" Heyman said.\nFarrow has committed to spending the entire $600,000 salary cap, despite a reduction in funding from the Australian Professional Leagues. Heyman's deal sits outside the $600,000 cap as a marquee contract.\n\"Having someone like Michelle Heyman helps you [win football games]. We wanted the best for Michelle Heyman, the best for her football and to extend her career as long as possible,\" Jagarinec said.\nTEEN SENSATION CHASES DEBUT\nTeenage sensation Georgia Ritchie is hoping her \"truly special\" contract will pave the way for her to break into the Canberra United side after signing an A-League Women's deal.\nRitchie is the third player to be officially confirmed on United's roster ahead of another rebuilding season with Antoni Jagarinec to take the coaching reins this season.\nJagarinec is starting with a goal-keeping base, with Ritchie to join Coco Majstorovic and Sally James as the three shot-stoppers on the United roster.\nCANBERRA UNITED FIXTURES\nNovember 2: Canberra United v Brisbane Roar at McKellar, 3pm\nNovember 10: Wellington Phoenix v Canberra United at Porirua, 2pm\nNovember 16: Canberra United v Adelaide United at McKellar, 4pm\nNovember 24: Canberra United v Perth Glory at Leichhardt Oval, 1pm\nNovember 30: Central Coast Mariners v Canberra United at Gosford, 4pm\nDecember 15: Melbourne City v Canberra United at Melbourne, 7pm\nDecember 21: Canberra United v Melbourne Victory at McKellar, 5pm\nDecember 29: Canberra United v Newcastle Jets at McKellar, 5pm\nJanuary 4: Brisbane Roar v Canberra United at Perry Park, 6pm\nJanuary 11: Canberra United v Western United at McKellar, 5pm\nJanuary 15: Sydney FC v Canberra United at Leichhardt Oval, 7pm\nJanuary 18: Canberra United v Western Sydney Wanderers at McKellar, 5pm\nJanuary 25: Newcastle Jets v Canberra United at Newcastle, 7pm\nFebruary 1: Canberra United v Perth Glory at McKellar, 5pm\nFebruary 8: Canberra United v Central Coast Mariners at McKellar, 5pm\nFebruary 15: Adelaide United v Canberra United at Adelaide, 4pm\nMarch 1: Canberra United v Melbourne City at McKellar, 4pm\nMarch 9: Melbourne Victory v Canberra United at Melbourne, 5pm\nMarch 14: Western United v Canberra United at Wyndham, 7pm\nMarch 22: Canberra United v Sydney FC at McKellar, 4pm\nMarch 29: Perth Glory v Canberra United at Perth, 8pm\nApril 13: Canberra United v Wellington Phoenix at McKellar, 3pm\nApril 20: Western Sydney Wanderers v Canberra United at Blacktown, 4pm",
  "word_count": 2383,
  "scraped_at": "2026-02-14T12:42:09.428617"
}