{
  "article_id": "4800a0c34ff0",
  "url": "https://www.fourfourtwo.com/news/who-is-gareth-taylor-all-you-need-to-know-about-the-manchester-city-women-manager",
  "title": "Gareth Taylor : All you need to know about the Man City boss",
  "date": "20241213T093000Z",
  "domain": "fourfourtwo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Who is Gareth Taylor? All you need to know about the Manchester City Women manager\nGareth Taylor, the Manchester City boss, will be looking for his first WSL league title this season...\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nManchester City boss Gareth Taylor is the WSL's longest-serving manager after Emma Hayes’ departure from the Chelsea at the end of the 2023-24 season.\nTaylor, 51, has been in charge at the Academy Stadium for over four years, first appointed in May 2020.\nHe has yet to lead the team to a WSL title, but has enjoyed plenty of success since taking the job. Here’s everything you need to know about the City coach and his career to date\nGareth Taylor: His career so far\nLike a few of his fellow WSL managers, Taylor had a distinguished playing career in the men’s professional game before becoming a coach.\nBorn in Weston-Super-Mare, Taylor’s first pro contract came at a West Country club, with Bristol Rovers offering him a deal. A four-year spell in the early nineties followed, with Taylor then turning out for Crystal Palace and Sheffield United.\nThen came his first encounter with Manchester City, the forward signing for the club in November 1998 – with City struggling in Division Two at the time.\nFortunately the Citizens got themselves promoted at Wembley in dramatic fashion via the play-offs, before reaching the Premier League the following year.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nTaylor later enjoyed successful spells at Burnley at Nottingham Forest before retiring in 2011 whilst at Wrexham. By that point his coaching career had already begun in earnest, regularly taking charge of Wrexham’s reserve side.\nFirst re-joining City as under-16 coach, Taylor had various youth development roles at the club he played for, before he was offered the women’s job in May 2020 replacing Nick Cushing.\nVIDEO How Lauren James Will Change Women's Football Forever\nWithin months of his reign, Taylor had City’s first trophy in the bag since the 2017 Women’s FA Cup, winning the 2020 edition of the same tournament after a 3-1 win over Everton at Wembley.\nBuilding an exciting attacking team around the likes of Lucy Bronze, Keira Walsh and Caroline Weir, Taylor led City to an impressive second-place finish in 2020-21, with the anticipated next step being s league championship.\nBut tougher times followed, City lost three of their first four games the following season and were out of the title race immediately, eventually finishing a distant third. Taylor then lost Bronze and Walsh to Barcelona after the pair helped England win Euro 2022 on home soil.\nWhat has followed since has been a steady recovery to get City back to the top of the domestic tree. Taylor’s team flirted with the title in 2023 before back-to-back defeats away at local rivals Liverpool and Manchester United ended their chances.\nLast season was arguably Taylor’s best as a manager so far, winning 18 out of City’s 22 league games. Yet on the final day Chelsea were yet again champions. That, coupled with a quarter final FA Cup exit on penalties to Tottenham, means the pressure is starting to grow on Taylor to win some silverware in 2024-25.\nCan he deliver? With an attack of England stars Chloe Kelly and Lauren Hemp, Matilda Mary Fowler and goalscoring phenomenon Bunny Shaw, City and Taylor have a great chance.\nJack has worked as a sports reporter full-time since 2021. He previously worked as the Chief Women’s Football Writer at the Mirror, covering the England Women’s national team and the Women’s Super League. Jack has reported on a number of major sporting events in recent years including the 2023 FIFA Women’s World Cup on the ground in Australia. When not writing on football, he can often be spotted playing the game somewhere in west London.",
  "word_count": 747,
  "scraped_at": "2026-02-14T12:48:55.449007"
}