{
  "article_id": "481b60abfab7",
  "url": "https://www.cityam.com/premier-league-explores-premflix-launch-with-dual-tv-sales-model/",
  "title": "Premier League explores Premflix launch with dual TV sales model",
  "date": "20250326T083000Z",
  "domain": "cityam.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Premier League explores Premflix launch with dual TV sales model\nThe Premier League is exploring the possibility of adopting a two-pronged media sales strategy from 2029 onwards, with a direct-to-consumer model adopted in certain overseas markets but the domestic broadcast rights still sold to traditional broadcasters, such as Sky Sports and TNT Sports.\nThe decision to take all international broadcast production in-house from the start of the 2026-27 season, when a new operation will begin in Kensington Olympia, will give the Premier League the capability to launch their own channel for the first time, similar to the NFL’s Game Pass.\nWhile a number of owners such as Chelsea’s Todd Boehly are lobbying for the Premier League to sell all of its media rights direct to fans through their own “Premflix” service, it is likely to be more cautious and begin that process by experimenting in a handful of overseas markets.\nWhile the domestic rights auction dominated by Sky would remain in place, the Premier League could insist on taking over the production process, which would give it complete control of the finished broadcast product — a move likely to be welcomed by clubs.\nLondon Broncos near Aussie takeover\nAn Australian consortium is close to completing a takeover of London Broncos as they plot a return to Super League.\nA group of businesses is understood to have agreed terms with David Hughes, who has owned the Broncos for 28 years, and an announcement could come as soon as next month.\nThe sale has been brokered by Leeds Rhinos’ long-serving chief executive Gary Hetherington, who will join the Broncos at the end of the season, and former Leeds and New South Wales forward Matt Adamson, who has relocated from Australia to help run the club.\nIn addition, the club’s new leadership group has agreed affiliate deals with several NRL clubs, including Penrith Panthers and the new Brisbane-based Dolphins franchise, that will allow them to take their top youngsters on loan.\nThe Broncos’ new owners are determined to return the club to Super League, which could expand to 14 clubs next season, and have already held talks with IMG about how to improve the grading score that determines membership of the top division.\nThe Championship club will continue to play at AFC Wimbledon’s Cherry Red Records this season, but a future ground move for the nomadic club has not been ruled out.\nSemi-automated offsides set for rollout in April\nThe Premier League is ploughing on with plans to introduce semi-automated offside technology (SAOT) this season ahead of another trial in the FA Cup quarter-finals this weekend, when three of the four ties will use the new technology.\nAn eight-minute VAR check in the Bournemouth-Wolves fifth-round tie in the first SAOT trial earlier this month has led to a further delay in the Premier League adopting a system that was originally meant to be in place last October, but referees’ chief Howard Webb remains determined to push ahead.\nIf the FA Cup quarter-final trial is deemed a success the clubs will be asked if they want to use SAOT in the Premier League, although the round of midweek matches next week will come too early.\nThe earliest it could be introduced is the weekend of 5-6 April, although some clubs remain to be convinced about bringing it in with just eight games of the season to go.\nPlayers get windfall for Women’s Euros\nInternational players’ union Fifpro has secured a landmark agreement with the national associations involved in this summer’s women’s Euros for them to pass on between 30 and 45 per cent of the prize money they will receive from Uefa on to the players.\nAll of the 16 competing nations have signed up to the agreement, including the Football Association, although the England players’ committee is yet to accept the governing body’s offer.\nUefa has more than doubled the prize pot to £34m from the previous tournament won by the Lionesses three years ago, with the winners to receive £4.3m this time around.\nThe FA’s offer to the players is understood to be towards the upper end of the Fifpro bonus range, working out at around £90,000-per-player should Sarina Weigman’s side successfully defend their European title.\nNegotiations between the two parties remain ongoing and will continue next month when the squad meet up for a Uefa Nations League double-header against Belgium.\nConcussion lawsuit claimaints top 1,000\nThe group of former rugby players and footballers taking legal action against governing bodies over alleged negligence in failing to protect them from concussion-related injuries has grown to over 1,000 claimants.\nLaw firm Rylands Garth now represents over 700 former rugby union players, 270 from rugby league and over 100 ex-footballers in a case that is due to go to trial next year.\nMany of the claimants are suffering with neurological conditions including Parkinson’s disease, motor neurone disease (MND), chronic traumatic encephalopathy (CTE) and dementia as a result of their injuries.\nThe former players are seeking compensation from World Rugby, the Rugby Football Union, Welsh Rugby Union, Rugby Football League and Football Association for lost earnings, medical bills and other care costs.\nThe claim was launched in December 2020 when England World Cup winner Steve Thompson spoke publicly about his experiences of living with dementia in his early 40s. Nineteen players in the cohort have already lost their lives to their neurological conditions.\nA case management hearing relating to the rugby claim is scheduled for June, when both parties will be asked to put forward suggestions for test claimants to the court.\nAn agreed list of 21 test claimants will then be used as case studies when the case goes to trial.",
  "word_count": 946,
  "scraped_at": "2026-02-14T12:34:41.173136"
}