{
  "article_id": "48401ac8db26",
  "url": "https://www.smh.com.au/national/wielding-power-from-the-shadows-20230927-p5e822.html",
  "title": "How Mike Pezzullo played Canberra bubble fantasy football with Australia powerful",
  "date": "20230929T211500Z",
  "domain": "smh.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This was published 2 years ago\nWielding power from the shadows\nAs the fallout continues over the conduct of Home Affairs secretary Mike Pezzullo, the Albanese government will be grappling with how to re-establish institutional checks on power.\nThe vocational calling of public servants, noted Home Affairs secretary Mike Pezzullo in a high-minded speech to a group of bureaucrats in October 2018, “is to assist governments to be better than they would otherwise be, but not to seek to make them different governments”.\n“If we have a different interpretation of the ‘public interest’ … we should resign our positions as public servants and run for elected office ourselves.”\nThe applause at the end of this speech was sincere. But if Pezzullo’s audience at the ACT division of the Institute of Public Administration had known what he was up to behind the scenes, it’s likely many of them would have recoiled in horror.\nFor well over a year by that point, Pezzullo had been trying his best to create different governments – shuffling ministers and senior public servants in a deck of his own imagining to suit his view of the world.\nThis was not just Canberra bubble fantasy football. Pezzullo’s interlocutor, the recipient of hundreds of messages over five years, was Scott Briggs, a Liberal Party lobbyist and mate of two prime ministers: Malcolm Turnbull and Scott Morrison. In their exchanges, the public servant regularly requested that his ideas be passed on, or “fed in” to the PM. Briggs acquiesced, transforming from the lobbyist to the lobbied.\nIn the wake of the revelations in The Age, the Sydney Morning Herald and 60 Minutes, the Albanese government stood Pezzullo aside on full pay pending an investigation. He has not resigned, but, as former attorney-general George Brandis pointed out this week, it’s hard to picture a comeback: How could any minister, or his public service colleagues, now trust him to give frank and fearless advice?\nPezzullo’s obsession was to build the Home Affairs Department into a giant entity that enveloped most of the security forces of the state (while they retained statutory independence), policing the country and the rest of the public service and guarding against what he described in a 2017 speech as “a dark universe” of “evil”. It became, as one wag pointed out, the overseer of all federal officials who carry guns.\nHis messages with Briggs reveal graphically how Pezzullo promoted his own restless ambitions with successive prime ministers, jostling against colleagues, ministers, structures – anything he believed stood in his way, playing an intensely political game.\nFor what is wrong with his actions, we need look no further than Pezzullo himself.\n“An apolitical public service is one of the key institutions in our Westminster system,” he told the audience in the Canberra speech. Strong institutions and the rule of law, the checks and balances of the parliamentary system inherited from Britain, were what prevented Australia descending into the chaos of a “post-truth world”, he said.\nIntegrity academic A.J. Brown, at Griffith University, was even more explicit. Pezzullo’s ambitions, he said, were “all about amassing power” and “that’s the environment in which megalomaniacs become a problem in any political system over the centuries”.\nThere is no suggestion either Pezzullo or Briggs acted illegally or corruptly. Briggs was doing what lobbyists do – making connections between powerful people, carrying messages, and keeping an ear out for any business opportunities.\nA number of commentators pointed out, though, that Pezzullo was so far over the line of what was acceptable in a public servant – and what is required of agency heads under the Public Service Act – that he’s been stood down and will be investigated by the Australian Public Service Commission.\nSome will say he was just a rogue bureaucrat.\nHowever, that he was able to operate like this while at the peak of the public service, and maintain his position after Labor took office, is emblematic of what a number of experts believe is a larger problem also highlighted by the robo-debt disaster.\nIn Australia, at both state and federal levels, a number of inquiries have now found that the public service has become politicised in a way that has thrown its institutional checks on power out of balance.\nBeyond the question of Pezzullo’s future, the experts say, the Albanese government needs to grapple with this, and decide whether the system that exists at the moment is still fit for purpose.\nDue process\nIn Anthony Albanese’s first press conference as prime minister, he sent a clear signal to the bureaucracy: “We won’t be sacking public servants … We will be valuing public servants and respecting them.”\nIt was an advertisement for continuity, and it was based on a sound principle: any government that wants public servants to provide fearless, apolitical advice should not gratuitously sack them.\nSackings had been a feature of the early days of a number of recent governments. Even before John Howard was sworn in as prime minister he dismissed six secretaries in what became known as the “night of the long knives”. Tony Abbott dismissed three in 2013, and in 2019, Morrison accepted the resignation of the highly regarded Martin Parkinson and appointed instead his former chief of staff, Phil Gaetjens, as the head of Prime Minister and Cabinet. Two other secretaries were moved on.\nThe outcome of a politicised bureaucracy is yes-men and yes-women in key roles.\nThe problem is not limited to the federal sphere. In Victoria, the stacking of the public service with Labor loyalists and the dominance of the premier’s private office under Daniel Andrews so concerned the state’s ombudsman that she conducted an inquiry into it.\nAlbanese’s press conference statement about sackings was his way of saying his administration would be different.\nIronically, though, his no-sackings policy meant some of the bureaucracy’s most political or divisive individuals kept their jobs. Pezzullo was one and Kathryn Campbell, the departmental secretary who oversaw the robo-debt scheme, another.\nCourt judgments by the time of Albanese’s election had already revealed what the royal commission confirmed: Robo-debt was an illegal and immoral policy that had killed people.\nBut even though Campbell was the departmental secretary overseeing it, and the royal commission found she had done “nothing of substance” when she learned of its illegality, Labor kept her in well-paid employment in Defence. Only when the demand for her dismissal reached a crescendo was she suspended without pay. She took the hint and resigned but the government could point to the fact that they had exercised due process throughout.\nPezzullo, incidentally, was a fan of Campbell, describing her in one message to Briggs as “a potential future Home Affairs secretary”.\nA culture warrior\nPezzullo’s survival under Labor after the 2022 election was also a surprise to many. This was the man who had become the right-hand man of Peter Dutton as Home Affairs minister and whose “can do” attitude (he described himself in the messages as a “driver”) had made him Morrison’s favourite bureaucrat, according to one former Liberal minister speaking anonymously to detail private conversations.\nPezzullo’s messages to Briggs reveal what many had suspected: he was an enthusiastic, not just a professional, prosecutor of some of the crueller aspects of the offshore processing scheme and a cheerleader of those Pezzullo described as Coalition “right-wingers” who embraced his own hawkish security posture.\nHe was insistent in early 2019, for example, that refugees needing medical evacuation from Nauru should be sent to Christmas Island for treatment even though it was not equipped to handle them. His objection to sending them to Brisbane was, he told Briggs, because “you cannot rule out ‘welcome parties’ by Greens and moderate Liberals,” which would be “disastrous in terms of [Operation Sovereign Borders] deterrence”.\nHis messages also reveal he was something of a culture warrior.\nIn September 2018, Pezzullo shared with Briggs an ABC online story about a nine-year-old girl who had been given a detention at school because she refused to stand for Advance Australia Fair. The girl argued that the line in the anthem, “We are young”, ignored millenniums of Aboriginal culture.\n“This is the kind of thing that we should be fighting,” Pezzullo wrote of the girl’s protest.\n“It makes my skin crawl!”\nFormer colleagues and politicians, speaking anonymously to discuss private matters, say Pezzullo tapped into another prevailing ethos of the Abbott and Morrison governments.\n“He was very blokey: the lads, mates, hanging out with the boys,” said one former politician speaking anonymously to detail internal matters. The message cache showed him being dismissive of defence minister Marise Payne and foreign minister Julie Bishop, but this was played out more broadly too, the source said.\n“He was openly scathing about them.“\nMeanwhile, in his day job, Pezzullo was overseeing a neglect of the broader migration system so profound that when she looked into it, Home Affairs Minister Clare O’Neil described it as “completely broken”. A fellow senior public servant, also speaking anonymously, described Home Affairs as a “Potemkin village”, meaning it was all for show.\nDespite all this, Labor kept Pezzullo in place.\nEarly hints\nFrom the start, the Home Affairs secretary worked hard to please his new masters.\nIn the days after Labor’s election, they asked Pezzullo to review the appropriateness of an election-day text message sent by the Liberal Party announcing the interception of an asylum seeker boat from Sri Lanka. Scott Morrison used the boat to try to turn the border threat into an election issue for the first time since 2013.\nPezzullo’s subsequent report threw his former minister, Karen Andrews, under the bus. He transcribed and published the impatient election-day text messages from her office to the department asking it to get its media statement out quickly. Pezzullo’s report also implied wrongdoing by her office saying it wanted to “drop” the statement to “selected journalists”. Andrews’ staff later said the group in question was the entire press gallery.\nEven so, Labor gave early hints that Pezzullo was on the outer. The government last year quietly took the Australian Federal Police, the Australian Criminal Intelligence Commission and anti-money laundering agency AUSTRAC out of Pezzullo’s department and put them back into the Attorney-General’s portfolio under Mark Dreyfus, whom Pezzullo had vigorously disparaged to Briggs.\nO’Neil also installed an “associate secretary” to Pezzullo — Stephanie Foster — in an extraordinary arrangement that virtually removed from him the responsibility for his department’s immigration function. Foster is now acting secretary in Pezzullo’s absence and the woman most likely to become permanent head if Pezzullo is dismissed or resigns.\nIn response to reporting in The Age and Herald, O’Neil separately commissioned Christine Nixon to investigate criminals trafficking people into Australia with apparent impunity through the immigration system. Nixon’s scathing report did not spare Pezzullo’s feelings.\nO’Neil also asked veteran mandarin Martin Parkinson – a man Pezzullo told Briggs “isn’t up to it” – to investigate how the immigration function had fallen into such disrepair. Parkinson’s report also pulled no punches.\nDespite all this, under Albanese’s no-sackings regime, Pezzullo remained the boss of his diminished department, still known as Home Affairs, in charge of fixing these problems.\nAfter the due process of the Australian Public Service Commissioner’s current inquiry is complete, that is unlikely to remain the case.\nThe broader issues these events have laid bare, though, is that refraining from sacking secretaries is simply not enough if your aim is to achieve an apolitical public service.\nDistributed power\n“He’s quite a character,” ANU academic and former Australian public service commissioner Andrew Podger observed of Pezzullo this week. But the problem with the Australian public service was about “more than a rogue” secretary.\nTo Podger, himself a former long-time public servant, the key problem – exposed by Pezzullo’s messages – is an “excessive incentive to please” among some senior public servants in pursuit of their “own self-interest”.\nCatherine Holmes, the robo-debt royal commissioner, came to a similar conclusion. Her final report said the problem that led to such a disastrous policy could be “traced to features of the APS [Australian public service] structure”.\nSome bureaucrats were “excessively responsive to government,” she wrote. “Woefully inadequate” record keeping practices and a lack of understanding of the Australian public service’s role, principles and values did not help.\nThis could be traced back to the way senior public servants were appointed, performance managed and then terminated, meaning it “favours being ‘agreeable’ rather than engaging in debate and challenge”.\nPodger said this diminished the “trusting relationship with the public”, and the system could not operate without it. Trust could only be achieved if decisions were made “consistent with the elected government’s agenda, but applied in an impartial way so that everyone is treated fairly, everyone gets access”.\nHe said departmental secretaries should be appointed through a strong, merit-based process, in conjunction with the public service commissioner, not simply at the whim of the prime minister of the day, and they should not have time-limited contracts. Performance management of departmental secretaries should look not just at their performance but at the culture they had developed in their departments. Pezzullo’s department, for example, has long suffered appalling staff morale, poor pay and high turnover.\nThe system proposed by Podger is similar to that recommended by Holmes, as well as in an independent review conducted by David Thodey in 2019.\nSenior public servants, agency heads and former politicians interviewed for this story but speaking on condition of anonymity say the picture is not all gloomy.\nIt’s clear from the messages with Briggs that some of Pezzullo’s senior colleagues, and a number of ministers, including Karen Andrews, Julie Bishop, George Brandis and Marise Payne, knew he was a player and worked hard to restrict him.\nHis manoeuvrings were obvious, one former senior official said, which made them easy enough to head off.\nFor many years, Pezzullo’s ambition was to become the secretary of defence and he openly agitated for it within the government. He never succeeded because, as one former official told The Age and Herald: “You need to be careful of sending people to defence who passionately want to be there”.\nPezzullo was also thwarted in his ambition to become the “first among equals”, the head of the Department of Prime Minister and Cabinet. Even if then-Home Affairs minister Peter Dutton had won the leadership of the Liberal Party in 2018, one senior former colleague said he would not have appointed Pezzullo to lead his public service.\n“Dutton used him as a weapon, but he had a much more realistic view of Mike’s ability than Mike thought he did.”\nNevertheless, Pezzullo did make it to a position of awesome power and stayed there for the best part of a decade until his private dealings this week saw him stood down.\n“The obvious can sometimes be very effective,” remarked a former senior colleague.\nHe was stood aside only after dogged investigation by this masthead and the willingness of third-party sources to reveal the details of otherwise private conversations. Along the way, as the reporting shows, his involvement in the back-scratching culture of politics created significant issues: it saw him doing a favour for British American Tobacco by arranging a meeting with a department official, and holding a private discussion with the head of controversial consulting firm PwC after an approach from a lobbyist.\nKathryn Campbell’s downfall came only after huge public outcry, some expensive legal action and a change of government.\nThe Pezzullo saga begs a number of questions. Are Labor’s mooted reforms to the public sector sufficient to return it to independence? And is it time to declare the Home Affairs Department that Pezzullo created a failed experiment – to break it up, return ASIO to the Attorney-General’s Department, reprioritise the immigration function and rethink how we talk about security and tolerance?\nAll this is clearly on Labor’s agenda, and Pezzullo’s final departure would make it that much easier to achieve.\nAs A.J. Brown pointed out, our system of government needs to be as robust as possible because it is full of people like Pezzullo: “Strong individuals, strong characters who may be very confident in their own power.”\nSome such people might just grow into megalomaniacs, Brown said, before adding: “This seems to be a situation where that risk is real.”\nThe Morning Edition newsletter is our guide to the day’s most important and interesting stories, analysis and insights. Sign up here.",
  "word_count": 2733,
  "scraped_at": "2026-02-14T13:48:58.254241"
}