{
  "article_id": "484ad75004f3",
  "url": "https://www.espn.com/soccer/blog-the-toe-poke/story/4896694/nwsl-player-ratings-for-fifa-23-uswnt-stars-dominate-top-spots",
  "title": "NWSL player ratings for FIFA 23 : USWNT stars dominate",
  "date": "20230311T000000Z",
  "domain": "espn.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "EA Sports has confirmed that all teams in the National Women's Soccer League (NWSL) will be added to a FIFA video game for the first time after announcing that 12 clubs will join the FIFA 23 roster this month. And now it has revealed its top-rated players in the league, with a list dominated by United States women's national team (USWNT) players.\nThe latest edition of the FIFA franchise already features more women's teams and players than ever before, with the NWSL now joining the Women's Super League (the top division of women's football in England) and Division 1 Feminine (France) before the new campaign kicks off March 25.\n- Stream on ESPN+: LaLiga, Bundesliga, more (U.S.)\nAll 12 NWSL clubs, four stadiums and all the requisite kits, trophies and celebrations will be added as part of an expansion that will be made available across all platforms from March 15. The teams will then be available in the game's kickoff, tournament, head-to-head seasons, co-op seasons and online friendlies modes.\nTo further whet the whistle ahead of the impending launch, EA Sports has unveiled the full list of FIFA 23 player ratings for every NWSL player. The current top-rated women's player in FIFA 23 is Alexia Putellas of Barcelona and Spain, who commands an overall rating of 92 in the base game.\nAt the age of 37, Orlando Pride attacking midfielder and Brazil legend Marta has seen her overall rating drop to 84 in FIFA 23 from a career high of 89 (in FIFA 18.) Indeed, the six-time FIFA World Player of the Year is level-pegging on a rating of 84 with fellow veteran and Canada stalwart Christine Sinclair, who is about to begin her 11th campaign with Portland Thorns at the age of 39.\nUSWNT prodigy Trinity Rodman, 20, commands an impressive rating of 83 -- though it should be noted that the fleet-footed Washington Spirit winger has the second highest rating in the entire NWSL in terms of pace.\nBut how well do your favourite NWSL stars compare with the best of the best?\nAdrianna Franch, GK, Kansas City Current (85)\nFranch is one of three goalkeepers on the same rating after proving to be a dependable presence between the posts for Kansas City last season. The USWNT back-up stopper made 20 starts and conceded 25 goals.\nAlyssa Naeher, GK, Chicago Red Stars (85)\nNo. 1 for club and country, the resolute USWNT goalkeeper conceded just 19 goals in 22 appearances for the Red Stars during the 2022 NWSL regular season.\nKailen Sheridan, GK, San Diego Wave (85)\nA staple of the Canada national team for many years, Sheridan shares top spot in the goalkeeper rankings after only conceding 17 goals in 18 games as the Wave finished third in last season's NSWL campaign.\nBecky Sauerbrunn, CB, Portland Thorns (86)\nUSWNT captain Sauerbrunn is the highest-rated NWSL centre-back in FIFA 23 after guiding the Thorns to NWSL Championship glory last season, having also wrapped up a treble of sorts (Challenge Cup, International Champions Cup and NWSL Shield) with the club the previous year.\nMegan Rapinoe, FW, OL Reign (86)\nOne of the most recognisable stars in the international women's game, USWNT veteran Rapinoe pitched in with seven goals and four assists in 14 games for Reign as they collected the 2022 NWSL Shield by finishing top of the standings in the regular season.\nChristen Press, FW, Angel City (86)\nAnother veteran of the USWNT, Press was limited to just eight appearances by persistent knee injury problems in what was her debut season with Angel City after returning to the NSWL from a brief stint with Manchester United. Still, the 34-year-old forward managed to contribute two goals and an assist to the cause.\nMallory Swanson, FW, Chicago Red Stars (87)\nWith 87 caps and 32 goals for the USWNT at the age of just 24, Swanson has already proven herself to be a prolific goal scorer at both club and international level, accumulating 11 goals in 16 league games for the Red Stars during the 2022 season.\nSophia Smith, FW, Portland Thorns (87)\nThe second leading goal scorer in the 2022 NSWL campaign, the 22-year-old USWNT striker notched 14 goals in 18 games for the Thorns. That earned her the title of league MVP for the season, while on the international stage she was also named the United States' Player of the Year.\nRose Lavelle, CM, OL Reign (87)\nAn industrious and experienced central midfielder with 87 caps for the USWNT under her belt, Lavelle scored five goals and provided one assist in 17 games for Reign on their way to winning the 2022 NWSL Shield.\nDebinha, FW, Kansas City Current (88)\nOne of only four players to register a hat trick during the 2022 NWSL season, Brazil international striker Debinha scored 12 goals and laid on four assists for North Carolina Courage before joining Kansas City as a free agent in January.\nAlex Morgan, FW, San Diego Wave (90)\nAnother enduring presence for the USWNT, Morgan reestablished her credentials in 2022 by finishing as the top goal scorer with 15 goals in just 17 games for the Wave. The two-time World Cup winner was also the only player to score four goals in a single game, racking up a quadruple in her side's 4-0 win over bottom side NJ/NY Gotham in May.",
  "word_count": 893,
  "scraped_at": "2026-02-14T12:38:49.539341"
}