{
  "article_id": "48638919109a",
  "url": "https://www.runnersworld.com/runners-stories/a44363904/parker-valby-nike-nil/",
  "title": "Parker Valby Announces NIL Deal With Nike",
  "date": "20230628T040000Z",
  "domain": "runnersworld.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Parker Valby, the 2023 NCAA champion in the 5,000 meters, has signed a name-image-likeness (NIL) deal with Nike. Valby announced the deal on her Instagram on June 27, and her agent for the deal was Tom Ratcliffe of Kimbia Athletics.\nValby, a sophomore at the University of Florida, ran the 5,000 in 15:30.57 in hot conditions in Austin, Texas, winning by 9 seconds over Everlyn Kemboi of Utah Valley University.\nIn 2022, Valby was the runner-up in the same event to Katelyn Tuohy, and she also finished second to Tuohy at the NCAA cross-country championships last November, after opening up a big lead throughout the first half of the course.\nValby has established herself as one of the top collegiate distance runners in the country, despite not being able to run very much. During the outdoor track season, she was hampered by a lower leg injury that kept her from training too often on land. Valby is known as a ferocious cross trainer and has been able to maintain her fitness with the help of the arc trainer, elliptical machine and pool workouts. She often runs only twice per week.\nDuring the NCAA meet earlier this month, Valby appeared to be limping during her race.\nIn a statement provided by Kimbia Athletics, Valby said, “Of course, I’d rather be running more, but overcoming adversity is also a big part of success, so I’ve learned a lot that will help in the future.”\nNIL deals such as Valby’s have continued to change the sports landscape, primarily in revenue sports like football and men’s and women’s college basketball. Big offers for track and field athletes have been slower to come along.\nTuohy, who announced a deal with Adidas last November, was one of the first. Charles Hicks of Stanford signed a deal with Nike in March. Both Tuohy and Hicks were represented in their deals by agent Ray Flynn.\nTuohy, Hicks, and Valby are likely to have a future in the sport as pro runners, and their deals are thought to be worth between $50,000 and $150,000 annually with shoe brands.\n“It’s obviously a positive for me, but as well, it’s nice that Nike and others see value in collegiate track and field,” Valby said in the statement. “Also, the opportunity to earn an income while in school might be an incentive for some student-athletes to stay in the NCAA, which is good for the NCAA and the sport.”\nOther track and field athletes might not have the same prospects for a pro career as those that have won NCAA titles, but they leverage large social media followings to earn money from NIL. Steeplechaser Emily Cole of Duke, high jumper Sam Hurley of Texas, and 400-meter runner Tori Ortiz of Oklahoma State fit into that category. Their NIL deals tend to be for a shorter period of time, and they often work with multiple brands at once.\nSarah Lorge Butler is a writer and editor living in Eugene, Oregon, and her stories about the sport, its trends, and fascinating individuals have appeared in Runner’s World since 2005. She is the author of two popular fitness books, Run Your Butt Off! and Walk Your Butt Off!",
  "word_count": 533,
  "scraped_at": "2026-02-14T13:35:30.326078"
}