{
  "article_id": "48632f130545",
  "url": "https://www.harrowtimes.co.uk/news/25116734.eni-aluko-apologises-ian-wright-male-pundit-comments/",
  "title": "Eni Aluko apologises to Ian Wright over male pundit comments",
  "date": "20250425T183000Z",
  "domain": "harrowtimes.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Eni Aluko has apologised to Ian Wright.\nThe former England striker suggested earlier this week that he risked blocking female pundits from getting opportunities in broadcasting.\nIn an interview with BBC Radio 4's Woman's Hour, Aluko said there are only a \"finite amount of opportunities\" for women and that Wright needs to take notice of how much work he does in women's football.\nAluko, 38, has since faced scrutiny for her comments.\nEni Aluko has apologised to Ian Wright for suggesting he risked blocking female pundits from getting opportunities in broadcasting. pic.twitter.com/mixPZRoc6J\n— BBC Sport (@BBCSport) April 25, 2025\n\"Ian Wright is a brilliant broadcaster and role model whose support for the women's game has been significant,\" she said in a statement on Instagram.\nFormer Arsenal and England striker Wright has been an advocate for women's football, on which he has worked regularly as a pundit, with particular focus on Lionesses matches.\n\"In my interview with Woman's Hour this week, I was trying to make a broader point about the limited opportunities for women in football - whether that's in coaching, broadcasting or commercial spaces - and the importance of creating more space for women to thrive on and off the pitch,\" Aluko said.\n\"But it was wrong for Ian's name to be raised in that conversation, and for that I sincerely apologise. I've known and worked with Ian for many years and have nothing but love and respect for him.\"\nRecommended reading:\n- What should I do if my local bank branch faces closure? All you need to know\n- Barclays issues 'devastating' warning to all of its customers\n- 'No hiding' for water company bosses who face two years in prison for sewage\nAluko has worked alongside Wright as a pundit and said in her Woman's Hour interview he is a \"brilliant broadcaster\" but that he \"should be aware of how much he's doing in the women's game\".\nAsked if she thinks it is wrong for Wright to cover women's football, Aluko said: \"I don't know about wrong, but I think we need to be conscious and we need to make sure that women are not being blocked from having a pathway into broadcasting in the women's game.\n\"It's still new, it's still growing. There's a finite amount of opportunities and I think that men need to be aware of that.\"",
  "word_count": 393,
  "scraped_at": "2026-02-14T13:06:17.380621"
}