{
  "article_id": "48687333ff46",
  "url": "https://dailytrust.com/gov-sule-to-rejig-nasarawa-uniteds-management/",
  "title": "Gov Sule to rejig Nasarawa United management",
  "date": "20241206T074500Z",
  "domain": "dailytrust.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Governor Abdullahi Sule of Nasarawa State has hinted that he would rejig the management of the state owned Nigeria Premier Football League (NPFL) side, Nasarawa United for enhanced performance in the second round of the ongoing NPFL season.\nThis is no doubt as a result of the underwhelming performance of the ‘Solid Miners’ in the 2024/2025 season.\nNasarawa United under the chairmanship of Solomom Babanjah are currently placed last on the NPFL table with a paltry 15 points from 15 matches played so far.\nThe ‘miners’ have recorded four victories, three draws and eight losses to sink deep into relegation waters.\nThe Media Director of Nasarawa United, Amos Eche, who doubles as the Head of Public Relations of the state Ministry of Youth and Sports Developmnt in a statement said Governor Sule made this known on Wednesday when he hosted the victorious Nasarawa Amazons.\nIt will be recalled that the state owned Nigeria Women Football League (NWFL) side had defeated current NWFL champions Bayelsa Queens 6-5 on penalties win this year’s Betsy Obaseki pre-season football tournament in Benin City in October.\n“I say little about Nasarawa Amazons because they will remain our champions. That doesn’t take away the fact that I also encourage our male team, Nasarawa United FC, because they do need the encouragement more than you do due to their current standings in the Nigeria Premier League.\n“I will continue to show them my support, whether publicly or secretly, because I am also still proud of them.\n“I strongly believe that they will come out stronger, even if it requires that we make some changes to enable them to come out stronger.\n“I am just waiting for the end of the first stanza of the NPFL Season, then we can make the necessary changes,” governor Sule was quoted as saying.\nMeanwhile, in a show of magnanimity, the governor rewarded Nasarawa Amazons with a cash prize of N10 million for their outstanding achievement with a promise to look into their problems.\nThe highlight of the occasion was the presentation of the Betsy Obaseki pre-season tournament trophy, medals, dummy cheque for the N10m prize money as well as players of Nasarawa Amazons who recently participated in Nigeria’s International friendly with France.\nUPDATE NEWS:\nNigerians can now invest ₦2.5 million on premium domains and profit about ₦17-₦25 million. All earnings paid in US Dollars. Rather than wonder, click here to find out how it works.",
  "word_count": 404,
  "scraped_at": "2026-02-14T12:49:06.896851"
}