{
  "article_id": "4868711feb51",
  "url": "https://news.sky.com/story/lee-carsley-outrage-around-england-interim-manager-is-unwelcome-throwback-ahead-of-first-match-in-charge-13210982",
  "title": "Lee Carsley : Outrage around England interim manager is unwelcome throwback ahead of first match in charge",
  "date": "20240907T170000Z",
  "domain": "news.sky.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Lee Carsley: Outrage around England interim manager is unwelcome throwback ahead of first match in charge\nIt was in an off-camera news conference when Lee Carsley was asked about singing the national anthem and provided a delicate response about never doing so even while with Ireland.\nSaturday 7 September 2024 15:12, UK\nNo one doubted Lee Carsley's commitment to England when he oversaw the under-21s men's team winning their first European Championship title in 39 years.\nHe even felt it was a privilege staying on when approached to step up to a senior job with Ireland months later.\nAnd through it all, no one seemed to ask if the new England interim manager sang the national anthem.\nEveryone knew as a Birmingham-born defensive midfielder he had played 40 times for Ireland, including at the 2002 World Cup, after being eligible through a grandmother.\nAnd he deftly handled questions about dual nationality on Friday night when UEFA's random draw meant Dublin was the location for his first pre-match news conference as Gareth Southgate's interim successor with his reign - however short or long - starting tonight against Ireland in the Nations League.\nIt was in an off-camera, separate news conference for newspaper reporters when Carsley was asked about singing the national anthem and provided a delicate response about never doing so even while with Ireland.\nAnd does it matter he stays mute? Is his will to win suddenly diminished?\nNo one seems to have questioned if Sarina Wiegman sings the national anthem or used that as a reason to deny her having the Lionesses job.\nEveryone was too busy celebrating this former player and manager of the Netherlands being the first manager to win a women's trophy for England at that glorious Euros final at Wembley in 2022.\nAnd her loyalty was not questioned a year later when she took England to a first World Cup final since the men in 1966.\nRead more:\nCarsley announces first squad\nHow England's nearly man was still a success\nSo, the outrage around Carsley can seem confected - an unwelcome throwback for the FA to what seemed a bygone era.\nSven-Goran Eriksson arrived in 2000 to a headline claiming the FA had \"sold our birthright\" by hiring a Swede for one of the most prestigious jobs in English football.\nThe bombastic rage is back - bemusing those inside the FA.\nAlready there was concern that the level of media criticism - albeit with former players the loudest dissenters - contributed to Gareth Southgate stepping down after a second successive Euros final.\nDiscussing that just last week in a Sky News interview, UEFA President Aleksander Ceferin said: \"There's too much anger in the society.\"\nBe the first to get Breaking News\nInstall the Sky News app for free\nParticularly around the Three Lions and it may well deter even some elite coaches from taking the manager's job.\nBut what doesn't impact Carsley's credentials for the role full-time himself is whether or not he sings God Save The King.",
  "word_count": 503,
  "scraped_at": "2026-02-14T13:04:59.975548"
}