{
  "article_id": "486fabdecad9",
  "url": "https://www.hillingdontimes.co.uk/news/25217288.carly-telford-mary-earps-huge-loss-england-squad/",
  "title": "Carly Telford : Mary Earps is a  huge los to England squad",
  "date": "20250605T134500Z",
  "domain": "hillingdontimes.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Carly Telford believes Mary Earps’ retirement represents a ‘huge loss' to the England squad on the eve of the European Championships but insists she retains ‘huge respect’ for her fellow goalkeeper.\nEarps stunned the footballing world by announcing her decision last week after reportedly being told by Lionesses boss Sarina Wiegman that she would not be first choice for the defence of England’s European crown.\nTelford, who boasts 27 caps for England between the sticks, believes the squad’s remaining goalkeepers will suffer for the loss of Earps’ experience in Switzerland.\n“For me, it's a huge loss in terms of the GK union,” she said. “It's always super important to have some experience in there.\n“You'd be shocked when any player that plays well retires and probably think it's too early, or it's an age where they shouldn't, but there's never an age that you should or shouldn’t retire.\n“From a player perspective, everyone's journey should be in their control, and I have a huge respect for Mary.\n“It's not something you just think overnight, and you're like, ‘Oh, you know what, I can't really be bothered anymore. I don't fancy this.’\n“It would have taken months of conversations with family, with friends, with teammates, with coaches, to work out, ‘Is this the right thing for me? How do I feel when I put on that shirt? How do I feel when I go to camp?’”\nSince the goalkeeper's announcement, Millie Bright and Fran Kirby, who were both also influential in the Euro 2022 triumph, have taken themselves out of contention for England selection this summer, too.\nEarps, 32, was England’s number one when they won the Euros in 2022 in a historic summer for women’s football and kept that spot for the Lionesses’ run to the final a year later, when she was named BBC Sports Personality of the Year.\nShe has also been influential off the pitch, notably inspiring with award acceptance speeches and winning a battle with Nike to get women’s goalkeeper replica shirts on sale.\n“Her journey's been her journey, and it has been an incredible one,” added Telford.\n“What she's done for English goalkeeping, and goalkeeping in general, and for women, has been something that's probably unheard of in the women's game in England, as an individual. I can't thank her enough for that.\n“A lot of people are disappointed in the way it's been delivered, but I hope that people remember the legacy that she's left.\n“That goalkeeper union is in a much better place because of her, and I'd like to think she's given them all the tools to be successful in the next few years.”\nIn April, Wiegman said that Chelsea’s Hannah Hampton was “a little bit ahead” of Earps when it came to securing the number one jersey.\nIt is an experience Telford knows all too well from her time competing with Karen Bardsley for the spot, travelling to France for the 2019 World Cup as second choice.\nOn that occasion, an injury to Bardsley in the World Cup quarterfinals saw Telford called upon for the semi-final encounter with the USA.\n“It's really difficult because there's a part of you that knows that you're probably never going to play, but also there's always a what if,” added Telford, who is partnering with Sure to give young girls the authentic role models they deserve in a sport that is growing exponentially.\n“What I learned on my journey as a goalkeeper is not to be like, ‘Oh, I'm not going to play, I'm not going to be bothered.’\n“I would say to all the goalkeepers that are in the mix for that selection pot, including the ones that we think are going to start, is to make sure you're prepared fully because you never know what tournament football's going to throw at you.”\nVisibility plays a vital role in inspiring young girls in sports, but it alone isn’t enough. Increased visibility needs to be paired with real world grassroots investment – like Sure’s Breaking Limits Programme – find out more here https://breakinglimits.suredeodorant.co.uk/en-GB/courses/.",
  "word_count": 678,
  "scraped_at": "2026-02-14T12:35:52.631960"
}