{
  "article_id": "488cf15ece78",
  "url": "https://www.90min.com/hayley-raso-confirms-real-madrid-exit-arsenal-links-ramp-up",
  "title": "Hayley Raso confirms Real Madrid exit as Arsenal links ramp up",
  "date": "20240624T151500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Hayley Raso confirms Real Madrid exit as Arsenal links ramp up\n- Hayley Raso to leave Real Madrid exit after just one year at the club\n- Australia international joined Los Blancos from Man City last summer\n- Arsenal, Paris Saint-Germain and Juventus among clubs linked with move\nAustralia international Hayley Raso has confirmed her exit from Real Madrid, just one year after she joined the Spanish giants.\nRaso, who previously represented Everton and Manchester City in the WSL, but departed the Cityzens last summer to join Los Blancos. She scored four goals and registered two assists in her 28 league appearances last term.\nIn a statement on social media on Sunday, the 29-year-old confirmed her first season in Madrid will also be her last due to registration rules.\n\"What an honour it’s been to wear the white shirt,\" she wrote on X, formerly Twitter.\n\"Thank you Real Madrid, my teammates, the staff, the club and the fans that welcomed me with open arms. I will continue to hold you all dear in my heart. This little Aussie girl could never have dreamed of this.\n\"In saying that, I have learnt in my career that football doesn’t always work out the way we plan and due to the limit on foreign players in Spain, it's time for a new adventure. The friendships I've made, I'll carry with me for a lifetime. Muchas gracias por todo. Hala Madrid, siempre.\"\nA return to the WSL appears to be on the cards for Raso as BBC Sport claim Arsenal are among the clubs interested in signing her on a free transfer.\nElsewhere, a report in Italy from TuttoJuve suggests Juventus hold a concrete interest in the winger, while Division 1 Feminine side Paris Saint-Germain are also keen. Clubs in Liga MX Femenil in Mexico are also credited with interest in Raso.\nAustralia’s participation in this summer’s Olympics in France could mean Raso’s future will need to be resolved before the tournament kicks off in July. The winger has been named in Tony Gustavsson’s 18-player squad and the Matildas kick off their campaign against Germany on July 25.\nAustralia have never medalled at the Olympics with their best-ever finish coming at the 2020 edition in Tokyo, when they placed fourth. The Matildas lost the bronze medal match 4-3 to four-time gold medalists USA.",
  "word_count": 389,
  "scraped_at": "2026-02-14T12:08:01.090594"
}