{
  "article_id": "48ae693724b4",
  "url": "https://www.broadcastnow.co.uk/broadcasting/dazn-ties-down-jleague-and-wnfc/5180750.article",
  "title": "DAZN ties down J . League and WNFC",
  "date": "20230331T151500Z",
  "domain": "broadcastnow.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It will share profits with the Japanese football league, much like it does with NFL\nDAZN has agreed rights deals with the J.League in Japan and WNFC globally.\nThe J League deal sees the competition shown by DAZN in the country until at least 2033, and is based on a similar profit-sharing deal to the one it agreed with the NFL for its global rights.\nDAZN Group CEO Shay Segev said: “Launched as our first market in 2016, DAZN has grown into the biggest digital sports platform in Japan. The success of the Japanese business is vital to DAZN’s overall strategy, and this agreement reinforces our valued relationship with the J.League. This partnership is the foundation of our business in Japan. We are delighted to extend until 2033, and our continued investment will further contribute to the development of Japanese football together with the J.League.”\nMeanwhile, the streaming platform has also agreed a non-exclusive global rights deal with the Women’s National Football Conference - with games to be shown on the competition’s OTT platform at the same time.\nThe deal includes coverage of the regular season Game of The Week, the WNFC Playoffs, and the 2023 IX CUP Championship Game. DAZN VP of production and editorial operations Louise Lawler spoke of the broadcaster’s approach to women’s sport last month, with it also the Women’s Champions League across its platform as well as for free on YouTube.\nWNFC president Elizabeth Jenkins said: “Creating WNFC fandom globally is a key priority for us this season. We are proud to partner with Dazn to help us introduce WNFC football to the world.”\nAndrea Ekblad, VP of women’s sports at DAZN, added: “We are thrilled to begin working in partnership with the WNFC providing a global platform and maximising exposure to these incredible athletes and help drive growth. Dazn is already the home of women’s soccer globally, and this partnership further broadens our overall women’s sports strategy with women’s American football offering value and quality to our fans.”",
  "word_count": 334,
  "scraped_at": "2026-02-14T12:24:49.683543"
}