{
  "article_id": "48e2ca657657",
  "url": "https://dailytrust.com/rubiales-controversial-kiss-and-gender-equality-activists/",
  "title": "Rubiale controversial kiss and gender equality activists",
  "date": "20230903T043000Z",
  "domain": "dailytrust.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "One of the things I always remember about my late father is his saying that “lack of discipline and self-control can cause great jeopardy.” In fact, as children, we thought he used to say great ‘jeopardise’. So anytime, any of us was straying, we would say lack of self-control and discipline causes great ‘jeopardise’. There are so many things I admired about my ever-dramatic and football-loving father but today is not the day to celebrate the ace football commentator from ‘Adikpo London’.\nInstead, I am looking at how lack of self-control has put the reputation and job of a once respected football administrator in great jeopardy. Obviously, he didn’t know when to apply the break. Two weeks after, the world is still talking about the heroics of the Spanish ladies who won their first-ever FIFA Women’s World Cup in Australia. Unfortunately, discussions are not centered on their on-the field conquest but the ugly incident that followed their success.\nSoon after Spain as the underdogs edged out the Three Lionesses of England 1-0 to be crowned world champions in their third appearance, the whole world watched in disbelief how one of the heroines was subjected to what almost everyone now say was a sexual assault.\nAs the victorious players ascended the podium to be decorated with their gold medals, Luis Rubiales, the president of the Royal Spanish Football Federation (RFEF), warmly embraced and kissed star player, Jennifer Hermoso, on the lips. What appeared like a harmless kiss instantly caught the attention of the world and has inevitably given rise to ongoing conversations about consent, professionalism and respect for the female gender.\nSadly, the unprofessional behaviour of Rubiales has completely overshadowed the historic performance of Spain’s women national team. Instead of the world discussing the giant strides made in female football as highlighted by the high standard of play at the 2023 tournament, most people around the world are more concerned about the inappropriate behaviour of one man who failed to put his feelings for a woman under control.\nIndeed, there has been an overflow of outrage on social media platforms from football fans and gender equality advocates against the bad behaviour of the randy president. Many are of the opinion that his action has called for more education and awareness regarding acceptable behaviour especially when dealing with the opposite sex.\nWell, soon as it dawned on him that he had committed a serious blunder, Rubiales began to apply damage control measures. He issued a statement to say he acted based on the spur of the moment. “ I’ve learned that no matter how great the joy and how deep the emotion, even when you win a world Cup, sports leaders should be held to exemplary behaviour, and mine was not so.”\nAfter what his critics call a half-hearted apology, his case was made worse by Hermoso who came out to say that contrary to the claim by the president that the kiss was consensual, she didn’t permit it. The player went on to say that she felt the need to report the incident because she believed that “no person, in any work place, sports, or social setting should be a victim of these type of non-consensual behaviours.\n“I feel vulnerable and a victim of impulsive driven, sexist, out-of-place act, without any consent on my part. Quite simply, I was not respected. Hermoso added that she has been put under intense pressure “to help with a statement that would justify” Rubiales’ actions.\nAnyway, at the risk of endorsing indecent behaviour, some of the people who watched the viral video have argued that the player neither resisted nor showed discomfort when she was kissed. Well, the world, especially those who oppose such unwanted behaviour have already pitched a tent with Hermoso who was earlier quoted as saying “it was a totally spontaneous mutual gesture because of the immense joy that winning the World Cup brings.” However, three days later, she changed her position and joined the Spanish players union and FIFPRO, the global players union in condemning Rubiales’ bad behaviour.\nAlthough the FA president has refused to resign from his position, he is up against forces that may consume him eventually. The Spanish Prime Minister, Pedro Sanchez, was the first to condemn his apology as “not enough.” Spain’s national sports tribunal (TAD) has opened a misconduct case against him. Spain’s sports minister, Miguel Keta, has called for Rubiales’ temporary suspension until the case has been resolved.\nThings have moved from bad to worse for the embattled president as the world football governing body, FIFA has provisionally suspended him for three months. And protests against him in Spain have continued unabated. Despite his success with the women’s national team, the whole nation is against him.\nThose who are still with Rubiales may wonder why he is facing such huge condemnation but the anger of his critics is not over a ‘mere kiss’ in Sydney. The ongoing protests are about the right of women to enjoy the protection they deserve as athletes.\nIt is rather unfortunate that a tournament like the World Cup which provides a veritable platform for dismantling stereotypes and projecting the capabilities of female athletes was desecrated by a high ranking football authority whose lack of self-control has inevitably stained his country’s global success.\nHowever, Rubiales’ ordeal is a big lesson for those in positions of authority to learn. Today, gender equality activists are up in arms against him because he has failed to understand some of the dynamics within the sports industry especially as it concerns female athletes.\nWhat a sports administrator may do to a male athlete without dire consequences can easily consume him, if he tries it with the opposite sex. Therefore, sports administrators who do not have a proper understanding of gender dynamics in the world of sports will fumble and pay the price that Rubiales is paying presently.\nThis is because the voices of gender advocates are getting louder and the female athletes themselves have realised that once they unite on and off the pitch, they would easily confront and overcome most of the challenges that have continued to stifle their growth as athletes.\nIt’s a pity that Rubiales’ is not the only one suffering the consequences of his inappropriate behaviour. Since the kissing scandal started, his traumatised mother has been on a hunger strike.\nShe was recently rushed to a hospital in the Spanish town of Motril for medical help. According to CNN Sports, Angeles Bejar is protesting against what she calls the ‘inhuman, bloodthirsty hunt’ against his son. I doubt gender activists will be pleased with her assertion.\nUPDATE NEWS:\nNigerians can now invest ₦2.5 million on premium domains and profit about ₦17-₦25 million. All earnings paid in US Dollars. Rather than wonder, click here to find out how it works.",
  "word_count": 1136,
  "scraped_at": "2026-02-14T13:03:57.088808"
}