{
  "article_id": "4939ed8ca1f1",
  "url": "https://www.arsenal.com/news/arsenals-history-ballon-dor",
  "title": "Arsenal history with the Ballon dOr",
  "date": "20250922T103000Z",
  "domain": "arsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The 69th Ballon d'Or gets underway tonight, with a host of our stars across both the men's and women's teams nominated for the biggest honours.\nDeclan Rice and Viktor Gyokeres are in contention for the men's side, with an incredible seven of our women's team up for the Ballon d'Or Féminin after a stunning campaign which saw us lift the Champions League for the second time in our history.\nShould any of our players pick up either of the golden trophies, they will make history as the first player to win the awards while playing for Arsenal. So as our stars head to Theatre du Chatelet in Paris for tonight's festivities, let's take a look back at our past with the Ballon d'Or and Ballon d'Or Féminin.\nearly nominees\nFounded in 1956 by magazine France Football, it took us 23 years to have a contender for the title, coming in the shape of Liam Brady.\nOur Irish playmaker enjoyed a year to remember in 1979, helping us win the famous FA Cup final 3-2 against Manchester United by starting the move that would end with Alan Sunderland netting the winner. His heroics that year also earned him the PFA Players' Player of the Year, making him the first foreign player to win the award.\nBrady would finish seventh in the Ballon d'Or listings, with Keven Keegan winning the award after a fine season with German side Hamburg.\nDavid O'Leary, our all-time leading appearance maker, finished 22nd in 1980, and John Jensen placed 14th in the 1992 addition, were our next two nominees before six more nominations followed in a successful decade in the 1990s.\nAfter David Seaman finished 26th in 1996, Dennis Bergkamp featured in back-to-back Ballon d'Ors in 1997 and 1998. Our Dutchman's superb 1996/97 earned him fourth place in 1997, with Ronaldo winning overall.\nFollowing our Premier League and FA Cup double in 1997/98, Dennis placed eighth in the standings, with compatriot Marc Overmars finishing in 23rd position. Kanu's 23rd finish in 1999 rounded out the millennium for our nominations.\nhenry's nearly years\nThe early 2000s were some of our most successful times on the pitch, picking up two Premier League titles along with three FA Cups, all before 2005. That was reflected in our nominations to the Ballon d'Or, with one superstar in particular becoming a regular on the roster.\nThierry Henry joined us in 1999/00 and was nominated for the Ballon d'Or following his first campaign in N5, finishing fourth in 2000. The Frenchman would feature on every Ballon d'Or list until 2007, coming closest to winning the honour in 2003.\nIn a remarkable 2002/03 campaign, Thierry netted 32 times and created 24 assists, a record that saw him finish in second place at the Ballon d'Or awards, just behind Juventus' Pavel Nedved.\nTwo fourth-placed finishes in 2004 and 2005 then saw Thierry return to the top three in 2006 as his goals led us to the Champions League final and saw us say farewell to Highbury on a high. Henry finished third, behind Gianluigi Buffon and Fabio Cannavaro following their heroics for Italy at the World Cup in 2006.\nCesc Fabregas took up the mantle of regular nominations from Henry, finishing eighth, 19th, 12th, 20th and 21st between 2007-2011 before leaving for Barcelona.\nbrilliant beth\nIn December 2018, the Ballon d'Or Féminin was established, with players in the women's game now being recognised for their achievements on the pitch, as Lyon's Ada Hegerberg picked up the inaugural honour.\nSince then, we've had five placements for the women's award, with Vivianne Miedema placing fifth in 2019 following our Women's Super League title that year. Viv then finished in fourth place in 2021 after netting 25 times in 27 matches.\nIn 2022, Beth Mead came closest to glory following a superb campaign for both club and country. In Arsenal red, she scored 13 times in 37 appearances as well as being the top assist provider in the WSL in 2021/22. Beth then led England to a first European Championship on home soil, netting six times across the tournament to pick up the tournament's Golden Boot. Her efforts saw her finish in second place in the Ballon d'Or Féminin standings, narrowly behind Alexia Putellas.\nhistory beckons?\nThe last two seasons have seen nominations for both awards. Four players were nominated for the men's award in 2024, Martin Odegaard finishing the highest of the quartet in 19th position. Martin and Bukayo Saka were also nominated in 2023 with Katie McCabe on the list in 2022.\nBut could our players make history in tonight's awards ceremony?\nAn incredible nine players have been nominated across both awards, a club record going into the event with seven on the Ballon d'Or Féminin. Emily Fox, Leah Williamson, Steph Catley, Frida Maanum, Alessia Russo, Chloe Kelly and Mariona Caldentey are all in with a shot for tonight's prize.\nThree of our nominees went on to win the European Championships for a second time after the Champions League heroics, with Russo netting in the final and Kelly slotting home the winning penalty in the shootout against Spain. Meanwhile, Mariona, who also scored the Euros final for Spain, has already been honoured for her incredible first season with us, picking up the PFA Women's Players' Player of the Year in August.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 912,
  "scraped_at": "2026-02-14T12:36:42.772745"
}