{
  "article_id": "4953e03c9d5f",
  "url": "https://www.maitlandmercury.com.au/story/8491508/maitland-sign-former-national-league-player-paige-kingston-hogg/",
  "title": "Maitland sign former national league player Paige Kingston - Hogg | The Maitland Mercury",
  "date": "20240119T010000Z",
  "domain": "maitlandmercury.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Maitland have signed former national league players Paige Kingston-Hogg and Alesha Clifford with coach Keelan Hamilton confident the gaps have been filled after several key losses.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe Magpies are targeting another strong NPLW Northern NSW season after finishing third last year to seal their first finals appearance.\nThey bowed out to Newcastle Olympic in the preliminary final but were NNSW Football Women's State Cup winners and played in the inaugural League Cup decider.\nMaitland have lost goalkeeper Imogene Tomasone, defender Madi Gallegos and attacking player Mercedes McNabb to Broadmeadow, who beat Newcastle Olympic 2-1 in last year's grand final.\nLast year's leading scorer Chelsea Greguric, who produced 19 goals for the Magpies in 2023, is playing in Sydney while fullback Emily Wicks, midfielder Lisa Cochrane, striker Lucy Kell and versatile Ainsley Childs are not playing.\nBut the Magpies have recruited well, picking up former Newcastle Jets midfielder Kingston-Hogg from Manly.\nThe 23-year-old last played in NPLW NNSW for Newcastle Olympic in 2022, when she returned from a lengthy stint on the sidelines after a knee reconstruction.\nThe Magpies have also signed Olympic pair Clifford, who has extensive experience at national league level and can play anywhere, and fleet-footed forward Georgia Amess.\nAmess was part of Hamiton's premiership and championship-winning squad at New Lambton in 2019.\n\"There's been a bit of change,\" Hamilton said.\n\"We've had three choose to go to Broadmeadow. It's a bit disappointing from our point of view but money talks and those people have got to make their own decisions for what they want to do.\n\"But gains we've done quite well. I think we've filled those gaps. The group had been together for a few years. People sometimes look for different opportunities and it's probably not a bad thing for us to refresh the group a little bit.\n\"The vibe around training has always been good but it's been good through the pre-season with a bit of fresh blood and a fresh life in the group, which is a positive thing.\"\nMaitland have also picked up midfielder Yasmin Popovic, who came through the Jets academy and played for Macarthur Bulls academy in Sydney last year, as well as defender Charli O'Connor from Adamstown.\nThe Magpies will open their 2024 NPLW NNSW campaign away to Charlestown Azzurri on February 24.\nBut, before that, they face Magic in the inaugural NNSWF Charity Shield match at Jack McLaughlan Oval on February 16.\n\"Results-wise last year we did really well,\" Hamilton said.\n\"We were in the premiership race. We made both Cup finals. We got knocked out in the preliminary final probably a little bit unluckily.\n\"I think we were right there with the top two, so for us it's more about trying to evolve our football and keep improving that. We want to try to keep helping our individuals get better and become more proficient.\n\"If we do that, we've got a strong enough squad where we'll be there or thereabouts and once we get to that back end of the season we can start to evaluate where we finish. But we're aiming to be right at the very top.\"\nAlong with Clifford and Amess, Olympic have lost captain and attacking midfielder Laura Hall, who is taking the year off.\nLast year's beaten grand finalists have signed midfielder Evie Horgan from Azzurri and versatile Kiera Bainsfair from Central Coast Mariners Academy.\nMeanwhile, Magic have also picked up striker Lilly-Jane Babic from Azzurri along with the Maitland trio.\nBroadmeadow, who will be coached this season by Nima Nikfarjam, have lost plenty of experience with former national league players Alison Logue, Kirstyn Antoni and Gemma Harrison hanging up the boots.\nLivewire attacker Lucy Jerram has also left while Nikfarjam confirmed back-to-back NPLW leading scorer Adriana Konjarski is back at Magic training along with captain Kalista Hunter and player of last year's grand final Kobie Ferguson.\nNPLW NNSW starts on Saturday, February 24 with Maitland away to Azzurri, Mid Coast at home to Warners Bay, Magic hosting New Lambton and Adamstown taking on Olympic.",
  "word_count": 682,
  "scraped_at": "2026-02-14T12:57:23.454284"
}