{
  "article_id": "495780ad6f38",
  "url": "https://www.fourfourtwo.com/features/biggest-fa-cup-final-shocks",
  "title": "Biggest FA Cup final shocks",
  "date": "20250523T104500Z",
  "domain": "fourfourtwo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Biggest FA Cup final shocks\nAfter Crystal Palace's win over Manchester City last Saturday, a look at some of the biggest upsets and surprises in FA Cup finals over the years...\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nManchester City went into last Saturday's FA Cup final as big favourites against a Crystal Palace side without a trophy in their entire history.\nBut Palace came out on top at Wembley thanks to Eberechi Eze's first-half goal to win the cup for Oliver Glasner's side and spark huge celebrations in south London.\nDespite City's struggles in 2024/25, the result was still a surprise. Here, a look at some of the biggest upsets in FA Cup finals over the years...\nNotts County 4-1 Bolton Wanderers (March 31st, 1894)\nNotts County beat Bolton Wanderers 4-1 at Goodison Park in March 1894 to become the first team from outside England's top flight to win the FA Cup.\nJames Logan scored a hat-trick for the Magpies and Arthur Watson got the other in a one-sided contest, with Jim Cassidy on target for Bolton late in the game.\nTottenham Hotspur 3-1 Sheffield United (April 27th, 1901)\nTottenham Hotspur are seven-time winners of the FA Cup, but Spurs' first triumph in the competition came as a Southern League team back in 1901.\nAfter a 2-2 draw with Sheffield United in front of a world record crowd of 110,820 at Crystal Palace, Tottenham beat the Blades 3-1 in a replay at Bolton's Burnden Park and remain the only team from outside the Football League to have won the FA Cup.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nWolverhampton Wanderers 3-1 Newcastle United (April 25th, 1908)\nNewcastle United finished fourth in the First Division in 1907/08, but the Magpies lost the FA Cup final to second-tier Wolverhampton Wanderers.\nWolves, ninth in the Second Division that season, beat Newcastle 3-1 at Crystal Palace thanks to goals from Kenneth Hunt, George Hedley and Billy Harrison.\nBarnsley 1-0 West Bromwich Albion (April 24th, 1912)\nThe 1912 FA Cup final between Barnsley and West Bromwich Albion was an evenly contested affair which was eventually decided late in extra time after a replay.\nThe two teams drew 0-0 at Crystal Palace in the first fixture and the replay at Bramall Lane also finished goalless after 90 minutes, with second-tier Barnsley winning it thanks to a Henry Tufnell goal with extra time reaching its end.\nCardiff City 1-0 Arsenal (April 23rd, 1927)\nCardiff City beat Arsenal 1-0 in the 1927 FA Cup final to become the first and only club to this day from outside England to claim the trophy.\nHugh Ferguson, a Scot, scored the only goal of the game in the 74th minute to give the Welsh side a famous win at Wembley. In terms of league positions, though, it was not such a big shock as Arsenal had finished 11th in the First Division that season and Cardiff in 14th.\nWest Bromwich Albion 2-1 Birmingham City (April 25th, 1931)\nWest Bromwich Albion won the FA Cup for a third time in 1931 and the Baggies claimed the trophy as a Second Division team.\nAfter finishing second to earn promotion to the top flight, West Brom beat First Division Birmingham City 2-1 in the final at Wembley, with W. G. Richardson getting both goals for the Baggies.\nLeeds United 0-1 Sunderland (May 5th, 1973)\nSunderland beat Leeds United by a single goal in the 1973 FA Cup final to become the first Second Division side to claim the trophy since West Bromwich Albion in 1931.\nIan Porterfield scored the only goal of the game as a Sunderland side featuring no international players shocked their First Division opponents. The 1973 FA Cup remains the Black Cats' last major trophy.\nManchester United 0-1 Southampton (May 1st, 1976)\nThe 1976 FA Cup final featured a Manchester United team that had finished third in the First Division against a Southampton side that had come sixth in the second tier.\nBut a late goal from Bobby Stokes gave the Saints a shock victory and a first-ever major trophy for their men's team. A week earlier, Southampton's women had also won the women's FA Cup final, making the Saints the first club to triumph in both competitions in the same season.\nArsenal 0-1 Ipswich Town (May 6th, 1978)\nIpswich Town finished 18th out of 22 teams in the 1977/78 First Division, but Bobby Robson's side beat fifth-placed Arsenal in the FA Cup final in May.\nIn the 50th FA Cup final played at Wembley, Roger Osborne scored the game's only goal with a left-footed shot from 10 yards out after 77 minutes to win the trophy for the first time in Ipswich's history.\nWest Ham 1-0 Arsenal (May 10th, 1980)\nWest Ham were a Second Division side in 1979/80 and the Hammers were not given much hope of beating Arsenal in the FA Cup final that season, with the Gunners having finished fourth in the top flight and featured in the previous two finals.\nBut Trevor Brooking's 13th-minute header was the only goal of the game as West Ham edged out Arsenal to claim the trophy for a third time in the club's history.\nCoventry City 3-2 Tottenham Hotspur (May 16th, 1987)\nIn a fine season under David Pleat in 1986/87, Tottenham Hotspur finished third in the First Division and were big favourites heading into the FA Cup final against Coventry City.\nClive Allen opened the scoring at Wembley with his 49th goal of the season in all competitions, but Coventry twice came from behind and won an entertaining final in extra time courtesy of a Gary Mabbutt own goal.\nLiverpool 0-1 Wimbledon (May 14th, 1988)\nLiverpool finished as First Division champions in 1987/88, 43 points ahead of seventh-placed Wimbledon.\nBut the Crazy Gang shocked the Reds in the FA Cup final at Wembley as Lawrie Sanchez scored for the Dons in the first half and Dave Beasant saved a Johm Aldridge penalty in the second period. In doing so, Beasant became the first goalkeeper to save a penalty in an FA Cup final.\nEverton 1-0 Manchester United (May 20th, 1995)\nEverton finished 15th in the Premier League in 1994/95, a massive 38 points behind Manchester United.\nAlex Ferguson's side were narrowly beaten to the title by Blackburn Rovers and were defeated 1-0 by Everton in the FA Cup final, with Paul Rideout's header winning the match for the Toffees at Wembley. It was Everton's fifth FA Cup win and remains the club's most-recent trophy.\nManchester City 0-1 Wigan Athletic (May 11th, 2013)\nManchester City finished second in the Premier League in 2012/13 to rivals Manchester United and the Sky Blues were surprisingly beaten by Wigan Athletic in the FA Cup final at Wembley in May.\nCity's Pablo Zabaleta was sent off six minutes from time with the scores still level, becoming only the third player to receive a red card in an FA Cup final. And with extra time looming, Ben Watson headed home from a corner to secure a shock win for Wigan.\nChelsea 0-1 Leicester City (May 15th, 2021)\nChelsea won the Champions League in May 2021, with victory over Manchester City in the final, but the Blues were beaten by Leicester City in the FA Cup showpiece at Wembley two weeks earlier.\nYouri Tielemans scored the only goal of the game with a fine long-range effort to seal a first-ever FA Cup for the Foxes in front of a reduced crowd of 20,000 fans due to Covid-19 restrictions.\nCrystal Palace 1-0 Manchester City (May 17th, 2025)\nEberechi Eze's first-half goal gave Crystal Palace a 1-0 win over Manchester City in this season's FA Cup final and sealed a first-ever trophy for the south London club.\nPalace goalkeeper Dean Henderson saved a penalty from City's Omar Marmoush and was also fortunate to escape punishment for handling outside his area, but City were unable to find a way through as the Eagles held on for a famous victory at Wembley.\nBen Hayward is a European football writer and Tottenham Hotspur fan with over 15 years’ experience, he has covered games all over the world - including three World Cups, several Champions League finals, Euros, Copa America - and has spent much of that time in Spain. Ben speaks English and Spanish, currently dividing his time between Barcelona and London, covering all the big talking points of the weekend on FFT: he’s also written several list features and interviewed Guglielmo Vicario for the magazine.",
  "word_count": 1526,
  "scraped_at": "2026-02-14T12:50:30.700584"
}