{
  "article_id": "495bb8676bd0",
  "url": "https://hoganstand.com/Ladies/Article/Index/334697",
  "title": "  I decided that I would just join the local club and that was the best decision ever  ",
  "date": "20241228T044500Z",
  "domain": "hoganstand.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Mungret St Paul's goalkeeper Carol Bateman. Photo by Seb Daly/Sportsfile\nBy Daire Walsh\nSeveral years after first joining forces with the club, Mungret St Paul’s goalkeeper Carol Bateman was thrilled to achieve All-Ireland success with her ‘home from home’ at Parnell Park last Sunday week.\nA native of West Cork, Bateman previously lined out at underage level for Rosscarbery in the Rebel County. She subsequently took a break from ladies football, before eventually returning to the sport in the colours of Mungret upon moving to Limerick for work in 2017.\nThere are many others within their current squad that ended up at the club under similar circumstances and Bateman believes this has helped the Mungret players to form a unique bond in recent years. This was evident at Parnell Park a few weeks ago when the Treaty women claimed the AIB All-Ireland Junior Club Championship title with a 0-12 to 0-4 final victory over Na Dúnaibh of Donegal.\n“I grew up down there [West Cork] and just moved to Limerick for work. I decided that I would just join the local club and that was the best decision I’ve ever made, to be honest. I’ve made friends here for life now at this stage,” Bateman said.\n“I know most club teams are girls that have grown up with each other from day dot. Gone to school together, played since U12. There is a core group of girls in Mungret that are local and they’ve played since they were U12 together. A unique part of Mungret and I think it still bonds us together, but in a slightly different way, is that there is an awful lot of ‘blow-ins’.\n“I think there are five girls on the team from Cork alone. There are three from West Cork and there are two from the northern side of Cork city. There are girls from Kerry, girls from Kildare, Monaghan. There’s a girl from Down, Derry, all over. It definitely bonds us in a different way, but we’re still all one big family and it definitely is home from home for a lot of people now.”\nWhile their Munster and All-Ireland triumphs came in the junior grade, Mungret’s first significant title of 2024 was a level above in the Limerick intermediate championship – a tense 0-10 to 0-9 win at the expense of Knockainey at Cappamore on October 6 ensuring that John Horgan’s charges came away with the second-tier county title.\nConsidering their All-Ireland final opponents Na Dúnaibh initially came from the Donegal junior championship before adding a provincial crown to their list of honours, Bateman feels operating at a higher grade throughout 2024 stood to Mungret during their showpiece clash in Parnell Park.\n“Even when we were playing league at the start of the year, we actually played Division One senior league in Limerick. We would have been coming up against senior teams in Limerick and I think the only team we lost to this year was actually the team that ended up winning the senior championship, St Ailbe’s.\n“That hardened us from the start, being able to play higher opponents, higher level opponents. When it came to it, us being at a slightly higher grade definitely was a bonus, having those slightly harder games to have come through.”\nDuring her childhood, Bateman made a number of trips up to Dublin to see a local hero donning the red of Cork with great distinction. Rosscarbery’s Laura MacMahon was a part of the Rebelettes panel from 2007 to 2012 and left a strong impression on Bateman as she helped her county to win five TG4 All-Ireland senior championships in this period.\nThe idea of one day togging out at Croke Park is something that appealed to Bateman and last year’s All-Ireland finals day saw this becoming a reality for the biomedical engineer. Having joined the Limerick panel at the beginning of the previous season, she was between the sticks for her adopted county as they faced Down in the TG4 All-Ireland junior football championship decider of 2023.\nAn Orla Swail goal ultimately propelled their Ulster counterparts towards a 1-7 to 0-8 success, but Bateman nevertheless reflects fondly on playing for the Treaty County in GAA HQ.\n“I think it’s only sinking in this year when you look back and you can say that you actually got to walk out in Croke Park with your family and friends all supporting you. I think there was a bus load of supporters came up from Mungret. They were behind one of the goals that I was standing in, I think in the second half, and I could hear them throughout the game.\n“I know the result didn’t go our way, but still to have the support of everyone around, it’s amazing to be able to say you got to play in Croke Park. You walked out, you did the parade. It is cool, to be fair. I cannot complain.\n“I’ve gone up to a couple of the ladies finals and it’s almost like a full circle moment. Being there as a little supporter, watching your idols on the pitch. Now I walk down into the club and there’s little girls coming up to me and they’re like ‘oh, I want to be a goalie when I grow up’. It’s amazing. It’s so cool to help inspire the next generation as well.”\nAlthough their latest quest for All-Ireland junior glory ended in a semi-final defeat to eventual champions Fermanagh in July, this year saw Limerick earning promotion to Division Three of the Lidl National Football League for 2025.\nThis will be their first time competing at this tier of the NFL since 2017 and with five of their seven opponents set to feature at intermediate level, Bateman is convinced being in Division Three will stand them in good stead come next summer’s championship.\n“It’s going to be a huge asset to us as well in the championship, I think. You’re battle hardened, you’re coming up against hard teams, you have to be ready to go. I think it will stand to us starting the league now,” Bateman added.\n“Personally I’ll be like ‘we have something to prove’. I’m sure it will stand to us hopefully when it comes to championship as well, when we have played Division Three league for the start of the season.”\nTweet",
  "word_count": 1058,
  "scraped_at": "2026-02-14T12:48:44.601368"
}