{
  "article_id": "497210052158",
  "url": "https://www.burntorangenation.com/2023/3/29/23661999/longhorns-daily-news-duce-robinson-usc-georgia-sec-big-ten-texas-arch-manning",
  "title": "Longhorns Daily News : The Duce Robinson recruiting saga looks to finally end tomorrow",
  "date": "20230329T210000Z",
  "domain": "burntorangenation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Will he, or won’t he? And where? Those are the questions that have followed the recruitment of five-star 2023 tight end Duce Robinson, who’s reportedly narrowed his options down to the USC Trojans (the likely bet, for now) and the Georgia Bulldogs.\nLonghorns Daily News: The Duce Robinson recruiting saga looks to finally end tomorrow\nPlus: We stan Rodney Terry\nStill, a twist is always possible ... even for the Texas Longhorns.\nWHAT THEY’RE SAYING ABOUT THE LONGHORNS\nAustin American-Statesman: Bohls: Rodney Terry checks every important coaching box at Texas\nAustin American-Statesman: Rodney Terry: Becoming a Texas basketball head coach ‘a dream come true’\n247Sports: Rodney Terry vows to make Texas a ‘Monday night program’ and shows off his connection with players\nInside Texas: Rodney Terry’s track record in his prior college head coaching stints\nInside Texas: T.J. Ford sees success in Texas’ future under ‘an excellent man’ in Rodney Terry\nInside Texas: Texas is developing its EDGEs, and a real competition is the result\nInside Texas: On Texas Football - State of the Program: A discussion of every position on the Longhorn football team\nInside Texas: Team notes from Texas spring practice No. 7\nICYMI IN BURNT ORANGE NATION\nRECRUITING ROUNDUP\nInside Texas: Longstanding connections help in recruiting, and Texas’ efforts at Arlington Martin are evidence\nInside Texas: Texas target: ‘Texas will definitely be one of my official visits’\nInside Texas: The 2023 Texas Relays Preview: Longhorns edition\nInside Texas: 2024 On3 four-star Bennett Warren recaps UT visit, recruitment\nBIG 12 BREAKDOWN\nDallas Morning News: 5 things to know about the NCAA Women’s Final Four in Dallas at American Airlines Center\nCrimson and Cream Machine: Oklahoma Football: Talking tempo and the OU offense\nWHAT WE’RE READING\nSB Nation: The Jets lost their leverage in an Aaron Rodgers trade\nSB Nation: The women’s Final Four is loaded with star players and tantalizing storylines\nSB Nation: The Gwyneth Paltrow ski incident is the wildest sports lawsuit of all time\nNEWS ACROSS LONGHORN NATION AND BEYOND\n- This guy.",
  "word_count": 337,
  "scraped_at": "2026-02-14T13:33:43.750491"
}