{
  "article_id": "49807a7aa016",
  "url": "https://www.thelocal.de/20250723/today-in-germany-a-roundup-of-the-latest-news-on-wednesday-79",
  "title": "Today in Germany : A roundup of the latest news on Wednesday",
  "date": "20250723T071500Z",
  "domain": "thelocal.de",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "German women's football team to play Spain in the Euros semifinals\nThe German team is set to face off against Spain in the Women’s Euro 2025 semifinal, which takes place on Wednesday, with kick-off at 9pm CET.\nSpain is the favourite to win going into the match, but Germany did beat them last time the two teams met - at a bronze medal match in the Olympics in 2024.\nThe winner of Wednesday's match will move on to face England in the final after the Lionesses managed to squeeze through against Italy.\nREAD ALSO: How you can watch the women's Euro 2025 tournament on German TV\nClimate protection report: Germany at risk of missing long-term targets\nGermany is currently at risk of missing its climate targets for 2040 and 2045, according to a report by Politico which highlighted the government's as yet unpublished Climate Protection Report 2025.\nIn the medium term, Germany is on target across all sectors, but in the period after 2030 targets would begin to be missed.\nAccording to the report, there is currently a positive trend in terms of reducing greenhouse gas emissions. However, the decline would slow down from 2030 if no countermeasures are taken.\nThe transport and buildings sectors will remain problem areas even for the years up to 2030.\nINTERVIEW: 'Failed climate policies are fuelling far-right politics in Germany'\nA decline in emissions is particularly noticeable in the transport sector. However, not only is the initial level very high, but “there is still no sign of a trend reversal in the sense of an accelerated reduction”, the magazine quotes from the climate protection report.\nIt was reported earlier this week that the current conservative-led black-red government was looking at reversing taxes on passenger flights from German airports, a move which would be expected to increase transport emissions by encouraging more air travel.\nForty-three Iraqis deported from Germany to Iraq\nOn Tuesday, 43 people were taken to Iraq on a deportation flight from Leipzig to Baghdad, as confirmed by the Federal Ministry of the Interior and the Ministry of Migration of Thuringia, which was in charge of the operation.\nFederal Interior Minister Alexander Dobrindt (CSU) explained in Bild that he wanted “more pressure on repatriations, more deals with third countries, and a break with the logic of human traffickers.”\nAccording to information from Thuringia, the plane carried 43 single men who were required to leave the country, some of whom had already come into contact with the criminal justice system in the past.\nFourteen of them had previously lived in Thuringia, while the rest came from seven other federal states. The passengers were taken to the plane in small police buses and two larger airport buses and taken on board by officers.\nREAD ALSO: Germany presses ahead with deportations to Afghanistan\nLast Friday, a deportation flight to Afghanistan also took off from Leipzig Airport. According to official figures, there were 81 men on board.\nThe security situation in Iraq remains tense after decades of war and political unrest. According to UN figures, 1.2 million people are internally displaced, and three million people are dependent on humanitarian aid.\nMerz defends Germany's non-participation in appeal against Gaza war\nChancellor Merz defended Germany's non-participation in a call by 28 countries for an immediate end to the war in the Gaza Strip.\nOn Monday, 25 countries, including the UK, France, and Italy, issued a joint statement calling for an immediate end to the war in the Gaza Strip. Yesterday, three more countries and the EU Commission joined them. The signatory countries call on Israel to “comply with its obligations under international humanitarian law” and to immediately lift restrictions on aid deliveries to the area.\nAt a press conference in Berlin, Merz himself called on the Israeli government to stop the massive military intervention, allow a ceasefire, and enable humanitarian aid for the population of Gaza, but did not explain why the German government was not among the signatories of the joint statement.\nREAD ALSO: Everything that changes in Germany in August 2025\nJürgen Hardt, foreign policy spokesman for the Union faction, told the Frankfurter Allgemeine Zeitung that Foreign Minister Wadephul hadn’t sign the statement because it only reinforced the perceived isolation of the Israeli government.\nAccording to reports, the SPD is increasing pressure on the CDU and CSU to sign the letter retroactively.\nSuspect alerts police to three bodies in Zwiesel, Bavaria\nInvestigators have discovered three bodies in a dilapidated apartment building in the small town of Zwiesel in Lower Bavaria – following a tip-off from the 37-year-old alleged perpetrator himself.\nPolice subsequently found a 22-year-old woman and a 56-year-old man dead at his home address in the Regen district, according to a police spokeswoman. The body of a third adult, believed to be a woman, was not initially identified. The police spokeswoman declined to comment on media reports that the third body had been found dismembered in a refrigerator.\nThe bodies were discovered after the alleged perpetrator confessed to the crime to police in Linz, Austria, 140 kilometres away from Zwiesel. The man was first approached by police after a passers-by called them, saying that he appeared to be drunk and confused, according to a statement by the Upper Austria State Police.\nNo information has been released yet about the circumstances of the deaths, the location and time of the crime, or the exact location of the bodies in the house.\nWith reporting by DPA, AFP and Paul Krantz.",
  "word_count": 912,
  "scraped_at": "2026-02-14T12:12:37.419209"
}