{
  "article_id": "498f89d792f6",
  "url": "https://www.thetimes.com/life-style/luxury/article/saudi-arabia-travel-best-resorts-six-senses-southern-dunes-desert-rock-shebara-times-luxury-fxphtlq28",
  "title": "Saudi Arabia new travel hotspots in a 21st - century oasis",
  "date": "20251227T051500Z",
  "domain": "thetimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In the tourist boom of the past 20 years that has seen Gulf states from Oman to Dubai become popular destinations, one name has been conspicuous by its absence: Saudi Arabia. That is about to change.\nTrillions of dollars are being spent on development projects to create resorts, hotels and luxury villas in Tabuk Province via the development agency Red Sea Global. Six new luxury resorts have already opened, featuring international brands including Six Senses, St Regis and Ritz-Carlton. Two more will launch by the end of the year, with eight more due to open throughout 2026. By 2030, there will be 50 high-end resorts and more than a thousand residential properties with marinas, golf courses and leisure facilities scattered across a wide swathe of desert and coastal locations. Numbers will be capped at a million visitors a year to preserve the Red Sea ecosystem.\nIf Saudi Arabia has not appeared yet on bucket lists, then wait a moment. It will.\n2030 is a key date. Almost a decade ago, the crown prince and prime minister, Mohammed bin Salman, announced a huge development project known as Saudi Vision 2030, an array of initiatives to reform the country socially, culturally and economically. There have already been significant social changes, including the lifting of many of the restrictions placed on women who are now able to work in high-level positions in business and a range of professions. But the real thrust of the 2030 project is the diversification of the economy.\nWith deep pockets and pharaonic ambition, investing the kind of money that makes you wonder if you have the zeroes right, Saudi Arabia has embarked on projects of jaw-dropping proportions. Tourism is central to many of them. Owned by the government’s Public Investment Fund chaired by Bin Salman, Red Sea Global aims to make the northwest coast and desert a luxury destination that will far outstrip the Egyptian version on the other side of the Red Sea.\nAs well as reforming their own society and economy, the Saudis are also trying to change the perception of their country, to give it a cuddlier image. They are pouring money into sports, hosting Formula 1 and the 2034 Fifa World Cup, and creating a football league of extravagantly paid ageing stars. Of course, the figure of Mohammed bin Salman, who stands accused of complicity in the death of critics like Jamal Khashoggi — he denied ordering the murder but has accepted responsibility — is probably not doing this rebranding any favours. But Saudis do not deserve to be judged by the sins of their government any more than any of us. I set off from Jeddah humbled by Saudi hospitality.\nOn the one-hour flight north, I gazed down on a barren shore and on empty islands in a sea of turquoise and blue. Emerging from arrivals at the new Red Sea airport, I found my ride matching the maritime palette. A turquoise Mercedes was purring at the kerbside.\n• Read our Saudi Arabia travel guide for what to do and where to stay\nWe drove an hour on an empty highway across a desert where camels hovered in the meagre shade of acacia trees like commuters waiting for a bus that never came. The landscape was both desolate and strangely beautiful. Empty stretches of sand and gravel, broken by dunes and low hills, extended beneath a hot white sky. Somewhere we passed a village of cubist houses, barnacled with air-conditioning units. In a wadi was a scattering of black tents. Rural Saudis don’t live in traditional tents any more; they have left them to the Ethiopian and Sudanese immigrants they employ as herdsmen.\nFirst stop was a familiar name — Six Senses’ Southern Dunes resort. Red Sea Global runs some of the new properties itself but has licensed established luxury brands to manage others. Southern Dune was a desert oasis. At its heart was an elegant atrium beneath high latticed “umbrellas” casting dappled shade over gardens and winding pathways. Birds flitted between the palm trees.\nBeyond, the villas stretched out into the desert. They reflected the landscape: sand-coloured walls, soaring roofs like tents or the fluid shapes of dunes. The interiors had a minimalist, uncluttered vibe with wide glass doors overlooking a porch with a swing and those compelling desert hills beyond. Offsetting the earth tones were sudden moments of colour and complexity: Arabian calligraphy, faded cushions and bolsters, rich carpets, swagged ceiling fabrics, the kind of coloured tassels that adorn caparisoned camels.\nWellness is at the centre of any Six Senses property. At Southern Dunes, the Merkaz restaurant, a sort of tapas bar for health freaks, erased any sense that a vegan menu was dull. Down in the subterranean spa, where you could pass whole days in pampered hibernation, the subtext of the endless anti-ageing treatments, from the alchemy bar to the infrared face masks, seemed to be that I was no longer at my peak. After a wellness consultation I had a delightful massage with a masseuse from Kerala and a sound therapy journey in the yoga studio that involved gongs, chimes, ringing bowls and a drum that mimicked the sound of waves. In the soothing ambience, I dozed off and missed some of it.\n• Luxury resorts now swarm Saudi Arabia… but will westerners come?\nLess soporific was an actual journey: a hike in the dunes, with their long, sensual lines. Late-afternoon shadows pooled in their hollows. I climbed a smooth flank to a ridge where we looked out towards the black and russet basalt of the Hejaz mountains. In the distance, the guide pointed out a large habeez dune. Locals say it makes a tapping sound and believe desert djinns (supernatural creatures) live inside. Camels strolled about in the middle distance in loping slow motion, nibbling on thorny scrub. In the first months, the guide said, they didn’t realise they needed to fence the property, until they woke one morning to find the swimming pool full of happy camels.\nAt my next stop, Desert Rock, owned and operated by Red Sea Global itself, things started to get theatrical. A car dropped me at a small and innocuous booth in the desert. I followed a path, winding through a narrow defile of pink basalt.\nAt the end I emerged suddenly in a hidden desert valley. Opposite, commanding the valley, was a mountain massif. The mysterious arrival, and then the legions of uniformed staff with earpieces shuttling back and forth in golf carts, did make Desert Rock feel a little like the lair of some evil mastermind intent on taking over the world. I kept thinking I might open a secret door and find 007 shackled to the wall while a man stroked a white cat.\nBut a lair with charming international staff; with menus curated by Osman Sezener, the Michelin-starred restaurateur and one of the pioneers of the farm-to-table movement; with brilliant soundtracks by Aneesh Gera (classical at breakfast, cool jazz at dinner); a kids’ club; a series of desert adventures from quad biking to mountain climbing; a full-on spa offering every conceivable treatment; and an observatory where you can sip signature mocktails while watching the desert glow with sunset colours. At night, the black skies bustled with stars, a contrast to the empty desert.\n• My holiday in Saudi Arabia: the world’s most controversial country\nDesigned by Oppenheim Architecture, the whole resort is integrated into its landscape, echoing the sculptural rock formations. The Wadi Villas were scattered like an encampment across the floor of the valley. The Cliff Hanging Villas and the Mountain Crevice Villas were suspended spectacularly from the heights of the massif, while the troglodyte Cave Villas were carved into the mountain itself, their terraces and pools opening at the cave mouth to stunning views of the valley below. All had private pools, and shared that minimalist desert design aesthetic of soaring roofs and tall spaces, dark wood and sand-coloured walls.\nAnother car, this one pink as candyfloss, arrived to whisk me to the Red Sea coast for the 45-minute crossing to Shebara Island. If the two desert properties seem to have grown organically out of their landscapes, Shebara might have been lowered from the heavens. It was dreamy, unreal, celestial.\nNot for Shebara the usual driftwood vibe with palm and thatch villas of a typical tropical island resort. Here, both overwater and beachfront villas are futuristic stainless-steel pods. Their mirrored exteriors create stunning visual effects carrying reflections of the sea and sky. In a certain light, they seemed to disappear entirely, their surfaces vanishing into their surroundings. Interiors are remarkably spacious — some have two bedrooms — with curving surfaces of marble, mirrors and pale leather, and floor-to-ceiling windows leading to large pools.\n• Read more luxury reviews, advice and insights from our experts\nShebara has beaches of such pristine sands that I wondered if they were real. So too the sea. Saudi Arabia’s reefs make you realise how much the marine environment has been degraded on the Egyptian side of the Red Sea, and even how much has been lost in places like the Maldives. I went snorkelling in a coral wonderworld. In the latticed light of the reef, a school of bigeye trevally fish hurried by as if late for some piscine appointment. A regiment of fusiliers appeared, royal blue and bright yellow, then wheeled suddenly in unison as if a command had been given. A parrotfish nosed across a skull of brain coral like a sniffer dog. The cartoon lips of a giant clam, iridescent blue and more than four feet long, snapped shut as I passed. Finally the rays appeared, emerging from a blue void, balletic, spectacular, sailing on wide wings, while the inscrutable ancient face of an olive ridley sea turtle gazed up at me.\nIn the evening I walked the length of the boardwalk past egg-shaped villas pods to dine at iki.roe, with its menu of Nikkei dishes. I sat outside, the winds warm, constellations animating the night sky. The long line of Shebara’s villa pods seemed to float in midair, untethered. The two desert properties had seemed connected to Saudi Arabia, their design reflective of Saudi landscapes. But on Shebara I felt I could be anywhere, marooned on an island, mid ocean. I liked the sensation, that delightful sense of simply being adrift, between sea and sky.\nStanley Stewart was a guest of Six Senses Southern Dunes (doubles from £672, sixsenses.com); Desert Rock (£1,420, desertrock.sa); and Shebara (£1,520, shebara.sa)",
  "word_count": 1750,
  "scraped_at": "2026-02-14T12:37:06.458397"
}