{
  "article_id": "49c71813d523",
  "url": "https://www.miragenews.com/mcgowan-government-takes-field-at-state-975719/",
  "title": "McGowan Government takes field at State Football Centre",
  "date": "20230328T061500Z",
  "domain": "miragenews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "- The $45.96 million State Football Centre will be managed by the State Government\n- Joint State and Federal funded facility will form a key training ground for the FIFA Women's World Cup in July\n- New facility will provide more opportunities for grassroots participation in football\nThe $41.67 million State Football Centre in Queens Park is close to completion in time for the FIFA Women's World Cup in July.\nWith just four months until kick off, the McGowan Government today announced that the facility will be vested with the State Government's venue management agency VenuesWest.\nThe Centre is located on a 16 hectare site and includes a two-storey building with a grandstand, two competition pitches and training pitches, on-site parking, and three 5-a-side playing pitches.\nThe $45.96 million investment has been jointly funded by the State and Commonwealth Governments, with $25.42 million being provided by the McGowan Government.\nThe vestment of the State Football Centre with VenuesWest, brings the number of venues in their portfolio to 14, with this venue the first to be solely dedicated to the 'beautiful game'.\nFootball West will manage the day-to-day running of the venue, including the management of commercial sponsorships. VenuesWest will own the asset on behalf of the State Government and assist Football West through the co-management agreement and oversee ongoing maintenance of the asset.\nThe arrangement means that Football West now has a space in the State that the sport can call 'home'.\nInternational and A-League football matches will continue to be held at HBF Park or Optus Stadium, with occasional lower-capacity special events to be held at the State Football Centre.\nThe State Football Centre is expected to be one of two venue specific training sites used by teams competing in the upcoming FIFA Women's World Cup 2023.\nAs stated by Sport and Recreation Minister David Templeman:\n\"Western Australia has a thriving football community, and the development of facilities like these provide incredible opportunities for more people to get involved in grassroots sport.\n\"The collaboration between VenuesWest and Football West will provide a unique opportunity for football in Western Australia and enable development of the sport from grassroots programs to high performance teams.\"\nComments to be attributed to Cannington MLA Bill Johnston:\n\"I have been watching the construction of the new State Football Centre with interest, as I know that there are many locals who can't wait to see it operational.\n\"It is going to be an exciting time with the FIFA Women's World Cup kicking off in just a few months' time and I am sure this facility will be buzzing with players and fans in anticipation.\"",
  "word_count": 438,
  "scraped_at": "2026-02-14T12:25:19.008658"
}