{
  "article_id": "49e3436bb294",
  "url": "https://www.dubaicityguide.com/site/news/news-details.asp?newsid=77384",
  "title": "Mansoor Bin Mohammed Crowns Winners Of 15th Globe Soccer Dubai Awards # Dubai",
  "date": "20241228T140000Z",
  "domain": "dubaicityguide.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "|\nHis Highness Sheikh Mansoor bin Mohammed bin Rashid Al Maktoum, Chairman of the Dubai Sports Council (DSC), today crowned the winners of the 15th Globe Soccer Dubai Awards at ceremony held at Atlantis, The Palm.\nThe prestigious annual gala, held in conjunction with the 19th Dubai International Sports Conference, celebrates excellence in playing, coaching, and management within the international football community.\nNotable winners included Real Madrid sensation Vinicius Jr, honoured as Best Player, and Real Madrid boss Carlo Ancelotti, recognised as Best Coach. Cristiano Ronaldo, the Portuguese superstar and Al-Nassr forward, received awards for Best Middle East Player and Top Goal Scorer of All Time.\nReal Madrid and Brazil winger Vinícius Jr was also awarded Best Forward, while Jude Bellingham, the rising English midfielder, captured a dual accolade as Best Midfielder and recipient of the Maradona Award. Lamine Yamal, the Spanish teenager making waves at Barcelona, was named Emerging Player.\nHH Sheikh Mansoor congratulated the winners on their awards and outstanding achievements, acknowledging their dedication and commitment to excellence. He urged them to continue pursuing greatness, not only in their sports but as ambassadors of hope and resilience.\nHis Highness further emphasised the unifying power of sports in connecting cultures and inspiring future generations. He encouraged the winners to use their success to promote collaboration, spread positive values, and champion inclusivity both on and off the field.\nKhalfan Belhoul, Vice Chairman of the Dubai Sports Council, also attended the award ceremony along with officials of various Dubai government departments and leading officials from global clubs, organisations and federations.\nThe event started with the presentation of the Dubai Globe Soccer Digital Awards.\nOther notable awards presented at the event recognised excellence in professional football:\n- Alessandro Del Piero, the Italian legend and Juventus icon, was honoured with the 50th Anniversary Career Award.\n- Neymar Jr., the Brazilian and Al Hilal SFC superstar, was celebrated for his flair and success with clubs like Barcelona and PSG.\n- Rio Ferdinand, the former Manchester United and England defensive superstar, was recognised for his outstanding career.\n- Thibaut Courtois, the Belgian goalkeeper, was acknowledged for his heroics with Real Madrid and Belgium.\n- Aitana Bonmati, the standout player from FC Barcelona and the Spain national team, received the Best Women’s Player award.\n- Al Ain Club of the UAE won the award for Best Club in the Middle East. The award was received by Sheikh Sultan bin Hamdan bin Zayed Al Nahyan, Chairman of the Board of Directors of the club.\n- Jorge Mendes, representing the agency Gestifute, claimed the Best Agent award.\n- Hugo Viana, of Sporting CP, received the award for Best Sporting Director.\n- FC Barcelona was honoured with the award for Best Women's Club.\n- Real Madrid was named Best Men's Club.\n- Florentino Perez, Chairman of Real Madrid, received the Best President award.\n|",
  "word_count": 475,
  "scraped_at": "2026-02-14T12:52:44.011931"
}