{
  "article_id": "49f6cc858ea8",
  "url": "https://jamaica-gleaner.com/article/lead-stories/20251113/glory-country",
  "title": "For glory , for country",
  "date": "20251113T060000Z",
  "domain": "jamaica-gleaner.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "For glory, for country\nLoading article...\nJamaica’s Reggae Boyz are shooting to uplift their nation when they tackle Trinidad and Tobago’s Soca Warriors today in a football match deemed among their most important World Cup Qualifying contests ever.\nAs the country grapples with the after-effects of Category 5 Hurricane Melissa’s deadly and destructive passage, coupled with the struggle by the Caribbean archrivals to earn qualification to the 2026 World Cup final, Michael Ricketts, president of the Jamaica Football Federation (JFF), declared that tonight’s 7 p.m. (Jamaica time) match at the Hasely Crawford Stadium in Trinidad is no ordinary football clash.\n“This qualifying is probably the most important in the history of qualifying,” Ricketts told The Gleaner yesterday.\n“As it is now, Jamaica has been destroyed, both physically and mentally, and to qualify for this tournament would certainly uplift all of Jamaica, but specifically those in the west who have been displaced.”\nFEEL OF THE PEOPLE\nReggae Boyz head coach Steve McClaren also shared that the senior national men’s team – in its World Cup quest – has an expanded purpose for today’s big match.\n“We need to be able to feel what the people are feeling as well,” McClaren said at a press conference on Monday.\n“If we can come together as one, and get the feeling of the island, get the feeling of the people, because they’re the most important.\n“The people on this island, the families, the friends, and the Jamaicans all over the world, they will be so proud if we achieve this,” he said of qualifying.\nUp to Tuesday, local authorities listed 45 deaths and billions in losses as relief efforts continued for hundreds of persons whose homes and livelihood were destroyed by the October 28 hurricane.\nThis coincides with a critical juncture of Concacaf World Cup Qualifying, where the Reggae Boyz face desperate Trinidad and Tobago in a high-stakes Group Two battle, which guarantees automatic qualification to next year’s World Cup Finals to be hosted by the United States, Mexico and Canada.\nJamaica lead the zone with nine points, while Trinidad and Tobago are third on five. Four teams are in the group – playing home and away ties – and Bermuda, pointless after four losses, will host second-placed Curaçao (eight points), also at 7 p.m. today. All the teams have played four of six matches.\nThe final round of matches will be played on Tuesday, November 18, with Jamaica hosting Curaçao, and Trinidad and Tobago welcoming Bermuda.\nThere are three Concacaf four-nation group play-offs and all the group winners will qualify, while the two best second-placed countries will get a second opportunity at FIFA’s intercontinental play-offs.\n“We are intent on doing well,” Ricketts remarked.\nDOUBLE WHAMMY\nPointing to upcoming qualifiers for the senior national women’s team, the JFF president further outlined the prospects of a Jamaica football double whammy to inspire those downtrodden by Hurricane Melissa, and the nation on a whole.\n“The Reggae Girlz qualification starts in two weeks, so we really want to do for Jamaica what probably no other sporting organisation would do in this time of crisis,” he said.\n“There’s an opportunity for us to make a contribution as it relates to putting a smile on the face of every Jamaican, especially those in western Jamaica.\n“So we’re intent on doing well. We’re intent on winning both games and qualifying for the World Cup,” he insisted.\nQualification for the Reggae Girlz begins on Saturday, November 29, with an away match in St Lucia. A general election will be held in that Windwards territory on Monday, December 1, but Ricketts hopes that will not pose any problems for the Jamaicans.\nREGGAE GIRLZ READY\n“ … We will be in the heart of their political campaigning. Hopefully, everything works well,” he said. “The Girlz will be ready.\n“It would be very, very important for us to qualify for the third time. Obviously, we will be in the World Cup for a fourth time as we’ll host the 2031 edition,” he added, referencing their position as hosts with Concacaf partners United States, Mexico and Canada.\n“Interesting times are ahead and we wish to do the very best for Jamaica,” Ricketts reiterated.\naudley.boyd@gleanerjm.com",
  "word_count": 699,
  "scraped_at": "2026-02-14T14:21:19.331558"
}