{
  "article_id": "4a0f449e4fc6",
  "url": "https://www.tomsguide.com/entertainment/netflix/new-on-netflix-in-november-2024-all-the-new-shows-and-movies-you-need-to-watch",
  "title": "New on Netflix in November 2024 all the new shows and movies you need to watch",
  "date": "20241030T210000Z",
  "domain": "tomsguide.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "New on Netflix in November 2024 — all the new shows and movies you need to watch\n'Cobra Kai: Season 6: Part 2,' 'The Piano Lesson' and more arrive on Netflix in November\nHere at Tom’s Guide our expert editors are committed to bringing you the best news, reviews and guides to help you stay informed and ahead of the curve!\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nDaily (Mon-Sun)\nTom's Guide Daily\nSign up to get the latest updates on all of your favorite content! From cutting-edge tech news and the hottest streaming buzz to unbeatable deals on the best products and in-depth reviews, we’ve got you covered.\nWeekly on Thursday\nTom's AI Guide\nBe AI savvy with your weekly newsletter summing up all the biggest AI news you need to know. Plus, analysis from our AI editor and tips on how to use the latest AI tools!\nWeekly on Friday\nTom's iGuide\nUnlock the vast world of Apple news straight to your inbox. With coverage on everything from exciting product launches to essential software updates, this is your go-to source for the latest updates on all the best Apple content.\nWeekly on Monday\nTom's Streaming Guide\nOur weekly newsletter is expertly crafted to immerse you in the world of streaming. Stay updated on the latest releases and our top recommendations across your favorite streaming platforms.\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nNetflix has announced all the new shows and movies arriving in November 2024 and there's a lot to unpack. Between returning hit shows, new critically-acclaimed movies and a blockbuster live event, the world's most popular streaming service is coming in hot this month.\nLeading the list of what to watch in November is the penultimate batch of episodes of \"Cobra Kai.\" The hit sequel to \"The Karate Kid\" is in its sixth and final season, and part two of three arrives on November 15.\nThen there's \"Emilia Pérez\" and \"The Piano Lesson.\" The former is a musical crime comedy starring Zoe Saldaña and Selena Gomez, while the latter is a powerful drama about a Depression-era family starring Samuel L. Jackson and John David Washington. While tonally different, these are both currently expected to be Oscar contenders, so don't miss them this month.\nFinally, Netflix is holding its biggest live event to date. Jake Paul vs. Mike Tyson has the YouTuber-turned-boxer facing off against one of the greatest boxers of all time. Mike Tyson may be 58 now, but its still tough to imagine Paul knocking out the former undisputed heavyweight champion of the world.\nThese are just a few of the new additions to Netflix over the next few weeks, which will also see Netflix add multiple new sports documentaries, some big comedy specials and even a live event. To make sure you don’t miss any fresh arrivals we’ve got the full slate down below. Plus, we have a roundup of what’s leaving Netflix in November, to give you a last chance to watch.\nHere's everything coming to — and leaving — Netflix this month.\nNew on Netflix in November 2024: Top picks\n'Outer Banks' season 4 part 2\n\"Outer Banks\" follows a group of teens in the Outer Banks of North Carolina, known as the \"Pogues.\" These teens have a penchant for getting into trouble and treasure hunting, often at the same time. There's fighting, romance and a whole lot of gold — at one point they even discover the lost city of El Dorado.\nGet instant access to breaking news, the hottest reviews, great deals and helpful tips.\nAs you can tell, this teen drama set in the Carolinas quickly found itself going beyond the barrier islands, though the drama between the local Pogues and the wealthy seasonal residents known as the \"Kooks\" never goes away. This season, the Pogues are back closer to home, looking for Blackbeard's lost treasure. The first five episodes already dropped back in October, so catch up now and then watch the final half of the season when it's released on November 7.\nStream on Netflix from Nov. 7\n'Emilia Pérez'\n\"Emilia Pérez\" stars Zoe Saldaña as Rita Mora Castro. Rita is a lawyer in Mexico who is stuck in a dead-end job. But that all changes when cartel leader Emilia Pérez (Karla Sofía Gascón) hires Rita to help fake her death and allow Emilia to live the life she's always wanted. The movie also stars Selena Gomez as Jessi Del Monte and Adriana Paz as Epifanía, and all four were awarded Best Actress at Cannes this year for their performances.\n\"Emilia Pérez\" is a musical crime comedy — a genre I did not know existed before this movie — and is adapted from an opera libretto that's loosely based on a 2018 novel \"Écoute.\" But despite being a primarily Spanish-language movie set in Mexico, this movie is actually a French film and was selected as France's entry for Best International Feature Film for next year's Academy Awards. It is an absolute must-watch this month.\nStream on Netflix from Nov. 13\n'Cobra Kai' season 6 part 2\n\"Cobra Kai\" has come a long way from its days as a YouTube Red original. The show reprises Ralph Macchio and William Zabka as Daniel LaRusso and Johnny Lawrence, respectively, more than 30 years after the first \"The Karate Kid\" film, but makes Johnny the primary protagonist and initially turns the once-heroic Daniel into the antagonist.\nThose two have, at times, been able to bury their animosity, especially when united against Johnny's old sensei John Kreese, who takes the Cobra Kai dojo from Johnny in season 2. Now the pair lead the Miyagi-Do dojo at the Sekai Taikai tournament in Barcelona, where they'll be forced to face off against old nemeses — and old friends.\nStream on Netflix from Nov. 15\nJake Paul vs. Mike Tyson\nJake Paul was once most famous as a controversial YouTuber. But now, he's a professional boxer with 11 wins under his belt — though famously he lost his fight against Tommy Fury, which was his first bout against a fellow active professional boxer.\nNow though, he's taking on Mike Tyson, the former undisputed heavyweight champion of the world. Like many of Paul's opponents, Tyson is not an active fighter in his prime. But unlike Paul's previous opponents, Tyson has a resume that makes him one of the greatest boxers of all time. You won't want to miss this Netflix live event, which comes with a full fight card, including a rematch between undisputed super lightweight champion Katie Taylor and unified featherweight champion Amanda Serrano.\nStream it live on Netflix at 8 p.m. ET on Nov. 15\n'The Piano Lesson'\n\"The Piano Lesson\" is set in 1936 Pittsburgh in the aftermath of the Great Depression. Adapted from the Pulitzer Prize-winning play by August Wilson, this movie is a team effort from the Washington family. Denzel Washington produced it, Malcolm Washington (his son) directed it in his directorial debut) and John David Washington (his other son) stars in it as Boy Willie Charles.\nThe movie centers around a dispute between Willie Charles and his sister Bernice (Danielle Deadwyler) about what to do with a family piano. The piano is an heirloom of the family — led by patriarch Doaker Charles (Samuel L. Jackson) — and was carved with beautiful designs by an enslaved ancestor. Bernice wants to keep it, but Willie Charles still wants to sell the piano to buy the land where their family had once been slaves. Don't miss this already acclaimed movie when it arrives on Netflix this month.\nStream on Netflix from Nov. 22\nEverything new on Netflix in November 2024\nSynopses provided by Netflix\nNOVEMBER 1\n\"Barbie Mysteries: The Great Horse Chase\" (Netflix family)\nBest friends Brooklyn and Malibu race across Europe to solve a mystery when a show horse is stolen while they're on vacation in the English countryside.\n\"It's All Over: The Kiss That Changed Spanish Football\" (ES) (Netflix documentary)\nSpanish footballers come together for the first time to relive the turbulent 2023 Women's World Cup and the kiss that overshadowed their victory.\n\"Let Go\" (SE) (Netflix film)\nA jaded mother makes a last-ditch effort to keep her family together by taking them on a trip to their teenage daughter's pole dancing competition.\n- \"60 Days In\" season 7\n- \"A Paris Christmas Waltz\"\n- \"Fall Into Winter\"\n- \"Free State of Jones\"\n- \"Goosebumps\"\n- \"Just Go With It\"\n- \"Love in the Wild\" season 2\n- \"Maid in Manhattan\"\n- \"Mr. Peabody & Sherman\"\n- \"Oblivion\"\n- \"Pompeii\"\n- \"The Scorpion King\"\n- \"Sixteen Candles\"\n- \"Superbad\"\n- \"The Whale\"\n- \"Whiplash\"\nNOVEMBER 5\n\"Love Village\" season 2 (JP) (Netflix series)\nWith over-the-hill vision, sleep-disrupting snoring and plenty of drama, mature singles move into a traditional house in Okinawa searching for true love.\n- \"Dirty Jobs\" seasons 1-2\nNOVEMBER 6\n\"Love Is Blind: Argentina\" (AR) (Netflix series)\nThe pods are open, and so are the hearts — now in Argentina. Who will make it past appearances in the experiment where saying \"I do\" comes sight unseen?\n\"Meet Me Next Christmas\" (Netflix film)\nOn a quest to meet the man of her dreams, a hopeless romantic races across New York City to find a ticket to a sold-out Pentatonix Christmas concert.\n\"Pedro Páramo\" (MX) (Netflix film)\nBased on Juan Rulfo's landmark novel, a man searches for his father, Pedro Páramo, in a town doomed by violence and the fury of a frustrated love.\nNOVEMBER 7\n\"10 Days of a Curious Man\" (TR) (Netflix film)\nWhen a young woman goes missing in Istanbul, a jaded writer gets tangled up in a deadly chain of events as he sets out to find her — and a good story.\n\"Born for the Spotlight\" (TW) (Netflix series)\nChasing glamour, fame and artistry, women with a passion for acting must push the limits to pursue their dreams in the ruthless world of show business.\n\"Countdown: Paul vs. Tyson\" (Netflix sports series)\nGo inside Jake Paul and Mike Tyson's training camps and personal lives as they prepare for their must-see heavyweight boxing match live on Nov. 15.\n\"Outer Banks\" season 4 part 2 (Netflix series)\nBuried secrets surface as the Pogues race to find a legendary artifact — with a dangerous gang of rival treasure hunters hot on their trail.\n- \"Face Off\" seasons 6-8\nNOVEMBER 8\n\"Bank Under Siege\" (ES) (Netflix series)\nSpain, 1981: When armed men hold up a bank and take hundreds hostage, a reporter races against the authorities to uncover the true motive for the heist.\n\"The Cage\" (FR) (Netflix series)\nDreaming of going pro, a young fighter struggles to be seen until an unexpected combat lands him a shot at the big time — and a brutal rival in the cage.\n\"Mr. Plankton\" (KR) (Netflix series)\nA man with little chance for happiness and his ex, the unhappiest bride-to-be, are forced to accompany one another on the final journey of his life.\n\"Vijay 69\" (IN) (Netflix film)\nVijay 69 is a quirky, slice-of-life film about a man who decides to compete in a triathlon at the age of 69! With Anupam Kher in the titular role, this comedy is produced by Maneesh Sharma and directed by Akshay Roy for YRF Entertainment\n\"Umjolo: The Gone Girl\" (ZA) (Netflix film)\nA couple's seemingly perfect relationship falters when one of them learns about the other's infidelity — but who said that relationships were easy\n- \"A Holiday Engagement\"\n- \"The Christmas Trap\"\n- \"My Dad's Christmas Date\"\nNOVEMBER 9\n\"Arcane\" season 2 Act I (Netflix series)\nJinx’s attack on the Council sets the stage for a dire escalation of the conflict between Piltover and Zaun.\n- \"The Lost City\"\nNOVEMBER 10\n- \"Focus\"\nNOVEMBER 11\n- \"Rob Peace\"\nNOVEMBER 12\n\"Adrienne Iapalucci: Dark Queen\" (Netflix comedy special)\nComedian Adrienne Iapalucci takes aim at our public figures, awkward tribute tattoos, virtue signaling and more in this unfiltered stand-up special.\n\"Rhythm + Flow: Brazil\" (BR) (Netflix series)\nTo wear the hip-hop crown, you'll need to rule the stage. Brazilian rappers face off in this competition featuring Filipe Ret, Djonga, Tasha and Tracie.\n- \"The Fast and the Furious\"\n- \"2 Fast 2 Furious\"\n- \"The Fast and the Furious: Tokyo Drift\"\n- \"Fast & Furious\"\n- \"Fast Five\"\n- \"Fast & Furious 6\"\nNOVEMBER 13\n\"Emilia Pérez\" (FR) (Netflix film)\nFour remarkable women pursue happiness in Jacques Audiard's audacious, genre-defying film that unfolds through a fever dream of original songs and dance.\n\"Hot Frosty\" (Netflix film)\nWhen a young widow's magic scarf brings a dashing snowman to life, can he help her rediscover romance, laughter and holiday cheer before he melts away?\n\"The Mothers of Penguins\" (PL) (Netflix series)\nWhen her seven-year-old son is expelled from school, an MMA fighter realizes her toughest fight won't be in the octagon, but in parenthood.\n\"Return of the King: The Fall and Rise of Elvis Presley\" (Netflix documentary)\nHe had one chance to show the world he was still the King of Rock 'n' Roll. Discover the story behind Elvis Presley's triumphant '68 comeback special.\n\"Sisters' Feud\" (MX) (Netflix series)\nA woman's refusal to join her sister's twisted scheme sparks betrayal and revenge as she tries to reunite with her long-lost daughter in prison.\n\"Sprint\" part 2 (Netflix sports series)\nFueled by speed and determination, the world's top sprinters gather in Paris, ready to break records and compete for Olympic gold.\nNOVEMBER 14\n\"Beyond Goodbye\" (JP) (Netflix series)\nAfter a tragic accident takes the love of her life, Saeko feels oddly drawn to a stranger — who, unbeknownst to both, received her late fiancé's heart.\n\"The Lost Children\" (CO) (Netflix documentary)\nAfter a plane crash, four indigenous children fight to survive in the Colombian Amazon relying on ancestral wisdom as a desperate rescue mission unfolds.\n- \"The Fairly OddParents: A New Wish\"\nNOVEMBER 15\n\"Cobra Kai\" season 6 part 2 (Netflix series)\nWith the global tournament approaching, Daniel and Johnny work to rebuild their team. But old enemies and new threats stand in the way of victory.\nJake Paul vs. Mike Tyson (Netflix live event)\nJake Paul battles Mike Tyson as they headline this must-see boxing mega-event streaming live in five languages from AT&T Stadium in Arlington, Texas.\n- \"A.P. Bio\" seasons 1-4\n- \"Million Dollar Decorators\" season 2\nNOVEMBER 16\n\"Arcane\" season 2 Act II (Netflix series) new episode\nJinx’s attack on the Council sets the stage for a dire escalation of the conflict between Piltover and Zaun.\nNOVEMBER 18\n\"Wonderoos\" season 2 (Netflix family)\nSo many firsts! The Wonderoos are back and ready to learn as they navigate everyday adventures like getting a haircut, managing new feelings and more.\nNOVEMBER 19\nUntitled Adam Ray / Dr. Comedy Phil Special (Netflix comedy special)\nComedian Adam Ray transforms into Dr. Phil for this one-of-a-kind comedy show featuring celebrity guests, crowdwork, and outrageous hijinks.\n\"Zombieverse: New Blood\" (KR) (Netflix series)\nThe groundbreaking K-zombie series returns bolder than ever, with enhanced zombies, new members and wilder quests full of non-stop thrills and laughter.\nNOVEMBER 20\n\"Adoration\" (IT) (Netflix series)\nSummer has just begun on the coast of Agro Pontino when the disappearance of 16-year-old Elena casts a shadow over the small community. Given her rebellious nature, both the police and her friends think this is yet another attempt to escape from a stifling province... But they are wrong.\n\"Buy Now: The Shopping Conspiracy\" (GB) (Netflix documentary)\nThis subversive documentary unpacks the tricks brands use to keep their customers consuming — and the real impact they have on our lives and the world.\n\"GTMAX\" (FR) (Netflix film)\nWhen a notorious gang of biker thieves recruits her brother for a heist, a former motocross champion must face her deepest fears to keep her family safe.\n\"The Merry Gentlemen\" (Netflix film)\nA big-city dancer stages an all-male, Christmas-themed revue to save her parents' small-town bar — and meets a guy who might have all the right moves.\n\"Our Oceans\" (GB) (Netflix documentary)\nOur oceans are a gateway to the unknown — but the creatures at home in their mysterious depths are more like us than we could possibly imagine. From the Emmy Award-winning filmmakers behind Our Great National Parks comes an unprecedented five-part opportunity to meet the awe-inspiring animals that dwell above, inside, and deep beneath the great current that powers and sustains everything on Earth. Narrated by Barack Obama.\n\"Rhythm + Flow\" season 2 (Netflix series)\nThe search for the next face of hip-hop moves to Atlanta as global hitmakers Ludacris, Latto and DJ Khaled join the judging panel to mentor fresh talent.\n- \"Shahs of Sunset\" seasons 3-4\nNOVEMBER 21\n\"Maybe Baby 2\" (DK) (Netflix film)\nWhen two couples learn that the fertility clinic didn't swap their eggs after all, they resolve to move in together and raise their kids collectively.\nNOVEMBER 22\n\"Tokyo Override\" (JP) (Netflix anime)\nWhen a lonely hacker gets entangled with a group of underground couriers, they uncover the dark truth lurking beneath Tokyo's seemingly perfect facade.\n\"900 Days Without Anabel\" (ES) (Netflix documentary)\nAnabel Segura's abduction held Spain in suspense for 900 days. This docuseries explores the case through never-before-heard recordings of the kidnappers.\n\"The Empress\" season 2 (DE) (Netflix series)\nAs dark clouds gather over the Austrian Empire, the need to produce an heir for the throne puts Franz and Elisabeth's marriage to the test.\n\"The Helicopter Heist\" (SE) (Netflix series)\nTwo childhood friends decide to try one last heist — to rob millions from Sweden's safest cash depot. But the police are already on their heels.\n\"Joy\" (GB) (Netflix film)\nJoy tells the remarkable true story behind the ground-breaking birth of Louise Joy Brown, the world’s first ‘test-tube-baby’, in 1978, and the decade-long journey of three tireless British pioneers who unlocked the puzzle of infertility by pioneering in vitro fertilization [IVF].\n\"The Piano Lesson\" (Netflix film)\nA brewing battle over the fate of an heirloom piano threatens to tear a family apart in this drama based on August Wilson's Pulitzer Prize-winning play.\n\"Pokémon Horizons: The Series\" part 4 (JP) (Netflix family)\nThe search for the Six Heroes brings the crew to the Paldea region, where they discover new Pokémon, face challenges and encounter a few surprises.\n\"Spellbound\" (Netflix family)\nSpellbound follows the adventures of Ellian, the tenacious young daughter of the rulers of Lumbria who must go on a daring quest to save her family and kingdom after a mysterious spell transforms her parents into monsters.\n\"Tex Mex Motors\" season 2 (Netflix series)\nWith new faces, a bigger shop and a higher profit goal, the Borderland crew ventures deeper into Mexico to source rare and unique cars to fix and flip.\n\"Transmitzvah\" (AR) (Netflix series)\nAfter embracing her female identity, Rubén rejects her Bar Mitzvah. When tragedy strikes years later, she returns as Mumy Singer to celebrate it her way.\n\"When the Phone Rings\" (KR) (Netflix series)\nA couple who have been living in an arranged marriage without speaking to each other for three years receive a threatening phone call from a kidnapper.\n- \"Gold Rush\" seasons 1-2\nNOVEMBER 23\n\"Arcane\" season 2 Act III (Netflix series) new episode\nJinx’s attack on the Council sets the stage for a dire escalation of the conflict between Piltover and Zaun.\nNOVEMBER 25\n\"Cold Case: Who Killed JonBenét Ramsey\" (Netflix documentary)\nPolice missteps and a media circus derailed the JonBenét Ramsey murder case. This definitive docuseries chronicles the decades-long quest for justice.\n\"The Creature Cases\" chapter 4 (Netflix family)\nReady to solve more animal mysteries? Team up with special agents Sam and Kit to crack new creature cases all over the world!\nNOVEMBER 26\n\"Anthony Jeselnik: Bones and All\" (Netflix comedy special)\nAnthony Jeselnik celebrates 20 years of delivering boundary-pushing comedy to the masses in this razor-sharp stand-up special.\nNOVEMBER 27\n\"Chef's Table\" volume 7 (Netflix documentary)\nMeet five world-class chefs who redefine culinary boundaries with delicious, innovative dishes honoring their diverse cultures and personal philosophies. Featured chefs include Nok Suntaranon (Philadelphia, PA), Kwame Onwuachi (New York, NY), Ángel León (Spain), Norma Listman & Saqib Keval (Mexico City, MX).\n\"Our Little Secret\" (Netflix film)\nAfter discovering their significant others are siblings, two resentful exes must spend Christmas under one roof — while hiding their romantic history.\nNOVEMBER 28\n\"Asaf\" (TR) (Netflix series)\nA father grapples with his divorce as he spins into a world of organized crime. With his son's life on the line, what will his next move be?\n\"Is it Cake? Holiday\" (Netflix series)\nTalented bakers, unbelievable illusions and joyful holiday vibes. Is It Cake? Holiday brings back nine All Star bakers from past seasons for the ultimate holiday showdown. Across four episodes, watch as bakers return to craft tasty replicas of ice skates, wreaths, nutcrackers and more in this holiday spin on the mind-bending baking competition. Bakers will baffle the celebrity judges with their festive and delicious deceptions and fight their way to the ultimate grand prize.\n\"The Madness\" (Netflix series)\nMuncie Daniels (Colman Domingo) is a political consultant-turned-TV pundit who may have lost his way in life. While on a work sabbatical in the Poconos to write the great American novel, Muncie finds himself the only witness to the murder of a well-known white supremacist, and now he's being framed for the crime. Muncie is forced to go on the run in a desperate fight to clear his name and unravel a global conspiracy before time runs out. Along the way he'll reconnect with his family, find unlikely allies, and fight against disinformation in a post-truth age.\nNOVEMBER 29\n\"Senna\" (BR) (Netflix series)\nFascinated by cars since childhood, Brazilian racer Ayrton Senna became a sports legend — until tragedy struck, changing Formula 1 forever.\n\"The Snow Sister\" (NO) (Netflix film)\nA young boy whose grieving family has forgotten about Christmas forms an unexpected, healing bond with a bubbly girl full of holiday spirit.\nLeaving Netflix in November 2024\nLeaving 11/5/24\n\"A Man Called Otto\"\nLeaving 11/6/24\n\"Edge of Tomorrow\"\nLeaving 11/10/24\n\"Night School\"\nLeaving 11/14/24\n\"First Man\"\n\"Nothing to Lose\"\n\"Nothing to Lose 2\"\nLeaving 11/15/24\n\"Harriet\"\nLeaving 11/19/24\n\"Shahs of Sunset\" seasons 1-2\nLeaving 11/22/24\n\"Evil Dead Rise\"\n\"Sausage Party\"\nLeaving 11/30/24\n\"A Beautiful Life\"\n\"Ali\"\nThe Devil's Own\"\n\"Diary of a Mad Black Woman\"\n\"Frances Ha\"\n\"Glengarry Glen Ross\"\n\"Hunter Killer\"\n\"It Chapter Two\"\n\"The Little Things\"\n\"The Matrix Resurrections\"\n\"National Security\"\n\"Pain & Gain\"\n\"Point Break\"\n\"Space Jam: A New Legacy\"\n\"Troy\"\n\"What to Expect When You're Expecting\"\nMore from Tom's Guide\n- The best streaming services in 2024\n- New on HBO and Max in November 2024\n- How to watch every 2024 NFL game online\nMalcolm has been with Tom's Guide since 2022, and has been covering the latest in streaming shows and movies since 2023. He's not one to shy away from a hot take, including that \"John Wick\" is one of the four greatest films ever made.",
  "word_count": 3838,
  "scraped_at": "2026-02-14T12:52:54.463239"
}