{
  "article_id": "4a54a18edb78",
  "url": "https://www.the42.ie/niamh-farrelly-galway-united-interview-6660639-Mar2025/",
  "title": "  I probably wouldnt expect myself to be back here , but I dont regret anything  ",
  "date": "20250329T111500Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "NIAMH FARRELLY VIVIDLY remembers leaving Ireland to embark on a professional football career five years ago.\nThe flurry of emotion. The natural upset, but overriding excitement.\nAnd the unknown accentuated by the Covid-19 pandemic.\nShe was 20; fresh from helping Peamount United to a league and cup double and playing in the Champions League. The Dubliner had caught the eye of opponents Glasgow City, and signed for the Scottish side.\n“I think it was the right time for me to go,” Farrelly tells The 42. “I was buzzing to go.”\nHer sports science studies at DCU were put on hold, football taking centre stage and the club journey taking her from Glasgow to Italy to England.\nThere were highs and lows, success and failure — and some Ireland senior caps in between.\nNow 25, Farrelly is back in the Women’s Premier Division with Galway United.\n“I probably wouldn’t expect myself to be back here now looking back, but I don’t regret anything,” she says.\n“I’m really enjoying my football now, I’m in a good environment and if you had told me last year that I’d be completing my degree, I would have jumped at it, to be honest.”\n*****\nHome comforts called last summer, when Farrelly returned to Peamount United after a frustrating spell with London City Lionesses in the English Championship.\n“I had planned to obviously stay in London another year, but it wasn’t working out for me there. I just thought for my own happiness off the pitch, I want to be playing. So I made the decision to come back. When I had the idea of finishing my degree, I was thinking it would be the perfect opportunity.”\nFarrelly found her feet again in the familiar surrounds of Greenogue, before Galway United manager Phil Trill reached out.\nMoving out west appealed on a personal level, while the football factors spoke for themselves: Galway are a rising force in the Women’s Premier Division, and are aiming high after an All-Island Cup two in a row.\n“There’s a great community there — just good people and everyone wants to win,” Farrelly says. “We definitely had that in Peamount but throughout the league, I think that’s hard to come by.”\nAfter life abroad in London, Glasgow and Parma, this is very different. Both on and off the pitch.\nIt’s a departure from full-time football, a return to life before 2020.\nFarrelly is based in Galway, but commutes to Dublin for college as she completes the final year of her college degree and considers further education.\n“Playing professionally, it’s your whole life. For me, it kind of still is my whole life because I try to live as a professional even if I’m not deemed as a professional.\n“It’s definitely more difficult — you’re not getting paid, I’m in college. It’s back to pre me going to Glasgow times, where I was just a busy bee. But I like it, because I feel like I’m more productive when I’m busy. You have more of a life outside of football.\n“On the pitch, it’s good. The standard at training is good, the coaches are great and I’m still learning so much — but it’s a weird dynamic to be in, because I’m kind of like an older player on the team, and I’ve never really been an older player. You have a different role in leading by example.\n“I hope that I can show the younger players what being professional is: eating right, living right, just little standards around training that you would have experienced as professional. If I can help even one person reach the next level, I suppose that’s my job done.\n“Then it’s trying to bring everything that I’ve experienced abroad on the pitch, and just try and help us win some trophies.”\nIt’s difficult to compare the Women’s Premier Division to the Championship, Serie A and the Scottish Women’s Premier League, but Farrelly’s observations through her second coming are interesting.\nThere are differences, yet similarities. Improvements made, but more needed.\n“When I left, that Peamount team was stacked with internationals, which you probably don’t see now in the league, because anyone really on the fringes of the (Ireland) senior team, they’re probably abroad, so that part is kind of different. I think there’s more opportunities abroad for players to go.\n“There’s less of gap from the top of the league to the bottom. Years ago, you’d travel down to play teams around the country, and you’d kind of know that you were going to win. That’s not the case anymore. It’s more competitive. There’s more women and girls playing football now, so there’s a bigger pool.\n“There’s better coverage around the league, games being on TG4. It definitely has come on. It still has leaps and bounds [to go], obviously, financial sides of it and all can obviously get better. But overall, it’s definitely on the on the rise.”\nFarrelly is among a small cohort of senior Irish internationals playing their club football on these shores. Having climbed through the underage ranks, she made her senior debut in 2019 and has won four caps to date.\nShe was regularly called up by Vera Pauw, but hasn’t been included in a squad since the World Cup playoff win over Scotland at Hampden Park in October 2022.\nThe Lucan midfielder/defender was “disappointed not to get a chance after Hampden to prove myself in a friendly squad — but that’s football”.\nA lack of game-time and unfortunate niggles saw Farrelly drop off the fringes, and ultimately detailed her international career. But she must still hold ambitions on that front?\n“It’s just been so long ago now that I’ve been in and it probably seems like a distant memory, to be honest. Of course, it’s always in the back of your head, thinking about that. But for me, knowing levels that I can hit, I’m probably not near it yet.\n“I need to get a good run of games under my belt to even consider myself ready to get to that level. You’re obviously playing in a non-professional league compared to the other girls who are in pro leagues, so you need to be really standing out to push. Hopefully I can hit them levels this season. But for now, I’ll just focus on my club and see how it goes.”\n*****\nFor Farrelly, the priority is enjoying her football again, and getting a consistent run of form. Happiness really is key.\n“If you speak to any sportsperson, if you’re not enjoying it, you’re definitely not hitting your best,” she nods. “Even when you speak to the girls in England, the ones who are hitting form, they just say that they’re enjoying it again and that just shows everything.\n“There’s no point being in an environment where you’re not enjoying it, because you won’t reach the levels that you can. Hopefully I can do that in Galway.”\nShe has made an encouraging start anyway, helping the Tribe establish themselves as the only team in the Women’s Premier Division with a 100% record early doors.\nThey twice came from a goal down to carve out convincing wins over DLR Waves (5-1) and Bohemians (3-1) before last weekend’s fixture against Peamount was postponed.\nNext up is a showdown with league leaders Shamrock Rovers at Eamonn Deacy Park this evening; the Hoops having opened with two wins and a draw — and, of course, the high-profile signing of Ruesha Littlejohn.\nIt’s early days yet, but this feels like a big fixture in what should be a thrilling title race.\n“I think it’ll be quite competitive this year,” Farrelly says.\n“It’s probably the first year in a while that nobody can really call who’s going to do things, because, in my opinion, there’s a lot of teams up there.\n“Shamrock Rovers, obviously, will be a force this year. They came into the league with big ambitions, and I presume they still have big ambitions. It’ll be a good game. They’ve started out strongly, like ourselves. We’ll be buzzing to go.”\nJust like 20-year-old Niamh Farrelly, Glasgow bound five years ago. Who knows what the next five will bring.\nToday – Galway United v Shamrock Rovers, 5pm, LOI TV",
  "word_count": 1372,
  "scraped_at": "2026-02-14T12:34:21.032792"
}