{
  "article_id": "4ac62b849b1e",
  "url": "https://www.rnz.co.nz/international/pacific-news/545836/tiny-pacific-nation-ready-to-play-first-ever-international-fixtures",
  "title": "Tiny Pacific nation ready to play first - ever international fixtures",
  "date": "20250324T034500Z",
  "domain": "rnz.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By Craig Stephen*\nThe world's newest footballing country is set to play its first-ever 11-a-side international matches this year, a significant breakthrough for the Marshall Islands Soccer Federation.\nThe federation has confirmed a men's four-nation tournament in their home-from-home in Springdale, Arkansas, in the United States in August.\nThe opposition comprises the Turks & Caicos Islands, Guam and the US Virgin Islands, who are all long-standing members of FIFA.\nIn 2024, the North Pacific nation (population of almost 40,000) hogged media headlines from BBC to The Athletic to RNZ Pacific as it strove to become part of the world footballing community and shake off its tag as the last sovereign nation to have a football team.\nThree Englishmen - Matt Webb, Lloyd Overs and former pro player Justin Walley - teamed with the local body, with their sights on making it happen, despite the distance.\n\"Our primary target has been to play 11-a-side games and we are very excited at this development. We have been working hard behind the scenes to get some senior games going,\" Webb, the commercial director, told Friends of Football.\nSo far, the main focus on the Marshall Islands has been futsal, for men and women. Last July, Majuro hosted the Outrigger Cup, which involved men's A and B teams from Kiribati and the Federated States of Micronesia (FSM).\nKiribati may have won that tournament - beating the Marshalls 6-2 in the final - but the hosts notched two wins over FSM. Both the visiting nations have far longer histories in football though the FSM FA was only re-established in 2023.\n\"We're not going to hide from the fact that it is a huge step up from futsal to the standard 11-a-side game. They have to go from playing on an indoor surface to grass pitches, and there's some players who struggle with that,\" Webb said.\nFinding players at home and from far away\nAs well as local players, the federation has been looking farther afield, including the United States, for players. The American connection is an historically deep one but it hasn't necessarily favoured the Marshallese.\nDuring World War Two, the American military occupied the island group and tested nuclear weapons for more than a decade, forcing the inhabitants of Bikini and Enwetak atolls to relocate. A dome on Runit Island containing discarded nuclear waste remains a visible symbol of the testing.\nThe US dollar is so high locals turn to cheap imported foods - mostly canned goods or starchy carb foods.\nAs such, the country has one of the world's highest rates of obesity and diabetes. American sports beamed in are popular, particularly basketball.\nThousands of Marshallese have left for the US but that movement may actually help the federation's cause. There is now a large community of Marshallese in Springdale and the organisation is hoping to mine the talent there and beyond.\n\"We've got a number of players, both in Springdale and across the US and also Marshallese in Europe,\" says Webb.\n\"We've found players in Germany, Serbia and the Netherlands. The German-based player was playing fourth Division German football last year and we have verified his eligibility. Funding-wise we're not too sure if we'd be able to get him involved, that's a bit further down the track,\" says Webb.\nRegional ambitions, and seeking to join OFC\nDespite the exciting development, the federation is dealing with a setback in its bid to join the pan-Pacific body.\nThe MISF submitted an application for membership to the Oceania Football Confederation (OFC) in December. Associate membership involves criteria that Webb believes they already fulfil.\nAn OFC spokesperson confirmed that \"correspondence has been received from representatives of the Marshall Islands Soccer Federation about the possibility of admission to the Oceania Football Confederation\".\n\"OFC can confirm the Marshall Islands Soccer Federation have been advised of the requirements for admission under the OFC Statutes, including the ability to demonstrate the ability to deliver football within the region and participate in OFC tournaments,\" OFC's spokesperson said.\n\"Presently, Marshall Islands have not been able to demonstrate this to OFC.\n\"The admission process requires the general secretariat to verify the completeness of the application for submission to the OFC executive committee. Incomplete applications which do not meet the criteria for admission under OFC statutes are not presented to the OFC executive committee.\"\nThe spokesperson added that one condition for entry is for direct flights to OFC member nations and there are none from the Marshall Islands.\nMatt Webb says they are disheartened by the response.\n\"After such a careful and considered application that showcases just how much technical development has been achieved over the past few years, it's disappointing to say the least not to have had an official acknowledgment.\n\"One would assume their mission is to help nations to develop, but we do not feel welcomed.\"\nHe says it was a \"strong application\" to show that they are serious about joining the OFC and developing the game.\n\"Seeing the exceptional efforts of last year, we're pretty confident we are building towards where we want to be, which is taking part in World Cup qualifiers at some point. We want to be part of FIFA.\n\"We look at some of the other island nations such as the Cook Islands, Tonga and American Samoa which all have full membership of OFC and are taking inspiration from those nations.\"\nNew team, new strip\nAn important part of fundraising has been two jerseys sold online with collectors and supporters eagerly pressing click to buy.\nThe home top contains several hoops based around the national flag colours of blue, orange and white, while the alternative top - released before Christmas - is white with an orange diagonal stripe.\nBoth jerseys were created by South American designers after a competition was held via X with \"an amazing number of entries\". Donations and sponsorship have also helped.\nBut Matt Webb says the federation remains committed to looking for a \"big ticket sponsor\" to bolster the coffers. Significant funding would mean they could purchase a vehicle to transport players to training sessions, among other things.\nThe football fanatic and his colleagues have found the journey so far an invigorating one which has taken them to a country that involves a circuitous route taking about two days. Webb's dedication is the reason why he is awake at 6am (UK time) for this interview.\n\"There have been challenges for sure. But I think that this is actually the easy part. We're doing a lot of the nuts and bolts behind-the-scenes stuff. So, we're making sure we have a database in place for registering and recording player activity.\n\"Myself and Lloyd have been involved in a number of calls probably earlier than this, like 2 or 3 in the morning which has been the only time that we have been able to have a meeting with someone on the islands.\n\"What we've loved is seeing how the Marshallese have been taking gradual ownership of this project over the past 12 months at least. Since we visited last July when we hosted the futsal tournament, it's really come on leaps and bounds.\"\nThe Englishmen are supported on the islands by president Shem Lavai and vice-president Divine Waiti, and several volunteers.\nLast year it appointed Katie Smith as its first-ever women's head coach. Smith is an experienced coach and is combining the position with her coaching role at Pittsburgh State University.\nShe is currently pursuing a PhD in Global Sports Leadership and a UEFA C Licence.\n*Craig Stephen writes about football for a number of publications, and for RNZ. He is the author of Bombs and Boots, a book that tells how New Zealand football came of age in the 1960s and 1970s.\n-This article was originally publihsed by Friends of Football.",
  "word_count": 1298,
  "scraped_at": "2026-02-14T12:34:45.213355"
}