{
  "article_id": "4ac769f98d24",
  "url": "https://www.stelladimokokorkus.com/2024/09/the-story-of-how-nigerias-super-eagles.html",
  "title": "Stella Dimoko Korkus . com : The Story Of How Nigeria Super Eagles Disgracefully Lost To Denmark",
  "date": "20240924T113000Z",
  "domain": "stelladimokokorkus.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Their next opponent for the Round of 16 was Denmark.\nFootball fans back home were shocked and disappointed.\nSoon, stories on why the defeat happened began to circulate. Some say it was because the players were not paid their allowances and they argued throughout the night before the game. Thus, they were not mentally prepared.\nSome say there was infighting among the squad but in a recent interview, former Nigeria defender Taribo West sensationally disclosed that some Super Eagles players sneaked ‘African women’ into their hotel rooms a night before their disastrous outing against Denmark.\nTaribo said some players brought women into the rooms the night before the June 28, 1998 clash, which he claimed led to fatigue on match day, thus, their disastrous performance.\n“But what I know is that some players sneaked women into camp, I saw that. The women were Africans who came to watch the tournament and fell in love with our team, because of the way we played in the group stage. So, it was easy for these players to woo them to their rooms.\n“That is why on match day, you could see a lot of the players didn’t have the strength to curtail the Danish players. They were tired after overworking themselves the night before with the women. I was yelling at them on the pitch, I was very angry with them.\n“They did all these because they thought we were going to beat Denmark,” Taribo said.\nThat defeat to Denmark remains Nigeria’s greatest to date at a World Cup tournament.\nfrom Historyville on X",
  "word_count": 262,
  "scraped_at": "2026-02-14T12:33:08.271914"
}