{
  "article_id": "4ae8fa2d4390",
  "url": "https://english.news.cn/20260106/a73a9fdafa0c4335a0ebe2317facd92b/c.html",
  "title": "Across China : How SW China mountain county stitches its way into global game - Xinhua",
  "date": "20260106T083000Z",
  "domain": "english.news.cn",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Workers stitch footballs at Daping Industrial Park in Wuchuan Gelao and Miao Autonomous County, southwest China's Guizhou Province, Dec. 11, 2025. (Xinhua)\nGUIYANG, Jan. 6 (Xinhua) -- A football stitched in the mountains of northern Guizhou may look no different from those sold in markets worldwide, from Warsaw and Sao Paulo to London.\nYet, its journey vividly illustrates how rural regions of China are striving to integrate into global manufacturing on their own terms.\nNestled deep within the Wuling Mountains, Wuchuan Gelao and Miao Autonomous County in southwest China's Guizhou Province lies nearly 200 kilometers from the nearest urban center, Zunyi. For decades, this area was primarily known as an agricultural backwater, characterized by limited industrial activity and scarce market outlets.\nToday, however, it churns out more than 10 million footballs a year, exporting them to markets across five continents and generating close to 100 million yuan (about 14.3 million U.S. dollars) in annual revenue.\nThis change did not stem from mega projects or headline-grabbing industrial policies. Instead, it unfolded through the humble tools of needles and thread, and the vision of a returning entrepreneur who believed that the skills he acquired on factory floors far from home could be replicated and refined back in the mountains of his native region.\nKanghong Sporting Goods Co. Ltd., established in 2017, became Wuchuan's first football manufacturer. Its founder, Tian Taiqiang, had spent over two decades working in a football factory in Yiwu, a sprawling hub for small commodities in east China's Zhejiang Province. Tian started as a manual laborer, unloading goods, before receiving training in production techniques and eventually advancing to technical and managerial roles.\nDuring his time in Yiwu, Tian did almost every job on the production line. When Wuchuan began actively promoting investment and return-home entrepreneurship, Tian returned with his savings, partners, industry connections and a comprehensive understanding of football production.\nBy leveraging its production expertise and the county's labor advantages, Kanghong rapidly scaled its operations. \"In our inaugural year, we produced roughly 3 million footballs, with orders booked through year-end,\" Tian recalled, noting that the company has since secured buyers across global markets.\nToday, Kanghong has grown into Guizhou's largest football producer and supplies overseas clients as well as domestic buyers. In 2025, it produced some 5 million footballs, generating around 40 million yuan in annual revenue.\nHowever, Wuchuan's football industry remains labor-intensive and vulnerable to global market fluctuations. Profit margins are slim. What distinguishes Kanghong, and increasingly the county's broader industry cluster, is a deliberate emphasis on credibility.\nTian often recalls an early experience that shaped his perspective on international markets. Several years ago, a batch of footballs destined for Poland, produced by multiple Chinese factories and consolidated for export, was found to have minor bonding defects in a small number of bladders.\nDespite Kanghong not being solely responsible for the issue, Tian immediately sent a technical team to Europe at his own expense. For nearly two weeks, they meticulously inspected more than 20,000 footballs one by one.\n\"The Polish client later became a long-term partner, placing an order for 160,000 footballs in 2024 alone and introducing us to buyers across other European countries,\" Tian said. \"I learned the importance of quality and integrity from Zhejiang entrepreneurs, and I have tried to apply those principles consistently.\"\nKanghong's rapid growth has acted as a magnet, drawing in and anchoring a broader industrial cluster in Wuchuan. Today, five ball-manufacturing firms have gathered in the county's Daping Industrial Park, building a full industrial chain and branching out into manufacturing other sports balls, including basketballs and volleyballs.\nThese companies pursue distinct market strategies. Some focus on mid- to high-end domestic clients such as clubs and schools, while others prioritize overseas orders. Some sell mainly offline, others online. \"This differentiation has fueled growth while expanding the overall market footprint of Wuchuan-made balls,\" said the head of another ball-making company in Daping.\nNotably, policy support has played a pivotal role. The local business environment has steadily improved, reinforcing market vitality. Industrial park tenants were offered factory space of over 4,000 square meters with rent waived for the first three years. Officials adopted what they call a \"business-led investment\" model, encouraging existing firms to attract suppliers and partners. Administrative services were streamlined, site visits regularized, and financing support coordinated.\nFor Yao Shulun, head of Dike Sporting Goods Co., which moved into the park in 2021, the calculation was clear-cut. \"Three years of rent-free factory space covering more than 4,000 square meters is an offer too compelling to refuse,\" he said.\nThe industry's economic significance lies less in headline revenue than in what it has done to local livelihoods. Across the five firms in the park, over 1,000 people are employed, many of whom are women who previously had to work far from home.\n\"I used to work in distant cities,\" said Tian Xueling, a ball-stitching worker at Kanghong. \"Now I can work close to home, care for my family and earn more than 4,000 yuan a month.\"\nSome of Wuchuan's footballs feature designs inspired by local Gelao culture, incorporating motifs from Nuo Opera, a traditional ritual performance. Others are tailored as souvenirs for the wildly popular Guizhou Village Super League, also known as Cun Chao, which has turned grassroots football into a national spectacle.\n\"Having our own football-making company is the best way to share our cultural heritage with the world,\" said Zhang Zhong, sales manager at Kanghong.\nThe company also supplies footballs to schools at cost price. It has signed procurement agreements with the provincial education system, ensuring that footballs made in Wuchuan are used in classrooms across Guizhou. In recent years, campus teams, training programs, and local competitions have proliferated, creating a feedback loop that strengthens the connection between production and grassroots participation.\nIn October 2025, the recommendations for the formulation of China's 15th Five-Year Plan (2026-2030) for national economic and social development called for developing county economies with unique features, nurturing distinctive rural industries and helping sustain rural income growth.\nWuchuan's football industry fits neatly into that framework, not because it was designed to, but because it evolved along similar lines. It integrates labor-intensive manufacturing with cultural branding, export-driven growth with local employment, and private entrepreneurship with targeted public facilitation.\n\"In 2025, the industry generated more than 90 million yuan in total revenue,\" said Cheng Peng, vice county head of Wuchuan, highlighting a vivid and distinctive development path of rural revitalization. \"Our goal is to see footballs made here become part of the FIFA World Cup supply chain.\"\nWhether this ambition materializes remains uncertain. Raw materials such as PVC still come from outside the province. Sales often depend on intermediaries in the Yangtze River Delta region, while global demand is cyclical and price competition is fierce.\nYet the broader significance of Wuchuan's experiment lies elsewhere. In a mountainous county once defined by outward migration, a simple object -- stitched by hand and exported by container -- has become a catalyst for industrial learning, labour retention and global integration.\nFrom the Wuling Mountains to pitches across the world, Wuchuan's footballs are about more than just a game. They are also driving and inspiring a small county's bid to secure its economic future. ■\nA worker makes footballs at Daping Industrial Park in Wuchuan Gelao and Miao Autonomous County, southwest China's Guizhou Province, Dec. 11, 2025. (Xinhua)",
  "word_count": 1223,
  "scraped_at": "2026-02-14T12:44:38.016272"
}