{
  "article_id": "4aecbfd20dec",
  "url": "https://www.eastlothiancourier.com/news/25701155.call-scotland-v-denmark-match-stay-bbc-iplayer/",
  "title": "Call for Scotland v Denmark match to stay on BBC iPlayer",
  "date": "20251217T173000Z",
  "domain": "eastlothiancourier.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "EAST Lothian’s MSP has called on the BBC to continue to offer football fans the chance to watch back Scotland’s unforgettable qualification for the World Cup.\nSteve Clarke’s men needed a victory over Denmark last month to secure their place at next year’s tournament.\nAnd they did it in stunning and memorable fashion, as Scott McTominay, Lawrence Shankland, Kieran Tierney and Kenny McLean scored in a 4-2 triumph at Hampden Park.\nCurrently, the full match and highlights can be watched back on BBC iPlayer.\nHowever, they are only available until Thursday evening.\nPaul McLennan, MSP for East Lothian, has called on that to change.\nSpeaking on Monday, he said: “I am sure I’m not the only Scotland fan who would love to re-live our incredible final qualifying match over the coming months as we look forward to next summer.\n“Wouldn’t it be great if the BBC could make the match available for all to watch again, right up until the tournament kicks off in June?\"\nScotland will face Brazil, Morocco and Haiti at the World Cup next summer, held in the USA, Mexico and Canada.\nIt will be the first time they have played at the tournament for 28 years.\nAs there is currently no deal for future games, there are concerns that there could be a return to the situation where Scotland matches are only available to watch on expensive pay-per-view channels – although it has been confirmed that Scotland's games at the World Cup itself will be on BBC and ITV.\nMr McLennan expressed this worry, and urged football authorities and broadcasters to come together to ensure that matches were available for all to watch on free-to-air TV.\nHe said: “I urge the footballing authorities, broadcasters and the UK Government, which has control over broadcasting, to come together to ensure that all future Scotland men’s and women’s football matches can be enjoyed by everyone – and that a whole next generation can be inspired to take up sport as a result.”\nIf successful, the call would mean that the qualifying match would be available until Scotland begin their tournament against Haiti at 2am on June 14, 2026, UK time.\nClarke’s men then face Morocco on June 19 in a 6pm kick-off (UK time), before finishing the group phase against five-time World Cup winners Brazil on June 24, also at 6pm.",
  "word_count": 392,
  "scraped_at": "2026-02-14T12:37:41.527780"
}