{
  "article_id": "4af27836c6d1",
  "url": "https://www.moreechampion.com.au/story/8795192/magpies-captain-davey-to-miss-rest-of-the-aflw-season/?cs=9310",
  "title": "Magpies captain Davey to miss rest of the AFLW season",
  "date": "20241017T101500Z",
  "domain": "moreechampion.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Collingwood's wretched injury run this AFLW season has continued, with captain Brianna Davey ruled out for the remaining three rounds due to a leg injury.\nSubscribe now for unlimited access.\nor signup to continue reading\nScans have confirmed Davey has a bone stress reaction in her left tibia.\nThe news comes just days after the 29-year-old celebrated her 50-game AFLW milestone in Collingwood's eight-point loss to Port Adelaide.\nDavey's setback continues a horror run of luck for Collingwood, who have been beset by injuries this year and currently sit 17th with a 1-7 record.\nTheir injury crisis was so bad earlier this season they had to call up replacement players from the VFLW.\n\"This is tough news for Bri, who worked immensely hard during the pre-season to come back into the side and make an impact across five games,\" Collingwood's general manager of women's football Jess Burger said in a statement. \"Bri is clearly disappointed to not see the season through, but her health and welfare is the priority.\"Bri is such a strong leader for our program on and off the field, and she will continue to support the playing group albeit from the sidelines. \"She is determined more than ever with her recovery, and our whole program will support her through this period to be ready for 2025.\"\nThe Magpies are currently without Davey, Charlotte Blair (leg), Kalinda Howarth (ACL), Mikayla Hyde (foot), Selena Karlson (shin), Annie Lee (knee) and Nell Morris-Dalton (back).\nThey take on high-flying Adelaide at Victoria Park on Sunday, before finishing their season with games against Carlton and Melbourne.\nAustralian Associated Press",
  "word_count": 267,
  "scraped_at": "2026-02-14T13:31:38.670185"
}