{
  "article_id": "4af964d8fbd0",
  "url": "https://www.standard.net.au/story/8249173/five-womens-world-cup-superstar-internationals-you-need-to-know/?cs=2611",
  "title": "FIFA women World Cup superstars you need to know : Marta , Alexia Putellas to know other than Matilda Sam Kerr | The Standard",
  "date": "20230718T054500Z",
  "domain": "standard.net.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The women's World Cup is going to bring the best talent to Australia for the next month with international superstars chasing team glory.\nSubscribe now for unlimited access.\nor signup to continue reading\nHere are some of the international players you need to keep your eye on during the tournament.\nLena Oberdorf - Germany\nFor Germany to return to the summit of world football, Lena Oberdorf will be their key. The 21-year-old is part of a fresh, new generation for the European powerhouse who is attempting to add a third World Cup trophy to their cabinet.\nThe Wolfsburg midfielder brings versatility through the centre of the park, but is best utilised as a defensive midfielder. Her ability to win the ball one-on-one is unmatched and protects her defence against quick transitions.\nMost importantly is her distribution. Her link up play with veteran forward Alexandra Popp was on full display in last year's Euros and took them to the way to the final. If that's replicated, it'll take a good side to stop an Oberdorf-led Germany.\nGroup stage opponents: Colombia, South Korea, Morocco\nLindsey Horan - United States\nA record third World Cup in-a-row is in the sights of a United States side that has undergone significant transition since 2019. Lindsey Horan is one of the key pieces to settling a side with 14 World Cup debutants and injuries to key players including Mallory Swanson and captain Becky Sauerbrunn.\nThe Olympique Lyon midfielder combines skill with power and has the ability to work in the tightest of spaces, particularly inside the box. Capable of popping up with an essential goal, Horan can score from anywhere.\nWith an injury cloud over Rose Lavelle, Horan's ability to create and score will be essential if her side wants to extend their run as World Champions.\nGroup stage opponents: Netherlands, Portugal, Vietnam\nAlexia Putellas - Spain\nThe ever-growing support and quality of Spanish football has been draped over underlying turmoil within the squad that had 15 players strike over conditions only last year. It's going to take something special for Spain to unleash their full potential at this tournament, and Alexia Putellas is just the player to do it.\nPutellas is regarded as the best player in the world and is a two-time Ballon d'Or Feminin winner. She is the only player to win both the UEFA women's player of the year and Ballon d'Or Feminin two years in a row.\nThe midfielder was denied the opportunity to shine at the Women's Euros last year after suffering an ACL injury, and will be champing at the bit to return to the world stage. The Barcelona champion is a playmaker who can produce something out of nothing. Her experience also brings a final product, which traditionally can be illusive for a national team that values possession over everything.\nHer return to the fold will be a welcome one. It will also provide Putellas an opportunity to return to the Best FIFA Women's Player conversation and perhaps add another to her 2021, 2022 accolades.\nGroup opponents: Costa Rica, Japan, Zambia\nKhadija 'Bunny' Shaw - Jamaica\nIn a tournament filled with impressive forwards, there's few in the league of Jamaica's Khadija \"Bunny\" Shaw. The nation has faced an uphill battle to attend the tournament, including two GoFundMe campaigns due to a lack of support from their federation. Shaw provides a shinning light for the minnows.\nKnown as \"Bunny\" because of her love of carrots from a young age, the Manchester City forward will be the focal point of any plans the Reggae Girls have to entertain crowds. A traditional number 9, Shaw is a pure goal poacher coming off an impressive club season knocking in 20 goals in 22 games. When she's not scoring goals, she's also capable of providing assists.\nShaw inspired Jamaica in their first World Cup in 2019, now with the nation entering their second her leadership will be key.\nGroup opponents: France, Brazil, Panama\nMarta - Brazil\nIn her sixth, and last World Cup, Marta will be passing the baton from Brazil's golden generation to an exciting up-and-coming one. The six-time world best player of the year has defied the odds to lock in a spot in the squad.\nThe 37-year-old may not be a certain starter any more, but she will be highly influential through her leadership and tenacity. The left footer has a cutting final pass and remains a threat at deceiving players with the ball at her feet. Having a player of Marta's calibre coming off the bench shows Brazil's depth, and will cause nightmares for opponents.\nBrazil haven't had success in the knock-out stages since being runners-up in 2007. Now the question is whether Brazil can send off one of their footballing legends and shake off the knock-out hoodoo.\nGroup opponents: France, Jamaica, Panama",
  "word_count": 804,
  "scraped_at": "2026-02-14T13:02:23.748106"
}