{
  "article_id": "4b078d74c786",
  "url": "https://www.irishecho.com/2023/11/scotstown-edge-ulster-thriller",
  "title": "Scotstown edge Ulster thriller",
  "date": "20231127T163000Z",
  "domain": "irishecho.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Scotstown (Monaghan) 0-17 Trillick (Tyrone)1-13\nThis is why club football is so gripping to ordinary folk who want to watch top-class players give their all for the club colors far away from Croke Park on a big final day.\nMonaghan may have come up short against the big guns in high summer as a county, but their county champions Scotstown showed class, true grit and no little athleticism to squeeze past a game and committed Trillick outfit - but only after extra-time at the Athletic Grounds in the Ulster semifinal on Sunday.\nThey will be tested further against the holders Glen in next month’s final - a game that is already making mouths water in anticipation.\nWhile feeling sorry for the Tyrone champions who gave their all, you also had to salute the winners in the way they refused to bow the knee and always seemed to recover from whatever punch was thrown in their direction.\nBack in the provincial decider for the first time in five years, they can thank county men Jack McCarron and Shane Carey who held their nerves to slot over the points from frees to push the blues through.\nAll this after a tit-for-tat head-to-head which saw the two sides level on no less than seven occasions and it took a great Conor McCarthy score in injury time to decide the contest.\nIf the commitment to almost dying for the jersey was part of the old-fashioned tenets of both sides, so too was the modern way of playing with the winners getting joy by weaponizing the press from their opponent’s first kick out.\nThe other new trend of goalkeepers playing around midfield was evident too as Farney No 1 Rory Beggan, who in my opinion should have won the All-Star spot ahead of Stephen Cluxton, made his presence felt by winning possession and scoring a point from a ‘45 - the modern day 21 yard free for such custodians.\nThe ageless Darren Hughes was another to roll back the years as he dominated possession in this sector and it was his prompting which opened the way for Emmet Caulfield and Shane Carey to put his side two points to the good.\nSeeing they needed to tweak their own game plan, Rory Brennan, the impressive Trillick skipper, got a new sweeping role to blunt the importance of McCarron who was forced to take unsuccessful shots because of the lack of space and time.\nStill, Scotstown were motoring better overall and led by 0-6 to 0-3 four minutes before the break. It looked like they would be comfortable but then Trillick came to life with Richie Donnelly scoring a huge point from out the country before Seanie O’Donnell rattled in 1-1 in less than a minute to give them a 1-4 to 0-6 interval advantage.\nWith tactics playing a part, McCarron decided to beat the hold on him by drifting even deeper to create space behind him. He got a reward when placing Mattie Maguire to get a score before converting a free to get his side’s noses back in front.\nThe big names on both sides were well marked and it took this long before newly crowned All-Star halfback Conor McCarthy went on a searing run before passing to Michael McCarville for a score. When Maguire got his second score, it put the Farney men two up but typical Tyrone saw Trillick hit four of the next five score to have their olfactory slightly ahead.\nGood approach play by Darren Hughes allowed full back Ryan O’Toole to levet he tie before Brennan’s ’45 nudged his team ahead.\nThe drama was far from over though as McCarthy ’tied it all up at 0-13 to 1-10 with the very last kick of the game.\nAnd so it was the lottery of extra-time. Who was up for it more? Kieran Hughes and McCarron showed they had fight aplenty left in them as they pushed their side 0-15 to 1-11 at the second interval.\nThe ever reliable Lee Brennan put over a great point to level this extraordinary game for a seventh time but it was then when Scotstown experience shone through to get them over the line with McCarthy the hero of the hour.\nScotstown: R Beggan (0-1 ‘’45); B Boylan, R O’Toole (0-1), D McArdle; C McCarthy (0-1), D Morgan (0-1), E Caulfield (0-1); D Hughes, M McCarville (0-1); J Carey, S Carey (0-3, 0-2f), J Hamill; M Maguire (0-2), K Hughes (0-2), J McCarron (0-4, 0-3f) Subs: M McPhillips for Hamill (49), D Murray for J Carey (52), R McKenna for Maguire (61), R Malley for Morgan (61), J Carey for Malley (74), Hamill for Caulfield (81),\nTrillick: J Maguire; S O’Donnell, P McCaughey, D Tunney; S O’Donnell (1-1), R Brennan (0-1), D Gallagher; R Donnelly (0-1), L Gray; C Daly (0-1), N Donnelly, R Gray (0-1); D Donnelly (0-1), L Brennan (0-5, 0-3f, 0-1 ’45), J Garrity (0-1) Subs: C Garrity (0-1) for N Donnelly (37), D McQuaid for Tunney (47), D Kelly for Gallagher (76), P Courtney for R Gray (82)\nRef: K Faloon (Armagh).\nGlen 0-10 (Derry); Naomh Conaill (Donegal) 1-6\nUlster club football is so well matched across the counties that once again only a point separated this semi-final between Derry’s and Donegal’s finest at Healy Park on Saturday evening.\nIn the end, it was Emmett Bradley who strode forward to play the role of hero as he landed the winning point four minutes into injury-time.\nThis meant that Glen had progressed to their third Ulster SF club final appearance in successive years - but it was a hard-earned ticket to the northern showpiece.\nThey may have started as strong favorites but the boundary between these two counties is a leveler and pride of place can often mean more than talent on show.\nYou wondered if this was one such occasion when John O'Malley's early second-half penalty threatened to upset the applecard, forcing Glen to dig deep to see what they had left to offer.\nAnd yes, they managed to find the answers to come back, but when they were caught with time already three minutes in the red following an AJ Gallagher’s score, the thought was that the Donegal boys now had the wind at their back.\nAgain you would have been proven wrong as Bradley’s radar appointed ciotóig slotted over a huge effort from 45 meters to send his side into the final in the most dramatic way possible.\nGlen: C Bradley; M Warnock, R Dougan, C Carville; E Mulholland, C McFaul (0-1), C Mulholland (0-2), C Glass, E Bradley (0-3, 0-1m); E Doherty, D McDermott, T Flanagan; A Doherty, D Tallon, C McGuckian (0-3, 0-1m) Subs: J McDermott for D McDermott (23), S O'Hara (0-1), for A Doherty (53).\nNaomh Conaill: S McGrath; E Waide, AJ Gallagher (0-1), U Doherty; K McGettigan, A Thompson, E O'Donnell (0-1); L McLoone, C Thompson (0-3); B McDyer (0-1), O Doherty, E Doherty; J MacCeallBhui, C McGuinness, J O'Malley (1-0 pen) Subs: K McGill for O'Malley (52)\nRef: Sean Huson (Tyrone).\nNa Fianna (Dublin) 2-14 Naas (Kildare) 0-17\nA first Dublin SH title is swiftly followed by a first Leinster showdown and for their efforts, Na Fianna will have to make the short journey from Mobhi Road to Croke Park on Saturday afternoon following this deserved but hard fought battle against Naas in Portlaoise on Saturday afternoon.\nThere was little or nothing between these sides when it came to hurling ability or athleticism but as the old saying goes, goals win matches and this was very much the case as the green flags waved for Ciaran Stacey and AJ Murphy’s efforts ultimately proved the difference between winning and losing.\nNaas gave it their all and went down fighting to that final whistle as they sought to emulate the heroics of their footballers by also qualifying for a Leinster final in the same year.\nThey put Na Fianna to the pin of their collar before eventually bowing out after reducing their deficit of six points to just one as they appeared to come with a Lester Piggott-type run late in the race.\nThat tested the Dublin side and to their credit they not just withstood the tide but turned it back with points from substitute Tom Brennan and Colin Currie giving their huge following in attendance breathing room as the game came to an end.\nThe winners must be complimented on getting so far without the influence of Dublin talisman Donal Burke who has played no part in this Leinster series due to an on-going hamstring complaint.\nThat meant someone had to step up and it is lucky for Na Fianna that they had two heroes prepared to do so in the persons of the two Curries — Colin and Sean. This time around they accounted for 10 points between them with Murphy grabbing 1-1. However, it was their defense who were the real heroes with former Dublin All-Star double winner Liam Rushe playing for the team since returning from a foreign break in September.\nO'Loughlin Gaels (Kilkenny) 0-17 Kilcormac-Killoughey (Offaly) 0-12\nYou should never give a Kilkenny hurling side an even break… or any break for that matter.\nThey played with the wind in O’Connor Park Tullamore on Saturday and by the time Kilcormac-Killoughey got going, the winners were almost out the gate and on their way to a Leinster final appearance.\nIt is very hard to come from behind against a Kilkenny team, be it Ballyhale Shamrocks or in this case O’Loughlin Gaels, who once they had built a lead, maintained it with aplomb to the finish.\nYes, KK did their best to reel back the score on the resumption but you always felt they were climbing a hill slightly too steep to be scaled in half an hour. They cut the seven-point deficit back to two but expended so much energy in so doing that it allowed O’Loughlins to kick on again and win easily by five points.\nIn truth, the Offaly side’s achilles heel was that they never could threaten the visitor’s goal and this was a game that need a green flag if the home side were to come from behind and win the encounter.\nThey also undermined their challenge by fouling in places which Mark Bergin converted with his eyes closed, seven in all to go with his solitary point from play\nDaingean (Kerry) 0-13; Clonmel Commercials (Tipperary) 0-10\nKerry’s forward power, despite the presence of Sean O’Shea and the two Cliffords, was seen as a reason they failed to beat Dublin in this year’s All Ireland final.\nWith that in mind manager Jack O’Connor might have been given food for thought as he watched county panelist Dylan Geaney kick five points from play as debutants Daingean proved too strong for Tipp’s finest Clonmel Commercials in the Munster semifinal on Saturday.\nThey will now play Castlehaven in the final in yet another Kerry vs Cork football encounter.\nThere was little or nothing between the sides — they were level seven times — and if anything the difference was that Dingle had players who could find the range from play with all of their scores coming in this fashion.\nWith only a point between the sides down the home strait, it took late white flags from their county men Tom O'Sullivan and Paul Geaney to ease them to victory. However long term, it may be the display of Dylan Geaney that could prove a turning point for both Dingle and Kerry over the coming months.\nCastlehaven (Cork) 1-16; Rathgormack (Waterford) 1-7\nThe brothers Hurley were the stars for Cork side Castlehaven as they had nine points to spare against Waterford champions Rathgormack in Fraher Field on Sunday.\nThe home team needed a good start to boost their own confidence but alas for them it was the visitors who came out with all guns blazing and were 0-7 to 0-0 ahead at half time…. An Everest for any side to scale on the resumption.\nWith Brian Hurley scoring 1-6 and his brother Michael accounting for 0-5, the total of 14 points was sufficient to win the game on their own on the scoreline but they will be marked men by Dingle when they faced each other in 10-days time.\nGAA RESULTS\nLeinster SH Semi-finals\nNa Fianna (Dublin) 2-14; Naas (Kildare) 0-17\nO'Loughlin Gaels (Kilkenny) 0-17; Kilcormac-Killoughey (Offaly) 0-12\nUlster SF Semi-finals\nScotstown (Monaghan) 0-17; Trillick (Tyrone)1-13\nGlen 0-10 (Derry); Naomh Conaill (Donegal) 1-6\nMunster SF semi-finals\nDaingean (Kerry) 0-13; Clonmel Commercials (Tipperary) 0-10\nCastlehaven (Cork) 1-16; Rathgormack (Waterford) 1-7",
  "word_count": 2098,
  "scraped_at": "2026-02-14T13:27:48.975269"
}