{
  "article_id": "4b298e8d972e",
  "url": "https://www.manutd.com/en/news/detail/match-report-man-utd-women-arsenal-wsl-21-september-2025",
  "title": "Match report | United Women 0 Arsenal 0 | 21 September 2025",
  "date": "20250921T200000Z",
  "domain": "manutd.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Report: United Women 0 Arsenal 0\nManchester United played out a 0-0 draw with Arsenal in the Women’s Super League on Sunday afternoon, with both clubs dropping points for the first time this season.\nNothing separated the sides in a game tightly contested in midfield and full of half chances, but lacking enough clinical quality in the final third of the pitch.\nThere were two changes from the team that started Thursday night’s historic Champions League win over Brann, seeing Fridolina Rolfo make her full United debut and Celin Bizet Donnum returning to the line-up after being ruled out midweek. Jayde Riviere dropped out of the squad with a minor injury niggle, while hat-trick hero Elisabeth Terland began among the substitutes.\nA United record crowd of 8,665 at Leigh Sports Village fell silent before kick-off, as touching tribute was paid to Matt Beard, the former Chelsea, West Ham and Liverpool manager, who passed away at the age of 47, and made such a mark on the women's football landscape.\nNot even 40 seconds had passed before United threatened for the first time, a ball in behind the Arsenal defence chased down by Melvine Malard. An early test for Daphne van Domselaar, the effort from our no.9 was beaten away by the goalkeeper at the near post.\nUnited's fast start continued through the opening stages, making it difficult for Arsenal to breathe. Malard and Ella Toone both saw efforts blocked one after the other when Van Domselaar spilled a cross, before the Dutch stopper gratefully grasped Jess Park's follow up.\nThe Gunners gained more of a foothold thereafter, and Olivia Smith's powerful strike 20 minutes in clipped crossbar as it flew over – a warning sign. But further United pressure saw another chance when Maya Le Tissier's near post flick-on at a corner was plucked out of the air by Van Domselaar.\nIn the closing stages of the half, Phallon Tullis-Joyce was equal to Arsenal's first shot on target of the game, a low drive from Alessia Russo that she held. Caitlin Foord was also left ruing a missed effort for the visitors, firing wide of the target in stoppage time when the space opened up for her.\nSECOND HALF\nUnited had plenty of joy during the opening 45 minutes with long balls into space in the left and right channels for Malard to chase. That also led to the first chance after the restart. Arsenal were grateful that Steph Catley managed to get a foot on the eventual shot, diverting it wide for a corner.\nPark's ability drive with the ball into attacking areas sparked another opportunity for the Reds around an hour in. Possession eventually made its way to Julia Zigiotti Olme on the edge of the box, who only just missed the target from 20 yards.\nArsenal maintained a threat of their own, albeit still struggling to test Tullis-Joyce when substitute Frida Maanum lashed a vicious strike the wrong side of the near post.\nWith the Gunners trying to build a late head of steam with a host of changes from the bench, Marc Skinner opted for fresh legs with just under 15 minutes to play, as Lisa Naalsund and Terland replaced Bizet Donnum and Malard respectively. Gabby George also came on for Rolfo.\nArsenal, perhaps fresher having not played since last weekend, finished the game with more control of the ball. But United defended the penalty area well, while a bit more luck could even have seen Ella Toone win it with a speculative late drive from distance that flew narrowly wide.\nThree games into the 2025/26 campaign, United sit second in the WSL table on seven points, two behind champions Chelsea and ahead of Arsenal on goal difference.\nMATCH DETAILS\nUnited: Tullis-Joyce; Bizet Donnum (Naalsund 76), Le Tissier (c), Janssen, Sandberg (Williams 90+6); Zigiotti, Miyazawa; Park, Toone, Rolfo (George 84); Malard (Terland 76).\nSubs not used: Middleton-Patel, Rendell, Anderson, Griffiths.\nArsenal: Van Domselaar; Fox, Reid, Catley, McCabe (Hinds 65); Little (c), Caldentey; Smith (Kelly 65), Blackstenius (Maanum 64), Foord (Mead 79); Russo.\nSubs not used: Zinsberger, Codina, Wubben-Moy, Cooney-Cross, Pelova.\nAttendance: 8,665.",
  "word_count": 686,
  "scraped_at": "2026-02-14T13:32:32.671124"
}