{
  "article_id": "4b2ab7851a8f",
  "url": "https://www.nhl.com/news/nhl-morning-skate-for-february-27-2025",
  "title": "NHL Morning Skate for Feb . 27",
  "date": "20250227T143000Z",
  "domain": "nhl.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "* Connor Hellebuyck moved within one of the franchise record for longest winning streak as he won his eighth straight game and backstopped Winnipeg to its 11th consecutive victory. The Jets joined a short list of Canadian clubs to accomplish that feat.\n* Nathan MacKinnon recorded a three-point performance – including scoring two of Colorado’s four third-period goals – to take back the scoring lead. MacKinnon is yet to add an Art Ross to his trophy case.\n* Paul Bissonnette, Keith Yandle and Ryan Whitney will join Andi Petrillo for NHL Coast to Coast on Thursday starting at 7 p.m. ET on Prime Video Canada, with a free preview also available on NHL.com in Canada.\n* The first game of a home and home between the Red Wings and the Blue Jackets, that will conclude Saturday at the 2025 Navy Federal Credit Union NHL Stadium Series, will be part of Thursday’s 12-game slate. Both teams are in the thick of the Eastern Conference’s Wild Card race, currently occupying the first two Wild Card seeds.\nJETS CONTINUE TO SOAR WITH 11TH STRAIGHT WIN\nMark Scheifele (1-0—1) built on his franchise-leading goal total and Connor Hellebuyck (24 saves) stopped all but one shot in his eighth straight victory as the League-leading Jets (42-14-3, 87 points) extended their franchise-record winning streak to 11 contests. The victory marked the club’s sixth straight win on the road, which is now the second-longest run in Jets/Thrashers history behind a seven-game streak earlier this season (Oct. 9 – Nov. 12, 2024).\n* Hellebuyck surpassed Laurent Brossoit (7 GP in 2018-19) for the second-longest win streak in franchise history and now trails only his own record of nine games set in 2017-18. Hellebuyck owns the longest win streak by any goaltender this season – entering play, he was tied with Ilya Sorokin, Linus Ullmark, Pyotr Kochetkov and Logan Thompson (all w/ 7 GP).\n* The Jets now have a League-leading 42 wins, tied for the fifth most in NHL history by any club prior to their 60th game. They trail the 2022-23 Bruins (46), 2018-19 Lightning (44), 2015-16 Capitals (44) and 1995-96 Red Wings (44).\nMACKINNON BECOMES FIRST PLAYER TO 90 POINTS IN 2024-25\nNathan MacKinnon (2-1—3) became the first player to reach the 90-point mark this season and created space over Leon Draisaitl (43-44—87 in 58 GP) in the Art Ross Trophy race as the Avalanche (34-24-2, 70 points) scored four in the third period to move within two points of the Wild (34-20-4, 72 points) for third place in the Central. Colorado currently occupies the first Wild Card spot in the Western Conference.\n* MacKinnon collected his 67th assist, which is the second most by an Avalanche/Nordiques player through 60 contests in a season, trailing only Peter Stastny (68 in 1981-82). That total is also the fifth most by an active player through that game count, behind Connor McDavid (77 in 2023-24 & 72 in 2020-21), Sidney Crosby (71 in 2006-07) and Nikita Kucherov (70 in 2018-19).\n* MacKinnon, who extended his home point streak to 15 games, scored twice on the man advantage to tie Mikko Rantanen for the fifth-most power-play goals in franchise history. He trails Joe Sakic (205), Michel Goulet (147), Milan Hejduk (140) and Stastny (120).\nLANKINEN LOGS 20TH WIN IN #NHLSTATS: LIVE UPDATES\nThe Kings scored two late goals to force overtime but Quinn Hughes assisted on Conor Garland's game winner while Kevin Lankinen stopped 24 of 26 shots to help the Canucks (27-20-11, 65 points) leapfrog the idle Flames (28-21-8, 64 points) for the second Wild Card spot in the Western Conference. Hughes (48 GP) bested his own mark (49 GP in 2023-24) for fewest games to 60 points in a season by a Canucks defenseman while Lankinen earned his 20th win with the franchise. Find more notes from Wednesday’s slate in the latest edition of #NHLStats: Live Updates.\nQUICK CLICKS\n* NCAA notebook: James Hagens among top freshmen making impact this season\n* Best friends Dylan Larkin, Zach Werenski set to do battle at Stadium Series\n* Schenn brothers set to mark grand achievement\n* Tkachuks make appearance on ‘New Heights’ with Kelce brothers\n* NHL EDGE stats: 8 numbers behind THE GR8 CHASE\nBUSY 12-GAME SLATE FEATURES SEVERAL RIVALRIES, THE GR8 CHASE\nThere's a lot to look forward to during Thursday’s 12-game slate, including a rematch of the 2024 Stanley Cup Final between the Oilers and Panthers on Sportsnet, the Battle of Pennsylvania on ESPN+, Hulu and Disney+ as well as the continuation of The Gr8 Chase at Capital One Arena.\n* Connor McDavid and the Oilers visit former 4 Nations Face-Off teammate Sam Reinhart and the Panthers for the first time since Game 7 of the 2024 Stanley Cup Final, where the latter scored the championship-clinching goal. McDavid, who netted the 4 Nations Face-Off final winner in overtime for Canada, enters play just two assists shy of 700 in his career (357-698—1,055 in 697 GP) and can become just the third player in NHL history to reach the milestone in fewer than 700 games.\n* The Flyers (26-26-7, 59 points) enter tonight five points out of a Wild Card spot and will look to grain ground in that race when they take on Sidney Crosby and the Penguins (23-28-9, 55 points). Crosby, who is three assists shy of Gordie Howe (1,049) for 10th on the NHL’s all-time list, will aim to bring Pittsburgh back into the win column versus a Philadelphia club he has recorded 56-77—133 against in 89 career games – his most goals versus a single franchise.\n* Alex Ovechkin followed up his hat trick performance Sunday with another goal Tuesday and now sits 12 shy of breaking Wayne Gretzky’s all-time goals record (894). Should he find the back of the net again, Ovechkin would tie Howe and Teemu Selanne for the fourth-most goals by a player age 39 or older in a single season.\nDetroit, Columbus contest Stadium Series tune-up two days before event\nDylan Larkin and the Red Wings (30-22-6, 66 points) welcome Zach Werenski and the Blue Jackets (28-22-8, 64 points) to Little Caesars Arena as the countdown continues to tick away until Detroit and Columbus march into Ohio Stadium for the 2025 Navy Federal Credit Union NHL Stadium Series on March 1 (6 p.m. ET on ESPN, ESPN+, Disney+, Sportsnet+, TVA Sports, FX-Canada). The number of days remaining until the League’s first outdoor game in the state of Ohio is two, the same amount of open-air contests played by Larkin.\n* Detroit and Columbus are separated by just two points and occupy the Eastern Conference’s first and final Wild Card spot, respectively. Only three outdoor games in NHL history have involved teams within two points of each other and also battling for the final two playoff spots: 2015 Stadium Series at Levi's Stadium featuring San Jose (WC2) and Los Angeles, which was two points back of the Sharks; 2014 Winter Classic at Michigan Stadium between Detroit (WC1) and Toronto (WC2), who were tied at 45 points; and 2008 Winter Classic at Ralph Wilson Stadium, where Pittsburgh occupied seventh place in the Eastern Conference and was two points ahead of Buffalo.\n* Saturday’s festivities start with two free, non-ticketed events open to the public – the Honda NHL PreGame gets things underway (12 p.m. ET) followed by platinum-certified band O.A.R. headlining a concert during the NHL Stadium Series Pep Rally at St. John Arena (2:30 p.m. ET), which will also feature performances by the Ohio State University Athletic Band and Spirit program. The Athletic Band will then perform during player introductions and play “The Star-Spangled Banner” at the Opening Ceremony, capped by a ceremonial puck drop and flyover.\n* The Stadium Series will celebrate gameday traditions of both the Blue Jackets and Ohio State Buckeyes, including The Cannon being fired each time Columbus scores a goal. Large helmet stickers depicting The Cannon, Buckeye Leaves and NHL Shield adorn the side of the field leading to the stage, where Grammy Award-winning rock duo Twenty One Pilots will give a special first-intermission performance. The second intermission is set to feature a celebration of the Buckeyes’ national-champion football, women’s hockey and Spirit programs. Johnny Gaudreau and his brother, Matthew, will also be honored throughout the game.\n* More information can be found at the 2025 Navy Federal Credit Union NHL Stadium Series landing page as well as in the Interactive Information Guide and #NHLStats Pack.",
  "word_count": 1410,
  "scraped_at": "2026-02-14T13:41:03.112324"
}