{
  "article_id": "4b3a51222919",
  "url": "https://news.sky.com/story/feeling-ignored-bad-behaviour-by-staff-and-long-term-trauma-what-you-told-us-about-your-maternity-experiences-13491236",
  "title": "Feeling ignored , bad behaviour by staff and long - term trauma : What you told us about your maternity experiences",
  "date": "20260107T021500Z",
  "domain": "news.sky.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Feeling ignored, bad behaviour by staff and long-term trauma: What you told us about your maternity experiences\nHundreds of you got in touch with Sky News to share your experiences. We read all of your messages. Here's what you told us.\nWednesday 7 January 2026 02:58, UK\n\"I did everything I was supposed to do. I attended my appointments. I raised concerns. I listened to professionals. I trusted the system. And that trust very nearly killed me.\"\nThose are the words of Louise Prashad, one of more than 180 people who wrote to Sky News to share their birth stories, after we covered the stories of three women who had suffered traumatic maternity experiences.\nAlmost all the people who wrote in - more than 90% of the accounts we analysed - said they felt ignored or not listened to at some point by the healthcare workers who they had put their faith in during one of the most intimate and significant moments in their lives.\nFollow live: Your birth stories\nMore than four in five listed staff behaviour that was actively detrimental. For example, staff shouting at them or physically assaulting them in response to making loud noises during childbirth, or in one case telling a new mother not to ring the help bell for a couple of hours because there was a big football match on.\nMore than two thirds of people who wrote to us said they have had long-term mental trauma as a result of their childbirth experiences, while almost half said their babies were harmed as a result of what happened to them.\nThe impact of the birth trauma was not limited to mothers and babies. Many of the testimonies we received came from the partners, parents, siblings or other children of those giving birth, explaining how they too were left traumatised by what happened to their loved ones.\nThese experiences often led to marriages or other relationships breaking down, or the inability to add further children to the family.\nThe accounts we received are not representative of the normal childbirth experience, as measured in a recent survey by the Care Quality Commission (CQC).\nBut the fact so many people reported similar experiences, and they have clearly had such a long-term impact, show how important the issue is.\nMany of the issues raised by our readers also echoed the findings of the CQC report. One in five respondents to that survey said they felt their concerns during labour were not taken seriously. One in four said they didn't feel that postnatal mental health support was sufficient.\nDeaths during childbirth\n\"By the time anyone listened, it was too late. Daniel had died.\"\nDeaths of mothers or babies are still fortunately very rare during childbirth, but the risks are higher for older mothers, black and Asian women, and women in the most deprived parts of the UK.\nThe difference in death rates among newborns, comparing the most and least deprived areas, has been getting steadily wider over the last five years.\nAs of 2023, a baby born in one of the most deprived parts of the country was 2.4 times more likely to die in childbirth compared with a baby born in one of the least deprived parts of the country.\nA few of the people who wrote to us explained that they had bad experiences giving birth in the UK, but better experiences with either earlier or subsequent children in other countries, like Ireland, Italy, and Australia.\nThese examples are individual experiences, but UN data does show while health outcomes for mothers in most parts of the world have got considerably better in recent decades, they have been getting worse in the UK.\nOf the 186 countries the UN collects data for, the UK was one of only 14 where maternal mortality rates were higher in 2020 than they were in 1985. The US and Canada were also in that group, while Cyprus and Finland were the only other European countries represented.\nOver that time, the UK has fallen from having the ninth-lowest maternal mortality rate in the world to now being 42nd on that list.\nHow outstanding staff made awful experiences bearable\nWhile most of the people who felt compelled to write to us shared bad or traumatic experiences, there were also positive stories to tell.\nOne woman wrote about how fear of NHS hospitals meant her daughter-in-law had her two children at home. She said both children were born safely and successfully.\nThere were many others who praised individual staff members for making their otherwise awful experiences bearable.\n\"On 8 April 2023, during the night shift, a gynaecology student from University College London (UCL), a blonde male, was present in theatre. He held my hand and gently stroked my forehead during the whole time I was haemorrhaging,\" said one woman.\n\"I still look for his face in the crowd every time I walk pass UCL, I don't know his name, but he was the single person who made me feel I was still alive. If you ever read this, thank you.\"\nIf you have suffered from birth trauma and would like to share your story, contact Sky News by messaging us on WhatsApp +44 7583 000853, emailing news@skynews.com or using 'Your Report' on the Sky News app.\nThe Data x Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done.",
  "word_count": 945,
  "scraped_at": "2026-02-14T12:13:29.292577"
}