{
  "article_id": "4b4b23600150",
  "url": "https://www.sactownmag.com/ready-for-prime-time/",
  "title": "Profile of NBC Anchor Lester Holt - Ready for Prime Time",
  "date": "20250225T111500Z",
  "domain": "sactownmag.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Ready for Prime Time\nForty years after his first break at KCRA, Lester Holt was tapped this summer for the top spot in American broadcast journalism—the anchor of NBC Nightly News. Here’s how “Lightning Bolt Holt” guided his career from the streets of Rancho Cordova to the heart of Rockefeller Center.\nOne Saturday morning this past July, Lester Holt parked his rented red Toyota Corolla at the mouth of Television Circle. It’d been 40 summers since, as a teenage news addict growing up in Rancho Cordova, he took the No. 18 bus to J Street and walked six blocks north to this driveway bordering downtown Sacramento. At the end of the driveway loomed the brick building that houses KCRA, the TV station whose newscasts young Lester had consumed regularly, prompting his unannounced visit to ask for his first job in broadcasting. Four decades later, as blue sky punched through soft, streaky pewter clouds overhead, Holt strode toward the building as part of his latest job in broadcasting—the anchor of NBC Nightly News with Lester Holt.\nKCRA executives had known Holt was coming this time, stopping by on a tour of influential NBC affiliates. (He’d inaugurated the tour in Detroit two days earlier.) Now they could prepare: A few dozen staffers gathered inside a newsroom that was unusually populous for a weekend, slugging coffee and munching on pastries from Estelle’s Patisserie. Chatter and anticipation drowned out the piercing groans and squeals of police scanners. Shortly before 11 a.m., a KCRA executive ushered Holt into the newsroom. An eruption of cheers and applause burst around him, rippling out through the station’s corridors.\nHolt, tall and trim in his check-patterned shirt and brown necktie, grinned and waved. The occasion carried more than a whiff of hero’s welcome. NBC and KCRA had arranged a day of tapings on- and off-site, starting with a homecoming interview in the news studio with anchor Kellie DeMarco. Then there would be a recorded greeting to prospective advertisers attending the station’s upcoming Fall Launch Party. Next, a “Commitment 2016” spot promoting KCRA’s election coverage with DeMarco and fellow anchors Gulstan Dart and Edie Lambert. Then they’d shoot in the newsroom before heading downtown for more footage, including a meet-and-greet with firefighters and a succession of viewers around the Capitol and K Street.\nFirst, though, Holt had to reckon with the uneasy curiosity also pervading the space—the awkward undercurrent of replacing his embattled friend Brian Williams as the anchor of America’s most-watched network newscast. A months-long saga had seen the face of NBC News deposed for false claims made during a broadcast, triggering an existential crisis within the organization and shaking the faith of important affiliates like KCRA, whose symbiosis with NBC—the top-rated Sacramento newscast leading into the top-rated national newscast—helped sustain their respective leads in the Nielsen ratings. Williams’ suspension, Holt’s fill-ins, and NBC’s frantic efforts to recover had transfixed viewers and industry observers across the nation. Now, exactly one month after being officially announced as the permanent anchor of NBC Nightly News, Holt was back to help calm nerves in the same newsroom he essentially crashed as a high schooler, at the start of his career.\n“I do want to say on behalf of all of us at NBC, thank you, everybody, for your patience,” said Holt, his serrated baritone conferring its customary authority. “It’s been a bizarre six months, and trust me: I was caught in the middle of that riptide. I know everyone was on pins and needles. And by the way, so was I. There were all these rumors and reports as if I knew what was going on. I really didn’t. They told me [in June] as I was walking out the door for vacation, ‘By the way, when you come back, you’ll be the anchor of Nightly News.’ ”\nA cluster of ahhhs burbled up from the KCRA staff, punctuated by a man’s voice uttering, “Congratulations.” The staff resumed its applause. Holt wrapped up his speech and introduced himself around. He strolled to the studio, completing his tapings before the group shoved off to shoot their downtown interludes. Five hours later, sipping iced tea in the living room of his parents’ house just outside Elk Grove, the necktie comes off and Holt—seemingly at complete ease without ever fully relaxing—reflects on the day.\n“The promotional stuff—listen, it’s part of what we do,” he says. “We have to get the message out that there’s a new anchor. People want to be comfortable—they want to know who’s delivering their news. My folks live here, they watch KCRA every day. They know those [anchors]—but they don’t really know them. They’re in your living room every day. Even today, as I went there, I’d seen them a million times. But it was like, ‘Wow.’ It was kind of cool to meet them.”\nThe thing is, Lester Holt means this. He, too, watches KCRA when he visits Sacramento every five or six weeks, just as he watched anchors like Bob Whitten, Stan Atkinson, Kaity Tong and Joanie Blunden (later Joan Lunden, the Fair Oaks-raised former co-anchor of Good Morning America) deliver the news when he was growing up. Of everything that the 56-year-old makes look easy—intangibles like longevity, patience and charm, or the careful steering of his network’s nightly newscast out of the biggest media-industry scandal in recent memory—little comes easier to Holt than a sincere interest in stories and the lives inside them.\nThat sincerity has helped make Holt a figure of dizzyingly high esteem both on and off the air—a unicorn of sorts in 21st-century TV news. “No one has ever said a bad word to me about Lester Holt,” says Brian Stelter, the host of CNN’s media show Reliable Sources and the author of Top of the Morning, a best-selling behind-the-scenes chronicle of upheaval at NBC’s Today show and other morning TV escapades. “This is the television business! People have bad things to say about everybody. It just says so much about who he is that there’s such universal love and support and affection for him. ‘Love’ is not a word often heard about television anchors.”\nIn an era when a diffuse generation of anchors is held up against Walter Cronkite, David Brinkley, Tom Brokaw, Peter Jennings and other standard-bearing newsreaders of yore (or, more often, is eclipsed by hosts of comedy news shows like Jon Stewart, Stephen Colbert and John Oliver), Holt is both a throwback and an anomaly. He self-identifies as the Swiss Army knife of NBC News, and his résumé—12 years as the co-anchor of the weekend Today show, eight years as Nightly News’ weekend anchor, four years as the anchor of Dateline NBC, with various fill-ins and innumerable dispatches from war zones, disaster sites, sporting events and revolutions in between—backs this concept up. Holt’s new role as the Nightly News anchor, meanwhile, draws deeply from his years of hard-earned, carefully crafted perspective.\n“There’s a yearning for storytelling,” says Stefan Holt, 28, Lester’s elder son and a news anchor himself at Chicago’s NBC TV affiliate WMAQ. “The ability for an anchorman—such as my dad or even myself—to tell stories is a really good way to connect the viewer or the reader or the listener to a piece of information and how it affects them. I still think there’s a yearning for connection. Sure, times have changed. It’s a different landscape. But even with all the different sources out there, I think having the human connection makes a huge difference and is still important.”\nHolt’s NBC News tenure builds on his live coverage of stories like the 2000 presidential election recount for MSNBC (where his long shifts on the air earned him the nickname “Iron Pants”) and, prior to that, 20 years of work as a local anchor and reporter in Chicago, New York, Los Angeles, and Sacramento, where he piloted a news truck for the erstwhile AM country radio juggernaut KRAK while juggling a full load of classes at Sacramento State. (He dropped out in 1979 for a radio job in San Francisco, but was bestowed an honorary doctorate from the university in May.)\nWherever he was based, Holt made regular visits to Sacramento to see his parents Lester Sr. and June. During July’s whirlwind trip, he even attended church with them on Sunday before flying back to New York. That’s a new luxury for Holt, who hasn’t had Sundays off for years. It’s also a testament to his utter—and utterly refreshing—normalcy.\n“He’s kind of like we are—the way we raised him,” says Lester Holt Sr., 83. “He has the trappings of the job now, as far as the office is concerned. The private toilet, all this kind of stuff. But he says, ‘I’m still me. When I need to get coffee, I don’t need to tell somebody to get me a cup of coffee. I’ll get up and get my own coffee, and while I’m up, I’ll say, “Can I get you one?” ’ That’s just who he is. I don’t think there are any problems with ego running away with him.” Lester Sr. smiles wryly. “If there is, I’ll handle it.”\nWhile that type of everyman authenticity has its advantages both inside and outside the newsroom, Holt’s effortless cool on both fronts has proven an even more potent weapon for a network under the type of duress that threatened NBC this year. “What I’d say he brings to the party is an absolute calm in the storm,” says NBC News president Deborah Turness. “When news breaks, Lester says, ‘OK—when’s the next flight? I’ll get on a plane, I’ll go there.’ And he’s a guy who can land an hour and a half before airtime, [produce a story] package and anchor the show with no rehearsal and hardly any preparation. He can fly by the seat of his pants, and it doesn’t show.”\nHolt is hardly the only seasoned reporter to humbly pay his dues en route to a high-profile anchor job. But he is the one whose path to the anchor chair—a product of uncommon ambition, luck, patience, preparation, tragedy, talent and goodwill—winds through more peaks and valleys than perhaps any of his peers or predecessors. And more than any name appended to his newscast’s title, Lester Holt’s singular pursuit of the news—initiated four decades ago in Sacramento—will define what happens next at NBC.\n“One of the things I’ve learned in all my years in this business is that you can only hide the real you for so long,” Holt says. “And I think working [on weekend Today] for all those years helped me find that place where it’s OK to be [me]. At this point in the game, there’s no point in changing that. I’m doing a broadcast that has a lot of history; there’s always been a lot of reverence toward these broadcasts. And I respect that. At the same time, it’s 2015. We’re a little more informal. I just want to talk with people every night, not preach to them. And I want a broadcast that does the same thing.”\nWhen you stand back and look at the last eight months—the intense ratings pressure, media speculation, affiliate soothing and other corrections required in the wake of NBC’s shocking anchor shuffle—it’s almost enough to ask: What’s a nice guy like Lester Holt doing in a cutthroat business like this?\n*****\nSeventeen days after Holt’s KCRA visit, good news came to 30 Rockefeller Plaza, the iconic building in New York City whose third floor houses NBC News headquarters. In the vital July “sweep” contest—one of four annual Nielsen ratings clusters that helps set advertising rates for the season to come—NBC Nightly News had topped the ratings as the most-watched evening network newscast in America, averaging 7.9 million viewers per night for the month. More crucially, the program was No. 1 among viewers between the ages of 25 and 54—the demographic most coveted by television advertisers. By comparison, Nightly News had edged out its closest competition in the demo, ABC’s World News Tonight with David Muir, by just under 100,000 viewers per night during the July sweep.\n“Total viewers is a popularity contest; the demo is where the money is made,” says Stelter, adding that the industry-wide doubts heaped on NBC News after Williams’ suspension made both the overall and demographic wins all the more impressive. “If you had taken bets in TV newsrooms in June and said, ‘Is Lester Holt going to beat David Muir in July?,’ I don’t think anybody would have taken that bet. Yes, people love Lester. But people were betting against him from the perspective of, ‘Wow, NBC just went through a trauma. Those viewers went through a big change. It’s going to take a while to rebuild.’ Everybody assumed NBC was going to be in this rebuilding mode for a while. Instead, Lester comes out of the gate No. 1. I think it was a wonderful surprise.”\nTo reward the Nightly News team for its win, NBC caters lunch. A little before 1 p.m., while working on a script for the show’s coverage of the 50th anniversary of the Watts riots, Holt rises from his desk and walks down the hall outside his office. The NBC newsroom is long and narrow, overlooking Sixth Avenue, then bending at the building’s northwest corner, forming a kind of “J.” Holt’s office is at the lower terminus of the “J,” where his windows peer out at the elegant red neon and artist Hildreth Meière’s giant Art Deco plaques on the façade of Radio City Music Hall. He’d moved here roughly three weeks earlier, replacing Williams. Catching the light from one window is an Emmy statuette from 2010, when a brief substitution for anchor Matt Lauer on Today netted Holt a share of the show’s Daytime Emmy win for Outstanding Morning Program. Around it are mementos of Holt’s lifelong love of aviation: a model Alaska Airlines jet from his eldest brother (one of the airline’s senior pilots); a certificate commemorating a 2009 flight with the Blue Angels; a ’90s-era photograph of himself in a flight suit, flanked by sons Stefan and Cameron, from Holt’s coverage of a flight team based outside Chicago. Holt has yet to learn the electronic intricacies of the multiscreen video wall displaying live news feeds opposite his desk. “I got one going,” he says proudly, fidgeting with the controls.\nHe greets and congratulates the trickle of staffers joining him in an adjacent conference room, surveying the spread of wraps, salads, desserts and soft drinks on a table. After returning to his desk with his lunch, he turns to a colleague seated on the couch to his left. “It’s nice to see those numbers!” Holt tells her. “Of course, every time, then, you look at last night’s [ratings], but still. That’s a win.”\nIndeed, as a newsman, Holt is loath to rest on his laurels. He keeps track of the numbers as closely as anybody in the front office. His job depends on them, and he wouldn’t be in his position were it not for numbers. Take the number one, for obvious starters—Holt’s hard-fought place in the nightly news ratings. Or six, the number of months NBC News suspended Williams without pay after his fateful Jan. 30 newscast. In the final segment, repeating a false story he’d told previously on The Late Show with David Letterman in 2013, Williams claimed to have been on an Army helicopter shot down by a rocket-propelled grenade in Iraq in 2003. In fact, Williams and his crew were on a helicopter that later landed near the stricken chopper. A report in the military newspaper Stars and Stripes exposed the exaggeration, leading to Williams’ announcement on Feb. 7 that he would take a voluntary leave of absence from NBC Nightly News.\nHolt was at home with his wife, Carol, when Williams called to read the announcement, a three-sentence statement that said in part, “Lester Holt has kindly agreed to sit in for me to allow us to adequately deal with this issue.” Williams wanted to make sure Holt approved before NBC distributed the message.\n“Of course,” Holt told him. “Whatever I can do to help us through this.”\nFrom there, Holt didn’t know what to say. The men acknowledged to each other the difficulty of the situation. Holt informed Williams, whom he considers a friend, that he would be there for him.\nHolt hung up, stunned. “He got off the phone and he said to me, ‘I feel like somebody’s just kicked me in the stomach,’ ” Carol recalls.\nOn Feb. 9, substituting on Nightly News amid an internal NBC News investigation and mounting public criticism of Williams, Holt informed viewers that Williams was “taking several days off this broadcast.” But according to reports in The New York Times and New York Daily News, NBC’s inquiry—led by its investigative reporter Richard Esposito—had already yielded enough transgressions to suspend Williams. (Concurrently, Williams’ reporting from New Orleans in the wake of Hurricane Katrina in 2005 was also called into question.)\nOn Feb. 11, midway through the first Nightly News broadcast in more than 10 years to not carry Brian Williams’ name in the title, Holt passed along word of Williams’ suspension. “If I may—on a personal note—say, it’s an enormously difficult story to report,” he said into the camera. “Brian is a member of our family, but so are you, our viewers. We will work every night to be worthy of your trust.”\nIn addition to viewers at home, NBC affiliates like the highly ranked KCRA were watching closely to see how Nightly News recovered. “It’s important that we have a strong news presence—and credibility, certainly,” says Elliott Troshinsky, KCRA’s president and general manager. “[Lester] brings credibility and familiarity to our market specifically because of his connection to Sacramento. He is interested in not only Sacramento, but also the West Coast, and I think he will bring a different dimension to stories on the West Coast that maybe we didn’t have in the past.”\nThe all-important numbers reflected the challenge of the work ahead. From Feb. 9-13, Holt’s first full week of anchoring, NBC Nightly News averaged 9.4 million viewers—a noteworthy drop from the average 10.2 million viewers who tuned in to Williams’ last week on the broadcast. By the same token, Holt’s first week also signified a boost of nearly 80,000 viewers over Nightly News’ average audience for the season, leading to an overall victory over World News Tonight in the February sweep period. Later in the spring, the shows traded leads in the 25-54 age demographic that is paramount to advertisers on network newscasts. Still, with Holt at the helm, viewership figures for NBC Nightly News stayed largely consistent—a credit to not only its audience’s loyalty to the NBC News brand, but also Holt’s stabilizing presence on the air and in the newsroom.\n“I recognized immediately that there had to be someone here whom this staff knew,” Holt says. “They knew me from the weekends, and from filling in. I also became, as the weeks went on, more aware that I was not just filling in [and] that there was kind of a need for people to have a touchstone—something that felt normal. My personal style tends to be…” He pauses, coaxing the words out with a quick clasp of his hands. “Some people say ‘laid-back,’ but I’m kind of no-drama. And that’s what this place needed. Whether it was me or someone else who could deliver that, I suddenly realized that it was kind of important to lift the mood a little bit.”\nWhile all of this was unfolding, Holt’s 25-year-old son Cameron, an analyst at Morgan Stanley, was hospitalized for nearly a month with a collapsed lung. Holt trekked to Cameron’s bedside in the morning and returned after each night’s broadcast. “We’d have dinner together in hospital chairs eating off paper plates,” Carol says. Holt missed one broadcast on March 2 and was back at Rockefeller Center the next day. “All of this was going on, and he would just show up to work and be rock steady,” Carol continues. “Now I don’t mean to be bragging, but he’s just that type of guy. He’s a calm guy under pressure.”\nThis famously extends to Holt’s facility with tension in the field. This is a man who, during Egypt’s 2011 uprising, dutifully braved revolutionary mobs until things got so treacherous that the network had to send a squad of extraction specialists to get him and his crew out. While covering the aftermath of the catastrophic Haitian earthquake in 2010, Holt slept outside on a runway each night before embarking on his rounds, which involved tableaus of death, destruction and despair so all-encompassing that NBC made counselors available to him and other reporters and crew who witnessed the horror. (Holt says he accepted the offer back in New York.) Just in his time substituting for Williams earlier this year, Holt anchored from riots in Baltimore, floods in Central Texas, and from a helicopter over the site of the fatal Amtrak train derailment in Philadelphia in May.\nThis insatiable hunger for being on the scene initially triggered other anxieties for Holt in his new role. As a veteran journalist who had happily settled into working weekends so he could spend the week jumping into big assignments for Dateline and his other news shows, Holt says he anticipated friction between reporting and anchoring a nightly network newscast. But he was reassured early on, he adds, when discussions with Turness, the NBC News president, revealed that NBC still wants Holt where the stories are—mostly.\n“The bar I’m trying to maintain is that we go if it’s big and if it’s something that I think I can add value [to] by being there,” Holt explains. “Sometimes, as the main anchor, I may be in a position to get an interview that we might not otherwise get. Sometimes we may take that gamble, and sometimes we may not. As much as I can control it, I don’t want to just stand there with a background of a twisted-up city or whatever the story might be.”\nTurness points to Holt’s journey this past summer to Havana, where he opted to anchor NBC Nightly News from a public square as opposed to the city’s newly reopened American embassy. “We don’t want him in a glass anchor’s box above the action and removed and divorced,” Turness says. “He wants to be in the action, inherent with all the risks that that brings and the unpredictable events that can occur when you’re right there in the heart of the action with real people. That would scare many people. But Lester loves that.”\nThe peak of the Nightly News drama found Holt grappling with entirely new and unusual tensions. Being the focus of media speculation about how and when NBC News would replace Brian Williams—likely with Lester Holt—especially discomfited him. Notwithstanding a few carefully stage-managed exceptions (like his appearance at Sacramento State’s spring commencement ceremony), Holt laid low. “Probably one of the best parts of a very difficult situation for those four and a half months I was filling in,” he says, “was the fact that I had license to be quiet—to keep my mouth shut and do my job.” He says he was relieved to briefly speak with Williams again on the phone after Holt’s permanent anchor status was announced, but the two haven’t yet discussed Williams’ transgressions.\nThrough the ups and downs, Holt still had his wit. “Underneath all this [business],” Lester Sr. says, “there’s a comedian.” NBC has showcased Holt’s sharp sense of humor over the years on weekend Today, during the first season of 30 Rock, or in his 2012 late-night TV bubble soccer match with network mate Jimmy Fallon, Stephen Colbert and former Meet the Press host David Gregory (himself a KCRA alum). The jury is out at NBC regarding how, if at all, news and entertainment will overlap after the downfall of the maximally visible Brian Williams, who remains the only sitting news anchor to host Saturday Night Live and who reportedly sought to succeed Jay Leno on The Tonight Show. For his part, Holt isn’t blind to the scrutiny his network is under after Williams, but he also doesn’t view extracurricular cameos as mutually exclusive to anchoring NBC Nightly News. “Where I draw the line,” Holt says, “[is] at something that makes a mockery of what we do or gives people an opportunity to question our commitment to the news or my commitment to the news.” He adds that he doesn’t expect the issue to arise anytime soon. “I suspect everyone’s a little sensitive to ask me [to appear on other shows],” he explains. “And more importantly, I know this first year is going to be incredibly busy.” (Turness echoes this, adding: “There is no blanket ban. There is no rule on this. And we’ll take each example as it comes.”)\nIn any case, Holt still delivers levity behind the scenes. In June, one day before NBC News chairman Andrew Lack called Holt into his office to tell him that he was indeed going to be the next permanent anchor of NBC Nightly News, a New York tabloid reported that Holt’s agents had attempted to maneuver the debacle into a sizable raise for their client—according to the paper, from $4 million annually to near or equaling the $10 million per year NBC was paying Williams.\n“I came in that day,” Holt remembers, “and everyone had read [the story]. Everyone was thinking about it. But no one was going to mention it. We were in our meetings, and everything was going along. And somebody mentioned some other story that was in that particular publication in the context of whether this was a story we should be doing. And I raised my hand and said, ‘I wouldn’t believe anything the XYZ paper publishes.’ ”\nThe room broke up laughing. The tension collapsed. Today, while the painstakingly modest Holt declines to discuss the status of his contract or its prospective renewal in 2016, media watchers suspect that Holt will likely get that raise.\n“I think that he has all the leverage in the world,” Stelter says. “Also, keep in mind his deal is up in the middle of a presidential election cycle. That’s the ultimate worst thing for a network. But it’s the best thing for an anchor.”\n*****\nLong before he was the savior of NBC News, Lester Don Holt Jr. was booted from the television studio at KTVA, a CBS affiliate in Alaska. He was 11 years old.\nAt the time, the Holt family lived on Elmendorf Air Force Base, a few minutes north of downtown Anchorage. The close-knit clan consisted of Lester Sr. and his wife June, Mike Swanigan (June’s son from her first marriage), daughter Donna and sons Wayne and Lester Jr. At the base, Lester Sr. worked as an aircraft maintenance technician whose service had flung him everywhere from Los Angeles (where he met June on a blind date in 1952) to North Africa to Vietnam. The Holts grew especially fond of Sacramento, where Lester Sr. was stationed at Mather Air Force Base between 1965 and 1967 and to which they would return for good in 1971.\nBut first, Alaska. Swanigan worked in radio and TV in Anchorage while attending the University of Alaska with an eye on Air Force officer training school. Eight years older than Lester Jr., Swanigan noted the boy’s shared interest in broadcasting. He sneaked the young Holt to his news and sports stints at KTVA, where Lester would fiddle with the equipment and watch Swanigan work. “He got thrown out a couple of times by the program director there,” says Swanigan, 64, now an airline captain with Alaska Airlines. “And I got chewed out for having my little brother there. But then later I’d sneak him back in, and he’d get caught again, and they’d tell him to leave.” (Holt would later pay his brother’s largesse forward, taking his own son—and future news anchor—Stefan along to TV sets in Chicago and New York.)\nWell after the Holts were back in the Sacramento region and settled into their new home in Rancho Cordova, Lester Jr. continued to hone his broadcasting chops. On his big brother’s early-model cassette recorder, he would tape himself reading the news before listening back, then repeat until he improved. Later, as a student at Cordova High School, he became the daily campus news announcer. “He really got into it,” says his mother, June, who will turn 85 in November. “He developed a pattern: He would read the announcements every morning, and then his closing line was, ‘And you’re up to date.’ He would practice that at home.” (Holt would include the exact time as well; he lifted the sign-off from KFI, the high-powered Los Angeles station he often picked up while scanning AM signals on his radio at night.) Holt went on to announce football games at Cordova High, while also singing in the school’s jazz choir and playing bass guitar in the school band. (A largely self-taught bassist who once played with country star Luke Bryan at the Grand Ole Opry and last year accompanied The Roots on The Tonight Show, Holt keeps the electric bass he bought at a J Street pawn shop in 1976 in his office across from Radio City Music Hall.)\nHolt’s KCRA cold call in 1975 resulted in a yearlong stint at the station, mostly unpaid, with a few bucks periodically for nighttime reception work and “Tonight on KCRA” voiceovers. His first on-camera appearance arrived during a segment on the station’s African-American public affairs show To Be Somebody.\nNext came the kind of crazy, right-place-right-time break that has practically defined Holt’s career. In 1976, Swanigan and his then-wife moved to Sacramento, where she could be closer to his family when he was called up to officer school and, later, pilot training. While awaiting the latter, Swanigan picked up nighttime DJ work at the country radio station KRAK—at the time, one of the most popular stations in Sacramento. After his pilot training slot opened up, he gave KRAK program director Walt Shaw his notice—and a referral to a certain polished young broadcaster he knew who could also run a control board.\n“I said, ‘OK, let me have a tape of him then—let me see what he sounds like,’ ” remembers Shaw, who still works with CBS Radio in Sacramento. “[Lester] sounded OK to me. He knew everything he was supposed to do. [Mike] had trained him well, obviously.”\nAnd so it was that high school senior Lester Holt became the nighttime DJ at KRAK. Soon he was reporting news on the air as well, zooming from scene to scene at the crackling, seductive whims of the police scanner in the station’s tricked-out Jeep Cherokee. (“He called himself some crazy thing on the air—Lightning Bolt Holt, or something like that,” Shaw recalls.) He held the full-time post all the way into his junior year studying government at Sacramento State. Then one day, Holt—still living with his parents—returned home from a job interview at KCBS radio in San Francisco. “He came in and told everyone to stay off the phone,” recalls Lester Holt Sr. “He said, ‘They promised they would call me.’ I thought, ‘Yeah, right.’ But they called him and offered him the job.” To his otherwise supportive parents’ dismay, Holt quit school to accept it.\nOnce at KCBS in 1979, Holt chased news around Northern California in the station’s blue Ford Granada equipped with police scanners and a two-way radio. This was in addition to the police scanners in his apartment. “I was a news nerd,” Holt says. “I was never off duty.”\nBefore long, he was pursuing Carol Hagen, a United Airlines flight attendant and a friend of one of Holt’s KCBS coworkers. One afternoon early in their relationship, as Holt and Carol were heading out for a date, KCBS called to dispatch him to an out-of-control forest fire in the Napa Valley. After hanging up, Holt paused a moment and asked Carol if she wanted to join him. “I thought, ‘Wow, I’ve never been invited to go on a breaking news story before,’ ” she says. “ ‘ A forest fire—that could be considered a hot date!’ So I said, ‘I’m game.’ I guess I knew what I was getting myself into with Lester and his career.” They spent that evening together touring and observing the burned-out areas from the back of a Highway Patrol car.\nThey later vacationed in New York City, where Holt met up with Jerry Nachman, a former reporter and mentor at KCBS who had joined the staff at WCBS-TV. No sooner had Holt visited the studio than Nachman urged the 22-year-old to try television. Holt’s impromptu audition—his first TV news foray since his brief on-camera stints at KCRA—resulted in a story about the hunger strike of imprisoned Irish Republican Army member Bobby Sands. A few weeks later, WCBS offered Holt a reporter job. He accepted. Carol, who was laid off amid the airline industry’s contraction in 1981, followed him to New York. Less than a year later, they were married.\nLess than a year after that, the couple was off to Los Angeles, where Holt joined KNXT-TV as a weekend anchor and reporter. Then it was back to WCBS for three years before, in 1986, Holt’s next incredible break arose: Embroiled in Jesse Jackson-led protests over the demotion of the station’s only African-American anchor, the general manager of WBBM-TV in Chicago—who had worked with Holt in LA—approached Holt about joining the weekday anchor rotation. Holt was 27 years old; he and Carol were expecting their first child, Stefan, and plotting a move to a bigger apartment in New York. Instead, they moved to Chicago, where Holt would become a news scene staple for the next 14 years.\nIn 1995, eerily foreshadowing his replacement of Brian Williams 20 years later, Holt supplanted the Chicago institution Bill Kurtis as the co-anchor of WBBM’s ratings-challenged 10 p.m. newscast. (“I never wanted it perceived that I was pushing Bill out the door, because you don’t push a guy like that out the door,” Holt told the Chicago Sun-Times that April. “I was very, very patient about it. When it was going to happen, it was going to happen.”) It was just the latest example of how fortune—and sometimes misfortune—favors Lester Holt. This is not lost on him. To say he hasn’t looked back after all these years would be inaccurate, perhaps even an affront: He says he has thought often about this phenomenon since February, from his summoning at WBBM to the tragic circumstances of weekend Today co-host David Bloom’s death in Iraq (which led to Holt’s 12-year term on that show) to, of course, Williams’ fall from grace. Holt is humble about what this has meant for him and his family. As one of the most tireless workers in news, he is also unashamed.\n“Stuff happens to me,” he says. “It just goes to prove my theory that all you can do is do your job well. None of the opportunities I’ve had did I make happen. The way I look at it is that everything I’ve done is to prepare myself professionally. The opportunities have presented themselves through things that were out of my control. The only thing I could control was that when the doors of opportunity opened up, I was ready.”\nThis principle applies even to Holt’s rare downturns. In late 1999, with underwhelming ratings still plaguing WBBM, Holt faced a demotion from co-anchoring the 5, 6 and 10 p.m. newscasts to overseeing only the afternoon news at 4:30. “There is a moment in this job sometimes,” Holt says, “where you feel the breeze blowing against you.” The proposed shift to afternoons, he adds, was one of those moments. “I remember saying it: ‘I think it’s time to move on.’ ”\nSecuring new work was not as easy as he expected. Months passed before Holt found himself at a Starbucks in New Jersey. He’d gone to discuss prospects with executives from NBC’s cable news startup MSNBC, which was still finding its legs as a TV/Internet hybrid four years after launching. By June 2000, Holt was close to accepting an offer from KNTV in San Jose, which was in the midst of affiliating with NBC. The chance to anchor in California, closer to his parents, had unmistakable appeal. Then, nearly two months since its last contact with Holt, MSNBC invited him to its facilities in Secaucus, N.J. Holt flew out, even deigning to his first audition since 1981. Mildly insulted and short on time, but admittedly intrigued by the tech-forward news operation, he wrote down KNTV’s salary offer on a slip of paper and asked the MSNBC execs to call him if they were interested.\nHolt was on the phone with Carol in Chicago, en route to Newark Airport, when a call-waiting beep interrupted. It was MSNBC. Ten minutes later, when Holt phoned his wife back from the terminal, he had another job offer to share with her. “I don’t know what to do,” he said. Carol advised him to not only think it over but also savor the moment—after all, options like these were what he’d worked his whole life for. “The strange thing,” she says today, “is that California is home for us, but going to New York, for me? I just instinctively knew it was the right thing to do.”\nNevertheless, when they hung up before his flight, neither Carol nor her husband knew what he’d decide. A few minutes later, while shopping at the airport gift store, Holt had made his choice. Back in Chicago, Carol greeted him alongside Stefan and Cameron at the front door. The boys, imagining a future of movie stars and swimming pools, chanted “California! California!”\nHolt entered cheerfully. “I remember him throwing Yankees T-shirts at us on the stairs,” Stefan says. They were going to New York.\n*****\nWhen he’s not out on a story, Holt’s day typically begins at 7 a.m. He watches Today, dives deep through news headlines and then commutes via subway to Rockefeller Center, roughly 25 blocks uptown from his residence near Madison Square Park. When the weather is particularly nice, he tries to take advantage of the city’s ubiquitous bike-sharing program. (He admits that his new hours, when parking slots for the bikes fill up fast, make this difficult.) A morning editorial meeting at 9:30 maps stories for the day. Around 11 a.m., time permitting, Holt works out at NBC’s gym on the eighth floor. Individual meetings, planning sessions, and script writing then precede what the newsroom calls “the 2:30,” or its rundown of stories expected to shape the live newscast at 6:30 p.m.\nOn the day of Nightly News’ latest ratings victory, staffers clear lunch from the conference room table where they and Holt will gather at 2:30. Producers in Washington, D.C., and Los Angeles join the New York crew on video and phone feeds. Holt mostly listens, taking notes on the stories for which he will later write his own leads. As the meeting proceeds, presidential politics creeps higher in priority: Fox News would announce the participants in the first Republican presidential debate in a few hours, and Andrea Mitchell, NBC’s chief foreign affairs correspondent, stands in the doorway behind Holt mulling over rampant speculation that Joe Biden might run for the White House.\n“I don’t know,” Mitchell says. “I change my mind every minute, which is what’s going on with him.”\n“Is there any more money out there for him?” Holt asks.\nThe ensuing discussion leads to nothing conclusive—at least not as conclusive as the story that Holt’s former weekend Today colleague Jenna Wolfe has brought to the meeting: a scientific study showing how office temperatures historically favor men’s metabolic rates over women’s.\n“We’re not nuts,” Wolfe says over chuckles and murmurs. “It’s actually freezing. Fashion tells [women] that we have to wear these short sleeves. Lester’s wearing 16 layers, so of course he’s like [sweating] over here, and we’re literally burning calories over here trying to stay alive because we’re so cold.”\nHolt grins and shrugs incredulously. “This sounds personal to me,” he jokes.\n“The Meet the Press studio is freezing!” Mitchell says. “Like a meat locker.”\n“So we’re going to revisit it now that we have actual scientific data to prove that we’re not insane,” Wolfe says. “It’s cute. We spoke to a bunch of people.”\n“Cute?” Holt responds, recoiling in mock defensiveness. “It sounds hostile.”\nLaughter floods the meeting. The story would close the 6:30 broadcast, a fast-moving affair whose planned lead story at 5:30—a fatal circus tent collapse the day before in New Hampshire—was suddenly replaced at 6 by a new story: Jeb Bush’s campaign comment suggesting funding cuts for women’s health programs, and the rebuke it sparked from Hillary Clinton. At his desk on the “rim,” the newsroom’s archipelago of workstations where the Nightly News brain trust joins to assemble the show, Holt uses two fingers to type out a new lead for the Bush story. He reads it back silently, then mutters the words aloud to himself. Phones ring, chirp and vibrate; flurries of emails and tweets stick to computer monitors. Holt types again, reads again. Then it’s time to go to the studio.\n“This is where it gets fun,” he says, approaching studio 3B, the home of Nightly News. He says it’s his favorite time of day. “It’s always just about trying to keep the broadcast fresh.” There wasn’t enough new to warrant the tent collapse at the top of the newscast; the Bush remarks, Holt says, would carry over into the next day. “It feels like this could be a new page or a flash point in the campaign,” he adds, while he dons his jacket and a stage manager affixes his microphone. “We’ll be second-guessing each other right up until 6:30, just so you know. It’s par for the course.”\nHolt smiles his smile of unfathomable cool under pressure. It’s enough to make you disbelieve this is a man who, prior to the Williams scandal, had consulted with NBC News brass about slowing down. “I’m in the second half of my 50s now,” he explained a few weeks earlier in Sacramento, after completing his promotional rigors at KCRA. “And I think it’s time to just start tapping the brakes a little bit.” For roughly two years, Holt had internal discussions about leaving weekends at the end of his contract in 2016. Perhaps it would mean focusing more on Dateline, or moving to a national correspondent role. Either way, he recalled, he intended to come off of anchoring.\n“The more I talked about it,” Holt said, “the more comfortable I was. I almost surprised myself—‘Yeah, I’m OK with that.’ I still want to be in this business. I still want to be at this network. I still want to be part of big stories. But I don’t have this need to sit behind this desk any more. My personal value is not in that. That’s why all this has kind of swept me around. Nothing about this was in the cards.”\nEven with the Nightly News job, it’s not as if Holt has extricated himself from weekend work. In fact, it’s made him busier. “He’s at work right now,” Carol Holt said on another summer Saturday from Los Angeles, where her husband was putting in time with the local NBC affiliate. (The Holts recently bought a second home in Santa Monica; Holt says he plans to anchor more from Los Angeles while gradually expanding NBC News’ footprint in Silicon Valley and other newsmaking hot spots across the western United States.) Like Holt, she accepts and lives by the vicissitudes of the news business. He frequently calls and texts from the field—a photo from the seashore near Sochi where he crafted a heart from rocks and shells while covering the 2014 Winter Olympics (a response to her stashing heart-shaped Reese’s candies in his luggage), or notes reassuring her from a safe house in Egypt or a bunker in Afghanistan. Like Holt’s entire family, she knows what drives him; since some of their earliest dates, it’s really the only Lester Holt she’s ever known.\nStill, like her husband, Carol Holt envisions life after TV.\n“I met him when he did radio, [and] I thought that was an interesting job,” she says. “The TV job is an interesting job, but at some point you retire, and you’re not the TV guy anymore. And I fell in love with the guy who wasn’t the TV guy. I fell in love with Lester Holt with the scanner in his car, running around and covering stories. He could stop doing TV right now, and it wouldn’t matter to me.”\nLester Holt still has TV in him, of course, along with a memoir he hopes to write about it all someday. (“I just don’t know how it ends,” he says, laughing.) And there’s always Sacramento, the city in his blood that—by all indications—keeps him close, too. During his KCRA visit in July, while taping footage outside the Capitol, Holt encountered three women—Wava Race, Angela Jaszewski and Barbara Gamba—crossing L Street. Upon seeing him, the trio did a double take.\nRace clasped her face in excitement. “Welcome back to Sacramento!” she cried.\n“How are you?” Holt said, extending his hand. “I’m Lester.”\nThe cameras rolled as Holt and the women carried on. They mentioned coming from lunch at Ambrosia Café on K Street. Holt told them it had been a long time since he lived here, but he remembered K Street Mall.\n“Now they’re building an arena,” Jaszewski replied, gesturing down the street.\n“I saw that,” Holt said. “It’s actually happening, isn’t it?”\nJaszewski exulted, raising her hands. “Finally!”\n“Can you get me tickets?” Holt asked.\nThe four of them laughed. A KCRA staffer walked up from behind the camera. “Ladies,” he said, “can I have you welcome him back to Sacramento one time? I love that line.”\n“Welcome back to Sacramento!” Race repeated.\n“Oh, thank you!” said Holt, picking up where he left off. “It’s home. It’s always nice to be back.”",
  "word_count": 7716,
  "scraped_at": "2026-02-14T12:11:01.509646"
}