{
  "article_id": "4b5d361858e2",
  "url": "https://www.rockmnation.com/2023/5/23/23733349/rip-to-rick-hummel-st-louis-legend-and-mizzou-grad",
  "title": "RIP to Rick Hummel , St . Louis legend and Mizzou grad",
  "date": "20230523T143000Z",
  "domain": "rockmnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "RIP to Rick Hummel, St. Louis legend and Mizzou grad\nMizzou Links for May 23, 2023.\nOn Monday, St. Louis said goodbye to one of its local legends. It just so happens he learned what he knew at Mizzou.\nThe St. Louis Post Dispatch announced on Sunday that Rick Hummel, longtime Cardinals writer and Mizzou grad, had died over the weekend.\nHummel is much more well known for his connection with St. Louis and the Cardinals, but the fact that he learned his trade — which earned him the highest award given by the Baseball Writers’ Association of America and a spot in the Missouri Sports Hall of Fame — at Mizzou makes this a personal connection... especially for this native St. Louisan who graduated from Mizzou with a journalism degree.\nThere are many, many wonderful tributes to the Commish floating around, so I’ll leave you with just a few. RIP Commish. Thanks for the stories.\nMore Links:\n- The Godfather listed a few Mizzou quarterbacks on his Top 75 college QBs of the 2000’s list. You’ll have to be an ESPN subscriber to read the whole thing, but let me just say this: The No. 1 overall pick surprised me quite a bit, and I think the second Mizzou QB listed should’ve been much higher.\n- Luke Mann is baseball’s lone selection for the All SEC teams, making the list as the Second Team Third Baseman. If you recall, Mann recently tied Jacob Priday for the program’s all-time lead in home runs.\nIn addition to Mann, senior Hank Zeisler was Mizzou’s honoree for the SEC Community Service Team.\n- With Hilke Feldrappe on board, Chris Kwiecinski revisits the state of the Mizzou women’s roster and points out a few places where Pingeton and staff could still strengthen headed into the summer.\n- A Mizzou reunion in Rhode Island?\n- The Sickos Committee PUT SOME GOT-DANG RESPECT ON MIZZOU DISC GOLF’S NAME!!!\nWe’re coming for that Dairy Tasting trophy next, Clemson...\n- One game at a time. First up at the SEC Championships, Mizzou must beat Auburn, who just swept the Tigers this weekend. Check out the preview at MUTigers.com.\n- Women’s Track & Field has moved up in the rankings\n- Blue Springs native Kadence Shepherd has committed to Mizzou Softball. Head Coach Larissa Anderson is conducting exit interviews this week and we should expect to see some movement.\n- GP held his foundation’s annual golf tourney. It was a who’s who of Mizzou Football. Chanel Porter talked with Pinkel.\n- Columbia and former (barely) Mizzou Tiger Michael Porter, Jr. is headed to the NBA Finals for the first time in his young career, and for the Denver Nuggets. MPJ scored 15 points in 41 minutes on 5-15 FG and 3-10 from 3PT with 10 rebounds, an assist and a block.\n- If you’re looking to sign up for ESPN+, Rock M Nation now has an affiliate link: click Here for ESPN+ Now!\n- If you’re looking to sign up for a new streaming service, you can try FuboTV: click HERE for FuboTV access — FuboTV now has ESPN, CBS, FS1 and more sports channels. (** RockMNation has affiliate partnerships. These do not influence editorial content, though RockMNation may earn commissions for products purchased via affiliate links.**)",
  "word_count": 548,
  "scraped_at": "2026-02-14T13:35:43.966898"
}