{
  "article_id": "4b72c7719f41",
  "url": "https://www.winnipegfreepress.com/breakingnews/2025/04/01/a-dream-come-true-2",
  "title": "  A dream come true  – Winnipeg Free Press",
  "date": "20250401T231500Z",
  "domain": "winnipegfreepress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "‘A dream come true’\nSantarsieri’s bid for national futsal team highlights hard work\nAdvertisement\nElla Santarsieri was already regarded as one of the premier young soccer talents in the province. Now her stock is rising as a potential national futsal star.\nRead this article for free:\nor\nAlready have an account? Log in here »\nTo continue reading, please subscribe:\nMonthly Digital Subscription\n$1 per week for 24 weeks*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $4.00 plus GST every four weeks. After 24 weeks, price increases to the regular rate of $19.95 plus GST every four weeks. Offer available to new and qualified returning subscribers only. Cancel any time.\nMonthly Digital Subscription\n$4.99/week*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $19.95 plus GST every four weeks. Cancel any time.\nTo continue reading, please subscribe:\nAdd Free Press access to your Brandon Sun subscription for only an additional\n$1 for the first 4 weeks*\n*Your next subscription payment will increase by $1.00 and you will be charged $16.99 plus GST for four weeks. After four weeks, your payment will increase to $23.99 plus GST every four weeks.\nElla Santarsieri was already regarded as one of the premier young soccer talents in the province. Now her stock is rising as a potential national futsal star.\nRead unlimited articles for free today:\nor\nAlready have an account? Log in here »\nHey there, time traveller!\nThis article was published 01/04/2025 (319 days ago), so information in it may no longer be current.\nElla Santarsieri was already regarded as one of the premier young soccer talents in the province. Now her stock is rising as a potential national futsal star.\nThe Winnipeg teen recently took part in the inaugural Canadian Women’s Futsal National Team camp in Montreal, where she was one of 28 players from across the country and the lone Manitoban to receive an invite.\nThe 17-year-old was also one of the youngest vying for the attention of coaches against players in university or who have already graduated and possess decades worth of experience playing futsal.\n“It’s nerve-wracking the you’re competing against people that have dedicated their whole life to this and you’re kind of new to it, but I think it was an incredible experience and it was also a really great learning experience because the coaches there taught me a lot about the actual sport itself that I didn’t know, and some techniques on how to score different goals and positioning wise,” said Santarsieri, who will graduate from St. Mary’s Academy in June and play soccer at the University of British Columbia in the fall.\nFutsal is a fast-paced, indoor version of soccer that is skyrocketing in participation across the world. Matches are often played on a hard court with five players (four outfield and one goalkeeper) and use a ball that is smaller but heavier than a soccer ball.\nThe sport has grown nationally, particularly on the women’s side, as the first women’s Futsal Canadian Championship was hosted in 2023 and now the national team is taking the proverbial next step.\nThe women’s national team has competed in events sanctioned by the World Futsal Association, including the Futsal World Cup, since 2013, but in January, the Canadian Soccer Association formed an official program that could play in CONCACAF (Confederation of North, Central America and Caribbean Association Football) events.\nThe top 25 players from the tryout will be long-listed for the team, while a final roster of 14 will be selected to represent Canada at the CONCACAF Women’s Futsal Championships in Guatemala from April 29 to May 4.\n“… I thought I still did good and I did what I could to try my best to stand out and make the team.”–Ella Santarsieri\nSantarsieri left happy with her performance against the older competition.\n“I felt that this competition was a lot of a higher level, so it was a little bit harder to stand out against the players, but I thought I still did good and I did what I could to try my best to stand out and make the team,” she said.\nSantarsieri played futsal competitively for the first time in November, making her bid for the national team all the more impressive. It was the first time she was eligible to play, as Manitoba Soccer Association Cup rules restrict players from participating in the provincial tournament until their age-18 season.\nLearning the faster-paced game proved to be a seamless transition for the teen, who was 1v1 Futbol Dreams Academy’s leading scorer during the provincial championship.\n“I think given the size of our province, whenever we have any player, either in futsal or football, get called into any national team camp, it is a big deal,” Chris Lourenco, technical lead for the Manitoba Soccer Association, said in an emailed statement.\n“The hope is that it gives other Manitobans the chance to see it as a realistic opportunity. And the fact that futsal is still growing in the province shows what we are capable of. Ella is paving the way for others, which is a really cool thing to see.”\nSantarsieri is an offensive-minded attacking midfielder in soccer.\nShe’s been the leading goal scorer at every level of local competition since she was 13 and scored 53 goals in 17 matches in the Winnipeg Youth Soccer League last season.\nShe’s already travelling across the world for playing opportunities and getting exposure to some of the top women’s clubs in the sport, including Juventus Women, which plays in Italy’s top league.\n“My biggest strength is my (one-on-ones) and my finishing, and I think that’s what sets me apart is that super technical side,” she said.\n“… The fact that futsal is still growing in the province shows what we are capable of. Ella is paving the way for others, which is a really cool thing to see.”–Chris Lourenco\n“I train a lot with cone drills and I go to the field and just practice those (one-on-ones) over and over again. So, I’m really grateful that it shows in the game what I work on by myself.”\nSantarsieri and 1v1 Futbol Dreams Academy will represent Manitoba at the Futsal National Championships in Regina next week. She expects to hear a decision on whether she’s made the national team following that tournament.\n“A dream come true,” she said of the recent stretch of opportunities she received in both soccer and futsal.\n“My dream is to travel and just play soccer, so being able to do all these different things, I’m just really grateful for all the opportunities, and I hope that it inspires everyone back home to keep working hard, especially for futsal, because it’s so new to Manitoba.\n“I hope it inspires younger girls to start playing futsal because then it can grow in Manitoba. Soccer-wise, all these opportunities have just been really cool, and I think it’s a credit to all the hard work that I’ve put in in the last couple of years. It’s inspiring, even to me, to see what hard work can do.”\njoshua.frey-sam@freepress.mb.ca\nJosh Frey-Sam reports on sports and business at the Free Press. Josh got his start at the paper in 2022, just weeks after graduating from the Creative Communications program at Red River College. He reports primarily on amateur teams and athletes in sports. Read more about Josh.\nEvery piece of reporting Josh produces is reviewed by an editing team before it is posted online or published in print — part of the Free Press‘s tradition, since 1872, of producing reliable independent journalism. Read more about Free Press’s history and mandate, and learn how our newsroom operates.\nOur newsroom depends on a growing audience of readers to power our journalism. If you are not a paid reader, please consider becoming a subscriber.\nOur newsroom depends on its audience of readers to power our journalism. Thank you for your support.\nHistory\nUpdated on Thursday, April 3, 2025 1:15 PM CDT: Adds photos",
  "word_count": 1367,
  "scraped_at": "2026-02-14T12:43:37.033961"
}