{
  "article_id": "4b8efdf800c5",
  "url": "https://mondediplo.com/2022/08/10stdenis",
  "title": "Why Parisians fear and loathe Saint - Denis",
  "date": "20230327T180000Z",
  "domain": "mondediplo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Éric Zemmour, leader of the far-right Reconquête (Reconquest) party, doesn’t need to travel far to be out of his comfort zone. A metro trip a dozen stops north of central Paris to Saint-Denis will do. The department of Seine-Saint-Denis, he says, ‘is no longer France. There are little islands of France,’ he conceded in May after various incidents marred the Champions League football final in Saint-Denis, ‘but apart from that, it’s all foreign enclaves,’ full of ‘the usual people from the banlieues, thieves, looters and all sorts,’ who ‘mainly voted for [the left’s] Jean-Luc Mélenchon’ in the first round of the 2022 presidential election (1). Marine Le Pen, for her part, has called the department ‘out of control’, a ‘lawless zone’ in the hands of ‘scum’.\nPeople in Seine-Saint-Denis have heard it all before. For years it has been the media’s go-to example of the ‘Islamisation’ of the banlieues. After the terrorist attacks of 13 November 2015, the rightwing Figaro Magazine ventured north to conduct an investigation ‘among the Salafists of Seine-Saint-Denis’. ‘Our reporter plunged into the heart of a banlieue, one of these centres of radical Islam that openly claim to be part of the Islamic State,’ ran its headline (2). The following year, it followed up with a long article on ‘everyday Islamism’ in Saint-Denis, which it called ‘Molenbeek-sur-Seine’ after the area of Brussels where several of the terrorists who carried out the 2015 Bataclan attack lived.\nA red patch has spread around Paris. The capital of capitalism, is encircled by a proletariat which is becoming aware of its strength; Paris has rediscovered its suburbs L'Humanité\nIn 2017 it was the turn of television programme Enquête Exclusive on the M6 channel with a report that portrayed Saint-Denis as caught in ‘a vice between growing Muslim separatism and a soaring crime rate’. And in 2018 journalists Gérard Davet and Fabrice Lhomme published a book on Islamisation (L’Islamisation à visage découvert, Fayard) that focused on Seine-Saint-Denis. Even the foreign media have joined in; in July 2018 the UK’s Daily Mail ran a piece on Saint-Denis, which they called ‘a parallel state where allegiance to Islam comes before fealty to France’.\nFor over 30 years there have been suspicions that Saint-Denis is not fully part of France. In 1990 a journalist who made a ‘journey to the heart of Francs-Moisins’, Saint-Denis’s poorest housing estate, compared it to Algiers and the Los Angeles ghetto (3). The visibility of Muslims — identifiable, he said, by their greeting (‘a hand quickly raised to the heart and then the lips’) — made him fear ‘an Intifada at the gates of Paris encouraging cries of “Long live Saddam Hussein”.’ So Seine-Saint-Denis has been here before.\nThis historically working-class immigrant area has been the subject of major social fears for nearly two centuries. It has been a focal point for various panics, generally whipped up by Paris’s middle class but which then spread to broad swathes of French society. This stigmatisation originated at a time when Paris’s suburbs, in particular the northern part — which was not yet called Seine-Saint-Denis (4) — were undergoing rapid industrialisation. The new factories attracted workers, who soon worried the authorities. As early as 1830, when industrialisation was still in its infancy, the prefect of the Seine department, Gaspard de Chabrol, warned King Louis-Philippe: ‘Your police prefects are allowing the capital to be surrounded by a belt of factories. Sire, this will be the rope which will one day strangle it’ (5). Fear of the industrial suburbs rattled the Parisian bourgeoisie for almost a century.\nThe city’s outer fringes were regarded as somewhere Paris could consign all the activities it considered undesirable (cemeteries, hospices, muck-spreading, factories) and therefore seen as dirty, unhealthy, repulsive places whose contaminated air corrupted their inhabitants. The ‘dark suburbs’, with their thick smoke, gloomy slums and muddy roads, repelled polite society, which had embraced new theories of hygiene. ‘I can smell Aubervilliers,’ people in Paris joked in the late 19th century when bad smells drifted across the capital. Saint-Denis was sometimes called ‘Saint-Denis-la-Suie’ (Sooty Saint-Denis). Doctors and ‘social investigators’, sent there to analyse how it sullied the human soul, returned with the same diagnosis: the working classes posed a threat.\n‘The apaches are kings’\nIt was such attitudes that, in the early 20th century, enabled the rise of the myth of the ‘apaches’, the nickname given to the young thugs whom the police tried to drive out of the capital. ‘We lack security. We certainly lack it in the big cities and their suburbs. The apaches reign supreme. The apaches are kings,’ declared the bestselling Petit Parisien in April 1907. Its ‘Around Paris’ section served up a daily diet of sordid news items: ‘Saint-Denis. Miss Gross, a seamstress who lives in the Passage Choiseul, was going down the Rue de la Fromagerie yesterday morning. Suddenly, a man rushed at her and struck her in the abdomen with a knife.’ A Dr Viaud-Conand suggested in the Chronique Médicale in 1909, ‘Let us castrate the apaches! The human community has a duty to protect itself against this horrible human detritus and especially against the descendants of these degenerate procreators’ (6).\nFrom the inter-war period, the fear of the industrial, disgusting, foul-smelling and ill-reputed banlieue gave way to (or existed alongside) a new anxiety — the ‘red suburbs’, which raised the spectre of revolution over the capital. In the 1924 parliamentary elections, the new French Communist Party (PCF) surprisingly won 26% of the registered vote in Seine-Banlieue and 24.2% in Seine-et-Oise, securing nine seats. On 13 May, Paul Vaillant-Couturier expressed his delight in the Communist Party daily L’Humanité: ‘A large red patch is spreading around Paris. Revolutionary victory, from the strategic viewpoint, is indisputable. Paris, the capital of capitalism, is encircled by a proletariat which is becoming aware of its strength; Paris has rediscovered its suburbs!’ The theme of being encircled by communists became common, repeated not only by the PCF — to mobilise supporters and scare adversaries — but also by the bourgeois intelligentsia, who were, as historian Jean-Paul Brunet put it, suddenly carried away by ‘hysteria over a Bolshevik-style suburban Commune’ (7).\nAs the PCF strengthened its presence in the banlieues — in the mid-1930s it controlled more than 50 municipalities in the Paris region (including Bobigny, Saint-Denis, Saint-Ouen and Ivry) — many writers played on the panic theme. These included Édouard Blanc with La Ceinture rouge: Enquête sur la situation politique, morale et sociale de la banlieue de Paris (The Red Belt: an Enquiry into the Political, Moral and Social Situation of Paris’s Suburbs, SPES, 1927), in which he estimated there were 300,000 ‘Muscovites’ lurking in the Seine-Banlieue area ready to take up arms (the PCF had just 15,000 members at the time) (8).\nFear of communist ideas spreading\nFather Pierre Lhande caused a sensation in Catholic circles with his Christ dans la banlieue (Christ in the Suburbs, Plon, 1927), which sold hundreds of thousands of copies. In an account worthy of a returning missionary, the ‘Jesuit journalist’ fretted about the spread of communist ideas among the working class. ‘You should see them,’ he wrote in his description of the bistros of the banlieues, ‘through the fogged windows of the taverns, the frozen masks of workers packed around rough tables, their resolute chins resting on calloused hands, their expressions blazing with the double hallucination of uncontrolled drinking and brutal visions of revolution evoked by the orator.’\nThis new panic, which culminated in the inter-war period, receded during the Trente Glorieuses (the 30 ‘glory years’ from 1945), though the PCF strengthened its presence around the capital. But the banlieues, that scene of brutal urban change, remained a source of anxiety.\nLarge housing estates sprang up (as factory chimneys had done in the 19th century), particularly in the working-class and communist banlieues of what is now Seine-Saint-Denis. Low- and high-rise apartment blocks were the result of industrialisation and rationalisation in the construction sector, as well as massive funding for social housing. After an initial period of enthusiasm, in which people were amazed by these sharp-angled buildings, symbols of modernity, critics soon appeared, giving the banlieues their image of ‘grey suburbs’ of concrete and boredom.\nYou should see through the fogged windows of the taverns the frozen masks of workers packed around rough tables, resolute chins resting on calloused hands, expressions blazing from uncontrolled drinking and brutal visions of revolution Father Pierre Lhande\nThe magazine Science et Vie started this media trend in September 1959 with an article titled ‘Psychiatrists and sociologists condemn the madness of large housing estates’. Referring to apartments as ‘rabbit hutches’ became common. Journalists, researchers and politicians started criticising unhealthy urban planning that had, they claimed, created monotonous buildings, separation between living and working areas, and an absence of leisure areas or places to meet, all of which led to fatigue, isolation, depression and a sense of being overwhelmed, particularly for women. This disease of modern cities soon found a name, popularised by a series of articles in France Soir in 1963 on ‘the sickness of large housing estates’: ‘sarcellitis’ (named after the suburb of Sarcelles, north of Saint-Denis).\n‘A silo for people’\nThe Sarcelles housing development (more than 10,000 dwellings, in what is now the Val-d’Oise department) was presented as a model project when it was built, but soon became the target of criticism. In January 1960 Le Figaro compared the city to ‘a silo for people’, ‘a concentration camp where people no longer sing’. Five years later, the topic was aired on television, in the programme Seize millions de jeunes (16,000 Young People, ORTF), which devoted an episode to ‘the true housing crisis’ in March 1965. Here again Sarcelles was presented as a symbol of this new dehumanising town planning: ‘You’re a number, you’re nothing, absolutely nothing, you’re one in 80,000,’ one resident said (9). With the men all off at work during the day, the concrete suburbs were accused of depraving morals and breaking up families by pushing women into adultery or prostitution. Jean-Luc Godard took up this theme in Deux ou trois choses que je sais d’elle (Two or Three Things I Know About Her, 1967), in which Marina Vlady, a resident of La Cité des 4,000 in La Courneuve, sells her body for money partly through boredom.\nIn the 1980s, crime was added to the list of ills the banlieues were seen as producing, in the form of delinquency, violence, drug trafficking etc. Since then, this theme, which was soon dubbed the ‘problem of the neighbourhoods’, has never been absent from the news. It has, though, been gradually supplemented by new threats (including invasion by foreigners, separatism, religious radicalisation) that journalists love to illustrate by visiting Seine-Saint-Denis.\nEverything goes into the mix, even Mélenchon’s strong election results in this department in the first round of the presidential election; he won 49% of the vote, and as much as 80% in parts of some working-class housing estates. La Revue des deux mondes (11 April 2022) suggested that he had won ‘a Muslim vote, especially in Seine-Saint-Denis and Roubaix’ through ‘his new Islamo-leftist strategy’. Thus, with Islamisation, the fear of ‘green suburbs’ (as the far right love to call them) has been added to that of red suburbs. Ten years ago, when François Hollande won 40% of the votes in the first round of the presidential election in the department, and 65.3% in the second, this wasn’t called a ‘Muslim vote’; it was seen as usefully helping to oust Nicolas Sarkozy from the Élysée.\nAfter two centuries, the nightmares around Seine-Saint-Denis remain unfulfilled: apaches have not descended on the capital, nor have drunken workers, bearded communists or lurking mujahideen. Even so, this department, which has the highest poverty rate in mainland France and the highest proportion of immigrants, continues to function as a magnifying mirror of contemporary fears, testifying to an enduring fear of the working class that goes beyond the origin, nationality or religion of its inhabitants.",
  "word_count": 1994,
  "scraped_at": "2026-02-14T12:44:52.772566"
}