{
  "article_id": "4b98dd9ba9cf",
  "url": "https://www.yahoo.com/news/transgender-women-now-banned-pool-192901682.html",
  "title": "Transgender women now banned from pool female category",
  "date": "20250423T200000Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Transgender women now banned from pool’s female category\nTransgender women have been banned from the Ultimate Pool Group’s female category following the Supreme Court’s ruling on single-sex spaces.\nThe move comes a week after the UK’s highest court determined that sex was binary and just over a fortnight after the final of the Ultimate Pool Women’s Pro Series Event 2 at Robin Park Leisure Centre in Wigan was contested by two biological males.\nThat match between Harriet Haynes and Lucy Smith witnessed furious protests amid what had also been legal proceedings brought by female-born players over UPG’s transgender policy.\nThe latter prompted UPG to commission a report into whether eight-ball pool was a gender-affected sport as defined by the Equality Act, the outcome of which has also played a part in it becoming the second professional UK pool organisation to ban trans women from its female category.\nThe English Blackball Pool Federation became the first in 2023, only for Haynes to take it to court earlier this month. A judgment on Haynes’s lawsuit is pending but is also expected to be affected by the Supreme Court ruling.\nUPG said in a statement: “UPG today have amended our eligibility rules for the Women’s Series (and all women’s competitions held under UPG). With effect from 23rd April 2025, entry and participation in Ultimate Pool women’s events are open only to biologically born women.\n“We respect that some people within the pool community may find the changes challenging. As an organisation, we are committed to being empathetic to all members of our community and we expect all members of our community to reflect this.”\nIs eight-ball pool a gender-affected sport?\nThe rationale behind the change was explained in an update to its terms and conditions on its website. It read: “Since its inception UPG has been caught in a vacuum of uncertainty surrounding the issue of eligibility to participate in its women’s series. Two recent developments have now made the position clear.\n“UPG obtained an expert’s report upon the question: ‘Was eight-ball pool a gender-affected sport as defined by the Equality Act 2010?’\n“Crucially this report was commissioned to reach a conclusion not only on the question of whether there were biological differences between women born as women and transgender women recognised as women by way of a Gender Recognition Certificate, but also whether any biological differences meant that transgender women had an advantage in the specific sport of eight-ball pool.\nMore in World\n“The clear conclusion of the biological and cue-sports expert who jointly authored the report was that eight-ball pool was a gender-affected sport and that in cue sports female players have unique disadvantages compared to male players and that transgender women retain male advantages.\n“Separately, the decision of the Supreme Court in the case of For Women Scotland v Scottish Ministers was handed down on 16 April 2025. In this judgment the Supreme Court ruled that a Gender Recognition Certificate does not change a person’s legal sex for the purposes of the Equality Act 2010.\n“The Equality and Human Rights Commission (EHRC) chairwoman Baroness Kishwer Falkner has confirmed that the ruling has brought clarity and that trans women cannot take part in women’s sport and that the EHRC would pursue organisations which do not update their policies. UPG welcomes the clarity which this judgment brings.”\n‘Brave few stood up to protect women in sport’\nThe World Eightball Pool Federation has also been facing legal proceedings over its refusal to ban trans women from female competitions.\nFiona McAnena, director of advocacy at Sex Matters, said: “Yet again it was a few brave women who were forced to step up and take legal action to protect the female category for all women in sport. This should never have had to happen.\n“So many governing bodies have acted inexcusably, failing to provide sport that is truly inclusive of women and girls. The only way to give women the same fair competition as men get is to exclude all males from women’s competitions, however those men identify.\n“This is a tipping point. If cue sports like pool must exclude everyone male from women’s tournaments – and legally that is what they have to do – then every other sport that has a female category must do this too. Football, cricket, lacrosse and all the other holdouts must now take action. Sportswomen have been shamefully cheated for too long.”",
  "word_count": 734,
  "scraped_at": "2026-02-14T12:11:46.234086"
}