{
  "article_id": "4baa072e42f2",
  "url": "https://ynaija.com/ynaija-new-establishment/",
  "title": "YNaija New Establishment 2025 » YNaija",
  "date": "20260127T113000Z",
  "domain": "ynaija.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In what has become a YNaija tradition, we present to you the freshest and youngest Nigerians who continue to inspire despite the odds stacked against them.\nThese 100 people may not be household names yet, but you would do well to remember them now because this sure won’t be the last you will hear of them.\n- Chuka Okonjo\nChuka Okonjo’s work is driven by a clear interest in ownership, identity and long-term cultural value. Operating between Nigeria and the diaspora, he has built creative ventures and collaborations that centre African narratives while engaging global audiences. Through platforms like Compound Africa and other cultural projects, Okonjo has positioned himself as a builder rather than a personality, focusing on infrastructure, storytelling and community. His career reflects a wider shift toward intentional creative entrepreneurship, where visibility is secondary to impact.\n- Alabi Moronfoluwa (Founders of 49th Street)\n49th Street emerged from a simple but urgent idea: creatives need space that actually works for them. Led by Alabi Moronfoluwa and his co-founders, the project has grown into a cultural hub that supports exhibitions, events and creative exchange. By prioritising accessibility and community, the founders of 49th Street are contributing to a growing movement redefining how art and culture are hosted, shared and sustained in Nigeria. Their work highlights the importance of physical infrastructure in shaping creative economies.\n- Rukky Funny\nRukky Funny’s comedy is rooted in timing, character and everyday familiarity. In a crowded digital landscape, she has managed to stand out by developing a consistent tone that doesn’t rely on excess or gimmicks. Her skits often draw from social expectations, relationships and gendered experiences, offering humour that resonates across audiences. As more women claim space in Nigeria’s online comedy scene, Rukky Funny’s growing visibility reflects both persistence and evolving audience tastes.\n- Olushola Olaleye\nOlushola Olaleye is a Nigerian entrepreneur, business strategist, pastor and digital educator whose content bridges business, personal finance and leadership. Known online as @the_olushola, he creates educational reels, long‑form videos and resources that help founders and young professionals understand wealth creation, business growth and self‑leadership with clarity and practical steps. He runs a YouTube channel with tens of thousands of subscribers where he breaks down systems, income strategies and productivity frameworks, reaching audiences hungry for actionable financial and entrepreneurial insight. According to his public profile, Olaleye has founded several ventures in the food and fashion sectors and facilitates *Positioning For Profit*, an SME masterclass for business owners. He also serves as a keynote speaker at wealth‑focused events and as an ordained pastor at Celebration Church International, bringing together spiritual grounding and business acumen in his messaging. His influence in business education was highlighted by a nomination for Influencer of the Year (Business & Impact) at the 2025 MOI Awards.\n- Emmanuel Lokachi\nEmmanuel Lokachi represents a shift in how faith leadership shows up in public and digital spaces. As a young pastor, his communication style is direct, contemporary and shaped by an understanding of the realities young people navigate daily. Through online platforms and in-person ministry, Lokachi emphasises relevance and accessibility, positioning faith as something lived rather than removed. His approach reflects broader changes in how spiritual leadership is being interpreted and practiced among younger Nigerians.\n- Politicalbaby\nPoliticalbaby has built a following by refusing to separate politics from everyday culture. Through commentary that blends humour, critique and pop references, the platform engages audiences who might otherwise disengage from political conversations. By simplifying complex issues without diluting their urgency, Politicalbaby contributes to a growing ecosystem of digital civic education. The account’s influence underscores how political awareness is increasingly shaped online, outside traditional media structures.\n- Kenzy Udosen\nKenzy Udosen (Ekene Mfoniso Nna‑Udosen) is one of Nigeria’s most recognisable digital content creators, known for his character “Madam Theresa Omemgbeoji” — a wildly expressive, fashion‑forward Igbo woman whose humour, advice and exaggerated delivery have made the persona a fixture in the online skit scene. Created in 2018 while he was still a student, Madam Theresa blends sharp comedy with social commentary, drawing on everyday experiences and the dynamics of Nigerian family life to connect with audiences. His ability to balance humour with relatable insight earned him a nomination for Best Online Social Media Content Creator at the AMVCA 2023, and his content continues to reach hundreds of thousands of followers on Instagram and beyond. Udosen’s work reflects how character‑based skits can carve out cultural space and influence, turning online comedy into a sustainable creative career.\n- Cruise With Joe\nObasi Joseph is a Nigerian content creator, chef, event host, on‑air personality and entrepreneur from Imo State whose energetic digital presence and unique use of the Owerri dialect have made him a standout voice in the creator space. What began as casual food videos to promote his business took off in a major way after one of his noodle clips went viral, prompting him to fully embrace content creation alongside his roots in culinary arts. Today, Joe is the CEO of Joseph’s Pot, a food venture in Owerri known for its flagship dish Noodles wey burst brain, and he frequently showcases local culture, cuisine, fashion and lifestyle through authentic, engaging reels that connect deeply with his audience. Beyond online influence, Joe’s blend of creativity, entrepreneurship and community engagement has positioned him as a notable ambassador of Igbo culture and one of the most recognisable digital voices emerging from Nigeria’s Southeast.\n- Iyo Prosper\nIn 2025, content creator Iyo Prosper Adokiye took a significant step from internet favourite to industry recognitions when he won the Best Digital Content Creator award at the Africa Magic Viewers’ Choice Awards (AMVCA), beating competition from established names such as Taaooma, Brain Jotter and His breakout series, We Listen, We Don’t Judge (Bible Edition), reimagines biblical figures like Cain, Eve and Potiphar through a distinctly Nigerian lens, blending comedy, faith-based storytelling and cultural commentary in ways few creators have attempted. What sets Prosper apart is his commitment to making timeless narratives accessible to younger audiences without diluting their depth, a balance that earned him critical acclaim and a growing online following across Instagram and TikTok.\n- Samuel Okike\nSamuel Okike’s path crosses the worlds of media, tech and cultural commentary in ways that reflect broader shifts in Nigeria’s digital information landscape. As a marketing strategist and media contributor, Okike has written on technology and internet culture for outlets including Techpoint Africa, TechCabal, YNaija and The Nation, marrying sharp insight with accessible analysis. Beyond writing, he is involved in tech initiatives such as Hello Ibadan and Hello Lagos City, platforms aimed at chronicling urban life and community in Nigeria’s most dynamic cities. Okike’s career reflects a generation of thinkers who move fluidly between storytelling, strategy and community building.\n- Wahab Okoya\nWahab Okoya, widely known as Mr Lifestyle, is carving his own lane in Nigeria’s luxury and fashion space while carrying the legacy of one of the country’s most storied business families. As the son of Chief Razaq Akanni Okoya — the industrial giant behind the Eleganza Group — Wahab grew up acquainted with enterprise and style, but he has made it clear that his ambitions extend beyond inheritance. Building on the prestige of the family name, he launched Eleganza by Mr Lifestyle, a fashion eyewear brand that champions Nigerian design and modern sophistication, blending premium style with cultural relevance for young professionals and creatives alike.\nThough he often features family and lifestyle in his public life, his work with Eleganza by Mr Lifestyle signals a commitment to creating a distinctive fashion identity that resonates both at home and in the diaspora.\n- Shamz Garuba\nShamz Garuba’s creative practice blends fashion, personal style and cultural representation. On Instagram, his posts reveal an interest in visual storytelling that aligns with a broader movement among Nigeria’s youth toward self-authored aesthetics. Whether documenting streetwear looks, editorial moments or lifestyle visuals, Garuba’s work speaks to a generation who treat style and image as narrative tools rather than mere accessories, and frames personal expression as a form of cultural engagement.\n- Shallom Matthew\nShallom Matthew is a Nigerian musician and choral director best known as the founder and director of The City Choir, a dynamic musical collective that blends contemporary and traditional gospel music. Since its inception, the choir has grown rapidly and gained wide recognition for viral performances most notably their rendition of “Satan, The Number You Are Calling Is Not Available”, which has amassed millions of views online. Matthew’s leadership emphasizes discipline, community, and musical excellence, creating a space where musicians can learn, grow, and perform together. Through live appearances and digital releases, The City Choir under Matthew’s direction continues to bridge tradition and modernity in gospel music, inspiring audiences and reshaping how choral performances are experienced in Nigeria.\n- Dika Ofoma\nDika Ofoma is a filmmaker who has quietly built one of the most thoughtful bodies of work to emerge from Nigeria’s independent film scene in recent years. His films pay close attention to people; the things they say, the things they avoid, and the tensions that sit beneath everyday interactions. For Dika, storytelling begins with how a character’s life can be disturbed in the middle of the mundane, and much of his work lives in that tension between what looks normal and what is emotionally unstable underneath.\nWith films like Obi Is a Boy and God’s Wife, he has shown a consistent interest in how cultural expectations shape personal lives, especially for young Nigerian men. His work often feels observational, almost documentary-like in its honesty, allowing characters to exist without being forced into neat conclusions.\n- Ayo Lawal\nAyo Lawal serves as Editor at ThisDay Style, where he leads fashion and lifestyle coverage for one of Nigeria’s most established news brands. His editorial work touches on fashion direction, cultural influence and the evolving narrative around modern Nigerian identity. As part of a newsroom with deep historical roots in national media, Lawal represents a new editorial generation that balances tradition with fresh cultural curatorship, bringing relevance and nuance to style journalism.\n- Cosmas Ihenacho-Herbert\nCosmas Ihenacho-Herbert is an illustrator and visual storyteller whose work on Instagram showcases a distinctive blend of mythic, literary and personal themes. Through his illustrations, he builds worlds that reflect layered narratives, drawing from history, imagination and cultural motifs. Ihenacho-Herbert’s work signals how visual arts are being reshaped online: illustration is not just aesthetic but deeply narrative and reflective of broader conversations about identity, heritage and creative interpretation.\n- Amara Nwuneli\nAmara Nwuneli has made significant contributions in sustainability, climate action and youth-led development. As founder of Preserve Our Roots, she works at the nexus of environmental advocacy and community engagement, elevating climate justice in conversations that matter across policy, public education and grassroots action. Her work demonstrates how young Nigerians are not only participating in global dialogues on sustainability but shaping them from within local contexts, turning awareness into sustained impact.\n- Daniel Itegboje\nDaniel Itegboje, known on social media as shred_daniel, bridges fitness content with lifestyle engagement. His Instagram documents training routines, personal progress and wellness insights with a consistency that resonates with followers interested in intentional health practices. By foregrounding discipline and accessible fitness knowledge online, Itegboje contributes to a broader shift toward wellness not seen as performative, but practical and sustainable, a shift reflected in the growing online fitness culture.\n- Kaestrings\nKaestrings (Kingsley Owoicho‑Oche Innocent) is one of Nigeria’s most streamed and influential gospel artists, known for a sound that blends heartfelt worship with contemporary musicality. With nearly 400,000 followers on Instagram, his music consistently centres spiritual themes and personal testimony, drawing listeners into both devotion and reflection. In 2025 alone, Kaestrings released Desire (Live) and Do a Work in Me (Live), further solidifying his status in the gospel scene while his repertoire — including RAHAMA — continues to resonate widely online. Beyond performance, his public presence often speaks to mentorship, family and faith, situating him as both an artist and a community voice within Nigeria’s vibrant gospel tradition.\n- Miracle Nwankwo (Veefin founder)\nAt just 22 years old, Miracle Nwankwo has emerged as a formidable force in Africa’s fintech ecosystem. A Computer Information Systems graduate from Babcock University, he entered the tech space as a self‑taught developer and by 19 had launched BookClinic, a health‑tech platform that raised seed funding and marked his first significant entrepreneurial milestone. Building on that foundation, Miracle became CEO of Veefin Solutions Nigeria, the Nigerian arm of a global fintech company focused on digital lending, supply‑chain finance and embedded finance solutions for banks and enterprises. Under his leadership, Veefin Nigeria has been formally launched and is working to optimise credit delivery and financial infrastructure for local institutions, a rare achievement for someone of his age in a highly competitive industry.\n- Stanley Anigbogu\nStanley Anigbogu’s work sits at the intersection of community impact and creative action. Recognised as a Future Awards Africa winner in the Community Action category, his efforts highlight grassroots organisation and social investment, reflecting a commitment to projects that translate civic energy into tangible outcomes. His recognition among a cohort of changemakers underscores his role in mobilising networks and resources for community development.\n- Saheed Sunday (poet)\nSaheed Sunday is a poet whose verse has found life on social platforms and in spoken‑word spaces. His writing reflects introspection, cultural commentary and emotional candour, engaging populations tuned to the resurgence of poetry as both literary form and performance art. Sunday’s work often straddles digital and physical stages, bringing rhythmic sensibilities to questions of identity and belonging.\n- Ayobami Akindele\nAyobami Akindele is an actor and content creator whose presence online showcases versatility in performance, character work and sketch comedy. Through narrative visual storytelling on Instagram, he engages audience humour and relatable portrayals, contributing to a landscape where rising actors use digital platforms as both portfolio and audience incubator.\n- Damilola Hamid Balogun\nDamilola Hamid Balogun curates content that blends lifestyle, aesthetics and cultural storytelling. As the creative force behind YSDN Official, he documents fashion, personal narrative and visual identity with intentionality, reflecting broader trends among a generation of young creators who treat social platforms as cohesive visual portfolios. He work engages audiences with thoughtful curation and personal voice.\n- Konyinsola Ajayi\nKonyinsola Ajayi, known online as aj_spencer_100m, merges personal branding with fitness, lifestyle and motivational content. On Instagram, his posts highlight personal discipline, achievement benchmarks and wellness insights that appeal to audiences interested in self‑improvement, while his digital presence underscores a broader shift toward aspirational and instructional lifestyle documentation.\n- Rasheedat Ajibad\nRasheedat Ajibade is a professional footballer whose athletic achievements have made her one of Nigeria’s most recognisable women in sport. A member of both the Nigerian national team (Super Falcons) and club sides in competitive leagues abroad, Ajibade’s blend of speed, technique and tenacity have earned her domestic and international acclaim as part of a generation elevating African women’s football on the global stage.\n- Wande Thomas\nWande Thomas works as a creator whose content spans dance, lifestyle and cultural performance. His presence on platforms like Instagram highlights a blend of movement, expression and personal narrative that engages audiences interested in rhythm‑based storytelling and cultural hybridity.\n- Ikechukwu Nwosu\nIkechukwu Nwosu is a Nigerian digital media professional and storyteller working at the forefront of Africa’s online cultural landscape. After nearly a decade building audience and editorial impact at BellaNaija, he joined OkayAfrica — a leading digital media platform that connects global audiences to African music, film, art, style and culture — as Managing Editor. In this role, Nwosu helps shape editorial strategy, commissioning and storytelling that amplifies African voices and perspectives across lifestyle, entertainment and cultural reporting. His work sits at the intersection of content strategy and cultural commentary, reflecting a generation of media practitioners steering African narratives in global digital spaces rather than through traditional gatekeeping.\n- Aniko\nAniko is a multi‑disciplinary creator whose digital work spans visual art, design and conceptual storytelling. Through projects shared on Instagram, Aniko explores form, texture and narrative cohesion, building visual portfolios that speak to personal exploration and stylistic fluency. She is a part of a broader wave of digital artists building careers through intentional online curation.\n- Chidi Nwaogu\nChidi Nwaogu’s creative voice resonates across social platforms where he combines visual storytelling, fashion expression and cultural commentary. Frequently showcasing his work through high‑impact imagery and collaborations, Nwaogu engages with audiences who value aesthetic fluency and narrative identity. While much of his influence is defined by personal curation and digital portfolio building, his output reflects a broader movement among visual creatives who use Instagram as both canvas and resume.\n- Dezny (Destiny Ogie Osarewinda)\nDestiny Ogie Osarewinda, popularly known as Dezny, is recognised for her growing impact in Nigeria’s content creation ecosystem. She was listed among the nominees for The Future Awards Africa 2025 in the Content Creation category, a recognition that highlights her work alongside other influential creators in entertainment and digital engagement. Through short‑form content, visual storytelling and audience‑centric posts, Dezny has solidified her footprint as a creator capable of converting online moments into cultural relevance.\n- Taiwo Abisoye Joel\nTaiwo Abisoye Joel’s creative footprint extends into broader recognition within Africa’s young creative cohort: she was listed among nominees for The Future Awards Africa 2025 under Creativity and Innovation. This nomination places her among peers whose work pushes boundaries across artistic and cultural innovation. Her presence centers artistic imagination and idea exploration, offering audiences a blend of visual and conceptual storytelling.\n- Thompson Ekong\nThompson Ekong’s talent in photography earned him a spot among nominees for The Future Awards Africa 2025 in the Photography category, aligning him with accomplished visual artists shaping how moments are captured and interpreted. His Instagram portfolio reflects an eye for composition and lighting that situates everyday scenes within a larger visual conversation about identity, space and narrative.\n- Kieva Chris‑Amusan\nKieva Chris‑Amusan stands out for her work in Health and Wellness, having been nominated for The Future Awards Africa 2025 in this category. Her role as a health innovator engages pressing conversations around wellbeing, fitness and community health education, an area where lifestyle intersects with impact. Through professional insight and digital advocacy, she is part of a cohort redefining wellness engagement in Nigeria and across Africa.\n- Fatima Mohammed Habib\nFatima Mohammed Habib’s journey as a humanitarian began at age 14, when she founded the Advocacy for Human Value Foundation (AHVF)—a nonprofit dedicated to expanding access to education, healthcare, water and sanitation services for vulnerable communities across Nigeria. Over the last decade, her organisation has mobilised over 1,300 volunteers and impacted thousands of lives through scholarship programmes, partnerships and psychosocial support. She has actively campaigned against child sexual exploitation, gender‑based violence and illiteracy and was nominated for The Future Awards Africa Prize for Community Action 2025. Her work highlights the power of sustained grassroots advocacy powered by community‑first principles.\n- Samson Bakare\nSamson Bakare is a Lagos-based multidisciplinary artist whose work reimagines Black identity through bold visuals and symbolic storytelling. His style blends African aesthetics, classical form, and satire to explore the legacies of imperialism and racial hierarchy while celebrating Black dignity and agency.\nHe has exhibited internationally, including Counter History in Paris and Lagos and Occupied Space in Accra, and his works are collected globally. A member of the Arts in Medicine Fellowship, Nigeria, Bakare champions art as a force for reflection, dialogue, and social impact.\n- Nafisa Abdullahi Aminu\nSeventeen-year-old Nafisa Abdullahi Aminu from Yobe State made history in 2025 when she was crowned World’s Best in English Language Skills at the TeenEagle Global Finals in London. She outperformed more than 20,000 participants from 69 countries, including native English speakers, showcasing remarkable proficiency, critical thinking, and communication skills. Her victory earned national recognition and a cash award from the Federal Government, with officials praising her as a symbol of Nigerian academic excellence. Beyond the accolades, Nafisa has expressed her commitment to inspiring other young Nigerians to pursue knowledge, excellence, and opportunities on global stages, proving that age is no barrier to achieving international distinction.\n- Og Abbah (Mohammed Abubakar)\nOg Abbah is a Nigerian Afrobeat and Afropop singer‑songwriter from Northern Nigeria whose music blends traditional Hausa rhythms with contemporary sounds. He first gained major attention with his viral 2025 single “Wayyo Allah Na,” which propelled his name onto streaming platforms and social media. In the same year, he released other tracks including “Maganganu” and “Get Up,” and followed up with collaborations such as “Lalakukulala” featuring DJ Neptune and Flexbee — highlighting his emerging versatility in Afrobeat. Beyond music, Og Abbah was named a Brand Ambassador for the National Commission for Refugees, Migrants and Internally Displaced Persons (NCFRMI), where he leads campaigns aimed at youth empowerment and safe migration. His journey from displacement camps to mainstream recognition underscores his growing influence in both music and advocacy.\n- Imrana Alhaji Buba\nImrana Alhaji Buba is a Nigerian lawyer, public administrator and politician who has served in senior government positions, notably as Director‑General of the National Youth Service Corps (NYSC). A scholarship holder and alum of some of Nigeria’s top institutions, Buba has been vocal about youth inclusion in governance, education policy and national service reform. His career spans public service leadership roles and policy advocacy, where he focuses on enabling institutional reforms that affect Nigeria’s youth landscape.\n- Rukayya Khalid\nRukayya Khalid is the founder and Managing Director of Kano Taxi & Logistics Solutions, a transport startup that revolutionised mobility in Kano State by organising informal taxi operators into a structured, app‑powered fleet. Her work in Nigeria’s transport industry has helped formalise and modernise services for millions of commuters, while also creating pathways for female leadership in a traditionally male‑dominated sector. Beyond business operations, Khalid is recognised for her mentorship of young entrepreneurs and her contribution to improving urban mobility solutions in West Africa.\n- Abdulhaleem Ishaq Ringim\nAbdulhaleem Ishaq Ringim is a Nigerian public policy analyst, writer and governance advisor whose work spans strategic economic communication, policy research and government advisory. He currently serves as Special Assistant to the Governor of Kaduna State on Economic Matters and as State Coordinator for the African Union Development Agency (AUDA‑NEPAD) in Kaduna, where he supports the implementation of continental development frameworks. An award‑winning writer, Ringim’s commentary on politics, economics and public affairs has appeared in outlets including The Guardian, Daily Trust and TheCable. He has received numerous honours, including the JCI Ten Outstanding Young Persons of Nigeria Award and recognition among the 100 Most Influential Powers Behind The State (BTS 100), and was shortlisted for The Future Awards Africa Prize for Governance.\n- Yahuza Bawage\nYahuza Bawage is a journalist and senior reporter based in northeastern Nigeria whose work centres on solutions‑focused and development journalism. He writes for Social Voices and Prime Progress, where his bylines cover social accountability, gender issues, education, health and environmental change across underserved communities. Bawage’s reporting often highlights how local actors and civil society are addressing systemic challenges — from gender‑inclusive education reforms to community‑led healthcare improvements — helping shift narratives about Nigeria’s northern region toward agency and action. In 2025, his contributions were recognised with the Media Social Impact Journalist of the Year Award at the Arewa Stars Awards, underscoring his influence in elevating human‑centred storytelling and constructive reporting.\n- Blossom Afia\nBlossom Afia is a brand strategist, content marketer and creator whose work focuses on helping professionals and businesses grow their visibility on digital platforms especially LinkedIn. With over 46,000 followers on LinkedIn, she has scaled online communities through organic strategy, newsletters and creator‑led events, and in 2025 was named an Official LinkedIn Local Nigeria Ambassador, a role that connects digital creators with offline networking experiences across the country. Her newsletter, The Halo Effect, has amassed more than 15,000 subscribers, and she has supported hundreds of professionals and brands in enhancing their online presence.\n- Dolapo Lawal\nDolapo Lawal is the Senior Pastor and founder of Zoe Household Global, a vibrant international ministry with expressions in both Atlanta, USA and Lagos, Nigeria, focused on revealing Christian identity and empowering believers through teaching, worship and discipleship. Known for his clear, practical communication of the Word of God and his emphasis on personal growth in faith, Lawal transitioned from Islam to Christianity and has since become a recognised voice in gospel ministry and spiritual leadership. He is also a songwriter with worship tracks and releases that extend his ministry beyond the pulpit. In early 2026, Lawal was invited to minister at the World Faith Believers’ Convention (WOFBEC 2026) in Lagos, one of Africa’s most anticipated gospel events, where he joined an international lineup of pastors and ministers delivering powerful teachings of faith.\n- The Esiaga\nFavour “The Esiaga” Ifeanyi is a Nigerian cinematographer, editor and visual storyteller whose Instagram presence reflects a dedication to narrative through lens and frame. Known for his short films, cinematic reels and visually striking edits, he combines technical precision with engaging storytelling. Beyond posting content, The Esiaga leads The Esiaga Academy, where he teaches filmmaking and editing fundamentals to emerging creators, and runs The Esiaga Production, a creative outfit that brings visual ideas to life for brands and personal projects. His work underscores the growing power of narrative-driven content in Nigeria’s digital ecosystem, where skilled creators are elevating both entertainment and technical artistry.\n- Victoire\nVictoire Mahounou (@victoire_mahounou) is a Lagos-based lifestyle and brand content creator known for merging fashion, aesthetics and personal storytelling. She has cultivated a dedicated following through content that blends trend insights, visual storytelling and lifestyle commentary. Victoire’s approach balances aspirational imagery with relatability, allowing her to serve both as a creative influencer and a bridge for brands seeking authentic engagement with digital audiences.\n- Ama\nAma Udofa, known as @the_amazingama, is a Nigerian food content creator whose Instagram reels blend culinary artistry, culture and humour. His content ranges from street food favourites to home-cooked recipes, all presented with an approachable, entertaining style that resonates with a broad audience. Beyond social media, Ama has hosted communal dining experiences in Lagos and Ibadan, creating spaces for connection and shared culinary enjoyment. Through his posts and community engagement, Ama is helping to place Nigerian food storytelling at the center of digital culture.\n- Elyon Adede\nElyon Adede (@elexiay) is a fashion entrepreneur and content creator whose work merges style, business and digital storytelling. Beyond posting trend-driven looks and lifestyle content, she runs a fashion houses that showcases curated pieces aligned with her aesthetic vision. Elyon’s content reflects the entrepreneurial side of Nigeria’s creator economy, demonstrating how young creators are increasingly using their platforms not only for influence but to build businesses and tangible brands that resonate with audiences both online and offline.\n- Adedamola Odetara (Photographer)\nA Lagos-based photographer and visual storyteller, Odetara’s work moves between documentary, fashion and fine art, often centring culture, identity and everyday Nigerian life. His photographs have appeared in global publications including Vogue, Rolling Stone, GQ, i-D, CNN, Dazed and OkayAfrica, placing his lens firmly within international conversations about African visual culture. A member of the African Photojournalism Database and Indigenous Photograph, Odetara’s practice balances intimacy with intention, using photography not just to capture moments, but to question how stories are told and who gets to tell them.\n- Ogranya (Ogranya Jable Osai)\nWhere artistry meets intention, you find Ogranya; a Nigerian singer, songwriter and actor whose creative journey stretches from Port Harcourt to international stages. Blending R&B, soul, highlife and Afrofusion, he first gained attention as the first African artist to release a song every week for an entire year through his ambitious Project 52 initiative, a move that helped expand his audience and define his artistic discipline. In December 2024, Ogranya released his debut studio album With Open Arms, a cohesive collection praised for its lyrical depth and emotional resonance. Beyond music, he made his acting debut in the feature film Freedom Way (2024), which premiered at the Toronto International Film Festival and won at the Africa Magic Viewers’ Choice Awards, positioning him as a multidisciplinary voice in contemporary Nigerian culture.\n- Genoveva Umeh\nA British-Nigerian actress born in Enugu and raised between Nigeria and the UK, Genoveva trained in theatre before breaking into Nigerian film and television with roles in Love is War, One Lagos Night and Netflix’s Blood Sisters. Her performance in the Prime Video original Breath of Life earned her Best Supporting Actress at the 2024 AMVCA, and she continues to draw acclaim for emotionally grounded performances across screen and stage. Umeh’s craft reflects rigorous training and a breadth of roles that span genres and platforms, making her one of Nollywood’s most compelling leading talents.\n- Pelumi Olawuni (Abike Shugaa)\nPelumi Olawuni, better known as Abike Shugaa, is a multifaceted Nigerian entertainer whose reach spans TikTok, television and fashion content. She first gained broad attention as a social media personality and trend-driven content creator, known for her humour, style and engaging presence across platforms. Beyond comedy, Pelumi has appeared in Nollywood productions, hosted TV segments and leveraged her creative voice to advocate for young women and girls, combining entertainment with purposeful influence. Through relatable skits, fashion content and on-air personality work, she embodies the modern multimedia creator whose impact stretches far beyond any single platform.\n- Nonso David (Nonso Ojukwu)\nIn the world of fashion runways and global menswear, Nonso David (often credited as Nonso Ojukwu) is one of Nigeria’s brightest modeling exports. Represented by elite agencies including Premium Models (Paris), Elite Milan and 90s Model Management (Lagos), he has walked for luxury houses such as Prada, Louis Vuitton, Dior and Fendi — rare achievements for a Nigerian model of his generation. Recognised as a Hot Lister and featured in key international fashion showcases, Nonso’s ascent from Lagos to global fashion capitals reflects both his commanding presence and the increasing influence of African models on high fashion runways.\n- Ini Cash\nInioluwa Olu‑owotade, known widely as Ini Cash, is a Nigerian content creator, comedian and cultural voice whose engaging selfie-style videos have reached hundreds of millions of views across TikTok and Instagram. Growing up between Nigeria and New Jersey, Ini’s ability to translate everyday scenarios into humour — from family dynamics to social commentary — propelled his content into mass visibility in 2023, earning features from platforms like BuzzFeed and The Shade Room. He has collaborated with major music artists like Rema and Davido, and alongside Justin UG co-hosts the BroBants podcast, a male-led show blending humour with cultural conversation. Ini’s reach shows how digital comedy and authentic relatability can traverse borders and audiences.\n- Chef Tucker\nTucker Nmor, popularly known as Chef Tucker, is a Nigerian chef, entrepreneur, and founder of Grey & Crimson, a boutique pastry and dining brand in Lagos. His culinary journey began after an early stint in fashion design and a pivot to professional cooking, eventually leading him to build two distinct food businesses — one specialising in cakes and pastries and another focused on bespoke dining experiences for events. Among his standout creations is the Akara burger, an elevated take on a beloved Nigerian street food. Through social media and live experiences, Chef Tucker champions creative Nigerian cuisine while mentoring a new generation of food entrepreneurs in how to merge flavour with business innovation.\n- Wilson Onwuka\nWilson Onwuka is a Lagos‑based photographer and creative director whose work moves fluidly between fashion, portraiture, documentary and still life. A graduate of the University of Lagos, he first stepped into the creative world after trying modeling and discovering a passion for visual storytelling, one that quickly expanded into styling and directing looks as much as capturing them. His images have appeared in major fashion campaigns and lookbooks, including for brands like Rogue NG, where his lens helped bring runway and editorial visions to life with crisp composition and a keen sense of atmosphere.\nBeyond commissioned work, Wilson uses his camera to explore culture, light, and identity, sharing personal projects and reflections through his blog and social channels, where he champions natural light and authenticity in every frame.\n- Brain Okoli\nChristian “Brain” Okoli is a Nigerian media professional, finance educator and entrepreneur whose work spans investment insights, media strategy and community building. As COO of BlueAfric Media, he helps steer one of Southeast Nigeria’s leading advertising and communications agencies, while his personal platforms explore stocks, real estate, consumer goods and financial literacy for young Africans. Okoli’s content often connects practical investment perspectives with broader economic trends, making financial conversation accessible to audiences traditionally excluded from wealth education. Through his leadership roles and digital influence, he represents a generation using media to decode money matters for a new cohort of investors.\n- Victor Ehindero\nBeginning his journey in Ibadan, Nigeria, Victor Ehindero is the founder and CEO of PotTV, a Nigerian media platform that has grown beyond its origins on WhatsApp into a widely followed social media page delivering news, culture and entertainment content. He also runs React with Victor, where he reacts to trending movie clips and TV moments, combining commentary with humour. Recently, he expanded his entrepreneurial footprint by launching Potio Beauty, a skincare brand aimed at young Nigerians who value building confidence and authenticity. Through these ventures, Ehindero has carved a unique space at the intersection of digital media, content creation and consumer products, demonstrating how media-savvy entrepreneurship can evolve into a multi-platform brand.\n- Femi Dapson\nBehind some of the most talked‑about visuals in Nigerian music and media is Femi Dapson, a producer and co‑founder of Nouvelle Films, one of the country’s leading production houses shaping contemporary music videos and visual narratives. Dapson’s journey from grassroots hustle to producing standout visuals has seen him bring fresh concepts and high production values to the forefront of the industry, working with both local and international creatives to raise the bar on what Nigerian production can look like.\n- Nimi Adegbite\nWhen tech education meets entrepreneurship, you find Nimi Adegbite. As the Founder and CEO of Cirvee, an edtech platform focused on empowering young Africans with digital skills, Adegbite has positioned himself at the intersection of creativity, technology and learning. His leadership at Cirvee has helped hundreds — and in some reports, thousands — of young Nigerians gain real‑world tech skills, while his events like Tech Cirvee Fest have drawn thousands of enthusiasts for immersive experiences blending tech, culture and opportunity.\n- Babs Cardini\nMagic isn’t just a spectacle for Babs Cardini, it’s his language. Born Babatunde Kasumu Tinubu and raised in Lagos, Cardini has become one of Africa’s most talked-about magicians, creating illusions that have left audiences and even Nigerian music stars in awe. Known for performances that blur the lines between sleight of hand and impossible spectacle, he has built a substantial audience on social media and performed live for major celebrities. Cardini’s work illustrates how traditional performance art can be reinvented for digital audiences and modern stages alike.\n- Solomon Ayodele\nTechnology meets advocacy in Solomon Ayodele’s work. A Nigerian tech executive, Ayodele is the Head of Product and Technology Innovation at Wema Bank and ALAT by Wema, where he leads digital transformation and product initiatives in one of Nigeria’s most forward‑leaning financial institutions. Beyond banking tech, he is the founder of Boys Quarters Africa, an advocacy movement focused on education, mentorship and empowerment for boys and young men. Ayodele’s contributions have been recognised with multiple awards at The Future Awards Africa 2025 for Activism, Advocacy and Intrapreneurship, highlighting his impact both within the tech sector and in broader social innovation.\n- Felix Inala\nFelix Inala is a Nigerian‑born fashion entrepreneur reshaping how African elegance is seen on the global stage. After moving to London interesting 2021, he turned his passion for style and community into The Anko Shop, a women’s wear brand that celebrates confidence, identity, and timeless sophistication through clean lines, refined silhouettes, and culturally resonant design. Anko is built on Felix’s belief that fashion can foster belonging and self‑assurance, especially for people navigating life between cultures. The brand challenges narrow definitions of African fashion, proving it can be both luxurious and deeply rooted in heritage. Under Felix’s leadership, The Anko Shop has grown into a vibrant, London‑based label with a global footprint, known for pieces that feel personal, purposeful, and poised.\n- Daniel Adaaja (RadPodConsult)\nA voice in Nigeria’s media landscape with roots in storytelling and broadcast, Daniel Adaaja — known online as danpowertouch — has carved out a reputation as a broadcast journalist, podcaster, host and media consultant. As Creative Lead at RadPodConsult, he works at the intersection of audio content strategy, production and voice media, helping shape how podcasts and radio talk are produced and consumed in Nigeria. Beyond his consultancy role, Daniel is known for Radio Room, his broadcast‑focused platform that centres conversations around media innovation, storytelling craft and industry development. In 2025 he was recognised as one of the 30 Most Influential Male Voices on Radio by Radiocast Nigeria, an acknowledgment that reflects his contribution to elevating broadcast standards and mentoring emerging audio talent.\n- Alma Asinobi\nFor those who see the world as a classroom, Alma Asinobi’s journey is both adventurous and intentional. A travel entrepreneur, content creator and storyteller, she made global news in 2025 by visiting all seven continents in 71 hours, a solo effort that sparked conversations about passport inequality and visa challenges faced by African travellers. Though visa hurdles prevented her from breaking the official record, her #AlmaChasingContinents campaign drew attention to travel accessibility while showcasing resilience and curiosity in equal measure. A graduate of architecture, Alma also works as a marketing copywriter and content strategist, using her platforms to promote travel narratives that celebrate cultural diversity and global citizenship.\n- Sodiq Ismail (Super Eagles)\nEmerging from the Nigerian Professional Football League, Sodiq Ismail has risen from local standout to full‑international recognition as one of the Super Eagles’ most exciting home‑grown talents. The right back made headlines in 2024 after earning his maiden call‑up to the Super Eagles squad for the 2026 FIFA World Cup qualifiers under coach Finidi George, following strong performances for Remo Stars in the NPFL. Noted for his creative attacking instincts and ability to contribute assists from wide defensive positions, Ismail has drawn comparisons with dynamic fullbacks in world football while also earning respect for his technical growth and leadership on the pitch.\n- Precious Enobohien\nPrecious Enobohien is a Nigerian lifestyle content creator whose Instagram presence blends personal narrative, fashion, culture and daily life observation. Through her visuals and storytelling, she builds engagement around lifestyle aesthetics, travel moments and style documentation that resonates with audiences drawn to contemporary, relatable content. Her creative output reflects the broader shift in how lifestyle influencers frame their digital portfolios not just as personal diaries, but as curated narratives that connect culture, identity and community.\n- Umearigolu Casmir Chukwuebuka\nCreativity with reach and resonance defines Umearigolu Casmir Chukwuebuka, known online as @ianumeh. With a following north of 200,000 on Instagram, he stands out as a multidisciplinary creative whose work spans visual art, design, conceptual storytelling and expressive digital original content. His feed reflects a blend of fashion‑inspired visuals, mood‑driven photography and creative performance, marking him as a visual presence whose workscapes engage audiences across lifestyle, aesthetic curiosity and digital culture.\n- Abigael Anaza‑Mark\nWhen education and equity intersect, Abigael Anaza‑Mark steps forward. Abigael is an educational and gender‑equality professional who works at the intersection of technology, learning innovation and girls’ empowerment. She is known for her work with Co‑Creation Hub as a programmes associate where she supports edtech solutions that improve learning outcomes, and she has served as an education ambassador with global initiatives like HundrED and Theirworld. Her career has been shaped by a commitment to narrowing gender gaps in STEM and championing accessible quality education for young learners across Nigeria and beyond.\n- Emmanuel Onwuka\nAcross Nigeria’s airwaves and digital feeds, Emmanuel Onwuka’s voice has become synonymous with thoughtful cultural storytelling. A veteran broadcaster with Nigeria Info FM and earlier stints at Cool FM and Wazobia FM, Onwuka hosts shows like Digital Life and Travel and Culture, blending media with cultural insight and tourism advocacy. His work has earned him multiple recognitions including a nomination for The Future Awards Africa Prize for Journalism in 2026, underscoring his impact as a media professional who amplifies African narratives and drives youth engagement through storytelling.\n- Hammed Kayode Alabi\nHammed Kayode Alabi’s trajectory has been defined by a blend of innovation, youth empowerment and civic engagement. As founder of the KLCI Initiative, he champions leadership development and community action programs that equip young Nigerians with tools to lead and innovate. A sought‑after speaker on leadership and motivation, Alabi has also taken his voice to platforms like TEDx, where he shares insights on purpose, potential and community impact. His work earned him recognition at the 19th Future Awards Africa, where he was a Prize for Community Action winner, marking him as one of the nation’s impactful youth leaders.\n- Kemi Olakunle\nKemi Olakunle’s influence sits where health care meets innovation. Best known as the founder of HealthVest NG (formerly Health4Moni), she leads a health technology venture that bridges gaps between patients and quality medical services while enhancing healthcare accessibility via digital solutions. Recognised at The Future Awards Africa in 2025 as a nominee in the Health and Wellness category, Olakunle’s work highlights how purpose‑driven entrepreneurship can transform everyday health experiences for Nigerians, particularly in underserved communities.\n- Ayobola Kekere‑Ekun\nA widely respected contemporary visual artist, Ayobola’s acclaimed practice centres on paper quilling; painstakingly arranging coloured strips into textured, intricate compositions that explore femininity, identity and cultural narratives. Educated at the University of Lagos and the University of Johannesburg, her work has been exhibited internationally and earned prestigious honours including the Absa L’Atelier Award (2021) and The Future Awards Africa Prize for Creativity in 2018, marking her as one of Nigeria’s standout voices in contemporary art.\n- Artmosfair\nArtmosfair has emerged as a distinctive voice in Nigeria’s creative comedy and film landscape. Known online as the_artmosfair_, he makes humorous skits that often play on everyday absurdities and cultural quirks. Beyond skits, he is also involved in film production, working behind the scenes to expand how stories and laughter are crafted and delivered across screens. His cross‑disciplinary creative work continues to underline how comedy and film can intersect to expand narrative possibility.\n- Hauwa Shaffii Nuhu\nWhen media becomes a platform for truth, Hauwa Shaffii Nuhu is often near the story. A journalist and co‑founder of HumAngle Media, Nuhu champions solutions‑oriented reporting that highlights conflict, resilience and community voices across Nigeria and the Sahel region. Her professional background spans rigorous field reporting, editorial leadership and a commitment to elevating marginalised perspectives in public discourse. Nuhu was also recognised in the 2025 Future Awards Africa list under Literature, affirming her role in shaping narratives that deepen understanding of complex social issues.\n- Aisha Hamman\nFew blend legal advocacy with grassroots impact like Aisha Hamman. A Nigerian lawyer and human rights advocate, she is the founder and executive director of the Lift Africa Foundation, a civil society organisation advancing justice reform, gender equality and governance accountability. She also serves as managing partner at Hamman Attorneys, a law firm focused on corporate and human rights work. Hamman’s initiatives — including legal aid for survivors of gender‑based violence and civic empowerment programs like Justice Shield and ClearHerPath — have reached thousands across Nigeria. Her leadership was also recognised with a Future Awards Africa nomination in advocacy and activism.\n- Christiana Onoja\nTech ecosystems need translators and Christiana Onoja is one of the most compelling ones on the continent. A technology consultant, engineer and advocate for women in STEM, she co‑founded Jeme Technologies, a Lagos‑based software and IT services company addressing digital challenges across sectors including telecoms, finance and FMCG. She is also the Founder and Executive Director of the Partnership for African Women Advancement (PAWA) Initiative, a nonprofit on a mission to empower millions of African women and girls through digital literacy, mentorship and capacity building in science, technology, engineering and math. In 2025, Christiana was recognised as a UNIDIR Women in AI Fellow and a Mandela Washington Fellow, underscoring her influence in AI, inclusive tech policy and digital transformation positioning her as a leading voice for equity and innovation in Africa’s tech future.\n- Tomi Ojo\nAppearing on screen with presence and nuance, Tomi Ojo has steadily built her reputation as a rising Nollywood actress. With a growing portfolio of roles that showcase her versatility and charisma, she represents a new generation of screen talents driving the industry’s evolution in character depth and performance range. Her performances resonate with audiences across narratives that span drama, romance and contemporary storytelling, making her one of the faces consistently appearing in conversations around Nollywood’s next wave of stars.\n- Olaoluwa Slawn\nCreativity’s many layers are visible in Olaoluwa Slawn’s work, where visual art and culture converge. A multidisciplinary artist and creator, Slawn uses his platform to explore identity, aesthetics and emotional resonance through visual compositions that speak to both introspection and cultural texture. His portfolio reflects contemporary artistic experimentation that draws communities in while inviting them to see beyond the obvious marking him as a visual voice attuned to narrative as much as form.\n- Raheem Okoya\nRaheem Okoya, better known on stage as Siraheem, is a Nigerian singer and rising voice in the Afrobeat scene who has been drawing attention for more than just his family background. As one of the sons of billionaire industrialist Chief Razaq Akanni Okoya, founder of the Eleganza Group, Raheem could have coasted on inherited prestige, but from the start he has been clear that he wants to earn his name on his own terms. In interviews he’s repeatedly stressed that “every penny in my account is from my sweat,” explaining that his focus is on building a music career grounded in hard work and creative expression rather than privilege.\nHis catalogue, including tracks like Bad B**ch Syndrome, Credit Alert and others, has sparked conversation online, earning both praise from industry heavyweights like Davido and critique from listeners and commentators. Whether responding to mixed reviews or navigating public scrutiny over a viral video incident, Raheem continues to position himself as a young artist determined to define his own legacy in Nigeria’s entertainment landscape.\n- Emeka Amafor (Bedge Pictures)\nStorytelling in motion finds one of its advocates in Emeka Amafor, the creative mind behind Bedge Pictures. With a flair for visuVal narrative that spans short films, branded content and cinematic sketches, Amafor has built a reputation for blending strong aesthetic sense with social insight. His work navigates themes that oscillate between culture, identity and everyday humanity, offering audiences both compelling visuals.\n- Adedayo Agarau\nPoetry in the 21st century is both intimate and public and Adedayo Agarau stands at that threshold. A poet and writer, Agarau’s work gravitates towards explorations of self, society and the intersections that bind them. He was recognised with the Future Awards Africa Prize for Literature in 2025, a testament to his capacity to push poetic form into conversation with urgent cultural and personal narratives. His writing reflects both depth and a quiet insistence that poetry remains a vessel for truth, memory and connection.\n- Tami Build\nTami Build is a Nigerian builder, content creator, and commentator whose name has become synonymous with practical insights into housing, construction and real‑world project planning. Based in Lagos, he uses his Instagram platform to break down what it actually costs to build quality homes in Nigeria and to challenge the guesswork that surrounds property development in the country. Rather than abstract talk, Tami takes viewers through real numbers, realistic timelines and no‑nonsense advice, making construction less intimidating for young professionals and aspiring homeowners. His approach blends hands‑on experience with clear communication, helping his audience see that good building practices shouldn’t come at the expense of clarity or value.\n- Deji Osikoya\nDeji Osikoya’s career has unfolded largely behind the scenes, but its impact is easy to trace. With experience spanning music, technology, and strategic communications, Osikoya has worked at key intersections of Nigeria’s creative and commercial ecosystems. As the former Public Relations Lead at Chocolate City Music, he helped shape campaigns and narratives for artists including M.I. Abaga, CKay, Blaqbonez, and the Kuti brothers. Beyond music, he has led communications for global tech platform InEvent, contributing to its growing international visibility. His work as a voice-over artist further expands a portfolio rooted in clarity, storytelling, and cultural fluency. Osikoya represents a class of operators whose influence lies in structure, strategy, and sustained relevance.\n- Boluwatife Balogun (Champz)\nChampz is the 14-year-old song of Afrobeat legend, Wizkid. He first went viral with a snippet of his song while in the studio, which he quickly followed up with his album “Champions Arrival.” His EP did numbers in the Nigerian charts, and he now holds the title of the ‘Youngest Nigerian Artist’ to hit 1 on the Apple Music Nigeria Charts. He also reached the milestone of becoming the youngest Nigerian artist to reach 1 million monthly listeners on Spotify, making him one of the major breakout names in music in 2025.\n- Osaremen Ukanigbe Mavin (Mavo)\nOne young breakout star who dominated the music scene in 2025 is ‘Mavo,’ the Escaladizzy singer, who has been enjoying an exceptional run since his breakthrough. While the 21-year-old’s career started when he was in his teens, he first caught attention from his fanbase when he released his bold debut EP titled “Ukanigbe”, with an amazing array of songs, and quickly followed up with another project titled “Sanko”, which propelled him to a different audience and showed his range as an artiste, a range he has maintained since.\n- Sharon–Rose Similoluwa Banjo-Ogunleye (Fimi With The Flow)\nSharon-Rose Similoluwa Banjo-Ogunleye (Fimi With The Flow) is a singer and rapper who became a viral sensation on the internet for her aesthetics and rapping style. Based in Lagos, she first gained social media attention when she posted a clip of her viral song “Halo,” which went viral, and thereafter, her stylish choice of the native Yoruba attire “Oleku” made her a popular figure in women’s fashion. Fimi has continued to take her listeners through several dimensions with her rapping and performances.\n- Fatimah Binta Gimsay\nFatimah Binta Gimsay (FBG) is a screenwriter, writer, and producer who received her big break in 2025 while working on ‘Red Circle,’ a movie that did numbers in cinemas. She quickly followed up with her YouTube short film, ‘Laraba & Balarabe,’ which attained 500k views within two weeks of its release. She also worked on a young Adult movie that did well on YouTube, which placed her on the list of writers and directors to watch.\n- Anthony Azekwoh\nAnthony Azekwoh is a digital artist who went viral on X for his wedding-themed art pieces, which he claimed were based on a real event. While Anthony began posting art pieces from the collection on Twitter, each post gaining traction and drawing people hoping to learn the story behind them, Anthony Azekwoh went on to host an art exhibition to showcase the physical pieces of the collection. He is one of the most notable Nigerian artists in 2025.\n- Uzo Njoku\nUzo Njoku (Uzoart) is a Nigerian American painter, pattern maker, and businesswoman who first gained virality on X (formerly known as Twitter) for her controversial post on the price of rent in Lagos, which eventually turned the tides towards her “Owambe” themed art exhibition, which sold out in Lagos and made her a household name for art enthusiasts.\n- Omoloto Opeifa (Omoloto)\nOmoloto Opeifa (Omoloto) is a 21-year-old Gen Z model and beauty content creator with thousands of followers across Twitter, Instagram, and TikTok. She is also currently studying medicine at the University of Lagos. Omoloto first began creating content years ago but gained viral fame in 2025 after being bullied on Twitter for her alté aesthetic. The bullying had the opposite effect of what her bullies expected: it shot her to model status and put her on the radar for brands like Regirl, Melira, and others to make her their model. Omoloto has also appeared in music videos for artists such as Ayra and Ckay.\n- Mukoro Mitchell (King Mitchy)\nMukoro Mitchell (King Mitchell) is one of the most influential creators on Instagram with over a million followers. She gained viral fame in 2025 by creating content to connect with average Nigerians and platforming people who need help, using her platform to change the lives of Nigerians. Her content took off heavily towards the end of 2025 and has remained consistent, with Don Jazzy featuring in one of her videos.\n- Seyi Fatai\nSeyi Fatai is a digital content creator, an artist and a fashion designer. He calls himself a ‘fabric addict’ who always creates clothes from the most unexpected fabric pieces he can lay his hands on. Seyi established his brand in 2020 and has grown a community on social media with his down-to-earth personality, clothes, and personality. The content creator has 87k followers on Instagram, a community that sticks with him and encourages his artistic designs while he shares content that almost anyone who sews can relate to.\n- Teniola Aladese\nTeniola Aladese has a career spanning over 10 years, but towards the end of 2024 and into 2025, her career and fame skyrocketed with her appearances in ‘To Kill A Monkey’ and ‘Freedom Way.’ She has also grown a TikTok following with her big personality, making her a fan favorite and elevating her status. While this is not Teniola’s first year, 2025 was a huge year for the actress and producer.\n- Folarin Odunlami (Fola)\nFolarin Odunlami (Fola) is a Nigerian musician with music that leans heavily into R&B and soul. He is also an afrobeat artist who leans heavily into clean productions, making him a fan favorite. Fola garnered over 3.3 million followers on Spotify in 2025, with most of his songs reaching millions of streams. The artist is also well discussed on social media because of what is termed his “Star Personality,” with many calling him the new big thing in the music industry.\n- Ayomaff\nAyorinde Mafoluku (Ayomaff) is currently known as the face of Gen Z street pop music. He is a viral sensation on TikTok among young people, who have contributed to the singer’s consistent virality, which was more prominent in 2025. His music centers on themes of hustling, heartbreak, and pursuing a successful life. It can be said that Ayomaff is the one new-age artist with the potential to walk the path paved by artists like Olamide and Burna Boy, especially in street music, which is streamed even by people who do not generally listen to it. With millions of listeners on Spotify and millions of streams on his most popular songs, Ayo Maff is one of the new age artists to look out for in this generation, and one of the most exciting breakout stars in this decade.\n- Shodade Solomon Segun (Shoday)\nShodade Solomon Segun (Shoday) could be easily described as one of the new-age street afrobeat artists, who has consistently been lauded for his storytelling through his music in this generation of musicians. The singer first gained attention when he was featured in the song “Hey Jago” with Poco Lee and Rahman Jago. The song’s popularity propelled him into the limelight, and he quickly took advantage of his newfound audience by releasing more songs that pushed him further into the mainstream media. 2025 was a great year for Shoday, as he broke out and maintained his status as a successful singer to look forward to in this decade. With over 1.6 million listeners on Spotify, Shoday is on the path to success as a street artist.\n- Habeeb Hamzat Adelaja (Peller)\nHabeeb Hamzat (Peller), a former carpenter, became Africa’s most successful streamer in 2025, reaching 10+ million TikTok followers. He solidified his dominance by hosting legendary artists like Davido, Tiwa Savage, and Olamide on his TikTok Live sessions, one of which set an African record with over 389,000 concurrent viewers. His massive earnings, reportedly up to ₦20 million per week, and his 2025 “Force of Virality” win at the Trendupp Awards underscored his status as a financial powerhouse in the creator economy.\n- Amadou Elizabeth Aminata (Jarvis)\nJarvis (real name Amadou Elizabeth Aminata), widely known for her unique “AI girl” persona, achieved major fame in 2025 as the leading robotic content creator in Africa. Her fame peaked through her collaboration and romantic engagement with Peller, which became a central topic of social media discourse. Beyond their joint success, she gained international recognition, reportedly being paid ₦40 million for a content creation tour in Sierra Leone.\n- Adeife Adeoye\nAdeife Adeoye is a Nigerian creative entrepreneur and digital strategist recognized for her efforts to empower African women in the digital and remote work sectors. As of January 2026, she had cultivated an online following exceeding 700,000 across multiple social media platforms.",
  "word_count": 9497,
  "scraped_at": "2026-02-14T12:38:37.121872"
}