{
  "article_id": "4bc72d8c76b6",
  "url": "https://www.sbs.com.au/news/article/pwcs-consulting-arm-and-other-businesses-you-can-buy-for-round-1/8wqptojbh",
  "title": "PwC plans to sell part of its business for $1 . Here why it not that unusual",
  "date": "20230626T041500Z",
  "domain": "sbs.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Key Points\n- PwC Australia is selling its government consultancy business for $1.\n- Labor Senator Deborah O'Neill said it's an attempt to \"phoenix\" the company.\n- Football and Formula 1 teams have also been sold for $1 in the past.\nEmbattled consulting firm PwC Australia is offloading its money-making government consultancy business for $1 after a tax scandal involving government contracts was uncovered.\nThe nominal sale amount to Allegro Funds has been labelled by Labor senator Deborah O'Neill as a dubious attempt to \"phoenix\" the company and shift all of its problems over to new owners.\n\"The whole amount is just mind-boggling itself, $1 for a business of this scale,\" she told ABC radio on Monday.\n\"(They have been) very resistant responses to any of those public inquiries, and yet we have this unseemly haste with a profit-driven motive to try and phoenix itself back into some sort of connection with the government.\"\nActing PwC chief executive Kirstin Stubbins has apologised for the leaking of confidential government information and said no one involved in the leaks will be allowed to work for a new spinoff company.\n\"We started to look at the ring fencing of this business to address the perceived conflicts, but after careful consideration of that (...) we decided that did not go far enough. We made the difficult decision to divest our government business completely,\" she told a NSW parliamentary inquiry.\nIt's not the only large business that has sold for $1, in what is known as 'peppercorn payments'.\nPeppercorn payments are a legal term for very small payments, usually cash, used to cover the requirements of a legal contract.\nThe Australian Securities and Investments Commission (ASIC) warns against when these sales break the law - known as 'illegal phoenix activity'.\nASIC describes illegal phoenixes as \"when a new company, for little or no value, continues the business of an existing company that has been liquidated or otherwise abandoned to avoid paying outstanding debts, which can include taxes, creditors and employee entitlements.\"\nWith no suggestion that any of these sales have been illegal phoenix activity, we look back on some memorable $1 company sales.\nMersey Hospital, Tasmania\nIn 2007, the Commonwealth, represented by then health minister Tony Abbott, bought the struggling Mersey hospital from the Tasmanian government for $1.\nThe sale meant the hospital in Devonport became the only federally funded hospital in the country.\nBut the unusual deal came undone 10 years later, when a subsequent Liberal government led by Malcolm Turnbull returned the hospital to state responsibility, and committed $730 million in funding over a decade.\nStuff NZ\nNew Zealand's largest media publisher Stuff sold for NZ$1($0.92) in 2020, to its chief executive Sinead Boucher, ending long-standing attempts from competitors to lodge takeovers.\nStuff is a publishing group made up of dozens of metropolitan and regional newspapers, and one of its most notable products is stuff.co.nz - an aggregator of news from those papers and additional digital content.\nMs Boucher bought it from Australian parent company Nine. At the time, Stuff was experiencing major uncertainty and diving advertising revenues at the start of the COVID-19 pandemic.\nSince the sale, the company has been stable and has moved significantly away from Facebook publishing and introduced paywalls for three of its papers in an effort to bring in more revenue.\nChelsea Football Club\nLondon's Chelsea Football Club recently sold for a reported £4.25 billion ($8.1 billion) to American Todd Boehly and a consortium of investors.\nRussian businessman Roman Abramovich, who poured his own money into the club, turning it into European champions and an English Premier League powerhouse, was forced to sell Chelsea by the UK government, due to his associations with Russian President Vladimir Putin.\nBut back in 1982, it was on the brink of going bust and was traded for just £1 ($1.91) to UK businessman Ken Bates.\nHis first order of business was resolving a real estate dispute with property developers who tried to evict the club from its stadium, and he grew the business to the value of £140 million ($266.7 million) - the sum Mr Abramovich paid in 2003.\nLotus Formula 1 (Renault)\nAlso on the list of businesses that have been up for just £1 ($1.91) is a Formula 1 team.\nIn 2015 Lotus' Formula 1 team was badly struggling and was snapped up by French car giants Renault for the nominal sum.\nRenault increased the team's revenue and within a year it was reportedly breaking even.\nAustralian Daniel Ricciardo was one of the team's drivers between 2009 and 2020 before moving to McLaren and later Red Bull Racing.",
  "word_count": 769,
  "scraped_at": "2026-02-14T12:45:32.048020"
}