{
  "article_id": "4bdb5dc43117",
  "url": "https://www.jagranjosh.com/general-knowledge/today-in-history-17-september-what-happened-on-this-day-1694883854-1",
  "title": "Today in History , 17 September : What Happened on this Day",
  "date": "20230917T110000Z",
  "domain": "jagranjosh.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "September 17 is the 260th day of the year in the Gregorian calendar; 105 days remain until the end of the year. Numerous remarkable occurrences, both big and small, have shaped our world today. From historical milestones and scientific discoveries to cultural moments and notable birthdays, this day has a rich tapestry of stories to uncover.\nALSO READ| Today in History, 16 September: What Happened on this Day\nOn This Day In History- Events\nEmperor Frederick I Barbarossa Elevates Austria to a Duchy\n1156\nIn the year 1156, Emperor Frederick I Barbarossa issued the 'Privilegium Minus' decree, a pivotal proclamation that bestowed the elevated status of a duchy upon Austria.\nByzantine Empire's Last Attempt to Reclaim Anatolia from Seljuk Turks\n1176\nIn the year 1176, the Battle of Myriokephalon marked the final endeavour by the Byzantine Empire to recapture central Anatolia from the Seljuk Turks, ultimately signifying the end of their territorial ambitions.\nCommencement of the Invasion of Canada in the American Revolutionary War\n1775\nOn this day in 1775, the American Revolutionary War commenced with the Siege of Fort St. Jean, marking the beginning of the invasion of Canada as part of the broader conflict.\nSigning of the United States Constitution\n1787\nOn this significant day in 1787, the United States Constitution was formally signed in Philadelphia, a foundational moment in American history that established the nation's fundamental principles.\nWilliam Herschel's Observation of Saturn's Satellite, Mimas\n1789\nIn the year 1789, the distinguished astronomer William Herschel made a historic discovery when he observed Mimas, one of Saturn's satellites, expanding our understanding of the celestial bodies within our solar system.\nConclusion of Peace Between Sweden and Russia in the Finnish War\n1809\nIn 1809, the Finnish War culminated in a peace agreement between Sweden and Russia, marked by the Treaty of Fredrikshamn, which ceded the territory that would eventually become Finland to the Russian Empire.\nHarriet Tubman's Escape from Slavery\n1849\nIn the year 1849, the remarkable Harriet Tubman took her first courageous steps to escape slavery in Maryland, accompanied by her two brothers, marking the beginning of her extraordinary journey to freedom.\nProclamation of Joshua Abraham Norton as Emperor Norton I of the United States\n1859\nOn this remarkable day in 1859, Joshua Abraham Norton, a resident of San Francisco, boldly proclaimed himself Emperor Norton I, reigning as the Emperor of the United States of America, a notable event in the city's history.\nThe Allegheny Arsenal Explosion during the American Civil War\n1862\nAmid the American Civil War in 1862, the Allegheny Arsenal explosion occurred, marking the most devastating civilian disaster of the war, a tragic incident that left a lasting impact.\nFilipino Victory over American Forces in the Philippine–American War\n1900\nIn 1900, during the Philippine–American War, Filipino forces led by Juan Cailles achieved a significant victory by defeating American forces under the command of Colonel Benjamin F. Cheatham Jr. at Mabitac.\nBattle of Blood River Port: Boer Victory over British Forces\n1901\nIn 1901, the Battle of Blood River Port witnessed the triumph of Boer commandos, led by Louis Botha, as they defeated a British Mounted Infantry force commanded by Major Hubert Gough, marking a pivotal moment in the conflict.\nThe First Airplane Fatality in the Wright Flyer Crash\n1908\nIn 1908, tragedy struck as the Wright Flyer, piloted by Orville Wright with Lieutenant Thomas Selfridge as a passenger, crashed, resulting in the unfortunate demise of Selfridge, who became the first fatality in aviation history.\nThe Red Baron's First Aerial Victory in WWI\n1916\nAmid World War I in 1916, the renowned WWI flying ace, The Red Baron of the German Luftstreitkräfte, secured his first aerial combat victory near Cambrai, France, marking the beginning of his legendary career.\nCommencement of the Soviet Invasion of Poland in World War II\n1939\nThe year 1939 marked a pivotal moment in World War II when the Soviet Union initiated its invasion of Poland, setting the stage for significant developments in the global conflict.\nAllied Attack on German Forces in the Battle of San Marino\n1944\nIn 1944, during World War II, Allied forces launched a determined attack against German forces in the Battle of San Marino, representing a crucial engagement in the ongoing war effort.\nThe Integration of Hyderabad State into the Indian Union\n1948\nIn 1948, the Nizam of Hyderabad relinquished his sovereignty over Hyderabad State, formally joining the Indian Union, a momentous event in the political integration of India.\nInauguration of the World's First Retractable Roof Stadium\n1961\nOn this day in 1961, the Civic Arena in Pittsburgh, Pennsylvania, made history by becoming the world's first retractable roof stadium, marking a significant advancement in sports infrastructure.\nThe Battle of Chawinda between Pakistan and India\n1965\nIn 1965, the Battle of Chawinda unfolded as a fierce confrontation between Pakistan and India, representing a critical moment in the ongoing regional conflict.\nVanessa Williams' Historic Achievement as the First Black Miss America\n1983\nIn 1983, Vanessa Williams achieved a historic milestone by becoming the first black Miss America, a momentous occasion that resonated with the nation and symbolized progress in the realm of beauty pageants.\nFour Peaked Mountain's First Eruption in Millennia\n2006\nIn 2006, Fourpeaked Mountain in Alaska erupted for the first time in at least 10,000 years, marking a rare and significant geological event that captured the attention of scientists and enthusiasts alike.\nToday In History - Sports\nEddie Collins' Debut as \"Sullivan\" at Columbia University Jr.\n1906\nIn the year 1906, the talented junior at Columbia University, Eddie Collins, made his debut under the alias \"Sullivan\" with the A's, marking the beginning of a distinguished baseball career.\nCasey Stengel's Debut and Four Singles\n1912\nIn 1912, the prominent centre fielder Casey Stengel made his debut with the Brooklyn team, showcasing his exceptional skills by hitting an impressive four singles.\nHonus Wagner's Retirement and Number Retirement\n1917\nIn 1917, the legendary Honus Wagner, at the age of 43, retired from the sport of baseball, prompting the Pittsburgh Pirates to retire his iconic number, 33, in honour of his illustrious career.\nFounding of the National Football League\n1920\nThe year 1920 marked a historic moment in sports history as the National Football League was established, initially known as the American Professional Football Association, with its inception in Canton, Ohio.\nJackie Robinson's Rookie of the Year Title\n1947\nIn 1947, the trailblazing Jackie Robinson earned the prestigious title of Rookie of the Year from Sporting News, solidifying his legacy as a groundbreaking figure in the world of baseball.\nErnie Banks Becomes Chicago Cubs' First Black Player\n1953\nIn 1953, Ernie Banks made history by becoming the first black player for the Chicago Cubs, a momentous step forward in the integration of baseball.\nGaylord Perry's No-Hit Game\n1968\nIn 1968, the San Francisco Giants' ace Gaylord Perry achieved a remarkable feat by pitching a no-hitter against the St. Louis Cardinals, securing a 1-0 victory in a memorable game.\nBaseball Record: George Brett's Exceptional Season\n1979\nIn 1979, George Brett of the Royals became only the sixth player in baseball history to amass 20 doubles, triples, and home runs in a single season, a testament to his exceptional skills.\nFernando Valenzuela's NL Rookie Record\n1981\nIn 1981, Fernando Valenzuela set an impressive National League rookie record by securing his eighth shutout of the season, highlighting his exceptional pitching prowess.\nBaseball Record: Dwight Gooden's Striking Achievement\n1984\nIn 1984, Dwight Gooden achieved a remarkable feat by tying the record for 32 strikeouts in consecutive games, showcasing his exceptional talent on the baseball mound.\nOn This Day - TV, Music, And Films\nFirst LP Record Released: Beethoven's Fifth Symphony\n1934\nIn 1934, RCA Victor made history by releasing the world's first 33 1/3 rpm recording, featuring a performance of Beethoven's Fifth Symphony by the Philadelphia Orchestra under the baton of Leopold Stokowski at the Philadelphia Academy of Music.\nHistoric Publication: \"Lord of the Flies\" by William Golding\n1954\nIn 1954, William Golding's seminal work, \"Lord of the Flies,\" was published by Faber and Faber in London, a literary masterpiece that continues to captivate readers worldwide.\nPremiere of Samuel Beckett's \"Happy Days\"\n1961\nIn 1961, the enigmatic play \"Happy Days\" by Samuel Beckett had its premiere in New York City, marking a significant moment in the world of theatre and existentialist drama.\nFran Tarkenton's Remarkable NFL Debut\n1961\nIn his NFL debut against the Chicago Bears in 1961, Fran Tarkenton displayed exceptional talent by leading the Vikings to a commanding 37-13 victory, while also becoming the only quarterback to throw four touchdown passes in his inaugural game.\nRelease of \"Baby Love\" by The Supremes\n1964\nIn 1964, the iconic American girl group, The Supremes, released their hit single \"Baby Love,\" which went on to become a beloved classic in the world of music.\nThe Doors on \"The Ed Sullivan Show\"\n1967\nThe American rock band \"The Doors\" made their first and final appearance on \"The Ed Sullivan Show\" in 1967, as singer Jim Morrison's refusal to change a lyric led to the show's producers deciding not to invite them back.\n\"MAS*H\"\n1972\nThe television comedy series \"MASH,\" adapted from the movie and starring Alan Alda, Loretta Swit, Wayne Rogers, and McLean Stevenson, made its debut on CBS in the United States in 1972. The show went on to run for 11 years, receiving 14 Emmy Awards and 1 Peabody Award.*\nFleetwood Mac's Chart-Topping Album\n1977\nIn 1977, the British-American band Fleetwood Mac's album \"Rumors\" continued its impressive reign as the number-one album for the 19th consecutive week, solidifying its place in music history.\nToronto Film Festival: \"The Big Chill\" Wins People's Choice Award\n1983\nAt the 8th Toronto International Film Festival in 1983, \"The Big Chill,\" directed by Lawrence Kasdan, received the prestigious People's Choice Award, recognizing its impact and popularity among festivalgoers.\nToday On History - Birthdays\nFriedrich Wilhelm von Steuben (1730-1794)\nA Prussian-American military officer who played a vital role as a major general in the Continental Army during the American Revolutionary War, born in Magdeburg.\nMarquis de Condorcet (1743-1794)\nA French Enlightenment philosopher and mathematician known for the Condorcet Method in voting theory, born in Ribemont, Picardy, France.\nFrederick Ashton (1904-1988)\nA British choreographer renowned for his work on ballets like \"Cinderella,\" born in Guayaquil, Ecuador.\nHank Williams (1923-1953)\nAn iconic American country singer-songwriter famous for hits like \"Cold Cold Heart,\" \"Hey, Good Lookin',\" and \"Your Cheatin' Heart,\" born in Mount Olive, Alabama.\nGeorge Blanda (1927-2010)\nBorn in Youngwood, Pennsylvania, an American Pro Football Hall of Fame quarterback and placekicker who made significant contributions to the AFL and NFL throughout his career with the Chicago Bears, Houston Oilers, and Oakland Raiders.\nStirling Moss (1929-2020)\nA British auto racer with an impressive record of 16 Formula One Grand Prix victories and multiple runner-up finishes in the World F1 Drivers' Championship, born in London, England. He also ventured into broadcasting with ABC F1 and NASCAR.\nAnne Bancroft (1931-2005)\nAn American stage and screen actress, director, and playwright best known for her appearances in \"The Graduate\" and \"The Miracle Worker,\" for which she received Emmy, Oscar, and Tony nominations. She was born in New York's Bronx.\nMaureen Connolly (1934-1969)\nAn American tennis player celebrated for winning the first women's Grand Slam in 1953 and amassing nine Grand Slam singles titles during her career, born in San Diego, California.\nNarendra Modi (Born 1950)\nAn Indian politician who served as the 15th Prime Minister of India, born in Vadnagar, Gujarat. He has played a significant role in Indian politics.\nKeith Flint (1969-2019)\nAn English vocalist, musician, and dancer best known for his work with the band \"The Prodigy,\" born in London, England.\nAlex Ovechkin (Born 1985)\nRussian ice hockey player recognized for his exceptional goal-scoring talents. He has had a successful career with the Moscow Dynamo and the Washington Capitals.\nPatrick Mahomes (Born 1995)\nHe is an American football quarterback who played for the Kansas City Chiefs and was named Super Bowl MVP in 2020 and 2022. He was born in Tyler, Texas, and is regarded as one of the NFL's best prospects.\nOn This Day In History - Deaths\nHildegard von Bingen (1098-1179)\nThe first Western composer whose works survived. She was a German Benedictine nun, magistra, and musician. At the age of 81, she died.\nPhilip IV (1605-1665)\nPhilip IV reigned as King of Spain and Portugal from 1621 to 1665, dying at the age of 60.\nDred Scott (c. 1799-1858)\nHe died of TB at the age of 62 or 63, after attempting to claim his freedom as an ex-slave in the United States.\nWilliam Henry Fox Talbot (1800-1877)\nHe died at the age of 77. He was an English photographic pioneer noted for his contributions to early photography.\nAnastasio Somoza Debayle (1925-1980)\nPresident of Nicaragua from 1967 to 1972 and again from 1974 to 1979, he was assassinated in Paraguay at the age of 54.\nKarl Popper (1902-1994)\nAn Austrian-British philosopher renowned for works like \"The Logic of Scientific Discovery\" and \"The Poverty of Historicism,\" he passed away at the age of 92 while battling cancer.\nVitas Gerulaitis (1954-1994)\nA Lithuanian-American tennis player who won the Australian Open in 1977 and Wimbledon doubles in 1975, he died of carbon monoxide poisoning at the age of 40.\nSpiro Agnew (1918-1996)\nAn American politician who served as Vice President from 1969 until his resignation over corruption allegations in 1973, he passed away at the age of 77.\nAbdelaziz Bouteflika (1937-2021)\nAn Algerian politician who served as President of Algeria from 1999 to 2019, he died of a heart attack at the age of 84.\nALSO READ|",
  "word_count": 2270,
  "scraped_at": "2026-02-14T12:39:50.851061"
}