{
  "article_id": "4be011d6306b",
  "url": "https://www.plymouthherald.co.uk/news/celebs-tv/bbc-eastenders-ian-beale-star-9965770",
  "title": "BBC EastEnder Ian Beale star Adam Woodyatt salary leaves fans gobsmacked",
  "date": "20250221T174500Z",
  "domain": "plymouthherald.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "BBC EastEnders' Ian Beale star Adam Woodyatt's salary leaves fans gobsmacked\nAdam Woodyatt has been playing the role of Ian Beale in EastEnders since the very first episode in 1985 - but fans have been left gobsmacked after learning how much he earns\nEastEnders enthusiasts were taken aback upon discovering the reported salary of Adam Woodyatt recently.\nThe actor has become an icon as Ian Beale on the popular soap. Since the very first episode in 1985, Adam has portrayed the character, starting at just 16 years old.\nNow 56, he's famed for Ian Beale's number of marriages—six to five different women—and holds the title of the longest-serving male actor on EastEnders, with a Lifetime Achievement Award from the British Soap Awards to his name. A recent social media post highlighted Woodyatt's dramatic storylines, stating: \"This man's been shot, thrown in front of a car and blasted through the air from an explosion... Just another day in the life of Ian Beale.\"\nGiven his tenure and popularity, one might assume Woodyatt commands a hefty salary, yet fans were astonished to learn that old reports suggest he earns £260,000 annually. The revelation sparked a reaction on Twitter, where @PiggyBing expressed her amazement: \"Do you know Ian Beale (well, the actor who plays him) earns £260,000 a year?! Blows my mind that.\"\nREAD MORE: EastEnders' Lacey Turner's heartbreaking health ordeal after waking up 'in pool of blood'This prompted a flurry of comments from soap opera fans, with one asserting: \"He deserves that more than MP's deserve £90K, to be fair.\" Another hailed him as the \"finest actor of our generation\".\nQuestions and comparisons regarding the salaries of EastEnders cast members have emerged, sparking a debate about the worth and earnings of soap stars. One person challenged: \"Why do they pay him that much? They could pay him 80k, it's not like there would be much more than panto open to him if he left. Bet he's got a fat pension too. I don't blame him though, I'd happily take 260k to pretend to be Ian Beale.\"\nMeanwhile, another inquired: \"How can they justify that? Is it like football? If you don't pay the obscene wages, then someone else will... Imagine losing Ian Beale to Corrie on a free transfer?\"\nAdding to the conversation, one further remarked: \"To be fair though that's not actually that much. Like don't get me wrong I don't enjoy being forced to pay for it. But the guy has been playing him since the 80s.\"\nHow do other actor's wages compare?\nAdam Woodyatt is reportedly earning less than several of his fellow actors despite his longevity on the show.\nThe salaries of other actors came under scrutiny as well, with Danny Dyer, who played the beloved Mick Carter, reported receiving up to £249,000 back in 2017. Steve McFadden, known for portraying Phil Mitchell, rakes in roughly £300,000 a year, while June Brown, the esteemed Dot Branning, was once offered a £300,000 deal to stay until March 2018.\nContributing to the insights on performer income, Rory Jennings, remembered for his part as Craig Dixon, elucidated the payment system during an appearance on The Fellas Podcast. He revealed: \"It worked out that I was on £1,000 per episode, but this is way back in the day. But then you had the Sunday repeat - the omnibus on Sunday...and you would get 80% of your fee again.\"\nThe podcast host concluded that Rory would have been earning approximately £6,000 each week.\nDid you know this? Comment below.",
  "word_count": 586,
  "scraped_at": "2026-02-14T13:19:23.044706"
}