{
  "article_id": "4befa6790dae",
  "url": "https://www.anglocelt.ie/2025/07/10/young-eagle-eyes-up-new-skies/",
  "title": "Young Eagle eyes up new skies",
  "date": "20250710T231500Z",
  "domain": "anglocelt.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Young Eagle eyes up new skies\nIn a milestone moment for Irish basketball, Virginia native Emma Tolan is preparing to take her talents across the Atlantic after being selected as one of nine Irish women to earn a college basketball scholarship to the United States this year - the most ever in the same season.\nThe 19-year-old forward, known for her toughness, heart, and productive play, will soon be swapping her navy blue jersey for Oklahoma’s crimson red, marking both a personal triumph and a sign of the growing stature of women’s basketball in Ireland.\nEmma’s journey from the backyard hoop in Virginia to the 11,500-seat Lloyd Noble Center in the U.S. is nothing short of remarkable.\n“It is a bit daunting. I’ve never really played in front of a crowd that big, but I am definitely looking forward to it,” says Emma during a break from her personal training schedule at Virginia College. Her father Graham and older sister Niamh are both supporting her. The sport has been a family affair from the start: Graham chairs the Cavan Eagles, and her two older sisters, Niamh and Ciara, have played by her side for years - most recently securing their first ever promotion to the Women’s Super League.\nWhat makes basketball so special?\n“I think it’s the adrenaline, the fast pace, you always have to be thinking and on your feet the whole time. It’s always really exciting and intense.”\nBasketball was once a relatively small sport in Virginia, but in recent years the Cavan Eagles have grown to 25 teams in all age groups with nearly 500 members.\n“It’s a lovely community,” Emma says. “At our home games, you see people of all ages cheering us on. Everyone gets really involved and everyone’s really into it.”\nThat support will soon be replaced by thousands of American basketball fans.\n“We’re so excited to welcome Emma to our basketball family,” Oklahoma’s basketball coach Jennie Baranczyk told Sports Illustrated recently. “She’s a tough, versatile forward who plays with great heart and makes everyone around her better.”\nIt’s a sentiment Emma embodies wholeheartedly. “There’s no point in one player trying to do it all,” she says. “It’s about bringing everyone into the game. That’s how teams succeed.”\nEmma was scouted through a personal connection in the States.\n“They looked at a few of my old games and reached out,” she explains. “It all happened really quickly, just a few weeks ago.”\nIrish U20 team\nHer ascent was built not only by club performance, but also through representing Ireland at international level. She’s currently training with the Irish U20 national team in preparation for the European Championships later this summer, with warm-up games in Bulgaria and Croatia before the Euros. These weekends are intense, with five to six hours of training per day, including tactics, scrimmages, and conditioning.\nDespite the looming move to the US, Emma’s focus remains on her national team duties.\n“I try to take it day by day,” she says. “Of course I’m thinking about the move, but for now, I want to give everything to the Irish team.”\nIn the Virginia College hall, Emma is keeping sharp with daily shooting sessions, fitness work, and training under the guidance of her dad.\n“We work on everything -form shooting, footwork, three-pointers,” she says.\n“At this stage, it’s about getting reps in, building muscle memory, and staying consistent.”\nShe’s also preparing mentally and emotionally for the change.\n“The hardest part will be leaving my family. We’re really close,” Emma admits. “I was in Dublin last year for college, but I came home every weekend. This will be different.”\nShe admits she will miss her friends on the football team as well as the sport itself after claiming the All-Ireland Minor A Championship title.\n“We’ve had a really good year with our team here in Cavan,” she says, which is probably an understatement.\nChallenge and opportunity await her now. Emma’s goal is to contribute meaningfully to her new team, work her way into a significant role, and help push ‘The Sooners’ toward the Final Four - one of college basketball’s biggest stages. “I think our team would have a good chance of doing quite well.”\nStudies\nOff the court, Emma is studying sports science and education, with plans to become a PE and biology teacher down the line. “It’s a lifestyle that works well with sport,” she says. While professional basketball for women remains a challenging path, Emma remains open to what the future may hold: “Let’s see after the four years if I stay longer or want to come home.”\nShe’ll even cross paths with a close friend and fellow Irish international Grace Prenter, who is heading to Texas this year. “We’ve played against each other here and together for Ireland. Now we’ll be opponents again in the same conference. It’s funny how it’s all worked out.”\nBack where it all began in Virginia, Emma’s story is already inspiring a new generation.\n“When I was younger, we looked up to girls like Aoife Maguire and Ciara Brady - now I’m playing with them. It’s a full-circle moment,” she says.\n“You see a lot more girls joining the club. And they’re kind of more interested in basketball than football, which isn’t usual around here. And the standard is getting much higher, which is great to see.”\nEmma and the other eight young women are a testament to that.",
  "word_count": 904,
  "scraped_at": "2026-02-14T12:44:03.209816"
}