{
  "article_id": "4c2165b43f80",
  "url": "https://www.mcall.com/2025/12/31/lehigh-valley-deaths-for-2025/",
  "title": "The year 2025 in Lehigh Valley deaths",
  "date": "20251231T134500Z",
  "domain": "mcall.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Lehigh Valley once again lost a host of standout people throughout the year.\nSome were public leaders; others were stalwarts in business, education, medicine, religion and other areas.\nThe year’s list also included a world-renowned broadcast journalist, a Morning Call photographer and reporter, and another area reporter who covered Northampton County government.\nHere are some of the noteworthy people who either called the Lehigh Valley home or made the region better. Information was compiled from The Morning Call and wire stores, and obituaries.January\n7: Jeanette Kassis, 51, rose through the ranks at the Easton Area School District to become a deputy principal at the high school. In education and other endeavors, she served with quiet grace, according to family, friends and others who met her.\n21: World War II veteran Dick Schermerhorn, 102, cleared mines on a Normandy beach during the D-Day assault of 1944 and had brushes with two famous generals there. Schermerhorn was among the few remaining survivors of the epic Allied invasion of Nazi-occupied Europe. He lived in Allentown for much of his life, including after the war, and his death represented the last known living Lehigh Valley veteran who served during D-Day.\nFebruary\n3: Susan Vitez, 68, was treasured for her involvement in many things about Bethlehem, including on the board of the Steelworkers’ Archives. Her dedication to the city was evident, whether it was preserving history or supporting numerous groups and charities.\n4: Timothy Cain, 77, was a radio voice of eastern Lehigh Valley, a veteran newsman and sports broadcaster at Easton’s WEST-AM and WLEV-FM for nearly two decades before he entered other work. His community service included being president of the Easton Lions Club and serving 18 years on the board of Easton Suburban Water Authority.\n16: Lisa Dell’Alba, 46, convenience store leader who was president and CEO of local convenience store chain Square One Markets at the time of her death. The Bethlehem resident made a name for herself in the convenience store and food products industries. She had been chair of the Pennsylvania Food Merchants Association, and served on the board for Team Pennsylvania Foundation working to ensure economic prosperity in the state.\n17: Fritz Sprandel, 80, dreamed up adventures that wound up making him a media legend. They included completing a coast-to-coast snowmobile journey, paddling a canoe from Oregon to New York City, and canoeing from New York to California via the Panama Canal, unexpectedly veering off course and getting arrested and imprisoned in Cuba. He was written about in national magazines and appeared on TV’s “To Tell the Truth” — interesting exploits from a kid growing up Bethlehem and Allentown.\n17: Elizabeth M. Wetzig, 80, incorporated dance into fitness. A professional dancer and dance company founder, the Allentown resident taught students about being more comfortable living in their bodies, that movement, not dance or exercise, can enhance a person’s wellbeing. Wetzig also was a frequent contributor to The Morning Call’s opinion page.\n23: Ralph H. Uff, 91, served the community as a deputy fire chief and a founding member of Lehigh County Hazardous Materials Response Team. The Allentown resident for nearly 40 years was a volunteer firefighter with Cetronia and Western Salisbury fire companies. In a varied work career that included being a master plumber and certified hazardous materials technician, he also served as a judge for SkillsUSA student competitions.\nMarch\n14: John A. Cacciatore, 86, was active in Palmer Township community sports as a coach and umpire assigner. He also oversaw the Anthony J. Minotti Scholarship Fund that rewarded Easton Area and Notre Dame high school graduates who played in the program and whose parents were dedicated as volunteers to the Palmer School Complex.\n29: Grayson McNair, 84, was a former Lehigh County commissioner and one-time county human services director. Those positions came after he retired from PPL as an area vice president. McNair was also active in the community with leader roles that included the United Way and Lehigh Conference of Churches.\n29: John W. Border Jr., 81, rose through the ranks over a 35-year career to become Easton police chief. Health problems forced him to retire nearly 30 years ago, but he presided over a rejuvenated department that once was known for cases of police brutality leading to lawsuits. He was accessible and personable, traits that helped Border rebuild relations with a community that had come to fear and distrust its police.\n30: Luke Cunningham, 67, was a Bethlehem business and community leader. He owned and operated RL Hammer Electric, Bethlehem, with his brother, Lee, about 15 years before merging businesses with their father, Luke P., to form West Side Hammer Electric. His activities outside work included serving on various boards related to community, medicine and the workforce.\nApril\n4: Steven Marshall, 62, a retired Bethlehem police sergeant who later became DeSales University police chief, was killed in a crash in South Carolina, where he moved upon his retirement. The Bethlehem native spent decades in law enforcement and beyond, working on the board of Truth for Women/Bloom. He helped support and empower survivors of sex trafficking and exploitation.\n4: Harry Humes, 89, was a Kutztown University professor emeritus noted for his passion for writing, reading and teaching. The Lenhartsville resident taught poetry and fiction writing courses at Kutztown, and he developed courses on literature and film and literature and the environment. He also produced “Yarrow,” a national poetry journal.\n4: Bernard J. “Bernie” Berg, 89, campaigned unsuccessfully three times during the 1980s for the Lehigh Valley congressional seat held by Don Ritter. The Easton resident, who once was ordained a priest, became a political gadfly who railed against the Washington establishment and advocated for truth, peace and justice.\n21: George Umberger, 82, entered the state police as a trooper but became a fire investigator for 28 years and was fire marshal for the Lehigh Valley. He headed probes into serious fires throughout the area, such as the 1977 arson at the Westgate Mall in Bethlehem that caused nearly $3 million in damage. Umberger had many hobbies, including photography, and he was a photo instructor at Northampton Community College.\n22: John Simitz, 86, spent nearly 40 years as a photographer with The Morning Call, helping to chronicle countless stories via the lens from newsworthy events to notable public events. He later served as chief photographer for the Diocese of Allentown and its newspaper, The AD Times, and he also created lasting memories for hundreds of people and families through his photography business.\n24: Robert T. Smith, 86, was a technology stalwart who worked for years at the Lehigh Valley’s Western Electric. The physicist, once named “Semiconductor Man of the Year” by an industry magazine, once led a team that invented technology that used lasers to program redundant circuitry on semiconductor memory devices, dramatically reducing manufacturing costs. He was also active playing soccer and as a choral music singer.\n27: William L. Heydt, 86, was a two-term Allentown mayor from 1994 to 2002 who focused heavily on economic development and downtown revitalization. As mayor, Heydt was known for the removal of the canopies over Hamilton Street and seeking the redevelopment of the former Hess’s property at Ninth and Hamilton streets. Heydt also established Allentown’s annual Lights in the Parkway drive-through Christmas lights display and led efforts to fluoridate the city’s water supplies.\n30: Hayden Pritchard, 92 was elected from 1975 to 1989 to the Bangor Area School Board. A biology professor who taught at Cedar Crest College and Lehigh University, Pritchard was raised in Bangor and continued to serve the borough, Slate Belt and elsewhere in Northampton County.\nMay\n7: Joseph P. Clark, 75, was a longtime developer and businessman who owned numerous properties in Allentown, including the former Crocodile Rock Cafe on Hamilton Street. Clark was remembered by colleagues, and even those he clashed with, as someone who liked to help people. He was a major force in Allentown real estate, investing in and revitalizing many properties.\n19: April Rae Lubenetski, 51, dedicated more than two decades as a firefighter in Emmaus and Lehigh Township. The veteran first responder also volunteered with the Lehigh Valley County Animal Rescue Team. Communities on both ends of the Valley lost a selfless servant.\n22: Ed Dean, 92, was Palmer Township’s longtime fire chief, and he also chaired the Palmer Historical Society. The hallway of the township’s municipal building is named for Dean. Local firefighters and historians have one less person to rub elbows with over his knowledge of firefighting and local history.\n28: Martin D. “Marty” Semmel, 71, co-owned of C.E. Roth Formal Wear in Whitehall Township before entering semi-retirement. He was considered an area pioneer of bridal shows.\nJune\n1: Janice S. Bonge, 91, served as a church organist for several congregations, but her musical talents eventually led her to the Bach Choir of Bethlehem. She first joined as the choir’s organist and later served as its president of its board of managers. It marked the first time in history of the choir that a performer had been elected to lead it.\n4: Daniel J. Yakubecek, 92, a lifelong Whitehall Township resident and educator in the Whitehall-Coplay School District, who served as superintendent from 1975 to 1993. In 1987, the Pennsylvania Department of Education ranked Whitehall in the top 10% of the state’s 501 school districts for showing consistently high student achievement, despite the district having one of the state’s lowest per-pupil expenditures.\n14: Alois J. Recker, 88, was a longtime reporter at the former Bethlehem Globe-Times and later the Northampton Press. Recker was a fixture at the Northampton County Courthouse, where he used to frequently scour government offices and agencies in search of stories — not just investigative articles but vignettes about the people who worked in those buildings.\nJuly\n1: William J. Sproule, 88, was a Carbon County Hall of Fame athlete who eventually wound up spending his last years in the Allentown area. Between his youth and late adult years, Sproule became head football coach and administrator at Bloomsburg University and later helped develop a cardiac rehabilitation program at Bloomsburg Hospital. He also launched undergraduate and graduate degree programs in adult fitness at Bloomsburg.\n4: Shane Lamas, 51, was a stellar football athlete at Easton Area High School and Moravian University, who later worked as a special education teacher in the Easton school district. His obituary said Lamas “was overworked and underpaid for the amount of stress that he was put through, although he loved his coworkers and most of his students.”\n26: Dr. Wesley P. Kozinn, 78, was among a few go-to local experts for decades in the Lehigh Valley when it came to infectious diseases. He was credited years ago for helping to save the life of a police officer whose life was threatened by a rare bacterial infection called Lemierre syndrome.\nAugust\n3: Ronald Owney “Roc” Crumbliss, 76, started in radio a half-century ago and worked at a half-dozen stations. About 10 years ago, he and his son, Christopher, purchased the former WGPA-AM in Bethlehem from the estate of the popular Joseph “Jolly Joe” Timmer, and they kept the station going.\n4: Alice Yeakel , 91, was born and raised in Nazareth and dedicated much of her life to the borough, especially the Memorial Library of Nazareth & Vicinity. Someone writing on its website referred to Yeakel as the face of the library for her children’s story hours and other work. She and her late husband, Elmer Yeakel, who was mayor, were considered unofficial historians of the community.\n14: Sister Virginia Longcope, 87, founded Stephen’s Place, a south Bethlehem halfway house for paroled men. The Roman Catholic nun’s mission to offer a safe, structured environment to former prisoners upon their release into society continues at Stephen’s Place. But in more than 30 years of work, she helped hundreds of men reenter society after serving time in prison.\n17: David A. Donio, 70, was involved in television production at WLVT-TV, PBS 39, where he rose to vice president of development. He later worked for ESPN, MLB and NFL sports networks, among others, directing camera. His community service included the Lehigh and Wildlands Conservancy, and he also ran at least twice for state legislative seats.\n22: William K. Mason, 82, was an award-winning photographer whose passion for the work included an August 1967 cover photo for Life magazine during the Vietnam War. He continued after retirement as a wedding photographer until “darkrooms became obsolete,” according to his obituary. Later, the Catasauqua resident became executive director of the nonprofit Allentown Housing Association and Development Corp.\n29: Charles Bierbauer, 83, who grew up in Allentown, went on to a distinguished career in journalism. Bierbauer, who was last professor and dean emeritus of the University of South Carolina’s College of Information and Communications, worked as a CNN senior Washington correspondent, ABC News foreign correspondent. Before receiving the accolades from a noteworthy career, Bierbauer worked at former radio station WKAP in Whitehall and as a summer reporter at The Morning Call.\n30: Bob Holder, 62, was a sports talk radio personality, known principally for his show “After Further Review” that aired on several Valley stations. Despite an at-times gruff demeanor on the air, those who knew “Radio Bob” said his 25 years being on radio led to his legendary status among fans who embraced his commentary.\nSeptember\n1: Charles E. “Zeke” Bellis III, 65, was elected a Palmer Township supervisor in 2023. Though he served less than two years on the board, Bellis, who also owned Easton Beverage Co., dedicated years in the community coaching youth sports.\n9: Dr. Patricia Ann Haberen Gureghian, 87, grew up in the Lehigh Valley and was one of Muhlenberg College’s first female graduates in 1959. She went on to a career in medicine, serving as a professor of radiology and having a private radiology practice. In retirement, one of her activities was cooking meals weekly for a local soup kitchen in York.\n15: Douglas H. Schlegel, 66, served nearly two terms as a Northampton County district judge. Before that, the Allentown native worked as a police officer in Easton and Bushkill Township, and a longtime volunteer firefighter. While he had a checkered law-enforcement past — including once filing a federal lawsuit against Easton over a demotion — Schlegel the judge was considering unwavering in dispensing justice.\n22: Robert Pruznick, 74, who served as president of the Nazareth Area School Board, was also a champion of the less fortunate. He spent 35 years as executive director of The Arc of Warren County in New Jersey, significantly expanding the agency’s programs for people with developmental disabilities. He was deeply devoted to charity and maintained active membership and board positions in several fraternal and community organizations, including the Miracle League, and Northampton County Area Agency on Aging.\n22: Edward J. Stinner Jr., 71, was a special education and emotional support teacher in the Allentown School District, a summer playground supervisor and longtime girl’s softball coach. He founded a scholarship fund for one of his players, the late Carole Weil, providing thousands of dollars to help college athletes.\nOctober\n1: Ed Ruisz, 70, became a legendary track and field coach at Palisades High School. He also left a lasting legacy at the Bucks County school as a teacher and a mentor to many.\n6: Dan Shope, 72, worked as a Morning Call sports writer and later became an award-winning business writer and columnist. His gift for listening to people’s stories led him to volunteer at Lehigh Valley Health Network, where he interviewed elderly patients about their lives. His work at The Call stretched back to when the symbol -30- indicated the end of a story, to his email signature dan.shope@mcall.com.\n13: Don S. Follett, 96, ran Follett Corp. in Forks Township for decades before retiring in 1994. He was also extremely active in community work, serving on such boards as the nonprofit ProJeCt of Easton. The interfaith nonprofit noted in an online message that Follett was “an integral part of who we are as an agency” by his guidance and deep compassion to the community.\n16: Patrick M. Sewards, 72, grew up under the shadow of his legendary father, Allen coach and icon J. Milo Sewards, and he set an East Penn Conference single-game scoring record in 1971. Sewards went on to a stellar career outside sports. He was a beloved, dedicated orthopedic surgeon and therapist, owning Iron Run Orthopedics for many years.\n21: William H. Platt, 85, held many public titles in Lehigh County and beyond over the past few decades, including district attorney, county judge and senior judge assigned to the Pennsylvania Superior Court. Along the way, he inspired many others to follow similar paths of public service.\n25: Sharon Camp, 81, who was born in Easton, became a public policy expert and advocate for women’s reproductive health. She was also known as the mother of Plan B, the emergency contraceptive pill. Camp, who had a doctorate in international relations, was a family-planning veteran.\n26: James A. Schmoyer, 82, was a teacher who pivoted to away from the classroom to eventually becoming owner of Ice Cream World across from Dorney Park and Wildwater Kingdom. He delighted generations of families with his kindness, dedication, and welcoming smile, as well as teaching legions of “students” about running business.\n27: Alice P. Gast, 67, was Lehigh University’s 13th, and first female, president, serving from 2006 to 2014. Among other accomplishments, Gast strengthened the school’s ties with Bethlehem, creating the South Side Initiative — an educational and cultural collaboration among students, faculty and residents — and community school collaborations with elementary and middle schools.\nNovember\n1: Nancy Dischinat, 79, headed Lehigh Valley Workforce Board, aka Pennsylvania CareerLink Lehigh Valley, about four decades. Her Job One was helping people connect with many of the area’s employers. She was a vital link in the region’s workforce development in good or tough times — always spinning the data with folksy lyrics or rhymes.\n4: Charles E. Bartolet Jr., 88, was a longtime high school history teacher and wildly successful wrestling coach in the Saucon Valley School District. After retiring, Bartolet was elected to the Saucon Valley School Board, serving 10 years. In all, he spent more than 50 years in the district.\n6: David J. “Chip” Brightbill, 83, was a state senator from Lebanon County whose district for a time took in western Lehigh County. The Republican lawmaker was architect of a model environmental law in 1995 that led to the clean up of 10,000 polluted sites across Pennsylvania and created 150,000 jobs. He was also instrumental in securing legislation that created of the departments of Environmental Protection and Conservation and Natural Resources, and helped preserve tens of thousands of acres of natural land and many waterways.\n10: Bethlehem resident K. Scott Sine, 57, was chief engineer of the glass-fronted building originally known as PPL Plaza at Ninth and Hamilton streets in downtown Allentown. The founder of GEMM Masterplanning was instrumental in using integrated design features that made the building more efficient while keeping costs within line for such a structure, according to colleague Bruce Wilson.\n12: Michael A. Booke, 57, was a longtime Northampton Borough firefighter and former state police fire marshal who served the Valley before retiring from the latter role in 2017. In addition to his role as a firefighter, he was also a state trooper — a long dedicated life of service to others.\n30: Martha Cusimano, 82, a prominent Bethlehem community leader, died after a 20-year battle with breast cancer, according to her family. She helped shape the region through her nonprofit leadership, founding the Greater Lehigh Valley Auto Dealers Association and directing its charitable foundation, which has funded millions in scholarships and local causes. During her professional career, she also led community relations for St. Luke’s University Health Network and DeSales University. Cusimano moved to Florida with her husband, James Cusimano, retired superintendent of education for the Diocese of Allentown..\nDecember\n10: Antonino Morici Sr., 78, owned Morici’s Restaurant, a staple on Easton’s College Hill. Morici and his family started Morici’s as a bakery, then a sub shop and later a pizzeria before it became a full-service restaurant. The restaurant always served stellar Italian food, not fancy-schmancy eats, which helped make it an institution.\n10: Joanne Barnette, 90, made a lasting mark as a community leader in Bethlehem and the Lehigh Valley. The wife of former Bethlehem Steel Corp. Chair Hank Barnette, she led or served on several nonprofit boards, including the Allentown Art Museum, Historic Bethlehem and Lehigh Valley Community Foundation, among others. She also helped establish scholarships in the family name to support younger generations of minds eager to further their education.\n16: David B. Shulman, 76, was elected to the Northampton Area School Board and served more than four decades on the Lehigh Township Planning Commission. An attorney, Shulman dedicated years to community activism, but besides practicing law and serving the area, his obituary said he once taught a class on how people could get the most out of a trip to Orlando’s Disney World, of which he was an avid fan.\n22: Robert E. Bold, 90, spent five decades in education before retiring in 2019 from the unpaid post he held for 20 years on the Parkland School Board. The Schnecksville resident also taught 30 years in Allentown School District. While education was his calling, Bold also served as a volunteer with the Schnecksville Community Fire Co. and its fire police, and was president of the Upper Lehigh Historical Society.\n23: Thomas Scott Ferguson, 72, served as Warren County prosecutor from 2004 to 2012. The prosecutor’s office said in a social media post that Ferguson, who lived in Phillipsburg, made “lasting contributions” to the community, notably leading to the establishment of the Warren County Child Advocacy Center, an agency that has helped countless youth victims and their families.\n25: Russell H. “Russ” Roper, 89, was a lifelong educator whose career included 17 years as superintendent at the Pen Argyl Area School District. He also held positions with the Easton Area School District and Lehigh Valley Health Network, but Roper dedicated much of his work life in his native Slate Belt as an advocate for small schools.\n27: Frank T. Freidl Sr., 77, served as a Williams Township supervisor from 1992 to 2002, when he resigned for personal reasons. During his tenure, he joined other supervisors in voting against a controversial Chrin Cos.’ rezoning request to expand its landfill. Besides politics, Friedl, an engineer and land surveyor, was a longtime face of Met-Ed/FirstEnergy Corp. as a regional distribution manager, among other titles.\nContact Morning Call reporter Anthony Salamone at asalamone@mcall.com.",
  "word_count": 3787,
  "scraped_at": "2026-02-14T14:22:35.820872"
}