{
  "article_id": "4c5479ade3f5",
  "url": "https://collider.com/best-shows-max-september-2024/",
  "title": "The Best Shows on Max Right Now ( September 2024 ) ",
  "date": "20240906T213000Z",
  "domain": "collider.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Good shows on HBO are plentiful — even great ones aren't hard to come by. The platform has earned its prestige TV distinction, and its streaming service has the luxury of housing classic favorites like Friends alongside more recent Emmy-winning masterpieces like Succession and The White Lotus. There's a lot of excellent content to choose from: Here's our list of the best shows on HBO Max to help you get started.\nFor more recommendations, check out our list of the best movies on HBO, the best drama movies on HBO, and the best horror movies on HBO.\nEditor's note: This article was updated September 2024 to include Wise Guy: David Chase and the Sopranos.\n‘Wise Guy: David Chase and the Sopranos’ (2024)\nRotten Tomatoes: 100% | IMDb: 8.4/10\nBoasting a 100% Rotten Tomatoes rating, this HBO original documentary follows the making of and surrounding cultural shifts caused by the iconic TV series The Sopranos. Featuring first-hand accounts and interviews from those closest to the show, creator and showrunner David Chase leads a fascinating look at both the iconic series and the television industry in general. Chase’s life is also explored, giving a deeper look at the experience that led the genius to create one of the best television series of all time. - Jake Hodges\n‘The Penguin’ (2024)\nRotten Tomatoes: 93%\n- Release Date\n- 2024 - 2024-00-00\n- Showrunner\n- Lauren LeFranc\n- Directors\n- Craig Zobel\n- Writers\n- Lauren LeFranc\n- Franchise(s)\n- Batman, DC Elseworlds\nCast\n-\nColin FarrellOz Cobb\n-\nSofia Falcone\nColin Farrell’s transformative performance as Oswald Cobblepot in 2022’s The Batman made for one of the best secondary antagonists in superhero cinema history. Now, and rightfully so, he is receiving his own series set straight after the events of the aforementioned film. With Gotham City flooded, Cobblepot (The Penguin) looks to take advantage and start molding the criminal underworld in his image. Inspired by crime series such as The Sopranos, The Penguin is a gritty crime drama disguised as a big-budget superhero series. Full of dark twists, the show holds your attention from its first episode and never lets go, making for an experience that both dutifully sets up the upcoming Batman sequel without wasting any of its own time - Jake Hodges\n‘Chimp Crazy’ (2024)\nRotten Tomatoes: 95% | IMDb: 7.3/10\nThis mind-boggling docuseries, directed and produced by Eric Goode, tells the bonkers tale of former nurse-turned-exotic animal broker Tonia Haddix. After keeping many animals in captivity, Tonia falls in love with a chimpanzee called Tonka, with her doting affection soon catching the attention of PETA. Chimp Crazy could’ve easily sided with either of the two oppositions in this documentary, but Goode and co. neatly portray both sides of the story as any great docuseries should. Allowing the audience to make their own mind up, Chimp Crazy blends emotional anecdotes with cold, hard facts, making for a viewing experience that feels both mind-blowing and educationally rewarding. - Jake Hodges\n‘Margarita’ (2024)\nRotten Tomatoes: 100% | IMDb: 6.8/10\nMargarita\n- Genre\n- Teen, Comedy, Drama\n- Debut Date\n- September 2, 2024\nThis Argentine-Uruguayan series, which is itself a spin-off of the telenovela Floricienta that ran for two seasons in the mid-noughties, follows the titular Margarita (Mora Bianchi) as she stumbles across a magical place that houses the answers to the many mysteries of her life. Floricienta was a certified worldwide hit, with this spin-off already benefiting from a dedicated core fanbase. By mixing the comedy, drama, and fantasy genres, the series takes on the mantle of its predecessor by bringing exciting and immersive stories to a young audience. Impressively, the first season consists of 40 episodes in total, meaning there’s plenty to keep any potential viewer entertained. - Jake Hodges\n‘Hard Knocks’ (2001 - Present)\nIMDb: 8.4/10\nProduced by NFL Films and HBO, Hard Knocks is a long-running reality sports documentary series first broadcast in 2001. Each season of the show follows a National Football League (NFL) team as they prepare for the upcoming football season, going deep into the professional and personal lives of the players, coaches, and staff. Since 2021, the series has also featured a second season the same year that follows another team during the NFL regular season. In 2024, the show expanded to its largest scale yet, covering the New York Giants in the off-season, the Chicago Bears during training camp, and the entire AFC North division during the regular season. Over the years, Hard Knocks has become quite popular with football fans. Though individual seasons have faced criticism, the show’s overall response has been quite positive, as it gives fans a behind-the-scenes look at the personal journeys of their favorite icons.\n‘In Treatment’ (2008 - 2021)\nRotten Tomatoes: 90% | IMDb: 8.3/10\n- Release Date\n- 2008 - 2021-00-00\n- Network\n- HBO\n- Directors\n- Paris Barclay, Rodrigo García, Jim McKay, Ryan Fleck, Melanie Mayron, Jessica Yu, Janicza Bravo, Karyn Kusama, Michelle MacLaren, Christopher Misiano, Uta Briesewitz, Courtney Hunt, Terry George, Jean de Segonzac, Warren Leight, Alan Taylor, Richard Schiff, Patricia Rozema, Michael Pressman, Joshua Marston\n- Writers\n- Anya Epstein, Zack Whedon, Jackie Sibblies Drury, Chris Gabo\nCast\n-\nDr. Paul Weston\n-\nPatrick CavanaughPizza Delivery Guy\n-\nSonya MaddoxMichaela Prince\n-\nJulia\nCreated by Rodrigo Garcia and based on Hagai Levi, Ori Sivan, and Nir Bergman’s Israeli series, In Treatment follows the life of Baltimore psychotherapist Paul Weston (Gabriel Byrne). After starting to question his own ability, Paul seeks out his old mentor, someone he hasn’t seen in a decade, with hopes of rekindling his psychotherapy fire. A sharp, slick series with a penchant for detail, In Treatment never lets go of its dramatic intrigue from the very first episode right through to the finale 13 years later. Across 130 episodes, the show won two Primetime Emmys (among many other awards), although plenty within the fanbase will label that a harsh underachievement for a series of this quality. - Jake Hodges\n‘Industry’ (2020 - Present)\nRotten Tomatoes: 90% | IMDb: 7.2/10\n- Release Date\n- November 9, 2020\n- Network\n- HBO\n- Directors\n- Isabella Eklöf, Tinge Krishnan, Ed Lilly, Birgitte Stærmose, Zoé Wittock, Caleb Femi, Mary Nighy, Konrad Kay, Lena Dunham, Mickey Down\nCreated by Mickey Down and Konrad Kay, Industry is a British-American drama series that follows a group of young finance graduates in London working at Pierpoint & Co, a prestigious investment bank, where they find themselves caught in an intense no-holds-barred competition to stay afloat. Set in the aftermath of the 2008 financial crisis, Industry gives an inside look at the high-pressure world of high finance, the cut-throat competition within the industry’s biggest firms, and its impact on professionals. The series features a large ensemble cast with Marisa Abela, Myha'la Herrold, Harry Lawtey, David Jonsson, and Ken Leung as the main characters. Kit Harington, Sarah Goldberg, and Fady Elsayed joined the cast for the third season. Industry premiered in November 2020 and has had three seasons so far, all critically acclaimed. The show has received great praise for its social critique, crisp narrative, and excellent performances, with a slick and sharp storytelling style that’s often compared to shows like Succession and Billions.\n‘Entourage’ (2004 - 2011)\nRotten Tomatoes: 65% | IMDb: 8.4/10\nThis HBO classic created by Doug Ellin follows Vince Chase (Adrian Grenier), a budding young acting star who heads to Hollywood to soak up his newfound fame. However, he didn’t travel alone, bringing along his titular entourage — with the gang getting into all sorts of mischief that will lead to many a professional problem for Chase. Highly quotable and perfect for binge-watching, Entourage is mightily addictive. From the water-tight scripts to a central group of friends who have endless chemistry, the show ebbs and flows between different comedic styles without ever losing its identity. An awards darling, the show earned a remarkable six Primetime Emmys across eight seasons, with some suggesting that number should be considerably higher. - Jake Hodges\n‘The Fresh Prince of Bel-Air’ (1990 - 1996)\nRotten Tomatoes: 79% | IMDb: 8.3/10\nThe series that put Will Smith on the map, this sitcom follows Smith as the titular Fresh Prince, also called Will Smith, an unruly teen who is sent to live with his strict and wealthy Aunt and Uncle in Bel-Air. Under the guidance of his Uncle, Phil (James Avery), Will learns to grow from a boy into a man, with the series flowing between classic sitcom gags to genuinely heartfelt drama. With so many quotable moments it is impossible to recite them all, The Fresh Prince of Bel-Air is just as brilliant today as it was in the ‘90s. A mask of quick wit hides a terrifically intelligent spine, with the growth of each character into their final form some of the most endearing arcs in sitcom history. Just make sure you’re prepared to have that iconic theme song stuck in your head forever. - Jake Hodges\n‘Kite Man: Hell Yeah!’ (2024 - Present)\nRotten Tomatoes: 89% | IMDb: 7.5/10\n- Release Date\n- 2024 - 2024-00-00\nOut of all the possible characters who could have earned their own Harley Quinn spin-off, no doubt the last person anyone would've ever imagined is Kite Man (Matt Oberg), the wayward, D-list ex-fiance of Poison Ivy (Lake Bell) — and yet it's happened, in a manner so perfect we couldn't have written it better ourselves. Kite Man: Hell Yeah!, which hails from the OG Harley Quinn team of Dean Lorey, Patrick Schumacker, and Justin Halpern, follows our favorite hopeless supervillain Kite Man as he attempts to take his relationship with Golden Glider (Stephanie Hsu) to the next level by saving their favorite Gotham dive bar, Noonan's, from going under. What better way to do that than by coughing up the cash themselves? It turns out that running a bar in the shadow of Lex Luthor's (Lance Reddick) Legion of Doom is a little easier said than done, especially since the duo has to hire a whole new staff to keep the lights on, but if anyone can push through a seemingly insurmountable job with a lot of optimism and a whole lot more \"hell yeah\"s, it's our guy Kite Man. - Carly Lane\n‘Band of Brothers’ (2001)\nRotten Tomatoes: 94% | IMDb: 9.4/10\n- Release Date\n- 2001 - 2001\n- Network\n- HBO\n- Showrunner\n- Steven Spielberg, Tom Hanks\n- Directors\n- David Frankel, David Nutter, Mikael Salomon, Phil Alden Robinson, Richard Loncraine, Tom Hanks\n- Writers\n- Bruce C. McKenna, Graham Yost, John Orloff\nCast\n-\nRichard D. Winters\n-\nDonnie WahlbergC. Carwood Lipton\nThis widely acclaimed miniseries from 2001 follows the harrowing journey of \"E\" Easy Company, 506th Regiment of the 101st Airborne Division during the Second World War. From their days in training to the bloody final days of the war, Band of Brothers depicts the ups and downs of their road to physical victory and emotional loss. Considered by many to be the greatest depiction of war ever put on the small screen, Band of Brothers is a visceral, overwhelming experience that pushed boundaries upon its initial release. A winner of six Primetime Emmys, the series is an emotional rollercoaster that is both faithful to its source material as well as ambitious in its style. Gritty, heartfelt, and deftly designed, Band of Brothers is one of the shows everyone must see once in their lifetime. - Jake Hodges\n'Landscapers' (2021)\nRotten Tomatoes: 98% | IMDb: 7.0/10\nLandscapers\n- Genre\n- Comedy, Crime, Drama\n- Debut Date\n- December 6, 2021\nCreated and written by Ed Sinclair and directed by Will Sharpe, Landscapers is a true crime dark comedy-drama miniseries. The four-episode show is based on the real-life 1998 murders of William and Patricia Wycherley by their daughter Susan and her husband Christopher — a crime that wasn’t unearthed until 2012. Olivia Colman and David Thewlis star as the couple behind the murders, revealing how they came to commit the crime and cover it up for over a decade. Besides Colman and Thewlis, the series also stars Kate O'Flynn, Dipo Ola, Daniel Rigby, Samuel Anderson, Felicity Montagu, and David Hayman. Landscapers received widespread critical acclaim at the time of its release thanks to its performances and inventive storytelling. Colman and Thewlis, in particular, have received great praise for their grounded roles, which anchor this unbelievable story that’s absurd in all the right ways. Landscapers is dark, tragic, strangely humorous, and wildly entertaining — a true crime show that embraces the full oddity of “truth.”\n'John Adams' (2008)\nRotten Tomatoes: 82% | IMDb: 8.4/10\nBased on the Pulitzer Prize-winning biography by David McCullough, John Adams follows the ups, downs, and in-betweens of the life of the Founding Father John Adams (Paul Giamatti). The series begins with the Boston Massacre of 1770 and follows his rise through the political ranks all the way until his untimely death in 1826. There is no way of describing John Adams other than a masterpiece. A severely underrated miniseries from the noughties, the show was both publicly and critically acclaimed upon its arrival, thanks in no small part to Giamatti delivering one of his best performances as the titular Founding Father. A poignant, captivating show, John Adams went on to win a staggering 13 Primetime Emmys for just seven episodes. - Jake Hodges\n'Six Schizophrenic Brothers' (2024)\nRotten Tomatoes: 62% | IMDb: 7.2/10\nSix Schizophrenic Brothers\n- Genre\n- Documentary\n- Debut Date\n- June 10, 2024\nThis captivating documentary follows the life of an average family, which, from the outside, seems as normal as any other all-American unit. However, the truth behind the twelve Galvin siblings is that an incredible six of them have schizophrenia, leaving the family broken and desperate for change. Not just an intriguing central study, Six Schizophrenic Brothers is also a powerful character examination, with the emphasis put on them as people and not simply as objects of fascination. There is no intention to provide answers to the terribly common problem of mental health affecting family units, but instead, its purpose is to raise awareness, with this documentary likely to find a home in the hearts of millions who can relate. - Jake Hodges\n'Fantasmas' (2024)\nRotten Tomatoes: 96% | IMDb: 6.6/10\nCreated by and starring Julio Torres, Fantasmas follows the actor as himself, directly following the loss of his golden oyster earring. Having to hunt it down in a bustling New York City, Julio encounters all manner of idiosyncratic people along the way. A wonderfully unique and refreshing series, Fantasmas is a surrealistic piece of artistic expression borne from the mind of a true creative. Brimming full of unforgettable characters and neat quirks, the show is also a visual delight, with cinematographer Sam Levy taking Julio’s avant-garde mission statement and finding its harmonic aesthetic. Unlike anything else of Max, Fantasmas is for those bored of the same formulaic series. - Jake Hodges\n'Ren Faire' (2024)\nRotten Tomatoes: 100% | IMDb: 6.7/10\nRen Faire\n- Genre\n- Documentary\n- Debut Date\n- June 2, 2024\nWhen the ailing king of America's largest renaissance festival declares his retirement, an epic power struggle ensues between an actor, a former elephant trainer, and a kettle-corn kingpin to claim his throne.\nThis Max docu-series follows a fight for power triggered by the retirement of the king of America's largest Renaissance festival, King George Coulam. After vacating his throne to focus on romance, the fight is on between three of his biggest allies to claim a seat at the head of the table. The impressive power of the documentary medium is on full display in Ren Faire, with the levels to which the trio are willing to go to win the throne nothing short of a classic Greek or Shakespearean tragedy. Not just a fascinating tale, Ren Faire is also an aesthetic delight, with the cinematography worthy of plenty of admiration. A tale unlike any other, Ren Faire is one of the best new docu-series available on streaming. - Jake Hodges\n'My Adventures with Superman' (2023 - Present)\nRotten Tomatoes: 98% | IMDb: 7.7/10\n- Release Date\n- July 6, 2023\n- Network\n- Adult Swim\n- Showrunner\n- Jake Wyatt\n- Directors\n- Jen Bennett, Diana Huh, Christina Manrique\n- Franchise(s)\n- Superman, DC Universe\nCast\n-\nAlice Lee\nThis animated addition to the Superman story follows a young Clark Kent, voiced by Jack Quaid, as he slowly builds his new identity as a superhero. With Metropolis under his watchful eye, Kent is able to fight off any physical opponent — that is until he meets any young person’s greatest foe: their own coming-of-age. A wonderful blend of teen angst and great superhero animation, My Adventures with Superman is both a terrific ode to the legacy of one of media’s greatest heroes and a refreshing addition to modern television. Aesthetically delightful and oozing charisma, there’s no wonder this series so quickly returned for a second season. - Jake Hodges\n'The Big Bang Theory' (2007 - 2019)\nRotten Tomatoes: 81% | IMDb: 8.1/10\n- Release Date\n- 2007 - 2019-00-00\n- Network\n- CBS\n- Showrunner\n- Mark Cendrowski\n- Directors\n- Mark Cendrowski\n- Writers\n- Chuck Lorre, Bill Prady\nCast\n-\nLeonard Hofstadter\n-\nSheldon Cooper\nBefore there was Young Sheldon, there was The Big Bang Theory, one of the 21st century’s most-watched sitcoms. The series follows a group of typically nerdy friends, headlined by roommates Sheldon (Jim Parsons) and Leonard (Johnny Galecki), as they navigate the social stigma and romantic embarrassment that comes with working in science and loving video games. However, all that is about to change when Kaley Cuoco’s Penny moves in across the hall. For better or for worse, The Big Bang Theory’s impact on modern television cannot be understated, with the show’s plethora of memorable characters imprinting catchphrases and funny moments into millions of minds. A winner of 10 Primetime Emmys, all aspects of this series are beloved by its dedicated fanbase, from the intricate central relationships to the iconic theme song. - Jake Hodges\n'Smiling Friends' (2020 - Present)\nRotten Tomatoes: 94% | IMDb: 8.5/10\n- Release Date\n- April 1, 2020\n- Network\n- Adult Swim\n- Directors\n- Zach Hadel, Michael Cusack, Jeff Liu\nCast\n-\nMichael CusackPim Pimling / Allan Red (voice)\n-\nZach HadelCharlie Dompler / Glep (voice)\nAn adult animated television series, Smiling Friends follows the misadventures of a small company dedicated to spreading happiness — no matter how bizarre their customers’ demands may be. The series was created by Zach Hadel and Michael Cusack, who also voice many of the main characters. The show presents odd-couple employees dealing with darkly comedic situations through a surreal mix of styles and techniques, including rotoscoping, CGI, and live-action. Smiling Friends premiered on AdultSwim in 2022 to critical acclaim. The show was soon renewed and debuted its second season on April 1, 2024. Smiling Friends is an entertaining watch for fans of adult animation, presenting the most random comedy you’ll ever see but balanced with a lot of heart. The series has been praised for its creepy character designs and absurd sense of humor. It’s an unsettling, chaotic show that will weird you out even as it makes you laugh out loud.\n'Pretty Little Liars' (2022 - Present)\nRotten Tomatoes: 90% | IMDb: 7.0/10\n- Release Date\n- 2022 - 2024-00-00\n- Network\n- HBO Max\n- Showrunner\n- Roberto Aguirre-Sacasa\n- Directors\n- Roberto Aguirre-Sacasa\n- Writers\n- Roberto Aguirre-Sacasa\nCast\n-\nChandler Kinney\n-\nMallory Bechtel\n-\nZaria\nA legacy sequel/soft reboot of the iconic Freeform show, Pretty Little Liars is a teen drama slasher series created by Roberto Aguirre-Sacasa and Lindsay Calhoon Bring. Starring Bailee Madison, Chandler Kinney, Zaria, Malia Pyles, and Maia Reficco, the show follows five teenage girls in Millwood, Pennsylvania, who team up to investigate cryptic messages from the mysterious \"A,” who reveals buried secrets from their mothers’ pasts. The first season, titled Pretty Little Liars: Original Sin, was released in 2022, and Season 2, Pretty Little Liars: Summer School, premiered its first two episodes on May 9, 2024. While it’s hardly the first spin-off of a 2010s show, the new Pretty Little Liars is a well-crafted addition to the franchise that’s been praised for its characterizations and compelling mystery. The series harkens back to what made the original show so entertaining, balancing its teen drama with a solid slasher story. A thrilling watch from start to finish, Original Sin received near-universal acclaim from critics, and the second season, currently ongoing, is already shaping up to be even better than the first.\n'The Girls on the Bus' (2024)\nRotten Tomatoes: 55% | IMDb: 6.3/10\nInspired by Amy Chozick's 2018 memoir Chasing Hillary, The Girls on the Bus is a political drama television series co-created by Chozick and Julie Plec. The series follows four female journalists covering a presidential campaign trail while juggling love, friendship, and scandal. The show stars Melissa Benoist, Carla Gugino, Christina Elmore, Natasha Behnam, and Brandon Scott. With mixed to positive reviews from critics, The Girls on the Bus is an enjoyable if somewhat idealistic political drama. The show has been favorably compared to series like The Bold Type and Sex Lives of College Girls for its depiction of female friendships, and that’s a big part of what makes The Girls on the Bus an engaging watch. The star-studded cast delivers brilliant performances, bringing varied perspectives to its timely subject. Overall, it’s a smart, funny show with likable characters and an honest approach to the world of political journalism.\n'Conan O'Brien Must Go' (2024)\nRotten Tomatoes: 78% | IMDb: 8.5/10\nAs the title suggests, Conan O'Brien Must Go is a travel show that follows the beloved former late-night host on a series of adventures around the world. The reality series builds off O’Brien’s podcast Conan O'Brien Needs a Friend and shows O'Brien traveling to Norway, Argentina, Thailand, and Ireland to meet fans who were previously featured on the podcast via video calls. Conan O’Brien Must Go has received largely favorable reviews from critics, with Collider’s Tania Hussain calling it an \"inventive and wildly hilarious series”. It’s not exactly a by-the-books travel show; instead, the series uses O’Brien’s signature sense of humor to parody such generic travelogues while still having some fun in interesting new places. At only four episodes long, the series is great for a quick, easy binge-watch — especially if you’re a fan of the star’s particular brand of comedy.\n'The Sympathizer' (2024)\nRotten Tomatoes: 79% IMDb: 7.3/10\nThe Sympathizer is a historical black comedy drama miniseries that follows a North Vietnam spy living in a South Vietnam refugee community in the US, where he continues to report back to the Viet Cong. Director Park Chan-wook and Don Mckellar are credited as co-creators and co-showrunners of the series, which is based on Viet Thanh Nguyen’s eponymous 2015 Pulitzer Prize-winning novel. Hoa Xuande leads the show’s stellar cast as the main character, the Captain, with Robert Downey Jr. as a series regular and Sandra Oh, David Duchovny, and John Cho in recurring roles. With a masterful director behind the camera and a stellar cast in front of it, The Sympathizer has received largely positive reviews from critics upon its debut on HBO and Max, especially for the performance of its star, Hoa Xuande. Robert Downey Jr. delivers a can’t-miss performance as well, appearing as several antagonists. A fascinating, darkly satirical show, The Sympathizer offers a unique perspective on the Vietnam War courtesy of some of the brightest minds in the industry.\n'The Regime' (2024)\nRotten Tomatoes: 55% | IMDb: 6.1/10\n- Release Date\n- 2024 - 2024-00-00\n- Showrunner\n- Will Tracy\n- Directors\n- Stephen Frears\n- Writers\n- Will Tracy\nCast\n-\nKate Winslet\nCreated by Will Tracy (Succession), The Regime is a satirical miniseries about a dictator’s tenuous rule over a fictional Central European country. The show stars Kate Winslet in the lead role, with a star-studded supporting cast that includes Matthias Schoenaerts, Guillaume Gallienne, Andrea Riseborough, Martha Plimpton, and Hugh Grant. The six-episode series was released on HBO and Max, with the first episode arriving on March 3, 2024, and the finale released on April 7. The Regime received somewhat mixed reviews from critics, and its plotting and tone are a bit uneven, but what makes this show worth the watch is Kate Winslet’s performance as tyrant-under-fire Elena Vernham. The supporting cast are no slackers either, delivering engaging performances that keep you interested even when the show’s story gets a bit shaky. It’s not the biting political comedy that it aspires to be, but if what you’re in the mood for is a funny, well-acted satire with high production value, then The Regime is the show for you.\n'Quiet on Set: The Dark Side of Kids TV' (2024)\nRotten Tomatoes: 100% | IMDb: 7.8/10\nQuiet on Set: The Dark Side of Kids TV is a five-part docuseries that exposes the toxic behind-the-scenes world of children's television programs. Focusing on the late 1990s and early 2000s, the series primarily follows Dan Schneider's time at Nickelodeon as a producer and showrunner, revealing shocking stories of abuse, misogyny, and a hostile work culture. Directed by Mary Robertson and Emma Schwartz, Quiet on Set is loosely based on a 2022 Business Insider article. The show has received near-universal acclaim from audiences and critics. While audience members may be aware that child stars have often been targets of abuse in the industry, Quiet on Set takes that vague awareness and makes it tangible, with concrete facts and real stories. The show approaches its subjects with respect, keeping the focus firmly on those who have previously been silenced to maintain a “kid-friendly” image. The series has had a very real impact, with the online discussions it has sparked leading to Schneider releasing an apology and many of those who wrote letters in support of sex offender Brian Peck during his trial publicly reversing their support.\n'The Way Down' (2021)\nRotten Tomatoes: 80% | IMDb: 7/10\n- Release Date\n- September 30, 2021\n- Directors\n- Marina Zenovich\n- Main Genre\n- Documentary\nWhen a cult documentary is able to amp up the tension by such small increments that the audience can find sympathy with those who found themselves in the cult, it is a masterful achievement. The Way Down does just this, beginning as a slow burn that, by the end, becomes a wild bonfire. The documentary details the acts of church leader Gwen Shamblin in Franklin, Tennesse, as she started with what seemed like an honest mission to help her community find health and faith but that ended in a murder and Shamblin's own death.\nPremiering on HBO in 2021, the five-episode series achieves what many films and television shows have failed to do in the past: show an accurate portrayal of disordered eating and the manipulation and denial that accompany it. When Shamblin's church moved from Bible study to focus on her \"Weigh Down Workshop,\" a book that detailed a diet that claimed it would bring its followers closer to God if they lost weight, the control she found over her followers was astounding. Her iron fist led to disordered eating, health issues, and an incredible amount of pressure on those who couldn't become as thin as Shamblin wanted. Executive producer and director Marina Zenovich (Robin Williams: Come Inside My Mind) does a terrific job marrying that subject matter with Shamblin's harsh views on disciplining children, as well as that of her personal life and her bizarre marriage to a struggling actor. Adding a darkly ironic twist, as the tension of Shamblin's life gets higher, so does her incredibly teased hair. - Emily Cappello\n'South Side' (2019 - 2021)\nRotten Tomatoes: 100% | IMDb: 8.2/10\nCreated by Bashir Salahuddin and Diallo Riddle, South Side tells the story of two best friends who have a goal to succeed as businessmen. The main characters, Simon and Kareme, played by Sulta Salahuddin (Black-ish) and Kareme Young (The Chi), respectively, recently graduated from community college and are working at a rent-to-own store. Premiering in 2019 on Comedy Central, the show ran for three seasons and also starred Chandra Russel (Sherman's Showcase), Bashir Salahuddin (Top Gun: Maverick), Quincy Young (Vitamin C), and Zuri Salahaddin (The Sound of Shadows).\nWith a homemade mockumentary feel, the show delivers just as many heartwarming moments as it does funny ones. The antics that our heroes get into are all in an honest attempt to make their lives better and that of their families and loved ones. The inclusion of Simon and Kareme's families creates moments of reality in their otherwise chaotic lives and leaves viewers understanding the method behind their business madness. - Emily Cappello\n'Smartless on the Road' (2023)\nIMDb: 8.2/10\n- Release Date\n- 2023 - 2023-00-00\n- Directors\n- Sam Jones\nNo one, and I mean no one, could've predicted the absolute cultural phenomenon that now is podcasts. Not too long ago, the audio format was largely made fun of for being overdone and dorky. That was, until celebrities entered the picture, including Sean Hayes (Will and Grace), Will Arnett, and Jason Bateman (both from Arrested Development). This seemingly random trio entered the podcasting world not too long ago with their show Smartless, which has now become one of the most popular comedy podcasts of all time. The premise of the show begins when one of the hosts describes the guest to the other two, who are unaware of who they'll be speaking with that day. Chaos and comedy ensues.\nNow, with HBO's Smartless on the Road, fans are treated to a behind-the-scenes look into the powerhouse podcast as it tours the country on a sold-out live recording tour. With special guests like Conan O'Brien (Conan), Matt Damon (Air), Mark Cuban (Shark Tank), and Kevin Hart (Ride Along), the docuseries is consistently entertaining. - Emily Cappello\n'Mildred Pierce' (2011)\nRotten Tomatoes: 81% | IMDb: 7.6/10\n- Release Date\n- 2011 - 2011-00-00\n- Network\n- HBO\n- Writers\n- Jonathan Raymond\nCast\n-\nKate WinsletMildred Pierce\n-\nMonte Beragon\nBased on the James M. Cain novel of the same name, Mildred Pierce is an HBO miniseries starring Kate Winslet (Titanic) in the titular role of Mildred, a newly divorced woman attempting to start a restaurant during the Great Depression. Mildred also has to deal with her narcissistic daughter, Veda, played by Evan Rachel Wood (Westworld), and her new love interest, Monty, played by Guy Pearce (Memento).\nThe show was created and directed by Todd Haynes, whose most recent film, May December, just snagged an Oscar nomination for Best Original Screenplay. The series won two Golden Globe Awards (for the performances by Winslet and Pearce) and three Emmys, including direction by Haynes. The show also starred Brian F. O'Bryne (Million Dollar Baby), Melissa Leo (The Fighter), James Le Gros (Certain Women), Mare Winningham (Turner & Hooch), and Marin Ireland (Homeland). It was well-received by critics, including horror novelist Stephen King, who particularly praised Winslet's performance. - Emily Cappello\n'How To...With John Wilson' (2020 - 2023)\nRotten Tomatoes: 100% | IMDb: 8.7/10\n- Release Date\n- October 23, 2020\nCast\n-\nJohn Wilson\n- Creator\n- John Wilson\nComedian John Wilson (Diner) plays himself in this documentary series as he gives New Yorkers advice on all aspects of life. Each 25-minute episode follows Wilson as he gives new tips while also dealing with issues in his own world. Topics range from \"How To Make Small Talk\" to \"How To Cover Your Furniture,\" \"How To Appreciate Wine\" to \"How To Find a Public Restroom.\" Writers on the show include Wilson, Michael Korman (Nathan For You), Alice Gregory (Girls), Conner O'Malley (Palm Springs), Susan Orlean (Adaptation.), and Allie Viti (The Rehearsal). While Wilson has writers on the show, much of each episode becomes improvised by himself and his guests.\nExecutive produced by Nathan Fielder (The Curse), the show has the same dark, quirky humor as Fielder's other projects, including Nathan For You and The Rehearsal. While How To draws audiences in with its comedy premise, each episode brings out a deeper conversation that leaves viewers with something bigger to think about. - Emily Cappello\n'South Park' (1997 - Present)\nRotten Tomatoes: 80% | IMDb: 8.7/10\n- Release Date\n- August 13, 1997\n- Network\n- Comedy Central\n- Showrunner\n- Trey Parker\n- Directors\n- Adrien Beard\n- Writers\n- David A. Goodman, Nancy M. Pimental, Kenny Hotz, Philip Stark, Dave Weasel, Dan Sterling, Susan Hurwitz Arneson, Trisha Nixon, David R. Goodman, Tim Talbott, Pam Brady, Robert Lopez, Dani Michaeli, Kyle McCulloch, Karey Dornetto, Jonathan Kimmel, Jane Bussmann\nCast\n-\nEric Cartman / Stan Marsh (voice)\n-\nKyle Broflovski / Kenny McCormick (voice)\nOn television since 1997, South Park is a cultural phenomenon. Named by TV Guide as one of the 10 Greatest TV Cartoons of All Time, the show was created by Trey Parker and Matt Stone and is known for its profanity and often dark humor. The show has four main characters, who are all young boys: Stan, Kyle, Eric, and Kenny. Parker and Stone voice many of the characters, including the leads.\nDue to its unique writing style, no episodes of the show are written before the season starts. Instead, writing for each episode begins after the last one has aired and continues for several days until it's completed and ready to air. This way, South Park is always on top of all current events, and each week's episode is something that has just happened in the world, either in pop culture or the larger news cycle. The show has now had over 300 episodes. Originally developed by Comedy Central, Max attained the streaming rights to South Park in 2020. - Emily Cappello\n'Righteous Gemstones' (2019 - Present)\nRotten Tomatoes: 88% | IMDb: 8.1/10\n- Release Date\n- 2019 - 2025-00-00\n- Network\n- HBO\n- Showrunner\n- Danny McBride\n- Directors\n- Danny McBride\n- Writers\n- Scott MacArthur\nCast\n-\nDanny McBrideJesse Gemstone\n-\nEli Gemstone\nIt is rare that a show is as perfectly cast as the ensemble of The Righteous Gemstones. The acting is so insanely good, in fact, that you may find yourself in disbelief that the show isn't a documentary. The show, created by Danny McBride (Pineapple Express) and executive produced and often directed by David Gordon Green (Pineapple Express), the show follows the Gemstone family, made up of father Eli Gemstone (John Goodman) and children Jesse (McBride), Kelvin (Adam DeVine), and Judy (the incomparable Edi Patterson). Also along for the wild ride is Jesse's wife Amber (Cassidy Freeman), Judy's insanely dorky and lovable husband BJ (Tim Baltz), and Kelvin's incredibly loyal friend (and love interest) Keefe (Tony Cavalero).\nThe Gemstones run a mega-church that was started by Eli and his late wife Aimee-Lee (singer Jennifer Nettles), with his three children constantly butting heads over who will run it once their father retires. Eli deals with an adoring community, rival mega-churches, and his own family. Each season surpasses the last, and with a fourth season in production, fans hopefully won't have to wait much longer to hear a sermon by their favorite imperfect TV family. - Emily Cappello\n'The Knick' (2014 - 2015)\nRotten Tomatoes: 92% | IMDb: 8.5/10\n- Release Date\n- 2014 - 2015-00-00\n- Network\n- Cinemax\n- Showrunner\n- Jack Amiel\n- Directors\n- Steven Soderbergh\n- Writers\n- Steven Katz, Jack Amiel, Michael Begler\nCast\n-\nDr. John Thackery\n-\nDr. Algernon Edwards\n-\nZuzanna SzadkowskiNurse Pell\n-\nDanya LaBelleMrs. Lefkowitz\nA look at the professional and personal lives of the staff at New York's Knickerbocker Hospital during the early part of the twentieth century.\nA Cinemax period piece, The Knick tells the story of the staff at New York's Knickerbocker Hospital in the early 1900s. The conflicts these characters face include a lack of hospital funding, racial tensions, and almost medieval medical techniques. Created by Jack Amiel (The Prince and Me) and Michael Begler (Raising Helen), the show starred André Holland (Moonlight), Clive Owen (Children of Men), Jeremy Bobb (Russian Doll), Juliet Rylance (Sinister), Eve Hewson (Robin Hood), Michael Angarano (Wild Card), Cara Seymour (American Psycho), and Eric Johnson (Vikings).\nOwen's character, Dr. John Thackery, was partially inspired by William Stewart Halsted, a historical figure known for being an early believer in anesthetics. In The Knick, Dr. Thackery deals with a cocaine and opium addiction while attempting to choose his ambition towards his career over his disease. The show was a favorite among audiences and critics, running for three seasons and ending in 2015. - Emily Cappello\n'Curb Your Enthusiasm' (2000 - Present)\nRotten Tomatoes: 92% | IMDb: 8.8/10\n- Release Date\n- 2000 - 2024-00-00\n- Network\n- HBO Max\n- Showrunner\n- Jeff Schaffer\n- Directors\n- Robert B. Weide, Larry Charles, David Steinberg, Bryan Gordon, Alec Berg, Andy Ackerman, David Mandel, Barry Gordon, Cheryl Hines, Dean Parisot\n- Writers\n- Jeff Schaffer, Larry David\nCast\n-\nLarry David\n-\nJeff Greene\nThe life and times of Larry David and the predicaments he gets himself into with his friends and complete strangers.\nSince its premiere in October of 2000, Curb Your Enthusiasm has taken the comedy world by storm. Created by and starring Larry David, the show follows a fictionalized version of David as he goes through the world with his friends and those he has yet to meet. The series also stars Jeff Garlin (Safety Not Guaranteed), Cheryl Hines (The Ugly Truth), Susie Essman (Cop Out), and J.B. Smoove (Spider-Man: Far From Home). Other star-studded appearances include Julia Louis-Dreyfus (Seinfeld), Vince Vaughn (The Internship), Jerry Seinfeld (Seinfeld), Lou DiMaggio (NCIS), Ben Stiller (Tropic Thunder), and Mel Brooks (Spaceballs), just to name a few.\nFocusing on the little things that happen in everyday life, Curb Your Enthusiasm is outlined by David and largely improvised during filming. The show has been nominated for 47 Emmy Awards, most notably its Outstanding Comedy Series nominations for 10 out of its 12 seasons. While the show didn't air from 2012 to 2016, it returned in 2017 for its ninth season and was renewed for a 12th and final season that's airing in February of 2024. - Emily Cappello\n'Boardwalk Empire' (2010 - 2014)\nRotten Tomatoes: 92% | IMDb: 8.6/10\n- Release Date\n- 2010 - 2014-00-00\n- Showrunner\n- Terence Winter\n- Directors\n- Timothy Van Patten, Allen Coulter\n- Writers\n- Terence Winter, Nelson Johnson\nAn Atlantic City politician plays both sides of the law by conspiring with gangsters during the Prohibition era.\nStarring Steve Buscemi (Fargo) in one of his best roles ever, Boardwalk Empire tells the story of Nucky Thompson (Buscemi), a treasurer in Atlantic City, New Jersey, who works both sides of the law during the 1920s Prohibition era. Working for the city, Nucky has relationships with the mob as well as politicians, so he is able to manipulate others in order to keep up his lavish lifestyle.\nCreated by Terence Winter (The Sopranos), Boardwalk Empire is an hour-long drama that ran for five seasons on HBO and was a critical success. The show also stars Kelly Macdonald (No Country For Old Men), Michael Shannon (Take Shelter), Shea Whighman (Splinter), Stephen Graham (Boiling Point), Vincent Piazza (Jersey Boys), Michael Kenneth Williams (The Wire), and Paul Sparks (House of Cards). With plenty of blurred moral lines and compelling characters, the show drew audiences in for its complexity and depiction of a complicated time in history. - Emily Cappello\n'Lovecraft County' (2020)\nRotten Tomatoes: 88% | IMDb: 7.1/10\n- Release Date\n- 2020 - 2020-00-00\n- Network\n- HBO\n- Showrunner\n- Misha Green\n- Directors\n- Daniel Sackheim, Cheryl Dunye\n- Writers\n- Misha Green\nCast\n-\nGeorge Freeman\n-\nLetitia ‘Leti’ Lewis\nBased on the book by Matt Ruff, HBO's Lovecraft Country is set in the 1950s and follows Atticus Freeman, his friend Letitia Lewis, and his uncle George as they set off to find his missing father in the Jim Crow South. During their search, they discover monsters similar to H.P. Lovecraft creatures and that Atticus is the descendant of Samuel Braithwhite, the former leader of the Order of the Ancient Dawn. Together, Atticus and his family and friends must defeat Christina, the last daughter of the Braithwhite line, before she sacrifices Atticus and claims his family's magic for her own.\n- Seasons\n- 1\nCreated by Misha Green and based on the 2016 novel of the same name by Matt Ruff, Lovecraft Country is set in the 1950s and follows Atticus \"Tic\" Freeman (Jonathan Majors), a young African-American man and avid sci-fi fan. After receiving a letter from his missing father, Montrose (Michael K. Williams), Tic, along with his uncle George (Courtney B. Vance) and friend Letitia \"Leti\" Lewis (Jurnee Smollett), embarks on a road trip to find him. As they travel across the racially segregated United States, encountering both overt and supernatural racism, the group discovers that Lovecraftian horrors from the world of H.P. Lovecraft's fiction are not the only threats they face.\nEven though HBO canceled the show after just one season, Lovecraft Country stands as a perfect example of what can be accomplished when one embraces the limitless potential that comes with diversity. It's not only a grand, fantastical, and pulpy horror series, but at every moment, it remains rooted in recognizable experiences and genuine emotions. Additionally, Majors delivers an outstanding performance, seamlessly blending statuesque physicality with an emotive and expressive face. His portrayal adds depth to a role that could easily veer into cartoonish fantasy. - Jessie Nguyen\n'Scenes from a Marriage' (2021)\nRotten Tomatoes: 83% | IMDb: 8.1/10\n- Release Date\n- 2021 - 2021-00-00\n- Network\n- HBO Max\nCast\n-\nTovah Feldshuh\n- Seasons\n- 1\nScenes from a Marriage is a miniseries that originally aired in 1973 on Swedish television and gained international acclaim for its insightful exploration of the complexities of marital relationships. In 2021, an English-language adaptation of the same name was released on HBO starring Jessica Chastain and Oscar Isaac. The series follows the evolving relationship between Jonathan and Mira over several years, with the narrative divided into five episodes, each depicting crucial moments in their marriage.\nWhile the 2021 version of Scenes From a Marriage might be seen as an unnecessary remake, the stellar performances of Chastain and Isaac elevate it to a point where it feels indispensable. The success of the show hinges on the exceptional chemistry and masterful performances of the leading couple, who flawlessly deliver poignant and charged dialogue as the marriage begins to unravel. While this isn't a novel theme to delve into, the series remains an intelligent and insightful examination of modern relationships. With potent dialogue and meticulously crafted characters, it stands as a compelling rival to Marriage Story in terms of raw emotive power and evokes shades of Closer for its painful, unspoken truths. - Jessie Nguyen\n'Six Feet Under' (2001 - 2005)\nRotten Tomatoes: 81% | IMDb: 8.7/10\n- Seasons\n- 5\nCreated by Alan Ball, Six Feet Under revolves around the Fisher family, who owns and operates Fisher & Sons Funeral Home in Los Angeles. The patriarch of the family, Nathaniel Fisher Sr. (Richard Jenkins), dies in a tragic accident, and his death sets the stage for the unfolding narrative. Each episode typically begins with a death, often unrelated to the Fisher family, and explores the impact of mortality on the characters' lives.\nSix Feet Under boasts numerous commendable aspects, such as outstanding performances, skillful direction, and inventive storytelling that incorporates various techniques, including dream sequences and parody commercials. The characters in the show experience substantial growth and confront authentic challenges, rendering them relatable and captivating. Furthermore, despite the seemingly somber subject matter, the show effectively engenders a sense of inclusivity, enveloping viewers in a universal narrative and emotions as they navigate grief and life after the loss of loved ones. Six Feet Under also promptly establishes its comprehension of loss by depicting the distinct initial reactions of each family member. Additionally, what's remarkable about Six Feet Under is how the audience’s perception of it can shift depending on their life stage. - Jessie Nguyen\n'Chernobyl' (2019)\nRotten Tomatoes: 95% | IMDb: 9.3/10\n- Release Date\n- 2019 - 2019\n- Network\n- HBO\n- Showrunner\n- Craig Mazin\n- Directors\n- Johan Renck\n- Writers\n- Craig Mazin\nCast\n-\nValery Legasov\n-\nBoris Shcherbina\n- Seasons\n- 1\nChernobyl unfolds at the time of the titular tragedy in April 1986 as a devastating explosion at a nuclear power station leaves thousands of lives at risk. This story takes place in the subsequent days following the disaster and looks in detail at the lives of all involved, from those caught in the tragedy and those who sought to save others.\nWidely regarded as one of the greatest miniseries of all time,The epitome of tension, Chernobyl is a mind-blowing, gutwrenching tale made all the more visceral because of its truth. Starring the likes of Jessie Buckley and Jared Harris, the story weaves in and out from one tearjerking scene to another, with a set of episodes that will barely give you time to catch your breath. Thanks to its awe-inspiring production design and dedication to realism, the series bagged itself a total of 10 Primetime Emmys among a plethora of other awards — a staggering feat, seeing as it is only five episodes long. - Jake Hodges\n'Telemarketers' (2023)\nRotten Tomatoes: 96% | IMDb: 7.4/10\n- Release Date\n- 2023\n- Main Genre\n- Documentary\nDirected and produced by Adam Bhala Lough and Sam Lipman-Stern, this three-part documentary series follows two telemarketers as they begin to discover the ugly truth of the very industry they work in. With the company having just shut down, the duo uses their lack of consequence to dive deeper into the inner workings of the business and discover that what they once thought were charitable reasons for raising money actually hid an uncomfortable truth.\nLike all good documentaries, Telemarketers weaves together its central story like a gripping crime novel, with every piece of evidence eventually coming together to reveal something sinister. However, unlike some documentaries, Telemarketers feels painfully close to home, with this story just one of many that have likely affected the lives of millions. A raw and unapologetic dive into the greed of corporate capitalism, Telemarketers is an eye-opening series that never fails to drop your jaw to the floor. - Jake Hodges\n'Adventure Time: Fionna and Cake' (2023 - Present)\nRotten Tomatoes: 100% | IMDb: 8.9/10\n- Release Date\n- 2023 - 2023-00-00\n- Network\n- HBO Max\n- Showrunner\n- Adam Muto\nCast\n-\nMadeleine Martin\n-\nRoz Ryan\n-\nTom Kenny\nFionna, her best friend Cake and the former Ice King, Simon Petrikov, embark on an adventure through the multiverse, dodging new threats and making self-discoveries along the way.\n- Seasons\n- 2\nThis spin-off of the hit animation series Adventure Time follows the titular Fionna (Madeleine Martin) and Cake (Roz Ryan) as they embark on a wild adventure that will take them through the multiverse to discover more about their friendship and themselves. However, what seems like a touching journey has a sinister secret hiding in the dark as an evil villain lurks, waiting to strike and remove their very beings from existence.\nAdventure Time has a die-hard fanbase, so the extent to which this new series has been celebrated by them should be a testament to its success. Adventure Time: Fionna and Cake benefits from the same eye-catching animation style and dream-like storytelling as the original — only this time, it doesn’t shy away from edging towards a more complex narrative. Both Madeleine Martin and Roz Ryan bring joy and humility to their performances, helping to create a world that just has to be seen to be believed. - Jake Hodges\n'Winning Time: The Rise of the Lakers Dynasty' (2022 - 2023)\nRotten Tomatoes: 83% | IMDb: 8.3/10\n- Release Date\n- 2022 - 2023-00-00\n- Network\n- HBO Max\n- Showrunner\n- Max Borenstein\n- Directors\n- Salli Richardson-Whitfield, Tanya Hamilton\n- Writers\n- Max Borenstein, Rodney Barnes\nCast\n-\nQuincy Isaiah\nThe series delves into the transformation of a famous basketball team during the 1980s, highlighting the behind-the-scenes business decisions, flamboyant personalities, and cultural impact that led to their national fame. It captures the personal and professional challenges faced by players and executives alike.\nThis Primetime Emmy-nominated biographical sports drama follows the astronomical rise of the Lakers after the number 1 overall pick of Magic Johnson in the 1979 draft. Detailing their decade of dominance in the 1980s, the series documents both the highs and lows of one of the sport’s most star-studded teams, including both the on- and off-court drama that led to their triumph and eventual downfall.\nStarring John C. Reilly as Jerry Buss, Winning Time: The Rise of the Lakers Dynasty is a life-affirming series that thrives thanks to a central story of defeating the odds. Like any good sports story, the show weaves between the perilous depths of defeat and the euphoric highs of victory, providing a rollercoaster ride through the spectrum of human emotion. Often tense and always thrilling, this series truly makes you feel like one of the team. - Jake Hodges\n'A Black Lady Sketch Show' (2019 - 2023)\nRotten Tomatoes: 100% | IMDb: 7.5/10\n- Release Date\n- 2019 - 2023-00-00\n- Showrunner\n- Robin Thede\n- Writers\n- Robin Thede, Lauren Ashley Smith, Chloé Hilliard\nCast\n-\nGabrielle Dennis\n-\nAshley Nicole Black\n-\nLaci Mosley\n-\nRobin Thede\n- Seasons\n- 4\nDoing exactly what it says on the tin, A Black Lady Sketch Show stars Robin Thede in her very own sketch comedy series that also features the likes of Quinta Brunson, Laci Mosley, and Ashley Nicole Black, as well as many guest stars. From women running away from an ominous fog to a surprise trip in a hot air balloon, no scenario-based stone is left unturned.\nFor many, sketch comedy is light-hearted entertainment, but for Robin Thede and the team behind A Black Lady Sketch Show, it is a pioneering voice for change in a comedic sub-genre long dominated by white men. Refreshingly, the entire cast shines in each of the 24 episodes, with everyone getting their moment to deliver a killer punchline or two. Intelligent, fast-paced, and always surprising, this is one of modern television’s best sketch shows. - Jake Hodges\n'Pushing Daisies' (2007)\nRotten Tomatoes: 96% | IMDb: 8.4/10\n- Main Genre\n- Drama\n- Seasons\n- 2\nCreated by Bryan Fuller, this multi-award-winning series follows Lee Pace’s Ned, an ordinary pastry chef who holds the extraordinary ability to, with just one touch, bring people back from the dead. However, these people can only be reborn for one minute, or their existence will start to cause the deaths of others. Alongside his resurrected former lover, a PI, and an endearing waitress, the gang uses this most unique of abilities to help solve a host of quirky and mysterious murders.\nA winner of seven Primetime Emmys, Pushing Daisies has a fascinating, unique premise that delivers on its promise of intriguing fun and eyebrow-raising drama. Powered by a consistent set of highly intelligent scripts, Lee Pace and the rest of the ensemble look to be having the time of their lives in each episode — a joyous feeling that certainly translates from the screen to the audience’s hearts. Fanciful, funny, and unlike anything else, it is just a shame the series ended so abruptly after just two seasons. - Jake HodgesWatch on Max\n'Somebody Somewhere' (2022 - Present)\nRotten Tomatoes: 100% | IMDb: 8.1/10\n- Release Date\n- 2022 - 2024-00-00\n- Network\n- HBO Max\n- Writers\n- Hannah Bos, Paul Thureen, Patricia Breen\nCast\n-\nJeff Hiller\nSam is a true Kansan on the surface but beneath it all struggles to fit the hometown mold. As she grapples with loss and acceptance, singing is Sam’s saving grace and leads her on a journey to discover herself and a community of outsiders that don’t fit in but don’t give up, showing that finding your people, and finding your voice, is possible. Anywhere. Somewhere.\n- Creator\n- Hannah Bos, Paul Thureen\nThis tear-jerking comedy/drama follows Bridget Everett as Sam, a woman now in her 40s who desperately seeks some sort of meaning and happiness in her busy life. Having spent her life in Kansas, she still doesn’t feel like she quite fits in, making for an existence on the fringes that pushes Sam into an existential crisis. This crisis is made considerably worse by the passing of her sister; however, Sam’s battle with grief and identity is helped when she meets a group of fellow outsiders.\nSomebody Somewhere is a story that touches the hearts of us all. Speaking to our innermost insecurities and telling them it’s all going to be okay, the series is a delightfully therapeutic experience that feels both life-affirming and often tragically gut-wrenching. However, this tale always has time for a joke or two, with the often visceral melancholy cut through the middle by a side-splitting gag. Ready to make you laugh and cry in joyful abundance, Somebody Somewhere is simply divine. - Jake Hodges\n'Succession' (2018 - 2023)\nRotten Tomatoes: 95% | IMDb: 8.9/10\n- Release Date\n- 2018 - 2023\n- Network\n- HBO Max\n- Showrunner\n- Jesse Armstrong\n- Directors\n- Mark Mylod\n- Writers\n- Jesse Armstrong\nCast\n-\nAlan Ruck\nThe Roy family is known for controlling the biggest media and entertainment company in the world. However, their world changes when their father steps down from the company.\n- Seasons\n- 4\nSuccession centers on the Roy family, a wealthy clan in charge of one of the largest media conglomerates in the world. Selfish, greedy, and with a malevolent will to win, the family will use anything in the hunt for worldwide success, often lying and cheating their opposition in undeniably impressive style. However, with their sights set firmly on the prize, will they notice the many obstacles about to be thrown their way?\nAdored by both critics and fans alike,Breathlessly dramatic and wickedly funny, Succession is a masterpiece from start to finish, making it no wonder why the series picked up a total of 19 Primetime Emmys, amongst a host of other major accolades. Each of the show’s many characters benefits from a twisted, three-dimensional creation that makes them both morally ugly and often charming, with the likes of Brian Cox and Jeremy Strong producing career-best performances. With a story about the elite filled to the brim with morally bankrupt individuals, Succession’s greatest triumph comes from its ability to make the entire series unmissable. - Jake HodgesWatch on Max\n'Barry' (2018 - 2023)\nRotten Tomatoes: 98% | IMDb: 8.4/10\n- Release Date\n- 2018 - 2023-00-00\n- Network\n- HBO Max\n- Showrunner\n- Alec Berg\n- Directors\n- Alec Berg\n- Writers\n- Alec Berg\nCast\n-\nBarry Berkman\n-\nSally Reed\n- Main Genre\n- Comedy\n- Seasons\n- 4\nAlec Berg and Bill Hader’s Barry stars the latter as a hitman with a lack of job and life satisfaction, with the thought of killing another person leaving him somewhat depressed. After being hired to travel to Los Angeles to murder an actor, the City of Angels sweeps him up in all its stardust, encouraging Barry to try out acting — which might just prove to be his way out of this benign existence everyone else calls life.\nA winner of 10 Primetime Emmys,Darkly comic and often fiercely tense, Barry is a triumph in both detailed character development and sweeping world-building, with the titular character's journey into his new era both life-affirming and gripping. Known for its biting satirical script, the drama is never far behind, with plenty of moments across its four seasons likely to leave you crying into your pillow. - Jake HodgesWatch on Max\n'Gentleman Jack' (2019 - 2022)\nRotten Tomatoes: 92% | IMDb: 8.2/10\n- Release Date\n- 2019 - 2021\nCast\n-\nSuranne JonesAnne Lister\n-\nSophie RundleAnn Walker\n-\nMarian Lister\n-\nAunt Anne Lister\nGentleman Jack is set in 1832 and stars Suranne Jones as Anne Lister, a woman who, heartbroken, flees for the gorgeous rolling hills of West Yorkshire, England. Now tasked with restoring her uncle’s estate — one she has inherited — Lister discovers more sinister goings-on embedded with the family land and, perhaps even more dangerously, begins a passionate but secret affair with a woman, Ann Walker (Sophie Rundle).\nFrom the mind of Happy Valley creator Sally Wainwright,Creator Sally Wainwright is certainly known for her outlandish, iconic female protagonists, with Anne Lister being no exception. Alas, Lister is actually based on a real-life woman of the same name, whose countless secretly coded diary entries were the inspiration for this captivating tale. Never short of a dramatic beat, Gentleman Jack thrives by placing detailed, gripping characters against the lush backdrop of the English countryside, with moments of breath left to allow the series’ gorgeous cinematography to take center stage once in a while. Gorgeous and emotional, Gentleman Jack is a fascinating story that champions the struggle of a queer woman in the 1800s, with many of its themes still resonant today. - Jake HodgesWatch on Max\n'Our Flag Means Death' (2022 - 2023)\nRotten Tomatoes: 94% | IMDb: 7.8/10\n- Release Date\n- 2022 - 2023-00-00\n- Showrunner\n- David Jenkins\n- Directors\n- Taika Waititi, Fernando Frias\n- Writers\n- Eliza Jiménez Cossio, Zayre Ferrer, David Jenkins\nCast\n-\nCon O'Neill\n- Seasons\n- 2\nRhys Darby), Our Flag Means Death follows the former fine gentleman as he attempts to embark on a criminal career on the high seas. After his reputation as captain of the ship Revenge leaves him yearning for greater respect, his chance for redemption arrives when he and his crew face off against the legendary Captain Blackbeard (Taika Waititi).\nBased on the documented true adventures of wannabe pirate Stede Bonnet (An aesthetically delightful romping adventure worthy of a binge, Our Flag Means Death feels like the epitome of fun. The swashbuckling sub-genre has had somewhat of a dip over recent years, but perhaps this series signals its revival, with the boundless energy and buccaneering action sequences easily rewatchable. With Rhys Darby putting on a stellar central performance, perhaps Taika Waititi’s turn as Blackbeard steals the show, with the Hollywood icon proving once again he is a master of both sinister drama and side-splitting comedy. - Jake Hodges\n'Perry Mason' (2020 - 2023)\nRotten Tomatoes: 79% | IMDb: 7.6/10\n- Release Date\n- 2020 - 2023-00-00\n- Network\n- HBO\n- Showrunner\n- Jack Amiel\n- Directors\n- Tim Van Patten, Deniz Gamze Ergüven, Marialy Rivas, Fernando Coimbra, Nina Lopez-Corrado, Jessica Lowrey\n- Writers\n- Mauricio Katz, Pedro Peirano, Steven Hanna, Sarah Kelly Kaplan, Erle Stanley Gardner, Jack Amiel, Michael Begler, Ron Fitzgerald, Rolin Jones\nCast\n-\nAndrew DivoffAl Howard\n-\nAudrey Marie AndersonAgnes Holcomb\nSet in 1932 Los Angeles, the series focuses on the origin story of famed defense lawyer Perry Mason. Living check-to-check as a low-rent private investigator, Mason is haunted by his wartime experiences in France and suffering the effects of a broken marriage. L.A. is booming while the rest of the country recovers from the Great Depression — but a kidnapping gone very wrong leads to Mason exposing a fractured city as he uncovers the truth of the crime.\n- Seasons\n- 2\nPerry Mason follows the iconic defense lawyer (Matthew Rhys), starting with the birth of his love for the profession. Set in 1932 Los Angeles, Mason’s job as a low-level private investigator is barely earning him enough to live. Add that to his broken marriage and potential PTSD following the war, and Mason’s life could perhaps not be harder. Set against the backdrop of an economically recovering country, it takes just one case for the suffocating walls around him to begin to crumble.\nBased on the character created by Erle Stanley Gardner,The character of Perry Mason is far from new, with countless renditions, making the task of crafting this remake a tricky one. Alas, Matthew Rhys does a wonderful job at molding a darker side to the legendary lawyer — one that wouldn’t have felt appropriate back in the 1950s. That more mature performance is accompanied by sinister cinematography and a story befitting the tone, with each episode providing plenty of shrieks and gasps. Intriguingly gripping, Perry Mason is a modern-day noir done right. - Jake Hodges\n'Rain Dogs' (2023 - Present)\nRotten Tomatoes: 93% | IMDb: 7.0/10\n- Release Date\n- 2023 - 2023-00-00\n- Writers\n- Cash Carraway\nCast\n-\nDaisy May Cooper\n-\nJack Farthing\n- Main Genre\n- Comedy\n- Seasons\n- 1\nThis enigmatic comedy follows mother Costello Jones (Daisy May Cooper) as she tries to care for her daughter Iris (Fleur Tashjian) against the backdrop of a societal system that seems set up to make them fail. On the hunt for a stable life, the duo team up with Selby (Jack Farthing) and Gloria (Ronke Adekoluejo) to make a dysfunctional family unit ready to take on the world.\nThis intriguing, oracular tale offers an abundance of tense drama and witty comedy, with Daisy May Cooper once again providing her perceptive brand of humor in abundance. Bursting with a plethora of top performances, Rain Dogs feels like a truly unique viewing experience, with a central family that feels ripped from a kitchen sink melodrama, placed in an eye-catching modern world that offers social commentary aplenty. - Jake Hodges\n'Sex and the City' (1998 - 2004)\nRotten Tomatoes: 70% | IMDb: 7.3/10\n- Release Date\n- 1998 - 2004-00-00\n- Network\n- HBO\n- Showrunner\n- Darren Star\n- Directors\n- Michael Patrick King, Allen Coulter, Michael Engler, Michael Spiller, Alan Taylor, Charles McDougall, David Frankel, John David Coles, Allison Anders, Tim Van Patten, Daniel Algrant, Nicole Holofcener, Pam Thomas, Susan Seidelman, Alison Maclean, Julian Farino, Martha Coolidge, Matthew Harrison, Michael Fields, Victoria Hochberg\n- Writers\n- Cindy Chupack, Jenny Bicks, Elisa Zuritsky, Julie Rottenberg, Allan Heinberg, Amy Harris, Nicole Avril, Terri Minsky, Alexa Junge, Aury Wallington, Becky Hartman Edwards, Jessica Bendinger, Judy Toll, Liz Tuccillo, Michael Green\nCast\n-\nSamantha Jones\n-\nSarah Jessica ParkerCarrie Bradshaw\nA group of four single women in New York City date all several eligible bachelors while forging strong friendships with one another.\n- Seasons\n- 6\nA legendary series with a die-hard fanbase, Sex and the City follows the lives of four high-flying women in New York in the late 1990s, with their sex lives, in particular, taking the focus. Over the course of six seasons, the group bond, grow apart, fall out, and fall in love as this iconic tale of love and friendship evolves.\nWinning seven Primetime Emmys in seven years, Sex and the City solidified itself in the eye of the public and critics alike as one of the most beloved series of all time. Making stars of its central group of female friends, each episode feels refreshingly honest but always tender in its portrayal of their modern lives, with their constant follies always met by a knowing chuckle in the audience. Fresh, funny, and brilliantly addictive, Sex and the City feels both timeless and of its time. - Jake Hodges\n'The Staircase' (2022)\nRotten Tomatoes: 92% | IMDb: 7.1/10\n- Release Date\n- 2022 - 2022-00-00\nCast\n-\nMichael Peterson\n-\nKathleen Peterson\nTells the story of Michael Peterson, a crime novelist accused of killing his wife Kathleen after she is found dead at the bottom of a staircase in their home, and the 16-year judicial battle that followed.\n- Main Genre\n- Drama\n- Seasons\n- 1\nThe Staircase tells the tale of crime novelist Michael Peterson, portrayed by Colin Firth, whose life is turned upside down after his wife, Kathleen (Toni Collette), is suspiciously found dead at the bottom of their stairs. What ensues is a 16-year-long investigation that never loses sight of the husband at its center, with his profession as a crime novelist making him seem like the perfect perpetrator.\nBased on a true crime,Given it is based on a real story (that has been adapted countless times, no less) the team behind The Staircase had a duty of care when it came to this portrayal — one they clearly took seriously, given the tender nature of this tale’s unraveling. Both Colin Firth and Toni Collette are just as captivating as one might expect, with their performances certainly going some way to making this series as gripping as it is. Showcasing the breadth of their talent across eight engrossing episodes, The Staircase is the perfect watch for any fans of this genre. - Jake HodgesWatch on Max\n'The Last of Us' (2023 - Present)\nRotten Tomatoes: 96% | IMDb: 8.8/10\n- Release Date\n- January 15, 2023\n- Network\n- HBO\n- Showrunner\n- Craig Mazin\n- Directors\n- Craig Mazin, Peter Hoar, Jeremy Webb, Ali Abbasi, Mark Mylod, Stephen Williams, Jasmila Žbanić, Liza Johnson, Nina Lopez-Corrado\n- Writers\n- Neil Druckmann, Craig Mazin, Halley Wegryn Gross\nCast\n-\nJoel Miller\n-\nEllie Williams\nAfter a global pandemic destroys civilization, a hardened survivor takes charge of a 14-year-old girl who may be humanity's last hope.\n- Seasons\n- 2\nPedro Pascal and Bella Ramsey star as Joel and Ellie in The Last of Us, a story set in the aftermath of a mutant Cordyceps fungal infection. Stuck inside an insidious quarantine zone, Joel must help Ellie escape into a world of complete unknowns, as their treacherous journey often thrusts them into the jaws of danger.\nBased on the much-loved video game, The Last of Us became an instant hit upon release, leading to a remarkable 25 Emmy nominations. Highlighted by Episode 3 of the first season, each story is equally as life-affirming as it is gutwrenching, with both Pedro Pascal and Bella Ramsey working wonders with each of the elaborate scripts. Always on the verge of making you cry, The Last of Us is a modern masterpiece. - Jake Hodges\n'Sort Of' (2021 - 2024)\nRotten Tomatoes: 100% | IMDb: 7.2/10\n- Release Date\n- 2021 - 2024-00-00\nCast\n-\nBilal Baig\n-\nAmanda Cordner\n-\nGray Powell\n-\nGracy Lynn Kung\nFollows a gender-fluid millennial who straddles various identities, exposing the identities and labels that are no longer applicable.\nA series bathed in the progressive stance television has a duty to withhold, Sort Of follows Sabi Mehboob (Bilal Baig), a gender-fluid millennial who takes on a plethora of different identities, from a flirtatious bartender to one of many children in a Pakistani family. As they go about their everyday life, the pressures of modern expectations begin to suffocate Sabi. Will they be able to stay true to themselves?\nThroughout each of Sort Of’s three seasons, the highs and lows of the struggle to find one’s identity are explored in all their 21st-century glory. A progressive story with one eye on forward-thinking representation and another on top-notch entertainment, Sort Of is a glowingly funny example of the spectrum of current society and the importance of diverse acceptance. Offering an education in both the plight of a migrant family and the experience of those in the LGBTQIA+ community, Sort Of is an important modern tale. - Jake Hodges\n'Abbott Elementary' (2021 - Present)\nRotten Tomatoes: 99% | IMDb: 8.2/10\n- Release Date\n- December 7, 2021\n- Network\n- ABC\n- Showrunner\n- Quinta Brunson\n- Writers\n- Quinta Brunson\nCast\n-\nJanine Teagues\n-\nGregory Eddie\nA workplace comedy centered around a group of dedicated teachers - and an oblivious principal - in a Philadelphia public school where, despite the odds stacked against them, they are determined to help their students succeed in life.\n- Main Genre\n- Comedy\n- Seasons\n- 5\nCreated by Quinta Brunson, this workplace comedy follows the staff of a Philadelphia public school, each with their own quirks and flaws. Despite a governmental education system seemingly set up to watch them fail, the dysfunctional group of teachers can at least agree on one thing: their students deserve the best education possible.\nAbbott Elementary is a laugh-out-loud comedy that never shies away from detailing the true failings of the modern education system. Each of the characters is hilariously realized but multi-dimensional, with Abbott Elementary impressively avoiding the caricatural trap many of its contemporaries fall into. This series shouldn’t just be praised for its adult actors, though, with the ensemble of children equally as talented. - Jake HodgesWatch on Max\n'His Dark Materials' (2019 - 2022)\nRotten Tomatoes: 84% | IMDb: 7.8/10\n- Release Date\n- 2019 - 2022-00-00\n- Network\n- BBC One\n- Directors\n- William McGregor, Amit Gupta, Leanne Welham, Charles Martin, Otto Bathurst, Euros Lyn, Dawn Shadforth, Harry Wootliff\n- Writers\n- Francesca Gardiner, Amelia Spencer, Sarah Quintrell\nCast\n-\nLyra Silvertongue\n-\nMrs Coulter\n- Main Genre\n- Fantasy\nDafne Keen), who sets out on a mission to track down her kidnapped best friend. However, as her journey continues, she suddenly uncovers more than she bargained for, with a series of sinister acts involving innocent children lurking beneath the surface.\nThis BAFTA-nominated series is set in a parallel universe to our own, where magic and science are one and the same. The story follows orphan Lyra (Considered one of the most influential fantasy stories of all time, His Dark Materials accumulated a die-hard fanbase thanks to the original trilogy of novels, with this adaptation only furthering its worldwide appeal. This story bursts into life in ferocious fashion with a pilot full of energy and verve. Not just a success because of its source material, this adaptation does well to bring the magical elements up to date, with the CGI and cinematography regularly breathtaking. - Jake Hodges\n'House of the Dragon' (2022 - Present)\nRotten Tomatoes: 93% | IMDb: 8.5/10\n- Release Date\n- August 21, 2022\n- Network\n- HBO\n- Showrunner\n- George R.R. Martin\n- Directors\n- Clare Kilner, Geeta Patel\n- Writers\n- Gabe Fonseca\nCast\n-\nPrince Daemon Targaryen\n-\nFabien FrankelSer Criston Cole\n- Seasons\n- 2\nGame of Thrones is set roughly 200 years before the HBO hit and begins with the iconic House Targaryen at the peak of its power. However, as cracks in their community begin to infiltrate the land, their power begins to crumble, with King Viserys’s (Paddy Considine) daughter Rhaenyra’s (Milly Alcock) status as next in line to the Iron Throne thrown into disrepute after she gives birth to a baby boy.\nThis prequel toJust like its predecessor, House of the Dragon contains an enormously impressive ensemble and showcases the swooping scope of a fantasy series with all the trimmings. Brimming with gripping drama, gruesome violence, and its fair share of fantasy creatures, House of the Dragon is a vastly triumphant feat of television that would have simply not been thought possible 20 years ago. Captivating from start to finish, the biggest compliment that can be paid to House of the Dragon is that it manages to step out of the shadow of its high-profile older brother and become a beloved show all on its own. - Jake HodgesWatch on Max\n'The Rehearsal' (2022 - Present)\nRotten Tomatoes: 95% | IMDb: 8.5/10\n- Release Date\n- July 15, 2022\n- Writers\n- Nathan Fielder, Carrie Kemper, Eric Notarnicola\nCast\n-\nNathan Fielder\nThe Rehearsal is a television series created by Nathan Fielder, in which he assists individuals in preparing for significant life events through meticulous simulations. Each episode explores the intricate and often humorous process of refining these rehearsals, highlighting the complexities and unexpected outcomes inherent in the pursuit of perfection. The show blends scripted and unscripted elements, offering a unique take on human behavior and the lengths people will go to in order to achieve their goals.\n- Seasons\n- 2\nNathan Fielder, The Rehearsal is a docu-comedy where Fielder uses detailed sets and actors to recreate real-life scenarios and rehearse them with ordinary people. From confessing to having lied about having a master’s degree to being more assertive as a parent, the situations range from the every day to the life-changing, with the clients often surprised as to just how detailed Fielder and his team’s research into them has been.\nCreated by and starringA wildly innovative series unlike anything you have seen before, The Rehearsal perfectly toes the line between reality and fiction, making it impossible to fully recognize either as the series' dominant form. The work done to recreate the setting for each of the clients is nothing short of breathtaking, with the novelty never running thin, even after seven episodes. Perhaps The Rehearsal’s greatest achievement is its dedication to understanding the nuanced emotions of ordinary lives. The series doesn’t simply showcase life’s most poignant moments but looks at them deeply. At first, they may seem trivial, but they turn out to have the power to change our lives in their own subtle way — something we can all relate to. - Jake HodgesWatch on Max\n'Sharp Objects' (2018)\nRotten Tomatoes: 92% | IMDb: 8.0/10\n- Release Date\n- 2018 - 2018-00-00\nAfter treating her mental illness, crime reporter Camille Preaker returns to her hometown to solve the murder of two young girls. However, she is forced to face and deal with her own demons too.\nSharp Objects follows Camille Preaker (Amy Adams), a reporter who has recently left a psychiatric unit after issues with her mental health. However, following her return to work, her resolve is going to be tested perhaps far too soon, with her next journalistic assignment about the deaths of two young girls… in her hometown. Forced to travel back home, having long avoided the familial and societal demons that lay there, Camille’s past is about to be stirred and her trauma awakened as she finds more in common with the young victims than she could have ever imagined.\nCreated by Marti Noxon,Unapologetically brutal, Sharp Objects is as dangerous as its title suggests, with a tale that will live long in your memory. Director Jean-Marc Vallée produces an astonishing dedication to the detail in every frame and manages to navigate a sensitive story with one eye on diplomacy and the other on sheer entertainment. Thrilling from minute one, Amy Adams delivers a gripping performance as Camille, perfectly capturing the downward spiral her character goes on without ever losing the relatable essence at her core. Quite simply, Sharp Objects is a must-watch series. - Jake HodgesWatch on Max\n'Big Little Lies' (2017 - Present)\nRotten Tomatoes: 89% | IMDb: 8.4/10\n- Release Date\n- 2017 - 2026-00-00\n- Network\n- HBO\n- Showrunner\n- David E. Kelley\n- Directors\n- Jean-Marc Vallee, Andrea Arnold\n- Writers\n- T. Rafael Cimino\nCast\n-\nCeleste Wright\n-\nMadeline Mackenzie\n- Seasons\n- 2\nBig Little Lies follows the picture-perfect lives of a group of upper-class mothers, with the arrival of single mom Jane (Shailene Woodley) and her cryptic child threatening to upset their rich rhythm. As small scandals snowball into larger issues, each of the women becomes entwined in a web of small lies that grows and mutates into a horrifying situation that may prove fatal.\nFeaturing a star-studded central cast,A winner of eight Primetime Emmys, this series is devilishly addictive, with each of the main ensemble producing compelling performances. Incidentally, that ensemble is one of the best curated on television in a long time, with the likes of Shailene Woodley, Reese Witherspoon, Nicole Kidman, Zoe Kravitz, Laura Dern, and even Meryl Streep all involved. From the cinematography to the performances and even the score, each part of this series feels hypnotic, with the wild tale at its center ensnaring the audience as it does the lives of the characters. - Jake HodgesWatch on Max\n'Peacemaker' (2022 - Present)\nRotten Tomatoes: 94% | IMDb: 8.3/10\n- Release Date\n- 2022 - 2025-00-00\n- Network\n- HBO Max, Max\n- Showrunner\n- James Gunn\n- Directors\n- James Gunn, Brad Anderson, Rosemary Rodriguez\n- Writers\n- James Gunn\nCast\n-\nChristopher Smith / Peacemaker\n-\nLeota Adebayo\n- Seasons\n- 2\nJames Gunn, Peacemaker begins where 2021’s The Suicide Squad ended, focusing on the whirlwind action-packed life of the titular Peacemaker, with John Cena reprising his role from the aforementioned movie. After recovering from his injuries, Peacemaker is quickly recruited to a special agents task force and put on the mysterious ‘Project Butterfly.' The mission? To track down and destroy a group of butterfly-like parasites that are causing the deaths of humans across the world.\nCreated byFor those who loved The Suicide Squad, Peacemaker has all of the elements that crafted its success in abundance. For those who didn’t love The Suicide Squad, Peacemaker is a breath of fresh air that provides both comedy and action in abandon, paying beautiful homage to the source material. Peacemaker has something for everyone, with a story of fighting evil that can light a fire in even the coldest of hearts. - Jake Hodges\n'Station Eleven' (2021 - 2022)\nRotten Tomatoes: 98% | IMDb: 7.6/10\n- Release Date\n- 2021 - 2022-00-00\n- Network\n- HBO Max\n- Directors\n- Hiro Murai, Helen Shaver, Jeremy Podeswa, Lucy Tcherniak\n- Writers\n- Sarah McCarron, Kim Steele, Cord Jefferson\nCast\n-\nKirsten Raymonde\n-\nJeevan Chaudhary\nCreated by Patrick Somerville, Station Eleven is based on a novel (featuring the same name) by author Emily St. John Mandel. The series's premise sees individuals attempting to adapt to life in a post-apocalyptic dystopia. A group tries to support their new lives as traveling performers only to come face to face with a cult.\nStation Eleven is a story told across several timelines, with the main era consisting of the survivors of a deadly flu that left the world in a post-apocalyptic state. Beginning with the death of an acclaimed actor during a production of King Lear, this tale travels through his life from childhood to the years following his death, charting the array of struggles felt by both him and those who were pivotal to his final moments.\nNominated for seven Primetime Emmys,Based on the 2014 novel of the same name by Emily St. John Mandel, this miniseries takes time to wander through its enigmatic structure, leaving room for the audience to indulge in the impressive intelligence of its story. Perhaps Station Eleven’s best asset is just how refreshing it is in a condensed post-apocalyptic sub-genre, with anyone who is perhaps tired of many of the tropes sure to relish this unique series. - Jake Hodges\n'The Sex Lives of College Girls' (2021 - Present)\nRotten Tomatoes: 95% | IMDb: 7.8/10\n- Release Date\n- 2021 - 2025-00-00\n- Showrunner\n- Mindy Kaling, Justin Noble\n- Writers\n- Mindy Kaling, Justin Noble\nCast\n-\nPauline ChalametKimberly Finkle\n-\nAmrit KaurBela Malhotra\n-\nAlyah Chanelle ScottWhitney Chase\n-\nRenika WilliamsWillow\nMindy Kaling and Justin Noble follows four 18-year-olds who, new to New England's prestigious Essex College, are brought together as roommates. Now freed from the shackles of their parental homes, the group battles a rush of hormones and the thrills of freedom as their best intentions and deepest desires tend to hilariously get the better of them.\nThis upbeat comedy fromIn typical Mindy Kaling fashion, The Sex Lives of College Girls feels unapologetically raw in its depiction of the attitudes and actions of young people, with the wilful abandon and subsequent regret regularly experienced by them stunningly relatable. With so many shows aimed at high school life, it is refreshing to see the next academic level explored, with many likening this to the British hit series Fresh Meat. Eye-catching, side-splitting, and wickedly fun, The Sex Lives of College Girls is pure entertainment. - Jake HodgesWatch on Max\n'Starstruck' (2021 - Present)\nRotten Tomatoes: 95% | IMDb: 7.5/10\nThis BAFTA-nominated series is created by and stars Rose Matafeo as Jessie, a modern-day millennial living in London who struggles to make ends meet and lives paycheck to paycheck. On one unexpected day, a nonchalant one-night stand with Nikesh Patel's Tom quickly changes her life, as it becomes swiftly apparent he is a movie star… and a big one at that. What then unfolds is the toing and froing of a 21st-century relationship as they struggle to figure out exactly who they are together and as themselves.\nPainfully relatable and brilliantly funny, Starstruck is modern comedy at its absolute best, bringing together the anxieties of our current society and amplifying them for generous comedic effect. Rose Matafeo’s devilishly dry observational brand of humor fills every episode, with each outing feeling comedically indulgent as well as light on the palette. Both she and Nikesh Patel have a sizzling on-screen chemistry and perfectly manage to capture the ‘will-they/won’t-they’ nature of their relationship in all its nuanced glory. A series to capture even the hardest of hearts, you’ll never quite know whether the next moment will warm your soul or crush your dreams. - Jake Hodges\n'Harley Quinn' (2019 - Present)\nRotten Tomatoes: 96% | IMDb: 8.4/10\n- Release Date\n- November 29, 2019\n- Network\n- DC Universe, HBO Max, Max\n- Showrunner\n- Dean Lorey, Chrissy Pietrosh, Jessica Goldstein\n- Directors\n- Juan Jose Meza-Leon, Vinton Heuck, Joonki Park, Cecilia Aranovich, Ben Jones, Colin Heck, Tom De Rosier, Brandon McKinney, Frank Marino, Mike Milo, Matt Garofalo, Christina Sotta, Michael Moloney\n- Writers\n- Tom Hyndman, Sarah Nevada Smith, Jamiesen Borak, Ava Tramer, Connie Shin, Jess Dweck, Jane Becker, Laura Moran, Sabrina Jalees, Jordan Weiss, Jimmy Mosqueda, Rachel Pegram\n- Franchise(s)\n- DC Universe\nCast\n-\nHarley Quinn (voice)\n-\nPoison Ivy (voice)\n- Seasons\n- 5\nKaley Cuoco in the titular role sometime after she has broken up from a loveless relationship with the Joker, setting sail on new fiendish adventures with her best friend, Poison Ivy (Lake Bell). The duo, alongside other evil names, begin their mission to make a dent in Gotham City’s criminal underworld as they try and prove themselves to be the most dangerous villains of them all.\nCreated by Paul Dini and Bruce Timm, this spin-off of the iconic DC character seesA hit with both the public and critics, Harley Quinn is a must-watch series for both fans of DC and non-fans alike. Supported by simply stunning animation, the series navigates some dark territory without ever losing its penchant for fiery entertainment. Kaley Cuoco is superb in the titular role, proving to both understand the source material and provide a breath of fresh air into an otherwise well-worn character. Darker than many may expect, Harley Quinn is a fever dream of furious fun. - Jake Hodges\n'I May Destroy You' (2020)\nRotten Tomatoes: 98% | IMDb: 8.1/10\n- Release Date\n- 2020 - 2020-00-00\nCast\n-\nMichaela Coel\n-\nWeruche Opia\nI May Destroy You is a drama series created by and starring Michaela Coel, exploring the complexities of consent and sexual assault through the experiences of Arabella, a writer who rebuilds her life after being drugged and assaulted in London.\nIf Chewing Gum put Michaela Coel on the map, I May Destroy You shot her into space. This genius drama is both created by and stars the aforementioned actress as Arabella, a young novelist famous for her work who tries to avoid the limelight in the hope she’ll find the time to heal from her traumatic experience as a victim of rape.\nHard-hitting, darkly comic, and a touching ode to many in the same situation, I May Destroy You certainly has something for everyone and stands tall as a series ready to fight for justice. A winner of two Primetime Emmys, with one a nod to Coel’s outstanding writing, each episode is a swirling, sometimes incoherent experience that perfectly tonally summarizes the head-space of its lead character, allowing the audience a chance to feel the offbeat rhythm of her sharp pain. Remarkably emotional and brilliantly humorous, I May Destroy You is a one-in-a-million series. - Jake Hodges\n'The Other Two' (2019 - Present)\nRotten Tomatoes: 97% | IMDb: 7.9/10\n- Release Date\n- 2019 - 2023-00-00\n- Network\n- Comedy Central\n- Directors\n- Chris Kelly\n- Writers\n- Chris Kelly, Sarah Schneider\nCast\n-\nHeléne Yorke\n-\nDrew Tarver\n-\nCase Walker\n- Seasons\n- 3\nThis Emmy-nominated comedy follows siblings Brooke and Cary Dubek, played by Helene Yorke and Drew Tarver, respectively, as they both face the realities of a struggling millennial adulthood full of unfulfilled dreams and a waning sense of hope. Life’s knife is then twisted deeper as their 13-year-old brother Chase (Case Walker) becomes an overnight viral sensation, putting an unwanted perspective on the trajectory of their existence.\nWith many likening it to the iconic Schitt’s Creek, The Other Two is a laugh-out-loud comedy that does its job and then some, leaving its viewers likely missing some dialogue thanks to the sheer volume of their laughter. Gripping and full of genuinely clever plot shifts, the series dances around the idea of a lack of self-fulfillment and what it takes to be happy, providing a touching insight into the realities of many of our anxieties and how they are completely normal. Hilarious and humbling, The Other Two is a marvelous addition to HBO’s catalog. - Jake Hodges\n'The White Lotus' (2021 - Present)\nRotten Tomatoes: 92% | IMDb: 7.9/10\n- Release Date\n- 2021 - 2024\n- Network\n- HBO\n- Showrunner\n- Mike White\n- Directors\n- Mike White\n- Writers\n- Mike White\nCast\n-\nKate Bohr\n-\nLaurie Duffy\nThe White Lotus is a television series that explores the interactions of guests and staff at an upscale tropical resort. Premiering in 2021, the narrative unfolds over a week, revealing underlying complexities and tensions among the resort's seemingly ideal travelers and employees.\n- Seasons\n- 3\nWhite Lotus resort. With each of the guests ready to unleash their most unhinged desires, and with the employees having to put up with them, their lives become far more entwined than any could have once thought, with the high drama and deception burying into the very fabric of the resort and consuming the super-consumers who reside there.\nThis awards darling features an all-star cast of elite guests and employees at the titularWithout even considering the sheer talent in the ensemble, The White Lotus is a genius story brimming with the sort of biting satire that would feel right at home in Ruben Ostlund’s Triangle of Sadness. Beginning with a bunch of almost caricature-like upper-class elites, the series breaks down each of their nuanced flaws and finds the relatable soul within them, making for a show that impressively manages to keep you hooked despite many of the characters often feeling deplorable. A winner of 15 Primetime Emmys, The White Lotus is one of the most popular shows of the past decade for a reason. - Jake Hodges\n'Hacks' (2021 - Present)\nRotten Tomatoes: 100% | IMDb: 8.2/10\n- Release Date\n- 2021 - 2026-00-00\n- Network\n- HBO Max, Max\n- Showrunner\n- Lucia Aniello\n- Directors\n- Desiree Akhavan\n- Writers\n- Pat Regan, Ariel Karlin, Carol Leifer, Joe Mande, Guy Branum, Andrew Law, Samantha Riley\nCast\n-\nDeborah Vance\n-\nAva\nExplores a dark mentorship that forms between Deborah Vance, a legendary Las Vegas comedian, and an entitled, outcast 25-year-old.\n- Seasons\n- 4\nHacks stars Jean Smart as Deborah Vance, a veteran stand-up comic heavily inspired by the late great Joan Rivers. However, after a career in the limelight, Deborah begins to notice her popularity dropping. Wanting to rebrand and appeal to a younger audience, Deborah teams up with up-and-comer Ava (Hannah Einbinder), who also faces her own professional struggles after receiving backlash for some controversial online comments. As an unlikely but heartwarming duo, can they resurrect both of their careers?\nA comedy adored by both fans and critics alike,Charming, witty, and ready to remind you of the power of friendship, Hacks is a delightful series that has rightfully won six Primetime Emmys to date. Given Jean Smart’s love of the performing arts, this role feels perfect for her, with her relishing of it translating through the screen and into the audience’s hearts. Hacks’ central pairing is perfectly relatable, with their fallibilities explored in detail but never stopping them from being worth rooting for. - Jake Hodges\n'Mare of Easttown' (2021)\nRotten Tomatoes: 95% | IMDb: 8.4/10\n- Release Date\n- 2021 - 2021-00-00\n- Network\n- HBO\n- Showrunner\n- Brad Ingelsby\n- Directors\n- Craig Zobel\n- Writers\n- Brad Ingelsby\nCast\n-\nKate WinsletMarianne 'Mare' Sheehan\n-\nHelen Fahey\n- Seasons\n- 1\nMare of Easttown is set in a small suburb of Philadelphia and follows the murder of a young mother and the subsequent investigation. On the case is Kate Winslet’s Marianne Sheehan, better known as Mare. Although she is somewhat of a local hero, Mare’s talents as a detective are currently under community scrutiny after she failed to solve the year-long search for a missing girl. Can she solve the murder and revitalize her reputation?\nCreated by Brad Ingelsby,Praised for its representation of women, Mare of Easttown is a stunning murder mystery with a biting social commentary at its core. Kate Winslet is typically captivating in the lead role, managing to neatly pull off the juxtaposition between someone who relishes their power but also feels the heavy weight of it on their dropping shoulders. Many have praised her for moving slightly beyond type to play a grittier character, with her performance one of many highlights in this gripping drama. - Jake Hodges\n'The Flight Attendant' (2020 - 2022)\nRotten Tomatoes: 91% | IMDb: 7.1/10\n- Seasons\n- 2\nHarley Quinn herself, Kaley Cuoco, stars in The Flight Attendant, a story about negligent flight attendant Cassandra Bowen. After one particularly heavy night full of far too much booze, Bowen wakes up in her hotel room to the shocking sight of a dead body next to her. Afraid of being charged with a crime she isn’t sure if she committed, Bowen tries to go about her day as normal, but just how long will it be before her actions catch up with her, especially when the FBI comes knocking?\nA twisting, tense murder mystery wrapped up in a comedic blanket that feels perfect for the stylings of its lead, The Flight Attendant is a wonderful cross-examination of two genres, with the former an impressively smart unraveling puzzle that pulls the audience along with it. The series is also not afraid of delving into the alcoholic demons of its central character, something many other shows would simply use as a comedic device. Refreshing, gripping, and hilarious, The Flight Attendant has something for everyone. - Jake Hodges\n'The West Wing' (1999 - 2006)\nRotten Tomatoes: 81% | IMDb: 8.9/10\n- Release Date\n- 1999 - 2006-00-00\n- Network\n- NBC\n- Showrunner\n- Aaron Sorkin\n- Directors\n- Thomas Schlamme\n- Writers\n- Aaron Sorkin\nInside the lives of staffers in the West Wing of the White House.\n- Seasons\n- 7\nCreated by the genius mind of Aaron Sorkin, The West Wing follows Martin Sheen’s Democratic President and those below him working in the titular West Wing of the iconic White House. By intertwining their personal dramas with the larger political responsibilities of those in charge of a nation, the highs and lows of both major politics and intimate relationships are laid bare in all their dramatic glory.\nA winner of 26 Primetime Emmys and considered one of the greatest series of all time, The West Wing is a political drama like no other. Backed by a high-profile cast headed by Martin Sheen’s now-legendary portrayal of President Josiah Bartlet, The West Wing delivers thick, nuanced plot threads and high-octane emotional drama in abundance. With many of its episodes now considered some of the best television episodes ever put to screen, simply gushing over The West Wing doesn’t do it justice — it needs to be watched. - Jake Hodges\n'Silicon Valley' (2014 - 2019)\nRotten Tomatoes: 94% | IMDb: 8.5/10\n- Release Date\n- 2014 - 2019-00-00\n- Network\n- HBO Max\n- Showrunner\n- Mike Judge\n- Directors\n- Mike Judge\n- Writers\n- Mike Judge\nRichard Hendricks, a brilliant yet awkward coder, creates a revolutionary data compression algorithm and navigates the cutthroat world of Silicon Valley startups. As he and his eccentric team at Pied Piper face constant challenges from rivals and investors, their journey highlights the humor and absurdities of tech culture.\n- Seasons\n- 6\nSilicon Valley is a comedy loosely inspired by the real-world experience of one of its creators, Mike Judge, and looks at the high-profile lives of those working in the titular hub for technological innovation. As their genius pushes them into wild success, it becomes soon clear that, although they deserve their plaudits, they certainly don’t know how to handle them.\nA story told across six seasons,This smart, well-observed series is much more than the situation-based comedy its title suggests. Silicon Valley is a detailed character piece with a rounded selection of hilarious creations portrayed by a selection of fine actors such as Thomas Middleditch and Josh Brener. With a story that seems to grow in its greatness as each episode continues, Silicon Valley is frankly addictive, with many citing it as one of HBO’s most underrated series. - Jake Hodges\n'Crashing' (2017 - 2019)\nRotten Tomatoes: 90% | IMDb: 7.6/10\n- Release Date\n- 2017 - 2019-00-00\n- Network\n- Channel 4\n- Directors\n- George Kane\nCast\n-\nPete Holmes\n-\nGeorge BasilLeif\n-\nJamie LeeAli Reissen\n-\nArtie LangeArtie Lange\n- Seasons\n- 3\nPhoebe Waller-Bridge’s most underrated series, Crashing follows Fleabag herself as Lulu, a young woman who travels to London to surprise her best friend Anthony (Damien Molony), who resides in an abandoned hospital as a property guardian. Alongside several other 20-somethings who also live there, the gang deals with the highs and lows of modern life and 21st-century relationships while worrying each day that they might soon be removed from their property and livelihood.\nPerhapsUsing her now-famous brand of observational comedy with a feminist edge, Phoebe Waller-Bridge is in fine form as the creator, writer, and star of Crashing, with the self-deprecating situations she places herself in painfully relatable. The story is a refreshing spin on a genre of modern comedy that feels dense, with the edgy and often dark style of humor regularly puncturing right through to the heart of the audience. The beautiful chemistry of the central group ebbs and flows from sexual tension to desperate fighting, with their intricate bond always powerfully engaging. - Jake HodgesWatch on Max\n'Deadwood' (2004 - 2006)\nRotten Tomatoes: 92% | IMDb: 8.6/10\n- Release Date\n- 2004 - 2006-00-00\n- Network\n- HBO Max\n- Showrunner\n- David Milch\n- Writers\n- David Milch\nA show set in the late 1800s, revolving around the characters of Deadwood, South Dakota; a town of deep corruption and crime.\n- Seasons\n- 3\nDeadwood is set in the titular South Dakota town and takes place following the deadly Custer massacre, with the town desolated in its wake. Into the unknown come Wild Bill Hickock (Keith Carradine) and Seth Bullock (Timothy Olyphant), who soon find themselves coming face to face with Deadwood’s resident lawman, Al Swearengen (Ian McShane), in a battle of wits and guts.\nA winner of eight Primetime Emmys, among a myriad of other awards,A pure Western series with its genre at heart, Deadwood is a ‘fight to the finish’ style series that oozes the brooding tension and flashing action so synonymous with others in the Western genre. Not only that, but the team behind the series put enormous effort into trying to portray a grounded view of what this time period was actually like, with this gritty sense of realism only emphasizing the moments of violence and drama. Boasting a cast of characters all moments away from breaking, Deadwood will keep you on the edge of your seat through its entire three-season run. - Jake HodgesWatch on Max\n'Doctor Who' (2005 - Present)\nRotten Tomatoes: 90% | IMDb: 8.6/10\n- Release Date\n- May 11, 2024\n- Network\n- BBC One\n- Directors\n- Alex Pillai, Peter Hoar, Ben Chessell, Julie Anne Robinson, Jamie Donoughue, Amanda Brotchie, Dylan Holmes Williams\n- Writers\n- Steven Moffat, Pete McTighe, Kate Herron, Inua Ellams, Juno Dawson\n- Franchise(s)\n- Doctor Who / Whoniverse\nCast\n-\nThe Doctor\n-\nMillie GibsonRuby Sunday\nThe show follows the adventures of a Time Lord, “The Doctor,” who is able to regenerate, and the Doctor’s human friends. The Doctor and his companions journey through time and space in the TARDIS – a time-traveling ship shaped like a police box – saving the universe with a combination of wit, bravery, and kindness.\n- Seasons\n- 2\nDoctor Who follows the titular time lord across many of their incarnations as they fly around time and space in their TARDIS. Always backed by a trusted companion or two, the Doctor lands in the heart of danger and regularly saves the day with no thought for their own safety. Able to speak any language and with no weapons except a sonic screwdriver and their vast intelligence, the Doctor is the epitome of an iconic hero.\nOne of the greatest sci-fi shows of all time, and perhaps the BBC’s greatest ever export,Spanning more than 60 years, the legacy Doctor Who has created speaks volumes about its genius, thanks to the core concept of a superhero-like person who chooses love instead of violence and is equipped with a tool to fix instead of a tool to harm. The main character themself is one of the most widely celebrated opportunities for many an actor, with the likes of Tom Baker, Jodie Whittaker, Matt Smith, David Tennant, and now Ncuti Gatwa all having taken turns to fly the TARDIS. Whimsical, camp, and emotionally poignant, Doctor Who’s brilliance comes from its choice to tell human stories and set them in space. - Jake HodgesWatch on Max\n'Doom Patrol' (2019 - 2023)\nRotten Tomatoes: 98% | IMDb: 7.8/10\n- Release Date\n- 2019 - 2023-00-00\n- Showrunner\n- Jeremy Carver\n- Directors\n- Chris Manley, Kristin Windell, Dermott Downs, Harry Jierjian, Rebecca Rodriguez, Omar Madha, Glen Winter\n- Writers\n- Arnold Drake\n- Franchise(s)\n- DC Universe\nCast\n-\nMatt Bomer\n- Seasons\n- 4\nDoom Patrol is a re-telling of a beloved DC story, following a central team of social outcasts, all with special abilities led by The Chief, Dr. Niles Caulder (Timothy Dalton). Under the cover of dark, the group combines their unique forces to solve unexplained mysteries and save the Earth from peril, with the next mission set to be their toughest yet.\nCreated by Jeremy Carver,A superhero tale just as much about wild action as it is about the power of friendship, Doom Patrol neatly walks the line between a Marvel-style all-out action fest and a tender drama about the need for emotional support and the right to be seen. Each of the central characters is much more than simply their superpower, with the team behind Doom Patrol going to great lengths to craft sincere human characters that are both bettered and perhaps worsened by their abilities. Funny, poignant, and always a good old-fashioned romp, Doom Patrol is fun for DC fans and non-DC fans alike. - Jake Hodges\n'Enlightened' (2011 - 2013)\nRotten Tomatoes: 87% | IMDb: 7.6/10\n- Release Date\n- 2011 - 2013-00-00\n- Network\n- HBO\n- Directors\n- Miguel Arteta, Jonathan Demme, Nicole Holofcener, James Bobin, Phil Morrison, Todd Haynes\nCast\n-\nAmy Jellicoe\n-\nMike WhiteTyler\n-\nLuke WilsonLevi Callow\n-\ntimm sharpDougie Daniels\n- Seasons\n- 2\nThis blend of comedy and drama follows Laura Dern as Amy Jellicoe, a former executive who, after facing a demotion at work, spirals into a mental breakdown. Following a two-month stint in a rehabilitation center, Amy returns to her life in Riverside, California, with a new lease of life and the wind in her sails. After finding a philosophical awakening whilst in rehab, can Amy hold onto her new ways when faced with her old life?\nTouching and brutally real, Enlightened tells the story of one woman’s journey through the toughest period in her life and promises that, despite all her obstacles, there can be a light at the end of the tunnel. Laura Dern, who also co-created the project, proves once again that she is at the very top of her game with a performance that manages to neatly find the nuance between a hopeful optimist and a flawed woman chased by her demons. Writer and co-creator Mike White tells a story that ducks and dives through gripping drama and moments of biting comedy in a series that will keep you hooked from its first scene through to its last. - Jake Hodges\n'Euphoria' (2019 - Present)\nRotten Tomatoes: 88% | IMDb: 8.3/10\n- Release Date\n- June 16, 2019\n- Network\n- HBO\n- Showrunner\n- Sam Levinson\n- Directors\n- Jennifer Morrison, Augustine Frizzell\nCast\n-\nZendayaRue Bennett\n-\nJules Vaughn\n- Seasons\n- 3\nEuphoria follows the lows and even lowers of 17-year-old Rue (Zendaya), a troubled girl whose addiction to drugs sent her to rehab. Now back at school, Rue’s promise to stay clean looks in danger as she becomes embroiled in a world of sex, drugs, and high school drama, ready to thrust her back into her old ways.\nAn adaptation of the Israeli series of the same name,With many considering this Zendaya’s greatest performance to date in her burgeoning career, Euphoria makes use of its superbly talented young ensemble and doesn’t simply rely on its central star, with the likes of Sydney Sweeney, Jacob Elordi, and Hunter Schafer quickly becoming household names. Never shy of tackling a host of subjects many would be afraid to associate with high schoolers, Euphoria quickly became a beacon of hope for many who felt underrepresented, especially those in the trans community, with the character of Jules becoming a pivotal turning point in the landscape of television. - Jake Hodges\n'Friends' (1994 - 2004)\nRotten Tomatoes: 78% | IMDb: 8.9/10\n- Release Date\n- 1994 - 2004\n- Network\n- NBC\n- Showrunner\n- Marta Kauffman\n- Directors\n- Kevin S. Bright, Gary Halvorson, Michael Lembeck, James Burrows, Gail Mancuso, Peter Bonerz, David Schwimmer, Robby Benson, Shelley Jensen, Terry Hughes, Dana De Vally Piazza, Alan Myerson, Pamela Fryman, Steve Zuckerman, Thomas Schlamme, Roger Christiansen, Sheldon Epps, Arlene Sanford, David Steinberg, Joe Regalbuto, Mary Kay Place, Paul Lazarus, Sam Simon, Todd Holland\n- Writers\n- Jeff Astrof, Mike Sikowitz, Brian Boyle, Patty Lin, Bill Lawrence, R. Lee Fleming Jr.\nCast\n-\nRachel Green\n-\nCourteney CoxMonica Geller\n- Seasons\n- 10\nFriends stars the iconic group of Ross (David Schwimmer), Joey (Matt LeBlanc), Chandler (Matthew Perry), Monica (Courteney Cox), Phoebe (Lisa Kudrow), and Rachel (Jennifer Aniston). Over the course of ten seasons, their interwoven lives are documented in pure 90s glory as each of them falls in love (often with each other), furiously fights (again, often with each other), and grows and matures as they discover that, although the true course of life never can run smooth, it certainly runs smoother surrounded by your friends.\nWidely considered one of the most influential sitcoms of all time,Backed by perhaps the most iconic sitcom ensemble ever curated, Friends has managed to stand the test of time thanks to its witty, fast-paced brand of humor. Each of the central characters often represents a different style of comedy, whether it's the absurdist hilarity of Phoebe or the dry cheek of Chandler, meaning that, for most who watch it, there’s something to fall in love with. Not just successful thanks to its comedy, Friends is also a heartwarming, relatable tale of friendship, with many in the audience, by the time the credits roll on the final episode, feeling like one of their friends, too. - Jake Hodges\n'Game of Thrones' (2011 - 2019)\nRotten Tomatoes: 88% | IMDb: 9.2/10\n- Release Date\n- 2011 - 2019-00-00\n- Showrunner\n- David Benioff, D.B. Weiss\n- Directors\n- David Nutter, Alan Taylor, D.B. Weiss, David Benioff\n- Writers\n- D.B. Weiss, George R.R. Martin, David Benioff\n- Franchise(s)\n- Game of Thrones\nCast\n-\nJon Snow\n-\nBrandon Bran Stark\n- Seasons\n- 8\nGame of Thrones is a story of politics, power, and love set against the backdrop of the fictional continents of Westeros and Essos. Beyond both lands, a deadly force threatens to rise and attack their communities, with the Night’s Watch, a military order created to defend the land, ready to face their toughest battle. Meanwhile, in the communities themselves, there is unrest, with an ongoing tug-of-war for power leaving the entirety of Westeros in uncertainty and the echoes of a once-ruling dynasty ready to rise again in Essos.\nBased on George R. R. Martin’s iconic series of fantasy novels,For many, Game of Thrones was the turning point in modern television as, for the first time on a consistent basis, tuning into the small screen was met with a visual experience that felt more visceral and grandiose than its silver screen brother. An awe-inspiring success both in gripping storytelling and big-budget CGI, the series instantly earned itself millions of adoring fans, many of whom had not even heard of the novels, thanks to its all-star British cast and dedication to unapologetically delivering on its fantasy promise. Captivating, binge-worthy, and certainly not safe to watch with your parents, viewing Game of Thrones feels like a right of passage. - Jake Hodges\n'Girls' (2012 - 2017)\nRotten Tomatoes: 89% | IMDb: 7.4/10\n- Release Date\n- 2012 - 2017-00-00\n- Network\n- HBO Max\n- Showrunner\n- Lena Dunham\n- Directors\n- Lena Dunham\n- Writers\n- Judd Apatow\n- Seasons\n- 6\nLena Dunham’s Girls is about a group of girls all in their 20s living in New York City. Specifically, the series follows wannabe writer Hannah, played by Dunham herself, art gallery assistant Marnie (Allison Williams), adventurous Jessa (Jemima Kirke), and her younger cousin Shoshanna (Zosia Mamet). Each facing their own struggles, the realities of adult life and all the pain, loss, love, and parties that go with it hit the girls like a freight train.\nAs its title suggests,Although this series is laugh-out-loud funny and touchingly tender enough to appeal to everyone, for women between 20 and 40, this is definitely the show for you. Highly relatable down to the smallest of dialogue choices and even what they have in their fridge, Girls prides itself on being the voice for the average life of millions of women who face all sorts of battles, from trivial to life-changing, every day. Poignant, beautiful, and featuring a phenomenal cast, Girls is the antidote to Sex and the City’s high-flying, often unrealistic ensemble. - Jake Hodges\n'Los Espookys' (2019 - 2022)\nRotten Tomatoes: 100% | IMDb: 7.5/10\n- Release Date\n- 2019 - 2021\n- Network\n- HBO Max\nCast\n-\nBernardo VelascoRenaldo\n-\nJulio TorresAndres\n-\nAna FabregaTati\n-\nCassandra CiangherottiUrsula\nA group of friends in a Latin American country turn their love of horror into a quirky business, staging eerie events for clients. As they navigate strange requests and supernatural occurrences, their passion for the macabre leads to hilarious and bizarre adventures.\nThis eye-popping blend of comedy, fantasy, and horror follows a group of friends who turn their passion, as well as the spooky location they live in, into their livelihood. With each of them a fan of the horror genre, the friends soon figure out that there’s a gap in the market for their content, with their faked horror movie scenarios and unexplained footage becoming an instant hit. But just how far are they willing to go?\nJust as its premise suggests, Los Espookys is both a light-hearted tale and an often genuinely terrifying visual experience. Given its dedication to nailing many of the horror tropes so beloved by fans of the genre, the team behind Los Espookys used the comedy element to their story to subvert expectations, delivering an unexpectedly dry and always intelligent brand of humor that elevates this series into a unique viewing opportunity. Supported by a talented ensemble, Los Espookys delivers in every department and will certainly leave you far from disappointed. - Jake Hodges\n'Rick and Morty' (2013 - Present)\nRotten Tomatoes: 90% | IMDb: 9.1/10\n- Release Date\n- December 2, 2013\n- Network\n- Adult Swim\n- Showrunner\n- Dan Harmon\n- Directors\n- Bryan Newton, Dominic Polcino, Anthony Chun, John Rice, Stephen Sandoval, Jeff Myers\n- Writers\n- Tom Kauffman, Wade Randolph, Eric Acosta, David Phillips, Erica Rosbe, Sarah Carbiener, Matt Roller, Michael Waldron, Caitie Delaney\nCast\n-\nSummer Smith (voice)\n-\nJustin RoilandRick Sanchez / Morty Smith\nThe fractured domestic lives of a nihilistic mad scientist and his anxious grandson are further complicated by their inter-dimensional misadventures.\n- Seasons\n- 8\nRick and Morty is a universe-hopping adventure between an unlikely duo that seems to perpetually run into trouble. Rick, the man behind the madness (or genius), is as dedicated to his scientific craft as he is polishing off a drink, with his fondness for alcohol appearing in every episode. He is joined by his 14-year-old grandson, Morty, who stands as the anxiety-induced regulator for Rick’s lunacy.\nOne of the most successful animated series of the 21st century,A double Primetime Emmy winner among countless other awards, Rick and Morty is far greater than its animated style suggests, using what many would see as a light-hearted medium of storytelling and instead often delving into issues usually saved for the world of live-action. Brilliantly funny and full of quick one-liners and visual gags, the series has become a worldwide sensation and evolved into an unstoppable brand akin to The Simpsons. Unique, regularly poignant, and always hilarious, Rick and Morty is a gem among a saturated sea of animated media. - Jake Hodges\n'Search Party' (2016 - 2022)\nRotten Tomatoes: 96% | IMDb: 7.6/10\n- Release Date\n- 2016 - 2022-00-00\n- Network\n- TBS, HBO Max\n- Showrunner\n- Michael Showalter\nCast\n-\nDory Sief\n-\nKelly Q.E. HudsonEllen\n-\nElliott Goss\n-\nMeredith HagnerPortia Davenport\n- Seasons\n- 5\nArrested Development’s Alia Shawkat as Dory Sief, a self-obsessed young adult living in Brooklyn. Alongside her boyfriend Drew (John Reynolds) and a couple of others, they become unhealthily interested in the sudden disappearance of someone from Dory’s former college. Their interest soon turns into an investigation, with Dory believing the victim to be in grave danger. The only question is, just how positive are the group’s motives?\nThis absorbing comedy/drama followsFor many who may know Alia Shawkat from Arrested Development, Search Party acts as a stark reminder of her talent, with her and the rest of the ensemble pulling off a beautifully balanced set of comically dark and alluringly unhinged performances. Tapping into the strange obsession many in the modern day have over crime, Search Party analyzes how doing the right thing doesn’t necessarily make a thing right, with the question of whether action is more important than intention a thought-provoking theme that bleeds into each scene. - Jake Hodges\n'The Leftovers' (2014 - 2017)\nRotten Tomatoes: 91% | IMDb: 8.3/10\n- Release Date\n- 2014 - 2017-00-00\n- Showrunner\n- Damon Lindelof\n- Writers\n- Damon Lindelof, Tom Perrotta\n- Seasons\n- 3\nThis Primetime Emmy-nominated series follows a terrifying unexplained phenomenon in which 2% of the world’s entire population suddenly disappears. Now, three years on from the event, a small community of people in New York is trying to put the pieces of the puzzle together to find out not just what happened but how they are expected to live and grow in the wake of such a devastating ordeal.\nFeaturing an all-star cast containing the likes of Christopher Eccleston and Justin Theroux, The Leftovers is a dramatic, twisting story full of sci-fi and mystery that will leave you gripped to the edge of your seat. Impressive in all aspects of its production, from the scripting to the direction, each episode takes the post-apocalyptic sub-genre and applies a new viewpoint. The world is not over, but it's just affected enough that the thought of continuing seems fruitless. In just three seasons of television, The Leftovers is guaranteed to leave a lasting impact on anyone who watches it. - Jake Hodges\n'The Sopranos' (1999 - 2007)\nRotten Tomatoes: 92% | IMDb: 9.2/10\n- Release Date\n- 1999 - 2007\n- Network\n- HBO\n- Showrunner\n- David Chase\n- Directors\n- Tim Van Patten, John Patterson, Alan Taylor, Jack Bender, Steve Buscemi, Daniel Attias, David Chase, Andy Wolk, Danny Leiner, David Nutter, James Hayman, Lee Tamahori, Lorraine Senna, Matthew Penn, Mike Figgis, Nick Gomez, Peter Bogdanovich, Phil Abraham, Rodrigo García\n- Writers\n- Michael Imperioli, Jason Cahill, Lawrence Konner, David Flebotte, James Manos, Jr., Salvatore Stabile, Toni Kalem, Mark Saraceni, Nick Santora\nCast\n-\nTony Soprano\n-\nCarmela Soprano\nNew Jersey mob boss Tony Soprano deals with personal and professional issues in his home and business life that affect his mental state, leading him to seek professional psychiatric counseling.\n- Seasons\n- 6\nA series that regularly appears at the top of greatest television series lists, David Chase’s The Sopranos details the life and times of doting father and often abhorrent mobster Tony Soprano (James Gandolfini). Moving between life at home, on the job, and on the therapy couch, Soprano’s days are explored in gripping detail as the upholding of his own multi-faceted life begins to crumble before him.\nEndlessly quotable, packed full of action, and gutwrenchingly emotional, The Sopranos to this day is just as impactful as it was upon release, with each of the central characters feeling utterly relatable but thankfully other-worldly. The creation of Tony Soprano still stands as one of screen media’s most well-rounded characters, with his spiraling criminal immorality perfectly juxtaposed by the admirable way he loves his family and community. Full of unforgettable episodes highlighted by the iconic “Pine Barrens,\" many would consider The Sopranos, abrupt ending and all, to be the showcase piece for modern television. - Jake HodgesWatch on Max\n'The Wire' (2002 - 2008)\nRotten Tomatoes: 94% | IMDb: 9.3/10\n- Release Date\n- 2002 - 2008-00-00\n- Network\n- HBO\n- Showrunner\n- David Simon\n- Directors\n- Ernest R. Dickerson, Ed Bianchi, Steve Shill, Clark Johnson, Daniel Attias, Agnieszka Holland, Tim Van Patten, Alex Zakrzewski, Anthony Hemingway, Brad Anderson, Clement Virgo, Elodie Keene, Peter Medak, Rob Bailey, Seith Mann, Christine Moore, David Platt, Dominic West, Gloria Muzio, Jim McKay, Leslie Libman, Milcho Manchevski, Robert F. Colesberry, Thomas J. Wright\n- Writers\n- Richard Price, Joy Lusco, Rafael Alvarez, Dennis Lehane, David Mills, William F. Zorzi, Kia Corthron\nCast\n-\nJimmy McNulty\n-\nCedric Daniels\n- Seasons\n- 5\nDominic West as Prince Charles in The Crown… think again. The Wire stars the actor as Detective Jimmy McNulty, one of many police officers in the Baltimore area charged with targeting the war on drugs. Focusing on the lives of those both on the force and in the criminal world, The Wire captures a multitude of highly-detailed angles on a subject that hit the nation so hard at the turn of the millennium.\nFor those who knowBy also recognizing the way both the media and politicians affected the drug crisis, The Wire has cemented itself as one of the most poignant, visceral, and well-observed pieces of television of the past 25 years. By holding up a mirror to our own world, made even more accurate thanks to creator David Simon’s own experiences as a police reporter, The Wire felt almost documentary-like upon release and has still not lost even a slither of its gutwrenchingly relatable impact. From its captivating performances to its penchant for a cliffhanger, The Wire has rightfully earned itself a place in the annals of great TV. - Jake HodgesWatch on Max\n'True Blood' (2008 - 2014)\nRotten Tomatoes: 68% | IMDb: 7.9/10\nCast\n-\nKristin Bauer van Straten\n- Seasons\n- 7\nA series that has maintained its cult following to this day, True Blood is set in a modern world where vampires roam alongside humans, with both sworn enemies for many a year, as the former needs the latter's blood to survive. However, when the titular true blood is discovered, it is quickly realized that vampires no longer need to fight humans to live. But just how easily will these long-thought mortal enemies be able to live side by side?\nBeloved by millions for its dedication to the fantasy genre and elements of vampire storytelling that are soaked in literary history, True Blood excels at providing thrills and bloody spills aplenty. Beginning in 2008 during the vampire/romance boom (here’s looking at you Twilight), True Blood still stands the test of time as not just the product of a trend but a series with a gripping story that simply happened to be in the right place at the right time. Tense, action-packed, and full of high drama, True Blood still maintains its cult following for good reason. - Jake HodgesWatch on Max\n'True Detective' (2014 - Present)\nRotten Tomatoes: 74% | IMDb: 8.9/10\n- Release Date\n- January 12, 2014\n- Network\n- HBO Max\n- Showrunner\n- Nic Pizzolatto\n- Directors\n- Cary Fukunaga\n- Writers\n- Nic Pizzolatto\nCast\n-\nRust Cohle\n-\nRay Velcoro\nAnthology series in which police investigations unearth the personal and professional secrets of those involved, both within and outside the law.\n- Seasons\n- 4\nTrue Detective, created by Nic Pizzolatto, stars Matthew McConaughey and Woody Harrelson as detectives Rust Cohle and Marty Hart, respectively. On one seemingly ordinary day, the pair are assigned a case neither expected, which takes them back to a homicide investigation they both served on some 17 years prior. Subsequently, both men start to unravel more mysteries surrounding the case, as well as each other’s dark pasts — pasts they have buried beneath the rubble of many an investigation.\nThought of by many to be the greatest anthology series in 21st-century television,A crime thriller as thrilling as they come, True Detective is just as thought-provoking as it is tense-ridden, with each episode full to the brim with twists and turns often impossible to see coming. Known for the performances of McConaughey and Harrelson, True Detective is also famed for its penchant for having a few star-studded names drop by, with the likes of Colin Farrell and Rachel McAdams joining the show’s ensemble. Dynamic, innovative, and damn right entertaining, for those who haven't seen it, True Detective is well worth an investigation. - Jake Hodges\n'Veep' (2012 - 2019)\nRotten Tomatoes: 93% | IMDb: 8.4/10\n- Release Date\n- 2012 - 2019-00-00\n- Network\n- HBO Max\n- Showrunner\n- Armando Iannucci\n- Directors\n- Armando Iannucci\n- Writers\n- Armando Iannucci\n- Seasons\n- 7\nArmando Iannucci, Veep follows former Senator Selina Meyer (Julia Louis-Dreyfus) after her failed bid to become President lands her in the role of VP. Always with her sights on the big prize, what Selina had imagined top-tier politics to be like is far from its reality, with her soon bombarded with PR nightmares and political mishaps aplenty. Whilst also trying to get a grip on her private life, can Selina steady the sinking ship of modern politics?\nCreated by political satirist extraordinaireFor those unfamiliar with his work, creator Armando Iannucci had, prior to the release of Veep, been working his satirical genius across the pond on The Thick of It, a similar series focusing on the lives of British politicians. For many, that series walked so Veep could run, with this feeling like the culmination of Iannucci’s previous work. Supported by an excellent cast, Veep breaks down the walls of US politics and opens up the inside for scrutiny, like a live autopsy conducted by Professor Iannucci. Brilliantly observed, devilishly funny, and furiously fast, Veep feels like an absurdist comedy meets a political documentary. - Jake Hodges\n'Watchmen' (2019)\nRotten Tomatoes: 96% | IMDb: 8.2/10\n- Release Date\n- 2019 - 2019-00-00\n- Network\n- HBO\n- Directors\n- David Semel, Fred Toye\n- Writers\n- Nick Cuse, Carly Wray\nCast\n-\nDavid AndrewsDeputy Director Farragut\n-\nJunie HoangVietnamese Headmistress\nSet in an alternate history where masked vigilantes are treated as outlaws, Watchmen embraces the nostalgia of the original groundbreaking graphic novel of the same name, while attempting to break new ground of its own.\n- Seasons\n- 1\nWatchmen series after a failed HBO project from the mind of Terry Gilliam, this adaptation follows Detective Angela Abar (Regina King) as she tries to keep the peace in an alternate world where mysterious vigilantes roam the darkness on the run from the law and the on the hunt for criminals. Angela’s efforts are set to face their biggest test yet as an abhorrent white supremacist group begins to rise again — but can they be stopped?\nThe second attempt at aIt’s no coincidence that this series has won 11 Primetime Emmys in just one outing, with the sweeping, dark, cinematically gorgeous setting playing host to a tale of good vs evil ready to light the fire in all of our stomachs. Accompanied by a catchy soundtrack, each episode is bathed in a brooding, tense atmosphere that feels neverending, with the promise of a twist and turn at any moment just one of the reasons Watchmen should be considered a triumphant adaptation. - Jake HodgesWatch on Max",
  "word_count": 20325,
  "scraped_at": "2026-02-14T12:42:08.475188"
}