{
  "article_id": "4c8b60826f02",
  "url": "https://www.ledburyreporter.co.uk/news/25208727.lionesses-shown-big-screen-cathedral-square/",
  "title": "Lionesses could be shown on big screen in Cathedral Square",
  "date": "20250608T073000Z",
  "domain": "ledburyreporter.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "THE Women’s Euros and other major sporting events could be shown on a big screen in Cathedral Square this summer.\nPlans to put up an eight square-metre screen behind the bus stop have been put forward.\nCScreens wants to put the screen up in time for the start of the Wimbledon tennis championships on June 20 and take it down after the Women’s Rugby World Cup final on September 27.\nThe Women’s Euros takes place from July 2-27 and will see England attempt to defend their title in Switzerland.\nThe Lionesses will play France, Wales and the Netherlands in the group stage of the competition.\nAlso coming up this summer and could be shown on the big screen is the British and Irish Lions tour of Australia, The Open golf championship and live cricket including the Vitality Blast, The Hundred and England’s test series against India.\nIn plans submitted to Worcester City Council, CScreens says: “We install and pay for a Sky Public license on our screens. This public license is the same as a pub or a bar pays for and this allows us to show the sporting action through a Sky box we will connect within the box.\nRead more\n“In the mornings, prior to the sporting content being live we will create a ‘Cathedral Square TV’ channel.\n“The screen will come on at 8am, and we will create a content loop with a mixture of site information, BID/council information, Visit Worcester information etc and split this up with on-screen advertising.”\nThe company says it has “not had a single problem across any site with any women’s football being shown” and that it has not needed to fence off its screens.\nBut it adds: “We will never show men’s football as this brings in a different crowd, unless the site would like to build an event around this content.”\nIt says the cost of installing the screen will be taken on by a sponsor.",
  "word_count": 326,
  "scraped_at": "2026-02-14T12:35:40.189865"
}