{
  "article_id": "4ca1a8fc7941",
  "url": "https://www.manchestereveningnews.co.uk/news/showbiz-news/david-beckham-pictured-reading-keeping-28367038",
  "title": "David Beckham pictured reading  Keeping Chickens for Dummie after another Knighthood snub",
  "date": "20231230T114500Z",
  "domain": "manchestereveningnews.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "David Beckham pictured reading 'Keeping Chickens for Dummies' after another Knighthood snub\nBeckham was made an OBE in 2003 - but his quest for a Knighthood has been fruitless so far\nVictoria Beckham shared a photo on Instagram showing husband David looking pre-occupied and pensive as the England legend missed out on a knighthood once again.\nThe dad-of-four, who was was appointed an OBE for services to football in June 2003, and has made it clear he is keen to be known as Sir David Beckham one day - but the retired footballer is still waiting for his much-wanted knighthood from the British establishment.\nLast night, the star was missing from the New Years Honours list - while other sporting heroes including Mary Earps and Peter Shilton were celebrated, The Mirror reports. David's wife Victoria took to social media on Friday night to share a candid snap of her husband looking deep in thought while reading a book.\nREAD MORE: Fool Me Once on Netflix: When it's on, what it's about and how many episodes there are\nREAD MORE: Richard Madeley leaves Good Morning Britain viewers 'gobsmacked' over tornado victims question\nVictoria poked fun at the dad-of-four as he enjoyed a late night read of 'Keeping Chickens for Dummies'. The family own a sprawling home and garden in the Cotswolds and regularly update on their cosy country life.\nDavid has hit the headlines again this year with the release of the Netflix documentary Beckham. However, his popularity with viewers and reflection on his career did not steer the New Years Honours list as the star was missed yet again.\nAnd last year, David, 48, spent over 13 hours in line to pay his respects to Queen Elizabeth II in 2022, but it wasn't enough for him to secure a nod from the new unelected head of state King Charles in the 2023 New Year Honours list - and it seems David still hasn't done enough to impress the monarchy throughout this year, with the football legend snubbed from the 2024 list too.\nAfter being caught up in the Ingenious tax avoidance scheme in 2013, David was cleared of wrongdoing and added back to the official recommendations list in 2022. However, leaked emails in 2017 are perhaps still damaging his chances of being recognised by King Charles and co for his achievements or his service to his country.\nIn the leaked emails, David expressed his anger at the honours committee for leaving him out. He referred to them as \"unappreciative c***s\" and stated that he didn't \"care about being knighted\".\nHe is also said to have written: \"I expected nothing less. It's a disgrace to be honest and if I was American I would of got something like this 10 years ago.\" The former Real Madrid player also seemed to criticise the decision to award Welsh singer Katherine Jenkins an OBE in 2014. Allegedly, the retired sports star typed: \"For what? Singing at the rugby and going to see the troops.\"\nIt's not just leaked emails possibly delaying Golden Balls becoming Sir David, with the former England captain slammed for his controversial decision to take an ambassador role for Qatar, reportedly earning him £150 million over 10 years. David's role even prompted comedian Joe Lycett to beg the former gay idol to reconsider his decision, with the comic pretending to shred £10,000 in protest last year before revealing it had been donated to LGBTQ+ charities.\nAustralian sports star Josh Cavallo, the only openly gay top-flight male footballer, reacted with \"Take that David Beckham\" upon being named Man of the Year at the Attitude awards. Even the magazine itself, which previously featured David on its front cover in 2002, criticised him.\n\"The fall of David Beckham's star has been fast and heavy,\" commented editor-in-chief Cliff Joannou. \"It's a reminder that being an advocate for not just LGBTQ+ rights, but women's rights, immigrant workers' rights... and any human rights should not be lip service. It's not a trend to boost a person's profile.\n\"Human rights are not a fashion statement, they are real issues that affect the livelihood of billions of vulnerable people around the country. Joe Lycett's prank worked to highlight the flippant attitude David Beckham has to human rights.\n\"And what price tag he had in order to turn a blind eye to the corruption that awarded Qatar the World Cup by Fifa. It all amounts to making this year's so-called 'beautiful game' a truly ugly moment for sport.\"",
  "word_count": 748,
  "scraped_at": "2026-02-14T12:30:24.568756"
}