{
  "article_id": "4cc39b16d9d5",
  "url": "https://www.juneesoutherncross.com.au/story/9139625/glory-down-lowly-reds-to-kickstart-alw-finals-push/",
  "title": "Glory down lowly Reds to kickstart ALW finals push",
  "date": "20251221T130000Z",
  "domain": "juneesoutherncross.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Rola Badawiya has scored the match-winner to launch Perth Glory to a 1-0 win over Adelaide United and into the A-League Women top six.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe Glory move to sixth and the Reds slump to last on the table after Badawiya's 39th-minute goal at the Sam Kerr Football Centre proved the difference on Sunday.\nStephen Peters' side logged back-to-back wins for the first time this season after snapping a four-game losing streak with a 1-0 win over Wellington Phoenix last round.\nAdelaide United are 11th, with just one win after six games under new coach Theo Tsiounis.\nThe visitors dominated possession but lacked polish in attack in star forward Fiona Worts' absence.\nWorts and captain Isabel Hodgson had withdrawn from the match-day squad to attend separate weddings, with the former travelling to England.\nAdriana Taranto and Chelsie Dawber were left to lead the Reds' attack, but fell short of scoreboard reward in the first half.\nDespite trailing on shots by 8-5 at halftime, Perth landed the first blow when Badawiya reacted the quickest to salvage the crumbs of Bronte Trew's shot.\nIt was American forward Badawiya's third goal for the Glory since making the move from last year's champions Central Coast.\nErin Healy tried to answer the call in the second half to keep Adelaide in the game and caused chaos across both wings.\nAttacking midfielder Healy first set up Emily Hodgson in the 59th minute, but the shot was easily collected by goalkeeper Teresa Morrissey.\nHealy couldn't add the finishing touches when Hodgson returned the favour seven minutes later, sending her strike too wide while fending off two Glory defenders.\nThe Irish international popped up again in the 72nd minute with a cross from the left wing, but Lara Gooch's header went straight into Morrissey's gloves.\nAdelaide will be left lamenting their wastefulness after taking a total of 17 shots to Perth's eight.\nAustralian Associated Press",
  "word_count": 326,
  "scraped_at": "2026-02-14T12:50:30.178204"
}