{
  "article_id": "4ccdb548d3ac",
  "url": "https://www.theguardian.com/tv-and-radio/2025/mar/15/tv-tonight-an-epic-greek-train-adventure-with-alice-roberts",
  "title": "TV tonight : an epic Greek train adventure with Alice Roberts",
  "date": "20250315T071500Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Ancient Greece By Train With Alice Roberts\n8pm, Channel 4\nAlice Roberts has railed her way around Egypt and the Ottoman empire; now it’s time for the popular professor to embark on a Greek odyssey. She starts in Thessaloniki, a northern city that was home to Alexander the Great. Then she boards another train to Delphi, which has one of the greatest ancient sites in the world. Hollie Richardson\nNational Trust: Our Dream Farm With Matt Baker\n7pm, Channel 4\nA huge farm in Eryri (Snowdonia) national park needs a new tenant, and Matt Baker is going to help choose from seven eager applicants. They start by herding a flock of more than 130 sheep. Whoever wins gets to spend the night in the farmhouse with views of Wales’s highest mountain, Yr Wyddfa. HR\nLady Gaga: Inside the Chaos\n8.30pm, BBC Two\nJust dance: a night with pop’s “mother monster” begins with this half-hour conversation between her and the BBC’s music correspondent Mark Savage. Gaga will talk about her new bop-filled album, Mayhem, and open up about life with her new fiance. A collection of archive performances follows at 9pm. HR\nThe One That Got Away\n9pm, BBC Four\nMost crime dramas are about long-buried secrets, but this Welsh series has layered its old shame and regret more thoughtfully than others. The final double bill entwines detectives Ffion (Elen Rhys) and Rick’s (Richard Harrington) personal and professional lives with some skill, adding big thriller twists on top. Jack Seale\nDope Girls\n9.15pm, BBC One\nIt is time for the club’s reopening, which for Kate (Julianne Nicholson) means getting into bed with Soho’s premier crime family. She’ll find Sgt Turner (Ian Bonar) is already tucked in and under increased pressure – from Isabella Salucci (Geraldine James) and his boss back at the station. Ellen E Jones\nEnya at the BBC\n10pm, BBC Two\nWith St Patrick’s Day looming, a late night of Celtic music kicks off with Ireland’s most successful solo artist. Her beguiling blend of celestial vocals and reverb-soaked synths turned Enya’s flotation-tank pop into a sales juggernaut. But she has never gone on tour, making this compilation one to cherish. Graeme Virtue\nFilm choice\nThe Electric State, out now, Netflix\nIn between Avengers outings, Anthony and Joe Russo dip into dystopian fiction with this sparky adventure. A cross between Spielberg’s AI: Artificial Intelligence and Toy Story, it’s set in the aftermath of a human v robot war that humans won due to neural headsets invented by Stanley Tucci’s tech grandee. Millie Bobby Brown is our heroine, an orphan who goes on a quest into the “exclusion zone”, where the sentient machines are corralled, after a little robot turns up claiming to be her dead brother. Chris Pratt is a dodgy trader (with a heart of gold, naturally) who accompanies her into a land of weird and wonderful bots, voiced by the likes of Anthony Mackie, Woody Harrelson and Brian Cox. Simon Wardell\nBridesmaids, 9pm, ITV2\n“It’s coming out of me like lava!” This 2011 comedy is justly famous for one particular food poisoning scene, but it’s a hoot from start to finish. A career high for its director, Paul Feig, and most of the cast, it stars Kristen Wiig (who also co-wrote) as the sad’n’single Annie, who is asked by Maya Rudolph’s Lillian to be her maid of honour. She soon finds herself in a competition with Rose Byrne’s prettier, richer Helen for Lillian’s favour – which leads to a series of disasters. Melissa McCarthy steals the show, which is some feat in such august comic company. SW\nLive sport\nWomen’s League Cup Football: Chelsea v Man City, 11.45am, BBC One The final from Pride Park, Derby.\nSix Nations Rugby Union: Italy v Ireland, 1.30pm, ITV1 Wales v England is at 4pm on BBC One, then France v Scotland is at 7.15pm on ITV1.\nPremier League Football: Bournemouth v Brentford, 5pm, Sky Sports Main Event Arsenal v Chelsea is at 1.30pm on Sun on Sky Sports Main Event.\nFormula One: Australian Grand Prix, 3.55am, Sky Sports Main Event The first round in Melbourne, where Lewis Hamilton will make his Ferrari debut.",
  "word_count": 692,
  "scraped_at": "2026-02-14T12:35:00.388508"
}