{
  "article_id": "4cf5159aa905",
  "url": "https://www.standard.co.uk/showbiz/lioness-millie-bright-dachshund-puppy-after-world-cup-defeat-b1102202.html",
  "title": "Lionesses captain Millie Bright introduces new puppy as team returns following World Cup disappointment",
  "date": "20230822T114500Z",
  "domain": "standard.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Lionesses captain Millie Bright introduces new puppy as team returns following World Cup disappointment\nEngland captain Millie Bright has introduced her new puppy to her social media followers after returning from Australia following the Lionessess’ World Cup disappointment.\nThe sports star took to her Instagram Story on Tuesday to share a sweet selfie with the miniature cream dachshund and introduce the pooch, named Elsa, to her 370,000 followers.\nBright revealed she had been gifted the canine by her boyfriend, Levi Crew, for her 30th birthday on Monday and later shared a second of the pup resting on their couch.\nThe couple already have two dogs, French bulldog Zeus and another miniature dachshund named Hera, who featured on her Instagram regularly.\nThe athlete’s post comes after the Lionesses landed back in the UK on Tuesday morning after their World Cup final defeat. The team flew into Heathrow Airport but are understood to have left via a private exit after touching down just after 6.30am.\nElsewhere, Bright said she was “heartbroken” after the Lionesses fell to Spain in the Women’s World Cup final in Sydney.\nSarina Wiegman’s side had gone unbeaten in the tournament en route to Sunday’s final in Sydney, but Olga Carmona scored the only goal of the game in the first half to ensure it was Spain winning their first Women’s World Cup, not England.\nBright said: “This is really hard to take. We gave it everything. In the first half we weren’t at our best, we bounced back in the second half. We had chances, hit the bar but we just didn’t have the final edge and they got theirs in back of the net.\n“There was a lot of belief. We have been 1-0 down and we never give in”, she added in an interview with BBC One. “It’s hard to take but it’s football. We’re absolutely heartbroken. We gave everything. Unfortunately we just weren’t there today.”\nShe spoke with pride about her players, who reached the first-ever Women’s World Cup final.\n“A massive amount of pride. The girls were unbelievable. We had a lot of critics, a few lost belief in us but we never stopped believing. Sometimes football goes for you, sometimes against you. We played in a World Cup final. In a few weeks we will appreciate this day, but we wanted to be winners.”",
  "word_count": 391,
  "scraped_at": "2026-02-14T13:04:18.914904"
}