{
  "article_id": "4cf687db08a8",
  "url": "https://weisradio.com/2023/03/30/are-student-athlete-nil-deals-a-boon/",
  "title": "Are student - athlete NIL deals a boon ? - WEIS | Local & Area News , Sports , & Weather",
  "date": "20230331T034500Z",
  "domain": "weisradio.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "(NEW YORK) — Student-athletes across the country are cashing in on their talents through ads, social media posts and other media, thanks to a 2021 Supreme Court decision.\nNow some athletes have found a place in the spotlight through business agreements related to their “name, image and likeness,” known as NIL deals.\nHanna and Haley Cavinder, twin sisters who play for the University of Miami’s basketball team, reportedly pull in more than $1.6 million a year combined due to their sponsorships, according to On3, which tracks NIL deals among student-athletes.\n“Impact x Nightline” takes a look at the debate over this trend among student-athletes in an episode now streaming on Hulu.\n“We’re Champs athletes, and then we have WWE,” Haley Cavinder told “Impact x Nightline’s” Ashan Singh.\n“And then, we have LifeWallet, Cigarette Racing,” Hanna Cavinder added.\n“Then we also have a company called Baseline, which is college streetwear. We have equity in that,” Haley Cavinder said.\nBut as more young athletes continue to collect on their names and likenesses, some sports experts and coaches question if the trend is moving too fast.\n“I think high school athletes, or even college athletes who want to monetize their NIL, need to understand that just highlighting your sport and those, like, action shots of you on field isn’t going to be enough,” Kristi Dosh, a sports attorney and founder of Business of College Sports, told “Impact.”\nA key component that has set apart NILs from other sports earnings is the idea that the athletes still remain unpaid by their schools, but they are able to earn money on their popularity outside of games. This includes advertisements, sponsorships and promoted social media posts.\nESPN’s Ryan Smith told “Impact” that NIL sponsorship offers can come in all shapes and sizes — from local car dealerships to major corporations. In some cases, the athletes can make the brand deals themselves, according to Smith.\n“When the Supreme Court handed down that decision, it changed everything,” he told “Impact.” “What it is…the student athletes, being able to go out and say, ‘Hey. I’m willing to lend my name to this particular product, and you can sell it, and you pay me for that.'”\nThe Cavinder twins already had a large following on TikTok prior to the Supreme Court decision and they said they decided to jump on the NIL bandwagon.\n“We heard about NIL eventually being a thing. Maybe we could take advantage of the opportunity,” Hanna Cavinder said.\nThe twins scored a major partnership with Boost Mobile and soon other companies wanted to tap into their social media star power.\nAnother component of NILs is “NIL collectives,” which are usually founded by wealthy donors who are alumni and super fans who pool money together to give benefits to college athletes coming to the university they champion.\nBillionaire lawyer, businessman and University of Miami alum John Ruiz has signed deals with the Cavinder twins through his companies, LifeWallet and Cigarette Racing. He dismissed critics who argued that businesses like his are buying athletes and brushed off concerns that the deals put too much pressure on them.\n“That’s what life is about, right? You’re not going to have Mommy and Daddy there around you when you have to deal with real life. So you have to, you know, become a big boy or big girl real quick,” Ruiz told “Impact.”\nWeeks after their interview with “Impact,” the first punishment of the NIL era was handed down to the University of Miami centered around an alleged dinner between Ruiz and the Cavinder twins when the twins were transfer prospects.\nSuch a meeting with someone the NCAA deems a booster prior to a student athlete’s acceptance to a school violates the association’s rules.\nIn February, the NCAA issued sanctions on the school’s women’s basketball program for its recruitment of the twins, claiming Ruiz provided an impermissible meal. No sanctions were imposed on the Cavinders or Ruiz.\nAt the time, a photograph, tweeted by Ruiz, showed the twins and their parents at Ruiz’s home prior to their commitment to the university.\nThe University of Miami’s women’s basketball Coach Katie Meier was suspended for three games during the NCAA investigation, which said Meier inadvertently facilitated the meeting.\nMeier released a statement saying, “collegiate athletics is in transformation, and any inadvertent mistake I made was prior to a full understanding of implemented guardrails and the clarification issued by the NCAA in May.”\nRuiz told ABC News in a statement that the twins didn’t have an impermissible meal at his home and that any meal took place after the twins transferred to the school.\n“The facts contained in the NCAA’s findings were incorrect in several ways,” he said in a statement. “Coach Meier did nothing more than express her excitement about the fact the twins were coming to Miami. No one ever attempted to entice the Cavinders into attending UM.”\nA representative for the Cavinders told ABC News “the twins were found to have done nothing wrong” and they did not want to comment on other’s infractions.\nDosh, a former ESPN analyst, said there is even more debate about the use of NIL deals at the high school level.\n“Now we have more than half of the states that have changed their rules at their state high school athletic association to allow NIL,” she said.\nBronx teen Johnuel “Boogie” Fland, who plays basketball for Archbishop Stepinac, a private school in White Plains, Westchester County, became one of the first New York City high school athletes to receive a NIL deal.\nFland said he couldn’t tell “Impact” how much he’s raked in with his sponsorships, but said he estimated it was “six figures.”\n“It changed my family. It changed the way we looked at things, you know?” he told “Impact.” “Being from the Bronx, we aren’t that wealthy, it definitely changed my life.”\nThe landscape for NIL has potentially changed financial outcomes for some student-athletes and families, some of whom may have may come from lower income communities, according to a 2020 study by the Hope Center at Temple University.\nResearchers found that nearly 14% of Division 1 athletes had experienced homelessness in the previous year… and nearly a quarter were food insecure in the prior 30 days.\nAl Crosby, who has been coaching high school football in Philadelphia for 20 years, told “Impact” he has had players come from low-income households and acknowledged that they are looking for ways to help their families.\nHowever, he said he was concerned that NIL deals may cause issues for athletes from inner city neighborhoods. Crosby noted that a lot of inner-city student-athletes are already targets of violence and harassment.\n“All of a sudden this guy gets this deal, this NIL deal, that says, ‘You got a NIL deal for $500,000.’ Well, now, all of a sudden, he’s not only a target, but he’s got a price tag with him, too,” Crosby told “Impact.”\nCrosby maintains that proper management and education is needed for high school athletes to thrive in the NIL era.\nOn Wednesday, the House Subcommittee on Energy and Commerce held a hearing about NILs, the first in more than two years. Up for discussion was a potential federal NIL law that would provide clarity and transparency for athletes.\n“In short, we must strike a delicate balance between the rights of college athletes to profit from their own NIL while keeping the amateur status for all college athletes,” Rep. Gus Bilirakis (R-Fla.), the subcommittee’s chairman said.\nABC News’ Kevin Rochford and Kyle Rollins contributed to this report.\nCopyright © 2023, ABC Audio. All rights reserved.",
  "word_count": 1269,
  "scraped_at": "2026-02-14T13:07:22.328214"
}