{
  "article_id": "4cf999a45620",
  "url": "https://www.liverpoolfc.com/news/matt-beard-column-leicester-cup-test-anfield-derby-and-natasha-dowie-pride",
  "title": "Matt Beard column : Leicester cup test , Anfield derby and Natasha Dowie pride",
  "date": "20231011T084500Z",
  "domain": "liverpoolfc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "LFC WomenMatt Beard column: Leicester cup test, Anfield derby and Natasha Dowie pride\nIn his latest column, Liverpool FC Women manager Matt Beard looks ahead to a busy week of league and cup football, including Sunday's Anfield derby with Everton Women, and pays a special tribute to Natasha Dowie.\nI am delighted with our start to the season, getting two wins and two clean sheets. It was a really pleasing team performance against Aston Villa and I’m obviously pleased with the start we have made but we need to make sure that we keep our feet on the ground and keep improving.\nIf you look back on the Arsenal game, I thought we started a bit slow but we started quickly against Aston Villa. We got into good positions and opened them up time and time again and we could have had a couple before Marie Höbinger’s fantastic goal.\nThe big thing for me is, and I say this time and time again, as long as we are creating chances we need to make sure that we are converting them.\nPre-season was a similar pattern in terms of the amount of chances we created, so that’s the pleasing thing. But I know that as the season goes on we will convert those chances. But it has been a great start for us.\nIt was some strike from Marie to give us the lead but I wasn’t surprised as we see it from her in training every day. She is two-footed, she just drops her shoulder and lets fly. Just a fantastic finish. I was really pleased for Marie because I believe she has definitely got goals in her locker because, as you saw, she can strike a ball.\nI was also delighted for Natasha Flint to get her goal, which was her first official goal for the club. It was a great finish after some fantastic play from Melissa Lawley. We’ve missed Mel, the way she drives with the ball, slows down and then she goes again. It was trademark Mel Lawley.\nI’m really pleased for Mel because she is such an infectious character. The way she handled the rehab after her operation and got through it all has been second to none. We are really proud of her and what a way it was to announce her return.\nDefensively we have been very good so far this season. I also thought Taylor Hinds was excellent both defensively and going forward. The whole unit, just how organised they are, how they work, shutting the space down and also Marie, Ceri [Holland] and Fuka [Nagano] covered a lot of ground.\nWe have given ourselves a good platform to build on and I think if you look at the start we have been given, I don’t think anyone would expect us to be sitting there on six points.\nI keep reading how shocked everyone was about us beating Arsenal. I wasn’t because I know what we’ve got here and I know what we are doing here. But what we must make sure of is we keep doing the right things.\nTonight we start our Continental League Cup campaign with a trip to face Leicester City at Burton Albion (kick-off 7pm BST). I will be rotating the squad but I have said all along that we want to do well in the cup competitions this season.\nOur Australia international goalkeeper Teagan Micah will make her competitive debut. We need to look after people minutes-wise, especially the ones who were away on international duty before the start of the season.\nLawsy [Rachael Laws] has been brilliant in our first two games. Last pre-season she missed a large chunk of it through injury and when you miss a lot of that you are always playing catch-up. Lawsy had a great pre-season, she is healthy and strong and she has really excelled.\nTeagan is an excellent goalkeeper herself and we have got great competition this season in the squad, which is what I wanted.\nWe’ve played two Barclays Women’s Super League games and already we’ve played two lots of 105 minutes in each game! That is a lot on the players and a lot of demand on them.\nIt’s like playing half an extra-time just after the 90 minutes and I said after the Aston Villa game that this needs to be looked at because we need to protect the players.\nWe want to do well in the cups and we will still be strong. It will be exciting to give the likes of Mia [Enderby] and Flinty [Natasha Flint] a start, give Jas [Jasmine Matthews] some minutes and Sofie [Lundgaard] and Miri [Taylor] have been patient as well. I want to give them a chance to get on the pitch and see what they can do, so I’m looking forward to seeing what they can offer.\nWe feel we’ve got the depth in the squad now to be able to compete on all fronts. I will use the Continental Cup to rotate and keep all of the players match-fit, give the players a rest that need it.\nOn Sunday, of course, we are all excited to get the opportunity once again to play in front of the Kop at Anfield when we face Everton in the WSL derby (kick-off 4.30pm BST).\nWhenever you play at Anfield it’s an amazing occasion and we are very much looking forward to it. I think we have learned a lot and grown a lot since we played there last season against Everton. It’s still going to be a big occasion for us but we’ve played at Emirates Stadium, Villa Park, Goodison Park as well as Anfield, so we are in a position where it shouldn’t faze us.\nI felt the occasion got to us a little bit last season and obviously we don’t like losing to our main rivals, especially at Anfield.\nWhenever you play at Anfield and you hear You’ll Never Walk Alone, it’s a completely different scenario to when we do it at Prenton Park. Don’t get me wrong, it’s still spine-tingling, but at Anfield it’s just so special.\nIt’s like us being at the AXA Melwood Training Centre now. Anfield is just an iconic, special stadium, like this is an iconic training ground.\nOur fans are fantastic. They were incredible at Arsenal and the same against Aston Villa. They have stuck with us through thick and thin and we want to make them proud again on Sunday.\nWe know it’s only two games into the WSL season and we certainly are not getting carried away. It’s just a game at a time. We will concentrate on Leicester first – hopefully get another win – and then we will turn our attention to the Merseyside derby.\nBefore Sunday’s game we have the opportunity to say thank you to a club legend as Natasha Dowie says goodbye to her playing days – but certainly not her involvement with the club. We will form a guard of honour for Tats ahead of the game.\nI was so pleased that I was able to bring her back to Liverpool to finish her playing career. She was such a big help for us when she came in, even when she got injured, because she was great for the younger players, talking to them and just her knowledge of the game.\nI love the fact that she is an LFC ambassador and I love the fact that she is working with our U18s as well, and she deserves that.\nThe big thing for me is that Tats is just a wonderful person. She has been an absolutely great servant to women’s football. Just look at her career: playing for Everton, ourselves, I worked with her at Charlton Athletic for a little bit and with the Boston Breakers.\nShe has been to some amazing countries to play football and she should be so proud of what she has achieved throughout her football career.\nIt’s exciting that she is still involved with Liverpool FC and I’m really looking forward to seeing what she does in the future.\nThank you, as always, for your continued support.\nYNWA,\nMatt\nMatt Beard was speaking to Liverpoolfc.com's Steve Hunter",
  "word_count": 1371,
  "scraped_at": "2026-02-14T12:40:55.914463"
}