{
  "article_id": "4d06efe78c73",
  "url": "https://www.90min.com/chloe-kelly-turns-down-brighton-bid-transfer-drama",
  "title": "Chloe Kelly turns down Brighton bid amidst transfer drama",
  "date": "20250130T120000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Chloe Kelly turns down Brighton transfer amid January drama\n- Chloe Kelly has said she knows her future is no longer with Manchester City\n- Brighton and Man Utd are among clubs expressing interest in the forward\n- Reports suggest player has turned down a move down south as transfer rumours heat up\nChloe Kelly has reportedly rejected interest from Women's Super League (WSL) club Brighton & Hove Albion after taking to social media to express her frustration at Manchester City.\nThe England forward posted bluntly on Wednesday evening, explaining her dismay with City's refusal to let her depart the club during the transfer window.\nKelly, whose current contract expires in the summer, wrote that she has \"accepted my future is not at this club beyond then\".\nBrighton were among the other WSL names seeking to sign the 27-year-old on a loan deal, but emerging reports from Sky Sports suggest that the Lioness isn't interested in a south coast move.\nKelly is said to have turned down the interest from the Seagulls, as \"her preference is to stay in Manchester due to family and location.\"\nSpeaking on social media platform Instagram, the forward went on to add: \"With the Euros fast approaching, this summer is a huge one and I want to be in a position to give it my best shot to represent my country.\n\"However, to be dictated whom I can and can't join with only four months left of the football season is having a huge impact on not only my career by my mental wellbeing.\"\nThe post comes after previous rumours linking the player to a loan to City rivals Manchester United. The Red Devils were believed to have shown interest in acquiring the forward on a deal for the remainder of the 2024/25 season, but any movement toward a potential deal is said to have stalled.\nWith the WSL transfer window set to close on Thursday 30 January at 23:00 GMT, it is unclear whether or not Kelly will reach her desired outcome within the short turnaround.",
  "word_count": 342,
  "scraped_at": "2026-02-14T13:19:57.142245"
}