{
  "article_id": "4d2f193ff168",
  "url": "https://www.globaltimes.cn/page/202409/1319615.shtml",
  "title": "Hope Chinese men national soccer team will truly  recognize shame and inspire bravery  : Global Times editorial",
  "date": "20240910T173000Z",
  "domain": "globaltimes.cn",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Hope Chinese men’s national soccer team will truly ‘recognize shame and inspire bravery’: Global Times editorial\nThe Chinese team hosts Saudi Arabian team in Dalian for a 2026 FIFA World Cup Asian Football Confederation qualifier game on September 10, 2024. Photo: Cui Meng/GT\nOn Tuesday, the General Administration of Sport of China and the Ministry of Public Security held a joint news conference in Dalian, Northeast China's Liaoning Province, about their crackdown on match-fixing, betting, and biased refereeing in professional football leagues. The conference reported on the strict legal actions taken by public security authorities against illegal activities in the football sector, including betting and match-fixing, as well as the disciplinary measures imposed by the Chinese Football Association (CFA) on 61 individuals involved in these cases. Among them, 43 individuals have been banned for life from football-related activities. This marks the first batch of \"life bans\" issued by the CFA. The General Administration of Sport of China and the CFA will continue to announce relevant penalties based on the lists provided by the Ministry of Public Security's public security administration bureau.\nThis significant industry penalty has attracted widespread attention both domestically and internationally. One reason for this is that the Chinese men's national soccer team recently suffered a 0-7 defeat to the Japanese team in a World Cup qualifier on Thursday, setting three \"shameful records\": the largest margin of defeat to Japan, the most goals conceded in a single World Cup qualifier match, and the largest margin of defeat in World Cup qualifiers. The team's performance in this match, which was widely deemed \"completely lacking in fighting spirit,\" has sparked immense anger among the Chinese public and prompted reflection on the long-standing, deep-rooted issues plaguing Chinese football once again.\nThe public's anger and disappointment with the Chinese men's soccer team for \"not living up to expectations\" is entirely understandable. As the most popular and widely participated sport in the world, soccer has a unique ability to evoke collective emotions. It is inherently tied to sportsmanship, national pride, and identity. The national team jerseys worn by the players carry the hopes and expectations of countless citizens who long for them to fight for the country and for glory. On Thursday evening, in the stands of Saitama Stadium in Japan, Chinese fans displayed a banner that read: \"With my sincere heart, may you find your fighting spirit!\" In a sense, soccer matches are not just about winning or losing; they are about whether the team can stand tall and give their all, demonstrating the resilience and fighting spirit that is expected of them in the face of tough opponents and pressure.\nIn the past, China has lacked world-class coaches, good training environments and facilities in many sports, but it has never lacked spirit and determination. The Chinese men's national soccer team has also given us many memorable moments. For example, during the 2017 World Cup qualifiers, Chinese team defeated South Korean team, turning Changsha into a sea of joy that night. Many Chinese fans sang the national anthem with tears in their eyes and marched through the streets waving national flags late into the night. In the 2022 East Asian Football Championship game, Chinese team drew 0-0 with Japan. Despite being at a disadvantage, the team showed fighting spirit and determination, earning widespread praise at home. And who could forget the qualifiers of 2002 World Cup, co-hosted by South Korea and Japan, when the Chinese men's team overcame many challenges to finally make it to the World Cup finals? The memories of the country celebrating its qualification are still vivid for many.\nIt is precisely because of these memories that, in the face of one \"surrendered\" match after another, people repeatedly ask: Where has the fighting spirit of the Chinese men's soccer team gone? Systemic corruption in the industry is widely considered one of the main reasons. The revelations at the press conference on September 10 were shocking: 120 matches involving match-fixing and betting have been confirmed, encompassing the Chinese Super League, China League One, China League Two, the Chinese FA Cup, and China Women's Super League. A total of 41 clubs across these leagues were involved. The government could thoroughly investigate the match-fixing, betting, and biased refereeing in soccer, leaving no stone unturned - this is the inevitable demand from the Chinese public, whose blame stems from a deep love for soccer.\nRevitalizing Chinese football requires not only rectification and adjustment but also systematic reform at the foundational level. The Overall Plan for China's Football Reform and Development emphasizes that football development should combine a long-term vision with a solid foundation, highlighting the need to strengthen the population base, infrastructure, management, and cultural foundation of football, while persistently exerting effort for long-term success. This is not something that can be resolved overnight; however, as long as the direction is correct, we need not fear the distance. This simple truth is equally applicable to Chinese football.\nOn Tuesday evening, the Chinese team hosted Saudi Arabia, currently ranked fourth in Asia, in Dalian, for a 2026 FIFA World Cup Asian Football Confederation qualifier game. Although the national soccer team ultimately lost 1-2 to the Saudi Arabian team, there were noticeable changes compared to their previous match against the Japanese team. However, this game further exposed the objective gap in technical abilities between the Chinese team and other teams. This serves as an opportunity for the national team to reassess themselves and start anew. Tuesday evening should be a starting point for the national team to recognize shame and inspire bravery. They need to accept and confront the current situation, follow the developmental laws of football, and establish a solid foundation for the sport. Additionally, they should exercise ample patience. As football reforms continue to deepen, the Chinese team should strive to play with skill, determination, and dignity on a clean pitch, and the public eagerly anticipates the arrival of that day.",
  "word_count": 988,
  "scraped_at": "2026-02-14T14:15:09.636028"
}