{
  "article_id": "4d6fd52727c1",
  "url": "https://www.indusage.com.au/?p=97128",
  "title": "AFL CEO Andrew Dillon Showcases Vision for India at AFL India National Championships – Indusage",
  "date": "20260205T094500Z",
  "domain": "indusage.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Australian Football League (AFL) CEO Andrew Dillon has underlined the league’s growing ambition in India, sharing his vision for the sport’s future during a week-long visit that culminated in the AFL India National Championships in Ranchi.\nIndia, one of the world’s largest and fastest-growing sports markets, is a key focus of the AFL’s long-term international strategy. Dillon’s visit included meetings with sports commissioners, business leaders and community representatives, reflecting the league’s intent to build a sustainable presence and deepen engagement with local and diaspora audiences.\n“Starting the week here in Mumbai really brings home the scale of opportunity for AFL in India,” Dillon said. “India is one of the world’s largest and fastest-growing sports markets, and we’re seeing genuine momentum, with close to 10,000 people currently playing footy across the country.”\nThe AFL India program has grown significantly since its beginnings in 2008, when just 150 players were involved. To date, around 20,000 participants have played the game, with more than 10,000 currently registered across 188 teams in 11 states. The program is supported by 63 registered coaches and 43 umpires, and is driven entirely by volunteers, with more than 125 volunteer leaders involved nationwide.\nThe 2026 AFL India National Championships, held from January 30 to February 1 in Jharkhand, featured around 250 male participants and more than 45 women competitors. The Jharkhand Crows claimed the men’s and junior boys’ titles, while the Bengal Tigers were crowned champions of the women’s tournament. Other teams competing included the Uttar Pradesh Hawks, Rajasthan Eagles, Maharashtra Giants, Telangana Saints, Kerala Bombers, Bihar Bulldogs, Odisha Swans, Andhra Pradesh Magpies and the Tamil Nadu Kangaroos.\nA key milestone in the AFL’s engagement with Indian audiences came last year with the league’s first-ever broadcast in Hindi during the Cultural Heritage Series between the Western Bulldogs and GWS. The initiative is set to return in 2026, alongside an alternate Hindi commentary, as part of broader efforts to make the game more accessible.\nThe AFL sees its growing footprint in India as complementary to its engagement with the Indian diaspora in Australia, positioning the sport as a bridge between the two nations through shared participation and cultural exchange.\nWith ambitions to reach one million participants globally by 2033, the AFL continues to invest in grassroots development, international partnerships and inclusive broadcasting initiatives to expand the reach of Australian football beyond its traditional borders.",
  "word_count": 395,
  "scraped_at": "2026-02-14T12:51:06.868066"
}