{
  "article_id": "4e120eff91ab",
  "url": "https://www.bbc.com/news/articles/cd9zvyx2w23o",
  "title": "Religion : Does faith have a role to play in sport ? ",
  "date": "20251224T114500Z",
  "domain": "bbc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Does religion have a role to play in sport?\nWhen Crystal Palace's Marc Guehi scored against Arsenal on Tuesday night, he did what he often does - point to the sky.\nArsenal's Jurrien Timber - nicknamed 'Pastor Timber' by fans - followed suit when he scored in the penalty shoot-out at the end of the game.\nBoth teams have influential players who have recently been discussing the importance of their Christian beliefs.\nAnd it's not just in football where we've seen contrasting headlines about professional athletes displaying their faith.\nEarlier this year, at the World Athletics Championships in Tokyo, GB sprinter Jeremiah Azu was warned not to wear a \"100% Jesus\" headband.\nBut can your beliefs impact your performance - and how you are treated - in the sport you play?\nSport governing bodies often have rules against displaying religious and political slogans during competition.\nJeremiah wasn't formally punished for wearing his \"100% Jesus\" headband in a 400m semi-final, but World Athletics bosses said they spoke to his team about the accessory.\nThe 24-year-old says he now backs the rules separating religion from the track, but he's glad he did it.\nHe tells BBC Newsbeat he believes his \"strength\" comes from his faith, and he wore the headband to show that.\nHis father is a pastor, so Jeremiah says religion has always been a part of his life.\n\"We read the Bible at home, we prayed at home,\" he recalls.\nHe says his religion helps his performance in athletics.\n\"As a Christian you have to be disciplined,\" he says, a trait he feels transfers over to track and field.\n\"There's days where it's difficult to push, but I know I have to from the discipline I've got from my faith,\" he explains.\nThough Jeremiah says he's never felt \"muted\" when talking about his faith, up-and-coming athletes tell Newsbeat it's not always that simple.\nSemi-pro footballer Zainab El-Mouden, who plays for Chesham United FC Women, says there are challenges as a female Muslim player who wears a hijab.\nThe garment is worn over the head as a display of modesty, but it's not always been welcomed on the football pitch.\nIt was banned by governing body Fifa until 2014, when players were permitted to wear it for religious reasons.\nAnd just two years ago, Moroccan defender Nouhaila Benzina, 27, made history by becoming the first player to wear a hijab at a World Cup.\nZainab, 22, says her faith means everything to her, from the way she conducts herself to the way she dresses.\nShe says it's been a real journey to become comfortable wearing a hijab while playing football.\n\"Initially I hated it, I hated the way it looked on me,\" she says.\n\"My hijab was my biggest insecurity and then it became my biggest strength.\n\"Whether you want to or not, you're going see me and you're gonna watch me more than anyone else.\"\nZainab feels there is still a difference in how male Muslim players are treated compared with female players.\n\"With a female Muslim player, they're visibly different so that's where I think the rift kind of comes in,\" she says.\nAfter growing up with no one that \"looked like\" her in football to inspire her, Zainab says she wants to be that role model for others.\n\"All the girls that are growing up now need that representation to play,\" she says.\nDoes faith impact your performance in sport ?\nThere are studies on how a positive mindset and confidence can influence your performance.\nReligion isn't always part of it - many athletes have rituals they \"must\" follow before a big game or race to centre themselves.\nSome report that their faith forms part of preparations for a big event.\nA Seoul University study published in 2000, based on interviews with 180 sports people across 41 sports, identified prayer as one of seven main \"coping strategies\" those surveyed used to combat anxiety before a big event.\nIt suggested this could have a positive effect on their performance.\nSemi-professional footballer Jaiden Chang-Brown, of Lingfield FC, tells Newsbeat his faith has helped him to manage his emotions in a slightly different way.\n\"I feel like sometimes my passion could get the better of me in the past,\" he says.\n\"Sometimes I would lash out at teammates.\n\"It's really helped just to give me peace when I'm on the pitch.\"\nJaiden says his faith has helped him to improve his mindset and \"tap into that psychological side of football\" when he plays.\nThe 21-year-old describes himself as a \"born-again Christian\" and says his religion is the most important thing in his life.\n\"It's bigger than football, it's bigger than everything,\" he says.\n\"People think it's not cool to be bold in your faith, but it is.\n\"You can laugh and have your giggles, but it's what I believe in.\"",
  "word_count": 809,
  "scraped_at": "2026-02-14T12:37:15.708614"
}