{
  "article_id": "4e24162e0fe4",
  "url": "https://chapelboro.com/news/top-stories-of-2025/top-stories-of-2025-changes-at-the-unc-athletic-department",
  "title": "Top Stories of 2025 : Changes at the UNC Athletic Department",
  "date": "20251226T210000Z",
  "domain": "chapelboro.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "To reflect on the year, Chapelboro.com is re-publishing some of the top stories that impacted and defined our community’s experience in 2025. These stories and topics affected Chapel Hill, Carrboro and the rest of our region.\nIn many ways, the college athletics industry in 2025 is a living, breathing organism: constantly changing and adapting to the world around it. The UNC athletic department was not immune from that change this past year. From leadership transitions to money matters, the department looks far different now than it did 365 days ago.\nOn June 6, a high-profile legal case reached its conclusion, as U.S. Judge Claudia Wilken approved a final proposal to settle the case of former Arizona State swimmer Grant House against the NCAA. The “House settlement” took nearly five years to complete, and the ramifications were massive: effective July 1, each school in the NCAA’s so-called “power conferences” – such as the ACC – would be able to share up to $20.5 million in revenue with its student-athletes. Additionally, $2.7 billion would be paid over the next decade to thousands of former players who missed out on their chance to earn revenue, and that payout would be funded by withholding revenue distribution to schools, including UNC. It will cost Carolina about $2 million per year.\nSchools would have the freedom to allocate their “revenue share” money however they wished, though a template many used was earmarking 75 percent for football programs (the primary moneymaker at every major collegiate athletic department), 15 percent for men’s basketball programs and 5 percent each for women’s basketball and baseball programs. But in August, UNC athletic director Bubba Cunningham said his department would be doing things differently: 65 percent (roughly $13 million) of Carolina’s revenue share fund would go to football, 35 percent (roughly $7 million) to men’s basketball and a smaller sum (about $250,000 each) to women’s basketball and baseball.\n“I thought the fairest thing to do was give the revenue sharing to those sports that had generated it,” Cunningham said at the time.\nIn addition, the House settlement determined the revenue share funds – the aforementioned $20.5 million – would increase by four percent every year. In a letter to the UNC community, Cunningham said his department “will evaluate the division of all funds annually,” and potentially adjust specific sport allocations accordingly.\nThe House settlement brought about other changes, too. Various Olympic sports, most notably baseball, would be receiving higher scholarship allocations. In previous seasons, NCAA baseball programs were only allowed 11.7 total scholarships for their rosters, meaning most players were either playing on partial scholarships or none at all. In the wake of the House settlement, baseball programs now have 34 scholarships. Cunningham noted this as a reason for not allocating more income for UNC’s various Olympic sports.\n“We can provide more scholarships to our Olympic sports programs than ever before,” he said. “And that’s gonna help sustain them. Commercial activity goes to those that generate it. Educational benefits are gonna go to the sports that have been previously subsidized [by football and men’s basketball revenue].”\n“We’re walking a fine line,” UNC field hockey head coach Erin Matson told 97.9 The Hill in July. “It’s gonna be interesting to see how it shakes out, what it looks like for field hockey versus men’s basketball and football… it is a very uncertain time, but a very exciting time.”\nAnd while Cunningham publicly expressed optimism for the future of college athletics, he will not be the one to lead the UNC athletic department into the future. On July 1, Cunningham announced he would be transitioning to a new role with the university in the summer of 2026, one which would see him work closely with UNC chancellor Lee Roberts. At the same time, the school announced the hiring of Steve Newmark, former president of Roush Fenway Keselowski Racing in the NASCAR Cup Series, effective Aug. 15. Newmark would essentially serve as Cunningham’s athletic director-in-waiting, then take over for Cunningham once he assumes his new job.\nNewmark is a Chapel Hill native and had previously negotiated media deals with Conference USA and the Southeastern Conference, but the UNC job is his first within a collegiate athletic department. Notably, Newmark was part of the advisory committee which assisted in hiring Bill Belichick as UNC’s head football coach.\n“I look forward to working with Bubba and the entire Tar Heel Nation to continue to elevate UNC’s status as a premier brand in college sports with top-tier programs across the board,” Newmark said in a statement, “and with student-athletes who represent North Carolina’s flagship institution with class on and off their respective playing fields.”\nCunningham was the second UNC athletics leader to announce a career transition in 2025. In May, John Montgomery, longtime executive director of The Educational Foundation, Inc. – better known as The Rams Club – announced he would retire at the end of the calendar year. Montgomery had served in his role or 24 years. During his tenure, The Rams Club – the official athletic booster organization for UNC athletics – raised more than $1.2 billion and more than doubled its membership. UNC alumnus Seth Reeves was named as Montgomery’s successor in August.\nAnother new UNC athletics hire has been making his presence felt around the community this year. Rick Barakat was named the school’s Deputy Athletic Director and Chief Revenue Officer in March after a successful media career, one which saw him work with entities such as Minor League Baseball and Raycom Sports.\nIn May, Barakat and Cunningham spoke to the UNC Board of Trustees and presented several potential enhancements to both Kenan Stadium and the football program’s gameday presentation. Barakat teased the idea of sponsoring various areas inside the stadium and even a naming rights deal for the stadium itself. Kenan Stadium has never had a naming rights deal in its 98-year history.\n“We’re gonna be looking to be pretty creative with this,” Barakat said at the time. “Of course, we need to preserve the Kenan name within the stadium identification, and we’re gonna work through the best way to do that with the family and the Rams Club, and then bring in a commercial brand around that… we’re trying to turn over every rock and find new ways to drive revenue.”\nLater that year, both Kenan Stadium and the Dean Smith Center would debut sponsor logos on their playing surfaces. State Farm and Window World would have their logos on the Kenan Stadium grass (which replaced the artificial turf surface after the hiring of Belichick), while the Smith Center court featured the logo of the healthcare company Novo Nordisk.\nBarakat also spearheaded an increased effort at fan engagement before all home football games in Chapel Hill. These enhancements would be grouped together into the “Chapel Thrill Game Day Experience,” which would include multiple fan zones in the heart of the UNC campus. Included in the experience was the “Chapel Thrill Concert Series,” in which musical acts would perform on a stage in front of Wilson Library.\n“That could hopefully bring some 3,000-plus students into Polk Place every game day,” Barakat said of the Game Day Experience. “Very populated, boisterous… hopefully we can pull that off.”\nAcross six home games during the fall, the concert series brought in acts such as Collective Soul, Fitz and the Tantrums and even Grammy-winning rapper Ludacris. (In a bizarre twist, Ludacris ended up taking the stage at around 10 a.m., as UNC’s game against Clemson that day kicked off at noon.)\nIn his presentation to the Board of Trustees, Barakat had also floated the idea of “special events” at Kenan Stadium. The venue had previously hosted exhibition soccer matches during the summers of 2023 and 2024 (and did so again in 2025 when Mexico and Türkiye played an international friendly), but Barakat wouldn’t stop there. He spoke of special Christmas events and a full concert calendar, as well as a partnership with one of the most popular family entertainment businesses in the nation: the Savannah Bananas exhibition baseball team. The Bananas routinely sell out venues across the country, including football stadiums.\nIn October, that idea became reality: the Bananas announced Kenan Stadium as one of the stops on their upcoming Banana Ball World Tour, with two games scheduled for April 2026.\n“We’re thrilled to welcome the world-famous Savannah Bananas to Chapel Hill,” Barakat said after the announcement. “Combining the Bananas’ innovation and excitement with the storied tradition of Kenan Stadium will create an unforgettable experience for fans across the state and beyond.”\nBy the time the Bananas and the Texas Tailgaters take the field in April, Cunningham’s tenure as UNC’s athletic director will be coming to a close. He arrived at the school in 2011, when Chapel Hill was being rocked by an academic fraud scandal which wouldn’t reach its conclusion for several more years. When Cunningham leaves his office for the final time, Carolina will be in a metamorphosis once again, but of a different kind – one which has already drastically changed the landscape of college athletics and will continue to do so in an uncertain future.\nFeatured image via Associated Press/Chris Seward\nChapelboro.com does not charge subscription fees, and you can directly support our efforts in local journalism here. Want more of what you see on Chapelboro? Let us bring free local news and community information to you by signing up for our newsletter.",
  "word_count": 1570,
  "scraped_at": "2026-02-14T12:37:11.740735"
}