{
  "article_id": "4e322853f00f",
  "url": "https://www.90min.com/posts/why-arsenal-women-champions-league-exit-could-be-blessing",
  "title": "Why Arsenal Women Champions League exit could be a blessing in disguise",
  "date": "20230915T164500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Why Arsenal's Women's Champions League exit could be a blessing in disguise\n- Arsenal failed to qualify for this season's Champions League after qualifying round exit\n- The Gunners beaten on penalties by Paris FC to end European dreams\n- Jonas Eidevall must now focus efforts on WSL title tilt; Alessia Russo the star arrival from what's been a busy transfer window\nBy Emily Keogh\nOn the surface, Arsenal's failure to qualify for the Women's Champions League is a crushing blow for Jonas Eidevall and his players. After all, playing at the elite level of European football is what every player wants to do, and it plays a huge part in attracting the biggest and best talent to the club.\nBut in a roundabout way, exiting this year's competition to Paris FC after a penalty shootout defeat could actually be a blessing in disguise for the Gunners.\nThe workload for the players has been heavy to say the least. They've balanced competing in the WSL, the most competitive domestic league in the world, the latter stages of last season's Champions League and two international tournaments over the past 12 months - something that's taken its toll as Eidevall and Chelsea manager Emma Hayes have publicly admitted.\nThrow into the mix the fact that four of Arsenal's players were ruled out last season with significant ACL injuries, in addition to absences for Kim Little and Lia Walti, and there's further evidence that Arsenal missing out on this season's UWCL may not actually be a bad thing.\nIf you rewind to the final game of last season, a 2-0 defeat to Aston Villa, Eidevall's bench was littered with academy prospects and no real experience - Giovana Quieroz and Kathrine Moller Kuhl, both 20, the only two Eidevall could turn to in order to try and turn things around. Veteran forward Jodie Taylor was a late starter too, such was the extent of the injuries within Arsenal's squad.\nBeth Mead, Vivianne Miedema and Leah Williamson's absences also played a huge part in Arsenal missing out on a top-two finish, though Manchester United's incredible consistency and pushing of eventual champions Chelsea must also be appreciated.\nFinishing third meant Arsenal would have needed to play another qualifier anyway, had they got past Paris FC, just to get into the Women's Champions League proper. Not ideal considering Eidevall had to recall players from Australia, Sweden and England to training just one week after they completed gruelling World Cup campaigns on the other side of the world.\nFatigue almost certainly played a part in Arsenal's pretty dismal showing in midweek. They lacked any kind of cohesion and were a shadow of the side that came within a whisker of reaching last year's final at the expense of Wolfsburg. Even if they had got through, there's no telling whether or not they would have sorted things out to go any further.\nIt's perhaps a good thing then that with yet another international break coming up before the WSL season starts on October 1, Arsenal don't have to worry about playing more continental football. The loss of commercial revenue is an obvious downside - and a significant one at that given three group stage games would have been staged at the Emirates Stadium - but the easing of the calendar may play into their hands in the long run.\nThe Gunners are always among the favourites for the WSL title, with expectations high again, and the arrivals of Alessia Russo, Sweden's premier defender Amanda Ilestedt and World Cup winner Laia Codina mean this season is no different - Arsenal are expected to push Chelsea all the way and be right in the mix. Cloe Lacasse and talented Australian midfielder Kyra Cooney-Cross's signings only adding to the weight of expectation.\nSo while this early Champions League elimination hurts, there's no doubt Arsenal can channel the disappointment into a positive. They have now time to collectively regroup, make the most of rest days and training sessions in midweek when European football is on, and get key players back fit and firing - Mead and Miedema in the shorter term and Williamson and Laura Wienroither towards the back end of the season.\nIf they can do that, there's nothing stopping Arsenal from going all the way and lifting a first WSL title since 2019 - ironically a season in which they were not competing in the Champions League.",
  "word_count": 736,
  "scraped_at": "2026-02-14T12:22:04.712922"
}