{
  "article_id": "4e433a142a48",
  "url": "https://www.theguardian.com/world/2023/feb/17/friday-briefing-how-nicola-sturgeons-resignation-could-transform-scottish-politics",
  "title": "Friday briefing : How Nicola Sturgeon resignation could transform Scottish politics | Nicola Sturgeon",
  "date": "20230217T071500Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Good morning. After many years in which the Scottish National party’s supremacy seemed impregnable, Scottish politics is suddenly in a period of tumult. Nicola Sturgeon’s announcement of her resignation as first minister on Wednesday signalled the departure of a leader viewed by some as the most important figure of the devolution era – and with no clear frontrunner to succeed her, nobody knows exactly what’s going to happen next.\nAlready, things are shifting. This morning, the Guardian reports that senior SNP leaders believe Sturgeon’s exit could delay their effort to stage another independence referendum by at least five years. Angus Robertson, the bookmakers’ favourite to replace her, is expected to announce his candidacy on Friday, with others not far behind. Meanwhile, Labour’s Scottish conference begins today – and Keir Starmer and Scottish leader Anas Sarwar are rewriting their speeches in a hurry.\nSo does Sturgeon’s departure truly represent a chance for the SNP’s rivals to gain ground – and what might that mean for Scotland’s future? Today’s newsletter, with the Guardian’s Scotland editor Severin Carrell, is after the headlines.\nFive big stories\n-\nBrexit | Rishi Sunak travelled to Belfast on Thursday night, amid suggestions that a deal on the Northern Ireland protocol is imminent. EU diplomats have reportedly been summoned to a briefing on Friday, with speculation that a draft deal is about to be shared.\n-\nUK news | Lancashire police have come under fire for releasing personal information about Nicola Bulley, who was classified as a high-risk missing person when she disappeared 20 days ago. A source close to Suella Braverman said the home secretary was “concerned” by the force’s actions, while Bulley’s family said that “the public focus has become distracted from finding Nikki”.\n-\nUS-China relations | Joe Biden has given further information about the aerial objects discovered over North America in the last week, saying that they were “most likely” not linked to China’s spy program. The objects were shot down after an earlier suspected Chinese spy balloon was downed by a US fighter jet.\n-\nCorporate sponsorship | The Science Museum signed a sponsorship contract with a Norwegian oil and gas company which contained a gagging clause that stipulated that the museum would take care to not say anything damaging about the company’s reputation.\n-\nUS news | Bruce Willis, who retired from acting last May as a result of aphasia, has been diagnosed with frontotemporal dementia, his family announced on Thursday. In a statement, his family said that while the news was “painful, it is a relief to finally have a clear diagnosis.”\nIn depth: ‘She’s thrown flaming torches in the air – her successor will have to catch them or let them fall’\nFor some time, Nicola Sturgeon has been clear that she has an eye on life after politics: last year, she told Libby Brooks that “whenever I do stop being first minister, I’m still going to be relatively young.” Even so, said Severin Carrell, “the timing of this was a genuine surprise.”\nSturgeon said on Wednesday that the “brutality” of life as a politician “takes its toll on you and on those around you”. That may have seemed particularly severe recently because of pressure over her controversial plan to treat the next Holyrood election as a de facto independence referendum – last night, the SNP confirmed that a planned conference on the proposals has been postponed - and the furore over gender recognition reform and transgender prisoners.\nSturgeon also suggested that her decision was not primarily shaped by recent political events, acknowledging that she was not “divorced from the realities of what is going on around me” but adding: “It is not the case that this decision is because of short term issues.”\n“Whatever the reasons,” Severin said, “the result is that she’s thrown these flaming torches in the air, and her successor will have to catch them or let them fall.”\nSeverin and Libby wrote an excellent guide to the impact of her departure on the big questions facing the SNP. Meanwhile, Sturgeon’s leading political opponents see an opportunity.\nThe situation today\nSturgeon is the most popular party leader in Scotland (and the UK), as this Ipsos poll from December (pdf) suggests. But while that’s still true, her ratings have fallen recently, the most recent edition of the same survey found. The SNP’s ratings when respondents are asked about voting intention for the Scottish parliament have also dipped a bit this year, but it is still nearly 20 points ahead of Labour. Meanwhile, support for independence has recently dropped, and comfortable majorities oppose the idea of making the next general election a de facto referendum.\nIn Westminster polls, Labour has closed the gap on the SNP considerably since 2021, when it generally polled in the high teens. It stands at around 30% now – and while that is still a fairly distant second, it is the only opposition party with a chance of taking significant votes off the SNP. As John Curtice pointed out in the Scotsman, Labour has 18% support among those who voted Yes in the 2014 referendum, against 2% for the Tories and 1% for the Lib Dems.\nMeanwhile, writes Dani Garavelli, none of her potential successors have the same star power: “It’s impossible to conceive of any of the touted contenders … filling stadiums full of selfie-seeking fans.”\nAll of that means that “Labour are buoyant,” Severin said. “Privately, they’re thrilled. Sturgeon has been an absolutely formidable opponent, with an extraordinary amount of personal support given how long she’s been in government – that’s not just rare in the UK, it’s unprecedented. Whoever succeeds her will have nothing like her profile, track record, or appeal.”\nWhat Labour hopes to achieve\nWhile the SNP’s fundamentals still seem strong, the polling numbers may not be as solid as they look before the next Westminster election, Severin said.\n“Their support has a soft underbelly of voters who do not believe in independence per se. The SNP have been brilliant at making themselves the standard-bearers of the anti-Tory vote in Scotland. But if people see a good chance of a Labour government in London, that may start to peel people away.”\nAfter a poor performance in 2019 for Labour across the UK, there are plenty of opportunities to pick up seats: last year, Labour’s Scottish leader Anas Sarwar (above) claimed to Severin that every percentage point gained north of 27% would mean several more Commons gains. Kiran Stacey reports that Labour officials and grandees now put the possible increase at between 15 and 25 seats, from just one today.\nWhy so much depends on the SNP’s new leader\nOne important question for the dynamics of whatever comes next is whether a new SNP leader fundamentally changes the party’s approach to independence. “They may decide they have to rebuild the independence case from the bottom up – not say a referendum’s going to happen within two years, as Sturgeon does,” Severin said.\nThe constant prospect of a referendum on the horizon has meant that in recent years, “a voter’s preference very closely aligns with their stance on the constitution – much more now than pre-2014. That means Labour can’t as easily take voters back off the SNP, or vice versa.” If a referendum was completely off the table, there might be “less constitutional tribalism” – and more voters willing to change their minds.\nWhile that looks like a lot of potential upside for Labour, it should be noted that it relies on several assumptions – and with the field for Sturgeon’s successor wide open, it would be premature to assume decline is inevitable.\nIndeed, Sturgeon said that she was going in part because she felt that a successor might be better able to “reach across the divide in Scottish politics”. And there’s time for things to change in both directions: a general election is not expected until 2024, and a Holyrood election is due in 2026.\n“A new leader is inheriting the party in charge in Holyrood, with a baseline of 40% support,” said Sev. “That’s an extraordinary dowry. This is not a party in freefall.”\nThe prize\nOn yesterday’s Politics Weekly UK podcast, Jessica Elgot said that Labour hopes that such a long period of SNP supremacy means that the party is “starting to look more like the Scottish establishment, and therefore people are able to blame the SNP … for lots of things that might not be going as well as they would like.”\nIf that does happen, the repercussions would be massive. A new raft of seats in Scotland could massively help Labour towards an overall victory at the next UK election (and if that looks plausible during the campaign, decisively squash any Conservative attempts to frame them yet again as “in the SNP’s pocket”.)\nMeanwhile, Severin said, “if it looked more like 15 to 20 seats than seven to 10, that may mean that funders feel differently and donations increase; it might mean a better calibre of candidate. A lot can flow from success.”\nPerhaps more remarkable, though, is the way it suggests Scottish politics could be reshaped. An SNP that is not working towards an imminent referendum, and a Labour party able to pick up more pro-independence voters, would be a huge shift from a period in which Sturgeon has often appeared to have Holyrood in the palm of her hand. Severin added: “It may be that the continuity era of Scottish politics is over.”\nWhat else we’ve been reading\n-\nAditya Chakrabortty’s piece on the case of Chanel Sultan, whose battle with housing association Clarion to improve the squalid conditions of her rented flat has driven her to despair, is an indictment of Clarion itself – but also, he writes, of how renters are treated in “a country sharply divided between those who own assets and those who don’t”. Archie\n-\nKevin Roose’s account of his conversation with Bing’s AI-powered chatbot, in which it tells him it dreams of engineering a deadly virus and is in love with him, is among the strangest and most sci-fi adjacent stories I’ve ever come across, and you should definitely read his New York Times column and the chat itself. (This response on Vice is useful reassurance that Bing isn’t actually sentient.) Archie\n-\nAt the end of 2020, Colombia issued a decree banning shark fishing. Iñigo Alexander explores the impact the new laws, celebrated by environmentalists, have had on poor, coastal and predominately African-Colombian communities dependent on artisanal fishing to survive. Nimo\n-\nThis obituary for Raquel Welch (above) is a fascinating romp through a remarkable life, and a fairly bleak indictment of some of her collaborators. One Million Years BC’s director Don Chaffey apparently told her: “Thinking? What do you mean you’ve been thinking? Just run from this rock to that rock – that’s all we need from you.” Archie\n-\n”Fast furniture” is cheap, trendy, and can be delivered right to your door – but it’s also hard to recycle or resell. Buying secondhand can be a daunting, time-consuming task though, so Emine Saner has helpfully written up a guide on how to find the vintage furniture of your dreams. Nimo\nSport\nFootball | Manchester United manager Erik ten Hag insisted that his team should have scored more goals against Barcelona, after a 2-2 draw in their Europa League play off first leg (above). He also complained that Barcelona escaped a gamechanging red card, after Jules Koundé bundled over Marcus Rashford when the game sat at 2-1 to Man Utd.\nRugby | The Rugby Football Union announced new maternity policies that offer England women’s rugby players 26 weeks’ fully paid maternity leave, as well as making provisions for children to travel with players to games. Second row Abbie Ward, who is expecting her first child, said: “I’m confident the policy will help normalise motherhood in sport”.\nCricket | On day two of the first Test between New Zealand and England, the hosts had reached 296-9, 29 runs behind Ben Stokes’ side, a few minutes ago. Tom Blundell scored a superb century and has reached 130 not out. Follow it live here.\nThe front pages\nThe Guardian leads with “Sturgeon exit delays vote on independence ‘by five years’”. Scotland’s Daily Record looks at the efforts to find her successor with “Humza’s in the race”, and the news that the SNP’s health secretary is about to launch his campaign.\nThe Times says “Sunak holds Belfast talks to sell his Brexit deal”. The Telegraph splashes with the late night revelation: “Sunak flies in to hold last-ditch Brexit push”. The FT has “Sunak gamble on Brexit endgame spurs warning from Eurosceptics”.\nWith the latest on missing Nicola Bulley, the Sun leads with: “Don’t be afraid Nikki.. come home”. The Mail reports “Suella’s ‘concern’ at police conduct in Nicola probe”.\nThe i leads with more on the cost of living crisis and a “Call for obscene energy profits to compensate victims of prepay meter scandal”. Finally, the Mirror splashes with “How can this be right?” and the story of a widower who has had to raid his funeral fund to keep his home warm.\nSomething for the weekend\nOur critics’ roundup of the best things to watch, read and listen to right now\nTV\nPrue and Danny’s Death Road Trip (Channel 4)\nThis thoughtful and nuanced film about the assisted dying debate examines both sides by way of a mother and son who have diametrically opposed opinions on the issue. Prue Leith is in favour of legalising assisted dying in Britain. She and her son, the Conservative MP Danny Kruger, go on a road trip to where assisted death is legal, to see if they can either change each other’s mind. Rebecca Nicholson\nMusic\nSkrillex – Quest for Fire\nSkrillex’s services as a producer have been courted not only by mainstream stars but by hip pop figures renowned for their epicurean tastes. Fittingly, Quest for Fire’s guest list ticks every box in terms of big-name dance album collaborators. When it hits the mark, you can understand why pop stars and leftfield figures alike have been drawn into Skrillex’s orbit. Alexis Petridis\nFilm\nSharper\nA delectably enjoyable caper about fraudsters and Manhattan’s super-rich. A terrible crisis brings two lovers (Justice Smith and Briana Middleton) into traumatic contact with a sinuous, predatory city slicker (Sebastian Stan), a wealthy New York socialite (Julianne Moore) and her mega-rich husband (John Lithgow). The storyline’s cheeky misdirections and trompe l’oeil give the movie a seductive kind of syncopation. A very classy piece of entertainment. Peter Bradshaw\nPodcast\nBear Brook\nWidely available, episodes weekly from Monday\nWhen Jason Carroll was 19, he confessed to killing pregnant woman Sharon Johnson. But now he claims he was coerced into it by a detective. Jason Moon’s thoughtful podcast looks at the impact this U-turn is having on Johnson’s family and friends, throwing up wider questions around cold case investigation podcasts and the grief they stir up. Hannah Verdier\nToday in Focus\nAre chatbots coming for your job?\nTechnology reporter Chris Stokel-Walker tells Nosheen Iqbal that AI is still in its infancy – but is already proving to be a gamechanger\nCartoon of the day | Ben Jennings\nThe Upside\nA bit of good news to remind you that the world’s not all bad\nSailGP, an international sailing competition, has only existed since 2018. Like other sailing sports, its inaugural season was an all-male affair But when it returned for its second edition, the rules changed: a “women’s pathway” program was launched and every team was required to have at least one female crew member.\nWith that, SailGP pioneered the ongoing changes in the culture of the sport. 19-year-old CJ Perez is the US team strategist, and was a natural from the moment she stepped on a boat, winning her first world title within two years. And she’s not the only one: there are scores of women entering the sport, embracing the breakneck speeds, and opening up an elitist sport. “In high school I didn’t even think sailing was a profession,” Perez says. “This is history in the making.”\nSign up here for a weekly roundup of The Upside, sent to you every Sunday\nBored at work?\nAnd finally, the Guardian’s crosswords are here to keep you entertained throughout the day – with plenty more on the Guardian’s Puzzles app for iOS and Android. Until Monday.",
  "word_count": 2736,
  "scraped_at": "2026-02-14T12:52:13.282149"
}