{
  "article_id": "4e5a23afc02e",
  "url": "https://www.dailycartoonist.com/index.php/2023/11/13/csotd-what-the-heck-happened-to-this-country/",
  "title": "CSotD : What the heck happened to this country ? - The Daily Cartoonist",
  "date": "20231113T144500Z",
  "domain": "dailycartoonist.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "CSotD: What the heck happened to this country?\nSkip to commentsThe woman in this Steve Kelley (Creators) cartoon asks an excellent question.\nI blame the Civil Rights Movement.\nOnce Black people began to speak up and assert their right to a place in society, all sorts of people began wondering why they needed to keep their eyes downcast and accept being either ignored or bullied.\nTo be sure, a large percentage of the population accepted this new reality, and that began before the Civil Rights Movement swung into action: During the war, Cpl. Rupert Trimmingham wrote a letter to Yank The Army Weekly about a stopover at a Southern railroad station where he and other uniformed Black GIs had to get food from the kitchen door while German POWs ate at the counter.\nYank was inundated with letters from outraged GIs, both Black and white.\nIt was one of the blows against bigotry and hate that, following the war, made the Civil Rights Movement acceptable to decent, thoughtful Americans.\nThe Civil Rights Movement begat the Women’s Movement which begat the overall movement to accept people who did not match an imaginary, stereotypical model.\nSpecific to the gripe in this cartoon, tennis player Richard Raskin underwent transitional surgery in the mid-70s and pursued a career as Renee Richards, which became a scandal when Tucker Carlson’s father outed her publicly and the USTA had to figure out how to deal with the issue of transgender athletes.\nTransgender people are nothing new: History is full of stories about soldiers who died and were revealed to be women. Most are framed as brave women who disguised themselves; rarely have any accounts bothered to examine these people’s lives before they enlisted.\nTwo things have happened since: Transgender people are no longer afraid to be out front about themselves, and bigots are no longer afraid to keep their ignorant opinions to themselves.\nJohn Buss notes the way Donald Trump has glorified and personified the image of Archie Bunker, who was introduced at the start of the 70s as a satire of working-class bigots but was quickly embraced by an audience that, as was later said of Trump, took him seriously but not literally.\nNorman Lear intended to mock the Archie Bunkers, but the fact that TV allowed 25 minutes of racist and sexist jokes — as long as it was followed by a Golden Moment wherein Archie’s opinions were disavowed — opened the gates to more “naughty heroes” like the football players in North Dallas Forty or the sexist, racist slackers of Animal House whose antisocial behavior went unrepented.\nThe glorification of “naughty heroes” wasn’t confined to comedy, or to the shift from Frank Serpico, a real-life cop who tried to do things ethically to “Dirty Harry” Callaghan who became a fictional hero by breaking the rules.\nAs today’s Non Sequitur points out, villains become heroes with regularity these days. The original Son of Sam Law, intended to stop lawbreakers from profiting from books and movies about their crimes, was ruled unconstitutional, opening the floodgates for them to sell their stories for movies like Goodfellas.\nNot to mention the ascension of political criminals like Gordon Liddy and Oliver North from violating the Constitution and the law to becoming well-paid heroes of conservative media.\nAnd then, as Jeff Danziger noted in 2005, the rise of the Internet and social media gave every barroom blowhard access to a worldwide audience.\nAin’t progress wonderful?\nJuxtaposition of the (Present) Day\nExpressions of White Supremacy were once mocked as backwards, vulgar remnants of the opposition to Reconstruction, but are now promoted as reasonable reactions to “uppity” claims of racial equality.\nRamirez adopts the argument that “Cancel Culture” is a particular flaw of liberals, without any parallel in conservative book burners and those who seek to fire educators who teach the “wrong” things or to deport religious minorities.\nNot to mention those who complain of “witch hunts” while mirroring the attitudes that gave the term its historical underpinnings.\nBok’s approach is not as complex: He echoes Trump’s accusation that trials of white politicians are part of a conspiracy by a multi-racial, gender-affirming Deep State conspiracy of Black and Latino judges and prosecutors.\nAmid societal changes, as Pat Bagley points out, the Republican Party has blundered down some dead-end alleys, with resounding defeats at the hands of outraged women and with a good chance of more failures as they plot to offset tax breaks for the wealthy by cutting entitlements to the elderly.\nI’m not sure who to blame for our having transmogrified the meaning of “entitled” from earned and deserving to its polar opposite, but it has been a great aid in helping make it seem that nobody is entitled to entitlements, no matter how much money they’ve put into it or how much they’ve upheld their end of the bargain.\nJuxtaposition of the Day #2\nZyglis is commenting on a scandal in his hometown of Buffalo, where the Roman Catholic diocese has pled bankruptcy in the face of having victims of sexual abuse by clerics stand up for themselves and demand confession and compensation.\nThe secrecy Zyglis notes relates to the diocese’s unsuccessful attempt to keep its abuse issues out of public view.\nIt’s part of something playing out in ultra-slow motion. The emergence of pedophilic scandals in the Church was touched off by a 60 Minutes report in the late 80s about a Louisiana diocese accused of “passing the trash” — reassigning pederasts without advising the new parish of their past — which drove a former resident of the Mount Cashel orphanage in Newfoundland to speak up about his experiences, which touched off a national scandal in Canada when it was revealed that not only the orphanage, but its diocese, local law enforcement and even local media had covered things up.\nThose revelations rocked other religious orphanages and inspired First Nations people to come forward about their horrific experiences in the residential schools.\nNow, as seen in Francis, the Pope has held a synod to discuss modernization and fairness in the Church, and — while no pronouncements have yet come out — he has defrocked an American bishop for defying the Vatican.\nSo I hope that answers the question “What the heck happened to this country?” though, as you can see, it hasn’t finished happening yet.",
  "word_count": 1056,
  "scraped_at": "2026-02-14T12:05:55.496483"
}