{
  "article_id": "4e60abce04c7",
  "url": "https://www.elevenwarriors.com/skull-sessions/2026/02/161553/skull-session-dane-brugler-ranks-davison-igbinosun-as-a-top-50-prospect-in-the-nfl-draft-three-buckeyes-appear-in-the",
  "title": "Skull Session : Dane Brugler Ranks Davison Igbinosun As a Top 50 Prospect in the NFL Draft , Three Buckeyes Appear in the Top 10 of ESPN Rerank for the 2023 Recruiting Class",
  "date": "20260213T140000Z",
  "domain": "elevenwarriors.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Welcome to the Skull Session.\nContrary to some Ohio State media personalities, I would very much like to see Ohio State make the NCAA Tournament this season.\nBruce Thornton came up big for the Buckeyes dropping 21 PTS in the W\n— Big Ten Men's Basketball (@B1GMBBall) February 12, 2026\nThe @OhioStateHoops senior guard entered the top-5 all-time program scoring leaders list in the victory pic.twitter.com/Lj2TXLHTFS\nBeat UVA.\nHave a good Friday.\nDEVELOPED HERE. The Athletic’s Dane Brugler has updated his top 100 prospects available in the 2026 NFL draft. I’m pleased to report that Buckeyes rank No. 1, No. 4, No. 5, No. 10, No. 26, No. 50 and No. 54 on the list.\nNo. 1 - Arvell Reese\nReese was the No. 1 prospect on my midseason top 50, and nothing has changed at the top. An impressive height/weight/speed athlete, Reese (one of the youngest prospects in the draft class) was asked by Ohio State to play a blend of multiple positions, which showcased his vast tools for NFL scouts. He is explosive from his spot with exceptional closing burst to cover ground in a blink. He falls somewhere between Micah Parsons and Jalon Walker in terms of his pro projection.\nNo. 4 - Caleb Downs\nA human missile, Downs jumps off the tape because of his fast, competitive play style. Despite his average size, he is an elite tackler who fills with impressive body control and strength at contact. He showed the same high-level reaction skills in coverage. Downs sees the field like a chess board. He is one of the better safeties I have ever evaluated.\nNo. 5 - Sonny Styles\nA 6-foot-4, 240-pound linebacker with 4.5-second 40-yard-dash speed who just turned 21? Styles, who initially enrolled at Ohio State as a safety, checks all the boxes with his size and athletic traits. He blossomed on the field in 2025. He isn’t a proven playmaker in coverage (yet), which is the only reason he isn’t ranked higher. But he is the rare off-ball linebacker worth a top-10 pick.\nNo. 10 - Carnell Tate\nTate stepped into a full-time role in 2025 and surpassed expectations that were already high. He builds his speed to be a dynamic playmaker downfield, while also showing the technical know-how to uncover on short-to-intermediate routes. He is an outstanding tracker of the football and consistently owns the catch point, regardless of placement. He is going to be a playmaking Z receiver in the NFL.\nNo. 26 - Kayden McDonald\nWith his power, McDonald is at his best as a run-stuffer. He resets the line of scrimmage with his initial burst and power, then attacks blocks from a leveraged position. He will require time to develop more of a pass-rush identity, but his dominant run-game qualities will make him immediately useful for an NFL team.\nNo. 50 - Davison Igbinosun\nWith prototypical size and speed for outside work, Igbinosun can carry routes vertically and stay in phase to contest passing windows. Teams must be comfortable with his aggressive physicality — he was flagged a combined 16 times in coverage over the past two seasons (although that number decreased from 12 in 2024 to just four in ’25).\nNo. 54 - Max Klare\nKlare is a good-looking athlete, with the speed and urgency that suggest he has yet to play his best football. He needs to improve some of his pacing and the subtleties of getting open, but his route movements are crisp and fluid. The foundation is there to be a serviceable blocker, too.\nBrugler praised both Downs and Styles across different platforms this week. In a post on X, he said several NFL scouts have told him Downs is the best safety prospect they’ve ever evaluated.\nFun question I've been asking to scouts: \"Caleb Downs is the best safety prospect you've personally scouted since....?\"\n— Dane Brugler (@dpbrugler) February 12, 2026\nA few have answered \"Ever\" https://t.co/6jOUZWe677\nThen, in an appearance on The Athletic's Football Show, Brugler said Styles may have the highest floor of any prospect in the draft.\nI agree on both counts!\nARE YOU SURE ABOUT THAT? It’s funny. Downs is the best safety prospect some NFL scouts have ever seen, yet he didn’t crack the top three in Billy Tucker’s reranking of the 2023 ESPN 300 college football recruiting class. Instead, those spots went to Oregon quarterback Dante Moore, former Miami defensive end Rueben Bain Jr. and former Miami offensive tackle Francis Mauigoa.\nDowns checked in at No. 4 in the rerank. He was joined on the list by Arvell Reese and Carnell Tate.\nNo. 4 Caleb Downs\n2023 ESPN 300 ranking: 11\nBig Board ranking: No. 6 overall (No. 1 S)After tremendous production in high school, where he lined up at just about every position, Downs chose Alabama over Georgia, Ohio State, Notre Dame and Clemson. He had exceptional size, range and ball skills, and the five-star validated his ranking by making 107 tackles in his first year in Tuscaloosa to earn freshman All-American honors. Downs transferred to Ohio State after Nick Saban's retirement, where he was a two-time unanimous All-American, the Big Ten Defensive Player of the Year and earned the Jim Thorpe Award as the top defensive back in college football. An exceptional tackler with great ball skills, he's a projected top-five NFL draft pick.\nPrevious No. 4: Peter Woods, DT, Clemson Tigers\nNo. 6 Arvell Reese\n2023 ESPN 300 ranking: 266\nBig Board ranking: No. 3 overall (No. 1 OLB)Ohio State saw plenty of projection for Reese at outside linebacker, something we missed while evaluating the in-state product who had great range, length and physicality for a high school safety. Reese grew an inch and added 30 pounds of muscle during his time in Columbus and never lost his quick burst, change-of-direction and great coverage skills. He earned major accolades, including the Butkus-Fitzgerald Big Ten Linebacker of the Year and consensus All-America honors. Reese also developed into a legitimate pass-rushing threat and emerged as one of the biggest risers in the 2026 draft class, where he's now a projected top-10 pick.\nPrevious No. 6: Francis Mauigoa\nNo. 9 Carnell Tate\n2023 ESPN 300 ranking: 242\nBig Board ranking: No. 5 overall (No. 1 WR)Tate's strength and modest speed times out of high school were a concern, but against a national schedule as a senior at IMG Academy he posted 750 yards and eight touchdowns in eight games. For a taller receiver (6-foot-3), he dropped his hips extremely well and accelerated smoothly out of his breaks. He quickly proved he was next up in the Buckeyes' elite receiver pipeline. Tate continued polishing his route tree in college and his gliding top-end speed consistently beat defenders over the top. His ball skills have always been impressive. He finished his Ohio State career with 121 receptions for 1,872 yards and 14 touchdowns and is projected to be one of the first receivers off the board in April's NFL draft.\nPrevious No. 9: Jaquavious Russaw, LB, Alabama → Ohio State\nRussaw redshirted in 2023, broke out in 2024 with 36 tackles and two interceptions, then entered the transfer portal in January 2026 after a 2025 season hampered by injury. Despite high expectations as a 2023 five-star recruit, the highly versatile Russaw is seeking a fresh start with Ohio State as a redshirt junior in 2026.\nThree in the top 10?\nAnd Qua Russaw has untapped top-10 potential?\nThat seems good!\nREAL RECOGNIZE REAL. Thad Matta is one of the best college basketball coaches of the modern era. Don’t take my word for it. Take two-time national champion Dan Hurley’s.\nAfter Hurley’s UConn Huskies beat Matta’s Butler Bulldogs in a closer-than-expected 80-70 Big East matchup on Wednesday, the head coaches’ handshake turned into a longer-than-expected conversation. In fact, Hurley and Matta talked so long that TNT’s Jared Greenberg was shown waiting, microphone in hand, for his postgame interview with Hurley.\nWhen Hurley finally approached Greenberg, the sideline reporter asked him, “Just catching up with Thad Matta?”\n\"[Thad Matta's] one of the best college coaches... I've got so much respect for that guy.\"\n— TNT Sports U.S. (@TNTSportsUS) February 12, 2026\nDan Hurley with nothing but respect for the Butler HC as he spoke with @JaredSGreenberg after the win pic.twitter.com/29b5zkjYdh\n“I have so much respect for Thad. He’s one of the best college coaches in my generation. The work he did here the first time, what he did at Ohio State, when it was college basketball,” Hurley said. “He was one of the best at it, recruiting, developing. I’ve got so much respect for that guy. This new era, you know, I’m not sure he’s got the resources to be where a coach of his caliber should be.”\nThe loss dropped Butler to 13-12 overall and left Matta sitting on 499 career wins. Across 21 seasons as a head coach, Matta is 499-219 (.695), including marks of 78-23 (.772) at Xavier, 337-123 (.733) at Ohio State and 84-73 (.535) at Butler.\nAfter the game, Hurley doubled down on his earlier comments, advocating for greater financial support to help Matta compete in the NIL era.\nDan Hurley just made a Big East Coach of the Year case for #ButlerMBB Thad Matta\n— Sawyer Goldwein (@SGoldwein) February 12, 2026\nCash, man, they need money, Hurley said about what Butler needs to succeed pic.twitter.com/aYh3ZqSxD0\n“I have an idea of what they’ve spent, and he should be the Big East Coach of the Year for what he did with that team in the nonconference before they lost their starting point guard and before he lost his backup point guard,” Hurley said. “That guy, I coached against him when he was at Ohio State, obviously followed him at Butler when I was at X. He beat my ass I think in year one or year two there, when it was one of his great Ohio State teams.\n“When it was college basketball — just recruiting, developing, culture, building a program, player development, before this s--- turned into the G League — he was one of the best coaches. If you give him money, give him $8 (million), $9 million to build a team that could compete for championships, he’ll do as good as any of the coaches in the Big East. He’s as good as any coach in our league.”\nI think 97.1 The Fan’s Scotty Vegas said it best: I’ll continue to root for Jake Diebler as Ohio State’s head coach, but I also took for granted how elite Thad Matta was as the leader of the Buckeyes.\nI went to well over 100 Ohio State men’s basketball games and watched hundreds more growing up, and Matta made Big Ten championships and Final Four runs feel like the standard. I still believe that can be the expectation in Columbus — the Buckeyes have just lost their way. Here’s to hoping Diebler can put them back on track sooner rather than later. And hey, there’s no time like the present.\nOLYMPIC VILLAGE. Can I interest anyone in a No. 1 vs. No. 2 showdown on the mat?\nAt 7 p.m. in State College, top-ranked Penn State hosts No. 2 Ohio State in a dual that will likely decide the Big Ten regular-season title.\nThe projected lineup for No. 2 Ohio State at No. 1 Penn State pic.twitter.com/KmflRo8C8Q\n— Big Ten Wrestling (@B1GWrestling) February 12, 2026\nOhio State is off to the best start in program history at 17-0. The Buckeyes are 4-0 against top-five teams, 8-0 against top-10 teams and 11-0 against top-25 teams. But Penn State is a different animal and the same beast it’s been for years. The Nittany Lions are 13-0 and boast six No. 1-ranked wrestlers. The other four starters aren’t far behind, with all 10 ranked inside the top 12 in their respective weight classes.\nAll signs point to Ohio State being the stiffest test Penn State will see all season. Still, it’s hard to argue that anyone is operating on the Nittany Lions’ level. Their 13 wins include No. 20 Oklahoma (45-0), No. 22 Stanford (42-0), No. 14 Rutgers (46-0), No. 5 Iowa (42-3), No. 6 Nebraska (26-12) and No. 11 Michigan (38-3). Quick math? That’s 239-18 in favor of the Nittany Lions.\n#GoBucks pic.twitter.com/Wzruie7p8n\n— Ohio State Wrestling (@wrestlingbucks) February 13, 2026\nOhio State last won in State College in 2009, 33-7. The Nittany Lions lead the all-time series 27-12.\nMy mind says the Buckeyes won’t shock the world on Friday — but my heart says anything is possible!\nSONG OF THE DAY. \"Something In The Way\" - Nirvana.\nCUT TO THE CHASE. Phillies release Nick Castellanos, who admits to bringing beer into dugout... A 54-year-old personal injury lawyer from Minnesota just became the oldest US Winter Olympian... The best restaurant near you, according to USA TODAY... Breezy Johnson gets engaged after crashing out of women's Super-G race at Winter Games... NBC’s Winter Olympics TV viewership up 93% through five days... Ole Miss quarterback Trinidad Chambliss granted injunction by judge.",
  "word_count": 2172,
  "scraped_at": "2026-02-14T13:23:06.954479"
}