{
  "article_id": "4e8e60310cc0",
  "url": "https://www.thegazette.com/iowa-hawkeyes/key-points-of-gary-bartas-tenure-as-ui-athletic-director/",
  "title": "Key points of Gary Barta tenure as UI athletic director",
  "date": "20230526T234500Z",
  "domain": "thegazette.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "116 3rd St SE\nCedar Rapids, Iowa 52401\nHome / Sports / Iowa Hawkeyes Sports\nKey points of Gary Barta’s tenure as UI athletic director\nHe retires Aug. 1 — the 17-year anniversary of him being introduced at Iowa\nVanessa Miller\nMay. 26, 2023 5:40 pm, Updated: May. 26, 2023 9:39 pm\n2003-2006: Gary Barta serves as athletics director at the University of Wyoming.\nAug. 1, 2006: Barta starts his tenure as the University of Iowa athletics director, having served in athletics administration at the universities of Wyoming, Washington and Northern Iowa.\n2010: Former member of the Hawkeye women’s crew team Margaret Krusing sues the UI, accusing it of poor supervision by medical and training personnel during training.\nMarch 28, 2010: Barta hires Fran McCaffery as men’s basketball coach, replacing the fired Todd Lickliter.\nJanuary 2011: Thirteen football players are hospitalized with rhabdomyolysis — a serious medical condition — after strength and conditioning coach Chris Doyle led an offseason workout. Barta didn’t comment and football coach Kirk Ferentz eventually defended Doyle, calling him “the most sought-after coach that I’ve ever been around.”\nJanuary 2012: Brian Ferentz is hired as the UI football program’s offensive line coach, saying his father — Kirk Ferentz — reached out to him. Given nepotism rules and regulations, Barta says he made the hiring call and institutes a management plan where he will serve as Brian Ferentz’s boss, not Kirk Ferentz.\nMay 2012: Rowing coach Mandi Kowal resigns amid the Krusing lawsuit after 18 years on the job.\nOctober 2013: The university agrees to a $300,000 settlement to resolve the lawsuit, also paying Krusing $60,000 to keep her on an athletic scholarship while she finished her degree at Marquette University.\nMarch 2014: Former Hawkeye player William Lowe sues the UI for his hospitalization after the rhabdomyolysis incident in 2011. An internal investigation finds the coach preparation and response lacking, and the UI eventually settles the lawsuit for $15,000.\nAug. 4, 2014: Barta fires then-UI field hockey coach Tracey Griesbaum after a UI investigation reported several field hockey players said she had been verbally abusive — a move that later compelled Griesbaum to sue, alleging discrimination.\nOctober 2014: Former volunteer and assistant UI track coach Michael Scott files a lawsuit accusing the UI Athletic Department of passing him over for a job coaching the UI men’s and women’s track teams due to a mandate a woman be hired.\nJan. 1, 2016: The Hawkeye football team, having won the Big Ten West Division championship, returns to the Rose Bowl after 25 years — having last appeared in 1991. They lose 45-16 to Stanford University.\nJanuary 2016: UI officials announce they paid Scott $200,000 to settle his discrimination lawsuit.\nMay 4, 2017: A Polk County jury awards former UI Associate Athletics Director Jane Meyer $1.43 million in her lawsuit accusing the athletics program of discrimination and retaliation.\nMay 19, 2017: The UI announces it will pay a total of $6.5 million to settle discrimination cases brought by Meyer and her longtime partner and former UI field hockey coach Tracey Griesbaum. That settlement, which includes the Meyer jury award, comes after her attorneys file motions seeking additional damages.\n2019: UI Athletics debuts its new $89.9 million Kinnick Stadium North End Zone.\nJune 2020: In the wake George Floyd’s murder in Minnesota, compelling nationwide protests, more than 55 former Iowa football players take to social media to accuse the Hawkeye program of fostering a culture of racism and bullying. The comments compel the UI to place strength and conditioning coach Doyle on administrative leave.\nJune 15, 2020: The UI announces it has reached a “separation agreement” with Doyle, paying him $1.1 million to resign immediately.\nAug. 21, 2020: In the throes of the pandemic, Barta announces plans to cut four varsity sports programs — men’s and women’s swimming and diving; men’s tennis; and men’s gymnastics.\nSeptember 2020: Despite efforts from parents and alumni of the eliminated sports, Barta insists reinstating the sports isn’t an option — regardless of how many millions the advocates raise.\nSept. 25, 2020: Four female members of the Hawkeye swimming and diving team file a Title IX complaint in U.S. District Court accusing the UI Athletics Department of discrimination and violating Title IX gender equity mandates.\nNovember 2020: Twelve former Hawkeye players sue the football program and coaches — including Barta, Doyle, Kirk Ferentz and assistant Brian Ferentz — accusing them of creating a hostile, discriminatory and racist environment.\nFeb. 15, 2021: After a federal judge in December found the female athletes had a “fair chance” of winning their Title IX lawsuit, Barta announces he'll fully reinstate women’s swimming and diving. The three men’s sports remain dropped.\nJune 30, 2021: UI Athletics signed a deal to borrow $50 million from the main campus to help supplement losses from anticipated revenue during COVID-19.\nJuly 2021: UI Athletics announces it would name the field at Kinnick Stadium “Duke Slater Field” in honor of the first Black student-athlete in school history to earn All-American honors.\nSept. 23, 2021: The UI reaches a settlement with the female athletes who accused the athletics program of Title IX violations, paying them nearly $400,000. The settlement also requires UI Athletics to permanently reinstate women’s swimming and diving for at least seven years and to add a women’s wrestling program — making it the first school in a Power Five conference to do so.\nMarch 6, 2023: The State Appeal Board approves a $4.2 million settlement in the racial discrimination lawsuit against UI Athletics — despite State Auditor Rob Sand’s contention he would vote against it as long as Barta remained at the helm. In a statement, Kirk Ferentz says he and the coaches didn’t know about the settlement and didn’t agree with it.\nApril 2, 2023: The Hawkeye women’s basketball makes its first appearance in the NCAA national championship game. They lose to Louisiana State University, 102-85.\nMay 8, 2023: The UI, along with Iowa State University, announces student athletes are being investigated for betting on sports in violation of NCAA rules.\nMay 26, 2023: Barta announces his retirement, nearly a year before his contract was set to expire in June 2024.",
  "word_count": 1028,
  "scraped_at": "2026-02-14T13:48:48.520647"
}