{
  "article_id": "4ea7c52f1e3d",
  "url": "https://liverpooloffside.sbnation.com/liverpool-fc-women-news-results/2025/2/27/24374240/liverpool-fc-women-manager-matt-beard-leaves-with-immediate-effect-wsl-championship",
  "title": "Matt Beard Leaves Liverpool FC Women With Immediate Effect",
  "date": "20250227T201500Z",
  "domain": "liverpooloffside.sbnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "There’s no sugarcoating it. The club announced on Thursday that Liverpool manager Matt Beard is leaving his post with the Women’s team with immediate effect, with assistant manager Amber Whiteley once again stepping into the interim role. While the results haven’t been ideal for the women’s arm of the club this season, they are still competing in the Women’s FA Cup and sit solidly in seventh place - well away from the relegation zone.\nMatt Beard Leaves Liverpool FC Women With Immediate Effect\nThe manager returned to Liverpool after stints at the NWSL and West Ham in 2021 and helped return the women to the WSL.\nBeard rejoined a club in turmoil in 2021, after leading the squad to back to back titles in 2013 and 2014. The Women had been relegated to the Championship league following the shutdown of the 2019-2020 season, were still playing at Prenton Park across the river, and seen as a joke throughout the Women’s Super League. Opposing players often referred to them as Tranmere Women due to their poor stadium and training setups.\nBeard’s return was viewed as the sort of catalyst that the club needed to get back on their feet and into their rightful place as one of the founders of the Women’s Super League. They did achieve it following season, after Vicky Jepson stepped down in January 2021, paving the way for Beard’s return. The Women’s team were promoted after winning the Championship outright in 2022, spurring a litany of changes for the often neglected sector of Liverpool Football Club.\nBeard was instrumental in pushing the club to join the 21st century and give the women a space of their own to train and play. Not long after winning promotion, the Women announced they were moving into Melwood Training Ground after redeveloping it and updating it’s features to better support the women’s team. This of course followed the outcry of being excluded from the “state of the art” facility built for the men’s and academy teams in Kirkby.\nLiverpool have been able to stay in the challenging Women’s Super League since Beard’s takeover, and while the improvements didn’t stop at Melwood (with the club announcing they were leaving Prenton Park for St. Helen’s Stadium last summer), the ability to draw in top players has been a different challenge. Even as the WSL has grown in popularity (finally), Liverpool has often been seen as the lesser of the founding clubs and the quality of the players in the league has just outshone a lot of what Beard and the club have been able to achieve. It may feel cliche, but we’re Liverpool, the most successful club in English football, and even our Women’s team should be able to compete against the likes of Chelsea, Arsenal, and the Manchester teams.\nIt appears, unfortunately, that that quality has finally moved past Beard’s abilities to do what he can with what he has. He has spoken often this season about their inability to sign players that will help him challenge in the league, though it could be any combination of lack of funds, lack of available quality, or any players even wanting to come to Liverpool that has kept him from having the squad he wants. Even as the club struggles as a whole, someone has to take the fall for bad results, and it’s more often than not the manager.\nSo it is that the four year return of Matt Beard comes to an end.\n“I am proud with what we managed to achieve over the last three-and-a-half years, including promotion back to the WSL,” Beard said in his farewell message.\n“I could not have asked for more from the players and staff, and thank them for all their sacrifice and support.\n“To our wonderful fans – what a journey it has been across two spells. We would never have achieved anything without you and I thank you for all your love.\n“I will reflect fondly on my time at Liverpool whilst considering my next steps, and look forward to continuing to support Amber [Whiteley] and the team from afar for the rest of the season.”\nThe women travel south to face Crystal Palace on Sunday March 2 for their next match in the Women’s Super League.",
  "word_count": 713,
  "scraped_at": "2026-02-14T12:23:09.732742"
}