{
  "article_id": "4eb37620c2eb",
  "url": "https://www.dailypress.com/2025/09/18/acc-schools-rethink-scheduling-with-leagues-new-revenue-model-in-place/",
  "title": "ACC schools rethink scheduling with league new revenue model in place – Daily Press",
  "date": "20250919T091500Z",
  "domain": "dailypress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Mike Norvell got everything he wanted with his Florida State team opening against tradition-rich Alabama — and winning — on network television.\n“We’re going to play an aggressive schedule,” the coach said. “We want those showcase games.”\nThey pay off more than ever in the Atlantic Coast Conference, too.\nThe league now incorporates TV viewership into its revenue-distribution plan for member schools. That means teams playing in high-ratings matchups profit beyond the typical payouts from the ACC’s media rights deal — a departure from decades of equal distribution — as schools seek additional revenue streams now that they can pay athletes directly.\nThat is forcing coaches and administrators to rethink scheduling. Chase better nonconference matchups? Play Friday nights with less competition in other time slots?\nIt’s all part of the discussion, even once-marginalized details.\n“You have to,” Duke coach Manny Diaz said. “You’re looking for opportunities now to be seen.”\nThe plan: The change launched from a March legal settlement, which ended a barrage of lawsuits between the league and member schools Florida State and Clemson tied largely to costs for schools to potentially leave the ACC.\nThis is the first year with the league distributing 60% of TV revenues based on a rolling five-year viewership formula, with the remaining 40% dispersed equally among schools. Football represents 75% of that viewership payout and men’s basketball 25% as the top revenue-driving sports.\nAdditionally, a person with knowledge of the plan told The Associated Press that the current year carries 35% of the value in the five-year formula; the previous four years combine at lower weights for the remaining 65%. The person spoke to the AP on condition of anonymity because the league hasn’t publicly discussed all model details.\nThat means strong TV numbers could reverberate for years. It’s similar to units earned by school victories in the NCAA men’s and women’s basketball tournaments, which pay out for six years to offer compounding value.\nThe league’s marquee brands, such as FSU, Clemson and Miami in football or Duke and Louisville in men’s basketball, are poised to profit.\nNorth Carolina could benefit on both fronts. Beyond their tradition-rich men’s basketball program with six NCAA titles, the Tar Heels have a football spotlight with six-time Super Bowl winner Bill Belichick as their first-year coach.\nAthletic director Bubba Cunningham said internal estimates of the potential impact offered a simple conclusion.\n“We will get more money because of our media interest as we go forward, yes,” he said.\n“Control what we can control”: The ACC got off to a quality start under the new model.\nBroadcasters ESPN and ABC announced their best Week 1 on record earlier this month. The top six games featured ACC teams, headlined on ABC by now-No. 4 Miami beating now-No. 24 Notre Dame (10.8 million viewers), now-No. 7 FSU’s win over now-No. 14 Alabama (10.7 million) and Clemson’s loss to now-No. 3 LSU (10.4 million).\nThen came ESPN broadcasts of UNC’s loss to TCU in Belichick’s Labor Day debut (6.1 million), Virginia Tech’s Sunday loss to South Carolina (5.4 million) and now-No. 18 Georgia Tech’s Friday win at Colorado (3.7 million).\nThose games will factor into league payouts through the 2029 season before dropping out of the five-year rolling formula.\nScheduling nonconference football games typically goes years into the future, and there’s always the possibility the ACC changes its eight-game league schedule as other power conferences go to nine to shrink the number of nonconference openings.\nYet the incentive to schedule must-watch matchups would remain.\n“Ultimately,” Norvell said, “we’ve got to control what we can control in the process of it.”\nStrategic discussions: Clemson athletic director Graham Neff understands that well.\nThe Tigers have two football national championships and nine ACC titles under Dabo Swinney, while men’s basketball coach Brad Brownell is the league’s longest-tenured coach and led Clemson to the Elite Eight two seasons ago. So the school was already chasing brand-publicizing opportunities like its 12-year football deal with Notre Dame starting in 2027 or its men’s basketball’s invitation to the prestigious Thanksgiving-week Maui Invitational in Hawaii next season.\n“TV viewership and the finances that drives is now more than ever part of that conversation,” Neff told the AP. “It’s just not necessarily the driver of that conversation.”\nStill, Neff called the change to the revenue-distribution model “really innovative” and said he’s pleased to see how scheduling strategies have been at the forefront of league conversations. He also pointed to another benefit: providing better games for ESPN, which has a media rights deal with the ACC through 2036 that includes the ACC Network.\nNeff called it a “positive partnership play.”\n“It incentivizes investment in those sports just for competitive success, but it provides great value back to our media partner in ESPN,” Neff said. “If now all decision-makers like ADs and coaches are more frontal-lobe about scheduling and prominent matchups and TV slots and days, in theory that’s more strategy and providing more value as a league to ESPN.”\nRevamped revenues: The viewership wrinkle is one of multiple moves in the ACC’s yearslong fight to counter a revenue gap behind the Big Ten and Southeastern Conference. Notably, the league launched its “success initiative” last year, allowing schools to keep money generated by their own postseason success.\nThat plan could mean $20 million to $25 million more per school in a big year. And at the time of the legal settlement, a person familiar with the situation told the AP that the upside of the viewership-model change could be $15 million or more for top-earning schools, and potentially about $7 million less for others.\nBoth changes accomplished a similar goal for Commissioner Jim Phillips: The additional money would theoretically be accessible to any league member, incentivizing a school to field a program that viewers want to watch because of its elevated success.\n“I think everyone understands now that we don’t say this is a business under our breath anymore,” Diaz said. “We recognize this is a legit business. So to me, whatever’s good for the business of Duke football or Duke athletics or college football in general, everybody’s got to be on board to do those things.”\nAP freelance writer Bob Ferrante in Tallahassee, Florida, contributed to this report.",
  "word_count": 1038,
  "scraped_at": "2026-02-14T12:43:38.812746"
}