{
  "article_id": "4eb9d33b5d75",
  "url": "https://news.illinoisstate.edu/2025/12/this-month-in-illinois-state-university-history-december-3/",
  "title": "This month in Illinois State University history : December",
  "date": "20251216T021500Z",
  "domain": "news.illinoisstate.edu",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "From the beginning of a holiday tradition to Abraham Lincoln’s role in starting the University, Tom Emery explores this month in Illinois State University history.\nDecember 1\nOn this date in 1970, the Illinois State University men’s basketball team played its first game under Will Robinson, the first African American head coach in NCAA Division I history.\nRobinson’s five years at Illinois State were part of an illustrious career in multiple sports. He came to Normal after a sparkling 28-year head coaching career on the high school level in the Detroit area, including at Miller High School and Pershing High School.\nA ground-breaker throughout his life, Robinson was the first African American high school coach in Michigan history. He remained the lone Black high school coach in Michigan for 16 years. His 1967 Pershing team included five players who went on to NBA or NFL careers.\nOn February 27, 1970, Robinson was hired as the Redbirds’ head coach and made his on-court debut at Horton Field House in the season opener that December 1. As The Vidette reported, the Redbirds, “ignoring opening night shakes … calmed down to a contest of attrition” in an 80-67 victory over Bemidji State.\nThat same night, Doug Collins made his varsity debut for Illinois State and finished with 15 points. Collins and Robinson would become synonymous with the Redbirds’ success of the early 1970s, and Collins would leave as the school’s all-time leading scorer. He was a member of the 1972 U.S. Olympic team and the top pick in the 1973 NBA draft.\nRobinson’s Illinois State teams finished with winning records in each of his five seasons at the helm and featured some of the most potent offenses in school history. The Redbirds broke the 100-point mark in 26 games under Robinson, including four-straight from February 12-22, 1975.\nAfter leaving Illinois State in 1975, Robinson returned to Detroit and became a scout for the Detroit Pistons, helping discover some of the franchise’s all-time great players. Prior to that, Robinson scouted for the Detroit Lions and found some of that team’s best-ever performers.\nDuring the Pistons’ NBA title season of 2003-04, the franchise named its locker room the “Will Robinson Locker Room of Champions.” Robinson died in Detroit at age 96 on April 28, 2008, ending the life of a sports hero whose legacy touched countless lives, including in Normal.\nDecember 15\nOn this date in 1944, a small plane carrying Maj. Glenn Miller, the famed American big band leader, went down over the English Channel. The death of Miller would have been mourned at Illinois State, where he had plenty of fans.\nThe Glenn Miller Orchestra is considered the foremost musical act of the big band era, and many of its biggest hits, like “In the Mood,” “Moonlight Serenade,” “String of Pearls,” and “Chattanooga Choo Choo,” are considered iconic contributions to American music.\nMiller, who was born in Iowa in 1904, had struggled to find success with earlier bands before forming his world-famous orchestra in 1938. He skyrocketed to success in a remarkably short time.\nFrom 1938-42, the Glenn Miller Orchestra had 16 number-one singles and 69 top-10 hits. Those were more in a four-year span than either Elvis Presley or the Beatles.\nIllinois State was also caught up in the big band craze, and Miller was at the top of the list for most students. On May 10, 1940, The Vidette reported on the Billboard “College Music Poll” of students in 108 American colleges, including Illinois State. The Glenn Miller Orchestra was the favorite by a wide margin.\nThat April 26, The Vidette had interviewed Leroy Brandt, the captain of the Illinois State basketball team in the 1940-41 season. The paper reported that “Glenn Miller ranks high in Brandt’s favor, particularly his renditions of ‘In the Mood’ and ‘Tuxedo Junction.’”\nOn April 9, 1943, The Vidette printed an interview with Lois Jahnke, the newly-elected president of the Women’s League, a campus fixture for female students for decades. Like Brandt, Jahnke said she “enjoys listening to Glenn Miller.”\nMiller was also a popular pick at a nickelodeon dance sponsored by the Women’s League and University Club on June 22, 1940. There, attendees could cut a rug to the “waxed offerings of Glenn Miller, Tommy and Jimmy Dorsey, Benny Goodman,” and others.\nThough he was earning the modern equivalent of $385,000 a week in 1942, Miller stepped away from his superstardom to join the service. He continued his musical brilliance with the Glenn Miller Army Air Forces Orchestra, which entertained troops from early 1943 until his untimely death in 1944.\nIn 1956, the Miller Orchestra was revived under the direction of Ray McKinley, who had assumed command of Miller’s military band. The new Glenn Miller Orchestra has been a favorite in multiple appearances at Illinois State, including in 1957, 1965, 1977, and 1982. It proves that good music—like the sound of the incomparable Glenn Miller—never goes out of style.\nDecember 16\nOn this date in 1956, the first Madrigal Dinner was held on the Illinois State campus. The event began a tradition that lasted for six decades and rose to become one of the University’s most beloved campus activities.\nThe Madrigal Singers at Illinois State had been founded in the fall of 1956, and their Christmas dinner quickly took hold.\nTickets for that first event, held in the Student Union, cost $2.50 and featured the breathtaking, acapella music of madrigals, which came to England from Italy in the 16th century. The initial dinner also featured a blend of American and European folk songs, modern compositions, choral works, and seasonal selections.\nThe feast portion of the events included traditional English fare. The menu for the 1984 dinner included such delicacies as wassail, beef barley soup, roast prime rib, “madrigal bread,” peaches jubilee, oven-roasted potatoes, and glazed carrots. Traditional English humor highlighted the events and always brought laughter.\nBy the 1970s, the Madrigal Dinners had exploded in popularity. The 1971 event featured 17 dinners, with an average attendance of 325 for each performance.\nHowever, the tradition finally began to wane in 2008, when attendance began to decline amid increased competition not only for consumer dollars, but also in the high number of holiday activities in the area. Production costs also rose, including maintenance of the ornate and beautiful costumes, some of which were 40 years old.\nThe final Madrigal Dinners on December 11-13, 2015, were a bittersweet ending to a longtime favorite of the Illinois State community—one that generated countless smiles and memories.\nDecember 23\nOn this date in 1857, the minutes of the state Board of Education, which established Illinois State University and governed it in its earliest days, reported that Abraham Lincoln was to be retained as a debt collector on behalf of the school.\nThe move was made in response to the failure of many of the University’s earliest supporters to come through on their pledges. It was also another key moment in Lincoln’s early connections to Illinois State.\nEarlier in 1857, as the University was being founded, dozens of area businessmen and friends offered pledges of money. Many of the funds were used for the guaranty, which Lincoln himself wrote as attorney for the state’s Board of Education.\nThe guaranty was critical to keeping the campus in Bloomington (the town of Normal had not been established at that time). Without the guaranty, the location of the University would likely have been moved to Peoria, the top competitor in the race to host the institution.\nHowever, the Panic of 1857 hit Central Illinois hard, as land values and commodities plummeted in value. As a result, many of the subscribers could not honor their commitments.\nFearing for the finances of the University, the board once again turned to Lincoln, who was an expert on the subject. Debt collection was a major part of Lincoln’s law business; one writer estimates that 40% of his legal business involved some form of collecting debts.\nLike many other attorneys in the era, he routinely argued against friends and associates, including some of his old neighbors from New Salem, often in debt collection cases.\nEven though Lincoln was friends with many of the subscribers of Illinois State, he was willing to take them on in court to collect the pledges. In the end, though, he apparently was not needed to collect any monies, as there are no further references on the subject.\nThe Lincoln legacy still lingers over the Illinois State campus. Fortunately, the man who became America’s greatest president did not have to collect debts on the University’s behalf.\nDecember 26\nOn this date in 1970, the Baltimore Colts rolled past Cincinnati 17-0 in the divisional round of the NFL playoffs. Three weeks later, the Colts won Super Bowl V with a 16-13 victory over Dallas.\nDennis Nelson, a 1969 graduate of Illinois State, was an offensive lineman on the Colts’ championship team that season. He became the first of two former Redbirds to win a Super Bowl ring.\nThe 6’5, 260-pound Nelson was a four-year letterwinner in football for Illinois State from 1965-68 and was drafted in the third round of the 1969 NFL draft by the Colts, one of the elite franchises in the league at the time. Baltimore was a combined 55-12-3 over the previous five seasons and was coming off a Super Bowl appearance a few months before drafting Nelson.\nIn 1969, Nelson was a member of the Colts’ “taxi squad,” comparable to today’s NFL practice squads, and did not see game action. He was on the active roster in 1970, however, and made his first career start in a 24-20 win over Houston on October 11, 1970.\nNelson appeared in six games in 1970 as the Colts went 13-1. However, his playing time increased dramatically in 1971 as he saw action in fourteen games, with two starts. The Colts finished 10-4, and advanced to the AFC Championship game that year.\nFrom 1972-74, Nelson was Baltimore’s regular starting right tackle. After a season out of football in 1975, he returned for two years with the Philadelphia Eagles. His last NFL appearance was in a 27-0 victory over the New York Jets on December 18, 1977.\nNelson appeared in a total of 77 NFL games, with 45 career starts. In 1975, while still an active NFL player, he was inducted into the Illinois State Athletics Percy Family Hall of Fame. His jersey was retired by Illinois State in October 1995.\nTom Emery is a freelance writer and historical researcher who, in collaboration with Carl Kasten ’66, co-authored the 2020 book Abraham Lincoln and the Heritage of Illinois State University.",
  "word_count": 1773,
  "scraped_at": "2026-02-14T12:50:35.508648"
}