{
  "article_id": "4efe917163bc",
  "url": "https://theathletic.com/4558521/2023/06/05/champions-league-turkey-christian-atsu-earthquake/",
  "title": "  The emptiness makes it more painful  – Christian Atsu club after Turkey devastating earthquakes",
  "date": "20230605T051500Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Ahead of Saturday’s Champions League final in Istanbul, The Athletic’s Adam Leventhal visits Turkey for a series of reports examining the impact of February’s earthquakes on the country, its people and their football clubs.\nIn the centre of Antakya, the capital of Hatay province in south-eastern Turkey, there is an eery silence where a bustling city once stood. The only sound is the rubble and broken glass crunching underfoot.\nAdvertisement\nIt is a picture of brutal destruction on a mass scale. Buildings turned into piles of their component parts, twisted and distorted. Odours float uncomfortably on the breeze, suggesting the bodies of the dead remain entombed.\nAll around is terror: a roof tightly pressed onto a ceiling, onto a bed frame, onto a floor. Compacted, soundless concertinas. Crumpled cars shoulder the weight of bricks. Shoes, clothes and toys woven into concrete.\nOn February 6, an earthquake measuring 7.8 on the Richter scale struck at 4.17am as people slept. Those who survived and were able to escape encountered another earthquake of 7.7 magnitude at 1.24pm. Many were still trapped.\nOn February 20, a further 6.4 magnitude earthquake struck at 8.04pm.\nConservative estimates put the death toll at 60,000. At least 23,000 people died and 30,000 were injured in Hatay’s 15 districts alone.\nAmong them were seven people from Antakya’s first-division football team, Hatayspor. They were the club’s sporting director Taner Savut, academy players Hamza Surer and Fatin Can, goalkeeper coach Huseyin Danahaliloglu, kitchen worker Susan Berber, kit man Onur Akdeniz, and Christian Atsu, the former Ghana international who played for Chelsea, Newcastle United, Everton and Bournemouth.\n“Not one, two, three, or even a hundred people, it felt like it was everybody,” says Volkan Demirel, Hatayspor’s head coach. “People were screaming and crying, people without clothes, people without limbs, everything. It was chaos.”\nAtsu, 31, had scored the winner against Kasimpasa just hours before the first earthquake hit.\n“For two months he’d not played because of injury but in the week building up to the game he came to my office and said that he was ready to play,” says Demirel. “I told him that’s good, but he wasn’t ready to start. In the last 10 minutes, we decided to put him on.\nAdvertisement\n“In the last minute, we got a free-kick and I was telling him to cross it, but he told his team-mates he was going to shoot, and he scored a beautiful free-kick.\n“I was so happy for him because he’d been out for a while. He was a good player, but most importantly a good man, a good character, he helped everyone, he would always give money to staff. He had a very big heart.\n“After the match, he said to me, ‘I want to keep playing’. The last time I saw him he was happy and then he was gone.”\nIn the home dressing room at Hatayspor’s stadium, mud, grass, sock tape and strapping are strewn on the floor, suspended in a happier time. Water and fizzy drink bottles overflow from a bin, plates of food sit on a counter. The tactics board stands untouched ready for the next game that wouldn’t come. On the wall, which now bears cracks, there is a series of images detailing set-piece instructions.\n“This is where Christian sat,” explains Koray Yildiz, Hatayspor’s media officer, as he points to one of the red seats. The dressing room would normally be cleared the morning after the game, but by then everything had changed.\nThe pitch is now dry and browning further day by day as summer temperatures rise. Metal sheeting has fallen from the roof onto the seats below, floodlights dangle precariously overhead.\nThe corridors inside the stadium are littered with debris from fallen ceilings. Outside the players’ entrance, a big crack opened during the earthquake where the team last stepped off the coach. There are other larger scars on the perimeter road.\nYildiz stands at the exact spot where Atsu took that free-kick and recalls their last interaction.\n“I’m club photographer too, and was behind that goal,” he says. “After the ball hit the net, I couldn’t concentrate and I slipped so I didn’t get the best picture. After the game, I said sorry to Christian for not getting the best shot, and he just smiled at me and said: ‘No problem’. He was a lovely, humble guy.”\nEveryone said goodbye, including coach Demirel.\nAdvertisement\n“Afterwards, I always analyse the games, so I went to sleep late,” he says. “Soon after I’d got to bed I felt the building starting to shake. Normally, when we’ve had tremors or earthquakes before it shakes from side to side (but) this time the floor was going up and down too.\n“My wife went straight to my nine-year-old daughter, I went to our five-year-old daughter. They were so scared, they didn’t know what was going on. The earthquake lasted one minute and 40 seconds, which is a very long time. All I could do was lay above my daughter in the plank position, if the wall fell down I wanted to protect her and for it to fall onto me, not her.”\nDemirel and his family escaped. Atsu’s apartment, though, had collapsed when the first earthquake struck. Both he and the club’s sporting director Taner died in that apartment building.\n“Their building fell backwards and most of the people on the back side of the building died,” says Demirel. “Some of my other friends and colleagues from the club were on the front side and they managed to get out.”\nThe scale of the demolished site where the Renaissance Residence once stood is breathtaking. The rubble of the fallen blocks has largely been removed to reveal the vast underground car park and the ground floor swimming pool with its light blue tiles marked out against the grey concrete debris.\nThere is an ongoing investigation by Turkey’s justice ministry into why this, and thousands of other buildings, collapsed. The New York Times also produced their own research into what happened at the building and the city as a whole. There were many contributing factors, including poor soil for foundations, design and construction and non-compliance with building regulations.\nThe cause and any potential punishment will, however, provide little consolation to the hundreds of families — including Atsu’s wife Marie-Claire and his three young children — who have lost loved ones. Reminders surround you of the lives cut short: Lego pieces, a small slipper with strawberries across the strap, a book called Flutterby Butterfly and a doll in one pile. There’s a wicker basket, a designer shoe, a dress, some luggage and a tennis racket just a few steps away.\nAtsu’s brother, sister, a close friend from Portugal and his agent Nana Sechere joined the search in the hours that followed the disaster. There was a rumour, which was incorrectly confirmed by a club official, that Atsu had been found alive. The club regrets that misinformation circulated at the time, and made an official statement on the matter only when Atsu’s death was confirmed.\nAdvertisement\n“It was something that spread so quickly, somebody saw a guy they thought was Christian,” says Demirel. “We knew it was not true, I went nearly every morning to the buildings, other people were saying this and that.”\nThe circumstances of the misidentification and other factors associated with the disaster remain part of an ongoing dialogue between Atsu’s legal representatives and the club.\nAtsu was found 12 days after the first two earthquakes. The chance sighting of one of his shoes between the legs of a rescuer by his agent Sechere indicated they were getting close to his room. They had hoped that they would find that he hadn’t been there that night, but his body was eventually recovered.\nSechere had been due to be at the game against Kasimpasa, but a ticket booking mix-up postponed the visit. He too would have been in Atsu’s apartment the night of the earthquakes.\nThree days later, Savut’s body was also removed from the scene.\n“I got a call to say that they had found Taner at one of the local hospitals and we went there to the morgue and they opened the body bag and we had to say yes, it was him,” says Demirel. “I went to the hospital to do that for a lot of people. I saw Christian, Taner — a lot of people.”\nThe kit man, Onur Akdeniz, was trapped in another building.\n“One of the medical services was able to pull him out of the collapsed building and rushed him to the hospital, but sadly they were unsuccessful in saving him,” says Demirel.\nAfter the earthquake, club staff gathered at the training ground. But some never came as the worry intensified. “We were waiting for everyone to come, but people were missing, so we went to search for them,” says Demirel.\nAtsu’s name remains on the squad list on the pinboard in Demirel’s office. Atsu’s face is still on a magnet on a whiteboard with pitch markings. Savut’s office remains untouched.\n“We were like family here as a team. We spent more time together than with our families. I can’t find words to describe my sadness for the friends we lost,” says Yildiz.\nAdvertisement\n“I lost my aunt and five cousins (too). Somehow it is necessary to continue life, but everyone is unhappy. We think about what we lost before going to bed every night and feel the sadness. The emptiness makes it more painful day by day.”\nThe stadium car park is now full of tents with the AFAD (Turkey’s disaster management department) logo on them. Children have tried to soften the austere environment by drawing pictures on the outsides; one has hand prints in paint. Three young girls sit having a chat leant up against one of the areas set up to supply food.\nThe club’s facilities are now being used to care for some of the 1.1 million people who have been displaced in Hatay province alone, and the United Nations emergency response centre has been situated here since the disaster.\nAfter the initial search and rescue phase came the task of caring for people in freezing winter conditions. Now the temporary dwellings are swelteringly hot during the day. There are significant problems with sanitation and hygiene, with concerns for the elderly and women with small children in particular. The region’s education and health infrastructure has also been severely disrupted.\nAt Hatayspor’s training ground closer to the centre of Antakya, approximately 200 military green tents cover the pitches, housing over 1,000 people. Many of the club’s staff live here now with people from the displaced local community. Inside one tent, there are seven mattresses, a wooden bench and a table. Some live in containers that have been moved onto the site, including teenage sisters Burchin and Yagmur.\nDuring the earthquake, they jumped out of their beds just before a wall fell onto where they had been sleeping. They were trapped in their house after another building collapsed onto it. “It was like a nightmare,” says Yagmur. “Our building started to lean forward, our stairs were gone; we could hear people screaming from inside the wreckage in the other buildings around us. Ours was one of only two on our street to not fully collapse. I saw a six-storey building next to ours become just three.”\nThey escaped with their younger sister, mother and father, only with what they were wearing. Their father, barefooted, pulled three people from the rubble. They call a 20-foot container home now. “When we lived in our house, we didn’t realise how beautiful it was. But at least we are living,” says Burchin.\nAdvertisement\nHatayspor and Gaziantep were the only two Super Lig teams to stop playing after the earthquake. In total, nine teams across the country’s four tiers called a halt to their season after the government declared a state of emergency. The Turkish Football Federation gave teams the option to stop and players could be loaned out until the summer. Seven players left Hatayspor for other clubs including Canada international Samuel Adekugbe, who joined Galatasaray.\nThe club hope that the damage to their stadium, which was built only two years ago, will be repairable rather than needing significant structural work. Nevertheless, the team won’t play in Hatay next season — they are moving.\n“We have officially decided where we would play next year, because we do not think that next year will be suitable for stadium football yet,” Lutfu Savas, the mayor of Hatay and the club’s honorary president, tells The Athletic. “We will play in Mersin. We are currently doing some work there.”\nMersin is a three-hour drive west of Hatay around the Mediterranean coast.\n“I would only go to one other team: Fenerbahce,” says Demirel, having spent 17 years there as a goalkeeper. “But I want Hatay people to be happy again. I want to stay here for now. That’s the most important. Now I’m preparing for the new season, with new players, new stadium and to start again. Mersin is a good city and many Hatay fans will be able to come there.”\nIt was Demirel’s emotional Instagram post — in which he pleaded for help in tears — in the hours that followed the earthquakes that first alerted the world to the grave situation in Hatay, and he wants to continue that fight.\n“Nothing was working, no phone, no wi-fi,” he says. “Everything stopped. Our last chance to let people know what was happening was social media. So I did this video, but I didn’t know if it had been sent or not.\nAdvertisement\n“When I was a footballer I always fought for success. Then I was fighting again. Because people were looking to me for inspiration. After the earthquake, and until my video, it seemed like nobody was coming to Hatay; no police, no fire.”\nThe mayor — reflecting a city in desperate need of help — is open when asking for more help from the wider football family.\n“There is so much material and moral loss, that people here have great sympathy for Hatayspor,” he says. “The home of football is in England. Could we organise a match there, where the revenues could be transferred to Hatayspor? Manchester United, Liverpool, Manchester City?”\nTurkish president Recep Tayyip Erdogan, re-elected on May 28 until 2028, pledged that everyone will have a new home within one year. But like the football team’s temporary home in Mersin, tents and containers won’t be tolerated as sufficient for much longer, especially during a long, hot summer.\nAt least 14million people — 16 per cent of Turkey’s population — in 11 provinces spanning 140,000 square miles over the highly seismically active Anatolian Plate were affected by the earthquakes. Further cities in nearby Syria were impacted, too; Aleppo is just 60 miles from Antakya.\nThe government says at least half a million homes either collapsed, were severely damaged or required demolition, and more than 200,000 of those homes were in Hatay. The United Nations (UN) says 200,000 people are now living in tents, with 37,000 in containers. The financial cost of the earthquake is estimated to be £78billion ($94billion).\nEstimates suggest Hatay might take between two and five years to be rebuilt. The US has already donated £60million and the UK £13m to the country’s overall aid effort, but the UN has set an £800million target of which only 30 per cent has been raised so far. And that was just to manage the ongoing emergency — not to rebuild the city.\n“Hatay should not be forgotten,” says Yilmaz. “People’s needs do not end.”\n(Design: Sam Richardson)",
  "word_count": 2613,
  "scraped_at": "2026-02-14T12:39:26.266534"
}