{
  "article_id": "4eff0ad43e98",
  "url": "https://timesofindia.indiatimes.com/city/goa/iwl-2-tuem-look-to-make-a-mark-on-debut/articleshow/108717580.cms",
  "title": "IWL 2 : Tuem look to make a mark on debut",
  "date": "20240322T211500Z",
  "domain": "timesofindia.indiatimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Trending\nThis story is from March 23, 2024\nFC Tuem will count on home advantage as they start their campaign at Duler Stadium, Mapusa on Sunday\nThe village club from north Goa, backed by club president and Goa Football Association (GFA) chief Caitano Fernandes, had set the bar high. Win the state league and then move to the next level.\nThe national stage is now available to them.\nTuem will count on home advantage to fuel their national dreams as they take part in the second tier of the Indian Women’s League (IWL), introduced for the first time, with group C matches kicking off at the Duler Stadium in Mapusa on Friday.\n“With the guidance of our president Caitano, we wanted to win the state league and make it to the IWL,” Tuem general secretary Stany Lobo told TOI on Thursday. “Our main aim is to promote and encourage Goan talent. This is the best platform they can have.”\nA total of 15 teams spread across three groups are taking part in the initial stage of IWL 2 with the top two teams in each group making it to the next stage that will have six teams.\nTuem are clubbed with SAG Football Academy (Gujarat), Khad FC (Himachal Pradesh), City Bahadurgarh FC (Haryana) and Celtic Queens FC (Puducherry). They will start their campaign on Sunday when they take on City Bahadurgarh at 9am.\nBesides those who won them the Goa league crown, the state champions have strengthened themselves with a few additions. There’s Sibani (Kickstart FC) and Laxmi (Kerala Blasters FC), while the experience of Mumbai-based Kimberly Fernandes, who has Goan roots, and veteran defender Laura Estibeiro, will prove useful.\nSignificantly, Kulsum Shaikh, who captained the side in the state league, has now taken over as the head coach.\n“We got very little time to prepare due to exams as all players couldn’t make it for training regularly. It has been difficult, but we are still combining as a unit,” said Kulsum after a training session at the Santa Cruz artificial turf ground.\nHaving played and known her teammates well, the transition has been smooth for the player-turned-coach. But she knows taking on the might of outstation teams in the IWL will be a different ball game.\n“It will be difficult compared to the state league,” said Kulsum. “All teams come to win, and it will be challenging to get into the top two. As a player, I was thinking about myself first on how I prepare and perform. But now as a coach, the perspective has changed. I must get everyone prepared and bring the best out of them.”\nGoa does not have any representation in this season’s top-tier IWL. Even when Goan teams have made it to the top, like Churchill Brothers previously, they have struggled to keep pace with the best women footballers in the country.\nTuem, starting from IWL 2, can work their way up, though, like in the past, it won’t be an easy ride.\nFIXTURES\nMar 24: CBFC vs FC Tuem, 9am; CQFC vs Khad FC, 3.30pm\nMar 26: FC Tuem vs CQFC, 9am; SAG vs CBFC, 3.30pm\nMar 28: SAG vs CQFC, 9am; Khad FC vs FC Tuem, 3.30pm\nMar 30: CBFC vs Khad FC, 9am; FC Tuem vs SAG, 3.30pm\n* All games at Duler Stadium, Mapusa\nEnd of Article\nFOLLOW US ON SOCIAL MEDIA",
  "word_count": 563,
  "scraped_at": "2026-02-14T12:47:02.385529"
}