{
  "article_id": "4f02817e8a7e",
  "url": "https://www.ulladullatimes.com.au/story/8255384/foord-headed-to-fourth-world-cup-as-matildas-squad-finalised/?cs=300",
  "title": "Caitlin Foord headed to fourth World Cup as Matildas squad finalised | Milton Ulladulla Times",
  "date": "20230703T063000Z",
  "domain": "ulladullatimes.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Shellharbour's Caitlin Foord has joined illustrious company with her selection for the Matildas squad for the upcoming FIFA Women's World Cup.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe Warilla junior was selected for the squad after stellar performances for both her country at the recent Cup of Nations as well as with her club Arsenal in the English Super League.\nSelection for the 28-year-old means a fourth World Cup. In the history of both the female and male game, that is a feat that has not been achieved by many.\nIn the men's game, Socceroos legends Tim Cahill and Mark Milligan have appeared in four Cups, whilst globally, Foord would join the likes of Miroslav Klose, Paolo Maldini and Diego Maradona to have played in four editions.\nMatildas coach Tony Gustavsson made the tough call to leave out six players - Jada Whyman, Chloe Logarzo, Amy Sayer, Larissa Crummer, Emily Gielnik and Remy Seimsen - on Monday as he announced the squad set to take on Ireland, Nigeria and Canada in the group stages and potentially beyond.\nSam Kerr was named as captain to lead the side with Steph Catley appointed vice-captain in her third tournament.\n\"Today is the end of a two-and-a-half-year process and the wonderful start of a thrilling new journey for the team,\" Gustavsson said.\n\"Selecting this World Cup squad has been the toughest challenge so far, but the whole coaching and support staff are all completely overjoyed for the 23 players who will represent the nation during this tournament.\n\"These 23 players not only exemplify what it means to be a part of the tradition of the Matildas, but also what it means to represent the 25 million Australians we know are fully behind us. They have the heart, desire and the passion for the crest, and I can't wait to see the next part of their story.\n\"I am delighted to see the progression of the team as it is a result of their dedication to be prepared for this moment. To see so many debutants for the tournament speaks to the hard work of the players themselves, but also the coaching staff and support staff as we looked to build depth in the squad.\n\"This is a special group of players who, when you see the anticipation around the tournament and level of interest for women's football, have already sparked a transformation. We can't wait to get the tournament underway in front of a record crowd of support,\" he added.\nThe Matildas kick-off the Cup in Sydney against Ireland, before facing Nigeria and then Canada to round off the group stages. The side will have their \"send-off\" match in Melbourne against France prior, on July 14.\nOur news app has had a makeover, making it faster and giving you access to even more great content. Download The Illawarra Mercury news app in the Apple Store and Google Play.",
  "word_count": 488,
  "scraped_at": "2026-02-14T13:01:21.381611"
}