{
  "article_id": "4f031affd46c",
  "url": "https://www.hogshaven.com/2024/9/10/24235633/daily-slop-10-sep-24-jayden-daniels-kliff-kingsbury-mclaurin-michael-davis-dan-quinn-a-new-kicker",
  "title": "WFT News : Washington Commanders News Links",
  "date": "20240910T151500Z",
  "domain": "hogshaven.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Daily Slop - 10 Sep 24: Jayden Daniels, Kliff Kingsbury, Terry McLaurin, Michael Davis, Dan Quinn & a new kicker\nA collection of articles, podcasts & tweets from around the web to keep you in touch with the Commanders, the NFC East and the NFL in general\nArticles\nWashington Post (paywall)\nCommanders kicker roulette’s next contestant: Austin Seibert\nAfter Cade York missed two field goals in the season opener, Washington released him and signed journeyman Austin Seibert.\nGeneral Manager Adam Peters certainly hopes Austin Seibert, the team’s fifth kicker in the past four months, can rescue the Washington Commanders from this nightmarish carousel.\nThe Commanders signed the 27-year-old journeyman Monday, according to a person with knowledge of the situation, shortly after releasing Cade York, who missed two field goals and booted a kickoff out of bounds the day before in Sunday’s season-opening 37-20 loss to the Tampa Bay Buccaneers.\nYork was cut quickly because Washington acquired him from the Cleveland Browns for a conditional seventh-round draft pick. The condition was that York had to be on the roster for two games; by moving on now, the Commanders don’t have to forfeit any draft capital.\nThe Commanders signed Brandon McManus in March but cut him in May after a lawsuit was filed against him by two women alleging sexual assault on a team plane while he played for Jacksonville last season.\nThe suit was dismissed because it failed to meet “exceptional case” criteria enabling the women to file the case anonymously.\nWashington also had signed Ramiz Ahmed in June and Riley Patterson in August. Ahmed was cut in camp and Patterson was released after the team acquired York.\n“It’s certainly not ideal, but it does speak to, if it’s not right you don’t sit pat,” Washington coach Dan Quinn said. “We will get there. I’m disappointed ... but we owe it to everybody to keep digging.”\nBullock’s Film Room (subscription)\nHow did Jayden Daniels handle the Bucs pressure packages?\nBreaking down how the Commanders’ rookie QB dealt with the heavy blitzing from the Bucs defense\nDaniels completed 17 of his 24 passes for 184 yards with no touchdowns or interceptions and was sacked just twice. He also ran the ball 16 times for an additional 88 yards and two touchdowns. Nine of those runs were designed runs, the seven others were scrambles to avoid pressure. Overall, it’s not a stat line that will blow people away but it also suggests he didn’t fold under the pressure either. He completed nearly 71% of his passes, didn’t throw any interceptions and was only sacked twice, neither of which were really his fault.\nSo with this in mind, I thought I’d break down how Daniels handled the various forms of pressure that Todd Bowles and the Bucs threw at him throughout the game. Let’s take a closer look.\nOne of the first scrambles from Daniels came on the Commanders’ second drive. On second and eight, The Commanders run a basic concept known in many west coast offenses as “Omaha”. It’s a simple quick game concept run from a two-by-two formation, with the outside receivers running speed outs to the flats and the inside receivers running stick routes. Typically this is taught as a pick a side concept, where the quarterback can pick which side he wants to work. From there, the quarterback is usually taught to read from outside in, but that’s just the way I’ve learned the play, I don’t know what Commanders offensive coordinator Kliff Kingsbury teaches in terms of progressions on this play.\nAt the snap, Daniels works to his left and appears to work to tight end Zach Ertz on the stick route as his primary option. Again, this could be how Kingsbury teaches the concept, but how I’ve learnt it would mean this is a missed read from Daniels and he should have been working to Terry McLaurin on his speed out first, which was open. Regardless, Ertz is covered and Daniels attempts to work back across to the right side of the formation, but is quickly met with pressure. The Bucs rush five, giving them lots of one-on-one matchups across the board. Right tackle Andrew Wylie struggles to contain the edge rusher on his side and gets beat inside. Daniels responds well to the pressure, rolling out to his right to avoid the rusher and extend the play. He knows his receivers aren’t really options at this point, so he takes off running down the middle of the field before getting down to protect himself.\nSo Daniels perhaps had a throw open to McLaurin, but either he didn’t like the look from the corner playing off with the potential to try and jump the route if the throw was off target, or he never worked outside to McLaurin. But the ability to adjust and avoid that pressure as it suddenly arrives, turning a potential sack into a positive gain is a huge plus for Daniels. Obviously you don’t want to rely too much on the ability to scramble, and there were perhaps one or two plays in this game where Daniels did, but it’s better to have that ability to avoid that pressure when needed than not have it at all.\nWashington Post (paywall)\nCommanders players are confident in their QB. He needs their help.\nJayden Daniels had a solid debut Sunday, but the rebuilt Commanders roster did him no favors in a loss against the Tampa Bay Buccaneers.\nThe Washington Commanders’ season-opening loss Sunday prompted a big-picture question: Do they have enough help around Jayden Daniels to develop him into a franchise quarterback?\nIf the Commanders’ defense can’t keep games close, Daniels will have to drop back more, and opposing defenses won’t have to respect the run or play-action, which hurts the offense. If the kicker can’t turn productive drives into points, ditto.\nAnd there are concerns on offense, too. The mistake-prone unit couldn’t find a rhythm outside of Daniels’s scrambles — and even though he protected himself well while running, Washington probably doesn’t want him to rush 16 times per game; that adds up to a whole lot of hits.\nThe Commanders didn’t mind him extending plays with his legs, Coach Dan Quinn said, but “we certainly don’t want the ones that are inside and where his helmet gets knocked around.”\nEverybody thought the Washington Commanders would improve defensively in 2024. Dan Quinn and Joe Whitt Jr. come with a strong background of helping their defenses flourish. But looking at how woeful they performed in Week 1 at the Tampa Bay Buccaneers, it might take a little extra time for their methods to bear fruit.\nThe Commanders were an embarrassing mess on the defensive side of things at Raymond James Stadium. They had no answer for quarterback Baker Mayfield, who evaded pressure superbly and achieved an almost perfect passer rating as a result of his exceptional efforts. Mike Evans and Chris Godwin torched Washington’s suspect secondary almost at will. As for trying to get a stop on third down? Forget about it.\nThis was a damning indictment of where this group is and the progress needed. Nobody covered themselves in glory consistently enough. One player who’d gotten some decent involvement with the first string throughout the summer was completely ignored.\nConsidering that every other cornerback played 44 percent of snaps and St-Juste didn’t take off one play, for Davis to get no reps whatsoever seems a little off. That’s without considering they gave up 289 passing yards and four touchdowns to Mayfield, which was too much for No. 2 overall selection Jayden Daniels to overcome.\nDavis didn’t enjoy the best of fortunes with the Los Angeles Chargers last season, but his experience and bounce-back potential under Quinn and Whitt brought some intrigue to his arrival. Something’s happened to see the player fall out of favor. Just what that might be is anyone’s guess.\nDespite being active for the Commanders and the struggles of other cornerbacks, Michael Davis was an innocent bystander throughout the contest. The veteran free-agent signing was seen by many as the starting outside option opposite Benjamin St-Juste. Those in power moved forward with second-year-pro Emmanuel Forbes Jr. as the starter when push came to shove.\nThe Athletic (paywall)Dan Quinn’s Commanders debut full of familiar, frustrating feelings\n- The Washington defense allowed 392 total yards and points on seven of the Bucs’ eight full possessions.\n- Tampa converted 9 of 13 third down attempts to the Commanders’ 2-of-8\n- Bucs kicker Chase McLaughlin made all three field goal tries, including a 56-yarder for the game’s first points, while Cade York, in his first regular-season game with Washington, missed his two attempts and cost the team field position with a kickoff that went out of bounds.\nThose bullet points are only a sprinkling of Washington’s miscues in the debuts for new head coach Dan Quinn and quarterback Jayden Daniels. The game was one of many firsts for the rookie passer, who flashed his running prowess and competitiveness between missed opportunities he’ll regret when watching the game film, like the overthrown deep shot to Terry McLaurin opening the second half.\nFor the well-traveled Quinn, he grasps what this loss means.\nOne area where Quinn couldn’t hold even a hint of stoicism about involved, arguably, the team’s biggest concern entering the season: The secondary.\nBaker Mayfield efficiently handled Washington’s defense, completing 24-of-30 passes for 289 yards and four touchdowns. There were broken plays in the secondary throughout the game.\nWhen asked about the secondary, Quinn groaned. “Man, there is a lot to work through there.”\nKingsbury’s game plan for Daniels was simple. He would focus on Daniels getting rid of the ball quickly to avoid taking big hits and allow Washington’s skill players to make plays after the catch.\nHere’s the problem: Daniels ran the ball 16 times. Yes, Daniels is a dynamic quarterback, but he should never carry the ball 16 times. Sure, several of those carries were scrambles from Daniels when receivers weren’t open down the field. Yet, late in the game, with Washington down 37-14 with 1:38 to go, Kingsbury calls for Daniels, who isn’t built like Jalen Hurts or Josh Allen, to carry the ball into the end zone.\nHe did, but his helmet popped off in the meantime, and officials ruled that he hadn’t broken the plane of the goal line. On the next play, Kingsbury calls for running back Brian Robinson Jr. to carry the ball, which he does for no gain. On third-and-goal, Kingsbury again has Daniels sneak the ball into the end zone. He scored. Suddenly, it’s 37-20—and the game is still over.\nWhy is Kingsbury running Daniels late when the outcome has already been decided? It’s a questionable decision, especially when two plays earlier, Daniels’ helmet popped off for the second time in the game.\nWhat this looked like was a frustrated offensive coordinator. Nothing was going right for him in his first game with a new team, and he was desperate to score, so he called his dynamic quarterback’s number to get a meaningless score late in the game.\nCommanders.comQuinn: ‘a lot to work on’ after frustrating loss to Bucs\n[A]fter Sunday’s 37-20 loss to the Tampa Bay Buccaneers, it’s clear there’s still a long way to go.\n“You do have to take the lessons from tonight,” Quinn said during his postgame press conference. “Otherwise, the pain is not worth it.”\nThere were some positive signs in training camp that Washington was at least on the right path long-term, but Sunday’s game was the first real chance to show it was headed in a new direction. And while Tampa Bay looked the part of a playoff contender, the Commander played like a group that was...well, in the first year of a rebuild.\nWashington never found a way to consistently execute against a Buccaneers defense that lost multiple key players throughout the afternoon. Some of that came from an inability to finish drives with points, thanks to Cade York’s missed field goal attempts, but it also had to do with simply not getting enough from its skill players earlier in the game. As Washington headed into the locker room for halftime, only one receiver had registered a catch.\nAs McLaurin put it in the locker room, “We just didn’t quite execute the way that we wanted to.\nSports Illustrated\nTodd Bowles Shares How Bucs Slowed Down Terry McLaurin\nWashington Commanders wide receiver Terry McLaurin didn’t put together a big game during Week 1.\nEssentially, the Buccaneers were fine with Daniels getting out of the pocket and into space rather than him getting the ball to McLaurin. To truthfully break down the gameplan, the Commanders needed both Daniels to carve the Buccaneers on the ground and other receivers to step up and take some focus off McLaurin.\nThe Buccaneers were able to continue limiting the impact of McLaurin in the second half while also neutralizing Daniels’ legs, which Bowles explained happened with a change up front.\n“We changed up some things. And maybe five-man pressure to take up some of the gaps with (Calijah) Kancey and Logan (Hall) down, we weren’t as fast in there – as quick in there – so to speak,” Bowles explained. “So, some of the balls got out and we understood that. Again, better him running than McLaurin catching the football. So we tried to clean that up in the second half some.”\nPodcasts & videos\nRecap: Tampa Bay Buccaneers Week 1 | The Booth Review | Washington Commanders | NFL\n3 Reasons Why Jayden Daniels and The Washington Commanders Are Better Than You Think\nNFC East links\nPro Football TalkGiants sign returner Ihmir Smith-Marsette\nThe Giants signed free agent returner Ihmir Smith-Marsette on Monday, the team announced.\nHe fills a need with returners Gunner Olszewski (groin) and Darius Slayton (concussion) injured. Olszewski has dealt with his injury since the second preseason game, and Slayton, who muffed a punt, was injured during the game.\nSmith-Marsette, 25,entered the NFL as a fifth-round pick of the Vikings in 2021. He has played for the Vikings, Bears, Chiefs and Panthers.\nNFL league links\nArticles\nWashington Post (paywall)\nDeshaun Watson is accused of sexual assault in new lawsuit\nThe civil suit, filed Monday in Texas, says Watson “roughly sexually assaulted” a woman in 2020.\nA woman in Texas filed a new lawsuit Monday accusing Cleveland Browns quarterback Deshaun Watson of sexual assault and battery in 2020.\nThe allegations in the civil suit, filed in Harris County (Tex.) District Court, are related to an incident that the accuser said occurred after she invited Watson, then with the Houston Texans, to her apartment for dinner. The lawsuit alleges Watson “roughly sexually assaulted” the woman there.\nIt was not clear Monday whether Watson could face further disciplinary action by the NFL if the allegations in the latest lawsuit are substantiated, nor whether any accusations of misconduct occurring before the 2022 disciplinary settlement would be covered by that settlement. It was also not clear whether any allegations of further misconduct by Watson could, if substantiated, put him in violation of his fully guaranteed five-year, $230 million contract with the Browns. Watson is in the third season of that deal.\nFront Office SportsNFL’s Historic Week 1 Viewership Signals Another Dominant Season\nThe run of big audiences began Thursday with the season opener featuring the Chiefs, the two-time defending champions, and the Ravens, drawing the NFL’s biggest kickoff game audience, now at an updated average of 29.2 million. NBCUniversal’s Peacock followed on Friday with an average of 14.2 million for an exclusive stream of the NFL’s first game in Brazil, involving the Eagles and Packers. That figure was the second-biggest live audience ever on Peacock, trailing only the record-setting figure in January for an NFL wild-card game.\nThen on Sunday:\n- An average of 23.8 million on Fox Sports for the Cowboys-Browns game that marked the high-profile debut of new Fox Sports lead NFL analyst Tom Brady. Despite the blowout win for Dallas that was largely devoid of on-field drama, the game was up 46% from the comparable game to open last season, and was the network’s most-watched Week 1 game since 2020.\n- An average of 22.7 million on NBC Sports for the Lions’ overtime win (above) over the Rams in the season debut of Sunday Night Football. That figure was 3% higher than the comparable Cowboys-Giants Sunday prime-time opener to begin the 2023 season. The Thursday and Sunday nights combined to give NBC Sports its best two-game NFL opening weekend since 2015.",
  "word_count": 2760,
  "scraped_at": "2026-02-14T12:48:29.576240"
}