{
  "article_id": "4f0cb4d96f54",
  "url": "https://www.thenationalnews.com/arts-culture/music-stage/2025/05/28/guns-n-roses-abu-dhabi-human-being-david-johansen-new-york-dolls/",
  "title": "Review : Guns N  Roses play Human Being live for first time in tribute to Axl Rose late idol",
  "date": "20250528T084500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "There are only two acts I can remember who came on stage precisely at the advertised 8pm start time – Selena Gomez and Guns N’ Roses. That the latter was once one of the most notoriously tardy bands in the history of rock n’ roll is not lost on me.\nBut that’s a testament to what Guns N’ Roses have become in 2025. Their misbehaviour may be the stuff of legend, and feuds may have kept the core members – Axl Rose, Slash, Duff McKagan – apart for more than two decades, but it’s been about 10 years since they made amends. This is not a victory lap or a quick cash grab – this is a band built to last for decades to come.\nAnd it makes sense that they would follow in the footsteps of the Rolling Stones, Rod Stewart, AC/DC, Elton John and Paul McCartney and potentially play into their eighties. This has always been a band built on those influences – which made them an anachronism even when they debuted in 1985. At that time, their power as a unit was so mighty that they nearly single-handedly pushed mainstream hard rock back to the 70s – the decade when classic rock came to its own – for better and for worse. And now, with each core member either in or approaching their sixties, they’re one of the few bands keeping classic rock alive in 2025.\nNot all the band’s 70s heroes are still prowling the stage, of course. In February, the music world lost David Johansen, the front man of the proto-punk pioneers New York Dolls. Johansen’s famed on-stage swagger was one of the key influences on Rose, which he has been vocal about since GNR’s early days. Most famously, the band paid tribute to the Dolls on their 1993 album The Spaghetti Incident?, covering their 1974 deep cut, Human Being.\nBut for decades, the band never played their New York Dolls cover live. That made it particularly moving when Guns N’ Roses played Human Being live on stage in Abu Dhabi for the first time in their history. Rose noted the debut with a smile, along with a tribute to his late hero.\nIt’s rare the band has looked this happy and healthy. Rose no longer sports the long hair and bandana, and looks noticeably better than he did when the band reformed in 2016, which allows him and his cohorts to breeze through a more than three-hour show at Etihad Arena – hitting all the right notes. Slash, on the other hand, remains ageless – his style has never changed, nor has his immaculate and virtuoso playing style. And most importantly, their camaraderie is palpable, with no signs of discord between them.\nThe band, accompanied by their capable new drummer Isaac Carpenter, who joined the band in March, toured through all their beloved hits, starting with Welcome to the Jungle and ending with Paradise City, as they often do. Sweet Child o’ Mine, and their covers of Bob Dylan’s Knockin’ on Heaven’s Door and Wings’ Live and Let Die were joyously performed. They even reached for some deep cuts, performing Attitude and Reckless Life for the first time on their current tour, and Used To Love Her for the first time since 2018.\nWhile the energy of the crowd may not have matched their 2017 show at Dubai’s Autism Rocks Arena, which had 30,000 thrilled fans comes to see the reunited line-up for the first time – that is to be expected. This is the band’s fifth time in the UAE, after all – and second time in Etihad Arena so far this decade. But their return is welcome, nonetheless, and marks perhaps their best performance yet.\nIf this is the Guns N’ Roses we’re going to get for the next few decades, the UAE will welcome them back gladly each time.",
  "word_count": 648,
  "scraped_at": "2026-02-14T12:11:26.343257"
}