{
  "article_id": "4f2d79f9feb6",
  "url": "https://www.brooklynpaper.com/stories-defined-brooklyn-in-2025/",
  "title": "Pressure , pushback and pride : The stories that defined Brooklyn in 2025 • Brooklyn Paper",
  "date": "20251230T010000Z",
  "domain": "brooklynpaper.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "As 2025 takes its place in the history books, we’re pausing before the countdown to 2026 to take stock of another busy, sometimes chaotic year in Brooklyn.\nThe year was marked by pressure, pushback and community. SUNY Downstate, which faced closure in 2024, took steps toward the future this year after protest from doctors, patients and local elected officials saved it from the brink. Parents and educators fought back against the city’s sudden announcement that it would close four early childhood education centers. When the feds quietly began using the Metropolitan Detention Center to house ICE detainees, local residents and politicians rallied in the streets and outside the prison, demanding transparency and humanity.\nBrooklyn also grieved and celebrated in equal measure. The borough said goodbye to pizza legend Patsy Grimaldi, whose coal-fired pies helped define modern New York pizza, even as Brighton Beach took an unexpected victory lap at the Oscars, where “Anora” swept the night and sent film buffs flocking to Coney Island and Mill Basin. From Barclays Center rafters newly adorned with a Liberty championship banner to a rescued sea turtle named Elton splashing back into the Atlantic off Coney Island, moments of joy cut through the noise.\nBrooklyn Paper chronicled it all, the wins and the worries, the losses and the celebrations. Here are some of the stories that defined our borough in 2025.\nJanuary\nThe state invested $750M in the beleaguered SUNY Downstate: Just before the first meeting of the SUNY Downstate Community Advisory Board — a new committee assembled to help chart the future of the struggling facility — Gov. Kathy Hochul said the state would allocate $550 million to the hospital in the FY2026 budget to fund capital projects and operations. The funding was the first step toward Downstate’s long-term future after the hospital was threatened with closure in 2024.\nBrooklyn childcare centers fought back against sudden forced closures: Four early childhood education centers sprung into action in January after the Adams administration suddenly decided not to renew their leases in city-owned buildings. The centers said City Hall was relying on incorrect enrollment data and had fallen months behind on payments, and that closing the centers would leave hundreds of Brooklyn families without childcare or education. After weeks of protest, most parents and educators breathed a sigh of relief as they were granted extensions at least until 2026.\nMacy’s closed its flagship Brooklyn locations as part of a nationwide cutback: The department store giant shuttered its flagship store on Fulton Street in Downtown Brooklyn and the Macy’s Backstage location in Sheepshead Bay as part of a cost-cutting initiative that closed 66 stores across the nation. The stores had been identified as “unproductive,” and marked a big change on Fulton Street, where the store had been a cornerstone of a fast-changing retail landscape.\nFebruary\nTrailblazing pizzaiolo Patsy Grimaldi died at age 93: Patsy Grimaldi, founder of the beloved Brooklyn pizzerias Grimaldi’s and Juliana’s, in February at the age of 93, after decades at the forefront of New York City’s pizza scene. Grimaldi opened his iconic pizzeria, featuring a rare brick oven, on Old Fulton Street in 1990. His coal-fired pizzas, with crispy crusts and homemade cheese, inspired dozens of new pizzaiolos in New York City; and his restaurant Juliana’s honored his loss by keeping his regular table at the restaurant open, as though awaiting his return.\nOur Lady of Perpetual Help announced its closure: Due to waning enrollment and financial struggles, the Board of Trustees at Our Lady of Perpetual Help Catholic Academy in Sunset Park announced that the school would close permanently in June 2025. Only 85 students had enrolled at the school for the 2025-26 school year, officials said, and with numbers that low, the school would be spending more than twice the price of tuition on each student. OLPH was just the most recent Catholic academy in Brooklyn to close as families increasingly turn away from religious schools.\nA Bay Ridge fire killed a 37-year-old Navy veteran: An apartment blaze that broke out in the early hours of Feb. 9 killed 37-year-old Navy veteran and father Gregory Fernandez as cars parked in front of nearby fire hydrants hindered firefighting efforts. Then-FDNY commissioner Robert S. Tucker at the time urged New Yorkers to park elsewhere, and said the vehicles parked in front of hydrants on Fernandez’ street were “part of the reason we have the outcome that we have here.”\nUnlicensed Bay Ridge smoke shop Big Chief was hit with a $6 million penalty: The state ordered the owner of unlicensed Bay Ridge dispensary Big Chief to pay $6 million in penalties for operating illegally and ignoring repeated warnings from authorities. The shop had been forced to close in 2023, after a court order was issued against the business for selling cannabis and related products without a license. In February, Attorney General Letitia James secured a judgement against the shop, which found it had “brazenly violated the law and disrupted the local community.”\nMarch\nBrooklyn took the spotlight as Brighton Beach-based film ‘Anora’ swept the Oscars: Brooklyn took center stage at the 2025 Academy Awards as “Anora,” which was based and filmed in southern Brooklyn, won five Oscars — including Best Picture. The dramedy tells the story of a young Brighton Beach-based sex worker, Ani, who meets and falls in love with the son of a Russian oligarch while romping through Coney Island and luxuriating in a Mill Basin mansion. “Anora” spotlighted real people and places from southern Brooklyn, from Williams’ Candy store to the Parkside Diner, and brought plenty of new visitors eager to explore some of the nabe’s far-flung corners.\nLayoffs were avoided at the Brooklyn Museum after union negotiations’: After weeks of back-and-forth, planned layoffs of unionized employees at the Brooklyn Museum were avoided under a deal struck between labor unions and museum leadership. The museum, facing a $10 million budget shortfall, had announced layoffs in February — but union leaders said those layoffs were a contract violation. After heated negotiations, the museum instead offered voluntary retirement and separation packages to eligible workers — but still laid several non-union employees. The City Council later agreed to provide millions of dollars in funding to the struggling museum to prevent additional layoffs.\nThe city announced Dumbo would become Brooklyn’s first ‘Regional Slow Zone’: Officials announced that a .18-square-mile slice of Dumbo would become Brooklyn’s first “Regional Slow Zone” and that the speed limit would be dropped to 20 mph. The slowdown — a result of the passage of Sammy’s Law — was meant to increase traffic safety and decrease the severity of crashes, especially for pedestrians. In the last five years, the small Dumbo slow zone has seen 10 severe crash-related injuries and one death, according to the Department of Transportation. Some pols and advocates celebrated the move, and said they hoped more of northern Brooklyn would eventually be made a “Slow Zone.”\nA Brooklyn marching band director made a splash with the ‘Severance’ finale: On March 20, the much-acclaimed final episode of “Severance” dropped on AppleTV+, complete with a marching band performance directed by Crown Heights native Ty Brown, the founder of Brooklyn United Music and Arts Program. Brown hired more than 100 local musicians — including dozens of BU alumni — for the episode, and incorporated elements of HBCU marching bands into the performance. The band was one of the most talked-about parts of the season, and BU was credited on the “Severance” season 2 soundtrack.\nApril\nBrooklyn remembered Pope Francis: Brooklyn Catholics gathered at the Cathedral Basilica of St. James to honor the life and legacy of Pope Francis, who died at age 88 following a stroke and heart failure. Bishop Robert Brennan reflected on Francis’ tenure as a tender and inclusive leader, recalling moments like his 2015 Madison Square Garden mass and his solitary appearance in St. Peter’s Square at the start of the COVID-19 pandemic. Francis, the first Latin American and Jesuit pope, was praised for advocating for migrants, the poor, climate action, and LGBTQ+ inclusion, and attendees expressed hope that the Church’s future leaders would continue his progressive legacy. The memorial Mass emphasized celebrating Francis’ teachings of love, compassion, and service to others.\nReynoso and Brooklyn College launched a Perinatal Mental Health program: Brooklyn Borough President Antonio Reynoso and Brooklyn College President Michelle Anderson announced a new Advanced Certificate in Perinatal Mental Health program aimed at addressing Brooklyn’s high maternal mortality rate, particularly among Black and Brown mothers who face disproportionately higher risks. The program, the first of its kind in New York State, offers a one-year, credit-bearing curriculum with clinical hours and flexible online learning, training licensed professionals — including doulas, midwives, nurses and mental health counselors — to support pregnant and postpartum parents experiencing mental health challenges. The initiative emphasizes culturally competent care, community engagement, and addressing social determinants of health, equipping healthcare workers to integrate mental health screenings, prevention, and intervention strategies into maternal care. Students and community advocates highlighted the program’s immediate impact on improving maternal and child health outcomes in underserved communities.\nCriminal charges against cop-biting pol Susan Zhuang were dropped: Almost a year after Council Member Susan Zhuang was arrested for biting a police officer at an anti-homeless shelter protest, criminal charges against the pol were dropped. Rather than face jail time, Zhuang took part in a restorative justice program meant to encourage accountability and reduce reliance on traditional, often harmful responses to crime. Zhuang’s program included meeting with the officer she attacked, and resulted in her case being sealed.\nBargemusic came ashore in Brooklyn Bridge Park: After half a century on the water, Bargemusic’s historic 126-year-old barge had become unsafe, and repairs would be very expensive and not guaranteed to last. So, Bargemusic pivoted — waving goodbye as the boat was hauled to a scrapyard — and started a new life at the Brooklyn Bridge Park Boathouse. Life on land has so far proved happy for the org, whose many fans returned in droves, but Bargemusic’s director Mark Peskanov hopes the org may someday return to the water.\nBees in the big city: Park Slope residents install buzzing rooftop hive: In April, Brooklyn Paper suited up to spend the day with Park Slope residents Danny Peña and Maura, who installed a rooftop beehive hosting 12,000 honey bees, joining a growing urban beekeeping movement in New York City. Since the legalization of city beekeeping in 2010, registered hives had surged, supporting biodiversity and pollination in urban environments. Peña and Maura carefully introduced the queen and worker bees to their hive, ensuring safe feeding and acclimation, while highlighting the critical role bees played in food production and ecosystem health. Amid nationwide bee population declines, their efforts underscored the importance of protecting pollinators in the city and maintaining a thriving local ecosystem.\nMay\nThe Brooklyn Mirage canceled its much-anticipated reopening: On May 1, hours before DJ Sara Landry was set to take the stage at the Brooklyn Mirage, the venue canceled its much-hyped reopening, saying it had failed to meet a final city inspection. Organizers said the venue was practically ready to open and indicated that they expected to hold all scheduled performances over the summer — but the failed opening was the beginning of the end for the Mirage. After months of broken promises and missed deadlines, the Mirage’s parent company declared bankruptcy and later filed demolition permits to knock the venue down.\nThe Liberty raised their first WNBA Championship banner: The New York Liberty kicked off their 2025 season at Barclays Center by unveiling their 2024 WNBA Championship banner and rings, marking the franchise’s first title in 28 years. Fans packed the arena in seafoam green, celebrating with homemade signs, replica rings, and chants as the team honored its historic achievement. The championship ring, designed by Jason of Beverly Hills with Brooklyn artists, featured a leaf motif symbolizing growth and resilience, and included hidden earrings for players. Liberty forward Breanna Stewart led the team with 25 points as they defeated the Las Vegas Aces 92-78 in the opener, while head coach Sandy Brondello praised the team’s evolution and expressed hopes for continued success in the coming seasons. The Liberty later hired NBA veteran Chris DeMarco as their new head coach, following the departure of Brondello.\nBrooklyn arts orgs scrambled for funding after federal funding was slashed: As President Donald Trump took aim at Diversity, Equity and Inclusion programs, dozens of local arts organizations had their federal grants revoked. The grants had been game-changers for small theater and arts groups who had worked hard to earn the funds, and the sudden cancellation forced them to launch last-minute fundraisers, accept loans, and start planning for a challenging future.\nA Dumbo Street was renamed ‘Jane Walentas Way’: A corner of Dumbo near Jane’s beloved carousel was officially renamed “Jane Walentas Way” on May 6, celebrating the late artist and philanthropist who transformed the Brooklyn waterfront into a thriving cultural hub. Friends, family and community leaders gathered on what would have been her 81st birthday to honor Walentas, who restored Jane’s Carousel over 27 years and championed local artists and arts programs.\nJune\nBrooklyn lead turnout in the 2025 NYC primary elections: Brooklyn played a pivotal role in New York City’s 2025 primary elections, with early voting nearly doubling from 2021 and over 358,000 borough residents casting ballots on Election Day. Zohran Mamdani secured the Democratic mayoral nomination, defeating Andrew Cuomo, while Mark Levine won Comptroller and Jumaane Williams retained his Public Advocate spot. Incumbents dominated most City Council and local races, including Antonio Reynoso’s re-election as Brooklyn Borough President. Key primary victories also went to Lincoln Restler, Crystal Hudson, Chi Ossé, Alexa Avilés, Shahana Hanif, Darlene Mealy, Mercedes Narcisse, Kayla Santosuosso, and Inna Vernikov, setting the stage for the November general elections. Only a few races, like the Republican primary in District 47, remained too close to call immediately.\nPark Slope’s Whisk & Whiskey celebrated four years: Park Slope café and cocktail bar Whisk & Whiskey marked its fourth anniversary in June, celebrating its evolution from a pandemic-era idea into a beloved neighborhood gathering place. Founded by Chandra Touch and Secoyah “Chef Coy” Brown, the woman- and minority-owned business blends Cambodian and Trinidadian flavors in its cocktails, baked goods, and small plates, with a mission to create an inclusive “living room” where everyone feels welcome. Despite challenges including floods, financial uncertainty, and the steep learning curve of small business ownership, the co-founders say they “haven’t looked back,” crediting their strong partnership and community support for the bar’s success — and fueling their hopes to eventually bring Whisk & Whiskey’s model of hospitality to neighborhoods beyond Brooklyn.\nJuly\nThe District 47 GOP primary was certified amid fraud allegations: The Republican primary for Brooklyn’s District 47 was officially certified, declaring George Sarantopoulos the winner over Richie Barsamian by just 16 votes, after a razor-thin race and an automatic recount. The Board of Elections uncovered 22 suspicious ballots and several absentee ballots cast under questionable or fraudulent circumstances, referring both incidents to the Brooklyn District Attorney for investigation. While some of these invalidated ballots may have favored Barsamian, Sarantopoulos’s victory stood — setting the stage for his face-off with Democratic nominee Kayla Santosuosso in the November general election — as law enforcement probed potential misconduct among BOE staffers.\nJoey Chestnut reclaimed his crown at the Nathan’s Hot Dog Eating Contest: Joey Chestnut made a triumphant return to the Nathan’s Famous Hot Dog Eating Contest on July 4, devouring 70.5 hot dogs and buns in 10 minutes to win his 17th title after missing last year due to a contract dispute. Cheered on by thousands in Coney Island, Chestnut fell short of breaking his own record but reaffirmed his dominance in competitive eating. Patrick Bertoletti finished second with 46.5 hot dogs, followed by Australia’s James Webb with 45.5. In the women’s contest, Miki Sudo captured her 11th championship by eating 33 hot dogs, citing unusually filling buns for missing her personal best.\nBrooklyn artists honored ‘Saturday Night Fever’: Bay Ridge artist Michael “Kaves” McLeer dedicated a new plaque to the iconic “Saturday Night Fever” bench, honoring John Travolta and Karen Lynn Gorney’s characters, Tony and Stephanie, as well as “all the Brooklyn dreamers.” The bench, located near the Verrazzano-Narrows Bridge, was the site of a pivotal scene in the 1977 film, which was largely shot in Bay Ridge and Bensonhurst. McLeer, who grew up inspired by the film, sees the bench and bridge as symbols of hope and opportunity, mirroring his own path as a graffiti artist, actor, and curator of Brooklyn Pop. With support from Council Member Justin Brannan, the plaque aims to preserve the borough’s cinematic legacy and inspire future generations of storytellers.\nLocal pols demanded a halt to immigrant detainee transfers to MDC: Brooklyn elected officials, including U.S. Rep. Dan Goldman, State Sen. Andrew Gounardes, and Assembly Member Robert Carroll, called on federal authorities to stop housing immigrant detainees at the Metropolitan Detention Center (MDC) in Sunset Park, citing “inhumane” and “barbaric” conditions. Over 100 migrants, many non-criminal and with pending asylum cases, were detained at MDC, where issues such as staff shortages, limited healthcare, prolonged lockdowns, and denial of legal access have been reported. Officials criticized the Trump administration’s mass deportation policy, highlighting cases of detainees being transferred out of state, separated from their families, and denied due process. Community advocates emphasized the urgent need for transparency and humane treatment, noting that the new interagency agreement between ICE and the Bureau of Prisons places immigrants in MDC and other federal facilities.\nBrooklynites urged Malliotakis to reject Trump’s ‘Big Beautiful Bill’: Progressive groups and unions rallied for two days outside Rep. Nicole Malliotakis’ Bay Ridge office, urging her to vote against President Trump’s “One Big Beautiful Bill Act,” which recently passed the Senate and is returning to the House. Protesters warned that the bill’s proposed $930 billion cuts to Medicaid over ten years would endanger millions of low-income and disabled Americans, threaten rural hospitals and community health centers, and reduce access to programs like Child Health Plus and SNAP. Speakers, including Comptroller Brad Lander and Council Member Justin Brannan, criticized the legislation for disproportionately benefiting the wealthy while harming constituents, especially in Malliotakis’ district. Malliotakis defended the bill, claiming it protects vulnerable populations, reduces fraud, and provides tax benefits to middle-class residents.\nThe city removed the Bedford Avenue protected bike lane: In the middle of a legal battle – and repeated back-and-forth — the Adams administration was cleared to remove three blocks of the parking-protected bike lane on Bedford Avenue between Flushing and Willoughby avenues. A temporary restraining order and preliminary injunction requested by local resident Baruch Herzfeld, his son, and Transportation Alternatives had been rejected, allowing the city to replace the protected lane with a standard painted lane. Critics warned the move could increase cyclist and pedestrian injuries, pointing to DOT data showing a 47% drop in accidents since the lane’s installation, while city officials argued safety improvements at intersections remained and the reconfiguration was a rational compromise.\nAugust\nGoldman was blocked (again) from touring the Sunset Park prison housing ICE detainees: U.S. Rep. Dan Goldman (D-Brooklyn/Manhattan) was once again denied access to the Metropolitan Detention Center (MDC) in Sunset Park, where over 100 immigrants detained by ICE were being held under a new agreement with the Bureau of Prisons. Goldman, who has statutory oversight rights as a member of Congress, previously attempted an unannounced visit with Reps. Nydia Velázquez and Adriano Espaillat, but was turned away. Despite submitting an official request for a tour, the BOP denied it without explanation, prompting Goldman to demand clarification. He emphasized the urgency of inspecting conditions at MDC, especially after a federal judge ruled detention at another ICE facility, 26 Federal Plaza, unconstitutional. Goldman criticized the Trump administration’s handling of immigrant detention, highlighting the need for transparency, due process, and civil rights protections for detainees.\nRescued Kemp’s ridley sea turtle Elton made a splashy return to the wild: Elton, an endangered Kemp’s ridley sea turtle, was released back into the Atlantic Ocean at Coney Island Beach in August after months of rehabilitation. Stranded on a Massachusetts beach in fall 2024 in a hypothermic “cold-stunned” state, Elton was cared for by the Massachusetts Audubon Society, Wellfleet Bay Wildlife Sanctuary, and the nonprofit Turtles Fly Too before being transported to the Atlantic Marine Conservation Society (AMSEAS) in Long Island. Elton is the 91st turtle AMSEAS has released, part of the organization’s efforts to rehabilitate marine wildlife and involve the public, especially youth, in conservation. Equipped with a small monitoring tag, Elton will resume his natural migratory behaviors along the Atlantic coast. Officials praised New York State’s environmental initiatives and collaborations among conservation groups that support marine life protection.\nHundreds rallied at Grand Army Plaza to call for humanitarian aid in Gaza: Hundreds of protesters gathered at Grand Army Plaza in Park Slope for the “Families Stand Up for Gaza” rally, demanding the immediate opening of humanitarian corridors, a U.S. arms embargo on Israel, and an end to American military aid. Organized by Jewish Voice for Peace-NYC, UAW Region 9A, DSA, and Brooklyn Families for Palestine, the rally took place near Senate Minority Leader Chuck Schumer’s residence and included civil disobedience that led to arrests, including of Assembly Member Marcela Mitaynes. Speakers criticized Schumer, Gillibrand, Jeffries, and Goldman for supporting military aid to Israel while Gaza faces severe humanitarian crises.\nDemolition began at the former Century 21: News broke in August that the long-vacant former Century 21 department store on 86th Street in Bay Ridge would be demolished and redeveloped into a $47.5 million, two-story retail complex called Century Marketplace by new owners MCB Real Estate and Osiris Ventures. Demolition began in December, with construction expected to start in early 2026 and the first stores opening in 2027. The development will feature smaller retail and food tenants, larger anchor stores, a central atrium entrance on 86th Street, and efforts to secure a national grocery store long sought by local residents. The project follows multiple failed proposals since the store’s 2020 closure, with developers emphasizing their commitment to seeing it through. Meanwhile, redevelopment is also moving forward on the former 87th Street property across the street, which, along with its parking lot, was acquired by the Abed family for $28 million and is slated to become a SuperFresh supermarket, marking the first concrete progress for both sites in years.\nDOB deemed Brooklyn Mirage unsafe: In August, the New York City Department of Buildings publicly revealed that the Brooklyn Mirage, a Williamsburg entertainment venue, was riddled with serious safety and structural violations even as its owners claimed it was “show-ready.” Despite announcing a major renovation earlier in the year, including a 65-foot-tall prefabricated structure and upgraded performance features, DOB inspections found the venue unsafe, noncompliant with fire, accessibility, and structural codes, and incapable of supporting its planned occupancy. The revelations contributed to canceled events, mounting financial losses, and Avant Gardner, the Mirage’s parent company, filing for bankruptcy in August, with no immediate plans to reopen until a remedial plan is approved.\nMedicaid cuts threatened safety-net hospitals: Brooklyn hospitals and residents faced a looming crisis as federal Medicaid cuts from President Trump’s “Big Beautiful Bill” threatened to leave millions uninsured and force safety-net hospitals like Wyckoff Heights Medical Center to lay off staff or close entirely. Officials warned that reductions in Medicaid funding would jeopardize critical services — including preventive care, maternity care, mental health and long-term care — particularly for low-income, immigrant, and underinsured communities. Lawmakers, hospital leaders and residents described the potential fallout: thousands of jobs lost, overwhelmed emergency rooms, and patients forced to forego essential care. Local advocates urged Brooklynites to mobilize against the cuts.\nBrooklyn Stages owners were charged in bribery scheme to block McGuinness Boulevard redesign: Tony and Gina Argento, owners of Broadway Stages in Greenpoint, were charged with bribery and conspiracy for allegedly working with former Mayor Eric Adams’ aide Ingrid Lewis-Martin to obstruct a city plan to redesign McGuinness Boulevard, which would have removed vehicle lanes to add bike lanes. Court documents alleged that the Argentos provided cash, gifts and opportunities for TV appearances to Lewis-Martin in exchange for influencing the project and local community boards in their favor. The scheme delayed and altered the redesign, preserving vehicle lanes near Broadway Stages, though the city eventually implemented the full plan in other sections. The Argentos’ lawyers deny wrongdoing, framing their actions as civic advocacy and charitable gestures, while prosecutors maintain the officials prioritized personal gain over public interest.\nSeptember\nBrooklyn Marine Terminal task force approved a $3.5B waterfront redevelopment plan: The Brooklyn Marine Terminal (BMT) task force voted 20-8 on September 22 to approve a $3.5 billion redevelopment plan for 122 acres of Brooklyn’s industrial waterfront. Chaired by U.S. Rep. Dan Goldman and co-chaired by state Sen. Andrew Gounardes and Council Member Alexa Avilés, the plan — led by NYCEDC — includes a 60-acre all-electric port, 6,000 homes, 28 acres of open space, industrial space, resiliency measures, and cultural and workforce areas. The project is projected to generate $18 billion in economic impact, creating 37,000 construction jobs and 2,000 permanent positions. While supporters, including Mayor Eric Adams and Gov. Kathy Hochul, hailed the vote as historic, protesters criticized the process as opaque, rushed, and lacking genuine community input. Revisions added affordable housing, school and park funding, electric shuttle services, and traffic improvements, but dissenting task force members and community leaders argued that critical concerns about infrastructure, transportation, flood risk and maritime preservation remain unaddressed.\nBrooklynites rallied against ICE deportations: Hundreds of New Yorkers joined the “Stand Against ICE” march and rally on Sept. 27 in Sunset Park and across the city, protesting what organizers called the Trump administration’s violent and unlawful immigration detentions. Led locally by Council Member Alexa Avilés, participants marched, held rallies, and distributed information on immigrant rights, emphasizing solidarity with those living in fear of ICE raids. Advocates, including Assembly Member Marcela Mitaynes, called for the passage of the New York for All Act to prevent local authorities from cooperating with federal immigration enforcement. Speakers highlighted the emotional toll on immigrant communities, including children in schools, and urged residents and elected officials to resist intimidation and support protections for all New Yorkers.\nBernie Sanders joined Mamdani at Brooklyn College town hall: Democratic mayoral candidate Zohran Mamdani teamed up with Senator Bernie Sanders at Brooklyn College for a town hall as part of Sanders’ nationwide Fighting Oligarchy tour, rallying about 1,700 supporters. Mamdani criticized corporate influence, denounced Trump’s interference in the mayoral race, and condemned the firing of adjunct professors allegedly linked to pro-Palestinian activism. Sanders praised Mamdani’s grassroots campaign, highlighting its rise from 2% in early polls to the Democratic nomination with 50,000 volunteers, and called out top Democratic leaders for not yet endorsing him. Both stressed the importance of collective action, defending immigrant communities, and preparing for potential threats such as National Guard deployment, while attendees applauded proposals like a rent freeze and praised Mamdani’s focus on empowering working-class New Yorkers.\nBrooklyn designers shined at NYFW with ‘The People’s Runway’: Brooklyn Borough Hall Plaza hosted “The People’s Runway” on Sept. 14, giving five emerging Brooklyn designers a spotlight during New York Fashion Week. The event, a collaboration between Brooklyn Borough President Antonio Reynoso and Arts Ambassador Colm Dillane of KidSuper, featured full styling, lighting, and mentorship, providing designers Kent Anthony, Shriya Myneni, Rojin Jung, Ahmril Lorraine, and Daveed Baptiste with professional exposure on a global stage. The collections explored themes ranging from personal transformation and cultural heritage to joy, grief, and immigrant experiences, impressing a star-studded audience including Busta Rhymes, Lauryn Hill, A$AP Ferg and Terance Mann. Organizers and attendees hailed the show as a milestone for Brooklyn’s creative community.\nBrooklyn Cyclones captured their first High-A Championship since 2019: The Brooklyn Cyclones clinched the High-A South Atlantic League Championship on Sept. 16, marking their first title since 2019 and capping a 40-26 season at Maimonides Park. For longtime fans and team broadcaster Justin Rocke, the win was a milestone, highlighting both the players’ evolution through roster changes and the community’s deep connection to the team. Superfan David “Wolf” Pecoraro, a fixture at the park for decades, embodied the celebratory spirit, meticulously following games, cheering loudly, and sharing the experience with family. Beyond the field, the championship was a reminder of the bonds between players, coaches, and fans, and why minor league baseball continues to hold a special place in Brooklyn’s culture.\nUnited Senior Center of Sunset Park reopened with $1M in city and state aid: The United Senior Center in Sunset Park, threatened with closure due to a landlord’s proposed rent increase of over 70% for a new 10-year lease, reopened in September following the allocation of more than $1 million in city and state funding. Assembly Member Marcela Mitaynes and Council Member Alexa Avilés secured $500,000 from the City Council and $600,000 from the State Assembly to keep the center operational. The 10,000-square-foot facility, the largest multilingual senior center in Sunset Park, serves over 4,000 seniors each month, offering meals, recreational activities, health insurance guidance, social security counseling, and referral services. The Sunset Park Business Improvement District also launched a GoFundMe campaign to fund painting and floor repairs, ensuring a refreshed space for returning seniors.\nNew York State retired ‘EDP’ term: Governor Kathy Hochul signed legislation on Sept. 26 retiring the term “emotionally disturbed person” (EDP) and replacing it with person-first language such as “person experiencing an emotional crisis” (PEC/PEEC) across all state and city agencies, including law enforcement, hospitals, and 911 dispatch. Advocates, mental health peers, and families affected by past police encounters hailed the change as a critical step toward reducing stigma and promoting dignity for individuals in crisis. The law complements broader efforts, including the proposed Daniel’s Law, to treat mental health emergencies as public health issues rather than criminal matters, emphasizing peer-led and trauma-informed responses. Experts stressed that language shapes perception and action, and the new terminology is intended to foster compassion, equity and safer outcomes for people experiencing mental health challenges.\nCarl Radke’s Soft Bar + Cafe brought alcohol-free community to Greenpoint: “Summer House” star Carl Radke opened Soft Bar + Cafe, a non-alcoholic-focused café in Greenpoint. The space, designed with wellness in mind, served “soft cocktails” made with functional ingredients like electrolytes, vitamins, and amino acids, alongside premium coffee, tea, and healthy snacks. Radke envisioned Soft Bar as a community hub, hosting events, wellness meetups, and social gatherings, while emphasizing inclusivity and connection. The café reflected Radke’s personal sobriety journey and provided a stylish, elevated alternative to traditional drinking culture, offering a welcoming “third space” for both residents and visitors.\nA five-alarm fire devastated a Red Hook warehouse, destroying artist studios and small businesses: A massive five-alarm fire tore through a Red Hook warehouse in September, destroying dozens of artist studios and small businesses. The heavy-timber building’s roof and part of the fourth floor collapsed as over 200 firefighters battled the blaze, which was largely under control by sunrise. While no serious injuries were reported, the extent of property damage is still being assessed. Local artists and business owners, including the Brooklyn Waterfront Artists Coalition, faced a devastating loss just days after their fall show opened, prompting a fundraiser that quickly raised funds to support those affected.\nInitially, artists and businesses had hoped to return to their space, but inspections revealed the damage is severe, and the building likely uninhabitable for years. With their lease terminated and rents expected to rise, orgs like BWAC are now searching for new, permanent homes elsewhere in Brooklyn.\nThe city broke ground on years-awaited Red Hook Coastal Resiliency flood protections: City officials broke ground on the long-delayed $218 million Red Hook Coastal Resiliency Project, a major climate adaptation effort designed to protect the low-lying Brooklyn neighborhood from frequent coastal flooding and storm surge. The project will build nearly 1.5 miles of flood walls, install eight deployable flood gates, raise and regrade streets by up to three feet, and upgrade sewers to manage stormwater, offering protection against more common “10-year storms” and floodwaters up to ten feet above sea level in some areas. First proposed after Superstorm Sandy devastated Red Hook in 2012, the plan also includes new bike lanes, park improvements, and waterfront upgrades, with construction expected to finish in 2028.\nOctober\nConey Islanders looked to the future after the death of the Coney Island casino: After New York state’s Community Advisory Committee voted down the proposed $3.4 billion Coney Island casino, local opponents marked the project’s demise with a mock funeral at Coney Island USA, celebrating the end of a deeply divisive, three-year battle. Backed by Thor Equities and its partners, the casino promised jobs and investment but drew fierce opposition from residents who feared it would overwhelm infrastructure, raise rents, and damage Coney Island’s cultural identity. The fight fractured friendships and sparked heated public meetings and allegations of intimidation. With the casino dead, community leaders are now calling for healing and renewed focus on development ideas that boost the People’s Playground without overwhelming it.\nBrooklyn food banks braced for SNAP freeze: Brooklyn food pantries and community fridges braced for a SNAP benefits freeze that began on Nov. 1, as millions of New Yorkers faced delays in food assistance. Local organizations scaled up resources to meet rising demand. Soni Sangha of Camp Friendship reported a surge in calls and noted the pantry had grown from serving 50 families in 2020 to 530 recently. Peter Endriss of CHiPS said the organization was at capacity but coordinated with other nonprofits, while Masbia partnered with DoorDash for home delivery. Community fridges, stocked by volunteers like Sandra Kornbluth, provided 24/7 access to essentials. Gov. Kathy Hochul declared a state of emergency on Oct. 30 and allocated $65 million to support food banks. Brooklynites were encouraged to donate or volunteer to help neighbors in need, while lawmakers continued to sound the alarm.\nCrown Prince Haakon celebrates 200 years of Norwegian immigration in NYC: On Oct. 10, Crown Prince Haakon of Norway visited New York City to mark 200 years since the arrival of the ship Restauration. At Pier 16, hundreds of Norwegian Americans, many in traditional bunad, welcomed a replica of the historic ship. The prince highlighted the contributions of Norwegian immigrants and their values of hard work and fellowship. Later, he visited Brooklyn’s Red Hook to meet players of Gjøa, the oldest U.S. soccer club founded by Norwegian immigrants, charming children and families.\nA Coney Island nursing home faced scrutiny after fatal assault: In September, 89-year-old Holocaust survivor Nina Kravtsov was fatally assaulted by a fellow resident at Seagate Rehabilitation and Nursing Center in Coney Island, shocking Brooklyn’s elder care community. Police reported that 95-year-old Galina Smirnova bludgeoned Kravtsov with a wheelchair leg, and she was charged with murder while her competency to stand trial was reviewed. In the weeks that followed, Brooklyn Paper spoke with Kravtsov’s attorney, Randy Zelin, who criticized the facility’s negligence and noted that her death highlighted systemic failures that left residents vulnerable. Seagate, owned by Excelsior Care Group, had a history of citations for understaffing, poor dementia care, unsafe conditions, and failure to report incidents. State inspections revealed staffing shortages and insufficient supervision, particularly for residents with dementia. Advocates and politicians, including state Sen. Jessica Scarcella-Spanton, called for increased accountability and potential reforms to prevent future tragedies. The New York State Department of Health confirmed the death was under investigation.\nBrooklyn residents shared stories of breast cancer survival: In October, for our annual Pink Issue honoring Breast Cancer Awareness Month, we highlighted the experiences of local survivors Kristina Teschner, Sonaya Handberry and Chloe Effron. Teschner, a non-binary resident of Prospect-Lefferts Gardens, was diagnosed with stage zero DCIS breast cancer at 44 and chose an aesthetic flat closure, emphasizing self-advocacy and reclaiming autonomy during treatment. Handberry, from East New York, faced stage two metastatic breast cancer just before her 40th birthday while balancing work and family responsibilities, relying on therapy and her support network to navigate chemotherapy and its challenges. Effron, a 33-year-old graphic designer, was diagnosed with stage four breast cancer in early August and credited her family, partner and community for helping her manage treatments and maintain her independence. All three survivors emphasized resilience, community support and the ongoing fight that defines living with and beyond breast cancer.\nNovember\nBrooklyn drove progressive wins across mayoral and local races: Brooklyn played a decisive role in Zohran Mamdani’s election as New York City’s next mayor, giving him his highest vote share of 57% and more than 374,000 ballots. The Democratic Socialist not only strengthened his support from the primary but also flipped neighborhoods that had previously backed Andrew Cuomo, particularly in Black-majority districts. While Cuomo held sway in more conservative areas and Orthodox Jewish communities, Mamdani’s backing in progressive Brooklyn neighborhoods —combined with the support of the Working Families Party — helped him secure victory.\nIn local races, Democrat Kayla Santosuosso won southern Brooklyn’s Council District 47 seat, defeating Republican George Sarantopoulos with 59% of the vote and becoming the first woman to represent the district. Santosuosso, who had served as chief counsel to outgoing Council Member Justin Brannan, focused her campaign on street safety, family support, and revitalizing local businesses, while Sarantopoulos acknowledged the strong Democratic turnout in what he called a “blue wave.” Elsewhere in Brooklyn, incumbents such as Borough President Antonio Reynoso and Council members Shahana Hanif and Alexa Avilés retained their seats.\nA Clinton Hill business flooded in a sign of aging infrastructure: Repeated flooding in Clinton Hill is devastating local businesses like Private Picassos, an art studio that lost thousands in materials and faced weeks of closure after recent torrential rains overwhelmed the city’s storm infrastructure. Owner Valeen Bhat, who moved her studio to the neighborhood in 2024, had already invested in flood prevention measures, but flash floods continue to breach basements and low-lying streets. Residents point to clogged drains, outdated flood maps, and low-lying topography as persistent problems, while grassroots efforts like The City Sponge aim to educate locals on mitigation strategies. Despite the repeated damage, community support and donations are helping businesses like Bhat’s recover, even as city officials promise long-term infrastructure upgrades to confront worsening climate impacts.\nRIDER brings thoughtful gifts and community spirit to Park Slope: As part of Brooklyn Paper’s Small Business Saturday coverage highlighting shops across the borough, RIDER in Park Slope was featured for its carefully curated selection of cards, home goods, children’s items, and design-forward gifts. Founded by local resident Alma Lacour, the shop emphasizes products from independent makers — particularly Brooklyn-based, women-owned, BIPOC, and LGBTQ+ creators — while serving as a welcoming community hub for neighbors, families, and even dogs. Since opening in 2022 and expanding online, RIDER has built a loyal following and continues to engage the community through workshops, partnerships, and thoughtful in-store experiences.\nNydia Velázquez announced she would retire after 32 years in Congress: After more than three decades representing New York’s 7th Congressional District, veteran progressive Congresswoman Nydia Velázquez announced she will not seek reelection. First elected in 1993 as the first U.S. representative born in Puerto Rico, Velázquez — nicknamed “La Luchadora” for her tenacity — has championed working-class New Yorkers, led the Congressional Hispanic Caucus, and chaired the House Committee on Small Business. At 72, she emphasized the need for a new generation of Democratic leaders to tackle pressing issues like civil rights, wealth inequality, and affordability. Her retirement follows Rep. Jerry Nadler’s earlier departure and opens a competitive race in a district that stretches across northeast Brooklyn and western Queens.\nBrooklyn Borough President Antonio Reynoso, a progressive with deep local roots and a record of advocacy on housing, public health, and immigrant rights, quickly announced his candidacy to succeed Velázquez, immediately winning endorsements from multiple city council members and positioning himself as the frontrunner in the crowded upcoming primary.\nDecember\nThe Staten Island-Bay Ridge ferry made a historic return: After 61 years, ferry service between Staten Island and Bay Ridge officially resumed on Dec. 8, reconnecting the two boroughs by water for the first time since 1964. The new route, part of NYC Ferry’s revamped network, stops at Midtown West/Pier 79, Battery Park City, St. George Terminal, Atlantic Avenue/Pier 6, and Pier 11, with trips taking roughly 11 minutes between Staten Island and Bay Ridge. Local leaders, including Council Members Kamillah Hanks and Justin Brannan, U.S. Rep. Nicole Malliotakis, and Staten Island Borough President Vito Fossella, celebrated the launch, calling it a “game changer” for commuters and community connectivity.\nConey Island Lighthouse Mission faced closure: The Coney Island Lighthouse Mission, the neighborhood’s largest food pantry and soup kitchen, is at risk of closing in January 2026 unless it secures emergency funding. Serving over 7,000 families monthly through food distribution, hot meals, and programs like after-school care and clothing drives, the Mission has been a vital community resource for more than 25 years. While the food supply remains sufficient, rising operational costs — including rent, utilities, storage and staffing — have created a financial crisis exacerbated by lost major donors during the COVID-19 pandemic.\nChristine Alcalay’s Brooklyn fashion journey: Christine Alcalay, a Brooklyn-based designer, has built a thriving, community-focused fashion brand over more than two decades, rooted in her early experiences as a Vietnamese immigrant growing up in New York City’s Garment District. Watching her mother work long hours in sweatshops inspired Alcalay’s craft, even as she initially resisted following the family path. After training at the High School of Fashion Industries, Parsons, and a series of industry internships, she opened her first boutique, KIWI, in Park Slope, eventually expanding to Fig and launching her namesake shop on Fifth Avenue in 2022. Committed to slow, local production, Alcalay works with women-owned factories in the Garment District, prioritizing craftsmanship and community connection over mass production.\nThe city announced a $1B overhaul for the Coney Island boardwalk: The iconic Riegelmann Boardwalk in Coney Island is slated for a complete $1 billion reconstruction after years of storm damage and deferred repairs. The 2.4-mile waterfront landmark, a scenic Brooklyn landmark since 2018, will see its support system, decking, utilities, and access points fully replaced, with upgrades to adjacent Parks Department buildings. Funding was secured by outgoing Mayor Eric Adams and Council Member Justin Brannan, who emphasized the project as a long-awaited, community-focused investment. Although construction is still years away, with funds allocated through 2032, the rebuild marks a major step toward modernizing the historic public space.\nProspect Park swans were rescued after suspected off-leash dog attack: Two seven-month-old swans from Prospect Park are recovering at the Wild Bird Fund after suffering head and eye injuries believed to have been caused by an off-leash dog near the park’s lake. Rescued by local wildlife volunteers known as the “Swan Squad,” the cygnets were treated for infected wounds, with one facing possible vision loss that could prevent its return to the wild. Wildlife experts say such injuries are consistent with dog attacks and warn that off-leash dogs pose a serious threat to birds, which are rarely targeted by natural predators. The incident has renewed calls from advocates for stronger enforcement and education around leash laws, as well as greater protections for Prospect Park’s wildlife.\nMaimonides announced a merge with NYC Health+Hospitals in bid to stabilize Brooklyn safety-net care: Maimonides Medical Center will merge with NYC Health+Hospitals by April 2026, bringing the financially struggling private safety-net hospital into the city’s public healthcare system. City officials say the move will stabilize Maimonides by unlocking higher Medicaid reimbursement rates, generating millions in annual revenue, and supporting care for its largely Medicare- and Medicaid-insured patient population. The merger, backed by a $2.2 billion, five-year state grant, will preserve services, maintain Maimonides’ community-focused identity, and improve care coordination through the city’s Epic health records system. While hospital leadership and city officials say the deal is essential to keep Maimonides afloat, some trustees opposed it, filing an unsuccessful lawsuit over concerns about political motivation and quality of care before the board ultimately approved the merger.",
  "word_count": 7345,
  "scraped_at": "2026-02-14T12:21:14.810175"
}