{
  "article_id": "4f919171ac24",
  "url": "https://www.90min.com/posts/emma-hayes-confident-chelsea-squad-ability-cover-sam-kerr-absence",
  "title": "Emma Hayes confident in Chelsea squad ability to cover Sam Kerr absence",
  "date": "20240111T184500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Emma Hayes confident in Chelsea squad's ability to cover Sam Kerr absence\n- Sam Kerr suffered ACL injury during the winter break; Millie Bright also ruled out\n- 90min understands Kerr has signed a contract extension to remain with the club\n- Manager Emma Hayes says summer signing Catarina Macario will soon be available\nBy Emily Keogh\nChelsea supporters received the gut-wrenching news last week that prolific striker Sam Kerr suffered an ACL injury during the club's warm weather training camp in Morocco.\nArriving at Chelsea in 2020, the Australian striker endured an agonising turn of events, having notched an impressive 99 goals for the club before succumbing to injury. With Emma Hayes leaving the club at the conclusion of this season to take on the role of head coach for the US Women's National Team, Kerr will now undergo a nine-month rehabilitation process and will never have the opportunity to play under Hayes at Chelsea again.\nSpeaking for the first time since the news of Kerr's injury broke, Hayes provided an update on the Australian superstar's condition.\n\"She's having surgery today,\" he boss revealed on Thursday. \"I'm gutted for her. I'm gutted for the team. These things happen in football, she knows that, and I think the important thing is we're here to support her. The recovery and the rehab begins today.\"\nKerr is out of contract in the summer and it was rumoured that the Matilda's star could leave the WSL in favour of a move to the NWSL. But sources close to 90min have revealed that Kerr has agreed an extension until 2025. Hayes refused to confirm anything and said the focus is now on Kerr's rehab.\n\"I'm sure when the time is right to discuss her future, that time will come from Sam and the club, but Sam loves Chelsea and Chelsea loves Sam so I think that's the most important thing to say on that front,\" Hayes added.\nChelsea are set to experience a notable void in Kerr's absence, the manager admitted. However, she quickly shifted focus towards the remaining members of the Blues squad, recognising the collective strength and capabilities they bring to the team.\n\"We have a quality squad and it's a good challenge for me as a coach to find those solutions. I trust in the squad that we have. We've added to that as well. I think the focus and the attention has to go on the players that are here,\" Hayes explained.\nWhile Kerr's lengthy layoff is undoubtedly significant, Hayes expressed confidence in the depth and versatility of the remaining players, emphasising the opportunity for others to step up and contribute to the team's continued success instead.\n\"We feel we've got players that can score goals. We’re creating more chances than we've ever created in my time here. We just have to find different ways to finish,\" she added.\nDespite Chelsea's introduction of striker Mia Fishel to the WSL during the summer, the forward from the USWNT has encountered challenges adapting to life in London. Compounded by a lingering groin injury, her playing time has been restricted. In eight matches, she has managed to score only once.\nChelsea also acquired American compatriot Catarina Macario during the summer. She spent the initial months of her time at the club continuing rehabilitation for an ACL injury. While the extended recovery period has been vital for Macario's circumstances, the absence of Kerr may now serve to heighten expectations for the 24-year-old's impending availability.\n\"She took part in the sessions in Morocco, albeit in a progressive way, not in full-team training, but parts of training,\" Hayes explained of the former Lyon star. \"I think this first part over the next couple of weeks will be the reintroduction and I think Chelsea fans can expect to see her quite soon.\n\"For those of you that haven't watched Cat play, trust me, she's a top, top player.\"\nChelsea also possess younger talents in Lauren James, who has netted seven goals so far in 2023/24, and Aggie Beever-Jones, tallying five after returning from a loan at Everton last season, who are also primed to fuel the Blues' goalscoring needs in place of Kerr.\nChelsea continue to be without key centre-back Millie Bright, who missed a hefty chunk of last season with a knee injury. Returning to feature in all of England's World Cup run that ended in defeat to Spain in the final, Bright's knee concerns returned and prevented her from featuring in the final few games of 2023.\n\"She's in rehab at the minute and working hard on that,\" Hayes said of Bright's injury.\n\"I can't give a timeline for a return, as I've said many times over, but she's in good spirits and she'll be back as soon as she can humanly possibly make it back. I'm sure she'd put her boots on today if I asked but we just need to get it right for Millie's long-term future.\"\nTo avoid rushing Bright's return, Chelsea opted to secure the signature of Swedish defender Nathalie Bjorn from Everton. This strategic signing not only provides an alternative and capable option in defence but also compensates for the absence of Aniek Nouwen due to an ACL injury.",
  "word_count": 869,
  "scraped_at": "2026-02-14T12:57:25.011658"
}