{
  "article_id": "4f9f95068cdf",
  "url": "https://www.coventrytelegraph.net/news/uk-world-news/dr-amir-khan-says-everyone-32716717",
  "title": "Dr Amir Khan says  everyone should try  8p supplement that could reduce Alzheimer risk",
  "date": "20251021T080000Z",
  "domain": "coventrytelegraph.net",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Dr Amir Khan says 'everyone should try' 8p supplement that could reduce Alzheimer's risk\nDr Amir Khan has shared a snippet of the latest episode of his podcast, No Appointment Necessary, in which he and co-host Cherry Healey discuss supplements\nDr Amir Khan has given glowing endorsement to a supplement he believes 'everyone should try' owing to its extensive range of health benefits. The medical expert even suggests that regular consumption of this supplement might reduce an individual's chances of developing Alzheimer's Disease, with early research appearing \"promising\".\nDr Khan, MB, ChB (Hons), MRCGP, DCH, DRCOG, serves as an NHS general practitioner at The Ridge Medical Practice in Bradford. He has gained widespread recognition for sharing his medical knowledge across digital platforms and television broadcasts.\nThe doctor frequently features on popular TV programmes including ITV's Good Morning Britain, Lorraine, This Morning, and Loose Women.\nRead more: Coventry Pizza Hut faces closure\nDuring his free time, he refreshes his social media accounts with wellness guidance and recommendations. To extend his reach to more individuals nationwide, the GP has also established a fresh podcast series alongside co-presenter Cherry Healey.\nPrior to the launch of their latest episode, scheduled for release this week, Dr Khan offered his 13,400 Instagram supporters a preview of the forthcoming content. Posting a brief extract from the new episode, Dr Khan announced: \"The SECRET supplement you HAVE to try! Don't miss next week's episode of No Appointment Necessary!\", reports the Mirror.\nDuring the programme, the NHS physician and Cherry discuss various supplements, including debunking widespread misconceptions and disclosing the three supplements Dr Amir advocates for - with creatine being amongst them. Creatine represents a naturally occurring compound that the human body generates and can also be found in certain foods, supplying energy to muscle and brain tissue.\nAs a nutritional supplement, usually in the form of creatine monohydrate, creatine is frequently utilised by athletes to improve performance and increase muscle mass during brief periods of high-intensity exercise. Nevertheless, certain studies indicate that it may also help support cognitive function.\nSpeaking to viewers in the footage, Dr Khan says: \"What is the hot topic around creatine now? We know it works for people who are in sports, but does it work for everyone else as well?\".\nHe continues: \"There's really interesting research looking at it to help reduce the risk or progression of Alzheimer's dementia. We haven't got strong enough results to say yes now, but there are really promising results coming out that just make me go 'wow', this could be really important.\"\nThe footage concludes with the medic emphasising: \"And that is why I really think, as we get older, it's one of the supplements I would strongly recommend.\"\nYou can purchase creatine in different formats, including powder and capsules, at most health and fitness stockists.\nBoots, Superdrug and Holland and Barrett are amongst the retailers where you can locate creatine. Boots, for instance, is retailing a container of 250 Myprotein Impact Creatine Monohydrate Capsules for £20, which works out to 8p per capsule.\nCreatine is a popular supplement amongst athletes and gym enthusiasts. It's primarily used to enhance performance in high-intensity, short-duration activities such as weightlifting, sprinting, and team sports.\nCreatine is one of the most researched and effective dietary supplements for boosting strength, power, and muscle growth.\nWhat are the benefits of creatine?\nAs highlighted by Dr Khan, there are other reasons to consider taking creatine. These include potential health benefits related to ageing and possibly aiding brain function to combat certain severe neurological conditions.\nCreatine aids in regenerating adenosine triphosphate (ATP), the body's primary energy source, allowing you to train harder and longer, thus enhancing strength and power. Creatine also increases the water content in muscle cells, causing them to swell and trigger pathways leading to muscle growth.\nOver time, this improved training performance results in increased muscle mass.\nCreatine is known to minimise muscle cell damage and inflammation that can occur during intense workouts, aiding in quicker recovery between sets and workouts. It's particularly beneficial for athletes involved in power sports like weightlifting, sprinting, and football, as it enhances performance during repeated, short bursts of intense activity.\nSimilarly, creatine can boost phosphocreatine levels in the brain, which aids in the production of more ATP. This boost can lead to improved memory, reasoning skills, and mental clarity, especially during periods of stress or lack of sleep.\nFor the elderly, creatine may help counteract the natural decline in muscle mass and bone mineral density that comes with ageing. When combined with resistance training, it can enhance both physical performance and cognitive health.\nSome studies suggest that creatine might offer therapeutic benefits for neurological conditions such as Parkinson's and Huntington's diseases, although further research is required.\nCan creatine help prevent dementia?\nWhile there isn't enough evidence yet to definitively confirm that creatine can reduce the risk of dementia, some studies are showing promising results. The effect of creatine on the treatment of Alzheimer's disease is still under investigation, but early results are encouraging.\nA pilot study conducted in 2025 involving human patients with Alzheimer's suggested that creatine supplementation increased brain creatine levels and was associated with improvements in cognitive performance. The pilot study only included 20 participants and lacked both a placebo control and blinding.\nDue to these limitations, more extensive clinical trials are required before any definitive conclusions can be drawn.\nIn other research, studies using mouse models suggest that creatine may boost brain energy metabolism and reduce disease biomarkers. However, larger clinical trials are needed to confirm these results and determine whether creatine can be used as a preventive or treatment method.\nCurrently, there is no clinically approved dosage for administering creatine in the context of neurological disorders. In the pilot study, a high dosage of 20 grams per day was used over eight weeks to increase brain levels.\nIf you or someone you know is dealing with Alzheimer's disease, it's crucial to consult a doctor before starting any new supplement, such as creatine. Although it is generally considered safe for healthy individuals, those with existing health conditions should discuss potential risks and benefits with their healthcare professional.\nImportant considerations.\nAlways consult your GP before attempting anything new or implementing any significant alterations to your diet and lifestyle. Creatine ranks amongst the most researched and secure supplements on the market, although some individuals might encounter minor, short-term side effects.\nOne typical effect involves an initial rise in weight caused by increased water retention in your muscles rather than fat accumulation. Some users may also suffer from stomach upset, nausea, or diarrhoea, especially during a \"loading phase\" involving high doses.\nMaintaining adequate hydration and opting for a reduced daily dosage can prove helpful.\nFor individuals in good health, there exists no evidence suggesting creatine supplementation adversely affects kidney function. Nevertheless, those with pre-existing kidney conditions should obtain medical guidance before commencing supplementation.",
  "word_count": 1147,
  "scraped_at": "2026-02-14T13:43:39.028538"
}