{
  "article_id": "4fa931203c52",
  "url": "https://www.winnipegfreepress.com/breakingnews/2024/07/20/winnipegs-scott-gets-call-for-fourth-olympics",
  "title": "Winnipeg Scott gets call for fourth Olympics – Winnipeg Free Press",
  "date": "20240720T190000Z",
  "domain": "winnipegfreepress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Winnipeg’s Scott gets call for fourth Olympics\nAdvertisement\nWinnipeg’s Desiree Scott is going to the Summer Olympic Games in Paris after all.\nRead this article for free:\nor\nAlready have an account? Log in here »\nTo continue reading, please subscribe:\nMonthly Digital Subscription\n$1 per week for 24 weeks*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $4.00 plus GST every four weeks. After 24 weeks, price increases to the regular rate of $19.95 plus GST every four weeks. Offer available to new and qualified returning subscribers only. Cancel any time.\nMonthly Digital Subscription\n$4.99/week*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $19.95 plus GST every four weeks. Cancel any time.\nTo continue reading, please subscribe:\nAdd Free Press access to your Brandon Sun subscription for only an additional\n$1 for the first 4 weeks*\n*Your next subscription payment will increase by $1.00 and you will be charged $16.99 plus GST for four weeks. After four weeks, your payment will increase to $23.99 plus GST every four weeks.\nWinnipeg’s Desiree Scott is going to the Summer Olympic Games in Paris after all.\nRead unlimited articles for free today:\nor\nAlready have an account? Log in here »\nHey there, time traveller!\nThis article was published 20/07/2024 (574 days ago), so information in it may no longer be current.\nWinnipeg’s Desiree Scott is going to the Summer Olympic Games in Paris after all.\nThe 36-year-old midfielder, originally left off Team Canada’s roster announced on July 1, has been added an alternate to the national women’s soccer team after an injury to Sydney Collins.\nCollins, a 24-year-old defender, fractured her left leg Thursday in a training match against Nigeria in Spain.\nAs a result, Canadian head coach Bev Priestman has elevated midfielder Gabrielle Carle, 25, to the active roster while Scott has been summoned to train with the squad as an alternate.\n“Bev called me and just kind of explained the situation and said that it was a no-brainer for the alternate that they would like to bring in, in terms of my experience as a vet, having been to three (Olympics) before and my calmness that I bring to the squad,” Scott told the Free Press.\n“Even from an alternate role I’m hoping to have have a positive impact to help them out. Although I’m shocked, I’m excited to to head there.”\nScott had hoped to add a fourth Olympic medal to a collection that already included gold from Tokyo in 2021 and bronze medals from 2016 in Rio and 2012 in London.\nShe did not play at all in 2023 owing to lengthy rehab of a knee injury, but declared herself fit earlier this year after surgery to repair a torn meniscus.\nBut limited playing time and competition from younger players on the national team and her club team, the National Women’s Soccer League’s Kansas City Current, originally kept her off the Canadian roster.\nScott will suit up for the Current, playing the Houston Dash in NWSL x LIGA MX Femenil Summer Cup game at home tonight before departing to join the national team in France.\n“I’m just training and working,” said Scott. “We’ve had a bit of break in the league because there’s an Olympic break, so we haven’t had any matches. But we have a tournament that’s starting now. I’ve just been training and hopefully getting some minutes today because I’ll be en route. It’s kind of crazy.”\nScott, a member of the national team since 2010, has appeared in 187 games for her country.\nCollins was injured in her first match back after recovering from a fractured right leg, suffered in February 2024.\n“Our hearts go out to Sydney during this difficult time,” said Priestman in a release. “She has worked incredibly hard to return in time for Paris 2024, and while this is a setback, we know she will come back stronger. She will be with us in spirit every step of the way.\n“With the depth and resilience of our roster, it’s a next-player-up mentality, and both Gabby and Desiree’s experience will be invaluable to our team’s success.”\nCanada opens Group Stage play at the Olympics against New Zealand on July 25 in Saint-Étienne, France.\nmike.sawatzky@freepress.mb.ca",
  "word_count": 741,
  "scraped_at": "2026-02-14T12:18:05.831348"
}