{
  "article_id": "4fadedc89a1e",
  "url": "https://www.womenshealthmag.com/life/a44649996/sophia-smith-world-cup-us-womens-national-team/",
  "title": "Meet USWNT Sophia Smith : All About The Star Soccer Player",
  "date": "20230726T194500Z",
  "domain": "womenshealthmag.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In case you missed it, the FIFA Women’s World Cup is happening right now in Australia and New Zealand. The US is scheduled to play the Netherlands tonight at 9pm, and it’s expected to be a highly competitive match.\nOf course, the US Women’s National Team is packed with an impressively talented crew, including household names like Megan Rapinoe and Alex Morgan. But there are also a lot of younger players who are shining out on the pitch right now. From Naomi Girma to Trinity Rodman, these soccer stars are eager and ready to prove themselves. But there's one young player that everyone seems to have their eye on: newcomer Sophia Smith.\nThe striker landed two goals against Vietnam last week, and she’s getting ~plenty~ of buzz for it. But who is Sophia Smith and how did she make it to the World Cup? Here’s what you need to know:\nHow old is Sophia?\nSophia is just 22 years old. However, she’ll turn 23 on August 10, which is before the World Cup final on August 20. Talk about a fun birthday celebration!\nWhile she may be young, Sophia actually isn't the youngest USWNT member. Alyssa Thompson is just 18 years old (!), which means she was born in 2004. The oldest player on the USWNT is Megan Rapinoe, who is 38.\nShe’s from Colorado.\nSophia is from Windsor, Colorado. Fun fact: She has two older sisters—Gabrielle and Savannah. And athleticism definitely runs in the family because Savannah was actually an all-conference basketball player at Northern Colorado, per Sophie’s official US Women’s National Team bio.\nWhen she was growing up, Sophia played youth soccer for Real Colorado, where she was coached by Lorne Donaldson. Her old coach is now the Jamaican Women’s National Team head coach, which means they could see each other at the World Cup.\nWhere did Sophia go to college?\nShe attended Stanford University for only two years. She left the school (before graduating) after her sophomore year to play professional soccer. But before she left, Sophia was part of NCAA championship-winning soccer team when they clenched the title in 2019, per her Stanford bio.\nShortly after finishing her sophomore year in 2019, Sophia joined the US National team and was called up that same year. She was quickly drafted by the Portland Thorns and was the first overall draft pick of 2020, her bio said.\nWhat position does she play?\nSophia plays forward, and she doesn’t skimp on goals. The striker nabbed 14 goals in the 2022 season, which was the second best in the National Women’s Soccer League, according to the Portland Thorns website.\nShe's already scoring goals at the World Cup, too. Sophia scored the USWNT's first two goals against Vietnam last week, and will likely rack up more during Wednesday's game against the Netherlands.\nWhat did she do during her celebration against Vietnam?\nDuring one of her goals against Vietnam last week, Sophia walked up to the camera and made a motion of zipping her lips shut. This was an homage to her former Stanford teammate, Katie Meyer, who died by suicide last year. (Katie made the motion after saving a penalty kick in their championship game.)\nAs a result of Katie's tragic death, Sophia and her teammate Naomi Girma (who also played at Stanford with Katie) have become big mental health advocates.\nIs this her first World Cup?\nThis is Sophia’s first World Cup on the adult stage, but she’s also previously played on junior teams.\nIn fact, Sophia scored three goals and one assist for the US at the 2018 FIFA U-20 Women’s World Cup in France, and played in all three matches for the US at the 2016 FIFA U-17 Women’s World Cup, her US Women’s National Team bio says.\nTune in to see what magic Sophia does on the field tonight when the US takes on the Netherlands at 9pm EST.",
  "word_count": 652,
  "scraped_at": "2026-02-14T12:16:46.040256"
}