{
  "article_id": "4fb32c2284cd",
  "url": "https://www.elevenwarriors.com/ohio-state-athletics/2023/06/139256/ohio-state-s-top-36-athletes-of-2022-23",
  "title": "Ohio State Top 36 Athletes of 2022 - 23",
  "date": "20230620T130000Z",
  "domain": "elevenwarriors.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Ohio State athletes were among the best in the country in a wide variety of college sports in 2022-23.\nAcross Ohio State’s 36 varsity sports, there were more than a half-dozen Buckeyes who won individual national championships and dozens of Buckeyes who earned All-American honors. There were Ohio State athletes crowned as the best athletes in their entire sport and Buckeyes who set other school records or otherwise established themselves among their programs’ all-time greats with their accomplishments.\nWith Ohio State’s year in sports now complete, we take a look back across all of those sports and attempt to rank the top 36 Buckeye athletes of the year – one for every sport, though some teams have as many as four athletes in the rankings.\nRanking athletes across different sports is a highly subjective exercise, so there’s plenty of room for debate on how these athletes should be ranked. That said, factors that were considered in our rankings included the athlete’s individual accolades, how integral each athlete was to his or her team’s success, whether they won individual or team championships and whether or not they broke records or achieved unprecedented feats for Ohio State.\n36. Yanique Dayle, Women’s Track and Field\nDayle was the track and field team’s top performer during the outdoor season, winning the 200-meter dash in a time of 22.87 seconds and also running on the winning 4x100-meter and 4x400-meter relay teams at the Big Ten outdoor championships. Those relay teams went on to earn All-American honors with a third-place finish in the 4x400 and a fifth-place finish in the 4x100 at the NCAA outdoor championships, where she also earned second-team All-American honors with 13th-place finishes in the individual 100 and 200.\nHer efforts helped lead Ohio State to a second-place finish at the Big Ten outdoor championships while she also helped the Buckeyes finish second at the Big Ten indoor championships with a third-place effort in the 60-meter dash and a sixth-place result in the 200.\n35. Emma Goldean, Field Hockey\nGoldean earned first-team All-Region, second-team All-Big Ten and third-team All-American honors as she recorded five goals and six assists from her midfield position.\nThe super senior led Ohio State to an 11-8 record, its best in the past five years, and broke program records by playing in 90 career games with 87 career starts over the past five years.\n34. Melina Wilkison, Softball\nA first-team All-Big Ten selection and second-team NFCA All-Midwest Region pick, Wilkison was one of the top hitters in the conference, ranking second in the Big Ten in slugging percentage (.722), fourth in runs (50) and seventh in batting average (.375) while leading the league with seven triples.\nWilkison had a midseason streak in which she reached base in 39 straight games, and the sophomore right fielder’s performance led the Buckeyes to a 33-20 record.\n33. Caley McGinty, Women’s Golf\nA first-team All-Big Ten honoree and honorable mention All-American, McGinty led Ohio State with a 72.33 scoring average this season. In her first year as a Buckeye after transferring from Oklahoma State, McGinty earned co-medalist honors at the Westbrook Invitational and finished in the top three in three consecutive tournaments.\nShe ended the year with a 13th-place finish at the Big Ten Championship and a 37th-place result at the NCAA Athens Regional, helping the Buckeyes to a third-place conference tournament finish and a sixth-place regional result.\n32. Lexi Edwards, Women’s Gymnastics\nEdwards became Ohio State’s first All-American in women’s gymnastics since 2012, earning second-team honors by tying for sixth place in floor with a score of 9.9375 at the NCAA Championships.\nFor the season as a whole, Edwards had six event wins and helped lead OSU to its best score ever at the Big Ten Championship as well as a program-record score at the NCAA Regionals.\n31. Kylie Murr, Women’s Volleyball\nMurr became Ohio State’s first-ever winner of the Big Ten Defensive Player of the Year award after leading the conference with 530 digs for the season. The senior defensive specialist, who became Ohio State’s all-time leader in digs, also earned honorable mention All-American recognition from the American Volleyball Coaches’ Association.\nHer defensive efforts helped lead the Buckeyes to their first NCAA regional final appearance since 2004.\n30. Laurence Wootton, Men’s Soccer\nWootton earned first-team All-Big Ten honors for the third year in a row to start his Ohio State career and was named the Big Ten Midfielder of the Year for his performance last fall, in which he led the Buckeyes to an 11-3-6 record and helped them get to the Big Ten Tournament semifinals and the second round of the NCAA Tournament.\nThe junior from England was also named a third-team All-American and earned first-team All-Region honors for his performance in the 2022 season, in which he tied for the team lead with five goals and added two assists.\n29. Tommy Eichenberg, Football\nEichenberg wouldn’t have sniffed this list a year ago, which speaks to just how much he improved in his first year playing for Jim Knowles. The linebacker from Cleveland emerged as Ohio State’s top defender and one of the best linebackers in the country in 2022, earning first-team All-Big Ten and second-team All-American honors.\nA team captain, Eichenberg recorded 120 total tackles – the most in a single season by any Ohio State defender in the past eight years – and led the Buckeyes with 12 tackles for loss. He was named a finalist for the Lott IMPACT Trophy and a semifinalist for the Butkus Award.\n28. Paul Veltrup, Fencing\nA sophomore from Germany, Veltrup made it all the way to the epee finals at the NCAA Championships before falling to Harvard’s Jonas Hansen in the championship match. His performance led the Buckeyes to a fifth-place NCAA finish.\nVeltrup was also the runner-up in men’s epee at the CCFC Championships, where he helped lead the Buckeyes to a conference title, and he finished the year with a 40-17 record in duals.\n27. Kameron Nelson, Men’s Gymnastics\nNelson earned All-American honors in three different events at the NCAA Championships, becoming the first Ohio State gymnast to accomplish that feat since 2017, when he finished third on floor, fifth on vault and sixth in the all-around competition in April.\nThe junior from Idaho also finished third in vault and seventh in floor at the Big Ten Championships, helping lead the Buckeyes to a fifth-place team result in the conference meet.\n26. Brice Sensabaugh, Men’s Basketball\nSensabaugh became an immediate star in his first and only season as a Buckeye, quickly emerging as Ohio State’s top scorer. He made the Big Ten’s All-Freshman team and the All-Big Ten third team after scoring 16.3 points per game – the third-most of any freshman in college basketball in 2022-23, the fifth-most ever for an Ohio State freshman and the eighth-most of any Big Ten player last season.\nAs a result, Sensabaugh emerged as a one-on-done prospect for the NBA draft, in which he’s expected to be a first-round pick on Thursday night.\n25. Mac Podraza, Women’s Volleyball\nPodraza became the first Buckeye to win the Big Ten Setter of the Year award as she led the conference with 11.1 assists per set. That was the 14th-best mark across the NCAA, and she was named as a second-team All-American by the AVCA.\nWith 83% of Ohio State’s total assists for the season, Podraza played a crucial role in Ohio State’s 22-10 record and run to the Elite Eight.\n24. Jenn Gardiner, Women’s Hockey\nGardiner earned first-team All-WCHA and second-team All-American honors and was a top-10 finalist for the Patty Kazmaier Award after scoring 57 points, tied for the fifth-most in the NCAA during the 2022-23 season.\nThe senior forward was the points leader on an Ohio State team that advanced to the national championship game for the second year in a row.\n23. Kaleb Romero, Wrestling\nRomero finished his Ohio State career on a high note with a third-place finish at the NCAA Championships that earned him All-American honors. That performance played a key role in Ohio State earning the final spot on the podium with a fourth-place finish in the national meet.\nRomero was also the runner-up in the 184-pound weight class at the Big Ten championship meet, and he finished the year with a 27-6 record that included 10 wins over top-25 opponents. Romero was Ohio State’s male Big Ten Medal of Honor winner for the 2022-23 academic year in recognition of his performance both on the mat and in the classroom.\n22. Amy Fulmer, Women’s Swimming and Diving\nFulmer broke Ohio State’s school record in the 100 free with a 47.02-second swim to win gold at the Big Ten Championships. She was also a part of three victorious relay teams at the conference championship meet – the 200 free relay, 400 free relay and 400 medley relay, with the first two of those teams also breaking school record – as Ohio State won its fourth straight Big Ten title.\nShe earned All-American honors with top-five finishes with all three of those relay teams at the NCAA Championships, which helped Ohio State earned a program-record sixth-place finish at the national competition. Individually, Fulmer earned honorable mention All-American honors with ninth-place finishes in the 50 and 100 free and a 12th-place result in the 200 free.\n21. Ruslan Gaziev, Men’s Swimming and Diving\nOhio State’s school record in the 100 free also went down on the men’s side when Ruslan Gaziev swam the distance in 40.98 seconds to earn a fourth-place NCAA finish. He also earned honorable mention All-American honors with top-16 finishes in five other events: 50 free, 200 free, 200 medley relay, 200 free relay and 400 free relay.\nLike Fulmer, Gaziev also won the Big Ten title in the 100 free, earning top honors in the conference meet with a Big Ten Championships-record time of 41.38 seconds. Gaziev was also on a trio of relay teams that earned top-three finishes in the conference meet, including Ohio State’s first-place 200 medley relay team, all of which helped the Buckeyes earn a second-place finish in Ann Arbor.\n20. Cotie McMahon, Women’s Basketball\nLike Sensabaugh, McMahon became an immediate star inside the Schottenstein Center as a true freshman, earning Big Ten Freshman of the Year honors after tallying 15.1 points, 5.5 rebounds, 2.4 assists and 1.6 steals per game. A difference-maker on both ends of the floor for the Buckeyes, McMahon became Ohio State’s first Big Ten Freshman of the Year since 2015 and also earned second-team All-conference honors.\nMcMahon was at her best in the NCAA Tournament, averaging 18.25 points and 6.5 rebounds per game to help lead Ohio State to three wins, including a Sweet 16 upset victory over UConn in which she scored 23 points. And unlike Sensabaugh, she’ll be back at Ohio State for at least two more years even though she already looks the part of a WNBA player.\n19. Taylor Mikesell, Women’s Basketball\nMikesell earned first-team All-Big Ten honors for the second straight year as she led the Buckeyes with 17.2 points per game, the eighth-highest average in the conference. As 2021-22 Jacy Sheldon missed most of the season with a foot injury, Mikesell provided the consistent scoring the Buckeyes needed to remain one of the top teams in the country, as she scored in double digits in all but three games all year.\nThe Massillon native, who was also a finalist for the Ann Meyers-Drysdale Award as one of the nation’s top five shooting guards, was selected with the 13th pick in this year’s WNBA draft and is now playing for the Atlanta Dream.\n18. Irina Cantos Siemers, Women’s Tennis\nCantos Siemers became the fourth Ohio State women’s tennis player ever to earn Big Ten Player of the Year honors as she went 25-11 during the 2022-23 season, including 15 wins against nationally ranked players, to lead the Buckeyes to a second-place Big Ten finish in both the regular season and the conference tournament.\nShe helped lead the Buckeyes to two wins in the NCAA Tournament to earn a berth in the Super Regionals, while she also won one match in the NCAA singles draw to advance to the Round of 32 before falling to No. 1 overall seed Fiona Crawley of North Carolina.\n17. Emily Londot, Women’s Volleyball\nLondot was named the AVCA’s Northeast Region Player of the Year and earned first-team All-Big Ten honors for leading Ohio State with 527.5 points, the fourth-most in the conference, during the 2022 season. She also earned second-team All-American honors for her performance over the course of the year.\nShe took her performance to new heights in the NCAA Tournament, recording career-highs of 31 points and 29 kills in the women’s volleyball Buckeyes’ Sweet 16 upset win over No. 2 seed Minnesota to propel Ohio State to the Elite Eight.\n16. Andrew Lutschaunig, Men’s Tennis\nLutschaunig didn’t just win one national championship over the past year, he won two of them. In the fall, Lutschaunig paired with JJ Tracy to win the doubles championship at ITA Fall Nationals. In the spring, Lutschaunig won an even bigger prize when he paired with James Trotter to win the NCAA doubles championship.\nFor the season as a whole, Lutschaunig went 31-9 in doubles, including a 14-3 record against nationally ranked opponents, cementing his standing as one of the nation’s elite doubles players while helping lead Ohio State to its 17th consecutive Big Ten championship and a run to the NCAA Tournament final. He also went 7-2 in singles, though he wasn’t a regular in Ohio State’s singles lineup.\n15. Paris Johnson Jr., Football\nJohnson was widely regarded as one of the two best offensive tackles in college football last season, earning consensus All-American honors. In his only season actually playing left tackle for Ohio State, Johnson was a dominant anchor at the premier position on the offensive line, leading the way up front for the Buckeyes to rank second in the country with 44.2 points per game.\nAlso a first-team All-Big Ten selection and an Outland Trophy semifinalist, Johnson performed so well that he was selected with the No. 6 overall pick in the 2023 NFL draft – the highest draft selection for any Ohio State offensive lineman since Orlando Pace was the No. 1 overall pick in 1997.\n14. Addie Engel, Women’s Cross Country/Track and Field\nEngel made history last fall by becoming Ohio State’s first-ever Big Ten champion in cross country, running the six-kilometer course in exactly 20 minutes to win the gold medal. She went on to earn All-American honors at the NCAA Championships with a 10th-place finish, becoming just the second Ohio State runner ever to post a top-10 finish at the national cross country meet.\nThe junior from Springfield, Ohio, followed up her excellent cross country season with more success on the track, winning the Big Ten outdoor championship in the 10,000-meter run with a time of 34:43.37. She also finished 10th in the NCAA semifinals in the 5,000-meter run with a time of 15:57.15.\n13. Maxwell Moldovan, Men’s Golf\nMoldovan set Ohio State’s single-season scoring record for the third year in a row as he posted an average round score of 70.64 for the 2022-23 season. He was a unanimous All-Big Ten selection and a second-team All-American as he finished in the top 10 in 10 of Ohio State’s 13 tournaments for the year, highlighted by his performance at the NCAA Auburn Regional, where he led Ohio State to an NCAA Championship berth by tying for first place.\nHe followed up his excellent collegiate season with an even bigger accomplishment this past weekend, when he outperformed some of the top golfers in the world to make the cut at the U.S. Open before ultimately finishing 65th.\n12. Katherine Zenick, Women’s Swimming\nZenick won a whopping six gold medals at the Big Ten championship, earning individual victories in the 50 free and 100 fly while teaming with her fellow Buckeyes to win the 200 free relay, 400 free relay, 200 medley relay and 400 medley relay, leading the way for the Buckeyes to defend their conference title.\nThe junior from Southlake, Texas then won on to earn All-American honors in six events at the NCAA Championship, finishing sixth in the 100 free and eighth in the 100 fly individually while earning top-six finishes with the 200 free, 400 free, 200 medley and 400 medley relay teams, leading the way for the Buckeyes’ sixth-place team result in Knoxville.\n11. Jacob Pasteur, Men’s Volleyball\nPasteur was the MIVA Player of the Year and earned first-team All-American honors as he recorded 464 kills, the third-most in the NCAA during the 2023 season.\nThe 6-foot-4 outside hitter from Maryland also ranked 10th in the NCAA with 4.53 points per set, leading the way for Ohio State to earn a share of the MIVA regular-season title, win the MIVA Tournament and advance to the quarterfinals of the NCAA Tournament.\n10. Sammy Sasso, Wrestling\nSasso won the Big Ten championship and finished as the national runner-up in the 149-pound weight class for the second time in three years, falling to Cornell’s Yianni Diakomihalis – who lost just one match all year – in the NCAA title match.\nFor the year as a whole, Sasso went 29-4 with a 13-2 record in dual meets and an 8-0 record in Big Ten competition, earning six major decisions, four tech falls and 10 pins. His second-place NCAA finish made him the ninth four-time All-American in Ohio State wrestling history.\n9. Ruby Remati, Synchronized Swimming\nRemati led the way for Ohio State to win its 34th national championship in synchronized swimming, earning the Individual High Point Award at the U.S. Collegiate Championships by winning the A Figures competition and pairing with Emily Armstrong to win the duet national title.\nShe also earned a third-place finish in the trio competition with Armstrong and Hannah Heffernan and was a part of Ohio State’s Scarlet team that earned second place in the team routine, all of which ultimately led to the Buckeyes topping the final standings yet again.\n8. Maria Tsarik, Pistol\nOf the three individual events contested at the Intercollegiate Pistol Championships, Tsarik was victorious in two of them, finishing first in both the sport and standard pistol competitions.\nTsarik also finished eighth in the air pistol category; collectively, she finished second in the three-event aggregate. Her pair of victories led Ohio State to its third straight national championship.\n7. Katelyn Abeln, Pistol\nThe only shooter with a higher aggregate score than Tsarik at the Intercollegiate Pistol Championships was Abeln, who won the aggregate individual title as well as the air pistol title. Abeln finished in the top three in all three disciplines, earning second place behind Tsarik in standard pistol and third place behind Tsarik and fellow teammate Henry Leverett in sport pistol.\nAn All-American in all four of her seasons as a Buckeye, Abeln is the only Ohio State athlete to make our list of the school’s best athletes for all of the last four years.\n6. Adelaide Aquilla, Women’s Track and Field\nAquilla capped off her Ohio State career by winning her fourth NCAA title in the shot put, breaking her own school record with a toss of 63 feet, 3 1/4 inches to top the board at the NCAA Indoor Championships.\nThe first Buckeye to ever win four NCAA championships in track and field, Aquila previously won both the indoor and outdoor shot put championships in 2021 and the outdoor title in 2022, when she broke the NCAA record with a 64-foot, 5 1/4-inch throw. Aquilla only competed indoors for Ohio State this year as she exhausted her outdoor collegiate eligibility in 2022.\n5. Lyle Yost, Men’s Swimming and Diving\nYost became the first Ohio State diver since 2016 to win a national championship when he took the top spot on the podium in the 1-meter dive at this year’s NCAA Championships. Yost earned All-American honors in all three dives contested at the NCAA Championships as he finished fifth in the 3-meter dive and tied for sixth on platform.\nIn recognition of his performance in the pool, Yost was named the National Diver of the Year by the College Swimming and Diving Coaches Association of America. In recognition of his academic performance and community service efforts in addition to his athletic prowess, Yost was named as the Arthur Ashe Jr. Male Sports Scholar of the Year by Diverse: Issues in Higher Education.\n4. James Trotter, Men’s Tennis\nNo player in men’s college tennis was more consistently dominant this season than Trotter, who won his first 29 consecutive singles matches of the year before suffering his only loss of the year to Michigan’s Andrew Fenty in the Round of 16 of the NCAA singles championship. He was Ohio State’s team MVP in a 34-3 season and was the MVP of the Big Ten Tournament.\nTrotter’s excellence extended into doubles play, where he went 22-8 for the year and capped off his Ohio State career by winning the NCAA doubles championship with Lutschaunig. An All-American in both singles and doubles and a first-team All-Big Ten honoree, Trotter was named by the Intercollegiate Tennis Association as the nation’s most improved senior.\n3. Marvin Harrison Jr., Football\nFor all the great wide receivers who have worn the scarlet and gray, Harrison accomplished something no other Ohio State wideout had ever achieved before when he was named a unanimous All-American last season.\nHe earned that distinction in his first year as a starter for the Buckeyes by making one spectacular catch after another en route to finishing the season with 77 catches, 1,263 yards and 14 touchdowns. He likely would have been one of the first players selected in the 2023 NFL draft if he had been eligible, but he’ll instead be back at Ohio State for another year, where he’ll look to build upon his historic 2022 season and cement his standing as an all-time great.\n2. C.J. Stroud, Football\nStroud became Ohio State’s first two-time Heisman Trophy finalist since Archie Griffin in 2022 when he was selected by Heisman voters as one of college football’s top four players for the second year in a row. He also won the Big Ten Offensive Player of the Year award for the second straight year as he completed 66.3 percent of his passes for 3,688 yards and 41 touchdowns with only six interceptions.\nWhile he came up short of winning a Big Ten or national championship, he did just about everything he could to give the Buckeyes a chance to beat eventual national champion Georgia in the College Football Playoff, throwing for 348 yards and four touchdowns and running for 34 more yards against a defense that held opposing offenses under 300 yards per game for the season. Stroud became Ohio State’s highest-ever draft pick at quarterback when the Houston Texans selected him No. 2 overall in April.\n1. Sophie Jaques, Women’s Hockey\nJaques tops our ranking of Ohio State’s best athletes for the second year in a row after winning the women’s hockey equivalent of the Heisman, the Patty Kazmaier Award, along with the WCHA Player of the Year and Defender of the Year awards. Jaques solidified her résumé as one of the greatest defensemen in women’s college hockey history with a spectacular season in which she tallied 24 goals and 48 points – 11 more goals and nine more points than the next-best defender.\nIn the process, Jaques led Ohio State to its first WCHA regular-season title, the No. 1 seed in the NCAA Tournament, a program-record 33 wins and a second consecutive appearance in the national championship game, where the Buckeyes fell to Wisconsin after winning it all one year before. Jaques was also Ohio State’s female Big Ten Medal of Honor winner in recognition of both her on-ice play and academic achievements, as she is set to earn her master’s degree in civil engineering this summer.",
  "word_count": 4002,
  "scraped_at": "2026-02-14T12:14:36.572490"
}