{
  "article_id": "4fdabb2adde6",
  "url": "https://www.thenorthernecho.co.uk/news/25707100.middlesbrough-college-mfc-launch-womens-u19-pathway/",
  "title": "Middlesbrough College and MFC launch women U19 pathway",
  "date": "20251219T073000Z",
  "domain": "thenorthernecho.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A new partnership is paving the way for young North East women to pursue their football dreams.\nMiddlesbrough College and Middlesbrough FC have joined forces to launch the Middlesbrough College MFC Women’s U19 Football Pathway, which will see up to 20 players combine full-time education with professional football development.\nThe new scheme offers a direct route into the adult game, with players benefiting from elite training under the guidance of UEFA A and B Licensed coaches while continuing their studies.\nDan Wilson, football coach at Middlesbrough College’s Women’s Football Academy, said: \"The Middlesbrough College MFC Women’s Football Pathway gives our players a professional environment to develop their skills and fitness, while also supporting their academic progress.\n\"We’re committed to helping our players reach their full potential.\n\"Our partnership with Middlesbrough FC ensures that talented young women in Teesside have a clear pathway to succeed both on the pitch and in the classroom.\"\nThe programme is designed for Year 12 students and blends academic or vocational learning with elite-level player development.\nIt will also enable progression from college fixtures to potential selection for Middlesbrough FC Women.\nSammie Leigh, Middlesbrough College’s sport academy director and England Women’s Blind Team coach, helped shape the scheme.\nShe brings 18 years of experience in developing female players for the England talent pathway.\nFor the 2026/2027 season, the team will compete in the National Youth Football League, with pre-season starting in July and August.\nThe programme covers technical training, tactical understanding, strength and conditioning, performance analysis, physiotherapy, and regular match play.\nBen Fisher, general manager of Middlesbrough FC Women, said: \"This partnership demonstrates Middlesbrough FC Women’s commitment to retaining and developing local talent to strengthen women’s football across the region.\n\"Working with Middlesbrough College allows us to offer the coaching, facilities and support structures that will help these players progress into careers in football.\"\nThe pathway builds on the college’s record of developing female sport talent and aims to set a new standard for the region.\nThe programme is TASS Dual Career Accredited, recognising the college’s ability to support sporting talent without compromising academic achievement.\nTrial opportunities and friendly matches are scheduled for January, giving aspiring players a chance to join the scheme and take the next step toward a career in football.\nMore information about the academy, including details of upcoming trials, can be found at the Middlesbrough College website.",
  "word_count": 395,
  "scraped_at": "2026-02-14T13:44:31.672019"
}