{
  "article_id": "4ff7b80b59d9",
  "url": "https://english.news.cn/20240117/ae9b0d6117274b839bbecf0a790b584f/c.html",
  "title": "Xinhua photos of the day - Xinhua",
  "date": "20240117T080000Z",
  "domain": "english.news.cn",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Winners gather on stage with FIFA president Gianni Infantino (7th,L) during the Best FIFA Football Awards 2023 in London, Britain, Jan. 15, 2024. (Photo by Stephen Chung/Xinhua)\nAn aerial drone photo taken on Jan. 16, 2024 shows outbound vehicles at Hemu Village in Kanas scenic area, Altay Prefecture, northwest China's Xinjiang Uygur Autonomous Region. The snow-blocked section of a road linking Hemu Village in the well-known Kanas scenic area in northwest China's Xinjiang Uygur Autonomous Region was cleared on Tuesday afternoon after avalanches hit the area days ago.\nCurrently, the Kanas scenic area in Altay Prefecture, previously hindered by road closures due to avalanches, is now accessible to the surrounding areas. (Xinhua/Li Xiang)\nZheng Qinwen of China reacts during the women's singles first round match between Zheng Qinwen of China and Ashlyn Krueger of the United States at the Australian Open tennis tournament in Melbourne, Australia, Jan. 16, 2024. (Photo by Hu Jingchen/Xinhua)\nVehicle carrier vessel \"BYD EXPLORER NO.1\" arrives at Xiaomo International Logistics Port in Shenzhen, south China's Guangdong Province, Jan. 14, 2024. \"BYD EXPLORER NO.1,\" a vehicle carrier vessel leased to Chinese automaker BYD, held its maiden voyage ceremony on Monday at a port in Shenzhen, south China's Guangdong Province.\nWith more than 5,000 new energy vehicles (NEVs) on board, it set sail for the ports of Vlissingen in the Netherlands and Bremerhaven in Germany.\nIt is the first vessel in the shipping fleet of BYD, which has joined a number of Chinese automakers in accelerating car exports by operating their own shipping fleets. (Xinhua)\nPeople walk past the logo of the World Economic Forum (WEF) in Davos, Switzerland, Jan. 15, 2024. In the face of escalating global division and uncertainty, the 54th WEF Annual Meeting has assembled leaders from around the world for a week of dialogue aimed at enhancing cooperation and cultivating partnerships. (Xinhua/Lian Yi)\nA drone photo taken on Jan. 16, 2024 shows tourists visiting the snow-covered ancient city wall in Xi'an, northwest China's Shaanxi Province. (Xinhua/Liu Xiao)\nAn aerial drone photo taken on Jan. 16, 2024 shows the construction site of the second-phase project (east section) of the Nanjing Financial City in Nanjing, east China's Jiangsu Province. The main structure of the second-phase project (east section) of the Nanjing Financial City was capped on Tuesday. With a gross floor area of around 429,000 square meters, the project is designed as an architectural complex comprising officing, hospitality, housing and commercial facilities. (Xinhua/Li Bo)\nTents housing the homeless are seen amidst a snowfall in Washington, D.C., the United States, Jan. 15, 2024. The Washington, D. C. and its surrounding areas greeted the first snowfall of 2024 on Monday, which led to the delay and cancellation of part flights, traffic accidents and suspension of school classes. (Photo by Aaron Schwartz/Xinhua)\nA citizen rides on a street during a snowfall in Zhengzhou, central China's Henan Province, Jan. 15, 2024. (Xinhua/Wu Gang)\nA light projection is pictured during a media preview of the Light to Night Festival at Singapore's Civic District on Jan. 16, 2024. The Light to Night Festival will be held from Jan. 19 to Feb. 8 in various locations in the Civic District. (Photo by Then Chih Wey/Xinhua)",
  "word_count": 532,
  "scraped_at": "2026-02-14T13:39:22.040746"
}