{
  "article_id": "501993e117b5",
  "url": "https://www.arsenal.com/news/jonas-eidevalls-pre-reading-press-conference",
  "title": "Jonas Eidevall pre - Reading press conference",
  "date": "20230311T184500Z",
  "domain": "arsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Jonas Eidevall held his pre-match press conference as we prepare to face Reading in the Women's Super League.\nThe boss fielded questions from the media about our next opponent, our WSL title rivals, and Stina Blackstenius rediscovering her form in front of goal.\nHere's what he had to say:\non team news for Sunday…\nWe have high hopes for both Lina and Sabrina that they can come into the matchday squad on Sunday. As for Steph Catley, there are no further updates than what I had last Wednesday [a non-contact foot injury].\non his view of Reading as an opponent…\nThey’re a very versatile team that can play football in many different ways and in many different formations. They find ways to find solutions during the season and during matches, which I think is a recipe for success for them. So we need to be very well prepared and expect a tough opponent.\nIf we are playing our best, I'm very confident, but we need to reach that level.\non Stina Blackstenius finding her form…\nI think there are many things that go into football and what makes a performance, both on an individual and a collective level. And that’s the same for Stina. So it's great that she has scored two really important goals for us, but she is doing so many other things as well that contribute to the team.\nOf course, we are very happy about her scoring goals, but there are so many other ways that we look at and evaluate a player's performance. It’s not only about goals.\non how good it was seeing the performance levels continue on Wednesday against Liverpool…\nI thought it was a challenge coming from Sunday. Obviously, you win a title, it's a short turnaround and you need to be focused again. You need to keep your standards and you have to have your levels of play. That's never easy because it has to come from the inside. It has to come from everyone's preparation coming into it.\nI was really pleased with that - they rose to the challenge.\non whether every game from now on is a must-win game…\nWe go into every game with the ambition of trying to win and do our very best, but we keep it one game at a time. In football, there are a lot of things you can't control and we can't be focusing on that. But we can focus on every game we have in front of us, so that's why we need to be mentally strong.\nIf we do that well enough, I'm confident that we will have a good chance of reaching our ambitions.\non whether he’ll pay attention to the Chelsea v Manchester United game on Sunday…\nWe're just focusing on our game. I think there are going to be a lot of factors for the rest of the season that we cannot control. We have enough things to focus on that we actually can control, so I think it's a recipe for success to let the other things just be noise around us and focus on the controllables for us.\nThat's what we need to stay successful on game day. Our only focus should be on there on the opponent and executing our game plan.\non the status of Lia Walti’s contract…\nI can't comment on that. When we have something to communicate, with players extending contracts, we will be doing so on our official channels.\non which of our new signings will be registered for the Champions League…\nThat’s a decision that we’ll make when we have to register.\non preparing for Bayern Munich…\nWe’ve watched them of course on video but it's also possible for me to travel this time. So I'll do that with our lead analyst next week to have the possibility to see them live. It's not often we get that possibility but this time, we got it so that’s nice.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 687,
  "scraped_at": "2026-02-14T12:38:49.759155"
}