{
  "article_id": "502c8e112796",
  "url": "https://www.thejc.com/news/world/designer-ralph-lauren-receives-presidential-medal-of-freedom-qcokvro8",
  "title": "Designer Ralph Lauren receives presidential medal of freedom",
  "date": "20250105T174500Z",
  "domain": "thejc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Ralph Lauren has become the first fashion designer to receive the Presidential Medal of Freedom, in a ceremony on Saturday conducted by US President Joe Biden\nThe Jewish-American designer, whose brand is worth an estimated $10 billion, born Ralph Lishitz, was described by the White House as someone who “redefined the fashion industry with a lifestyle brand that embodies timeless elegance and American tradition.”\nThe Presidential Medal of Freedom is the United States’s highest civilian honour, presented to individuals who are deemed to have made exemplary contributions to the prosperity, values, security, world peace, or other significant societal endeavours.\nBorn in the Bronx to Jewish immigrant parents, Lauren told trade publication Women's Wear Daily that, “To receive the Presidential Media of Freedom conferred personally by the President of the United States is an honour of a lifetime. As a proud American citizen, I accept it with gratitude and great humility”.\nPresident Biden wore a Ralph Lauren suit to his inauguration in 2021, and the New Yorker also designed the outfit worn by Melania Trump to her husband’s inauguration.\nLauren was also responsible for the suit which former Secretary of State Hillary Clinton – who was also amongst the recipients of the Medal of Freedom this Saturday – wore to Trump’s inauguration, as well as all three of the trouser-suits she wore for the presidential debates in 2016.\nOther recipients on Saturday included George Soros, the Jewish philanthropist, and founder of the Open Society Foundations, the editor-in-chief of Vogue magazine Anna Wintour, Hollywood actor Denzel Washington, and Argentine footballer Leonel Messi – although the former Barcelona legend, who now plays for US side Inter Miami (partly owned by British football legend David Beckham) did not attend the ceremony, citing a scheduling conflict.\nToday, I had the honor of bestowing the Medal of Freedom – our nation’s highest civilian honor – on a group of extraordinary people who have given their sacred effort to shape the culture and cause of America. pic.twitter.com/tOAHzlbC3R\n— President Biden (@POTUS) January 5, 2025\nAfter the ceremony, President Biden posted on X: “Today, I had the honor of bestowing the Medal of Freedom – our nation’s highest civilian honor – on a group of extraordinary people who have given their sacred effort to shape the culture and cause of America.”\nTo get more news, click here to sign up for our free daily newsletter.",
  "word_count": 397,
  "scraped_at": "2026-02-14T12:53:23.397270"
}