{
  "article_id": "50435dc7fff2",
  "url": "https://www.newstatesman.com/ideas/2025/12/the-25-brits-who-defined-the-century-so-far",
  "title": "The 25 Brits who defined the century so far",
  "date": "20251231T064500Z",
  "domain": "newstatesman.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "After 25 years of the 21st century, Britain is a changed country. The optimism of the millennium has evaporated, and while some of the cruelty and phobias of the early 2000s have faded, new divisions have taken their place. Cultural icons have died and been supplanted. New media have emerged.\nThe New Statesman staff spent the final weeks of December debating the 25 Brits who have defined this century so far. There were many disagreements, and consequential figures on the shortlist who didn’t quite make the final cut – Richard Dawkins, Zadie Smith, Gabriele Finaldi, David Beckham.\nThis is our ranked list of people who have shaped the British psyche most noticeably, for better or worse. Without them, Britain would be a different place.\nDid we miss anyone? Email us at letters@newstatesman.co.uk\n25. Amy Winehouse\nThe only flaw in Stereophonic, Daniel Aukin’s West End- and Broadway-busting play about a band suspiciously similar to Fleetwood Mac, was the girls’ voices, which could not have possibly belonged to the 1970s. They were entirely post-Winehouse, as so many modern female voices are. No one since Lennon and McCartney has had such a profound influence on the way we sing.\nWinehouse name-checked Dinah Washington and Billie Holiday as her biggest influences, marking her out as a serious musician. Her quirk, however, was to filter these tastes through her own chaotic sensibility, making everything feel a bit too close for comfort. Singing is about physicality – in her case, a nasal quality, a glottal stop, a sliding “jazz” pitch and an emotional tremor that went far beyond any trained vibrato.\nThese qualities can still be heard everywhere, from Billie Eilish to Lady Gaga to Olivia Dean. Winehouse made a short, tragic pact with the devil, understanding that her personal suffering created her best songs. Fourteen years after her death, authenticity – or at least the appearance of it – remains a prerequisite of being a star.\n24. Nicola Sturgeon\nOne of the more surprising turns of this century is how women became the greatest threat to the Union. Across the Irish Sea, Mary Lou McDonald leads Sinn Féin in the South, while Michelle O’Neill fights for Irish unification as leader of Sinn Féin in Northern Ireland. The other critical player in this story is, of course, the former leader of the Scottish National Party and ex-first minister of Scotland. She took over the post from Alex Salmond after their side ultimately lost the independence referendum in 2014, with 45 per cent to 55 per cent.\nScottish independence has significantly retreated as a cause since then, but the SNP remains the dominant force in Scottish politics. Sturgeon won eight elections and led the government for nearly a decade. Yet the sheen of that career has considerably rusted: a police investigation into the SNP’s finances led to Sturgeon’s arrest (she has since been cleared), embezzlement charges against her now-former husband and their family home plastered across the news as a crime scene. Sexual assault claims by ten women (of which he was acquitted on all charges) also led to a painful fallout with Salmond, her predecessor and mentor.\nHer shock resignation in 2023 left behind a country divided – still on independence, but also on gender (Sturgeon is an advocate of gender self-identification) and the SNP’s domestic record. She presided over a rise in Scotland’s drug death rate, highest in Glasgow – her patch. Scotland’s education performance fell behind England and the UK as a whole, and she failed in her promise to eliminate the attainment gap. Meanwhile, the ferry procurement scandal continues to cost taxpayers hundreds of millions.\nAnd yet, her near-Teflon coating seems to have rubbed off on her party. The SNP remains at the top of the polls, and half of voters appear ready to break away from the UK. Another Holyrood majority for independence would bring Sturgeon’s teenage dream back into play.\n23. Norman Foster\nTake away Norman Foster’s buildings and the British cityscape would be like a mouth with missing teeth. Foster, whose firm Foster and Partners is the biggest architectural practice in the country, is the figurehead of those unequivocally modern, high-tech buildings – all glass and steel, struts and spars. Although he started independent work in 1963, the turn of the millennium saw a slew of projects. He opened the century (a somewhat wobbly start) with the Millennium Bridge across the Thames (2000). It is hard to imagine the topography of London without it now. Foster turned an exterior space into a breathtaking oversize atrium with the Great Court of the British Museum (2001). But he went further: by imprinting his vision on to one of the most visited museums in the world, he became the architect of Britain’s global image.\nWith the Gherkin (2004), that most distinctive modern building at 30 Mary Axe, Foster informed the entire visual lexicon of the City of London. And so in 2025 he represents much more than all that iron and steel and girding, but the United Kingdom’s final and total transition into a financial services economy.\nFoster’s architectural wattage has made him a crucial vector for British soft power as well: the reunified Germany chose Foster to redesign the dome of the Reichstag; in Nîmes his Carré d’Art nods to one of the most complete and beautiful Roman temples still standing; he brought Apple’s Cupertino campus into being; and he designed the Millau Viaduct – the tallest bridge in the world – in central France. At the age of 90, he continues to make his mark, defining not just Britain’s skyline but how it exists in the world’s imagination.\n22. Liz Truss\nLiz Truss demonstrated that, in a country long known for being “stable” and conservative, anything can happen in 21st-century Britain – and no one is safe. All the comfort blankets of pomp and ceremony, the baubles of office, the mighty old Tory party, the black door of No 10: none of it counted for anything when the line on the charts went the wrong way after that hubristic “mini-Budget”.\nIn the Truss premiership, no one could any longer deny that Britain was a nation in decline: declining wealth, power, talent and standards. The death of Queen Elizabeth II on Truss’s second day in office made the moment of reckoning even sharper.\nThe Labour Party positioned itself as the sensible, market-friendly alternative to Truss. Who wouldn’t? In the weeks after her mini-Budget, Labour suddenly attracted the support of over half the country – an unheard-of level of popularity.\nBut now there are those in Labour who think this might have been a dangerous compromise: that the party put itself “in hock” to bondholders and now a soggy Starmakite (Sunak/Starmer) consensus has formed over Britain’s economic policy. In this way, her short tenure continues to cast a much larger shadow over British politics.\nFor all her self-pitying talk of an elite conspiracy, it was the common people who dealt the final blow to Truss’s political career, removing her from her safe Tory seat at the 2024 general election.\nHer post-parliamentary career is too pathetic to recount, except to note that it has symbolised the British right’s wider crisis of meaning and its primal impulse to throw in its lot with the clowns and liars of Maga.\n21. Sadiq Khan\nSadiq Khan lives rent free in Donald Trump’s head. No other British politician can quite claim the same. When Trump held court at his golf course in Turnberry earlier this year, he made sure to berate Khan, who has been mayor of London since May 2016. He’s done a “terrible job”, Trump said, “a stone-cold loser”. Keir Starmer, who sat next to Trump throughout this outburst, could only manage to say he was “a friend of mine”. After Trump attacked him again in a recent Politico interview, Khan channelled his inner Regina George, telling reporters that the US president is “obsessed with him”.\nAs a practising Muslim who attends the London Pride marches, Khan embodies a different and positive vision of modern Britain – one that the right has yet to destroy. This is what makes him a target of hatred for Trump, as well as for much of provincial England, whose inhabitants see him as a representative of all they no longer understand about this country.\nBut Khan is important for more than mere symbolism. The former MP for Tooting has introduced free school meals for all primary schools in London, repeatedly frozen Tube and bus fares and expanded the city’s ultra-low emissions zone. Occasionally a thorn in the side of this Labour government, he was thrown out of a meeting with the Chancellor, Rachel Reeves, earlier this year after requesting more funding for the capital. All of these spats suggest that Khan’s philosophy is a robust one: it doesn’t pay to be liked.\n20. Doreen Lawrence\nAt the height of the 2020 Black Lives Matter protests in London, actor John Boyega listed Stephen Lawrence alongside Trayvon Martin, Sandra Bland and George Floyd during an emotional speech, stating that “we are the physical representation of our support for Stephen Lawrence”. Of these figures Lawrence, uniquely, was British. That his death has become a byword for racist violence in this country is due to the tireless campaigning of one woman: his mother, Doreen Lawrence.\nStephen, an 18-year-old student, was killed in a racist attack in south-east London in 1993. The police investigation came apart almost immediately, marked by missed opportunities and a reluctance to pursue obvious leads. It was Lawrence’s dogged persistence that prevented the case from disappearing from view.\nYears of pressure led to the Macpherson inquiry, whose 1999 report concluded that the investigation was “marred by a combination of professional incompetence, institutional racism and a failure of leadership”. It was a landmark moment, one that fundamentally changed the public’s perception of its largest police force. It would also come to define the next 25 years of the black British community’s relationship with the police, with Lawrence becoming one of the country’s most prominent campaigners. Honours followed, including an OBE and later a life peerage. Reflecting on the experience in 2022, she said: “The thing that makes me proudest is knowing Stephen’s name means so much now.”\n19. Ricky Gervais\nTo the younger generation, Ricky Gervais might be cringe. But then again, he always was. He realised early on – but not too early: first he tried to be a rock star, then a DJ, and found himself tumbling towards 40, the cringiest of ages – that his curse was also his resource. He farmed it wisely, channelling it into a new venture, a comedy in which he played the biggest joke of all. The Office, co-written with Stephen Merchant, is the century’s best sitcom and Gervais’s finest work. It arrived in 2001, the same year Only Fools and Horses returned for one of its sporadic, standalone Christmas specials. Compare them, and it becomes clear how The Office set the standard, genre and ambition of comedy for the following 24 years.\nGervais has never reached such heights since. A satirist by inclination, he makes comedy that runs like white spirits, both cleansing and corroding. Yet his later stand-up is stripped of sentimentality, leaving it bullying and dull. Unable to create new characters with the vitality of David Brent, he directs his energies at real-world targets. From the Golden Globes stage, he jabbed at the Hollywood elite, capturing the spirit of the age as he did so.\n18. Gary Lineker\nWhat does it mean for Britain in 2025 that its most powerful media personality no longer calls the BBC home? It was, ultimately, an anti-Semitism row that prompted the early resignation of this once-beloved England striker from Match of the Day. In May, Lineker reposted material that contained offensive imagery; he deleted the post, he said, as soon as he was made aware of the references, clarifying that he “would never knowingly share anything anti-Semitic”. It meant his departure as the show’s presenter, which had already been arranged for the end of the football season, was hastily brought forward, tainting the settlement that had been reached in the long-running dispute between Lineker and the broadcaster over his freedom to air his personal views on social media.\nWhen Des Lynam left Match of the Day in 1999, he had nowhere to go other than ITV. The world facing Lineker, however, is far larger than the one Lynam encountered at the turn of the century. It is the universe of YouTube, where Joe Rogan can influence the course of an election through podcasting, and where even the Pope tweets.\nGary Lineker knows this; he rose to the top of the two most competitive fields: sport and media. Now unshackled from the strictures of the BBC charter, and with no Tim Davie to answer to, Lineker’s horizons will only expand. All the while, he has successfully cast himself as the affable, manicured figure who speaks to Britain’s conscience. In 2025, Lineker stands as ultimate proof that legacy media is no longer the final editor of the national story.\nHis production company, Goalhanger, is becoming hegemonic. During the 2024 general election, The Rest Is Politics (hosted by Alastair Campbell and Rory Stewart) recorded 21.6 million downloads; during the 2024 Uefa European Championship, The Rest Is Football (hosted by Lineker, Alan Shearer and Micah Richards) received a total of 19.6 million downloads; and the hosts of The Rest Is History – Tom Holland and Dominic Sandbrook – are probably only days away from being put on display at the British Museum with all the other national treasures. Across Goalhanger’s output, Lineker reaches audiences and reflects public tastes in a way that the BBC, constrained by its traditional remit, no longer can.\n17. Rebekah Brooks\nWhen Rebekah Brooks was appointed to the News of the World’s top job at just 31, she became the youngest editor of a national newspaper in Britain. She quickly made her mark by launching a name-and-shame campaign against convicted child sex offenders. The campaign prompted lynch mobs and protests, with participants carrying signs bearing News of the World headlines. Many of the protests were directed at people wrongfully alleged to be paedophiles or child sex offenders. It was precisely the sort of controversy that would come to define the peak of British tabloid journalism; yet rather than being condemned, Brooks was feted, counting both Tony Blair and later David Cameron among her close personal friends. Indeed, her progression from friendship with Blair to Brown and then to Cameron – becoming part of his famous Chipping Norton set – signalled which way the wind was blowing for each of their careers.\nIt all came crashing down, however, with the eruption of the phone-hacking scandal. Journalists across the tabloid media were implicated, and Brooks was put on trial. For a brief moment, she had broken one of journalism’s cast-iron rules: never become the story. At a pretrial hearing, her lawyer likened her to St Sebastian, with “arrows coming from every possible angle”. Brooks, however, was no martyr. Cleared of all four charges, she was reappointed chief executive of News UK the following year – a position she has held ever since. For all the sound and fury that surrounded the scandal, her career remained intact. That may be the most telling detail of all.\n16. Tracey Emin\nAlthough Tracey Emin came to prominence in the late 1990s, the new millennium saw her refine the shock value of her early work to considerable effect. “Mad Tracey from Margate”, the lairy, sweary Young British Artist, is now a Dame of the British Empire and Britain’s best-known female artist. While she has continued to work in a confessional mode – little beyond the struggle of being Tracey Emin gets a look-in – nothing she has made this millennium has provoked the howls of outrage elicited by Everyone I Have Ever Slept With 1963-1995 (1995), a tent appliquéd with the names of anyone she had shared a bed with, or My Bed (1998), an unmade bed strewn with squalid accoutrements.\nNevertheless, her unwavering focus on herself fits neatly with the tenor of the times, and she now occupies an indulged position as the laureate of messy womanhood. Her bodily pictures – tangy with sex, blood and pain, both physical and psychological – are safe enough, yet retain just enough edge to remain artistically credible. Her reputation even survived her admission that she voted Conservative in the 2010 general election.\nEmin has used her status to talk openly about the bladder cancer that struck her in 2020 and the debilitating series of operations that ensued. She has also worked extensively with children’s and HIV charities and provided studio facilities for aspiring artists. Although critical acclaim has been far from universal, Emin takes her role of being an artist very seriously, and has been an evangelist for the importance of art in both personal and national life.\n15. Simon Cowell\nWith his V-neck and bog-brush hair, record executive and showbiz entrepreneur Simon Cowell has done more than any other this century to alter the world’s relationship with fame. He gained infamy as the nasty judge on Pop Idol in 2001, before going on to create The X Factor and Britain’s Got Talent. Thanks to his stable of globally exported television talent contests, many of us have grown up believing that we, too – with the right audition song and the right tearful personal story – could one day become a pop star. Many others concluded that the route to success was to follow Cowell himself: to speak bluntly, to dominate, to control.\nThis era of the democratisation of fame, brought with it the democratisation of judgement. We were all invited to laugh along with judge Si as he sneered at talentless nobodies having their one attempt at fame broadcast to the nation – and to feel a sense of ownership over the lives of those who made it. The man who launched the global careers of One Direction, Little Mix, Will Young and Leona Lewis through his label Syco was operating in a harsher age of celebrity: one defined by the mentor-bully and a Faustian pact with the tabloids and, crucially, TV.\nA couple of years after Cowell brought his TV judge-and-executioner act to the United States, Donald Trump assumed the same role in The Apprentice. Even as television loses ground to social media, we still live in a world shaped by reality TV.\n14. George Osborne\nGeorge Osborne’s significance is measured less in lucrative offices he held than in the lives he shaped. As chancellor from 2010 to 2016, Osborne did more than cut spending. He established austerity as the governing common sense of British politics: the idea that the financial crisis was caused by excessive public spending, that the state must retrench regardless of social cost, and that discipline, not demand, would lead to recovery. It was a political choice dressed up as economic necessity. The cuts fell heaviest where resistance was weakest: local government and welfare. Their long-term effects are what we see around us today. More than any other single policy choice this century, austerity has shaped Britain.\nBut, like his hero Tony Blair before him, Osborne has continued to adapt and thrive as his own political power waned. After being banished from government by Theresa May, he vowed vengeance, foreshadowing the collapse of the Tory old order. Out of politics, he was – absurdly – made editor of the Evening Standard by a Russian, Evgeny Lebedev, who now sits as a life peer in the House of Lords. Through the chair of the British Museum, the world’s largest asset management firm, and a podcast studio, Osborne is now heading to OpenAI – the company most likely to shape the remainder of the century. He cannot fail, while Britain continues to do so.\n13. Tim Stokely\nHas the computer in our pocket turned us all into porn stars? Not quite. Yet last year it was reported that OnlyFans, the content paid subscription service, has more than four million registered creators, the majority of whom create adult content. In January 2025 alone, 4.4 per cent of the UK online population visited the website.\nBehind this digital phenomenon is a single figure who transformed adult content into a global business. Tim Stokely, an Essex native, founded OnlyFans, the sex-work social media platform that now pays more tax than the entire UK fishing industry.\nOne small patch of the rural East Midlands – “the OnlyFans triangle” – has produced three of the world’s most high-profile porn stars: Bonnie Blue, Lily Phillips and Rebecca Goodwin. Each claims to earn more than £100,000 a month and, in the cases of Blue and Phillips, has inspired global moral panics. This month, Blue was deported from Indonesia, after being cleared of breaking the country’s strict anti-pornography laws.\nA story to watch in 2026: a potential buyout of the company is in the works, and any new owner will likely wonder why a porn behemoth is headquartered somewhere other than the San Fernando Valley, while the British government shows little interest in giving OnlyFans a reason to stay in the UK – if, indeed, it even wants it to.\n12. Demis Hassabis\nNo one on this list better illustrates Britain’s uneasy relationship with success. Hassabis is a Londoner, born to parents who came to Britain from Singapore and Cyprus – a product of our capital’s attraction to ambitious people from around the world. An alumnus of a north London comprehensive – proof, if ever it were needed, that private school is a waste of money – he passed his A-levels early and was offered a place at Cambridge aged 16, although he took a year off first to write a bestselling video game. Not content with a double first in computer science, Hassabis studied for a PhD in cognitive neuroscience, and then, in 2010, founded the company that would make him a global leader in AI: DeepMind.\nBut DeepMind was only to remain British for a few years. In 2014 it was bought by Google, and the intellectual property and technological advances it produces are now in American hands. One could argue that only Google could have provided the investment necessary for DeepMind to flourish, and it certainly has. In 2024, Hassabis added a Nobel Prize to his long list of accomplishments for his company’s work on protein folding. Yet one could also argue, convincingly, that Hassabis would have achieved remarkable success regardless. He illustrates how exceptional Britain still is at fostering great innovation, but also how poor we remain at holding on to it.\n11. Fred the Shred\nFred Goodwin first became “the Shred” in the late 1990s. He was working as deputy chief executive of Clydesdale Bank and was famous for two things: his ruthless cost-cutting and his five-second rule, which held that fast, instinctive decision-making worked best. There must have been something in it. After joining Royal Bank of Scotland (RBS) as deputy CEO in 1998, and then taking over in 2007, he helped drive the bank to become, briefly, the biggest asset-holder in the world, with $2.2trn on its books. Goodwin was knighted for his efforts in 2004. His office, a penthouse room in the bank’s Scottish headquarters, was 20 metres long.\nIt was a high precipice, and it was a long fall: that 20-metre office has since been downsized and divided, now rooming the chairman of RBS, its CEO, and all their personal staff. The year after Goodwin took the helm, RBS became the axis of a worldwide financial meltdown, partially accelerated by his risky business strategies. The bank was nationalised at public expense (with Goodwin’s dismissal a non-negotiable condition of state rescue) and “the Shred” became known in the media as “the world’s worst banker”. But Goodwin was shielded from the worst of the turmoil: after his departure in October 2008, he became eligible for a pension of £703,000 a year. His pay-off became a national scandal, and his pension was reduced and his knighthood revoked. Goodwin’s rise and fall, his lust and lavishness, his avarice and opulence, encapsulate the arc and morality of the economic event that still defines our times.\n10. Prince Harry\nThe Story of My Life by Marie, Queen of Romania, was published in 1934. Reviewing the autobiography for Time and Tide that December, Virginia Woolf noted that “no royal person has ever been able to write before”. The consequences of authentic royal blood bleeding into the pages of a book, Woolf felt, “may well be extremely serious”. What would happen if a Windsor wrote a novel or a poem? Would Buckingham Palace look the same? “Words are dangerous things,” she concluded. “A republic might be brought into being by a poem.”\nPrince Harry stepped back as a senior royal in January 2020. His service to his country in Afghanistan and his common touch – evident in everything from a successful tour of the Caribbean (2012) to founding the Invictus Games (2014) and even getting caught with his arse out playing strip poker in Las Vegas – counted for nothing. In what felt like a last hurrah for the tabloids, they tore the Prince and his American wife apart. The people’s prince was now a friendless prat. He was woke, wasn’t he? A snob. A traitor. Stripped of his security detail – effectively an excommunication order given the frenzied press coverage he was receiving in 2020 – he was forced to leave Britain. Spare, his autobiography and a delayed-by-90-years answer to the questions posed by Woolf, appeared in January 2023. No more significant British book has appeared so far this century. In gruelling and often hilarious detail, Harry torpedoes the myths that surround the monarchy. Nobody who reads it with an open mind can ever quite feel the same way about the House of Windsor ever again.\nPrince Harry’s story has barely begun. He may yet win back his security detail. He may yet rout the tabloids in court. He may even return home. And then something very peculiar will happen. In Britain, there will suddenly be a House of Windsor and a rival House of Sussex – a situation that, as Woolf would put it, “may well be extremely serious”.\n9. Hilary Mantel\nLike Shakespeare, Hilary Mantel (1952-2022) led a life that spanned centuries. Should future historians describe her as a writer of the 20th century or the 21st? We think of Shakespeare as a 16th-century writer, an Elizabethan, yet his greatest works – including Macbeth – belong to the 17th century. The same applies to Mantel. The 20th century, in which she spent most of her life, was for her a period of learning to write and struggling to live; it was in the 21st century that her full mastery as a writer found expression.\nHer early life was itinerant. Born in a Derbyshire village, she found work as a social worker for the elderly and lived in places such as Botswana and Saudi Arabia with her geologist husband – experiences she described in her first two novels in the 1980s. She then began moving away from the autobiographical and into the realm of history and politics, most notably in her portrayal of French revolutionaries in A Place of Greater Safety (1992), her first large-scale historical novel.\nThis would become the genre she defined as a writer, with a cycle of novels that are among the finest of the century so far: Wolf Hall (2009), Bring Up the Bodies (2012), The Mirror and the Light (2020). Immersing herself in Tudor politics, Mantel brought the most storied period of British history to life. The first two both won Booker prizes.\nMantel wasn’t just interested in Britain’s past. As the New Statesman’s Michael Prodger – one of the judges who awarded her first Booker Prize – has noted, “Mantel’s immersion in the court of Henry VIII also gave her highly tuned instincts for modern royalty.” In a memorable essay, she suggested that the new Princess of Wales existed only to produce an heir, provoking public controversy.\nMantel has left no literary heir of her own; her work will likely stand as the culmination of British historical fiction – a genre that first flourished with Walter Scott and, in all probability, came to a close with her death in 2022.\n8. Lee Rigby\nOn Wednesday 22 May 2013 editors at ITN News faced a difficult decision. A few hours previously, Lee Rigby, an off-duty soldier in the Second Battalion Royal Regiment of Fusiliers, was hacked to death by Islamist-inspired killers Michael Adebolajo and Michael Adebowale, outside the Royal Artillery barracks in Woolwich, south-east London. ITN obtained a graphic video from a member of the public. Should they publish it? They put it on their website, which subsequently crashed, then broadcast the video before the watershed on the 6.30pm news. It showed a man with bloodied hands, holding a meat cleaver, making what ITN called “political statements”. This was terrorist murder in the age of the smartphone.\nIn the weeks and months that followed, copycat attacks were attempted. Mosques were attacked, including a failed revenge firebombing in Grimsby carried out by two former soldiers. A white supremacist retaliated, attacking a Sikh with a hammer and machete in a Tesco. In the first decade of this century, the security services feared coordinated attacks by trained terrorists using dirty bombs, anthrax and even nuclear weapons. The reality turned out to be more prosaic though just as unsettling for the country at large. Today, we live in a world shaped by the Islamist terror and other acts of warped ideological violence which have so disfigured the country since the turn of the century.\nOf all the terrorist attacks that have shaped Britain this century – the tube and bus bombings of 2005, the assassination of Jo Cox in 2016, and the Westminster, London Bridge and Manchester attacks of 2017 – the murder of Lee Rigby has become the most gruesomely defining. In life, Rigby was a soldier and a father: an Everyman for turn-of-the-century Britain. In death, he has become a symbol of a very different Britain altogether: radicalised and vengeful.\n7. Boris Johnson\nAs a teenager, Boris Johnson declared his desire to be “world king”. Whatever his achievements, Johnson fell painfully short of his Jupitarean ambition. Yet, in his shambolic attempt to secure his place in history, he changed Britain in ways this country must live with for decades to come.\nThough something of a cartoonish embodiment of an older, public-school England, Johnson in many ways represents the modern United Kingdom in all its clownish unseriousness, rising to national prominence after his shambolic and uproarious performances on Have I Got News for You. Two terms as London mayor followed, but it was Brexit – the decisive conflagration for his generation – that catapulted him into real national power. After writing one column for and one against, he gambled on Leave and won. David Cameron resigned and Theresa May faltered; Johnson seized No 10 on the slogan “Get Brexit Done”. For this alone, he will always remain one of Britain’s most consequential 21st-century prime ministers.\nYet his very unseriousness destroyed him as quickly as it had made him, transforming the quiz-show jester into a prime minister undone by the coronavirus pandemic. He was ousted shortly after it emerged that he and his colleagues had been partying while the rest of Britain, subject and sovereign alike, obeyed his strict lockdown restrictions. And while Johnson’s legacy endures, his reputation diminishes with time, now loathed as much by the right as by the left – particularly over the “Boriswave” of immigration they resent. Johnson forever shaped Britain, in ways he cannot escape, like the rest of us.\n6. Maggie Oliver\nThe jail sentences for those convicted from the Rochdale grooming gangs total 432 years; it is widely believed that there are several millennia of convictions still to come in countless other towns and cities across the country. More than the crimes of any lone monster – Savile, Glitter or any other celebrity abuser – the systemic, sustained nature of the “grooming gang” evils (and their suppression by the authorities) mean they have become the dominant horror of 21st-century Britain, hanging over the country, darkening our sense of who we are and whether our institutions can be trusted.\nFor 15 years now, the stories of rapes and cover-ups have dripped into our collective understanding. The names of the towns – Rochdale, Rotherham, Telford, Bradford – have become baleful signifiers. In a country experiencing a profound crisis about immigration and race, these gangs have become a byword for institutional failure.\nIf it weren’t for Detective Constable Margaret Oliver, we might not know about them – or at least not their scale and their significance. She was the police officer who, after the conviction of nine men in Rochdale in 2012, resigned from Greater Manchester Police, believing that the true number of men involved stretched into the hundreds, in highly coordinated, industrial-scale sex crimes. She dedicated the next years of her life to exposing it. In a story of countless victims and abusers, she is a rare hero. Where she led, other brave individuals followed. The late Times journalist Andrew Norfolk and youth worker and whistleblower Jayne Senior deserve honourable mentions in this list.\n5. Danny Boyle\nJames Bond is escorting the Queen toward Westfield. Mr Bean dreams of West Sands Beach. Kenneth Branagh, as Isambard Kingdom Brunel, looks on as hundreds of actors and puppets forge the Olympic rings and burn a history into the consciousness of liberal Britain. Each of these moments in the London 2012 opening ceremony has been watched millions of times, over and over. One of the top YouTube comments on the official video of the entire four-hour performance (22 million views) reads: “12 years on and it still brings tears of joy. It makes me immensely proud.” About 900 million people watched it live.\nTrainspotting, Slumdog Millionaire or the 28 Days Later series could all earn Boyle a place on this list – but his proximity to a podium finish comes courtesy of the Games. Given a global platform, Boyle spun an island story that has become perhaps the most contested piece of popular historiography of our century so far. Your attitude towards its heroes and villains, its emphases and elisions, is as good a guide to your broader politics as anything else.\nEarlier in 2012, the BBC’s Huw Edwards asked Boyle about the British values he wanted to convey. He replied: “The place we are in the world is a very different place now, economically and politically… so there’s a kind of modesty about it, we’re aware of our place in the world now… We wanted [it] to be spectacular but also feel inclusive.” Immediately, and in the years since, critics have detected an arrogance – a Whiggishness, even – in Boyle’s account. Perhaps a truer reflection of the national mood came at the Paralympic Games a few weeks later, when the chancellor, George Osborne, was booed by the crowds. Nevertheless, in a collective experience rare in 21st-century national life, Boyle gave us a national myth. It is for the rest of us to judge whether his vision truly squared with national reality.\n4. Jeremy Corbyn\n“It’s your turn.” That was how John McDonnell sold running for the Labour leadership to Jeremy Corbyn in 2015. Not with an air of destiny, but in more conscriptive tones. McDonnell stood as the left candidate in 2007; Diane Abbott in 2010. As the Labour Party picked over the wreckage of Ed Miliband’s leadership, British socialism expected Corbyn to carry the banner, to start a debate and do his duty. He did all the above and more. Corbyn won the leadership by a landslide, supported by a wave of new and former party members: the young who didn’t know Labour before it was New and the exiled socialists who remembered when it was Old.\nIt was the first time the British left had taken full control of the Labour Party, and Corbyn’s leadership highlighted its history and hangups. Firstly, the controversy of Europe: an old opponent of the EEC, Corbyn was held responsible for Brexit by some of his party, having failed to campaign with much enthusiasm during the referendum. Then there was a talent for Pyrrhic victories: Corbyn achieved the greatest swing since Clement Attlee in 2017, an election he nevertheless clearly lost. And lastly, an air of old sectarianism: accusations of anti-Semitism dogged his leadership, and contributed to his defeat in 2019, alongside his incoherent Brexit policy (a policy formulated by the current prime minister).\nBut Corbyn himself never mattered as much as Corbynism, which is a mood as much as an ideology. It first stirred early in the century, in the Stop the War marches against Iraq (in which the former Labour leader was a key participant) and matured under the pressures of austerity. This politics was young, redistributive, anti-Atlanticist and anti-Israel. Its force was not contained by Corbyn’s expulsion from Labour by Keir Starmer and Morgan McSweeney. Instead, the left having learned the lesson never to trust Labourism again, it has flowed into Corbyn’s new venture with Zarah Sultana, Your Party, and into Zack Polanski’s leadership of the Greens. The afterlife of his movement has already made Corbyn the most important British socialist of the 21st century so far.\n3. Tony Blair\nThough he came to power in 1997, Tony Blair was always looking to the new century, the new millennium, and to building a modern Britain for the era he thought he understood. That was certainly the intention behind his pre-2000 legislation: devolution, the Human Rights Act, and the Good Friday Agreement to name the most significant. Each of these reforms were consequential in their own right. But together they amounted to a constitutional revolution that, in effect, created the 21st-century UK state.\nHowever, the fate of these reforms is just as telling. Blair believed he was building the foundations of a new progressive century. But, instead, his reforms no longer look like the permanent settlement they were meant to be, but rather a resented legacy to be torn down by the resurgent populist right, which has convinced itself that the genesis of Britain’s 21st-century malaise lies with Blair’s victory in 1997.\nWhatever the merits of this Faragist argument, it is true that Blair is far and away the most significant British prime minister this century – in part because he is the only one who can plausibly claim to have succeeded in office on his own terms. Blair is the first – and last – prime minister since Margaret Thatcher to have arrived in office with a vision of the country he wanted to build and to have made at least some headway leading it there.\nYet, as much as Blair actively shaped Britain in ways he sought – “modernising” its constitutional norms, social mores and diplomatic positioning – there is a tragic irony to his time in office. The most profound changes he made to the country have created the very conditions that now threaten to tear down his legacy. The decision to join the US invasion of Iraq in 2003 is the most obvious and calamitous of his time in office. The failure to impose transitional controls on eastern European migration in 2004 led to the rise of Farage and Brexit. And perhaps most profoundly of all, the decision to ultimately maintain rather than reform the globalised neoliberal consensus bequeathed by the Conservatives, which left Britain so exposed to the financial crisis of 2008. This, like his misjudgements on Iraq and immigration, was an error of optimism. Blair believed in a modern world that never came to pass. Instead, the one he passed on to us is darker and meaner.\nAnd yet, Blair has adapted to the modern world more effectively than the Britain he handed over in 2007. He remains not only the most consequential prime minister of the 21st century, but also – by some distance – its most influential former one. In the nearly two decades since leaving office, he has built a global private empire, fusing high finance and politics in a way that has restored much of the influence he appeared to surrender. In the secretive, Trump-era landscape that has emerged, Blair’s network has not shrunk but strengthened. Today, he is closer to – and more influential with – some of the world’s most powerful men, from Donald Trump, Narendra Modi, Mohammed bin Salman, Benjamin Netanyahu, than the current prime minister.\n2. Nigel Farage\nIn November 2000, Nigel Farage made his first appearance on the BBC’s Question Time programme. He represented a fledgling Eurosceptic party called Ukip. He spoke about an EU army. He said the mainstream politicians had “deceived” the public for 30 years. He said he was the man to change all that. Oh, how we laughed. Tony Blair had his feet up in the No 10 den – he was thinking about plumping for the eurozone and riding easily towards a second election landslide.\nAt the quarter turn of this century, Farage is the favourite to win the next general election and become the prime minister of the United Kingdom. Through all the dazzling technological changes of these past 25 years, Farage has adapted while his rivals fossilised.\nHis instinct for the public mood has followed him through every conceivable medium. He has moved from the pages of the Daily Express in its post-Beaverbrook senescence, through chummy banter with Ant and Dec in the I’m a Celebrity… jungle, to the world of TikTok and Elon Musk’s X. On Musk’s platform, he makes thousands of pounds a year “monetising” the same anti-immigration message he propounded in November 2000. What once ostracised him now helps finance him.\nUntil now, the Brexit referendum had been Farage’s most notable “achievement”. Yet, Brexit’s evident failure does not seem to have halted his rise. If anything, it has only intensified the popular resentment towards the establishment that always propelled Farage. Even the autumn allegations that he made anti-Semitic and racist comments as a student at public school (accusations that he has denied) have made little dent in Reform’s popularity.\nFarage is not a man out of time: much of the West is helmed by men of elite backgrounds who possess an instinct for national atavism. Farage is part of a worldwide right-populist insurgency that is – as things stand – the great political trend of our time. Through his active friendship with Donald Trump, and his common identification with European populists such as the Rassemblement National enfant terrible Jordan Bardella (a recent lunch companion), Farage has come to seem not just a national political figure, but the Anglo node in a globalised nationalist network. In several years, he and his allies could well occupy the chambers and chancellories of the core Western nations.\nA government and nation led by Nigel Farage is not what any other 21st-century prime minister in the UK wanted, or expected. Tony Blair believed he was building a country that embraced Europe and globalisation, that made a socially conscious capitalism its accepted economic system, that gradually shed its inherited prejudices in favour of tolerance and fraternity. All the while, Farage’s political project sharpened in focus: his reputation grew until the point where he could look his sparring partner from the 2005 European Parliament in the eye. This became a nation fit for Farage. Failures at the top and bitterness below, decay, fits of paranoia; delusions, disillusion, dissolution: it is what Farage reaps and sows.\n1. JK Rowling\nJK Rowling changed Britain. But, perhaps uniquely on this list, she not only shaped Britain’s imaginative understanding of itself, but also the world’s imaginative understanding of Britain.\nThe Harry Potter books alone might be reason enough for Rowling to take the top spot in this list. Not since Agatha Christie or Charles Dickens has Britain produced an author who was able to cast such a spell over the world. In total, the series has sold more than 600 million copies worldwide; their film adaptations made $25bn on their own. There is a spin-off trilogy, a new TV series, a Warner Brothers studio tour, a theme park based just north of London, endless gimmicky merchandise shops, fan fiction and a generation of adults who play recreational Quidditch and say things like, “I’m more of a Hufflepuff, really.” Criticism of the series has focused on its debt to Victorian boarding-school stories, from the Tom Brown novels to Kipling’s Stalky and Co. Have you been to York recently? Walk around parts of the country today and you could be forgiven for thinking Britain itself had become more of a Harry Potter imitation than Harry Potter was an imitation of a lost Britain.\nHow do you follow that up? Her fans may cite her critically acclaimed crime fiction series Cormoran Strike, written under a pen name, Robert Galbraith, which paints a vision not of a lost Britain, but one of dark, conspiratorial violence and pain. What really ensures Rowling the top spot in this list, though, is her political as well as cultural impact. In 2014, JK Rowling threw her cultural and financial weight behind the Better Together campaign to stop Scottish independence. Her importance in that victory is often overlooked, but the £1m donation she made in June 2014 was the single largest of the entire campaign and came at a vital moment. Alongside Gordon Brown, Rowling was crucial in allowing the United Kingdom to limp on.\nYet this would not be Rowling’s last foray into political controversy. Since a 2020 essay expressing her concern about the importance of biological sex in transgender identity, Rowling has become the figurehead of the global “gender-critical” movement. In the process, she lost her status as the universally adored creator of Harry Potter and instead became a polarising participant in the ongoing gender wars. She did not shy away from the criticism that came her way; instead, she has become ever more outspoken, directly funding gender-critical campaigns – culminating in this year’s seismic legal battle over the Equality Act and the definitions of “man” and “woman.”\nWhatever one’s perspective on Rowling or gender politics, the landscape has shifted. The transgender movement, once gaining ground throughout the late 2010s, has stalled in the UK; polling reflects declining support for trans rights and a rise in negative sentiment. To some, Rowling’s influence has been malign, stoking hostility towards an already marginalised minority. To others, she is a hero: the most prominent defender of women’s rights in Britain. Irrespective, as both writer and activist, she has done more than any other 21st-century Briton to define this country both to itself and to the rest of the world. We live in a UK shaped by the mind – and the pen – of its most pre-eminent activist-author.\n[Further reading: The dead dream of the millennium]",
  "word_count": 7841,
  "scraped_at": "2026-02-14T12:13:34.520069"
}