{
  "article_id": "5067d43bc7af",
  "url": "https://www.theglobeandmail.com/life/style-advisor/article-new-york-fashion-week-canadian-designers/",
  "title": "Five Canadian designers who felt right at home at New York Fashion Week",
  "date": "20240916T171500Z",
  "domain": "theglobeandmail.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "New York Fashion Week has been maligned recently for its lack of heavy hitters – many of its biggest fashion designer names have either faded away, gone an entirely commercial route or decamped to show in other cities. But as a result, the city has become the perfect showcase for young talents and fledgling brands looking to stage more casual and clever showcases.\nLast week, the city’s Spring 2025 runway calendar came alive with a dog pageant, a strip show and a party on the Staten Island ferry. In the middle of it all, these Canadian designers felt right at home.\nBORDEN\nEugene Marshall has been working at the luxury ecommerce site Ssense since 2012, where he’s shapeshifted from a stylist to head merchandiser. While there, he built an in-house community of fans of his style who encouraged him to start his own line. Having studied fashion design at Montreal’s La Salle College, he’s going back to his roots with Borden, a line that debuted as part of the Black in Fashion Council’s showcase at the Water Street Associates building in Manhattan’s financial district. Named after Marshall’s grandmother, Irene Borden, who favoured uniform dressing, the label focuses on minimalist staples that layer easily into existing wardrobes – Marshall’s own personal styling kit, so to speak – in high-quality fabrics produced in Italy and Portugal. The line, which starts at $160 for a simple low cut tank top and maxes out at $1,200 for a floor-length wool duster coat, aligns to Marshall’s “one paycheque rule,” meaning they don’t break the bank. “I believe fashion should be easy and that fabric is important, and that’s how all this came together,” he says.\nLITERARY SPORT\nA few days before fashion week officially kicked off, a group of Toronto creatives including skincare guru Fran Miller and stylist Jackie McKeown brought Literary Sport, a chic new line of upscale running gear to SoHo. At the Jacqueline Sullivan Gallery, it was showcased alongside an installation of gauzy pink curtains and archival design objects. Founded by avid runners M. Bechara and Deirdre Matthews, the line proposes a decidedly untraditional take on activewear - think Japanese merino wool T-shirts, double-knit track pants and a soft, lightweight Italian tank top – that double as elegant pieces for every day. “Why am I changing my personality when I run?” was a question Matthews asked herself before hiring a technical designer and enlisting Miller and McKeown as co-creative directors. Literary Sport says you don’t have to.\nWho needs an iron? Pack these wrinkle-free clothes instead on your next work trip\nMEJURI\nMejuri, which operates a smattering of boutiques across Manhattan and Brooklyn, opted to debut its latest jewellery collection with a short film series, New York Minute, that simultaneously premiered at the Toronto International Film Festival and during a party just after New York Fashion Week. Directed by indie darling Gia Coppola, the series is a slice-of-life style peek into the real lives of young women in the city as they navigate the responsibilities that come with entering their 30s. “The goal is for our community to see reflections of themselves in these individuals,” says Noura Sakkijha, Mejuri’s founder. Continually on the hunt for new ways to tell the brand’s story, Sakkijha felt New York was the perfect setting. “The city’s eclectic neighbourhoods and authentic communities mirror a wide range of experiences, making it an exceptionally powerful backdrop for our brand,” she says.\nGrey hair is having a high-fashion moment this fall\nMARINA MOSCONE\nVancouver-born Marina Moscone was feeling feminine this season. In the past year and a half, she got married and gave birth to her first child, inspiring her Spring 2025 collection of colourful dotted and hand-smocked silks in relaxed silhouettes showcased at an Italian restaurant in NoHo. “I think my son brought out a softness that was probably always there but not necessarily on the forefront of my work,” she says. He was there cooing in Moscone’s mother’s arms as the designer walked guests through her latest pieces – a midnight blue and maroon dotted bias-cut silk column dress with edges that tied together like scarves; an ivory utility trouser in lightweight crinkle silk that was bonded to retain its texture; and hand-embroidered smocked dresses that were shown with and without sheer overlays. In the middle of all the texture play were bubbled florals – cleverly created by laying a polka dot silk flat and then joining four points together to create the shape – that stood out on a minidress with a sheer organza voile with a bead added to the centre of each flower. “[The pieces] are meticulous but I still want them to feel relaxed,” says Moscone, who opted to style the collection with slippers reminiscent of her new mom-on-the-go uniform.\nKOTN\nKotn hosted the Kotn Cup, a soccer match inspired by El Nady, community sporting clubs in Cairo, that doubled as a launch for its limited-edition, Egyptian-inspired jerseys. The match, comprised of local teams from New York’s amateur league, NYC Footy, spilled across Brooklyn Bridge Park’s field, as stylish onlookers watched on the sidelines with a healthy dose of enthusiasm that’s rarely exhibited by those typically seated front row at a fashion show.",
  "word_count": 869,
  "scraped_at": "2026-02-14T12:17:40.893511"
}