{
  "article_id": "506e30cf0321",
  "url": "https://www.the42.ie/france-england-opposition-guide-ireland-wnt-6343672-Apr2024/",
  "title": "How are Ireland opponents France and England shaping up for crunch qualifiers ? ",
  "date": "20240403T183000Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "IRELAND FACE TWO of the world’s top three over the coming days as they open their Euro 2025 qualifying bid.\nEileen Gleeson’s side are in an extremely difficult group, with Sweden the other European heavyweight joining them.\nThe top two qualify directly for next summer’s finals tournament in Switzerland, while the bottom two navigate play-offs against lower-ranked opposition later this year.\nIreland’s campaign begins in Metz on Friday [KO 8.10pm Irish time, RTÉ 2], before they welcome European champions England to the Aviva Stadium next Tuesday [KO 7.30pm, RTÉ 2].\nFrance\nJust how good are they?\nFor whatever the Fifa World Rankings are worth, Les Bleus are third. Ireland are 24th.\nTheir star-studded squad underlines the massive challenge facing the Girls In Green, with no less than 10 Champions League winners included. Most of their players are based in France, though there is a healthy smattering across England, America, Spain and Italy.\nWorld Cup and European Championship regulars but yet-to-be winners, France are an experienced, powerful outfit. They like to play dynamic, attacking football, generally in a 4-3-3 formation, but can be frustrated if things don’t go their way.\nThey flexed their considerable muscle as they beat Ireland 3-0 in a World Cup warm-up game at Tallaght Stadium last July, the dam bursting before half time.\nFrance went on to lose on penalties to hosts Australia in the World Cup quarter-finals, and bounced back by reaching the recent Nations League final, where they were beaten by Spain.\nThe electric Marie-Antoinette Katoto and all-time leading goalscorer Eugénie Le Sommer are among their biggest threats, but their squad overall is frighteningly good.\nWho is their coach and captain?\nFrance are coached by Hervé Renard — who you may remember as the Saudi Arabia boss who masterminded defeat over eventual champions Argentina at the 2022 World Cup in Qatar.\nThe two-time Africa Cup of Nations winner took charge ahead of last summer’s World Cup. He steadied the ship after the exit of Corinne Diacre, but Renard is set to leave his role after the Olympic Games this summer.\nWendie Renard, no relation, is their captain. The towering Lyon centre-back is one of the best in the world, and has a commanding presence in both penalty areas. She holds seven Champions League winner’s medals.\nWhat’s Ireland’s record against them?\nA 0-0 draw at Dalymount Park in 1978 is as good as it gets. France have won their 10 other meetings, while Ireland have scored just twice against them.\nAnything else I should know?\nPSG defender Élisa De Almeida has been ruled out with a hamstring injury, and Renard has chosen not to replace her. He has no shortage of other options.\n***\nEngland\nJust how good are they?\nThe Lionesses are the defending European champions. They reigned supreme on home soil in 2022 and will be hellbent on retaining their crown. They reached the World Cup final last summer, but fell short to Spain.\nLike France, England have named a hugely impressive squad for this window. It’s full of Women’s Super League stars, with other key players coming from Barcelona and Bayern Munich.\nEngland struggled after the World Cup, finishing second in their Nations League League A group and missing out on the Olympics, but they have started 2024 with a vengeance. They hammered Austria 7-2 and Italy 5-1 in February friendlies. (Ireland drew 0-0 with Italy.)\nA possession-based team, they alter between a 4-3-3 and 3-5-2 formation and love to score goals. From Lauren James to Beth Mead and Alessia Russo, they have no shortage of talent to do so. It just depends on who is selected; their depth is striking with plenty of game changers on the bench too.\nEngland’s Barcelona duo, defensive midfielder Kiera Walsh and marauding full-back Lucy Bronze, are key players, while Mary Earps is one of the best goalkeepers in the world.\nTL;DR: They are very, very good.\nWho is their coach and captain?\nDutch mastermind Sarina Wiegman has been at the helm since 2021.\nShe is one of the top coaches in the history of women’s football. Wiegman — four-time Best Fifa Women’s Coach winner — guided the Netherlands to Euro 2017 glory, before they were runners-up at the 2019 World Cup.\nShe repeated the trick with England, and also steered them to 2023 Finalissima success.\nLeah Williamson is the Lionesses’ captain. The Arsenal defender was handed the armband permanently by Wiegman in 2022 and has gone from strength to strength in the role.\nShe’s back in the squad after a year, working towards her international comeback after recovering from an ACL injury. But Williamson — who often plays in midfield for England as well as centre-back — remains a doubt. A knee issue saw her substituted at half time of Sunday’s Conti Cup final, while she trained individually on Tuesday.\nWhat’s Ireland’s record against them?\nThe sides haven’t played competitively since 1987, when England beat Ireland 1-0 in an international friendly at Dalymount Park.\nThey did face off in a training game in January 2014 in La Manga, Spain, where the scoreline was the same. England have won all of their seven competitive games, scoring 29 goals in comparison to Ireland’s one.\nAfter a 37-year wait — though no shortage of familiarity between players in the WSL — the countdown is on for Ireland and England to renew their rivalry.\nAnything else I should know?\nAside from Williamson, England appear to have no other injury concerns. Chelsea defender Millie Bright is the most high-profile absentee.\nWhile all eyes will be on Metz on Friday night, it will be worth keeping tabs on the Lionesses’ opener against Sweden at Wembley Stadium [KO 8pm, ITV].\n- You can view the France and England squads to face Ireland here>",
  "word_count": 960,
  "scraped_at": "2026-02-14T12:22:39.127283"
}