{
  "article_id": "50c436c9b6b6",
  "url": "https://abcnews4.com/news/local/ncaa-pilot-study-finds-widespread-social-media-harassment-of-athletes-coaches-officials-south-carolina-sports-wciv-abc-news-4-2024",
  "title": "NCAA pilot study finds widespread social media harassment of athletes , coaches & officials",
  "date": "20241012T021500Z",
  "domain": "abcnews4.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "NCAA pilot study finds widespread social media harassment of athletes, coaches & officials\nCOLUMBIA, S.C. (AP) — An NCAA study on social media abuse of athletes, coaches and other officials during championship events found nearly one in five posts that were flagged by an AI-based algorithm and determined to be abusive involved sexual harassment and 12% were related to sports betting, according to results of the pilot study released Thursday.\nThe college athletics governing body's findings of its first online harassment study using Signify Group's Threat Matrix examined more than 72,000 messages flagged by an algorithm. Over 5,000 of those posts were confirmed to contain abusive, discriminatory or threatening content and were reported to social media companies.\nThe study conducted during 2023-2024 examined social media posts related to championship-level events in six sports: baseball, basketball, gymnastics, football, softball and volleyball.\nOf the abusive posts, the study found 80% were directed at March Madness athletes, with female basketball players receiving about three times more abusive messages than their male counterparts.\nREAD MORE | \"College football chaos helped Swinney remind No. 10 Clemson not to overlook Wake Forest.\"\nThe study cited one unidentified athlete who received more than 1,400 harassing messages in a two-week span.\n\"The risks and mental health challenges associated with being a victim of online abuse or threats are real and have a direct and immediate effect on athletes, coaches, officials, and their families,\" the NCAA wrote in its report. \"This can impact them on both a personal and professional level, and ultimately affect their wellbeing and ability to perform at their best.\"\nThe NCAA said sports-betting harassment was spread across all the championships covered in the study.\nRacial comments made up about 10% of the abusive messages studied, but the survey found the men's and women's NCAA basketball tournaments were a focus of such content.\n\"Toxic online fans resorted to racist mockery, comparing players to monkeys and labelling them as thugs,\" the NCAA's study found.\nREAD MORE | \"South Carolina looks to bounce-back against No. 7 Alabama after embarrassing performance.\"\nWomen's basketball players, teams and officials received such treatment, the NCAA said.\n\"The level of Dogwhistle content during the (basketball) Women's championships should be highlighted as well in connection with racism,\" the governing body said in the report.\nThe study monitored the accounts of 3,164 student-athletes, 489 coaches, 197 game officials, 165 teams and 12 NCAA official channels using Signify Group's artificial intelligence Threat Matrix. It identified varying areas of online abuse and threats, and established 16 categories in which to organize messages that were deemed to be abusive. The NCAA told The Associated Press the algorithm's flagging system was based on a series of issue-specific keywords and human analysts organized abusive messages into the categories.\nViolence was found to be the subject of 6% of all verified abusive and threatening content, according to the study.\nCollege football at the FBS level, the men's basketball tournament and volleyball all received \"high proportions of violent, abusive or threatening content.\"\nREAD MORE | \"The Citadel Athletic Director Mike Capaccio announces retirement.\"\nOther threatening messages were connected to homophobia and transphobia, doping and steroid use and match officials.\nThe NCAA said risks come across all sports, saying in some instances volleyball and gymnastics generated more \"concerning\" abusive messages than March Madness or the College Football Playoff.\nThe NCAA report said social media abuse and threats can have a significant effect on athletes and others involved in college sports.\nEven if an athlete who is the target of such abuse says they are fine, \"this should not be assumed to be the case,\" NCAA said.\nSuch targeting can continue after a welfare check, \"which is why action needs to be taken to protect them long-term,\" the organization said.\nNCAA president Charlie Baker said the study is evidence of what some athletes deal with as they go through their time in college.\n\"We will exhaust all options to reduce the harassment and vitriol student-athletes are experiencing too often today,\" he said in a statement.",
  "word_count": 671,
  "scraped_at": "2026-02-14T12:10:43.858049"
}