{
  "article_id": "50d25f4f0578",
  "url": "https://www.hindustantimes.com/world-news/more-wins-more-drinks-opening-hours-in-pubs-could-extend-in-england-and-wales-during-women-s-euros-101740408366147.html",
  "title": "More wins , more drinks : Opening hours in pubs could extend in England and Wales during Women Euros",
  "date": "20250224T151500Z",
  "domain": "hindustantimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "More wins, more drinks: Opening hours in pubs could extend in England and Wales during Women's Euros\nMore wins, more drinks: Opening hours in pubs could extend in England and Wales during Women's Euros\nLONDON — Soccer fans in England and Wales might be allowed to spend more time in pubs if their teams go far at the Women’s European Championship being held in Switzerland in July.\nThe British government is launching a four-week consultation to discuss whether pubs can extend their opening hours from 11 p.m. to 1 a.m. should England or Wales reach the semifinals or final of Euro 2025.\nBritain’s home secretary has the power to extend licensing hours for occasions of “exceptional international, national or local significance,” the government said Monday.\nEngland's women's team — whose players are nicknamed the Lionesses — will be defending the title won on home soil in 2022. It was the nation's first major international title since the men's team won the World Cup in 1966.\n“The Lionesses showed us in 2022 what it means to bring football home,” said Diana Johnson, the government’s policing minister, “and now we want to make sure the whole nation can come together again to cheer on our teams.”\nThe consultation period will hear views from the public, licensing authorities and hospitality industry before any plans are approved by the government.\nHospitality bosses said pubs staying open later would provide a boost in difficult financial times for the trade.\n“The exponential growth in the popularity of women’s football presents an incredible moment for both the sport and the night-time economy,” said Michael Kill, chief executive of the Night Time Industries Association.\n“The success of the Lionesses in recent years has inspired a new generation of supporters, and it is only right that we embrace this enthusiasm by ensuring fans have the opportunity to enjoy the matches in social settings.”\nEuro 2025 runs from July 2-27.\nsoccer: /hub/soccer\nThis article was generated from an automated news agency feed without modifications to text.",
  "word_count": 336,
  "scraped_at": "2026-02-14T13:05:52.150504"
}