{
  "article_id": "50dcf7dc83e0",
  "url": "https://www.winnipegfreepress.com/canada/2026/01/01/year-in-review-a-look-at-events-in-january-2025-2",
  "title": "Year in review : A look at events in January 2025 – Winnipeg Free Press",
  "date": "20260101T090000Z",
  "domain": "winnipegfreepress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Year in review: A look at events in January 2025\nAdvertisement\nA look at news events in January 2025:\nRead this article for free:\nor\nAlready have an account? Log in here »\nTo continue reading, please subscribe:\nMonthly Digital Subscription\n$1 per week for 24 weeks*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $4.00 plus GST every four weeks. After 24 weeks, price increases to the regular rate of $19.95 plus GST every four weeks. Offer available to new and qualified returning subscribers only. Cancel any time.\nMonthly Digital Subscription\n$4.99/week*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $19.95 plus GST every four weeks. Cancel any time.\nTo continue reading, please subscribe:\nAdd Free Press access to your Brandon Sun subscription for only an additional\n$1 for the first 4 weeks*\n*Your next subscription payment will increase by $1.00 and you will be charged $16.99 plus GST for four weeks. After four weeks, your payment will increase to $23.99 plus GST every four weeks.\nA look at news events in January 2025:\nRead unlimited articles for free today:\nor\nAlready have an account? Log in here »\nA look at news events in January 2025:\n1 – Nearly all of Puerto Rico started 2025 in the dark after a blackout hit the U.S. territory early Tuesday. More than 1.3 million clients were without electricity and officials say it could take up to two days to restore power.\n1 – In New Orleans, hours after ringing in the new year, 10 people died and, 30 others were injured after a car plowed into a crowd on the famed Canal and Bourbon Street. The FBI says the driver of the vehicle was killed in a firefight with police following the attack around three hours after celebrating the start of 2025.\n1 – Albertans started paying a tax on vaping products to fall in line with existing federal taxes. The governments said the tax is meant to discourage vaping, especially among young people.\n1 – Authorities are trying to determine if a deadly truck explosion at Donald Trump’s hotel in Las Vegas is connected to an early morning truck attack in New Orleans. The Tesla Cybertruck exploded, killing a suspect inside the vehicle. Authorities say the truck was a rental and had firework mortars in the back.\n2 – The new year means a new leading country at the Group of Seven. Canada has taken over this year’s presidency of the G7 and will host world leaders in Kananaskis, Alta., in June.\n2 – A new report on executive compensation found Canada’s 100 highest-paid CEOs earned on average $13.2-million in 2023. It’s the third biggest year for CEO pay, after 2021 and 2022 broke records. The Canadian Centre for Policy Alternatives also calculates that by 10:54 this morning, the average CEO on the list will have made over $62,600 — the average annual income for a Canadian worker.\n2 – A new study says endangered North Atlantic right whales should live well past 100, but they’re dying at around 22. The study published in the journal “Science Advances” suggests their lives are being cut short by climate change, ship strikes and entanglements with fishing gear.\n2 – A Holocaust survivor and the oldest living Olympic medal winner has died at age 103. Hungary’s state news agency says Agnes Keleti died in Budapest after being hospitalized with pneumonia on Dec. 25. Forced off her gymnastics team in 1941 because of her Jewish ancestry, Keleti went into hiding in the Hungarian countryside where she survived the Holocaust by assuming a false identity and working as a maid. She later won a total of 10 Olympic medals in gymnastics, including five golds, for Hungary in 1952 and 1956.\n2 – Nearly 200 dinosaur tracks dating back 166 million years have been discovered in England. A worker digging up clay in a quarry in Oxfordshire last summer noticed unusual bumps and that led to a week-long excavation in June that unearthed five extensive trackways that formed part of a “dinosaur highway.” Researchers say four sets of tracks were made by herbivores called sauropods. One track was made by the ferocious Megalosaurus, a carnivore with a distinctive triple-claw print.\n2 – Former Liberal cabinet minister Marco Mendicino announced he wouldn’t be running in the next federal election. In a statement posted on social media, Mendicino called the move “the right decision at the right time,” noting he’s been encouraged to play a leadership role in Toronto. He also says he has disagreed with the direction of the federal government, especially when it comes to Canada’s foreign policy on the Israel-Hamas war.\n2 – Canada was eliminated in the quarterfinals at the world junior hockey championship in Ottawa. The hosts lost to Czechia 4-3. It’s a repeat of last year’s quarterfinals in which Canada was beaten by the Czechs en route to a disappointing fifth-place finish in Gothenburg, Sweden.\n3 – Prime Minister Justin Trudeau attended a virtual meeting of the Canada-U-S relations cabinet committee as Donald Trump’s inauguration quickly approaches. Trump threatened to impose 25 per cent tariffs on Canadian and Mexican imports unless both countries beef up security at the American border.\n3 – Google transferred $100 million to the Canadian Journalism Collective in exchange for an exemption from the Online News Act. The collective will distribute the money to media businesses whose work was shared or repurposed by Google. The U.S. tech giant agreed to pay the money in 2023 to exempt it from federal legislation that compelled Google and Meta to pay for their use of journalism. Meta has avoided having to make any payments by blocking access to Canadian news on its platforms.\n3 – Prime Minister Justin Trudeau signed a book of condolences at the U.S. Embassy in Ottawa for former U.S. president Jimmy Carter, who died late last month at the age of 100.\n3 – Canada is pausing permanent residency sponsorship applications for parents and grandparents. That’s according to a ministerial directive published in the Canada Gazette, which states the government will focus on processing applications it received last year.\n4 – Canadian-American actor Michael J. Fox received the Presidential Medal of Freedom. Fox was one of 19 recipients who received the highest U.S. civilian honour from President Joe Biden, along with former secretary of state Hillary Clinton and singer Bono.\n4 – A Japanese woman who Guinness World Records had listed as the oldest living person, has died. Officials in the Japanese city of Ashiya in central Japan say Tomiko Itooka died on Dec. 29 at a care home at the age of 116. She was born on May 23, 1908, and became the oldest person last year following the death of 117-year-old Maria Branyas.\n5 – Al MacNeil, an Original Six-era defenceman and Stanley Cup-winning coach, died at age 89. After a playing career between 1955 and 1969, MacNeil won a Cup as a rookie head coach with the Montreal Canadiens in 1971 and later with the Calgary Flames in 1989.\n6 – Prime Minister Justin Trudeau resigned as prime minister and leader of the Liberal Party of Canada after a decade in power, following numerous calls for his resignation from within his own party and from other parties. He will stay on as PM until a new party leader is chosen.\n6 – U.S. Congress certified Donald Trump as the winner of the 2024 presidential election. Lawmakers convened under heavy security and a snowstorm to certify the vote, which came without a challenge. That’s in stark contrast to the violence seen at the U.S. Capitol four years ago. The legacy of Jan. 6, 2021, hung over the proceedings as the Republican who tried to overturn the previous election is legitimately returning to power.\n6 – A U.S. federal judge found Rudy Giuliani in contempt of court in his multimillion-dollar defamation suit from two Georgia election workers. The judge ruled the former New York City mayor failed to properly comply with evidence production requests over the last few months. Giuliani was ordered to pay the two Georgia election workers $148 million after falsely accusing them of tampering with ballots in the 2020 election.\n7 – American singer-songwriter Peter Yarrow died at his home in New York at age 86. He was one-third of the folk-music group Peter, Paul and Mary. The group rose to overnight fame in the early 1960s when they blended their voices in stunning harmonies as they sang out against war and social injustice.\n8 – Prime Minister Justin Trudeau said there isn’t a “snowball’s chance in hell” that Canada would become part of the United States. He called an in-person meeting with premiers in Ottawa to address Canada’s relationship with the United States after Donald Trump said he’d use “economic force” against Canada and mused about erasing the international border.\n8 – Thousands of people have fled as wildfires burn out of control in and around Los Angeles. California firefighters were battling three wind-whipped wildfires. One fire in the Pacific Palisades neighbourhood has destroyed homes, clogged roadways as tens of thousands fled as officials prepared for an even worse overnight.\n8 – Finance Minister Dominic LeBlanc said he would not run for the Liberal party leadership. LeBlanc said he’d keep his full attention on his job as cabinet minister and dealing with the threat of U.S. tariffs.\n8 – Prime Minister Justin Trudeau attended a ceremony commemorating the anniversary of the downing of Ukraine International Airlines Flight 752. Eighty-five Canadian citizens and permanent residents were among those killed when Iranian missiles shot down the plane five years ago.\n9 – A fast-moving fire was raging in the Hollywood Hills area of Los Angeles, about 1.5 kilometres from the Hollywood Walk of Fame. About 130,000 people were under evacuation orders from six out-of-control L.A. wildfires still raging overnight. A\n9 – Pilots and aircraft from B-C and Quebec begun to help in Southern California’s fire fight. Chinook helitankers and a smaller Sikorsky craft belonging to Coulson Aviation from Port Alberni joined the front line of fast-moving flames around L-A’s Palisades neighbourhood and in Altadena. Quebec also had planes in the air, including a pair of Canadian-made water bombers\n9 – A state funeral for former U.S. president Jimmy Carter was held in Washington, D.C. Prime Minister Justin Trudeau was among the leaders at Washington National Cathedral to pay their respects.\n10 – Donald Trump was sentenced to an unconditional release in his New York hush money case. The outcome cements Trump’s conviction of falsifying records while freeing him to return to the White House unencumbered by the threat of a jail term or a fine.\n10 – Two Alberta men were sentenced for their roles in the illegal Coutts border blockade in 2022. Marco Van Huigenbos has been sentenced to four months in jail while Gerhard Janzen received a three-month sentence to be served in the community. The pair were convicted of mischief for their part in the blockade that tied up cross-border traffic for two weeks to protest COVID rules and vaccine mandates.\n10 – The Public Health Agency of Canada said federal funding for COVID-19 vaccines will stop this year and the provinces and territories will be responsible for buying them.\n11 – Sudanese officials said the country’s military and its allies took back a strategic city in the African country from the rebel Rapid Support Forces. It was a major blow to the notorious paramilitary group that the U.S. accuses of committing genocide in Sudan’s ongoing civil war.\n12 – Actress Kim Yaroshevskaya, who brightened the lives of several generations of Quebec children, died at the age of 101. The Russian-born actress is probably best known as the story-telling Fanfreluche doll on Radio-Canada TV from the late 1960s and early 1970s. A few years later, she enthralled a new generation of children in the role of Grandmother on the cult show “Passe-Partout.”\n12 – A star of U.S. daytime television Leslie Charleson died at 79. Charleson began playing the role of Monica Quartermaine back in 1977 on “General Hospital” and had appeared on the show longer than anyone. She was a four-time Daytime Emmy nominee.\n13 – The Canadian women’s soccer team named former England captain Casey Stoney as its new coach. Stoney signed a three-year contract with Canada Soccer that runs through the next World Cup, with an option for 2028. The team has been without a permanent coach since Bev Priestman was sent home during the Paris Olympics last summer due to the drone-spying scandal.\n13 – The Insurance Bureau of Canada said last summer stood out as the most destructive season in Canadian history for insured losses. A new report says the cost of insured damage caused by severe weather in 2024 totalled roughly $8.5 billion.\n13 – The federal government settled a class-action lawsuit with military members who were subjected to racism during their time in the Armed Forces. The settlement is worth up to $150 million and individual payments will range from $5,000 to $35,000. It also included a pledge to make systemic changes to the Armed Forces’ culture.\n14 – Actor Jon Hamm is named the 2025 Man of the Year by Harvard University’s Hasty Pudding Theatricals. Coming to fame playing executive Don Draper on AMC’s “Mad Men” will be recognized for his lasting and impressive contributions to the world of entertainment.\n15 – Canada’s premiers were in Ottawa to meet with Prime Minister Justin Trudeau and his cabinet about Donald Trump’s threat to slap tariffs on all Canadian goods. The group talked about the country’s planned response.\n15 – Canada’s released its response to Donald Trump’s border complaints, which included 60 new drones and two new helicopters. They’re part of Ottawa’s $1.3-billion plan to boost border security in response to Trump’s complaints of drugs and illegal immigration.\n15 – Prime Minister Justin Trudeau said he won’t run for re-election in his Montreal riding in the next general election.\n16 – A Major League Baseball broadcast legend who earned the moniker “Mr. Baseball” during his playing career has died. Hall of Famer Bob Ueker was 90.\n16 – Former Bank of Canada governor Mark Carney launched his bid for the leadership of the federal Liberal party. Carney’s announcement at an Edmonton community centre ended nearly a decade of speculation about his political ambitions.\n16 – A 12-year-old chess prodigy from Ontario has become Canada’s youngest international master. Aaron Reeve Mendes came in first at the 2024 North American Youth Chess Championship held last month in Virginia. Mendes spent his early childhood in India, where he says his parents and teachers supported him in his chess journey. The young player and his sister both became Canadian citizens last year.\n16 – Award-winning British stage actor Joan Plowright, the widow of Laurence Olivier, has died. She was 95. Her family says Plowright died at a retirement home for actors in southern England, surrounded by her loved ones.\n17 – A SpaceX Starship rocket was destroyed during a test flight. Elon Musk’s company said the Starship broke apart just eight and a half minutes into the flight. The spacecraft was supposed to soar around the world in a suborbital flight pattern, similar to previous test flights.\n17 – Archeologists excavating in the buried ancient Roman city of Pompeii unearthed a new treasure — a private bathhouse built two-thousand years ago.\n17 – Chrystia Freeland threw her hat in the ring to replace outgoing Liberal leader and Prime Minister Justin Trudeau, announcing her official campaign launch was days away.\n17 – The U.S. Supreme Court unanimously upheld the federal law banning TikTok beginning Jan. 19 unless it’s sold by its China-based parent company. The court maintaining the app is a risk to national security due to its ties to China.\n17 – President-elect Donald Trump announced he would take the oath of office from inside the Capitol Rotunda on Monday due to forecasts of intense cold weather. The weather forecast for Washington, D.C., is calling for a high windchill factor and could take temperatures into severe record lows.\n17 – Israel’s cabinet approved a deal for a ceasefire in Gaza that would release dozens of hostages and pause the 15-month war with Hamas. The government announced the approval after an hours-long meeting that went well past the beginning of the Jewish Sabbath.\n18 – Karina Gould became the youngest candidate so far in the federal Liberal leadership race. The 37-year-old announced her run to replace Prime Minister Justin Trudeau in a social media post.\n18 – South Korea’s impeached President Yoon Suk-Yeol was formally arrested days after he was apprehended at the presidential compound. He now faces the possibility of imprisonment after his ill-fated declaration of martial law last month.\n18 – The TikTok app is removed from app stores in the United States ahead of the official deadline for the federal law banning the popular social media platform. By 10:50 p.m. EST, the app was inaccessible on both Apple and Google’s app stores. Both platforms are prohibited from offering the video app under a law that required TikTok’s China-based parent company ByteDance to sell the platform.\n19 – Israel said the Gaza ceasefire was now in effect following an almost three-hour delay. The latest update comes from Prime Minister Benjamin Netanyahu’s office after Hamas officially named the three female hostages it plans to release.\n19 – U.S. President Joe Biden posthumously pardoned Black nationalist Marcus Garvey, who influenced Malcolm X and other Black civil rights leaders and was convicted of mail fraud in the 1920s. A top Virginia lawmaker and advocates for immigrant rights, criminal justice reform and gun violence prevention also received pardons today, one day before Donald Trump’s inauguration.\n20 – Outgoing U.S. President Joe Biden issued several pardons in his final hours in the Oval Office to guard against potential revenge by the incoming Trump administration. Biden pardoned Dr. Anthony Fauci, retired General Mark Milley and members of the House committee that investigated the Jan. 6, 2021, attack on the U.S. Capitol.\n20 – A teen pleaded guilty to charges of killing three girls and wounding 10 other people in a stabbing rampage at a Taylor Swift-themed dance class in England last summer. A judge says 18-year-old Axel Rudakubana faces life imprisonment when sentenced later this week.\n20 – Donald Trump was sworn in as the 47th president of the United States at a ceremony in Washington. Trump overcame impeachments, criminal indictments and a pair of assassination attempts to win another term in the White House. The swearing-in ceremony took place indoors for the first time in 40 years at the Capitol Rotunda because of frigid weather.\n20 – Newly inaugurated U.S. President Donald Trump said he is looking at Feb. 1 as the day he plans to slap Canada and Mexico with 25 per cent across-the-board tariffs. Trump made the statement while signing executive orders at the White House, citing the migration of people and fentanyl crossing the borders. The date comes after Trump officials, speaking anonymously, suggested to reporters that the Republican president would only sign a memorandum telling federal agencies to study trade issues.\n20 – Alberta’s government quietly rescinded its moratorium on new coal exploration and development in the eastern slopes of the Rocky Mountains. Some critics said it means the province has declared open season on renewed coal mining. In a letter to the Alberta Energy Regulator posted to its website, Energy Minister Brian Jean said lifting a 2022 moratorium will “reduce regulatory confusion” around coal mining. Five coal companies are taking the Alberta government to court, seeking more than a combined $15 billion in lost revenues and sunk costs that they say they’re owed as a result of the government policy.\n20 – U.S. President Donald Trump signed an executive order to keep TikTok operating for 75 days. TikTok’s China-based parent ByteDance was supposed to find a U.S. buyer or be banned on Jan. 19. Trump’s order could give ByteDance more time to find a buyer. Close to 170 million American users could not access the platform for more than 12 hours between Saturday night and Sunday morning due to the looming ban.\n20 – U.S. President Donald Trump pardoned, commuted, or vowed to dismiss the cases of all 1,500 people charged with crimes in the Jan. 6, 2021 Capitol riot. Using his clemency powers on his first day back in office, Trump undid the massive prosecution of the unprecedented assault on the seat of American democracy.\n20 – U.S. President Donald Trump has used one of the flurry of executive actions he issued on his first day back in the White House to begin the process of withdrawing the U.S. from the World Health Organization for the second time in less than five years. Trump made a similar move in 2020, only to have former president Joe Biden reverse it in 2021.\n21 – Israel’s Lieutenant-general Herzi Halevi announced his resignation, effective March 6. The country’s top general cited the security failures related to Hamas’ surprise attack that triggered the war in the Gaza Strip. The 2023 attack in southern Israel killed some 1,200 people and another 250 were abducted.\n21 – Canadian multi-instrumentalist Garth Hudson, the last surviving founding member of “The Band” died peacefully in his sleep at the age of 87. Hudson was one of the original members of the influential ’60s and ’70s rock group. He was born in Windsor to musician parents, and was raised in London, Ont.\n21 – A Nevada judge upheld the murder charge of the only suspect to ever be prosecuted in the 1996 killing of rap icon Tupac Shakur. Duane “Keffe D” Davis and his lawyer have argued that he never should have been charged with murder because of immunity agreements he says he reached years ago with federal and local authorities.\n21 – “Wicked” star Cynthia Erivo was named Harvard’s Hasty Pudding Woman of the Year. The theatre group dates back to 1844 and has bestowed its Woman of the Year award on actors like Meryl Streep, Julia Roberts and Annette Bening. Erivo will receive her Pudding Pot award at a celebratory roast on Feb. 5. Actor Jon Hamm is the 2025 Man of the Year and will receive his award at the end of this month.\n22 – Prince Harry settled his privacy invasion lawsuit against Rupert Murdoch’s British tabloids just as his trial was about to begin. The Duke of Sussex has accepted damages and an apology from News Group Newspapers over years of phone hacking and other unlawful intrusion. The company has offered a “full and unequivocal apology” for “serious intrusion” by The Sun newspaper and its now-defunct sister publication the News of the World.\n22 – The Canadian Armed Forces said it’s no longer automatically disqualifying applicants who have attention deficit, anxiety, asthma and allergies. It updated its entry medical standards this month to help increase recruitment numbers.\n22 – Amazon Canada announced it is closing all seven of its warehouses in Quebec. Some 1,700 permanent employees and 250 temporary workers in the province will be laid off. The decision comes amid strained labour relations with unionized employees at the multinational’s warehouse in Laval, Quebec. The online retailer said the closures over the next two months aren’t in response to a unionization drive.\n22 – One of the largest colleges in Canada announced it was suspending dozens of its full-time programs as Ottawa reduces the number of international students in the country. Ontario’s Centennial College says 49 programs will not accept new students in the 2025-26 academic year.\n22 – Emergency Preparedness Minister Harjit Sajjan said he will not be running in the next federal election. He’s the latest member of Prime Minister Justin Trudeau’s front bench who decided to step away.\n22 – Former central banker Mark Carney, former finance minister Chrystia Freeland and Ottawa M-P Chandra Arya officially entered the Liberal leadership race.\n22 – British Columbia’s attorney general said the Supreme Court of Canada has certified the province’s class-action lawsuit against opioid providers. B.C. can now proceed as a representative plaintiff on behalf of other Canadian governments. The litigation aims to recover the costs of treating opioid-related diseases allegedly caused by the industry’s conduct.\n22 – Conservative Leader Pierre Poilievre said he is only aware of two genders — male and female — and that the government should leave people alone. In an interview with CP24 news channel, Poilievre was asked about President Donald Trump signing an executive order declaring the U.S. will only recognize two sexes and that they are unchangeable.\n23 – The Supreme Court of Canada agreed to hear a challenge of Quebec’s secularism law. The Quebec Court of Appeal last year upheld Bill 21, which prohibits teachers, police officers and other civil servants in positions of authority from wearing religious symbols on the job. The National Council of Canadian Muslims, the Canadian Civil Liberties Association and other groups sought leave to appeal that decision to the country’s top court.\n23 – Liberal House Leader Karina Gould submitted her paperwork to enter the party’s leadership race to replace Prime Minister Justin Trudeau. Indigenous M-P Jaime Battiste also confirmed his bid.\n24 – Ontario Premier Doug Ford confirmed he would be calling a snap election next week. This would send residents to the polls on Feb. 27, more than a year before the June 2026 fixed election date. He was using the threat of 25 per cent U-.. tariffs to justify his early election call, saying he wants to secure a mandate to fight against President Donald Trump’s threat.\n24 – The federal government said it will provide a $1 billion loan to Canada Post amid recent financial struggles. Canada Post said the funding will help it maintain solvency and continuing operations but does not solve its structural issues. P\n25 – U.S. President Donald Trump used executive orders to end birthright citizenship in his country. Trump has said since his first administration that he wants to end the constitutional right for those born in the United States. His order this week upends more than a century of precedent.\n25 – Bill Wilson, a hereditary chief and the father of former cabinet minister Jody Wilson-Raybould, has died. She announced his death on social media, saying her father’s life was “one of leadership and striving to make change.” The senior Wilson helped get Indigenous land title and treaty rights enshrined in the Constitution. And he once told Pierre Elliott Trudeau that his daughters, Jody and Kory, would someday become prime ministers.\n25 – Hamas released four female Israeli soldiers held captive for 15 months in a planned exchange for 200 Palestinian prisoners or detainees in Israel. It’s the second exchange since a fragile ceasefire took effect last weekend.\n25 – Pete Hegseth was sworn in as America’s 29th secretary of defence. The ceremony in Washington came less than 12 hours after a dramatic late-night vote in the U.S. Senate installed him as the Pentagon’s leader. Hegseth thanked Vice President J.D. Vance for his tie-breaking vote. The unusually narrow confirmation came after questions from members in both parties over Hegseth’s qualifications to lead the military amid allegations of heavy alcohol use and aggressive behaviour toward women.\n25 – James Crawford becamethe first Canadian skier in 42 years to win the prestigious World Cup downhill in Kitzbuehel, Austria. The 27-year-old from Toronto shared the podium with his third-place teammate Cameron Alexander of North Vancouver, B.C. The last Canadian winner of the iconic downhill in Kitzbuehel was Todd Brooker in 1983.\n25 – The U.S. Senate confirmed Kristi Noem as the country’s homeland security secretary. The South Dakota governor is in charge of a sprawling agency that’s essential to national security as well as President Donald Trump’s plans to clamp down on illegal immigration.\n26 – Around 70 people were killed in an attack at a hospital in Sudan. The World Health Organization says the deaths this weekend happened in the only functional hospital within the besieged city of El Fasher\n27 – The 80th anniversary of the liberation of Auschwitz by Soviet troops was marked at the site of the former Nazi-run death camp in southern Poland. Polish President Andrzej Duda, whose nation lost six million citizens during the Second World War, placed a candle at the Death Wall, where prisoners were executed. Prime Minister Justin Trudeau was in attendance.\n28 – Canada and Poland signed a nuclear energy co-operation deal that will eventually allow Canadian companies to support Polish efforts to begin generating nuclear power. Prime Ministers Justin Trudeau and Donald Tusk signed the Canada-Poland Nuclear Energy Co-operation Agreement. The deal is seen as a way to help reduce Poland’s reliance on coal-fired electricity and enhance energy security.\n28 – Premier Doug Ford met with Ontario’s lieutenant-governor to ask for the dissolution of the legislature. The provincial election will be held on Feb. 27, more than a year before the province’s next fixed election date. Ford has claimed he needs a new mandate to deal with four years of a Donald Trump presidency in the United States.\n28 – One of the hit men who murdered former Air India bombing suspect Ripudaman Singh Malik received a mandatory life sentence. Tanner Fox won’t be eligible for parole for at least 20 years. Fox told the B.C. Supreme Court he was sorry, and was “young and dumb” at the time of the hired killing. Malik was shot dead outside his Surrey, B.C. business in July 2022 with Fox and his accomplice pleading guilty to second-degree murder last October.\n28 – B.C. Green Party Leader Sonia Furstenau stepped down from the party’s helm. She says the party has played an oversized role in B.C. politics despite only five people ever being elected to the legislature. Furstenau lost her own seat in last October’s election when she changed ridings and ran in Victoria.\n28 – U.S. President Donald Trump signed an executive order aimed at curtailing gender transitions for people under age 19. It’s Trump’s latest push to reverse policies set by the Biden administration to protect transgender people and their care. T\n29 – Foreign Affairs Minister Melanie Joly was in Washington, D.C. to meet with America’s new Secretary of State, Marco Rubio, as Canada faces U.S. tariffs landing as early as Saturday. Joly said she still believes diplomacy can fend off U.S. President Donald Trump’s threat to slap Canada with 25 per cent across-the-board duties.\n29 – Ontario’s political party leaders started fanning out across the province for their first official day of a rare winter election campaign. Progressive Conservative Leader Doug Ford triggered the snap election more than a year before the next fixed date. Opposition parties say the early vote is unnecessary and opportunistic.\n29 – The president of a mosque in Quebec said there is a “duty to remember” the six Muslim men who were killed eight years ago. A single bullet hole remains in the wall of the Mosque in order to remind people of the tragedy that happened in 2017.\n29 – The Insurance Bureau of Canada says last year’s Jasper wildfire was the second costliest fire disaster in Canada’s history. It says a revised estimate has increased the total damage costs to $1.23 billion. The fire destroyed one-third of the town’s homes and buildings and forced thousands to flee in July.\n29 – The U.S. Federal Aviation Administration said a passenger jet from Wichita, Kansas, with 64 people on board, collided with an army helicopter carrying three while landing at Ronald Reagan National Airport near Washington D.C. There were no survivors.\n30 – British Columbia’s education minister fired the entire Victoria School Board after the board barred police from schools except in emergencies. Minister Lisa Beare said student safety was at risk. She’s appointed a lone trustee to oversee the district until the next municipal elections, set for the fall of 2026. The school board banned police officers since 2023 on reports some students and teachers don’t feel safe with officers in schools.\n30 – The Canadian Armed Forces named its first Indigenous Knowledge Keeper. Warrant Officer Robert-Falcon Ouellette is a former Liberal member of Parliament who also ran for mayor of Winnipeg.\n30 – Quebec RCMP showed off their new Black Hawk helicopter that will be helping to beef up security at the United States border. Mounties said the chopper will help them cover a vast border area and intervene much more quickly if there is a spike in border crossings.\n30 – The WNBA’s newest franchise, the Toronto Tempo, hired its first general manager. Monica Wright-Rogers was tapped to lead the expansion team that kicks off their season in 2026. Wright-Rogers spent seven seasons in the WNBA as a player.\n30 – U.S. President Donald Trump said his threatened tariffs are coming. Trump said he would slap both Canada and Mexico with 25 per cent tariffs on Feb. 1 over his concerns about drugs and migrants at the border.\n31 – Green Day and Billie Eilish kicked off the massive FireAid benefit concert – a two-venue extravaganza – raising money for Los Angeles-area wildfire relief efforts. All proceeds were to benefit those affected by the fires. The lineup included Lady Gaga, Stevie Wonder and Canadian legend Joni Mitchell.\n31 – New Brunswick federal MP Jenica Atwin announced she was taking a break from politics. Atwin said the level of toxicity she’s had to face has been surprising, including bomb threats, threats of sexual violence, and other verbal abuse. The Fredericton member of Parliament, first elected in 2019 with the Green party before crossing the aisle to join the Liberals in 2021, said she will spend more time with her family.\n31 – Nova Scotia Liberal MP Jaime Battiste dropped out of the Liberal party leadership race. He said he’d back former central banker Mark Carney. Battiste was the only Indigenous candidate in the running to replace Prime Minister Justin Trudeau and sought to put First Nations issues on the agenda during the contest.\n31 – The loonie fell to its lowest level against the American dollar since the early days of the coronavirus pandemic. It dipped below 69 cents U.S. on fears of a trade war after U.S. President Donald Trump threatened to impose hefty tariffs on all Canadian goods.\n31 – The U.S. agency that usually helps give humanitarian aid to countries overseas had dozens of senior officials put on leave, thousands of contractors laid off and a sweeping freeze imposed on the billions of dollars in foreign assistance it would normally distribute. Democratic senators are warning the Trump administration against any effort to eliminate the U.S. Agency for International Development as an independent agency.",
  "word_count": 5841,
  "scraped_at": "2026-02-14T12:21:12.971374"
}