{
  "article_id": "50e87f386d89",
  "url": "https://www.sandiegouniontribune.com/2025/02/28/tom-krasovic-san-diego-fc-aspires-to-be-best-in-class/",
  "title": "Tom Krasovic : San Diego FC aspires to be best in class",
  "date": "20250301T004500Z",
  "domain": "sandiegouniontribune.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The top leader of San Diego FC, Mohamed Mansour, believes in aiming high.\n“We are committed to delivering an unparalleled match-day experience that reflects the passion and energy of this city,” Mansour, a founding partner and chairman of San Diego FC, wrote in a guest column published this week in the Union-Tribune’s sports section.\nUnparalleled.\nThat’s as high as it gets, and brings to mind late Padres chairman Peter Seidler, whose bold pursuit of high standards helped to transform the small-market club into an attendance giant.\nThe match-day standard set in Major League Soccer is higher than many folks might realize, however.\nSDFC’s challenge goes beyond its status as an expansion club, one that plays its first home match Saturday night against St. Louis City SC.\nThe league’s top venues have canopies or overhangs over the stadiums. Many MLS stadiums, including the two in Los Angeles, have them.\nAnd they make for a better match-day experience.\nThough certainly not essential, they provide a nice perk in an increasingly competitive entertainment marketplace. And while you’d think Southern California’s temperate climate makes them less desirable, as it happens, San Diego FC’s two closest regional competitors have them.\nThe sticky challenge for SDFC and other Snapdragon Stadium tenants that may want that design feature is that an overhang would cost $50 million to $100 million, per San Diego State athletic director John David Wicker.\nMansour’s track record implies he has the chops to solve complex problems in the business world. A citizen of both Egypt and the United Kingdom, he oversees the family conglomerate Mansour Group, which was founded by his father Loutfy in 1952 and has 60,000 employees, according to Forbes.\nMansour, 77, has a net worth of $3.3 billion, the magazine estimates. Among his many business successes was establishing General Motors dealerships in Egypt in 1975.\nAs is, Snapdragon Stadium holds appeal for soccer fans. The San Diego Wave have led the National Women’s Soccer League in attendance in two of their three seasons. The venue has hosted international soccer matches, including a 2023 Wrexham AFC-Manchester United match that set Snapdragon’s attendance record.\nAn overhang or canopy would make for a louder, more unified vibe for all fans due to the acoustics. It would also provide protection from extreme heat and rain. San Diego State’s football program, the lead tenant, would benefit.\nAs in L.A., a canopy would expand scheduling options for a variety of events — including soccer.\nSnapdragon is significantly bigger than many MLS venues, seating 35,000 including standing-room-only sections, and that made the construction more expensive. Satisfying San Diego State’s football program was part of the capacity calculation. Sadly, actual attendance at SDSU games is falling well short of capacity.\nSnapdragon’s designers — Gensler — included a canopy at the LAFC’s stadium, which seats 22,000. The soccer-specific venue does brisk business with concerts and other non-sports events. Similarly, there’s a canopy at the Carson home of LA Galaxy.\nThough LAFC plays most of its home games at 7:30 p.m, it will sprinkle in a few afternoon contests including a 12:45 p.m kickoff next month and a 4 p.m. match in April.\nGenerations of San Diegans grew up watching professional football, baseball and, yes, soccer, on the same Mission Valley site. The status quo here is pretty darn good.\nWould a more versatile venue improve Wicker’s stated efforts for Snapdragon Stadium to house events throughout the calendar year? Seems likely.\nLook ahead over the next decade or two. Will climate change lead to increased heat and extreme weather in Mission Valley? Might be worth considering.\nIt may not be feasible for anyone to bring Snapdragon up to the MLS’ tip-top standard. But, if you want to be best in class, it seems worth a try.",
  "word_count": 626,
  "scraped_at": "2026-02-14T12:19:15.432308"
}