{
  "article_id": "50f327eeca4d",
  "url": "https://www.forbesindia.com/article/crypto-made-easy/total-crypto-users-likely-to-reach-1-billion-by-2030-bcg-report/78443/1?src_trk=em66113d30424c44.671965381314072636",
  "title": "Total crypto users likely to reach 1 billion by 2030 : BCG Report",
  "date": "20240406T124500Z",
  "domain": "forbesindia.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Image: Shutterstock\nOn July 22, Boston Consulting Group (BCG), a global management consulting firm, released a report stating that crypto adoption is likely to accelerate further, with the number of crypto users reaching one billion by 2030.\nBoth retail and institutional investors are expected to drive growth. According to a joint report published by BCG, Bitget, and Foresight Ventures, crypto adoption remains very low compared to traditional investment assets. The report further states that only 0.3 percent of individual wealth is invested in crypto, compared to 25 percent in equities.Although institutional interest in crypto assets is growing, individual investors are currently the largest holders of crypto assets. According to the report, institutional crypto investors include hedge funds and venture capitalists, who nearly “doubled their exposure to $70 billion from Q4 2020 to the end of 2021\". However, it was these venture capitalists who bore the brunt of the Terra-Luna platform crash.\nThe report concludes that the crypto industry still has a lot of room for more significant growth and adoption due to the low investment penetration. This is similar to the conclusion reached by Wells Fargo, a major financial institution based in the United States.\nAs quoted in the BCG report, \"If we use the number of crypto holders as a proxy for Web3 users and benchmark it against the adoption rate of Internet users in the 1990s, the message is clear: there is plenty of growth to come. While it is difficult to predict if the trendline of crypto adoption continues, the total number of crypto users is likely to reach 1 billion by 2030.\"\nAccording to the report, North America will be the region to lead the user growth, as it currently has the highest investment in the sector at around $18,000. However, BCG stated that adoption would be influenced by different geographies. Africa has the least investments, with the average crypto holding around $190.\nAnother recent market report by consulting firm Verified Market Research predicted that the non-fungible token (NFT) industry\"s value could reach $231 billion in 10 years. In contrast, McKinsey & Company reported that the Metaverse alone could be worth $5 trillion by 2030. According to its findings, e-commerce will drive Metaverse\"s cash flow, generating up to $2.6 trillion in revenue by 2030.\nThe BCG report also said that as crypto regulation in Southern Asia matures, the region will account for about two to three percent of global crypto trading value, with India, Thailand, and Vietnam accounting for the largest markets in terms of trading value. Increased institutional investment in crypto is another sign of the sector\"s bullish sentiment.\nThe writer is the founder at yMedia. He ventured into crypto in 2013 and is an ETH maximalist. Twitter: @bhardwajshash\nFirst Published: Jul 26, 2022, 17:59\nSubscribe Now- Home /\n- Crypto-made-easy /\n- Total-crypto-users-likely-to-reach-1-billion-by-2030-bcg-report",
  "word_count": 469,
  "scraped_at": "2026-02-14T14:23:00.409956"
}