{
  "article_id": "50f996b8f97d",
  "url": "https://www.sbs.com.au/news/podcast-episode/survey-of-womens-world-cup-players-reveals-shortcomings-in-pay-and-medical-support/0bdig8431",
  "title": "Survey of Women World Cup players reveals shortcomings in pay and medical support",
  "date": "20231201T093000Z",
  "domain": "sbs.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n(Sports commentator: \"Write the Matilda's into history\"... \"Cue the party!\")\nAustralia may never come down from Courtnee Vine's match-winning penalty against France, cementing the Matildas first-ever World Cup semi-final, at a tournament on home soil, in August this year.\nThe excitement around 2023 Matildas has seen them inducted into the Sport Australia Hall of Fame, for smashing match attendance and national TV broadcast records and bringing about a \"seismic shift\" in women’s football.\nBut a survey by FIFPro, the global players' union, has highlighted the continued struggles faced by elite female professionals at the 2023 tournament, including under-compensation or in some cases, non-compensation, as well as a lack of medical support, preparation and recovery time either side of the tournament\nKate Gill, former Matildas captain, who scored 41 goals for Australia between 2004 and 2015, is now the co-chief executive of the players union, Professional Footballers Australia.\nShe says she is not at all surprised by the experiences of players.\n\"At times when we were competing, we were using one facility, one pitch, the rest and recovery between matches inside tournaments was very minimal. It took an incredible toll on you physically and both mentally.\"\nThe Matildas successes have been followed by milestones towards greater gender equity in sport in Australia.\nThese include a newly negotiated collective bargaining agreement between the PFA and Football Australia, that will see the Matildas and Socceroos receive equal treatment and better compensation at future tournaments, as well as $200 million of federal funding for grassroots women's sport through the Albanese Government's Play Our Way program.\nKate Gill says the FIFPro survey shines a light on continued inequity in women's professional football on a global scale.\n\"The findings are kind of emblematic of where women's football is. It has grown a lot, but there's still a lot of growing to do and we really have to be able to bear down on some of these issues and make sure that we can have conversations with key stakeholders and decision-making so that the conditions afforded to female athletes and female footballers are much more conducive to high performance and professionalism.\"\nFIFPro surveyed 260 players from 26 of the 32 teams present, with over half saying they did not have enough rest before their matches, and two-thirds believing they were \"not at the best\" at the start of the competition.\nThe Matildas campaign began with worries over the absence of captain Sam Kerr, who sustained a calf injury playing for Chelsea at the end of the Women's Super League season.\nDr Stephanie Filbay is a senior research associate and physiotherapist at the University of Melbourne.\nShe says demanding national league schedules and tight turnarounds are likely factors in injuries like Kerr's.\n\"So a muscular injury like a calf strain can be impacted by load and players playing surface and other environmental factors. Whereas a contact injury, like a joint injury that occurs from making contact with another player tends to be down to more poor luck and other factors. However, the actual tendon and muscular injuries can relate to insufficient rest, insufficient sleep, stress fatigue and high playing loads.\"\nThe 2023 Women's World Cup broke records for the most revenue generated from ticket sales, and the largest ever global audience for a women's sporting event.\nBut FIFPro's survey found many players globally were inadequately compensated, with one in three earning less than US$30,000 (A$45,000) a year from football in national leagues; and one in five supplementing their income with a second job - as many semi-professional players in the A-League Women are forced to do.\nAdvocacy by FIFPro saw FIFA commit to compensating all players an additional US$30,000 (A$45,000) for participation in the tournament.\nDr Michelle O'Shea, senior lecturer in sport management at Western Sydney University, says FIFA could be doing more.\n\"I think putting a $30,000 value on top flight players from across the globe really does show that culturally we've got a long way to go in terms of how the women's game is valued. FIFA is said to have made the payment to their country federations. Many of those athletes have not actually received that payment. And the Nigerian women's team is one example of that.\"\nThe Nigerian team, who achieved a hard-fought victory against the Matildas in the Group Stages, threatened to strike at the beginning of the tournament over poor conditions and unpaid match bonuses.\nTeam members say they still have not been paid the participation wages guaranteed by FIFA by their national federation.\nIn the run-up to the tournament, the Matildas released a video calling for prize money equity between the men's and women's tournaments, which FIFA says it has committed to by 2026, with the prize money at this year's tournament only a quarter of a share of the men's in 2022.\nThis follows a long history of advocacy by the team, including in 2015, when the Matildas became the first sports team in Australian history to go on strike, leading to a collective bargaining agreement that came before the current deal.\nKate Gill says players are being forced to potentially sacrifice their careers to bring about change in the sport.\n\"We saw in the lead up to and also post the tournament that the players were still fighting with their federations. There was a condition that players be flown in business class to compete in the tournament as part of the agreed conditions. When they left the tournament, that wasn't the case. So it's still very encumbered on the players to use their voice and to use their platform and to have to sacrifice their experiences.\"\nPlayers also reported inadequate medical standards before the tournament, with one in ten players not having a pre-tournament medical, and 22 percent had not received an electrocardiogram with their national federation, both mandated by FIFA in its competition regulations.\nDr O'Shea says these examples, along with little support for mental health, show a startling lack of professionalism in support for female athletes.\n\"This is a workplace for these athletes, they are employees. And so there is an expectation around as we would receive in our own workplaces occupational health and safety. Often we think about athlete health and wellbeing around physical performance, but we also know increasingly that it's about mental health. And we've also got 60 per cent of players saying that they weren't supported by virtue of their mental health. And that is really problematic.\"\nDr Filbay, who was forced to end a playing career in competitive football after suffering an ACL tear in a game, now specialises in A-C-L injuries, a problem which saw many players absent from this year's tournament, and affects female athletes at a higher rate than men.\nShe says the difference in medical support provided to male and female athletes is a problem across all levels of the sport.\n\"It's not uncommon for the women to be playing on inferior fields, lower quality fields. They've often got the poor training time slot that might be at night after the men train or early in the morning. We often see, especially at lower levels of participation, that there's no medical support staff or when there is that they're really low quality. Typically a new graduate, whether it's a sports doctor or a physio, might go and work with a women or girls team first. And then once they get more experienced they'll often go on and work with men and boys.\"\nFIFPro says it wants to see the implementation of global medical standards for women's football.\nDr O'Shea says the \"Matildas effect\" on increased participation in women's sports at the grassroots level means it is critical that there is greater access to green space and amenities like women's changing facilities at club level.\n\"We've just got such an amazing platform from which to move forward, and it's my hope that we don't just see that as a symbol that, as I said, we really have those practical supports and that I guess we have a legacy framework that really delivers on its promise.\"\nAs the Matildas stellar year comes to a close, Kate Gill says as a former player, she is humbled by the reception the team has received.\n\"Understanding where women's football was and to see it kind of transform into the zeitgeist of the Australian public and be really embraced. I think the Matildas now have really created a new football DNA for Australia. They're a really likeable, really accessible group of players and the way that the Australian public really got behind them and were really integrated into that team is something I think that every past Matilda should be proud of.\"",
  "word_count": 1462,
  "scraped_at": "2026-02-14T12:56:51.294319"
}