{
  "article_id": "50fdddbf8b88",
  "url": "https://www.gov.uk/government/news/strategic-bilateral-framework-between-the-kingdom-of-spain-and-the-united-kingdom-of-great-britain-and-northern-ireland-3-september-2025",
  "title": "Strategic bilateral framework between the Kingdom of Spain and the United Kingdom of Great Britain and Northern Ireland : 3 September 2025",
  "date": "20250903T214500Z",
  "domain": "gov.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Strategic bilateral framework between the Kingdom of Spain and the United Kingdom of Great Britain and Northern Ireland: 3 September 2025\nStrategic bilateral framework between the Kingdom of Spain and the United Kingdom of Great Britain and Northern Ireland: 3 September 2025\nThe Kingdom of Spain and the United Kingdom of Great Britain and Northern Ireland, hereinafter referred to collectively as “We” or “the UK” and “Spain”,\nBeing old friends and close allies, our partnership is rooted in our shared history and common values, as likeminded democracies committed to the purposes and principles of the United Nations Charter, human rights and free trade, as well as to the promotion of an international order based on international law and multilateralism;\nBuilding on the rich and dynamic exchanges between our peoples, and our deep ties of friendship and cooperation demonstrated through strong political, economic and cultural relations, we look forward to strengthening our cooperation;\nWe are committed to delivering a dynamic, strategic, and progressive partnership that promotes inclusive and sustainable economic growth, enhances stability and security in Europe, and tackles global challenges, including climate change and the transition to a green economy, global health crises, reducing inequalities, and advancing the rights of women and girls;\nOur cooperation complements and benefits from the UK-EU framework. Both sides recognise that the positive development of this relationship supports our bilateral efforts, including through the enhanced partnership between the EU and the UK established following the 19 May 2025 Summit;\nSpain and the United Kingdom have decided to increase their bilateral cooperation in full coherence and complementarity with Spain’s membership of the EU and with the relationship the UK has established with the EU through existing agreements and arrangements and others that may be concluded in the future.\nOur cooperation will be structured through an annual strategic dialogue and will include, but is not limited to, the areas listed below:\nANNUAL STRATEGIC DIALOGUE\n1 The Minister for Foreign Affairs, European Union and Cooperation of Spain and the Secretary of State for Foreign, Commonwealth and Development Affairs of the UK commit to holding an annual dialogue to strengthen our partnership and enhance our cooperation on the global stage. They will have overarching responsibility for the implementation of the overall framework. They will review progress and consider possibilities for future initiatives.\nDELIVERING SUSTAINABLE GROWTH\n2 The UK and Spain share a thriving trade and investment relationship, which aims to foster inclusive and sustainable growth. We will strengthen bilateral exports and investment, including through a new Trade and Investment Dialogue, which will be overseen through a new annual meeting between Trade Ministers from the UK Department for Business and Trade and the Spanish Ministry of Economy, Trade and Business. This dialogue will include investment, productivity and Small and Medium Sized Enterprises’ (SMEs) issues.\n3 By deepening cooperation between the UK and Spanish authorities responsible for industrial policy, we will advance our respective industrial strategies, unlocking growth opportunities and increasing resilience in priority sectors for the UK and Spain.\n4 We will continue to work together to promote resilient, sustainable, and diversified supply chains for critical goods and critical raw materials where mutually beneficial to do so. We will enhance our cooperation on economic policy and economic security issues to strengthen our ability to prepare for and respond collectively to economic shocks. This could include, but is not limited to, further collaboration on foreign direct investment, supply chain resilience, and boosting strategic autonomy, financial services, and macroeconomic policy.\n5 A business-friendly environment is essential for our companies to expand trade and investment. We will work closely with our business communities to identify and pursue trade and investment opportunities. To this aim, we will hold a regular forum with leaders from UK and Spanish companies (including SMEs), chaired by senior UK and Spanish government representatives.\n6 As part of our Trade and Investment Dialogue we will jointly explore actions to help UK and Spanish companies operate in each other’s markets. This includes, but is not limited to, promoting regular dialogue between the UK Department for Business and Trade and the Spanish Ministry of Economy, Trade and Business, bringing in other government departments as required, on any possibilities for improving short-term business travel in line with the relevant EU-UK dedicated dialogue on these matters, and in compliance with the EU-UK Trade and Cooperation Agreement (TCA). In deciding on our joint actions, we will pay special attention to the needs and opportunities of SMEs, promoting their innovation capabilities and access to bilateral support tools.\n7 To boost innovation, competitiveness, and shared scientific goals, the UK and Spain will enable collaboration and engagement on science, innovation and technology through European research and innovation programmes, including Horizon Europe and Eureka. As part of this effort, we will also promote collaboration in research infrastructures and knowledge transfer, particularly in advanced fields such as digital, health and space technologies, which are key to cutting-edge innovation.\n8 Recognising the importance of science diplomacy and international cooperation, we will partner on research security to raise awareness and build capability and resilience across the research and innovation ecosystem. We will enhance economic security by sharing our approaches towards the protection and promotion of critical tech sectors.\n9 To ensure policy making is based on the best available scientific advice, we will continue to work together to share best practice and experience of science advisory mechanisms. This includes mutual learning on science-for-policy frameworks, behavioural sciences, and interdisciplinary approaches to address complex societal challenges. We will also strengthen cooperation in the use of scientific advice for emergency preparedness and crisis management. We will work together to advocate for the use of evidence in decision making.\n10 A sustainable and secure food supply is essential for both our countries. Given our close trading ties in the agriculture, food and fisheries sectors, we will increase our collaboration in areas of shared interest, through enhanced engagement and information sharing on food safety, food security, sustainable agriculture and water, the development of improved plant varieties through new precision breeding techniques, fisheries science, and technological developments in the area of fleet decarbonisation.\n11 We share a commitment to ensuring that economic growth improves the lives of working people, through supporting our citizens to progress into rewarding, sustainable employment throughout their lives. We will strengthen our cooperation on labour issues, including: the promotion of decent work; minimum wages; social dialogue; gender equality; fight against discrimination in the workplace; the social and solidarity economy; social protection, trade unions and labour rights. We will work towards a Memorandum of Understanding between the relevant ministries.\nFOREIGN AND DEVELOPMENT POLICY\n12 We will promote a strengthened multilateral system to advance democracy, good governance, and the rule of law, fostering human rights, free trade, security, and stability through collective action within the international framework, including the United Nations.\n13 We will cooperate on shared foreign policy issues and sustainable development objectives, including, among other priorities:\na) Coordinating and sharing assessments and intelligence on Russia’s violent and destabilising hybrid warfare campaign in Europe. Strengthening mutual and allied resilience via focussed dialogues on countering Russian cyber; sabotage; foreign interference and information manipulation; assassinations; and espionage. Hardening the operating environment for the shadow fleet through enhanced operational interactivity, promoting constructive dialogue in the Mediterranean and further securing NATO’s southern neighbourhood and eastern flank.\nb) Supporting Latin America’s and the Caribbean’s economic growth, their climate, energy, and biodiversity ambitions, including climate adaptation and resilience; efforts to improve citizens’ security and to tackle organised crime; and working with the region to uphold the rule of law, human rights, and multilateralism, and to counter trends and actors that undermine these.\nc) Deepening our exchanges regarding the Indo-Pacific, reinforcing those at the EU level, to identify opportunities for cooperation with this dynamic region and ensure the promotion of a free, open, inclusive and prosperous Indo-Pacific, anchored in international law.\nd) Holding a regular dialogue on the Middle East, working with regional partners to reduce existing tensions, supporting regional efforts for dialogue on political, security and economic issues, and coordinating initiatives to promote the implementation of the Two State solution and Palestinian Statehood, supporting a regional security strategy that integrates Israel fully into the region, and supporting regional efforts on nuclear non-proliferation and security structure to promote stability in the region.\ne) Enhancing our cooperation on the UK and Spain’s respective Africa Strategies, developing partnerships based on respect, equality and growth through official level dialogue and coordination between our respective Embassies.\nf) Working together in strategic alliances to promote gender equality and all women and girls’ rights, focusing on their sexual and reproductive health and rights. We will work together to tackle the rollback of the rights of women and girls, as well as the rights of marginalised groups, which is a threat to our common values and security. We will promote the objectives of the Women, Peace and Security Agenda in accordance with Resolution 1325 of the UNSC and the nine resolutions that followed, especially, promoting the full, equal, meaningful, and safe participation and leadership of women in conflict prevention, resolution and mediation. We will also work together in responding to and ending conflict related sexual violence and ensuring accountability for survivors. This will include cooperation through the International Alliance on Preventing Sexual Violence in Conflict.\nOUR PEOPLE\n14 There is a deep bond between our people, through tourism, education, the arts and media, sport, industry and our citizens residing in each other’s country. We acknowledge that these ties bring with them an exchange of cultures, skills and ideas, to the benefit of both the UK and Spain, and we wish to further deepen these shared foundations. To foster new ties between our youth, we are committed to working towards a balanced youth experience scheme between the UK and the EU on terms to be mutually agreed. We will also cooperate to foster mobility opportunities for our citizens, understanding that mobility refers to temporary movement and should not be confused with migration.\n15 We will foster initiatives that publicly acknowledge the role and contribution of the Spanish community in the UK and the UK community in Spain. We reaffirm our commitment to continue to work closely together to protect citizens’ rights and address issues affecting all Spanish nationals in the UK and UK nationals in Spain, both those covered by the Withdrawal Agreement, as well as those who are not, including on social security matters (noting that the TCA outlines social security and healthcare benefits for those not in scope of the Withdrawal Agreement). We will also engage in technical level discussions to explore specific issues.\n16 Education is a key area of mutual strength. Building on the UK-Spain agreement on higher education access, we will establish a UK-Spain Working Group on Education to unlock closer cooperation and enhance the educational links between the UK and Spain in all levels and types of education and training. The group will work among other things to identify and unlock barriers, so we foster stronger bonds between our world class universities, promoting opportunities in the tertiary sector for students and academics in the UK and Spain, and advocate for streamlined processes of mutual recognition between the EU and the UK in areas of mutual interest within our existing domestic immigration systems. In this regard, we welcome references to a possible association of the UK to the Erasmus+ programme, in the EU-UK Common understanding, which could benefit educational mobility across all the sectors and ages covered.\n17 We will work together to identify opportunities for strengthening ties between our towns and cities, our artists and world-leading cultural institutions. We will champion the role of museums, art centres, archives, and cultural, education and sporting organisations, including the British Council, the Instituto Cervantes, the Spanish School Vicente Cañada Blanch in London, and the ALCE programme in the UK, as vital resources for advancing social welfare, strengthening people-to-people ties, and promoting the sustainable development of our societies. Spain and the United Kingdom will share expertise on promoting women’s sport in general, including women’s football, and will also share expertise and lessons learnt on hosting major events, recognising the United Kingdom’s hosting of UEFA EURO 2028 and Spain’s joint hosting of FIFA World Cup 2030.\n18 The aim of the Spanish-British Tertulias, which have been held annually since 1988, is to contribute to a better understanding between the civil societies of both countries. We commit to provide continued support to the Tertulias, to expand the topics discussed to include more social issues, and to increase the participation of women, and young people.\n19 As home to two of the most widely spoken international languages in the world, we recognise the immense value that learning Spanish and English brings to the understanding between our cultures, economic growth, and opportunities for our young people. We will facilitate the exchange of our language and culture teachers and students through existing routes within our domestic immigration systems, supporting the learning of Spanish in the UK and English in Spain.\n20 We acknowledge the strong bonds between our societies in tourism and the economic benefits this brings and commit to cooperate in the development of a new tourism model based on innovation and digitalisation and the sustainable management of tourism, with regular contacts for the exchange and design of best practices in this field. We will cooperate on consular matters to improve the experiences of British and Spanish tourists. We recognise that expanding access to e-gates is in our mutual interest as part of improving border security and fluidity. Reciprocal access to e-gates will be an important and visible symbol of our partnership.\n21 Our Health Ministries will deepen collaboration in areas of mutual interest, to better protect our citizens now and in the future, including in primary and community care, health promotion, risk reduction around extreme weather events and future collaboration in global health. We will also explore cooperation in the development and production of critical health-related industrial capacities, including vaccines, personal protective equipment, and diagnostic technologies, to enhance our strategic autonomy in global health preparedness. We will promote close collaboration on multilateral strategies, reinforcing the role and autonomy of the World Health Organization as the central actor of the global health multilateral architecture, partnering with like-minded partners and donors, and ensure better preparedness and response to health threats, including pandemics, with a One Health approach.\n22 We are both committed to ensuring our governments deliver effectively for our citizens. We will foster frameworks that facilitate bilateral cooperation between the Spanish and British public administrations, with a focus on digital transformation and the modernisation of the civil service. Within our existing systems, we will promote exchanges between civil servants, knowledge bases, common training experiences and workshops on digital competencies.\nGender Equality & Countering Discrimination\n23 We will promote the full, equal, safe and meaningful participation of women in public and political life, as well as their leadership in all spheres of life. We will enhance our cooperation on women and girls’ representation in diplomacy, including through collaboration on joint initiatives aimed at promoting opportunities in diplomacy including, but not limited to, Ambassador for a Day.\n24 We will promote and protect LGBTIQ+ rights in international fora and increase our support to civil society. We will collaborate on joint initiatives to strengthen the fight against racial or ethnic discrimination and to guarantee the rights of LGBTIQ+ persons, always incorporating an intersectional approach. Focus will be put on education and awareness raising as an important avenue for combatting online hate speech, sharing experiences and good practices, as well as in relation to the prosecution of hate crimes.\nCLIMATE, ENERGY AND GREEN TRANSITION\n25 We will strengthen bilateral cooperation to advance climate action, energy security and affordability, including strengthening our efforts to raise global ambition on climate change in line with the 1.5-degree objective. We will collaborate on key environmental issues to tackle the triple planetary crisis: climate change, biodiversity loss, and pollution, including via multilateral environmental agreements. We will continue to advocate for our shared vision of a clean, healthy, and biologically diverse ocean, and advocate for protection of the marine environment, both domestically and collectively through international fora. We will enhance cooperation on waste management, as part of our shared commitment to transition to a circular economy.\n26 We will strengthen our efforts on energy security and affordability, deepening cooperation to drastically reduce dependence on fossil fuels. We commit to continuing to take the action needed in our respective countries to accelerate the clean energy transition. We will continue to work together as developed nations to support countries in the Global South with the energy transition, both through existing and emerging mechanisms, recognising the leadership role that Spain and the UK play in the rollout of renewable energy. We also recognise the importance of strengthening industrial value chains and boosting strategic autonomy in the clean energy sector, particularly in key technologies, such as renewable hydrogen, energy storage, and critical raw materials.\n27 We will work towards a Memorandum of Understanding between the UK Department for Energy Security and Net Zero and the Spanish Ministry for Ecological Transition and Demographic Challenge -on closer collaboration on energy and climate policy. The MoU will cover the following policy areas and can be broadened by decision of both energy ministries: grid challenges, rooftop solar, onshore and offshore wind, utility-scale PV, decarbonisation of hard-to-abate sectors, renewable hydrogen, and the difficulties operating ‘island energy systems’. The meetings of officials will be supplemented by at least one annual meeting of UK and Spanish energy and climate ministers.\n28 Recognising the importance of our strong strategic partnership on energy, we will enhance cooperation on massive deployment and integration of renewables, including sharing information, expertise and best practice. We will jointly host an annual clean energy business panel, recognising the significant investments of British and Spanish companies in each other’s energy systems. The roundtable will seek to address barriers to further investment and speed up the green transition in both countries. The panel will be chaired in turn by either ministry, with support from the relevant Chambers of Commerce. The findings from these roundtables will be submitted to energy ministers in both countries for their consideration.\nEUROPEAN SECURITY AND DEFENCE\n29 In an ever more challenging context for European security and defence, as NATO allies, we are committed to closer cooperation to ensure Euro-Atlantic security through NATO, to developing strong, shared capabilities which are supported by funding, enhanced resilience, and a united political voice. In this context, we recognise that NATO-EU strategic partnership is essential for the security and prosperity of the Euro-Atlantic area.\n30 We will support NATO adapting to the new strategic environment, including cybersecurity, emerging and disruptive technologies, and countering terrorism and hybrid threats. Alongside NATO’s adaptation, we reaffirm our commitment to enhancing Europe’s ability to deliver its own security including through the different options in the EU framework, where relevant.\n31 In this context we commit to work together to make the fullest possible use of the UK-EU Security and Defence Partnership. Noting the shared UK and EU commitment to explore possible mutual involvement in respective defence initiatives, we look forward to a potential EU-UK agreement to enable the UK’s participation in the SAFE instrument as part of exploring possibilities for mutually beneficial enhanced cooperation. If an agreement is struck, the United Kingdom and Spain will seek opportunities to cooperate through this and other current and future defence initiatives and instruments, with the aim of strengthening Europe’s defence industrial base and preparedness.\n32 We will continue to develop the relationships between our Armed Forces, increasing our ability to act jointly in international operations and develop mutual understanding on defence and security matters, including integration of Human Security and Women, Peace and Security approaches to ensure operational effectiveness.\n33 To this end, we are committed to agreeing a Memorandum of Understanding (MoU) on Defence to seek greater alignment on strategic threats. This MoU is intended to provide a framework that develops and furthers bilateral cooperation and relations between the UK and Spain in the area of defence and security, builds on existing cooperation, and seeks to identify new areas of collaboration with mutual benefits.\n34 To preserve and enhance our national and European technological and industrial bases, we will encourage further development of a collaborative, robust and competitive defence industrial sector while maintaining the Small and Medium Enterprise integrated in the industrial tissue network. We will explore: increasing our interoperability; strengthening our bilateral and multilateral defence capability and equipment cooperation, including through industrial partnering; and co-operating on mutually beneficial export opportunities. As part of our broader cooperation on defence industrial initiatives, we both support the progressive alignment of Ukraine´s defence industry with the European Defence Industrial and Technological Base (EDITB).\nSECURITY, JUDICIAL COOPERATION AND MIGRATION\nJudicial cooperation\n35 We recognise the importance of enhancing cooperation in criminal and civil justice matters and further deepening this cooperation to benefit our citizens through tackling cross-border crime, strengthening cooperation for the benefit of families and for victims, working together to tackle violence against women and girls, and sharing best practices on prisons and probation, and including the safeguarding of the principle of the best interest of the child in relevant disputes regarding Spanish families in the UK, UK families in Spain, as well as mixed families. To this end, our Ministries of Justice commit to hold working groups on criminal justice cooperation and civil judicial cooperation, focusing on priority areas of mutual interest.\nCombating Terrorism and Serious and Organised Crime\n36 The UK and Spain are longstanding trusted partners in the shared fight against serious and organised crime. We will enhance our Partnership against terrorism and transnational crimes to make streets safer in both our countries. This vital work includes disrupting and dismantling international criminal groups, jointly fighting drug smuggling, terrorism, organised immigration crime and illicit finance flows before they impact upon our collective safety and prosperity.\n37 We will continue to expand on our existing excellent operational relationships, alongside deepening and enhancing policy cooperation in key national security areas. This will include maximising opportunities to do so through established mechanisms such as INTERPOL and EUROPOL. We will also consider how best to enhance real-time exchange of law enforcement alerts via the designated national points of contact.\n38 We will extend cooperation to go beyond our respective borders, engaging further upstream to tackle national security threats at source. Given the known impact of the drugs trade manifesting on European streets, we will strengthen our joint response to countering drug trafficking and illicit commodities being trafficked into Europe from Latin America, the Caribbean and via North and West Africa. We will support law enforcement in such key regions, through strategic intelligence exchanges, operational assistance and upstream deployments, establishing capacity building in-country.\n39 We will continue to explore ways that we can partner together to deliver enhanced law enforcement cooperation and capabilities at a European level, bringing like-minded international partners with us, including through strengthened work with the EU. We will look for opportunities to reinforce our cooperation in international organisations, especially in the United Nations and in the framework of its international Conventions, and in the international fora dedicated to the fight against terrorism and organised crime.\nViolence Against Women and Girls\n40 We will collaborate to exchange best practices and lessons learned on the protection of women and girls from sexual and other forms of gender-based violence and abuse. There is much that can be of mutual benefit in the approaches that Spain and the UK take to preventing and responding to violence against women and girls (VAWG) and minors in women´s care.\n41 We will explore opportunities for knowledge, skills and capabilities sharing across all strands of activity (i.e., prevention, intervention, response and victim support within the Law Enforcement perspective) and all VAWG-related crime types. Particular focus will be placed on the assessment of risk of reoffending or re-victimisation; and the law enforcement response to technology-facilitated violence against women and girls which can also affect minors in women´s care. We will also deepen collaboration on prevention of all forms of VAWG.\nMigration\n42 We will strengthen cooperation on migration based on a comprehensive approach, including the fight against smuggling and trafficking of human beings. This includes exchanging information, sharing of best practices, legal migration pathways and coordinating efforts to cooperate as part of a whole of route approach with countries of origin and transit, especially in the North of Africa and the Sahel. We will adopt coordinated strategies at the international level, including relevant fora, to share expertise and comprehensive approaches to migration management, in line with national and international law.\n43 We will strengthen operational cooperation to tackle organised crime associated with the trafficking and smuggling of migrants that impacts Spain and the UK. This includes disrupting the financial flows associated with these criminal networks as well as the development of capacities and supply of appropriate equipment to partner countries of origin and transit with the aim of strengthening migration governance and cooperation. We will ensure the effective prosecution of individuals involved in all those activities, and the protection of migrants’ rights, in particular those of vulnerable persons.\nTRANSPORT\n44 We have thriving, world-class transport sectors that are vital to our economic growth and development. We will work to ensure the smooth flow of traffic of goods and passengers on the vital routes between the UK and Spain. We are also both committed to work together to decarbonise our transport sectors. We will build upon our existing bilateral agreements to extend bilateral transport cooperation.\n45 We commit to holding an annual Transport Dialogue between businesses and government to enhance information sharing and deepen our collaboration on a range of transport areas, including decarbonisation, infrastructure development and investment. This will formalise and facilitate mutually beneficial exchanges of best practice and lessons learned on priority transport topics, including those related to our respective rail sectors.\n46 We will continue to implement our bilateral agreements on decarbonising the aviation and maritime sectors, and seafarer welfare. Progress against these agreements and other bilateral arrangements will be monitored through the Transport Dialogue.\n47 In parallel, we aim to strengthen cooperation on innovation in transport infrastructure, systems, and technologies, as part of our shared goal of furthering a secure and resilient transport ecosystem.\n48 We are both committed to making our transport systems as accessible as possible and to improving the experience for all passengers and road users with disabilities. We will share policy approaches to making transport more inclusive. We will work to sign an arrangement in order to ensure mutual recognition of parking permits for Disabled persons, as established under the UK Blue Badge Scheme and Spanish legislation, for travel between the UK and Spain.\nGOVERNANCE ARRANGEMENTS\nThis Framework is not legally binding and does not give rise to any rights or obligations under domestic or international law.\nIt will come into operation on signature and will continue in operation until either Participant decides to put an end to its application by sending a written notification to the other Participant at least six (6) months in advance.\nAt the request of either Participant, this Framework may be reviewed or modified by mutual consent. Any such modification will be done in writing and would come into operation on a date to be decided by mutual consent.\nSigned in London on the 3rd of September 2025, in duplicate in the English and Spanish languages, with both texts having equal validity.",
  "word_count": 4584,
  "scraped_at": "2026-02-14T13:22:30.252923"
}