{
  "article_id": "5115534b35e4",
  "url": "https://www.rockmnation.com/2023/6/2/23745241/nba-stuff-kobe-brown-michael-porter-jr-denver-nuggets-good-luck-to-nuggets-but-not-christan-braun",
  "title": "NBA STUFF : MPJ , Nuggets Take Game 1 , Kobe Brown is draft - bound",
  "date": "20230602T110000Z",
  "domain": "rockmnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "NBA STUFF\nDraft Talk & NBA Finals Chatter, Mizzou Links for Friday, June 2\nThe NBA Draft is coming up in about three weeks, and I AM EXCITED. Doesn’t it just feel so good to know that a Missouri Tiger is almost certainly to be drafted? I don’t want to say it’s 100%, but it seems like a pretty damn good likelihood at this point that he will become the 11th Tiger drafted since 2000, or else our favorite Tiger would have come back to Mizzou for a final year. You can tune into the Draft, which will be held in Brooklyn on June 22, on ESPN.\nMy bud, Chris Kwiecinski, after getting the ultimate scoop, allowing Kobe to pen a farewell letter to Mizzou, he wrote this great post: Saluting Kobe Brown, the most important Mizzou player of this decade. In it, he imagined what the year would have looked like without him. What the last four years would have looked like. I simply cannot imagine it.\nSimply put, there is no electric, ecstatic and engaging turnaround if Kobe Brown doesn’t stay. MU might still have made a tournament appearance. However, without Brown, there might not be a Tigers’ first tournament win since 2010. There certainly wouldn’t be back-to-back 30-point games against Illinois and Kentucky in December where Kobe was the most dominant player in America for a week’s span.\n- No Ceilings NBA v.7.2 (May 17) $$: #55. Indiana Pacers (via CLE)\nKobe Brown impacts the game of basketball in so many different ways. He can shoot, pass, finish around the rim and play bully-ball, and guard multiple positions due to his size and frame. In terms of shooting, Brown can shoot, but the type of leap he took in terms of three-point shooting is promising but also cause for skepticism. He shot 45.5T% on 4.5 3PA this season compared to being a career 20-25 3PT% shooter on less than three attempts per game in his first three years with Missouri. So yes, be skeptical, but this is encouraging as he does have the discipline and work ethic installed in him to work on his craft like that.\nBrown also doesn’t have a set position as he fits into the molds of a power guard, wing, forward, etc. He can be used in multiple roles, and in the NBA we know how valuable that attribute is on any team. Brown’s passing ability would help Tyrese Haliburton in terms of having another set of X-Ray vision on the court (1.56 AST/TO ratio, 85 total assists), and as another scoring option. Brown’s height and size give the Pacers depth in the 2-4 spots and there’s a big chance they have high return value on Brown this late in addition to their other picks in the draft.\n- HoopsHype (May 28)- Presents an aggregated ranking of the player based on rankings found elsewhere.\nPrevious rank: 50 (+9) / Best rank: 36 / Worst rank: NR\nKobe Brown’s stock is as high as it’s been all season in the aggregate mock draft poll. As noted by ESPN’s Jonathan Givony, Brown has improved his physique since the end of the season and looked to be in great shape at his Priority Sports Pro Day. Brown made his way onto the NBA radar by shooting 45.5 percent from three-point range this past season.\n- ESPN.com $$ (May 31)- #46 to Atlanta Hawks (via Pelicans)\n- ClutchPoints (May 29)- #46 to Atlanta Hawks. On May 22, ClutchPoints did a big board, and rated Kobe the 47th-best prospect in the draft, just ahead of now-Illinois returnee, Terrence Shannon, Jr.\n- Bleacher Report (May 20)- #48 to LA Clippers / Previously #38 to Sacramento 5/16\n- SI.com Draft Digest (May 23)- #36 to Orlando Magic\n- Tankathon Mock Draft (May 14): #37 to OKC (via Wizards)\n- Bleacher Report (May 16)- #38 to Sacramento Kings (via Pacers)\n- USA Today Rookie Wire (May 19)- #38 to Sacramento Kings (via Pacers)\n- NetScouts Basketball (May 26)- #50 to Indiana Pacers (via Miami)\n- Yahoo!Sports (May 16)- #51 to Brooklyn Nets\n- The Athletic (May 16)- #36 to Orlando Magic / #41 on Vecenie’s big board on May 2\n- SportsNaut (May 30): #49 to Cleveland Cavaliers (from Warriors): Kobe Brown, forward, Missouri\n- USA Today (May 16)- #45 to Memphis Grizzlies (via Minnesota)\n- NBA Draft Room (May 30)- #63 (up from 71) player overall. Undrafted. WRONG. ABSURD. WHO ARE THESE PEOPLE? I don’t trust these dum-dums.\n- The Box and One (May 29)- Kobe Brown: 2023 NBA Draft Scouting Report (*YOU SHOULD READ THIS PIECE* )\nNonetheless, I’m ready to stamp my name to it and have seen enough to call it. Kobe Brown is worthy of a first-round grade. I hope to illustrate how his versatility, quick processing feel, and fit into those Celtics-Heat style possessions gives me that confidence, why the defense isn’t a major area of concern due to fit, and how one specific portion of his jump shot has me buying into it long-term.\n- Thoughts from Ant Wright at the Full Ride Network:\nThis site at USA Today’s RookieWire’s Draft Workout Tracker 2023 has an up-to-date list of players who have had official workouts. Both D’Moi and Kobe have been to Portland, and Kobe also has been to Indy (links to Pacers’ video interview).\nI’ve become consumed with the NBA these days. Whether it’s been the Conference Finals— I’ve followed the Nuggets pretty closely since Mike ended up there, started watching the Heat when Druuuuuuuuu was there and kept up with them after he was gone, and I’ve been a Celtics fan for a while— love Jaylen Brown (coached by Zo) and my StL guy, Jayson Tatum.\nThursday was Game One of the NBA Finals, and since we don’t say a lot about former quasi-Tiger (jk) around here other than in passing (and it’s mainly me providing the news), I thought it’d be nice to spend some time talking about MPJ and the Nuggets, who are in their first NBA Finals. Entering the Finals, Playoff Mike is averaging 14.6ppg and 8rpg, while averaging 7 3PT attempts a game and making them at a 40.8% clip.\nDisclaimer: I know Mike has displayed some instances over the years (not recently, thankfully) of “Sticking Foot in Mouth” disease, but I’m always going to root for him, and I always will see him as a CoMo kid and a Tiger.\nBefore we go any further, I wish for a ‘Ship for all the Nuggs except Christian Braun. No luck or trophies for you, beaker. Moving on.\nGame One: Denver 104 | Miami 93 / Next Up (Game 2): Sunday at 8pm on ABC/ESPN+\nMPJ was everywhere in this one, and had two blocks in the first quarter alone. His final stat line: 43 minutes | 14pts on 5-16 FG (2-11 3PT) | 13 REB (11 defensive)| 1 AST | 2 BLK | 0 TO | 0 PF | +20 (team-high)\nHere’s some news links to check out:\n- Once a risky pick, Porter turning in big rewards for Nuggets team making 1st NBA Finals (Pat Graham, AP News via Missourian)\n- Michael Porter Jr. Finds Meaning After Almost Losing Basketball (Mirin Fader, The Ringer — she wrote the Giannis book). The writing here is PHENOMENAL. It’s a MUST read. Fader writes:\nIt was an incomprehensible fate to grasp for someone who was once ranked as the no. 1 recruit in the country. Back then, the 6-foot-10 forward was praised as the future of basketball, a surefire top pick in the 2018 NBA draft. Known for his astounding athleticism and wingspan, he could shoot or dunk over anyone. Leaping was almost like breathing: unconscious, effortless, easy. Basketball had always come so easy to him.\n...\nBut his impact has been felt far beyond scoring. He’s been a relentless rebounder, grabbing double-digit boards in seven games. He’s also been an improved defender and shot blocker, taking pride in his assignments. Instead of dwelling on aspects of his game he felt he had lost due to his injuries, such as his athleticism, Porter Jr. focused on what he could gain and how he could add to his arsenal. As a result, he’s morphed into a more all-around player, making selfless plays that contribute to winning basketball\n...\nHis worth as a human being had been tied for so long to what he accomplished in hoops. The way he felt love as a kid was through people clapping for him when he made a good play. And as an adult, when that adulation would cease as soon as his body couldn’t do what it had promised, he had to separate his worth from his profession.\n- Michael Porter Jr. can burn the Heat in the NBA Finals as Denver’s chaotic X-Factor (Robert Zeglinski, USA Today)\nPorter is one of the more gifted NBA offensive players in the league, and when he gets a rhythm, the 6-foot-10 forward seems unstoppable. Even for a No. 3 scoring option, his top-notch shooting stroke is something to behold.\nWhile Porter Jr. is more of a finesse player, Miami, by definition as a “small-ball” team, would have no answer for an electric Porter Jr. And that’s what makes him perhaps the most dangerous X-Factor/question mark of this NBA championship series.\n- How journaling helped Nuggets’ Michael Porter Jr. handle anxiety surrounding injury, contract (Bennett Durando, Denver Post $$)\nOn to the Links!\nI’m not crying.\nYesterday at Rock M\n- It’s never too early for wrestling content: NCAA Wrestling: Mizzou Home Dual Breakdown\nMore Links:\nHoops\n- Hoopers on the way! Come home, Jordan!\n- Trent is on his way (per IG stories)\n- John Tonje incoming\n- Anthony Robinson said his goodbyes\nFootball\n- St. Louis Post-Dispatch: SEC settles on eight-game conference football schedule for 2024, eliminates divisions (Dave Matter) | SEC settles on eight-game conference football schedule for 2024, eliminates divisions (Matter) | Read Matter’s subscriber chat | Mizzou’s Eli Drinkwitz heats up talkin’ season at SEC meetings: Eye on the Tigers podcast (Matter & BenFred) | Per Dave, this is what the 2024 schedule WAS going to look like. Changes incoming.\n- Associated Press: Transfer portal tampering frustrates SEC coaches, but few — if any — ideas on how to stop it (Ralph Russo)\n- PowerMizzou: OL target Kavion Broussard has Missouri high on his list after visit (Sean Williams) | Upside and downside: Wide Receivers (Jarod Hamilton) | Catching up with 2025 forward Caleb Wilson at Nike EYBL\n- Here’s how the Rock M Godfather feels about the SEC scheduling news....\n- The Brotherhood\n- The rookies have arrived. One of the first items on their list? A student ID!\nOther Mizzou Sports\n- TRACK & FIELD (via MUTIGERS): Watch this fantastic visual story called “Running with Revord” about Reilly, McKenna and Colby Revord of Mizzou Cross Country | Reed, Nachev Named to 2023 SEC Community Service Team\n- VOLLEYBALL: Dawn Sullivan announced the signing of four freshmen for the 2023 campaign, per MUTigers.com. Welcome to Tatum Longnecker (5’7 setter), Chapel Dobbs (6’1 outsider hitter/right side hitter), Kaylen Rush (5-7 defensive specialist/libero from CoMo) and Sierra Dudley (6’1 setter) | More from Missourian staff\nThe four freshmen will join transfers Maya Sands, Naomi Franco, Luisa Vilaca, Sarah White, Kimani Johnson, Dilara Gedikoglu, and Colleen Finney on the 2023 roster along with returners Jordan Iliff, Lauren Forbes, Morgan Isenberg, Estella Zatechka, Madilyn Sell, and Janet deMarrais.\n- TIGERSTYLE: Oh, wow. This is going to look so good in Hearnes.\n- SWIM & DIVE: I believe the women’s team wins the highest team GPA of the semester. W-O-W.\n- BASEBALL: So... it’d be really great if MU could get a new coach soon before there’s no team left. Three key Mizzou baseball pitchers reportedly enter transfer portal (Calum McAndrew)\n- And if you’d like to read a very sobering portrait of how far Mizzou is behind in the SEC.\n- SOCCER / SOFTBALL COLLAB (featuring Rachel Kutella and Cierra Harrison)\n- SOFTBALL: Larissa and her fellow NFCA members and some HOFers to check out the Women’s College World Series. LA is with the head coaches from Michigan, Columbia and Nebraska. Still waiting on who that bat signal is for, Coach! (I know who it is but I’m not stealing the athlete’s announcement thunder)\nFormer Tigers\n- xx\nIf you’re looking to sign up for ESPN+, Rock M Nation now has an affiliate link: click Here for ESPN+ Now!\nIf you’re looking to sign up for a new streaming service, you can try FuboTV: click HERE for FuboTV access — FuboTV now has ESPN, CBS, FS1 and more sports channels.\n(** RockMNation has affiliate partnerships. These do not influence editorial content, though RockMNation may earn commissions for products purchased via affiliate links.**)",
  "word_count": 2138,
  "scraped_at": "2026-02-14T12:14:55.280503"
}