{
  "article_id": "5120ea90b453",
  "url": "https://www.kidderminstershuttle.co.uk/news/24723522.breach-relishing-role-south-coast-trailblazer-ahead-world-cup/",
  "title": "Breach relishing role as south coast trailblazer ahead of World Cup",
  "date": "20241114T130000Z",
  "domain": "kidderminstershuttle.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Jess Breach is hoping the Red Roses can emulate the Lionesses and propel their sport to even greater heights at the Women's Rugby World Cup 2025.\nThe Saracens star was present for the re-naming of Brighton Beach into 'Brighton Breach' in an activation aimed to further capture the public’s attention for next year’s tournament.\nMarked by a large sign and rugby posts, the name change is in honour of Breach as an icon of Sussex sporting excellence as well as a means to create intrigue and draw attention to Brighton as one of the tournament's host cities.\nThe Brighton & Hove Albion Stadium will be centre stage for two group stage fixtures during the Women’s Rugby World Cup - England vs Australia and New Zealand vs Ireland - and Breach is banking on a home tournament to inspire a new wave of rugby fans across the country.\n“I never thought something would be named after me, not at all but that's what makes it so special,” said Breach. “It's really cool, especially with me being from Sussex.\n“I played in Brighton when I was young from U12s to U15s so hopefully it'll be a good impact for the girls who can play down here in Sussex and hopefully they can come to a game and watch us play.\n“It should be a really big tournament for England as a team but also as a country - hopefully we can push rugby and women's rugby in the right direction.\n“We've done that well so far but hopefully this'll push it even more. I think you could see it from Euro 2022 with the Lionesses, they had a huge impact having a home tournament and hopefully we can do the same.”\nAlso in attendance was 2014 Rugby World Cup winner and former Red Rose Rachael Burford, who echoed her former teammate's words in hoping a home tournament will inspire a new generation of rugby fans and grow the sport like never before.\nShe said: “How iconic having a beach named after you. The 'Brighton Breach'. You can just feel like doing these activations create more eyeballs and more awareness and curiosity at what's coming around the corner next year so it's really exciting.\n“There's no question a home tournament's going to have a massive impact. We've seen what's happened with women's football at the Euros and how impactful and we saw both on and off the pitch what that can do and the opportunities that can create.\n“Having a home World Cup can unlock new fans, get new people and new investment into our sport and taking part is one thing but there are so many other areas people can get involved in.\n“Hopefully this World Cup can open up opportunities to people that might not know existed before. I've certainly seen it when we came back from France in 2014, the amount of interest and excitement and new people who got into the game.”\n“I have no doubt this will be the exact same.\nOver 100,000 tickets have been applied for in the first week of the ticket application phase, on top of the 130,000 tickets already sold in the presale, with the tournament on track to match World Rugby's ambitions of the biggest celebration of women's rugby there has ever been.\nMP UK Minister for Sport, Media, Civil Society and Youth Stephanie Peacock said \"We can’t wait to welcome the Women's Rugby World Cup to England in 2025. The event is set to be a generational moment for rugby and for women’s sport in this country.\n\"The record setting ticket applications show the huge appetite for women’s sport in the UK and this Government is committed to supporting women and girls to play rugby, or whatever sport they choose.\"\nCouncillor Alan Robins, Cabinet member for Sport & Recreation, said: “It's really exciting. Everyone in the city's excitement is building now. It's less than a year away now and it's really fantastic to see interest and excitement build like that across the whole city.\n“Hopefully it will grow rugby as a sport in the city and show women's rugby as a sport that's perfect for girls and women and encourage people to take up any sport.”\nThe Women’s Rugby World Cup England 2025 gets underway at the Stadium of Light in Sunderland on Friday 22 August and runs until 27th September. Don’t miss out! General sale ticket applications for all matches are available until 11:00 (GMT) 19 November 2024. Visit tickets.rugbyworldcup.com",
  "word_count": 750,
  "scraped_at": "2026-02-14T13:05:22.184621"
}