{
  "article_id": "5161f16bf67c",
  "url": "https://www.90min.com/man-utd-turf-out-womens-team-ishock-move-future-hangs-in-balance",
  "title": "Man Utd turf out women team in shock move as club future hangs in the balance",
  "date": "20240626T110000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Man Utd turf out women's team in shock move as club's future hangs in the balance\n- Man Utd's women's team forced into portable training facilities while men's squad move in\n- Renovation work to last the entirety of next season\n- The club's co-chair has already come under fire for disregarding the women's side\nManchester United Women have been forced into portable buildings at the club’s training complex for the 2024/25 season to make way for the men’s team, while their facilities undergo a revamp.\nRenovation work started this week at the club’s Carrington training complex as part of a £50m investment. Plans for the revamp were announced earlier this month, with United stating that all areas of the men’s building were \"being refurbished to deliver a world-class football facility with a positive culture to support future success\".\nThe building works aren't expected to be complete until the end of the 2024/25 season, the Guardian has revealed. As part of these changes, portable buildings will be used for changing rooms, team meeting rooms, office spaces and communal areas for the women’s players and staff. However, they will use the same pitches and canteen.\nThe news is another disappointing blow for players, staff and fans at United, after co-chair Sir Jim Ratcliffe came under fire earlier this week for admitting to having not finalised plans for the future of the women’s team. Understandably, the comments received a huge amount of backlash from the football community.\nThis, coupled with the turfing out of the women’s team from their training facilities only reinforces Ratcliffe’s blatant disregard for the women’s squad. It’s understood that United considered many options before making the decision, and that the move to portable buildings was preferred over relocating the team to a different site where the quality of the training pitches, and fitness and nutrition facilities would not have been as high.\nA source close to the squad told the Guardian the decision has added to a growing sense that the women’s team are not perceived as a priority within the club. There is no doubt the decision is likely to also warn off any players who were potentially interested in signing with the club during the summer transfer window.\nWith the club’s future so uncertain, it’s no surprise that reports emerged on Tuesday that United goalkeeper Mary Earps is close to completing a deal with PSG. 90min reported earlier this month that PSG are willing to do 'whatever it takes' to sign the 31-year-old this summer.\nDespite being crowned winners of the FA Cup in May, United had one of their worst ever finishes in the Women’s Super League last season. As tensions disgruntlement grows inside the club off the back of a below average performance, it’s expected more players are likely to follow in Earps’ footsteps.\nLucia Garcia and Nikita Parris are both out of contract this summer, and are likely to depart during the transfer window, according to the Daily Mail.",
  "word_count": 496,
  "scraped_at": "2026-02-14T12:32:21.768105"
}