{
  "article_id": "5164b0bf2474",
  "url": "https://www.rte.ie/brainstorm/2025/0722/1294332-gaa-clubs-community-society-culture/",
  "title": "  Pride of place : GAA clubs and the community around them",
  "date": "20250722T160000Z",
  "domain": "rte.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Opinion: the identity, traditions and heritage around GAA clubs often allows the local community feel a true sense of belonging\nThe French word terroir regularly crops up in the world of food studies. Originally a wine term, it usually refers to the complex interplay between the natural elements of soil, aspect and climate that influence any viticultural site. According to many foodies, this is what gives a food or drink its sense of place.\nBut the word can evoke something much more fundamental. Amy Trubek, author of The Taste of Place: A Cultural Journey into Terroir, insists that culture, in the form of a group's identity, traditions and heritage in relation to place, must also be part of any consideration of terroir.\nThe impact of the recent pandemic has shown us that the concept can also apply outside the food world and that institutions like the GAA regularly demonstrate their sense of terroir. This has been especially noticeable recently. Because of Covid, many children and adults have had the experience of staring at pristine pitches behind locked gates festooned with yellow and black covid warning signs.\nWe need your consent to load this rte-player contentWe use rte-player to manage extra content that can set cookies on your device and collect data about your activity. Please review their details and accept them to load the content.Manage Preferences\nFrom RTÉ Radio 1's Countrywide, report on how GAA clubs in Finland, Oman and Australia are getting back to business after the pandemic\nThankfully, we have moved beyond these difficulties (for now). Many of our GAA club strongholds owe their recovery and success to the hard work of a small cohort of dedicated men and women. Terroir people might be an apt moniker for such a group. I know some of these terroir people because my own upbringing in Co Dublin exposed me to their positive influence.\nSituated on the very outskirts of the county just off the busy M7, Newcastle is very different now from the small village I grew up in. With its picture-postcard thatched pub, church and old village school, this was a place steeped in the GAA. I spent many happy years wearing the St Finians' club jersey before leaving for London in my early twenties.\nWhen I started in the 1970s, there was no clubhouse to speak of and players would change in a dilapidated wooden shed in the darkest corner of the field. There was always a pungent smell of wintergreen in the air, an elixir used to keep bare legs warm in cold weather.\nWe need your consent to load this rte-player contentWe use rte-player to manage extra content that can set cookies on your device and collect data about your activity. Please review their details and accept them to load the content.Manage Preferences\nFrom RTÉ News, a new GAA club debuts in east Belfast in 2020\nThe field was exactly that, a single field, located behind the now closed Gondola pub on Newcastle’s Main Street. It was on loan from a benevolent local and cattle were sometimes allowed to graze there. Frequently, players were forced to weave between manure as well as opposition during games. Later, the club moved to much better surroundings on Aylmer Road, but it is the old field that bears the strongest memories of those early years.\nMatch days were a village affair and support came from near and far. The opposition were sometimes better prepared and, in truth, often had better players, but we were proud to play for St Finians. That sense of team pride stemmed from our relationship with our club, and it was the people from that club that made us strong.\nThey were special people who gave the club its identity, its sense of terroir, by giving of their time and dedication. Names like Harney, Dunbar and Fitzgibbon, ring loud in collective memories as local GAA pillars who underpinned the very existence of that club. They ran teams, organised the club, chaired meetings and fundraised. Above all, they encouraged players to be proud of the club, the village and their place.\nWe need your consent to load this rte-player contentWe use rte-player to manage extra content that can set cookies on your device and collect data about your activity. Please review their details and accept them to load the content.Manage Preferences\nFrom RTÉ 2fm's Game On, Roscommon Padraig Pearses footballer Niall Daly and Tipperary Borris-Ileigh hurler Brendan Maher on role GAA clubs play in communities\nAs with many smaller Dublin clubs back then, a shortage of players sometimes led to younger club members being drafted into battle as part of more senior teams. To less experienced eyes, these senior players were giants of the club, men who played with fearsome aggression. The younger conscripts were energetic and nimble, but they were also nervous. GAA football in 1980s' Dublin was no place for reticence and was frequently peopled by players who felt their advantage lay more with their fists than their feet. Referees were more lenient back then and there seemed to be less rules.\nBut the younger cohorts were protected. If things got rough, and they sometimes did, these guardians, these terroir people, would step forward and form tree-like cordons around any threatened younger player. It was made clear to potential aggressors that this was a club, a single entity, that always stuck together.\nNewcastle village changed dramatically during the Celtic Tiger years. Some say that dramatic growth weakened its sense of place and it has been assimilated into a bigger, more industrial Dublin collective. There may be some truth in that and it now takes a real local to recognise the old village outline among the surrounding Celtic Tiger developments.\nWe need your consent to load this rte-player contentWe use rte-player to manage extra content that can set cookies on your device and collect data about your activity. Please review their details and accept them to load the content.Manage Preferences\nFrom RTÉ's GAA podcast, former Tyrone All-Star Midfielder Sean Cavanagh on how All-Ireland Intermediate Club Championship winners Moy can be a model for inspiration for Northern Ireland politicians\nThankfully, though, the community remains as strong as ever. St Finian’s GAA club is thriving, with an expanded range of women’s, men’s and juvenile teams. Nowadays, most GAA clubs have a multitude of dedicated mothers and fathers, who give of their time freely every week to help out in the interests of their local community. These volunteers are crucial to every GAA club’s survival.\nBut sometimes if you look closely enough, some very lucky clubs also have a small cohort of terroir people who are the incarnation of the spirit of the place. Long after their own children have grown up and others, like me, have moved far away, these special men and women continue to maintain the beating heart of their local GAA club.\nLike the turf beneath their feet, they remain a club constant. They quietly go about their work - running teams, organising, chairing and fundraising. Most importantly, they nurture a club tradition rooted in a pride of place that allows players, supporters and even those of us who have long since departed to still feel a true sense of belonging, a true sense of terroir.\nThe views expressed here are those of the author and do not represent or reflect the views of RTÉ",
  "word_count": 1230,
  "scraped_at": "2026-02-14T12:12:38.764488"
}