{
  "article_id": "516b997329e9",
  "url": "https://www.ocregister.com/2024/12/10/angel-city-fc-goalkeeper-didi-haracic-not-returning/",
  "title": "Angel City Football Club goalkeeper DiDi Haračić among players not returning for next season",
  "date": "20241210T233000Z",
  "domain": "ocregister.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Angel City Football Club, which has already made big news this offseason with the departures of General Manager Angel Hucles Mangano and Coach Becki Tweed, announced an end-of-season roster update.\nTuesday was the deadline for NWSL teams to do so.\nGoalkeeper DiDi Haračić and defender Jasmyne Spencer, who have been with the club since the beginning, are free agents and will not be returning. Haračić became Angel City’s No. 1 goalkeeper from the outset and made 62 appearances.\nIn an Instagram post, Haračić said farewell to the fans and her teammates\n“LA, I will miss you. Thank your for always showing up and cheering us on but most importantly thank you for being you. You will always have a place in my heart.\n“To my teammates, thank you for always having my back. Thank you for being strong, amazing women who young athletes can look up to. Thank you for making me better not only as an athlete, but as a human. I love you all. Thank you against LA for welcoming me with open arms.”\nSpencer appeared in 57 games in her time with Angel City. Midfielder Meggie Dougherty Howard and forward Katie Johnson will also not be returning.\nHoward was acquired in a trade with San Diego Wave FC before last season and made 18 appearances.\nThe club did add that it is in “ongoing negotiations” with forward Christen Press. The former U.S. national team star, who returned after a long recovery from ACL surgery, is a free agent.\nDefender Vanessa Gilles, who has been on loan with Lyon in France, is expected to rejoin Angel City when the loan expires June 30.\nAs of now, Angel City has 20 players on the roster, with Ali Riley and Jun Endo still carrying “season-ending injury” status.\nClaire Emslie (through 2026) and Sydney Leroux (through 2027) have signed contract extensions.\nAngel City FC current roster\nGoalkeepers: Angelina Anderson, Hannah Stambaugh\nDefenders: Elizabeth Eddy, Vanessa Gilles (on loan), Sarah Gorden, Megan Reid, Ali Riley (season-ending injury list), Gisele Thompson, M.A. Vignola\nMidfielders: Jun Endo (season-ending injury list), Kennedy Fuller (U-18), Madison Hammond, Lily Nabet, Rocky Rodríguez, Katie Zelem.\nForwards: Messiah Bright, Claire Emslie, Sydney Leroux, Casey Phair (U-18), Alyssa Thompson",
  "word_count": 369,
  "scraped_at": "2026-02-14T13:31:17.632340"
}